Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/architecture/binding_to_external_libraries.po
Languages: it

source: Modules
it: Moduli

source: The Summator example in :ref:`doc_custom_modules_in_cpp` is great for small, custom modules, but what if you want to use a larger, external library? Let's look at an example using `Festival <https://www.cstr.ed.ac.uk/projects/festival/>`_, a speech synthesis (text-to-speech) library written in C++.
it: L'esempio di Summator in :ref:`doc_custom_modules_in_cpp` è ottimo per piccoli moduli personalizzati, ma cosa succede se si desidera utilizzare una libreria esterna più grande? Diamo un'occhiata a un esempio che utilizza `Festival <https://www.cstr.ed.ac.uk/projects/festival/>`_, una libreria di sintesi vocale (text-to-speech) scritta in C++.

source: To bind to an external library, set up a module directory similar to the Summator example:
it: Per associare una libreria esterna, configurare un modulo simile all'esempio di Summator:

source: Next, you will create a header file with a TTS class:
it: Successivamente, si creerà un file di intestazione con una classe TTS:

source: And then you'll add the cpp file.
it: E poi si aggiungerà il file cpp.

source: Just as before, the new class needs to be registered somehow, so two more files need to be created:
it: Proprio come prima, la nuova classe si deve registrare in qualche modo, quindi è necessario creare altri due file:

source: These files must be in the top-level folder of your module (next to your ``SCsub`` and ``config.py`` files) for the module to be registered properly.
it: Questi file devono trovarsi nella cartella di livello superiore del modulo (accanto ai file ``SCsub`` e ``config.py``) affinché il modulo sia registrato correttamente.

source: These files should contain the following:
it: Questi file dovrebbero contenere quanto segue:

source: Next, you need to create an ``SCsub`` file so the build system compiles this module:
it: Successivamente, è necessario creare un file ``SCsub`` in modo che il sistema di compilazione compili questo modulo:

source: You'll need to install the external library on your machine to get the .a library files. See the library's official documentation for specific instructions on how to do this for your operation system. We've included the installation commands for Linux below, for reference.
it: È necessario installare la libreria esterna sul computer per ottenere i file .a della libreria. Consultare la documentazione ufficiale della libreria per istruzioni specifiche su come eseguire questa operazione per il proprio sistema operativo. Di seguito abbiamo incluso i comandi di installazione per Linux, come riferimento.

source: The voices that Festival uses (and any other potential external/3rd-party resource) all have varying licenses and terms of use; some (if not most) of them may be be problematic with Godot, even if the Festival Library itself is MIT License compatible. Please be sure to check the licenses and terms of use.
it: Le voci utilizzate da Festival (e qualsiasi altra potenziale risorsa esterna/di terze parti) hanno varie licenze e termini d'uso; alcune (se non la maggior parte) potrebbero presentare problemi con Godot, anche se la libreria Festival stessa è compatibile con la licenza MIT. Si prega di verificare le licenze e i termini d'uso.

source: The external library will also need to be installed inside your module to make the source files accessible to the compiler, while also keeping the module code self-contained. The festival and speech_tools libraries can be installed from the modules/tts/ directory via git using the following commands:
it: Sarà necessario installare la libreria esterna anche all'interno del modulo per rendere i file sorgente accessibili al compilatore, mantenendo autonomo allo stesso tempo il codice del modulo. Le librerie festival e speech_tools si possono installare dalla cartella modules/tts/ tramite git attraverso i seguenti comandi:

source: If you don't want the external repository source files committed to your repository, you can link to them instead by adding them as submodules (from within the modules/tts/ directory), as seen below:
it: Se non si desidera che i file sorgente del repository esterno siano salvati nel proprio repository, è possibile collegarti ad essi aggiungendoli come sotto-moduli (dall'interno della cartella modules/tts/), come mostrato di seguito:

source: Please note that Git submodules are not used in the Godot repository. If you are developing a module to be merged into the main Godot repository, you should not use submodules. If your module doesn't get merged in, you can always try to implement the external library as a GDExtension.
it: Si prega di notare che i sotto-moduli Git non vengono utilizzati nel repository Godot. Se si sta sviluppando un modulo da integrare nel repository Godot principale, non si dovrebbero utilizzare i sotto-moduli. Se il modulo non è integrato, è sempre possibile provare a implementare la libreria esterna sotto forma di una GDExtension.

source: To add include directories for the compiler to look at you can append it to the environment's paths:
it: Per aggiungere cartelle di inclusione che il compilatore può esaminare, è possibile aggiungerle ai percorsi dell'ambiente:

source: If you want to add custom compiler flags when building your module, you need to clone `env` first, so it won't add those flags to whole Godot build (which can cause errors). Example `SCsub` with custom flags:
it: Se si desidera aggiungere flag personalizzati al compilatore durante la compilazione del modulo, è necessario prima clonare `env`, affinché non aggiunga quei flag all'intera compilazione di Godot (il che potrebbe causare errori). `SCsub` di esempio con flag personalizzati:

source: The final module should look like this:
it: Il modulo finale dovrebbe apparire così:

source: Using the module
it: Utilizzare il modulo

source: You can now use your newly created module from any script:
it: Ora è possibile utilizzare il modulo appena creato da qualsiasi script:

source: And the output will be ``is_spoken: True`` if the text is spoken.
it: E il risultato sarà ``is_spoken: True`` se il testo è pronunciato.
