Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/architecture/core_types.po
Languages: ga, ta, uk

source: Values can be of any Variant type. No static typing is imposed. Uses shared reference counting, similar to ``std::shared_ptr``. Uses Vector<Variant> internally.
ta: மதிப்புகள் எந்த மாறுபட்ட வகையிலும் இருக்கலாம். நிலையான தட்டச்சு எதுவும் விதிக்கப்படவில்லை. `` Std :: stared_ptr`` போன்ற பகிரப்பட்ட குறிப்பு எண்ணிக்கையைப் பயன்படுத்துகிறது. திசையன் <மாறுபாடு> உள்நாட்டில் பயன்படுத்துகிறது.
uk: Значення можуть бути будь-якого типу Variant. Статична типізація не нав'язана. Використовується спільний підрахунок посилань, подібно до ``std::shared_ptr``. Використовує Vector<Variant> внутрішньо.

source: Subclass of ``Array`` but with static typing for its elements. Not to be confused with ``Packed*Array``, which is internally a ``Vector``.
ta: `` வரிசை`` இன் துணைப்பிரிவு ஆனால் அதன் கூறுகளுக்கு நிலையான தட்டச்சு மூலம். `` பேக் செய்யப்பட்ட*வரிசை`` உடன் குழப்பமடையக்கூடாது, இது உள்நாட்டில் ஒரு `` திசையன்``.
uk: Підклас ``Array``, але зі статичним типізуванням для його елементів. Не плутати з ``Packed*Array``, який внутрішньо є ``Vector``.

source: |packed_array| 📜
ta: | பேக்_அரே | .

source: Alias of ``Vector``, e.g. ``PackedColorArray = Vector<Color>``. Only a limited list of packed array types are available (use ``TypedArray`` otherwise).
ta: `` திசையன்``, எ.கா. `` பேக்அலோரர் = திசையன் <வண்ணம்> ``. நிரம்பிய வரிசை வகைகளின் வரையறுக்கப்பட்ட பட்டியல் மட்டுமே கிடைக்கிறது (இல்லையெனில் `` தட்டச்சு ஏற்பாடு` ஐப் பயன்படுத்தவும்).
uk: Псевдонім ``Vector``, наприклад, ``PackedColorArray = Vector<Color>``. Доступний лише обмежений список типів упакованих масивів (інакше використовуйте ``TypedArray``).

source: |list|
ta: | பட்டியல் |

source: Linked list type. Generally slower than other array/vector types. Prefer using other types in new code, unless using ``List`` avoids the need for type conversions.
ta: இணைக்கப்பட்ட பட்டியல் வகை. பொதுவாக மற்ற வரிசை/திசையன் வகைகளை விட மெதுவாக. `` பட்டியல்`` ஐப் பயன்படுத்துவதைத் தவிர்க்காவிட்டால், புதிய குறியீட்டில் பிற வகைகளைப் பயன்படுத்த விரும்புங்கள்.
uk: Тип зв'язаного списку. Зазвичай повільніший за інші типи масивів/векторів. Віддавайте перевагу використанню інших типів у новому коді, окрім випадків, коли використання ``List`` дозволяє уникнути необхідності перетворення типів.

source: |fixed_vector|
ta: | நிலையான_வெக்டர் |

source: ``std::array``
ta: `` std :: வரிசை``

source: Vector with a fixed capacity (more similar to ``boost::container::static_vector``). This container type is more efficient than other vector-like types because it makes no heap allocations.
ta: ஒரு நிலையான திறன் கொண்ட திசையன் (`` பூச்ட் :: கொள்கலன் :: static_vector`` க்கு ஒத்ததாக). இந்த கொள்கலன் வகை மற்ற திசையன் போன்ற வகைகளை விட மிகவும் திறமையானது, ஏனெனில் இது குவியல் ஒதுக்கீட்டை ஏற்படுத்தாது.
uk: Вектор з фіксованою ємністю (більш схожий на ``boost::container::static_vector``). Цей тип контейнера є ефективнішим за інші вектороподібні типи, оскільки він не виконує виділення пам'яті купи.

source: |span|
ta: | ச்பான் |

source: Uses a `red-black tree <https://en.wikipedia.org/wiki/Red-black_tree>`__ for faster access.
ta: `சிவப்பு-கருப்பு மரம் <https://en.wikipedia.org/wiki/red-black_tree> __ வேகமான அணுகலுக்கு பயன்படுத்துகிறது.
uk: Використовує `червоно-чорне дерево <https://en.wikipedia.org/wiki/Red-black_tree>`__ для швидшого доступу.

source: Uses copy-on-write (COW) semantics. This means it's generally slower but can be copied around almost for free. The performance benefits of ``VSet`` aren't established, so prefer using other types.
ta: நகல்-எழுதும் (மாடு) சொற்பொருளைப் பயன்படுத்துகிறது. இதன் பொருள் இது பொதுவாக மெதுவாக உள்ளது, ஆனால் கிட்டத்தட்ட இலவசமாக நகலெடுக்க முடியும். `` Vset`` இன் செயல்திறன் நன்மைகள் நிறுவப்படவில்லை, எனவே பிற வகைகளைப் பயன்படுத்த விரும்புகின்றன.
uk: Використовує семантику копіювання під час запису (COW). Це означає, що він загалом повільніший, але його можна копіювати майже безкоштовно. Переваги ``VSet`` у продуктивності не встановлені, тому перевагу надають іншим типам.

source: Defensive (robust but slow) map type. Preserves insertion order. Pointers to keys and values, as well as iterators, are stable under mutation. Use this map type when either of these affordances are needed. Use ``AHashMap`` otherwise.
ta: தற்காப்பு (வலுவான ஆனால் மெதுவான) வரைபட வகை. செருகும் வரிசையை பாதுகாக்கிறது. விசைகள் மற்றும் மதிப்புகளுக்கான சுட்டிகள், அத்துடன் மறு செய்கைகள், பிறழ்வின் கீழ் நிலையானவை. இந்த செலவினங்களில் ஒன்று தேவைப்படும்போது இந்த வரைபட வகையைப் பயன்படுத்தவும். இல்லையெனில் `` அஆச்மாப்`` ஐப் பயன்படுத்தவும்.
uk: Захисний (надійний, але повільний) тип карти. Зберігає порядок вставки. Вказівники на ключі та значення, а також ітератори, стабільні при змінах. Використовуйте цей тип карти, коли потрібна будь-яка з цих можливостей. В іншому випадку використовуйте ``AHashMap``.

source: |dictionary| 📜
ta: | அகராதி | .

source: Keys and values can be of any Variant type. No static typing is imposed. Uses shared reference counting, similar to ``std::shared_ptr``. Preserves insertion order. Uses ``HashMap<Variant>`` internally.
ta: விசைகள் மற்றும் மதிப்புகள் எந்த மாறுபட்ட வகையிலும் இருக்கலாம். நிலையான தட்டச்சு எதுவும் விதிக்கப்படவில்லை. `` Std :: stared_ptr`` போன்ற பகிரப்பட்ட குறிப்பு எண்ணிக்கையைப் பயன்படுத்துகிறது. செருகும் வரிசையை பாதுகாக்கிறது. `` ஆச்மேப் <மாறுபாடு> `` உள்நாட்டில் பயன்படுத்துகிறது.
uk: Ключі та значення можуть бути будь-якого типу Variant. Статична типізація не нав'язана. Використовує спільний підрахунок посилань, подібно до ``std::shared_ptr``. Зберігає порядок вставки. Внутрішньо використовує ``HashMap<Variant>``.

source: Subclass of ``Dictionary`` but with static typing for its keys and values.
ta: `` அகராதி`` இன் துணைப்பிரிவு ஆனால் அதன் விசைகள் மற்றும் மதிப்புகளுக்கு நிலையான தட்டச்சு மூலம்.
uk: Підклас ``Dictionary``, але зі статичною типізацією для ключів та значень.

source: |pair|
ta: | இணை |

source: ``std::pair``
ta: `` std :: சோடி``

source: Math types
ga: cineálacha matamaitice
ta: கணித வகைகள்
uk: Типи математики

source: There are several linear math types available in the ``core/math`` directory:
ta: `` கோர்/கணிதம்`` கோப்பகத்தில் பல நேரியல் கணித வகைகள் உள்ளன:
uk: У каталозі ``core/math`` доступно кілька типів лінійної математики:

source: `core/math <https://github.com/godotengine/godot/tree/master/core/math>`__
ta: `கோர்/கணிதம் <https://github.com/godotengine/godot/tree/master/core/math> __ __ __
uk: `основний/математика <https://github.com/godotengine/godot/tree/master/core/math>`__

source: This is a special datatype used for storing paths in a scene tree and referencing them in an optimized manner:
ta: இது ஒரு காட்சி மரத்தில் பாதைகளை சேமித்து அவற்றை உகந்த முறையில் குறிப்பிடுவதற்கு பயன்படுத்தப்படும் ஒரு சிறப்பு தரவுத்தொகுப்பாகும்:
uk: Це спеціальний тип даних, який використовується для зберігання шляхів у дереві сцени та оптимізованого посилання на них:

source: RID
ga: FÁIL RÉIDH
ta: விடுங்கள்

source: RIDs are *Resource IDs*. Servers use these to reference data stored in them. RIDs are opaque, meaning that the data they reference can't be accessed directly. RIDs are unique, even for different types of referenced data:
ta: ரிட்ச் *வள ஐடிகள் *. அவற்றில் சேமிக்கப்பட்ட தரவைக் குறிப்பிட சேவையகங்கள் இவற்றைப் பயன்படுத்துகின்றன. ரிட்ச் ஒளிபுகா, அதாவது அவர்கள் குறிப்பிடும் தரவை நேரடியாக அணுக முடியாது. பல்வேறு வகையான குறிப்பிடப்பட்ட தரவுகளுக்கு கூட ரிட்ச் தனித்துவமானது:
uk: RID – це *ідентифікатори ресурсів*. Сервери використовують їх для посилання на дані, що зберігаються в них. RID непрозорі, тобто до даних, на які вони посилаються, не можна отримати безпосередній доступ. RID унікальні, навіть для різних типів даних, на які посилаються:

source: `core/templates/rid.h <https://github.com/godotengine/godot/blob/master/core/templates/rid.h>`__
ta: `கோர்/வார்ப்புருக்கள்/rid.h <https://github.com/godotengine/godot/blob/master/core/templates/rid.h> __ __> __ __

source: **Use this as the "default" string type.** ``String`` uses UTF-32 encoding to improve performance thanks to its fixed character size.
uk: **Використовуйте це як тип рядка «за замовчуванням».** ``String`` використовує кодування UTF-32 для покращення продуктивності завдяки фіксованому розміру символів.

source: Represents read-only access to a contiguous array without needing to copy any data. See `pull request description <https://github.com/godotengine/godot/pull/100293>`__ for details.
uk: Представляє доступ лише для читання до суміжного масиву без необхідності копіювання будь-яких даних. Див. опис запиту на зняття <https://github.com/godotengine/godot/pull/100293>`__ для отримання детальної інформації.

source: Uses a `red-black tree <https://en.wikipedia.org/wiki/Red-black-tree>`__ for faster access.
uk: Використовує `червоно-чорне дерево <https://en.wikipedia.org/wiki/Red-black-tree>`__ для швидшого доступу.

source: Stores a single key-value pair.
uk: Зберігає одну пару ключ-значення.

source: NodePath
ga: Cosán Nód
uk: Шлях до вузла
