Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/architecture/core_types.po
Languages: ga, ta, uk

source: Core types
ga: Cineálacha lárnacha
ta: மைய வகைகள்
uk: Типи сердечників

source: Godot has a rich set of classes and templates that compose its core, and everything is built upon them.
ga: Tá sraith saibhir ranganna agus teimpléid ag Godot a chumann a chroí, agus tá gach rud tógtha orthu.
ta: கோடோட் அதன் மையத்தை உருவாக்கும் வகுப்புகள் மற்றும் வார்ப்புருக்களின் பணக்கார தொகுப்பைக் கொண்டுள்ளது, மேலும் எல்லாமே அவை மீது கட்டமைக்கப்பட்டுள்ளன.
uk: Godot має багатий набір класів і шаблонів, які складають його ядро, і все побудовано на них.

source: This reference will try to list them in order for their better understanding.
ga: Déanfaidh an tagairt seo iarracht iad a liostáil d'fhonn tuiscint níos fearr a fháil.
ta: இந்த குறிப்பு அவர்களின் சிறந்த புரிதலுக்காக அவற்றை பட்டியலிட முயற்சிக்கும்.
uk: У цьому довіднику спробуємо перерахувати їх для кращого розуміння.

source: Definitions
ga: Sainmhínithe
ta: வரையறைகள்
uk: Визначення

source: Godot uses the standard C99 datatypes, such as ``uint8_t``, ``uint32_t``, ``int64_t``, etc. which are nowadays supported by every compiler. Reinventing the wheel for those is not fun, as it makes code more difficult to read.
ga: Úsáideann Godot na cineálacha sonraí caighdeánacha C99, mar shampla ``uint8_t``, `uint32_t``, `int64_t``, srl a thacaíonn gach tiomsaitheoir inniu. Ní spraoi é an roth dóibh siúd a athchruthú, mar go bhfágann sé níos deacra cód a léamh.
ta: கோடோட் `` uint8_t``, `` uint32_t``, `` int64_t`` போன்ற நிலையான C99 தரவுத்தொகுப்புகளைப் பயன்படுத்துகிறது, அவை இப்போதெல்லாம் ஒவ்வொரு தொகுப்பாளரால் ஆதரிக்கப்படுகின்றன. அவற்றுக்கான சக்கரத்தை மீண்டும் கண்டுபிடிப்பது வேடிக்கையானது அல்ல, ஏனெனில் இது குறியீட்டைப் படிக்க மிகவும் கடினமாக உள்ளது.
uk: Godot використовує стандартні типи даних C99, такі як ``uint8_t``, ``uint32_t``, ``int64_t`` тощо, які сьогодні підтримуються кожним компілятором. Перевинаходити колесо для них не весело, оскільки це ускладнює читання коду.

source: In general, care is not taken to use the most efficient datatype for a given task unless using large structures or arrays. ``int`` is used through most of the code unless necessary. This is done because nowadays every device has at least a 32-bit bus and can do such operations in one cycle. It makes code more readable too.
ta: பொதுவாக, பெரிய கட்டமைப்புகள் அல்லது வரிசைகளைப் பயன்படுத்தாவிட்டால் கொடுக்கப்பட்ட பணிக்கு மிகவும் திறமையான தரவுத்தொகுப்பைப் பயன்படுத்த கவனமாக இருக்காது. `` int`` தேவைப்படாவிட்டால் பெரும்பாலான குறியீட்டின் மூலம் பயன்படுத்தப்படுகிறது. இது செய்யப்படுகிறது, ஏனெனில் இப்போதெல்லாம் ஒவ்வொரு சாதனத்திலும் குறைந்தது 32 பிட் பச் உள்ளது, மேலும் இதுபோன்ற செயல்பாடுகளை ஒரு சுழற்சியில் செய்ய முடியும். இது குறியீட்டை மேலும் படிக்கக்கூடியதாக ஆக்குகிறது.
uk: Загалом, не вживається заходів для використання найефективнішого типу даних для даного завдання, окрім випадків використання великих структур або масивів. ``int`` використовується в більшій частині коду, якщо в цьому немає потреби. Це робиться тому, що в наш час кожен пристрій має щонайменше 32-бітну шину і може виконувати такі операції за один цикл. Це також робить код більш читабельним.

source: For files or memory sizes, ``size_t`` is used, which is guaranteed to be 64-bit.
ta: கோப்புகள் அல்லது நினைவக அளவுகளுக்கு, `` size_t`` பயன்படுத்தப்படுகிறது, இது 64-பிட் என்று பொறுப்பு அளிக்கப்படுகிறது.
uk: Для розмірів файлів або пам'яті використовується ``size_t``, який гарантовано має 64-бітний розмір.

source: For Unicode characters, CharType instead of wchar_t is used, because many architectures have 4 bytes long wchar_t, where 2 bytes might be desired. However, by default, this has not been forced and CharType maps directly to wchar_t.
ga: Maidir le carachtair Unicode, úsáidtear CharType in ionad wchar_t, toisc go bhfuil 4 bait wchar_t ar fad ag go leor ailtireachtaí, áit a bhféadfadh 2 baint a bheith ag teastáil. Mar sin féin, de réir réamhshocraithe, níor cuireadh iallach air seo agus déanann CharType léarscáil go díreach chuig wchar_t.
ta: யூனிகோட் எழுத்துக்களுக்கு, WCHAR_T க்கு பதிலாக சார்ட்டைப் பயன்படுத்தப்படுகிறது, ஏனெனில் பல கட்டமைப்புகள் 4 பைட்டுகள் நீளமான WCHAR_T ஐக் கொண்டுள்ளன, அங்கு 2 பைட்டுகள் விரும்பப்படலாம். இருப்பினும், இயல்புநிலையாக, இது கட்டாயப்படுத்தப்படவில்லை மற்றும் சார்ட்டைப் வரைபடங்களை நேரடியாக WCHAR_T க்கு.
uk: Для символів Unicode використовується CharType замість wchar_t, оскільки багато архітектур мають 4 байти wchar_t, де 2 байти можуть бути бажаними. Однак за замовчуванням це не було примусово, і CharType відображається безпосередньо на wchar_t.

source: `core/typedefs.h <https://github.com/godotengine/godot/blob/master/core/typedefs.h>`__
ta: `core/typedefs.h <https://github.com/godotengine/godot/blob/master/core/tybedefs.h> __ __> __

source: Memory model
ga: Múnla cuimhne
ta: நினைவக மாதிரி
uk: Модель пам'яті

source: PC is a wonderful architecture. Computers often have gigabytes of RAM, terabytes of storage and gigahertz of CPU, and when an application needs more resources the OS will swap out the inactive ones. Other architectures (like mobile or consoles) are in general more limited.
ga: Is ailtireacht iontach é PC. Is minic a bhíonn gigabait RAM, terabytes stórála agus gigahertz LAP ag ríomhairí, agus nuair a bhíonn níos mó acmhainní ag teastáil ó fheidhmchlár déanfaidh an OS na cinn neamhghníomhacha a mhalartú amach. Tá ailtireachtaí eile (cosúil le soghluaiste nó consóil) níos teoranta i gcoitinne.
ta: பிசி ஒரு அற்புதமான கட்டமைப்பு. கணினிகளில் பெரும்பாலும் சிகாபைட் ரேம், டெராபைட் சேமிப்பு மற்றும் சிபியு இன் சிகாஎர்ட்ச் ஆகியவை உள்ளன, மேலும் ஒரு பயன்பாட்டிற்கு அதிக ஆதாரங்கள் தேவைப்படும்போது OS செயலற்றவற்றை மாற்றும். பிற கட்டமைப்புகள் (மொபைல் அல்லது கன்சோல்கள் போன்றவை) பொதுவாக மிகவும் குறைவாகவே உள்ளன.
uk: ПК — чудова архітектура. Комп’ютери часто мають гігабайти оперативної пам’яті, терабайти пам’яті та гігагерці ЦП, і коли програмі потрібно більше ресурсів, ОС замінить неактивні. Інші архітектури (наприклад, мобільні або консолі) загалом більш обмежені.

source: The most common memory model is the heap, where an application will request a region of memory, and the underlying OS will try to fit it somewhere and return it. This often works best and is flexible, but over time and with abuse, this can lead to segmentation.
ga: Is é an tsamhail cuimhne is coitianta an carn, áit a n-iarrfaidh feidhmchlár réigiún cuimhne, agus déanfaidh an OS bunúsach iarracht é a fheistiú áit éigin agus é a thabhairt ar ais. Is minic a oibríonn sé seo is fearr agus tá sé solúbtha, ach le himeacht ama agus le mí-úsáid, d'fhéadfadh deighilt a bheith mar thoradh air seo.
ta: மிகவும் பொதுவான நினைவக மாதிரி குவியல் ஆகும், அங்கு ஒரு பயன்பாடு நினைவகத்தின் பகுதியைக் கோரும், மேலும் அடிப்படை OS அதை எங்காவது பொருத்தி திருப்பித் தர முயற்சிக்கும். இது பெரும்பாலும் சிறப்பாக செயல்படுகிறது மற்றும் நெகிழ்வானது, ஆனால் காலப்போக்கில் மற்றும் துச்பிரயோகத்துடன், இது பிரிவுக்கு வழிவகுக்கும்.
uk: Найпоширенішою моделлю пам’яті є купа, де програма запитує область пам’яті, а базова ОС намагатиметься її десь вмістити та повертати. Це часто працює найкраще та є гнучким, але з часом і через зловживання це може призвести до сегментації.

source: Segmentation slowly creates holes that are too small for most common allocations, so that memory is wasted. There is a lot of literature about heap and segmentation, so this topic will not be developed further here. Modern operating systems use paged memory, which helps mitigate the problem of segmentation but doesn't solve it.
ga: Cruthaíonn deighilt go mall poill atá ró-bheag do na leithdháiltí is coitianta, ionas go gcuirtear cuimhne amú. Tá go leor litríochta ann maidir le carn agus deighilt, mar sin ní dhéanfar an t-ábhar seo a fhorbairt tuilleadh anseo. Úsáideann córais oibriúcháin nua-aimseartha cuimhne leathanach, rud a chabhraíonn le fadhb na deighilte a mhaolú ach ní réitíonn sé í.
ta: பிரிவு மெதுவாக மிகவும் பொதுவான ஒதுக்கீடுகளுக்கு மிகச் சிறிய துளைகளை உருவாக்குகிறது, இதனால் நினைவகம் வீணாகிறது. குவியல் மற்றும் பிரிவு பற்றி நிறைய இலக்கியங்கள் உள்ளன, எனவே இந்த தலைப்பு இங்கு மேலும் உருவாக்கப்படாது. நவீன இயக்க முறைமைகள் பேச் நினைவகத்தைப் பயன்படுத்துகின்றன, இது பிரிவின் சிக்கலைத் தணிக்க உதவுகிறது, ஆனால் அதை தீர்க்காது.
uk: Сегментація повільно створює діри, які є занадто малими для більшості поширених розподілів, тому пам’ять витрачається даремно. Існує багато літератури про купу та сегментацію, тому ця тема не буде розвиватися далі. Сучасні операційні системи використовують сторінкову пам’ять, що допомагає пом’якшити проблему сегментації, але не вирішує її.

source: However, in many studies and tests, it is shown that given enough memory, if the maximum allocation size is below a given threshold in proportion to the maximum heap size and proportion of memory intended to be unused, segmentation will not be a problem over time as it will remain constant. In other words, leave 10-20% of your memory free and perform all small allocations and you are fine.
ga: Mar sin féin, i go leor staidéir agus tástálacha, léirítear go bhfuil go leor cuimhne, má tá an méid leithdháilte uasta faoi bhun tairseach ar leith i gcomhréir leis an uasmhéid carnán agus cion na cuimhne atá beartaithe a bheith in úsáid, ní fadhb í deighilt le himeacht ama mar go bhfanfaidh sé seasmhach. Is é sin le rá, fág 10-20% de do chuimhne saor in aisce agus déan gach leithdháileadh beag agus tá tú go breá.
ta: இருப்பினும், பல ஆய்வுகள் மற்றும் சோதனைகளில், அதிகபட்ச ஒதுக்கீடு அளவு கொடுக்கப்பட்ட வாசலுக்குக் கீழே இருந்தால், அதிகபட்ச குவியல் அளவு மற்றும் பயன்படுத்தப்படாத நினைவகத்தின் விகிதத்திற்கு விகிதத்தில் கொடுக்கப்பட்ட வாசலுக்குக் கீழே இருந்தால், பிரித்தல் காலப்போக்கில் ஒரு பிரச்சினையாக இருக்காது அது மாறாமல் இருக்கும். வேறு வார்த்தைகளில் கூறுவதானால், உங்கள் நினைவகத்தின் 10-20% ஐ இலவசமாக விட்டுவிட்டு, அனைத்து சிறிய ஒதுக்கீடுகளையும் செய்யுங்கள், நீங்கள் நன்றாக இருக்கிறீர்கள்.
uk: Однак у багатьох дослідженнях і тестах було показано, що за наявності достатньої кількості пам’яті, якщо максимальний розмір виділення нижче заданого порогу пропорційно максимальному розміру купи та частці пам’яті, яка має бути невикористаною, сегментація не буде проблемою з часом. оскільки він залишатиметься постійним. Іншими словами, залиште 10-20% пам’яті вільною та виконайте всі невеликі розподіли, і все гаразд.

source: Godot ensures that all objects that can be allocated dynamically are small (less than a few kB at most). But what happens if an allocation is too large (like an image or mesh geometry or large array)? In this case Godot has the option to use a dynamic memory pool. This memory needs to be locked to be accessed, and if an allocation runs out of memory, the pool will be rearranged and compacted on demand. Depending on the need of the game, the programmer can configure the dynamic memory pool size.
ta: மாறும் வகையில் ஒதுக்கக்கூடிய அனைத்து பொருட்களும் சிறியவை என்பதை கோடோட் உறுதி செய்கிறது (அதிகபட்சம் ஒரு சில KB க்கும் குறைவானது). ஒரு ஒதுக்கீடு மிகப் பெரியதாக இருந்தால் (ஒரு படம் அல்லது கண்ணி வடிவியல் அல்லது பெரிய வரிசை போன்றவை) என்ன ஆகும்? இந்த வழக்கில் கோடோட் ஒரு மாறும் நினைவக குளத்தைப் பயன்படுத்த விருப்பம் உள்ளது. இந்த நினைவகத்தை அணுக பூட்டப்பட வேண்டும், மேலும் ஒரு ஒதுக்கீடு நினைவகத்திலிருந்து வெளியேறினால், குளம் மறுசீரமைக்கப்பட்டு தேவைக்கேற்ப சுருக்கப்படும். விளையாட்டின் தேவையைப் பொறுத்து, புரோகிராமர் மாறும் நினைவக பூல் அளவை உள்ளமைக்க முடியும்.
uk: Godot гарантує, що всі об'єкти, які можна розподілити динамічно, є малими (щонайбільше менше кількох кБ). Але що станеться, якщо розподіл занадто великий (наприклад, зображення, геометрія сітки або великий масив)? У цьому випадку Godot має можливість використовувати динамічний пул пам'яті. Цю пам'ять потрібно заблокувати для доступу, і якщо розподіл вичерпає пам'ять, пул буде переупорядковано та стиснуто на вимогу. Залежно від потреб гри, програміст може налаштувати розмір динамічного пулу пам'яті.

source: Allocating memory
ga: Cuimhne a leithdhá
ta: நினைவகத்தை ஒதுக்குகிறது
uk: Виділення пам'яті

source: Godot has many tools for tracking memory usage in a game, especially during debug. Because of this, the regular C and C++ library calls should not be used. Instead, a few other ones are provided.
ga: Tá go leor uirlisí ag Godot chun úsáid cuimhne a rianú i gcluiche, go háirithe le linn dífhabhtú. Mar gheall air seo, níor cheart na glaonna leabharlainne rialta C agus C ++ a úsáid. Ina áit sin, cuirtear cúpla ceann eile ar fáil.
ta: ஒரு விளையாட்டில் நினைவக பயன்பாட்டைக் கண்காணிக்க கோடோட் பல கருவிகளைக் கொண்டுள்ளது, குறிப்பாக பிழைத்திருத்தத்தின் போது. இதன் காரணமாக, வழக்கமான சி மற்றும் சி ++ நூலக அழைப்புகள் பயன்படுத்தப்படக்கூடாது. அதற்கு பதிலாக, இன்னும் சில வழங்கப்படுகின்றன.
uk: Godot має багато інструментів для відстеження використання пам’яті в грі, особливо під час налагодження. Через це не слід використовувати звичайні виклики бібліотек C і C++. Натомість надано кілька інших.

source: For C-style allocation, Godot provides a few macros:
ga: Maidir le leithdháileadh i stíl C, soláthraíonn Godot cúpla macros:
ta: சி-பாணி ஒதுக்கீட்டிற்கு, கோடோட் ஒரு சில மேக்ரோக்களை வழங்குகிறது:
uk: Для розподілу в стилі C Godot надає кілька макросів:

source: These are equivalent to the usual ``malloc()``, ``realloc()``, and ``free()`` of the C standard library.
ta: இவை வழக்கமான `` மல்லோக் () ``, `` ரியல் மக்கள் () ``, மற்றும் சி நிலையான நூலகத்தின் `` இலவச () `` ஆகியவற்றுக்கு சமமானவை.
uk: Вони еквівалентні звичайним функціям ``malloc()``, ``realloc()`` та ``free()`` зі стандартної бібліотеки C.

source: For C++-style allocation, special macros are provided:
ga: Maidir le leithdháileadh i stíl C ++, cuirtear macraí speisialta ar fáil:
ta: சி ++-பாணி ஒதுக்கீட்டிற்கு, சிறப்பு மேக்ரோக்கள் வழங்கப்படுகின்றன:
uk: Для розподілу в стилі C++ передбачені спеціальні макроси:

source: These are equivalent to ``new``, ``delete``, ``new[]``, and ``delete[]`` respectively.
ta: இவை `` புதிய``, `` நீக்கு``, `` புதிய [] ``, மற்றும் `` முறையே நீக்குதல் [] `ஆகியவற்றிற்கு சமமானவை.
uk: Вони еквівалентні відповідно ``new``, ``delete``, ``new[]`` та ``delete[]``.

source: memnew/memdelete also use a little C++ magic and notify Objects right after they are created, and right before they are deleted.
ga: Úsáideann memnew/memdelete draíocht beag C ++ freisin agus cuireann sé in iúl do Rud díreach tar éis iad a chruthú, agus díreach sula scriosfar iad.
ta: மெம்னியூ/மெம்டெலெட் ஒரு சிறிய சி ++ மந்திரத்தையும் பயன்படுத்துகிறது மற்றும் பொருள்களை உருவாக்கிய உடனேயே அறிவிக்கவும், அவை நீக்கப்படுவதற்கு முன்பே.
uk: memnew/memdelete також використовує трохи магії C++ і сповіщає об’єкти відразу після їх створення та безпосередньо перед їх видаленням.

source: For dynamic memory, use one of Godot's sequence types such as ``Vector<>`` or ``LocalVector<>``. ``Vector<>`` behaves much like an STL ``std::vector<>``, but is simpler and uses Copy-On-Write (CoW) semantics. CoW copies of ``Vector<>`` can safely access the same data from different threads, but several threads cannot access the same ``Vector<>`` instance safely. It can be safely passed via public API if it has a ``Packed`` alias.
ta: மாறும் நினைவகத்திற்கு, கோடோட்டின் வரிசை வகைகளில் ஒன்றான `` `` `` அல்லது `` லோக்கல்வெக்டர் <> `` போன்ற ஒன்றைப் பயன்படுத்தவும். `` திசையன் <> `` ஒரு எச்.டி.எல் `` எச்.டி.டி :: திசையன் <> `` போன்றவற்றைப் போல செயல்படுகிறது, ஆனால் இது எளிமையானது மற்றும் நகல்-எழுதும் (மாடு) சொற்பொருளைப் பயன்படுத்துகிறது. `` திசையன் <> `` இன் மாடு நகல்கள் வெவ்வேறு நூல்களிலிருந்து ஒரே தரவை பாதுகாப்பாக அணுக முடியும், ஆனால் பல நூல்கள் ஒரே `` திசையன் <> `` உதாரணத்தை பாதுகாப்பாக அணுக முடியாது. `` பேக் செய்யப்பட்ட` 'மாற்றுப்பெயரைக் கொண்டிருந்தால் அதை பொது பநிஇ வழியாக பாதுகாப்பாக அனுப்ப முடியும்.
uk: Для динамічної пам’яті використовуйте один із типів послідовності Godot, наприклад ``Vector<>`` або ``LocalVector<>``. ``Vector<>`` поводиться так само, як STL ``std::vector<>``, але він простіший і використовує семантику Copy-On-Write (CoW). Копії CoW ``Vector<>`` можуть безпечно отримувати доступ до тих самих даних з різних потоків, але кілька потоків не можуть безпечно отримати доступ до того самого екземпляра ``Vector<>``. Його можна безпечно передати через публічний API, якщо він має псевдонім ``Packed``.

source: The ``Packed*Array`` :ref:`types <doc_gdscript_packed_arrays>` are aliases for specific ``Vector<*>`` types (e.g., ``PackedByteArray``, ``PackedInt32Array``) that are accessible via GDScript. Outside of core, prefer using the ``Packed*Array`` aliases for functions exposed to scripts, and ``Vector<>`` for other occasions.
ta: `` பேக் செய்யப்பட்ட*வரிசை``. கோருக்கு வெளியே, ச்கிரிப்ட்களுக்கு வெளிப்படும் செயல்பாடுகளுக்கு `` பேக் செய்யப்பட்ட*வரிசை`` மாற்றுப்பெயர்களைப் பயன்படுத்தவும், மற்றும் பிற சந்தர்ப்பங்களில் `` திசையன் <> ``.
uk: ``Packed*Array`` :ref:`types <doc_gdscript_packed_arrays>` є псевдонімами для конкретних типів ``Vector<*>`` (наприклад, ``PackedByteArray``, ``PackedInt32Array``), які доступні через GDScript. За межами ядра віддайте перевагу використанню псевдонімів ``Packed*Array`` для функцій, які піддаються сценаріям, і ``Vector<>`` для інших випадків.

source: ``LocalVector<>`` is much more like ``std::vector`` than ``Vector<>``. It is non-CoW, with less overhead. It is intended for internal use where the benefits of CoW are not needed. Note that neither ``LocalVector<>`` nor ``Vector<>`` are drop-in replacements for each other. They are two unrelated types with similar interfaces, both using a buffer as their storage strategy.
ta: `` `` `` `` `திசையன் <>` `ஐ விட` `எச்.டி :: திசையன்` போன்றது. இது மோச்ட் அல்லாதது, குறைந்த மேல்நிலை. இது பசுவின் நன்மைகள் தேவையில்லை என்று உள் பயன்பாட்டிற்காக வடிவமைக்கப்பட்டுள்ளது. `` உள்ளக வெக்டர் <> `` அல்லது `` திசையன் <> `` ஒருவருக்கொருவர் மாற்றியமைக்காது என்பதை நினைவில் கொள்க. அவை ஒத்த இடைமுகங்களைக் கொண்ட இரண்டு தொடர்பில்லாத வகைகள், இரண்டும் அவற்றின் சேமிப்பக மூலோபாயமாக ஒரு இடையகத்தைப் பயன்படுத்துகின்றன.
uk: ``LocalVector<>`` більше схожий на ``std::vector``, ніж ``Vector<>``. Це не CoW, з меншими накладними витратами. Він призначений для внутрішнього використання, де переваги CoW не потрібні. Зауважте, що ні ``LocalVector<>``, ні ``Vector<>`` не замінюють один одного. Це два непов’язані типи з подібними інтерфейсами, обидва використовують буфер як стратегію зберігання.

source: ``List<>`` is another Godot sequence type, using a doubly-linked list as its storage strategy. Prefer ``Vector<>`` (or ``LocalVector<>``) over ``List<>`` unless you're sure you need it, as cache locality and memory fragmentation tend to be more important with small collections.
ta: `` பட்டியல் <> `` என்பது மற்றொரு கோடோட் வரிசை வகை, இரட்டிப்பாக-இணைக்கப்பட்ட பட்டியலை அதன் சேமிப்பக மூலோபாயமாகப் பயன்படுத்துகிறது. `` பட்டியல் <> `` `` `` `` லோக்கல்வெக்டர் <> `)` `` `லோக்கல்வெக்டர் <>`) ஐ விரும்புங்கள், ஏனெனில் உங்களுக்கு இது தேவை என்று உறுதியாக இல்லாவிட்டால், கேச் வட்டாரமும் நினைவக துண்டு துண்டும் சிறிய சேகரிப்புகளுடன் மிகவும் முக்கியத்துவம் வாய்ந்தவை.
uk: ``List<>`` — ще один тип послідовності Godot, який використовує подвійний зв’язаний список як стратегію зберігання. Віддавайте перевагу ``Vector<>`` (або ``LocalVector<>``) над ``List<>``, якщо ви не впевнені, що він вам потрібен, оскільки локальність кешу та фрагментація пам’яті, як правило, більш важливі для малих колекцій.

source: `core/os/memory.h <https://github.com/godotengine/godot/blob/master/core/os/memory.h>`__
ta: `கோர்/ஓஎச்/மெமரி.

source: Containers
ga: Coimeádáin
ta: கொள்கலன்கள்
uk: Контейнери

source: Godot provides its own set of containers, which means STL containers like ``std::string`` and ``std::vector`` are generally not used in the codebase. See :ref:`doc_faq_why_not_stl` for more information.
ta: கோடோட் அதன் சொந்த கொள்கலன்களை வழங்குகிறது, அதாவது `` std :: string`` மற்றும் `` std :: vector`` போன்ற STL கொள்கலன்கள் பொதுவாக கோட்பேசில் பயன்படுத்தப்படாது. காண்க: குறிப்பு: மேலும் தகவலுக்கு `doc_faq_why_not_stl`.
uk: Godot надає власний набір контейнерів, що означає, що контейнери STL, такі як ``std::string`` та ``std::vector``, зазвичай не використовуються в кодовій базі. Див. :ref:`doc_faq_why_not_stl` для отримання додаткової інформації.

source: A 📜 icon denotes the type is part of :ref:`Variant <doc_variant_class>`. This means it can be used as a parameter or return value of a method exposed to the scripting API.
ta: ஒரு 📜 படவுரு வகை இதன் ஒரு பகுதியாகும் என்பதைக் குறிக்கிறது: குறிப்பு: `மாறுபாடு <doc_variant_class>`. இதன் பொருள் இது ச்கிரிப்டிங் ஏபிஐக்கு வெளிப்படும் ஒரு முறையின் அளவுரு அல்லது வருவாய் மதிப்பாக பயன்படுத்தப்படலாம்.
uk: Значок 📜 позначає, що тип є частиною :ref:`Variant <doc_variant_class>`. Це означає, що його можна використовувати як параметр або повернене значення методу, що надається API сценаріїв.

source: Godot datatype
ta: கோடோட் டேட்டாடைப்
uk: Тип даних Godot

source: Closest C++ STL datatype
ta: நெருங்கிய சி ++ எச்.டி.எல் டேட்டாடைப்
uk: Найближчий тип даних C++ STL

source: Comment
ga: Nóta Tráchta
ta: கருத்து
uk: Коментар

source: |string| 📜
ta: | சரம் | .

source: |vector|
ta: | திசையன் |

source: ``std::vector``
ta: `` std :: vecter``

source: **Use this as the "default" vector type.** Uses copy-on-write (COW) semantics. This means it's generally slower but can be copied around almost for free. Use ``LocalVector`` instead where COW isn't needed and performance matters.
ta: ** இதை "இயல்புநிலை" திசையன் வகையாகப் பயன்படுத்தவும். ** நகல்-எழுதும் (மாடு) சொற்பொருளைப் பயன்படுத்துகிறது. இதன் பொருள் இது பொதுவாக மெதுவாக உள்ளது, ஆனால் கிட்டத்தட்ட இலவசமாக நகலெடுக்க முடியும். மாடு தேவையில்லை மற்றும் செயல்திறன் முக்கியத்துவம் வாய்ந்த இடத்திற்கு பதிலாக `` உள்ளக வெக்டர்`` ஐப் பயன்படுத்தவும்.

source: **Use this as the "default" set type.**
ta: ** இதை "இயல்புநிலை" தொகுப்பு வகையாகப் பயன்படுத்தவும். **
uk: **Використовуйте це як тип набору "за замовчуванням".**

source: **Use this as the "default" map type.** Does not preserve insertion order. Note that pointers into the map, as well as iterators, are not stable under mutations. If either of these affordances are needed, use ``HashMap`` instead.
ta: ** இதை "இயல்புநிலை" வரைபட வகையாகப் பயன்படுத்தவும். ** செருகும் வரிசையை பாதுகாக்காது. வரைபடத்தில் உள்ள சுட்டிகள், அதே போல் ஐரேட்டர்கள், பிறழ்வுகளின் கீழ் நிலையானவை அல்ல என்பதை நினைவில் கொள்க. இந்த செலவினங்களில் ஒன்று தேவைப்பட்டால், அதற்கு பதிலாக `` ஆச்மேப்`` ஐப் பயன்படுத்தவும்.
uk: **Використовуйте це як тип карти "за замовчуванням".** Не зберігає порядок вставки. Зверніть увагу, що вказівники на карту, а також ітератори, нестабільні при мутаціях. Якщо потрібна будь-яка з цих можливостей, використовуйте замість цього ``HashMap``.

source: Uses string interning for fast comparisons. Use this for static strings that are referenced frequently and used in multiple locations in the engine.
ta: வேகமான ஒப்பீடுகளுக்கு சரம் இன்டர்னிங்கைப் பயன்படுத்துகிறது. அடிக்கடி குறிப்பிடப்படும் மற்றும் இயந்திரத்தில் பல இடங்களில் பயன்படுத்தப்படும் நிலையான சரங்களுக்கு இதைப் பயன்படுத்தவும்.
uk: Використовує інтернування рядків для швидкого порівняння. Використовуйте це для статичних рядків, на які часто посилаються та які використовуються в кількох місцях у рушії.

source: |local_vector|
ta: | லோக்கல்_வெக்டர் |

source: Closer to ``std::vector`` in semantics, doesn't use copy-on-write (COW) thus it's faster than ``Vector``. Prefer it over ``Vector`` when copying it cheaply is not needed.
ta: சொற்பொருளில் `` எச்.டி.டி :: திசையன்` உடன் நெருக்கமாக, நகல்-எழுதும் (மாடு) இதனால் இது `` திசையன்`` ஐ விட வேகமானது. மலிவாக நகலெடுக்கும்போது `` திசையன்` `ஐ விரும்புங்கள்.

source: |array| 📜
ta: | வரிசை | .
