Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/architecture/custom_audiostreams.po
Languages: it, ru, uk

source: Custom AudioStreams
it: AudioStream personalizzati
ru: Пользовательские аудиопотоки
uk: Нетипові AudioStream-и

source: Introduction
it: Introduzione
ru: Введение
uk: Вступ

source: AudioStream is the base class of all audio emitting objects. AudioStreamPlayer binds onto an AudioStream to emit PCM data into an AudioServer which manages audio drivers.
it: AudioStream è la classe base di tutti gli oggetti che emettono audio. AudioStreamPlayer si collega a un AudioStream per emettere dati PCM in un AudioServer che gestisce i driver audio.
ru: AudioStream - это базовый класс всех объектов, передающих звук. AudioStreamPlayer привязывается к AudioStream для передачи PCM-данных в AudioServer, который управляет аудиодрайверами.
uk: AudioStream є базовим класом усіх об’єктів, що випромінюють звук. AudioStreamPlayer прив’язується до AudioStream, щоб передавати дані PCM на AudioServer, який керує аудіодрайверами.

source: All audio resources require two audio based classes: AudioStream and AudioStreamPlayback. As a data container, AudioStream contains the resource and exposes itself to GDScript. AudioStream references its own internal custom AudioStreamPlayback which translates AudioStream into PCM data.
it: Tutte le risorse audio richiedono due classi basate sull'audio: AudioStream e AudioStreamPlayback. Come contenitore di dati, AudioStream contiene la risorsa e si espone a GDScript. AudioStream fa riferimento al proprio AudioStreamPlayback personalizzato interno, che traduce AudioStream in dati PCM.
ru: Все аудиоресурсы требуют наличия двух классов, основанных на аудио: AudioStream и AudioStreamPlayback. Как контейнер данных, AudioStream содержит ресурс и открывает себя для GDScript. AudioStream ссылается на свой собственный внутренний пользовательский AudioStreamPlayback, который переводит AudioStream в данные PCM.
uk: Для всіх аудіоресурсів потрібні два аудіокласи: AudioStream і AudioStreamPlayback. Як контейнер даних, AudioStream містить ресурс і надає себе GDScript. AudioStream посилається на власний внутрішній настроюваний AudioStreamPlayback, який перетворює AudioStream у дані PCM.

source: This guide assumes the reader knows how to create C++ modules. If not, refer to this guide :ref:`doc_custom_modules_in_cpp`.
it: Questa guida presuppone che il lettore sappia come creare moduli C++. Se non, fare riferimento a questa guida :ref:`doc_custom_modules_in_cpp`.
ru: Это руководство предполагает, что читатель знает, как создавать модули на C++. Если это не так, обратитесь к этому руководству :ref:`doc_custom_modules_in_cpp`.
uk: Цей посібник передбачає, що читач знає, як створювати модулі C++. Якщо ні, зверніться до цього посібника :ref:`doc_custom_modules_in_cpp`.

source: References:
it: Riferimenti:
ru: Источники:
uk: Посилання:

source: What for?
ru: Для чего это?
uk: для чого?

source: Binding external libraries (like Wwise, FMOD, etc).
it: Associare librerie esterne (come Wwise, FMOD, ecc.).
ru: Привязка внешних библиотек (таких как Wwise, FMOD и т.д.).
uk: Прив’язка зовнішніх бібліотек (наприклад, Wwise, FMOD тощо).

source: Adding custom audio queues
it: Aggiungere code d'attesa audio personalizzate
ru: Создание кастомных аудиоочередей
uk: Додавання нетипових черг обробки звукових даних

source: Adding support for more audio formats
it: Aggiungere supporto per più formati audio
ru: Добавление поддержки большего количества аудиоформатов
uk: Додавання підтримки додаткових форматів звукових даних

source: Create an AudioStream
it: Creare un AudioStream
ru: Создайте AudioStream
uk: Створення AudioStream

source: An AudioStream consists of three components: data container, stream name, and an AudioStreamPlayback friend class generator. Audio data can be loaded in a number of ways such as with an internal counter for a tone generator, internal/external buffer, or a file reference.
it: Un AudioStream è costituito da tre componenti: contenitore di dati, nome del flusso e un generatore di classi friend AudioStreamPlayback. È possibile caricare i dati audio in diversi modi, ad esempio tramite un contatore interno per un generatore di toni, un buffer interno/esterno o un riferimento a un file.
ru: AudioStream состоит из трёх компонентов: контейнер данный, название потока и класс генератор AudioStreamPlayback. Аудио данные могут быть загружены множественными способами как внутренний счётчик или же генератором тона, внешним/внутренним буфером, или же при помощи указателя на файл.
uk: AudioStream складається з трьох компонентів: контейнер даних, ім’я потоку та генератор другорядного класу AudioStreamPlayback. Аудіодані можна завантажувати кількома способами, наприклад за допомогою внутрішнього лічильника тонального генератора, внутрішнього/зовнішнього буфера або посилання на файл.

source: Some AudioStreams need to be stateless such as objects loaded from ResourceLoader. ResourceLoader loads once and references the same object regardless how many times ``load`` is called on a specific resource. Therefore, playback state must be self-contained in AudioStreamPlayback.
it: Alcuni AudioStream devono essere stateless, come gli oggetti caricati da ResourceLoader. ResourceLoader carica una sola volta e fa riferimento allo stesso oggetto a prescindere dal numero di volte in cui ``load`` viene chiamato su una risorsa specifica. Pertanto, lo stato di riproduzione deve essere autonomo in AudioStreamPlayback.
ru: Некоторые аудиопотоки (AudioStreams) должны быть без состояния, например, объекты, загруженные из ResourceLoader. ResourceLoader загружается один раз и ссылается на один и тот же объект независимо от того, сколько раз ``load`` вызывается для конкретного ресурса. Поэтому состояние воспроизведения должно быть самостоятельным в AudioStreamPlayback.
uk: Деякі аудіопотоки мають бути без стану, наприклад об’єкти, завантажені з ResourceLoader. ResourceLoader завантажується один раз і посилається на той самий об’єкт незалежно від того, скільки разів ``load`` викликається на певному ресурсі. Тому стан відтворення має бути самодостатнім у AudioStreamPlayback.

source: Create an AudioStreamPlayback
it: Creare un AudioStreamPlayback
ru: Создайте AudioStreamPlayback
uk: Створення AudioStreamPlayback

source: AudioStreamPlayer uses ``mix`` callback to obtain PCM data. The callback must match sample rate and fill the buffer.
it: AudioStreamPlayer utilizza il callback ``mix`` per ottenere i dati PCM. Il callback deve corrispondere alla frequenza di campionamento e riempire il buffer.
ru: AudioStreamPlayer использует функцию обратного вызова ``mix`` для получения данных PCM. Функция обратного вызова должна соответствовать частоте дискретизации и заполнять буфер.
uk: AudioStreamPlayer використовує зворотний виклик ``mix`` для отримання даних PCM. Зворотний виклик має відповідати частоті дискретизації та заповнювати буфер.

source: Since AudioStreamPlayback is controlled by the audio thread, i/o and dynamic memory allocation are forbidden.
it: Poiché AudioStreamPlayback è controllato dal thread audio, l'I/O e l'allocazione dinamica della memoria sono proibiti.
ru: Поскольку AudioStreamPlayback контролируется аудиопотоком, то ввод/вывод и динамическое выделение памяти запрещены.
uk: Оскільки AudioStreamPlayback контролюється звуковим потоком, введення/виведення та динамічний розподіл пам’яті заборонені.

source: Resampling
it: Ricampionamento
ru: Передискретизация
uk: Зміна частоти

source: Godot's AudioServer currently uses 44100 Hz sample rate. When other sample rates are needed such as 48000, either provide one or use AudioStreamPlaybackResampled. Godot provides cubic interpolation for audio resampling.
it: L'AudioServer di Godot utilizza attualmente una frequenza di campionamento di 44.100 Hz. Quando sono necessarie altre frequenze di campionamento, come 48.000 Hz, è necessario specificarne una o utilizzare AudioStreamPlaybackResampled. Godot fornisce un'interpolazione cubica per il ricampionamento audio.
ru: В настоящее время AudioServer от Godot использует частоту дискретизации 44100 Гц. Если требуются другие частоты дискретизации, например, 48000 Гц, либо укажите её, либо используйте AudioStreamPlaybackResampled. Godot обеспечивает кубическую интерполяцию для передискретизации звука.
uk: Аудіосервер Godot наразі використовує частоту дискретизації 44100 Гц. Якщо потрібні інші частоти дискретизації, наприклад 48 000, задайте одну або використовуйте AudioStreamPlaybackResampled. Godot забезпечує кубічну інтерполяцію для повторної дискретизації звуку.

source: Instead of overloading ``mix``, AudioStreamPlaybackResampled uses ``_mix_internal`` to query AudioFrames and ``get_stream_sampling_rate`` to query current mix rate.
it: Invece di creare un overload per ``mix``, AudioStreamPlaybackResampled utilizza ``_mix_internal`` per interrogare AudioFrames e ``get_stream_sampling_rate`` per ottenere la frequenza di mixaggio attuale.
ru: Вместо того, чтобы перегружать ``mix``, AudioStreamPlaybackResampled использует ``_mix_internal``, чтобы получить AudioFrames и ``get_stream_sampling_rate``, чтобы получить текущую скорость микширования.
uk: Замість перевантаження ``mix`` AudioStreamPlaybackResampled використовує ``_mix_internal`` для запиту AudioFrames і ``get_stream_sampling_rate`` для запиту поточної швидкості мікшування.

source: `core/math/audio_frame.h <https://github.com/godotengine/godot/blob/master/core/math/audio_frame.h>`__
uk: `основний/математ/аудіо_кадр.h <https://github.com/godotengine/godot/blob/master/core/math/audio_frame.h>`__
