Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/architecture/custom_platform_ports.po
Languages: it, ru

source: Custom platform ports
it: Port su piattaforme personalizzate
ru: Кастомные порты под платформу

source: Similar to :ref:`doc_custom_modules_in_cpp`, Godot's multi-platform architecture is designed in a way that allows creating platform ports without modifying any existing source code.
it: Simile a :ref:`doc_custom_modules_in_cpp`, l'architettura multipiattaforma di Godot è progettata in modo da consentire la creazione di port di piattaforma senza modificare alcun codice sorgente esistente.
ru: Подобно :ref:`doc_custom_modules_in_cpp` многоплатформенная архитектура в Godot спроектирована таким образом, чтобы создавать порты под платформу без изменения кода.

source: An example of a custom platform port distributed independently from the engine is `FRT <https://github.com/efornara/frt>`__, which targets single-board computers. Note that this platform port currently targets Godot 3.x; therefore, it does not use the :ref:`class_DisplayServer` abstraction that is new in Godot 4.
it: Un esempio di port di piattaforma personalizzato distribuito indipendentemente dal motore è `FRT <https://github.com/efornara/frt>`__, destinato ai computer a scheda singola. Si noti che questo port di piattaforma è attualmente destinato a Godot 3.x; pertanto, non utilizza l'astrazione :ref:`class_DisplayServer` introdotta in Godot 4.
ru: Примером пользовательского порта для платформы, распространяемого независимо от движка, является `FRT <https://github.com/efornara/frt>`__, предназначенный для одноплатных компьютеров. Обратите внимание, что этот порт для платформы в настоящее время ориентирован на Godot 3.x; поэтому он не использует абстракцию :ref:`class_DisplayServer`, появившуюся в Godot 4.

source: Some reasons to create custom platform ports might be:
it: Alcuni motivi per cui è consigliabile creare port personalizzati di piattaforma potrebbero essere:
ru: Вот некоторые причины создания пользовательских портов платформы:

source: You want to :ref:`port your game to consoles <doc_consoles>`, but wish to write the platform layer yourself. This is a long and arduous process, as it requires signing NDAs with console manufacturers, but it allows you to have full control over the console porting process.
it: Serve :ref:`portare il proprio gioco su console <doc_consoles>`, ma si desidera scrivere personalmente il lato piattaforma. Questo è un processo lungo e arduo, poiché richiede la firma di accordi di riservatezza con i produttori di console, ma consente di avere il pieno controllo sul processo di porting sulla console.
ru: Вы хотите :ref:`портировать свою игру на консоли <doc_consoles>`, но хотите самостоятельно написать платформу. Это долгий и трудоёмкий процесс, требующий подписания соглашений о неразглашении с производителями консолей, но он позволяет вам полностью контролировать процесс портирования.

source: You want to port Godot to an exotic platform that isn't currently supported.
it: Serve portare Godot su una piattaforma esotica che al momento non è supportata.
ru: Вы желаете перенести Godot на экзотическую платформу, которая в настоящее время не поддерживается.

source: If you have questions about creating a custom platform port, feel free to ask in the ``#platforms`` channel of the `Godot Contributors Chat <https://chat.godotengine.org/channel/platforms>`__.
it: Se ci sono domande sulla creazione di un port personalizzato per una piattaforma, non esitare a chiedere nel canale ``#platforms`` della `Godot Contributors Chat <https://chat.godotengine.org/channel/platforms>`__.
ru: Если у вас есть вопросы по созданию порта для пользовательской платформы, смело задавайте их на канале ``#platforms`` в `Godot Contributors Chat <https://chat.godotengine.org/channel/platforms>`__.

source: Godot is a modern engine with modern requirements. Even if you only intend to run simple 2D projects on the target platform, it still requires an amount of memory that makes it unviable to run on most retro consoles. For reference, in Godot 4, an empty project with nothing visible requires about 100 MB of RAM to run on Linux (50 MB in headless mode).
it: Godot è un motore grafico moderno con requisiti moderni. Anche se si intende eseguire solo semplici progetti 2D sulla piattaforma di destinazione, richiede comunque una quantità di memoria che lo rende inadatto all'esecuzione sulla maggior parte delle console retrò. Per avere un riferimento, in Godot 4, un progetto vuoto senza nulla di visibile richiede circa 100 MB di RAM per essere eseguito su Linux (50 MB in modalità headless).
ru: Godot — современный движок с современными требованиями. Даже если вы планируете запускать на целевой платформе только простые 2D-проекты, он всё равно требует такого объёма памяти, что его невозможно запустить на большинстве ретро-консолей. Для справки: в Godot 4 пустой проект без видимых элементов требует около 100 МБ оперативной памяти для запуска на Linux (50 МБ в режиме headless).

source: If you want to run Godot on heavily memory-constrained platforms, older Godot versions have lower memory requirements. The porting process is similar, with the exception of :ref:`class_DisplayServer` not being split from the :ref:`class_OS` singleton.
it: Se si desidera eseguire Godot su piattaforme con forti limitazioni di memoria, le versioni precedenti di Godot richiedono meno memoria. Il processo di porting è simile, con l'eccezione che :ref:`class_DisplayServer` non è separato dal singleton :ref:`class_OS`.
ru: Если вы хотите запустить Godot на платформах с сильно ограниченными ресурсами памяти, более старые версии Godot предъявляют меньшие требования к памяти. Процесс портирования аналогичен, за исключением того, что :ref:`class_DisplayServer` не отделяется от синглтона :ref:`class_OS`.

source: Official platform ports
it: Port su piattaforme ufficiali
ru: Официальные платформы для портирования

source: The official platform ports can be used as a reference when creating a custom platform port:
it: I port per le piattaforme ufficiali si possono usare come riferimento durante la creazione di un port personalizzato per una piattaforma:
ru: Официальные порты платформы можно использовать в качестве справочного материала при создании собственного порта платформы:

source: While platform code is usually self-contained, there are exceptions to this rule. For instance, audio drivers that are shared across several platforms and rendering drivers are located in the `drivers/ folder <https://github.com/godotengine/godot/tree/master/drivers>`__ of the Godot source code.
it: Sebbene il codice di piattaforma sia solitamente autosufficiente, esistono delle eccezioni a questa regola. Ad esempio, i driver audio condivisi su più piattaforme e i driver di rendering si trovano nella cartella `drivers/ <https://github.com/godotengine/godot/tree/master/drivers>`__ del codice sorgente di Godot.
ru: Хотя код платформы обычно самодостаточен, из этого правила есть исключения. Например, общие для нескольких платформ аудиодрайверы и драйверы рендеринга находятся в папке `drivers/ <https://github.com/godotengine/godot/tree/master/drivers>`__ исходного кода Godot.

source: Creating a custom platform port
it: Creare un port su piattaforma personalizzata
ru: Создание собственного порта платформы

source: Creating a custom platform port is a large undertaking which requires prior knowledge of the platform's SDKs. Depending on what features you need, the amount of work needed varies:
it: Creare un port personalizzata per una piattaforma è un'impresa ardua che richiede una conoscenza approfondita degli SDK della piattaforma. La quantità di lavoro necessaria varia a seconda delle funzionalità richieste:
ru: Создание собственного порта платформы — это масштабная задача, требующая предварительного знания SDK этой платформы. Объём необходимых работ варьируется в зависимости от необходимых функций:

source: Required features of a platform port
it: Funzionalità richieste di un port per una piattaforma
ru: Требуемые характеристики порта платформы

source: At the very least, a platform port must have methods from the :ref:`class_OS` singleton implemented to be buildable and usable for headless operation. A ``logo.svg`` (32×32) vector image must also be present within the platform folder. This logo is displayed in the Export dialog for each export preset targeting the platform in question.
it: Come minimo, un port per una piattaforma deve implementare i metodi del singleton :ref:`class_OS` per essere compilabile e utilizzabile per operazioni headless. All'interno della cartella della piattaforma deve essere presente anche un'immagine vettoriale ``logo.svg`` (32×32). Questo logo è visualizzato nella finestra di dialogo Esporta per ogni preimpostazione di esportazione destinato alla piattaforma in questione.
ru: Как минимум, порт платформы должен содержать методы из синглтона :ref:`class_OS`, реализованные для сборки и использования в режиме headless. В папке платформы также должно находиться векторное изображение ``logo.svg`` (32×32). Этот логотип отображается в диалоговом окне «Экспорт» для каждого шаблона экспорта, ориентированного на данную платформу.

source: See `this implementation <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/os_linuxbsd.cpp>`__ for the Linux/\*BSD platform as an example. See also the `OS singleton header <https://github.com/godotengine/godot/blob/master/core/os/os.h>`__ for reference.
it: Vedere `questa implementazione <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/os_linuxbsd.cpp>`__ per la piattaforma Linux/\*BSD come esempio. Vedere anche `l'intestazione del singleton OS <https://github.com/godotengine/godot/blob/master/core/os/os.h>`__ come riferimento.
ru: См. `эту реализацию <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/os_linuxbsd.cpp>`__ для платформы Linux/\*BSD в качестве примера. См. также `заголовочный файл OS singleton <https://github.com/godotengine/godot/blob/master/core/os/os.h>`__ для справки.

source: If the platform is not UNIX-like, you might use the `Windows port <https://github.com/godotengine/godot/blob/master/platform/windows/os_windows.cpp>`__ as a reference.
it: Se la piattaforma non è di tipo UNIX, potresti usare il `port per Windows <https://github.com/godotengine/godot/blob/master/platform/windows/os_windows.cpp>`__ come riferimento.
ru: Если платформа не является UNIX-подобной, вы можете использовать `Windows-порт <https://github.com/godotengine/godot/blob/master/platform/windows/os_windows.cpp>`__ в качестве ссылки.

source: **detect.py file**
it: **file detect.py**

source: A ``detect.py`` file must be created within the platform's folder with all methods implemented. This file is required for SCons to detect the platform as a valid option for compiling. See the `detect.py file <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/detect.py>`__ for the Linux/\*BSD platform as an example.
it: È necessario creare un file ``detect.py`` all'interno della cartella della piattaforma con tutti i metodi implementati. Questo file è necessario affinché SCons rilevi la piattaforma come opzione valida per la compilazione. Vedere il file `detect.py <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/detect.py>`__ per la piattaforma Linux/\*BSD come esempio.
ru: В папке платформы необходимо создать файл ``detect.py`` со всеми реализованными методами. Этот файл необходим SCons для определения платформы как допустимого варианта для компиляции. См. файл `detect.py <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/detect.py>`__ для платформы Linux/\*BSD в качестве примера.

source: All methods should be implemented within ``detect.py`` as follows:
it: Tutti i metodi devono essere implementati all'interno di ``detect.py`` come segue:
ru: Все методы должны быть реализованы в ``detect.py`` следующим образом:

source: ``is_active()``: Can be used to temporarily disable building for a platform. This should generally always return ``True``.
it: ``is_active()``: può servire per disabilitare temporaneamente la compilazione per una piattaforma. Generalmente, dovrebbe sempre restituire ``True``.
ru: ``is_active()``: может использоваться для временного отключения сборки для платформы. Обычно всегда возвращает ``True``.

source: ``get_name()``: Returns the platform's user-visible name as a string.
it: ``get_name()``: restituisce il nome della piattaforma visibile all'utente come stringa.
ru: ``get_name()``: Возвращает видимое пользователю имя платформы в виде строки.

source: ``can_build()``: Return ``True`` if the host system is able to build for the target platform, ``False`` otherwise. Do not put slow checks here, as this is queried when the list of platforms is requested by the user. Use ``configure()`` for extensive dependency checks instead.
it: ``can_build()``: restituisce ``True`` se il sistema host è in grado di compilare per la piattaforma di destinazione, altrimenti ``False`` . Non inserire verifiche lente qui, poiché questo viene interrogato quando l'utente richiede l'elenco delle piattaforme. Utilizzare invece ``configure()`` per le verifiche approfondite di dipendenza.
ru: ``can_build()``: Возвращает ``True``, если хост-система может выполнить сборку для целевой платформы, и ``False`` в противном случае. Не добавляйте сюда медленные проверки, так как они выполняются при запросе пользователем списка платформ. Для расширенных проверок зависимостей используйте ``configure()``.

source: ``get_opts()``: Returns the list of SCons build options that can be defined by the user for this platform.
it: ``get_opts()``: restituisce l'elenco delle opzioni di build SCons che l'utente può definire per questa piattaforma.
ru: ``get_opts()``: Возвращает список параметров сборки SCons, которые могут быть определены пользователем для этой платформы.

source: ``get_flags()``: Returns the list of overridden SCons flags for this platform.
it: ``get_flags()``: restituisce l'elenco dei flag SCons sovrascritti per questa piattaforma.
ru: ``get_flags()``: Возвращает список переопределенных флагов SCons для этой платформы.

source: ``configure()``: Perform build configuration, such as selecting compiler options depending on SCons options chosen.
it: ``configure()``: esegue la configurazione della build, ad esempio selezionando le opzioni del compilatore in base alle opzioni SCons scelte.
ru: ``configure()``: выполнение настройки сборки, например выбор параметров компилятора в зависимости от выбранных параметров SCons.

source: Optional features of a platform port
it: Funzionalità opzionali di un port per una piattaforma
ru: Дополнительные возможности порта платформы

source: In practice, headless operation doesn't suffice if you want to see anything on screen and handle input devices. You may also want audio output for most games.
it: In pratica, il funzionamento headless non è sufficiente se si desidera visualizzare qualsiasi cosa sullo schermo e gestire i dispositivi di input. Potrebbe essere necessario anche un output audio per la maggior parte dei giochi.
ru: На практике, если вы хотите видеть что-либо на экране и управлять устройствами ввода, безголового режима недостаточно. Для большинства игр может также потребоваться вывод звука.

source: *Some links on this list point to the Linux/\*BSD platform implementation as a reference.*
it: *Alcuni link in questo elenco puntano all'implementazione della piattaforma Linux/\*BSD come riferimento.*
ru: *Некоторые ссылки в этом списке указывают на реализацию платформы Linux/\*BSD в качестве эталона.*

source: One or more `DisplayServers <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/display_server_x11.cpp>`__, with the windowing methods implemented. DisplayServer also covers features such as mouse support, touchscreen support and tablet driver (for pen input). See the `DisplayServer singleton header <https://github.com/godotengine/godot/blob/master/servers/display_server.h>`__ for reference.
it: Uno o più `DisplayServer <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/display_server_x11.cpp>`__, con i metodi di windowing implementati. DisplayServer include anche funzionalità come il supporto per mouse, touchscreen e driver per tablet (per input tramite penna). Vedere `l'header del singleton DisplayServer <https://github.com/godotengine/godot/blob/master/servers/display_server.h>`__ come riferimento.
ru: Один или несколько `DisplayServer <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/display_server_x11.cpp>`__ с реализованными методами управления окнами. DisplayServer также поддерживает такие функции, как поддержка мыши, сенсорных экранов и драйвер планшета (для ввода пером). См. заголовок `DisplayServer singleton <https://github.com/godotengine/godot/blob/master/servers/display_server.h>`__ для справки.

source: For platforms not featuring full windowing support (or if it's not relevant for the port you are making), most windowing functions can be left mostly unimplemented. These functions can be made to only check if the window ID is ``MAIN_WINDOW_ID`` and specific operations like resizing may be tied to the platform's screen resolution feature (if relevant). Any attempt to create or manipulate other window IDs can be rejected.
it: Per le piattaforme che non offrono il supporto completo per il windowing (o se non è rilevante per il port che si sta realizzando), la maggior parte delle funzioni di windowing si può lasciare per lo più non implementata. Queste funzioni si possono creare solo per verificare se l'ID della finestra è ``MAIN_WINDOW_ID`` e operazioni specifiche come il ridimensionamento si possono legare alla risoluzione dello schermo della piattaforma (se pertinente). Qualsiasi tentativo di creare o manipolare altri ID di finestra può essere rifiutato.
ru: Для платформ, не поддерживающих полноценную работу с окнами (или если это неактуально для создаваемого вами порта), большинство функций управления окнами можно оставить практически нереализованными. Эти функции можно настроить только на проверку идентификатора окна ``MAIN_WINDOW_ID``, а некоторые операции, такие как изменение размера, можно привязать к разрешению экрана платформы (если это применимо). Любая попытка создания или изменения других идентификаторов окон может быть отклонена.

source: *If the target platform supports the graphics APIs in question:* Rendering context for `Vulkan <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/rendering_context_driver_vulkan_x11.cpp>`__, `Direct3D 12 <https://github.com/godotengine/godot/blob/master/drivers/d3d12/rendering_context_driver_d3d12.cpp>`__ `OpenGL 3.3 or OpenGL ES 3.0 <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/gl_manager_x11.cpp>`__.
it: *Se la piattaforma di destinazione supporta le API grafiche in questione:* Contesto di rendering per `Vulkan <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/rendering_context_driver_vulkan_x11.cpp>`__, `Direct3D 12 <https://github.com/godotengine/godot/blob/master/drivers/d3d12/rendering_context_driver_d3d12.cpp>`__ `OpenGL 3.3 o OpenGL ES 3.0 <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/gl_manager_x11.cpp>`__.
ru: *Если целевая платформа поддерживает рассматриваемые графические API:* Контекст рендеринга для `Vulkan <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/rendering_context_driver_vulkan_x11.cpp>`__, `Direct3D 12 <https://github.com/godotengine/godot/blob/master/drivers/d3d12/rendering_context_driver_d3d12.cpp>`__ `OpenGL 3.3 или OpenGL ES 3.0 <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/gl_manager_x11.cpp>`__.

source: Input handlers for `keyboard <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/key_mapping_x11.cpp>`__ and `controller <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/joypad_linux.cpp>`__.
it: Gestori di input per `tastiera <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/key_mapping_x11.cpp>`__ e `controller <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/joypad_linux.cpp>`__.
ru: Обработчики ввода для `клавиатуры <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/x11/key_mapping_x11.cpp>`__ и `контроллера <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/joypad_linux.cpp>`__.

source: One or more `audio drivers <https://github.com/godotengine/godot/blob/master/drivers/pulseaudio/audio_driver_pulseaudio.cpp>`__. The audio driver can be located in the ``platform/`` folder (this is done for the Android and Web platforms), or in the ``drivers/`` folder if multiple platforms may be using this audio driver. See the `AudioServer singleton header <https://github.com/godotengine/godot/blob/master/servers/audio_server.h>`__ for reference.
it: Uno o più driver audio <https://github.com/godotengine/godot/blob/master/drivers/pulseaudio/audio_driver_pulseaudio.cpp>`__. Il driver audio si può posizionare nella cartella ``platform/`` (questa operazione è necessaria per le piattaforme Android e Web) oppure nella cartella ``drivers/`` se più piattaforme utilizzano questo driver audio. Vedere `l'header del singleton AudioServer <https://github.com/godotengine/godot/blob/master/servers/audio_server.h>`__ come riferimento.
ru: Один или несколько `audio drivers <https://github.com/godotengine/godot/blob/master/drivers/pulseaudio/audio_driver_pulseaudio.cpp>`__. Аудиодрайвер может находиться в папке ``platform/`` (это сделано для платформ Android и Web) или в папке ``drivers/``, если этот аудиодрайвер может использоваться на нескольких платформах. См. заголовок `AudioServer singleton <https://github.com/godotengine/godot/blob/master/servers/audio_server.h>`__ для справки.

source: `Crash handler <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/crash_handler_linuxbsd.cpp>`__, for printing crash backtraces when the game crashes. This allows for easier troubleshooting on platforms where logs aren't readily accessible.
it: `Gestore di crash <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/crash_handler_linuxbsd.cpp>`__, per stampare i backtrace dei crash quando il gioco si blocca. Questo rende più facile risolvere problemi sulle piattaforme in cui i log non sono facilmente accessibili.
ru: `Обработчик сбоев <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/crash_handler_linuxbsd.cpp>`__, для вывода трассировок сбоев при сбоях игры. Это упрощает устранение неполадок на платформах, где доступ к журналам затруднен.

source: `Text-to-speech driver <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/tts_linux.cpp>`__ (for accessibility).
it: `Driver di sintesi vocale <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/tts_linux.cpp>`__ (per accessibilità).
ru: `Драйвер преобразования текста в речь <https://github.com/godotengine/godot/blob/master/platform/linuxbsd/tts_linux.cpp>`__ (для доступности).
