Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/architecture/custom_platform_ports.po
Languages: it, ru

source: `Export handler <https://github.com/godotengine/godot/tree/master/platform/linuxbsd/export>`__ (for exporting from the editor, including :ref:`doc_one-click_deploy`). Not required if you intend to export only a PCK from the editor, then run the export template binary directly by renaming it to match the PCK file. See the `EditorExportPlatform header <https://github.com/godotengine/godot/blob/master/editor/export/editor_export_platform.h>`__ for reference. ``run_icon.svg`` (16×16) should be present within the platform folder if :ref:`doc_one-click_deploy` is implemented for the target platform. This icon is displayed at the top of the editor when one-click deploy is set up for the target platform.
it: `Gestore di esportazione <https://github.com/godotengine/godot/tree/master/platform/linuxbsd/export>`__ (per l'esportazione dall'editor, incluso :ref:`doc_one-click_deploy`). Non necessario se si intende esportare solo un PCK dall'editor, quindi eseguire direttamente il binario del modello di esportazione rinominandolo in modo che corrisponda al file PCK. Vedere `l'header di EditorExportPlatform <https://github.com/godotengine/godot/blob/master/editor/export/editor_export_platform.h>`__ come riferimento. ``run_icon.svg`` (16×16) dovrebbe essere presente nella cartella platform se :ref:`doc_one-click_deploy` è implementato per la piattaforma di destinazione. Questa icona è visualizzata in alto all'editor quando la distribuzione con un clic è configurata per la piattaforma di destinazione.
ru: `Export handler <https://github.com/godotengine/godot/tree/master/platform/linuxbsd/export>`__ (для экспорта из редактора, включая :ref:`doc_one-click_deploy`). Не требуется, если вы собираетесь экспортировать только PCK из редактора, а затем напрямую запустить двоичный файл шаблона экспорта, переименовав его в соответствии с файлом PCK. См. заголовок `EditorExportPlatform <https://github.com/godotengine/godot/blob/master/editor/export/editor_export_platform.h>`__ для справки. ``run_icon.svg`` (16×16) должен присутствовать в папке платформы, если :ref:`doc_one-click_deploy` реализован для целевой платформы. Этот значок отображается в верхней части редактора, когда для целевой платформы настроено развертывание в один клик.

source: If the target platform doesn't support running Vulkan, Direct3D 12, OpenGL 3.3, or OpenGL ES 3.0, you have two options:
it: Se la piattaforma di destinazione non supporta l'esecuzione di Vulkan, Direct3D 12, OpenGL 3.3 o OpenGL ES 3.0, ci sono due opzioni:
ru: Если целевая платформа не поддерживает запуск Vulkan, Direct3D 12, OpenGL 3.3 или OpenGL ES 3.0, у вас есть два варианта:

source: Use a library at runtime to translate Vulkan or OpenGL calls to another graphics API. For example, `MoltenVK <https://moltengl.com/moltenvk/>`__ is used on macOS to translate Vulkan to Metal at runtime.
it: Utilizzare una libreria in fase di esecuzione per tradurre le chiamate di Vulkan o OpenGL in un'altra API grafica. Ad esempio, `MoltenVK <https://moltengl.com/moltenvk/>`__ è utilizzato su macOS per tradurre Vulkan in Metal in fase di esecuzione.
ru: Используйте библиотеку во время выполнения для преобразования вызовов Vulkan или OpenGL в другой графический API. Например, `MoltenVK <https://moltengl.com/moltenvk/>`__ используется в macOS для преобразования вызовов Vulkan в Metal во время выполнения.

source: Create a new renderer from scratch. This is a large undertaking, especially if you want to support both 2D and 3D rendering with advanced features.
it: Creare un nuovo motore di rendering da zero. È un'impresa impegnativa, soprattutto se si desidera supportare sia il rendering 2D sia quello 3D con funzionalità avanzate.
ru: Создание нового рендерера с нуля. Это серьёзная задача, особенно если вы хотите поддерживать как 2D-, так и 3D-рендеринг с расширенными функциями.

source: Distributing a custom platform port
it: Distribuire un port personalizzato per una piattaforma
ru: Распространение пользовательского порта платформы

source: Before distributing a custom platform port, make sure you're allowed to distribute all the code that is being linked against. Console SDKs are typically under NDAs which prevent redistribution to the public.
it: Prima di distribuire un port personalizzato per una piattaforma, assicurarsi di avere l'autorizzazione a distribuire tutto il codice a cui è collegato. Gli SDK per console sono in genere coperti da NDA, che ne impediscono la ridistribuzione al pubblico.
ru: Прежде чем распространять портированную версию для какой-либо платформы, убедитесь, что у вас есть право распространять весь код, с которым она связана. Консольные SDK обычно подпадают под действие соглашений о неразглашении (NDA), которые запрещают её распространение среди публики.

source: Platform ports are designed to be as self-contained as possible. Most of the code can be kept within a single folder located in ``platform/``. Like :ref:`doc_custom_modules_in_cpp`, this allows for streamlining the build process by making it possible to ``git clone`` a platform folder within a Godot repository clone's ``platform/`` folder, then run ``scons platform=<name>``. No other steps are necessary for building, unless third-party platform-specific dependencies need to be installed first.
it: I port per una piattaforma sono progettati per essere il più autonomi possibile. La maggior parte del codice può essere conservata in un'unica cartella situata in ``platform/``. Come :ref:`doc_custom_modules_in_cpp`, il che consente di semplificare il processo di compilazione rendendo possibile usare ``git clone`` su una cartella di piattaforma all'interno della cartella ``platform/`` all'interno di un clone del repository di Godot, quindi eseguire ``scons platform=<name>``. Non sono necessari altri passaggi per la compilazione, a meno che non sia necessario installare prima le dipendenze di terze parti specifiche della piattaforma.
ru: Платформенные порты разработаны максимально автономными. Большая часть кода может храниться в одной папке, расположенной в ``platform/``. Как и в случае с :ref:`doc_custom_modules_in_cpp`, это позволяет оптимизировать процесс сборки, позволяя ``git clone`` создать папку платформы в папке ``platform/`` клонированного репозитория Godot, а затем выполнить ``scons platform=<name>``. Для сборки не требуется никаких дополнительных действий, за исключением случаев, когда предварительно требуется установить сторонние платформо-специфичные зависимости.

source: However, when a custom rendering driver is needed, another folder must be added in ``drivers/``. In this case, the platform port can be distributed as a fork of the Godot repository, or as a collection of several folders that can be added over a Godot Git repository clone.
it: Tuttavia, quando è necessario un driver di rendering personalizzato, è necessario aggiungere un'altra cartella in ``drivers/``. In questo caso, il port per la piattaforma può essere distribuito come fork del repository do Godot o come una raccolta di diverse cartelle che si possono aggiungere tramite un clone del repository Git di Godot.
ru: Однако, если требуется пользовательский драйвер рендеринга, необходимо добавить ещё одну папку в ``drivers/``. В этом случае порт платформы можно распространять как ответвление репозитория Godot или как набор из нескольких папок, которые можно добавить поверх клона Git-репозитория Godot.

source: If your target platform is UNIX-like, consider inheriting from the ``OS_Unix`` class to get much of the work done automatically.
ru: Если ваша целевая платформа — UNIX-подобная, рассмотрите возможность наследования от класса ``OS_Unix``, чтобы большая часть работы выполнялась автоматически.
