Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/architecture/variant_class.po
Languages: ta

source: Variant class
ta: மாறுபாடு வகுப்பு

source: About
ta: பற்றி

source: Variant is the most important datatype in Godot. A Variant takes up only 24 bytes on 64-bit platforms (20 bytes on 32-bit platforms) and can store almost any engine datatype inside of it. Variants are rarely used to hold information for long periods of time, instead they are used mainly for communication, editing, serialization and generally moving data around.
ta: கோடோட்டில் மாறுபாடு மிக முக்கியமான தரவுத்தொகுப்பாகும். ஒரு மாறுபாடு 64-பிட் இயங்குதளங்களில் (32-பிட் இயங்குதளங்களில் 20 பைட்டுகள்) 24 பைட்டுகளை மட்டுமே எடுத்துக்கொள்கிறது, மேலும் அதன் உள்ளே எந்த என்சின் டேட்டாடைப்பையும் சேமிக்க முடியும். மாறுபாடுகள் நீண்ட காலத்திற்கு தகவல்களை வைத்திருக்க அரிதாகவே பயன்படுத்தப்படுகின்றன, அதற்கு பதிலாக அவை முக்கியமாக தகவல்தொடர்பு, திருத்துதல், சீரியலைசேசன் மற்றும் பொதுவாக தரவை நகர்த்துவதற்கு பயன்படுத்தப்படுகின்றன.

source: A Variant can:
ta: ஒரு மாறுபாடு:

source: Store almost any datatype.
ta: கிட்டத்தட்ட எந்த தரவுத்தொகுப்பையும் சேமிக்கவும்.

source: Perform operations between many variants (GDScript uses Variant as its atomic/native datatype).
ta: பல வகைகளுக்கு இடையில் செயல்பாடுகளைச் செய்யுங்கள் (GDSCRIPT அதன் அணு/சொந்த தரவுத்தொகுப்பாக மாறுபாட்டைப் பயன்படுத்துகிறது).

source: Be hashed, so it can be compared quickly to other variants.
ta: ஆசெட் செய்யுங்கள், எனவே இதை மற்ற வகைகளுடன் விரைவாக ஒப்பிடலாம்.

source: Be used to convert safely between datatypes.
ta: தரவுத்தொகுப்புகளுக்கு இடையில் பாதுகாப்பாக மாற்ற பயன்படுகிறது.

source: Be used to abstract calling methods and their arguments (Godot exports all its functions through variants).
ta: அழைப்பு முறைகள் மற்றும் அவற்றின் வாதங்களை சுருக்கமாகப் பயன்படுத்தவும் (கோடோட் அதன் அனைத்து செயல்பாடுகளையும் மாறுபாடுகள் மூலம் ஏற்றுமதி செய்கிறது).

source: Be used to defer calls or move data between threads.
ta: அழைப்புகளை ஒத்திவைக்க அல்லது நூல்களுக்கு இடையில் தரவை நகர்த்த பயன்படுகிறது.

source: Be serialized as binary and stored to disk, or transferred via network.
ta: பைனரி என வரிசைப்படுத்தப்பட்டு வட்டில் சேமிக்கப்படலாம் அல்லது பிணையம் வழியாக மாற்றப்படும்.

source: Be serialized to text and use it for printing values and editable settings.
ta: உரைக்கு வரிசைப்படுத்தப்பட்டு அதை அச்சிடும் மதிப்புகள் மற்றும் திருத்தக்கூடிய அமைப்புகளுக்கு பயன்படுத்தவும்.

source: Work as an exported property, so the editor can edit it universally.
ta: ஏற்றுமதி செய்யப்பட்ட சொத்தாக வேலை செய்யுங்கள், எனவே ஆசிரியர் அதை உலகளவில் திருத்த முடியும்.

source: Be used for dictionaries, arrays, parsers, etc.
ta: அகராதிகள், வரிசைகள், பாகுபடுத்திகள் போன்றவற்றுக்கு பயன்படுத்தப்பட வேண்டும்.

source: Basically, thanks to the Variant class, writing Godot itself was a much, much easier task, as it allows for highly dynamic constructs not common of C++ with little effort. Become a friend of Variant today.
ta: அடிப்படையில், மாறுபட்ட வகுப்பிற்கு நன்றி, கோடோட்டை எழுதுவது மிகவும் எளிதான பணியாக இருந்தது, ஏனெனில் இது சிறிய முயற்சியுடன் சி ++ க்கு பொதுவானதாக இல்லாத மிகவும் மாறும் கட்டுமானங்களை அனுமதிக்கிறது. இன்று மாறுபாட்டின் நண்பராகுங்கள்.

source: All types within Variant except Nil and Object **cannot** be ``null`` and must always store a valid value. These types within Variant are therefore called *non-nullable* types.
ta: நில் மற்றும் பொருள் தவிர மாறுபட்ட அனைத்து வகைகளும் ** ** இருக்க முடியாது `` null`` மற்றும் எப்போதும் சரியான மதிப்பை சேமிக்க வேண்டும். எனவே மாறுபாட்டிற்குள் உள்ள இந்த வகைகள் *-அசைக்க முடியாத * வகைகள் என்று அழைக்கப்படுகின்றன.

source: One of the Variant types is *Nil* which can only store the value ``null``. Therefore, it is possible for a Variant to contain the value ``null``, even though all Variant types excluding Nil and Object are non-nullable.
ta: மாறுபட்ட வகைகளில் ஒன்று * nil * ஆகும், இது `` null`` மதிப்பை மட்டுமே சேமிக்க முடியும். ஆகையால், ஒரு மாறுபாடு `` பூச்ய`` மதிப்பைக் கொண்டிருக்க முடியும், நில் மற்றும் பொருளைத் தவிர்த்து அனைத்து மாறுபட்ட வகைகளும் தெளிவற்றவை அல்ல.

source: References
ta: குறிப்புகள்

source: `core/variant/variant.h <https://github.com/godotengine/godot/blob/master/core/variant/variant.h>`__
ta: `கோர்/மாறுபாடு/மாறுபாடு.

source: List of variant types
ta: மாறுபட்ட வகைகளின் பட்டியல்

source: These types are available in Variant:
ta: இந்த வகைகள் மாறுபாட்டில் கிடைக்கின்றன:

source: Type
ta: வகை

source: Notes
ta: குறிப்புகள்

source: Nil (can only store ``null``)
ta: Nil (`` null`` ஐ மட்டுமே சேமிக்க முடியும்)

source: Nullable type
ta: சுழிய வகை

source: :ref:`class_vector2`
ta: : குறிப்பு: `class_vector2`

source: :ref:`class_vector2i`
ta: : குறிப்பு: `class_vector2i`

source: :ref:`class_rect2`
ta: : குறிப்பு: `class_rect2`

source: 2D counterpart of AABB
ta: AABB இன் 2 டி எதிர்

source: :ref:`class_rect2i`
ta: : குறிப்பு: `class_rect2i`

source: :ref:`class_vector3`
ta: : குறிப்பு: `class_vector3`

source: :ref:`class_vector3i`
ta: : குறிப்பு: `class_vector3i`

source: :ref:`class_transform2d`
ta: : குறிப்பு: `class_transform2d`

source: :ref:`class_vector4i`
ta: : குறிப்பு: `class_vector4i`

source: 3D counterpart of Rect2
ta: Rect2 இன் 3D எதிர்

source: :ref:`class_transform3d`
ta: : குறிப்பு: `class_transform3d`

source: :ref:`class_projection`
ta: : Ref: `class_probrection`

source: :ref:`class_nodepath`
ta: : குறிப்பு: `class_nodepath`

source: :ref:`class_packedint32array`
ta: : குறிப்பு: `class_packedint32array`

source: :ref:`class_packedint64array`
ta: : குறிப்பு: `class_packedint64array`

source: :ref:`class_packedfloat32array`
ta: : குறிப்பு: `class_packedfloat32array`

source: :ref:`class_packedfloat64array`
ta: : குறிப்பு: `class_packedfloat64array`

source: :ref:`class_packedstringarray`
ta: : குறிப்பு: `class_packedStringarray`

source: :ref:`class_packedvector2array`
ta: : குறிப்பு: `class_packedvector2array`

source: :ref:`class_packedvector3array`
ta: : குறிப்பு: `class_packedvector3array`

source: :ref:`class_packedcolorarray`
ta: : குறிப்பு: `class_packedColorarray`

source: :ref:`class_packedvector4array`
ta: : குறிப்பு: `class_packedvector4array`

source: Containers: Array and Dictionary
ta: கொள்கலன்கள்: வரிசை மற்றும் அகராதி

source: Both :ref:`class_array` and :ref:`class_dictionary` are implemented using variants. A Dictionary can match any datatype used as key to any other datatype. An Array just holds an array of Variants. Of course, a Variant can also hold a Dictionary or an Array inside, making it even more flexible.
ta: இரண்டும்: குறிப்பு: `class_array` மற்றும்: ref:` class_dictionary` மாறுபாடுகளைப் பயன்படுத்தி செயல்படுத்தப்படுகிறது. ஒரு அகராதி வேறு எந்த தரவுத்தொகுப்பிற்கும் முக்கியமாக பயன்படுத்தப்படும் எந்த தரவுத்தொகுப்பையும் பொருத்தலாம். ஒரு வரிசை மாறுபாடுகளின் வரிசையைக் கொண்டுள்ளது. நிச்சயமாக, ஒரு மாறுபாடு ஒரு அகராதி அல்லது ஒரு வரிசையை உள்ளே வைத்திருக்க முடியும், இது இன்னும் நெகிழ்வானதாக இருக்கும்.

source: Modifications to a container will modify all references to it. A Mutex should be created to lock it if :ref:`multi-threaded access <doc_using_multiple_threads>` is desired.
ta: ஒரு கொள்கலனுக்கான மாற்றங்கள் அதற்கான அனைத்து குறிப்புகளையும் மாற்றியமைக்கும். அதைப் பூட்ட ஒரு மியூடெக்ச் உருவாக்கப்பட வேண்டும்: ref: `மல்டி-திரிக்கப்பட்ட அணுகல் <doc_using_multiple_threads>` விரும்பப்படுகிறது.

source: `core/variant/dictionary.h <https://github.com/godotengine/godot/blob/master/core/variant/dictionary.h>`__
ta: `கோர்/மாறுபாடு/அகராதி.

source: `core/variant/array.h <https://github.com/godotengine/godot/blob/master/core/variant/array.h>`__
ta: `கோர்/மாறுபாடு/வரிசை.
