Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/inspector_plugins.po
Languages: ga, it, ru, ta, uk, zh_tw

source: Inspector plugins
ga: Breiseáin Cigire
it: Estensioni dell'Ispettore
ru: Плагины инспектора
ta: இன்ச்பெக்டர் செருகுநிரல்கள்
uk: Плагіни Inspector
zh_tw: 屬性檢查器外掛

source: The inspector dock allows you to create custom widgets to edit properties through plugins. This can be beneficial when working with custom datatypes and resources, although you can use the feature to change the inspector widgets for built-in types. You can design custom controls for specific properties, entire objects, and even separate controls associated with particular datatypes.
ga: Ligeann duga an chigire duit giuirléidí saincheaptha a chruthú chun airíonna a chur in eagar trí fhorlíontáin. Is féidir é seo a bheith tairbheach agus tú ag obair le cineálacha sonraí agus acmhainní saincheaptha, cé gur féidir leat an ghné a úsáid chun giuirléidí cigire a athrú le haghaidh cineálacha ionsuite. Is féidir leat rialuithe saincheaptha a dhearadh le haghaidh airíonna sonracha, réada iomlána, agus fiú rialuithe ar leith a bhaineann le cineálacha sonraí ar leith.
it: Il pannello dell'ispettore consente di creare widget personalizzati per modificare le proprietà tramite estensioni. Ciò può essere utile quando si lavora con tipi di dati e risorse personalizzati, sebbene sia possibile utilizzare la funzionalità per modificare i widget per i tipi predefiniti. È possibile progettare controlli personalizzati per proprietà specifiche, interi oggetti e addirittura controlli separati associati a tipi specifici di dati.
ru: Панель инспектора позволяет создавать пользовательские виджеты для редактирования свойств с помощью плагинов. Это может быть полезно при работе с пользовательскими типами данных и ресурсами, хотя вы также можете использовать эту функцию для изменения виджетов инспектора для встроенных типов. Вы можете создавать пользовательские элементы управления для конкретных свойств, целых объектов и даже отдельные элементы управления, связанные с определёнными типами данных.
ta: செருகுநிரல்கள் மூலம் பண்புகளைத் திருத்த தனிப்பயன் விட்செட்களை உருவாக்க இன்ச்பெக்டர் கப்பல்துறை உங்களை அனுமதிக்கிறது. தனிப்பயன் தரவுத்தொகுப்புகள் மற்றும் வளங்களுடன் பணிபுரியும் போது இது நன்மை பயக்கும், இருப்பினும் உள்ளமைக்கப்பட்ட வகைகளுக்கு இன்ச்பெக்டர் விட்செட்களை மாற்ற அம்சத்தைப் பயன்படுத்தலாம். குறிப்பிட்ட பண்புகள், முழு பொருள்களுக்கும், குறிப்பிட்ட தரவுத்தொகுப்புகளுடன் தொடர்புடைய தனி கட்டுப்பாடுகளுக்கும் தனிப்பயன் கட்டுப்பாடுகளை நீங்கள் வடிவமைக்கலாம்.
uk: Панель інспектора дозволяє створювати власні віджети для редагування властивостей за допомогою плагінів. Це може бути корисним під час роботи з настроюваними типами даних і ресурсами, хоча ви можете використовувати цю функцію, щоб змінити віджети інспектора для вбудованих типів. Ви можете створювати спеціальні елементи керування для певних властивостей, цілих об’єктів і навіть окремих елементів керування, пов’язаних із певними типами даних.
zh_tw: 屬性檢查器面板允許你透過外掛建立自訂小工具來編輯屬性。這在處理自訂資料型別與資源時特別有用，但你也可以利用這個功能修改內建型別的屬性檢查器小工具。你可以為特定屬性、整個物件，甚至特定資料型別設計專屬的自訂控制項。

source: This guide explains how to use the :ref:`class_EditorInspectorPlugin` and :ref:`class_EditorProperty` classes to create a custom interface for integers, replacing the default behavior with a button that generates random values between 0 and 99.
ga: Míníonn an treoir seo conas aicm:ref: `Class_EditorInspectorPlugin` agus:ref: `Class_EditorProperty` a úsáid chun comhéadan saincheaptha a chruthú do shláimhreacha, agus cnaipe a ghineann luachanna randamacha idir 0 agus 99 in ionad an iompraíochta réamhshocraithe.
it: Questa guida spiega come utilizzare le classi :ref:`class_EditorInspectorPlugin` e :ref:`class_EditorProperty` per creare un'interfaccia personalizzata per i numeri interi, sostituendo il comportamento predefinito con un pulsante che genera valori casuali compresi tra 0 e 99.
ru: В этом руководстве объясняется, как использовать классы :ref:`class_EditorInspectorPlugin` и :ref:`class_EditorProperty` для создания пользовательского интерфейса для целых чисел, заменяя поведение по умолчанию кнопкой, которая генерирует случайные значения от 0 до 99.
ta: இந்த வழிகாட்டி எவ்வாறு பயன்படுத்துவது என்பதை விளக்குகிறது: Ref: `class_editotitorinspectorplugin` மற்றும்: ref:` class_editorproperty` வகுப்புகள் முழு எண்களுக்கான தனிப்பயன் இடைமுகத்தை உருவாக்க, இயல்புநிலை நடத்தையை 0 மற்றும் 99 க்கு இடையில் சீரற்ற மதிப்புகளை உருவாக்கும் ஒரு பொத்தானை மாற்றும்.
uk: У цьому посібнику пояснюється, як використовувати класи :ref:`class_EditorInspectorPlugin` і :ref:`class_EditorProperty` для створення спеціального інтерфейсу для цілих чисел, замінюючи стандартну поведінку кнопкою, яка генерує випадкові значення від 0 до 99.
zh_tw: 本指南說明如何使用 :ref:`class_EditorInspectorPlugin` 與 :ref:`class_EditorProperty` 類別，為整數型別建立自訂介面，將預設的編輯行為替換為一個能產生 0 到 99 隨機值的按鈕。

source: The default behavior on the left and the end result on the right.
ga: An t-iompar réamhshocraithe ar chlé agus an toradh deiridh ar dheis.
it: Il comportamento predefinito a sinistra e il risultato finale a destra.
ru: Поведение по умолчанию слева и конечный результат справа.
ta: இடதுபுறத்தில் இயல்புநிலை நடத்தை மற்றும் வலதுபுறத்தில் இறுதி முடிவு.
uk: Поведінка за замовчуванням ліворуч і кінцевий результат праворуч.
zh_tw: 左側為預設行為，右側為最終效果。

source: Setting up your plugin
ga: Do bhreiseán a bhunú
it: Configurazione della propria estensione
ru: Настройка вашего плагина
ta: உங்கள் சொருகி அமைத்தல்
uk: Налаштування плагіна
zh_tw: 設定你的外掛

source: Create a new empty plugin to get started.
ga: Cruthaigh breiseán folamh nua chun tosú.
it: Creare un nuovo plugin vuoto per cominciare.
ru: Чтобы начать, создайте новый пустой плагин.
ta: தொடங்க புதிய வெற்று சொருகி உருவாக்கவும்.
uk: Щоб почати, створіть новий порожній плагін.
zh_tw: 先建立一個全新的空白外掛。

source: See :ref:`doc_making_plugins` guide to set up your new plugin.
ga: Féach:ref: treoir `doc_making_plugins` chun do bhreiseán nua a chur ar bun.
it: Consultare la guida :ref:`doc_making_plugins` per configurare la propria nuova estensione.
ru: Инструкции по настройке нового плагина см. в руководстве :ref:`doc_making_plugins`.
ta: காண்க: குறிப்பு: உங்கள் புதிய சொருகி அமைக்க `doc_making_plugins` வழிகாட்டி.
uk: Перегляньте :ref:`doc_making_plugins` посібник, щоб налаштувати ваш новий плагін.
zh_tw: 請參閱 :ref:`doc_making_plugins` 指南，來設定你的新外掛。

source: Let's assume you've called your plugin folder ``my_inspector_plugin``. If so, you should end up with a new ``addons/my_inspector_plugin`` folder that contains two files: ``plugin.cfg`` and ``plugin.gd``.
ga: Glacaimis leis gur thug tú glaoch ar d'fhillteán breiseán ``my_inspector_plugin``. Más ea, ba chóir duit fillteán nua ``addons/my_inspector_plugin`` ina bhfuil dhá chomhad: `plugin.cfg`` agus ``plugin.gd``.
it: Supponiamo che il nome della cartella delle proprie estensioni sia ``my_inspector_plugin``. In tal caso, si dovrebbe creare una nuova cartella ``addons/my_inspector_plugin`` che contiene due file: ``plugin.cfg`` e ``plugin.gd``.
ru: Предположим, вы назвали папку плагина ``my_inspector_plugin``. В этом случае у вас должна появиться новая папка ``addons/my_inspector_plugin``, содержащая два файла: ``plugin.cfg`` и ``plugin.gd``.
ta: உங்கள் சொருகி கோப்புறை `` my_inspector_plugin`` என்று அழைத்தீர்கள் என்று வைத்துக் கொள்வோம். அப்படியானால், இரண்டு கோப்புகளைக் கொண்ட புதிய `` addons/my_inspector_plugin`` கோப்புறையுடன் நீங்கள் முடிவடையும்: `` சொருகி.
uk: Припустімо, що ви назвали папку плагіна ``my_inspector_plugin``. Якщо так, у вас має бути нова папка addons/my_inspector_plugin, яка містить два файли: plugin.cfg і plugin.gd.
zh_tw: 假設你的外掛資料夾命名為 ``my_inspector_plugin``，你應該會有一個 ``addons/my_inspector_plugin`` 資料夾，裡面包含兩個檔案：``plugin.cfg`` 及 ``plugin.gd``。

source: As before, ``plugin.gd`` is a script extending :ref:`class_EditorPlugin` and you need to introduce new code for its ``_enter_tree`` and ``_exit_tree`` methods. To set up your inspector plugin, you must load its script, then create and add the instance by calling ``add_inspector_plugin()``. If the plugin is disabled, you should remove the instance you have added by calling ``remove_inspector_plugin()``.
ga: Mar a bhí roimhe seo, is script é `plugin.gd`` ag leathnú: ref: `Class_editorPlugin` agus ní mór duit cód nua a thabhairt isteach dá modhanna ``_enter_tree`` agus ``_exit_tree``. Chun do bhreiseán cigire a chur ar bun, ní mór duit a script a luchtú, ansin an sampla a chruthú agus a chur leis trí ghlaoch ar ``add_inspector_plugin () `. Má tá an breiseán míchumasaithe, ba chóir duit an cás a chuir tú leis a bhaint trí ghlaoch ar `remove_inspector_plugin () `.
it: Come in precedenza, ``plugin.gd`` è uno script che estende :ref:`class_EditorPlugin` ed è necessario introdurre nuovo codice per i suoi metodi ``_enter_tree`` e ``_exit_tree``. Per configurare l'estensione dell'ispettore, è necessario caricare il suo script, quindi creare e aggiungere l'istanza chiamando ``add_inspector_plugin()``. Se l'estensione è disabilitata, è necessario rimuovere l'istanza aggiunta chiamando ``remove_inspector_plugin()``.
ru: Как и прежде, ``plugin.gd`` — это скрипт, расширяющий :ref:`class_EditorPlugin`, и вам необходимо добавить новый код для его методов ``_enter_tree`` и ``_exit_tree``. Чтобы настроить плагин-инспектор, необходимо загрузить его скрипт, а затем создать и добавить экземпляр, вызвав ``add_inspector_plugin()``. Если плагин отключён, необходимо удалить добавленный экземпляр, вызвав ``remove_inspector_plugin()``.
ta: முன்பு போலவே, `` சொருகி. சி.டி`` என்பது ஒரு ச்கிரிப்ட் விரிவாக்குகிறது: குறிப்பு: `class_editorplugin` மற்றும் அதன்` _ENTER_TREE`` மற்றும் `_EXIT_TREE`` முறைகளுக்கு புதிய குறியீட்டை அறிமுகப்படுத்த வேண்டும். உங்கள் இன்ச்பெக்டர் சொருகி அமைக்க, நீங்கள் அதன் ச்கிரிப்டை ஏற்ற வேண்டும், பின்னர் `` add_inspector_plugin () `` என்று அழைப்பதன் மூலம் நிகழ்வை உருவாக்கி சேர்க்க வேண்டும். சொருகி முடக்கப்பட்டிருந்தால், `` remate_inspector_plugin () `` என்று அழைப்பதன் மூலம் நீங்கள் சேர்த்த நிகழ்வை அகற்ற வேண்டும்.
uk: Як і раніше, ``plugin.gd`` — це сценарій, що розширює :ref:`class_EditorPlugin`, і вам потрібно ввести новий код для його методів ``_enter_tree`` і ``_exit_tree``. Щоб налаштувати плагін інспектора, ви повинні завантажити його сценарій, а потім створити та додати екземпляр, викликавши ``add_inspector_plugin()``. Якщо плагін вимкнено, ви повинні видалити екземпляр, який ви додали, викликавши ``remove_inspector_plugin()``.
zh_tw: 和以往一樣，``plugin.gd`` 是一個繼承自 :ref:`class_EditorPlugin` 的腳本，你需要在 ``_enter_tree`` 與 ``_exit_tree`` 方法中新增程式碼。若要註冊你的屬性檢查器外掛，必須載入其腳本，然後使用 ``add_inspector_plugin()`` 來建立並新增實例。若外掛被停用時，應以 ``remove_inspector_plugin()`` 移除你新增的實例。

source: Here, you are loading a script and not a packed scene. Therefore you should use ``new()`` instead of ``instantiate()``.
ga: Anseo, tá script á luchtú agat agus ní radharc pacáilte. Dá bhrí sin ba chóir duit ``new () ``a úsáid in ionad ``instantiate ()``.
it: Qui, si sta caricando uno script e non una scena compressa. Pertanto, si consiglia di usare ``new()`` invece di ``instantiate()``.
ru: Здесь вы загружаете скрипт, а не упакованную сцену. Поэтому следует использовать ``new()`` вместо ``instantiate()``.
ta: இங்கே, நீங்கள் ஒரு ச்கிரிப்டை ஏற்றுகிறீர்கள், நிரம்பிய காட்சி அல்ல. எனவே `` உடனடி () `` க்கு பதிலாக `` புதிய () `` ஐப் பயன்படுத்த வேண்டும்.
uk: Тут ви завантажуєте сценарій, а не упаковану сцену. Тому вам слід використовувати ``new()`` замість ``instantiate()``.
zh_tw: 這裡你載入的是腳本而非已封裝場景，因此應使用 ``new()``，而不是 ``instantiate()``。

source: Interacting with the inspector
ga: Idirghníomhú leis an gcigre
it: Interagire con l'ispettore
ru: Взаимодействие с инспектором
ta: இன்ச்பெக்டருடன் தொடர்புகொள்வது
uk: Взаємодія з інспектором
zh_tw: 與屬性檢查器互動

source: To interact with the inspector dock, your ``my_inspector_plugin.gd`` script must extend the :ref:`class_EditorInspectorPlugin` class. This class provides several virtual methods that affect how the inspector handles properties.
ga: Chun idirghníomhú leis an duga cigire, caithfidh do script ``my_inspector_plugin.gd`` an rang :ref:`class_EditorInspectorPlugin` a shíneadh. Soláthraíonn an rang seo roinnt modhanna fíorúla a théann i bhfeidhm ar an gcaoi a láimhseálann an cigire airíonna.
it: Per interagire con il pannello dell'ispettore, lo script ``my_inspector_plugin.gd`` deve estendere la classe :ref:`class_EditorInspectorPlugin`. Questa classe fornisce diversi metodi virtuali che influenzano il modo in cui l'ispettore gestisce le proprietà.
ru: Для взаимодействия с панелью инспектора ваш скрипт ``my_inspector_plugin.gd`` должен расширять класс :ref:`class_EditorInspectorPlugin`. Этот класс предоставляет несколько виртуальных методов, влияющих на обработку свойств инспектором.
ta: இன்ச்பெக்டர் கப்பல்துறையுடன் தொடர்பு கொள்ள, உங்கள் `` my_inspector_plugin.gd`` ச்கிரிப்ட்: ref: `class_editorinspectorplugin` வகுப்பை நீட்டிக்க வேண்டும். இந்த வகுப்பு இன்ச்பெக்டர் பண்புகளை எவ்வாறு கையாளுகிறது என்பதைப் பாதிக்கும் பல மெய்நிகர் முறைகளை வழங்குகிறது.
uk: Щоб взаємодіяти з доком інспектора, ваш скрипт ``my_inspector_plugin.gd`` має розширювати клас :ref:`class_EditorInspectorPlugin`. Цей клас надає кілька віртуальних методів, які впливають на те, як інспектор обробляє властивості.
zh_tw: 要與屬性檢查器面板互動，你的 ``my_inspector_plugin.gd`` 腳本必須繼承 :ref:`class_EditorInspectorPlugin` 類別。這個類別提供多個虛擬方法，能影響屬性檢查器如何處理屬性。

source: To have any effect at all, the script must implement the ``_can_handle()`` method. This function is called for each edited :ref:`class_Object` and must return ``true`` if this plugin should handle the object or its properties.
ga: Chun aon éifeacht a bheith aige ar chor ar bith, ní mór don script an modh ``_can_handle () ``a chur i bhfeidhm. Glaítear an fheidhm seo do gach eagarthó:ref: `Class_Object` agus ní mór do ``true`` a thabhairt ar ais más chóir don breiseán seo an réad nó a airíonna a láimhseáil.
it: Per avere effetto, lo script deve implementare il metodo ``_can_handle()``. Questa funzione viene chiamata per ogni :ref:`class_Object` modificato e deve restituire ``true`` se questa estensione deve gestire l'oggetto o le sue proprietà.
ru: Чтобы скрипт хоть как-то действовал, он должен реализовывать метод ``_can_handle()``. Эта функция вызывается для каждого отредактированного объекта :ref:`class_Object` и должна возвращать ``true``, если плагин должен обрабатывать объект или его свойства.
ta: எந்தவொரு விளைவையும் ஏற்படுத்த, ச்கிரிப்ட் `_CAN_HANDLE ()` `முறையை செயல்படுத்த வேண்டும். இந்த செயல்பாடு ஒவ்வொரு திருத்தப்பட்ட: ref: `class_object` மற்றும் இந்த சொருகி பொருள் அல்லது அதன் பண்புகளைக் கையாள வேண்டும் என்றால்` `உண்மை`` திரும்ப வேண்டும்.
uk: Щоб мати будь-який ефект, сценарій повинен реалізувати метод ``_can_handle()``. Ця функція викликається для кожного відредагованого :ref:`class_Object` і має повертати ``true``, якщо цей плагін має обробляти об’єкт або його властивості.
zh_tw: 要讓腳本生效，必須實作 ``_can_handle()`` 方法。這個方法會針對每個被編輯的 :ref:`class_Object` 進行呼叫，若此外掛應處理該物件或其屬性，則需回傳 ``true``。

source: This includes any :ref:`class_Resource` attached to the object.
ga: Áirítear leis seo aon: ref: `Class_Resource` atá ceangailte leis an réad.
it: Ciò include qualsiasi :ref:`class_Resource` associata all'oggetto.
ru: Это включает в себя любой :ref:`class_Resource`, прикрепленный к объекту.
ta: இதில் ஏதேனும்: ref: `class_resource` பொருளுடன் இணைக்கப்பட்டுள்ளது.
uk: Це включає будь-який :ref:`class_Resource`, приєднаний до об’єкта.
zh_tw: 這也包含附加在物件上的任何 :ref:`class_Resource`。

source: You can implement four other methods to add controls to the inspector at specific positions. The ``_parse_begin()`` and ``_parse_end()`` methods are called only once at the beginning and the end of parsing for each object, respectively. They can add controls at the top or bottom of the inspector layout by calling ``add_custom_control()``.
ga: Is féidir leat ceithre mhodh eile a chur i bhfeidhm chun rialuithe a chur leis an gcigre ag poist ar leith. Ní thugtar ar na modhanna ``_parse_begin () ``agus ``_parse_end ()`` ach uair amháin ag tús agus ag deireadh an pháirseála do gach réad, faoi seach. Is féidir leo rialuithe a chur ag barr nó bun leagan amach an chigire trí ghlaoch ar ``add_custom_control () `.
it: È possibile implementare altri quattro metodi per aggiungere controlli all'ispettore in posizioni specifiche. I metodi ``_parse_begin()`` e ``_parse_end()`` vengono chiamati una sola volta, rispettivamente all'inizio e alla fine dell'analisi di ciascun oggetto. Possono aggiungere controlli in cima o in fondo al layout dell'ispettore chiamando ``add_custom_control()``.
ru: Вы можете реализовать четыре других метода для добавления элементов управления в инспектор в определённых позициях. Методы ``_parse_begin()`` и ``_parse_end()`` вызываются только один раз в начале и в конце разбора каждого объекта соответственно. Они позволяют добавлять элементы управления в верхнюю или нижнюю часть макета инспектора, вызывая ``add_custom_control()``.
ta: குறிப்பிட்ட நிலைகளில் இன்ச்பெக்டருக்கு கட்டுப்பாடுகளைச் சேர்க்க வேறு நான்கு முறைகளை நீங்கள் செயல்படுத்தலாம். `_Parse_begin ()` `மற்றும்` `_Parse_End ()` `முறைகள் முறையே ஒவ்வொரு பொருளுக்கும் பாகுபடுத்தலின் முடிவில் ஒரு முறை மட்டுமே அழைக்கப்படுகின்றன. `` Add_custom_control () `` என்று அழைப்பதன் மூலம் அவர்கள் இன்ச்பெக்டர் தளவமைப்பின் மேல் அல்லது கீழ் கட்டுப்பாடுகளைச் சேர்க்கலாம்.
uk: Ви можете реалізувати чотири інші методи, щоб додати елементи керування до інспектора на певних позиціях. Методи ``_parse_begin()`` і ``_parse_end()`` викликаються лише один раз на початку та в кінці аналізу для кожного об’єкта відповідно. Вони можуть додавати елементи керування вгорі чи внизу макета інспектора, викликаючи add_custom_control()`.
zh_tw: 你可以另外實作四個方法，在屬性檢查器的特定位置新增控制項。``_parse_begin()`` 和 ``_parse_end()`` 會分別在解析每個物件的開頭和結尾時僅呼叫一次。這兩個方法可透過 ``add_custom_control()`` 在屬性檢查器的上方或下方新增控制項。

source: As the editor parses the object, it calls the ``_parse_category()`` and ``_parse_property()`` methods. There, in addition to ``add_custom_control()``, you can call both ``add_property_editor()`` and ``add_property_editor_for_multiple_properties()``. Use these last two methods to specifically add :ref:`class_EditorProperty`-based controls.
ga: De réir mar a dhéanann an t-eagarthóir an réad a pháirseáil, glaonn sé na modhanna ``_parse_category () ``agus ``_parse_property ()``. Ansin, i dteannta le ``add_custom_control () ``, is féidir leat glaoch ar ``add_property_editor ()`` agus ``add_property_editor_for_multiple_properties () ``. Úsáid an dá mhodh deireanach seo chun rialuithe bunaithe ar: ref: `Class_EditorProperty` a chur leis go sonrach.
it: Mentre l'editor analizza l'oggetto, richiama i metodi ``_parse_category()`` e ``_parse_property()``. Oltre a ``add_custom_control()``, è possibile richiamare anche ``add_property_editor()`` e ``add_property_editor_for_multiple_properties()``. Questi ultimi due metodi si utilizzano per aggiungere specificamente controlli basati su :ref:`class_EditorProperty`.
ru: При разборе объекта редактор вызывает методы ``_parse_category()`` и ``_parse_property()``. Помимо ``add_custom_control()``, здесь можно вызывать ``add_property_editor()`` и ``add_property_editor_for_multiple_properties()``. Используйте эти два последних метода для добавления элементов управления на основе :ref:`class_EditorProperty`.
ta: ஆசிரியர் பொருளை பாகுபடுத்துகையில், அது `_Parse_Category ()` `` மற்றும் `_parse_property ()` `முறைகள் என்று அழைக்கிறது. அங்கு, `` add_custom_control () `` என்பதற்கு கூடுதலாக, நீங்கள் `` add_property_editor () `` `மற்றும்` `add_property_editor_for_multiple_properties ()` `இரண்டையும் அழைக்கலாம். குறிப்பாகச் சேர்க்க இந்த கடைசி இரண்டு முறைகளைப் பயன்படுத்தவும்: குறிப்பு: `class_editorproperty` அடிப்படையிலான கட்டுப்பாடுகள்.
uk: Коли редактор аналізує об’єкт, він викликає методи ``_parse_category()`` і ``_parse_property()``. Там, окрім ``add_custom_control()``, ви можете викликати як ``add_property_editor()``, так і ``add_property_editor_for_multiple_properties()``. Використовуйте останні два методи, щоб спеціально додати елементи керування на основі :ref:`class_EditorProperty`.
zh_tw: 編輯器解析物件時，會呼叫 ``_parse_category()`` 和 ``_parse_property()`` 方法。在這兩個方法中，除了 ``add_custom_control()``，你還可以呼叫 ``add_property_editor()`` 及 ``add_property_editor_for_multiple_properties()``。這兩個方法是專門用來新增基於 :ref:`class_EditorProperty` 的控制項。

source: Adding an interface to edit properties
ga: Comhéadan a chur leis chun airíonna a chur in eagar
it: Aggiungere un interfaccia per modifiche le proprietà
ru: Добавление интерфейса для редактирования свойств
ta: பண்புகளைத் திருத்த ஒரு இடைமுகத்தைச் சேர்ப்பது
uk: Додавання інтерфейсу для редагування властивостей
zh_tw: 新增屬性編輯介面

source: The :ref:`class_EditorProperty` class is a special type of :ref:`class_Control` that can interact with the inspector dock's edited objects. It doesn't display anything but can house any other control nodes, including complex scenes.
ga: Is cineál speisialta de:ref: `Class_EditorProperty` aicme:ref: `Class_Control` atá in ann idirghníomhú le rudaí eagarthóireachta duga an chigire. Ní thaispeánann sé aon rud ach féadann sé aon nóid rialaithe eile a bheith ann, lena n-áirítear radhairc chasta.
ru: Класс :ref:`class_EditorProperty` — это особый тип :ref:`class_Control`, который может взаимодействовать с редактируемыми объектами в доке инспектора. Он ничего не отображает, но может содержать любые другие элементы управления, включая сложные сцены.
ta: தி: ref: `class_editorproperty` வகுப்பு என்பது ஒரு சிறப்பு வகை: குறிப்பு:` class_control` இது இன்ச்பெக்டர் கப்பல்துறையின் திருத்தப்பட்ட பொருள்களுடன் தொடர்பு கொள்ளலாம். இது எதையும் காட்டாது, ஆனால் சிக்கலான காட்சிகள் உட்பட வேறு எந்த கட்டுப்பாட்டு முனைகளையும் வைத்திருக்க முடியும்.
uk: Клас :ref:`class_EditorProperty` — це особливий тип :ref:`class_Control`, який може взаємодіяти з відредагованими об’єктами дока інспектора. Він нічого не відображає, але може розміщувати будь-які інші вузли керування, включаючи складні сцени.
zh_tw: :ref:`class_EditorProperty` 類別是一種特殊的 :ref:`class_Control`，可與屬性檢查器面板所編輯的物件互動。它本身不會顯示任何內容，但可以容納其他控制項節點，甚至是複雜的場景。

source: There are three essential parts to the script extending :ref:`class_EditorProperty`:
ga: Tá trí chuid riachtanacha ann don script ag leathnú: ref: `Class_editorProperty`:
it: Ci sono tre parti essenziali nello script che estende :ref:`class_EditorProperty`:
ru: Скрипт, расширяющий :ref:`class_EditorProperty`, состоит из трех основных частей:
ta: ச்கிரிப்டுக்கு மூன்று அத்தியாவசிய பாகங்கள் உள்ளன: குறிப்பு: `class_editorproperty`:
uk: Є три основні частини сценарію, що розширює :ref:`class_EditorProperty`:
zh_tw: 擴充 :ref:`class_EditorProperty` 的腳本有三個主要部分：

source: You must define the ``_init()`` method to set up the control nodes' structure.
ga: Ní mór duit an modh ``_init () ``a shainiú chun struchtúr na nóid rialaithe a bhunú.
it: È necessario definire il metodo ``_init()`` per impostare la struttura dei nodi di controllo.
ru: Для настройки структуры узлов управления необходимо определить метод ``_init()``.
ta: கட்டுப்பாட்டு முனைகளை அமைப்பதற்கான `` _init () `` முறையை நீங்கள் வரையறுக்க வேண்டும்.
uk: Ви повинні визначити метод ``_init()``, щоб налаштувати структуру вузлів керування.
zh_tw: 你必須定義 ``_init()`` 方法，來設定控制項節點結構。

source: You should implement the ``_update_property()`` to handle changes to the data from the outside.
ga: Ba chóir duit an ``_update_property () ``a chur i bhfeidhm chun athruithe ar na sonraí ón taobh amuigh a láimhseáil.
it: Si dovrebbe implementare ``_update_property()`` per gestire le modifiche ai dati provenienti da fuori.
ru: Вам следует реализовать ``_update_property()`` для обработки изменений данных извне.
ta: வெளியில் இருந்து தரவுகளுக்கான மாற்றங்களைக் கையாள நீங்கள் `` _update_property () `` செயல்படுத்த வேண்டும்.
uk: Ви повинні застосувати ``_update_property()`` для обробки змін даних ззовні.
zh_tw: 你應該實作 ``_update_property()`` 來處理外部對資料的更動。
