Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/inspector_plugins.po
Languages: ga, it, ru, ta, uk, zh_tw

source: A signal must be emitted at some point to inform the inspector that the control has changed the property using ``emit_changed``.
ga: Ní mór comhartha a astú ag pointe éigin chun an cigre a chur ar an eolas go bhfuil an rialú tar éis an maoin a athrú ag baint úsáide as ``emit_changed`.
it: A un certo punto si deve emettere un segnale per informare l'ispettore che il controllo ha modificato la proprietà utilizzando ``emit_changed``.
ru: В какой-то момент должен быть выдан сигнал, информирующий инспектора о том, что элемент управления изменил свойство с помощью ``emit_changed``.
ta: `` Emit_changed`` ஐப் பயன்படுத்தி கட்டுப்பாடு சொத்தை மாற்றியுள்ளது என்பதை இன்ச்பெக்டருக்கு தெரிவிக்க ஒரு கட்டத்தில் ஒரு சமிக்ஞை வெளியேற்றப்பட வேண்டும்.
uk: Сигнал повинен бути виданий в якийсь момент, щоб повідомити інспектору про те, що елемент керування змінив властивість за допомогою ``emit_changed``.
zh_tw: 必須在某個時機以 ``emit_changed`` 發出訊號，通知屬性檢查器該控制項已變更屬性。

source: You can display your custom widget in two ways. Use just the default ``add_child()`` method to display it to the right of the property name, and use ``add_child()`` followed by ``set_bottom_editor()`` to position it below the name.
ga: Is féidir leat do ghuirléid saincheaptha a thaispeáint ar dhá bheal Úsáid ach an modh réamhshocraithe ``add_child () ``chun é a thaispeáint ar dheis d'ainm na maoine, agus bain úsáid as ``add_child ()`` ina dhiaidh sin `set_bottom_editor () ``chun é a chur faoi bhun an ainm.
it: È possibile visualizzare il widget personalizzato in due modi. Usare solo il metodo predefinito ``add_child()`` per visualizzarlo a destra del nome della proprietà e usare ``add_child()`` seguito da ``set_bottom_editor()`` per posizionarlo sotto il nome.
ru: Вы можете отобразить свой виджет двумя способами. Используйте только метод ``add_child()`` по умолчанию, чтобы отобразить его справа от имени свойства, и используйте ``add_child()``, а затем ``set_bottom_editor()``, чтобы разместить его под именем.
ta: உங்கள் தனிப்பயன் விட்செட்டை இரண்டு வழிகளில் காண்பிக்கலாம். இயல்புநிலை `` add_child () `` முறையைப் பயன்படுத்தவும், அதை சொத்து பெயரின் வலதுபுறத்தில் காண்பிக்க, `` add_child () `` தொடர்ந்து `` set_bottom_editor () `` ஆகியவற்றைப் பயன்படுத்தவும்.
uk: Ви можете відобразити свій настроюваний віджет двома способами. Використовуйте метод за замовчуванням add_child() для відображення праворуч від назви властивості та використовуйте add_child() із наступним set_bottom_editor() щоб розташувати його під назвою.
zh_tw: 你可以用兩種方式顯示你的自訂小工具。只用預設的 ``add_child()`` 方法，會將它顯示在屬性名稱右側；若在 ``add_child()`` 後呼叫 ``set_bottom_editor()``，則會將它顯示在名稱下方。

source: Using the example code above you should be able to make a custom widget that replaces the default :ref:`class_SpinBox` control for integers with a :ref:`class_Button` that generates random values.
ga: Ag baint úsáide as an gcód samplach thuas ba chóir go mbeadh tú in ann giuirléid saincheaptha a dhéanamh a chuireann in ionad an rialaithe réamhshocraithe: ref: `Class_SpinBox` do shlámhshuimhreacha le a:ref: `Class_button` a ghineann luachanna randamacha.
it: Utilizzando il codice di esempio precedente dovrebbe essere possibile creare un widget personalizzato che sostituisce il controllo :ref:`class_SpinBox` predefinito per gli interi, con un :ref:`class_Button` che genera valori casuali.
ru: Используя приведенный выше пример кода, вы сможете создать пользовательский виджет, который заменит элемент управления по умолчанию :ref:`class_SpinBox` для целых чисел на :ref:`class_Button`, который генерирует случайные значения.
ta: மேலே உள்ள எடுத்துக்காட்டு குறியீட்டைப் பயன்படுத்தி இயல்புநிலையை மாற்றும் தனிப்பயன் விட்செட்டை நீங்கள் உருவாக்க முடியும்: குறிப்பு: `class_spinbox` முழு எண்களுக்கான கட்டுப்பாடு a: ref:` class_button` இது சீரற்ற மதிப்புகளை உருவாக்குகிறது.
uk: Використовуючи наведений вище приклад коду, ви зможете створити спеціальний віджет, який замінює стандартний елемент керування :ref:`class_SpinBox` для цілих чисел на :ref:`class_Button`, який генерує випадкові значення.
zh_tw: 使用上述範例程式碼，你應該可以製作一個自訂小工具，將整數屬性預設的 :ref:`class_SpinBox` 控制項替換為一個能產生隨機值的 :ref:`class_Button`。
