Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/community/asset_library/using_assetlib.po
Languages: ga, it, ru, ta, tr, uk, zh_hant

source: Using the Asset Library
ga: Leabharlann na Sócmhainní
it: Utilizzo della libreria dei contenuti
ru: Использование библиотеки ресурсов
ta: சொத்து நூலகத்தைப் பயன்படுத்துதல்
tr: Varlık Kütüphanesini Kullanmak
uk: Використання бібліотеки ресурсів
zh_hant: 使用素材庫

source: On the website
ga: Ar an láithreán gréasáin
it: Dal sito web
ru: На сайте
ta: இணையதளத்தில்
tr: Web sitesi üzerinde
uk: На сайті
zh_hant: 在網站上

source: Overview
ga: Forbhreathnú
it: Panoramica
ru: Обзор
ta: கண்ணோட்டம்
tr: Genel Bakış
uk: Огляд
zh_hant: 總覽

source: As mentioned before, you can access the web frontend of the Asset Library on `Godot's official website <https://godotengine.org/asset-library/asset>`_. This is what it looks like when you first visit it:
ga: Mar a luadh cheana, is féidir leat rochtain a fháil ar aghaidh gréasáin na Leabharlainne Sócmhainní ar `láithreán gréasáin oifigiúil Godot <https://godotengine.org/asset-library/asset>`_. Seo an chuma a bheidh air nuair a thugann tú cuairt air den chéad uair:
it: Come menzionato in precedenza, è possibile accedere all'interfaccia web della Libreria dei contenuti dal `sito ufficiale di Godot <https://godotengine.org/asset-library/asset>`_. Ecco come appare la prima volta che lo si visita:
ru: Как уже говорилось, вы можете получить доступ к веб-фронтенду библиотеки активов на `официальном сайте Godot <https://godotengine.org/asset-library/asset>`_. Вот как он выглядит при первом посещении:
ta: முன்பு குறிப்பிட்டபடி, `கோடோட்டின் அதிகாரப்பூர்வ வலைத்தளமான <https://godotengine.org/asset-library/asset> _ _ இல் சொத்து நூலகத்தின் வலை முன்பக்கத்தை அணுகலாம். நீங்கள் முதலில் அதைப் பார்வையிடும்போது இதுதான் தெரிகிறது:
tr: Daha önce de belirtildiği gibi, Varlık Kütüphanesi'nin web önyüzüne `Godot'nun resmi web sitesi <https://godotengine.org/asset-library/asset>`_ üzerinden erişebilirsiniz. İlk ziyaret ettiğinizde bu şekilde görünür:
uk: Як згадувалося раніше, ви можете отримати доступ до веб-інтерфейсу Asset Library на `офіційному веб-сайті Godot <https://godotengine.org/asset-library/asset>`_. Ось як він виглядає, коли ви вперше відвідуєте його:
zh_hant: 如前所述，你可以在 `Godot 官方網站 <https://godotengine.org/asset-library/asset>`_ 上使用素材庫的網頁前端。這是你第一次造訪時的畫面：

source: |image0|
ga: |íomhá0|
ta: | படம் 0 |

source: image0
ga: íomhá0
ru: изображение0
ta: படம் 0

source: At the top, you see the **header**, which takes you to various other parts of the AssetLib - at the moment, it's empty, as we are not logged in.
ga: Ag an mbarr, feiceann tú an **ceannteann**, a thógann tú chuig codanna éagsúla eile den AssetLib - i láthair na huaire, tá sé folamh, mar níl muid logáilte isteach.
it: In alto si trova l'**intestazione**, che porta ad altre parti dell'AssetLib. Al momento è vuota perché non abbiamo effettuato l'accesso.
ru: В верхней части вы видите **заголовок**, который ведёт вас к различным другим частям библиотеки AssetLib - в данный момент он пуст, так как мы не вошли в систему.
ta: மேலே, நீங்கள் ** தலைப்பு ** ஐக் காண்கிறீர்கள், இது உங்களை அசெட்லிப்பின் பல்வேறு பகுதிகளுக்கு அழைத்துச் செல்கிறது - இந்த நேரத்தில், நாங்கள் உள்நுழையாததால் அது காலியாக உள்ளது.
tr: En üstte, sizi AssetLib'in çeşitli diğer bölümlerine götüren **başlığı** görürsünüz - şu anda oturum açmadığımız için boştur.
uk: Угорі ви бачите **заголовок**, який веде до різних інших частин AssetLib - на даний момент він порожній, оскільки ми не ввійшли в систему.
zh_hant: 在頂部你會看到 **標題列**，它可以導覽到素材庫的其他區塊。目前這裡是空的，因為我們尚未登入。

source: Searching
ga: Cuardach
it: Ricerca
ru: Поиск
ta: தேடுகிறது
tr: Arama Yapma
uk: Пошук
zh_hant: 搜尋

source: In the center is the **search bar + settings** section, and the **assets** section below it - this lets you filter out certain kinds of assets based on a host of criteria. These include the asset **category** (such as 2D tools, scripts and demos), **engine version** they are intended for, **sorting order** (by update date, by name, etc.) and **support level**.
ta: மையத்தில் ** தேடல் பட்டி + அமைப்புகள் ** பிரிவு, மற்றும் அதற்கு கீழே உள்ள ** சொத்துக்கள் ** பிரிவு - இது பல வகையான சொத்துக்களை வடிகட்ட உதவுகிறது. இவற்றில் சொத்து ** வகை ** (2 டி கருவிகள், ச்கிரிப்ட்கள் மற்றும் டெமோக்கள் போன்றவை), ** என்சின் பதிப்பு ** அவை நோக்கம் கொண்டவை, ** வரிசையாக்க வரிசை ** (புதுப்பிப்பு தேதி, பெயரால், முதலியன) மற்றும்* *ஆதரவு நிலை **.
uk: У центрі знаходиться розділ **панель пошуку + налаштування**, а під ним розділ **активи** – це дозволяє відфільтрувати певні типи активів на основі безлічі критеріїв. До них належать **категорія** активів (наприклад, 2D-інструменти, сценарії та демонстрації), **версія двигуна**, для якої вони призначені, **порядок сортування** (за датою оновлення, за назвою тощо) і * *рівень підтримки**.

source: While most other filter settings should be fairly self-explanatory, it's worth going over what "support level" means in the Asset Library. Currently there are three support levels, and each asset can belong to only one.
ga: Cé gur chóir go mbeadh an chuid is mó de na socruithe scagaire eile féinmhínithe go leor, is fiú dul thar an méid a chiallaíonn “leibhéal tacaíochta” sa Leabharlan Faoi láthair tá trí leibhéal tacaíochta ann, agus ní féidir le gach sócmhainn a bheith ach le ceann amháin.
it: Sebbene la maggior parte delle altre impostazioni di filtro dovrebbe essere abbastanza intuitiva, vale la pena spiegare cosa significa "livello di supporto" nella Libreria dei contenuti. Attualmente sono disponibili tre livelli di supporto e ogni contenuto può appartenerne a uno solo.
ru: Хотя большинство других настроек фильтров должны быть достаточно понятными, стоит пояснить, что значит "уровень поддержки" в Библиотеке ресурсов. В данный момент существует три уровня поддержки и каждый ассет может принадлежать только к одному.
ta: பிற வடிகட்டி அமைப்புகள் மிகவும் தன்வய விளக்கமாக இருக்க வேண்டும் என்றாலும், சொத்து நூலகத்தில் "உதவி நிலை" என்றால் என்ன என்பதைச் செல்வது மதிப்பு. தற்போது மூன்று உதவி நிலைகள் உள்ளன, மேலும் ஒவ்வொரு சொத்தும் ஒன்றுக்கு மட்டுமே சொந்தமானது.
tr: Diğer filtre ayarlarının çoğu kendini açıklayıcı olsa da, Varlık Kütüphanesinde "destek seviyesi" 'nin ne anlama geldiğini gözden geçirmekte yarar var. Şu anda üç destek seviyesi vardır ve her varlık yalnızca birine ait olabilir.
uk: Хоча більшість інших налаштувань фільтрів мають бути досить зрозумілими, варто розглянути, що означає «рівень підтримки» в бібліотеці ресурсів. Наразі існує три рівні підтримки, і кожен актив може належати лише одному.
zh_hant: 雖然大多數其他篩選設定都很直觀，但「支援層級」在素材庫中有特殊意義。目前共有三種支援層級，每個素材只能隸屬其中之一。

source: **Official** assets are created and maintained by the official Godot Engine developers. Currently, these include the official engine demos, which showcase how various areas of the engine work.
ta: ** உத்தியோகபூர்வ ** சொத்துக்கள் அதிகாரப்பூர்வ கோடோட் எஞ்சின் உருவாக்குநர்களால் உருவாக்கப்பட்டு பராமரிக்கப்படுகின்றன. தற்போது, இவற்றில் அதிகாரப்பூர்வ என்சின் டெமோக்கள் உள்ளன, அவை இயந்திரத்தின் பல்வேறு பகுதிகள் எவ்வாறு செயல்படுகின்றன என்பதைக் காட்டுகின்றன.
uk: **Офіційні** ресурси створюються та підтримуються офіційними розробниками Godot Engine. Наразі це офіційні демонстраційні версії двигуна, які демонструють, як працюють різні сфери двигуна.

source: **Community** assets are submitted and maintained by the members of the Godot community.
ga: Cuireann baill phobal Godot sócmhainní **Pobal** isteach agus a chothabháil.
it: I contenuti della **Comunità** sono presentati e gestiti dai membri della comunità di Godot.
ru: Ассеты **Community** предоставляются и поддерживаются членами сообщества Godot.
ta: ** சமூகம் ** கோடோட் சமூகத்தின் உறுப்பினர்களால் சொத்துக்கள் சமர்ப்பிக்கப்பட்டு பராமரிக்கப்படுகின்றன.
tr: **Topluluk** varlıkları Godot topluluğunun üyeleri tarafından sunulur ve bakımı yapılır.
uk: Об’єкти **Спільноти** надсилаються та обслуговуються членами спільноти Godot.
zh_hant: **社群** 素材由 Godot 社群成員提供與維護。

source: **Testing** assets are works-in-progress, and may contain bugs and usability issues. They are not recommended for use in serious projects, but you are encouraged to download, test them, and submit issues to the original authors.
ga: Tá sócmhainní **tástála** ag obair ar siúl, agus d'fhéadfadh fabhtanna agus saincheisteanna inúsáidteachta a bheith iontu. Ní mholtar iad le húsáid i dtionscadail tromchúiseacha, ach moltar duit iad a íoslódáil, a thástáil agus saincheisteanna a chur isteach chuig na húdair bunaidh.
it: I contenuti di **Testing** sono in fase di sviluppo e potrebbero contenere bug e problemi di usabilità. Non sono consigliati per progetti seri, ma è incoraggiato scaricarle, testarle e segnalare eventuali problemi agli autori originali.
ru: Ассеты **Testing** являются незавершенными работами и могут содержать ошибки и проблемы с удобством использования. Они не рекомендуются для использования в серьезных проектах, но вам можете скачать их, протестировать и отправить проблемы авторам.
ta: ** சோதனை ** சொத்துக்கள் முன்னேற்றங்கள், மற்றும் பிழைகள் மற்றும் பயன்பாட்டினை சிக்கல்களைக் கொண்டிருக்கலாம். தீவிர திட்டங்களில் பயன்படுத்த அவை பரிந்துரைக்கப்படவில்லை, ஆனால் அவற்றை பதிவிறக்கம் செய்ய, சோதிக்கவும், அசல் ஆசிரியர்களுக்கு சிக்கல்களை சமர்ப்பிக்கவும் ஊக்குவிக்கப்படுகிறீர்கள்.
tr: **Test** varlıkları devam eden çalışmalardır ve hatalar ve kullanılabilirlik sorunları içerebilir. Ciddi projelerde kullanılmaları tavsiye edilmez, ancak indirmeniz, test etmeniz ve sorunları orijinal yazarlara iletmeniz teşvik edilir.
uk: Активи **Тестування** знаходяться в стадії розробки та можуть містити помилки та проблеми з зручністю використання. Їх не рекомендується використовувати в серйозних проектах, але ми заохочуємо їх завантажувати, тестувати та надсилати проблеми оригінальним авторам.
zh_hant: **測試** 素材處於開發中階段，可能包含錯誤或可用性問題。不建議在正式專案中使用，但鼓勵你下載試用並回報問題給原作者。

source: You can mix and match any of the search filters and criteria, and upon clicking the Search button, receive the list of all assets in the Library that match them.
ga: Is féidir leat aon cheann de na scagairí agus de na critéir chuardaigh a mheascadh agus a mheaitseáil, agus nuair a chliceáiltear ar an gcnaipe Cuardaigh, gheobhaidh tú liosta de na sócmhainní go léir sa Leabharlann a mheaitseálann iad.
it: È possibile combinare e abbinare qualsiasi filtro e criterio di ricerca e, cliccando sul pulsante Cerca, ricevere l'elenco di tutti i contenuti nella Libreria che corrispondono ai filtri.
ru: Вы можете смешивать и сопоставлять любые фильтры и критерии поиска, и после нажатия кнопки "Поиск" получить список всех ассетов в библиотеке, которые соответствуют этим критериям.
ta: எந்தவொரு தேடல் வடிப்பான்கள் மற்றும் அளவுகோல்களை நீங்கள் கலந்து பொருத்தலாம், மேலும் தேடல் பொத்தானைக் சொடுக்கு செய்தால், அவற்றுடன் பொருந்தக்கூடிய நூலகத்தில் உள்ள அனைத்து சொத்துக்களின் பட்டியலையும் பெறுங்கள்.
tr: Arama filtrelerinden ve kriterlerinden herhangi birini karıştırıp eşleştirebilir ve Ara düğmesine tıkladığınızda, Kütüphanedeki bunlarla eşleşen tüm varlıkların listesini alabilirsiniz.
uk: Ви можете поєднувати будь-які пошукові фільтри та критерії, а після натискання кнопки «Пошук» отримати список усіх ресурсів у бібліотеці, які їм відповідають.
zh_hant: 你可以任意組合搜尋篩選條件，點擊「搜尋」按鈕後，即會顯示所有符合條件的素材列表。

source: |image1|
ga: |íomhá1|
ta: | படம் 1 |

source: image1
ga: íomhá 1
ru: изображение1
ta: படம் 1

source: Note that the search results are not updated in real-time, so you will have to re-submit the search query each time you change the query settings.
ga: Tabhair faoi deara nach ndéantar na torthaí cuardaigh a nuashonrú i bhfíor-am, mar sin beidh ort an cheist cuardaigh a chur isteach arís gach uair a athraíonn tú na socruithe ceisteanna.
it: Nota che i risultati della ricerca non vengono aggiornati in tempo reale, quindi dovrai inviare nuovamente la richiesta di ricerca ogni volta che cambiano i parametri di ricerca.
ru: Обратите внимание, что результаты поиска не обновляются в режиме реального времени, поэтому вам придется заново отправлять поисковый запрос каждый раз, когда вы изменяете параметры запроса.
ta: தேடல் முடிவுகள் நிகழ்நேரத்தில் புதுப்பிக்கப்படவில்லை என்பதை நினைவில் கொள்க, எனவே ஒவ்வொரு முறையும் வினவல் அமைப்புகளை மாற்றும்போது தேடல் வினவலை மீண்டும் சமர்ப்பிக்க வேண்டும்.
tr: Arama sonuçlarının gerçek zamanlı olarak güncellenmediğini unutmayın, bu nedenle sorgu ayarlarını her değiştirdiğinizde arama sorgusunu yeniden göndermeniz gerekecektir.
uk: Зауважте, що результати пошуку не оновлюються в реальному часі, тому вам доведеться повторно надсилати пошуковий запит кожного разу, коли ви змінюєте налаштування запиту.
zh_hant: 請注意，搜尋結果並不會即時更新，每次修改搜尋條件後都需要重新送出查詢。

source: Breakdown of an asset
ga: Miondealú ar shócmhainn
it: Composizione di un contenuto
ru: Разбор ассета
ta: ஒரு சொத்தின் முறிவு
tr: Bir varlığın parçaları
uk: Розбивка активу
zh_hant: 素材頁面介紹

source: Now let's take a look at what an asset's page looks like and what it contains.
ga: Anois déanaimis féachaint ar an gcuma ar leathanach sócmhainne agus cad atá ann.
it: Diamo ora un'occhiata a come appare la pagina di un contenuto e cosa contiene.
ru: Теперь давайте рассмотрим, как выглядит страница ассета и что она содержит.
ta: இப்போது ஒரு சொத்தின் பக்கம் எப்படி இருக்கும், அதில் என்ன இருக்கிறது என்பதைப் பார்ப்போம்.
tr: Şimdi bir varlığın sayfasının neye benzediğine ve neler içerdiğine bir göz atalım.
uk: Тепер давайте подивимося, як виглядає сторінка ресурсу та що вона містить.
zh_hant: 接下來讓我們看看素材頁面長什麼樣子以及包含哪些資訊。

source: |image2|
ga: |íomhá2|
ta: | படம் 2 |

source: image2
ga: íomhá 2
ru: изображение2
ta: படம் 2

source: Asset's thumbnail/icon.
ga: Mionsamhail/deilbhín na sócmhainne.
it: Miniatura / icona del contenuto.
ru: Миниатюра/иконка ассета.
ta: சொத்தின் சிறுபடம்/ஐகான்.
tr: Varlığın küçük resmi/simgesi.
uk: Мініатюра/значок активу.
zh_hant: 素材縮圖／圖示。

source: Asset's name.
ga: Ainm na sócmhainne.
it: Nome del contenuto.
ru: Имя ассета.
ta: சொத்தின் பெயர்.
tr: Varlığın ismi.
uk: Назва активу.
zh_hant: 素材名稱。

source: Current version number of the asset.
ga: Uimhir leagan reatha na sócmhainne.
it: Numero di versione attuale del contenuto.
ru: Номер текущей версии ассета.
ta: சொத்தின் தற்போதைய பதிப்பு எண்.
tr: Varlığın geçerli sürüm numarası.
uk: Номер поточної версії ресурсу.
zh_hant: 素材目前版本號。

source: Asset's category, Godot version, and support status.
ga: Catagóir sócmhainne, leagan Godot, agus stádas tacaíochta.
it: Categoria del contenuto, versione di Godot e stato di supporto.
ru: Категория ассета, версия Godot и статус поддержки.
ta: சொத்தின் வகை, கோடோட் பதிப்பு மற்றும் உதவி நிலை.
tr: Varlığın kategorisi, Godot sürümü, ve destek durumu.
uk: Категорія активу, версія Godot і статус підтримки.
zh_hant: 素材類別、Godot 版本及支援狀態。

source: Asset's original author/submitter.
ga: Údar/aighdeoir bunaidh na sócmhainne.
it: Autore/fornitore originale del contenuto.
ru: Автор/создатель ассета.
ta: சொத்தின் அசல் ஆசிரியர்/சமர்ப்பிப்பாளர்.
tr: Varlığın asıl yazarı/göndereni.
uk: Категорія активу, версія Godot і статус підтримуються.
zh_hant: 素材原作者／提交者。

source: The license the asset is distributed under.
ga: An ceadúnas déantar an sócmhainn a dháileadh faoi.
it: La licenza con cui viene distribuito il contenuto.
ru: Лицензия распространения ассета.
ta: சொத்து சொத்து கீழ் விநியோகிக்கப்படுகிறது.
tr: Varlığın dağıtıldığı lisans.
uk: Ліцензія, за якою актив розповсюджується.
zh_hant: 素材的授權條款。

source: The date of the asset's latest edit/update.
ga: Dáta eagarthóir/nuashonrú is déanaí na sócmhainne.
it: La data dell'ultima modifica/aggiornamento del contenuto.
ru: Дата последнего редактирования/обновления ассета.
ta: சொத்தின் அண்மைக் கால திருத்தம்/புதுப்பிப்பின் தேதி.
tr: Varlığın en son düzenleme/güncelleme tarihi.
uk: Дата останнього редагування/оновлення активу.
zh_hant: 素材最近一次編輯／更新日期。

source: A textual description of the asset.
ga: Cur síos téacsúil ar an sócmhainn.
it: Una descrizione testuale del contenuto.
ru: Текстовое описание ассета.
ta: சொத்தின் உரை விளக்கம்.
tr: Varlığın metinsel bir açıklaması.
uk: Текстовий опис активу.
zh_hant: 素材的文字描述。

source: Links related to the asset (download link, file list, issue tracker).
ga: Naisc a bhaineann leis an tsócmhainn (nasc íoslódála, liosta comhad, rianaitheoir eisiúna).
it: Link relativi alla risorsa (link per il download, elenco dei file, issue tracker).
ru: Ссылки, связанные с ассетом(ссылка на скачивание, список файлов, трекер ошибок).
ta: சொத்து தொடர்பான இணைப்புகள் (இணைப்பு, கோப்பு பட்டியல், வெளியீடு டிராக்கரைப் பதிவிறக்கு).
tr: Varlıkla ilgili bağlantılar (indirme bağlantısı, dosya listesi, sorun izleyici).
uk: Посилання, пов’язані з активом (посилання для завантаження, список файлів, засіб відстеження проблем).
zh_hant: 與素材相關的連結（下載連結、檔案列表、問題回報等）。

source: Images and videos showcasing the asset.
ga: Íomhánna agus físeáin ag taispeáint an sócmhainn.
it: Immagini e video che dimostrano il contenuto.
ru: Демонстрирующие ассет изображения и видео.
ta: படங்கள் மற்றும் வீடியோக்கள் சொத்தை காண்பிக்கும்.
tr: Varlığı sergileyen resimler ve videolar.
uk: Зображення та відео, що демонструють актив.
zh_hant: 展示素材的圖片和影片。

source: Registering and logging in
ga: Clárú agus logáil isteach
it: Registrazione e accesso
ru: Регистрация и вход в систему
ta: பதிவுசெய்தல் மற்றும் உள்நுழைவு
tr: Kaydolma ve oturum açma
uk: Реєстрація та вхід
zh_hant: 註冊與登入

source: In order to upload assets to the AssetLib, you need to be logged in, and to do that, you need a registered user account. In the future, this may also give you access to other features, such as commenting on or rating the existing assets. You do *not* need to be logged in to browse and download the assets.
ga: D'fhonn sócmhainní a uaslódáil chuig an AssetLib, ní mór duit a bheith logáilte isteach, agus chun é sin a dhéanamh, teastaíonn cuntas úsáideora cláraithe uait. Sa todhchaí, d'fhéadfadh sé seo rochtain a thabhairt duit ar ghnéithe eile, mar shampla trácht a dhéanamh ar na sócmhainní atá ann cheana nó rátáil. Ní gá duit* a bheith logáilte isteach chun na sócmhainní a bhrabhsáil agus a íoslódáil.
it: Per caricare risorse sull'AssetLib, è necessario aver effettuato l'accesso e, per farlo, è necessario avere un account utente registrato. In futuro, questo potrebbe darti accesso anche ad altre funzionalità, come la possibilità di commentare o valutare i contenuti esistenti. *Non* è necessario aver effettuato l'accesso per sfogliare e scaricare i contenuti.
ru: Для загрузки ресурсов в AssetLib необходимо войти в систему, а для этого нужна зарегистрированная учётная запись. В будущем это может также дать вам доступ к другим функциям, таким как комментирование или оценка существующих ресурсов. Для просмотра и загрузки ресурсов вход в систему *не* требуется.
ta: சொத்துக்களை சொத்துக்களில் பதிவேற்றுவதற்கு, நீங்கள் உள்நுழைந்திருக்க வேண்டும், அதைச் செய்ய, உங்களுக்கு பதிவுசெய்யப்பட்ட பயனர் கணக்கு தேவை. எதிர்காலத்தில், இது ஏற்கனவே உள்ள சொத்துக்களில் கருத்து தெரிவிப்பது அல்லது மதிப்பீடு செய்வது போன்ற பிற அம்சங்களையும் அணுகலாம். சொத்துக்களை உலாவவும் பதிவிறக்கவும் நீங்கள் உள்நுழைய வேண்டியதில்லை.
tr: AssetLib'e varlık yüklemek için oturum açmanız, ve bunu yapmak için de kayıtlı bir kullanıcı hesabına sahip olmanız gerekir. Gelecekte, bu size mevcut varlıklar hakkında yorum yapma veya derecelendirme gibi diğer özelliklere de erişim sağlayabilir. Varlıklara göz atmak ve indirmek için giriş yapmış olmanız *gerekmez*.
uk: Щоб завантажити ресурси в AssetLib, вам потрібно ввійти в систему, а для цього вам потрібен зареєстрований обліковий запис користувача. У майбутньому це також може надати вам доступ до інших функцій, таких як коментування або оцінка наявних ресурсів. Вам *не* потрібно входити в систему, щоб переглядати та завантажувати ресурси.
zh_hant: 若要上傳素材至素材庫，你必須先登入，這需要註冊一個用戶帳號。未來登入後可能還能使用其他功能，例如評論或評分現有素材。 *瀏覽或下載素材則不需登入* 。

source: The login/registration page can be accessed from the AssetLib header.
ga: Is féidir rochtain a fháil ar an leathanach logáil/clárúcháin ón gceannteideal AssetLib.
it: È possibile accedere alla pagina di accesso/registrazione dall'intestazione dell'AssetLib.
ru: Страница входа/регистрации может быть доступна из шапки AssetLib.
ta: உள்நுழைவு/பதிவு பக்கத்தை அசெட்லிப் தலைப்பிலிருந்து அணுகலாம்.
tr: Oturum açma/kayıt sayfasına AssetLib başlığından erişilebilir.
uk: Доступ до сторінки входу/реєстрації можна отримати із заголовка AssetLib.
zh_hant: 你可以從素材庫標題列進入登入／註冊頁面。

source: |image3|
ga: |íomhá3|
ta: | படம் 3

source: image3
ga: íomhá 3
ru: изображение3
ta: படம் 3

source: From here, you can register your account, which requires a valid email address, a username, and a (preferably strong) password.
ga: Ón áit seo, is féidir leat do chuntas a chlárú, a éilíonn seoladh ríomhphoist bailí, ainm úsáideora, agus pasfhocal (b'fhearr láidir).
it: Da qui, è possibile registrare il tuo account, che richiede un indirizzo email valido, un nome utente e una password (preferibilmente forte).
ru: Отсюда вы можете зарегистрировать свой аккаунт, для чего необходимо указать действующий адрес электронной почты, имя пользователя и (желательно надежный) пароль.
ta: இங்கிருந்து, உங்கள் கணக்கை பதிவு செய்யலாம், அதற்கு சரியான மின்னஞ்சல் முகவரி, பயனர்பெயர் மற்றும் ஒரு (முன்னுரிமை வலுவான) கடவுச்சொல் தேவைப்படுகிறது.
tr: Buradan, geçerli bir e-posta adresi, bir kullanıcı adı ve (tercihen güçlü) bir şifre gerektiren hesabınızı kaydedebilirsiniz.
uk: Тут ви можете зареєструвати свій обліковий запис, для чого потрібна дійсна адреса електронної пошти, ім’я користувача та (бажано надійний) пароль.
zh_hant: 在這裡，你可以註冊帳號，需填寫有效的電子郵件、用戶名稱，並設置（建議較強的）密碼。

source: |image4|
ga: |íomhá4|
ta: | படம் 4 |

source: image4
ga: íomhá 4
ru: изображение4
ta: படம் 4

source: Then, you can use your username and password to log in.
ga: Ansin, is féidir leat d'ainm úsáideora agus do phasfhocal a úsáid chun logáil isteach.
it: Successivamente, potrai utilizzare il tuo nome utente e la tua password per effettuare l'accesso.
ru: Затем вы можете использовать свое имя пользователя и пароль для входа в систему.
ta: பின்னர், உள்நுழைய உங்கள் பயனர்பெயர் மற்றும் கடவுச்சொல்லைப் பயன்படுத்தலாம்.
tr: Ardından, giriş yapmak için kullanıcı adınızı ve şifrenizi kullanabilirsiniz.
uk: Потім ви можете використовувати своє ім’я користувача та пароль для входу.
zh_hant: 接著，你就可以用你的用戶名稱和密碼登入。

source: |image5|
ga: |íomhá5|
ta: | படம் 5 |

source: image5
ga: íomhá5
ru: изображение5
ta: படம் 5

source: This will change the look of the AssetLib header. Now you get access to a handful of new functions:
ga: Athróidh sé seo cuma an cheanntásc AssetLib. Anois faigheann tú rochtain ar dornán feidhmeanna nua:
it: Ciò cambierà l'aspetto dell'intestazione dell'AssetLib. Ora avrai accesso a diverse nuove funzioni:
ru: Это изменит внешний вид шапки AssetLib. Теперь вы получите доступ к нескольким новым функциям:
ta: இது அசெட்லிப் தலைப்பின் தோற்றத்தை மாற்றும். இப்போது நீங்கள் ஒரு சில புதிய செயல்பாடுகளை அணுகலாம்:
tr: Bu, AssetLib başlığının görünümünü değiştirecektir. Artık bir takım yeni ve yararlı fonksiyona erişebilirsiniz:
uk: Це змінить вигляд заголовка AssetLib. Тепер ви отримуєте доступ до кількох нових функцій:
zh_hant: 登入後，素材庫的標題列會出現新功能：

source: The feed, which shows a list of status updates on your submitted assets (and possibly more in the future).
ga: An beatha, a thaispeánann liosta de na nuashonruithe stádais ar do shócmhainní curtha isteach (agus b'fhéidir níos mó sa todhchaí).
it: Il feed, che mostra un elenco di aggiornamenti di stato sui contenuti inviati (e probabilmente altro in futuro).
ru: Лента, которая показывает список обновлений статуса отправленных вами активов (и, возможно, больше в будущем).
ta: நீங்கள் சமர்ப்பித்த சொத்துக்களில் நிலை புதுப்பிப்புகளின் பட்டியலைக் காட்டும் ஊட்டம் (எதிர்காலத்தில் அதிகமாக இருக்கலாம்).
tr: Gönderilen varlıklarınızla ilgili durum güncellemelerinin bir listesini gösteren akış (ve muhtemelen gelecekte daha fazlasını).
uk: Стрічка, яка показує список оновлених статусів надісланих вами активів (і, можливо, більше в майбутньому).
zh_hant: 活動訊息流：列出你已提交素材的狀態更新（未來可能包含更多）。
