Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/community/asset_library/using_assetlib.po
Languages: ga, it, ru, ta, tr, uk, zh_hant

source: Once you are done, you can press the Install button, which will unzip all the files in the archive, and import any assets contained therein, such as images or 3D models. Once this is done, you should see a message stating that the Package installation is complete.
ga: Nuair a bheidh tú déanta, is féidir leat an cnaipe Suiteáil a bhrú, a dhíshuiteálfaidh na comhaid go léir sa chartlann, agus aon sócmhainní atá ann a iompórtáil, mar shampla íomhánna nó samhlacha 3D. Nuair a bheidh sé seo déanta, ba chóir duit teachtaireacht a fheiceáil ag rá go bhfuil suiteáil an Pacáiste críochnaithe.
it: Una volta terminato, puoi premere il pulsante Installa, che decomprimerà tutti i file nell'archivio e importerà tutte le risorse in esso contenute, come immagini o modelli 3D. Fatto ciò, dovresti vedere un messaggio indicando che l'installazione del pacchetto è completata.
ru: После этого вы можете нажать кнопку Install, которая распакует все файлы в архиве и импортирует все содержащиеся в нем ассеты, такие как изображения или 3D-модели. После этого вы увидите сообщение о том, что установка пакета завершена.
ta: நீங்கள் முடித்ததும், நிறுவல் பொத்தானை அழுத்தலாம், இது காப்பகத்தில் உள்ள அனைத்து கோப்புகளையும் அவிழ்த்து, அதில் உள்ள எந்த சொத்துக்களான படங்கள் அல்லது 3D மாதிரிகள் போன்றவற்றை இறக்குமதி செய்யலாம். இது முடிந்ததும், தொகுப்பு நிறுவல் முடிந்துவிட்டதாகக் கூறும் செய்தியைக் காண வேண்டும்.
tr: İşiniz bittiğinde, arşivdeki seçili tüm dosyaların açılması ve resimler veya 3B modeller gibi içerdiği tüm varlıkların içe aktarılması için Kur düğmesine basabilirsiniz. Bu işlem tamamlandığında, Paket kurulumunun tamamlandığını belirten bir mesaj görmeniz gerekir.
uk: Завершивши, ви можете натиснути кнопку «Встановити», яка розпакує всі файли в архіві та імпортує будь-які ресурси, що містяться в ньому, наприклад зображення або 3D-моделі. Коли це буде зроблено, ви повинні побачити повідомлення про те, що встановлення пакета завершено.
zh_hant: 確認後，點擊「安裝」按鈕會解壓縮所有檔案，並自動匯入其中的素材（如圖片、3D 模型等）。完成後會顯示「套件安裝完成」訊息。

source: |image13|
ga: |íomh13|
ta: | படம் 13 |

source: image13
ga: íomh13
ru: изображение13
ta: படம் 13

source: You may also use the Import button to import asset archives obtained elsewhere (such as downloading them directly from the AssetLib web frontend), which will take you through the same package installation procedure as with the assets downloaded directly via Godot that we just covered.
ga: Is féidir leat an cnaipe Iompórtála a úsáid freisin chun cartlanna sócmhainní a fhaightear in áiteanna eile a allmhairiú (amhail iad a íoslódáil go díreach ó aghaidh gréasáin AssetLib), rud a thabharfaidh tú tríd an nós imeachta suiteála pacáiste céanna agus na sócmhainní a íoslódáiltear go díreach trí Godot atá clúdaithe againn díreach.
it: È anche possibile utilizzare il pulsante Importa per importare archivi di contenuti ottenuti altrove (ad esempio scaricandoli direttamente dall'interfaccia web dell'AssetLib). Questa porterà attraverso la stessa procedura di installazione di pacchetti utilizzata per i contenuti scaricati direttamente tramite Godot, di cui abbiamo appena parlato.
ru: Вы также можете использовать кнопку Импорта, чтобы импортировать архивы ресурсов, полученные в другом месте (например, загрузив их непосредственно из веб-интерфейса AssetLib), что проведет вас через ту же процедуру установки пакета, что и для ресурсов, загруженных непосредственно через Godot, которую мы только что рассмотрели.
ta: வேறு இடங்களில் பெறப்பட்ட சொத்து காப்பகங்களை இறக்குமதி செய்ய நீங்கள் இறக்குமதி பொத்தானைப் பயன்படுத்தலாம் (அவற்றை அசெட்லிப் வெப் ஃபிரான்டெண்டிலிருந்து நேரடியாக பதிவிறக்குவது போன்றவை), இது நாங்கள் உள்ளடக்கிய கோடோட் வழியாக நேரடியாக பதிவிறக்கம் செய்யப்பட்ட சொத்துக்களுடன் அதே தொகுப்பு நிறுவல் நடைமுறையின் மூலம் உங்களை அழைத்துச் செல்லும்.
tr: Başka bir yerden elde edilen (örneğin doğrudan AssetLib web sayfasından indirmek gibi) varlık arşivlerini içe aktarmak için de İçe Aktar düğmesini kullanabilirsiniz, bu da sizi az önce ele aldığımız Godot içinden doğrudan indirilen varlıklarla aynı paket yükleme işlemlerine götürecektir.
uk: Ви також можете скористатися кнопкою «Імпортувати», щоб імпортувати архіви активів, отримані в іншому місці (наприклад, завантажуючи їх безпосередньо з веб-інтерфейсу AssetLib), що проведе вас через ту саму процедуру встановлення пакета, що й із активами, завантаженими безпосередньо через Godot, про які ми щойно розповідали.
zh_hant: 你也可以用「匯入」按鈕，將其他地方取得的素材壓縮檔（例如從素材庫網頁前端直接下載）匯入，步驟與剛才從 Godot 內下載素材相同。

source: image9
ga: íomhá9
ru: изображение9

source: In the left sidebar is the **search bar + settings** section, and the **assets** section takes up the main content area on the right. Below the search bar, you can filter assets by **category** (such as 2D tools, scripts and demos), **support level**, **engine version**, and **license**. You can also change the **sorting order** to sort by license, name, or update date.
it: Nella barra laterale sinistra si trova la sezione **barra di ricerca + impostazioni**, mentre la sezione **contenuti** occupa l'area principale sulla destra. Sotto la barra di ricerca, è possibile filtrare i contenuti per **categoria** (come strumenti 2D, script e demo), **livello di supporto**, **versione del motore** e **licenza**. È anche possibile cambiare l'**ordinamento** per ordinare per licenza, nome o data di aggiornamento.
ru: В левой боковой панели находится **панели поиска + настройки** и раздел **ассеты** занимает основную область содержимого справа. Под панелью поиска вы можете фильтровать ассеты по **категории** (например 2D инструменты, скрипты и демо проекты), **уровень поддержки**, **версия движка** и **лицензия**. Вы так же можете изменить **порядок сортировки**, чтобы сортировать по лицензии имени или дате обновления.
zh_hant: 左側側邊欄包含 **search bar + settings** 區塊, 右側主要內容區則是 **assets** 區塊。在搜尋列下方, 你可以依 **category** (例如 2D 工具、腳本與示例)、**support level**、**engine version** 與 **license** 來篩選素材。也可以調整 **sorting order** , 依授權、名稱或更新日期排序。

source: **Featured** assets are hand-picked resources recognized for their value to the community.
it: I contenuti **in evidenza** sono contenuti accuratamente selezionati e riconosciuti per il loro valore per la comunità.
ru: **Featured (Рекомендованные)** специально отобранные ассеты, ценность которых признана сообществом.
zh_hant: **精選** 素材是經過挑選、對社群特別有價值的資源。
