Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/community/asset_library/using_assetlib.po
Languages: ga, it, ru, ta, tr, uk, zh_hant

source: A list of your uploaded assets.
ga: Liosta de do shócmhainní uaslódáilte.
it: Un elenco dei tuoi contenuti caricati.
ru: Список выгруженных вами ассетов.
ta: நீங்கள் பதிவேற்றிய சொத்துக்களின் பட்டியல்.
tr: Yüklediğiniz varlıkların bir listesi.
uk: Список ваших завантажених активів.
zh_hant: 你已上傳的素材清單。

source: The ability to submit new assets.
ga: An cumas sócmhainní nua a chur isteach.
it: La possibilità di inviare nuovi contenuti.
ru: Возможность размещения новых ассетов.
ta: புதிய சொத்துக்களை சமர்ப்பிக்கும் திறன்.
tr: Yeni varlıklar gönderme yeteneği.
uk: Можливість подавати нові активи.
zh_hant: 可以提交新素材。

source: |image6|
ga: |íomhá6|
ta: | படம் 6
uk: Зображення

source: image6
ga: íomhá6
ru: изображение6
ta: படம் 6

source: You can learn how to submit assets to the Library, and what the asset submission guidelines are, in the next part of this tutorial, :ref:`doc_submitting_to_assetlib`.
ga: Is féidir leat foghlaim conas sócmhainní a chur isteach chuig an Leabharlann, agus cad iad na treoirlínte aighneachta sócmhainní, sa chéad chuid eile den rang teagaisc seo, :ref: `doc_submitting_to_assetlib`.
it: Puoi imparare come inviare contenuti alla Libreria e quali sono le linee guida per inviare le risorse, nella parte successiva di questo tutorial, :ref:`doc_submitting_to_assetlib`.
ru: О том, как отправлять ресурсы в библиотеку, а также каковы правила отправки ресурсов, вы можете узнать в следующей части этого руководства: :ref:`doc_submitting_to_assetlib`.
ta: நூலகத்திற்கு சொத்துக்களை எவ்வாறு சமர்ப்பிப்பது, இந்த டுடோரியலின் அடுத்த பகுதியில் சொத்து சமர்ப்பிக்கும் வழிகாட்டுதல்கள் என்ன என்பதை நீங்கள் கற்றுக் கொள்ளலாம்,: `doc_submiting_to_assetlib`.
tr: Varlıkların Kütüphaneye nasıl gönderileceğini ve varlık gönderme yönergelerinin neler olduğunu bu eğitimin bir sonraki :ref:`doc_submitting_to_assetlib` bölümünde öğrenebilirsiniz.
uk: Ви можете дізнатися, як надсилати активи до бібліотеки та які правила надсилання активів, у наступній частині цього посібника, :ref:`doc_submitting_to_assetlib`.
zh_hant: 你可以在本教學下一節 :ref:`doc_submitting_to_assetlib` 了解如何提交素材到素材庫，以及素材提交規範。

source: In the editor
ga: San eagarthóir
it: Nell'editor
ru: В редакторе
ta: ஆசிரியரில்
tr: Düzenleyicinin içinde
uk: В редакторі
zh_hant: 在編輯器中

source: The editor will display different categories of assets depending on whether you're browsing the Project Manager's **Asset Library Projects** tab or the editor's **AssetLib** tab.
ga: Taispeánfaidh an t-eagarthóir catagóirí éagsúla sócmhainní ag brath ar cibé an bhfuil tú ag brabhsáil ar chluaisín **Asset Library Projects** nó ar chluaisín **AssetLib** an eagarthóra.
it: L'editor visualizzerà diverse categorie di risorse a seconda che si stia navigando nella scheda **Progetti nella libreria dei contenuti** del Gestore dei progetti o nella scheda **AssetLib** dell'editor.
ru: Редактор будет отображать различные категории активов в зависимости от того, просматриваете ли вы вкладку **Asset Library Projects** менеджера проектов или вкладку **AssetLib** редактора.
ta: திட்ட மேலாளரின் ** சொத்து நூலக திட்டங்கள் ** தாவல் அல்லது எடிட்டரின் ** அசெட்லிப் ** தாவலை உலாவுகிறீர்களா என்பதைப் பொறுத்து எடிட்டர் வெவ்வேறு வகை சொத்துக்களைக் காண்பிப்பார்.
tr: Düzenleyici, Proje Yöneticisinin **Varlık Kütüphanesi Projeleri** sekmesine mi yoksa düzenleyicinin **Varlık Kütüphanesi** sekmesine mi göz attığınıza bağlı olarak farklı varlık kategorileri görüntüleyecektir.
uk: Редактор відображатиме різні категорії активів залежно від того, чи ви переглядаєте вкладку **Проекти бібліотеки ресурсів** менеджера проекту чи вкладку редактора **AssetLib**.
zh_hant: 編輯器會根據你正在瀏覽「專案管理員」的 **素材庫專案** 分頁，或是編輯器本身的 **素材庫** 分頁，顯示不同分類的素材。

source: The Project Manager's **Asset Library Projects** tab will only display assets that are standalone projects by themselves. This is denoted on the asset library with the *Templates*, *Demos* and *Projects* categories.
ga: Ní thaispeánfaidh cluais**Tionscadail Leabharlainne Sócmhainneachta** an Bainisteora Tionscadail ach sócmhainní atá ina tionscadail Léirítear é seo ar leabharlann na sócmhainní leis na catagóirí*Teimpléid*, *Demos* agus *Projects*.
it: La scheda **Progetti nella libreria dei contenuti** del Gestore dei progetti mostrerà solo i contenuti che sono progetti indipendenti. Ciò è indicato nella libreria tramite le categorie *Modelli*, *Demo* e *Progetti*.
ru: На вкладке **Asset Library Projects** в панели менеджера проектов отображаются только те ресурсы, которые являются самостоятельными проектами. В библиотеке ресурсов это обозначено категориями *Templates (Шаблоны)*, *Demos* и *Projects*.
ta: திட்ட மேலாளரின் ** சொத்து நூலகத் திட்டங்கள் ** தாவல் தங்களைத் தாங்களே முழுமையான திட்டங்களாக மட்டுமே காண்பிக்கும். இது சொத்து நூலகத்தில் *வார்ப்புருக்கள் *, *டெமோக்கள் *மற்றும் *திட்டங்கள் *வகைகளுடன் குறிக்கப்படுகிறது.
tr: Proje Yöneticisi'nin **Varlık Kütüphanesi Projeleri** sekmesi yalnızca kendi başlarına bağımsız projeler olan varlıkları görüntüleyecektir. Bu, varlık kütüphanesinde *Şablonlar*, *Demolar* ve *Projeler* kategorileriyle gösterilir.
uk: На вкладці **Проекти бібліотеки ресурсів** менеджера проекту відображатимуться лише активи, які є окремими проектами. Це позначено в бібліотеці ресурсів категоріями *Шаблони*, *Демоверсії* та *Проекти*.
zh_hant: 專案管理員的 **素材庫專案** 分頁只會顯示獨立專案類型的素材，這類素材在素材庫中以 *Templates*、*Demos* 和 *Projects* 分類。

source: The editor's **AssetLib** tab will only display assets that are *not* standalone projects by themselves. In other words, it will display assets from all categories except *Templates*, *Demos* and *Projects*.
ga: Ní thaispeánfaidh cluais**AssetLib** an eagarthóra ach sócmhainní nach ion* thionscadail neamhspleácha leo féin. Is é sin le rá, taispeánfaidh sé sócmhainní ó gach catagóir seachas *Teimpléid*, *Demos* agus *Tionscadail*.
it: La scheda **AssetLib** dell'editor mostrerà solo le risorse che *non* sono progetti indipendenti. In altre parole, mostrerà risorse di tutte le categorie, tranne *Modelli*, *Demo* e *Progetti*.
ru: На вкладке редактора **AssetLib** будут отображаться только ресурсы, которые сами по себе *не* являются отдельными проектами. Другими словами, здесь будут отображаться ресурсы из всех категорий, кроме *Templates*, *Demos* и *Projects*.
ta: எடிட்டரின் ** அசெட்லிப் ** தாவல்*முழுமையான திட்டங்கள் அல்லாத சொத்துக்களை மட்டுமே காண்பிக்கும். வேறு வார்த்தைகளில் கூறுவதானால், இது *வார்ப்புருக்கள் *, *டெமோச் *மற்றும் *திட்டங்கள் *தவிர அனைத்து வகைகளிலிருந்தும் சொத்துக்களைக் காண்பிக்கும்.
tr: Düzenleyicinin **AssetLib** sekmesi yalnızca kendi başlarına bağımsız projeler *olmayan* varlıkları görüntüleyecektir. Başka bir deyişle, *Şablonlar*, *Demolar* ve *Projeler* dışındaki tüm kategorilerdeki varlıkları görüntüleyecektir.
uk: Вкладка **AssetLib** редактора відображатиме лише ресурси, які *не* є окремими проектами. Іншими словами, він відображатиме активи з усіх категорій, крім *Шаблони*, *Демо* та *Проекти*.
zh_hant: 編輯器的 **素材庫** 分頁只會顯示「非獨立專案」的素材，也就是除了 *Templates*、*Demos* 和 *Projects* 以外的所有類型。

source: You can also access the AssetLib directly from Godot:
ga: Is féidir leat rochtain a fháil ar an AssetLib go díreach ó Godot:
it: Puoi anche accedere all'AssetLib direttamente da Godot:
ru: Вы также можете получить доступ к AssetLib непосредственно из Godot:
ta: நீங்கள் கோடோட்டிலிருந்து நேரடியாக அசெட்லிபையும் அணுகலாம்:
tr: AssetLib'e doğrudan Godot'dan da erişebilirsiniz:
uk: Ви також можете отримати доступ до AssetLib безпосередньо з Godot:
zh_hant: 你也可以直接在 Godot 內開啟素材庫：

source: |image7|
ga: |íomhá7|
ta: | படம் 7 |

source: image7
ga: íomhá 7
ru: изображение7
ta: படம் 7

source: |image14|
ga: |íomh14|
ta: | படம் 14 |

source: image14
ga: íomh14
ru: изображение14
ta: படம் 14

source: Click on it, and Godot will fetch info about the assets from the AssetLib. Once it's finished, you will see a window similar to what the AssetLib website looks like, with some differences:
ga: Cliceáil air, agus gheobhaidh Godot faisnéis faoi na sócmhainní ón AssetLib. Nuair a bheidh sé críochnaithe, feicfidh tú fuinneog cosúil leis an gcuma ar shuíomh Gréasáin AssetLib, le roinnt difríochtaí:
it: Cliccandoci sopra, Godot recupererà le informazioni sui contenuti dall'AssetLib. Una volta terminato, vedrai una finestra simile al sito web dell'AssetLib, con alcune differenze:
ru: Нажмите на него, и Godot загрузит информацию об активах из AssetLib. После завершения вы увидите окно, похожее на то, что выглядит на сайте AssetLib, но с некоторыми отличиями:
ta: அதைக் சொடுக்கு செய்து, கோடோட் சொத்துக்களைப் பற்றிய தகவல்களைப் பெறுவார். அது முடிந்ததும், அசெட்லிப் வலைத்தளம் எப்படி இருக்கிறது என்பதைப் போன்ற ஒரு சாளரத்தைக் காண்பீர்கள், சில வேறுபாடுகளுடன்:
tr: Üzerine tıkladığınızda Godot AssetLib'den varlıklar hakkında bilgi getirecektir. İşlem tamamlandığında, bazı farklılıklarla birlikte AssetLib web sitesine benzer bir pencere göreceksiniz:
uk: Натисніть на нього, і Godot отримає інформацію про активи з AssetLib. Після завершення ви побачите вікно, подібне до того, як виглядає веб-сайт AssetLib, з деякими відмінностями:
zh_hant: 點擊後，Godot 會從素材庫抓取素材資訊。完成後會顯示一個視窗，畫面和網站上的素材庫類似，但有些差異：

source: |image8|
ga: |íomhá8|
ta: | படம் 8 |

source: image8
ga: íomhá8
ru: изображение8
ta: படம் 8

source: Similarly to the web version of the AssetLib, here you can search for assets by category, name, and sort them by factors such as name or edit date.
ga: Mar an gcéanna leis an leagan gréasáin den AssetLib, anseo is féidir leat sócmhainní a chuardach de réir catagóire, ainm, agus iad a shórtáil de réir fhachtóirí mar ainm nó dáta eagarthóireachta.
it: In modo simile alla versione web dell'AssetLib, qui è possibile cercare contenuti per categoria, nome e ordinarle in base a fattori come il nome o la data di modifica.
ru: Как и в веб-версии AssetLib, здесь вы можете искать ассеты по категориям, названиям, а также сортировать их по таким факторам, как название или дата редактирования.
ta: அசெட்லிப்பின் வலை பதிப்பைப் போலவே, இங்கே நீங்கள் வகை, பெயர் மூலம் சொத்துக்களைத் தேடலாம் மற்றும் பெயர் அல்லது திருத்த தேதி போன்ற காரணிகளால் அவற்றை வரிசைப்படுத்தலாம்.
tr: AssetLib'in web sürümüne benzer şekilde, burada varlıkları kategoriye, ada göre arayabilir ve isim veya düzenleme tarihi gibi faktörlere göre sıralayabilirsiniz.
uk: Подібно до веб-версії AssetLib, тут ви можете шукати ресурси за категорією, назвою та сортувати їх за такими факторами, як назва чи дата редагування.
zh_hant: 和網頁版素材庫一樣，你可以依分類、名稱搜尋素材，並依名稱或編輯日期等排序。

source: Notably, you can only fetch assets for the current version of Godot you are running. Projects, Demos and Templates can be downloaded from the Project Manager view of the AssetLib. Addons (tools, scripts, materials etc.) can be downloaded from the in-project AssetLib and added to the current project. In addition, unlike when using the web frontend, the search results are updated in real-time (you do not have to press Search after every change to your search query for the changes to take place).
ga: Go háirithe, ní féidir leat sócmhainní a fháil ach don leagan reatha de Godot atá á rith agat. Is féidir Tionscadail, Taispeáin agus Teimpléid a íoslódáil ó radharc Bainisteora Tionscadail ar an AssetLib. Is féidir breiseáin (uirlisí, scripteanna, ábhair srl.) A íoslódáil ón AssetLib in-thionscadal agus a chur leis an tionscadal reatha. Ina theannta sin, murab ionann agus an frontend gréasáin á úsáid agat, déantar na torthaí cuardaigh a nuashonrú i bhfíor-am (ní gá duit Cuardaigh a bhrú tar éis gach athrú ar d'fhiosrúchán cuardaigh chun na hathruithe a tharlóidh).
it: Notabilmente, è possibile recuperare solo i contenuti per la versione attuale di Godot che si sta utilizzando. Progetti, demo e modelli si possono scaricare dalla vista nel Gestore dei progetti dell'AssetLib. I componenti aggiuntivi (strumenti, script, materiali ecc.) si possono scaricare dall'AssetLib nel progetto e aggiunti al progetto attuale. Inoltre, a differenza di quando si utilizza l'interfaccia web, i risultati della ricerca vengono aggiornati in tempo reale (non è necessario premere "Cerca" dopo aver modificato la ricerca affinché venga applicata).
ru: Примечательно, что вы можете извлекать ресурсы только для текущей версии Godot, которую вы используете. Проекты, демо-версии и шаблоны можно загрузить из окна Менеджера проектов AssetLib. Аддоны (инструменты, скрипты, материалы и т.д.) можно загрузить из встроенного в проект AssetLib и добавить в текущий проект. Кроме того, в отличие от использования веб-интерфейса, результаты поиска обновляются в режиме реального времени (вам не нужно нажимать кнопку поиск после каждого изменения поискового запроса, чтобы изменения произошли).
ta: குறிப்பிடத்தக்க வகையில், நீங்கள் இயங்கும் கோடோட்டின் தற்போதைய பதிப்பிற்கான சொத்துக்களை மட்டுமே பெற முடியும். திட்டங்கள், டெமோக்கள் மற்றும் வார்ப்புருக்கள் அசெட்லிப்பின் திட்ட மேலாளர் பார்வையில் இருந்து பதிவிறக்கம் செய்யலாம். துணை நிரல்கள் (கருவிகள், ச்கிரிப்ட்கள், பொருட்கள் போன்றவை) திட்டத்தின் அசெட்லிப்பிலிருந்து பதிவிறக்கம் செய்து தற்போதைய திட்டத்தில் சேர்க்கப்படலாம். கூடுதலாக, வலை முன்பக்கத்தைப் பயன்படுத்தும் போது போலல்லாமல், தேடல் முடிவுகள் நிகழ்நேரத்தில் புதுப்பிக்கப்படுகின்றன (மாற்றங்கள் ஏற்படுவதற்கு உங்கள் தேடல் வினவலுக்கான ஒவ்வொரு மாற்றத்திற்கும் பிறகு நீங்கள் தேடலை அழுத்த வேண்டியதில்லை).
tr: Özellikle, yalnızca çalıştırdığınız Godot'un geçerli sürümü için varlıkları çekebilirsiniz. Projeler, Demolar ve Şablonlar AssetLib'in Proje Yöneticisi görünümünden indirilebilir. Eklentiler (araçlar, betikler, malzemeler vb.) proje içi AssetLib'den indirilebilir ve mevcut projeye eklenebilir. Buna ek olarak, web sayfasını kullanmanın aksine, arama sonuçları gerçek zamanlı olarak güncellenir (değişikliklerin gerçekleşmesi için arama sorgunuzdaki her değişiklikten sonra Ara'ya basmanız gerekmez).
uk: Примітно, що ви можете отримати ресурси лише для поточної версії Godot, яку ви використовуєте. Проекти, демонстраційні версії та шаблони можна завантажити з вікна керування проектами в AssetLib. Аддони (інструменти, сценарії, матеріали тощо) можна завантажити з AssetLib у проекті та додати до поточного проекту. Крім того, на відміну від використання веб-інтерфейсу, результати пошуку оновлюються в режимі реального часу (вам не потрібно натискати «Пошук» після кожної зміни пошукового запиту, щоб зміни відбулися).
zh_hant: 值得注意的是，你只能取得與目前 Godot 版本相容的素材。專案、範例和範本可從專案管理員的素材庫分頁下載。附加元件（工具、腳本、材質等）則可從專案內的素材庫下載並直接加入目前專案。此外，和網頁版不同，這裡搜尋結果會即時更新（修改搜尋條件後不需再按搜尋）。

source: In the future, you will be able to choose a different AssetLib provider to fetch assets from (using the Site dropdown menu), however currently only the official `Godot website <https://godotengine.org>`_ version of the AssetLib is supported, as well as the version that may be running on your local machine's web server (the localhost option).
ga: Sa todhchaí, beidh tú in ann soláthraí AssetLib difriúil a roghnú chun sócmhainní a fháil ó (ag baint úsáide as an roghchlár anuas Site), ach faoi láthair níl ach leagan oifigiúil `Godot website <https://godotenginine.org>`_ den AssetLib. tacaithe, chomh maith leis an leagan a d'fhéadfadh a bheith ag rith ar fhreastalaí gréasáin do mheaisín áitiúil (an rogha localhost).
it: In futuro, sarà possibile scegliere un diverso fornitore dell'AssetLib da cui recuperare le risorse (attraverso il menu a discesa del Sito); tuttavia, al momento è supportata solo la versione ufficiale dell'AssetLib dal `sito web di Godot <https://godotengine.org>`_, nonché possibilmente la versione in esecuzione localmente sul server web del proprio computer (opzione localhost).
ru: В будущем вы сможете выбрать другого поставщика AssetLib для извлечения ресурсов (с помощью выпадающего меню «Сайт»), однако в настоящее время поддерживается только официальная версия AssetLib с `Godot website <https://godotengine.org>`_, а также версия, которая может быть запущена на веб-сервере вашего локального компьютера (опция localhost).
ta: எதிர்காலத்தில், (தள கீழ்தோன்றும் மெனுவைப் பயன்படுத்தி) சொத்துக்களைப் பெறுவதற்கு நீங்கள் வேறு சொத்து வழங்குநரைத் தேர்வுசெய்ய முடியும், இருப்பினும் தற்போது அதிகாரப்பூர்வ `கோடோட் வலைத்தளம் <https://godotengine.org>` _ சொத்து இன் பதிப்பு மட்டுமே உதவி, அத்துடன் உங்கள் உள்ளக இயந்திரத்தின் வலை சேவையகத்தில் (லோக்கல் புரவலன் விருப்பம்) இயங்கக்கூடிய பதிப்பு.
tr: Gelecekte, varlıkları almak için farklı bir AssetLib sağlayıcısı seçebileceksiniz (Site açılır menüsünü kullanarak), ancak şu anda AssetLib'in yalnızca resmi `Godot web sitesi <https://godotengine.org>`_ sürümü ile yerel makinenizin web sunucusunda çalıştırıyor olabileceğiniz sürümü (localhost seçeneği) desteklenmektedir.
uk: У майбутньому ви зможете вибрати іншого постачальника AssetLib для отримання активів (за допомогою спадного меню «Сайт»), однак наразі доступна лише офіційна версія AssetLib `«веб-сайт Godot <https://godotengine.org>`_. підтримується, а також версія, яка може працювати на веб-сервері вашого локального комп’ютера (параметр localhost).
zh_hant: 未來你可以使用「網站」下拉選單切換不同的素材庫來源，但目前僅支援官方 `Godot 網站 <https://godotengine.org>`_ 版本，以及本機端網頁伺服器（localhost 選項）上的素材庫。

source: When you click on an asset, you will see more information about it.
ga: Nuair a chliceálann tú ar shócmhainn, feicfidh tú tuilleadh faisnéise faoi.
it: Quando clicchi su un contenuto, vedrai più informazioni su di essa.
ru: Когда вы нажимаете на ассет, вы видите более подробную информацию о нем.
ta: நீங்கள் ஒரு சொத்தில் சொடுக்கு செய்யும் போது, அதைப் பற்றிய கூடுதல் தகவல்களைக் காண்பீர்கள்.
tr: Bir varlığın üzerine tıkladığınızda, o varlık hakkında daha fazla bilgi görürsünüz.
uk: Коли ви клацнете актив, ви побачите більше інформації про нього.
zh_hant: 點選素材後會顯示更多詳細資訊。

source: |image9|
ga: |íomhá9|
ta: | படம் 9 |

source: If you click on the Install button, Godot will fetch an archive of the asset, and will track download progress of it at the bottom of the editor window. If the download fails, you can retry it using the Retry button.
ga: Má chliceálann tú ar an gcnaipe Suiteáil, gheobhaidh Godot cartlann den tsócmhainn, agus rianóidh sé dul chun cinn íoslódála na sócmhainne ag bun fhuinneog an eagarthóra. Má theipeann ar an íoslódáil, is féidir leat triail eile a bhaint as ag baint úsáide as an gcnaipe Atriail.
it: Cliccando sul pulsante Installa, Godot scaricherà un archivio del contenuto e seguirà il progresso del download nella parte inferiore della finestra dell'editor. Se il download fallisce, è possibile riprovare tramite il pulsante Riprova.
ru: Если нажать кнопку "Установить", Godot скачает архив с ресурсом и отследит ход его загрузки в нижней части окна редактора. Если загрузка не удалась, вы можете повторить попытку, нажав кнопку "Повторить".
ta: நீங்கள் நிறுவல் பொத்தானைக் சொடுக்கு செய்தால், கோடோட் சொத்தின் காப்பகத்தைப் பெறுவார், மேலும் அதன் பதிவிறக்க முன்னேற்றத்தை ஆசிரியர் சாளரத்தின் அடிப்பகுதியில் கண்காணிக்கும். பதிவிறக்கம் தோல்வியுற்றால், நீங்கள் அதை மீண்டும் முயற்சிக்கும் பொத்தானைப் பயன்படுத்தி மீண்டும் முயற்சிக்கலாம்.
tr: Kur düğmesine tıklarsanız, Godot varlığın bir arşivini çekecek ve düzenleyici penceresinin alt kısmında indirme ilerlemesini izleyecektir. İndirme işlemi başarısız olursa, Yeniden Dene düğmesini kullanarak yeniden deneyebilirsiniz.
uk: Якщо ви натиснете кнопку «Встановити», Godot отримає архів ресурсу та відстежуватиме прогрес його завантаження внизу вікна редактора. Якщо завантаження не вдається, ви можете повторити спробу, натиснувши кнопку Повторити.
zh_hant: 如果你點選「安裝」按鈕，Godot 會下載該素材的壓縮檔，並在編輯器視窗下方顯示下載進度。若下載失敗，可按「重試」按鈕重新下載。

source: |image10|
ga: |íomhá10|
ta: | படம் 10 |

source: image10
ga: íomhá10
ru: изображение10
ta: படம் 10

source: When it finishes, you can proceed to install it using the Install button. This will bring up the Package Installer window.
ga: Nuair a chríochnaíonn sé, is féidir leat dul ar aghaidh chun é a shuiteáil ag úsáid an gcnaipe Suiteáil. Tabharfaidh sé seo an fhuinneog Suiteálaí Pacáiste suas.
it: Al termine, puoi procedere all'installazione cliccando sul pulsante Installa. Si aprirà la finestra di installazione del pacchetto.
ru: После завершения установки вы сможете приступить к установке, нажав кнопку "Установить". Откроется окно установщика пакетов.
ta: அது முடிந்ததும், நிறுவல் பொத்தானைப் பயன்படுத்தி அதை நிறுவ தொடரலாம். இது தொகுப்பு நிறுவி சாளரத்தை கொண்டு வரும்.
tr: Bittiğinde, Kur düğmesini kullanarak kuruluma devam edebilirsiniz. Bu, Paket Yükleyici penceresini açacaktır.
uk: Коли він завершиться, ви можете продовжити його встановлення за допомогою кнопки «Встановити». Відкриється вікно інсталятора пакетів.
zh_hant: 下載完成後，你可以再次點選「安裝」來進行安裝作業，這會開啟套件安裝視窗。

source: |image11|
ga: |íomhá11|
ta: | படம் 11 |

source: image11
ga: íomhá11
ru: изображение11
ta: படம் 11

source: Here you can see a list of all the files that will be installed. You can tick off any of the files that you do not wish to install, and Godot will also inform you about any problems with files that it cannot install. These files will be shown in red, and hovering over them will show you a message stating why it cannot be installed.
ga: Anseo is féidir leat liosta de na comhaid go léir a bheidh suiteáilte a fheiceáil. Is féidir leat ticeáil a dhéanamh ar aon cheann de na comhaid nach mian leat a shuiteáil, agus cuirfidh Godot tú ar an eolas freisin faoi aon fhadhbanna le comhaid nach féidir leis a shuiteáil. Taispeánfar na comhaid seo i ndearg, agus taispeánfar teachtaireacht duit ag lua cén fáth nach féidir é a shuiteáil.
it: Qui puoi vedere un elenco di tutti i file che verranno installati. Puoi spuntare i file che non desideri installare e Godot ti informerà anche di eventuali problemi con i file che non riesce a installare. Questi file saranno visualizzati in rosso e, passandoci sopra con il cursore, verrà mostrato un messaggio che spiega perché non è possibile installarli.
ru: Здесь вы можете увидеть список всех файлов, которые будут установлены. Вы можете отметить файлы, которые не хотите устанавливать, и Godot также сообщит вам о любых проблемах с файлами, которые он не может установить. Эти файлы будут показаны красным цветом, а при наведении на них курсора вы увидите сообщение о том, почему они не могут быть установлены.
ta: நிறுவப்படும் அனைத்து கோப்புகளின் பட்டியலையும் இங்கே காணலாம். நீங்கள் நிறுவ விரும்பாத எந்தவொரு கோப்பையும் நீங்கள் டிக் செய்யலாம், மேலும் கோடோட் அதை நிறுவ முடியாத கோப்புகளில் ஏதேனும் சிக்கல்களைப் பற்றியும் உங்களுக்குத் தெரிவிக்கும். இந்த கோப்புகள் சிவப்பு நிறத்தில் காண்பிக்கப்படும், மேலும் அவற்றை ஏன் நிறுவ முடியாது என்று குறிப்பிடும் செய்தியைக் காண்பிக்கும்.
tr: Burada kurulacak tüm dosyaların bir listesini görebilirsiniz. Kurmak istemediğiniz herhangi bir dosyayı işaretini kaldırabilirsiniz, ve ayrıca Godot yükleyemeyeceği dosyalarla ilgili herhangi bir sorun hakkında sizi bilgilendirecektir. Bu dosyalar kırmızı renkte gösterilecek ve üzerlerine geldiğinizde neden yüklenemediğini belirten bir mesaj göreceksiniz.
uk: Тут ви можете побачити список усіх файлів, які будуть встановлені. Ви можете відмітити будь-які файли, які не бажаєте встановлювати, і Godot також повідомить вас про будь-які проблеми з файлами, які він не може встановити. Ці файли відображатимуться червоним кольором, а якщо навести на них курсор, ви побачите повідомлення про те, чому їх неможливо встановити.
zh_hant: 你可以在這裡看到所有將被安裝的檔案清單。可以取消勾選不想安裝的檔案。Godot 也會標示無法安裝的檔案（紅色），將滑鼠移到該檔案上會顯示無法安裝的原因說明。

source: |image12|
ga: |íomhá12|
ta: | படம் 12 |

source: image12
ga: íomhá12
ru: изображение12
ta: படம் 12
