Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/best_practices_for_engine_contributors.po
Languages: ga, it, ru, ta, tr, uk

source: As mentioned before (in point #2), it is very difficult for us (as human beings who design software) to actually understand all future user needs. Trying to write very flexible structures that cater to many use cases at once is often a mistake.
ga: Mar a luadh cheana (i bpointe #2), tá sé an-deacair dúinn (mar dhaoine a dhearann bogearraí) gach riachtanas úsáideora sa todhchaí a thuiscint i ndáiríre. Is minic gur botún é iarracht a dhéanamh struchtúir an-solúbtha a scríobh a fhreastalaíonn ar go leor cásanna úsáide ag an am céanna.
ru: Как уже упоминалось ранее (в пункте #2), нам (людям, разрабатывающим программное обеспечение) очень сложно понять все будущие потребности пользователей. Попытка написать очень гибкие структуры, которые удовлетворяют сразу множество вариантов использования, часто является ошибкой.
ta: முன்பு குறிப்பிட்டபடி (புள்ளி #2 இல்), எதிர்கால பயனர் தேவைகளை உண்மையில் புரிந்துகொள்வது எங்களுக்கு (மென்பொருளை வடிவமைக்கும் மனிதர்களாக) மிகவும் கடினம். பல பயன்பாட்டு நிகழ்வுகளை ஒரே நேரத்தில் நிறைவு செய்யும் மிகவும் நெகிழ்வான கட்டமைப்புகளை எழுத முயற்சிப்பது பெரும்பாலும் தவறு.
tr: Daha önce de belirtildiği gibi (madde #2'de), (yazılım tasarlayan insanlar olarak) bizim gelecekteki tüm kullanıcı ihtiyaçlarını gerçekten anlamamız çok zordur. Aynı anda birçok kullanım durumuna hitap eden çok esnek yapılar yazmaya çalışmak genellikle bir hatadır.
uk: Як згадувалося раніше (у пункті №2), нам (як людям, які розробляють програмне забезпечення) дуже важко зрозуміти всі майбутні потреби користувачів. Спроба написати дуже гнучкі структури, які одночасно задовольняють багато варіантів використання, часто є помилкою.

source: We may come up with something we believe is brilliant but later find out that users will never even use half of it or that they require features that don't quite fit into our original design, forcing us to either throw it away or make it even more complex.
tr: Mükemmel olduğuna inandığımız bir şey bulabiliriz ancak daha sonra kullanıcıların bunun yarısını bile kullanmayacağını veya orijinal tasarımımıza tam olarak uymayan özelliklere ihtiyaç duyduklarını öğrenerek kendimizi ya onu çöpe atmaya ya da daha da karmaşık hale getirmeye zorlayabiliriz.

source: The question is then, how do we design software that both allows users to do *what we know they need to do* now and allows them to do *what we don't yet know they'll need to do* in the future?
ga: Is í an cheist ansin, conas a dhearaimid bogearraí a ligeann d'úsáideoirí *a bhfuil a fhios againn go gcaithfidh siad a dhéanamh * a dhéanamh anois agus a ligeann dóibh *cad nach bhfuil a fhios againn go fóill go gcaithfidh siad a dhéanamh * amach anseo?
ru: Тогда возникает вопрос: как нам разработать программное обеспечение, которое одновременно позволяет пользователям делать *то, что, как мы знаем, им нужно делать* сейчас и позволяет им делать *то, что, как мы пока не знаем, им нужно будет делать* в будущем?
ta: கேள்வி என்னவென்றால், பயனர்கள் இருவரும் இப்போது செய்ய வேண்டும் என்று எங்களுக்குத் தெரிந்ததைச் செய்ய அனுமதிக்கும் மென்பொருளை எவ்வாறு வடிவமைப்பது * மற்றும் எதிர்காலத்தில் அவர்கள் செய்ய வேண்டியிருக்கும் * இன்னும் எங்களுக்குத் தெரியாததைச் செய்ய அனுமதிக்கிறது?
tr: O halde soru şu: Kullanıcıların hem *şu anda yapmaları gerektiğini bildiğimiz şeyleri* yapmalarına hem de *gelecekte yapmaları gerekeceğini henüz bilmediğimiz şeyleri* yapmalarına olanak tanıyan bir yazılımı nasıl tasarlarız?
uk: Питання полягає в тому, як ми розробляємо програмне забезпечення, яке дозволяє користувачам робити *те, що ми знаємо, що їм потрібно робити* зараз, і дозволяє їм робити те, *що ми ще не знаємо, що їм потрібно буде робити* в майбутньому?

source: The answer to this question is that, to ensure users still can do what they want to do, we need to give them access to a *low level API* that they can use to achieve what they want, even if it's more work for them because it means reimplementing some logic that already exists.
tr: Bu sorunun cevabı, kullanıcıların yapmak istediklerini hala yapabilmelerini sağlamak için, zaten var olan bazı mantıkları baştan uyarlamak anlamına geldiği için onlar için daha fazla uğraşma anlamında olsa bile, istediklerini elde etmek için kullanabilecekleri *düşük seviyeli bir API'ye* erişim sağlamamız gerektiğidir.

source: In real-life scenarios, these use cases will be at most rare and uncommon anyway, so it makes sense a custom solution needs to be written. This is why it's important to still provide users the basic building blocks to do it.
ga: I gcásanna fíor-saoil, beidh na cásanna úsáide seo neamhchoitianta agus neamhchoitianta ar aon nós, mar sin tá sé ciallmhar go gcaithfear réiteach saincheaptha a scríobh. Sin é an fáth go bhfuil sé tábhachtach na bunchlocha tógála a chur ar fáil d'úsáideoirí fós chun é a dhéanamh.
ru: В реальных сценариях такие случаи использования в любом случае будут редкими и нечасто встречающимися, поэтому имеет смысл написать индивидуальное решение. Вот почему важно предоставить пользователям основные строительные блоки для этого.
ta: நிச வாழ்க்கை சூழ்நிலைகளில், இந்த பயன்பாட்டு வழக்குகள் எப்படியிருந்தாலும் மிகவும் அரிதானதாகவும் அசாதாரணமாகவும் இருக்கும், எனவே தனிப்பயன் தீர்வு எழுதப்பட வேண்டும். இதனால்தான் பயனர்களுக்கு அதைச் செய்ய அடிப்படை கட்டுமானத் தொகுதிகளை வழங்குவது முதன்மை.
tr: Gerçek hayat senaryolarında, bu kullanım durumları zaten çok nadir ve yaygın olmayan durumlar olacaktır, bu nedenle özel bir çözümün yazılması gerekeceği mantıklıdır. Bu nedenle kullanıcılara bunu yapabilmeleri için temel yapı taşlarını sağlamak önemlidir.
uk: У сценаріях реального життя ці випадки використання будуть щонайбільше рідкісними та незвичайними, тому має сенс написати спеціальне рішення. Ось чому важливо все ще надавати користувачам основні будівельні блоки для цього.

source: #7: Prefer local solutions
ga: #7: Is fearr réitigh áitiúla
ru: #7: Предпочитайте локальные решения
ta: #7: உள்ளக தீர்வுகளை விரும்புங்கள்
tr: #7: Yerel çözümleri tercih edin
uk: №7: Віддавайте перевагу місцевим рішенням

source: When looking for a solution to a problem, be it implementing a new feature or fixing a bug, sometimes the easiest path is to add data or a new function in the core layers of code.
ga: Nuair a lorg réiteach ar fhadhb, bíodh sé ag cur gné nua i bhfeidhm nó fabht a shocrú, uaireanta is é an cosán is éasca sonraí nó feidhm nua a chur leis i sraitheanna lárnacha an chóid.
ru: При поиске решения проблемы, будь то внедрение новой функции или исправление ошибки, иногда самый простой путь - добавить данные или новую функцию в основные слои кода.
ta: ஒரு சிக்கலுக்கான தீர்வைத் தேடும்போது, அது ஒரு புதிய அம்சத்தை செயல்படுத்துவதோ அல்லது பிழையை சரிசெய்வதோ, சில நேரங்களில் எளிதான பாதை தரவு அல்லது குறியீட்டின் முக்கிய அடுக்குகளில் ஒரு புதிய செயல்பாட்டைச் சேர்ப்பது.
tr: Yeni bir özellik uyarlamak veya bir hatayı düzeltmek gibi bir soruna çözüm ararken, bazen en kolay yol kodun temel katmanlarına veri veya yeni bir işlev eklemektir.
uk: Коли ви шукаєте вирішення проблеми, будь то впровадження нової функції чи виправлення помилки, інколи найпростішим шляхом є додавання даних або нової функції в основні рівні коду.

source: The main problem here is, adding something to the core layers that will only be used from a single location far away will not only make the code more difficult to follow (split in two), but also make the core API larger, more complex, more difficult to understand in general.
ga: Is í an fhadhb is mó anseo, rud éigin a chur leis na sraitheanna lárnacha nach n-úsáidfear ach ó shuíomh amháin i bhfad ar shiúl, ní hamháin go mbeidh sé níos deacra an cód a leanúint (roinnte ina dhá cheann), ach freisin an croí-API a dhéanamh níos mó, níos casta, níos deacra a thuiscint go ginearálta.
ru: Основная проблема здесь заключается в том, что добавление в основные слои чего-то, что будет использоваться только из одного места на большом расстоянии, не только сделает код более сложным для следования (разделение на две части), но и сделает основной API больше, сложнее, труднее для понимания в целом.
ta: இங்குள்ள முக்கிய சிக்கல் என்னவென்றால், தொலைதூர இடத்திலிருந்து மட்டுமே பயன்படுத்தப்படும் மைய அடுக்குகளில் எதையாவது சேர்ப்பது குறியீட்டைப் பின்பற்றுவது மிகவும் கடினமாகிவிடும் (இரண்டாகப் பிரித்தல்), ஆனால் கோர் பநிஇ பெரிய, மிகவும் சிக்கலானதாக ஆக்குகிறது, பொதுவாக புரிந்து கொள்வது மிகவும் கடினம்.
tr: Buradaki temel sorun, çekirdek katmanlara yalnızca uzaktaki tek bir konumdan kullanılacak bir şey eklemek, yalnızca kodu takip etmeyi zorlaştırmakla kalmayacak (ikiye bölünecek), aynı zamanda çekirdek API'yi daha büyük, daha karmaşık ve genel olarak anlaşılması daha zor hale getirecektir.
uk: Основна проблема тут полягає в тому, що додавання чогось до основних рівнів, що використовуватиметься лише з одного місця на відстані, не лише ускладнить дотримання коду (розділить його на дві частини), але й зробить основний API більшим, складнішим, важче зрозуміти взагалі.

source: This is bad, because readability and cleanness of core APIs is always of extreme importance given how much code relies on it, and because it's key for new contributors as a starting point to learning the codebase.
ga: Tá sé seo dona, toisc go bhfuil tábhacht mhór i gcónaí le hinléiteacht agus glaineacht chroí-APInna mar gheall ar an méid cód atá ag brath air, agus toisc go bhfuil sé ríthábhachtach do ranníocóirí nua mar phointe tosaigh chun an codebase a fhoghlaim.
ru: Это плохо, потому что читабельность и чистота основных API всегда чрезвычайно важна, учитывая, как много кода зависит от них, и потому что это ключевой момент для новых участников, как отправная точка для изучения кодовой базы.
ta: இது மோசமானது, ஏனென்றால் கோர் ஏபிஐக்களின் வாசிப்புத்திறன் மற்றும் சுத்திகரிப்பு ஆகியவை எப்போதும் குறியீடு எவ்வளவு நம்பியுள்ளன என்பதைக் காட்டிலும் மிகச்சிறந்த முக்கியத்துவம் வாய்ந்தவை, மேலும் புதிய பங்களிப்பாளர்களுக்கு கோட்பேசைக் கற்றுக்கொள்வதற்கான தொடக்க புள்ளியாக இது முக்கியமானது.
tr: Bu kötü bir durumdur, çünkü çekirdek API'lerin okunabilirliği ve temizliği, kodun buna ne kadar bağlı olduğu göz önüne alındığında her zaman son derece önemlidir ve kod tabanını öğrenmek için bir başlangıç noktası olarak yeni katkıda bulunanlar için kilit öneme sahiptir.
uk: Це погано, тому що читабельність і чистота основних API завжди є надзвичайно важливими, враховуючи, скільки коду покладається на них, і тому що це є ключовим для нових учасників як відправна точка для вивчення кодової бази.

source: A common reason for wanting to do this is that it's usually less code to simply add a hack in the core layers.
ga: Cúis choitianta ar mian leo é seo a dhéanamh ná go bhfuil sé de ghnáth níos lú cód a chur ach hack sna sraitheanna lárnacha.
ru: Распространенная причина такого подхода заключается в том, что обычно для простого добавления хака в основные слои требуется меньше кода.
ta: இதைச் செய்ய விரும்புவதற்கான பொதுவான காரணம் என்னவென்றால், கோர் அடுக்குகளில் ஒரு ஏக்கைச் சேர்ப்பது பொதுவாக குறைவான குறியீடு.
tr: Bunu yapmak istemenin yaygın bir nedeni, çekirdek katmanlara basitçe bir hack eklemenin genellikle daha az kod istemesidir.
uk: Поширена причина бажання зробити це полягає в тому, що зазвичай потрібно менше коду, щоб просто додати хак у основні шари.

source: Doing so is not advised. Generally, the code for a solution should be closer to where the problem originates, even if it involves additional, duplicated, more complex, or less efficient code. More creativity might be needed, but this path is always the advised one.
ga: Ní mholtar é sin a dhéanamh. Go ginearálta, ba cheart go mbeadh an cód le haghaidh réiteach níos gaire don áit a dtagann an fhadhb, fiú má bhaineann sé le cód breise, dúblach, níos casta nó níos lú éifeachtúil. B'fhéidir go mbeadh níos mó cruthaitheachta ag teastáil, ach is é an cosán seo an ceann comhairle i gcónaí.
it: Non è consigliabile farlo. In genere, il codice per una soluzione dovrebbe essere più vicino all'origine del problema, anche se richiede codice aggiuntivo, duplicato, più complesso o meno efficiente. Potrebbe essere necessaria più creatività, ma questa è sempre la strada consigliata.
ru: Так делать не рекомендуется. Как правило, код решения должен располагаться ближе к источнику проблемы, даже если он включает в себя дополнительный, дублирующий, более сложный или менее эффективный код. Может потребоваться больше креативности, но этот путь всегда рекомендуется.
ta: அவ்வாறு செய்வது அறிவுறுத்தப்படவில்லை. பொதுவாக, ஒரு தீர்வுக்கான குறியீடு கூடுதல், நகல், மிகவும் சிக்கலான அல்லது குறைந்த திறமையான குறியீட்டை உள்ளடக்கியிருந்தாலும், சிக்கல் தோன்றும் இடத்திற்கு நெருக்கமாக இருக்க வேண்டும். அதிக படைப்பாற்றல் தேவைப்படலாம், ஆனால் இந்த பாதை எப்போதும் அறிவுறுத்தப்பட்ட ஒன்றாகும்.
tr: Bunu yapmak tavsiye edilmez. Genel olarak, bir çözümün kodu, fazlalık, yinelenen, daha karmaşık veya daha az verimli kod içerse bile, sorunun ortaya çıktığı yere daha yakın olmalıdır. Daha fazla yaratıcılık gerekebilir, ancak bu yol her zaman tavsiye edilen yoldur.
uk: Робити це не рекомендується. Як правило, код рішення має бути ближчим до джерела проблеми, навіть якщо він включає додатковий, дубльований, складніший або менш ефективний код. Може знадобитися більше креативності, але цей шлях завжди рекомендований.

source: #8: Don't use complex canned solutions for simple problems
ga: #8: Ná húsáid réitigh chasta stánaithe le haghaidh fadhbanna simplí
ru: #8: Не используйте сложные готовые решения для простых проблем
ta: #8: எளிய சிக்கல்களுக்கு சிக்கலான பதிவு செய்யப்பட்ட தீர்வுகளைப் பயன்படுத்த வேண்டாம்
tr: #8: Basit sorunlar için karmaşık konserve çözümler kullanmayın
uk: №8: Не використовуйте складні готові рішення для простих проблем

source: Not every problem has a simple solution and, many times, the right choice is to use a third party library to solve the problem.
tr: Her sorunun basit bir çözümü yoktur ve çoğu zaman doğru seçim, sorunu çözmek için üçüncü taraf bir kütüphane kullanmaktır.

source: As Godot requires to be shipped in a large amount of platforms, we can't link libraries dynamically. Instead, we bundle them in our source tree.
ga: De réir mar a éilíonn Godot a sheoladh i méid mór ardán, ní féidir linn leabharlanna a nascadh go dinimiciúil. Ina áit sin, bundle muid iad inár gcrann foinse.
it: Poiché Godot deve essere distribuito su un gran numero di piattaforme, non possiamo collegare le librerie dinamicamente. Invece, le includiamo nel nostro albero sorgente.
ru: Поскольку Godot должен поставляться на большое количество платформ, мы не можем компоновать библиотеки динамически. Вместо этого мы связываем их в дерево исходных текстов.
ta: கோடோட் ஒரு பெரிய அளவிலான தளங்களில் அனுப்பப்பட வேண்டும் என்பதால், நூலகங்களை மாறும் வகையில் இணைக்க முடியாது. அதற்கு பதிலாக, அவற்றை எங்கள் மூல மரத்தில் தொகுக்கிறோம்.
tr: Godot'un çok sayıda platforma gönderilmesi gerektiğinden, kütüphaneleri dinamik olarak bağlayamayız. Bunun yerine, onları kaynak ağacımızda paketliyoruz.
uk: Оскільки Godot вимагає доставки на велику кількість платформ, ми не можемо динамічно пов’язувати бібліотеки. Натомість ми об’єднуємо їх у дерево вихідних кодів.

source: As a result, we are very picky with what goes in, and we tend to prefer smaller libraries (single header ones are our favorite). We will only bundle something larger if there is no other choice.
ga: Mar thoradh air sin, táimid an-picky leis an méid a théann i, agus claonadh a bhíonn againn chun fearr leabharlanna níos lú (tá cinn header amháin ár is fearr leat). Ní dhéanfaimid rud éigin níos mó a chuachadh mura bhfuil aon rogha eile ann.
it: Pertanto, siamo molto esigenti con ciò che inseriamo e tendiamo a preferire librerie più piccole (quelle a singolo header sono le nostre preferite). Includiamo qualcosa di più grande solamente se non abbiamo altra scelta.
ru: В результате мы очень требовательны к составу пакетов и предпочитаем небольшие библиотеки (наши любимые — однозаголовочные). Что-то более крупное мы включаем в комплект только в случае крайней необходимости.
ta: இதன் விளைவாக, நாங்கள் என்ன நடக்கிறது என்பதில் மிகவும் ஆர்வமாக உள்ளோம், மேலும் சிறிய நூலகங்களை நாங்கள் விரும்புகிறோம் (ஒற்றை தலைப்பு எங்களுக்கு பிடித்தது). வேறு வழியில்லை என்றால் மட்டுமே நாங்கள் பெரிய ஒன்றை தொகுப்போம்.
tr: Sonuç olarak, neyin içeri gireceği konusunda çok seçiciyiz ve daha küçük kütüphaneleri tercih etme eğilimindeyiz (tek başlık dosyalı olanlar bizim favorimizdir). Daha büyük bir şeyi yalnızca başka bir seçenek yoksa paketleyeceğiz.
uk: Як наслідок, ми дуже вибагливі до того, що входить, і ми, як правило, надаємо перевагу меншим бібліотекам (нашим улюбленим є бібліотеки з одним заголовком). Ми збираємо щось більше, лише якщо не буде іншого вибору.

source: Libraries must use a permissive enough license to be included into Godot. Some examples of acceptable licenses are Apache 2.0, BSD, MIT, ISC, and MPL 2.0. In particular, we cannot accept libraries licensed under the GPL or LGPL since these licenses effectively disallow static linking in proprietary software (which Godot is distributed as in most exported projects). This requirement also applies to the editor, since we may want to run it on iOS in the long term. Since iOS doesn't support dynamic linking, static linking is the only option on that platform.
ga: Ní mór do leabharlanna ceadúnas ceadaitheach go leor a úsáid le bheith san áireamh i Godot. Tá roinnt samplaí de cheadúnais inghlactha Apache 2.0, BSD, MIT, ISC, agus MPL 2.0. Go háirithe, ní féidir linn glacadh le leabharlanna atá ceadúnaithe faoin GPL nó LGPL ós rud é go ndícheadaíonn na ceadúnais seo nascadh statach go héifeachtach i mbogearraí dílseánaigh (a dháiltear Godot mar atá i bhformhór na dtionscadal a onnmhairítear). Baineann an riachtanas seo leis an eagarthóir freisin, ós rud é go mb'fhéidir gur mhaith linn é a reáchtáil ar iOS san fhadtéarma. Ós rud é nach dtacaíonn iOS le nascadh dinimiciúil, is é nascadh statach an t-aon rogha ar an ardán sin.
it: Le librerie devono utilizzare una licenza sufficientemente permissiva per essere incluse in Godot. Alcuni esempi di licenze accettabili sono Apache 2.0, BSD, MIT, ISC e MPL 2.0. In particolare, non possiamo accettare librerie con licenza GPL o LGPL, poiché queste licenze di fatto impediscono il collegamento statico in software proprietario (ovvero il modo cui Godot viene distribuito, in gran parte dei progetti esportati). Questo requisito si applica anche all'editor, poiché potremmo volerlo eseguire su iOS a lungo termine. Poiché iOS non supporta il collegamento dinamico, il collegamento statico è l'unica opzione disponibile su tale piattaforma.
ru: Кроме того, библиотеки должны использовать достаточно разрешительную лицензию для включения в Godot. Примерами приемлемых лицензий являются Apache 2.0, BSD, MIT, ISC и MPL 2.0. В частности, мы не можем принимать библиотеки под лицензией GPL или LGPL, поскольку эти лицензии фактически запрещают статическую линковку в проприетарном программном обеспечении (которое Godot распространяется в большинстве экспортируемых проектов). Это требование также распространяется на редактор, поскольку мы можем захотеть запустить его на iOS в долгосрочной перспективе. Поскольку iOS не поддерживает динамическую линковку, статическая линковка — единственный вариант на этой платформе.
ta: கோடோட்டில் சேர்க்க அனுமதிக்கப்பட்ட போதுமான உரிமத்தை நூலகங்கள் பயன்படுத்த வேண்டும். ஏற்றுக்கொள்ளக்கூடிய உரிமங்களின் சில எடுத்துக்காட்டுகள் அப்பாச்சி 2.0, பி.எச்.டி, எம்ஐடி, ஐ.எச்.சி மற்றும் எம்.பி.எல் 2.0. குறிப்பாக, சிபிஎல் அல்லது எல்சிபிஎல் கீழ் உரிமம் பெற்ற நூலகங்களை நாங்கள் ஏற்க முடியாது, ஏனெனில் இந்த உரிமங்கள் தனியுரிம மென்பொருளில் நிலையான இணைப்பை திறம்பட அனுமதிக்காது (இது பெரும்பாலான ஏற்றுமதி செய்யப்பட்ட திட்டங்களைப் போலவே கோடோட் விநியோகிக்கப்படுகிறது). இந்த தேவை எடிட்டருக்கும் பொருந்தும், ஏனெனில் நாங்கள் அதை நீண்ட காலத்திற்கு ஐஇமு இல் இயக்க விரும்பலாம். மாறும் இணைப்பை ஐஇமு ஆதரிக்கவில்லை என்பதால், அந்த மேடையில் நிலையான இணைப்பானது ஒரே வழி.
tr: Kütüphaneler Godot'ya dahil edilmek için yeterince izin verici bir lisans kullanmalıdır. Kabul edilebilir lisanslara bazı örnekler Apache 2.0, BSD, MIT, ISC ve MPL 2.0'dır. Özellikle, GPL veya LGPL altında lisanslanmış kütüphaneleri kabul edemeyiz, çünkü bu lisanslar esasında özel mülk yazılımlarda (Godot'un dışa aktarılan pek çok projede olduğu gibi dağıtılması) statik bağlantıya izin vermez. Uzun vadede iOS üzerinde çalıştırmak isteyebileceğimiz için bu gereklilik düzenleyici için de geçerlidir. iOS dinamik bağlamayı desteklemediğinden, statik bağlantı bu platformdaki tek seçenektir.
uk: Бібліотеки повинні використовувати достатньо дозвільну ліцензію, щоб бути включеною в Godot. Деякі приклади прийнятних ліцензій: Apache 2.0, BSD, MIT, ISC і MPL 2.0. Зокрема, ми не можемо прийняти бібліотеки, ліцензовані згідно з GPL або LGPL, оскільки ці ліцензії фактично забороняють статичне зв’язування у пропрієтарному програмному забезпеченні (яке Godot поширюється, як і в більшості експортованих проектів). Ця вимога також стосується редактора, оскільки ми можемо захотіти запустити його на iOS у довгостроковій перспективі. Оскільки iOS не підтримує динамічне зв’язування, статичне зв’язування є єдиним варіантом на цій платформі.

source: We may come up with something we believe is brilliant, but later find out that users will never even use half of it or that they require features that don't quite fit into our original design, forcing us to either throw it away or make it even more complex.
uk: Ми можемо придумати щось, на нашу думку, геніальне, але згода виявимо, що користувачі ніколи не скористаються навіть половиною цього або що їм потрібні функції, які не зовсім вписуються в наш початковий дизайн, що змушує нас або викинути це, або зробити ще більш складним.

source: The answer to this question is that, to ensure users still can do what they want to do, we need to give them access to a *low-level API* that they can use to achieve what they want, even if it's more work for them because it means reimplementing some logic that already exists.
uk: Відповідь на це запитання полягає в тому, щоб гарантувати, що користувачі все ще можуть робити те, що вони хочуть робити, ми повинні надати їм доступ до *низького рівня API*, який вони можуть використовувати для досягнення бажаного, навіть якщо це для них більше роботи, оскільки це означає повторне впровадження певної логіки, яка вже існує.

source: Not every problem has a simple solution and, many times, the right choice is to use a third-party library to solve the problem.
it: Non tutti i problemi hanno una soluzione semplice e, spesso, la scelta giusta è quella di utilizzare una libreria di terze parti per risolvere il problema.
uk: Не кожна проблема має просте рішення, і часто правильним вибором є використання бібліотеки третьої сторони для вирішення проблеми.
