Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/best_practices_for_engine_contributors.po
Languages: ga, it, ru, ta, tr, uk

source: Whether a problem is worth solving is determined by the effort that is required to work around it. The required effort depends on:
ga: Is é an iarracht a theastaíonn chun oibriú timpeall air a shocraíonn cé acu an fiú fadhb a réiteach. Braitheann an iarracht riachtanach ar:
it: Se un problema valga la pena risolverlo è determinato dallo sforzo richiesto per risolverlo. Lo sforzo richiesto dipende da:
ru: Стоит ли решать проблему, определяется усилиями, необходимыми для её решения. Требуемые усилия зависят от:
ta: ஒரு சிக்கல் தீர்க்க மதிப்புள்ளதா என்பதை அதைச் சுற்றி வேலை செய்ய வேண்டிய முயற்சியால் தீர்மானிக்கப்படுகிறது. தேவையான முயற்சி சார்ந்துள்ளது:
tr: Bir sorunun çözülmeye değer olup olmadığı, o sorun üzerinde çalışmak için gereken çabaya göre belirlenir. Gerekli çaba şunlara bağlıdır:
uk: Чи варто проблема розв’язувати, залежить від зусиль, які потрібні для її вирішення. Необхідне зусилля залежить від:

source: The complexity of the problem
ga: Castacht na faidhbe
it: La complessità del problema
ru: Сложность проблемы
ta: பிரச்சினையின் சிக்கலானது
tr: Sorunun karmaşıklığı
uk: Складність проблеми

source: The frequency the problem
ga: Minicíocht na faidhbe
it: La frequenza del problema
ru: Частота возникновения проблемы
ta: அதிர்வெண் சிக்கல்
tr: Sorunun oluşma sıklığı
uk: Частота проблема

source: If the problem is *too complex* for most users to solve, then the software should offer a ready-made solution for it. Likewise, if the problem is easy for the user to work around, offering such a solution is unnecessary.
ga: Má tá an fhadhb *ró-chasta * don chuid is mó d'úsáideoirí a réiteach, ansin ba chóir do na bogearraí réiteach réamhdhéanta a thairiscint dó. Mar an gcéanna, má tá an fhadhb éasca don úsáideoir a bheith ag obair timpeall, ní gá réiteach den sórt sin a thairiscint.
it: Se il problema è *troppo complesso* da risolvere per la maggiorità degli utenti, il software dovrebbe offrire una soluzione pronta all'uso. Allo stesso modo, se il problema è facile da risolvere per l'utente, offrire una soluzione del genere è superfluo.
ru: Если проблема *слишком сложна* для решения большинством пользователей, то программа должна предлагать готовое решение. Аналогично, если проблему легко обойти, предлагать такое решение не нужно.
ta: பெரும்பாலான பயனர்கள் தீர்க்க சிக்கல் * மிகவும் சிக்கலானது * என்றால், மென்பொருள் அதற்கான ஆயத்த தீர்வை வழங்க வேண்டும். அதேபோல், பயனருக்கு வேலை செய்வது எளிதானது என்றால், அத்தகைய தீர்வை வழங்குவது தேவையற்றது.
tr: Eğer sorun çoğu kullanıcı için çözülemeyecek kadar karmaşıksa, o zaman yazılım bunun için hazır bir çözüm sunmalıdır. Aynı şekilde, eğer sorun kullanıcının başka yoldan çözebileceği kadar kolaysa, böyle bir çözüm sunmak gereksizdir.
uk: Якщо проблема *надто складна* для вирішення більшістю користувачів, програмне забезпечення має запропонувати для неї готове рішення. Так само, якщо проблему легко вирішити користувачеві, пропонувати таке рішення немає потреби.

source: The exception, however, is when the user encounters a problem *frequently enough* that having to do the simple solution every time becomes an annoyance. In this case, the software should offer a solution to simplify the use case.
ga: Is é an eisceacht, áfach, ná nuair a bhíonn fadhb ag an úsáideoir *minic go leor * a mbíonn air an réiteach simplí a dhéanamh gach uair. Sa chás seo, ba cheart go gcuirfeadh na bogearraí réiteach ar fáil chun an cás úsáide a shimpliú.
it: L'eccezione, tuttavia, occorre quando l'utente incontra un problema *abbastanza frequentemente* che dover ricorrere ogni volta alla soluzione più semplice diventa fastidioso. In questo caso, il software dovrebbe offrire una soluzione per semplificare il caso d'uso.
ru: Исключением, однако, являются случаи, когда пользователь сталкивается с проблемой *достаточно часто*, и необходимость каждый раз искать простое решение становится раздражающей. В этом случае программное обеспечение должно предлагать решение, упрощающее использование.
ta: இருப்பினும், விதிவிலக்கு, பயனர் ஒரு சிக்கலை எதிர்கொள்ளும்போது * அடிக்கடி போதுமானது * ஒவ்வொரு முறையும் எளிய தீர்வைச் செய்ய வேண்டியது ஒரு எரிச்சலூட்டுகிறது. இந்த வழக்கில், பயன்பாட்டு வழக்கை எளிமைப்படுத்த மென்பொருள் ஒரு தீர்வை வழங்க வேண்டும்.
tr: Ancak bunun istisnası, kullanıcının bir sorunla, basit çözümü her seferinde yapmak zorunda kalmasının can sıkıcı bir hal almasına neden olacak kadar *sık olarak* karşılaşmasıdır. Bu durumda yazılım, kullanım durumunu basitleştirmek için bir çözüm sunmalıdır.
uk: Однак винятком є випадки, коли користувач стикається з проблемою *досить часто*, що необхідність щоразу виконувати просте рішення стає неприємною. У цьому випадку програмне забезпечення має запропонувати рішення для спрощення використання.

source: It's usually easy to tell if a problem is complex or frequent, but it can be difficult. This is why discussing with other developers (next point) is always advised.
ga: De ghnáth bíonn sé éasca a rá an bhfuil fadhb casta nó minic, ach d'fhéadfadh sé a bheith deacair. Sin é an fáth go moltar plé a dhéanamh le forbróirí eile (an chéad phointe eile) i gcónaí.
it: Di solito è facile capire se un problema è complesso o frequente, ma può essere difficile. Per questo motivo discuterne con altri sviluppatori (punto successivo) è sempre consigliabile.
ru: Обычно легко определить, сложная проблема или распространённая, но иногда это бывает сложно. Поэтому всегда рекомендуется обсудить её с другими разработчиками (об этом ниже).
ta: ஒரு சிக்கல் சிக்கலானதா அல்லது அடிக்கடி இருக்கிறதா என்று சொல்வது பொதுவாக எளிதானது, ஆனால் அது கடினமாக இருக்கும். இதனால்தான் மற்ற டெவலப்பர்களுடன் (அடுத்த புள்ளி) விவாதிப்பது எப்போதும் அறிவுறுத்தப்படுகிறது.
tr: Bir sorunun karmaşık mı yoksa sık olan mı olduğunu söylemek genellikle kolaydır, ancak bu bazen zor olabilir. Bu nedenle her zaman diğer geliştiricilerle görüşmek (bir sonraki nokta) tavsiye edilir.
uk: Зазвичай легко визначити, чи є проблема складною чи частою, але це може бути важко. Ось чому завжди рекомендується обговорення з іншими розробниками (наступний пункт).

source: #4: The solution must be discussed with others
ga: #4: Caithfear an réiteach a phlé le daoine eile
ru: #4: Решение должно быть обсуждено с другими
ta: #4: தீர்வு மற்றவர்களுடன் விவாதிக்கப்பட வேண்டும்
tr: #4: Çözüm başkalarıyla tartışılmalıdır
uk: №4: Рішення потрібно обговорити з іншими

source: Often, users will be immersed in their own projects when they stumble upon problems. These users will naturally try to solve the problem from their perspective, thinking only about their own use case. As a result, user proposed solutions don't always contemplate all use cases and are often biased towards the user's own requirements.
ga: Go minic, beidh úsáideoirí tumtha ina dtionscadail féin nuair a bhíonn siad ag dul i ngleic le fadhbanna. Déanfaidh na húsáideoirí seo iarracht nádúrtha an fhadhb a réiteach óna bpeirspictíocht, ag smaoineamh ar a gcás úsáide féin amháin. Mar thoradh air sin, ní smaoiníonn réitigh atá molta ag úsáideoirí i gcónaí ar gach cás úsáide agus is minic a bhíonn siad claonta i dtreo riachtanais an úsáideora féin.
ta: பெரும்பாலும், பயனர்கள் சிக்கல்களில் தடுமாறும் போது தங்கள் சொந்த திட்டங்களில் மூழ்கிவிடுவார்கள். இந்த பயனர்கள் இயல்பாகவே தங்கள் கண்ணோட்டத்தில் சிக்கலைத் தீர்க்க முயற்சிப்பார்கள், தங்கள் சொந்த பயன்பாட்டு வழக்கைப் பற்றி மட்டுமே சிந்திக்கிறார்கள். இதன் விளைவாக, பயனர் முன்மொழியப்பட்ட தீர்வுகள் எப்போதும் எல்லா பயன்பாட்டு நிகழ்வுகளையும் சிந்திக்காது, மேலும் அவை பயனரின் சொந்த தேவைகளுக்கு பக்கச்சார்பானவை.
tr: Kullanıcılar genellikle sorunlarla karşılaştıklarında kendi projelerine dalmış olurlar. Bu kullanıcılar doğal olarak sorunu kendi bakış açılarından çözmeye çalışacak ve yalnızca kendi kullanım durumlarını düşüneceklerdir. Sonuç olarak, kullanıcı tarafından önerilen çözümler her zaman tüm kullanım durumlarını dikkate almaz ve genellikle kullanıcının kendi gereksinimlerine yönelik önyargılı yaklaşımlardır.
uk: Часто користувачі занурюються у власні проекти, коли натрапляють на проблеми. Ці користувачі, природно, намагатимуться вирішити проблему зі своєї точки зору, думаючи лише про власний варіант використання. Як наслідок, запропоновані користувачами рішення не завжди враховують усі випадки використання та часто упереджені до власних вимог користувача.

source: For developers, the perspective is different. They may find the user's problem too unique to justify a solution (instead of a workaround), or they might suggest a partial (usually simpler or lower level) solution that applies to a wider range of known problems and leave the rest of the solution up to the user.
ga: I gcás forbróirí, tá an dearcadh difriúil. D'fhéadfadh siad teacht ar fhadhb an úsáideora ró-uathúil chun údar a thabhairt le réiteach (in ionad workaround), nó d'fhéadfadh siad a mholadh go páirteach (de ghnáth níos simplí nó leibhéal níos ísle) réiteach a bhaineann le raon níos leithne fadhbanna ar eolas agus an chuid eile den réiteach a fhágáil suas go dtí an t-úsáideoir.
ru: У разработчиков другая точка зрения. Они могут посчитать проблему пользователя слишком уникальной, чтобы оправдать её решение (вместо обходного пути), или предложить частичное (обычно более простое или низкоуровневое) решение, применимое к более широкому кругу известных проблем, оставив остальную часть решения на усмотрение пользователя.
ta: டெவலப்பர்களைப் பொறுத்தவரை, முன்னோக்கு வேறுபட்டது. ஒரு தீர்வை நியாயப்படுத்த பயனரின் சிக்கலை அவர்கள் மிகவும் தனித்துவமாகக் காணலாம் (ஒரு பணித்தொகுதிக்கு பதிலாக), அல்லது அவர்கள் ஒரு பகுதி (பொதுவாக எளிமையான அல்லது கீழ் நிலை) தீர்வை பரிந்துரைக்கலாம், இது பரந்த அளவிலான அறியப்பட்ட சிக்கல்களுக்கு பொருந்தும் மற்றும் மீதமுள்ள தீர்வை மேலே விட்டுவிடுகிறது பயனருக்கு.
tr: Geliştiriciler için bakış açısı farklıdır. Kullanıcının sorununu bir çözüm üretmeyi (geçici çözüm yerine) haklı çıkaramayacak kadar kendine has bulabilirler veya daha geniş bir yelpazedeki bilinen sorunlara uygulanabilecek kısmi bir çözüm (genellikle daha basit veya daha düşük seviyeli) önerebilir ve çözümün geri kalanını kullanıcıya bırakabilirler.
uk: Для розробників перспектива інша. Вони можуть вважати проблему користувача надто унікальною, щоб виправдати рішення (замість обхідного шляху), або вони можуть запропонувати часткове (зазвичай простіше або нижчого рівня) рішення, яке стосується більш широкого кола відомих проблем, і залишити решту рішення. до користувача.

source: In any case, before attempting to contribute, it is important to discuss the actual problems with the other developers or contributors, so a better agreement on implementation can be reached.
ga: In aon chás, sula ndéantar iarracht cur leis, tá sé tábhachtach na fadhbanna iarbhír a phlé leis na forbróirí nó na ranníocóirí eile, ionas gur féidir teacht ar chomhaontú níos fearr maidir le cur chun feidhme.
ru: В любом случае, прежде чем пытаться внести свой вклад, важно обсудить реальные проблемы с другими разработчиками или участниками, чтобы можно было достичь лучшего соглашения по реализации.
ta: எந்தவொரு சந்தர்ப்பத்திலும், பங்களிக்க முயற்சிக்கும் முன், மற்ற உருவாக்குபவர்கள் அல்லது பங்களிப்பாளர்களுடன் உண்மையான சிக்கல்களைப் பற்றி விவாதிப்பது முதன்மை, எனவே செயல்படுத்தல் குறித்த சிறந்த உடன்பாட்டை எட்டலாம்.
tr: Her durumda, katkıda bulunmaya çalışmadan önce, gerçek sorunları diğer geliştiriciler veya katkıda bulunanlarla tartışmak önemlidir, böylece uyarlama konusunda daha iyi bir anlaşmaya varılabilir.
uk: У будь-якому випадку, перш ніж намагатися зробити внесок, важливо обговорити фактичні проблеми з іншими розробниками або учасниками, щоб можна було досягти кращої згоди щодо реалізації.

source: The only exception is when an area of code has a clear agreed upon owner, who talks to users directly and has the most knowledge to implement a solution directly.
ga: Is é an t-aon eisceacht ná nuair a bhíonn comhaontú soiléir ag réimse cód ar úinéir, a labhraíonn le húsáideoirí go díreach agus a bhfuil an t-eolas is mó aige chun réiteach a chur i bhfeidhm go díreach.
ru: Единственное исключение в этом случае является ситуация, когда область кода имеет четко определенного владельца, который напрямую общается с пользователями и обладает наибольшими знаниями для непосредственной реализации решения.
ta: குறியீட்டின் ஒரு பகுதி உரிமையாளருக்கு ஒரு தெளிவான ஒப்புக் கொள்ளப்பட்டதும், பயனர்களுடன் நேரடியாகப் பேசுவதும், ஒரு தீர்வை நேரடியாக செயல்படுத்த அதிக அறிவும் கொண்டிருக்கும்போது ஒரே விதிவிலக்கு.
tr: Bunun tek istisnası, bir kod alanının, kullanıcılarla doğrudan konuşan ve bir çözümü doğrudan uyarlamak için en fazla bilgiye sahip olan, üzerinde anlaşmaya varılmış net bir sahibinin olmasıdır.
uk: Єдиним винятком є випадки, коли область коду має чітко узгодженого власника, який безпосередньо спілкується з користувачами та має найбільше знань для безпосереднього впровадження рішення.

source: Also, Godot's philosophy is to favor ease of use and maintenance over absolute performance. Performance optimizations will be considered, but they may not be accepted if they make something too difficult to use or if they add too much complexity to the codebase.
ga: Chomh maith leis sin, is é fealsúnacht Godot ná éascaíocht úsáide agus cothabhála a bhfabhar thar fheidhmíocht iomlán. Déanfar optimizations feidhmíochta a mheas, ach ní féidir glacadh leo má dhéanann siad rud éigin ró-deacair a úsáid nó má chuireann siad an iomarca castachta leis an codebase.
ru: Кроме того, философия Godot заключается в предпочтении простоты использования и обслуживания над абсолютной производительностью. Оптимизация производительности будет рассмотрена, но она может быть не принята, если она сделает что-то слишком сложным в использовании или если она добавит слишком много сложности в кодовую базу.
ta: மேலும், கோடோட்டின் உண்மை முழுமையான செயல்திறனை விட பயன்பாட்டை எளிதாக்குவதற்கும் பராமரிப்பையும் ஆதரிப்பதாகும். செயல்திறன் மேம்படுத்தல்கள் பரிசீலிக்கப்படும், ஆனால் அவை பயன்படுத்த மிகவும் கடினமான ஒன்றைப் பயன்படுத்தினால் அல்லது அவை கோட்பேசில் அதிக சிக்கலான தன்மையைச் சேர்த்தால் அவை ஏற்றுக்கொள்ளப்படாது.
tr: Ayrıca, Godot'un felsefesi mutlak performans yerine kullanım ve bakım kolaylığını tercih etmektir. Performans iyileştirmeleri dikkate alınacaktır, ancak bir şeyin kullanımını çok zorlaştırırlarsa veya kod tabanına çok fazla karmaşıklık eklerlerse kabul edilmeyebilirler.
uk: Єдиним випадком є випадки, коли область коду має чітко узгодженого власника, який іноді спілкується з користувачами та має найбільше знань для попереднього впровадження рішення.

source: #5: To each problem, its own solution
ga: #5: Chun gach fadhb, a réiteach féin
ru: #5: Каждой проблеме - своё решение
ta: #5: ஒவ்வொரு பிரச்சினைக்கும், அதன் சொந்த தீர்வு
tr: #5: Her sorunun kendi çözümü vardır
uk: № 5: Для кожної проблеми своє рішення

source: For programmers, it is always a most enjoyable challenge to find the most optimal solutions to problems. It is possible to go overboard, though. Sometimes, contributors will try to come up with solutions that solve as many problems as possible.
ga: I gcás ríomhchláraitheoirí, is dúshlán an-taitneamhach é i gcónaí na réitigh is fearr a fháil ar fhadhbanna. Is féidir dul thar bord, áfach. Uaireanta, déanfaidh rannpháirtithe iarracht teacht ar réitigh a réitíonn an oiread fadhbanna agus is féidir.
ru: Для программистов поиск наиболее оптимальных решений задач всегда является увлекательной задачей. Однако здесь можно переусердствовать. Иногда разработчики пытаются найти решения, которые решают как можно больше проблем.
ta: புரோகிராமர்களைப் பொறுத்தவரை, சிக்கல்களுக்கு மிகவும் உகந்த தீர்வுகளைக் கண்டறிவது எப்போதுமே மிகவும் சுவையான சவாலாகும். இருப்பினும், கப்பலில் செல்ல முடியும். சில நேரங்களில், பங்களிப்பாளர்கள் முடிந்தவரை பல சிக்கல்களைத் தீர்க்கும் தீர்வுகளைக் கொண்டு வர முயற்சிப்பார்கள்.
tr: Programcılar için, sorunlara en uygun çözümleri bulmak her zaman en zevkli mücadeledir. Yine de aşırıya kaçmak mümkündür. Bazen, katkıda bulunanlar mümkün olduğunca çok sayıda sorunu çözen çözümler bulmaya çalışacaktır.
uk: Для програмістів завжди найприємнішим завданням є пошук найбільш оптимальних рішень проблем. Однак можна переборщити. Іноді учасники намагаються знайти рішення, які вирішать якомога більше проблем.

source: The situation will often take a turn for the worse when, in order to make this solution appear even more fantastic and flexible, the pure speculation-based problems (as described in #2) also make their appearance on stage.
ga: Is minic a thógfaidh an scéal dul chun donais nuair, d'fhonn an réiteach seo a dhéanamh níos iontach agus níos solúbtha, déanann na fadhbanna íon bunaithe ar tuairimíocht (mar a thuairiscítear i #2) a gcuma ar an stáitse freisin.
ru: Ситуация часто меняется к худшему, когда для того, чтобы это решение выглядело еще более фантастическим и гибким, на сцену выходят проблемы, основанные на чистой спекуляции (как описано в #2).
ta: இந்த தீர்வு இன்னும் அருமையாகவும் நெகிழ்வாகவும் தோன்றும் போது, தூய ஊக அடிப்படையிலான சிக்கல்களும் ( #2 இல் விவரிக்கப்பட்டுள்ளபடி) மேடையில் தோற்றமளிக்கும் போது நிலைமை பெரும்பாலும் மோசமான திருப்பத்தை எடுக்கும்.
tr: Bu çözümün daha da fantastik ve esnek görünmesini sağlamak için, saf spekülasyona dayalı problemler de (#2'de açıklandığı gibi) sahneye çıktığında durum genellikle daha da kötüye gidecektir.
uk: Ситуація часто стає гіршою, коли для того, щоб зробити це рішення ще більш фантастичним і гнучким, на сцені також з’являються чисто спекулятивні проблеми (як описано в №2).

source: The main problem is that, in reality, it rarely works this way. Most of the time, writing an individual solution to each problem results in code that is simpler and more maintainable.
ga: Is í an fhadhb is mó ná, i ndáiríre, is annamh a oibríonn sé ar an mbealach seo. An chuid is mó den am, scríobh réiteach aonair ar gach fadhb mar thoradh ar chód atá níos simplí agus níos inchoimeádta.
ru: Основная проблема заключается в том, что в реальности так получается редко. В большинстве случаев написание индивидуального решения для каждой проблемы приводит к тому, что код становится более простым и удобным для сопровождения.
ta: முக்கிய சிக்கல் என்னவென்றால், உண்மையில், இது அரிதாகவே இந்த வழியில் செயல்படுகிறது. பெரும்பாலான நேரங்களில், ஒவ்வொரு சிக்கலுக்கும் ஒரு தனிப்பட்ட தீர்வை எழுதுவது எளிமையான மற்றும் மிகவும் பராமரிக்கக்கூடிய குறியீட்டில் விளைகிறது.
tr: Asıl sorun, bunun gerçekte nadiren bu şekilde çalışmasıdır. Çoğu zaman, her sorun için ayrı bir çözüm yazmak, daha basit ve bakımı daha kolay bir kodla sonuçlanır.
uk: Основна проблема полягає в тому, що насправді це рідко працює таким чином. У більшості випадків написання індивідуального рішення для кожної проблеми призводить до коду, який стає простішим і зручнішим у супроводі.

source: Additionally, solutions that target individual problems are better for the users. Targeted solutions allow users find something that does exactly what they need, without having to learn a more complex system they will only need for simple tasks.
ga: Ina theannta sin, tá réitigh a dhíríonn ar fhadhbanna aonair níos fearr do na húsáideoirí. Ligeann réitigh spriocdhírithe d'úsáideoirí rud éigin a aimsiú a dhéanann go díreach cad a theastaíonn uathu, gan córas níos casta a fhoghlaim ní bheidh de dhíth orthu ach tascanna simplí.
ru: Кроме того, решения, ориентированные на индивидуальные проблемы, более удобны для пользователей. Целевые решения позволяют пользователям найти именно то, что им нужно, без необходимости изучать более сложную систему, которая понадобится им только для простых задач.
ta: கூடுதலாக, தனிப்பட்ட சிக்கல்களை குறிவைக்கும் தீர்வுகள் பயனர்களுக்கு சிறந்தது. இலக்கு தீர்வுகள் பயனர்கள் தங்களுக்குத் தேவையானதைச் சரியாகச் செய்யும் ஒன்றைக் கண்டுபிடிக்க அனுமதிக்கின்றன, மிகவும் சிக்கலான அமைப்பைக் கற்றுக்கொள்ளாமல் அவர்களுக்கு எளிய பணிகளுக்கு மட்டுமே தேவைப்படும்.
tr: Ayrıca, bireysel sorunları hedef alan çözümler kullanıcılar için daha iyidir. Hedeflenen çözümler, kullanıcıların yalnızca basit görevler için ihtiyaç duyacakları daha karmaşık bir sistemi öğrenmek zorunda kalmadan tam olarak ihtiyaç duydukları şeyi yapan bir şey bulmalarını sağlar.
uk: Крім того, рішення, спрямовані на індивідуальні проблеми, кращі для користувачів. Цільові рішення дозволяють користувачам знаходити те, що робить саме те, що їм потрібно, без необхідності вивчати більш складну систему, яка знадобиться лише для простих завдань.

source: Big and flexible solutions also have an additional drawback which is that, over time, they are rarely flexible enough for all users. Users end up requesting more and more functionality which ends up making the API and codebase more and more complex.
ga: Tá míbhuntáiste breise ag réitigh mhóra agus solúbtha freisin, is é sin, le himeacht ama, is annamh a bhíonn siad solúbtha go leor do gach úsáideoir. Úsáideoirí deireadh suas ag iarraidh feidhmiúlacht níos mó agus níos mó a chríochnaíonn suas a dhéanamh ar an API agus codebase níos mó agus níos casta.
ru: Большие и гибкие решения также имеют дополнительный недостаток: со временем они редко становятся достаточно гибкими для всех пользователей. Пользователи в итоге запрашивают всё больше и больше функций, что приводит к усложнению API и кодовой базы.
ta: பெரிய மற்றும் நெகிழ்வான தீர்வுகளும் கூடுதல் குறைபாட்டைக் கொண்டுள்ளன, அதாவது காலப்போக்கில், அவை எல்லா பயனர்களுக்கும் போதுமான நெகிழ்வானவை. பயனர்கள் மேலும் மேலும் செயல்பாட்டைக் கோருகிறார்கள், இது பநிஇ மற்றும் கோட்பேசை மேலும் மேலும் சிக்கலாக்குகிறது.
tr: Büyük ve esnek çözümlerin ek bir dezavantajı daha vardır, o da zaman geçtikçe tüm kullanıcılar için nadiren yeterince esnek kalabilmeleridir. Kullanıcılar giderek daha fazla işlevsellik talep etmeye başlar ve bu da API ve kod tabanını giderek daha da karmaşık hale getirir.
uk: Великі та гнучкі рішення також мають додатковий недолік, який полягає в тому, що з часом вони рідко стають достатньо гнучкими для всіх користувачів. Зрештою користувачі вимагають все більше і більше функціональних можливостей, що в кінцевому підсумку робить API і кодову базу все більш і більш складними.

source: #6: Cater to common use cases, leave the door open for the rare ones
ga: #6: Freastal ar chásanna úsáide coitianta, fág an doras ar oscailt do na cinn neamhchoitianta
ru: #6: Удовлетворяйте общие потребности, оставляйте дверь открытой для редких случаев использования
ta: #6: பொதுவான பயன்பாட்டு நிகழ்வுகளைப் நிறைவு செய்யுங்கள், அரிதானவற்றுக்கு கதவைத் திறந்து விடுங்கள்
tr: #6: Yaygın kullanım durumlarına hitap edin, nadir olanlar için kapıyı aralık bırakın
uk: №6: Забезпечте звичайні випадки використання, залиште двері відкритими для рідкісних

source: This is a continuation of the previous point, which further explains why this way of thinking and designing software is preferred.
ga: Is leanúint é seo den phointe roimhe seo, a mhíníonn tuilleadh cén fáth gur fearr an bealach smaointeoireachta agus deartha bogearraí seo.
ru: Это продолжение предыдущего пункта, которое объясняет, почему такой способ мышления и проектирования программного обеспечения является предпочтительным.
ta: இது முந்தைய புள்ளியின் தொடர்ச்சியாகும், இது இந்த சிந்தனை மற்றும் வடிவமைக்கும் மென்பொருள் ஏன் விரும்பப்படுகிறது என்பதை மேலும் விளக்குகிறது.
tr: Bu, bir önceki noktanın devamıdır ve bu şekilde düşünmenin ve yazılım tasarlamanın neden tercih edildiğini daha iyi açıklamaktadır.
uk: Це продовження попереднього пункту, який додатково пояснює, чому саме такому способу мислення та розробки програмного забезпечення віддається перевага.
