Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/best_practices_for_engine_contributors.po
Languages: ga, it, ru, ta, tr, uk

source: Best practices for engine contributors
ga: Dea-chleachtais do rannchuiditheoirí innill
it: Migliori pratiche per i contributori al motore
ru: Правила и рекомендации для разработчиков движка
ta: இயந்திர பங்களிப்பாளர்களுக்கான சிறந்த நடைமுறைகள்
tr: Motora katkıda bulunanlar için en iyi uygulama yöntemleri
uk: Найкращі практики для учасників системи

source: Introduction
ga: Réamhrá
it: Introduzione
ru: Введение
ta: அறிமுகம்
tr: Giriş
uk: Вступ

source: Godot has a large amount of users who have the ability to contribute because the project itself is aimed mainly at users who can code. That being said, not all of them have the same level of experience working in large projects or in software engineering, which can lead to common misunderstandings and bad practices during the process of contributing code to the project.
ga: Tá cuid mhór úsáideoirí ag Godot a bhfuil an cumas acu cur leis toisc go bhfuil an tionscadal féin dírithe go príomha ar úsáideoirí ar féidir leo cód a dhéanamh. É sin ráite, níl an leibhéal céanna taithí ag gach duine acu ag obair i dtionscadail mhóra nó in innealtóireacht bogearraí, rud a d'fhéadfadh míthuiscintí agus droch-chleachtais choitianta a bheith mar thoradh air le linn an phróisis chun cód a chur leis an tionscadal.
it: Godot ha un gran numero di utenti in grado di contribuire, poiché il progetto stesso si rivolge principalmente a utenti che sanno programmare. Detto questo, non tutti hanno lo stesso livello di esperienza in grandi progetti o nell'ingegneria informatica, il che può portare a malintesi e cattive pratiche durante il processo di contribuzione al progetto.
ru: У Godot большое количество пользователей, которые могут внести свой вклад, поскольку сам проект ориентирован в основном на пользователей, умеющих писать код. При этом не все они обладают одинаковым уровнем опыта работы над крупными проектами или в области разработки программного обеспечения, что может приводить к распространённым недопониманиям и недобросовестным практикам в процессе внесения кода в проект.
ta: கோடோட் ஒரு பெரிய அளவிலான பயனர்களைக் கொண்டுள்ளது, அவர்கள் பங்களிக்கும் திறனைக் கொண்டுள்ளனர், ஏனெனில் இந்த திட்டம் முக்கியமாக குறியிடக்கூடிய பயனர்களை இலக்காகக் கொண்டுள்ளது. சொல்லப்பட்டால், அவர்கள் அனைவருக்கும் பெரிய திட்டங்களில் அல்லது மென்பொருள் பொறியியலில் பணிபுரியும் ஒரே அளவிலான பட்டறிவு இல்லை, இது திட்டத்திற்கு குறியீட்டை வழங்கும் செயல்பாட்டின் போது பொதுவான தவறான புரிதல்கள் மற்றும் மோசமான நடைமுறைகளுக்கு வழிவகுக்கும்.
tr: Godot, katkıda bulunma yeteneğine sahip çok sayıda kullanıcıya sahiptir, çünkü projenin kendisi esas olarak kod yazabilen kullanıcılara yöneliktir. Bununla birlikte, hepsi büyük projelerde veya yazılım mühendisliğinde çalışma konusunda aynı düzeyde deneyime sahip değildir, bu da projeye kod katkısı sürecinde yaygın yanlış anlamalara ve kötü uygulamalara yol açabilir.
uk: Godot має велику кількість користувачів, які можуть зробити свій внесок, оскільки сам проект орієнтований головним чином на користувачів, які вміють кодувати. З огляду на це, не всі вони мають однаковий рівень досвіду роботи у великих проектах або розробці програмного забезпечення, що може призвести до загальних непорозумінь і поганих практик під час процесу внесення коду до проекту.

source: Language
ga: Teanga
it: Lingua
ru: Язык
ta: மொழி
tr: Dil
uk: Мова

source: The scope of this document is to be a list of best practices for contributors to follow, as well as to create a language they can use to refer to common situations that arise in the process of submitting their contributions.
ga: Is é raon feidhme an doiciméid seo ná liosta de na dea-chleachtais atá le leanúint ag rannchuiditheoirí, chomh maith le teanga a chruthú ar féidir leo a úsáid chun tagairt a dhéanamh do chásanna coitianta a thagann chun cinn sa phróiseas chun a gcuid ranníocaíochtaí a chur isteach.
ru: Сфера применения данного документа - это список лучших практик, которым должны следовать участники, а также создание языка, который они смогут использовать для обозначения общих ситуаций, возникающих в процессе представления их вкладов.
ta: இந்த ஆவணத்தின் நோக்கம் பங்களிப்பாளர்களைப் பின்பற்றுவதற்கான சிறந்த நடைமுறைகளின் பட்டியலாக இருக்க வேண்டும், அத்துடன் அவர்களின் பங்களிப்புகளைச் சமர்ப்பிக்கும் செயல்பாட்டில் எழும் பொதுவான சூழ்நிலைகளைக் குறிக்க அவர்கள் பயன்படுத்தக்கூடிய மொழியை உருவாக்க வேண்டும்.
tr: Bu belgenin kapsamı, katkıda bulunanların izlemesi gereken en iyi uygulamaların bir listesi olmanın yanı sıra, katkılarını sunma sürecinde ortaya çıkan yaygın durumlara atıfta bulunmak için kullanabilecekleri bir dil oluşturmaktır.
uk: Обсяг цього документа – це перелік найкращих практик, яких слід дотримуватися учасникам, а також створити мову, яку вони можуть використовувати для посилань на типові ситуації, які виникають у процесі подання своїх внесків.

source: While a generalized list of software development best practices might be useful, we'll focus on the situations that are most common in our project.
ga: Cé go bhféadfadh liosta ginearálaithe de dhea-chleachtais forbartha bogearraí a bheith úsáideach, díreoimid ar na cásanna is coitianta inár dtionscadal.
it: Sebbene un elenco generalizzato delle migliori pratiche per lo sviluppo software possa essere utile, ci concentreremo sulle situazioni più comuni nel nostro progetto.
ru: Хотя обобщенный список лучших практик разработки программного обеспечения может быть полезен, мы сосредоточимся на ситуациях, которые чаще всего встречаются в нашем проекте.
ta: மென்பொருள் மேம்பாட்டு சிறந்த நடைமுறைகளின் பொதுவான பட்டியல் பயனுள்ளதாக இருக்கும் என்றாலும், எங்கள் திட்டத்தில் மிகவும் பொதுவான சூழ்நிலைகளில் கவனம் செலுத்துவோம்.
tr: Genelleştirilmiş bir yazılım geliştirme en iyi uygulamalar listesi faydalı olabilir, ancak biz projemizde en sık karşılaşılan durumlara odaklanacağız.
uk: Хоча узагальнений список найкращих практик розробки програмного забезпечення може бути корисним, ми зосередимося на ситуаціях, які найчастіше зустрічаються в нашому проекті.

source: Contributions are most of the time categorized as bug fixes, enhancements or new features. To abstract this idea, we will call them *Solutions*, because they always seek to solve something that can be described as a *Problem*.
ga: Tá ranníocaíochtaí an chuid is mó den am a chatagóiriú mar ceartúcháin bug, feabhsuithe nó gnéithe nua. Chun an smaoineamh seo a theibí, tabharfaimid *Solutions *orthu, toisc go ndéanann siad iarracht i gcónaí rud éigin a réiteach ar féidir cur síos air mar *Problem *.
ru: Доработки, в большинстве своём, можно классифицировать как: исправления ошибок (багфиксы), улучшения (доработки) или добавление новых функций. Чтобы абстрагироваться от этой классификации мы будем называть все доработки *Решениями*, потому что они всегда нацелены на решение чего-то определённого, того, что можно назвать *Проблемой*.
ta: பிழைத்திருத்தங்கள், மேம்பாடுகள் அல்லது புதிய அம்சங்களாக பங்களிப்புகள் பெரும்பாலும் வகைப்படுத்தப்படுகின்றன. இந்த யோசனையை சுருக்கிக் கொள்ள, நாங்கள் அவர்களை *தீர்வுகள் *என்று அழைப்போம், ஏனென்றால் அவர்கள் எப்போதும் ஒரு *பிரச்சினை *என்று விவரிக்கக்கூடிய ஒன்றை தீர்க்க முற்படுகிறார்கள்.
tr: Katkılar çoğu zaman hata düzeltmeleri, geliştirmeler veya yeni özellikler olarak kategorize edilir. Bu fikri soyutlamak için onlara *Çözümler* diyeceğiz, çünkü her zaman *Sorun* olarak tanımlanabilecek bir şeyi çözmeye çalışırlar.
uk: Внески здебільшого класифікуються як виправлення помилок, покращення або нові функції. Щоб абстрагуватися від цієї ідеї, ми назвемо їх *Рішеннями*, тому що вони завжди прагнуть вирішити щось, що можна описати як *Проблему*.

source: Best Practices
ga: Dea-Chleachtais
it: Migliori pratiche
ru: Правила работы
ta: சிறந்த நடைமுறைகள்
tr: En İyi Uygulamalar
uk: Найкращі практики

source: #1: The problem always comes first
ga: # 1: Tagann an fhadhb i gcónaí ar dtús
it: #N°1: Il problema viene sempre prima
ru: #1: Сначала проблема
ta: #1: சிக்கல் எப்போதும் முதலில் வரும்
tr: #1: Sorun her zaman önce gelir
uk: №1: Проблема завжди стоїть на першому місці

source: Many contributors are extremely creative and just enjoy the process of designing abstract data structures, creating nice user interfaces, or simply love programming. Whatever the case may be, they come up with cool ideas, which may or may not solve real problems.
ga: Tá go leor rannpháirtithe thar a bheith cruthaitheach agus díreach taitneamh a bhaint as an bpróiseas a dhearadh struchtúir sonraí teibí, a chruthú comhéadain úsáideora deas, nó go simplí grá cláir. Cibé rud a d'fhéadfadh a bheith ann, tagann siad suas le smaointe fionnuar, a d'fhéadfadh nó nach bhféadfadh fadhbanna fíor a réiteach.
it: Molti collaboratori sono estremamente creativi e amano il processo di progettare strutture dati astratte, creare interfacce utente accattivanti o semplicemente programmare. In ogni caso, escogitano idee interessanti, che potrebbero o meno risolvere problemi reali.
ru: Многие участники невероятно креативны и просто получают удовольствие от процесса проектирования абстрактных структур данных, создания удобных пользовательских интерфейсов или просто любят программирование. В любом случае, они предлагают интересные идеи, которые могут решить реальные проблемы, а могут и не решить.
ta: பல பங்களிப்பாளர்கள் மிகவும் ஆக்கபூர்வமானவர்கள் மற்றும் சுருக்க தரவு கட்டமைப்புகளை வடிவமைத்தல், நல்ல பயனர் இடைமுகங்களை உருவாக்குதல் அல்லது நிரலாக்கத்தை விரும்பும் செயல்முறையை அனுபவிக்கின்றனர். எதுவாக இருந்தாலும், அவை அருமையான யோசனைகளைக் கொண்டு வருகின்றன, அவை உண்மையான சிக்கல்களைத் தீர்க்கலாம் அல்லது தீர்க்கக்கூடாது.
tr: Birçok katılımcı son derece yaratıcıdır ve sadece soyut veri yapıları tasarlama, güzel kullanıcı arayüzleri oluşturma sürecinden zevk alır veya sadece programlamayı sever. Durum ne olursa olsun, gerçek sorunları çözebilecek ya da çözemeyecek harika fikirler üretirler.
uk: Багато учасників надзвичайно креативні та просто насолоджуються процесом проектування абстрактних структур даних, створення приємних інтерфейсів користувача або просто люблять програмувати. Як би там не було, вони придумують круті ідеї, які можуть вирішити реальні проблеми, а можуть і ні.

source: These are usually called *solutions in search of a problem*. In an ideal world, they would not be harmful but, in reality, code takes time to write, takes up space and requires maintenance once it exists. Avoiding the addition of anything unnecessary is always considered a good practice in software development.
ga: Tugtar *solutions orthu seo de ghnáth agus iad ar thóir fadhb *. I saol idéalach, ní bheadh siad díobhálach ach, i ndáiríre, tógann cód am a scríobh, tógann sé spás agus éilíonn cothabháil nuair atá sé ann. Meastar i gcónaí gur dea-chleachtas i bhforbairt bogearraí é aon rud nach bhfuil gá leis a sheachaint.
it: Queste sono solitamente chiamate *soluzioni alla ricerca di un problema*. In un mondo ideale, non sarebbero dannose, ma in realtà il codice richiede tempo per essere scritto, occupa spazio e richiede manutenzione una volta creato. Evitare di aggiungere qualsiasi cosa non necessaria è sempre considerata una buona pratica nello sviluppo software.
ru: Обычно их называют *решениями в поисках проблемы*. В идеальном мире они не приносят вреда, но в реальности написание кода занимает много времени, занимает место и требует поддержки после написания. Избегать добавления всего лишнего всегда считается хорошей практикой в разработке программного обеспечения.
ta: இவை வழக்கமாக ஒரு சிக்கலைத் தேடி *தீர்வுகள் *என்று அழைக்கப்படுகின்றன *. ஒரு சிறந்த உலகில், அவை தீங்கு விளைவிக்காது, ஆனால், உண்மையில், குறியீடு எழுத நேரம் எடுக்கும், இடத்தை எடுத்துக்கொள்கிறது மற்றும் அது இருந்தவுடன் பராமரிப்பு தேவைப்படுகிறது. தேவையற்ற எதையும் சேர்ப்பதைத் தவிர்ப்பது எப்போதும் மென்பொருள் வளர்ச்சியில் ஒரு நல்ல நடைமுறையாக கருதப்படுகிறது.
tr: Bunlar genellikle *sorun arayan çözümler* olarak adlandırılır. İdeal bir dünyada zararlı olmazlar ancak gerçekte kodun yazılması zaman alır, yer kaplar ve var olduktan sonra bakım gerektirir. Gereksiz herhangi bir şeyin eklenmesinden kaçınmak, yazılım geliştirmede her zaman iyi bir uygulama olarak kabul edilir.
uk: Зазвичай їх називають *рішеннями у пошуках проблеми*. В ідеальному світі вони не були б шкідливими, але насправді для написання коду потрібен час, він займає простір і потребує обслуговування, коли вже існує. Уникнення додавання чогось непотрібного завжди вважається хорошою практикою в розробці програмного забезпечення.

source: #2: To solve the problem, it has to exist in the first place
ga: #2: Chun an fhadhb a réiteach, caithfidh sé a bheith ann ar an gcéad dul síos
it: #N°2: Per risolvere il problema, deve innanzitutto esistere
ru: #2: Чтобы решить проблему, сначала убедитесь в её существовании
ta: #2: சிக்கலைத் தீர்க்க, அது முதலில் இருக்க வேண்டும்
tr: #2: Sorunu çözmek için öncelikle sorunun var olması gerekir
uk: №2: Щоб вирішити проблему, вона повинна існувати в першу чергу

source: This is a variation of the previous practice. Adding anything unnecessary is not a good idea, but what constitutes what is necessary and what isn't?
ga: Is athrú é seo ar an gcleachtas roimhe seo. Ní smaoineamh maith é aon rud nach bhfuil gá leis a chur leis, ach cad is gá ann agus cad nach bhfuil?
it: Questa è una variazione della pratica precedente. Aggiungere qualcosa di superfluo non è una buona idea, ma cosa costituisce ciò che è necessario e ciò che non lo è?
ru: Это вариация предыдущего пункта. Добавление чего-то необязательного это плохая идея, но что значит "обязательный" и что таковым не является?
ta: இது முந்தைய நடைமுறையின் மாறுபாடு. தேவையற்ற எதையும் சேர்ப்பது நல்ல யோசனையல்ல, ஆனால் எது அவசியமானது, எது இல்லை?
tr: Bu, önceki uygulamanın bir varyasyonudur. Gereksiz bir şey eklemek iyi bir fikir değildir, ancak neyin gerekli olup neyin olmadığını belirleyen nedir?
uk: Це різновид попередньої практики. Додавати щось непотрібне — не дуже гарна ідея, але що є потрібним, а що ні?

source: The answer to this question is that the problem needs to *exist* before it can be actually solved. It must not be speculation or a belief. The user must be using the software as intended to create something they *need*. In this process, the user may stumble upon a problem that requires a solution to proceed, or in order to achieve greater productivity. In this case, *a solution is needed*.
ga: Is é freagra na ceiste seo ná go gcaithfidh an fhadhb *a bheith ann *sular féidir í a réiteach i ndáiríre. Ní féidir tuairimíocht ná creideamh a bheith ann. Caithfidh an t-úsáideoir a bheith ag baint úsáide as na bogearraí mar atá beartaithe chun rud éigin a chruthú a theastaíonn uathu *. Sa phróiseas seo, d'fhéadfadh an t-úsáideoir dul i ngleic le fadhb a éilíonn réiteach chun dul ar aghaidh, nó chun táirgiúlacht níos mó a bhaint amach. Sa chás seo, tá *réiteach ag teastáil *.
it: La risposta a questa domanda è che il problema deve *esistere* prima di poter essere effettivamente risolto. Non deve essere una speculazione o una convinzione. L'utente deve utilizzare il software come previsto per creare qualcosa di cui *ha bisogno*. In questo processo, l'utente potrebbe imbattersi in un problema che richiede una soluzione per procedere, o per ottenere una maggiore produttività. In questo caso, *è necessaria una soluzione*.
ru: Ответ на этот вопрос заключается в том, что проблема должна *существовать*, прежде чем её можно будет фактически решить. Она не должна быть домыслом или убеждением. Пользователь должен использовать программное обеспечение по назначению, для создания того, что ему *нужно*. В этом процессе пользователь может столкнуться с проблемой, требующей решения для продолжения работы или повышения производительности. В этом случае *необходимо решение*.
ta: இந்த கேள்விக்கான பதில் என்னவென்றால், சிக்கல் உண்மையில் தீர்க்கப்படுவதற்கு முன்பு * இருக்க வேண்டும் *. இது ஊகம் அல்லது நம்பிக்கையாக இருக்கக்கூடாது. பயனர் தங்களுக்கு *தேவையான ஒன்றை உருவாக்க நோக்கமாக மென்பொருளைப் பயன்படுத்த வேண்டும். இந்த செயல்பாட்டில், பயனர் தொடர ஒரு தீர்வு தேவைப்படும் ஒரு சிக்கலில் தடுமாறலாம், அல்லது அதிக உற்பத்தித்திறனை அடைவதற்கு. இந்த வழக்கில், *ஒரு தீர்வு தேவை *.
tr: Bu sorunun cevabı, sorunun gerçekten çözülebilmesi için önce *var olması* gerektiğidir. Bu bir spekülasyon ya da inanç olmamalıdır. Kullanıcı, yazılımı *ihtiyaç duyduğu* bir şeyi yaratmak için amaçlandığı şekilde kullanıyor olmalıdır. Bu süreçte kullanıcı, ilerlemek veya daha fazla üretkenlik elde etmek için çözüm gerektiren bir sorunla karşılaşabilir. Bu durumda *bir çözüme ihtiyaç vardır*.
uk: Відповідь на це питання полягає в тому, що проблема повинна *існувати*, перш ніж її можна буде фактично вирішити. Це не повинно бути припущенням чи вірою. Користувач повинен використовувати програмне забезпечення за призначенням, щоб створити те, що йому *потрібно*. У цьому процесі користувач може наштовхнутися на проблему, яка вимагає вирішення для продовження або для досягнення більшої продуктивності. У цьому випадку *потрібне рішення*.

source: Believing that problems may arise in the future and that the software needs to be ready to solve them by the time they appear is called *"Future proofing"* and its characterized by lines of thought such as:
it: Credere che in futuro possano presentarsi dei problemi e che il software debba essere pronto a risolverli nel momento in cui si presentano è detto *"Future proofing"* ed è caratterizzato da linee di pensiero del tipo:
ta: எதிர்காலத்தில் பிரச்சினைகள் எழக்கூடும் என்றும், மென்பொருள் அவை தோன்றும் நேரத்தில் அவற்றைத் தீர்க்கத் தயாராக இருக்க வேண்டும் என்றும் நம்புவது * "எதிர்கால சரிபார்ப்பு" * என்றும், இது போன்ற சிந்தனைக் கோடுகளால் வகைப்படுத்தப்படுகிறது:
tr: Gelecekte sorunların ortaya çıkabileceğine ve ortaya çıktıklarında yazılımın bunları çözmeye hazır olması gerektiğine inanmak *"Geleceğe hazırlama "* olarak adlandırılır ve aşağıdaki gibi düşünce çizgileriyle karakterize edilir:
uk: Віра в те, що проблеми можуть виникнути в майбутньому і що програмне забезпечення має бути готове до їх вирішення до того моменту, як вони з’являться, називається *"Перевірка майбутнього"* і характеризується такими напрямками думок, як:

source: I think it would be useful for users to...
ga: Sílim go mbeadh sé úsáideach d'úsáideoirí ...
it: Penso che sarebbe utile per gli utenti a...
ru: Я думаю, в будущем, пользователям может быть полезно...
ta: பயனர்களுக்கு இது பயனுள்ளதாக இருக்கும் என்று நான் நினைக்கிறேன் ...
tr: Kullanıcılar için faydalı olacağını düşünüyorum...
uk: Я думаю, що користувачам було б корисно...

source: I think users will eventually need to...
ga: Sílim go mbeidh ar úsáideoirí sa deireadh ...
it: Penso che gli utenti alla fine avranno bisogno di...
ru: Думаю, пользователям в конечном итоге понадобится...
ta: பயனர்கள் இறுதியில் தேவைப்படும் என்று நினைக்கிறேன் ...
tr: Bence kullanıcılar eninde sonunda şuna ihtiyaç duyacak...
uk: Я думаю, що з часом користувачам доведеться...

source: This is generally considered a bad habit because trying to solve problems that *don't actually exist* in the present will often lead to code that will be written but never used, or that is considerably more complex to use and maintain than it needs to be.
ga: Meastar go ginearálta gur droch-nós é seo mar is minic a bhíonn cód scríofa ach nach n-úsáidfear riamh mar thoradh ar iarracht a dhéanamh fadhbanna a réiteach nach bhfuil *ann i ndáiríre *san am i láthair, nó atá i bhfad níos casta le húsáid agus le cothabháil ná mar is gá dó a bheith.
it: Questa è generalmente considerata una cattiva abitudine perché cercare di risolvere problemi che *non esistono* nel presente spesso porterà a codice che sarà scritto ma mai utilizzato, o che è considerevolmente più complesso da usare e mantenere del necessario.
ru: Как правило, это считается плохой привычкой, потому что попытка решить проблемы которых *на самом деле не существует* в настоящем, с большой вероятностью приведёт к тому что написанный код никогда не будет использован в будущем, или к тому что его поддержка и использование окажутся гораздо сложнее, чем предполагалось.
ta: இது பொதுவாக ஒரு மோசமான பழக்கமாகக் கருதப்படுகிறது, ஏனென்றால் தற்போது * உண்மையில் இல்லாத சிக்கல்களைத் தீர்க்க முயற்சிப்பது * தற்போது எழுதப்படும் ஆனால் ஒருபோதும் பயன்படுத்தப்படாத குறியீட்டிற்கு வழிவகுக்கும், அல்லது அது தேவைப்படுவதை விட பயன்படுத்தவும் பராமரிக்கவும் மிகவும் சிக்கலானது இருங்கள்.
tr: Bu genellikle kötü bir alışkanlık olarak kabul edilir çünkü şimdiki zamanda *gerçekte var olmayan* sorunları çözmeye çalışmak, genellikle yazılacak ancak hiç kullanılmayacak veya kullanımı ve bakımı olması gerekenden çok daha karmaşık olan kodlara yol açacaktır.
uk: Зазвичай це вважається поганою звичкою, оскільки намагання вирішити проблеми, яких *насправді не існує* в даний час, часто призводять до коду, який буде написаний, але ніколи не використаний, або який значно складніший у використанні та обслуговуванні, ніж це потрібно бути.

source: #3: The problem has to be complex or frequent
ga: #3: Caithfidh an fhadhb a bheith casta nó minic
it: #N°3: Il problema deve essere complesso o frequente
ru: #3: Проблема должна быть сложной или частой
ta: #3: சிக்கல் சிக்கலானதாகவோ அல்லது அடிக்கடி இருக்க வேண்டும்
tr: #3: Sorunun karmaşık veya sık oluyor olması gerekir
uk: #3: Проблема має бути складною або частою

source: Software is designed to solve problems, but we can't expect it to solve *every problem that exists under the sun*. As a game engine, Godot will help you make games better and faster, but it won't make an *entire game* for you. A line must be drawn somewhere.
ga: Tá bogearraí deartha chun fadhbanna a réiteach, ach ní féidir linn a bheith ag súil go réiteoidh sé *gach fadhb atá ann faoin ngrian *. Mar inneall cluiche, cabhróidh Godot leat cluichí a dhéanamh níos fearr agus níos tapúla, ach ní dhéanfaidh sé *cluiche iomlán *duit. Caithfear líne a tharraingt áit éigin.
it: Il software è progettato per risolvere problemi, ma non possiamo aspettarci che risolva *ogni problema esistente sotto il sole*. Come motore di gioco, Godot ti aiuterà a creare giochi migliori e più veloci, ma non creerà un *gioco intero* per te. Da qualche parte bisogna pur stabilire un limite.
ru: Программное обеспечение создано для решения проблем, но мы не можем ожидать, что оно решит *все проблемы, существующие на свете*. Godot, как игровой движок, поможет вам делать игры лучше и быстрее, но он не создаст за вас *целую игру*. Где-то должна быть граница.
ta: மென்பொருள் சிக்கல்களைத் தீர்க்க வடிவமைக்கப்பட்டுள்ளது, ஆனால் சூரியனின் கீழ் இருக்கும் ஒவ்வொரு சிக்கலையும் *தீர்க்கும் என்று எதிர்பார்க்க முடியாது *. ஒரு விளையாட்டு இயந்திரமாக, கோடோட் விளையாட்டுகளை சிறப்பாகவும் வேகமாகவும் மாற்ற உதவும், ஆனால் இது உங்களுக்காக * முழு விளையாட்டை * உருவாக்காது. ஒரு வரி எங்காவது வரையப்பட வேண்டும்.
tr: Yazılım sorunları çözmek için tasarlanmıştır, ancak *güneşin altında var olan her sorunu* çözmesini bekleyemeyiz. Bir oyun motoru olarak Godot, oyunları daha iyi ve daha hızlı yapmanıza yardımcı olacaktır, ancak sizin için *bir oyunun bütününü* yapmayacaktır. Bir yerde bir çizgi çekilmelidir.
uk: Програмне забезпечення розроблено для вирішення проблем, але ми не можемо очікувати, що воно вирішить *кожну проблему, яка існує під сонцем*. Як ігровий движок Godot допоможе вам зробити ігри кращими та швидшими, але він не створить для вас *цілу гру*. Десь треба провести лінію.
