Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/handling_compatibility_breakages.po
Languages: de, tr, uk

source: Handling compatibility breakages
de: Umgang mit Kompatibilitätsbrüchen
tr: Uyumluluk kırılmalarının ele alınması
uk: Усунення порушень сумісності

source: So you've added a new parameter to a method, changed the return type, changed the type of a parameter, or changed its default value, and now the automated testing is complaining about compatibility breakages?
de: Sie haben also einen neuen Parameter zu einer Methode hinzugefügt, den Rückgabetyp, den Typ eines Parameters oder seinen Defaultwert geändert, und jetzt beschweren sich die automatisierten Tests über Kompatibilitätsbrüche?
tr: Sonunda bir yönteme yeni bir parametre eklediniz, dönüş türünü değiştirdiniz, bir parametrenin türünü değiştirdiniz veya varsayılan değerini değiştirdiniz, ama şimdi de otomatik testler uyumluluk bozulmaları var diye şikayet mi ediyor?
uk: Отже, ви додали новий параметр до методу, змінили тип повернення, змінили тип параметра або змінили його значення за замовчуванням, і тепер автоматизоване тестування скаржиться на порушення сумісності?

source: Breaking compatibility should be avoided, but when necessary there are systems in place to handle this in a way that makes the transition as smooth as possible.
de: Kompatibilitätsbrüche sollten vermieden werden, aber wenn es notwendig ist, gibt es Systeme, die den Übergang so reibungslos wie möglich gestalten.
tr: Uyumluluğu bozmaktan kaçınılmalıdır, ancak gerektiğinde bunu geçişi mümkün olduğunca sorunsuz hale getirecek şekilde ele alacak sistemler mevcuttur.
uk: Слід уникати порушення сумісності, але за необхідності існують системи, які впораються з цим таким чином, щоб зробити перехід максимально плавним.

source: A practical example
de: Ein praktisches Beispiel
tr: Pratik bir örnek
uk: Практичний приклад

source: These changes are taken from `pull request #88047 <https://github.com/godotengine/godot/pull/88047>`_, which added new pathing options to ``AStarGrid2D`` and other AStar classes. Among other changes, these methods were modified in ``core/math/a_star_grid_2d.h``:
de: Diese Änderungen stammen aus dem `pull request #88047 <https://github.com/godotengine/godot/pull/88047>`_, der neue Pfadoptionen zu ``AStarGrid2D`` und anderen AStar-Klassen hinzugefügt hat. Neben anderen Änderungen wurden diese Methoden in ``core/math/a_star_grid_2d.h`` modifiziert:
tr: Bu değişiklikler, ``AStarGrid2D`` ve diğer AStar sınıflarına yeni yol seçenekleri ekleyen `çekme isteği #88047 <https://github.com/godotengine/godot/pull/88047>`_'den alınmıştır. Diğer değişikliklerin yanı sıra, ``core/math/a_star_grid_2d.h`` içindeki bu yöntemler şundan:
uk: Ці зміни взято з `запиту на витягування #88047 <https://github.com/godotengine/godot/pull/88047>`_, який додав нові параметри шляху до ``AStarGrid2D`` та інших класів AStar. Серед інших змін, ці методи були змінені в ``core/math/a_star_grid_2d.h``:

source: To:
de: Nach:
tr: Şuna değiştirilmişti:
uk: до:

source: This meant adding new compatibility method bindings to the file, which should be in the ``protected`` section of the code, usually placed next to ``_bind_methods()``:
de: Dies bedeutete, dass neue Kompatibilitätsmethoden-Bindings in die Datei aufgenommen werden mussten, die im ``geschützten`` Abschnitt des Codes, normalerweise neben ``_bind_methods()``, platziert werden sollten:
tr: Bu, genellikle ``_bind_methods()`` işlevinin yanına yerleştirilen ve kodun ``protected`` bölümünde olması gereken yeni uyumluluk yöntemi bağlamalarını dosyaya eklemek anlamına geliyordu:
uk: Це означало додавання нових прив’язок методів сумісності до файлу, який повинен бути в розділі ``protected`` коду, зазвичай розміщеному поруч з ``_bind_methods()``:

source: They should start with a ``_`` to indicate that they are internal, and end with ``_bind_compat_`` followed by the PR number that introduced the change (``88047`` in this example). These compatibility methods need to be implemented in a dedicated file, like ``core/math/a_star_grid_2d.compat.inc`` in this case:
de: Sie sollten mit einem ``_`` beginnen, um anzuzeigen, dass sie intern sind, und mit ``_bind_compat_`` enden, gefolgt von der PR-Nummer, in der die Änderung eingeführt wurde (``88047`` in diesem Beispiel). Diese Kompatibilitätsmethoden müssen in einer eigenen Datei implementiert werden, wie in diesem Fall ``core/math/a_star_grid_2d.compat.inc``:
tr: Bunların, dahili olduklarını belirtmek için ``_`` ile başlamalı ve ``_bind_compat_`` ve ardından değişikliği getiren PR numarası (bu örnekte ``88047``) ile bitmeleri gereklidir. Bu uyumluluk yöntemlerinin, bu durumda ``core/math/a_star_grid_2d.compat.inc`` gibi, özel bir dosyada uyarlanması gerekir:
uk: Вони мають починатися з ``_``, щоб вказати, що вони є внутрішніми, і закінчуватися ``_bind_compat_``, за яким іде PR-номер, який вніс зміну (``88047`` у цьому прикладі). Ці методи сумісності мають бути реалізовані у спеціальному файлі, наприклад ``core/math/a_star_grid_2d.compat.inc`` у цьому випадку:

source: Unless the change in compatibility is complex, the compatibility method should simply call the modified method directly, instead of duplicating that method. Make sure to match the default arguments for that method (in the example above this would be ``false``).
de: Sofern die Änderung der Kompatibilität nicht komplex ist, sollte die Kompatibilitätsmethode einfach die geänderte Methode direkt aufrufen, anstatt diese Methode zu duplizieren. Achten Sie darauf, dass die Standardargumente für diese Methode übereinstimmen (im obigen Beispiel wäre dies ``false``).
uk: Якщо зміна сумісності не є складною, метод сумісності повинен просто викликати модифікований метод безпосередньо, замість того, щоб дублювати цей метод. Переконайтеся, що аргументи за замовчуванням відповідають цьому методу (у прикладі вище це буде ``false``).

source: This file should always be placed next to the original file, and have ``.compat.inc`` at the end instead of ``.cpp`` or ``.h``. Next, this should be included in the ``.cpp`` file we're adding compatibility methods to, so ``core/math/a_star_grid_2d.cpp``:
de: Diese Datei sollte immer neben der Originaldatei stehen und am Ende ``.compat.inc`` anstelle von ``.cpp`` oder ``.h`` haben. Als nächstes sollte sie in die Datei ``.cpp`` eingefügt werden, der wir Kompatibilitätsmethoden hinzufügen, also ``core/math/a_star_grid_2d.cpp``:
tr: Bu dosya her zaman orijinal dosyanın yanına yerleştirilmeli ve sonunda ``.cpp`` veya ``.h`` yerine ``.compat.inc`` olmalıdır. Daha sonra, bu dosya uyumluluk yöntemleri eklediğimiz ``.cpp`` dosyasına dahil edilmelidir, yani ``core/math/a_star_grid_2d.cpp`` için:
uk: Цей файл завжди слід розміщувати поруч із оригінальним файлом і мати ``.compat.inc`` у кінці замість ``.cpp`` або ``.h``. Далі це слід включити у файл ``.cpp``, до якого ми додаємо методи сумісності, тому ``core/math/a_star_grid_2d.cpp``:

source: And finally, the changes reported by the API validation step should be added to the relevant validation file. Because this was done during the development of 4.3, this would be ``misc/extension_api_validation/4.2-stable.expected`` (including changes not shown in this example):
de: Und schließlich sollten die vom API-Validierungsschritt gemeldeten Änderungen der entsprechenden Validierungsdatei hinzugefügt werden. Da dies während der Entwicklung von 4.3 geschehen ist, wäre dies ``misc/extension_api_validation/4.2-stable.expected`` (einschließlich der in diesem Beispiel nicht gezeigten Änderungen):
tr: Ve son olarak, API doğrulama adımı tarafından bildirilen değişiklikler ilgili doğrulama dosyasına eklenmelidir. Bu 4.3'ün geliştirilmesi sırasında yapıldığından, bu ``misc/extension_api_validation/4.2-stable.expected`` olacaktır (bu örnekte gösterilmeyen değişiklikler dahil):
uk: І, нарешті, зміни, про які повідомляє етап перевірки API, слід додати до відповідного файлу перевірки. Оскільки це було зроблено під час розробки 4.3, це буде ``misc/extension_api_validation/4.2-stable.expected`` (включаючи зміни, не показані в цьому прикладі):

source: The instructions for how to add to that file are at the top of the file itself.
de: Die Anweisungen für das Hinzufügen zu dieser Datei befinden sich am Anfang der Datei selbst.
tr: Bu dosyaya nasıl ekleneceğine ilişkin talimatlar dosyanın içinde en üstünde yer almaktadır.
uk: Інструкції щодо додавання до цього файлу знаходяться у верхній частині самого файлу.

source: If you get a "Hash changed" error for a method, it means that the compatibility binding is missing or incorrect. Such lines shouldn't be added to the ``.expected`` file, but fixed by binding the proper compatibility method.
de: Wenn Sie einen "Hash changed"-Fehler für eine Methode erhalten, bedeutet dies, dass die Kompatibilitätsbindung fehlt oder falsch ist. Solche Zeilen sollten nicht der Datei ``.expected`` hinzugefügt werden, sondern durch Bindung der richtigen Kompatibilitätsmethode behoben werden.
tr: Bir yöntem için "Hash changed" hatası alırsanız, bu uyumluluk bağının eksik veya yanlış olduğu anlamına gelir. Bu tür satırlar ``.expected`` dosyasına eklenmemeli, ancak uygun uyumluluk yöntemi bağlanarak düzeltilmelidir.
uk: Якщо ви отримуєте помилку «Хеш змінено» для методу, це означає, що прив’язка сумісності відсутня або неправильна. Такі рядки не слід додавати до файлу ``.expected``, а виправляти шляхом прив’язки належного методу сумісності.

source: And that's it! You might run into a bit more complicated cases, like rearranging arguments, changing return types, etc., but this covers the basic on how to use this system.
de: Und das war's! Es kann sein, dass Sie auf etwas kompliziertere Fälle stoßen, wie z. B. das Umordnen von Argumenten, das Ändern von Rückgabetypen usw., aber dies deckt die grundlegenden Möglichkeiten der Verwendung dieses Systems ab.
tr: Ve işte bu kadar! Argümanların yerini yeniden düzenlemek, dönüş türlerini değiştirmek gibi biraz daha karmaşık durumlarla karşılaşabilirsiniz, ancak burada en azından bu sistemin nasıl kullanılacağına ilişkin temel bilgileri kapsamış olduk.
uk: І все! Ви можете зіткнутися з дещо складнішими випадками, як-от перевпорядкування аргументів, зміна типів повернення тощо, але тут охоплюються основи використання цієї системи.

source: For more information, see `pull request #76446 <https://github.com/godotengine/godot/pull/76446>`_.
de: Für weitere Informationen siehe `pull request #76446 <https://github.com/godotengine/godot/pull/76446>`_.
tr: Daha fazla bilgi için, `çekme isteği #76446 <https://github.com/godotengine/godot/pull/76446>`_ 'ya bakınız.
uk: Для отримання додаткової інформації перегляньте `запит на витягування #76446 <https://github.com/godotengine/godot/pull/76446>`_.

source: Translation status
de: Übersetzungsstatus
