Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_parallax.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hans, zh_tw

source: :ref:`Parallax2D<class_parallax2d>` provides a bonus effect that gives textures the illusion of repeating infinitely. :ref:`repeat_size<class_parallax2d_property_repeat_size>` tells the node to snap its position forward or back when the camera scrolls by the set value. This effect is achieved by adding a single repeat to all the child canvas items offset by the value. While the camera scrolls between the image and its repeat, it invisibly snaps back giving the appearance of a looping image.
de: :ref:`Parallax2D<class_parallax2d>` bietet einen Bonuseffekt, der Texturen die Illusion einer unendlichen Wiederholung verleiht. :ref:`repeat_size<class_parallax2d_property_repeat_size>` weist den Knoten an, seine Position nach vorne oder hinten zu verschieben, wenn die Kamera um den eingestellten Wert scrollt. Dieser Effekt wird erreicht, indem allen um den Wert versetzten untergeordneten Canvas-Elementen eine einzelne Wiederholung hinzugefügt wird. Während die Kamera zwischen dem Bild und seiner Wiederholung scrollt, springt sie unsichtbar zurück, wodurch der Eindruck eines sich wiederholenden Bildes entsteht.
es: :ref:`Parallax2D<class_parallax2d>` proporciona un efecto adicional que da a las texturas la ilusión de repetirse infinitamente. :ref:`repeat_size<class_parallax2d_property_repeat_size>` le dice al nodo que ajuste su posición hacia adelante o hacia atrás cuando la cámara se desplaza según el valor establecido. Este efecto se logra agregando una única repetición a todos los elementos del canvas(lienzo) secundario compensados por el valor. Mientras la cámara se desplaza entre la imagen y su repetición, retrocede de manera invisible dando la apariencia de una imagen en bucle.
fr: :ref:`Parallax2D<class_parallax2d>` offre un effet supplémentaire qui donne l'illusion que les textures se répètent à l'infini. La propriété :ref:`repeat_size<class_parallax2d_property_repeat_size>` indique au nœud de faire avancer ou reculer sa position lorsque la caméra se déplace de la valeur définie. Cet effet est obtenu en ajoutant une seule répétition à tous les éléments de canevas enfants, décalés de cette valeur. Pendant que la caméra se déplace entre l'image et sa répétition, elle se replace de manière invisible, donnant l'apparence d'une image en boucle.
ga: :ref:`Parallax2D <class_parallax2d>` soláthraíonn sé éifeacht bónas a thugann uigeachtaí an illusion athrá gan teorainn. :ref: `repeat_size<class_parallax2d_property_repeat_size>` insíonn sé don nód a shuíomh a léim ar aghaidh nó ar ais nuair a scrollaíonn an ceamara faoin luach socraithe. Baintear an éifeacht seo amach trí athchraoladh amháin a chur leis na míreanna chanbhás leanaí go léir arna bhfritháireamh ag an luach. Cé go scrollaíonn an ceamara idir an íomhá agus an athuair, léimeann sé siar go dofheicthe ag tabhairt cuma íomhá lúbach.
pt_br: O :ref:`Parallax2D<class_parallax2d>` oferece um efeito adicional que dá às texturas a ilusão de se repetirem infinitamente. A propriedade :ref:`repeat_size<class_parallax2d_property_repeat_size>` informa ao nó para ajustar sua posição para frente ou para trás quando a câmera se move pelo valor definido. Esse efeito é alcançado ao adicionar uma repetição única a todos os itens de canvas filhos com um deslocamento baseado nesse valor. Enquanto a câmera se move entre a imagem e sua repetição, ela é ajustada de forma invisível, criando a aparência de uma imagem em loop.
ru: :ref:`Parallax2D<class_parallax2d>` обеспечивает бонусный эффект, который придает текстурам иллюзию бесконечного повторения. :ref:`repeat_size<class_parallax2d_property_repeat_size>` сообщает узлу о необходимости привязывать свое положение вперед или назад, когда камера прокручивается на заданное значение. Этот эффект достигается путем добавления одного повтора ко всем дочерним элементам холста, смещенным на значение. Пока камера прокручивается между изображением и его повтором, она невидимо привязывается назад, создавая видимость зацикленного изображения.
ta: . . மதிப்பால் ஈடுசெய்யப்பட்ட அனைத்து குழந்தை கேன்வாச் பொருட்களுக்கும் ஒற்றை மீண்டும் சேர்ப்பதன் மூலம் இந்த விளைவு அடையப்படுகிறது. படத்திற்கும் அதன் மறுபடியும் இடையே கேமரா உருட்டும்போது, அது கண்ணுக்குத் தெரியாமல் ஒரு சுழற்சியின் படத்தின் தோற்றத்தைக் கொடுக்கும்.
tr: :ref:`Parallax2D <class_parallax2d>`, dokulara sonsuz tekrarlama yanılsaması veren bir bonus efekti sağlar. :ref:`repeat_size <class_parallax2d_property_repeat_size>`, kamera ayarlanan değer kadar kaydırıldığında düğüme konumunu öne veya arkaya yaslamasını söyler. Bu efekt, değer kadar kaydırılan tüm kanvas alt ögelerine tek bir tekrar eklenerek elde edilir. Kamera görüntü ve tekrarı arasında ilerlerken, görünmez bir şekilde geri çekilerek döngüsel bir görüntü görünümü verir.
uk: :ref:`Parallax2D<class_parallax2d>` забезпечує бонусний ефект, який створює ілюзію нескінченного повторення текстур. :ref:`repeat_size<class_parallax2d_property_repeat_size>` повідомляє вузлу фіксувати свою позицію вперед або назад, коли камера прокручується на встановлене значення. Цей ефект досягається шляхом додавання одного повтору до всіх дочірніх елементів полотна, зміщених за значенням. Коли камера прокручується між зображенням і його повторенням, вона непомітно повертається назад, створюючи вигляд циклічного зображення.
zh_hans: :ref:`Parallax2D<class_parallax2d>` 还可以顺便让纹理产生无限重复的假象。相机移动时，\ :ref:`repeat_size<class_parallax2d_property_repeat_size>` 可以让节点的位置根据这个值向前或向后吸附。这个效果的原理是让所有子级画布项重复一次并使用这个值进行偏移。而相机在原本的图像和重复的图像之间滚动，悄悄跳回原本的位置就会造成图像循环的效果。
zh_tw: :ref:`Parallax2D<class_parallax2d>` 還能額外讓紋理看起來像是無限重複。:ref:`repeat_size<class_parallax2d_property_repeat_size>` 屬性會指定當攝影機捲動超過這個數值時自動將位置往前或往後跳。這個效果是透過為所有子畫布項目多加一次重複、並做位移來實現的。當攝影機在原始圖像與重複圖像之間捲動時，畫面會在看不見的情況下跳回頭，營造出圖像無限循環的錯覺。

source: Being a delicate effect, it's easy for unfamiliar users to make mistakes with their setup. Let's go over the "how" and "why" of a few common problems users encounter.
de: Da es sich um einen heiklen Effekt handelt, können unerfahrene Benutzer bei der Einrichtung leicht Fehler machen. Lassen Sie uns das „Wie“ und „Warum“ einiger häufiger Probleme durchgehen, auf die Benutzer stoßen.
es: Al ser un efecto delicado, es fácil que usuarios que no estén familiarizados con el mismo cometan errores con su configuración. Repasemos el "cómo" y el "por qué" de algunos problemas comunes que encuentran los usuarios.
fr: Étant un effet délicat, il est facile pour les utilisateurs non familiers de faire des erreurs avec leur configuration. Allons sur le "comment" et le "pourquoi" de quelques problèmes communs que les utilisateurs rencontrent.
ga: Mar éifeacht íogair é, tá sé furasta d'úsáideoirí neamhchoitianta botúin a dhéanamh lena socrú. Téimid thar an “conas” agus “cén fáth” de chúpla fadhb choitianta a bhíonn ag úsáideoirí.
pt_br: Por ser um efeito delicado, é fácil para usuários não familiarizados cometerem erros de configuração. Vamos analisar o "como" e o "porquê" de alguns problemas comuns que os usuários encontram.
ru: Поскольку это деликатный эффект, незнакомые пользователи могут легко ошибиться в настройке. Давайте рассмотрим «как» и «почему» нескольких распространенных проблем, с которыми сталкиваются пользователи.
ta: ஒரு நுட்பமான விளைவு என்பதால், அறிமுகமில்லாத பயனர்கள் தங்கள் அமைப்பில் தவறு செய்வது எளிது. பயனர்கள் சந்திக்கும் சில பொதுவான சிக்கல்களில் "எப்படி" மற்றும் "ஏன்" என்று செல்லலாம்.
tr: Hassas bir etki olduğundan, alışık olmayan kullanıcıların kurulumlarında hata yapmaları kolaydır. Kullanıcıların karşılaştığı birkaç yaygın sorunun "nasıl" ve "neden" olduğunu gözden geçirelim.
uk: Будучи делікатним ефектом, незнайомим користувачам легко помилитися в налаштуваннях. Давайте розглянемо кілька поширених проблем, з якими стикаються користувачі, «як» і «чому».
zh_hans: 这是一个很巧妙的效果，不熟悉的用户很容易在设置时出错。那我们就来看几个常见问题的“原理”和“解法”。
zh_tw: 這個效果比較細緻，新手常常容易設錯。我們來看看常見問題的「成因」與「解法」。

source: Poor sizing
de: Schlechte Dimensionierung
es: Tamaño insuficiente
fr: Mauvais dimensionnement
ga: Droch-mhéid
ru: Некорректное масштабирование
ta: மோசமான அளவு
tr: Kötü boyutlandırma
uk: Поганий розмір
zh_hans: 大小问题
zh_tw: 尺寸不正確

source: The infinite repeat effect is easiest to work with when you have an image designed to repeat seamlessly and is the same size or larger than your viewport **before** setting the :ref:`repeat_size<class_parallax2d_property_repeat_size>`. If you aren't able to obtain assets that are designed for this task, there are some other things you can do to better prepare your image in regards to size.
de: Der Effekt der unendlichen Wiederholung lässt sich am einfachsten bearbeiten, wenn Sie ein Bild haben, das für eine nahtlose Wiederholung konzipiert ist und die gleiche Größe oder größer als Ihr Ansichtsfenster hat, **bevor** Sie :ref:`repeat_size<class_parallax2d_property_repeat_size>` festlegen. Wenn Sie keine Assets erhalten können, die für diese Aufgabe konzipiert sind, gibt es einige andere Dinge, die Sie tun können, um Ihr Bild hinsichtlich der Größe besser vorzubereiten.
es: Es más fácil trabajar con el efecto de repetición infinita cuando tienes una imagen diseñada para repetirse sin problemas y es del mismo tamaño o más grande que tu ventana gráfica **antes** de configurar el :ref:`repeat_size<class_parallax2d_property_repeat_size>`. Si no puedes obtener recursos diseñados para esta tarea, hay otras cosas que puede hacer para preparar mejor su imagen en cuestión de tamaño.
fr: Il est plus facile de travailler avec l'effet de répétition infinie quand vous avez une image conçue pour se répéter sans couture et qui est la même taille ou plus grande que votre fenêtre d'affichage **avant** le réglage de :ref:`repeat_size <class_parallax2d_property_repeat_size>`. Si vous n'êtes pas en mesure d'obtenir des ressources conçues pour cette tâche, il y a d'autres choses que vous pouvez faire pour mieux préparer votre image en ce qui concerne la taille.
ga: Is fusa oibriú leis an iarmhairt athdhéanta gan teorainn nuair a bhíonn íomhá agat atá deartha chun athdhéanamh gan uaim agus atá ar an méid céanna nó níos mó ná do radharc **roimh** an :ref:`repeat_size<class_parallax2d_property_repeat_size>` a shocrú. Mura bhfuil tú in ann sócmhainní a fháil atá deartha don tasc seo, tá roinnt rudaí eile is féidir leat a dhéanamh chun d’íomhá a ullmhú níos fearr ó thaobh méide de.
pt_br: O efeito de repetição infinita é mais fácil de trabalhar quando você tem uma imagem projetada para se repetir perfeitamente e que seja do mesmo tamanho ou maior que o seu viewport **antes** de definir a propriedade :ref:`repeat_size<class_parallax2d_property_repeat_size>`. Se não for possível obter assets projetados para essa finalidade, há algumas outras coisas que você pode fazer para preparar melhor sua imagem em relação ao tamanho.
ru: С эффектом бесконечного повторения проще всего работать, когда у вас есть изображение, разработанное для бесшовного повторения и имеющее тот же размер или больше, чем область просмотра **до** установки :ref:`repeat_size<class_parallax2d_property_repeat_size>`. Если вы не можете получить ресурсы, разработанные для этой задачи, есть некоторые другие вещи, которые вы можете сделать, чтобы лучше подготовить свое изображение в отношении размера.
ta: நீங்கள் தடையின்றி மீண்டும் செய்ய வடிவமைக்கப்பட்ட ஒரு படத்தைக் கொண்டிருக்கும்போது, உங்கள் காட்சியை விட அதே அளவு அல்லது பெரியது என்று எல்லையற்ற மறுபயன்பாடு எளிதானது ** முன் ** அமைப்பதற்கு முன்: Rep: `` `` `` `` `` `` `` `` `` `` `` `` `` `` ``ான் மீண்டும்ான்_பாராலக்ச் 2 டி_பிராபர்ட்டி_ரெபீட்_சிச்>`. இந்த பணிக்காக வடிவமைக்கப்பட்ட சொத்துக்களை நீங்கள் பெற முடியாவிட்டால், அளவைப் பொறுத்தவரை உங்கள் படத்தை சிறப்பாக தயாரிக்க நீங்கள் செய்யக்கூடிய வேறு சில விசயங்கள் உள்ளன.
tr: Sonsuz tekrar efektiyle çalışmak için en kolay yol, :ref:`repeat_size <class_parallax2d_property_repeat_size>` ayarını yapmadan **önce** çerçeve alanınızla aynı boyutta veya daha büyük olan ve sorunsuz bir şekilde tekrarlanacak şekilde tasarlanmış bir görüntüye sahip olmanızdır. Bu görev için tasarlanmış varlıklar elde edemiyorsanız, görüntünüzü boyut açısından daha iyi hazırlamak için yapabileceğiniz başka şeyler de vardır.
uk: З ефектом нескінченного повторення найпростіше працювати, коли у вас є зображення, призначене для безперебійного повторення, і воно має такий самий розмір або більше, ніж ваше вікно перегляду **до** встановлення :ref:`repeat_size<class_parallax2d_property_repeat_size>`. Якщо ви не можете отримати ресурси, призначені для цього завдання, є деякі інші речі, які ви можете зробити, щоб краще підготувати своє зображення щодо розміру.
zh_hans: 为了方便实现无限重复效果，图像本身最好就需要能够无缝重复，并且需要图像的大小在设置 :ref:`repeat_size<class_parallax2d_property_repeat_size>` **之前**\ 至少要和视口大小一致。如果无法获取合适的资产素材，也有一些方法可以事先处理一下图像的大小。
zh_tw: 要讓無限重複效果好用，最好是圖像本身就是無縫可重複的，並且「在設定 :ref:`repeat_size<class_parallax2d_property_repeat_size>` 前」圖像尺寸要跟視窗一樣大或更大。如果你的素材不是專門做來無縫重複，還有一些其他方式可以調整圖像尺寸。

source: Here is an example of a texture that is too small for its viewport:
de: hier ist ein Beispiel für eine Textur, die für ihr Ansichtsfenster zu klein ist:
es: Aquí hay un ejemplo de textura que es muy pequeña para su ventana:
fr: Voici un exemple de texture trop petite pour sa fenêtre d'affichage :
ga: Seo sampla d'uigeacht atá ró-bheag dá radharc:
ru: Вот пример текстуры, которая слишком мала для своего окна просмотра:
ta: அதன் காட்சிக்கு மிகவும் சிறியதாக இருக்கும் ஒரு அமைப்பின் எடுத்துக்காட்டு இங்கே:
tr: İşte çerçeve için çok küçük olan bir doku örneği:
uk: Ось приклад текстури, яка занадто мала для вікна перегляду:
zh_hans: 下例是一个在视口中显得太小的纹理:
zh_tw: 下面是一個紋理太小、不足以覆蓋視窗的例子：

source: We can see that the viewport size is 500x300 but the texture is 288x208. If we set the :ref:`repeat_size<class_parallax2d_property_repeat_size>` to the size of our image, the infinite repeat effect doesn't scroll properly because the original texture doesn't cover the viewport. If we set the :ref:`repeat_size<class_parallax2d_property_repeat_size>` to the size of the viewport, we have a large gap. What can we do?
de: Wir können sehen, dass die Größe des Ansichtsfensters 500 x 300 beträgt, die Textur jedoch 288 x 208. Wenn wir :ref:`repeat_size<class_parallax2d_property_repeat_size>` auf die Größe unseres Bildes einstellen, wird der unendliche Wiederholungseffekt nicht richtig gescrollt, da die Originaltextur das Ansichtsfenster nicht abdeckt. Wenn wir :ref:`repeat_size<class_parallax2d_property_repeat_size>` auf die Größe des Ansichtsfensters einstellen, haben wir eine große Lücke. Was können wir tun?
es: Podemos ver que el tamaño de la ventana gráfica es 500x300 pero la textura es 288x208. Si configuramos :ref:`repeat_size<class_parallax2d_property_repeat_size>` al tamaño de nuestra imagen, el efecto de repetición infinita no se desplaza correctamente porque la textura original no cubre la ventana gráfica. Si configuramos :ref:`repeat_size<class_parallax2d_property_repeat_size>` según tamaño de la ventana gráfica, tenemos un hueco grande. ¿Qué podemos hacer?
fr: Nous pouvons voir que la taille de la vue est de 500x300, mais la texture est de 288x208. Si nous définissons la propriété :ref:`repeat_size<class_parallax2d_property_repeat_size>` à la taille de notre image, l'effet de répétition infinie ne se déroule pas correctement car la texture originale ne couvre pas la vue. Si nous définissons la propriété :ref:`repeat_size<class_parallax2d_property_repeat_size>` à la taille de la vue, nous avons un grand espace. Comment pourrions-nous faire ?
ga: Is féidir linn a fheiceáil go bhfuil an méid viewport 500x300 ach tá an uigeacht 288x208. Má shocraímid an :ref:`repeat_size<class_parallax2d_property_repeat_size>` go dtí méid ár n-íomhá, ní scrollaíonn an iarmhairt athdhéanta gan teorainn i gceart toisc nach gclúdaíonn an uigeacht bhunaidh an radharc. Má shocraímid an :ref:`repeat_size<class_parallax2d_property_repeat_size>` go dtí méid an amhairc, tá bearna mhór againn. Cad is féidir linn a dhéanamh?
pt_br: Podemos ver que o tamanho do viewport é 500x300, mas a textura tem 288x208. Se definirmos a propriedade :ref:`repeat_size<class_parallax2d_property_repeat_size>` com a dimensão da nossa imagem, o efeito de repetição infinita não funciona corretamente porque a textura original não cobre a janela de exibição. Se definirmos a :ref:`repeat_size<class_parallax2d_property_repeat_size>` com o tamanho da janela de exibição, teremos um grande espaço em branco. O que podemos fazer?
ru: Мы видим, что размер области просмотра составляет 500x300, но текстура — 288x208. Если мы установим :ref:`repeat_size<class_parallax2d_property_repeat_size>` на размер нашего изображения, эффект бесконечного повторения не будет прокручиваться должным образом, поскольку исходная текстура не покрывает область просмотра. Если мы установим :ref:`repeat_size<class_parallax2d_property_repeat_size>` на размер области просмотра, у нас будет большой зазор. Что мы можем сделать?
ta: வியூபோர்ட் அளவு 500x300 என்பதை நாம் காணலாம், ஆனால் அமைப்பு 288x208 ஆகும். நாம் அமைத்தால்: ref: `` reperate_size <class_parallax2d_property_repeat_size> `எங்கள் படத்தின் அளவிற்கு, எல்லையற்ற மறுபயன்பாட்டு விளைவு சரியாக உருட்டாது, ஏனெனில் அசல் அமைப்பு காட்சியமைப்பை மறைக்காது. நாம் அமைத்தால்: ref: `` reperate_size <class_parallax2d_property_repeat_size> `Viewport இன் அளவிற்கு, எங்களுக்கு ஒரு பெரிய இடைவெளி உள்ளது. நாம் என்ன செய்ய முடியும்?
tr: Çerçeve alanı boyutunun 500x300 olduğunu ancak dokunun 288x208 olduğunu görebiliriz. Eğer :ref:`repeat_size <class_parallax2d_property_repeat_size>`ı resmimizin boyutuna ayarlarsak, sonsuz tekrar efekti düzgün bir şekilde kaymaz çünkü orijinal doku çerçeveyi kaplamaz. Eğer :ref:`repeat_size <class_parallax2d_property_repeat_size>` değerini çerçevenin boyutuna ayarlarsak, büyük bir boşluk oluşur. Ne yapabiliriz?
uk: Ми бачимо, що розмір вікна перегляду становить 500x300, а текстура — 288x208. Якщо ми встановимо :ref:`repeat_size<class_parallax2d_property_repeat_size>` до розміру нашого зображення, ефект нескінченного повторення не прокручується належним чином, оскільки оригінальна текстура не покриває вікно перегляду. Якщо ми встановимо :ref:`repeat_size<class_parallax2d_property_repeat_size>` на розмір вікна перегляду, ми матимемо великий розрив. Що ми можемо зробити?
zh_hans: 我们可以看到视口的尺寸是 500x300 而纹理的尺寸是 288x208。如果我们把 :ref:`repeat_size<class_parallax2d_property_repeat_size>` 设置为图像的尺寸，无限重复效果在滚动时就会出问题，因为原始纹理没有覆盖整个视口。如果我们把 :ref:`repeat_size<class_parallax2d_property_repeat_size>` 设置为视口的尺寸，那么就会有一个很大的间隙。那该怎么办呢？
zh_tw: 可以看到視埠大小是 500x300，但圖像只有 288x208。如果我們把 :ref:`repeat_size<class_parallax2d_property_repeat_size>` 設成圖像大小，無限重複效果會失敗，因為原始圖像覆蓋不了整個視窗。如果 :ref:`repeat_size<class_parallax2d_property_repeat_size>` 設成視窗大小，中間又會有大空隙。該怎麼辦？

source: Make the viewport smaller
de: Verkleinern Sie das Ansichtsfenster
es: Hacer la ventana gráfica más pequeña
fr: Rendre la fenêtre d'affichage plus petite
ga: Déan an dearcadh níos lú
pt_br: Diminua a janela de exibição
ru: Уменьшить область просмотра
ta: வியூபோர்ட்டை சிறியதாக ஆக்குங்கள்
tr: Çerveyi küçültün
uk: Зменшіть вікно перегляду
zh_hans: 把视口调小
zh_tw: 把視窗縮小

source: The simplest answer is to make the viewport the same size or smaller than your textures. In **Project Settings > Display > Window**, change the :ref:`Viewport Width<class_ProjectSettings_property_display/window/size/viewport_width>` and :ref:`Viewport Height<class_ProjectSettings_property_display/window/size/viewport_height>` settings to match your background.
fr: La réponse la plus simple est de faire en sorte que la taille de la vue soit égale ou inférieure à celle de vos textures. Cliquez sur **Paramètres du projet > Affichage > Fenêtre** et modifiez la :ref:`hauteur <class_ProjectSettings_property_display/window/size/viewport_width>` et la :ref:`largeur <class_ProjectSettings_property_display/window/size/viewport_height>` de la vue pour qu'elles correspondent à votre arrière-plan.
pt_br: A resposta mais simples é fazer com que a janela de exibição tenha o mesmo tamanho, ou seja, menor que suas texturas. Em **Configurações do Projeto > Exibição > Janela**, altere as configurações :ref:`Largura da Viewport<class_ProjectSettings_property_display/window/size/viewport_width>` e :ref:`Altura da Viewport<class_ProjectSettings_property_display/window/size/viewport_height>` para corresponder ao seu plano de fundo.
ru: Самый простой ответ — сделать область просмотра такого же размера или меньше, чем ваши текстуры. В **Настройки проекта > Дисплей > Окно** измените настройки :ref:`Ширина области просмотра<class_ProjectSettings_property_display/window/size/viewport_width>` и :ref:`Высота области просмотра<class_ProjectSettings_property_display/window/size/viewport_height>` в соответствии с вашим фоном.
uk: Найпростіша відповідь — зробити вікно перегляду такого ж розміру або менше, ніж текстури. У **Project Settings > Display > Window** змініть налаштування :ref:`Viewport Width<class_ProjectSettings_property_display/window/size/viewport_width>` і :ref:`Viewport Height<class_ProjectSettings_property_display/window/size/viewport_height>` відповідно до вашого фону.
zh_hans: 最简单的答案是将视口设置为与纹理大小相同或更小。在 **项目设置 > 显示 > 窗口** 中，更改 :ref:`视口宽度<class_ProjectSettings_property_display/window/size/viewport_width>` 和 :ref:`视口高度<class_ProjectSettings_property_display/window/size/viewport_height>` 设置，使其与背景匹配。
zh_tw: 最簡單的解法，就是把視窗調成跟你的圖像一樣大或更小。在 **專案設定 > 顯示 > 視窗** 裡，把 :ref:`Viewport Width<class_ProjectSettings_property_display/window/size/viewport_width>` 和 :ref:`Viewport Height<class_ProjectSettings_property_display/window/size/viewport_height>` 設成跟背景圖一樣。

source: Scale the Parallax2D
de: Skalieren Sie Parallax2D
es: Nivela el Parallax2D
fr: Mise à l'échelle du Parallax2D
ga: Scála an Parallax2D
pt_br: Alterar a escala do Parallax2D
ru: Масштаб Parallax2D
ta: இடமாறு 2d ஐ அளவிடவும்
tr: Parallax2D'yi ölçeklendirin
uk: Масштаб Parallax2D
zh_hans: 缩放 Parallax2D
zh_tw: 縮放 Parallax2D 本身
