Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_parallax.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hans, zh_tw

source: 2D Parallax
de: 2D-Parallaxe
es: Parallax 2D
fr: Parallaxe 2D
ga: Parallax 2D
pt_br: Paralaxe 2D (Parallax)
ru: 2D Параллакс
ta: 2 டி இடமாறு
tr: 2B Paralaks
uk: 2D паралакс
zh_hans: 2D 视差
zh_tw: 2D 視差滾動

source: Introduction
de: Einführung
es: Introducción
ga: Réamhrá
it: Introduzione
pt_br: Introdução
ru: Введение
ta: அறிமுகம்
tr: Giriş
uk: Вступ
zh_hans: 前言
zh_tw: 前言

source: Parallax is an effect used to simulate depth by having textures move at different speeds relative to the camera. Godot provides the :ref:`Parallax2D<class_parallax2d>` node to achieve this effect. It can still be easy to get tripped up though, so this page provides in-depth descriptions of some properties and how to fix some common mistakes.
de: Parallaxe ist ein Effekt, der verwendet wird, um Tiefe zu simulieren, indem sich Texturen mit unterschiedlicher Geschwindigkeit relativ zur Kamera bewegen. Godot stellt den Knoten :ref:`Parallax2D<class_parallax2d>` bereit, um diesen Effekt zu erzielen. Man kann jedoch immer noch leicht ins Stolpern geraten, daher bietet diese Seite ausführliche Beschreibungen einiger Eigenschaften und wie man einige häufige Fehler behebt.
es: Parallax es un efecto que se utiliza para simular profundidad haciendo que las texturas se muevan a distintas velocidades en relación con la cámara. Godot proporciona el nodo :ref:`Parallax2D<class_parallax2d>` para lograr este efecto. Sin embargo, puede ser fácil equivocarse, por lo que esta página proporciona descripciones detalladas de algunas propiedades y cómo solucionar algunos errores comunes.
fr: Le parallaxe est un effet utilisé pour simuler la profondeur en faisant déplacer les textures à différentes vitesses par rapport à la caméra. Godot fournit le nœud :ref:`Parallax2D<class_parallax2d>` pour obtenir cet effet. Il peut encore être facile de se tromper, donc cette page fournit des descriptions détaillées de certaines propriétés et comment corriger certaines erreurs courantes.
ga: Is éifeacht é Parallax a úsáidtear chun doimhneacht a insamhail trí uigeachtaí a bhogadh ar luasanna éagsúla i gcoibhneas leis an gceamara. Soláthraíonn Godot an nód :ref:`Parallax2D<class_parallax2d>` chun an éifeacht seo a bhaint amach. Is féidir go mbeadh sé fós éasca a bheith tuislithe, mar sin cuireann an leathanach seo cur síos domhain ar roinnt maoine agus conas roinnt botúin choitianta a réiteach.
pt_br: Parallax é um efeito usado para simular profundidade fazendo com que texturas se movam em velocidades diferentes em relação à câmera. O Godot oferece o nó :ref:`Parallax2D<class_parallax2d>` para alcançar esse efeito. Ainda assim, é fácil cometer erros, então esta página fornece descrições detalhadas de algumas propriedades e como corrigir erros comuns.
ru: Параллакс это эффект который используется для симуляции глубины текстурами, двигающимися на различных скоростях относительно камеры. Godot предоставляет узел :ref:`Parallax2D<class_parallax2d>` для достижения этого эффекта. Это все же может быть непросто, так что эта страница предоставляет описания некоторых свойств и описания исправления распространенных ошибок.
ta: இடமாறு என்பது கேமராவுடன் தொடர்புடைய வெவ்வேறு வேகத்தில் கட்டமைப்புகளை நகர்த்துவதன் மூலம் ஆழத்தை உருவகப்படுத்தப் பயன்படுகிறது. கோடோட் வழங்குகிறது: ref: `fallax2d <class_parallax2d>` இந்த விளைவை அடைய முனை. இருப்பினும் இது இன்னும் எளிதானது, எனவே இந்த பக்கம் சில பண்புகளின் ஆழமான விளக்கங்களையும் சில பொதுவான தவறுகளை எவ்வாறு சரிசெய்வது என்பதையும் வழங்குகிறது.
tr: Paralaks (ıraklık açısı), dokuların kameraya göre farklı hızlarda hareket etmesini sağlayarak derinlik benzetimi elde etmek için kullanılan bir efekttir. Godot bu efekti elde etmek için :ref:`Parallax2D<class_parallax2d>` düğümünü sağlar. Yine de takılıp kalmak kolay olabilir, bu nedenle bu sayfa bazı özelliklerin derinlemesine açıklamalarını ve bazı yaygın hataların nasıl düzeltileceğini sağlar.
uk: Паралакс — це ефект, який використовується для імітації глибини завдяки тому, що текстури рухаються з різною швидкістю відносно камери. Для досягнення цього ефекту Godot надає вузол :ref:`Parallax2D<class_parallax2d>`. Проте все ще може бути легко спіткнутися, тому ця сторінка містить докладний опис деяких властивостей і способи виправлення деяких поширених помилок.
zh_hans: 视差是一种视觉效果，通过让图像纹理相对于相机以不同速度移动来模拟纵深。Godot 提供了 :ref:`Parallax2D<class_parallax2d>` 节点来实现这种效果。这方面的坑还是不少的，因此本页面会对部分属性进行深入描述，并会介绍纠正一些常见错误的方法。
zh_tw: 視差（Parallax）是一種常用來模擬景深的效果，讓不同圖層（紋理）相對於攝影機以不同速度移動。Godot 提供 :ref:`Parallax2D<class_parallax2d>` 節點來實現這個效果。不過在使用上還是很容易出錯，所以本頁會詳細說明相關屬性，以及常見問題與修正方法。

source: This page covers how to use :ref:`Parallax2D<class_parallax2d>`, which is recommended to use over the :ref:`ParallaxLayer<class_parallaxlayer>` and :ref:`ParallaxBackground<class_parallaxbackground>` nodes.
fr: Cette page couvre l'utilisation de :ref:`Parallax2D <class_parallax2d>`, qui est recommandé d'utiliser, plutôt que les nœuds :ref:`ParallaxLayer <class_parallaxlayer>` et :ref:`ParallaxBackground <class_parallaxbackground>`.
pt_br: Esta página aborda como usar o :ref:`Parallax2D<class_parallax2d>`, que é recomendado em vez dos nós :ref:`ParallaxLayer<class_parallaxlayer>` e :ref:`ParallaxBackground<class_parallaxbackground>`.
ru: На этой странице описано, как использовать :ref:`Parallax2D<class_parallax2d>`, который рекомендуется использовать для узлов :ref:`ParallaxLayer<class_parallaxlayer>` и :ref:`ParallaxBackground<class_parallaxbackground>`.
uk: На цій сторінці описано, як використовувати :ref:`Parallax2D<class_parallax2d>`, який рекомендується використовувати над вузлами :ref:`ParallaxLayer<class_parallaxlayer>` і :ref:`ParallaxBackground<class_parallaxbackground>`.
zh_hans: 本页面介绍如何使用 :ref:`Parallax2D<class_parallax2d>` 节点。建议使用它来替代 :ref:`ParallaxLayer<class_parallaxlayer>` 和 :ref:`ParallaxBackground<class_parallaxbackground>` 节点。
zh_tw: 本頁介紹如何使用 :ref:`Parallax2D<class_parallax2d>`，建議優先使用它來取代過去的 :ref:`ParallaxLayer<class_parallaxlayer>` 和 :ref:`ParallaxBackground<class_parallaxbackground>` 節點。

source: Getting started
de: Erste Schritte
es: Empezar
fr: Pour commencer
ga: Ag tosú
it: Per iniziare
pt_br: Primeiros passos
ru: Начало работы
ta: தொடங்குதல்
tr: Başlarken
uk: Перші кроки
zh_hans: 入门
zh_tw: 入門

source: The parallax node supports adding nodes that render things as children, so you can use one or many nodes to make up each layer. To begin, place each node or nodes you want to have scroll independently as a child of their own parallax node. Make sure that the top left of the textures used are at the ``(0, 0)`` crossing, like in the image below. See the section on :ref:`positioning <doc_2d_parallax_positioning>` for why this is important.
es: El nodo de paralaje permite añadir nodos que renderizan elementos como hijos, lo que permite usar uno o varios nodos para conformar cada capa. Para empezar, coloca cada nodo o nodos que quieras que se desplacen de forma independiente como hijos de su propio nodo de paralaje. Asegúrate de que la esquina superior izquierda de las texturas utilizadas esté en el cruce ``(0, 0)``, como se muestra en la imagen a continuación. Consulta la sección sobre :ref:`posicionamiento <doc_2d_parallax_positioning>` para saber por qué esto es importante.
pt_br: O nó de parallax suporta a adição de nós que renderizam elementos como filhos, então você pode usar um ou vários nós para compor cada camada. Para começar, coloque cada nó ou grupo de nós que você deseja que rolem de forma independente como filho de seu próprio nó de parallax. Certifique-se de que o canto superior esquerdo das texturas usadas esteja no cruzamento ``(0, 0)``, como mostrado na imagem abaixo. Veja a seção sobre :ref:`posicionamento <doc_2d_parallax_positioning>` para entender por que isso é importante.
ru: Узел параллакса поддерживает добавление узлов, которые визуализируют объекты как дочерние элементы, поэтому вы можете использовать один или несколько узлов для создания каждого слоя. Для начала разместите каждый узел или узлы, которые вы хотите прокручивать, независимо как дочерний элемент их собственного узла параллакса. Убедитесь, что верхний левый угол используемых текстур находится на пересечении ``(0, 0)``, как на изображении ниже. Смотрите раздел о :ref:`positioning <doc_2d_parallax_positioning>`, чтобы узнать, почему это важно.
uk: Вузол паралакса підтримує додавання вузлів, які відображають речі як дочірні, тому ви можете використовувати один або багато вузлів для створення кожного шару. Для початку розмістіть кожен вузол або вузли, які ви хочете прокручувати незалежно, як дочірні елементи їх власного вузла паралакса. Переконайтеся, що верхня ліва частина використовуваних текстур знаходиться на перетині ``(0, 0)``, як на зображенні нижче. Перегляньте розділ про :ref:`positioning <doc_2d_parallax_positioning>`, щоб дізнатися, чому це важливо.
zh_hans: 视差节点支持添加将对象渲染为子节点的节点，因此你可以使用一个或多个节点来组成每个图层。首先，将每个你想要独立滚动的节点（或多个节点）放置为它们各自视差节点的子节点。确保使用的纹理的左上角位于 ``(0, 0)`` 交叉点，如下图所示。请参阅 :ref:`定位 <doc_2d_parallax_positioning>` 部分了解这一节点为何重要。
zh_tw: Parallax 節點可以加上算繪用的子節點，因此每一層可以用一個或多個節點組成。首先，將你希望能獨立滾動的節點都放到各自的 Parallax 節點下當子節點。請確保每個用到的紋理左上角都對齊 ``(0, 0)``，如下圖所示。為什麼這很重要，參考 :ref:`定位 <doc_2d_parallax_positioning>` 一節。

source: The scene above uses one prepared texture for the higher clouds in a :ref:`Sprite2D <class_sprite2d>`, but you could just as easily use multiple nodes spaced out to compose the layer.
es: La escena de arriba utiliza una textura preparada para las nubes más altas en un :ref:`Sprite2D <class_sprite2d>`, pero fácilmente podrías utilizar múltiples nodos espaciados para componer la capa.
pt_br: A cena acima usa uma textura preparada para as nuvens mais altas em um :ref:`Sprite2D <class_sprite2d>`, mas você pode facilmente usar vários nós espaçados para compor a camada.
ru: В сцене выше используется одна подготовленная текстура для верхних облаков в :ref:`Sprite2D <class_sprite2d>`, но вы можете с таким же успехом использовать несколько разнесенных узлов для составления слоя.
uk: У наведеній вище сцені використовується одна підготовлена текстура для вищих хмар у :ref:`Sprite2D <class_sprite2d>`, але ви можете так само легко використовувати кілька вузлів, розташованих на відстані, щоб скласти шар.
zh_hans: 上面的场景在 :ref:`Sprite2D <class_sprite2d>` 中使用了一张准备好的纹理来表现较高的云层，但你也可以轻松地使用多个间隔开的节点来组成该层。
zh_tw: 上圖的場景是用一張事先準備好的高雲紋理加在 :ref:`Sprite2D <class_sprite2d>` 上，但你也可以用多個節點分別排開來組成這一層。

source: Scroll scale
de: Scroll-Skala
es: Escala de desplazamiento
ga: Scála scrollaigh
it: Scala di scorrimento
ru: Шкала прокрутки
ta: உருள் அளவு
tr: Kaydırma ölçeği
uk: Прокрутка масштабу
zh_hans: 滚动缩放
zh_tw: 捲動縮放

source: The backbone of the parallax effect is the :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` property. It works as a scroll-speed multiplier, allowing layers to move at a different speed than the camera for each axis set. A value of 1 makes the parallax node scroll at the same speed as the camera. If you want your image to look further away when scrolling, use a value lower than 1, with 0 bringing it to a complete stop. If you want something to appear closer to the camera, use a value higher than 1, making it scroll faster.
de: Das Rückgrat des Parallaxeffekts ist die Eigenschaft :ref:`scroll_scale <class_parallax2d_property_scroll_scale>`. Sie fungiert als Scrollgeschwindigkeitsmultiplikator und ermöglicht es Ebenen, sich für jeden Achsensatz mit einer anderen Geschwindigkeit als die Kamera zu bewegen. Ein Wert von 1 lässt den Parallaxknoten mit der gleichen Geschwindigkeit wie die Kamera scrollen. Wenn Sie möchten, dass Ihr Bild beim Scrollen weiter weg erscheint, verwenden Sie einen Wert unter 1, bei 0 kommt es vollständig zum Stillstand. Wenn Sie möchten, dass etwas näher an der Kamera erscheint, verwenden Sie einen Wert über 1, wodurch es schneller scrollt.
es: La columna vertebral del efecto de paralaje es la propiedad :ref:`scroll_scale <class_parallax2d_property_scroll_scale>`. Funciona como un multiplicador de velocidad de desplazamiento, lo que permite que las capas se muevan a una velocidad diferente a la de la cámara para cada eje establecido. Un valor de 1 hace que el nodo de paralaje se desplace a la misma velocidad que la cámara. Si deseas que su imagen se vea más lejana al desplazarse, use un valor menor que 1, y 0 la detendrá por completo. Si desea que algo aparezca más cerca de la cámara, use un valor mayor que 1, lo que hará que se desplace más rápido.
fr: L'élément charnière de l'effet de parallaxe est la propriété :ref:`scroll_scale <class_parallax2d_property_scroll_scale>`. Elle fonctionne comme un multiplicateur de vitesse de défilement, permettant aux couches de se déplacer à une vitesse différente de celle de la caméra pour chaque axe défini. Une valeur de 1 fait défiler le nœud de parallaxe à la même vitesse que la caméra. Si vous voulez que votre image semble plus éloignée lors du défilement, utilisez une valeur inférieure à 1, avec 0 l'arrêtant complètement. Si vous voulez que quelque chose semble plus proche de la caméra, utilisez une valeur supérieure à 1, ce qui le fera défiler plus rapidement.
ga: Is é cnámh droma na héifeachta parallax ná an t-airí :ref:`scroll_scale <class_parallax2d_property_scroll_scale>`. Oibríonn sé mar iolraitheoir luas scrollbharra, rud a ligeann do na sraitheanna bogadh ar luas difriúil ná an ceamara do gach tacar ais. Fágann luach 1 go scrollaíonn an nód parallax ar an luas céanna leis an gceamara. Más mian leat go mbreathnódh d’íomhá níos faide ar shiúl agus tú ag scrollú, bain úsáid as luach níos ísle ná 1, agus 0 ag cur stop iomlán leis. Más mian leat go mbeadh rud éigin níos gaire don cheamara, bain úsáid as luach níos airde ná 1, rud a fhágann go scrollaíonn sé níos tapúla.
pt_br: A base do efeito de parallax é a propriedade :ref:`scroll_scale <class_parallax2d_property_scroll_scale>`. Ela funciona como um multiplicador de velocidade de rolagem, permitindo que as camadas se movam em uma velocidade diferente da câmera para cada eixo configurado. Um valor de 1 faz com que o nó de parallax role na mesma velocidade da câmera. Se você quiser que sua imagem pareça mais distante durante a rolagem, use um valor menor que 1, sendo que 0 a deixará completamente parada. Se quiser que algo pareça mais próximo da câmera, use um valor maior que 1, fazendo com que role mais rápido.
ru: Основой эффекта параллакса является свойство :ref:`scroll_scale <class_parallax2d_property_scroll_scale>`. Оно работает как множитель скорости прокрутки, позволяя слоям перемещаться с другой скоростью, чем камера для каждого набора осей. Значение 1 заставляет узел параллакса прокручиваться с той же скоростью, что и камера. Если вы хотите, чтобы изображение смотрело дальше при прокрутке, используйте значение ниже 1, а 0 полностью останавливает его. Если вы хотите, чтобы что-то отображалось ближе к камере, используйте значение выше 1, заставив его прокручиваться быстрее.
ta: இடமாறு விளைவின் முதுகெலும்பு: ref: `SCROLL_SCALE <class_Parallax2D_PROPERTY_SCROLL_SCALE>` சொத்து. இது ஒரு சுருள்-வேக பெருக்கியாக செயல்படுகிறது, ஒவ்வொரு அச்சு தொகுப்பிற்கும் கேமராவை விட அடுக்குகளை வெவ்வேறு வேகத்தில் நகர்த்த அனுமதிக்கிறது. 1 இன் மதிப்பு கேமராவின் அதே வேகத்தில் இடமாறு முனை உருட்டலை உருவாக்குகிறது. ச்க்ரோலிங் செய்யும் போது உங்கள் படம் மேலும் விலகிப் பார்க்க விரும்பினால், 1 ஐ விடக் குறைவான மதிப்பைப் பயன்படுத்தவும், 0 அதை ஒரு முழுமையான நிறுத்தத்திற்கு கொண்டு வரவும். கேமராவுக்கு நெருக்கமாக ஏதாவது தோன்ற விரும்பினால், 1 ஐ விட அதிகமான மதிப்பைப் பயன்படுத்துங்கள், இது வேகமாக உருட்டும்.
tr: Paralaks efektinin bel kemiği :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` özelliğidir. Kaydırma-hızı çarpanı olarak çalışır ve katmanların her bir eksen kümesi için kameradan farklı bir hızda hareket etmesini sağlar. 1 değeri, paralaks düğümünün kamerayla aynı hızda kaydırılmasını sağlar. Görüntünüzün kaydırma sırasında daha uzakta görünmesini istiyorsanız, 1'den düşük bir değer kullanın; 0 değeri tamamen durmasını sağlar. Bir şeyin kameraya daha yakın görünmesini istiyorsanız, 1'den yüksek bir değer kullanın ve daha hızlı kaymasını sağlayın.
uk: Основою ефекту паралакса є властивість :ref:`scroll_scale <class_parallax2d_property_scroll_scale>`. Він працює як множник швидкості прокручування, дозволяючи шарам рухатися з іншою швидкістю, ніж швидкість камери для кожного набору осі. Значення 1 змушує вузол паралакса прокручуватися з тією ж швидкістю, що й камера. Якщо ви хочете, щоб зображення дивилося далі під час прокручування, використовуйте значення менше 1, а 0 повністю зупиняє його. Якщо ви хочете, щоб щось виглядало ближче до камери, використовуйте значення вище 1, щоб прокручуватись швидше.
zh_hans: 视差效果的核心是 :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` 属性，该属性为滚动速度系数，能够让图层的移动速度和相机的移动速度产生差别，不同的轴可以分别进行调整。设为 1 时视差节点与相机同速。滚动时，如果你想要让图像看起来比较远，请使用小于 1 的值，设为 0 就会完全停止。如果你想要让图像看起来离相机很近，请使用大于 1 的值，这样图像滚动得就会更快。
zh_tw: 視差效果的核心是 :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` 屬性。這個屬性會當作滾動速度的倍率，讓每個軸向的圖層可以跟攝影機有不同的移動速度。數值 1 表示該層與攝影機同速移動。如果你希望圖像看起來比較遠，就設小於 1（0 則完全不動）；如果要讓內容看起來更靠近攝影機，則設大於 1，這樣滾動會比較快。

source: The scene above is comprised of five layers. Some good :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` values might be:
de: Die obige Szene besteht aus fünf Ebenen. Einige gute :ref:`scroll_scale <class_parallax2d_property_scroll_scale>`-Werte könnten sein:
es: La escena anterior se compone de cinco capas. Algunos valores adecuados para :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` podrían ser:
fr: La scène ci-dessus est composée de cinq couches. Des valeurs possibles pour :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` pourraient être :
ga: Tá cúig shraith sa radharc thuas. Roinnt mhaith :ref: `scroll_scála <class_parallax2d_property_scroll_scale>` b'fhéidir gur luachanna iad:
it: La scena qui sopra è composta da cinque livelli. Alcuni buoni valori per :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` potrebbero essere:
pt_br: A cena acima é composta por cinco camadas. Alguns bons valores para :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` podem ser:
ru: Сцена выше состоит из пяти слоев. Некоторые хорошие значения :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` могут быть:
ta: மேலே உள்ள காட்சி ஐந்து அடுக்குகளைக் கொண்டுள்ளது. சில நல்லது: ref: `SCROLL_SCALE <class_Parallax2D_PROPERTY_SCROLL_SCALE>` மதிப்புகள் இருக்கக்கூடும்:
tr: Yukarıdaki sahne beş katmandan oluşmaktadır. Bazı iyi :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` değerleri şunlar olabilir:
uk: Сцена вище складається з п'яти шарів. Деякі хороші значення :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` можуть бути такими:
zh_hans: 上面这个场景由五个图层构成，对应的 :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` 可以设置为：
zh_tw: 上圖場景有五個圖層，以下是一些常用的 :ref:`scroll_scale <class_parallax2d_property_scroll_scale>` 值參考：

source: ``(0.7, 1)`` - Forest
de: ``(0.7, 1)`` - Wald
es: ``(0.7, 1)`` - Bosque
fr: ``(0.7, 1)`` - Forêt
ga: ``(0.7, 1)`` - Foraoise
pt_br: ``(0,7, 1)`` - Floresta
ru: ``(0.7, 1)`` - Лес
ta: `` (0.7, 1) `` - காடு
tr: ``(0.7, 1)`` - Orman
uk: ``(0,7, 1)`` - Ліс
zh_hans: ``(0.7, 1)`` - 森林
zh_tw: ``(0.7, 1)`` - 森林

source: ``(0.5, 1)`` - Hills
de: ``(0.5, 1)`` - Hügel
es: ``(0.5, 1)`` - Colinas
fr: ``(0.5, 1)`` - Collines
ga: ``(0.5, 1)`` - Cnoic
pt_br: ``(0,5, 1)`` - Colinas
ru: ``(0.5, 1)`` - Холмы
ta: `` (0.5, 1) `` - மலைகள்
tr: ``(0.5, 1)`` - Tepeler
uk: ``(0,5, 1)`` - Пагорби
zh_hans: ``(0.5, 1)`` - 山丘
zh_tw: ``(0.5, 1)`` - 山丘

source: ``(0.3, 1)`` - Lower Clouds
de: ``(0.3, 1)`` - Untere Wolken
es: ``(0.3, 1)`` - Nubes Bajas
fr: ``(0.3, 1)`` - Nuages du bas
ga: ``(0.3, 1)`` - Scamaill Íochtaracha
pt_br: ``(0,3, 1)`` - Nuvens baixas
ru: ``(0.3, 1)`` - Нижние облака
ta: `` (0.3, 1) `` - குறைந்த மேகங்கள்
tr: ``(0.3, 1)`` - Alt Bulutlar
uk: ``(0,3, 1)`` - Нижня хмарність
zh_hans: ``(0.3, 1)`` - 低处的云
zh_tw: ``(0.3, 1)`` - 低雲

source: ``(0.2, 1)`` - Higher Clouds
de: ``(0.2, 1)`` - Höhere Wolken
es: ``(0.2, 1)`` - Nubes Altas
fr: ``(0.2, 1)`` - Nuages du haut
ga: ``(0.2, 1)`` - Scamaill Níos Airde
pt_br: ``(0,2, 1)`` - Nuvens mais altas
ru: ``(0.2, 1)`` - Высокие облака
ta: `` (0.2, 1) `` - அதிக மேகங்கள்
tr: ``(0.2, 1)`` - Daha Yüksek Bulutlar
uk: ``(0,2, 1)`` - Вищі хмари
zh_hans: ``(0.2, 1)`` - 高处的云
zh_tw: ``(0.2, 1)`` - 高雲

source: ``(0.1, 1)`` - Sky
de: ``(0.1, 1)`` – Himmel
es: ``(0.1, 1)`` - Cielo
fr: ``(0.1, 1)`` - Ciel
ga: ``(0.1, 1)`` - Spéir
pt_br: ``(0,1, 1)`` - Céu
ru: ``(0.1, 1)`` - Небо
ta: `` (0.1, 1) `` - வானம்
tr: ``(0.1, 1)`` - Gökyüzü
uk: ``(0,1, 1)`` - Небо
zh_hans: ``(0.1, 1)`` - 天空
zh_tw: ``(0.1, 1)`` - 天空

source: The video below displays how these values affect scrolling while in-game:
de: Das folgende Video zeigt, wie sich diese Werte auf das Scrollen im Spiel auswirken:
es: El vídeo de abajo, muestra como esos valores afectan el desplazamiento en el juego:
fr: La vidéo ci-dessous montre comment ces valeurs affectent le défilement durant le jeu :
ga: Taispeánann an físeán thíos conas a théann na luachanna seo i bhfeidhm ar scrollú agus iad sa chluiche:
it: Il video qui sotto mostra come questi valori influiscono sullo scorrimento durante il gioco:
pt_br: O vídeo abaixo mostra como esses valores afetam a rolagem durante o jogo:
ru: На видео ниже показано, как эти значения влияют на прокрутку в игре:
ta: விளையாட்டில் இருக்கும்போது இந்த மதிப்புகள் ச்க்ரோலிங்கை எவ்வாறு பாதிக்கின்றன என்பதை கீழே உள்ள வீடியோ காட்டுகிறது:
tr: Aşağıdaki videoda bu değerlerin oyun içinde kaydırmayı nasıl etkilediği gösterilmektedir:
uk: У відео нижче показано, як ці значення впливають на прокручування під час гри:
zh_hans: 下面的这个视频展示的就是这些值在游戏中的对滚动的影响：
zh_tw: 下方影片展示這些數值在遊戲中如何影響視差滾動效果：

source: Infinite repeat
de: Unendliche Wiederholung
es: Repetición infinita
fr: Répétition infinie
ga: Athdhéanamh gan teorainn
it: Ripetizione infinita
pt_br: Repetição infinita
ru: Бесконечное повторение
ta: எல்லையற்ற மீண்டும்
tr: Sonsuz tekrar
uk: Нескінченне повторення
zh_hans: 无限重复
zh_tw: 無限重複
