Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_parallax.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hans, zh_tw

source: Do the same for the second SubViewport but use layers 1 and 3.
es: Haga lo mismo para el segundo SubViewport pero utilice las capas 1 y 3.
fr: Faites de même pour le second SubViewport mais utilisez les couches 1 et 3.
pt_br: Faça o mesmo para o segundo SubViewport, mas use as camadas 1 e 3.
ru: Сделайте то же самое для второго SubViewport, но используйте слои 1 и 3.
uk: Зробіть те саме для другого SubViewport, але використовуйте шари 1 і 3.
zh_hans: 对第二个 SubViewport 执行相同的操作，但使用图层 1 和 图层 3。
zh_tw: 第二個 SubViewport 也一樣設，但改用層 1 和 3。

source: Give your parallax nodes in the first SubViewport a common parent and set its :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` to 2.
pt_br: Dê aos seus nós de parallax no primeiro SubViewport um pai comum e defina seu :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` como 2.
ru: Дайте вашим узлам параллакса в первом SubViewport общего родителя и установите его :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` на 2.
uk: Надайте своїм паралактичним вузлам у першому SubViewport загального батька та встановіть для його :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` значення 2.
zh_hans: 为第一个 SubViewport 中的视差节点提供一个共同的父节点，并将其 :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` 设置为 2。
zh_tw: 把第一個 SubViewport 的所有視差節點放在同一個父節點下，並把該父節點的 :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` 設為 2。

source: Do the same for the second SubViewport's parallax nodes, but use a layer of 3.
es: Haga lo mismo para los nodos de paralaje del segundo SubViewport, pero utilice una capa de 3.
it: Fai lo stesso per i nodi parallasse del secondo SubViewport, ma usa un livello di 3.
pt_br: Faça o mesmo para os nós de parallax do segundo SubViewport, mas use uma camada de 3.
ru: Сделайте то же самое для узлов параллакса второго SubViewport, но используйте слой 3.
uk: Зробіть те саме для вузлів паралакса другого SubViewport, але використовуйте шар 3.
zh_hans: 对第二个 SubViewport 的视差节点执行相同的操作，但使用 3 号图层。
zh_tw: 第二個 SubViewport 的視差節點也同理，但設成 3 層。

source: How does this work? If a canvas item has a :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` that doesn't match the SubViewport's :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>`, it will hide all children, even if they do. We use this to our advantage, letting the SubViewports cut off rendering of parallax nodes whose parent doesn't have a supported :ref:`visibility_layer<class_canvasitem_property_visibility_layer>`.
es: ¿Cómo funciona esto? Si un elemento del lienzo tiene una capa de visibilidad (:ref:`visibility_layer<class_canvasitem_property_visibility_layer>`) que no coincide con la máscara de lienzo (:ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>`) del SubViewport, se ocultarán todos los elementos secundarios, incluso si coinciden. Esto nos beneficia, permitiendo que las subvistas bloqueen la representación de los nodos de paralaje cuyo elemento principal no tenga una capa de visibilidad (:ref:`visibility_layer<class_canvasitem_property_visibility_layer>`) compatible.
pt_br: Como isso funciona? Se um item de canvas tiver uma :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` que não corresponde à :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` do SubViewport, ele ocultará todos os filhos, mesmo que eles correspondam. Usamos isso a nosso favor, permitindo que os SubViewports interrompam a renderização de nós de parallax cujo pai não possui uma :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` compatível.
ru: Как это работает? Если элемент холста имеет :ref:`visibility_layer<class_canvasitem_property_visibility_layer>`, который не соответствует :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` SubViewport, он скроет всех дочерних элементов, даже если они соответствуют. Мы используем это в своих интересах, позволяя SubViewports обрезать рендеринг узлов параллакса, родительский элемент которых не имеет поддерживаемого :ref:`visibility_layer<class_canvasitem_property_visibility_layer>`.
uk: Як це працює? Якщо елемент полотна має :ref:`visibility_layer<class_canvasitem_property_visibility_layer>`, який не збігається з :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` SubViewport, він приховає всіх дочірніх елементів, навіть якщо вони збігаються. Ми використовуємо це на нашу користь, дозволяючи SubViewports відключати відтворення вузлів паралакса, батьківський елемент яких не має підтримуваного :ref:`visibility_layer<class_canvasitem_property_visibility_layer>`.
zh_hans: 这是如何工作的？如果一个画布项的 :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` 与 SubViewport 的 :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` 不匹配，它将隐藏所有子节点，即使它们匹配也是如此。我们利用这一点，让 SubViewport 停止那些父节点没有匹配的 :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` 的视差节点的渲染。
zh_tw: 這個機制是這樣：如果某個畫布項目的 :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` 跟 SubViewport 的 :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` 不符，就算子節點有設定，整個分支也都會被隱藏。我們就利用這點，讓每個 SubViewport 只顯示有對應父層 :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` 的視差節點。

source: Previewing in the editor
de: Vorschau im Editor
es: Vista previa en el editor
fr: Prévisualiser dans l'éditeur
ga: Réamhamharc san eagarthóir
it: Vedere l'anteprima nell'editor
ru: Предпросмотр в редакторе
ta: எடிட்டரில் முன்னோட்டம்
tr: Düzenleyicide önizleme
uk: Попередній перегляд у редакторі
zh_hans: 在编辑器中预览
zh_tw: 在編輯器中預覽

source: Prior to 4.3, the recommendation was to place every layer in their own :ref:`ParallaxBackground<class_parallaxbackground>`, enable the :ref:`follow_viewport_enabled<class_canvaslayer_property_follow_viewport_enabled>` property, and scale the individual layer. This method has always been tricky to get right, but is still achievable by using a :ref:`CanvasLayer<class_canvaslayer>` instead of a :ref:`ParallaxBackground<class_parallaxbackground>`.
de: Vor 4.3 wurde empfohlen, jede Ebene in ihrem eigenen :ref:`ParallaxBackground<class_parallaxbackground>` zu platzieren, die Eigenschaft :ref:`follow_viewport_enabled<class_canvaslayer_property_follow_viewport_enabled>` zu aktivieren und die einzelnen Ebenen zu skalieren. Diese Methode war schon immer schwierig umzusetzen, ist aber immer noch möglich, indem man einen :ref:`CanvasLayer<class_canvaslayer>` anstelle eines :ref:`ParallaxBackground<class_parallaxbackground>` verwendet.
es: Antes de la 4.3, la recomendación era colocar cada capa en su propio :ref:`ParallaxBackground<class_parallaxbackground>`, activar la propiedad :ref:`follow_viewport_enabled<class_canvaslayer_property_follow_viewport_enabled>`, y escalar la capa individual. Este método siempre ha sido difícil de conseguir, pero todavía se puede lograr mediante el uso de un :ref:`CanvasLayer<class_canvaslayer>` en lugar de un :ref:`ParallaxBackground<class_parallaxbackground>`.
fr: Avant la 4.3, la recommandation était de placer chaque couche dans son propre :ref:`ParallaxBackground<class_parallaxbackground>`, activer la propriété :ref:`follow_viewport_enabled<class_canvaslayer_property_follow_viewport_enabled>` et mettre à l'échelle la couche individuellement. Cette méthode a toujours été difficile à faire, mais est toujours réalisable en utilisant un :ref:`CanvasLayer<class_canvaslayer>` au lieu d'un :ref:`ParallaxBackground<class_parallaxbackground>`.
ga: Roimh 4.3, moladh gach ciseal a chur ina n-airí féin :ref:`ParallaxBackground<class_parallaxbackground>`, cumasaigh an :ref:`follow_viewport_enabled<class_canvaslayer_property_follow_viewport_enabled>` airí, agus scála na ciseal aonair. Bhí sé deacair an modh seo a fháil i gceart i gcónaí, ach is féidir é a bhaint amach trí :ref:`CanvasLayer <class_canvaslayer>` a úsáid in ionad :ref:`ParallaxBackground<class_parallaxbackground>`.
pt_br: Antes da versão 4.3, a recomendação era colocar cada camada em seu próprio :ref:`ParallaxBackground<class_parallaxbackground>`, ativar a propriedade :ref:`follow_viewport_enabled<class_canvaslayer_property_follow_viewport_enabled>` e escalar a camada individualmente. Esse método sempre foi complicado de acertar, mas ainda é possível utilizá-lo com um :ref:`CanvasLayer<class_canvaslayer>` em vez de um :ref:`ParallaxBackground<class_parallaxbackground>`.
ru: До версии 4.3 рекомендовалось размещать каждый слой в собственном :ref:`ParallaxBackground<class_parallaxbackground>`, включать свойство :ref:`follow_viewport_enabled<class_canvaslayer_property_follow_viewport_enabled>` и масштабировать отдельный слой. Этот метод всегда был сложным для правильного выполнения, но его все еще можно реализовать, используя :ref:`CanvasLayer<class_canvaslayer>` вместо :ref:`ParallaxBackground<class_parallaxbackground>`.
ta: 4.3 க்கு முன்னர், ஒவ்வொரு அடுக்கையும் தாங்களாகவே வைக்க வேண்டும் என்று பரிந்துரை இருந்தது: ref: `இடமாறு_பாராலாக்ச்பேக் கிரவுண்ட்>`, என்பதை இயக்கு: ref: `follow_viewport_enabled <class_canvaslayer_pollower_viewport_enabled>` சொத்து மற்றும் அளவிடுதல். இந்த முறை எப்போதுமே சரியானதைப் பெறுவதற்கு தந்திரமானது, ஆனால் ஒரு: re: `கேன்வாச்லேயர் <class_canvaslayer>` என்பதற்கு பதிலாக ஒரு: குறிப்பு: `இடமாறு_பாராலாக்ச்பேக் மைதானம்>` ஆகியவற்றைப் பயன்படுத்துவதன் மூலம் இன்னும் அடையக்கூடியது.
tr: 4.3'ten önce, her katmanı kendi :ref:`ParallaxBackground <class_parallaxbackground>`ögesi içine yerleştirmek, :ref:`follow_viewport_enabled <class_canvaslayer_property_follow_viewport_enabled>` özelliğini etkinleştirmek ve her katmanı tek tek ölçeklendirmek öneriliyordu. Bu yöntemi doğru şekilde uygulamak her zaman zor olmuştur, ancak :ref:`ParallaxBackground <class_parallaxbackground>` yerine bir :ref:`CanvasLayer <class_canvaslayer>` kullanarak hala başarılabilir.
uk: До версії 4.3 рекомендовано розміщувати кожен шар у власному :ref:`ParallaxBackground<class_parallaxbackground>`, увімкнути властивість :ref:`follow_viewport_enabled<class_canvaslayer_property_follow_viewport_enabled>` і масштабувати окремий шар. Цей метод завжди було складно підібрати правильно, але він все ще можливий, використовуючи :ref:`CanvasLayer<class_canvaslayer>` замість :ref:`ParallaxBackground<class_parallaxbackground>`.
zh_hans: 4.3 版本之前推荐的是把每个层都放到各自的 :ref:`ParallaxBackground<class_parallaxbackground>` 下面，然后启用 :ref:`follow_viewport_enabled<class_canvaslayer_property_follow_viewport_enabled>` 属性，再对各个层进行缩放。这个方法要用对还挺难的，用 :ref:`CanvasLayer<class_canvaslayer>` 代替 :ref:`ParallaxBackground<class_parallaxbackground>` 也能达到想要的效果。
zh_tw: Godot 4.3 以前的做法，建議每一層都用一個自己的 :ref:`ParallaxBackground<class_parallaxbackground>` ，啟用 :ref:`follow_viewport_enabled<class_canvaslayer_property_follow_viewport_enabled>` ，再分別縮放每一層。這個做法其實一直都比較複雜，但現今你可以改用 :ref:`CanvasLayer<class_canvaslayer>` 來實現分層，而不是 :ref:`ParallaxBackground<class_parallaxbackground>` 。

source: Another recommendation is `KoBeWi's "Parallax2D Preview" addon <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_. It provides a few different preview modes and is very handy!
de: eine weitere Empfehlung ist `KoBeWis „parallax2d preview“-Add-on <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_. Es bietet ein paar verschiedene Vorschaumodi und ist sehr praktisch!
es: Otra recomendación es el `addon KoBeWi's "Parallax2D Preview" <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_. Provee unos cuantos modos de vista previos distintos ¡y es muy práctico!
fr: Une autre recommandation est l'`addon "Parallax2D Preview" de KoBeWi <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_. Il fournit quelques différents modes de prévisualisation et est très pratique !
ga: Moladh eile is ea an addon "Parallax2D Preview" de chuid KoBeWi <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_. Soláthraíonn sé roinnt modhanna réamhamhairc éagsúla agus tá sé an-áisiúil!
it: Un'altra raccomandazione è il componente aggiuntivo `"Parallax2D Preview" di KoBeWi <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_. Offre diverse modalità di anteprima ed è molto utile!
pt_br: Outra recomendação é o plugin `KoBeWi's "Parallax2D Preview" <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_. Ele oferece alguns modos de visualização diferentes e é muito prático!
ru: Еще одна рекомендация - `KoBeWi's "Parallax2D Preview" addon <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_. Он предоставляет несколько различных режимов предварительного просмотра и очень удобен!
ta: மற்றொரு பரிந்துரை `கோபுவியின்" இடமாறு 2 டி முன்னோட்டம் "addon <https://github.com/kobewi/godot-parallax2d-p-peview>` _. இது சில வித்தியாசமான முன்னோட்ட முறைகளை வழங்குகிறது மற்றும் மிகவும் எளிது!
tr: Bir başka öneri de `KoBeWi'nin "Parallax2D Preview" eklentisidir <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_. Birkaç farklı önizleme modu sağlar ve çok kullanışlıdır!
uk: Ще одна рекомендація `KoBeWi's "Parallax2D Preview" addon <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_. Він надає кілька різних режимів попереднього перегляду і дуже зручний!
zh_hans: 另外推荐 `KoBeWi 的“Parallax2D Preview”插件 <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_\ 。这个插件提供了很多预览模式，挺好用的！
zh_tw: 另一個推薦是 `KoBeWi 的「Parallax2D Preview」外掛 <https://github.com/KoBeWi/Godot-Parallax2D-Preview>`_，它提供多種預覽模式，非常好用！
