Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_parallax.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hans, zh_tw

source: Ideally, following this guide, your parallax textures are large enough to cover the screen even when zoomed out. Until now, we have had a perfectly fitting 288x208 texture inside of a 288x208 viewport. However, problems occur when we zoom out by setting the :ref:`Camera2D.zoom<class_camera2d_property_zoom>` to ``(0.5, 0.5)``:
de: Im Idealfall sind Ihre Parallaxentexturen gemäß dieser Anleitung groß genug, um den Bildschirm auch beim Herauszoomen abzudecken. Bisher hatten wir eine perfekt passende 288 x 208-Textur in einem 288 x 208-Ansichtsfenster. Es treten jedoch Probleme auf, wenn wir herauszoomen, indem wir :ref:`Camera2D.zoom<class_camera2d_property_zoom>` auf ``(0,5, 0,5)`` setzen:
es: Idealmente, siguiendo esta guía, tus texturas paralajas van a ser suficientemente grandes para cubrir la pantalla, inclusive cuando disminuyas el zoom. Hasta ahora, hemos encajado perfectamente una textura 288x208 dentro de una ventana gráfica de 288x208. De cualquier manera, pueden ocurrir problemas cuando disminuyamos el zoom configurando la :ref: `Camera2D.zoom<class_camera2d_property_zoom>` a ``(0.5, 0.5)``:
ga: Go hidéalach, tar éis an treoir seo, tá d'uigeachtaí parallax mór go leor chun an scáileán a chlúdach fiú nuair a dhéantar zúmáil amach. Go dtí seo, bhí uigeacht foirfe 288x208 againn taobh istigh de radharc 288x208. Tarlaíonn fadhbanna, áfach, nuair a dhéanaimid zúmáil amach tríd an :ref:`Camera2D.zoom<class_camera2d_property_zoom> a shocrú go ``(0.5, 0.5)``:
pt_br: Idealmente, seguindo este guia, suas texturas de parallax devem ser grandes o suficiente para cobrir a tela mesmo quando houver zoom out. Até agora, tínhamos uma textura de 288x208 que se encaixava perfeitamente em uma janela de exibição de 288x208. No entanto, problemas surgem quando aplicamos zoom out definindo o :ref:`Camera2D.zoom<class_camera2d_property_zoom>` para ``(0.5, 0.5)``:
ru: В идеале, следуя этому руководству, ваши текстуры параллакса будут достаточно большими, чтобы покрыть экран даже при уменьшении масштаба. До сих пор у нас была идеально подходящая текстура 288x208 внутри области просмотра 288x208. Однако, когда мы уменьшаем масштаб, устанавливая :ref:`Camera2D.zoom<class_camera2d_property_zoom>` на ``(0.5, 0.5)``, возникают проблемы:
ta: வெறுமனே, இந்த வழிகாட்டியைப் பின்பற்றி, உங்கள் இடமாறு அமைப்புகள் பெரிதாக்கும்போது கூட திரையை மறைக்கும் அளவுக்கு பெரியவை. இப்போது வரை, 288x208 காட்சிக்குள் 288x208 அமைப்பை நாங்கள் செய்துள்ளோம். இருப்பினும், நாம் பெரிதாக்கும்போது சிக்கல்கள் ஏற்படுகின்றன: `camera2d.zoom <class_camera2d_property_zoom>` முதல் `(0.5, 0.5)` `:
tr: İdeal olarak, bu kılavuzu izleyerek, paralaks dokularınız uzaktan bakıldığında bile ekranı kaplayacak kadar büyük olur. Şimdiye kadar, 288x208 görüntü alanının içine 288x208 dokuyu mükemmel bir şekilde sığdırdık. Ancak, :ref:`Camera2D.zoom <class_camera2d_property_zoom>` değerini ``(0.5, 0.5)`` olarak ayarlayarak uzaklaştığımızda sorunlar ortaya çıkıyor:
uk: В ідеалі, дотримуючись цього посібника, ваші текстури паралакса будуть достатньо великими, щоб покривати екран навіть у зменшеному масштабі. Досі ми мали ідеально підходящу текстуру 288x208 у вікні перегляду 288x208. Однак виникають проблеми, коли ми зменшуємо масштаб, встановлюючи для :ref:`Camera2D.zoom<class_camera2d_property_zoom>` значення ``(0,5, 0,5)``:
zh_hans: 理想情况下，按照本指南操作，你的视差纹理足够大，即使在缩小时也能覆盖屏幕。到目前为止，我们在 288x208 视口内拥有一个完美贴合的 288x208 纹理。但是，当我们通过将 :ref:`Camera2D.zoom<class_camera2d_property_zoom>` 设置为 ``(0.5, 0.5)`` 进行缩小时，会出现问题：
zh_tw: 理想情況下，根據本指南設置後，你的視差紋理即使在畫面縮小時也足以覆蓋整個螢幕。前面我們範例是 288x208 紋理對應 288x208 視窗，但如果我們把 :ref:`Camera2D.zoom<class_camera2d_property_zoom>` 設為 ``(0.5, 0.5)``，畫面縮小一半就會出現問題：

source: Even though everything is correctly set for the viewport at the default zoom level, zooming out makes it smaller than the viewport, breaking the infinite repeat effect. This is where :ref:`repeat_times<class_parallax2d_property_repeat_times>` can help out. Setting a value of ``3`` (one extra repeat behind and in front), it is now large enough to accommodate the infinite repeat effect.
de: Auch wenn für das Ansichtsfenster bei der Standardzoomstufe alles richtig eingestellt ist, wird es beim Herauszoomen kleiner als das Ansichtsfenster, wodurch der unendliche Wiederholungseffekt unterbrochen wird. Hier kann :ref:`repeat_times<class_parallax2d_property_repeat_times>` Abhilfe schaffen. Durch Festlegen eines Werts von ``3`` (eine zusätzliche Wiederholung hinten und vorne) ist es jetzt groß genug, um den unendlichen Wiederholungseffekt zu ermöglichen.
es: Aunque todo está configurado correctamente para la ventana gráfica en el nivel de zoom predeterminado, al alejar la imagen, esta se hace más pequeña que la ventana gráfica, lo que rompe el efecto de repetición infinita. Aquí es donde :ref:`repeat_times<class_parallax2d_property_repeat_times>` puede ayudar. Al configurar un valor de ``3`` (una repetición adicional por delante y por detrás), ahora es lo suficientemente grande como para acomodar el efecto de repetición infinita.
ga: Cé go bhfuil gach rud socraithe i gceart don radharc ag an leibhéal súmáil réamhshocraithe, má dhéantar zúmáil amach beidh sé níos lú ná an radharc, rud a bhriseann an éifeacht athuair gan teorainn. Seo an áit ar féidir le :ref:`repeat_times<class_parallax2d_property_repeat_times>` cuidiú. Ag socrú luach ``3`` (athrá breise amháin taobh thiar agus os comhair), tá sé mór go leor anois chun freastal ar an éifeacht athuair gan teorainn.
pt_br: Mesmo que tudo esteja configurado corretamente para a janela de exibição no nível de zoom padrão, ao aplicar zoom out a textura fica menor do que a janela de exibição, quebrando o efeito de repetição infinita. É aqui que a propriedade :ref:`repeat_times<class_parallax2d_property_repeat_times>` pode ajudar. Definindo um valor de ``3`` (uma repetição extra atrás e uma na frente), agora ela é grande o suficiente para acomodar o efeito de repetição infinita.
ru: Несмотря на то, что все правильно установлено для области просмотра на уровне масштабирования по умолчанию, уменьшение масштаба делает ее меньше области просмотра, нарушая эффект бесконечного повторения. Вот где :ref:`repeat_times<class_parallax2d_property_repeat_times>` может помочь. Установка значения ``3`` (один дополнительный повтор сзади и спереди) теперь достаточно велика для размещения эффекта бесконечного повторения.
ta: இயல்புநிலை சூம் மட்டத்தில் காட்சிக்கு எல்லாமே சரியாக அமைக்கப்பட்டிருந்தாலும், அவுட் பெரிதாக்குவது வியூபோர்ட்டை விட சிறியதாக ஆக்குகிறது, இது எல்லையற்ற மீண்டும் விளைவை உடைக்கிறது. இதுதான்: ref: `` reperate_time <class_parallax2d_property_repeat_times> `உதவ முடியும். `` 3`` (ஒரு கூடுதல் மறுபடியும் பின்னால் மற்றும் முன்னால்) மதிப்பை அமைத்தல், எல்லையற்ற மீண்டும் விளைவுக்கு இடமளிக்கும் அளவுக்கு இது இப்போது பெரியது.
tr: Varsayılan yakınlaştırma düzeyinde her şey çerçeve için doğru şekilde ayarlanmış olsa da, uzaklaşma işlemi çerçeveden daha küçük hale getirerek sonsuz tekrar efektini bozar. İşte bu noktada :ref:`repeat_times <class_parallax2d_property_repeat_times>` yardımcı olabilir. ``3`` değerini ayarlarsak (arkada ve önde fazladan bir tekrar), artık sonsuz tekrar etkisini barındıracak kadar büyüktür.
uk: Незважаючи на те, що все правильно встановлено для вікна перегляду на рівні масштабування за замовчуванням, зменшення масштабу робить його меншим за вікно перегляду, порушуючи ефект нескінченного повторення. Ось де :ref:`repeat_times<class_parallax2d_property_repeat_times>` може допомогти. Встановивши значення «3» (одне додаткове повторення позаду та попереду), воно тепер достатньо велике, щоб вмістити ефект нескінченного повторення.
zh_hans: 尽管在默认缩放级别下，视口的所有内容都已正确设置，但缩小后会使它小于该视口，从而破坏无限重复效果。这时 :ref:`repeat_times<class_parallax2d_property_repeat_times>` 就可以提供帮助。将值设置为 ``3``\ （前后各一个额外的重复），现在它就足够大，可以容纳无限重复的效果了。
zh_tw: 即使預設縮放下都沒問題，當畫面縮小後，原本的紋理就不夠大，無限重複效果就會壞掉。這時就需要用 :ref:`repeat_times<class_parallax2d_property_repeat_times>` 。設成 ``3`` （前後各加一個重複），就能讓圖像足夠大來支援無限重複。

source: If these textures were meant to be repeated vertically, we would have specified a ``y`` value for the :ref:`repeat_size<class_parallax2d_property_repeat_size>`. The :ref:`repeat_times<class_parallax2d_property_repeat_times>` would automatically add a repeat above and below as well. This is only a horizontal parallax, so it leaves an empty block above and below the image. How do we solve this? We need to get creative! In this example, we stretch the sky higher, and grass sprite lower. The textures now support the normal zoom level and zooming out to half size.
de: Wenn diese Texturen vertikal wiederholt werden sollten, hätten wir einen ``y``-Wert für :ref:`repeat_size<class_parallax2d_property_repeat_size>` angegeben. :ref:`repeat_times<class_parallax2d_property_repeat_times>` würde automatisch auch oben und unten eine Wiederholung hinzufügen. Dies ist nur eine horizontale Parallaxe, sodass über und unter dem Bild ein leerer Block verbleibt. Wie lösen wir das? Wir müssen kreativ werden! In diesem Beispiel strecken wir den Himmel höher und das Gras-Sprite tiefer. Die Texturen unterstützen jetzt die normale Zoomstufe und das Herauszoomen auf die halbe Größe.
es: Si estas texturas se hubieran tenido que repetir verticalmente, habríamos especificado un valor ``y`` para :ref:`repeat_size<class_parallax2d_property_repeat_size>`. :ref:`repeat_times<class_parallax2d_property_repeat_times>` también agregaría automáticamente una repetición arriba y abajo. Esto es solo un paralaje horizontal, por lo que deja un bloque vacío arriba y abajo de la imagen. ¿Cómo solucionamos esto? ¡Necesitamos ser creativos! En este ejemplo, estiramos el cielo más arriba y el sprite de hierba más abajo. Las texturas ahora admiten el nivel de zoom normal y la reducción a la mitad del tamaño.
ga: Dá mbeadh sé i gceist na huigeachtaí seo a athdhéanamh go hingearach, bheadh luach `y`` sonraithe againn don :ref:`repeat_size<class_parallax2d_property_repeat_size>`. Chuirfeadh an :ref:`repeat_times<class_parallax2d_property_repeat_times>` athuair thuas agus thíos go huathoibríoch freisin. Níl anseo ach parallax cothrománach, agus mar sin fágann sé bloc folamh os cionn agus faoi bhun na híomhá. Conas is féidir linn é seo a réiteach? Caithfimid a bheith cruthaitheach! Sa sampla seo, déanaimid an spéir a shíneadh níos airde, agus sprite féar níos ísle. Tacaíonn na huigeachtaí anois leis an ngnáthleibhéal súmáil isteach agus zúmáil amach go leathmhéid.
pt_br: Se essas texturas fossem feitas para se repetir verticalmente, teríamos especificado um valor em ``y`` na propriedade :ref:`repeat_size<class_parallax2d_property_repeat_size>`. A propriedade :ref:`repeat_times<class_parallax2d_property_repeat_times>` adicionaria automaticamente uma repetição acima e abaixo também. Como este é um parallax apenas horizontal, ele deixa um espaço vazio acima e abaixo da imagem. Como resolvemos isso? Precisamos ser criativos! Neste exemplo, esticamos o céu para cima e o sprite da grama para baixo. As texturas agora suportam tanto o nível de zoom normal quanto o zoom out para metade do tamanho.
ru: Если бы эти текстуры должны были повторяться по вертикали, мы бы указали значение ``y`` для :ref:`repeat_size<class_parallax2d_property_repeat_size>`. :ref:`repeat_times<class_parallax2d_property_repeat_times>` автоматически добавил бы повторение сверху и снизу. Это только горизонтальный параллакс, поэтому он оставляет пустой блок сверху и снизу изображения. Как нам решить эту проблему? Нам нужно проявить креативность! В этом примере мы растягиваем небо выше, а спрайт травы ниже. Теперь текстуры поддерживают нормальный уровень масштабирования и уменьшение до половинного размера.
ta: இந்த அமைப்புகள் செங்குத்தாக மீண்டும் மீண்டும் செய்யப்பட வேண்டும் என்றால், நாங்கள் ஒரு `` y`` மதிப்பைக் குறிப்பிட்டிருப்போம்: ref: `` reperate_size <class_parallax2d_property_repeat_size> `. தி: ரெஃப்: `மீண்டும்_ முறை <class_parallax2d_property_repeat_times>` தானாகவே மேலேயும் கீழேயும் மீண்டும் மீண்டும் சேர்க்கப்படும். இது ஒரு கிடைமட்ட இடமாறு மட்டுமே, எனவே இது படத்திற்கு மேலேயும் கீழேயும் ஒரு வெற்று தொகுதியை விட்டு விடுகிறது. இதை நாம் எவ்வாறு தீர்ப்பது? நாம் படைப்பாற்றலைப் பெற வேண்டும்! இந்த எடுத்துக்காட்டில், நாங்கள் வானத்தை உயரமாக நீட்டுகிறோம், புல் ச்ப்ரைட் கீழ். கட்டமைப்புகள் இப்போது சாதாரண சூம் அளவை ஆதரிக்கின்றன மற்றும் அரை அளவிற்கு பெரிதாக்குகின்றன.
tr: Bu dokuların dikey olarak tekrarlanması istenseydi, :ref:`repeat_size <class_parallax2d_property_repeat_size>` için bir ``y`` değeri belirtirdik. ref:`repeat_times <class_parallax2d_property_repeat_times>` otomatik olarak yukarıya ve aşağıya da bir tekrar ekleyecektir. Bu yalnızca yatay bir paralaks olduğundan, görüntünün üstünde ve altında boş bir blok bırakır. Bunu nasıl çözeceğiz? Yaratıcı olmamız gerekiyor! Bu örnekte, gökyüzünü daha yükseğe ve çim grafik ögesini daha alçağa uzatıyoruz. Dokular artık normal yakınlaştırma seviyesini ve yarı boyuta kadar uzaklaşmayı destekliyor.
uk: Якби ці текстури мали повторюватися вертикально, ми б вказали значення ``y`` для :ref:`repeat_size<class_parallax2d_property_repeat_size>`. :ref:`repeat_times<class_parallax2d_property_repeat_times>` також автоматично додасть повтор вище та нижче. Це лише горизонтальний паралакс, тому він залишає порожній блок над і під зображенням. Як ми це вирішимо? Нам потрібно бути креативними! У цьому прикладі ми розтягуємо небо вище, а спрайт трави нижче. Тепер текстури підтримують звичайний рівень масштабування та зменшення до половини розміру.
zh_hans: 如果这些纹理需要垂直地重复，我们应该为 :ref:`repeat_size <class_parallax2d_property_repeat_size>` 指定一个 ``y`` 值。:ref:`repeat_times <class_parallax2d_property_repeat_times>` 也会自动在上方和下方添加重复。这只是一个水平视差，因此它会在图像上方和下方留下一个空白块。我们如何解决这个问题？我们需要发挥创造力！在这个例子中，我们将天空拉高，将草精灵拉低。纹理现在支持正常缩放级别以及缩小到一半大小。
zh_tw: 如果你的紋理設計本來就要垂直重複，可以把 :ref:`repeat_size<class_parallax2d_property_repeat_size>` 的 ``y`` 設成相應數值，:ref:`repeat_times<class_parallax2d_property_repeat_times>` 就會自動在上下也加一個重複。這裡範例只有做水平視差，所以上下會有空白。該怎麼辦呢？可以有創意地把天空拉高、草地拉低，這樣紋理就能同時支援正常與縮小一半的縮放。

source: Split screen
de: Geteilter Bildschirm
es: Dividir la pantalla
fr: Écran partagé
ga: Scáileán scoilte
it: Schermo diviso
ru: Split screen (разделенный экран)
ta: பிளவு திரை
tr: Bölünmüş ekran
uk: Розділений екран
zh_hans: 分屏
zh_tw: 分割畫面

source: Most tutorials for making a split screen game in Godot begin by writing a small script to assign the :ref:`Viewport.world_2d<class_viewport_property_world_2d>` of the first SubViewport to the second, so they have a shared display. Questions often pop up about how to share a parallax effect between both screens.
de: Die meisten Tutorials zum Erstellen eines Splitscreen-Spiels in Godot beginnen mit dem Schreiben eines kleinen Skripts, um das :ref:`Viewport.world_2d<class_viewport_property_world_2d>` des ersten SubViewports dem zweiten zuzuweisen, sodass sie eine gemeinsame Anzeige haben. Häufig tauchen Fragen dazu auf, wie ein Parallaxeffekt zwischen beiden Bildschirmen geteilt werden kann.
es: La mayoría de los tutoriales para crear un juego de pantalla dividida en Godot comienzan escribiendo un pequeño script para asignar el :ref:`Viewport.world_2d<class_viewport_property_world_2d>` del primer SubViewport al segundo, de modo que compartan una pantalla. A menudo surgen preguntas sobre cómo compartir un efecto de paralaje entre ambas pantallas.
ga: Tosaíonn an chuid is mó de na ranganna teagaisc chun cluiche scáileáin scoilte a dhéanamh in Godot trí script bheag a scríobh chun an :ref:`Viewport.world_2d<class_viewport_property_world_2d>` den chéad FoViewport a shannadh don dara ceann, ionas go mbeidh taispeáint roinnte acu. Is minic a thagann ceisteanna aníos faoi conas éifeacht parallax a roinnt idir an dá scáileán.
pt_br: A maioria dos tutoriais para criar um jogo com tela dividida no Godot começa com um pequeno script para atribuir o :ref:`Viewport.world_2d<class_viewport_property_world_2d>` do primeiro SubViewport ao segundo, para que ambos compartilhem a mesma exibição. Frequentemente surgem dúvidas sobre como compartilhar um efeito de parallax entre as duas telas.
ru: Большинство руководств по созданию игры с разделенным экраном в Godot начинаются с написания небольшого скрипта для назначения :ref:`Viewport.world_2d<class_viewport_property_world_2d>` первого SubViewport второму, чтобы у них был общий дисплей. Часто возникают вопросы о том, как разделить эффект параллакса между обоими экранами.
ta: கோடோட்டில் ஒரு பிளவு திரை விளையாட்டை உருவாக்குவதற்கான பெரும்பாலான பயிற்சிகள்: rew: `viewport.world_2d <class_viewport_property_world_2d>` முதல் சப் வியூ போர்ட்டின் இரண்டாவதாக, அவை பகிரப்பட்ட காட்சி. இரண்டு திரைகளுக்கும் இடையில் ஒரு இடமாறு விளைவை எவ்வாறு பகிர்ந்து கொள்வது என்பது பற்றி கேள்விகள் பெரும்பாலும் வெளிவருகின்றன.
tr: Godot'da bölünmüş ekranlı bir oyun yapmak için çoğu öğretici, ilk SubViewport'un :ref:`Viewport.world_2d <class_viewport_property_world_2d>` özelliğini ikinciye atamak için küçük bir betik dosyası yazarak başlar, böylece paylaşılan bir ekrana sahip olurlar. Sıklıkla her iki ekran arasında paralaks efektinin nasıl paylaşılacağı sorulur.
uk: Більшість навчальних посібників із створення гри з розділеним екраном у Godot починаються з написання невеликого сценарію для призначення :ref:`Viewport.world_2d<class_viewport_property_world_2d>` першого SubViewport другому, щоб вони мали спільний дисплей. Часто виникають запитання про те, як поділитися ефектом паралакса між обома екранами.
zh_hans: 大多数用 Godot 制作分屏游戏的教程一开始都是要写一个简单的脚本，把第一个 SubViewport 的 :ref:`Viewport.world_2d<class_viewport_property_world_2d>` 赋值给第二个 SubViewport，从而实现屏幕的共享。此时就会产生如何在这两个屏幕之间共享视差效果的问题。
zh_tw: 大多數 Godot 分割畫面教學會先寫個小腳本，把第一個 SubViewport 的 :ref:`Viewport.world_2d<class_viewport_property_world_2d>` 指定給第二個 SubViewport，讓它們共享顯示。這時就常常會有人問：「要怎麼讓兩個畫面都能有同樣的視差效果？」。

source: The parallax effect fakes a perspective by moving the positions of different textures in relation to the camera. This is understandably problematic if you have multiple cameras, because your textures can't be in two places at once!
de: Der Parallaxeffekt täuscht eine Perspektive vor, indem er die Positionen verschiedener Texturen im Verhältnis zur Kamera verschiebt. Dies ist verständlicherweise problematisch, wenn Sie mehrere Kameras haben, da Ihre Texturen nicht an zwei Orten gleichzeitig sein können!
es: El efecto parallax (paralaje) simula una perspectiva moviendo las posiciones de diferentes textura en relación a la cámara. Esto es problemático si tienes múltiples cámaras, porque nuestras texturas ¡no pueden estar en dos lugares al mismo tiempo!
ga: Déanann an éifeacht parallax peirspictíocht a bhrú trí shuíomhanna uigeachtaí éagsúla a bhogadh maidir leis an gceamara. Tá sé seo fadhbanna sothuigthe má tá iliomad ceamaraí agat, toisc nach féidir le d'uigeachtaí a bheith i dhá áit ag an am céanna!
pt_br: O efeito de parallax simula uma perspectiva movendo as posições de diferentes texturas em relação à câmera. Isso é compreensivelmente problemático se você tiver várias câmeras, pois suas texturas não podem estar em dois lugares ao mesmo tempo!
ru: Эффект параллакса имитирует перспективу, перемещая позиции различных текстур относительно камеры. Это, понятно, проблематично, если у вас несколько камер, потому что ваши текстуры не могут находиться в двух местах одновременно!
ta: கேமரா தொடர்பாக வெவ்வேறு அமைப்புகளின் நிலைகளை நகர்த்துவதன் மூலம் இடமாறு விளைவு ஒரு முன்னோக்கை போலியானது. உங்களிடம் பல கேமராக்கள் இருந்தால் இது புரிந்துகொள்ளக்கூடிய சிக்கலானது, ஏனென்றால் உங்கள் அமைப்புகள் ஒரே நேரத்தில் இரண்டு இடங்களில் இருக்க முடியாது!
tr: Paralaks efekti, farklı dokuların konumlarını kameraya göre hareket ettirerek perspektifi taklit eder. Birden fazla kameranız varsa bu anlaşılabilir bir şekilde sorunludur, çünkü dokularınız aynı anda iki yerde olamaz!
uk: Ефект паралакса фальсифікує перспективу, змінюючи положення різних текстур відносно камери. Це, зрозуміло, проблематично, якщо у вас є кілька камер, тому що ваші текстури не можуть бути в двох місцях одночасно!
zh_hans: 视差效果模拟透视的方法是让不同的纹理根据其与相机的关系移动不同的距离。存在多个相机时，很显然就会出现问题，因为同一个纹理不可能同时出现在两个不同的地方！
zh_tw: 視差效果是透過每個圖層根據攝影機位置不同而移動，營造出景深。如果你有多個攝影機，就會產生問題，因為同一張紋理不可能同時出現在兩個不同位置！

source: This is still achievable by cloning the parallax nodes into the second (or third or fourth) :ref:`SubViewport<class_subviewport>`. Here's how a setup looks for a two player game:
pt_br: Isso ainda pode ser alcançado clonando os nós de parallax no segundo (ou terceiro ou quarto) :ref:`SubViewport<class_subviewport>`. Veja como fica a configuração para um jogo de dois jogadores:
ru: Этого все еще можно достичь путем клонирования узлов параллакса во второй (или третий, или четвертый) :ref:`SubViewport<class_subviewport>`. Вот как выглядит настройка для игры двух игроков:
uk: Цього все ще можна досягти шляхом клонування вузлів паралакса у другий (або третій або четвертий) :ref:`SubViewport<class_subviewport>`. Ось як виглядає налаштування гри для двох гравців:
zh_hans: 解决方法也是有的，把视差节点往第二个（或者第三第四个） :ref:`SubViewport<class_subviewport>` 里复制一份就好了。在双人游戏里是这个样子的：
zh_tw: 其實還是可以辦到，只要把視差節點複製到第二個（甚至第三、第四個）:ref:`SubViewport<class_subviewport>`。下圖是雙人遊戲的範例：

source: Of course, now both backgrounds show in both SubViewports. What we want is for each parallax to only show in their corresponding viewport. We can achieve this by doing the following:
es: Por supuesto, ahora ambos fondos se muestran en ambos SubViewports. Lo que queremos es que cada paralaje se muestre solo en su viewport correspondiente. Podemos lograrlo haciendo lo siguiente:
pt_br: Claro, agora ambos os fundos são exibidos em ambas as SubViewports. O que queremos é que cada parallax seja exibido somente na sua viewport correspondente. Podemos conseguir isso fazendo o seguinte:
ru: Конечно, теперь оба фона отображаются в обоих SubViewports. Мы хотим, чтобы каждый параллакс отображался только в соответствующем ему viewport. Этого можно добиться, выполнив следующие действия:
uk: Звичайно, тепер обидва фони відображаються в обох вікнах SubViewport. Ми хочемо, щоб кожен паралакс відображався лише у відповідному вікні перегляду. Ми можемо досягти цього, виконавши такі дії:
zh_hans: 当然，现在两个背景都会在两个 SubViewport 中显示。我们希望的是每个视差背景只在其对应的视口中显示。你可以通过以下方式实现这一点：
zh_tw: 這時會發現兩個 SubViewport 都會顯示兩個背景。我們想要的是每個視差圖層只顯示在對應的畫面。可以這樣做：

source: Leave all parallax nodes at their default :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` of 1.
pt_br: Deixe todos os nós de parallax em seu padrão :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` de 1.
ru: Оставьте все узлы параллакса со значением по умолчанию :ref:`visibility_layer<class_canvasitem_property_visibility_layer>`, равным 1.
uk: Залиште всі вузли паралакса за замовчуванням :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` 1.
zh_hans: 将所有视差节点的 :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` 保留为其默认值 1 。
zh_tw: 讓所有視差節點都維持預設的 :ref:`visibility_layer<class_canvasitem_property_visibility_layer>` （層 1）。

source: Set the first SubViewport's :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` to only layers 1 and 2.
fr: Définissez le :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` du premier SubViewport à seulement la couche 1 et 2.
pt_br: Defina :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` do primeiro SubViewport para apenas as camadas 1 e 2.
ru: Установите для первого SubViewport :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` только слои 1 и 2.
uk: Встановіть для першого SubViewport :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` лише шари 1 і 2.
zh_hans: 将第一个 SubViewport 的 :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` 设置为仅显示层 1 和 2。
zh_tw: 把第一個 SubViewport 的 :ref:`canvas_cull_mask<class_viewport_property_canvas_cull_mask>` 設成只顯示層 1 和 2。
