Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_parallax.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hans, zh_tw

source: Would increasing ``repeat_times`` fix this?
de: Würde eine Erhöhung der ``repeat_times`` das Problem beheben?
es: ¿Incrementar ``repeat_times`` arreglaría esto?
fr: Est-ce que augmenter ``repeat_times`` corrigerait ça ?
ga: An ndéanfadh méadú ``repeat_times`` é seo a shocrú?
pt_br: Aumentar ``repeat_times`` resolveria isso?
ru: Поможет ли увеличение ``repeat_times`` исправить эту ситуацию?
ta: `` `` `` `` `` `` மீண்டும்_ நேரம்`` அதை சரிசெய்யுமா?
tr: ``repeat_times`` değerini artırmak bunu düzeltir mi?
uk: Чи вирішить це збільшення ``repeat_times``?
zh_hans: 把 ``repeat_times`` 调大有用吗？
zh_tw: 多設幾個 ``repeat_times`` 可以解決嗎？

source: Increasing :ref:`repeat_times<class_parallax2d_property_repeat_times>` technically *would* work in some scenarios, but is a brute force solution and not the problem it is designed to solve (we'll go over this in a bit). A better fix is to understand how the repeat effect works and set up the parallax textures appropriately to begin with.
de: Das Erhöhen von :ref:`repeat_times<class_parallax2d_property_repeat_times>` *würde* in einigen Szenarien technisch funktionieren, ist aber eine Lösung mit roher Gewalt und nicht das Problem, das sie lösen soll (wir werden das gleich besprechen). Eine bessere Lösung besteht darin, zu verstehen, wie der Wiederholungseffekt funktioniert, und die Parallaxentexturen von Anfang an entsprechend einzurichten.
es: Incrementar :ref: `repeat_times_<class_parallax2d_property_repeat_times>` técnicamente *debería* funcionar en algunas situaciones, pero es una solución muy forzada y no es la manera en la que debería ser resuelto (repasaremos esto en un momento). Una mejor solución es entender como funciona el efecto de repetir y configurar correctamente las texturas del parallax para empezar.
ga: Ag méadú :ref:`repeat_times<class_parallax2d_property_repeat_times>` go teicniúil *d'oibreodh ** i gcásanna áirithe, ach is réiteach fórsa brúidiúil é agus ní hé an fhadhb a bhfuil sé deartha le réiteach (rachaidh muid níos mó ná é seo ar ball). Socrú níos fearr is ea tuiscint a fháil ar an gcaoi a n-oibríonn an éifeacht athfhillteach agus na huigeachtaí parallax a shocrú go cuí ar dtús.
it: Aumentare :ref:`repeat_times<class_parallax2d_property_repeat_times>` tecnicamente *funzionerebbe* in alcuni scenari, ma è una soluzione bruta e non il problema per cui è stata progettata (ne parleremo tra poco). Una soluzione migliore, per prima cosa, è capire come funziona l'effetto ripetizione e impostare le texture di parallasse in modo appropriato.
pt_br: Aumentar a propriedade :ref:`repeat_times<class_parallax2d_property_repeat_times>` *tecnicamente funcionaria* em alguns cenários, mas é uma solução forçada e não resolve o problema para o qual essa propriedade foi projetada (vamos abordar isso em breve). Uma correção melhor é entender como o efeito de repetição funciona e configurar as texturas de parallax corretamente desde o início.
ru: Увеличение :ref:`repeat_times<class_parallax2d_property_repeat_times>` технически *сработало бы* в некоторых сценариях, но это решение методом перебора, а не та проблема, которую оно призвано решать (мы рассмотрим это немного позже). Лучшим решением будет понять, как работает эффект повтора, и настроить текстуры параллакса соответствующим образом для начала.
ta: அதிகரித்தல்: குறிப்பு: `` reperate_times <class_parallax2d_property_repeat_times> `தொழில்நுட்ப ரீதியாக * சில சூழ்நிலைகளில் வேலை செய்யும், ஆனால் இது ஒரு முரட்டுத்தனமான தீர்வாகும், ஆனால் அது தீர்க்க வடிவமைக்கப்பட்ட சிக்கல் அல்ல (நாங்கள் இதை சிறிது நேரத்தில் செல்வோம்). மீண்டும் மீண்டும் விளைவு எவ்வாறு செயல்படுகிறது என்பதைப் புரிந்துகொள்வதும், தொடங்குவதற்கு இடமாறு அமைப்புகளை சரியான முறையில் அமைப்பதும் ஒரு சிறந்த தீர்வாகும்.
tr: :ref:`repeat_times <class_parallax2d_property_repeat_times>` değerini artırmak teknik olarak bazı senaryolarda *işe yarayabilir*, ancak bu bir kaba kuvvet çözümüdür ve çözmek için tasarlandığı sorun bu değildir (bunu birazdan ele alacağız). Daha iyi bir çözüm, tekrar efektinin nasıl çalıştığını anlamak ve en başta paralaks dokularını uygun şekilde ayarlamaktır.
uk: Збільшення :ref:`repeat_times<class_parallax2d_property_repeat_times>` технічно *працює* у деяких сценаріях, але це рішення грубої сили, а не проблема, для вирішення якої воно призначене (ми розглянемо це трохи пізніше). Кращим виправленням є зрозуміти, як працює ефект повторення, і для початку належним чином налаштувати текстури паралакса.
zh_hans: 从技术上来说，增加 :ref:`repeat_times<class_parallax2d_property_repeat_times>` 在某些情况下\ *将是*\ 可行的，但这是一种暴力的解决方案，而不是它被设计用于解决的问题（我们稍后会讨论这个问题）。更好的解决方法是理解重复效果的工作原理，并在开始时就适当地设置视差纹理。
zh_tw: 把 :ref:`repeat_times<class_parallax2d_property_repeat_times>` 加大在某些情況下確實有用，但這只是硬解，並不是這個參數本來該解決的問題（稍後會說明）。更好的做法是先了解無限重複的原理，再正確設置你的視差紋理。

source: First, check to see if any textures are spilling over onto the negative parts of the canvas. Make sure the textures used in the parallax nodes fit inside the "infinite repeat canvas" starting at ``(0,0)``. That way, if :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` is set correctly, it should look something like this, with one single loop of the image the same size or larger than the viewport:
de: Überprüfen Sie zunächst, ob Texturen auf die negativen Teile der Leinwand überlaufen. Stellen Sie sicher, dass die in den Parallaxknoten verwendeten Texturen in die „unendliche Wiederholungsleinwand“ passen, beginnend bei ``(0,0)``. Wenn :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` richtig eingestellt ist, sollte es ungefähr so aussehen, mit einer einzelnen Schleife des Bilds, die gleich groß oder größer als das Ansichtsfenster ist:
es: Primero, verifica si alguna textura se está desparramanso en las partes negativas del canvas. Asegúrate de que las texturas usadas en los nodos parallax encajan dentro del "canvas de repetición infinita" empezando en ``(0,0)``. De esta forma, si la :ref: `Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` se establece correctamente, debería verse parecido a esto, con un solo bucle de la imagen del mismo tamaño o de mayor longitud que el viewport:
ga: Ar dtús, seiceáil féachaint an bhfuil uigeachtaí ar bith ag doirteadh ar na codanna diúltacha den chanbhás. Bí cinnte go n-oireann na huigeachtaí a úsáidtear sna nóid parallax taobh istigh den “chanbhás athuair gan teorainn” ag tosú ag ``(0,0)``. Ar an mbealach sin, má tá :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` socraithe i gceart, ba cheart go bhfeicfeadh sé rud éigin mar seo, le lúb amháin den íomhá ar an méid céanna nó níos mó ná an radharc:
it: Per prima cosa, verifica che le texture non si estendano sulle parti negative del canvas. Assicurati che le texture utilizzate nei nodi parallasse si adattino al "canvas a ripetizione infinita" a partire da ``(0,0)``. In questo modo, se :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` è impostato correttamente, dovrebbe apparire più o meno così, con un singolo ciclo dell'immagine delle stesse dimensioni o più grande della viewport:
pt_br: Primeiro, verifique se alguma textura está se estendendo para as partes negativas do canvas. Certifique-se de que as texturas usadas nos nós de parallax se encaixem dentro do "canvas de repetição infinita", que começa em ``(0,0)``. Dessa forma, se a propriedade :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` estiver configurada corretamente, o resultado deve se parecer com isso: um único loop da imagem com o mesmo tamanho ou maior que a janela de exibição:
ru: Сначала проверьте, не перетекают ли какие-либо текстуры на отрицательные части холста. Убедитесь, что текстуры, используемые в узлах параллакса, помещаются внутри "бесконечного повторяющегося холста", начинающегося с ``(0,0)``. Таким образом, если :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` задано правильно, это должно выглядеть примерно так, с одним единственным циклом изображения того же размера или больше, чем область просмотра:
ta: முதலில், கேன்வாசின் எதிர்மறை பகுதிகள் மீது ஏதேனும் கட்டமைப்புகள் பரவுகின்றனவா என்பதைப் பார்க்கவும். `` (0,0) `` இல் தொடங்கி "எல்லையற்ற மீண்டும் கேன்வாசுக்கு" உள்ளே இடமாறு முனைகளில் பயன்படுத்தப்படும் அமைப்புகள் பொருந்துகின்றன என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். அந்த வகையில், if: ref: `baallax2d.repeat_size <class_parallax2d_property_repeat_size>` சரியாக அமைக்கப்பட வேண்டும், இது போன்ற ஒன்றைப் பார்க்க வேண்டும், படத்தின் ஒரு ஒற்றை வளையத்துடன் அதே அளவு அல்லது காட்சியை விட பெரியது:
tr: İlk olarak, herhangi bir dokunun kanvasın negatif kısımlarına taşıp taşmadığını kontrol edin. Paralaks düğümlerinde kullanılan dokuların ``(0,0)``'dan başlayan "sonsuz tekrar kanvası" içine sığdığından emin olun. Bu şekilde, :ref:`Parallax2D.repeat_size <class_parallax2d_property_repeat_size>` doğru ayarlanırsa, görüntünün tek bir döngüsü çerçeve ile aynı boyutta veya daha büyük olacak şekilde şuna benzer bir şey görünmelidir:
uk: Спочатку перевірте, чи не переливаються текстури на негативні частини полотна. Переконайтеся, що текстури, які використовуються у вузлах паралакса, відповідають «нескінченному повторюваному полотну», починаючи з ``(0,0)``. Таким чином, якщо :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` встановлено правильно, це має виглядати приблизно так, з одним єдиним циклом зображення того самого розміру або більшого, ніж область перегляду:
zh_hans: 首先，检查是否有任何纹理溢出到画布的负轴向。确保在视差节点中使用的纹理都位于从 ``(0,0)`` 开始的“无限重复画布”内。这样，如果正确设置了 :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>`，效果应该看起来像这样，图像的单次循环与视口大小相同或更大：
zh_tw: 首先檢查你的紋理有沒有超出畫布的負座標。確保所有用於視差的紋理都放在從 ``(0,0)`` 開始的「無限重複畫布」範圍內。這樣只要 :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` 設正確，就會像這樣，圖像單次循環就能覆蓋整個視窗甚至更大：

source: If you think of how the image scrolls across the screen, it starts by displaying what's inside the red rectangle (determined by :ref:`repeat_size<class_parallax2d_property_repeat_size>`), and when it reaches what's inside the yellow rectangle it zips the image forward to give the illusion of scrolling forever.
de: Wenn Sie darüber nachdenken, wie das Bild über den Bildschirm scrollt, wird zunächst angezeigt, was sich innerhalb des roten Rechtecks befindet (bestimmt durch :ref:`repeat_size<class_parallax2d_property_repeat_size>`), und wenn es den Bereich innerhalb des gelben Rechtecks erreicht, wird das Bild nach vorne gescrollt, um die Illusion eines endlosen Scrollens zu erzeugen.
es: Si piensas en cómo la imagen se desplaza a través de la pantalla, empieza mostrando lo que hay dentro del rectángulo rojo (determinado por la :ref:`repeat_size<class_parallax2d_property_repeat_size>`) y cuando alcanza lo que hay dentro del rectángulo amarillo comprime la imagen delantera para dar la ilusión de un desplazarse eternamente.
ga: Má smaoiníonn tú ar conas a scrollaíonn an íomhá trasna an scáileáin, tosaíonn sé ag taispeáint a bhfuil istigh sa dronuilleog dearg (arna chinneadh ag :ref:`repeat_size<class_parallax2d_property_repeat_size>`), agus nuair a shroicheann sé a bhfuil taobh istigh den dronuilleog bhuí zipeann sé an íomhá ar aghaidh chuig a thabhairt ar an illusion na scrollaigh go deo.
pt_br: Se você pensar em como a imagem se move pela tela, ela começa exibindo o que está dentro do retângulo vermelho (determinado por :ref:`repeat_size<class_parallax2d_property_repeat_size>`), e quando atinge o que está dentro do retângulo amarelo, ela reposiciona rapidamente a imagem para frente, criando a ilusão de rolagem infinita.
ru: Если представить, как изображение прокручивается по экрану, то сначала оно показывает то, что находится внутри красного прямоугольника (определяется :ref:`repeat_size<class_parallax2d_property_repeat_size>`), а когда достигает того, что находится внутри желтого прямоугольника, изображение прокручивается вперед, создавая иллюзию бесконечной прокрутки.
ta: திரை முழுவதும் படம் எவ்வாறு சுருங்குகிறது என்று நீங்கள் நினைத்தால், அது சிவப்பு செவ்வகத்திற்குள் இருப்பதைக் காண்பிப்பதன் மூலம் தொடங்குகிறது (தீர்மானிக்கப்படுகிறது: ref: `` `` மீண்டும்_பாராலக்ச் 2 டி_பிராபெர்டி_ரெபீட்_சிச்> `), மற்றும் அது மஞ்சள் செவ்வகத்திற்குள் இருப்பதை அடையும் போது அது படத்தை முன்னோக்கி சிப் செய்கிறது ச்க்ரோலிங் என்ற மாயையை எப்போதும் கொடுங்கள்.
tr: Görüntünün ekran boyunca nasıl kaydırıldığını düşünürseniz, kırmızı dikdörtgenin içindekini görüntüleyerek başlar (:ref:`repeat_size <class_parallax2d_property_repeat_size>` tarafından belirlenir) ve sarı dikdörtgenin içindekine ulaştığında, sonsuza kadar kaydırma yanılsaması vermek için görüntüyü ileri doğru atlatır.
uk: Якщо ви подумаєте про те, як зображення прокручується по екрану, воно починається з відображення того, що знаходиться всередині червоного прямокутника (визначається :ref:`repeat_size<class_parallax2d_property_repeat_size>`), а коли воно досягає того, що знаходиться всередині жовтого прямокутника, воно переміщує зображення вперед до створити ілюзію прокручування назавжди.
zh_hans: 想象一下图像是如何在屏幕上滚动的，它首先显示红色矩形内的内容（由 :ref:`repeat_size <class_parallax2d_property_repeat_size>` 确定），当到达黄色矩形内时，它会将图像向前拉动，从而给人一种永远滚动的感觉。
zh_tw: 想像畫面捲動時，會先顯示紅色方框（這個區域由 :ref:`repeat_size<class_parallax2d_property_repeat_size>` 決定）的內容，當畫面滾到黃色方框時，畫面會瞬間跳到下一輪，營造出無限捲動的錯覺。

source: If you have the image positioned away from the "infinite repeat canvas", when the camera reaches the yellow rectangle, half of the image is cut off before it jumps forward like in the image below:
de: Wenn Sie das Bild außerhalb der „Leinwand mit unendlicher Wiederholung“ positioniert haben und die Kamera das gelbe Rechteck erreicht, wird die Hälfte des Bildes abgeschnitten, bevor es wie im folgenden Bild nach vorne springt:
es: Si tienes la imagen posicionada lejos del "canvas de repetición infinito", cuando la cámara alcance el rectángulo amarillo, la mitad de la imagen se corta antes de saltar al a siguiente como en la imagen que se muestra abajo:
ga: Má tá an íomhá suite agat ar shiúl ón “chanbhás arís gan teorainn”, nuair a shroicheann an ceamara an dronuilleog buí, gearrtar leath den íomhá amach sula léann sí ar aghaidh mar atá san íomhá thíos:
pt_br: Se você posicionar a imagem longe da "tela de repetição infinita", quando a câmera atingir o retângulo amarelo, metade da imagem será cortada antes de avançar, como na imagem abaixo:
ru: Если изображение расположено вдали от «бесконечно повторяющегося холста», то, когда камера достигает желтого прямоугольника, половина изображения обрезается, прежде чем оно перейдет вперед, как показано на изображении ниже:
ta: "எல்லையற்ற மீண்டும் மீண்டும் கேன்வாசிலிருந்து" படத்தை நிலைநிறுத்தினால், கேமரா மஞ்சள் செவ்வகத்தை அடையும் போது, கீழே உள்ள படத்தைப் போல முன்னேறுவதற்கு முன்பு படத்தின் பாதி துண்டிக்கப்படுகிறது:
tr: Görüntüyü "sonsuz tekrar kanvasından" uzağa yerleştirdiyseniz, kamera sarı dikdörtgene ulaştığında, aşağıdaki görüntüde olduğu gibi ileri atlamadan önce görüntünün yarısı kesilir:
uk: Якщо у вас зображення розташоване поза «полотном нескінченного повторення», коли камера досягає жовтого прямокутника, половина зображення буде обрізано, перш ніж воно перескочить вперед, як на зображенні нижче:
zh_hans: 如果你将图像放置在“无限重复画布”之外的位置，当摄像机到达黄色矩形区域时，图像的一半会被裁切掉，然后才会向前跳转，就像下图所示：
zh_tw: 如果你的圖像沒有對齊「無限重複畫布」，當攝影機滾到黃色方框時，畫面會被截掉一半才跳轉，如下圖所示：

source: Scroll offset
es: Desplazar offset
fr: Décalage du défilement
ga: Scrollaigh fhrith
pt_br: Deslocamento de rolagem (Scroll)
ru: Смещение прокрутки
ta: உருட்டல் ஆஃப்செட்
tr: Kaydırma kayması
uk: Зміщення прокручування
zh_hans: 滚动偏移
zh_tw: 捲動偏移

source: If your parallax textures are already working correctly, but you prefer it to start at a different point, :ref:`Parallax2D<class_parallax2d>` comes with a :ref:`scroll_offset<class_parallax2d_property_scroll_offset>` property used to offset where the infinite repeat canvas starts. As an example, if your image is 288x208, setting the :ref:`scroll_offset<class_parallax2d_property_scroll_offset>` to ``(-144,0)`` or ``(144,0)`` allows it to begin halfway across the image.
de: Wenn Ihre Parallax-Texturen bereits korrekt funktionieren, Sie aber lieber an einem anderen Punkt beginnen möchten, verfügt :ref:`Parallax2D<class_parallax2d>` über eine Eigenschaft :ref:`scroll_offset<class_parallax2d_property_scroll_offset>`, mit der der Beginn der unendlichen Wiederholungsleinwand verschoben wird. Wenn Ihr Bild beispielsweise 288 x 208 groß ist, können Sie durch Festlegen von :ref:`scroll_offset<class_parallax2d_property_scroll_offset>` auf ``(-144,0)`` oder ``(144,0)`` beginnen, wenn Sie es auf halber Höhe des Bildes beginnen lassen.
es: Si tus texturas parallax ya están funcionando correctamente, pero prefieres empezar desde un punto diferente,la :ref:`Parallax2D<class_parallax2d>` viene con una propiedad :ref:`scroll_offset<class_parallax2d_property_scroll_offset>` usada para colocar el offset donde el "Canvas de repetición infinita" empieza. Como ejemplo, si tu imagen mide 288x208, configurar la :ref: `scroll_offset<class_parallax2d_property_scroll_ofset>` a ``(-144,0)`` o ``(144,0)`` permite empezar a mitad de camino a través de la imagen.
ga: Má tá d'uigeachtaí parallax ag obair i gceart cheana féin, ach b'fhearr leat go dtosódh sé ag pointe eile, :tag: `Parallax2D<class_parallax2d>` a thagann le :ref:`scroll_offset <class_parallax2d_property_scroll_offset>` an t-airí a úsáidtear chun an áit a bhfuil an chanbhás athchraolta gan teorainn thosaíonn. Mar shampla, más é 288x208 d'íomhá, má shocraítear an :tag:`scroll_offset <class_parallax2d_property_scroll_offset>` go ``(-144,0)`` nó ``(144,0)`` ceadaíonn sé tosú leath bealaigh trasna na híomhá .
pt_br: Se suas texturas de parallax já estão funcionando corretamente, mas você prefere que comecem em um ponto diferente, o :ref:`Parallax2D<class_parallax2d>` possui a propriedade :ref:`scroll_offset<class_parallax2d_property_scroll_offset>`, usada para deslocar o ponto de início do canvas de repetição infinita. Por exemplo, se sua imagem mede 288x208, definir o :ref:`scroll_offset<class_parallax2d_property_scroll_offset>` como ``(-144,0)`` ou ``(144,0)`` permite que ela comece no meio da imagem.
ru: Если ваши текстуры параллакса уже работают правильно, но вы предпочитаете, чтобы они начинались в другой точке, :ref:`Parallax2D<class_parallax2d>` поставляется со свойством :ref:`scroll_offset<class_parallax2d_property_scroll_offset>`, используемым для смещения начала бесконечного повторяющегося холста. Например, если ваше изображение имеет размер 288x208, установка :ref:`scroll_offset<class_parallax2d_property_scroll_offset>` на ``(-144,0)`` или ``(144,0)`` позволяет ему начинаться на полпути через изображение.
ta: உங்கள் இடமாறு கட்டமைப்புகள் ஏற்கனவே சரியாக செயல்பட்டால், ஆனால் வேறு கட்டத்தில் தொடங்க விரும்பினால்,: ref: `fallax2d <class_parallax2d>` ஒரு உடன் வருகிறது: ref: `SCROLL_PARALLAX2D_PROPERTY_SCROLL_OFFEST> தொடங்குகிறது. உதாரணமாக, உங்கள் படம் 288x208 ஆக இருந்தால், அமைத்தல்: Ref: `scroll_offset <class_parallax2d_property_scroll_offset>` முதல் `` (-144,0) `அல்லது` `(144,0)` `` ` .
tr: Paralaks dokularınız zaten düzgün çalışıyorsa, ancak farklı bir noktadan başlamasını tercih ediyorsanız, :ref:`Parallax2D <class_parallax2d>` sonsuz tekrar kanvasının başladığı yeri kaydırmak için kullanılan bir :ref:`scroll_offset <class_parallax2d_property_scroll_offset>` özelliği ile birlikte gelir. Örnek olarak, resminiz 288x208 ise, :ref:`scroll_offset <class_parallax2d_property_scroll_offset>` özelliğini ``(-144,0)`` veya ``(144,0)`` olarak ayarlamak, resmin yarısından başlamasını sağlar.
uk: Якщо ваші текстури паралакса вже працюють належним чином, але ви бажаєте, щоб вони починалися з іншої точки, :ref:`Parallax2D<class_parallax2d>` поставляється з властивістю :ref:`scroll_offset<class_parallax2d_property_scroll_offset>`, яка використовується для зсуву там, де нескінченне повторення полотна починається. Наприклад, якщо ваше зображення має розмір 288x208, встановлення :ref:`scroll_offset<class_parallax2d_property_scroll_offset>` на ``(-144,0)`` або ``(144,0)`` дозволить йому починатися з середини зображення .
zh_hans: 如果你的视差纹理已经正常工作，但你希望它从不同的点开始，:ref:`Parallax2D <class_parallax2d>` 附带一个 :ref:`scroll_offset <class_parallax2d_property_scroll_offset>` 属性，用于偏移无限重复画布的开始位置。例如，如果你的图像是 288x208，将 :ref:`scroll_offset <class_parallax2d_property_scroll_offset>` 设置为 ``(-144,0)`` 或 ``(144,0)`` 可使其从图像的中间位置开始。
zh_tw: 如果你的視差紋理已經正常顯示，但你希望畫面從不同位置開始，:ref:`Parallax2D<class_parallax2d>` 有一個 :ref:`scroll_offset<class_parallax2d_property_scroll_offset>` 屬性可以調整無限重複畫布的起始點。例如圖像大小 288x208 時，把 :ref:`scroll_offset<class_parallax2d_property_scroll_offset>` 設成 ``(-144,0)`` 或 ``(144,0)``，就能讓它從圖像中間起始。

source: Repeat times
de: Wiederholungsdurchläufe
es: Repetir tiempos
fr: Nombre de répétitions
ga: Aimre arís
it: Numero di ripetizioni
ru: Количество повторений
ta: நேரங்களை மீண்டும் செய்யவும்
tr: Tekrarlama miktarları
uk: Повторити рази
zh_hans: 重复次数
zh_tw: 重複次數
