Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_parallax.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hans, zh_tw

source: If you're not aiming for a pixel-perfect style, or don't mind a little blurriness, you may opt to scale the textures larger to fit your screen. Set the :ref:`scale<class_node2d_property_scale>` of the :ref:`Parallax2D<class_parallax2d>`, and all child textures scale with it.
de: Wenn Sie keinen pixelgenauen Stil anstreben oder eine leichte Unschärfe Ihnen nichts ausmacht, können Sie die Texturen auch größer skalieren, damit sie auf Ihren Bildschirm passen. Legen Sie die :ref:`scale<class_node2d_property_scale>` von :ref:`Parallax2D<class_parallax2d>` fest und alle untergeordneten Texturen werden entsprechend skaliert.
es: Si no buscas un estilo perfecto en cuanto a píxeles o no te molesta que la imagen se vea un poco borrosa, puedes optar por ampliar la escala de las texturas para que se ajusten a tu pantalla. Establece la escala de Parallax2D y todas las texturas secundarias se escalarán con ella.
fr: Si vous ne visez pas un style pixel-perfect ou si vous ne voyez pas d'inconvénient à un léger flou, vous pouvez choisir de redimensionner les textures pour qu'elles s'adaptent à votre écran. Définissez l'échelle (:ref:`scale<class_node2d_property_scale>`) du :ref:`Parallax2D<class_parallax2d>`, et toutes les textures enfants seront redimensionnées en conséquence.
ga: Mura bhfuil tú ag díriú ar stíl picteilín-foirfe, nó mura miste leat beagán doiléire, féadfaidh tú rogha a dhéanamh na huigeachtaí a scála níos mó a d’oirfeadh do scáileán. Socraigh :ref:`scála <class_node2d_property_scale>` den :ref:`Parallax2D <class_parallax2d>`, agus scála uigeachtaí uile an linbh leis.
pt_br: Se você não estiver buscando um estilo pixel-perfect ou não se importar com um pouco de desfoque, pode optar por aumentar a escalar das texturas para ficarem maiores e se ajustem à sua tela. Defina a propriedade :ref:`scale<class_node2d_property_scale>` do :ref:`Parallax2D<class_parallax2d>`, e todas as texturas filhas serão escaladas com ele.
ru: Если вы не стремитесь к идеальному стилю или не против небольшой размытости, вы можете выбрать больший масштаб текстур, чтобы они соответствовали вашему экрану. Установите :ref:`scale<class_node2d_property_scale>` для :ref:`Parallax2D<class_parallax2d>`, и все дочерние текстуры будут масштабироваться вместе с ним.
ta: நீங்கள் ஒரு பிக்சல்-சரியான பாணியை நோக்கமாகக் கொண்டிருக்கவில்லை என்றால், அல்லது கொஞ்சம் மங்கலாக கவலைப்படாவிட்டால், உங்கள் திரைக்கு ஏற்றவாறு பெரிய அமைப்புகளை அளவிட நீங்கள் தேர்வு செய்யலாம். : Ref: `அளவுகோல் <class_node2d_property_scale>` of: ref: `boallax2d <class_parallax2d>`, மற்றும் அனைத்து குழந்தை அமைப்புகளும் அதனுடன் அளவிடப்படுகின்றன.
tr: Mükemmel bir piksel tarzını hedeflemiyorsanız veya biraz bulanıklığı önemsemiyorsanız, dokuları ekranınıza sığdırmak için daha büyük ölçeklendirmeyi tercih edebilirsiniz. :ref:`Parallax2D <class_parallax2d>`nin :ref:`scale <class_node2d_property_scale>` değerini ayarlayın ve tüm alt dokular bununla ölçeklensin.
uk: Якщо ви не прагнете досконалого піксельного стилю або не проти розмитості, ви можете збільшити текстури, щоб вони відповідали вашому екрану. Встановіть :ref:`scale<class_node2d_property_scale>` для :ref:`Parallax2D<class_parallax2d>`, і всі дочірні текстури масштабуються відповідно до нього.
zh_hans: 如果你想要实现的不是完美像素风，或者不介意存在略微的模糊，那么你可以选择将纹理放大到适合屏幕的尺寸。请设置 :ref:`Parallax2D<class_parallax2d>` 的 :ref:`scale<class_node2d_property_scale>`\ ，所有子级纹理都会对应发生缩放。
zh_tw: 如果你不追求像素完美，或不介意有點模糊，也可以直接把紋理放大到填滿螢幕。只要設定 :ref:`Parallax2D<class_parallax2d>` 的 :ref:`scale<class_node2d_property_scale>`，所有子節點紋理也會跟著縮放。

source: Scale the child nodes
de: Skalieren der untergeordneten Knoten
es: Escala los modos hijo
ga: Scála na nóid linbh
ru: Размер узлов-потомков
ta: குழந்தை முனைகளை அளவிடவும்
tr: Alt düğümleri ölçeklendir
uk: Масштабуйте дочірні вузли
zh_hans: 缩放子节点
zh_tw: 縮放子節點

source: Similar to scaling the :ref:`Parallax2D<class_parallax2d>`, you can scale your :ref:`Sprite2D<class_sprite2d>` nodes to be large enough to cover the screen. Keep in mind that some settings like :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` and :ref:`Sprite2D.region_rect<class_sprite2d_property_region_rect>` do not take scaling into account, so it's necessary to adjust these values based on the scale.
de: Ähnlich wie beim Skalieren von :ref:`Parallax2D<class_parallax2d>` können Sie Ihre :ref:`Sprite2D<class_sprite2d>`-Knoten so skalieren, dass sie groß genug sind, um den Bildschirm abzudecken. Beachten Sie, dass einige Einstellungen wie :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` und :ref:`Sprite2D.region_rect<class_sprite2d_property_region_rect>` die Skalierung nicht berücksichtigen. Daher müssen diese Werte basierend auf der Skalierung angepasst werden.
es: Similar a ajustar la escala de la :ref: `Parallax2D<class_parallax2d>`, puedes escalar los nodos tus :ref: `Sprite2D<class_sprite2d>` para que se extiendan adecuadamente en la pantalla. Ten en mente que algunas opciones como la :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` y la :ref: `Sprite2D.region_rect<class_sprite2d_property_region_rect>` no toman en cuenta la escala, por lo que es necesario ajustar esos valores basados en la escala.
ga: Cosúil le scálaiú an :ref:`Parallax2D<class_parallax2d>`, is féidir leat do nóid :ref:`Sprite2D <class_sprite2d>` a scála le bheith mór go leor chun an scáileán a chlúdach. Cuimhnigh nach gcuireann roinnt socruithe ar nós :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` agus :ref:`Sprite2D.region_rect<class_sprite2d_property_region_rect> san áireamh an scála, mar sin tá sé bunaithe ar na luachanna seo a choigeartú.
pt_br: Semelhantemente à escala do :ref:`Parallax2D<class_parallax2d>`, você pode escalar seus nós :ref:`Sprite2D<class_sprite2d>` para ficarem grandes o suficiente para cobrir a tela. Lembre-se de que algumas configurações, como :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` e :ref:`Sprite2D.region_rect<class_sprite2d_property_region_rect>`, não levam a escala em consideração, portanto é necessário ajustar esses valores com base na escala.
ru: Подобно масштабированию :ref:`Parallax2D<class_parallax2d>`, вы можете масштабировать ваши узлы :ref:`Sprite2D<class_sprite2d>`, чтобы они были достаточно большими, чтобы покрыть экран. Помните, что некоторые настройки, такие как :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` и :ref:`Sprite2D.region_rect<class_sprite2d_property_region_rect>` не учитывают масштабирование, поэтому необходимо настроить эти значения на основе масштаба.
ta: அளவிடுவதைப் போன்றது: ref: `baallax2d <class_parallax2d>`, உங்கள் அளவிடலாம்: ref: `sprite2d <class_sprite2d>` திரையை மறைக்கும் அளவுக்கு பெரியதாக இருக்க வேண்டும். போன்ற சில அமைப்புகள்: `fallax2d.repeat_size <class_parallax2d_property_repeat_size>` மற்றும்: refite: `sprite2d.region_rect <class_sprite2d_property_region_rect> ers ஐ சரிசெய்ய வேண்டியதைச் செய்ய வேண்டாம்.
tr: :ref:`Parallax2D <class_parallax2d>`yi ölçeklendirmeye benzer şekilde, :ref:`Sprite2D <class_sprite2d>` düğümlerinizi ekranı kaplayacak kadar büyük olacak şekilde ölçeklendirebilirsiniz. :ref:`Parallax2D.repeat_size <class_parallax2d_property_repeat_size>` ve :ref:`Sprite2D.region_rect <class_sprite2d_property_region_rect>` gibi bazı ayarların ölçeklendirmeyi dikkate almadığını, bu nedenle bu değerleri ölçeğe göre ayarlamak gerektiğini unutmayın.
uk: Подібно до масштабування :ref:`Parallax2D<class_parallax2d>`, ви можете масштабувати вузли :ref:`Sprite2D<class_sprite2d>` так, щоб вони були достатньо великими, щоб покрити екран. Майте на увазі, що деякі налаштування, такі як :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` і :ref:`Sprite2D.region_rect<class_sprite2d_property_region_rect>` не враховують масштабування, тому необхідно налаштувати ці значення на основі масштабу.
zh_hans: 和放大 :ref:`Parallax2D<class_parallax2d>` 类似的是将 :ref:`Sprite2D<class_sprite2d>` 节点放大到能够覆盖住屏幕。请注意，\ :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` 和 :ref:`Sprite2D.region_rect<class_sprite2d_property_region_rect>` 等设置并不会考虑缩放，因此这些值也需要根据缩放进行调整。
zh_tw: 和縮放 :ref:`Parallax2D<class_parallax2d>` 類似，你也可以直接把 :ref:`Sprite2D<class_sprite2d>` 子節點放大到足以覆蓋整個畫面。但要注意，像 :ref:`Parallax2D.repeat_size<class_parallax2d_property_repeat_size>` 和 :ref:`Sprite2D.region_rect<class_sprite2d_property_region_rect>` 這些設定不會自動根據縮放調整，所以必須手動依縮放倍率對應調整這些數值。

source: Repeat the textures
de: Wiederholen Sie die Texturen
es: Repetir las texturas
fr: Répéter les textures
ga: Déan na uigeachtaí arís
it: Ripetere le texture
ru: Зацикливание текстур
ta: அமைப்புகளை மீண்டும் செய்யவும்
tr: Dokuları tekrarlayın
uk: Повторіть текстури
zh_hans: 重复纹理
zh_tw: 重複紋理

source: You can also start off on the right foot by preparing child nodes earlier in the process. If you have a :ref:`Sprite2D<class_sprite2d>` you'd like to repeat, but is too small, you can do the following to repeat it:
de: Sie können auch gleich von vorne beginnen, indem Sie zu einem früheren Zeitpunkt im Prozess untergeordnete Knoten vorbereiten. Wenn Sie beispielsweise ein :ref:`Sprite2D<class_sprite2d>` haben, das Sie wiederholen möchten, das aber zu klein ist, können Sie es wie folgt wiederholen:
es: También puedes empezar con el pie derecho preparando los nodos secundarios en una etapa anterior del proceso. Si tienes un :ref:`Sprite2D<class_sprite2d>` que te gustaría repetir, pero es demasiado pequeño, puedes hacer lo siguiente para repetirlo:
fr: Vous pouvez aussi commencer du bon pied en préparant les nœuds fils plus tôt dans le processus. Si vous avez une :ref:`Image 2D<class_sprite2d>`, que vous souhaitez répéter, mais qui est trop petite, vous pouvez faire ce qui suit :
ga: Is féidir leat tosú freisin ar an gcos dheas trí nóid linbh a ullmhú níos luaithe sa phróiseas. Má tá :ref:`Sprite2D<class_sprite2d>` agat ar mhaith leat é a dhéanamh arís, ach go bhfuil sé róbheag, is féidir leat an méid seo a leanas a dhéanamh chun é a dhéanamh arís:
pt_br: Você também pode começar com o pé direito preparando os nós filhos mais cedo no processo. Se você tiver um :ref:`Sprite2D<class_sprite2d>` que deseja repetir, mas que é pequeno demais, você pode fazer o seguinte para repeti-lo:
ru: Вы также можете начать с правильного подхода, подготовив дочерние узлы на более раннем этапе процесса. Если у вас есть :ref:`Sprite2D<class_sprite2d>`, который вы хотите повторить, но он слишком мал, вы можете сделать следующее, чтобы повторить его:
ta: இந்த செயல்பாட்டில் முந்தைய குழந்தை முனைகளைத் தயாரிப்பதன் மூலம் சரியான பாதத்தில் தொடங்கலாம். உங்களிடம் இருந்தால்: ref: `sprite2d <class_sprite2d>` நீங்கள் மீண்டும் செய்ய விரும்புகிறீர்கள், ஆனால் மிகச் சிறியது, அதை மீண்டும் செய்ய நீங்கள் பின்வருவனவற்றை செய்யலாம்:
tr: Ayrıca sürecin başlarında alt düğümleri hazırlayarak doğru adımla başlayabilirsiniz. Tekrarlamak istediğiniz bir :ref:`Sprite2D <class_sprite2d>` varsa, ancak çok küçükse, tekrarlamak için aşağıdakileri yapabilirsiniz:
uk: Ви також можете почати з правої ноги, підготувавши дочірні вузли раніше в процесі. Якщо у вас є :ref:`Sprite2D<class_sprite2d>`, який ви хотіли б повторити, але він замалий, ви можете зробити наступне, щоб повторити його:
zh_hans: 你也可以通过提前准备子节点来确保从一开始就走上正确的道路。如果你有一个希望重复的 :ref:`Sprite2D<class_sprite2d>`\ ，但它的尺寸太小，就可以按照以下步骤来重复它：
zh_tw: 你也可以一開始就將子節點準備好。如果你有一個 :ref:`Sprite2D<class_sprite2d>` 紋理想要重複但尺寸太小，可以用下列做法讓它重複鋪滿：

source: set :ref:`texture_repeat<class_canvasitem_property_texture_repeat>` to :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED<class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>`
de: setze :ref:`texture_repeat<class_canvasitem_property_texture_repeat>` auf :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED<class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>`
es: Establece :ref:`texture_repeat<class_canvasitem_property_texture_repeat>` como :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED<class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>`
fr: définir :ref:`texture_repeat<class_canvasitem_property_texture_repeat>` à :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED<class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>`
ga: socraithe :ref:`uigeacht_athuair<class_canvasitem_property_texture_repeat>` go :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED<class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>`
pt_br: defina :ref:`texture_repeat<class_canvasitem_property_texture_repeat>` como :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED<class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>`
ru: установить :ref:`texture_repeat<class_canvasitem_property_texture_repeat>` в :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED<class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>`
ta: அமைக்கவும்: `Stecture_repeat <class_canvasitem_property_texture_repeat>` இதற்கு: ref: `canvasitem.texture_repeat_enabled <class_canvasitem_constant_texture_repeat_enabled>`
tr: :ref:`texture_repeat <class_canvasitem_property_texture_repeat>` özelliğini :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED <class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>` olarak ayarlayın
uk: встановити :ref:`texture_repeat<class_canvasitem_property_texture_repeat>` на :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED<class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>`
zh_hans: 将 :ref:`texture_repeat<class_canvasitem_property_texture_repeat>` 设置为 :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED<class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>`
zh_tw: 將 :ref:`texture_repeat<class_canvasitem_property_texture_repeat>` 設為 :ref:`CanvasItem.TEXTURE_REPEAT_ENABLED<class_canvasitem_constant_TEXTURE_REPEAT_ENABLED>`

source: set :ref:`region_enabled<class_sprite2d_property_region_enabled>` to ``true``
de: setze :ref:`region_enabled<class_sprite2d_property_region_enabled>` auf ``true``
es: Establece la :ref:`region_enabled<class_sprite2d_property_region_enabled>` a ``true``
fr: définir :ref:`region_enabled<class_sprite2d_property_region_enabled>` à ``true``
ga: socraithe : ref: `réigiún_cumasaithe <class_sprite2d_property_region_enabled>` go ``fíor``
it: imposta :ref:`region_enabled<class_sprite2d_property_region_enabled>` su ``true``
pt_br: defina :ref:`region_enabled<class_sprite2d_property_region_enabled>` como ``true``
ru: установить :ref:`region_enabled<class_sprite2d_property_region_enabled>` в ``true``
ta: செட்: குறிப்பு: `பிராந்திய_இனபிள் <class_sprite2d_property_region_enabled>` பெறுநர் `` உண்மை``
tr: :ref:`region_enabled <class_sprite2d_property_region_enabled>` özelliğini ``true`` olarak ayarlayın
uk: встановити :ref:`region_enabled<class_sprite2d_property_region_enabled>` на ``true``
zh_hans: 将 :ref:`region_enabled<class_sprite2d_property_region_enabled>` 设置为 ``true``
zh_tw: 將 :ref:`region_enabled<class_sprite2d_property_region_enabled>` 設為 ``true``

source: set the :ref:`region_rect<class_sprite2d_property_region_rect>` to a multiple of the size of your texture large enough to cover the viewport.
de: Stellen Sie :ref:`region_rect<class_sprite2d_property_region_rect>` auf ein Vielfaches der Größe Ihrer Textur ein, groß genug, um das Ansichtsfenster abzudecken.
es: Establezca :ref:`region_rect<class_sprite2d_property_region_rect>` en un múltiplo del tamaño de su textura lo suficientemente grande como para cubrir la ventana gráfica.
ga: socraigh an :ref:`region_rect<class_sprite2d_property_region_rect>` chuig iolraí de mhéid d'uigeachta atá mór go leor chun an radharc a chlúdach.
pt_br: defina :ref:`region_rect<class_sprite2d_property_region_rect>` como um múltiplo da dimensão da sua textura, grande o suficiente para cobrir a janela de visualização.
ru: установите :ref:`region_rect<class_sprite2d_property_region_rect>` в значение, кратное размеру вашей текстуры, достаточное для покрытия области просмотра.
ta: : ref: `Rection_Rect <class_sprite2d_property_region_rect>` உங்கள் அமைப்பின் அளவின் பலவற்றிற்கு காட்சியை மறைக்க போதுமானதாக இருக்கும்.
tr: :ref:`region_rect <class_sprite2d_property_region_rect>` değerini dokunuzun boyutunun çerçeveyi kaplayacak kadar büyük katlarına ayarlayın.
uk: встановіть :ref:`region_rect<class_sprite2d_property_region_rect>` значення, кратне розміру вашої текстури, достатньо великого, щоб охопити вікно перегляду.
zh_hans: 将 :ref:`region_rect<class_sprite2d_property_region_rect>` 设置为纹理大小的倍数，让纹理足够覆盖住视口。
zh_tw: 把 :ref:`region_rect<class_sprite2d_property_region_rect>` 設成足夠覆蓋視窗的多倍尺寸。

source: Below, you can see that repeating the image twice makes it large enough to cover the screen.
de: Unten können Sie sehen, dass das Bild durch zweimaliges Wiederholen groß genug wird, um den Bildschirm abzudecken.
es: Debajo, puedes ver que repetir la imagen dos veces las hace lo suficientemente largas para cubrir la pantalla.
fr: Ci-dessous, vous pouvez voir que répéter l'image deux fois la rend suffisamment large pour recouvrir tout l'écran.
ga: Thíos, is féidir leat a fheiceáil go ndéanann an íomhá a athrá faoi dhó é mór go leor chun an scáileán a chlúdach.
pt_br: Abaixo, você pode ver que repetir a imagem duas vezes a torna grande o suficiente para cobrir a tela.
ru: Ниже вы можете видеть, что повторение изображения дважды делает его достаточно большим, чтобы закрыть весь экран.
ta: கீழே, படத்தை மீண்டும் மீண்டும் செய்வது திரையை மறைக்க போதுமானதாக இருக்கும் என்பதை நீங்கள் காணலாம்.
tr: Aşağıda, görüntünün iki kez tekrarlanmasının ekranı kaplayacak kadar büyük olmasını sağladığını görebilirsiniz.
uk: Нижче ви можете побачити, що повторення зображення двічі робить його достатньо великим, щоб покрити екран.
zh_hans: 下图中可以看到，把图像重复一次就足够覆盖住屏幕了。
zh_tw: 如下圖，將圖像重複兩次就足以覆蓋整個畫面。

source: Poor positioning
de: Schlechte Positionierung
es: Posicionado deficiente
fr: Un mauvais positionnement
ga: Droch-shuíomh
it: Posizionamento inadeguato
ru: Некорректное позиционирование
ta: மோசமான நிலைப்படுத்தல்
tr: Kötü konumlandırma
uk: Погане позиціонування
zh_hans: 位置问题
zh_tw: 位置錯誤

source: It's common to see users mistakenly set all of their textures to be centered at ``(0,0)``:
de: Es kommt häufig vor, dass Benutzer alle ihre Texturen fälschlicherweise so einstellen, dass sie auf ``(0,0)`` zentriert sind:
es: Es común ver a los usuarios centrar erróneamente sus texturas en ``(0,0)``:
fr: Il est commun de voir des utilisateurs paramétrer par erreur toutes leurs textures de façon à les centrer à ``(0,0)`` :
ga: Is coitianta a fheiceáil go socraíonn úsáideoirí ar a gcuid uigeachtaí go léir dírithe ar ``(0,0)``:
pt_br: É comum ver usuários erroneamente definindo todas as suas texturas para serem centralizadas em ``(0,0)``:
ru: Часто можно увидеть, как пользователи ошибочно устанавливают все свои текстуры по центру ``(0,0)``:
ta: பயனர்கள் தங்கள் அமைப்புகள் அனைத்தையும் தவறாக அமைப்பது பொதுவானது `` (0,0) ``:
tr: Kullanıcıların yanlışlıkla tüm dokularını ``(0,0)`` merkezli olacak şekilde ayarladığını görmek yaygındır:
uk: Зазвичай користувачі помилково встановлюють центрування всіх своїх текстур на ``(0,0)``:
zh_hans: 用户经常错误地把所有纹理都设成在 ``(0,0)`` 居中：
zh_tw: 常見錯誤是把所有紋理都設為以 ``(0,0)`` 為中心：

source: This creates problems with the infinite repeat effect and should be avoided. The "infinite repeat canvas" starts at ``(0,0)`` and expands down and to the right to the size of the :ref:`repeat_size<class_parallax2d_property_repeat_size>` value.
de: dies erzeugt Probleme mit dem Endloswiederholungseffekt und sollte vermieden werden. Die „Endloswiederholungsleinwand“ beginnt bei ``(0,0)`` und dehnt sich nach unten und rechts bis zur Größe des Werts :ref:`repeat_size<class_parallax2d_property_repeat_size>` aus.
es: Esto crea problemas con el efecto de repetición infinita y se debe evitar. El "lienzo de repetición infinita" comienza en ``(0,0)`` y se expande hacia abajo y hacia la derecha hasta el tamaño del valor :ref:`repeat_size<class_parallax2d_property_repeat_size>`.
fr: Cela crée des problèmes avec l'effet de répétition infini et devrait être évité. Le "canevas de répétition infinie" commence à ``(0,0)`` et s'étend vers le bas et à droite selon la taille de la valeur de :ref:`repeat_size<class_parallax2d_property_repeat_size>`.
ga: Cruthaíonn sé seo fadhbanna leis an éifeacht athuair gan teorainn agus ba cheart é a sheachaint. Tosaíonn an "canbhás athdhéanta gan teorainn" ag ``(0,0)`` agus leathnaíonn sé síos agus ar dheis go dtí méid an luach :ref:`repeat_size<class_parallax2d_property_repeat_size>`.
pt_br: Isso cria problemas com o efeito de repetição infinita e deve ser evitado. O "canvas de repetição infinita" começa em ``(0,0)`` e se expande para baixo e para a direita até o tamanho definido pela propriedade :ref:`repeat_size<class_parallax2d_property_repeat_size>`.
ru: Это создает проблемы с эффектом бесконечного повторения и должно быть исключено. «Бесконечный повторяющийся холст» начинается с ``(0,0)`` и расширяется вниз и вправо до размера значения :ref:`repeat_size<class_parallax2d_property_repeat_size>`.
ta: இது எல்லையற்ற மீண்டும் விளைவுகளில் சிக்கல்களை உருவாக்குகிறது மற்றும் தவிர்க்கப்பட வேண்டும். "எல்லையற்ற மறுபடியும் கேன்வாச்" `` (0,0) `` இல் தொடங்கி விரிவடைகிறது மற்றும் அதன் அளவிற்கு விரிவடைகிறது: ref: `` reperate_size <class_parallax2d_property_repeat_size> `மதிப்பு.
tr: Bu, sonsuz tekrar efektinde sorun yaratır ve bundan kaçınılmalıdır. "Sonsuz tekrar kanvası" ``(0,0)`` noktasından başlar ve :ref:`repeat_size <class_parallax2d_property_repeat_size>` değerinin boyutuna kadar aşağı ve sağa doğru genişler.
uk: Це створює проблеми з ефектом нескінченного повторення, і цього слід уникати. «Полотно нескінченного повторення» починається з ``(0,0)`` і розширюється вниз і вправо до розміру значення :ref:`repeat_size<class_parallax2d_property_repeat_size>`.
zh_hans: 这会给无限重复效果带来问题，应当尽量避免。“无限重复画布”从 ``(0,0)`` 开始，向右下扩展至 :ref:`repeat_size<class_parallax2d_property_repeat_size>` 的大小值。
zh_tw: 這樣會導致無限重複效果出錯，應該避免。所謂的「無限重複畫布」從 ``(0,0)`` 開始，向右下延伸到 :ref:`repeat_size<class_parallax2d_property_repeat_size>` 設定的大小。

source: If the textures are centered on the ``(0,0)`` crossing, the infinite repeat canvas is only partly covered, so it only partly repeats.
de: Wenn die Texturen auf dem Schnittpunkt ``(0,0)`` zentriert sind, wird die Leinwand mit der unendlichen Wiederholung nur teilweise abgedeckt und wiederholt sich daher nur teilweise.
es: Si las texturas están centradas en ``(0,0)``, cruzando el "canvas de repetición infinita" se cubre paracialmente, por lo que solo se repite parcialmente.
fr: Si les textures sont centrées sur le point d'intersection``(0,0)``, le canevas de répétition infini est seulement partiellement recouvert, donc il ne se répète que partiellement.
ga: Má tá na uigeachtaí dírithe ar an trasnú ``(0,0)``, níl an chanbhás athfhillteach gan teorainn ach clúdaithe go páirteach, mar sin ní dhéanann sé athdhéanamh ach go páirteach.
it: Se le texture sono centrate sull'incrocio ``(0,0)``, il canvas a ripetizione infinita è coperto solo parzialmente, quindi si ripete solo parzialmente.
pt_br: Se as texturas estiverem centralizadas no cruzamento ``(0,0)``, o canvas de repetição infinita será coberto apenas parcialmente, então a repetição ocorrerá de forma incompleta.
ru: Если текстуры центрированы на пересечении ``(0,0)``, бесконечно повторяющееся полотно покрыто лишь частично, поэтому оно повторяется лишь частично.
ta: கட்டமைப்புகள் `` (0,0) `` கடப்பதை மையமாகக் கொண்டிருந்தால், எல்லையற்ற மீண்டும் கேன்வாச் ஓரளவு மட்டுமே மூடப்பட்டிருக்கும், எனவே அது ஓரளவு மட்டுமே மீண்டும் நிகழ்கிறது.
tr: Dokular ``(0,0)`` kesişiminde ortalanırsa, sonsuz tekrarlı kanvas yalnızca kısmen kaplanır, bu nedenle yalnızca kısmen tekrarlanır.
uk: Якщо текстури зосереджені на перетині ``(0,0)``, полотно нескінченного повторення покривається лише частково, тому воно повторюється лише частково.
zh_hans: 如果纹理是以 ``(0,0)`` 交叉点为中心的，那么无限重复画布只会被部分覆盖，因此也只会部分地重复。
zh_tw: 如果紋理是以 ``(0,0)`` 為中心，無限重複畫布就只有部分被覆蓋，導致只有部分能正確重複。
