Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/custom_drawing_*_2d.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, uk, zh_hans, zh_hant

source: Custom drawing in 2D
de: Manuelles Zeichnen in 2D
es: Dibujos personalizados en 2D
fr: Dessin personnalisé en 2D
ga: Líníocht saincheaptha i 2D
pt_br: Desenho personalizado em 2D
ru: Пользовательская отрисовка в 2D
ta: 2d இல் தனிப்பயன் வரைதல்
uk: Власне малювання в 2D
zh_hans: 2D 中的自定义绘图
zh_hant: 2D 中的自訂繪圖

source: Introduction
de: Einführung
es: Introducción
ga: Réamhrá
it: Introduzione
pt_br: Introdução
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_hans: 前言
zh_hant: 前言

source: Godot has nodes to draw sprites, polygons, particles, text, and many other common game development needs. However, if you need something specific not covered with the standard nodes you can make any 2D node (for example, :ref:`Control <class_Control>` or :ref:`Node2D <class_Node2D>`-based) draw on screen using custom commands.
de: Godot verfügt über Nodes zum Zeichnen von Sprites, Polygonen, Partikeln, Text und vielen anderen gängigen Erfordernissen der Spieleentwicklung. Wenn Sie jedoch etwas Spezielles benötigen, das von den Standard-Nodes nicht abgedeckt wird, können Sie jeden 2D-Node (z. B. :ref:`Control <class_Control>` oder :ref:`Node2D <class_Node2D>`-basiert) mit benutzerdefinierten Befehlen auf dem Bildschirm zeichnen lassen.
es: Godot posee nodos para dibujar sprites, polígonos, partículas, etc., para la mayoría de los casos eso es suficiente, pero no siempre. Antes de desesperar al ver que no existe un nodo para dibujar algo *específico*, es bueno saber que es posible hacer que cualquier nodo 2D (ya sea uno basado en :ref:`Control <class_Control>` o :ref:`Node2D <class_Node2D>` ) puede aceptar comandos de dibujo personalizados. Esto es muy fácil de hacer.
fr: Godot a des nœuds pour dessiner des sprites, des polygones, des particules, du texte, et beaucoup d'autres besoins communs de développement de jeux. Cependant, si vous avez besoin de quelque chose de spécifique non couvert avec les nœuds standards, vous pouvez faire que n'importe quel nœud 2D (par exemple, basé sur :ref:`Control <class_Control>` ou :ref:`Node2D <class_Node2D>`) dessine sur l'écran en utilisant des commandes personnalisées.
ga: Tá nóid ag Godot chun sprites, polagáin, cáithníní, téacs, agus go leor riachtanas forbartha cluiche coitianta eile a tharraingt. Mar sin féin, má theastaíonn rud éigin sonrach uait nach bhfuil clúdaithe leis na nóid chaighdeánacha is féidir leat nód 2T ar bith a dhéanamh (mar shampla, :ref:`Control <class_Control>` nó :ref:`Node2D <class_Node2D>`-bunaithe) tarraingt ar an scáileán ag baint úsáide as saincheaptha orduithe.
ru: В Godot есть узлы для рисования спрайтов, полигонов, частиц, текста и многих других распространенных задач разработки игр. Однако, если вам нужно что-то конкретное и не представленное стандартными узлами, вы можете создать любой 2D-узел (например, на основе :ref:`Control <class_Control>` или :ref:`Node2D <class_Node2D>`), отображаемый на экране с помощью пользовательских команд.
ta: கோடோட் உருவங்கள், பலகோணங்கள், துகள்கள், உரை மற்றும் பல பொதுவான விளையாட்டு மேம்பாட்டுத் தேவைகளை வரைய முனைகள் உள்ளன. இருப்பினும், நிலையான முனைகளால் மூடப்படாத குறிப்பிட்ட ஒன்று உங்களுக்குத் தேவைப்பட்டால், நீங்கள் எந்த 2 டி முனையையும் செய்யலாம் (எடுத்துக்காட்டாக,: re: `கட்டுப்பாடு <class_control>` or: ref: `node2d <class_node2d>`-அடிப்படையிலான) தனிப்பயனையைப் பயன்படுத்தி திரையில் வரையவும் கட்டளைகள்.
uk: Godot має вузли для малювання спрайтів, багатокутників, частинок, тексту та багатьох інших поширених потреб для розробки ігор. Однак, якщо вам потрібно щось конкретне, не охоплене стандартними вузлами, ви можете змусити будь-який 2D-вузол (наприклад, :ref:`Control <class_Control>` або :ref:`Node2D <class_Node2D>`-базований) малювати на екрані за допомогою спеціальних команди.
zh_hans: Godot 有用于绘制精灵、多边形、粒子、文本以及其它各种游戏开发所需东西的节点。但是，如果这些标准节点不能满足你的特定需求，你可以通过自定义命令在屏幕上绘制任何 2D 节点（例如，基于 :ref:`Control <class_Control>` 或 :ref:`Node2D <class_Node2D>` ）。
zh_hant: Godot 內建了用於繪製精靈、Polygon、多邊形、粒子、文字等各種常見遊戲開發場景的節點。不過，如果你需要做一些標準節點無法覆蓋的特殊需求，可以讓任何 2D 節點（例如 :ref:`Control <class_Control>` 或 :ref:`Node2D <class_Node2D>` 衍生節點）用自訂繪圖指令直接在畫面上繪製。

source: Custom drawing in a 2D node is *really* useful. Here are some use cases:
de: Das manuelle Zeichnen in einem 2D-Node ist *wirklich* nützlich. Hier einige Beispiele, warum:
es: Dibujar manualmente en un nodo 2D es *realmente* útil, aquí hay algunos casos de uso:
fr: Le dessin personnalisé dans un nœud 2D est *vraiment* utile. Voici quelques cas d'utilisation :
ga: Tá líníocht saincheaptha i nód 2D* fíor-úsáideach. Seo roinnt cásanna úsáide:
pt_br: O desenho personalizado em um nó 2D é *realmente* útil. Aqui estão alguns casos de uso:
ru: Пользовательский рисунок в 2D узле *действительно* полезен.Вот несколько примеров, почему:
ta: 2 டி முனையில் தனிப்பயன் வரைதல் * உண்மையில் * பயனுள்ளதாக இருக்கும். சில பயன்பாட்டு வழக்குகள் இங்கே:
uk: Власне малювання в 2D вузлах *дійсно* корисне. Ось деякі випадки використання:
zh_hans: 2D 节点中的自定义绘制\ *非常*\ 有用。下面是一些用例：
zh_hant: 2D 節點中的自訂繪製*非常*有用。下面是一些用例：

source: Drawing shapes or logic that existing nodes can't do, such as an image with trails or a special animated polygon.
de: Zeichnen von Formen oder Logik, die vorhandene Nodes nicht leisten können, z. B. ein Bild mit Trails oder ein spezielles animiertes Polygon.
es: Dibujar formas o lógica que los nodos existentes no pueden hacer, como una imagen con estelas o un polígono animado especial.
fr: Dessiner des formes ou une logique que les nœuds existants ne peuvent pas faire, comme une image avec des traînées ou un polygone animé spécial.
ga: Cruthanna nó loighic a tharraingt nach féidir le nóid atá ann cheana a dhéanamh, mar shampla íomhá le cosáin nó polagún beoite speisialta.
pt_br: Desenhar formas ou lógica que os nós existentes não podem fazer, como uma imagem com rastros ou um polígono animado especial.
ru: Рисование фигур или логики, которые не обрабатываются узлами (пример: создание узла, который рисует круг, изображение со следами, особый вид анимированного многоугольника и т. д.).
ta: தடங்கள் கொண்ட படம் அல்லது சிறப்பு அனிமேசன் பலகோணம் போன்ற இருக்கும் முனைகள் செய்ய முடியாத வடிவங்கள் அல்லது வழக்கு வரைதல்.
uk: Малювання фігур, або логіки, які не можуть зробити існуючі вузли, наприклад, зображення зі слідами, або спеціальний анімований багатокутник.
zh_hans: 绘制现有节点类型无法完成的形状或逻辑，例如带有尾迹或特殊动态多边形的图像。
zh_hant: 繪製現有節點型別無法完成的形狀或邏輯，例如帶有軌跡或特殊動態多邊形的圖像。

source: Drawing a large number of simple objects, such as a grid or a board for a 2d game. Custom drawing avoids the overhead of using a large number of nodes, possibly lowering memory usage and improving performance.
de: Das Zeichnen einer großen Anzahl einfacher Objekte, z.B. eines Rasters oder eines Spielfelds für ein 2D-Spiel. Das benutzerdefinierte Zeichnen vermeidet den Overhead, der durch die Verwendung einer großen Anzahl von Nodes entsteht, und kann so die Speichernutzung verringern und die Performance verbessern.
es: Dibujar un gran número de objetos simples, como una cuadricula o un tablero para un juego 2D. El dibujo personalizado evita la sobrecarga del uso de nodos lo que lo hace menos intensivo en el uso de memoria y potencialmente más rápido.
fr: Dessiner un grand nombre d'objets simples, comme une grille ou une planche pour un jeu 2d. Le dessin personnalisé évite l'utilisation d'un grand nombre de nœuds, réduisant éventuellement l'utilisation de la mémoire et améliorant les performances.
ga: Líon mór rudaí simplí a tharraingt, mar shampla greille nó bord le haghaidh cluiche 2d. Seachnaíonn líníocht saincheaptha lasbhaird líon mór nóid a úsáid, b'fhéidir úsáid cuimhne a ísliú agus feidhmíocht a fheabhsú.
ru: Рисовать множество простых объектов, таких как сетка или поле для 2d-игры. Пользовательское рисование позволяет избежать накладных расходов, связанных с использованием большого количества узлов, что может снизить потребление памяти и поднять производительность.
ta: 2 டி விளையாட்டுக்கான கட்டம் அல்லது பலகை போன்ற அதிக எண்ணிக்கையிலான எளிய பொருள்களை வரைதல். தனிப்பயன் வரைதல் அதிக எண்ணிக்கையிலான முனைகளைப் பயன்படுத்துவதற்கான மேல்நிலையைத் தவிர்க்கிறது, நினைவக பயன்பாட்டைக் குறைத்து செயல்திறனை மேம்படுத்துகிறது.
uk: Малювання великої кількості простих об'єктів, таких як сітка або дошка для двовимірної гри. Настроюване креслення дозволяє уникнути накладних витрат на використання великої кількості вузлів, можливо, зменшуючи використання пам’яті та покращуючи продуктивність.
zh_hans: 绘制大量简单的对象，例如 2D 游戏中的一个栅格或一个面板。自定义绘制避免了使用大量节点的开销，能降低内存占用，并提高性能。
zh_hant: 繪製大量簡單物件，例如 2D 遊戲用的格線或棋盤。自訂繪圖可以避免使用大量節點帶來的額外負擔，有機會降低記憶體用量並提升效能。

source: Making a custom UI control. There are plenty of controls available, but when you have unusual needs, you will likely need a custom control.
de: Erstellen eines benutzerdefinierten UI-Steuerelements. Es gibt eine Vielzahl von Steuerelementen, aber wenn Sie ungewöhnliche Anforderungen haben, benötigen Sie wahrscheinlich ein benutzerdefiniertes Steuerelement.
es: Hacer un control de UI personalizado. Hay muchos nodos Control disponibles, Sin embargo, cuando tienes necesidades poco comunes, es probable que necesites un control personalizado.
fr: Création d'un contrôle d'interface utilisateur personnalisé. Il existe de nombreux contrôles disponibles, mais si vous avez des besoins inhabituels, vous aurez probablement besoin d'un contrôle personnalisé.
ga: Rialú saincheaptha UI a dhéanamh. Tá neart rialuithe ar fáil, ach nuair a bhíonn riachtanais neamhghnácha agat, is dócha go mbeidh rialú saincheaptha ag teastáil uait.
pt_br: Fazendo um controle de interface do usuário personalizado. Há muitos controles disponíveis, mas quando você tiver necessidades incomuns, provavelmente precisará de um controle personalizado.
ru: Создание пользовательского элемента управления пользовательского интерфейса (UI). Существует множество доступных элементов управления, но когда у вас есть нестандартные требования, вероятно, вам потребуется создать собственный элемент управления.
ta: தனிப்பயன் இடைமுகம் கட்டுப்பாட்டை உருவாக்குகிறது. ஏராளமான கட்டுப்பாடுகள் உள்ளன, ஆனால் உங்களுக்கு அசாதாரண தேவைகள் இருக்கும்போது, உங்களுக்கு தனிப்பயன் கட்டுப்பாடு தேவைப்படும்.
uk: Створення власного елемента керування інтерфейсом користувача. Доступно багато елементів керування, але коли у вас є незвичайні потреби, вам, ймовірно, знадобиться власний контроль.
zh_hans: 制作自定义的 UI 控件，以满足很多可用的控件之外的特别需求。
zh_hant: 製作自訂的 UI 控制項，以滿足很多可用的控制項之外的特別需求。

source: Drawing
de: Zeichnen
es: Dibujando
fr: Dessin
ga: Líníocht
it: Disegnare
pt_br: Desenhando
ru: Отрисовка
ta: வரைதல்
uk: Малюнок
zh_hans: 绘制
zh_hant: 繪製

source: Add a script to any :ref:`CanvasItem <class_CanvasItem>` derived node, like :ref:`Control <class_Control>` or :ref:`Node2D <class_Node2D>`. Then override the :ref:`_draw()<class_CanvasItem_private_method__draw>` function.
de: Fügen Sie ein Skript zu einem beliebigen von :ref:`CanvasItem <class_CanvasItem>` abgeleiteten Node hinzu, wie zum Beispiel :ref:`Control <class_Control>` oder :ref:`Node2D <class_Node2D>`. Überschreiben Sie dann die Funktion :ref:`_draw() <class_CanvasItem_private_method__draw>`.
es: Agrega un script a cualquier nodo derivado de :ref:`CanvasItem <class_CanvasItem>`, como :ref:`Control <class_Control>` o :ref:`Node2D <class_Node2D>`. Luego sobreescribe la función ``_draw()<class_CanvasItem_private_method__draw>``.
fr: Ajoutez un script à n'importe quel nœud dérivé de :ref:`CanvasItem <class_CanvasItem>`, comme :ref:`Control <class_Control>` ou :ref:`Node2D <class_Node2D>`. Puis remplacez la fonction :ref:`_draw()<class_CanvasItem_private_method__draw>`.
ga: Cuir script le haon :ref:`CanvasItem <class_CanvasItem>` nód díorthaithe, mar :ref:`Control <class_Control>` nó :ref:`Node2D <class_Node2D>`. Ansin sáraigh an fheidhm :ref:`_draw() <class_CanvasItem_private_method__draw>`.
ru: Добавьте скрипт к любому производному узлу :ref:`CanvasItem <class_CanvasItem>`, например :ref:`Control <class_Control>` или :ref:`Node2D <class_Node2D>`. Затем переопределите функцию :ref:`_draw()<class_CanvasItem_private_method__draw>`.
ta: ஏதேனும் ஒரு ச்கிரிப்டைச் சேர்க்கவும்: குறிப்பு: `canvasitem <class_canvasitem>` பெறப்பட்ட முனை, இது போன்றது: குறிப்பு: `கட்டுப்பாடு <class_control>` அல்லது: re: `node2d <class_node2d>`. பின்னர்: ref: `_draw () <class_canvasitem_private_method__draw>` செயல்பாடு.
uk: Додайте сценарій до будь-якого похідного вузла :ref:`CanvasItem <class_CanvasItem>`, наприклад :ref:`Control <class_Control>` або :ref:`Node2D <class_Node2D>`. Потім замініть функцію :ref:`_draw()<class_CanvasItem_private_method__draw>`.
zh_hans: 添加一个脚本到任何 :ref:`CanvasItem <class_CanvasItem>` 的派生节点，如 :ref:`Control <class_Control>` 或 :ref:`Node2D <class_Node2D>`\ 。然后重载 :ref:`_draw()<class_CanvasItem_private_method__draw>` 函数。
zh_hant: 將腳本新增到任何 :ref:`CanvasItem <class_CanvasItem>` 衍生節點（例如 :ref:`Control <class_Control>` 或 :ref:`Node2D <class_Node2D>`）上。然後覆寫 :ref:`_draw()<class_CanvasItem_private_method__draw>` 方法。

source: Draw commands are described in the :ref:`CanvasItem <class_CanvasItem>` class reference. There are plenty of them and we will see some of them in the examples below.
de: Es gibt viele Zeichenbefehle, die alle in der Klassenreferenz :ref:`CanvasItem <class_CanvasItem>` beschrieben werden. Es gibt viele davon, und wir werden einige davon in den folgenden Beispielen sehen.
es: Los comandos están descriptos en la referencia de la clase :ref:`CanvasItem <class_CanvasItem>`. Hay varios de ellos y los veremos algunos en los siguientes ejemplos.
fr: Les commandes de dessin sont décrites dans la référence de classe :ref:`CanvasItem <class_CanvasItem>`. Elles sont nombreuses et nous allons voir quelques exemples de celles-ci en dessous.
ga: Déantar cur síos ar orduithe tarraingthe sa :ref:`CanvasItem <class_CanvasItem>` tagairt ranga. Tá neart acu agus feicfimid cuid acu sna samplaí thíos.
ru: Команды рисования описаны в :ref:`CanvasItem <class_CanvasItem>`. Их прилично много, и мы посмотрим на них в примерах ниже.
ta: டிரா கட்டளைகள் விவரிக்கப்பட்டுள்ளன: ref: `Canvasitem <class_canvasitem>` வகுப்பு குறிப்பு. அவற்றில் ஏராளமானவை உள்ளன, அவற்றில் சிலவற்றை கீழே உள்ள எடுத்துக்காட்டுகளில் பார்ப்போம்.
uk: Команди малювання описані в довідці про клас :ref:`CanvasItem <class_CanvasItem>`. Їх багато, і ми побачимо деякі з них у прикладах нижче.
zh_hans: 绘制命令在 :ref:`CanvasItem <class_CanvasItem>` 的类参考中有所描述。绘制命令的数量很多，我们将在下面的示例中看到一些。
zh_hant: 繪圖指令的詳細說明可參見 :ref:`CanvasItem <class_CanvasItem>` 類別說明文件。這類指令非常多，下面範例會介紹其中幾個常用的。

source: Updating
de: Aktualisieren
es: Actualizando
fr: Mise à jour
ga: Nuashonrú
it: Aggiornamento
pt_br: Atualizando
ru: Обновление
ta: புதுப்பித்தல்
uk: Оновлення
zh_hans: 更新
zh_hant: 更新

source: The :ref:`_draw <class_CanvasItem_private_method__draw>` function is only called once, and then the draw commands are cached and remembered, so further calls are unnecessary.
de: Die Funktion :ref:`_draw <class_CanvasItem_private_method__draw>` wird nur einmal aufgerufen, und dann werden die Zeichenbefehle gecached und vermerkt, so dass weitere Aufrufe unnötig sind.
es: La función :ref:`_draw <class_CanvasItem_private_method__draw>` es llamada una vez, luego, los comandos de dibujo se almacenan en caché y se recuerdan, de modo que las llamadas adicionales son innecesarias.
fr: La fonction :ref:`_draw <class_CanvasItem_private_method__draw>` n'est appelée qu'une fois, puis les commandes de dessin sont mises en mémoire tampon et mémorisées, de sorte que les appels ultérieurs sont inutiles.
ga: Ní thugtar an fheidhm :ref:`_draw <class_CanvasItem_private_method__draw>` ach uair amháin, agus ansin déantar na horduithe tarraingthe a thaisceadh agus a mheabhrú, mar sin ní gá glaonna breise a dhéanamh.
ru: Функция :ref:`_draw <class_CanvasItem_private_method__draw>` вызывается только единожды, затем команды рисования кэшируются и запоминаются, поэтому в дальнейших вызовах нет необходимости.
ta: தி: ரெஃப்: `_ டிரா <class_canvasitem_private_method__draw>` செயல்பாடு ஒரு முறை மட்டுமே அழைக்கப்படுகிறது, பின்னர் டிரா கட்டளைகள் தற்காலிக சேமித்து வைக்கப்படுகின்றன, எனவே மேலும் அழைப்புகள் தேவையற்றவை.
uk: Функція :ref:`_draw <class_CanvasItem_private_method__draw>` викликається лише один раз, а потім команди малювання кешуються та запам’ятовуються, тому подальші виклики непотрібні.
zh_hans: :ref:`_draw <class_CanvasItem_private_method__draw>` 函数只调用一次，然后绘制命令被缓存并记住，因此不需要进一步调用。
zh_hant: :ref:`_draw <class_CanvasItem_private_method__draw>` 方法只會被呼叫一次，之後繪圖指令會被快取起來，所以不需要再重複呼叫。

source: If re-drawing is required because a variable or something else changed, call :ref:`CanvasItem.queue_redraw <class_CanvasItem_method_queue_redraw>` in that same node and a new ``_draw()`` call will happen.
de: Wenn ein erneutes Zeichnen erforderlich ist, weil sich eine Variable oder etwas anderes geändert hat, rufen Sie :ref:`CanvasItem.queue_redraw <class_CanvasItem_method_queue_redraw>` in demselben Node auf und ein neuer ``_draw()``-Aufruf wird erfolgen.
es: Si es necesario redibujar porque una variable o alguna otra cosa ha cambiado, llama :ref::ref:`CanvasItem.queue_redraw <class_CanvasItem_method_queue_redraw>` en el nodo y se llamará de nuevo a ``_draw()``.
fr: Si redessiner est nécessaire parce qu'une variable ou autre chose a changé, appelez :ref:`CanvasItem.queue_redraw <class_CanvasItem_method_queue_redraw>` dans ce même nœud et un nouvel appel ``_draw()`` se produira.
ga: Má theastaíonn ath-líníocht toisc gur athraigh athróg nó rud éigin eile, cuir glaoch ar :ref:`CanvasItem.queue_redraw <class_CanvasItem_method_queue_redraw>` sa nód céanna sin agus tarlóidh glao nua ``_draw()``.
ru: Если потребуется отрисовать все заново из-за изменения переменной или чего-то еще, вызовите :ref:`CanvasItem.queue_redraw <class_CanvasItem_method_queue_redraw>` в том же узле, и произойдет новый вызов ``_draw()``.
ta: ஒரு மாறி அல்லது வேறு ஏதாவது மாற்றப்பட்டதால் மறு-வரைதல் தேவைப்பட்டால், அழைக்கவும்: ref: `canvasitem.queue_readraw <class_canvasitem_methodem_method_queue_redraw>` அதே முனையில் மற்றும் ஒரு புதிய `` _draw () `` அழைப்பு நடக்கும்.
uk: Якщо потрібне повторне малювання через зміну змінної або щось інше, викличте :ref:`CanvasItem.queue_redraw <class_CanvasItem_method_queue_redraw>` у тому самому вузлі, і відбудеться новий виклик ``_draw()``.
zh_hans: 如果因为状态或其他方面的变化而需要重新绘制，在当前节点中调用 :ref:`CanvasItem.queue_redraw <class_CanvasItem_method_queue_redraw>` ，触发新的 ``_draw()`` 调用。
zh_hant: 如果變數或狀態改變後需要重繪，只要在該節點呼叫 :ref:`CanvasItem.queue_redraw <class_CanvasItem_method_queue_redraw>`，就會觸發新的 ``_draw()`` 呼叫。

source: Here is a little more complex example, where we have a texture variable that can be modified at any time, and using a :ref:`setter<doc_gdscript_basics_setters_getters>`, it forces a redraw of the texture when modified:
de: Hier ist ein etwas komplexeres Beispiel, bei dem wir eine Texturvariable haben, die jederzeit geändert werden kann, und mit einem :ref:`setter<doc_gdscript_basics_setters_getters>` ein Neuzeichnen der Textur erzwingen, wenn sie geändert wird:
es: Aquí hay un ejemplo un poco más complejo, donde tenemos una variable de textura que se puede modificar en cualquier momento, y usando un :ref:`setter<doc_gdscript_basics_setters_getters>`, fuerza un redibujado de la textura cuando se modifica:
fr: Voici un exemple un peu plus complexe, où nous avons une variable de texture qui peut être modifiée à tout moment, et à l'aide d'un :ref:`setter<doc_gdscript_basics_setters_getters>`, il force un redessin de la texture lorsqu'elle est modifiée :
ga: Seo sampla beagán níos casta, áit a bhfuil athróg uigeachta againn is féidir a mhodhnú am ar bith, agus ag baint úsáide as :ref:`setter <doc_gdscript_basics_setters_getters>`, cuireann sé iallach air an uigeacht a atarraingt nuair a athraítear é:
pt_br: Aqui está um exemplo um pouco mais complexo, onde temos uma variável de textura que pode ser modificada a qualquer momento e, usando um :ref:`setter<doc_gdscript_basics_setters_getters>`, ela força um redesenho da textura quando modificada:
ru: Вот немного более сложный пример, где у нас есть переменная текстуры, которую можно изменить в любое время, и использование :ref:`setter<doc_gdscript_basics_setters_getters>`, которое принудительно перерисовывает текстуру при изменении:
ta: இங்கே இன்னும் கொஞ்சம் சிக்கலான எடுத்துக்காட்டு, எந்த நேரத்திலும் மாற்றியமைக்கக்கூடிய ஒரு அமைப்பு மாறியாக எங்களிடம் உள்ளது, மேலும் ஒரு: குறிப்பு: `செட்டர் <doc_gdscript_basics_setters_getters>`, இது மாற்றியமைக்கும்போது அமைப்பின் மறுவடிவமைப்பை கட்டாயப்படுத்துகிறது:
uk: Ось трохи складніший приклад, де у нас є змінна текстури, яку можна змінити в будь-який час, і використовуючи :ref:`setter<doc_gdscript_basics_setters_getters>`, вона примусово перемальовує текстуру під час зміни:
zh_hans: 这是一个稍微复杂一点的例子，我们有一个可以被随时修改的纹理变量，并且使用一个 :ref:`setter<doc_gdscript_basics_setters_getters>`，它在纹理被修改时强制一次该纹理的重绘：
zh_hant: 以下是一個稍微複雜一點的範例，我們有一個可以隨時修改的貼圖變數，並且透過 :ref:`setter<doc_gdscript_basics_setters_getters>`，在貼圖變更時強制重繪：
