Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/custom_drawing_*_2d.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, uk, zh_hans, zh_hant

source: Example 2: drawing a dynamic line
de: Beispiel 2: Zeichnen einer dynamischen Linie
es: Ejemplo 2: dibujando una linea dinámica
fr: Exemple 2 : dessiner une ligne dynamique
ga: Sampla 2: líne dinimiciúil a tharraingt
ru: Пример 2: рисование линии в динамике
ta: எடுத்துக்காட்டு 2: மாறும் வரியை வரைதல்
uk: Приклад 2: малювання динамічної лінії
zh_hans: 示例 2：绘制动态线条
zh_hant: 範例 2：繪製動態線段

source: The previous example was useful to learn how to draw and modify nodes with custom shapes and animations. This could have some advantages, such as using exact coordinates and vectors for drawing, rather than bitmaps -which means they will scale well when transformed on screen. In some cases, similar results could be achieved composing higher level functionality with nodes such as :ref:`sprites<class_Sprite2D>` or :ref:`AnimatedSprites<class_AnimatedSprite2D>` loading SVG resources (which are also images defined with vectors) and the :ref:`AnimationPlayer<class_AnimationPlayer>` node.
de: Das vorherige Beispiel war nützlich, um zu lernen, wie man Nodes mit benutzerdefinierten Shapes und Animationen zeichnet und verändert. Dies könnte einige Vorteile haben, wie z.B. die Verwendung von exakten Koordinaten und Vektoren zum Zeichnen anstelle von Bitmaps - was bedeutet, dass sie bei der Transformation auf dem Bildschirm gut skaliert werden. In einigen Fällen könnten ähnliche Ergebnisse erzielt werden, indem man Funktionen auf höherer Ebene mit Nodes wie :ref:`sprites<class_Sprite2D>` oder :ref:`AnimatedSprites<class_AnimatedSprite2D>`, die SVG-Ressourcen laden (die ebenfalls mit Vektoren definierte Bilder sind), und dem Node :ref:`AnimationPlayer<class_AnimationPlayer>` kombiniert.
es: El ejemplo anterior fue útil para aprender a dibujar y modificar nodos con formas y animaciones personalizadas. Esto podría tener algunas ventajas, como utilizar coordenadas y vectores exactos para dibujar, en lugar de mapas de bits, lo que significa que se escalarán bien cuando se transformen en la pantalla. En algunos casos, se podrían lograr resultados similares componiendo funcionalidades de nivel superior con nodos como :ref:`sprites<class_Sprite2D>` o :ref:`AnimatedSprites<class_AnimatedSprite2D>` cargando recursos SVG (que también son imágenes definidas con vectores) y el nodo :ref:`AnimationPlayer<class_AnimationPlayer>`.
fr: L'exemple précédent était utile pour apprendre à dessiner et modifier des nœuds avec des formes et des animations personnalisées. Cela pourrait avoir certains avantages, comme l'utilisation de coordonnées et de vecteurs exacts pour le dessin, plutôt que des bitmaps, ce qui signifie qu'ils s'adapteront bien lorsqu'ils seront transformés à l'écran. Dans certains cas, des résultats similaires pourraient être obtenus en composant des fonctionnalités de plus haut niveau avec des nœuds tels que :ref:`sprites<class_Sprite2D>` ou :ref:`AnimatedSprites<class_AnimatedSprite2D>` chargeant des ressources SVG (qui sont également des images définies avec des vecteurs) et le nœud :ref:`AnimationPlayer<class_AnimationPlayer>`.
ga: Bhí an sampla roimhe seo úsáideach chun foghlaim conas nóid a tharraingt agus a mhodhnú le cruthanna agus beochan saincheaptha. D’fhéadfadh roinnt buntáistí a bheith leis seo, mar shampla comhordanáidí agus veicteoirí cruinne a úsáid le haghaidh líníochta, seachas giotáin - rud a chiallaíonn go mbeidh siad ag scála go maith nuair a dhéantar iad a chlaochlú ar an scáileán. I gcásanna áirithe, d’fhéadfaí torthaí comhchosúla a bhaint amach trí fheidhmiúlacht ardleibhéil a chumadh le nóid mar :ref:`sprites<class_Sprite2D>` nó :ref:`AnimatedSprites<class_AnimatedSprite2D>` ag luchtú acmhainní SVG (ar íomhánna iad freisin arna sainmhíniú le veicteoirí) agus an :ref:`AnimationPlayer<class_AnimationPlayer>` nód.
pt_br: O exemplo anterior foi útil para aprender como desenhar e modificar nós com formas e animações personalizadas. Isso pode ter algumas vantagens, como o uso de coordenadas e vetores exatos para o desenho, em vez de bitmaps – o que significa que eles escalarão bem quando transformados na tela. Em alguns casos, resultados semelhantes podem ser alcançados compondo funcionalidades de nível mais alto com nós como :ref:`sprites<class_Sprite2D>` ou :ref:`AnimatedSprites<class_AnimatedSprite2D>` carregando recursos SVG (que também são imagens definidas com vetores) e o nó :ref:`AnimationPlayer<class_AnimationPlayer>`.
ru: Предыдущий пример был полезен для изучения того, как рисовать и изменять узлы с помощью пользовательских фигур и анимаций. Это может иметь некоторые преимущества, такие как использование точных координат и векторов для рисования, а не растровых изображений, что означает, что они будут хорошо масштабироваться при трансформации на экране. В некоторых случаях похожих результатов можно достичь, составляя функциональность более высокого уровня с узлами, такими как :ref:`sprites<class_Sprite2D>` или :ref:`AnimatedSprites<class_AnimatedSprite2D>`, загружающими ресурсы SVG (которые также являются изображениями, определенными с помощью векторов), и узлом :ref:`AnimationPlayer<class_AnimationPlayer>`.
ta: தனிப்பயன் வடிவங்கள் மற்றும் அனிமேசன்களுடன் முனைகளை எவ்வாறு வரையலாம் மற்றும் மாற்றுவது என்பதை அறிய முந்தைய எடுத்துக்காட்டு பயனுள்ளதாக இருந்தது. இது பிட்மாப்சைக் காட்டிலும், சரியான ஆயத்தொகுதிகள் மற்றும் திசையன்களைப் பயன்படுத்துவது போன்ற சில நன்மைகளைக் கொண்டிருக்கக்கூடும் -அதாவது திரையில் மாற்றப்படும்போது அவை நன்றாக அளவிடப்படும். சில சந்தர்ப்பங்களில், இதேபோன்ற முடிவுகள் போன்ற முடிவுகளை அடைய முடியும்: ref: `ச்ப்ரைட்ச் <class_sprite2d>` அல்லது: yar: `அனிமேசன்ச்பிரைட்ச் <class_animatedsprite2d>` எச்.வி.சி வளங்களையும் ஏற்றுகிறது (அவை வெக்டர்களுடன் வரையறுக்கப்பட்ட படங்கள்) மற்றும் தி : குறிப்பு: `அனிமேசன் பிளேயர் <class_animationPlayer>` முனை.
uk: Попередній приклад був корисним, щоб навчитися малювати та змінювати вузли за допомогою власних форм і анімації. Це може мати деякі переваги, наприклад використання точних координат і векторів для малювання замість растрових зображень, що означає, що вони добре масштабуються під час трансформації на екрані. У деяких випадках подібних результатів можна досягти, створивши функціональні можливості вищого рівня з такими вузлами, як :ref:`sprites<class_Sprite2D>` або :ref:`AnimatedSprites<class_AnimatedSprite2D>`, завантажуючи ресурси SVG (які також є зображеннями, визначеними за допомогою векторів) і :ref:`AnimationPlayer<class_AnimationPlayer>` вузол.
zh_hans: 先前示例展示了如何使用自定义形状和动画绘制和修改节点。这种方法具有一些优势，如使用精确坐标和向量进行绘制，而不是位图（在屏幕上缩放时仍然清晰）。在某些情况下，也可以通过组合如 :ref:`sprites<class_Sprite2D>` 或 :ref:`AnimatedSprites<class_AnimatedSprite2D>` 等高级功能与节点来实现类似的效果，这些节点可以加载 SVG 格式资源，并使用 :ref:`AnimationPlayer<class_AnimationPlayer>` 节点。
zh_hant: 前面的範例讓你學會了如何用自訂形狀和動畫來繪製和修改節點。這種做法有一些優點，例如可用精確座標與向量繪圖（不是用點陣圖），因此在螢幕縮放時會維持品質。有時候也可以用更高階的元件組合出類似效果，例如用 :ref:`Sprite2D<class_Sprite2D>`、:ref:`AnimatedSprite2D<class_AnimatedSprite2D>` 載入 SVG 資源（SVG 也是向量圖），搭配 :ref:`AnimationPlayer<class_AnimationPlayer>` 節點。

source: In other cases that will not be possible because we will not know what the resulting graphical representation will be before running the code. Here we will see how to draw a dynamic line whose coordinates are not known beforehand, and are affected by the user's input.
de: In anderen Fällen ist das nicht möglich, weil wir vor der Ausführung des Codes nicht wissen, wie die resultierende grafische Darstellung aussehen wird. Hier werden wir sehen, wie man eine dynamische Linie zeichnet, deren Koordinaten vorher nicht bekannt sind und die von den Eingaben des Benutzers beeinflusst werden.
es: En otros casos eso no será posible porque no sabremos cuál será la representación gráfica resultante antes de ejecutar el código. Aquí veremos cómo dibujar una línea dinámica cuyas coordenadas no se conocen de antemano y se ven afectadas por la entrada del usuario.
fr: Dans d'autres cas, ce ne sera pas possible parce que nous ne saurons pas ce que la représentation graphique résultante sera avant d'exécuter le code. Ici, nous verrons comment dessiner une ligne dynamique dont les coordonnées ne sont pas connues à l'avance, et sont affectées par l'entrée de l'utilisateur.
ga: I gcásanna eile ní bheidh sé indéanta toisc nach mbeidh a fhios againn cad é an léiriú grafach a bheidh mar thoradh air sula rith an cód. Feicfimid anseo conas líne dhinimiciúil a tharraingt nach bhfuil a gcomhordanáidí ar eolas roimh ré, agus a mbíonn tionchar ag ionchur an úsáideora orthu.
pt_br: Em outros casos isso não será possível, pois não saberemos qual será a representação gráfica resultante antes de executar o código. Aqui veremos como desenhar uma linha dinâmica cujas coordenadas não são conhecidas previamente e são afetadas pela entrada do usuário.
ru: В других случаях это будет невозможно, поскольку мы не будем знать, каким будет итоговое графическое представление до запуска кода. Здесь мы увидим, как нарисовать динамическую линию, координаты которой заранее неизвестны и на которые влияет ввод пользователя.
ta: சாத்தியமில்லாத பிற சந்தர்ப்பங்களில், குறியீட்டை இயக்குவதற்கு முன்பு இதன் விளைவாக வரும் வரைகலை பிரதிநிதித்துவம் என்னவாக இருக்கும் என்று எங்களுக்குத் தெரியாது. ஒரு மாறும் வரியை எவ்வாறு வரையலாம் என்பதை இங்கே காண்போம், அதன் ஆயத்தொகுப்புகள் முன்பே அறியப்படவில்லை, மேலும் பயனரின் உள்ளீட்டால் பாதிக்கப்படுகின்றன.
uk: В інших випадках це буде неможливо, оскільки ми не будемо знати, яким буде кінцеве графічне представлення до запуску коду. Тут ми побачимо, як намалювати динамічну лінію, координати якої невідомі заздалегідь і на які впливає введення користувача.
zh_hans: 在其他情况下这种方法不可行，因为我们无法预先知道运行代码后图形的表现形式。本节将介绍如何绘制动态线条，其坐标事先未知，并且会受到用户输入的影响。
zh_hant: 有些情況下，執行前並不知道圖形的最終樣貌，因此無法預先準備。這裡我們會示範如何畫出一條座標未知、會根據使用者輸入動態變化的線段。

source: Drawing a straight line between 2 points
de: Zeichnen einer geraden Linie zwischen 2 Punkten
es: Dibujar una línea recta entre 2 puntos
fr: Dessiner une ligne droite entre 2 points
ga: Líne dhíreach a tharraingt idir 2 phointe
pt_br: Desenhando uma linha reta entre 2 pontos
ru: Проведем прямую линию между 2 точек
ta: 2 புள்ளிகளுக்கு இடையில் ஒரு நேர் கோட்டை வரைதல்
uk: Проведення прямої між 2 точками
zh_hans: 在两点之间绘制直线
zh_hant: 繪製兩點之間的直線

source: Let's assume we want to draw a straight line between 2 points, the first one will be fixed on the upper left corner ``(0, 0)`` and the second will be defined by the cursor position on screen.
de: Nehmen wir an, wir wollen eine gerade Linie zwischen zwei Punkten zeichnen, wobei der erste Punkt in der oberen linken Ecke ``(0, 0)`` liegt und der zweite Punkt durch die Position des Cursors auf dem Bildschirm bestimmt wird.
es: Supongamos que queremos dibujar una línea recta entre 2 puntos, el primero estará fijo en la esquina superior izquierda ``(0, 0)`` y el segundo estará definido por la posición del cursor en la pantalla.
fr: Supposons que nous voulions dessiner une ligne droite entre deux points : le premier sera fixé dans le coin supérieur gauche ``(0, 0)`` et le second sera défini par la position du curseur à l'écran.
ga: Glacaimis leis gur mhaith linn líne dhíreach a tharraingt idir 2 phointe, socraítear an chéad cheann ar an gcúinne uachtarach ar chlé ``(0, 0)`` agus sainmhínífear an dara ceann ag suíomh an chúrsóra ar an scáileán.
pt_br: Vamos supor que queremos desenhar uma linha reta entre 2 pontos, o primeiro será fixado no canto superior esquerdo ``(0, 0)`` e o segundo será definido pela posição do cursor na tela.
ru: Предположим, мы хотим нарисовать прямую линию между двумя точками, первая из которых будет зафиксирована в верхнем левом углу ``(0, 0)``, а вторая будет определяться положением курсора на экране.
ta: 2 புள்ளிகளுக்கு இடையில் ஒரு நேர் கோட்டை வரைய விரும்புகிறோம் என்று வைத்துக் கொள்வோம், முதலாவது மேல் இடது மூலையில் `` (0, 0) `` மற்றும் இரண்டாவது திரையில் கர்சர் நிலை மூலம் வரையறுக்கப்படும்.
uk: Припустімо, що ми хочемо намалювати пряму лінію між 2 точками, перша з яких буде зафіксована у верхньому лівому куті ``(0, 0)``, а друга буде визначена позицією курсора на екрані.
zh_hans: 假设我们想要绘制一条连接两个点的直线，第一个点固定在屏幕左上角 ``(0, 0)`` ，第二个点由屏幕上的光标位置决定。
zh_hant: 假設我們要畫一條連接兩點的直線，第一個點固定在左上角 ``(0, 0)``，第二個點則由螢幕上的游標位置決定。

source: We could draw a dynamic line between those 2 points like this:
de: Wir könnten eine dynamische Linie zwischen diesen beiden Punkten wie folgt ziehen:
es: Podríamos trazar una línea dinámica entre esos 2 puntos así:
fr: Nous pourrions dessiner une ligne dynamique entre ces deux points comme ceci :
ga: D'fhéadfaimis líne dinimiciúil a tharraingt idir na 2 phointe sin mar seo:
pt_br: Poderíamos traçar uma linha dinâmica entre esses dois pontos assim:
ru: Мы могли бы провести динамическую линию между этими двумя точками следующим образом:
ta: இது போன்ற அந்த 2 புள்ளிகளுக்கு இடையில் ஒரு மாறும் கோட்டை நாம் வரைய முடியும்:
uk: Ми могли б провести динамічну лінію між цими двома точками так:
zh_hans: 可以像这样绘制这两个点之间的动态的线：
zh_hant: 可以用下列方式畫出這兩點之間的動態直線：

source: In this example we obtain the position of the mouse in the default viewport every frame with the method :ref:`get_mouse_position <class_Viewport_method_get_mouse_position>`. If the position has changed since the last draw request (a small optimization to avoid redrawing on every frame)- we will schedule a redraw. Our ``_draw()`` method only has one line: requesting the drawing of a green line of width 10 pixels between the top left corner and that obtained position.
de: In diesem Beispiel erhalten wir die Position der Maus im Default-Viewport in jedem Frame mit der Methode :ref:`get_mouse_position <class_Viewport_method_get_mouse_position>`. Wenn sich die Position seit der letzten Zeichenanforderung geändert hat (eine kleine Optimierung, um ein erneutes Zeichnen bei jedem Frame zu vermeiden), werden wir ein erneutes Zeichnen einplanen. Unsere Methode ``_draw()`` hat nur eine Zeile: Sie fordert das Zeichnen einer grünen Linie mit einer Breite von 10 Pixeln zwischen der oberen linken Ecke und der ermittelten Position an.
es: En este ejemplo obtenemos la posición del puntero del ratón en la ventana gráfica predeterminada en cada frame con el método :ref:`get_mouse_position <class_Viewport_method_get_mouse_position>`. Si la posición ha cambiado desde la última solicitud de dibujo (una pequeña optimización para evitar volver a dibujar en cada frame), programaremos un nuevo redibujo. Nuestro método ``_draw()`` solo tiene una línea: solicitando el dibujo de una línea verde de 10 píxeles de ancho entre la esquina superior izquierda y la posición obtenida.
fr: Dans cet exemple, nous obtenons la position de la souris dans la vue par défaut à chaque frame avec la méthode :ref:`get_mouse_position <class_Viewport_method_get_mouse_position>`. Si la position a changé depuis la dernière requête **draw** (une petite optimisation pour éviter de redessiner à chaque frame), nous planifierons un nouveau **draw**. Notre méthode ``_draw()`` ne contient qu'une seule ligne : **draw** d'une ligne verte d'une largeur de 10 pixels entre le coin supérieur gauche et la position obtenue.
ga: Sa sampla seo faightear suíomh na luiche sa radharc réamhshocraithe gach fráma leis an modh :ref:`get_mouse_position <class_Viewport_method_get_mouse_position>`. Má tá athrú tagtha ar an scéal ón iarratas ar tharraingt dheireanach (leas iomlán a bhaint as chun aththarraingt ar gach fráma a sheachaint) - déanfaimid aththarraingt a sceidealú. Níl ach líne amháin ag ár modh `` _draw()``: ag iarraidh líne glas ar leithead 10 picteilín a tharraingt idir an chúinne uachtarach ar chlé agus an suíomh a fuarthas.
pt_br: Neste exemplo, obtemos a posição do mouse na janela de exibição padrão a cada frame com o método :ref:`get_mouse_position <class_Viewport_method_get_mouse_position>`. Se a posição tiver mudado desde o último pedido de desenho (uma pequena otimização para evitar redesenhar a cada frame), agendamos um redesenho. Nosso método ``_draw()`` possui somente uma linha: solicitar o desenho de uma linha verde com 10 pixels de largura entre o canto superior esquerdo e a posição obtida.
ru: В этом примере мы получаем позицию мыши в области просмотра по умолчанию в каждом кадре с помощью метода :ref:`get_mouse_position <class_Viewport_method_get_mouse_position>`. Если позиция изменилась с момента последнего запроса на отрисовку (небольшая оптимизация, чтобы избежать перерисовки в каждом кадре) - мы запланируем перерисовку. Наш метод ``_draw()`` имеет только одну строку: запрос на отрисовку зеленой линии шириной 10 пикселей между верхним левым углом и полученной позицией.
ta: இந்த எடுத்துக்காட்டில், இயல்புநிலை காட்சியமைப்பில் ஒவ்வொரு சட்டகத்திலும் சுட்டியின் நிலையை முறையுடன் பெறுகிறோம்: குறிப்பு: `get_mouse_position <class_viewport_method_get_mouse_position>`. கடைசி டிரா கோரிக்கையிலிருந்து நிலை மாறிவிட்டால் (ஒவ்வொரு சட்டகத்திலும் மறுவடிவமைப்பதைத் தவிர்ப்பதற்கான ஒரு சிறிய தேர்வுமுறை)- நாங்கள் ஒரு மறுவடிவமைப்பை திட்டமிடுவோம். எங்கள் `` _draw () `` முறைக்கு ஒரு வரியை மட்டுமே கொண்டுள்ளது: மேல் இடது மூலையில் 10 பிக்சல்களின் பச்சைக் கோட்டைக் கோருகிறது மற்றும் அந்த நிலையைப் பெற்றது.
uk: У цьому прикладі ми отримуємо положення миші у вікні перегляду за замовчуванням у кожному кадрі за допомогою методу :ref:`get_mouse_position <class_Viewport_method_get_mouse_position>`. Якщо позиція змінилася з моменту останнього запиту на розіграш (невелика оптимізація, щоб уникнути перемальовування кожного кадру), ми заплануємо перемальовування. Наш метод ``_draw()`` має лише один рядок: запит на малювання зеленої лінії шириною 10 пікселів між верхнім лівим кутом і отриманою позицією.
zh_hans: 在这个例子中，我们在每一帧都使用 :ref:`get_mouse_position <class_Viewport_method_get_mouse_position>` 方法获取鼠标在默认视口中的位置。如果位置与上次绘制请求时相比发生了变化（小优化，避免在每一帧都重新绘制），而进行一次重新绘制。\ ``_draw()`` 方法只有一行代码：请求绘制一条绿色线条，宽度为 10 像素，左上角和获取到的坐标之间。
zh_hant: 這個範例中，我們每一禎都用 :ref:`get_mouse_position<class_Viewport_method_get_mouse_position>` 取得滑鼠在預設視口中的位置。如果位置自上次繪製以來有變化（這樣可以避免每一禎都重繪），就安排重繪。``_draw()`` 方法只會畫一條線：從左上角到滑鼠位置的綠色線段，寬度為 10 像素。

source: The width, color, and position of the starting point can be configured with with the corresponding properties.
de: Die Breite, Farbe und Position des Startpunktes kann mit den entsprechenden Propertys konfiguriert werden.
es: El ancho, color y posición del punto inicial pueden ser configurados con las propiedades correspondientes.
fr: La largeur, la couleur et la position du point de départ peuvent être configurées avec les propriétés correspondantes.
ga: Is féidir leithead, dath agus suíomh an phointe tosaigh a chumrú leis na hairíonna comhfhreagracha.
it: La larghezza, il colore e la posizione del punto di partenza possono essere configurati con le proprietà corrispondenti.
ru: Ширину, цвет и положение начальной точки можно настроить с помощью соответствующих свойств.
ta: தொடக்க புள்ளியின் அகலம், நிறம் மற்றும் நிலை ஆகியவை தொடர்புடைய பண்புகளுடன் கட்டமைக்கப்படலாம்.
uk: Ширину, колір і положення початкової точки можна налаштувати за допомогою відповідних властивостей.
zh_hans: 起始点的宽度、颜色和位置可以通过相应的属性进行配置。
zh_hant: 線段的寬度、顏色和起點位置都可以用對應的屬性來設定。

source: It should look like this when run:
de: Nach der Ausführung sollte es wie folgt aussehen:
es: Debería verse como esto al ejecutarse:
fr: Il devrait ressembler à ça une fois exécuté :
ga: Ba chóir go mbeadh cuma seo air nuair a bheidh á rith:
it: Quando viene eseguito dovrebbe apparire così:
ru: При запуске, мы увидим следующее:
ta: ஓடும்போது இது இப்படி இருக்க வேண்டும்:
uk: Під час запуску це має виглядати так:
zh_hans: 运行时，它应当看起来像这样：
zh_hant: 執行時效果如下：

source: Drawing an arc between 2 points
de: Zeichnen eines Bogens zwischen 2 Punkten
es: Dibujar un arco entre 2 puntos
fr: Dessiner un arc entre 2 points
ga: Ag tarraingt stua idir 2 phointe
pt_br: Desenhando um arco entre 2 pontos
ru: Рисование дуги между 2 точками
ta: 2 புள்ளிகளுக்கு இடையில் ஒரு வளைவை வரைதல்
uk: Проведення дуги між 2 точками
zh_hans: 绘制两点之间的弧线
zh_hant: 繪製兩點之間的圓弧

source: The above example works, but we may want to join those 2 points with a different shape or function, other than a straight line.
de: Das obige Beispiel funktioniert, aber wir möchten diese 2 Punkte vielleicht mit einem anderen Shape oder einer anderen Funktion als einer geraden Linie verbinden.
es: El ejemplo anterior funciona, pero es posible que queramos unir esos 2 puntos con una forma o función diferente, que no sea una línea recta.
fr: L'exemple ci-dessus fonctionne, mais nous pourrions vouloir relier ces deux points avec une forme ou une fonction différente, autre qu'une ligne droite.
ga: Oibríonn an sampla thuas, ach b'fhéidir gur mhaith linn na 2 phointe sin a cheangal le cruth nó feidhm difriúil, seachas líne dhíreach.
pt_br: O exemplo acima funciona, mas talvez queiramos unir esses dois pontos com uma forma ou função diferente, que não seja uma linha reta.
ru: Пример выше работает, но мы можем захотеть присоединить эти 2 точки с другой формой или функцией, отличной от прямой линии.
ta: மேலே உள்ள எடுத்துக்காட்டு செயல்படுகிறது, ஆனால் அந்த 2 புள்ளிகளை ஒரு நேர் கோட்டைத் தவிர வேறு வடிவம் அல்லது செயல்பாட்டுடன் சேர விரும்பலாம்.
uk: Наведений вище приклад працює, але ми можемо захотіти з’єднати ці 2 точки з іншою формою або функцією, відмінною від прямої лінії.
zh_hans: 上面的例子可以实现效果，但有时可能想用除直线以外的形状或函数连接这两个点。
zh_hant: 上面的範例可以運作，不過有時候你可能想用直線以外的形狀或方式連接這兩個點。

source: Let's try now creating an arc (a portion of a circumference) between both points.
de: Versuchen wir nun, einen Bogen (einen Teil eines Kreises) zwischen beiden Punkten zu erstellen.
es: Intentemos ahora crear un arco (una porción de circunferencia) entre ambos puntos.
fr: Essayons maintenant de créer un arc (une portion de circonférence) entre les deux points.
ga: Déanaimis iarracht stua (cuid de imlíne) a chruthú idir an dá phointe.
pt_br: Vamos tentar agora criar um arco (uma parte de uma circunferência) entre os dois pontos.
ru: Давайте попробуем создать дугу (часть окружности) между двумя точками.
ta: இரண்டு புள்ளிகளுக்கும் இடையில் ஒரு வளைவை (ஒரு சுற்றளவு ஒரு பகுதி) உருவாக்க முயற்சிப்போம்.
uk: Давайте спробуємо створити дугу (частину окружності) між обома точками.
zh_hans: 让我们尝试在两个点之间创建一个弧线（圆周的一部分）。
zh_hant: 這次我們試著在兩點間畫出一段圓弧（圓的一部分）。

source: Exporting the line starting point, segments, width, color, and antialiasing will allow us to modify those properties very easily directly from the editor inspector panel:
de: Durch den Export von Startpunkt, Segmenten, Breite, Farbe und Antialiasing können wir diese Propertys sehr einfach direkt im Inspektorfenster des Editors ändern:
es: Exportar el punto de inicio de la línea, los segmentos, el ancho, el color y el suavizado nos permitirá modificar esas propiedades muy fácilmente directamente desde el panel del inspector del editor:
fr: Exporter le point de départ de la ligne, les segments, la largeur, la couleur et l'anticrénelage nous permettra de modifier ces propriétés très facilement directement depuis le panneau de l'inspecteur de l'éditeur :
ga: Ligfidh pointe tosaigh na líne, deighleoga, leithead, dath agus frith-aliasing a easpórtáil dúinn na hairíonna sin a mhodhnú go héasca go díreach ó phainéal an chigire eagarthóra:
pt_br: Exportar o ponto inicial da linha, segmentos, largura, cor e antialiasing nos permitirá modificar essas propriedades facilmente, diretamente do painel do Inspetor do editor:
ru: Экспортируя стартовую точку линии, сегменты, длину, цвет и сглаживание позволит нам очень просто модифицировать эти свойства напрямую из панели инспектора:
ta: வரி தொடக்கப் புள்ளி, பிரிவுகள், அகலம், நிறம் மற்றும் ஆன்டிலியாசிங் ஆகியவற்றை ஏற்றுமதி செய்வது அந்த பண்புகளை எடிட்டர் இன்ச்பெக்டர் பேனலில் இருந்து மிக எளிதாக மாற்ற அனுமதிக்கும்:
uk: Експорт початкової точки лінії, сегментів, ширини, кольору та згладжування дозволить нам дуже легко змінювати ці властивості безпосередньо з панелі інспектора редактора:
zh_hans: 通过将线段的起始点、段数、宽度、颜色和抗锯齿属性导出为变量，从而可在编辑器检查器面板中方便修改这些属性：
zh_hant: 如果將線的起點、分段數、寬度、顏色與抗鋸齒等屬性導出（export），就可以直接在編輯器屬性面板輕鬆調整這些參數：
