Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/custom_drawing_*_2d.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, uk, zh_hans, zh_hant

source: To draw the arc, we can use the method :ref:`draw_arc<class_CanvasItem_method_draw_arc>`. There are many arcs that pass through 2 points, so we will chose for this example the semicircle that has its center in the middle point between the 2 initial points.
de: Um den Bogen zu zeichnen, können wir die Methode :ref:`draw_arc<class_CanvasItem_method_draw_arc>` verwenden. Es gibt viele Bögen, die durch 2 Punkte gehen, also werden wir für dieses Beispiel den Halbkreis wählen, der seinen Mittelpunkt im mittleren Punkt zwischen den 2 Anfangspunkten hat.
es: Para dibujar el arco, podemos usar el método :ref:`draw_arc<class_CanvasItem_method_draw_arc>`. Hay muchos arcos que pasan por 2 puntos, por eso elegiremos para este ejemplo el semicírculo que tiene su centro en el punto medio entre los 2 puntos iniciales.
fr: Pour dessiner l'arc, nous pouvons utiliser la méthode :ref:draw_arc<class_CanvasItem_method_draw_arc>. Il existe de nombreux arcs qui passent par deux points, donc pour cet exemple, nous choisirons le demi-cercle dont le centre se trouve au point médian entre les deux points initiaux.
ga: Chun an stua a tharraingt, is féidir linn an modh a úsáid :tag:`draw_arc<class_CanvasItem_method_draw_arc>`. Is iomaí stua a théann trí 2 phointe, mar sin roghnóimid don sampla seo an leathchiorcal a bhfuil a lárphointe sa lárphointe idir an 2 phointe tosaigh.
pt_br: Para desenhar o arco, podemos usar o método :ref:`draw_arc<class_CanvasItem_method_draw_arc>`. Existem muitos arcos que passam por 2 pontos, então, para este exemplo, escolheremos o semicírculo cujo centro está no ponto médio entre os 2 pontos iniciais.
ru: Чтобы нарисовать дугу, мы можем использовать метод :ref:`draw_arc<class_CanvasItem_method_draw_arc>`. Существует множество дуг, проходящих через 2 точки, поэтому мы выберем для этого примера полукруг с центром в средней точке между 2 начальными точками.
ta: வளைவை வரைய, நாம் முறையைப் பயன்படுத்தலாம்: குறிப்பு: `டிரா_ஆர்க் <class_canvasitem_method_draw_arc>`. 2 புள்ளிகளைக் கடந்து செல்லும் பல வளைவுகள் உள்ளன, எனவே இந்த எடுத்துக்காட்டுக்கு 2 ஆரம்ப புள்ளிகளுக்கு இடையில் நடுத்தர புள்ளியில் அதன் மையத்தைக் கொண்ட அரை வட்டத்தை தேர்வு செய்வோம்.
uk: Щоб намалювати дугу, ми можемо використати метод :ref:`draw_arc<class_CanvasItem_method_draw_arc>`. Є багато дуг, які проходять через 2 точки, тому ми виберемо для цього прикладу півколо, центр якого знаходиться в середній точці між 2 початковими точками.
zh_hans: 为了绘制弧线，可以使用 :ref:`draw_arc<class_CanvasItem_method_draw_arc>` 方法。事实上，穿过两个点的弧线有很多种，在这个例子中，我们将选择一个半圆，它的圆心位于初始两个点之间的中点。
zh_hant: 畫圓弧時，可以用 :ref:`draw_arc<class_CanvasItem_method_draw_arc>` 方法。能通過兩點的圓弧有很多種，這裡我們選擇將圓心設在這兩點的中點，畫出一段半圓。

source: Calculating this arc will be more complex than in the case of the line:
de: Die Berechnung dieses Bogens ist komplizierter als im Fall der Linie:
es: Calcular este arco será más complejo que en el caso de la recta:
fr: Le calcul de cet arc de cercle sera plus complexe que dans le cas de la ligne :
ga: Beidh an stua seo a ríomh níos casta ná i gcás na líne:
pt_br: O cálculo deste arco será mais complexo do que no caso da reta:
ru: Вычисление этой дуги может быть более сложным чем в случае линии:
ta: இந்த வளைவைக் கணக்கிடுவது வரியை விட மிகவும் சிக்கலானதாக இருக்கும்:
uk: Розрахунок цієї дуги буде складнішим, ніж у випадку лінії:
zh_hans: 确实，计算此弧线要比计算直线复杂得多:
zh_hant: 計算這段圓弧會比直線稍微複雜一點：

source: The center of the semicircle will be the middle point between both points. The radius will be half the distance between both points. The start and end angles will be the angles of the vector from point1 to point2 and vice-versa. Note we had to normalize the ``end_angle`` in positive values because if ``end_angle`` is less than ``start_angle``, the arc will be drawn counter-clockwise, which we don't want in this case (the arc would be upside-down).
de: Der Mittelpunkt des Halbkreises ist der mittlere Punkt zwischen den beiden Punkten. Der Radius ist die Hälfte des Abstands zwischen den beiden Punkten. Die Start- und Endwinkel sind die Winkel des Vektors von Punkt1 zu Punkt2 und umgekehrt. Beachten Sie, dass wir den ``Endwinkel`` in positive Werte normalisieren mussten, denn wenn der ``Endwinkel`` kleiner ist als der ``Startwinkel``, wird der Bogen gegen den Uhrzeigersinn gezeichnet, was wir in diesem Fall nicht wollen (der Bogen würde auf dem Kopf stehen).
es: El centro del semicírculo será el punto medio entre ambos puntos. El radio será la mitad de la distancia entre ambos puntos. Los ángulos inicial y final serán los ángulos del vector del punto1 al punto2 y viceversa. Tenga en cuenta que tuvimos que normalizar ``end_angle`` en valores positivos porque si ``end_angle`` es menor que ``start_angle``, el arco se dibujará en el sentido contrario a las agujas del reloj, lo cual no queremos en este caso (el arco estaría al revés).
fr: Le centre du demi-cercle sera le point médian entre les deux points. Le rayon sera la moitié de la distance entre les deux points. Les angles de début et de fin seront les angles du vecteur de point1 à point2 et vice-versa. Notez que nous avons dû normaliser le ``end_angle`` dans des valeurs positives parce que si ``end_angle`` est inférieur à ``start_angle``, l'arc sera dessiné en sens inverse des aiguilles d'une montre, ce que nous ne voulons pas dans ce cas (l'arc serait à l'envers).
ga: Is é lár an leathchiorcail an lárphointe idir an dá phointe. Beidh an ga leath an fad idir an dá phointe. Is iad na huillinneacha tosaigh agus deiridh uillinneacha an veicteora ó phointe 1 go pointe2 agus vice-versa. Tabhair faoi deara go raibh orainn an ``deireadh_uillinn`` a normalú i luachanna dearfacha mar má tá ``deireadh_uillinne`` níos lú ná `` tosaigh_uillinn``, tarraingeofar an stua tuathalach, rud nach dteastaíonn uainn sa chás seo (an bheadh stua bun os cionn).
pt_br: O centro do semicírculo será o ponto médio entre os dois pontos. O raio será metade da distância entre os dois pontos. Os ângulos inicial e final serão os ângulos do vetor de point1 para point2 e vice-versa. Note que foi necessário normalizar o ``end_angle`` para valores positivos, pois se ``end_angle`` for menor que ``start_angle``, o arco será desenhado no sentido anti-horário, o que não queremos neste caso (o arco ficaria de cabeça para baixo).
ru: Центр полукруга будет точкой посередине между обеими точками. Радиус будет половиной расстояния между обеими точками. Начальный и конечный углы будут углами вектора от точки1 до точки2 и наоборот. Заметьте что мы нормализуем ``end_angle`` в позитивные значения поскольку если ``end_angle`` меньше чем ``start_angle``, дуга будет отрисована против часовой стрелки, что мы не хотим в этом случае (дуга будет смотреть сверху-вниз).
ta: அரை வட்டத்தின் நடுவண் இரு புள்ளிகளுக்கும் இடையிலான நடுத்தர புள்ளியாக இருக்கும். ஆரம் இரண்டு புள்ளிகளுக்கும் இடையிலான பாதி தூரம் இருக்கும். தொடக்க மற்றும் இறுதி கோணங்கள் புள்ளி 1 முதல் பாயிண்ட் 2 வரை திசையனின் கோணங்களாக இருக்கும். நேர்மறையான மதிப்புகளில் `` End_angle`` ஐ இயல்பாக்க வேண்டும் என்பதை நினைவில் கொள்க வில் தலைகீழாக இருக்கும்).
uk: Центр півкола буде серединою між обома точками. Радіус буде дорівнювати половині відстані між обома точками. Початковий і кінцевий кути будуть кутами вектора від точки1 до точки2 і навпаки. Зауважте, що нам довелося нормалізувати ``end_angle`` у додатних значеннях, оскільки якщо ``end_angle`` менший за ``start_angle``, дуга буде намальована проти годинникової стрілки, чого ми не хочемо в цьому випадку ( дуга буде перевернута).
zh_hans: 半圆的圆心将是两个点之间的中点。半径将是两个点之间距离的一半。起始角度和结束角度将分别为点 1 到点 2 的向量角度以及点 2 到点 1 的向量角度。需要注意的是，我们需要将 ``end_angle`` 归一化为正值，因为如果 ``end_angle`` 小于 ``start_angle`` ，则弧线将逆时针绘制，在这里，并不想要该效果 (弧线会上下颠倒)。
zh_hant: 這裡半圓的圓心會設在兩點的中點，半徑是兩點距離的一半。起始角度和結束角度分別是 point1 到 point2 或從 point2 到 point1 的向量角度。注意我們要把 ``end_angle`` 轉成正值，否則如果 ``end_angle`` 小於 ``start_angle``，圓弧會逆時針繪製（這不是我們想要的，因為這樣會畫在上方）。

source: The result should be something like this, with the arc going down and between the points:
de: Das Ergebnis sollte in etwa so aussehen, wobei der Bogen nach unten und zwischen den Punkten verläuft:
es: El resultado debería ser algo como esto, con el arco bajando y entre los puntos:
fr: Le résultat devrait être quelque chose comme ça, avec l'arc descendant entre les points :
ga: Ba chóir go mbeadh an toradh mar seo, leis an stua ag dul síos agus idir na pointí:
pt_br: O resultado deve ser algo assim, com o arco descendo e entre os pontos:
ru: Результат будет выглядеть как-то так, с дугой смотрящей вниз и между точек:
ta: இதன் விளைவாக இதுபோன்றதாக இருக்க வேண்டும், வில் கீழே மற்றும் புள்ளிகளுக்கு இடையில் செல்கிறது:
uk: У результаті має вийти щось на кшталт цього з дугою вниз і між точками:
zh_hans: 结果应该像这样，弧线向下延伸并穿过这些点：
zh_hant: 結果應該會如下圖，圓弧往下並連接兩點：

source: Feel free to play with the parameters in the inspector to obtain different results: change the color, the width, the antialiasing, and increase the number of segments to increase the curve smoothness, at the cost of extra performance.
de: Sie können mit den Parametern im Inspektor spielen, um verschiedene Ergebnisse zu erzielen: Ändern Sie die Farbe, die Breite, das Antialiasing und erhöhen Sie die Anzahl der Segmente, um die Glätte der Kurve zu erhöhen, allerdings zum Preis von zusätzlicher Rechenzeit.
es: Siéntete libre de jugar con los parámetros del inspector para obtener diferentes resultados: cambia el color, el ancho, el antialiasing y aumenta el número de segmentos para aumentar la suavidad de la curva, a costa de un rendimiento adicional.
fr: N'hésitez pas à jouer avec les paramètres de l'inspecteur pour obtenir différents résultats : changer la couleur, la largeur, l'anticrénelage, et augmenter le nombre de segments pour améliorer le lissage de la courbe, au coût de moins bonnes performances.
ga: Ná bíodh leisce ort imirt leis na paraiméadair sa chigire chun torthaí éagsúla a fháil: athraigh an dath, an leithead, an frith-aliasing, agus líon na ndeighleoga a mhéadú chun réidh an chuair a mhéadú, ar chostas feidhmíochta breise.
pt_br: Sinta-se à vontade para experimentar os parâmetros no inspetor para obter resultados diferentes: altere a cor, a largura, o antialiasing e aumente o número de segmentos para melhorar a suavidade da curva, ao custo de desempenho adicional.
ru: Не стесняйтесь поиграть с параметрами в инспекторе для получения различных результатов: измените цвет, длину, сглаживание, и увеличьте количество сегментов для усиления сглаживания кривой, за цену производительности.
ta: வெவ்வேறு முடிவுகளைப் பெற இன்ச்பெக்டரில் உள்ள அளவுருக்களுடன் விளையாட தயங்க: கூடுதல் செயல்திறனின் செலவில், வளைவு மென்மையை அதிகரிக்க வண்ணம், அகலம், ஆண்டியலிசிங் ஆகியவற்றை மாற்றவும், மற்றும் பிரிவுகளின் எண்ணிக்கையை அதிகரிக்கவும்.
uk: Не соромтеся грати з параметрами в інспекторі, щоб отримати різні результати: змініть колір, ширину, згладжування та збільште кількість сегментів, щоб збільшити плавність кривої, ціною додаткової продуктивності.
zh_hans: 可在检查器中调整参数以获得不同的结果：改变颜色、宽度、抗锯齿，以及增加段数以提高曲线的平滑度，但这样会牺牲部分性能。
zh_hant: 你可以隨意在屬性面板調整這些參數，獲得不同效果：改變顏色、線寬、抗鋸齒或增加分段數讓曲線更平滑（但會消耗更多效能）。

source: The following instructions use a fixed set of coordinates that could be too small for high resolution screens (larger than 1080p). If that is your case, and the drawing is too small consider increasing your window scale in ``Menu > Project > Project settings > display/window/stretch/scale`` to adjust the project to a higher resolution (a 2 or 4 scale tends to work well).
de: Die folgenden Anweisungen verwenden einen festen Satz von Koordinaten, der für hochauflösende Bildschirme (größer als 1080p) zu klein sein könnte. Wenn dies bei Ihnen der Fall ist und die Zeichnung zu klein ist, sollten Sie die Skalierung des Fensters unter ``Menü > Projekt > Projekteinstellungen > Anzeige/Fenster/Strecken/Skalierung`` erhöhen, um das Projekt an eine höhere Auflösung anzupassen (eine Skalierung von 2 oder 4 funktioniert in der Regel gut).

source: Unlike ``draw_polygon()``, polylines can only have a single unique color for all its points (the second argument). This method has 2 additional arguments: the width of the line (which is as small as possible by default) and enabling or disabling the anti-aliasing (it is disabled by default).
de: Im Gegensatz zu ``draw_polygon()`` können Polylinien nur eine einzige Farbe für alle ihre Punkte haben (das zweite Argument). Diese Methode hat 2 zusätzliche Argumente: die Breite der Linie (die standardmäßig so klein wie möglich ist) und die Aktivierung oder Deaktivierung der Kantenglättung (standardmäßig ist sie deaktiviert).

source: While using the :ref:`Label <class_Label>` Node is the most common way to add text to your application, the low level `_draw` function includes functionality to add text to your custom Node drawing. We will use it to add the name "GODOT" under the robot head.
de: Während die Verwendung des :ref:`Label <class_Label>`-Nodes die gebräuchlichste Art ist, Text zu Ihrer Anwendung hinzuzufügen, enthält die Low-Level-Funktion `_draw` eine Funktionalität, um Text zu Ihrer eigenen Node-Zeichnung hinzuzufügen. Wir werden sie verwenden, um den Namen "GODOT" unter dem Roboterkopf hinzuzufügen.

source: Please note that ``_mouth_width`` is a user defined property like any other and it or any other used as a drawing argument can be animated using more standard and high level methods such as a :ref:`Tween<class_Tween>` or an :ref:`AnimationPlayer<class_AnimationPlayer>` Node. The only difference is that a ``queue_redraw()`` call is needed to apply those changes so they get shown on screen.
de: Bitte beachten Sie, dass ``_mouth_width`` eine benutzerdefinierte Property wie jede andere ist und dass sie oder jede andere, die als Zeichenargument verwendet wird, mit Hilfe von Default-Methoden wie einem :ref:`Tween<class_Tween>` oder einem :ref:`AnimationPlayer<class_AnimationPlayer>`-Node animiert werden kann. Der einzige Unterschied ist, dass ein ``queue_redraw()`` Aufruf benötigt wird, um die Änderungen auf dem Bildschirm zu zeigen.

source: Translation status
de: Übersetzungsstatus
