Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/custom_drawing_*_2d.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, uk, zh_hans, zh_hant

source: You will need to save your scene, rebuild your project (for C# only) and reload the current scene manually at the menu option ``Scene > Reload Saved Scene`` to refresh the current node in the ``2D`` view the first time you add or remove the ``@tool`` annotation.
de: Sie müssen Ihre Szene speichern, Ihr Projekt neu erstellen (nur für C#) und die aktuelle Szene manuell über den Menüpunkt ``Szene > Gespeicherte Szene neu laden`` neu laden, um den aktuellen Node in der ``2D``-Ansicht zu aktualisieren, wenn Sie das erste Mal die ``@tool``-Annotation hinzufügen oder entfernen.
es: Necesitará guardar su escena, reconstruir su proyecto (solo para C#) y recargar la escena actual manualmente. Eso se hace con la opción de menú ``Escena > Recargar Escena Guardada`` para actualizar el nodo actual en la vista ``2D`` la primera vez que agrega o elimina la anotación ``@tool``.
fr: Vous devrez sauvegarder votre scène, reconstruire votre projet (uniquement pour C#) et recharger manuellement la scène actuelle via l'option de menu ``Scene > Reload Saved Scene`` pour actualiser le nœud actuel dans la vue ``2D`` la première fois que vous ajoutez ou supprimez l'annotation ``@tool``.
ga: Beidh ort do radharc a shábháil, do thionscadal a atógáil (do C# amháin) agus an radharc reatha a athlódáil de láimh ag an rogha roghchláir `` Radharc > Athlódáil Radharc Sábháilte`` chun an nód reatha a athnuachan san amharc ``2D`` ar an gcéad amharc an t-am a chuireann tú nó a bhainfidh tú an nóta ``@uirlis``.
pt_br: Você precisará salvar sua cena, refazer a build seu projeto (apenas para C#) e recarregar a cena atual manualmente na opção menu ``Scene > Recarregue Saved Scene`` para refrescar o nó atual na view ``2D`` da primeira vez que você adicionar ou remover a anotação ``@tool``.
ru: Вам потребуется сохранить сцену, пересобрать проект (только для C#) и перезагрузить текущую сцену вручную с помощью пункта меню ``Сцена > Перезагрузить сохраненную сцену``, чтобы обновить текущий узел в представлении ``2D`` при первом добавлении или удалении аннотации ``@tool``.
ta: உங்கள் காட்சியைச் சேமிக்க வேண்டும், உங்கள் திட்டத்தை மீண்டும் கட்டியெழுப்ப வேண்டும் (சி# க்கு மட்டும்) மற்றும் தற்போதைய காட்சியை பட்டியல் விருப்பத்தில் கைமுறையாக மீண்டும் ஏற்ற வேண்டும் `` காட்சி> சேமித்த காட்சியை மீண்டும் ஏற்றவும் `` 2 டி` முதல் பார்க்கும் தற்போதைய முனையை புதுப்பிக்க நீங்கள் ``@கருவி` சிறுகுறிப்பைச் சேர்க்க அல்லது அகற்றும் நேரம்.
uk: Вам потрібно буде зберегти свою сцену, перебудувати проект (тільки для C#) і перезавантажити поточну сцену вручну за допомогою пункту меню ``Сцена > Перезавантажити збережену сцену``, щоб оновити поточний вузол у ``2D`` перегляді спочатку коли ви додаєте або видаляєте анотацію ``@tool``.
zh_hans: 每当你添加或移除 ``@tool`` 注解时，你需要保存场景，重新构建项目（仅限 C#），并且选择菜单选项 ``场景 > 重载已保存场景`` 来手动重载当前场景，才能刷新 ``2D`` 视图中的节点。
zh_hant: 在你第一次新增或移除 ``@tool`` 註解後，需要儲存場景，並（C# 專案）重新編譯，再從選單選取「場景 > 重新載入已儲存場景」刷新 ``2D`` 檢視，這樣才能看到節點的最新繪圖。

source: Animation
es: Animación
ga: Beochan
it: Animazione
pt_br: Animação
ru: Анимация
ta: அனிமேசன்
uk: Анімація
zh_hans: 动画
zh_hant: 動畫

source: If we wanted to make the custom shape change at runtime, we could modify the methods called or its arguments at execution time, or apply a transform.
de: Wenn wir die benutzerdefinierte Form zur Laufzeit ändern wollten, könnten wir die aufgerufenen Methoden oder ihre Argumente zur Ausführungszeit ändern oder eine Transformation anwenden.
es: Si quisiéramos hacer que la forma personalizada cambie en tiempo de ejecución, podríamos modificar los métodos llamados o sus argumentos en tiempo de ejecución, o aplicar una transformación.
fr: Si nous voulions faire en sorte que la forme personnalisée change au moment de l'exécution, nous pourrions modifier les méthodes appelées ou leurs arguments au moment de l'exécution, ou appliquer une transformation.
ga: Dá mba mhian linn an cruth saincheaptha a athrú ag am rite, d’fhéadfaimis na modhanna ar a dtugtar nó a hargóintí a mhodhnú ag am forghníomhaithe, nó claochlú a chur i bhfeidhm.
pt_br: Se quiséssemos fazer a mudança de forma personalizada no tempo de execução, poderíamos modificar os métodos chamados ou seus argumentos no tempo de execução, ou aplicar uma transformação.
ru: Если бы мы хотели изменить пользовательскую форму во время выполнения, мы могли бы изменить вызываемые методы или их аргументы во время выполнения или применить преобразование.
ta: இயக்க நேரத்தில் தனிப்பயன் வடிவ மாற்றத்தை செய்ய நாங்கள் விரும்பினால், செயல்படுத்தப்படும் நேரத்தில் அழைக்கப்பட்ட முறைகள் அல்லது அதன் வாதங்களை மாற்றியமைக்கலாம் அல்லது ஒரு உருமாற்றத்தைப் பயன்படுத்தலாம்.
uk: Якщо ми хочемо змінити власну форму під час виконання, ми можемо змінити викликані методи або їх аргументи під час виконання, або застосувати перетворення.
zh_hans: 如果希望自制图形在运行时改变形状，便需要修改执行时调用的方法或者参数，或者应用一个变换。
zh_hant: 如果想在執行時讓自訂形狀變化，可以在執行期間修改呼叫的方法或其參數，或是套用變換。

source: For example, if we want the custom shape we just designed to rotate, we could add the following variable and code to the ``_ready`` and ``_process`` methods:
de: Wenn wir zum Beispiel wollen, dass sich die Form, die wir gerade entworfen haben, dreht, könnten wir die folgende Variable und den folgenden Code zu den Methoden ``_ready`` und ``_process`` hinzufügen:
es: Por ejemplo, si queremos que la forma personalizada que acabamos de diseñar gire, podríamos agregar la siguiente variable y código a los métodos ``_ready`` y ``_process``:
fr: Par exemple, si nous voulons que la forme personnalisée que nous venons de concevoir tourne, nous pourrions ajouter la variable et le code suivants aux méthodes ``_ready`` et ``_process`` :
ga: Mar shampla, más mian linn an cruth saincheaptha a dhearadh muid díreach chun rothlú, d'fhéadfaimis an t-athróg agus an cód seo a leanas a chur leis na modhanna ``_ready`` agus ``_process``:
pt_br: Por exemplo, se quisermos a forma personalizada que acabamos de projetar para girar, poderíamos adicionar a seguinte variável e código aos métodos ``_ready`` e ``_process``:
ru: Например, если мы хотим, чтобы только что созданная нами пользовательская фигура вращалась, мы можем добавить следующую переменную и код в методы ``_ready`` и ``_process``:
ta: எடுத்துக்காட்டாக, நாங்கள் சுழற்ற வடிவமைக்கப்பட்ட தனிப்பயன் வடிவத்தை விரும்பினால், பின்வரும் மாறி மற்றும் குறியீட்டை `` _ready`` மற்றும் `_PROCESS`` முறைகளில் சேர்க்கலாம்:
uk: Наприклад, якщо ми хочемо, щоб власна форма, яку ми щойно створили, оберталася, ми можемо додати таку змінну та код до методів ``_ready`` і ``_process``:
zh_hans: 举个例子，如果想让我们刚刚设计的自制形状旋转，那么可以先 ``_ready`` 和``_process`` 方法中添加如下变量和代码：
zh_hant: 例如，若想讓剛剛設計的自訂形狀旋轉，可以在 ``_ready`` 和 ``_process`` 方法中加上以下變數與程式碼：

source: The problem with the above code is that because we have created the points approximately on a rectangle starting from the upper left corner, the ``(0, 0)`` coordinate and extending to the right and down, we see that the rotation is done using the top left corner as pivot. A position transform change on the node won't help us here, as the rotation transform is applied first.
de: Das Problem mit dem obigen Code ist, dass wir die Punkte ungefähr auf einem Rechteck erstellt haben, das von der oberen linken Ecke, der ``(0, 0)``-Koordinate, ausgeht und sich nach rechts und unten erstreckt, so dass wir sehen, dass die Drehung unter Verwendung der oberen linken Ecke als Pivotpunkt erfolgt. Eine Änderung der Positionstransformation am Node hilft uns hier nicht weiter, da die Rotationstransformation zuerst angewendet wird.
es: El problema con el código anterior es que debido a que hemos creado los puntos aproximadamente en un rectángulo comenzando desde la esquina superior izquierda, la coordenada ``(0, 0)``, y extendiéndose hacia la derecha y hacia abajo, vemos que la rotación se hace usando la esquina superior izquierda como pivote. Un cambio de transformación de posición en el nodo no nos ayudará aquí, ya que la transformación de rotación se aplica primero.
fr: Le problème avec le code ci-dessus est que, puisque nous avons créé les points approximativement sur un rectangle commençant à partir du coin supérieur gauche, la coordonnée ``(0, 0)`` et s'étendant vers la droite et vers le bas, nous voyons que la rotation est effectuée en utilisant le coin supérieur gauche comme pivot. Un changement de transformation de position sur le nœud ne nous aidera pas ici, car la transformation de rotation est appliquée en premier.
ga: Is í an fhadhb atá leis an gcód thuas ná toisc go bhfuil na pointí timpeall cruthaithe againn ar dhronuilleog ag tosú ón gcúinne uachtarach ar chlé, go gcomhordaíonn an ``(0, 0)`` agus go leathnaíonn sé ar dheis agus síos, feicimid go bhfuil an rothlú. déanta ag baint úsáide as an gcúinne uachtarach ar chlé mar mhaighdeog. Ní chuideoidh athrú claochlaithe suímh ar an nód linn anseo, toisc go gcuirtear an claochlú rothlaithe i bhfeidhm ar dtús.
pt_br: O problema com o código acima é que porque criamos os pontos aproximadamente em um retângulo a partir do canto superior esquerdo, a coordenada ``(0, 0)``` e estendendo-se para a direita e para baixo, vemos que a rotação é feita usando o canto superior esquerdo como pivô. Uma mudança de posição de transformação no nó não nos ajudará aqui, pois a transformação de rotação é aplicada primeiro.
ru: Проблема с приведенным выше кодом заключается в том, что поскольку мы создали точки приблизительно на прямоугольнике, начиная с верхнего левого угла, координата ``(0, 0)`` и простираясь вправо и вниз, мы видим, что поворот выполняется с использованием верхнего левого угла в качестве опорной точки. Изменение преобразования положения на узле нам здесь не поможет, поскольку сначала применяется преобразование вращения.
ta: மேலே உள்ள குறியீட்டின் சிக்கல் என்னவென்றால், மேல் இடது மூலையிலிருந்து தொடங்கும் ஒரு செவ்வகத்தில் தோராயமாக புள்ளிகளை உருவாக்கியுள்ளதால், `` (0, 0) `` ஒருங்கிணைத்து வலதுபுறம் விரிவடைந்து, சுழற்சி என்பதை நாங்கள் காண்கிறோம் மேல் இடது மூலையை பிவோட்டாகப் பயன்படுத்தி முடிந்தது. சுழற்சி உருமாற்றம் முதலில் பயன்படுத்தப்படுவதால், முனையில் ஒரு நிலை மாற்ற மாற்றம் நமக்கு உதவாது.
uk: Проблема з наведеним вище кодом полягає в тому, що оскільки ми створили точки приблизно на прямокутнику, починаючи з верхнього лівого кута, координати ``(0, 0)`` і простягаючись праворуч і вниз, ми бачимо, що обертання виконано за допомогою верхнього лівого кута як опори. Зміна трансформації позиції на вузлі не допоможе нам тут, оскільки спочатку застосовується трансформація обертання.
zh_hans: 上述代码的问题在于，我们所创建的点是差不多是从左上角，即坐标轴的 ``(0, 0)`` 处，扩展到右下角，所以看到的旋转才是以左上角为轴心的。对于节点的位置变换并不能帮到我们，因为旋转变化会先作用。
zh_hant: 上面的程式碼有個問題：由於我們的點是從左上角 ``(0, 0)`` 開始，一路往右下建立，因此旋轉時會以左上角為中心。單純改變節點的位置變換沒辦法解決，因為旋轉變換會先套用。

source: While we could rewrite all of the points' coordinates to be centered around ``(0, 0)``, including negative coordinates, that would be a lot of work.
de: Wir könnten zwar alle Koordinaten der Punkte so umschreiben, dass sie um ``(0, 0)`` zentriert sind, einschließlich negativer Koordinaten, aber das wäre eine Menge Arbeit.
es: Si bien podríamos reescribir todas las coordenadas de los puntos para que se centren alrededor de ``(0, 0)``, incluidas las coordenadas negativas, eso requeriría mucho trabajo.
fr: Bien que nous pourrions réécrire toutes les coordonnées des points pour être centré autour de ``(0, 0)``, y compris les coordonnées négatives, ce serait beaucoup de travail.
ga: Cé go bhféadfaimis comhordanáidí uile na bpointí a athscríobh le bheith dírithe timpeall ``(0, 0)``, lena n-áirítear comhordanáidí diúltacha, bheadh sé sin go leor oibre.
pt_br: Embora pudéssemos reescrever todas as coordenadas dos pontos para serem centradas em torno de ``(0, 0)``, incluindo coordenadas negativas, isso seria muito trabalho.
ru: Хотя мы могли бы переписать все координаты точек так, чтобы они были центрированы вокруг ``(0, 0)``, включая отрицательные координаты, это потребовало бы много работы.
ta: எதிர்மறை ஆயத்தொகுப்புகள் உட்பட `` (0, 0) `` ஆகியவற்றை மையமாகக் கொண்ட அனைத்து புள்ளிகளையும் ஒருங்கிணைப்புகளை மீண்டும் எழுத முடியும், அது நிறைய வேலையாக இருக்கும்.
uk: Хоча ми могли б переписати всі координати точок, щоб вони були зосереджені навколо ``(0, 0)``, включно з від’ємними координатами, це було б дуже складно.
zh_hans: 不过我们可以重写所有点的坐标，使其以 ``(0, 0)`` 点为中心，这就包括了坐标的负半轴，那可是个大工程。
zh_hant: 雖然我們可以將所有點的座標重寫成以 ``(0, 0)`` 為中心（包含負座標），但這樣會相當麻煩。

source: One possible way to work around this is to use the lower level :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` method to fix this issue, translating all points in the CanvasItem's own space, and then moving it back to its original place with a regular node transform, either in the editor or in code, like this:
de: Ein möglicher Weg, dies zu umgehen, ist die Verwendung der Low-Level-Methode :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>`, um dieses Problem zu beheben. Dabei werden alle Punkte im eigenen Space des CanvasItems übersetzt und dann mit einer regulären Node-Transformation zurück an ihren ursprünglichen Platz verschoben, entweder im Editor oder im Code, wie hier:
es: Una forma posible de solucionar esto es utilizar el método de bajo nivel :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` para solucionar este problema, traduciendo todos los puntos en el propio espacio del CanvasItem. Y luego moviéndolo de nuevo a su lugar original con un nodo de transformación normal, ya sea en el editor o en código. Sería así:
fr: Une façon possible de contourner ce problème est d'utiliser la méthode de bas niveau :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` pour résoudre ce problème, en translatant tous les points dans le référentiel du CanvasItem, puis en le replaçant à sa place d'origine avec une transformation de noeud standard, soit dans l'éditeur, soit dans le code, comme ceci :
ga: Bealach amháin le oibriú timpeall air seo is ea an modh íosleibhéil :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` a úsáid chun an fhadhb seo a réiteach, ag aistriú gach pointe i spás CanvasItem féin, agus ansin é a bhogadh ar ais go dtí a áit bhunaidh le nód rialta athraigh, bíodh sé san eagarthóir nó i gcód, mar seo:
pt_br: Uma maneira possível de trabalhar em torno disso é usar o método de nível mais baixo :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` para corrigir este problema, traduzindo todos os pontos no próprio espaço do CanvasItem, e depois movendo-o de volta para o seu lugar original com um nó regular transforma, tanto no editor ou no código, como este:
ru: Одним из возможных способов решения этой проблемы является использование метода нижнего уровня :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` для исправления этой проблемы, переводя все точки в собственном пространстве CanvasItem, а затем возвращая его в исходное место с помощью обычного преобразования узла либо в редакторе, либо в коде, например:
ta: இதைச் சுற்றி வேலை செய்வதற்கான ஒரு சாத்தியமான வழி கீழ் மட்டத்தைப் பயன்படுத்துவது: ref: `draw_set_transform <class_canvasitem_method_draw_ted_transform>` இந்த சிக்கலை சரிசெய்யும் முறை, அனைத்து புள்ளிகளையும் கேன்வாசிட்டெமின் சொந்த இடத்திற்கு மொழிபெயர்க்கிறது, பின்னர் அதன் அசல் இடத்திற்கு நகர்த்துகிறது இது போன்ற எடிட்டரில் அல்லது குறியீட்டில் மாற்றவும்:
uk: Одним із можливих способів обійти це є використання методу нижнього рівня :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` для усунення цієї проблеми, перекладаючи всі точки у власному просторі CanvasItem, а потім переміщуючи його назад у вихідне місце за допомогою звичайного вузла перетворення, або в редакторі, або в коді, як це:
zh_hans: 一个可行的方案就是使用更底层的 :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` 方法来解决此问题，这个方法能够平移 CanvasItem 自身空间的所有点，然后再使用常规的节点变换将其移动至原位，用编辑器或代码均可，就像这样：
zh_hant: 一個解決方式是用較低階的 :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` 方法，先把所有點在 CanvasItem 的座標空間中平移，把中心移到你想要的軸心，然後再用節點的平移將它移回原本位置（可在編輯器或程式中設定），像這樣：

source: This is the result, rotating around a pivot now on ``(60, 60)``:
de: Dies ist das Ergebnis, das sich um einen Pivot-Punkt auf ``(60, 60)`` dreht:
es: Este es el resultado de girar alrededor de un pivote ahora en ``(60, 60)``:
fr: Voilà le résultat, tournant autour d'un pivot placé en ``(60, 60)`` :
ga: Is é seo an toradh, ag rothlú timpeall pivot anois ar ``(60, 60)``:
pt_br: Este é o resultado, girando em torno de um pivô agora em ``(60, 60)``:
ru: Вот результат вращения вокруг точки опоры на ``(60, 60)``:
ta: இதன் விளைவாக, `` (60, 60) ``:
uk: Це результат обертання навколо опорної точки на ``(60, 60)``:
zh_hans: 这就是最终结果，以 ``(60, 60)`` 点为轴心旋转：
zh_hant: 這樣結果就會繞著 ``(60, 60)`` 為中心旋轉：

source: If what we wanted to animate was a property inside the ``_draw()`` call, we must remember to call ``queue_redraw()`` to force a refresh, as otherwise it would not be updated on screen.
de: Wenn das, was wir animieren wollten, eine Property innerhalb des ``_draw()`` -Aufrufs war, müssen wir daran denken, ``queue_redraw()`` aufzurufen, um einen Refresh zu erzwingen, da es sonst nicht auf dem Bildschirm aktualisiert werden würde.
es: Si lo que queríamos animar era una propiedad dentro de la llamada ``_draw()``, debemos recordar llamar a ``queue_redraw()`` para forzar una actualización, ya que de lo contrario no se actualizaría en pantalla.
fr: Si ce que nous voulions animer était une propriété à l'intérieur de l'appel ``_draw()``, nous devons nous souvenir d'appeler ``queue_redraw()`` pour forcer un rafraîchissement, car sinon il ne serait pas mis à jour sur l'écran.
ga: Más rud a theastaigh uainn a bheochan ná maoin taobh istigh den ghlao ``_draw () ``, ní mór dúinn cuimhneamh ar ``queue_redraw ()`` glaoch chun athnuachan a chur i bhfeidhm, mar ar shlí eile ní dhéanfaí é a nuashonrú ar an scáileán.
pt_br: Se o que queríamos animar era uma propriedade dentro da chamada ``_draw()``, devemos lembrar de chamar ``queue_redraw()`` para forçar uma atualização, como de outra forma não seria atualizado na tela.
ru: Если мы хотим анимировать свойство внутри вызова ``_draw()``, мы должны не забыть вызвать ``queue_redraw()`` для принудительного обновления, так как в противном случае оно не будет обновлено на экране.
ta: `` _Draw () `` அழைப்புக்குள் நாம் ஒரு சொத்து என்றால், புதுப்பித்தலை கட்டாயப்படுத்த `` queue_redraw () `` என்று அழைக்க நினைவில் கொள்ள வேண்டும், இல்லையெனில் அது திரையில் புதுப்பிக்கப்படாது.
uk: Якщо те, що ми хочемо анімувати, було властивістю всередині виклику ``_draw()``, ми повинні не забувати викликати ``queue_redraw()``, щоб примусово оновити, інакше воно не буде оновлено на екрані.
zh_hans: 如果我们在 ``_draw()`` 中调用属性而动画化，必须调用 ``queue_redraw()`` 来强制刷新，否则不会在屏幕上更新内容。
zh_hant: 如果想讓 ``_draw()`` 中的某個屬性產生動畫，要記得呼叫 ``queue_redraw()`` 強制重繪，否則畫面不會即時更新。

source: For example, this is how we can make the robot appear to open and close its mouth, by changing the width of its mouth line follow a sinusoidal (:ref:`sin<class_@globalscope_method_sin>`) curve:
de: So können wir zum Beispiel den Roboter dazu bringen, seinen Mund zu öffnen und zu schließen, indem wir die Breite seiner Mundlinie einer Sinuskurve (:ref:`sin<class_@globalscope_method_sin>`) folgen lassen:
es: Por ejemplo, así es como podemos hacer que parezca que el robot abre y cierra la boca, cambiando el ancho de la línea de su boca y siga una curva sinusoidal (:ref:`sin<class_@globalscope_method_sin>`):
fr: Par exemple, c'est ainsi que nous pouvons faire que le robot ait l'air d'ouvrir et fermer sa bouche, en changeant la largeur de la ligne de sa bouche en suivant un courbe sinusoïdale (:ref:`sin<class_@globalscope_method_sin>`) :
ga: Mar shampla, seo an chaoi ar féidir linn an róbait a dhéanamh le feiceáil mar a bhéal a oscailt agus a dhúnadh, trí leithead líne a bhéil a athrú, lean cuar sinusóideach (: ref:`sin<class_@globalscope_method_sin>`):
pt_br: Por exemplo, é assim que podemos fazer o robô parecer abrir e fechar a boca, alterando a largura de sua linha da boca seguir uma curva sinusoidal (:ref:`sin<class_@globalscope_method_sin>`):
ru: Например, вот как мы можем заставить робота открывать и закрывать рот, изменяя ширину линии его рта по синусоидальной (:ref:`sin<class_@globalscope_method_sin>`) кривой:
ta: எடுத்துக்காட்டாக, ரோபோ அதன் வாயின் அகலத்தை மாற்றுவதன் மூலம் அதன் வாயைத் திறந்து மூடியதாகத் தோன்றலாம் (: குறிப்பு: `பாவம் <class_@globalscope_method_sin>`) வளைவு:
uk: Наприклад, ось як ми можемо зробити так, щоб робот відкривав і закривав рот, змінюючи ширину його лінії рота відповідно до синусоїдальної (:ref:`sin<class_@globalscope_method_sin>`) кривої:
zh_hans: 例如，可以通过改变嘴巴线条的宽度，使机器人“张嘴”和“闭嘴”，宽度的变化遵循正弦 (:ref:`sin<class_@globalscope_method_sin>`) 曲线：
zh_hant: 例如，我們可以改變機器人嘴巴的線段寬度，讓它看起來像是在張嘴和閉嘴，讓寬度隨著正弦波（:ref:`sin<class_@globalscope_method_sin>`）變化：

source: It will look somewhat like this when run:
de: Wenn es ausgeführt wird, sieht das ungefähr so aus:
es: Debería verse similar a esto al ejecutarse:
fr: Il ressemblera quelque peu à ceci lors de l’exécution :
ga: Beidh cuma beagán mar seo air nuair a bheidh sé á rith:
it: All'esecuzione, dovrebbe avere più o meno questo aspetto:
pt_br: Vai parecer um pouco assim quando executar:
ru: Примерно так оно будет выглядеть при запуске:
ta: இயங்கும் போது இது ஓரளவு இதுபோன்றதாக இருக்கும்:
uk: При запуску це виглядатиме приблизно так:
zh_hans: 当运行时，它看上去会像这样：
zh_hant: 執行時大致會長這樣：

source: Please note that ``_mouth_width`` is a user defined property like any other and it or any other used as a drawing argument can be animated using more standard and high-level methods such as a :ref:`Tween<class_Tween>` or an :ref:`AnimationPlayer<class_AnimationPlayer>` Node. The only difference is that a ``queue_redraw()`` call is needed to apply those changes so they get shown on screen.
pt_br: Observe que ``_mouth_width`` é uma propriedade definida pelo usuário como qualquer outra, e ela, ou qualquer outra usada como argumento de desenho, pode ser animada utilizando métodos mais padrão e de alto nível, como um nó :ref:`Tween<class_Tween>` ou :ref:`AnimationPlayer<class_AnimationPlayer>`. A única diferença é que é necessário chamar ``queue_redraw()`` para aplicar essas mudanças e fazer com que elas sejam exibidas na tela.
ru: Обратите внимание, что ``_mouth_width`` - это определяемое пользователем свойство, как и любое другое, и оно или любое другое, используемое в качестве аргумента рисования, может быть анимировано с использованием более стандартных и высокоуровневых методов, таких как узел :ref:`Tween<class_Tween>` или :ref:`AnimationPlayer<class_AnimationPlayer>`. Единственное отличие заключается в том, что для применения этих изменений, чтобы они отображались на экране, необходим вызов ``queue_redraw()``.
ta: `` _Mouth_width`` என்பது வேறு எதையும் போலவே ஒரு பயனர் வரையறுக்கப்பட்ட சொத்து என்பதையும், அது அல்லது ஒரு வரைபட வாதமாகப் பயன்படுத்தப்படும் வேறு ஏதேனும் ஒரு நிலையான மற்றும் உயர் மட்ட முறைகளைப் பயன்படுத்தி அனிமேசன் செய்யப்படலாம்: ref: `tween <class_tween>` அல்லது An: `அனிமேசன் பிளேயர் <class_animationPlayer>` node. ஒரே வேறுபாடு என்னவென்றால், அந்த மாற்றங்களைப் பயன்படுத்துவதற்கு ஒரு `` queue_redraw () `` அழைப்பு தேவை, எனவே அவை திரையில் காண்பிக்கப்படுகின்றன.
zh_hans: 请注意， ``_mouth_width`` 与任何其他属性一样，都是用户定义的属性。它或任何其他用作绘图参数的属性，都可以使用更标准的高级方法进行动画处理，例如 :ref:`Tween<class_Tween>` 或 :ref:`AnimationPlayer<class_AnimationPlayer>` 节点。唯一区别是需要调用 ``queue_redraw()`` 应用更改，使内容在屏幕上显示。
zh_hant: 請注意，``_mouth_width`` 和其他自訂屬性一樣，也可以用更高階的方式（例如 :ref:`Tween<class_Tween>` 或 :ref:`AnimationPlayer<class_AnimationPlayer>` 節點）來製作動畫。唯一的差別是，你必須呼叫 ``queue_redraw()`` 才會讓螢幕及時顯示動畫效果。
