Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/custom_drawing_*_2d.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, uk, zh_hans, zh_hant

source: Drawing your own nodes might also be desired while running them in the editor. This can be used as a preview or visualization of some feature or behavior.
de: Das Zeichnen eigener Nodes kann auch beim Ausführen im Editor erwünscht sein. Dies kann als Vorschau oder Visualisierung eines Features oder eines Verhaltens verwendet werden.
es: Dibujar tus propios nodos también puede ser conveniente mientras los ejecutas en el editor. Esto puede usarse como una preview o visualización de alguna funcionalidad o comportamiento del mismo.
fr: Dessiner vos propres nœuds peut également être désiré lors de leur exécution dans l'éditeur. Cela peut être utilisé comme aperçu ou visualisation de certaines fonctionnalités ou comportements.
ga: B'fhéidir gur mhaith le do nóid féin a tharraingt agus iad á reáchtáil san eagarthóir. Is féidir é seo a úsáid mar réamhamharc nó léirshamhlú ar ghné nó iompar éigin.
ru: Также может потребоваться нарисовать собственные узлы при их запуске в редакторе. Это можно использовать для предпросмотра или визуализации какой-либо функции или поведения.
ta: உங்கள் சொந்த முனைகளை வரைவது எடிட்டரில் இயக்கும் போது விரும்பப்படலாம். இது சில நற்பொருத்தம் அல்லது நடத்தையின் முன்னோட்டம் அல்லது காட்சிப்படுத்தலாக பயன்படுத்தப்படலாம்.
uk: Також може знадобитися малювати власні вузли під час їх запуску в редакторі. Це можна використовувати як попередній перегляд або візуалізацію певної функції чи поведінки.
zh_hans: 运行于编辑器中时，也可能需要绘制自己的节点。这可以用于预览或可视化某些特性或行为。
zh_hant: 有時你也會希望在編輯器中運行節點時自訂繪圖，這可以用來做功能或行為的預覽與視覺化。

source: To do this, you can use the :ref:`tool annotation<doc_gdscript_tool_mode>` on both GDScript and C#. See :ref:`the example below<doc_draw_show_drawing_while_editing_example>` and :ref:`doc_running_code_in_the_editor` for more information.
de: Um dies zu tun, können Sie die :ref:`Tool-Annotation<doc_gdscript_tool_mode>` sowohl für GDScript als auch für C# verwenden. Siehe :ref:`das Beispiel unten <doc_draw_show_drawing_while_editing_example>` und :ref:`doc_running_code_in_the_editor` für weitere Informationen.
es: Para hacer esto, puede usar la :ref:`anotación de herramienta<doc_gdscript_tool_mode>` tanto en GDScript como en C#. Consulte :ref:`el siguiente ejemplo<doc_draw_show_drawing_ while_editing_example>` y :ref:`doc_running_code_in_the_editor` para obtener más información.
fr: Pour ce faire, vous pouvez utiliser l'annotation :ref:`tool<doc_gdscript_tool_mode>` aussi bien avec GDScript qu'avec C#. Consultez :ref:`l'exemple ci-dessous<doc_draw_show_drawing_while_editing_example>` et :ref:`doc_running_code_in_the_editor` pour plus d'informations.
ga: Chun seo a dhéanamh, is féidir leat an :ref:`anótáil uirlis<doc_gdscript_tool_mode>` a úsáid ar GDScript agus C# araon. Féach :ref:`an sampla thíos <doc_draw_show_drawing_while_editing_example>` agus :ref: `doc_running_code_in_the_editor` le haghaidh tuilleadh eolais.
pt_br: Para fazer isso, você pode usar a anotação :ref:`tool<doc_gdscript_tool_mode>` tanto em GDScript quanto em C#. Veja :ref:`o exemplo abaixo<doc_draw_show_drawing_while_editing_example>` e :ref:`doc_running_code_in_the_editor` para mais informações.
ru: Для этого можно использовать :ref:`аннотацию инструмента<doc_gdscript_tool_mode>` как в GDScript, так и в C#. Для получения дополнительной информации см. :ref:`пример ниже<doc_draw_show_drawing_while_editing_example>` и :ref:`doc_running_code_in_the_editor`.
ta: இதைச் செய்ய, நீங்கள்: Ref: `கருவி சிறுகுறிப்பு <doc_gdscript_tool_mode>` gdscript மற்றும் c#இரண்டிலும் பயன்படுத்தலாம். காண்க: ref: `கீழே உள்ள எடுத்துக்காட்டு <doc_draw_show_drawing_while_editing_example>` மற்றும்: குறிப்பு: `doc_running_code_in_the_editor` மேலும் தகவலுக்கு.
uk: Для цього ви можете використати :ref:`tool annotation<doc_gdscript_tool_mode>` як на GDScript, так і на C#. Перегляньте :ref:`приклад нижче<doc_draw_show_drawing_while_editing_example>` та :ref:`doc_running_code_in_the_editor` для отримання додаткової інформації.
zh_hans: 为此，你可以在 GDScript 和 C# 上使用\ :ref:`工具注解 <doc_gdscript_tool_mode>`。有关更多信息，请参阅\ :ref:`下面的示例 <doc_draw_show_drawing_while_editing_example>`\ 和 :ref:`doc_running_code_in_the_editor`。
zh_hant: 你可以在 GDScript 和 C# 中使用 :ref:`tool annotation<doc_gdscript_tool_mode>` 來達成這個效果。更多資訊請參考下方 :ref:`範例<doc_draw_show_drawing_while_editing_example>` 以及 :ref:`doc_running_code_in_the_editor`。

source: Example 1: drawing a custom shape
de: Beispiel 1: Zeichnen eines benutzerdefinierten Shapes
es: Ejemplo 1: dibujando una figura personalizada
fr: Exemple 1 : Dessiner un forme personnalisée
ga: Sampla 1: cruth saincheaptha a tharraingt
ru: Вот простой пример того, как это работает
ta: எடுத்துக்காட்டு 1: தனிப்பயன் வடிவத்தை வரைதல்
uk: Приклад 1: малювання нестандартної форми
zh_hans: 示例 1：绘制自定义形状
zh_hant: 範例 1：繪製自訂形狀

source: We will now use the custom drawing functionality of the Godot Engine to draw something that Godot doesn't provide functions for. We will recreate the Godot logo but with code- only using drawing functions.
de: Wir werden nun die benutzerdefinierten Zeichenfunktionen der Godot-Engine verwenden, um etwas zu zeichnen, für das Godot keine Funktionen bereitstellt. Wir werden das Godot-Logo neu erstellen, aber mit Code - nur mit Zeichenfunktionen.
es: Ahora usaremos la funcionalidad de dibujo personalizado de Godot Engine para dibujar algo para lo que Godot no ofrece ninguna función. Recrearemos el logo de Godot pero con código, utilizando únicamente las funciones de dibujo.
fr: Nous allons maintenant utiliser la fonctionnalité de dessin personnalisé du moteur Godot pour dessiner quelque chose pour lequel Godot ne fournit pas de fonctions. Nous allons recréer le logo de Godot mais avec du code, seulement en utilisant des fonctions de dessin.
ga: Úsáidfimid feidhmiúlacht líníochta saincheaptha Inneall Godot anois chun rud éigin nach soláthraíonn Godot feidhmeanna a tharraingt dó. Déanfaimid lógó Godot a athchruthú ach le cód - ag baint úsáide as feidhmeanna líníochta amháin.
ru: Теперь мы используем пользовательские функции рисования движка Godot, чтобы нарисовать то, для чего в Godot нет встроенных функций. Мы воссоздадим логотип Godot, но только кодом и функциями рисования.
ta: கோடோட் இயந்திரத்தின் தனிப்பயன் வரைதல் செயல்பாட்டைப் பயன்படுத்துவோம், கோடோட் செயல்பாடுகளை வழங்காத ஒன்றை வரையலாம். நாங்கள் கோடோட் லோகோவை மீண்டும் உருவாக்குவோம், ஆனால் குறியீட்டைக் கொண்டு- வரைதல் செயல்பாடுகளை மட்டுமே பயன்படுத்துகிறோம்.
uk: Тепер ми скористаємося спеціальними функціями малювання Godot Engine, щоб намалювати щось, для чого Godot не надає функцій. Ми відтворимо логотип Godot, але з кодом, лише за допомогою функцій малювання.
zh_hans: 我们将使用 Godot 引擎的自定义绘制功能来绘制 Godot 本身没有提供函数的图形。将仅使用绘图函数重新创建 Godot 标志。
zh_hant: 現在我們會用 Godot 的自訂繪圖功能，畫出 Godot 內建函式無法直接繪製的東西。我們將用程式碼，純粹用繪圖指令重現 Godot 標誌。

source: You will have to code a function to perform this and draw it yourself.
de: Sie müssen dafür eine Funktion programmieren und es selbst zeichnen.
es: Tendrá que programar una función para realizar esto y dibujarla Ud. mismo.
fr: Vous devrez coder une fonction pour réaliser cela et dessiner le logo vous-même.
ga: Beidh ort feidhm a chódú chun é seo a dhéanamh agus é a tharraingt tú féin.
pt_br: Você terá que codificar uma função para executar isso e desenhá-la você mesmo.
ru: Вам придется закодировать функцию для ее выполнения и нарисовать ее самостоятельно.
ta: இதைச் செய்ய நீங்கள் ஒரு செயல்பாட்டை குறியிட வேண்டும், அதை நீங்களே வரைய வேண்டும்.
uk: Вам доведеться закодувати функцію, щоб виконати це, і намалювати її самостійно.
zh_hans: 你需要编写一个函数来执行此操作并自行绘制。
zh_hant: 你需要自行寫一個函式來完成這個繪圖。

source: The following instructions use a fixed set of coordinates that could be too small for high resolution screens (larger than 1080p). If that is your case, and the drawing is too small consider increasing your window scale in the project setting :ref:`Display > Window > Stretch > Scale<class_ProjectSettings_property_display/window/stretch/scale>` to adjust the project to a higher resolution (a 2 or 4 scale tends to work well).
pt_br: As instruções a seguir usam um conjunto fixo de coordenadas que pode ser muito pequeno para telas de alta resolução (maiores que 1080p). Se esse for o seu caso, e o desenho estiver muito pequeno, considere aumentar a escala da janela nas configurações do projeto em :ref:`Exibição > Janela > Esticar > Escala<class_ProjectSettings_property_display/window/stretch/scale>` para ajustar o projeto a uma resolução mais alta (uma escala de 2 ou 4 tende a funcionar bem).
ru: В следующих инструкциях используется фиксированный набор координат, который может быть слишком мал для экранов с высоким разрешением (больше 1080p). Если это ваш случай, и рисунок слишком мал, рассмотрите возможность увеличения масштаба окна в настройках проекта :ref:`Display > Window > Stretch > Scale<class_ProjectSettings_property_display/window/stretch/scale>`, чтобы настроить проект на более высокое разрешение (масштаб 2 или 4 обычно работает хорошо).
ta: பின்வரும் வழிமுறைகள் உயர் தெளிவுத்திறன் திரைகளுக்கு (1080p ஐ விட பெரியவை) மிகச் சிறியதாக இருக்கும் ஒரு நிலையான ஆயத்தொகுப்புகளைப் பயன்படுத்துகின்றன. அது உங்கள் விசயமாக இருந்தால், திட்ட அமைப்பில் உங்கள் சாளர அளவை அதிகரிப்பதைக் கருத்தில் கொள்ளுங்கள்: ref: `காட்சி> சாளரம்> நீட்சி> அளவுகோல் <class_projectsettings_property_display/sidder/strop/scale>` திட்டத்தை உயர் தெளிவுத்திறனுடன் சரிசெய்ய (2 அல்லது 4 அளவுகோல் நன்றாக வேலை செய்ய முனைகிறது).
zh_hans: 以下说明使用了一组固定坐标，该坐标对于高分辨率屏幕（大于 1080p）可能太小。如果是这种情况，并且绘图太小，请考虑在 ``菜单 > 项目 > 项目设置 > 显示/窗口/拉伸/缩放``:ref:`Display > Window > Stretch > Scale<class_ProjectSettings_property_display/window/stretch/scale>` 中增加窗口缩放比例，以将项目调整到更高的分辨率（2 或 4 倍缩放通常效果良好）。
zh_hant: 以下教學會使用固定座標集，這在高解析度螢幕（大於 1080p）下可能會顯得太小。如果你遇到這種情況，可以在專案設定的 :ref:`Display > Window > Stretch > Scale<class_ProjectSettings_property_display/window/stretch/scale>` 中調高視窗縮放比例（2 或 4 通常效果不錯），以因應高解析度顯示。

source: Drawing a custom polygon shape
de: Zeichnen eines benutzerdefinierten Polygons
es: Dibujando una forma de un polígono personalizada
fr: Dessiner une forme de polygone personnalisée
ga: Cruth saincheaptha polagún a tharraingt
pt_br: Criando um nó de um polígono personalizado
ru: Рисование пользовательского polygon shape (формы полигона)
ta: தனிப்பயன் பலகோண வடிவத்தை வரைதல்
uk: Малювання спеціальної багатокутної форми
zh_hans: 绘制自定义多边形形状
zh_hant: 繪製自訂多邊形

source: While there is a dedicated node to draw custom polygons ( :ref:`Polygon2D <class_Polygon2D>`), we will use in this case exclusively lower level drawing functions to combine them on the same node and be able to create more complex shapes later on.
de: Es gibt zwar einen eigenen Node zum Zeichnen von benutzerdefinierten Polygonen ( :ref:`Polygon2D <class_Polygon2D>`), aber wir werden in diesem Fall ausschließlich Zeichenfunktionen auf niedrigerer Ebene verwenden, um sie auf demselben Node zu kombinieren und später komplexere Geometrien erstellen zu können.
es: Si bien hay un nodo dedicado para dibujar polígonos personalizados ( :ref:`Polygon2D <class_Polygon2D>`), en este caso usaremos exclusivamente funciones de dibujo de nivel inferior para combinarlas en el mismo nodo y poder crear formas más complejas más adelante. .
fr: Bien qu'il y ait un nœud dédié à dessiner des polygones personnalisés ( :ref:`Polygon2D <class_Polygon2D>`), nous utiliserons dans ce cas exclusivement des fonctions de dessin de plus bas niveau pour les combiner sur le même nœud et être en mesure de créer des formes plus complexes plus tard.
ga: Cé go bhfuil nód tiomnaithe ann chun polagáin shaincheaptha a tharraingt ( :ref:`Polygon2D <class_Polygon2D>`), úsáidfimid sa chás seo feidhmeanna líníochta ar leibhéal níos ísle amháin chun iad a chomhcheangal ar an nód céanna agus a bheith in ann cruthanna níos casta a chruthú níos déanaí. .
pt_br: Embora haja um nó dedicado para desenhar polígonos personalizados ( :ref:`Polygon2D <class_Polygon2D>`), vamos usar neste caso exclusivamente funções de desenho de nível inferior para combiná-los no mesmo nó e ser capaz de criar formas mais complexas mais tarde.
ru: Хотя для рисования пользовательских полигонов существует специальный узел ( :ref:`Polygon2D <class_Polygon2D>`), в данном случае мы будем использовать исключительно функции рисования более низкого уровня, чтобы объединить их в одном узле и иметь возможность создавать более сложные фигуры в дальнейшем.
ta: தனிப்பயன் பலகோணங்களை வரைய ஒரு பிரத்யேக முனை இருக்கும்போது (: குறிப்பு: `பலகான் 2 டி <class_polygon2d>`), இந்த விசயத்தில் அவற்றை ஒரே முனையில் இணைக்க பிரத்தியேகமாக குறைந்த அளவிலான வரைதல் செயல்பாடுகளைப் பயன்படுத்துவோம், பின்னர் மிகவும் சிக்கலான வடிவங்களை உருவாக்க முடியும் .
uk: Хоча існує спеціальний вузол для малювання власних багатокутників ( :ref:`Polygon2D <class_Polygon2D>`), у цьому випадку ми будемо використовувати функції малювання виключно нижчого рівня, щоб об’єднати їх на одному вузлі та мати можливість створювати більш складні форми пізніше.
zh_hans: 虽然存在用于绘制自定义多边形的专用节点 (:ref:`Polygon2D <class_Polygon2D>`)，但本例中将仅使用更底层的绘制函数，以便将它们组合在同样的节点上，并能够在之后创建更复杂的形状。
zh_hant: 雖然有專門用來繪製自訂多邊形的節點（:ref:`Polygon2D <class_Polygon2D>`），但這裡我們只用較低階的繪圖函式，將所有形狀畫在同一個節點上，這樣之後也方便擴充出更複雜的圖形。

source: First, we will define a set of points -or X and Y coordinates- that will form the base of our shape:
de: Zunächst werden wir eine Reihe von Punkten - oder X- und Y-Koordinaten als Basis unserer Form definieren:
es: Primero, definiremos un conjunto de puntos (o coordenadas X e Y) que formarán la base de nuestra forma:
fr: D'abord, nous définirons un ensemble de points -ou coordonnées X et Y - qui formeront la base de notre forme :
ga: Ar dtús, sainmhíneoimid sraith pointí - nó comhordanáidí X agus Y - a bheidh mar bhonn ár gcruth:
pt_br: Primeiro, definiremos um conjunto de pontos -ou coordenadas X e Y - que formarão a base da nossa forma:
ru: Сначала мы определим набор точек (или координат X и Y), которые лягут в основу нашей фигуры:
ta: முதலாவதாக, புள்ளிகளின் தொகுப்பை -அல்லது ஃச் மற்றும் ஒய் ஆயத்தொகுப்புகளின் தொகுப்பை வரையறுப்போம்- இது எங்கள் வடிவத்தின் அடித்தளத்தை உருவாக்கும்:
uk: Спочатку ми визначимо набір точок або координат X і Y, які будуть формувати основу нашої форми:
zh_hans: 我们将首先定义一组点（或 X 和 Y 坐标），它们将构成形状的基础：
zh_hant: 首先，我們要定義一組點（X 和 Y 座標），作為這個形狀的基礎：

source: This format, while compact, is not the one that Godot understands to draw a polygon. In a different scenario we could have to load these coordinates from a file or calculate the positions while the application is running, so some transformation may be needed.
de: Dieses Format ist zwar kompakt, aber es ist nicht das Format, das Godot versteht, um ein Polygon zu zeichnen. In einem anderen Szenario könnten wir diese Koordinaten aus einer Datei laden oder die Positionen berechnen müssen, während die Anwendung läuft, so dass eine Transformation erforderlich sein könnte.
es: Este formato, aunque compacto, no es el que entiende Godot para dibujar un polígono. En un escenario diferente podríamos tener que cargar estas coordenadas desde un archivo o calcular las posiciones mientras la aplicación se está ejecutando, por lo que puede ser necesaria alguna transformación.
fr: Ce format, bien que compact, n'est pas celui que Godot comprend pour dessiner un polygone. Dans un scénario différent, nous pourrions devoir charger ces coordonnées à partir d'un fichier ou calculer les positions pendant que l'application fonctionne, et alors une transformation pourrait être nécessaire.
ga: Ní hé an fhormáid seo, cé go bhfuil dlúth, an ceann a thuigeann Godot chun polagán a tharraingt. I gcás difriúil d'fhéadfaimis na comhordanáidí seo a luchtú ó chomhad nó na suíomhanna a ríomh agus an feidhmchlár ag rith, mar sin b'fhéidir go mbeadh gá le roinnt claochlú.
pt_br: Este formato, enquanto compacto, não é aquele que Godot entende desenhar um polígono. Em um cenário diferente, poderíamos ter que carregar essas coordenadas de um arquivo ou calcular as posições enquanto o aplicativo está sendo executado, então alguma transformação pode ser necessária.
ru: Этот формат, хотя и компактный, не является тем, который Godot понимает для рисования многоугольника. В другом сценарии нам пришлось бы загружать эти координаты из файла или вычислять позиции во время работы приложения, поэтому может потребоваться некоторое преобразование.
ta: இந்த வடிவம், கச்சிதமாக இருக்கும்போது, ஒரு பலகோணத்தை வரைய கோடோட் புரிந்துகொள்ளும் ஒன்றல்ல. வேறுபட்ட சூழ்நிலையில், இந்த ஆயங்களை ஒரு கோப்பிலிருந்து ஏற்ற வேண்டும் அல்லது பயன்பாடு இயங்கும்போது நிலைகளை கணக்கிட வேண்டும், எனவே சில மாற்றம் தேவைப்படலாம்.
uk: Цей формат, хоч і компактний, не є тим, який Годо розуміє для малювання багатокутника. В іншому сценарії нам може знадобитися завантажити ці координати з файлу або обчислити положення під час роботи програми, тому може знадобитися певне перетворення.
zh_hans: 这是一种简洁的格式，但并不是 Godot 用于绘制多边形所理解的格式。在其他情况下，我们可能需要从文件中加载这些坐标或在应用程序运行时计算它们的位置，因此可能需要进行一些转换。
zh_hant: 這種格式雖然精簡，但 Godot 並不直接支援用來繪製多邊形。在不同情境下，你可能需要從檔案讀取這些座標，或在執行時動態計算，因此可能要進行額外的轉換。

source: To transform these coordinates into the right format, we will create a new method ``float_array_to_Vector2Array()``. Then we will override the ``_ready()`` function, which Godot will call only once -at the start of the execution- to load those coordinates into a variable:
de: Um diese Koordinaten in das richtige Format umzuwandeln, werden wir eine neue Methode ``float_array_to_Vector2Array()`` erstellen. Dann überschreiben wir die Funktion ``_ready()``, die Godot nur einmal - zu Beginn der Ausführung - aufruft, um diese Koordinaten in eine Variable zu laden:
es: Para transformar estas coordenadas al formato correcto, crearemos un nuevo método ``float_array_to_Vector2Array()``. Luego anularemos la función ``_ready()``, que Godot llamará solo una vez -al inicio de la ejecución- para cargar esas coordenadas en una variable:
fr: Pour transformer ces coordonnées dans le bon format, nous allons créer une nouvelle méthode ``float_array_to_Vector2Array()``. Ensuite, nous redéfinirons la fonction ``_ready()``, que Godot n'appellera qu'une seule fois - au début de l'exécution - pour charger ces coordonnées dans une variable :
ga: Chun na comhordanáidí seo a athrú go dtí an bhformáid cheart, cruthóimid modh nua ``Float_Array_to_Vector2Array () ``. Ansin déanfaimid an fheidhm ``_ready () ``a shárú, nach nglaocfaidh Godot ach uair amháin - ag tús an fhorghníomhaithe - chun na comhordanáidí sin a luchtú isteach i athróg:
pt_br: Para transformar essas coordenadas no formato certo, criaremos um novo método ``float_array_to_Vector2Array()``. Então vamos substituir a função ``_ready()``, que Godot vai chamar apenas uma vez - no início da execução- para carregar essas coordenadas em uma variável:
ru: Чтобы преобразовать эти координаты в правильный формат, мы создадим новый метод ``float_array_to_Vector2Array()``. Затем мы переопределим функцию ``_ready()``, которую Godot вызовет только один раз - в начале выполнения - для загрузки этих координат в переменную:
ta: இந்த ஆயங்களை சரியான வடிவமாக மாற்ற, ஒரு புதிய முறையை உருவாக்குவோம் `` `float_array_to_vector2array ()` `. பின்னர் நாம் `` _ready () `` செயல்பாட்டை மேலெழுதும், இது கோடோட் ஒரு முறை மட்டுமே அழைக்கும் - மரணதண்டனையின் தொடக்கத்தில்- அந்த ஆயங்களை ஒரு மாறியில் ஏற்றுவதற்கு:
uk: Щоб перетворити ці координати в правильний формат, ми створимо новий метод ``float_array_to_Vector2Array()``. Тоді ми замінимо функцію ``_ready()``, яку Годо викличе лише один раз - на початку виконання, щоб завантажити ці координати в змінну:
zh_hans: 为了将这些坐标转换为正确的格式，我们将创建一个新的方法 ``float_array_to_Vector2Array()``\ 。然后我们将重写 ``_ready()`` 函数，Godot 将仅在执行开始时调用该函数一次，以将这些坐标加载到变量中：
zh_hant: 為了將這些座標轉換成 Godot 可用的格式，我們會寫一個新的方法 ``float_array_to_Vector2Array()``。接著覆寫 ``_ready()`` 函式（Godot 會在執行開始時只呼叫一次），將這些座標載入變數：

source: To finally draw our first shape, we will use the method :ref:`draw_polygon <class_CanvasItem_method_draw_polygon>` and pass the points (as an array of Vector2 coordinates) and its color, like this:
de: Um schließlich unsere erste Geometrie zu zeichnen, verwenden wir die Methode :ref:`draw_polygon <class_CanvasItem_method_draw_polygon>` und übergeben die Punkte (als Array von Vector2-Koordinaten) und ihre Farbe, wie folgt:
es: Para finalmente dibujar nuestra primera forma, usaremos el método :ref:`draw_polygon <class_CanvasItem_method_draw_polygon>` y pasaremos los puntos (como una matriz de coordenadas Vector2) y su color, de esta manera:
fr: Pour enfin dessiner notre première forme, nous utiliserons la méthode :ref:`draw_polygon <class_CanvasItem_method_draw_polygon>` et y passons les points (comme un tableau de coordonnées Vector2) et sa couleur, comme ceci :
ga: Chun ár gcéad chruth a tharraingt ar deireadh, úsáidfimid an modh :ref:`draw_polygon <class_CanvasItem_method_draw_polygon>` agus pas a fháil sna pointí (mar raon comhordanáidí Vector2) agus a dath, mar seo:
pt_br: Para finalmente desenhar nossa primeira forma, vamos usar o método :ref:`draw_polygon <class_CanvasItem_method_draw_polygon>` e passar os pontos (como uma matriz de coordenadas Vector2) e sua cor, como esta:
ru: Чтобы наконец нарисовать нашу первую фигуру, мы воспользуемся методом :ref:`draw_polygon <class_CanvasItem_method_draw_polygon>` и передадим точки (как массив координат Vector2) и ее цвет, вот так:
ta: இறுதியாக எங்கள் முதல் வடிவத்தை வரைய, நாங்கள் முறையைப் பயன்படுத்துவோம்: ref: `draw_polygon <class_canvasitem_method_draw_polygon>` மற்றும் புள்ளிகளை (வெக்டர் 2 ஆயத்தொகுப்புகளின் வரிசையாக) மற்றும் அதன் வண்ணத்தை கடந்து செல்லுங்கள்:
uk: Щоб нарешті намалювати нашу першу фігуру, ми використаємо метод :ref:`draw_polygon <class_CanvasItem_method_draw_polygon>` і передамо точки (як масив координат Vector2) і їх колір, як це:
zh_hans: 为了最终绘制第一个形状，我们将使用 :ref:`draw_polygon <class_CanvasItem_method_draw_polygon>` 方法，并传递点（ Vector2 坐标数组）及其颜色，如下所示：
zh_hant: 最後，我們會使用 :ref:`draw_polygon <class_CanvasItem_method_draw_polygon>` 方法來繪製這個形狀，傳入點的陣列（Vector2 格式）和顏色，如下所示：

source: When running it you should see something like this:
de: Wenn Sie es ausführen, sollten Sie etwa Folgendes sehen:
es: Al ejecutarse deberías ver algo como esto:
fr: Quand de l'exécution, vous devriez voir quelque chose comme ça :
ga: Agus é á rith ba chóir duit rud éigin mar seo a fheiceáil:
it: Durante l'esecuzione, dovresti vedere qualcosa di simile a questo:
pt_br: Ao executá-lo você deve ver algo assim:
ru: Запустив, вы увидите что-то вроде этого:
ta: அதை இயக்கும் போது நீங்கள் இதுபோன்ற ஒன்றைக் காண வேண்டும்:
uk: Під час запуску ви повинні побачити щось на зразок цього:
zh_hans: 运行后，你应该会看到类似以下的图形：
zh_hant: 執行時你應該會看到類似這樣的畫面：
