Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/custom_drawing_*_2d.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, uk, zh_hans, zh_hant

source: To see it in action, you can set the texture to be the Godot icon on the editor by dragging and dropping the default ``icon.svg`` from the ``FileSystem`` tab to the Texture property on the ``Inspector`` tab. When changing the ``Texture`` property value while the previous script is running, the texture will also change automatically.
de: Um es in Aktion zu sehen, können Sie die Textur des Godot-Symbols auf dem Editor einstellen, indem Sie die Standarddatei ``icon.svg`` per Drag&Drop vom ``FileSystem``-Tab auf die ``Texture``-Property im ``Inspector``-Tab ziehen. Wenn Sie den Wert der ``Texture``-Property ändern, während das vorherige Skript läuft, wird die Textur ebenfalls automatisch geändert.
es: Para verlo en acción, puede configurar la textura para que sea el ícono de Godot en el editor arrastrando y soltando el ``icon.svg`` predeterminado desde la pestaña ``FileSystem`` a la propiedad Textura en la pestalla ``Inspector``. Al cambiar el valor de la propiedad ``Textura`` mientras se ejecuta el script anterior, la textura también cambiará automáticamente.
fr: Pour le voir en action, vous pouvez définir la texture en l'icône Godot sur l'éditeur en glissant-déposant l’icône par défaut ``icon.svg`` de l'onglet ``FileSystem`` à la propriété Texture sur l'onglet ``Inspector``. En changeant la valeur de la propriété ``Texture`` pendant que le script précédent s'exécute, la texture change aussi automatiquement.
ga: Chun é a fheiceáil i ngníomh, is féidir leat an uigeacht a shocrú mar an deilbhín Godot ar an eagarthóir tríd an réamhshocraithe ``icon.svg`` a tharraingt agus a scaoileadh ón gcluaisín ``Filesystem`` go dtí an maoin uigeachta ar an gcluaisín ``Cigire``. Agus luach maoine “Texture” á athrú agus an script roimhe seo á rith, athróidh an uigeacht go huathoibríoch freisin.
pt_br: Para vê-lo em ação, você pode definir a textura como o ícone do Godot no editor arrastando e soltando o ``icon.svg`` padrão da aba ``FileSystem`` para a propriedade Textura na aba do ``Inspetor``. Ao alterar o valor da propriedade ``Textura`` enquanto o script anterior estiver em execução, a textura também será alterada automaticamente.
ru: Чтобы увидеть это в действии, вы можете установить текстуру в качестве значка Godot в редакторе, перетащив и отпустив ``icon.svg`` по умолчанию из вкладки ``FileSystem`` в свойство Texture на вкладке ``Inspector``. При изменении значения свойства ``Texture`` во время выполнения предыдущего скрипта текстура также автоматически изменится.
ta: இதை செயலில் காண, `` கோப்பு முறைமை` தாவலில் இருந்து `` இன்ச்பெக்டர்` இன் அமைப்பு சொத்துக்கு இயல்புநிலையை `` ஐகான்.ச்விசி`` இழுத்து விடுவதன் மூலம் எடிட்டரில் கோடோட் ஐகானாக அமைப்பை அமைக்கலாம் `தாவல். முந்தைய ச்கிரிப்ட் இயங்கும்போது `` அமைப்பு` சொத்து மதிப்பை மாற்றும்போது, அமைப்பு தானாகவே மாறும்.
uk: Щоб побачити це в дії, ви можете встановити текстуру як піктограму Годо в редакторі, перетягнувши стандартний файл ``icon.svg`` із вкладки ``Файлова система`` у властивість Текстура ``Інспектора` вкладка `. Якщо змінити значення властивості ``Texture`` під час роботи попереднього сценарію, текстура також зміниться автоматично.
zh_hans: 为了直观地看到这一功能，你可以通过将默认的 ``icon.svg`` 文件从 ``文件系统`` 标签拖放到 ``检查器`` 标签上的 ``纹理`` 属性，将编辑器中的纹理设置为 Godot 图标。当先前脚本运行时更改 ``纹理`` 属性值，纹理也将自动更改。
zh_hant: 你可以在編輯器中將 ``FileSystem`` 分頁下的預設 ``icon.svg`` 拖曳到 ``Inspector`` 分頁的 Texture 屬性，來測試這段程式。當上面的腳本正在執行時，只要變更 Texture 屬性的值，貼圖也會隨之自動更新。

source: In some cases, we may need to redraw every frame. For this, call :ref:`queue_redraw <class_CanvasItem_method_queue_redraw>` from the :ref:`_process <class_Node_private_method__process>` method, like this:
de: In einigen Fällen kann es notwendig sein, jedes Frame neu zu zeichnen. Dazu rufen Sie :ref:`queue_redraw <class_CanvasItem_method_queue_redraw>` von der Methode :ref:`_process <class_Node_private_method__process>` auf, etwa so:
es: En algunos casos, podríamos necesitar redibujar en cada frame. Para esto, llama :ref:`queue_redraw <class_CanvasItem_method_queue_redraw>` desde el método :ref:`_process <class_Node_private_method__process>` tal que así:
fr: Dans certains cas, il peut être souhaitable de dessiner chaque image. Pour cela, appelez simplement :ref:`queue_redraw <class_CanvasItem_method_queue_redraw>`depuis la méthode :ref:`_process <class_Node_private_method__process>`, comme ceci :
ga: I gcásanna áirithe, b'fhéidir go gcaithfimid gach fráma a aththarraingt. Chun é seo a dhéanamh, glaoigh ar :ref:`queue_redraw <class_CanvasItem_method_queue_redraw>` ón modh :ref:`_process <class_Node_private_method__process>`, mar seo:
ru: В некоторых случаях нам может потребоваться заново перерисовать каждый кадр. Для этого вызовите :ref:`queue_redraw <class_CanvasItem_method_queue_redraw>` из метода :ref:`_process <class_Node_private_method__process>`, следующим образом:
ta: சில சந்தர்ப்பங்களில், ஒவ்வொரு சட்டகத்தையும் நாம் மீண்டும் வரைய வேண்டியிருக்கலாம். இதற்காக, அழைக்கவும்: ref: `queue_redraw <class_canvasitem_method_queue_redraw>` இலிருந்து: ref: `_ _ _ class_node_private_method__process>` இது போன்ற முறை:
uk: У деяких випадках може знадобитися перемалювати кожен кадр. Для цього викличте :ref:`queue_redraw <class_CanvasItem_method_queue_redraw>` з методу :ref:`_process <class_Node_private_method__process>`, ось так:
zh_hans: 在某些情况下，需要绘制每一帧。 为此，可以像这样从 :ref:`_process <class_Node_private_method__process>` 方法中调用 :ref:`queue_redraw <class_CanvasItem_method_queue_redraw>` 方法：
zh_hant: 有時我們可能需要每一禎都重繪。這時可以在 :ref:`_process <class_Node_private_method__process>` 方法裡呼叫 :ref:`queue_redraw <class_CanvasItem_method_queue_redraw>`，像這樣：

source: Coordinates and line width alignment
de: Koordinaten und Ausrichtung der Linienbreite
es: Coordenadas y ancho de línea
ga: Comhordanáidí agus ailíniú leithe
pt_br: Coordenadas e alinhamento de largura de linha
ru: Выравнивание координат и ширины линии
ta: ஒருங்கிணைப்புகள் மற்றும் வரி அகல சீரமைப்பு
uk: Вирівнювання координат і ширини лінії
zh_hans: 坐标和线宽对齐
zh_hant: 座標與線寬對齊

source: The drawing API uses the CanvasItem's coordinate system, not necessarily pixel coordinates. This means ``_draw()`` uses the coordinate space created after applying the CanvasItem's transform. Additionally, you can apply a custom transform on top of it by using :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` or :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>`.
de: Die Zeichen-API verwendet das Koordinatensystem des CanvasItems, nicht unbedingt Pixelkoordinaten. Das bedeutet, dass ``_draw()`` den Koordinatenraum verwendet, der nach der Anwendung der CanvasItem-Transformation entsteht. Zusätzlich können Sie eine benutzerdefinierte Transformation darauf anwenden, indem Sie :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` oder :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>` verwenden.
es: La API de dibujo utiliza el sistema de coordenadas de CanvasItem, no necesariamente coordenadas de píxeles. Esto significa que ``_draw()`` usa el espacio de coordenadas creado después de aplicar la transformación de CanvasItem. Además, se puede aplicar una transformación personalizada encima usando :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` o :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>`.
fr: L'API de dessin utilise le système de coordonnées du CanvasItem, pas nécessairement les coordonnées de pixels. Cela signifie que ``_draw()`` utilise l'espace de coordonnées créé après avoir appliqué la transformation du CanvasItem. En outre, vous pouvez appliquer une transformation personnalisée en plus de celle-ci en utilisant :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` ou :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>`.
ga: Úsáideann an API líníochta córas comhordanáidí CanvasItem, ní gá comhordanáidí picteilín. Ciallaíonn sé seo go n-úsáideann `` _draw()`` an spás comhordanáidí a cruthaíodh tar éis claochlú CanvasItem a chur i bhfeidhm. Ina theannta sin, is féidir leat claochlú saincheaptha a chur i bhfeidhm ar a bharr trí úsáid a bhaint as :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` nó :tag: `draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>`.
pt_br: A API de desenho usa o sistema de coordenadas do CanvasItem, não necessariamente coordenadas em pixels. Isso significa que ``_draw()`` utiliza o espaço de coordenadas criado após a aplicação da transformação do CanvasItem. Além disso, você pode aplicar uma transformação personalizada sobre ela usando :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` ou :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>`.
ru: API рисования использует систему координат CanvasItem, а не обязательно пиксельные координаты. Это означает, что ``_draw()`` использует координатное пространство, созданное после применения преобразования CanvasItem. Кроме того, вы можете применить пользовательское преобразование поверх него, используя :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` или :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>`.
ta: வரைதல் பநிஇ கேன்வாசிட்டெமின் ஒருங்கிணைப்பு முறையைப் பயன்படுத்துகிறது, படப்புள்ளி ஆயத்தொகுதிகள் அவசியமில்லை. இதன் பொருள் `` _ டிரா () `` கேன்வாசிட்டெமின் உருமாற்றத்தைப் பயன்படுத்திய பிறகு உருவாக்கப்பட்ட ஒருங்கிணைப்பு இடத்தைப் பயன்படுத்துகிறது. கூடுதலாக, பயன்படுத்துவதன் மூலம் அதன் மேல் தனிப்பயன் உருமாற்றத்தைப் பயன்படுத்தலாம்: ref: `draw_set_transform <class_canvasitem_method_draw_ted_transform>` or: ref: `draw_transform_matrix <ploss_canvasitem_draw_traw_tranal_transforms> `matrix>
uk: API малювання використовує систему координат CanvasItem, не обов’язково піксельні координати. Це означає, що ``_draw()`` використовує простір координат, створений після застосування перетворення CanvasItem. Крім того, ви можете застосувати спеціальне перетворення поверх нього за допомогою :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` або :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>`.
zh_hans: 绘图 API 使用的是 CanvasItem 的坐标系，不一定是像素坐标。这意味着 ``_draw()`` 使用的是应用 CanvasItem 的变换后创建的坐标空间。此外，你还可以使用 :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` 或 :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>` 在其上方应用自定义变换。
zh_hant: 繪圖 API 使用的是 CanvasItem 的座標系統，不一定是像素座標。也就是說，``_draw()`` 用的是應用過 CanvasItem 轉換後的座標空間。此外，你還可以用 :ref:`draw_set_transform<class_CanvasItem_method_draw_set_transform>` 或 :ref:`draw_set_transform_matrix<class_CanvasItem_method_draw_set_transform_matrix>` 再加上自訂轉換。

source: When using :ref:`draw_line <class_CanvasItem_method_draw_line>`, you should consider the width of the line. When using a width that is an odd size, the position of the start and end points should be shifted by ``0.5`` to keep the line centered, as shown below.
de: Wenn Sie :ref:`draw_line <class_CanvasItem_method_draw_line>` verwenden, sollten Sie die Breite der Linie berücksichtigen. Wenn Sie eine Breite verwenden, die eine ungerade Größe hat, sollte die Position des Start- und Endpunktes um ``0.5`` verschoben werden, um die Linie zentriert zu halten, wie unten gezeigt.
es: Al usar :ref:`draw_line <class_CanvasItem_method_draw_line>`, debes considerar el ancho de la línea. Cuando se utiliza un ancho de tamaño impar, la posición de los puntos inicial y final se debe cambiar en ``0.5`` para mantener la línea centrada, como se muestra a continuación.
fr: Lors de l'utilisation de :ref:`draw_line <class_CanvasItem_method_draw_line>`, vous devriez considérer la largeur de la ligne. Lorsqu'il s'agit d'une largeur impaire, la position des points de début et de fin devrait être décalée de ``0.5`` pour garder la ligne au centre, comme montré ci-dessous.
ga: Agus :ref:`draw_line <class_CanvasItem_method_draw_line>` á úsáid agat, ba cheart duit leithead na líne a mheas. Agus leithead corrmhéid á úsáid agat, ba cheart suíomh na bpointí tosaigh agus deiridh a aistriú le ``0.5`` chun an líne a choinneáil dírithe, mar a thaispeántar thíos.
pt_br: Ao usar :ref:`draw_line <class_CanvasItem_method_draw_line>`, você deve considerar a largura da linha. Ao utilizar uma largura com valor ímpar, a posição dos pontos inicial e final deve ser ajustada em ``0.5`` para manter a linha centralizada, como mostrado abaixo.
ru: При использовании :ref:`draw_line <class_CanvasItem_method_draw_line>` следует учитывать ширину линии. При использовании ширины нечетного размера положение начальной и конечной точек следует сместить на ``0.5``, чтобы линия оставалась центрированной, как показано ниже.
ta: பயன்படுத்தும் போது: ref: `draw_line <class_canvasitem_method_draw_line>`, நீங்கள் வரியின் அகலத்தை கருத்தில் கொள்ள வேண்டும். ஒற்றைப்படை அளவிலான அகலத்தைப் பயன்படுத்தும் போது, தொடக்க மற்றும் இறுதி புள்ளிகளின் நிலை `` 0.5`` ஆல் மாற்றப்பட வேண்டும்.
uk: Використовуючи :ref:`draw_line <class_CanvasItem_method_draw_line>`, слід враховувати ширину лінії. Якщо використовується ширина непарного розміру, положення початкової та кінцевої точок має бути зміщено на ``0,5``, щоб зберегти лінію по центру, як показано нижче.
zh_hans: 当使用 :ref:`draw_line <class_CanvasItem_method_draw_line>` 时，你应该考虑线的宽度。当使用奇数宽度时，为了使线保持居中，起点和终点的位置应该偏移 ``0.5`` ，如下所示。
zh_hant: 使用 :ref:`draw_line <class_CanvasItem_method_draw_line>` 時，應注意線寬。如果線寬為奇數，起點和終點座標應加上 ``0.5``，才能讓線條置中，如下圖所示。

source: The same applies to the :ref:`draw_rect <class_CanvasItem_method_draw_rect>` method with ``filled = false``.
de: Dasselbe gilt für die Methode :ref:`draw_rect <class_CanvasItem_method_draw_rect>` mit ``filled = false``.
es: Lo mismo se aplica al método :ref:`draw_rect <class_CanvasItem_method_draw_rect>` con ``filled = false``.
fr: Il en va de même pour la méthode :ref:`draw_rect <class_CanvasItem_method_draw_rect>` avec ``filled = false``.
ga: Baineann an rud céanna leis an modh :ref:`draw_rect <class_CanvasItem_method_draw_rect>` le ``líonadh = bréagach``.
pt_br: O mesmo se aplica ao método :ref:`draw_rect <class_CanvasItem_method_draw_rect>` com ``filled = false``.
ru: То же самое относится к методу :ref:`draw_rect <class_CanvasItem_method_draw_rect>` с ``filled = false``.
ta: இது பொருந்தும்: ref: `draw_rect <class_canvasitem_method_draw_rect>` `நிரப்பப்பட்ட = தவறு` உடன் முறை.
uk: Те саме стосується методу :ref:`draw_rect <class_CanvasItem_method_draw_rect>` із ``filled = false``.
zh_hans: 与使用 ``filled = false`` 的 :ref:`draw_rect <class_CanvasItem_method_draw_rect>` 方法相同。
zh_hant: 同理，對 :ref:`draw_rect <class_CanvasItem_method_draw_rect>` 方法（``filled = false``）也適用。

source: Antialiased drawing
de: Zeichnen mit Anti-Aliasing
es: Dibujo antialiasing
fr: Dessin avec anticrénelage
ga: Líníocht antialiased
it: Disegno con antialiasing
pt_br: Desenho com suavização de serrilhado
ru: **Сглаживание**
ta: ஆன்டிலிசெட் வரைதல்
uk: Згладжування
zh_hans: 抗锯齿绘图
zh_hant: 抗鋸齒繪圖

source: Godot offers method parameters in :ref:`draw_line<class_CanvasItem_method_draw_line>` to enable antialiasing, but not all custom drawing methods offer this ``antialiased`` parameter.
de: Godot bietet Methodenparameter in :ref:`draw_line <class_CanvasItem_method_draw_line>` an, um Antialiasing zu aktivieren, aber nicht alle benutzerdefinierten Zeichenmethoden bieten diesen ``antialiased``-Parameter an.
es: Godot ofrece parámetros de método en :ref:`draw_line <class_CanvasItem_method_draw_line>` para habilitar el antialiasing, pero no todos los métodos personalizados de dibujo ofrecen este parámetro ``suavizado``.
fr: Godot offre des paramètres de méthode dans :ref:`draw_line<class_CanvasItem_method_draw_line>` pour activer l'antialiasing, mais certaines méthodes de dessin personnalisé n'offrent pas ce paramètre ``antialiased``.
ga: Cuireann Godot paraiméadair an mhodha ar fáil i :ref:`draw_line<class_CanvasItem_method_draw_line>` chun frithaliasú a chumasú, ach ní thairgeann gach modh líníochta saincheaptha an paraiméadar ``antialiased`` seo.
ru: Godot предлагает параметры метода в :ref:`draw_line<class_CanvasItem_method_draw_line>`, чтобы включить сглаживание, но не все пользовательские методы рисования поддерживают ``antialiased`` параметр.
ta: கோடோட் இதில் முறை அளவுருக்களை வழங்குகிறது: குறிப்பு: `டிரா_்லைன் <class_canvasitem_method_draw_line>` ஆன்டிலியாசிங்கை இயக்குவதற்கு, ஆனால் எல்லா தனிப்பயன் வரைபட முறைகளும் இந்த `` ஆன்டிலியச் செய்யப்பட்ட`` அளவுருவை வழங்கவில்லை.
uk: Godot пропонує параметри методу в :ref:`draw_line<class_CanvasItem_method_draw_line>` для ввімкнення згладжування, але не всі спеціальні методи малювання пропонують цей параметр ``antialiased``.
zh_hans: Godot 在 :ref:`draw_line<class_CanvasItem_method_draw_line>` 方法中提供参数来启用抗锯齿功能，但并非所有自定义绘图方法都提供这个 ``抗锯齿（antialiased）`` 参数。
zh_hant: Godot在 :ref:`draw_line<class_CanvasItem_method_draw_line>` 中提供方法參數來啟用抗鋸齒功能，但並非所有自訂繪圖方法都提供這個 ``抗鋸齒（antialiased）`` 參數。

source: For custom drawing methods that don't provide an ``antialiased`` parameter, you can enable 2D MSAA instead, which affects rendering in the entire viewport. This provides high-quality antialiasing, but a higher performance cost and only on specific elements. See :ref:`doc_2d_antialiasing` for more information.
de: Für benutzerdefinierte Zeichenmethoden, die keinen Parameter ``Antialiasing`` zur Verfügung stellen, können Sie stattdessen 2D MSAA aktivieren, was das Rendering im gesamten Viewport beeinflusst. Dies bietet qualitativ hochwertiges Antialiasing, aber zu höheren Performancekosten und nur für bestimmte Elemente. Siehe :ref:`doc_2d_antialiasing` für weitere Informationen.
es: Para los métodos de dibujo personalizados que no proporcionan un parámetro ``antialiased``, puede habilitar MSAA 2D, lo que afecta el renderizado en todo el viewport. Esto proporciona un antialiasing de alta calidad, pero con un mayor costo de rendimiento y solo en elementos específicos. Consulte :ref:`doc_2d_antialiasing` para obtener más información.
fr: Pour les méthodes de dessin personnalisées qui ne fournissent pas un paramètre ``antialiased``, vous pouvez activer la MSAA 2D, qui affecte le rendu dans l'ensemble de la fenêtre d'affichage. Cela fournit un anticrénelage de haute qualité, mais un coût de performance plus élevé et seulement sur des éléments spécifiques. Voir :ref:`doc_2d_antialiasing` pour plus d'informations.
ga: Maidir le modhanna líníochta saincheaptha nach soláthraíonn paraiméadar ``antialiased`, is féidir leat 2D MSAA a chumasú ina ionad sin, a théann i bhfeidhm ar rindreáil sa radharc iomlán. Soláthraíonn sé seo frith-aliasing ar ardchaighdeán, ach costas feidhmíochta níos airde agus ar eilimintí ar leith amháin. Féach:ref: `doc_2d_antialiasing` le haghaidh tuilleadh faisnéise.
pt_br: Para métodos de desenho personalizados que não fornecem um parâmetro ``antialiased``, você pode ativar o MSAA 2D em vez disso, o que afeta a renderização em todo a janela de exibição. Isso fornece antialiasing de alta qualidade, mas com um custo maior de desempenho e somente em elementos específicos. Veja :ref:`doc_2d_antialiasing` para mais informações.
ru: Для пользовательских методов рисования, которые не предоставляют параметр ``antialiased``, вы можете вместо этого включить 2D MSAA, который влияет на рендеринг во всем окне просмотра. Это обеспечивает высококачественное сглаживание, но более высокую стоимость производительности и только для определенных элементов. См. :ref:`doc_2d_antialiasing` для получения дополнительной информации.
ta: `` ஆன்டிலியாச் செய்யப்பட்ட` `அளவுருவை வழங்காத தனிப்பயன் வரைதல் முறைகளுக்கு, அதற்கு பதிலாக 2 டி எம்எச்ஏஏவை இயக்கலாம், இது முழு காட்சியகத்திலும் வழங்குதல் செய்வதை பாதிக்கிறது. இது உயர்தர ஆன்டிலியாசிங்கை வழங்குகிறது, ஆனால் அதிக செயல்திறன் செலவு மற்றும் குறிப்பிட்ட கூறுகளில் மட்டுமே. காண்க: குறிப்பு: மேலும் தகவலுக்கு `doc_2d_antialiasing`.
uk: Для спеціальних методів малювання, які не забезпечують параметр ``antialiased``, ви можете натомість увімкнути 2D MSAA, що впливає на рендеринг у всьому вікні перегляду. Це забезпечує високоякісне згладжування, але вищу вартість продуктивності та лише для певних елементів. Перегляньте :ref:`doc_2d_antialiasing` для отримання додаткової інформації.
zh_hans: 对于不提供 ``antialiased`` 参数的自定义绘图方法，你可以启用 2D MSAA，这会影响整个视口的渲染。这个功能（2D MSAA）提供了高质量的抗锯齿，但性能成本更高，而且只适用于特定元素。详情见 :ref:`doc_2d_antialiasing`\ 。
zh_hant: 對於不提供 ``抗鋸齒（antialiased）`` 參數的自訂繪圖方法，你可以啟用 2D MSAA，這會影響整個視口的算繪。這個功能（2D MSAA）提供了高品質的抗鋸齒，但性能成本更高，而且只適用於特定元素。參見 :ref:`doc_2d_antialiasing` 以瞭解更多資訊。

source: Here is a comparison of a line of minimal width (``width=-1``) drawn with ``antialiased=false``, ``antialiased=true``, and ``antialiased=false`` with 2D MSAA 2x, 4x, and 8x enabled.
de: Hier ist ein Vergleich einer Linie mit minimaler Breite (``width=-1``), gezeichnet mit ``antialiased=false``, ``antialiased=true`` und ``antialiased=false`` mit 2D MSAA 2x, 4x und 8x aktiviert.
es: Aquí hay una comparación de una línea de ancho mínimo (``width=-1``) dibujada con ``antialiased=false``, ``antialiased=true`` y ``antialiased=false`` con MSAA 2D 2x , 4x y 8x habilitados.
fr: Voici une comparaison d'une ligne de largeur minimale (``width=-1``) tracée avec ``antialiased=false``, ``antialiased=true``, et ``antialiased=false`` avec la MSAA 2D 2x, 4x et 8x activés.
ga: Seo comparáid idir líne de leithead íosta (``width = -1``) tarraingthe le ``antialiased=false``, `antialiased=true``, agus ``antialiased=fal`` le 2D MSAA 2x, 4x, agus 8x cumasaithe.
pt_br: Aqui está uma comparação de uma linha de largura mínima (``width=-1``) desenhada com ``antialiased=false``, ``antialiased=true`` e ``antialiased=false`` com MSAA 2D 2x, 4x e 8x habilitado.
ru: Ниже приведено сравнение линии минимальной ширины (``width=-1``), нарисованной с ``antialiased=false``, ``antialiased=true`` и ``antialiased=false`` при включенном 2D MSAA 2x, 4x и 8x.
ta: `` Antialiased = false``, `` antialiased = true`` உடன் வரையப்பட்ட குறைந்தபட்ச அகலத்தின் (`` அகலம் = -1``) ஒரு வரியின் ஒப்பீடு இங்கே உள்ளது , 4x, மற்றும் 8x இயக்கப்பட்டன.
uk: Ось порівняння лінії мінімальної ширини (``width=-1``), намальованої за допомогою ``antialiased=false``, ``antialiased=true`` і ``antialiased=false`` з 2D MSAA 2x , 4x і 8x увімкнено.
zh_hans: 最小宽度线段 (``width=-1``) 的对比，分别启用 ``antialiased=false`` 、 ``antialiased=true`` 以及 ``antialiased=false`` 搭配 2D MSAA 2x、4x 和 8x 抗锯齿。
zh_hant: 下圖比較了最小寬度（``width=-1``）的線條在 ``antialiased=false``、``antialiased=true``，以及啟用 2D MSAA 2x、4x、8x（``antialiased=false``）下的效果。

source: Tools
es: Herramientas
fr: Outils
ga: Uirlisí
it: Strumenti
pt_br: Ferramentas
ru: Инструменты
ta: கருவிகள்
uk: Інструменти
zh_hans: 工具
zh_hant: 工具
