Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/custom_drawing_*_2d.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, uk, zh_hans, zh_hant

source: For partial, unfilled arcs (portions of a circle shape between certain arbitrary angles), you can use the method :ref:`draw_arc <class_CanvasItem_method_draw_arc>`.
de: Für partielle, nicht ausgefüllte Bögen (Teile einer Form zwischen bestimmten, beliebigen Winkeln) können Sie die Methode :ref:`draw_arc <class_CanvasItem_method_draw_arc>` verwenden.
es: Para arcos parciales y sin relleno (porciones de una forma de círculo entre ciertos ángulos arbitrarios), puede usar el método :ref:`draw_arc <class_CanvasItem_method_draw_arc>`.
fr: Pour les arcs de cercle non remplis (portions d'une forme de cercle entre certains angles arbitraires), vous pouvez utiliser la méthode :ref:`draw_arc <class_CanvasItem_method_draw_arc>`.
ga: Le haghaidh stuanna páirteacha neamhlíonta (codanna de chruth ciorcail idir uillinneacha áirithe treallach), is féidir leat an modh :ref:`draw_arc <class_CanvasItem_method_draw_arc>` a úsáid.
pt_br: Para arcos parciais, não preenchidos (porções de uma forma círculo entre certos ângulos arbitrários), você pode usar o método :ref:`draw_arc <class_CanvasItem_method_draw_arc>`.
ru: Для неполных, незаполненных дуг (частей формы круга между произвольными углами), вы можете использовать метод :ref:`draw_arc <class_CanvasItem_method_draw_arc>`.
ta: பகுதி, நிரப்பப்படாத வளைவுகளுக்கு (சில தன்னிச்சையான கோணங்களுக்கு இடையில் ஒரு வட்ட வடிவத்தின் பகுதிகள்), நீங்கள் முறையைப் பயன்படுத்தலாம்: குறிப்பு: `டிரா_ஆர்க் <class_canvasitem_method_draw_arc>`.
uk: Для часткових незаповнених дуг (частин форми кола між певними довільними кутами) ви можете використовувати метод :ref:`draw_arc <class_CanvasItem_method_draw_arc>`.
zh_hans: 对于部分未填充的圆弧（某些任意角度之间的圆形部分），可以使用方法 :ref:`draw_arc <class_CanvasItem_method_draw_arc>`。
zh_hant: 若要繪製不填滿的圓弧（由特定角度決定的圓的一部分），可以用 :ref:`draw_arc <class_CanvasItem_method_draw_arc>` 方法。

source: Drawing lines
de: Zeichnen von Linien
es: Dibujar líneas
fr: Dessiner des lignes
ga: Línte líníochta
it: Disegno di linee
pt_br: Desenhando linhas
ru: Отрисовка линий
ta: வரைதல் கோடுகள்
uk: Малювання ліній
zh_hans: 绘制线
zh_hant: 繪製線條

source: To draw the final shape (the nose) we will use a line to approximate it.
de: Um die letzte Form (die Nase) zu zeichnen, verwenden wir eine Linie, um sie anzunähern.
es: Para dibujar la última forma (la nariz) usaremos una línea para aproximarla.
fr: Pour dessiner la forme finale (le nez) nous utiliserons une ligne pour l'approximer.
ga: Chun an cruth deiridh (an srón) a tharraingt úsáidfimid líne chun é a mheas.
pt_br: Para desenhar a forma final (o nariz) usaremos uma linha para aproximá-la.
ru: Что отрисовать последнюю часть (нос) мы используем линию.
ta: இறுதி வடிவத்தை (மூக்கு) வரைய ஒரு வரியைப் பயன்படுத்துவோம்.
uk: Щоб намалювати остаточну форму (ніс), ми використаємо лінію, щоб наблизити її.
zh_hans: 为了绘制最终的形状（鼻子），我们将使用一条线来近似模拟它。
zh_hant: 最後要繪製鼻子這個形狀時，我們會用一條線來近似。

source: :ref:`draw_line <class_CanvasItem_method_draw_line>` can be used to draw a single segment by providing its start and end coordinates as arguments, like this:
de: :ref:`draw_line <class_CanvasItem_method_draw_line>` kann verwendet werden, um ein einzelnes Segment zu zeichnen, indem man seine Start- und Endkoordinaten als Argumente angibt, wie hier:
es: :ref:`draw_line <class_CanvasItem_method_draw_line>` se puede usar para dibujar un solo segmento proporcionando sus coordenadas inicial y final como argumentos, como éste:
fr: :ref:`draw_line <class_CanvasItem_method_draw_line>` peut être utilisé pour dessiner un seul segment en fournissant ses coordonnées de début et de fin comme arguments, comme ceci :
ga: :ref: `draw_line <class_CanvasItem_method_draw_line>` is féidir é a úsáid chun teascán amháin a tharraingt ach a chomhordanáidí tosaigh agus deiridh a sholáthar mar argóintí, mar seo:
pt_br: :ref:`draw_line <class_CanvasItem_method_draw_line>` pode ser usado para desenhar um único segmento fornecendo suas coordenadas de início e fim como argumentos, como este:
ru: :ref:`draw_line <class_CanvasItem_method_draw_line>` может быть использован чтобы отрисовать одиночный сегмент используя начальные и конечные координаты для аргументов, подобно этому:
ta: :ref:`draw_line <class_CanvasItem_method_draw_line>` can be used பெறுநர் draw a ஒற்றை segment by providing its தொடங்கு and end coordinates அச் arguments, like this:
uk: :ref:`draw_line <class_CanvasItem_method_draw_line>` можна використовувати, щоб намалювати один сегмент, надавши його початкову та кінцеву координати як аргументи, наприклад:
zh_hans: 通过提供其开始和结束坐标作为参数，\ :ref:`draw_line <class_CanvasItem_method_draw_line>` 可用于绘制单个线段，如下所示：
zh_hant: 你可以用 :ref:`draw_line <class_CanvasItem_method_draw_line>` 方法來畫一段線段，只需提供起點和終點座標，如下：

source: You should now be able to see the following shape on screen:
de: Sie sollten nun folgende Form auf dem Bildschirm sehen können:
es: Ahora deberías ser capaz de ver la siguiente figura en pantalla:
fr: Vous devriez maintenant être capable de voir la forme suivante à l'écran :
ga: Ba chóir duit anois a bheith in ann an cruth seo a leanas a fheiceáil ar an scáileán:
pt_br: Agora você deve ser capaz de ver a seguinte forma na tela:
ru: Вы должны сейчас увидеть следующую форму на экране:
ta: நீங்கள் இப்போது பின்வரும் வடிவத்தை திரையில் காண முடியும்:
uk: Тепер ви зможете побачити на екрані таку форму:
zh_hans: 你现在应该可以在屏幕上看到如下形状：
zh_hant: 現在你應該能在螢幕上看到下列形狀：

source: Note that if multiple unconnected lines are going to be drawn at the same time, you may get additional performance by drawing all of them in a single call, using the :ref:`draw_multiline <class_CanvasItem_method_draw_multiline>` method.
de: Wenn mehrere unverbundene Linien gleichzeitig gezeichnet werden sollen, können Sie zusätzliche Performance erzielen, indem Sie alle Linien in einem einzigen Aufruf zeichnen, indem Sie die Methode :ref:`draw_multiline <class_CanvasItem_method_draw_multiline>` verwenden.
es: Tenga en cuenta que si se van a dibujar varias líneas no conectadas al mismo tiempo, puede obtener un mejor rendimiento dibujándolas todas en una sola llamada, utilizando el método :ref:`draw_multiline <class_CanvasItem_method_draw_multiline>`.
fr: Notez que si de multiples lignes non connectées vont être dessinées en même temps, vous pouvez obtenir une meilleure performance en les dessinant tous en un seul appel, en utilisant la méthode :ref:`draw_multiline <class_CanvasItem_method_draw_multiline>`.
ga: Tabhair faoi deara, má tá línte iomadúla neamhcheangailte le tarraingt ag an am céanna, seans go bhfaighidh tú feidhmíocht bhreise trí iad go léir a tharraingt in aon ghlao amháin, ag baint úsáide as an modh :ref:`draw_multiline <class_CanvasItem_method_draw_multiline>`.
pt_br: Note que se várias linhas não conectadas forem desenhadas ao mesmo tempo, você pode obter desempenho adicional desenhando todas elas em uma única chamada, usando o método :ref:`draw_multiline <class_CanvasItem_method_draw_multiline>`.
ru: Заметьте что при отрисовке множественных несоединенных линий, вы можете получить дополнительную производительность рисуя все линии одним вызовом метода :ref:`draw_multiline <class_CanvasItem_method_draw_multiline>`.
ta: ஒரே நேரத்தில் பல இணைக்கப்படாத கோடுகள் வரையப்படப்போகின்றன என்றால், அவை அனைத்தையும் ஒரே அழைப்பில் வரைவதன் மூலம் கூடுதல் செயல்திறனைப் பெறலாம்: rew: `draw_multiline <class_canvasitem_method_draw_multiline>` முறை.
uk: Зауважте, що якщо кілька незв’язаних ліній малюватимуться одночасно, ви можете отримати додаткову продуктивність, намалювавши їх усі за один виклик за допомогою методу :ref:`draw_multiline <class_CanvasItem_method_draw_multiline>`.
zh_hans: 请注意，如果要同时绘制多条未连接的线，可以通过使用 :ref:`draw_multiline <class_CanvasItem_method_draw_multiline>` 方法在一次调用中绘制所有线，来获得额外的性能提升。
zh_hant: 注意，如果要同時畫多條不連接的線段，可以用 :ref:`draw_multiline <class_CanvasItem_method_draw_multiline>` 方法一次畫出所有線段，這樣效能會更好。

source: Drawing text
de: Zeichnen von Text
es: Dibujando texto
fr: Dessiner du texte
ga: Téacs líníochta
it: Disegno di testo
pt_br: Desenhando texto
ru: Отрисовка текста
ta: வரைதல் உரை
uk: Малювання тексту
zh_hans: 绘制文本
zh_hant: 繪製文字

source: While using the :ref:`Label <class_Label>` Node is the most common way to add text to your application, the low-level `_draw` function includes functionality to add text to your custom Node drawing. We will use it to add the name "GODOT" under the robot head.
ru: Хотя использование узла :ref:`Label <class_Label>` является наиболее распространенным способом добавления текста в ваше приложение, низкоуровневая функция "_draw" включает в себя возможности для добавления текста в ваш пользовательский рисунок узла. Мы используем его, чтобы добавить "GODOT" под головой робота.
ta: பயன்படுத்தும் போது: ref: `லேபிள் <class_label>` உங்கள் பயன்பாட்டிற்கு உரையைச் சேர்க்க மிகவும் பொதுவான வழியாகும், குறைந்த அளவிலான `_draw` செயல்பாடு உங்கள் தனிப்பயன் முனை வரைபடத்தில் உரையைச் சேர்க்க செயல்பாட்டை உள்ளடக்கியது. ரோபோ தலையின் கீழ் "கோடோட்" என்ற பெயரைச் சேர்க்க இதைப் பயன்படுத்துவோம்.
zh_hans: 虽然向程序中添加文本的最常见方法是使用 :ref:`Label <class_Label>` 节点，但是低阶的 `_draw` 函数提供了在自定义 Node 绘制时添加文本的功能。我们就用这个方法在机器人的脑袋下面加上它的名字“GODOT”。
zh_hant: 雖然最常見的文字顯示方法是使用 :ref:`Label <class_Label>` 節點，但底層的 `_draw` 函式也能讓你在自訂節點繪圖中加入文字。我們會用這個方法在機器人頭下方加上「GODOT」字樣。

source: We will use the :ref:`draw_string <class_CanvasItem_method_draw_string>` method to do it, like this:
de: Wir werden die Methode :ref:`draw_string <class_CanvasItem_method_draw_string>` verwenden, um dies zu tun:
es: Usaremos el método :ref:`draw_string <class_CanvasItem_method_draw_string>` para hacerlo, de este modo:
fr: Nous utiliserons la méthode :ref:`draw_string <class_CanvasItem_method_draw_string>` pour le faire, comme ceci :
ga: Úsáidfimid an modh :ref:`draw_string <class_CanvasItem_method_draw_string>` chun é a dhéanamh, mar seo:
pt_br: Vamos usar o método :ref:`draw_string <class_CanvasItem_method_draw_string>` para fazê-lo, assim:
ru: Мы будем использовать :ref:`draw_string <class_CanvasItem_method_draw_string>` метод, для того чтобы сделать это, вот так:
ta: நாம் பயன்படுத்துவோம்: ref: `draw_string <class_canvasitem_method_draw_string>` இதைச் செய்வதற்கான முறை, இது போன்றது:
uk: Для цього ми використаємо метод :ref:`draw_string <class_CanvasItem_method_draw_string>`, наприклад:
zh_hans: 具体做法是调用 :ref:`draw_string <class_CanvasItem_method_draw_string>`\ ，类似于这样：
zh_hant: 這裡我們會用 :ref:`draw_string <class_CanvasItem_method_draw_string>` 方法來達成：

source: Here we first load into the defaultFont variable the configured default theme font (a custom one can be set instead) and then we pass the following parameters: font, position, text, horizontal alignment, width, and font size.
de: Hier laden wir zunächst in die defaultFont-Variable die konfigurierte Default-Schriftart des Themes (stattdessen kann eine benutzerdefinierte Schriftart eingestellt werden) und übergeben dann die folgenden Parameter: Schriftart, Position, Text, horizontale Ausrichtung, Breite und Schriftgröße.
es: Aquí primero cargamos en la variable defaultFont la fuente del tema configurada de manera predeterminada (en su lugar se puede configurar una personalizada) y luego pasamos los siguientes parámetros: fuente, posición, texto, alineación horizontal, ancho y tamaño de fuente.
fr: Ici, nous chargeons d'abord dans la variable defaultFont la police par défaut configurée (une police personnalisée peut être définie à la place), puis nous passons les paramètres suivants : police, position, texte, alignement horizontal, largeur et taille de police.
ga: Anseo luchaimid an cló téama réamhshocraithe cumraithe isteach san athróg DefaultFont ar dtús (is féidir ceann saincheaptha a shocrú ina ionad) agus ansin cuirimid na paraiméadair seo a leanas: cló, suíomh, téacs, ailíniú cothrománach, leithead agus méid cló.
pt_br: Aqui nós primeiro carregamos a variável defaultFont a fonte padrão configurada no tema(uma personalizada pode ser definida no lugar) e então passamos os seguintes parâmetros: fonte, posição, texto, alinhamento horizontal, largura e tamanho da fonte.
ru: Здесь мы сначала загружаем в переменную defaultFont настроенный шрифт темы по умолчанию (вместо него можно установить пользовательский шрифт), а затем передаем следующие параметры: шрифт, положение, текст, горизонтальное выравнивание, ширину и размер шрифта.
ta: இங்கே நாம் முதலில் இயல்புநிலை -இயல்பான கருப்பொருள் எழுத்துருவை (அதற்கு பதிலாக ஒரு தனிப்பயன் ஒன்றை அமைக்கலாம்) இயல்புநிலைஃபாண்ட் மாறியில் ஏற்றுகிறோம், பின்னர் பின்வரும் அளவுருக்களை அனுப்புகிறோம்: எழுத்துரு, நிலை, உரை, கிடைமட்ட சீரமைப்பு, அகலம் மற்றும் எழுத்துரு அளவு.
uk: Тут ми спочатку завантажуємо в змінну defaultFont налаштований шрифт теми за замовчуванням (замість нього можна встановити спеціальний), а потім передаємо наступні параметри: шрифт, положення, текст, горизонтальне вирівнювання, ширину та розмір шрифту.
zh_hans: 我们这里首先将 defaultFont 变量配置为默认的主题字体（也可以设为自定义字体），然后传入字体、位置、文本、水平对齐、宽度、字体大小等参数。
zh_hant: 這裡我們先將預設主題字型載入到 defaultFont 變數（你也可以用自訂字型），接著傳入參數：字型、位置、文字內容、水平對齊方式、寬度，以及字體大小。

source: You should see the following on your screen:
de: Auf Ihrem Bildschirm sollten Sie folgendes sehen:
es: Deberías ver lo siguiente en tu pantalla:
fr: Vous devriez voir ce qui suit sur votre écran :
ga: Ba cheart duit na rudaí seo a leanas a fheiceáil ar do scáileán:
it: Dovresti vedere sul tuo schermo quanto segue:
pt_br: Você deve ver o seguinte em sua tela:
ru: Вот, что вы увидите на экране:
ta: உங்கள் திரையில் பின்வருவனவற்றைக் காண வேண்டும்:
uk: Ви повинні побачити на екрані наступне:
zh_hans: 你应当在屏幕上看到如下所示的图像：
zh_hant: 你應該會在螢幕上看到下列畫面：

source: Additional parameters as well as other methods related to text and characters can be found on the :ref:`CanvasItem <class_CanvasItem>` class reference.
de: Zusätzliche Parameter sowie andere Methoden, die sich auf Text und Zeichen beziehen, sind in der Klassenreferenz :ref:`CanvasItem <class_CanvasItem>` zu finden.
es: Se pueden encontrar parámetros adicionales, así como otros métodos relacionados con texto y caracteres, en la referencia de la clase :ref:`CanvasItem <class_CanvasItem>`.
fr: Des paramètres supplémentaires ainsi que d'autres méthodes liées au texte et aux caractères peuvent être trouvés sur la référence de classe de :ref:`CanvasItem <class_CanvasItem>`.
ga: Is féidir paraiméadair bhreise chomh maith le modhanna eile a bhaineann le téacs agus carachtair a fháil ar an :ref:`CanvasItem <class_CanvasItem>` tagairt ranga.
pt_br: Parâmetros adicionais, bem como outros métodos relacionados ao texto e caracteres podem ser encontrados na referência de classe :ref:`CanvasItem <class_CanvasItem>`.
ru: Дополнительные параметры, а также другие методы, связанные с текстом и символами, можно найти в справочнике классов :ref:`CanvasItem <class_CanvasItem>`.
ta: கூடுதல் அளவுருக்கள் மற்றும் உரை மற்றும் எழுத்துக்கள் தொடர்பான பிற முறைகள்: ref: `canvasitem <class_canvasitem>` வகுப்பு குறிப்பு.
uk: Додаткові параметри, а також інші методи, пов’язані з текстом і символами, можна знайти в довідці про клас :ref:`CanvasItem <class_CanvasItem>`.
zh_hans: 其他参数以及其他和文本字符相关的方法都可以在 :ref:`CanvasItem <class_CanvasItem>` 的类参考中找到。
zh_hant: 更多文字相關的參數與方法，請參考 :ref:`CanvasItem <class_CanvasItem>` 類別說明文件。

source: Show the drawing while editing
de: Anzeigen der Zeichnung während der Bearbeitung
es: Mostrar el dibujo durante la edición
fr: Afficher le dessin lors de l'édition
ga: Taispeáin an líníocht agus tú ag eagarth
pt_br: Mostrar o desenho durante a edição
ru: Показывать рисунок во время редактирования
ta: திருத்துதல் செய்யும் போது வரைபடத்தைக் காட்டு
uk: Показувати малюнок під час редагування
zh_hans: 编辑时显示绘制
zh_hant: 在編輯時顯示繪圖

source: While the code so far is able to draw the logo on a running window, it will not show up on the ``2D view`` on the editor. In certain cases you would also like to show your custom Node2D or control on the editor, to position and scale it appropriately, like most other nodes do.
de: Während der bisherige Code in der Lage ist, das Logo in einem laufenden Fenster zu zeichnen, wird es nicht in der ``2D-Ansicht`` des Editors angezeigt. In bestimmten Fällen möchten Sie Ihr eigenes Node2D oder Steuerelement auch im Editor anzeigen, um es entsprechend zu positionieren und zu skalieren, wie es die meisten anderen Nodes tun.
es: Si bien hasta ahora el código puede dibujar el logotipo en una ventana en ejecución, no aparecerá en la ``vista 2D`` del editor. En ciertos casos, también le gustaría mostrar su Node2D personalizado o control en el editor, para posicionarlo y escalarlo adecuadamente, como lo hacen la mayoría de los otros nodos.
fr: Alors que le code est jusqu'à présent capable de dessiner le logo sur une fenêtre d'exécution, il ne s'affichera pas sur la ``vue 2D`` de l'éditeur. Dans certains cas, vous pouvez souhaiter également montrer votre contrôle ou Node2D personnalisé dans l'éditeur, pour le positionner et l'élargir correctement, comme la plupart des autres nœuds font.
ga: Cé go bhfuil an cód go dtí seo in ann an lógó a tharraingt ar fhuinneog reatha, ní thaispeánfaidh sé suas ar an ``amharc 2D ``ar an eagarthóir. I gcásanna áirithe ba mhaith leat do Node2D saincheaptha nó rialú a thaispeáint ar an eagarthóir, chun é a shuíomh agus a scála go cuí, mar a dhéanann an chuid is mó de na nóid eile.
pt_br: Enquanto o código até agora é capaz de desenhar o logotipo em uma janela em execução, ele não aparecerá na view ``2D`` no editor. Em certos casos, você também gostaria de mostrar seu Node2D personalizado ou controle no editor, posicionar e dimensioná-lo adequadamente, como a maioria dos outros nós fazem.
ru: Хотя код пока что может рисовать логотип в запущенном окне, он не будет отображаться в ``2D view`` редактора. В некоторых случаях вы также захотите отобразить свой пользовательский Node2D или элемент управления в редакторе, чтобы разместить и масштабировать его соответствующим образом, как это делают большинство других узлов.
ta: இதுவரை குறியீடு இயங்கும் சாளரத்தில் லோகோவை வரைய முடியும் என்றாலும், அது எடிட்டரில் `` 2 டி பார்வை`` இல் காண்பிக்கப்படாது. சில சந்தர்ப்பங்களில், உங்கள் தனிப்பயன் நோட் 2 டி அல்லது எடிட்டரில் கட்டுப்பாட்டைக் காட்ட விரும்புகிறீர்கள், மற்ற முனைகளைப் போலவே அதை நிலைநிறுத்தவும் அளவிடவும்.
uk: Хоча код наразі може намалювати логотип у запущеному вікні, він не відображатиметься у ``2D-виді`` редактора. У деяких випадках ви також бажаєте показати свій власний Node2D або елемент керування в редакторі, щоб розташувати та масштабувати його належним чином, як це робить більшість інших вузлів.
zh_hans: 虽然目前这段代码已经可以在运行中的窗口中绘制 Logo，但却并没有在编辑器中的 ``2D 视图`` 上显示。在某些特定情况下，你希望自制的 Node2D 或者控件节点能够在编辑器中显示，跟其他绝大多数节点一样，这以便于定位和缩放。
zh_hant: 目前為止的程式碼雖然能在執行時畫出 logo，但在編輯器的「2D 檢視」中並不會顯示。有些情況下，你也會希望自訂的 Node2D 或控制項能在編輯器中顯示，方便定位和調整大小，就像其他節點一樣。

source: To show the logo directly on the editor (without running it), you can use the :ref:`@tool<doc_gdscript_tool_mode>` annotation to request the custom drawing of the node to also appear while editing, like this:
de: Um das Logo direkt im Editor anzuzeigen (ohne es auszuführen), können Sie die :ref:`@tool <doc_gdscript_tool_mode>`-Annotation verwenden, um die benutzerdefinierte Zeichnung des Nodes auch während der Bearbeitung anzeigen zu lassen, etwa so:
es: Para mostrar el logotipo directamente en el editor (sin ejecutarlo), puede usar la anotación :ref:`@tool<doc_gdscript_tool_mode>` para solicitar que el dibujo personalizado del nodo también aparezca durante la edición, así:
fr: Pour afficher le logo directement dans l'éditeur (sans l'exécuter), vous pouvez utiliser l'annotation :ref:`@tool<doc_gdscript_tool_mode>` pour demander que le dessin personnalisé du nœud apparaisse également pendant l'édition, comme ceci :
ga: Chun an lógó a thaispeáint go díreach ar an eagarthóir (gan é a rith), is féidir leat an nóta :ref:`@tool <doc_gdscript_tool_mode>` a úsáid chun iarraidh ar líníocht shaincheaptha an nód a bheith le feiceáil le linn eagarthóireachta, mar seo:
pt_br: Para mostrar o logotipo diretamente no editor (sem executá-lo), você pode usar o :ref:`@tool<doc_gdscript_tool_mode>` anotação para solicitar o desenho personalizado do nó também aparecer enquanto edita, assim:
ru: Чтобы отобразить логотип непосредственно в редакторе (не запуская его), можно использовать аннотацию :ref:`@tool<doc_gdscript_tool_mode>`, чтобы запросить отображение пользовательского рисунка узла во время редактирования, например:
ta: லோகோவை எடிட்டரில் நேரடியாகக் காட்ட (அதை இயக்காமல்), நீங்கள் பயன்படுத்தலாம்: குறிப்பு: `tool <doc_gdscript_tool_mode>` சிறுகுறிப்பு முனையின் தனிப்பயன் வரைபடத்தை திருத்துதல் செய்யும் போது தோன்றும், இது போன்றது:
uk: Щоб показати логотип безпосередньо в редакторі (не запускаючи його), ви можете використати анотацію :ref:`@tool<doc_gdscript_tool_mode>`, щоб надіслати запит на те, щоб настроюваний малюнок вузла також з’являвся під час редагування, ось так:
zh_hans: 为了能够在编辑器中直接显示 Logo，而不必运行程序，你可以使用 :ref:`@tool<doc_gdscript_tool_mode>` 注解，来要求自制的绘制节点在编辑时显示，就像这样：
zh_hant: 若要讓 logo 直接在編輯器中顯示（不執行時也能看見），你可以加上 :ref:`@tool<doc_gdscript_tool_mode>` 註解，讓自訂節點的繪圖也會在編輯時出現，例如：
