Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/custom_drawing_*_2d.po
Languages: de, es, fr, ga, it, pt_br, ru, ta, uk, zh_hans, zh_hant

source: Note the lower part of the logo looks segmented- this is because a low amount of points were used to define that part. To simulate a smooth curve, we could add more points to our array, or maybe use a mathematical function to interpolate a curve and create a smooth shape from code (see :ref:`example 2<doc_draw_custom_example_2>`).
de: Beachten Sie, dass der untere Teil des Logos segmentiert aussieht - das liegt daran, dass nur eine geringe Anzahl von Punkten verwendet wurde, um diesen Teil zu definieren. Um eine glatte Kurve zu simulieren, könnten wir mehr Punkte zu unserem Array hinzufügen oder vielleicht eine mathematische Funktion verwenden, um eine Kurve zu interpolieren und eine geglättete Form aus dem Code zu erstellen (siehe :ref:`Beispiel 2<doc_draw_custom_example_2>`).
es: Tenga en cuenta que la parte inferior del logotipo parece segmentada; esto se debe a que se utilizó una cantidad baja de puntos para definir esa parte. Para simular una curva suave, podríamos agregar más puntos a nuestra matriz, o tal vez usar una función matemática para interpolar una curva y crear una forma suave a partir del código (ver :ref:`ejemplo 2<doc_draw_custom_example_2>`).
fr: Notez que la partie inférieure du logo semble segmentée - c'est parce qu'une faible quantité de points ont été utilisés pour définir cette partie. Pour simuler une courbe lisse, nous pourrions ajouter plus de points à notre tableau, ou peut-être utiliser une fonction mathématique pour interpoler une courbe et créer une forme lisse à partir du code (voir :ref:`example 2<doc_draw_custom_example_2>`).
ga: Tabhair faoi deara go bhfuil cuma deighilte ar an gcuid íochtair den lógó - is é sin toisc gur úsáideadh líon íseal pointí chun an chuid sin a shainiú. Chun cuar mín a insamhladh, d'fhéadfaimis níos mó pointí a chur lenár n-eagar, nó b'fhéidir feidhm matamaitice a úsáid chun cuar a idirshuí agus cruth mín a chruthú ón gcód (féach :ref:`sampla 2<doc_draw_custom_example_2>`).
pt_br: Note a parte inferior do logotipo parece segmentada - isto é porque uma baixa quantidade de pontos foram usados para definir essa parte. Para simular uma curva lisa, poderíamos adicionar mais pontos ao nosso array, ou talvez usar uma função matemática para interpor uma curva e criar uma forma lisa do código (ver :ref:`example 2<doc_draw_custom_example_2>`).
ru: Обратите внимание, что нижняя часть логотипа выглядит сегментированной — это потому, что для определения этой части было использовано малое количество точек. Чтобы смоделировать плавную кривую, мы могли бы добавить больше точек в наш массив или, может быть, использовать математическую функцию для интерполяции кривой и создания плавной формы из кода (см. :ref:`example 2<doc_draw_custom_example_2>`).
ta: லோகோவின் கீழ் பகுதி பிரிக்கப்பட்டதாகத் தெரிகிறது என்பதைக் கவனியுங்கள்- ஏனென்றால் அந்த பகுதியை வரையறுக்க குறைந்த அளவிலான புள்ளிகள் பயன்படுத்தப்பட்டன. ஒரு மென்மையான வளைவை உருவகப்படுத்த, எங்கள் வரிசையில் அதிக புள்ளிகளைச் சேர்க்கலாம், அல்லது ஒரு வளைவை ஒன்றிணைக்க ஒரு கணித செயல்பாட்டைப் பயன்படுத்தலாம் மற்றும் குறியீட்டிலிருந்து மென்மையான வடிவத்தை உருவாக்கலாம் (பார்க்க: குறிப்பு: `எடுத்துக்காட்டு 2 <doc_draw_custom_example_2>`).
uk: Зверніть увагу, що нижня частина логотипу виглядає сегментованою – це тому, що для визначення цієї частини було використано низьку кількість точок. Щоб імітувати плавну криву, ми могли б додати більше точок до нашого масиву або, можливо, використати математичну функцію для інтерполяції кривої та створення плавної форми з коду (див. :ref:`приклад 2<doc_draw_custom_example_2>`).
zh_hans: 注意图标的下部看起来像是分段的，这是因为用于定义该部分的点数量较少。为了模拟平滑曲线，可以向数组中添加更多点，或者使用数学函数来插值曲线以从代码中创建平滑形状（参见 :ref:`示例 2<doc_draw_custom_example_2>`）。
zh_hant: 請注意，Logo 下半部看起來呈現分段狀，這是因為這部分只用了少量點來定義。若想要模擬平滑曲線，可以在陣列中增加更多點，或用數學函式來插值產生曲線，直接在程式碼中建立平滑形狀（詳見 :ref:`範例 2<doc_draw_custom_example_2>`）。

source: Polygons will always **connect its last defined point to its first one** in order to have a closed shape.
de: Polygone werden immer **ihren letzten definierten Punkt mit ihrem ersten verbinden**, um eine geschlossene Form zu erhalten.
es: Los polígonos siempre **conectarán su último punto definido con el primero** para tener una forma cerrada.
fr: Les polygones vont toujours **connecter leur dernier point défini à leur premier** afin d'avoir une forme fermée.
ga: Ceanglóidh polagóin i gcónaí** a phointe sainithe deireanach lena chéad cheann** d'fhonn cruth dúnta a bheith acu.
pt_br: Os polígonos sempre **conectam seu último ponto definido ao seu primeiro** a fim de ter uma forma fechada.
ru: Многоугольники всегда **соединяют свою последнюю определенную точку с первой**, чтобы иметь замкнутую форму.
ta: பலகோணங்கள் எப்போதுமே ** அதன் கடைசி வரையறுக்கப்பட்ட புள்ளியை அதன் முதல் ஒன்றை ** உடன் இணைக்கும்.
uk: Багатокутники завжди **з’єднуватимуть свою останню визначену точку з першою**, щоб мати закриту форму.
zh_hans: 多边形为了形成封闭的形状，总是会将 **最后一个定义的点连接到第一个点** 。
zh_hant: 多邊形會自動將最後一個點與第一個點連接，形成封閉形狀。

source: Drawing connected lines
de: Zeichnen von verbundenen Linien
es: Dibujar líneas conectadas
fr: Dessiner des lignes connectées
ga: Línte nasctha a líní
it: Disegno di linee connesse
pt_br: Desenhando linhas conectadas
ru: Отрисовка соединенных линий
ta: இணைக்கப்பட்ட கோடுகளை வரைதல்
uk: Малювання сполучних ліній
zh_hans: 绘制连接线
zh_hant: 繪製連續線段

source: Drawing a sequence of connected lines that don't close down to form a polygon is very similar to the previous method. We will use a connected set of lines to draw Godot's logo mouth.
de: Das Zeichnen einer Folge von verbundenen Linien, die sich nicht zu einem Polygon schließen, ist der vorherigen Methode sehr ähnlich. Wir werden eine zusammenhängende Menge von Linien verwenden, um den Mund des Godot-Logos zu zeichnen.
es: Dibujar una secuencia de líneas conectadas que no se cierran para formar un polígono es muy similar al método anterior. Usaremos un conjunto de líneas conectadas para dibujar la boca del logo de Godot.
fr: Dessiner une séquence de lignes connectées qui ne se rejoignent pas pour former un polygone est très semblable à la méthode précédente. Nous utiliserons un ensemble de lignes connectées pour dessiner la bouche du logo de Godot.
ga: Tá seicheamh línte ceangailte a tharraingt nach ndúnann síos chun polagún a fhoirmiú an-chosúil leis an modh roimhe seo. Úsáidfimid sraith línte ceangailte chun béal lógó Godot a tharraingt.
pt_br: Desenhar uma sequência de linhas conectadas que não se fecham para formar um polígono é muito semelhante ao método anterior. Usaremos um conjunto de linhas conectadas para desenhar a boca do logotipo do Godot.
ru: Рисование последовательности соединенных линий, которые не замыкаются, чтобы сформировать многоугольник, очень похоже на предыдущий метод. Мы будем использовать соединенный набор линий, чтобы нарисовать рот логотипа Godot.
ta: பலகோணத்தை உருவாக்க மூடாத இணைக்கப்பட்ட வரிகளின் வரிசையை வரைவது முந்தைய முறைக்கு மிகவும் ஒத்ததாகும். கோடோட்டின் லோகோ வாயை வரைய இணைக்கப்பட்ட வரிகளின் தொகுப்பைப் பயன்படுத்துவோம்.
uk: Малювання послідовності з’єднаних ліній, які не замикаються, утворюючи багатокутник, дуже схоже на попередній метод. Ми використаємо зв’язаний набір ліній, щоб намалювати рот логотипа Годо.
zh_hans: 绘制一系列不封闭成多边形的连接线与之前的方法非常相似。我们将使用一系列连接的线条来绘制 Godot 图标的嘴巴。
zh_hant: 繪製一串不封閉成多邊形的連續線段，其方式與前述方法相似。我們會用連續線段來繪製 Godot 標誌上的嘴巴。

source: First, we will define the list of coordinates that form the mouth shape, like this:
de: Zunächst definieren wir die Liste der Koordinaten, für die Form des Mundes, wie folgt:
es: Primero, definiremos la lista de coordenadas que forman la forma de la boca, de esta manera:
fr: D'abord, nous définirons la liste des coordonnées qui forment la forme de la bouche, comme ceci :
ga: Ar dtús, sainmhíneoimid liosta na gcomhordanáidí a fhoirmíonn cruth an bhéil, mar seo:
pt_br: Primeiro, vamos definir a lista de coordenadas que formam a forma da boca, assim:
ru: Сначала мы определим список координат, формирующих форму рта, например:
ta: முதலில், இது போன்ற வாய் வடிவத்தை உருவாக்கும் ஒருங்கிணைப்புகளின் பட்டியலை வரையறுப்போம்:
uk: Спочатку ми визначимо список координат, які формують форму рота, ось так:
zh_hans: 首先，我们将定义构成嘴巴形状的坐标列表，如下所示：
zh_hant: 首先，定義構成嘴巴形狀的座標列表，如下所示：

source: We will load these coordinates into a variable and define an additional variable with the configurable line thickness:
de: Wir werden diese Koordinaten in eine Variable laden und eine weitere Variable mit der konfigurierbaren Linienstärke definieren:
es: Cargaremos estas coordenadas en una variable y definiremos una variable adicional con el grosor de línea configurable:
fr: Nous allons charger ces coordonnées dans une variable et définir une variable supplémentaire pour une épaisseur de ligne configurable :
ga: Déanfaimid na comhordanáidí seo a luchtú isteach i athróg agus sainmhíneoimid athróg breise leis an tiús líne inchumraithe:
pt_br: Vamos carregar essas coordenadas em uma variável e definir uma variável adicional com a espessura da linha configurável:
ru: Мы загрузим эти координаты в переменную и определим дополнительную переменную с настраиваемой толщиной линии:
ta: இந்த ஆயங்களை ஒரு மாறியாக ஏற்றுவோம் மற்றும் உள்ளமைக்கக்கூடிய வரி தடிமன் மூலம் கூடுதல் மாறியை வரையறுப்போம்:
uk: Ми завантажимо ці координати в змінну та визначимо додаткову змінну з настроюваною товщиною лінії:
zh_hans: 我们将把这些坐标加载到一个变量中，并定义另一个变量来设置可配置的线条粗细：
zh_hant: 我們會將這些座標載入一個變數，並另外定義一個可調整的線寬變數：

source: And finally we will use the method :ref:`draw_polyline <class_CanvasItem_method_draw_polyline>` to actually draw the line, like this:
de: Und schließlich werden wir die Methode :ref:`draw_polyline <class_CanvasItem_method_draw_polyline>` verwenden, um die Linie tatsächlich zu zeichnen, etwa so:
es: Y finalmente usaremos el método :ref:`draw_polyline <class_CanvasItem_method_draw_polyline>` para dibujar la línea, de la siguiente manera:
fr: Et finalement nous utiliserons la méthode :ref:`draw_polyline <class_CanvasItem_method_draw_polyline>` afin de dessiner la ligne, comme ceci :
ga: Agus ar deireadh úsáidfimid an modh :ref:`draw_polyline <class_CanvasItem_method_draw_polyline>` chun an líne a tharraingt, mar seo:
pt_br: E finalmente usaremos o método :ref:`draw_polyline <class_CanvasItem_method_draw_polyline>` para realmente desenhar a linha, assim:
ru: И наконец, мы воспользуемся методом :ref:`draw_polyline <class_CanvasItem_method_draw_polyline>`, чтобы нарисовать линию, вот так:
ta: இறுதியாக நாம் முறையைப் பயன்படுத்துவோம்: ref: `draw_polyline <class_canvasitem_method_draw_polyline>` உண்மையில் இது போன்ற வரியை வரைய:
uk: І, нарешті, ми використаємо метод :ref:`draw_polyline <class_CanvasItem_method_draw_polyline>`, щоб фактично намалювати лінію, ось так:
zh_hans: 最终我们使用方法 :ref:`draw_polyline <class_CanvasItem_method_draw_polyline>` 来真正绘制这条线，就像这样：
zh_hant: 最後，我們用 :ref:`draw_polyline <class_CanvasItem_method_draw_polyline>` 方法來真正畫出這條線，如下：

source: You should get the following output:
de: Sie sollten die folgende Ausgabe erhalten:
es: Deberías obtener la siguiente salida:
fr: Vous devriez obtenir la sortie suivante :
ga: Ba chóir duit an t-aschur seo a leanas a fháil:
it: Dovresti ottenere il seguente risultato:
pt_br: Você deve obter a seguinte saída:
ru: Вы должны получить следующий вывод:
ta: பின்வரும் வெளியீட்டை நீங்கள் பெற வேண்டும்:
uk: Ви маєте отримати наступний результат:
zh_hans: 你应当获得如下输出:
zh_hant: 你應該會看到以下結果：

source: Unlike ``draw_polygon()``, polylines can only have a single unique color for all its points (the second argument). This method has 2 additional arguments: the width of the line (which is as small as possible by default) and enabling or disabling the antialiasing (it is disabled by default).
ru: В отличие от ``draw_polygon()``, полилинии могут иметь только один уникальный цвет для всех своих точек (второй аргумент). Этот метод имеет 2 дополнительных аргумента: ширину линии (которая по умолчанию минимально возможная) и включение или отключение сглаживания (по умолчанию оно отключено).
ta: `` Draw_polygon () `` போலல்லாமல், பாலிலின்கள் அதன் அனைத்து புள்ளிகளுக்கும் ஒரு தனித்துவமான வண்ணத்தை மட்டுமே கொண்டிருக்க முடியும் (இரண்டாவது வாதம்). இந்த முறை 2 கூடுதல் வாதங்களைக் கொண்டுள்ளது: வரியின் அகலம் (இது இயல்பாகவே முடிந்தவரை சிறியது) மற்றும் ஆன்டிலியாசிங்கை இயக்குதல் அல்லது முடக்குதல் (இது இயல்புநிலையாக முடக்கப்பட்டுள்ளது).
zh_hans: 与 ``draw_polygon()`` 不同，折线（polyline）的所有点只能有一个唯一的颜色（第二个参数）。此方法有 2 个附加参数：线的宽度（默认情况下尽可能小），和启用或禁用抗锯齿（默认情况下禁用）。
zh_hant: 和 ``draw_polygon()`` 不同的是，polyline 只能為所有點指定一個單一顏色（第二個參數）。這個方法還有兩個額外參數：線寬（預設為最細），以及是否啟用抗鋸齒（預設關閉）。

source: The order of the ``_draw`` calls is important- like with the Node positions on the tree hierarchy, the different shapes will be drawn from top to bottom, resulting in the latest shapes hiding earlier ones if they overlap. In this case we want the mouth drawn over the head, so we put it afterwards.
de: Die Reihenfolge der ``_draw``-Aufrufe ist wichtig - wie bei den Node-Positionen in der Baumhierarchie werden die verschiedenen Formen von oben nach unten gezeichnet, was dazu führt, daß die neuesten Formen die früheren verdecken, wenn sie sich überlappen. In diesem Fall soll der Mund über den Kopf gezeichnet werden, also setzen wir ihn danach.
es: El orden de las llamadas ``_draw`` es importante; al igual que con las posiciones de los Nodos en la jerarquía del árbol, las diferentes formas se dibujarán de arriba a abajo, lo que dará como resultado que las últimas formas oculten las anteriores si se superponen. En este caso queremos que la boca esté dibujada sobre la cabeza, así que la ponemos después.
fr: L'ordre des appels de ``_draw`` est important- comme avec les positions des Node dans la hiérarchie en arbre, les différentes formes seront dessinées de haut en bas, entraînant les dernières formes à cacher les précédentes si elles se chevauchent. Dans ce cas, nous voulons que la bouche soit dessinée sur la tête, donc nous l'avons mis après.
ga: Tá ord na nglaonna ``_draw`` tábhachtach- cosúil leis na suíomhanna Nóid ar ordlathas na gcrann, tarraingfear na cruthanna éagsúla ón mbarr go bun, agus mar thoradh air sin beidh na cruthanna is déanaí i bhfolach cinn níos luaithe má fhorluíonn siad. Sa chás seo ba mhaith linn an béal a tharraingt thar an gceann, mar sin cuirimid é ina dhiaidh sin.
pt_br: A ordem das chamadas ``_draw`` é importante - como que com as posições dos Nós na hierarquia da árvore, as diferentes formas serão desenhadas de cima para baixo, resultando nas formas mais recentes que se escondem mais cedo se eles se sobrepõem. Neste caso queremos a boca desenhada sobre a cabeça, então colocamos depois.
ru: Порядок вызовов ``_draw`` важен - как и в случае с позициями Node в иерархии дерева, различные формы будут рисоваться сверху вниз, в результате чего последние формы будут скрывать более ранние, если они перекрываются. В этом случае мы хотим, чтобы рот был нарисован поверх головы, поэтому мы помещаем его после.
ta: `` _Draw`` அழைப்புகளின் வரிசை முக்கியமானது- மர வரிசைமுறையின் முனை நிலைகளைப் போலவே, வெவ்வேறு வடிவங்கள் மேலிருந்து கீழாக வரையப்படும், இதன் விளைவாக அண்மைக் கால வடிவங்கள் அவை ஒன்றுடன் ஒன்று இருந்தால் மறைக்கும். இந்த விசயத்தில் நாம் வாய் தலைக்கு மேல் வரையப்பட வேண்டும், எனவே அதை பின்னர் வைக்கிறோம்.
uk: Порядок викликів ``_draw`` важливий — як і у випадку з позиціями Node в ієрархії дерева, різні фігури малюватимуться зверху вниз, у результаті чого останні фігури приховують попередні, якщо вони накладаються. У цьому випадку ми хочемо, щоб рот був намальований над головою, тому ми розміщуємо його пізніше.
zh_hans: ``_draw`` 调用的顺序很重要，就像树状层次结构上的节点位置一样，将从上到下绘制不同的形状，这会使得新绘制的形状在重叠时隐藏掉较早绘制的形状。在本例中，我们希望将嘴放在头上，因此我们将其放在后面。
zh_hant: ``_draw`` 的呼叫順序很重要——就像場景樹中的節點一樣，繪圖會從上到下依序執行，被後畫的圖形會覆蓋在前面的圖形上。如果兩個圖形重疊，最晚繪製的會蓋住之前的。在這個例子中，我們希望嘴巴畫在頭的上方，所以將其放在後面。

source: Notice how we can define colors in different ways, either with a hexadecimal code or a predefined color name. Check the class :ref:`Color <class_Color>` for other constants and ways to define Colors.
de: Beachten Sie, dass wir Farben auf verschiedene Arten definieren können, entweder mit einem hexadezimalen Code oder einem vordefinierten Farbnamen. In der Klasse :ref:`Color <class_Color>` finden Sie weitere Konstanten und Möglichkeiten, Farben zu definieren.
es: Observe cómo podemos definir los colores de diferentes formas, ya sea con un código hexadecimal o un nombre de color predefinido. Consulte la clase :ref:`Color <class_Color>` para conocer otras constantes y formas de definir colores.
fr: Remarquez comment nous pouvons définir les couleurs de différentes manières, soit avec un code hexadécimal ou un nom de couleur prédéfini. Regardez la classe :ref:`Color <class_Color>` pour d'autres constantes et de moyens de définir des Colors.
ga: Tabhair faoi deara conas is féidir linn dathanna a shainiú ar bhealaí éagsúla, bíodh sé le cód heicsidheachúil nó le hainm datha réamhshainithe. Seiceáil an rang :ref:`Dath <class_Color>` le haghaidh tairisigh eile agus bealaí chun Dathanna a shainiú.
pt_br: Observe como podemos definir cores de maneiras diferentes, seja com um código hexadecimal ou um nome de cor predefinido. Confira a classe :ref:`Color <class_Color>` para outras constantes e formas de definir Cores.
ru: Обратите внимание, как мы можем определять цвета разными способами, либо с помощью шестнадцатеричного кода, либо с помощью предопределенного имени цвета. Проверьте класс :ref:`Color <class_Color>` для других констант и способов определения цветов.
ta: ஒரு எக்சாடெசிமல் குறியீடு அல்லது முன் வரையறுக்கப்பட்ட வண்ண பெயருடன் வண்ணங்களை வெவ்வேறு வழிகளில் எவ்வாறு வரையறுக்கலாம் என்பதைக் கவனியுங்கள். வகுப்பைச் சரிபார்க்கவும்: குறிப்பு: `வண்ண <class_Color>` பிற மாறிலிகள் மற்றும் வண்ணங்களை வரையறுக்கும் வழிகளுக்கு.
uk: Зверніть увагу, як ми можемо визначати кольори різними способами, або за допомогою шістнадцяткового коду, або попередньо визначеної назви кольору. Перевірте клас :ref:`Color <class_Color>` для інших констант і способів визначення кольорів.
zh_hans: 请注意我们如何以不同的方式定义颜色，无论是使用十六进制代码还是预定义的颜色名称。请检查类 :ref:`Color <class_Color>` 的其他常量和定义颜色的方法。
zh_hant: 注意，我們可以用不同的方式定義顏色，例如十六進位色碼或預設顏色名稱。更多常數和顏色定義方式請參考 :ref:`Color <class_Color>` 類別。

source: Drawing circles
de: Zeichnen von Kreisen
es: Dibujando círculos
fr: Dessiner des cercles
ga: Ciorcail líníoch
it: Disegno di cerchi
pt_br: Desenhando Círculos
ru: Отрисовка кругов
ta: வரைதல் வட்டங்கள்
uk: Малювання кіл
zh_hans: 绘制圆
zh_hant: 繪製圓形

source: To create the eyes, we are going to add 4 additional calls to draw the eye shapes, in different sizes, colors and positions.
de: Um die Augen zu erstellen, werden wir 4 zusätzliche Aufrufe hinzufügen, um die Formen der Augen in verschiedenen Größen, Farben und Positionen zu zeichnen.
es: Para crear los ojos, vamos a añadir 4 llamadas adicionales para dibujar las formas de los ojos, en diferentes tamaños, colores y posiciones.
fr: Pour créer les yeux, nous allons ajouter 4 appels supplémentaires pour dessiner les formes des yeux, dans différentes tailles, couleurs et positions.
ga: Chun na súile a chruthú, táimid chun 4 ghlao breise a chur leis chun cruthanna na súl a tharraingt, i méideanna, dathanna agus suíomhanna éagsúla.
pt_br: Para criar os olhos, vamos adicionar 4 chamadas adicionais para desenhar as formas dos olhos, em diferentes tamanhos, cores e posições.
ru: Чтобы создать глаза, мы добавим 4 дополнительных вызова для рисования форм глаз, с различными размерами, цветами и позициями.
ta: கண்களை உருவாக்க, வெவ்வேறு அளவுகள், வண்ணங்கள் மற்றும் நிலைகளில் கண் வடிவங்களை வரைய 4 கூடுதல் அழைப்புகளைச் சேர்க்கப் போகிறோம்.
uk: Щоб створити очі, ми збираємося додати 4 додаткові виклики для малювання форм очей різних розмірів, кольорів і позицій.
zh_hans: 为了创建眼睛，我们将添加 4 个额外的调用来绘制不同大小、颜色和位置的眼睛形状。
zh_hant: 要畫出眼睛，我們會額外呼叫 4 次繪圖函式，分別以不同的大小、顏色與位置來畫出眼睛的形狀。

source: To draw a circle, you position it based on its center using the :ref:`draw_circle <class_CanvasItem_method_draw_circle>` method. The first parameter is a :ref:`Vector2<class_Vector2>` with the coordinates of its center, the second is its radius, and the third is its color:
de: Um einen Kreis zu zeichnen, positionieren Sie ihn basierend auf seinem Mittelpunkt mit der Methode :ref:`draw_circle <class_CanvasItem_method_draw_circle>`. Der erste Parameter ist ein :ref:`Vector2 <class_Vector2>` mit den Koordinaten des Mittelpunkts, der zweite ist der Radius und der dritte ist die Farbe:
es: Para dibujar un círculo, colóquelo según su centro usando el método :ref:`draw_circle <class_CanvasItem_method_draw_circle>`. El primer parámetro es un :ref:`Vector2<class_Vector2>` con las coordenadas de su centro, el segundo es su radio y el tercero es su color:
fr: Pour dessiner un cercle, vous le positionnez en fonction de son centre à l'aide de la méthode :ref:`draw_circle <class_CanvasItem_method_draw_circle>`. Le premier paramètre est un :ref:`Vector2<class_Vector2>` avec les coordonnées de son centre, le second est son rayon, et le troisième est sa couleur :
ga: Chun ciorcal a tharraingt, cuireann tú é bunaithe ar a lár ag baint úsáide as an modh :ref:`draw_circle <class_CanvasItem_method_draw_circle>`. Is é an chéad pharaiméadar ná :ref:`Vector2<class_Vector2>` le comhordanáidí a lár, is é an dara ceann a gha, agus is é an tríú a dhath:
pt_br: Para desenhar um círculo, você posiciona-o com base em seu centro usando o método :ref:`draw_circle <class_CanvasItem_method_draw_circle>`. O primeiro parâmetro é um :ref:`Vector2<class_Vector2> com as coordenadas de seu centro, o segundo é seu raio, e o terceiro é sua cor:
ru: Чтобы отрисовать круг, вы располагаете его от центра используя метод :ref:`draw_circle <class_CanvasItem_method_draw_circle>`. Первый параметр это :ref:`Vector2<class_Vector2>` координат его центра, второй - его радиус, а третий - его цвет:
ta: ஒரு வட்டத்தை வரைய, அதன் மையத்தின் அடிப்படையில் அதை நிலைநிறுத்துங்கள்: ref: `draw_circle <class_canvasitem_method_draw_circle>` முறை. முதல் அளவுரு ஒரு: ref: `vector2 <class_vector2>` அதன் மையத்தின் ஆயத்தொலைவுகளுடன், இரண்டாவது அதன் ஆரம், மூன்றாவது அதன் நிறம்:
uk: Щоб намалювати коло, ви розташовуєте його на основі його центру за допомогою методу :ref:`draw_circle <class_CanvasItem_method_draw_circle>`. Перший параметр — це :ref:`Vector2<class_Vector2>` з координатами його центру, другий — його радіус, а третій — його колір:
zh_hans: 为了绘制圆形，请使用 :ref:`draw_circle <class_CanvasItem_method_draw_circle>` 方法根据其圆的中心定位它。第一个参数是以 :ref:`Vector2<class_Vector2>` 形式写下的中心坐标，第二个参数是其半径，第三个参数是其颜色：
zh_hant: 要畫圓形，可以用 :ref:`draw_circle <class_CanvasItem_method_draw_circle>` 方法，指定圓心的位置（以 :ref:`Vector2<class_Vector2>` 表示）、半徑與顏色：

source: When executing it, you should have something like this:
de: Nach der Ausführung sollten Sie etwa folgendes Ergebnis erhalten:
es: Al ejecutarse deberías ver algo como esto:
fr: Lors de l'exécution, vous devriez avoir quelque chose comme ça :
ga: Agus é á chur i bhfeidhm, ba chóir go mbeadh rud éigin mar seo agat:
it: Durante l'esecuzione, dovresti avere qualcosa di simile a questo:
pt_br: Ao executá-lo, você deve ter algo assim:
ru: При запуске, вы должны получить примерно это:
ta: அதை இயக்கும்போது, உங்களிடம் இதுபோன்ற ஏதாவது இருக்க வேண்டும்:
uk: Під час його виконання ви повинні мати щось на зразок цього:
zh_hans: 在执行它时，你应当获得如下所示的图像:
zh_hant: 執行時你應該會看到這樣的畫面：
