Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/particle_systems_2d.po
Languages: it, zh_tw

source: 2D particle systems
it: Sistemi di particelle 2D
zh_tw: 粒子

source: Intro
it: Introduzione
zh_tw: 簡介

source: Particle systems are used to simulate complex physical effects, such as sparks, fire, magic particles, smoke, mist, etc.
zh_tw: Godot提供了一種簡單(但對於大多數用途而言足夠靈活)的粒子系統. 粒子系統用於類比複雜的物理效應, 如火花, 火焰, 魔法粒子, 煙霧, 霧氣, 等.

source: The idea is that a "particle" is emitted at a fixed interval and with a fixed lifetime. During its lifetime, every particle will have the same base behavior. What makes each particle different from the rest and provides a more organic look is the "randomness" associated with each parameter. In essence, creating a particle system means setting base physics parameters and then adding randomness to them.
zh_tw: 這個想法是以固定的間隔發射具有固定的壽命的 "粒子". 在其生命週期中, 每個粒子都具有相同的基本行為. 讓每個粒子變得不同並提供整體更加 "有機" 外觀的是與各個參數相關的 "隨機性". 實質上, 建立粒子系統意味著設定基本物理參數, 然後為它們新增隨機性.

source: Particle nodes
it: Nodi di particelle
zh_tw: 粒子

source: Godot provides two different nodes for 2D particles, :ref:`class_GPUParticles2D` and :ref:`class_CPUParticles2D`. GPUParticles2D is more advanced and uses the GPU to process particle effects. CPUParticles2D is a CPU-driven option with near-feature parity with GPUParticles2D, but lower performance when using large amounts of particles. On the other hand, CPUParticles2D may perform better on low-end systems or in GPU-bottlenecked situations.
it: Godot fornisce due diversi nodi per particelle 2D, :ref:`class_GPUParticles2D` e :ref:`class_CPUParticles2D`. GPUParticles2D è più avanzato e utilizza la GPU per elaborare gli effetti delle particelle. CPUParticles2D è un'opzione gestita dalla CPU con parità di funzionalità vicina a GPUParticles2D, ma con prestazioni inferiori con una grande quantità di particelle. D'altra parte, CPUParticles2D potrebbe funzionare meglio su sistemi di fascia bassa o in situazioni con colli di bottiglia dovuti alla GPU.
zh_tw: Godot 為 2D 粒子提供了兩個不同的節點：:ref:`class_Particles2D` 和 :ref:`class_CPUParticles2D`。Particles2D 更為先進，使用 GPU 處理粒子效果，但這將其限制於相對高端的圖形 API 中，在我們的情況下僅限於 GLES3 算繪器。對於使用 GLES2 後端的專案，CPUParticles2D 是一個 CPU 驅動的選項。其功能與 Particles2D 接近，但性能較低。Particles2D 是通過 :ref:`class_ParticlesMaterial`（以及可選的自訂 Shader）來配置的，但相應的選項在 CPUParticles2D 中是通過節點屬性提供的（軌跡設定除外）。您可以通過按一下場景中的節點，然後在工具列的“粒子”功能表中選擇“轉換為 CPU 粒子”，將 Particles2D 節點轉換為 CPUParticles2D 節點。

source: While GPUParticles2D is configured via a :ref:`class_ParticleProcessMaterial` (and optionally with a custom shader), the matching options are provided via node properties in CPUParticles2D (with the exception of the trail settings).
it: Mentre GPUParticles2D è configurato tramite un :ref:`class_ParticleProcessMaterial` (e facoltativamente con uno shader personalizzato), le opzioni corrispondenti sono fornite tramite le proprietà del nodo stesso in CPUParticles2D (ad eccezione delle impostazioni della scia).
zh_tw: 雖然 GPUParticles2D 是通過 :ref:`class_ParticleProcessMaterial`（還可以使用自訂著色器）進行配置的，不過配對的選項是通過 CPUParticles2D 中的節點屬性提供的（除了軌跡設定）。

source: The rest of this tutorial is going to use the GPUParticles2D node. First, add a GPUParticles2D node to your scene. After creating that node you will notice that only a white dot was created, and that there is a warning icon next to your GPUParticles2D node in the scene dock. This is because the node needs a ParticleProcessMaterial to function.
zh_tw: 這個教學後續將使用 Particles2D 節點。首先，新增一個 Particles2D 節點到場景中。在建立該節點後，您會注意到只建立了一個白點，並且在場景面板的 Particles2D 節點旁邊有一個警告圖示。這是因為節點需要 ParticlesMaterial 才能工作。

source: To add a process material to your particles node, go to ``Process Material`` in your inspector panel. Click on the box next to ``Material``, and from the dropdown menu select ``New ParticleProcessMaterial``.
zh_tw: 要將運作材質新增到粒子節點，請轉到屬性面板面板中的 ``Process Material``。按一下 ``Material`` 旁邊的框，然後從下拉式功能表中選擇 ``新建 ParticlesMaterial``。

source: Your GPUParticles2D node should now be emitting white points downward.
zh_tw: 您的 Particles2D 節點現在應該可以向下發射白點了。

source: Texture
zh_tw: 紋理貼圖

source: Time parameters
zh_tw: Time (時間)參數

source: Lifetime
it: Durata di vita
zh_tw: 生命期

source: The time in seconds that every particle will stay alive. When lifetime ends, a new particle is created to replace it.
zh_tw: 每個粒子存活的時間(以秒為單位). 生命週期結束時, 會建立一個新粒子來替換它.

source: Lifetime: 0.5
it: Durata di vita: 0.5
zh_tw: 壽命:0.5

source: Lifetime: 4.0
it: Durata di vita: 4.0
zh_tw: 壽命:4.0

source: One Shot
it: Colpo singolo
zh_tw: 一次性

source: When enabled, a GPUParticles2D node will emit all of its particles once and then never again.
zh_tw: 啟用後,Particles2D節點將一次性發出所有粒子, 然後再也不發射.

source: Preprocess
it: Preprocesso
zh_tw: 預處理

source: Particle systems begin with zero particles emitted, then start emitting. This can be an inconvenience when loading a scene and systems like a torch, mist, etc. begin emitting the moment you enter. Preprocess is used to let the system process a given number of seconds before it is actually drawn the first time.
zh_tw: 粒子系統從沒有粒子被發射開始, 然後開始發射. 當載入場景如火炬, 霧等系統時可能會帶來不便, 因為它會在進入場景的那一刻開始發射. 預處理用於讓系統在第一次實際繪製之前處理給定的秒數.

source: Speed Scale
it: Scala di velocità
zh_tw: 速度縮放

source: The speed scale has a default value of ``1`` and is used to adjust the speed of a particle system. Lowering the value will make the particles slower while increasing the value will make the particles much faster.
zh_tw: 速度比例具有預設值 ``1`` , 用於調整粒子系統的速度. 降低值會使粒子變慢, 而增加值會使粒子更快.

source: Explosiveness
it: Esplosività
zh_tw: 爆炸性

source: If lifetime is ``1`` and there are 10 particles, it means a particle will be emitted every 0.1 seconds. The explosiveness parameter changes this, and forces particles to be emitted all together. Ranges are:
zh_tw: 如果有10個壽命為 ``1`` 的粒子, 則意味著粒子將每0.1秒發射一次. 爆炸性參數改變了這一點, 並迫使粒子一起發射. 範圍是:

source: 0: Emit particles at regular intervals (default value).
it: 0: emette particelle a intervalli regolari (valore predefinito).
zh_tw: 0: 定期發射粒子(預設值).

source: 1: Emit all particles simultaneously.
it: 1: emette tutte le particelle simultaneamente.
zh_tw: 1: 同時發射所有粒子.

source: Values in the middle are also allowed. This feature is useful for creating explosions or sudden bursts of particles:
zh_tw: 中間的值也是允許的. 此功能對於建立爆炸或突然爆發的粒子非常有用:

source: Randomness
it: Casualità
zh_tw: 隨機性

source: All physics parameters can be randomized. Random values range from ``0`` to ``1``. The formula to randomize a parameter is:
zh_tw: 所有物理參數都可以隨機化. 隨機值範圍從 ``0`` 到 ``1`` . 隨機化參數的公式為:

source: Fixed FPS
it: FPS fisso
zh_tw: 固定 FPS

source: This setting can be used to set the particle system to render at a fixed FPS. For instance, changing the value to ``2`` will make the particles render at 2 frames per second. Note this does not slow down the particle system itself.
zh_tw: 此設定可用於將粒子系統設定為以固定的影格率算繪. 例如, 將值更改為 ``2`` 將使粒子以每秒2影格的速度算繪. 請注意, 這不會減慢粒子系統本身的速度.

source: Fract Delta
it: Delta frazionario
zh_tw: 分數差異量

source: Drawing parameters
it: Parametri di disegno
zh_tw: Drawing parameters (繪圖參數)

source: Visibility Rect
it: Rettangolo di visibilità
zh_tw: 可見矩形

source: The visibility rectangle controls the visibility of the particles on screen. If this rectangle is outside of the viewport, the engine will not render the particles on screen.
zh_tw: 可見性矩形控制粒子在螢幕上的可見性. 如果此矩形位於視口之外, 則引擎將不會在螢幕上算繪粒子.

source: The rectangle's ``W`` and ``H`` properties respectively control its Width and its Height. The ``X`` and ``Y`` properties control the position of the upper-left corner of the rectangle, relative to the particle emitter.
zh_tw: 矩形的 ``W`` 和 ``H`` 屬性分別控制其寬度和高度. ``X`` 和 ``Y`` 屬性控制矩形左上角相對於粒子發射器的位置.

source: You can have Godot generate a Visibility Rect automatically using the toolbar above the 2d view. To do so, select the GPUParticles2D node and Click ``Particles > Generate Visibility Rect``. Godot will simulate the Particles2D node emitting particles for a few seconds and set the rectangle to fit the surface the particles take.
zh_tw: 可以使用2D視圖上方的工具列自動生成可見性區域. 為此, 請選擇Particles2D節點, 然後按一下 ``粒子 > 生成視覺化區域`` . Godot將模擬Particles2D節點發射粒子幾秒鐘, 並將矩形區域設定為適合粒子的大小.

source: You can control the emit duration with the ``Generation Time (sec)`` option. The maximum value is 25 seconds. If you need more time for your particles to move around, you can temporarily change the ``preprocess`` duration on the Particles2D node.
zh_tw: 你可以使用 ``Generation Time (sec)`` 選項控制發射持續時間. 最大值為25秒. 如果您需要更多時間讓粒子移動, 您可以暫時更改Particles2D節點上的 ``preprocess`` 時間.

source: Local Coords
it: Coordinate locali
zh_tw: 本地座標

source: By default this option is on, and it means that the space that particles are emitted to is relative to the node. If the node is moved, all particles are moved with it:
zh_tw: 預設情況下, 此選項處於啟用狀態, 這意味著粒子發射的空間是相對於節點來算的. 如果移動節點, 則所有粒子會隨之移動:

source: If disabled, particles will emit to global space, meaning that if the node is moved, already emitted particles are not affected:
zh_tw: 如果禁用, 粒子將發射到全域空間, 這意味著如果移動節點, 則已發射的粒子不會受到影響:

source: Draw Order
it: Ordine di disegno
zh_tw: 繪製順序

source: This controls the order in which individual particles are drawn. ``Index`` means particles are drawn according to their emission order (default). ``Lifetime`` means they are drawn in order of remaining lifetime.
zh_tw: 這可以控制繪製單個粒子的順序. ``Index`` 表示粒子根據它們的發射順序被繪製(預設). ``Lifetime`` 表示它們按照剩餘壽命的順序被繪製.

source: Going forward there are no plans to add new features to CPUParticles2D, though pull requests to add features already in GPUParticles2D will be accepted. For that reason we recommend using GPUParticles2D unless you have an explicit reason not to.
it: In futuro non è previsto aggiungere nuove funzionalità a CPUParticles2D, ma saranno accettate le pull request per aggiungere funzionalità già presenti in GPUParticles2D. Per questo motivo, consigliamo di utilizzare GPUParticles2D, a meno che non ci siano motivi specifici per non farlo.

source: You can convert a CPUParticles2D node into a GPUParticles2D node by clicking on the node in the scene tree, selecting the 2D workspace, and selecting **CPUParticles2D > Convert to GPUParticles2D** in the toolbar.
it: Puoi convertire un nodo GPUParticles2D in un nodo CPUParticles2D cliccando sul nodo nell'albero di scene, selezionando lo spazio di lavoro 2D e selezionando **CPUParticles2D > Converti in CPUParticles2D** nella barra degli strumenti.

source: It is also possible to convert a GPUParticles2D node to a CPUParticles2D node, however there may be issues if you use GPU-only features.
it: È anche possibile convertire un nodo GPUParticles2D in un nodo CPUParticles2D, ma potrebbero esserci problemi se utilizzi funzionalità esclusive per la GPU.

source: Using an animation flipbook
it: Utilizzo di un flipbook di animazione

source: Particle flipbook texture example
it: Esempio di texture flipbook di particelle

source: Particle Process Material Settings
it: Impostazioni di ParticlesProcessMaterial
