Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: You can quickly create a rectangle collision shape by pressing :kbd:`F` while the TileSet editor is focused. If the keyboard shortcut doesn't work, try clicking in the empty area around the polygon editor to focus it:
es: Puede crear rápidamente una forma de colisión rectangular presionando :kbd:`F` mientras el editor TileSet está enfocado. Si el atajo de teclado no funciona, intente hacer clic en el área vacía alrededor del editor de polígonos para enfocarlo:
ga: Is féidir leat cruth imbhuailte dronuilleog a chruthú go tapa trí:kbd: `F` a bhrú agus tá eagarthóir TileSet dírithe. Mura n-oibríonn an aicearra méarchláir, déan iarracht cliceáil sa limistéar folamh timpeall an eagarthóra polagóin chun é a dhíriú:
ja: TileSetエディターにフォーカスしているときに :kbd:`F` を押すと、矩形のコリジョンシェイプを素早く作成することができます。キーボードショートカットが効かない場合は、ポリゴンエディタの周りの何もないところをクリックしてフォーカスしてみてください:
pt_br: Você pode criar rapidamente uma forma de colisão retangular pressionando :kbd:`F` enquanto o editor de TileSet estiver em foco. Se o atalho de teclado não funcionar, tente clicar na área vazia ao redor do editor de polígonos para focá-lo:
ru: Вы можете быстро создать прямоугольную форму столкновения, нажав :kbd:`F`, пока редактор TileSet находится в фокусе. Если сочетание клавиш не работает, попробуйте щелкнуть в пустой области вокруг редактора полигонов, чтобы сфокусировать его:
ta: அழுத்துவதன் மூலம் நீங்கள் விரைவாக ஒரு செவ்வக மோதல் வடிவத்தை உருவாக்கலாம்: KBD: `f` டில்செட் எடிட்டர் கவனம் செலுத்துகிறது. விசைப்பலகை குறுக்குவழி வேலை செய்யவில்லை என்றால், பலகோண எடிட்டரைச் சுற்றியுள்ள வெற்று பகுதியில் சொடுக்கு செய்ய முயற்சிக்கவும்:
tr: TileSet düzenleyicisi odaklıyken :kbd:`F` tuşuna basarak hızlı bir şekilde bir dikdörtgen çarpışma şekli oluşturabilirsiniz. Klavye kısayolu çalışmazsa, odaklamak için çokgen düzenleyicinin etrafındaki boş alana tıklamayı deneyin:
uk: Ви можете швидко створити прямокутну форму зіткнення, натиснувши :kbd:`F`, коли у фокусі редактор TileSet. Якщо комбінація клавіш не працює, спробуйте клацнути порожню область навколо редактора багатокутників, щоб сфокусувати її:
zh_tw: 你可以在聚焦 TileSet 編輯器時按 :kbd:`F` 快速建立矩形碰撞形狀。如果鍵盤快捷鍵不起作用，請嘗試按一下多邊形編輯器周圍的空白區域使其聚焦：

source: Using default rectangle collision shape by pressing :kbd:`F`
es: Usando la forma de colisión de rectángulo predeterminada presionando :kbd:`F`
ga: Cruth imbhuailte dronuilleog réamhshocraithe a úsáid trí bhrú: kbd: `F`
ja: \ :kbd:`F` を押してデフォルトの矩形コリジョンを使用
pt_br: Usando a forma de colisão retangular padrão ao pressionar :kbd:`F`
ru: Использование прямоугольной формы столкновения по умолчанию при нажатии :kbd:`F`
ta: அழுத்துவதன் மூலம் இயல்புநிலை செவ்வக மோதல் வடிவத்தைப் பயன்படுத்துதல்: KBD: `f`
tr: :kbd:`F` tuşuna basarak varsayılan dikdörtgen çarpışma şeklini kullanma
uk: Використання типової прямокутної форми зіткнення, натиснувши :kbd:`F`
zh_tw: 按 :kbd:`F` 鍵使用預設矩形碰撞形狀

source: In this tile collision editor, you have access to all the 2D polygon editing tools:
es: En este editor de colisión de tiles, tienes acceso a todas las herramientas de edición de polígonos 2D:
ga: San eagarthóir imbhuailte tíl seo, tá rochtain agat ar na huirlisí eagarthóireachta polagón 2D go léir:
ja: このタイルコリジョンエディタでは、すべての2Dポリゴン編集ツールを使用できます:
pt_br: Neste editor de colisão de blocos, você tem acesso a todas as ferramentas de edição de polígonos 2D:
ru: В этом редакторе столкновений тайлов у вас есть доступ ко всем инструментам редактирования 2D-полигонов:
ta: இந்த ஓடு மோதல் எடிட்டரில், 2 டி பலகோண திருத்துதல் கருவிகளுக்கும் உங்களுக்கு அணுகல் உள்ளது:
tr: Bu karo çarpışma düzenleyicisinde, tüm 2B çokgen düzenleme araçlarına erişebilirsiniz:
uk: У цьому редакторі зіткнень плиток ви маєте доступ до всіх інструментів редагування двовимірних полігонів:
zh_tw: 在這個圖塊碰撞編輯器中，你可以使用所有二維多邊形編輯工具：

source: Use the toolbar above the polygon to toggle between creating a new polygon, editing an existing polygon and removing points on the polygon. The "three vertical dots" menu button offers additional options, such as rotating and flipping the polygon.
es: Utilice la barra de herramientas situada encima del polígono para alternar entre crear un nuevo polígono, editar un polígono existente y eliminar puntos del polígono. El botón de menú de los "tres puntos verticales" ofrece opciones adicionales, como rotar y voltear el polígono.
ga: Úsáid an barra uirlisí os cionn an pholagán le scoránaigh idir cruthú polagán nua, eagarthóireacht a dhéanamh ar pholagán atá ann cheana féin agus pointí ar an bpolagán a bhaint. Tugann an cnaipe roghchláir "trí poncanna ingearacha" roghanna breise, mar shampla an polagán a rothlú agus a smeach.
ja: ポリゴンの上にあるツールバーから、新しいポリゴンの作成、既存のポリゴンの編集、ポリゴン上の点の削除を切り替えます。 "縦3点" メニューボタンからは、ポリゴンの回転や反転などの追加オプションが選べます。
pt_br: Use a barra de ferramentas acima do polígono para alternar entre criar um novo polígono, editar um polígono existente e remover pontos do polígono. O botão de menu de "três pontos verticais" oferece opções adicionais, como girar e espelhar o polígono.
ru: Используйте панель инструментов над полигоном для переключения между созданием нового полигона, редактированием существующего полигона и удалением точек на полигоне. Кнопка меню «три вертикальные точки» предлагает дополнительные опции, такие как вращение и переворачивание полигона.
ta: புதிய பலகோணத்தை உருவாக்குவதற்கும், ஏற்கனவே உள்ள பலகோணத்தைத் திருத்துவதற்கும், பலகோணத்தில் புள்ளிகளை அகற்றுவதற்கும் இடையில் மாறுவதற்கு பலகோணத்திற்கு மேலே உள்ள கருவிப்பட்டியைப் பயன்படுத்தவும். "மூன்று செங்குத்து புள்ளிகள்" பட்டியல் பொத்தான் பலகோணத்தை சுழற்றி புரட்டுவது போன்ற கூடுதல் விருப்பங்களை வழங்குகிறது.
tr: Yeni bir çokgen oluşturma, mevcut bir çokgeni düzenleme ve çokgen üzerindeki noktaları kaldırma arasında geçiş yapmak için çokgenin üzerindeki araç çubuğunu kullanın. "Üç dikey nokta" menü düğmesi, çokgeni döndürme ve çevirme gibi ek seçenekler sunar.
uk: Використовуйте панель інструментів над багатокутником, щоб переключатися між створенням нового багатокутника, редагуванням існуючого багатокутника та видаленням точок на багатокутнику. Кнопка меню «три вертикальні крапки» пропонує додаткові параметри, такі як обертання та гортання багатокутника.
zh_tw: 使用多邊形上方的工具列可在建立新多邊形、編輯現有多邊形和刪除多邊形上的點之間切換。“三個豎點”功能表按鈕提供了其他選項，例如旋轉和翻轉多邊形。

source: Create new points by clicking and dragging a line between two points.
es: Cree nuevos puntos haciendo clic y arrastrando una línea entre dos puntos.
ga: Cruthaigh pointí nua trí líne idir dhá phointe a chliceáil agus a tharraingt.
ja: 2点間の線をクリック＆ドラッグし、新しい点を作成します。
pt_br: Crie novos pontos clicando e arrastando uma linha entre dois pontos.
ru: Создавайте новые точки, щелкая и перетаскивая линию между двумя точками.
ta: இரண்டு புள்ளிகளுக்கு இடையில் ஒரு வரியைக் சொடுக்கு செய்து இழுப்பதன் மூலம் புதிய புள்ளிகளை உருவாக்கவும்.
tr: İki nokta arasındaki bir çizginin üstüne tıklayıp sürükleyerek yeni noktalar oluşturun.
uk: Створіть нові точки, клацнувши та перетягнувши лінію між двома точками.
zh_tw: 通過按一下並拖動兩點之間的直線來建立新點。

source: Remove a point by right-clicking it (or using the Remove tool described above and left-clicking).
es: Elimine un punto haciendo clic derecho sobre él (o utilizando la herramienta Eliminar descrita anteriormente y haciendo clic izquierdo).
ga: Bain pointe trí chliceáil ar dheis air (nó an uirlis Bain a thuairiscítear thuas a úsáid agus cliceáil ar chlé).
ja: 右クリックで点を削除します(上部の削除ツールを使っているなら左クリック)。
pt_br: Remova um ponto clicando com o botão direito nele (ou usando a ferramenta "Remover" descrita acima e clicando com o botão esquerdo).
ru: Удалите точку, щелкнув по ней правой кнопкой мыши (или воспользовавшись инструментом «Удалить», описанным выше, и щелкнув левой кнопкой мыши).
ta: ஒரு புள்ளியை வலது சொடுக்கு செய்வதன் மூலம் அகற்றவும் (அல்லது மேலே விவரிக்கப்பட்ட மற்றும் இடது சொடுக்கு செய்வதை அகற்று கருவியைப் பயன்படுத்துதல்).
tr: Bir noktayı sağ tıklatarak (veya yukarıda açıklanan Kaldır aracını kullanıp sol tıklatarak) kaldırın.
uk: Видаліть точку, клацнувши її правою кнопкою миші (або скориставшись інструментом «Видалити», описаним вище, і клацнувши лівою кнопкою миші).
zh_tw: 按右鍵一個點（或使用上述移除工具並左鍵按一下）將其移除。

source: Pan in the editor by middle-clicking or right-clicking. (Right-click panning can only be used in areas where there is no point nearby.)
es: Desplazarse dentro del editor haciendo clic con el botón central o derecho (El desplazamiento con el botón derecho solo se puede utilizar en áreas donde no hay ningún punto cercano.)
ga: Pan san eagarthóir trí mheánchliceáil nó cliceáil ar dheis. (Ní féidir panáil ar dheis ar dheis a úsáid ach i gceantair nach bhfuil aon phointe in aice láimhe.)
ja: エディター内で中クリックまたは右クリックでパンします。(右クリックによるパン操作は、近くに点がない場所でのみ使用できます。)
pt_br: Desloque a visualização no editor clicando com o botão do meio ou com o botão direito do mouse. (O deslocamento com o botão direito só pode ser usado em áreas onde não há pontos próximos.)
ru: Панорамирование в редакторе осуществляется с помощью щелчка средней кнопкой мыши или щелчка правой кнопкой мыши. (Панорамирование с помощью щелчка правой кнопкой мыши можно использовать только в областях, где поблизости нет точек.)
ta: நடுத்தர சொடுக்கு அல்லது வலது சொடுக்கு மூலம் எடிட்டரில் பான். (வலது சொடுக்கு பனிங்கை அருகிலேயே எந்த அர்த்தமும் இல்லாத பகுதிகளில் மட்டுமே பயன்படுத்த முடியும்.)
tr: Düzenleyicide orta- veya sağ- tuşa tıklayarak kaydırın. (Sağ tıklayarak kaydırma yalnızca yakınlarda nokta bulunmayan alanlarda kullanılabilir.)
uk: Переміщення в редакторі, клацаючи середньою або правою кнопкою миші. (Панорамування правою кнопкою миші можна використовувати лише в областях, де поблизу немає точки.)
zh_tw: 通過中鍵或右鍵在編輯器中平移。(右鍵平移只能用於附近沒有點的區域）

source: You can use the default rectangle shape to quickly create a triangle-shaped collision shape by removing one of the points:
es: Puede utilizar la forma de rectángulo predeterminada para crear rápidamente una forma de colisión con forma de triángulo eliminando uno de los puntos:
ga: Is féidir leat an cruth dronuilleog réamhshocraithe a úsáid chun cruth imbhuailte cruth triantáin a chruthú go tapa trí cheann de na pointí a bhaint:
ja: デフォルトの矩形シェイプを使って、点の1つを削除することで、三角形のコリジョンシェイプを素早く作成することができます:
pt_br: Você pode usar o formato retangular padrão para criar rapidamente uma forma de colisão em formato de triângulo removendo um dos pontos:
ru: Вы можете использовать прямоугольную форму по умолчанию, чтобы быстро создать треугольную форму столкновения, удалив одну из точек:
ta: புள்ளிகளில் ஒன்றை அகற்றுவதன் மூலம் முக்கோண வடிவ மோதல் வடிவத்தை விரைவாக உருவாக்க இயல்புநிலை செவ்வக வடிவத்தைப் பயன்படுத்தலாம்:
tr: Hızlı bir şekilde üçgen-şeklinde bir çarpışma şekli oluşturmak için varsayılan dikdörtgen şeklini kullanıp noktalardan birini kaldırabilirsiniz:
uk: Ви можете використати форму прямокутника за замовчуванням, щоб швидко створити форму зіткнення у формі трикутника, видаливши одну з точок:
zh_tw: 你可以使用預設的矩形形狀，通過移除其中一個點來快速建立三角形碰撞形狀：

source: Creating a triangle collision shape by right-clicking one of the corners to remove it
es: Creando una forma de colisión triangular haciendo clic derecho en una de las esquinas para eliminarla
ga: Cruth imbhuailte triantáin a chruthú trí chliceáil ar dheis ar cheann de na coirnéil chun é a
ja: コーナーの1つを右クリックして削除して、三角形のコリジョンシェイプを作成
pt_br: Criando uma forma de colisão triangular clicando com o botão direito em um dos cantos para removê-lo
ru: Создание треугольной формы столкновения путем щелчка правой кнопкой мыши по одному из углов для его удаления
ta: ஒரு முக்கோண மோதல் வடிவத்தை உருவாக்கி அதை அகற்ற மூலைகளில் ஒன்றை வலது சொடுக்கு செய்வதன் மூலம்
tr: Kaldırmak için köşelerden birine sağ tıklayarak bir üçgen çarpışma şekli oluşturma
uk: Створення форми зіткнення трикутника шляхом клацання правою кнопкою миші один із кутів, щоб видалити його
zh_tw: 通過按右鍵其中一個角將其移除來建立三角形碰撞形狀

source: You can also use the rectangle as a base for more complex shapes by adding more points:
es: También puedes utilizar el rectángulo como base para formas más complejas añadiendo más puntos:
ga: Is féidir leat an dronuilleog a úsáid freisin mar bhonn le haghaidh cruthanna níos casta trí níos mó pointí a chur leis:
ja: また、長方形をベースにさらに点を追加することで、より複雑な形状を作ることもできます:
pt_br: Você também pode usar o retângulo como base para formas mais complexas adicionando mais pontos:
ru: Вы также можете использовать прямоугольник в качестве основы для более сложных фигур, добавив больше точек:
ta: கூடுதல் புள்ளிகளைச் சேர்ப்பதன் மூலம் செவ்வகத்தை மிகவும் சிக்கலான வடிவங்களுக்கு ஒரு தளமாகவும் பயன்படுத்தலாம்:
tr: Dikdörtgeni daha fazla nokta ekleyerek daha karmaşık şekiller için bir temel olarak da kullanabilirsiniz:
uk: Ви також можете використовувати прямокутник як основу для більш складних форм, додавши більше точок:
zh_tw: 你還可以通過新增更多點，將矩形用作更複雜形狀的基礎：

source: Drawing a custom collision for a complex tile shape
es: Dibujar una colisión personalizada para una forma de tile compleja
ga: Imbhualadh saincheaptha a tharraingt le haghaidh cruth tíl casta
ja: 複雑なタイル形状のカスタムコリジョンを描画
pt_br: Desenhando uma colisão personalizada para uma forma de tile complexa
ru: Рисование пользовательского столкновения для сложной формы тайла
ta: சிக்கலான ஓடு வடிவத்திற்கு தனிப்பயன் மோதலை வரைதல்
tr: Karmaşık bir karo şekli için özel bir çarpışma çizme
uk: Малювання спеціального зіткнення для складної форми плитки
zh_tw: 為複雜圖塊形狀繪製自訂碰撞

source: If you have a large tileset, specifying the collision for each tile individually could take a lot of time. This is especially true as TileMaps tend to have many tiles with common collision patterns (such as solid blocks or 45-degree slopes). To apply a similar collision shape to several tiles quickly, use functionality to :ref:`assign properties to multiple tiles at once <doc_using_tilemaps_assigning_properties_to_multiple_tiles>`.
es: Si tiene un tileset grande, especificar la colisión para cada tile individualmente podría llevar mucho tiempo. Lo cierto es que los TileMaps tienden a tener muchos tiles con patrones de colisión comunes (como bloques sólidos o pendientes de 45 grados). Para aplicar una forma de colisión similar a varios tiles rápidamente, use la funcionalidad de `asignar propiedades a varios tiles a la vez <doc_using_tilemaps_assigning_properties_to_multiple_tiles>`.
ga: Má tá leacán mór agat, d'fhéadfadh go leor ama a ghlacadh chun an t-imbhualadh a shonrú do gach tíl ina n-aonar. Tá sé seo fíor go háirithe mar is gnách go mbíonn go leor tíleanna ag TileMaps le patrúin imbhuailte coitianta (cosúil le bloic soladacha nó fánaí 45 céim). Chun cruth imbhuailte comhchosúil a chur i bhfeidhm ar roinnt tíleanna go tapa, úsáid feidhmiúlacht chun :tag: `airíonna a shannadh d'il-thíleanna ag an am céanna <doc_using_tilemaps_assigning_properties_to_multiple_tiles>`.
ja: 大きなタイルセットを持っている場合、各タイルのコリジョンを個別に指定すると、多くの時間がかかることがあります。特に、TileMapには共通のコリジョンパターン(ソリッドブロックや45度の斜面など)を持つタイルが多く存在する傾向があるため、この傾向が顕著です。複数のタイルに同じようなコリジョン形状を素早く適用するには、 :ref:`一度に複数のタイルにプロパティを割り当てる <doc_using_tilemaps_assigning_properties_to_multiple_tiles>` 機能を使います。
pt_br: Se você tiver um tileset grande, especificar a colisão para cada tile individualmente pode levar muito tempo. Isso é especialmente verdadeiro, já que TileMaps tendem a ter muitos tiles com padrões de colisão comuns (como blocos sólidos ou rampas de 45 graus). Para aplicar rapidamente uma forma de colisão semelhante a vários tiles, utilize a funcionalidade de :ref:`atribuir propriedades a vários tiles de uma vez <doc_using_tilemaps_assigning_properties_to_multiple_tiles>`.
ru: Если у вас большой набор тайлов, указание коллизии для каждого тайла по отдельности может занять много времени. Это особенно верно, поскольку TileMaps, как правило, имеют много тайлов с общими шаблонами коллизий (например, сплошные блоки или 45-градусные уклоны). Чтобы быстро применить похожую форму коллизии к нескольким тайлам, используйте функциональность для :ref:`назначения свойств нескольким тайлам одновременно <doc_using_tilemaps_assigning_properties_to_multiple_tiles>`.
ta: உங்களிடம் ஒரு பெரிய டைல்செட் இருந்தால், ஒவ்வொரு ஓடுக்கும் மோதலை தனித்தனியாகக் குறிப்பிடுவது நிறைய நேரம் ஆகலாம். பொதுவான மோதல் வடிவங்களுடன் (திடமான தொகுதிகள் அல்லது 45 டிகிரி சரிவுகள் போன்றவை) பல ஓடுகளைக் கொண்டிருப்பதால் இது குறிப்பாக உண்மை. பல ஓடுகளுக்கு ஒத்த மோதல் வடிவத்தை விரைவாகப் பயன்படுத்த, செயல்பாட்டைப் பயன்படுத்தவும்: குறிப்பு: `பல ஓடுகளுக்கு பண்புகளை ஒரே நேரத்தில் ஒதுக்குங்கள் <doc_using_tilemaps_assigning_properties_to_multiple_tiles>`.
tr: Büyük bir karo setiniz varsa, her bir karo için çarpışmayı ayrı ayrı belirtmek çok zaman alabilir. Bu özellikle karo haritalarının ortak çarpışma şekillerine (katı bloklar veya 45 derecelik eğimler gibi) sahip birçok karoya sahip olma eğiliminde olduğu için doğrudur. Benzer bir çarpışma şeklini birçok karoya hızlı bir şekilde uygulamak için :ref:`özellikleri aynı anda birden fazla karoya atama <doc_using_tilemaps_assigning_properties_to_multiple_tiles>` işlevini kullanın.
uk: Якщо у вас великий набір плиток, визначення колізії для кожної плитки окремо може зайняти багато часу. Це особливо вірно, оскільки TileMaps, як правило, має багато плиток із загальними шаблонами зіткнень (наприклад, суцільні блоки або 45-градусні схили).Щоб швидко застосувати подібну форму зіткнення до кількох плиток, скористайтеся функцією :ref:`assign properties to multiple tiles at once <doc_using_tilemaps_assigning_properties_to_multiple_tiles>`.
zh_tw: 如果你有一個大的圖塊集，為每個圖塊單獨指定碰撞可能會花費很多時間。尤其是在 TileMaps 中往往有許多具有常見碰撞模式（如實心塊或 45 度斜坡）的圖塊。要快速將類似的碰撞形狀應用到多個圖塊，請使用 :ref:`一次為多個圖塊指定屬性<doc_using_tilemaps_assigning_properties_to_multiple_tiles>` 的功能。

source: Assigning custom metadata to the TileSet's tiles
es: Asignación de metadatos personalizados a los tiles del TileSet
ga: Meiteashonraí saincheaptha a shannadh do tíleanna an TileSet
ja: タイルセットのタイルにカスタムメタデータを割り当てる
pt_br: Atribuindo metadados personalizados aos tiles do TileSet
ru: Назначение пользовательских метаданных тайлам TileSet
ta: டைல்செட்டின் ஓடுகளுக்கு தனிப்பயன் மெட்டாடேட்டாவை ஒதுக்குதல்
tr: TileSet'in karolarına özel meta veriler atama
uk: Призначення спеціальних метаданих плиткам TileSet
zh_tw: 為 TileSet 的圖塊分配自訂中繼資料

source: You can assign custom data on a per-tile basis using *custom data layers*. This can be useful to store information specific to your game, such as the damage that a tile should deal when the player touches it, or whether a tile can be destroyed using a weapon.
es: Puedes asignar datos personalizados a cada tile mediante *capas de datos personalizados*. Esto puede resultar útil para almacenar información específica de tu juego, como el daño que debe causar un tile cuando el jugador lo toca o si un tile se puede destruir con un arma.
ga: Is féidir leat sonraí saincheaptha a shannadh ar bhonn in aghaidh tíl ag baint úsáide* sraitheanna sonraí saincheaptaí*. Is féidir leis seo a bheith úsáideach chun faisnéis a stóráil a bhaineann go sonrach do chluiche, mar shampla an damáiste ar chóir do tíl déileáil nuair a théann an t-imreoir i dteagmháil leis, nó cibé an féidir tíl a scriosadh ag úsáid arm.
ja: 各タイルごとに *カスタムデータレイヤー* を使用して独自のデータを割り当てることができます。これにより、プレイヤーが触れたときにタイルが与えるダメージや、タイルが武器で破壊可能かどうかといった、ゲーム固有の情報を保存するのに役立ちます。
pt_br: Você pode atribuir dados personalizados para cada tile usando *camadas de dados personalizados*. Isso pode ser útil para armazenar informações específicas do seu jogo, como o dano que um tile deve causar quando o jogador encosta nele ou se um tile pode ser destruído usando uma arma.
ru: Вы можете назначать пользовательские данные для каждой тайлы, используя *пользовательские слои данных*. Это может быть полезно для хранения информации, специфичной для вашей игры, например, урон, который тайл должен нанести, когда игрок касается его, или можно ли уничтожить его с помощью оружия.
ta: *தனிப்பயன் தரவு அடுக்குகள் *ஐப் பயன்படுத்தி ஒரு டைல் அடிப்படையில் தனிப்பயன் தரவை ஒதுக்கலாம். உங்கள் விளையாட்டுக்கு குறிப்பிட்ட தகவல்களைச் சேமிக்க இது பயனுள்ளதாக இருக்கும், அதாவது வீரர் அதைத் தொடும்போது ஒரு ஓடு சமாளிக்க வேண்டிய சேதம் அல்லது ஒரு ஆயுதத்தைப் பயன்படுத்தி ஒரு ஓடு அழிக்க முடியுமா போன்றவை.
tr: *Özel veri katmanlarını* kullanarak karo başına özel veri atayabilirsiniz. Bu, oyuncu dokunduğunda bir karonun vermesi gereken hasar veya bir silah kullanılarak bir karonun yok edilip edilemeyeceği gibi oyununuza özgü bilgileri saklamak için yararlı olabilir.
uk: Ви можете призначати спеціальні дані для кожної плитки за допомогою *спеціальних шарів даних*. Це може бути корисним для зберігання інформації, специфічної для вашої гри, наприклад шкоди, яку має завдати плитка, коли до неї торкається гравець, або чи можна знищити плитку за допомогою зброї.
zh_tw: 你可以使用*自訂資料層*來為各個圖塊分配自訂資料。可以用來儲存遊戲過程中所需的特定資訊，例如玩家接觸該圖塊時應該受到的傷害，以及是否能夠使用物理將圖塊摧毀。
