Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: **Margins:** The margins on the image's edges that should not be selectable as tiles (in pixels). Increasing this can be useful if you download a tilesheet image that has margins on the edges (e.g. for attribution).
es: **Márgenes:** Los márgenes en los bordes de la imagen que no deben poder seleccionarse como tiles (en píxeles). Aumentar esto puede resultar útil si descarga una imagen de hoja de mosaico que tiene márgenes en los bordes (por ejemplo, para atribución).
fr: **Marges :** Les marges sur les bords de l'image qui ne doivent pas être sélectionnables comme tuiles (en pixels). Cela peut être utile si vous téléchargez une image de feuille de tuile qui a des marges sur les bords (par ex. pour l'attribution).
ga: **Corrlaigh: ** Na corrlaigh ar imill na híomhá nár chóir a bheith inroghnaithe mar tíleanna (i bpicteilíní). Is féidir leis seo a mhéadú a bheith úsáideach má íoslódálann tú íomhá bileog tíl a bhfuil corrlach ar na himill (m.sh. le haghaidh sannadh).
ja: **Margins:** 画像の端からどこまでがタイルに選ばれないようにするかのマージン(ピクセル単位)。これを大きくすると端に余白があるタイルシート画像をダウンロードした時に便利です(例えばクレジット付きの画像など)。
pt_br: **Margens:** As margens nas bordas da imagem que não devem ser selecionáveis como tiles (em pixels). Aumentar isso pode ser útil se você baixar um tilesheet com margens nas bordas (por exemplo, para atribuição).
ru: **Margins:** Поля по краям изображения, которые не должны быть выбраны как тайлы (в пикселях). Увеличение этого значения может быть полезным, если вы загружаете изображение tilesheet, которое имеет поля по краям (например, для атрибуции).
ta: ** விளிம்புகள்: ** படத்தின் விளிம்புகளில் உள்ள விளிம்புகள் ஓடுகளாக (பிக்சல்களில்) தேர்ந்தெடுக்கப்படக்கூடாது. விளிம்புகளில் விளிம்புகளைக் கொண்ட ஒரு டில்சீட் படத்தை நீங்கள் பதிவிறக்கம் செய்தால் இதை அதிகரிப்பது பயனுள்ளதாக இருக்கும் (எ.கா. பண்புக்கூறு).
tr: **Kenar Boşlukları:** Görüntünün kenarlarında, karo olarak seçilmemesi gereken kenar boşlukları (piksel cinsinden). Kenarlarında kenar boşlukları olan (örneğin atıf yapmak için) bir karo kağıdı görüntüsü indiriyorsanız bunu artırmak yararlı olabilir.
uk: **Поля:** поля на краях зображення, які не можна вибирати як плитки (у пікселях). Збільшення цього значення може бути корисним, якщо ви завантажуєте зображення мозаїчного аркуша з полями по краях (наприклад, для атрибуції).
zh_tw: **邊界：** 圖塊表邊緣不作為圖塊的像素寬度。若你的圖塊表有邊界（如標示作者），可適當增加此值。

source: **Separation:** The separation between each tile on the atlas in pixels. Increasing this can be useful if the tilesheet image you're using contains guides (such as outlines between every tile).
es: **Separación:** La separación entre cada tile en el atlas en píxeles. Aumentar esto puede ser útil si la imagen de la hoja de tiles que estás usando contiene guías (como contornos entre cada tile).
fr: **Séparation :** La séparation entre chaque tuile sur l'atlas en pixels. L’augmenter peut être utile si l'image de feuille de tuile que vous utilisez contient des guides (comme des contours entre chaque tuile).
ga: **Scaradh: ** An scaradh idir gach tíl ar an atlas i bpicteilíní. Is féidir leis seo a mhéadú a bheith úsáideach má tá treoracha sa íomhá bileog tíl atá á úsáid agat (mar shampla imlíne idir gach tíl).
ja: **間隔:** アトラス内のそれぞれのタイル間の距離。ピクセル単位。これを大きくするとガイド要素(例えばタイルの間に輪郭があるなど)があるタイルシート画像を使う場合に便利かもしれません。
pt_br: **Separação:** A separação entre cada tile no atlas em pixels. Aumentar esse valor pode ser útil se a imagem do tilesheet que você está usando contiver guias (como contornos entre cada bloco).
ru: **Separation:** Разделение между каждым тайлом на атласе в пикселях. Увеличение этого значения может быть полезным, если используемое вами изображение tilesheet содержит направляющие (например, контуры между каждым тайлом).
ta: ** பிரித்தல்: ** பிக்சல்களில் அட்லசில் உள்ள ஒவ்வொரு ஓடுக்கும் இடையில் பிரித்தல். நீங்கள் பயன்படுத்தும் டில்சீட் படத்தில் வழிகாட்டிகள் இருந்தால் (ஒவ்வொரு ஓடுக்கும் இடையில் திட்டவட்டங்கள் போன்றவை) இருந்தால் இதை அதிகரிப்பது பயனுள்ளதாக இருக்கும்.
tr: **Ayrılma:** Atlas üzerindeki her bir karo arasındaki piksel cinsinden ayrıklık. Kullandığınız karo kağıdı görüntüsü kılavuzlar içeriyorsa (her karo arasında ana hat çizgileri gibi) bunu artırmak yararlı olabilir.
uk: **Розділення:** Відстань між кожною плиткою на атласі в пікселях. Збільшення цього значення може бути корисним, якщо зображення мозаїки, яке ви використовуєте, містить напрямні (наприклад, контури між кожною плиткою).
zh_tw: **間隔：** 每個圖塊之間的像素距離。若圖塊表每格間有輔助線或間隔，請適當設定此值。

source: **Texture Region Size:** The size of each tile on the atlas in pixels. In most cases, this should match the tile size defined in the TileMapLayer property (although this is not strictly necessary).
pt_br: **Tamanho da Região de Textura:** O tamanho de cada tile no atlas em pixels. Geralmente, isso deve corresponder ao tamanho do bloco definido na propriedade TileMapLayer (embora isso não seja estritamente necessário).
ru: **Texture Region Size:** Размер каждого тайла на атласе в пикселях. В большинстве случаев это должно соответствовать размеру тайла, определенному в свойстве TileMapLayer (хотя это не строго обязательно).
ta: ** அமைப்பு பிராந்திய அளவு: ** பிக்சல்களில் அட்லசில் உள்ள ஒவ்வொரு ஓடுகளின் அளவு. பெரும்பாலான சந்தர்ப்பங்களில், இது டைல்மாபிளேயர் சொத்தில் வரையறுக்கப்பட்ட ஓடு அளவுடன் பொருந்த வேண்டும் (இது கண்டிப்பாக தேவையில்லை என்றாலும்).
uk: **Розмір області текстури:** Розмір кожної плитки на атласі в пікселях. У більшості випадків це має відповідати розміру мозаїки, визначеному у властивості TileMapLayer (хоча це не обов’язково).
zh_tw: **紋理區域大小：** 每個圖塊的像素尺寸。通常建議與 TileMapLayer 設定的圖塊大小一致（但不是強制）。

source: **Use Texture Padding:** If checked, adds a 1-pixel transparent edge around each tile to prevent texture bleeding when filtering is enabled. It's recommended to leave this enabled unless you're running into rendering issues due to texture padding.
es: **Usar Padding de Textura:** Si está marcado, agrega un borde transparente de 1 píxel alrededor de cada tile para evitar que la textura se desvanezca cuando está habilitado un filtro. Se recomienda dejar esto habilitado a menos que tenga problemas de renderizado debido al padding de textura.
fr: **Utilisez le padding de texture :** Si cette case est cochée, ajoute un bord transparent de 1 pixel autour de chaque tuile pour éviter le saignement de la texture lorsque le filtrage est activé. Il est recommandé de laisser cette option activée sauf si vous rencontrez des problèmes de rendu dus au padding de texture.
ga: ** Úsáid Padding Uigeachta: ** Má tá sé á sheiceáil, cuireann sé imeall trédhearcach 1-picteilín timpeall gach tíl chun fuiliú uigeachta a chosc nuair a dhéantar scagadh Moltar é seo a fhágáil cumasaithe mura bhfuil fadhbanna rindreála ort mar gheall ar phástáil uigeachta.
ja: **Use Texture Padding:** 有効化すると、各タイルの周囲に1ピクセルの透明なエッジを追加され、フィルタリングが有効になっているときのテクスチャのにじみを防ぎます。テクスチャパディングによるレンダリングの問題が発生しない限り、これを有効のままにすることをお勧めします。
pt_br: **Usar preenchimento de textura:** Se marcado, adiciona uma borda transparente de 1 pixel ao redor de cada tile para evitar bleeding de textura quando a filtragem estiver habilitada. Recomenda-se deixar essa opção habilitada, a menos que você esteja com problemas de renderização devido ao preenchimento de textura.
ru: **Use Texture Padding:** Если отмечено, добавляет 1-пиксельную прозрачную кромку вокруг каждого тайла, чтобы предотвратить просачивание текстуры при включенной фильтрации. Рекомендуется оставить эту опцию включенной, если только у вас не возникают проблемы с рендерингом из-за текстурной подложки.
ta: . அமைப்பு திணிப்பு காரணமாக நீங்கள் வழங்குதல் சிக்கல்களுக்கு ஓடாவிட்டால் இதை இயக்குவதை விட்டுவிட பரிந்துரைக்கப்படுகிறது.
tr: **Doku Dolgulaması Kullan:** İşaretliyse, filtreleme etkinleştirildiğinde doku taşmasını önlemek için her karonun etrafına 1 piksellik şeffaf bir kenar ekler. Doku dolgulaması nedeniyle işleme sorunlarıyla karşılaşmadığınız sürece bunu etkin bırakmanız önerilir.
uk: **Використовувати доповнення текстури:** якщо позначено, додає 1-піксельний прозорий край навколо кожної плитки, щоб запобігти витоку текстури, коли фільтрування ввімкнено. Рекомендовано залишати цю функцію ввімкненою, якщо у вас не виникають проблеми з відображенням через доповнення текстури.
zh_tw: **使用紋理邊界：** 勾選後會在每個圖塊四周加 1 像素透明邊，避免開啟過濾時出現紋理滲色。建議預設啟用，除非邊界導致算繪問題。

source: Note that changing texture margin, separation and region size may cause tiles to be lost (as some of them would be located outside the atlas image's coordinates). To regenerate tiles automatically from the tilesheet, use the three vertical dots menu button at the top of the TileSet editor and choose **Create Tiles in Non-Transparent Texture Regions**:
es: Tenga en cuenta que cambiar el margen de la textura, la separación y el tamaño de la región puede provocar la pérdida de tiles (ya que algunos de ellos estarían ubicados fuera de las coordenadas de la imagen del atlas). Para regenerar tiles automáticamente desde la hoja de tiles, use el botón de menú de tres puntos verticales en la parte superior del editor TileSet y elija **Crear tiles en regiones de textura no transparentes**:
ga: Tabhair faoi deara go bhféadfadh sé go gcaillfí tíleanna mar gheall ar athrú corrlach uigeachta, deighilte agus méid an réigiúin (mar go mbeadh cuid acu suite lasmuigh de chomhordanáidí íomhá an atlais). Chun tíleanna a athghiniúint go huathoibríoch ón mbileog tíleanna, úsáid an cnaipe roghchláir trí phonc ingearach ag barr an eagarthóra TileSet agus roghnaigh **Cruthaigh Tíleanna i Réigiúin Uigeachta Neamhthrédhearcacha**:
ja: 注意: Texture margin、間隔、Region size を変更すると、タイルが一部失われる可能性があります(これによってタイルがアトラス画像の外側の座標に配置されるため)。タイルシートからタイルを自動的に再生成するには、TileSetエディタの上部にある縦3点メニューボタンを使い、 **不透明なテクスチャ領域にタイルを作成** を選択します:
pt_br: Observe que alterar a margem da textura, a separação e a dimensão da região pode causar a perda de tiles (já que alguns deles estariam localizados fora das coordenadas da imagem do atlas). Para regenerar blocos automaticamente a partir do tilesheet, use o botão de menu com três pontos verticais na parte superior do editor TileSet e escolha **Criar Blocos em Regiões de Textura Não Transparentes**:
ru: Обратите внимание, что изменение поля текстуры, разделения и размера области может привести к потере тайлов (так как некоторые из них будут расположены за пределами координат изображения атласа). Чтобы автоматически регенерировать тайлы из tilesheet, используйте кнопку меню с тремя вертикальными точками в верхней части редактора TileSet и выберите **Create Tiles in Non-Transparent Texture Regions** (Создать тайлы в непрозрачных областях текстуры):
ta: அமைப்பு விளிம்பு, பிரிப்பு மற்றும் பிராந்திய அளவை மாற்றுவது ஓடுகளை இழக்கக்கூடும் என்பதை நினைவில் கொள்க (அவற்றில் சில அட்லச் படத்தின் ஒருங்கிணைப்புகளுக்கு வெளியே அமைந்திருக்கும்). டில்சீட்டிலிருந்து தானாக ஓடுகளை மீண்டும் உருவாக்க, டைல்செட் எடிட்டரின் மேற்புறத்தில் உள்ள மூன்று செங்குத்து புள்ளிகள் பட்டியல் பொத்தானைப் பயன்படுத்தி ** வெளிப்படையான அமைப்பு பகுதிகளில் ஓடுகளை உருவாக்கு **:
tr: Doku kenar boşluğu, ayrılma ve bölge boyutunun değiştirilmesinin karoların kaybedilmesine neden olabileceğini unutmayın (çünkü bazıları atlas görüntüsünün koordinatlarının dışında yer alacaktır). Karoları karo kağıdından otomatik olarak yeniden oluşturmak için, TileSet düzenleyicisinin üst kısmındaki üç dikey nokta menü düğmesini kullanın ve **Saydam Olmayan Doku Bölgelerinde Karo Oluştur** ögesini seçin:
uk: Зауважте, що зміна поля текстури, розділення та розміру області може спричинити втрату плиток (оскільки деякі з них будуть розташовані за межами координат зображення атласу). Щоб повторно генерувати плитки автоматично з аркуша плиток, скористайтеся кнопкою меню з трьома вертикальними крапками у верхній частині редактора TileSet і виберіть **Створити плитки в непрозорих областях текстури**:
zh_tw: 請注意，調整紋理邊界、間隔及區域大小可能導致部分圖塊無法正確分割。若需要重新自動產生圖塊，可在 TileSet 編輯器頂部的「三點選單」下選擇 **在非透明紋理區域建立圖塊**。

source: Recreating tiles automatically after changing atlas properties
es: Recrear tiles automáticamente después de cambiar las propiedades del atlas
fr: Recréation automatique des tuiles après un changement des propriétés de l'atlas
ga: Tíleanna a athdhéanamh go huathoibríoch tar éis airíonna atlas
ja: アトラスのプロパティを変更した後にタイルを自動再生成
pt_br: Recriando tiles automaticamente após alterar as propriedades do atlas
ru: Автоматическое пересоздание тайлов после изменения свойств атласа
ta: அட்லச் பண்புகளை மாற்றிய பின் தானாக ஓடுகளை மீண்டும் உருவாக்குதல்
tr: Atlas özelliklerini değiştirdikten sonra karoları otomatik olarak yeniden oluşturma
uk: Автоматичне повторне створення плиток після зміни властивостей атласу
zh_tw: 變更圖塊集屬性後自動重新產生圖塊

source: Using a collection of scenes
es: Usando una colección de escenas
fr: Utiliser une collection de scènes
ga: Ag baint úsáide as bailiúchán radhairc
ja: シーンのコレクションを使用する
ru: Наборы сцен
ta: காட்சிகளின் தொகுப்பைப் பயன்படுத்துதல்
tr: Bir sahne koleksiyonu kullanma
uk: Використання колекції сцен
zh_tw: 使用場景集合

source: Since Godot 4.0, you can place actual *scenes* as tiles. This allows you to use any collection of nodes as a tile. For example, you could use scene tiles to place gameplay elements, such as shops the player may be able to interact with. You could also use scene tiles to place AudioStreamPlayer2Ds (for ambient sounds), particle effects, and more.
es: Desde Godot 4.0, puedes colocar verdaderas *escenas* como tiles. Esto le permite utilizar cualquier colección de nodos como tile. Por ejemplo, puedes usar tiles de escena para colocar elementos del juego, como tiendas con las que el jugador pueda interactuar. También puedes usar tiles de escena para colocar AudioStreamPlayer2D (para sonidos ambientales), efectos de partículas y más.
fr: Depuis Godot 4.0, vous pouvez placer des *scènes* comme des tuiles. Cela vous permet d'utiliser toute collection de nœuds comme tuile. Par exemple, vous pouvez utiliser des tuiles de scène pour placer des éléments de gameplay, tels que des magasins où le joueur peut interagir avec. Vous pouvez également utiliser des tuiles de scène pour placer des AudioStreamPlayer2D (pour les sons ambiants), les effets de particules, et plus encore.
ga: Ó Godot 4.0, is féidir leat* radhairceanna* iarbhír a chur mar tíleanna. Ligeann sé seo duit aon bhailiúchán nóid a úsáid mar tíl. Mar shampla, d'fhéadfá tíleanna radhairc a úsáid chun eilimintí gameplay a chur, mar shampla siopaí a d'fhéadfadh an t-imreoir a bheith in ann idirghníomhú leo. D'fhéadfá tíleanna radhairc a úsáid freisin chun AudioStreamPlayer2DS a chur (le haghaidh fuaimeanna comhthimpeallacha), éifeachtaí cáithníní, agus go leor eile.
ja: Godot 4.0からは、 *シーン* そのものをタイルとして設置することができます。これによってどのようなノードもタイルとして扱うことができます。例えば、シーンタイルを使えばプレイヤーがインタラクトするショップのようなゲーム要素をタイルに並べることができます。また、 AudioStreamPlayer2D (環境音に)、パーティクルエフェクトなども並べられます。
pt_br: Desde o Godot 4.0, você pode colocar *cenas* reais como tiles. Isso permite usar qualquer conjunto de nós como um tile. Por exemplo, você pode usar tiles de cena para colocar elementos de jogabilidade, como lojas com as quais o jogador pode interagir. Você também pode usar tiles de cena para colocar AudioStreamPlayer2Ds (para sons ambientes), efeitos de partículas e muito mais.
ru: Начиная с Godot 4.0, вы можете размещать настоящие *сцены* как тайла. Это позволяет вам использовать любую коллекцию узлов в качестве тайла. Например, вы можете использовать тайлы сцены для размещения элементов игрового процесса, таких как магазины, с которыми игрок может взаимодействовать. Вы также можете использовать тайлы сцены для размещения AudioStreamPlayer2D-ов (для окружающих звуков), эффектов частиц и многого другого.
ta: கோடோட் 4.0 என்பதால், நீங்கள் உண்மையான * காட்சிகளை * ஓடுகளாக வைக்கலாம். எந்தவொரு முனைகளின் தொகுப்பையும் ஓடு பயன்படுத்த இது உங்களை அனுமதிக்கிறது. எடுத்துக்காட்டாக, விளையாட்டு ஓடுகளை நீங்கள் பயன்படுத்தலாம், விளையாட்டு கூறுகளை வைக்க, அதாவது பிளேயர் தொடர்பு கொள்ளக்கூடிய கடைகள் போன்றவை. ஆடியோச்ட்ரீஆம்ப்ளேயர் 2 டி (சுற்றுப்புற ஒலிகளுக்கு), துகள் விளைவுகள் மற்றும் பலவற்றை வைக்க நீங்கள் காட்சி ஓடுகளைப் பயன்படுத்தலாம்.
tr: Godot 4.0'dan bu yana, gerçek *sahneleri* karolar olarak yerleştirebilirsiniz. Bu, herhangi bir düğüm koleksiyonunu karo olarak kullanmanıza olanak tanır. Örneğin, oyuncunun etkileşime girebileceği mağazalar gibi oyun ögelerini yerleştirmek için sahne karolarını kullanabilirsiniz. Ayrıca AudioStreamPlayer2D'leri (ortam sesleri için), parçacık efektlerini ve daha fazlasını yerleştirmek için sahne karolarını kullanabilirsiniz.
uk: Починаючи з Godot 4.0, ви можете розміщувати справжні *сцени* як плитки. Це дозволяє використовувати будь-яку колекцію вузлів як плитку. Наприклад, ви можете використовувати плитки сцени для розміщення елементів ігрового процесу, таких як магазини, з якими гравець може взаємодіяти. Ви також можете використовувати плитки сцени для розміщення AudioStreamPlayer2D (для навколишніх звуків), ефектів частинок тощо.
zh_tw: 自 Godot 4.0 起，你可以將實際的 *場景* 作為圖塊放置。這表示你可以將任意節點集合用作圖塊。例如，場景圖塊可以用來放置遊戲要素，像是玩家可以互動的商店，也能用於放置 AudioStreamPlayer2D（環境音效）、粒子特效等。

source: Scene tiles come with a greater performance overhead compared to atlases, as every scene is instanced individually for every placed tile.
es: Los tiles de escena tienen una mayor sobrecarga de rendimiento en comparación con los atlas, ya que cada escena se crea individualmente para cada tile colocado.
fr: Les tuiles de scène présentent un plus grand surcoût de performance par rapport aux atlas, car chaque scène est étudiée individuellement pour chaque tuile placée.
ga: Tagann laochaird feidhmíochta níos mó le tíleanna radhairc i gcomparáid le atlasanna, toisc go gcuirtear gach radharc isteach ina n-aonar do gach tíl a chuirtear.
ja: シーンタイルは使われた全てのシーンが別々にインスタンス化されて設置されるので、アトラスタイルよりも処理のオーバーヘッドが大きくなります。
pt_br: Os tiles de cena possuem uma sobrecarga de desempenho maior em comparação com os atlas, pois cada cena é instanciada individualmente para cada tile colocado.
ru: Тайлы сцен имеют большую нагрузку на производительность по сравнению с атласами, поскольку каждая сцена создается индивидуально для каждого размещенного тайла.
ta: அட்லசுடன் ஒப்பிடும்போது காட்சி ஓடுகள் அதிக செயல்திறன் மேல்நோக்கி வருகின்றன, ஏனெனில் ஒவ்வொரு காட்சியும் ஒவ்வொரு வைக்கப்பட்டிருக்கும் ஓடுக்கும் தனித்தனியாக நிறுவப்படுகிறது.
tr: Yerleştirilen her karo için her sahne ayrı ayrı örneklendiğinden, sahne karoları atlaslara kıyasla daha fazla performans yükü getirir.
uk: Плитки сцен мають більші накладні витрати на продуктивність порівняно з атласами, оскільки кожна сцена створюється окремо для кожної розміщеної плитки.
zh_tw: 場景圖塊比圖集圖塊有更高的效能負擔，因為每個放置的圖塊都會個別產生一個場景實例。

source: It's recommended to only use scene tiles when necessary. To draw sprites in a tile without any kind of advanced manipulation, :ref:`use atlases instead <doc_creating_tilesets_using_tilesheet>`.
pt_br: Recomenda-se usar tiles de cena somente quando necessário. Para desenhar sprites em um tiles sem qualquer tipo de manipulação avançada, :ref:`use atlas em vez de <doc_creating_tilesets_using_tilesheet>`.
ru: Рекомендуется использовать тайлы сцены только при необходимости. Чтобы рисовать спрайты в тайле без какой-либо сложной манипуляции, :ref:`или попробуйте атласы <doc_creating_tilesets_using_tilesheet>`.
ta: தேவைப்படும்போது காட்சி ஓடுகளை மட்டுமே பயன்படுத்த பரிந்துரைக்கப்படுகிறது. எந்தவிதமான மேம்பட்ட கையாளுதலும் இல்லாமல் ஒரு ஓடில் உருவங்களை வரைய,: ref: `அதற்கு பதிலாக அட்லசைப் பயன்படுத்தவும் <doc_creating_ylesets_using_tilesheet>`.
uk: Рекомендовано використовувати плитки сцен лише за необхідності. Щоб намалювати спрайти на плитці без будь-яких складних маніпуляцій, :ref:`use atlases instead <doc_creating_tilesets_using_tilesheet>`.
zh_tw: 建議僅在必要時才使用場景圖塊。如果只需要在圖塊中繪製精靈且不需進階操作，:ref:`請改用圖集 <doc_creating_tilesets_using_tilesheet>`。

source: For this example, we'll create a scene containing a CPUParticles2D root node. Save this scene to a scene file (separate from the scene containing the TileMapLayer), then switch to the scene containing the TileMapLayer node. Open the TileSet editor, and create a new **Scenes Collection** in the left column:
pt_br: Para este exemplo, vamos criar uma cena contendo um nó raiz CPUParticles2D. Salve esta cena em um arquivo de cena (separado da cena que contém o nó TileMapLayer), depois mude para a cena que contém o nó TileMapLayer. Abra o editor de TileSet e crie uma nova **Coleção de Cenas** na coluna da esquerda:
ru: Для этого примера мы создадим сцену, содержащую корневой узел CPUParticles2D. Сохраните эту сцену в файл сцены (отдельно от сцены, содержащей узел TileMapLayer), затем переключитесь на сцену, содержащую узел TileMapLayer. Откройте редактор TileSet и создайте новую **Scenes Collection** в левом столбце:
ta: இந்த எடுத்துக்காட்டுக்கு, Cpuparticles2d ரூட் முனையைக் கொண்ட ஒரு காட்சியை உருவாக்குவோம். இந்த காட்சியை ஒரு காட்சி கோப்பில் சேமிக்கவும் (டிலேமாபிளேயர் கொண்ட காட்சியில் இருந்து தனித்தனியாக), பின்னர் டைல்மாபிளேயர் முனையைக் கொண்ட காட்சிக்கு மாறவும். டைல்செட் எடிட்டரைத் திறந்து, இடது நெடுவரிசையில் புதிய ** காட்சிகள் தொகுப்பை ** உருவாக்கவும்:
uk: Для цього прикладу ми створимо сцену, яка містить кореневий вузол CPUParticles2D. Збережіть цю сцену у файл сцени (окремо від сцени, що містить TileMapLayer), а потім перейдіть до сцени, що містить вузол TileMapLayer. Відкрийте редактор TileSet і створіть нову **Колекцію сцен** у лівому стовпчику:
zh_tw: 本範例會先建立一個以 CPUParticles2D 為根節點的場景，將它存檔（與包含 TileMapLayer 的場景分開存），然後切換回包含 TileMapLayer 的場景。打開 TileSet 編輯器，在左側欄新增一個 **場景集合**：

source: Creating a scenes collection in the TileSet editor
es: Creando colecciones de escenas en el editor de TileSet
fr: Créer une collection de scènes dans l'éditeur TileSet
ga: Bailiúchán radhairc a chruthú san eagarthóir TileSet
it: Creazione di una collezione di scene nell'editor TileSet
ja: TileSetエディタでシーンコレクションを作成
ko: 타일셋 편집기에서 씬 컬렉션 만들기
ru: Создание коллекций сцен в редакторе TileSet
ta: டைல்செட் எடிட்டரில் ஒரு காட்சி தொகுப்பை உருவாக்குதல்
tr: TileSet düzenleyicisinde bir sahne koleksiyonu oluşturma
uk: Створення колекції сцен у редакторі TileSet
zh_tw: 在 TileSet 編輯器中建立場景集合
