Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: After creating a scenes collection, you can enter a descriptive name for the scenes collection in the middle column if you wish. Select this scenes collection then create a new scene slot:
es: Después de crear una colección de escenas, puede ingresar un nombre descriptivo en la columna del medio si lo desea. Seleccione esta colección de escenas y luego cree un nuevo espacio de escena:
fr: Après avoir créé une collection de scènes, vous pouvez entrer un nom descriptif pour la collection de scènes dans la colonne du milieu si vous le souhaitez. Sélectionnez cette collection de scènes puis créez un nouvel emplacement de scène :
ga: Tar éis duit bailiúchán radhairc a chruthú, is féidir leat ainm tuairisciúil a iontráil don bhailiúchán radhairc sa lár colún más mian leat. Roghnaigh an bailiúchán radhairc seo ansin cruthaigh sliotán radhairc nua:
ja: シーンコレクションを作った後。必要なら中央の列で分かりやすい名前を入力できます。シーンコレクションを選択して、新しくシーンスロットを作ります:
pt_br: Após criar uma coleção de cenas, você pode inserir um nome descritivo para a coleção de cenas na coluna do meio, se desejar. Selecione esta coleção de cenas e, em seguida, crie um novo slot de cena:
ru: После создания коллекции сцен вы можете ввести описательное имя для коллекции сцен в средней колонке, если хотите. Выберите эту коллекцию сцен, затем создайте новый слот сцены:
ta: ஒரு காட்சிகள் தொகுப்பை உருவாக்கிய பிறகு, நீங்கள் விரும்பினால் நடுத்தர நெடுவரிசையில் காட்சிகள் சேகரிப்புக்கான விளக்கமான பெயரை உள்ளிடலாம். இந்த காட்சிகள் தொகுப்பைத் தேர்ந்தெடுத்து, புதிய காட்சி இடத்தை உருவாக்கவும்:
tr: Bir sahne koleksiyonu oluşturduktan sonra, dilerseniz orta sütunda sahne koleksiyonu için açıklayıcı bir ad girebilirsiniz. Bu sahne koleksiyonunu seçin ve ardından yeni bir sahne yuvası oluşturun:
uk: Після створення колекції сцен ви можете ввести описову назву колекції сцен у середній колонці, якщо хочете. Виберіть цю колекцію сцен, а потім створіть новий слот сцени:
zh_tw: 建立場景集合後，你可以在中間欄位輸入描述名稱。選擇該場景集合，再新增一個場景槽：

source: Creating a scene tile after selecting the scenes collection in the TileSet editor
es: Crear un tile de escena después de seleccionar la colección de escenas en el editor TileSet
fr: Création d'une tuile de scène après avoir sélectionné la collection de scènes dans l'éditeur TileSet
ga: Tíl radhairc a chruthú tar éis bailiúchán na radhairc a roghnú san eagarthóir TileSet
ja: TileSetエディタでシーンコレクションを選択した後、シーンタイルを作成
pt_br: Criando um tile de cena após selecionar a coleção de cenas no editor de TileSet
ru: Создание тайла сцены после выбора коллекции сцен в редакторе TileSet
ta: டைல்செட் எடிட்டரில் காட்சிகள் சேகரிப்பைத் தேர்ந்தெடுத்த பிறகு ஒரு காட்சி ஓடு உருவாக்குதல்
tr: TileSet düzenleyicisinde sahneler koleksiyonunu seçtikten sonra bir sahne karosu oluşturma
uk: Створення плитки сцени після вибору колекції сцен у редакторі TileSet
zh_tw: 在 TileSet 編輯器中選取場景集合後建立場景圖塊

source: Select this scene slot in the right column, then use **Quick Load** (or **Load**) to load the scene file containing the particles:
es: Seleccione esta ranura de escena en la columna de la derecha, luego use **Carga rápida** (o **Cargar**) para cargar el archivo de escena que contiene las partículas:
fr: Sélectionnez cet emplacement de scène dans la colonne de droite, puis utilisez **Chargement rapide** (ou **Charger**) pour charger le fichier de scène contenant les particules :
ga: Roghnaigh an sliotán radhairc seo sa cholún ceart, ansin bain úsáid as **Luchadh Tapa (nó **Lucht**) chun an comhad radhairc ina bhfuil na cáithníní a luchtú:
ja: シーンスロットは右の列から選択します。そして **クイックロード** (または **ロード**) をしてパーティクルが入っているシーンファイルをロードします:
pt_br: Selecione este slot de cena na coluna da direita e, em seguida, use **Carregamento Rápido** (ou **Carregar**) para carregar o arquivo de cena que contém as partículas:
ru: Выберите этот слот сцены в правом столбце, затем используйте **Quick Load** (или **Load**), чтобы загрузить файл сцены, содержащий частицы:
ta: வலது நெடுவரிசையில் இந்த காட்சி ச்லாட்டைத் தேர்ந்தெடுத்து, துகள்கள் கொண்ட காட்சி கோப்பை ஏற்ற ** விரைவான சுமை ** (அல்லது ** ஏற்ற **) ஐப் பயன்படுத்தவும்:
tr: Sağ sütunda bu sahne yuvasını seçin, ardından parçacıkları içeren sahne dosyasını yüklemek için **Hızlı Yükleme** (veya **Yükle**) seçeneğini kullanın:
uk: Виберіть цей слот сцени в правому стовпці, а потім скористайтеся **Quick Load** (або **Load**), щоб завантажити файл сцени, що містить частинки:
zh_tw: 在右側欄選擇這個場景槽，然後點擊 **快速載入**（或 **載入**）來載入含粒子的場景檔案：

source: Creating a scene slot, then loading a scene file into it in the TileSet editor
es: Crear una ranura de escena y luego cargar un archivo de escena en ella en el editor TileSet
fr: Création d'un emplacement de scène, puis chargement d'un fichier de scène dans celui-ci depuis l'éditeur TileSet
ga: Sliotán radhairc a chruthú, ansin comhad radhairc a luchtú isteach san eagarthóir TileSet
ja: TileSetエディタでシーンスロットを作成し、シーンファイルをロード
pt_br: Criando um slot de cena e, em seguida, carregando um arquivo de cena nele no editor de TileSet
ru: Создание слота сцены, а затем загрузка в него файла сцены в редакторе TileSet
ta: ஒரு காட்சி ச்லாட்டை உருவாக்கி, பின்னர் ஒரு காட்சி கோப்பை டைல்செட் எடிட்டரில் ஏற்றுகிறது
tr: Bir sahne yuvası oluşturma ve ardından TileSet düzenleyicisinde içine bir sahne dosyası yükleme
uk: Створення слота сцени, а потім завантаження в нього файлу сцени в редакторі TileSet
zh_tw: 在 TileSet 編輯器新增場景槽後，載入場景檔案

source: You now have a scene tile in your TileSet. Once you switch to the TileMap editor, you'll be able to select it from the scenes collection and paint it like any other tile.
es: Ahora tienes un tile de escena en tu TileSet. Una vez que cambie al editor TileMap, podrá seleccionarlo de la colección de escenas y pintarlo como cualquier otro tile.
fr: Vous avez maintenant une tuile de scène dans votre TileSet. Une fois que vous passez à l'éditeur TileMap, vous pourrez la sélectionner dans la collection des scènes et la peindre comme n'importe quelle autre tuile.
ga: Tá tíl radhairc agat anois i do TileSet. Nuair a aistríonn tú chuig eagarthóir TileMap, beidh tú in ann é a roghnú ón mbailiúchán radhairc agus é a phéinteáil cosúil le haon tíl eile.
ja: これでTileSetにシーンタイルができました。TileMapエディタに移れば、シーンコレクションからこれを選択したり、他と同じようにペイントしたりできます。
pt_br: Agora você tem um tile de cena no seu TileSet. Assim que você mudar para o editor de TileMap, poderá selecioná-lo na coleção de cenas e pintá-lo como qualquer outro tile.
ru: Теперь у вас есть тайл сцены в вашем TileSet. Как только вы переключитесь в редактор TileMap, вы сможете выбрать ее из коллекции сцен и раскрасить ее, как любой другой тайл.
ta: உங்கள் டைல்செட்டில் இப்போது ஒரு காட்சி ஓடு உள்ளது. நீங்கள் டைல்மேப் எடிட்டருக்கு மாறியதும், நீங்கள் அதை காட்சிகள் சேகரிப்பிலிருந்து தேர்ந்தெடுத்து வேறு எந்த ஓடு போல வண்ணம் தீட்ட முடியும்.
tr: Artık TileSet'inizde bir sahne karonuz var. TileMap düzenleyicisine geçtiğinizde, bunu sahneler koleksiyonundan seçebilecek ve diğer karolar gibi boyayabileceksiniz.
uk: Тепер у вашому TileSet є плитка сцени. Перейшовши до редактора TileMap, ви зможете вибрати його з колекції сцен і намалювати як будь-який інший тайл.
zh_tw: 此時你的 TileSet 已有一個場景圖塊。切換到 TileMap 編輯器後，就能從場景集合中選用並像其他圖塊一樣繪製它。

source: Merging several atlases into a single atlas
es: Fusionar varios atlas en un solo atlas
fr: Fusionner plusieurs atlas en un seul atlas
ga: Cumasc roinnt atlasanna i atlas amháin
it: Unire più atlanti in un unico atlante
ja: 複数のアトラスを一つのアトラスに統合する
pt_br: Mesclar vários atlas em um único atlas
ru: Объединение нескольких атласов в один атлас
ta: பல அட்லச்களை ஒற்றை அட்லசாக இணைக்கிறது
tr: Birkaç atlası tek bir atlasta birleştirme
uk: Об’єднання кількох атласів в один
zh_tw: 將多個圖集合併成單一圖集

source: Using multiple atlases within a single TileSet resource can sometimes be useful, but it can also be cumbersome in certain situations (especially if you're using one image per tile). Godot allows you to merge several atlases into a single atlas for easier organization.
es: El uso de varios atlas dentro de un único recurso TileSet a veces puede resultar útil, pero también puede resultar engorroso en determinadas situaciones (especialmente si utiliza una imagen por tile). Godot le permite fusionar varios atlas en un solo atlas para facilitar la organización.
fr: L'utilisation de multiples atlas dans une seule ressource TileSet peut parfois être utile, mais cela peut également être lourd dans certaines situations (surtout si vous utilisez une image par tuile). Godot vous permet de fusionner plusieurs atlas en un seul atlas pour faciliter l'organisation.
ga: Uaireanta is féidir le atlasanna iolracha a úsáid laistigh d'acmhainn TileSet amháin a bheith úsáideach, ach is féidir leis a bheith deacair freisin i gcásanna áirithe (go háirithe má tá íomhá amháin á úsáid agat in aghaidh an tíl). Ligeann Godot duit roinnt atlas a chumasc i atlas amháin le haghaidh eagrú níos éasca.
ja: 複数のアトラスを一つのタイルセットリソースで使っていると、便利な場合もありますが、状況によっては(特にタイル1つにつき1画像を使っている場合)面倒な場合もあります。Godotではそれぞれのアトラスを一つに統合して、より整理しやすくできます。
pt_br: Usar múltiplos atlas em um único recurso de TileSet pode ser útil em algumas situações, mas também pode ser incômodo em certos casos (especialmente se você estiver usando uma imagem por tile). O Godot permite que você mescle vários atlas em um único atlas para facilitar a organização.
ru: Использование нескольких атласов в одном ресурсе TileSet иногда может быть полезным, но в некоторых ситуациях это может быть обременительно (особенно если вы используете одно изображение на тайл). Godot позволяет объединять несколько атласов в один атлас для более простой организации.
ta: ஒற்றை டைல்செட் வளத்திற்குள் பல அட்லசைப் பயன்படுத்துவது சில நேரங்களில் பயனுள்ளதாக இருக்கும், ஆனால் சில சூழ்நிலைகளிலும் இது சிக்கலானதாக இருக்கும் (குறிப்பாக நீங்கள் ஒரு ஓடுக்கு ஒரு படத்தைப் பயன்படுத்துகிறீர்கள் என்றால்). பல அட்லச்களை எளிதான அமைப்புக்கான ஒற்றை அட்லாசில் ஒன்றிணைக்க கோடோட் உங்களை அனுமதிக்கிறது.
tr: Tek bir TileSet kaynağı içinde birden fazla atlas kullanmak bazen yararlı olabilir, ancak bazı durumlarda (özellikle her karo için bir görüntü kullanıyorsanız) hantal da olabilir. Godot, daha kolay bir düzen için birkaç atlası tek bir atlasta birleştirmenize olanak tanır.
uk: Використання кількох атласів в одному ресурсі TileSet іноді може бути корисним, але в певних ситуаціях це також може бути громіздким (особливо якщо ви використовуєте одне зображення на плитку). Godot дозволяє об’єднати кілька атласів в один атлас для легшої організації.
zh_tw: 在同一個 TileSet 資源中用多個圖集有時很方便，但某些情況下（例如每個圖塊用一張圖）會變得很難管理。Godot 提供了將多個圖集合併為單一圖集的功能，讓整理更容易。

source: To do so, you must have more than one atlas created in the TileSet resource. Use the "three vertical dots" menu button located at the bottom of the list of atlases, then choose **Open Atlas Merging Tool**:
es: Para hacerlo, debe tener más de un atlas creado en el recurso TileSet. Utilice el botón de menú "tres puntos verticales" ubicado en la parte inferior de la lista de atlas, luego elija **Abrir Herramienta de Combinación de Atlas**:
fr: Pour ce faire, vous devez avoir plus d'un atlas créé dans la ressource TileSet. Utilisez le bouton "trois points verticaux" du menu situé au bas de la liste des atlas, puis choisissez **Ouvrir l'outil de fusion d'atlas** :
ga: Chun é sin a dhéanamh, caithfidh níos mó ná atlas amháin a bheith cruthaithe san acmhainn TileSet. Úsáid an cnaipe roghchláir “trí ponc ingearacha” atá suite ag bun an liosta atlasanna, ansin roghnaigh **Uirlis Cumaisc Atlas Oscail**:
ja: そうするには、TileSetリソースの中に複数のアトラスを作成する必要があります。アトラスリストの下にある縦3点メニューボタンを使い、**アトラスのマージツールを開く** を選びましょう:
pt_br: Para fazer isso, você precisa ter mais de um atlas criado no recurso TileSet. Use o botão de menu "três pontos verticais" localizado na parte inferior da lista de atlas e, em seguida, escolha **Abrir Ferramenta de Mesclagem de Atlas**:
ru: Для этого необходимо иметь более одного атласа, созданного в ресурсе TileSet. Используйте кнопку меню «три вертикальные точки», расположенную в нижней части списка атласов, затем выберите **Open Atlas Merging Tool**:
ta: அவ்வாறு செய்ய, டைல்செட் வளத்தில் ஒன்றுக்கு மேற்பட்ட அட்லச் உருவாக்கப்பட வேண்டும். அட்லசின் பட்டியலின் கீழே அமைந்துள்ள "மூன்று செங்குத்து புள்ளிகள்" பட்டியல் பொத்தானைப் பயன்படுத்தவும், பின்னர் ** திறந்த அட்லச் இணைக்கும் கருவியைத் தேர்வுசெய்க **:
tr: Bunu yapmak için, TileSet kaynağında oluşturulmuş birden fazla atlasınız olmalıdır. Atlaslar listesinin altında bulunan "üç dikey nokta" menü düğmesini kullanın ve ardından **Atlas Birleştirme Aracı'nı Aç** ögesini seçin:
uk: Для цього у вас має бути більше одного атласу, створеного на ресурсі TileSet. Скористайтеся кнопкою меню «три вертикальні крапки», розташованою внизу списку атласів, а потім виберіть **Відкрити інструмент об’єднання атласів**:
zh_tw: 要執行此操作，你必須在 TileSet 資源裡先建立至少兩個圖集。然後在圖集列表下方點選「三個垂直點」功能表，選擇 **開啟圖集合併工具**：

source: Opening the atlas merging tool after creating multiple atlases
es: Abrir la herramienta de fusión de atlas después de crear varios atlas
fr: Ouvrir l'outil de fusion de l'atlas après avoir créé plusieurs atlas
ga: An uirlis chumasc atlas a oscailt tar éis atlasanna iolracha a chruthú
it: Apertura dello strumento di unione degli atlanti dopo aver creato più atlanti
ja: 複数のアトラスを作成しアトラスのマージツールを開く
pt_br: Abrindo a ferramenta de mesclagem de atlas após criar vários atlas
ru: Открытие инструмента объединения атласов после создания нескольких атласов
ta: பல அட்லச்களை உருவாக்கிய பின் அட்லச் இணைக்கும் கருவியைத் திறக்கிறது
tr: Birden fazla atlas oluşturduktan sonra atlas birleştirme aracını açma
uk: Відкриття інструменту об’єднання атласів після створення кількох атласів
zh_tw: 在建立多個圖集後開啟圖集合併工具

source: This will open a dialog, in which you can select several atlases by holding :kbd:`Shift` or :kbd:`Ctrl` then clicking on multiple elements:
es: Esto abrirá un cuadro de diálogo, en el que puede seleccionar varios atlas manteniendo presionado :kbd:`Shift` o :kbd:`Ctrl` y luego haciendo clic en varios elementos:
fr: Cela ouvrira une fenêtre, dans laquelle vous pouvez sélectionner plusieurs atlas en maintenant :kbd:`Shift` ou :kbd:`Ctrl` puis en cliquant sur plusieurs éléments :
ga: Osclóidh sé seo dialóg, inar féidir leat roinnt atlas a roghnú trí:kbd: `Shift` nó: kbd: `Ctrl` ansin cliceáil ar ileilimintí:
ja: これでダイアログが開きます。ここでは :kbd:`Shift` や :kbd:`Ctrl` を押しながら複数の要素をクリックすることで、複数のアトラスを選択できます。
pt_br: Isso abrirá uma janela na qual você poderá selecionar vários atlas segurando :kbd:`Shift` ou :kbd:`Ctrl` e clicando em vários elementos:
ru: Откроется диалоговое окно, в котором вы можете выбрать несколько атласов, удерживая :kbd:`Shift` или :kbd:`Ctrl`, а затем щелкая по нескольким элементам:
ta: இது ஒரு உரையாடலைத் திறக்கும், அதில் நீங்கள் வைத்திருப்பதன் மூலம் பல அட்லச்களைத் தேர்ந்தெடுக்கலாம்: KBD: `Shift` அல்லது: KBD:` Ctrl` பின்னர் பல கூறுகளைக் சொடுக்கு செய்க:
tr: Bu, :kbd:`Shift` veya :kbd:`Ctrl` tuşlarını basılı tutup birden fazla ögeye tıklayarak birkaç atlas seçebileceğiniz bir iletişim kutusu açacaktır:
uk: Відкриється діалогове вікно, у якому ви можете вибрати кілька атласів, утримуючи :kbd:`Shift` або :kbd:`Ctrl`, а потім клацаючи кілька елементів:
zh_tw: 這會開啟一個對話視窗，你可以按住 :kbd:`Shift` 或 :kbd:`Ctrl` 鍵點擊多個圖集來選取：

source: Using the atlas merging tool dialog
es: Uso del cuadro de diálogo de la herramienta de fusión de atlas
fr: Utilisation de la fenêtre de fusion d'atlas
ga: Ag baint úsáide as an dialóg uirlis chumasc atlas
ja: アトラスマージツールの使用
pt_br: Usando a janela da ferramenta de mesclagem de atlas
ru: Использование диалогового окна инструмента объединения атласов
ta: அட்லச் இணைக்கும் கருவி உரையாடலைப் பயன்படுத்துதல்
tr: Atlas birleştirme aracı iletişim kutusunu kullanma
uk: Використання діалогового вікна інструмента об’єднання атласу
zh_tw: 使用圖集合併工具對話視窗

source: Choose **Merge** to merge the selected atlases into a single atlas image (which translates to a single atlas within the TileSet). The unmerged atlases will be removed within the TileSet, but *the original tilesheet images will be kept on the filesystem*. If you don't want the unmerged atlases to be removed from the TileSet resource, choose **Merge (Keep Original Atlases)** instead.
es: Seleccione **Unir** para fusionar los atlas seleccionados en una única imagen de atlas (lo que se traduce en un único atlas dentro del TileSet). Los atlas no unidos se eliminarán dentro del TileSet, pero *las imágenes de las hojas de tiles originales se conservarán en el sistema de archivos*. Si desea que los atlas no unidos no se eliminen del recurso TileSet, seleccione **Unir (Conservar Atlas Originales)** en su lugar.
fr: Choisissez **Fusionner** pour fusionner les atlas sélectionnés en une seule image d'atlas (qui se traduit par un seul atlas dans le TileSet). Les atlas non fusionnés seront enlevés du TileSet, mais *les images originales seront conservées sur le système de fichiers*. Si vous ne voulez pas que les atlas non fusionnés soient retirés de la ressource TileSet, choisissez **Fusionner (Garder les atlas originaux)** à la place.
ga: Roghnaigh **Cumais** chun na atlasanna roghnaithe a chumasc in íomhá atlas amháin (a aistríonn go atlas amháin laistigh den TileSet). Bainfear na atlasanna neamh-chumasaithe laistigh den TileSet, ach*coinneofar na híomhánna bileog bhunaidh ar an gcóras comhad*. Mura dteastaíonn uait go mbainfear na atlasanna neamh-chumasaithe as an acmhainn TileSet, roghnaigh **Cumaisc (Coinnigh Atlasaí Bunaidh) ** ina ionad.
ja: \ **マージ** を選ぶと選択したアトラスが一つのアトラス画像に統合されます(タイルセットの中で1つのアトラスとして扱われるということです)。統合されていないアトラスはタイルセットから除外されますが。 *元のタイルシート画像はファイルシステムの中に保持されています* 。統合されていないアトラスがTileSetリソースから除去されないようにしたい場合、 **マージ(元のアトラスを保持)** を代わりに選びましょう。
pt_br: Escolha **Mesclar** para mesclar os atlas selecionados em uma única imagem de atlas (o que se traduz em um único atlas dentro do TileSet). Os atlas não mesclados serão removidos do TileSet, mas *as imagens originais dos tilesheets serão mantidas no sistema de arquivos*. Se você não quiser que os atlas não mesclados sejam removidos do recurso TileSet, escolha **Mesclar (Manter Atlas Originais)** em vez disso.
ru: Выберите **Merge**, чтобы объединить выбранные атласы в одно изображение атласа (что преобразуется в один атлас в TileSet). Необъединенные атласы будут удалены в TileSet, но *исходные изображения листов тайлов будут сохранены в файловой системе*. Если вы не хотите, чтобы необъединенные атласы были удалены из ресурса TileSet, выберите **Merge (Keep Original Atlases)**.
ta: தேர்ந்தெடுக்கப்பட்ட அட்லச்களை ஒற்றை அட்லச் படமாக இணைக்க ** ஒன்றிணைக்க ** தேர்வு செய்யவும் (இது டைல்செட்டுக்குள் உள்ள ஒற்றை அட்லாசாக மொழிபெயர்க்கப்பட்டுள்ளது). அவிழ்க்கப்படாத அட்லச்கள் டைல்செட்டுக்குள் அகற்றப்படும், ஆனால் *அசல் டில்சீட் படங்கள் கோப்பு முறைமையில் வைக்கப்படும் *. டைல்செட் வளத்திலிருந்து அவிழ்க்கப்படாத அட்லச்கள் அகற்றப்படுவதை நீங்கள் விரும்பவில்லை என்றால், ** ஒன்றிணைக்கவும் (அசல் அட்லச்களை வைத்திருங்கள்) ** அதற்கு பதிலாக.
tr: Seçilen atlasları tek bir atlas görüntüsünde birleştirmek için **Birleştir** seçeneğini seçin (bu TileSet içinde tek bir atlas anlamına gelir). Birleştirilmemiş atlaslar TileSet içinden kaldırılacak, ancak *orijinal karo kağıdı görüntüleri dosya sisteminde tutulacaktır*. Birleştirilmemiş atlasların TileSet kaynağından kaldırılmasını istemiyorsanız, bunun yerine **Birleştir (Kaynak Atlasları Sakla)** seçeneğini seçin.
uk: Виберіть **Об’єднати**, щоб об’єднати вибрані атласи в одне зображення атласу (що перетворюється на один атлас у TileSet). Необ’єднані атласи буде видалено з TileSet, але *оригінальні зображення аркушів листів зберігатимуться у файловій системі*. Якщо ви не хочете, щоб необ’єднані атласи було видалено з ресурсу TileSet, виберіть натомість **Об’єднати (зберегти оригінальні атласи)**.
zh_tw: 選擇 **合併** 會把選取的圖集合併成一個圖集（即 TileSet 內只剩一個圖集）。未合併的圖集會從 TileSet 中移除，但*原始圖集影像仍會保留在檔案系統*。如果不想移除未合併的圖集，請選擇 **合併（保留原圖集）**。

source: TileSet features a system of *tile proxies*. Tile proxies are a mapping table that allows notifying the TileMap using a given TileSet that a given set of tile identifiers should be replaced by another one.
es: TileSet incorpora un sistema de *proxies de tiles*. Los proxies de tiles son una tabla de mapeo que permite notificar al TileMap, utilizando un TileSet dado, que un conjunto determinado de identificadores de tiles debe ser reemplazado por otro.
ga: Tá córas de*seachfhálaí tíle* ag TileSet. Is tábla mapála iad proxies tíl a cheadaíonn fógra a thabhairt don TileMap ag baint úsáide as TileSet ar leith gur chóir ceann eile a chur in ionad tacar áirithe aitheantóirí tíl.
ja: TileSetにはタイルプロキシのシステムが搭載されています。タイルプロキシはマッピングテーブルであり、指定されたTileSetを使用するTileMapに対して、あるタイル識別子のセットを別のものに置き換える必要があることを通知する役割を持ちます。
pt_br: O TileSet possui um sistema de *proxies de tile*. Proxies de tile são uma tabela de mapeamento que permite notificar o TileMap que utiliza um determinado TileSet de que um conjunto específico de identificadores de tiles deve ser substituído por outro.
ru: TileSet имеет систему *tile proxies*. Прокси тайлов представляют собой таблицу сопоставления, которая позволяет уведомлять TileMap, использующую заданный TileSet, о том, что заданный набор идентификаторов тайлов следует заменить другим.
ta: டைல்செட் *ஓடு ப்ராக்சிகள் *இன் அமைப்பைக் கொண்டுள்ளது. ஓடு ப்ராக்சிகள் என்பது ஒரு மேப்பிங் அட்டவணை ஆகும், இது கொடுக்கப்பட்ட டைல்செட்டைப் பயன்படுத்தி டைல்மேப்பை அறிவிக்க அனுமதிக்கிறது, கொடுக்கப்பட்ட ஓடு அடையாளங்காட்டிகள் இன்னொன்றால் மாற்றப்பட வேண்டும்.
tr: TileSet bir *karo vekilleri* sistemine sahiptir. Karo vekilleri, belirli bir karo tanımlayıcı kümesinin bir başkasıyla değiştirilmesi gerektiğini, belirli bir TileSet kullanarak TileMap'e bildirmeyi sağlayan bir eşleme tablosudur.
uk: TileSet має систему *плиткових проксі*. Проксі плитки — це таблиця відображення, яка дозволяє сповіщати TileMap за допомогою заданого TileSet про те, що заданий набір ідентифікаторів плитки слід замінити іншим.
zh_tw: TileSet 有*圖塊代理*系統。圖塊代理是一個對應表，用來通知 TileMap（使用該 TileSet）將指定的一組圖塊識別碼替換為另一組。
