Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: If relying on automatic tiles creation (like we're about to do here), you must set the tile size **before** creating the *atlas*. The atlas will determine which tiles from the tilesheet can be added to a TileMapLayer node (as not every part of the image may be a valid tile).
fr: Si vous comptez sur la création automatique de tuiles (comme nous sommes sur le point de le faire ici), vous devez définir la taille de tuile **avant** créer l'*atlas*. L'atlas déterminera quelles tuiles de la feuille de tuile peuvent être ajoutées à un nœud de TileMap (car chaque partie de l'image ne peut pas forcément être une tuile valide).
it: Se ci si affida sulla creazione automatica dei tasselli (come stiamo per fare qui), è necessario impostare la dimensione dei tasselli **prima** di creare l'*atlante*. L'atlante determinerà quali tasselli del tilesheet è possibile aggiungere a un nodo TileMapLayer (poiché non tutte le parti dell'immagine potrebbero essere tasselli validi).
pt_br: Se estiver contando com a criação automática de tiles (como faremos aqui), você deve definir o tamanho do bloco **antes** de criar o *atlas*. O atlas determinará quais blocos da planilha de blocos podem ser adicionados a um nó TileMapLayer (já que nem todas as partes da imagem podem ser tiles válidos).
ru: Если вы полагаетесь на автоматическое создание тайлов (как мы и собираемся сделать), вы должны задать размер тайла **до** создания *атласа*. Атлас определит, какие тайлы из tilesheet могут быть добавлены в узел TileMapLayer (так как не каждая часть изображения может быть допустимым тайлом).
ta: தானியங்கி ஓடுகள் உருவாக்கத்தை நம்பினால் (நாங்கள் இங்கே செய்யப்போவது போல), ** ** க்கு முன் ஓடு அளவை ** அமைக்க வேண்டும் ***அட்லசை*உருவாக்க வேண்டும். டில்சீட்டில் இருந்து எந்த ஓடுகளை ஒரு டைல்மாபிளேயர் முனையில் சேர்க்க முடியும் என்பதை அட்லச் தீர்மானிக்கும் (படத்தின் ஒவ்வொரு பகுதியும் செல்லுபடியாகும் ஓடு அல்ல).
uk: Якщо ви покладаєтеся на автоматичне створення плиток (як ми збираємося зробити тут), ви повинні встановити розмір плитки **перед** створенням *атласу*. Атлас визначить, які плитки з аркуша плиток можна додати до вузла TileMapLayer (оскільки не кожна частина зображення може бути дійсною плиткою).
zh_tw: 如果要使用自動建立圖塊（如本教學範例）， *必須先* 設定圖塊大小，然後再建立 *圖塊集（atlas）* 。圖塊集會根據設定的大小，決定哪些區塊能加入 TileMapLayer（並非圖片每個區塊都會生成圖塊）。

source: Open the **TileSet** panel at the bottom of the editor, then click and drag the tilesheet image onto the panel. You will be asked whether to create tiles automatically. Answer **Yes**:
es: Abra el panel **TileSet** en la parte inferior del editor, luego haga clic y arrastre la imagen del tilesheet en el panel. Te preguntará si quieres crear tiles automáticamente. Responde **Sí**:
fr: Ouvrez le panneau **TileSet** en bas de l'éditeur, puis cliquez et faites glisser l'image de la feuille de tuiles sur le panneau. On vous demandera si vous souhaitez créer des tuiles automatiquement. Répondez **Oui** :
ga: Oscail an painéil**TileSet** ag bun an eagarthóra, ansin cliceáil agus tarraing íomhá an bileog tíl chuig an bpainéal. Fiafrfar ort an gcruthóidh tú tíleanna go huathoibríoch. Freagra**Sea**:
it: Apri il pannello **TileSet** nella parte inferiore dell'editor, quindi clicca e trascina l'immagine del tilesheet sul pannello. Ti verrà chiesto se desideri creare automaticamente i tasselli. Rispondi **Sì**:
ja: エディタ下部の **TileSet** パネルを開き、タイルシート画像をパネルにクリック＆ドラッグしてください。タイルを自動で作成するかを聞かれるので、 **Yes** と答えてください:
pt_br: Abra o painel **TileSet** na parte inferior do editor e clique e arraste a imagem do tilesheet para o painel. Será perguntado se você deseja criar tiles automaticamente. Resposta **Sim**:
ru: Откройте панель **TileSet** в нижней части редактора, затем щелкните и перетащите изображение tilesheet на панель. Вам будет предложено создать тайлы автоматически. Ответьте **Да**:
ta: எடிட்டரின் அடிப்பகுதியில் ** டைல்செட் ** பேனலைத் திறந்து, டில்சீட் படத்தை சொடுக்கு செய்து பேனலில் இழுக்கவும். ஓடுகளை தானாக உருவாக்கலாமா என்று கேட்கப்படும். பதில் ** ஆம் **:
tr: Düzenleyicinin altındaki **TileSet** panelini açın, ardından karo kağıdı görüntüsüne tıklayın ve panele sürükleyin. Karoların otomatik olarak oluşturulup oluşturulmayacağı sorulacaktır. **Evet** cevabını verin:
uk: Відкрийте панель **TileSet** у нижній частині редактора, потім клацніть і перетягніть зображення мозаїчного листа на панель. Вас запитають, чи створювати плитки автоматично. Відповідь **Так**:
zh_tw: 打開編輯器下方的 **TileSet** 面板，將圖塊表圖像直接拖曳到面板上。系統會詢問是否自動建立圖塊，請選擇 **是**：

source: Automatically creating tiles based on tilesheet image content
es: Creación automática de tiles basados en el contenido de la imagen de la hoja de tiles
fr: Création automatique de tuiles basé sur le contenu de l'image de la feuille de tuiles
ga: Tíleanna a chruthú go huathoibríoch bunaithe ar ábhair íomhá bileog
it: Creazione automatica di tasselli in base al contenuto dell'immagine del tilesheet
ja: タイルシート画像の内容を基にタイルが自動作成される
pt_br: Criando tiles automaticamente com base no conteúdo da imagem do tilesheet
ru: Автоматическое создание тайлов на основе содержимого изображения tilesheet
ta: டில்சீட் பட உள்ளடக்கத்தின் அடிப்படையில் தானாக ஓடுகளை உருவாக்குகிறது
tr: Karo kağıdı görüntü içeriğine göre otomatik olarak karo oluşturma
uk: Автоматичне створення плиток на основі вмісту зображення листів
zh_tw: 依據圖塊表圖像內容自動建立圖塊

source: This will automatically create tiles according to the tile size you specified earlier in the TileSet resource. This greatly speeds up initial tile setup.
es: Esto creará tiles automáticamente de acuerdo con el tamaño del tile que especificó anteriormente en el recurso TileSet. Esto acelera enormemente la configuración inicial de los tiles.
fr: Cela créera automatiquement des tuiles selon la taille de tuile que vous avez spécifiée plus tôt dans la ressource TileSet. Cela accélère grandement la configuration initiale des tuiles.
ga: Cruthóidh sé seo tíleanna go huathoibríoch de réir mhéid na tíl a shonraigh tú níos luaithe san acmhainn TileSet. Luasghraíonn sé seo socrú tíl tosaigh go mór.
ja: これで先ほどタイルTileSetリソースで指定したタイルサイズに従って自動でタイルが作成されます。タイルの初期設定がこれで大きくスピードアップします。
pt_br: Isso criará automaticamente os tiles conforme o tamanho de tile que você especificou anteriormente no recurso TileSet. Isso acelera bastante a configuração inicial dos tiles.
ru: Это автоматически создаст тайлы в соответствии с его размером, который вы указали ранее в ресурсе TileSet. Это значительно ускоряет начальную настройку тайла.
ta: இது டைல்செட் வளத்தில் நீங்கள் முன்னர் குறிப்பிட்ட ஓடு அளவிற்கு ஏற்ப தானாகவே ஓடுகளை உருவாக்கும். இது ஆரம்ப ஓடு அமைப்பை பெரிதும் விரைவுபடுத்துகிறது.
tr: Bu, karoları TileSet kaynağında daha önce belirttiğiniz karo boyutuna göre otomatik olarak oluşturacaktır. Bu, ilk karo kurulumunu büyük ölçüde hızlandırır.
uk: Це автоматично створить плитки відповідно до розміру плитки, який ви вказали раніше в ресурсі TileSet. Це значно прискорює початкове налаштування плитки.
zh_tw: 這會根據你在 TileSet 資源指定的圖塊大小，自動建立所有圖塊，大大加快初期設定流程。

source: When using automatic tile generation based on image contents, parts of the tilesheet that are *fully* transparent will not have tiles generated.
es: Cuando se utiliza la generación automática de tiles basada en el contenido de la imagen, las partes de la hoja de tiles que son *totalmente* transparentes no generarán tiles.
fr: Lors de l'utilisation de la génération automatique de tuiles basé sur le contenu de l'image, les parties de la feuille de tuiles qui sont *complètement* transparentes n'auront pas de tuiles générées.
ga: Agus giniúint tíl uathoibríoch á n-úsáid bunaithe ar ábhar íomhá, ní ghintear tíleanna codanna den bhileog tíl atá *go hiomlán* trédhearcach.
ja: 画像の内容を基に自動タイル生成をする時、タイルシートの *完全に* 透明な部分ではタイル生成は行われません。
pt_br: Ao usar a geração automática de tiles com base no conteúdo da imagem, partes do tilesheet que forem *totalmente* transparentes não terão tiles gerados.
ru: При использовании автоматической генерации тайлов на основе содержимого изображения, для частей tileset`а, которые *полностью* прозрачны, тайлы не генерируются.
ta: பட உள்ளடக்கங்களின் அடிப்படையில் தானியங்கி ஓடு தலைமுறையைப் பயன்படுத்தும் போது, * முழுமையாக * வெளிப்படையான டைல்சீட்டின் பகுதிகள் ஓடுகளை உருவாக்காது.
tr: Görüntü içeriğine dayalı otomatik karo oluşturma kullanılırken, karo kağıdının *tamamen* saydam olan kısımlarından karo oluşturulmayacaktır.
uk: Якщо використовується автоматичне створення мозаїк на основі вмісту зображення, *повністю* прозорі частини мозаїки не матимуть згенерованих плиток.
zh_tw: 使用自動產生圖塊時，圖塊表中*完全*透明的區域將不會建立圖塊。

source: If there are tiles from the tilesheet you do not wish to be present in atlas, choose the Eraser tool at the top of the tileset preview, then click the tiles you wish to remove:
es: Si hay tiles de la hoja de tiles que no desea que estén presentes en el atlas, elija la herramienta Borrador en la parte superior de la vista previa del tileset y luego haga clic en los tiles que desea eliminar:
fr: Si vous ne souhaitez pas que certaines tuiles de la feuille de tuiles soient présentes dans l'atlas, sélectionnez l'outil Gomme en haut de l'aperçu de l'ensemble de tuiles, puis cliquez sur les tuiles que vous souhaitez supprimer :
ga: Má tá tíleanna ón mbileog tíl nach mian leat a bheith i láthair in atlas, roghnaigh an uirlis Eraser ag barr an réamhamharc tíleanna, ansin cliceáil ar na tíleanna is mian leat a bhaint:
ja: タイルシートにアトラスに存在させたくないタイルがある場合、タイルセットプレビューの上部にある消しゴムツールを選択し、削除したいタイルをクリックします:
pt_br: Se houver tiles do tilesheet que você não deseja que estejam presentes no atlas, selecione a ferramenta Borracha (Eraser) na parte superior da visualização do tileset e clique nos tiles que deseja remover:
ru: Если в атласе есть тайлы из tilesheet, которые вы не хотите видеть в атласе, выберите инструмент «Ластик» в верхней части предварительного просмотра набора тайлов, затем щелкните тайлы, которые вы хотите удалить:
ta: நீங்கள் அட்லாசில் இருக்க விரும்பாத டில்சீட்டிலிருந்து ஓடுகள் இருந்தால், டைல்செட் முன்னோட்டத்தின் மேலே உள்ள அழிப்பான் கருவியைத் தேர்வுசெய்து, நீங்கள் அகற்ற விரும்பும் ஓடுகளைக் சொடுக்கு செய்க:
tr: karo kağıdından atlasta bulunmasını istemediğiniz karolar varsa, karo seti önizlemesinin üst kısmındaki Silgi aracını seçin, ardından kaldırmak istediğiniz karolara tıklayın:
uk: Якщо є плитки з аркуша, які ви не бажаєте відображати в атласі, виберіть інструмент «Гумка» у верхній частині попереднього перегляду набору плиток, а потім клацніть плитки, які потрібно видалити:
zh_tw: 如果有不希望出現在圖塊集中的圖塊，可以在圖塊預覽區上方選擇橡皮擦工具，點擊欲刪除的圖塊：

source: Using the Eraser tool to remove unwanted tiles from the TileSet atlas
es: Uso de la herramienta Borrador para eliminar tiles no deseados del atlas TileSet
fr: Utiliser l'outil Gomme afin de supprimer les tuiles indésirables de l'atlas du TileSet
ga: Ag baint úsáide as an uirlis Eraser chun tíleanna nach dteastaíonn a bhaint as atlas TileSet
ja: 消しゴムツールを使い不要なタイルをタイルセットアトラスから除去
pt_br: Usando a ferramenta Borracha para remover tiles indesejados do atlas do TileSet
ru: Использование инструмента «Ластик» для удаления ненужных тайлов из атласа TileSet
ta: டைல்செட் அட்லசிலிருந்து தேவையற்ற ஓடுகளை அகற்ற அழிப்பான் கருவியைப் பயன்படுத்துதல்
tr: TileSet atlasından istenmeyen karoları kaldırmak için Silgi aracını kullanma
uk: Використання інструменту «Гумка» для видалення непотрібних плиток з атласу TileSet
zh_tw: 用橡皮擦工具從 TileSet 合集中移除不需要的圖塊

source: You can also right-click a tile and choose **Delete**, as an alternative to the Eraser tool.
es: También puede hacer clic derecho en un tile y elegir **Eliminar**, como alternativa a la herramienta Borrador.
fr: Vous pouvez également faire un clic droit sur une tuile et choisir **Delete**, comme alternative à l'outil Gomme.
ga: Is féidir leat cliceáil ar chliceáil ar tíl agus **Scrios** a roghnú, mar mhalairt ar an uirlis Eraser.
ja: タイルを右クリックして **削除** を選択することも、消しゴムツールの代わりになります。
pt_br: Você também pode clicar com o botão direito em um tile e escolher **Delete**, como alternativa à ferramenta Borracha.
ru: Вы также можете щелкнуть правой кнопкой мыши по тайлу и выбрать **Удалить** в качестве альтернативы инструменту «Ластик».
ta: அழிப்பான் கருவிக்கு மாற்றாக நீங்கள் ஒரு ஓடு வலது சொடுக்கு செய்து ** நீக்கு ** ஐத் தேர்வுசெய்யலாம்.
tr: Silgi aracına alternatif olarak bir kutucuğa sağ tıklayıp **Sil** seçeneğini de seçebilirsiniz.
uk: Ви також можете клацнути плитку правою кнопкою миші та вибрати **Видалити** як альтернативу інструменту «Гумка».
zh_tw: 也可以直接按右鍵選擇 **刪除** 來移除圖塊，無需使用橡皮擦工具。

source: Like in the 2D and TileMap editors, you can pan across the TileSet panel using the middle or right mouse buttons, and zoom using the mouse wheel or buttons in the top-left corner.
es: Al igual que en los editores 2D y TileMap, puedes desplazarte por el panel TileSet usando los botones del medio o derecho del ratón, y hacer zoom con la rueda del ratón o los botones de la esquina superior izquierda.
fr: Comme dans les éditeurs 2D et TileMap, vous pouvez faire défiler le panneau TileSet en utilisant le bouton central ou droit de la souris, et zoomer en utilisant la molette de la souris ou les boutons situés dans le coin supérieur gauche.
ga: Cosúil leis na heagarthóirí 2D agus TileMap, is féidir leat sábháil thar an bpainéal TileSet ag baint úsáide as na cnaipí luiche lár nó ar dheis, agus zúmáil ag baint úsáide as roth luiche nó cnaipí sa chúinne barr ar chlé.
ja: 2DエディターやTileMapエディターと同様に、マウスの中ボタンや右ボタンでTileSetパネルをパンしたり、マウスホイールや左上のボタンでズームすることができます。
pt_br: Assim como nos editores 2D e TileMap, você pode percorrer o painel do TileSet usando os botões do meio ou direito do mouse, e aplicar zoom usando a roda do mouse ou os botões no canto superior esquerdo.
ru: Как и в редакторах 2D и TileMap, вы можете перемещаться по панели TileSet с помощью средней или правой кнопки мыши, а также масштабировать с помощью колесика мыши или кнопок в верхнем левом углу.
ta: 2 டி மற்றும் டில்மேப் எடிட்டர்களைப் போலவே, நீங்கள் நடுத்தர அல்லது வலது மவுச் பொத்தான்களைப் பயன்படுத்தி டைல்செட் பேனல் முழுவதும் பான் செய்யலாம், மேலும் மேல்-இடது மூலையில் உள்ள சுட்டி சக்கரம் அல்லது பொத்தான்களைப் பயன்படுத்தி பெரிதாக்கலாம்.
tr: 2B ve TileMap düzenleyicilerinde olduğu gibi, orta veya sağ fare düğmelerini kullanarak TileSet panelinde kaydırma yapabilir ve fare tekerleğini veya sol üst köşedeki düğmeleri kullanarak yakınlaştırma yapabilirsiniz.
uk: Як і в редакторах 2D і TileMap, ви можете переміщатися по панелі TileSet за допомогою середньої або правої кнопки миші та масштабувати за допомогою коліщатка миші або кнопок у верхньому лівому куті.
zh_tw: 和 2D 及 TileMap 編輯器一樣，可以用滑鼠中鍵或右鍵平移 TileSet 面板，用滑鼠滾輪或左上角按鈕縮放預覽。

source: If you wish to source tiles from several tilesheet images for a single TileSet, create additional atlases and assign textures to each of them before continuing. It is also possible to use one image per tile this way (although using tilesheets is recommended for better usability).
es: Si desea obtener tiles de varias imágenes de hojas de tiles para un único TileSet, cree atlas adicionales y asigne texturas a cada uno de ellos antes de continuar. También es posible usar una imagen por tile de esta manera (aunque se recomienda usar hojas de tiles para una mejor usabilidad).
fr: Si vous souhaitez obtenir des tuiles à partir de plusieurs images de feuilles de tuiles pour un seul TileSet, créez des atlas supplémentaires et attribuez des textures à chacun d'eux avant de continuer. Il est également possible d'utiliser une image par tuile de cette manière (bien que l'utilisation de feuilles de tuiles soit recommandée pour une meilleure productivité).
ga: Más mian leat tíleanna a fhoinsiú ó roinnt íomhánna bileog tíleanna le haghaidh TeileSet amháin, cruthaigh atlasanna breise agus sannadh uigeachtaí do gach ceann acu sula leanann tú ar aghaidh. Is féidir íomhá amháin in aghaidh an tíl a úsáid freisin ar an mbealach seo (cé go moltar bileoga tíl a úsáid le haghaidh úsáidteacht níos fearr).
ja: 1つのタイルセットに複数のタイルシート画像からタイルを供給したい場合は、続ける前に、追加のアトラスを作成してそれぞれにテクスチャを割り当ててください。この方法でタイルごとに1つの画像を使用することも可能です(ただし、より使いやすくするためにタイルシートを使用することをお勧めします)。
pt_br: Se você quiser usar tiles de várias imagens de tilesheet em um único TileSet, crie atlas adicionais e atribua texturas a cada um deles antes de continuar. Também é possível usar uma imagem por tile dessa forma (embora o uso de tilesheets seja recomendado para melhor usabilidade).
ru: Если вы хотите получить тайлы из нескольких tilesheet для одного TileSet, создайте дополнительные атласы и назначьте текстуры каждому из них, прежде чем продолжить. Также можно использовать одно изображение на тайл таким образом (хотя использование tilesheet рекомендуется).
ta: ஒற்றை டைல்செட்டுக்கு பல டில்சீட் படங்களிலிருந்து ஓடுகளை மூலமாக வழங்க விரும்பினால், கூடுதல் அட்லச்களை உருவாக்கி, தொடர்வதற்கு முன் அவை ஒவ்வொன்றிற்கும் அமைப்புகளை ஒதுக்கவும். இந்த வழியில் ஒரு ஓடு ஒரு படத்தைப் பயன்படுத்தவும் முடியும் (சிறந்த பயன்பாட்டினுக்காக டைல்சீட்களைப் பயன்படுத்துவது பரிந்துரைக்கப்படுகிறது என்றாலும்).
tr: Tek bir karo seti için birkaç karo kağıdı görüntüsünden karo almak istiyorsanız, devam etmeden önce ek atlaslar oluşturun ve her birine doku atayın. Bu şekilde karo başına tek bir görüntü kullanmak da mümkündür (ancak daha iyi kullanılabilirlik için karo kağıtlarının kullanılması önerilir).
uk: Якщо ви бажаєте отримати плитки з кількох зображень аркушів для одного TileSet, створіть додаткові атласи та призначте текстури кожному з них, перш ніж продовжити. Таким чином також можна використовувати одне зображення на плитку (хоча для кращої зручності використання рекомендується використовувати листи плиток).
zh_tw: 若要將多張圖塊表中的圖塊納入同一個 TileSet，請先建立多個圖塊集（atlas）並分別指定材質。雖然也能每個圖塊都用獨立圖檔，但建議還是使用圖塊表以方便管理。

source: You can adjust properties for the atlas in the middle column:
es: Puede ajustar las propiedades del atlas en la columna del medio:
fr: Vous pouvez ajuster les propriétés de l'atlas dans la colonne centrale :
ga: Is féidir leat airíonna a choigeartú don atlas sa lár colún:
ja: 中央の列でアトラスのプロパティを調整できます:
pt_br: Você pode ajustar as propriedades do atlas na coluna do meio:
ru: В средней колонке можно настроить свойства атласа:
ta: நடுத்தர நெடுவரிசையில் அட்லாசிற்கான பண்புகளை நீங்கள் சரிசெய்யலாம்:
tr: Atlas için özellikleri orta sütunda ayarlayabilirsiniz:
uk: Ви можете налаштувати властивості для атласу в середньому стовпці:
zh_tw: 你可以在中間欄位調整圖塊集（atlas）的屬性：

source: Adjusting TileSet atlas properties in the dedicated inspector (part of the TileSet panel)
es: Ajustar las propiedades del atlas de TileSet en el inspector dedicado (parte del panel TileSet)
fr: Ajuster les propriétés de l'atlas du TileSet dans l'inspecteur dédié (qui fait partie du panneau TileSet)
ga: Airíonna atlas TileSet a choigeartú sa chigire tiomnaithe (cuid den phainéal TileSet)
ja: 専用インスペクタ(TileSetパネルの一部)でTileSetアトラスのプロパティを調整
pt_br: Ajustando as propriedades do atlas TileSet no Inspetor dedicado (parte do painel TileSet)
ru: Настройка свойств атласа TileSet в специальном инспекторе (часть панели TileSet)
ta: அர்ப்பணிப்பு ஆய்வாளரில் (டைல்செட் பேனலின் ஒரு பகுதி) டில்செட் அட்லச் பண்புகளை சரிசெய்தல்
tr: Adanmış denetleyicide (TileSet panelinin bir parçası) TileSet atlas özelliklerini ayarlama
uk: Налаштування властивостей атласу TileSet у спеціальному інспекторі (частина панелі TileSet)
zh_tw: 在 TileSet 面板的專屬屬性面板調整圖塊集屬性

source: The following properties can be adjusted on the atlas:
es: Las siguientes propiedades pueden ajustarse en el atlas:
fr: Les propriétés suivantes peuvent être définies sur l'atlas :
ga: Is féidir na hairíonna seo a leanas a choigeartú ar an atlas:
it: Le seguenti proprietà si possono modificare sull'atlante:
ja: アトラスには以下のプロパティを設定できます:
pt_br: As seguintes propriedades podem ser ajustadas no atlas:
ru: В атласе можно настроить следующие свойства:
ta: பின்வரும் பண்புகளை அட்லசில் சரிசெய்யலாம்:
tr: Atlas üzerinde aşağıdaki özellikler ayarlanabilir:
uk: На атласі можна налаштувати такі властивості:
zh_tw: 圖塊集支援下列屬性調整：

source: **ID:** The identifier (unique within this TileSet), used for sorting.
es: **ID:** El identificador (único dentro de este TileSet), utilizado para ordenar.
fr: **ID :** L'identifiant (unique dans ce TileSet), utilisé pour le tri.
ga: **ID: ** An t-aitheantóir (uathúil laistigh den TileSet seo), a úsáidtear chun sórtáil.
ja: **ID:** 識別子(タイルセットの中でユニークな値)、ソートに使われます。
pt_br: **ID:** O identificador (único dentro deste TileSet), usado para ordenação.
ru: **ID:** Идентификатор (уникальный в пределах данного TileSet), используемый для сортировки.
ta: ** ஐடி: ** அடையாளங்காட்டி (இந்த டைல்செட்டுக்குள் தனித்துவமானது), வரிசையாக்கப் பயன்படுகிறது.
tr: **ID:** Sıralama için kullanılan tanımlayıcı (bu TileSet içinde benzersiz).
uk: **ID:** Ідентифікатор (унікальний у межах цього TileSet), який використовується для сортування.
zh_tw: **ID：** 此圖塊集內唯一的識別碼，用於排序。

source: **Name:** The human-readable name for the atlas. Use a descriptive name here for organizational purposes (such as "terrain", "decoration", etc).
es: **Nombre:** El nombre humanamente legible del atlas. Utilice aquí un nombre descriptivo con fines organizativos (como "terreno", "decoración", etc.).
fr: **Nom :** Le nom facilement lisible pour l'atlas. Utilisez un nom descriptif ici à des fins organisationnelles (comme "terrain", "décoration", etc.).
ga: **Ainm: ** An t-ainm inléite don duine don atlas. Úsáid ainm tuairisciúil anseo chun críocha eagraíochtúla (mar shampla “tír-raon”, “maisiú”, srl).
ja: **名前** アトラスの人間が判読可能な名前。整理のため、説明的な名前を使ってください(例えば "terrain" (地形)、 "decoration"(装飾) などのような)。
pt_br: **Nome:** O nome legível para o atlas. Use um nome descritivo aqui para fins de organização (como "terreno", "decoração", etc).
ru: **Name:** Удобочитаемое имя атласа. Используйте здесь описательное имя для организационных целей (например, «рельеф», «украшение» и т. д.).
ta: ** பெயர்: ** அட்லசுக்கு மனிதனால் படிக்கக்கூடிய பெயர். நிறுவன நோக்கங்களுக்காக ("நிலப்பரப்பு", "ஒப்பனை" போன்றவை) இங்கே ஒரு விளக்கமான பெயரைப் பயன்படுத்தவும்.
tr: **İsim:** Atlas için insan-tarafından okunabilir isim. Düzensel amaçlar için burada açıklayıcı bir isim kullanın ("arazi", "dekorasyon", vb. gibi).
uk: **Назва:** зрозуміла для людини назва атласу. Використовуйте тут описову назву для організаційних цілей (наприклад, «рельєф», «прикраса» тощо).
zh_tw: **名稱：** 圖塊集的自訂名稱，建議用於描述用途（例：地形、裝飾等）。
