Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: Using TileSets
es: Usando TileSets
fr: Utilisation des jeux de tuiles
ga: Ag baint úsáide as TileSets
it: Utilizzo di TileSet
ja: タイルセットの使用
ko: 타일셋 사용하기
ru: TileSets (Тайловые наборы)
ta: டைல்செட்டுகளைப் பயன்படுத்துதல்
tr: Karo Setlerini Kullanma
uk: Використання TileSets
zh_tw: 使用圖塊集

source: Introduction
es: Introducción
ga: Réamhrá
it: Introduzione
ja: はじめに
ko: 소개
pt_br: Introdução
ru: Введение
ta: அறிமுகம்
tr: Giriş
uk: Вступ
zh_tw: 前言

source: A tilemap is a grid of tiles used to create a game's layout. There are several benefits to using :ref:`TileMapLayer <class_TileMapLayer>` nodes to design your levels. First, they let you draw a layout by "painting" tiles onto a grid, which is much faster than placing individual :ref:`Sprite2D <class_Sprite2D>` nodes one by one. Second, they allow for larger levels because they are optimized for drawing large numbers of tiles. Finally, they allow you to add greater functionality to your tiles with collision, occlusion, and navigation shapes.
fr: Une tilemap (littéralement une "carte de tuile") est une grille utilisée pour créer la disposition/le fond graphique d'un jeu. Il y a plusieurs avantages à utiliser le nœud :ref:`TileMapLayer <class_TileMapLayer>` pour concevoir vos niveaux. Premièrement, cela rend possible de dessiner le layout(disposition) en "peignant" les tuiles sur la grille, ce qui est beaucoup plus rapide que de placer individuellement chacune des tuiles à l'aide de nœuds :ref:`Sprite2D <class_Sprite2D>` un par un. Deuxièmement, les tuiles permettent d'avoir des niveaux bien plus grands car elles sont optimisées pour être dessinés en grand nombre. Finalement, elle permettent d'ajouter des fonctionnalités supplémentaires, comme des collisions, des occlusions, et des formes de navigations.
ru: Tilemap - это сетка из тайлов, используемая для создания игрового макета. Использование :ref:`TileMapLayer <class_TileMapLayer>` для проектирования уровней имеет несколько преимуществ. Во-первых, они позволяют вам нарисовать макет, "рисуя" тайлы на сетке, что намного быстрее, чем размещать отдельные :ref:`Sprite2D <class_Sprite2D>` один за другим. Во-вторых, они позволяют создавать большие уровни, поскольку оптимизированы для рисования большого количества тайлов. И, наконец, они позволяют расширить функциональность ваших тайлов с помощью collision, occlusion и navigation shape.
ta: ஒரு டிலேமேப் என்பது ஒரு விளையாட்டின் தளவமைப்பை உருவாக்க பயன்படுத்தப்படும் ஓடுகளின் கட்டம். பயன்படுத்துவதற்கு பல நன்மைகள் உள்ளன: Ref: `tilemaplayer <class_tilemaplayer> your உங்கள் நிலைகளை வடிவமைக்க முனைகள். முதலாவதாக, "ஓவியம்" ஓடுகளை ஒரு கட்டத்தில் ஒரு தளவமைப்பை வரைய அனுமதிக்கிறார்கள், இது தனிநபரை வைப்பதை விட மிக வேகமாக உள்ளது: ref: `Sprite2d <class_sprite2d>` முனைகள் ஒவ்வொன்றாக. இரண்டாவதாக, அவை பெரிய நிலைகளை அனுமதிக்கின்றன, ஏனெனில் அவை அதிக எண்ணிக்கையிலான ஓடுகளை வரைவதற்கு உகந்ததாக உள்ளன. இறுதியாக, மோதல், மறைவு மற்றும் வழிசெலுத்தல் வடிவங்களுடன் உங்கள் ஓடுகளுக்கு அதிக செயல்பாட்டைச் சேர்க்க அவை உங்களை அனுமதிக்கின்றன.
uk: Tilemap — це сітка плиток, яка використовується для створення макета гри. Є кілька переваг використання вузлів :ref:`TileMapLayer <class_TileMapLayer>` для розробки ваших рівнів. По-перше, вони дозволяють малювати макет, «розмальовуючи» плитки на сітці, що набагато швидше, ніж розміщувати окремі вузли :ref:`Sprite2D <class_Sprite2D>` по одному. По-друге, вони дозволяють більші рівні, оскільки вони оптимізовані для малювання великої кількості плиток. Нарешті, вони дозволяють додати більше функціональних можливостей плиткам за допомогою фігур зіткнення, оклюзії та навігації.
zh_tw: 圖塊地圖 (TileMap) 是一種以圖塊為單位的網格，用來製作遊戲場景。使用 :ref:`TileMapLayer <class_TileMapLayer>` 節點設計關卡有幾個優點。首先，你可以直接在網格上「塗畫」圖塊，比起一個一個放置 :ref:`Sprite2D <class_Sprite2D>` 節點效率高很多。其次，圖塊地圖針對大量圖塊繪製做過最佳化，可用於更大規模的場景。最後，你還可以為圖塊加上碰撞、遮蔽與導覽等功能。

source: To use TileMapLayer nodes, you will need to create a TileSet first. A TileSet is a collection of tiles that can be placed in a TileMapLayer node. After creating a TileSet, you will be able to place them :ref:`using the TileMap editor <doc_using_tilemaps>`.
pt_br: Para usar nós TileMapLayer, você precisará criar primeiro um TileSet. Um TileSet é uma coleção de tiles que podem ser colocados em um nó TileMapLayer. Após criar um TileSet, você poderá posicioná-los :ref:`usando o editor de TileMap <doc_using_tilemaps>`.
ru: Чтобы использовать узлы TileMapLayer, вам сначала нужно создать TileSet. TileSet — это коллекция тайлов, которые можно разместить в узле TileMapLayer. После создания TileSet вы сможете разместить их :ref:`используя редактор TileMap <doc_using_tilemaps>`.
ta: டைல்மாபிளேயர் முனைகளைப் பயன்படுத்த, நீங்கள் முதலில் ஒரு டைல்செட்டை உருவாக்க வேண்டும். ஒரு டைல்செட் என்பது டைல்களின் தொகுப்பாகும், இது ஒரு டில்மாபிளேயர் முனையில் வைக்கப்படலாம். ஒரு டைல்செட்டை உருவாக்கிய பிறகு, நீங்கள் அவற்றை வைக்க முடியும்: குறிப்பு: `டில்மேப் எடிட்டரைப் பயன்படுத்துதல் <doc_using_tilemaps>`.
uk: Щоб використовувати вузли TileMapLayer, вам потрібно спочатку створити TileSet. TileSet — це набір плиток, які можна розмістити у вузлі TileMapLayer. Після створення TileSet ви зможете розмістити їх :ref:`за допомогою редактора TileMap <doc_using_tilemaps>`.
zh_tw: 要使用 TileMapLayer 節點，你需要先建立一個 TileSet。 一組 TileSet 是可以放在 TileMapLayer 節點上的圖塊集合。建立 TileSet 後，你就可以透過 :ref:`TileMap 編輯器 <doc_using_tilemaps>` 來使用它們。

source: To follow this guide, you will need an image containing your tiles where every tile has the same size (large objects can be split into several tiles). This image is called a *tilesheet*. Tiles do not have to be square: they can be rectangular, hexagonal, or isometric (pseudo-3D perspective).
es: Para seguir esta guía, necesitará una imagen que contenga sus tiles donde cada tile tenga el mismo tamaño (los objetos grandes se pueden dividir en varios tiles). Esta imagen se llama *hoja de tiles*. Los tiles no tienen por qué ser cuadrados: pueden ser rectangulares, hexagonales o isométricos (perspectiva pseudo-3D).
fr: Pour suivre ce guide, vous aurez besoin d'une image contenant vos tuiles où chaque tuile a la même taille (les grands objets peuvent être divisés en plusieurs tuiles). Cette image s'appelle une *feuille de tuiles*. Les tuiles ne doivent pas forcément être carrées : elles peuvent être rectangulaires, hexagonales ou isométriques (perspective pseudo-3D).
ga: Chun an treoir seo a leanúint, beidh íomhá ag teastáil uait ina bhfuil do tíleanna ina bhfuil an méid céanna ag gach tíl (is féidir rudaí móra a roinnt ina roinnt tíleanna). Tugtar bileog tílea* ar an íomhá seo. Ní gá go mbeadh tíleanna cearnach: is féidir leo a bheith dronuilleogach, heicseagánach nó isméadrach (peirspictíocht bréag-3D).
ja: このガイドでは、すべてのタイルが同じサイズ(大きなオブジェクトは複数のタイルに分割できます)になっているタイルが描かれた画像が必要になります。このような画像は *tilesheet* と呼ばれます。タイルは必ずしも正方形である必要はありません: 長方形や六角形、あるいはアイソメトリック(疑似3Dパース)も可能です。
pt_br: Para seguir este guia, você precisará de uma imagem contendo seus tiles, onde cada tile tenha o mesmo tamanho (objetos grandes podem ser divididos em vários tiles). Essa imagem é chamada de *tilesheet*. Os tiles não precisam ser quadrados: eles podem ser retangulares, hexagonais ou isométricos (perspectiva pseudo-3D).
ru: Чтобы следовать этому руководству, вам понадобится изображение, содержащее ваши тайлы, где каждый тайл имеет одинаковый размер (большие объекты можно разделить на несколько тайлов). Это изображение называется *tilesheet*. Тайлы не обязательно должны быть квадратными: они могут быть прямоугольными, шестиугольными или изометрическими (псевдо-3D перспектива).
ta: இந்த வழிகாட்டியைப் பின்பற்ற, ஒவ்வொரு ஓடுக்கும் ஒரே அளவு இருக்கும் உங்கள் ஓடுகளைக் கொண்ட ஒரு படம் உங்களுக்குத் தேவைப்படும் (பெரிய பொருள்களை பல ஓடுகளாகப் பிரிக்கலாம்). இந்த படம் ஒரு *டில்சீட் *என்று அழைக்கப்படுகிறது. ஓடுகள் சதுரமாக இருக்க வேண்டியதில்லை: அவை செவ்வக, அறுகோண அல்லது ஐசோமெட்ரிக் (போலி -3 டி முன்னோக்கு) ஆக இருக்கலாம்.
tr: Bu kılavuzu takip etmek için, her karonun aynı boyutta olduğu karolarınızı içeren bir görüntüye ihtiyacınız olacaktır (büyük nesneler birkaç karoya bölünebilir). Bu görüntüye *karo kağıdı/tilesheet* adı verilir. Karoların kare olması gerekmez: dikdörtgen, altıgen veya izometrik (sözde-3B perspektif) olabilirler.
uk: Щоб дотримуватися цього посібника, вам знадобиться зображення, яке містить ваші плитки, де кожна плитка має однаковий розмір (великі об’єкти можна розділити на кілька плиток). Це зображення називається *плитка*. Плитки не обов’язково мають бути квадратними: вони можуть бути прямокутними, шестикутними або ізометричними (псевдо-3D перспектива).
zh_tw: 依照本教學操作時，你需要準備一張包含多個圖塊、且每個圖塊大小相同的圖片（大型物件可以切分成多個圖塊）。這種圖片稱作 *圖塊表* （tilesheet）。圖塊不一定要是正方形，矩形、六角形，甚至等軸（類 3D 視角）都可以。

source: Creating a new TileSet
es: Creando un nuevo Tileset
fr: Créer un nouveau jeu de tuiles
ga: TileSet nua a chruthú
it: Creare un nuovo TileSet
ja: 新規タイルセットの作成
ko: 새 타일셋 만들기
ru: Создание нового TileSet
ta: புதிய டைல்செட்டை உருவாக்குதல்
tr: Yeni bir TileSet oluşturma
uk: Створення нового TileSet
zh_tw: 建立 TileSet

source: Using a tilesheet
es: Usando un tilesheet
fr: Utiliser une feuille de tuiles
ga: Ag baint úsáide as bileog bileoga
it: Utilizzare un tilesheet
ja: タイルシートを使用する
ko: 타일시트 사용하기
ru: Tilesheet (страница тайлов)
ta: ஒரு டில்சீட்டைப் பயன்படுத்துதல்
tr: Karo kağıdı kullanma
uk: Використання плиткового листа
zh_tw: 使用圖塊表

source: This demonstration will use the following tiles taken from `Kenney's "Abstract Platformer" pack <https://kenney.nl/assets/abstract-platformer>`__. We'll use this particular *tilesheet* from the set:
es: En esta demostración usaremos los siguientes tiles tomados del paquete de arte `"Abstract Platformer" de Kenney <https://kenney.nl/assets/abstract-platformer>`__. Utilizaremos este "*tilesheet*" del set:
fr: Cette démonstration utilisera les tuiles suivantes tirées du pack « Abstract Platformer » de Kenney <https://kenney.nl/assets/abstract-platformer>`__. Nous utiliserons cette *feuille de tuiles* particulière de l'ensemble :
ga: Bainfidh an taispeántas seo úsáid as na tíleanna seo a leanas a tógadh ó phacáiste `Kenney's "Abstract Platformer" <https://kenney.nl/assets/abstract-platformer>`__. Úsáidfimid an *tílbhileog* áirithe seo ón tacar:
ja: このデモでは、Kenneyの "Abstract Platformer" アートパック <https://kenney.nl/assets/abstract-platformer>`__ から取得した以下のタイルを使用します。このセットから特にこの *タイルシート* を使います:
ru: В этой демонстрации будут использованы следующие названия, взятые из набора ` Kenney's "Abstract Platformer" <https://kenney.nl/assets/abstract-platformer>`__. Мы будем использовать именно этот *tilesheet* из набора:
ta: இந்த ஆர்ப்பாட்டம் `கென்னியின்" சுருக்க இயங்குதள "பேக்கிலிருந்து எடுக்கப்பட்ட பின்வரும் ஓடுகளைப் பயன்படுத்தும் <https://kenney.nl/assets/abstract-platformer> __. தொகுப்பிலிருந்து இந்த குறிப்பிட்ட * டில்சீட் * ஐப் பயன்படுத்துவோம்:
tr: Bu gösterimde, `Kenney'in "Abstract Platformer" paketinden <https://kenney.nl/assets/abstract-platformer>`__ alınan aşağıdaki karolar kullanılacaktır. Setten bu özel *karo kağıdını* kullanacağız (resmi sağ tıklayıp kaydedin):
uk: У цій демонстрації буде використано наступні плитки, взяті з `Kenney's "Abstract Platformer" pack <https://kenney.nl/assets/abstract-platformer>`__. Ми використаємо саме цей *таблицю* з набору:
zh_tw: 本教學使用來自 Kenney「Abstract Platformer」美術包的圖塊。完整資源包可於 `這裡 <https://kenney.nl/assets/abstract-platformer>`__ 取得，範例僅使用其中部分圖塊表。

source: Tilesheet example with 64×64 tiles
es: Hola de tiles con tiles de 64×64
ga: Sampla bileog tíleanna le tíleanna 64 × 64
it: Esempio di tilesheet con tasselli 64×64
ja: 64×64 タイルによるタイルシート例
pt_br: Exemplo de Tilesheet com blocos de 64×64
ru: Пример tilesheet с размерами 64×64
ta: 64 × 64 ஓடுகளுடன் டில்சீட் எடுத்துக்காட்டு
tr: 64×64 karo içeren karo kağıdı örneği
uk: Приклад аркуша з плитками 64×64
zh_tw: 64×64 圖塊表範例

source: Tilesheet with 64×64 tiles. Credit: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
es: Hola de tiles de 64×64. Crédito: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
fr: Feuille de tuiles avec des tuiles 64×64. Crédit : `Kenney <https://kenney.nl/assets/abstract-platformer>`__
ga: Bileoga tíl le 64×64 tíleanna. Creidmheas: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
it: Tilesheet con tasselli 64×64 . Credito: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
ja: 64×64 タイルによるタイルシート。引用: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
pt_br: Tilesheet com 64×64 tiles. Crédito: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
ru: Tilesheet размером 64×64. Авторство: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
ta: 64 × 64 ஓடுகளுடன் டில்சீட். கடன்: `கென்னி <https://kenney.nl/assets/abstract-platformer> ____ __ __
tr: 64×64 karolardan oluşan karo kağıdı. Kredi: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
uk: Лист плитки 64×64. Авторство: `Kenney <https://kenney.nl/assets/abstract-platformer>`__
zh_tw: 64×64 圖塊表。作者：`Kenney <https://kenney.nl/assets/abstract-platformer>`__

source: Create a new **TileMapLayer** node, then select it and create a new TileSet resource in the inspector:
fr: Créez un nouveau nœud **TileMapLayer**, puis sélectionnez le et créez une nouvelle ressource TileSet dans l'inspecteur :
it: Crea un nuovo nodo **TileMapLayer**, quindi selezionalo e crea una nuova risorsa TileSet nell'ispettore:
pt_br: Crie um novo nó **TileMapLayer**, selecione-o e crie um novo recurso TileSet no Inspetor:
ru: Создайте новый узел **TileMapLayer**, затем выберите его и создайте новый ресурс TileSet в инспекторе:
ta: ஒரு புதிய ** tilemaplayer ** முனையை உருவாக்கி, பின்னர் அதைத் தேர்ந்தெடுத்து இன்ச்பெக்டரில் புதிய டைல்செட் வளத்தை உருவாக்கவும்:
uk: Створіть новий вузол **TileMapLayer**, виберіть його та створіть новий ресурс TileSet в інспекторі:
zh_tw: 新增一個 **TileMapLayer** 節點，然後在屬性面板中建立新的 TileSet 資源：

source: Creating a new TileSet resource within the TileMapLayer node
fr: Créer une nouvelle ressource TileSet dans le nœud TileMapLayer
it: Creare una nuova risorsa TileSet all'interno del nodo TileMapLayer
ko: TileMapLayer 노드 안에 새 타일셋 리소스 만들기
ru: Создание новог TileSet ресурса в узле TileMapLayer
ta: டைல்மாபிளேயர் முனைக்குள் புதிய டைல்செட் வளத்தை உருவாக்குதல்
uk: Створення нового ресурсу TileSet у вузлі TileMapLayer
zh_tw: 在 TileMapLayer 節點內建立新的 TileSet 資源

source: After creating the TileSet resource, click the value to unfold it in the inspector. The default tile shape is Square, but you can also choose Isometric, Half-Offset Square or Hexagon (depending on the shape of your tile images). If using a tile shape other than Square, you may also need to adjust the **Tile Layout** and **Tile Offset Axis** properties. Lastly, enabling the **Rendering > UV Clipping** property may be useful if you wish tiles to be clipped by their tile coordinates. This ensures tiles cannot draw outside their allocated area on the tilesheet.
es: Después de crear el recurso TileSet, haga clic en el valor para desplegarlo en el inspector. La forma predeterminada del tile es Cuadrado, pero también puede elegir Isométrico, Cuadrado Medio Desplazamiento o Hexágono (dependiendo de la forma de las imágenes del tile). Si utiliza una forma de tile que no sea cuadrada, es posible que también necesite ajustar las propiedades **Diseño de Tile** y **Eje de Desplazamiento de Tile**. Por último, habilitar la propiedad **Renderizado > Recorte UV** puede ser útil si desea que los mosaicos se recorten según sus coordenadas. Esto garantiza que los tiles no puedan dibujarse fuera de su área asignada en la hoja de tiles.
fr: Après avoir créé la ressource TileSet, cliquez sur la valeur pour la déplier dans l'inspecteur. La forme de tuile par défaut est Carré, mais vous pouvez également choisir Isométrique, Carré décalé de moitié ou Hexagone (selon la forme de vos images de tuiles). Si vous utilisez une forme de tuile autre que Carré, vous pouvez également avoir besoin d'ajuster les propriétés **Calque de tuile** et **Axe de décalage de tuile**. Enfin, activer la propriété **Rendu > Clipping UV** peut être utile si vous souhaitez que les tuiles soient clippée par leurs coordonnées de tuile. Cela garantit que les tuiles ne peuvent pas dessiner à l'extérieur de leur zone allouée sur la feuille de tuiles.
ga: Tar éis an acmhainn TileSet a chruthú, cliceáil ar an luach chun é a oscailt sa chigire. Is é Cearnóg an cruth tíl réamhshocraithe, ach is féidir leat Isiméadrach, Cearnóg Leath-fhritháireamh nó Heicseagán a roghnú freisin (ag brath ar chruth do chuid íomhánna tíl). Má tá cruth tíl seachas Cearnóg in úsáid agat, b’fhéidir go mbeidh ort na hairíonna **Leagan Amach Tíleanna** agus **Ais Fritháireamh Tíleanna** a choigeartú. Ar deireadh, d'fhéadfadh sé go mbeadh sé úsáideach an mhaoin ** Rindreáil > Gearradh UV** a chumasú más mian leat go ndéanfaí na tíleanna a ghearradh ag a gcomhordanáidí tíl. Cinntíonn sé seo nach féidir le tíleanna a tharraingt lasmuigh dá limistéar leithdháilte ar an mbileog tíleanna.
ja: TileSetリソースを作成したら、値をクリックしてインスペクタで展開します。デフォルトのタイル形状は正方形ですが、アイソメトリック、半分ずらした正方形、六角形を選択することもできます(タイル画像の形状によって異なります)。正方形以外のタイル形状を使用する場合は、 **Tile Layout** と **Tile Offset Axis** プロパティも調整する必要があるかもしれません。最後に、タイルをタイル座標でクリッピングしたい場合は、 **Rendering > UV Clipping** プロパティを有効にすると便利です。これにより、タイルはタイルシート上の割り当てられた領域の外には描画できなくなります。
pt_br: Após criar o recurso TileSet, clique no valor para expandi-lo no Inspetor. O formato de tile padrão é Quadrado (Square), mas você também pode escolher Isométrico (Isometric), Quadrado com Deslocamento (Half-Offset Square) ou Hexágono (Hexagon), dependendo do formato das suas imagens de tile. Se estiver usando um formato diferente de Quadrado, talvez seja necessário ajustar as propriedades **Tile Layout** e **Tile Offset Axis**. Por fim, ativar a propriedade **Rendering > UV Clipping** pode ser útil caso você queira que os tiles sejam recortados pelas suas coordenadas de tile. Isso garante que os tiles não desenhem fora da área alocada no tilesheet.
ru: После создания ресурса TileSet щелкните значение, чтобы развернуть его в инспекторе. Форма тайла по умолчанию — Квадрат, но вы также можете выбрать Изометрическую, Квадрат с половинным смещением или Шестиугольник (в зависимости от формы его изображений). Если вы используете форму тайла, отличную от Квадрата, вам также может потребоваться настроить свойства **Tile Layout** и **Tile Offset Axis**. Так же, включение свойства **Rendering > UV Clipping** может быть полезным, если вы хотите, чтобы тайлы обрезались по их координатам. Это гарантирует, что тайлы не смогут отрисовываться за пределами выделенной им области в tilesheet.
ta: டைல்செட் வளத்தை உருவாக்கிய பிறகு, அதை இன்ச்பெக்டரில் வெளிப்படுத்த மதிப்பைக் சொடுக்கு செய்க. இயல்புநிலை ஓடு வடிவம் நாற்கை, ஆனால் நீங்கள் ஐசோமெட்ரிக், ஆஃப்-ஆஃப்செட் நாற்கை அல்லது அறுகோணத்தையும் தேர்வு செய்யலாம் (உங்கள் ஓடு படங்களின் வடிவத்தைப் பொறுத்து). சதுரத்தைத் தவிர வேறு ஒரு ஓடு வடிவத்தைப் பயன்படுத்தினால், நீங்கள் ** ஓடு தளவமைப்பு ** மற்றும் ** ஓடு ஆஃப்செட் அச்சு ** பண்புகளையும் சரிசெய்ய வேண்டியிருக்கும். கடைசியாக, ** ரெண்டரிங்> யு.வி. டில்சீட்டில் ஒதுக்கப்பட்ட பகுதிக்கு வெளியே ஓடுகள் வரைய முடியாது என்பதை இது உறுதி செய்கிறது.
tr: TileSet kaynağını oluşturduktan sonra, denetleyicide açmak için değerin üzerine tıklayın. Varsayılan karo şekli Kare'dir (square), ancak İzometrik, Yarım Kaymalı Kare (half offset square) veya Altıgen'i (hexagon) de seçebilirsiniz (karo resimlerinizin şekline bağlı olarak). Kare dışında bir karo şekli kullanıyorsanız, **Karo Yerleşim Düzeni** ve **Karo Kayma Ekseni** özelliklerini de ayarlamanız gerekebilir. Son olarak, karoların karo koordinatlarına göre kırpılmasını istiyorsanız **İşleme > UV Kesme** özelliğini etkinleştirmek yararlı olabilir. Bu, karoların karo kağıdı üzerinde kendilerine ayrılan alanın dışına çizilememesini sağlar.
uk: Після створення ресурсу TileSet клацніть значення, щоб розгорнути його в інспекторі. Типовою формою плитки є квадрат, але ви також можете вибрати ізометричну, напівзміщену квадратну або шестикутну (залежно від форми ваших зображень плитки). Якщо використовується форма плитки, відмінна від квадратної, можливо, вам також знадобиться налаштувати властивості **Розкладка плитки** та **Зсув осі плитки**. Нарешті, увімкнення властивості **Відтворення > UV-відсікання** може бути корисним, якщо ви бажаєте, щоб фрагменти обрізалися за їхніми координатами. Це гарантує, що плитки не можуть малювати за межами виділеної області на аркуші плиток.
zh_tw: 建立 TileSet 資源後，點擊該屬性值可在屬性面板展開相關設定。預設圖塊形狀為「正方形」，也可根據圖塊圖像選擇「等軸」、「半偏移正方形」或「六邊形」。若使用非方形圖塊，可能還需調整 **Tile Layout**（圖塊排列）與 **Tile Offset Axis**（圖塊偏移軸）。最後，如果希望依據圖塊座標裁切圖塊，可啟用 **Rendering > UV Clipping**，避免圖塊繪製超出台塊表分配區域。

source: Set the tile size to 64×64 in the inspector to match the example tilesheet:
es: Establezca el tamaño del tile en 64×64 en el inspector para que coincida con la hoja de tiles del ejemplo:
fr: Définissez la taille de tuile à 64×64 dans l'inspecteur pour correspondre à la feuille de tuile d'exemple :
ga: Socraigh méid na tíl go 64 × 64 sa chigire chun an bileog tíl sampla a mheaitseáil:
it: Imposta le dimensioni dei tasselli su 64×64 nell'ispettore in modo che corrisponda al tilesheet di esempio:
ja: タイルシートの例に合わせて、インスペクタでタイルのサイズを64×64に設定します:
pt_br: Defina a dimensão do tile como 64×64 no inspetor para corresponder ao tilesheet de exemplo:
ru: Установите в инспекторе размер тайла 64×64, чтобы он соответствовал примеру tilesheet:
ta: உதாரணமான டில்சீட்டுடன் பொருந்தக்கூடிய இன்ச்பெக்டரில் ஓடு அளவை 64 × 64 ஆக அமைக்கவும்:
tr: Örnek karo kağıdıyla eşleşmesi için denetleyicide karo boyutunu 64×64 olarak ayarlayın:
uk: Встановіть розмір плитки 64×64 в інспекторі, щоб відповідати прикладу аркуша плитки:
zh_tw: 在屬性面板將圖塊大小設為 64×64，以符合範例圖塊表：

source: Setting the tile size to 64×64 to match the example tilesheet
es: Establecer el tamaño del tile en 64×64 para que coincida con la hoja de tile del ejemplo
fr: Réglage de la taille de la tuile à 64×64 pour correspondre à la feuille de tuile d'exemple
ga: Méid na tíl a shocrú go 64 × 64 chun an bileog tíl sampla a mheaitseáil
it: Impostazione delle dimensioni dei tasselli su 64×64 in modo che corrisponda al tilesheet di esempio
ja: タイルシートの例に合わせてタイルのサイズを64×64に設定
pt_br: Definir a dimensão do tile como 64×64 para corresponder ao tilesheet de exemplo
ru: Установите тайла 64×64, чтобы соответствовать примеру tilesheet
ta: டைல் அளவை 64 × 64 ஆக அமைத்தல் எடுத்துக்காட்டு டில்சீட்டுடன் பொருந்துகிறது
tr: Örnek karo kağıdıyla eşleşmesi için karo boyutunu 64×64 olarak ayarlama
uk: Встановлення розміру плитки 64 × 64, щоб відповідати прикладу аркуша плитки
zh_tw: 將圖塊大小設為 64×64 以符合範例圖塊表
