Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: **Y Sort Origin:** The vertical offset to use for tile sorting based on its Y coordinate (in pixels). This allows using layers as if they were on different height for top-down games. Adjusting this can help alleviate issues with sorting certain tiles. Only effective if **Y Sort Enabled** is ``true`` on the TileMapLayer node under **CanvasItem > Ordering**
pt_br: **Y Sort Origin:** O deslocamento vertical a ser usado para a ordenação do tile com base em sua coordenada Y (em pixels). Isso permite utilizar camadas como se estivessem em alturas diferentes em jogos top-down. Ajustar este valor pode ajudar a resolver problemas de ordenação em certos tiles. Só é efetivo se **Y Sort Enabled** estiver como ``true`` no nó TileMapLayer em **CanvasItem > Ordering**
ru: **Y Sort Origin:** Вертикальное смещение для использования при сортировке тайлов на основе их координаты Y (в пикселях). Это позволяет использовать слои так, как будто они находятся на разной высоте для игр сверху вниз. Регулировка этого может помочь устранить проблемы с сортировкой определенных тайлов. Действует только в том случае, если **Y Sort Enabled** имеет значение ``true`` в узле TileMapLayer в **CanvasItem > Ordering**
ta: ** ஒய் வரிசை தோற்றம்: ** அதன் ஒய் ஒருங்கிணைப்பின் அடிப்படையில் (பிக்சல்களில்) ஓடு வரிசையாக்கத்திற்கு பயன்படுத்த செங்குத்து ஆஃப்செட். இது டாப்-டவுன் கேம்களுக்கு வெவ்வேறு உயரத்தில் இருப்பதைப் போல அடுக்குகளைப் பயன்படுத்த அனுமதிக்கிறது. இதை சரிசெய்வது சில ஓடுகளை வரிசைப்படுத்துவதில் சிக்கல்களைத் தணிக்க உதவும். ** ஒய் வரிசைப்படுத்தப்பட்டால் மட்டுமே பயனுள்ளதாக இருந்தால் ** ** canvasitem> வரிசைப்படுத்துதல் ** கீழ் உள்ள டிலேமாபிளேயர் முனையில் `` உண்மை``
uk: **Початок сортування по Y:** Вертикальне зміщення, яке використовується для сортування мозаїки на основі її координати Y (у пікселях). Це дозволяє використовувати шари так, ніби вони знаходяться на різній висоті для ігор зверху вниз. Налаштування цього може допомогти полегшити проблеми з сортуванням певних плиток. Діє, лише якщо **Y Sort Enabled** має значення ``true`` у вузлі TileMapLayer у розділі **CanvasItem > Ordering**
zh_tw: **Y Sort Origin：** 基於 Y 座標（像素）進行圖塊排序時所使用的垂直偏移。這讓你在製作俯視角遊戲時，可以模擬不同高度的圖層。調整這個值有助於解決某些圖塊排序的問題。僅當 TileMapLayer 節點下 **CanvasItem > Ordering** 的 **Y Sort Enabled** 為 ``true`` 時有效

source: You can create an additional alternative tile variant by clicking the large "+" icon next to the alternative tile. This is equivalent to selecting the base tile and right-clicking it to choose **Create an Alternative Tile** again.
es: Puedes crear otro tile alternativo haciendo clic en el icono "+" que está situado al lado del tile alternativo. Esto es equivalente a seleccionar el tile base y darle clic derecho, **Crear un Tile Alternativo** de nuevo.
ga: Is féidir leat leagan tíl malartach breise a chruthú trí chliceáil ar an deilbhín mór “+” in aice leis an tíl malartach. Tá sé seo comhionann leis an tíl bonn a roghnú agus cliceáil ar dheis air chun **Cruthaigh Tíleanna Malart** a roghnú arís.
ja: 大きな "+" アイコンを代替タイルの横でクリックすることで、追加の代替タイルバリアントを作成できます。これは、ベースタイルを選択して右クリックし、再度 **代替タイルを作成** を選択するのと同等です。
pt_br: Você pode criar uma variante adicional de um tile alternativo clicando no ícone grande de "+" ao lado do tile alternativo. Isso é equivalente a selecionar o tile base e clicar com o botão direito para escolher **Criar um Tile Alternativo** novamente.
ru: Вы можете создать дополнительный альтернативный вариант тайла, нажав на большой значок "+" рядом с альтернативным тайлом. Это эквивалентно выбору базового тайла и щелчку правой кнопкой мыши по нему, чтобы снова выбрать **Create an Alternative Tile**.
ta: மாற்று ஓடுக்கு அடுத்துள்ள பெரிய "+" ஐகானைக் சொடுக்கு செய்வதன் மூலம் கூடுதல் மாற்று ஓடு மாறுபாட்டை உருவாக்கலாம். இது அடிப்படை ஓடு என்பதைத் தேர்ந்தெடுப்பதற்கும், அதைத் தேர்வுசெய்ய வலது சொடுக்கு செய்வதற்கும் சமம் ** ஒரு மாற்று ஓடு ** ஐ உருவாக்கவும் ** மீண்டும்.
tr: Alternatif karonun yanındaki büyük "+" simgesine tıklayarak ek bir alternatif karo çeşidi oluşturabilirsiniz. Bu, temel karoyu seçip sağ tıklayarak tekrar **Alternatif Karo Oluştur** seçeneğini seçmeye eşdeğerdir.
uk: Ви можете створити додатковий альтернативний варіант плитки, натиснувши великий значок «+» поруч із альтернативною плиткою. Це еквівалентно вибору базової плитки та клацанню правою кнопкою миші, щоб знову вибрати **Створити альтернативну плитку**.
zh_tw: 你可以點擊備選圖塊旁的大型「+」圖示，建立新的備選圖塊。這等同於選取基本圖塊後按右鍵，再選擇「建立備選圖塊」。

source: When creating an alternative tile, none of the properties from the base tile are inherited. You must set properties again on the alternative tile if you wish those to be identical on the base tile and the alternative tile.
es: Al crear un tile alternativo, ninguna de las propiedades del tile base son heredadas. Debes establecer las propiedades nuevamente en el tile alternativo si deseas que sean idénticas en el tile base y en el tile alternativo.
ga: Agus tíl mhalartach á chruthú agat, ní dhéantar aon cheann de na hairíonna ón tíl bonn oidhreachta. Ní mór duit airíonna a shocrú arís ar an tíl mhalartach más mian leat go mbeadh iad siúd comhionann ar an tíl bhun-agus ar an tíl mhalartach.
ja: 代替タイルを作成する際、ベースタイルからはプロパティが一切引き継がれません。ベースタイルと代替タイルで同じプロパティを持たせたい場合は、代替タイルでプロパティを再設定する必要があります。
pt_br: Ao criar um tile alternativo, nenhuma das propriedades do tile base é herdada. Você precisará configurar novamente as propriedades no tile alternativo caso deseje que elas sejam idênticas às do tile base.
ru: При создании альтернативного тайла ни одно из свойств базового не наследуется. Вам нужно снова задать свойства альтернативного тайла, если вы хотите, чтобы они были идентичными.
ta: மாற்று ஓடுகளை உருவாக்கும் போது, அடிப்படை ஓடுகளிலிருந்து வரும் பண்புகள் எதுவும் மரபுரிமையாக இல்லை. அடிப்படை ஓடு மற்றும் மாற்று ஓடு ஆகியவற்றில் ஒரே மாதிரியாக இருக்க விரும்பினால் மாற்று ஓடுகளில் நீங்கள் மீண்டும் பண்புகளை அமைக்க வேண்டும்.
tr: Alternatif bir karo oluştururken, temel karodaki özelliklerin hiçbiri miras alınmaz. Temel karo ve alternatif karodaki özelliklerin benzer olmasını istiyorsanız, alternatif karoda özellikleri yeniden ayarlamanız gerekir.
uk: Під час створення альтернативної плитки жодна з властивостей базової плитки не успадковується. Ви повинні знову встановити властивості на альтернативній плитці, якщо ви бажаєте, щоб вони були ідентичними на базовій плитці та альтернативній плитці.
zh_tw: 建立備選圖塊時，不會繼承基本圖塊的任何屬性。如果你希望備選圖塊與基本圖塊有相同屬性，必須重新在備選圖塊上設定。
