Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: The data is associated with the tile in the TileSet: all instances of the placed tile will use the same custom data. If you need to create a variant of a tile that has different custom data, this can be done by :ref:`creating an alternative tile <doc_using_tilesets_creating_alternative_tiles>` and changing the custom data for the alternative tile only.
es: Los datos se asocian con el tile en el TileSet: cada lugar donde se ha colocado el tile son instancias que utilizarán los mismos datos personalizados. Si necesita crear una variante de un tile que tenga diferentes datos personalizados, puede hacerlo mediante la :ref:`creación de un tile alternativo <doc_using_tilesets_creating_alternative_tiles>` y cambiando los datos personalizados solo para el tile alternativo.
ga: Tá baint ag na sonraí leis an tíl sa TileSet: úsáidfidh gach cás den tíl suite na sonraí saincheaptha céanna. Más gá duit leagan tíl a chruthú ina bhfuil sonraí saincheaptha éagsúla, is féidir é seo a dhéanamh trí :ref: `tíl eile a chruthú <doc_using_tilesets_creating_alternative_tiles>` agus na sonraí saincheaptha don tíl eile a athrú amháin.
ja: データは TileSet 内のタイルに関連付けられており、つまり配置されたタイルのすべてのインスタンスが同じカスタムデータを使用します。異なるカスタムデータを持つタイルのバリエーションを作成する必要がある場合は、 :ref:`代替タイルを作成する <doc_using_tilesets_creating_alternative_tiles>` を参照し、代替タイルだけでカスタムデータを変更することで対応できます。
pt_br: Os dados são associados ao tile no TileSet: todas as instâncias do tile colocado usarão os mesmos dados personalizados. Se você precisar criar uma variante de um tile com dados personalizados diferentes, isso pode ser feito :ref:`criando um tile alternativo <doc_using_tilesets_creating_alternative_tiles>` e alterando os dados personalizados somente para o tile alternativo.
ru: Данные связаны с тайлом в TileSet: все экземпляры размещенного тайла будут использовать одни и те же пользовательские данные. Если вам нужно создать вариант тайла с другими пользовательскими данными, это можно сделать :ref:`созданием альтернативного тайла <doc_using_tilesets_creating_alternative_tiles>` и изменением пользовательских данных только для альтернативного тайла.
ta: தரவு டைல்செட்டில் உள்ள ஓடு உடன் தொடர்புடையது: வைக்கப்பட்ட ஓடு அனைத்து நிகழ்வுகளும் அதே தனிப்பயன் தரவைப் பயன்படுத்தும். வெவ்வேறு தனிப்பயன் தரவைக் கொண்ட ஒரு ஓடுகளின் மாறுபாட்டை நீங்கள் உருவாக்க வேண்டும் என்றால், இதைச் செய்யலாம்: குறிப்பு: `ஒரு மாற்று ஓடு உருவாக்குதல் <doc_using_tilesets_creating_alterative_tiles>` மற்றும் மாற்று ஓடுக்கு தனிப்பயன் தரவை மட்டுமே மாற்றுவது.
tr: Veriler TileSet'teki karo ile ilişkilendirilir: yerleştirilen karonun tüm örneklemeleri aynı özel verileri kullanacaktır. Bir karonun farklı özel verilere sahip bir varyantını oluşturmanız gerekiyorsa, bu işlem :ref:`alternatif bir karo oluşturarak <doc_using_tilesets_creating_alternative_tiles>` ve özel verileri yalnızca alternatif karo için değiştirerek yapılabilir.
uk: Дані пов’язані з плиткою в TileSet: усі екземпляри розміщеної плитки використовуватимуть однакові спеціальні дані. Якщо вам потрібно створити варіант плитки з іншими спеціальними даними, це можна зробити, :ref:`creating an alternative tile <doc_using_tilesets_creating_alternative_tiles>` і змінивши спеціальні дані лише для альтернативної плитки.
zh_tw: 資料是在 TileSet 中與圖塊進行關聯的：放置的所有圖塊使用的都是相同的自訂資料。如果你需要建立擁有不同自訂資料的變體圖塊，可以通過 :ref:`建立備選圖塊 <doc_using_tilesets_creating_alternative_tiles>` 並為該備選圖塊更改自訂資料來實作。

source: Creating a custom data layer in the TileSet resource inspector (within the TileMapLayer node)
pt_br: Criando uma camada de dados personalizados no Inspetor do recurso TileSet (dentro do nó TileMapLayer)
ru: Создание пользовательского слоя данных в инспекторе ресурсов TileSet (внутри узла TileMapLayer)
ta: டைல்செட் வள இன்ச்பெக்டரில் தனிப்பயன் தரவு அடுக்கை உருவாக்குதல் (டில்மேபிளேயர் முனைக்குள்)
uk: Створення спеціального рівня даних в інспекторі ресурсів TileSet (у вузлі TileMapLayer)
zh_tw: 在 TileSet 資源屬性檢視器中建立自訂資料圖層 (在 TileMapLayer 節點內)

source: Example of configured custom data layers with game-specific properties
es: Ejemplo de capas de datos personalizadas configuradas con propiedades específicas del juego
ga: Sampla de shraitheanna sonraí saincheaptha cumraithe le hairíonna a bhaineann go sonrach
ja: ゲーム固有のプロパティを持つカスタムデータレイヤーの設定例
pt_br: Exemplo de camadas de dados personalizados configuradas com propriedades específicas do jogo
ru: Пример настроенных пользовательских слоев данных со свойствами, специфичными для игры
ta: விளையாட்டு-குறிப்பிட்ட பண்புகளுடன் கட்டமைக்கப்பட்ட தனிப்பயன் தரவு அடுக்குகளின் எடுத்துக்காட்டு
tr: Oyuna özgü özelliklerle yapılandırılmış özel veri katmanları örneği
uk: Приклад налаштованих користувальницьких шарів даних із властивостями гри
zh_tw: 針對遊戲中的特定屬性配置自訂資料層的範例

source: You can reorder custom data without breaking existing metadata: the TileSet editor will update automatically after reordering custom data properties.
es: Puede reordenar datos personalizados sin romper los metadatos existentes: el editor TileSet se actualizará automáticamente después de reordenar las propiedades de datos personalizados.
ga: Is féidir leat sonraí saincheaptha a athordú gan meiteashonraí atá ann cheana a bhriseadh: nuashonróidh eagarthóir TileSet go huathoibríoch tar éis airíonna sonraí saincheaptha a athordú.
ja: 既存のメタデータを壊すことなく、カスタムデータを並べ替えることができます: カスタムデータプロパティを並べ替えると、TileSet エディタは自動的に更新されます。
pt_br: Você pode reordenar os dados personalizados sem quebrar os metadados existentes: o editor de TileSet será atualizado automaticamente após a reordenação das propriedades de dados personalizados.
ru: Вы можете изменить порядок пользовательских данных, не нарушая существующие метаданные: редактор TileSet автоматически обновится после изменения порядка свойств пользовательских данных.
ta: ஏற்கனவே உள்ள மெட்டாடேட்டாவை உடைக்காமல் தனிப்பயன் தரவை மறுவரிசைப்படுத்தலாம்: தனிப்பயன் தரவு பண்புகளை மறுவரிசைப்படுத்திய பிறகு டைல்செட் எடிட்டர் தானாகவே புதுப்பிக்கப்படும்.
tr: Mevcut meta verileri bozmadan özel verileri yeniden sıralayabilirsiniz: TileSet düzenleyicisi, özel veri özelliklerini yeniden sıraladıktan sonra otomatik olarak güncellenecektir.
uk: Ви можете змінити порядок користувацьких даних, не порушуючи існуючі метадані: редактор TileSet оновиться автоматично після зміни порядку користувацьких властивостей даних.
zh_tw: 改變自訂資料的順序不會損壞現有的中繼資料：TileSet 編輯器會在自訂資料屬性的順序發生改變後自動進行更新。

source: With the custom data layers example shown above, we're assigning a tile to have the ``damage_per_second`` metadata set to ``25`` and the ``destructible`` metadata to ``false``:
pt_br: Com o exemplo de camadas de dados personalizados demonstrado acima, estamos atribuindo a um tile o metadado ``damage_per_second`` com o valor ``25`` e o metadado ``destructible`` com o valor ``false``:
ru: В примере пользовательских слоев данных, показанном выше, мы назначаем тайлу метаданные ``damage_per_second`` со значением ``25`` и метаданные ``destructible`` со значением ``false``:
ta: மேலே காட்டப்பட்டுள்ள தனிப்பயன் தரவு அடுக்குகளின் எடுத்துக்காட்டு மூலம், `` சேதம்_பெர்_செக்கண்ட்`` மேனிலை தரவு `` 25`` மற்றும் `` அழிக்கக்கூடிய`` மேனிலை தரவு ஆகியவற்றை `` தவறு`:
uk: У наведеному вище прикладі користувацьких шарів даних ми призначаємо плитку, щоб метадані ``damage_per_second`` встановили ``25``, а метадані ``destructible`` — ``false``:
zh_tw: 使用上面顯示的自訂資料圖層範例，我們正在指派一個圖塊，使其具有設定為 ``25`` 的 ``damage_per_second`` 中繼資料，以及設定為 ``false`` 的 ``destructible`` 中繼資料：

source: Editing custom data in the TileSet editor while in Select mode
es: Edición de datos personalizados en el editor TileSet mientras está en modo Seleccionar
ga: Eagarthóireacht sonraí saincheaptha san eagarthóir TileSet agus tú i mód Roghnaigh
ja: 選択モードの中でTileSetエディタによるカスタムデータの編集
pt_br: Editando dados personalizados no editor de TileSet enquanto está no modo Seleção
ru: Редактирование пользовательских данных в редакторе TileSet в режиме Select
ta: தேர்ந்தெடுக்கப்பட்ட பயன்முறையில் இருக்கும்போது தனிப்பயன் தரவை டைல்செட் எடிட்டரில் திருத்துதல்
tr: Seç modundayken TileSet düzenleyicisinde özel verileri düzenleme
uk: Редагування спеціальних даних у редакторі TileSet у режимі вибору
zh_tw: TileSet 編輯器的“選擇”模式下編輯自訂資料

source: :ref:`Tile property painting <doc_using_tilemaps_using_tile_property_painting>` can also be used for custom data:
es: :ref:`La propiedad de pintura de tile <doc_using_tilemaps_using_tile_property_painting>` también se puede utilizar para datos personalizados:
fr: :ref:`La peinture de propriété de tuile <doc_using_tilemaps_using_tile_property_painting>` peut aussi être utilisée pour des données personnalisées :
ga: :ref:`Is féidir péinteáil airí tíl <doc_using_tilemaps_using_tile_property_painting>` a úsáid freisin le haghaidh sonraí saincheaptha:
ja: \ :ref:`Tile property painting <doc_using_tilemaps_using_tile_property_painting>` はカスタムデータにも使えます:
pt_br: O :ref:`pintar propriedades de tiles <doc_using_tilemaps_using_tile_property_painting>` também pode ser usado para dados personalizados:
ru: :ref:`Окраска свойств тайла <doc_using_tilemaps_using_tile_property_painting>` также может использоваться для пользовательских данных:
ta: :ref:`Tile property painting <doc_using_tilemaps_using_tile_property_painting>` can also be used க்கு தனிப்பயன் data:
tr: :ref:`Karo özelliğini boyama <doc_using_tilemaps_using_tile_property_painting>`, özel veriler için de kullanılabilir:
uk: :ref:`Tile property painting <doc_using_tilemaps_using_tile_property_painting>` також можна використовувати для користувацьких даних:
zh_tw: 自訂資料也可以進行 :ref:`圖塊屬性的繪製 <doc_using_tilemaps_using_tile_property_painting>`：

source: Assigning custom data in the TileSet editor using tile property painting
es: Asignación de datos personalizados en el editor TileSet mediante la pintura de propiedades de tile
ga: Sonraí saincheaptha a shannadh san eagarthóir TileSet ag baint úsáide as péinteáil maoine tíl
ja: TileSetEditor内でプロパティペイントによるカスタムデータの割り当て
pt_br: Atribuindo dados personalizados no editor de TileSet usando a pintura de propriedades de tile
ru: Назначение пользовательских данных в редакторе TileSet с помощью рисования свойств тайла
ta: ஓடு சொத்து ஓவியத்தைப் பயன்படுத்தி டைல்செட் எடிட்டரில் தனிப்பயன் தரவை ஒதுக்குதல்
tr: Karo özelliği boyama kullanarak TileSet düzenleyicisinde özel veri atama
uk: Призначення користувацьких даних у редакторі TileSet за допомогою малювання властивостей плитки
zh_tw: 在 TileSet 編輯器中使用圖塊屬性繪製來分配自訂資料

source: Creating terrain sets (autotiling)
es: Creando sets de terreno (autotilling)
ga: Tacair tírdhreach a chruthú (uathoibriú)
it: Creare insiemi di terreno (autotiling)
ja: 地形セットを作成する(自動タイリング)
ko: 지형 세트 만들기 (자동타일링)
ru: Создание terrain (ландшафтных) наборов (иначе - autotiling)
ta: நிலப்பரப்பு தொகுப்புகளை உருவாக்குதல் (ஆட்டோடிங்)
tr: Arazi setleri oluşturma (automatik karo döşeme)
uk: Створення наборів місцевості (автомозаїка)
zh_tw: 建立內容

source: This functionality was implemented in a different form as *autotiling* in Godot 3.x. Terrains are essentially a more powerful replacement of autotiles. Unlike autotiles, terrains can support transitions from one terrain to another, as a tile may define several terrains at once.
es: Esta funcionalidad se implementó de forma diferente al *autotiling* de Godot 3.x. Los terrenos son, en esencia, un reemplazo más potente de los autotiles. A diferencia de los autotiles, los terrenos pueden admitir transiciones de un terreno a otro, ya que un tile puede definir varios terrenos a la vez.
ga: Cuireadh an fheidhmiúlacht seo i bhfeidhm i bhfoirm dhifriúil mar *autotiling* i Godot 3.x. Go bunúsach is athsholáthar níos cumhachtaí uathoibríoch iad na talánacha. Murab ionann agus autotiles, is féidir le tíleanna tacú le haistrithe ó thír-raon amháin go tír eile, mar d'fhéadfadh tíl roinnt tíleanna a shainiú ag an am céanna.
ja: この機能はGodot 3.xでは *自動タイル* として別の形式で実装されていました。地形は自動タイルのより強力な代替機能です。地形は自動タイルとは異なり、1つのタイルに複数の地定義できるので、ある地形から別の地形への遷移をサポートしています。
pt_br: Essa funcionalidade era implementada de forma diferente como *autotiling* no Godot 3.x. Os terrenos são, essencialmente, uma substituição mais poderosa dos autotiles. Diferente dos autotiles, os terrenos podem suportar transições de um terreno para outro, já que um tile pode definir vários terrenos ao mesmo tempo.
ru: Эта функциональность была реализована в другой форме как *autotiling* в Godot 3.x. Terrains по сути являются более мощной заменой autotiles. В отличие от autotiles, Terrains могут поддерживать переходы от одного Terrains к другому, поскольку tile может определять несколько Terrains одновременно.
ta: இந்த செயல்பாடு கோடோட் 3.x இல் * ஆட்டோடிங் * என வேறு வடிவத்தில் செயல்படுத்தப்பட்டது. நிலப்பரப்புகள் அடிப்படையில் ஆட்டோடில்களின் மாற்றாக மாற்றப்படுகின்றன. ஆட்டோடில்களைப் போலன்றி, நிலப்பரப்புகள் ஒரு நிலப்பரப்பில் இருந்து இன்னொரு நிலைக்கு மாற்றங்களை ஆதரிக்க முடியும், ஏனெனில் ஒரு ஓடு ஒரே நேரத்தில் பல நிலப்பரப்புகளை வரையறுக்கலாம்.
tr: Bu işlevsellik Godot 3.x'te *ototiling* olarak farklı bir biçimde uygulanmıştır. Araziler, esasen otomatik karo döşemenin daha güçlü bir şekilde değiştirilmiş halidir. Otomatik karoların aksine, bir karo aynı anda birden fazla arazi tanımlayabildiğinden, araziler bir araziden diğerine geçişleri destekleyebilir.
uk: Ця функція була реалізована в іншій формі як *autotiling* у Godot 3.x. Місцевості, по суті, є потужнішою заміною автотайлів. На відміну від автоматичних плиток, місцевості можуть підтримувати переходи від однієї місцевості до іншої, оскільки плитка може визначати декілька місцевостей одночасно.
zh_tw: 這個功能和 Godot 3.x 中的*自動圖塊*使用了不同的實作方式。地形系統能夠完全替代自動圖塊，功能也更強大。與自動圖塊不同，地形系統支援不同地形之間的過渡，這樣就可以為同一個圖定義多個地形。

source: Unlike before, where autotiles were a specific kind of tiles, terrains are only a set of properties assigned to atlas tiles. These properties are then used by a dedicated TileMap painting mode that selects tiles featuring terrain data in a smart way. This means any terrain tile can be either painted as terrain or as a single tile, like any other.
es: Antes, los autotiles eran un tipo específico de tile, ahora los terrenos son solo un conjunto de propiedades asignadas a los tiles del atlas. Estas propiedades son luego utilizadas por un modo de pintura dedicado en el TileMap que selecciona tiles que presentan datos de terreno de una manera inteligente. Esto significa que cualquier tile de terreno puede pintarse como terreno o como un tile único (como cualquier tile normal).
ga: Murab ionann agus roimhe seo, áit a raibh uath-thíleanna de chineál sonrach tíleanna, níl sa tír-raon ach sraith maoine a shanntar do thíleanna atlais. Úsáideann modh péintéireachta TileMap tiomnaithe na hairíonna seo ansin a roghnaíonn tíleanna ina bhfuil sonraí tír-raoin ar bhealach cliste. Ciallaíonn sé seo gur féidir aon tíl tír-raoin a phéinteáil mar thír-raon nó mar thíl aonair, cosúil le haon tíl eile.
ja: オートタイルがある種のタイルであった以前とは異なり、地形はただアトラスタイルに割り当てられたプロパティのセットに過ぎません。これらのプロパティは専用のTileMapペインティングモードで使用されます。このモードでは地形データを備えるタイルをスマートな方法で選択できます。つまり、地形タイルは地形としてペイントすることも、他のタイルと同じように1つのタイルとしてペイントすることもできるということです。
pt_br: Diferente de antes, quando os autotiles eram um tipo específico de tile, os terrenos são somente um conjunto de propriedades atribuídas aos tiles do atlas. Essas propriedades são então usadas por um modo de pintura dedicado do TileMap, que seleciona os tiles com dados de terreno inteligentemente. Isso significa que qualquer tile de terreno pode ser pintado como terreno ou como um tile único, como qualquer outro.
ru: В отличие от предыдущих версий, где autotiles были определенным типом тайлов, terrains (ландшафты)— это всего лишь набор свойств, назначенных тайлам атласа. Затем эти свойства используются специальным режимом рисования TileMap, который выбирает тайлы с данными о ландшафте умным способом. Это означает, что любой тайл ландшафта может быть нарисован как ландшафт или как отдельный тайл, как и любой другой.
ta: முன்பு போலல்லாமல், ஆட்டோடில்கள் ஒரு குறிப்பிட்ட வகையான ஓடுகளாக இருந்த இடத்தில், நிலப்பரப்புகள் அட்லச் ஓடுகளுக்கு ஒதுக்கப்பட்ட பண்புகளின் தொகுப்பாகும். இந்த பண்புகள் பின்னர் ஒரு பிரத்யேக டிலேமேப் ஓவியம் பயன்முறையால் பயன்படுத்தப்படுகின்றன, இது நிலப்பரப்பு தரவைக் கொண்ட ஓடுகளை அறிவுள்ள வழியில் தேர்ந்தெடுக்கிறது. இதன் பொருள் எந்தவொரு நிலப்பரப்பு ஓடு நிலப்பரப்பாக அல்லது மற்றதைப் போல ஒற்றை ஓடு என வரையலாம்.
tr: Otomatik karoların sadece özel bir karo türü olduğu eski durumdan farklı olarak, araziler yalnızca atlas karolarına atanan bir dizi özelliktir. Bu özellikler daha sonra arazi verilerini içeren karoları akıllı bir şekilde seçen adanmış özel bir TileMap boyama modu tarafından kullanılır. Bu, herhangi bir arazi karosunun ya arazi olarak ya da diğerleri gibi tek bir karo olarak boyanabileceği anlamına gelir.
uk: На відміну від попередніх часів, коли автоплитки були окремим видом плиток, рельєфи — це лише набір властивостей, призначених плиткам атласу. Потім ці властивості використовуються спеціальним режимом малювання TileMap, який інтелектуально вибирає плитки з даними рельєфу. Це означає, що будь-яку плитку місцевості можна намалювати як місцевість або як одну плитку, як будь-яку іншу.
zh_tw: 與以前不同的是，自動圖塊是一種特定型別的圖塊，而地形只是分配給合集圖塊的一組屬性。使用專門的 TileMap 繪製模式時就會用到這些屬性，該模式能夠對帶有地形資料的圖塊進行智慧選擇。這意味著地形圖塊既可以作為地形繪製，也可以像其他圖塊一樣作為單個圖塊繪製。

source: A "polished" tileset generally features variations that you should use on corners or edges of platforms, floors, etc. While these can be placed manually, this quickly becomes tedious. Handling this situation with procedurally generated levels can also be difficult and require a lot of code.
es: Un tileset "pulido" generalmente presenta variaciones que debes usar en las esquinas o bordes de plataformas, pisos, etc. Si bien se pueden colocar manualmente, rápidamente esto se vuelve tedioso. Manejar esta situación con niveles generados por procedimientos también puede ser difícil y requerir una gran cantidad de código.
ga: Go ginearálta bíonn éagsúlachtaí i gceist le tíleanna "snasta" ar chóir duit iad a úsáid ar choirnéil nó ar imill ardáin, urláir, etc. Cé gur féidir iad seo a chur de láimh, éiríonn sé seo tedious go tapa. D'fhéadfadh sé a bheith deacair freisin an cás seo a láimhseáil le leibhéil a ghintear de réir nós imeachta agus go dteastaíonn go leor cód.
ja: 一般的に、"洗練された" タイルセットには足場や床などの角や縁に使えるタイルのバリエーションが含まれています。これらは手動で配置することもできますが、すぐに面倒になります。レベルをプロシージャルに生成するとしても、このような配置を扱うのは難しく長いコードを必要とします。
pt_br: Um tileset "polido" geralmente possui variações que você deve usar em cantos ou bordas de plataformas, pisos etc. Embora seja possível posicioná-las manualmente, isso rapidamente se torna tedioso. Lidar com essa situação em níveis gerados proceduralmente também pode ser difícil e exigir muito código.
ru: «Polished (отполированный)» тайлсет обычно содержит вариации, которые следует использовать на углах или краях платформ, полов и т. д. Хотя их можно размещать вручную, это быстро становится утомительным. Обработка этой ситуации с помощью процедурно сгенерированных уровней также может быть сложной и потребовать большого количества кода.
ta: ஒரு "மெருகூட்டப்பட்ட" டைல்செட் பொதுவாக நீங்கள் மேடைகள், தளங்கள் போன்றவற்றின் மூலைகள் அல்லது விளிம்புகளில் பயன்படுத்த வேண்டிய மாறுபாடுகளைக் கொண்டுள்ளது. இவை கைமுறையாக வைக்கப்படலாம், இது விரைவாக கடினமானது. இந்த சூழ்நிலையை நடைமுறை ரீதியாக உருவாக்கப்பட்ட நிலைகளுடன் கையாள்வதும் கடினம் மற்றும் நிறைய குறியீடு தேவைப்படுகிறது.
tr: "Cilalı" bir karo seti genellikle platformların, zeminlerin vb. köşelerinde veya kenarlarında kullanmanız gereken varyasyonlar içerir. Bunlar elden yerleştirilebilse de, bu hızlı bir şekilde sıkıcı hale gelir. Bu durumu yöntemsel olarak oluşturulmuş seviyelerle ele almak da zor olabilir ve çok fazla kod gerektirebilir.
uk: «Полірований» набір плиток зазвичай містить варіації, які ви повинні використовувати на кутах або краях платформ, підлоги тощо. Хоча їх можна розмістити вручну, це швидко стає втомливим. Вирішення цієї ситуації за допомогою процедурно згенерованих рівнів також може бути складним і вимагає багато коду.
zh_tw: “完善”的圖塊集中通常會包含很多變體圖塊，適用於平臺、地板等位置的角落和邊緣。這種圖塊雖然可以手動放置，但是很快就會感覺非常麻煩。在程式式生成的關卡中如果要處理這種情況也很困難，需要編寫大量的程式碼。

source: Godot offers *terrains* to perform this kind of tile connection automatically. This allows you to have the "correct" tile variants automatically used.
pt_br: O Godot oferece *terrenos* para realizar esse tipo de conexão de tiles automaticamente. Isso permite que as variantes "corretas" dos tiles sejam usadas de forma automática.
ru: Godot предлагает *terrains* для автоматического выполнения такого рода соединения тайлов. Это позволяет вам автоматически использовать «правильные» варианты тайлов.
ta: இந்த வகையான ஓடு இணைப்பை தானாக செய்ய கோடோட் * நிலப்பரப்புகளை * வழங்குகிறது. இது "சரியான" ஓடு வகைகளை தானாகவே பயன்படுத்த அனுமதிக்கிறது.
uk: Godot пропонує *території* для автоматичного виконання такого типу плиткового з’єднання. Це дозволяє автоматично використовувати «правильні» варіанти плитки.
zh_tw: Godot 提供 *地形* 以自動執行這類型的圖塊連接。這讓您可以自動使用「正確的」圖塊變體。

source: Terrains are grouped into terrain sets. Each terrain set is assigned a mode from **Match Corners and Sides**, **Match Corners** and **Match sides**. They define how terrains are matched to each other in a terrain set.
es: Los terrenos se agrupan en conjuntos de terrenos. A cada conjunto de terrenos se le asigna un modo, que puede ser **Coincidir Esquinas y Lados**, **Coincidir Esquinas** y **Coincidir Lados** (Match Corners and Sides, Match Corners y Match Sides). Estos modos definen cómo se combinan los terrenos entre sí en un conjunto de terrenos.
fr: Les terrains sont regroupés en ensembles de terrains. Tous les terrains sont assignés un mode entre **Faire correspondre les coins et les côtés**, **Faire correspondre les coins** et **Faire correspondre les côtés**. Ils définissent comment les terrains sont adaptés les uns aux autres dans un ensemble de terrains.
ga: Déantar tírdhmeanna a ghrúpáil ina tacair tírdhreach Sanntar modh do gach tacar tírdhreach ó**Coirnéil agus Taobhanna Meaitseáil**, **Cúinne Meaitseáil** agus **Taobhanna Meaitseáil**. Sainmhíníonn siad conas a dhéantar tarraingíní a mheaitseáil lena chéile i sraith tírdhreach.
ja: 地形はいくつかの terrain sets にグループ分けされています。terrain set はそれぞれ **Match Corners and Sides** 、 **Match Corners** 、そして **Match sides** に割り当てられます。これらは terrain sets の中で、地形が他の地形とどのようにマッチするかを定義しています。
pt_br: Terrenos são agrupados em conjuntos de terrenos. Cada conjunto de terrenos recebe um modo entre **Combinar Cantos e Lados**, **Combinar Cantos** e **Combinar Lados**. Esses modos definem como os terrenos se conectam entre si em um conjunto de terrenos.
ru: Ландшафты сгруппированы в наборы ландшафтов. Каждому набору ландшафтов назначается режим из **Match Corners and Sides**, **Match Corners** и **Match sides**. Они определяют, как ландшафты сопоставляются друг с другом в наборе ландшафтов.
ta: நிலப்பரப்புகள் நிலப்பரப்பு தொகுப்புகளாக தொகுக்கப்பட்டுள்ளன. ஒவ்வொரு நிலப்பரப்பு தொகுப்பும் ** மேட்ச் மூலைகள் மற்றும் பக்கங்களிலிருந்து ஒரு பயன்முறையை ஒதுக்குகிறது **, ** மேட்ச் மூலைகள் ** மற்றும் ** பொருந்தும் பக்கங்கள் **. நிலப்பரப்பு தொகுப்பில் நிலப்பரப்புகள் எவ்வாறு ஒருவருக்கொருவர் பொருந்துகின்றன என்பதை அவை வரையறுக்கின்றன.
tr: Araziler arazi setleri halinde gruplandırılır. Her arazi setine **Köşeleri ve Kenarları Eşleştir/Match Corners and Sides**, **Köşeleri Eşleştir/Match Corners** ve **Kenarları Eşleştir/Match sides** modlarından biri atanır. Bunlar, arazilerin bir arazi setinde birbirleriyle nasıl eşleştirileceğini tanımlar.
uk: Ландшафти згруповані в набори ландшафтів. Кожному набору ландшафту призначається режим із **Збіг кутів і сторін**, **Збіг кутів** і **Збіг сторін**. Вони визначають, як рельєфи відповідають один одному в наборі рельєфу.
zh_tw: 地形按照地形集群組。地形集有固定的模式，包括 **Match Corners and Sides** 、 **Match Corners** 、 **Match sides** （配對角落和邊緣、配對角落、配對邊緣）。模式決定了地形集中的地形如何相互配對。
