Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: Tile proxies are automatically set up when merging different atlases, but they can also be set manually thanks to the **Manage Tile Proxies** dialog you can access using the "three vertical dots" menu mentioned above.
es: Los proxies de tiles se configuran automáticamente al unir diferentes atlas, pero también se pueden configurar manualmente gracias al cuadro de diálogo **Administrar Proxy de Tiles** (Manage Tile Proxies) al que puede acceder usando el menú de «tres puntos verticales» mencionado anteriormente.
fr: Les proxies de tuile sont automatiquement mises en place lors de la fusion de différents atlas, mais elles peuvent également être réglées manuellement grâce à la fenêtre **Gérer les proxies de tuiles**, que vous pouvez accéder à l'aide du menu "trois points verticaux" mentionné ci-dessus.
ga: Cuirtear seachfhálaí tíleanna ar bun go huathoibríoch agus atlasanna éagsúla á chumasc, ach is féidir iad a shocrú de láimh freisin a bhuíochas leis an dialóg **Bainistigh Tile Proxies** is féidir leat rochtain a fháil ag baint úsáide as an roghchlár “trí ponc ingearacha” a luaitear thuas.
ja: タイルプロキシは、異なるアトラスをマージする際に自動的に設定されますが、上記で説明した "縦3点" のメニューからアクセスできる **タイルプロキシの管理** ダイアログから手動で設定することもできます。
pt_br: Os proxies de tile são configurados automaticamente ao mesclar diferentes atlas, mas também podem ser configurados manualmente por meio da janela **Gerenciar Proxies de Tile**, que você pode acessar usando o menu de "três pontos verticais" mencionado acima.
ru: Прокси тайлов автоматически настраиваются при объединении разных атласов, но их также можно настроить вручную с помощью диалогового окна **three vertical dots**, доступ к которому осуществляется с помощью меню «три вертикальные точки», упомянутого выше.
ta: வெவ்வேறு அட்லச்களை ஒன்றிணைக்கும் போது ஓடு ப்ராக்சிகள் தானாகவே அமைக்கப்படுகின்றன, ஆனால் மேலே குறிப்பிட்டுள்ள "மூன்று செங்குத்து புள்ளிகள்" மெனுவைப் பயன்படுத்தி நீங்கள் அணுகக்கூடிய ** டைல் ப்ராக்சிகள் ** உரையாடலுக்கும் அவை கைமுறையாக நன்றி.
tr: Karo vekilleri farklı atlaslar birleştirilirken otomatik olarak ayarlanır, ancak yukarıda bahsedilen "üç dikey nokta" menüsünü kullanarak erişebileceğiniz **Karo Vekillerini Yönet** iletişim kutusu sayesinde elden de ayarlanabilir.
uk: Мозаїчні проксі-сервери налаштовуються автоматично під час об’єднання різних атласів, але їх також можна налаштувати вручну завдяки діалоговому вікну **Керування мозаїчними проксі-серверами**, доступ до якого можна отримати за допомогою згаданого вище меню «трьох вертикальних точок».
zh_tw: 合併不同圖集時會自動設定圖塊代理，也可以透過上述「三個垂直點」選單開啟的 **管理圖塊代理** 視窗來手動設定。

source: Manually creating tile proxies may be useful when you changed an atlas ID or want to replace all tiles from an atlas by the ones from another atlas. Note that when editing a TileMap, you can replace all cells by their corresponding mapped value.
es: La creación manual de proxies de tiles puede resultar útil cuando se cambia el ID de un atlas o se quieren reemplazar todos los tiles de un atlas por los de otro atlas. Tenga en cuenta que al editar un TileMap, puede reemplazar todas las celdas por su valor asignado correspondiente.
ga: D'fhéadfadh go mbeadh sé úsáideach seachfhálaí tíl a chruthú de láimh nuair a d'athraigh tú ID atlas nó nuair a theastaíonn uait na tíleanna ó atlas eile a chur in ionad gach tíl ó atlas. Tabhair faoi deara gur féidir leat a luach mapáilte comhfhreagrach a chur in ionad na cealla go léir agus tú ag eagarthóireacht ar TileMap.
ja: タイルプロキシを手動で作成することは、アトラスのIDを変更した場合や、あるアトラスのタイルを別のアトラスからのタイルですべて置き換えたい場合に便利です。なお、TileMapを編集する際には、すべてのセルを対応するマッピングされた値に置き換えることができます。
pt_br: Criar proxies de tile manualmente pode ser útil quando você altera um ID de atlas ou deseja substituir todos os tiles de um atlas pelos de outro atlas. Note que, ao editar um TileMap, você pode substituir todas as células pelo valor correspondente mapeado.
ru: Создание прокси тайлов вручную может быть полезным, когда вы меняете идентификатор атласа или хотите заменить все тайлы из атласа на тайлы из другого атласа. Обратите внимание, что при редактировании TileMap вы можете заменить все ячейки на их соответствующие сопоставленные значения.
ta: நீங்கள் ஒரு அட்லச் ஐடியை மாற்றும்போது அல்லது ஒரு அட்லசிலிருந்து அனைத்து ஓடுகளையும் மற்றொரு அட்லசிலிருந்து மாற்ற விரும்பினால், ஓடு ப்ராக்சிகளை கைமுறையாக உருவாக்குவது பயனுள்ளதாக இருக்கும். ஒரு டில்மேப்பைத் திருத்தும் போது, எல்லா உயிரணுக்களையும் அவற்றின் தொடர்புடைய வரைபட மதிப்பால் மாற்றலாம் என்பதை நினைவில் கொள்க.
tr: Bir atlas kimliğini değiştirdiğinizde veya bir atlastaki tüm karoları başka bir atlastakilerle değiştirmek istediğinizde karo vekillerini elden oluşturmak yararlı olabilir. Bir TileMap düzenlerken, tüm hücreleri karşılık gelen eşlenmiş değerleriyle değiştirebileceğinizi unutmayın.
uk: Створення проксі плиток вручну може бути корисним, якщо ви змінили ідентифікатор атласу або хочете замінити всі плитки з атласу плитками з іншого атласу. Зауважте, що під час редагування TileMap ви можете замінити всі комірки відповідним відображеним значенням.
zh_tw: 當你變更圖集 ID 或想用某個圖集的所有圖塊取代另一個圖集時，手動建立圖塊代理就很有用。編輯 TileMap 時，也可將所有格子替換為對應的代理值。

source: Adding collision, navigation and occlusion to the TileSet
es: Añadiendo colisión, navegación y oclusión al TileSet
fr: Ajouter la collision, la navigation et l'occlusion au TileSet
ga: Imbhualadh, nascleanúint agus occlusion a chur leis an TileSet
ja: コリジョン、ナビゲーション、そしてオクルージョンを追加する
pt_br: Adicionando colisão, navegação e oclusão ao TileSet
ru: Добавление столкновений, навигации и окклюзии в TileSet
ta: டைல்செட்டில் மோதல், வழிசெலுத்தல் மற்றும் மறைவைச் சேர்ப்பது
tr: TileSet'e çarpışma, gezinti ve perdeleme ekleme
uk: Додавання колізій, навігації та оклюзії до TileSet
zh_tw: 向 TileSet 新增碰撞、導覽和遮擋

source: We've now successfully created a basic TileSet. We could start using it in the TileMapLayer node now, but it currently lacks any form of collision detection. This means the player and other objects could walk straight through the floor or walls.
pt_br: Agora criamos com sucesso um TileSet básico. Poderíamos começar a usá-lo no nó TileMapLayer agora, mas ele atualmente não possui nenhum tipo de detecção de colisão. Isso significa que o jogador e outros objetos poderiam atravessar o chão ou as paredes sem impedimento.
ru: Мы успешно создали базовый TileSet. Мы могли бы начать использовать его в узле TileMapLayer сейчас, но в настоящее время он не имеет никакой формы обнаружения столкновений. Это означает, что игрок и другие объекты могут проходить прямо сквозь пол или стены.
ta: நாங்கள் இப்போது ஒரு அடிப்படை டைல்செட்டை வெற்றிகரமாக உருவாக்கியுள்ளோம். நாங்கள் அதை இப்போது டிலேமாப்ளேயர் முனையில் பயன்படுத்தத் தொடங்கலாம், ஆனால் தற்போது அதற்கு எந்தவிதமான மோதல் கண்டறிதலும் இல்லை. இதன் பொருள் வீரர் மற்றும் பிற பொருள்கள் தரையில் அல்லது சுவர்கள் வழியாக நேராக நடக்க முடியும்.
uk: Тепер ми успішно створили базовий TileSet. Ми могли б почати використовувати його у вузлі TileMapLayer зараз, але наразі він не має жодної форми виявлення зіткнень. Це означає, що гравець та інші об’єкти можуть проходити прямо крізь підлогу чи стіни.
zh_tw: 我們現在已經成功建立了一個基本的圖塊集。我們現在可以在 TileMapLayer 節點中使用它了，但它目前缺乏任何形式的碰撞偵測。這表示玩家及其他物件會直接穿過地板或牆壁。

source: If you use :ref:`2D navigation <doc_navigation_overview_2d>`, you'll also need to define navigation polygons for tiles to generate a navigation mesh that agents can use for pathfinding.
es: Si usa :ref:`Navegación 2D <doc_navigation_overview_2d>`, también necesitará definir polígonos de navegación para los tiles para generar una malla de navegación que los agentes puedan usar para encontrar el camino.
fr: Si vous utilisez :ref:`la navigation 2D <doc_navigation_overview_2d>`, vous aurez également besoin de définir des polygones de navigation pour les tuiles afin de générer un maillage de navigation que les agents peuvent utiliser pour la recherche de chemin.
ga: Má úsáideann tú :ref:`loingseoireacht 2D <doc_navigation_overview_2d>`, beidh ort freisin polagáin nascleanúna a shainiú le haghaidh tíleanna chun mogalra nascleanúna a ghiniúint is féidir le gníomhairí a úsáid le haghaidh lorg braite.
ja: \ :ref:`2D navigation <doc_navigation_overview_2d>` を使う場合、経路探索エージェントが使うナビゲーションメッシュが必要なので、これを生成するためにタイルにナビゲーションポリゴンも定義する必要があります。
pt_br: Se você usar :ref:`navegação 2D <doc_navigation_overview_2d>`, também precisará definir polígonos de navegação para os tiles, a fim de gerar uma malha de navegação que os agentes possam usar para pathfinding.
ru: Если вы используете :ref:`2D-навигацию <doc_navigation_overview_2d>`, вам также потребуется определить навигационные полигоны для тайлов, чтобы создать навигационную сетку, которую агенты могут использовать для поиска пути.
ta: நீங்கள் பயன்படுத்தினால்: ref: `2 டி வழிசெலுத்தல் <doc_navigation_overview_2d>`, முகவர்கள் பாத்ஃபைண்டிங் பயன்படுத்தக்கூடிய வழிசெலுத்தல் கண்ணி உருவாக்க ஓடுகளுக்கான வழிசெலுத்தல் பலகோணங்களையும் வரையறுக்க வேண்டும்.
tr: :ref:`2B gezinti <doc_navigation_overview_2d>` kullanıyorsanız, vekillerin yol bulma için kullanabileceği bir gezinti örgüsü oluşturmak amacıyla karolar için gezinti çokgenleri tanımlamanız da gerekecektir.
uk: Якщо ви використовуєте :ref:`2D navigation <doc_navigation_overview_2d>`, вам також потрібно буде визначити полігони навігації для плиток, щоб створити сітку навігації, яку агенти зможуть використовувати для пошуку шляху.
zh_tw: 如果使用 :ref:`2D 導覽 <doc_navigation_overview_2d>`，還需要為圖塊定義導覽多邊形，以生成導覽網格，供代理用於尋路。

source: Lastly, if you use :ref:`doc_2d_lights_and_shadows` or GPUParticles2D, you may also want your TileSet to be able to cast shadows and collide with particles. This requires defining occluder polygons for "solid" tiles on the TileSet.
es: Por último, si utiliza :ref:`doc_2d_lights_and_shadows` o GPUParticles2D, es posible que también desee que su TileSet pueda proyectar sombras y colisionar con partículas. Esto requiere definir polígonos oclusores para los tiles "sólidos" en el TileSet.
fr: Enfin, si vous utilisez :ref:`doc_2d_lights_and_shadows` ou GPUParticles2D, vous pouvez également vouloir que votre TileSet puisse projeter des ombres et entrer en collision avec des particules. Cela nécessite de définir des polygones d'occlusion pour les tuiles "solides" sur le TileSet.
ga: Ar deireadh, má úsáideann tú: ref: `doc_2d_lights_and_shadows` nó GPUParticles2d, b'fhéidir gur mhaith leat freisin go mbeidh do TileSet in ann scáthanna a chaitheamh agus imbhualadh le cáithníní. Éilíonn sé seo polagáin occluder a shainiú le haghaidh tíleanna “soladacha” ar an TileSet.
ja: 最後に、 :ref:`doc_2d_lights_and_shadows` またはGPUParticles2Dを使う場合、TileSetに影を落とさせたりパーティクルとコリジョンさせたりしたい場面があるかもしれません。このためには、TileSet上でこのような動作をさせたい "solid" なタイルに、オクルーダーポリゴンを定義する必要があります。
pt_br: Por fim, se você usar :ref:`doc_2d_lights_and_shadows` ou GPUParticles2D, talvez também queira que seu TileSet consiga projetar sombras e colidir com partículas. Isso requer a definição de polígonos de oclusão para os tiles "sólidos" no TileSet.
ru: Наконец, если вы используете :ref:`doc_2d_lights_and_shadows` или GPUParticles2D, вы также можете захотеть, чтобы ваш TileSet мог отбрасывать тени и сталкиваться с частицами. Для этого требуется определить полигоны окклюдера для «сплошных» тайлов в TileSet.
ta: கடைசியாக, நீங்கள் பயன்படுத்தினால்: ref: `doc_2d_lights_and_shadows` அல்லது gpuparticles2d, உங்கள் டைல்செட் நிழல்களைத் தூக்கி எறிந்து துகள்களுடன் மோதிக் கொள்ள வேண்டும். இதற்கு டைல்செட்டில் "திட" ஓடுகளுக்கு மறைமுக பலகோணங்களை வரையறுக்க வேண்டும்.
tr: Son olarak, :ref:`doc_2d_lights_and_shadows` veya GPUParticles2D kullanıyorsanız, TileSet'inizin gölge oluşturabilmesini ve parçacıklarla çarpışabilmesini de isteyebilirsiniz. Bu, TileSet üzerindeki "katı" karolar için perdeleyici çokgenlerin tanımlanmasını gerektirir.
uk: Нарешті, якщо ви використовуєте :ref:`doc_2d_lights_and_shadows` або GPUParticles2D, ви також можете захотіти, щоб ваш TileSet міг відкидати тіні та стикатися з частинками. Для цього потрібно визначити полігони оклюдера для «суцільних» плиток у TileSet.
zh_tw: 最後，如果你使用 :ref:`doc_2d_lights_and_shadows` 或 GPUParticles2D，你可能還希望 TileSet 能夠投射陰影並與粒子碰撞。這就需要為 TileSet 上的 “實體” 圖塊定義遮擋多邊形。

source: To be able to define collision, navigation and occlusion shapes for each tile, you will need to create a physics, navigation or occlusion layer for the TileSet resource first. To do so, select the TileMapLayer node, click the TileSet property value in the inspector to edit it then unfold **Physics Layers** and choose **Add Element**:
pt_br: Para poder definir formas de colisão, navegação e oclusão para cada tile, você precisará criar primeiro uma camada de física, navegação ou oclusão para o recurso TileSet. Para isso, selecione o nó TileMapLayer, clique no valor da propriedade TileSet no inspetor para editá-lo e, em seguida, expanda **Camadas de Física** e escolha **Adicionar Elemento**:
ru: Чтобы иметь возможность определять формы столкновения, навигации и окклюзии для каждого тайла, вам сначала нужно будет создать слой физики, навигации или окклюзии для ресурса TileSet. Для этого выберите узел TileMapLayer, щелкните значение свойства TileSet в инспекторе, чтобы отредактировать его, затем разверните **Physics Layers** и выберите **Add Element**:
ta: ஒவ்வொரு ஓடுக்கும் மோதல், வழிசெலுத்தல் மற்றும் மறைவு வடிவங்களை வரையறுக்க, நீங்கள் முதலில் டைல்செட் வளத்திற்கான இயற்பியல், வழிசெலுத்தல் அல்லது மறைவு அடுக்கை உருவாக்க வேண்டும். அவ்வாறு செய்ய, டிலேமாபிளேயர் முனையைத் தேர்ந்தெடுத்து, அதைத் திருத்த இன்ச்பெக்டரில் உள்ள டைல்செட் சொத்து மதிப்பைக் சொடுக்கு செய்து பின்னர் ** இயற்பியல் அடுக்குகள் ** மற்றும் ** உறுப்பைச் சேர் **:
uk: Щоб мати можливість визначати форми зіткнення, навігації та оклюзії для кожної плитки, вам потрібно спочатку створити фізичний, навігаційний або оклюзійний шар для ресурсу TileSet. Для цього виберіть вузол TileMapLayer, клацніть значення властивості TileSet в інспекторі, щоб відредагувати його, потім розгорніть **Physics Layers** і виберіть **Add Element**:
zh_tw: 若要能夠定義每個圖塊的碰撞、導航和遮擋形狀，您首先需要為圖塊集資源建立一個物理、導航或遮擋圖層。若要這麼做，請選取 TileMapLayer 節點，在屬性檢視器中按一下圖塊集屬性值進行編輯，然後展開 **物理圖層** 並選擇 **新增元素**：

source: Creating a physics layer in the TileSet resource inspector (within the TileMapLayer node)
pt_br: Criando uma camada física no Inspetor de recursos do TileSet (dentro do nó TileMapLayer)
ru: Создание физического слоя в инспекторе ресурсов TileSet (внутри узла TileMapLayer)
ta: டைல்செட் வள இன்ச்பெக்டரில் இயற்பியல் அடுக்கை உருவாக்குதல் (டில்மேபிளேயர் முனைக்குள்)
uk: Створення фізичного шару в інспекторі ресурсів TileSet (у вузлі TileMapLayer)
zh_tw: 在圖塊集資源屬性檢視器中建立物理圖層 (於 TileMapLayer 節點內)

source: If you also need navigation support, now is a good time to create a navigation layer:
es: Si también necesitas soporte de navegación, ahora es un buen momento para crear una capa de navegación:
fr: Si vous avez également besoin de supporter la navigation, c'est maintenant un bon moment pour créer un calque de navigation :
ga: Má theastaíonn tacaíocht nascleanúna uait freisin, is am maith anois ciseal nascleanúna a chruthú:
ja: ナビゲーションもサポートしたいなら、今がナビゲーションレイヤーを作るのにちょうどいいタイミングです:
pt_br: Se você também precisa de suporte à navegação, agora é um bom momento para criar uma camada de navegação:
ru: Если вам также нужна поддержка навигации, то сейчас подходящее время создать слой навигации:
ta: உங்களுக்கு வழிசெலுத்தல் உதவி தேவைப்பட்டால், வழிசெலுத்தல் அடுக்கை உருவாக்க இது ஒரு நல்ல நேரம்:
tr: Gezinti desteğine de ihtiyacınız varsa, bir gezinti katmanı oluşturmak için şimdi iyi bir zaman:
uk: Якщо вам також потрібна підтримка навігації, зараз саме час створити шар навігації:
zh_tw: 如果你還需要導覽輔助，可以建立導覽層：

source: Creating a navigation layer in the TileSet resource inspector (within the TileMapLayer node)
pt_br: Criando uma camada de navegação no Inspetor de recursos do TileSet (dentro do nó TileMapLayer)
ru: Создание слоя навигации в инспекторе ресурсов TileSet (внутри узла TileMapLayer)
ta: டைல்செட் வள இன்ச்பெக்டரில் (டைல்மேபிளேயர் முனைக்குள்) வழிசெலுத்தல் அடுக்கை உருவாக்குதல்
uk: Створення шару навігації в інспекторі ресурсів TileSet (у вузлі TileMapLayer)
zh_tw: 在 TileSet 資源屬性檢視器 (在 TileMapLayer 節點內部) 中建立導航圖層

source: If you need support for light polygon occluders, now is a good time to create an occlusion layer:
es: Si necesita soporte para oclusión de polígonos de luz, ahora es un buen momento para crear una capa de oclusión:
ga: Má theastaíonn tacaíocht uait d'occlúdaithe polagón éadroma, is am maith anois ciseal occlusion a chruthú:
ja: 光のポリゴンオクルージョンもサポートしたいなら、今がオクルージョンレイヤーを作るのにちょうどいいタイミングです:
pt_br: Se você precisar de suporte para oclusores de polígonos leves, agora é um bom momento para criar uma camada de oclusão:
ru: Если вам нужна поддержка окклюдеров светлых полигонов, сейчас самое время создать слой окклюзии:
ta: ஒளி பலகோண மறைமுகங்களுக்கு உங்களுக்கு உதவி தேவைப்பட்டால், இப்போது ஒரு அடுக்கை உருவாக்க ஒரு நல்ல நேரம் இது:
tr: Işık çokgen perdeleyiciler için desteğe ihtiyacınız varsa, şimdi bir perdeleme katmanı (İşleme altında) oluşturmak için iyi bir zaman:
uk: Якщо вам потрібна підтримка світлових полігональних оклюдерів, зараз саме час створити оклюзійний шар:
zh_tw: 如果你需要支援光照多邊形遮擋器，可以建立遮擋層：

source: Creating an occlusion layer in the TileSet resource inspector (within the TileMapLayer node)
it: Creazione di un livello di occlusione nell'ispettore delle risorse TileSet (all'interno del nodo TileMapLayer)
pt_br: Criando uma camada de oclusão no Inspetor de recursos do TileSet (dentro do nó TileMapLayer)
ru: Создание слоя окклюзии в инспекторе ресурсов TileSet (внутри узла TileMapLayer)
ta: டைல்செட் வள இன்ச்பெக்டரில் (டைல்மாபிளேயர் முனைக்குள்) ஒரு மறைவு அடுக்கை உருவாக்குதல்
uk: Створення шару оклюзії в інспекторі ресурсів TileSet (у вузлі TileMapLayer)
zh_tw: 在 TileMapLayer 節點內的圖塊集資源屬性檢視器中建立遮擋圖層

source: Future steps in this tutorial are tailored to creating collision polygons, but the procedure for navigation and occlusion is very similar. Their respective polygon editors behave in the same way, so these steps are not repeated for brevity.
es: Los pasos siguientes de este tutorial están pensados para crear polígonos de colisión, pero el procedimiento de navegación y oclusión es muy similar. Sus respectivos editores de polígonos se comportan de la misma manera, por lo que no se repiten estos pasos para abreviar.
ga: Tá céimeanna amach anseo sa rang teagaisc seo in oiriúint chun polagóin imbhuailte a chruthú, ach tá an nós imeachta maidir le nascleanúint agus occlusion an-chosúil. Iompraíonn a n-eagarthóirí polagón faoi seach ar an mbealach céanna, mar sin ní dhéantar na céimeanna seo a athdhéanamh le haghaidh gairid.
ja: このチュートリアルの今後の手順はコリジョンポリゴンの作成に合わせたものですが、ナビゲーションとオクルージョンの手順は非常に似ています。それぞれのポリゴンエディタは同じように動作するので、簡潔にするためにこれらの手順は繰り返しません。
pt_br: Os próximos passos deste tutorial são voltados para a criação de polígonos de colisão, mas o procedimento para navegação e oclusão é muito similar. Seus respectivos editores de polígonos funcionam da mesma forma, por isso esses passos não são repetidos para manter a objetividade.
ru: Дальнейшие шаги в этом руководстве предназначены для создания полигонов столкновений, но процедура навигации и окклюзии очень похожа. Их соответствующие редакторы полигонов ведут себя одинаково, поэтому эти шаги не повторяются для краткости.
ta: இந்த டுடோரியலின் எதிர்கால படிகள் மோதல் பலகோணங்களை உருவாக்குவதற்கு வடிவமைக்கப்பட்டுள்ளன, ஆனால் வழிசெலுத்தல் மற்றும் மறைவுக்கான செயல்முறை மிகவும் ஒத்திருக்கிறது. அந்தந்த பலகோண ஆசிரியர்கள் அதே வழியில் நடந்துகொள்கிறார்கள், எனவே இந்த படிகள் சுருக்கத்திற்காக மீண்டும் செய்யப்படுவதில்லை.
tr: Bu eğitimin ileriki adımları çarpışma çokgenleri oluşturmaya yöneliktir, ancak gezinti ve perdeleme için adımlar çok benzerdir. Bunların çokgen düzenleyicileri de aynı şekilde davranır, bu nedenle bu adımlar kısalık için tekrarlanmamıştır.
uk: Подальші кроки в цьому посібнику спрямовані на створення багатокутників зіткнення, але процедура навігації та оклюзії дуже схожа. Їх відповідні редактори багатокутників поводяться так само, тому ці кроки не повторюються для стислості.
zh_tw: 本教學的後續步驟專門用於建立碰撞多邊形，但導覽和遮擋的步驟非常相似。它們各自的多邊形編輯器行為方式相同，因此為簡潔起見不再重複這些步驟。

source: The only caveat is that the tile's occlusion polygon property is part of a **Rendering** subsection in the atlas inspector. Make sure to unfold this section so you can edit the polygon.
es: La única salvedad es que la propiedad del polígono de oclusión del tile es parte de la subsección **Renderizado** en el inspector del atlas. Asegúrese de desplegar esta sección para poder editar el polígono.
ga: Is é an t-aon rabhadh ná gur cuid d'fho-alt **Rendering** sa chigire atlas é maoin polagán oclúcháin an tíl. Déan cinnte an chuid seo a oscailt ionas gur féidir leat an polagún a chur in eagar.
ja: 唯一の注意点は、タイルのオクルージョンポリゴンのプロパティはアトラスインスペクタの **レンダリング** サブセクションの一部になっていることです。ポリゴンを編集できるように、必ずこのセクションを展開してください。
pt_br: A única observação é que a propriedade de polígono de oclusão do tile fica em uma subseção **Renderização** no Inspetor do atlas. Certifique-se de expandir essa seção para poder editar o polígono.
ru: Единственное предостережение заключается в том, что свойство окклюзивного полигона тайла является частью подраздела **Rendering** в инспекторе атласа. Обязательно разверните этот раздел, чтобы иметь возможность редактировать полигон.
ta: ஒரே எச்சரிக்கை என்னவென்றால், டைலின் மறைவு பலகோண சொத்து அட்லச் இன்ச்பெக்டரில் ** வழங்குதல் ** துணைப்பிரிவின் ஒரு பகுதியாகும். இந்த பகுதியை வெளிப்படுத்துவதை உறுதிசெய்து கொள்ளுங்கள், இதனால் நீங்கள் பலகோணத்தைத் திருத்தலாம்.
tr: Tek uyarı, karonun perdeleme çokgeni özelliğinin atlas denetleyicisindeki **İşleme** alt bölümünün bir parçası olmasıdır. Çokgeni düzenleyebilmek için bu bölümü açtığınızdan emin olun.
uk: Єдине застереження полягає в тому, що властивість багатокутника оклюзії плитки є частиною підрозділу **Відтворення** в інспекторі атласу. Обов’язково розгорніть цей розділ, щоб ви могли редагувати багатокутник.
zh_tw: 唯一需要注意的是，圖塊的遮擋多邊形屬性是合集屬性檢視器中 **算繪** 分節的一部分。請確保展開該部分，以便編輯多邊形。

source: After creating a physics layer, you have access to the **Physics Layer** section in the TileSet atlas inspector:
es: Después de crear una capa de física, tendrá acceso a la sección **Capa Física** en el inspector del atlas de TileSet:
fr: Après avoir créé un calque de physique, vous avez accès à la section **Calque de physique** dans l'inspecteur d'atlas TileSet :
ga: Tar éis duit ciseal fisice a chruthú, tá rochtain agat ar an rannát**Sraith Fisice** sa chigire atlas TileSet:
ja: 物理レイヤーを作成すると、TileSetアトラスインスペクタの **Physics Layer** セクションにアクセスできるようになります:
pt_br: Após criar uma camada de física, você terá acesso à seção **Camada de Física** no Inspetor de atlas do TileSet:
ru: После создания физического слоя у вас появится доступ к разделу **Физический слой** в инспекторе атласа TileSet:
ta: இயற்பியல் அடுக்கை உருவாக்கிய பிறகு, டைல்செட் அட்லச் இன்ச்பெக்டரில் ** இயற்பியல் அடுக்கு ** பிரிவுக்கு அணுகல் உள்ளது:
tr: Bir fizik katmanı oluşturduktan sonra, TileSet atlas denetleyicisindeki **Fizik Katmanı** bölümüne erişebilirsiniz:
uk: Після створення фізичного шару ви маєте доступ до розділу **Physics Layer** в інспекторі атласу TileSet:
zh_tw: 建立實體層後，你可以存取 TileSet 合集屬性檢視器中的 **實體層** 部分：

source: Opening the collision editor while in Select mode
es: Apertura del editor de colisiones mientras está en el modo Seleccionar
ga: An t-eagarthóir imbhuailte a oscailt agus tú i mód
ja: 選択モードからコリジョンエディタを開く
pt_br: Abrindo o editor de colisão no modo Selecionar
ru: Открытие редактора столкновений в режиме Select
ta: தேர்ந்தெடுக்கப்பட்ட பயன்முறையில் இருக்கும்போது மோதல் எடிட்டரைத் திறக்கும்
tr: Seçim modundayken çarpışma düzenleyicisini açma
uk: Відкриття редактора колізій у режимі вибору
zh_tw: 在選擇模式下打開碰撞編輯器
