Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: Creating an alternative tile by right-clicking a base tile in the TileSet editor
es: Crear un tile alternativo al hacer clic derecho en un tile base en el editor de TileSet
fr: Créer une tuile alternative en faisant un clic droit sur une tuile de base dans l'éditeur TileSet
ga: Tíl mhalartach a chruthú trí chliceáil ar dheis ar bhonn tíl san eagarthóir TileSet
ja: TileSetエディタでベースタイルを右クリックし、代替タイルを作成
pt_br: Criando um tile alternativo ao clicar com o botão direito em um tile base no editor de TileSet
ru: Создание альтернативного тайла путем щелчка правой кнопкой мыши по базовому тайлу в редакторе TileSet
ta: டைல்செட் எடிட்டரில் ஒரு அடிப்படை ஓலை வலது சொடுக்கு செய்வதன் மூலம் மாற்று ஓடுகளை உருவாக்குதல்
tr: TileSet düzenleyicisinde bir temel karoya sağ tıklayarak alternatif bir karo oluşturma
uk: Створення альтернативної плитки шляхом клацання правою кнопкою миші основної плитки в редакторі TileSet
zh_tw: 在 TileSet 編輯器中按右鍵基礎圖塊建立替代圖塊

source: If currently in Select mode, the alternative tile will already be selected for editing. If not currently in Select mode, you can still create alternative tiles, but you will need to switch to Select mode and select the alternative tile to edit it.
es: Si se encuentra en el modo Seleccionar, el tile alternativo ya estará seleccionado para su edición. Si no se encuentra en el modo Seleccionar, podrá crear tiles alternativos, pero tendrá que cambiar al modo Seleccionar y seleccionar el tile alternativo para editarlo.
fr: Si actuellement en mode Sélectionner, la tuile alternative sera déjà sélectionnée pour l'édition. Si vous n'êtes pas actuellement en mode Sélectionner, vous pouvez toujours créer des tuiles alternatives, mais vous aurez besoin de passer en mode Sélectionnez et sélectionner la tuile alternative pour la modifier.
ga: Má tá sé i mód Roghnaigh faoi láthair, roghnófar an tíl malartach cheana féin le haghaidh eagarthóireachta. Mura bhfuil sé i mód Roghnaigh faoi láthair, is féidir leat tíleanna malartacha a chruthú fós, ach beidh ort aistriú go Roghnaigh mód agus an tíl mhalartach a roghnú chun é a chur in eagar.
ja: 現在 **選択モード (Select mode)** にいる場合、代替タイルはすでに編集用に選択されています。選択モードにいない場合でも代替タイルを作成できますが、 **選択モード** に切り替えて代替タイルを選択し、編集する必要があります。
pt_br: Se estiver no modo Seleção, o tile alternativo já estará selecionado para edição. Se não estiver no modo Seleção, ainda é possível criar tiles alternativos, mas você precisará mudar para o modo Seleção e selecionar o tile alternativo para editá-lo.
ru: Если вы находитесь в режиме Select, альтернативный тайл уже будет выбран для редактирования. Если вы не находитесь в режиме выбора, вы все равно можете создавать альтернативные тайлы, но вам нужно будет переключиться в режим Select и выбрать альтернативный тайл, чтобы редактировать его.
ta: தற்போது தேர்ந்தெடுக்கப்பட்ட பயன்முறையில் இருந்தால், மாற்று ஓடு ஏற்கனவே திருத்துவதற்கு தேர்ந்தெடுக்கப்படும். தற்போது தேர்ந்தெடுக்கப்பட்ட பயன்முறையில் இல்லாவிட்டால், நீங்கள் இன்னும் மாற்று ஓடுகளை உருவாக்கலாம், ஆனால் நீங்கள் தேர்ந்தெடுக்கப்பட்ட பயன்முறைக்கு மாற வேண்டும் மற்றும் அதைத் திருத்த மாற்று ஓடுகளைத் தேர்ந்தெடுக்க வேண்டும்.
tr: O anda Seç modundaysanız, alternatif karo düzenleme için zaten seçili olacaktır. Şu anda Seç modunda değilseniz, yine de alternatif karolar oluşturabilirsiniz, ancak düzenlemek için Seç moduna geçmeniz ve alternatif karoyu seçmeniz gerekecektir.
uk: Якщо наразі в режимі вибору, альтернативну плитку вже буде вибрано для редагування. Якщо ви зараз не перебуваєте в режимі вибору, ви можете створювати альтернативні плитки, але вам потрібно буде перейти в режим вибору та вибрати альтернативну плитку, щоб редагувати її.
zh_tw: 如果目前處於“選擇”模式，則可編輯已選中的備選圖塊。如果目前不在“選擇”模式下，你仍然可以建立備選圖塊，但需要切換到“選擇”模式並選擇備選圖塊進行編輯。

source: If you don't see the alternative tile, pan over to the right of the atlas image, as alternative tiles always appear on the right of base tiles of a given atlas in the TileSet editor:
es: Si no ves el tile alternativo, desplázate a la derecha de la imagen del atlas, ya que los tiles alternativos siempre aparecen a la derecha de los tiles base de un atlas determinado en el editor TileSet:
fr: Si vous ne voyez pas la tuile alternative, déplacez vous sur la droite de l'image de l'atlas, car les tuiles alternatives apparaissent toujours à droite des tuiles de base d'un atlas donné dans l'éditeur TileSet :
ga: Mura bhfeiceann tú an tíl mhalartach, téigh ar thaobh na láimhe deise den íomhá atlas, mar tá tíleanna malartacha le feiceáil i gcónaí ar dheis tíleanna bonn atlas áirithe san eagarthóir TileSet:
ja: 代替タイルは指定されたアトラスの中で常に基本タイルの右側に表示されるので、代替タイルが表示されない場合はタイルセットエディタ内でアトラス画像を右側にパンしてください:
pt_br: Se você não encontrar o tile alternativo, deslize a visualização para a direita da imagem do atlas, pois os tiles alternativos sempre aparecem à direita dos tiles base de um determinado atlas no editor de TileSet:
ru: Если вы не видите альтернативный тайл, переместитесь вправо от изображения атласа, поскольку альтернативные тайлы всегда отображаются справа от базовых тайлов данного атласа в редакторе TileSet:
ta: மாற்று ஓடுகளை நீங்கள் காணவில்லை என்றால், அட்லச் படத்தின் வலதுபுறத்தில் பான், ஏனெனில் மாற்று ஓடுகள் எப்போதும் டைல்செட் எடிட்டரில் கொடுக்கப்பட்ட அட்லசின் அடிப்படை ஓடுகளின் வலதுபுறத்தில் தோன்றும்:
tr: Alternatif karoyu göremiyorsanız, atlas görüntüsünün sağına kaydırın, çünkü alternatif karolar TileSet düzenleyicisinde her zaman belirli bir atlasın temel karolarının sağ tarafında görünür:
uk: Якщо ви не бачите альтернативної плитки, перемістіть праворуч від зображення атласу, оскільки альтернативні плитки завжди з’являються праворуч від базових плиток певного атласу в редакторі TileSet:
zh_tw: 如果看不到備選圖塊，請平移到合集圖像的右側，因為在 TileSet 編輯器中，備選圖塊總是出現在給定合集基礎圖塊的右側：

source: Configuring an alternative tile after clicking it in the TileSet editor
es: Configurando un tile alternativo después de hacer clic en él en el editor de TileSet
fr: Configuration d'une tuile alternative après l'avoir cliqué dans l'éditeur TileSet
ga: Tíl mhalartach a chumrú tar éis é a chliceáil san eagarthóir TileSet
ja: TileSetエディタでクリックして代替タイルを設定
pt_br: Configurando um tile alternativo após clicá-lo no editor de TileSet
ru: Настройка альтернативного тайла после щелчка по нему в редакторе TileSet
ta: மாற்று ஓலை டைல்செட் எடிட்டரில் சொடுக்கு செய்த பிறகு கட்டமைத்தல்
tr: TileSet düzenleyicisinde tıkladıktan sonra alternatif bir karoyu yapılandırma
uk: Налаштування альтернативної плитки після клацання її в редакторі TileSet
zh_tw: 在 TileSet 編輯器中按一下替代圖塊後配置它

source: After selecting an alternative tile, you can change any properties using the middle column like you would on a base tile. However, the list of exposed properties is different compared to base tiles:
es: Después de seleccionar un tile alternativo, puedes cambiar cualquier propiedad usando la columna central como lo harías en un tile base. No obstante, la lista de propiedades mostradas es diferente en comparación a los tiles base:
fr: Après avoir sélectionné une tuile alternative, vous pouvez changer toutes les propriétés en utilisant la colonne du milieu comme vous le feriez sur une tuile de base. Cependant, la liste des propriétés exposées est différente par rapport aux tuiles de base :
ga: Tar éis duit tíl mhalartach a roghnú, is féidir leat aon airíonna a athrú ag baint úsáide as an gcolún lár mar a dhéanfá ar bhonn tíl. Mar sin féin, tá liosta na n-airíonna nochtaithe difriúil i gcomparáid le tíleanna bonn:
ja: 代替タイルを選択した後、どのプロパティを中央列でベースタイルにしたように変更できます。ただし、表示されるプロパティの一覧は基本タイルとは異なります:
pt_br: Após selecionar um tile alternativo, você pode alterar quaisquer propriedades usando a coluna do meio, da mesma forma que faria em um tile base. No entanto, a lista de propriedades expostas é diferente em comparação com os tiles base:
ru: После выбора альтернативного тайла вы можете изменить любые свойства, используя средний столбец, как и на базовом тайле. Однако список выставленных свойств отличается от базовых тайлов:
ta: மாற்று ஓடுகளைத் தேர்ந்தெடுத்த பிறகு, நீங்கள் ஒரு அடிப்படை ஓடு போன்ற நடுத்தர நெடுவரிசையைப் பயன்படுத்தி எந்த பண்புகளையும் மாற்றலாம். இருப்பினும், அடிப்படை ஓடுகளுடன் ஒப்பிடும்போது வெளிப்படும் பண்புகளின் பட்டியல் வேறுபட்டது:
tr: Alternatif bir karo seçtikten sonra, temel karoda yaptığınız gibi orta sütunu kullanarak herhangi bir özelliği değiştirebilirsiniz. Ancak, kullanıma açık özelliklerin listesi temel karolara kıyasla farklıdır:
uk: Після вибору альтернативної плитки ви можете змінити будь-які властивості за допомогою середнього стовпця, як і на базовій плитці. Однак список відкритих властивостей відрізняється від базової плитки:
zh_tw: 選擇備選圖塊後，你可以使用中間一列更改任何屬性，就像在基礎圖塊上一樣。但暴露的屬性列表與基礎圖塊不同：

source: **Alternative ID:** The unique numerical identifier for this alternative tile. Changing it will break existing TileMaps, so be careful! This ID also controls the sorting in the list of alternative tiles displayed in the editor.
es: **Alternative ID:** El identificador numérico único para este tile alternativo. Cambiarlo romperá los TileMaps existentes, ¡así que ten cuidado! Este ID también controla el orden en la lista de tiles alternativos mostrados en el editor.
fr: **ID alternatif :** L'identifiant numérique unique pour cette tuile alternative. Le changer va casser les TileMaps existantes, alors soyez prudent ! Cet ID contrôle également le tri dans la liste des tuiles alternatives affichées dans l'éditeur.
ga: **ID Malartach: ** An t-aitheantóir uimhriúil uathúil don tíl mhalartach seo. Brisfidh sé á athrú TileMaps atá ann cheana féin, mar sin bí cúramach! Rialaíonn an t-aitheantas seo an sórtáil sa liosta tíleanna malartacha a thaispeántar san eagarthóir freisin.
ja: \ **Alternative ID:** この代替タイルに固有の数値識別子です。これを変更すると既存の TileMap を破損する可能性があるため、注意してください! この ID は、エディタで表示される代替タイル一覧の並び順も制御します。
pt_br: **Alternative ID:** O identificador numérico único para este tile alternativo. Alterá-lo irá quebrar TileMaps existentes, portanto tenha cuidado! Este ID também controla a ordenação na lista de tiles alternativos exibida no editor.
ru: **Альтернативный ID:** Уникальный числовой идентификатор для этого альтернативного тайла. Его изменение сломает существующие TileMaps, поэтому будьте осторожны! Этот ID также управляет сортировкой в списке альтернативных тайлов, отображаемых в редакторе.
ta: ** மாற்று ஐடி: ** இந்த மாற்று ஓடுக்கான தனித்துவமான எண் அடையாளங்காட்டி. அதை மாற்றுவது ஏற்கனவே இருக்கும் டில்மாப்களை உடைக்கும், எனவே கவனமாக இருங்கள்! இந்த ஐடி எடிட்டரில் காட்டப்படும் மாற்று ஓடுகளின் பட்டியலில் வரிசையாக்கத்தையும் கட்டுப்படுத்துகிறது.
tr: **Alternatif ID:** Bu alternatif karo için benzersiz sayısal kimlik. Bunu değiştirmek mevcut karo haritalarını bozacaktır, bu yüzden dikkatli olun! Bu ID aynı zamanda düzenleyicide görüntülenen alternatif karolar listesindeki sıralamayı da kontrol eder.
uk: **Альтернативний ідентифікатор:** унікальний числовий ідентифікатор для цієї альтернативної плитки. Його зміна пошкодить наявні TileMaps, тому будьте обережні! Цей ідентифікатор також керує сортуванням у списку альтернативних плиток, що відображається в редакторі.
zh_tw: **備用 ID：** 此可選圖塊的唯一數位識別碼符。更改它會破壞現有的瓦片地圖，所以要小心！此 ID 還控制在編輯器中顯示的可選圖塊列表中的排序。

source: **Rendering > Flip H:** If ``true``, the tile is horizontally flipped.
es: **Rendering > Flip H:** If ``true``, el tile se voltea horizontalmente.
ga: ** Rindreáil > Smeach H:** Más ``fíor``, iompaithe go cothrománach ar an tíl.
ja: \ **レンダリング > Flip H:** `true` の場合、タイルが水平方向に反転します。
pt_br: **Rendering > Flip H:** Se ``true``, o tile é espelhado horizontalmente.
ru: **Rendering > Flip H:** Если ``true`` - тайл будет отражаться по горизонтали.
ta: ** ரெண்டரிங்> ஃபிளிப் எச்: ** `` உண்மை` `என்றால், ஓடு கிடைமட்டமாக புரட்டப்படுகிறது.
tr: **İşleme > Ters Çevir Yatay:** ``true`` ise, karo yatay olarak çevrilir.
uk: **Візуалізація > Flip H:** Якщо ``true``, плитка перевертається горизонтально.
zh_tw: **Rendering > Flip H:** 如果為``true``，則圖塊水平翻轉。

source: **Rendering > Flip V:** If ``true``, the tile is vertically flipped.
es: **Rendering > Flip V:** If ``true``, el tile se voltea verticalmente.
ga: ** Rindreáil > Smeach V:** Más ``fíor``, déantar an tíl a smeach go hingearach.
ja: \ **レンダリング > Flip V:** `true` の場合、タイルが垂直方向に反転します。
pt_br: **Rendering > Flip V:** Se ``true``, o tile é espelhado verticalmente.
ru: **Rendering > Flip V:** Если ``true`` - тайл будет отражаться по вертикали.
ta: ** ரெண்டரிங்> ஃபிளிப் வி: ** `` உண்மை` `என்றால், ஓடு செங்குத்தாக புரட்டப்படுகிறது.
tr: **İşleme > Ters Çevir Dikey:** ``true`` ise, karo dikey olarak çevrilir.
uk: **Візуалізація > Flip V:** Якщо ``true``, плитка перевертається вертикально.
zh_tw: **Rendering > Flip V:** 如果為``true``，則磁貼垂直翻轉。

source: **Rendering > Transpose:** If ``true``, the tile is rotated 90 degrees *counter-clockwise* and then flipped vertically. In practice, this means that to rotate a tile by 90 degrees clockwise without flipping it, you should enable **Flip H** and **Transpose**. To rotate a tile by 180 degrees clockwise, enable **Flip H** and **Flip V**. To rotate a tile by 270 degrees clockwise, enable **Flip V** and **Transpose**.
es: **Rendering > Transpose:** Si es ``true``, el tile es rotado 90 grados *en sentido antihorario* y después volteado verticalmente. En la práctica esto supone rotar un tile 90 grados en sentido horario sin voltearlo, deberías habilitar **Flip H** y **Transpose**. Para rotar un tile 180 grados en sentido horario, habilita **Flip H** y **Flip V**. Para rotar un tile 270 grados en sentido horario, habilita **Flip V** y **Transpose**.
ga: ** Rindreáil > Trasnaigh:** Más ``fíor``, rothlaíonn an tíl 90 céim *go tuathalach* agus ansin iompaithe go hingearach é. Go praiticiúil, ciallaíonn sé seo gur cheart duit ** Smeach H** agus **Transpose** a chumasú chun tíl a rothlú 90 céim deiseal gan é a smeach. Chun tíl a rothlú 180 céim deiseal, cumasaigh **Smeach H** agus **Smeach V**. Chun tíl a rothlú 270 céim deiseal, cumasaigh **Smeach V** agus **Transpose**.
ja: **レンダリング > Transpose:** `true` の場合、タイルが90度 *反時計回りに* 回転し、その後垂直方向に反転します。タイルを90度時計回りに回転させたい場合には、 **Flip H** と **Transpose** を有効にします。タイルを180度時計回りに回転させるには **Flip H** と **Flip V** を有効にします。タイルを270度時計回りに回転させるには **Flip V** と **Transpose** を有効にします。
pt_br: **Rendering > Transpose:** Se ``true``, o tile é rotacionado 90 graus *no sentido anti-horário* e, em seguida, espelhado verticalmente. Na prática, isso significa que, para rotacionar um tile em 90 graus no sentido horário sem espelhá-lo, você deve ativar **Flip H** e **Transpose**. Para rotacionar um tile em 180 graus no sentido horário, ative **Flip H** e **Flip V**. Para rotacionar um tile em 270 graus no sentido horário, ative **Flip V** e **Transpose**.
ru: **Rendering > Transpose:** Если ``true``, тайл поворачивается на 90 градусов *против часовой стрелки*, а затем отражается вертикально. На практике это означает, что для поворота тайла на 90 градусов по часовой стрелке без переворота следует включить **Flip H** и **Transpose**. Чтобы повернуть тайл на 180 градусов по часовой стрелке, следует включить **Flip H** и **Flip V**. Чтобы повернуть тайл на 270 градусов по часовой стрелке, следует включить **Flip V** и **Transpose**.
ta: ** ரெண்டரிங்> இடமாற்றம்: ** `` உண்மை` `என்றால், ஓடு 90 டிகிரி*எதிர்-கடிகார திசையில் சுழற்றப்பட்டு பின்னர் செங்குத்தாக புரட்டப்பட்டது. நடைமுறையில், இதன் பொருள் ஒரு ஓடு 90 டிகிரி கடிகார திசையில் புரட்டாமல், நீங்கள் ** ஃபிளிப் எச் ** மற்றும் ** இடமாற்றம் ** ஐ இயக்க வேண்டும். ஒரு ஓடு 180 டிகிரி கடிகார திசையில் சுழற்ற, ** ஃபிளிப் எச் ** மற்றும் ** ஃபிளிப் வி ** ஐ இயக்கவும். ஒரு ஓடு 270 டிகிரி கடிகார திசையில் சுழற்ற, ** ஃபிளிப் வி ** மற்றும் ** இடமாற்றம் ** ஐ இயக்கவும்.
tr: **İşleme > Tersini Al:** Eğer ``true`` ise, karo 90 derece *saat yönünün tersine* döndürülür ve ardından dikey olarak ters çevrilir. Pratikte bu, bir karoyu çevirmeden saat-yönünde 90 derece döndürmek için **Ters Çevir Yatay** ve **Tersini Al** seçeneklerini etkinleştirmeniz gerektiği anlamına gelir. Bir karoyu saat yönünde 180 derece döndürmek için **Ters Çevir Yatay** ve **Ters Çevir Dikey** ögelerini etkinleştirin. Bir karoyu saat yönünde 270 derece döndürmek için **Ters Çevir Dikey** ve **Tersini Al** ögelerini etkinleştirin.
uk: **Відтворення > Транспонування:** якщо ``true``, плитка повертається на 90 градусів *проти годинникової стрілки*, а потім перевертається вертикально. На практиці це означає, що щоб повернути плитку на 90 градусів за годинниковою стрілкою, не перевертаючи її, вам слід увімкнути **Flip H** і **Transpose**. Щоб повернути плитку на 180 градусів за годинниковою стрілкою, увімкніть **Flip H** і **Flip V**. Щоб повернути плитку на 270 градусів за годинниковою стрілкою, увімкніть **Фліп V** і **Транспонування**.
zh_tw: **Rendering > Transpose：**若設為 ``true``，圖塊會先逆時針旋轉 90 度，再垂直翻轉。實際應用上，若要將圖塊順時針旋轉 90 度但不翻轉，請同時啟用 **Flip H** 及 **Transpose**。若要順時針旋轉 180 度，請啟用 **Flip H** 和 **Flip V**。若要順時針旋轉 270 度，請啟用 **Flip V** 及 **Transpose**。

source: **Rendering > Texture Origin:** The origin to use for drawing the tile. This can be used to visually offset the tile compared to the base tile.
es: **Rendering > Texture Origin:** El origen a usar para dibujar el tile. Esto puede ser usado para poner el offset del tile visualmente comparándolo con el tile base.
ga: ** Rindreáil > Uigeacht Bunús:** An bunús le húsáid chun an tíl a tharraingt. Is féidir é seo a úsáid chun an tíl a fhritháireamh go radhairc i gcomparáid leis na bun-tíl.
ja: レンダリング > Texture Origin: タイルを描画する際に使用する原点です。これを使用することで、ベースタイルに対してタイルの見た目の位置をオフセットできます。
pt_br: **Rendering > Texture Origin:** A origem a ser usada para desenhar o tile. Isso pode ser utilizado para deslocar visualmente o tile em relação ao tile base.
ru: **Rendering > Texture Origin:** Исходная точка, используемая для рисования тайла. Можно использовать для визуального смещения тайла по сравнению с базовым тайлом.
ta: ** ரெண்டரிங்> அமைப்பு தோற்றம்: ** ஓடு வரைவதற்கு பயன்படுத்த வேண்டிய தோற்றம். அடிப்படை ஓடுடன் ஒப்பிடும்போது ஓடு பார்வைக்கு ஈடுசெய்ய இதைப் பயன்படுத்தலாம்.
tr: **İşleme > Doku Kökeni:** Karoyu çizmek için kullanılacak orijin. Bu, temel karoya kıyasla karoyu görsel olarak kaydırmak için kullanılabilir.
uk: **Візуалізація > Походження текстури:** Походження для використання для малювання плитки. Це можна використовувати для візуального зміщення плитки порівняно з основною плиткою.
zh_tw: **Rendering > Texture Origin：** 繪製圖塊時使用的原點。可以用來將圖塊進行相對於基礎圖塊的視覺偏移。

source: **Rendering > Modulate:** The color multiplier to use when rendering the tile.
es: **Rendering > Modulate:** El multiplicador de color a usar cuando se renderiza el tile.
ga: ** Rindreáil > Modhnaigh:** An t-iolraitheoir datha le húsáid agus an tíl á rindreáil.
ja: **レンダリング > Modulate:** タイルを描画する際に使用する色の乗算値です。
pt_br: **Rendering > Modulate:** O multiplicador de cor a ser usado ao renderizar o tile.
ru: **Rendering > Modulate:** Цветовой множитель, используемый при рендеринге тайла.
ta: ** ரெண்டரிங்> மாடுலேட்: ** ஓடு வழங்கும்போது பயன்படுத்த வேண்டிய வண்ண பெருக்கி.
tr: **İşleme > Ton Değiştir:** Karoyu işlerken kullanılacak renk çarpanı.
uk: **Візуалізація > Модуляція:** Множник кольору, який використовується під час візуалізації плитки.
zh_tw: **Rendering > Modulate：** 繪製圖塊時的顏色乘數。

source: **Rendering > Material:** The material to use for this tile. This can be used to apply a different blend mode or custom shaders to a single tile.
es: **Rendering > Material:** El material a usar para este tile. Esto puede ser usarse para aplicar un modo de fusión distinto, o shaders custom a un solo tile.
ga: ** Rindreáil > Ábhar:** An t-ábhar le húsáid don tíl seo. Is féidir é seo a úsáid chun modh cumaisc eile nó scáthaitheoirí saincheaptha a chur i bhfeidhm ar tíl amháin.
ja: レンダリング > Material: このタイルに使用するマテリアルです。単一のタイルに異なるブレンドモードやカスタムシェーダーを適用したいときに使えます。
pt_br: **Rendering > Material:** O material a ser utilizado para este tile. Isso pode ser usado para aplicar um modo de mesclagem diferente ou shaders personalizados em um tile individual.
ru: **Рендеринг > Материал:** Материал, который будет использоваться для этого тайла. Это можно использовать для применения другого режима смешивания или пользовательских шейдеров к одному тайлу.
ta: ** ரெண்டரிங்> பொருள்: ** இந்த ஓடுக்கு பயன்படுத்த வேண்டிய பொருள். ஒற்றை ஓடுக்கு வேறு கலப்பு பயன்முறை அல்லது தனிப்பயன் சேடர்களை பயன்படுத்த இது பயன்படுத்தப்படலாம்.
tr: **İşleme > Malzeme:** Bu karo için kullanılacak malzeme. Bu, tek bir karoya farklı bir harmanlama modu veya özel gölgelendiriciler uygulamak için kullanılabilir.
uk: **Візуалізація > Матеріал:** Матеріал для цієї плитки. Це можна використовувати для застосування іншого режиму змішування або спеціальних шейдерів до однієї плитки.
zh_tw: **Rendering > Material：** 此圖塊使用的材質。可用來對單一圖塊套用不同的混合模式或自訂著色器。

source: **Z Index:** The sorting order for this tile. Higher values will make the tile render in front of others on the same layer.
es: **Z Index:** El orden de clasificación de este tile. Valores más altos harán que el tile se renderice en frente de otros en la misma capa.
ga: **Z Innéacs: ** An t-ordú sórtála don tíl seo. Déanfaidh luachanna níos airde rindreáil na tíl os comhair daoine eile ar an gciseal céanna.
ja: Z Index: このタイルの描画順序です。同じレイヤー上で値が大きいほど、他のタイルの前面に描画されます。
pt_br: **Z Index:** A ordem de desenho para este tile. Valores mais altos farão com que o tile seja renderizado à frente de outros na mesma camada.
ru: **Z Index:** Порядок сортировки для этого тайла. Более высокие значения заставят тайл отображаться перед другими на том же слое.
ta: ** சட் குறியீட்டு: ** இந்த ஓலுக்கான வரிசையாக்க வரிசை. அதிக மதிப்புகள் ஒரே அடுக்கில் மற்றவர்களுக்கு முன்னால் ஓடு ரெண்டரை உருவாக்கும்.
tr: **Z İndeksi:** Bu karo için sıralama düzeni. Daha yüksek değerler, karonun aynı katmandaki diğerlerinin önünde oluşturulmasını sağlar.
uk: **Z Index:** порядок сортування для цієї плитки. Вищі значення призведуть до того, що плитка відтворюватиметься перед іншими на тому самому шарі.
zh_tw: **Z Index：** 此圖塊的排序順序。數值越高，圖塊會顯示在同一層的其他圖塊之上。
