Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: After doing this, you can select multiple tiles on the right column by holding :kbd:`Shift` then clicking on tiles. You can also perform rectangle selection by holding down the left mouse button then dragging the mouse. Lastly, you can deselect tiles that were already selected (without affecting the rest of the selection) by holding :kbd:`Shift` then clicking on a selected tile.
es: Después de hacer esto, puede seleccionar varios tiles en la columna derecha manteniendo presionada la tecla :kbd:`Mayús` y haciendo clic en los tiles. También puede realizar una selección rectangular manteniendo presionado el botón izquierdo del ratón y luego arrastrándolo. Por último, puede anular la selección de tiles que ya estaban seleccionados (sin afectar el resto de la selección) manteniendo presionada la tecla :kbd:`Mayús` y haciendo clic en un tile seleccionado.
ga: Tar éis duit é seo a dhéanamh, is féidir leat tíleanna iolracha a roghnú ar an gcolún ceart trí choinneáil: kbd: `Shift` ansin cliceáil ar tíleanna. Is féidir leat roghnú dronuilleog a dhéanamh freisin tríd an gcnaipe luiche ar chlé a choinneáil síos ansin an luch Ar deireadh, is féidir leat tíleanna a roghnaíodh cheana féin a dhíroghnú (gan dul i bhfeidhm ar an gcuid eile den roghnú) trí:kbd: `Shift` a choinneáil ansin cliceáil ar tíl roghnaithe.
ja: その後、 :kbd:`Shift` を押しながらタイルをクリックすると、右列で複数のタイルを選択することができます。また、マウスの左ボタンを押したままマウスをドラッグすると、矩形選択ができます。最後に、 :kbd:`Shift` を押したまま選択中のタイルをクリックすると、すでに選択されているタイルの選択を解除することができます(選択範囲の残りの部分に影響を与えずに)。
pt_br: Após fazer isso, você pode selecionar vários tiles na coluna da direita segurando :kbd:`Shift` e clicando nos tiles. Você também pode realizar uma seleção em retângulo segurando o botão esquerdo do mouse e arrastando. Por fim, é possível desmarcar tiles que já estavam selecionados (sem afetar o restante da seleção) segurando :kbd:`Shift` e clicando em um tile selecionado.
ru: После этого вы можете выбрать несколько тайлов в правом столбце, удерживая :kbd:`Shift` и щелкая по тайлам. Вы также можете выполнить прямоугольное выделение, удерживая левую кнопку мыши и перетаскивая мышь. Наконец, вы можете отменить выделение тайлов, которые уже были выбраны (не влияя на остальную часть выделения), удерживая :kbd:`Shift` и щелкая по выбранному тайлу.
ta: இதைச் செய்த பிறகு, வைத்திருப்பதன் மூலம் வலது நெடுவரிசையில் பல ஓடுகளைத் தேர்ந்தெடுக்கலாம்: KBD: `Shift` பின்னர் ஓடுகளைக் சொடுக்கு செய்க. இடது மவுச் பொத்தானை அழுத்திப் பிடிப்பதன் மூலம் நீங்கள் செவ்வக தேர்வைச் செய்யலாம், பின்னர் சுட்டியை இழுத்துச் செல்லலாம். கடைசியாக, வைத்திருப்பதன் மூலம் ஏற்கனவே தேர்ந்தெடுக்கப்பட்ட ஓடுகளை (மீதமுள்ள தேர்வை பாதிக்காமல்) தேர்வுநீக்கலாம்: KBD: `Shift` பின்னர் தேர்ந்தெடுக்கப்பட்ட ஓடு மீது சொடுக்கு செய்க.
tr: Bunu yaptıktan sonra, :kbd:`Shift` tuşunu basılı tutup karoların üzerine tıklayarak sağ sütunda birden fazla karo seçebilirsiniz. Ayrıca farenin sol tuşunu basılı tutup fareyi sürükleyerek dikdörtgen seçimi de yapabilirsiniz. Son olarak, :kbd:`Shift` tuşunu basılı tutup seçili bir karoya tıklayarak daha önce seçilmiş olan bazı karoların seçimini kaldırabilirsiniz (seçimin geri kalanını etkilemeden).
uk: Після цього ви можете вибрати декілька плиток у правому стовпчику, утримуючи :kbd:`Shift` і клацаючи плитки. Ви також можете виконати виділення прямокутника, утримуючи ліву кнопку миші та перетягуючи її. Нарешті, ви можете скасувати виділення плиток, які вже були виділені (не впливаючи на решту виділення), утримуючи :kbd:`Shift` і клацнувши на вибраній плитці.
zh_tw: 完成此操作後，你可以按住 :kbd:`Shift` 鍵，然後按一下圖塊，在右側欄中選擇多個圖塊。你還可以按住滑鼠左鍵然後拖動滑鼠來執行矩形選擇。最後，你可以按住 :kbd:`Shift` 然後按一下選定的圖塊，取消選擇已選中的圖塊（不會影響選擇的其他部分）。

source: You can then assign properties using the inspector in the middle column of the TileSet editor. Only properties that you change here will be applied to all selected tiles. Like in the editor's inspector, properties that differ on selected tiles will remain different until you edit them.
es: Luego, puede asignar propiedades mediante el inspector en la columna central del editor TileSet. Solo las propiedades que cambie aquí se aplicarán a todos los tiles seleccionados. Al igual que en el inspector del editor, las propiedades que difieren en los tiles seleccionados seguirán siendo diferentes hasta que las edite.
fr: Vous pouvez ensuite attribuer des propriétés en utilisant l'inspecteur dans la colonne du milieu de l'éditeur TileSet. Seules les propriétés que vous changez ici seront appliquées à toutes les tuiles sélectionnées. Comme dans l'inspecteur de l'éditeur, les propriétés qui diffèrent sur les tuiles sélectionnées resteront différentes jusqu'à ce que vous les éditez.
ga: Ansin is féidir leat airíonna a shannadh ag baint úsáide as an gcigre i lár colún an eagarthóra TileSet. Ní chuirfear ach airíonna a athraíonn tú anseo i bhfeidhm ar gach tíl roghnaithe. Cosúil le cigre an eagarthóra, fanfaidh airíonna atá difriúil ar tíleanna roghnaithe difriúil go dtí go ndéanann tú iad a chur in eagar.
ja: 次に、TileSetエディタの中央列にあるインスペクターを使用してプロパティを割り当てることができます。ここで変更したプロパティのみが、選択したすべてのタイルに適用されます。エディタのインスペクターと同様に、選択したタイル間で異なるプロパティは変更されるまでそのまま維持されます。
pt_br: Você pode então atribuir propriedades usando o Inspetor na coluna do meio do editor de TileSet. Somente as propriedades que você alterar aqui serão aplicadas a todos os tiles selecionados. Assim como no Inspetor do editor, propriedades que diferem entre os tiles selecionados permanecerão diferentes até que você as edite.
ru: Затем вы можете назначить свойства с помощью инспектора в средней колонке редактора TileSet. Только свойства, которые вы измените здесь, будут применены ко всем выбранным тайлам. Как и в инспекторе редактора, свойства, которые различаются на выбранных тайлах, останутся разными, пока вы их не отредактируете.
ta: டைல்செட் எடிட்டரின் நடுத்தர நெடுவரிசையில் இன்ச்பெக்டரைப் பயன்படுத்தி பண்புகளை நீங்கள் ஒதுக்கலாம். நீங்கள் இங்கே மாற்றும் பண்புகள் மட்டுமே தேர்ந்தெடுக்கப்பட்ட அனைத்து ஓடுகளுக்கும் பயன்படுத்தப்படும். எடிட்டரின் இன்ச்பெக்டரைப் போலவே, தேர்ந்தெடுக்கப்பட்ட ஓடுகளில் வேறுபடும் பண்புகள் அவற்றை திருத்தும் வரை வித்தியாசமாக இருக்கும்.
tr: Daha sonra TileSet düzenleyicisinin orta sütunundaki denetleyiciyi kullanarak özellikleri atayabilirsiniz. Tüm seçili karolara yalnızca burada değiştirdiğiniz özellikler uygulanacaktır. Düzenleyicinin denetleyicisinde olduğu gibi, seçili karolarda farklı olan özellikler siz onları düzenleyene kadar farklı kalacaktır.
uk: Потім ви можете призначити властивості за допомогою інспектора в середньому стовпці редактора TileSet. Лише властивості, які ви змінюєте тут, будуть застосовані до всіх вибраних плиток. Як і в інспекторі редактора, властивості, що відрізняються на вибраних плитках, залишатимуться різними, доки ви їх не відредагуєте.
zh_tw: 然後，你可以使用 TileSet 編輯器中間一列的屬性檢視器分配屬性。只有在此更改的屬性才會應用到所有選定的圖塊。與編輯器的屬性檢視器一樣，在你編輯之前，所選圖塊上的不同屬性將保持不同。

source: With numerical and color properties, you will also see a preview of the property's value on all tiles in the atlas after editing a property:
es: Al editar propiedades numéricas o de color, se mostrará una vista previa del valor de la propiedad en todos los tiles del atlas:
fr: Avec des propriétés numériques et de couleur, vous verrez également un aperçu de la valeur de la propriété sur toutes les tuiles dans l'atlas après avoir édité une propriété :
ga: Le hairíonna uimhriúla agus datha, feicfidh tú réamhamharc ar luach na maoine ar gach tíl san atlas tar éis mhaoin a chur in eagar:
ja: 数値や色プロパティでは、プロパティを編集した後に、その値がアトラス内のすべてのタイルに反映されるプレビューが表示されます:
pt_br: Com propriedades numéricas e de cor, você também verá uma pré-visualização do valor da propriedade em todos os tiles no atlas após editar uma propriedade:
ru: При использовании числовых и цветовых свойств вы также увидите предварительный просмотр значения свойства на всех тайлах атласа после редактирования свойства:
ta: எண் மற்றும் வண்ண பண்புகள் மூலம், ஒரு சொத்தைத் திருத்திய பின் அட்லசில் உள்ள அனைத்து ஓடுகளிலும் சொத்தின் மதிப்பின் முன்னோட்டத்தையும் நீங்கள் காண்பீர்கள்:
tr: Sayısal ve renk özelliklerinde, bir özelliği düzenledikten sonra atlastaki tüm karolarda özelliğin değerinin bir önizlemesini de görürsünüz:
uk: За допомогою числових і колірних властивостей ви також побачите попередній перегляд значення властивості на всіх плитках в атласі після редагування властивості:
zh_tw: 對於數值和顏色屬性，編輯完成後還能在合集中的所有圖塊上看到屬性值的預覽：

source: Selecting multiple tiles using the Select mode, then applying properties
es: Selección varios tiles usando el modo Seleccionar y aplicación de propiedades
fr: Sélectionner plusieurs tuiles en utilisant le mode Sélectionner, puis appliquer les propriétés
ga: Tíleanna iolracha a roghnú ag baint úsáide as an modh Roghnaigh,
ja: 選択モードを使用して複数のタイルを選択し、その後プロパティを適用
pt_br: Selecionando múltiplos tiles usando o modo Seleção e, em seguida, aplicando propriedades
ru: Выбор нескольких тайлов с помощью режима выбора и последующее применение свойств
ta: தேர்ந்தெடுக்கப்பட்ட பயன்முறையைப் பயன்படுத்தி பல ஓடுகளைத் தேர்ந்தெடுத்து, பின்னர் பண்புகளைப் பயன்படுத்துதல்
tr: Seç modunu kullanarak birden fazla karoyu seçme ve ardından özellikleri uygulama
uk: Вибір кількох плиток за допомогою режиму вибору, а потім застосування властивостей
zh_tw: 使用選擇模式選擇多個圖塊，然後應用屬性

source: Using tile property painting
es: Usando la pintura de propiedades de tiles
fr: Utiliser la peinture de propriété de tuile
ga: Péinteáil maoine tíl a úsáid
it: Utilizzare la pittura di proprietà di tasselli
ja: タイルプロパティ・ペイントを使用する
ko: 타일 속성 칠하기 사용하기
ru: Рисование свойств тайлов
ta: ஓடு சொத்து ஓவியத்தைப் பயன்படுத்துதல்
tr: Karo özellik boyaması kullanımı
uk: Використання фарбування властивостей плитки
zh_tw: 使用匯出樣板

source: If you wish to apply a single property to several tiles at once, you can use the *property painting* mode for this purpose.
es: Si desea aplicar una sola propiedad a varios tiles a la vez, puede utilizar el modo *pintura de propiedades*.
fr: Si vous souhaitez appliquer une seule propriété à plusieurs tuile à la fois, vous pouvez utiliser le mode *peinture de propriété* à cette fin.
ga: Más mian leat maoin amháin a chur i bhfeidhm ar roinnt tíleanna ag an am céanna, is féidir leat an modh*péinteáil maoine a úsáid chun na críche seo.
ja: 複数のタイルに対して一度に1つのプロパティを適用したい場合は、 *プロパティペイント* モードを使用することができます。
pt_br: Se você deseja aplicar uma única propriedade a vários tiles de uma vez, pode usar o modo de *pintura de propriedades* para este propósito.
ru: Если вы хотите применить одно свойство к нескольким тайлам одновременно, вы можете использовать для этой цели режим *окрашивания свойств*.
ta: ஒரே நேரத்தில் பல ஓடுகளுக்கு ஒரு சொத்தை பயன்படுத்த விரும்பினால், இந்த நோக்கத்திற்காக * சொத்து ஓவியம் * பயன்முறையைப் பயன்படுத்தலாம்.
tr: Tek bir özelliği aynı anda birden fazla karoya uygulamak isterseniz, bu amaçla *özellik boyama* modunu kullanabilirsiniz.
uk: Якщо ви бажаєте застосувати одну властивість до кількох плиток одночасно, ви можете скористатися для цієї мети режимом *малювання властивостей*.
zh_tw: 如果要一次將單個屬性應用於多個圖塊，則可以使用*屬性繪製*模式來實作此目的。

source: Configure a property to be painted in the middle column, then click on tiles (or hold down the left mouse button) in the right column to "paint" properties onto tiles.
es: Configure una propiedad para que se pinte en la columna del medio, luego haga clic en los tiles (o mantenga presionado el botón izquierdo del ratón) en la columna derecha para "pintar" propiedades en los tiles.
fr: Configurez une propriété à peindre dans la colonne du milieu, puis cliquez sur les tuiles (ou maintenez le bouton gauche de la souris) dans la colonne de droite pour "peindre" les propriétés sur des tuiles.
ga: Cumraigh maoin le péinteáil sa mheáncholún, ansin cliceáil ar tíleanna (nó coinnigh síos an cnaipe luiche ar chlé) sa cholún ceart chun airíonna a “péinteáil” ar tíleanna.
ja: 中央の列でペイントするプロパティを設定し、右の列でタイルをクリック(または左マウスボタンを押したままに)して、タイルにプロパティを "ペイント" します。
pt_br: Configure uma propriedade para ser pintada na coluna do meio e, em seguida, clique nos tiles (ou segure o botão esquerdo do mouse) na coluna da direita para "pintar" propriedades nos tiles.
ru: Настройте свойство, которое будет отображаться в среднем столбце, затем щелкните по тайлам (или удерживайте левую кнопку мыши) в правом столбце, чтобы «нарисовать» свойства на тайлах.
ta: நடுத்தர நெடுவரிசையில் வரையப்பட வேண்டிய ஒரு சொத்தை உள்ளமைக்கவும், பின்னர் வலது நெடுவரிசையில் உள்ள ஓடுகளில் (அல்லது இடது சுட்டி பொத்தானை அழுத்திப் பிடிக்கவும்) ஓடுகளில் "வண்ணம் தீட்ட" என்பதைக் சொடுக்கு செய்க.
tr: Orta sütunda boyanacak bir özelliği yapılandırın, ardından özellikleri karolara "boyamak" için sağ sütundaki karolara tıklayın (veya sol fare düğmesini basılı tutun).
uk: Налаштуйте властивість для малювання в середньому стовпчику, а потім клацніть плитки (або утримуйте ліву кнопку миші) у правій колонці, щоб «намалювати» властивості на плитках.
zh_tw: 在中間一列配置要繪製的屬性，然後點擊右列中的圖塊（或按住滑鼠左鍵）以將屬性“繪製”到圖塊上。

source: Painting tile properties using the TileSet editor
es: Pintando las propiedades de un tile utilizando el editor de TileSet
fr: Peindre les propriétés des tuiles en utilisant l'éditeur de TileSet
ga: Airíonna tíl a phéinteáil ag baint úsáide as eagarthóir
it: Pittura delle proprietà dei tasselli attraverso l'editor di TileSet
ja: タイルセットエディタを使ってタイルプロパティをペイント
ko: 타일셋 편집기를 사용하여 타일 속성을 칠하기
ru: Рисование свойств тайла используя редактор наборов Тайлов
ta: டைல்செட் எடிட்டரைப் பயன்படுத்தி ஓவியம் ஓவியம் ஓவியம்
tr: TileSet düzenleyicisini kullanarak karo özelliklerini boyama
uk: Малювання властивостей плитки за допомогою редактора TileSet
zh_tw: 使用圖塊集編輯器繪製圖塊屬性

source: Tile property painting is especially useful with properties that are time-consuming to set manually, such as collision shapes:
es: El pintado de propiedades de tile es especialmente útil con propiedades que requieren mucho tiempo para configurarse manualmente, como las formas de colisión:
fr: La peinture de propriété sur tuile est particulièrement utile avec les propriétés qui sont longues à définir manuellement, comme les formes de collision :
ga: Tá péinteáil maoine tíl úsáideach go háirithe le hairíonna a thógann am a shocrú de láimh, mar shampla cruthanna imbhuailte:
ja: タイルプロパティのペイントは、コリジョン形状のような手動で設定するのに時間がかかるプロパティに特に便利です:
pt_br: A pintura de propriedades de tile é especialmente útil para propriedades que demandam muito tempo para configurar manualmente, como formas de colisão:
ru: Раскрашивание свойств тайла особенно полезно для свойств, настройка которых вручную занимает много времени, например, для форм столкновений:
ta: மோதல் வடிவங்கள் போன்ற கைமுறையாக அமைக்க நேரத்தை எடுத்துக்கொள்ளும் பண்புகளுடன் ஓடு சொத்து ஓவியம் குறிப்பாக பயனுள்ளதாக இருக்கும்:
tr: Karo özelliği boyama, özellikle çarpışma şekilleri gibi elden ayarlanması zaman alan özelliklerde kullanışlıdır:
uk: Розмальовування властивостей мозаїки особливо корисне з властивостями, які потребують багато часу, щоб встановити вручну, наприклад форми зіткнень:
zh_tw: 對於手動設定耗時的屬性（例如碰撞形狀），圖塊屬性繪製特別有用：

source: Painting a collision polygon, then left-clicking tiles to apply it
es: Pintar un polígono de colisión y luego hacer clic izquierdo en los tiles para aplicarlo
fr: Peinture d'un polygone de collision, puis clic gauche sur les tuiles pour l'appliquer
ga: Péinteáil polagán imbhuailte, ansin tíleanna cliceáil ar chlé chun é a chur i bhfeidh
ja: コリジョンポリゴンをペイントし、その後、タイルを左クリックして適用
pt_br: Pintando um polígono de colisão e, em seguida, clicando com o botão esquerdo nos tiles para aplicá-lo
ru: Рисуем полигон столкновения, а затем щелкаем левой кнопкой мыши по тайлам, чтобы применить его
ta: மோதல் பலகோணத்தை வரைவது, பின்னர் அதைப் பயன்படுத்த இடது-கிளிக் ஓடுகள்
tr: Bir çarpışma çokgenini boyama, ardından uygulamak için karolara sol tıklama
uk: Розмальовування багатокутника зіткнення, а потім клацання лівою кнопкою миші плитки, щоб застосувати його
zh_tw: 繪製碰撞多邊形，然後左鍵按一下圖塊以應用它

source: Creating alternative tiles
es: Creando tiles alternativos
fr: Créer des tuiles alternatives
ga: Cruthú tíleanna malartacha
it: Creare tasselli alternativi
ja: 代替タイルの作成
ru: Создание альтернативных тайлов
ta: மாற்று ஓடுகளை உருவாக்குதல்
tr: Alternatif karolar oluşturma
uk: Створення альтернативних плиток
zh_tw: 建立內容

source: Sometimes, you want to use a single tile image (found only once within the atlas), but configured in different ways. For example, you may want to use the same tile image, but rotated, flipped, or modulated with a different color. This can be done using *alternative tiles*.
es: A veces, quieres utilizar una sola imagen de baldosa (que se encuentra solo una vez dentro del atlas), pero configurada de diferentes maneras. Por ejemplo, puedes querer usar la misma imagen de baldosa pero girada, volteada o modulada con un color diferente. Esto se puede lograr usando *baldosas alternativos*.
fr: Parfois, vous pourriez vouloir utiliser une seule image de tuile (trouvé une unique fois dans l'atlas), mais configurée de différentes manières. Par exemple, vous pourriez vouloir utiliser la même image de tuile, mais tournée, inversée ou modulée avec une couleur différente. Cela peut être fait en utilisant des *tuiles alternatives*.
ga: Uaireanta, ba mhaith leat íomhá tíl amháin a úsáid (a fhaightear ach uair amháin laistigh den atlas), ach cumraithe ar bhealaí éagsúla. Mar shampla, b'fhéidir gur mhaith leat an íomhá tíl céanna a úsáid, ach rothlú, fliaptha nó modhnaithe le dath difriúil. Is féidir é seo a dhéanamh ag baint úsáide* tíleanna malartach*.
ja: 時には、単一の(アトラス内に1つだけある)タイル画像を、異なる設定で使用したい場合があります。例えば、同じタイル画像を使用しながら、回転や反転、異なる色で調整したりしたい場合です。これを実現するのが *代替タイル* です。
pt_br: Às vezes, você deseja usar uma única imagem de tile (encontrada apenas uma vez dentro do atlas), mas configurada de maneiras diferentes. Por exemplo, você pode querer usar a mesma imagem de tile, mas rotacionada, espelhada ou modulada com uma cor diferente. Isso pode ser feito usando *tiles alternativos*.
ru: Иногда вы хотите использовать одно изображение тайла (встречающееся только один раз в атласе), но настроенное по-разному. Например, вы можете захотеть использовать одно и то же изображение тайла, но повернутое, перевернутое или модулированное другим цветом. Это можно сделать с помощью *альтернативных тайлов*.
ta: சில நேரங்களில், நீங்கள் ஒரு ஒற்றை ஓடு படத்தைப் பயன்படுத்த விரும்புகிறீர்கள் (அட்லசுக்குள் ஒரு முறை மட்டுமே காணப்படுகிறது), ஆனால் வெவ்வேறு வழிகளில் கட்டமைக்கப்படுகிறது. எடுத்துக்காட்டாக, நீங்கள் அதே ஓடு படத்தைப் பயன்படுத்த விரும்பலாம், ஆனால் சுழற்றப்பட்ட, புரட்டப்பட்ட அல்லது வேறு வண்ணத்துடன் மாற்றியமைக்கப்பட்ட. *மாற்று ஓடுகள் *ஐப் பயன்படுத்தி இதைச் செய்யலாம்.
tr: Bazen, tek bir karo görüntüsünü (atlasta yalnızca bir kez bulunan) kullanmak, ancak farklı şekillerde yapılandırmak istersiniz. Örneğin, aynı karo görüntüsünü döndürülmüş, çevrilmiş veya farklı bir renkle değiştirilmiş olarak kullanmak isteyebilirsiniz. Bu, *alternatif karolar* kullanılarak yapılabilir.
uk: Іноді потрібно використати єдине зображення плитки (знаходиться лише один раз в атласі), але налаштоване різними способами. Наприклад, ви можете використати те саме мозаїчне зображення, але повернуте, перевернуте або модульоване іншим кольором. Це можна зробити за допомогою *альтернативних плиток*.
zh_tw: 有時，你想使用單一的圖塊圖像（在合集中只能找到一次），但要以不同的方式進行配置。例如，你可能想使用相同的圖塊圖像，但對它進行旋轉、翻轉或調變成不同的顏色。這就可以使用 *備選圖塊* 來實作。

source: Since Godot 4.2, you don't have to create alternative tiles to rotate or flip tiles anymore. You can rotate any tile while placing it in the TileMap editor by using the rotation/flip buttons in the TileMap editor toolbar.
es: Desde Godot 4.2, no tienes que crear tiles alternativos o rotar o voltear tiles. Puedes rotar cualquier tile al colocarlo en el editor de TileMap usando los botones de rotar/volter en la barra de herramientas del editor de TileMap.
fr: Depuis Godot 4.2, vous n'avez plus à créer des tuiles alternatives pour tourner ou inverser des tuiles. Vous pouvez tourner n'importe quelle tuile tout en la plaçant dans l'éditeur TileMap en utilisant les boutons de rotation/inversion dans la barre d'outils de l'éditeur TileMap.
ga: Ó Godot 4.2, ní gá duit tíleanna malartacha a chruthú chun tíleanna a rothlú nó a fhilleadh níos mó. Is féidir leat aon tíl a rothlú agus tú ag cur san eagarthóir TileMap trí na cnaipí rothlacha/flip a úsáid i mbarra uirlisí eagarthóra TileMap.
ja: Godot 4.2 からは、タイルを回転させたり反転させたりするために代替タイルを作成する必要がなくなりました。TileMapエディタでタイルを配置する際に、ツールバーにある回転/反転ボタンを使用して、任意のタイルを回転させることができます。
pt_br: Desde o Godot 4.2, não é mais necessário criar tiles alternativos para rotacionar ou espelhar tiles. Você pode rotacionar qualquer tile ao colocá-lo no editor de TileMap usando os botões de rotação/espelhamento na barra de ferramentas do editor de TileMap.
ru: Начиная с Godot 4.2, вам больше не нужно создавать альтернативные тайлы для поворота или переворота тайлов. Вы можете повернуть любой тайл, помещая его в редактор TileMap, используя кнопки поворота/переворота на панели инструментов редактора TileMap.
ta: கோடோட் 4.2 என்பதால், இனி ஓடுகளை சுழற்ற அல்லது புரட்ட மாற்று ஓடுகளை உருவாக்க வேண்டியதில்லை. டைல்மேப் எடிட்டர் கருவிப்பட்டியில் சுழற்சி/ஃபிளிப் பொத்தான்களைப் பயன்படுத்தி டில்மேப் எடிட்டரில் வைக்கும்போது எந்த ஓலையும் சுழற்றலாம்.
tr: Godot 4.2'den bu yana, karoları döndürmek veya çevirmek için artık alternatif karolar oluşturmak zorunda değilsiniz. TileMap düzenleyici araç çubuğundaki döndürme/çevirme düğmelerini kullanarak herhangi bir karoyu TileMap düzenleyiciye yerleştirirken döndürebilirsiniz.
uk: Починаючи з Godot 4.2, вам більше не потрібно створювати альтернативні плитки для обертання чи перевертання плиток. Ви можете обертати будь-яку плитку під час розміщення її в редакторі TileMap за допомогою кнопок обертання/перевертання на панелі інструментів редактора TileMap.
zh_tw: 從 Godot 4.2 開始，你不需要再特地建立備用圖塊來旋轉或翻轉圖塊。直接在 TileMap 編輯器中放置圖塊時，可以透過工具列上的旋轉／翻轉按鈕來調整。

source: To create an alternative tile, right-click a base tile in the atlas displayed by the TileSet editor, then choose **Create an Alternative Tile**:
es: Para crear un tile alternativo, haz clic derecho en un tile base en el atlas mostrado por el editor de TileSets. Luego escoge **Crear un Tile Alternativo**:
fr: Pour créer une tuile alternative, faites un clic droit sur une tuile de base dans l'atlas affiché par l'éditeur TileSet, puis choisissez **Créer une tuile alternative** :
ga: Chun tíl mhalartach a chruthú, cliceáil ar dheis ar thíl bonn san atlas a thaispeánann eagarthóir TileSet, ansin roghnaigh **Cruthaigh Tíleanna Malart**:
ja: 代替タイルを作成するには、TileSetエディタのアトラスに表示されているベースタイルを右クリックし、 **代替タイルを作成** を選択してください。
pt_br: Para criar um tile alternativo, clique com o botão direito em um tile base no atlas exibido pelo editor de TileSet e selecione **Criar um Tile Alternativo**:
ru: Чтобы создать альтернативный тайл, щелкните правой кнопкой мыши базовый тайл в атласе, отображаемом редактором TileSet, затем выберите **Create an Alternative Tile**:
ta: ஒரு மாற்று ஓடு உருவாக்க, டைல்செட் எடிட்டரால் காண்பிக்கப்படும் அட்லசில் ஒரு அடிப்படை ஓடு வலது சொடுக்கு செய்யவும், பின்னர் ** ஒரு மாற்று ஓடு உருவாக்கு **:
tr: Alternatif bir karo oluşturmak için, TileSet düzenleyicisi tarafından görüntülenen atlasta bir temel karoya sağ tıklayın ve ardından **Yerine-geçebilen Karo Oluştur** ögesini seçin:
uk: Щоб створити альтернативну плитку, клацніть правою кнопкою миші базову плитку в атласі, який відображається в редакторі TileSet, а потім виберіть **Створити альтернативну плитку**:
zh_tw: 要建立備選圖塊，請按右鍵 TileSet 編輯器顯示的合集中的基本圖塊，然後選擇 **建立備選圖塊**：
