Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/using_tilesets.po
Languages: es, fr, ga, it, ja, ko, pt_br, ru, ta, tr, uk, zh_tw

source: The above modes correspond to the previous bitmask modes autotiles used in Godot 3.x: 2×2, 3×3 or 3×3 minimal. This is also similar to what the `Tiled <https://www.mapeditor.org/>`__ editor features.
es: Los modos anteriores corresponden a los modos de máscara de bits utilizados anteriormente en los autotiles de Godot 3.x: 2×2, 3×3 o 3×3 mínimo. Esto también es similar a lo que ofrece el editor `Tiled <https://www.mapeditor.org/>`__.
ga: Freagraíonn na modhanna thuas do na hútaríleanna modhanna giotán roimhe seo a úsáideadh in Godot 3.x: 2×2, 3×3 nó 3×3 íosta. Tá sé seo cosúil leis na gnéithe atá san eagarthóir `Tiled <https://www.mapeditor.org/>`__ freisin.
ja: 上記のモードは以前Godot 3.xで使われていたビットマスクモードの自動タイルに対応しています: 2×2、 3×3、そして 3×3 minimal 。 これは `Tiled <https://www.mapeditor.org/>`__ エディターの機能にも似ています。
pt_br: Os modos acima correspondem aos modos de bitmask que os autotiles usavam no Godot 3.x: 2×2, 3×3 ou 3×3 minimal. Isso também é similar ao que o editor `Tiled <https://www.mapeditor.org/>`__ oferece.
ru: Вышеуказанные режимы соответствуют предыдущим режимам битовых масок autotiles, используемым в Godot 3.x: 2×2, 3×3 или 3×3 minimum. Это также похоже на то, что есть в редакторе `Tiled <https://www.mapeditor.org/>`__.
ta: மேலே உள்ள முறைகள் கோடோட் 3.x: 2 × 2, 3 × 3 அல்லது 3 × 3 இல் பயன்படுத்தப்படும் முந்தைய பிட்மாச்க் முறைகள் ஆட்டோடில்களுடன் ஒத்திருக்கும். இது `டைல்ட் <https://www.mapeditor.org/> __ எடிட்டர் அம்சங்களுக்கும் ஒத்ததாகும்.
tr: Yukarıdaki modlar otomatik karo döşemenin Godot 3.x'te kullandığı önceki bitmaskesi modlarına karşılık gelir: 2×2, 3×3 veya 3×3 minimal. Bu aynı zamanda `Tiled <https://www.mapeditor.org/>`__ düzenleyici özelliklerine de benzer.
uk: Наведені вище режими відповідають попереднім автоплиткам режимів бітової маски, які використовувалися в Godot 3.x: 2×2, 3×3 або 3×3 мінімально. Це також схоже на функції редактора `Tiled <https://www.mapeditor.org/>`__.
zh_tw: 上述模式在 Godot 3.x 中對應的自動圖塊位元遮罩模式為 2×2、3×3或3×3 Minimal。也和 `Tiled <https://www.mapeditor.org/>`__ 編輯器中使用的模式類似。

source: Select the TileMapLayer node, go to the inspector and create a new terrain set within the TileSet *resource*:
pt_br: Selecione o nó TileMapLayer, vá até o Inspetor e crie um novo conjunto de terrenos no *recurso* TileSet:
ru: Выберите узел TileMapLayer, перейдите в инспектор и создайте новый набор ландшафта в TileSet *resource*:
ta: டிலேமாபிளேயர் முனையைத் தேர்ந்தெடுத்து, இன்ச்பெக்டரிடம் சென்று டைல்செட் *வளத்திற்குள் ஒரு புதிய நிலப்பரப்பை உருவாக்கவும் *:
uk: Виберіть вузол TileMapLayer, перейдіть до інспектора та створіть новий набір місцевості в *ресурсі* TileSet:
zh_tw: 選取 TileMapLayer 節點，前往屬性檢視器並在圖塊集 *資源* 中建立一個新的地形集：

source: Creating a terrain set in the TileSet resource inspector (within the TileMapLayer node)
pt_br: Criando um conjunto de terrenos no Inspetor do recurso TileSet (no nó TileMapLayer)
ru: Создание набора ландшафта в инспекторе ресурсов TileSet (внутри узла TileMapLayer)
ta: டைல்செட் வள இன்ச்பெக்டரில் (டில்மேபிளேயர் முனைக்குள்) ஒரு நிலப்பரப்பு அமைக்கப்பட்டுள்ளது
uk: Створення набору місцевості в інспекторі ресурсів TileSet (у вузлі TileMapLayer)
zh_tw: 在圖塊集資源屬性檢視器中建立地形集 (在 TileMapLayer 節點內)

source: After creating a terrain set, you **must** create one or more terrains *within* the terrain set:
es: Después de crear un conjunto de terrenos, **debes** crear uno o más terrenos *dentro* del conjunto de terrenos:
ga: Tar éis duit tacar tírdhreach a chruthú, ní mór duit** tírdhreach amháin nó níos mó a chruthú* laistigh den tacar tírdhreach:
it: Dopo aver creato un insieme di terreni, è **necessario** creare uno o più terreni *all'interno* dell'insieme di terreni:
ja: Terrain set を作成した後は、 **必ず** 地形を1つ以上 terrain set の *中に* 作成してください:
pt_br: Após criar um conjunto de terrenos, você **deve** criar um ou mais terrenos *no* conjunto de terrenos:
ru: После создания набора ландшафта вы **должны** создать один или несколько ландшафтов *внутри* набора ландшафта:
ta: ஒரு நிலப்பரப்பு தொகுப்பை உருவாக்கிய பிறகு, நீங்கள் ** ** நிலப்பரப்புக்குள் ஒன்று அல்லது அதற்கு மேற்பட்ட நிலப்பரப்புகளை உருவாக்க வேண்டும்*
tr: Bir arazi seti oluşturduktan sonra, arazi seti içinde *bir veya daha fazla arazi oluşturmanız **zorunludur:
uk: Після створення набору рельєфу ви **повинні** створити один або кілька рельєфів *у межах* набору рельєфу:
zh_tw: 建立地形集後，你**必須**在地形集*中*再建立若干地形：

source: Creating a terrain within the terrain set
es: Creando un terreno dentro del set de terreno
fr: Créer un terrain dans l'ensemble de terrains
ga: Cruthú tír-raon laistigh den tacar tír-raon
it: Creare un terreno all'interno dell'insieme di terreni
ja: Terrain set の中に 地形を作成
ko: 지형 세트 안에 지형 만들기
ru: Создание местности через набор местности
ta: நிலப்பரப்பு தொகுப்பிற்குள் ஒரு நிலப்பரப்பை உருவாக்குதல்
tr: Arazi seti içinde bir arazi oluşturma
uk: Створення рельєфу в межах набору рельєфу
zh_tw: 產生金鑰儲存區

source: In the TileSet editor, switch to Select mode and click a tile. In the middle column, unfold the **Terrains** section then assign a terrain set ID and a terrain ID for the tile. ``-1`` means "no terrain set" or "no terrain", which means you must set **Terrain Set** to ``0`` or greater before you can set **Terrain** to ``0`` or greater.
es: En el editor TileSet, cambie al modo Seleccionar y haga clic en un tile. En la columna del medio, despliegue la sección **Terrenos** y luego asigne un ID de **Conjunto de Terreno** y un ID de **Terreno** para el tile. ``-1`` significa "no es conjunto de terreno" y "no es terreno" respectivamente. Entonces debes establecer el **Conjunto de Terreno** en ``0`` o más antes de poder establecer el **Terreno** en ``0`` o mayor.
ga: San eagarthóir TileSet, aistrigh go Roghnaigh mód agus cliceáil tíl. Sa mheáncholún, oscail an rannát**Tríréimhseach** ansin sannadh ID tacar tíre agus ID tírdhreach don tíl. Ciallaíonn ``-1`` “gan aon tír-raon” nó “gan tír-raon”, rud a chiallaíonn go gcaithfidh tú **Tír Tíreann** a shocrú go `0`` nó níos mó.
ja: TileSet エディタで、 選択モードを選んでタイルをクリックします。中央の列で **Terrains** を展開して terrain set ID と terrain IDをタイルに割り当ててください。 ``-1`` は "terrain set 無し" や "terrain 無し" を意味し、つまり **Terrain** を0以上に設定するには **Terrain Set** を0以上にする必要があります。
pt_br: No editor de TileSet, mude para o modo Seleção e clique em um tile. Na coluna do meio, expanda a seção **Terrenos** e atribua um ID de conjunto de terrenos e um ID de terreno para o tile. ``-1`` significa "sem conjunto de terrenos" ou "sem terreno", o que significa que você deve definir o **Conjunto de Terrenos** como ``0`` ou maior antes de definir o **Terreno** como ``0`` ou maior.
ru: В редакторе TileSet переключитесь в режим Select и щелкните тайл. В средней колонке разверните раздел **Terrains**, затем назначьте идентификатор набора ландшафта и идентификатор ландшафта для тайла. ``-1`` означает «нет набора ландшафта» или «нет ландшафта», что означает, что вы должны установить **Terrain Set** на ``0`` или больше, прежде чем вы сможете установить **Terrain** на ``0`` или больше.
ta: டைல்செட் எடிட்டரில், தேர்ந்தெடுக்கப்பட்ட பயன்முறைக்கு மாறவும், ஓடு என்பதைக் சொடுக்கு செய்யவும். நடுத்தர நெடுவரிசையில், ** நிலப்பரப்புகள் ** பிரிவை விரிவாக்குங்கள், பின்னர் ஒரு நிலப்பரப்பு தொகுப்பு ஐடி மற்றும் ஓடு ஒரு நிலப்பரப்பு ஐடியை ஒதுக்கவும். `` -1`` என்றால் "நிலப்பரப்பு தொகுப்பு இல்லை" அல்லது "நிலப்பரப்பு இல்லை", அதாவது நீங்கள் ** நிலப்பரப்பு ** ஐ ** நிலப்பரப்பு ** ஐ அமைப்பதற்கு முன்பு `` 0`` அல்லது அதற்கு மேற்பட்டதாக அமைக்க வேண்டும் `` அல்லது அதற்கு மேற்பட்டது.
tr: TileSet düzenleyicisinde, Seç moduna geçin ve bir karoya tıklayın. Orta sütunda **Araziler** bölümünü açın ve ardından karo için bir arazi seti kimliği ve bir arazi kimliği atayın. ``-1``, "arazi seti yok" veya "arazi yok" anlamına gelir; yani **Arazi** ögesini ``0`` veya daha büyük bir değere ayarlamadan önce **Arazi Kümesi** ögesini ``0`` veya daha büyük bir değere ayarlamanız gerekir.
uk: У редакторі TileSet перейдіть у режим вибору та клацніть плитку. У середньому стовпці розгорніть розділ **Terrains**, а потім призначте ідентифікатор набору ландшафту та ідентифікатор ландшафту для плитки. ``-1`` означає «немає набору ландшафту» або «немає ландшафту», що означає, що ви повинні встановити **Набір ландшафту** на ``0`` або більше, перш ніж ви зможете встановити **Ландшафт** на ``0`` або більше.
zh_tw: 在 TileSet 編輯器中，切換到“選擇”模式並按一下圖塊。在中間一欄展開**地形**部分，為圖塊分配地形集 ID 和地形 ID。``-1`` 表示“沒有地形集”和“沒有地形”，因此你必須先將**地形集**設定為大於等於 ``0`` 的值，然後才能將**地形**設定為大於 ``0`` 的值。

source: Terrain set IDs and terrain IDs are independent from each other. They also start from ``0``, not ``1``.
es: Los ID de conjunto de terreno y los ID de terreno son independientes entre sí. También comienzan desde ``0``, no desde ``1``.
fr: Les IDs d'ensembles de terrain et les IDs de terrain sont indépendants les uns des autres. Aussi, ils commencent à ``0``, pas ``1``.
ga: Tá IDanna tacar tírdhreach agus IDanna tírdhreach neamhspleách óna chéile. Tosaíonn siad freisin ó ``0``, ní ``1``.
ja: Terrain set IDとterrain IDは互いに独立しています。また、これらは ``1`` からではなく ``0`` から始まります。
pt_br: Os IDs de conjunto de terrenos e os IDs de terrenos são independentes entre si. Eles também começam em ``0``, e não em ``1``.
ru: Идентификаторы набора ландшафта и идентификаторы ландшафта независимы друг от друга. Они также начинаются с ``0``, а не с ``1``.
ta: நிலப்பரப்பு செட் ஐடிகள் மற்றும் நிலப்பரப்பு ஐடிகள் ஒருவருக்கொருவர் சுயாதீனமாக உள்ளன. அவை `` 0`` இலிருந்து தொடங்குகின்றன, `` 1`` அல்ல.
tr: Arazi seti kimlikleri ve arazi kimlikleri birbirinden bağımsızdır. Ayrıca ``1``den değil ``0``dan başlarlar.
uk: Ідентифікатори набору місцевості та ідентифікатори місцевості не залежать один від одного. Вони також починаються з ``0``, а не ``1``.
zh_tw: 地形集 ID 和地形 ID 互相獨立。從 ``0`` 開始，不從 ``1`` 開始。

source: Configuring terrain on a single tile in the TileSet editor's Select mode
es: Configurar el terreno en un solo tile en el modo Seleccionar del editor TileSet
ga: Tír-raon a chumrú ar tíl amháin i mód Roghnaigh eagarthóir TileSet
ja: TileSetエディタの選択モードでタイルに地形を設定
pt_br: Configurando terreno em um tile individual no modo Seleção do editor de TileSet
ru: Настройка ландшафта на одном тайле в режиме Select редактора TileSet
ta: டைல்செட் எடிட்டரின் தேர்ந்தெடுக்கப்பட்ட பயன்முறையில் ஒற்றை ஓடில் நிலப்பரப்பை உள்ளமைத்தல்
tr: TileSet düzenleyicisinin Seç modunda tek bir karo üzerinde arazi yapılandırması
uk: Налаштування ландшафту на одній плитці в режимі вибору редактора TileSet
zh_tw: 在 TileSet 編輯器的“選擇”模式中配置單個圖塊的地形

source: After doing so, you can now configure the **Terrain Peering Bits** section which becomes visible in the middle column. The peering bits determine which tile will be placed depending on neighboring tiles. ``-1`` is a special value which refers to empty space.
es: Después de hacerlo, ahora puede configurar la sección **Terrain Peering Bits** (que sería Bits de Emparejamiento de Terreno) que se vuelve visible en la columna del medio. Los bits de emparejamiento determinan qué tile se colocará dependiendo de los tiles vecinos. ``-1`` es un valor especial que se refiere al espacio vacío.
ga: Tar éis duit é sin a dhéanamh, is féidir leat an chuid **Terrain Peering Bits** a chumrú anois a bheidh le feiceáil sa lár colún. Cinneann na giotáin peering cén tíl a chuirfear ag brath ar tíleanna comharsanacha. Is luach speisialta é ``-1 ``a thagraíonn do spás folamh.
ja: こうすると、 **Terrain Peering Bits** セクションが中央列に表示されるので、そこで設定することができます。 Peering bits は隣接するタイルに応じてどのタイルを配置するか決定します。 ``-1`` は特別な値で、何もない空間を指します。
pt_br: Após fazer isso, você poderá configurar a seção **Bits de Conexão de Terreno**, que fica visível na coluna do meio. Os bits de conexão determinam qual tile será colocado dependendo dos tiles vizinhos. ``-1`` é um valor especial que se refere a espaço vazio.
ru: После этого вы можете настроить раздел **Terrain Peering Bits**, который становится видимым в средней колонке. Пиринговые биты определяют, какой тайл будет размещен в зависимости от соседних тайлов. ``-1`` — это специальное значение, которое относится к пустому пространству.
ta: அவ்வாறு செய்த பிறகு, நீங்கள் இப்போது ** நிலப்பரப்பு பியரிங் பிட்கள் ** பகுதியை உள்ளமைக்கலாம், இது நடுத்தர நெடுவரிசையில் தெரியும். அண்டை ஓடுகளைப் பொறுத்து எந்த ஓடு வைக்கப்படும் என்பதை பியரிங் பிட்கள் தீர்மானிக்கின்றன. `` -1`` என்பது வெற்று இடத்தைக் குறிக்கும் ஒரு சிறப்பு மதிப்பு.
tr: Bunu yaptıktan sonra, artık orta sütunda görünür hale gelen **Arazi Eşleştirme Biti** bölümünü yapılandırabilirsiniz. Eşleştirme bitleri, komşu karolara bağlı olarak hangi karonun yerleştirileceğini belirler. ``-1`` boş alanı ifade eden özel bir değerdir.
uk: Зробивши це, тепер ви можете налаштувати розділ **Терраїн Піринг-біти**, який стане видимим у середньому стовпці. Пірингові біти визначають, яку плитку буде розміщено залежно від сусідніх плиток. ``-1`` - це спеціальне значення, яке стосується порожнього простору.
zh_tw: 完成此操作後，你現在可以配置 **地形對等位元** 部分，該部分在中間一列中可見。對等位元決定了根據相鄰圖塊的情況放置哪個圖塊。“-1”是一個特殊值，指的是空位。

source: For example, if a tile has all its bits set to ``0`` or greater, it will only appear if *all* 8 neighboring tiles are using a tile with the same terrain ID. If a tile has its bits set to ``0`` or greater, but the top-left, top and top-right bits are set to ``-1``, it will only appear if there is empty space on top of it (including diagonally).
es: Por ejemplo, si un tile tiene todos sus bits configurados en ``0`` o más, solo aparecerá si *todos* los 8 tiles vecinos están usando un mosaico con el mismo ID de terreno. Si un mosaico tiene sus bits configurados en ``0`` o más, pero los bits superior izquierdo, superior y superior derecho están configurados en ``-1``, solo aparecerá si hay espacios vacíos encima de él (incluyendo en diagonal).
ga: Mar shampla, má tá a ghiotáin go léir socraithe ag tíl go `0`` nó níos mó, ní bheidh sé le feiceáil ach má tá tíleanna comharsanacha uil* ag baint úsáide as tíl leis an ID tíre céanna. Má tá a ghiotáin socraithe ag tíl go `0`` nó níos mó, ach tá na giotáin barr ar chlé, barr agus barr ar dheis socraithe go ``-1``, ní bheidh sé le feiceáil ach má tá spás folamh ar a bharr (lena n-áirítear trasnánach).
ja: 例えば、タイルのすべてのビットが ``0`` 以上に設定されている場合、隣接する8つのタイルすべてが同じ terrain ID のタイルを使用している場合にのみ表示されます。タイルの中央ビットが ``0`` 以上で、かつ左上、上、右上のビットが ``-1`` に設定されている場合、そのタイルの上に（斜めも含めて）何もないスペースがある場合のみ表示されます。
pt_br: Por exemplo, se um tile tiver todos os seus bits configurados como ``0`` ou maior, ele só aparecerá se *todos* os 8 tiles vizinhos estiverem usando um tile com o mesmo ID de terreno. Se um tile tiver seus bits configurados como ``0`` ou maior, mas os bits superior esquerdo, superior e superior direito estiverem configurados como ``-1``, ele só aparecerá se houver espaço vazio acima dele (incluindo na diagonal).
ru: Например, если у тайла все биты установлены на ``0`` или больше, он появится только в том случае, если *все* 8 соседних тайлов используют тайл с тем же идентификатором местности. Если у тайла биты установлены на ``0`` или больше, но верхний левый, верхний и верхний правый биты установлены на ``-1``, он появится только в том случае, если над ним есть пустое место (включая диагональ).
ta: எடுத்துக்காட்டாக, ஒரு ஓடு அதன் அனைத்து பிட்களையும் `` 0`` அல்லது அதற்கு மேற்பட்டதாக அமைத்திருந்தால், * அனைத்து * 8 அண்டை ஓடுகளும் ஒரே நிலப்பரப்பு ஐடியுடன் ஒரு ஓடு பயன்படுத்தினால் மட்டுமே அது தோன்றும். ஒரு ஓடு அதன் பிட்களை `` 0`` அல்லது அதற்கு மேற்பட்டதாக அமைத்திருந்தால், ஆனால் மேல்-இடது, மேல் மற்றும் மேல்-வலது பிட்கள் `` -1`` என அமைக்கப்பட்டால், மேலே வெற்று இடம் இருந்தால் மட்டுமே அது தோன்றும் இது (குறுக்காக உட்பட).
tr: Örneğin, bir karonun tüm bitleri ``0`` veya daha büyük bir değere ayarlanmışsa, yalnızca *tüm* 8 komşu karo aynı arazi kimliğine sahip bir karo kullanıyorsa görünecektir. Bir karonun bitleri ``0`` veya daha büyük olarak ayarlanmışsa, ancak sol üst, üst ve sağ üst bitleri ``-1`` olarak ayarlanmışsa, yalnızca üstünde boş alan varsa (çapraz dahil) görünecektir.
uk: Наприклад, якщо всі біти плитки встановлені на ``0`` або більше, вона з’явиться, лише якщо *всі* 8 сусідніх плиток використовують плитку з однаковим ID місцевості. Якщо біти плитки встановлені на ``0`` або більше, але верхній лівий, верхній і верхній правий біти встановлені на ``-1``, вона з’явиться, лише якщо є порожній простір зверху його (в тому числі по діагоналі).
zh_tw: 例如，如果一個地磚的所有位都設定為 ``0`` 或更大，那麼只有在 *所有* 8個相鄰圖塊都使用具有相同地形 ID 的圖塊時，它才會出現。如果圖塊的位設定為“0”或更大，但左上、上和右上的位設定為“-1”，則只有在其頂部（包括對角線）有空位時才會出現。

source: Configuring terrain peering bits on a single tile in the TileSet editor's Select mode
es: Configuración de bits de emparejamiento de terreno en un solo tile en el modo Seleccionar del editor TileSet
ga: Giotáin piarála tírdhreach a chumrú ar tíl amháin i mód Roghnaigh eagarthóir TileSet
ja: TileSetエディタの選択モードでタイルに terrain peering bits を設定
pt_br: Configurando os bits de conexão de terreno em um tile individual no modo Seleção do editor do TileSet
ru: Настройка битов пиринга (peering) ландшафта на одном тайле в режиме Select редактора TileSet
ta: டைல்செட் எடிட்டரின் தேர்ந்தெடுக்கப்பட்ட பயன்முறையில் ஒரு ஓடில் நிலப்பரப்பு பியரிங் பிட்களை கட்டமைத்தல்
tr: TileSet düzenleyicisinin Seç modunda tek bir karo üzerinde arazi eşleştirme bitlerini yapılandırma
uk: Налаштування бітів пірингу ландшафту на одній плитці в режимі вибору редактора TileSet
zh_tw: 在圖塊集編輯器的選擇模式下配置單個圖塊上的地形對等位

source: An example configuration for a full tilesheet may look as follows:
es: Un ejemplo de configuración de todo un tilesheet podría verse tal que así:
ga: Féadfaidh cuma mar seo a leanas ar chumraíocht shamplach le haghaidh bileog tíleanna iomlán:
ja: タイルシートのフル設定例は以下のようになります:
ru: Пример конфигурации для полного tilesheet может выглядеть следующим образом:
ta: ஒரு முழு டில்சீட்டிற்கான ஒரு எடுத்துக்காட்டு உள்ளமைவு பின்வருமாறு தோன்றலாம்:
tr: Tam bir karo kağıdı için örnek bir yapılandırma aşağıdaki gibi görünebilir:
uk: Приклад конфігурації для повного плиткового листа може виглядати так:
zh_tw: 完整圖塊表的配置範例如下：

source: Example full tilesheet for a sidescrolling game
es: Ejemplo de conjunto de tiles completo para un juego de desplazamiento lateral
ga: Sampla bileog iomlán do chluiche taobh crolling
ja: 横スクロールゲームのタイルシートフル設定例
pt_br: Exemplo de um tilesheet completo para um jogo sidescrolling
ru: Пример полного tilesheet для игры с боковой прокруткой
ta: ஒரு பக்க ச்க்ரோலிங் விளையாட்டுக்கான எடுத்துக்காட்டு முழு ஓடு தாள்
tr: Yandan kaydırmalı bir oyun için örnek bir tam karo kağıdı
uk: Приклад повного набору фішок для гри зі скроллінгом
zh_tw: 橫向磁碟區軸遊戲的完整圖塊表範例

source: Example full tilesheet for a sidescrolling game with terrain peering bits visible
es: Ejemplo de hoja de tiles completa para un juego de desplazamiento lateral con partes de emparejamiento del terreno visibles
ga: Sampla bileog tíleála iomlán le haghaidh cluiche taobh crolling le giotáin piarála tírdhreach le feiceáil
ja: 横スクロールのタイルシートフル設定で terrain peering bits を可視化した例
pt_br: Exemplo de um tilesheet completo para um jogo sidescrolling com os bits de conexão de terreno visíveis
ru: Пример полного tilesheet для игры с боковой прокруткой с видимыми частями ландшафта
ta: எடுத்துக்காட்டு முழு டில்சீட் ஒரு பக்கவாட்டு விளையாட்டுக்கான நிலப்பரப்பு பியரிங் பிட்கள் தெரியும்
tr: Yandan kaydırmalı bir oyun için arazi eşleştirme bitleri görünür olan örnek bir tam karo kağıdı
uk: Приклад повного аркуша для гри з бічною прокруткою з видимими фрагментами рельєфу
zh_tw: 一個橫向磁碟區軸的完整圖塊表範例，帶可見地形對等位

source: Assigning properties to multiple tiles at once
es: Asignar propiedades a varios tiles a la vez
ga: Airíonna a shannadh do iliomad tíleanna ag an am céanna
ja: プロパティを複数のタイルに一斉に割り当てる
pt_br: Atribuindo propriedades a vários tiles de uma vez
ru: Назначение свойств нескольким тайлам одновременно
ta: ஒரே நேரத்தில் பல ஓடுகளுக்கு பண்புகளை ஒதுக்குதல்
tr: Aynı anda birden fazla karoya özellik atama
uk: Призначення властивостей кільком плиткам одночасно
zh_tw: 一次為多個圖塊指定屬性

source: There are two ways to assign properties to multiple tiles at once. Depending on your use cases, one method may be faster than the other:
es: Hay dos formas de asignar propiedades a varios tiles a la vez. Dependiendo de sus casos de uso, un método puede ser más rápido que el otro:
ga: Tá dhá bhealach ann chun airíonna a shannadh do iliomad tíleanna ag an am céanna. Ag brath ar do chásanna úsáide, d'fhéadfadh modh amháin a bheith níos tapa ná an modh eile:
ja: 一度に複数のタイルにプロパティを割り当てるには2つの方法があります。どちらかの方法が速いかは使用例によります:
pt_br: Existem duas maneiras de atribuir propriedades a vários tiles de uma vez. Dependendo do seu caso de uso, um método pode ser mais rápido que o outro:
ru: Существует два способа назначить свойства нескольким тайлам одновременно. В зависимости от ваших вариантов использования один метод может быть быстрее другого:
ta: ஒரே நேரத்தில் பல ஓடுகளுக்கு பண்புகளை ஒதுக்க இரண்டு வழிகள் உள்ளன. உங்கள் பயன்பாட்டு நிகழ்வுகளைப் பொறுத்து, ஒரு முறை மற்றதை விட வேகமாக இருக்கலாம்:
tr: Aynı anda birden fazla karoya özellik atamanın iki yolu vardır. Kullanım durumunuza bağlı olarak, bir yöntem diğerinden daha hızlı olabilir:
uk: Існує два способи призначити властивості кільком плиткам одночасно. Залежно від ваших випадків використання один метод може бути швидшим за інший:
zh_tw: 有兩種方法可以同時為多個圖塊分配屬性。根據你的使用情況，一種方法可能比另一種方法更快：

source: Using multiple tile selection
es: Usando la selección de múltiples tiles
fr: Utiliser la sélection de tuiles multiples
ga: Roghnú tíl iolracha a úsáid
it: Utilizzare la selezione di più tasselli
ja: タイル複数選択を使用する
pt_br: Usando a seleção de vários blocos
ru: Множественное выделение тайлов
ta: பல ஓடு தேர்வைப் பயன்படுத்துதல்
tr: Çoklu karo seçimini kullanma
uk: Використання кількох плиток
zh_tw: 使用多個圖塊選擇

source: If you wish to configure various properties on several tiles at once, choose the **Select** mode at the top of the TileSet editor:
pt_br: Se você deseja configurar várias propriedades em diversos tiles de uma vez, selecione o modo **Seleção** na parte superior do editor de TileSet:
ru: Если вы хотите настроить различные свойства для нескольких тайлов одновременно, выберите режим **Select** в верхней части редактора TileSet:
ta: ஒரே நேரத்தில் பல ஓடுகளில் பல்வேறு பண்புகளை உள்ளமைக்க விரும்பினால், டைல்செட் எடிட்டரின் மேற்புறத்தில் ** தேர்ந்தெடுக்கப்பட்ட ** பயன்முறையைத் தேர்வுசெய்க:
uk: Якщо ви бажаєте налаштувати різні властивості для кількох плиток одночасно, виберіть режим **Вибрати** у верхній частині редактора TileSet:
zh_tw: 如果您希望同時在多個圖塊上設定各種屬性，請在圖塊集編輯器頂部選擇 **選取** 模式：
