Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/your_first_shader/your_second_3d_shader.po
Languages: ga, it, ru, ta, uk, zh_hant

source: ``wave()`` has one parameter, ``position``, which is the same as it is in ``height()``.
ga: Tá paraiméadar amháin ag 'tonn()'', ''seasamh'', atá mar an gcéanna le ''airde()''.
it: ``wave()`` ha un solo parametro, ``position``, che è lo stesso che è in ``height()``.
ta: `` அலை () `` ஒரு அளவுரு உள்ளது, `` நிலை``, இது `` உயரம் () `` இல் உள்ளதைப் போன்றது.
uk: ``wave()`` має один параметр, ``position``, який є таким самим, як і у ``height()``.
zh_hant: ``wave()`` 只有一個參數 ``position``，和 ``height()`` 裡的一樣。

source: We are going to call ``wave()`` multiple times in ``height()`` in order to fake the way waves look.
ga: Táimid chun ''tonn()'' a thabhairt arís agus arís eile in ''airde()'' chun cuma na dtonnta a bhréagnú.
it: Chiameremo ``wave()`` più volte in ``height()`` per simulare l'aspetto delle onde.
ta: அலைகள் தோற்றமளிக்கும் விதத்தை போலியானதற்காக `` உயரம் () `` இல் பல முறை `` அலை () `என்று அழைக்கப் போகிறோம்.
uk: Ми будемо викликати ``wave()`` кілька разів у ``height()``, щоб підробити вигляд хвиль.
zh_hant: 我們會在 ``height()`` 裡多次呼叫 ``wave()``，來組合出各種波浪外觀。

source: At first this looks complicated. So let's go through it line-by-line.
ga: Ar dtús breathnaíonn sé seo casta. Mar sin, a ligean ar dul tríd sé líne-ar-líne.
it: Sembra complicato a prima vista. Pertanto, analizziamolo riga per riga.
ta: முதலில் இது சிக்கலானது. எனவே அதன் வழியாக வரி-மூலம் செல்லலாம்.
uk: Спочатку це виглядає складно. Тож давайте розглянемо це рядок за рядком.
zh_hant: 一開始看起來很複雜，我們就一行一行來解釋。

source: Offset the position by the ``noise`` texture. This will make the waves curve, so they won't be straight lines completely aligned with the grid.
ga: Fritháireamh an tsuímh ag an uigeacht ''torann''. Déanfaidh sé seo cuar na dtonnta, mar sin ní bheidh siad línte díreacha ailínithe go hiomlán leis an ngreille.
it: Compensa la posizione con la texture ``noise``. Questo curverà le onde, affinché non siano linee rette completamente allineate con la griglia.
ta: `` சத்தம்`` அமைப்பால் நிலையை ஈடுசெய்யவும். இது அலைகள் வளைவை உருவாக்கும், எனவே அவை கட்டத்துடன் முழுமையாக சீரமைக்கப்படாது.
uk: Зміщення позиції текстурою ``шум``. Це зробить хвилі кривими, тому вони не будуть прямими лініями, повністю вирівняними з сіткою.
zh_hant: 用 ``noise`` 紋理把位置做偏移，這樣波浪會彎曲，不會完全沿著網格變成直線。

source: Define a wave-like function using ``sin()`` and ``position``. Normally ``sin()`` waves are very round. We use ``abs()`` to absolute to give them a sharp ridge and constrain them to the 0-1 range. And then we subtract it from ``1.0`` to put the peak on top.
ga: Sainmhínigh feidhm cosúil le tonn ag baint úsáide as ''sin()'' agus ''position''. De ghnáth bíonn tonnta ''sin()'' an-chruinn. Bainimid úsáid as ''abs()'' chun iomaire géar a thabhairt dóibh agus srian a chur orthu leis an raon 0-1. Agus ansin bainimid é ó ''1.0'' chun an bhuaic a chur ar a bharr.
it: Definiamo una funzione di tipo onda usando ``sin()`` e ``position``. Normalmente le onde da ``sin()`` sono molto rotonde. Usiamo ``abs()`` per dare loro una cresta netta e limitarle all'intervallo 0-1. Quindi le sottraiamo da ``1.0`` per mettere il picco in alto.
ta: `` ஊழ்கம் () `` மற்றும் `` நிலை`` ஐப் பயன்படுத்தி அலை போன்ற செயல்பாட்டை வரையறுக்கவும். பொதுவாக `` ஊழ்கம் () `` அலைகள் மிகவும் வட்டமானவை. அவர்களுக்கு ஒரு கூர்மையான ரிட்சைக் கொடுத்து அவற்றை 0-1 வரம்பிற்கு கட்டுப்படுத்த `` ஏபிஎச் () `` பயன்படுத்துகிறோம். பின்னர் உச்சத்தை மேலே வைக்க `` 1.0`` இலிருந்து அதைக் கழிக்கிறோம்.
uk: Визначте хвилеподібну функцію за допомогою ``sin()`` і ``position``. Зазвичай хвилі ``sin()`` дуже круглі. Ми використовуємо ``abs()`` для абсолютизації, щоб надати їм різкий хребет і обмежити їх діапазоном 0-1. Потім ми віднімаємо його від ``1.0``, щоб поставити пік зверху.
zh_hant: 用 ``sin()`` 和 ``position`` 定義一個波浪函式。一般 ``sin()`` 波都是圓弧狀，我們用 ``abs()`` 絕對值讓它有明顯波峰，並限制在 0 到 1 的範圍，再用 ``1.0`` 減去它，把波峰推到上方。

source: Multiply the x-directional wave by the y-directional wave and raise it to a power to sharpen the peaks. Then subtract that from ``1.0`` so that the ridges become peaks and raise that to a power to sharpen the ridges.
ga: Méadaigh an tonn x-directional ag an tonn y-directional agus é a ardú go cumhacht chun na beanna a ghéarú. Ansin bain é sin ó ''1.0'' ionas go mbeidh na hiomairí ina mbuaiceanna agus go n-ardóidh siad sin le cumhacht chun faobhar a chur ar na hiomairí.
it: Moltiplica l'onda direzionale x per l'onda direzionale y ed elevalo a una potenza per accentuare i picchi. Quindi sottrai questo risultato da ``1.0`` in modo che le creste diventino picchi e elevalo a una potenza per accentuare i picchi.
ta: எக்ச்-திசை அலையை ஒய்-திசை அலைகளால் பெருக்கி, சிகரங்களைக் கூர்மைப்படுத்த ஒரு சக்திக்கு உயர்த்தவும். பின்னர் `` 1.0`` இலிருந்து கழிக்கவும், இதனால் முகடுகள் உச்சமாகி, முகடுகளை கூர்மைப்படுத்தும் சக்திக்கு உயர்த்தவும்.
uk: Помножте хвилю, спрямовану по x, на хвилю, спрямовану по осі y, і зведіть її до степеня, щоб піки були різкішими. Потім відніміть це значення від ``1.0`` так, щоб хребти стали піками, і зведіть це до степеня, щоб загострити хребти.
zh_hant: 將 x 方向的波和 y 方向的波相乘，並做冪次運算讓波峰更尖銳。再從 ``1.0`` 減去它，讓山脊變成波峰，並再次做冪次運算加強效果。

source: We can now replace the contents of our ``height()`` function with ``wave()``.
ga: Is féidir linn anois ''tonn()'' a chur in ionad ábhar ár bhfeidhm ''airde()''.
it: Ora possiamo sostituire il contenuto della nostra funzione ``height()`` con ``wave()``.
ta: இப்போது எங்கள் `` உயரம் () `செயல்பாட்டின் உள்ளடக்கங்களை` `அலை ()` `உடன் மாற்றலாம்.
uk: Тепер ми можемо замінити вміст нашої функції ``height()`` на ``wave()``.
zh_hant: 現在我們可以直接用 ``wave()`` 取代 ``height()`` 函式的內容。

source: Using this, you get:
ga: Ag baint úsáide as seo, gheobhaidh tú:
it: Utilizzando questo, ottieni:
ta: இதைப் பயன்படுத்தி, நீங்கள் பெறுவீர்கள்:
uk: Використовуючи це, ви отримуєте:
zh_hant: 這樣你會得到：

source: The shape of the sin wave is too obvious. So let's spread the waves out a bit. We do this by scaling ``position``.
ga: Tá cruth na toinne peacaí róshoiléir. Mar sin, déanaimis na tonnta a scaipeadh amach beagán. Déanaimid é seo trí ''seasamh'' a scálú.
it: La forma dell'onda sinusoidale è troppo evidente. Quindi, distribuiamo un po' le onde. Lo facciamo ridimensionando ``position``.
ta: பாவ அலையின் வடிவம் மிகவும் வெளிப்படையானது. எனவே அலைகளை கொஞ்சம் பரப்புவோம். `` நிலை`` அளவிடுவதன் மூலம் இதைச் செய்கிறோம்.
uk: Форма хвилі гріха надто очевидна. Тож давайте трохи розвіємо хвилі. Ми робимо це шляхом масштабування ``position``.
zh_hant: 正弦波的形狀太明顯了，我們把波形拉開一點，用縮放 ``position`` 來做到。

source: Now it looks much better.
ga: Anois tá sé i bhfad níos fearr.
it: Ora sembra molto meglio.
ta: இப்போது அது மிகவும் நன்றாக இருக்கிறது.
uk: Тепер це виглядає набагато краще.
zh_hant: 現在看起來好多了。

source: We can do even better if we layer multiple waves on top of each other at varying frequencies and amplitudes. What this means is that we are going to scale position for each one to make the waves thinner or wider (frequency). And we are going to multiply the output of the wave to make them shorter or taller (amplitude).
ga: Is féidir linn a dhéanamh níos fearr fós má ciseal muid tonnta il ar bharr a chéile ag minicíochtaí éagsúla agus aimplitiúid. Cad a chiallaíonn sé seo go bhfuil muid ag dul chun seasamh scála do gach ceann a dhéanamh ar na tonnta níos tanaí nó níos leithne (minicíocht). Agus táimid chun aschur na toinne a iolrú chun iad a dhéanamh níos giorra nó níos airde (aimplitiúid).
it: Possiamo fare ancora meglio se sovrapponiamo più onde una sopra l'altra a frequenze e ampiezze diverse. Ciò significa che ridimensioneremo la posizione di ciascuna per renderle più sottili o più larghe (frequenza). E moltiplicheremo l'output dell'onda per renderle più corte o più alte (ampiezza).
ta: மாறுபட்ட அதிர்வெண்கள் மற்றும் பெருக்கங்களில் ஒருவருக்கொருவர் மேல் பல அலைகளை அடுக்கினால் நாம் இன்னும் சிறப்பாக செய்ய முடியும். இதன் பொருள் என்னவென்றால், அலைகளை மெல்லியதாகவோ அல்லது பரந்ததாகவோ (அதிர்வெண்) செய்ய ஒவ்வொருவருக்கும் நிலையை அளவிடப் போகிறோம். மேலும் அலைகளின் வெளியீட்டை குறுகியதாகவோ அல்லது உயரமாகவோ (அலைவீச்சு) பெருக்கப் போகிறோம்.
uk: Ми можемо зробити ще краще, якщо накладемо кілька хвиль одна на одну з різними частотами та амплітудами. Це означає, що ми будемо масштабувати положення для кожного з них, щоб зробити хвилі тоншими або ширшими (частота). І ми збираємося помножити вихід хвилі, щоб зробити їх коротшими або вищими (амплітуда).
zh_hant: 如果我們把多個波浪用不同頻率和振幅疊加在一起，效果會更自然。意思就是針對每個波浪調整位置的縮放（頻率），再用不同倍數調整波的高度（振幅）。

source: Here is an example for how you could layer the four waves to achieve nicer looking waves.
ga: Seo sampla do conas a d'fhéadfá na ceithre thonn a chisealú chun tonnta níos deise a bhaint amach.
it: Ecco un esempio di come potresti sovrapporre le quattro onde per ottenere onde più gradevoli.
ta: அழகாக இருக்கும் அலைகளை அடைய நான்கு அலைகளை எவ்வாறு அடுக்க முடியும் என்பதற்கான எடுத்துக்காட்டு இங்கே.
uk: Ось приклад того, як ви можете нашаровувати чотири хвилі, щоб отримати красивіші хвилі.
zh_hant: 這裡有個例子：如何用四層波浪混合出更漂亮的波形。

source: Note that we add time to two and subtract it from the other two. This makes the waves move in different directions creating a complex effect. Also note that the amplitudes (the number the result is multiplied by) all add up to ``1.0``. This keeps the wave in the 0-1 range.
ga: Tabhair faoi deara go gcuirimid am le dhá cheann agus bainimid é ón dá cheann eile. Fágann sé seo go mbogann na tonnta i dtreonna éagsúla ag cruthú éifeacht chasta. Tabhair faoi deara freisin go gcuireann na haimplitiúid (an uimhir a iolraítear an toradh faoi) suas le ''1.0''. Coinníonn sé seo an tonn sa raon 0-1.
it: Noda che sommiamo il tempo a due e lo sottraiamo dalle altre due. Questo fa in modo che le onde si muovano in direzioni diverse, creando un effetto complesso. Nota inoltre che le ampiezze (il numero per cui è moltiplicato il risultato) sommate danno tutte ``1.0``. Questo mantiene l'onda nell'intervallo 0-1.
ta: நாங்கள் இரண்டில் நேரத்தைச் சேர்த்து மற்ற இரண்டிலிருந்து கழிக்கிறோம் என்பதை நினைவில் கொள்க. இது ஒரு சிக்கலான விளைவை உருவாக்கும் அலைகளை வெவ்வேறு திசைகளில் நகர்த்த வைக்கிறது. பெருக்கங்கள் (முடிவு மூலம் பெருக்கப்படுகிறது) அனைத்தும் `` 1.0`` வரை சேர்க்கின்றன என்பதையும் நினைவில் கொள்க. இது அலைகளை 0-1 வரம்பில் வைத்திருக்கிறது.
uk: Зверніть увагу, що ми додаємо час до двох і віднімаємо його від двох інших. Це змушує хвилі рухатися в різних напрямках, створюючи складний ефект. Також зауважте, що всі амплітуди (число, на яке множиться результат) у сумі становлять ``1,0``. Це тримає хвилю в діапазоні 0-1.
zh_hant: 注意：我們把時間加在兩個波浪上，另外兩個則減去時間，這樣波浪就會往不同方向移動產生複雜的效果。另外，所有振幅（也就是乘上的數字）加起來要等於 ``1.0``，這樣波浪才會維持在 0-1 範圍內。

source: With this code you should end up with more complex looking waves and all you had to do was add a bit of math!
ga: Leis an gcód seo ba chóir duit tonnta níos casta a lorg agus ní raibh le déanamh agat ach beagán mata a chur leis!
it: Con questo codice dovresti ottenere onde dall'aspetto più complesso, e tutto ciò che hai dovuto fare è stato aggiungere un po' di matematica!
ta: இந்த குறியீட்டின் மூலம் நீங்கள் மிகவும் சிக்கலான தோற்ற அலைகளுடன் முடிவடைய வேண்டும், நீங்கள் செய்ய வேண்டியதெல்லாம் கணிதத்தை சேர்க்க வேண்டும்!
uk: З цим кодом у вас повинні вийти складніші хвилі, і все, що вам потрібно зробити, це додати трохи математики!
zh_hant: 有了這段程式碼，你就能做出更複雜的波浪效果，只需加點數學運算！

source: For more information about Spatial shaders read the :ref:`Shading Language <doc_shading_language>` doc and the :ref:`Spatial Shaders <doc_spatial_shader>` doc. Also look at more advanced tutorials in the :ref:`Shading section <toc-learn-features-shading>` and the :ref:`3D <toc-learn-features-3d>` sections.
ga: Le tuilleadh eolais a fháil faoi scáthaitheoirí spáis, léigh an :ref:`Shading Language <doc_shading_language>` doc agus an :ref:`Spatial Shaders <doc_spatial_shader>` doc. Breathnaigh freisin ar ranganna teagaisc níos forbartha sna rannáin :ref:`Scáthú <toc-learn-features-scáthú>` agus :ref:`3D <toc-learn-features-3d>`.
it: Per maggiori informazioni sugli shader Spatial, leggi la documentazione :ref:`Shading Language <doc_shading_language>` e la documentazione :ref:`Shader Spatial <doc_spatial_shader>`. Consulta anche i tutorial più avanzati nella :ref:`sezione Shading <toc-learn-features-shading>` e nelle sezioni :ref:`3D <toc-learn-features-3d>`.
ta: இடஞ்சார்ந்த சேடர்களைப் பற்றிய கூடுதல் தகவலுக்கு: ref: `நிழல் மொழி <doc_shading_language>` டாக் மற்றும் தி: ரெஃப்: `இடஞ்சார்ந்த சேடர்கள் <doc_spatial_shader>` ஆவணம். மேலும் மேம்பட்ட பயிற்சிகளைப் பாருங்கள்: ref: `நிழல் பிரிவு <TOC-LEARN-FURES-SHADING>` மற்றும் தி: ref: `3D <TOC-LEARN-FURURES-3D>` பிரிவுகள்.
uk: Щоб дізнатися більше про просторові шейдери, ознайомтеся з документами :ref:`Shading Language <doc_shading_language>` і :ref:`Spatial Shaders <doc_spatial_shader>`. Також подивіться на більш просунуті підручники в :ref:`розділі Shading <toc-learn-features-shading>` і :ref:`3D <toc-learn-features-3d>` розділах.
zh_hant: 更多關於空間著色器的資訊，請參閱 :ref:`Shading Language <doc_shading_language>` 文件與 :ref:`Spatial Shaders <doc_spatial_shader>` 文件。你也可以參考 :ref:`著色 <toc-learn-features-shading>` 以及 :ref:`3D <toc-learn-features-3d>` 章節中的進階教學。

source: Translation status
ru: Статус перевода
