Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/your_first_shader/your_second_3d_shader.po
Languages: ga, it, ru, ta, uk, zh_hant

source: Your second 3D shader
ga: Do dara shader 3D
it: Il tuo secondo shader 3D
ta: உங்கள் இரண்டாவது 3D சேடர்
uk: Ваш другий 3D-шейдер
zh_hant: 你的第二個 3D 著色器

source: From a high-level, what Godot does is give the user a bunch of parameters that can be optionally set (``AO``, ``SSS_Strength``, ``RIM``, etc.). These parameters correspond to different complex effects (Ambient Occlusion, SubSurface Scattering, Rim Lighting, etc.). When not written to, the code is thrown out before it is compiled and so the shader does not incur the cost of the extra feature. This makes it easy for users to have complex PBR-correct shading, without writing complex shaders. Of course, Godot also allows you to ignore all these parameters and write a fully customized shader.
ga: Ó ardleibhéal, is é an rud a dhéanann Godot ná dornán paraiméadar a thabhairt don úsáideoir ar féidir iad a shocrú go roghnach ('AO'', ''SSS_Strength'', ''RIM'', etc.). Freagraíonn na paraiméadair seo d'éifeachtaí casta éagsúla (Occlusion Comhthimpeallach, Scaipeadh SubSurface, Soilsiú Imeall, etc.). Nuair nach bhfuil sé scríofa chuig, caitear amach an cód sula dtiomsaítear é agus mar sin ní thabhaíonn an scáthóir costas na gné breise. Fágann sé seo go bhfuil sé éasca d'úsáideoirí scáthú casta PBR-ceart a bheith acu, gan shaders casta a scríobh. Ar ndóigh, ceadaíonn Godot duit neamhaird a dhéanamh ar na paraiméadair seo go léir agus shader saincheaptha go hiomlán a scríobh.
it: Da un punto di vista generale, quel che fa Godot è fornire all'utente una serie di parametri si possono impostare facoltativamente (``AO``, ``SSS_Strength``, ``RIM``, ecc.). Questi parametri corrispondono a diversi effetti complessi (Ambient Occlusion, SubSurface Scattering, Rim Lighting, ecc.). Se non vi si scrivono, il codice viene scartato prima di essere compilato, e così lo shader evita l'impatto della funzionalità aggiuntiva. Questo rende molto più facile per gli utenti avere ombreggiatura complessa e PBR-correct, senza dover scrivere shader complessi. Naturalmente, Godot consente anche di ignorare tutti questi parametri e di scrivere uno shader completamente personalizzato.
ru: На высоком уровне, то, что делает Godot, дает пользователю кучу параметров, которые можно установить по желанию (``AO``, ``SSS_Strength``, ``RIM`` и т.д.). Эти параметры соответствуют различным сложным эффектам (Ambient Occlusion, SubSurface Scattering, Rim Lighting и т.д.). Если эти параметры не записаны, код выбрасывается до компиляции, и таким образом шейдер не несет затрат на дополнительную функцию. Это позволяет пользователям легко получить сложное PBR-корректное затенение без написания сложных шейдеров. Конечно, Godot также позволяет игнорировать все эти параметры и написать полностью индивидуальный шейдер.
ta: ஒரு உயர் மட்டத்திலிருந்து, கோடோட் என்ன செய்வது என்பது பயனருக்கு விருப்பமாக அமைக்கக்கூடிய அளவுருக்களைக் கொடுக்கும் (`` ao``, `` sss_strength``, `` ரிம்``, முதலியன). இந்த அளவுருக்கள் வெவ்வேறு சிக்கலான விளைவுகளுக்கு (சுற்றுப்புற மறைவு, மேற்பரப்பு சிதறல், விளிம்பு விளக்குகள் போன்றவை) ஒத்திருக்கும். எழுதப்படாதபோது, குறியீடு தொகுக்கப்படுவதற்கு முன்பு வெளியேற்றப்படும், எனவே சேடர் கூடுதல் அம்சத்தின் விலையை ஏற்படுத்தாது. சிக்கலான சேடர்களை எழுதாமல், பயனர்களுக்கு சிக்கலான பிபிஆர்-சரியான நிழல் இருப்பதை இது எளிதாக்குகிறது. நிச்சயமாக, இந்த அளவுருக்கள் அனைத்தையும் புறக்கணிக்கவும், முழுமையாக தனிப்பயனாக்கப்பட்ட நிழலை எழுதவும் கோடோட் உங்களை அனுமதிக்கிறது.
uk: На високому рівні Godot надає користувачеві низку параметрів, які можна за бажанням встановити (``AO``, ``SSS_Strength``, ``RIM`` тощо). Ці параметри відповідають різним комплексним ефектам (Ambient Occlusion, SubSurface Scattering, Rim Lighting тощо). Якщо код не записується, він викидається до компіляції, тому шейдер не бере на себе витрати на додаткові функції. Це спрощує для користувачів складне PBR-коректне затінення без написання складних шейдерів. Звичайно, Godot також дозволяє ігнорувати всі ці параметри та писати повністю налаштований шейдер.
zh_hant: 從高階來看，Godot 提供給使用者一組可以選擇設定的參數（如 ``AO``、``SSS_Strength``、``RIM`` 等）。這些參數對應到不同的複雜效果（環境光遮蔽，次表面散射，邊緣光等）。如果沒有對這些參數賦值，對應的程式碼會在編譯前被移除，因此著色器不會產生額外的效能負擔。這讓使用者能夠輕鬆享有複雜且正確的 PBR 著色效果，而無需撰寫複雜的著色器。當然，Godot 也允許你完全忽略這些參數，直接撰寫完全自訂的著色器。

source: For a full list of these parameters see the :ref:`spatial shader <doc_spatial_shader>` reference doc.
ga: Le haghaidh liosta iomlán de na paraiméadair seo, féach an :ref:`spatial shader <doc_spatial_shader>` tagairt doc.
it: Per un elenco completo di questi parametri, consulta il documento di riferimento :ref:`spatial shader <doc_spatial_shader>`.
ta: இந்த அளவுருக்களின் முழு பட்டியலுக்கு: ref: `இடஞ்சார்ந்த சேடர் <doc_spatial_shader>` குறிப்பு ஆவணம்.
uk: Щоб отримати повний список цих параметрів, перегляньте довідковий документ :ref:`spatial shader <doc_spatial_shader>`.
zh_hant: 完整參數列表請參考 :ref:`空間著色器 <doc_spatial_shader>` 文件。

source: A difference between the vertex function and a fragment function is that the vertex function runs per vertex and sets properties such as ``VERTEX`` (position) and ``NORMAL``, while the fragment shader runs per pixel and, most importantly, sets the ``ALBEDO`` color of the :ref:`MeshInstance3D<class_MeshInstance3D>`.
ga: Difríocht idir feidhm rinn agus feidhm blúirí is ea go ritheann an fheidhm rinn in aghaidh na rinn agus go socraíonn sí airíonna mar ``VERTEX`` (suíomh) agus ``NORMAL``, fad a ritheann an scáthlán blúirí in aghaidh na picteilín agus, níos tábhachtaí fós, socraíonn sé dath ``ALBEDO`` an :ref:`MeshInstance3D <class_MeshInstance3D>`.
it: Una differenza tra la funzione vertex e la funzione fragment è che la funzione vertex è eseguita per ogni vertice e imposta proprietà quali ``VERTEX`` (posizione) e ``NORMAL``, mentre lo shader fragment è eseguito per ogni pixel e, cosa più importante, imposta il colore ``ALBEDO`` del :ref:`MeshInstance3D<class_MeshInstance3D>`.
ta: வெர்டெக்ச் செயல்பாட்டிற்கும் ஒரு துண்டு செயல்பாட்டிற்கும் இடையிலான வேறுபாடு என்னவென்றால், வெர்டெக்ச் செயல்பாடு ஒரு வெர்டெக்சுக்கு இயங்குகிறது மற்றும் `` வெர்டெக்ச்`` (நிலை) மற்றும் `` இயல்பானது`` போன்ற பண்புகளை அமைக்கிறது, அதே நேரத்தில் துண்டு சேடர் பிக்சலுக்கு இயங்கும் மற்றும் மிக முக்கியமாக, `` ஆல்பிடோ`` வண்ணத்தை அமைக்கிறது: குறிப்பு: `meshinstance3d <class_meshinstance3d>`.
uk: Різниця між вершинною функцією та фрагментною функцією полягає в тому, що вершинна функція виконується для кожної вершини та встановлює такі властивості, як ``VERTEX`` (позиція) і ``NORMAL``, тоді як фрагментний шейдер працює для кожного пікселя і, що найважливіше, встановлює колір ``ALBEDO`` для :ref:`MeshInstance3D<class_MeshInstance3D>`.
zh_hant: 頂點函式和片段函式的差異在於，頂點函式是針對每個頂點運作並設定像是 ``VERTEX``（位置）和 ``NORMAL`` 等屬性，而片段著色器則是針對每個像素運作，最重要的是設定 :ref:`MeshInstance3D<class_MeshInstance3D>` 的 ``ALBEDO`` 顏色。

source: Your first spatial fragment function
ga: Do chéad fheidhm blúire spásúil
it: La tua prima funzione fragment spatial
ta: உங்கள் முதல் இடஞ்சார்ந்த துண்டு செயல்பாடு
uk: Ваша перша функція просторового фрагмента
zh_hant: 你的第一個空間片段函式

source: As mentioned in the previous part of this tutorial. The standard use of the fragment function in Godot is to set up different material properties and let Godot handle the rest. In order to provide even more flexibility, Godot also provides things called render modes. Render modes are set at the top of the shader, directly below ``shader_type``, and they specify what sort of functionality you want the built-in aspects of the shader to have.
ga: Mar a luadh sa chuid roimhe seo den rang teagaisc seo. Is é an úsáid chaighdeánach a bhaint as an fheidhm ilroinnte i Godot a chur ar bun airíonna ábhar éagsúla agus lig Godot láimhseáil an chuid eile. D'fhonn níos mó solúbthachta a chur ar fáil, soláthraíonn Godot rudaí ar a dtugtar modhanna rindreála freisin. Socraítear modhanna rindreála ag barr an shader, go díreach faoi bhun ''shader_type'', agus sonraíonn siad cén cineál feidhmiúlachta is mian leat a bheith ag na gnéithe tógtha den shader.
it: Come accennato nella parte precedente di questo tutorial, l'uso standard della funzione "fragment" in Godot è quello di impostare diverse proprietà dei materiali e lasciare che Godot si occupi del resto. Per offrire ancora più flessibilità, Godot offre anche le cosiddette modalità di rendering. Le modalità di rendering si impostano in cima allo shader, direttamente sotto ``shader_type``, e specificano il tipo di funzionalità che si desidera assegnare agli aspetti integrati dello shader.
ru: Как уже упоминалось в предыдущей части этого руководства. Стандартное использование функции фрагмента в Godot - это установка различных свойств материала и предоставление Godot сделать все остальное. Для того чтобы обеспечить еще большую гибкость, Godot также предоставляет вещи, называемые режимами рендеринга. Режимы рендеринга устанавливаются в верхней части шейдера, непосредственно под ``shader_type``, и они определяют, какой функциональностью вы хотите наделить встроенные аспекты шейдера.
ta: இந்த டுடோரியலின் முந்தைய பகுதியில் குறிப்பிட்டுள்ளபடி. கோடோட்டில் துண்டு செயல்பாட்டின் நிலையான பயன்பாடு வெவ்வேறு பொருள் பண்புகளை அமைத்து, மீதமுள்ளவற்றைக் கையாள வேண்டும். இன்னும் நெகிழ்வுத்தன்மையை வழங்குவதற்காக, கோடோட் வழங்குதல் முறைகள் எனப்படும் விசயங்களையும் வழங்குகிறது. வழங்குதல் முறைகள் சேடரின் மேற்புறத்தில் அமைக்கப்பட்டுள்ளன, நேரடியாக `` shader_type``, மேலும் சேடரின் உள்ளமைக்கப்பட்ட நற்பொருத்தங்கள் என்ன வகையான செயல்பாட்டை நீங்கள் விரும்புகிறீர்கள் என்பதை அவை குறிப்பிடுகின்றன.
uk: Як згадувалося в попередній частині цього посібника. Стандартне використання функції фрагмента в Godot полягає в тому, щоб налаштувати різні властивості матеріалу та дозволити Godot впоратися з рештою. Щоб забезпечити ще більшу гнучкість, Godot також надає речі, які називаються режимами візуалізації. Режими візуалізації встановлюються у верхній частині шейдера, безпосередньо під ``shader_type``, і вони визначають, яку функціональність ви хочете мати у вбудованих аспектах шейдера.
zh_hant: 如同本教學前面所提到，在 Godot 中片段函式的標準用法是設定不同的材質屬性，剩下的則交由 Godot 處理。為了提供更大的彈性，Godot 也提供了所謂的算繪模式（render modes）。算繪模式設定在著色器最上方，緊接在 ``shader_type`` 下面，用來指定你希望著色器內建有哪些功能。

source: For example, if you do not want to have lights affect an object, set the render mode to ``unshaded``:
ga: Mar shampla, mura mian leat go mbeadh tionchar ag soilse ar rud, socraigh an modh rindreála go ''unshaded'':
it: Ad esempio, se non vuoi che le luci influenzino un oggetto, imposta la modalità di rendering su ``unshaded``:
ta: எடுத்துக்காட்டாக, விளக்குகள் ஒரு பொருளை பாதிக்க விரும்பவில்லை என்றால், வழங்குதல் பயன்முறையை `` அசைக்கப்படாத`` க்கு அமைக்கவும்:
uk: Наприклад, якщо ви не хочете, щоб світло впливало на об’єкт, встановіть режим візуалізації на ``unshaded``:
zh_hant: 例如，如果你不希望燈光影響物件，可以將算繪模式設為 ``unshaded``：

source: You can also stack multiple render modes together. For example, if you want to use toon shading instead of more-realistic PBR shading, set the diffuse mode and specular mode to toon:
ga: Is féidir leat Stack freisin modhanna rindreála il le chéile. Mar shampla, más mian leat scáthú toon a úsáid in ionad scáthú PBR níos réadúla, socraigh an modh idirleata agus an modh specular chun toon:
it: È anche possibile impilare più modalità di rendering assieme. Ad esempio, se si desidera utilizzare l'ombreggiatura toon invece della più realistica ombreggiatura PBR, imposta la modalità diffusa e quella speculare su toon:
ta: நீங்கள் பல வழங்குதல் முறைகளையும் ஒன்றாக அடுக்கி வைக்கலாம். எடுத்துக்காட்டாக, நீங்கள் மேலும்-யதார்த்தமான பிபிஆர் நிழலுக்கு பதிலாக டூன் நிழலைப் பயன்படுத்த விரும்பினால், பரவலான பயன்முறை மற்றும் ஏகப்பட்ட பயன்முறையை டூனுக்கு அமைக்கவும்:
uk: Ви також можете поєднати кілька режимів візуалізації разом. Наприклад, якщо ви хочете використовувати мультяшне затінення замість більш реалістичного затінення PBR, встановіть дифузний режим і дзеркальний режим на мультяшне:
zh_hant: 你也可以同時套用多個算繪模式。例如，如果你想要用卡通著色而非寫實的 PBR 著色，可以把漫反射模式和高光模式都設為 toon：

source: This model of built-in functionality allows you to write complex custom shaders by changing only a few parameters.
ga: Ligeann an tsamhail seo d'fheidhmiúlacht ionsuite duit shaders saincheaptha casta a scríobh trí chúpla paraiméadar a athrú.
it: Questo modello di funzionalità integrata consente di scrivere shader personalizzati complessi cambiando solo pochi parametri.
ta: உள்ளமைக்கப்பட்ட செயல்பாட்டின் இந்த மாதிரி சில அளவுருக்களை மட்டுமே மாற்றுவதன் மூலம் சிக்கலான தனிப்பயன் சேடர்களை எழுத உங்களை அனுமதிக்கிறது.
uk: Ця модель вбудованої функціональності дозволяє писати складні власні шейдери, змінюючи лише кілька параметрів.
zh_hant: 這種內建功能模型讓你只需調整幾個參數，就能寫出複雜的自訂著色器。

source: For a full list of render modes see the :ref:`Spatial shader reference <doc_spatial_shader>`.
ga: Le haghaidh liosta iomlán de mhodhanna rindreála féach an :ref:`Tagairt scáthaithe spáis <doc_spatial_shader>`.
it: Per un elenco completo delle modalità di rendering, consulta il :ref:`Riferimento di shader Spatial <doc_spatial_shader>`.
ru: Полный список режимов рендера смотрите в :ref:`Spatial shader reference <doc_spatial_shader>`.
ta: வழங்குதல் முறைகளின் முழு பட்டியலுக்கு: குறிப்பு: `இடஞ்சார்ந்த சேடர் குறிப்பு <doc_spatial_shader>`.
uk: Щоб отримати повний список режимів візуалізації, перегляньте :ref:`довідку про просторовий шейдер <doc_spatial_shader>`.
zh_hant: 完整的算繪模式列表請參考 :ref:`空間著色器參考 <doc_spatial_shader>` 文件。

source: In this part of the tutorial, we will walk through how to take the bumpy terrain from the previous part and turn it into an ocean.
ga: Sa chuid seo den rang teagaisc, siúlfaimid tríd an gcaoi leis an tír-raon cnapánach a thógáil ón gcuid roimhe seo agus é a iompú ina aigéan.
it: In questa parte del tutorial, spiegheremo come prendere il terreno irregolare della parte precedente e trasformarlo in un oceano.
ta: டுடோரியலின் இந்த பகுதியில், முந்தைய பகுதியிலிருந்து சமதள நிலப்பரப்பை எவ்வாறு எடுத்து அதை கடலாக மாற்றுவது என்று நாங்கள் நடந்து செல்வோம்.
uk: У цій частині підручника ми розповімо, як взяти вибоїсту місцевість із попередньої частини та перетворити її на океан.
zh_hant: 在本教學這一部分，我們會說明如何把前一部分的崎嶇地形變成海洋。

source: First let's set the color of the water. We do that by setting ``ALBEDO``.
ga: Ar dtús socraímis dath an uisce. Déanaimid é sin trí ''ALBEDO'' a leagan síos.
it: Cominciamo impostando il colore dell'acqua. Lo facciamo impostando ``ALBEDO``.
ta: முதலில் தண்ணீரின் நிறத்தை அமைப்போம். `` ஆல்பிடோ`` அமைப்பதன் மூலம் அதைச் செய்கிறோம்.
uk: Спочатку встановимо колір води. Ми робимо це, встановлюючи ``ALBEDO``.
zh_hant: 首先，來設定水的顏色。我們可以直接設定 ``ALBEDO``。

source: ``ALBEDO`` is a ``vec3`` that contains the color of the object.
ga: Is ''vec3'' é ''ALBEDO'' ina bhfuil dath an réada.
it: ``ALBEDO`` è un ``vec3`` che contiene il colore dell'oggetto.
ta: `` ஆல்பிடோ`` என்பது ஒரு `` vec3`` இது பொருளின் நிறத்தைக் கொண்டுள்ளது.
uk: ``ALBEDO`` - це ``vec3``, який містить колір об'єкта.
zh_hant: ``ALBEDO`` 是一個 ``vec3``，用來表示物件的顏色。

source: Let's set it to a nice shade of blue.
ga: Cuirimis faoi scáth deas gorm é.
it: Impostiamolo su una bella tonalità di blu.
ru: Давайте установим красивый оттенок синего.
ta: அதை நீல நிறத்தின் நல்ல நிழலாக அமைப்போம்.
uk: Давайте встановимо гарний відтінок синього.
zh_hant: 我們來把它設成好看的藍色。

source: We set it to a very dark shade of blue because most of the blueness of the water will come from reflections from the sky.
ga: Leagamar é le scáth an-dorcha gorm mar go dtiocfaidh an chuid is mó de ghoirm an uisce ó mhachnamh ón spéir.
it: Lo abbiamo impostato su una tonalità di blu molto scura perché la maggioranza del blu dell'acqua proverrà dai riflessi del cielo.
ru: Мы установили очень темный оттенок синего, потому что большая часть синевы воды будет обусловлена отражением от неба.
ta: நாங்கள் அதை நீல நிறத்தின் மிகவும் இருண்ட நிழலுக்கு அமைத்தோம், ஏனென்றால் நீரின் நீல நிறங்கள் வானத்திலிருந்து பிரதிபலிப்புகளிலிருந்து வரும்.
uk: Ми встановлюємо дуже темний відтінок синього, тому що більша частина блакитного відтінку води походить від відблисків неба.
zh_hant: 我們把它設為非常深的藍色，因為水的藍色多半來自天空的反射。

source: The PBR model that Godot uses relies on two main parameters: ``METALLIC`` and ``ROUGHNESS``.
ga: Braitheann an tsamhail PBR a úsáideann Godot ar dhá phríomhpharaiméadar: ''METALLIC'' agus ''ROUGHNESS''.
it: Il modello PBR utilizzato da Godot si basa su due parametri principali: ``METALLIC`` e ``ROUGHNESS``.
ru: Модель PBR, которую использует Godot, опирается на два основных параметра: ``МЕТАЛЛИЧЕСКИЙ`` и ``РОГАННОСТЬ``.
ta: கோடோட் பயன்படுத்தும் பிபிஆர் மாதிரி இரண்டு முக்கிய அளவுருக்களை நம்பியுள்ளது: `` மெட்டாலிக்`` மற்றும் `` கடினத்தன்மை`.
uk: Модель PBR, яку використовує Годо, спирається на два основні параметри: ``МЕТАЛ`` і ``ШОРСТКІСТЬ``.
zh_hant: Godot 使用的 PBR 模型主要依賴兩個參數：「金屬度」（``METALLIC``）與「粗糙度」（``ROUGHNESS``）。

source: ``ROUGHNESS`` specifies how smooth/rough the surface of a material is. A low ``ROUGHNESS`` will make a material appear like a shiny plastic, while a high roughness makes the material appear more solid in color.
ga: Sonraíonn ''ROUGHNESS'' cé chomh réidh/garbh is atá dromchla ábhair. Déanfaidh ''ROUGHNESS'' íseal ábhar cosúil le plaisteach lonrach, agus fágann gairbhe ard go bhfuil dath níos soladach ar an ábhar.
it: ``ROUGHNESS`` specifica quanto è liscia/ruvida la superficie di un materiale. Una ``ROUGHNESS`` bassa farà apparire il materiale come una plastica lucida, mentre una rugosità elevata farà apparire il materiale più uniforme nel colore.
ru: ``ROUGHNESS`` определяет, насколько гладкой/шероховатой является поверхность материала. Низкая ``ROUGHNESS`` сделает материал похожим на блестящий пластик, в то время как высокая шероховатость заставит материал казаться более твердым по цвету.
ta: `` கடினத்தன்மை`` ஒரு பொருளின் மேற்பரப்பு எவ்வளவு மென்மையானது/கடினமானதாக இருக்கிறது என்பதைக் குறிப்பிடுகிறது. ஒரு குறைந்த `` கடினத்தன்மை`` ஒரு பொருள் பளபளப்பான பிளாச்டிக் போல தோன்றும், அதே நேரத்தில் அதிக கடினத்தன்மை பொருள் மிகவும் திடமான நிறத்தில் தோன்றும்.
uk: ``ROUGHNESS`` визначає, наскільки гладка/шорстка поверхня матеріалу. Низька шорсткість зробить матеріал схожим на блискучий пластик, тоді як висока шорсткість зробить матеріал більш твердим за кольором.
zh_hant: ``ROUGHNESS`` 決定材質表面的平滑或粗糙程度。較低的 ``ROUGHNESS`` 會讓材質看起來像閃亮的塑膠，較高的 ``ROUGHNESS`` 則會讓顏色更為沉穩不反光。

source: ``METALLIC`` specifies how much like a metal the object is. It is better set close to ``0`` or ``1``. Think of ``METALLIC`` as changing the balance between the reflection and the ``ALBEDO`` color. A high ``METALLIC`` almost ignores ``ALBEDO`` altogether, and looks like a mirror of the sky. While a low ``METALLIC`` has a more equal representation of sky color and ``ALBEDO`` color.
ga: Sonraíonn ''MIOTALACH'' cé mhéad cosúil le miotal atá sa réad. Is fearr é a shocrú gar do ''0'' nó ''1''. Smaoinigh ar ''METALLIC'' mar athrú ar an gcothromaíocht idir an machnamh agus an dath ''ALBEDO''. Déanann ''METALLIC'' ard neamhaird beagnach ar ''ALBEDO'' ar fad, agus tá sé cosúil le scáthán ar an spéir. Cé go bhfuil léiriú níos cothroime ar dhath na spéire agus ar dhath ''ALBEDO'' íseal ''MIOTALACH''.
it: ``METALLIC`` specifica quanto l'oggetto sia simile a un metallo. È preferibile impostarlo vicino a ``0`` o ``1``. Pensa che ``METALLIC`` modifichi l'equilibrio tra la riflessione e il colore ``ALBEDO``. Un valore ``METALLIC`` alto ignora quasi completamente ``ALBEDO`` e appare come uno specchio del cielo. Mentre un valore ``METALLIC`` basso ha una rappresentazione più equilibrata del colore del cielo e del colore ``ALBEDO``.
ru: ``METALLIC`` определяет, насколько объект похож на металл. Лучше установить значение, близкое к ``0`` или ``1``. Думайте о ``METALLIC`` как об изменении баланса между отражением и цветом ``ALBEDO``. При высоком ``METALLIC`` почти полностью игнорируется ``ALBEDO`` и выглядит как зеркало неба. В то время как низкий ``METALLIC`` имеет более равное представление цвета неба и ``ALBEDO``.
ta: `` மெட்டாலிக்`` பொருள் எவ்வளவு உலோகத்தைப் போன்றது என்பதைக் குறிப்பிடுகிறது. இது `` 0`` அல்லது `` 1`` க்கு நெருக்கமாக அமைக்கப்பட்டுள்ளது. `` மெட்டாலிக்`` ஐ பிரதிபலிப்புக்கும் `ஆல்பிடோ`` வண்ணத்திற்கும் இடையிலான சமநிலையை மாற்றுவதாக நினைத்துப் பாருங்கள். ஒரு உயர் `` மெட்டாலிக்`` கிட்டத்தட்ட `` ஆல்பிடோ`` ஐ முற்றிலும் புறக்கணிக்கிறது, மேலும் வானத்தின் கண்ணாடியைப் போல் தெரிகிறது. குறைந்த `` மெட்டாலிக்`` வானம் நிறத்தின் சமமான பிரதிநிதித்துவத்தையும் `` ஆல்பிடோ`` வண்ணத்தையும் கொண்டுள்ளது.
uk: ``METALLIC`` визначає, наскільки об'єкт схожий на метал. Краще встановити близько до ``0`` або ``1``. Подумайте про ``METALLIC`` як про зміну балансу між відображенням і кольором ``ALBEDO``. Високий ``METALLIC`` майже ігнорує ``ALBEDO`` взагалі, і виглядає як дзеркало неба. Тоді як низький ``METALLIC`` має більш рівне представлення кольору неба та кольору ``ALBEDO``.
zh_hant: ``METALLIC`` 指定物體的金屬感強度，建議設為接近 ``0`` 或 ``1``。你可以把 ``METALLIC`` 想成是在反射與 ``ALBEDO`` 顏色間做平衡。高 ``METALLIC`` 幾乎完全忽略 ``ALBEDO``，看起來就像天空的鏡子；低 ``METALLIC`` 則讓天空色與 ``ALBEDO`` 顏色都能表現出來。

source: ``ROUGHNESS`` increases from ``0`` to ``1`` from left to right while ``METALLIC`` increase from ``0`` to ``1`` from top to bottom.
ga: Méadaíonn ''ROUGHNESS'' ó ''0'' go ''1'' ó chlé go deas agus méadaíonn ''METALLIC'' ó ''0'' go ''1'' ó bhun go barr.
it: ``ROUGHNESS`` aumenta da ``0`` a ``1`` da sinistra a destra, mentre ``METALLIC`` aumenta da ``0`` a ``1`` dall'alto verso il basso.
ru: ``ROUGHNESS`` увеличивается от ``0`` к ``1`` слева направо, а ``METALLIC`` увеличивается от ``0`` к ``1`` сверху вниз.
ta: `` கரடுமுரடான`` `` 0`` இலிருந்து `1`` இடமிருந்து வலமாக அதிகரிக்கிறது, அதே நேரத்தில்` `0`` முதல்` 1`` வரை மேலிருந்து கீழாக அதிகரிக்கும்.
uk: ``ШОРСТКІСТЬ`` збільшується від ``0`` до ``1`` зліва направо, а ``МЕТАЛІК`` збільшується від ``0`` до ``1`` зверху вниз.
zh_hant: ``ROUGHNESS`` （粗糙度）從左到右由 ``0`` 增加到 ``1`` ， ``METALLIC`` （金屬度）則從上到下由 ``0`` 增加到 ``1`` 。

source: ``METALLIC`` should be close to ``0`` or ``1`` for proper PBR shading. Only set it between them for blending between materials.
ga: Ba chóir go mbeadh ''METALLIC'' gar do ''0'' nó ''1'' le haghaidh scáthú cuí PBR. Ná socraigh ach é eatarthu chun meascadh idir ábhair.
it: ``METALLIC`` dovrebbe essere vicino a ``0`` o ``1`` per una corretta ombreggiatura PBR. Impostalo solo tra questi due valori per fondere tra materiali.
ru: ``METALLIC`` должен быть близок к ``0`` или ``1`` для правильного затенения PBR. Для смешивания материалов устанавливайте только между ними.
ta: `` மெட்டாலிக்`` சரியான பிபிஆர் நிழலுக்கு `0`` அல்லது` 1`` க்கு நெருக்கமாக இருக்க வேண்டும். பொருட்களுக்கு இடையில் கலப்பதற்கு மட்டுமே அதை அமைக்கவும்.
uk: ``METALLIC`` має бути близьким до ``0`` або ``1`` для правильного затінення PBR. Встановлюйте його лише між ними для змішування між матеріалами.
zh_hant: 正確的 PBR 著色時，``METALLIC`` 應接近 ``0`` 或 ``1``，只有在材質混合時才設在兩者之間。
