Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/your_first_shader/your_second_3d_shader.po
Languages: ga, it, ru, ta, uk, zh_hant

source: Water is not a metal, so we will set its ``METALLIC`` property to ``0.0``. Water is also highly reflective, so we will set its ``ROUGHNESS`` property to be quite low as well.
ga: Ní miotal é an t-uisce, mar sin socróimid a mhaoin ''MIOTALACH'' go ''0.0''. Tá uisce an-mhachnamhach freisin, mar sin socróidh muid a mhaoin ''ROUGHNESS'' a bheith íseal go leor chomh maith.
it: L'acqua non è un metallo, quindi imposteremo la sua proprietà ``METALLIC`` su ``0.0``. L'acqua è anche altamente riflettente, quindi imposteremo anche la sua proprietà ``ROUGHNESS`` su un valore piuttosto basso.
ru: Вода не является металлом, поэтому мы установим ее свойство ``METALLIC`` на ``0.0``. Вода также обладает высокой отражательной способностью, поэтому мы установим ее свойство ``ROUGHNESS`` на довольно низком уровне.
ta: நீர் ஒரு உலோகம் அல்ல, எனவே அதன் `` உலோக`` சொத்தை `` 0.0`` ஆக அமைப்போம். தண்ணீரும் மிகவும் பிரதிபலிக்கும், எனவே அதன் `` கடினத்தன்மை`` சொத்துக்களும் மிகக் குறைவாக இருக்கும்.
uk: Вода не є металом, тому ми встановимо для її властивості ``METALLIC`` значення ``0.0``. Вода також має високу відбивну здатність, тому ми також встановимо її властивість ``ШОРСТКІСТЬ`` досить низькою.
zh_hant: 水不是金屬，所以我們把 ``METALLIC`` 設為 ``0.0``。水的反射性很高，因此 ``ROUGHNESS`` 也要設得很低。

source: Now we have a smooth plastic looking surface. It is time to think about some particular properties of water that we want to emulate. There are two main ones that will take this from a weird plastic surface to nice stylized water. The first is specular reflections. Specular reflections are those bright spots you see from where the sun reflects directly into your eye. The second is fresnel reflectance. Fresnel reflectance is the property of objects to become more reflective at shallow angles. It is the reason why you can see into water below you, but farther away it reflects the sky.
ga: Anois tá dromchla réidh plaisteach againn. Tá sé in am smaoineamh ar roinnt airíonna áirithe uisce ar mhaith linn aithris a dhéanamh orthu. Tá dhá phríomhcheann ann a thógfaidh é seo ó dhromchla plaisteach aisteach go huisce deas stílithe. Is é an chéad mhachnamh specular. Is éard atá i gceist le machnamh amhantrach ná na spotaí geala sin a fheiceann tú ón áit a léiríonn an ghrian go díreach isteach i do shúil. Is é an dara ceann frithchaitheamh fresnel. Is éard is frithchaiteachas fresnel ann ná maoin rudaí le bheith níos machnamhaí ag uillinneacha éadomhain. Is é an fáth gur féidir leat a fheiceáil isteach in uisce thíos tú, ach níos faide ar shiúl léiríonn sé an spéir.
it: Ora abbiamo una superficie liscia dall'aspetto plastico. È il momento di pensare ad alcune proprietà specifiche dell'acqua che vogliamo emulare. Ce ne sono due principali che trasformeranno questa strana superficie plastica in un'acqua piacevolmente stilizzata. La prima sono i riflessi speculari, ovvero quei punti luminosi che vedi dove il sole riflette direttamente nei tuoi occhi. La seconda è la riflettanza di Fresnel, ovvero la proprietà degli oggetti di diventare più riflettenti ad angolazioni ridotte. È il motivo per cui puoi vedere nell'acqua da sotto di te, ma più lontano riflette il cielo.
ru: Теперь у нас есть гладкая поверхность, похожая на пластик. Пришло время подумать о некоторых свойствах воды, которые мы хотим имитировать. Есть два основных свойства, которые позволят нам превратить странную пластиковую поверхность в красивую стилизованную воду. Первое - это зеркальные отражения. Спекулярные отражения - это яркие пятна, которые вы видите, когда солнце отражается прямо в ваш глаз. Второе - отражение Френеля. Отражение Френеля - это свойство объектов становиться более отражающими под небольшим углом. Именно по этой причине вы можете видеть воду под собой, а вдали от вас отражается небо.
ta: இப்போது நம்மிடம் மென்மையான பிளாச்டிக் தேடும் மேற்பரப்பு உள்ளது. நாம் பின்பற்ற விரும்பும் சில குறிப்பிட்ட நீரின் பண்புகளைப் பற்றி சிந்திக்க வேண்டிய நேரம் இது. இது ஒரு வித்தியாசமான பிளாச்டிக் மேற்பரப்பில் இருந்து நல்ல பகட்டான தண்ணீருக்கு எடுத்துச் செல்லும் இரண்டு முக்கிய விசயங்கள் உள்ளன. முதலாவது ஏகப்பட்ட பிரதிபலிப்புகள். ஏகப்பட்ட பிரதிபலிப்புகள் என்பது சூரியன் உங்கள் கண்ணில் நேரடியாக பிரதிபலிக்கும் இடத்திலிருந்து நீங்கள் காணும் பிரகாசமான இடங்கள். இரண்டாவது ஃப்ரெச்னல் பிரதிபலிப்பு. ஃப்ரெச்னல் பிரதிபலிப்பு என்பது ஆழமற்ற கோணங்களில் மிகவும் பிரதிபலிக்கும் பொருள்களின் சொத்து. உங்களுக்கு கீழே உள்ள தண்ணீரில் நீங்கள் காண இது காரணம், ஆனால் தொலைவில் அது வானத்தை பிரதிபலிக்கிறது.
uk: Тепер ми маємо гладку пластикову поверхню. Настав час подумати про деякі особливі властивості води, які ми хочемо наслідувати. Є два основних, які перенесуть це від дивної пластикової поверхні до красивої стилізованої води. По-перше, це дзеркальні відбиття. Дзеркальне відображення – це ті яскраві плями, які ви бачите звідти, де сонце відбивається прямо у ваше око. По-друге, це коефіцієнт відбиття Френеля. Коефіцієнт відбиття Френеля — це властивість об’єктів ставати більш відбиваючими під невеликими кутами. Це причина, чому ви можете бачити воду під собою, але далі вона відображає небо.
zh_hant: 現在我們得到的是一個光滑的塑膠表面。接著，我們要思考想要模擬哪些水的特殊屬性。有兩個主要特性能讓這個表面從奇怪的塑膠感變成漂亮的水面：第一是鏡面反射（Specular Reflection），也就是你看到太陽直射時水面出現的亮點；第二是菲涅耳反射（Fresnel Reflectance），也就是物體在較淺的觀察角度時反射性會變強。這就是為什麼你可以看清楚腳下的水，但遠一點就只能看到天空反射。

source: In order to increase the specular reflections, we will do two things. First, we will change the render mode for specular to toon because the toon render mode has larger specular highlights.
ga: D'fhonn cur leis an machnamh specular, déanfaimid dhá rud. Gcéad dul síos, beidh muid ag athrú ar an modh rindreála le haghaidh specular toon toisc go bhfuil an modh rindreála toon buaicphointí specular níos mó.
it: Per aumentare i riflessi speculari, faremo due cose. Innanzitutto, cambieremo la modalità di rendering da speculare a toon, perché la modalità di rendering toon ha riflessi speculari più larghi.
ru: Для того чтобы увеличить зеркальные отражения, мы сделаем две вещи. Во-первых, мы изменим режим рендеринга для specular на toon, потому что режим рендеринга toon имеет больше спекулярных бликов.
ta: ஏகப்பட்ட பிரதிபலிப்புகளை அதிகரிக்க, நாங்கள் இரண்டு விசயங்களைச் செய்வோம். முதலாவதாக, டூனுக்கு ஏகப்பட்ட வழங்குதல் பயன்முறையை மாற்றுவோம், ஏனெனில் டூன் வழங்குதல் பயன்முறையில் பெரிய ஏகப்பட்ட சிறப்பம்சங்கள் உள்ளன.
uk: Щоб збільшити дзеркальні відбиття, ми зробимо дві речі. По-перше, ми змінимо режим візуалізації для specular на toon, оскільки режим рендерингу toon має більші відблиски.
zh_hant: 為了加強鏡面反射，我們會做兩件事。首先，把鏡面反射的算繪模式設為 toon，因為 toon 模式會有更明顯的高光區。

source: Second we will add rim lighting. Rim lighting increases the effect of light at glancing angles. Usually it is used to emulate the way light passes through fabric on the edges of an object, but we will use it here to help achieve a nice watery effect.
ga: Sa dara háit cuirfimid soilsiú imeall leis. Méadaíonn soilsiú imeall éifeacht an tsolais ag uillinneacha glancing. De ghnáth úsáidtear é chun aithris a dhéanamh ar an mbealach a théann solas trí fhabraic ar imill ruda, ach úsáidfimid é anseo chun cabhrú le héifeacht deas uisceach a bhaint amach.
it: Secondo, aggiungeremo l'illuminazione del bordo. L'illuminazione del bordo aumenta l'effetto della luce negli angoli di osservazione. Di solito è utilizzata per emulare il modo in cui la luce attraversa il tessuto sui bordi di un oggetto, ma qui la useremo per ottenere un piacevole effetto acquatico.
ru: Во-вторых, мы добавим ободковое освещение. Окантовочное освещение усиливает эффект света под скользящими углами. Обычно оно используется для имитации прохождения света через ткань на краях объекта, но мы будем использовать его здесь, чтобы добиться красивого эффекта воды.
ta: இரண்டாவதாக நாங்கள் விளிம்பு விளக்குகளைச் சேர்ப்போம். விளிம்பு விளக்குகள் பார்வைக் கோணங்களில் ஒளியின் விளைவை அதிகரிக்கிறது. வழக்கமாக இது ஒரு பொருளின் விளிம்புகளில் துணி வழியாக ஒளி கடந்து செல்லும் முறையைப் பின்பற்ற பயன்படுகிறது, ஆனால் ஒரு நல்ல நீர் விளைவை அடைய உதவும் வகையில் இதைப் பயன்படுத்துவோம்.
uk: По-друге, ми додамо освітлення обода. Підсвічування обода посилює ефект світла під кутами огляду. Зазвичай він використовується для імітації того, як світло проходить через тканину на краях об’єкта, але ми використаємо його тут, щоб допомогти досягти приємного водянистого ефекту.
zh_hant: 再來，我們會加上邊緣光（rim lighting）。邊緣光會讓物件邊緣在掠射角度下更明亮。一般常用來模擬布料邊緣的透光，但在這裡能幫助我們做出漂亮的水面質感。

source: In order to add fresnel reflectance, we will compute a fresnel term in our fragment shader. Here, we aren't going to use a real fresnel term for performance reasons. Instead, we'll approximate it using the dot product of the ``NORMAL`` and ``VIEW`` vectors. The ``NORMAL`` vector points away from the mesh's surface, while the ``VIEW`` vector is the direction between your eye and that point on the surface. The dot product between them is a handy way to tell when you are looking at the surface head-on or at a glancing angle.
ga: D'fhonn frithchaitheamh fresnel a chur leis, ríomhfaimid téarma fresnel inár shader ilroinnte. Anseo, níl muid chun téarma fíor fresnel a úsáid ar chúiseanna feidhmíochta. Ina áit sin, déanfaimid é a neasú ag baint úsáide as táirge ponc na veicteoirí ''NORMAL'' agus ''VIEW''. Díríonn an veicteoir ''NORMAL'' ar dhromchla an mhogaill, agus is é an veicteoir ''VIEW'' an treo idir do shúil agus an pointe sin ar an dromchla. Is bealach áisiúil é an táirge ponc eatarthu a insint nuair a bhíonn tú ag féachaint ar an dromchla ceann-ar nó ar uillinn glancing.
it: Per aggiungere la riflettanza di Fresnel, calcoleremo un termine di Fresnel nel nostro shader di frammenti. Qui, non useremo un termine di Fresnel reale per motivi di prestazioni. Invece, lo approssimeremo tramite il prodotto scalare dei vettori ``NORMAL`` e ``VIEW``. Il vettore ``NORMAL`` punta lontano dalla superficie della mesh, mentre il vettore ``VIEW`` è la direzione tra l'occhio e quel punto sulla superficie. Il prodotto scalare tra i due è un modo pratico per capire se si sta guardando la superficie frontalmente o di traverso.
ta: ஃப்ரெச்னல் பிரதிபலிப்பைச் சேர்க்க, எங்கள் துண்டு சேடரில் ஒரு ஃப்ரெச்னல் காலத்தை கணக்கிடுவோம். இங்கே, செயல்திறன் காரணங்களுக்காக உண்மையான ஃப்ரெச்னல் காலத்தைப் பயன்படுத்தப் போவதில்லை. அதற்கு பதிலாக, `` இயல்பான`` மற்றும் `` பார்வை` `திசையன்களின் புள்ளி தயாரிப்பைப் பயன்படுத்தி தோராயமாக மதிப்பிடுவோம். `` இயல்பான`` திசையன் கண்ணி மேற்பரப்பில் இருந்து சுட்டிக்காட்டுகிறது, அதே நேரத்தில் `` பார்வை` `திசையன் உங்கள் கண்ணுக்கு இடையிலான திசையும் மேற்பரப்பில் அந்த புள்ளியும் ஆகும். அவற்றுக்கிடையேயான புள்ளி தயாரிப்பு நீங்கள் மேற்பரப்பு தலையின் தலையை அல்லது பார்வையிடும் கோணத்தில் பார்க்கும்போது சொல்ல ஒரு எளிதான வழியாகும்.
uk: Щоб додати коефіцієнт відбиття френеля, ми обчислимо член френеля в нашому фрагментному шейдері. Тут ми не будемо використовувати справжній термін Френеля з міркувань продуктивності. Натомість ми апроксимуємо його за допомогою скалярного добутку векторів ``NORMAL`` і ``VIEW``. Вектор ``NORMAL`` вказує від поверхні сітки, тоді як вектор ``VIEW`` є напрямком між вашим оком і цією точкою на поверхні. Скалярний добуток між ними — це зручний спосіб визначити, що ви дивитеся на поверхню прямо чи під кутом.
zh_hant: 為了加入菲涅耳反射，我們會在片段著色器裡計算一個簡化版的菲涅耳項。這裡為了效能不採用完整公式，而是用 ``NORMAL`` 和 ``VIEW`` 向量的點積來近似。``NORMAL`` 向量是指向網格表面外側，而 ``VIEW`` 向量則是從該點指向觀察者的方向。這兩個向量的點積可以幫我們判斷是正面看還是斜著看表面。

source: And mix it into both ``ROUGHNESS`` and ``ALBEDO``. This is the benefit of ShaderMaterials over StandardMaterial3Ds. With StandardMaterial3D, we could set these properties with a texture, or to a flat number. But with shaders we can set them based on any mathematical function that we can dream up.
ga: Agus é a mheascadh isteach i ''ROUGHNESS'' agus ''ALBEDO''. Is é seo an tairbhe a bhaineann le ShaderMaterials thar StandardMaterial3Ds. Le StandardMaterial3D, d'fhéadfaimis na hairíonna seo a shocrú le huigeacht, nó le huimhir chothrom. Ach le shaders is féidir linn iad a shocrú bunaithe ar aon fheidhm mhatamaiticiúil gur féidir linn aisling suas.
it: E fondilo sia in ``ROUGHNESS`` sia in ``ALBEDO``. Questo è il vantaggio degli ShaderMaterial rispetto agli StandardMaterial3D. Con StandardMaterial3D, potevamo impostare queste proprietà con una texture o con un numero fisso. Ma con gli shader possiamo impostarle in base a qualsiasi funzione matematica ci venga in mente.
ta: அதை `` கடினத்தன்மை`` மற்றும் `` ஆல்பிடோ`` இரண்டிலும் கலக்கவும். ச்டாண்டர்டெர்மேட்டரியல் 3 டிஎச் மீது நிழல் நிலைகளின் நன்மை இதுவாகும். StandardMaterial3D உடன், இந்த பண்புகளை ஒரு அமைப்புடன் அல்லது ஒரு தட்டையான எண்ணுடன் அமைக்கலாம். ஆனால் சேடர்கள் மூலம் நாம் கனவு காணக்கூடிய எந்த கணித செயல்பாட்டின் அடிப்படையில் அவற்றை அமைக்கலாம்.
uk: І змішайте це в `` ШОРСТКІСТЬ `` і `` АЛЬБЕДО``. Це перевага ShaderMaterials над StandardMaterial3Ds. За допомогою StandardMaterial3D ми могли встановити ці властивості за допомогою текстури або рівного числа. Але за допомогою шейдерів ми можемо встановити їх на основі будь-якої математичної функції, про яку тільки можемо мріяти.
zh_hant: 然後把它混合進 ``ROUGHNESS`` 和 ``ALBEDO``。這也是 ShaderMaterial 相較於 StandardMaterial3D 的優勢。StandardMaterial3D 只能用紋理或單一數值來設定這些屬性，但有了著色器就能用任何你想得到的數學公式來設定。

source: And now, with only 5 lines of code, you can have complex looking water. Now that we have lighting, this water is looking too bright. Let's darken it. This is done easily by decreasing the values of the ``vec3`` we pass into ``ALBEDO``. Let's set them to ``vec3(0.01, 0.03, 0.05)``.
ga: Agus anois, gan ach 5 líne de chód, is féidir leat uisce casta ag lorg a bheith agat. Anois go bhfuil soilsiú againn, tá an t-uisce seo ag breathnú ró-gheal. Dorchaímis é. Déantar é seo go héasca trí luachanna an ''vec3'' a théann muid isteach i ''ALBEDO'' a laghdú. Cuirimis ''vec3(0.01, 0.03, 0.05)' orthu.
it: E ora, con solamente 5 righe di codice, puoi ottenere un'acqua dall'aspetto complesso. Ora che abbiamo l'illuminazione, quest'acqua sembra troppo chiara. Oscuriamola. Questo si fa facilmente diminuendo i valori di ``vec3`` che passiamo in ``ALBEDO``. Impostiamoli a ``vec3(0.01, 0.03, 0.05)``.
ta: இப்போது, 5 கோடுகள் குறியீட்டைக் கொண்டு, நீங்கள் சிக்கலான தோற்றத்தைக் கொண்டிருக்கலாம். இப்போது நமக்கு விளக்குகள் இருப்பதால், இந்த நீர் மிகவும் பிரகாசமாக இருக்கிறது. அதை இருட்டடிப்போம். `` Vec3`` இன் மதிப்புகளைக் குறைப்பதன் மூலம் இது எளிதாக செய்யப்படுகிறது `` ஆல்பிடோ``. அவற்றை `` vec3 (0.01, 0.03, 0.05) `` என அமைப்போம்.
uk: І тепер, маючи лише 5 рядків коду, ви можете мати складну воду. Тепер, коли у нас є освітлення, ця вода виглядає занадто яскравою. Давайте затемнити його. Це легко зробити, зменшивши значення ``vec3``, які ми передаємо в ``ALBEDO``. Давайте встановимо для них значення ``vec3(0.01, 0.03, 0.05)``.
zh_hant: 現在只需要五行程式碼，你就能做出複雜的水面。既然有了打光，這個水面看起來太亮了。我們把它調暗一點，只要把傳給 ``ALBEDO`` 的 ``vec3`` 數值調小就行。設成 ``vec3(0.01, 0.03, 0.05)`` 吧。

source: Animating with ``TIME``
ga: Beochan le ''TIME''
it: Animare con ``TIME``
ta: `` நேரம்`` உடன் அனிமேசன்
uk: Анімація за допомогою ``TIME``
zh_hant: 使用 ``TIME`` 製作動畫

source: Going back to the vertex function, we can animate the waves using the built-in variable ``TIME``.
ga: Ag dul ar ais go dtí an fheidhm vertex, is féidir linn na tonnta a bheochan ag baint úsáide as an athróg ionsuite ''TIME''.
it: Tornando alla funzione vertex, possiamo animare le onde utilizzando la variabile integrata ``TIME``.
ta: வெர்டெக்ச் செயல்பாட்டிற்குச் செல்லும்போது, உள்ளமைக்கப்பட்ட மாறி `` நேரம்`` ஐப் பயன்படுத்தி அலைகளை உயிரூட்டலாம்.
uk: Повертаючись до вершинної функції, ми можемо анімувати хвилі за допомогою вбудованої змінної ``TIME``.
zh_hant: 回到頂點函式，我們可以用內建變數 ``TIME`` 來讓波浪動起來。

source: ``TIME`` is a built-in variable that is accessible from the vertex and fragment functions.
ga: Is athróg ionsuite é ''TIME'' atá inrochtana ó na feidhmeanna stuaic agus blúire.
it: ``TIME`` è una variabile integrata che è accessibile dalle funzioni vertex e fragment.
ta: `` நேரம்`` என்பது ஒரு உள்ளமைக்கப்பட்ட மாறி, இது வெர்டெக்ச் மற்றும் துண்டு செயல்பாடுகளிலிருந்து அணுகக்கூடியது.
uk: ``TIME`` — це вбудована змінна, яка доступна з функцій вершин і фрагментів.
zh_hant: ``TIME`` 是內建變數，頂點和片段函式都能用。

source: In the last tutorial we calculated height by reading from a heightmap. For this tutorial, we will do the same. Put the heightmap code in a function called ``height()``.
ga: Sa rang teagaisc deireanach ríomhamar airde trí léamh ó mhapa airde. Don rang teagaisc seo, déanfaimid an rud céanna. Cuir an cód mapa airde i bhfeidhm ar a dtugtar ''airde()''.
it: Nell'ultimo tutorial abbiamo calcolato l'altezza leggendola da una heightmap. In questo tutorial faremo lo stesso. Inserisci il codice della heightmap in una funzione chiamata ``height()``.
ta: கடைசி டுடோரியலில் உயர வரைபடத்திலிருந்து வாசிப்பதன் மூலம் உயரத்தை கணக்கிட்டோம். இந்த டுடோரியலுக்காக, நாங்கள் அவ்வாறே செய்வோம். `` உயரம் () `` எனப்படும் செயல்பாட்டில் உயர வரைபடக் குறியீட்டை வைக்கவும்.
uk: У минулому посібнику ми обчислювали висоту, читаючи з карти висот. Для цього підручника ми зробимо те саме. Помістіть код карти висот у функцію під назвою ``height()``.
zh_hant: 上一個教學我們是用高度圖來計算高度。這次我們也一樣，只是把高度圖的程式碼寫在一個叫 ``height()`` 的函式裡。

source: In order to use ``TIME`` in the ``height()`` function, we need to pass it in.
ga: Chun ''TIME'' a úsáid san fheidhm ''airde()'', ní mór dúinn é a chur isteach.
it: Per poter utilizzare ``TIME`` nella funzione ``height()``, dobbiamo passarlo.
ta: `` உயரம் () `` செயல்பாட்டில் `` நேரம்`` ஐப் பயன்படுத்த, நாம் அதை அனுப்ப வேண்டும்.
uk: Щоб використовувати ``TIME`` у функції ``height()``, нам потрібно передати його.
zh_hant: 如果要在 ``height()`` 函式裡用 ``TIME``，就必須把它傳進去。

source: And make sure to correctly pass it in inside the vertex function.
ga: Agus déan cinnte é a chur ar aghaidh i gceart taobh istigh den fheidhm vertex.
it: E assicurati di passarlo correttamente dentro la funzione vertex.
ta: மேலும் அதை வெர்டெக்ச் செயல்பாட்டின் உள்ளே சரியாக அனுப்புவதை உறுதிசெய்க.
uk: І переконайтеся, що ви правильно передали його всередину вершинної функції.
zh_hant: 記得在頂點函式裡正確傳遞這個參數。

source: Instead of using a normalmap to calculate normals. We are going to compute them manually in the ``vertex()`` function. To do so use the following line of code.
ga: In ionad gnáthmhapa a úsáid chun gnáthaimh a ríomh. Táimid chun iad a ríomh de láimh san fheidhm ''vertex()''. Chun é sin a dhéanamh bain úsáid as an líne cód seo a leanas.
it: Invece di usare una mappa normale per calcolare le normali, le calcoleremo manualmente nella funzione ``vertex()``. Per farlo, utilizza la seguente riga di codice.
ta: இயல்புகளைக் கணக்கிட ஒரு சாதாரண வரைபடத்தைப் பயன்படுத்துவதற்குப் பதிலாக. `` வெர்டெக்ச் () `` செயல்பாட்டில் அவற்றை கைமுறையாக கணக்கிடப் போகிறோம். அவ்வாறு செய்ய பின்வரும் குறியீட்டைப் பயன்படுத்தவும்.
uk: Замість використання карти нормалей для обчислення нормалей. Ми збираємося обчислити їх вручну у функції ``vertex()``. Для цього використовуйте наступний рядок коду.
zh_hant: 這次我們不是用法線貼圖來計算法線，而是在 ``vertex()`` 函式裡手動計算。請用下列程式碼。

source: We need to compute ``NORMAL`` manually because in the next section we will be using math to create complex-looking waves.
ga: Ní mór dúinn ''NORMAL'' a ríomh de láimh mar sa chéad chuid eile beimid ag baint úsáide as mata chun tonnta casta a chruthú.
it: Dobbiamo calcolare ``NORMAL`` manualmente perché nella prossima sezione useremo la matematica per creare onde dall'aspetto complesso.
ta: நாம் `` இயல்பான`` கைமுறையாக கணக்கிட வேண்டும், ஏனென்றால் அடுத்த பகுதியில் சிக்கலான தோற்றமுடைய அலைகளை உருவாக்க கணிதத்தைப் பயன்படுத்துவோம்.
uk: Нам потрібно обчислити ``NORMAL`` вручну, оскільки в наступному розділі ми будемо використовувати математику для створення складних на вигляд хвиль.
zh_hant: 我們要手動計算 ``NORMAL``，因為下一節會用數學方式做出更複雜的波浪。

source: Now, we are going to make the ``height()`` function a little more complicated by offsetting ``position`` by the cosine of ``TIME``.
ga: Anois, táimid chun an fheidhm ''airde()'' a dhéanamh beagáinín níos casta trí ''position'' a fhritháireamh ag cosine ''TIME''.
it: Adesso renderemo la funzione ``height()`` un po' più complicata, compensando ``position`` con il coseno di ``TIME``.
ta: இப்போது, `` நேரம்`` இன் கோசினால் `` நிலை`` ஐ ஈடுசெய்வதன் மூலம் `` உயரம் () `` இன்னும் கொஞ்சம் சிக்கலானதாக மாற்றப் போகிறோம்.
uk: Тепер ми збираємося зробити функцію ``height()`` трохи складнішою, зміщуючи ``position`` на косинус ``TIME``.
zh_hant: 現在，我們要讓 ``height()`` 函式更複雜一點，將 ``position`` 用 ``TIME`` 的餘弦做偏移。

source: This results in waves that move slowly, but not in a very natural way. The next section will dig deeper into using shaders to create more complex effects, in this case realistic waves, by adding a few more mathematical functions.
ga: Mar thoradh air seo tá tonnta a ghluaiseann go mall, ach ní ar bhealach an-nádúrtha. Beidh an chéad chuid eile tochailt níos doimhne i shaders a úsáid chun éifeachtaí níos casta a chruthú, sa chás seo tonnta réalaíocha, trí roinnt feidhmeanna matamaiticiúla níos mó a chur leis.
it: Questo risulta in onde che si muovono lentamente, ma non in modo molto naturale. La prossima sezione approfondirà l'uso degli shader per creare effetti più complessi, in questo caso onde realistiche, aggiungendo qualche funzione matematica in più.
ta: இது மெதுவாக நகரும் அலைகளை விளைவிக்கிறது, ஆனால் மிகவும் இயல்பான வழியில் அல்ல. இன்னும் சில கணித செயல்பாடுகளைச் சேர்ப்பதன் மூலம், இந்த விசயத்தில் யதார்த்தமான அலைகள் மிகவும் சிக்கலான விளைவுகளை உருவாக்க சேடர்களைப் பயன்படுத்துவதில் அடுத்த பகுதி ஆழமாகத் தோண்டும்.
uk: Це призводить до хвиль, які рухаються повільно, але не дуже природним чином. У наступному розділі глибше буде розглянуто використання шейдерів для створення складніших ефектів, у цьому випадку реалістичних хвиль, додавши ще кілька математичних функцій.
zh_hant: 這樣做出來的波浪會慢慢移動，但還不太自然。下一節會再深入一點，用更多數學函式讓波浪更真實。

source: Advanced effects: waves
ga: Éifeachtaí casta: tonnta
it: Effetti avanzati: onde
ta: மேம்பட்ட விளைவுகள்: அலைகள்
uk: Розширені ефекти: хвилі
zh_hant: 進階效果：波浪

source: What makes shaders so powerful is that you can achieve complex effects by using math. To illustrate this, we are going to take our waves to the next level by modifying the ``height()`` function and by introducing a new function called ``wave()``.
ga: Is é an rud a dhéanann shaders chomh cumhachtach ná gur féidir leat éifeachtaí casta a bhaint amach trí mhata a úsáid. Chun é seo a léiriú, táimid chun ár dtonnta a thabhairt go dtí an chéad leibhéal eile tríd an bhfeidhm ''airde()'' a mhodhnú agus trí fheidhm nua a thabhairt isteach ar a dtugtar ''tonn()''.
it: Ciò che rende gli shader così potenti è la possibilità di ottenere effetti complessi grazie alla matematica. Per illustrarlo, passeremo le nostre onde al prossimo livello modificando la funzione ``height()`` e introducendo una nuova funzione chiamata ``wave()``.
ta: சேடர்களை மிகவும் சக்திவாய்ந்ததாக மாற்றுவது என்னவென்றால், கணிதத்தைப் பயன்படுத்துவதன் மூலம் சிக்கலான விளைவுகளை நீங்கள் அடைய முடியும். இதை விளக்குவதற்கு, `` உயரம் () `` செயல்பாட்டை மாற்றியமைப்பதன் மூலமும், `` அலை () `` என்ற புதிய செயல்பாட்டை அறிமுகப்படுத்துவதன் மூலமும் எங்கள் அலைகளை அடுத்த நிலைக்கு கொண்டு செல்லப் போகிறோம்.
uk: Що робить шейдери такими потужними, так це те, що ви можете досягти складних ефектів за допомогою математики. Щоб проілюструвати це, ми збираємося підняти наші хвилі на наступний рівень, змінивши функцію ``height()`` і ввівши нову функцію під назвою ``wave()``.
zh_hant: 著色器的強大就在於你可以用數學實現各種複雜效果。為了說明這點，接下來我們會修改 ``height()`` 並加入一個新的 ``wave()`` 函式，讓波浪效果更上一層樓。
