Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/how_to_contribute.po
Languages: de, ga, ta, tr, uk, zh_cn, zh_tw

source: How to contribute
de: So können Sie beitragen
ga: Conas rannchuidiú
ta: பங்களிப்பது எப்படி
tr: Nasıl katkıda bulunabilirsiniz
uk: Як зробити внесок
zh_cn: 贡献方式
zh_tw: 如何貢獻

source: The Godot Engine is free and open-source. Like any community-driven project, we rely on volunteer contributions. On this page we want to showcase the various ways you as users can participate - to help you find the right starting place with the skillset you have. Because contrary to popular opinion, we need more than just programmers on the project!
de: Die Godot Engine ist kostenlos und Open Source. Wie jedes Community-Projekt sind wir auf freiwillige Beiträge angewiesen. Auf dieser Seite möchten wir die verschiedenen Möglichkeiten aufzeigen, wie Sie als Benutzer teilnehmen können – um Ihnen zu helfen, mit Ihren Fähigkeiten den richtigen Ausgangspunkt zu finden. Denn entgegen der landläufigen Meinung brauchen wir für das Projekt mehr als nur Programmierer!
ga: Tá an Godot Engine saor in aisce agus foinse oscailte. Cosúil le haon tionscadal atá faoi thiomáint ag pobail, bímid ag brath ar ranníocaíochtaí Ar an leathanach seo ba mhaith linn na bealaí éagsúla is féidir leat mar úsáideoirí páirt a ghlacadh a thaispeáint - chun cabhrú leat an áit tosaigh ceart a fháil leis an tacar scileanna atá agat. Mar thoradh ar an tuairim choitianta, teastaíonn níos mó ná ríomhchláraitheoirí uainn ar an tionscadal!
ta: கோடோட் எஞ்சின் இலவசமாகவும் திறந்த மூலமாகவும் உள்ளது. சமூகத்தால் இயக்கப்படும் எந்தவொரு திட்டத்தையும் போலவே, நாங்கள் தன்னார்வ பங்களிப்புகளை நம்புகிறோம். இந்த பக்கத்தில் பயனர்களாக நீங்கள் பங்கேற்கக்கூடிய பல்வேறு வழிகளைக் காண்பிக்க விரும்புகிறோம் - உங்களிடம் உள்ள திறனுடன் சரியான தொடக்க இடத்தைக் கண்டறிய உங்களுக்கு உதவ. பிரபலமான கருத்துக்கு மாறாக, திட்டத்தின் புரோகிராமர்களை விட எங்களுக்கு அதிகம் தேவை!
tr: Godot Motoru ücretsiz, özgür ve açık kaynaklıdır. Her topluluk-temelli proje gibi biz de gönüllülerin katkılara güveniyoruz. Bu sayfada, sahip olduğunuz beceri setiyle doğru başlangıç yerini bulmanıza yardımcı olmak için, kullanıcılar olarak katkıda bulunabileceğiniz çeşitli yolları sergilemek istiyoruz. Çünkü yaygın görüşün aksine, projede programcılardan daha fazlasına ihtiyacımız var!
uk: Godot Engine є безкоштовним і має відкритий код. Як і будь-який громадський проект, ми покладаємося на внески волонтерів. На цій сторінці ми хочемо продемонструвати різні способи, якими ви, як користувачі, можете брати участь, щоб допомогти вам знайти правильне місце для початку з набором навичок, який у вас є. Тому що, всупереч поширеній думці, на проекті потрібні не просто програмісти!
zh_cn: Godot 是一款免费开源的引擎。和所有社区推动的项目一样，我们依靠志愿者贡献运作。在这个页面上我们想展示几种你们作为用户可以参与进来的方式，并帮助你们根据自己的技能来找到正确的出发点。和大部分人想的不一样，这个项目需要的不仅仅是程序员！
zh_tw: Godot 引擎是免費且開放原始碼的。如同任何社群驅動的專案，我們仰賴志願者的貢獻。在這個頁面，我們想展示各位使用者可以參與的各種方式，協助您根據自身技能找到合適的起點。因為與普遍認知相反，這個專案需要的並不只有程式設計師！

source: Fundraising
de: Spendensammlung
ga: Tiomsú Airgid
ta: பொருள் திரட்டல்
tr: Bağış Toplama
uk: Збір коштів
zh_cn: 筹款
zh_tw: 募款

source: **Donate**
de: **Spenden**
ga: **Deontaire**
ta: ** நன்கொடை **
tr: **Bağış yapın**
uk: **Пожертвувати**
zh_cn: **捐赠**
zh_tw: **贊助**

source: We created the non-profit `Godot Foundation <https://godot.foundation/>`_ to be able to support the Godot Engine in both matters of finance and administration. In practice, this means the Foundation hires people to work part-time or full-time on the project. These jobs include engine development as well as related tasks like code reviews, production management, community & marketing efforts, and more.
de: Wir haben die gemeinnützige `godot foundation <https://godot.foundation/>`_ gegründet, um die Godot Engine sowohl in finanziellen als auch in administrativen Belangen unterstützen zu können. In der Praxis bedeutet dies, dass die Foundation Leute einstellt, die in Teilzeit oder Vollzeit an dem Projekt arbeiten. Diese Jobs umfassen die Engine-Entwicklung sowie damit verbundene Aufgaben wie Code-Reviews, Produktionsmanagement, Community- und Marketing-Aktivitäten und mehr.
ga: Chruthaíomar an Fhondúireacht neamhbhrabúis `Godot <https://godot.foundation/>`_ chun a bheith in ann tacú leis an Inneall Godot i gcúrsaí airgeadais agus riaracháin araon. Go praiticiúil, ciallaíonn sé seo go bhfostaíonn an Foras daoine chun oibriú go páirtaimseartha nó go lánaimseartha ar an tionscadal. Áirítear leis na poist seo forbairt inneall chomh maith le tascanna gaolmhara cosúil le hathbhreithnithe cód, bainistíocht táirgeachta, iarrachtaí pobail & margaíochta, agus go leor eile.
ta: பொருள் மற்றும் நிர்வாகத்தின் இரண்டிலும் கோடோட் இயந்திரத்தை ஆதரிக்க முடியும் என்பதற்காக, இலாப நோக்கற்ற `கோடோட் அறக்கட்டளை <https://godot.foundation/>` _ ஆகியவற்றை நாங்கள் உருவாக்கியுள்ளோம். நடைமுறையில், இதன் பொருள், திட்டத்தில் பகுதிநேர அல்லது முழுநேர வேலை செய்ய அடித்தளம் மக்களை நியமிக்கிறது. இந்த வேலைகளில் இயந்திர மேம்பாடு மற்றும் குறியீடு மதிப்புரைகள், விளைவாக்கம் மேலாண்மை, சமூகம் மற்றும் சந்தைப்படுத்தல் முயற்சிகள் மற்றும் பல போன்ற பணிகள் அடங்கும்.
tr: Godot Motoru'nu (Godot Engine) hem mali hem de idari konularda destekleyebilmek için kar amacı gütmeyen `Godot Vakfı <https://godot.foundation/>`_ 'nı kurduk. Pratikte bu, Vakfın projede yarı zamanlı veya tam zamanlı çalışacak kişileri işe alması anlamına geliyor. Bu işler arasında motor geliştirmenin yanı sıra kod incelemeleri, üretim yönetimi, topluluk ve pazarlama çabaları ve daha fazlası gibi ilgili görevler yer alıyor.
uk: Ми створили некомерційну `Фонд Годо <https://godot.foundation/>`_, щоб підтримувати Godot Engine як у фінансових, так і в адміністративних питаннях. На практиці це означає, що Фонд наймає людей для роботи над проектом неповний або повний робочий день. Ці роботи включають розробку двигуна, а також пов’язані завдання, такі як перевірка коду, управління виробництвом, спільнота та маркетингові зусилля тощо.
zh_cn: 我们创建了非盈利性组织 `Godot 基金会 <https://godot.foundation/>`_\ 来向 Godot 引擎提供经济和行政上的支持。实践上来看，这意味着基金会会雇佣人员兼职或全职从事该项目。具体工作内容包括引擎开发和一系列相关工作，包括代码评审、生产管理、社区和市场营销事务等。
zh_tw: 我們創立了非營利的 `Godot 基金會 <https://godot.foundation/>`_ ，以便在財務和行政事務上都能夠支持 Godot 引擎。實際上，這表示基金會聘請人員以兼職或全職的方式參與專案。這些職位包括引擎開發，以及程式碼審查、專案管理、社群與行銷推廣等相關任務。

source: With as little as 5 EUR per month, you can help us keep going strong. Currently, we are intending to hire more core developers, as to cover more ground with full-time specialists that supplement and guide volunteer work.
zh_tw: 每月只要 5 歐元起，您就能幫助我們持續穩健發展。目前，我們計劃聘請更多核心開發者，以全職專家的投入來擴大開發範圍，他們將能補充並引導志工的工作。

source: `Join the Development Fund <https://fund.godotengine.org>`_
zh_tw: `加入開發基金 <https://fund.godotengine.org>`_

source: **Donation Drives** Think about your followers on social media, or other communities you are active in. Use that reach to remind your social environment that even small contributions can make a difference, especially when done by a great number of people at the same time.
de: **Spendenaktionen** Denken Sie an Ihre Follower in den sozialen Medien oder anderen Communities, in denen Sie aktiv sind. Nutzen Sie diese Reichweite, um Ihr soziales Umfeld daran zu erinnern, dass auch kleine Beiträge einen Unterschied machen können, insbesondere wenn sie von vielen Menschen gleichzeitig geleistet werden.
ga: **Tiomáinte Síntiúis** Smaoinigh ar do lucht leanúna ar na meáin shóisialta, nó ar phobail eile a bhfuil tú gníomhach iontu. Úsáid an sroichead sin chun do thimpeallacht shóisialta a mheabhrú gur féidir le fiú ranníocaíochtaí beaga difríocht a dhéanamh, go háirithe nuair a dhéanann líon mór daoine é ag an am céanna.
ta: ** நன்கொடை இயக்கிகள் ** சமூக ஊடகங்களில் உங்களைப் பின்தொடர்பவர்களைப் பற்றி அல்லது நீங்கள் செயலில் உள்ள பிற சமூகங்களைப் பற்றி சிந்தியுங்கள். சிறிய பங்களிப்புகள் கூட ஒரு வித்தியாசத்தை ஏற்படுத்தும் என்பதை உங்கள் சமூக சூழலை நினைவூட்டுவதற்கு அந்த வரம்பைப் பயன்படுத்தவும், குறிப்பாக ஏராளமான மக்களால் செய்யப்படும்போது அதே நேரம்.
tr: **Bağış Kampanyaları** Sosyal medyadaki takipçilerinizi ya da aktif olduğunuz diğer toplulukları düşünün. Bu erişimi, sosyal çevrenize küçük katkıların bile, özellikle de çok sayıda insan tarafından aynı anda yapıldığında fark yaratabileceğini hatırlatmak için kullanın.
uk: **Пожертвування** Подумайте про своїх підписників у соціальних мережах або інших спільнотах, у яких ви активні. Використовуйте це охоплення, щоб нагадати своєму соціальному середовищу, що навіть невеликі внески можуть мати значення, особливо якщо це робить велика кількість людей у той самий час.
zh_cn: **捐赠活动** 想想你在社交媒体或者其他活跃社区上的粉丝。你可以在社交环境中使用这种影响力，再小的贡献也是有意义的，聚沙成塔嘛。
zh_tw: **募款活動** 想想你在社群媒體上的追蹤者，或你活躍的其他社群。運用你的影響力提醒你的社交圈，即使是小額的捐款也能帶來改變，特別是當許多人同時行動時。

source: Are you a content creator? Consider adding a link to the `Godot Development Fund <https://fund.godotengine.org>`_ to your descriptions. If you do live streams, perhaps think about organizing a stream with donation incentives.
zh_tw: 您是內容創作者嗎？考慮在您的影片或文章說明中加入 `Godot 開發基金 <https://fund.godotengine.org>`_ 的連結。如果您有直播，或許可以考慮舉辦有捐款獎勵的直播活動。

source: **Publish Godot Games.** You heard right, simply publishing a game #MadeWithGodot can positively impact the well-being of this project. Your personal success elevates the engine to a viable alternative for other developers, growing the community further. Additionally, it opens the door for us to approach industry contacts about possible collaborations.
zh_tw: **發布 Godot 遊戲。** 你沒聽錯，光是發布一款 #MadeWithGodot 的遊戲，就能對這個專案的健全發展產生正面影響。你的個人成功會提升引擎在其他開發者眼中的地位，使其成為一個可行的替代方案，進而擴大社群。此外，這也為我們開啟了與業界聯繫人洽談潛在合作的機會。

source: Technical contributions
de: Technische Beiträge
ga: Ranníocaíochtaí teic
ta: தொழில்நுட்ப பங்களிப்புகள்
tr: Teknik katkılar
uk: Технічні внески
zh_cn: 技术贡献
zh_tw: 技術貢獻

source: **Report bugs & other issues** As active users of the engine, you are better equipped to identify bugs and other issues than anyone else. To let us know about your findings, fill out this `bug report form <https://github.com/godotengine/godot/issues/new/choose>`_ on our GitHub. Make sure to include as much information as possible to ensure these issues can easily be reproduced by others.
de: **Fehler und andere Probleme melden** Als aktive Benutzer der Engine sind Sie besser in der Lage, Fehler und andere Probleme zu identifizieren als jeder andere. Um uns Ihre Erkenntnisse mitzuteilen, füllen Sie dieses `Fehlerberichtsformular <https://github.com/godotengine/godot/issues/new/choose>`_ auf unserem GitHub aus. Geben Sie so viele Informationen wie möglich an, damit diese Probleme von anderen leicht reproduziert werden können.
ga: **Tuairiscigh fabhtanna & ceisteanna eile** Mar úsáideoirí gníomhacha an innill, tá tú in ann fabhtanna agus ceisteanna eile a aithint níos fearr ná aon duine eile. Chun do thorthaí a chur in iúl dúinn, líon isteach an `foirm tuairisce fabht <https://github.com/godotengine/godot/issues/new/choose>`_ ar ár GitHub. Bí cinnte an oiread eolais agus is féidir a chur san áireamh lena chinntiú gur féidir le daoine eile na saincheisteanna seo a atáirgeadh go héasca.
ta: ** பிழைகள் மற்றும் பிற சிக்கல்களைப் புகாரளிக்கவும் ** இயந்திரத்தின் செயலில் உள்ள பயனர்களாக, பிழைகள் மற்றும் பிற சிக்கல்களை வேறு எவரையும் விட அடையாளம் காண நீங்கள் சிறந்தவர். உங்கள் கண்டுபிடிப்புகளைப் பற்றி எங்களுக்குத் தெரியப்படுத்த, இந்த `பிழை அறிக்கை படிவத்தை <https://github.com/godotengine/godot/issues/new/choose>` _ எங்கள் கிட்அப்பில் நிரப்பவும். இந்த சிக்கல்களை மற்றவர்களால் எளிதில் இனப்பெருக்கம் செய்ய முடியும் என்பதை உறுதிப்படுத்த முடிந்தவரை தகவல்களைச் சேர்ப்பதை உறுதிசெய்க.
tr: **Hataları ve diğer sorunları bildirin** Motorun aktif kullanıcıları olarak, hataları ve diğer sorunları belirlemek için herkesten daha donanımlısınız. Bulgularınızı bize bildirmek için GitHub depomuzdaki bu `hata bildirim formu <https://github.com/godotengine/godot/issues/new/choose>`_ 'nu doldurun (mümkünse İngilizce, olmazsa olabildiğince temiz Türkçe ile). Bu sorunların başkaları tarafından kolayca yeniden üretilebilmesini sağlamak için mümkün olduğunca fazla bilgi eklediğinizden emin olun.
uk: **Повідомляйте про помилки та інші проблеми** Як активні користувачі механізму, ви краще, ніж будь-хто інший, готові виявляти помилки та інші проблеми. Щоб повідомити нам про свої знахідки, заповніть цю `форму звіту про помилку <https://github.com/godotengine/godot/issues/new/choose>`_ на нашому GitHub. Переконайтеся, що ви включили якомога більше інформації, щоб переконатися, що ці проблеми можуть бути легко відтворені іншими.
zh_tw: **回報臭蟲與其他問題** 身為引擎的活躍使用者，您比任何人都更能發現臭蟲和其他問題。若要告知我們您的發現，請在我們的 GitHub 上填寫這個 `臭蟲回報單 <https://github.com/godotengine/godot/issues/new/choose>`_ 。請務必包含盡可能多的資訊，以確保其他人能夠輕易重現這些問題。

source: If you are interested in helping keep our bug tracker organized, you can even join the `bugsquad <https://chat.godotengine.org/channel/bugsquad>`_!
de: Wenn Sie Interesse haben, uns bei der Organisation unseres Bugtrackers zu helfen, können Sie sogar dem „Bugsquad <https://chat.godotengine.org/channel/bugsquad>“_ beitreten!
ga: Má tá suim agat cabhrú lenár lorgaire fabht a choinneáil eagraithe, is féidir leat páirt a ghlacadh fiú sa `bugsquad <https://chat.godotengine.org/channel/bugsquad>`_!
ta: எங்கள் பிழை டிராக்கரை ஒழுங்கமைக்க உதவுவதில் நீங்கள் ஆர்வமாக இருந்தால், நீங்கள் `பிழைகள் <https://chat.godotengine.org/channel/bugsquad>` _!
tr: Hata izleyicimizin düzenli kalmasına yardımcı olmak istiyorsanız, `bugsquad <https://chat.godotengine.org/channel/bugsquad>`_'a bile katılabilirsiniz!
uk: Якщо ви зацікавлені в упорядкуванні нашого відстеження помилок, ви навіть можете приєднатися до `bugsquad <https://chat.godotengine.org/channel/bugsquad>`_!
zh_cn: 如果你想帮助整理问题跟踪器的话，甚至可以考虑加入 `bugsquad <https://chat.godotengine.org/channel/bugsquad>`_ ！
zh_tw: 如果您有興趣協助我們整理錯誤追蹤器，您甚至可以加入 `bugsquad <https://chat.godotengine.org/channel/bugsquad>`_ ！

source: **Test Development Versions** While it is recommended to use the stable releases for your projects, you can help us test dev releases, betas, and release candidates by opening a copy of your project in them and checking what problems this introduces or maybe even solves. Make sure to have a backup ready, since this can produce irreversible changes.
de: **Testen Sie Entwicklungsversionen** Obwohl es empfohlen wird, für Ihre Projekte die stabilen Versionen zu verwenden, können Sie uns beim Testen von Entwicklungsversionen, Betaversionen und Release-Kandidaten helfen, indem Sie eine Kopie Ihres Projekts darin öffnen und prüfen, welche Probleme dadurch entstehen oder vielleicht sogar gelöst werden. Halten Sie unbedingt ein Backup bereit, da dies zu irreversiblen Änderungen führen kann.
ga: **Leaganacha Forbartha Tástála ** Cé go bhfuil sé molta na heisiúintí cobhsaí a úsáid le haghaidh do thionscadail, is féidir leat cabhrú linn eisiúintí dev, betas, agus iarrthóirí a scaoileadh a thástáil trí chóip de do thionscadal a oscailt iontu agus seiceáil cad iad na fadhbanna a thugann sé seo isteach nó b'fhéidir réitíonn fiú. Bí cinnte go bhfuil cúltaca réidh agat, mar is féidir leis seo athruithe do-aisiompaithe a chruthú.
ta: ** சோதனை மேம்பாட்டு பதிப்புகள் ** உங்கள் திட்டங்களுக்கான நிலையான வெளியீடுகளைப் பயன்படுத்த பரிந்துரைக்கப்படுகையில், தேவ் வெளியீடுகள், பீட்டாக்கள் மற்றும் உங்கள் திட்டத்தின் நகலைத் திறந்து, இது என்ன சிக்கல்களை அறிமுகப்படுத்துகிறது என்பதைச் சோதித்துப் பார்க்க எங்களுக்கு உதவலாம் கூட தீர்க்கிறது. இது மீளமுடியாத மாற்றங்களை உருவாக்கும் என்பதால், காப்புப்பிரதி தயாராக இருப்பதை உறுதிசெய்க.
tr: **Geliştirme Sürümlerini Test Edin** Projeleriniz için kararlı sürümleri kullanmanız tavsiye edilse de, projenizin bir kopyasını açarak ve bunun hangi sorunları ortaya çıkardığını veya belki de çözdüğünü kontrol ederek geliştirme sürümlerini, betaları ve sürüm adaylarını test etmemize yardımcı olabilirsiniz. Bu geri döndürülemez değişikliklere neden olabileceğinden, hazırda bir yedeğiniz olduğundan emin olun.
uk: **Тестуйте версії для розробки** Хоча для ваших проектів рекомендується використовувати стабільні випуски, ви можете допомогти нам протестувати випуски для розробників, бета-версії та кандидати на випуски, відкривши в них копію свого проекту та перевіривши, які проблеми це створює або, можливо, навіть вирішує. Обов’язково підготуйте резервну копію, оскільки це може призвести до незворотних змін.
zh_cn: **测试开发版本** 虽然我们建议使用稳定版开发项目，但你可以帮助我们测试开发发布版，beta 版本和候选版本；在其中一个版本中打开项目副本，观察其中出现或解决的问题。该过程可能对项目产生不可逆的改变，所以请确保事先做好备份。
zh_tw: **測試開發版本** 雖然建議您的專案使用穩定版本，您仍然可以協助我們測試開發版、測試版（Beta）和候選釋出版本（Release Candidate）。方法是在這些版本中開啟您的專案副本，並檢查會出現哪些問題，或者甚至解決了哪些問題。請務必事先備份，因為這可能會產生無法復原的變更。

source: Find recent `development versions <https://godotengine.org/download/preview/>`_ directly on our download page, or linked in their own blog posts.
de: Aktuelle Entwicklungsversionen <https://godotengine.org/download/preview/>_ finden Sie direkt auf unserer Download-Seite oder über Links in den eigenen Blog-Posts.
ga: Aimsigh `leaganacha forbartha le déanaí <https://godotenginine.org/download/preview/>`_ go díreach ar ár leathanach íoslódála, nó nasctha ina gcuid postálacha blag féin.
ta: அண்மைக் கால `மேம்பாட்டு பதிப்புகள் <https://godotengine.org/download/preview/>` _ எங்கள் பதிவிறக்கப் பக்கத்தில் நேரடியாக அல்லது அவற்றின் சொந்த வலைப்பதிவு இடுகைகளில் இணைக்கப்பட்டுள்ளன.
tr: Son `geliştirme sürümlerini <https://godotengine.org/download/preview/>`_ doğrudan indirme sayfamızda veya bağlantıları onlarla ilgili blog yazılarında bulabilirsiniz.
uk: Знайдіть останні `версії для розробки <https://godotengine.org/download/preview/>`_ безпосередньо на нашій сторінці завантаження або за посиланням у власних публікаціях блогу.
zh_cn: 可以直接从下载页面中找到最近的 `开发版本 <https://godotengine.org/download/preview/>`_ ，或者在相应的博客页面中找到链接。
zh_tw: 您可以在我們的下載頁面直接找到最新的 `開發版本 <https://godotengine.org/download/preview/>`_ ，或是在相關的部落格文章中找到連結。

source: **Contribute Engine Code (mainly C++)** The engine development is mainly coordinated on our `Contributor RocketChat <https://chat.godotengine.org/>`_, so if you are serious about making PRs you should join us there!
de: **Engine-Code beisteuern (hauptsächlich C++)** Die Engine-Entwicklung wird hauptsächlich auf unserem `Contributor Rocketchat <https://chat.godotengine.org/>`_ koordiniert, wenn Sie also ernsthaft PRs erstellen möchten, sollten Sie sich uns dort anschließen!
ga: **Cód Innill Ranníocaíochta (C++ go príomha)** Déantar forbairt an innill a chomhordú go príomha ar ár `RocketChat Contributor <https://chat.godotenginine.org/>`_, mar sin má tá tú dáiríre faoi PRanna a dhéanamh ba chóir duit a bheith linn ann !
ta: ** எஞ்சின் குறியீட்டை பங்களிக்கவும் (முக்கியமாக சி ++) ** என்சின் மேம்பாடு முக்கியமாக எங்கள் `பங்களிப்பாளரான ராக்கெட்சாட் <https://chat.godotengine.org/>` _, எனவே, நீங்கள் பி.ஆர்.எச் தயாரிப்பதில் தீவிரமாக இருந்தால் நீங்கள் அங்கு சேர வேண்டும் !
tr: **Motor Koduna Katkıda Bulunun (çoğunlukla C++)** Motor geliştirme esas olarak `Katılımcı RocketChat <https://chat.godotengine.org/>`_ üzerinden koordine edilmektedir, bu nedenle PR yapma konusunda ciddiyseniz bize katılmalısınız!
uk: **Додайте код двигуна (переважно C++)** Розробка механізму в основному координується на нашому `Contributor RocketChat <https://chat.godotengine.org/>`_, тож якщо ви серйозно збираєтесь робити рекламні оголошення, вам слід приєднатися до нас там!
zh_cn: **贡献引擎代码（以 C++ 为主）** 引擎开发主要在我们的 `Contributor RocketChat <https://chat.godotengine.org/>`_ 中进行协调，如果你对自己的拉取请求是认真的话强烈建议加入！
zh_tw: **貢獻引擎程式碼 (主要為 C++)** 引擎開發主要在我們的 `貢獻者 RocketChat <https://chat.godotengine.org/>`_ 上協調，所以如果您認真想要送出 PR（Pull Requests），請務必加入我們！

source: Read more about the **technical submission process**: :ref:`doc_first_steps`
de: Lesen Sie mehr über den **technischen Einreichungsprozess**: :ref:`doc_first_steps`
ga: Léigh tuilleadh fao**próiseas aighneachta teicniúil**: :ref: `doc_first_steps`
ta: ** தொழில்நுட்ப சமர்ப்பிக்கும் செயல்முறை பற்றி மேலும் வாசிக்க ** :: குறிப்பு: `doc_first_steps`
tr: **Teknik başvuru süreci** hakkında daha fazla bilgi için: :ref:`doc_first_steps`
uk: Докладніше про **технічний процес подання**: :ref:`doc_first_steps`
zh_cn: 更多关于\ **技术提交流程**\ 的内容见：\ :ref:`doc_first_steps`
zh_tw: 深入了解**技術提交流程**: :ref:`doc_first_steps`

source: For each subject area of the engine, there is a corresponding team to coordinate the work. Join the linked chat to get more eyes on your related PR, learn about open todos, or partake in meetings. For some areas, specialists might even be encouraged to step up as maintainer! `List of teams <https://godotengine.org/teams/>`_
de: Für jeden Themenbereich der Engine gibt es ein entsprechendes Team, das die Arbeit koordiniert. Treten Sie dem verknüpften Chat bei, um mehr Aufmerksamkeit auf Ihre entsprechende PR zu lenken, sich über offene Aufgaben zu informieren oder an Meetings teilzunehmen. Für einige Bereiche werden Spezialisten möglicherweise sogar ermutigt, als Betreuer einzuspringen! `Liste der Teams <https://godotengine.org/teams/>`_
ga: I gcás gach réimse ábhair den inneall, tá foireann chomhfhreagrach ann chun an obair a chomhordú. Glac páirt sa chomhrá nasctha chun tuilleadh súl a fháil ar do chuid caidreamh poiblí, foghlaim faoi rudaí oscailte, nó páirt a ghlacadh i gcruinnithe. I réimsí áirithe, d'fhéadfaí fiú speisialtóirí a spreagadh chun céim suas mar chothaitheoir! `Liosta na bhfoirne <https://godotengine.org/teams/>`_
ta: இயந்திரத்தின் ஒவ்வொரு பாடப் பகுதிக்கும், வேலையை ஒருங்கிணைக்க ஒரு தொடர்புடைய குழு உள்ளது. உங்கள் தொடர்புடைய பி.ஆரில் அதிக கண்களைப் பெற, திறந்த டோடோசைப் பற்றி அறிய அல்லது கூட்டங்களில் பங்கேற்க இணைக்கப்பட்ட அரட்டையில் சேரவும். சில பகுதிகளுக்கு, நிபுணர்கள் பராமரிப்பாளராக முன்னேற ஊக்குவிக்கப்படலாம்! `அணிகளின் பட்டியல் <https://godotengine.org/teams/>` _
tr: Motorun her konu alanı için, çalışmayı koordine edecek ilgili bir ekip vardır. İlgili PR'nize daha fazla ilgi çekmek, açıktaki yapılacaklar (todos) hakkında bilgi edinmek veya toplantılara katılmak için bağlantılı sohbete katılın. Bazı alanlarda, uzmanlar bakımcı olarak adım atmaya bile teşvik edilebilir! `Ekiplerin listesi <https://godotengine.org/teams/>`_
uk: Для кожної тематичної області движка є відповідна команда для координації роботи. Приєднуйтеся до пов’язаного чату, щоб отримати більше інформації про пов’язану з громадськістю, дізнатися про відкриті завдання або взяти участь у зустрічах. Для деяких сфер спеціалістам може навіть бути запропоновано підвищити рівень підтримки! `Список команд <https://godotengine.org/teams/>`_
zh_cn: 引擎的每个主题领域都有相应的团队来协调工作。加入链接中的聊天室可以让更多人关注你的 PR，你也可以了解公开的待办事项或参加会议。对于部分领域，我们甚至鼓励专家担任维护者！\ `团队列表 <https://godotengine.org/teams/>`_
zh_tw: 針對引擎的每個主題領域，都有對應的團隊來協調工作。加入連結的聊天室，讓更多人關注您相關的 PR（Pull Request，程式碼合併請求）、了解未完成的任務，或參與會議。在某些領域，甚至鼓勵專家挺身而出擔任維護者！`團隊列表 <https://godotengine.org/teams/>`_
