Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/how_to_contribute.po
Languages: de, ga, ta, tr, uk, zh_cn, zh_tw

source: **Review Code Contributions** All pull requests need to be thoroughly reviewed before they can be merged into the master branch. Help us get a headstart by participating in the code review process.
de: **Codebeiträge prüfen** Alle Pull Requests müssen gründlich geprüft werden, bevor sie in den Master-Branch integriert werden können. Verhelfen Sie uns zu einem Vorsprung, indem Sie am Codeüberprüfungsprozess teilnehmen.
ga: **Ranníocaíochtaí Cód Athbhreithniúch** Ní mór gach iarratas tarraingthe a athbhreithniú go críochnúil sula féidir iad a chumasc sa mháistirbhrainse. Cuidigh linn ceanntús a fháil trí bheith páirteach sa phróiseas athbhreithnithe cód.
ta: ** மறுஆய்வு குறியீடு பங்களிப்புகளை ** அனைத்து இழுக்கும் கோரிக்கைகளும் மாச்டர் கிளையில் இணைக்கப்படுவதற்கு முன்பு முழுமையாக மதிப்பாய்வு செய்யப்பட வேண்டும். குறியீடு மறுஆய்வு செயல்பாட்டில் பங்கேற்பதன் மூலம் எட்ச்டார்ட்டைப் பெற எங்களுக்கு உதவுங்கள்.
tr: **Kod Katkılarını Gözden Geçirin** Tüm çekme isteklerinin ana dalla birleştirilmeden önce kapsamlı bir şekilde gözden geçirilmesi gerekir. Kod inceleme sürecine katılarak bir adım önde olmamıza yardımcı olun.
uk: **Переглянути внески коду** Усі запити на отримання потрібно ретельно перевірити, перш ніж їх можна буде об’єднати в основну гілку. Допоможіть нам отримати перевагу, взявши участь у процесі перевірки коду.
zh_cn: **评审代码贡献** 所有拉取请求都需要先经过全面的评审才能和合并至 master 分支。请参与代码评审流程，让我们的工作事半功倍。
zh_tw: **審查程式碼貢獻** 所有的合併請求（Pull Requests）在合併到主要分支（master branch）之前，都需要經過詳盡的審查。參與程式碼審查流程，幫助我們搶先開始。

source: To get started, chose any `open pull request <https://github.com/godotengine/godot/pulls>`_ and reference our **style guide**: :ref:`doc_pr_review_guidelines`
de: Wählen Sie zunächst einen beliebigen `offenen Pull Request <https://github.com/godotengine/godot/pulls>`_ und verweisen Sie auf unseren **Styleguide**: :ref:`doc_pr_review_guidelines`
ga: Chun tús a chur leis, roghnaigh aon `iarratas ar tharraingt oscailte <https://github.com/godotengine/godot/pulls>`_ agus déan tagairt dár **treoir stíle**: :ref:`doc_pr_review_guidelines`
ta: தொடங்க, ஏதேனும் `திறந்த இழுப்பு கோரிக்கையைத் தேர்ந்தெடுத்து <https://github.com/godotengine/godot/pulls> _ _ _ எங்கள் ** பாணி வழிகாட்டியைக் குறிப்பிடவும் ** :: ref:` doc_pr_review_guidelines`
tr: Başlamak için herhangi bir `açık çekme isteği <https://github.com/godotengine/godot/pulls>`_ seçin ve **stil kılavuzumuz** dan yardım alın: :ref:`doc_pr_review_guidelines`
uk: Щоб розпочати, виберіть будь-який `відкритий запит на отримання <https://github.com/godotengine/godot/pulls>`_ та зверніться до нашого **посібника зі стилю**: :ref:`doc_pr_review_guidelines`
zh_cn: 你可以从\ `提交拉取请求 <https://github.com/godotengine/godot/pulls>`_\ 入手，请参考我们的\ **风格指南**\ ：\ :ref:`doc_pr_review_guidelines`
zh_tw: 要開始，請選擇任一 `開啟的合併請求 <https://github.com/godotengine/godot/pulls>`_ ，並參考我們的**風格指南**: :ref:`doc_pr_review_guidelines`

source: **Write Plugins (GDScript, C#, & more)** Community addons are not directly included in the core engine download or repository, yet they provide essential quality of life upgrades for your fellow game developers. Upload your plugins to the `Godot Asset Library <https://godotengine.org/asset-library/asset>`_ to make them available to others.
zh_tw: **撰寫外掛（GDScript、C# 及更多）** 社群擴充功能不會直接包含在核心引擎的下載或儲存庫中，但它們為您的遊戲開發同伴提供了重要的使用體驗升級。將您的外掛上傳到 `Godot 素材庫 <https://godotengine.org/asset-library/asset>`_ ，讓其他人也能使用。

source: **Demo projects (GDScript, C#, and making Assets)** We provide new users with `demo projects <https://github.com/godotengine/godot-demo-projects/>`_ so they can quickly test new features or get familiar with the engine in the first place. At industry events, we might even exhibit these demo projects to showcase what Godot can do! Help improve existing projects or supply your own to be added to the pool, and join the `demo channel <https://chat.godotengine.org/channel/demo-content>`_ in the Contributor RocketChat to talk about it.
de: **Demoprojekte (GDScript, C# und Erstellen von Assets)** Wir stellen neuen Benutzern `Demoprojekte <https://github.com/godotengine/godot-demo-projects/>`_ zur Verfügung, damit sie schnell neue Funktionen testen oder sich zunächst mit der Engine vertraut machen können. Bei Branchenveranstaltungen stellen wir diese Demoprojekte möglicherweise sogar aus, um zu demonstrieren, was Godot kann! Helfen Sie dabei, bestehende Projekte zu verbessern, oder stellen Sie Ihre eigenen zur Verfügung, um sie dem Pool hinzuzufügen, und treten Sie dem `Demokanal <https://chat.godotengine.org/channel/demo-content>`_ im Contributor RocketChat bei, um darüber zu sprechen.
ga: **Tionscadail taispeána (GDScript, C#, agus Sócmhainní á ndéanamh)** Cuirimid `tionscadail taispeána <https://github.com/godotenginine/godot-demo-projects/>`_ ar fáil d'úsáideoirí nua ionas gur féidir leo gnéithe nua a thástáil go tapa nó dul i dtaithí ar an inneall ar an gcéad dul síos. Ag imeachtaí tionscail, d'fhéadfaimis fiú na tionscadail taispeána seo a thaispeáint chun a thaispeáint cad is féidir le Godot a dhéanamh! Cabhraigh le feabhas a chur ar thionscadail atá ann cheana féin nó cuir do chuid féin ar fáil le cur leis an linn, agus bí páirteach sa `chainéal taispeána <https://chat.godotengine.org/channel/demo-content>`_ sa Contributor RocketChat chun labhairt faoi.
ta: . அல்லது முதலில் இயந்திரத்தை நன்கு அறிந்து கொள்ளுங்கள். தொழில்துறை நிகழ்வுகளில், கோடோட் என்ன செய்ய முடியும் என்பதைக் காண்பிப்பதற்காக இந்த டெமோ திட்டங்களை நாங்கள் வெளிப்படுத்தலாம்! ஏற்கனவே உள்ள திட்டங்களை மேம்படுத்த உதவுங்கள் அல்லது குளத்தில் சேர்க்க உங்கள் சொந்தத்தை வழங்கவும், மேலும் `டெமோ சேனல் <https://chat.godotengine.org/channel/demo-content>` _ `அதைப் பற்றி பேச பங்களிப்பாளரின் ராக்கெட்சாட்டில் சேரவும்.
tr: **Demo projeler (GDScript, C# ve Assets oluşturma)** Yeni kullanıcıların yeni özellikleri hızlı bir şekilde test edebilmeleri veya ilk etapta motora aşina olabilmeleri için `demo projeler <https://github.com/godotengine/godot-demo-projects/>`_ sağlıyoruz. Endüstri etkinliklerinde, Godot'nun neler yapabileceğini göstermek için bu demo projeleri sergileyebiliriz bile! Mevcut projelerin geliştirilmesine yardımcı olun veya havuza eklenmek üzere kendi projelerinizi verin ve bu konuda konuşmak için Katılımcı RocketChat'teki `demo kanalı <https://chat.godotengine.org/channel/demo-content>`_ 'na katılın.
uk: **Демонстраційні проекти (GDScript, C# та створення ресурсів)** Ми надаємо новим користувачам `демо-проекти <https://github.com/godotengine/godot-demo-projects/>`_, щоб вони могли швидко протестувати нові функції або ознайомтеся з двигуном в першу чергу. На галузевих заходах ми можемо навіть демонструвати ці демонстраційні проекти, щоб продемонструвати, на що здатний Годо! Допоможіть покращити існуючі проекти або надішліть свої власні для додавання до пулу та приєднайтеся до `демо-каналу <https://chat.godotengine.org/channel/demo-content>`_ у Contributor RocketChat, щоб поговорити про це.
zh_cn: **演示项目（GDScript，C#和资产制作）** 我们为新用户提供了 `演示项目 <https://github.com/godotengine/godot-demo-projects/>`_ ，方便他们测试新功能或在新手阶段熟悉引擎。我们有时还会在行业相关活动上展出部分演示项目来示范 Godot 的能力！帮助我们改进现有的项目，或者将你自己的项目提供到集合当中，并加入 Contributor RocketChat 中的 `demo channel <https://chat.godotengine.org/channel/demo-content>`_ 进行相关讨论。
zh_tw: **示範專案（GDScript、C# 和製作素材）** 我們提供新使用者 `示範專案 <https://github.com/godotengine/godot-demo-projects/>`_ ，讓他們可以快速測試新功能，或初步熟悉引擎。在業界活動中，我們甚至可能會展示這些示範專案，以呈現 Godot 的能力！協助改進現有的專案，或提供您自己的專案加入這個資源池，並加入貢獻者 RocketChat 中的 `示範頻道 <https://chat.godotengine.org/channel/demo-content>`_ 來討論。

source: **Documentation** The documentation is one of the most essential parts of any tech project, yet the need to document new features and substantial changes often gets overlooked. Join the `documentation team <https://chat.godotengine.org/channel/documentation>`_ to improve the Godot Engine with your technical writing skills.
de: **Dokumentation** Die Dokumentation ist einer der wesentlichsten Teile jedes technischen Projekts, doch die Notwendigkeit, neue Funktionen und wesentliche Änderungen zu dokumentieren, wird oft übersehen. Treten Sie dem `Dokumentationsteam <https://chat.godotengine.org/channel/documentation>`_ bei, um die Godot-Engine mit Ihren technischen Schreibfähigkeiten zu verbessern.
ga: **Doiciméadú** Tá an doiciméadú ar cheann de na codanna is bunriachtanach d’aon tionscadal teicneolaíochta, ach is minic a thugtar neamhaird ar an ngá atá le gnéithe nua agus athruithe suntasacha a dhoiciméadú. Bí ar an bhfoireann `doiciméadúcháin <https://chat.godotengine.org/channel/documentation>`_ chun Inneall Godot a fheabhsú le do scileanna teicniúla scríbhneoireachta.
ta: ** ஆவணங்கள் ** ஆவணங்கள் எந்தவொரு தொழில்நுட்ப திட்டத்தின் மிக முக்கியமான பகுதிகளில் ஒன்றாகும், இருப்பினும் புதிய அம்சங்களையும் கணிசமான மாற்றங்களையும் ஆவணப்படுத்த வேண்டிய தேவை பெரும்பாலும் கவனிக்கப்படாது. உங்கள் தொழில்நுட்ப எழுதும் திறன்களுடன் கோடோட் இயந்திரத்தை மேம்படுத்த `ஆவணக் குழு <https://chat.godotengine.org/channel/documentation> _ _ இல் சேரவும்.
tr: **Dokümantasyon** Dokümantasyon, herhangi bir teknoloji projesinin en önemli parçalarından biridir, ancak yeni özellikleri ve önemli değişiklikleri belgeleme ihtiyacı genellikle göz ardı edilir. Godot Engine'i teknik yazma becerilerinizle geliştirmek için `dokümantasyon ekibine <https://chat.godotengine.org/channel/documentation>`_ katılın.
uk: **Документація** Документаціяї є однією з найважливіших частин будь-якого технологічного проекту, але потреба в документуванні нових функцій і суттєвих змін часто ігнорується. Приєднуйтеся до `команди документацію <https://chat.godotengine.org/channel/documentation>`_, щоб покращити Godot Engine за допомогою ваших навичок технічного письма.
zh_tw: **文件** 文件是任何技術專案最關鍵的部分之一，然而，記錄新功能和重大變更的需求經常被忽略。加入 `文件團隊 <https://chat.godotengine.org/channel/documentation>`_ ，運用您的技術寫作能力來改進 Godot 引擎。

source: **Translations (spoken languages other than English)** Are you interested in making the Godot Engine more accessible to non-English speakers? Contribute to our `community-translations <https://hosted.weblate.org/projects/godot-engine/godot/>`_.
de: **Übersetzungen (gesprochene Sprachen außer Englisch)** Sind Sie daran interessiert, die Godot-Engine für Nicht-Englischsprachige zugänglicher zu machen? Tragen Sie zu unseren `Community-Übersetzungen <https://hosted.weblate.org/projects/godot-engine/godot/>`_ bei.
ga: **Aistriúcháin (teangacha eile seachas Béarla)** An bhfuil spéis agat an Godot Engine a dhéanamh níos inrochtana do dhaoine nach bhfuil Béarla acu? Cuir lenár `phobail-aistrithe <https://hosted.weblate.org/projects/godot-engine/godot/>`_.
ta: ** மொழிபெயர்ப்புகள் (ஆங்கிலத்தைத் தவிர வேறு பேசும் மொழிகள்) ** ஆங்கிலம் அல்லாத பேச்சாளர்களுக்கு கோடோட் இயந்திரத்தை மேலும் அணுகுவதற்கு நீங்கள் ஆர்வமாக உள்ளீர்களா? எங்கள் `சமூக-மொழிபெயர்ப்புகளுக்கு பங்களிப்பு <https://hosted.weblate.org/projects/godot-engine/godot/>` _.
tr: **Çeviriler (İngilizce dışında konuşulan diller)** Godot Engine'i İngilizce konuşmayanlar için daha erişilebilir hale getirmekle ilgilenir misiniz? `Topluluk çevirilerimize <https://hosted.weblate.org/projects/godot-engine/godot/>`_ katkıda bulunun.
uk: **Переклади (розмовні мови, крім англійської)** Ви зацікавлені в тому, щоб зробити Godot Engine більш доступним для тих, хто не розмовляє англійською? Зробіть внесок у нашу `спільноту перекладів <https://hosted.weblate.org/projects/godot-engine/godot/>`_.
zh_cn: **翻译（除英语外的其他语言）** 有兴趣让不说英语的用户接触到 Godot 引擎吗？来为\ `社区翻译 <https://hosted.weblate.org/projects/godot-engine/godot/>`_\ 出一份力吧。
zh_tw: **翻譯（英語以外的口語）** 您是否有興趣讓更多非英語使用者更容易使用 Godot 引擎？歡迎貢獻我們的 `社群翻譯 <https://hosted.weblate.org/projects/godot-engine/godot/>`_ 。

source: Community support
de: Unterstützung durch die Gemeinschaft
ga: Tacaíocht phobail
ta: சமூக உதவி
tr: Topluluk desteği
uk: Підтримка громади
zh_cn: 社区支持
zh_tw: 社群支援

source: **Call for Moderators** With a community of our size, we need people to step up as volunteer moderators in all kinds of places. These teams are organized by the Godot Foundation, but would not function without the dedication of active community members like you.
de: **Aufruf an Moderatoren** Bei einer Community unserer Größe brauchen wir Leute, die sich an allen möglichen Stellen als freiwillige Moderatoren melden. Diese Teams werden von der Godot Foundation organisiert, würden aber ohne das Engagement aktiver Community-Mitglieder wie Ihnen nicht funktionieren.
ga: **Glaoigh ar Mhodhnóirí** Le pobal dár méid, ní mór dúinn daoine dul suas mar mhodhnóirí deonacha i ngach cineál áiteanna. Tá na foirne seo á eagrú ag Fondúireacht Godot, ach ní fheidhmífeadh siad gan tiomantas baill ghníomhacha pobail cosúil leatsa.
ta: ** மதிப்பீட்டாளர்களுக்கு அழைக்கவும் ** எங்கள் அளவிலான ஒரு சமூகத்துடன், எல்லா வகையான இடங்களிலும் தன்னார்வ மதிப்பீட்டாளர்களாக மக்கள் முன்னேற வேண்டும். இந்த அணிகள் கோடோட் அறக்கட்டளையால் ஒழுங்கமைக்கப்பட்டுள்ளன, ஆனால் உங்களைப் போன்ற செயலில் உள்ள சமூக உறுப்பினர்களின் அர்ப்பணிப்பு இல்லாமல் செயல்படாது.
tr: **Moderatör Çağrısı** Bizim boyutumuzdaki bir toplulukta, her türlü yerde gönüllü moderatör olarak adım atacak insanlara ihtiyacımız var. Bu ekipler Godot Vakfı tarafından organize edilmektedir, ancak sizin gibi aktif topluluk üyelerinin adanmışlığı olmadan çalışamazlar.
uk: **Заклик до модераторів** Маючи спільноту такого розміру, нам потрібні люди, які могли б стати модераторами-волонтерами в будь-яких місцях. Ці команди організовані Фондом Годо, але вони не функціонували б без відданості таких активних членів спільноти, як ви.
zh_tw: **徵求版務人員** 隨著社群規模的擴大，我們需要在各個地方有熱心人士挺身而出擔任志願版務人員。這些團隊由 Godot 基金會組織，但若沒有像您這樣活躍的社群成員的奉獻，將無法運作。

source: Have a look around your favorite community platform and you might come across open application calls.
de: Schauen Sie sich auf Ihrer bevorzugten Community-Plattform um. Möglicherweise stoßen Sie auf offene Bewerbungsaufrufe.
ga: Féach timpeall ar an ardán pobail is fearr leat agus b'fhéidir go dtiocfaidh tú ar ghlaonna iarratais oscailte.
ta: உங்களுக்கு பிடித்த சமூக தளத்தை சுற்றிப் பாருங்கள், நீங்கள் திறந்த பயன்பாட்டு அழைப்புகளைக் காணலாம்.
tr: Favori topluluk platformunuza bir göz atın, açık başvuru çağrılarına rastlayabilirsiniz.
uk: Ознайомтеся зі своєю улюбленою платформою спільноти, і ви можете натрапити на відкриті виклики заявок.
zh_cn: 看看你最常用的社区平台，可能就会碰到开放申请。
zh_tw: 逛逛你常用的社群平台，你或許會看到公開的徵人啟事。

source: **Answer tech-support questions** With many new people discovering the Godot Engine recently, the need for peer-to-peer tech-support has never been greater. See the `Godot website <https://godotengine.org/community>`_ for a list of official and user-supported Godot communities.
zh_tw: **回答技術支援問題** 近期有許多新手加入 Godot 引擎，同儕間的技術支援需求前所未有地高。請參考 `Godot 官方網站 <https://godotengine.org/community>`_ 以取得官方和使用者社群列表。

source: **Create tutorials & more** How did you get started with the Godot Engine? Chances are you looked for learning materials outside of what the documentation provides. Without content creators covering the game development process, there would not be this big of a community today. Therefore it seemed only right to mention them in a page about important contributions to the project.
de: **Tutorials und mehr erstellen** Wie sind Sie mit der Godot Engine gestartet? Wahrscheinlich haben Sie nach Lernmaterialien gesucht, die über die Dokumentation hinausgehen. Ohne Inhaltsersteller, die den Spielentwicklungsprozess abdecken, gäbe es heute keine so große Community. Daher schien es nur richtig, sie auf einer Seite über wichtige Beiträge zum Projekt zu erwähnen.
ga: **Cruthaigh ranganna teagaisc & tuilleadh** Conas a thosaigh tú leis an Inneall Godot? Seans go bhfuil tú ag lorg ábhar foghlama taobh amuigh den mhéid a sholáthraíonn na doiciméid. Mura gclúdódh cruthaitheoirí ábhar an próiseas forbartha cluiche, ní bheadh a leithéid de phobal ann inniu. Mar sin ní raibh sé ceart ach iad a lua ar leathanach faoi ranníocaíochtaí tábhachtacha leis an tionscadal.
ta: ** பயிற்சிகளை உருவாக்கு மற்றும் பல ** கோடோட் எஞ்சினுடன் நீங்கள் எவ்வாறு தொடங்கினீர்கள்? ஆவணங்கள் வழங்கும் விசயங்களுக்கு வெளியே கற்றல் பொருட்களை நீங்கள் தேட வாய்ப்புகள் உள்ளன. விளையாட்டு மேம்பாட்டு செயல்முறையை உள்ளடக்கிய உள்ளடக்க படைப்பாளர்கள் இல்லாமல், இன்று ஒரு சமூகத்தின் இந்த பெரியதாக இருக்காது. எனவே திட்டத்தின் முக்கியமான பங்களிப்புகளைப் பற்றி ஒரு பக்கத்தில் அவற்றைக் குறிப்பிடுவது மட்டுமே சரியானதாகத் தோன்றியது.
tr: **Eğitimler ve daha fazlasını oluşturun** Godot Engine ile çalışmaya nasıl başladınız? Muhtemelen dokümantasyonun sağladıklarının dışında öğrenme materyallerini aradınız. Oyun geliştirme sürecini işleyen içerik oluşturucular olmasaydı, bugün bu kadar büyük bir topluluk olmazdı. Bu nedenle, onlar hakkında projeye yapılan önemli katkılarla ilgili ayrı bir sayfada bahsetmek daha doğru görünüyordu.
uk: **Створюйте навчальні посібники та інше** Як ви почали працювати з Godot Engine? Швидше за все, ви шукали навчальні матеріали поза документацією. Без творців контенту, які охоплюють процес розробки гри, сьогодні не було б такої великої спільноти. Тому було цілком правильним згадати про них на сторінці про важливий внесок у проект.
zh_cn: **创建教程和更多内容** 你当初是怎么学习 Godot 引擎的？很可能你当时找了文档以外的学习材料。如果没有内容创作者来覆盖游戏开发的过程，今天就不会有如此规模的社区。这样看来，在项目重要贡献的相关页面中提及到这些人非常合理。
zh_tw: **製作教學與更多內容** 你是如何開始使用 Godot 引擎的呢？很有可能你尋找了官方文件以外的學習資源。如果沒有內容創作者分享遊戲開發過程，今天就不會有如此龐大的社群。因此，在提及對專案的重要貢獻時，將他們納入其中似乎是理所當然的。

source: **Publish Godot Games.** You heard right, simply publishing a game #MadeWithGodot can positively impact the well-being of this project. Your personal success elevates the engine to a viable alternative for other developers, growing the community further. Additionally, it opens the doors for us to approach industry contacts about possible cooperations.
de: **Godot-Spiele veröffentlichen.** Sie haben richtig gehört, allein die Veröffentlichung eines Spiels #MadeWithGodot kann sich positiv auf das Gedeihen dieses Projekts auswirken. Ihr persönlicher Erfolg macht die Engine zu einer brauchbaren Alternative für andere Entwickler und lässt die Community weiter wachsen. Außerdem öffnet es uns die Türen, Branchenkontakte wegen möglicher Kooperationen anzusprechen.
