Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/procedural_geometry/immediatemesh.po
Languages: ga, ja, pt_br, ru, ta, uk, zh_tw

source: Using ImmediateMesh
ga: Ag baint úsáide as ImmediateMesh
ja: ImmediateMeshの使用
ru: Использование ImmediateMesh
ta: உடனடிமேசைப் பயன்படுத்துதல்
uk: Використання ImmediateMesh
zh_tw: 使用 ImmediateMesh

source: The :ref:`ImmediateMesh <class_ImmediateMesh>` is a convenient tool to create dynamic geometry using an OpenGL 1.x-style API. Which makes it both approachable to use and efficient for meshes which need to be updated every frame.
ga: Is uirlis áisiúil é an :ref:`ImmediateMesh <class_ImmediateMesh>` chun céimseata dhinimiciúil a chruthú ag baint úsáide as API ar stíl OpenGL 1.x. Rud a fhágann go bhfuil sé sochaideartha le húsáid agus éifeachtach le haghaidh mogaill ar gá gach fráma a nuashonrú.
ja: :ref:`ImmediateMesh <class_ImmediateMesh>` は、OpenGL 1.x スタイルの API を使用して動的なジオメトリを作成するための便利なツールです。これはフレームごとに更新する必要があるメッシュに対して使いやすく効率的です。
pt_br: O :ref:`ImmediateMesh <class_ImmediateMesh>` é uma ferramenta prática para criar geometria dinâmica usando uma API no estilo do OpenGL 1.x. Isso o torna tanto acessível de usar quanto eficiente para malhas que precisam ser atualizadas a cada frame.
ru: :ref:`ImmediateMesh <class_ImmediateMesh>` — удобный инструмент для создания динамической геометрии с использованием API в стиле OpenGL 1.x. Что делает его доступным в использовании и эффективным для сеток, которые необходимо обновлять в каждом кадре.
ta: தி: ref: `உடனடிமேச் <class_immediatemesh>` என்பது OpenGL 1.x- பாணி பநிஇ ஐப் பயன்படுத்தி மாறும் வடிவவியலை உருவாக்க ஒரு வசதியான கருவியாகும். இது ஒவ்வொரு சட்டகத்தையும் புதுப்பிக்க வேண்டிய மெச்களுக்கான பயன்பாட்டை அணுகக்கூடியதாகவும் திறமையாகவும் ஆக்குகிறது.
uk: :ref:`ImmediateMesh <class_ImmediateMesh>` — це зручний інструмент для створення динамічної геометрії за допомогою API у стилі OpenGL 1.x. Це робить його доступним для використання та ефективним для сіток, які потрібно оновлювати кожен кадр.
zh_tw: :ref:`ImmediateMesh <class_ImmediateMesh>` 是一個方便的工具，可以用 OpenGL 1.x 風格的 API 建立動態幾何體。這讓它適合用於需要每影格即時更新的網格，且易於使用。

source: Generating complex geometry (several thousand vertices) with this tool is inefficient, even if it's done only once. Instead, it is designed to generate simple geometry that changes every frame.
ga: Tá céimseata casta (roinnt mílte vertices) a ghiniúint leis an uirlis seo neamhéifeachtúil, fiú mura ndéantar é ach uair amháin. Ina áit sin, tá sé deartha chun geoiméadracht shimplí a ghiniúint a athraíonn gach fráma.
ja: このノードを使用して複雑なジオメトリ(数千個の頂点)を生成することは、たとえ1回だけ実行される場合でも非効率的です。これはフレームごとに変化する単純なジオメトリを生成するように設計されています。
pt_br: Gerar geometria complexa (com vários milhares de vértices) com essa ferramenta é ineficiente, mesmo que seja feito apenas uma vez. Em vez disso, ela foi projetada para gerar geometria simples que muda a cada frame.
ru: Генерация сложной геометрии (несколько тысяч вершин) с помощью этого инструмента неэффективна, даже если выполняется только один раз. Вместо этого он предназначен для создания простой геометрии, которая меняется каждый кадр.
ta: இந்த கருவியுடன் சிக்கலான வடிவவியலை (பல ஆயிரம் செங்குத்துகள்) உருவாக்குவது திறமையற்றது, அது ஒரு முறை மட்டுமே செய்யப்பட்டிருந்தாலும் கூட. அதற்கு பதிலாக, ஒவ்வொரு சட்டகத்தையும் மாற்றும் எளிய வடிவவியலை உருவாக்க இது வடிவமைக்கப்பட்டுள்ளது.
uk: Генерувати складну геометрію (кілька тисяч вершин) за допомогою цього інструменту неефективно, навіть якщо це зробити лише один раз. Натомість він призначений для створення простої геометрії, яка змінює кожен кадр.
zh_tw: 使用這個工具產生複雜幾何體（數千個頂點）效率不高，即使只產生一次也是如此。ImmediateMesh 的設計目標是用來生成每影格變化的簡單幾何體。

source: First, you need to create a :ref:`MeshInstance3D <class_meshinstance3d>` and add an :ref:`ImmediateMesh <class_ImmediateMesh>` to it in the Inspector.
ga: Ar dtús, ní mór duit :ref:`MeshInstance3D <class_meshinstance3d>` a chruthú agus :ref:`ImmediateMesh <class_ImmediateMesh>` a chur leis sa Chigire.
ja: まず :ref:`MeshInstance3D <class_meshinstance3d>` を作成し、インスペクターでそれに :ref:`ImmediateMesh <class_ImmediateMesh>` を追加する必要があります。
pt_br: Primeiro, você precisa criar um :ref:`MeshInstance3D <class_meshinstance3d>` e adicionar um :ref:`ImmediateMesh <class_ImmediateMesh>` a ele no Inspetor.
ru: Сначала вам нужно создать :ref:`MeshInstance3D <class_meshinstance3d>` и добавить к нему :ref:`ImmediateMesh <class_ImmediateMesh>` в Инспекторе.
ta: முதலில், நீங்கள் ஒரு: ref: `meshinstance3d <class_meshinstance3d>` ஐ உருவாக்க வேண்டும், மேலும் ஒரு: ref: `உடனடிமேச் <class_immediatemesh>` இன் இன்ச்பெக்டரில் சேர்க்கவும்.
uk: Спочатку вам потрібно створити :ref:`MeshInstance3D <class_meshinstance3d>` і додати :ref:`ImmediateMesh <class_ImmediateMesh>` до нього в інспекторі.
zh_tw: 首先，你需要在編輯器中建立一個 :ref:`MeshInstance3D <class_meshinstance3d>`，並在屬性檢視器中將 :ref:`ImmediateMesh <class_ImmediateMesh>` 指派給它。

source: Next, add a script to the MeshInstance3D. The code for the ImmediateMesh should go in the ``_process()`` function if you want it to update each frame, or in the ``_ready()`` function if you want to create the mesh once and not update it. If you only generate a surface once, the ImmediateMesh is just as efficient as any other kind of mesh as the generated mesh is cached and reused.
ga: Ansin, cuir script leis an MeshInstance3D. Ba chóir go rachadh an cód don ImmediateMesh san fheidhm ''_process()'' más mian leat gach fráma a nuashonrú, nó san fheidhm ''_ready()'' más mian leat an mogalra a chruthú uair amháin agus gan é a nuashonrú. Mura ngineann tú ach dromchla uair amháin, tá an ImmediateMesh chomh héifeachtach le haon chineál eile mogalra agus an mogalra a ghintear i dtaisce agus athúsáidte.
ja: 次に MeshInstance3D にスクリプトを追加します。ImmediateMesh のコードは、各フレームを更新する場合は ``_process()`` 関数に、メッシュを1回だけ作成して更新しない場合は ``_ready()`` 関数に記述する必要があります。サーフェスを1回だけ生成する場合、ImmediateMesh は、生成されたメッシュがキャッシュされて再利用されるため、他の種類のメッシュと同じくらい効率的です。
pt_br: Em seguida, adicione um script ao MeshInstance3D. O código para o ImmediateMesh deve ser colocado na função ``_process()`` se você quiser que ele seja atualizado a cada frame, ou na função ``_ready()`` se quiser criar a malha apenas uma vez e não atualizá-la. Se você gerar uma superfície apenas uma vez, o ImmediateMesh é tão eficiente quanto qualquer outro tipo de malha, pois a malha gerada é armazenada em cache e reutilizada.
ru: Затем добавьте скрипт в MeshInstance3D. Код для ImmediateMesh должен быть в функции ``_process()``, если вы хотите, чтобы он обновлял каждый кадр, или в функции ``_ready()``, если вы хотите создать сетку один раз и не обновлять ее. Если вы генерируете поверхность только один раз, ImmediateMesh так же эффективен, как и любой другой тип сетки, поскольку сгенерированная сетка кэшируется и используется повторно.
ta: அடுத்து, Meshinstance3d இல் ஒரு ச்கிரிப்டைச் சேர்க்கவும். உடனடி மெசிற்கான குறியீடு ஒவ்வொரு சட்டகத்தையும் புதுப்பிக்க விரும்பினால், அல்லது `` _ ஆயத்தம் () `செயல்பாட்டில் நீங்கள் விரும்பினால், நீங்கள் ஒரு முறை மெசை உருவாக்க விரும்பினால், புதுப்பிக்காவிட்டால்` `_ நடைமுறைக்கு ()` `செயல்பாட்டில் செல்ல வேண்டும். நீங்கள் ஒரு முறை மட்டுமே ஒரு மேற்பரப்பை உருவாக்கினால், உருவாக்கப்பட்ட கண்ணி தற்காலிக சேமிப்பு மற்றும் மீண்டும் பயன்படுத்தப்படுவதைப் போலவே வேறு எந்த வகையான கண்ணி போலவே உடனடிமேச் திறமையானது.
uk: Далі додайте сценарій до MeshInstance3D. Код для ImmediateMesh має міститися у функції ``_process()``, якщо ви хочете, щоб він оновлював кожен кадр, або у функції ``_ready()``, якщо ви хочете створити сітку один раз і не оновлювати її. Якщо ви створюєте поверхню лише один раз, ImmediateMesh так само ефективний, як і будь-який інший вид сіті, оскільки створена сітка кешується та повторно використовується.
zh_tw: 接著，將腳本掛到 MeshInstance3D 上。如果要每影格即時更新，請將 ImmediateMesh 的程式碼寫在 ``_process()``。若只需建立一次網格且不會更新，則可寫在 ``_ready()``。若只產生一次表面，ImmediateMesh 的效能與其他網格類型相同，因為生成後會快取重複利用。

source: To begin generating geometry you must call ``surface_begin()``. ``surface_begin()`` takes a ``PrimitiveType`` as an argument. ``PrimitiveType`` instructs the GPU how to arrange the primitive based on the vertices given whether it is triangles, lines, points, etc. A complete list can be found under the :ref:`Mesh <class_mesh>` class reference page.
ga: Chun tús a chur le céimseata a ghiniúint ní mór duit ``dromchla_begin()`` a ghlaoch. Glacann ``dromchla_begin()`` ``PrimitiveType`` mar argóint. Tugann ``PrimitiveType`` treoir don GPU conas an primitive a shocrú bunaithe ar na rinn a thugtar cibé acu an triantáin, línte, pointí, srl é. Is féidir liosta iomlán a fháil faoin :ref:`Mogalra <class_mesh>` leathanach tagartha ranga.
ja: ジオメトリの生成を開始するには、 ``surface_begin()`` を呼び出す必要があります。 ``surface_begin()`` は ``PrimitiveType`` を引数として 取ります。 ``PrimitiveType`` は、三角形、線、点など、指定された頂点に基づいてプリミティブを配置する方法を GPU に指示します。完全なリストは、:ref:`Mesh <class_mesh>` クラスのリファレンス ページにあります。
pt_br: Para começar a gerar geometria, você deve chamar ``surface_begin()``. ``surface_begin()`` recebe um ``PrimitiveType`` como argumento. O ``PrimitiveType`` instrui a GPU sobre como organizar a primitiva com base nos vértices fornecidos, seja em triângulos, linhas, pontos etc. Uma lista completa pode ser encontrada na página de referência da classe :ref:`Mesh <class_mesh>`.
ru: Чтобы начать создание геометрии, необходимо вызвать ``surface_begin()``. ``surface_begin()`` принимает аргумент ``PrimitiveType``. ``PrimitiveType`` указывает GPU, как расположить примитив на основе переданных вершин (будь то треугольники, линии, точки и т.д.). Полный список можно найти в документации класса :ref:`Mesh <class_mesh>`.
ta: வடிவவியலை உருவாக்கத் தொடங்க நீங்கள் `` மேற்பரப்பு_பெசின் () `` என்று அழைக்க வேண்டும். `` மேற்பரப்பு_பெசின் () `` ஒரு வாதமாக ஒரு `` ப்ரிமிடிவ் டைப்`` எடுக்கிறது. `` ப்ரிமிடிவ் டைப்`` சி.பீ.யை அறிவுறுத்துகிறது, இது முக்கோணங்கள், கோடுகள், புள்ளிகள் போன்றவையா என்று கொடுக்கப்பட்ட செங்குத்துகளின் அடிப்படையில் பழமையானதை எவ்வாறு ஏற்பாடு செய்வது.
uk: Щоб почати генерувати геометрію, ви повинні викликати ``surface_begin()``. ``surface_begin()`` приймає ``PrimitiveType`` як аргумент. ``PrimitiveType`` вказує GPU, як упорядкувати примітив на основі заданих вершин, незалежно від того, чи це трикутники, лінії, точки тощо. Повний список можна знайти на сторінці посилання на клас :ref:`Mesh <class_mesh>`.
zh_tw: 要開始生成幾何體，必須先呼叫 ``surface_begin()``。``surface_begin()`` 需要一個 ``PrimitiveType`` 參數，這是用來指示 GPU 如何根據給定頂點組合出三角形、線段、點等。所有可用的型別都可以在 :ref:`Mesh <class_mesh>` 類別參考頁找到。

source: Once you have called ``surface_begin()`` you are ready to start adding vertices. You add vertices one at a time. First you add vertex specific attributes such as normals or UVs using ``surface_set_****()`` (e.g. ``surface_set_normal()``). Then you call ``surface_add_vertex()`` to add a vertex with those attributes. For example:
ga: Nuair a bheidh tú ar a dtugtar ''surface_begin()'' tá tú réidh chun tús a chur vertices. Cuireann tú vertices amháin ag an am. Ar dtús, cuireann tú tréithe sonracha vertex ar nós gnáthaimh nó UVanna le ''surface_set_****()'' (m.sh. ''surface_set_normal()''). Ansin glaonn tú ar ''surface_add_vertex()'' chun stuaic a chur leis na tréithe sin. Mar shampla:
ja: ``surface_begin()`` を呼び出したら、頂点の追加を開始する準備が整います。頂点は一度に1つずつ追加します。最初に ``surface_set_****()`` (例 ``surface_set_normal()``) を使用して、法線や UV などの頂点固有の属性を追加します。次に ``surface_add_vertex()`` を呼び出して、それらの属性を持つ頂点を追加します。例えば:
pt_br: Depois de chamar ``surface_begin()``, você está pronto para começar a adicionar vértices. Os vértices são adicionados um por vez. Primeiro, você adiciona os atributos específicos do vértice, como normais ou UVs, usando ``surface_set_****()`` (por exemplo, ``surface_set_normal()``). Em seguida, você chama ``surface_add_vertex()`` para adicionar um vértice com esses atributos. Por exemplo:
ru: После вызова ``surface_begin()`` можно начинать добавлять вершины. Вершины добавляются по одной. Сначала задаются атрибуты конкретной вершины, такие как нормали или UV-координаты, с помощью ``surface_set_****()`` (например, ``surface_set_normal()``). Затем вызывается ``surface_add_vertex()`` для добавления вершины с этими атрибутами. Например:
ta: நீங்கள் `` மேற்பரப்பு_பெசின் () `` என்று அழைத்தவுடன் நீங்கள் செங்குத்துகளைச் சேர்க்கத் தயாராக உள்ளீர்கள். நீங்கள் ஒரு நேரத்தில் செங்குத்துகளைச் சேர்க்கிறீர்கள். முதலில் நீங்கள் `` மேற்பரப்பு_செட் _ **** () `` (எ.கா. `` மேற்பரப்பு_செட்_நார்மல் () ``) ஐப் பயன்படுத்தி இயல்பான அல்லது யு.வி.எச் போன்ற வெர்டெக்ச் குறிப்பிட்ட பண்புகளைச் சேர்க்கிறீர்கள். அந்த பண்புகளுடன் ஒரு வெர்டெக்சைச் சேர்க்க `` மேற்பரப்பு_ஏடி_வெர்டெக்ச் () `` என்று அழைக்கவும். உதாரணமாக:
uk: Після виклику Surface_begin() ви готові почати додавати вершини. Ви додаєте вершини по одній. Спочатку ви додаєте специфічні атрибути вершин, такі як нормалі або UV, використовуючи ``surface_set_****()`` (наприклад, ``surface_set_normal()``). Потім ви викликаєте ``surface_add_vertex()``, щоб додати вершину з цими атрибутами. Наприклад:
zh_tw: 呼叫 ``surface_begin()`` 之後，就可以開始逐一新增頂點。首先，透過 ``surface_set_****()``（如 ``surface_set_normal()``）指定頂點的屬性（如法線或 UV），然後用 ``surface_add_vertex()`` 將該頂點加入網格。範例如下：

source: Only attributes added before the call to ``surface_add_vertex()`` will be included in that vertex. If you add an attribute twice before calling ``surface_add_vertex()``, only the second call will be used.
ga: Ní chuirfear san áireamh sa stuaic sin ach tréithe a cuireadh leis roimh an nglao ar ''surface_add_vertex()''. Má chuireann tú tréith leis faoi dhó sula nglaonn tú ar ''surface_add_vertex()'', ní úsáidfear ach an dara glao.
ja: ``surface_add_vertex()`` の呼び出し前に追加された属性のみがその頂点に含まれます。 ``surface_add_vertex()`` を呼び出す前に属性を2回追加した場合、2回目の呼び出しのみが使用されます。
pt_br: Apenas os atributos adicionados antes da chamada de ``surface_add_vertex()`` serão incluídos naquele vértice. Se você adicionar um atributo duas vezes antes de chamar ``surface_add_vertex()``, apenas a segunda chamada será usada.
ru: В вершину включаются только атрибуты, добавленные до вызова ``surface_add_vertex()``. Если вы добавите атрибут дважды перед вызовом ``surface_add_vertex()``, будет использован только второй вызов.
ta: `` மேற்பரப்பு_ஏடி_வெர்டெக்ச் () `` க்கு அழைப்புக்கு முன் சேர்க்கப்பட்ட பண்புக்கூறுகள் மட்டுமே அந்த வெர்டெக்சில் சேர்க்கப்படும். `` மேற்பரப்பு_ஏடி_வெர்டெக்ச் () `` என்று அழைப்பதற்கு முன் இரண்டு முறை ஒரு பண்புக்கூறு சேர்த்தால், இரண்டாவது அழைப்பு மட்டுமே பயன்படுத்தப்படும்.
uk: Лише атрибути, додані до виклику ``surface_add_vertex()``, будуть включені в цю вершину. Якщо ви двічі додаєте атрибут перед викликом ``surface_add_vertex()``, використовуватиметься лише другий виклик.
zh_tw: 只有在呼叫 ``surface_add_vertex()`` 之前設定的屬性，才會包含在該頂點中。若重複設定同一屬性，僅最後一次設定會生效。

source: Finally, once you have added all your vertices call ``surface_end()`` to signal that you have finished generating the surface. You can call ``surface_begin()`` and ``surface_end()`` multiple times to generate multiple surfaces for the mesh.
ga: Mar fhocal scoir, nuair a bheidh do chuid vertices go léir curtha leis, glaoigh ar ''surface_end()'' chun comhartha a thabhairt go bhfuil an dromchla críochnaithe agat. Is féidir leat glaoch ar ''surface_begin()'' agus ''surface_end()'' arís agus arís eile chun dromchlaí éagsúla a ghiniúint don mhogalra.
ja: 最後にすべての頂点を追加したら、サーフェスの生成が完了したことを通知するために ``surface_end()`` を呼び出します。メッシュの複数のサーフェスを生成するには、 ``surface_begin()`` と ``surface_end()`` を複数回呼び出します。
pt_br: Por fim, após adicionar todos os seus vértices, chame ``surface_end()`` para sinalizar que terminou de gerar a superfície. Você pode chamar ``surface_begin()`` e ``surface_end()`` várias vezes para gerar múltiplas superfícies para a malha.
ru: Наконец, после добавления всех вершин вызовите ``surface_end()``, чтобы сигнализировать о завершении создания поверхности. Вы можете вызывать ``surface_begin()`` и ``surface_end()`` несколько раз для создания нескольких поверхностей для одной сетки.
ta: இறுதியாக, நீங்கள் உங்கள் எல்லா செங்குத்துகளையும் சேர்த்தவுடன், நீங்கள் மேற்பரப்பை உருவாக்கி முடித்துவிட்டீர்கள் என்பதைக் குறிக்க `` மேற்பரப்பு_என்ட் () `` என்று அழைக்கவும். கண்ணிக்கு பல மேற்பரப்புகளை உருவாக்க நீங்கள் `` மேற்பரப்பு_பெசின் () `` `` மற்றும் `மேற்பரப்பு_என்ட் ()` `பல முறை அழைக்கலாம்.
uk: Нарешті, коли ви додали всі свої вершини, викличте ``surface_end()``, щоб сигналізувати про те, що ви закінчили генерувати поверхню. Ви можете викликати ``surface_begin()`` і ``surface_end()`` кілька разів, щоб створити кілька поверхонь для сітки.
zh_tw: 最後，當加入所有頂點後，請呼叫 ``surface_end()``，通知 Godot 你已完成該表面。你也可以多次呼叫 ``surface_begin()`` 和 ``surface_end()``，以建立多個表面。

source: The example code below draws a single triangle in the ``_ready()`` function.
ga: Tarraingíonn an cód samplach thíos triantán amháin san fheidhm ''_ready()'''.
ja: 以下のサンプルコードは、 ``_ready()`` 関数で単一の三角形を描画します。
ru: Пример кода ниже рисует один треугольник в функции ``_ready()``.
ta: கீழேயுள்ள எடுத்துக்காட்டு குறியீடு `` _ready () `` செயல்பாட்டில் ஒற்றை முக்கோணத்தை ஈர்க்கிறது.
uk: Наведений нижче приклад коду малює один трикутник у функції ``_ready()``.
zh_tw: 以下範例會在 ``_ready()`` 函式中繪製一個三角形。

source: The ImmediateMesh can also be used across frames. Each time you call ``surface_begin()`` and ``surface_end()``, you are adding a new surface to the ImmediateMesh. If you want to recreate the mesh from scratch each frame, call ``clear_surfaces()`` before calling ``surface_begin()``.
ga: Is féidir an ImmediateMesh a úsáid freisin ar fud frámaí. Gach uair a ghlaonn tú ar ''surface_begin()'' agus ''surface_end()'', tá dromchla nua á chur agat leis an ImmediateMesh. Más mian leat an mogall a athchruthú ó thús gach fráma, glaoigh ar ''clear_surfaces()'' sula nglaonn tú ar ''surface_begin()''.
ja: ImmediateMesh はフレーム間でも使用できます。 ``surface_begin()`` と ``surface_end()`` を呼び出すたびに、ImmediateMesh に新しいサーフェスが追加されます。フレームごとにメッシュを最初から再作成する場合は、 ``surface_begin()`` を呼び出す前に ``clear_surfaces()`` を呼び出します。
pt_br: O ImmediateMesh também pode ser usado entre frames. Cada vez que você chama ``surface_begin()`` e ``surface_end()``, uma nova superfície é adicionada ao ImmediateMesh. Se quiser recriar a malha do zero a cada frame, chame ``clear_surfaces()`` antes de chamar ``surface_begin()``.
ru: ImmediateMesh также можно использовать между кадрами. Каждый раз, когда вы вызываете ``surface_begin()`` и ``surface_end()``, вы добавляете новую поверхность в ImmediateMesh. Если вы хотите воссоздавать сетку с нуля в каждом кадре, вызовите ``clear_surfaces()`` перед вызовом ``surface_begin()``.
ta: உடனடிமேசை பிரேம்களிலும் பயன்படுத்தலாம். ஒவ்வொரு முறையும் நீங்கள் `` மேற்பரப்பு_பெசின் () `` `மற்றும்` `மேற்பரப்பு_எண்ட் ()` `என்று அழைக்கும்போது, உடனடிமேசில் ஒரு புதிய மேற்பரப்பைச் சேர்க்கிறீர்கள். ஒவ்வொரு சட்டகத்தையும் கீறுவதிலிருந்து கண்ணி மீண்டும் உருவாக்க விரும்பினால், `` மேற்பரப்பு_பெசின் () `` என்று அழைப்பதற்கு முன் `` Clear_surfaces () `` ஐ அழைக்கவும்.
uk: ImmediateMesh також можна використовувати між фреймами. Кожного разу, коли ви викликаєте ``surface_begin()`` і ``surface_end()``, ви додаєте нову поверхню до ImediateMesh. Якщо ви хочете відтворити сітку з нуля для кожного кадру, викличте ``clear_surfaces()`` перед викликом ``surface_begin()``.
zh_tw: ImmediateMesh 也可以跨影格使用。每次呼叫 ``surface_begin()`` 和 ``surface_end()``，都會新增一個新表面到 ImmediateMesh。如果你想每影格都從零重新建立網格，請在呼叫 ``surface_begin()`` 之前先呼叫 ``clear_surfaces()``。

source: The above code will dynamically create and draw a single surface each frame.
ga: Beidh an cód thuas a chruthú go dinimiciúil agus a tharraingt dromchla amháin gach fráma.
ja: 上記のコードは、フレームごとに1つのサーフェスを動的に作成して描画します。
pt_br: O código acima criará e desenhará dinamicamente uma única superfície em cada quadro.
ru: Приведенный выше код будет динамически создавать и рисовать одну поверхность в каждом кадре.
ta: மேலே உள்ள குறியீடு ஒவ்வொரு சட்டகத்தையும் ஒரு மேற்பரப்பை உருவாக்கி வரையும்.
uk: Наведений вище код динамічно створюватиме та малюватиме одну поверхню для кожного кадру.
zh_tw: 上述程式碼會在每個影格動態建立並繪製一個表面。
