Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/procedural_geometry/index.po
Languages: ga, it, ko, pt_br, ta

source: Procedural geometry
ga: Céimseata nós imeachta
it: Geometria procedurale
ko: 절차적 기하
pt_br: Geometria processual
ta: நடைமுறை வடிவியல்

source: There are many ways to procedurally generate geometry in Godot. In this tutorial series, we will explore a few of them. Each technique has its own benefits and drawbacks, so it is best to understand each one and how it can be useful in a given situation.
ga: Tá go leor bealaí ann chun céimseata a ghiniúint i Godot. Sa tsraith teagaisc seo, déanfaimid iniúchadh ar roinnt acu. Tá gach teicníc a buntáistí agus míbhuntáistí féin, mar sin tá sé is fearr a thuiscint gach ceann agus conas is féidir é a bheith úsáideach i gcás ar leith.
it: Ci sono numerosi modi per generare geometria proceduralmente in Godot. In questa serie di tutorial, ne esploreremo alcuni. Ogni tecnica ha i suoi vantaggi e svantaggi, quindi è meglio comprenderle tutte e capire come servirebbero in una determinata situazione.
ko: Godot에서 절차적으로 지오메트리를 생성하는 여러 가지 방법이 있습니다. 이 튜토리얼에서는 그 중 몇 가지를 살펴봅니다. 각각의 기법에는 장단점이 있으므로, 각 기법과 이를 주어진 상황에서 어떻게 활용할지 이해하는 것이 가장 좋습니다.
pt_br: Existem várias maneiras de gerar geometria proceduralmente no Godot. Nesta série de tutoriais, exploraremos algumas delas. Cada técnica tem seus próprios benefícios e limitações, portanto é melhor compreender cada uma e como ela pode ser útil em uma determinada situação.
ta: கோடோட்டில் நடைமுறையில் வடிவவியலை உருவாக்க பல வழிகள் உள்ளன. இந்த டுடோரியல் தொடரில், அவற்றில் சிலவற்றை ஆராய்வோம். ஒவ்வொரு நுட்பமும் அதன் சொந்த நன்மைகள் மற்றும் குறைபாடுகளைக் கொண்டுள்ளது, எனவே ஒவ்வொன்றையும் புரிந்துகொள்வது நல்லது, கொடுக்கப்பட்ட சூழ்நிலையில் அது எவ்வாறு பயனுள்ளதாக இருக்கும்.

source: All the procedural geometry generation methods described here run on the CPU. Godot doesn't support generating geometry on the GPU yet.
ga: Ritheann na modhanna giniúna geoiméadrachta nós imeachta go léir a thuairiscítear anseo ar an LAP. Ní thacaíonn Godot le geoiméadracht a ghiniúint ar an GPU go fóill.
it: Tutti i metodi di generazione procedurale di geometria qui descritti vengono eseguiti sulla CPU. Godot non supporta ancora la generazione di geometria sulla GPU.
ko: 여기 설명된 모든 절차적 지오메트리 생성 방법은 CPU에서 실행됩니다. Godot는 아직 GPU에서의 절차적 지오메트리 생성을 지원하지 않습니다.
pt_br: Todos os métodos de geração procedural de geometria descritos aqui são executados na CPU. O Godot ainda não oferece suporte à geração de geometria na GPU.
ta: இங்கே விவரிக்கப்பட்டுள்ள அனைத்து நடைமுறை வடிவியல் தலைமுறை முறைகளும் சிபியு இல் இயங்குகின்றன. GPU இல் வடிவவியலை உருவாக்குவதை கோடோட் ஆதரிக்கவில்லை.

source: What is geometry?
ga: Cad is céimseata ann?
it: Che cos'è la geometria?
ko: 지오메트리란?
pt_br: O que é geometria?
ta: வடிவியல் என்றால் என்ன?

source: Geometry is a fancy way of saying shape. In computer graphics, geometry is typically represented by an array of positions called "vertices". In Godot, geometry is represented by Meshes.
ga: Is bealach mhaisiúil é céimseata chun cruth a rá. I grafaicí ríomhaire, tá geoiméadracht ionadaíocht de ghnáth ag sraith de phoist ar a dtugtar "vertices". I Godot, tá geoiméadracht ionadaíocht ag Meshes.
it: La geometria è un termine elegante per indicare una forma. Nella computergrafica, la geometria è tipicamente rappresentata da una serie di posizioni chiamate "vertici". In Godot, la geometria è rappresentata da mesh.
ko: 지오메트리는 모양을 표현하는 유식한 말입니다. 컴퓨터 그래픽에서, 지오메트리는 일반적으로 "꼭짓점"이라고 하는 좌표들의 배열로 표현됩니다. Godot에서는, 지오메트리가 메시로 표현됩니다.
pt_br: Geometria é uma forma elegante de dizer forma. Em computação gráfica, a geometria é tipicamente representada por um array de posições chamado "vértices". No Godot, a geometria é representada por Meshes.
ta: வடிவியல் என்பது வடிவத்தை சொல்வதற்கான ஒரு ஆடம்பரமான வழியாகும். கணினி கிராபிக்ச், வடிவியல் பொதுவாக "செங்குத்துகள்" எனப்படும் நிலைகளின் வரிசையால் குறிக்கப்படுகிறது. கோடோட்டில், வடிவியல் மெச்களால் குறிக்கப்படுகிறது.

source: What is a Mesh?
ga: Cad is Mogalra ann?
it: Che cos'è una Mesh?
ko: 메시란?
pt_br: O que é uma Malha?
ta: கண்ணி என்றால் என்ன?

source: Many things in Godot have mesh in their name: the :ref:`Mesh <class_Mesh>`, the :ref:`ArrayMesh <class_ArrayMesh>`, the :ref:`ImmediateMesh <class_ImmediateMesh>`, the :ref:`MeshInstance3D <class_MeshInstance3D>`, the :ref:`MultiMesh <class_MultiMesh>`, and the :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`. While they are all related, they have slightly different uses.
ga: Tá mogaill ag go leor rudaí in Godot ina n-ainm: an :ref:`mogalra <class_Mesh>`, an :ref:`ArrayMesh <class_ArrayMesh>`, an :ref:`ImmediateMesh <class_ImmediateMesh>`, an :ref:`MeshInstance3D < class_MeshInstance3D>`, an :ref:`MultiMesh <class_MultiMesh>`, agus an :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`. Cé go bhfuil baint acu go léir, tá úsáidí beagán difriúil acu.
it: Molti oggetti in Godot hanno la parola mesh nel loro nome: :ref:`Mesh <class_Mesh>`, :ref:`ArrayMesh <class_ArrayMesh>`, :ref:`ImmediateMesh <class_ImmediateMesh>`, :ref:`MeshInstance3D <class_MeshInstance3D>`, :ref:`MultiMesh <class_MultiMesh>` e :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`. Sebbene siano tutti correlati, hanno usi leggermente diversi.
ko: Godot의 많은 것들은 다음과 같이 이름 속에 Mesh를 포함합니다... :ref:`Mesh <class_Mesh>`, :ref:`ArrayMesh <class_ArrayMesh>`, :ref:`ImmediateMesh <class_ImmediateMesh>`, :ref:`MeshInstance3D <class_MeshInstance3D>`, :ref:`MultiMesh <class_MultiMesh>`, :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`. 이것들은 모두 서로 연관되어 있지만, 사용되는 곳이 조금씩 다릅니다.
pt_br: Muitas coisas no Godot têm "mesh" no nome: o :ref:`Mesh <class_Mesh>`, o :ref:`ArrayMesh <class_ArrayMesh>`, o :ref:`ImmediateMesh <class_ImmediateMesh>`, o :ref:`MeshInstance3D <class_MeshInstance3D>`, o :ref:`MultiMesh <class_MultiMesh>`, e o :ref:`MultiMeshInstance3D <class_MultiMeshInstance3D>`. Embora todos estejam relacionados, eles têm usos ligeiramente diferentes.
ta: கோடோட்டில் உள்ள பல விசயங்கள் அவற்றின் பெயரில் மெச் உள்ளன: தி: ரெஃப்: `கண்ணி <class_mesh>`, தி: ref: `அரேமேச் <class_arraymesh>`, தி: ref: `உடனடி:` உடனடி: _immediatemesh> `, the: ref:` meshinstance3d < class_meshinstance3d> `, the: ref:` மல்டிமேச் <class_multimesh> `, மற்றும் தி: ref:` mullishinstance3d <class_multimeshinstance3d> `. அவை அனைத்தும் தொடர்புடையவை என்றாலும், அவை சற்று மாறுபட்ட பயன்பாடுகளைக் கொண்டுள்ளன.

source: Meshes and ArrayMeshes are resources that are drawn using a MeshInstance3D node. Resources like Meshes and ArrayMeshes cannot be added to the scene directly. A MeshInstance3D represents one instance of a mesh in your scene. You can reuse a single mesh in multiple MeshInstance3Ds to draw it in different parts of your scene with different materials or transformations (scale, rotation, position etc.).
ga: Is acmhainní iad mogaill agus ArrayMeshes a tharraingítear ag baint úsáide as nód MeshInstance3D. Ní féidir acmhainní cosúil le Meshes agus ArrayMeshes a chur leis an radharc go díreach. Is ionann MeshInstance3D agus cás amháin de mhogall i do radharc. Is féidir leat mogalra amháin a athúsáid i mogalraInstance3Ds iolracha chun é a tharraingt i gcodanna éagsúla de do radharc le hábhair nó claochluithe éagsúla (scála, uainíocht, suíomh etc.).
it: Mesh e ArrayMesh sono risorse disegnate tramite un nodo MeshInstance3D. Risorse come Mesh e ArrayMesh non si possono aggiungere direttamente alla scena. Un nodo MeshInstance3D rappresenta un'istanza di una mesh nella scena. È possibile riutilizzare una singola mesh in più nodi MeshInstance3D per disegnarla in diverse parti della scena, con materiali o trasformazioni differenti (scala, rotazione, posizione, ecc.).
ko: 메시와 ArrayMesh는 MeshInstance3D 노드로 그려지는 리소스입니다. 메시나 ArrayMesh와 같은 리소스는 씬에 직접 추가될 수 없습니다. MeshInstance3D는 씬에서 메시 하나의 인스턴스를 나타냅니다. 하나의 메시를 여러 MeshInstance3D에 재사용하여 제각기 다른 머티리얼과 변형(스케일, 회전, 위치 등) 으로 씬의 서로 다른 부분을 그릴 수 있습니다.
pt_br: Meshes e ArrayMeshes são recursos, os quais são desenhados usando um nó MeshInstance3D. Recursos como Meshes e ArrayMeshes não podem ser adicionados diretamente à cena. Um MeshInstance3D representa uma instância de uma mesh na sua cena. Você pode reutilizar uma única mesh em vários MeshInstance3Ds para desenhá-la em diferentes partes da cena com materiais ou transformações diferentes (escala, rotação, posição etc.).
ta: மெச்கள் மற்றும் வரிசைப்படுத்திகள் ஒரு மெசின்ச்டன்ச் 3 டி முனையைப் பயன்படுத்தி வரையப்படும் வளங்கள். மெச்கள் மற்றும் வரிசைகள் போன்ற வளங்களை நேரடியாக காட்சியில் சேர்க்க முடியாது. ஒரு மெசின்ச்டன்ச் 3 டி உங்கள் காட்சியில் ஒரு கண்ணி ஒரு நிகழ்வைக் குறிக்கிறது. உங்கள் காட்சியின் வெவ்வேறு பகுதிகளில் வெவ்வேறு பொருட்கள் அல்லது மாற்றங்களுடன் (அளவு, சுழற்சி, நிலை போன்றவை) அதை வரைய ஒரு கண்ணி பல மெசின்ச்டன்ச் 3DS இல் மீண்டும் பயன்படுத்தலாம்.

source: If you are going to draw the same object many times, it can be helpful to use a MultiMesh with a MultiMeshInstance3D. MultiMeshInstance3Ds draw meshes thousands of times very cheaply by taking advantage of hardware instancing. The drawback with using a MultiMeshInstance3D is that each of your mesh's surfaces are limited to one material for all instances. It uses an instance array to store different colors and transformations for each instance, but all the instances of each surface use the same material.
ga: Má tá tú chun an réad céanna a tharraingt go minic, is féidir leis a bheith cabhrach MultiMesh a úsáid le MultiMeshInstance3D. MultiMeshInstance3Ds tharraingt meshes na mílte uair an-saor trí leas a bhaint as instancing crua-earraí. Is é an míbhuntáiste a bhaineann le MultiMeshInstance3D a úsáid ná go bhfuil gach ceann de dhromchlaí do mhogalra teoranta d'ábhar amháin do gach cás. Úsáideann sé eagar ásc chun dathanna agus claochluithe éagsúla a stóráil do gach cás, ach úsáideann gach cás de gach dromchla an t-ábhar céanna.
ko: 동일한 오브젝트를 여러 번 그리려는 경우, MultiMeshInstance3D와 MultiMesh를 사용하면 좋을 것입니다. MultiMeshInstance3D 는 하드웨어 인스턴싱의 장점을 가져가며 매우 저렴하게 수천 번의 메시를 그려냅니다. MultiMeshInstance3D의 단점은 모든 인스턴트에 대해 각 메시의 표면이 하나의 머티리얼로 제한된다는 것입니다. 인스턴스 배열을 사용하여 각 인스턴스에 대해 다양한 색상과 변형을 저장하지만, 모든 인스턴스의 표면은 같은 머티리얼을 사용합니다.
pt_br: Se você pretende desenhar o mesmo objeto várias vezes, pode ser útil usar um MultiMesh com um MultiMeshInstance3D. MultiMeshInstance3Ds desenham meshes milhares de vezes de forma muito eficiente aproveitando o instanciamento via hardware. A desvantagem de usar um MultiMeshInstance3D é que cada superfície da mesh é limitada a um único material para todas as instâncias. Ele utiliza um array de instâncias para armazenar cores e transformações diferentes para cada instância, mas todas as instâncias de cada superfície usam o mesmo material.
ta: நீங்கள் ஒரே பொருளை பல முறை வரையப் போகிறீர்கள் என்றால், மல்டிமெசின்ச்டன்ச் 3 டி கொண்ட மல்டிமேசைப் பயன்படுத்துவது உதவியாக இருக்கும். மல்டிமெசின்ச்டன்ச் 3 டிச் வன்பொருள் நிறுவனங்களைப் பயன்படுத்துவதன் மூலம் ஆயிரக்கணக்கான முறை மிகவும் மலிவானது. மல்டிமெசின்ச்டன்ச் 3 டி பயன்படுத்துவதன் குறைபாடு என்னவென்றால், உங்கள் ஒவ்வொரு மெசின் மேற்பரப்புகளும் எல்லா நிகழ்வுகளுக்கும் ஒரு பொருளுக்கு மட்டுப்படுத்தப்பட்டவை. ஒவ்வொரு நிகழ்விற்கும் வெவ்வேறு வண்ணங்களையும் மாற்றங்களையும் சேமிக்க இது ஒரு நிகழ்வு வரிசையைப் பயன்படுத்துகிறது, ஆனால் ஒவ்வொரு மேற்பரப்பின் அனைத்து நிகழ்வுகளும் ஒரே பொருளைப் பயன்படுத்துகின்றன.

source: What a Mesh is
ga: Cad is Mogalra ann
it: Cosa è una Mesh
ko: 메시란
pt_br: O que é uma malha
ta: என்ன ஒரு கண்ணி

source: A Mesh is composed of one or more surfaces. A surface is an array composed of multiple sub-arrays containing vertices, normals, UVs, etc. Normally the process of constructing surfaces and meshes is hidden from the user in the :ref:`RenderingServer <class_RenderingServer>`, but with ArrayMeshes, the user can construct a Mesh manually by passing in an array containing the surface information.
ga: Tá mogalra comhdhéanta de dhromchla amháin nó níos mó. Is éard is dromchla ann ná eagar comhdhéanta d'ilfho-eagair ina bhfuil rinn, normanna, UVanna, srl. is féidir leis an úsáideoir Mogall a thógáil de láimh ach é a chur in eagar ina bhfuil an fhaisnéis dromchla.
it: Una Mesh è composta da una o più superfici. Una superficie è un array composto da più sotto-array contenenti vertici, normali, UV, ecc. Normalmente, il processo di costruzione di superfici e mesh è nascosto all'utente nel :ref:`RenderingServer <class_RenderingServer>`, ma con ArrayMesh, l'utente può costruire una mesh manualmente passando un array contenente le informazioni riguardo le superfici.
ko: 메시는 하나 이상의 표면으로 구성됩니다. 표면은 꼭짓점, 노멀, UV 등의 정보를 포함하는 여러 개의 부분 배열로 이루어진 배열입니다. 일반적으로 표면과 메시를 구성하는 과정은 :ref:`RenderingServer <class_RenderingServer>`\ 에서 사용자로부터 숨겨지나, ArrayMesh를 사용하면 표면 정보를 포함하는 배열을 전달함으로써 유저가 메시를 직접 구성할 수 있습니다.
pt_br: Uma Mesh é composta por uma ou mais superfícies. Uma superfície é um array composto por múltiplos sub-arrays contendo vértices, normais, UVs, etc. Normalmente, o processo de construção de superfícies e meshes é oculto do usuário no :ref:`RenderingServer <class_RenderingServer>`, mas com ArrayMeshes, o usuário pode construir uma Mesh manualmente passando um array contendo as informações da superfície.
ta: ஒரு கண்ணி ஒன்று அல்லது அதற்கு மேற்பட்ட மேற்பரப்புகளால் ஆனது. ஒரு மேற்பரப்பு என்பது செங்குத்துகள், இயல்பான, புற ஊதா போன்றவற்றைக் கொண்ட பல துணை வரிசைகளால் ஆன ஒரு வரிசை ஆகும். பொதுவாக மேற்பரப்புகள் மற்றும் மெச்களை உருவாக்கும் செயல்முறை பயனரிடமிருந்து மறைக்கப்படுகிறது: ref: `ரெண்டரிங்சர்வர் <class_renderingserver>`, ஆனால் வரிசை, மேற்பரப்பு தகவல்களைக் கொண்ட ஒரு வரிசையில் கடந்து செல்வதன் மூலம் பயனர் கைமுறையாக ஒரு கண்ணி உருவாக்க முடியும்.

source: Surfaces
ga: Dromchlaí
it: Superfici
ko: 표면
pt_br: Superfícies
ta: மேற்பரப்புகள்

source: Each surface has its own material. Alternatively, you can override the material for all surfaces in the Mesh when you use a MeshInstance3D using the :ref:`material_override <class_GeometryInstance3D_property_material_override>` property.
ga: Tá a ábhar féin ag gach dromchla. Mar mhalairt air sin, is féidir leat an t-ábhar do gach dromchla sa Mogall a shárú nuair a úsáideann tú MeshInstance3D ag baint úsáide as an airí :ref:`material_override <class_GeometryInstance3D_property_material_override>`.
it: Ogni superficie ha il suo materiale. In alternativa, è possibile sostituire il materiale per tutte le superfici nella Mesh quando si utilizza una MeshInstance3D attraverso la proprietà :ref:`material_override <class_GeometryInstance3D_property_material_override>`.
ko: 각 표면은 자신만의 머티리얼을 가집니다. 혹은, MeshInstance3D를 사용할 때 속성 :ref:`material_override <class_GeometryInstance3D_property_material_override>`\ 로 메시 모든 표면의 머티리얼을 오버라이드할 수 있습니다.
pt_br: Cada superfície possui seu próprio material. Alternativamente, você pode substituir o material de todas as superfícies da Mesh ao usar um MeshInstance3D, utilizando a propriedade :ref:`material_override <class_GeometryInstance3D_property_material_override>`.
ta: ஒவ்வொரு மேற்பரப்பிலும் அதன் சொந்த பொருள் உள்ளது. மாற்றாக.

source: Surface array
ga: Eagar dromchla
it: Array di superfici
ko: 표면 배열
pt_br: Matriz de superfície
ta: மேற்பரப்பு வரிசை

source: The surface array is an array of length ``ArrayMesh.ARRAY_MAX``. Each position in the array is filled with a sub-array containing per-vertex information. For example, the array located at ``ArrayMesh.ARRAY_NORMAL`` is a :ref:`PackedVector3Array <class_PackedVector3Array>` of vertex normals. See :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>` for more information.
ga: Is é atá san eagar dromchla ná eagar faid ``ArrayMesh.ARRAY_MAX``. Líontar gach suíomh san eagar le fo-eagar ina bhfuil faisnéis in aghaidh na rinn. Mar shampla, is é an t-eagar atá suite ag ``ArrayMesh.ARRAY_NORMAL`` ná :ref:`PackedVector3Array <class_PackedVector3Array>` de ghnásaigh rinn. Féach :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>` le haghaidh tuilleadh eolais.
it: L'array di superfici è un array di lunghezza ``ArrayMesh.ARRAY_MAX``. Ogni posizione nell'array è riempita con un sotto-array contenente informazioni per ogni vertice. Ad esempio, l'array situato in ``ArrayMesh.ARRAY_NORMAL`` è un :ref:`PackedVector3Array <class_PackedVector3Array>` di normali di vertici. Vedere :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>` per ulteriori informazioni.
ko: 표면 배열은 ``ArrayMesh.ARRAY_MAX``\ 만큼의 길이를 가지는 배열입니다. 배열의 각 위치는 매 버텍스의 정보를 포함하는 배열로 이루어져 있습니다. 예를 들어, ``ArrayMesh.ARRAY_NORMAL``\ 에 위치한 배열은 버텍스 노멀의 :ref:`PackedVector3Array <class_PackedVector3Array>`\ 입니다. 자세한 정보는 :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`\ 을 참조하세요.
pt_br: O array de superfícies é um array com comprimento ``ArrayMesh.ARRAY_MAX``. Cada posição do array é preenchida com um sub-array contendo informações por vértice. Por exemplo, o array localizado em ``ArrayMesh.ARRAY_NORMAL`` é um :ref:`PackedVector3Array <class_PackedVector3Array>` de normais dos vértices. Veja :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>` para mais informações.
ta: மேற்பரப்பு வரிசை என்பது நீளத்தின் வரிசை `` arraymesh.array_max``. வரிசையில் உள்ள ஒவ்வொரு நிலையும் ஒரு பெர்டெக்ச் தகவல்களைக் கொண்ட துணை வரிசையால் நிரப்பப்படுகிறது. எடுத்துக்காட்டாக, `` arraymesh.array_normal`` இல் அமைந்துள்ள வரிசை ஒரு: குறிப்பு: `பேக் டெக்டர் 3ஆர் <class_packedvector3array>` வெர்டெக்ச் இயல்பான. காண்க: குறிப்பு: `mesh.arraytype <enum_mesh_arraytype>` மேலும் தகவலுக்கு.

source: The surface array can be indexed or non-indexed. Creating a non-indexed array is as easy as not assigning an array at the index ``ArrayMesh.ARRAY_INDEX``. A non-indexed array stores unique vertex information for every triangle, meaning that when two triangles share a vertex, the vertex is duplicated in the array. An indexed surface array only stores vertex information for each unique vertex and then also stores an array of indices which maps out how to construct the triangles from the vertex array. In general, using an indexed array is faster, but it means you have to share vertex data between triangles, which is not always desired (e.g. when you want per-face normals).
ga: Is féidir an t-eagar dromchla a innéacsú nó neamh-innéacsaithe. Tá sé chomh héasca eagar neamhinnéacsaithe a chruthú agus gan eagar a shannadh ag an innéacs ''ArrayMesh.ARRAY_INDEX''. Stórálann eagar neamh-innéacsaithe faisnéis vertex uathúil do gach triantán, rud a chiallaíonn go ndéantar an stuaic a dhúbailt san eagar nuair a roinneann dhá thriantán stuaic. Ní stórálann eagar dromchla innéacsaithe ach faisnéis vertex do gach stuaic uathúil agus ansin stórálann sé sraith innéacsanna a mhapálann amach conas na triantáin a thógáil ón eagar stuaic. Go ginearálta, tá úsáid a bhaint as eagar innéacsaithe níos tapúla, ach ciallaíonn sé go gcaithfidh tú sonraí vertex a roinnt idir triantáin, nach bhfuil ag teastáil i gcónaí (m.sh. nuair is mian leat gnáthaimh in aghaidh an duine).
it: L'array di superfici può essere indicizzato o non indicizzato. Creare un array non indicizzato è tanto semplice quanto non assegnare un array all'indice ``ArrayMesh.ARRAY_INDEX``. Un array non indicizzato memorizza informazioni univoche sui vertici per ogni triangolo, il che significa che quando due triangoli condividono un vertice, il vertice è duplicato nell'array. Un array di superfici indicizzato memorizza solo le informazioni sui vertici per ogni vertice univoco e poi memorizza anche un array di indici che mappa come costruire i triangoli dall'array di vertici. In generale, usare un array indicizzato è più veloce, ma significa che è necessario condividere i dati sui vertici tra i triangoli, il che non è sempre gradito (ad esempio, quando c'è bisogno di normali per ogni faccia).
pt_br: O array de superfície pode ser indexado ou não indexado. Criar um array não indexado é tão simples quanto não atribuir um array no índice ``ArrayMesh.ARRAY_INDEX``. Um array não indexado armazena informações únicas de vértice para cada triângulo, o que significa que, quando dois triângulos compartilham um vértice, o vértice é duplicado no array. Um array de superfície indexado armazena informações de vértices apenas para cada vértice único e também armazena um array de índices que define como construir os triângulos a partir do array de vértices. Em geral, usar um array indexado é mais rápido, mas isso implica compartilhar dados de vértices entre triângulos, o que nem sempre é desejado (por exemplo, quando se deseja normais por face).
ta: மேற்பரப்பு வரிசை குறியீட்டு அல்லது குறியிடப்படாதது. குறியீட்டு அல்லாத வரிசையை உருவாக்குவது `` arraymesh.array_index`` குறியீட்டில் ஒரு வரிசையை ஒதுக்காதது போல எளிதானது. ஒரு குறியிடப்பட்ட வரிசை ஒவ்வொரு முக்கோணத்திற்கும் தனித்துவமான வெர்டெக்ச் தகவல்களை சேமிக்கிறது, அதாவது இரண்டு முக்கோணங்கள் ஒரு வெர்டெக்சைப் பகிர்ந்து கொள்ளும்போது, வெர்டெக்ச் வரிசையில் நகல் செய்யப்படுகிறது. ஒரு குறியிடப்பட்ட மேற்பரப்பு வரிசை ஒவ்வொரு தனித்துவமான வெர்டெக்சிற்கும் வெர்டெக்ச் தகவல்களை மட்டுமே சேமிக்கிறது, பின்னர் வெர்டெக்ச் வரிசையில் இருந்து முக்கோணங்களை எவ்வாறு உருவாக்குவது என்பதை வரைபடமாக்கும் குறியீடுகளின் வரிசையையும் சேமிக்கிறது. பொதுவாக, ஒரு குறியீட்டு வரிசையைப் பயன்படுத்துவது வேகமானது, ஆனால் இதன் பொருள் நீங்கள் முக்கோணங்களுக்கிடையில் வெர்டெக்ச் தரவைப் பகிர வேண்டும், இது எப்போதும் விரும்பாதது (எ.கா. நீங்கள் ஒரு முகம் இயல்பானவற்றை விரும்பும்போது).

source: Tools
ga: Uirlisí
it: Strumenti
ko: 툴
pt_br: Ferramentas
ta: கருவிகள்

source: Godot provides different ways of accessing and working with geometry. More information on each will be provided in the following tutorials.
ga: Soláthraíonn Godot bealaí éagsúla chun rochtain a fháil agus oibriú le geoiméadracht. Cuirfear tuilleadh eolais faoi gach ceann ar fáil sna ranganna teagaisc seo a leanas.
it: Godot offre diversi modi per accedere e lavorare con la geometria. I prossimi tutorial forniranno maggiori informazioni su ciascuno di essi.
pt_br: O Godot oferece diferentes formas de acessar e trabalhar com geometria. Mais informações sobre cada uma delas serão fornecidas nos tutoriais a seguir.
ta: கோடோட் வடிவவியலுடன் அணுகுவதற்கும் வேலை செய்வதற்கும் வெவ்வேறு வழிகளை வழங்குகிறது. ஒவ்வொன்றும் பற்றிய கூடுதல் தகவல்கள் பின்வரும் பயிற்சிகளில் வழங்கப்படும்.

source: The ArrayMesh resource extends Mesh to add a few different quality of life functions and, most importantly, the ability to construct a Mesh surface through scripting.
ga: Leathnaíonn an acmhainn ArrayMesh Mogalra chun roinnt feidhmeanna cáilíochta saoil éagsúla a chur leis agus, níos tábhachtaí fós, an cumas dromchla mogalra a thógáil trí scriptiú.
it: La risorsa ArrayMesh estende Mesh per aggiungere qualche funzione ausiliare e, cosa più importante, l'abilità di costruire una superficie Mesh tramite script.
pt_br: O recurso ArrayMesh estende Mesh para adicionar algumas funções que facilitam o uso e, mais importante, a capacidade de construir uma superfície de Mesh via script.
ta: வாழ்க்கை செயல்பாடுகளின் சில வேறுபட்ட தரங்களைச் சேர்க்க, மிக முக்கியமாக, ச்கிரிப்டிங் மூலம் கண்ணி மேற்பரப்பை உருவாக்கும் திறன் மற்றும், மிக முக்கியமாக வாழ்க்கை செயல்பாடுகளைச் சேர்க்க அரேமேச் வளம் கண்ணி நீட்டிக்கிறது.

source: For more information about the ArrayMesh, please see the :ref:`ArrayMesh tutorial <doc_arraymesh>`.
ga: Le haghaidh tuilleadh faisnéise faoin ArrayMesh, féach le do thoil ar an :ref:`ArrayMesh teagaisc <doc_arraymesh>`.
it: Per ulteriori informazioni sull'ArrayMesh, consulta il tutorial :ref:`ArrayMesh <doc_arraymesh>`.
ko: ArrayMesh에 대한 자세한 정보는 :ref:`ArrayMesh 튜토리얼 <doc_arraymesh>`\ 을 참조해 주세요.
pt_br: Para obter mais informações sobre o ArrayMesh, consulte o :ref:`tutorial do ArrayMesh <doc_arraymesh>`.
ta: அரேமேசைப் பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து பார்க்கவும்: குறிப்பு: `அரேமேச் டுடோரியல் <doc_arraymesh>`.

source: MeshDataTool
ga: MogalraDataTool
