Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/procedural_geometry/index.po
Languages: ga, it, ko, pt_br, ta

source: The MeshDataTool is a resource that converts Mesh data into arrays of vertices, faces, and edges that can be modified at runtime.
ga: Is acmhainn é an MeshDataTool a athraíonn sonraí mogalra i sraitheanna de vertices, aghaidheanna, agus imill is féidir a mhodhnú ag am rite.
it: Il MeshDataTool è una risorsa che converte i dati di Mesh in array di vertici, facce e spigoli che si possono modificare in fase di esecuzione.
pt_br: O MeshDataTool é um recurso que converte dados de uma Mesh em arrays de vértices, faces e arestas que podem ser modificados em tempo de execução.
ta: மெச்தடடூல் என்பது மெச் தரவை இயக்க நேரத்தில் மாற்றியமைக்கக்கூடிய செங்குத்துகள், முகங்கள் மற்றும் விளிம்புகளின் வரிசைகளாக மாற்றும் ஒரு ஆதாரமாகும்.

source: For more information about the MeshDataTool, please see the :ref:`MeshDataTool tutorial <doc_meshdatatool>`.
ga: Le haghaidh tuilleadh faisnéise faoin MeshDataTool, féach le do thoil ar an :ref:`MeshDataTool teagaisc <doc_meshdatatool>`.
it: Per maggiori informazioni su MeshDataTool, consulta il tutorial :ref:`MeshDataTool <doc_meshdatatool>`.
ko: MeshDataTool에 대한 자세한 정보는 :ref:`MeshDataTool 튜토리얼 <doc_meshdatatool>`\ 을 참조해 주세요.
pt_br: Para mais informações sobre o MeshDataTool, consulte o :ref:`tutorial MeshDataTool <doc_meshdatatool>`.
ta: Meshdatatool பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து இதைக் காண்க: குறிப்பு: `Meshdatatool பயிற்சி <doc_meshdatatool>`.

source: SurfaceTool
ga: SurfaceToolName
pt_br: Ferramenta de Superfície
ta: சர்ஃபாசெட்டூல்

source: The SurfaceTool allows the creation of Meshes using an OpenGL 1.x immediate mode style interface.
ga: Ceadaíonn an SurfaceTool mogall a chruthú ag baint úsáide as comhéadan stíl mód láithreach OpenGL 1.x.
it: La classe SurfaceTool consente la creazione di Mesh attraverso un'interfaccia in stile "immediate mode" di OpenGL 1.x.
pt_br: O SurfaceTool permite a criação de Meshes usando uma interface no estilo do modo imediato do OpenGL 1.x.
ta: ஓபன்சிஎல் 1.x உடனடி பயன்முறை பாணி இடைமுகத்தைப் பயன்படுத்தி மெச்களை உருவாக்க சர்ஃபாசெட்டூல் அனுமதிக்கிறது.

source: For more information about the SurfaceTool, please see the :ref:`SurfaceTool tutorial <doc_surfacetool>`.
ga: Le haghaidh tuilleadh faisnéise faoin SurfaceTool, féach le do thoil ar an :ref:`SurfaceTool teagaisc <doc_surfacetool>`.
it: Per maggiori informazioni su SurfaceTool, consulta il :ref:`tutorial SurfaceTool <doc_surfacetool>`.
ko: SurfaceTool에 대한 자세한 정보는 :ref:`SurfaceTool 튜토리얼 <doc_surfacetool>`\ 을 참조해 주세요.
pt_br: Para obter mais informações sobre a SurfaceTool, consulte o :ref:`tutorial da SurfaceTool <doc_surfacetool>`.
ta: சர்ஃபாசெட்டூல் பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து பார்க்கவும்: குறிப்பு: `சர்ஃபாசெட்டூல் டுடோரியல் <doc_surfacetool>`.

source: ImmediateMesh
ga: LáithreachMesh
ta: உடனடிமேச்

source: ImmediateMesh is a mesh that uses an immediate mode style interface (like SurfaceTool) to draw objects. The difference between ImmediateMesh and the SurfaceTool is that ImmediateMesh is drawn directly with code dynamically, while the SurfaceTool is used to generate a Mesh that you can do whatever you want with.
ga: Is mogalra é ImmediateMesh a úsáideann comhéadan stíl mód láithreach (cosúil le SurfaceTool) chun rudaí a tharraingt. Is é an difríocht idir ImmediateMesh agus an SurfaceTool ná go dtarraingítear ImmediateMesh go díreach le cód go dinimiciúil, agus úsáidtear an SurfaceTool chun mogalra a ghiniúint ar féidir leat cibé rud is mian leat a dhéanamh leis.
it: L'ImmediateMesh è una mesh che utilizza un'interfaccia in stile "immediate mode" (simile a SurfaceTool) per disegnare oggetti. La differenza tra ImmediateMesh e SurfaceTool è che ImmediateMesh è disegnata direttamente con codice dinamicamente, mentre SurfaceTool è utilizzato per generare una mesh con cui è possibile fare ciò che si desidera.
pt_br: ImmediateMesh é uma mesh que usa uma interface no estilo do modo imediato (como o SurfaceTool) para desenhar objetos. A diferença entre o ImmediateMesh e o SurfaceTool é que o ImmediateMesh é desenhado diretamente por meio de código de forma dinâmica, enquanto o SurfaceTool é usado para gerar uma Mesh com a qual você pode fazer o que quiser.
ta: உடனடி, பொருள்களை வரைய உடனடி பயன்முறை பாணி இடைமுகத்தை (சர்ஃபாசெட்டூல் போன்றவை) பயன்படுத்தும் ஒரு கண்ணி. உடனடிமேசுக்கும் சர்ஃபாசெட்டூலுக்கும் இடையிலான வேறுபாடு என்னவென்றால், உடனடிமேச் நேரடியாக குறியீட்டைக் கொண்டு நேரடியாக வரையப்படுகிறது, அதே நேரத்தில் நீங்கள் விரும்பியதைச் செய்யக்கூடிய ஒரு கண்ணி உருவாக்க சர்ஃபாசெட்டூல் பயன்படுத்தப்படுகிறது.

source: ImmediateMesh is useful for prototyping because of its straightforward API, but it is slow because the geometry is rebuilt each time you make a change. It is most useful for adding simple geometry for visual debugging (e.g. by drawing lines to visualize physics raycasts etc.).
ga: Tá ImmediateMesh úsáideach le haghaidh prototyping mar gheall ar a API simplí, ach tá sé mall toisc go ndéantar an chéimseata a atógáil gach uair a dhéanann tú athrú. Tá sé an-úsáideach chun geoiméadracht shimplí a chur leis le haghaidh dífhabhtaithe amhairc (m.sh. trí línte a tharraingt chun raycasts fisice etc.) a shamhlú.
it: ImmediateMesh è utile per la prototipazione grazie alla sua API intuitiva, ma è lento perché la geometria è ricostruita ogni volta che si apporta una modifica. È particolarmente utile per aggiungere geometrie semplici per il debug visivo (ad esempio, disegnando linee per visualizzare raycast fisici, ecc.).
pt_br: ImmediateMesh é útil para prototipagem devido à sua API simples, mas é lento porque a geometria é reconstruída toda vez que uma alteração é feita. Ele é mais útil para adicionar geometria simples para depuração visual (por exemplo, desenhar linhas para visualizar raycasts de física etc.).
ta: அதன் நேரடியான பநிஇ காரணமாக முன்மாதிரிக்கு உடனடி, ஆனால் அது மெதுவாக உள்ளது, ஏனெனில் ஒவ்வொரு முறையும் நீங்கள் மாற்றத்தை ஏற்படுத்தும் போது வடிவியல் மீண்டும் கட்டப்படுகிறது. காட்சி பிழைத்திருத்தத்திற்கான எளிய வடிவவியலைச் சேர்ப்பதற்கு இது மிகவும் பயனுள்ளதாக இருக்கும் (எ.கா. இயற்பியல் ரெய்காச்ட்களைக் காட்சிப்படுத்த கோடுகளை வரைவதன் மூலம்).

source: For more information about ImmediateMesh, please see the :ref:`ImmediateMesh tutorial <doc_immediatemesh>`.
ga: Le haghaidh tuilleadh faisnéise faoi ImmediateMesh, féach le do thoil ar an :ref:`ImmediateMesh teagaisc <doc_immediatemesh>`.
it: Per ulteriori informazioni su ImmediateMesh, consultare il :ref:`Tutorial ImmediateMesh <doc_immediatemesh>`.
ko: ImmediateMesh에 대한 자세한 정보는 :ref:`ImmediateMesh 튜토리얼 <doc_immediatemesh>`\ 을 참조해 주세요.
ta: உடனடிமேசைப் பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து இதைக் காண்க: ref: `உடனடிமேச் டுடோரியல் <doc_immediatemesh>`.

source: Which one should I use?
ga: Cén ceann ba cheart dom a úsáid?
it: Quale dovrei usare?
pt_br: Qual devo usar?
ta: நான் எதைப் பயன்படுத்த வேண்டும்?

source: Which approach you use depends on what you are trying to do and what kind of procedure you are comfortable with.
ga: Braitheann an cur chuige a úsáideann tú ar an méid atá tú ag iarraidh a dhéanamh agus cén cineál nós imeachta a bhfuil tú compordach leis.
it: L'approccio da adottare dipende da cosa si vuole fare e dal tipo di procedura con cui ci si sente a proprio agio.
pt_br: A abordagem que você usa depende do que você está tentando fazer e com que tipo de procedimento você se sente confortável.
ta: நீங்கள் பயன்படுத்தும் அணுகுமுறை நீங்கள் என்ன செய்ய முயற்சிக்கிறீர்கள், எந்த வகையான நடைமுறைக்கு வசதியாக இருக்கிறீர்கள் என்பதைப் பொறுத்தது.

source: Both SurfaceTool and ArrayMesh are excellent for generating static geometry (meshes) that don't change over time.
ga: Tá SurfaceTool agus ArrayMesh araon den scoth chun geoiméadracht statach (mogalraí) a ghiniúint nach n-athraíonn le himeacht ama.
it: Entrambi SurfaceTool e ArrayMesh sono eccellenti per generare geometrie statiche (mesh) che non cambiano nel tempo.
pt_br: Tanto o SurfaceTool quanto o ArrayMesh são excelentes para gerar geometria estática (meshes) que não mudam com o tempo.
ta: காலப்போக்கில் மாறாத நிலையான வடிவவியலை (மெச்கள்) உருவாக்குவதற்கு சர்ஃபாசெட்டூல் மற்றும் அரேமெச் இரண்டும் சிறந்தவை.

source: Using an ArrayMesh is slightly faster than using a SurfaceTool, but the API is a little more challenging. Additionally, SurfaceTool has a few quality of life methods such as ``generate_normals()`` and ``index()``.
ga: Tá úsáid a bhaint as ArrayMesh beagán níos tapúla ná SurfaceTool a úsáid, ach tá an API beagán níos dúshlánaí. Ina theannta sin, tá roinnt modhanna cáilíochta saoil ag SurfaceTool, mar shampla ''generate_normals()'' agus ''index()''.
it: Usare un ArrayMesh è leggermente più veloce rispetto a un SurfaceTool, ma l'API è un po' più complessa. Inoltre, SurfaceTool offre alcuni comodi metodi ausiliari, come ``generate_normals()`` e ``index()``.
pt_br: Usar um ArrayMesh é ligeiramente mais rápido do que usar um SurfaceTool, mas a API é um pouco mais complexa. Além disso, o SurfaceTool possui alguns métodos que facilitam o uso, como ``generate_normals()`` e ``index()``.
ta: ஒரு வரிசைமேசைப் பயன்படுத்துவது ஒரு சர்ஃபாசெட்டூலைப் பயன்படுத்துவதை விட சற்று வேகமாக உள்ளது, ஆனால் பநிஇ இன்னும் கொஞ்சம் சவாலானது. கூடுதலாக, சர்ஃபாசெட்டூலுக்கு `` `` `` `` `` மற்றும் `` குறியீட்டு () `` போன்ற சில வாழ்க்கைத் தரங்கள் உள்ளன.

source: ImmediateMesh is more limited than both ArrayMesh and SurfaceTool. However, if you need the geometry to change every frame anyway, it provides a much easier interface that can be slightly faster than generating an ArrayMesh every frame.
ga: Tá ImmediateMesh níos teoranta ná ArrayMesh agus SurfaceTool araon. Mar sin féin, más gá duit an geoiméadracht a athrú gach fráma ar aon nós, soláthraíonn sé comhéadan i bhfad níos éasca is féidir a bheith beagán níos tapúla ná a ghiniúint ArrayMesh gach fráma.
pt_br: ImmediateMesh é mais limitado do que ArrayMesh e SurfaceTool. No entanto, se você precisa que a geometria mude a cada frame, ele oferece uma interface muito mais simples que pode ser ligeiramente mais rápida do que gerar um ArrayMesh a cada frame.
ta: அரேர்மேச் மற்றும் சர்ஃபாசெட்டூல் இரண்டையும் விட உடனடிேச் மிகவும் மட்டுப்படுத்தப்பட்டுள்ளது. இருப்பினும், ஒவ்வொரு சட்டத்தையும் எப்படியாவது மாற்ற உங்களுக்கு வடிவியல் தேவைப்பட்டால், ஒவ்வொரு சட்டகத்தையும் ஒரு அரேமேசை உருவாக்குவதை விட சற்று வேகமாக இருக்கும் மிகவும் எளிதான இடைமுகத்தை இது வழங்குகிறது.

source: The MeshDataTool is not fast, but it gives you access to all kinds of properties of the mesh that you don't get with the others (edges, faces, etc.). It is incredibly useful when you need that sort of data to transform the mesh, but it is not a good idea to use it if that extra information is not needed. The MeshDataTool is best used if you are going to be using an algorithm that requires access to the face or edge array.
ga: Níl an MeshDataTool tapa, ach tugann sé rochtain duit ar gach cineál airíonna den mogalra nach bhfaigheann tú leis na cinn eile (imill, aghaidheanna, etc.). Tá sé thar a bheith úsáideach nuair is gá duit an cineál sin sonraí a athrú ar an mogalra, ach nach bhfuil sé smaoineamh maith é a úsáid más rud é nach bhfuil an t-eolas breise ag teastáil. Is fearr an MeshDataTool a úsáid má tá tú ag dul a bheith ag baint úsáide as algartam a éilíonn rochtain ar an duine nó ar an eagar imeall.
pt_br: O MeshDataTool não é rápido, mas oferece acesso a todos os tipos de propriedades da mesh que você não obtém com as outras abordagens (arestas, faces, etc.). Ele é extremamente útil quando você precisa desse tipo de dado para transformar a mesh, mas não é uma boa ideia usá-lo se essas informações extras não forem necessárias. O MeshDataTool é mais indicado quando você pretende usar um algoritmo que exige acesso ao array de faces ou arestas.
ta: மெச்தடடூல் வேகமாக இல்லை, ஆனால் இது மற்றவர்களுடன் (விளிம்புகள், முகங்கள் போன்றவை) பெறாத கண்ணி அனைத்து வகையான பண்புகளையும் அணுகும். கண்ணி மாற்ற உங்களுக்கு அந்த வகையான தரவு தேவைப்படும்போது இது நம்பமுடியாத அளவிற்கு பயனுள்ளதாக இருக்கும், ஆனால் அந்த கூடுதல் செய்தி தேவையில்லை என்றால் அதைப் பயன்படுத்துவது நல்ல யோசனையல்ல. முகம் அல்லது விளிம்பு வரிசைக்கு அணுகல் தேவைப்படும் ஒரு வழிமுறையை நீங்கள் பயன்படுத்தப் போகிறீர்கள் என்றால் மெச்தடூல் சிறந்த முறையில் பயன்படுத்தப்படுகிறது.

source: ArrayMesh
ta: வரிசைமேச்
