Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/procedural_geometry/surfacetool.po
Languages: ja, pt_br, ta, zh_hant

source: Using the SurfaceTool
ja: SurfaceToolの使用
pt_br: Usando o SurfaceTool
ta: சர்ஃபாசெட்டூலைப் பயன்படுத்துதல்
zh_hant: 使用 SurfaceTool

source: The :ref:`SurfaceTool <class_surfacetool>` provides a useful interface for constructing geometry. The interface is similar to the :ref:`ImmediateMesh <class_ImmediateMesh>` class. You set each per-vertex attribute (e.g. normal, uv, color) and then when you add a vertex it captures the attributes.
ja: :ref:`SurfaceTool <doc_surfacetool>` は、ジオメトリを構築するための便利なインターフェイスを提供します。このインターフェースは :ref:`ImmediateMesh <class_ImmediateMesh>` ノードに似ています。頂点ごとの各属性(例: normal、uv、color)を設定し、頂点を追加すると属性がキャプチャされます。
pt_br: O :ref:`SurfaceTool <class_surfacetool>` oferece uma interface útil para construção de geometria. A interface é semelhante à da classe :ref:`ImmediateMesh <class_ImmediateMesh>`. Você define cada atributo por vértice (por exemplo, normal, uv, cor) e, ao adicionar um vértice, ele captura esses atributos.
ta: தி: ரெஃப்: `சர்ஃபாசெட்டூல் <class_surfacetool>` வடிவவியலை உருவாக்குவதற்கு ஒரு பயனுள்ள இடைமுகத்தை வழங்குகிறது. இடைமுகம்: ref: `உடனடிமேச் <class_immediatemesh>` வகுப்பு. நீங்கள் ஒவ்வொரு பெர்டெக்ச் பண்புகளையும் (எ.கா. இயல்பான, புற ஊதா, வண்ணம்) அமைத்துள்ளீர்கள், பின்னர் நீங்கள் ஒரு வெர்டெக்சைச் சேர்க்கும்போது அது பண்புகளை பிடிக்கும்.
zh_hant: :ref:`SurfaceTool <class_surfacetool>` 提供一個有用的介面用於建構幾何體。該介面與 :ref:`ImmediateMesh <class_ImmediateMesh>` 類別相似。您設定每個逐頂點屬性 (例如法線、UV、顏色)，然後當您新增一個頂點時，它會捕捉屬性。

source: The SurfaceTool also provides some useful helper functions like ``index()`` and ``generate_normals()``.
ja: SurfaceToolは、\ ``index()`` や ``generate_normals()`` などの便利なヘルパー関数も提供します。
pt_br: O SurfaceTool também oferece algumas funções auxiliares úteis, como ``index()`` e ``generate_normals()``.
ta: சர்ஃபாசெட்டூல் `` குறியீட்டு () `` மற்றும் `` `` `` `` `` `` `` `போன்ற சில பயனுள்ள உதவி செயல்பாடுகளையும் வழங்குகிறது.
zh_hant: SurfaceTool 還提供了一些有用的輔助函式，如 ``index()`` 和 ``generate_normals()``。

source: Attributes are added before each vertex is added:
ja: 各頂点が追加される前に次の属性が追加されます:
pt_br: Os atributos são adicionados antes de cada vértice ser inserido:
ta: ஒவ்வொரு வெர்டெக்சும் சேர்க்கப்படுவதற்கு முன்பு பண்புக்கூறுகள் சேர்க்கப்படுகின்றன:
zh_hant: 屬性是在新增每個頂點之前新增的：

source: When finished generating your geometry with the :ref:`SurfaceTool <class_surfacetool>` call ``commit()`` to finish generating the mesh. If an :ref:`ArrayMesh <class_ArrayMesh>` is passed to ``commit()`` then it appends a new surface to the end of the ArrayMesh. While if nothing is passed in, ``commit()`` returns an ArrayMesh.
ja: :ref:`SurfaceTool <class_surfacetool>` を使用してジオメトリの生成が終了したら、\ ``commit()`` を呼び出してメッシュの生成を終了します。\ :ref:`ArrayMesh <class_ArrayMesh>` が ``commit()`` に渡されると、ArrayMeshの最後に新しいサーフェスが追加されます。一方、何も渡されない場合、\ ``commit()`` はArrayMeshを返します。
pt_br: Ao terminar de gerar sua geometria com o :ref:`SurfaceTool <class_surfacetool>`, chame ``commit()`` para finalizar a geração da malha. Se um :ref:`ArrayMesh <class_ArrayMesh>` for passado para ``commit()``, então uma nova superfície será adicionada ao final do ArrayMesh. Caso nada seja passado, ``commit()`` retorna um ArrayMesh.
ta: உங்கள் வடிவவியலை உருவாக்கி முடிந்ததும்: ref: `surfacetool <class_surfacetool>` கண்ணி உருவாக்குவதை முடிக்க `` கமிட் () `ஐ அழைக்கவும். An: ref: `arraymesh <class_arraymesh>` `` கமிட் () `` க்கு அனுப்பப்பட்டால், அது ஒரு புதிய மேற்பரப்பை வரிசைமேசின் முடிவில் சேர்க்கிறது. எதுவும் அனுப்பப்படாவிட்டால், `` கமிட் () `` ஒரு வரிசைமேசை வழங்குகிறது.

source: Code creates a triangle with indices
ja: コードはインデックス付きの三角形を作成します
pt_br: O código cria um triângulo com índices
ta: குறியீடு குறியீடுகளுடன் ஒரு முக்கோணத்தை உருவாக்குகிறது

source: You can optionally add an index array, either by calling ``add_index()`` and adding vertices to the index array or by calling ``index()`` which shrinks the vertex array to remove duplicate vertices.
ja: オプションで ``add_index()`` を呼び出して頂点をインデックス配列に追加するか、頂点配列を縮小して重複する頂点を削除する ``index()`` を呼び出すことで、インデックス配列を追加できます。
pt_br: Você pode, opcionalmente, adicionar um array de índices, seja chamando ``add_index()`` e adicionando vértices ao array de índices, ou chamando ``index()``, que reduz o array de vértices para remover vértices duplicados.
ta: `` Add_index () `` என்று அழைப்பதன் மூலமும், குறியீட்டு வரிசையில் செங்குத்துகளைச் சேர்ப்பதன் மூலமோ அல்லது `` குறியீட்டு () `` என்று அழைப்பதன் மூலமும் நீங்கள் ஒரு குறியீட்டு வரிசையைச் சேர்க்கலாம், இது நகல் செங்குத்துகளை அகற்ற வெர்டெக்ச் வரிசையை சுருக்கிவிடும்.

source: Similarly, if you have an index array, but you want each vertex to be unique (e.g. because you want to use unique normals or colors per face instead of per-vertex), you can call ``deindex()``.
ja: 同様に、インデックス配列があるが、各頂点を一意にしたい場合(たとえば、頂点ごとではなく面ごとに一意の法線または色を使用するため)、\ ``deindex()`` を呼び出すことができます。
pt_br: Da mesma forma, se você tiver um array de índices, mas quiser que cada vértice seja único (por exemplo, porque deseja usar normais ou cores únicas por face em vez de por vértice), você pode chamar ``deindex()``.
ta: இதேபோல், உங்களிடம் ஒரு குறியீட்டு வரிசை இருந்தால், ஆனால் ஒவ்வொரு வெர்டெக்சும் தனித்துவமாக இருக்க வேண்டும் என்று நீங்கள் விரும்பினால் (எ.கா. நீங்கள் பெர்டெக்சுக்கு பதிலாக ஒரு முகத்திற்கு தனித்துவமான இயல்பான அல்லது வண்ணங்களைப் பயன்படுத்த விரும்புவதால்), நீங்கள் `` டீண்டெக்ச் () `` என்று அழைக்கலாம்.
zh_hant: 同樣, 如果你有一個索引陣列, 但希望每個頂點都是唯一的(例如, 因為想在每個面而不是每個頂點使用唯一的法線或顏色), 可以呼叫 ``deindex()`` .

source: If you don't add custom normals yourself, you can add them using ``generate_normals()``, which should be called after generating geometry and before committing the mesh using ``commit()`` or ``commit_to_arrays()``. Calling ``generate_normals(true)`` will flip the resulting normals. As a side note, ``generate_normals()`` only works if the primitive type is set to ``Mesh.PRIMITIVE_TRIANGLES``.
ja: カスタム法線を自分で追加しない場合は、 ``generate_normals()`` を使用して法線を自動生成できます。これはジオメトリを生成した後、 ``commit()`` または ``commit_to_arrays()`` を使用してメッシュをコミットする前に呼び出す必要があります。 ``generate_normals(true)`` を呼び出すと結果の法線が反転します。補足として ``generate_normals()`` は、プリミティブ タイプが ``Mesh.PRIMITIVE_TRIANGLES`` に設定されている場合にのみ機能します。
pt_br: Se você não adicionar normais personalizadas manualmente, pode adicioná-las usando ``generate_normals()``, que deve ser chamada após gerar a geometria e antes de finalizar a malha com ``commit()`` ou ``commit_to_arrays()``. Chamar ``generate_normals(true)`` irá inverter as normais resultantes. Como observação, ``generate_normals()`` só funciona se o tipo de primitiva estiver definido como ``Mesh.PRIMITIVE_TRIANGLES``.
ta: தனிப்பயன் இயல்புகளை நீங்களே சேர்க்கவில்லை என்றால், அவற்றை `` generate_normals () `` ஐப் பயன்படுத்தி சேர்க்கலாம், இது வடிவவியலை உருவாக்கிய பின் அழைக்கப்பட வேண்டும் மற்றும் `` கமிட் () `அல்லது` `commit_to_arrays ()` `. `` Generate_normals (உண்மை) `` என்று அழைப்பது இதன் விளைவாக வரும் இயல்புகளை புரட்டுகிறது. ஒரு பக்க குறிப்பாக, `` உருவாக்கு_நார்மல்ச் () `` `` பழமையான வகை `` mesh.primitive_triangles`` க்கு அமைக்கப்பட்டால் மட்டுமே செயல்படும்.
zh_hant: 如果你不想自行新增自訂法線，那麼可以使用 ``generate_normals()`` 來新增，呼叫時機應該是在生成幾何體之後、使用 ``commit()`` 或 ``commit_to_arrays()`` 提交網格之前。呼叫 ``generate_normals(true)`` 會將最終的法線翻轉。另外請注意，``generate_normals()`` 只有在像素型別為 ``Mesh.PRIMITIVE_TRIANGLES`` 時有效。

source: You may notice that normal mapping or other material properties look broken on the generated mesh. This is because normal mapping **requires** the mesh to feature *tangents*, which are separate from *normals*. You can either add custom tangents manually, or generate them automatically with ``generate_tangents()``. This method requires that each vertex have UVs and normals set already.
ja: 生成されたメッシュでは、法線マッピングやその他のマテリアル プロパティが壊れているように見えることがあります。これは法線マッピングではメッシュに法線とは別の接線が含まれることが **必要** であるためです。カスタム接線は手動で追加するか、 ``generate_tangents()`` を使用して自動的に生成することができます。この方法では各頂点に UV と法線が既に設定されている必要があります。
pt_br: Você pode perceber que o mapeamento de normais ou outras propriedades do material parecem estar com problemas na malha gerada. Isso acontece porque o mapeamento de normais **requer** que a malha possua *tangentes*, que são diferentes das *normais*. Você pode adicionar tangentes personalizadas manualmente ou gerá-las automaticamente com ``generate_tangents()``. Esse método exige que cada vértice já tenha UVs e normais definidos.
ta: சாதாரண மேப்பிங் அல்லது பிற பொருள் பண்புகள் உருவாக்கப்பட்ட கண்ணி மீது உடைக்கப்பட்டிருப்பதை நீங்கள் கவனிக்கலாம். ஏனென்றால், சாதாரண மேப்பிங் ** க்கு ** கண்ணி தேவைப்படுகிறது*தொடுகோடுகள்*, அவை*இயல்பான*இலிருந்து தனித்தனியாக இருக்கும். நீங்கள் தனிப்பயன் தொடுகோடுகளை கைமுறையாகச் சேர்க்கலாம் அல்லது `` `generate_tangents ()` `உடன் தானாக உருவாக்கலாம். இந்த முறைக்கு ஒவ்வொரு வெர்டெக்சும் ஏற்கனவே UV கள் மற்றும் இயல்புகள் அமைக்கப்பட்டிருக்க வேண்டும்.
zh_hant: 您可能會注意到，在產生的網格上，法線貼圖或其他材質屬性看起來不正確。這是因為法線貼圖 **需要** 網格具備 *切線*，切線與 *法線* 是分開的。您可以選擇手動新增自訂切線，或使用 ``generate_tangents()`` 自動產生它們。這個方法需要每個頂點已經設定 UV 與法線。

source: By default, when generating normals, they will be calculated on a per-face basis. If you want smooth vertex normals, when adding vertices, call ``add_smooth_group()``. ``add_smooth_group()`` needs to be called while building the geometry, e.g. before the call to ``add_vertex()`` (if non-indexed) or ``add_index()`` (if indexed).
ja: デフォルトでは、法線を生成するとき、それらは面ごとに計算されます。滑らかな頂点法線が必要な場合、頂点を追加するときに ``add_smooth_group()`` を呼び出します。ジオメトリの構築中に ``add_smooth_group()`` を呼び出す必要があります。例えば、\ `` add_vertex()`` (インデックス化されていない場合)または ``add_index()`` (インデックス化されている場合)の呼び出しの前にです。
pt_br: Por padrão, ao gerar normais, elas serão calculadas por face. Se você quiser normais suavizadas por vértice, ao adicionar vértices, chame ``add_smooth_group()``. ``add_smooth_group()`` precisa ser chamada durante a construção da geometria, ou seja, antes da chamada de ``add_vertex()`` (se não for indexada) ou ``add_index()`` (se for indexada).
ta: இயல்பாக, இயல்புகளை உருவாக்கும் போது, அவை முகத்திற்கு ஒரு அடிப்படையில் கணக்கிடப்படும். நீங்கள் மென்மையான வெர்டெக்ச் இயல்புகளை விரும்பினால், செங்குத்துகளைச் சேர்க்கும்போது, `` add_smooth_group () `` ஐ அழைக்கவும். `` add_smooth_group () `` வடிவவியலை உருவாக்கும் போது அழைக்கப்பட வேண்டும், எ.கா. `` add_vertex () `` (குறியிடப்பட்டால்) அல்லது `` add_index () `` (குறியிடப்பட்டால்) அழைப்புக்கு முன்.

source: When finished generating your geometry with the :ref:`SurfaceTool <class_surfacetool>`, call ``commit()`` to finish generating the mesh. If an :ref:`ArrayMesh <class_ArrayMesh>` is passed to ``commit()``, then it appends a new surface to the end of the ArrayMesh. While if nothing is passed in, ``commit()`` returns an ArrayMesh.
zh_hant: 使用 :ref:`SurfaceTool <class_surfacetool>` 產生幾何後，呼叫 ``commit()`` 以完成網格生成。若將 :ref:`ArrayMesh <class_ArrayMesh>` 傳入 ``commit()``，則會在該 ArrayMesh 末端附加一個新表面；若未傳入任何物件，``commit()`` 會回傳一個 ArrayMesh。

source: The code below creates a triangle without indices.
zh_hant: 以下程式碼會建立一個沒有索引的三角形。

source: You can optionally add an index array, either by calling ``add_index()`` and adding vertices to the index array manually, or by calling ``index()`` once, which generates the index array automatically and shrinks the vertex array to remove duplicate vertices.
zh_hant: 你可以選擇性地加入索引陣列：要嘛呼叫 ``add_index()`` 並手動把頂點加入索引陣列，要嘛只呼叫一次 ``index()``，自動產生索引陣列並收斂頂點陣列以移除重複頂點。

source: By default, when generating normals, they will be calculated on a per-vertex basis (i.e. they will be "smooth normals"). If you want flat vertex normals (i.e. a single normal vector per face), when adding vertices, call ``add_smooth_group(i)`` where ``i`` is a unique number per vertex. ``add_smooth_group()`` needs to be called while building the geometry, e.g. before the call to ``add_vertex()``.
zh_hant: 預設在產生法線時，會以每個頂點為基礎計算（即「平滑法線」）。若你想要平坦法線（每個面只有一個法線向量），在新增頂點時呼叫 ``add_smooth_group(i)``，其中 ``i`` 對每個頂點為唯一值。``add_smooth_group()`` 必須在建立幾何的過程中呼叫，例如在呼叫 ``add_vertex()`` 之前。
