Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.po
Languages: cs, ga, pt_br, ru, ta, uk

source: The list below refers to nodes which were simply renamed for consistency or clarity in Godot 4.0. The project upgrade tool renames them automatically in your scripts.
ga: Tagraíonn an liosta thíos do nóid a athainmníodh go simplí ar mhaithe le comhsheasmhacht nó soiléireacht in Godot 4.0. Déanann an uirlis uasghrádaithe tionscadail iad a athainmniú go huathoibríoch i do scripteanna.
pt_br: A lista abaixo refere-se aos nós que foram simplesmente renomeados para consistência ou clareza no Godot 4.0. A ferramenta de atualização do projeto os renomeia automaticamente nos seus scripts.
ru: Список ниже содержит узлы, которые были переименованы для согласованности и ясности в Godot 4.0. Инструмент обновления проектов переименовывает их автоматически в ваших скриптах.
ta: கீழேயுள்ள பட்டியல் கோடோட் 4.0 இல் நிலைத்தன்மை அல்லது தெளிவுக்காக மறுபெயரிடப்பட்ட முனைகளைக் குறிக்கிறது. திட்ட மேம்படுத்தல் கருவி உங்கள் ச்கிரிப்ட்களில் தானாகவே மறுபெயரிடுகிறது.
uk: Список нижче стосується вузлів, які були просто перейменовані для узгодженості та ясності в Godot 4.0. Інструмент оновлення проекту автоматично перейменовує їх у ваших сценаріях.

source: One noteworthy set of renames is 3D nodes, which all got a ``3D`` suffix added for consistency with their 2D counterparts. For example, ``Area`` is now ``Area3D``.
ga: Sraith athainmnithe amháin suntasach is ea nóid 3D, a fuair iarmhír ``3D` uile curtha le haghaidh comhsheasmhachta lena gcomhghleacaithe 2D. Mar shampla, is é ``Area`` anois ``Area3D``.
pt_br: Um conjunto notável de renomeações são os nós 3D, que receberam o sufixo ``3D`` para manter a consistência com suas contrapartes 2D. Por exemplo, ``Area`` agora é ``Area3D``.
ru: Один примечательный набор переименований - это 3D-узлы, которые все получили суффикс ``3D`` для согласованности с их 2D-аналогами. Например, ``Area`` теперь называется ``Area3D``.
ta: மறுபெயரிட்ட ஒரு குறிப்பிடத்தக்க தொகுப்பு 3D முனைகள் ஆகும், இவை அனைத்தும் அவற்றின் 2 டி சகாக்களுடன் ஒத்துப்போக `` 3d`` பின்னொட்டு சேர்க்கப்பட்டது. எடுத்துக்காட்டாக, `` பகுதி`` இப்போது `` ஏரியா 3 டி``.
uk: Вартий уваги набір перейменувань — це 3D-вузли, до яких додано суфікс ``3D`` для узгодженості з їх двовимірними аналогами. Наприклад, ``Area`` тепер ``Area3D``.

source: For ease of searching, this table lists all nodes and resources that were renamed and are automatically converted, excluding the ones which only involved adding a ``3D`` suffix to the old name:
ga: Ar mhaithe le cuardach éasca, liostaíonn an tábla seo gach nóid agus acmhainn a athainmníodh agus a thiontú go huathoibríoch, gan na cinn nach raibh ann ach iarmhír ``3D` a chur leis an seanainm:
pt_br: Para facilitar a pesquisa, esta tabela lista todos os nós e recursos, que foram renomeados e convertidos automaticamente, excluindo aqueles que envolveram apenas a adição de um sufixo ``3D`` ao nome antigo:
ru: Для облегчения поиска, таблица ниже перечисляет все узлы и ресурсы, которые были переименованы и автоматически преобразованы, исключая те, которые просто получили суффикс ``3D`` к старому имени:
ta: தேடலை எளிதாக, இந்த அட்டவணை மறுபெயரிடப்பட்ட மற்றும் தானாக மாற்றப்பட்ட அனைத்து முனைகளையும் வளங்களையும் பட்டியலிடுகிறது, இது பழைய பெயரில் `` 3d`` பின்னொட்டைச் சேர்ப்பதை மட்டுமே உள்ளடக்கியது:
uk: Для зручності пошуку в цій таблиці перераховано всі вузли та ресурси, які було перейменовано та автоматично перетворено, за винятком тих, які передбачали лише додавання суфікса ``3D`` до старої назви:

source: Old name (Godot 3.x)
ga: Sean-ainm (Godot 3.x)
pt_br: Nome antigo (Godot 3.x)
ru: Старое название (Godot 3.x)
ta: பழைய பெயர் (கோடோட் 3.x)
uk: Стара назва (Godot 3.x)

source: New name (Godot 4)
ga: Ainm nua (Godot 4)
pt_br: Novo nome (Godot 4)
ru: Новое название (Godot 4)
ta: புதிய பெயர் (கோடோட் 4)
uk: Нова назва (Годо 4)

source: AnimatedSprite
ga: Beoite Sprite
ta: அனிமேசன்ச்பிரைட்
uk: Анімований спрайт

source: ARVRCamera
ta: ராவோர்கோமெரா
uk: Камера AR VR

source: ARVRPositionalTracker
ta: ARVR நிலை டிராக்கர்

source: XRPositionalTracker
ta: எக்ச்ஆர் நிலை டிராக்கர்

source: ARVRServer
ga: ArvrFreastalaí
ta: பரம்பரை சேவையகம்

source: CubeMesh
ta: குபேமேச்

source: BoxMesh
ta: பாக்ச்மேச்

source: EditorSpatialGizmo
ga: EagarthóirSpatialGizmo
ta: Atterspatialgizmo
uk: Редактор SpatialGizmo

source: EditorNode3DGizmo
ga: EagarthóNode3DGizmo
ta: ItitorOrnode3dgizmo
uk: Редактор Node3D Gizmo

source: EditorSpatialGizmoPlugin
ga: EagarthóirSpatialGizmoPlugin
ta: AtterspatialgizMoplugin
uk: Редактор Spatial Gizmo Плагін

source: EditorNode3DGizmoPlugin
ga: EagarthóNode3dGizmoPlugin
ta: Iditornode3dgizmoplugin
uk: Плагін редактора Node3D Gizmo

source: GIProbe
ta: அகற்றப்பட்டது
uk: GI зонд

source: VoxelGI
ta: வோக்சல்கி
uk: Воксель Г.І

source: GIProbeData
ga: GiproBedData
ta: கிப்ரோபெடாட்டா
uk: Дані зонду GI

source: VoxelGIData
ta: வோக்சல்கிடேட்டா
uk: Воксельні дані GID

source: GradientTexture
ga: Uigeacht grádán
ta: சாய்வு
uk: Градієнтна текстура

source: GradientTexture1D
ga: Uigeacht grádán 1D
ru: ГрадиентнаяТекстура1D
ta: சாய்வு அமைப்பு 1 டி
uk: Градієнтна текстура

source: KinematicBody
cs: Kinematická tělesa
ga: CineMaticBody
ru: КинематическоеТело
ta: கினேமிக் பாடி
uk: Кінематичне тіло

source: CharacterBody3D
ga: CarachtarBody3D
ru: ПерсонажТело3D
ta: Reatolbody3d
uk: Тіло персонажа 3D

source: KinematicBody2D
ga: CinematicBody2d
ru: KinematicBоdy2D
ta: Cainematicbody2d
uk: Кінематичне тіло 2D

source: CharacterBody2D
ga: CarachtarBody2D
ru: ПерсонажТело2D
ta: Reatolbody2d
uk: Тіло персонажа 2D

source: Light2D
ga: Solas 2D
ru: Свет2D
ta: லைட் 2 டி
uk: Світло 2D

source: PointLight2D
ru: PointLight2D (Точечный свет 2d)
ta: பாயிண்ட்லைட் 2 டி
uk: Точкове світло 2D

source: LineShape2D
ga: LíneShape2d
ta: LINEHAPE2D
uk: Форма лінії 2D

source: WorldBoundaryShape2D
ga: Cruth Teorainn an Domhain 2D
ru: WorldBoundaryShape2D (Мировая Граница Форма 2d)
ta: WorldwoundaryShape2d
uk: Світова межа 2D

source: Listener
ga: Éisteoir
pt_br: Ouvinte (Listener)
ta: கேட்பவர்
uk: Слухач

source: AudioListener3D
ta: ஆடியோலிச்டனர் 3 டி

source: NavigationMeshInstance
cs: Navigační sítě
ru: NavigationMeshInstance (Навигационная сетка экземпляра)
ta: வழிசெலுத்தல் மைசின்ச்டன்ச்
uk: Екземпляр навігаційної сітки

source: NavigationRegion3D
ru: NavigationRegion3D (Навигационная Область 3d)
ta: வழிசெலுத்தல் பிரேரியன் 3 டி
uk: Область навігації 3D

source: NavigationPolygonInstance
ru: NavigationPolygonInstance (Навигационный полигон экземпляр)
ta: நேவிகேசன் பேலிகோனின்ச்டன்ச்
uk: Екземпляр багатокутника навігації

source: NavigationRegion2D
ru: NavigationRegion2D (Навигационная Область 2d)
ta: வழிசெலுத்தல் பகுதி 2 டி
uk: Область навігації 2D

source: Navigation2DServer
ru: Navigation2DServer (Навигация 2D -сервер)
ta: வழிசெலுத்தல் 2server
uk: Сервер Navigation2D

source: NavigationServer2D
ru: NavigationServer2D (Навигационный Сервер 2D)
ta: Asealigationserver2d
uk: Навігаційний сервер 2D

source: PanoramaSky
ru: PanoramaSky (Панорама Неба)
ta: பனோரமாச்கி
uk: Панорама неба

source: Sky
ga: Spéir
ta: வானம்
uk: небо

source: Particles
cs: Částice
ga: cáithníní
pt_br: Partículas
ru: Particles (Частицы)
ta: துகள்கள்
uk: Частинки

source: GPUParticles3D
ru: GPUParticles3D (Частицы Графического Процессора 3d)
ta: சி.பீ.யூ துகள்கள் 3 டி

source: Particles2D
ga: Cáithníní 2D
ru: Particles2D (Частицы 2D)
ta: துகள்கள் 2 டி
uk: Частинки 2D

source: GPUParticles2D
ru: GPUParticles2D (Частицы графического процессора 2D)
ta: சி.பீ.யூ துகள்கள் 2 டி

source: ParticlesMaterial
cs: Materiál částic
ga: Ábhar cáithníní
ru: ParticlesMaterial (Частицы Материал)
ta: துகள்கள்
uk: ParticlesMaterial (Матеріал Частинок)

source: ParticleProcessMaterial
ga: Ábhar Próiseála Cáithníní
ru: ParticleProcessMaterial (Материал процесса частиц)
ta: துகள் பதவி நீக்கம்
uk: Матеріал обробки частинок

source: Physics2DDirectBodyState
ga: Fisics2DDirectBodyState
ru: Physics2DDirectBodyState (Физика 2D Прямого Состояния Тела)
ta: இயற்பியல்

source: PhysicsDirectBodyState2D
ga: FisicsDirectBodyStat2d
ru: PhysicsDirectBodyState2D (Физика прямого состояния тела 2d)
ta: இயற்பியல் டைரக்ட்போடிச்டேட் 2 டி

source: Physics2DDirectSpaceState
ga: Phisics2DDirectSpaceState
ta: இயற்பியல் 2ddirectspacestate

source: PhysicsDirectSpaceState2D
ga: FísiceDirectSpaceState2D
ta: இயற்பியல் நிறுவனங்கள் பேசெச்டேட் 2 டி
uk: Фізика DirectSpaceState2D

source: Physics2DServer
ta: இயற்பியல் 2server
uk: Сервер Physics2D

source: PhysicsServer2D
ga: FisicsFreastala2D
ru: PhysicsServer2D (Физический сервер 2d)
ta: இயற்பியல் சேவையகம் 2 டி
uk: Фізичний сервер 2

source: Physics2DShapeQueryParameters
ga: Phisics2DShapEqueryParaiméadair
ta: இயற்பியல் 2dshapequeryparameters
uk: Параметри запиту Physics2D Shape

source: PhysicsShapeQueryParameters2D
ga: FísiceCruthParaiméadair Equery2D
ta: இயற்பியல் பகிர்வு பைரோமீட்டர்ச் 2 டி

source: Physics2DTestMotionResult
ga: Fisics2dTestMotionToradh
ta: இயற்பியல் 2dtestmotionResult
uk: Physics2D TestMotion Результат

source: PlaneShape
ta: பிளானேசேப்
uk: Форма площини

source: WorldBoundaryShape3D
ta: WorldWoundaryShape3d
uk: Світова межа фігури 3D

source: Position2D
ga: Suíomh 2D
ta: நிலை 2 டி
uk: Позиція2D

source: Marker2D
ga: Marcadóir2D
ta: மார்க்கர் 2 டி

source: Position3D
ga: Suíomh 3D
ta: நிலை 3 டி
uk: Позиція 3D

source: Marker3D
ga: Marcadóir3D
ta: மார்க்கர் 3 டி

source: ProceduralSky
cs: Procedurální obloha
ga: Nós imeachta Sky
ta: நடைமுறைச்கி

source: RayShape
ta: ரேசேப்

source: SeparationRayShape3D
ga: ScartRayShape3D
ta: பிரிப்பு ரேசேப் 3D
uk: Розділення RayShape 3D

source: RayShape2D
ta: ரேசேப் 2 டி

source: SeparationRayShape2D
ga: ScartRayShape2D
ta: Splationrayshape2d
uk: Розділення ReShape 2D

source: ShortCut
ta: குறுக்குவழி
uk: Ярлик

source: Shortcut
ga: Aicearra
ru: Ярлык (Shortcut)
ta: குறுக்குவழி
uk: Ярлик

source: Spatial
ga: Spásúil
ta: இடஞ்சார்ந்த
uk: Просторова

source: Node3DGizmo
ta: முனை 3D கிச்மோ

source: SpatialMaterial
ga: Ábhar spásúil
ta: இடஞ்சார்ந்த

source: StandardMaterial3D
ga: Ábhar Caighdeán3D
ta: Standandmaterial3d

source: Sprite
ta: ச்பிரிட்
uk: Спрайт

source: Sprite2D
ta: ச்ப்ரைட் 2 டி

source: StreamTexture
ta: ச்ட்ரீம்டெக்ச்டூர்

source: CompressedTexture2D
ga: ComhbhrúiteachtTeach2D
ta: ScricedTexture2d

source: TextureProgress
cs: Souřadnice textury
ga: TextureDul chun cinn
ta: SterceProgress

source: TextureProgressBar
ta: Sterceprogressbar

source: VideoPlayer
ga: Imreoir Físeáin
ta: வீடியோ பிளேயர்
uk: Відеопрогравач

source: VideoStreamPlayer
ga: FíseónStreamPlayer
ta: வீடியோச்ட்ரீஆம்ப்ளேயர்

source: Viewport
ga: Amharc
ta: வியூபோர்ட்
uk: Видове вікно

source: SubViewport
ta: துணைக் காட்சி

source: VisibilityEnabler
ga: Infheictheachtaitheachtaitheach
ta: தெரிவுநிலை தொழில்நுட்பம்

source: VisibleOnScreenEnabler3D
ga: VisibleOnScáileána3D
ta: Visebleonscreenenabler3d

source: VisibilityNotifier
ta: தெரிவுநிலை அறிவிப்பாளர்

source: VisibilityNotifier2D
ta: SealibilityNotifier2d

source: VisibilityNotifier3D
ta: தெரிவுநிலை அறிவிப்பாளர் 3D
uk: Видимість Notifier 3D

source: VisualServer
ta: விசுவல்சர்வர்

source: RenderingServer
ga: Freastalaí Rendering
ta: வழங்குதல் சேவையகம்

source: VisualShaderNodeScalarConstant
ta: விசுவல்சாடர்ன்ரோடெச்கலர்கான்ச்டன்ட்

source: VisualShaderNodeFloatConstant
ta: விசுவல்சாடர்ன்ஓடிஃப்ளோட் கான்ச்டன்ட்
uk: Плаваюча константа вузла візуального шейдера

source: VisualShaderNodeScalarFunc
ta: விசுவல்சாடர்ன்ரோடெச்கலார்ஃபுங்க்

source: VisualShaderNodeFloatFunc
ta: விசுவல்சாடர்ன்ஓடிஃப்ளோட்ஃபுங்க்

source: VisualShaderNodeScalarOp
ta: விசுவல்சாடர்ன்ரோடெச்கலராப்

source: VisualShaderNodeFloatOp
ta: விசுவல்சாடர்ன்ஓடிஃப்ளோடாப்

source: VisualShaderNodeScalarClamp
ta: விசுவல்சாடர்ன்ரோடெச்கலர்கிளாம்ப்

source: VisualShaderNodeClamp
ta: விசுவல்சாடர்ன் டெக்லேம்ப்

source: VisualShaderNodeVectorClamp
ta: விசுவல்சாடர்னோடெவெக்டர் கிளாம்ப்
uk: Візуальний шейдерний вузол векторного затиску

source: VisualShaderNodeScalarInterp
ta: விசுவல்சாடர்ன்ரோடெச்கலரின்டர்ப்

source: VisualShaderNodeMix
ta: விசுவல்சடர்ன்ரோடெமிக்ச்

source: VisualShaderNodeVectorInterp
ta: விசுவல்சாடர்னோடெவெக்டெக்டர்டெர்ப்

source: VisualShaderNodeVectorScalarMix
ta: விசுவல்சாடர்னோடெவெக்டோர்ச்கலார்மிக்ச்

source: VisualShaderNodeScalarSmoothStep
ta: விசுவல்சாடர்ன்ரோடெச்கலார்ச்மூத்ச்டெப்
uk: Вузол візуального шейдера Scalar SmoothStep

source: VisualShaderNodeSmoothStep
ta: விசுவல்சாடர்ன்ச்மூத்ச்டெப்
uk: Вузол візуального шейдера SmoothStep

source: VisualShaderNodeVectorSmoothStep
ta: விசுவல்சாடர்னோடெவெக்டோர்ச்மூத்ச்டெப்

source: VisualShaderNodeVectorScalarSmoothStep
ta: விசுவல்சாடர்னோடெவெக்டோர்ச்கலார்ச்மூத்ச்டெப்
uk: Візуальний шейдер Node Vector Scalar SmoothStep

source: VisualShaderNodeVectorScalarStep
ta: விசுவல்சாடர்னோடெவெக்டோர்ச்காலார்ச்டெப்

source: VisualShaderNodeStep
ta: விசுவல்சடர்ன்ரோடெச்டெப்

source: VisualShaderNodeScalarSwitch
ta: விசுவல்சடர்ன்ரோடெச்கலார்ச்விட்ச்

source: VisualShaderNodeSwitch
ta: விசுவல்சாடர்ன்ச்விட்ச்

source: VisualShaderNodeScalarTransformMult
ta: விசுவல்சாடர்ன்ரோடெச்கலார்ட்ரான்ச்ஃபார்மல்

source: VisualShaderNodeTransformOp
ta: விசுவல்சாடர்ன் டெட்ரான்ச்ஃபார்மோப்

source: VisualShaderNodeScalarDerivativeFunc
ta: விசுவல்சாடர்ன்ரோடெச்கலார்டரிவேடிவ்ஃபுன்

source: VisualShaderNodeDerivativeFunc
ta: விசுவல் சாடர்ன் டிடெரிவேடிவ்ஃபுன்
uk: Похідна функція Visual Shader Node

source: VisualShaderNodeVectorDerivativeFunc
ta: விசுவல்சாடர்னோடெவெக்டெக்டர்டிவேடிவ்ஃபுங்க்
uk: Векторна похідна функція вузла візуального шейдера

source: VisualShaderNodeBooleanUniform
ta: விசுவல்சாடர்னோடெபூல்அனூனிஃபார்ம்
uk: Візуальний шейдерний вузол Boolean Uniform

source: VisualShaderNodeBooleanParameter
ga: VisualShaderNodeBooleanParaiméadar
ta: விசுவல்சாடர்னோடெபூல்அன்பாரமீட்டர்
uk: Логічний параметр Visual Shader Node

source: VisualShaderNodeColorUniform
ta: விசுவல் சாடர்ன் டெகோலோரூனிஃபார்ம்
uk: Уніфікований колір вузла візуального шейдера

source: VisualShaderNodeColorParameter
ga: Paraiméadar VisualShaderNoDecolorParameter
ta: விசுவல்சாடர்ன்ரோடெகோலார்பராமீட்டர்
uk: Параметр кольору вузла візуального шейдера

source: VisualShaderNodeScalarUniform
ta: விசுவல்சாடர்ன்ரோடெச்கலருனிஃபார்ம்

source: VisualShaderNodeFloatParameter
ta: விசுவல்சாடர்ன்ஓடிஃப்ளோய்ட்பரேமீட்டர்

source: VisualShaderNodeCubeMapUniform
ta: விசுவல்சாடர்ன்ரோடெக்யூபூனிஃபுனிஃபார்ம்

source: VisualShaderNodeCubeMapParameter
ga: VisualShaderNodeCubeMapParaiméadar
ta: விசுவல்சாடர்ன்ரோடெக்யூபெமபராமீட்டர்

source: VisualShaderNodeTextureUniform
ta: விசுவல் சாடர்ன் டெட் டெக்ச்டெருனிஃபார்ம்

source: VisualShaderNodeTextureUniformTriplanar
ga: VisualShaderNoDetectureUniformTriplanar
ta: விசுவல்சாடர்ன் டெட் டெக்ச்ட்ரூன்யூடிஃபார்ம் டிரிப்ளனார்

source: VisualShaderNodeTextureParameterTriplanar
ga: VisualShaderNoDetextureParaiméadair Triplanar
ta: VisualShadernodetetexturearametertriplanar

source: VisualShaderNodeTransformUniform
ta: விசுவல் சாடர்ன் டெட்ரான்ச்ஃபார்மியூனிஃபார்ம்

source: VisualShaderNodeTransformParameter
ga: Paraiméadar VisualShaderNodTransformParameter
ta: விசுவல்சாடர்ன் டெட்ரான்ச்ஃபார்மர்

source: VisualShaderNodeVec3Uniform
ga: VisualShaderNodeVec3Aonair
ta: விசுவல்சாடர்னோடெக் 3uniform

source: VisualShaderNodeVec3Parameter
ga: VisualShaderNodeVec3Paraiméadar
ta: விசுவல்சாடர்னோடெவ்இசி 3 பாரமீட்டர்

source: VisualShaderNodeUniform
ta: விசுவல்சாடர்னோடைனிஃபார்ம்

source: VisualShaderNodeParameter
ga: VisualShaderNodeParaiméadar
ta: விசுவல்சடர்ன்ரோடெபராமீட்டர்

source: VisualShaderNodeUniformRef
ta: விசுவல்சாடர்னோடைனிஃபார்ம்ரெஃப்

source: VisualShaderNodeParameterRef
ta: விசுவல்சாடர்ன்டெபராமெட்ட்ரெஃப்

source: Manually renaming methods, properties, signals and constants
ga: Modhanna, airíonna, comharthaí agus tairisigh a athainmniú de láimh
ru: Ручное переименование методов, свойств, сигналов и констант
ta: கைமுறையாக மறுபெயரிடும் முறைகள், பண்புகள், சமிக்ஞைகள் மற்றும் மாறிலிகள்
uk: Перейменування методів, властивостей, сигналів та констант вручну

source: Due to how the project upgrade tool works, not all :abbr:`API (Application Programming Interface)` renames can be performed automatically. The list below contains all renames that must be performed manually using the script editor.
ga: Mar gheall ar an gcaoi a n-oibríonn an uirlis uasghrádaithe tionscadail, ní féidir athainmnithe uile:abbr:'API (Comhéadan Feidhmchláir)' a dhéanamh go huathoibríoch. Sa liosta thíos tá gach athainmniú nach mór a dhéanamh de láimh ag baint úsáide as an eagarthóir scripte.
pt_br: Devido à forma como a ferramenta de atualização do projeto funciona, nem todos :abbr: `API (Application Programming Interface)` renomeados podem ser executados automaticamente. A lista abaixo contém todos os renomeados que devem ser executados manualmente usando o editor de script.
ru: В силу особенностей работы инструмента обновления проекта, не все переименования :abbr:`API (Application Programming Interface)` могут быть выполнены автоматически. В списке ниже представлены все переименования, которые необходимо выполнить вручную с помощью редактора сценариев.
ta: திட்ட மேம்படுத்தல் கருவி எவ்வாறு செயல்படுகிறது என்பதன் காரணமாக, அனைத்துமே இல்லை: ஏபிபிஆர்: `ஏபிஐ (பயன்பாட்டு நிரலாக்க இடைமுகம்)` மறுபெயரிடங்களை தானாகவே செய்ய முடியும். கீழேயுள்ள பட்டியலில் ச்கிரிப்ட் எடிட்டரைப் பயன்படுத்தி கைமுறையாக செய்ய வேண்டிய அனைத்து மறுபெயரிட்டங்களும் உள்ளன.
uk: Через те, як працює інструмент оновлення проекту, не всі перейменування :abbr:`API (Application Programming Interface)` можна виконати автоматично. Список нижче містить усі перейменування, які потрібно виконати вручну за допомогою редактора сценаріїв.

source: If you cannot find a node or resource in the list below, refer to the above table to find its new name.
ga: Mura féidir leat nód nó acmhainn a aimsiú sa liosta thíos, féach ar an tábla thuas chun a ainm nua a aimsiú.
pt_br: Se você não conseguir encontrar um nó ou recurso na lista abaixo, consulte a tabela acima para encontrar seu novo nome.
ru: Если вы не можете найти узел или ресурс в списке ниже, обратитесь к вышеуказанной таблице, чтобы найти его новое название.
ta: கீழேயுள்ள பட்டியலில் ஒரு முனை அல்லது வளத்தை நீங்கள் கண்டுபிடிக்க முடியாவிட்டால், அதன் புதிய பெயரைக் கண்டுபிடிக்க மேலே உள்ள அட்டவணையைப் பார்க்கவும்.
uk: Якщо ви не можете знайти вузол або ресурс у списку нижче, зверніться до таблиці вище, щоб знайти його нову назву.

source: You can use the **Replace in Files** dialog to speed up replacement by pressing :kbd:`Ctrl + Shift + R` while the script editor is open. However, be careful as the Replace in Files dialog doesn't offer any way to undo a replacement. Use version control to commit your upgrade work regularly. Command line tools such as `sd <https://github.com/chmln/sd>`__ can also be used if you need something more flexible than the editor's Replace in Files dialog.
ga: Is féidir leat an dialóg ** Ionadaigh i gComhaid** a úsáid chun athsholáthar a bhrostú trí :kbd:`Ctrl + Shift + R` a bhrú agus an t-eagarthóir scripte ar oscailt. Bí cúramach, áfach, mar ní thairgeann an dialóg Ionadaigh i gComhaid aon bhealach le hathsholáthar a chealú. Bain úsáid as rialú leagan chun d'obair uasghrádaithe a dhéanamh go rialta. Is féidir uirlisí líne ordaithe ar nós `sd <https://github.com/chmln/sd>`__ a úsáid freisin má theastaíonn rud éigin níos solúbtha uait ná dialóg Ionadaigh i gComhaid an eagarthóra.
pt_br: Você pode usar a caixa de diálogo **Substituir em Arquivos** para agilizar substituições pressionando :kbd:`Ctrl + Shift + R` enquanto o editor de scripts estiver aberto. No entanto, tenha cuidado, pois essa caixa de diálogo não oferece nenhuma forma de desfazer uma substituição. Use controle de versão para confirmar regularmente o progresso do seu trabalho de atualização. Ferramentas de linha de comando como `sd <https://github.com/chmln/sd>`__ também podem ser usadas se você precisar de algo mais flexível do que a caixa de diálogo Substituir em Arquivos do editor.
ru: Вы можете использовать диалоговое окно **Заменить в файлах**, чтобы ускорить замену, нажав :kbd:`Ctrl + Shift + R` при открытом редакторе скриптов. Однако будьте осторожны, так как диалоговое окно "Заменить в файлах" не предлагает никакого способа отмены замены. Используйте систему контроля версий для регулярной фиксации работы по обновлению. Инструменты командной строки, такие как `sd <https://github.com/chmln/sd>`__ также могут быть использованы, если вам нужно что-то более гибкое, чем диалоговое окно "Заменить в файлах" в редакторе.
ta: ச்கிரிப்ட் எடிட்டர் திறந்திருக்கும் போது KBD: `Ctrl + உயர்த்து + R` ஐ அழுத்துவதன் மூலம் மாற்றீட்டை விரைவுபடுத்துவதற்கு ** கோப்புகளில் மாற்றத்தை ** உரையாடலைப் பயன்படுத்தலாம். இருப்பினும், கோப்புகளை மாற்றுவது மாற்றீட்டை செயல்தவிர்க்க எந்த வழியையும் வழங்காததால் கவனமாக இருங்கள். உங்கள் மேம்படுத்தல் பணிகளை தவறாமல் செய்ய பதிப்பு கட்டுப்பாட்டைப் பயன்படுத்தவும். `எச்டி <https://github.com/chmln/sd> போன்ற கட்டளை வரி கருவிகள் கோப்புகளின் உரையாடலில் எடிட்டரின் மாற்றத்தை விட நெகிழ்வான ஏதாவது தேவைப்பட்டால் பயன்படுத்தலாம்.
uk: Ви можете скористатися діалоговим вікном **Замінити у файлах**, щоб пришвидшити заміну, натиснувши :kbd:`Ctrl + Shift + R`, коли відкрито редактор сценаріїв. Однак будьте обережні, оскільки діалогове вікно «Замінити у файлах» не пропонує жодного способу скасувати заміну. Використовуйте контроль версій, щоб регулярно виконувати роботу з оновлення. Інструменти командного рядка, такі як `sd <https://github.com/chmln/sd>`__, також можна використовувати, якщо вам потрібно щось гнучкіше, ніж діалогове вікно редактора «Замінити у файлах».

source: If using C#, remember to search for outdated API usage with PascalCase notation in the project (and perform the replacement with PascalCase notation).
ga: Má tá C # á úsáid agat, cuimhnigh ar úsáid API atá as dáta a chuardach le nodaireacht PascalCase sa tionscadal (agus déan nodaireacht PascalCase a athsholáthar).
pt_br: Se estiver usando C#, lembre-se de procurar por uso obsoleto da API com a notação PascalCase no projeto (e realizar a substituição com a notação PascalCase).
ru: При использовании C# не забудьте найти устаревшее использование API с нотацией в стиле PascalCase в проекте (и выполнить замену с нотацией в стиле PascalCase).
ta: சி#ஐப் பயன்படுத்தினால், திட்டத்தில் பாச்கால்கேச் குறியீட்டுடன் காலாவதியான பநிஇ பயன்பாட்டைத் தேட நினைவில் கொள்ளுங்கள் (மேலும் பாச்கால்கேச் குறியீட்டுடன் மாற்றீட்டைச் செய்யுங்கள்).
uk: Якщо ви використовуєте C#, не забувайте шукати застаріле використання API з нотацією PascalCase у проекті (і виконати заміну на нотацію PascalCase).

source: **Methods**
ga: **Modhanna**
ru: **Методы**
ta: ** முறைகள் **
uk: **Методи**
