Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.po
Languages: cs, ga, pt_br, ru, ta, uk

source: :ref:`class_ResourceSaver`'s ``save()`` method now has its arguments swapped around (``resource: Resource, path: String``). This also applies to :ref:`class_ResourceFormatSaver`'s ``_save()`` method.
ga: :ref:'class_ResourceSaver's ''save()'' modh anois tá a chuid argóintí swapped timpeall (''acmhainn: Acmhainn, cosán: Teaghrán'). Baineann sé seo freisin le modh ''_save()'' class_ResourceFormatSaver.
pt_br: O método ``save()`` de :ref:`class_ResourceSaver` agora tem seus argumentos trocados (``resource: Resource, path: String``). Isso também se aplica ao método ``_save()`` de :ref:`class_ResourceFormatSaver`.
ru: В классе :ref:`class_ResourceSaver` у метода ``save()`` были переменены аргументы местами (``resource: Resource, path: String``). Это также относится к методу ``_save()`` у :ref:`class_ResourceFormatSaver`.
ta: . இது பொருந்தும்: குறிப்பு: `class_resourceformatsaver` இன்` `_save ()` `முறை.
uk: :ref:`class_ResourceSaver`'s ``save()`` тепер аргументи методу поміняні місцями (``resource: Resource, path: String``). Це також стосується методу :ref:`class_ResourceFormatSaver` ``_save()``.

source: A :ref:`class_StreamPeerTCP` must have ``poll()`` called on it to update its state, instead of relying on ``get_status()`` automatically polling: `GH-59582 <https://github.com/godotengine/godot/pull/59582>`__
ga: A :ref:`class_StreamPeerTCP` caithfidh `` vótaíocht()`` a bheith glaoite air chun a staid a nuashonrú, in ionad a bheith ag brath ar ``get_status()`` vótaíocht go huathoibríoch: `GH-59582 <https://github.com /godotengin/godot/tarraingt/59582>`__
pt_br: Um :ref:`class_StreamPeerTCP` deve ter ``poll()`` chamado para atualizar seu estado, em vez de depender de ``get_status()`` para pesquisar automaticamente: `GH-59582 <https://github.com/godotengine/godot/pull/59582>`__
ru: Класс :ref:`class_StreamPeerTCP` теперь имеет ``poll()`` вызываемый обновлением своего состояния, вместо зависимости от ``get_status()`` автоматического опроса: `GH-59582 <https://github.com/godotengine/godot/pull/59582>`__
ta: ப: குறிப்பு: `` get_status () `` தானாகவே வாக்களித்தல்: `gh-59582 <https://github.com /கோடோடெங்கின்/கோடோட்/புல்/59582> `__
uk: :ref:`class_StreamPeerTCP` має викликати ``poll()``, щоб оновити його стан, замість того, щоб покладатися на ``get_status()`` автоматичного опитування: `GH-59582 <https://github.com /godotengine/godot/pull/59582>`__

source: :ref:`class_String`'s ``right()`` method `has changed behavior <https://github.com/godotengine/godot/pull/36180>`__: it now returns a number of characters from the right of the string, rather than the right side of the string from a given position. If you need the old behavior, you can use ``substr()`` instead.
ga: :ref: Tá modh ``right()`` `` class_String`` tar éis iompar a athrú <https://github.com/godotenginine/godot/pull/36180>`__: filleann sé roinnt carachtar anois ón taobh deas den téad, seachas taobh deas na sreinge ó shuíomh tugtha. Más gá duit an sean-iompraíocht, is féidir leat `` substr()`` a úsáid ina ionad sin.
pt_br: O método ``right()`` da :ref:`class_String` `teve seu comportamento alterado <https://github.com/godotengine/godot/pull/36180>`__: agora ele retorna um número de caracteres a partir da direita da string, em vez de retornar a parte direita da string a partir de uma posição fornecida. Se você precisar do comportamento antigo, pode usar ``substr()`` no lugar.
ru: У метода ``right()`` класса :ref:`class_String` было изменено поведение <https://github.com/godotengine/godot/pull/36180>`__: теперь он возвращает число символов строки справа, а не с правой стороны строки из заданной позиции. Если вам нужно старое поведение, вы можете использовать ``substr()`` вместо.
ta: . கொடுக்கப்பட்ட நிலையில் இருந்து சரத்தின் வலது பக்கத்தை விட சரம். உங்களுக்கு பழைய நடத்தை தேவைப்பட்டால், அதற்கு பதிலாக `` அடிமையாக () `` பயன்படுத்தலாம்.
uk: :ref:`class_String`'s ``right()`` метод `змінив поведінку <https://github.com/godotengine/godot/pull/36180>`__: тепер він повертає кількість символів з правого боку рядка, а не з правого боку рядка з даної позиції. Якщо вам потрібна стара поведінка, ви можете використовувати замість неї ``substr()``.

source: ``is_connected_to_host()`` was removed from StreamPeerTCP and PacketPeerUDP as per `GH-59582 <https://github.com/godotengine/godot/pull/59582>`__. ``get_status()`` can be used in StreamPeerTCP instead. ``is_socket_connected()`` can be used in :ref:`class_PacketPeerUDP` instead.
ga: Baineadh ``is_connected_to_host()`` de StreamPeerTCP agus PacketPeerUDP de réir `GH-59582 <https://github.com/godotenginine/godot/pull/59582>`__. Is féidir ``get_status()`` a úsáid in StreamPeerTCP ina ionad sin. Is féidir ``is_socket_connected()`` a úsáid i :ref:`class_PacketPeerUDP` ina ionad sin.
pt_br: ``is_connected_to_host()`` foi removido do StreamPeerTCP e PacketPeerUDP conforme `GH-59582 <https://github.com/godotengine/godot/pull/59582>`__. Em vez disso, ``get_status()`` pode ser usado no StreamPeerTCP e ``is_socket_connected()`` pode ser usado em :ref:`class_PacketPeerUDP`.
ru: ``is_connected_to_host()`` был удален из StreamPeerTCP и PacketPeerUDP в `GH-59582 <https://github.com/godotengine/godot/pull/59582>`__. ``get_status()`` может использоваться в StreamPeerTCP вместо него. ``is_socket_connected()`` может использоваться в :ref:`class_PacketPeerUDP` вместо него.
ta: `` is_connectect_to_host () `` `gh-59582 <https://github.com/godotengine/godot/pull/59582> ____. `` get_status () `` அதற்கு பதிலாக streampeertcp இல் பயன்படுத்தப்படலாம். `` is_socket_connected () `` இதில் பயன்படுத்தப்படலாம்: ref: `class_packetpeerudp` அதற்கு பதிலாக.
uk: ``is_connected_to_host()`` було видалено зі StreamPeerTCP і PacketPeerUDP відповідно до `GH-59582 <https://github.com/godotengine/godot/pull/59582>`__. Замість цього в StreamPeerTCP можна використовувати ``get_status()``. ``is_socket_connected()`` можна використовувати в :ref:`class_PacketPeerUDP` замість цього.

source: In ``_get_property_list()``, the ``or_lesser`` property hint string is now ``or_less``.
ga: In ''_get_property_list()'', is é ''or_lesser'' teaghrán leid maoine anois ''or_less''.
pt_br: Em ``_get_property_list()``, a string de dica de propriedade ``or_lesser`` agora é ``or_less``.
ru: В ``_get_property_list()``, свойство строки подсказки ``or_lesser`` теперь ``or_less``.
ta: `` _GET_PROPERTY_LIST () `` இல், `` OR_LESSER`` சொத்து குறிப்பு சரம் இப்போது `` or_less``.
uk: У ``_get_property_list()`` рядок підказки властивості ``or_lesser`` тепер має назву ``or_less``.

source: In ``_get_property_list()``, the ``noslider`` property hint string is now ``no_slider``.
ga: In ''_get_property_list()'', is é ''noslider'' an teaghrán leid maoine anois ''no_slider''.
pt_br: Em ``_get_property_list()``, a string de dica de propriedade ``noslider`` agora é ``no_slider``.
ru: В ``_get_property_list()`, свойство строки подсказки ``noslider`` теперь ``no_slider``.
ta: `` _Get_property_list () `` இல், `` noslider`` சொத்து குறிப்பு சரம் இப்போது `` no_slider``.
uk: У ``_get_property_list()`` рядок підказки властивості ``noslider`` тепер має назву ``no_slider``.

source: VisualShaderNodeVec4Parameter now takes a :ref:`class_Vector4` as parameter instead of a :ref:`class_Quaternion`.
ga: VisualShaderNodeVec4Parameter Bíonn anois :ref:'class_Vector4' mar pharaiméadar in ionad :ref:'class_Quaternion'.
pt_br: VisualShaderNodeVec4Parameter agora aceita um :ref:`class_Vector4` como parâmetro em vez de um :ref:`class_Quaternion`.
ru: VisualShaderNodeVec4Parameter теперь принимает параметр :ref:`class_Vector4` вместо :ref:`class_Quaternion`.
ta: விசுவல்சாடர்னோடெவ்இசி 4 பாரமீட்டர் இப்போது ஒரு: re: `class_vector4` க்கு பதிலாக அளவுருவாக எடுத்துக்கொள்கிறார்: குறிப்பு: re:` class_quaternion`.
uk: VisualShaderNodeVec4Parameter тепер приймає :ref:`class_Vector4` як параметр замість :ref:`class_Quaternion`.

source: **Removed or replaced nodes/resources**
ga: **Nóid/acmhainní bainte nó curtha ina n-ionad**
pt_br: **Nós/recursos removidos ou substituídos**
ru: **Удаленные или замененные узлы/ресурсы**
ta: ** அகற்றப்பட்டது அல்லது மாற்றப்பட்ட முனைகள்/வளங்கள் **
uk: **Видалені або замінені вузли/ресурси**

source: This lists all nodes that were replaced by another node requiring different configuration. The setup must be done from scratch again, as the project converter doesn't support updating existing setups:
ga: Liostaíonn sé seo na nóid go léir a cuireadh nód eile ina n-ionad a éilíonn cumraíocht dhifriúil. Ní mór an thus a dhéanamh ó thús arís, toisc nach dtacaíonn an tiontaire tionscadail le nuashonrú a dhéanamh ar na socruithe atá ann cheana féin:
pt_br: Esta lista contém todos os nós substituídos por outro nó que requer configuração diferente. A configuração deve ser feita do zero novamente, pois o conversor de projeto não suporta a atualização de configurações existentes:
ru: В этом списке указаны все узлы, которые были заменены другим узлом, требующим иной конфигурации. Настройку необходимо выполнить заново, так как конвертер проектов не поддерживает обновление существующих конфигураций:
ta: வெவ்வேறு உள்ளமைவு தேவைப்படும் மற்றொரு முனையால் மாற்றப்பட்ட அனைத்து முனைகளையும் இது பட்டியலிடுகிறது. தற்போதுள்ள அமைப்புகளைப் புதுப்பிப்பதை திட்ட மாற்றி ஆதரிக்காததால், இந்த அமைப்பு புதிதாக மீண்டும் செய்யப்பட வேண்டும்:
uk: Це список усіх вузлів, які були замінені іншим вузлом, що потребує іншої конфігурації. Налаштування потрібно виконати знову з нуля, оскільки конвертер проекту не підтримує оновлення наявних налаштувань:

source: Removed node
ga: Nód bainte
ru: Удаленный узел
ta: அகற்றப்பட்ட முனை
uk: Видалений вузол

source: Closest approximation
ga: An comhfhogasú is gaire
ru: Ближайший аналог
ta: நெருங்கிய தோராயமானது
uk: Найближче наближення

source: Comment
ga: Nóta Tráchta
pt_br: Comente
ru: Комментарий
ta: கருத்து
uk: Коментар

source: AnimationTreePlayer
ta: அனிமேசன் ட்ரீ பிளேயர்

source: AnimationTree
ga: BeochanTreeName
ta: அனிமேசன் ட்ரீ

source: AnimationTreePlayer was deprecated since Godot 3.1.
ga: Rinneadh beochanTreePlayer a dhímheas ó Godot 3.1.
pt_br: AnimationTreePlayer está obsoleto desde Godot 3.1.
ru: AnimationTreePlayer считается устаревшим с версии Godot 3.1.
ta: கோடோட் 3.1 முதல் அனிமேசன் ட்ரீ பிளேயர் நீக்கப்பட்டது.
uk: Програвач AnimationTreePlayer застарів з Godot 3.1.

source: BakedLightmap
ga: Léarscáileán BakedLightMap
ta: வேகவைத்த ஒளி

source: LightmapGI
ga: Mapa SolaisGI
ta: லைட்மாப்கி

source: See :ref:`doc_using_lightmap_gi`.
cs: Viz :ref:`doc_using_lightmap_gi`.
ga: Féach :ref:'doc_using_lightmap_gi'.
ru: Посмотрите :ref:`doc_using_lightmap_gi`.
ta: காண்க: குறிப்பு: `doc_using_lightmap_gi`.
uk: Дивіться :ref:`doc_using_lightmap_gi`.

source: BakedLightmapData
ga: Sonraí Léarscáileáin BakedLight
ta: Backetlightmapdata

source: LightmapGIData
ga: Mapa SolaisGIData
ta: லைட்மாப்கிடேட்டா

source: BitmapFont
ga: Mapa GiotánFont
ta: பிட்மாப்ஃபோன்ட்

source: FontFile
ga: Comhad Cló
ta: எழுத்துரு

source: See :ref:`doc_gui_using_fonts`.
cs: Viz :ref:`doc_gui_using_fonts`.
ga: Féach :ref:'doc_gui_using_fonts'.
ru: Посмотрите :ref:`doc_gui_using_fonts`.
ta: காண்க: குறிப்பு: `doc_gui_using_fonts`.
uk: Дивіться :ref:`doc_gui_using_fonts`.

source: DynamicFont
cs: Dynamické fonty
ga: DynamicFontName
pt_br: Fonte Dinâmica
ta: டைனமிக்ஃபாண்ட்
uk: Динамічний Шрифт

source: DynamicFontData
ta: மாறும் ஃபோன்டேட்டா

source: Navigation2D
ga: Nascleanúint2D
ta: வழிசெலுத்தல் 2 டி

source: Replaced by :ref:`other 2D Navigation nodes <doc_navigation_overview_2d>`.
ga: Arna ionadú ag :ref:`nóid Nascleanúna 2T eile <doc_navigation_overview_2d>`.
pt_br: Substituído por :ref:`outros nós de navegação 2D <doc_navigation_overview_2d>`.
ru: Заменен на :ref:`другие узлы 2D навигации <doc_navigation_overview_2d>`.
ta: மாற்றப்பட்டது: ref: `பிற 2 டி வழிசெலுத்தல் முனைகள் <doc_navigation_overview_2d>`.
uk: Замінено на :ref:`інші вузли двовимірної навігації <doc_navigation_overview_2d>`.

source: Navigation3D
ga: Nascleanúint3D
ta: வழிசெலுத்தல் 3 டி
uk: Навігація 3D

source: Replaced by :ref:`other 3D Navigation nodes <doc_navigation_overview_3d>`.
ga: Arna ionadú ag :ref:`nóid Nascleanúna 3D eile <doc_navigation_overview_3d>`.
pt_br: Substituído por :ref:`outros nós de navegação 3D <doc_navigation_overview_3d>`.
ru: Заменен на :ref:`другие узлы 3D навигации <doc_navigation_overview_3d>`.
ta: மாற்றப்பட்டது: ref: `பிற 3D வழிசெலுத்தல் முனைகள் <doc_navigation_overview_3d>`.
uk: Замінено на :ref:`інші вузли тривимірної навігації <doc_navigation_overview_3d>`.

source: FastNoiseLite
ta: Fharcies
uk: Швидкий Noise Lite

source: Has different parameters and more noise types such as cellular. No support for 4D noise as it's absent from the FastNoiseLite library.
ga: An bhfuil paraiméadair éagsúla agus cineálacha torann níos mó, mar shampla cheallacha. Níl aon tacaíocht do thorann 4D mar tá sé as láthair ó leabharlann FastNoiseLite.
pt_br: Possui parâmetros diferentes e mais tipos de ruído, como o celular (ruído de Worley). Não há suporte para ruído 4D por estar ausente na biblioteca FastNoiseLite.
ru: Имеет другие параметры и больше типов шума таких как клеточный. Не поддерживает 4D шум т.к. он отсутствует в библиотеке FastNoiseLite.
ta: வெவ்வேறு அளவுருக்கள் மற்றும் செல்லுலார் போன்ற அதிக இரைச்சல் வகைகளைக் கொண்டுள்ளது. 4D சத்தத்திற்கு எந்த ஆதரவும் இல்லை, ஏனெனில் இது ஃபாச்ட்னோயிசெலைட் நூலகத்திலிருந்து இல்லாதது.
uk: Має різні параметри та більше типів шуму, наприклад стільниковий. Немає підтримки 4D-шуму, оскільки його немає в бібліотеці FastNoiseLite.

source: ToolButton
cs: Buttons (Tlačítka)
ga: Cnaipe Uirlisí
ta: கருவிப்பட்டி
uk: Кнопка "Інструмент"

source: Button
cs: Tlačítko
ga: Cnaipe
ta: பொத்தான்
uk: Кнопка

source: ToolButton was Button with the **Flat** property enabled by default.
ga: Bhí ToolButton cnaipe leis an maoin ** Maol ** cumasaithe de réir réamhshocraithe.
pt_br: ToolButton era um botão com a propriedade **Flat** habilitada por padrão.
ru: ToolButton был Button с включенным по умолчанию свойством **Flat**.
ta: கருவிப்பட்டி இயல்புநிலையாக இயக்கப்பட்ட ** பிளாட் ** சொத்துடன் பொத்தான் ஆகும்.
uk: ToolButton була кнопкою з властивістю **Flat**, увімкненою за замовчуванням.

source: Node2D or Control
ga: Node2D nó Rialú
ru: Node2D или Control
ta: Node2d அல்லது கட்டுப்பாடு
uk: Node2D або Control

source: CanvasItem has a new **Y Sort Enabled** property in 4.0.
ga: Tá maoin nua **Y Sort Enabled** ag CanvasItem i 4.0.
pt_br: CanvasItem tem uma nova propriedade **Y Sort Enabled** na versão 4.0.
ru: CanvasItem теперь имеет **Y Sort Enabled** свойство в версии 4.0.
ta: கேன்வாசிடெமில் 4.0 இல் புதிய ** ஒய் வரிசை இயக்கப்பட்ட ** சொத்து உள்ளது.
uk: CanvasItem має нову властивість **Y Sort Enabled** у версії 4.0.

source: ProximityGroup
ga: Grúpa Gaireachta
ta: அருகாமையில் குழு
uk: Група близькості

source: :ref:`class_VisibleOnScreenNotifier3D` can act as a replacement.
ga: :ref:Is féidir le 'class_VisibleOnScreenNotifier3D' gníomhú mar athsholáthar.
pt_br: :ref:`class_VisibleOnScreenNotifier3D` pode atuar como um substituto.
ru: :ref:`class_VisibleOnScreenNotifier3D` может использоваться в качестве замены.
ta: : ref: `class_visibleonscreennotifier3d` மாற்றாக செயல்பட முடியும்.
uk: :ref:`class_VisibleOnScreenNotifier3D` може виступати як заміна.

source: Portal
ga: Tairseach
ta: போர்டல்
uk: Портал

source: Portal and room occlusion culling was replaced by raster :ref:`occlusion culling <doc_occlusion_culling>` (OccluderInstance3D node), which requires a different setup process.
ga: Cuireadh raster :ref:`marú occlusion <doc_occlusion_culling>> in ionad marú occlusion tairseach agus seomra, a éilíonn próiseas socraithe difriúil.
pt_br: Oclusão de portais e de salas foi substituída por raster :ref:`occlusion culling <doc_occlusion_culling>` (nó OccluderInstance3D), que requer um processo de configuração diferente.
ru: Портал и комната окклюзивного куллинга были заменены на :ref:`occlusion culling <doc_occlusion_culling>` (узел OccluderInstance3D), которой требуется другой процесс настройки.
ta: போர்டல் மற்றும் ரூம் மறைவு குறைத்தல் ராச்டரால் மாற்றப்பட்டது: ref: `மறைவு குறைத்தல் <doc_occlusion_culling>` (occluderinstance3d node), இதற்கு வேறுபட்ட அமைப்பு செயல்முறை தேவைப்படுகிறது.
uk: Відбір блокування порталу та кімнати було замінено растровим :ref:`відбракуванням блокування <doc_occlusion_culling>` (вузол OccluderInstance3D), для якого потрібен інший процес налаштування.

source: Room
ga: Seomra
ta: அறை
uk: Кімната

source: RoomManager
ga: Bainisteoir Seomra
ta: ரூம் மேனேசர்
uk: RoomManager (Керівник кімнати)

source: RoomGroup
ga: Grúpa Seomra
ta: அறை குழு
uk: Група номерів

source: Occluder
ga: OccluderName
ta: மறைமுகம்
uk: Оклюдер

source: Geometry occlusion culling was replaced by raster :ref:`occlusion culling <doc_occlusion_culling>` (OccluderInstance3D node), which requires a different setup process.
ga: Cuireadh raster :ref:`occlusion marú <doc_occlusion_culling>' (nód OccluderInstance3D) in ionad marú occlusion céimseata, a éilíonn próiseas socraithe difriúil.
pt_br: O abate por oclusão Geométrica foi substituído por raster :ref:`occlusion culling <doc_occlusion_culling>` (nó OccluderInstance3D), que requer um processo de configuração diferente.
ru: Геометрический окллюзионный куллинг был заменен на растровый :ref:`occlusion culling <doc_occlusion_culling>` (узел OccluderInstance3D), который требует другой процесс настройки.
ta: வடிவியல் மறைவது ராச்டரால் மாற்றப்பட்டது: ref: `மறைவு குறைத்தல் <doc_occlusion_culling>` (occluderinstance3d node), இதற்கு வேறுபட்ட அமைப்பு செயல்முறை தேவைப்படுகிறது.
uk: Геометричне відсіювання оклюзії було замінено растровим :ref:`відбракуванням оклюзії <doc_occlusion_culling>` (вузол OccluderInstance3D), для якого потрібен інший процес налаштування.

source: OccluderShapeSphere
ta: மறைமுக வடிவ கோளம்
uk: OccluderShapeSphere (Сферична Форма Оклюдера)

source: Resource
ga: Acmhainn
ta: வள
uk: Ресурс

source: If loading an old project, the node will be replaced with its *Closest approximation* automatically (even if not using the project upgrade tool).
ga: Má tá seanthionscadal á luchtú, cuirfear a *Closest approximation *in ionad an nód go huathoibríoch (fiú mura n-úsáideann sé an uirlis uasghrádaithe tionscadail).
pt_br: Ao carregar um projeto antigo, o nó será substituído automaticamente por sua *Aproximação mais próxima* (mesmo que você não esteja usando a ferramenta de atualização do projeto).
ru: При загрузке старого проекта, узел будет автоматически заменен на его **Ближайший аналог** (даже если не использовать утилиту обновления проекта).
ta: பழைய திட்டத்தை ஏற்றினால், முனை அதன் * மிக நெருக்கமான தோராயமாக * தானாக மாற்றப்படும் (திட்ட மேம்படுத்தல் கருவியைப் பயன்படுத்தாவிட்டாலும் கூட).
uk: Якщо завантажується старий проект, вузол буде автоматично замінено його *Найближчим наближенням* (навіть якщо не використовується інструмент оновлення проекту).

source: **Threading changes**
ga: **Athruithe snáithithe**
ru: **Изменения многопоточности**
ta: ** த்ரெட்டிங் மாற்றங்கள் **
uk: **Зміни потоків**

source: :ref:`Threading <doc_using_multiple_threads>` APIs have changed in 4.0. For example, the following code snippet in Godot 3.x must be modified to work in 4.0:
ga: :ref:`Threading <doc_using_multiple_threads>` Athraíodh APInna i 4.0. Mar shampla, ní mór an mhír chóid seo a leanas in Godot 3.x a mhionathrú chun oibriú i 4.0:
pt_br: :ref:`Threading <doc_using_multiple_threads>` As APIs mudaram na versão 4.0. Por exemplo, o seguinte trecho de código no Godot 3.x deve ser modificado para funcionar no 4.0:
ru: API :ref:`многопоточности <doc_using_multiple_threads>` был изменен в 4.0. Например, следующий фрагмент кода из Godot 3.x нужно изменить для работы в 4.0:
ta: . எடுத்துக்காட்டாக, கோடோட் 3.x இல் பின்வரும் குறியீடு துணுக்கை 4.0 இல் வேலை செய்ய மாற்றப்பட வேண்டும்:
uk: :ref:`Threading <doc_using_multiple_threads>` API змінено у версії 4.0. Наприклад, наступний фрагмент коду в Godot 3.x потрібно змінити, щоб він працював у 4.0:

source: ``Thread.is_active()`` is no longer used and should be converted to ``Thread.is_alive()``.
ga: Ní úsáidtear ''Thread.is_active()'' a thuilleadh agus ba cheart é a thiontú go ''Thread.is_alive()''.
pt_br: ``Thread.is_active()`` não é mais usado e deve ser convertido para ``Thread.is_alive()``.
ru: ``Thread.is_active()`` больше не поддерживается и должен быть преобразован в ``Thread.is_alive()``.
ta: `` Thread.is_active () `` இனி பயன்படுத்தப்படாது, மேலும் `` thread.is_alive () `` ஆக மாற்றப்பட வேண்டும்.
uk: ``Thread.is_active()`` більше не використовується і має бути перетворено на ``Thread.is_alive()``.

source: See the `changelog <https://github.com/godotengine/godot/blob/master/CHANGELOG.md>`__ for a full list of changes between Godot 3.x and 4.
ga: Féach ar an `changelog <https://github.com/godotenginine/godot/blob/master/CHANGELOG.md>`__ le haghaidh liosta iomlán na n-athruithe idir Godot 3.x agus 4.
pt_br: Veja o `changelog <https://github.com/godotengine/godot/blob/master/CHANGELOG.md>`__ para uma lista completa de mudanças entre o Godot 3.x e 4.
ru: Смотрите `список изменений <https://github.com/godotengine/godot/blob/master/CHANGELOG.md>`__ для получения полного списка изменений между версиями Godot 3.x и 4.
ta: கோடோட் 3.x மற்றும் 4 க்கு இடையிலான மாற்றங்களின் முழு பட்டியலுக்கு `சேஞ்ச்லாக் <https://github.com/godotengin/godot/blob/master/changelog.md> __ ஐப் பார்க்கவும்.
uk: Перегляньте `журнал змін <https://github.com/godotengine/godot/blob/master/CHANGELOG.md>`__, щоб отримати повний список змін між Godot 3.x і 4.

source: ArrayMesh resource compatibility breakage
ga: Briseadh comhoiriúnacht acmhainní ArrayMesh
pt_br: Quebra de compatibilidade de recursos do ArrayMesh
ru: Нарушение обратной совместимости ресурса ArrayMesh
ta: அரேமேச் வள பொருந்தக்கூடிய உடைப்பு
uk: Порушення сумісності ресурсів ArrayMesh

source: If you've saved an ArrayMesh resource to a ``.res`` or ``.tres`` file, the format used in 4.0 is not compatible with the one used in 3.x. You will need to go through the process of importing the source mesh file and saving it as an ArrayMesh resource again.
ga: Má shábháil tú acmhainn ArrayMesh chuig comhad ''.res'' nó ''.tres'', níl an fhormáid a úsáidtear i 4.0 comhoiriúnach leis an gceann a úsáidtear i 3.x. Beidh ort dul tríd an bpróiseas chun an comhad mogalra foinse a allmhairiú agus é a shábháil mar acmhainn ArrayMesh arís.
pt_br: Se você salvou um recurso ArrayMesh em um arquivo ``.res`` ou ``.tres``, o formato usado na versão 4.0 não é compatível com o usado na versão 3.x. Você precisará passar pelo processo de importar o arquivo de malha de origem e salvá-lo como um recurso ArrayMesh novamente.
ru: Если вы сохранили ресурс ArrayMesh в файл ``.res`` или ``.tres``, формат используемый в 4.0 не совместим с тем что используется в 3.x. Вам нужно пройти через процесс импортирования исходного файла сетки и сохранить его как ресурс ArrayMesh снова.
ta: நீங்கள் ஒரு வரிசைமேச் வளத்தை `` .Res`` அல்லது `` .tres`` கோப்பில் சேமித்திருந்தால், 4.0 இல் பயன்படுத்தப்படும் வடிவம் 3.x இல் பயன்படுத்தப்படும் ஒன்றோடு பொருந்தாது. மூல மெச் கோப்பை இறக்குமதி செய்து மீண்டும் ஒரு வரிசைமேச் வளமாக சேமிக்கும் செயல்முறையை நீங்கள் செல்ல வேண்டும்.
uk: Якщо ви зберегли ресурс ArrayMesh у файлі ``.res`` або ``.tres``, формат, який використовується у 4.0, несумісний із форматом, який використовується у 3.x. Вам потрібно буде знову пройти процес імпорту вихідного файлу сітки та зберегти його як ресурс ArrayMesh.
