Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.2.po
Languages: es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hant

source: Enum field ``BarrierMask.BARRIER_MASK_RASTER`` changes value from ``1`` to ``9``
es: Campo enum ``BarrierMask.BARRIER_MASK_RASTER`` cambia su valor de ``1`` a ``9``
fr: Le champ d'énumération ``BarrierMask. BARRIER_MASK_RASTER`` change de valeur de ``1`` à ``9``
ga: Athraíonn réimse enum ''BarrierMask.BARRIER_MASK_RASTER'' luach ó ''1'' go ''9''
it: Il campo di enumerazione ``BarrierMask.BARRIER_MASK_RASTER`` cambia il suo valore da ``1`` a ``9``
pt_br: O campo Enum ``BarrierMask.BARRIER_MASK_RASTER`` altera o valor de ``1`` para ``9``
ru: Поле перечисления ``BarrierMask.BARRIER_MASK_RASTER`` изменяет значение с ``1`` на ``9``
ta: Enum புலம் `` bariermask.barrier_mask_raster`` `` 1`` முதல் `9`` வரை மதிப்பை மாற்றுகிறது
tr: ``BarrierMask.BARRIER_MASK_RASTER`` numaralandırmasının değeri, ``1``'den ``9``'a değişti
uk: Поле Enum ``BarrierMask.BARRIER_MASK_RASTER`` змінює значення з ``1`` на ``9``
zh_hant: 列舉欄位 ``BarrierMask.BARRIER_MASK_RASTER`` 的值由 ``1`` 改為 ``9``

source: Enum field ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` changes value from ``7`` to ``32767``
es: Campo enum ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` cambia su valor de ``7`` a ``32767``
fr: Le champ d'énumération ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` change de valeur de ``7`` à ``32767``
ga: Athraíonn réimse enum ''BarrierMask.BARRIER_MASK_ALL_BARRIERS'' luach ó ''7'' go ''32767''
it: Il campo di enumerazione ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` cambia il suo valore da ``7`` a ``32767``
pt_br: O campo Enum ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` altera o valor de ``7`` para ``32767``
ru: Поле перечисления ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` изменяет значение с ``7`` на ``32767``
ta: Enum புலம் `` bariermask.barrier_mask_all_barriers`` `` 7`` இலிருந்து `` 32767`` க்கு மதிப்பை மாற்றுகிறது
tr: ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` numaralandırmasının değeri ``7``'den ``32767``'ye değiştirildi
uk: Поле Enum ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` змінює значення з ``7`` на ``32767``
zh_hant: 列舉欄位 ``BarrierMask.BARRIER_MASK_ALL_BARRIERS`` 的值由 ``7`` 改為 ``32767``

source: Enum field ``BarrierMask.BARRIER_MASK_NO_BARRIER`` changes value from ``8`` to ``32768``
es: Campo enum ``BarrierMask.BARRIER_MASK_NO_BARRIER`` cambia su valor de ``8`` a ``32768``
fr: Le champ d'énumération ``BarrierMask.BARRIER_MASK_NO_BARRIER`` change de valeur de ``8`` à ``32768``
ga: Athraíonn réimse enum ''BarrierMask.BARRIER_MASK_NO_BARRIER'' luach ó ''8'' go ''32768''
it: Il campo di enumerazione ``BarrierMask.BARRIER_MASK_NO_BARRIER`` cambia il suo valore da ``8`` a ``32768``
pt_br: O campo Enum ``BarrierMask.BARRIER_MASK_NO_BARRIER`` altera o valor de ``8`` para ``32768``
ru: Поле перечисления ``BarrierMask.BARRIER_MASK_NO_BARRIER`` изменяет значение с ``8`` на ``32768``
ta: Enum புலம் `` bariermask.barrier_mask_no_barrier`` `8`` முதல்` 32768`` வரை மதிப்பை மாற்றுகிறது
tr: ``BarrierMask.BARRIER_MASK_NO_BARRIER`` numaralandırmasının değeri ``8``'den ``32768``'e değiştirildi
uk: Поле Enum ``BarrierMask.BARRIER_MASK_NO_BARRIER`` змінює значення з ``8`` на ``32768``
zh_hant: 列舉欄位 ``BarrierMask.BARRIER_MASK_NO_BARRIER`` 的值由 ``8`` 改為 ``32768``

source: Method ``shader_create_from_bytecode`` adds a new ``placeholder_rid`` optional parameter
es: Método ``shader_create_from_bytecode`` agrega un nuevo parámetro opcional ``placeholder_rid``
fr: La méthode ``shader_create_from_bytecode`` ajoute un nouveau paramètre optionnel ``placeholder_rid``
ga: Cuireann an modh ''shader_create_from_bytecode'' paraiméadar roghnach nua ''placeholder_rid'' leis
it: Il metodo ``shader_create_from_bytecode`` aggiunge un nuovo parametro facoltativo ``placeholder_rid``
pt_br: Adicionado novo parâmetro opcional ``placeholder_rid`` ao método ``shader_create_from_bytecode``
ru: Метод ``shader_create_from_bytecode`` добавляет новый необязательный параметр ``placeholder_rid``
ta: முறை `` shader_create_from_bytecode`` புதிய `` பிளேச்ஓல்டர்_ரிட்`` விருப்ப அளவுருவைச் சேர்க்கிறது
tr: ``shader_create_from_bytecode`` yöntemi, yeni bir ``placeholder_rid`` isteğe bağlı parametresi ekledi
uk: Метод ``shader_create_from_bytecode`` додає новий необов’язковий параметр ``placeholder_rid``
zh_hant: 方法 ``shader_create_from_bytecode`` 新增了 ``placeholder_rid`` 選用參數

source: Method ``shader_get_vertex_input_attribute_ask`` changes return type from ``uint32`` to ``uint64``
es: Método ``shader_get_vertex_input_attribute_ask`` cambia el tipo de retorno de ``uint32`` a ``uint64``
fr: La méthode ``shader_get_vertex_input_attribute_ask`` change de type de retour de ``uint32`` à ``uint64``
ga: Athraíonn an modh ''shader_get_vertex_input_attribute_ask'' cineál fillte ó ''uint32'' go ''uint64''
it: Il metodo ``shader_get_vertex_input_attribute_ask`` cambia il tipo restituito da ``uint32`` a ``uint64``
pt_br: Alterado o tipo de retorno do método ``shader_get_vertex_input_attribute_ask`` de ``uint32`` para ``uint64``
ru: Метод ``shader_get_vertex_input_attribute_ask`` изменяет тип возвращаемого значения с ``uint32`` на ``uint64``
ta: முறை `` shader_get_vertex_input_attribute_ask`` மாற்றத்தை `` uint32`` இலிருந்து `` uint64`` க்கு மாற்றுகிறது
tr: ``shader_get_vertex_input_attribute_ask`` yöntemi, dönüş tipini ``uint32``'den ``uint64``'e değiştirdi
uk: Метод shader_get_vertex_input_attribute_ask змінює тип повернення з uint32 на uint64
zh_hant: 方法 ``shader_get_vertex_input_attribute_ask`` 的回傳型別由 ``uint32`` 改為 ``uint64``

source: **SurfaceTool**
ga: **Dromchla**
uk: **Інструмент SurfaceTool**
zh_hant: 建立內容

source: Method ``commit`` changes ``flags`` parameter type from ``uint32`` to ``uint64``
es: Método ``commit`` cambia el tipo del parámetro ``flags`` de ``uint32`` a ``uint64``
fr: La méthode ``commit`` change le type de paramètre ``flags`` de ``uint32`` à ``uint64``
ga: Athraíonn an modh ''commit'' cineál paraiméadar ''bratacha'' ó ''uint32'' go ''uint64''
it: Il metodo ``commit`` cambia il tipo del parametro ``flags`` da ``uint32`` a ``uint64``
pt_br: Alterado o tipo do parâmetro ``flags`` do método ``commit`` de ``uint32`` para ``uint64``
ru: Метод ``commit`` изменяет тип параметра у ``flags`` с ``uint32`` на ``uint64``
ta: முறை `` கமிட்`` `` கொடிகள்` `அளவுரு வகையை` `uint32`` இலிருந்து` `uint64`` க்கு மாற்றுகிறது
tr: ``commit`` yöntemi, ``flags`` parametre tipini ``uint32``'den ``uint64``'e değiştirdi
uk: Метод ``commit`` змінює тип параметра ``flags`` з ``uint32`` на ``uint64``
zh_hant: 方法 ``commit`` 的 ``flags`` 參數型別由 ``uint32`` 改為 ``uint64``

source: Text
fr: Texte
ga: Téacs
it: Testo
ru: Текст
ta: உரை
uk: текст
zh_hant: 文字

source: **Font**
es: **Fuente**
ga: **Cló**
pt_br: **Fonte**
ta: ** எழுத்துரு **
uk: **Шрифт**
zh_hant: **字型**

source: Method ``set_fallbacks`` replaced with ``fallbacks`` property
es: Método ``set_fallbacks`` reemplazado con la propiedad ``fallbacks``
fr: La méthode ``set_fallbacks`` a été remplacée par la propriété ``fallbacks``
ga: Cuirtear an modh ""set_fallbacks"" in ionad na maoine ""fallbacks""
it: Il metodo ``set_fallbacks`` è stato sostituito dalla proprietà ``fallbacks``
pt_br: Método ``set_fallbacks`` substituído pela propriedade ``fallbacks``
ru: Метод ``set_fallbacks`` заменен на свойство ``fallbacks``
ta: முறை `` set_falbacks`` `` குறைவுகள்` சொத்து மூலம் மாற்றப்பட்டது
tr: ``set_fallbacks`` yöntemi, ``fallbacks`` özelliği ile değiştirildi
uk: Метод ``set_fallbacks`` замінено на властивість ``fallbacks``
zh_hant: 方法 ``set_fallbacks`` 已被 ``fallbacks`` 屬性取代

source: Method ``get_fallbacks`` replaced with ``fallbacks`` property
es: método ``get_fallbacks`` reemplazado con la propiedad ``fallbacks``
fr: La méthode ``get_fallbacks`` a été remplacée par la propriété ``fallbacks``
ga: Cuirtear maoin 'cúltaca' in ionad an mhodha ""get_fallbacks""
it: Il metodo ``get_fallbacks`` è stato sostituito dalla proprietà ``fallbacks``
pt_br: Método ``get_fallbacks`` substituído pela propriedade ``fallbacks``
ru: Метод ``get_fallbacks`` заменен на свойство ``fallbacks``
ta: முறை `` get_falbacks`` `` குறைவுகள்` சொத்து மூலம் மாற்றப்பட்டது
tr: ``get_fallbacks`` yöntemi, ``fallbacks`` özelliği ile değiştirildi
uk: Метод ``get_fallbacks`` замінено властивістю ``fallbacks``
zh_hant: 方法 ``get_fallbacks`` 已被 ``fallbacks`` 屬性取代

source: Method ``find_variation`` adds new ``spacing_top``, ``spacing_bottom``, ``spacing_space``, and ``spacing_glyph`` optional parameters
es: Método ``find_variation`` agrega nuevos parámetros opcionales ``spacing_top``, ``spacing_bottom``, ``spacing_space``, y ``spacing_glyph``
fr: La méthode ``find_variation`` ajoute de nouveaux paramètres optionnels ``spacing_top``, ``spacing_bottom``, ``spacing_space`` et ``spacing_glyph``
ga: Cuireann an modh ''find_variation'' paraiméadair roghnacha nua ''spacing_top'', ''spacing_bottom'', ''spacing_space'', agus ''spacing_glyph''
it: Il metodo ``find_variation`` aggiunge nuovi parametri facoltativi ``spacing_top``, ``spacing_bottom``, ``spacing_space`` e ``spacing_glyph``
pt_br: Adicionado novos parâmetros opcionais ``spacing_top``, ``spacing_bottom``, ``spacing_space`` e ``spacing_glyph`` ao método ``find_variation``
ru: У метода ``find_variation`` добавлены новые опциональные (``spacing_glyph``) и не опциональные (``spacing_top``, ``spacing_bottom``, ``spacing_space``
ta: முறை `` find_variation`` புதிய `` இடைவெளி_டோப்``, `` இடைவெளி_பொட்டோம்``, `` இடைவெளி_ச்பேச்``, மற்றும் `` இடைவெளி_க்ளிஃபி` விருப்ப அளவுருக்கள் ஆகியவற்றைச் சேர்க்கிறது
tr: ``find_variation`` yöntemi, yeni ``spacing_top``, ``spacing_bottom``, ``spacing_space`` ve ``spacing_glyph`` isteğe bağlı parametrelerini ekledi
uk: Метод ``find_variation`` додає нові додаткові параметри ``spacing_top``, ``spacing_bottom``, ``spacing_space`` і ``spacing_glyph``
zh_hant: 方法 ``find_variation`` 新增了 ``spacing_top``、``spacing_bottom``、``spacing_space``、以及 ``spacing_glyph`` 選用參數

source: GraphEdit
ga: GrafCuir in Eagar
ta: எழுதுதல்
uk: Редагування графіка

source: **GraphEdit**
ga: **GrafEdit**
ta: ** எழுதுங்கள் **
uk: **Редагування графіка**
zh_hant: **圖形編輯器（GraphEdit）**

source: Property ``arrange_nodes_button_hidden`` renamed to ``show_arrange_button``
es: Propiedad ``arrange_nodes_button_hidden`` renombrada a ``show_arrange_button``
fr: Propriété ``arrange_nodes_button_hidden`` renommée en ``show_arrange_button``
ga: Athainmníodh maoin ''arrange_nodes_button_hidden'' go ''show_arrange_button''
it: La proprietà ``arrange_nodes_button_hidden`` è stata rinominata in ``show_arrange_button``
pt_br: Propriedade ``arrange_nodes_button_hidden`` renomeada para ``show_arrange_button``
ru: Свойство ``arrange_nodes_button_hidden`` переименовано в ``show_arrange_button``
ta: சொத்து `` arrange_nodes_button_hidden`` `` show_arrange_button`` என மறுபெயரிடப்பட்டது
tr: ``arrange_nodes_button_hidden`` özelliğinin adı ``show_arrange_button`` olarak değiştirildi
uk: Властивість ``arrange_nodes_button_hidden`` перейменовано на ``show_arrange_button``
zh_hant: 屬性 ``arrange_nodes_button_hidden`` 已更名為 ``show_arrange_button``

source: Method ``get_zoom_hbox`` renamed to ``get_menu_hbox``
es: Método ``get_zoom_hbox`` renombrado a ``get_menu_hbox``
fr: Méthode ``get_zoom_hbox`` renommée en ``get_menu_hbox``
ga: Modh ''get_zoom_hbox'' a athainmníodh go ''get_menu_hbox''
it: La proprietà ``get_zoom_hbox`` è stata rinominata in ``get_menu_hbox``
pt_br: Método ``get_zoom_hbox`` renomeado para ``get_menu_hbox``
ru: Метод ``get_zoom_hbox`` переименован в ``get_menu_hbox``
ta: முறை `` get_zoom_hbox``` `get_menu_hbox`` என மறுபெயரிடப்பட்டது
tr: ``get_zoom_hbox`` yöntemi, ``get_menu_hbox`` olarak yeniden adlandırıldı
uk: Метод ``get_zoom_hbox`` перейменовано на ``get_menu_hbox``
zh_hant: 方法 ``get_zoom_hbox`` 已更名為 ``get_menu_hbox``

source: Property ``snap_distance`` renamed to ``snapping_distance``
es: Propiedad ``snap_distance`` renombrada a ``snapping_distance``
fr: Propriété ``snap_distance`` renommée en ``snapping_distance``
ga: Athainmníodh maoin ''snap_distance'' go ''snapping_distance''
it: La proprietà ``snap_distance`` è stata rinominata in ``snapping_distance``
pt_br: Propriedade ``snap_distance`` renomeada para ``snapping_distance``
ru: Свойство ``snap_distance`` переименовано в ``snapping_distance``
ta: சொத்து `` snap_distance`` `` ச்னாப்பிங்_டிச்டன்ச்`
tr: ``snap_distance`` özelliğinin adı ``snapping_distance`` olarak değiştirildi
uk: Властивість snap_distance перейменовано на snapping_distance
zh_hant: 屬性 ``snap_distance`` 已更名為 ``snapping_distance``

source: Property ``use_snap`` renamed to ``snapping_enabled``
es: Propiedad ``use_snap`` renombrada a ``snapping_enabled``
fr: Propriété ``use_snap`` renommée en ``snapping_enabled``
ga: Maoin ''use_snap'' a athainmníodh go ''snapping_enabled''
it: La proprietà ``use_snap`` è stata rinominata in ``snapping_enabled``
pt_br: Propriedade ``use_snap`` renomeada para ``snapping_enabled``
ru: Свойство ``use_snap`` переименовано в ``snapping_enabled``
ta: சொத்து `` use_snap`` `` ச்னாப்பிங்_இனாபே்ட்`
tr: ``use_snap`` özelliğinin adı ``snapping_enabled`` olarak değiştirildi
uk: Властивість ``use_snap`` перейменовано на ``snapping_enabled``
zh_hant: 屬性 ``use_snap`` 已更名為 ``snapping_enabled``

source: **GraphNode**
ga: **GrafNode**
ta: ** வரைபடம் **
uk: **Вузол графіка**
zh_hant: **圖形節點（GraphNode）**

source: Property ``comment`` removed
es: Propiedad ``comment`` removida
fr: Propriété``comment`` retirée
ga: Maoin ''comment'' bainte
it: Proprietà ``comment`` rimossa
pt_br: Propriedade ``comment`` removida
ru: Свойство ``comment`` удалено
ta: சொத்து `` கருத்து`` அகற்றப்பட்டது
tr: ``comment`` özelliği kaldırıldı
uk: Властивість ``comment`` видалено
zh_hant: 屬性 ``comment`` 已移除

source: Signal ``close_request`` renamed to ``delete_request`` and moved to base class ``GraphElement``
es: Señal ``close_request`` renombrada a ``delete_request`` y movida a la clase base ``GraphElement``
fr: Le signal ``close_request`` a été renommé ``delete_request`` et déplacé dans la classe parente ``GraphElement``
ga: Comhartha ''close_request'' a athainmníodh go ''delete_request'' agus bhog sé go dtí an bunrang ''GraphElement''
it: Il segnale ``close_request`` è stato rinominato in ``delete_request`` e spostato nella classe base ``GraphElement``
pt_br: Sinal ``close_request`` renomeado para ``delete_request`` e movido para a classe base ``GraphElement``
ru: Сигнал ``close_request`` переименован в ``delete_request`` и перемещен в базовый класс ``GraphElement``
ta: சமிக்ஞை `` Close_request`` `` delete_request`` என மறுபெயரிடப்பட்டு அடிப்படை வகுப்பிற்கு `` கிராஃப்ளெமென்ட்`` க்கு மாற்றப்பட்டது
tr: ``close_request`` sinyali, ``delete_request`` olarak yeniden adlandırıldı ve ``GraphElement`` temel sınıfına taşındı
uk: Сигнал ``close_request`` перейменовано на ``delete_request`` і переміщено до базового класу ``GraphElement``
zh_hant: 訊號 ``close_request`` 已更名為 ``delete_request``，並移至基底類別 ``GraphElement``

source: Property ``draggable`` moved to base class ``GraphElement``
es: Propiedad ``draggable`` movida a la clase base ``GraphElement``
fr: La propriété ``draggable`` a été déplacée dans la classe parente ``GraphElement``
ga: Aistríodh maoin ''draggable'' go bunaicme ''GraphElement''
it: La proprietà ``draggable`` è stata spostata nella classe base ``GraphElement``
pt_br: Propriedade ``draggable`` movida para a classe base ``GraphElement``
ru: Свойство ``draggable`` перемещено в базовый класс ``GraphElement``
ta: சொத்து `` இழுக்கக்கூடிய`` அடிப்படை வகுப்பு `` கிராஃப்ளெமென்ட்`` க்கு மாற்றப்பட்டது
tr: ``draggable`` özelliği, ``GraphElement`` temel sınıfına taşındı
uk: Властивість ``draggable`` перенесено до базового класу ``GraphElement``
zh_hant: 屬性 ``draggable`` 已移至基底類別 ``GraphElement``

source: Signal ``dragged`` moved to base class ``GraphElement``
es: Señal ``dragged`` movida a la clase base ``GraphElement``
fr: Le signal ``dragged`` a été déplacée dans la classe parente ``GraphElement``
ga: Comhartha ''dragged'' aistrithe go dtí an bunrang ''GraphElement''
it: Il segnale ``dragged`` è stato spostato nella classe base ``GraphElement``
pt_br: Sinal ``dragged`` movido para a classe base ``GraphElement``
ru: Сигнал ``dragged`` перемещен в базовый класс ``GraphElement``
ta: சமிக்ஞை `` இழுக்கப்பட்டது`` அடிப்படை வகுப்பு `` கிராஃப்ளெமென்ட்`` க்கு மாற்றப்பட்டது
tr: ``dragged`` sinyali, ``GraphElement`` temel sınıfına taşındı
uk: Перетягнутий сигнал перенесено до базового класу GraphElement
zh_hant: 訊號 ``dragged`` 已移至基底類別 ``GraphElement``

source: Method ``get_connection_input_color`` removed
es: Método ``get_connection_input_color`` removido
fr: Méthode``get_connection_input_color`` retirée
ga: Modh ''get_connection_input_color'' bainte
it: Metodo ``get_connection_input_color`` rimosso
pt_br: Método ``get_connection_input_color`` removido
ru: Метод ``get_connection_input_color`` удален
ta: முறை `` get_connection_input_color`` அகற்றப்பட்டது
tr: ``get_connection_input_color`` yöntemi kaldırıldı
uk: Метод ``get_connection_input_color`` видалено
zh_hant: 方法 ``get_connection_input_color`` 已移除

source: Method ``get_connection_input_count`` removed
es: Método ``get_connection_input_count`` removido
fr: Méthode``get_connection_input_count`` retirée
ga: Modh ''get_connection_input_count'' bainte
it: Metodo ``get_connection_input_count`` rimosso
pt_br: Método ``get_connection_input_count`` removido
ru: Метод ``get_connection_input_count`` удален
ta: முறை `` get_connection_input_count`` அகற்றப்பட்டது
tr: ``get_connection_input_count`` yöntemi kaldırıldı
uk: Метод ``get_connection_input_count`` видалено
zh_hant: 方法 ``get_connection_input_count`` 已移除

source: Method ``get_connection_input_height`` removed
es: Método ``get_connection_input_height`` removido
fr: Méthode``get_connection_input_height`` retirée
ga: Modh ''get_connection_input_height'' bainte
it: Metodo ``get_connection_input_height`` rimosso
pt_br: Método ``get_connection_input_height`` removido
ru: Метод ``get_connection_input_height`` удален
ta: முறை `` get_connection_input_height`` அகற்றப்பட்டது
tr: ``get_connection_input_height`` yöntemi kaldırıldı
uk: Метод ``get_connection_input_height`` видалено
zh_hant: 方法 ``get_connection_input_height`` 已移除

source: Method ``get_connection_input_position`` removed
es: Método ``get_connection_input_position`` removido
fr: Méthode``get_connection_input_position`` retirée
ga: Modh ''get_connection_input_position'' bainte
it: Metodo ``get_connection_input_position`` rimosso
pt_br: Método ``get_connection_input_position`` removido
ru: Метод ``get_connection_input_position`` удален
ta: முறை `` get_connection_input_position`` அகற்றப்பட்டது
tr: ``get_connection_input_position`` yöntemi kaldırıldı
uk: Метод ``get_connection_input_position`` видалено
zh_hant: 方法 ``get_connection_input_position`` 已移除

source: Method ``get_connection_input_slot`` removed
es: Método ``get_connection_input_slot`` removido
fr: Méthode``get_connection_input_slot`` retirée
ga: Modh ''get_connection_input_slot'' bainte
it: Metodo ``get_connection_input_slot`` rimosso
pt_br: Método ``get_connection_input_slot`` removido
ru: Метод ``get_connection_input_slot`` удален
ta: முறை `` get_connection_input_slot`` அகற்றப்பட்டது
tr: ``get_connection_input_slot`` yöntemi kaldırıldı
uk: Метод ``get_connection_input_slot`` видалено
zh_hant: 方法 ``get_connection_input_slot`` 已移除

source: Method ``get_connection_input_type`` removed
es: Método ``get_connection_input_type`` removido
fr: Méthode ``get_connection_input_type`` retirée
ga: Modh ''get_connection_input_type'' bainte
it: Metodo ``get_connection_input_type`` rimosso
pt_br: Método ``get_connection_input_type`` removido
ru: Метод ``get_connection_input_type`` удален
ta: முறை `` get_connection_input_type`` அகற்றப்பட்டது
tr: ``get_connection_input_type`` yöntemi kaldırıldı
uk: Метод ``get_connection_input_type`` видалено
zh_hant: 方法 ``get_connection_input_type`` 已移除

source: Method ``get_connection_output_color`` removed
es: Método ``get_connection_output_color`` removido
fr: Méthode``get_connection_output_color`` retirée
ga: Modh ''get_connection_output_color'' bainte
it: Metodo ``get_connection_output_color`` rimosso
pt_br: Método ``get_connection_output_color`` removido
ru: Метод ``get_connection_output_color`` удален
ta: முறை `` get_connection_output_color`` அகற்றப்பட்டது
tr: ``get_connection_output_color`` yöntemi kaldırıldı
uk: Метод ``get_connection_output_color`` видалено
zh_hant: 方法 ``get_connection_output_color`` 已移除

source: Method ``get_connection_output_count`` removed
es: Método ``get_connection_output_count`` removido
fr: Méthode ``get_connection_output_count`` retirée
ga: Modh ''get_connection_output_count'' bainte
it: Metodo ``get_connection_output_count`` rimosso
pt_br: Método ``get_connection_output_count`` removido
ru: Метод ``get_connection_output_count`` удален
ta: முறை `` get_connection_output_count`` அகற்றப்பட்டது
tr: ``get_connection_output_count`` yöntemi kaldırıldı
uk: Метод ``get_connection_output_count`` видалено
zh_hant: 方法 ``get_connection_output_count`` 已移除

source: Method ``get_connection_output_height`` removed
es: Método ``get_connection_output_height`` removido
fr: Méthode``get_connection_output_height`` retirée
ga: Modh ''get_connection_output_height'' bainte
it: Metodo ``get_connection_output_height`` rimosso
pt_br: Método ``get_connection_output_height`` removido
ru: Метод ``get_connection_output_height`` удален
ta: முறை `` get_connection_output_height`` அகற்றப்பட்டது
tr: ``get_connection_output_height`` yöntemi kaldırıldı
uk: Метод ``get_connection_output_height`` видалено
zh_hant: 方法 ``get_connection_output_height`` 已移除

source: Method ``get_connection_output_position`` removed
es: Método ``get_connection_output_position`` removido
fr: Méthode ``get_connection_output_position`` retirée
ga: Modh ''get_connection_output_position'' bainte
it: Metodo ``get_connection_output_position`` rimosso
pt_br: Método ``get_connection_output_position`` removido
ru: Метод ``get_connection_output_position`` удален
ta: முறை `` get_connection_output_position`` அகற்றப்பட்டது
tr: ``get_connection_output_position`` yöntemi kaldırıldı
uk: Метод ``get_connection_output_position`` видалено
zh_hant: 方法 ``get_connection_output_position`` 已移除

source: Method ``get_connection_output_slot`` removed
es: Método ``get_connection_output_slot`` removido
fr: Méthode ``get_connection_output_slot`` retirée
ga: Modh ''get_connection_output_slot'' bainte
it: Metodo ``get_connection_output_slot`` rimosso
pt_br: Método ``get_connection_output_slot`` removido
ru: Метод ``get_connection_output_slot`` удален
ta: முறை `` get_connection_output_slot`` அகற்றப்பட்டது
tr: ``get_connection_output_slot`` yöntemi kaldırıldı
uk: Метод ``get_connection_output_slot`` видалено
zh_hant: 方法 ``get_connection_output_slot`` 已移除

source: Method ``get_connection_output_type`` removed
es: Método ``get_connection_output_type`` removido
fr: Méthode ``get_connection_output_type`` retirée
ga: Modh ''get_connection_output_type'' bainte
it: Metodo ``get_connection_output_type`` rimosso
pt_br: Método ``get_connection_output_type`` removido
ru: Метод ``get_connection_output_type`` удалён
ta: முறை `` get_connection_output_type`` அகற்றப்பட்டது
tr: ``get_connection_output_type`` yöntemi kaldırıldı
uk: Метод ``get_connection_output_type`` видалено
zh_hant: 方法 ``get_connection_output_type`` 已移除

source: Property ``language`` removed
es: Propiedad ``language`` removida
fr: Propriété ``language`` retirée
ga: Maoin ''teanga'' bainte
it: Proprietà ``language`` rimossa
pt_br: Propriedade ``language`` removida
ru: Свойство ``language`` удалено
ta: சொத்து `` மொழி`` அகற்றப்பட்டது
tr: ``language`` özelliği kaldırıldı
uk: Властивість ``мова`` видалено
zh_hant: 屬性 ``language`` 已移除
