Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.3.po
Languages: es, fr, it, pt_br, ru, ta, uk, zh_cn, zh_hant

source: To maximize compatibility, this new storage format will only be enabled for resources and scenes that contain large PackedByteArrays for now. Support for this new format will also be added in patch updates for older versions of Godot. Once all supported Godot versions are able to read the new format, we will gradually retire the compatibility measures and have all resources and scenes use the new storage format.
es: Para maximizar la compatibilidad, este nuevo formato de almacenamiento solo estará disponible por ahora para recursos y escenas que contengan PackedByteArrays grandes. También se añadirá compatibilidad con este nuevo formato en las actualizaciones de parches para versiones anteriores de Godot. Una vez que todas las versiones compatibles de Godot puedan leer el nuevo formato, retiraremos gradualmente las medidas de compatibilidad y todos los recursos y escenas utilizarán el nuevo formato de almacenamiento.
fr: Afin de maximiser la compatibilité, ce nouveau format de stockage ne sera activé que pour les ressources et les scènes qui contiennent de grands PackedByteArrays. Le support pour ce nouveau format sera également ajouté dans les mises à jour de patch pour les anciennes versions de Godot. Une fois que toutes les versions supportées de Godot seront en mesure de lire le nouveau format, nous allons graduellement retirer les mesures de compatibilité et avoir toutes les ressources et les scènes qui utilisent le nouveau format de stockage.
it: Per massimizzare la compatibilità, per ora questo nuovo formato di archiviazione sarà abilitato solo per risorse e scene che contengono PackedByteArray di grandi dimensioni. Il supporto per questo nuovo formato verrà aggiunto anche negli aggiornamenti patch per le versioni precedenti di Godot. Non appena tutte le versioni di Godot supportate saranno in grado di leggere il nuovo formato, ritireremo gradualmente le misure di compatibilità e faremo in modo che tutte le risorse e le scene utilizzino il nuovo formato di archiviazione.
pt_br: Para maximizar a compatibilidade, este novo formato de armazenamento será habilitado somente para recursos e cenas que contenham PackedByteArrays grandes, por enquanto. O suporte para este novo formato também será adicionado em atualizações de patch para versões mais antigas do Godot. Assim que todas as versões suportadas do Godot puderem ler o novo formato, descontinuaremos gradualmente as medidas de compatibilidade e faremos com que todos os recursos e cenas usem o novo formato de armazenamento.
ru: Для максимальной совместимости этот новый формат хранения будет включен только для ресурсов и сцен, которые содержат большие PackedByteArrays на данный момент. Поддержка этого нового формата также будет добавлена в обновления патчей для старых версий Godot. Как только все поддерживаемые версии Godot смогут читать новый формат, мы постепенно отменим меры совместимости и заставим все ресурсы и сцены использовать новый формат хранения.
ta: பொருந்தக்கூடிய தன்மையை அதிகரிக்க, இந்த புதிய சேமிப்பக வடிவம் வளங்கள் மற்றும் காட்சிகளுக்கு மட்டுமே இயக்கப்படும். இந்த புதிய வடிவமைப்பிற்கான உதவி கோடோட்டின் பழைய பதிப்புகளுக்கான ஒட்டு புதுப்பிப்புகளிலும் சேர்க்கப்படும். அனைத்து ஆதரிக்கப்பட்ட கோடோட் பதிப்புகளும் புதிய வடிவமைப்பைப் படிக்க முடிந்ததும், நாங்கள் படிப்படியாக பொருந்தக்கூடிய நடவடிக்கைகளை ஓய்வு பெறுவோம், மேலும் அனைத்து வளங்களும் காட்சிகளும் புதிய சேமிப்பக வடிவமைப்பைப் பயன்படுத்துவோம்.
uk: Щоб максимально підвищити сумісність, цей новий формат зберігання поки що буде ввімкнено лише для ресурсів і сцен, які містять великі PackedByteArrays. Підтримку цього нового формату також буде додано в оновленнях для старих версій Godot. Щойно всі підтримувані версії Godot зможуть читати новий формат, ми поступово припиняємо заходи щодо сумісності, а всі ресурси та сцени використовуватимуть новий формат зберігання.
zh_cn: 为了最大限度地提高兼容性，目前这个新的存储格式将仅针对包含大型 `PackedByteArray` 的资源和场景启用。对于旧版本的 Godot，我们也会在补丁更新中添加对这个新格式的支持。一旦所有受支持的 Godot 版本都能够读取新格式，我们将逐步淘汰兼容性措施，并让所有资源和场景都使用新的存储格式。
zh_hant: 為了最大化相容性，目前僅對包含大量 PackedByteArray 的資源與場景啟用這個新儲存格式。未來此格式也會陸續回補至舊版 Godot 的修補更新中。待所有支援中的 Godot 版本都能讀取新格式後，將逐步淘汰相容性措施，讓所有資源與場景都採用新格式。

source: In C#, the ``Transform3D.InterpolateWith`` implementation was fixed to use the right order of operations, applying the rotation before the scale (`GH-89843`_).
es: En C#, se corrigió la implementación de ``Transform3D.InterpolateWith`` para usar el orden correcto de operaciones, aplicando la rotación antes de la escala (`GH-89843`_).
fr: En C#, l'implémentation de ``Transform3D.InterpolateWith`` a été corrigée pour utiliser le bon ordre des opérations, en appliquant la rotation avant l'échelle (`GH-89843`_).
it: In C#, l'implementazione di ``Transform3D.InterpolateWith`` è stata corretta per utilizzare l'ordine corretto delle operazioni, applicando la rotazione prima della scala (`GH-89843`_).
pt_br: Em C#, a implementação ``Transform3D.InterpolateWith`` foi corrigida para usar a ordem correta das operações, aplicando a rotação antes da escala (`GH-89843`_).
ru: В C# реализация ``Transform3D.InterpolateWith`` была исправлена для использования правильного порядка операций, применяя поворот перед масштабированием (`GH-89843`_).
ta: சி#இல், `` டிரான்ச்ஃபார்ம் 3 டி.
uk: У C# реалізацію ``Transform3D.InterpolateWith`` було виправлено для використання правильного порядку операцій із застосуванням обертання перед масштабом (`GH-89843`_).
zh_cn: 在 C# 中， ``Transform3D.InterpolateWith`` 的实现已修复为使用正确的操作顺序，在缩放之前应用旋转（`GH-89843`_\）。
zh_hant: 於 C# 中，``Transform3D.InterpolateWith`` 的實作已修正為先進行旋轉、再進行縮放的正確運算順序（詳見 `GH-89843`_）。

source: In C#, the ``Aabb.GetSupport`` implementation was fixed to properly return the support vector (`GH-88919`_).
es: En C#, se corrigió la implementación de ``Aabb.GetSupport`` para devolver correctamente el vector de soporte (`GH-88919`_).
fr: En C#, l'implémentation de ``Aabb.GetSupport`` a été corrigée pour renvoyer correctement le vecteur support (`GH-88919`_).
it: In C#, l'implementazione di ``Aabb.GetSupport`` è stata corretta per restituire correttamente il vettore di supporto (`GH-88919`_).
pt_br: Em C#, a implementação ``Aabb.GetSupport`` foi corrigida para retornar corretamente o vetor de suporte (`GH-88919`_).
ru: В C# реализация ``Aabb.GetSupport`` была исправлена для правильного возврата вектора поддержки (`GH-88919`_).
ta: சி#இல், உதவி திசையனை (`சிஎச் -88919`_) சரியாக திருப்பித் தர` `aabb.getsupport`` செயல்படுத்தல் நிர்ணயிக்கப்பட்டது.
uk: У C# реалізацію ``Aabb.GetSupport`` було виправлено для належного повернення вектора підтримки (`GH-88919`_).
zh_cn: 在 C# 中，修复了 ``Aabb.GetSupport`` 的实现，以正确返回支持向量（`GH-88919`_\）。
zh_hant: 於 C# 中，``Aabb.GetSupport`` 的實作已修正，現在能正確回傳支撐向量（詳見 `GH-88919`_）。

source: In C#, the Variant types' ``ToString`` implementation now defaults to using the ``InvariantCulture`` (`GH-89547`_) which means ``Vector2(1.2, 3.4)`` is formatted using ``.`` as the decimal separator independently of the language of the operating system that the program is running on.
es: En C#, la implementación de ``ToString`` de los tipos Variant ahora utiliza de manera predeterminada ``InvariantCulture`` (`GH-89547`_), lo que significa que ``Vector2(1.2, 3.4)`` se formatea utilizando ``.`` como separador decimal independientemente del idioma del sistema operativo en el que se ejecuta el programa.
fr: En C#, l'implémentation de ``ToString`` des types Variant utilise par défaut ``InvariantCulture`` (`GH-89547`_), ce qui signifie que ``Vector2(1.2, 3.4)`` est formaté en utilisant ``.`` comme séparateur décimal indépendamment de la langue du système d'exploitation sur lequel le programme s'exécute.
it: In C#, l'implementazione di ``ToString`` dei tipi Variant ora utilizza ``InvariantCulture`` (`GH-89547`_) come predefinito, il che significa che ``Vector2(1.2, 3.4)`` è formattato utilizzando ``.`` come separatore decimale, a prescindere dalla lingua del sistema operativo su cui è in esecuzione il programma.
pt_br: Em C#, a implementação ``ToString`` dos tipos Variant agora usa por padrão ``InvariantCulture`` (`GH-89547`_), o que significa que ``Vector2(1.2, 3.4)`` é formatado usando ``.`` como separador decimal, independentemente do idioma do sistema operacional no qual o programa está sendo executado.
ru: В C# реализация ``ToString`` типов Variant теперь по умолчанию использует ``InvariantCulture`` (`GH-89547`_), что означает, что ``Vector2(1.2, 3.4)`` форматируется с использованием ``.`` в качестве десятичного разделителя независимо от языка операционной системы, в которой запущена программа.
ta: சி#இல், மாறுபட்ட வகைகள் '`டோச்ட்ரிங்`` செயல்படுத்தல் இப்போது` `Qu-89547`_) பயன்படுத்துவதற்கு இயல்புநிலையாகிறது, அதாவது` `திசையன் 2 (1.2, 3.4)` `` `` `` `` `` .``' ``` ''` ``` இன் மொழிபெயர்ப்பில் பிரசவத்தில் பிரசகப்படுத்தும் அமைப்பைப் பயன்படுத்தி வடிவமைக்கப்பட்டுள்ளது.
uk: У C# реалізація ``ToString`` для типів варіантів тепер за замовчуванням використовує ``InvariantCulture`` (`GH-89547`_), що означає, що ``Vector2(1.2, 3.4)`` відформатовано з використанням ``.`` як десяткового розділювача незалежно від мови операційної системи, на якій працює програма.
zh_cn: 在 C# 中，Variant 类型的 ``ToString`` 实现现在默认使用 ``InvariantCulture`` （`GH-89547`_\），这意味着 ``Vector2(1.2, 3.4)`` 将使用 ``.`` 作为小数点分隔符进行格式化，而与程序运行的操作系统语言无关。
zh_hant: 於 C# 中，Variant 型別的 ``ToString`` 實作現在預設會使用 ``InvariantCulture``（詳見 `GH-89547`_），這代表像 ``Vector2(1.2, 3.4)`` 這樣的格式，無論作業系統語言為何，都會以 ``.`` 作為小數點分隔符。

source: ``AnimationMixer`` replaced its Capture mode with a new Capture feature that works much better than the old one, this replaces the existing cache (`GH-86715`_).
es: ``AnimationMixer`` reemplazó su modo de Captura con una nueva función de Captura que funciona mucho mejor que la anterior. Esta reemplaza la caché existente (`GH-86715`_).
fr: ``AnimationMixer`` a remplacé son mode Capture par une nouvelle fonctionnalité Capture qui fonctionne beaucoup mieux que l'ancienne, cela remplace le cache existant (`GH-86715`_).
it: ``AnimationMixer`` ha sostituito la sua modalità di cattura con una nuova funzionalità di cattura che funziona molto meglio di quella vecchia. Ciò sostituisce la cache esistente (`GH-86715`_).
pt_br: ``AnimationMixer`` substituiu seu modo de captura (Capture) por um novo recurso de captura que funciona muito melhor que o antigo, substituindo o cache existente (`GH-86715`_).
ru: ``AnimationMixer`` заменил свой режим захвата новой функцией захвата, которая работает намного лучше старой, она заменяет существующий кэш (`GH-86715`_).
ta: `` அனிமேசன்மிக்சர்`` அதன் பிடிப்பு பயன்முறையை புதிய பிடிப்பு அம்சத்துடன் மாற்றியமைத்தது, இது பழையதை விட மிகச் சிறப்பாக செயல்படுகிறது, இது தற்போதுள்ள தற்காலிக சேமிப்பை (`GH-86715`_) மாற்றுகிறது.
uk: ``AnimationMixer`` замінив свій режим захоплення новою функцією захоплення, яка працює набагато краще, ніж стара; вона замінює існуючий кеш (`GH-86715`_).
zh_cn: ``AnimationMixer`` 已将它的捕获（Capture） 模式替换为新的捕获 （Capture） 功能，该功能比旧版本效果更好，这取代了现有的缓存（`GH-86715`_\）。
zh_hant: ``AnimationMixer`` 的捕捉（Capture）模式已被全新設計的捕捉功能所取代，效能與可靠性都大幅提升，並且也取代了原有的快取機制（詳見 `GH-86715`_）。

source: ``AnimationNode`` has a reworked process for retrieving the semantic time info. This ensures that time-related behavior works as expected, but changes the blending behavior. Implementors of the ``_process`` virtual method should also note that this method is now deprecated and will be replaced by a new one in the future (`GH-87171`_).
es: ``AnimationNode`` cuenta con un proceso rediseñado para recuperar la información temporal semántica. Esto garantiza que el comportamiento temporal funcione correctamente, pero modifica el comportamiento de fusión. Los implementadores del método virtual ``_process`` deben tener en cuenta que este método está obsoleto y será reemplazado por uno nuevo en el futuro (`GH-87171`_).
fr: ``AnimationNode`` a un processus retravaillé pour récupérer les informations de temps sémantique. Cela garantit que le comportement lié au temps fonctionne comme prévu, mais modifie le comportement de mélange. Les implémenteurs de la méthode virtuelle ``_process`` doivent également noter que cette méthode est maintenant dépréciée et sera remplacée par une nouvelle à l`avenir (`GH-87171`_).
it: ``AnimationNode`` ha un procedimento rielaborato per il recupero delle informazioni semantiche sul tempo. Questo garantisce che il comportamento relativo al tempo funzioni come previsto, ma modifica il comportamento di fusione. Chi implementa il metodo virtuale ``_process`` deve inoltre tenere presente che questo metodo è ora deprecato e verrà sostituito da uno nuovo in futuro (`GH-87171`_).
pt_br: ``AnimationNode`` possui um processo reformulado para recuperar as informações de tempo semântico. Isso garante que o comportamento relacionado ao tempo funcione conforme o esperado, mas altera o comportamento de mesclagem. Os implementadores do método virtual ``_process`` também devem observar que este método está obsoleto e será substituído por um novo no futuro (`GH-87171`_).
ru: ``AnimationNode`` имеет переработанный процесс получения семантической информации о времени. Это гарантирует, что поведение, связанное со временем, работает так, как ожидается, но изменяет поведение смешивания. Разработчики виртуального метода ``_process`` также должны обратить внимание, что этот метод теперь устарел и в будущем будет заменен новым (`GH-87171`_).
ta: `` அனிமேசன்நோட்`` சொற்பொருள் நேர தகவலை மீட்டெடுப்பதற்கான மறுவேலை செய்யப்பட்ட செயல்முறையைக் கொண்டுள்ளது. நேரம் தொடர்பான நடத்தை எதிர்பார்த்தபடி செயல்படுவதை இது உறுதி செய்கிறது, ஆனால் கலப்பு நடத்தையை மாற்றுகிறது. `` _PROCESS`` மெய்நிகர் முறையின் செயல்படுத்துபவர்கள் இந்த முறை இப்போது நீக்கப்பட்டது என்பதையும் எதிர்காலத்தில் (`GH-87171`_) புதியவற்றால் மாற்றப்படும் என்பதையும் கவனத்தில் கொள்ள வேண்டும்.
uk: ``AnimationNode`` має перероблений процес для отримання інформації про семантичний час. Це гарантує, що поведінка, пов’язана з часом, працює належним чином, але змінює поведінку змішування. Розробникам віртуального методу ``_process`` також слід звернути увагу, що цей метод зараз застарів і буде замінений на новий у майбутньому (`GH-87171`_).
zh_cn: ``AnimationNode`` 重新设计了获取语义时间（semantic time）信息的过程。这确保了时间相关的行为能够按预期工作，但也改变了混合行为。实现 ``_process`` 虚方法的开发者还应注意，该方法现已弃用，未来将被新方法取代（`GH-87171`_\）。
zh_hant: ``AnimationNode`` 取得語意時間資訊的流程已重構。這確保與時間相關的行為能如預期運作，但也改變了混合（blending）行為。實作 ``_process`` 虛擬方法的開發者請注意，此方法已被標記為過時，未來將會有新方法取而代之（詳見 `GH-87171`_）。

source: More information about the changes to Animation can be found in the `Migrating Animations from Godot 4.0 to 4.3 <https://godotengine.org/article/migrating-animations-from-godot-4-0-to-4-3>`__ article.
fr: Plus d'informations sur les changements apportés à l'animation se trouvent dans l'article `Migrating Animations from Godot 4.0 to 4.3 <https://godotengine.org/article/migrating-animations-from-godot-4-0-to-4-3>`__.
it: Ulteriori informazioni sulle modifiche apportate ad Animation sono disponibili nell'articolo `Migrating Animations from Godot 4.0 to 4.3 <https://godotengine.org/article/migrating-animations-from-godot-4-0-to-4-3>`__.
ru: Более подробную информацию об изменениях в Анимации можно найти в статье `Перенос Анимации с Godot 4.0 на 4.3 <https://godotengine.org/article/migrating-animations-from-godot-4-0-to-4-3>`__.
ta: அனிமேசனுக்கான மாற்றங்கள் பற்றிய கூடுதல் தகவல்களை `கோடோட் 4.0 முதல் 4.3 வரை இடம்பெயரும் அனிமேசன்களில் <https://godotengine.org/article/migration-nimations- from-godot-4-0 to-4-3> __ __ கட்டுரை.
uk: Додаткову інформацію про зміни в анімації можна знайти в статті `Міграція анімації з Godot 4.0 на 4.3 <https://godotengine.org/article/migrating-animations-from-godot-4-0-to-4-3>`__.
zh_cn: 有关动画更改的更多信息，请参阅`将动画从 Godot 4.0 迁移到 4.3 <https://godotengine.org/article/migrating-animations-from-godot-4-0-to-4-3>`__ 文章。
zh_hant: 關於動畫相關變更的更多資訊，請參考《Migrating Animations from Godot 4.0 to 4.3 <https://godotengine.org/article/migrating-animations-from-godot-4-0-to-4-3>》。

source: The default font outline color was changed from white to black (`GH-54641`_).
es: El color del contorno de la fuente predeterminada se cambió de blanco a negro (`GH-54641`_).
fr: La couleur des contours de police par défaut a été changée de blanc à noir (`GH-54641`_).
it: Il colore predefinito del contorno dei font è stato cambiato da bianco a nero (`GH-54641`_).
pt_br: A cor do contorno da fonte padrão foi alterada de branco para preto (`GH-54641`_).
ru: Цвет контура шрифта по умолчанию был изменен с белого на черный (`GH-54641`_).
ta: இயல்புநிலை எழுத்துரு அவுட்லைன் வண்ணம் வெள்ளை நிறத்தில் இருந்து கருப்பு நிறமாக மாற்றப்பட்டது (`GH-54641`_).
uk: Стандартний колір контуру шрифту змінено з білого на чорний (`GH-54641`_).
zh_cn: 默认字体轮廓颜色从白色更改为黑色（`GH-54641`_\）。
zh_hant: 預設字型外框顏色已由白色改為黑色（詳見 `GH-54641`_）。

source: The ``auto_translate`` property is deprecated in favor of the ``auto_translate_mode`` property which is now in ``Node`` (`GH-87530`_). The default value for ``auto_translate_mode`` is ``AUTO_TRANSLATE_INHERIT``, which means nodes inherit the ``auto_translate_mode`` value from their parent. This means, existing nodes with the ``auto_translate`` property set to ``true`` may no longer be translated if they are children of a node with the ``auto_translate`` property set to ``false``.
es: La propiedad ``auto_translate`` ha quedado obsoleta y se ha sustituido por la propiedad ``auto_translate_mode``, que ahora se encuentra en ``Node`` (`GH-87530`_). El valor predeterminado de ``auto_translate_mode`` es ``AUTO_TRANSLATE_INHERIT``, lo que significa que los nodos heredan el valor de ``auto_translate_mode`` de su padre. Esto significa que los nodos existentes con la propiedad ``auto_translate`` establecida en ``true`` ya no podrán traducirse si son hijos de un nodo con la propiedad ``auto_translate`` establecida en ``false``.
fr: La propriété ``auto_translate`` est dépréciée en faveur de la propriété ``auto_translate_mode`` qui est maintenant dans ``Node`` (`GH-87530`_). La valeur par défaut pour ``auto_translate_mode`` est ``AUTO_TRANSLATE_INHERIT``, ce qui signifie que les nœuds héritent de la valeur ``auto_translate_mode`` de leur parent. Cela signifie que les nœuds existants avec la propriété ``auto_translate`` définie à ``true`` peuvent ne plus être traduits s'ils sont des enfants d'un nœud avec la propriété ``auto_translate`` définie à ``false``.
it: La proprietà ``auto_translate`` è deprecata a favore della proprietà ``auto_translate_mode``, ora presente in ``Node`` (`GH-87530`_). Il valore predefinito per ``auto_translate_mode`` è ``AUTO_TRANSLATE_INHERIT``, il che significa che i nodi ereditano il valore ``auto_translate_mode`` dal nodo genitore. Ciò significa che i nodi esistenti con la proprietà ``auto_translate`` impostata su ``true`` potrebbero non tradursi più se sono figli di un nodo con la proprietà ``auto_translate`` impostata su ``false``.
pt_br: A propriedade ``auto_translate`` foi descontinuada em favor da propriedade ``auto_translate_mode``, que agora está em ``Node`` (`GH-87530`_). O valor padrão para ``auto_translate_mode`` é ``AUTO_TRANSLATE_INHERIT``, o que significa que os nós herdam o valor ``auto_translate_mode`` de seus nós pais. Isso significa que nós existentes com a propriedade ``auto_translate`` definida como ``true`` não poderão mais ser traduzidos se forem filhos de um nó com a propriedade ``auto_translate`` definida como ``false``.
ru: Свойство ``auto_translate`` устарело в пользу свойства ``auto_translate_mode``, которое теперь находится в ``Node`` (`GH-87530`_). Значение по умолчанию для ``auto_translate_mode`` - ``AUTO_TRANSLATE_INHERIT``, что означает, что узлы наследуют значение ``auto_translate_mode`` от своего родителя. Это означает, что существующие узлы со свойством ``auto_translate``, установленным на ``true``, больше не могут быть переведены, если они являются дочерними узлами со свойством ``auto_translate``, установленным на ``false``.
ta: `` Oud_translate`` சொத்து `` node`` (`gh-87530`_) இல் உள்ள` `auto_translate_mode`` சொத்துக்கு ஆதரவாக நீக்கப்படுகிறது. `` Auto_translate_mode`` க்கான இயல்புநிலை மதிப்பு `` Auto_translate_inherit``, அதாவது முனைகள் தங்கள் பெற்றோரிடமிருந்து `` auto_translate_mode` மதிப்பை பெறுகின்றன. இதன் பொருள், `` உண்மை`` என அமைக்கப்பட்ட `` Auto_translate`` சொத்துடன் இருக்கும் முனைகள் `` Auto_translate` சொத்து `` பொய்யான`` உடன் ஒரு முனையின் குழந்தைகளாக இருந்தால் இனி மொழிபெயர்க்கப்படாது.
uk: Властивість ``auto_translate`` застаріла на користь властивості ``auto_translate_mode``, яка тепер знаходиться у ``Node`` (`GH-87530`_). Стандартним значенням для ``auto_translate_mode`` є ``AUTO_TRANSLATE_INHERIT``, що означає, що вузли успадковують значення ``auto_translate_mode`` від свого батька. Це означає, що існуючі вузли з властивістю ``auto_translate``, встановленою на ``true``, більше не можуть бути перекладені, якщо вони є нащадками вузла з властивістю ``auto_translate``, встановленою на ``false``.
zh_cn: ``auto_translate`` 属性已被弃用，取而代之的是现在位于 ``Node`` 中的 ``auto_translate_mode`` 属性（`GH-87530`_\）。 ``auto_translate_mode`` 的默认值为 ``AUTO_TRANSLATE_INHERIT`` ，这意味着节点会从其父节点继承 ``auto_translate_mode`` 值。因此，如果现有节点的 ``auto_translate`` 属性设置为 ``true`` ，但其父节点的 ``auto_translate`` 属性设置为 ``false`` ，那么这些节点可能不再被翻译。
zh_hant: ``auto_translate`` 屬性已廢棄，請改用現在新增至 ``Node`` 的 ``auto_translate_mode`` 屬性（詳見 `GH-87530`_）。``auto_translate_mode`` 的預設值為 ``AUTO_TRANSLATE_INHERIT``，代表節點會繼承父節點的翻譯模式。這表示，原本有設定 ``auto_translate = true`` 的節點，如果其父節點 ``auto_translate`` 為 ``false``，可能就不會再被自動翻譯。

source: Multiplayer
es: Multijugador
fr: Multijoueur
ru: Мультиплеер
ta: மல்டிபிளேயர்
uk: Мультіплеер
zh_cn: 多人游戏
zh_hant: 多人連線

source: The ``SceneMultiplayer`` caching protocol was changed to send the received ID instead of the Node path when sending a node removal confirmation packet (`GH-90027`_).
es: Se modificó el protocolo de almacenamiento en caché ``SceneMultiplayer`` para enviar la ID recibida en lugar de la ruta del nodo al enviar un paquete de confirmación de eliminación de nodo (`GH-90027`_).
fr: Le protocole de cache de ``SceneMultiplayer`` a été modifié pour envoyer l'ID reçu au lieu du chemin de nœud lors de l'envoi d'un paquet de confirmation d'enlèvement de nœud (`GH-90027`_).
it: Il protocollo di memorizzazione nella cache di ``SceneMultiplayer`` è stato modificato per inviare l'ID ricevuto anziché il percorso del nodo all'invio di un pacchetto di conferma per rimuovere il nodo (`GH-90027`_).
pt_br: O protocolo de cache ``SceneMultiplayer`` foi alterado para enviar o ID recebido em vez do caminho do nó ao enviar um pacote de confirmação de remoção de nó (`GH-90027`_).
ru: Протокол кэширования ``SceneMultiplayer`` был изменен для отправки полученного идентификатора вместо пути к узлу при отправке пакета подтверждения удаления узла (`GH-90027`_).
ta: முனை அகற்றுதல் உறுதிப்படுத்தல் பாக்கெட்டை (`GH-90027`_) அனுப்பும்போது முனை பாதைக்கு பதிலாக பெறப்பட்ட ஐடியை அனுப்ப` `SuseMultiplayer`` கேச்சிங் நெறிமுறை மாற்றப்பட்டது.
uk: Протокол кешування ``SceneMultiplayer`` було змінено для надсилання отриманого ідентифікатора замість шляху вузла під час надсилання пакета підтвердження видалення вузла (`GH-90027`_).
zh_cn: ``SceneMultiplayer`` 的缓存协议已更改，在发送节点移除确认数据包时，现在会发送接收到的 ID 而不是节点路径（`GH-90027`_\）。
zh_hant: ``SceneMultiplayer`` 的快取協定已改為在發送節點移除確認封包時，傳送收到的 ID，而非節點路徑（詳見 `GH-90027`_）。
