Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.3.po
Languages: es, fr, it, pt_br, ru, ta, uk, zh_cn, zh_hant

source: This is a breaking change for the high-level multiplayer protocol making it incompatible with previous Godot versions. Upgrade both your server and client versions to Godot 4.3 to handle this change gracefully.
es: Este es un cambio radical que afecta al protocolo multijugador de alto nivel, lo que lo hace incompatible con versiones anteriores de Godot. Actualice tanto su servidor como su cliente a Godot 4.3 para gestionar este cambio correctamente.
fr: C'est un changement cassant pour le protocole multijoueur de haut niveau le rendant incompatible avec les versions précédentes de Godot. Mettez à niveau vos versions de serveur et de client en Godot 4.3 pour gérer ce changement élégamment.
it: Questo è una modifica incompatibile per il protocollo multigiocatore di alto livello, il che lo rende incompatibile con le precedenti versioni di Godot. Aggiornare la versione sia del server sia del client a Godot 4.3 per gestire questo cambiamento senza problemi.
pt_br: Esta é uma mudança drástica no protocolo multijogador de alto nível, tornando-o incompatível com versões anteriores do Godot. Atualize suas versões de servidor e cliente para o Godot 4.3 para lidar com essa mudança sem problemas.
ru: Это критическое изменение для протокола многопользовательской игры высокого уровня, делающее его несовместимым с предыдущими версиями Godot. Обновите версии сервера и клиента до Godot 4.3, чтобы корректно обработать это изменение.
ta: இது உயர் மட்ட மல்டிபிளேயர் நெறிமுறைக்கான ஒரு முறிவு மாற்றமாகும், இது முந்தைய கோடோட் பதிப்புகளுடன் பொருந்தாது. இந்த மாற்றத்தை அழகாக கையாள உங்கள் சேவையகம் மற்றும் கிளையன்ட் பதிப்புகள் இரண்டையும் கோடோட் 4.3 க்கு மேம்படுத்தவும்.
uk: Це кардинальна зміна для багатокористувацького протоколу високого рівня, що робить його несумісним із попередніми версіями Godot. Оновіть серверну та клієнтську версії до Godot 4.3, щоб витончено впоратися з цією зміною.
zh_cn: 这是对高级多人游戏协议（high-level multiplayer protocol）的破坏性改动，该改动会使其与之前的 Godot 版本不兼容。请将你的服务器和客户端版本都升级到 Godot 4.3 以妥善处理此更改。
zh_hant: 此為高階多人連線協定的不相容變更，與舊版 Godot 並不相容。請同時將你的伺服器與客戶端一併升級到 Godot 4.3，才能正常運作。

source: Note that high-level multiplayer facilities are only ever meant to be compatible with server and client using the same Godot version. It is recommended to implement some kind of version checking.
es: Ten en cuenta que las funciones multijugador de alto nivel solo son compatibles con servidores y clientes que usen la misma versión de Godot. Se recomienda implementar algún tipo de verificación de versiones.
fr: Notez que les facilités multijoueurs de haut niveau sont censées être uniquement compatibles avec un serveur et un client utilisant la même version de Godot. Il est recommandé d'implémenter une sorte de vérification de version.
it: Si noti che le funzionalità multigiocatore di alto livello sono progettate per essere compatibili solo con server e client che utilizzano la stessa versione di Godot. Si consiglia di implementare un qualche tipo di controllo della versione.
pt_br: Observe que os recursos multijogador de alto nível devem ser compatíveis somente com o servidor e o cliente que usam a mesma versão do Godot. Recomenda-se implementar algum tipo de verificação de versão.
ru: Обратите внимание, что многопользовательские возможности высокого уровня всегда должны быть совместимы только с сервером и клиентом, использующими одну и ту же версию Godot. Рекомендуется реализовать какую-либо проверку версии.
ta: உயர்-நிலை மல்டிபிளேயர் வசதிகள் ஒரே கோடோட் பதிப்பைப் பயன்படுத்தி சேவையகம் மற்றும் கிளையண்டுடன் இணக்கமாக இருக்க வேண்டும் என்பதை நினைவில் கொள்க. ஒருவித பதிப்பு சோதனையை செயல்படுத்த பரிந்துரைக்கப்படுகிறது.
uk: Зауважте, що багатокористувацькі засоби високого рівня завжди призначені для сумісності лише з сервером і клієнтом, які використовують ту саму версію Godot. Рекомендується реалізувати певний вид перевірки версій.
zh_cn: 请注意，高级多人游戏（high-level multiplayer）功能仅与使用相同 Godot 版本的服务器和客户端兼容。建议实现某种版本检查机制。
zh_hant: 請注意，高階多人連線設施僅設計給相同 Godot 版本的伺服器與客戶端共同使用。建議你在專案中實作版本檢查機制。

source: Decals now convert the modulate color from an sRGB color to a linear color, like all other inputs, to ensure proper blending (`GH-89849`_). Existing projects that were using the decal's modulate property will notice a change in their visuals.
es: Los decals ahora convierten el color del modulate de sRGB a color lineal, al igual que el resto de las entradas, para asegurar una mezcla adecuada (`GH-89849`_). Los proyectos existentes que usaban la propiedad modulate del decal notarán un cambio en su apariencia visual.
fr: Les décalques convertissent maintenant la couleur modulée d'une couleur sRGB à une couleur linéaire, comme toutes les autres entrées, pour assurer un mélange approprié (`GH-89849`_). Les projets existants qui utilisaient la propriété de modulation du décalque remarqueront un changement dans leurs visuels.
it: Le decalcomanie ora convertono il colore di modulazione da sRGB a lineare, come tutti gli altri input, per garantire una corretta fusione (`GH-89849`_). I progetti esistenti che utilizzavano la proprietà di modulazione delle decalcomanie noteranno un cambiamento nelle loro visuali.
pt_br: Os decalques agora convertem a cor modulada de uma cor sRGB para uma cor linear, como todas as outras entradas, para garantir uma mistura adequada (`GH-89849`_). Projetos existentes que usavam a propriedade de modulação do decalque notarão uma mudança em seus visuais.
ru: Декали теперь преобразуют модулируемый цвет из цвета sRGB в линейный цвет, как и все остальные входы, чтобы обеспечить правильное смешивание (`GH-89849`_). Существующие проекты, которые использовали свойство модулируемости декали, заметят изменение в своих визуальных эффектах.
ta: சரியான கலப்பை (`GH-89849`_) உறுதிப்படுத்த, டெக்கல்கள் இப்போது ஒரு SRGB நிறத்திலிருந்து ஒரு நேரியல் நிறமாக மாற்றுகின்றன. டெக்கலின் மாடுலேட் சொத்தைப் பயன்படுத்தும் தற்போதைய திட்டங்கள் அவற்றின் காட்சிகளில் மாற்றத்தைக் கவனிக்கும்.
uk: Наклейки тепер перетворюють модульований колір із кольору sRGB на лінійний колір, як і всі інші вхідні дані, для забезпечення належного змішування (`GH-89849`_). Існуючі проекти, які використовували властивість decal modulate, помітять зміни у своїх візуальних ефектах.
zh_cn: 现在，贴花会将调制颜色从 sRGB 颜色转换为线性颜色，与所有其他输入一致，以确保正确的混合效果（`GH-89849`_\）。使用贴花调制属性的现有项目会注意到其视觉效果发生了变化。
zh_hant: 貼花（Decal）現在會將調變（modulate）顏色從 sRGB 色彩空間轉換為線性色彩，與其他輸入一致，以確保正確的混色效果（詳見 `GH-89849`_）。如果你的專案有用到貼花的調變屬性，將會發現畫面有些微變化。

source: The reverse Z depth buffer technique is now implemented. This may break compatibility for some shaders. Read the `Introducing Reverse Z (AKA I'm sorry for breaking your shader) <https://godotengine.org/article/introducing-reverse-z/>`__ article for more information and guidance on how to fix common scenarios.
es: Ahora se implementó la técnica de Reverse Z en el depth buffer. Esto puede romper la compatibilidad con algunos shaders. Léase el artículo `Introducción a Reverse Z (Lo siento por romper tu shader) <https://godotengine.org/article/introducing-reverse-z/>`__ para más información y guía sobre cómo solucionar los casos más comunes.
fr: La technique du buffer de profondeur Z inversé est maintenant implémentée. Cela peut casser la compatibilité de certains shaders. Lire l'article `Introducing Reverse Z (AKA I'm sorry for breaking your shader) <https://godotengine.org/article/introducing-reverse-z/>`__ pour plus d'information et de guide sur comment corriger les scénarios communs.
it: È ora implementata la tecnica del buffer di profondità Z inverso. Ciò potrebbe interrompere la compatibilità per alcuni shader. Leggere l'articolo `Introducing Reverse Z (AKA I'm sorry for breaking your shader) <https://godotengine.org/article/introducing-reverse-z/>`__ per ulteriori informazioni e indicazioni su come risolvere gli scenari più comuni.
pt_br: A técnica de buffer de profundidade Z reverso agora está implementada. Isso pode quebrar a compatibilidade para alguns shaders. Leia o artigo `Introducing Reverse Z (AKA I'm sorry for breaking your shader) <https://godotengine.org/article/introducing-reverse-z/>`__ para mais informações e orientações sobre como corrigir cenários comuns.
ru: Теперь реализована технология буферизации обратной Z-глубины. Это может нарушить совместимость некоторых шейдеров. Прочитайте статью `Введение в обратную Z-глубину (AKA Извините за поломку вашего шейдера) <https://godotengine.org/article/introducing-reverse-z/>`__ для получения дополнительной информации и рекомендаций по исправлению распространенных сценариев.
ta: தலைகீழ் சட் ஆழ இடையக நுட்பம் இப்போது செயல்படுத்தப்பட்டுள்ளது. இது சில சேடர்களுக்கு பொருந்தக்கூடிய தன்மையை உடைக்கக்கூடும். தலைகீழ் சட் ஐ அறிமுகப்படுத்துதல் (உங்கள் சேடரை உடைத்ததற்கு நான் வருந்துகிறேன்) <https://godotengine.org/article/introducing-reverse-z/> __ பொதுவான காட்சிகளை எவ்வாறு சரிசெய்வது என்பதற்கான வழிகாட்டுதலுக்கு __ கட்டுரை.
uk: Тепер реалізовано метод зворотного буфера глибини Z. Це може порушити сумісність для деяких шейдерів. Ознайомтеся зі статтею `Представляємо Reverse Z (також вибачте, що зламав ваш шейдер) <https://godotengine.org/article/introducing-reverse-z/>`__, щоб отримати додаткову інформацію та вказівки щодо вирішення поширених сценаріїв.
zh_cn: 现已实现反向 Z 深度缓冲技术。这可能会破坏某些着色器的兼容性。请阅读 `反向 Z 简介 (又名：很抱歉破坏了你的着色器) <https://godotengine.org/article/introducing-reverse-z/>`__ 文章，了解更多信息并获取修复常见场景的指导。
zh_hant: 已導入反向 Z（Reverse Z）深度緩衝技術。這可能會讓部分著色器（Shader）出現不相容。請參考《Introducing Reverse Z (AKA I'm sorry for breaking your shader) <https://godotengine.org/article/introducing-reverse-z/>》一文，取得更多資訊與修正建議。

source: ``TileMap`` layers were moved to individual nodes (`GH-87379`_ and `GH-89179`_).
es: Las capas de ``TileMap`` se movieron a nodos individuales (`GH-87379`_ y `GH-89179`_).
fr: Les couches ``TileMap`` ont été déplacées vers des nœuds individuels (`GH-87379`_ et `GH-89179`_).
it: I livelli di ``TileMap`` sono stati spostati su nodi individuali (`GH-87379`_ e `GH-89179`_).
pt_br: As camadas ``TileMap`` foram movidas para nós individuais (`GH-87379`_ e `GH-89179`_).
ru: Слои ``TileMap`` были перемещены в отдельные узлы (`GH-87379`_ и `GH-89179`_).
ta: `` டில்மேப்`` அடுக்குகள் தனிப்பட்ட முனைகளுக்கு (`சிஎச் -87379`_ மற்றும்` சிஎச் -89179`_) நகர்த்தப்பட்டன.
uk: Шари ``TileMap`` переміщено в окремі вузли (`GH-87379`_ і `GH-89179`_).
zh_cn: ``TileMap`` 图层已移至单独的节点（\ `GH-87379`_ 和 `GH-89179`_\ ）。
zh_hant: ``TileMap`` 圖層現在拆分為獨立節點（詳見 `GH-87379`_ 與 `GH-89179`_）。

source: Android
ta: ஆண்ட்ராய்டு

source: Android permissions are no longer requested automatically because it goes against the recommended best practices (`GH-87080`_). Use the ``request_permission`` method in ``OS`` and the ``on_request_permissions_result`` signal on ``MainLoop`` to request permissions and wait for the user response.
es: Ya no se solicitan automáticamente los permisos en Android, porque eso va en contra de las buenas prácticas recomendadas (`GH-87080`_). Usa el método ``request_permission`` de ``OS`` y la señal ``on_request_permissions_result`` de ``MainLoop`` para solicitar permisos y esperar la respuesta del usuario.
fr: Les autorisations Android ne sont plus demandées automatiquement parce qu'elles sont contraires aux meilleures pratiques recommandées (`GH-87080`_). Utilisez la méthode ``request_permission`` dans ``OS`` et le signal ``on_request_permissions_result`` dans ``MainLoop`` pour demander des permissions et attendre la réponse de l'utilisateur.
it: Le autorizzazioni di Android non sono più richieste automaticamente perché violano le procedure consigliate (`GH-87080`_). Utilizzare il metodo ``request_permission`` in ``OS`` e il segnale ``on_request_permissions_result`` su ``MainLoop`` per richiedere le autorizzazioni e attendere la risposta dell'utente.
pt_br: As permissões do Android não são mais solicitadas automaticamente, pois isso vai contra as práticas recomendadas (`GH-87080`_). Use o método ``request_permission`` em ``OS`` e o sinal ``on_request_permissions_result`` em ``MainLoop`` para solicitar permissões e aguardar a resposta do usuário.
ru: Разрешения Android больше не запрашиваются автоматически, поскольку это противоречит рекомендуемым практикам (`GH-87080`_). Используйте метод ``request_permission`` в ``OS`` и сигнал ``on_request_permissions_result`` в ``MainLoop`` для запроса разрешений и ожидания ответа пользователя.
ta: ஆண்ட்ராய்டு அனுமதிகள் இனி தானாகவே கோரப்படுவதில்லை, ஏனெனில் இது பரிந்துரைக்கப்பட்ட சிறந்த நடைமுறைகளுக்கு எதிராக (`GH-87080`_) செல்கிறது. அனுமதிகளைக் கோருவதற்கும் பயனர் பதிலுக்காகக் காத்திருக்கவும் `` on_request_permissions_result`` இல் `` request_permission` `முறையைப் பயன்படுத்தவும்.
uk: Дозволи Android більше не запитуються автоматично, оскільки це суперечить рекомендованим найкращим практикам (`GH-87080`_). Використовуйте метод ``request_permission`` в ``OS`` і ``on_request_permissions_result`` сигнал ``MainLoop``, щоб запитати дозволи та дочекатися відповіді користувача.
zh_cn: Android 权限不再自动请求，因为这违反了推荐的最佳实践（\ `GH-87080`_\ )。请使用 ``OS`` 中的 ``request_permission`` 方法和 ``MainLoop`` 上的 ``on_request_permissions_result`` 信号来请求权限并等待用户响应。
zh_hant: Android 權限不會再自動請求，因為這不符合官方建議的最佳實踐（詳見 `GH-87080`_）。請自行在 ``OS`` 使用 ``request_permission`` 方法，並透過 ``MainLoop`` 的 ``on_request_permissions_result`` 訊號來請求權限並等待使用者回應。

source: **PhysicsShapeQueryParameters3D**
ru: **PhysicsShapeQueryParameters3D** (Параметры запроса физической формы 3D)
zh_cn: PhysicsShapeQueryParameters2D

source: GDExtension
es: GDExtensión
uk: GDеxtension
