Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.3.po
Languages: es, fr, it, pt_br, ru, ta, uk, zh_cn, zh_hant

source: Method ``find_variation`` adds a new ``baseline_offset`` optional parameter
fr: La méthode ``find_variation`` ajoute un nouveau paramètre ``baseline_offset`` optionnel
it: Il metodo ``find_variation`` aggiunge un nuovo parametro facoltativo ``baseline_offset``
ru: Method ``find_variation`` добавляет новый необязательный параметр ``baseline_offset``
ta: முறை `` find_variation`` புதிய `` அடிப்படை_ஆஃப்செட்`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``find_variation`` додає новий необов’язковий параметр ``baseline_offset``
zh_cn: ``find_variation`` 方法添加了可选的 ``baseline_offset`` 参数
zh_hant: 方法 ``find_variation`` 新增了 ``baseline_offset`` 選用參數

source: **RichTextLabel**
ta: ** ரிச்ச்டெக்ச்ட்லேபிள் **

source: Method ``push_meta`` adds a new ``underline_mode`` optional parameter
fr: La méthode ``push_meta`` ajoute un nouveau paramètre optionnel ``underline_mode``
it: Il metodo ``push_meta`` aggiunge un nuovo parametro facoltativo ``underline_mode``
ru: Method ``push_meta`` добавляет новый необязательный параметр ``underline_mode``
ta: முறை `` புச்_மெட்டா`` புதிய `` அண்டர்லைன்_மோட்`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``push_meta`` додає новий необов'язковий параметр ``underline_mode``
zh_cn: ``push_meta`` 方法增加了一个新的 ``underline_mode`` 可选参数
zh_hant: 方法 ``push_meta`` 新增了 ``underline_mode`` 選用參數

source: **TextServer**
ta: ** டெக்ச்டர்வர் **

source: Method ``shaped_text_get_word_breaks`` adds a new optional ``skip_grapheme_flags`` parameter
fr: La méthode ``shaped_text_get_word_breaks`` ajoute un nouveau paramètre optionnel ``skip_grapheme_flags``
it: Il metodo ``shaped_text_get_word_breaks`` aggiunge un nuovo parametro facoltativo ``skip_grapheme_flags``
ru: Method ``shaped_text_get_word_breaks`` добавляет новый необязательный параметр ``skip_grapheme_flags``
ta: முறை `` `spated_text_get_word_breaks`` ஒரு புதிய விருப்பத்தை சேர்க்கிறது` `skip_grapheme_flags` இன் அளவுருவை
uk: Метод ``shaped_text_get_word_breaks`` додає новий необов’язковий параметр ``skip_grapheme_flags``
zh_cn: ``shaped_text_get_word_breaks`` 方法增加了一个新的 ``skip_grapheme_flags`` 可选参数
zh_hant: 方法 ``shaped_text_get_word_breaks`` 新增了 ``skip_grapheme_flags`` 選用參數

source: **TextServerExtension**
ta: ** TEXSERVERVEREXTENSION **

source: Method ``_shaped_text_get_word_breaks`` adds a new ``skip_grapheme_flags`` parameter
fr: La méthode ``_shaped_text_get_word_breaks`` ajoute un nouveau paramètre ``skip_grapheme_flags``
it: Il metodo ``_shaped_text_get_word_breaks`` aggiunge un nuovo parametro ``skip_graphene_flags``
ru: Method ``_shaped_text_get_word_breaks`` добавляет новый параметр ``skip_grapheme_flags``
ta: முறை `` _shaped_text_get_word_breaks`` ஒரு புதிய `` skip_grapheme_flags`` அளவுருவைச் சேர்க்கிறது
uk: Метод ``_shaped_text_get_word_breaks`` додає новий параметр ``skip_grapheme_flags``
zh_cn: ``_shaped_text_get_word_breaks`` 方法添加了 ``skip_grapheme_flags`` 参数
zh_hant: 方法 ``_shaped_text_get_word_breaks`` 新增了 ``skip_grapheme_flags`` 參數

source: Audio
pt_br: Áudio
ru: Аудио
ta: ஆடியோ
uk: Аудіо
zh_cn: 音频
zh_hant: 音訊

source: Method ``play_stream`` adds new ``playback_type``, and ``bus`` optional parameters
fr: La méthode ``play_stream`` ajoute de nouveaux paramètres optionnels, ``playback_type`` et ``bus``
it: Il metodo ``play_stream`` aggiunge nuovi parametri facoltativi ``playback_type`` e ``bus``
ru: Method ``play_stream`` добавляет новый ``playback_type``, и необязательный ``bus`` параметры
ta: முறை `` Play_stream`` புதிய `` blapeback_type``, மற்றும் `` பச்`` விருப்ப அளவுருக்கள் சேர்க்கிறது
uk: Метод ``play_stream`` додає нові необов’язкові параметри ``playback_type`` і ``bus``
zh_cn: 方法 ``play_stream`` 增加了新的 ``playback_type`` 和 ``bus`` 可选参数
zh_hant: 方法 ``play_stream`` 新增了 ``playback_type`` 及 ``bus`` 選用參數

source: Navigation
es: Navegación
it: Navigazione
pt_br: Navegação
ru: Навигация
ta: வானோடல்
uk: Навігація
zh_cn: 导航
zh_hant: 導覽

source: Method ``get_id_path`` adds new ``allow_partial_path`` optional parameter
fr: La méthode ``get_id_path`` ajoute un nouveau paramètre optionnel ``allow_partial_path``
it: Il metodo ``get_id_path`` aggiunge un nuovo parametro facoltativo ``allow_partial_path``
ru: Method ``get_id_path`` добавляет новый необязательный параметр ``allow_partial_path``
ta: முறை `` get_id_path`` புதிய `` Allow_partial_path`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``get_id_path`` додає новий необов'язковий параметр ``allow_partial_path``
zh_cn: ``get_id_path`` 方法增加了一个新的 ``allow_partial_path`` 可选参数
zh_hant: 方法 ``get_id_path`` 新增了 ``allow_partial_path`` 選用參數

source: Method ``get_point_path`` adds new ``allow_partial_path`` optional parameter
fr: La méthode ``get_point_path`` ajoute un nouveau paramètre optionnel ``allow_partial_path``
it: Il metodo ``get_point_path`` aggiunge un nuovo parametro facoltativo ``allow_partial_path``
ru: Method ``get_point_path`` добавляет новый необязательный параметр ``allow_partial_path``
ta: முறை `` get_point_path`` புதிய `` Allow_partial_path`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``get_point_path`` додає новий необов'язковий параметр ``allow_partial_path``
zh_cn: ``get_point_path`` 方法增加了一个新的 ``allow_partial_path`` 可选参数
zh_hant: 方法 ``get_point_path`` 新增了 ``allow_partial_path`` 選用參數

source: **NavigationRegion2D**
ta: ** வழிசெலுத்தல் பகுதி 2 டி **

source: Property ``avoidance_layers`` removed
fr: La propriété ``avoidance_layers`` a été retirée
it: Proprietà ``avoidance_layers`` rimossa
pt_br: Propriedade ``avoidance_layers`` removida
ru: Свойство ``avoidance_layers`` удаленно
ta: சொத்து `` தவிர்ப்பு_லேயர்கள்`` அகற்றப்பட்டது
uk: Властивість ``avoidance_layers`` видалено
zh_cn: 移除了 ``avoidance_layers`` 属性
zh_hant: 屬性 ``avoidance_layers`` 已移除

source: Property ``constrain_avoidance`` removed
fr: La propriété ``constrain_avoidance`` a été retirée
it: Proprietà ``constrain_avoidance`` rimossa
pt_br: Propriedade ``constrain_avoidance`` removida
ru: Свойство ``constrain_avoidance`` удалено
ta: சொத்து `` contrain_avoidance`` அகற்றப்பட்டது
uk: Властивість ``constrain_avoidance`` видалено
zh_cn: 移除了 ``constrain_avoidance`` 属性
zh_hant: 屬性 ``constrain_avoidance`` 已移除

source: Method ``get_avoidance_layer_value`` removed
fr: La méthode ``get_avoidance_layer_value`` a été retirée
it: Metodo ``get_avoidance_layer_value`` rimosso
pt_br: Método ``get_avoidance_layer_value`` removido
ru: Метод ``get_avoidance_layer_value`` удалён
ta: முறை `` get_avoidance_layer_value`` அகற்றப்பட்டது
uk: Метод ``get_avoidance_layer_value`` видалено
zh_cn: 移除了 ``get_avoidance_layer_value`` 方法
zh_hant: 方法 ``get_avoidance_layer_value`` 已移除

source: Method ``set_avoidance_layer_value`` removed
fr: La méthode ``set_avoidance_layer_value`` a été retirée
it: Metodo ``set_avoidance_layer_value`` rimosso
pt_br: Método ``set_avoidance_layer_value`` removido
ru: Метод ``set_avoidance_layer_value`` удалён
ta: முறை `` set_avoidance_layer_value`` அகற்றப்பட்டது
uk: Метод ``set_avoidance_layer_value`` видалено
zh_cn: 移除了 ``set_avoidance_layer_value`` 方法
zh_hant: 方法 ``set_avoidance_layer_value`` 已移除

source: The constrain avoidance feature in ``NavigationRegion2D`` was experimental and has been discontinued with no replacement.
es: La función para evitar restricciones en ``NavigationRegion2D`` era experimental y se ha descontinuado sin reemplazo.
fr: La fonctionnalité de contrainte d'évitement dans ``NavigationRegion2D`` était expérimentale et a été abandonnée sans remplacement.
it: La funzionalità per evitare restrizioni in ``NavigationRegion2D`` era sperimentale ed è stata interrotta senza alcuna sostituzione.
pt_br: O recurso de prevenção de restrições em ``NavigationRegion2D`` era experimental, sendo descontinuado sem substituição.
ru: Функция обхода ограничений в ``NavigationRegion2D`` была экспериментальной и была прекращена без замены.
ta: `` வழிசெலுத்தல் பிரேகோன் 2 டி`` இல் உள்ள கட்டுப்பாட்டு தவிர்ப்பு நற்பொருத்தம் சோதனைக்குரியது மற்றும் மாற்றீடு இல்லாமல் நிறுத்தப்பட்டது.
uk: Функція уникнення обмежень у ``NavigationRegion2D`` була експериментальною та була припинена без заміни.
zh_cn: ``NavigationRegion2D`` 中的约束避障功能是实验性的，现已停止使用且没有替代方案。
zh_hant: ``NavigationRegion2D`` 的避障限制功能曾為實驗性，現已移除且無替代方案。

source: TileMap
ta: டில்மேப்
uk: Плитка карти
zh_hant: 圖塊地圖（TileMap）

source: **TileData**
ta: டைல்ஃப்

source: Method ``get_navigation_polygon`` adds new ``flip_h``, ``flip_v``, and ``transpose`` optional parameters
fr: La méthode ``get_navigation_polygon`` ajoute de nouveaux paramètres optionnels ``flip_h``, ``flip_v``, et ``transpose``
it: Il metodo ``get_navigation_polygon`` aggiunge nuovi parametri facoltativi ``flip_h``, ``flip_v`` e ``transpose``
pt_br: Adicionado novos parâmetros opcionais ``flip_h``, ``flip_v`` e ``transpose`` ao método ``get_navigation_polygon``
ru: Метод ``get_navigation_polygon`` добавляет новый ``flip_h``, ``flip_v``, и необязательный ``transpose`` параметры
ta: முறை `` get_navigation_polygon``` புதிய `` flip_h``, `` flip_v``, மற்றும் `` இடமாற்றம்` விருப்ப அளவுருக்களைச் சேர்க்கிறது
uk: Метод ``get_navigation_polygon`` додає нові додаткові параметри ``flip_h``, ``flip_v`` і ``transpose``
zh_cn: ``get_navigation_polygon`` 方法添加了新的 ``flip_h`` ， ``flip_v`` ，和 ``transpose`` 可选参数
zh_hant: 方法 ``get_navigation_polygon`` 新增了 ``flip_h``、``flip_v`` 及 ``transpose`` 選用參數

source: Method ``get_occluder`` adds new ``flip_h``, ``flip_v``, and ``transpose`` optional parameters
fr: La méthode ``get_occluder`` ajoute de nouveaux paramètres optionnels ``flip_h``, ``flip_v``, et ``transpose``
it: Il metodo ``get_occluder`` aggiunge nuovi parametri facoltativi ``flip_h``, ``flip_v`` e ``transpose``
pt_br: Adicionado novos parâmetros opcionais ``flip_h``, ``flip_v`` e ``transpose`` ao método ``get_occluder``
ru: Метод ``get_occluder`` добавляет новые необязательные параметры ``flip_h``, ``flip_v`` и ``transpose``
ta: முறை `` get_occluder`` புதிய `` flip_h``, `` flip_v``, மற்றும் `` இடமாற்றம்` விருப்ப அளவுருக்களைச் சேர்க்கிறது
uk: Метод ``get_occluder`` додає нові додаткові параметри ``flip_h``, ``flip_v`` і ``transpose``
zh_cn: ``get_occluder`` 方法添加了新的 ``flip_h`` ， ``flip_v`` 和 ``transpose`` 可选参数
zh_hant: 方法 ``get_occluder`` 新增了 ``flip_h``、``flip_v`` 及 ``transpose`` 選用參數

source: XR
ta: எக்ச்ஆர்
uk: ИКСР

source: Method ``get_input_source_tracker`` changes return type from ``XRPositionalTracker`` to ``XRControllerTracker``
fr: La méthode ``get_input_source_tracker`` change de type de retour de ``XRPositionalTracker`` en ``XRControllerTracker``
it: Il metodo ``get_input_source_tracker`` cambia il tipo restituito da ``XRPositionalTracker`` a ``XRControllerTracker``
pt_br: Alterado o tipo de retorno do método ``get_input_source_tracker`` de ``XRPositionalTracker`` para ``XRControllerTracker``
ru: Метод ``get_input_source_tracker`` изменяет тип возвращаемого значения с ``XRPositionalTracker`` на ``XRControllerTracker``
ta: முறை `` get_input_source_tracker`` `` xrpositionaltracker`` இலிருந்து `` xrcontrollertracker`` க்கு வருவாய் வகையை மாற்றுகிறது
uk: Метод ``get_input_source_tracker`` змінює тип повернення з ``XRPositionalTracker`` на ``XRControllerTracker``
zh_cn: ``get_input_source_tracker`` 方法将返回类型从 ``XRPositionalTracker`` 更改为 ``XRControllerTracker``
zh_hant: 方法 ``get_input_source_tracker`` 的回傳型別由 ``XRPositionalTracker`` 改為 ``XRControllerTracker``

source: Method ``get_tracker`` changes return type from ``XRPositionalTracker`` to ``XRTracker``
fr: La méthode ``get_tracker`` change de type de retour de ``XRPositionalTracker`` en ``XRTracker``
it: Il metodo ``get_tracker`` cambia il tipo restituito da ``XRPositionalTracker`` a ``XRTracker``
pt_br: Alterado o tipo de retorno do método ``get_tracker`` de ``XRPositionalTracker`` para ``XRTracker``
ru: Метод ``get_tracker`` изменяет тип возвращаемого значения с ``XRPositionalTracker`` на ``XRTracker``
ta: முறை `` get_tracker`` `` xrpospositionaltracker`` இலிருந்து `` xrtracker`` க்கு வருவாய் வகையை மாற்றுகிறது
uk: Метод ``get_tracker`` змінює тип повернення з ``XRPositionalTracker`` на ``XRTracker``
zh_cn: ``get_tracker`` 方法将返回类型从 ``XRPositionalTracker`` 更改为 ``XRTracker``
zh_hant: 方法 ``get_tracker`` 的回傳型別由 ``XRPositionalTracker`` 改為 ``XRTracker``

source: Editor plugins
es: Plugins del editor
fr: Extensions pour l'éditeur
it: Estensioni per l'editor
pt_br: Plugins do editor
ru: Плагины редактора
ta: ஆசிரியர் செருகுநிரல்கள்
uk: Додатки редактора
zh_cn: 编辑器插件
zh_hant: 編輯器外掛程式

source: **EditorInspectorPlugin**
ru: **EditorInspectorPlugin** (Плагин редактора-инспектора)
ta: ** எடிட்டோரின்ச்பெக்டர் பிளூகின் **

source: Method ``add_property_editor`` adds a new ``label`` optional parameter
fr: La méthode ``add_property_editor`` ajoute un nouveau paramètre optionnel ``label``
it: Il metodo ``add_property_editor`` aggiunge un nuovo parametro facoltativo ``label``
ru: Метод ``add_property_editor`` добавляет новый необязательный параметр ``label``
ta: முறை `` add_property_editor`` புதிய `` லேபிள்`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``add_property_editor`` додає новий необов’язковий параметр ``label``
zh_cn: 方法 ``add_property_editor`` 新添加了可选参数 ``label``
zh_hant: 方法 ``add_property_editor`` 新增了 ``label`` 選用參數

source: **EditorPlugin**
ru: **EditorPlugin** (Плагин редактора)
ta: ** எடிட்டர் பிளூகின் **

source: Method ``add_control_to_bottom_panel`` adds a new ``shortcut`` optional parameter
fr: La méthode ``add_control_to_bottom_panel`` ajoute un nouveau paramètre optionnel ``shortcut``
it: Il metodo ``add_control_to_bottom_panel`` aggiunge un nuovo parametro facoltativo ``shortcut``
ru: Метод ``add_control_to_bottom_panel`` добавляет новый необязательный параметр ``shortcut``
ta: முறை `` add_control_to_bottom_panel`` புதிய `` குறுக்குவழி`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``add_control_to_bottom_panel`` додає новий необов’язковий параметр ``shortcut``
zh_cn: 方法 ``add_control_to_bottom_panel`` 新添加了可选参数 ``shortcut``
zh_hant: 方法 ``add_control_to_bottom_panel`` 新增了 ``shortcut`` 選用參數

source: Method ``add_control_to_dock`` adds a new ``shortcut`` optional parameter
fr: La méthode ``add_control_to_dock`` ajoute un nouveau paramètre optionnel ``shortcut``
it: Il metodo ``add_control_to_dock`` aggiunge un nuovo parametro facoltativo ``shortcut``
ru: Метод ``add_control_to_dock`` добавляет новый необязательный параметр ``shortcut``
ta: முறை `` add_control_to_dock`` புதிய `` குறுக்குவழி`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``add_control_to_dock`` додає новий необов'язковий параметр ``shortcut``
zh_cn: 方法 ``add_control_to_dock`` 新添加了可选参数 ``shortcut``
zh_hant: 方法 ``add_control_to_dock`` 新增了 ``shortcut`` 選用參數

source: Type renamed to ``EditorSceneFormatImporterFBX2GLTF``
es: Tipo renombrado a ``EditorSceneFormatImporterFBX2GLTF``
fr: Type renommé en ``EditorSceneFormatImporterFBX2GLTF``
it: Tipo rinominato in ``EditorSceneFormatImporterFBX2GLTF``
pt_br: Tipo renomeado para ``EditorSceneFormatImporterFBX2GLTF``
ru: Тип переименован в ``EditorSceneFormatImporterFBX2GLTF``
ta: `` Atorsceneformatimatimporterfbx2gltf`` என மறுபெயரிடப்பட்டது
uk: Тип перейменовано на ``EditorSceneFormatImporterFBX2GLTF``
zh_cn: 类型重命名为 ``EditorSceneFormatImporterFBX2GLTF``
zh_hant: 型別已更名為 ``EditorSceneFormatImporterFBX2GLTF``

source: Behavior changes
es: Cambios de comportamiento
fr: Changements de comportement
it: Cambiamenti di comportamento
ru: Изменения в поведении
ta: நடத்தை மாற்றங்கள்
uk: Зміни поведінки
zh_cn: 行为更改
zh_hant: 做出更改

source: In 4.3 some behavior changes have been introduced, which might require you to adjust your project.
fr: En 4.3, certains changements de comportement ont été introduits, ce qui pourrait vous obliger à ajuster votre projet.
it: Nella versione 4.3 sono state introdotte alcune modifiche comportamentali che potrebbero richiedere di adattare il progetto.
pt_br: Na versão 4.3, algumas mudanças de comportamento foram introduzidas, o que pode exigir que você ajuste seu projeto.
ru: В версии 4.3 были внесены некоторые изменения в поведение, которые могут потребовать от вас корректировки проекта.
ta: 4.3 இல் சில நடத்தை மாற்றங்கள் அறிமுகப்படுத்தப்பட்டுள்ளன, இது உங்கள் திட்டத்தை சரிசெய்ய வேண்டும்.
uk: У версії 4.3 було внесено деякі зміни в поведінку, які можуть вимагати від вас коригування вашого проекту.
zh_cn: 4.3 中引入了一些行为的更改，你可能需要调整项目。

source: Core
es: Núcleo
it: Fondamentali
pt_br: Componentes Principais
ru: Ядро
ta: வயிரம்
uk: Ядро
zh_cn: 核心
zh_hant: 核心

source: Binary serialization was modified to fix some issues with the serialization of scripted Objects and typed Arrays (`GH-78219`_). This breaks compat with script encoding/decoding.
es: Se modificó la serialización binaria para corregir algunos problemas con la serialización de objetos con scripts y matrices tipificadas (`GH-78219`_). Esto afecta la compatibilidad con la codificación/decodificación de scripts.
fr: La sérialisation des binaires a été modifiée pour résoudre certains problèmes avec la sérialisation d'Objects scriptés et d'Arrays typés (`GH-78219`_). Cela casse la compatibilité pour l'encodage/décodage de script.
it: La serializzazione binaria è stata modificata per risolvere alcuni problemi con la serializzazione di oggetti con script, e array tipizzati (`GH-78219`_). Questo interrompe la compatibilità con la codifica/decodifica degli script.
pt_br: A serialização binária foi modificada para corrigir alguns problemas com a serialização de objetos com script e arrays tipados (`GH-78219`_). Isso quebra a compatibilidade com a codificação/decodificação de script.
ru: Двоичная сериализация (serialization ) была изменена для исправления некоторых проблем с сериализацией скриптовых объектов и типизированных массивов (`GH-78219`_). Это нарушает совместимость с кодированием/декодированием скрипта.
ta: ச்கிரிப்ட் செய்யப்பட்ட பொருள்கள் மற்றும் தட்டச்சு செய்யப்பட்ட வரிசைகள் (`சிஎச் -78219`_) சீரியலைசேசன் மூலம் சில சிக்கல்களை சரிசெய்ய பைனரி சீரியலைசேசன் மாற்றப்பட்டது. இது ச்கிரிப்ட் குறியாக்கம்/டிகோடிங் உடன் இணைகிறது.
uk: Двійкову серіалізацію було змінено, щоб виправити деякі проблеми з серіалізацією скриптових об’єктів і типізованих масивів (`GH-78219`_). Це порушує сумісність із кодуванням/декодуванням сценарію.
zh_cn: 二进制序列化已被修改，以修复脚本化对象和类型化数组的序列化问题（`GH-78219`_ ）。这一改动破坏了脚本编码/解码的兼容性。
zh_hant: 二進位序列化已調整，修復了腳本物件與型別化陣列序列化的相關問題（詳見 `GH-78219`_）。這會導致舊有腳本編碼/解碼的相容性中斷。

source: ``PackedByteArray`` is now able to use a more compact base64 encoding for storage. But the trade-off is that it breaks compatibility, meaning that older versions of Godot may not be able to open resources saved by 4.3 (`GH-89186`_).
es: ``PackedByteArray`` ahora puede usar una codificación base64 más compacta para el almacenamiento. Sin embargo, esto implica que se rompe la compatibilidad, lo que significa que las versiones anteriores de Godot podrían no poder abrir los recursos guardados por la versión 4.3 (`GH-89186`_).
fr: ``PackedByteArray`` est maintenant capable d'utiliser un encodage base64 plus compact pour le stockage. Mais le compromis est que cela casse la compatibilité, ce qui signifie que les anciennes versions de Godot peuvent ne pas être en mesure d'ouvrir des ressources sauvegardées par la 4.3 (`GH-89186`_).
it: ``PackedByteArray`` ora può utilizzare una codifica in base64 più compatta per l'archiviazione. Tuttavia, il compromesso è che interrompe la compatibilità, il che significa che le versioni precedenti di Godot potrebbero non essere in grado di aprire le risorse salvate dalla versione 4.3 (`GH-89186`_).
pt_br: O ``PackedByteArray`` agora pode usar uma codificação base64 mais compacta para armazenamento. A desvantagem é que isso quebra a compatibilidade, o que significa que versões mais antigas do Godot podem não conseguir abrir recursos salvos pela versão 4.3 (`GH-89186`_).
ru: ``PackedByteArray`` теперь может использовать более компактную кодировку base64 для хранения. Но компромисс заключается в том, что это нарушает совместимость, а это означает, что старые версии Godot могут не иметь возможности открывать ресурсы, сохраненные в 4.3 (`GH-89186`_).
ta: `` பேக்ஃபைடெர்ரே`` இப்போது சேமிப்பகத்திற்கு மிகவும் சிறிய அடிப்படை 64 குறியாக்கத்தைப் பயன்படுத்த முடிகிறது. ஆனால் வர்த்தக பரிமாற்றம் என்னவென்றால், இது பொருந்தக்கூடிய தன்மையை உடைக்கிறது, அதாவது கோடோட்டின் பழைய பதிப்புகள் 4.3 (`GH-89186`_) காப்பாற்றப்பட்ட வளங்களைத் திறக்க முடியாமல் போகலாம்.
uk: ``PackedByteArray`` тепер може використовувати більш компактне кодування base64 для зберігання. Але компроміс полягає в тому, що це порушує сумісність, а це означає, що старіші версії Godot можуть не мати змоги відкрити ресурси, збережені 4.3 (`GH-89186`_).
zh_cn: ``PackedByteArray`` 现在能够使用更紧凑的 base64 编码进行存储。但代价是它破坏了兼容性，这意味着旧版本的 Godot 可能无法打开由 4.3 版本保存的资源（`GH-89186`_\）。
zh_hant: ``PackedByteArray`` 現在能使用更精簡的 base64 編碼來儲存資料。但這樣會影響相容性，代表舊版 Godot 可能無法開啟由 4.3 儲存的資源（詳見 `GH-89186`_）。
