Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.2.po
Languages: es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hant

source: Upgrading from Godot 4.1 to Godot 4.2
es: Migrando desde Godot 4.1 a Godot 4.2
fr: Mise à niveau de Godot 4.1 à Godot 4.2
ga: Uasghrádú ó Godot 4.1 go Godot 4.2
it: Passare da Godot 4.1 a Godot 4.2
pt_br: Atualizando do Godot 4.1 para o Godot 4.2
ru: Обновление с Godot 4.1 на Godot 4.2
ta: கோடோட் 4.1 இலிருந்து கோடோட்டுக்கு மேம்படுத்துகிறது 4.2
tr: Godot 4.1'den Godot 4.2'ye yükseltme
uk: Оновлення з Godot 4.1 до Godot 4.2
zh_hant: 從 Godot 4.1 升級到 Godot 4.2

source: For most games and apps made with 4.1 it should be relatively safe to migrate to 4.2. This page intends to cover everything you need to pay attention to when migrating your project.
es: Para la mayoría de los juegos y aplicaciones creados con 4.1, debería ser relativamente seguro migrar a 4.2. Esta página pretende cubrir todo lo que necesita prestar atención al migrar tu proyecto.
fr: Pour la plupart des jeux et applications fabriqués en 4.1, il devrait être relativement sûr de migrer en 4.2. Cette page a l'intention de couvrir tout ce dont vous avez besoin de faire attention à lors de la migration de votre projet.
ga: I gcás fhormhór na gcluichí agus na n-aipeanna a dhéantar le 4.1 ba chóir go mbeadh sé réasúnta sábháilte dul ar imirce go 4.2. Tá sé i gceist ag an leathanach seo gach rud a theastaíonn uait chun aird a thabhairt air a chlúdach agus do thionscadal á aistriú agat.
it: Per la maggior parte dei giochi e delle applicazioni creati in 4.1, dovrebbe essere relativamente sicuro migrare a 4.2. Questa pagina intende illustrare tutti gli aspetti a cui prestare attenzione durante la migrazione del proprio progetto.
pt_br: Para a maioria dos jogos e aplicativos feitos com a versão 4.1, deve ser relativamente seguro migrar para a versão 4.2. Esta página tem a intenção de cobrir tudo o que você precisa para prestar atenção ao migrar seu projeto.
ru: Большинство игр и приложений сделанных в 4.1 может быть относительно легко перенесено на 4.2. Эта страница предназначена для освещения всего что требует внимания при переносе вашего проекта.
ta: 4.1 உடன் தயாரிக்கப்பட்ட பெரும்பாலான விளையாட்டுகளுக்கும் பயன்பாடுகளுக்கும் 4.2 க்கு இடம்பெயர்வது ஒப்பீட்டளவில் பாதுகாப்பாக இருக்க வேண்டும். உங்கள் திட்டத்தை நகர்த்தும்போது நீங்கள் கவனம் செலுத்த வேண்டிய அனைத்தையும் மறைக்க இந்த பக்கம் விரும்புகிறது.
tr: Çoğu oyunlar ve 4.1 ile yapılmış uygulamalar için 4.2'ye geçiş nispeten güvenli olmalıdır. Bu sayfa, projenizi taşırken dikkat etmeniz gereken her şeyi kapsamayı amaçlamaktadır.
uk: Для більшості ігор і програм, створених за допомогою 4.1, перехід на 4.2 має бути відносно безпечним. На цій сторінці описано все, на що потрібно звернути увагу під час міграції вашого проекту.
zh_hant: 對於大多數使用 4.1 製作的遊戲和應用程式來說，遷移到 4.2 應該相對安全。本頁旨在介紹遷移專案時需要注意的所有事項。

source: Breaking changes
es: Cambios importantes
ga: Athruithe a bhriseadh
it: Cambiamenti distruttivi
ru: Изменения ломающие обратную совместимость
ta: மாற்றங்களை உடைத்தல்
tr: Bozucu değişiklikler
uk: Ломальні зміни
zh_hant: 做出更改

source: If you are migrating from 4.1 to 4.2, the breaking changes listed here might affect you. Changes are grouped by areas/systems.
es: Si estás migrando de 4.1 a 4.2, los cambios importantes que se enumeran aquí podrían afectarle. Los cambios se agrupan por áreas/sistemas.
fr: Si vous migrez de 4.1 à 4.2, les changements cassants énumérés ici pourraient vous affecter. Les changements sont regroupés par zones/systèmes.
ga: Má tá tú ag aistriú ó 4.1 go 4.2, d'fhéadfadh na hathruithe briste atá liostaithe anseo dul i bhfeidhm ort. Déantar athruithe a ghrúpáil de réir limistéir/córais.
it: Se stai migrando dalla versione 4.1 alla 4.2, i cambiamenti distruttivi elencati qui potrebbero interessarti. I cambiamenti sono raggruppate per aree/sistemi.
pt_br: Se você estiver migrando da versão 4.1 para a 4.2, as alterações significativas listadas aqui podem afetá-lo. As alterações são agrupadas por áreas/sistemas.
ru: Если вы переноситесь с 4.1 на 4.2, изменения нарушающие обратную совместимость перечисленные здесь могут затронуть вас. Изменения сгруппированы по областям/системам.
ta: நீங்கள் 4.1 முதல் 4.2 வரை இடம்பெயர்கிறீர்கள் என்றால், இங்கே பட்டியலிடப்பட்டுள்ள உடைக்கும் மாற்றங்கள் உங்களைப் பாதிக்கலாம். மாற்றங்கள் பகுதிகள்/அமைப்புகளால் தொகுக்கப்படுகின்றன.
tr: Eğer 4.1'den 4.2'ye geçiş yapıyorsanız, burada listelenen bozucu değişiklikler sizi etkileyebilir. Değişiklikler alanlara/sistemlere göre gruplandırılmıştır.
uk: Якщо ви переходите з 4.1 на 4.2, перелічені тут критичні зміни можуть вплинути на вас. Зміни згруповано за сферами/системами.
zh_hant: 如果你要從 4.1 遷移到 4.2，這裡列出的破壞性更改可能會影響到你。更改按照領域/系統群組。

source: The :ref:`class_Mesh` resource format has changed in 4.2 to allow for `vertex and attribute compression <https://github.com/godotengine/godot/pull/81138>`__. This allows for improved rendering performance, especially on platforms constrained by memory bandwidth such as mobile.
es: El formato de recurso :ref:`class_Mesh` ha cambiado en la versión 4.2 para permitir `compresión de vertices y atributos <https://github.com/godotengine/godot/pull/81138>`__. Esto permite mejorar el rendimiento del renderizado, especialmente sobre plataformas limitadas por ancho de banda de memoria tales como los teléfonos móviles.
fr: Le format de ressource :ref:`class_Mesh` a changé en 4.2 pour permettre `la compression de sommet et d'attribut <https://github.com/godotengine/godot/pull/81138>`__. Cela permet d'améliorer les performances de rendu, en particulier sur les plateformes contraintes par la bande passante de la mémoire comme les plateformes mobile.
ga: Athraíodh an fhormáid acmhainne :ref:`class_Mesh` in 4.2 chun `vertex agus comhbhrú aitreabúide a cheadú <https://github.com/godotengine/godot/pull/81138>`__. Ligeann sé seo feidhmíocht rindreála feabhsaithe, go háirithe ar ardáin atá srianta ag bandaleithead cuimhne ar nós fón póca.
it: Il formato delle risorse :ref:`class_Mesh` è stato modificato nella versione 4.2 per permettere la `compressione di vertici e attributi <https://github.com/godotengine/godot/pull/81138>`__. Ciò porta a migliori prestazioni di rendering, soprattutto su piattaforme limitate dalla banda di memoria, come i dispositivi mobili.
pt_br: O formato de recurso :ref:`class_Mesh` mudou na versão 4.2 para permitir `compressão de vértices e atributos <https://github.com/godotengine/godot/pull/81138>`__. Isso possibilita uma melhora no desempenho de renderização, especialmente em plataformas limitadas pela largura de banda da memória, como dispositivos móveis.
ru: Формат ресурса :ref:`class_Mesh` изменен в 4.2 для разрешения `вершинной и атрибутной компрессии <https://github.com/godotengine/godot/pull/81138>`__. Это позволяет улучшать производительность отрисовки, особенно на платформах ограниченных по шине памяти такие как мобильные телефоны.
ta: தி: ரெஃப்: `கிளாச்_மேச்` வள வடிவம் 4.2 இல் மாறிவிட்டது,` வெர்டெக்ச் மற்றும் சுருக்க சுருக்கத்தை அனுமதிக்க <https://github.com/godotengine/godot/pull/81138> __. இது மேம்பட்ட வழங்குதல் செயல்திறனை அனுமதிக்கிறது, குறிப்பாக மொபைல் போன்ற நினைவக அலைவரிசையால் கட்டுப்படுத்தப்படும் தளங்களில்.
tr: :ref:`class_Mesh` kaynak formatı 4.2'de `vertex ve öznitelik sıkıştırmasına <https://github.com/godotengine/godot/pull/81138>`__ izin verecek şekilde değiştirilmiştir. Bu, özellikle mobil cihazlar gibi bellek bant genişliği kısıtlı platformlarda daha iyi işleme performansı sağlar.
uk: Формат ресурсу :ref:`class_Mesh` змінено в 4.2, щоб дозволити `стиск вершин і атрибутів <https://github.com/godotengine/godot/pull/81138>`__. Це дозволяє підвищити продуктивність візуалізації, особливо на платформах, обмежених пропускною здатністю пам’яті, наприклад мобільних.
zh_hant: :ref:`class_Mesh` 資源格式在 4.2 版本中已變更，以支援 `頂點與屬性壓縮 <https://github.com/godotengine/godot/pull/81138>`__ 。這能提升算繪效能，尤其是在受限於記憶體頻寬的平台（如行動裝置）上。

source: It is still possible to load the Godot 4.0-4.1 Mesh formats, but it is **not** possible to load the Godot 4.2 Mesh format in prior Godot versions. When opening a Godot project made with a version prior to 4.2, you may be presented with an upgrade dialog that offers two options:
es: Todavía es posible cargar los formatos Mesh de Godot4.0-4.1, pero **no** es posible cargar el formato Mesh de Godot 4.2 en versiones previas de Godot. Cuando abrimos un proyecto de Godot hecho con una versión previa a 4.2, deberías presenciar un dialogo de migración que ofrece dos opciones:
fr: Il est encore possible de charger les formats de Mesh Godot 4.0-4.1, mais il est **impossible** de charger le format Mesh Godot 4.2 dans les versions antérieures de Godot. Lors de l'ouverture d'un projet Godot réalisé avec une version avant la 4.2, vous pouvez être présenté avec un dialogue de mise à niveau qui offre deux options :
ga: Is féidir fós a luchtú an Godot 4.0-4.1 formáidí mogalra, ach tá sé ** ní ** is féidir a luchtú an fhormáid Mogalra Godot 4.2 i leaganacha Godot roimh ré. Nuair a oscailt tionscadal Godot a rinneadh le leagan roimh 4.2, is féidir leat a chur i láthair le dialóg uasghrádú a thairgeann dhá rogha:
it: È ancora possibile caricare i formati Mesh di Godot 4.0-4.1, ma **non** è possibile caricare il formato Mesh di Godot 4.2 nelle versioni precedenti di Godot. Quando si apre un progetto Godot creato con una versione precedente alla 4.2, potrebbe apparire una finestra di dialogo di aggiornamento con due opzioni:
pt_br: Ainda é possível carregar os formatos Mesh do Godot 4.0-4.1, mas **não** é possível carregar o formato Mesh do Godot 4.2 em versões anteriores do Godot. Ao abrir um projeto Godot criado com uma versão anterior à 4.2, você poderá ver uma caixa de diálogo de atualização com duas opções:
ru: Все еще возможно загружать форматы сеток из Godot 4.0-4.1, но **не** возможно загрузить формат сетки из Godot 4.2 в предыдущих версиях Godot. При открытии проекта Godot на версии до 4.2, вам может быть показан диалог обновления который предлагает две опции:
ta: கோடோட் 4.0-4.1 கண்ணி வடிவங்களை ஏற்றுவது இன்னும் சாத்தியம், ஆனால் முந்தைய கோடோட் பதிப்புகளில் கோடோட் 4.2 கண்ணி வடிவமைப்பை ஏற்றுவது ** சாத்தியமில்லை. 4.2 க்கு முன்னர் ஒரு பதிப்பைக் கொண்டு தயாரிக்கப்பட்ட கோடோட் திட்டத்தைத் திறக்கும்போது, இரண்டு விருப்பங்களை வழங்கும் மேம்படுத்தல் உரையாடல் உங்களுக்கு வழங்கப்படலாம்:
tr: Godot 4.0-4.1 Mesh biçimlerini yüklemek hala mümkündür, ancak Godot 4.2 Mesh biçimini önceki Godot sürümlerine yüklemek **mümkün değildir**. Godot 4.2'den önceki bir sürümle yapılmış bir Godot projesini açarken, iki seçenek sunan bir yükseltme iletişim kutusu ile karşılaşabilirsiniz:
uk: Все ще можна завантажити формати Godot 4.0-4.1 Mesh, але **не** можливо завантажити формат Godot 4.2 Mesh у попередніх версіях Godot. Під час відкриття проекту Godot, створеного з версією до 4.2, вам може відобразитися діалогове вікно оновлення, яке пропонує два варіанти:
zh_hant: 仍然可以載入 Godot 4.0-4.1 的網格格式，但**無法**在舊版的 Godot 中載入 Godot 4.2 的網格格式。當開啟使用 4.2 之前的版本製作的 Godot 專案時，您可能會看到一個升級對話框，提供兩個選項：

source: **Restart & Upgrade:** Upgrades the mesh format for all meshes in the project and saves the result to disk. Once chosen, this option prevents downgrading the project to a Godot version prior to 4.2. Set up a version control system and push your changes *before* choosing this option!
es: **Reiniciar y Actualizar:** Actualiza el formato mesh para todos los meshes en el proyecto y guarda el resultado en el disco. Una vez seleccionado, esta opción previene actualizar el proyecto a versiones previas de Godot 4.2. Configura un sistema de control de versiones y sube tus cambios *antes* de seleccionar esta opción!
fr: **Redémarrer & Mettre à jour :** Met à jour le format de maillage pour tous les maillages dans le projet et sauvegarde le résultat sur le disque. Une fois choisie, cette option empêche la dégradation du projet vers une version Godot avant 4.2. Définissez un système de contrôle de version et poussez vos changements *avant* de choisir cette option !
ga: **Atosaigh & Uasghrádaigh:** Uasghrádaítear an fhormáid mogaill do gach mogaill sa tionscadal agus sábhálann sé an toradh ar diosca. Nuair a roghnaítear é, cuireann an rogha seo cosc ar an tionscadal a íosghrádú go leagan Godot roimh 4.2. Socraigh córas rialaithe leagan agus brúigh do chuid athruithe *roimh* roghnú an rogha seo!
it: **Riavvia e aggiorna:** Aggiorna il formato mesh per tutte le mesh del progetto e salva il risultato su disco. Una volta selezionata, questa opzione impedisce al progetto di tornare a una versione di Godot precedente alla 4.2. Impostare un sistema di controllo versione e inviare le modifiche *prima* di scegliere questa opzione!
pt_br: **Reiniciar e Atualizar:** Atualiza o formato de malha para todas as malhas do projeto e salva o resultado em disco. Uma vez selecionada, esta opção impede o downgrade do projeto para uma versão do Godot anterior à 4.2. Configure um sistema de controle de versão e envie suas alterações *antes* de escolher esta opção!
ru: **Перезапуск & Обновление:** Обновляет формат сетки для всех мешей в проекте и сохраняет результат на диск. После выбора, эта опция предотвращает возврат проекта на предыдущую версию Godot до 4.2. Установите систему контроля версий и делайте push-ваших изменений **перед** выбором этой опции!
ta: ** மறுதொடக்கம் செய்து மேம்படுத்தவும்: ** திட்டத்தில் உள்ள அனைத்து மெச்களுக்கும் கண்ணி வடிவமைப்பை மேம்படுத்தி, முடிவை வட்டில் சேமிக்கிறது. தேர்ந்தெடுக்கப்பட்டதும், இந்த விருப்பம் 4.2 க்கு முன்னர் திட்டத்தை ஒரு கோடோட் பதிப்பிற்கு தரமிறக்குவதைத் தடுக்கிறது. ஒரு பதிப்பு கட்டுப்பாட்டு அமைப்பை அமைத்து, இந்த விருப்பத்தைத் தேர்ந்தெடுப்பதற்கு முன் * உங்கள் மாற்றங்களை * தள்ளுங்கள்!
tr: **Yeniden Başlat ve Yükselt:** Projedeki tüm örgüler için örgü biçimlerini yükseltir ve sonucu diske kaydeder. Bu seçenek seçildiğinde, projenin 4.2'den önceki bir Godot sürümüne düşürülmesi engellenir. Bir sürüm kontrol sistemi kurun ve değişikliklerinizi *bu seçeneği seçmeden önce* gönderin!
uk: **Перезапуск і оновлення:** оновлює формат сітки для всіх сіток у проекті та зберігає результат на диск. Після вибору цей параметр запобігає поверненню проекту до версії Godot, ранішої за 4.2. Налаштуйте систему контролю версій і внесіть свої зміни *перед* вибором цієї опції!
zh_hant: **重新啟動並升級：** 升級專案中所有網格（Mesh）的格式並儲存到磁碟。選擇此選項後，將無法將專案降版回 Godot 4.2 之前的版本。請務必在選擇此選項*之前*，設定好版本控制系統並推送你的變更！

source: **Upgrade Only:** Upgrades the mesh format in-memory without writing it to disk. This allows downgrading the project to a Godot version older than 4.2 if you need to do so in the future. The downside is that loading the project will be slower every time as the mesh format needs to be upgraded every time the project is loaded. These increased loading times will also affect the exported project. The number and complexity of Mesh resources determines how much loading times are affected.
es: **Actualizar solamente:** Actualiza el formato mesh en-memoria sin escribirlo en el disco. Esto permite actualizar el proyecto a versiones de Godot más antiguas que la 4.2 si necesitas hacerlo en el futuro. La desventaja es que la carga del proyecto será cada vez más lenta ya que el formato mesh debe actualizarse cada vez que se carga el proyecto. Estos incrementos en los tiempos de carga también afectarán al proyecto exportado. La cantidad y la complejidad de los recursos Mesh determinan en cuánto se ven afectados los tiempos de carga.
fr: ** Mise à jour seulement :** Met à jour le format de maillage en mémoire sans l'écrire sur le disque. Cela permet de réduire le projet à une version Godot plus ancienne que 4.2 si vous devez le faire à l'avenir. Le désavantage est que le chargement du projet sera plus lent à chaque fois car le format de maillage doit être amélioré à chaque fois que le projet est chargé. Ces temps de chargement accrus affecteront également le projet exporté. Le nombre et la complexité des ressources de Mesh déterminent comment les temps de chargement sont affectés.
ga: **Uasghrádú Amháin:** Uasghrádú an fhormáid mogalra i-chuimhne gan é a scríobh ar dhiosca. Ligeann sé seo íosghrádú an tionscadail le leagan Godot níos sine ná 4.2 más gá duit é sin a dhéanamh sa todhchaí. Is é an míbhuntáiste ná go mbeidh luchtú an tionscadail níos moille gach uair mar is gá an fhormáid mogalra a uasghrádú gach uair a luchtaítear an tionscadal. Beidh tionchar ag na hamanna luchtaithe méadaithe seo ar an tionscadal onnmhairithe freisin. Cinneann líon agus castacht na n-acmhainní mogalra cé mhéad amanna luchtaithe a bhfuil tionchar acu.
it: **Solo aggiornamento:** Aggiorna il formato mesh in memoria senza scriverlo su disco. Questo consente di tornare a una versione di Godot precedente alla 4.2, se necessario, in futuro. Lo svantaggio è caricare il progetto richiederà più tempo ogni volta, poiché il formato mesh deve essere aggiornato a ogni caricamento del progetto. Questi tempi di caricamento più lunghi influiranno anche sul progetto esportato. Il numero e la complessità delle risorse mesh determinano l'impatto sui tempi di caricamento.
pt_br: **Somente Atualização:** Atualiza o formato da malha na memória sem gravá-lo em disco. Isso permite fazer downgrade do projeto para uma versão do Godot anterior à 4.2, caso seja necessário no futuro. A desvantagem é que o carregamento do projeto será mais lento a cada vez, pois o formato da malha precisa ser atualizado sempre que o projeto for carregado. Esses tempos de carregamento mais longos também afetarão o projeto exportado. A quantidade e complexidade dos recursos da malha determinam o quanto os tempos de carregamento são afetados.
ru: **Только Обновление:** Обновляет формат сетки в памяти без записи на диск. Это позволяет откатывать проект на версию Godot старше 4.2 если вам потребуется это в будущем. Недостатком этого будет более медленная загрузка так как формат сеток будет обновляться при каждом запуске проекта. Увеличенное время загрузки также влияет на экспортируемый проект. Количество и сложность ресурсов Мешей влияет на продолжительность времени загрузки.
ta: ** மேம்படுத்தவும்: ** கண்ணி வடிவத்தை வட்டில் எழுதாமல் நினைவகத்தில் மேம்படுத்துகிறது. எதிர்காலத்தில் நீங்கள் அவ்வாறு செய்ய வேண்டுமானால், 4.2 ஐ விட பழைய கோடோட் பதிப்பிற்கு திட்டத்தை தரமிறக்க அனுமதிக்கிறது. தீங்கு என்னவென்றால், ஒவ்வொரு முறையும் திட்டத்தை ஏற்றுவது ஒவ்வொரு முறையும் மெதுவாக இருக்கும், ஏனெனில் ஒவ்வொரு முறையும் திட்டம் ஏற்றப்படும் போது கண்ணி வடிவத்தை மேம்படுத்த வேண்டும். இந்த அதிகரித்த ஏற்றுதல் நேரங்களும் ஏற்றுமதி செய்யப்பட்ட திட்டத்தையும் பாதிக்கும். மெச் வளங்களின் எண்ணிக்கை மற்றும் சிக்கலானது எவ்வளவு ஏற்றுதல் நேரங்கள் பாதிக்கப்படுகின்றன என்பதை தீர்மானிக்கிறது.
tr: **Yalnızca Yükseltme:** Örgü biçimini diske yazmadan bellek içinde yükseltir. Bu, gelecekte bunu yapmanız gerekirse projeyi 4.2'den daha eski bir Godot sürümüne düşürmenize olanak tanır. Dezavantajı ise, proje her yüklendiğinde örgü biçiminin yükseltilmesi gerektiğinden, projenin yüklenmesinin her seferinde daha yavaş olmasıdır. Bu artan yükleme süreleri dışa aktarılan projeyi de etkileyecektir. Örgü kaynaklarının sayısı ve karmaşıklığı yükleme sürelerinin ne kadar etkileneceğini belirler.
uk: **Лише оновлення:** оновлює формат сітки в пам’яті без запису на диск. Це дозволяє знизити версію проекту до версії Godot, старішої за 4.2, якщо вам знадобиться це зробити в майбутньому. Недоліком є те, що завантаження проекту відбуватиметься повільніше щоразу, оскільки формат сітки потрібно оновлювати щоразу, коли завантажується проект. Ці збільшення часу завантаження також вплинуть на експортований проект. Кількість і складність ресурсів Mesh визначає, наскільки це впливає на час завантаження.
zh_hant: **僅升級：** 只在記憶體中升級網格格式，不會寫入磁碟。這樣一來，如果未來有需要，仍可將專案降版至 4.2 以前的 Godot 版本。缺點是每次載入專案時都會重新升級網格格式，導致載入速度變慢，這種載入延遲也會影響到導出的專案。網格資源的數量與複雜度會決定載入時間受影響的程度。

source: If this dialog doesn't appear, use **Project > Tools > Upgrade Mesh Surfaces…** at the top of the editor.
es: Si el diálogo no aparece, use **Proyecto > Herramientas > Actualizar Superficies Mesh…** en la parte superior del editor.
fr: Si cette boîte de dialogue n'apparaît pas, utilisez **Projet > Outils > Mise à jour des surfaces de maillage** en haut de l'éditeur.
ga: Mura bhfuil an dialóg seo le feiceáil, úsáid **Tionscadal > Uirlisí > Uasghrádaigh Dromchlaí Mogall…** ag barr an eagarthóra.
it: Se questa finestra di dialogo non viene visualizzata, utilizzare **Progetto > Strumenti > Aggiorna superfici mesh…** nella parte superiore dell'editor.
pt_br: Se esta caixa de diálogo não aparecer, use **Projeto > Ferramentas > Atualizar Superfícies de Malhas…** na parte superior do editor.
ru: Если этот диалог не показывается, используйте опцию **Проект> Инструменты> Обновить поверхности сетки…** наверху редактора.
ta: இந்த உரையாடல் தோன்றவில்லை என்றால், ** திட்டம்> கருவிகள்> மெச் மேற்பரப்புகளை மேம்படுத்தவும்… ** எடிட்டரின் மேற்புறத்தில்.
tr: Bu iletişim kutusu görünmezse, düzenleyicinin üst kısmındaki **Proje > Araçlar > Örgü Yüzeylerini Yükselt...** seçeneğini kullanın.
uk: Якщо це діалогове вікно не з’являється, скористайтеся **Проект > Інструменти > Оновити сітчасті поверхні…** у верхній частині редактора.
zh_hant: 如果沒有出現此對話框，請在編輯器上方選擇 **專案 > 工具 > 升級網格表面…** 來手動執行升級。

source: This article indicates whether each breaking change affects GDScript and whether the C# breaking change is *binary compatible* or *source compatible*:
es: Este artículo indica si cada cambio significativo afecta a GDScript y si el cambio significativo en C# es *compatible binario* o *compatible con el código fuente*:
ga: Léiríonn an t-alt seo an dtéann gach athrú briste i bhfeidhm ar GDScript agus cibé an bhfuil an t-athrú briste C # *binary compatible *nó *source compatible *:
it: Questo articolo indica se ogni cambiamento distruttivo influisce su GDScript e se un cambiamento distruttivo in C# è *compatibile con il binario* o *compatibile con il codice sorgente*:
pt_br: Este artigo indica se cada alteração drástica afeta o GDScript e se a alteração drástica do C# é *compatível com o binário* ou *compatível com o código-fonte*:
ru: Эта статья показывает, где каждое изменение обратной совместимости влияет на GDScript и где изменение обратной совместимости C# *бинарно совместимо* или *совместимо на уровне кода*:
ta: இந்த கட்டுரை ஒவ்வொரு முறிவு மாற்றமும் gdscript ஐ பாதிக்கிறதா என்பதையும், சி# முறிவு மாற்றம் *பைனரி இணக்கமானதா *அல்லது *மூல இணக்கமானதா *:
tr: Bu makale, her bir bozucu değişikliğin GDScript'i etkileyip etkilemediğini ve C# bozucu değişikliğinin *ikili uyumlu* mu yoksa *kaynak uyumlu* mu olduğunu gösterir:
uk: У цій статті вказується, чи кожна порушна зміна впливає на GDScript і чи є порушна зміна C# *бінарною сумісністю* чи *сумісною з джерелом*:
zh_hant: 這篇文章指出了每項破壞性改動是否會影響 GDScript，以及 C# 的破壞性改動是 *二進位相容* 還是 *原始程式碼相容*：

source: **Source compatible** - Source code will compile successfully without changes when upgrading Godot.
es: **Compatible con el código fuente**: el código fuente se compila correctamente sin ningún cambio al actualizar Godot.
fr: **Compatible source** - Le code source compilera avec succès sans changement lors de la mise à niveau de Godot.
ga: ** Foinse comhoiriúnach ** - Tiomsóidh cód foinse go rathúil gan athruithe nuair a uasghrádú Godot.
it: **Compatibile con il codice sorgente** - Il codice sorgente sarà compilato correttamente senza cambiamenti all'aggiornamento di Godot.
pt_br: **Compatível com a fonte** - O código fonte será compilado com sucesso, sem alterações, ao atualizar o Godot.
ru: **Совместимо на уровне кода** - Исходный код будет успешно компилироваться без изменений при обновлении Godot.
ta: ** மூல இணக்கமான ** - கோடோட்டை மேம்படுத்தும்போது மாற்றங்கள் இல்லாமல் மூலக் குறியீடு வெற்றிகரமாக தொகுக்கும்.
tr: **Kaynak uyumlu** - Godot'yu yükseltirken kaynak kodu değişiklik yapılmadan başarıyla derlenecektir.
uk: **Сумісність із вихідним кодом** – вихідний код буде успішно скомпільовано без змін під час оновлення Godot.
zh_hant: ** 原始程式碼相容** —— 在升級 Godot 時，原始程式碼可成功編譯，無需更改。
