Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.3.po
Languages: es, fr, it, pt_br, ru, ta, uk, zh_cn, zh_hant

source: Upgrading from Godot 4.2 to Godot 4.3
es: Migrar desde Godot 4.2 a Godot 4.3
fr: Mise à niveau de Godot 4.2 vers Godot 4.3
it: Passare da Godot 4.2 a Godot 4.3
ru: Обновление с Godot 4.2 на Godot 4.3
ta: கோடோட் 4.2 இலிருந்து கோடோட்டுக்கு மேம்படுத்துதல் 4.3
uk: Оновлення з Godot 4.2 до Godot 4.3
zh_cn: 从 Godot 4.2 升级到 Godot 4.3
zh_hant: 從 Godot 4.2 升級到 Godot 4.3

source: For most games and apps made with 4.2 it should be relatively safe to migrate to 4.3. This page intends to cover everything you need to pay attention to when migrating your project.
fr: Pour la plupart des jeux et applications fabriqués en 4.2, il devrait être relativement sûr de migrer en 4.3. Cette page a l'intention de couvrir tout ce dont vous avez besoin de faire attention à lors de la migration de votre projet.
it: Per la maggior parte dei giochi e delle applicazioni creati in 4.2, dovrebbe essere relativamente sicuro migrare a 4.3. Questa pagina intende illustrare tutti gli aspetti a cui prestare attenzione durante la migrazione del proprio progetto.
ru: Для большинства игр и приложений, созданных с 4.2, миграция на 4.3 должна быть относительно безопасной. На этой странице вы найдете все, на что следует обратить внимание при миграции вашего проекта.
ta: 4.2 உடன் தயாரிக்கப்பட்ட பெரும்பாலான விளையாட்டுகளுக்கும் பயன்பாடுகளுக்கும் 4.3 க்கு இடம்பெயர்வது ஒப்பீட்டளவில் பாதுகாப்பாக இருக்க வேண்டும். உங்கள் திட்டத்தை நகர்த்தும்போது நீங்கள் கவனம் செலுத்த வேண்டிய அனைத்தையும் மறைக்க இந்த பக்கம் விரும்புகிறது.
uk: Для більшості ігор і програм, створених з 4.2, перехід на 4.3 має бути відносно безпечним. На цій сторінці описано все, на що потрібно звернути увагу під час міграції вашого проекту.
zh_cn: 对于大多数使用 4.2 制作的游戏和应用程序来说，迁移到 4.3 应该相对安全。本页旨在介绍迁移项目时需要注意的所有事项。
zh_hant: 對於大多數以 4.2 製作的遊戲和應用程式來說，升級到 4.3 應該相對安全。本頁將說明專案升級時需要注意的所有事項。

source: Breaking changes
es: Cambios importantes
it: Modifiche incompatibili
ru: Изменения ломающие обратную совместимость
ta: மாற்றங்களை உடைத்தல்
uk: Ломальні зміни
zh_cn: 破坏性更改
zh_hant: 做出更改

source: If you are migrating from 4.2 to 4.3, the breaking changes listed here might affect you. Changes are grouped by areas/systems.
es: Si estás migrando de 4.2 a 4.3, los cambios importantes que se enumeran aquí podrían afectarle. Los cambios se agrupan por áreas/sistemas.
fr: Si vous migrez de la 4.2 à la 4.3, les changements cassants énumérés ici pourraient vous affecter. Les changements sont regroupés par zones/systèmes.
it: Se stai migrando dalla versione 4.2 alla 4.3, le modifiche incompatibili elencate qui potrebbero interessarti. Le modifiche sono raggruppate per aree/sistemi.
pt_br: Se você estiver migrando da versão 4.2 para a 4.3, as alterações significativas listadas aqui podem afetá-lo. As alterações são agrupadas por áreas/sistemas.
ru: Если вы переходите с 4.2 на 4.3, изменения нарушающие обратную совместимость перечисленные здесь могут затронуть вас. Изменения сгруппированы по областям/системам.
ta: நீங்கள் 4.2 முதல் 4.3 வரை இடம்பெயர்கிறீர்கள் என்றால், இங்கே பட்டியலிடப்பட்டுள்ள உடைக்கும் மாற்றங்கள் உங்களைப் பாதிக்கலாம். மாற்றங்கள் பகுதிகள்/அமைப்புகளால் தொகுக்கப்படுகின்றன.
uk: Якщо ви переходите з 4.2 на 4.3, перелічені тут критичні зміни можуть вплинути на вас. Зміни згруповано за сферами/системами.
zh_cn: 如果你要从 4.2 迁移到 4.3，这里列出的破坏性更改可能会影响到你。更改按照领域/系统分组。
zh_hant: 如果你要從 4.2 升級到 4.3，這裡列出的不相容變更可能會影響到你的專案。變更內容依領域/系統分類整理。

source: This article indicates whether each breaking change affects GDScript and whether the C# breaking change is *binary compatible* or *source compatible*:
es: Este artículo indica si cada cambio significativo afecta a GDScript y si el cambio significativo en C# es *compatible binario* o *compatible con el código fuente*:
it: Questo articolo indica se ogni modifica incompatibile influisce su GDScript e se una modifica incompatibile in C# è *compatibile con il binario* o *compatibile con il codice sorgente*:
pt_br: Este artigo indica se cada alteração drástica afeta o GDScript e se a alteração drástica do C# é *compatível com o binário* ou *compatível com o código-fonte*:
ru: Эта статья показывает, где каждое изменение обратной совместимости влияет на GDScript и где изменение обратной совместимости C# *бинарно совместимо* или *совместимо на уровне кода*:
ta: இந்த கட்டுரை ஒவ்வொரு முறிவு மாற்றமும் gdscript ஐ பாதிக்கிறதா என்பதையும், சி# முறிவு மாற்றம் *பைனரி இணக்கமானதா *அல்லது *மூல இணக்கமானதா *:
uk: У цій статті вказується, чи кожна порушна зміна впливає на GDScript і чи є порушна зміна C# *бінарною сумісністю* чи *сумісною з джерелом*:
zh_cn: 这篇文章指出了每项破坏性改动是否会影响 GDScript，以及 C# 的破坏性改动是 *二进制兼容* 还是 *源代码兼容*\ ：
zh_hant: 這篇文章指出了每項破壞性改動是否會影響 GDScript，以及 C# 的破壞性改動是 *二進位相容* 還是 *原始程式碼相容*：

source: **Binary compatible** - Existing binaries will load and execute successfully without recompilation, and the runtime behavior won't change.
fr: **Binaire compatible** - Les binaires existantes vont charger et s'exécuter avec succès sans recompilation, et le comportement lors de l'exécution ne changera pas.
it: **Compatibile con gli eseguibili** - Gli eseguibili esistenti saranno caricati ed eseguiti correttamente senza necessità di ricompilazione e il comportamento in fase di esecuzione non cambierà.
pt_br: **Compatível com binários** - Os binários existentes serão carregados e executados com sucesso sem recompilação, e o comportamento em tempo de execução não mudará.
ru: **Binary compatible (Совместимость на уровне двоичных файлов)** — существующие двоичные файлы будут успешно загружены и выполнены без перекомпиляции, а поведение среды выполнения не изменится.
ta: ** பைனரி இணக்கமானது ** - இருக்கும் பைனரிகள் மறுசீரமைப்பு இல்லாமல் வெற்றிகரமாக ஏற்றப்பட்டு செயல்படுத்தப்படும், மேலும் இயக்க நேர நடத்தை மாறாது.
uk: **Сумісність із двійковими файлами** – наявні двійкові файли завантажуватимуться та успішно виконуватимуться без повторної компіляції, а поведінка під час виконання не зміниться.
zh_cn: **二进制兼容** —— 现有二进制文件无需重新编译即可加载并成功执行，运行时的行为不会改变。
zh_hant: **二進制相容** - 現有的二進制檔案無需重新編譯即可成功載入和執行，且運行時的行為不會改變。

source: **Source compatible** - Source code will compile successfully without changes when upgrading Godot.
es: **Compatible con el código fuente**: el código fuente se compila correctamente sin ningún cambio al actualizar Godot.
fr: **Compatible source** - Le code source compilera avec succès sans changement lors de la mise à niveau de Godot.
it: **Compatibile con il codice sorgente** - Il codice sorgente sarà compilato correttamente senza cambiamenti all'aggiornamento di Godot.
pt_br: **Compatível com a fonte** - O código fonte será compilado com sucesso, sem alterações, ao atualizar o Godot.
ru: **Совместимо на уровне кода** - Исходный код будет успешно компилироваться без изменений при обновлении Godot.
ta: ** மூல இணக்கமான ** - கோடோட்டை மேம்படுத்தும்போது மாற்றங்கள் இல்லாமல் மூலக் குறியீடு வெற்றிகரமாக தொகுக்கும்.
uk: **Сумісність із вихідним кодом** – вихідний код буде успішно скомпільовано без змін під час оновлення Godot.
zh_cn: **源代码兼容**\ —— 在升级 Godot 时，源代码可成功编译，无需更改。
zh_hant: ** 原始程式碼相容** —— 在升級 Godot 時，原始程式碼可成功編譯，無需更改。

source: Change
es: Cambio
fr: Modifications
it: Cambiamento
ru: Изменение
ta: மாற்றம்
uk: Зміна
zh_cn: 更改
zh_hant: 改動

source: GDScript Compatible
es: Compatibilidad con GDScript
fr: Compatible GDScript
it: Compatibili con GDScript
ru: Совместимо с GDScript
ta: GDSCRIPT இணக்கமானது
uk: Сумісність з GDScript
zh_cn: GDScript 兼容
zh_hant: GDScript 格式化字串

source: C# Binary Compatible
es: Compatible con binarios C#
fr: Compatible binaire C#
it: Compatibili con eseguibili C#
pt_br: Compatível com C# Binário
ru: Совместимо с бинарным кодом C#
ta: சி# பைனரி இணக்கமானது
uk: C# двійковий сумісний
zh_cn: C# 二进制兼容
zh_hant: C# 二進位相容

source: C# Source Compatible
es: Compatible con código fuente C#
fr: Compatible source C#
it: Compatibili con codice sorgente C#
pt_br: Compatível com fonte C#
ru: Совместимо с исходным кодом C#
ta: சி# மூல இணக்கமானது
uk: Сумісність із вихідним кодом C#
zh_cn: C# 源代码兼容
zh_hant: C# 原始程式碼相容

source: Introduced
es: Introducido
fr: Intégré
it: Introdotti
ru: Введено в
ta: அறிமுகப்படுத்தப்பட்டது
uk: Введено
zh_cn: 引入
zh_hant: 簡介

source: Method ``close_library`` removed
es: Método ``close_library`` eliminado
fr: Méthode ``close_library`` supprimée
it: Metodo ``close_library`` rimosso
pt_br: Método ``close_library`` removido
ru: Method ``close_library`` удален
ta: முறை `` Close_library`` அகற்றப்பட்டது
uk: Метод ``close_library`` видалено
zh_cn: 移除了 ``close_library`` 方法
zh_hant: 方法 ``close_library`` 已移除

source: Method ``initialize_library`` removed
fr: Méthode ``initialize_library`` supprimée
it: Metodo ``initialize_library`` rimosso
pt_br: Método ``initialize_library`` removido
ru: Метод ``initialize_library`` удален
ta: முறை `` நூலகத்தைத் தொடங்கவும்` `அகற்றப்பட்டது
uk: Метод ``initialize_library`` видалено
zh_cn: 移除了 ``initialize_library`` 方法
zh_hant: 方法 ``initialize_library`` 已移除

source: Method ``open_library`` removed
es: Propiedad ``open_library`` eliminada
fr: Méthode ``open_library`` supprimée
it: Metodo ``open_library`` rimosso
pt_br: Método ``open_library`` removido
ru: Метод ``open_library`` удален
ta: முறை `` Open_Library`` அகற்றப்பட்டது
uk: Метод ``open_library`` видалено
zh_cn: 移除了 ``open_library`` 方法
zh_hant: 方法 ``open_library`` 已移除

source: Since it was basically impossible to use these methods in any useful way, these methods have been removed. Use ``GDExtensionManager::load_extension`` and ``GDExtensionManager::unload_extension`` instead to correctly load and unload a GDExtension.
es: Dado que era prácticamente imposible usar estos métodos de forma útil, se han eliminado. En su lugar, utiliza ``GDExtensionManager::load_extension`` y ``GDExtensionManager::unload_extension`` para cargar y descargar correctamente una GDExtension.
fr: Comme il était pratiquement impossible d'utiliser ces méthodes de manière utile, ces méthodes ont été supprimées. Utilisez ``GDExtensionManager::load_extension`` et ``GDExtensionManager::unload_extension`` à la place pour charger et décharger correctement une GDExtension.
it: Poiché era praticamente impossibile utilizzare questi metodi in modo utile, essi sono stati rimossi. Utilizzare invece ``GDExtensionManager::load_extension`` e ``GDExtensionManager::unload_extension`` per caricare e scaricare correttamente una GDExtension.
pt_br: Como era basicamente impossível usar esses métodos de forma útil, eles foram removidos. Use ``GDExtensionManager::load_extension`` e ``GDExtensionManager::unload_extension`` para carregar e descarregar corretamente uma GDExtension.
ru: Поскольку было в принципе невозможно использовать эти методы каким-либо полезным образом, эти методы были удалены. Используйте ``GDExtensionManager::load_extension`` и ``GDExtensionManager::unload_extension`` вместо этого, чтобы правильно загружать и выгружать GDExtension.
ta: Since it was basically impossible பெறுநர் use these முறைகள் in any useful way, these முறைகள் have been removed. Use ``GDExtensionManager::load_extension`` and ``GDExtensionManager::unload_extension`` instead பெறுநர் correctly load and unload a GDExtension.
uk: Оскільки було практично неможливо використовувати ці методи будь-яким корисним способом, ці методи були видалені. Замість цього використовуйте ``GDExtensionManager::load_extension`` і ``GDExtensionManager::unload_extension``, щоб правильно завантажити та вивантажити GDExtension.
zh_cn: 由于这些方法基本上无法以任何有用的方式使用，这些方法已被移除。请改用 ``GDExtensionManager::load_extension`` 和 ``GDExtensionManager::unload_extension`` 来正确加载和卸载 GDExtension。
zh_hant: 由於這些方法實際上無法被有效利用，因此已將其移除。請改用 ``GDExtensionManager::load_extension`` 和 ``GDExtensionManager::unload_extension`` 來正確載入與卸載 GDExtension。

source: Animation
es: Animación
it: Animazione
pt_br: Animação
ru: Анимация
ta: அனிமேசன்
uk: Анімація
zh_cn: 动画
zh_hant: 動畫

source: **Animation**
es: **Animación**
ru: **Анимация**
ta: ** அனிமேசன் **
uk: **Анімація**
zh_cn: **动画**
zh_hant: 動畫

source: Method ``position_track_interpolate`` adds a new ``backward`` optional parameter
es: El método ``position_track_interpolate`` añade un nuevo parámetro opcional ``backward``
fr: La méthode ``position_track_interpolate`` ajoute un nouveau paramètre optionnel ``backward``
it: Il metodo ``position_track_interpolate`` aggiunge un nuovo parametro facoltativo ``backward``
ru: Метод ``position_track_interpolate`` добавляет новый необязательный параметр ``backward``
ta: முறை `` pasition_track_interpolate`` புதிய `` பின்னோக்கி`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``position_track_interpolate`` додає новий необов’язковий параметр ``backward``
zh_cn: 方法 ``position_track_interpolate`` 添加了新的 ``backward`` 可选参数
zh_hant: 方法 ``position_track_interpolate`` 新增了 ``backward`` 選用參數

source: |✔️ with compat|
es: |✔️ compatible|
fr: |✔️ avec compatibilité|
ta: | இணக்கத்துடன் |
uk: |✔️ з compat|
zh_hant: | ✔️相容|

source: Method ``rotation_track_interpolate`` adds a new ``backward`` optional parameter
es: El método ``rotation_track_interpolate`` añade un nuevo parámetro opcional ``backward``
fr: La méthode ``rotation_track_interpolate`` ajoute un nouveau paramètre optionnel ``backward``
it: Il metodo ``rotation_track_interpolate`` aggiunge un nuovo parametro facoltativo ``backward``
ru: Метод ``rotation_track_interpolate`` добавляет новый необязательный параметр ``backward``
ta: முறை `` ROTATION_TRACK_INTERPOLATE`` புதிய `` பின்தங்கிய`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``rotation_track_interpolate`` додає новий необов'язковий параметр ``backward``
zh_cn: 方法 ``rotation_track_interpolate`` 添加了新的 ``backward`` 可选参数
zh_hant: 方法 ``rotation_track_interpolate`` 新增了 ``backward`` 選用參數

source: Method ``scale_track_interpolate`` adds a new ``backward`` optional parameter
fr: La méthode ``scale_track_interpolate`` ajoute un nouveau paramètre optionnel ``backward``
it: Il metodo ``scale_track_interpolate`` aggiunge un nuovo parametro facoltativo ``backward``
ru: Метод ``scale_track_interpolate`` добавляет новый необязательный параметр ``backward``
ta: முறை `` scale_track_interpolate`` புதிய `` பின்தங்கிய`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``scale_track_interpolate`` додає новий необов’язковий параметр ``backward``
zh_cn: 方法 ``scale_track_interpolate`` 添加了新的 ``backward`` 可选参数
zh_hant: 方法 ``scale_track_interpolate`` 新增了 ``backward`` 選用參數

source: Method ``blend_shape_track_interpolate`` adds a new ``backward`` optional parameter
fr: La méthode ``blend_shape_track_interpolate`` ajoute un nouveau paramètre optionnel ``backward``
it: Il metodo ``blend_shape_track_interpolate`` aggiunge un nuovo parametro facoltativo ``backward``
ru: Метод ``blend_shape_track_interpolate`` добавляет новый необязательный параметр ``backward``
ta: முறை `` CLEND_SHAPE_TRACK_INTERPOLATE`` புதிய `` பின்தங்கிய`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``blend_shape_track_interpolate`` додає новий необов'язковий параметр ``backward``
zh_cn: ``create_action`` 添加了可选的 ``backward_undo_ops`` 参数
zh_hant: 方法 ``blend_shape_track_interpolate`` 新增了 ``backward`` 選用參數

source: Method ``value_track_interpolate`` adds a new ``backward`` optional parameter
es: El método ``value_track_interpolate`` añade un nuevo parámetro opcional ``backward``
fr: La méthode ``value_track_interpolate`` ajoute un nouveau paramètre optionnel ``backward``
it: Il metodo ``value_track_interpolate`` aggiunge un nuovo parametro facoltativo ``backward``
ru: Метод ``value_track_interpolate`` добавляет новый необязательный параметр ``backward``
ta: முறை `` value_track_interpolate`` புதிய `` பின்னோக்கி`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``value_track_interpolate`` додає новий необов’язковий параметр ``backward``
zh_cn: 方法 ``value_track_interpolate`` 添加了新的 ``backward`` 可选参数
zh_hant: 方法 ``value_track_interpolate`` 新增了 ``backward`` 選用參數

source: Method ``track_find_key`` adds a new ``limit`` optional parameter
es: El método ``track_find_key`` añade un nuevo parámetro opcional ``limit``
fr: La méthode ``track_find_key`` ajoute un nouveau paramètre optionnel ``limit``
it: Il metodo ``track_find_key`` aggiunge un nuovo parametro facoltativo ``limit``
ru: Метод ``track_find_key`` добавляет новый необязательный параметр ``limit``
ta: முறை `` டிராக்_ஃபிண்ட்_கே`` புதிய `` வரம்பு`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``track_find_key`` додає новий необов’язковий параметр ``limit``
zh_cn: 方法 ``track_find_key`` 增加了新的 ``limit`` 可选参数
zh_hant: 方法 ``track_find_key`` 新增了 ``limit`` 選用參數

source: Method ``track_find_key`` adds a new ``backward`` optional parameter
es: El método ``track_find_key`` añade un nuevo parámetro opcional ``backward``
fr: La méthode ``track_find_key`` ajoute un nouveau paramètre optionnel ``backward``
it: Il metodo ``track_find_key`` aggiunge un nuovo parametro facoltativo ``backward``
ru: Метод ``track_find_key`` добавляет новый необязательный параметр ``backward``
ta: முறை `` டிராக்_ஃபிண்ட்_கே`` புதிய `` பின்தங்கிய`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``track_find_key`` додає новий необов'язковий параметр ``backward``
zh_cn: 方法 ``track_find_key`` 添加了新的 ``backward`` 可选参数
zh_hant: 方法 ``track_find_key`` 新增了 ``backward`` 選用參數

source: **AnimationMixer**
ru: **AnimationMixer** (Микшер анимации)
ta: ** அனிமேசன்மிக்சர் **
zh_cn: **动画混合器**
zh_hant: **動畫混合器（AnimationMixer）**

source: Method ``_post_process_key_value`` changes ``object`` parameter type from ``Object`` to ``uint64``
es: El método ``_post_process_key_value`` cambia el tipo del parámetro ``object`` de ``Object`` a ``uint64``
fr: La méthode ``_post_process_key_value`` change le type du paramètre ``object`` de ``Object`` en ``uint64``
it: Il metodo ``_post_process_key_value`` cambia il tipo del parametro ``object`` da ``Object`` a ``uint64``
pt_br: Alterado o tipo do parâmetro ``object`` do método ``_post_process_key_value`` de ``Object`` para ``uint64``
ru: Метод ``_post_process_key_value`` изменяет тип параметра ``object`` с ``Object`` на ``uint64``
ta: முறை `` _POST_PROCESS_KEY_VALUE``` `` பொருள்` அளவுரு வகையை `` பொருள்`` `` uint64`` க்கு மாற்றுகிறது
uk: Метод ``_post_process_key_value`` змінює тип параметра ``object`` з ``Object`` на ``uint64``
zh_cn: 方法 ``_post_process_key_value`` 的 ``object`` 参数类型从 ``Object`` 更改为 ``uint64``
zh_hant: 方法 ``_post_process_key_value`` 的 ``object`` 參數型別由 ``Object`` 改為 ``uint64``

source: **Skeleton3D**
ru: **Skeleton3D** (Скелет3D)
ta: ** எலும்புக்கூடு 3 டி **
zh_cn: **3D骨骼**

source: Method ``add_bone`` changes return type from ``void`` to ``int32``
es: El método ``add_bone``cambia el tipo de retorno de ``void`` a ``int32``
fr: La méthode ``add_bone`` change de type de retour de ``void`` en ``uint64``
it: Il metodo ``add_bone`` cambia il tipo restituito da ``void`` a ``int32``
pt_br: Alterado o tipo de retorno do método ``add_bone`` de ``void`` para ``int32``
ru: Метод ``add_bone`` изменяет тип возвращаемого значения с ``void`` на ``int32``
ta: முறை `` கூடுதல்_போன்`` திரும்பும் வகையை `` வெற்றிடத்தை` இலிருந்து `` int32`` மாற்றுகிறது
uk: Метод ``add_bone`` змінює тип повернення з ``void`` на ``int32``
zh_cn: 方法 ``add_bone`` 的返回类型从 ``void`` 更改为 ``int32``
zh_hant: 方法 ``add_bone`` 的回傳型別由 ``void`` 改為 ``int32``

source: Signal ``bone_pose_changed`` replaced by ``skeleton_updated``
es: La señal ``bone_pose_changed`` se reemplazó por ``skeleton_updated``
fr: Le signal ``bone_pose_changed`` est remplacé par ``skeleton_updated``
it: Il segnale ``on_bone_pose_update`` è stato sostituito da ``on_skeleton_update``
pt_br: Sinal ``bone_pose_changed`` substituído por ``skeleton_updated``
ru: Сигнал ``bone_pose_changed`` заменен на ``skeleton_updated``
ta: `` Boneton_updated`` ஆல் மாற்றப்பட்ட `` bone_pose_changed`` சமிக்ஞை
uk: Сигнал ``bone_pose_changed`` замінено на ``skeleton_updated``
zh_cn: 信号 ``bone_pose_changed`` 已替换为 ``skeleton_updated``
zh_hant: 訊號 ``bone_pose_changed`` 已被 ``skeleton_updated`` 取代

source: **BoneAttachment3D**
ru: **BoneAttachment3D** (Костное крепление 3D)
ta: ** எலும்பு இணைப்பு 3D **
zh_cn: **3D骨骼附属**

source: Method ``on_bone_pose_update`` replaced by ``on_skeleton_update``
es: El método ``on_bone_pose_update`` se reemplazó por ``on_skeleton_update``
fr: La méthode ``on_bone_pose_update`` est remplacée par ``on_skeleton_update``
it: Il metodo ``on_bone_pose_update`` è stato sostituito da ``on_skeleton_update``
pt_br: Método ``on_bone_pose_update`` substituído por ``on_skeleton_update``
ru: Метод ``on_bone_pose_update`` заменен на ``on_skeleton_update``
ta: முறை `` on_skeleton_update`` ஆல் மாற்றப்பட்ட முறை `` on_bone_pose_update``
uk: Метод ``on_bone_pose_update`` замінено на ``on_skeleton_update``
zh_cn: 方法 ``on_bone_pose_update`` 已替换为 ``on_skeleton_update``
zh_hant: 方法 ``on_bone_pose_update`` 已被 ``on_skeleton_update`` 取代

source: GUI nodes
es: Nodos GUI
fr: Nœuds GUI
it: Nodi GUI
ru: GUI узлы
ta: குய் முனைகள்
uk: Вузли GUI
zh_cn: GUI 节点
zh_hant: 建立節點

source: **AcceptDialog**
ru: **AcceptDialog** (Принять Диалог)
ta: ** ஏற்றுக்கொள்ளும் உரையாடல் **

source: Method ``register_text_enter`` changes parameter ``line_edit`` type from ``Control`` to ``LineEdit``
es: El método ``register_text_enter``cambia el tipo del parámetro ``line_edit`` de ``Control`` a ``LineEdit``
fr: La méthode ``register_text_enter`` change le type du paramètre ``line_edit``` de ``Control`` à ``LineEdit``
it: Il metodo ``register_text_type`` cambia il tipo del parametro ``line_edit`` da ``Control`` a ``LineEdit``
pt_br: Alterado o tipo do parâmetro ``line_edit`` do método ``register_text_enter`` de ``Control`` para ``LineEdit``
ru: Метод ``register_text_enter`` изменяет тип параметра ``line_edit`` с ``Control`` на ``LineEdit``
ta: முறை `` regarty_text_enter`` மாற்றங்கள் அளவுருவை `` line_edit`` வகை `` கட்டுப்பாடு`` `` linedit`` க்கு மாற்றுகிறது
uk: Метод «register_text_enter» змінює тип параметра «line_edit» з «Control» на «LineEdit»
zh_cn: 方法 ``register_text_enter`` 的参数 ``line_edit`` 的类型从 ``Control`` 更改为 ``LineEdit``
zh_hant: 方法 ``register_text_enter`` 的 ``line_edit`` 參數型別由 ``Control`` 改為 ``LineEdit``

source: Method ``remove_button`` changes parameter ``button`` type from ``Control`` to ``Button``
fr: La méthode ``remove_button`` change le type du paramètre ``button``` de ``Control`` à ``Button``
it: Il metodo ``remove_button`` cambia il tipo del parametro ``button`` da ``Control`` a ``Button``
pt_br: Alterado o tipo do parâmetro ``button`` do método ``remove_button`` de ``Control`` para ``Button``
ru: Метод ``remove_button`` изменяет тип параметра ``button`` с ``Control`` на ``Button``
ta: முறை `` remove_button`` `` பொத்தான்` `` கட்டுப்பாடு` `` பொத்தான்` `` `பொத்தான்` மாற்றுகிறது
uk: Метод ``remove_button`` змінює тип параметра ``button`` з ``Control`` на ``Button``
zh_cn: 方法 ``remove_button`` 的参数 ``button`` 的类型从 ``Control`` 更改为 ``Button``
zh_hant: 方法 ``remove_button`` 的 ``button`` 參數型別由 ``Control`` 改為 ``Button``

source: Physics
es: Física
fr: Physique
it: Fisica
pt_br: Física
ru: Физика
ta: இயற்பியல்
uk: Фізика
zh_cn: 物理
zh_hant: 物理

source: Property ``motion`` changes type from ``Vector2`` to ``Vector3``
fr: La propriété ``motion`` change de type, de ``Vector2``` à ``Vector3``
it: La proprietà ``motion`` cambia tipo da ``Vector2`` a ``Vector3``
pt_br: Alterado o tipo da propriedade ``motion`` de ``Vector2`` para ``Vector3``
ru: Свойство ``motion`` меняет тип с ``Vector2`` на ``Vector3``
ta: சொத்து `` மோசன்`` வகைகளை `` vecter2`` இலிருந்து `` vecter3`` வரை மாற்றுகிறது
uk: Властивість ``motion`` змінює тип з ``Vector2`` на ``Vector3``
zh_cn: 属性 ``motion`` 的类型从 ``Vector2`` 改为 ``Vector3``
zh_hant: 屬性 ``motion`` 的型別由 ``Vector2`` 改為 ``Vector3``
