Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.po
Languages: cs, ga, pt_br, ru, ta, uk

source: This way, you won't be relying on the deprecated Tween node and OS time functions, both of which are removed in Godot 4.0.
ga: Ar an mbealach seo, ní bheidh tú ag brath ar na feidhmeanna ama Nód Tween agus OS atá dlite, a bhaintear an dá cheann acu i Godot 4.0.
pt_br: Dessa forma, você não dependerá das funções obsoletas de nó Tween e de tempo do sistema operacional, ambas removidas no Godot 4.0.
ru: Таким образом, вы не будете полагаться на устаревшие Tween узлы и временные функции OS, оба из которых удалены в Godot 4.0.
ta: இந்த வழியில், நீங்கள் நீக்கப்பட்ட இருபது முனை மற்றும் ஓஎச் நேர செயல்பாடுகளை நம்ப மாட்டீர்கள், இவை இரண்டும் கோடோட் 4.0 இல் அகற்றப்படுகின்றன.
uk: Таким чином, ви не будете покладатися на застарілі функції вузла Tween і часу ОС, обидві з яких видалено в Godot 4.0.

source: It's also a good idea to rename external shaders so that their extension is ``.gdshader`` instead of ``.shader``. Godot 3.x supports both extensions, but only ``.gdshader`` is supported in Godot 4.0.
ga: Is smaoineamh maith é freisin scáthóirí seachtracha a athainmniú ionas go mbeidh a síneadh ``.gdshader`` in ionad ``.shader``. Tacaíonn Godot 3.x leis an dá síneadh, ach ní thacaítear ach le ``.gdshader`` i Godot 4.0.
pt_br: Também é uma boa ideia renomear os shaders externos para que sua extensão seja ``.gdshader`` em vez de ``.shader``. O Godot 3.x suporta ambas as extensões, mas somente ``.gdshader`` é suportado no Godot 4.0.
ru: Также хорошей идеей будет переименовать внешние шейдеры так, чтобы их расширение было ``.gdshader`` вместо ``.shader``. Godot 3.x поддерживает оба расширения, но в Godot 4.0 поддерживается только ``.gdshader``.
ta: வெளிப்புற சேடர்களை மறுபெயரிடுவதும் நல்ல யோசனையாகும், இதனால் அவற்றின் நீட்டிப்பு `` .சடர்`` என்பதற்கு பதிலாக `` .gdshader`` ஆகும். கோடோட் 3.x இரண்டு நீட்டிப்புகளையும் ஆதரிக்கிறது, ஆனால் `` .gdshader`` மட்டுமே கோடோட் 4.0 இல் ஆதரிக்கப்படுகிறது.
uk: Також доцільно перейменувати зовнішні шейдери так, щоб їхнє розширення було ``.gdshader`` замість ``.shader``. Godot 3.x підтримує обидва розширення, але в Godot 4.0 підтримується лише ``.gdshader``.

source: Running the project upgrade tool
ga: Uirlis uasghrádaithe tionscadail
ru: Запуск инструмента обновления проекта
ta: திட்ட மேம்படுத்தல் கருவியை இயக்குதல்
uk: Запуск інструменту оновлення проекту

source: **Make a full backup of your project** before upgrading! The project upgrade tool will *not* perform any backups of the project that is being upgraded.
ga: ** Déan cúltaca iomlán de do thionscadal** sula ndéanann tú uasghrádú! Ní dhéanfaidh an uirlis uasghrádaithe tionscadail aon chúltacaí den tionscadal atá á uasghrádú.
pt_br: **Faça um backup completo do seu projeto** antes de atualizar! A ferramenta de atualização de projeto *não* fará backup do projeto que está sendo atualizado.
ru: **Make a full backup of your project (Сделать полную резервную копию вашего проекта)** перед обновлением! Инструмент обновления проекта *не* будет выполнять никаких резервных копий обновляемого проекта.
ta: ** மேம்படுத்துவதற்கு முன் உங்கள் திட்டத்தின் முழு காப்புப்பிரதியை உருவாக்கவும் **! திட்ட மேம்படுத்தல் கருவி மேம்படுத்தப்படும் திட்டத்தின் எந்த காப்புப்பிரதிகளையும் செய்யாது.
uk: **Зробіть повну резервну копію свого проекту** перед оновленням! Інструмент оновлення проекту *не* створюватиме резервні копії проекту, який оновлюється.

source: You can backup a project by using version control, or by copying the project folder to another location.
ga: Is féidir leat cúltaca a dhéanamh de thionscadal trí úsáid a bhaint as rialú leagan, nó trí fhillteán an tionscadail a chóipeáil go dtí suíomh eile.
pt_br: Você pode fazer backup de um projeto usando o controle de versão ou copiando a pasta do projeto para outro local.
ru: Вы можете сделать резервную копию проекта, используя систему управления версиями, или скопировать папку проекта в другое место.
ta: பதிப்பு கட்டுப்பாட்டைப் பயன்படுத்தி அல்லது திட்டக் கோப்புறையை வேறு இடத்திற்கு நகலெடுப்பதன் மூலம் நீங்கள் ஒரு திட்டத்தை காப்புப் பிரதி எடுக்கலாம்.
uk: Ви можете створити резервну копію проекту за допомогою керування версіями або скопіювавши папку проекту в інше розташування.

source: Using the Project Manager
ga: Bainisteoir Tionscadail a úsáid
ru: Использование Менеджера Проектов
ta: திட்ட மேலாளரைப் பயன்படுத்துதல்
uk: Використання менеджера проекту

source: To use the project upgrade tool:
cs: Pro použití nástroje pro upgrade projektu:
ga: Chun an uirlis uasghrádaithe tionscadail a úsáid:
pt_br: Para usar a ferramenta de atualização do projeto:
ru: Чтобы использовать инструмент обновления проекта:
ta: திட்ட மேம்படுத்தல் கருவியைப் பயன்படுத்த:
uk: Використовувати інструмент оновлення проекту:

source: Open the Godot 4 Project Manager.
cs: Otevřete Správce Projektů Godot 4.
ga: Oscail Bainisteoir Tionscadail Godot 4.
ru: Откройте Менеджер Проектов Godot 4.
ta: கோடோட் 4 திட்ட மேலாளரைத் திறக்கவும்.
uk: Відкрийте Менеджер проектів Godot 4.

source: Import the Godot 3.x project using the **Import** button, or use the **Scan** button to find the project within a folder.
ga: Iompórtáil an tionscadal Godot 3.x ag baint úsáide as an gcnaipe **Iompórtáil**, nó úsáid an cnaipe **Scan** chun an tionscadal a aimsiú laistigh d'fhillteán.
pt_br: Importe o projeto Godot 3.x usando o botão **Importar** ou use o botão **Escanear** para encontrar o projeto em uma pasta.
ru: Для импорта проекта в Godot 3.x используйте кнопку **Импорт**, или кнопку **Сканировать**, чтобы найти проект в папке.
ta: ** இறக்குமதி ** பொத்தானைப் பயன்படுத்தி கோடோட் 3.x திட்டத்தை இறக்குமதி செய்யுங்கள் அல்லது ஒரு கோப்புறையில் திட்டத்தைக் கண்டுபிடிக்க ** ச்கேன் ** பொத்தானைப் பயன்படுத்தவும்.
uk: Імпортуйте проект Godot 3.x за допомогою кнопки **Імпортувати** або використовуйте кнопку **Сканувати**, щоб знайти проект у папці.

source: Double-click the imported project (or select the project then choose **Edit**).
ga: Cliceáil faoi dhó ar an tionscadal iompórtáilte (nó roghnaigh an tionscadal ansin roghnaigh **Cuir in eagar**).
pt_br: Clique duas vezes no projeto importado (ou selecione o projeto e escolha **Editar**).
ru: Дважды нажмите по импортированному проекту (или выберите проект и нажмите **Редактировать**).
ta: இறக்குமதி செய்யப்பட்ட திட்டத்தை இருமுறை சொடுக்கு செய்யவும் (அல்லது திட்டத்தைத் தேர்ந்தெடுத்து ** திருத்து ** ஐத் தேர்வுசெய்க).
uk: Двічі клацніть імпортований проект (або виберіть проект і виберіть **Редагувати**).

source: You will see a dialog appearing with two options: **Convert project.godot Only** and **Convert Full Project**. After ensuring your project is backed up (see the above warning), choose **Convert Full Project**. **Convert project.godot Only** is intended to be used for advanced use cases *only*, in case the conversion tool fails.
ga: Feicfidh tú dialóg le feiceáil le dhá rogha: **Tiontaigh project.godot Amháin** agus **Tiontaigh Tionscadal Iomlán**. Tar éis duit a chinntiú go bhfuil do thionscadal cúltaca (féach an rabhadh thuas), roghnaigh **Tiontaigh an Tionscadal Iomlán**. Tá **Tiontú project.godot Only** beartaithe le húsáid do chásanna ardúsáide *amháin*, ar eagla go dteipeann ar an uirlis tiontaithe.
pt_br: Você verá uma caixa de diálogo com duas opções: **Converter apenas project.godot** e **Converter projeto completo**. Após garantir que o backup do seu projeto esteja concluído (veja o aviso acima), escolha **Converter projeto completo**. **Converter apenas project.godot** deve ser usado *apenas* em casos de uso avançado, caso a ferramenta de conversão falhe.
ru: Вы увидите диалоговое окно с двумя вариантами: **Конвертировать только project.godot** и **Конвертировать весь проект**. Убедившись, что резервное копирование проекта выполнено (см. вышеприведенное предупреждение), выберите **Конвертировать весь проект**. **Конвертировать только project.godot** предназначен для использования в расширенных случаях использования *только*, в случае сбоя инструмента конвертации.
ta: இரண்டு விருப்பங்களுடன் ஒரு உரையாடல் தோன்றுவதை நீங்கள் காண்பீர்கள்: ** திட்டத்தை மாற்றவும். உங்கள் திட்டம் காப்புப் பிரதி எடுக்கப்படுவதை உறுதிசெய்த பிறகு (மேற்கண்ட எச்சரிக்கையைப் பார்க்கவும்), ** முழு திட்டத்தையும் மாற்றவும் **. ** மாற்று திட்டத்தை மாற்றவும்.
uk: Ви побачите діалогове вікно з двома параметрами: **Перетворити тільки project.godot** і **Перетворити весь проект**. Переконавшись, що для вашого проекту створено резервну копію (див. попередження вище), виберіть **Перетворити повний проект**. **Convert project.godot Only** призначено для використання *лише* для розширених випадків використання, якщо інструмент перетворення не працює.

source: Wait until the project conversion process finishes. This can take up to a few minutes for large projects with lots of scenes.
ga: Fan go dtí go gcríochnóidh próiseas tionscadail tionsc Féadfaidh sé seo suas le cúpla nóiméad a thógáil le haghaidh tionscadail mhóra le go leor radhairc.
pt_br: Aguarde a conclusão do processo de conversão do projeto. Isso pode levar alguns minutos para projetos grandes com muitas cenas.
ru: Дождитесь окончания процесса конвертации проекта. Для больших проектов с множеством сцен это может занять до нескольких минут.
ta: திட்ட மாற்று செயல்முறை முடியும் வரை காத்திருங்கள். நிறைய காட்சிகளைக் கொண்ட பெரிய திட்டங்களுக்கு இது சில நிமிடங்கள் வரை ஆகலாம்.
uk: Дочекайтеся завершення процесу перетворення проекту. Для великих проектів із великою кількістю сцен це може зайняти до кількох хвилин.

source: When the Project Manager interface becomes available again, double-click the project (or select the project then choose **Edit**) to open it in the editor.
ga: Nuair a bheidh comhéadan an Bhainisteora Tionscadail ar fáil arís, cliceáil faoi dhó ar an tionscadal (nó roghnaigh an tionscadal agus ansin roghnaigh **Cuir in eagar**) chun é a oscailt san eagarthóir.
pt_br: Quando a interface do Gerenciador de Projetos estiver disponível novamente, clique duas vezes no projeto (ou selecione o projeto e escolha **Editar**) para abri-lo no editor.
ru: Когда интерфейс Менеджера Проектов станет доступным снова, дважды щелкните по проекту (или выберите проект, после чего нажмите **Редактировать**), чтобы открыть его в редакторе.
ta: திட்ட மேலாளர் இடைமுகம் மீண்டும் கிடைக்கும்போது, அதை எடிட்டரில் திறக்க திட்டத்தை இருமுறை சொடுக்கு செய்யவும் (அல்லது திட்டத்தைத் தேர்ந்தெடுக்கவும் ** ** ** ஐத் தேர்வுசெய்க).
uk: Коли інтерфейс менеджера проектів знову стане доступним, двічі клацніть проект (або виберіть проект і виберіть **Редагувати**), щоб відкрити його в редакторі.

source: If you hit conversion issues due to some project files being too large or long, you can use the command line to upgrade the project (see below). This will allow you to override the converter's size limits.
ga: Má bhuail tú saincheisteanna comhshó mar gheall ar roinnt comhaid tionscadail ró-mhór nó fada, is féidir leat an líne ordaithe a úsáid chun an tionscadal a uasghrádú (féach thíos). Ligfidh sé seo duit teorainneacha méide an tiontaire a shárú.
pt_br: Se você tiver problemas de conversão devido a alguns arquivos de projeto serem muito grandes ou longos, você pode usar a linha de comando para atualizar o projeto (veja abaixo). Isso permitirá que você substitua os limites de tamanho do conversor.
ru: Если у вас возникли проблемы с преобразованием из-за того, что некоторые файлы проекта слишком большие или длинные, вы можете использовать командную строку для обновления проекта (см. ниже). Это позволит вам обойти ограничения по размеру преобразователя.
ta: சில திட்டக் கோப்புகள் மிகப் பெரியதாகவோ அல்லது நீளமாகவோ இருப்பதால் மாற்று சிக்கல்களைத் தாக்கினால், திட்டத்தை மேம்படுத்த கட்டளை வரியைப் பயன்படுத்தலாம் (கீழே காண்க). இது மாற்றி அளவு வரம்புகளை மீற அனுமதிக்கும்.
uk: Якщо у вас виникають проблеми з перетворенням через те, що деякі файли проекту занадто великі або довгі, ви можете скористатися командним рядком для оновлення проекту (див. нижче). Це дозволить вам перевизначити обмеження розміру конвертера.

source: Using the command line
ga: Ag baint úsáide as an líne ordaithe
ru: Использование командной строки
ta: கட்டளை வரியைப் பயன்படுத்துதல்
uk: Використання командного рядка

source: To use the project upgrade tool from the :ref:`command line <doc_command_line_tutorial>`, it's recommended to validate the project conversion by running the Godot editor binary with the following arguments:
ga: Chun an uirlis uasghrádaithe tionscadail a úsáid ón :ref:`líne ordaithe <doc_command_line_tutorial>`, moltar tiontú an tionscadail a bhailíochtú trí dhénártha eagarthóir Godot a rith leis na hargóintí seo a leanas:
pt_br: Para usar a ferramenta de atualização de projeto da :ref:`linha de comando <doc_command_line_tutorial>`, é recomendável validar a conversão do projeto executando o executável do editor Godot com os seguintes argumentos:
ru: Чтобы использовать инструмент для обновления проекта из :ref:`command line <doc_command_line_tutorial>`, рекомендуется проверить преобразование проекта, запустив бинарный файл редактора Godot со следующими аргументами:
ta: திட்ட மேம்படுத்தல் கருவியைப் பயன்படுத்த: குறிப்பு: `கட்டளை வரி <doc_command_line_tutorial>`, பின்வரும் வாதங்களுடன் கோடோட் எடிட்டர் பைனரியை இயக்குவதன் மூலம் திட்ட மாற்றத்தை சரிபார்க்க பரிந்துரைக்கப்படுகிறது:
uk: Щоб скористатися інструментом оновлення проекту з :ref:`командного рядка <doc_command_line_tutorial>`, рекомендується перевірити перетворення проекту, запустивши двійковий файл редактора Godot із такими аргументами:

source: If the list of planned upgrades looks good to you, run the following command on the Godot editor binary to upgrade project files:
ga: Má tá cuma mhaith ar liosta na n-uasghrádú pleanáilte duit, rith an t-ordú seo a leanas ar dhénártha eagarthóir Godot chun comhaid tionscadail a uasghrádú:
pt_br: Se a lista de atualizações planejadas parecer boa para você, execute o seguinte comando no executável do editor do Godot para atualizar os arquivos do projeto:
ru: Если список запланированных обновлений вас устраивает, выполните следующую команду на двоичном файле редактора Godot для обновления файлов проекта:
ta: திட்டமிடப்பட்ட மேம்படுத்தல்களின் பட்டியல் உங்களுக்கு நன்றாகத் தெரிந்தால், திட்டக் கோப்புகளை மேம்படுத்த கோடோட் எடிட்டர் பைனரியில் பின்வரும் கட்டளையை இயக்கவும்:
uk: Якщо вам подобається список запланованих оновлень, виконайте таку команду у двійковому файлі редактора Godot, щоб оновити файли проекту:

source: ``[<max_file_kb>]`` and ``[<max_line_size>]`` are *optional* arguments to specify the maximum size of files to be converted (in kilobytes and lines). The default limits are 4 MB and 100,000 lines respectively. If a file hits either of those limits, it will not be upgraded by the project converter. This is useful to prevent large resources from slowing down the upgrade to a crawl.
ga: Is argóintí *roghnacha* iad ``[<max_file_kb>]`` agus ``[<max_line_size>]`` chun uasmhéid na gcomhad atá le comhshó a shonrú (i gcilibhearta agus i línte). Is iad na teorainneacha réamhshocraithe ná 4 MB agus 100,000 líne faoi seach. Má bhuaileann comhad ceachtar de na teorainneacha sin, ní dhéanfaidh an tiontaire tionscadail é a uasghrádú. Tá sé seo úsáideach chun acmhainní móra a chosc ó mhoilliú a dhéanamh ar an uasghrádú go dtí crawl.
pt_br: ``[<max_file_kb>]`` e ``[<max_line_size>]`` são argumentos *opcionais* usados para especificar o tamanho máximo dos arquivos a serem convertidos (em kilobytes e linhas). Os limites padrão são 4 MB e 100.000 linhas, respectivamente. Se um arquivo atingir qualquer um desses limites, ele não será atualizado pela ferramenta de conversão de projeto. Isso é útil para evitar que recursos muito grandes deixem o processo de atualização extremamente lento.
ru: ''[<max_file_kb>]'' и ''[<max_line_size>]'' являются *необязательными* аргументами для указания максимального размера файлов для преобразования (в килобайтах и строках). По умолчанию ограничения составляют 4 МБ и 100 000 строк соответственно. Если файл достигает любого из этих ограничений, он не будет обновлен конвертером проектов. Это полезно для предотвращения замедления обновления до обхода больших ресурсов.
ta: `` [<max_file_kb>] `` மற்றும் `` [<ax_line_size>] `` மாற்றப்பட வேண்டிய கோப்புகளின் அதிகபட்ச அளவைக் குறிப்பிட * விருப்பமான * வாதங்கள் (கிலோபைட்டுகள் மற்றும் கோடுகளில்). இயல்புநிலை வரம்புகள் முறையே 4 எம்பி மற்றும் 100,000 கோடுகள். ஒரு கோப்பு அந்த வரம்புகளில் ஒன்றைத் தாக்கினால், அது திட்ட மாற்றி மூலம் மேம்படுத்தப்படாது. பெரிய வளங்கள் மேம்படுத்தலை ஒரு வலம் வருவதைத் தடுக்க இது பயனுள்ளதாக இருக்கும்.
uk: ``[<max_file_kb>]`` і ``[<max_line_size>]`` є *необов’язковими* аргументами для визначення максимального розміру файлів, які потрібно конвертувати (у кілобайтах і рядках). Обмеження за умовчанням становлять 4 МБ і 100 000 рядків відповідно. Якщо файл досягає будь-якого з цих обмежень, він не буде оновлено конвертером проекту. Це корисно, щоб запобігти сповільненню оновлення великих ресурсів до сканування.

source: If you still want large files to be converted by the project upgrade tool, increase the size limits when running the project upgrade tool. For example, running the Godot editor binary with those arguments increases both limits by a 10× factor:
ga: Más mian leat fós go ndéanfaí comhaid mhóra a thiontú ag an uirlis uasghrádaithe tionscadail, méadaigh na teorainneacha méide agus uirlis uasghrádaithe Mar shampla, méadaíonn dénártha eagarthóir Godot a reáchtáil leis na hargóintí sin an dá theorainn le fachtóir 10×:
pt_br: Se você ainda quiser que arquivos grandes sejam convertidos pela ferramenta de atualização de projeto, aumente os limites de tamanho ao executá-la. Por exemplo, executar o executável do editor Godot com esses argumentos aumenta ambos os limites em um fator de 10x:
ru: Если вы по-прежнему хотите, чтобы большие файлы конвертировались с помощью средства обновления проекта, увеличьте ограничения размера при запуске средства обновления проекта. Например, запуск двоичного файла редактора Godot с этими аргументами увеличивает оба лимита на 10× множитель:
ta: திட்ட மேம்படுத்தல் கருவி மூலம் பெரிய கோப்புகளை மாற்ற விரும்பினால், திட்ட மேம்படுத்தல் கருவியை இயக்கும் போது அளவு வரம்புகளை அதிகரிக்கவும். எடுத்துக்காட்டாக, அந்த வாதங்களுடன் கோடோட் எடிட்டர் பைனரியை இயக்குவது 10 × காரணி மூலம் இரு வரம்புகளையும் அதிகரிக்கிறது:
uk: Якщо ви все ще бажаєте, щоб інструмент оновлення проекту конвертував великі файли, збільште обмеження на розмір під час запуску інструмента оновлення проекту. Наприклад, запуск двійкового редактора Годо з цими аргументами збільшує обидва обмеження в 10 разів:

source: Only Godot 3.0 and later projects can be upgraded using the project conversion tool found in the Godot 4 editor.
ga: Ní féidir ach tionscadail Godot 3.0 agus níos déanaí a uasghrádú ag baint úsáide as an uirlis tionscadail atá le fáil in eagarthóir Godot 4.
pt_br: Somente projetos do Godot 3.0 e posteriores podem ser atualizados usando a ferramenta de conversão de projetos encontrada no editor do Godot 4.
ru: Только проекты Godot 3.0 и более поздние версии могут быть обновлены с помощью инструмента преобразования проектов, найденного в редакторе Godot 4.
ta: கோடோட் 4 எடிட்டரில் காணப்படும் திட்ட மாற்று கருவியைப் பயன்படுத்தி கோடோட் 3.0 மற்றும் பின்னர் திட்டங்களை மட்டுமே மேம்படுத்த முடியும்.
uk: Лише проекти Godot 3.0 і новіших версій можна оновити за допомогою інструменту перетворення проектів у редакторі Godot 4.

source: It's recommended to ensure that your project is up-to-date with the latest 3.x stable release before running the project upgrade tool.
ga: Moltar a chinntiú go bhfuil do thionscadal cothrom le dáta leis an scaoileadh cobhsaí 3.x is déanaí sula ritheann tú an uirlis uasghrádaithe tionscadail.
pt_br: É recomendável garantir que seu projeto esteja atualizado com a versão estável 3.x mais recente antes de executar a ferramenta de atualização do projeto.
ru: Перед запуском инструмента обновления проекта рекомендуется убедиться, что ваш проект обновлен до последней стабильной версии 3.x.
ta: திட்ட மேம்படுத்தல் கருவியை இயக்குவதற்கு முன்பு உங்கள் திட்டம் அண்மைக் கால 3.x நிலையான வெளியீட்டில் புதுப்பித்த நிலையில் இருப்பதை உறுதிப்படுத்த பரிந்துரைக்கப்படுகிறது.
uk: Рекомендується переконатися, що ваш проект оновлено до останньої стабільної версії 3.x, перш ніж запускати інструмент оновлення проекту.

source: Fixing the project after running the project upgrade tool
ga: An tionscadal a shocrú tar éis an uirlis uasghrádaithe tion
pt_br: Corrigindo o projeto após executar a ferramenta de atualização do projeto
ru: Починка проекта после запуска инструмента обновления проекта
ta: திட்டத்தை சரிசெய்தல் திட்ட மேம்படுத்தல் கருவியை இயக்கிய பிறகு
uk: Виправлення проекту після запуску інструменту оновлення проекту

source: After upgrading the project, you may notice that certain things don't look as they should. Scripts will likely contain various errors as well (possibly hundreds in large projects). This is because the project upgrade tool cannot cater to all situations. Therefore, a large part of the upgrade process remains manual.
ga: Tar éis duit an tionscadal a uasghrádú, b'fhéidir go dtabharfaidh tú faoi deara nach bhfuil cuma ar rudaí áirithe mar ba chóir. Is dócha go mbeidh earráidí éagsúla sna scripteanna freisin (b’fhéidir na céadta i dtionscadail mhóra). Tá sé seo amhlaidh toisc nach féidir leis an uirlis uasghrádaithe tionscadail freastal ar gach cás. Mar sin, tá cuid mhór den phróiseas uasghrádaithe fós láimhe.
pt_br: Após atualizar o projeto, você poderá notar que algumas coisas não estão como deveriam. Os scripts provavelmente também conterão vários erros (possivelmente centenas em projetos grandes). Isso ocorre porque a ferramenta de atualização do projeto não consegue atender a todas as situações. Portanto, grande parte do processo de atualização permanece manual.
ru: После обновления проекта вы можете заметить, что некоторые вещи выглядят не так, как должны. Скрипты также могут содержать различные ошибки (в больших проектах их могут быть сотни). Это связано с тем, что инструмент обновления проекта не может удовлетворить все ситуации. Таким образом, большая часть процесса обновления остается ручной.
ta: திட்டத்தை மேம்படுத்திய பிறகு, சில விசயங்கள் இருக்க வேண்டியபடி இல்லை என்பதை நீங்கள் கவனிக்கலாம். ச்கிரிப்ட்களில் பல்வேறு பிழைகள் இருக்கும் (பெரிய திட்டங்களில் நூற்றுக்கணக்கானவை). ஏனென்றால், திட்ட மேம்படுத்தல் கருவி அனைத்து சூழ்நிலைகளையும் நிறைவு செய்ய முடியாது. எனவே, மேம்படுத்தல் செயல்முறையின் பெரும்பகுதி கையேட்டில் உள்ளது.
uk: Після оновлення проекту ви можете помітити, що деякі речі виглядають не так, як повинні. Сценарії, ймовірно, також будуть містити різні помилки (можливо, сотні у великих проектах). Це тому, що інструмент оновлення проекту не може задовольнити всі ситуації. Тому велика частина процесу оновлення залишається вручну.

source: Automatically renamed nodes and resources
ga: Nóid agus acmhainní a athainmni
ru: Автоматически переименованные узлы и ресурсы
ta: முனைகள் மற்றும் வளங்களை தானாக மறுபெயரிடுதல்
uk: Автоматичне перейменування вузлів і ресурсів
