Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.2.po
Languages: es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hant

source: Core
es: Núcleo
ga: Croí
it: Fondamentali
pt_br: Componentes Principais
ru: Ядро
ta: வயிரம்
tr: Çekirdek
uk: Ядро
zh_hant: 核心

source: Change
es: Cambio
fr: Modifications
ga: Athrú
it: Cambiamento
ru: Изменение
ta: மாற்றம்
tr: Değişiklik
uk: Зміна
zh_hant: 改動

source: GDScript Compatible
es: Compatibilidad con GDScript
fr: Compatible GDScript
ga: GDScript Comhoiriúnach
it: Compatibili con GDScript
ru: Совместимо с GDScript
ta: GDSCRIPT இணக்கமானது
tr: GDScript Uyumlu
uk: Сумісність з GDScript
zh_hant: GDScript 格式化字串

source: C# Binary Compatible
es: Compatible con binarios C#
fr: Compatible binaire C#
ga: C # Dénártha Comhoiriúnach
it: Compatibili con eseguibili C#
pt_br: Compatível com C# Binário
ru: Совместимо с бинарным кодом C#
ta: சி# பைனரி இணக்கமானது
tr: C# İkili Uyumlu
uk: C# двійковий сумісний
zh_hant: C# 二進位相容

source: C# Source Compatible
es: Compatible con código fuente C#
fr: Compatible source C#
ga: C # Foinse Comhoiriúnach
it: Compatibili con codice sorgente C#
pt_br: Compatível com fonte C#
ru: Совместимо с исходным кодом C#
ta: சி# மூல இணக்கமானது
tr: C# Kaynak Uyumlu
uk: Сумісність із вихідним кодом C#
zh_hant: C# 原始程式碼相容

source: Introduced
es: Introducido
fr: Intégré
ga: Tugadh isteach
it: Introdotti
ru: Введено в
ta: அறிமுகப்படுத்தப்பட்டது
tr: Tanıtıldı
uk: Введено
zh_hant: 簡介

source: **Node**
fr: **Nœuds :**
ga: **Nód**
ta: ** முனை **
uk: **вузол**
zh_hant: **節點**

source: Constant ``NOTIFICATION_NODE_RECACHE_REQUESTED`` removed
es: Constante ``NOTIFICATION_NODE_RECACHE_REQUESTED`` removida
fr: Constante ``NOTIFICATION_NODE_RECACHE_REQUESTED`` supprimée
ga: Tairiseach ''NOTIFICATION_NODE_RECACHE_REQUESTED'' bainte
it: Costante ``NOTIFICATION_NODE_RECACHE_REQUESTED`` rimossa
pt_br: Constante ``NOTIFICATION_NODE_RECACHE_REQUESTED`` removida
ru: Константа ``NOTIFICATION_NODE_RECACHE_REQUESTED`` удалена
ta: மாறிலி `` அறிவிப்பு_நோட்_ரெக்கேச்_ரெக்ச்டெச்ட்`` அகற்றப்பட்டது
tr: ``NOTIFICATION_NODE_RECACHE_REQUESTED`` sabiti kaldırıldı
uk: Константу ``NOTIFICATION_NODE_RECACHE_REQUESTED`` видалено
zh_hant: 常數 ``NOTIFICATION_NODE_RECACHE_REQUESTED`` 已移除

source: Animation
es: Animación
ga: Beochan
it: Animazione
pt_br: Animação
ru: Анимация
ta: அனிமேசன்
tr: Canlandırma
uk: Анімація
zh_hant: 動畫

source: **AnimationPlayer**
ga: **Imreoir Beochanacha**
ta: ** அனிமேசன் பிளேயர் **
tr: **CanlandırmaOynatıcı**
uk: **Програвач анімації**
zh_hant: **動畫播放器（AnimationPlayer）**

source: Method ``_post_process_key_value`` moved to base class ``AnimationMixer``
es: Método ``_post_process_key_value`` movido a la clase base ``AnimationMixer``
fr: La méthode ``_post_process_key_value`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''_post_process_key_value'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``_post_process_key_value`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``_post_process_key_value`` movido para a classe base ``AnimationMixer``
ru: Метод ``_post_process_key_value`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` _post_process_key_value`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``_post_process_key_value`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``_post_process_key_value`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``_post_process_key_value`` 已移至基底類別 ``AnimationMixer``

source: Method ``add_animation_library`` moved to base class ``AnimationMixer``
es: Métdo ``add_animation_library`` movido a la clase base ``AnimationMixer``
fr: La méthode ``add_animation_library`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''add_animation_library'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``add_animation_library`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``add_animation_library`` movido para a classe base ``AnimationMixer``
ru: Метод ``add_animation_library`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` add_animation_library`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு நகர்த்தப்பட்டது
tr: ``add_animation_library`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``add_animation_library`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``add_animation_library`` 已移至基底類別 ``AnimationMixer``

source: Method ``advance`` moved to base class ``AnimationMixer``
es: Método ``advance`` movido a la clase base ``AnimationMixer``
fr: La méthode ``advance`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''advance'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``advance`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``advance`` movido para a classe base ``AnimationMixer``
ru: Метод ``advance`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` அட்வான்ச்`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``advance`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``advance`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``advance`` 已移至基底類別 ``AnimationMixer``

source: Signal ``animation_finished`` moved to base class ``AnimationMixer``
es: Señal ``animation_finished`` movido a la clase base ``AnimationMixer``
fr: Le signal ``animation_finished`` a été déplacé dans la classe parente ``AnimationMixer```
ga: Comhartha ''animation_finished'' bogtha go bunrang ''AnimationMixer''
it: Il segnale ``animation_finished`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Sinal ``animation_finished`` movido para a classe base ``AnimationMixer``
ru: Сигнал ``animation_finished`` перенесен в базовый класс ``AnimationMixer``
ta: சமிக்ஞை `` அனிமேசன்_ஃபைன் `` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``animation_finished`` sinyali, ``AnimationMixer`` temel sınıfına taşındı
uk: Сигнал ``animation_finished`` перенесено до базового класу ``AnimationMixer``
zh_hant: 訊號 ``animation_finished`` 已移至基底類別 ``AnimationMixer``

source: Signal ``animation_started`` moved to base class ``AnimationMixer``
es: Señal ``animation_started`` movido a la clase base ``AnimationMixer``
fr: Le signal ``animation_started`` a été déplacé dans la classe parente ``AnimationMixer``
ga: Comhartha ''animation_started'' bogtha go bunrang ''AnimationMixer''
it: Il segnale ``animation_started`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Sinal ``animation_started`` movido para a classe base ``AnimationMixer``
ru: Сигнал ``animation_started`` перенесен в базовый класс ``AnimationMixer``
ta: சமிக்ஞை `` அனிமேசன்_ச்டார்ட் `` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``animation_started`` sinyali, ``AnimationMixer`` temel sınıfına taşındı
uk: Сигнал ``animation_started`` перенесено до базового класу ``AnimationMixer``
zh_hant: 訊號 ``animation_started`` 已移至基底類別 ``AnimationMixer``

source: Signal ``animation_libraries_updated`` moved to base class ``AnimationMixer``
es: Señal ``animation_libraries_updated`` movido a la clase base ``AnimationMixer``
fr: Le signal ``animation_libraries_updated`` a été déplacé dans la classe parente ``AnimationMixer``
ga: Comhartha ''animation_libraries_updated'' bogtha go bunrang ''AnimationMixer''
it: Il segnale ``animation_libraries_updated`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Sinal ``animation_libraries_updated`` movido para a classe base ``AnimationMixer``
ru: Сигнал ``animation_libraries_updated`` перенесен в базовый класс ``AnimationMixer``
ta: சமிக்ஞை `` அனிமேசன்_லிபிரரிச்_அப்டேட்டட்`` அடிப்படை வகுப்புக்கு மாற்றப்பட்டது `` அனிமேசன்மிக்சர்``
tr: ``animation_libraries_updated`` sinyali, ``AnimationMixer`` temel sınıfına taşındı
uk: Сигнал ``animation_libraries_updated`` переміщено до базового класу ``AnimationMixer``
zh_hant: 訊號 ``animation_libraries_updated`` 已移至基底類別 ``AnimationMixer``

source: Signal ``animation_list_changed`` moved to base class ``AnimationMixer``
es: Señal ``animation_list_changed`` movido a la clase base ``AnimationMixer``
fr: Le signal ``animation_list_changed`` a été déplacé dans la classe parente ``AnimationMixer```
ga: Comhartha ''animation_list_changed'' bogtha go bunrang ''AnimationMixer''
it: Il segnale ``animation_list_changed`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Sinal ``animation_list_changed`` movido para a classe base ``AnimationMixer``
ru: Сигнал ``animation_list_changed`` перенесен в базовый класс ``AnimationMixer``
ta: சமிக்ஞை `` அனிமேசன்_லிச்ட்_சாங்`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``animation_list_changed`` sinyali, ``AnimationMixer`` temel sınıfına taşındı
uk: Сигнал ``animation_list_changed`` переміщено до базового класу ``AnimationMixer``
zh_hant: 訊號 ``animation_list_changed`` 已移至基底類別 ``AnimationMixer``

source: Property ``audio_max_polyphony`` moved to base class ``AnimationMixer``
es: Propiedad ``audio_max_polyphony`` movido a la clase base ``AnimationMixer``
fr: La propriété ``audio_max_polyphony`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Aistríodh an mhaoin ''audio_max_polyphony'' go bunrang ''AnimationMixer''
it: La proprietà ``audio_max_polyphony`` è stata spostata nella classe base ``AnimationMixer``
pt_br: Propriedade ``audio_max_polyphony`` movida para a classe base ``AnimationMixer``
ru: Свойство ``audio_max_polyphony`` перенесено в базовый класс ``AnimationMixer``
ta: சொத்து `` ஆடியோ_மேக்ச்_போலிஃபோனி`` `` அனிமேசன்மிக்சர்`` க்கு நகர்த்தப்பட்டது
tr: ``audio_max_polyphony`` özelliği, ``AnimationMixer`` temel sınıfına taşındı
uk: Властивість ``audio_max_polyphony`` перенесено до базового класу ``AnimationMixer``
zh_hant: 屬性 ``audio_max_polyphony`` 已移至基底類別 ``AnimationMixer``

source: Signal ``caches_cleared`` moved to base class ``AnimationMixer``
es: Señal ``caches_cleared`` movida a la clase base ``AnimationMixer``
fr: Le signal ``caches_cleared`` a été déplacé dans la classe parente ``AnimationMixer``
ga: Comhartha ''caches_cleared'' bogtha go bunrang ''AnimationMixer''
it: Il segnale ``caches_cleared`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Sinal ``caches_cleared`` movido para a classe base ``AnimationMixer``
ru: Сигнал ``caches_cleared`` перенесен в базовый класс ``AnimationMixer``
ta: சமிக்ஞை `` caches_cleared`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``caches_cleared`` sinyali, ``AnimationMixer`` temel sınıfına taşındı
uk: Сигнал ``caches_cleared`` перенесено до базового класу ``AnimationMixer``
zh_hant: 訊號 ``caches_cleared`` 已移至基底類別 ``AnimationMixer``

source: Method ``clear_caches`` moved to base class ``AnimationMixer``
es: Método ``clear_caches`` movido a la clase base ``AnimationMixer``
fr: La méthode ``clear_caches`` a été déplacé dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''clear_caches'' go bunrang ''AnimationMixer''
it: Il metodo ``clear_caches`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``clear_caches`` movido para a classe base ``AnimationMixer``
ru: Метод ``clear_caches`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` clear_caches`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``clear_caches`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``clear_caches`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``clear_caches`` 已移至基底類別 ``AnimationMixer``

source: Method ``find_animation`` moved to base class ``AnimationMixer``
es: Método ``find_animation`` movido a la clase base ``AnimationMixer``
fr: La méthode ``find_animation`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''find_animation'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``find_animation`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``find_animation`` movido para a classe base ``AnimationMixer``
ru: Метод ``find_animation`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` find_animation`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``find_animation`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``find_animation`` перенесено до базового класу ``AnimationMixer``
zh_hant: 方法 ``find_animation`` 已移至基底類別 ``AnimationMixer``

source: Method ``find_animation_library`` moved to base class ``AnimationMixer``
es: Método ``find_animation_library`` movido a la clase base ``AnimationMixer``
fr: La méthode ``find_animation_library`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''find_animation_library'' go bunrang ''AnimationMixer''
it: Il metodo ``find_animation_library`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``find_animation_library`` movido para a classe base ``AnimationMixer``
ru: Метод ``find_animation_library`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` find_animation_library`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``find_animation_library`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``find_animation_library`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``find_animation_library`` 已移至基底類別 ``AnimationMixer``

source: Method ``get_animation`` moved to base class ``AnimationMixer``
es: Método ``get_animation`` movido a la clase base ``AnimationMixer``
fr: La méthode ``get_animation`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''get_animation'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``get_animation`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``get_animation`` movido para a classe base ``AnimationMixer``
ru: Метод ``get_animation`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` get_animation`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``get_animation`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``get_animation`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``get_animation`` 已移至基底類別 ``AnimationMixer``

source: Method ``get_animation_library`` moved to base class ``AnimationMixer``
es: Método ``get_animation_library`` movido a la clase base ``AnimationMixer``
fr: La méthode ``get_animation_library`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''get_animation_library'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``get_animation_library`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``get_animation_library`` movido para a classe base ``AnimationMixer``
ru: Метод ``get_animation_library`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` get_animation_library`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``get_animation_library`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``get_animation_library`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``get_animation_library`` 已移至基底類別 ``AnimationMixer``

source: Method ``get_animation_library_list`` moved to base class ``AnimationMixer``
es: Método ``get_animation_library_list`` movido a la clase base ``AnimationMixer``
fr: La méthode ``get_animation_library_list`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''get_animation_library_list'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``get_animation_library_list`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``get_animation_library_list`` movido para a classe base ``AnimationMixer``
ru: Метод ``get_animation_library_list`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` get_animation_library_list`` `` அனிமேசன்மிக்சர்`` க்கு நகர்த்தப்பட்டது
tr: ``get_animation_library_list`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``get_animation_library_list`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``get_animation_library_list`` 已移至基底類別 ``AnimationMixer``

source: Method ``get_animation_list`` moved to base class ``AnimationMixer``
es: Método ``get_animation_list`` movido a la clase base ``AnimationMixer``
fr: La méthode ``get_animation_list`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''get_animation_list'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``get_animation_list`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``get_animation_list`` movido para a classe base ``AnimationMixer``
ru: Метод ``get_animation_list`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` get_animation_list`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``get_animation_list`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``get_animation_list`` переміщено до базового класу ``AnimationMixer``
zh_hant: 方法 ``get_animation_list`` 已移至基底類別 ``AnimationMixer``

source: Method ``has_animation`` moved to base class ``AnimationMixer``
es: Método ``has_animation`` movido a la clase base ``AnimationMixer``
fr: La méthode ``has_animation`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''has_animation'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``has_animation`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``has_animation`` movido para a classe base ``AnimationMixer``
ru: Метод ``has_animation`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` has_animation`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``has_animation`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``has_animation`` переміщено до базового класу ``AnimationMixer``
zh_hant: 方法 ``has_animation`` 已移至基底類別 ``AnimationMixer``

source: Method ``has_animation_library`` moved to base class ``AnimationMixer``
es: Método ``has_animation_library`` movido a la clase base ``AnimationMixer``
fr: La méthode ``has_animation_library`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''has_animation_library'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``has_animation_library`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``has_animation_library`` movido para a classe base ``AnimationMixer``
ru: Метод ``has_animation_library`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` has_animation_library`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``has_animation_library`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``has_animation_library`` переміщено до базового класу ``AnimationMixer``
zh_hant: 方法 ``has_animation_library`` 已移至基底類別 ``AnimationMixer``

source: Property ``method_call_mode`` renamed to ``callback_mode_method`` and moved to base class ``AnimationMixer``
es: Propiedad ``method_call_mode`` renombrada a ``callback_mode_method`` y movida a la clase base ``AnimationMixer``
fr: La propriété ``method_call_mode`` a été renommée ``callback_mode_method`` et déplacé dans la classe parente ``AnimationMixer``
ga: Athainmníodh maoin ''method_call_mode'' go ''callback_mode_method'' agus bhog sé go dtí an bunrang ''AnimationMixer''
it: La proprietà ``method_call_mode`` è stata spostata nella classe base ``AnimationMixer``
pt_br: Propriedade ``method_call_mode`` renomeada para ``callback_mode_method`` e movida para a classe base ``AnimationMixer``
ru: Свойство ``method_call_mode`` переименовано в ``callback_mode_method`` и перемещено в базовый класс ``AnimationMixer``
ta: சொத்து `` method_call_mode`` `` backback_mode_method`` என மறுபெயரிடப்பட்டு அடிப்படை வகுப்புக்கு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``method_call_mode`` özelliği, ``callback_mode_method`` olarak yeniden adlandırıldı ve ``AnimationMixer`` temel sınıfına taşındı
uk: Властивість ``method_call_mode`` перейменовано на ``callback_mode_method`` і переміщено до базового класу ``AnimationMixer``
zh_hant: 屬性 ``method_call_mode`` 已更名為 ``callback_mode_method``，並移至基底類別 ``AnimationMixer``

source: |✔️ with compat|
es: |✔️ compatible|
fr: |✔️ avec compatibilité|
ga: | ✔️ le compat|
ta: | இணக்கத்துடன் |
tr: |✔️ , uyumluluk ile|
uk: |✔️ з compat|
zh_hant: | ✔️相容|

source: Property ``playback_active`` renamed to ``active`` and moved to base class ``AnimationMixer``
es: Propiedad ``playback_active`` renombrada a ``active`` y movida a la clase base ``AnimationMixer`
fr: La propriété ``playback_active`` a été renommée en ``active`` et déplacée dans la classe parente ``AnimationMixer``
ga: Athainmníodh maoin ''playback_active'' go ''gníomhach'' agus bhog sé go dtí an bunrang ''AnimationMixer''
it: La proprietà ``playback_active`` è stata rinominata in ``active`` e spostato nella classe base ``AnimationMixer``
pt_br: Propriedade ``playback_active`` renomeada para ``active`` e movida para a classe base ``AnimationMixer``
ru: Свойство ``playback_active`` переименовано в ``active`` и перемещено в базовый класс ``AnimationMixer``
ta: சொத்து `` blapeback_active`` `` செயலில்`` என மறுபெயரிடப்பட்டு அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``playback_active`` özelliği, ``active`` olarak yeniden adlandırıldı ve ``AnimationMixer`` temel sınıfına taşındı
uk: Властивість ``playback_active`` перейменовано на ``active`` і переміщено до базового класу ``AnimationMixer``
zh_hant: 屬性 ``playback_active`` 已更名為 ``active``，並移至基底類別 ``AnimationMixer``

source: Property ``playback_process_mode`` renamed to ``callback_mode_process`` and moved to base class ``AnimationMixer``
es: Propiedad ``playback_process_mode`` renombrada a ``callback_mode_process`` y movida a la clase base ``AnimationMixer``
fr: La propriété ``playback_process_mode`` a été renommée ``callback_mode_process`` et déplacée dans la classe parente ``AnimationMixer``
ga: Athainmníodh an mhaoin ''playback_process_mode'' go ''callback_mode_process'' agus bhog sé go dtí an bunaicme ''AnimationMixer''
it: Il metodo ``playback_process_mode`` è stato rinominato in ``callback_mode_process`` e spostato nella classe base ``AnimationMixer``
pt_br: Propriedade ``playback_process_mode`` renomeada para ``callback_mode_process`` e movida para a classe base ``AnimationMixer``
ru: Свойство ``playback_process_mode`` переименовано в ``callback_mode_process`` и перемещено в базовый класс ``AnimationMixer``
ta: சொத்து `` blapeback_process_mode``` `` gallback_mode_process`` என மறுபெயரிடப்பட்டு அடிப்படை வகுப்பிற்கு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``playback_process_mode`` özelliği, ``callback_mode_process`` olarak yeniden adlandırıldı ve ``AnimationMixer`` temel sınıfına taşındı
uk: Властивість ``playback_process_mode`` перейменовано на ``callback_mode_process`` і переміщено до базового класу ``AnimationMixer``
zh_hant: 屬性 ``playback_process_mode`` 已更名為 ``callback_mode_process``，並移至基底類別 ``AnimationMixer``

source: Method ``remove_animation_library`` moved to base class ``AnimationMixer``
es: Método ``remove_animation_library`` movido a la clase base ``AnimationMixer``
fr: La méthode ``remove_animation_library`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''remove_animation_library'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``remove_animation_library`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``remove_animation_library`` movido para a classe base ``AnimationMixer``
ru: Метод ``remove_animation_library`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` remove_animation_library`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு நகர்த்தப்பட்டது
tr: ``remove_animation_library`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``remove_animation_library`` перенесено до базового класу ``AnimationMixer``
zh_hant: 方法 ``remove_animation_library`` 已移至基底類別 ``AnimationMixer``
