Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.po
Languages: cs, ga, pt_br, ru, ta, uk

source: Both :ref:`class_String` and :ref:`class_StringName` are now exposed to GDScript. This allows for greater optimization, as StringName is specifically designed to be used for "constant" strings that are created once and reused many times. These types are not strictly equivalent to each other, which means ``is_same("example", &"example")`` returns ``false``. Although in most cases they are interchangeable (``"example" == &"example"`` returns ``true``), sometimes you may have to replace ``"example"`` with ``&"example"``.
ga: Tá an dá :ref:`class_String` agus :ref:`class_StringName` nochta do GDScript anois. Ligeann sé seo leas iomlán a bhaint as níos mó, toisc go bhfuil StringName deartha go sonrach le húsáid le haghaidh teaghráin “leanúnacha” a chruthaítear uair amháin agus a athúsáidtear go minic. Níl na cineálacha seo comhionann go docht lena chéile, rud a chiallaíonn `` is_same ("sampla", & "sampla")`` ar ais `` bréagach``. Cé go bhfuil siad idirmhalartaithe i bhformhór na gcásanna (``"sampla" == & "sampla"`` ar ais `` fíor``), uaireanta b'fhéidir go gcaithfidh tú `` & "sampla" a chur in ionad `` "sampla"`` `.
pt_br: Tanto :ref:`class_String` quanto :ref:`class_StringName` agora estão expostos ao GDScript. Isso permite maior otimização, já que StringName foi projetado especificamente para ser usado com strings "constantes" que são criadas uma vez e reutilizadas diversas vezes. Esses tipos não são estritamente equivalentes entre si, o que significa que ``is_same("example", &"example")`` retorna ``false``. Embora na maioria dos casos sejam intercambiáveis (``"example" == &"example"`` retorna ``true``), às vezes pode ser necessário substituir ``"example"`` por ``&"example"``.
ru: И :ref:`class_String` и :ref:`class_StringName` теперь есть в GDScript. Это обеспечивает большую оптимизацию, т.к. StringName специально создан, чтобы быть использованым как константная строка, которая будет создаваться один раз и переиспользоваться много раз. Эти типы не строго эквивалентны друг другу, это означает что ``is_same("example", &"example")`` возвращает ``false``. Хоть и в большинстве случаев они взаимозаменяемы (``"example" == &"example"`` возвращает ``true``), но иногда вы можете заменить ``"example"`` на ``&"example"``.
ta: இரண்டுமே: குறிப்பு: `class_string` மற்றும்: ref:` class_stringName` இப்போது GDSCRIPT க்கு வெளிப்படும். இது அதிக தேர்வுமுறை அனுமதிக்கிறது, ஏனெனில் சரம் பெயர் குறிப்பாக "நிலையான" சரங்களுக்குப் பயன்படுத்த வடிவமைக்கப்பட்டுள்ளது, அவை ஒரு முறை உருவாக்கப்பட்டு பல முறை மீண்டும் பயன்படுத்தப்படுகின்றன. இந்த வகைகள் ஒருவருக்கொருவர் கண்டிப்பாக சமமானவை அல்ல, அதாவது `` is_same ("எடுத்துக்காட்டு", & "எடுத்துக்காட்டு") `` `` தவறு`` தருகிறது. பெரும்பாலான சந்தர்ப்பங்களில் அவை ஒன்றோடொன்று மாறக்கூடியவை என்றாலும் (`` "எடுத்துக்காட்டு" == & "எடுத்துக்காட்டு" `` `உண்மை`` தருகிறது), சில நேரங்களில் நீங்கள்` `" எடுத்துக்காட்டு "` `` & "எடுத்துக்காட்டு" `உடன் மாற்ற வேண்டியிருக்கும் `.
uk: І :ref:`class_String`, і :ref:`class_StringName` тепер доступні для GDScript. Це забезпечує більшу оптимізацію, оскільки StringName спеціально розроблено для використання для "константи" рядки, які створюються один раз і повторно використовуються багато разів. Ці типи не є строго еквівалентними один одному, що означає, що ``is_same("example", &"example")`` повертає ``false``. Хоча в більшості випадків вони взаємозамінні (``"example" == &"example"`` повертає ``true``), інколи вам може знадобитися замінити ``"example"`` на ``&"example"` `.

source: :ref:`GDScript setter and getter syntax <doc_gdscript_basics_setters_getters>` was changed, but it's only partially converted by the conversion tool. In most cases, manual changes are required to make setters and getters working again.
ga: :ref:`Athraíodh socraitheoir agus faighteoir GDScript <doc_gdscript_basics_setters_getters>`, ach ní dhéantar é a thiontú ach go páirteach ag an uirlis tiontaithe. I bhformhór na gcásanna, tá gá le hathruithe láimhe ionas go n-oibreoidh na socraitheoirí agus na faighteoirí arís.
pt_br: :ref:`A sintaxe de setter e getter do GDScript <doc_gdscript_basics_setters_getters>` foi alterada, mas é convertida somente parcialmente pela ferramenta de conversão. Na maioria dos casos, alterações manuais são necessárias para que setters e getters voltem a funcionar.
ru: :ref:`синтаксис геттеров и сеттеров в GDScript <doc_gdscript_basics_setters_getters>` был изменен, но он был конвертирован только частично конвертационным инструментом. В большинстве случаев, изменения в ручную необходимы для того, чтобы сеттеры и геттеры работали снова.
ta: . பெரும்பாலான சந்தர்ப்பங்களில், செட்டர்கள் மற்றும் பெறுபவர்களை மீண்டும் வேலை செய்ய கையேடு மாற்றங்கள் தேவை.
uk: :ref:`Синтаксис установщика та отримання GDScript <doc_gdscript_basics_setters_getters>` було змінено, але він лише частково перетворено інструментом перетворення. У більшості випадків потрібні ручні зміни, щоб сеттери та геттери знову працювали.

source: :ref:`GDScript signal connection syntax <doc_gdscript_signals>` was changed. The conversion tool will use the string-based syntax which is still present in Godot 4, but it's recommended to switch to the :ref:`class_Signal`-based syntax described on the linked page. This way, strings are no longer involved, which avoids issues with signal name errors that can only be discovered at run-time.
ta: . மாற்று கருவி கோடோட் 4 இல் இன்னும் இருக்கும் சரம் அடிப்படையிலான தொடரியல் பயன்படுத்தும், ஆனால் இணைக்கப்பட்ட பக்கத்தில் விவரிக்கப்பட்டுள்ள `class_signal`- அடிப்படையிலான தொடரியல் ஆகியவற்றிற்கு மாற பரிந்துரைக்கப்படுகிறது. இந்த வழியில், சரங்கள் இனி ஈடுபடவில்லை, இது சமிக்ஞை பெயர் பிழைகள் உள்ள சிக்கல்களைத் தவிர்க்கிறது, அவை ரன்-டைமில் மட்டுமே கண்டுபிடிக்க முடியும்.

source: Built-in scripts that are :ref:`tool scripts <doc_running_code_in_the_editor>` do not get the ``tool`` keyword converted to the ``@tool`` annotation.
ga: Ní fhaigheann scripteanna ionsuite :ref:`scripteanna uirlis <doc_running_code_in_the_editor>` an eochairfhocal ``uirlis`` arna thiontú go dtí an nóta ``@uirlis``.
pt_br: Scripts integrados que são :ref:`scripts de ferramentas <doc_running_code_in_the_editor>` não têm a palavra-chave ``tool`` convertida na anotação ``@tool``.
ru: Встроенные скрипты :ref:`tool scripts <doc_running_code_in_the_editor>` не получат конвертацию ключевого слова ``tool`` в аннотацию ``@tool``.
ta: உள்ளமைக்கப்பட்ட ச்கிரிப்ட்கள்: ref: `கருவி ச்கிரிப்ட்கள் <doc_running_code_in_the_editor>` `` `@கருவி`` சிறுகுறிப்புக்கு மாற்றப்பட்ட` `கருவி`` முக்கிய சொல்லைப் பெற வேண்டாம்.
uk: Вбудовані сценарії, які є :ref:`скриптами інструментів <doc_running_code_in_the_editor>`, не перетворюють ключове слово ``tool`` на анотацію ``@tool``.

source: The Tween node was removed in favor of Tweeners, which are also available in Godot 3.5 and later. See the `original pull request <https://github.com/godotengine/godot/pull/41794>`__ for details.
ga: Baineadh an nód Tween i bhfabhar Tweeners, atá ar fáil freisin i Godot 3.5 agus níos déanaí. Féach ar an `iarratas tarraingt bunaidh <https://github.com/godotengine/godot/pull/41794>`__ le haghaidh sonraí.
pt_br: O nó Tween foi removido em favor dos Tweeners, que também estão disponíveis no Godot 3.5 e versões posteriores. Veja o `pull request original <https://github.com/godotengine/godot/pull/41794>`__ para mais detalhes.
ru: Узел Tween был удален ради Tweeners, который также доступен в Godot 3.5 и более старших версиях. Посмотрите `original pull request <https://github.com/godotengine/godot/pull/41794>`__.
ta: இருபது முனை ட்வீனர்களுக்கு ஆதரவாக அகற்றப்பட்டது, அவை கோடோட் 3.5 மற்றும் அதற்குப் பிறகு கிடைக்கின்றன. விவரங்களுக்கு `அசல் இழுப்பு கோரிக்கை <https://github.com/godotengine/godotengine/godotengine ஐக் காண்க
uk: Вузол Tween було видалено на користь Tweeners, які також доступні в Godot 3.5 і пізніших версіях.Перегляньте `оригінальний запит на витягування <https://github.com/godotengine/godot/pull/41794>`__ для деталей.

source: ``randomize()`` is now automatically called on project load, so deterministic randomness with the global RandomNumberGenerate instance requires manually setting a seed in a script's ``_ready()`` function.
ga: Glaoitear ''randomize()'' go huathoibríoch anois ar ualach an tionscadail, mar sin éilíonn randamacht chinntitheach leis an ásc domhanda RandomNumberGenerate síol a shocrú de láimh i bhfeidhm ''_ready()'' scripte.
pt_br: ``randomize()`` agora é chamado automaticamente no carregamento do projeto, portanto a aleatoriedade determinística com a instância global RandomNumberGenerate requer a configuração manual de uma semente na função ``_ready()`` de um script.
ru: ``randomize()`` теперь автоматически вызывается при загрузке проекта, так что детерминированная рандомизация глобального экземпляра RandomNumberGenerator требует ручной установки сида в скриптовой функции ``_ready()``.
ta: `` சீரற்ற () `` இப்போது தானாகவே திட்ட சுமைக்கு அழைக்கப்படுகிறது, எனவே உலகளாவிய ரேண்டம்நெக்னரேட் நிகழ்வுடன் தீர்மானிக்கும் சீரற்ற தன்மைக்கு ஒரு ச்கிரிப்ட்டின் `` _ ரெடி () `` செயல்பாட்டில் ஒரு விதை கைமுறையாக அமைக்க வேண்டும்.
uk: ``randomize()`` тепер автоматично викликається під час завантаження проекту, тому детермінована випадковість із глобальним екземпляром RandomNumberGenerate вимагає вручну встановити початкове значення у функції ``_ready()`` сценарію.

source: ``call_group()``, ``set_group()`` and ``notify_group()`` are now immediate by default. If calling an expensive function, this may result in stuttering when used on a group containing a large number of nodes. To use deferred calls like before, replace ``call_group(...)`` with ``call_group_flags(SceneTree.GROUP_CALL_DEFERRED, ...)`` (and do the same with ``set_group()`` and ``notify_group()`` respectively).
ga: Tá ''call_group()'', ''set_group()'' agus ''notify_group()'' láithreach de réir réamhshocraithe. Má tá feidhm chostasach á glaoch, d'fhéadfadh stuttering a bheith mar thoradh air seo nuair a úsáidtear é ar ghrúpa ina bhfuil líon mór nóid. Chun glaonna iarchurtha mar a rinneadh roimhe seo a úsáid, cuir ''call_group(...) in ionad ''(...) '' le ''call_group_flags(SceneTree.GROUP_CALL_DEFERRED, ...) '' (agus déan an rud céanna le ''set_group()'' agus ''notify_group()'' faoi seach).
pt_br: ``call_group()``, ``set_group()`` e ``notify_group()`` agora são imediatos por padrão. Se estiver chamando uma função custosa, isso pode causar travamentos quando usado em um grupo com um grande número de nós. Para utilizar chamadas adiadas como antes, substitua ``call_group(...)`` por ``call_group_flags(SceneTree.GROUP_CALL_DEFERRED, ...)`` (e faça o mesmo com ``set_group()`` e ``notify_group()`` respectivamente).
ru: ``call_group()``, ``set_group()`` и ``notify_group()`` теперь применяются мгновенно по умолчанию. При вызове на большой функции, это может привести к замедлению если используется с группой из большого числа узлов. Для использования отложенных вызовов как прежде, замените ``call_group(...)`` на ``call_group_flags(SceneTree.GROUP_CALL_DEFERRED, ...)`` (а также сделайте то же самое с ``set_group()`` и ``notify_group()`` соответственно).
ta: `` Call_Group () ``, `` set_group () `` மற்றும் `` `அறிவிப்பு_ குழுமம் ()` `இப்போது இயல்பாகவே உடனடியாக உள்ளன. விலையுயர்ந்த செயல்பாட்டை அழைத்தால், அதிக எண்ணிக்கையிலான முனைகளைக் கொண்ட குழுவில் பயன்படுத்தும்போது இது திணறக்கூடும். முன்பைப் போலவே ஒத்திவைக்கப்பட்ட அழைப்புகளைப் பயன்படுத்த, `` Call_group () `` `` Call_group_flags (schesetree.group_call_deferred, ...) `` (`` set_group () `` `` அறிவிக்கவும்_ குழுமம் () `` முறையே).
uk: ``call_group()``, ``set_group()`` і ``notify_group()`` тепер негайні за замовчуванням. Якщо викликати дорогу функцію, це може призвести до заїкань під час використання в групі, що містить велику кількість вузлів. Щоб використовувати відкладені дзвінки, як раніше, замініть ``call_group(...)`` на ``call_group_flags(SceneTree.GROUP_CALL_DEFERRED, ...)`` (і зробіть те саме з ``set_group()`` і ``notify_group) ()`` відповідно).

source: Instead of ``rotation_degrees``, the ``rotation`` property is exposed to the editor, which is automatically displayed as degrees in the Inspector dock. This may break animations, as the conversion is not handled automatically by the conversion tool.
ga: In áit ''rotation_degrees'', nochtar an mhaoin 'uainíochta'' don eagarthóir, a thaispeántar go huathoibríoch mar chéimeanna i nduga an Chigire. D'fhéadfadh sé seo beochan a bhriseadh, toisc nach láimhseáiltear an tiontú go huathoibríoch ag an uirlis chomhshó.
pt_br: Em vez de ``rotation_degrees``, a propriedade ``rotation`` é exposta ao editor, sendo exibida automaticamente como graus na aba do Inspetor. Isso pode interromper as animações, pois a conversão não é realizada automaticamente pela ferramenta de conversão.
ru: Вместо ``rotation_degrees``, свойство ``rotation`` было открыто в редакторе, оно автоматически показывается в градусах в панели Инспектора. Это может сломать анимации, так как конвертация не обрабатывается автоматически утилитой конвертации.
ta: `` சுழற்சி_டெக்ரீச்`` க்கு பதிலாக, `` சுழற்சி`` சொத்து எடிட்டருக்கு வெளிப்படும், இது தானாகவே இன்ச்பெக்டர் கப்பல்துறையில் டிகிரிகளாக காட்டப்படும். இது அனிமேசன்களை உடைக்கக்கூடும், ஏனெனில் மாற்று கருவியால் மாற்றம் தானாகவே கையாளப்படாது.
uk: Замість ``rotation_degrees``, властивість ``rotation`` доступна для редактора, яка автоматично відображається як градуси в панелі Inspector. Це може порушити анімацію, оскільки конвертація не виконується автоматично інструментом конвертації.

source: :ref:`class_AABB`'s ``has_no_surface()`` was inverted and renamed to ``has_surface()``.
ga: :ref:'class_AABB's ''has_no_surface()'' a bhí inbhéartaithe agus athainmníodh é go ''has_surface()''.
pt_br: O método ``has_no_surface()`` da :ref:`class_AABB` foi invertido e renomeado para ``has_surface()``.
ru: У :ref:`class_AABB` метод ``has_no_surface()`` был инвертирован и переименован в ``has_surface()``.
ta: :ref:`class_AABB`'s ``has_no_surface()`` was inverted and renamed பெறுநர் ``has_surface()``.
uk: :ref:`class_AABB`'s ``has_no_surface()`` було перевернуто та перейменовано на ``has_surface()``.

source: :ref:`class_AABB` and :ref:`class_Rect2`'s ``has_no_area()`` was inverted and renamed to ``has_area()``.
ga: :ref:'class_AABB' agus :ref:'class_Rect2's ''has_no_area()'' a inbhéartaíodh agus athainmníodh é go ''has_area()''.
pt_br: ``has_no_area()`` de :ref:`class_AABB` e :ref:`class_Rect2` foi invertido e renomeado para ``has_area()``.
ru: У :ref:`class_AABB` и :ref:`class_Rect2` метод ``has_no_area()`` был инвертирован и переименован в ``has_area()``.
ta: :ref:`class_AABB` and :ref:`class_Rect2`'s ``has_no_area()`` was inverted and renamed பெறுநர் ``has_area()``.
uk: :ref:`class_AABB` і :ref:`class_Rect2` ``has_no_area()`` було інвертовано та перейменовано на ``has_area()``.

source: :ref:`class_AnimatedTexture`'s ``fps`` property was replaced by ``speed_scale``, which works the same as AnimationPlayer's ``playback_speed`` property.
ga: :ref:Cuireadh ''speed_scale'' in ionad mhaoin ''fps'' class_AnimatedTexture, a oibríonn mar an gcéanna le maoin ''playback_speed'' AnimationPlayer.
pt_br: A propriedade ``fps`` do :ref:`class_AnimatedTexture` foi substituída por ``speed_scale``, que funciona da mesma forma que a propriedade ``playback_speed`` do AnimationPlayer.
ru: У :ref:`class_AnimatedTexture` свойство ``fps`` было заменено на ``speed_scale``, которое работает также, как и свойство ``playback_speed`` у AnimationPlayer.
ta: :ref:`class_AnimatedTexture`'s ``fps`` property was replaced by ``speed_scale``, which works the same அச் AnimationPlayer's ``playback_speed`` property.
uk: Властивість ``fps`` :ref:`class_AnimatedTexture` було замінено на ``speed_scale``, яке працює так само, як і властивість ``playback_speed`` AnimationPlayer.

source: :ref:`class_AnimatedSprite2D` and :ref:`class_AnimatedSprite3D` now allow negative ``speed_scale`` values. This may break animations if you relied on ``speed_scale`` being internally clamped to ``0.0``.
ga: :ref:'class_AnimatedSprite2D' agus :ref:'class_AnimatedSprite3D' anois a cheadú luachanna diúltacha ''speed_scale'''. D'fhéadfadh sé seo beochan a bhriseadh má bhí tú ag brath ar ''speed_scale'' a bheith clampáilte go hinmheánach go ''0.0''.
pt_br: :ref:`class_AnimatedSprite2D` e :ref:`class_AnimatedSprite3D` agora permitem valores ``speed_scale`` negativos. Isso pode interromper as animações se você depender de ``speed_scale`` ser fixado internamente em ``0.0``.
ru: У :ref:`class_AnimatedSprite2D` и :ref:`class_AnimatedSprite3D` теперь свойство ``speed_scale`` может иметь отрицательные значения. Это может сломать анимации если вы надеялись, что ``speed_scale`` всегда будет больше 0.
ta: . `` ச்பீட்_ச்கேல்`` உள்நாட்டில் `` 0.0`` உடன் இணைந்திருந்தால் இது அனிமேசன்களை உடைக்கக்கூடும்.
uk: :ref:`class_AnimatedSprite2D` і :ref:`class_AnimatedSprite3D` тепер допускають негативні значення ``speed_scale``. Це може порушити анімацію, якщо ви покладалися на те, що ``speed_scale`` внутрішньо закріплено на ``0.0``.

source: :ref:`class_AnimatedSprite2D` and :ref:`class_AnimatedSprite3D`'s ``playing`` property was removed. Use ``play()``/``stop()`` method instead OR configure ``autoplay`` animation via the SpriteFrames bottom panel (but not both at once).
ga: :ref:'class_AnimatedSprite2D' agus :ref:Baineadh maoin ''playing'' class_AnimatedSprite3D. Bain úsáid as an modh ''play()''/''stop()'' ina ionad NÓ cumraigh beochan ''autoplay'' tríd an bpainéal bun SpriteFrames (ach ní an dá cheann ag an am céanna).
pt_br: A propriedade ``playing`` de :ref:`class_AnimatedSprite2D` e :ref:`class_AnimatedSprite3D` foi removida. Use o método ``play()``/``stop()`` OU configure a animação ``autoplay`` através do painel inferior SpriteFrames (mas não ambos ao mesmo tempo).
ru: У :ref:`class_AnimatedSprite2D` и :ref:`class_AnimatedSprite3D` удалено свойство ``playing``. Используйте методы ``play()``/``stop()`` вместо ИЛИ настройте ``autoplay`` анимацию через нижнюю панель Кадры спрайта (но не оба одновременно).
ta: . அதற்கு பதிலாக `` ப்ளே () `/` `நிறுத்து ()` முறையைப் பயன்படுத்தவும் அல்லது ச்ப்ரைட்ஃப்ரேம்கள் கீழ் பேனல் வழியாக `` ஆட்டோபிளே`` அனிமேசனை உள்ளமைக்கவும் (ஆனால் இரண்டுமே ஒரே நேரத்தில் அல்ல).
uk: :ref:`class_AnimatedSprite2D` і :ref:`class_AnimatedSprite3D` властивість ``playing`` видалено. Замість цього використовуйте метод ``play()``/``stop()`` АБО налаштуйте анімацію ``autoplay`` через нижню панель SpriteFrames (але не обидва одночасно).

source: :ref:`class_Array`'s ``slice()`` second parameter (``end``) is now *exclusive*, instead of being inclusive. For example, this means that ``[1, 2, 3].slice(0, 1)`` now returns ``[1]`` instead of ``[1, 2]``.
ga: :ref:'class_Array's ''slice()'' an dara paraiméadar (''end'') anois *exclusive *, in ionad a bheith cuimsitheach. Mar shampla, ciallaíonn sé seo go bhfilleann ''[1, 2, 3].slice(0, 1)'' anois ''[1]'' in ionad ''[1, 2]''.
pt_br: O segundo parâmetro ``slice()`` de :ref:`class_Array` (``end``) agora é *exclusivo*, em vez de inclusivo. Por exemplo, isso significa que ``[1, 2, 3].slice(0, 1)`` agora retorna ``[1]`` em vez de ``[1, 2]``.
ru: У :ref:`class_Array` второй параметр (``end``) метода ``slice()`` *исключает* последний элемент, вместо того, чтобы включать его. Например, это означает, что ``[1, 2, 3].slice(0, 1)`` теперь возвращает ``[1]`` вместо ``[1, 2]``.
ta: . எடுத்துக்காட்டாக, இதன் பொருள் `` [1, 2, 3] .ச்லிச் (0, 1) `` இப்போது `` [1, 2] `` என்பதற்கு பதிலாக `` 1] `` திரும்புகிறது.
uk: :ref:`class_Array`'s ``slice()`` другий параметр (``end``) тепер є *виключним*, а не включним. Наприклад, це означає, що ``[1, 2, 3].slice(0, 1)`` тепер повертає ``[1]`` замість ``[1, 2]``.

source: :ref:`class_BaseButton`'s signals are now ``button_up`` and ``button_down``. The ``pressed`` property is now ``button_pressed``.
ga: :ref:'class_BaseButton's signals are now ''button_up'' agus ''button_down''. Tá an mhaoin ''brúite'' anois ''button_pressed''.
pt_br: Os sinais de :ref:`class_BaseButton` agora são ``button_up`` e ``button_down``. A propriedade ``pressed`` agora é ``button_pressed``.
ru: Теперь сигналами :ref:`class_BaseButton` являются ``button_up`` и ``button_down``. Свойство ``pressed`` теперь называется ``button_pressed``.
ta: . `` அழுத்தப்பட்ட`` சொத்து இப்போது `` பொத்தான்_பிரச் செய்யப்பட்டுள்ளது``.
uk: Сигнали :ref:`class_BaseButton` тепер ``button_up`` і ``button_down``. Властивість ``pressed`` тепер ``button_pressed``.

source: Camera2D's ``zoom`` property was inverted: higher values are now more zoomed in, instead of less.
ga: Inbhéartaíodh maoin ''zoom'' Camera2D: tá luachanna níos airde níos zúmáilte isteach anois, seachas níos lú.
pt_br: A propriedade ``zoom`` do Camera2D foi invertida: valores mais altos agora são mais ampliados, em vez de menos.
ru: Свойство ``zoom`` у Camera2D было инвертировано. Теперь более высокие значения приближают вместо того, чтобы отдалять.
ta: கேமரா 2 டி இன் `` சூம்`` சொத்து தலைகீழாக இருந்தது: அதிக மதிப்புகள் இப்போது குறைவாக பெரிதாக்கப்படுகின்றன.
uk: Властивість Camera2D ``zoom`` було інвертовано: вищі значення тепер збільшено більше, а не менше.

source: :ref:`class_Node`'s ``remove_and_skip()`` method was removed. If you need to reimplement it in a script, you can use the `old C++ implementation <https://github.com/godotengine/godot/blob/7936b3cc4c657e4b273b376068f095e1e0e4d82a/scene/main/node.cpp#L1910-L1945>`__ as a reference.
ga: :ref: baineadh an modh ``remove_and_skip()`` `class_Node`. Más gá duit é a athchur i script, is féidir leat an `seanchur i bhfeidhm C++ a úsáid <https://github.com/godotengine/godot/blob/7936b3cc4c657e4b273b376068f095e1e0e4d82a/scene/main/node.cpp-#L19> as tagairt.
pt_br: O método ``remove_and_skip()`` da :ref:`class_Node` foi removido. Se precisar reimplementá-lo em um script, você pode usar a `implementação antiga em C++ <https://github.com/godotengine/godot/blob/7936b3cc4c657e4b273b376068f095e1e0e4d82a/scene/main/node.cpp#L1910-L1945>`__ como referência.
ru: У :ref:`class_Node` метод ``remove_and_skip()`` был удален. Если вам нужно использовать его в скрипте используйте `старую C++ реализацию <https://github.com/godotengine/godot/blob/7936b3cc4c657e4b273b376068f095e1e0e4d82a/scene/main/node.cpp#L1910-L1945>`__.
ta: . நீங்கள் அதை ஒரு ச்கிரிப்டில் திருப்பிச் செலுத்த வேண்டும் என்றால், நீங்கள் `பழைய சி ++ செயல்படுத்தல் <https://github.com/godotengine/godot/blob/blob/7936b3cc4c657e4b276068f095e1e0e0e0e0e0e0e4d82a/sman. ஒரு குறிப்பு.
uk: :ref:`class_Node`'s ``remove_and_skip()`` метод видалено. Якщо вам потрібно повторно реалізувати його в сценарії, ви можете використати `«стару реалізацію C++». <https://github.com/godotengine/godot/blob/7936b3cc4c657e4b273b376068f095e1e0e4d82a/scene/main/node.cpp#L1910-L1945>`__ як посилання.

source: ``OS.get_system_time_secs()`` should be converted to ``Time.get_time_dict_from_system()["second"]``.
ga: Ba chóir ''OS.get_system_time_secs()'' a thiontú go ''Time.get_time_dict_from_system()["second"]''.
pt_br: ``OS.get_system_time_secs()`` deve ser convertido para ``Time.get_time_dict_from_system()["second"]``.
ru: ``OS.get_system_time_secs()`` стоит заменить на ``Time.get_time_dict_from_system()["second"]``.
ta: `` Os.get_system_time_secs () `` `` நேரம்.
uk: ``OS.get_system_time_secs()`` слід перетворити на ``Time.get_time_dict_from_system()["second"]``.
