Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.po
Languages: cs, ga, pt_br, ru, ta, uk

source: PathFollow2D and PathFollow3D's ``offset`` is now ``progress``.
ga: Is é ''offset'' PathFollow2D agus PathFollow3D anois ''dul chun cinn''.
pt_br: O ``offset`` do PathFollow2D e PathFollow3D agora é ``progress``.
ru: У PathFollow2D и PathFollow3D ``offset`` теперь ``progress``.
ta: Pathfollow2d மற்றும் pathfollow3d இன் `` ஆஃப்செட்`` இப்போது `` முன்னேற்றம்``.
uk: ``Зсув`` PathFollow2D і PathFollow3D тепер ``прогрес``.

source: TextureProgressBar's ``percent_visible`` is now ``show_percentage``.
ga: UigeachtProgressBar's ''percent_visible'' anois ''show_percentage''.
pt_br: ``percent_visible`` do TextureProgressBar agora é ``show_percentage``.
ru: У TextureProgressBar ``percent_visible`` теперь ``show_percentage``.
ta: SexepReprogRessbar இன் `` சதவீதம்_விசிபிள்`` இப்போது `` show_percentage``.
uk: ``percent_visible`` TextureProgressBar тепер ``show_percentage``.

source: The ``extents`` property on CSG nodes and VoxelGI will have to be replaced with ``size``, with the set value halved (as they're no longer half-extents). This also affects its setter/getter methods ``set_extents()`` and ``get_extents()``.
ga: Ní mór ''méid'' a chur in ionad na maoine ''extents'' ar nóid CSG agus VoxelGI, agus leathfar an luach socraithe (toisc nach leathmhéid iad a thuilleadh). Bíonn tionchar aige sin freisin ar a mhodhanna socraithe/getter ''set_extents()'' agus ''get_extents()''.
pt_br: A propriedade ``extents`` nos nós CSG e VoxelGI terá que ser substituída por ``size``, com o valor definido reduzido pela metade (já que não são mais extensões pela metade). Isso também afeta seus métodos setter/getter ``set_extents()`` e ``get_extents()``.
ru: Свойство ``extents`` в узлах CSG и VoxelGI придется заменить на ``size``, при этом установленное значение будет уменьшено вдвое (поскольку они больше не являются половинными экстентами). Это также влияет на его методы set/get ``set_extents()`` и ``get_extents()``.
ta: சி.எச்.சி முனைகள் மற்றும் வோக்சல்கி ஆகியவற்றில் உள்ள `` விரிவாக்கங்கள்` சொத்து `` அளவு`` உடன் மாற்றப்பட வேண்டும், செட் மதிப்பு பாதியாக இருந்தது (அவை இனி அரை நீட்டிப்பாக இருக்காது). இது அதன் செட்டர்/கெட்டர் முறைகளையும் பாதிக்கிறது `` set_extents () `` மற்றும் `` get_extents () ``.
uk: Властивість ``extents`` на вузлах CSG і VoxelGI потрібно буде замінити на ``size``, при цьому задане значення буде зменшено вдвічі (оскільки вони більше не є напівекстентами). Це також впливає на його методи установки/отримання ``set_extents()`` і ``get_extents()``.

source: The ``Engine.editor_hint`` property was removed in favor of the ``Engine.is_editor_hint()`` *method*. This is because it's read-only, and properties in Godot are not used for read-only values.
ga: Baineadh an mhaoin ''Engine.editor_hint'' i bhfabhar an ''Engine.is_editor_hint()'' *method *. Tá sé seo toisc go bhfuil sé inléite amháin, agus nach n-úsáidtear airíonna i Godot le haghaidh luachanna inléite amháin.
pt_br: A propriedade ``Engine.editor_hint`` foi removida em favor do *método* ``Engine.is_editor_hint()``. Isso ocorre porque ela é somente leitura, e propriedades no Godot não são usadas para valores somente leitura.
ru: Свойство ``Engine.editor_hint`` удалено в пользу *метода* ``Engine.is_editor_hint()``. Это было сделано поскольку оно только для чтения, а свойства в Godot не могут быть только для чтения.
ta: `` Engine.ititor_hint`` சொத்து `` Engine.is_editor_hint () `` *முறை *க்கு ஆதரவாக அகற்றப்பட்டது. ஏனென்றால் இது படிக்க மட்டுமே, மற்றும் கோடோட்டில் உள்ள பண்புகள் படிக்க மட்டும் மதிப்புகளுக்கு பயன்படுத்தப்படவில்லை.
uk: Властивість ``Engine.editor_hint`` було видалено на користь ``Engine.is_editor_hint()`` *методу*. Це тому, що він доступний лише для читання, а властивості в Godot не використовуються для значень лише для читання.

source: **Enums**
ru: **Перечисления**
ta: ** எண்ணிகள் **
uk: **Юним**

source: CPUParticles2D's ``FLAG_MAX`` is now ``PARTICLE_FLAG_MAX``.
ga: Is é ''FLAG_MAX'' CPUParticles2D anois ''PARTICLE_FLAG_MAX''.
pt_br: ``FLAG_MAX`` do CPUParticles2D agora é ``PARTICLE_FLAG_MAX``.
ru: У CPUParticles2D ``FLAG_MAX`` теперь ``PARTICLE_FLAG_MAX``.
ta: Cpuparticles2d இன் `` flag_max`` இப்போது `` துகள்_ஃப்ளாக்_மேக்ச்``.
uk: ``FLAG_MAX`` CPUParticles2D тепер ``PARTICLE_FLAG_MAX``.

source: **Signals**
ga: **Comharthaí**
ru: **Сигналы**
ta: ** சமிக்ஞைகள் **
uk: **Сигнали**

source: FileSystemDock's ``instantiate`` is now ``instance``.
ga: Is é ''instantiate'' fileSystemDock anois ''instance''.
pt_br: ``instantiate`` do FileSystemDock agora é ``instance``.
ru: У FileSystemDock ``instantiate`` теперь ``instance``.
ta: Filesystemdock இன் `` உடனடி`` இப்போது `` நிகழ்வு``.
uk: ``Екземпляр`` FileSystemDock тепер є ``примірником``.

source: CanvasItem's ``hide`` is now ``hidden``. This rename does **not** apply to the ``hide()`` method, only the signal.
ga: Tá ''hide'' CanvasItem anois ''i bhfolach''. Ní bhaineann an t-athainmniú seo **** leis an modh ''hide()'', ach an comhartha.
pt_br: ``hide`` do CanvasItem agora é ``hidden``. Esta renomeação **não** se aplica ao método ``hide()``, apenas ao sinal.
ru: У CanvasItem ``hide`` теперь ``hidden``. Это переименование **не** применяется к методу ``hide()``, только к сигналу.
ta: Canvasitem இன் `` மறை`` இப்போது `` மறைக்கப்பட்டுள்ளது``. இந்த மறுபெயரிடு ** அல்ல ** `` மறை () `` முறைக்கு பொருந்தும், சமிக்ஞை மட்டுமே.
uk: ``Hide`` CanvasItem тепер ``схований``. Це перейменування **не** стосується методу ``hide()``, а лише сигналу.

source: Tween's ``tween_all_completed`` is now ``loop_finished``.
ga: Is é ''tween_all_completed'' Tween anois ''loop_finished''.
pt_br: ``tween_all_completed`` do Tween agora é ``loop_finished``.
ru: У Tween ``tween_all_completed`` теперь ``loop_finished``.
ta: ட்வீன் `` ட்வீன்_ஆல்_கிளெட்டட்`` இப்போது `` லூப்_ஃபைன் ``.
uk: Tween ``tween_all_completed`` тепер ``loop_finished``.

source: EditorSettings' ``changed`` is now ``settings_changed``.
ga: EagarthóirSettings' Is é ''changed'' anois ''settings_changed''.
pt_br: ``changed`` do EditorSettings agora é ``settings_changed``.
ru: У EditorSettings ``changed`` теперь ``settings_changed``.
ta: EtitorSettings `` மாற்றப்பட்டது`` இப்போது `` sentings_changed``.
uk: EditorSettings ``changed`` тепер ``settings_changed``.

source: **Constants**
ga: **Tairisigh**
ru: **Константы**
ta: ** மாறிலிகள் **
uk: **Константи**

source: Color names are now uppercase and use underscores between words. For example, ``Color.palegreen`` is now ``Color.PALE_GREEN``.
ga: Tá ainmneacha datha in uachtar anois agus úsáideann siad béimeanna idir focail. Mar shampla, is é ''Color.palegreen'' anois ''Color.PALE_GREEN''.
pt_br: Os nomes das cores agora são escritos em letras maiúsculas e usam sublinhados entre as palavras. Por exemplo, ``Color.palegreen`` agora é ``Color.PALE_GREEN``.
ru: Названия цветов теперь написаны большими буквами и используют нижнее подчеркивание между словами. Для примера, ``Color.palegreen`` теперь ``Color.PALE_GREEN``.
ta: வண்ண பெயர்கள் இப்போது பெரிய எழுத்துக்கள் மற்றும் சொற்களுக்கு இடையில் அடிக்கோடிட்டுக் காட்டுகின்றன. எடுத்துக்காட்டாக, `` color.palegreen`` இப்போது `` color.pale_green``.
uk: Назви кольорів тепер пишуться великими літерами, а між словами використовуються підкреслення. Наприклад, ``Color.palegreen`` тепер ``Color.PALE_GREEN``.

source: MainLoop's ``NOTIFICATION_`` constants were duplicated to ``Node`` which means you can remove the ``MainLoop.`` prefix when referencing them.
ga: Rinneadh tairisigh ''NOTIFICATION_'' MainLoop a dhúbailt go ''Node'' rud a chiallaíonn gur féidir leat an réimír ''MainLoop.'' a bhaint agus tagairt á déanamh dóibh.
pt_br: As constantes ``NOTIFICATION_`` do MainLoop foram duplicadas para ``Node``, o que significa que você pode remover o prefixo ``MainLoop.`` ao referenciá-las.
ru: Константы ``NOTIFICATION_`` у MainLoop были скопированы в ``Node`` что означает что вы можете удалить префикс ``MainLoop.`` при ссылке на них.
ta: மெயின்லூப்பின் `` அறிவிப்பு_`` மாறிலிகள் `` முனை`` க்கு நகலெடுக்கப்பட்டன, அதாவது நீங்கள் அவற்றைக் குறிப்பிடும்போது `` mainloop.`` முன்னொட்டை அகற்றலாம்.
uk: Константи MainLoop ``NOTIFICATION_`` були продубльовані до ``Node``, що означає, що ви можете видалити префікс ``MainLoop.`` під час посилання на них.

source: MainLoop's ``NOTIFICATION_WM_QUIT_REQUEST`` is now ``NOTIFICATION_WM_CLOSE_REQUEST``.
ga: Is é ''NOTIFICATION_WM_QUIT_REQUEST'' MainLoop anois ''NOTIFICATION_WM_CLOSE_REQUEST''.
pt_br: ``NOTIFICATION_WM_QUIT_REQUEST`` do MainLoop agora é ``NOTIFICATION_WM_CLOSE_REQUEST``.
ru: У MainLoop ``NOTIFICATION_WM_QUIT_REQUEST`` теперь ``NOTIFICATION_WM_CLOSE_REQUEST``.
ta: Mainloop இன் `` அறிவிப்பு_WM_QUIT_REQUEST`` இப்போது `` அறிவிப்பு_WM_CLOSE_REQUEST``.
uk: ``NOTIFICATION_WM_QUIT_REQUEST`` MainLoop тепер ``NOTIFICATION_WM_CLOSE_REQUEST``.

source: Checking project settings
ga: Socruithe an tionscadail á seiceáil
ru: Проверка настроек проекта
ta: திட்ட அமைப்புகளை சரிபார்க்கிறது
uk: Перевірка налаштувань проекту

source: Several project settings were renamed, and some of them had their enums changed in incompatible ways (such as shadow filter quality). This means you may need to set some project settings' values again. Make sure the **Advanced** toggle is enabled in the project settings dialog so you can see all project settings.
ga: Athainmníodh roinnt socruithe tionscadail, agus d'athraigh cuid acu a n-enums ar bhealaí neamh-chomhoiriúnacha (mar shampla cáilíocht scagaire scáth). Ciallaíonn sé seo go mb'fhéidir go mbeidh ort luachanna roinnt socruithe tionscadail a shocrú arís. Cinntigh go bhfuil an scoránú **Advanced**cumasaithe sa dialóg socruithe tionscadail ionas gur féidir leat gach socrú tionscadail a fheiceáil.
pt_br: Várias configurações do projeto foram renomeadas, e algumas delas tiveram suas enumerações alteradas de maneiras incompatíveis (como a qualidade do filtro de sombra). Isso significa que você pode precisar redefinir alguns valores das configurações do projeto. Certifique-se de que a opção **Avançado** esteja habilitada na caixa de diálogo de configurações do projeto para que você possa ver todas as configurações do projeto.
ru: Несколько настроек проекта было переименовано, и некоторые из них имеют изменения в перечислениях нарушающих совместимость (например качество фильтра теней). Это означает что вам нужно установить некоторые настройки проекта заново. Убедитесь что **Расширенные настройки** включены в диалоге настроек проекта, так чтобы вы видели все настройки.
ta: பல திட்ட அமைப்புகள் மறுபெயரிடப்பட்டன, அவற்றில் சில அவற்றின் குறிப்புகள் பொருந்தாத வழிகளில் மாற்றப்பட்டன (நிழல் வடிகட்டி தகுதி போன்றவை). இதன் பொருள் நீங்கள் சில திட்ட அமைப்புகளின் மதிப்புகளை மீண்டும் அமைக்க வேண்டியிருக்கலாம். திட்ட அமைப்புகள் உரையாடலில் ** மேம்பட்ட ** மாற்று இயக்கப்பட்டிருப்பதை உறுதிசெய்க, எனவே நீங்கள் அனைத்து திட்ட அமைப்புகளையும் காணலாம்.
uk: Кілька налаштувань проекту було перейменовано, а переліки деяких із них змінено несумісними способами (наприклад, якість тіньового фільтра). Це означає, що вам може знадобитися знову встановити деякі параметри проекту. Переконайтеся, що перемикач **Додатково** увімкнено в діалоговому вікні налаштувань проекту, щоб ви могли бачити всі налаштування проекту.

source: Checking Environment settings
ga: Socruithe timpeallachta á seiceáil
ru: Проверка параметров Окружения
ta: சுற்றுச்சூழல் அமைப்புகளை சரிபார்க்கிறது
uk: Перевірка параметрів середовища

source: Graphics quality settings were moved from Environment properties to project settings. This was done to make run-time quality adjustments easier, without having to access the currently active Environment resource then modify its properties.
ta: கிராபிக்ச் தர அமைப்புகள் சுற்றுச்சூழல் பண்புகளிலிருந்து திட்ட அமைப்புகளுக்கு நகர்த்தப்பட்டன. தற்போது செயலில் உள்ள சுற்றுச்சூழல் வளத்தை அணுகாமல், அதன் பண்புகளை மாற்றாமல், ரன்-டைம் தர மாற்றங்களை எளிதாக்க இது செய்யப்பட்டது.

source: As a result, you will have to configure Environment quality settings in the project settings as old Environment quality settings aren't converted automatically to project settings.
ga: Mar thoradh air sin, beidh ort socruithe cáilíochta Comhshaoil a chumrú i socruithe an tionscadail toisc nach ndéantar seansocruithe cáilíochta Comhshaoil a thiontú go huathoibríoch chuig socruithe tionscadail.
pt_br: Como resultado, você terá que configurar as configurações de qualidade do Environment nas configurações do projeto, pois as configurações antigas de qualidade do Environment não são convertidas automaticamente para as configurações do projeto.
ru: Как результат, вам нужно будет настроить настройки качества Окружения в настройках проекта, так как старые настройки Окружения не конвертируются автоматически в настройках проекта.
ta: இதன் விளைவாக, பழைய சுற்றுச்சூழல் தர அமைப்புகள் தானாக திட்ட அமைப்புகளுக்கு மாற்றப்படாததால், திட்ட அமைப்புகளில் சுற்றுச்சூழல் தர அமைப்புகளை நீங்கள் கட்டமைக்க வேண்டும்.
uk: У результаті вам доведеться налаштувати параметри якості середовища в параметрах проекту, оскільки старі параметри якості середовища не перетворюються автоматично на параметри проекту.

source: If you have a graphics settings menu that changed environment properties in Godot 3.x, you will have to change its code to call :ref:`class_RenderingServer` methods that affect environment effects' quality. Only the "base" toggle of each environment effect and its visual knobs remain within the Environment resource.
ga: Má tá roghchlár socruithe grafaicí agat a d'athraigh airíonna timpeallachta i Godot 3.x, beidh ort a chód a athrú chun glaoch ar mhodhanna :ref:'class_RenderingServer' a théann i bhfeidhm ar chaighdeán na n-éifeachtaí comhshaoil. Ní fhanann ach an scoránú "bonn" de gach éifeacht chomhshaoil agus a knobs amhairc laistigh den acmhainn Comhshaoil.
pt_br: Se você tiver um menu de configurações gráficas que alterou as propriedades do ambiente no Godot 3.x, será necessário alterar o código para chamar os métodos :ref:`class_RenderingServer` que afetam a qualidade dos efeitos do ambiente. Somente o botão de alternância "base" de cada efeito do ambiente e seus botões visuais permanecem no recurso do Environment.
ru: Если в вашем проекте есть меню настройки графики которое изменяет свойства окружения в Godot 3.x, вам нужно изменить его код для вызова методов :ref:`class_RenderingServer` которые влияют на качество эффектов окружения. Только "базовый" переключатель каждого эффекта окружения и его визуальное отображение остается в ресурсе Окружения.
ta: கோடோட் 3.x இல் சுற்றுச்சூழல் பண்புகளை மாற்றும் கிராபிக்ச் அமைப்புகள் பட்டியல் உங்களிடம் இருந்தால், நீங்கள் அழைக்க அதன் குறியீட்டை மாற்ற வேண்டும்: குறிப்பு: `class_renderingserver` சுற்றுச்சூழல் விளைவுகளை பாதிக்கும் முறைகள் 'தரத்தை. ஒவ்வொரு சுற்றுச்சூழல் விளைவின் "அடிப்படை" மாற்று மற்றும் அதன் காட்சி கைப்பிடிகள் மட்டுமே சுற்றுச்சூழல் வளத்திற்குள் இருக்கும்.
uk: Якщо у вас є меню налаштувань графіки, яке змінило властивості середовища в Godot 3.x, вам доведеться змінити його код для виклику методів :ref:`class_RenderingServer`, які впливають на якість ефектів середовища. Лише «базовий» перемикач кожного ефекту середовища та його візуальні ручки залишаються в межах ресурсу середовища.

source: Updating shaders
ga: Shaders á nuashonrú
ru: Обновление шейдеров
ta: சேடர்களை புதுப்பித்தல்
uk: Оновлення шейдерів

source: The ``.shader`` file extension is no longer supported, which means you must rename ``.shader`` files to ``.gdshader`` and update references accordingly in scene/resource files using an external text editor.
ga: Ní thacaítear leis an síneadh comhaid ''.shader'' a thuilleadh, rud a chiallaíonn go gcaithfidh tú comhaid ''.shader'' a athainmniú go ''.gdshader'' agus tagairtí a nuashonrú dá réir sin i gcomhaid radhairc/acmhainne ag baint úsáide as eagarthóir téacs seachtrach.
pt_br: A extensão de arquivo ``.shader`` não é mais suportada, o que significa que você deve renomear os arquivos ``.shader`` para ``.gdshader`` e atualizar as referências adequadamente nos arquivos de cena/recurso usando um editor de texto externo.
ru: Расширение файла ``.shader`` больше не поддерживается, что означает что вы должны переименовать файлы ``.shader`` в ``.gdshader`` и обновить соответствующие ссылки в файлах сцены/ресурсов использую внешний текстовый редактор.
ta: `` .சேடர்`` கோப்பு நீட்டிப்பு இனி ஆதரிக்கப்படாது, அதாவது நீங்கள் `` .சேடர்` `கோப்புகளை` `.gdshader`` க்கு மறுபெயரிட வேண்டும் மற்றும் வெளிப்புற உரை திருத்தியைப் பயன்படுத்தி காட்சி/வள கோப்புகளில் குறிப்புகளைப் புதுப்பிக்க வேண்டும்.
uk: Розширення файлу ``.shader`` більше не підтримується, що означає, що ви повинні перейменувати файли ``.shader`` на ``.gdshader`` і відповідно оновити посилання у файлах сцен/ресурсів за допомогою зовнішнього текстового редактора.

source: Texture filter and repeat modes are now set on individual uniforms, rather than the texture files themselves.
ga: Socraítear modhanna scagaire uigeachta agus athdhéanta anois ar éide aonair, seachas ar na comhaid uigeachta féin.
pt_br: Os modos de filtragem e repetição de textura agora são definidos individualmente por uniforme, em vez de nos próprios arquivos de textura.
ru: Фильтр текстур и режимы повтора теперь должны устанавливаться на индивидуальных uniforms, а не на файлах текстур.
ta: அமைப்பு வடிகட்டி மற்றும் மீண்டும் முறைகள் இப்போது அமைப்பு கோப்புகளை விட தனிப்பட்ட சீருடைகளில் அமைக்கப்பட்டுள்ளன.
uk: Фільтр текстур і режими повторення тепер встановлюються для окремих форм, а не для самих файлів текстур.

source: ``hint_albedo`` is now ``source_color``.
ga: Is é ''hint_albedo'' anois ''source_color''.
pt_br: ``hint_albedo`` agora é ``source_color``.
ru: ``hint_albedo`` теперь ``source_color``.
ta: `` hint_albedo`` இப்போது `` source_color``.
uk: ``hint_albedo`` тепер ``source_color``.

source: ``hint_color`` is now ``source_color``.
ga: Is é ''hint_color'' anois ''source_color''.
pt_br: ``hint_color`` agora é ``source_color``.
ru: ``hint_color``теперь``source_color``.
ta: `` HINT_COLOR`` இப்போது `` source_color``.
uk: ``hint_color`` тепер ``source_color``.

source: :ref:`Built in matrix variables were renamed. <doc_spatial_shader>`
ga: :ref:`Athainmníodh athróga maitrís san áireamh. <doc_spatial_shader>`
ta: : ref: `மேட்ரிக்ச் மாறிகள் என கட்டமைக்கப்பட்டவை மறுபெயரிடப்பட்டன. <doc_spatial_shader> `
uk: :ref:`Вбудовані змінні матриці перейменовано. <doc_spatial_shader>`

source: Particles shaders no longer use the ``vertex()`` processor function. Instead they use ``start()`` and ``process()``.
ga: Ní úsáideann shaders cáithníní feidhm an phróiseálaí ''vertex()'' a thuilleadh. Ina áit sin úsáideann siad ''start()'' agus ''process()''.
pt_br: Os shaders de partículas não usam mais a função de processador ``vertex()``. Em vez disso, eles usam ``start()`` e ``process()``.
ru: Шейдеры частиц больше не используют функцию ``vertex()``. Вместо этого они используют ``start()`` и ``process()``.
ta: துகள்கள் சேடர்கள் இனி `` வெர்டெக்ச் () `` செயலி செயல்பாட்டைப் பயன்படுத்தாது. அதற்கு பதிலாக அவர்கள் `` தொடக்க () `` மற்றும் `` செயல்முறை () `` ஐப் பயன்படுத்துகிறார்கள்.
uk: Шейдери частинок більше не використовують функцію процесора ``vertex()``. Замість цього вони використовують ``start()`` і ``process()``.

source: See :ref:`doc_shading_language` for more information.
ga: Féach :ref:'doc_shading_language' le haghaidh tuilleadh eolais.
ru: См. :ref:`doc_shading_language` для получения более подробной информации.
ta: காண்க: குறிப்பு: மேலும் தகவலுக்கு `doc_shading_language`.
uk: Перегляньте :ref:`doc_shading_language` для отримання додаткової інформації.

source: Updating scripts to take backwards-incompatible changes into account
ga: Scripteanna a nuashonrú chun athruithe nach bhfuil ag teacht ar gcúl a chur san áireamh
pt_br: Atualizando scripts para considerar alterações incompatíveis com versões anteriores
ru: Обновление скриптов с учетом изменений, несовместимых с предыдущими версиями
ta: கணக்கில் பின்னோக்கி-இணக்கமான மாற்றங்களை எடுக்க ச்கிரிப்ட்களைப் புதுப்பித்தல்
uk: Оновлення сценаріїв для врахування зворотно-несумісних змін

source: Some changes performed between Godot 3.x and 4 are not renames, but they still break backwards compatibility due to different default behavior.
ga: Ní athainmnítear roinnt athruithe a dhéantar idir Godot 3.x agus 4, ach briseann siad comhoiriúnacht ar gcúl fós mar gheall ar iompar réamhshocraithe difriúil.
pt_br: Algumas alterações realizadas entre o Godot 3.x e 4 não são renomeações, mas ainda quebram a compatibilidade com versões anteriores devido ao comportamento padrão diferente.
ru: Некоторые изменения выполненные между версиями Godot 3.x и 4 не являются переименованиями, но по прежнему могут рушить обратную совместимость из-за разного поведения по умолчанию.
ta: கோடோட் 3.x மற்றும் 4 க்கு இடையில் நிகழ்த்தப்பட்ட சில மாற்றங்கள் மறுபெயரிடப்படவில்லை, ஆனால் அவை வேறுபட்ட இயல்புநிலை நடத்தை காரணமாக பின்னோக்கி பொருந்தக்கூடிய தன்மையை உடைக்கின்றன.
uk: Деякі зміни, виконані між Godot 3.x і 4, не є перейменуванням, але вони все одно порушують зворотну сумісність через різну поведінку за умовчанням.

source: The most notable examples of this are:
ga: Is iad na samplaí is suntasaí de seo ná:
pt_br: Os exemplos mais notáveis disto são:
ru: Самые важные примеры этого:
ta: இதற்கு மிகவும் குறிப்பிடத்தக்க எடுத்துக்காட்டுகள்:
uk: Найпомітніші приклади цього:

source: Lifecycle functions such as ``_ready()`` and ``_process()`` no longer implicitly call parent classes' functions that have the same name. Instead, you must use ``super()`` at the top of a lifecycle function in the child class so that the parent class function is called first.
ga: Ní thugann feidhmeanna saolré ar nós ''_ready()'' agus ''_process()'' feidhmeanna do thuismitheoirí a bhfuil an t-ainm céanna orthu a thuilleadh. Ina áit sin, ní mór duit ''super()'' a úsáid ag barr feidhm saolré sa rang leanaí ionas go dtugtar feidhm rang an tuismitheora ar dtús.
pt_br: Funções de ciclo de vida como ``_ready()`` e ``_process()`` não chamam mais implicitamente funções de classes pai com o mesmo nome. Em vez disso, você deve usar ``super()`` no topo de uma função de ciclo de vida na classe filha para que a função da classe pai seja chamada primeiro.
ru: Функции жизненного цикла такие как ``_ready()`` и ``_process()`` больше не вызывают неявно функции родительских классов которые имеют то же имя. Вместо этого, вы должны использовать ``super()`` в начале вашей функции жизненного цикла в классе потомка так, чтобы родительская функция вызывалась первой.
ta: `` _ ஆயத்தம் () `` `மற்றும்` _ _ நடைமுறைகள் () `` அதே பெயரைக் கொண்ட பெற்றோர் வகுப்புகளின் செயல்பாடுகளை மறைமுகமாக அழைக்க வேண்டாம். அதற்கு பதிலாக, நீங்கள் குழந்தை வகுப்பில் ஒரு வாழ்க்கைச் சுழற்சி செயல்பாட்டின் உச்சியில் `` சூப்பர் () `` பயன்படுத்த வேண்டும், இதனால் பெற்றோர் வகுப்பு செயல்பாடு முதலில் அழைக்கப்படுகிறது.
uk: Такі функції життєвого циклу, як ``_ready()`` і ``_process()`` більше не викликають неявно функції батьківських класів, які мають однакові назви. Замість цього ви повинні використовувати ``super()`` у верхній частині функції життєвого циклу в дочірньому класі, щоб функція батьківського класу викликалася першою.
