Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.3.po
Languages: es, fr, it, pt_br, ru, ta, uk, zh_cn, zh_hant

source: In C#, the enum ``PhysicsServer3D.G6DofJointAxisFlag`` breaks compatibility because of the way the bindings generator detects the enum prefix. New members were added in `GH-89851`_ to the enum that caused the enum members to be renamed.
es: En C#, la enumeración ``PhysicsServer3D.G6DofJointAxisFlag`` rompe la compatibilidad debido a la forma en que el generador de enlaces detecta el prefijo de enumeración. Se añadieron nuevos miembros en `GH-89851`_ a la enumeración, lo que provocó que se cambiara el nombre de los miembros de la enumeración.
fr: Dans C#, l'énumération ``PhysicsServer3D.G6DofJointAxisFlag`` casse la compatibilité en raison de la façon dont le générateur de liaisons détecte le préfixe enum. De nouveaux membres ont été ajoutés dans `GH-89851`_ à l’énumération, ce qui a forcé les membres de l'énumération à être renommés.
it: In C#, l'enumerazione ``PhysicsServer3D.G6DofJointAxisFlag`` interrompe la compatibilità a causa del modo in cui il generatore di binding rileva il prefisso dell'enum. In `GH-89851`_ sono stati aggiunti nuovi membri all'enumerazione, causandone la ridenominazione.
pt_br: Em C#, a enumeração ``PhysicsServer3D.G6DofJointAxisFlag`` quebra a compatibilidade devido à forma como o gerador de vinculações detecta o prefixo da enumeração. Novos membros foram adicionados em `GH-89851`_ à enumeração, o que fez com que os membros da enumeração fossem renomeados.
ru: В C# перечисление ``PhysicsServer3D.G6DofJointAxisFlag`` нарушает совместимость из-за способа, которым генератор привязок обнаруживает префикс перечисления. В `GH-89851`_ в перечисление были добавлены новые члены, что привело к переименованию членов перечисления.
ta: சி#இல், எனம் `` இயற்பியல். புதிய உறுப்பினர்கள் `GH-89851`_ இல் ENUM இல் சேர்க்கப்பட்டனர், இது ENUM உறுப்பினர்கள் மறுபெயரிடப்பட்டது.
uk: У C# перелік ``PhysicsServer3D.G6DofJointAxisFlag`` порушує сумісність через те, як генератор прив’язок визначає префікс переліку. Нові члени були додані в `GH-89851`_ до переліку, що призвело до перейменування членів переліку.
zh_cn: 在 C# 中，枚举 ``PhysicsServer3D.G6DofJointAxisFlag`` 由于绑定生成器检测枚举前缀的方式而破坏了兼容性。在 `GH-89851`_ 中向该枚举添加了新成员，导致枚举成员被重命名。
zh_hant: 在 C# 中，列舉 ``PhysicsServer3D.G6DofJointAxisFlag`` 因綁定產生器解析列舉前綴方式而導致相容性問題。在 `GH-89851`_ 中新增的成員會讓該列舉的成員名稱被重新命名。

source: Rendering
es: Renderizado
fr: Rendu
it: Renderer
pt_br: Renderização
ru: Отрисовка
ta: வழங்குதல்
uk: Рендеринг
zh_cn: 渲染
zh_hant: 算繪

source: **RenderingDevice**
ta: ** வழங்குதல் டெவிச் **
zh_hant: 算繪

source: Enum field ``FinalAction.FINAL_ACTION_CONTINUE`` changes value from ``2`` to ``0``
fr: Le champ d'énumération ``FinalAction.FINAL_ACTION_CONTINUE`` change de valeur de ``2`` à ``0``
it: Il campo di enumerazione ``FinalAction.FINAL_ACTION_CONTINUE`` cambia il suo valore da ``2`` a ``0``
pt_br: O campo Enum ``FinalAction.FINAL_ACTION_CONTINUE`` altera o valor de ``2`` para ``0``
ru: Поле перечисления ``FinalAction.FINAL_ACTION_CONTINUE`` изменяет значение с ``2`` на ``0``
ta: Enum புலம் `` finalaction.final_action_continue`` `` 2`` முதல் `0`` வரை மதிப்பை மாற்றுகிறது
uk: Поле Enum ``FinalAction.FINAL_ACTION_CONTINUE`` змінює значення з ``2`` на ``0``
zh_cn: 枚举字段 ``FinalAction.FINAL_ACTION_CONTINUE`` 将值从 ``2`` 更改为 ``0``
zh_hant: 列舉欄位 ``FinalAction.FINAL_ACTION_CONTINUE`` 的值由 ``2`` 改為 ``0``

source: Enum field ``InitialAction.INITIAL_ACTION_CLEAR`` changes value from ``0`` to ``1``
fr: Le champ d'énumération ``InitialAction.INITIAL_ACTION_CLEAR`` change de valeur de ``0`` à ``1``
it: Il campo di enumerazione ``InitialAction.INITIAL_ACTION_CLEAR`` cambia il suo valore da ``0`` a ``1``
pt_br: O campo Enum ``InitialAction.INITIAL_ACTION_CLEAR`` altera o valor de ``0`` para ``1``
ru: Поле перечисления ``InitialAction.INITIAL_ACTION_CLEAR`` изменяет значение с ``0`` на ``1``
ta: Enum புலம் `` initialaction.initial_action_clear`` `` 0`` முதல் `1`` வரை மதிப்பை மாற்றுகிறது
uk: Поле Enum ``InitialAction.INITIAL_ACTION_CLEAR`` змінює значення з ``0`` на ``1``
zh_cn: 枚举字段 ``InitialAction.INITIAL_ACTION_CLEAR`` 将值从 ``0`` 更改为 ``1``
zh_hant: 列舉欄位 ``InitialAction.INITIAL_ACTION_CLEAR`` 的值由 ``0`` 改為 ``1``

source: Enum field ``InitialAction.INITIAL_ACTION_CLEAR_REGION_CONTINUE`` changes value from ``2`` to ``1``
fr: Le champ d'énumération ``InitialAction.INITIAL_ACTION_CLEAR_REGION_CONTINUE`` change de valeur de ``2`` à ``1``
it: Il campo di enumerazione ``InitialAction.INITIAL_ACTION_CLEAR_REGION_CONTINUE`` cambia il suo valore da ``2`` a ``1``
pt_br: O campo Enum ``InitialAction.INITIAL_ACTION_CLEAR_REGION_CONTINUE`` altera o valor de ``2`` para ``1``
ru: Поле перечисления ``InitialAction.INITIAL_ACTION_CLEAR_REGION_CONTINUE`` изменяет значение с ``2`` на ``1``
ta: Enum புலம் `` initialacation.initial_action_clear_region_continue`` `` 2`` இலிருந்து `1`` வரை மதிப்பை மாற்றுகிறது
uk: Поле Enum ``InitialAction.INITIAL_ACTION_CLEAR_REGION_CONTINUE`` змінює значення з ``2`` на ``1``
zh_cn: 枚举字段 ``InitialAction.INITIAL_ACTION_CLEAR_REGION_CONTINUE`` 将值从 ``2`` 更改为 ``1``
zh_hant: 列舉欄位 ``InitialAction.INITIAL_ACTION_CLEAR_REGION_CONTINUE`` 的值由 ``2`` 改為 ``1``

source: Enum field ``InitialAction.INITIAL_ACTION_CONTINUE`` changes value from ``5`` to ``0``
fr: Le champ d'énumération ``InitialAction.INITIAL_ACTION_CONTINUE`` change de valeur de ``5`` à ``0``
it: Il campo di enumerazione ``InitialAction.INITIAL_ACTION_CONTINUE`` cambia il suo valore da ``5`` a ``0``
pt_br: O campo Enum ``InitialAction.INITIAL_ACTION_CONTINUE`` altera o valor de ``5`` para ``0``
ru: Поле перечисления ``InitialAction.INITIAL_ACTION_CONTINUE`` изменяет значение с ``5`` на ``0``
ta: Enum புலம் `` initialaction.initial_action_continue`` `` 5`` முதல் `0`` வரை மதிப்பை மாற்றுகிறது
uk: Поле Enum ``InitialAction.INITIAL_ACTION_CONTINUE`` змінює значення з ``5`` на ``0``
zh_cn: 枚举字段 ``InitialAction.INITIAL_ACTION_CONTINUE`` 将值从 ``5`` 更改为 ``0``
zh_hant: 列舉欄位 ``InitialAction.INITIAL_ACTION_CONTINUE`` 的值由 ``5`` 改為 ``0``

source: Enum field ``InitialAction.INITIAL_ACTION_DROP`` changes value from ``4`` to ``2``
fr: Le champ d'énumération ``InitialAction.INITIAL_ACTION_DROP`` change de valeur de ``4`` à ``2``
it: Il campo di enumerazione ``InitialAction.INITIAL_ACTION_DROP`` cambia il suo valore da ``4`` a ``2``
pt_br: O campo Enum ``InitialAction.INITIAL_ACTION_DROP`` altera o valor de ``4`` para ``2``
ru: Поле перечисления ``InitialAction.INITIAL_ACTION_DROP`` изменяет значение с ``4`` на ``2``
ta: Enum புலம் `` initialaction.initial_action_drop`` `` 4`` முதல் `2`` வரை மதிப்பை மாற்றுகிறது
uk: Поле Enum ``InitialAction.INITIAL_ACTION_DROP`` змінює значення з ``4`` на ``2``
zh_cn: 枚举字段 ``InitialAction.INITIAL_ACTION_DROP`` 将值从 ``4`` 更改为 ``2``
zh_hant: 列舉欄位 ``InitialAction.INITIAL_ACTION_DROP`` 的值由 ``4`` 改為 ``2``

source: Enum field ``InitialAction.INITIAL_ACTION_KEEP`` changes value from ``3`` to ``0``
fr: Le champ d'énumération ``InitialAction.INITIAL_ACTION_KEEP`` change de valeur de ``3`` à ``0``
it: Il campo di enumerazione ``InitialAction.INITIAL_ACTION_KEEP`` cambia il suo valore da ``3`` a ``0``
pt_br: O campo Enum ``InitialAction.INITIAL_ACTION_KEEP`` altera o valor de ``3`` para ``0``
ru: Поле перечисления ``InitialAction.INITIAL_ACTION_KEEP`` изменяет значение с ``3`` на ``0``
ta: Enum புலம் `` initialaction.initial_action_keep`` `` 3`` முதல் `0`` வரை மதிப்பை மாற்றுகிறது
uk: Поле Enum ``InitialAction.INITIAL_ACTION_KEEP`` змінює значення з ``3`` на ``0``
zh_cn: 枚举字段 ``InitialAction.INITIAL_ACTION_KEEP`` 将值从 ``3`` 更改为 ``0``
zh_hant: 列舉欄位 ``InitialAction.INITIAL_ACTION_KEEP`` 的值由 ``3`` 改為 ``0``

source: Method ``buffer_clear`` removes ``post_barrier`` parameter
es: El método ``buffer_clear`` elimina el parámetro ``post_barrier``
fr: La méthode ``buffer_clear`` supprime le paramètre ``post_barrier``
it: Il metodo ``buffer_clear`` rimuove il parametro ``post_barrier``
ru: Method ``buffer_clear`` удаляет параметр ``post_barrier``
ta: முறை `` இடையக_க்லியர்`` `` Post_Barrier`` அளவுருவை நீக்குகிறது
uk: Метод ``buffer_clear`` видаляє параметр ``post_barrier``
zh_cn: ``buffer_clear`` 方法移除了 ``post_barrier`` 参数
zh_hant: 方法 ``buffer_clear`` 移除了 ``post_barrier`` 參數

source: Method ``buffer_update`` removes ``post_barrier`` parameter
es: El método ``buffer_update`` elimina el parámetro ``post_barrier``
fr: La méthode ``buffer_update`` supprime le paramètre ``post_barrier``
it: Il metodo ``buffer_update`` rimuove il parametro ``post_barrier``
ru: Method ``buffer_update`` удаляет параметр ``post_barrier``
ta: முறை `` இடையக_அப்டேட்`` `` post_barrier`` அளவுருவை நீக்குகிறது
uk: Метод ``buffer_update`` видаляє параметр ``post_barrier``
zh_cn: ``buffer_update`` 方法移除了 ``post_barrier`` 参数
zh_hant: 方法 ``buffer_update`` 移除了 ``post_barrier`` 參數

source: Method ``compute_list_begin`` removes ``allow_draw_overlap`` parameter
es: El método ``compute_list_begin`` elimina el parámetro ``allow_draw_overlap``
fr: La méthode ``compute_list_begin`` supprime son paramètre ``allow_draw_overlap``
it: Il metodo ``compute_list_begin`` rimuove il parametro ``allow_draw_overlap``
pt_br: Removido parâmetro ``allow_draw_overlap`` do método ``compute_list_begin``
ru: Метод ``compute_list_begin`` удаляет параметр ``allow_draw_overlap``
ta: முறை `` compute_list_begin``` `` Allow_draw_overlap`` அளவுருவை நீக்குகிறது
uk: Метод ``compute_list_begin`` видаляє параметр ``allow_draw_overlap``
zh_cn: ``compute_list_begin`` 方法移除了 ``allow_draw_overlap`` 参数
zh_hant: 方法 ``compute_list_begin`` 移除了 ``allow_draw_overlap`` 參數

source: Method ``compute_list_end`` removes ``post_barrier`` parameter
es: El método ``compute_list_end`` elimina el parámetro ``post_barrier``
fr: La méthode ``compute_list_end`` supprime le paramètre ``post_barrier``
it: Il metodo ``compute_list_end`` rimuove il parametro ``post_barrier``
pt_br: Removido parâmetro ``post_barrier`` do método ``compute_list_end``
ru: Method ``compute_list_end`` удаляет параметр ``post_barrier``
ta: முறை `` compute_list_end`` `` post_barrier`` அளவுருவை நீக்குகிறது
uk: Метод ``compute_list_end`` видаляє параметр ``post_barrier``
zh_cn: ``compute_list_end`` 方法移除了 ``post_barrier`` 参数
zh_hant: 方法 ``compute_list_end`` 移除了 ``post_barrier`` 參數

source: Method ``draw_list_begin`` removes ``storage_textures`` parameter
es: El método ``draw_list_begin`` elimina el parámetro ``storage_textures``
fr: La méthode ``draw_list_begin`` supprime le paramètre ``storage_textures``
it: Il metodo ``draw_list_begin`` rimuove il parametro ``storage_textures``
pt_br: Removido parâmetro ``storage_textures`` do método ``draw_list_begin``
ru: Метод ``draw_list_begin`` удаляет параметр ``storage_textures``
ta: முறை `` draw_list_begin``` `` சேமிப்பக_டெக்ச்டர்கள்` அளவுருவை நீக்குகிறது
uk: Метод ``draw_list_begin`` видаляє параметр ``storage_textures``
zh_cn: ``draw_list_begin`` 方法移除了 ``storage_textures`` 参数
zh_hant: 方法 ``draw_list_begin`` 移除了 ``storage_textures`` 參數

source: Method ``draw_list_end`` removes ``post_barrier`` parameter
es: El método ``draw_list_end`` elimina el parámetro ``post_barrier``
fr: La méthode ``draw_list_end`` supprime le paramètre ``post_barrier``
it: Il metodo ``draw_list_end`` rimuove il parametro ``post_barrier``
pt_br: Removido parâmetro ``post_barrier`` do método ``draw_list_end``
ru: Method ``draw_list_end`` удаляет параметр ``post_barrier``
ta: முறை `` draw_list_end`` `` post_barrier`` அளவுருவை நீக்குகிறது
uk: Метод ``draw_list_end`` видаляє параметр ``post_barrier``
zh_cn: ``draw_list_end`` 方法移除了 ``post_barrier`` 参数
zh_hant: 方法 ``draw_list_end`` 移除了 ``post_barrier`` 參數

source: Method ``texture_clear`` removes ``post_barrier`` parameter
es: El método ``texture_clear`` elimina el parámetro ``post_barrier``
fr: La méthode ``texture_clear`` supprime le paramètre ``post_barrier``
it: Il metodo ``texture_clear`` rimuove il parametro ``post_barrier``
ru: Method ``texture_clear`` удаляет параметр ``post_barrier``
ta: முறை `` stecture_clear`` `` post_barrier`` அளவுருவை நீக்குகிறது
uk: Метод ``texture_clear`` видаляє параметр ``post_barrier``
zh_cn: ``texture_clear`` 方法移除了 ``post_barrier`` 参数
zh_hant: 方法 ``texture_clear`` 移除了 ``post_barrier`` 參數

source: Method ``texture_copy`` removes ``post_barrier`` parameter
es: El método ``texture_copy`` elimina el parámetro ``post_barrier``
fr: La méthode ``texture_copy`` supprime son paramètre ``post_barrier``
it: Il metodo ``texture_copy`` rimuove il parametro ``post_barrier``
pt_br: Removido parâmetro ``post_barrier`` do método ``texture_copy``
ru: Метод ``texture_copy`` удаляет параметр ``post_barrier``
ta: முறை `` stecture_copy`` `` post_barrier`` அளவுருவை நீக்குகிறது
uk: Метод ``texture_copy`` видаляє параметр ``post_barrier``
zh_cn: ``texture_copy`` 方法移除了 ``post_barrier`` 参数
zh_hant: 方法 ``texture_copy`` 移除了 ``post_barrier`` 參數

source: Method ``texture_resolve_multisample`` removes ``post_barrier`` parameter
es: El método ``texture_resolve_multisample`` elimina el parámetro ``post_barrier``
fr: La méthode ``texture_resolve_multisample`` supprime son paramètre ``post_barrier``
it: Il metodo ``texture_resolve_multisample`` rimuove il parametro ``post_barrier``
pt_br: Removido parâmetro ``post_barrier`` do método ``texture_resolve_multisample``
ru: Метод ``texture_resolve_multisample`` удаляет параметр ``post_barrier``
ta: முறை `` stecture_resolve_multisample`` `` post_barrier`` அளவுருவை நீக்குகிறது
uk: Метод ``texture_resolve_multisample`` видаляє параметр ``post_barrier``
zh_cn: ``texture_resolve_multisample`` 方法移除了 ``post_barrier`` 参数
zh_hant: 方法 ``texture_resolve_multisample`` 移除了 ``post_barrier`` 參數

source: Method ``texture_update`` removes ``post_barrier`` parameter
es: El método ``texture_update`` elimina el parámetro ``post_barrier``
fr: La méthode ``texture_update`` supprime le paramètre ``post_barrier``
it: Il metodo ``texture_update`` rimuove il parametro ``post_barrier``
pt_br: Removido parâmetro ``post_barrier`` do método ``texture_update``
ru: Method ``texture_update`` удаляет параметр ``post_barrier``
ta: முறை `` stecture_update`` `` post_barrier`` அளவுருவை நீக்குகிறது
uk: Метод ``texture_update`` видаляє параметр ``post_barrier``
zh_cn: ``texture_update`` 方法移除了 ``post_barrier`` 参数
zh_hant: 方法 ``texture_update`` 移除了 ``post_barrier`` 參數

source: **RenderingServer**
ta: ** வழங்குதல் சேவையகம் **

source: Method ``environment_set_fog`` adds a new ``fog_mode`` optional parameter
es: El método ``environment_set_fog`` agrega un nuevo parámetro opcional ``fog_mode``
fr: La méthode ``environment_set_fog`` ajoute un nouveau paramètre optionnel ``fog_mode``
it: Il metodo ``environment_set_fog`` aggiunge un nuovo parametro facoltativo ``fog_mode``
ru: Method ``environment_set_fog`` добавляет новый дополнительный параметр ``fog_mode``
ta: முறை `` சுற்றுச்சூழல்_செட்_ஃபோக்`` புதிய `` FOG_MODE`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``environment_set_fog`` додає новий необов'язковий параметр ``fog_mode``
zh_cn: ``environment_set_fog`` 方法增加了一个新的 ``fog_mode`` 可选参数
zh_hant: 方法 ``environment_set_fog`` 新增了 ``fog_mode`` 選用參數

source: **RenderSceneBuffersRD**
ru: **RenderSceneBuffersRD (Рендеринг буфера сцены RD)**
ta: ** ரெண்டர்ச் செனபஃபர்ச்ஆர்டி **

source: Method ``get_color_layer`` adds a new ``msaa`` optional parameter
fr: La méthode ``get_color_layer`` ajoute un nouveau paramètre optionnel ``msaa``
it: Il metodo ``get_depth_layer`` aggiunge un nuovo parametro facoltativo ``msaa``
ru: Method ``get_color_layer`` добавляет новый дополнительный параметр ``msaa``
ta: முறை `` get_color_layer`` புதிய `` MSAA`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``get_color_layer`` додає новий необов'язковий параметр ``msaa``
zh_cn: ``get_color_layer`` 方法添加了一个新的 ``msaa`` 可选参数
zh_hant: 方法 ``get_color_layer`` 新增了 ``msaa`` 選用參數

source: Method ``get_depth_layer`` adds a new ``msaa`` optional parameter
fr: La méthode ``get_depth_layer`` ajoute un nouveau paramètre optionnel ``msaa``
it: Il metodo ``get_depth_layer`` aggiunge un nuovo parametro facoltativo ``msaa``
ru: Method ``get_depth_layer`` добавляет новый дополнительный параметр ``msaa``
ta: முறை `` get_depth_layer`` புதிய `` MSAA`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``get_depth_layer`` додає новий необов'язковий параметр ``msaa``
zh_cn: ``get_depth_layer`` 方法增加了一个新的 ``msaa`` 可选参数
zh_hant: 方法 ``get_depth_layer`` 新增了 ``msaa`` 選用參數

source: Method ``get_velocity_layer`` adds a new ``msaa`` optional parameter
fr: La méthode ``get_velocity_layer`` ajoute un nouveau paramètre optionnel ``msaa``
it: Il metodo ``get_velocity_layer`` aggiunge un nuovo parametro facoltativo ``msaa``
ru: Method ``get_velocity_layer`` добавляет новый дополнительный параметр ``msaa``
ta: முறை `` get_velocity_layer`` புதிய `` MSAA`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``get_velocity_layer`` додає новий необов'язковий параметр ``msaa``
zh_cn: ``get_velocity_layer`` 方法增加了一个新的 ``msaa`` 可选参数
zh_hant: 方法 ``get_velocity_layer`` 新增了 ``msaa`` 選用參數

source: Method ``get_color_texture`` adds a new ``msaa`` optional parameter
fr: La méthode ``get_color_texture`` ajoute un nouveau paramètre optionnel ``msaa``
it: Il metodo ``get_color_texture`` aggiunge un nuovo parametro facoltativo ``msaa``
ru: Method ``get_color_texture`` добавляет новый дополнительный параметр ``msaa``
ta: முறை `` get_color_texture`` புதிய `` MSAA`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``get_color_texture`` додає новий необов'язковий параметр ``msaa``
zh_cn: ``get_color_texture`` 方法添加了一个新的 ``msaa`` 可选参数
zh_hant: 方法 ``get_color_texture`` 新增了 ``msaa`` 選用參數

source: Method ``get_depth_texture`` adds a new ``msaa`` optional parameter
fr: La méthode ``get_depth_texture`` ajoute un nouveau paramètre optionnel ``msaa``
it: Il metodo ``get_depth_texture`` aggiunge un nuovo parametro facoltativo ``msaa``
ru: Method ``get_depth_texture`` добавляет новый дополнительный параметр ``msaa``
ta: முறை `` get_depth_texture`` புதிய `` MSAA`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``get_depth_texture`` додає новий необов'язковий параметр ``msaa``
zh_cn: ``get_depth_texture`` 方法增加了一个新的 ``msaa`` 可选参数
zh_hant: 方法 ``get_depth_texture`` 新增了 ``msaa`` 選用參數

source: Method ``get_velocity_texture`` adds a new ``msaa`` optional parameter
fr: La méthode ``get_velocity_texture`` ajoute un nouveau paramètre optionnel ``msaa``
it: Il metodo ``get_velocity_texture`` aggiunge un nuovo parametro facoltativo ``msaa``
ru: Method ``get_velocity_texture`` добавляет новый дополнительный параметр ``msaa``
ta: முறை `` get_velocity_texture`` புதிய `` MSAA`` விருப்ப அளவுருவைச் சேர்க்கிறது
uk: Метод ``get_velocity_texture`` додає новий необов'язковий параметр ``msaa``
zh_cn: ``get_velocity_texture`` 方法增加了一个新的 ``msaa`` 可选参数
zh_hant: 方法 ``get_velocity_texture`` 新增了 ``msaa`` 選用參數

source: While the values of the enum fields in ``RenderingDevice.InitialAction`` and ``RenderingDevice.FinalAction`` changed, the only method that consumed them (``draw_list_begin``) added a compatibility method which supports the old values. So in practice it doesn't break compatibility.
es: Aunque los valores de los campos de enumeración en ``RenderingDevice.InitialAction`` y ``RenderingDevice.FinalAction`` cambiaron, el único método que los consumía (``draw_list_begin``) agregó un método de compatibilidad que admite los valores antiguos. Por lo tanto, en la práctica, no afecta la compatibilidad.
fr: Bien que les valeurs des champs d'énumération dans ``RenderingDevice. InitialAction`` et ``RenderingDevice.FinalAction`` ont changé, la seule méthode qui les consommait (``draw_list_begin``) a ajouté une méthode de compatibilité qui supporte les anciennes valeurs. En pratique, cela ne casse pas la compatibilité.
it: Sebbene i valori dei campi delle enumerazioni ``RenderingDevice.InitialAction`` e ``RenderingDevice.FinalAction`` siano cambiati, l'unico metodo che li utilizzava (``draw_list_begin``) ha aggiunto un metodo di compatibilità che supporta i valori vecchi. Quindi, in pratica, la compatibilità non viene interrotta.
pt_br: Embora os valores dos campos enum em ``RenderingDevice.InitialAction`` e ``RenderingDevice.FinalAction`` tenham mudado, o único método que os consumia (``draw_list_begin``) adicionou um método de compatibilidade que suporta os valores antigos. Portanto, na prática, isso não quebra a compatibilidade.
ru: Хотя значения полей enum в ``RenderingDevice.InitialAction`` и ``RenderingDevice.FinalAction`` изменились, единственный метод, который их использовал (``draw_list_begin``), добавил метод совместимости, который поддерживает старые значения. Поэтому на практике это не нарушает совместимость.
ta: `` Renderingdevice.initialaction`` மற்றும் `` renderingdevice.finalaction`` இல் உள்ள ENUM புலங்களின் மதிப்புகள் மாற்றப்பட்டாலும், அவற்றை உட்கொண்ட ஒரே முறை (`` draw_list_begin``) பழைய மதிப்புகளை ஆதரிக்கும் ஒரு பொருந்தக்கூடிய முறையைச் சேர்த்தது. எனவே நடைமுறையில் இது பொருந்தக்கூடிய தன்மையை உடைக்காது.
uk: У той час як значення полів enum у ``RenderingDevice.InitialAction`` і ``RenderingDevice.FinalAction`` змінилися, єдиний метод, який споживав їх (``draw_list_begin``), додав метод сумісності, який підтримує старі значення. Тож на практиці це не порушує сумісності.
zh_cn: 当 ``RenderingDevice.InitialAction`` 和 ``RenderingDevice.FinalAction`` 中枚举字段的值发生变化时，唯一使用它们的方法（ ``draw_list_begin`` ）添加了一个兼容性方法，该方法支持旧值。因此，实际上不会破坏兼容性。
zh_hant: 雖然 ``RenderingDevice.InitialAction`` 及 ``RenderingDevice.FinalAction`` 中的列舉值已改變，但唯一會使用它們的方法（``draw_list_begin``）已新增相容舊值的支援。因此實務上並不會破壞相容性。

source: In C#, the enum ``RenderingDevice.DriverResource`` breaks compatibility because of the way the bindings generator detects the enum prefix. New members were added in `GH-83452`_ to the enum that caused the enum members to be renamed.
fr: Dans C#, l'énumération ``RenderingDevice. DriverResource`` casse la compatibilité en raison de la façon dont le générateur de liaisons détecte le préfixe enum. De nouveaux membres ont été ajoutés dans `GH-83452`_ à l’énumération, ce qui a forcé les membres de l'énumération à être renommés.
it: In C#, l'enumerazione ``RenderingDevice.DriverResource`` interrompe la compatibilità a causa del modo in cui il generatore di binding rileva il prefisso dell'enumerazione. In `GH-83452`_ sono stati aggiunti nuovi membri all'enum, causando la ridenominazione dei membri dell'enum.
pt_br: Em C#, o enum``RenderingDevice.DriverResource`` quebra a compatibilidade devido à forma como o gerador de vinculações detecta o prefixo do enum. Novos membros foram adicionados em `GH-83452`_ ào enum, o que fez com que os membros dele fossem renomeados.
ru: В C# перечисление ``RenderingDevice.DriverResource`` нарушает совместимость из-за способа, которым генератор привязок обнаруживает префикс перечисления. В `GH-83452`_ в перечисление были добавлены новые члены, что привело к переименованию членов перечисления.
ta: சி#இல், எனம் `` renderingdevice.driverresource`` பொருந்தக்கூடிய தன்மையை உடைக்கிறது, ஏனெனில் பைண்டிங்ச் செனரேட்டர் ENUM முன்னொட்டைக் கண்டறியும் விதம். புதிய உறுப்பினர்கள் `GH-83452`_ இல் ENUM க்கு சேர்க்கப்பட்டனர், இது ENUM உறுப்பினர்கள் மறுபெயரிடப்பட்டது.
uk: У C# перелік ``RenderingDevice.DriverResource`` порушує сумісність через те, як генератор прив’язок визначає префікс переліку. Нові члени були додані в `GH-83452`_ до переліку, що призвело до перейменування членів переліку.
zh_cn: 在 C# 中，枚举 ``RenderingDevice.DriverResource`` 由于绑定生成器检测枚举前缀的方式而破坏了兼容性。在 `GH-83452`_ 中向该枚举添加了新成员，导致枚举成员被重命名。
zh_hant: 在 C# 中，列舉 ``RenderingDevice.DriverResource`` 由於綁定產生器解析列舉前綴的方式，當 `GH-83452`_ 新增新成員時會造成成員名稱被重新命名，進而導致相容性問題。

source: Text
fr: Texte
it: Testo
ru: Текст
ta: உரை
uk: текст
zh_cn: 文本
zh_hant: 文字

source: **Font**
es: **Fuente**
pt_br: **Fonte**
ta: ** எழுத்துரு **
uk: **Шрифт**
zh_cn: **字体**
zh_hant: **字型**
