Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.po
Languages: cs, ga, pt_br, ru, ta, uk

source: Godot 3.x and 4.x have entirely different lists of files and folders that should be ignored by your :ref:`version control system<doc_version_control_systems>`.
pt_br: O Godot 3.x e o 4.x possuem listas completamente diferentes de arquivos e pastas que devem ser ignorados pelo seu :ref:`version control system<doc_version_control_systems>`.
ru: Godot 3.x и 4.x имеют совершенно разные списки файлов и папок, которые следует игнорировать :ref:`version control system<doc_version_control_systems>`.
