Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.2.po
Languages: es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hant

source: Signal ``node_deselected`` moved to base class ``GraphElement``
es: Señal ``node_deselected`` movida a la clase base ``GraphElement``
fr: Le signal ``node_deselected`` a été déplacé dans la classe parente ``GraphElement``
ga: Comhartha ''node_deselected'' aistrithe go dtí an bunrang ''GraphElement''
it: Il segnale ``node_deselected`` è stato spostato nella classe base ``GraphElement``
pt_br: Sinal ``node_deselected`` movido para a classe base ``GraphElement``
ru: Сигнал ``node_deselected`` был перемещён в базовый класс ``GraphElement``
ta: சமிக்ஞை `` node_deselected`` அடிப்படை வகுப்பு `` கிராபெலமென்ட்`` க்கு நகர்த்தப்பட்டது
tr: ``node_deselected`` sinyali, ``GraphElement`` temel sınıfına taşındı
uk: Сигнал ``node_deselected`` переміщено до базового класу ``GraphElement``
zh_hant: 訊號 ``node_deselected`` 已移至基底類別 ``GraphElement``

source: Signal ``node_selected`` moved to base class ``GraphElement``
es: Señal ``node_selected`` movida a la clase base ``GraphElement``
fr: Le signal ``node_selected`` a été déplacé dans la classe parente ``GraphElement``
ga: Athraíodh comhartha ''node_selected'' go bunrang ''GraphElement''
it: Il segnale ``node_selected`` è stato spostato nella classe base ``GraphElement``
pt_br: Sinal ``node_selected`` movido para a classe base ``GraphElement``
ru: Сигнал ``node_selected`` был перемещён в базовый класс ``GraphElement``
ta: சமிக்ஞை `` node_selected`` அடிப்படை வகுப்பு `` கிராபெலமென்ட்`` க்கு நகர்த்தப்பட்டது
tr: ``node_selected`` sinyali, ``GraphElement`` temel sınıfına taşındı
uk: Сигнал ``node_selected`` переміщено до базового класу ``GraphElement``
zh_hant: 訊號 ``node_selected`` 已移至基底類別 ``GraphElement``

source: Property ``overlay`` removed
es: Propiedad ``overlay`` removida
fr: Propriété ``overlay`` retirée
ga: Maoin ''forleagan'' bainte
it: Proprietà ``overlay`` rimossa
pt_br: Propriedade ``overlay`` removida
ru: Свойство ``overlay`` удалено
ta: சொத்து `` மேலடுக்கு`` அகற்றப்பட்டது
tr: ``overlay`` özelliği kaldırıldı
uk: Властивість ``overlay`` видалено
zh_hant: 屬性 ``overlay`` 已移除

source: Property ``position_offset`` moved to base class ``GraphElement``
es: Propiedad ``position_offset`` movida a la clase base ``GraphElement``
fr: La propriété ``position_offset`` a été déplacée dans la classe de base ``GraphElement``
ga: Aistríodh maoin ''position_offset'' go bunaicme ''GraphElement''
it: La proprietà ``position_offset`` è stata spostata nella classe base ``GraphElement``
pt_br: Propriedade ``position_offset`` movida para a classe base ``GraphElement``
ru: Свойство ``position_offset`` было перемещено в базовый класс ``GraphElement``
ta: சொத்து `` pasition_offset`` அடிப்படை வகுப்பு `` கிராபெலமென்ட்`` க்கு மாற்றப்பட்டது
tr: ``position_offset`` özelliği, ``GraphElement`` temel sınıfına taşındı
uk: Властивість ``position_offset`` перенесено до базового класу ``GraphElement``
zh_hant: 屬性 ``position_offset`` 已移至基底類別 ``GraphElement``

source: Signal ``position_offset_changed`` moved to base class ``GraphElement``
es: Señal ``position_offset_changed`` movida a la clase base ``GraphElement``
fr: Le signal ``position_offset_changed`` dans la classe parente ``GraphElement``
ga: Comhartha ''position_offset_changed'' aistrithe go dtí an bunrang ''GraphElement''
it: Il segnale ``position_offset_changed`` è stato spostato nella classe base ``GraphElement``
pt_br: Sinal ``position_offset_changed`` movido para a classe base ``GraphElement``
ru: Сигнал ``position_offset_changed`` был перемещён в базовый класс ``GraphElement``
ta: சமிக்ஞை `` pasition_offset_changed`` அடிப்படை வகுப்பு `` கிராபெலமென்ட்`` க்கு நகர்த்தப்பட்டது
tr: ``position_offset_changed`` sinyali, ``GraphElement`` temel sınıfına taşındı
uk: Сигнал ``position_offset_changed`` переміщено до базового класу ``GraphElement``
zh_hant: 訊號 ``position_offset_changed`` 已移至基底類別 ``GraphElement``

source: Signal ``raise_request`` moved to base class ``GraphElement``
es: Señal ``raise_request`` movida a la clase base ``GraphElement``
fr: Le signal ``raise_request`` a été déplacée dans la classe parente ``GraphElement``
ga: Comhartha ''raise_request'' aistrithe go dtí an bunrang ''GraphElement''
it: Il segnale ``raise_request`` è stato spostato nella classe base ``GraphElement``
pt_br: Sinal ``raise_request`` movido para a classe base ``GraphElement``
ru: Сигнал ``raise_request`` был перемещён в базовый класс ``GraphElement``
ta: சமிக்ஞை `` ரைச்_ரெக்வெச்ட்`` அடிப்படை வகுப்பு `` கிராபெலமென்ட்`` க்கு நகர்த்தப்பட்டது
tr: ``raise_request`` sinyali, ``GraphElement`` temel sınıfına taşındı
uk: Сигнал ``raise_request`` перенесено до базового класу ``GraphElement``
zh_hant: 訊號 ``raise_request`` 已移至基底類別 ``GraphElement``

source: Property ``resizable`` moved to base class ``GraphElement``
es: Propiedad ``resizable`` movida a la clase base ``GraphElement``
fr: La propriété ``resizable`` a déplacée dans la classe de base ``GraphElement``
ga: Aistríodh maoin ''resizable'' go bunaicme ''GraphElement''
it: La proprietà ``resizable`` è stata spostata nella classe base ``GraphElement``
pt_br: Propriedade ``resizable`` movida para a classe base ``GraphElement``
ru: Свойство ``resizable`` перемещено в базовый класс ``GraphElement``
ta: சொத்து `` மறுசீரமைக்கக்கூடியது`` அடிப்படை வகுப்பு `` கிராபெலமென்ட்`` க்கு மாற்றப்பட்டது
tr: ``resizable`` özelliği, ``GraphElement`` temel sınıfına taşındı
uk: Властивість ``resizable`` перенесено до базового класу ``GraphElement``
zh_hant: 屬性 ``resizable`` 已移至基底類別 ``GraphElement``

source: Signal ``resize_request`` moved to base class ``GraphElement``
es: Señal ``resize_request`` movida a la clase base ``GraphElement``
fr: Le signal ``resize_request`` a été déplacée dans la classe parente ``GraphElement``
ga: Athraíodh comhartha ''resize_request'' go bunrang ''GraphElement''
it: Il segnale ``resize_requested`` è stato spostato nella classe base ``GraphElement``
pt_br: Sinal ``resize_request`` movido para a classe base ``GraphElement``
ru: Сигнал ``resize_request`` перемещен в базовый класс ``GraphElement``
ta: சமிக்ஞை `` RESIZE_REQUEST`` அடிப்படை வகுப்பு `` கிராபெலமென்ட்`` க்கு நகர்த்தப்பட்டது
tr: ``resize_request`` sinyali, ``GraphElement`` temel sınıfına taşındı
uk: Властивість ``resizable`` перенесено до базового класу ``GraphElement``
zh_hant: 訊號 ``resize_request`` 已移至基底類別 ``GraphElement``

source: Property ``selectable`` moved to base class ``GraphElement``
es: Propiedad ``selectable`` movida a la clase base ``GraphElement``
fr: La propriété ``selectable`` a été déplacée dans la classe parente ``GraphElement``
ga: Aistríodh an mhaoin ''selectable'' go dtí an bhunaicme ''GraphElement''
it: La proprietà ``selectable`` è stata spostata nella classe base ``GraphElement``
pt_br: Propriedade ``selectable`` movida para a classe base ``GraphElement``
ru: Свойство ``selectable`` перемещено в базовый класс ``GraphElement``
ta: சொத்து `` தேர்ந்தெடுக்கப்பட்ட`` அடிப்படை வகுப்பிற்கு `` கிராஃப்ளெமென்ட்`` க்கு மாற்றப்பட்டது
tr: ``selectable`` özelliği, ``GraphElement`` temel sınıfına taşındı
uk: Властивість ``selectable`` перенесено до базового класу ``GraphElement``
zh_hant: 屬性 ``selectable`` 已移至基底類別 ``GraphElement``

source: Property ``selected`` moved to base class ``GraphElement``
es: Propiedad ``selected`` movida a la clase base ``GraphElement``
fr: La propriété ``selected`` a été déplacée dans la classe parente ``GraphElement``
ga: Aistríodh an mhaoin ''roghnaithe'' go dtí an bhunaicme ''GraphElement''
it: La proprietà ``selected`` è stata spostata nella classe base ``GraphElement``
pt_br: Propriedade ``selected`` movida para a classe base ``GraphElement``
ru: Свойство ``selected`` перемещено в базовый класс ``GraphElement``
ta: சொத்து `` தேர்ந்தெடுக்கப்பட்ட`` அடிப்படை வகுப்பு `` கிராபெலமென்ட்`` க்கு மாற்றப்பட்டது
tr: ``selected`` özelliği, ``GraphElement`` temel sınıfına taşındı
uk: Властивість ``selected`` переміщено до базового класу ``GraphElement``
zh_hant: 屬性 ``selected`` 已移至基底類別 ``GraphElement``

source: Property ``show_close`` removed
es: Propiedad ``show_close`` removida
fr: Propriété ``show_close`` retirée
ga: Maoin ''show_close'' bainte
it: Proprietà ``show_close`` rimossa
pt_br: Propriedade ``show_close`` removida
ru: Свойство ``show_close`` удалено
ta: சொத்து `` show_close`` அகற்றப்பட்டது
tr: ``show_close`` özelliği kaldırıldı
uk: Властивість ``show_close`` видалено
zh_hant: 屬性 ``show_close`` 已移除

source: Property ``text_direction`` removed
es: Propiedad ``text_direction`` removida
fr: Propriété``text_direction`` retirée
ga: Maoin ''text_direction'' bainte
it: Proprietà ``text_direciton`` rimossa
pt_br: Propriedade ``text_direction`` removida
ru: Свойство ``text_direction`` удалено
ta: சொத்து `` text_direction`` அகற்றப்பட்டது
tr: ``text_direction`` özelliği kaldırıldı
uk: Властивість ``text_direction`` видалено
zh_hant: 屬性 ``text_direction`` 已移除

source: TileMap
ga: Mapa Tíl
ta: டில்மேப்
uk: Плитка карти
zh_hant: 圖塊地圖（TileMap）

source: **TileMap**
ga: **Mapa Tíl**
ta: ** டில்மேப் **
uk: **Плитка карти**
zh_hant: **圖塊地圖（TileMap）**

source: Property ``cell_quadrant_size`` renamed to ``rendering_quadrant_size``
es: Propiedad ``cell_quadrant_size`` renombrada a ``rendering_quadrant_size``
fr: Propriété ``cell_quadrant_size`` renommée en ``rendering_quadrant_size``
ga: Maoin ''cell_quadrant_size'' a athainmníodh go ''rendering_quadrant_size''
it: La proprietà ``cell_quadrant_size`` è stata rinominata in ``rendering_quadrant_size``
pt_br: Propriedade ``cell_quadrant_size`` renomeada para ``rendering_quadrant_size``
ru: Свойство ``cell_quadrant_size`` переименовано в ``rendering_quadrant_size``
ta: சொத்து `` Cell_quadrant_size``` `` rendering_quadrant_size`` என மறுபெயரிடப்பட்டது
tr: ``cell_quadrant_size`` özelliğinin adı ``rendering_quadrant_size`` olarak değiştirildi
uk: Властивість ``cell_quadrant_size`` перейменовано на ``rendering_quadrant_size``
zh_hant: 屬性 ``cell_quadrant_size`` 已更名為 ``rendering_quadrant_size``

source: XR
ga: XRName
ta: எக்ச்ஆர்
uk: ИКСР

source: **XRInterface**
ga: **XRComhéad**
uk: **XRIінтерфейс**
zh_hant: **XR 介面（XRInterface）**

source: Property ``environment_blend_mode`` added
es: Propiedad ``environment_blend_mode`` agregada
fr: Propriété ``environment_blend_mode`` ajoutée
ga: Maoin ''environment_blend_mode'' curtha leis
it: La proprietà ``environment_blend_mode`` è stata aggiunta
pt_br: Propriedade ``environment_blend_mode`` adicionada
ru: Свойство ``environment_blend_mode`` добавлено
ta: சொத்து `` சுற்றுச்சூழல்_பிலெண்ட்_மோட்`` சேர்க்கப்பட்டது
tr: ``environment_blend_mode`` özelliği eklendi
uk: Додано властивість ``environment_blend_mode``
zh_hant: 新增屬性 ``environment_blend_mode``

source: This change breaks compatibility in C# because the new property conflicts with the name of an existing enum and the C# bindings generator gives priority to properties, so the enum type was renamed from ``EnvironmentBlendMode`` to ``EnvironmentBlendModeEnum``.
es: Estos cambios rompen la compatibilidad en C# porque la nueva propiedad entra en conflicto con el nombre de un enum existente y el generador de enlaces de C# da prioridad a las propiedades, por lo tanto el tipo enum fue renombrada de ``EnvironmentBlendMode`` a ``EnvironmentBlendModeEnum``.
fr: Ce changement casse la compatibilité en C# parce que la nouvelle propriété est en conflit avec le nom d'une énumération existante et le générateur de liaisons C# donne la priorité aux propriétés, donc le type de l'énumération a été renommé de ``EnvironmentBlendMode`` à ``EnvironmentBlendModeEnum``.
ga: Briseann an t-athrú seo comhoiriúnacht i C # toisc go dtagann an mhaoin nua salach ar ainm enum atá ann cheana féin agus tugann gineadóir ceangail C # tosaíocht d'airíonna, mar sin athainmníodh an cineál enum ó ''EnvironmentBlendMode'' go ''EnvironmentBlendModeEnum''.
it: Questo cambiamento interrompe la compatibilità in C# perché la nuova proprietà è in conflitto con il nome di un enumerazione esistente e il generatore di binding C# dà priorità alle proprietà, quindi l'enumerazione è stata rinominata da ``EnvironmentBlendMode`` a ``EnvironmentBlendModeEnum``.
pt_br: Essa alteração quebra a compatibilidade em C# porque a nova propriedade entra em conflito com o nome de uma enumeração existente e o gerador de vinculações C# dá prioridade às propriedades, então o tipo de enumeração foi renomeado de ``EnvironmentBlendMode`` para ``EnvironmentBlendModeEnum``.
ru: Это изменение нарушает совместимость в C#, поскольку новое свойство конфликтует с именем существующего перечисления, а генератор привязок C# отдает приоритет свойствам, поэтому тип перечисления был переименован из ``EnvironmentBlendMode`` в ``EnvironmentBlendModeEnum``.
ta: இந்த மாற்றம் சி# இல் பொருந்தக்கூடிய தன்மையை உடைக்கிறது, ஏனெனில் புதிய சொத்து ஏற்கனவே இருக்கும் எனும் பெயருடன் முரண்படுகிறது மற்றும் சி# பிணைப்பு செனரேட்டர் பண்புகளுக்கு முன்னுரிமை அளிக்கிறது, எனவே எனம் வகை `` சுற்றுச்சூழல் பிளெண்ட்மோட்`` இலிருந்து `` சுற்றுச்சூழல் பிளெண்ட்மோடீனம்`` என மறுபெயரிடப்பட்டது.
tr: Bu değişiklik C#'ta uyumluluğu bozar çünkü yeni özellik mevcut bir numaralandırma adıyla çakışır ve C# bağlama oluşturucusu özelliklere öncelik verir, bu nedenle numaralandırma tipi ``EnvironmentBlendMode`` yerine ``EnvironmentBlendModeEnum`` olarak yeniden adlandırılmıştır.
uk: Ця зміна порушує сумісність у C#, оскільки нова властивість конфліктує з іменем існуючого enum, а генератор прив’язок C# надає пріоритет властивостям, тому тип enum було перейменовано з ``EnvironmentBlendMode`` на ``EnvironmentBlendModeEnum``.
zh_hant: 這項變更會導致 C# 相容性問題，因為新增的屬性名稱與現有列舉型別名稱衝突，而 C# 綁定生成器會優先處理屬性，因此該列舉型別名稱已由 ``EnvironmentBlendMode`` 改為 ``EnvironmentBlendModeEnum``。

source: **Binary compatible** - Existing binaries will load and execute successfully without recompilation, and the runtime behavior won't change.
it: **Compatibile con gli eseguibili** - Gli eseguibili esistenti saranno caricati ed eseguiti correttamente senza necessità di ricompilazione e il comportamento in fase di esecuzione non cambierà.
pt_br: **Compatível com binários** - Os binários existentes serão carregados e executados com sucesso sem recompilação, e o comportamento em tempo de execução não mudará.
ru: **Binary compatible (Совместимость на уровне двоичных файлов)** — существующие двоичные файлы будут успешно загружены и выполнены без перекомпиляции, а поведение среды выполнения не изменится.
ta: ** பைனரி இணக்கமானது ** - இருக்கும் பைனரிகள் மறுசீரமைப்பு இல்லாமல் வெற்றிகரமாக ஏற்றப்பட்டு செயல்படுத்தப்படும், மேலும் இயக்க நேர நடத்தை மாறாது.
uk: **Сумісність із двійковими файлами** – наявні двійкові файли завантажуватимуться та успішно виконуватимуться без повторної компіляції, а поведінка під час виконання не зміниться.
zh_hant: **二進制相容** - 現有的二進制檔案無需重新編譯即可成功載入和執行，且運行時的行為不會改變。

source: **RichTextLabel**
ta: ** ரிச்ச்டெக்ச்ட்லேபிள் **
