Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.po
Languages: cs, ga, pt_br, ru, ta, uk

source: List of automatically renamed methods, properties, signals and constants
ga: Liosta de na modhanna, airíonna, comharthaí agus tairisigh a athainmníodh go huathoibríoch
pt_br: Lista de métodos, propriedades, sinais e constantes renomeados automaticamente
ru: Список автоматически переименованных методов, свойств, сигналов и констант
ta: தானாக மறுபெயரிடப்பட்ட முறைகள், பண்புகள், சமிக்ஞைகள் மற்றும் மாறிலிகளின் பட்டியல்
uk: Список автоматично перейменованих методів, властивостей, сигналів і констант

source: The `editor/renames_map_3_to_4.cpp <https://github.com/godotengine/godot/blob/master/editor/renames_map_3_to_4.cpp>`__ source file lists all automatic renames performed by the project upgrade tool. Lines that are commented out refer to API renames that :ref:`cannot be performed automatically <doc_upgrading_to_godot_4_manual_rename>`.
ga: Liostaíonn an `eagarthóir/renames_map_3_to_4.cpp <https://github.com/godotengine/godot/blob/master/editor/renames_map_3_to_4.cpp>`__ na hathainmneacha uathoibríocha go léir a rinne uirlis uasghrádú an tionscadail. Tagraíonn línte a ndéantar trácht orthu d'athainmneacha API nach féidir :ref:`a dhéanamh go huathoibríoch <doc_upgrading_to_godot_4_manual_rename>`.
pt_br: O arquivo-fonte `editor/renames_map_3_to_4.cpp <https://github.com/godotengine/godot/blob/master/editor/renames_map_3_to_4.cpp>`__ lista todas as renomeações automáticas realizadas pela ferramenta de atualização do projeto. Linhas comentadas referem-se a renomeações da API que :ref:`não podem ser feitas automaticamente <doc_upgrading_to_godot_4_manual_rename>`.
ru: Файл исходного кода `editor/renames_map_3_to_4.cpp <https://github.com/godotengine/godot/blob/master/editor/renames_map_3_to_4.cpp>`__ содержит список всех автоматических переименований сделанных утилитой обновления проекта. Строки с комментариями отсылают к переименованиям API в :ref:`cannot be performed automatically <doc_upgrading_to_godot_4_manual_rename>`.
ta: `எடிட்டர்/remuames_map_3_to_4.cpp <https://github.com/godotengine/godot/glob/master/editor/renames_map_3_to_4.cpp>` __ மூல கோப்பு திட்ட மேம்படுத்தல் கருவியால் நிகழ்த்தப்படும் அனைத்து தானியங்கி மறுபெயரையும் பட்டியலிடுகிறது. கருத்து தெரிவிக்கப்பட்டுள்ள கோடுகள் பநிஇ மறுபெயரிடுவதைக் குறிக்கின்றன: ref: `தானாகவே செய்ய முடியாது <doc_uprading_to_godot_4_manual_rename>`.
uk: Вихідний файл `editor/renames_map_3_to_4.cpp <https://github.com/godotengine/godot/blob/master/editor/renames_map_3_to_4.cpp>`__ перелічує всі автоматичні перейменування, виконані інструментом оновлення проекту. Закоментовані рядки стосуються перейменувань API, які :ref:`не можна виконати автоматично <doc_upgrading_to_godot_4_manual_rename>`.

source: Porting editor settings
ga: Socruithe an eagarthóra á bportáil
ru: Перенос настроек редактора
ta: போர்ட்டிங் எடிட்டர் அமைப்புகள்
uk: Налаштування редактора портування

source: Godot 3.x and 4.0 use different editor settings files. This means their settings can be changed independently from each other.
ga: Godot 3.x agus 4.0 úsáid comhaid suímh eagarthóir éagsúla. Ciallaíonn sé seo gur féidir a gcuid socruithe a athrú go neamhspleách óna chéile.
pt_br: Godot 3.x e 4.0 usam arquivos de configurações de editor diferentes. Isso significa que suas configurações podem ser alteradas independentemente uma da outra.
ru: Godot 3.x и Godot 4.0 используют разные файлы настроек редактора. Это означает то, что их настройки могут быть изменены независимо друг друга.
ta: கோடோட் 3.x மற்றும் 4.0 வெவ்வேறு எடிட்டர் அமைப்புகள் கோப்புகளைப் பயன்படுத்துகின்றன. இதன் பொருள் அவற்றின் அமைப்புகள் ஒருவருக்கொருவர் சுயாதீனமாக மாற்றப்படலாம்.
uk: Godot 3.x і 4.0 використовують різні файли налаштувань редактора. Це означає, що їхні налаштування можна змінювати незалежно один від одного.

source: If you wish to port over your Godot 3.x settings to Godot 4, open the :ref:`editor settings folder <doc_data_paths_editor_data_paths>` and copy ``editor_settings-3.tres`` to ``editor_settings-4.tres`` while the Godot 4 editor is closed.
ga: Más mian leat do shocruithe Godot 3.x a phortáil go Godot 4, oscail an :ref:`fillteán socruithe an eagarthóra <doc_data_paths_editor_data_paths>` agus cóipeáil ``editor_settings-3.tres`` go ``editor_settings-4.tres`` agus eagarthóir Godot 4 dúnta.
pt_br: Se você deseja transferir suas configurações do Godot 3.x para o Godot 4, abra a :ref:`pasta de configurações do editor <doc_data_paths_editor_data_paths>` e copie ``editor_settings-3.tres`` para ``editor_settings-4.tres`` enquanto o editor do Godot 4 estiver fechado.
ru: Если вы хотите перенести настройки с Godot 3.x на Godot 4, то откройте :ref:`папку с настройками редактора <doc_data_paths_editor_data_paths>` и скопируйте ``editor_settings-3.tres`` в ``editor_settings-4.tres``, в момент когда закрыт редактор Godot 4.
ta: உங்கள் கோடோட் 3.x அமைப்புகளை கோடோட் 4 க்கு நீங்கள் துறைமுகம் செய்ய விரும்பினால், திறக்க: குறிப்பு: `எடிட்டர் அமைப்புகள் கோப்புறை <doc_data_paths_editor_data_paths>` மற்றும் `` எடிட்டர்_செட்டிங்ச் -3.tres`` க்கு `` எடிட்டர்_செட்டிங்ச் -4.TRES`` வது. கோடோட் 4 ஆசிரியர் மூடப்பட்டிருக்கும் போது.
uk: Якщо ви бажаєте перенести налаштування Godot 3.x на Godot 4, відкрийте :ref:`теку налаштувань редактора <doc_data_paths_editor_data_paths>` і скопіюйте ``editor_settings-3.tres`` до ``editor_settings-4.tres`` поки редактор Godot 4 закритий.

source: Many settings' names and categories have changed since Godot 3.x. Editor settings whose name or category has changed won't carry over to Godot 4.0; you will have to set their values again.
ga: Tá ainmneacha agus catagóirí go leor socruithe athraithe ó Godot 3.x. Ní thabharfaidh socruithe eagarthóra a bhfuil a n-ainm nó a gcatagóir athraithe anonn go Godot 4.0; beidh ort a gcuid luachanna a shocrú arís.
pt_br: Muitos nomes e categorias de configurações foram alterados desde o Godot 3.x. As configurações do editor cujo nome ou categoria foram alterados não serão transferidas para o Godot 4.0; você terá que definir seus valores novamente.
ru: Множество имен и категорий настроек было изменено со времен Godot 3.x. Настройки редактора чьи имена и категории были изменены не переносятся в Godot 4.0; вам нужно установить их значения заново.
ta: கோடோட் 3.x முதல் பல அமைப்புகளின் பெயர்கள் மற்றும் வகைகள் மாறிவிட்டன. பெயர் அல்லது வகை மாறிவிட்ட ஆசிரியர் அமைப்புகள் கோடோட் 4.0 க்குச் செல்லாது; அவற்றின் மதிப்புகளை நீங்கள் மீண்டும் அமைக்க வேண்டும்.
uk: Багато назв і категорій налаштувань змінилися з Godot 3.x. Налаштування редактора, назва чи категорія якого змінено, не переносяться до Godot 4.0; вам доведеться знову встановити їх значення.

source: AnimatedSprite2D
ga: Beoite Sprite2D
uk: Анімований Sprite2D

source: XRCamera3D
ga: XRCeamara3D

source: ARVRController
ga: ARVRRialaitheoir

source: ARVRInterface
ga: ARVRComhéadan
uk: Інтерфейс ARVR

source: XRInterface
ga: XRComhéadan

source: XRServer
ga: XRfreastalaí

source: PhysicsTestMotionResult2D
ga: FisiceToradh Gluaiseachta Físice2D
uk: Тест з фізики Рух Результат 2D

source: Node3D
ga: Nód3D

source: VisualShaderNodeTexture2DParameter
ga: VisualShaderNoDetexture2DParaiméadar

source: :ref:`class_Camera2D`'s ``rotating`` property was replaced by ``ignore_rotation``, which has inverted behavior.
ga: :ref:Cuireadh ''ignore_rotation' in ionad ''rothlach'' class_Camera2D', a bhfuil iompar inbhéartaithe aige.
pt_br: A propriedade ``rotating`` de :ref:`class_Camera2D` foi substituída por ``ignore_rotation``, que tem comportamento invertido.
ru: У :ref:`class_Camera2D` свойство ``rotating`` было заменено на ``ignore_rotation``, инвертированное поведение.
uk: Властивість ``rotating`` :ref:`class_Camera2D` було замінено на ``ignore_rotation``, яка має інвертовану поведінку.

source: Node2D
ga: Nód2D

source: YSort
ga: YSortName
uk: Y Сортування

source: ARVROrigin
uk: ARVROпоходження

source: SpatialGizmo
uk: Просторова гізмо

source: ViewportContainer
cs: Kontejner pro výřez
uk: Контейнер Viewport

source: VisibleOnScreenNotifier3D
uk: Видимий на екрані Notifier 3D

source: VisibleOnScreenNotifier2D
uk: Видимий на екрані Notifier 2D

source: OpenSimplexNoise
uk: Відкрити Simplex Noise

source: Along with the `new features present in 4.0 <https://godotengine.org/article/godot-4-0-sets-sail>`__, upgrading gives the following advantages:
ru: Наряду с `новыми функциями, представленными в версии 4.0 <https://godotengine.org/article/godot-4-0-sets-sail>`__, обновление дает следующие преимущества:

source: See :ref:`doc_docs_changelog` for a list of pages documenting new features in Godot 4.0, and :ref:`doc_list_of_features` for a list of all features in Godot.
ru: Список страниц, документирующих новые функции Godot 4.0, см. в :ref:`doc_docs_changelog`, а список всех функций Godot — в :ref:`doc_list_of_features`.

source: If you don't *need* any features present in Godot 4.x, you may want to stay on Godot 3.x for the following reasons:
ru: Если вам не *нужны* какие-либо функции Godot 4.х, вы можете остаться на Godot 3.x по следующим причинам:

source: Godot 4 does not and will not have support for GLES2 rendering. (There is still support for GLES3 rendering using the new Compatibility renderer, which means that devices without Vulkan support can still run Godot 4.)
ru: Godot 4 не поддерживает и не будет поддерживать рендеринг GLES2. (Все еще поддерживается рендеринг GLES3 с использованием нового рендерера Compatibility, что означает, что устройства без поддержки Vulkan по-прежнему могут запускать Godot 4.)

source: By default, rendering in 2D is no longer performed in HDR, which means "overbright" modulate values have no visible effect. Since Godot 4.2, you can enable the project setting :ref:`HDR 2D<class_ProjectSettings_property_rendering/viewport/hdr_2d>` to perform 2D rendering in HDR. See also :ref:`doc_environment_and_post_processing_using_glow_in_2d`.
pt_br: Por padrão, a renderização em 2D não é mais realizada em HDR, o que significa que valores de modulação "superbrilhantes" não têm efeito visível. Desde o Godot 4.2, você pode ativar a configuração de projeto :ref:`HDR 2D<class_ProjectSettings_property_rendering/viewport/hdr_2d>` para realizar a renderização em 2D com HDR. Veja também :ref:`doc_environment_and_post_processing_using_glow_in_2d`.
ru: По умолчанию рендеринг в 2D больше не выполняется в HDR, что означает, что значения модуляции «overbright» не имеют видимого эффекта. Начиная с Godot 4.2, вы можете включить настройку проекта :ref:`HDR 2D<class_ProjectSettings_property_rendering/viewport/hdr_2d>` для выполнения 2D-рендеринга в HDR. См. также :ref:`doc_environment_and_post_processing_using_glow_in_2d`.

source: While rendering still happens in HDR in 3D when using the Forward+ or Mobile renderers, Viewports cannot return HDR data anymore. This is planned to be restored at some point in the future.
pt_br: Embora a renderização ainda ocorra em HDR em 3D ao usar os renderizadores Avançado+ ou Mobile, as Viewports não podem mais retornar dados HDR. Há planos para que isso seja restaurado em algum momento no futuro.
ru: Хотя рендеринг все еще происходит в HDR в 3D при использовании рендереров Forward+ или Mobile, Viewports больше не может возвращать данные HDR. Это планируется восстановить в какой-то момент в будущем.

source: AnimationPlayer's ``add_animation()`` is now ``add_animation_library()`` and now uses an :ref:`class_AnimationLibrary`.
pt_br: ``add_animation()`` do AnimationPlayer agora é ``add_animation_library()`` e agora usa uma :ref:`class_AnimationLibrary`.
ru: ``add_animation()`` в AnimationPlayer теперь называется ``add_animation_library()`` и теперь использует :ref:`class_AnimationLibrary`.

source: AnimationTree's ``set_process_mode()`` is now ``set_process_callback()``.
ru: AnimationTree's ``set_process_mode()`` теперь ``set_process_callback()``.

source: Array's ``empty()`` is now ``is_empty()``.
ru: Array's ``empty()`` теперь ``is_empty()``.

source: Array's ``invert()`` is now ``reverse()``.
ru: Array's ``invert()`` теперь ``reverse()``.

source: Array's ``remove()`` is now ``remove_at()``.
ru: Array's ``remove()`` теперь ``remove_at()``.

source: Camera2D's ``get_h_offset()`` is now ``get_drag_horizontal_offset()``.
ru: Camera2D's ``get_h_offset()`` теперь ``get_drag_horizontal_offset()``.

source: Camera2D's ``set_h_offset()`` is now ``set_drag_horizontal_offset()``.
ru: Camera2D's ``set_h_offset()`` теперь ``set_drag_horizontal_offset()``.

source: CanvasItem's ``raise()`` is now ``move_to_front()``.
pt_br: ``raise()`` do CanvasItem agora é ``move_to_front()``.
ru: CanvasItem's ``raise()`` теперь ``move_to_front()``.

source: Control's ``get_stylebox()`` is now ``get_theme_stylebox()``.
ru: Control's ``get_stylebox()`` теперь ``get_theme_stylebox()``.

source: ImmediateGeometry's ``set_normal()`` is now ``surface_set_normal()``.
ru: ImmediateGeometry's ``set_normal()`` теперь ``surface_set_normal()``.

source: ImmediateMesh's ``set_color()`` is now ``surface_set_color()``.
ru: ImmediateMesh's ``set_color()`` теперь ``surface_set_color()``.

source: ImmediateMesh's ``set_uv()`` is now ``surface_set_uv()``.
ru: ImmediateMesh's ``set_uv()`` теперь ``surface_set_uv()``.

source: MultiplayerAPI's ``is_refusing_new_network_connections()`` is now ``is_refusing_new_connections()``.
pt_br: ``is_refusing_new_network_connections()`` da MultiplayerAPI agora é ``is_refusing_new_connections()``.
ru: MultiplayerAPI's ``is_refusing_new_network_connections()`` теперь ``is_refusing_new_connections()``.

source: PhysicsTestMotionResult2D's ``get_motion()`` is now ``get_travel()``.
ru: PhysicsTestMotionResult2D's ``get_motion()`` теперь ``get_travel()``.

source: RenderingServer's ``get_render_info()`` is now ``get_rendering_info()``.
ru: RenderingServer's ``get_render_info()`` теперь ``get_rendering_info()``.

source: ResourceFormatLoader's ``load()`` is now ``_load()``.
ru: ResourceFormatLoader's ``load()`` теперь ``_load()``.

source: XRPositionalTracker's ``get_name()`` is now ``get_tracker_name()``.
ru: XRPositionalTracker's ``get_name()`` теперь ``get_tracker_name()``.

source: XRPositionalTracker's ``get_type()`` is now ``get_tracker_type()``.
ru: XRPositionalTracker's ``get_type()`` теперь ``get_tracker_type()``.

source: XRPositionalTracker's ``_set_name()`` is now ``get_tracker_name()``.
ru: XRPositionalTracker's ``_set_name()`` теперь ``get_tracker_name()``.

source: AudioServer's ``device`` is now ``output_device``.
pt_br: O ``device`` do AudioServer agora é ``output_device``.
ru: ``Устройство`` AudioServer теперь ``output_device``.

source: BaseButton's ``group`` is now ``button_group``.
pt_br: O ``group`` do BaseButton agora é ``button_group``.
ru: BaseButton's ``group`` теперь ``button_group``.

source: Camera3D's ``zfar`` is now ``far``.
pt_br: ``zfar`` do Camera3D agora é ``far``.
ru: Camera3D's ``zfar`` теперь ``far``.

source: Camera3D's ``znear`` is now ``near``
pt_br: ``znear`` do Camera3D agora é ``near``
ru: Camera3D's ``znear`` теперь ``near``

source: InputEventMouseButton's ``doubleclick`` is now ``double_click``.
pt_br: O ``doubleclick`` do InputEventMouseButton agora é ``double_click``.
ru: ``doubleclick`` для InputEventMouseButton теперь называется ``double_click``.

source: InputEventWithModifiers's ``alt`` is now ``alt_pressed``.
pt_br: ``alt`` de InputEventWithModifiers agora é ``alt_pressed``.
ru: ``alt`` в InputEventWithModifiers теперь ``alt_pressed``.

source: InputEventWithModifiers's ``command`` is now ``command_pressed``.
pt_br: O ``command`` de InputEventWithModifiers agora é ``command_pressed``.
ru: ``command`` InputEventWithModifiers теперь называется ``command_pressed``.

source: InputEventWithModifiers's ``control`` is now ``ctrl_pressed``.
pt_br: O ``control`` de InputEventWithModifiers agora é ``ctrl_pressed``.
ru: ``control`` InputEventWithModifiers теперь ``ctrl_pressed``.

source: InputEventWithModifiers's ``meta`` is now ``meta_pressed``.
pt_br: ``meta`` de InputEventWithModifiers agora é ``meta_pressed``.
ru: ``meta`` InputEventWithModifiers теперь имеет значение ``meta_pressed``.

source: InputEventWithModifiers's ``shift`` is now ``shift_pressed``.
pt_br: ``shift`` de InputEventWithModifiers agora é ``shift_pressed``.
ru: ``shift`` в InputEventWithModifiers теперь ``shift_pressed``.

source: Node's ``filename`` is now ``scene_file_path``.
ru: Node's ``filename`` теперь ``scene_file_path``.

source: PathFollow2D's ``rotate`` is now ``rotates``.
pt_br: ``rotate`` do PathFollow2D agora é ``rotates``.
ru: PathFollow2D's ``rotate`` теперь ``rotates``.

source: RectangleShape2D's ``extents`` is now ``size``
pt_br: ``extents`` do RectangleShape2D agora é ``size``
ru: RectangleShape2D's ``extents`` теперь ``size``

source: Theme's ``off`` is now ``unchecked``.
pt_br: ``off`` do Theme agora é ``unchecked``.
ru: Флажок ``off`` темы теперь ``unchecked``.

source: Theme's ``ofs`` is now ``offset``.
pt_br: ``ofs`` do Theme agora é ``offset``.
ru: Theme's ``ofs`` теперь ``offset``.

source: Theme's ``on`` is now ``checked``.
pt_br: ``on`` do Theme agora é ``checked``.
ru: Theme's ``on`` теперь ``checked``.

source: Window's ``window_title`` is now ``title``.
pt_br: ``window_title`` do Window agora é ``title``.
ru: Window's ``window_title`` теперь ``title``.

source: WorldMarginShape2D's ``d`` is now ``distance``.
pt_br: ``d`` do WorldMarginShape2D agora é ``distance``.
ru: WorldMarginShape2D's ``d`` теперь ``distance``.

source: Graphics quality settings were moved from Environment properties to project settings. This was done to make runtime quality adjustments easier, without having to access the currently active Environment resource then modify its properties.
pt_br: As configurações de qualidade gráfica foram movidas das propriedades do Environment para as configurações do projeto. Isso foi feito para facilitar os ajustes de qualidade em tempo de execução, sem a necessidade de acessar o recurso do Environment ativo e, em seguida, modificar suas propriedades.
ru: Настройки качества графики были перемещены из свойств Environment (Окружения) в настройки проекта. Это было сделано для того, чтобы упростить корректировку качества выполнения, без необходимости доступа к текущему активному ресурсу Environment и изменения его свойств.

source: There have been some changes to shaders that aren't covered by the upgrade tool. You will need to make some manual changes, especially if your shader uses coordinate space transformations or a custom ``light()`` function.
pt_br: Houve algumas alterações nos shaders que não são cobertas pela ferramenta de atualização. Você precisará fazer algumas alterações manuais, especialmente se o seu shader usar transformações de espaço de coordenadas ou uma função ``light()`` personalizada.
ru: В шейдерах произошли некоторые изменения, которые не покрываются инструментом обновления. Вам нужно будет внести некоторые изменения вручную, особенно если ваш шейдер использует преобразования координатного пространства или пользовательскую функцию ``light()``.

source: Some notable changes you will need to perform in shaders are:
pt_br: Algumas mudanças notáveis que você precisará realizar nos shaders são:
ru: Вот некоторые важные изменения, которые вам нужно будет внести в шейдеры:

source: In the Forward+ and Mobile renderers, normalized device coordinates now have a Z-range of ``[0.0,1.0]`` instead of ``[-1.0,1.0]``. When reconstructing NDC from ``SCREEN_UV`` and depth, use ``vec3 ndc = vec3(SCREEN_UV * 2.0 - 1.0, depth);`` instead of ``vec3 ndc = vec3(SCREEN_UV, depth) * 2.0 - 1.0;``. The Compatibility renderer is unchanged, using the same NDC Z-range as 3.x.
pt_br: Nos renderizadores Avançado+ e Mobile, as coordenadas normalizadas de dispositivo (NDC) agora possuem um intervalo Z de ``[0.0,1.0]`` em vez de ``[-1.0,1.0]``. Ao reconstruir as NDC a partir de ``SCREEN_UV`` e profundidade, use ``vec3 ndc = vec3(SCREEN_UV * 2.0 - 1.0, depth);`` em vez de ``vec3 ndc = vec3(SCREEN_UV, depth) * 2.0 - 1.0;``. O renderizador Compatibilidade permanece inalterado, utilizando o mesmo intervalo Z de NDC da versão 3.x.
ru: В рендерах Forward+ и Mobile нормализованные координаты устройства теперь имеют Z-диапазон ``[0.0,1.0]`` вместо ``[-1.0,1.0]``. При реконструкции NDC из ``SCREEN_UV`` и глубины используйте ``vec3 ndc = vec3(SCREEN_UV * 2.0 - 1.0, глубина);`` вместо ``vec3 ndc = vec3(SCREEN_UV, глубина) * 2.0 - 1.0;``. Рендер совместимости не изменился, используя тот же Z-диапазон NDC, что и 3.x.

source: The lighting model changed. If your shader has a custom ``light()`` function, you may need to make changes to get the same visual result.
pt_br: O modelo de iluminação mudou. Se o seu shader tiver uma função ``light()`` personalizada, talvez seja necessário fazer alterações para obter o mesmo resultado visual.
ru: Изменилась модель освещения. Если в вашем шейдере есть пользовательская функция ``light()``, вам может потребоваться внести изменения, чтобы получить тот же визуальный результат.

source: In 4.3 and up, the reverse Z depth buffer technique is now implemented, which may break advanced shaders. See `Introducing Reverse Z (AKA I'm sorry for breaking your shader) <https://godotengine.org/article/introducing-reverse-z/>`__.
pt_br: Na versão 4.3 e posteriores, a técnica de buffer de profundidade Z reverso foi implementada, o que pode danificar shaders avançados. Veja `Apresentando o Z Reverso (também conhecido como "Desculpe por danificar seu shader") <https://godotengine.org/article/introducing-reverse-z/>`__.
ru: В версии 4.3 и выше теперь реализована техника обратного буфера глубины Z, которая может сломать расширенные шейдеры. См. `Введение в обратный Z (AKA Извините за поломку вашего шейдера) <https://godotengine.org/article/introducing-reverse-z/>`__.

source: This list is not exhaustive. If you made all the changes mentioned here and your shader still doesn't work, try asking for help in one of the `community channels <https://godotengine.org/community/>`__.
ru: Этот список не является исчерпывающим. Если вы внесли все изменения, упомянутые здесь, и ваш шейдер все еще не работает, попробуйте обратиться за помощью в один из `каналов сообщества <https://godotengine.org/community/>`__.

source: :ref:`GDScript signal connection syntax <doc_gdscript_signals>` was changed. The conversion tool will use the string-based syntax which is still present in Godot 4, but it's recommended to switch to the :ref:`class_Signal`-based syntax described on the linked page. This way, strings are no longer involved, which avoids issues with signal name errors that can only be discovered at runtime.
pt_br: :ref:`A sintaxe de conexão dos sinais no GDScript <doc_gdscript_signals>` foi alterada. A ferramenta de conversão usará a sintaxe baseada em strings, que continua presente no Godot 4, mas é recomendável mudar para a sintaxe baseada em :ref:`class_Signal` descrita na página vinculada. Dessa forma, strings não são mais envolvidas, evitando problema com erros de nome de sinal que só podem ser descobertos em tempo de execução.
ru: :ref:`Синтаксис подключения сигнала GDScript <doc_gdscript_signals>` был изменен. Инструмент преобразования будет использовать синтаксис на основе строк, которые все еще присутствуют в Godot 4, но рекомендуется переключиться на синтаксис на основе :ref:`class_Signal`, описанный на связанной странице. Таким образом, строки больше не используются, что позволяет избежать проблем с ошибками имен сигналов, которые можно обнаружить только во время выполнения.

source: Camera2D or Camera3D
ru: Camera2D или Camera3D

source: Camera's pyramid shape was moved to :ref:'class_Camera3D'.
pt_br: O formato de pirâmide da câmera foi movido para :ref:'class_Camera3D'.
ru: Пирамидальная форма камеры была перемещена в :ref:'class_Camera3D'.

source: Updating version control settings
ru: Обновление настроек контроля версий
