Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.po
Languages: cs, ga, pt_br, ru, ta, uk

source: Upgrading from Godot 3 to Godot 4
ga: Uasghrádú ó Godot 3 go Godot 4
pt_br: Atualizando do Godot 3 para o Godot 4
ru: Переход с Godot 3 на Godot 4
ta: கோடோட் 3 இலிருந்து கோடோட் 4 க்கு மேம்படுத்துதல்
uk: Оновлення з Godot 3 до Godot 4

source: Should I upgrade to Godot 4?
ga: Ar cheart dom uasghrádú a dhéanamh go Godot 4?
pt_br: Devo atualizar para Godot 4?
ru: Стоит ли мне переходить на Godot 4?
ta: நான் கோடோட் 4 க்கு மேம்படுத்த வேண்டுமா?
uk: Чи варто оновлюватись до Godot 4?

source: Before beginning the upgrade process, it's worth thinking about the advantages and disadvantages that upgrading would bring to your project.
ga: Sula dtosaíonn tú ar an bpróiseas uasghrádaithe, is fiú smaoineamh ar na buntáistí agus na míbhuntáistí a bhainfeadh le do thionscadal le huasghrádú.
pt_br: Antes de iniciar o processo de atualização, vale a pena pensar sobre as vantagens e desvantagens que a atualização levaria ao seu projeto.
ru: Перед переходом, стоит подумать о преимуществах и недостатках, которые обновление принесет вашему проекту.
ta: மேம்படுத்தல் செயல்முறையைத் தொடங்குவதற்கு முன், மேம்படுத்தல் உங்கள் திட்டத்திற்கு கொண்டு வரும் நன்மைகள் மற்றும் தீமைகள் பற்றி சிந்திக்க வேண்டியது தேவை.
uk: Перш ніж почати процес оновлення, варто подумати про переваги та недоліки, які оновлення принесе вашому проекту.

source: Advantages of upgrading
ga: Buntáistí uasghrádú
ru: Преимущества обновления
ta: மேம்படுத்தலின் நன்மைகள்
uk: Переваги оновлення

source: Along with the `new features present in 4.0 <https://github.com/godotengine/godot/blob/master/CHANGELOG.md>`__, upgrading gives the following advantages:
ta: 4.0 <https://github.com/godotengine/godot/blob/master/changelog.md> __ இல் உள்ள `புதிய அம்சங்களுடன், மேம்படுத்தல் பின்வரும் நன்மைகளைத் தருகிறது:

source: Many bugs are fixed in 4.0, but cannot be resolved in 3.x for various reasons (such as graphics API differences or backwards compatibility).
ga: Socraítear go leor fabhtanna i 4.0, ach ní féidir iad a réiteach i 3.x ar chúiseanna éagsúla (mar shampla difríochtaí API grafaicí nó comhoiriúnacht ar ais).
pt_br: Muitos bugs são corrigidos no 4.0, mas não podem ser resolvidos no 3.x por várias razões (como diferenças de API gráfica ou compatibilidade retroativa).
ru: Многие ошибки исправлены в версии 4.0, и они не могут быть устранены в версии 3.x по разным причинам (например, из-за различий в графических API ).
ta: பல பிழைகள் 4.0 இல் நிர்ணயிக்கப்பட்டுள்ளன, ஆனால் பல்வேறு காரணங்களுக்காக (கிராபிக்ச் பநிஇ வேறுபாடுகள் அல்லது பின்னோக்கி பொருந்தக்கூடிய தன்மை போன்றவை) 3.x இல் தீர்க்க முடியாது.
uk: Багато помилок виправлено у версії 4.0, але їх неможливо усунути в версії 3.x з різних причин (наприклад, відмінності графічного API або зворотна сумісність).

source: 4.x will enjoy a longer :ref:`support period <doc_release_policy>`. Godot 3.x will continue to be supported for some time after 4.0 is released, but it will eventually stop receiving support.
ga: Bainfidh 4.x sult as :ref:`tréimhse tacaíochta <doc_release_policy>`. Leanfar le tacaíocht a thabhairt do Godot 3.x ar feadh tamaill tar éis 4.0 a scaoileadh, ach stopfaidh sé ag fáil tacaíochta ar deireadh.
pt_br: 4.x terá um :ref:` período de suporte <doc_release_policy>`mais longo. Godot 3.x continuará a ser suportado por algum tempo depois que 4.0 é liberado, mas deixará eventualmente de receber suporte
ru: 4.x будет иметь более длительный :ref:`период поддержки<doc_release_policy>` . Godot 3.x будет продолжать поддерживаться в течение некоторого времени после выпуска 4.0, но в конечном итоге поддержка прекратится.
ta: 4.x நீண்ட நேரம் அனுபவிக்கும்: ref: `ஆதரவு காலம் <doc_release_policy>`. 4.0 வெளியான பிறகு கோடோட் 3.x சில காலமாக தொடர்ந்து ஆதரிக்கப்படும், ஆனால் அது இறுதியில் ஆதரவைப் பெறுவதை நிறுத்திவிடும்.
uk: 4.x матиме довший :ref:`період підтримки <doc_release_policy>`. Godot 3.x підтримуватиметься деякий час після виходу версії 4.0, але згодом підтримку припиниться.

source: See :ref:`doc_docs_changelog` for a list of pages documenting new features in Godot 4.0.
ta: காண்க: குறிப்பு: கோடோட் 4.0 இல் புதிய அம்சங்களை ஆவணப்படுத்தும் பக்கங்களின் பட்டியலுக்கு `doc_docs_changelog`.

source: Disadvantages of upgrading
ga: Míbhuntáistí maidir le
ru: Недостатки обновления
ta: மேம்படுத்தலின் தீமைகள்
uk: Недоліки модернізації

source: If you don't *need* any features present in Godot 4.0, you may want to stay on Godot 3.x for the following reasons:
ga: Mura dteastaíonn uait* aon ghnéithe atá i láthair i Godot 4.0, b'fhéidir gur mhaith leat fanacht ar Godot 3.x ar na cúiseanna seo a leanas:
ta: கோடோட் 4.0 இல் உள்ள ஏதேனும் நற்பொருத்தங்கள் உங்களுக்கு * தேவையில்லை என்றால், பின்வரும் காரணங்களுக்காக நீங்கள் கோடோட் 3.x இல் இருக்க விரும்பலாம்:
uk: Якщо вам *не потрібні* жодні функції в Godot 4.0, ви можете залишитися на Godot 3.x з таких причин:

source: `Godot 3.x is tried and true, while Godot 4 remains in its early stages. <https://godotengine.org/article/release-management-4-0-and-beyond>`__
ga: `Tá Godot 3.x triailte agus fíor, agus tá Godot 4 fós ina chéimeanna tosaigh. <https://godotengine.org/article/release-management-4-0-and-beyond>`__
ta: `கோடோட் 3.x முயற்சிக்கப்பட்டு உண்மை, அதே நேரத்தில் கோடோட் 4 அதன் ஆரம்ப கட்டத்தில் உள்ளது. இப்போது
uk: «Godot 3.x перевірений і вірний, тоді як Godot 4 залишається на ранніх стадіях. <https://godotengine.org/article/release-management-4-0-and-beyond>`__

source: Godot 4.0 is expected to contain workflow and performance issues that Godot 3.x doesn't have. These issues will be ironed out over time in future Godot 4.x releases.
ga: Táthar ag súil go mbeidh saincheisteanna sreabhadh oibre agus feidhmíochta ag Godot 4.0 nach bhfuil ag Godot 3.x. Déanfar na saincheisteanna seo a iarannadh le himeacht ama in eisiúintí Godot 4.x amach anseo.
ta: கோடோட் 4.0 இல் கோடோட் 3.x இல்லாத பணிப்பாய்வு மற்றும் செயல்திறன் சிக்கல்கள் இருக்கும் என்று எதிர்பார்க்கப்படுகிறது. எதிர்கால கோடோட் 4.x வெளியீடுகளில் இந்த சிக்கல்கள் காலப்போக்கில் சலவை செய்யப்படும்.
uk: Очікується, що Godot 4.0 матиме проблеми з робочим процесом і продуктивністю, яких немає у Godot 3.x. Ці проблеми з часом будуть усунені в майбутніх випусках Godot 4.x.

source: Godot 4 has fewer third-party tutorials available compared to Godot 3.x. If you're new to game engines, you may have a better experience using Godot 3.x as a result.
ga: Tá níos lú ranganna teagaisc tríú páirtí ar fáil ag Godot 4 i gcomparáid le Godot 3.x. Má tá tú nua le hinnill cluiche, b'fhéidir go mbeidh taithí níos fearr agat ag baint úsáide as Godot 3.x mar thoradh air sin.
ta: கோடோட் 4 ஐ கோடோட் 3.x உடன் ஒப்பிடும்போது குறைவான மூன்றாம் தரப்பு பயிற்சிகள் உள்ளன. நீங்கள் விளையாட்டு இயந்திரங்களுக்கு புதியவர் என்றால், இதன் விளைவாக கோடோட் 3.x ஐப் பயன்படுத்தி உங்களுக்கு சிறந்த பட்டறிவு இருக்கலாம்.
uk: Godot 4 має менше доступних посібників від сторонніх розробників порівняно з Godot 3.x. Якщо ви новачок у роботі з ігровими движками, можливо, у вас буде кращий досвід використання Godot 3.x.

source: Godot 4's baseline hardware requirements (such as memory usage) are slightly higher, both for the editor and exported projects. This was required for the implementation of some core optimizations.
ga: Tá riachtanais chrua-earraí bunlíne Godot 4 (mar shampla úsáid cuimhne) beagán níos airde, don eagarthóir agus do thionscadail onnmhairithe araon. Bhí sé seo ag teastáil chun roinnt croí-bharrfheabhsú a chur i bhfeidhm.
pt_br: Os requisitos básicos de hardware do Godot 4 (como o uso de memória) são ligeiramente maiores, tanto para o editor quanto para projetos exportados. Isso foi necessário para a implementação de algumas otimizações centrais.
ru: Базовые требования к оборудованию Godot 4 (например, к использованию памяти) немного выше как для редактора, так и для экспортированных проектов. Это было необходимо для реализации некоторых основных оптимизаций.
ta: கோடோட் 4 இன் அடிப்படை வன்பொருள் தேவைகள் (நினைவக பயன்பாடு போன்றவை) சற்று அதிகமாக உள்ளன, அவை ஆசிரியர் மற்றும் ஏற்றுமதி செய்யப்பட்ட திட்டங்களுக்கு. சில முக்கிய மேம்படுத்தல்களை செயல்படுத்த இது தேவைப்பட்டது.
uk: Базові вимоги до апаратного забезпечення Godot 4 (наприклад, використання пам’яті) дещо вищі як для редактора, так і для експортованих проектів. Це було потрібно для впровадження деяких основних оптимізацій.

source: Since Godot 4 includes more features than Godot 3, Godot 4's binary size for exported projects is larger. While this can be mitigated by :ref:`optimizing a build for size <doc_optimizing_for_size>`, a 4.0 build with a given set of enabled modules will remain larger compared to a 3.x build with the same modules. This can be an issue for :ref:`exporting to the Web <doc_exporting_for_web>`, as binary size directly influences how fast the engine can initialize (regardless of download speed).
ga: Ós rud é go n-áirítear níos mó gnéithe ag Godot 4 ná Godot 3, tá méid dénártha Godot 4 do thionscadail onnmhairithe níos mó. Cé gur féidir é seo a mhaolú trí :ref: `tógáil a bharrfheabhsú do mhéid <doc_optimizing_for_size>`, fanfaidh tógáil 4.0 le sraith áirithe modúl cumasaithe níos mó i gcomparáid le tógáil 3.x leis na modúil chéanna. D’fhéadfadh sé seo a bheith ina cheist do :ref:`easpórtáil chuig an nGréasán <doc_exporting_for_web>`, toisc go mbíonn tionchar díreach ag méid na dénártha ar cé chomh tapa agus is féidir leis an inneall tosú (is cuma cén luas íoslódála).
pt_br: Já que o Godot 4 inclui mais recursos do que o Godot 3, o tamanho do binário dos projetos exportados do Godot 4 é maior. Embora isso possa ser mitigado :ref:`otimizando a compilação para tamanho<doc_optimizing_for_size>`, uma compilação 4.0 com um determinado conjunto de módulos habilitados continuará maior quando comparado com uma compilação 3.x com os mesmos módulos. Isso pode ser um problema quando :ref:`exportando para a Web<doc_exporting_for_web>`, já que o tamanho do binário influencia diretamente o quão rápido o motor pode inicializar (independente da velocidade de download).
ru: Поскольку в Godot 4 больше функций, чем Godot 3, размер двоичного файла у проектов Godot 4 больше. Хотя его можно уменьшить, :ref:`оптимизировав сборку по размеру<doc_optimizing_for_size>` , сборка 4.0 с заданным набором включенных модулей останется больше по сравнению со сборкой 3.x с теми же модулями. Это может быть проблемой при :ref:`экспорте в Web <doc_exporting_for_web>` , поскольку размер двоичного файла напрямую влияет на скорость загрузки движка (независимо от скорости интернета).
ta: கோடோட் 3 ஐ விட கோடோட் 4 ஐ விட அதிகமான நற்பொருத்தங்கள் இருப்பதால், ஏற்றுமதி செய்யப்பட்ட திட்டங்களுக்கான கோடோட் 4 இன் பைனரி அளவு பெரியது. இதைத் தணிக்க முடியும்: ref: `அளவுக்கான கட்டமைப்பை மேம்படுத்துதல் <doc_optimiging_for_size>`, கொடுக்கப்பட்ட இயக்கப்பட்ட தொகுதிகள் கொண்ட 4.0 உருவாக்கம் அதே தொகுதிகளுடன் 3.x கட்டமைப்போடு ஒப்பிடும்போது பெரிதாக இருக்கும். இதற்கான சிக்கலாக இது இருக்கலாம்: ref: `இணையத்திற்கு ஏற்றுமதி செய்வது <doc_exporting_for_web>`, ஏனெனில் பைனரி அளவு நேரடியாக இயந்திரம் எவ்வளவு விரைவாக துவக்க முடியும் (பதிவிறக்க வேகத்தைப் பொருட்படுத்தாமல்).
uk: Оскільки Godot 4 містить більше функцій, ніж Godot 3, двійковий розмір Godot 4 для експортованих проектів більший. Хоча це можна пом’якшити :ref:`оптимізацією збірки для розміру <doc_optimizing_for_size>`, збірка 4.0 із заданим набором увімкнених модулів залишатиметься більшою порівняно з збіркою 3.x із тими самими модулями. Це може бути проблемою для :ref:`експорту в Інтернет <doc_exporting_for_web>`, оскільки двійковий розмір безпосередньо впливає на швидкість ініціалізації механізму (незалежно від швидкості завантаження).

source: Godot 4 does not and will not have support for GLES2 rendering. (There is still support for GLES3 rendering using the new OpenGL backend, which means that devices without Vulkan support can still run Godot 4.)
ta: கோடோட் 4 க்ளெச் 2 ரெண்டரிங்கிற்கு உதவி இல்லை மற்றும் இருக்காது. .

source: If you are targeting **very** old hardware such as Intel Sandy Bridge (2nd generation) integrated graphics, this will prevent the project from running on such hardware after upgrading. `Software OpenGL implementations <https://github.com/pal1000/mesa-dist-win>`__ can be used to bypass this limitation, but they're too slow for gaming.
ga: Má tá tú ag díriú ar chrua-earraí ** an-sean** ar nós grafaicí comhtháite Intel Sandy Bridge (2ú glúin), cuirfidh sé seo cosc ar an tionscadal oibriú ar chrua-earraí den sórt sin tar éis uasghrádú a dhéanamh. Is féidir `forfheidhmithe bogearraí OpenGL <https://github.com/pal1000/mesa-dist-win>`__ a úsáid chun an teorannú seo a sheachaint, ach tá siad ró-mhall don chearrbhachas.
pt_br: Se você pretende atender hardware **muito** antigo como os gráficos integrados Intel Sandy Bridge (2ª generation), isso impedirá que o projeto seja executado nesse hardware após a atualização. `Implementações de softwares OpenGL <https://github.com/pal1000/mesa-dist-win>`__ podem ser usadas para contornar essa limitação, mas elas são muito lentas para jogos.
ru: Если вы ориентируетесь на **очень** старое оборудование, например со встроенной графикой Intel Sandy Bridge (2-го поколения), это не позволит запустить проект на таком оборудовании после обновления. Можно использовать `Программные реализации OpenGL <https://github.com/pal1000/mesa-dist-win>`__ для обхода этого ограничения, но они слишком медленны для игр.
ta: இன்டெல் சாண்டி பிரிட்ச் (2 வது தலைமுறை) ஒருங்கிணைந்த கிராபிக்ச் போன்ற பழைய வன்பொருள் ** மிக ** பழைய வன்பொருளை நீங்கள் குறிவைக்கிறீர்கள் என்றால், இது மேம்படுத்தப்பட்ட பிறகு அத்தகைய வன்பொருளில் திட்டம் இயங்குவதைத் தடுக்கும். `மென்பொருள் ஓபன்சிஎல் செயலாக்கங்கள் <https://github.com/pal1000/mesa-dist-win>` __ இந்த வரம்பைத் தவிர்ப்பதற்கு பயன்படுத்தப்படலாம், ஆனால் அவை கேமிங்கிற்கு மிகவும் மெதுவாக இருக்கின்றன.
uk: Якщо ви націлюєтеся на **дуже** старе обладнання, наприклад інтегровану відеокарту Intel Sandy Bridge (2-го покоління), це не дозволить запустити проект на такому обладнанні після оновлення. `Програмні реалізації OpenGL <https://github.com/pal1000/mesa-dist-win>`__ можна використовувати для обходу цього обмеження, але вони надто повільні для ігор.

source: Caveats of upgrading
ga: Rabhadh maidir le uasghrádú
pt_br: Considerações ao atualizar
ru: Предостережения при обновлении
ta: மேம்படுத்தலின் எச்சரிக்கைகள்
uk: Застереження щодо модернізації

source: **Since Godot 4 is a complete rewrite in many aspects, some features have unfortunately been lost in the process.** Some of these features may be restored in future Godot releases:
ga: ** Ós rud é gur athscríobh iomlán é Godot 4 i go leor gnéithe, ar an drochuair tá roinnt gnéithe caillte sa phróiseas.** Féadfar cuid de na gnéithe seo a athchóiriú in eisiúintí Godot amach anseo:
pt_br: **Como o Godot 4 é uma reescrita completa em muitos aspectos, algumas funcionalidades foram infelizmente perdidas no processo.** Algumas dessas funcionalidades podem ser restauradas em futuras versões do Godot:
ru: Поскольку Godot 4 во многих аспектах полностью переписан, некоторые функции, к сожалению, были удалены. Некоторые из этих функций могут быть восстановлены в будущих версиях Godot:
ta: ** கோடோட் 4 பல அம்சங்களில் முழுமையான மாற்றியமைக்கப்படுவதால், சில நற்பொருத்தங்கள் துரதிர்ச்டவசமாக செயல்பாட்டில் இழந்துவிட்டன. ** எதிர்காலத்தில் இந்த அம்சங்களில் சில மீட்டமைக்கப்படலாம்:
uk: **Оскільки Godot 4 є повністю переписаним у багатьох аспектах, деякі функції, на жаль, було втрачено в процесі.** Деякі з цих функцій можуть бути відновлені в майбутніх випусках Godot:

source: Bullet physics was removed in favor of GodotPhysics. This only affects 3D projects that used the default physics engine (which was Bullet) and didn't manually change it to GodotPhysics. There are no plans to re-add Bullet physics in core, but a third-party add-on could be created for it thanks to GDExtension.
ga: Baineadh fisic piléar i bhfabhar GodotPhysics. Níl sé seo i bhfeidhm ach ar thionscadail 3D a d'úsáid an t-inneall fisice réamhshocraithe (a ba é Bullet) agus nár athraigh é de láimh go GodotPhysics. Níl aon phleananna ann fisic Bullet a athchur sa chroí, ach d'fhéadfaí breiseán tríú páirtí a chruthú dó a bhuíochas le GDExtension.
pt_br: A física da bala foi removida em favor da GodotPhysics. Isso afeta apenas projetos 3D que usaram o motor de física padrão (que foi Bullet) e não o mudaram manualmente para GodotPhysics. Não há planos para re-adicionar a física Bullet no núcleo, mas um add-on de terceiros poderia ser criado para ele graças à GDExtension.
ru: Физика Bullet была удалена в пользу GodotPhysics. Это касается только 3D-проектов, в которых использовался физический движок по умолчанию (это был Bullet) и не менялось вручную на GodotPhysics. Планов по повторному добавлению физики Bullet нет, но для этого можно создать стороннее дополнение благодаря GDExtension.
ta: கோடோட்பிசிக்சுக்கு ஆதரவாக புல்லட் இயற்பியல் அகற்றப்பட்டது. இது இயல்புநிலை இயற்பியல் இயந்திரத்தைப் பயன்படுத்திய 3D திட்டங்களை மட்டுமே பாதிக்கிறது (இது புல்லட்) மற்றும் அதை கைமுறையாக கோடோட்பிசிக்ச் என மாற்றவில்லை. மையத்தில் புல்லட் இயற்பியலை மீண்டும் சேர்ப்பதற்கான திட்டங்கள் எதுவும் இல்லை, ஆனால் gdextension க்கு நன்றி செலுத்தும் மூன்றாம் தரப்பு துணை நிரலை உருவாக்க முடியும்.
uk: Фізику куль було видалено на користь GodotPhysics. Це стосується лише 3D-проектів, які використовували фізичний движок за замовчуванням (яким був Bullet) і не змінювали його вручну на GodotPhysics. Немає планів повторно додавати фізику Bullet в ядро, але стороннє доповнення можна створити для нього завдяки GDExtension.

source: While rendering still happens in HDR in 3D when using the Forward Plus or Forward Mobile backends, Viewports cannot return HDR data anymore. This is planned to be restored at some point in the future.
ta: முன்னோக்கி பிளச் அல்லது முன்னோக்கி மொபைல் பின்தளத்தில் பயன்படுத்தும் போது 3D இல் HDR இல் வழங்குதல் இன்னும் நிகழும்போது, வியூபோர்ட்டுகள் இனி HDR தரவைத் தர முடியாது. இது எதிர்காலத்தில் ஏதேனும் ஒரு கட்டத்தில் மீட்டெடுக்க திட்டமிடப்பட்டுள்ளது.

source: Mono was replaced by .NET 6. This means exporting C# projects to Android, iOS and HTML5 is no longer supported for now. Exporting C# projects to desktop platforms is still supported, and as of 4.2 there's experimental support for exporting to mobile platforms. Support for exporting C# projects to more platforms will be restored in future 4.x releases as upstream support improves.
ga: Tháinig .NET 6 in ionad Mono. Ciallaíonn sé seo nach dtacaítear le heaspórtáil tionscadail C# go Android, iOS agus HTML5 faoi láthair. Tacaítear go fóill le tionscadail C# a onnmhairiú chuig ardáin deisce, agus amhail 4.2 tá tacaíocht thurgnamhach le honnmhairiú chuig ardáin shoghluaiste. Déanfar tacaíocht d’onnmhairiú tionscadail C# chuig níos mó ardáin a athchóiriú in eisiúintí 4.x amach anseo de réir mar a fheabhsaíonn an tacaíocht réamhtheachtacha.
pt_br: O Mono foi substituído pelo .NET 6. Isso significa que a exportação de projetos C# para Android, iOS e HTML5 não é mais suportada por enquanto. A exportação de projetos C# para plataformas desktop ainda é suportada e, a partir da versão 4.2, há suporte experimental para exportação para plataformas móveis. O suporte para exportação de projetos C# para mais plataformas será restaurado em futuras versões 4.x, conforme o suporte upstream for aprimorado.
ru: Mono был заменен на .NET 6. Это означает, что экспорт проектов на C# в Android, iOS и HTML5 на данный момент больше не поддерживается. Экспорт проектов на C# на настольные платформы по-прежнему поддерживается, а начиная с версии 4.2 появилась экспериментальная поддержка экспорта на мобильные платформы. Поддержка экспорта проектов на C# на большее количество платформ будет восстановлена в будущих версиях 4.x по мере улучшения поддержки вышестоящих версий.
ta: மோனோ .நெட் 6 ஆல் மாற்றப்பட்டது. இதன் பொருள் சி# திட்டங்களை ஆண்ட்ராய்டு, ஐஇமு மற்றும் HTML5 க்கு ஏற்றுமதி செய்வது இப்போது ஆதரிக்கப்படவில்லை. சி# திட்டங்களை டெச்க்டாப் தளங்களுக்கு ஏற்றுமதி செய்வது இன்னும் ஆதரிக்கப்படுகிறது, மேலும் 4.2 வரை மொபைல் தளங்களுக்கு ஏற்றுமதி செய்வதற்கு சோதனை உதவி உள்ளது. சி# திட்டங்களை கூடுதல் தளங்களுக்கு ஏற்றுமதி செய்வதற்கான உதவி எதிர்காலத்தில் மீட்டமைக்கப்படும் 4.x வெளியீடுகள் மேலோடை உதவி மேம்படுகிறது.
uk: Mono було замінено на .NET 6. Це означає, що експорт проектів C# до Android, iOS і HTML5 більше не підтримується. Експорт проектів C# на настільні платформи все ще підтримується, а з версії 4.2 існує експериментальна підтримка експорту на мобільні платформи. Підтримку експорту проектів C# на більше платформ буде відновлено в майбутніх випусках 4.x у міру покращення підтримки початкової версії.

source: You can find a more complete list of functional regressions by searching for `issues labeled "regression" but not "bug" on GitHub <https://github.com/godotengine/godot/issues?q=is%3Aissue+is%3Aopen+label%3Aregression+-label%3Abug>`__.
ga: Is féidir leat liosta níos iomláine d'aischéimnithe feidhmiúla a aimsiú ach cuardach a dhéanamh ar `shaincheisteanna a bhfuil an lipéad "aischéimniú orthu" ach nach bhfuil "fabht" orthu ar GitHub <https://github.com/godotenginine/godot/issues?q=is%3Aissue+is%3Aopen +lipéad% 3Aischéimniú+-label% 3Abug>`__.
ru: Более полный список функциональных регрессий можно найти, выполнив поиск по запросу `issues, помеченным как «регрессия», но не «ошибка» на GitHub <https://github.com/godotengine/godot/issues?q=is%3Aissue+is%3Aopen+label%3Aregression+-label%3Abug>`__.
ta: "பின்னடைவு" என்று பெயரிடப்பட்ட `சிக்கல்களைத் தேடுவதன் மூலம் செயல்பாட்டு பின்னடைவுகளின் முழுமையான பட்டியலை நீங்கள் காணலாம், ஆனால் அறிவிலிமையம் <https://github.com/godotengine/godot/issues?q=is%3Aissue+is%3Aopen இல்" பிழை "அல்ல +லேபிள்%3AREGRESSION+-லாபெல்%3abug> `__.
uk: Ви можете знайти більш повний список функціональних регресій, виконавши пошук `проблем з позначкою «регресія», але не «помилка» на GitHub <https://github.com/godotengine/godot/issues?q=is%3Aissue+is%3Aopen +label%3Aregression+-label%3Abug>`__.

source: Preparing before the upgrade (optional)
ga: Ullmhú roimh an uasghrádú (roghnach)
ru: Подготовка перед обновлением (необязательно)
ta: மேம்படுத்தலுக்கு முன் தயாரித்தல் (விரும்பினால்)
uk: Підготовка перед оновленням (необов’язково)

source: If you want to be ready to upgrade to Godot 4 in the future, consider using :ref:`class_Tweener` and the :ref:`class_Time` singleton in your project. These classes are both available in Godot 3.5 and later.
ga: Más mian leat a bheith réidh le huasghrádú go Godot 4 sa todhchaí, smaoinigh ar: ref: `Class_tweener` agus ain:ref: `Class_time` singleton a úsáid i do thionscadal. Tá na ranganna seo ar fáil i Godot 3.5 agus níos déanaí.
pt_br: Se você quiser estar pronto para atualizar para o Godot 4 no futuro, considere usar :ref:`class_Tweener` e o singleton :ref:`class_Time` no seu projeto. Ambas as classes estão disponíveis no Godot 3.5 e versões posteriores.
ru: Если в будущем вы захотите обновиться до Godot 4, подумайте об использовании :ref:`class_Tweener` и синглтона :ref:`class_Time` в вашем проекте. Эти классы оба доступны в Godot 3.5 и более поздних версиях.
ta: எதிர்காலத்தில் கோடோட் 4 க்கு மேம்படுத்த நீங்கள் தயாராக இருக்க விரும்பினால், பயன்படுத்துங்கள்: ref: `class_twewener` மற்றும்: ref:` class_time` சிங்கிள்டன் உங்கள் திட்டத்தில். இந்த வகுப்புகள் இரண்டும் கோடோட் 3.5 மற்றும் அதற்குப் பிறகு கிடைக்கின்றன.
uk: Якщо ви хочете бути готовими до оновлення до Godot 4 у майбутньому, подумайте про використання :ref:`class_Tweener` і :ref:`class_Time` синглтона у вашому проекті. Ці класи доступні в Godot 3.5 і новіших версіях.
