Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.po
Languages: cs, ga, pt_br, ru, ta, uk

source: File and Directory classes were replaced by :ref:`class_FileAccess` and :ref:`class_DirAccess`, which have an entirely different API. Several methods are now static, which means you can call them directly on FileAccess or DirAccess without having to create an instance of that class.
ga: Cuireadh :ref:'class_FileAccess' agus :ref:'class_DirAccess' in ionad ranganna Comhad agus Eolaire, a bhfuil API go hiomlán difriúil acu. Tá roinnt modhanna statach anois, rud a chiallaíonn gur féidir leat glaoch orthu go díreach ar FileAccess nó DirAccess gan cás den aicme sin a chruthú.
pt_br: As classes File e Directory foram substituídas por :ref:`class_FileAccess` e :ref:`class_DirAccess`, que possuem uma API totalmente diferente. Vários métodos agora são estáticos, o que significa que você pode chamá-los diretamente em FileAccess ou DirAccess sem precisar criar uma instância dessa classe.
ru: Классы File и Directory были заменены на :ref:`class_FileAccess` и :ref:`class_DirAccess` которые имеют абсолютно другой API. Несколько методов теперь статичны, что означает, что вы можете вызвать их напрямую без создания экземпляра класса.
ta: கோப்பு மற்றும் அடைவு வகுப்புகள் மாற்றப்பட்டன: ref: `class_fileaccess` மற்றும்: ref:` class_diraccess`, அவை முற்றிலும் மாறுபட்ட பநிஇ ஐக் கொண்டுள்ளன. பல முறைகள் இப்போது நிலையானவை, அதாவது அந்த வகுப்பின் ஒரு நிகழ்வை உருவாக்காமல் அவற்றை நேரடியாக ஃபைலேஆக்சச் அல்லது டிராக்சசில் அழைக்கலாம்.
uk: Класи File та Directory були замінені на :ref:`class_FileAccess` і :ref:`class_DirAccess`, які мають зовсім інший API. Кілька методів тепер статичні, що означає, що ви можете викликати їх безпосередньо у FileAccess або DirAccess без необхідності створювати екземпляр цього класу.

source: Screen and window-related methods from the :ref:`class_OS` singleton (such as ``OS.get_screen_size()``) were moved to the :ref:`class_DisplayServer` singleton. Method naming was also changed to use the ``DisplayServer.<object>_<get/set>_property()`` form instead. For example, ``OS.get_screen_size()`` becomes ``DisplayServer.screen_get_size()``.
ga: Aistríodh modhanna a bhaineann le scáileáin agus fuinneog ón :ref:`class_OS` singil (amhail ``OS.get_screen_size()``) go dtí an singleton :ref:`class_DisplayServer`. Athraíodh ainmniú an mhodha freisin chun an fhoirm ``DisplayServer.<object>_<get/set>_property()`` a úsáid ina ionad sin. Mar shampla, déantar ``OS.get_screen_size()`` mar ``DisplayServer.screen_get_size()``.
pt_br: Métodos relacionados à tela e à janela do singleton :ref:`class_OS` (como ``OS.get_screen_size()``) foram movidos para o singleton :ref:`class_DisplayServer`. A nomenclatura dos métodos também foi alterada para o formato ``DisplayServer.<objeto>_<get/set>_property()``. Por exemplo, ``OS.get_screen_size()`` passou a ser ``DisplayServer.screen_get_size()``.
ru: Методы связанные с экраном или окном из синглтона :ref:`class_OS` (такие как ``OS.get_screen_size()``) были перемещены в синглтон :ref:`class_DisplayServer`. Именование методов также было измененно, чтобы иметь такую форму ``DisplayServer.<объект>_<get/set>_property()``. Например, ``OS.get_screen_size()`` стал ``DisplayServer.screen_get_size()``.
ta: திரை மற்றும் சாளர தொடர்பான முறைகள்: ref: `class_os` சிங்கிள்டன் (` `os.get_screen_size ()` `போன்றவை): ref:` class_displayserver` சிங்கிள்டன். `` டிச்ப்ளேசர்வர். எடுத்துக்காட்டாக, `` os.get_screen_size () `` ஆக மாறுகிறது `` despleaserver.screen_get_size () ``.
uk: Методи, пов’язані з екраном і вікном, із синглтона :ref:`class_OS` (такі як ``OS.get_screen_size()``) були переміщені до сінглона :ref:`class_DisplayServer`. Іменування методів також було змінено для використання форми ``DisplayServer.<object>_<get/set>_property()``. Наприклад, ``OS.get_screen_size()`` стає ``DisplayServer.screen_get_size()``.

source: Time and date methods from the :ref:`class_OS` singleton were moved to the :ref:`class_Time` singleton. (The Time singleton is also available in Godot 3.5 and later.)
ga: Aistríodh modhanna ama agus dáta ón singleton :ref:'class_OS' go dtí an singleton :ref:'class_Time'. (Tá an singleton Am ar fáil freisin i Godot 3.5 agus níos déanaí.)
pt_br: Os métodos de hora e data do singleton :ref:`class_OS` foram movidos para o singleton :ref:`class_Time`. (O singleton Time também está disponível no Godot 3.5 e versões posteriores.)
ru: Методы связанные со временем и датой были перемещены из синглтона :ref:`class_OS` в синглтон :ref:`class_Time`. (Синглтон Time также доступен в версии Godot 3.5 и старше.)
ta: நேரம் மற்றும் தேதி முறைகள்: ref: `class_os` சிங்கிள்டன்: ref:` class_time` சிங்கிள்டன். (சிங்கிள்டன் கோடோட் 3.5 மற்றும் அதற்குப் பிறகு கிடைக்கும் நேரம்.)
uk: Методи часу та дати з синглтона :ref:`class_OS` було переміщено до сінглона :ref:`class_Time`. (Синглтон часу також доступний у Godot 3.5 і пізніших версіях.)

source: You may have to replace some ``instance()`` calls with ``instantiate()``. The converter *should* handle this automatically, but this relies on custom code that may not work in 100% of situations.
ga: B'fhéidir go mbeidh ort ''instantiate()'' a chur in ionad roinnt glaonna ''instance()''. Ba chóir don tiontaire *é seo a láimhseáil go huathoibríoch, ach braitheann sé seo ar chód saincheaptha nach n-oibreoidh i 100% de na cásanna.
pt_br: Talvez seja necessário substituir algumas chamadas ``instance()`` por ``instantiate()``. O conversor *deve* lidar com isso automaticamente, mas isso depende de código personalizado que pode não funcionar em 100% das situações.
ru: Вам стоит сменить вызовы функции ``instance()`` на ``instantiate()``. Конвертор *должен* обработать это автоматически, но это зависит от кода, поэтому он может не всегда срабатывать.
ta: நீங்கள் சில `` நிகழ்வு () `` அழைப்புகளை `` உடனடி () `` உடன் மாற்ற வேண்டியிருக்கும். மாற்றி * இதை தானாகவே கையாள வேண்டும், ஆனால் இது 100% சூழ்நிலைகளில் வேலை செய்யாத தனிப்பயன் குறியீட்டை நம்பியுள்ளது.
uk: Можливо, вам доведеться замінити деякі виклики ``instance()`` на ``instantiate()``. Конвертер *має* обробляти це автоматично, але це залежить від спеціального коду, який може не працювати в 100% ситуацій.

source: AcceptDialog's ``set_autowrap()`` is now ``set_autowrap_mode()``.
ga: Is é ''set_autowrap()'' AcceptDialog anois ''set_autowrap_mode()''.
pt_br: O ``set_autowrap()`` do AcceptDialog agora é ``set_autowrap_mode()``.
ru: Метод ``set_autowrap()`` у AcceptDialog теперь ``set_autowrap_mode()``.
ta: ஏற்றுக்கொள்ளுங்கள் `` set_autowrap () `` இப்போது `` set_autowrap_mode () '``.
uk: ``set_autowrap()`` AcceptDialog тепер ``set_autowrap_mode()``.

source: AnimationNode's ``process()`` is now ``_process()`` (note the leading underscore, which denotes a virtual method).
ga: Is é ''próiseas()'' AnimationNode anois ''_process()'' (tabhair faoi deara an fo-chór tosaigh, a léiríonn modh fíorúil).
pt_br: ``process()`` do AnimationNode agora é ``_process()`` (observe o sublinhado inicial, que denota um método virtual).
ru: Метод ``process()``у AnimationNode теперь называется ``_process()`` (помни, подчеркивание в начале означает, что метод виртуальный).
ta: அனிமேசன்நோடின் `` செயல்முறை () `` இப்போது `` _ செயலாக்க () `` (முன்னணி அடிக்கோடிட்டுக் காட்டுவதைக் கவனியுங்கள், இது ஒரு மெய்நிகர் முறையைக் குறிக்கிறது).
uk: ``process()`` AnimationNode тепер ``_process()`` (зверніть увагу на початок підкреслення, яке позначає віртуальний метод).

source: AStar2D and AStar3D's ``get_points()`` is now ``get_points_id()``.
ga: Is é ''get_points()'' AStar2D agus AStar3D anois ''get_points_id()''.
pt_br: ``get_points()`` do AStar2D e AStar3D agora é ``get_points_id()``.
ru: Метод ``get_points()`` у AStar2D и AStar3D теперь называется ``get_points_id()``.
ta: Astar2d மற்றும் astar3d இன் `` get_points () `` இப்போது `` get_points_id () ``.
uk: ``get_points()`` AStar2D і AStar3D тепер ``get_points_id()``.

source: BaseButton's ``set_event()`` is now ``set_shortcut()``.
ga: Is é ''set_event()'' baseButton anois ''set_shortcut()''.
pt_br: ``set_event()`` do BaseButton agora é ``set_shortcut()``.
ru: Метод ``set_event()`` у BaseButton теперь называется ``set_shortcut()``.
ta: BaseButton இன் `` set_event () `` இப்போது `` set_shortcut () ``.
uk: ``set_event()`` BaseButton тепер ``set_shortcut()``.

source: Camera2D's ``get_v_offset()`` is now ``get_drag_vertical_offset()``.
ga: Is é ''get_v_offset()'' Camera2D anois ''get_drag_vertical_offset()''.
pt_br: ``get_v_offset()`` do Camera2D agora é ``get_drag_vertical_offset()``.
ru: Метод ``get_v_offset()`` у Camera2D теперь называется ``get_drag_vertical_offset()``.
ta: கேமரா 2 டி `` get_v_offset () `` இப்போது `` get_drag_vertical_offset () ``.
uk: ``get_v_offset()`` Camera2D тепер ``get_drag_vertical_offset()``.

source: Camera2D's ``set_v_offset()`` is now ``set_drag_vertical_offset()``.
ga: Is é ''set_v_offset()'' Camera2D anois ''set_drag_vertical_offset()''.
pt_br: ``set_v_offset()`` do Camera2D agora é ``set_drag_vertical_offset()``.
ru: Метод ``set_v_offset()`` у Camera2D теперь называется ``set_drag_vertical_offset()``.
ta: கேமரா 2 டி `` set_v_offset () `` இப்போது `` set_drag_vertical_offset () ``.
uk: ``set_v_offset()`` Camera2D тепер ``set_drag_vertical_offset()``.

source: CanvasItem's ``update()`` is now ``queue_redraw()``.
ga: Is é ''update()'' CanvasItem anois ''queue_redraw()''.
pt_br: ``update()`` do CanvasItem agora é ``queue_redraw()``.
ru: Метод ``update()`` у CanvasItem теперь называется ``queue_redraw()``.
ta: Canvasitem இன் `` புதுப்பிப்பு () `` இப்போது `` queue_redraw () ``.
uk: ``update()`` CanvasItem тепер ``queue_redraw()``.

source: Control's ``set_tooltip()`` is now ``set_tooltip_text()``.
ga: Is é ''set_tooltip()'' an rialaithe anois ''set_tooltip_text()''.
pt_br: ``set_tooltip()`` do controle agora é ``set_tooltip_text()``.
ru: Метод ``set_tooltip()`` у Control теперь называется ``set_tooltip_text()``.
ta: கட்டுப்பாட்டின் `` set_tooltip () `` இப்போது `` set_tooltip_text () ``.
uk: ``set_tooltip()`` елемента керування тепер ``set_tooltip_text()``.

source: EditorNode3DGizmoPlugin's ``create_gizmo()`` is now ``_create_gizmo()`` (note the leading underscore, which denotes a virtual method).
ga: EditorNode3DGizmoPlugin's ''create_gizmo()'' anois ''_create_gizmo()'' (tabhair faoi deara an fo-chór tosaigh, a léiríonn modh fíorúil).
pt_br: ``create_gizmo()`` do EditorNode3DGizmoPlugin agora é ``_create_gizmo()`` (observe o sublinhado inicial, que denota um método virtual).
ru: Метод ``create_gizmo()`` у EditorNode3DGizmoPlugin теперь называется ``_create_gizmo()`` (подчеркивание у метода в начале означает то, что метод виртуальный).
ta: Titighornode3dgizmoplugin இன் `` create_gizmo () `` இப்போது `` _CREATE_GIZMO () `` (முன்னணி அடிக்கோடிட்டுக் குறிப்பைக் கவனியுங்கள், இது ஒரு மெய்நிகர் முறையைக் குறிக்கிறது).
uk: ``create_gizmo()`` EditorNode3DGizmoPlugin тепер ``_create_gizmo()`` (зверніть увагу на початок підкреслення, яке позначає віртуальний метод).

source: ENetMultiplayerPeer's ``get_peer_port()`` is now ``get_peer()``.
ga: Is é ''get_peer_port()'' ENetMultiplayerPeer anois ''get_peer()''.
pt_br: ``get_peer_port()`` de ENetMultiplayerPeer agora é ``get_peer()``.
ru: Метод ``get_peer_port()`` у ENetMultiplayerPeer теперь называется ``get_peer()``.
ta: Enetmultiplayerpeer இன் `` get_peer_port () `` இப்போது `` get_peer () ``.
uk: ``get_peer_port()`` ENetMultiplayerPeer тепер ``get_peer()``.

source: FileDialog's ``get_mode()`` is now ``get_file_mode()``.
ga: Is é ''get_mode()'' fileDialog anois ''get_file_mode()''.
pt_br: FileDialog ``get_mode()`` agora é ``get_file_mode()``.
ru: Метод ``get_mode()`` у FileDialog теперь называется ``get_file_mode()``.
ta: Filedialog இன் `` get_mode () `` இப்போது `` get_file_mode () ``.
uk: ``get_mode()`` FileDialog тепер ``get_file_mode()``.

source: FileDialog's ``set_mode()`` is now ``set_file_mode()``.
ga: Is é ''set_mode()'' fileDialog anois ''set_file_mode()''.
pt_br: FileDialog ``set_mode()`` agora é ``set_file_mode()``.
ru: Метод ``set_mode()`` у FileDialog теперь называется ``set_file_mode()``.
ta: Filedialog இன் `` set_mode () `` இப்போது `` set_file_mode () `` ஆகும்.
uk: ``set_mode()`` FileDialog тепер ``set_file_mode()``.

source: GraphNode's ``get_offset()`` is now ``get_position_offset()``.
ga: Is é ''get_offset()'' GraphNode anois ''get_position_offset()''.
pt_br: ``get_offset()`` do GraphNode agora é ``get_position_offset()``.
ru: Метод ``get_offset()`` у GraphNode теперь называется ``get_position_offset()``.
ta: வரைபடத்தின் `` get_offset () `` இப்போது `` get_position_offset () ``.
uk: ``get_offset()`` GraphNode тепер ``get_position_offset()``.

source: GridMap's ``world_to_map()`` is now ``local_to_map()``.
ga: Is é ''world_to_map()'' GridMap anois ''local_to_map()''.
pt_br: ``world_to_map()`` do GridMap agora é ``local_to_map()``.
ru: Метод ``world_to_map()`` у GridMap теперь называется ``local_to_map()``.
ta: கிரிட்மேப்பின் `` world_to_map () `` இப்போது `` local_to_map () `` ஆகும்.
uk: ``world_to_map()`` GridMap тепер ``local_to_map()``.

source: GridMap's ``map_to_world()`` is now ``map_to_local()``.
ga: Is é ''map_to_world()'' GridMap anois ''map_to_local()''.
pt_br: ``map_to_world()`` do GridMap agora é ``map_to_local()``.
ru: Метод ``map_to_world()`` у GridMap теперь называется ``map_to_local()``.
ta: கிரிட்மேப்பின் `` MAP_TO_WORLD () `` இப்போது `` MAP_TO_LOCAL () ``.
uk: ``map_to_world()`` GridMap тепер ``map_to_local()``.

source: Image's ``get_rect()`` is now ``get_region()``.
ga: Is é ''get_rect()'' na híomhá anois ná ''get_region()''.
pt_br: ``get_rect()`` do Image agora é ``get_region()``.
ru: Метод ``get_rect()`` у Image теперь называется ``get_region()``.
ta: படத்தின் `` get_rect () `` இப்போது `` get_region () ``.
uk: ``get_rect()`` зображення тепер ``get_region()``.

source: ItemList's ``get_v_scroll()`` is now ``get_v_scroll_bar()``.
ga: Is é ''get_v_scroll()'' ItemList anois ''get_v_scroll_bar()''.
pt_br: ``get_v_scroll()`` do ItemList agora é ``get_v_scroll_bar()``.
ru: Метод ``get_v_scroll()`` у ItemList теперь называется ``get_v_scroll_bar()``.
ta: ItemList இன் `` get_v_scroll () `` இப்போது `` get_v_scroll_bar () ``.
uk: ``get_v_scroll()`` ItemList тепер ``get_v_scroll_bar()``.

source: MultiPlayerAPI's ``get_network_connected_peers()`` is now ``get_peers()``.
ga: Is é ''get_network_connected_peers()'' multiPlayerAPI anois ''get_peers()''.
pt_br: ``get_network_connected_peers()`` do MultiPlayerAPI agora é ``get_peers()``.
ru: Метод ``get_network_connected_peers()`` у MultiPlayerAPI теперь называется ``get_peers()``.
ta: மல்டிபிளேராபியின் `` get_network_connectect_peers () `` இப்போது `` get_peers () ``.
uk: ``get_network_connected_peers()`` MultiPlayerAPI тепер ``get_peers()``.

source: MultiPlayerAPI's ``get_network_peer()`` is now ``get_peer()``.
ga: Is é ''get_network_peer()'' multiPlayerAPI anois ''get_peer()''.
pt_br: ``get_network_peer()`` do MultiPlayerAPI agora é ``get_peer()``.
ru: Метод ``get_network_peer()`` у MultiPlayerAPI теперь называется ``get_peer()``.
ta: மல்டிபிளேராபியின் `` get_network_peer () `` இப்போது `` get_peer () ``.
uk: ``get_network_peer()`` MultiPlayerAPI тепер ``get_peer()``.

source: MultiPlayerAPI's ``get_network_unique_id()`` is now ``get_unique_id()``.
ga: Is é ''get_network_unique_id()'' multiPlayerAPI anois ''get_unique_id()''.
pt_br: ``get_network_unique_id()`` do MultiPlayerAPI agora é ``get_unique_id()``.
ru: Метод ``get_network_unique_id()`` у MultiPlayerAPI теперь называется ``get_unique_id()``.
ta: மல்டிபிளேராபியின் `` get_network_unique_id () `` இப்போது `` get_unique_id () ``.
uk: ``get_network_unique_id()`` MultiPlayerAPI тепер ``get_unique_id()``.

source: MultiPlayerAPI's ``has_network_peer()`` is now ``has_multiplayer_peer()``.
ga: Is é ''has_network_peer()'' multiPlayerAPI anois ''has_multiplayer_peer()''.
pt_br: ``has_network_peer()`` do MultiPlayerAPI agora é ``has_multiplayer_peer()``.
ru: Метод ``has_network_peer()`` у MultiPlayerAPI теперь называется ``has_multiplayer_peer()``.
ta: மல்டிபிளேராபியின் `` has_network_peer () `` இப்போது `` has_multiplayer_peer () ``.
uk: ``has_network_peer()`` MultiPlayerAPI тепер ``has_multiplayer_peer()``.

source: PacketPeerUDP's ``is_listening()`` is now ``is_bound()``.
ga: Is é ''is_listening()'' PacketPeerUDP anois ''is_bound()''.
pt_br: ``is_listening()`` do PacketPeerUDP agora é ``is_bound()``.
ru: Метод ``is_listening()`` у PacketPeerUDP теперь называется ``is_bound()``.
ta: PacketPeerudp இன் `` is_listening () `` இப்போது `` is_bound () `` ஆகும்.
uk: ``is_listening()`` PacketPeerUDP тепер ``is_bound()``.

source: PacketPeerUDP's ``listen()`` is now ``bind()``.
ga: Is é ''listen()'' PacketPeerUDP anois ''bind()''.
pt_br: ``listen()`` do PacketPeerUDP agora é ``bind()``.
ru: Метод ``listen()`` у PacketPeerUDP теперь называется ``bind()``.
ta: பாக்கெட்பீயரின் `` கேளுங்கள் () `` இப்போது `` பிணைப்பு () ``.
uk: ``listen()`` PacketPeerUDP тепер ``bind()``.

source: ParticleProcessMaterial's ``set_flag()`` is now ``set_particle_flag()``.
ga: ParticleProcessMaterial's ''set_flag()'' anois ''set_particle_flag()''.
pt_br: ``set_flag()`` do ParticleProcessMaterial agora é ``set_particle_flag()``.
ru: Метод ``set_flag()`` у ParticleProcessMaterial теперь называется ``set_particle_flag()``.
ta: துகள் பதவி நீக்கம் செய்யப்பட்ட `` set_flag () `` இப்போது `` set_particle_flag () ``.
uk: ``set_flag()`` у ParticleProcessMaterial тепер ``set_particle_flag()``.

source: ResourceFormatLoader's ``get_dependencies()`` is now ``_get_dependencies()`` (note the leading underscore, which denotes a virtual method).
ga: ResourceFormatLoader's ''get_dependencies()'' anois ''_get_dependencies()'' (tabhair faoi deara an fo-chór tosaigh, a léiríonn modh fíorúil).
pt_br: ``get_dependencies()`` do ResourceFormatLoader agora é ``_get_dependencies()`` (observe o sublinhado inicial, que denota um método virtual).
ru: Метод ``get_dependencies()`` у ResourceFormatLoader теперь называется ``_get_dependencies()`` (помни, нижнее подчеркивание в начале метода, означает то, что он виртуальный).
ta: Resourceformatloader இன் `` get_dependencies () `` இப்போது `` _get_dependencies () `` (முன்னணி அடிக்கோடிட்டுக் குறிப்பைக் கவனியுங்கள், இது ஒரு மெய்நிகர் முறையைக் குறிக்கிறது).
uk: ``get_dependencies()`` ResourceFormatLoader тепер ``_get_dependencies()`` (зверніть увагу на початок підкреслення, яке позначає віртуальний метод).

source: SceneTree's ``change_scene()`` is now ``change_scene_to_file()``.
ga: Is é ''change_scene()'' SceneTree anois ''change_scene_to_file()''.
pt_br: ``change_scene()`` do SceneTree agora é ``change_scene_to_file()``.
ru: Метод ``change_scene()`` у SceneTree теперь называется ``change_scene_to_file()``.
ta: SceseTree இன் `` Change_scene () `` இப்போது `` Change_scene_to_file () ``.
uk: ``change_scene()`` SceneTree тепер ``change_scene_to_file()``.

source: Shortcut's ``is_valid()`` is now ``has_valid_event()``.
ga: Is é ''is_valid()'' aicearra anois ''has_valid_event()''.
pt_br: O atalho ``is_valid()`` agora é ``has_valid_event()``.
ru: Метод ``is_valid()`` у Shortcut теперь называется ``has_valid_event()``.
ta: குறுக்குவழியின் `` is_valid () `` இப்போது `` has_valid_event () ``.
uk: Ярлик ``is_valid()`` тепер ``has_valid_event()``.

source: TileMap's ``world_to_map()`` is now ``local_to_map()``.
ga: Is é ''world_to_map()'' TileMap anois ''local_to_map()''.
pt_br: ``world_to_map()`` do TileMap agora é ``local_to_map()``.
ru: Метод ``world_to_map()`` у TileMap теперь называется ``local_to_map()``.
ta: Tilemap இன் `` world_to_map () `` இப்போது `` local_to_map () ``.
uk: ``world_to_map()`` TileMap тепер ``local_to_map()``.

source: TileMap's ``map_to_world()`` is now ``map_to_local()``.
ga: Is é ''map_to_world()'' TileMap anois ''map_to_local()''.
pt_br: ``map_to_world()`` do TileMap agora é ``map_to_local()``.
ru: Метод ``map_to_world()`` у TileMap теперь называется ``map_to_local()``.
ta: Tilemap இன் `` map_to_world () `` இப்போது `` MAP_TO_LOCAL () ``.
uk: ``map_to_world()`` TileMap тепер ``map_to_local()``.

source: Transform2D's ``xform()`` is ``mat * vec`` and ``xform_inv()`` is ``vec * mat``.
ga: Is é ''xform()'' transform2D ná ''mat * vec'' agus is é ''xform_inv()'' ''vec * mat''.
pt_br: ``xform()`` do Transform2D é ``mat * vec`` e ``xform_inv()`` é ``vec * mat``.
ru: У Transform2D методы ``xform()`` и ``xform_inv()`` возвращают соответственно ``mat * vec`` и ``vec * mat``.
ta: உருமாறும் 2D இன் `` xform () `` என்பது `` mat * vec`` மற்றும் `` xform_inv () `` என்பது `` vec * mat``.
uk: ``xform()`` Transform2D має значення ``mat * vec``, а ``xform_inv()`` є ``vec * mat``.

source: **Properties**
ga: **Airíonna**
ru: **Свойства**
ta: ** பண்புகள் **
uk: **Властивості**

source: If a property is listed here, its associated getter and setter methods must also be renamed manually if used in the project. For example, PathFollow2D and PathFollow3D's ``set_offset()`` and ``get_offset()`` must be renamed to ``set_progress()`` and ``get_progress()`` respectively.
ga: Má tá maoin liostaithe anseo, ní mór na modhanna getter agus socraitheora a bhaineann léi a athainmniú de láimh má úsáidtear iad sa tionscadal. Mar shampla, ní mór PathFollow2D agus PathFollow3D ''set_offset()'' agus ''get_offset()'' a athainmniú go ''set_progress()'' agus ''get_progress()'' faoi seach.
pt_br: Se uma propriedade estiver listada aqui, seus métodos getter e setter associados também deverão ser renomeados manualmente, se utilizados no projeto. Por exemplo, ``set_offset()`` e ``get_offset()`` de PathFollow2D e PathFollow3D devem ser renomeados para ``set_progress()`` e ``get_progress()``, respectivamente.
ru: Если свойство указано здесь, то ассоцированный геттер и сеттер должны быть переименованы в ручную в проекте. Например, у PathFollow2D и PathFollow3D методы ``set_offset()`` и ``get_offset()`` должны быть переименованы в ``set_progress()`` и ``get_progress()`` соответственно.
ta: ஒரு சொத்து இங்கே பட்டியலிடப்பட்டால், அதனுடன் தொடர்புடைய பெறுநர் மற்றும் செட்டர் முறைகள் திட்டத்தில் பயன்படுத்தப்பட்டால் கைமுறையாக மறுபெயரிடப்பட வேண்டும். எடுத்துக்காட்டாக, pathfollow2d மற்றும் pathfollow3d இன் `` set_offset () `` `மற்றும்` get_offset () `` `` set_progress () `` `மற்றும்` `get_progress ()` `` `` என்று மறுபெயரிடப்பட வேண்டும்.
uk: Якщо тут зазначено властивість, пов’язані з нею методи отримання та встановлення також потрібно перейменувати вручну, якщо вони використовуються в проекті. Наприклад, ``set_offset()`` і ``get_offset()`` PathFollow2D і PathFollow3D повинні бути перейменовані на ``set_progress()`` і ``get_progress()`` відповідно.

source: Control's ``margin`` is now ``offset``.
ga: Is é ''imeall'' an rialaithe anois ''fritháireamh''.
pt_br: A ``margem`` do Control agora é ``deslocamento``.
ru: Переменная ``margin`` теперь называется ``offset``.
ta: கட்டுப்பாட்டின் `` விளிம்பு`` இப்போது `` ஆஃப்செட்``.
uk: ``Поле`` елемента керування тепер ``зсув``.

source: Label's ``percent_visible`` is now ``visible_ratio``.
ga: Is é ''percent_visible'' an lipéid anois ''visible_ratio''.
pt_br: ``percent_visible`` do Label agora é ``visible_ratio``.
ru: Свойство ``percent_visible`` теперь называется ``visible_ratio``.
ta: லேபிளின் `` சதவீதம்_ விசிபிள்`` இப்போது `` தெரியும்_ரேட்டியோ``.
uk: ``percent_visible`` мітки тепер ``visible_ratio``.

source: MultiPlayerAPI's ``refuse_new_network_connections`` is now ``refuse_new_connections``.
ga: Is é ''refuse_new_network_connections'' multiPlayerAPI anois ''refuse_new_connections''.
pt_br: ``refuse_new_network_connections`` do MultiPlayerAPI agora é ``refuse_new_connections``.
ru: У MultiPlayerAPI ``refuse_new_network_connections`` теперь ``refuse_new_connections``.
ta: மல்டிபிளேராபியின் `` மறுப்பு_நியூ_நெட் வொர்க்_கான்னெக்சன்ச்` இப்போது `` மறுப்பு_நியூ_கோனெக்சன்ச்``.
uk: ``refuse_new_network_connections`` MultiPlayerAPI тепер ``refuse_new_connections``.
