Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/migrating/upgrading_to_godot_4.2.po
Languages: es, fr, ga, it, pt_br, ru, ta, tr, uk, zh_hant

source: Method ``rename_animation_library`` moved to base class ``AnimationMixer``
es: Método ``rename_animation_library`` movido a la clase base ``AnimationMixer``
fr: La méthode ``rename_animation_library`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''rename_animation_library'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``rename_animation_library`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``rename_animation_library`` movido para a classe base ``AnimationMixer``
ru: Метод ``rename_animation_library`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` மறுபெயரிடுதல்_அனிமேசன்_லிபிரரி`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``rename_animation_library`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``rename_animation_library`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``rename_animation_library`` 已移至基底類別 ``AnimationMixer``

source: Property ``reset_on_save`` moved to base class ``AnimationMixer``
es: Propiedad ``reset_on_save`` movida a la clase base ``AnimationMixer``
fr: La propriété ``reset_on_save`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Aistríodh an mhaoin ''reset_on_save'' go bunrang ''AnimationMixer''
it: La proprietà ``reset_on_save`` è stata spostata nella classe base ``AnimationMixer``
pt_br: Propriedade ``reset_on_save`` movida para a classe base ``AnimationMixer``
ru: Свойство ``reset_on_save`` перемещено в базовый класс ``AnimationMixer``
ta: சொத்து `` Reset_on_save`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``reset_on_save`` özelliği, ``AnimationMixer`` temel sınıfına taşındı
uk: Властивість ``reset_on_save`` перенесено до базового класу ``AnimationMixer``
zh_hant: 屬性 ``reset_on_save`` 已移至基底類別 ``AnimationMixer``

source: Property ``root_node`` moved to base class ``AnimationMixer``
es: Propiedad ``root_node`` movida a la clase base ``AnimationMixer``
fr: La propriété ``root_node`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Aistríodh maoin ''root_node'' go bunrang ''AnimationMixer''
it: La proprietà ``root_node`` è stata spostata nella classe base ``AnimationMixer``
pt_br: Propriedade ``root_node`` movida para a classe base ``AnimationMixer``
ru: Свойство ``root_node`` перемещено в базовый класс ``AnimationMixer``
ta: சொத்து `` ரூட்_நோட்`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``root_node`` özelliği, ``AnimationMixer`` temel sınıfına taşındı
uk: Властивість ``root_node`` переміщено до базового класу ``AnimationMixer``
zh_hant: 屬性 ``root_node`` 已移至基底類別 ``AnimationMixer``

source: Method ``set_reset_on_save_enabled`` moved to base class ``AnimationMixer``
es: Método ``set_reset_on_save_enabled`` movido a la clase base ``AnimationMixer``
fr: La méthode ``set_reset_on_save_enabled`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''set_reset_on_save_enabled'' go bunrang ''AnimationMixer''
it: Il metodo ``set_reset_on_save_enabled`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``set_reset_on_save_enabled`` movido para a classe base ``AnimationMixer``
ru: Метод ``set_reset_on_save_enabled`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` set_reset_on_save_enabled`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு நகர்த்தப்பட்டது
tr: ``set_reset_on_save_enabled`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``set_reset_on_save_enabled`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``set_reset_on_save_enabled`` 已移至基底類別 ``AnimationMixer``

source: Method ``seek`` adds a new ``update_only`` optional parameter
es: El método ``seek`` agrega un nuevo parámetro opcional ``update_only``
fr: La méthode ``seek`` ajoute un nouveau paramètre optionnel ``update_only``
ga: Cuireann an modh ''lorg'' paraiméadar roghnach nua ''update_only'' leis
it: Il metodo ``seek`` aggiunge un nuovo parametro facoltativo ``update_only``
pt_br: O método ``seek`` adiciona um novo parâmetro opcional ``update_only``
ru: Метод ``seek`` добавляет новый необязательный параметр ``update_only``
ta: முறை `` தேடல்` `புதிய` `Update_only`` விருப்ப அளவுருவைச் சேர்க்கிறது
tr: ``seek`` yöntemi, yeni bir ``update_only`` isteğe bağlı parametresi ekledi
uk: Метод ``seek`` додає новий необов’язковий параметр ``update_only``
zh_hant: 方法 ``seek`` 新增了 ``update_only`` 選用參數

source: **AnimationTree**
ga: **BeochanTree**
ta: ** அனிமேசன் ட்ரீ **
uk: **Дерево анімації**
zh_hant: **動畫樹（AnimationTree）**

source: Property ``active`` moved to base class ``AnimationMixer``
es: Propiedad ``active`` movida a la clase base ``AnimationMixer``
fr: La propriété ``active`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Aistríodh an mhaoin ''gníomhach'' go bunrang ''AnimationMixer''
it: La proprietà ``active`` è stata spostata nella classe base ``AnimationMixer``
pt_br: Propriedade ``active`` movida para a classe base ``AnimationMixer``
ru: Свойство ``active`` перемещено в базовый класс ``AnimationMixer``
ta: சொத்து `` செயலில்`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``active`` özelliği, ``AnimationMixer`` temel sınıfına taşındı
uk: Властивість ``active`` перенесено до базового класу ``AnimationMixer``
zh_hant: 屬性 ``active`` 已移至基底類別 ``AnimationMixer``

source: Method ``get_root_motion_position`` moved to base class ``AnimationMixer``
es: Método ``get_root_motion_position`` movido a la clase base ``AnimationMixer``
fr: La méthode ``get_root_motion_position`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''get_root_motion_position'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``get_root_motion_position`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``get_root_motion_position`` movido para a classe base ``AnimationMixer``
ru: Метод ``get_root_motion_position`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` get_root_motion_position`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``get_root_motion_position`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``get_root_motion_position`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``get_root_motion_position`` 已移至基底類別 ``AnimationMixer``

source: Method ``get_root_motion_position_accumulator`` moved to base class ``AnimationMixer``
es: Método ``get_root_motion_position_accumulator`` movido a la clase base ``AnimationMixer``
fr: La méthode ``get_root_motion_position_accumulator`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''get_root_motion_position_accumulator'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``get_root_motion_position_accumulator`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``get_root_motion_position_accumulator`` movido para a classe base ``AnimationMixer``
ru: Метод ``get_root_motion_position_accumulator`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` get_root_motion_position_accumulutar`` `` அனிமேசன்மிக்சர்`` க்கு நகர்த்தப்பட்டது
tr: ``get_root_motion_position_accumulator`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``get_root_motion_position_accumulator`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``get_root_motion_position_accumulator`` 已移至基底類別 ``AnimationMixer``

source: Method ``get_root_motion_rotation`` moved to base class ``AnimationMixer``
es: Método ``get_root_motion_rotation`` movido a la clase base ``AnimationMixer``
fr: La méthode ``get_root_motion_rotation`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''get_root_motion_rotation'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``get_root_motion_rotation`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``get_root_motion_rotation`` movido para a classe base ``AnimationMixer``
ru: Метод ``get_root_motion_rotation`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` get_root_motion_rotation`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``get_root_motion_rotation`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``get_root_motion_rotation`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``get_root_motion_rotation`` 已移至基底類別 ``AnimationMixer``

source: Method ``get_root_motion_rotation_accumulator`` moved to base class ``AnimationMixer``
es: Método ``get_root_motion_rotation_accumulator`` movido a la clase base ``AnimationMixer``
fr: La méthode ``get_root_motion_rotation_accumulator`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''get_root_motion_rotation_accumulator'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``get_root_motion_rotation_accumulator`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``get_root_motion_rotation_accumulator`` movido para a classe base ``AnimationMixer``
ru: Метод ``get_root_motion_rotation_accumulator`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` get_root_motion_rotation_accumulator`` `` அனிமேசன்மிக்சர்`` க்கு நகர்த்தப்பட்டது
tr: ``get_root_motion_rotation_accumulator`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``get_root_motion_rotation_accumulator`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``get_root_motion_rotation_accumulator`` 已移至基底類別 ``AnimationMixer``

source: Method ``get_root_motion_scale`` moved to base class ``AnimationMixer``
es: Método ``get_root_motion_scale`` movido a la clase base ``AnimationMixer``
fr: La méthode ``get_root_motion_scale`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''get_root_motion_scale'' go bunrang ''AnimationMixer''
it: Il metodo ``get_root_motion_scale`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``get_root_motion_scale`` movido para a classe base ``AnimationMixer``
ru: Метод ``get_root_motion_scale`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` get_root_motion_scale`` `` அனிமேசன்மிக்சர்`` க்கு நகர்த்தப்பட்டது
tr: ``get_root_motion_scale`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``get_root_motion_scale`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``get_root_motion_scale`` 已移至基底類別 ``AnimationMixer``

source: Method ``get_root_motion_scale_accumulator`` moved to base class ``AnimationMixer``
es: Método ``get_root_motion_scale_accumulator`` movido a la clase base ``AnimationMixer``
fr: La méthode ``get_root_motion_scale_accumulator`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Athraíodh an modh ''get_root_motion_scale_accumulator'' go dtí an bunrang ''AnimationMixer''
it: Il metodo ``get_root_motion_scale_accumulator`` è stato spostato nella classe base ``AnimationMixer``
pt_br: Método ``get_root_motion_scale_accumulator`` movido para a classe base ``AnimationMixer``
ru: Метод ``get_root_motion_scale_accumulator`` перенесен в базовый класс ``AnimationMixer``
ta: முறை `` get_root_motion_scale_accumulator`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு நகர்த்தப்பட்டது
tr: ``get_root_motion_scale_accumulator`` yöntemi, ``AnimationMixer`` temel sınıfına taşındı
uk: Метод ``get_root_motion_scale_accumulator`` перенесено в базовий клас ``AnimationMixer``
zh_hant: 方法 ``get_root_motion_scale_accumulator`` 已移至基底類別 ``AnimationMixer``

source: Property ``process_callback`` renamed to ``callback_mode_process`` and moved to base class ``AnimationMixer``
es: La propiedad ``process_callback`` renombrada a ``callback_mode_process`` y movida a la clase base ``AnimationMixer``
fr: La propriété ``process_callback``` a été renommée ``callback_mode_process`` et déplacée dans la classe parente ``AnimationMixer``
ga: Athainmníodh maoin ''process_callback'' go ''callback_mode_process'' agus bhog sé go dtí an bunrang ''AnimationMixer''
it: La proprietà ``process_callback`` è stata rinominata in ``callback_mode_process`` e spostata nella classe base ``AnimationMixer``
pt_br: Propriedade ``process_callback`` renomeada para ``callback_mode_process`` e movida para a classe base ``AnimationMixer``
ru: Свойство ``process_callback`` переименовано в ``callback_mode_process`` и перемещено в базовый класс ``AnimationMixer``
ta: சொத்து `` process_callback``` `` galpback_mode_process`` என மறுபெயரிடப்பட்டு அடிப்படை வகுப்பிற்கு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``process_callback`` özelliği, ``callback_mode_process`` olarak yeniden adlandırıldı ve ``AnimationMixer`` temel sınıfına taşındı
uk: Властивість ``process_callback`` перейменовано на ``callback_mode_process`` і переміщено до базового класу ``AnimationMixer``
zh_hant: 屬性 ``process_callback`` 已更名為 ``callback_mode_process``，並移至基底類別 ``AnimationMixer``

source: Property ``root_motion_track`` moved to base class ``AnimationMixer``
es: Propiedad ``root_motion_track`` movido a la clase base ``AnimationMixer``
fr: La propriété ``root_motion_track`` a été déplacée dans la classe parente ``AnimationMixer``
ga: Aistríodh maoin ''root_motion_track'' go bunrang ''AnimationMixer''
it: La proprietà ``root_motion_track`` è stata spostata nella classe base ``AnimationMixer``
pt_br: Propriedade ``root_motion_track`` movida para a classe base ``AnimationMixer``
ru: Свойство ``root_motion_track`` перемещено в базовый класс ``AnimationMixer``
ta: சொத்து `` ரூட்_மோசன்_டிராக்`` அடிப்படை வகுப்பு `` அனிமேசன்மிக்சர்`` க்கு மாற்றப்பட்டது
tr: ``root_motion_track`` özelliği, ``AnimationMixer`` temel sınıfına taşındı
uk: Властивість ``root_motion_track`` переміщено до базового класу ``AnimationMixer``
zh_hant: 屬性 ``root_motion_track`` 已移至基底類別 ``AnimationMixer``

source: Property ``tree_root`` changes type from ``AnimationNode`` to ``AnimationRootNode``
es: Propiedad ``tree_root`` cambia el tipo de ``AnimationNode`` a ``AnimationRootNode``
fr: La propriété ``tree_root`` change de type de ``AnimationNode`` à ``AnimationRootNode``
ga: Athraíonn maoin ''tree_root'' cineál ó ''AnimationNode'' go ''AnimationRootNode''
it: La proprietà ``tree_root`` cambia tipo da ``AnimationNode`` a ``AnimationRootNode``
pt_br: A propriedade ``tree_root`` altera o tipo de ``AnimationNode`` para ``AnimationRootNode``
ru: Свойство ``tree_root`` меняет тип с ``AnimationNode`` на ``AnimationRootNode``
ta: சொத்து `` மரம்_ரூட்`` மாற்றங்களை `` அனிமேசன்நோட்`` `` அனிமேசன்ரூட்னோட்`` வரை மாற்றுகிறது
tr: ``tree_root`` özelliğinin tipi, ``AnimationNode`` yerine ``AnimationRootNode`` olarak değiştirildi
uk: Властивість ``tree_root`` змінює тип з ``AnimationNode`` на ``AnimationRootNode``
zh_hant: 屬性 ``tree_root`` 型別由 ``AnimationNode`` 改為 ``AnimationRootNode``

source: GUI nodes
es: Nodos GUI
fr: Nœuds GUI
ga: Nóid gui
it: Nodi GUI
ru: GUI узлы
ta: குய் முனைகள்
tr: GUI düğümleri
uk: Вузли GUI
zh_hant: 建立節點

source: **PopupMenu**
ga: **PopMenu**
ru: **Всплывающее меню**
ta: ** சப்மென்ட் **
uk: **Спливаюче меню**
zh_hant: **彈出選單（PopupMenu）**

source: Method ``add_icon_shortcut`` adds a new ``allow_echo`` optional parameter
es: Método ``add_icon_shortcut`` agrega un nuevo parámetro opcional ``allow_echo``
fr: La méthode ``add_icon_shortcut`` ajoute un nouveau paramètre optionnel ``allow_echo``
ga: Cuireann an modh ''add_icon_shortcut'' paraiméadar roghnach nua ''allow_echo'' leis
it: Il metodo ``add_icon_shortcut`` aggiunge un nuovo parametro facoltativo ``allow_echo``
pt_br: O método ``add_icon_shortcut`` adiciona um novo parâmetro opcional ``allow_echo``
ru: Метод ``add_icon_shortcut`` добавляет новый необязательный параметр ``allow_echo``
ta: முறை `` add_icon_shortcut`` புதிய `` Allow_echo`` விருப்ப அளவுருவைச் சேர்க்கிறது
tr: ``add_icon_shortcut`` yöntemi, yeni bir ``allow_echo`` isteğe bağlı parametresi ekledi
uk: Метод ``add_icon_shortcut`` додає новий необов’язковий параметр ``allow_echo``
zh_hant: 方法 ``add_icon_shortcut`` 新增了 ``allow_echo`` 選用參數

source: Method ``add_shortcut`` adds a new ``allow_echo`` optional parameter
es: Método ``add_shortcut`` agrega un nuevo parámetro opcional ``allow_echo``
fr: La méthode ``add_shortcut`` ajoute un nouveau paramètre optionnel ``allow_echo``
ga: Cuireann an modh ''add_shortcut'' paraiméadar roghnach nua ''allow_echo'' leis
it: Il metodo ``add_shortcut`` aggiunge un nuovo parametro facoltativo ``allow_echo``
pt_br: O método ``add_shortcut`` adiciona um novo parâmetro opcional ``allow_echo``
ru: Метод ``add_shortcut`` добавляет новый необязательный параметр ``allow_echo``
ta: முறை `` add_shortcut`` புதிய `` Allow_echo`` விருப்ப அளவுருவைச் சேர்க்கிறது
tr: ``add_shortcut`` yöntemi, yeni bir ``allow_echo`` isteğe bağlı parametresi ekledi
uk: Метод ``add_shortcut`` додає новий необов'язковий параметр ``allow_echo``
zh_hant: 方法 ``add_shortcut`` 新增了 ``allow_echo`` 選用參數

source: Method ``clear`` adds a new ``free_submenus`` optional parameter
es: Método ``clear`` añade nuevo parámetro opcional ``free_submenus``
fr: La méthode ``clear`` ajoute un nouveau paramètre optionnel ``free_submenus``
ga: Cuireann an modh ''soiléir'' paraiméadar roghnach nua ''free_submenus'' leis
it: Il metodo ``clear`` aggiunge un nuovo parametro facoltativo ``free_submenus``
pt_br: O método ``clear`` adiciona um novo parâmetro opcional ``free_submenus``
ru: Метод ``clear`` добавляет новый необязательный параметр ``free_submenus``
ta: முறை `` தெளிவான`` புதிய `` free_submenus`` விருப்ப அளவுருவைச் சேர்க்கிறது
tr: ``clear`` yöntemi, yeni bir ``free_submenus`` isteğe bağlı parametresi ekledi
uk: Метод ``clear`` додає новий необов’язковий параметр ``free_submenus``
zh_hant: 方法 ``clear`` 新增了 ``free_submenus`` 選用參數

source: Method ``add_image`` adds new ``key``, ``pad``, ``tooltip``, and ``size_in_percent`` optional parameters
es: Método ``add_image`` agrega nuevos parámetros opcionales ``key``, ``pad``, ``tooltip``, y ``size_in_percent``
fr: La méthode ``add_image`` ajoute les paramètres optionnels ``key``, ``pad``, ``tooltip`` et ``size_in_percent``
ga: Cuireann an modh ''add_image'' paraiméadair roghnacha nua ''eochair'', ''pad'', ''tooltip'', agus ''size_in_percent'' leis
it: Il metodo ``add_image`` aggiunge nuovi parametri facoltativi ``key``, ``pad``, ``tooltip`` e ``size_in_percent``
pt_br: Adicionados novos parâmetros opcionais ``key``, ``pad``, ``tooltip`` e ``size_in_percent`` ao método ``add_image``
ru: Метод ``add_image`` добавляет новые необязательные параметры ``key``, ``pad``, ``tooltip`` и ``size_in_percent``
ta: முறை `` Add_image`` புதிய `` key``, `` pad``, `` கருவிப்பட்டியல்``, மற்றும் `` size_in_percent` விருப்ப அளவுருக்கள்
tr: ``add_image`` yöntemi, yeni ``key``, ``pad``, ``tooltip`` ve ``size_in_percent`` isteğe bağlı parametrelerini ekledi
uk: Метод ``add_image`` додає нові додаткові параметри ``key``, ``pad``, ``tooltip`` і ``size_in_percent``
zh_hant: 方法 ``add_image`` 新增了 ``key``、``pad``、``tooltip`` 與 ``size_in_percent`` 選用參數

source: Rendering
es: Renderizado
fr: Rendu
ga: Rindreáil
it: Renderer
pt_br: Renderização
ru: Отрисовка
ta: வழங்குதல்
tr: İşleme
uk: Рендеринг
zh_hant: 算繪

source: **ImporterMesh**
ga: **Allmhairitheoirí**
ta: ** இறக்குமதியாளர் **
uk: **Імпортер сітки**
zh_hant: **匯入網格（ImporterMesh）**

source: Method ``add_surface`` changes ``flags`` parameter type from ``uint32`` to ``uint64``
es: Método ``add_surface`` cambia el tipo del parámetro ``flags`` de ``uint32`` a ``uint64``
fr: La méthode ``add_surface`` change le type de paramètre ``flags`` de ``uint32`` à ``uint64``
ga: Athraíonn an modh ''add_surface'' cineál paraiméadair ''bratacha'' ó ''uint32'' go ''uint64''
it: Il metodo ``add_surface`` cambia il tipo del parametro ``flags`` da ``uint32`` a ``uint64``
pt_br: Alterado o tipo do parâmetro ``flags`` do método ``add_surface`` de ``uint32`` para ``uint64``
ru: Метод ``add_surface`` изменяет тип параметра ``flags`` с ``uint32`` на ``uint64``
ta: முறை `` add_surface``` `` கொடிகள்` `அளவுரு வகையை` `uint32`` இலிருந்து` `uint64`` க்கு மாற்றுகிறது
tr: ``add_surface`` yöntemi, ``flags`` parametre tipini ``uint32`` yerine ``uint64`` olarak değiştirdi
uk: Метод ``add_surface`` змінює тип параметра ``flags`` з ``uint32`` на ``uint64``
zh_hant: 方法 ``add_surface`` 的 ``flags`` 參數型別由 ``uint32`` 改為 ``uint64``

source: Method ``get_surface_format`` changes return type from ``uint32`` to ``uint64``
es: Método ``get_surface_format`` cambia el tipo de retorno de ``uint32`` a ``uint64``
fr: La méthode ``get_surface_format`` change de type de retour de ``uint32`` à ``uint64``
ga: Athraíonn an modh ''get_surface_format'' an cineál fillte ó ''uint32'' go ''uint64''
it: Il metodo ``get_surface_format`` cambia il tipo restituito da ``uint32`` a ``uint64``
pt_br: Alterado o tipo de retorno do método ``get_surface_format`` de ``uint32`` para ``uint64``
ru: Метод ``get_surface_format`` изменяет тип возвращаемого значения с ``uint32`` на ``uint64``
ta: முறை `` get_surface_format`` மாற்றும் வகையை `` uint32`` இலிருந்து `` uint64`` க்கு மாற்றுகிறது
tr: ``get_surface_format`` yöntemi, dönüş tipini ``uint32`` yerine ``uint64`` olarak değiştirdi
uk: Метод ``get_surface_format`` змінює тип повернення з ``uint32`` на ``uint64``
zh_hant: 方法 ``get_surface_format`` 的回傳型別由 ``uint32`` 改為 ``uint64``

source: **MeshDataTool**
ga: **MogalraDataTool**
uk: **Інструмент даних сітки**
zh_hant: **網格資料工具（MeshDataTool）**

source: Method ``commit_to_surface`` adds a new ``compression_flags`` optional parameter
es: Método ``commit_to_surface`` agrega un nuevo parámetro opcional ``compression_flags``
fr: La méthode ``commit_to_surface`` ajoute un nouveau paramètre optionnel ``compression_flags``
ga: Cuireann an modh ''commit_to_surface'' paraiméadar roghnach nua ''compression_flags'' leis
it: Il metodo ``commit_to_surface`` aggiunge un nuovo parametro facoltativo ``compression_flags``
pt_br: Adicionado novo parâmetro opcional ``compression_flags`` ao método ``commit_to_surface``
ru: Метод ``commit_to_surface`` добавляет новый необязательный параметр ``compression_flags``
ta: முறை `` COMMITAL_TO_SURFACE`` புதிய `` சுருக்க_ஃப்ளாக்ச்`` விருப்ப அளவுருவைச் சேர்க்கிறது
tr: ``commit_to_surface`` yöntemi, yeni bir ``compression_flags`` isteğe bağlı parametresi ekledi
uk: Метод ``commit_to_surface`` додає новий необов'язковий параметр ``compression_flags``
zh_hant: 方法 ``commit_to_surface`` 新增了 ``compression_flags`` 選用參數

source: Method ``get_format`` changes return type from ``uint32`` to ``uint64``
es: Método ``get_format``cambia el tipo de retorno de ``uint32`` a ``uint64``
fr: La méthode ``get_format`` change de type de retour de ``uint32`` à ``uint64``
ga: Athraíonn an modh ''get_format'' an cineál fillte ó ''uint32'' go ''uint64''
it: Il metodo ``get_format`` cambia il tipo restituito da ``uint32`` a ``uint64``
pt_br: Alterado o tipo de retorno do método ``get_format`` de ``uint32`` para ``uint64``
ru: Метод ``get_format`` изменяет тип возвращаемого значения с ``uint32`` на ``uint64``
ta: முறை `` get_format`` மாற்ற வகை `` UINT32`` இலிருந்து `` uint64``
tr: ``get_format`` yöntemi, dönüş türünü ``uint32`` yerine ``uint64`` olarak değiştirdi
uk: Метод ``get_format`` змінює тип повернення з ``uint32`` на ``uint64``
zh_hant: 方法 ``get_format`` 的回傳型別由 ``uint32`` 改為 ``uint64``

source: **RenderingDevice**
ga: **RindreáilDevice**
ta: ** வழங்குதல் டெவிச் **
zh_hant: 算繪
