Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/basic_xr_locomotion.po
Languages: fr, ga, ko, ru, ta, uk, zh_hans, zh_hant

source: Basic XR Locomotion
fr: Locomotion en XR basique
ga: Gluaisteacht Bunúsach XR
ko: 기본 XR 로코모션
ru: Базовая XR-передвижка
ta: அடிப்படை எக்ச்ஆர் லோகோமோசன்
uk: Базовий XR Locomotion
zh_hans: 基础 XR 运动
zh_hant: 基礎 XR 移動

source: For basic locomotion we're going to continue using our Godot XR Tools library. The library contains both basic movement features as more advanced features.
fr: Pour la locomotion de base, nous allons continuer à utiliser notre bibliothèque Godot XR Tools. La bibliothèque contient à la fois des fonctionnalités de mouvement de base et des fonctionnalités plus avancées.
ga: Le haghaidh gluaiseacht bhunúsach táimid chun leanúint ar aghaidh ag úsáid ár leabharlann Godot XR Tools. Tá an dá ghné ghluaiseachta bunúsacha sa leabharlann mar ghnéithe níos airde.
ko: 기본적인 로코모션 구현을 위해 Godot XR 도구 라이브러리를 사용해 보겠습니다. 라이브러리에는 기본적인 이동 기능 및 고급 기능들이 포함되어 있습니다.
ru: Для базовых функций передвижения мы продолжим использовать нашу библиотеку Godot XR Tools. Она содержит как базовые функции движения, так и более продвинутые.
ta: அடிப்படை லோகோமோசனுக்காக நாங்கள் எங்கள் கோடோட் எக்ச்ஆர் கருவிகள் நூலகத்தை தொடர்ந்து பயன்படுத்தப்போகிறோம். நூலகத்தில் அடிப்படை இயக்கம் நற்பொருத்தங்கள் இரண்டையும் மிகவும் மேம்பட்ட அம்சங்களாகக் கொண்டுள்ளன.
uk: Для базового пересування ми продовжуватимемо використовувати нашу бібліотеку інструментів Godot XR. Бібліотека містить як основні функції руху, так і більш розширені функції.
zh_hans: 对于基本运动，我们将继续使用 Godot XR 工具库。该库既包含基本运动功能，也包含更高级的功能。
zh_hant: 在基礎移動方面，我們會持續使用 Godot XR Tools 工具庫。這個工具庫同時包含基礎移動功能與進階功能。

source: Adding our player body
fr: Ajouter le corps de notre joueur
ga: Ag cur ár gcorp imreoir
ko: 플레이어 몸체 추가
ru: Добавляем тело игрока
ta: எங்கள் பிளேயர் உடலைச் சேர்ப்பது
uk: Додаємо тіло гравця
zh_hans: 添加玩家的身体
zh_hant: 新增玩家本體

source: The first step we need to do is to add a helper node to our :ref:`XROrigin3D <class_xrorigin3d>` node. Because XR supports roomscale tracking you can't simply add your XR setup to a :ref:`CharacterBody3D <class_characterbody3d>` node and expect things to work. You will run into trouble when the user moves around their physical space and is no longer standing in the center of their room. Godot XR Tools embeds the needed logic into a helper node called ``PlayerBody``.
fr: La première étape que nous devons faire est d'ajouter un nœud d'aide à notre nœud :ref:`XROrigin3D <class_xrorigin3d>`. Parce que la XR prend en charge le suivi à l'échelle de la pièce, vous ne pouvez pas simplement ajouter votre installation XR à un nœud :ref:`CharacterBody3D <class_characterbody3d>` et vous attendre à ce que les choses fonctionnent. Vous aurez des problèmes lorsque l'utilisateur se déplace dans son espace physique et n'est plus debout au centre de sa pièce. Godot XR Tools incorpore la logique nécessaire dans un nœud d'aide appelé ``PlayerBody``.
ga: Is é an chéad chéim nach mór dúinn a dhéanamh ná nód cabhrach a chur lenár nód :ref:`XROrigin3D <class_xrorigin3d>`. Toisc go dtacaíonn XR le rianú seomrascála ní féidir leat do shocrú XR a chur le nód :ref:`CharacterBody3D <class_characterbody3d>` agus bí ag súil go n-oibreoidh rudaí. Rachaidh tú i dtrioblóid nuair a ghluaiseann an t-úsáideoir thart ar a spás fisiciúil agus nach bhfuil sé ina sheasamh i lár an tseomra a thuilleadh. Leabaíonn Godot XR Tools an loighic atá ag teastáil isteach i nód cabhrach ar a dtugtar ``PlayerBody``.
ko: 먼저 해야 할 것은 :ref:`XROrigin3D <class_xrorigin3d>` 노드에 헬퍼 노드를 추가하는 것입니다. XR은 룸스케일 트래킹을 지원하기 때문에 단순히 XR 설정들을 :ref:`CharacterBody3D <class_characterbody3d>` 노드에 추가한다고 동작하지는 않습니다. 유저가 현실 공간에서 돌아다녀서 방 가운에 있지 않게 되면 문제가 생기게 됩니다. Godot XR 도구에서는 이러한 상황에 필요한 로직을 ``PlayerBody`` 라는 헬퍼 노드에 추가해 두었습니다.
ru: Первый шаг — добавить вспомогательный узел к нашему узлу :ref:`XROrigin3D <class_xrorigin3d>`. Поскольку XR поддерживает отслеживание в масштабе комнаты, вы не можете просто добавить настройку XR к узлу :ref:`CharacterBody3D <class_characterbody3d>` и ожидать, что всё заработает. Вы столкнётесь с проблемами, когда пользователь переместится в своём физическом пространстве и перестанет стоять в центре комнаты. Godot XR Tools встраивает необходимую логику во вспомогательный узел ``PlayerBody``.
ta: நாம் செய்ய வேண்டிய முதல் படி எங்கள்: ref: `xrorigin3d <class_xrorigin3d>` முனை. எக்ச்ஆர் ரூம்ச்கேல் கண்காணிப்பை ஆதரிப்பதால், உங்கள் எக்ச்ஆர் அமைப்பை ஒரு சேர்க்க முடியாது: ref: `reatorbody3d <class_charactobody3d>` முனை மற்றும் விசயங்கள் செயல்படும் என்று எதிர்பார்க்கலாம். பயனர் தங்கள் ப இடைவெளி தீக இடத்தை சுற்றி நகரும்போது நீங்கள் சிக்கலில் சிக்கிக் கொள்வீர்கள், இனி அவர்களின் அறையின் மையத்தில் நிற்க மாட்டீர்கள். கோடோட் எக்ச்ஆர் கருவிகள் தேவையான தர்க்கத்தை `` பிளேயர் பாடி`` எனப்படும் உதவி முனையில் உட்பொதிக்கின்றன.
uk: Перший крок, який нам потрібно зробити, це додати допоміжний вузол до нашого вузла :ref:`XROrigin3D <class_xrorigin3d>`. Оскільки XR підтримує відстеження масштабу приміщення, ви не можете просто додати налаштування XR до вузла :ref:`CharacterBody3D <class_characterbody3d>` і очікувати, що все працюватиме. Ви зіткнетеся з проблемами, коли користувач пересувається своїм фізичним простором і більше не стоїть у центрі своєї кімнати. Godot XR Tools вбудовує необхідну логіку в допоміжний вузол під назвою ``PlayerBody``.
zh_hant: 第一步是為 :ref:`XROrigin3D <class_xrorigin3d>` 節點新增一個輔助節點。由於 XR 支援 Roomscale 空間定位，你不能直接將 XR 設定掛載在 :ref:`CharacterBody3D <class_characterbody3d>` 節點並期待一切正常運作。當使用者在現實空間中移動，不再站在房間中心時，這將導致問題。Godot XR Tools 已將所需邏輯封裝於一個名為 ``PlayerBody`` 的輔助節點。

source: Select your :ref:`XROrigin3D <class_xrorigin3d>` node and click on the :button:`Instantiate Child Scene` button to add a child scene. Select ``addons/godot-xr-tools/player/player_body.tscn`` and add this node.
ru: Выберите узел :ref:`XROrigin3D <class_xrorigin3d>` и нажмите кнопку :button:`Instantiate Child Scene`, чтобы добавить дочернюю сцену. Выберите ``addons/godot-xr-tools/player/player_body.tscn`` и добавьте этот узел.
uk: Виберіть вузол :ref:`XROrigin3D <class_xrorigin3d>` і натисніть кнопку :button:`Instantiate Child Scene`, щоб додати дочірню сцену. Виберіть ``addons/godot-xr-tools/player/player_body.tscn`` і додайте цей вузол.
zh_hant: 選取 :ref:`XROrigin3D <class_xrorigin3d>` 節點，點擊 :button:`Instantiate Child Scene` 來加入子場景。選擇 ``addons/godot-xr-tools/player/player_body.tscn``，並新增這個節點。

source: Adding a floor
fr: Ajouter un sol
ga: Urlár a chur leis
ko: 바닥 추가하기
ru: Добавление этажа
ta: ஒரு தளத்தைச் சேர்ப்பது
uk: Додавання поверху
zh_hans: 添加地板
zh_hant: 新增地板

source: This node governs the in game movement of your character and will immediately react to gravity. So to prevent our player from infinitely falling down we'll quickly add a floor to our scene.
fr: Ce nœud régit le mouvement de votre personnage dans le jeu et réagira immédiatement à la gravité. Pour empêcher notre joueur de tomber infiniment, nous allons ajouter rapidement un sol à notre scène.
ga: Rialaíonn an nód seo gluaiseacht cluiche do charachtair agus freagróidh sé láithreach don domhantarraingt. Mar sin chun ár n-imreoir a chosc ó thitim síos gan teorainn cuirfimid urlár lenár radharc go tapa.
ko: 이 노드가 게임에서의 캐릭터 이동에 영향을 주며 중력에 반응할 것입니다. 따라서 플레이어가 끝없이 추락하는 것을 방지하기 위해서는 씬에 바닥을 추가해야 합니다.
ru: Этот узел управляет движением вашего персонажа в игре и мгновенно реагирует на гравитацию. Поэтому, чтобы предотвратить бесконечное падение игрока, мы быстро добавим к сцене пол.
ta: இந்த முனை உங்கள் கதாபாத்திரத்தின் விளையாட்டு இயக்கத்தை நிர்வகிக்கிறது, உடனடியாக ஈர்ப்பு விசைக்கு வினைபுரியும். எனவே எங்கள் வீரர் எல்லையற்ற கீழே விழுவதைத் தடுக்க, எங்கள் காட்சியில் ஒரு தளத்தை விரைவாகச் சேர்ப்போம்.
uk: Цей вузол керує рухом вашого персонажа в грі та негайно реагує на гравітацію. Отже, щоб запобігти нескінченному падінню нашого гравця, ми швидко додамо підлогу до нашої сцени.
zh_hans: 该节点控制角色在游戏中的移动，并会立即对重力做出反应。因此，为了防止玩家无限下坠，我们将在场景中快速添加一个地板。
zh_hant: 這個節點負責角色在遊戲內的移動，並會即時受到重力影響。為了防止玩家角色無限墜落，我們要在場景中快速新增一個地板。

source: We start by adding a :ref:`StaticBody3D <class_staticbody3d>` node to our root node and we rename this to ``Floor``. We add a :ref:`MeshInstance3D <class_meshinstance3d>` node as a child node for our ``Floor``. Then create a new :ref:`PlaneMesh <class_planemesh>` as its mesh. For now we set the size of the mesh to 100 x 100 meters. Next we add a :ref:`CollisionShape3D <class_collisionshape3d>` node as a child node for our ``Floor``. Then create a ``BoxShape`` as our shape. We set the size of this box shape to 100 x 1 x 100 meters. We also need to move our collision shape down by 0.5 meters so the top of our box is flush with the floor.
ru: Начнем с добавления узла :ref:`StaticBody3D <class_staticbody3d>` к нашему корневому узлу и переименуем его в ``Floor``. Мы добавляем узел :ref:`MeshInstance3D <class_meshinstance3d>` в качестве дочернего узла для нашего ``Floor``. Затем создаем новый :ref:`PlaneMesh <class_planemesh>` в качестве его сетки. На данный момент мы устанавливаем размер сетки 100 x 100 метров. Затем мы добавляем узел :ref:`CollisionShape3D <class_collisionshape3d>` в качестве дочернего узла для нашего ``Floor``. Затем создаем ``BoxShape`` в качестве нашей формы. Мы устанавливаем размер этой формы коробки 100 x 1 x 100 метров. Нам также нужно переместить нашу форму столкновения вниз на 0,5 метра, чтобы верх нашего ящика был вровень с полом.
uk: Почнемо з додавання вузла :ref:`StaticBody3D <class_staticbody3d>` до нашого кореневого вузла та перейменуємо його на ``Floor``. Додамо вузол :ref:`MeshInstance3D <class_meshinstance3d>` як дочірній вузол для нашого ``Floor``. Потім створимо новий :ref:`PlaneMesh <class_planemesh>` як його сітку. Наразі ми встановлюємо розмір сітки на 100 x 100 метрів. Далі ми додаємо вузол :ref:`CollisionShape3D <class_collisionshape3d>` як дочірній вузол для нашого ``Floor``. Потім створимо ``BoxShape`` як нашу фігуру. Ми встановлюємо розмір цієї фігури прямокутника на 100 x 1 x 100 метрів. Нам також потрібно змістити нашу фігуру зіткнення вниз на 0,5 метра, щоб верх нашого прямокутника був на одному рівні з підлогою.
zh_hant: 首先，在根節點下新增一個 :ref:`StaticBody3D <class_staticbody3d>`，並將其重新命名為 ``Floor``。接著為 ``Floor`` 新增一個 :ref:`MeshInstance3D <class_meshinstance3d>` 子節點，再將其網格（mesh）設為新的 :ref:`PlaneMesh <class_planemesh>`。目前設定網格尺寸為 100 x 100 公尺。然後再為 ``Floor`` 新增一個 :ref:`CollisionShape3D <class_collisionshape3d>` 子節點，並指定形狀為 ``BoxShape``。將盒形尺寸設定為 100 x 1 x 100 公尺，並把碰撞形狀下移 0.5 公尺，讓盒子的頂部與地板齊平。

source: To make it easier to see that we're actually moving around our world, a white floor isn't going to do it. Create a texture using `Wahooneys excellent free texture generator <https://wahooney.itch.io/texture-grid-generator>`_. Once you've created the texture add it to your project. Then create a new material for the MeshInstance3D node, add your texture as the albedo, and enable **Triplaner** under **UV1** in the material properties.
ru: Чтобы было проще увидеть, что мы действительно движемся по миру, белый пол не подойдёт. Создайте текстуру с помощью `отличного бесплатного генератора текстур Wahooney <https://wahooney.itch.io/texture-grid-generator>`_. После создания текстуры добавьте её в свой проект. Затем создайте новый материал для узла MeshInstance3D, добавьте текстуру в качестве альбедо и включите **Triplaner** в **UV1** в свойствах материала.
uk: Щоб було легше побачити, що ми насправді рухаємося по нашому світу, білої підлоги тут не буде. Створіть текстуру за допомогою `чудового безкоштовного генератора текстур Wahooneys <https://wahooney.itch.io/texture-grid-generator>`_. Після створення текстури додайте її до свого проєкту. Потім створіть новий матеріал для вузла MeshInstance3D, додайте свою текстуру як альбедо та увімкніть **Triplaner** у розділі **UV1** у властивостях матеріалу.
zh_hant: 為了更容易看出我們真的在世界中移動，純白色地板不太夠。可以使用 `Wahooney 的免費貼圖產生器 <https://wahooney.itch.io/texture-grid-generator>`_ 建立一張貼圖。建立完成後將它加入你的專案。接著為 MeshInstance3D 節點建立一個新材質，將你的貼圖設為 albedo，並在材質屬性的 **UV1** 底下啟用 **Triplaner**。

source: Direct movement
fr: Mouvement direct
ga: Gluaiseacht díreach
ko: 직접 이동
ru: Прямое движение
ta: நேரடி இயக்கம்
uk: Прямий рух
zh_hans: 直接移动
zh_hant: 直接移動

source: We're going to start adding some basic direct movement to our setup. This allows the user to move through the virtual world using joystick input.
fr: Nous allons commencer par ajouter un mouvement direct de base à notre setup. Cela permet à l'utilisateur de se déplacer dans le monde virtuel en utilisant l'entrée du joystick.
ga: Táimid chun tosú ag cur roinnt gluaiseacht dhíreach bunúsach lenár socrú. Ligeann sé seo don úsáideoir bogadh tríd an domhan fíorúil ag baint úsáide as ionchur seomra.
ko: 기본적인 직접 이동 방식을 먼저 설정해 보겠습니다. 이는 조이스틱 입력으로 이동하는 방식입니다.
ru: Мы начнём добавлять в нашу систему базовые функции прямого перемещения. Это позволит пользователю перемещаться по виртуальному миру, используя джойстик.
ta: எங்கள் அமைப்பில் சில அடிப்படை நேரடி இயக்கத்தை சேர்க்கத் தொடங்க உள்ளோம். இது சாய்ச்டிக் உள்ளீட்டைப் பயன்படுத்தி மெய்நிகர் உலகில் செல்ல பயனரை அனுமதிக்கிறது.
uk: Ми збираємося почати додавати базові прямі рухи до нашої установки. Це дозволяє користувачеві переміщатися віртуальним світом за допомогою джойстика.
zh_hans: 我们将开始在我们的设置中添加一些基本的直接运动。这允许用户使用摇杆输入在虚拟世界中移动。
zh_hant: 接下來我們要在專案中加入基本的「直接移動」功能，讓使用者可透過搖桿在虛擬世界中移動。

source: It is important to note that moving through the virtual world while the player is standing still in the real world, can be nausea inducing especially for players who are new to VR. The default settings on our movement functions are fairly conservative. We advise you to stick to these defaults but offer features in game to enable less comfortable settings for more experienced users who are used to playing VR games.
fr: Il est important de noter que le déplacement dans le monde virtuel pendant que le joueur se tient immobile dans le monde réel peut rendre nauséeux, particulièrement pour les joueurs qui sont nouveaux à la RV. Les paramètres par défaut de nos fonctions de mouvement sont assez conservateurs. Nous vous conseillons de coller à ces défauts, mais d'offrir des fonctionnalités en pour activer des paramètres moins confortables pour les utilisateurs plus expérimentés qui sont habitués à jouer aux jeux en RV.
ga: Tá sé tábhachtach a thabhairt faoi deara gur féidir le bogadh tríd an domhan fíorúil agus an t-imreoir ag seasamh go fóill sa saol fíor, a spreagadh masc go háirithe d'imreoirí atá nua do VR. Tá na socruithe réamhshocraithe ar ár bhfeidhmeanna gluaiseachta coimeádaithe Moltar duit cloí leis na réamhshocruithe seo ach gnéithe a thairiscint sa chluiche chun socruithe nach bhfuil chompordach chomh compordach a chumasú d'úsáideoirí a bhfuil taithí acu ar chluichí VR a imirt.
ko: 현실 세계에서는 가만히 서 있는데 가상 공간에서는 이동하는 것은 멀미를 유발할 수 있고, 특히나 VR을 처음 사용하는 사람에게는 더 그렇습니다. 우리의 이동 기능은 기본적으로 꽤 보수적으로 설정되어 있습니다. 따라서 여러분도 기본값을 사용하길 권장 드리지만 VR 게임에 익숙한 사용자를 위해 설정을 제공해 주는 것도 좋겠습니다.
ru: Важно отметить, что перемещение по виртуальному миру, когда игрок неподвижен в реальном мире, может вызывать тошноту, особенно у новичков в виртуальной реальности. Настройки функций перемещения по умолчанию довольно консервативны. Мы рекомендуем придерживаться этих настроек по умолчанию, но предлагаем в игре функции, которые позволяют настроить менее комфортные параметры для более опытных пользователей, привыкших к VR-играм.
ta: நிச உலகில் வீரர் இன்னும் நிற்கும்போது மெய்நிகர் உலகில் செல்வது, குறிப்பாக வி.ஆருக்கு புதிய வீரர்களுக்கு குமட்டல் தூண்டுகிறது என்பதை கவனத்தில் கொள்ள வேண்டும். எங்கள் இயக்க செயல்பாடுகளின் இயல்புநிலை அமைப்புகள் மிகவும் பழமைவாதமானவை. இந்த இயல்புநிலைகளில் ஒட்டிக்கொள்ள நாங்கள் உங்களுக்கு அறிவுறுத்துகிறோம், ஆனால் வி.ஆர் கேம்களை விளையாடுவதற்கு பழகும் அதிக பட்டறிவு வாய்ந்த பயனர்களுக்கு குறைந்த வசதியான அமைப்புகளை செயல்படுத்த விளையாட்டில் அம்சங்களை வழங்குகிறோம்.
uk: Важливо зауважити, що пересування віртуальним світом, коли гравець стоїть на місці в реальному світі, може викликати нудоту, особливо у гравців, які тільки починають знайомитися з VR. Налаштування за замовчуванням для наших функцій руху є досить консервативними. Ми рекомендуємо вам дотримуватися цих параметрів за замовчуванням, але пропонуємо функції в грі, щоб увімкнути менш зручні налаштування для більш досвідчених користувачів, які звикли грати в ігри VR.
zh_hans: 应当注意，玩家在虚拟世界移动的同时在现实世界中处于静止状态，这可能导致晕眩，对经验较少的 VR 玩家尤其如此。我们的移动函数的默认设置相对保守。我们建议你遵守这些设置，但同时在游戏中提供为更有经验且习惯于 VR 游戏的玩家提供舒适度更低的设置的功能。
zh_hant: 值得注意的是，當玩家在現實中靜止時於虛擬世界移動，容易引發暈眩感，尤其是對於剛接觸 VR 的新手玩家。預設的移動參數相當保守。我們建議預設採用這些安全設定，但同時在遊戲中提供選項，讓有經驗的玩家可以啟用較刺激的移動方式。

source: We want to enable this on the right hand controller. We do this by adding a subscene to the right hand :ref:`XRController3D <class_xrcontroller3d>` node. Select ``addons/godot-xr-tools/functions/movement_direct.tscn`` as the scene to add.
fr: Nous voulons activer cela sur le contrôleur droit. Nous faisons cela en ajoutant un sous-scène au nœud :ref:`XRController3D <class_xrcontroller3d>` de la main droite. Sélectionnez ``addons/godot-xr-tools/fonctions/movement_direct.tscn`` comme scène à ajouter.
ga: Ba mhaith linn é seo a chumasú ar an rialtóir ar dheis. Déanaimid é seo trí subscene a chur leis an nód láimhe deise :ref:`XRConroller3D <class_xrcontroller3d>`. Roghnaigh `` addons/godot-xr-tools/functions/movement_direct.tscn`` mar an radharc le cur leis.
ko: 우리는 이 기능을 오른손 컨트롤러에 할당하고 싶습니다. 따라서 오른손 :ref:`XRController3D <class_xrcontroller3d>`에 ``addons/godot-xr-tools/functions/movement_direct.tscn`` 자식 씬을 추가합니다.
ru: Мы хотим включить это на правом контроллере. Для этого добавляем подсцену к правому узлу :ref:`XRController3D <class_xrcontroller3d>`. Выберите ``addons/godot-xr-tools/functions/movement_direct.tscn`` в качестве добавляемой сцены.
ta: இதை வலது கை கட்டுப்படுத்தியில் இயக்க விரும்புகிறோம். வலது கையில் ஒரு துணைக்குழுவைச் சேர்ப்பதன் மூலம் இதைச் செய்கிறோம்: குறிப்பு: `xrcontroller3d <class_xrcontroller3d>` முனை. சேர்க்க வேண்டிய காட்சியாக `` addons/kodot-xr-tools/functions/romyation_direct.tscn`` என்பதைத் தேர்ந்தெடுக்கவும்.
uk: Ми хочемо ввімкнути це на правому контролері. Ми робимо це, додаючи підсцену до правого вузла :ref:`XRController3D <class_xrcontroller3d>`. Виберіть ``addons/godot-xr-tools/functions/movement_direct.tscn`` як сцену для додавання.
zh_hant: 我們希望在右手控制器上啟用這個功能。請在右手 :ref:`XRController3D <class_xrcontroller3d>` 節點下新增一個子場景，選擇 ``addons/godot-xr-tools/functions/movement_direct.tscn`` 作為要加入的場景。

source: This function adds forward and backwards movement to the player by using the joystick on the right hand controller. It has an option to also add left/right strafe but by default this is disabled.
ga: Cuireann an fheidhm seo gluaiseacht ar aghaidh agus ar chúl leis an imreoir tríd an seomra a úsáid ar an rialtóir láimhe dheis. Tá rogha aige strafe clé/ar dheis a chur leis freisin ach de réir réamhshocraithe tá sé seo díchumasaithe.
ko: 이 기능은 플레이어가 오른손 컨트롤러를 사용해 앞뒤로 움직일 수 있게 합니다. 왼쪽/오른쪽 횡이동도 활성화 할 수 있지만 기본적으로 비활성화 되어 있습니다.
ru: Эта функция добавляет игроку возможность двигаться вперёд и назад с помощью джойстика на правом контроллере. Также есть возможность добавить стрейф влево/вправо, но по умолчанию эта возможность отключена.
ta: இந்த செயல்பாடு வலது கை கட்டுப்படுத்தியில் சாய்ச்டிக் பயன்படுத்துவதன் மூலம் பிளேயருக்கு முன்னோக்கி மற்றும் பின்னோக்கி இயக்கத்தை சேர்க்கிறது. இடது/வலது ச்ட்ராஃபையும் சேர்க்க இது ஒரு விருப்பத்தைக் கொண்டுள்ளது, ஆனால் இயல்பாக இது முடக்கப்பட்டுள்ளது.
uk: Ця функція додає гравцеві рух вперед і назад за допомогою джойстика на контролері правої руки. Він також має можливість додати лівий/правий стрейф, але за замовчуванням це вимкнено.
zh_hant: 這個功能讓玩家可透過右手控制器的搖桿進行前進與後退移動。此外，還可選擇啟用左右側移，但預設為關閉。

source: Instead, we are going to add the ability for the player to also turn with this joystick. We will add another subscene to our controller node, select ``addons/godot-xr-tools/functions/movement_turn.tscn`` for this.
fr: Au lieu de cela, nous allons ajouter la possibilité pour le joueur d'également tourner avec ce joystick. Nous ajouterons une autre sous-scène à notre nœud de contrôleur, sélectionnez ``addons/godot-xr-tools/fonctions/movement_turn.tscn`` pour cela.
ga: Ina áit sin, táimid chun an cumas a chur leis an imreoir casadh leis an seomra seo freisin. Cuirfimid fo-radharc eile lenár nód rialaitheora, roghnaigh ``addons/godot-xr-tools/functions/movement_turn.tscn`` chuige seo.
ko: 대신에 조이스틱을 사용해 회전할 수 있는 기능을 추가하겠습니다. 이를 위해 컨트롤러 노드에 다른 자식 씬으로 ``addons/godot-xr-tools/functions/movement_turn.tscn``를 추가합니다.
ru: Вместо этого мы добавим игроку возможность поворачиваться с помощью этого джойстика. Добавим ещё одну подсцену к узлу контроллера, для этого выберем ``addons/godot-xr-tools/functions/movement_turn.tscn``.
ta: அதற்கு பதிலாக, இந்த சாய்ச்டிக் மூலம் வீரர் திரும்புவதற்கான திறனை நாங்கள் சேர்க்கப் போகிறோம். எங்கள் கட்டுப்பாட்டு முனைக்கு மற்றொரு துணைக்குழுவைச் சேர்ப்போம், இதற்காக `` addons/kodot-Xr-tools/functions/nuty_turn.tscn`` என்பதைத் தேர்ந்தெடுக்கவும்.
uk: Натомість ми збираємося додати гравцеві можливість повертатися за допомогою цього джойстика. Ми додамо іншу підсцену до нашого вузла контролера, виберіть для цього ``addons/godot-xr-tools/functions/movement_turn.tscn``.
zh_hant: 另外，我們也要加入讓玩家可用同一個搖桿進行轉向的功能。請為控制器節點再新增一個子場景，選擇 ``addons/godot-xr-tools/functions/movement_turn.tscn``。

source: The turn system by default uses a snap turn approach. This means that turning happens in steps. This may seem jarring however it is a tried and tested method of combating motion sickness. You can easily switch to a mode that offers smooth turning by changing the ``mode`` property on the turn node.
ga: Úsáideann an córas cas de réir réamhshocraithe cur chuige casadh snap. Ciallaíonn sé seo go dtarlaíonn casadh i gcéimeanna. D'fhéadfadh sé seo a bheith buartha ach is modh trialaithe é chun breoiteacht gluaisne a chomhrac. Is féidir leat aistriú go mód go héasca a thairgeann casadh réidh tríd an mhaoin ``mod`` a athrú ar an nód cas.
ko: 회전 시스템은 기본적으로 스냅(snap) 턴 기법을 사용합니다. 이는 단계별 회전을 의미하는데, 거슬려 보일수도 있지만 사실은 멀미를 감소시키기 위한 방법입니다. 보다 부드러운 회전은 회전 노드의 ``mode`` 속성을 바꾸어 활성화 할 수 있습니다.
ru: Система поворота по умолчанию использует метод «мгновенного поворота». Это означает, что поворот происходит пошагово. Это может показаться неудобным, но это проверенный метод борьбы с укачиванием. Вы можете легко переключиться в режим плавного поворота, изменив свойство ``mode`` узла поворота.
ta: முன்னிருப்பாக டர்ன் சிச்டம் ஒரு ச்னாப் டர்ன் அணுகுமுறையைப் பயன்படுத்துகிறது. இதன் பொருள் திருப்பம் படிகளில் நடக்கிறது. இருப்பினும் இது இயக்க நோயை எதிர்த்துப் போராட முயற்சித்த மற்றும் சோதிக்கப்பட்ட முறையாகும். டர்ன் முனையில் `` பயன்முறை`` சொத்தை மாற்றுவதன் மூலம் மென்மையான திருப்பத்தை வழங்கும் பயன்முறைக்கு நீங்கள் எளிதாக மாறலாம்.
uk: Система повороту за замовчуванням використовує підхід миттєвого повороту. Це означає, що поворот відбувається поетапно. Це може здатися жахливим, однак це випробуваний метод боротьби з заколисуванням. Ви можете легко переключитися на режим, який пропонує плавний поворот, змінивши властивість ``mode`` у вузлі turn.
zh_hant: 預設的轉向系統採用「快速轉向」方式，也就是以分段方式轉動。雖然這種方式感覺較突兀，但已被證實能有效減少暈動症。你可以透過調整轉向節點的 ``mode`` 屬性，輕鬆切換為平滑轉向模式。
