Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/basic_xr_locomotion.po
Languages: fr, ga, ko, ru, ta, uk, zh_hans, zh_hant

source: If you run your game at this point in time you will find that you can move through the world freely using the right hand joystick.
fr: Si vous lancez votre jeu à ce moment-là, vous trouverez que vous pouvez vous déplacer dans le monde librement en utilisant le joystick droit.
ga: Má reáchtáil tú do chluiche ag an bpointe seo in am gheobhaidh tú gur féidir leat bogadh tríd an domhan go saor ag baint úsáide as an seomra láimhe dheis.
ko: 게임을 실행하면 오른쪽 조이스틱을 사용해 자유롭게 움직일 수 있습니다.
ru: Если вы запустите игру на этом этапе, вы обнаружите, что можете свободно перемещаться по миру, используя правый джойстик.
ta: இந்த நேரத்தில் உங்கள் விளையாட்டை நீங்கள் இயக்கினால், வலது கை சாய்ச்டிக்கைப் பயன்படுத்தி நீங்கள் சுதந்திரமாக உலகெங்கிலும் செல்ல முடியும் என்பதைக் காண்பீர்கள்.
uk: Якщо ви запустите свою гру в цей момент часу, ви побачите, що можете вільно пересуватися світом, використовуючи правий джойстик.
zh_hans: 如果你在这个时间点运行你的游戏，你会发现你可以使用右手摇杆在世界中自由移动。
zh_hant: 此時如果執行遊戲，你會發現可以用右手搖桿在世界中自由移動。

source: Teleport
fr: Teleportation
ga: Teileapóirt
ko: 텔레포트
ru: Телепорт
ta: டெலிபோர்ட்
uk: Телепорт
zh_hans: 传送
zh_hant: 傳送

source: An alternative to direct movement that some users find more pleasant is the ability to teleport to another location within your game world. Godot XR Tools supports this through the teleport function and we will be adding this to our left hand controller.
fr: Une alternative au mouvement direct que certains utilisateurs trouvent plus agréable est la capacité de se téléporter à un autre emplacement dans votre monde de jeu. Godot XR Tools supporte cela par la fonction de téléportation et nous allons l'ajouter à notre contrôleur gauche.
ga: Rogha eile seachas gluaiseacht dhíreach a fhaigheann roinnt úsáideoirí níos taitneamhaí is ea an cumas teleport chuig áit eile laistigh de do shaol cluiche. Tacaíonn Godot XR Tools leis seo tríd an bhfeidhm teleport agus beimid ag cur é seo lenár rialtóir láimhe clé.
ko: 직접 이동의 대안으로 텔레포트를 사용해 게임 공간의 다른 위치로 이동하는 것이 더 편리할 수 있습니다. Godot XR 도구에서는 텔레포트 기능을 제공하고 이 기능을 왼쪽 컨트롤러에 추가해 보겠습니다.
ru: Альтернативой прямому перемещению, которую некоторые пользователи находят более приятной, является возможность телепортироваться в другое место игрового мира. Godot XR Tools поддерживает эту функцию телепортации, и мы добавим её в наш левый контроллер.
ta: சில பயனர்கள் மிகவும் இனிமையானதாகக் கருதும் நேரடி இயக்கத்திற்கு மாற்றாக உங்கள் விளையாட்டு உலகில் மற்றொரு இடத்திற்கு டெலிபோர்ட் செய்யும் திறன். கோடோட் எக்ச்ஆர் கருவிகள் டெலிபோர்ட் செயல்பாட்டின் மூலம் இதை ஆதரிக்கின்றன, இதை நாங்கள் எங்கள் இடது கை கட்டுப்படுத்தியில் சேர்ப்போம்.
uk: Альтернативою прямому переміщенню, яку деякі користувачі вважають більш приємною, є можливість телепортації в інше місце у вашому ігровому світі. Godot XR Tools підтримує це через функцію телепорту, і ми додамо це до нашого лівого контролера.
zh_hant: 有些玩家會覺得「傳送」比直接移動更舒適。Godot XR Tools 內建傳送功能，我們將把這個功能加到左手控制器上。

source: Add a new child scene to your left hand :ref:`XRController3D <class_xrcontroller3d>` node by selecting the ``addons/godot-xr-tools/functions/function_teleport.tscn`` scene.
fr: Ajoutez une nouvelle scène enfant à votre nœud :ref:`XRController3D <class_xrcontroller3d>` de main gauche en sélectionnant la scène ``addons/godot-xr-tools/functions/function_teleport.tscn``.
ga: Cuir radharc nua linbh le do lámh chlé :ref:`XRController3D <class_xrcontroller3d>` nód tríd an radharc ``addons/godot-xr-tools/functions/function_teleport.tscn`` a roghnú.
ko: 왼손 :ref:`XRController3D <class_xrcontroller3d>` 노드에 ``addons/godot-xr-tools/functions/function_teleport.tscn`` 자식 씬을 추가합니다.
ru: Добавьте новую дочернюю сцену в узел левой руки :ref:`XRController3D <class_xrcontroller3d>`, выбрав сцену ``addons/godot-xr-tools/functions/function_teleport.tscn``.
ta: உங்கள் இடது கையில் ஒரு புதிய குழந்தை காட்சியைச் சேர்க்கவும்: குறிப்பு: `` `addons/kodot-xr-tools/functions/function_teleport.tscn`` காட்சியைத் தேர்ந்தெடுப்பதன் மூலம்` xrcontroller3d <class_xrcontroller3d> `முனை.
uk: Додайте нову дочірню сцену до лівого вузла :ref:`XRController3D <class_xrcontroller3d>`, вибравши сцену ``addons/godot-xr-tools/functions/function_teleport.tscn``.
zh_hant: 請在左手 :ref:`XRController3D <class_xrcontroller3d>` 節點下新增一個子場景，選擇 ``addons/godot-xr-tools/functions/function_teleport.tscn`` 場景。

source: With this scene added the player will be able to teleport around the world by pressing the trigger on the left hand controller, pointing where they want to go, and then releasing the trigger. The player can also adjust the orientation by using the left hand controller's joystick.
ru: С этой сценой игрок сможет телепортироваться по всему миру, нажимая на курок на левом контроллере, указывая направление и отпуская курок. Игрок также может менять ориентацию, используя джойстик на левом контроллере.
uk: З додаванням цієї сцени гравець зможе телепортуватися по всьому світу, натискаючи кнопку на лівому контролері, вказуючи курсор у потрібне місце, а потім відпускаючи кнопку. Гравець також може налаштувати орієнтацію за допомогою джойстика на лівому контролері.
zh_hant: 加入這個場景後，玩家可以按住左手控制器的扳機，指向想去的位置，然後放開扳機，在世界中進行傳送。玩家也可以使用左手控制器的搖桿調整朝向。

source: If you've followed all instructions correctly your scene should now look something like this:
fr: Si vous avez suivi correctement toutes les instructions, votre scène devrait maintenant ressembler à ceci :
ga: Má lean tú na treoracha go léir i gceart ba chóir go mbeadh cuma mar seo ar do radharc anois:
ko: 안내한 사항대로 모두 진행했다면 여러분의 씬은 아래와 같을 것입니다:
ru: Если вы правильно выполнили все инструкции, ваша сцена должна выглядеть примерно так:
ta: நீங்கள் எல்லா வழிமுறைகளையும் சரியாகப் பின்பற்றினால், உங்கள் காட்சி இப்போது இதுபோன்றதாக இருக்க வேண்டும்:
uk: Якщо ви правильно виконали всі інструкції, ваша сцена має виглядати приблизно так:
zh_hant: 如果你都正確操作，現在場景應該會長得像這樣：

source: More advanced movement features
fr: Plus de fonctionnalités de mouvements avancés
ga: Gnéithe gluaiseachta níos airde
ko: 고급 이동 기능
ru: Более продвинутые функции движения
ta: மேலும் மேம்பட்ட இயக்கம் நற்பொருத்தங்கள்
uk: Більш розширені функції руху
zh_hans: 更多高级移动功能
zh_hant: 更多進階移動功能

source: Godot XR Tools adds many more movement features such as gliding, a grapple hook implementation, a jetpack, climbing mechanics, etc.
fr: Godot XR Tools ajoute beaucoup d'autres fonctionnalités de mouvement comme planer, une implémentation de crochet de grappin, un jetpack, des mécaniques d'escalade, etc.
ga: Cuireann Godot XR Tools go leor gnéithe gluaiseachta níos mó leis mar ghluaitheadh, cur i bhfeidhm crúca grapple, jetpack, meicníc dreapadóireachta, srl.
ko: Godot XR 도구는 글라이딩(gliding), 그래플 훅(grapple hook), 제트팩(jetpack), 클라이밍(climbing) 등 다양한 이동 메커닉을 제공합니다.
ru: Godot XR Tools добавляет множество дополнительных функций движения, таких как планирование, реализация крюка-кошки, реактивный ранец, механика скалолазания и т. д.
ta: கோடோட் எக்ச்ஆர் கருவிகள் கிளைடிங், கிராப்பிள் ஊக் செயல்படுத்தல், ஒரு செட் பேக், ஏறும் இயக்கவியல் போன்ற பல இயக்க அம்சங்களைச் சேர்க்கிறது.
uk: Godot XR Tools додає багато інших рухових функцій, таких як ковзання, реалізація грейферного гака, реактивний ранець, механізми скелелазіння тощо.
zh_hans: Godot XR 工具增加了更多的运动功能，如滑翔，抓钩，喷气背包，攀爬机制等。
zh_hant: Godot XR Tools 還提供滑翔、抓鉤、噴射背包、攀爬等多種進階移動機制。

source: Most work similarly to the basic movement features we've handled so far, simply add the relevant subscene from the plugin to the controller that implements it.
fr: La plupart fonctionnent de la même manière que les caractéristiques de mouvement de base que nous avons manipulées jusqu'à présent, il suffit d'ajouter la sous-scène pertinente du plugin au contrôleur qui l'implémente.
ga: Oibríonn an chuid is mó ar an mbealach céanna leis na bunghnéithe gluaiseachta atá láimhseáilte againn go dtí seo, níl le déanamh ach an foscéine ábhartha ón mbreiseán a chur leis an rialtóir a chuireann i bhfeidhm é.
ko: 대부분은 지금까지 알아본 기본 이동 기능과 유사하게, 필요한 씬을 플러그인에서 컨트롤러의 자식 씬으로 추가하기만 하면 됩니다.
ru: Большинство из них работают аналогично базовым функциям движения, с которыми мы справились до сих пор, просто добавьте соответствующую подсцену из плагина в контроллер, который ее реализует.
ta: பெரும்பாலானவை நாம் இதுவரை கையாண்ட அடிப்படை இயக்க அம்சங்களைப் போலவே வேலை செய்கின்றன, சொருகி இருந்து தொடர்புடைய துணைக்குழுவைச் செயல்படுத்தும் கட்டுப்படுத்திக்குச் சேர்க்கவும்.
uk: Більшість працює подібно до основних функцій руху, з якими ми працювали досі, просто додайте відповідну підсцену з плагіна до контролера, який його реалізує.
zh_hans: 其中大部分与之前我们处理的基本移动功能类似，简单地将插件中相关的子场景添加到负责实现的控制器中即可。
zh_hant: 大部分的進階功能和前述基礎移動功能用法相似，只需將對應的子場景新增到控制器即可。

source: We'll look at some of these in more detail later on in this tutorial where additional setup is required (such as climbing) but for others please look at Godot XR Tools own help pages for details.
fr: Nous allons examiner certains de ceux-ci où une configuration supplémentaire est nécessaire plus en détail plus tard dans ce tutoriel (comme l'escalade) mais pour les autres, veuillez regarder les pages d'aide de Godot XR Tools pour les détails.
ga: Breathnóimid ar chuid díobh seo níos mionsonraithe níos déanaí sa rang teagaisc seo ina bhfuil socrú breise ag teastáil (mar shampla dreapadóireacht) ach do dhaoine eile féach ar leathanaigh cabhrach féin Godot XR Tools le haghaidh sonraí.
ko: 튜토리얼의 뒷 부분에서 몇 가지 기능들을 보다 상세하게 살펴볼텐데 이것들은 부가적인 준비가 필요한 경우들입니다. (예를 들어 클라이밍의 경우) 다른 기능들에 대해서는 Godot XR 도구의 도움 페이지를 참고 하시면 됩니다.
ru: Мы рассмотрим некоторые из них более подробно далее в этом руководстве, где требуется дополнительная настройка (например, скалолазание), но для получения подробной информации о других, пожалуйста, обратитесь к собственным страницам справки Godot XR Tools.
ta: இந்த டுடோரியலில் கூடுதல் அமைப்பு தேவைப்படும் (ஏறுதல் போன்றவை) இந்த டுடோரியலில் இவற்றில் சிலவற்றை பின்னர் விரிவாகப் பார்ப்போம், ஆனால் மற்றவர்களுக்கு தயவுசெய்து கோடோட் எக்ச்ஆர் கருவிகள் விவரங்களுக்கு உதவி பக்கங்களைப் பாருங்கள்.
uk: Ми розглянемо деякі з них більш детально пізніше в цьому підручнику, якщо потрібне додаткове налаштування (наприклад, скелелазіння), але для інших подробиць дивіться власні сторінки довідки Godot XR Tools.
zh_hans: 稍后我们会深入探究其中一些需要额外设置的功能（例如攀爬），但剩余部分请参考 Godot XR 工具部分的帮助页面。
zh_hant: 本教學稍後會針對需要特殊設定（如攀爬）的功能做進一步說明，其他功能請參考 Godot XR Tools 自帶的說明文件。

source: Select your :ref:`XROrigin3D <class_xrorigin3d>` node and click on the ``instantiate Child Scene`` button to add a child scene. Select ``addons/godot-xr-tools/player/player_body.tscn`` and add this node.
fr: Sélectionnez votre nœud :ref:`XROrigin3D <class_xrorigin3d>` et cliquez sur le bouton ``Instancier scène enfant`` pour ajouter une scène enfant. Sélectionnez ``addons/godot-xr-tools/joueur/joueur_body.tscn`` et ajoutez ce nœud.
ga: Roghnaigh do nód :ref:`XROrigin3D <class_xrorigin3d>` agus cliceáil ar an gcnaipe ``Instantiate Child Scene`` chun radharc linbh a chur leis. Roghnaigh ``addons/godot-xr-tools/player/player_body.tscn`` agus cuir an nód seo leis.
ko: :ref:`XROrigin3D <class_xrorigin3d>` 노드를 클릭해서 ``자식 씬 인스턴스화``를 눌러 ``addons/godot-xr-tools/player/player_body.tscn`` 노드를 추가합니다.
ta: உங்கள்: ref: `xrorigin3d <class_xrorigin3d>` முனை மற்றும் குழந்தை காட்சியைச் சேர்க்க `` இன்ச்டன்ட் குழந்தை காட்சியை` பொத்தானைக் சொடுக்கு செய்க. `` Addons/kodot-xr-tools/player/player_body.tscn`` ஐத் தேர்ந்தெடுத்து இந்த முனையைச் சேர்க்கவும்.

source: We start by adding a :ref:`StaticBody3D <class_staticbody3d>` node to our root node and we rename this to ``Floor``. We add a :ref:`MeshInstance3D <class_meshinstance3d>` node as a child node for our ``Floor``. Then create a new :ref:`PlaneMesh <class_planemesh>` as it's mesh. For now we set the size of the mesh to 100 x 100 meters. Next we add a :ref:`CollisionShape3D <class_collisionshape3d>` node as a child node for our ``Floor``. Then create a ``BoxShape`` as our shape. We set the size of this box shape to 100 x 1 x 100 meters. We also need to move our collision shape down by 0.5 meters so the top of our box is flush with the floor.
fr: Nous commençons par ajouter un nœud :ref:`StaticBody3D <class_staticbody3d>` à notre nœud racine et nous renommons celui-ci en ``Sol``. Nous ajoutons un nœud :ref:`MeshInstance3D <class_meshinstance3d>` en tant que nœud enfant pour notre ``Sol``. Ensuite, créons un nouveau :ref:`PlaneMesh <class_planemesh>` pour son maillage. Pour l'instant, nous avons fixé la taille du maillage à 100 x 100 mètres. Après, nous ajoutons un nœud :ref:`CollisionShape3D <class_collisionshape3d>` en tant que nœud enfant pour notre ``Sol``. Puis créons une ``BoxShape`` pour notre forme. Nous définissons la taille de cette forme de boîte à 100 x 1 x 100 mètres. Nous avons également besoin de déplacer notre forme de collision de 0,5 mètres vers le bas de sorte à ce que le haut de notre boîte soit à la limite du sol.
ta: ஒரு: ref: `staticbody3d <class_staticbody3d>` எங்கள் ரூட் முனைக்கு முனை சேர்ப்பதன் மூலம் தொடங்குகிறோம், இதை `` மாடி`` என்று மறுபெயரிடுகிறோம். நாங்கள் ஒரு: ref: `meshinstance3d <class_meshinstance3d>` எங்கள் `` தளத்திற்கான குழந்தை முனையாக முனை. பின்னர் ஒரு புதியதை உருவாக்கவும்: ref: `பிளானேமேச் <class_planemesh>` இது கண்ணி என்பதால். இப்போது நாங்கள் கண்ணி அளவை 100 ஃச் 100 மீட்டராக அமைத்தோம். அடுத்து நாம் ஒரு: ref: `collisionshape3d <class_collisionshape3d>` எங்கள் `` தளத்திற்கான குழந்தை முனையாக முனை. பின்னர் எங்கள் வடிவமாக ஒரு `` பாக்ச்சேப்`` ஐ உருவாக்கவும். இந்த பெட்டி வடிவத்தின் அளவை 100 ஃச் 1 ஃச் 100 மீட்டராக அமைத்துள்ளோம். எங்கள் மோதல் வடிவத்தை 0.5 மீட்டர் கீழே நகர்த்த வேண்டும், எனவே எங்கள் பெட்டியின் மேற்பகுதி தரையுடன் பறிக்கப்படுகிறது.

source: To make it easier to see that we're actually moving around our world, a white floor isn't going to do it. For this we add a material to our PlaneMesh and set the albedo to a grid texture we've created with `Wahooneys excellent free texture generator <https://wahooney.itch.io/texture-grid-generator>`_.
ta: நாங்கள் உண்மையில் நம் உலகத்தை சுற்றி நகர்கிறோம் என்பதைக் காண்பதை எளிதாக்க, ஒரு வெள்ளை தளம் அதைச் செய்யப் போவதில்லை. இதற்காக நாங்கள் எங்கள் பிளானேமேசில் ஒரு பொருளைச் சேர்த்து, `wahooneys சிறந்த இலவச அமைப்பு செனரேட்டர் <https://wahooney.ich.ich.io/texture-grid-generator>` _ உடன் நாங்கள் உருவாக்கிய ஒரு கட்ட அமைப்புக்கு ஆல்பிடோவை அமைக்கவும்.

source: With this scene added the player will be able to teleport around the world by pressing the trigger on the left hand controller, pointing where they want to go, and then releasing the trigger. The player can also adjust the orientation by using the left hand controllers joystick.
fr: Avec cette scène ajoutée, le joueur sera en mesure de se téléporter autour du monde en appuyant sur la gâchette du contrôleur gauche, pointer où ils veulent aller, puis en relâchant la gâchette. Le joueur peut également régler l'orientation en utilisant le joystick gauche.
ta: இந்த காட்சி சேர்க்கப்பட்டதன் மூலம், இடது கை கட்டுப்படுத்தியில் தூண்டுதலை அழுத்துவதன் மூலம் வீரர் உலகம் முழுவதும் டெலிபோர்ட் செய்ய முடியும், அவர்கள் எங்கு செல்ல விரும்புகிறார்கள் என்பதை சுட்டிக்காட்டி, பின்னர் தூண்டுதலை வெளியிடுவார்கள். இடது கை கட்டுப்படுத்திகள் சாய்ச்டிக் பயன்படுத்துவதன் மூலம் வீரர் நோக்குநிலையை சரிசெய்ய முடியும்.
