Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/deploying_to_android.po
Languages: fr, ga, ko, ru, ta, uk, zh_hans

source: Deploying to Android
fr: Déployer sur Android
ga: Imscaradh chuig Android
ru: Развертывание на Android
ta: ஆண்ட்ராய்டு க்கு பயன்படுத்தப்படுகிறது
uk: Розгортання на Android
zh_hans: 部署到 Android

source: Setup
fr: Configuration
ga: Socrú
ko: 설정
ru: Настройка
ta: அமைவு
uk: Налаштування
zh_hans: 场景布置

source: Most standalone headsets run on Android and OpenXR support is making its way to these platforms.
fr: La plupart des casques autonomes fonctionnent sur Android et le support OpenXR fait son chemin vers ces plateformes.
ga: Ritheann an chuid is mó de na cluasáin neamhspleácha ar Android agus tá tacaíocht OpenXR ag déanamh a bhealach chuig na hardáin seo.
ko: 대부분의 독립형 헤드셋은 Android에서 OpenXR의 플랫폼 지원에 의해 동작합니다.
ru: Большинство автономных гарнитур работают на базе Android, и поддержка OpenXR постепенно появляется и на этих платформах.
ta: அண்ட்ராய்டில் இயங்கும் பெரும்பாலான முழுமையான எட்செட்டுகள் மற்றும் ஓபன்எக்ச்ஆர் உதவி இந்த தளங்களுக்கு வழிவகுக்கிறது.
uk: Більшість автономних гарнітур працюють на Android, і підтримка OpenXR пробивається на ці платформи.
zh_hans: 多数独立头显运行在 Android 上，并且 OpenXR 支持正在逐步推广到这些平台。

source: Before following the OpenXR-specific instructions here, you'll need to first setup your system to export to Android in general, including:
fr: Avant de suivre les instructions spécifiques OpenXR ici, vous devrez d'abord configurer votre système pour exporter vers Android en général, y compris :
ga: Sula leanann tú na treoracha sonracha OpenXR-anseo, beidh ort do chóras a shocrú ar dtús le heaspórtáil chuig Android i gcoitinne, lena n-áirítear:
ko: OpenXR에 관한 설명을 진행하기 전에, 일반적으로 Android 장치에 내보내기 위한 시스템 설정을 우선 진행해야 합니다:
ru: Прежде чем следовать инструкциям, касающимся OpenXR, вам необходимо сначала настроить систему для экспорта в Android в целом, включая:
ta: இங்கே Openxr- குறிப்பிட்ட வழிமுறைகளைப் பின்பற்றுவதற்கு முன், பொதுவாக ஆண்ட்ராய்டு க்கு ஏற்றுமதி செய்ய உங்கள் கணினியை முதலில் அமைக்க வேண்டும், அவற்றுள்:
uk: Перш ніж виконувати наведені тут інструкції для OpenXR, вам потрібно спочатку налаштувати систему для експорту в Android загалом, зокрема:
zh_hans: 在遵循此处的 OpenXR 特定说明之前，你需要首先设置你的系统以导出到 Android 平台，包括：

source: Installing OpenJDK 17
ga: OpenJDK 17 a shuiteáil
ko: OpenJDK 11 설치
ru: Установка OpenJDK 17
ta: OpenJDK 17 ஐ நிறுவுகிறது
uk: Встановлення OpenJDK 17
zh_hans: 安装 OpenJDK 17

source: Installing Android Studio
fr: Installer Android Studio
ga: Suiteáil Stiúideo Android
ko: Android Studio 설치
ru: Установка Android Studio
ta: ஆண்ட்ராய்டு ச்டுடியோவை நிறுவுகிறது
uk: Встановлення Android Studio
zh_hans: 安装 Android Studio

source: Creating a debug.keystore
ga: Debug.keystore a chruthú
ko: debug.keystore 생성

source: Configuring the location of the Android SDK and debug.keystore in Godot
ga: Suíomh an Android SDK agus debug.keystore a chumrú i Godot
ko: Godot에서 Android SDK와 debug.keystore 경로 설정

source: See :ref:`doc_exporting_for_android` for the full details, and return here when you've finished these steps.
fr: Voir :ref:`doc_exporting_for_android` pour les détails complets, et revenir ici lorsque vous avez terminé ces étapes.
ga: Féach: ref: `doc_exporting_for_android` le haghaidh na sonraí iomlána, agus filleadh anseo nuair a bheidh na céimeanna seo críochnaithe agat.
ko: 과정 전체에 대한 세부 사항은 :ref:`doc_exporting_for_android` 문서를 살펴 보시고, 위 과정들이 끝나면 다시 돌아와 이 문서를 보시기 바랍니다.
ru: Полную информацию смотрите в :ref:`doc_exporting_for_android` и вернитесь сюда после завершения этих шагов.
ta: காண்க: குறிப்பு: முழு விவரங்களுக்கு `doc_exporting_for_android`, இந்த படிகளை நீங்கள் முடிக்கும்போது இங்கே திரும்பவும்.
uk: Перегляньте :ref:`doc_exporting_for_android`, щоб отримати повну інформацію, і поверніться сюди, коли виконаєте ці дії.
zh_hans: 详情请参见 :ref:`doc_exporting_for_android` ，完成所需配置后再返回此处。

source: Gradle Android build
ga: Gradle Android a thógáil
ko: Gradle Android 빌드
ru: Сборка Gradle Android
ta: கிரேடில் ஆண்ட்ராய்டு உருவாக்க
uk: Складання Gradle Android
zh_hans: Gradle Android 构建

source: Official support for the Android platform wasn't added to the OpenXR specification initially resulting in various vendors creating custom loaders to make OpenXR available on their headsets. While the long term expectation is that all vendors will adopt the official OpenXR loader, for now these loaders need to be added to your project.
fr: Le support officiel de la plate-forme Android n'a pas été ajouté à la spécification OpenXR, ce qui a initialement mené divers fournisseurs à créer des chargeurs personnalisés pour rendre OpenXR disponible sur leurs casques. Alors que l'attente à long terme est que tous les fournisseurs adopteront le chargeur officiel OpenXR, pour l'instant ces chargeurs doivent être ajoutés à votre projet.
ga: Níor cuireadh tacaíocht oifigiúil don ardán Android le sonraíocht OpenXR ar dtús mar thoradh air sin chruthaigh díoltóirí éagsúla lódálaithe saincheaptha chun OpenXR a chur ar fáil ar a gcuid cluasáin. Cé gurb é an t-ionchas fadtéarmach go nglacfaidh gach díoltóir an lódóir oifigiúil OpenXR, anois caithfear na luchtóirí seo a chur le do thionscadal.
ko: OpenXR에는 원래 공식적으로는 Android 플랫폼에 대한 지원이 없기 때문에 각 벤더들이 본인들의 헤드셋에서 OpenXR이 사용 가능하도록 커스텀 로더들을 만들게 되었습니다. 장기적으로 보면 모든 벤더들이 공식 OpenXR 로더를 도입하겠지만, 지금은 이 로더들을 프로젝트에서 설정해 주어야 합니다.
ru: Изначально официальная поддержка платформы Android не была добавлена в спецификацию OpenXR, что привело к тому, что различные поставщики создали собственные загрузчики для поддержки OpenXR на своих гарнитурах. Хотя в долгосрочной перспективе ожидается, что все поставщики перейдут на официальный загрузчик OpenXR, на данный момент эти загрузчики необходимо добавить в свой проект.
ta: ஆண்ட்ராய்டு இயங்குதளத்திற்கான அதிகாரப்பூர்வ உதவி ஆரம்பத்தில் OpenXR விவரக்குறிப்பில் சேர்க்கப்படவில்லை, இதன் விளைவாக பல்வேறு விற்பனையாளர்கள் தங்கள் எட்செட்களில் OpenXR ஐ கிடைக்கச் செய்ய தனிப்பயன் ஏற்றிகளை உருவாக்குகிறார்கள். அனைத்து விற்பனையாளர்களும் அதிகாரப்பூர்வ ஓபன்எக்ச்ஆர் ஏற்றியை ஏற்றுக்கொள்வார்கள் என்பது நீண்ட கால எதிர்பார்ப்பு என்றாலும், இப்போது இந்த ஏற்றிகள் உங்கள் திட்டத்தில் சேர்க்கப்பட வேண்டும்.
uk: Офіційна підтримка платформи Android спочатку не була додана до специфікації OpenXR, що призвело до того, що різні постачальники створювали спеціальні завантажувачі, щоб зробити OpenXR доступним на своїх гарнітурах. Хоча в довгостроковій перспективі очікується, що всі постачальники приймуть офіційний завантажувач OpenXR, наразі ці завантажувачі потрібно додати до вашого проекту.
zh_hans: 最初，官方对 Android 平台的支持并未添加到 OpenXR 规范中，这导致各大供应商都创建了自定义加载器以在其头戴设备上实现 OpenXR。尽管从长远角度来看，所有供应商都终将转移到官方的 OpenXR 加载器；但就当下来说，这些加载器需要添加到你的项目中。

source: In order to include the vendor-specific OpenXR loader into your project, you will need to setup a gradle Android build.
ga: D'fhonn an lódóir OpenXR atá sonrach don díoltóir a áireamh i do thionscadal, beidh ort tógáil Android gradle a chur ar bun.
ko: 프로젝트에 제조사(벤더)별 OpenXR 로더를 추가하기 위해서는 gradle Android 빌드를 설정해야 합니다.
ru: Чтобы включить в свой проект загрузчик OpenXR, специфичный для поставщика, вам потребуется настроить сборку Android Gradle.
ta: உங்கள் திட்டத்தில் விற்பனையாளர்-குறிப்பிட்ட ஓபன்எக்ச்ஆர் ஏற்றியைச் சேர்க்க, நீங்கள் ஒரு கிரேடில் ஆண்ட்ராய்டு கட்டமைப்பை அமைக்க வேண்டும்.
uk: Щоб включити завантажувач OpenXR від постачальника у ваш проект, вам потрібно буде налаштувати збірку Android Gradle.
zh_hans: 为了将特定供应商的 OpenXR 加载器包含到你的项目中，你需要先设置一个 Gradle Android 构建。

source: Select **Install Android Build Template...** from the **Project** menu:
ga: Roghnaigh **Suiteáil Teimpléad Tógáil Android... ** ón roghchlár **Tionscad**:
ru: Выберите **Установить шаблон сборки Android...** в меню **Project**:
ta: ** திட்டத்திலிருந்து ** திட்டத்தை நிறுவவும் ** ** திட்டத்திலிருந்து ** மெனுவிலிருந்து: **
uk: Виберіть **Install Android Build Template...** у меню **Project**:
zh_hans: 在\ **项目**\ 菜单中选择\ **安装 Android 构建模板...**\ ：

source: This will create a folder called **android** inside of your project that contains all the runtime files needed on Android. You can now customize this installation. Godot won't show this in the editor but you can find it with a file browser.
fr: Cela créera un dossier appelé **android** à l'intérieur de votre projet qui contient tous les fichiers d'exécution nécessaires sur Android. Vous pouvez maintenant personnaliser cette installation. Godot ne montrera pas cela dans l'éditeur mais vous pouvez le trouver avec un navigateur de fichier.
ga: Cruthóidh sé seo fillteán darb ainm**android** taobh istigh de do thionscadal ina bhfuil na comhaid runama go léir a theastaíonn ar Android. Is féidir leat an tsuiteáil seo a shaincheapadh anois. Ní thaispeánfaidh Godot é seo san eagarthóir ach is féidir leat é a fháil le brabhsálaí comhad.
ko: 이를 통해 여러분의 프로젝에 **android** 폴더가 생성되고, 그 안에 Android에 필요한 런타임 파일들이 들어 있게 됩니다. 이제 이 설치된 파일들을 수정할 수 있습니다. Godot 에디터에서 이것들을 보여주지는 않지만 파일 브라우저를 통해 살펴볼 수 있습니다.
ru: Это создаст внутри вашего проекта папку **android**, содержащую все файлы среды выполнения, необходимые для Android. Теперь вы можете настроить эту установку. Godot не будет отображать её в редакторе, но вы можете найти её с помощью файлового менеджера.
ta: இது உங்கள் திட்டத்தின் உள்ளே ** ஆண்ட்ராய்டு ** என்ற கோப்புறையை உருவாக்கும், இது ஆண்ட்ராய்டு இல் தேவையான அனைத்து இயக்க நேர கோப்புகளையும் கொண்டுள்ளது. இந்த நிறுவலைத் தனிப்பயனாக்கலாம். கோடோட் இதை எடிட்டரில் காட்டாது, ஆனால் நீங்கள் அதை ஒரு கோப்பு உலாவி மூலம் காணலாம்.
uk: Це створить папку під назвою **android** у вашому проекті, яка містить усі файли середовища виконання, необхідні для Android. Тепер ви можете налаштувати це встановлення. Godot не покаже це в редакторі, але ви можете знайти це за допомогою файлового браузера.
zh_hans: 这将在你的项目中创建一个名为 **android** 的文件夹，包含在 Android 上运行所需的所有运行时文件。现在你可以自定义这个安装，Godot 不会在编辑器中显示这个文件夹，但你可以通过文件浏览器找到它。

source: You can read more about gradle builds here: :ref:`doc_android_gradle_build`.
fr: Vous pouvez en savoir plus sur les compilations gradle ici : :ref:`doc_android_gradle_build`.
ga: Is féidir leat tuilleadh a léamh faoi thógáil gradle anseo: :ref: `doc_android_gradle_build`.
ko: Gradle 빌드에 관해서는 :ref:`doc_android_gradle_build` 를 읽어보세요.
ru: Подробнее о сборках Gradle можно прочитать здесь: :ref:`doc_android_gradle_build`.
ta: கிரேடில் உருவாக்கங்களைப் பற்றி மேலும் படிக்க இங்கே :: குறிப்பு: `doc_android_gradle_build`.
uk: Ви можете прочитати більше про збірки gradle тут: :ref:`doc_android_gradle_build`.
zh_hans: 你可以在这里阅读更多关于 Gradle 构建的信息：\ :ref:`doc_android_gradle_build`\ 。

source: Installing the vendors plugin
fr: Installation du plugin fournisseurs
ga: Suiteáil breiseán na díoltóirí
ko: 벤더 플러그인 설치
ru: Установка плагина поставщиков
ta: விற்பனையாளர்களின் சொருகி நிறுவுதல்
uk: Встановлення плагіна постачальників
zh_hans: 安装供应商插件

source: The Android plugin structure has been restructured in Godot 4.2, and the loader plugin was renamed to vendors plugin as it now includes more than just loaders. If you've previously installed the loader plugin you need to delete it from the `android/plugins` folder.
ga: Rinneadh struchtúr breiseán Android a athstruchtúrú i Godot 4.2, agus athainmníodh an breiseán lódóra go breiseán díoltóirí mar tá níos mó ná luchtóirí ann anois. Má tá an breiseán lódóra suiteáilte agat roimhe seo ní mór duit é a scriosadh ón bhfillteán `android/plugins`.
ko: Godot 4.2에서 Android 플러그인 구조가 변경되었습니다. 기존에 로더 플러그인은 로더 이외에도 다른 사항들이 포함되도록 변경되었기 때문에 벤더 플러그인으로 이름이 변경되었습니다. 기존에 로더 플러그인을 설치하였다면 이를 `android/plugins` 폴더에서 삭제하셔야 합니다.

source: The vendors plugin can be downloaded from the asset library, search for "OpenXR vendors" and install the plugin:
ga: Is féidir breiseán na díoltóirí a íoslódáil ón leabharlann sócmhainní, cuardach a dhéanamh ar “díoltóirí OpenXR” agus an breiseán a shuiteáil:
ko: 벤더 플러그인은 애셋 라이브러리에서 다운로드 할 수 있습니다. "OpenXR vendors"를 검색하여 플러그인을 설치하세요:

source: You will find the installed files inside the **addons** folder.
ga: Gheobhaidh tú na comhaid suiteáilte taobh istigh den fhillteán**addons**.
ko: **addons** 폴더에서 설치된 파일들을 확인할 수 있습니다.

source: Alternatively you can manually install the vendors plugin by downloading the v2.x version of the plugin `from the release page here <https://github.com/GodotVR/godot_openxr_vendors/releases>`__.
ga: Nó is féidir leat an breiseán díoltóirí a shuiteáil de láimh tríd an leagan v2.x den bhreiseán `a íoslódáil ón leathanach scaoileadh anseo <https://github.com/GodotVR/godot_openxr_vendors/releases>`__.
ko: 또는, `이 페이지에서 <https://github.com/GodotVR/godot_openxr_vendors/releases>`__ v2.x 버전의 플러그인을 다운로드하여 직접 벤더 플러그인을 설치하셔도 됩니다.

source: You will need to copy the `assets/addons/godotopenxrvendors` folder from the zip file into your projects `addons` folder.
ga: Beidh ort an fillteán `assets/addons/godotopenxrvendors` a chóipeáil ón gcomhad zip isteach i bhfillteán `addons` do thionscadail.
ko: zip 파일 안의 `assets/addons/godotopenxrvendors` 폴더를 `addons` 폴더에 복사해야 합니다.

source: You can find the main repository of the vendors plugin `here <https://github.com/GodotVR/godot_openxr_vendors>`__.
fr: Vous pouvez trouver le dépôt principal du plugin fournisseurs `ici <https://github.com/GodotVR/godot_openxr_vendors>`__.
ga: Is féidir leat príomhstór breiseán na ndíoltóirí a fháil `anseo <https://github.com/GodotVR/godot_openxr_vendors>`__.
ko: 벤더 플러그인의 메인 저장소는 `여기<https://github.com/GodotVR/godot_openxr_vendors>`__ 입니다.
ru: Основной репозиторий плагина vendors вы можете найти `здесь <https://github.com/GodotVR/godot_openxr_vendors>`__.
ta: விற்பனையாளர்களின் சொருகி `இங்கே <https://github.com/godotvr/godot_openxr_vendors> __. __.
uk: Ви можете знайти основне сховище плагіна постачальників `тут <https://github.com/GodotVR/godot_openxr_vendors>`__.
zh_hans: 你可以在 `这里 <https://github.com/GodotVR/godot_openxr_vendors>`__ 找到 vendors 插件的主仓库。

source: Enabling the vendors plugin
ga: Cumasú breiseán na díoltóirí
ko: 벤더 플러그인 활성화

source: The vendors plugin needs to be enabled before the export settings become accessible. Open **Project** and select **Project Settings...**. Go to the **Plugins** tab. Enable the **GodotOpenXRVendors** plugin.
ga: Ní mór breiseán na díoltóirí a chumasú sula mbeidh na socruithe onnmhairithe inrochtana Oscail**Tionscad** agus roghnaigh **Socruithe Tionscadail... **. Téigh go dtí an cluais**Breiseán**. Cumasaigh an breiseán**GodoTopEnXRVendors**.
ko: 내보내기 설정에 접근하기 전에 먼저 벤더 플러그인을 활성화해야 합니다. **프로젝트**의 **프로젝트 설정...**을 여세요. **플러그인** 탭으로 가서 **GodotOpenXRVendors** 플러그인을 활성화하세요.

source: This is no longer required from vendors plugin 2.0.3 onwards as it now uses GDExtension. The plugin will not be shown in this list. You can verify it is installed correctly by checking if the export presets contain the entries described below.
ga: Níl sé seo ag teastáil a thuilleadh ó dhíoltóirí breiseán 2.0.3 ar aghaidh mar go n-úsáideann sé GDEExtension anois. Ní thaispeánfar an breiseán sa liosta seo. Is féidir leat a fhíorú go bhfuil sé suiteáilte i gceart trí sheiceáil an bhfuil na hiontrálacha a gcuirtear síos orthu thíos sna réamhshocruithe easpórtála.

source: Creating the export presets
fr: Créer les modèles d'exportation
ga: Na réamhshocruithe onnmhairithe a
ko: 내보내기 프리셋 생성
ru: Создание предустановок экспорта
ta: ஏற்றுமதி முன்னமைவுகளை உருவாக்குதல்
uk: Створення пресетів експорту
zh_hans: 创建导出预设

source: You will need to setup a separate export preset for each device, as each device will need its own loader included.
ga: Beidh ort réamhshocrú onnmhairithe ar leithligh a shocrú do gach gléas, mar beidh a lódóir féin ag teastáil ó gach gléas.
ko: 각 장치는 각자의 로더가 포함되어야 하므로 장치마다 별도의 내보내기 프리셋을 설정해야 합니다.
ru: Вам потребуется настроить отдельный пресет экспорта для каждого устройства, поскольку для каждого устройства потребуется собственный загрузчик.
ta: ஒவ்வொரு சாதனத்திற்கும் தனி ஏற்றுமதி முன்னமைவை நீங்கள் அமைக்க வேண்டும், ஏனெனில் ஒவ்வொரு சாதனத்திற்கும் அதன் சொந்த ஏற்றி சேர்க்கப்பட வேண்டும்.
uk: Вам потрібно буде налаштувати окремий стиль експорту для кожного пристрою, оскільки кожен пристрій потребуватиме окремого завантажувача.
zh_hans: 不同的设备有不同的加载器，因此你需要为每个设备分别准备导出预设。

source: Open **Project** and select **Export..**. Click on **Add..** and select **Android**. Next change the name of the export preset for the device you're setting this up for, say **Meta Quest**. And enable **Use Gradle Build**. If you want to use one-click deploy (described below), ensure that **Runnable** is enabled.
ga: Oscail**Tionscad** agus roghnaigh **Easpórtáil.. **. Cliceáil ar**Cuir.. ** agus roghnaigh **Android**. Ansin athraigh ainm an réamhshocraithe onnmhairithe don fheiste atá á bhunú agat dó, abair**Meta Quest**. Agus cumasaí** Úsáid Gradle Build**. Más mian leat imscaradh aon chliceáil a úsáid (a thuairiscítear thíos), déan cinnte go bhfuil **Runnable** cumasaithe.
ko: **프로젝트**를 열고 **내보내기**를 선택한 뒤, **추가** 버튼을 누르고 **Android**를 선택하세요. 그리고 대상으로 하는 장치를 위한 내보내기 프리셋의 이름을 설정하세요. 예를 들어 **Meta Quest**와 같이요. 그리고 **Use Gradle Build**을 활성화하세요. 한 번의 버튼으로 내보기를 하려면 **Runnable**이 활성화되어 있어야 합니다.
ru: Откройте **Проект** и выберите **Экспорт..**. Нажмите **Добавить..** и выберите **Android**. Затем измените имя шаблона экспорта для устройства, для которого вы его настраиваете, например, **Meta Quest**. И включите **Использовать сборку Gradle**. Если вы хотите использовать развёртывание в один клик (описанное ниже), убедитесь, что включен параметр **Runnable**.
ta: ** திட்டம் ** ஐத் திறந்து ** ஏற்றுமதி .. ** என்பதைத் தேர்ந்தெடுக்கவும். ** சேர் என்பதைக் சொடுக்கு செய்க .. ** மற்றும் ** ஆண்ட்ராய்டு ** ஐத் தேர்ந்தெடுக்கவும். அடுத்து நீங்கள் இதை அமைக்கும் சாதனத்திற்கான ஏற்றுமதி முன்னமைவின் பெயரை மாற்றவும், ** மேவு குவெச்ட் ** சொல்லுங்கள். ** கிரேடில் கட்டமைப்பைப் பயன்படுத்தவும் **. நீங்கள் ஒரு சொடுக்கு வரிசைப்படுத்தலைப் பயன்படுத்த விரும்பினால் (கீழே விவரிக்கப்பட்டுள்ளது), ** இயக்கக்கூடிய ** இயக்கப்பட்டிருப்பதை உறுதிசெய்க.
uk: Відкрийте **Проект** і виберіть **Експортувати..**. Натисніть **Додати..** і виберіть **Android**. Потім змініть назву попереднього налаштування експорту для пристрою, для якого ви це налаштовуєте, скажімо **Meta Quest**. І ввімкніть **Use Gradle Build**. Якщо ви хочете використовувати розгортання одним клацанням миші (описано нижче), переконайтеся, що **Runnable** увімкнено.

source: If the vendors plugins were installed correctly you should find entries for the different headsets, select the entry for meta:
ga: Má bhí na breiseáin díoltóirí suiteáilte i gceart ba chóir duit iontrálacha a fháil do na cluasáin éagsúla, roghnaigh an iontráil do meta:

source: Also change the **XR Mode** to **OpenXR**.
ga: Athraigh an Modh**XR** chu**OpenXR** freisin.
ko: 또한 **XR Mode**를 **OpenXR**로 설정하세요.

source: Scroll to the bottom of the list and you'll find additional XR feature sections, currently only **Meta XR Features** is available. The hand tracking and passthrough settings here currently only work for the Meta Quest and you will need to select the appropriate settings if you wish to use these features.
ga: Scrollaigh go bun an liosta agus gheobhaidh tú rannáin ghné XR breise, faoi láthair níl ach **Gnéithe Meta XR** ar fáil. Ní oibríonn na socruithe rianaithe láimhe agus pastrí anseo ach don Meta Quest faoi láthair agus beidh ort na socruithe cuí a roghnú más mian leat na gnéithe seo a úsáid.
ko: 목록의 아래 쪽으로 내려가 보면 추가적인 XR 기능 항목이 있는데, 지금은 **Meta XR Features**만 활성화 되어 있습니다. 핸드 트래킹과 패스쓰루 설정은 Meta Quest 장치에서만 가능하고, 이러한 기능을 활용하고자 한다면 필요한 항목을 선택해야 합니다.

source: Now you can repeat the same process for the other devices.
ga: Anois is féidir leat an próiseas céanna a athdhéanamh do na gairis eile.
ko: 다른 장치들에 대해서도 비슷한 과정을 통해 설정하면 됩니다.

source: There are separate loaders for the Meta Quest, Pico and Lynx R1 headsets.
ga: Tá lódálaithe ar leithligh ann do na cluasáin Meta Quest, Pico agus Lynx R1.
ko: Meta Quest, Pico, Lynx R1 헤드셋에 대해 개별적으로 로더가 존재합니다.

source: The fourth option is the official Khronos loader, in due time all headsets should work with this loader. At the moment this loader has been tested with the Magic Leap 2 and standalone HTC headsets.
ga: Is é an ceathrú rogha an lódóir oifigiúil Khronos, in am cuí ba chóir go n-oibreodh gach cluasán leis an lódóir seo. I láthair na huaire rinneadh tástáil ar an lódóir seo leis an Magic Leap 2 agus cluasáin neamhspleácha HTC.
ko: 네 번째 선택으로 Khronos의 공식 로더가 있는데 언젠가는 이 로더로 모든 헤드셋을 사용할 수 있을겁니다. 현재는 이 로더는 Magic Leap 2와 HTC의 독립형 헤드셋에 대해서만 테스트 되었습니다.

source: While the Mobile Vulkan renderer has many optimizations targeted at mobile devices, we're still working out the kinks. It is highly advisable to use the compatibility renderer (OpenGL) for the time being when targeting Android based XR devices.
fr: Bien que le renderer Mobile Vulkan a de nombreuses optimisations ciblées pour les appareils mobiles, nous travaillons toujours les détails. Il est fortement conseillé d'utiliser le rendu de compatibilité (OpenGL) pour le moment si vous ciblez les appareils XR basés sur Android.
ga: Cé go bhfuil go leor optamaithe ag an renderer Mobile Vulkan atá dírithe ar ghléasanna soghluaiste, táimid fós ag obair amach na cinks. Tá sé an-mholta an renderer comhoiriúnachta (OpenGL) a úsáid de thuras na huaire agus tú ag díriú ar ghléasanna XR bunaithe ar Android.
ko: 모바일 Vulkan 렌더러는 여러 모바일 장치에 대한 다양한 최적화를 수행하는데, 우리는 아직 몇 가지 문제를 해결 중에 있습니다. 문제가 해결되기 전까지는 Android 기반의 XR 장치를 위해서는 compatiblilty 렌더러(OpenGL)을 사용하는 것을 강력히 추천합니다.
ru: Хотя мобильный рендерер Vulkan имеет множество оптимизаций для мобильных устройств, мы всё ещё работаем над устранением недостатков. На данный момент настоятельно рекомендуется использовать совместимый рендерер (OpenGL) для XR-устройств на базе Android.
ta: மொபைல் வல்கன் ரெண்டரர் மொபைல் சாதனங்களை இலக்காகக் கொண்ட பல மேம்படுத்தல்களைக் கொண்டிருந்தாலும், நாங்கள் இன்னும் கின்க்சை உருவாக்குகிறோம். ஆண்ட்ராய்டு அடிப்படையிலான எக்ச்ஆர் சாதனங்களை குறிவைக்கும் போது பொருந்தக்கூடிய ரெண்டரர் (ஓபன்சிஎல்) ஐப் பயன்படுத்துவது மிகவும் அறிவுறுத்தப்படுகிறது.
uk: Хоча рендерер Mobile Vulkan має багато оптимізацій, націлених на мобільні пристрої, ми все ще працюємо над проблемами. Для пристроїв XR на базі Android на даний момент настійно рекомендується використовувати рендерер сумісності (OpenGL).
zh_hans: 虽然 Vulkan 渲染器针对移动设备进行了优化，但目前我们仍在解决适配问题。就现在而言，强烈建议开发者在针对基于 Android 的 XR 设备时使用兼容性渲染器（OpenGL）。

source: Running on your device from the Godot editor
fr: Exécuter sur votre appareil depuis l'éditeur Godot
ga: Ag rith ar do ghléas ón eagarthóir Godot
ko: Godot 에디터에서 장치 실행
ru: Запуск на вашем устройстве из редактора Godot
ta: கோடோட் எடிட்டரிலிருந்து உங்கள் சாதனத்தில் இயங்குகிறது
uk: Запуск на вашому пристрої з редактора Godot
zh_hans: 通过 Godot 编辑器在设备上运行
