Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/deploying_to_android.po
Languages: fr, ga, ko, ru, ta, uk, zh_hans

source: If you've setup your export settings as described above, and your headset is connected to your computer and correctly recognized, you can launch it directly from the Godot editor using :ref:`doc_one-click_deploy`:
fr: Si vous avez installé vos paramètres d'exportation comme décrit ci-dessus, et votre casque est connecté à votre ordinateur et correctement reconnu, vous pouvez le lancer directement depuis l'éditeur Godot en utilisant :ref:`doc_one-click_deploy` :
ga: Má tá do shocruithe onnmhairithe curtha ar bun agat mar a thuairiscítear thuas, agus má tá do headset ceangailte le do ríomhaire agus má aithnítear i gceart, is féidir leat é a sheoladh go díreach ó eagarthóir Godot ag baint úsáide:ref: `doc_one-click_deploy`:
ko: 앞서 설명한 것처럼 내보내기를 설정했고, 헤드셋이 올바로 컴퓨터에서 인식된 상태라면 Godot 에디터의 :ref:`doc_one-click_deploy` 를 통해 바로 실행할 수 있습니다:
ru: Если вы настроили параметры экспорта, как описано выше, и ваша гарнитура подключена к компьютеру и правильно распознана, вы можете запустить ее непосредственно из редактора Godot с помощью :ref:`doc_one-click_deploy`:
ta: மேலே விவரிக்கப்பட்டுள்ளபடி உங்கள் ஏற்றுமதி அமைப்புகளை நீங்கள் அமைத்தால், உங்கள் எட்செட் உங்கள் கணினியுடன் இணைக்கப்பட்டு சரியாக அங்கீகரிக்கப்பட்டிருந்தால், நீங்கள் அதை கோடோட் எடிட்டரிடமிருந்து நேரடியாகத் தொடங்கலாம்: குறிப்பு: `doc_one-click_deploy`:
uk: Якщо ви встановили параметри експорту, як описано вище, і гарнітуру підключено до комп’ютера та правильно розпізнано, ви можете запустити її безпосередньо з редактора Godot за допомогою :ref:`doc_one-click_deploy`:
zh_hans: 如果按照上述说明设置导出预设，且头戴设备已连接到电脑并被正确识别，你可以通过\ :ref:`doc_one-click_deploy`\ 直接从 Godot 编辑器启动它：

source: For some devices on some platforms, you may need to perform some extra steps in order for your device to be recognized correctly, so be sure to check the developer documentation from your headset vendor.
fr: Pour certains appareils sur certaines plateformes, vous pouvez avoir besoin d'effectuer quelques étapes supplémentaires afin que votre appareil soit reconnu correctement, alors assurez-vous de vérifier la documentation de développeur de votre vendeur de casques.
ga: Maidir le roinnt feistí ar roinnt ardáin, b'fhéidir go mbeidh ort roinnt céimeanna breise a dhéanamh d'fhonn go n-aithnítear do ghléas i gceart, mar sin déan cinnte cáipéisíocht an fhorbróra a sheiceáil ó do dhíoltóir headset.
ko: 몇몇 플랫폼이나 장치에서는 장치를 올바로 인식시키기 위해 몇 가지 과정이 더 필요할 수 있습니다. 따라서 헤드셋 제조사의 개발자 문서를 잘 읽어 보시기 바랍니다.
ru: Для правильного распознавания некоторых устройств на некоторых платформах вам может потребоваться выполнить некоторые дополнительные действия, поэтому обязательно ознакомьтесь с документацией разработчика у поставщика вашей гарнитуры.
ta: சில தளங்களில் உள்ள சில சாதனங்களுக்கு, உங்கள் சாதனம் சரியாக அங்கீகரிக்கப்படுவதற்கு சில கூடுதல் படிகளைச் செய்ய வேண்டியிருக்கலாம், எனவே உங்கள் எட்செட் விற்பனையாளரிடமிருந்து உருவாக்குபவர் ஆவணங்களை சரிபார்க்க மறக்காதீர்கள்.
uk: Для деяких пристроїв на деяких платформах вам може знадобитися виконати деякі додаткові дії, щоб ваш пристрій було правильно розпізнано, тому обов’язково перевірте документацію розробника від постачальника вашої гарнітури.
zh_hans: 正确识别某些平台上的某些设备，可能需要执行额外步骤，请务必查阅头显设备供应商的开发者文档。

source: For example, with the Meta Quest 2, you need to enable developer mode on the headset, and if you're on Windows, you'll need to install special ADB drivers. See the `official Meta Quest developer documentation <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`_ for more details.
fr: Par exemple, avec le Meta Quest 2, vous devez activer le mode développeur sur le casque, et si vous êtes sur Windows, vous devrez installer des pilotes ADB spéciaux. Voir la `documentation de développeur Meta Quest officielle <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`_ pour plus de détails.
ga: Mar shampla, leis an Meta Quest 2, ní mór duit mód forbróra a chumasú ar an headset, agus má tá tú ar Windows, beidh ort tiománaithe ADB speisialta a shuiteáil. Féach ar cháipéisíocht fhorbróra oifigiúil Meta Quest <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`_ le haghaidh tuilleadh sonraí.
ko: 예를 들어 Meta Quest 2의 경우 헤드셋에서 개발자 모드를 활성화 해야 하고, Windows에서는 특정 ADB 드라이버를 설치해야 합니다. `Meta Quest 공식 개발자 문서<https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`_ 에서 보다 자세한 사항을 확인하십시오.
ru: Например, для Meta Quest 2 необходимо включить режим разработчика на гарнитуре, а если вы используете Windows, необходимо установить специальные драйверы ADB. Подробнее см. в `официальной документации для разработчиков Meta Quest <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`_.
ta: எடுத்துக்காட்டாக, மேவு குவெச்ட் 2 உடன், நீங்கள் எட்செட்டில் உருவாக்குபவர் பயன்முறையை இயக்க வேண்டும், நீங்கள் சாளரங்களில் இருந்தால், நீங்கள் சிறப்பு ஏடிபி இயக்கிகளை நிறுவ வேண்டும். மேலும் விவரங்களுக்கு `அதிகாரப்பூர்வ மேவு குவெச்ட் உருவாக்குபவர் ஆவணங்கள் <https://developer.oculus.com/documentation/native/antroid/mobile-device-setup/> _ _.
uk: Наприклад, у Meta Quest 2 вам потрібно ввімкнути режим розробника на гарнітурі, а якщо ви використовуєте Windows, вам потрібно буде встановити спеціальні драйвери ADB. Дивіться `офіційну документацію для розробників Meta Quest <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`_, щоб дізнатися більше.
zh_hans: 例如，对于 Meta Quest 2，你需要在头戴设备上启用开发者模式，并且如果你在 Windows 上开发，还需安装特定 ADB 驱动程序。更多详细信息，请参阅\ `官方 Meta Quest 开发者文档 <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`_\ 。

source: If you're having any issues with one-click deploy, check the :ref:`Troubleshooting section <doc_one-click_deploy_troubleshooting>`.
fr: Si vous avez des problèmes avec le déploiement en un seul clic, vérifiez la :ref:`section dépannage <doc_one-click_deploy_troubleshooting>`.
ga: Má tá aon fhadhb agat le himscaradh aon-cliceáil, seiceáil an :ref:`Roinnt Fabhtcheartú <doc_one-click_deploy_troubleshooting>`.
ko: 원 클릭 배포에 문제가 있으면 :ref:`Troubleshooting section <doc_one-click_deploy_troubleshooting>` 을 확인해 보세요.
ru: Если у вас возникли проблемы с развертыванием в один клик, проверьте :ref:`Troubleshooting section <doc_one-click_deploy_troubleshooting>`.
ta: ஒரு சொடுக்கு வரிசைப்படுத்துவதில் உங்களுக்கு ஏதேனும் சிக்கல்கள் இருந்தால், சரிபார்க்கவும்: ref: `சரிசெய்தல் பிரிவு <doc_one-click_deploy_troubleshooting>`.
uk: Якщо у вас виникли проблеми з розгортанням одним натисканням, перегляньте :ref:`Troubleshooting section <doc_one-click_deploy_troubleshooting>`.
zh_hans: 如果你在一键部署方面遇到了问题，可参考\ :ref:`一键部署的故障排除 <doc_one-click_deploy_troubleshooting>`\ 。

source: Translation status
ko: 번역 상태

source: Configuring the location of the Android SDK in Godot
ru: Настройка расположения Android SDK в Godot
uk: Налаштування розташування Android SDK у Godot

source: The vendors plugin can be downloaded from the asset library, search for "OpenXR vendors" and install the one named "Godot OpenXR Vendors plugin v4".
ru: Плагин поставщиков можно загрузить из библиотеки ресурсов, найдите "OpenXR Vendors" и установите плагин под названием "Godot OpenXR Vendors plugin v4".
uk: Плагін для постачальників можна завантажити з бібліотеки ресурсів, знайти "Postations OpenXR" та встановити плагін під назвою "Godot OpenXR Vendors plugin v4".

source: You will find the installed files inside the **addons** folder. Alternatively you can manually install the vendors plugin by downloading it `from the release page here <https://github.com/GodotVR/godot_openxr_vendors/releases>`__. You will need to copy the `assets/addons/godotopenxrvendors` folder from the zip file into your projects `addons` folder.
ru: Установленные файлы находятся в папке **addons**. Вы также можете установить плагин Vendors вручную, скачав его со страницы релиза здесь: <https://github.com/GodotVR/godot_openxr_vendors/releases>. Вам нужно будет скопировать папку `assets/addons/godotopenxrvendors` из ZIP-архива в папку `addons` вашего проекта.
uk: Встановлені файли ви знайдете в папці **addons**. Або ж ви можете вручну встановити плагін vendors, завантаживши його зі сторінки релізу тут <https://github.com/GodotVR/godot_openxr_vendors/releases>`__. Вам потрібно буде скопіювати папку `assets/addons/godotopenxrvendors` з zip-файлу в папку `addons` вашого проекту.

source: If the vendors plugins were installed correctly you should find entries for the different headsets under **XR Features**. Change the **XR Mode** to **OpenXR**, then select the entry for your headset if you see one. If you don't see one enable the Khronos plugin.
ru: Если плагины поставщика установлены правильно, вы найдёте записи для различных гарнитур в разделе **XR Features**. Измените **XR Mode** на **OpenXR**, затем выберите запись для вашей гарнитуры, если она есть. Если её нет, включите плагин Khronos.
uk: Якщо плагіни постачальників було встановлено правильно, ви повинні знайти записи для різних гарнітур у розділі **XR Features**. Змініть **XR Mode** на **OpenXR**, потім виберіть запис для вашої гарнітури, якщо він є. Якщо ви не бачите жодного, увімкніть плагін Khronos.

source: Scroll to the bottom of the list and you'll find additional XR feature sections, currently only **Meta XR Features**, **Pico XR Features**, **Magicleap XR Features** and **Khronos XR Features** for HTC are available. You will need to select the appropriate settings if you wish to use these features.
ru: Прокрутите список до конца, и вы увидите разделы с дополнительными функциями XR. В настоящее время доступны только **Функции Meta XR**, **Функции Pico XR**, **Функции Magicleap XR** и **Функции Khronos XR** для HTC. Для использования этих функций вам потребуется настроить соответствующие параметры.
uk: Прокрутіть список донизу, і ви знайдете додаткові розділи функцій XR. Наразі для HTC доступні лише **Функції Meta XR**, **Функції Pico XR**, **Функції Magicleap XR** та **Функції Khronos XR**. Вам потрібно буде вибрати відповідні налаштування, якщо ви хочете використовувати ці функції.
