Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/openxr_hand_tracking.po
Languages: de, fr, ga, it, ru, ta, uk, zh_cn, zh_tw

source: The `hand interaction profile extension <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_EXT_hand_interaction>`_ is a new core extension which supports pinch, grasp, and poke gestures and related poses. There is still limited support for this extension but it should become available in more runtimes in the near future.
de: Die `Handinteraktionsprofilerweiterung <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_EXT_hand_interaction>`_ ist eine neue Kernerweiterung, die Pinch-, Greif- und Poke-Gesten und damit verbundene Posen unterstützt. Diese Erweiterung wird derzeit noch nur eingeschränkt unterstützt, sollte aber in naher Zukunft in weiteren Laufzeiten verfügbar sein.
ga: Is síneadh croí nua é an síneadh próifíle idirghníomhaíochta láimhe <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_EXT_hand_interaction>`_ a thacaíonn le pinch, tuiscint, agus gothaí poke agus cumaí gaolmhara. Tá tacaíocht teoranta fós ann don síneadh seo ach ba cheart go mbeadh sé ar fáil i níos mó ama rite go luath amach anseo.
ru: `Расширение профиля взаимодействия рук <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_EXT_hand_interaction>`_ — это новое базовое расширение, поддерживающее жесты сжатия, захвата и тыкания, а также связанные с ними позы. Поддержка этого расширения пока ограничена, но в ближайшем будущем оно должно стать доступным в большем количестве сред выполнения.
ta: `கை தொடர்பு சுயவிவர நீட்டிப்பு <https://github.khronos.org/openxr-inventory/extension_support.html#xr_ext_and_interaction>` _ என்பது ஒரு புதிய மைய நீட்டிப்பாகும், இது பிஞ்ச், கிராச்ப் மற்றும் போக் சைகைகள் மற்றும் தொடர்புடைய போச்களை ஆதரிக்கிறது. இந்த நீட்டிப்புக்கு இன்னும் மட்டுப்படுத்தப்பட்ட உதவி உள்ளது, ஆனால் இது எதிர்காலத்தில் அதிக இயக்கங்களில் கிடைக்க வேண்டும்.
uk: `Розширення профілю взаємодії з рукою <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_EXT_hand_interaction>`_ — це нове базове розширення, яке підтримує жести щипків, захоплень і тикань, а також відповідні пози. Підтримка цього розширення все ще обмежена, але найближчим часом воно має стати доступним у більшій кількості програм виконання.
zh_tw: `手部互動設定檔擴充 <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_EXT_hand_interaction>`_ 為全新核心擴充，支援捏合（Pinch）、抓握（Grasp）、點按（Poke）等手勢及相關姿勢。目前僅有部分執行環境支援，未來預計會有更多平台支援。

source: The pinch gesture is triggered by pinching your thumb and index finger together. This is often used as a select gesture for menu systems, similar to using your controller to point at an object and press the trigger to select and is thus often mapped as such.
de: Die Pinch-Geste wird durch Zusammenziehen von Daumen und Zeigefinger ausgelöst. Dies wird häufig als Auswahlgeste für Menüsysteme verwendet, ähnlich wie wenn Sie mit Ihrem Controller auf ein Objekt zeigen und den Auslöser drücken, um es auszuwählen, und wird daher häufig als solche abgebildet.
ga: Spreagtar an comhartha píosa trí d'ordóg agus do mhéar innéacs a phriontáil le chéile. Is minic a úsáidtear é seo mar chomhartha roghnaithe do chórais roghchláir, cosúil le do rialtóir a úsáid chun réad a chur in iúl agus an truicear a bhrú chun a roghnú agus dá bhrí sin is minic a mappáiltear é mar sin.
ru: Жест "pinch" (щипок) активируется сведением большого и указательного пальцев вместе. Он часто используется для выбора в системах меню, подобно тому, как если бы вы указывали на объект с помощью контроллера и нажимали на триггер для его выбора, и поэтому часто отображается соответствующим образом.
ta: உங்கள் கட்டைவிரல் மற்றும் குறியீட்டு விரலை ஒன்றாக கிள்ளுவதன் மூலம் பிஞ்ச் சைகை தூண்டப்படுகிறது. இது பெரும்பாலும் பட்டியல் அமைப்புகளுக்கான தேர்ந்தெடுக்கப்பட்ட சைகையாகப் பயன்படுத்தப்படுகிறது, இது ஒரு பொருளைச் சுட்டிக்காட்ட உங்கள் கட்டுப்படுத்தியைப் பயன்படுத்துவதைப் போன்றது மற்றும் தேர்ந்தெடுக்க தூண்டுதலை அழுத்தவும், இதனால் பெரும்பாலும் வரைபடமாக்கப்படுகிறது.
uk: Жест щіпки активується, якщо звести великий і вказівний пальці разом. Це часто використовується як жест вибору для систем меню, подібно до використання контролера для вказівки на об’єкт і натискання тригера для вибору, і тому часто відображається як такий.
zh_tw: 捏合手勢（Pinch）是指拇指與食指捏在一起，常用於選取動作（如選單選擇），類似以控制器指向物件並按下扳機選取，通常也會這樣對應。

source: The ``pinch pose`` is a pose positioned in the middle between the tip of the thumb and the tip of the index finger and oriented such that a ray cast can be used to identify a target.
de: Bei der ``Pinch-Pose`` handelt es sich um eine Pose, die in der Mitte zwischen der Spitze des Daumens und der Spitze des Zeigefingers positioniert und so ausgerichtet ist, dass ein Ray Cast zur Identifizierung eines Ziels verwendet werden kann.
ga: Is pósa é an ``pósa pince`` atá suite sa lár idir barr an ordóg agus barr an mhéar innéacs agus atá dírithe ionas gur féidir teilgthe gatha a úsáid chun sprioc a aithint.
ru: ``pinch pose`` — это поза, при которой палец располагается посередине между кончиком большого пальца и кончиком указательного пальца и ориентирован таким образом, что с помощью луча можно определить цель.
ta: `` பிஞ்ச் போச்`` என்பது கட்டைவிரலின் நுனிக்கும் குறியீட்டு விரலின் நுனிக்கும் இடையில் நடுவில் நிலைநிறுத்தப்பட்டு, இலக்கை அடையாளம் காண ஒரு கதிர் நடிகர்களைப் பயன்படுத்தலாம்.
uk: «Поза щипка» — це поза, розташована посередині між кінчиком великого та кінчика вказівного пальців і орієнтована таким чином, щоб промінь міг використовуватися для ідентифікації цілі.
zh_tw: ``pinch pose`` （捏合姿勢）會定位在拇指與食指指尖的中間，並以適合進行射線檢測的方向排列，以便偵測選取目標。

source: The ``pinch`` float input is a value between 0.0 (the tip of the thumb and index finger are apart) and 1.0 (the tip of the thumb and index finger are touching).
de: Der Float-Eingang ``Pinch`` ist ein Wert zwischen 0,0 (die Spitzen von Daumen und Zeigefinger sind auseinander) und 1,0 (die Spitzen von Daumen und Zeigefinger berühren sich).
ga: Is é an t-ionchur snámhphointe `pinch`` luach idir 0.0 (tá barr an ordóg agus an mhéar innéacs óna chéile) agus 1.0 (tá barr an ordóg agus an mhéar innéacs ag teagmháil).
ru: Плавающее входное значение ``pinch`` - это значение от 0,0 (кончики большого и указательного пальцев раздвинуты) до 1,0 (кончики большого и указательного пальцев соприкасаются).
ta: `` பிஞ்ச்`` மிதவை உள்ளீடு 0.0 (கட்டைவிரல் மற்றும் ஆள்காட்டி விரலின் முனை தவிர) மற்றும் 1.0 க்கு இடையிலான மதிப்பு (கட்டைவிரல் மற்றும் குறியீட்டு விரலின் நுனி தொடுகிறது).
uk: Плаваючий вхід ``pinch`` — це значення від 0,0 (кінчики великого та вказівного пальців розставлені) до 1,0 (кінчики великого та вказівного пальців торкаються).
zh_tw: ``pinch`` （捏合）輸入為浮點數，0.0 代表拇指與食指分開，1.0 代表指尖接觸。

source: The ``pinch ready`` input is true when the tips of the fingers are (close to) touching.
de: Die Eingabe ``Pinch Ready`` ist wahr, wenn sich die Fingerspitzen (fast) berühren.
ga: Tá an t-ionchur ``pince réidh ``fíor nuair a bhíonn leideanna na méar (gar do) teagmháil.
ru: Вход ``pinch ready`` считается истинным, когда кончики пальцев (почти) соприкасаются.
ta: விரல்களின் உதவிக்குறிப்புகள் (நெருக்கமாக) தொடும்போது `` பிஞ்ச் ரெடி`` உள்ளீடு உண்மை.
uk: Введення «щипнути готово» є істинним, коли кінчики пальців (близько) торкаються.
zh_tw: ``pinch ready`` （捏合就緒）輸入在指尖接觸（或非常接近）時為 true。

source: The grasp gesture is triggered by making a fist and is often used to pick items up, similar to engaging the squeeze input on controllers.
de: Die Greifgeste wird durch das Ballen einer Faust ausgelöst und wird oft verwendet, um Gegenstände aufzuheben, ähnlich wie die Quetscheingabe auf Controllern.
ga: Spreagtar an comhartha greim trí dhoróg a dhéanamh agus is minic a úsáidtear é chun míreanna a phiocadh suas, cosúil leis an ionchur brúite a ghlacadh ar rialaitheoirí.
ru: Жест хватания активируется сжатием кулака и часто используется для подъема предметов, аналогично активации функции сжатия на контроллерах.
ta: பிடியைப் பிடுங்குவதன் மூலம் பிடியைப் பிடுங்குவதன் மூலம் தூண்டப்படுகிறது மற்றும் கட்டுப்படுத்திகளில் கசக்கி உள்ளீட்டை ஈடுபடுத்துவதைப் போலவே, பொருட்களை எடுக்க பெரும்பாலும் பயன்படுத்தப்படுகிறது.
uk: Жест захоплення активується стисненням кулака й часто використовується для підняття предметів, подібно до введення стискання на контролерах.
zh_tw: 抓握手勢（Grasp）為握拳動作，常用於拾取物品，與控制器上的壓握（Squeeze）輸入類似。

source: The ``grasp`` float input is a value between 0.0 (open hand) and 1.0 (fist).
de: Der Float-Input ``Greifen`` ist ein Wert zwischen 0.0 (offene Hand) und 1.0 (Faust).
ga: Is é an t-ionchur snámhphointe ``grasp`` luach idir 0.0 (lámh oscailte) agus 1.0 (dornán).
ru: Входной параметр ``grasp`` с плавающей точкой представляет собой значение от 0,0 (открытая ладонь) до 1,0 (кулак).
ta: `` கிராச்ப்`` மிதவை உள்ளீடு 0.0 (திறந்த கை) மற்றும் 1.0 (ஃபிச்ட்) ஆகியவற்றுக்கு இடையேயான மதிப்பு.
uk: Введення ``grasp`` float є значенням від 0,0 (відкрита долоня) до 1,0 (кулак).
zh_tw: ``grasp`` （抓握）輸入為浮點數，0.0 代表手掌張開，1.0 代表握拳。

source: The ``grasp ready`` input is true when the user made a fist.
de: Die Eingabe ``Greifen bereit`` ist wahr, wenn der Benutzer eine Faust gemacht hat.
ga: Tá an t-ionchur `greim réidh ``fíor nuair a rinne an t-úsáideoir dorn.
ru: Вход ``grasp ready`` становится истинным, когда пользователь сжимает кулак.
ta: பயனர் ஒரு முச்டியை உருவாக்கும் போது `` கிராச்ப் ரெடி`` உள்ளீடு உண்மை.
uk: Введення ``grasp ready`` є істинним, коли користувач стиснув кулак.
zh_tw: ``grasp ready`` （抓握就緒）輸入在使用者握拳時為 true。

source: The poke gesture is triggered by extending your index finger, this one is a bit of an exception as the pose at the tip of your index finger is often used to poke an interactable object. The ``poke pose`` is a pose positioned on the tip of the index finger.
de: Die Anstupsgeste wird durch Ausstrecken des Zeigefingers ausgelöst. Dies ist eine kleine Ausnahme, da die Pose an der Spitze des Zeigefingers häufig verwendet wird, um ein interaktives Objekt anzustupsen. Die ``Anstupspose`` ist eine Pose, die auf der Spitze des Zeigefingers positioniert ist.
ga: Spreagtar an comhartha pota trí do mhéar innéacs a leathnú, is eisceacht é an ceann seo mar is minic a úsáidtear an pósta ag barr do mhéar innéacs chun réad in-idirghníomhaíochta a phostáil. Is pósa atá suite ar bharr an mhéar innéacs é an `póca pósa``.
ru: Жест "poke" (тычёк) активируется вытягиванием указательного пальца. Этот жест — небольшое исключение, поскольку поза кончика указательного пальца часто используется для тыканья во интерактивный объект. ``Poke pose`` (Поза тыканья) — поза, при которой опора делается на кончик указательного пальца.
ta: உங்கள் ஆள்காட்டி விரலை நீட்டிப்பதன் மூலம் போக் சைகை தூண்டப்படுகிறது, இது உங்கள் குறியீட்டு விரலின் நுனியில் உள்ள போச் பெரும்பாலும் ஒரு ஊடாடக்கூடிய பொருளைக் குத்த பயன்படுகிறது. `` போக் போச்`` என்பது குறியீட்டு விரலின் நுனியில் நிலைநிறுத்தப்பட்ட ஒரு போச்.
uk: Жест тикання активується витягуванням вказівного пальця, цей є певним винятком, оскільки поза кінчиком вказівного пальця часто використовується, щоб тикати об’єкт, який можна взаємодіяти. «Поза тикання» — це поза, яка розташовується на кінчику вказівного пальця.
zh_tw: 點按手勢（Poke）是將食指伸直，常用於點擊可互動物件。 ``poke pose`` （點按姿勢）會定位於食指指尖。

source: Finally the ``aim activate (ready)`` input is defined as an input that is 1.0/true when the index finger is extended and pointing at a target that can be activated. How runtimes interpret this, is not clear.
de: Schließlich wird die Eingabe ``Ziel aktivieren (bereit)`` als eine Eingabe definiert, die 1.0/wahr ist, wenn der Zeigefinger ausgestreckt ist und auf ein Ziel zeigt, das aktiviert werden kann. Wie Laufzeiten dies interpretieren, ist nicht klar.
ga: Faoi dheireadh, sainmhínítear an t-ionchur `aidhm gníomhachtaithe (réidh) `mar ionchur atá 1.0/fíor nuair a leathnaítear an méar innéacs agus ag díriú ar sprioc is féidir a ghníomhachtú. Níl soiléir an chaoi a léirmhíníonn amanna reatha é seo.
ru: Наконец, вход ``aim activate (ready)`` определяется как вход, который принимает значение "1.0/true", когда указательный палец вытянут и указывает на цель, которую можно активировать. Как это интерпретируется средой выполнения, неясно.
ta: இறுதியாக `` நோக்கம் செயல்பாடு (தயாராக) `` உள்ளீடு என்பது குறியீட்டு விரல் நீட்டிக்கப்பட்டு, செயல்படுத்தக்கூடிய இலக்கை சுட்டிக்காட்டும் போது 1.0/உண்மை உள்ளீடாக வரையறுக்கப்படுகிறது. ரன் டைம்ச் இதை எவ்வாறு விளக்குகிறது, தெளிவாக இல்லை.
uk: Нарешті, вхід ``aim activate (ready)`` визначається як вхід, який має значення 1.0/true, коли вказівний палець витягнутий і вказує на ціль, яку можна активувати. Як час виконання це інтерпретує, незрозуміло.
zh_tw: 最後，``aim activate (ready)`` 輸入在食指伸直並指向可啟動目標時會為 1.0/true，不過不同執行環境可能解讀方式略有差異。

source: With this setup the normal ``left_hand`` and ``right_hand`` trackers are used and you can thus seamlessly switch between controller and hand tracking input.
de: Bei diesem Setup werden die normalen ``left_hand``- und ``right_hand``-Tracker verwendet und man kann somit nahtlos zwischen Controller- und Hand-Tracking-Eingabe wechseln.
ga: Leis an socrú seo úsáidtear na gnáth-rianairí `` left_hand`` agus `` right_hand`` agus mar sin is féidir leat aistriú gan uaim idir an rialtóir agus ionchur rianaithe láimhe.
ru: При такой настройке используются обычные трекеры ``left_hand`` и ``right_hand``, и вы можете легко переключаться между контроллером и отслеживанием руки.
ta: இந்த அமைப்பின் மூலம் சாதாரண `` இடது_ஆன்ட்`` மற்றும் `` வலது_ஆன்ட்`` டிராக்கர்கள் பயன்படுத்தப்படுகின்றன, இதனால் நீங்கள் கட்டுப்படுத்தி மற்றும் கை கண்காணிப்பு உள்ளீட்டிற்கு இடையில் தடையின்றி மாறலாம்.
uk: При такому налаштуванні використовуються звичайні трекери ``left_hand`` і ``right_hand``, і таким чином ви можете плавно перемикатися між контролером і введенням відстеження руки.
zh_tw: 完成上述設定後，會使用標準的 ``left_hand`` 與 ``right_hand`` 追蹤器，因此可在控制器與手部追蹤間無縫切換輸入方式。

source: You need to enable the hand interaction profile extension in the OpenXR project settings.
de: Sie müssen die Handinteraktionsprofilerweiterung in den OpenXR-Projekteinstellungen aktivieren.
fr: Vous devez activer l'extension du profil d'interaction de main dans les paramètres OpenXR du projet.
ga: Ní mór duit síneadh próifíl idirghníomhaíochta láimhe a chumasú i socruithe tionscadail OpenXR.
ru: Вам необходимо включить расширение профиля взаимодействия рук в настройках проекта OpenXR.
ta: OpenXR திட்ட அமைப்புகளில் கை தொடர்பு சுயவிவர நீட்டிப்பை நீங்கள் இயக்க வேண்டும்.
uk: Вам потрібно ввімкнути розширення профілю взаємодії рук у налаштуваннях проекту OpenXR.
zh_tw: 你需要在 OpenXR 專案設定中啟用手部互動設定檔擴充功能。

source: Microsoft hand interaction profile
de: Microsoft-Handinteraktionsprofil
ga: Próifíl idirghníomhaíochta
ru: Профиль взаимодействия рук Microsoft
ta: நுண்மென் ஏண்ட் தொடர்பு சுயவிவரம்
uk: Профіль взаємодії рук Microsoft
zh_tw: Microsoft 手部互動設定檔

source: The `Microsoft hand interaction profile extension <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_MSFT_hand_interaction>`_ was introduced by Microsoft and loosely mimics the simple controller profile. Meta has also added support for this extension but only on their native OpenXR client, it is currently not available over Meta Link.
de: Die „Microsoft hand interaction profile extension <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_MSFT_hand_interaction>“_ wurde von Microsoft eingeführt und imitiert grob das einfache Controller-Profil. Meta hat auch Unterstützung für diese Erweiterung hinzugefügt, allerdings nur auf ihrem nativen OpenXR-Client. Sie ist derzeit nicht über Meta Link verfügbar.
ga: Thug Microsoft isteach an `síneadh próifíle idirghníomhaithe láimhe <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_MSFT_hand_interaction>`_ agus déanann sé aithris ar phróifíl shimplí an rialtóra. Chuir Meta tacaíocht leis an síneadh seo freisin ach ar a gcliant OpenXR dúchais amháin, níl sé ar fáil faoi láthair thar Meta Link.
ru: `Расширение профиля взаимодействия рук Microsoft <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_MSFT_hand_interaction>`_ было представлено компанией Microsoft и в общих чертах имитирует простой профиль контроллера. Meta также добавила поддержку этого расширения, но только в своём собственном клиенте OpenXR; в настоящее время оно недоступно через Meta Link.
ta: `மைக்ரோசாஃப்ட் ஏண்ட் இன்டராக்சன் சுயவிவர நீட்டிப்பு <https://github.khronos.org/openxr-inventory/extension_support.html#xfft_hand_interaction>` _ மைக்ரோசாப்ட் அறிமுகப்படுத்தப்பட்டது மற்றும் எளிய கட்டுப்பாட்டு சுயவிவரத்தை தளர்த்தியது. இந்த நீட்டிப்புக்கான மேவு ஆதரவையும் சேர்த்தது, ஆனால் அவர்களின் சொந்த ஓபன்எக்ச்ஆர் கிளையண்டில் மட்டுமே, இது தற்போது மேவு இணைப்பில் கிடைக்கவில்லை.
uk: `Розширення профілю взаємодії з рукою Microsoft <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_MSFT_hand_interaction>`_ було представлено корпорацією Майкрософт і приблизно імітує простий профіль контролера. Meta також додала підтримку для цього розширення, але лише на рідному клієнті OpenXR, наразі воно недоступне через Meta Link.
zh_tw: `Microsoft 手部互動設定檔擴充 <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_MSFT_hand_interaction>`_ 由微軟提出，設計上大致模仿簡易控制器設定檔。Meta 也已支援此擴充，但僅限其原生 OpenXR 用戶端，目前在 Meta Link 上尚未提供。

source: Pinch support is exposed through the ``select`` input, the value of which is 0.0 when the tip of the thumb and index finger are apart and 1.0 when they are together.
de: Die Pinch-Unterstützung wird über die Eingabe ``select`` verfügbar gemacht. Der Wert beträgt 0.0, wenn die Spitzen von Daumen und Zeigefinger auseinander liegen, und 1.0, wenn sie zusammen liegen.
ga: Nochtar tacaíocht phince tríd an ionchur ``roghnaí`, a luach 0.0 nuair a bhíonn barr an ordóg agus an mhéar innéacs óna chéile agus 1.0 nuair a bhíonn siad le chéile.
ru: Поддержка сжатия доступна через вход ``select``, значение которого равно 0,0, когда кончики большого и указательного пальцев раздвинуты, и 1,0, когда они вместе.
ta: `` தேர்ந்தெடுக்கப்பட்ட` உள்ளீடு மூலம் பிஞ்ச் உதவி அம்பலப்படுத்தப்படுகிறது, கட்டைவிரல் மற்றும் குறியீட்டு விரலின் முனை தவிர்த்து, அவை ஒன்றாக இருக்கும்போது 1.0 ஆக இருக்கும்போது அதன் மதிப்பு 0.0 ஆகும்.
uk: Підтримка щипків доступна через вхід ``select``, значення якого становить 0,0, коли кінчики великого та вказівного пальців розведені, і 1,0, коли вони разом.
zh_tw: 捏合動作可透過 ``select`` 輸入取得：拇指與食指分開時值為 0.0，指尖接觸時為 1.0。

source: Note that in this profile the ``aim pose`` is redefined as a pose between thumb and index finger, oriented so a ray cast can be used to identify a target.
de: Beachten Sie, dass in diesem Profil die ``Zielpose`` als Pose zwischen Daumen und Zeigefinger neu definiert wird, die so ausgerichtet ist, dass ein Ray Cast zum Identifizieren eines Ziels verwendet werden kann.
ga: Tabhair faoi deara go ndéantar an ``pósa aidhm ``sa phróifíl seo a athshainiú mar phost idir ordóg agus méar innéacs, dírithe ionas gur féidir teilgthe gatha a úsáid chun sprioc a aithint.
ru: Обратите внимание, что в этом профиле ``aim pose`` переопределена как поза между большим и указательным пальцами, ориентированная таким образом, чтобы можно было использовать луч для определения цели.
ta: இந்த சுயவிவரத்தில் `` நோக்கம் போச்`` கட்டைவிரலுக்கும் ஆள்காட்டி விரலுக்கும் இடையில் ஒரு போசாக மறுவரையறை செய்யப்படுகிறது, எனவே ஒரு இலக்கை அடையாளம் காண ஒரு கதிர் நடிகர்களைப் பயன்படுத்தலாம்.
uk: Зауважте, що в цьому профілі ``позу прицілювання`` перевизначено як позу між великим і вказівним пальцями, орієнтовану таким чином, щоб можна було використовувати промінь для ідентифікації цілі.
zh_tw: 注意，此設定檔中 ``aim pose`` （瞄準姿勢）重新定義為拇指與食指之間的位置，並以便於進行射線檢測的方向排列。

source: Grasp support is exposed through the ``squeeze`` input, the value of which is 0.0 when the hand is open, and 1.0 when a fist is made.
de: Die Greifunterstützung wird durch die Eingabe ``Quetschen`` verfügbar gemacht, deren Wert 0.0 beträgt, wenn die Hand geöffnet ist, und 1.0, wenn die Faust geballt ist.
ga: Nochtar tacaíocht greim tríd an ionchur ``scriosca``, a luach 0.0 nuair a bhíonn an lámh oscailte, agus 1.0 nuair a dhéantar dorn.
ru: Поддержка захвата осуществляется через вход ``squeeze``, значение которого равно 0,0, когда ладонь открыта, и 1,0, когда ладонь сжата в кулак.
ta: `` கசக்கி` உள்ளீடு மூலம் கிராச்ப் உதவி வெளிப்படும், இதன் மதிப்பு கை திறந்திருக்கும் போது 0.0, மற்றும் ஒரு முழங்கை செய்யப்படும்போது 1.0 ஆகும்.
uk: Підтримка захоплення виявляється через введення ``стискання``, значення якого становить 0,0, коли долоня відкрита, і 1,0, коли стискається кулак.
zh_tw: 抓握動作可透過 ``squeeze`` 輸入取得：手掌張開時值為 0.0，握拳時為 1.0。

source: HTC hand interaction profile
de: HTC-Handinteraktionsprofil
ga: Próifíl idirghníomhaíochta
it: Profilo di interazione della mano HTC
ru: Профиль взаимодействия рук HTC
ta: HTC கை தொடர்பு சுயவிவரம்
uk: Профіль взаємодії з рукою HTC
zh_tw: HTC 手部互動設定檔

source: The `HTC hand interaction profile extension <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_HTC_hand_interaction>`_ was introduced by HTC and is defined similarly to the Microsoft extension. It is only supported by HTC for the Focus 3 and Elite XR headsets.
de: Die `htc Hand Interaction Profile Extension <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_HTC_hand_interaction>`_ wurde von HTC eingeführt und ist ähnlich wie die Microsoft-Erweiterung definiert. Sie wird von HTC nur für die Headsets Focus 3 und Elite XR unterstützt.
ga: Thug HTC isteach an síneadh próifíle idirghníomhaíochta láimhe `HTC <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_HTC_hand_interaction>`_ agus sainmhínítear é mar an gcéanna le síneadh Microsoft. Ní thacaíonn HTC ach leis na cluasáin Focus 3 agus Elite XR.
ru: `Расширение профиля взаимодействия рук HTC <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_HTC_hand_interaction>`_ было представлено компанией HTC и определено аналогично расширению Microsoft. Оно поддерживается HTC только для гарнитур Focus 3 и Elite XR.
ta: `HTC கை தொடர்பு சுயவிவர நீட்டிப்பு <https://github.khronos.org/openxr-inventory/extension_support.html#xr_htc_hand_interaction>` _ HTC ஆல் அறிமுகப்படுத்தப்பட்டது மற்றும் இது மைக்ரோசாப்ட் நீட்டிப்புக்கு ஒத்ததாக வரையறுக்கப்படுகிறது. கவனம் 3 மற்றும் எலைட் எக்ச்ஆர் எட்செட்களுக்கு மட்டுமே இது HTC ஆல் ஆதரிக்கப்படுகிறது.
uk: `Розширення профілю взаємодії рук HTC <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_HTC_hand_interaction>`_ було представлено HTC і визначається подібно до розширення Microsoft. Він підтримується лише HTC для гарнітур Focus 3 і Elite XR.
zh_tw: `HTC 手部互動設定檔擴充 <https://github.khronos.org/OpenXR-Inventory/extension_support.html#XR_HTC_hand_interaction>`_ 由 HTC 提出，定義方式與 Microsoft 擴充類似。目前僅 HTC Focus 3 與 Elite XR 頭顯支援。

source: See the Microsoft hand interaction profile for the gesture support.
de: Informationen zur Gestenunterstützung finden Sie im Microsoft-Handinteraktionsprofil.
ga: Féach próifíl idirghníomhaíochta láimhe Microsoft don tacaíocht chomhartha.
ru: Информацию о поддержке жестов см. в профиле взаимодействия рук Microsoft.
ta: சைகை ஆதரவுக்கு நுண்மென் ஏண்ட் தொடர்பு சுயவிவரத்தைப் பார்க்கவும்.
uk: Щоб дізнатися про підтримку жестів, перегляньте профіль взаємодії рук Microsoft.
zh_tw: 手勢支援請參考 Microsoft 手部互動設定檔。
