Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/openxr_hand_tracking.po
Languages: de, fr, ga, it, ru, ta, uk, zh_cn, zh_tw

source: The information presented on this page was used to create a demo project that can be found `here <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_.
de: Die auf dieser Seite dargestellten Informationen wurden zum Erstellen eines Demoprojekts verwendet, das Sie `hier <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_ finden.
ga: Baineadh úsáid as an bhfaisnéis a chuirtear i láthair ar an leathanach seo chun tionscadal taispeána a chruthú atá le fáil `anseo <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_.
it: Le informazioni presentate in questa pagina sono state utilizzate per creare un progetto di dimostrazione che si trova `qui <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_.
ru: Информация, представленная на этой странице, была использована для создания демонстрационного проекта, который можно найти `здесь <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_.
ta: இந்த பக்கத்தில் வழங்கப்பட்ட தகவல்கள் `இங்கே <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo> _ _.
uk: Інформація, представлена на цій сторінці, була використана для створення демонстраційного проекту, який можна знайти `тут <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_.
zh_tw: 本頁所介紹的內容已用於建置一份展示專案，專案可於此處取得：`https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_ 。

source: The Hand Tracking API
de: Die Hand Tracking API
ga: An API Rianaithe Láimhe
it: L'API di tracciamento delle mani
ru: API отслеживания рук
ta: கை கண்காணிப்பு பநிஇ
uk: API відстеження рук
zh_cn: 手部跟踪 API
zh_tw: 手部追蹤 API

source: As mentioned in our introduction, the hand tracking API is primarily used with optical hand tracking and on many platforms only works when the user is not holding a controller. Some platforms support controller inferred hand tracking meaning that you will get hand tracking data even if the user is holding a controller. This includes SteamVR, Meta Quest (currently native only but Meta link support is likely coming), and hopefully soon others as well.
de: Wie in unserer Einleitung erwähnt, wird die Hand-Tracking-API hauptsächlich mit optischem Hand-Tracking verwendet und funktioniert auf vielen Plattformen nur, wenn der Benutzer keinen Controller hält. Einige Plattformen unterstützen vom Controller abgeleitetes Hand-Tracking, was bedeutet, dass Sie Hand-Tracking-Daten erhalten, auch wenn der Benutzer einen Controller hält. Dazu gehören SteamVR, Meta Quest (derzeit nur nativ, aber Meta-Link-Unterstützung kommt wahrscheinlich) und hoffentlich bald auch andere.
ga: Mar a luadh inár réamhrá, úsáidtear an API rianaithe láimhe go príomha le rianú láimhe optúil agus ar go leor ardáin ní oibríonn sé ach nuair nach bhfuil rialtóir ag an úsáideoir. Tacaíonn roinnt ardáin le rianú láimhe chun cinn leis an rialtóir a chiallaíonn go bhfaighidh tú sonraí rianaithe láimhe fiú má tá rialtóir ag an úsáideoir. Áirítear leis seo SteamVR, Meta Quest (dúchasach amháin faoi láthair ach is dócha go bhfuil tacaíocht nasc Meta ag teacht), agus tá súil agam go luath daoine eile freisin.
ru: Как упоминалось во введении, API отслеживания рук в основном используется для оптического отслеживания рук и на многих платформах работает только тогда, когда пользователь не держит контроллер. Некоторые платформы поддерживают отслеживание рук по контроллеру, что означает, что данные будут получены, даже если пользователь держит контроллер. К ним относятся SteamVR, Meta Quest (пока только нативная поддержка, но поддержка Meta Link, вероятно, появится), а вскоре, возможно, и другие.
ta: எங்கள் அறிமுகத்தில் குறிப்பிட்டுள்ளபடி, கை கண்காணிப்பு பநிஇ முதன்மையாக ஆப்டிகல் ஏண்ட் டிராக்கிங் மூலம் பயன்படுத்தப்படுகிறது மற்றும் பல தளங்களில் பயனர் ஒரு கட்டுப்படுத்தியை வைத்திருக்காதபோது மட்டுமே செயல்படும். சில இயங்குதளங்கள் கட்டுப்பாட்டாளர் ஊகிக்கப்பட்ட கை கண்காணிப்பு, அதாவது பயனர் ஒரு கட்டுப்படுத்தியை வைத்திருந்தாலும் கூட நீங்கள் கை கண்காணிப்பு தரவைப் பெறுவீர்கள். இதில் ச்டீம்விஆர், மேவு குவெச்ட் (தற்போது பழமை மட்டுமே ஆனால் மேவு இணைப்பு உதவி வரக்கூடும்), விரைவில் மற்றவர்களும் அடங்கும்.
uk: Як згадувалося у нашому вступі, API відстеження рук в основному використовується з оптичним відстеженням рук і на багатьох платформах працює лише тоді, коли користувач не тримає контролер. Деякі платформи підтримують відстеження рук контролера, що означає, що ви отримуватимете дані відстеження рук, навіть якщо користувач тримає контролер. Це включає SteamVR, Meta Quest (наразі лише нативний, але, ймовірно, з’явиться підтримка метапосилання), і, сподіваюся, незабаром також інші.
zh_tw: 如前述，手部追蹤 API 主要用於光學手部追蹤，且多數平台僅於使用者未持控制器時可用。部分平台則支援從控制器數據推算手部追蹤，因此即使玩家手持控制器也能取得手部追蹤資料。目前支援的有 SteamVR、Meta Quest（目前僅原生支援，Meta Link 預計未來也會支援），其他平台也預期陸續支援。

source: The hand tracking implementation in Godot has been standardized around the Godot Humanoid Skeleton and works both in OpenXR and WebXR. The instructions below will thus work in both environments.
de: Die Implementierung der Handverfolgung in Godot wurde auf der Grundlage des Godot Humanoid Skeleton standardisiert und funktioniert sowohl in OpenXR als auch in WebXR. Die folgenden Anweisungen funktionieren daher in beiden Umgebungen.
ga: Tá an cur i bhfeidhm rianaithe láimhe i Godot caighdeánaithe timpeall an Cnámharlaigh Humanoid Godot agus oibríonn sé i OpenXR agus i WebXR araon. Mar sin oibreoidh na treoracha thíos sa dá thimpeallacht.
ru: Реализация отслеживания рук в Godot стандартизирована на основе Godot Humanoid Skeleton и работает как в OpenXR, так и в WebXR. Таким образом, инструкции ниже будут работать в обеих средах.
ta: கோடோட்டில் கை கண்காணிப்பு செயல்படுத்தல் கோடோட் அ்யூமாய்டு எலும்புக்கூட்டைச் சுற்றி தரப்படுத்தப்பட்டுள்ளது மற்றும் ஓபன்எக்ச்ஆர் மற்றும் வெப்எக்ச்ஆர் இரண்டிலும் செயல்படுகிறது. கீழே உள்ள வழிமுறைகள் இரு சூழல்களிலும் செயல்படும்.
uk: Реалізація відстеження руки в Godot стандартизована навколо скелета людини Godot і працює як в OpenXR, так і в WebXR. Таким чином, наведені нижче інструкції працюватимуть в обох середовищах.
zh_tw: Godot 的手部追蹤功能已標準化，採用 Godot Humanoid Skeleton（人形骨架），可同時用於 OpenXR 與 WebXR。以下說明皆適用於這兩種環境。

source: In order to use the hand tracking API with OpenXR you first need to enable it. This can be done in the project settings:
de: Um die Hand-Tracking-API mit OpenXR zu verwenden, müssen Sie sie zuerst aktivieren. Dies kann in den Projekteinstellungen erfolgen:
ga: D'fhonn an API rianaithe láimhe a úsáid le OpenXR ní mór duit é a chumasú ar dtús. Is féidir é seo a dhéanamh i socruithe an tionscadail:
ru: Чтобы использовать API отслеживания рук в OpenXR, необходимо сначала включить его. Это можно сделать в настройках проекта:
ta: OpenXR உடன் கை கண்காணிப்பு பநிஇ ஐப் பயன்படுத்த நீங்கள் முதலில் அதை இயக்க வேண்டும். திட்ட அமைப்புகளில் இதைச் செய்யலாம்:
uk: Щоб використовувати API відстеження руки з OpenXR, вам спочатку потрібно його ввімкнути. Це можна зробити в налаштуваннях проекту:
zh_tw: 在 OpenXR 環境使用手部追蹤 API 前，需先於專案設定中啟用相關功能：

source: For some standalone XR devices you also need to configure the hand tracking extension in export settings, for instance for Meta Quest:
de: Für einige eigenständige XR-Geräte müssen Sie auch die Handverfolgungserweiterung in den Exporteinstellungen konfigurieren, beispielsweise für Meta Quest:
ga: Maidir le roinnt feistí XR neamhspleácha ní mór duit an síneadh rianaithe láimhe a chumrú i socruithe onnmhairithe, mar shampla do Meta Quest:
ru: Для некоторых автономных устройств XR также необходимо настроить расширение отслеживания рук в настройках экспорта, например для Meta Quest:
ta: சில முழுமையான எக்ச்ஆர் சாதனங்களுக்கு நீங்கள் ஏற்றுமதி அமைப்புகளில் கை கண்காணிப்பு நீட்டிப்பையும் கட்டமைக்க வேண்டும், எடுத்துக்காட்டாக மேவு தேடலுக்கானது:
uk: Для деяких автономних пристроїв XR вам також потрібно налаштувати розширення відстеження руки в налаштуваннях експорту, наприклад для Meta Quest:
zh_tw: 某些獨立式 XR 裝置（如 Meta Quest）還需於匯出設定中啟用手部追蹤擴充功能：

source: Now you need to add 3 components into your scene for each hand:
de: Jetzt müssen Sie für jede Hand drei Komponenten zu Ihrer Szene hinzufügen:
ga: Anois ní mór duit 3 chomhpháirt a chur isteach i do radharc do gach lámh:
ru: Теперь вам нужно добавить в сцену по 3 компонента для каждой руки:
ta: இப்போது நீங்கள் ஒவ்வொரு கைக்கும் உங்கள் காட்சியில் 3 கூறுகளைச் சேர்க்க வேண்டும்:
uk: Тепер вам потрібно додати 3 компоненти в вашу сцену для кожної руки:
zh_tw: 接著，請在場景中為每隻手分別加入以下三個元件：

source: A tracked node to position the hand.
de: Ein verfolgter Knoten zum Positionieren der Hand.
ga: Nód rianaithe chun an lámh a shuíomh.
ru: Отслеживаемый узел для позиционирования руки.
ta: கையை நிலைநிறுத்த ஒரு கண்காணிக்கப்பட்ட முனை.
uk: Гусеничний вузол для позиціонування руки.
zh_tw: 一個用於定位手部的追蹤節點。

source: A properly skinned hand mesh with skeleton.
de: Ein richtig geskinntes Handmesh mit Skelett.
ga: Mogalra láimhe craiceann i gceart le cnámharlaigh.
ru: Правильно обработанная сетка руки со скелетом.
ta: எலும்புக்கூட்டுடன் ஒழுங்காக தோல் கை கண்ணி.
uk: Правильно очищена ручна сітка зі скелетом.
zh_tw: 一個綁定好骨架與蒙皮的手部網格（Mesh）。

source: A skeleton modifier that applies finger tracking data to the skeleton.
de: Ein Skelett-Modifier, der Finger-Tracking-Daten auf das Skelett anwendet.
ga: Modhnóir creatlach a chuireann sonraí rianaithe méar i bhfeidhm ar an gcnámharlach.
ru: Модификатор скелета, который применяет данные отслеживания пальцев к скелету.
ta: எலும்புக்கூட்டுக்கு விரல் கண்காணிப்பு தரவைப் பயன்படுத்தும் எலும்புக்கூடு மாற்றியமைப்பாளர்.
uk: Модифікатор скелета, який застосовує дані відстеження пальців до скелета.
zh_tw: 一個骨架修改器，用於將手指追蹤資料套用至骨架。

source: Hand tracking node
de: Handtrackingnodes
ga: Nód rianaithe láimhe
it: Nodo di tracciamento delle mani
ru: Узел отслеживания рук
ta: கை கண்காணிப்பு முனை
uk: Вузол відстеження руки
zh_cn: 手部跟踪节点
zh_tw: 手部追蹤節點

source: The hand tracking system uses separate hand trackers to track the position of the player's hands within our tracking space.
de: Das Handtrackingsystem verwendet separate Handtracker, um die Position der Hände des Spielers in unserem Verfolgungsraum zu verfolgen.
ga: Úsáideann an córas rianaithe láimhe rianaithe láimhe ar leithligh chun suíomh lámha an imreora a rianú laistigh dár spás rianaithe.
ru: Система отслеживания рук использует отдельные трекеры для отслеживания положения рук игрока в пределах пространства отслеживания.
ta: எங்கள் கண்காணிப்பு இடத்திற்குள் பிளேயரின் கைகளின் நிலையை கண்காணிக்க கை கண்காணிப்பு அமைப்பு தனித்தனி கை டிராக்கர்களைப் பயன்படுத்துகிறது.
uk: Система відстеження рук використовує окремі трекери для відстеження положення рук гравця в нашому просторі відстеження.
zh_tw: 手部追蹤系統會針對玩家雙手分別建立追蹤器，在追蹤空間中即時追蹤手部位置。

source: This information has been separated out for the following use cases:
de: Diese Informationen wurden für die folgenden Anwendungsfälle herausgefiltert:
ga: Tá an fhaisnéis seo scartha amach do na cásanna úsáide seo a leanas:
it: Queste informazioni sono state separate per i seguenti casi d'uso:
ru: Эта информация была разделена для следующих вариантов использования:
ta: பின்வரும் பயன்பாட்டு நிகழ்வுகளுக்கு இந்த செய்தி பிரிக்கப்பட்டுள்ளது:
uk: Ця інформація була розділена для наступних випадків використання:
zh_tw: 這項設計主要針對下列情境進行區分：

source: Tracking happens in the local space of the :ref:`XROrigin3D <class_xrorigin3d>` node. This node must be a child of the `XROrigin3D` node in order to be correctly placed.
de: Die Verfolgung erfolgt im lokalen Bereich des Knotens :ref:`XROrigin3D <class_xrorigin3d>`. Dieser Knoten muss ein untergeordneter Knoten des Knotens `XROrigin3D` sein, um korrekt platziert zu werden.
fr: Le suivi se produit dans l'espace local du nœud :ref:`XROrigin3D <class_xrorigin3d>`. Ce nœud doit être un enfant du nœud `XROrigin3D` afin d'être correctement placé.
ga: Tarlaíonn rianú sa spás áitiúil den nód :ref:`XROrigin3D <class_xrorigin3d>`. Caithfidh an nód seo a bheith ina leanbh den nód `XROrigin3D` chun é a chur i gceart.
ru: Отслеживание происходит в локальном пространстве узла :ref:`XROrigin3D <class_xrorigin3d>`. Для корректного размещения этот узел должен быть дочерним по отношению к узлу `XROrigin3D`.
ta: உள்ளக இடத்தில் கண்காணிப்பு நடக்கிறது: ref: `xrorigin3d <class_xrorigin3d>` முனை. இந்த முனை சரியாக வைக்கப்படுவதற்கு `xrorigin3d` முனையின் குழந்தையாக இருக்க வேண்டும்.
uk: Відстеження відбувається в локальному просторі вузла :ref:`XROrigin3D <class_xrorigin3d>`. Для правильного розміщення цей вузол має бути дочірнім вузлом `XROrigin3D`.
zh_tw: 追蹤會在 :ref:`XROrigin3D <class_xrorigin3d>` 節點的本地座標空間進行。必須將手部追蹤節點設為 `XROrigin3D` 的子節點，才能正確定位。

source: This node can be used as an IK target when an upper body mesh with arms is used instead of separate hand meshes.
de: Dieser Knoten kann als IK-Ziel verwendet werden, wenn anstelle von separaten Handnetzen ein Oberkörpernetz mit Armen verwendet wird.
ga: Is féidir an nód seo a úsáid mar sprioc IK nuair a úsáidtear mogalra coirp uachtarach le hairm in ionad mogalra láimhe ar leithligh.
ru: Этот узел можно использовать в качестве цели IK, когда вместо отдельных сеток кистей рук используется сетка верхней части тела с руками.
ta: தனித்தனி கை மெச்களுக்கு பதிலாக ஆயுதங்களைக் கொண்ட மேல் உடல் கண்ணி பயன்படுத்தப்படும்போது இந்த முனை ஐ.கே இலக்காக பயன்படுத்தப்படலாம்.
uk: Цей вузол можна використовувати як IK-мішень, коли використовується сітка верхньої частини тіла з руками замість окремих сіток рук.
zh_tw: 當你使用帶有手臂的上半身網格（而非單獨的手部網格）時，也可以將手部追蹤節點作為 IK（反向運動學）的目標節點。

source: Actual placement of the hands may be loosely bound to the tracking in scenarios such as avatar creation UIs, fake mirrors, or similar situations resulting in the hand mesh and finger tracking being localized elsewhere.
de: Die tatsächliche Platzierung der Hände kann in Szenarien wie Benutzeroberflächen zur Avatar-Erstellung, falschen Spiegeln oder ähnlichen Situationen lose an die Verfolgung gebunden sein, was dazu führt, dass das Handmesh und das Fingertracking an einer anderen Stelle lokalisiert werden.
ga: D’fhéadfadh socrúchán na lámha a bheith ceangailte go scaoilte leis an rianú i gcásanna ar nós UI cruthaithe abhatár, scátháin bhréige, nó cásanna comhchosúla a d’fhágfadh go ndéanfaí an mhogalra láimhe agus an rian méar a logánú in áit eile.
ru: Фактическое размещение рук может быть слабо связано с отслеживанием в таких сценариях, как пользовательские интерфейсы создания аватара, поддельные зеркала или аналогичные ситуации, в результате чего сетка руки и отслеживание пальцев локализуются в другом месте.
ta: அவதார் உருவாக்கம் யுஐஎச், போலி கண்ணாடிகள் அல்லது ஒத்த சூழ்நிலைகள் போன்ற காட்சிகளில் கைகளின் உண்மையான இடம் கண்காணிப்புக்கு தளர்வாக பிணைக்கப்படலாம், இதன் விளைவாக கை கண்ணி மற்றும் விரல் கண்காணிப்பு வேறு இடங்களில் மொழிபெயர்க்கப்படுகிறது.
uk: Фактичне розташування рук може бути слабко пов’язане з відстеженням у таких сценаріях, як інтерфейси створення аватарів, підроблені дзеркала чи подібні ситуації, що призводить до того, що сітка рук і відстеження пальців локалізуються в іншому місці.
zh_cn: 手部的实际放置位置可能与追踪结果存在松散绑定关系。这种情况常见于角色创建界面、虚拟镜子等类似场景，在这些情况下，手部网格和手指追踪可能会被定位到其他位置。
zh_tw: 在某些情境下（如虛擬人偶創建 UI、鏡像效果等），手部的實際顯示位置可能不會嚴格綁定追蹤資料，因而手部網格與手指追蹤可能會被定位到其他位置。

source: We'll concentrate on the first use case only.
de: Wir konzentrieren uns nur auf den ersten Anwendungsfall.
ga: Dírífimid ar an gcéad chás úsáide amháin.
ru: Мы сосредоточимся только на первом варианте использования.
ta: முதல் பயன்பாட்டு வழக்கில் மட்டுமே கவனம் செலுத்துவோம்.
uk: Ми зосередимося лише на першому випадку використання.
zh_cn: 我们只考虑第一个用例。
zh_tw: 以下將僅聚焦於第一種使用情境。

source: For this you need to add an :ref:`XRNode3D <class_xrnode3d>` node to your ``XROrigin3D`` node.
de: Dazu müssen Sie Ihrem ``XROrigin3D``-Knoten einen :ref:`XRNode3D <class_xrnode3d>`-Knoten hinzufügen.
fr: Pour cela, vous devez ajouter un nœud :ref:`XRNode3D <class_xrnode3d>` à votre nœud ``XROrigin3D``.
ga: Chuige seo ní mór duit nód :ref:`XRNode3D <class_xrnode3d>` a chur le do nód ``XROrigin3D``.
ru: Для этого вам необходимо добавить узел :ref:`XRNode3D <class_xrnode3d>` к вашему узлу ``XROrigin3D``.
ta: இதற்காக நீங்கள் சேர்க்க வேண்டும்: ref: `xrnode3d <class_xrnode3d>` உங்கள் `Xrorigin3d`` முனைக்கு முனை.
uk: Для цього вам потрібно додати вузол :ref:`XRNode3D <class_xrnode3d>` до вашого вузла ``XROrigin3D``.
zh_cn: 为此，你需要在 ``XROrigin3D`` 节点中添加一个 :ref:`XRNode3D <class_xrnode3d>` 节点。
zh_tw: 你需要在 ``XROrigin3D`` 節點下新增一個 :ref:`XRNode3D <class_xrnode3d>` 節點。

source: On this node the ``tracker`` should be set to ``/user/hand_tracker/left`` or ``/user/hand_tracker/right`` for the left or right hand respectively.
de: Auf diesem Knoten sollte der ``Tracker`` auf ``/user/hand_tracker/left`` oder ``/user/hand_tracker/right`` für die linke bzw. rechte Hand eingestellt werden.
ga: Ar an nód seo ba chóir an ``tracker`` a shocrú go ``/user/hand_tracker/left`` nó ``/user/hand_tracker/right`` don lámh chlé nó ar dheis faoi seach.
ru: На этом узле ``tracker`` должен быть установлен на ``/user/hand_tracker/left`` или ``/user/hand_tracker/right`` для левой или правой руки соответственно.
ta: இந்த முனையில் `` டிராக்கர்`` முறையே இடது அல்லது வலது கைக்கு முறையே ``/பயனர்/ஏண்ட்_டிராக்கர்/இடது`` அல்லது `/பயனர்/ஏண்ட்_டிராக்/ரைட்`` என அமைக்கப்பட வேண்டும்.
uk: На цьому вузлі ``трекер`` повинен бути встановлений на ``/user/hand_tracker/left`` або ``/user/hand_tracker/right`` для лівої або правої руки відповідно.
zh_cn: 该节点上的 ``tracker`` 应设置为 ``/user/hand_tracker/left`` 或 ``/user/hand_tracker/right``\ ，分别对应左右手。
zh_tw: 在該節點上，將 ``tracker`` 設為 ``/user/hand_tracker/left`` 或 ``/user/hand_tracker/right``，分別對應左手或右手。

source: The ``pose`` should remain set to ``default``, no other option will work here.
de: Die ``Pose`` sollte auf ``Standard`` eingestellt bleiben, eine andere Option funktioniert hier nicht.
ga: Ba chóir go bhfanfadh an `pósa`` socraithe go ``réamhshocraithe``, ní oibreoidh aon rogha eile anseo.
ru: ``pose`` следует оставить на уровне ``default``, никакой другой вариант здесь не подойдет.
ta: `` போச்`` `` இயல்புநிலை`` ஆக இருக்க வேண்டும், வேறு எந்த வழியும் இங்கே வேலை செய்யாது.
uk: ``Pose`` має залишатися встановленим ``default``, жоден інший параметр тут не працюватиме.
zh_cn: ``pose`` 应保持设置为 ``default``\ ，其他选项均无法使用。
zh_tw: ``pose`` 屬性需保持 ``default``，其他選項無法正常運作。

source: The checkbox ``Show When Tracked`` will automatically hide this node if no tracking data is available, or make this node visible if tracking data is available.
de: Das Kontrollkästchen ``Bei Verfolgung anzeigen`` blendet diesen Knoten automatisch aus, wenn keine Verfolgungsdaten verfügbar sind, oder macht diesen Knoten sichtbar, wenn Verfolgungsdaten verfügbar sind.
ga: Folóidh an bosca seiceála ``Taispeáin Nuair a Rianaítear ``an nód seo go huathoibríoch mura bhfuil aon sonraí rianaithe ar fáil, nó cuirfidh sé an nód seo le feiceáil má tá sonraí rianaithe ar fáil.
ru: Флажок ``Show When Tracked`` автоматически скроет этот узел, если данные отслеживания недоступны, или сделает этот узел видимым, если данные отслеживания доступны.
ta: கண்காணிப்பு தரவு எதுவும் கிடைக்கவில்லை என்றால் `` கண்காணிக்கப்படும் போது `` காண்பிக்கும்போது தானாகவே இந்த முனையை மறைக்கும், அல்லது கண்காணிப்பு தரவு கிடைத்தால் இந்த முனையைத் தெரியும்.
uk: Прапорець ``Показувати під час відстеження`` автоматично приховає цей вузол, якщо дані відстеження недоступні, або зробить цей вузол видимим, якщо дані відстеження доступні.
zh_tw: 勾選 ``Show When Tracked`` （有追蹤時顯示）時，若無追蹤資料則自動隱藏節點，有追蹤資料時則顯示。

source: Rigged hand mesh
ga: Mogalra láimhe riogtha
it: Mesh di mano con rig
ru: Полигональная сетка для рук с Rigged
ta: மோசடி கை கண்ணி
uk: Сфальсифікована ручна сітка
zh_tw: 綁定骨架的手部網格

source: In order to display our hand we need a hand mesh that is properly rigged and skinned. For this Godot uses the hand bone structure as defined for the :ref:`Godot Humanoid <class_skeletonprofilehumanoid>` but optionally supporting an extra tip bone for each finger.
de: Um unsere Hand anzuzeigen, benötigen wir ein Handnetz, das entsprechend ausgerüstet und geskinnt ist. Hierzu verwendet Godot die Handknochenstruktur, wie sie für den :ref:`Godot Humanoid <class_skeletonprofilehumanoid>` definiert ist, unterstützt aber optional einen zusätzlichen Spitzenknochen für jeden Finger.
ga: Chun ár lámh a thaispeáint ní mór dúinn mogalra láimhe atá rite agus craiceann i gceart. Chuige seo úsáideann Godot an struchtúr cnámh láimhe mar atá sainmhínithe don :ref:`Godot Humanoid <class_skeletonprofilehumanoid>` ach go roghnach ag tacú le cnámh tip breise do gach méar.
ru: Для отображения руки нам нужна правильно настроенная и скинированная модель руки. Для этого Godot использует структуру костей руки, как определено для :ref:`Godot Humanoid <class_skeletonprofilehumanoid>`, но опционально поддерживает дополнительную кость кончика каждого пальца.
ta: நம் கையைக் காண்பிப்பதற்காக எங்களுக்கு ஒரு கை கண்ணி தேவை, அது ஒழுங்காக மோசடி மற்றும் தோல். இந்த கோடோட் வரையறுக்கப்பட்டுள்ளபடி கை எலும்பு கட்டமைப்பைப் பயன்படுத்துகிறது: ref: `கோடோட் மனித உருவம் <class_skeletonprofilehumanoid>` ஆனால் ஒவ்வொரு விரலுக்கும் கூடுதல் முனை எலும்பை விருப்பமாக ஆதரிக்கிறது.
uk: Для того, щоб показати нашу руку, нам потрібна сітка для рук, яка належним чином оснащена та покрита шкірою. Для цього Ґодо використовує структуру кісток руки, як визначено для :ref:`Godot Humanoid <class_skeletonprofilehumanoid>`, але необов’язково підтримує додаткову кінчикову кістку для кожного пальця.
zh_tw: 要顯示手部模型，需要一個綁定好骨架與蒙皮的手部網格。Godot 採用 :ref:`Godot Humanoid <class_skeletonprofilehumanoid>` 定義的手部骨架結構，每根手指也可額外加入指尖骨骼。

source: The `OpenXR hand tracking demo <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_ contains example glTF files of properly rigged hands.
it: La demo di `tracciamento delle mani di OpenXR <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_ contiene file glTF di esempio di mani con rigging correttamente applicato.
ru: Демонстрационная версия отслеживания рук OpenXR <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_ содержит примеры файлов glTF с правильно настроенными руками.
ta: `ஓபன்எக்ச்ஆர் ஏண்ட் டிராக்கிங் டெமோ <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>` _ ஒழுங்காக மோசடி செய்யப்பட்ட கைகளின் எடுத்துக்காட்டு gltf கோப்புகளைக் கொண்டுள்ளது.
zh_tw: `OpenXR 手部追蹤展示專案 <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_hand_tracking_demo>`_ 中包含已正確綁定骨架的 glTF 手部範例檔案。
