Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/openxr_hand_tracking.po
Languages: de, fr, ga, it, ru, ta, uk, zh_cn, zh_tw

source: We will be using those here and add them as a child to our ``XRNode3D`` node. We also need to enable editable children to gain access to our :ref:`Skeleton3D <class_skeleton3d>` node.
de: Wir werden diese hier verwenden und sie als untergeordnetes Element zu unserem Knoten ``XRNode3D`` hinzufügen. Wir müssen auch bearbeitbare untergeordnete Elemente aktivieren, um Zugriff auf unseren Knoten :ref:`Skeleton3D <class_skeleton3d>` zu erhalten.
ga: Beimid ag baint úsáide as iad sin anseo agus ag cur leo mar leanbh chuig ár nód ``XRNode3D``. Ní mór dúinn freisin a chur ar chumas leanaí ineagarthóireachta rochtain a fháil ar ár nód :ref:`Skeleton3D <class_skeleton3d>`.
ru: Мы будем использовать их здесь и добавим в качестве дочерних элементов к нашему узлу ``XRNode3D``. Также нам нужно разрешить редактирование дочерних элементов для доступа к нашему узлу :ref:`Skeleton3D <class_skeleton3d>`.
ta: நாங்கள் இங்கே இருப்பவர்களைப் பயன்படுத்துவோம், அவற்றை எங்கள் `` xrnode3d`` முனையில் ஒரு குழந்தையாகச் சேர்ப்போம். திருத்தக்கூடிய குழந்தைகளுக்கு எங்கள் அணுகலைப் பெறவும் உதவ வேண்டும்: ref: `bolieton3d <class_skeleton3d>` முனை.
uk: Ми будемо використовувати їх тут і додамо їх як дочірні до нашого вузла ``XRNode3D``. Нам також потрібно дозволити дочірнім елементам, які можна редагувати, отримати доступ до нашого вузла :ref:`Skeleton3D <class_skeleton3d>`.
zh_tw: 以下將以這些範例檔案為例，並將其作為 ``XRNode3D`` 的子節點。你也需要啟用可編輯子節點，以便存取 :ref:`Skeleton3D <class_skeleton3d>` 節點。

source: The hand skeleton modifier
de: Der Handskelett-Modifikator
ga: An modhnóir cnámharlaigh láimhe
it: Il modificatore di scheletro di mani
ru: Модификатор скелета руки
ta: கை எலும்புக்கூடு மாற்றியமைப்பாளர்
uk: Модифікатор скелета руки
zh_cn: 手部骨架修改器
zh_tw: 手部骨架修改器

source: Finally we need to add an :ref:`XRHandModifier3D <class_xrhandmodifier3d>` node as a child to our ``Skeleton3D`` node. This node will obtain the finger tracking data from OpenXR and apply it the hand model.
ru: Наконец, нам нужно добавить узел :ref:`XRHandModifier3D <class_xrhandmodifier3d>` в качестве дочернего к нашему узлу ``Skeleton3D``. Этот узел будет получать данные отслеживания пальцев из OpenXR и применять их к модели руки.

source: You need to set the ``Hand Tracker`` property to either ``/user/hand_tracker/left`` or ``/user/hand_tracker/right`` depending on whether we are apply the tracking data of respectively the left or right hand.
de: Sie müssen die Eigenschaft ``Hand Tracker`` entweder auf ``/user/hand_tracker/left`` oder ``/user/hand_tracker/right`` setzen, je nachdem, ob wir die Tracking-Daten der linken oder rechten Hand anwenden.
ga: Ní mór duit an maoin ``Hand Tracker`` a shocrú go ```/user/hand_tracker/left`` nó ``/user/hand_tracker/right`` ag brath ar an bhfuil sonraí rianaithe na láimhe clé nó na láimhe deise á chur i bhfeidhm againn faoi seach.
ru: Вам необходимо установить свойство ``Hand Tracker`` на ``/user/hand_tracker/left`` или ``/user/hand_tracker/right`` в зависимости от того, применяем ли мы данные отслеживания левой или правой руки соответственно.
ta: `` ஏண்ட் டிராக்கர்` சொத்தை ``/பயனர்/ஏண்ட்_டிராக்கர்/இடது`` அல்லது ``/பயனர்/ஏண்ட்_டிராக்/ரைட்`` என அமைக்க வேண்டும். கை.
uk: Вам потрібно встановити властивість ``Hand Tracker`` на ``/user/hand_tracker/left`` або ``/user/hand_tracker/right`` залежно від того, застосовуємо ми дані відстеження відповідно лівого чи правого руку.
zh_tw: 請將 ``Hand Tracker`` 屬性設為 ``/user/hand_tracker/left`` 或 ``/user/hand_tracker/right``，分別對應左手或右手。

source: You can also set the ``Bone Update`` mode on this node.
de: Sie können für diesen Knoten auch den Modus ``Bone Update`` einstellen.
ga: Is féidir leat an modh ``Cnámh Uasghrádú ``a shocrú ar an nód seo freisin.
ru: Вы также можете установить режим ``Bone Update`` на этом узле.
ta: இந்த முனையில் `` எலும்பு புதுப்பிப்பு`` பயன்முறையையும் அமைக்கலாம்.
uk: Ви також можете встановити режим ``Оновлення кістки`` для цього вузла.
zh_tw: 你也可以設定此節點的 ``Bone Update`` （骨骼更新）模式。

source: ``Full`` applies the hand tracking data fully. This does mean that the skeleton positioning will potentially reflect the size of the actual hand of the user. This can lead to scrunching effect if meshes aren't weighted properly to account for this. Make sure you test your game with players of all sizes when optical hand tracking is used!
de: ``Vollständig`` wendet die Handverfolgungsdaten vollständig an. Dies bedeutet, dass die Skelettpositionierung möglicherweise die Größe der tatsächlichen Hand des Benutzers widerspiegelt. Dies kann zu einem Scrunching-Effekt führen, wenn die Meshes nicht richtig gewichtet sind, um dies zu berücksichtigen. Stellen Sie sicher, dass Sie Ihr Spiel mit Spielern aller Größen testen, wenn optische Handverfolgung verwendet wird!
ga: Cuireann `` Iomlán`` na sonraí rianaithe láimhe i bhfeidhm go hiomlán. Ciallaíonn sé seo go bhféadfadh suíomh an chnámharlaigh méid lámh iarbhír an úsáideora a léiriú. D'fhéadfadh éifeacht scrofa a bheith mar thoradh air seo mura gcuirtear na mogaill ualaithe i gceart chun é seo a chur san áireamh. Bí cinnte go ndéanann tú do chluiche a thástáil le himreoirí de gach méid nuair a úsáidtear rianú láimhe optúil!
ru: ``Full`` применяет данные отслеживания рук в полном объёме. Это означает, что положение скелета потенциально будет отражать размер реальной руки пользователя. Это может привести к эффекту сжатия, если сетки не будут правильно взвешены с учётом этого. Обязательно протестируйте игру с игроками всех размеров при использовании оптического отслеживания рук!
ta: `` ஃபுல்`` கை கண்காணிப்பு தரவை முழுமையாகப் பயன்படுத்துகிறது. எலும்புக்கூடு பொருத்துதல் பயனரின் உண்மையான கையின் அளவை பிரதிபலிக்கும் என்று இது குறிக்கிறது. இதைக் கணக்கிட மெச்கள் சரியாக எடைபோடவில்லை என்றால் இது ச்க்ரஞ்சிங் விளைவுக்கு வழிவகுக்கும். ஆப்டிகல் ஏண்ட் டிராக்கிங் பயன்படுத்தப்படும்போது உங்கள் விளையாட்டை எல்லா அளவிலான வீரர்களுடனும் சோதிக்கிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்!
uk: ``Повний`` повністю застосовує дані відстеження рук. Це означає, що розташування скелета потенційно відображатиме розмір фактичної руки користувача. Це може призвести до ефекту стиснення, якщо сітки не зважені належним чином для врахування цього. Переконайтеся, що ви тестуєте свою гру з гравцями будь-якого розміру, коли використовується оптичне відстеження руки!
zh_tw: 選擇 ``Full`` （完整）模式時，會完整套用手部追蹤資料，骨架位置將反映實際使用者的手部尺寸。如果網格權重設置不當，可能會出現模型擠壓的現象。使用光學手部追蹤時，請務必用各種不同手型多做測試！

source: ``Rotation Only`` will only apply rotation to the bones of the hands and keep the bone length as is. In this mode the size of the hand mesh doesn't change.
de: ``Nur Rotation`` wendet nur die Rotation auf die Knochen der Hände an und behält die Knochenlänge bei. In diesem Modus ändert sich die Größe des Handmeshes nicht.
ga: Ní chuirfidh ``Rotation Only` rothlú ach ar chnámha na lámha agus coinneoidh sé fad an chnámh mar atá. Sa mhodh seo ní athraíonn méid na mogalra láimhe.
ru: ``Rotation Only`` применяет вращение только к костям рук, сохраняя длину костей. В этом режиме размер сетки руки не меняется.
ta: `` சுழற்சி மட்டுமே`` கைகளின் எலும்புகளுக்கு மட்டுமே சுழற்சியைப் பயன்படுத்தும் மற்றும் எலும்பு நீளத்தை அப்படியே வைத்திருக்கும். இந்த பயன்முறையில் கை கண்ணி அளவு மாறாது.
uk: ``Лише обертання`` застосовуватиме обертання лише до кісток рук і збереже довжину кістки як є. У цьому режимі розмір сітки руки не змінюється.
zh_tw: 選擇 ``Rotation Only`` （僅旋轉）時，只會將手部骨骼旋轉套用至骨架，骨骼長度不變，手部網格大小也不會改變。

source: With this added, when we run the project we should see the hand correctly displayed if hand tracking is supported.
de: Wenn dies hinzugefügt wurde, sollte beim Ausführen des Projekts die Hand korrekt angezeigt werden, sofern das Handtracking unterstützt wird.
ga: Agus é seo curtha leis, agus an tionscadal á reáchtáil againn ba cheart dúinn an lámh a thaispeáint i gceart má thacaítear le rianú láimhe.
ru: После добавления этого параметра при запуске проекта мы должны увидеть корректное отображение руки, если поддерживается отслеживание руки.
ta: இது சேர்க்கப்பட்டால், நாங்கள் திட்டத்தை இயக்கும்போது கை கண்காணிப்பு ஆதரிக்கப்பட்டால் கை சரியாக காட்டப்படுவதைக் காண வேண்டும்.
uk: З додаванням цього, коли ми запускаємо проект, ми маємо бачити правильно відображену руку, якщо підтримується відстеження руки.
zh_tw: 完成上述設置後，執行專案時若支援手部追蹤，應可正確顯示手部模型。

source: The hand tracking data source
de: Die Hand-Tracking-Datenquelle
ga: An fhoinse sonraí rianaithe láimhe
it: La sorgente dei dati di tracciamento della mano
ru: Источник данных отслеживания рук
ta: கை கண்காணிப்பு தரவு மூல
uk: Джерело даних відстеження руки
zh_cn: 手部跟踪数据源
zh_tw: 手部追蹤資料來源

source: This is an OpenXR extension that provides information about the source of the hand tracking data. At this moment only a few runtimes implement it but if it is available, Godot will activate it.
de: Dies ist eine OpenXR-Erweiterung, die Informationen über die Quelle der Handverfolgungsdaten bereitstellt. Derzeit implementieren nur wenige Laufzeiten sie, aber wenn sie verfügbar ist, wird Godot sie aktivieren.
ga: Is síneadh OpenXR é seo a sholáthraíonn faisnéis faoi fhoinse na sonraí rianaithe láimhe. Ag an nóiméad seo ní chuireann ach cúpla ama rith i bhfeidhm é ach má tá sé ar fáil, gníomhachtóidh Godot é.
ru: Это расширение OpenXR, предоставляющее информацию об источнике данных отслеживания рук. В настоящее время оно реализовано лишь в нескольких средах выполнения, но если оно доступно, Godot его активирует.
ta: இது ஒரு OpenXR நீட்டிப்பு, இது கை கண்காணிப்பு தரவின் மூலத்தைப் பற்றிய தகவல்களை வழங்குகிறது. இந்த நேரத்தில் ஒரு சில ரன் டைம்கள் மட்டுமே அதை செயல்படுத்துகின்றன, ஆனால் அது கிடைத்தால், கோடோட் அதை செயல்படுத்தும்.
uk: Це розширення OpenXR, яке надає інформацію про джерело даних відстеження рук. На даний момент його реалізовано лише в кількох середовищах виконання, але якщо він доступний, Godot його активує.
zh_tw: 這是一個 OpenXR 擴充功能，可提供手部追蹤資料來源的資訊。目前僅少數執行環境實作此功能，但只要有支援，Godot 會自動啟用。

source: If this extension is not supported and thus unknown is returned, you can make the following assumptions:
de: Wenn diese Erweiterung nicht unterstützt wird und daher „unknown“ zurückgegeben wird, können Sie von folgenden Annahmen ausgehen:
ga: Mura dtacaítear leis an síneadh seo agus dá bhrí sin cuirtear anaithnid ar ais, is féidir leat na toimhde seo a leanas a dhéanamh:
ru: Если это расширение не поддерживается и, следовательно, возвращается неизвестное значение, можно сделать следующие предположения:
ta: இந்த நீட்டிப்பு ஆதரிக்கப்படாவிட்டால், தெரியவில்லை என்றால், நீங்கள் பின்வரும் அனுமானங்களைச் செய்யலாம்:
uk: Якщо це розширення не підтримується і тому повертається невідомий, ви можете зробити такі припущення:
zh_tw: 若此擴充功能不被支援（回傳 unknown），可依下列假設推斷：

source: If you are using SteamVR (including Steam link), only controller based hand tracking is supported.
de: Wenn Sie SteamVR (einschließlich Steam-Link) verwenden, wird nur das Controller-basierte Handtracking unterstützt.
ga: Má tá SteamVR á úsáid agat (lena n-áirítear nasc Steam), ní thacaítear ach le rianú láimhe bunaithe ar rialtóir.
ru: Если вы используете SteamVR (включая Steam Link), поддерживается только отслеживание рук на основе контроллера.
ta: நீங்கள் ச்டீம்விஆரைப் பயன்படுத்துகிறீர்கள் என்றால் (நீராவி இணைப்பு உட்பட), கட்டுப்பாட்டு அடிப்படையிலான கை கண்காணிப்பு மட்டுமே ஆதரிக்கப்படுகிறது.
uk: Якщо ви використовуєте SteamVR (включаючи посилання Steam), підтримується лише відстеження рук на основі контролера.
zh_tw: 若使用 SteamVR（含 Steam Link），僅支援以控制器為基礎的手部追蹤。

source: For any other runtime, if hand tracking is supported, only optical hand tracking is supported (Note, Meta Link currently fall into this category).
de: Für alle anderen Laufzeitumgebungen gilt: Sofern Handverfolgung unterstützt wird, wird nur optisches Handverfolgung unterstützt (Hinweis: Metalinks fallen derzeit in diese Kategorie).
ga: Maidir le haon ré eile, má thacaítear le rianú láimhe, ní thacaítear ach le rianú láimhe optúil (Tabhair faoi deara, tagann Meta Link sa chatagóir seo faoi láthair).
ru: Для любой другой среды выполнения, если поддерживается отслеживание рук, поддерживается только оптическое отслеживание рук (обратите внимание, Meta Link в настоящее время попадает в эту категорию).
ta: வேறு எந்த இயக்க நேரத்திற்கும், கை கண்காணிப்பு ஆதரிக்கப்பட்டால், ஆப்டிகல் ஏண்ட் டிராக்கிங் மட்டுமே ஆதரிக்கப்படுகிறது (குறிப்பு, மேவு இணைப்பு தற்போது இந்த வகைக்குள் வருகிறது).
uk: Для будь-якого іншого середовища виконання, якщо підтримується відстеження рук, підтримується лише оптичне відстеження рук (Зверніть увагу, Meta Link наразі належить до цієї категорії).
zh_tw: 其他執行環境若支援手部追蹤，則僅支援光學手部追蹤 （註：Meta Link 目前也屬此類）。

source: In all other cases, no hand tracking is supported at all.
de: In allen anderen Fällen wird überhaupt kein Hand-Tracking unterstützt.
ga: I ngach cás eile, ní thacaítear le rianú láimhe ar chor ar bith.
ru: Во всех остальных случаях отслеживание рук вообще не поддерживается.
ta: மற்ற எல்லா சந்தர்ப்பங்களிலும், கை கண்காணிப்பு எதுவும் ஆதரிக்கப்படவில்லை.
uk: У всіх інших випадках відстеження руки взагалі не підтримується.
zh_tw: 其餘情況皆不支援手部追蹤。

source: You can access this information through code:
de: Sie können auf diese Informationen über den Code zugreifen:
ga: Is féidir leat rochtain a fháil ar an bhfaisnéis seo trí chód:
ru: Вы можете получить доступ к этой информации с помощью кода:
ta: குறியீடு மூலம் இந்த தகவலை நீங்கள் அணுகலாம்:
uk: Ви можете отримати доступ до цієї інформації за допомогою коду:
zh_tw: 你可以透過程式碼存取這項資訊：

source: This example logs the state for the left hand.
it: Questo esempio registra lo stato della mano sinistra.
ru: В этом примере регистрируется состояние левой руки.
ta: இந்த எடுத்துக்காட்டு இடது கைக்கு மாநிலத்தை பதிவு செய்கிறது.
zh_tw: 此範例會記錄左手的追蹤狀態。

source: If in this example no hand tracker is returned by ``get_tracker``, this means the hand tracking API is not supported on the XR runtime at all.
de: Wenn in diesem Beispiel kein Hand-Tracker von ``get_tracker`` zurückgegeben wird, bedeutet dies, dass die Hand-Tracking-API von der XR-Laufzeitumgebung überhaupt nicht unterstützt wird.
ga: Mura gcuirtear `get_tracker`` ar ais aon rianaitheoir láimhe sa sampla seo, ciallaíonn sé seo nach dtacaítear leis an API rianaithe láimhe ar an rith XR ar chor ar bith.
ru: Если в этом примере ``get_tracker`` не возвращает отслеживание рук, это означает, что API отслеживания рук вообще не поддерживается в среде выполнения XR.
ta: இந்த எடுத்துக்காட்டில் `` get_tracker`` ஆல் எந்தவொரு கை டிராக்கரும் திருப்பித் தரப்படவில்லை என்றால், இதன் பொருள் எக்ச்ஆர் இயக்க நேரத்தில் கை கண்காணிப்பு பநிஇ ஆதரிக்கப்படவில்லை.
uk: Якщо в цьому прикладі ``get_tracker`` не повертає засіб відстеження рук, це означає, що API відстеження рук взагалі не підтримується у середовищі виконання XR.
zh_tw: 若 ``get_tracker`` 未回傳任何手部追蹤器，表示該 XR 執行環境完全不支援手部追蹤 API。

source: If there is a tracker but `has_tracking_data` is false, the user's hand is currently not being tracked. This is likely caused by one of the following reasons:
de: Wenn ein Tracker vorhanden ist, aber `has_tracking_data` falsch ist, wird die Hand des Benutzers derzeit nicht verfolgt. Dies hat wahrscheinlich einen der folgenden Gründe:
ga: Má tá rianaitheoir ann ach tá `has_tracking_data` bréagach, níl lámh an úsáideora á rianú faoi láthair. Is dócha go bhfuil ceann de na cúiseanna seo a leanas mar thoradh air seo:
ru: Если трекер есть, но `has_tracking_data` имеет значение false, рука пользователя в данный момент не отслеживается. Вероятно, это вызвано одной из следующих причин:
ta: ஒரு டிராக்கர் இருந்தால், ஆனால் `has_tracking_data` தவறானது என்றால், பயனரின் கை தற்போது கண்காணிக்கப்படவில்லை. இது பின்வரும் காரணங்களில் ஒன்றால் ஏற்படக்கூடும்:
uk: Якщо трекер є, але `has_tracking_data` має значення false, рука користувача наразі не відстежується. Ймовірно, це спричинено однією з таких причин:
zh_tw: 若有追蹤器但 `has_tracking_data` 為 false，表示目前使用者的手未被追蹤。常見原因如下：

source: The player's hand is not visible by any of the tracking cameras on the headset
de: Die Hand des Spielers ist für keine der Tracking-Kameras am Headset sichtbar
ga: Níl lámh an imreora le feiceáil ag aon cheann de na ceamaraí rianaithe ar an headset
ru: Рука игрока не видна ни одной из камер слежения на гарнитуре
ta: எட்செட்டில் உள்ள எந்த கண்காணிப்பு கேமராக்களும் வீரரின் கை தெரியவில்லை
uk: Руку гравця не видно жодною з камер стеження на гарнітурі
zh_tw: 玩家的手未被頭戴裝置上的任何追蹤攝影機偵測到

source: The player is currently using a controller and the headset only supports optical hand tracking
de: Der Spieler verwendet derzeit einen Controller und das Headset unterstützt nur optisches Handtracking
ga: Tá an t-imreoir ag úsáid rialtóir faoi láthair agus ní thacaíonn an headset ach le rianú láimhe optúil
ru: В данный момент игрок использует контроллер, а гарнитура поддерживает только оптическое отслеживание рук
ta: பிளேயர் தற்போது ஒரு கட்டுப்படுத்தியைப் பயன்படுத்துகிறார் மற்றும் எட்செட் ஆப்டிகல் ஏண்ட் கண்காணிப்பை மட்டுமே ஆதரிக்கிறது
uk: Зараз гравець використовує контролер, а гарнітура підтримує лише оптичне відстеження руки
zh_tw: 玩家正在使用控制器，且頭戴裝置僅支援光學手部追蹤

source: The controller is turned off and only controller hand tracking is supported.
de: Der Controller ist ausgeschaltet und es wird nur das Handtracking des Controllers unterstützt.
ga: Múchtar an rialtóir agus ní thacaítear ach le rianú láimhe rialaitheora.
ru: Контроллер выключен, поддерживается только отслеживание движений руки контроллера.
ta: கட்டுப்படுத்தி முடக்கப்பட்டுள்ளது மற்றும் கட்டுப்படுத்தி கை கண்காணிப்பு மட்டுமே ஆதரிக்கப்படுகிறது.
uk: Контролер вимкнено, і підтримується лише відстеження рук контролера.
zh_tw: 控制器已關閉，且僅支援控制器手部追蹤。

source: Handling user input
de: Verarbeiten von Benutzereingaben
ga: Ionchur úsáideora a láimh
it: Gestione degli input dell'utente
ru: Обработка пользовательского ввода
ta: பயனர் உள்ளீட்டைக் கையாளுதல்
uk: Обробка введення користувача
zh_cn: 处理用户输入
zh_tw: 處理使用者輸入

source: Reacting to actions performed by the user is handled through :ref:`doc_xr_action_map` if controllers are used. In the action map you can map various inputs like the trigger or joystick on the controller to an action. This can then drive logic in your game.
de: Das Reagieren auf vom Benutzer ausgeführte Aktionen wird bei Verwendung von Controllern über :ref:`doc_xr_action_map` abgewickelt. In der Aktionskarte können Sie verschiedene Eingaben wie den Auslöser oder den Joystick auf dem Controller einer Aktion zuordnen. Dies kann dann die Logik in Ihrem Spiel steuern.
ga: Láimhseálfar freagairt do ghníomhartha a dhéanann an t-úsáideoir trí:ref: `doc_xr_action_map` má úsáidtear rialaitheoirí. Sa léarscáil ghníomhaíochta is féidir leat ionchuir éagsúla cosúil leis an truicear nó an stiall seomra ar an rialtóir a mhapáil chuig gníomh. Ansin is féidir leis seo loighic a thiomáint i do chluiche.
ru: Реакция на действия пользователя осуществляется через :ref:`doc_xr_action_map` при использовании контроллеров. На карте действий можно сопоставить различные входные сигналы, например, нажатие на триггер или джойстик на контроллере, с действием. Это затем может управлять логикой вашей игры.
ta: பயனரால் செய்யப்படும் செயல்களுக்கு வினைபுரியும் மூலம் கையாளப்படுகிறது: Ref: `Doc_xr_action_map` கட்டுப்பாட்டாளர்கள் பயன்படுத்தப்பட்டால். செயல் வரைபடத்தில் நீங்கள் தூண்டுதல் அல்லது சாய்ச்டிக் போன்ற பல்வேறு உள்ளீடுகளை கட்டுப்படுத்தியில் ஒரு செயலுக்கு வரைபடமாக்கலாம். இது உங்கள் விளையாட்டில் தர்க்கத்தை இயக்கும்.
uk: Реакція на дії, які виконує користувач, обробляється через :ref:`doc_xr_action_map`, якщо використовуються контролери. У карті дій ви можете зіставляти різні вхідні дані, як-от тригер або джойстик на контролері, для дії. Це може керувати логікою у вашій грі.
zh_tw: 若使用控制器，建議透過 :ref:`doc_xr_action_map` 處理使用者動作。在動作對應表中，可將控制器的扳機鍵、搖桿等輸入對應到特定動作，再據此驅動遊戲邏輯。

source: When hand tracking is used we originally had no such inputs, inputs are driven by gestures made by the user such as making a fist to grab or pinching the thumb and index finger together to select something. It was up to the game developer to implement this.
de: Bei der Verwendung von Handtracking gab es ursprünglich keine solchen Eingaben. Die Eingaben werden durch Gesten des Benutzers gesteuert, z. B. durch das Ballen einer Faust zum Greifen oder das Zusammenziehen von Daumen und Zeigefinger zum Auswählen von etwas. Es war Sache des Spieleentwicklers, dies umzusetzen.
ga: Nuair a úsáidtear rianú láimhe ní raibh aon ionchuir den sórt sin againn ar dtús, tiománaítear ionchuir le gothaí a dhéanann an t-úsáideoir mar dhoróg a dhéanamh chun an t-ordóg agus an méar innéacs a ghreamú nó a phriontáil le chéile chun rud éigin Bhí sé faoi fhorbróir an chluiche é seo a chur i bhfeidhm.
ru: При использовании отслеживания рук изначально таких входов не было, и ввод управлялся жестами пользователя, например, сжатием кулака для захвата или сведением большого и указательного пальцев для выбора чего-либо. Реализация этого была задачей разработчика игры.
ta: கை கண்காணிப்பு பயன்படுத்தப்படும்போது, முதலில் அத்தகைய உள்ளீடுகள் எதுவும் இல்லை, ஏதேனும் ஒன்றைத் தேர்ந்தெடுக்க கட்டைவிரல் மற்றும் குறியீட்டு விரலை ஒன்றிணைக்க ஒரு முச்டியை உருவாக்குவது அல்லது கிள்ளுவது போன்ற பயனரால் செய்யப்பட்ட சைகைகளால் உள்ளீடுகள் இயக்கப்படுகின்றன. இதைச் செயல்படுத்த விளையாட்டு உருவாக்குபவர் தான்.
uk: Коли використовується відстеження рук, у нас спочатку не було таких вводів, введення керується жестами, які робить користувач, наприклад стисканням кулака, щоб схопити, або зведенням великого та вказівного пальців, щоб вибрати щось. Реалізувати це мав розробник гри.
zh_tw: 早期使用手部追蹤時並無對應的輸入，必須透過使用者手勢（如握拳表抓取、拇指與食指捏合表選取等）來操作。這部分通常需由開發者自行實作。

source: Recognizing that there is an increasing demand for applications that can switch seamlessly between controller and hand tracking and the need some form of basic input capability, a number of extensions were added to the specification that provide some basic gesture recognition and can be used with the action map.
de: Angesichts der zunehmenden Nachfrage nach Anwendungen, die nahtlos zwischen Controller- und Hand-Tracking wechseln können und eine gewisse grundlegende Eingabefähigkeit erfordern, wurden der Spezifikation einige Erweiterungen hinzugefügt, die eine grundlegende Gestenerkennung ermöglichen und mit der Aktionskarte verwendet werden können.
ga: Ag aithint go bhfuil éileamh méadaitheach ar fheidhmchláir ar féidir leo athrú gan uaim idir rialaitheoir agus rianú láimhe agus an gá de chineál éigin de chumas ionchuir bunúsach, cuireadh roinnt síntí leis an sonraíocht a sholáthraíonn aitheantas comhartha bunúsach agus is féidir iad a úsáid leis an léarscáil ghníomhaíochta.
ru: Учитывая растущий спрос на приложения, способные плавно переключаться между отслеживанием контроллера и рук, а также потребность в базовых возможностях ввода, в спецификацию был добавлен ряд расширений, которые обеспечивают базовое распознавание жестов и могут использоваться с картой действий.
ta: கட்டுப்படுத்தி மற்றும் கை கண்காணிப்புக்கு இடையில் தடையின்றி மாறக்கூடிய பயன்பாடுகளுக்கான தேவை அதிகரித்து வருவதையும், சில வகையான அடிப்படை உள்ளீட்டு திறன் தேவைப்படுவதையும் அங்கீகரித்து, சில அடிப்படை சைகை அங்கீகாரத்தை வழங்கும் விவரக்குறிப்பில் பல நீட்டிப்புகள் சேர்க்கப்பட்டன, மேலும் செயலுடன் பயன்படுத்தலாம் வரைபடம்.
uk: Усвідомлюючи, що існує зростаючий попит на програми, які можуть плавно перемикатися між контролером і відстеженням рук, і потребують певної форми базової можливості введення, до специфікації було додано ряд розширень, які забезпечують базове розпізнавання жестів і можуть використовуватися з діями карта.
zh_tw: 隨著越來越多應用需要在控制器與手部追蹤間無縫切換，且需具備基本輸入能力，OpenXR 規範新增了多項擴充，提供基本手勢辨識，可與動作對應表（Action Map）結合使用。

source: The hand interaction profile
de: Das Hand-Interaktionsprofil
ga: Próifíl idirghníomhaíochta
it: Il profilo di interazione della mano
ru: Профиль взаимодействия рук
ta: கை தொடர்பு சுயவிவரம்
uk: Профіль взаємодії рук
zh_cn: 手部交互式配置
zh_tw: 手部互動設定檔
