Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/openxr_hand_tracking.po
Languages: de, fr, ga, it, ru, ta, uk, zh_cn, zh_tw

source: The defining difference is that this extension introduces two new trackers, ``/user/hand_htc/left`` and ``/user/hand_htc/right``. This means that extra logic needs to be implemented to switch between the default trackers and the HTC specific trackers when the user puts down, or picks up, their controller.
de: Der entscheidende Unterschied besteht darin, dass diese Erweiterung zwei neue Tracker einführt: ``/user/hand_htc/left`` und ``/user/hand_htc/right``. Dies bedeutet, dass zusätzliche Logik implementiert werden muss, um zwischen den Standard-Trackern und den HTC-spezifischen Trackern zu wechseln, wenn der Benutzer seinen Controller ablegt oder aufnimmt.
ga: Is é an difríocht shainmhínithe ná go dtugann an síneadh seo dhá rianóir nua isteach, ``/user/hand_htc/left`` agus ``/user/hand_htc/right``. Ciallaíonn sé seo gur gá loighic bhreise a chur i bhfeidhm chun aistriú idir na rianaithe réamhshocraithe agus na rianaithe sonracha HTC nuair a chuireann an t-úsáideoir a rialtóir síos, nó a phiocann suas.
ru: Главное отличие заключается в том, что это расширение добавляет два новых трекера: ``/user/hand_htc/left`` и ``/user/hand_htc/right``. Это означает, что необходимо реализовать дополнительную логику для переключения между трекерами по умолчанию и трекерами HTC, когда пользователь кладёт или поднимает контроллер.
ta: வரையறுக்கும் வேறுபாடு என்னவென்றால், இந்த நீட்டிப்பு இரண்டு புதிய டிராக்கர்களை அறிமுகப்படுத்துகிறது, ``/பயனர்/ஏண்ட்_எச்.டி.சி/இடது`` மற்றும் ``/பயனர்/ஏண்ட்_எச்/ரைட்``. பயனர் கீழே வைக்கும்போது அல்லது அவற்றின் கட்டுப்படுத்தியை எடுக்கும் போது இயல்புநிலை டிராக்கர்களுக்கும் HTC குறிப்பிட்ட டிராக்கர்களுக்கும் இடையில் மாற கூடுதல் வழக்கு செயல்படுத்தப்பட வேண்டும் என்பதே இதன் பொருள்.
uk: Визначальною відмінністю є те, що це розширення представляє два нових трекери, ``/user/hand_htc/left`` і ``/user/hand_htc/right``. Це означає, що потрібно впровадити додаткову логіку для перемикання між стандартними трекерами та спеціальними трекерами HTC, коли користувач відкладає або бере свій контролер.
zh_tw: 主要差異在於，該擴充額外引入 ``/user/hand_htc/left`` 與 ``/user/hand_htc/right`` 兩個追蹤器。當使用者放下或拿起控制器時，需額外撰寫邏輯在預設追蹤器與 HTC 專屬追蹤器間切換。

source: Simple controller profile
de: Einfaches Controllerprofil
fr: Profil de contrôleur simple
ga: Próifíl rialtóra simplí
it: Profilo di controller semplice
ru: Простой профиль контроллера
ta: எளிய கட்டுப்படுத்தி சுயவிவரம்
uk: Простий профіль контролера
zh_tw: 簡易控制器設定檔

source: The simple controller profile is a standard core profile defined as a fallback profile when a controller is used for which no profile exists.
de: Das einfache Controllerprofil ist ein Standardkernprofil, das als Fallbackprofil definiert ist, wenn ein Controller verwendet wird, für den kein Profil existiert.
ga: Is croíphróifíl chaighdeánach í an phróifíl rialaitheora shimplí a shainítear mar phróifíl chúltaca nuair a úsáidtear rialtóir nach bhfuil próifíl ar bith ann.
ru: Простой профиль контроллера — это стандартный основной профиль, определяемый как резервный профиль, когда используется контроллер, для которого не существует профиля.
ta: எளிய கட்டுப்பாட்டு சுயவிவரம் என்பது ஒரு கட்டுப்படுத்தி பயன்படுத்தப்படும்போது குறைவடையும் சுயவிவரமாக வரையறுக்கப்பட்ட ஒரு நிலையான மைய சுயவிவரமாகும், அதற்காக எந்த சுயவிவரமும் இல்லை.
uk: Простий профіль контролера — це стандартний профіль ядра, визначений як резервний профіль, коли використовується контролер, для якого не існує профілю.
zh_tw: 簡易控制器設定檔是標準核心設定檔，作為無專屬設定檔之控制器的備援方案。

source: There are a number of OpenXR runtimes that will mimic controllers through the simple controller profile when hand tracking is used.
de: Es gibt eine Reihe von OpenXR-Laufzeitumgebungen, die Controller über das einfache Controllerprofil nachahmen, wenn Hand-Tracking verwendet wird.
ga: Tá roinnt ama rith OpenXR ann a dhéanfaidh aithris ar rialtóirí tríd an bpróifíl rialaitheora simplí nuair a úsáidtear rianú láimhe.
ru: Существует ряд сред выполнения OpenXR, которые имитируют контроллеры с помощью простого профиля контроллера при использовании отслеживания рук.
ta: கை கண்காணிப்பு பயன்படுத்தப்படும்போது எளிய கட்டுப்பாட்டு சுயவிவரத்தின் மூலம் கட்டுப்படுத்திகளை பிரதிபலிக்கும் பல OpenXR ரன் டைம்கள் உள்ளன.
uk: Існує кілька середовищ виконання OpenXR, які імітують контролери через простий профіль контролера, коли використовується відстеження рук.
zh_tw: 有些 OpenXR 執行環境會在手部追蹤時模擬成簡易控制器設定檔。

source: Unfortunately there is no sound way to determine whether an unknown controller is used or whether hand tracking is emulating a controller through this profile.
de: Leider gibt es keine stichhaltige Möglichkeit, um festzustellen, ob ein unbekannter Controller verwendet wird oder ob das Hand-Tracking über dieses Profil einen Controller emuliert.
ga: Ar an drochuair níl aon bhealach fuaime ann chun a chinneadh an n-úsáidtear rialtóir anaithnid nó an bhfuil rianú láimhe ag aithris ar rialtóir tríd an bpróifíl seo.
ru: К сожалению, нет надежного способа определить, используется ли неизвестный контроллер или отслеживание рук эмулирует контроллер через этот профиль.
ta: துரதிர்ச்டவசமாக அறியப்படாத கட்டுப்படுத்தி பயன்படுத்தப்படுகிறதா அல்லது கை கண்காணிப்பு இந்த சுயவிவரத்தின் மூலம் ஒரு கட்டுப்படுத்தியைப் பின்பற்றுகிறதா என்பதை தீர்மானிக்க எந்த நல்ல வழியும் இல்லை.
uk: На жаль, немає надійного способу визначити, чи використовується невідомий контролер, чи відстеження рук емулює контролер через цей профіль.
zh_tw: 遺憾的是，目前無法可靠區分究竟是未知控制器，還是手部追蹤透過此設定檔模擬為控制器。

source: XR runtimes are free to define how the simple controller profile operates, so there is also no certainty to how this profile is mapped to gestures.
de: XR-Laufzeiten können die Funktionsweise des einfachen Controllerprofils frei definieren, daher besteht auch keine Gewissheit darüber, wie dieses Profil auf Gesten abgebildet wird.
ga: Tá cead ag amanna rite XR an chaoi a n-oibríonn an phróifíl rialaitheora shimplí a shainiú, agus mar sin níl aon chinnteacht ann freisin maidir leis an gcaoi a ndéantar an phróifíl seo a mhapáil chuig gothaí.
ru: Среды выполнения XR могут свободно определять, как работает простой профиль контроллера, поэтому нет никакой определенности в том, как этот профиль сопоставляется с жестами.
ta: எளிய கட்டுப்பாட்டு சுயவிவரம் எவ்வாறு இயங்குகிறது என்பதை வரையறுக்க எக்ச்ஆர் ரன் டைம்கள் இலவசம், எனவே இந்த சுயவிவரம் சைகைகளுக்கு எவ்வாறு வரைபடமாக்கப்படுகிறது என்பதில் உறுதியாக இல்லை.
uk: Середи виконання XR можуть вільно визначати, як працює простий профіль контролера, тому також немає впевненості щодо того, як цей профіль зіставляється з жестами.
zh_tw: 各 XR 執行環境可自行定義簡易控制器設定檔的行為，因此手勢對應方式也不盡相同，無法統一保證。

source: The most common mapping seems to be that ``select click`` is true when the tip of the thumb and index fingers are touching while the user's palm is facing away from the user. ``menu click`` will be true when tip of the thumb and index fingers are touching while the user's palm is facing towards the user.
de: Die gebräuchlichste Zuordnung scheint zu sein, dass ``Select-Klick`` wahr ist, wenn sich die Spitzen von Daumen und Zeigefinger berühren und die Handfläche des Benutzers vom Benutzer weg zeigt. ``Menü-Klick`` ist wahr, wenn sich die Spitzen von Daumen und Zeigefinger berühren und die Handfläche des Benutzers zum Benutzer zeigt.
ga: Is cosúil gurb é an mapáil is coitianta ná go bhfuil ``roghnaigh clice`` fíor nuair a bhíonn barr an ordóg agus na méara innéacs ag dul i dteagmháil agus pailme an úsáideora ag tabhairt aghaidh ar shiúl ón úsáideoir. Beidh ``cliceáil roghchláir ``fíor nuair a bhíonn barr an ordóg agus na méara innéacs ag dul i dteagmháil agus pailme an úsáideora ag tabhairt aghaidh i dtreo an úsáideora.
ru: Наиболее распространенное сопоставление, по-видимому, состоит в том, что ``select click`` будет истинным, когда кончики большого и указательного пальцев соприкасаются, а ладонь пользователя обращена от пользователя. ``menu click`` будет истинным, когда кончики большого и указательного пальцев соприкасаются, а ладонь пользователя обращена к пользователю.
ta: கட்டைவிரல் மற்றும் குறியீட்டு விரல்களின் நுனி தொடும்போது பயனரின் பனை பயனரிடமிருந்து விலகிச் செல்லும்போது `` சொடுக்கு சொடுக்கு என்பதைத் தேர்ந்தெடுக்கவும். `` பட்டியல் கிளிக்`` கட்டைவிரலின் நுனி மற்றும் குறியீட்டு விரல்கள் தொடும்போது பயனரின் பனை பயனரை நோக்கி எதிர்கொள்ளும் போது உண்மையாக இருக்கும்.
uk: Здається, найпоширенішим відображенням є те, що ``вибір клацання`` є істинним, коли кінчики великого та вказівного пальців торкаються, а долоня користувача спрямована від користувача. ``Натискання меню`` буде істинним, коли кінчики великого та вказівного пальців торкаються, а долоня користувача звернена до користувача.
zh_tw: 最常見的對應方式為：當拇指與食指指尖接觸且手掌朝外時， ``select click`` （選取點擊）為 true；手掌朝內時， ``menu click`` （選單點擊）為 true。

source: As some of these interaction profiles have overlap it is important to know that you can add each profile to your action map and the XR runtime will choose the best fitting profile.
de: Da sich einige dieser Interaktionsprofile überschneiden, ist es wichtig zu wissen, dass Sie jedes Profil zu Ihrer Aktionskarte hinzufügen können und die XR-Laufzeit das am besten passende Profil auswählt.
ga: Toisc go bhfuil forluí ag roinnt de na próifílí idirghníomhaíochta seo, tá sé tábhachtach go mbeadh a fhios agat gur féidir leat gach próifíl a chur le do léarscáil gníomhaíochta agus roghnóidh an t-am rite XR an phróifíl is fearr a fheistiú.
ru: Поскольку некоторые из этих профилей взаимодействия перекрываются, важно знать, что вы можете добавить каждый профиль на свою карту действий, а среда выполнения XR выберет наиболее подходящий профиль.
ta: இந்த தொடர்பு சுயவிவரங்களில் சில ஒன்றுடன் ஒன்று இருப்பதால், ஒவ்வொரு சுயவிவரத்தையும் உங்கள் செயல் வரைபடத்தில் சேர்க்கலாம் என்பதையும், எக்ச்ஆர் இயக்க நேரம் சிறந்த பொருத்துதல் சுயவிவரத்தைத் தேர்ந்தெடுக்கும் என்பதையும் அறிந்து கொள்வது தேவை.
uk: Оскільки деякі з цих профілів взаємодії збігаються, важливо знати, що ви можете додати кожен профіль до своєї карти дій, і середовище виконання XR вибере найкращий профіль.
zh_tw: 由於這些互動設定檔部分功能重疊，你可以將多個設定檔加入動作對應表，XR 執行環境會自動選取最合適的設定檔。

source: For instance, a Meta Quest supports both the Microsoft hand interaction profile and simple controller profile. If both are specified the Microsoft hand interaction profile will take precedence and will be used.
de: Beispielsweise unterstützt ein Meta Quest sowohl das Microsoft-Handinteraktionsprofil als auch das einfache Controllerprofil. Wenn beide angegeben sind, hat das Microsoft-Handinteraktionsprofil Vorrang und wird verwendet.
ga: Mar shampla, tacaíonn Meta Quest le próifíl idirghníomhaíochta láimhe Microsoft agus próifíl rialaitheora simplí. Má shonraítear an dá cheann beidh tosaíocht ag próifíl idirghníomhaíochta láimhe Microsoft agus úsáidfear é.
ru: Например, Meta Quest поддерживает как профиль взаимодействия рук Microsoft, так и профиль простого контроллера. Если указаны оба профиля, приоритет будет отдан профилю взаимодействия рук Microsoft.
ta: உதாரணமாக, ஒரு மேவு குவெச்ட் நுண்மென் ஏண்ட் தொடர்பு சுயவிவரம் மற்றும் எளிய கட்டுப்பாட்டு சுயவிவரம் இரண்டையும் ஆதரிக்கிறது. இரண்டுமே குறிப்பிடப்பட்டால், நுண்மென் ஏண்ட் இன்டராக்சன் சுயவிவரம் முன்னுரிமை பெறும் மற்றும் பயன்படுத்தப்படும்.
uk: Наприклад, Meta Quest підтримує як профіль ручної взаємодії Microsoft, так і простий профіль контролера. Якщо вказано обидва, профіль взаємодії рук Microsoft матиме пріоритет і використовуватиметься.
zh_tw: 例如，Meta Quest 同時支援 Microsoft 手部互動設定檔與簡易控制器設定檔，若兩者皆指定，則會優先使用 Microsoft 設定檔。

source: The expectation is that once Meta supports the core hand interaction profile extension, that profile will take precedence over both Microsoft and simple controller profiles.
de: Sobald Meta die Kernprofilerweiterung für Handinteraktion unterstützt, wird erwartet, dass dieses Profil Vorrang vor Microsoft- und einfachen Controllerprofilen hat.
ga: Táthar ag súil, a luaithe a thacaíonn Meta leis an síneadh croíphróifíl idirghníomhaíochta láimhe, go mbeidh tosaíocht ag an bpróifíl sin ar phróifílí Microsoft agus ar phróifílí rialtóra simplí.
ru: Ожидается, что как только Meta начнет поддерживать расширение основного профиля взаимодействия с рукой, этот профиль будет иметь приоритет над профилями Microsoft и простыми профилями контроллеров.
ta: கோர் கை தொடர்பு சுயவிவர நீட்டிப்பை மேவு ஆதரித்தவுடன், அந்த சுயவிவரம் மைக்ரோசாப்ட் மற்றும் எளிய கட்டுப்பாட்டு சுயவிவரங்கள் இரண்டையும் விட முன்னுரிமை பெறும் என்பது எதிர்பார்ப்பு.
uk: Очікується, що як тільки Meta підтримає розширення профілю основної взаємодії рук, цей профіль матиме перевагу як над Microsoft, так і над простими профілями контролера.
zh_tw: 預期未來 Meta 一旦支援核心手部互動設定檔擴充，將會優先於 Microsoft 與簡易控制器設定檔。

source: Gesture based input
de: Gestenbasierte Eingabe
fr: Entrée basée sur les gestes
ga: Ionchur bunaithe ar chomhartha
ru: Ввод с помощью жестов
ta: சைகை அடிப்படையிலான உள்ளீடு
uk: Введення на основі жестів
zh_tw: 基於手勢的輸入

source: If the platform doesn't support any interaction profiles when hand tracking is used, or if you're building an application where you need more complicated gesture support you're going to need to build your own gesture recognition system.
de: Wenn die Plattform bei Verwendung der Handverfolgung keine Interaktionsprofile unterstützt oder Sie eine Anwendung erstellen, für die Sie eine komplexere Gestenunterstützung benötigen, müssen Sie Ihr eigenes Gestenerkennungssystem erstellen.
ga: Mura dtacaíonn an t-ardán le haon phróifílí idirghníomhaíochta nuair a úsáidtear rianú láimhe, nó má tá feidhmchlár á tógáil agat ina dteastaíonn tacaíocht chomhartha níos casta uait beidh ort do chóras aitheantais comhartha féin a thógáil.
ru: Если платформа не поддерживает какие-либо профили взаимодействия при отслеживании рук или если вы создаете приложение, в котором требуется более сложная поддержка жестов, вам придется создать собственную систему распознавания жестов.
ta: கை கண்காணிப்பு பயன்படுத்தப்படும்போது எந்த தொடர்பு சுயவிவரங்களையும் தளம் ஆதரிக்கவில்லை என்றால், அல்லது உங்களுக்கு மிகவும் சிக்கலான சைகை உதவி தேவைப்படும் இடத்தில் நீங்கள் ஒரு பயன்பாட்டை உருவாக்கினால், உங்கள் சொந்த சைகை அங்கீகார முறையை உருவாக்க வேண்டும்.
uk: Якщо платформа не підтримує жодних профілів взаємодії, коли використовується відстеження рук, або якщо ви створюєте програму, де вам потрібна складніша підтримка жестів, вам потрібно буде створити власну систему розпізнавання жестів.
zh_tw: 若平台在手部追蹤時不支援任何互動設定檔，或你需要更複雜的手勢支援，則需自行實作手勢辨識系統。

source: You can obtain the full hand tracking data through the :ref:`XRHandTracker <class_xrhandtracker>` resource for each hand. You can obtain the hand tracker by calling ``XRServer.get_tracker`` and using either ``/user/hand_tracker/left`` or ``/user/hand_tracker/left`` as the tracker. This resource provides access to all the joint information for the given hand.
de: Sie können die vollständigen Handverfolgungsdaten über die Ressource :ref:`XRHandTracker <class_xrhandtracker>` für jede Hand abrufen. Sie können den Handtracker abrufen, indem Sie ``XRServer.get_tracker`` aufrufen und entweder ``/user/hand_tracker/left`` oder ``/user/hand_tracker/left`` als Tracker verwenden. Diese Ressource bietet Zugriff auf alle Gelenkinformationen für die jeweilige Hand.
ga: Is féidir leat na sonraí rianaithe láimhe iomlána a fháil tríd an acmhainn :ref:`XRHandTracker <class_xrhandtracker>` do gach lámh. Is féidir leat an lorgaire láimhe a fháil ach glaoch ar ``XRServer.get_tracker`` agus úsáid a bhaint as ``/user/hand_tracker/left`` nó ``/user/hand_tracker/left`` mar an rianaitheoir. Soláthraíonn an acmhainn seo rochtain ar an eolas comhpháirteach go léir don lámh ar leith.
ru: Полные данные отслеживания движений рук можно получить через ресурс :ref:`XRHandTracker <class_xrhandtracker>` для каждой руки. Получить данные отслеживания движений рук можно, вызвав ``XRServer.get_tracker`` и указав ``/user/hand_tracker/left`` или ``/user/hand_tracker/left`` в качестве трекера. Этот ресурс предоставляет доступ ко всей информации о суставах для данной руки.
ta: முழு கை கண்காணிப்பு தரவையும் நீங்கள் பெறலாம்: ref: `xrandtracker <class_xrandtracker>` ஒவ்வொரு கைக்கும் வளம். `` Xrserver.get_tracker`` ஐ அழைப்பதன் மூலமும், ``/பயனர்/ஏண்ட்_டிராக்கர்/இடது`` அல்லது ``/பயனர்/ஏண்ட்_டிராக்கர்/இடது`` ஐ டிராக்கராகப் பயன்படுத்துவதன் மூலமும் நீங்கள் கை டிராக்கரைப் பெறலாம். இந்த சான்று கொடுக்கப்பட்ட கைக்கான அனைத்து கூட்டுத் தகவல்களுக்கும் அணுகலை வழங்குகிறது.
uk: Ви можете отримати повні дані відстеження рук через ресурс :ref:`XRHandTracker <class_xrhandtracker>` для кожної руки. Ви можете отримати трекер рук, викликавши ``XRServer.get_tracker`` і використовуючи ``/user/hand_tracker/left`` або ``/user/hand_tracker/left`` як засіб відстеження. Цей ресурс надає доступ до всієї спільної інформації для даної руки.
zh_tw: 你可以透過每隻手的 :ref:`XRHandTracker <class_xrhandtracker>` 資源取得完整手部追蹤資料。可呼叫 ``XRServer.get_tracker`` 並以 ``/user/hand_tracker/left`` 或 ``/user/hand_tracker/right`` 做為追蹤器名稱，取得對應手部追蹤器。這個資源可存取該手所有關節資訊。

source: Detailing out a full gesture recognition algorithm goes beyond the scope of this manual however there are a number of community projects you can look at:
de: Die detaillierte Beschreibung eines vollständigen Algorithmus zur Gestenerkennung geht über den Rahmen dieses Handbuchs hinaus. Es gibt jedoch eine Reihe von Community-Projekten, die Sie sich ansehen können:
ga: Téann mionsonraí ar algartam aitheantais comhartha iomlán níos faide ná raon feidhme an lámhleabhair seo ach tá roinnt tionscadal pobail ann is féidir leat breathnú orthu:
ru: Подробное описание полного алгоритма распознавания жестов выходит за рамки данного руководства, однако есть ряд проектов сообщества, с которыми вы можете ознакомиться:
ta: ஒரு முழு சைகை அங்கீகார வழிமுறையை விவரிப்பது இந்த கையேட்டின் எல்லைக்கு அப்பாற்பட்டது, இருப்பினும் நீங்கள் பார்க்கக்கூடிய பல சமூக திட்டங்கள் உள்ளன:
uk: Детальний опис повного алгоритму розпізнавання жестів виходить за рамки цього посібника, однак є кілька проектів спільноти, які ви можете переглянути:
zh_tw: 完整的手勢辨識演算法超出本手冊範疇，不過你可以參考下列社群專案：

source: `Julian Todd's Auto hands library <https://github.com/Godot-Dojo/Godot-XR-AH>`_
de: `Julian Todds Auto-Hands-Bibliothek <https://github.com/Godot-Dojo/Godot-XR-AH>`_
fr: ` La bibliothèque Auto hands de Julian Todd <https://github.com/Godot-Dojo/Godot-XR-AH>`_
ga: `Leabharlann lámha Auto Julian Todd <https://github.com/Godot-Dojo/Godot-XR-AH>`_
ru: `Библиотека автоматических рук Julian Todd's <https://github.com/Godot-Dojo/Godot-XR-AH>`_
uk: `Бібліотека рук Джуліана Тодда Auto <https://github.com/Godot-Dojo/Godot-XR-AH>`_
zh_tw: `Julian Todd 的 Auto hands 函式庫 <https://github.com/Godot-Dojo/Godot-XR-AH>`_

source: `Malcolm Nixons Hand Pose Detector <https://github.com/Malcolmnixon/GodotXRHandPoseDetector>`_
de: `Malcolm Nixons Handhaltungsdetektor <https://github.com/Malcolmnixon/GodotXRHandPoseDetector>`_
fr: `Détecteur de pose de main (Hand Pose Detector) de Malcolm Nixons <https://github.com/Malcolmnixon/GodotXRHandPoseDetector>`_
ga: `Brathadóir Staideanna Láimhe Malcolm Nixons <https://github.com/Malcolmnixon/GodotXRHandPoseDetector>`_
ru: `Определитель положения рук Малкольма Никсонса <https://github.com/Malcolmnixon/GodotXRHandPoseDetector>`_
ta: `மால்கம் நிக்சன்ச் ஏண்ட் போச் டிடெக்டர் <https://github.com/malcolmnixon/godotxrhandposetetector>` _
uk: `Детектор пози руки Малкольма Ніксона <https://github.com/Malcolmnixon/GodotXRHandPoseDetector>`_
zh_tw: `Malcolm Nixon 的 Hand Pose Detector <https://github.com/Malcolmnixon/GodotXRHandPoseDetector>`_

source: Finally we need to add a :ref:`XRHandModifier3D <class_xrhandmodifier3d>` node as a child to our ``Skeleton3D`` node. This node will obtain the finger tracking data from OpenXR and apply it the hand model.
de: Schließlich müssen wir einen :ref:`XRHandModifier3D <class_xrhandmodifier3d>`-Knoten als untergeordnetes Element zu unserem ``Skeleton3D``-Knoten hinzufügen. Dieser Knoten erhält die Fingerverfolgungsdaten von OpenXR und wendet sie auf das Handmodell an.
ga: Ar deireadh ní mór dúinn nód :ref:`XRHandModifier3D <class_xrhandmodifier3d>` mar leanbh a chur lenár nód ``Skeleton3D``. Gheobhaidh an nód seo na sonraí rianaithe méar ó OpenXR agus cuirfidh sé an tsamhail láimhe i bhfeidhm.
uk: Нарешті нам потрібно додати вузол :ref:`XRHandModifier3D <class_xrhandmodifier3d>` як дочірній вузол до нашого вузла ``Skeleton3D``. Цей вузол отримуватиме дані відстеження пальців із OpenXR і застосовуватиме їх до моделі руки.
