Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/openxr_render_models.po
Languages: it, ru, ta, uk, zh_tw

source: OpenXR Render Models
it: Modelli di rendering OpenXR
ru: Модели рендеринга OpenXR
ta: OpenXR வழங்குதல் மாதிரிகள்
uk: Моделі рендерингу OpenXR
zh_tw: OpenXR 算繪模型

source: A cornerstone of OpenXR's API design is being as platform agnostic as possible. A great example of this is OpenXR's action map system where XR runtimes have to support core interaction profiles to fall back on, if no interaction profile exists for the hardware being used. This ensures that OpenXR applications keep functioning even when used on hardware that didn't exist when the application was released, or that the developers of the application did not have access too.
ru: Краеугольным камнем архитектуры API OpenXR является максимальная платформенная независимость. Прекрасным примером этого является система карт действий OpenXR, где среды выполнения XR должны поддерживать основные профили взаимодействия, к которым можно обратиться, если для используемого оборудования профиль взаимодействия отсутствует. Это гарантирует работоспособность приложений OpenXR даже при использовании на оборудовании, которого не существовало на момент выпуска приложения, или к которому у разработчиков приложения не было доступа.
ta: ஓபன்எக்ச்ஆரின் பநிஇ வடிவமைப்பின் ஒரு மூலக்கல்லானது முடிந்தவரை மேடையில் அஞ்ஞானவாதியாக உள்ளது. இதற்கு ஒரு சிறந்த எடுத்துக்காட்டு ஓபன்எக்ச்ஆரின் செயல் வரைபட அமைப்பு, எக்ச்ஆர் ரன் டைம்கள் வன்பொருளைப் பயன்படுத்துவதற்கு எந்த தொடர்பு சுயவிவரமும் இல்லை என்றால், எக்ச்ஆர் ரன் டைம்கள் பின்னோக்கி வருவதற்கு முக்கிய தொடர்பு சுயவிவரங்களை ஆதரிக்க வேண்டும். பயன்பாடு வெளியிடப்பட்டபோது இல்லாத வன்பொருளில் பயன்படுத்தும்போது கூட ஓபன்எக்ச்ஆர் பயன்பாடுகள் செயல்படுவதை இது உறுதி செய்கிறது, அல்லது பயன்பாட்டின் டெவலப்பர்களுக்கும் அணுகல் இல்லை.
uk: Наріжним каменем дизайну API OpenXR є максимально можлива платформонезалежність. Чудовим прикладом цього є система карт дій OpenXR, де середовища виконання XR повинні підтримувати основні профілі взаємодії, до яких можна повернутися, якщо для використовуваного обладнання не існує профілю взаємодії. Це гарантує, що програми OpenXR продовжуватимуть функціонувати навіть під час використання на обладнанні, якого не існувало на момент випуску програми, або до якого розробники програми не мали доступу.
zh_tw: OpenXR API 設計的一大基石，就是盡可能與平台無關。其典型例子是 OpenXR 的動作對應系統：即使目前使用的硬體沒有對應的互動設定檔，XR 執行階段也必須支援核心互動設定檔作為退回選項。這可確保 OpenXR 應用程式即便在發佈時尚不存在、或開發者無法取得的硬體上使用時，仍能正常運作。

source: A consequence of this is that the application developer doesn't know with any certainty what hardware is being used, as the XR runtime could be mimicking other hardware. The application developer thus can't show anything in relation to the actual hardware used, the most common use case being showing the controllers the user is currently holding.
ru: Следствием этого является то, что разработчик приложения не может точно знать, какое оборудование используется, поскольку среда выполнения XR может имитировать другое оборудование. Таким образом, разработчик приложения не может показать ничего, связанного с фактически используемым оборудованием. Наиболее распространённый вариант использования — отображение контроллеров, которые в данный момент держит пользователь.
ta: இதன் விளைவு என்னவென்றால், எக்ச்ஆர் இயக்க நேரம் மற்ற வன்பொருளைப் பிரதிபலிக்கும் என்பதால், பயன்பாட்டு டெவலப்பருக்கு எந்த வன்பொருள் பயன்படுத்தப்படுகிறது என்பதில் எந்த உறுதியும் தெரியாது. பயன்பாட்டு உருவாக்குபவர் பயன்படுத்தப்பட்ட உண்மையான வன்பொருள் தொடர்பாக எதையும் காட்ட முடியாது, பயனர் தற்போது வைத்திருக்கும் கட்டுப்படுத்திகளைக் காண்பிக்கும் மிகவும் பொதுவான பயன்பாட்டு வழக்கு.
uk: Наслідком цього є те, що розробник застосунку не знає з певністю, яке обладнання використовується, оскільки середовище виконання XR може імітувати інше обладнання. Таким чином, розробник застосунку не може показати нічого, що стосується фактично використаного обладнання, найпоширенішим випадком використання є показ контролерів, які користувач наразі тримає.
zh_tw: 其結果之一，是應用程式開發者無法確定實際使用中的硬體，因為 XR 執行階段可能在模擬其他硬體。於是，開發者無法展示與「實際硬體」相關的內容；最常見的需求就是顯示使用者手上正在握持的控制器。

source: Showing the correct controller models and having these models correctly positioned is important to a proper sense of immersion.
ru: Демонстрация правильных моделей контроллеров и их правильное расположение важны для создания ощущения полного погружения.
ta: சரியான கட்டுப்பாட்டு மாதிரிகளைக் காண்பிப்பது மற்றும் இந்த மாதிரிகள் சரியாக நிலைநிறுத்தப்படுவது சரியான மூழ்கும் உணர்வுக்கு முதன்மை.
uk: Для належного відчуття занурення важливо відобразити правильні моделі контролерів та їх правильне розташування.
zh_tw: 顯示正確的控制器模型並正確定位，對維持良好的沉浸感至關重要。

source: This is where OpenXR's `render models API <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_render_models>`_ comes in. This API allows us to query the XR runtime for 3D assets that are correct for the physical hardware being used. The API also allows us to query the position of this hardware within the tracking volume and the correct positioning of subcomponents of this hardware.
ru: Именно здесь на помощь приходит `API рендеринга моделей OpenXR <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_render_models>`_. Этот API позволяет нам запрашивать у среды выполнения XR 3D-ресурсы, соответствующие используемому физическому оборудованию. API также позволяет нам запрашивать положение этого оборудования в области отслеживания и корректное позиционирование его подкомпонентов.
ta: ஓபன்எக்ச்ஆரின் `ரெண்டர் மாதிரிகள் பநிஇ <https://registry.khronos.org/openxr/specs/1.1/html/xrspec.html#xr_ext_render_models> _ _ வருவது இங்குதான். கண்காணிப்பு தொகுதிக்குள் இந்த வன்பொருளின் நிலையையும் இந்த வன்பொருளின் துணைக் கூறுகளின் சரியான நிலைப்பாட்டையும் வினவவும் பநிஇ அனுமதிக்கிறது.
uk: Саме тут і з'являється API моделей рендерингу OpenXR <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_render_models>`_. Цей API дозволяє нам запитувати середовище виконання XR на наявність 3D-ресурсів, які відповідають використовуваному фізичному обладнанню. API також дозволяє нам запитувати положення цього обладнання в об'ємі відстеження та правильне розташування підкомпонентів цього обладнання.
zh_tw: 這正是 OpenXR 的 `Render Models API <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_render_models>`_ 派上用場的地方。此 API 允許我們向 XR 執行階段查詢與實際使用之硬體相符的 3D 資產。它也允許我們查詢該硬體在追蹤空間中的位置，以及其子元件的正確定位。

source: For instance, we can correctly position and animate the trigger or show buttons being pressed.
ru: Например, мы можем правильно расположить и анимировать триггер или показать нажатие кнопок.
ta: உதாரணமாக, தூண்டுதலை சரியாக நிலைநிறுத்தலாம் மற்றும் உயிரூட்டலாம் அல்லது அழுத்தும் பொத்தான்களைக் காட்டலாம்.
uk: Наприклад, ми можемо правильно розташувати та анімувати тригер або відображати натискання кнопок.
zh_tw: 例如，我們可以正確定位並驅動扳機的動畫，或顯示按鈕被按下的狀態。

source: For those runtimes that support the `controller data source for hand tracking <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_hand_tracking_data_source>`_ , we can also correctly position the user's fingers and hand according to the shape of the controller. Do note that this works in combination with the `hand joints motion range extension <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_hand_joints_motion_range>`_ to prevent clipping of the fingers.
ru: В средах выполнения, поддерживающих `источник данных контроллера для отслеживания рук <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_hand_tracking_data_source>`_, мы также можем корректно позиционировать пальцы и кисть пользователя в соответствии с формой контроллера. Обратите внимание, что это работает в сочетании с `расширением диапазона движения суставов руки <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_hand_joints_motion_range>`_, чтобы предотвратить застревание пальцев.
ta: கை கண்காணிப்புக்கான கட்டுப்பாட்டு தரவு மூலத்தை ஆதரிக்கும் அந்த இயக்க நேரங்களுக்கு <https://registry.khronos.org/openxr/specs/1.1/html/xrspec.html#xr_ext_and_tracking_data_source> `_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ரியல் ஆகியவற்றின் கட்டளைக்கு இணங்க முடியும். இது `கை மூட்டுகள் இயக்க வரம்பு நீட்டிப்பு <https://registry.khronos.org/openxr/specs/1.1/html/xrspec.html#xr_ext_joints_motion_motion_range> _ _ உடன் இணைந்து செயல்படுகிறது என்பதை நினைவில் கொள்க.
uk: Для тих середовищ виконання, що підтримують `джерело даних контролера для відстеження руки <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_hand_tracking_data_source>`_, ми також можемо правильно розташувати пальці та руку користувача відповідно до форми контролера. Зверніть увагу, що це працює в поєднанні з `розширенням діапазону руху суглобів кисті <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_hand_joints_motion_range>`_, щоб запобігти обрізанню пальців.
zh_tw: 對於支援 `手部追蹤控制器資料來源 <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_hand_tracking_data_source>`_ 的執行階段，我們也能依控制器的形狀正確定位使用者的手指與手。請注意，這需要搭配 `手部關節活動範圍擴充 <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_hand_joints_motion_range>`_ 使用，以避免手指穿模。

source: OpenXR Render models node
it: Nodo di modelli di rendering OpenXR
ru: Узел моделей рендеринга OpenXR
ta: Openxr வழங்குதல் மாதிரிகள் முனை
uk: Вузол моделей рендерингу OpenXR
zh_tw: OpenXR 算繪模型節點

source: The :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>` node can be used to automate most of the render models functionality. This node keeps track of the active render models currently made available by the XR runtime.
ru: Узел :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>` можно использовать для автоматизации большинства функций рендеринга моделей. Этот узел отслеживает активные рендеринг-модели, доступные в данный момент в среде выполнения XR.
ta: தி: ரெஃப்: `OpenxRrenderModelManager <class_openxrrendermodelManager>` வழங்குதல் மாதிரிகள் செயல்பாட்டை தானியக்கமாக்குவதற்கு முனை பயன்படுத்தப்படலாம். இந்த முனை தற்போது எக்ச்ஆர் இயக்க நேரத்தால் கிடைக்கக்கூடிய ஆக்டிவ் வழங்குதல் மாடல்களைக் கண்காணிக்கிறது.
uk: Вузол :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>` можна використовувати для автоматизації більшості функцій моделей рендерингу. Цей вузол відстежує активні моделі рендерингу, які наразі доступні у середовищі виконання XR.
zh_tw: :ref:`OpenXRRenderModelManager <class_OpenXRRenderModelManager>` 節點可用來自動化多數算繪模型的功能。此節點會追蹤 XR 執行階段目前提供的作用中算繪模型。

source: It will create child nodes for each active render model resulting in that render model being displayed.
ru: Он создаст дочерние узлы для каждой активной модели рендеринга, в результате чего будет отображена эта модель рендеринга.
ta: இது ஒவ்வொரு செயலில் உள்ள வழங்குதல் மாதிரிக்கும் குழந்தை முனைகளை உருவாக்கும், இதன் விளைவாக அந்த வழங்குதல் மாதிரி காண்பிக்கப்படும்.
uk: Він створить дочірні вузли для кожної активної моделі рендерингу, що призведе до відображення цієї моделі рендерингу.
zh_tw: 它會為每個作用中的算繪模型建立子節點，並據此顯示對應的算繪模型。

source: This node must have an :ref:`XROrigin3D<class_XROrigin3D>` node as an ancestor.
it: Questo nodo deve avere un nodo :ref:`XROrigin3D<class_XROrigin3D>` come antenato.
ru: Этот узел должен иметь узел :ref:`XROrigin3D<class_XROrigin3D>` в качестве предка.
ta: இந்த முனையில் ஒரு: ref: `xrorigin3d <class_xrorigin3d>` ஒரு மூதாதையராக முனை இருக்க வேண்டும்.
uk: Цей вузол повинен мати вузол :ref:`XROrigin3D<class_XROrigin3D>` як предка.
zh_tw: 此節點必須有一個 :ref:`XROrigin3D <class_XROrigin3D>` 節點作為其祖先。

source: If ``tracker`` is set to ``Any`` our node will show all render models currently being tracked. In this scenario this node must be a direct child of our :ref:`XROrigin3D<class_XROrigin3D>` node.
ru: Если для ``tracker`` задано значение ``Any``, наш узел будет отображать все отслеживаемые в данный момент модели рендеринга. В этом случае этот узел должен быть прямым дочерним узлом нашего узла :ref:`XROrigin3D<class_XROrigin3D>`.
ta: `` டிராக்கர்`` `` ஏதேனும்`` என அமைக்கப்பட்டால், தற்போது கண்காணிக்கப்படும் அனைத்து வழங்குதல் மாடல்களையும் எங்கள் முனை காண்பிக்கும். இந்த சூழ்நிலையில் இந்த முனை எங்கள் நேரடி குழந்தையாக இருக்க வேண்டும்: குறிப்பு: `xrorigin3d <class_xrorigin3d>` முனை.
uk: Якщо для параметра ``tracker`` встановлено значення ``Any``, наш вузол показуватиме всі моделі рендерингу, які наразі відстежуються. У цьому сценарії цей вузол має бути прямим дочірнім елементом нашого вузла :ref:`XROrigin3D<class_XROrigin3D>`.
zh_tw: 若將 ``tracker`` 設為 ``Any``，本節點會顯示目前所有被追蹤的算繪模型。此情況下，本節點必須是 :ref:`XROrigin3D <class_XROrigin3D>` 的直接子節點。

source: If ``tracker`` is set to ``None set`` our node will only show render models for which no tracker has been identified. In this scenario this node must also be a direct child of our :ref:`XROrigin3D<class_XROrigin3D>` node.
ru: Если для ``tracker`` задано значение ``None set``, наш узел будет отображать только модели рендеринга, для которых не идентифицирован трекер. В этом случае этот узел также должен быть прямым дочерним узлом нашего узла :ref:`XROrigin3D<class_XROrigin3D>`.
ta: `` டிராக்கர்`` `` எதுவுமில்லை` `` ஒன்றும் அமைக்கப்பட்டால், எங்கள் முனை வழங்குதல் மாதிரிகளை மட்டுமே காண்பிக்கும், அதற்காக எந்த டிராக்கரும் அடையாளம் காணப்படவில்லை. இந்த சூழ்நிலையில் இந்த முனை எங்கள் நேரடி குழந்தையாக இருக்க வேண்டும்: குறிப்பு: `xrorigin3d <class_xrorigin3d>` முனை.
uk: Якщо для параметра ``tracker`` встановлено значення ``None set``, наш вузол показуватиме лише ті моделі рендерингу, для яких не було ідентифіковано трекер. У цьому сценарії цей вузол також має бути прямим дочірнім елементом нашого вузла :ref:`XROrigin3D<class_XROrigin3D>`.
zh_tw: 若將 ``tracker`` 設為 ``None set``，本節點只會顯示尚未識別追蹤器的算繪模型。此情況下，本節點同樣必須是 :ref:`XROrigin3D <class_XROrigin3D>` 的直接子節點。

source: If ``tracker`` is set to ``Left Hand`` or ``Right Hand`` our node will only show render models related to our left or right hand respectively. In this scenario, our node can be placed deeper in the scene tree.
ru: Если ``tracker`` установлен на ``Left Hand`` или ``Right Hand``, наш узел будет отображать только модели рендеринга, относящиеся к левой или правой руке соответственно. В этом случае наш узел можно разместить глубже в дереве сцены.
ta: `` டிராக்கர்`` `` இடது கை`` அல்லது `வலது கை`` என அமைக்கப்பட்டால், எங்கள் முனை முறையே எங்கள் இடது அல்லது வலது கை தொடர்பான வழங்குதல் மாதிரிகளை மட்டுமே காண்பிக்கும். இந்த சூழ்நிலையில், எங்கள் முனை காட்சி மரத்தில் ஆழமாக வைக்கப்படலாம்.
uk: Якщо для параметра ``tracker`` встановлено значення ``Left Hand`` або ``Right Hand``, наш вузол відображатиме лише моделі рендерингу, пов'язані з нашою лівою або правою рукою відповідно. У цьому випадку наш вузол можна розмістити глибше в дереві сцени.
zh_tw: 若將 ``tracker`` 設為 ``Left Hand`` 或 ``Right Hand``，本節點將分別只顯示與左手或右手相關的算繪模型。此情況下，本節點可以放在場景樹更深的位置。

source: For most XR runtimes this means the render model represents a controller that is actually being held by the user but this is not a guarantee. Some XR runtimes will always set the tracker to either the left or right hand even if the controller is not currently held but is being tracked. You should always test this as this will lead to unwanted behavior.
ru: Для большинства сред выполнения XR это означает, что модель рендеринга представляет собой контроллер, который фактически находится в руках пользователя, но это не гарантируется. Некоторые среды выполнения XR всегда устанавливают трекер либо на левую, либо на правую руку, даже если контроллер в данный момент не находится в руках, но отслеживается. Всегда проверяйте это, так как это может привести к нежелательному поведению.
ta: பெரும்பாலான எக்ச்ஆர் ரன் டைம்களுக்கு இதன் பொருள் வழங்குதல் மாதிரி ஒரு கட்டுப்படுத்தியைக் குறிக்கிறது, அது உண்மையில் பயனரால் நடத்தப்படுகிறது, ஆனால் இது ஒரு பொறுப்பு அல்ல. சில எக்ச்ஆர் ரன் டைம்கள் எப்போதுமே டிராக்கரை இடது அல்லது வலது கைக்கு அமைக்கும், ஆனால் கட்டுப்படுத்தி தற்போது வைக்கப்படாவிட்டாலும் கண்காணிக்கப்பட்டாலும் கூட. இது தேவையற்ற நடத்தைக்கு வழிவகுக்கும் என்பதால் இதை நீங்கள் எப்போதும் சோதிக்க வேண்டும்.
uk: Для більшості середовищ виконання XR це означає, що модель рендерингу представляє контролер, який фактично тримає користувач, але це не гарантовано. Деякі середовища виконання XR завжди встановлюють трекер на ліву або праву руку, навіть якщо контролер наразі не тримається, але відстежується. Вам завжди слід перевіряти це, оскільки це призведе до небажаної поведінки.
zh_tw: 對多數 XR 執行階段來說，這表示算繪模型代表使用者實際握持的控制器，但不保證一定如此。有些 XR 執行階段即使控制器未被持握、只是在被追蹤，也會一律將追蹤器設定為左手或右手。因此請務必測試，否則可能導致不期望的行為。

source: In this scenario we can also specify an action for a pose in the action map by setting the ``make_local_to_pose`` property to the pose action. Use this in combination with an :ref:`XRController3D<class_XRController3D>` node that is using the same pose and you can now add a layer that allows you to deviate from the tracked position of both your controller and the related render model (see example below).
ru: В этом сценарии мы также можем указать действие для позы на карте действий, установив свойство ``make_local_to_pose`` для действия позы. Используйте это в сочетании с узлом :ref:`XRController3D<class_XRController3D>`, который использует ту же позу, и теперь вы можете добавить слой, позволяющий отклоняться от отслеживаемого положения как вашего контроллера, так и связанной с ним модели рендеринга (см. пример ниже).
ta: இந்த சூழ்நிலையில், `` make_local_to_pose`` சொத்தை போச் செயலுக்கு அமைப்பதன் மூலம் செயல் வரைபடத்தில் ஒரு போசுக்கான செயலையும் குறிப்பிடலாம். இதைப் பயன்படுத்தவும்: ref: `xrcontroller3d <class_xrcontroller3d>` ஒரே போசைப் பயன்படுத்தும் முனை, இப்போது உங்கள் கட்டுப்படுத்தி மற்றும் தொடர்புடைய வழங்குதல் மாதிரியின் கண்காணிக்கப்பட்ட நிலையில் இருந்து விலகுவதற்கு உங்களை அனுமதிக்கும் ஒரு அடுக்கைச் சேர்க்கலாம் (கீழே உள்ள எடுத்துக்காட்டைப் பார்க்கவும்).
uk: У цьому сценарії ми також можемо вказати дію для пози на карті дій, встановивши властивість ``make_local_to_pose`` для дії пози. Використовуйте це в поєднанні з вузлом :ref:`XRController3D<class_XRController3D>`, який використовує ту саму позу, і тепер ви можете додати шар, який дозволить вам відхилятися від відстеженої позиції як вашого контролера, так і пов'язаної з ним моделі рендерингу (див. приклад нижче).
zh_tw: 在此情境中，我們也可以將 ``make_local_to_pose`` 屬性設定為某個姿勢的動作，來指定動作對應表中的姿勢。配合同樣使用該姿勢的 :ref:`XRController3D <class_XRController3D>` 節點，即可新增一個層級，讓控制器與其相關的算繪模型得以偏離原先的追蹤位置（見下方範例）。

source: Combining the above with hand tracking does introduce the problem that hand tracking is completely independent from the action map system. You will need to combine the hand tracking and controller tracking poses to properly offset the render models.
ru: Сочетание вышеперечисленного с отслеживанием рук приводит к проблеме, поскольку отслеживание рук полностью независимо от системы карт действий. Вам потребуется объединить отслеживание рук и позы отслеживания контроллера для правильного смещения моделей рендеринга.
ta: மேலே உள்ளவற்றை கை கண்காணிப்புடன் இணைப்பது, செயல் வரைபட அமைப்பிலிருந்து கை கண்காணிப்பு முற்றிலும் சுயாதீனமாக இருக்கும் சிக்கலை அறிமுகப்படுத்துகிறது. வழங்குதல் மாதிரிகளை சரியாக ஈடுசெய்ய நீங்கள் கை கண்காணிப்பு மற்றும் கட்டுப்படுத்தி கண்காணிப்பு போச்களை இணைக்க வேண்டும்.
uk: Поєднання вищезазначеного з відстеженням рук створює проблему, оскільки відстеження рук повністю незалежне від системи карти дій. Вам потрібно буде поєднати відстеження рук та відстеження пози контролера, щоб правильно змістити моделі рендерингу.
zh_tw: 將上述方法與手部追蹤結合時，會遇到一個問題：手部追蹤與動作對應系統完全獨立。你需要結合手部追蹤與控制器追蹤的姿勢，才能正確地對算繪模型做偏移。

source: This falls beyond the scope of this documentation.
it: Ciò va oltre lo scopo di questa documentazione.
ru: Это выходит за рамки данной документации.
ta: இது இந்த ஆவணத்தின் எல்லைக்கு அப்பாற்பட்டது.
uk: Це виходить за рамки цієї документації.
zh_tw: 這超出本文件的範圍。

source: Render model manager example
ru: Пример менеджера моделей рендеринга
ta: மாதிரி மேலாளர் எடுத்துக்காட்டு
uk: Приклад менеджера моделей рендерингу
zh_tw: 算繪模型管理員範例

source: You can download `our render models demo <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_render_models>`_ which implements the setup described below.
it: Puoi scaricare la `nostra demo dei modelli di rendering <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_render_models>`_ che implementa la configurazione descritta di seguito.
ru: Вы можете загрузить `нашу демонстрационную версию моделей рендеринга <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_render_models>`_, которая реализует описанную ниже настройку.
ta: நீங்கள் `எங்கள் வழங்குதல் மாதிரிகள் டெமோ <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_render_models>` _ இது பதிவிறக்கம் செய்யலாம்.
uk: Ви можете завантажити `нашу демонстраційну версію моделей рендерингу <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_render_models>`_, яка реалізує описану нижче налаштування.
zh_tw: 你可以下載 `我們的算繪模型示範專案 <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_render_models>`_，其中實作了下述的設定。

source: In this setup we find an :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>` node directly underneath our :ref:`XROrigin3D<class_XROrigin3D>` node. On this node our ``target`` property is set to ``None set`` and will handle showing all render models that are currently not related to our left or right hand controllers.
ru: В этой настройке мы находим узел :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>` непосредственно под нашим узлом :ref:`XROrigin3D<class_XROrigin3D>`. В этом узле наше свойство ``target`` установлено в ``None set`` и будет обрабатывать отображение всех моделей рендеринга, которые в данный момент не связаны с нашими левым или правым контроллерами.
ta: இந்த அமைப்பில் நாம் ஒரு: குறிப்பு: `OpenxrrenderModelManager <class_openxrrenderModelManager>` எங்கள் அடியில் நேரடியாக முனை: குறிப்பு: `xrorigin3d <class_xrorigin3d>` முனை. இந்த முனையில் எங்கள் `` இலக்கு`` சொத்து `` எதுவுமில்லை`` ஆக அமைக்கப்பட்டுள்ளது, மேலும் தற்போது எங்கள் இடது அல்லது வலது கை கட்டுப்படுத்திகளுடன் தொடர்புடைய அனைத்து வழங்குதல் மாடல்களையும் காண்பிக்கும்.
uk: У цій конфігурації ми знаходимо вузол :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>` безпосередньо під нашим вузлом :ref:`XROrigin3D<class_XROrigin3D>`. На цьому вузлі наша властивість ``target`` встановлена на ``None set`` і оброблятиме відображення всіх моделей рендерингу, які наразі не пов'язані з нашими лівим або правим контролерами.
zh_tw: 在此設定中，我們在 :ref:`XROrigin3D <class_XROrigin3D>` 節點底下放了一個 :ref:`OpenXRRenderModelManager <class_OpenXRRenderModelManager>` 節點。其 ``target`` 屬性設為 ``None set``，用以顯示目前與左右手控制器無關的所有算繪模型。

source: We then see the same setup for our left and right hand so we'll focus on just the left hand.
ru: Затем мы видим ту же самую установку для левой и правой руки, поэтому сосредоточимся только на левой руке.
ta: எங்கள் இடது மற்றும் வலது கைக்கு அதே அமைப்பைக் காண்கிறோம், எனவே இடது கையில் கவனம் செலுத்துவோம்.
uk: Потім ми бачимо однакову конфігурацію для лівої та правої руки, тому зосередимося лише на лівій руці.
zh_tw: 接著左右手使用相同的設定，因此以下只專注在左手。

source: We have an :ref:`XRController3D<class_XRController3D>` that will track the location of our hand.
it: Abbiamo un :ref:`XRController3D<class_XRController3D>` che traccerà la posizione della nostra mano.
ru: У нас есть :ref:`XRController3D<class_XRController3D>`, который будет отслеживать местоположение нашей руки.
ta: எங்களிடம் ஒரு: ref: `xrcontroller3d <class_xrcontroller3d>` இது எங்கள் கையின் இருப்பிடத்தைக் கண்காணிக்கும்.
uk: У нас є :ref:`XRController3D<class_XRController3D>`, який відстежуватиме місцезнаходження нашої руки.
zh_tw: 我們有一個 :ref:`XRController3D <class_XRController3D>` 節點用來追蹤手的位置。
