Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/openxr_render_models.po
Languages: it, ru, ta, uk, zh_tw

source: We are using the ``grip`` pose in this example. The ``palm`` pose is arguably more suitable and predictable however it is not supported by all XR runtimes. See the hand tracking demo project for a solution to switching between these poses based on what is supported.
ru: В этом примере мы используем позу ``grip``«хват». Поза ``palm`` «ладонь», возможно, более подходящая и предсказуемая, однако она поддерживается не всеми средами выполнения XR. Решение переключения между этими позами в зависимости от поддерживаемых конфигураций можно найти в демонстрационном проекте отслеживания рук.
ta: இந்த எடுத்துக்காட்டில் `` பிடியில்`` போசைப் பயன்படுத்துகிறோம். `` பாம்`` போச் மிகவும் பொருத்தமானது மற்றும் கணிக்கக்கூடியது, இருப்பினும் இது அனைத்து எக்ச்ஆர் ரன் டைம்களால் ஆதரிக்கப்படவில்லை. ஆதரிக்கப்பட்டவற்றின் அடிப்படையில் இந்த போச்களுக்கு இடையில் மாறுவதற்கான தீர்வுக்காக கை கண்காணிப்பு டெமோ திட்டத்தைப் பார்க்கவும்.
uk: Ми використовуємо ``grip`` поза в цьому прикладі. ``palm`` поза, можливо, більш підходяща та передбачувана, проте вона підтримується не всіма середовищами виконання XR. Дивіться демонстраційний проект відстеження рук, щоб знайти рішення для перемикання між цими позами залежно від того, що підтримується.
zh_tw: 本例使用 ``grip`` 姿勢。嚴格來說 ``palm`` 姿勢更適合且更可預期，但並非所有 XR 執行階段都支援。請參考手部追蹤示範專案，了解如何根據支援度在這些姿勢間切換。

source: As a child of the node we have an :ref:`AnimatableBody3D<class_AnimatableBody3D>` node that follows the tracked location of the hand **but** will interact with physics objects to stop the player's hand from going through walls etc. This node has a collision shape that encapsulates the hand.
ru: В качестве дочернего элемента узла у нас есть узел :ref:`AnimatableBody3D<class_AnimatableBody3D>`, который следует за отслеживаемым местоположением руки, **но** будет взаимодействовать с физическими объектами, чтобы не дать руке игрока пройти сквозь стены и т. д. Этот узел имеет форму столкновения, которая инкапсулирует руку.
ta: முனையின் ஒரு குழந்தையாக எங்களிடம் ஒரு: ref: `அனிமேட்டபிள் பாடி 3 டி <class_animatableBody3d>` கையின் கண்காணிக்கப்பட்ட இருப்பிடத்தைப் பின்பற்றும் முனை ** ஆனால் ** இயற்பியல் பொருள்களுடன் தொடர்பு கொள்ளும், வீரரின் கையை சுவர்கள் வழியாகச் செல்வதைத் தடுக்க. இந்த முனையில் கை இணைக்கும் மோதல் வடிவத்தைக் கொண்டுள்ளது.
uk: Як дочірній елемент вузла, у нас є вузол :ref:`AnimatableBody3D<class_AnimatableBody3D>`, який слідкує за відстежуваним розташуванням руки, **але** взаємодіятиме з фізичними об'єктами, щоб запобігти проходженню руки гравця крізь стіни тощо. Цей вузол має форму зіткнення, яка інкапсулює руку.
zh_tw: 作為其子節點，我們加入了一個 :ref:`AnimatableBody3D <class_AnimatableBody3D>`，它會跟隨手部的追蹤位置，**但** 同時會與物理物件互動，避免玩家的手穿過牆面等。此節點具備包覆手部的碰撞形狀。

source: It is important to set the physics priority so that this logic runs after any physics logic that moves the XROrigin3D node or the hand will lag a frame behind.
ru: Важно установить приоритет физики так, чтобы эта логика выполнялась после любой физической логики, которая перемещает узел XROrigin3D, иначе рука будет отставать на кадр.
ta: இயற்பியல் முன்னுரிமையை அமைப்பது முதன்மை, இதனால் இந்த வழக்கு எக்ச்ரொரிசின் 3 டி முனையை நகர்த்தும் எந்த இயற்பியல் தர்க்கத்திற்கும் பிறகு இயங்குகிறது அல்லது கை ஒரு சட்டகத்தை பின்தங்கியிருக்கும்.
uk: Важливо встановити пріоритет фізики таким чином, щоб ця логіка виконувалася після будь-якої фізичної логіки, яка переміщує вузол XROrigin3D, інакше рука відставатиме на кадр.
zh_tw: 務必設定物理優先順序，使這段邏輯在任何會移動 XROrigin3D 的物理邏輯之後執行，否則手部會落後一個畫面幀。

source: The script below shows a basic implementation for this that you can build upon.
ru: Приведенный ниже сценарий демонстрирует базовую реализацию этого решения, которую вы можете использовать в качестве основы.
ta: கீழேயுள்ள ச்கிரிப்ட் இதற்கான அடிப்படை செயல்பாட்டைக் காட்டுகிறது.
uk: Наведений нижче скрипт показує базову реалізацію, на якій ви можете будувати далі.
zh_tw: 以下腳本展示了基本的實作，可在此基礎上擴充。

source: Finally we see another :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>` node, this one with ``target`` set to the appropriate hand and ``make_local_to_pose`` set to the correct pose. This will ensure that the render models related to this hand are properly shown and offset if our collision handler has altered the location.
ru: Наконец, мы видим ещё один узел :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>`, в котором ``target`` соответствует соответствующей руке, а ``make_local_to_pose`` — правильной позе. Это гарантирует, что модели рендеринга, связанные с этой рукой, будут отображаться и смещаться, если наш обработчик столкновений изменит местоположение.
ta: இறுதியாக நாம் இன்னொன்றைக் காண்கிறோம்: Ref: `OpenxRrenderModelManager <class_openxrrenderModelManager>` முனை, இது `` இலக்கு`` பொருத்தமான கைக்கு அமைக்கப்பட்டுள்ளது மற்றும் `` Make_local_to_pose`` `சரியான போச் அமைக்கவும். எங்கள் மோதல் கையாளுபவர் இருப்பிடத்தை மாற்றியிருந்தால், இந்த கை தொடர்பான வழங்குதல் மாதிரிகள் சரியாகக் காட்டப்படுவதையும் ஈடுசெய்யப்படுவதையும் இது உறுதி செய்யும்.
uk: Нарешті ми бачимо ще один вузол :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>`, цього разу з ``target``, встановленим на відповідну руку, та ``make_local_to_pose``, встановленим на правильну позу. Це гарантуватиме, що моделі рендерингу, пов'язані з цією рукою, будуть правильно відображені та зміщені, якщо наш обробник колізій змінив розташування.
zh_tw: 最後，還有另一個 :ref:`OpenXRRenderModelManager <class_OpenXRRenderModelManager>` 節點，這次將 ``target`` 設為對應的手，並將 ``make_local_to_pose`` 設為正確的姿勢。如此可確保與該手相關的算繪模型能正確顯示，且在碰撞處理改變位置時能正確做出偏移。

source: Render model node
it: Nodo di modello di rendering
ru: Узел модели рендеринга
ta: மாதிரி முனை வழங்கவும்
uk: Вузол рендерингу моделі
zh_tw: 算繪模型節點

source: The :ref:`OpenXRRenderModel<class_OpenXRRenderModel>` node implements all the logic to display and position a given render model provided by the render models API.
ru: Узел :ref:`OpenXRRenderModel<class_OpenXRRenderModel>` реализует всю логику для отображения и позиционирования заданной модели рендеринга, предоставляемой API моделей рендеринга.
ta: தி: ரெஃப்: `OpenxRrenderModel <class_openxrrendermodel>` முனைக் காட்சிகள் வழங்கப்பட்ட வழங்கப்பட்ட வழங்குதல் மாதிரியைக் காண்பிப்பதற்கும் நிலைநிறுத்துவதற்கும் அனைத்து தர்க்கங்களையும் முனைகிறது.
uk: Вузол :ref:`OpenXRRenderModel<class_OpenXRRenderModel>` реалізує всю логіку для відображення та позиціонування заданої моделі рендерингу, що надається API моделей рендерингу.
zh_tw: :ref:`OpenXRRenderModel <class_OpenXRRenderModel>` 節點實作了顯示與定位算繪模型所需的全部邏輯，這些模型由 Render Models API 提供。

source: Instances of this node are added by the render model manager node we used up above but you can interact with these directly if you wish.
ru: Экземпляры этого узла добавляются узлом менеджера моделей рендеринга, который мы использовали выше, но при желании вы можете взаимодействовать с ними напрямую.
ta: இந்த முனையின் நிகழ்வுகள் நாங்கள் மேலே பயன்படுத்திய வழங்குதல் மாதிரி மேலாளர் முனையால் சேர்க்கப்படுகின்றன, ஆனால் நீங்கள் விரும்பினால் நேரடியாக இவற்றுடன் தொடர்பு கொள்ளலாம்.
uk: Екземпляри цього вузла додаються вузлом менеджера моделей рендерингу, який ми використовували вище, але ви можете взаємодіяти з ними безпосередньо, якщо бажаєте.
zh_tw: 此節點的實例由上文使用的算繪模型管理員節點新增，不過若需要，你也可以直接與這些實例互動。

source: Whenever Godot obtains information about a new render model an RID is created to reference that render model.
ru: Всякий раз, когда Godot получает информацию о новой модели рендеринга, создается RID для ссылки на эту модель рендеринга.
ta: கோடோட் ஒரு புதிய வழங்குதல் மாதிரியைப் பற்றிய தகவல்களைப் பெறும்போதெல்லாம், அந்த வழங்குதல் மாதிரியைக் குறிக்க ஒரு ரிட் உருவாக்கப்படுகிறது.
uk: Щоразу, коли Godot отримує інформацію про нову модель рендерингу, створюється RID для посилання на цю модель рендерингу.
zh_tw: 每當 Godot 取得一個新算繪模型的資訊時，會建立一個 RID 來參照該算繪模型。

source: By assigning that RID to the ``render_model`` property on this node, the node will start displaying the render model and manage both the transform that places the render model in the correct place and animates all the sub objects.
ru: Назначив этот RID свойству ``render_model`` этого узла, узел начнет отображать модель рендеринга и управлять как преобразованием, которое помещает модель рендеринга в правильное место, так и анимацией всех подобъектов.
ta: இந்த முனையில் `` ரெண்டர்_மோடல்` சொத்துக்கு அகற்றுவதை ஒதுக்குவதன் மூலம், முனை வழங்குதல் மாதிரியைக் காண்பிக்கத் தொடங்கும் மற்றும் வழங்குதல் மாதிரியை சரியான இடத்தில் வைக்கும் மற்றும் அனைத்து துணை பொருட்களையும் அனிமேசன் செய்யும் மாற்றத்தையும் நிர்வகிக்கும்.
uk: Призначивши цей RID властивості ``render_model`` цього вузла, вузол почне відображати модель рендерингу та керувати як перетворенням, яке розміщує модель рендерингу в правильному місці, так і анімує всі підоб'єкти.
zh_tw: 將該 RID 指定給本節點的 ``render_model`` 屬性後，此節點就會開始顯示該算繪模型，並同時管理將其放置在正確位置所需的轉換，以及所有子物件的動畫。

source: The ``get_top_level_path`` function will return the top level path associated with this render model. This will point to either the left or right hand. As the top level path can be set or cleared depending on whether the user picks up, or puts down, the controller you can connect to the ``render_model_top_level_path_changes`` signal and react to these changes.
ru: Функция ``get_top_level_path`` вернет путь верхнего уровня, связанный с этой моделью рендеринга. Он будет указывать либо на левую, либо на правую руку. Поскольку путь верхнего уровня может быть установлен или удален в зависимости от того, поднимает ли пользователь контроллер или опускает его, вы можете подключиться к сигналу ``render_model_top_level_path_changes`` и реагировать на эти изменения.
ta: `` Get_top_level_path`` செயல்பாடு இந்த வழங்குதல் மாதிரியுடன் தொடர்புடைய உயர் மட்ட பாதையை வழங்கும். இது இடது அல்லது வலது கையை சுட்டிக்காட்டும். பயனர் எடுக்கிறாரா, அல்லது கீழே வைக்கிறாரா என்பதைப் பொறுத்து மேல் நிலை பாதையை அமைக்கலாம் அல்லது அழிக்க முடியும் என்பதால், நீங்கள் `` ரெண்டர்_மோடெல்_டோப்_லெவல்_பாத்_சேஞ்ச்`` சமிக்ஞையுடன் இணைக்க முடியும் மற்றும் இந்த மாற்றங்களுக்கு எதிர்வினையாற்றலாம்.
uk: Функція ``get_top_level_path`` поверне шлях верхнього рівня, пов'язаний з цією моделлю рендерингу. Він вказуватиме на ліву або праву руку. Оскільки шлях верхнього рівня можна встановити або очистити залежно від того, чи користувач бере контролер, чи опускає його, ви можете підключитися до сигналу ``render_model_top_level_path_changes`` та реагувати на ці зміни.
zh_tw: ``get_top_level_path`` 函式會回傳與此算繪模型關聯的最高層路徑，指向左手或右手。由於最高層路徑會隨使用者拾起或放下控制器而被設定或清除，你可以連接 ``render_model_top_level_path_changes`` 訊號以回應這些變化。

source: Depending on your setup of the :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>` nodes, render models will be removed or added as their top level path changes.
ru: В зависимости от настройки узлов :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>`, модели рендеринга будут удаляться или добавляться по мере изменения их пути верхнего уровня.
ta: உங்கள் அமைப்பைப் பொறுத்து: ref: `OpenxRrenderModelManager <class_openxrrendermodelManager>` முனைகள், வழங்குதல் மாதிரிகள் அகற்றப்படும் அல்லது அவற்றின் உயர் மட்ட பாதை மாறும்போது சேர்க்கப்படும்.
uk: Залежно від налаштувань вузлів :ref:`OpenXRRenderModelManager<class_OpenXRRenderModelManager>`, моделі рендерингу будуть видалятися або додаватися, коли змінюється шлях їхнього верхнього рівня.
zh_tw: 依據你設定的 :ref:`OpenXRRenderModelManager <class_OpenXRRenderModelManager>` 節點，算繪模型會隨其最高層路徑的變化而被移除或加入。

source: Backend access
it: Accesso al backend
ru: Внутренний доступ
ta: பின்தளத்தில் அணுகல்
uk: Доступ до серверної частини
zh_tw: 後端存取

source: The nodes we've detailed out above handle all the display logic for us but it is possible to interact with the data that drives this directly and create your own implementation.
ru: Узлы, которые мы подробно описали выше, обрабатывают всю логику отображения, но можно напрямую взаимодействовать с данными, которые этим управляют, и создавать собственную реализацию.
ta: மேலே நாங்கள் விவரித்த முனைகள் எங்களுக்கான அனைத்து காட்சி தர்க்கத்தையும் கையாளுகின்றன, ஆனால் இதை நேரடியாக இயக்கும் தரவுகளுடன் தொடர்பு கொள்ளவும், உங்கள் சொந்த செயல்பாட்டை உருவாக்கவும் முடியும்.
uk: Вузли, які ми детально описали вище, обробляють всю логіку відображення, але ви можете взаємодіяти з даними, які безпосередньо цим керують, і створювати власну реалізацію.
zh_tw: 上述節點已為我們處理所有顯示邏輯，但你也可以直接與其背後的資料互動，並自行實作。

source: For this you can access the :ref:`OpenXRRenderModelExtension<class_OpenXRRenderModelExtension>` singleton.
ru: Для этого можно обратиться к синглтону :ref:`OpenXRRenderModelExtension<class_OpenXRRenderModelExtension>`.
ta: இதற்காக நீங்கள் அணுகலாம்: ref: `OpenxrrenderModeLextension <clse_openxrrenderModeLextension>` சிங்கிள்டன்.
uk: Для цього ви можете отримати доступ до синглтона :ref:`OpenXRRenderModelExtension<class_OpenXRRenderModelExtension>`.
zh_tw: 為此，你可以存取 :ref:`OpenXRRenderModelExtension <class_OpenXRRenderModelExtension>` 單例。

source: This object also lets you query whether render models are supported and enabled on the device currently being used by calling the ``is_active`` function on this object.
ru: Этот объект также позволяет вам запрашивать, поддерживаются ли и включены ли модели рендеринга на текущем устройстве, вызывая функцию ``is_active`` для этого объекта.
ta: இந்த பொருளில் `` is_active`` செயல்பாட்டை அழைப்பதன் மூலம் தற்போது பயன்படுத்தப்படும் சாதனத்தில் வழங்குதல் மாதிரிகள் ஆதரிக்கப்பட்டு இயக்கப்பட்டதா என்பதை வினவவும் இந்த பொருள் உங்களை அனுமதிக்கிறது.
uk: Цей об'єкт також дозволяє запитувати, чи підтримуються та чи ввімкнені моделі рендерингу на пристрої, що використовується на даний момент, викликаючи функцію ``is_active`` на цьому об'єкті.
zh_tw: 此物件也可用於查詢目前裝置是否支援並啟用了算繪模型，方法是呼叫此物件的 ``is_active`` 函式。

source: The built-in logic implements the `interaction render model API <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_interaction_render_model>`_ that lists all render models related to controllers and similar devices that are present in the action map. It will automatically create and remove render model entities that are exposed through this API.
ru: Встроенная логика реализует `API модели рендеринга взаимодействия <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_interaction_render_model>`_, который выводит список всех моделей рендеринга, связанных с контроллерами и аналогичными устройствами, представленными на карте действий. Он автоматически создает и удаляет сущности моделей рендеринга, доступные через этот API.
ta: உள்ளமைக்கப்பட்ட வழக்கு `இன்டர்மேசன் வழங்குதல் மாதிரி பநிஇ <https://registry.khronos.org/openxr/specs/1.1/html/xrspec.html#xr_ext_interaction_render_model>` _ _ இது கட்டுப்பாட்டாளர்கள் மற்றும் ஒத்த சாதனங்கள் தொடர்பான அனைத்து வழங்கல் மாதிரிகள். இந்த பநிஇ மூலம் வெளிப்படும் வழங்குதல் மாதிரி நிறுவனங்களை இது தானாக உருவாக்கி அகற்றும்.
uk: Вбудована логіка реалізує `interaction render model API <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_interaction_render_model>`_, який відображає список усіх моделей рендерингу, пов'язаних з контролерами та подібними пристроями, присутніми на карті дій. Він автоматично створюватиме та видалятиме сутності моделей рендерингу, що відображаються через цей API.
zh_tw: 內建邏輯實作了 `Interaction Render Model API <https://registry.khronos.org/OpenXR/specs/1.1/html/xrspec.html#XR_EXT_interaction_render_model>`_，會列出動作對應表中與控制器及類似裝置相關的所有算繪模型，並自動建立與移除透過此 API 暴露的算繪模型實體。

source: As other extensions become available these can be implemented in a GDExtension plugin. Such a plugin can call ``render_model_create`` and ``render_model_destroy`` to create the object that will provide access to that render model through the core render models API.
ru: По мере появления других расширений их можно будет реализовать в плагине GDExtension. Такой плагин может вызывать ``render_model_create`` и ``render_model_destroy`` для создания объекта, который обеспечит доступ к этой модели рендеринга через API базовых моделей рендеринга.
ta: மற்ற நீட்டிப்புகள் கிடைக்கும்போது இவை gdextension சொருகி செயல்படுத்தப்படலாம். அத்தகைய சொருகி கோர் வழங்குதல் மாதிரிகள் பநிஇ மூலம் அந்த வழங்குதல் மாதிரிக்கான அணுகலை வழங்கும் பொருளை உருவாக்க `` ரெண்டர்_மோடல்_ கிரேட்`` மற்றும் `` ரெண்டர்_மோடெல்_டெச்ட்ரோய்`` ஐ அழைக்கலாம்.
uk: Коли з'являться інші розширення, їх можна буде реалізувати в плагіні GDExtension. Такий плагін може викликати ``render_model_create`` та ``render_model_destroy`` для створення об'єкта, який надаватиме доступ до цієї моделі рендерингу через основний API моделей рендерингу.
zh_tw: 未來若出現其他擴充功能，可透過 GDExtension 外掛來實作。此類外掛可呼叫 ``render_model_create`` 與 ``render_model_destroy``，建立可透過核心 Render Models API 存取該算繪模型的物件。

source: You should not destroy a render model outside of this logic.
ru: Не следует уничтожать модель рендеринга вне этой логики.
ta: இந்த தர்க்கத்திற்கு வெளியே ஒரு வழங்குதல் மாதிரியை நீங்கள் அழிக்கக்கூடாது.
uk: Не слід знищувати модель рендерингу поза цією логікою.
zh_tw: 不應在此邏輯之外銷毀算繪模型。

source: You can connect to the ``render_model_added`` and ``render_model_removed`` signals to be informed when new render models are added or removed.
ru: Вы можете подключиться к сигналам ``render_model_added`` и ``render_model_removed``, чтобы получать уведомления о добавлении или удалении новых моделей рендеринга.
ta: புதிய வழங்குதல் மாதிரிகள் சேர்க்கப்படும்போது அல்லது அகற்றப்படும்போது தெரிவிக்கப்பட வேண்டிய `` ரெண்டர்_மாடல்_டெட்`` மற்றும் `` ரெண்டர்_மோடல்_ரெமோவவ்` சமிக்ஞைகளுடன் நீங்கள் இணைக்கலாம்.
uk: Ви можете підключитися до сигналів ``render_model_added`` та ``render_model_removed``, щоб отримувати інформацію про додавання або видалення нових моделей рендерингу.
zh_tw: 你可以連接 ``render_model_added`` 與 ``render_model_removed`` 訊號，以得知何時有新的算繪模型被加入或移除。

source: The core methods for working with this API are listed below:
ru: Основные методы работы с этим API перечислены ниже:
ta: இந்த பநிஇ உடன் பணிபுரியும் முக்கிய முறைகள் கீழே பட்டியலிடப்பட்டுள்ளன:
uk: Основні методи роботи з цим API перелічені нижче:
zh_tw: 以下列出操作此 API 的核心方法：

source: Render modele extension functions
ru: Функции расширения Render modele
ta: மோடல் நீட்டிப்பு செயல்பாடுகளை வழங்கவும்
uk: Функції розширення моделей візуалізації
zh_tw: 算繪模型擴充功能函式

source: Function
it: Funzione
ru: Функция
ta: சார்பு
zh_tw: 函式

source: Description
it: Descrizione
ru: Описание
ta: விவரம்
uk: Опис
zh_tw: 說明

source: Provides an array of RIDs for all render models that are being tracked.
it: Fornisce un'array di RID per tutti i modelli di rendering tracciati.
ru: Предоставляет массив RID-ов для всех отслеживаемых моделей рендеринга.
ta: கண்காணிக்கப்படும் அனைத்து வழங்குதல் மாடல்களுக்கும் ரிட்ச் வரிசையை வழங்குகிறது.
uk: Надає масив RID для всіх моделей рендерингу, які відстежуються.
zh_tw: 提供所有正在被追蹤之算繪模型的 RID 陣列。

source: Provides a new scene that contains all meshes needed to display the render model.
it: Fornisce una nuova scena che contiene tutte le mesh necessarie per visualizzare il modello di rendering.
ru: Предоставляет новую сцену, содержащую все сетки, необходимые для отображения модели рендеринга.
ta: வழங்குதல் மாதிரியைக் காண்பிக்கத் தேவையான அனைத்து மெச்களும் கொண்ட புதிய காட்சியை வழங்குகிறது.
uk: Надає нову сцену, яка містить усі сітки, необхідні для відображення моделі рендерингу.
zh_tw: 提供一個新場景，包含顯示該算繪模型所需的所有網格。

source: Provides a list of subaction paths from your action map related to this render mode.
ru: Предоставляет список путей поддействий из вашей карты действий, связанных с этим режимом рендеринга.
ta: இந்த வழங்குதல் பயன்முறையுடன் தொடர்புடைய உங்கள் செயல் வரைபடத்திலிருந்து கழிவு பாதைகளின் பட்டியலை வழங்குகிறது.
uk: Надає список шляхів піддій з вашої карти дій, пов'язаних з цим режимом рендерингу.
zh_tw: 提供動作對應表中與此算繪模型相關的子動作路徑列表。

source: Returns the top level path associated with this render model (if any). Use the ``render_model_top_level_path_changed`` signal to react to this changing.
it: Restituisce il percorso di livello superiore associato a questo modello di rendering (se presente). Utilizzare il segnale ``render_model_top_level_path_changed`` per reagire alla modifica di questo percorso.
ru: Возвращает путь верхнего уровня, связанный с этой моделью рендеринга (если таковой имеется). Используйте сигнал ``render_model_top_level_path_changed``, чтобы отреагировать на это изменение.
ta: இந்த வழங்குதல் மாதிரியுடன் தொடர்புடைய உயர் மட்ட பாதையை வழங்குகிறது (ஏதேனும் இருந்தால்). இந்த மாற்றத்திற்கு எதிர்வினையாற்ற `` ரெண்டர்_மோடெல்_டோப்_லெவல்_பாத்_சாங்`` சமிக்ஞையைப் பயன்படுத்தவும்.
uk: Повертає шлях верхнього рівня, пов'язаний з цією моделлю рендерингу (якщо така є). Використовуйте сигнал ``render_model_top_level_path_changed`` для реагування на цю зміну.
zh_tw: 回傳與此算繪模型關聯的最高層路徑（若有）。可透過 ``render_model_top_level_path_changed`` 訊號來回應此變更。

source: render_model_get_confidence
ta: Render_model_get_confication

source: Returns the tracking confidence for the tracking data for this render model.
it: Restituisce la confidenza di tracciamento per i dati di tracciamento per questo modello di rendering.
ru: Возвращает достоверность отслеживания для данных отслеживания для этой модели рендеринга.
ta: இந்த வழங்குதல் மாதிரிக்கான கண்காணிப்பு தரவுகளுக்கான கண்காணிப்பு நம்பிக்கையை வழங்குகிறது.
uk: Повертає впевненість відстеження для даних відстеження для цієї моделі рендерингу.
zh_tw: 回傳此算繪模型追蹤資料的追蹤信心度。

source: Returns the root transform for this render model within our current reference space. This can be used to place the render model in space.
ru: Возвращает корневое преобразование для данной модели рендеринга в текущем пространстве отсчета. Это преобразование можно использовать для размещения модели рендеринга в пространстве.
ta: எங்கள் தற்போதைய குறிப்பு இடத்திற்குள் இந்த வழங்குதல் மாதிரிக்கான ரூட் உருமாற்றத்தை வழங்குகிறது. வழங்குதல் மாதிரியை விண்வெளியில் வைக்க இதைப் பயன்படுத்தலாம்.
uk: Повертає кореневе перетворення для цієї моделі візуалізації в межах нашого поточного простору відліку. Це можна використовувати для розміщення моделі візуалізації в просторі.
zh_tw: 回傳此算繪模型在目前參考空間中的根轉換，可用於將算繪模型放置到空間中。

source: Returns the number of nodes in our render model scene that can be animated
it: Restituisce il numero di nodi nella scena del nostro modello di rendering che sono animabili
ru: Возвращает количество узлов в нашей сцене модели рендеринга, которые можно анимировать
ta: அனிமேசன் செய்யக்கூடிய எங்கள் வழங்குதல் மாதிரி காட்சியில் முனைகளின் எண்ணிக்கையை வழங்குகிறது
uk: Повертає кількість вузлів у нашій сцені моделі рендерингу, які можна анімувати
zh_tw: 回傳此算繪模型場景中可被驅動動畫的節點數量

source: Returns the name of the node that we can animate. Note that this node can be any number of levels deep within the scene.
it: Restituisce il nome del nodo che possiamo animare. Nota che questo nodo può trovarsi a qualsiasi livello di profondità nella scena.
ru: Возвращает имя узла, который можно анимировать. Обратите внимание, что этот узел может находиться на любом количестве уровней в глубину сцены.
ta: நாம் உயிரூட்டக்கூடிய முனையின் பெயரை வழங்குகிறது. இந்த முனை காட்சிக்குள் ஆழமான எத்தனை நிலைகளாக இருக்கலாம் என்பதை நினைவில் கொள்க.
uk: Повертає назву вузла, який ми можемо анімувати. Зверніть увагу, що цей вузол може бути на будь-якій кількості рівнів глибини в сцені.
zh_tw: 回傳可被驅動動畫之節點的名稱。請注意，此節點可能位於場景中任意深度的階層。

source: Returns true if this animatable node should be visible
it: Restituisce true se questo nodo animabile deve essere visibile
ru: Возвращает true, если этот анимируемый узел должен быть видимым
ta: இந்த அனிமேட்டபிள் முனை தெரியும் என்றால் உண்மை
uk: Повертає значення true, якщо цей анімований вузол має бути видимим
zh_tw: 若此可動畫節點應可見則回傳 true
