Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/openxr_hand_tracking.po
Languages: de, fr, ga, it, ru, ta, uk, zh_cn, zh_tw

source: OpenXR hand tracking
fr: Suivi des mains OpenXR
ga: Rianú láimhe OpenXR
it: Tracciamento delle mani in OpenXR
ru: Отслеживание рук OpenXR
ta: Openxr கை கண்காணிப்பு
uk: Відстеження руки OpenXR
zh_cn: OpenXR 手部跟踪
zh_tw: OpenXR 手部追蹤

source: Introduction
de: Einführung
ga: Réamhrá
it: Introduzione
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_cn: 前言
zh_tw: 前言

source: This page focuses specifically on the feature set exposed through OpenXR. Parts of the functionality presented here also applies to WebXR and can by provided by other XR interfaces.
de: Diese Seite konzentriert sich speziell auf den Funktionsumfang, der durch OpenXR verfügbar gemacht wird. Teile der hier vorgestellten Funktionalität gelten auch für WebXR und können von anderen XR-Schnittstellen bereitgestellt werden.
fr: Cette page se concentre spécifiquement sur les fonctionnalités exposées par OpenXR. Une partie des fonctionnalités présentées ici s'appliquent également à WebXR et peuvent être fournies par d'autres interfaces XR.
ga: Díríonn an leathanach seo go sonrach ar an tacar gné a nochtadh trí OpenXR. Baineann codanna den fheidhmiúlacht a chuirtear i láthair anseo le WebXR freisin agus is féidir iad a sholáthar ag comhéadain XR eile.
ru: Эта страница посвящена функционалу, предоставляемому OpenXR. Некоторые из представленных здесь функций также применимы к WebXR и могут быть реализованы другими интерфейсами XR.
ta: இந்த பக்கம் குறிப்பாக OpenXR மூலம் வெளிப்படும் அம்சத் தொகுப்பில் கவனம் செலுத்துகிறது. இங்கே வழங்கப்பட்ட செயல்பாட்டின் பகுதிகள் வெப்எக்ச்ஆருக்கும் பொருந்தும் மற்றும் பிற எக்ச்ஆர் இடைமுகங்களால் வழங்கப்படலாம்.
uk: Ця сторінка присвячена особливому набору функцій, доступних через OpenXR. Деякі функції, представлені тут, також застосовуються до WebXR і можуть надаватися іншими інтерфейсами XR.
zh_cn: 此页面着重于 OpenXR 提供的特性。这里提到的部分功能同样适用于 WebXR，也可以由其他 XR 接口提供。
zh_tw: 本頁重點說明 OpenXR 所提供的手部追蹤功能，部分介紹的功能同樣適用於 WebXR，或可由其他 XR 介面提供。

source: When discussing hand tracking it is important to know that there are differences of opinion as to where lines are drawn. The practical result of this is that there are differences in implementation between the different OpenXR runtimes. You may find yourself in a place where chosen hardware doesn't support a piece of the puzzle or does things differently enough from the other platforms that you need to do extra work.
de: Bei der Diskussion über Handtracking ist es wichtig zu wissen, dass es unterschiedliche Meinungen darüber gibt, wo die Grenzen gezogen werden. In der Praxis hat dies zur Folge, dass es Unterschiede in der Implementierung zwischen den verschiedenen OpenXR-Laufzeiten gibt. Möglicherweise finden Sie sich in einer Situation wieder, in der die ausgewählte Hardware ein Teil des Puzzles nicht unterstützt oder die Dinge so anders macht als die anderen Plattformen, dass Sie zusätzliche Arbeit leisten müssen.
ga: Agus rianú láimhe á phlé tá sé tábhachtach go mbeadh a fhios agat go bhfuil difríochtaí tuairimí ann maidir le cá bhfuil línte tarraing Is é toradh praiticiúil seo ná go bhfuil difríochtaí ann maidir le cur i bhfeidhm idir na tréimhsí éagsúla OpenXR. B'fhéidir go bhfaighidh tú féin in áit nach dtacaíonn crua-earraí roghnaithe le píosa den bhfreagra nó nach ndéanann tú rudaí difriúil go leor ó na hardáin eile a theastaíonn uait chun obair bhreise a dhéanamh.
ru: При обсуждении отслеживания рук важно понимать, что существуют различные мнения относительно того, где проводить границы. Практическим результатом этого являются различия в реализации между различными средами выполнения OpenXR. Вы можете оказаться в ситуации, когда выбранное оборудование не поддерживает какую-либо часть головоломки или работает настолько иначе, чем другие платформы, что вам потребуется дополнительная работа.
ta: கை கண்காணிப்பைப் பற்றி விவாதிக்கும்போது, கோடுகள் எங்கு வரையப்படுகின்றன என்பதில் கருத்து வேறுபாடுகள் உள்ளன என்பதை அறிந்து கொள்வது தேவை. இதன் நடைமுறை முடிவு என்னவென்றால், வெவ்வேறு ஓபன்எக்ச்ஆர் ரன் டைம்களுக்கு இடையில் செயல்படுத்துவதில் வேறுபாடுகள் உள்ளன. தேர்ந்தெடுக்கப்பட்ட வன்பொருள் புதிரின் ஒரு பகுதியை ஆதரிக்காத அல்லது கூடுதல் வேலைகளைச் செய்ய வேண்டிய பிற தளங்களிலிருந்து வித்தியாசமாகச் செய்யும் இடத்தில் நீங்கள் ஒரு இடத்தில் இருப்பதைக் காணலாம்.
uk: Обговорюючи відстеження рук, важливо знати, що існують розбіжності в думках щодо місця проведення ліній. Практичним результатом цього є те, що існують відмінності в реалізації між різними середовищами виконання OpenXR. Ви можете опинитися в такому місці, де вибране апаратне забезпечення не підтримує частину головоломки або робить речі настільки не так, як інші платформи, що вам потрібно зробити додаткову роботу.
zh_cn: 在讨论手跟踪前应当先意识到，各个不同的系统对各个区域的理解不同。因此，不同的 OpenXR 运行时实现的表现也会不同。在开发过程中，你可能遇到某硬件不支持某一操作的问题，或者出现与其他平台表现的差别大到需要额外处理的情况。
zh_tw: 在討論手部追蹤時，需注意各平台對於功能範圍界定有所不同。這導致不同 OpenXR 執行環境在實作上會有差異。你可能會遇到某些硬體不支援特定功能，或其實作方式與其他平台不同，因此需額外處理相容性問題。

source: That said, recent improvements to the OpenXR specification are closing these gaps and as platforms implement these improvements we are getting closer to a future where we have either full portability between platforms or at least a clear way to detect the capabilities of a platform.
de: Allerdings schließen die jüngsten Verbesserungen der OpenXR-Spezifikation diese Lücken und da die Plattformen diese Verbesserungen implementieren, kommen wir einer Zukunft näher, in der wir entweder über vollständige Portabilität zwischen Plattformen verfügen oder zumindest eine klare Möglichkeit, die Fähigkeiten einer Plattform zu erkennen.
ga: É sin ráite, tá feabhsuithe le déanaí ar shonraíocht OpenXR ag dúnadh na bearnaí seo agus de réir mar a chuireann ardáin na feabhsuithe seo i bhfeidhm táimid ag dul níos gaire do thodhchaí ina bhfuil iniomparthacht iomlán againn idir ardáin nó bealach soiléir ar a laghad chun cumais ardáin a bhrath.
ru: Тем не менее, недавние улучшения спецификации OpenXR закрывают эти пробелы, и по мере того, как платформы реализуют эти улучшения, мы приближаемся к будущему, в котором у нас будет либо полная переносимость между платформами, либо, по крайней мере, четкий способ определения возможностей платформы.
ta: ஓபன்எக்ச்ஆர் விவரக்குறிப்பின் அண்மைக் கால மேம்பாடுகள் இந்த இடைவெளிகளை மூடுகின்றன, மேலும் தளங்கள் இந்த மேம்பாடுகளைச் செயல்படுத்தும்போது, எதிர்காலத்துடன் நாங்கள் நெருங்கி வருகிறோம், அங்கு நாங்கள் தளங்களுக்கு இடையில் முழு பெயர்வுத்திறன் அல்லது ஒரு தளத்தின் திறன்களைக் கண்டறிய ஒரு தெளிவான வழி.
uk: Тим не менш, нещодавні вдосконалення специфікації OpenXR усувають ці прогалини, і оскільки платформи впроваджують ці вдосконалення, ми наближаємося до майбутнього, де ми матимемо або повну переносимість між платформами, або принаймні чіткий спосіб визначення можливостей платформи.
zh_cn: 尽管如此，近期对 OpenXR 规范的改进缩小了这种差距，而随着各个平台开始实现新版规范，我们也在逐步迈向一个各个平台之间可以完美移植的美好未来，或者至少能拥有一个可以检测平台功能的明确方法。
zh_tw: 不過，OpenXR 規範近期已有顯著進步，正逐步縮小這些差異。隨著各平台陸續實作這些改進，未來將更容易實現跨平台相容，或至少能明確偵測平台支援的功能。

source: When we look at the early days of VR the focus of the major platforms was on tracked controller based input. Here we are tracking a physical device that also has buttons for further input. From the tracking data we can infer the location of the player's hands but no further information is known, traditionally it was left up to the game to implement a mechanism to display the player's hand and animate the fingers based on further input from the controller, be it due to buttons being pressed or through proximity sensors. Often fingers are also placed based on context, what the user is holding, and what action a user is performing.
de: Wenn wir uns die Anfänge von VR ansehen, lag der Fokus der großen Plattformen auf der Verfolgung von Controller-basierten Eingaben. Hier verfolgen wir ein physisches Gerät, das auch Tasten für weitere Eingaben hat. Aus den Tracking-Daten können wir auf die Position der Hände des Spielers schließen, aber es sind keine weiteren Informationen bekannt. Traditionell wurde es dem Spiel überlassen, einen Mechanismus zu implementieren, um die Hand des Spielers anzuzeigen und die Finger basierend auf weiteren Eingaben vom Controller zu animieren, sei es durch gedrückte Tasten oder durch Näherungssensoren. Oft werden Finger auch kontextabhängig platziert, je nachdem, was der Benutzer hält und welche Aktion er ausführt.
ga: Nuair a fhéachaimid ar laethanta luatha VR bhí fócas na n-ardán móra ar ionchur rianaithe bunaithe ar rialaitheoir. Anseo táimid ag rianú gléas fisiceach a bhfuil cnaipí aige freisin le haghaidh tuilleadh ionchuir. Ó na sonraí rianaithe is féidir linn suíomh lámha an imreora a fháil amach ach níl aon fhaisnéis bhreise ar eolas, go traidisiúnta fágadh suas leis an gcluiche meicníocht a chur i bhfeidhm chun lámh an imreora a thaispeáint agus na méara a bheochan bunaithe ar ionchur breise ón rialtóir, bíodh sé mar gheall ar chnaipí a bhrú nó trí bhraiteoirí cóngarachta. Go minic cuirtear méara freisin bunaithe ar chomhthéacs, cad atá ag an úsáideoir, agus cén gníomh atá á dhéanamh ag úsáideoir.
ru: На заре развития виртуальной реальности основное внимание основных платформ уделялось отслеживанию ввода с помощью контроллера. Здесь мы отслеживаем физическое устройство, также имеющее кнопки для дальнейшего ввода. По данным отслеживания мы можем определить положение рук игрока, но никакой дополнительной информации нет. Традиционно игра реализовывала механизм отображения руки игрока и анимации пальцев в зависимости от дальнейших действий с контроллера, будь то нажатие кнопок или датчики приближения. Часто положение пальцев также определяется контекстом, предметом в руках пользователя и выполняемым им действием.
ta: வி.ஆரின் ஆரம்ப நாட்களைப் பார்க்கும்போது, முக்கிய தளங்களின் கவனம் கண்காணிக்கப்பட்ட கட்டுப்படுத்தி அடிப்படையிலான உள்ளீட்டில் இருந்தது. இங்கே நாம் ஒரு உடல் சாதனத்தை கண்காணிக்கிறோம், இது மேலும் உள்ளீட்டிற்கான பொத்தான்களையும் கொண்டுள்ளது. கண்காணிப்பு தரவுகளிலிருந்து வீரரின் கைகளின் இருப்பிடத்தை நாம் ஊகிக்க முடியும், ஆனால் மேலதிக தகவல்கள் எதுவும் தெரியவில்லை, பாரம்பரியமாக வீரரின் கையைக் காண்பிப்பதற்கும், கட்டுப்படுத்தியிலிருந்து மேலும் உள்ளீட்டின் அடிப்படையில் விரல்களை உயிரூட்டுவதற்கும் ஒரு பொறிமுறையை செயல்படுத்த விளையாட்டு வரை விடப்பட்டது, இருக்க வேண்டும் இது பொத்தான்கள் அழுத்தப்படுவதால் அல்லது அருகாமையில் சென்சார்கள் மூலம். சூழலின் அடிப்படையில் பெரும்பாலும் விரல்கள் வைக்கப்படுகின்றன, பயனர் என்ன வைத்திருக்கிறார், ஒரு பயனர் என்ன செயலைச் செய்கிறார்.
uk: Коли ми дивимося на перші дні VR, основні платформи зосереджувалися на введенні даних на основі відстежуваного контролера. Тут ми відстежуємо фізичний пристрій, який також має кнопки для подальшого введення. З даних відстеження ми можемо зробити висновок про розташування рук гравця, але більше інформації невідомо. Традиційно грі залишалося реалізувати механізм для відображення руки гравця та анімації пальців на основі подальшого введення з контролера, бути це через натискання кнопок або через датчики наближення. Часто пальці також розміщуються на основі контексту, того, що тримає користувач і яку дію він виконує.
zh_cn: 早期的大型 VR 平台主要采用的是基于跟踪手柄的输入。这套系统追踪一个物理设备，该设备上还装有一系列按键，用于进一步的输入。从跟踪数据中可以推断出玩家手部位置，但无法进一步获取更多信息。通常情况下，由游戏负责实现一套利用进一步输入来显示玩家的手部并创建手指动画的机制，其中的输入可能来自于按键或接近传感器。大部分时候手指的位置还会参考游戏上下文进行判断，例如用户手持的物品，或者正在进行的动作。
zh_tw: 回顧 VR 初期，各大平台主要著重於追蹤控制器輸入。此時追蹤的是一個實體裝置，並可藉由按鈕等進行額外輸入。雖可藉由追蹤資料推算玩家手部位置，但無法獲得更多細節，通常需由遊戲自行實作手部顯示及手指動畫，根據控制器按鈕或接近感應器等輸入來決定手指動作。手指的動作也常依情境調整，例如玩家手上拿著什麼、目前正在執行什麼動作等。

source: More recently optical hand tracking has become a popular solution, where cameras track the user's hands and full tracking data for the hand and finger positions becomes available. Many vendors saw this as completely separate from controller tracking and introduced independent APIs to access hand and finger positions and orientation data. When handling input, it was up to the game developer to implement a gesture detection mechanism.
de: In jüngerer Zeit ist optisches Handtracking eine beliebte Lösung geworden, bei dem Kameras die Hände des Benutzers verfolgen und vollständige Trackingdaten für die Hand- und Fingerpositionen verfügbar werden. Viele Anbieter betrachteten dies als völlig unabhängig vom Controller-Tracking und führten unabhängige APIs ein, um auf Hand- und Fingerpositionen sowie Orientierungsdaten zuzugreifen. Bei der Verarbeitung von Eingaben war es Sache des Spieleentwicklers, einen Mechanismus zur Gestenerkennung zu implementieren.
ga: Níos déanaí tá rianú láimhe optúil ina réiteach coitianta, áit a rianaíonn ceamaraí lámha an úsáideora agus bíonn sonraí rianaithe iomlána do shuíomhanna láimhe agus méar ar fáil. Chonaic go leor díoltóirí é seo go hiomlán ar leithligh ó rianú rialaitheoirí agus thug siad APIs neamhspleácha isteach chun rochtain a fháil ar shuíomhanna lá Agus ionchur á láimhseáil, bhí sé faoi fhorbróir an chluiche meicníocht braite gotha a chur i bhfeidhm.
ru: В последнее время оптическое отслеживание рук стало популярным решением, при котором камеры отслеживают руки пользователя, и становятся доступны полные данные о положении рук и пальцев. Многие разработчики рассматривали этот подход как нечто совершенно отдельное от отслеживания контроллеров и внедрили независимые API для доступа к данным о положении рук и пальцев, а также об их ориентации. При обработке ввода разработчику игры приходилось реализовывать механизм распознавания жестов.
ta: மிக அண்மைக் காலத்தில் ஆப்டிகல் ஏண்ட் டிராக்கிங் ஒரு பிரபலமான தீர்வாக மாறியுள்ளது, அங்கு கேமராக்கள் பயனரின் கைகளையும், கை மற்றும் விரல் நிலைகளுக்கான முழு கண்காணிப்பு தரவையும் கண்காணிக்கின்றன. பல விற்பனையாளர்கள் இதை கட்டுப்படுத்தி கண்காணிப்பிலிருந்து முற்றிலும் தனித்தனியாகக் கண்டனர் மற்றும் கை மற்றும் விரல் நிலைகள் மற்றும் நோக்குநிலை தரவை அணுக சுயாதீன பநிஇ களை அறிமுகப்படுத்தினர். உள்ளீட்டைக் கையாளும் போது, சைகை கண்டறிதல் பொறிமுறையை செயல்படுத்த விளையாட்டு உருவாக்குபவர் வரை இருந்தது.
uk: Останнім часом оптичне відстеження рук стало популярним рішенням, коли камери відстежують руки користувача та стають доступними повні дані відстеження положення рук і пальців. Багато постачальників вважали це абсолютно відокремленим від відстеження контролера та запровадили незалежні API для доступу до даних про положення рук і пальців і орієнтацію. Під час обробки введення розробник гри мав реалізувати механізм виявлення жестів.
zh_cn: 近来，光学手部跟踪逐渐开始流行，这套系统使用摄像头来追踪用户手部，可以生成完整的手部和手指位置数据。大部分供应商将其视为完全不同于手柄跟踪的一套体系，并发布了独立的 API 来访问手部和手指的位置与旋转数据。在处理输入时，由游戏开发人员负责实现手势检测系统。
zh_tw: 近年來，光學手部追蹤成為主流解決方案，利用攝影機偵測使用者雙手，取得完整的手部與手指位置資料。許多廠商視此與控制器追蹤完全獨立，並提供專用 API 以讀取手部與手指的位置及朝向。至於輸入辨識，則通常由遊戲開發者自行實作手勢偵測機制。

source: This split also exists in OpenXR, where controller tracking is handled primarily by the action map system, while optical hand tracking is primarily handled by the hand tracking API extension.
de: Diese Trennung besteht auch in OpenXR, wo das Controller-Tracking hauptsächlich vom Action-Map-System übernommen wird, während das optische Hand-Tracking hauptsächlich von der Hand-Tracking-API-Erweiterung übernommen wird.
ga: Tá an scoilt seo ann freisin in OpenXR, áit a láimhseálann an córas léarscáil gníomhaíochta go príomha rianú rialtóra, agus is é an síneadh API rianaithe láimhe go príomha a dhéileálann le rianú láimhe optúil.
ru: Такое разделение существует и в OpenXR, где отслеживание контроллера в основном осуществляется системой карты действий, тогда как оптическое отслеживание руки в основном осуществляется расширением API отслеживания руки.
ta: இந்த பிளவு ஓபன்எக்ச்ஆரிலும் உள்ளது, அங்கு கட்டுப்பாட்டு கண்காணிப்பு முதன்மையாக செயல் வரைபட அமைப்பால் கையாளப்படுகிறது, அதே நேரத்தில் ஆப்டிகல் ஏண்ட் கண்காணிப்பு முதன்மையாக கை கண்காணிப்பு பநிஇ நீட்டிப்பால் கையாளப்படுகிறது.
uk: Цей поділ також існує в OpenXR, де відстеження контролера в основному обробляється системою карт дій, тоді як оптичне відстеження рук в основному обробляється розширенням API відстеження рук.
zh_cn: 这种两边分割的情况同样存在于 OpenXR 中，其中手柄跟踪主要由动作映射系统处理，而光学手部跟踪则主要由手部跟踪 API 扩展处理。
zh_tw: 這種區分在 OpenXR 中也存在：控制器追蹤主要透過動作對應（Action Map）系統處理，而光學手部追蹤則主要透過手部追蹤 API 擴充來實現。

source: However, the world is not that black and white and we're seeing a number of scenarios where we cross the line:
de: Allerdings ist die Welt nicht ganz so schwarz und weiß und wir erleben eine Reihe von Szenarien, in denen wir Grenzen überschreiten:
ga: Mar sin féin, níl an domhan sin dubh agus bán agus táimid ag feiceáil roinnt cásanna ina dtrasnaímid an líne:
ru: Однако мир не такой уж черно-белый, и мы видим ряд сценариев, в которых мы пересекаем черту:
ta: இருப்பினும், உலகம் அவ்வளவு கருப்பு மற்றும் வெள்ளை அல்ல, நாங்கள் பல காட்சிகளைக் காண்கிறோம், அங்கு நாங்கள் வரியைக் கடக்கிறோம்:
uk: Однак світ не такий чорно-білий, і ми бачимо низку сценаріїв, коли ми переходимо межу:
zh_cn: 然而，这世界并非非黑即白，有这么几种情况难以简单地归类：
zh_tw: 然而，實務上情況並非如此二分化，實際上有許多情境會跨越這條界線：

source: Devices that fit in both categories, such as tracked gloves and controllers such as the Index controller that also perform finger tracking.
de: Geräte, die in beide Kategorien passen, wie getrackte Handschuhe und Controller wie der Index-Controller, die auch Finger-Tracking durchführen.
ga: Gléasanna a oireann sa dá chatagóir, mar shampla lámhainní rianaithe agus rialaitheoirí mar an rialtóir Innéacs a dhéanann rianú méar freisin.
ru: Устройства, подпадающие под обе категории, такие как отслеживаемые перчатки и контроллеры, такие как контроллер Index, которые также отслеживают движения пальцев.
ta: இரண்டு வகைகளிலும் பொருந்தக்கூடிய சாதனங்கள், கண்காணிக்கப்பட்ட கையுறைகள் மற்றும் குறியீட்டு கட்டுப்பாட்டாளர் போன்ற கட்டுப்படுத்திகள் போன்றவை விரல் கண்காணிப்பையும் செய்கின்றன.
uk: Пристрої, які підходять до обох категорій, як-от гусеничні рукавички та контролери, як-от контролер Index, які також виконують відстеження пальців.
zh_cn: 同时符合两种类别的设备，例如带跟踪的手套或手柄，例如同时拥有手指追踪功能的 Index controller。
zh_tw: 有些裝置同時屬於兩者，例如具備手指追蹤功能的手套或像 Index 控制器這類可追蹤手指的控制器。

source: XR Runtimes that implement inferred hand tracking from controller data as a means to solve proper finger placement for multiple controllers.
de: XR-Laufzeitumgebungen, die abgeleitetes Hand-Tracking aus Controllerdaten implementieren, um die richtige Fingerplatzierung für mehrere Controller zu ermitteln.
ga: XR Runtimes a chuireann rianú láimhe tátal ó shonraí rialtóra i bhfeidhm mar mhodh chun socrú ceart méar a réiteach do il-rialtóirí.
ru: Среды выполнения XR, реализующие отслеживание положения рук на основе данных контроллера в качестве средства для определения правильного расположения пальцев для нескольких контроллеров.
ta: பல கட்டுப்பாட்டாளர்களுக்கான சரியான விரல் வேலைவாய்ப்பைத் தீர்ப்பதற்கான வழிமுறையாக கட்டுப்படுத்தி தரவிலிருந்து ஊகிக்கப்பட்ட கை கண்காணிப்பை செயல்படுத்தும் எக்ச்ஆர் ரன் டைம்கள்.
uk: XR Runtimes, які реалізують відстеження руки на основі даних контролера як засіб вирішення правильного розташування пальців для кількох контролерів.
zh_cn: 通过实现用手柄数据进行推断手部追踪来解决多个手柄的手指放置问题的 XR 运行时。
zh_tw: 某些 XR 執行環境會根據控制器數據推算手部位置，以解決多控制器下的手指擺放問題。

source: XR applications that wish to seamlessly switch between controller and hand tracking offering the same user experience regardless of approach used.
de: XR-Anwendungen, die nahtlos zwischen Controller- und Hand-Tracking wechseln möchten und unabhängig vom verwendeten Ansatz dasselbe Benutzererlebnis bieten möchten.
ga: Feidhmchláir XR ar mian leo aistriú gan uaim idir rialtóir agus rianú láimhe a thairgeann an taithí úsáideora céanna beag beann ar an gcur chuige a úsáidtear.
ru: Приложения XR, которые хотят плавно переключаться между отслеживанием контроллера и рук, обеспечивая одинаковый пользовательский опыт независимо от используемого подхода.
ta: பயன்படுத்தப்பட்ட அணுகுமுறையைப் பொருட்படுத்தாமல் அதே பயனர் அனுபவத்தை வழங்கும் கட்டுப்படுத்தி மற்றும் கை கண்காணிப்புக்கு இடையில் தடையின்றி மாற விரும்பும் எக்ச்ஆர் பயன்பாடுகள்.
uk: Програми XR, які бажають плавно перемикатися між контролером і відстеженням рук, забезпечуючи однакову взаємодію з користувачем незалежно від використовуваного підходу.
zh_cn: 意图在手柄和手部追踪之间流畅切换，对两种方法提供相同的用户体验的 XR 应用软件。
zh_tw: 一些 XR 應用則希望能無縫切換控制器與手部追蹤，讓使用者不論採用哪種方式都能有一致體驗。

source: OpenXR is answering this call by introducing further extensions that lets us query the capabilities of the XR runtime/hardware or that add further functionality across this divide. The problem that currently does remain is that there are gaps in adopting these extensions, with some platforms thus not reporting capabilities to their full extent. As such you may need to test for the features available on specific hardware and adjust your approach accordingly.
de: OpenXR reagiert auf diesen Aufruf, indem es weitere Erweiterungen einführt, mit denen wir die Fähigkeiten der XR-Laufzeit/Hardware abfragen oder über diese Kluft hinweg weitere Funktionen hinzufügen können. Das derzeit noch bestehende Problem besteht darin, dass es Lücken bei der Übernahme dieser Erweiterungen gibt, da einige Plattformen die Fähigkeiten daher nicht in vollem Umfang melden. Daher müssen Sie möglicherweise die auf bestimmter Hardware verfügbaren Funktionen testen und Ihren Ansatz entsprechend anpassen.
ga: Tá OpenXR ag freagairt an ghlao seo trí bhreisithe breise a thabhairt isteach a ligeann dúinn ceisteanna a chur faoi chumais an ama rite/crua-earraí XR nó a chuireann feidhmiúlacht bhreise trasna na deighilte seo. Is í an fhadhb atá ann faoi láthair ná go bhfuil bearnaí maidir leis na síntí sin a ghlacadh, agus mar sin níl roinnt ardán ag tuairisciú cumais go hiomlán. Mar sin b’fhéidir go mbeidh ort na gnéithe atá ar fáil ar chrua-earraí sonracha a thástáil agus do chur chuige a choigeartú dá réir.
ru: OpenXR отвечает на этот вызов, предлагая дополнительные расширения, позволяющие нам запрашивать возможности среды выполнения /аппаратного обеспечения XR или расширять функциональность, преодолевая этот разрыв. Проблема, которая в настоящее время сохраняется, заключается в том, что существуют пробелы в применении этих расширений, и некоторые платформы не предоставляют информацию о возможностях в полном объёме. В связи с этим может потребоваться тестирование функций, доступных на конкретном оборудовании, и соответствующая корректировка вашего подхода.
ta: எக்ச்ஆர் இயக்க நேரம்/வன்பொருளின் திறன்களை வினவ அனுமதிக்கும் அல்லது இந்த பிளவு முழுவதும் மேலும் செயல்பாட்டைச் சேர்க்கும் மேலதிக நீட்டிப்புகளை அறிமுகப்படுத்துவதன் மூலம் OpenXR இந்த அழைப்புக்கு பதிலளிக்கிறது. தற்போது எஞ்சியிருக்கும் சிக்கல் என்னவென்றால், இந்த நீட்டிப்புகளை ஏற்றுக்கொள்வதில் இடைவெளிகள் உள்ளன, சில தளங்கள் அவற்றின் முழு அளவிற்கும் திறன்களைப் புகாரளிக்கவில்லை. எனவே குறிப்பிட்ட வன்பொருளில் கிடைக்கும் அம்சங்களை நீங்கள் சோதித்து அதற்கேற்ப உங்கள் அணுகுமுறையை சரிசெய்ய வேண்டும்.
uk: OpenXR відповідає на цей заклик, запроваджуючи додаткові розширення, які дозволяють нам запитувати можливості середовища виконання/апаратного забезпечення XR або додають додаткові функції через цей розрив. Проблема, яка зараз залишається, полягає в тому, що існують прогалини в застосуванні цих розширень, тому деякі платформи не повідомляють про можливості в повному обсязі. Тому вам може знадобитися перевірити функції, доступні на певному апаратному забезпеченні, і відповідно скорегувати свій підхід.
zh_tw: OpenXR 也正透過新增各種擴充功能來回應這些需求，讓我們能查詢 XR 執行環境／硬體的功能支援，或跨越傳統分野提供更多功能。不過，這些擴充尚未被所有平台廣泛支援，因此部分平台可能無法完整回報功能能力。開發時必須針對不同硬體測試實際支援狀態，並調整對應策略。

source: Demo project
de: Demo-Projekt
fr: Projet de démo
ga: Tionscadal Temo
it: Progetto di dimostrazione
ru: Демонcтрационный проект
ta: டெமோ திட்டம்
uk: Демо проект
zh_cn: 示例项目
zh_tw: 展示專案
