Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/openxr_render_models.po
Languages: it, ru, ta, uk, zh_tw

source: Returns the transform for this animatable node. This is a local transform that can be directly applied.
it: Restituisce la trasformazione per questo nodo animabile. Questa è una trasformazione locale che si può applicare direttamente.
ru: Возвращает преобразование для данного анимируемого узла. Это локальное преобразование, которое можно применить напрямую.
ta: இந்த அனிமேட்டபிள் முனைக்கான உருமாற்றத்தை வழங்குகிறது. இது ஒரு உள்ளக உருமாற்றம், இது நேரடியாகப் பயன்படுத்தப்படலாம்.
uk: Повертає перетворення для цього анімованого вузла. Це локальне перетворення, яке можна застосувати безпосередньо.
zh_tw: 回傳此可動畫節點的轉換。這是可直接套用的區域轉換。
