Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_action_map.po
Languages: fr, ga, it, ru, ta, uk, zh_cn, zh_hant

source: The OpenXR implementation in Godot also exposes a special pose called ``Skeleton``. This is part of the hand tracking implementation. This pose is exposed through the ``skeleton`` action that is supported outside of the action map system. It is thus always present if hand tracking is supported. You don't need to bind actions to this pose to use it.
ga: Nochtann cur i bhfeidhm OpenXR i Godot údar speisialta ar a dtugtar ''Cnámharlach''. Tá sé seo mar chuid den chur i bhfeidhm rianú láimhe. Nochtar an chúis seo tríd an ngníomh ''cnámharlach'' a dtacaítear leis lasmuigh de chóras na mapaí gníomhaíochta. Dá bhrí sin, tá sé i láthair i gcónaí má thacaítear le rianú láimhe. Ní gá duit gníomhartha a cheangal leis an údar seo chun é a úsáid.
ru: Реализация OpenXR в Godot также предоставляет специальную позу, называемую ``Skeleton``. Она является частью реализации отслеживания рук. Эта поза доступна через действие ``Skeleton``, которое поддерживается вне системы карт действий. Таким образом, она всегда присутствует, если поддерживается отслеживание рук. Для её использования не требуется привязывать действия к этой позе.
ta: கோடோட்டில் ஓபன்எக்ச்ஆர் செயல்படுத்தல் `` எலும்புக்கூடு`` என்ற சிறப்பு போசை அம்பலப்படுத்துகிறது. இது கை கண்காணிப்பு செயல்படுத்தலின் ஒரு பகுதியாகும். அதிரடி வரைபட அமைப்புக்கு வெளியே ஆதரிக்கப்படும் `` எலும்புக்கூடு` அதிரடி மூலம் இந்த போச் அம்பலப்படுத்தப்படுகிறது. கை கண்காணிப்பு ஆதரிக்கப்பட்டால் அது எப்போதும் இருக்கும். இந்த போசுடன் இதைப் பயன்படுத்த நீங்கள் செயல்களை பிணைக்க தேவையில்லை.
uk: Реалізація OpenXR у Godot також відкриває спеціальну позу під назвою ``Skeleton``. Це частина реалізації відстеження руки. Ця поза відображається через дію ``скелет``, яка підтримується за межами системи карти дій. Таким чином, він завжди присутній, якщо підтримується відстеження руки. Вам не потрібно прив’язувати дії до цієї пози, щоб використовувати її.
zh_hant: Godot 的 OpenXR 實作也提供名為 ``Skeleton`` 的特殊姿勢，用於手部追蹤。這個姿勢會由動作對應系統之外的 ``skeleton`` 動作自動提供，只要支援手部追蹤就會存在，無需另外綁定動作即可使用。

source: Finally, the only output type is ``Haptic`` and it allows us to set the intensity of haptic feedback, such as controller vibration. Controllers can have multiple haptic outputs and support for haptic vests is coming to OpenXR.
ga: Ar deireadh, is é ''Haptic'' an t-aon chineál aschuir agus ligeann sé dúinn déine an aiseolais haptic a shocrú, amhail creathadh rialaitheora. Is féidir le rialaitheoirí aschur haptic il a bheith acu agus tá tacaíocht do veisteanna haptic ag teacht chuig OpenXR.
ru: Наконец, единственный тип выхода — ``Haptic``, позволяющий настроить интенсивность тактильной обратной связи, например, вибрации контроллера. Контроллеры могут иметь несколько тактильных выходов, а поддержка тактильных жилетов появится в OpenXR.
ta: இறுதியாக, ஒரே வெளியீட்டு வகை `` ஆப்டிக்`` மற்றும் இது கட்டுப்படுத்தி அதிர்வு போன்ற ஆப்டிக் பின்னூட்டங்களின் தீவிரத்தை அமைக்க அனுமதிக்கிறது. கட்டுப்படுத்திகள் பல ஆப்டிக் வெளியீடுகளைக் கொண்டிருக்கலாம் மற்றும் ஆப்டிக் உள்ளாடைகளுக்கான உதவி ஓபன்எக்ச்ஆருக்கு வருகிறது.
uk: Нарешті, єдиним типом виведення є ``Haptic``, і він дозволяє нам встановити інтенсивність тактильного зворотного зв’язку, наприклад вібрації контролера. Контролери можуть мати кілька тактильних виходів, а підтримка тактильних жилетів з’являється в OpenXR.
zh_hant: 最後，唯一的輸出型別是 ``Haptic``，可設定觸覺回饋強度（如控制器震動）。控制器可有多組觸覺輸出，OpenXR 也即將支援觸覺背心等裝置。

source: So lets add an action for our aim pose, we do this by clicking on the ``+`` button for our action set:
ga: Mar sin, is féidir linn gníomh a chur leis an aidhm atá againn, déanaimid é seo trí chliceáil ar an gcnaipe ''+'' dár tacar gníomhaíochta:
ru: Итак, давайте добавим действие для нашей позы прицеливания. Для этого мы нажимаем кнопку ``+`` для нашего набора действий:
ta: எனவே எங்கள் நோக்கம் போசுக்கு ஒரு செயலைச் சேர்க்கலாம், எங்கள் செயல் தொகுப்பிற்கான ``+`` பொத்தானைக் சொடுக்கு செய்வதன் மூலம் இதைச் செய்கிறோம்:
uk: Отже, давайте додамо дію для нашої прицільної пози, ми робимо це, натиснувши кнопку ``+`` для нашого набору дій:
zh_hant: 現在我們來為瞄準姿勢新增動作。請在動作集下方點選「+」按鈕：

source: This is the internal name of the action. OpenXR doesn't specify specific restrictions on this name other then size, however some XR runtimes will not like spaces or special characters.
fr: C'est le nom interne de l'action. OpenXR ne spécifie pas de restrictions spécifiques sur ce nom autre que la taille, cependant certains environnements d'exécution XR n'aimeront pas les espaces ou les caractères spéciaux.
ga: Is é seo ainm inmheánach an ghnímh. Ní shonraíonn OpenXR srianta sonracha ar an ainm seo méid eile ansin, ach ní thaitneoidh spásanna ná carachtair speisialta le roinnt runtimes XR.
ru: Это внутреннее имя действия. OpenXR не устанавливает конкретных ограничений на это имя, кроме размера, однако некоторые среды выполнения XR не поддерживают пробелы или специальные символы.
ta: இது செயலின் உள் பெயர். OpenXR இந்த பெயரில் குறிப்பிட்ட கட்டுப்பாடுகளை குறிப்பிடவில்லை, இருப்பினும் சில எக்ச்ஆர் ரன் டைம்கள் இடைவெளிகள் அல்லது சிறப்பு எழுத்துக்களை விரும்பாது.
uk: Це внутрішня назва дії. OpenXR не визначає конкретних обмежень для цього імені, окрім розміру, однак деякі середовища виконання XR не люблять пробіли чи спеціальні символи.
zh_cn: 这是该动作的内部名称。除大小外 OpenXR 不明确指定对该名称的任何限制，但某些 XR 运行时会排斥空格或特殊字符。
zh_hant: 這是動作的內部名稱，OpenXR 僅限制長度，部分 XR 執行環境不接受空白或特殊符號。

source: Aim pose
fr: Pose de visée
ga: Aidhm
ru: Aim pose (Поза цели)
ta: நோக்கம் போச்
uk: Прицільна поза
zh_cn: 瞄准姿势
zh_hant: 瞄準姿勢

source: This is a human-readable name for the action. Some XR runtimes will display this name to the end user, for example in configuration dialogs.
ga: Is ainm é seo atá inléite ag an duine don ghníomh. Taispeánfaidh roinnt am rite XR an t-ainm seo don úsáideoir deiridh, mar shampla i dialóga cumraíochta.
ru: Это понятное человеку имя действия. Некоторые среды выполнения XR отображают это имя конечному пользователю, например, в диалоговых окнах настройки.
ta: இது செயலுக்கு மனிதனால் படிக்கக்கூடிய பெயர். சில எக்ச்ஆர் ரன் டைம்கள் இந்த பெயரை இறுதி பயனருக்குக் காண்பிக்கும், எடுத்துக்காட்டாக உள்ளமைவு உரையாடல்களில்.
uk: Це зрозуміла назва дії. Деякі середовища виконання XR відображатимуть це ім’я для кінцевого користувача, наприклад, у діалогових вікнах налаштування.
zh_cn: 这是该动作的人类可读名称。某些 XR 运行时会将该名称显示给终端用户，例如在配置窗口中。
zh_hant: 這是動作的顯示名稱，部分 XR 執行環境會於設定等介面顯示給使用者。

source: Pose
ga: Údar
it: Posa
ru: Pose (поза)
ta: போச்
uk: Поза
zh_cn: 姿势
zh_hant: 姿勢

source: The type of this action.
fr: Le type de cette action.
ga: Cineál an ghnímh seo.
it: Il tipo di questa azione.
ru: Тип этого действия.
ta: இந்த செயலின் வகை.
uk: Тип цієї дії.
zh_cn: 主题类型变种。
zh_hant: 此動作的型別。

source: OpenXR defines a number of bindable input poses that are commonly available for controllers. There are no rules for which poses are supported for different controllers. The poses OpenXR currently defines are:
ga: Sainmhíníonn OpenXR roinnt cúiseanna ionchuir incheangailte atá ar fáil go coitianta do rialaitheoirí. Níl aon rialacha ann a dtacaítear leo do rialaitheoirí éagsúla. Is iad seo a leanas na cúiseanna a shainíonn OpenXR faoi láthair:
ru: OpenXR определяет ряд связываемых поз ввода, которые обычно доступны для контроллеров. Нет правил, определяющих, какие позы поддерживаются различными контроллерами. В настоящее время OpenXR определяет следующие позы:
ta: கட்டுப்பாட்டாளர்களுக்கு பொதுவாகக் கிடைக்கும் பல பிணைப்பு உள்ளீடு போச்களை OpenXR வரையறுக்கிறது. வெவ்வேறு கட்டுப்படுத்திகளுக்கு போச் ஆதரிக்கப்படும் விதிகள் எதுவும் இல்லை. OpenXR தற்போது வரையறுக்கும் போச்:
uk: OpenXR визначає низку прив’язаних поз введення, які зазвичай доступні для контролерів. Немає правил, які пози підтримуються для різних контролерів. OpenXR наразі визначає такі пози:
zh_cn: OpenXR 定义了许多控制器常用的可绑定输入姿态。对于不同的控制器支持哪些姿势，没有规则。OpenXR 目前定义的姿势有:
zh_hant: OpenXR 規範多種可綁定的輸入姿勢，實際支援的姿勢因控制器而異，目前 OpenXR 定義的有：

source: The aim pose on most controllers is positioned slightly in front of the controller and aims forward. This is a great pose to use for laser pointers or to align the muzzle of a weapon with.
ga: Tá an aidhm ar an chuid is mó rialaitheoirí suite beagán os comhair an rialaitheora agus aidhmeanna ar aghaidh. Is údar iontach é seo a úsáid le haghaidh pointers léasair nó a ailíniú leis an muzzle arm le.
ru: На большинстве контроллеров прицельная поза расположена немного впереди контроллера и направлена вперёд. Это положение отлично подходит для лазерных указок или для выравнивания дула оружия.
ta: பெரும்பாலான கட்டுப்படுத்திகள் மீதான நோக்கம் போச் கட்டுப்படுத்தியின் முன் சற்று நிலைநிறுத்தப்பட்டு முன்னோக்கி நோக்கமாக உள்ளது. லேசர் சுட்டிகள் பயன்படுத்த அல்லது ஒரு ஆயுதத்தின் முகவரியை சீரமைக்க இது ஒரு சிறந்த போச் ஆகும்.
uk: Поза прицілювання на більшості контролерів розташована трохи попереду контролера та спрямована вперед. Це чудова поза для лазерних указок або для вирівнювання дула зброї.
zh_hant: 大多數控制器的 aim 姿勢會對應到控制器前方微距位置，並朝向正前方。這很適合用於雷射指標或武器槍口等對準應用。

source: The grip pose on most controllers is positioned where the grip button is placed on the controller. The orientation of this pose differs between controllers and can differ for the same controller on different XR runtimes.
ga: Tá an greim ar fhormhór na rialaitheoirí suite san áit a gcuirtear an cnaipe greama ar an rialaitheoir. Tá treoshuíomh na cúise seo difriúil idir rialaitheoirí agus is féidir leis a bheith difriúil don rialaitheoir céanna ar runtimes XR éagsúla.
ru: На большинстве контроллеров поза захвата расположена там, где расположена кнопка захвата. Ориентация этой позы различается в зависимости от контроллера и может различаться для одного и того же контроллера в разных средах выполнения XR.
ta: கட்டுப்படுத்தி மீது பிடியில் பொத்தானை வைக்கப்படும் இடத்தில் பெரும்பாலான கட்டுப்படுத்திகளில் பிடியில் போச் நிலைநிறுத்தப்பட்டுள்ளது. இந்த போசின் நோக்குநிலை கட்டுப்படுத்திகளுக்கு இடையில் வேறுபடுகிறது மற்றும் வெவ்வேறு எக்ச்ஆர் ரன் டைம்களில் ஒரே கட்டுப்படுத்திக்கு வேறுபடலாம்.
uk: Поза рукоятки на більшості контролерів розташована там, де розташована кнопка ручки на контролері. Орієнтація цієї пози відрізняється між контролерами та може відрізнятися для того самого контролера в різних середовищах виконання XR.
zh_hant: 大多數控制器的 grip 姿勢對應控制器握把按鈕處。不同控制器、甚至同型號於不同 XR 執行環境下方向可能會不同。

source: The palm pose on most controllers is positioned in the center of the palm of the hand holding the controller. This is a new pose that is not available on all XR runtimes.
ga: Is é an údar pailme ar an chuid is mó rialaitheoirí suite i lár an pailme na láimhe a bhfuil an rialtóir. Is údar nua é seo nach bhfuil ar fáil ar gach am rite XR.
ru: На большинстве контроллеров ладонь располагается по центру ладони руки, держащей контроллер. Это новая поза, доступная не во всех средах выполнения XR.
ta: பெரும்பாலான கட்டுப்படுத்திகள் மீது பனை போச் கட்டுப்படுத்தி வைத்திருக்கும் கையின் உள்ளங்கையின் மையத்தில் நிலைநிறுத்தப்பட்டுள்ளது. இது அனைத்து எக்ச்ஆர் ரன் டைம்களிலும் கிடைக்காத புதிய போச் ஆகும்.
uk: Поза долоні на більшості контролерів розташована в центрі долоні, яка тримає контролер. Це нова поза, яка доступна не в усіх середовищах виконання XR.
zh_hant: 大多數控制器的 palm 姿勢對應手掌心握住控制器的位置。此為較新姿勢，並非所有 XR 執行環境皆支援。

source: If hand tracking is used, there are currently big differences in implementations between the different XR runtimes. As a result the action map is currently not suitable for hand tracking. Work is being done on this so stay tuned.
ga: Má úsáidtear rianú láimhe, tá difríochtaí móra ann faoi láthair maidir le cur i bhfeidhm idir na runtimes XR éagsúla. Mar thoradh air sin, níl an léarscáil gníomhaíochta oiriúnach faoi láthair le haghaidh rianú láimhe. Tá obair á déanamh air seo agus mar sin bígí tiúnta.
ru: Если используется отслеживание рук, в настоящее время существуют значительные различия в реализациях между различными средами выполнения XR. В результате карта действий пока не подходит для отслеживания рук. Работа над этим ведётся, поэтому следите за новостями.
ta: கை கண்காணிப்பு பயன்படுத்தப்பட்டால், வெவ்வேறு எக்ச்ஆர் ரன் டைம்களுக்கு இடையில் செயல்படுத்துவதில் தற்போது பெரிய வேறுபாடுகள் உள்ளன. இதன் விளைவாக செயல் வரைபடம் தற்போது கை கண்காணிப்புக்கு ஏற்றதாக இல்லை. இதில் வேலை செய்யப்படுகிறது, எனவே காத்திருங்கள்.
uk: Якщо використовується відстеження рук, наразі існують великі відмінності в реалізації між різними середовищами виконання XR. У результаті карта дій наразі не підходить для відстеження рук. Над цим ведеться робота, тому слідкуйте за оновленнями.
zh_cn: 如果使用手部跟踪，目前不同 XR 运行时之间的实现存在很大差异。因此，动作图目前不适合手部跟踪。这方面的工作正在进行中，敬请关注。
zh_hant: 如需手部追蹤，目前各家 XR 執行環境實作差異極大，因此動作對應暫不適合用於手部追蹤。相關改進正在推進中，請持續關注。

source: Let's complete our list of actions for a very simple shooting game/application:
ga: A ligean ar i gcrích ár liosta de na gníomhartha le haghaidh cluiche lámhach an-simplí / iarratas:
it: Completiamo il nostro elenco di azioni per un gioco/applicazione di tiro molto semplice:
ru: Давайте завершим наш список действий для очень простой игры/приложения-стрелялки:
ta: மிகவும் எளிமையான படப்பிடிப்பு விளையாட்டு/பயன்பாட்டிற்கான எங்கள் செயல்களின் பட்டியலை முடிப்போம்:
uk: Давайте завершимо наш список дій для дуже простої гри/програми-стрілялки:
zh_cn: 让我们完成一个非常简单的射击游戏/应用程序的动作列表:
zh_hant: 以下列舉一個簡單射擊遊戲/應用程式的動作清單：

source: The actions we have added are:
ga: Is iad seo a leanas na gníomhartha atá curtha isteach againn:
it: Le azioni che abbiamo aggiunto sono:
ru: Действия, которые мы добавили:
ta: நாங்கள் சேர்த்த செயல்கள்:
uk: Дії, які ми додали:
zh_cn: 我们添加的操作有:
zh_hant: 我們新增的動作有：

source: movement, which allows the user to move around outside of normal room scale tracking.
ga: gluaiseacht, a ligeann don úsáideoir bogadh timpeall lasmuigh de ghnáth-rianú scála an tseomra.
it: movement, che consente all'utente di muoversi fuori dal normale tracciamento delle dimensioni della stanza.
ru: движение, которое позволяет пользователю перемещаться за пределами обычного отслеживания масштаба помещения.
ta: இயக்கம், இது பயனரை சாதாரண அறை அளவிலான கண்காணிப்புக்கு வெளியே செல்ல அனுமதிக்கிறது.
uk: рух, що дозволяє користувачеві пересуватися за межами звичайного відстеження масштабу кімнати.
zh_hant: movement：讓玩家能在房間規模追蹤以外移動。

source: grab, which detects that the user wants to hold something.
ga: grab, a bhraitheann go bhfuil an t-úsáideoir ag iarraidh rud éigin a shealbhú.
it: grab, che rileva quando l'utente vuole impugnare qualcosa.
ru: grab (захват), который определяет, что пользователь хочет что-то удержать.
ta: கிராப், பயனர் எதையாவது வைத்திருக்க விரும்புகிறார் என்பதைக் கண்டறியும்.
uk: grab, який виявляє, що користувач хоче щось утримати.
zh_cn: 抓取，检测用户想要拿东西。
zh_hant: grab：偵測玩家想抓取物件。

source: shoot, which detects that the user wants to fire the weapon they are holding.
ga: shoot, a bhraitheann go bhfuil an t-úsáideoir ag iarraidh tine an arm a bhfuil siad ag coinneáil.
it: shoot, che rileva che l'utente vuole sparare con l'arma che impugna.
ru: shoot (выстрел), который определяет, что пользователь хочет выстрелить из оружия, которое он держит.
ta: சுடும், இது பயனர் தாங்கள் வைத்திருக்கும் ஆயுதத்தை சுட விரும்புவதைக் கண்டறிகிறது.
uk: стріляти, який визначає, що користувач хоче вистрілити зі зброї, яку він тримає.
zh_cn: 射击，它检测到用户想要发射他们持有的武器。
zh_hant: shoot：偵測玩家想開槍。

source: haptic, which allows us to output haptic feedback.
ga: a ligeann dúinn aiseolas haptic a aschur.
it: haptic, che ci consente di trasmettere un feedback tattile.
ru: haptic (тактильный), который позволяет нам выводить тактильную обратную связь.
ta: ஆப்டிக், இது ஆப்டிக் பின்னூட்டத்தை வெளியிட அனுமதிக்கிறது.
uk: тактильний, що дозволяє виводити тактильний зворотний зв’язок.
zh_cn: 触觉，它允许我们输出触觉反馈。
zh_hant: haptic：輸出觸覺回饋。

source: Now note that we don't distinguish between the left and right hand. This is something that is determined at the next stage. We've implemented the action system in such a way that you can bind the same action to both hands. The appropriate :ref:`XRController3D <class_xrcontroller3d>` node will emit the signal.
ga: Anois tabhair faoi deara nach ndéanaimid idirdhealú idir an lámh chlé agus an lámh dheas. Is rud é seo a chinntear ag an gcéad chéim eile. Táimid tar éis an córas gníomhaíochta a chur i bhfeidhm sa chaoi is gur féidir leat an beart céanna a cheangal ar an dá lámh. Astóidh an nód cuí :ref:`XRConroller3D <class_xrcontroller3d>` an comhartha.
ru: Обратите внимание, что мы не различаем левую и правую руку. Это определяется на следующем этапе. Мы реализовали систему действий таким образом, что можно назначить одно и то же действие обеим рукам. Соответствующий узел :ref:`XRController3D <class_xrcontroller3d>` будет генерировать сигнал.
ta: இப்போது நாம் இடது மற்றும் வலது கைக்கு இடையில் வேறுபடவில்லை என்பதை நினைவில் கொள்க. இது அடுத்த கட்டத்தில் தீர்மானிக்கப்படும் ஒன்று. ஒரே செயலை இரு கைகளுக்கும் பிணைக்கக்கூடிய வகையில் நாங்கள் செயல் முறையை செயல்படுத்தியுள்ளோம். பொருத்தமானது: குறிப்பு: `xrcontroller3d <class_xrcontroller3d>` முனை சமிக்ஞையை வெளியிடும்.
uk: Тепер зауважте, що ми не розрізняємо ліву та праву руку. Це те, що визначається на наступному етапі. Ми реалізували систему дій таким чином, що ви можете прив'язати ту саму дію до обох рук. Відповідний вузол :ref:`XRController3D <class_xrcontroller3d>` видаватиме сигнал.
zh_hant: 請注意，這裡我們尚未區分左右手。實際上，動作系統允許同一動作同時綁定於雙手，之後再決定左右手分工。對應的 :ref:`XRController3D <class_xrcontroller3d>` 節點會自動發出訊號。

source: For both grab and shoot we've used the ``Bool`` type. As mentioned before, OpenXR does automatic conversions from an analogue controls however not all XR Runtimes currently apply sensible thresholds.
ga: Maidir le grab agus shoot araon, bhaineamar úsáid as an gcineál ''Bool''. Mar a luadh cheana, déanann OpenXR comhshónna uathoibríocha ó rialuithe analógacha ach ní chuireann gach Runtimes XR tairseacha ciallmhara i bhfeidhm faoi láthair.
ru: Для захвата и выстрела мы использовали тип ``Bool``. Как упоминалось ранее, OpenXR автоматически преобразует аналоговые элементы управления, однако не все среды выполнения XR в настоящее время применяют разумные пороговые значения.
ta: பிடிக்கவும் சுடவும் இரண்டிற்கும் நாங்கள் `` பூல்` வகையைப் பயன்படுத்தினோம். முன்பு குறிப்பிட்டபடி, ஓபன்எக்ச்ஆர் ஒரு அனலாக் கட்டுப்பாடுகளிலிருந்து தானியங்கி மாற்றங்களைச் செய்கிறது, இருப்பினும் எல்லா எக்ச்ஆர் ரன் டைம்களும் தற்போது விவேகமான வாசல்களைப் பயன்படுத்துவதில்லை.
uk: І для захоплення, і для стрілянини ми використовували тип ``Bool``. Як згадувалося раніше, OpenXR виконує автоматичні перетворення з аналогових елементів керування, однак не всі XR Runtimes наразі застосовують розумні порогові значення.
zh_hant: grab 與 shoot 動作都用 ``Bool`` 型別。雖然 OpenXR 會自動將類比控制轉為 Bool，但不是所有 XR 執行環境都會應用合理的閾值。

source: We recommend as a workaround to use the ``Float`` type when interacting with triggers and grip buttons and apply your own threshold.
ga: Molaimid mar obair an cineál ''Snámhphointe'' a úsáid agus tú ag idirghníomhú le truicir agus cnaipí greama agus do thairseach féin a chur i bhfeidhm.
ru: В качестве обходного пути мы рекомендуем использовать тип ``Float`` при взаимодействии с триггерами и кнопками захвата и применять собственное пороговое значение.
ta: தூண்டுதல்கள் மற்றும் பிடி பொத்தான்களுடன் தொடர்பு கொள்ளும்போது `` மிதவை`` வகையைப் பயன்படுத்தவும், உங்கள் சொந்த வாசலைப் பயன்படுத்தவும் ஒரு பணித்தொகுப்பாக நாங்கள் பரிந்துரைக்கிறோம்.
uk: Ми рекомендуємо як обхідний шлях використовувати тип ``Float`` під час взаємодії з тригерами та кнопками ручки та застосувати власне порогове значення.
zh_hant: 建議如需處理扳機與握把按鈕，請以 ``Float`` 型別並自行設定閾值。

source: For buttons like A/B/X/Y and similar where there is no analogue option, the ``Bool`` type works fine.
fr: Pour les boutons comme A/B/X/Y/etc... où il n'y a pas d'option analogique, le type ``Bool`` fonctionne bien.
ga: I gcás cnaipí cosúil le A / B / X / Y agus a leithéid nuair nach bhfuil aon rogha analógach ann, oibríonn an cineál ''Bool'' go breá.
it: Per pulsanti come A/B/X/Y e simili in cui non è disponibile un'opzione analogica, il tipo ``Bool`` funziona bene.
ru: Для кнопок типа A/B/X/Y и подобных, где нет аналоговой опции, тип ``Bool`` подходит отлично.
ta: A/B/X/Y போன்ற பொத்தான்களுக்கு மற்றும் அனலாக் விருப்பம் இல்லாத இடங்களில், `` பூல்`` வகை நன்றாக வேலை செய்கிறது.
uk: Для таких кнопок, як A/B/X/Y і подібних, де немає аналогової опції, тип ``Bool`` працює добре.
zh_hant: 對於 A/B/X/Y 等純數位按鍵，直接用 ``Bool`` 型別即可。

source: You can bind the same action to multiple inputs for the same controller on the same profile. In this case the XR runtime will attempt to combine the inputs.
fr: Vous pouvez lier la même action à plusieurs entrées pour le même contrôleur sur le même profil. Dans ce cas, l'environnement d'exécution XR tentera de combiner les entrées.
ga: Is féidir leat an gníomh céanna a cheangal le hionchuir iolracha don rialaitheoir céanna ar an bpróifíl chéanna. Sa chás seo déanfaidh an runtime XR iarracht na hionchuir a chur le chéile.
it: È possibile associare la stessa azione a più input per lo stesso controller sullo stesso profilo. In questo caso, il runtime XR tenterà di combinare gli input.
ru: Вы можете привязать одно и то же действие к нескольким входам одного контроллера в одном профиле. В этом случае среда выполнения XR попытается объединить входы.
ta: ஒரே சுயவிவரத்தில் ஒரே கட்டுப்படுத்திக்கான பல உள்ளீடுகளுடன் ஒரே செயலை நீங்கள் பிணைக்கலாம். இந்த வழக்கில் எக்ச்ஆர் இயக்க நேரம் உள்ளீடுகளை இணைக்க முயற்சிக்கும்.
uk: Ви можете прив’язати ту саму дію до кількох входів для того самого контролера в одному профілі. У цьому випадку середовище виконання XR спробує об’єднати вхідні дані.
zh_hant: 同一控制器於同一設定檔，可將多組輸入綁定到同一動作，XR 執行環境會自動合併輸入。

source: For ``Bool`` inputs, this will perform an ``OR`` operation between the buttons.
ga: Maidir le hionchuir ''Bool'', déanfaidh sé seo oibríocht ''OR'' idir na cnaipí.
it: Per gli input ``Bool``, sarà effettuata un'operazione ``OR`` tra i pulsanti.
ru: Для входных данных ``Bool`` это выполнит операцию ``OR (ИЛИ)`` между кнопками.
ta: `` பூல்`` உள்ளீடுகளுக்கு, இது பொத்தான்களுக்கு இடையில் `` அல்லது`` செயல்பாட்டைச் செய்யும்.
uk: Для входів ``Bool`` це виконає операцію ``OR`` між кнопками.
zh_hant: 對於 ``Bool`` 輸入，會以「或（OR）」運算合併。

source: For ``Float`` inputs, this will take the highest value of the bound inputs.
ga: Maidir le hionchuir ''Snámhphointe'', tógfaidh sé seo an luach is airde de na hionchuir cheangailte.
it: Per gli input ``Float``, sarà preso il valore più alto tra gli input vincolati.
ru: Для входных данных ``Float`` будет использоваться наибольшее значение из связанных входных данных.
ta: `` மிதவை` உள்ளீடுகளுக்கு, இது பிணைக்கப்பட்ட உள்ளீடுகளின் மிக உயர்ந்த மதிப்பை எடுக்கும்.
uk: Для вхідних даних ``Float`` буде прийнято найвище значення з прив’язаних вхідних даних.
zh_hant: 對於 ``Float`` 輸入，取所有綁定輸入中的最大值。

source: The behavior for ``Pose`` inputs is undefined, but the first bound input is likely to be used.
ga: Tá an t-iompar le haghaidh ionchuir ''Pose'' gan sainmhíniú, ach is dócha go n-úsáidfear an chéad ionchur faoi cheangal.
it: Il comportamento per gli input ``Pose`` non è definito, ma è probabile che sia utilizzato il primo input associato.
ru: Поведение для входных данных ``Pose`` не определено, но, скорее всего, будет использоваться первый привязанный входной сигнал.
ta: `` போச்` உள்ளீடுகளுக்கான நடத்தை வரையறுக்கப்படவில்லை, ஆனால் முதல் கட்டுப்பட்ட உள்ளீடு பயன்படுத்தப்படலாம்.
uk: Поведінка для входів ``Pose`` не визначена, але, ймовірно, буде використано перший зв’язаний вхід.
zh_hant: ``Pose`` 輸入則未定義，通常僅採用第一個綁定輸入。
