Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_action_map.po
Languages: fr, ga, it, ru, ta, uk, zh_cn, zh_hant

source: This is especially important if you wish to bind the same input on a controller to a different action. For instance:
ga: Tá sé seo thar a bheith tábhachtach más mian leat an t-ionchur céanna ar rialtóir a cheangal le gníomh difriúil. Mar shampla:
it: Questo è particolarmente importante se si desidera associare lo stesso input su un controller a un'azione diversa. Ad esempio:
ru: Это особенно важно, если вы хотите привязать один и тот же входной сигнал контроллера к другому действию. Например:
ta: ஒரே உள்ளீட்டை ஒரு கட்டுப்படுத்தியில் வேறு செயலுக்கு பிணைக்க விரும்பினால் இது மிகவும் முக்கியமானது. உதாரணமாக:
uk: Це особливо важливо, якщо ви бажаєте прив’язати той самий вхід на контролері до іншої дії. наприклад:
zh_hant: 若需要將同一控制器的同一輸入綁定到不同動作時，這特別重要。例如：

source: in your ``Character control`` set you may have an action ``Jump``,
ga: i do thacar ''Rialú carachtar'' b'fhéidir go mbeadh gníomh agat ''Léim'',
it: nell'insieme ``Character control`` si potrebbe avere un'azione ``Jump``,
ru: в вашем наборе ``Character control`` у вас может быть действие ``Jump``,
ta: உங்கள் `` எழுத்து கட்டுப்பாடு`` தொகுப்பில் உங்களுக்கு ஒரு செயல் `` சம்ப்``,
uk: у вашому наборі ``Character control`` ви можете мати дію ``Jump``,
zh_hant: 「角色控制」動作集中可能有「跳躍」動作，

source: in your ``Vehicle control`` set you may have an action ``Accelerate``,
ga: i do thacar ''Rialú feithiclí'', d'fhéadfadh gníomh ''Luathú' a bheith agat,
it: nell'insieme ``Vehicle control`` si potrebbe avere un'azione ``Accelerate``,
ru: в вашем наборе ``Vehicle control`` у вас может быть действие ``Accelerate``,
ta: உங்கள் `` வாகனக் கட்டுப்பாடு` `தொகுப்பில் உங்களுக்கு ஒரு நடவடிக்கை` `முடுக்கவும்``,
uk: у вашому наборі ``Керування транспортним засобом`` ви можете мати дію ``Прискорити``,
zh_hant: 「載具控制」動作集中可能有「加速」動作，

source: in your ``Menu`` set you may have an action ``Select``.
ga: i do thacar ''Menu'' b'fhéidir go bhfuil gníomh ''Roghnaigh'' agat.
it: nell'insieme ``Menu`` si potrebbe avere un'azione ``Select``.
ru: в вашем наборе ``Menu`` может быть действие ``Выбрать``.
ta: உங்கள் `` மெனு`` தொகுப்பில் உங்களுக்கு ஒரு செயல் `` தேர்ந்தெடு`` இருக்கலாம்.
uk: у вашому наборі ``Меню`` ви можете мати дію ``Вибрати``.
zh_hant: 「選單」動作集中可能有「選擇」動作。

source: All are bound to the trigger on your controller.
ga: Tá gach faoi cheangal ag an truicear ar do rialtóir.
it: Sono tutti associati al grilletto del controller.
ru: Все они привязаны к триггеру на вашем контроллере.
ta: அனைத்தும் உங்கள் கட்டுப்படுத்தியின் தூண்டுதலுடன் பிணைக்கப்பட்டுள்ளன.
uk: Усі вони прив’язані до тригера на контролері.
zh_hant: 以上動作都綁定到你控制器的扳機鍵。

source: OpenXR will only bind an input or output to a single action. If the same input or output is bound to multiple actions the one in the active action set with the highest priority will be the one updated/used. So in our above example it will thus be important that only one action set is active.
ga: Ní cheanglóidh OpenXR ach ionchur nó aschur le gníomh amháin. Má tá an t-ionchur nó an t-aschur céanna faoi cheangal ag gníomhartha éagsúla is é an ceann sa ghníomhaíocht ghníomhach a leagtar leis an tosaíocht is airde ná an ceann nuashonraithe / úsáidte. Mar sin, inár sampla thuas beidh sé tábhachtach dá bhrí sin nach bhfuil ach tacar gníomhaíochta amháin gníomhach.
ru: OpenXR привязывает вход или выход только к одному действию. Если один и тот же вход или выход привязан к нескольким действиям, обновляться/использоваться будет тот, который находится в активном наборе действий с наивысшим приоритетом. Поэтому в нашем примере выше важно, чтобы был активен только один набор действий.
ta: OpenXR ஒரு உள்ளீடு அல்லது வெளியீட்டை ஒரு செயலுக்கு மட்டுமே பிணைக்கும். அதே உள்ளீடு அல்லது வெளியீடு பல செயல்களுடன் கட்டுப்பட்டிருந்தால், அதிக முன்னுரிமையுடன் செயலில் உள்ள செயலில் உள்ள ஒன்று புதுப்பிக்கப்பட்ட/பயன்படுத்தப்படும். எனவே எங்கள் மேலே உள்ள எடுத்துக்காட்டில் ஒரு செயல் தொகுப்பு மட்டுமே செயலில் இருப்பது முதன்மை.
uk: OpenXR прив’язуватиме вхід або вихід лише до однієї дії. Якщо один і той самий вхід або вихід пов’язано з декількома діями, оновленою/використаною буде одна з активних дій із найвищим пріоритетом. Таким чином, у нашому прикладі вище буде важливо, щоб лише один набір дій був активним.
zh_hant: OpenXR 一次僅允許將某個輸入或輸出綁定到單一動作。如果多個動作集同時啟用且都有綁定同一輸入/輸出，會以優先權最高的動作集為主。故如上述範例，務必確保僅啟用一組動作集。

source: For your first XR game/application we highly recommend starting with just a single action set and to not over-engineer things.
fr: Pour votre premier jeu/application XR, nous vous recommandons fortement de commencer par un seul ensemble d'action et de ne pas faire de sur-ingénierie.
ga: Maidir le do chéad chluiche / iarratas XR molaimid go mór tosú le sraith gníomhaíochta amháin agus gan rudaí ró-innealtóireachta.
ru: Для вашей первой XR-игры/приложения мы настоятельно рекомендуем начать с одного набора действий и не усложнять все слишком сильно.
ta: உங்கள் முதல் எக்ச்ஆர் விளையாட்டு/பயன்பாட்டிற்காக, ஒரு செயல் தொகுப்பிலிருந்து தொடங்கவும், அதிக பொறியியலாளர் விசயங்களை அல்ல என்றும் நாங்கள் மிகவும் பரிந்துரைக்கிறோம்.
uk: Для вашої першої гри/програми XR ми наполегливо рекомендуємо почати лише з одного набору дій і не надто розробляти речі.
zh_cn: 对于你的第一个 XR 游戏/应用程序，我们强烈建议只从一个动作集开始，不要过度设计。
zh_hant: 建議您的第一個 XR 專案僅設計一組動作集，避免過度設計。

source: For our walkthrough in this document we will thus create a single action set called ``my_first_action_set``. We do this by pressing the :button:`Add action set` button:
ru: Для нашего пошагового руководства в этом документе мы создадим один набор действий с именем ``my_first_action_set``. Для этого мы нажмём кнопку :button:`Add action set`:
uk: Для нашого покрокового керівництва в цьому документі ми створимо один набір дій під назвою ``my_first_action_set``. Ми робимо це, натискаючи кнопку :button:`Add action set`:
zh_hant: 在本文件的示範中，我們將建立一組名為 ``my_first_action_set`` 的動作集。請按下 :button:`Add action set` 按鈕：

source: The columns in our table are as follows:
ga: Is iad seo a leanas na colúin inár dtábla:
it: Le colonne della nostra tabella sono le seguenti:
ru: Столбцы в нашей таблице следующие:
ta: எங்கள் அட்டவணையில் உள்ள நெடுவரிசைகள் பின்வருமாறு:
uk: Стовпці в нашій таблиці такі:
zh_hant: 表格中的欄位意義如下：

source: Col
fr: Colonne
ga: Cabáiste
it: Colonna
ta: கோல்
uk: Кол
zh_hant: 欄位

source: Value
fr: Valeur
ga: Luach
it: Valore
ru: Значение
ta: மதிப்பு
uk: Значення
zh_cn: 值
zh_hant: 值

source: Description
ga: Cur síos
it: Descrizione
ru: Описание
ta: விவரம்
uk: Опис
zh_cn: 描述
zh_hant: 說明

source: This is the internal name of the action set. OpenXR doesn't specify specific restrictions on this name other then size, however some XR runtimes will not like spaces or special characters.
ga: Is é seo ainm inmheánach an tacair gníomhaíochta. Ní shonraíonn OpenXR srianta sonracha ar an ainm seo méid eile ansin, ach ní thaitneoidh spásanna ná carachtair speisialta le roinnt runtimes XR.
ru: Это внутреннее имя набора действий. OpenXR не устанавливает конкретных ограничений на это имя, кроме размера, однако некоторые среды выполнения XR не поддерживают пробелы или специальные символы.
ta: இது செயல் தொகுப்பின் உள் பெயர். OpenXR இந்த பெயரில் குறிப்பிட்ட கட்டுப்பாடுகளை குறிப்பிடவில்லை, இருப்பினும் சில எக்ச்ஆர் ரன் டைம்கள் இடைவெளிகள் அல்லது சிறப்பு எழுத்துக்களை விரும்பாது.
uk: Це внутрішня назва набору дій. OpenXR не визначає конкретних обмежень для цього імені, окрім розміру, однак деякі середовища виконання XR не люблять пробіли чи спеціальні символи.
zh_cn: 这是动作集的内部名称。除了大小之外，OpenXR 没有对这个名称指定具体的限制，但是有些 XR 运行时不喜欢空格或特殊字符。

source: My first action set
fr: Mon premier ensemble d'actions
ga: Mo chéad tacar gníomhaíochta
ru: Мой первый набор действий
ta: எனது முதல் செயல் தொகுப்பு
uk: Мій перший набір дій
zh_cn: 我的第一套动作
zh_hant: 我的第一組動作集

source: This is a human-readable name for the action set. Some XR runtimes will display this name to the end user, for example in configuration dialogs.
ga: Is ainm é seo atá inléite ag an duine don tacar gníomhaíochta. Taispeánfaidh roinnt am rite XR an t-ainm seo don úsáideoir deiridh, mar shampla i dialóga cumraíochta.
it: Questo è un nome leggibile per l'insieme di azioni. Alcuni runtime XR mostreranno questo nome all'utente finale, ad esempio nelle finestre di dialogo di configurazione.
ru: Это понятное человеку имя набора действий. Некоторые среды выполнения XR отображают это имя конечному пользователю, например, в диалоговых окнах настройки.
ta: செயல் தொகுப்பிற்கான மனிதனால் படிக்கக்கூடிய பெயர் இது. சில எக்ச்ஆர் ரன் டைம்கள் இந்த பெயரை இறுதி பயனருக்குக் காண்பிக்கும், எடுத்துக்காட்டாக உள்ளமைவு உரையாடல்களில்.
uk: Це зрозуміла для людини назва набору дій. Деякі середовища виконання XR відображатимуть це ім’я для кінцевого користувача, наприклад, у діалогових вікнах налаштування.
zh_cn: 这是动作集的可读名称。一些 XR 运行时会向最终用户显示这个名称，例如在配置对话框中。
zh_hant: 這是人類可讀的動作集名稱。部分 XR 執行環境會在設定介面等地方顯示此名稱給使用者。

source: This is the priority of the action set. If multiple active action sets have actions bound to the same controller's inputs or outputs, the action set with the highest priority value will determine the action that is updated.
it: Questa è la priorità dell'insieme di azioni. Se più insiemi attivi di azioni hanno azioni associate agli stessi input o output del controller, l'insieme di azioni con il valore più alto di priorità determinerà l'azione che verrà aggiornata.
ru: Это приоритет набора действий. Если несколько активных наборов действий привязаны к одним и тем же входам или выходам контроллера, обновляемое действие будет определяться набором действий с наивысшим приоритетом.
uk: Це пріоритет набору дій. Якщо кілька активних наборів дій мають дії, пов'язані з входами або виходами одного й того ж контролера, набір дій з найвищим значенням пріоритету визначатиме дію, яка оновлюється.
zh_hant: 這是動作集的優先順序。若多個啟用中的動作集將動作綁定到相同控制器的輸入或輸出，則優先值最高的動作集會決定要更新的動作。

source: Actions
ga: Gníomhartha
it: Azioni
ru: Действия
ta: செயல்கள்
uk: Дії
zh_cn: 动作
zh_hant: 動作

source: In the XR action map, actions are the entities that your game/application will interact with. For instance, we can define an action ``Shoot`` and the input bound to that action will trigger the ``button_pressed`` signal on the relevant :ref:`XRController3D <class_xrcontroller3d>` node in your scene with ``Shoot`` as the ``name`` parameter of the signal.
ga: Sa léarscáil gníomhaíochta XR, is iad gníomhartha na heintitis a mbeidh do chluiche/iarratas ag idirghníomhú leo. Mar shampla, is féidir linn gníomh ``Shoot`` a shainiú agus spreagfaidh an t-ionchur atá ceangailte leis an ngníomh sin an comhartha ``cnaipe_brúite`` ar an :ref:`XRConroller3D <class_xrcontroller3d>` nód i do radharc le ``Shoot` `mar pharaiméadar ``ainm`` an chomhartha.
ru: На карте действий XR действия — это сущности, с которыми будет взаимодействовать ваша игра/приложение. Например, мы можем определить действие ``Shoot (Стрельба)``, и входные данные, связанные с этим действием, активируют сигнал ``button_pressed`` в соответствующем узле :ref:`XRController3D <class_xrcontroller3d>` в вашей сцене, используя ``Стрельба`` в качестве параметра ``name`` сигнала.
ta: எக்ச்ஆர் செயல் வரைபடத்தில், உங்கள் விளையாட்டு/பயன்பாடு தொடர்பு கொள்ளும் நிறுவனங்கள் செயல்கள். உதாரணமாக, ஒரு செயலை நாம் வரையறுக்கலாம் `` சூட்`` மற்றும் அந்த செயலுக்கு பிணைக்கப்பட்ட உள்ளீடு தொடர்புடையது: குறிப்பு: `xrcontroller3d <class_xrcontroller3d>` உங்கள் காட்சியில் `` சூட்` உடன் முனை `சிக்னலின்` `பெயர்`` அளவுருவாக.
uk: У карті дій XR дії — це сутності, з якими ваша гра/програма взаємодіятиме. Наприклад, ми можемо визначити дію ``Shoot``, і введення, пов’язане з цією дією, ініціюватиме сигнал ``button_pressed`` у відповідному вузлі :ref:`XRController3D <class_xrcontroller3d>` у вашій сцені з ``Shoot` ` як параметр ``name`` сигналу.
zh_hant: 在 XR 動作對應中，「動作」代表遊戲/應用程式可互動的行為。例如你可定義一個動作 ``Shoot``，當對應輸入啟動時，將觸發場景中 :ref:`XRController3D <class_xrcontroller3d>` 節點的 ``button_pressed`` 訊號，參數 ``name`` 會是 ``Shoot``。

source: You can also poll the current state of an action. :ref:`XRController3D <class_xrcontroller3d>` for instance has an ``is_button_pressed`` method.
ga: Is féidir leat vótaíocht a dhéanamh freisin ar staid reatha na gníomhaíochta. :ref:`XRConroller3D <class_xrcontroller3d>` mar shampla tá modh ``tá_cnaipe_brúite``.
it: È anche possibile interrogare lo stato attuale di un'azione. :ref:`XRController3D <class_xrcontroller3d>` ad esempio ha un metodo ``is_button_pressed``.
ru: Вы также можете опрашивать текущее состояние действия. :ref:`XRController3D <class_xrcontroller3d>` например имеет метод ``is_button_pressed``.
ta: ஒரு செயலின் தற்போதைய நிலையையும் நீங்கள் வாக்களிக்கலாம். .
uk: Ви також можете опитувати поточний стан дії. :ref:`XRController3D <class_xrcontroller3d>`, наприклад, має метод ``is_button_pressed``.
zh_hant: 你也可以主動查詢動作目前狀態，例如 :ref:`XRController3D <class_xrcontroller3d>` 節點中有 ``is_button_pressed`` 方法。

source: Actions can be used for both input and output and each action has a type that defines its behavior.
ga: Is féidir gníomhartha a úsáid le haghaidh ionchur agus aschur araon agus tá cineál ag gach gníomh a shainmhíníonn a iompar.
it: Le azioni possono servire sia per l'input sia per l'output e ogni azione ha un tipo che ne definisce il comportamento.
ru: Действия могут использоваться как для ввода, так и для вывода, и каждое действие имеет тип, который определяет его поведение.
ta: உள்ளீடு மற்றும் வெளியீடு இரண்டிற்கும் செயல்களைப் பயன்படுத்தலாம் மற்றும் ஒவ்வொரு செயலுக்கும் அதன் நடத்தையை வரையறுக்கும் ஒரு வகை உள்ளது.
uk: Дії можна використовувати як для введення, так і для виведення, і кожна дія має тип, який визначає її поведінку.
zh_cn: 动作可以用于输入和输出，每个动作都有一个类型，用于指定其行为。
zh_hant: 動作可對應輸入或輸出，每個動作有其型別，決定其行為。

source: The ``Bool`` type is used for discrete input like buttons.
ga: Úsáidtear an cineál ''Bool'' le haghaidh ionchur scoite cosúil le cnaipí.
it: Il tipo ``Bool`` serve per input discreti come i pulsanti.
ru: Тип ``Bool`` используется для дискретного ввода, например кнопок.
ta: பொத்தான்கள் போன்ற தனித்துவமான உள்ளீட்டிற்கு `` பூல்`` வகை பயன்படுத்தப்படுகிறது.
uk: Тип ``Bool`` використовується для дискретного введення, як кнопки.
zh_cn: ``Bool`` 类型用于离散输入，例如按键。
zh_hant: ``Bool`` 型別用於離散輸入（如按鍵）。

source: The ``Float`` type is used for analogue input like triggers.
ga: Úsáidtear an cineál ''Snámhphointe'' le haghaidh ionchur analógach cosúil le truicir.
it: Il tipo ``Float`` serve per input analogici come le levette.
ru: Тип ``Float`` используется для аналогового входа, например, триггеров.
ta: தூண்டுதல்கள் போன்ற அனலாக் உள்ளீட்டிற்கு `` மிதவை`` வகை பயன்படுத்தப்படுகிறது.
uk: Тип ``Float`` використовується для аналогового введення, як тригери.
zh_cn: ``Float`` 类型用于模拟输入，例如触发器。
zh_hant: ``Float`` 型別用於類比輸入（如扳機）。

source: These two are special as they are the only ones that are interchangeable. OpenXR will handle conversions between ``Bool`` and ``Float`` inputs and actions. You can get the value of a ``Float`` type action by calling the method ``get_float`` on your :ref:`XRController3D <class_xrcontroller3d>` node. It emits the ``input_float_changed`` signal when changed.
ga: Tá an dá rud seo speisialta mar is iad na cinn amháin atá idirmhalartaithe. Láimhseálfaidh OpenXR comhshó idir ionchuir agus gníomhartha ``Bool`` agus `` Snámhphointe``. Is féidir leat luach gnímh den chineál ``Snámhphointe`` a fháil ach an modh ``get_float`` a ghlaoch ar do nód :ref:`XRConroller3D <class_xrcontroller3d>`. Astaíonn sé an comhartha ``ionchur_float_changed`` nuair a athraítear é.
ru: Эти два типа являются особенными, поскольку только они взаимозаменяемы. OpenXR обрабатывает преобразования между входными данными и действиями ``Bool`` и ``Float``. Вы можете получить значение действия типа ``Float``, вызвав метод ``get_float`` в узле :ref:`XRController3D <class_xrcontroller3d>`. При изменении значения он генерирует сигнал ``input_float_changed``.
ta: இவை இரண்டு சிறப்பு என்பதால் அவை ஒன்றோடொன்று மாறக்கூடியவை. Openxr `` பூல்`` மற்றும் `` மிதவை`` உள்ளீடுகள் மற்றும் செயல்களுக்கு இடையிலான மாற்றங்களை கையாளும். `` Get_float`` என்ற முறையை அழைப்பதன் மூலம் `` மிதவை` வகை செயலின் மதிப்பை நீங்கள் பெறலாம்: ref: `xrcontroller3d <class_xrcontroller3d>` முனை. இது மாற்றும்போது `` உள்ளீடு_ஃப்ளோட்_சேங்க்`` சமிக்ஞையை வெளியிடுகிறது.
uk: Ці два є особливими, оскільки вони єдині взаємозамінні. OpenXR оброблятиме перетворення між входами та діями ``Bool`` і ``Float``. Ви можете отримати значення дії типу ``Float``, викликавши метод ``get_float`` на вашому вузлі :ref:`XRController3D <class_xrcontroller3d>`. Під час зміни він видає сигнал ``input_float_changed``.
zh_cn: 这两者的特别之处在于它们是唯一可以互换的动作。OpenXR 会处理 ``Bool`` 和 ``Float`` 输入或动作之间的转换。可以通过调用 :ref:`XRController3D <class_xrcontroller3d>` 节点上的方法 ``get_float`` 来获得一个 ``Float`` 类动作的值。此值更改的时候会发出 ``input_float_changed`` 信号。
zh_hant: 這兩種型別可互換，OpenXR 會自動在 ``Bool`` 與 ``Float`` 之間做轉換。你可透過 :ref:`XRController3D <class_xrcontroller3d>` 節點的 ``get_float`` 取得 ``Float`` 型別動作的數值，且當數值變動時會觸發 ``input_float_changed`` 訊號。

source: Where analogue inputs are queried as buttons a threshold is applied. This threshold is currently managed exclusively by the XR runtime. There are plans to extend Godot to provide some level of control over these thresholds in the future.
ga: Sa chás go ndéantar ionchur analógach a cheistiú mar chnaipí cuirtear tairseach i bhfeidhm. Tá an tairseach seo á bainistiú go heisiach ag am rite XR faoi láthair. Tá pleananna ann Godot a leathnú chun leibhéal éigin smachta a chur ar fáil ar na tairseacha seo amach anseo.
ru: При запросе аналоговых входов в виде кнопок применяется пороговое значение. В настоящее время этим пороговым значением управляет исключительно среда выполнения XR. В будущем планируется расширить Godot, чтобы обеспечить определённый уровень контроля над этими пороговыми значениями.
ta: அனலாக் உள்ளீடுகள் பொத்தான்களாக வினவப்படும் இடத்தில் ஒரு வாசல் பயன்படுத்தப்படுகிறது. இந்த வாசல் தற்போது எக்ச்ஆர் இயக்க நேரத்தால் பிரத்தியேகமாக நிர்வகிக்கப்படுகிறது. எதிர்காலத்தில் இந்த வாசல்களின் மீது ஓரளவு கட்டுப்பாட்டை வழங்க கோடோட்டை நீட்டிக்க திட்டங்கள் உள்ளன.
uk: Якщо аналогові входи запитуються як кнопки, застосовується порогове значення. Наразі цим порогом керує виключно середовище виконання XR. Є плани розширити Godot, щоб забезпечити певний рівень контролю над цими порогами в майбутньому.
zh_cn: 以按键查询模拟输入时会应用一个阈值。该阈值目前由 XR 运行时专门管理。未来有计划对 Godot 进行扩展，为这些阈值提供某种程度上的控制。
zh_hant: 當以按鍵方式查詢類比輸入時，會套用閾值。該閾值目前完全由 XR 執行環境管理，未來 Godot 預計將開放部分調整權限。

source: The ``Vector2`` type defines the input as an axis input. Touchpads, thumbsticks and similar inputs are exposed as vectors. You can get the value of a ``Vector2`` type action by calling the method ``get_vector2`` on your :ref:`XRController3D <class_xrcontroller3d>` node. It emits the ``input_vector2_changed`` signal when changed.
ga: Sainmhíníonn an cineál ``Vector2`` an t-ionchur mar ionchur aise. Nochtar touchpads, batairí ordóg agus ionchuir chomhchosúla mar veicteoirí. Is féidir leat luach gnímh den chineál ``Vector2`` a fháil ach an modh ``get_vector2`` a ghlaoch ar do :ref:`XRConroller3D <class_xrcontroller3d>` nód. Astaíonn sé an comhartha ``input_vector2_changed`` nuair a athraítear é.
ru: Тип ``Vector2`` определяет входные данные как осевые. Сенсорные панели, мини-джойстики и аналогичные устройства ввода представлены как векторы. Вы можете получить значение действия типа ``Vector2``, вызвав метод ``get_vector2`` в узле :ref:`XRController3D <class_xrcontroller3d>`. При изменении значения он генерирует сигнал ``input_vector2_changed``.
ta: `` Vecter2`` வகை உள்ளீட்டை ஒரு அச்சு உள்ளீட்டாக வரையறுக்கிறது. டச்பேட்கள், கட்டைவிரல்கள் மற்றும் ஒத்த உள்ளீடுகள் திசையன்களாக அம்பலப்படுத்தப்படுகின்றன. `` Vector2`` வகை செயலின் மதிப்பை `` get_vector2`` என்ற முறையை அழைப்பதன் மூலம் பெறலாம்: re: `xrcontroller3d <class_xrcontroller3d>` முனை. இது மாற்றப்படும்போது `` input_vector2_changed`` சமிக்ஞையை வெளியிடுகிறது.
uk: Тип ``Vector2`` визначає введення як вхід осі. Сенсорні панелі, джойстики та подібні елементи вводу представлені як вектори. Ви можете отримати значення дії типу ``Vector2``, викликавши метод ``get_vector2`` на вашому вузлі :ref:`XRController3D <class_xrcontroller3d>`. Під час зміни він видає сигнал ``input_vector2_changed``.
zh_cn: ``Vector2`` 类型将输入定义为轴输入。触摸屏，操纵杆等类似输入都以向量形式显示。可以通过在 :ref:`XRController3D <class_xrcontroller3d>` 节点上调用 ``get_vector2`` 方法来获取 ``Vector2`` 类动作的值。当发生更改时，它会发出 ``input_vector2_changed`` 信号。
zh_hant: ``Vector2`` 型別用於軸向輸入。例如觸控板、搖桿等會以向量輸出。你可經由 :ref:`XRController3D <class_xrcontroller3d>` 節點的 ``get_vector2`` 取得值，數值變動時會發送 ``input_vector2_changed`` 訊號。

source: The ``Pose`` type defines a spatially tracked input. Multiple "pose" inputs are available in OpenXR: ``aim``, ``grip`` and ``palm``. Your :ref:`XRController3D <class_xrcontroller3d>` node is automatically positioned based on the pose action assigned to ``pose`` property of this node. More about poses later.
ga: Sainmhíníonn an cineál `` Pose`` ionchur a rianaítear go spásúil. Tá ionchuir "pose" iolracha ar fáil in OpenXR: ``aim``, `` grip`` agus `` pailme``. Tá do nód :ref:`XRController3D <class_xrcontroller3d>` suite go huathoibríoch bunaithe ar an ngníomh staide a shanntar d'airí ``pose`` an nód seo. Tuilleadh faoi staidiúir níos déanaí.
ru: Тип ``Pose`` определяет пространственно отслеживаемый входной сигнал. В OpenXR доступно несколько типов входных сигналов «поза»: ``aim``, ``grip`` и ``palm``. Узел :ref:`XRController3D <class_xrcontroller3d>` автоматически позиционируется на основе действия позы, назначенного свойству ``pose`` этого узла. Подробнее о позах позже.
ta: `` போச்`` வகை இடஞ்சார்ந்த கண்காணிக்கப்பட்ட உள்ளீட்டை வரையறுக்கிறது. பல "போச்" உள்ளீடுகள் Openxr இல் கிடைக்கின்றன: `` AIM``, `` grip`` மற்றும் `` பாம்``. உங்கள்: குறிப்பு: `xrcontroller3d <class_xrcontroller3d>` இந்த முனையின் `` போச்`` சொத்துக்கு ஒதுக்கப்பட்ட போச் செயலின் அடிப்படையில் முனையம் தானாகவே நிலைநிறுத்தப்படுகிறது. பின்னர் போச்கள் பற்றி மேலும்.
uk: Тип ``Pose`` визначає просторово відстежуваний вхід. У OpenXR доступні кілька вводів «пози»: ``aim``, ``grip`` і ``palm``. Ваш вузол :ref:`XRController3D <class_xrcontroller3d>` автоматично позиціонується на основі дії пози, призначеної властивості ``pose`` цього вузла. Про пози пізніше.
zh_hant: ``Pose`` 型別表示空間追蹤輸入。OpenXR 支援多種「姿勢」輸入：如 ``aim``、``grip``、``palm``。你的 :ref:`XRController3D <class_xrcontroller3d>` 節點會依照 ``pose`` 屬性綁定的動作自動定位。
