Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_action_map.po
Languages: fr, ga, it, ru, ta, uk, zh_cn, zh_hant

source: Ergo, there currently is no way to know with certainty, which controller the user is actually using.
ga: Ergo, níl aon bhealach ann faoi láthair a fhios le cinnteacht, a rialtóir an t-úsáideoir ag baint úsáide as i ndáiríre.
it: Pertanto, al momento non esiste alcun modo per sapere con certezza quale controller sta effettivamente utilizzando l'utente.
ru: Таким образом, в настоящее время нельзя так просто взять и узнать, какой именно контроллер использует пользователь.
ta: எர்கோ, தற்போது உறுதியாக அறிய எந்த வழியும் இல்லை, பயனர் உண்மையில் பயன்படுத்தும் கட்டுப்படுத்தி.
uk: Таким чином, зараз немає способу точно дізнатися, який контролер насправді використовує користувач.
zh_cn: 因此，目前没有办法确切地知道用户实际使用的是哪个控制器。
zh_hant: 因此，目前無法確定最終用戶到底使用哪一款控制器。

source: Finally, and this trips up a lot of people, the bindings aren't set in stone. It is fully allowed, and even expected, that an XR runtime allows a user to customise the bindings.
ga: Ar deireadh, agus an turas seo suas a lán daoine, nach bhfuil na ceangail leagtha síos i gcloch. Ceadaítear go hiomlán, agus táthar ag súil leis fiú, go ligeann rith-am XR d'úsáideoir na ceangail a shaincheapadh.
it: Infine, e questo lascia molti perplessi, le associazioni non sono immutabili. È pienamente permesso, e persino previsto, che un runtime XR consenta all'utente di personalizzare le associazioni.
ru: Наконец, и это многих сбивает с толку, привязки не являются незыблемыми. Вполне допустимо и даже ожидаемо, что среда выполнения XR позволяет пользователю настраивать привязки.
ta: இறுதியாக, இது நிறைய பேரை பயணிக்கிறது, பிணைப்புகள் கல்லில் அமைக்கப்படவில்லை. ஒரு எக்ச்ஆர் இயக்க நேரம் ஒரு பயனரை பிணைப்புகளைத் தனிப்பயனாக்க அனுமதிக்கிறது என்பது முழுமையாக அனுமதிக்கப்படுகிறது, மேலும் எதிர்பார்க்கப்படுகிறது.
uk: Нарешті, і це спотикає багатьох людей, прив’язки не висічені в камені. Цілком допустимо і навіть очікується, що середовище виконання XR дозволяє користувачеві налаштовувати прив’язки.
zh_cn: 最后，这让很多人犯了错误，绑定并不是一成不变的。XR 运行时允许用户定制绑定是完全允许的，甚至是可以预期的。
zh_hant: 另外一點易被忽略的是，這些綁定並非固定不變。許多 XR 執行環境允許甚至預期用戶自訂綁定。

source: At the moment none of the XR runtimes offer this functionality though SteamVR has an existing UI from OpenVRs action map system that is still accessible. This is actively being worked on however.
ga: I láthair na huaire ní thairgeann aon cheann de na runtimes XR an fheidhmiúlacht seo cé go bhfuil Chomhéadain reatha ag SteamVR ó chóras léarscáil gníomhaíochta OpenVRs atá inrochtana fós. Táthar ag obair air sin go gníomhach, áfach.
it: Al momento, nessuno dei runtime XR offre questa funzionalità, sebbene SteamVR abbia un'interfaccia utente derivata dal sistema di mappe d'azione di OpenVR, che è ancora accessibile. Ciò nonostante stiamo lavorando attivamente su questo aspetto.
ru: На данный момент ни одна из сред выполнения XR не предлагает такой функционал, хотя в SteamVR есть существующий пользовательский интерфейс из системы карт действий OpenVR, который всё ещё доступен. Работа над этим активно ведётся.
ta: இந்த நேரத்தில் எக்ச்ஆர் ரன் டைம்கள் எதுவும் இந்த செயல்பாட்டை வழங்கவில்லை, இருப்பினும் ச்டீம்விஆருக்கு ஓபன்.வி.ஆர்.எச் அதிரடி வரைபட அமைப்பிலிருந்து ஏற்கனவே இடைமுகம் உள்ளது, அது இன்னும் அணுகக்கூடியது. இருப்பினும் இது தீவிரமாக வேலை செய்யப்படுகிறது.
uk: На даний момент жодне із середовищ виконання XR не пропонує такої функції, хоча SteamVR має наявний інтерфейс користувача від системи карт дій OpenVR, який все ще доступний. Проте над цим активно працюють.
zh_cn: 目前，没有一个 XR 运行时提供这种功能，尽管 SteamVR 有一个来自 OpenVRs action map system 的现有 UI ，仍然可以访问。不过，这方面的工作正在积极进行中。
zh_hant: 目前尚無 XR 執行環境正式開放這類自訂功能，不過 SteamVR 仍可透過 OpenVR 動作對應系統的舊版 UI 進行部分編輯。相關功能正在開發中。

source: Our first controller binding
ga: Ár gcéad rialtóir ceangailteach
it: La nostra associazione di controller
ru: Наша первая привязка контроллера
ta: எங்கள் முதல் கட்டுப்படுத்தி பிணைப்பு
uk: Наша перша прив'язка контролера
zh_cn: 第一个控制器绑定
zh_hant: 第一個控制器綁定

source: Let's set up our first controller binding, using the Touch controller as an example.
ga: A ligean ar a chur ar bun ar ár gcéad rialtóir ceangailteach, ag baint úsáide as an rialtóir dteagmháil mar shampla.
ru: Давайте настроим нашу первую привязку контроллера, используя в качестве примера Touch (Сенсорный) контроллер.
ta: டச் கன்ட்ரோலரை உதாரணமாகப் பயன்படுத்தி, எங்கள் முதல் கட்டுப்பாட்டு பிணைப்பை அமைப்போம்.
uk: Давайте налаштуємо наше перше прив’язування контролера, використовуючи контролер Touch як приклад.
zh_cn: 让我们以触摸控制器为例，设置我们的第一个控制器绑定。
zh_hant: 以下以 Touch 控制器為例，示範如何設定第一個控制器綁定。

source: Press "Add profile", find the Touch controller, and add it. If it is not in the list, then it may already have been added.
ga: Brúigh "Cuir próifíl", faigh an rialtóir dteagmháil, agus cuir leis. Mura bhfuil sé ar an liosta, b'fhéidir gur cuireadh leis cheana féin é.
ru: Нажмите"Add profile", найдите контроллер Touch и добавьте его. Если его нет в списке, возможно, он уже добавлен.
ta: "சுயவிவரத்தைச் சேர்" என்பதை அழுத்தவும், டச் கன்ட்ரோலரைக் கண்டுபிடித்து, அதைச் சேர்க்கவும். இது பட்டியலில் இல்லாவிட்டால், அது ஏற்கனவே சேர்க்கப்பட்டிருக்கலாம்.
uk: Натисніть «Додати профіль», знайдіть сенсорний контролер і додайте його. Якщо його немає в списку, можливо, його вже додано.
zh_hant: 點選「新增設定檔」，搜尋 Touch 控制器並加入。若列表中未顯示，可能已經加入。

source: Our UI now shows panels for both the left and right controllers. The panels contain all of the possible inputs and outputs for each controller. We can use the ``+`` next to each entry to bind it to an action:
ga: Taispeánann ár UI painéil anois do na rialaitheoirí ar chlé agus ar dheis araon. Tá na painéil gach ceann de na hionchuir agus aschuir is féidir do gach rialtóir. Is féidir linn an ''+'' a úsáid in aice le gach iontráil chun é a cheangal le gníomh:
ru: Теперь в нашем пользовательском интерфейсе отображаются панели как для левого, так и для правого контроллеров. Панели содержат все возможные входы и выходы для каждого контроллера. Мы можем использовать ``+`` рядом с каждой записью, чтобы привязать её к действию:
ta: எங்கள் இடைமுகம் இப்போது இடது மற்றும் வலது கட்டுப்படுத்திகளுக்கான பேனல்களைக் காட்டுகிறது. ஒவ்வொரு கட்டுப்படுத்திக்கும் சாத்தியமான உள்ளீடுகள் மற்றும் வெளியீடுகள் அனைத்தும் பேனல்களில் உள்ளன. ஒவ்வொரு நுழைவுக்கும் அடுத்ததாக ``+`` அதைப் பயன்படுத்தலாம், அதை ஒரு செயலுக்கு பிணைக்க:
uk: Наш інтерфейс користувача тепер показує панелі як для лівого, так і для правого контролерів. Панелі містять усі можливі входи та виходи для кожного контролера. Ми можемо використовувати ``+`` біля кожного запису, щоб прив’язати його до дії:
zh_hant: 此時 UI 上會顯示左右兩側控制器面板，列出所有可用的輸入與輸出。你可點選每個條目旁的「+」將其綁定至動作：

source: Let's finish our configuration:
fr: Finissons notre configuration :
ga: Críochnaímis ár gcumraíocht:
it: Finiamo la nostra configurazione:
ru: Давайте завершим нашу настройку:
ta: எங்கள் உள்ளமைவை முடிப்போம்:
uk: Завершуємо налаштування:
zh_cn: 引擎配置：
zh_hant: 完成綁定設定：

source: Each action is bound the given input or output for both controllers to indicate that we support the action on either controller. The exception is the movement action which is bound only to the right hand controller. It is likely that we would want to use the left hand thumbstick for a different purpose, say a teleport function.
ga: Tá gach gníomh faoi cheangal an t-ionchur nó aschur a thugtar don dá rialaitheoirí a chur in iúl go bhfuil muid ag tacú leis an ngníomh ar cheachtar rialtóir. Eisceacht is ea an gníomh gluaiseachta nach bhfuil faoi cheangal ach ag an rialaitheoir ar dheis. Is dócha go mbeadh muid ag iarraidh an thumbstick láimhe clé a úsáid chun críche eile, a rá feidhm teleport.
ru: Каждое действие привязано к заданному входу или выходу для обоих контроллеров, что указывает на поддержку этого действия на любом из них. Исключением является действие движения, которое привязано только к правому контроллеру. Вероятно, нам понадобится использовать левый стик для другой цели, например, для телепортации.
ta: ஒவ்வொரு செயலும் இரு கட்டுப்பாட்டாளர்களுக்கும் கொடுக்கப்பட்ட உள்ளீடு அல்லது வெளியீட்டில் பிணைக்கப்பட்டுள்ளது, நாங்கள் கட்டுப்படுத்தி மீது செயலை ஆதரிக்கிறோம் என்பதைக் குறிக்கிறது. விதிவிலக்கு என்பது வலது கை கட்டுப்படுத்தியுடன் மட்டுமே பிணைக்கப்பட்டுள்ள இயக்க நடவடிக்கை. இடது கை கட்டைவிரலை வேறு நோக்கத்திற்காக பயன்படுத்த விரும்புவதாக இருக்கலாம், ஒரு டெலிபோர்ட் செயல்பாடு சொல்லுங்கள்.
uk: Кожна дія пов’язана з даним входом або виходом для обох контролерів, щоб вказати, що ми підтримуємо дію на будь-якому контролері. Винятком є дія руху, яка прив'язана лише до правого контролера. Ймовірно, ми захочемо використовувати джойстик лівої руки для іншої мети, скажімо, для функції телепорту.
zh_hant: 每個動作都分別對應左右控制器的相關輸入/輸出，表示兩手皆支援該動作。僅移動動作綁定於右手控制器，因左手搖桿通常另有用途（如傳送）。

source: In developing your game/application you have to account for the possibility that the user changes the binding and binds the movement to the left hand thumbstick.
ga: Agus do chluiche / feidhmchlár á fhorbairt agat caithfidh tú cuntas a thabhairt ar an bhféidearthacht go n-athraíonn an t-úsáideoir an ceangal agus go gceanglaíonn sé an ghluaiseacht ar an ordóg láimhe clé.
ru: При разработке игры/приложения необходимо учитывать вероятность того, что пользователь изменит привязку и привяжет движение к левому джойстику.
ta: உங்கள் விளையாட்டு/பயன்பாட்டை வளர்ப்பதில், பயனர் பிணைப்பை மாற்றி இயக்கத்தை இடது கை கட்டைவிரலுடன் பிணைக்கும் வாய்ப்பை நீங்கள் கணக்கிட வேண்டும்.
uk: Розробляючи свою гру/додаток, ви повинні враховувати можливість того, що користувач змінює прив’язку та прив’язує рух до джойстика лівої руки.
zh_hant: 開發時需考慮使用者可能自行更改綁定，將移動功能設到左手搖桿等情境。

source: Also note that our shoot and grab boolean actions are linked to inputs of type ``Float``. As mentioned before OpenXR will do conversions between the two, but do read the warning given on that subject earlier in this document.
ga: Tabhair faoi deara freisin go bhfuil ár ngníomhartha shoot agus grab Boole nasctha le hionchuir de chineál ''Snámhphointe''. Mar a luadh sula ndéanfaidh OpenXR tiontuithe idir an dá cheann, ach léigh an rabhadh a tugadh ar an ábhar sin níos luaithe sa doiciméad seo.
ru: Также обратите внимание, что наши булевы действия «стрелять» и «схватить» связаны с входными данными типа ``Float``. Как уже упоминалось, OpenXR выполняет преобразования между этими типами, но обязательно ознакомьтесь с предупреждением по этому поводу, данным ранее в этом документе.
ta: எங்கள் படப்பிடிப்பு மற்றும் கிராப் பூலியன் செயல்கள் `` மிதவை`` வகை உள்ளீடுகளுடன் இணைக்கப்பட்டுள்ளன என்பதையும் நினைவில் கொள்க. ஓபன்எக்ச்ஆர் முன் குறிப்பிட்டுள்ளபடி இருவருக்கும் இடையில் மாற்றங்களைச் செய்யும், ஆனால் இந்த ஆவணத்தில் முன்னர் அந்த விசயத்தில் கொடுக்கப்பட்ட எச்சரிக்கையைப் படியுங்கள்.
uk: Також зауважте, що наші булеві дії «стріляти» та «захоплювати» пов’язані з входами типу «Float». Як згадувалося раніше, OpenXR виконуватиме перетворення між ними, але прочитайте попередження, надане на цю тему раніше в цьому документі.
zh_hant: 另外，shoot 與 grab 動作雖為布林型，實際綁定的卻是 ``Float`` 型輸入。雖然 OpenXR 可自動轉換，但請詳閱前文有關閾值的注意事項。

source: Some of the inputs seem to appear in our list multiple times.
ga: Is cosúil go bhfuil cuid de na hionchuir le feiceáil inár liosta arís agus arís eile.
it: Alcuni input sembrano comparire nel nostro elenco più volte.
ru: Некоторые из входных данных, похоже, появляются в нашем списке несколько раз.
ta: சில உள்ளீடுகள் எங்கள் பட்டியலில் பல முறை தோன்றும்.
uk: Здається, деякі вхідні дані з’являються в нашому списку кілька разів.
zh_hant: 你可能會發現有些輸入在列表中重複出現。

source: For instance we can find the ``X`` button twice, once as ``X click`` and then as ``X touch``. This is due to the Touch controller having a capacitive sensor.
ga: Mar shampla, is féidir linn an cnaipe ''X'' a aimsiú faoi dhó, uair amháin mar ''X cliceáil'' agus ansin mar ''X touch''. Tá sé seo mar gheall ar an rialtóir dteagmháil a bhfuil braiteoir capacitive.
it: Ad esempio, possiamo trovare il pulsante ``X`` due volte, una volta come ``X click`` e poi come ``X touch``. Questo è perché il controller Touch ha un sensore capacitivo.
ru: Например, мы можем обнаружить кнопку ``X`` дважды: один раз как ``X click``, а второй раз как ``X touch``. Это связано с тем, что сенсорный контроллер Touch оснащен емкостным датчиком.
ta: உதாரணமாக, `` x`` பொத்தானை இரண்டு முறை, ஒரு முறை `` ஃச் கிளிக்`` ஆகவும், பின்னர் `` ஃச் டச்`` ஆகவும் காணலாம். டச் கன்ட்ரோலருக்கு ஒரு கொள்ளளவு சென்சார் இருப்பதால் இது ஏற்படுகிறது.
uk: Наприклад, ми можемо знайти кнопку ``X`` двічі, один раз як ``X click``, а потім як ``X touch``. Це пов’язано з тим, що сенсорний контролер має ємнісний датчик.
zh_hant: 例如 ``X`` 按鈕會分別出現 ``X click`` 與 ``X touch``，這是因 Touch 控制器內建電容式感應。

source: ``X touch`` will be true if the user is merely touching the X button.
ga: Beidh ''X touch'' fíor mura bhfuil an t-úsáideoir ach ag baint an chnaipe X.
it: ``X touch`` sarà true se l'utente sta a malapena toccando il pulsante X.
ru: ``X touch`` будет верным, если пользователь просто касается кнопки X.
ta: `` ஃச் டச்`` பயனர் வெறுமனே ஃச் பொத்தானைத் தொட்டால் உண்மையாக இருக்கும்.
uk: ``X touch`` буде істинним, якщо користувач просто торкається кнопки X.
zh_hant: 僅觸碰 X 按鈕時，``X touch`` 為 true。

source: ``X click`` will be true when the user is actually pressing down on the button.
ga: Beidh ''X cliceáil'' fíor nuair a bhíonn an t-úsáideoir ag brú síos ar an gcnaipe i ndáiríre.
it: ``X click`` sarà true quando l'utente sta effettivamente premendo il pulsante.
ru: ``X click`` будет верным, когда пользователь действительно нажмет на кнопку.
ta: `` ஃச் கிளிக்`` பயனர் உண்மையில் பொத்தானை அழுத்தும்போது உண்மையாக இருக்கும்.
uk: ``X click`` буде істинним, коли користувач фактично натискає кнопку.
zh_hant: 實際壓下按鈕時，``X click`` 才會變為 true。

source: Similarly for the thumbstick we have:
ga: Mar an gcéanna don thumbstick atá againn:
it: Similmente per la levetta analogica abbiamo:
ru: Аналогично для джойстика имеем:
ta: இதேபோல் நம்மிடம் உள்ள கட்டைவிரலுக்கும்:
uk: Аналогічно для джойстика ми маємо:
zh_hant: 搖桿（Thumbstick）也有類似情況：

source: ``Thumbstick touch`` which will be true if the user is touching the thumbstick.
ga: ''Thumbstick touch'' a bheidh fíor má tá an t-úsáideoir ag baint an ordóg.
it: ``Thumbstick touch`` che sarà true se l'utente sta toccando la levetta.
ru: ``Thumbstick touch (Касание джойстиком)``, которое будет верным, если пользователь касается джойстика.
ta: `` கட்டைவிரல் தொடுதல்`` பயனர் கட்டைவிரலைத் தொட்டால் இது உண்மையாக இருக்கும்.
uk: ``Thumbstick touch``, що буде істинним, якщо користувач торкається великого пальця.
zh_hant: 僅觸摸搖桿時，``Thumbstick touch`` 為 true。

source: ``Thumbstick`` which gives a value for the direction the thumbstick is pushed to.
ga: ''Thumbstick'' a thugann luach don treo a bhrúitear an ordóg.
it: ``Thumbstick`` che fornisce un valore per la direzione in cui viene spinta la levetta.
ru: ``Thumbstick``, который задает значение направления, в котором перемещается джойстик.
ta: கட்டைவிரல் தள்ளப்படும் திசைக்கு ஒரு மதிப்பைக் கொடுக்கும் `கட்டைவிரல்``.
uk: ``Thumbstick``, який дає значення напрямку, у якому натискається джойстик.
zh_hant: ``Thumbstick`` 會輸出搖桿目前推動方向的向量值。

source: ``Thumbstick click`` which is true when the user is pressing down on the thumbstick.
ga: ''Thumbstick click'' atá fíor nuair a bhíonn an t-úsáideoir ag brú síos ar an ordóg.
it: ``Thumbstick click``, che è true quando l'utente sta premendo la levetta in basso.
ru: ``Thumbstick click``, который происходит, когда пользователь нажимает на джойстик.
ta: `` கட்டைவிரல் கிளிக்`` பயனர் கட்டைவிரலில் அழுத்தும் போது இது உண்மை.
uk: ``Клацання джойстиком``, яке є істинним, коли користувач натискає джойстик.
zh_hant: 搖桿被往下壓時，``Thumbstick click`` 為 true。

source: It is important to note that only a select number of XR controllers support touch sensors or have click features on thumbsticks. Keep that in mind when designing your game/application. Make sure these are used for optional features of your game/application.
ga: Tá sé tábhachtach a thabhairt faoi deara nach dtacaíonn ach líon roghnaithe rialaitheoirí XR le braiteoirí tadhaill nó go bhfuil gnéithe cliceáil ar thumbsticks. Coinnigh sin san áireamh agus do chluiche/feidhmchlár á dhearadh. Cinntigh go n-úsáidtear iad seo le haghaidh gnéithe roghnacha de do chluiche / d'iarratas.
it: È importante notare che solo un numero limitato di controller XR supporta sensori touch o ha funzionalità di clic sulle levette analogiche. Tienilo a mente quando progetti il tuo gioco/applicazione. Assicurati che queste siano usate per funzionalità opzionali del tuo gioco/applicazione.
ru: Важно отметить, что лишь ограниченное число контроллеров XR поддерживают сенсорные датчики или имеют функцию нажатия на джойстиках. Имейте это в виду при разработке игры/приложения. Убедитесь, что они используются для дополнительных функций вашей игры/приложения.
ta: தேர்ந்தெடுக்கப்பட்ட எக்ச்ஆர் கட்டுப்பாட்டாளர்களின் எண்ணிக்கை மட்டுமே தொடு சென்சார்களை ஆதரிக்கிறது அல்லது கட்டைவிரல்களில் சொடுக்கு அம்சங்களைக் கொண்டுள்ளது என்பதை கவனத்தில் கொள்ள வேண்டும். உங்கள் விளையாட்டு/பயன்பாட்டை வடிவமைக்கும்போது அதை நினைவில் கொள்ளுங்கள். உங்கள் விளையாட்டு/பயன்பாட்டின் விருப்ப அம்சங்களுக்கு இவை பயன்படுத்தப்படுகின்றன என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: Важливо зазначити, що лише певна кількість контролерів XR підтримує сенсорні датчики або мають функції клацання на джойстиках. Майте це на увазі під час розробки вашої гри/програми. Переконайтеся, що вони використовуються для додаткових функцій вашої гри/програми.
zh_hant: 需注意，僅部分 XR 控制器支援觸控感應或搖桿點擊。設計遊戲/應用時，建議將這些功能設定為選用項目。

source: The simple controller
ga: An rialaitheoir simplí
it: Il semplice controller
ru: Простой контроллер
ta: எளிய கட்டுப்படுத்தி
uk: Простий контролер
zh_cn: 简单控制器
zh_hant: 簡單控制器

source: The "Simple controller" is a generic controller that OpenXR offers as a fallback. We'll apply our mapping:
fr: Le "Simple controller" est un contrôleur générique que OpenXR offre comme un repli. Nous appliquerons notre cartographie :
ga: Is rialtóir cineálach é an "rialtóir simplí" a thairgeann OpenXR mar chúltaca. Cuirfimid ár mapáil i bhfeidhm:
it: Il "Simple controller" è un controller generico che OpenXR offre come riserva. Applicheremo la nostra mappatura:
ru: "Simple controller" — это универсальный контроллер, предлагаемый OpenXR в качестве запасного варианта. Применим наше сопоставление:
ta: "சிம்பிள் கன்ட்ரோலர்" என்பது ஒரு பொதுவான கட்டுப்படுத்தியாகும், இது ஓபன்எக்ச்ஆர் ஒரு குறைவடையும். நாங்கள் எங்கள் மேப்பிங்கைப் பயன்படுத்துவோம்:
uk: «Простий контролер» — це загальний контролер, який OpenXR пропонує як запасний варіант. Ми застосуємо наше відображення:
zh_hant: 「簡單控制器」是 OpenXR 提供的通用後備控制器。我們來對應設定：

source: As becomes painfully clear, the simple controller is often far too simple and falls short for anything but the simplest of VR games/applications.
ga: De réir mar a éiríonn sé soiléir go pianmhar, is minic a bhíonn an rialtóir simplí i bhfad ró-shimplí agus titeann sé gearr do rud ar bith ach an ceann is simplí de chluichí / iarratais VR.
it: Come risulta dolorosamente chiaro, il controller generico è spesso troppo semplice e non basta per qualsiasi cosa che non sia il più semplice dei giochi/applicazioni VR.
ru: Как становится до боли ясно, простой контроллер зачастую оказывается слишком простым и не подходит ни для чего, кроме самых простых игр/приложений виртуальной реальности.
ta: வலிமிகுந்த தெளிவாக இருப்பது போல, எளிய கட்டுப்படுத்தி பெரும்பாலும் மிகவும் எளிமையானது மற்றும் வி.ஆர் கேம்கள்/பயன்பாடுகளில் எளிமையானது.
uk: Як стає до болю ясно, простий контролер часто надто простий і не підходить ні для чого, крім найпростіших ігор/додатків VR.
zh_hant: 不難發現，簡單控制器功能極其有限，僅能應付最基本的 VR 遊戲/應用。

source: This is why many XR runtimes only use it as a last resort and will attempt to use bindings from one of the more popular systems as a fallback first.
fr: C'est pourquoi de nombreux environnements d'exécution XR ne l'utilisent qu'en dernier recours et tenteront d'utiliser les liaisons d'un des systèmes les plus populaires comme un repli d'abord.
ga: Sin é an fáth nach n-úsáideann go leor runtimes XR é ach mar rogha dheireanach agus déanfaidh sé iarracht ceangail a úsáid ó cheann de na córais is coitianta mar fallback ar dtús.
it: Ecco perché molti runtime XR lo utilizzano solo come ultima risorsa e tentano di utilizzare le associazioni di uno dei sistemi più diffusi come prima riserva.
ru: Вот почему многие среды выполнения XR используют его только в качестве крайней меры и сначала пытаются использовать привязки из одной из наиболее популярных систем в качестве запасного варианта.
ta: இதனால்தான் பல எக்ச்ஆர் ரன் டைம்கள் இதை கடைசி முயற்சியாக மட்டுமே பயன்படுத்துகின்றன, மேலும் மிகவும் பிரபலமான அமைப்புகளில் ஒன்றிலிருந்து பிணைப்புகளை முதலில் குறைவடையும்.
uk: Ось чому багато середовищ виконання XR використовують його лише як крайній засіб і спочатку намагатимуться використати прив’язки з однієї з найбільш популярних систем як запасний варіант.
zh_hant: 所以多數 XR 執行環境僅在萬不得已時才採用簡單控制器，通常會優先嘗試用較常見的設定檔做對應。

source: Due to the simple controller likely not covering the needs of your game, it is tempting to provide bindings for every controller supported by OpenXR. The default action map seems to suggest this as a valid course of action. As mentioned before, the default action map was designed for ease of migration from Godot 3.
ga: Mar gheall ar an rialtóir simplí dócha nach gclúdaíonn riachtanais do chluiche, tá sé tempting ceangailteacha a chur ar fáil do gach rialtóir tacaíocht ó OpenXR. Is cosúil go dtugann an léarscáil réamhshocraithe gníomhaíochta le fios gur gníomh bailí é seo. Mar a luadh cheana, dearadh an léarscáil gníomhaíochta réamhshocraithe chun imirce ó Godot 3 a éascú.
ru: Поскольку простой контроллер, вероятно, не покрывает потребности вашей игры, возникает соблазн предоставить привязки для каждого контроллера, поддерживаемого OpenXR. Карта действий по умолчанию, похоже, предполагает такой вариант. Как упоминалось ранее, карта действий по умолчанию была разработана для упрощения миграции из Godot 3.
ta: உங்கள் விளையாட்டின் தேவைகளை ஈடுசெய்யாத எளிய கட்டுப்படுத்தி காரணமாக, ஓபன்எக்ச்ஆரால் ஆதரிக்கப்படும் ஒவ்வொரு கட்டுப்படுத்திக்கும் பிணைப்புகளை வழங்க இது தூண்டுகிறது. இயல்புநிலை செயல் வரைபடம் இதை சரியான செயலாக பரிந்துரைக்கிறது. முன்பு குறிப்பிட்டபடி, இயல்புநிலை செயல் வரைபடம் கோடோட் 3 இலிருந்து இடம்பெயர்வுக்காக வடிவமைக்கப்பட்டுள்ளது.
uk: Через те, що простий контролер, ймовірно, не відповідає потребам вашої гри, виникає спокуса забезпечити прив’язки для кожного контролера, що підтримується OpenXR. Здається, стандартна карта дій пропонує це як правильний курс дій. Як згадувалося раніше, стандартну карту дій було розроблено для полегшення міграції з Godot 3.
zh_hant: 由於簡單控制器無法滿足大多數遊戲需求，許多開發者會想為 OpenXR 支援的所有控制器都設綁定。預設動作對應看似如此，但正如前述，這主要是為了從 Godot 3 遷移方便。
