Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_action_map.po
Languages: fr, ga, it, ru, ta, uk, zh_cn, zh_hant

source: ``Amplitude`` is the amplitude of the pulse.
fr: ``Amplitude`` est l'amplitude de l'impulsion.
it: ``Amplitude`` è l'ampiezza dell'impulso.
ru: ``Amplitude`` — амплитуда импульса.
uk: ``Амплітуда`` - це амплітуда імпульсу.
zh_hant: ``Amplitude``：脈衝的振幅。

source: For this walkthrough we're going to start with a blank action map. You can simply delete the "Godot action set" entry at the top by pressing the trash can icon. This will clear out all actions. You might also want to remove the controllers that you do not wish to setup, more on this later.
ga: Chun an walkthrough táimid ag dul chun tús a chur le léarscáil gníomh bán. Is féidir leat an iontráil "tacar gníomhaíochta Godot" a scriosadh ag an mbarr ach an bruscar a bhrú. Glanfaidh sé seo amach gach gníomh. B'fhéidir gur mhaith leat freisin a bhaint as na rialaitheoirí nach mian leat a thus, níos mó ar seo níos déanaí.
ta: இந்த ஒத்திகைக்கு நாங்கள் ஒரு வெற்று செயல் வரைபடத்துடன் தொடங்கப் போகிறோம். குப்பை கேன் ஐகானை அழுத்துவதன் மூலம் மேலே உள்ள "கோடோட் அதிரடி தொகுப்பு" உள்ளீட்டை நீங்கள் நீக்கலாம். இது எல்லா செயல்களையும் அழிக்கும். நீங்கள் அமைக்க விரும்பாத கட்டுப்படுத்திகளை அகற்றவும் விரும்பலாம், இது பின்னர் மேலும்.

source: For our walkthrough in this document we will thus create a single action set called ``my_first_action_set``. We do this by pressing the ``Add action set`` button:
ga: Dá bhrí sin, cruthóimid tacar gníomhaíochta amháin ar a dtugtar ''my_first_action_set''. Déanaimid é seo tríd an gcnaipe ''Cuir tacar gníomhaíochta leis'' a bhrú:
ta: இந்த ஆவணத்தில் எங்கள் ஒத்திகைக்கு, இதனால் `` my_first_action_set`` என்ற ஒற்றை செயல் தொகுப்பை உருவாக்குவோம். `` செயல் தொகுப்பு` பொத்தானைச் சேர்: பொத்தானை அழுத்துவதன் மூலம் இதைச் செய்கிறோம்:

source: my_first_action_set
fr: mon_premier_ensemble_dactions
ga: mo chéad_ghníomhaíocht

source: This is the priority of the action set. If multiple active action sets have actions bound to the same controllers inputs or outputs, the action set with the highest priority value will determine the action that is updated.
ga: Is é seo tosaíocht an tacair gníomhaíochta. Má tá gníomhartha faoi cheangal ag tacair ghníomhaíochta ghníomhacha éagsúla atá faoi cheangal ag ionchuir nó aschuir na rialaitheoirí céanna, cinnfidh an gníomh a leagtar leis an luach tosaíochta is airde an gníomh a nuashonraítear.
ta: இது செயல் தொகுப்பின் முன்னுரிமை. பல செயலில் உள்ள செயல் தொகுப்புகள் ஒரே கட்டுப்பாட்டு உள்ளீடுகள் அல்லது வெளியீடுகளுடன் பிணைக்கப்பட்ட செயல்களைக் கொண்டிருந்தால், அதிக முன்னுரிமை மதிப்பைக் கொண்ட செயல் புதுப்பிக்கப்பட்ட செயலை தீர்மானிக்கும்.
zh_cn: 这是动作集的优先级。如果多个活动动作集具有绑定到相同控制器输入或输出的动作，则具有最高优先级值的动作集将确定被更新的动作。

source: In OpenXR controller bindings are captured in so-called "Interaction Profiles". We've simply shortened it to "Profiles" because it takes up less space.
ga: I OpenXR ceangailteacha rialtóir a gabhadh i mar a thugtar air "Próifílí Idirghníomhaíochta". Táimid tar éis é a ghiorrú go simplí le "Próifílí" toisc go dtógann sé níos lú spáis.
ta: Openxr கட்டுப்படுத்தி பிணைப்புகளில் "தொடர்பு சுயவிவரங்கள்" என்று அழைக்கப்படுபவற்றில் பிடிக்கப்படுகின்றன. நாங்கள் அதை "சுயவிவரங்களாக" சுருக்கிவிட்டோம், ஏனெனில் அது குறைந்த இடத்தை எடுக்கும்.
