Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_action_map.po
Languages: fr, ga, it, ru, ta, uk, zh_cn, zh_hant

source: The XR action map
ga: Léarscáil ghníomhaíochta XR
it: La mappa di azioni XR
ru: Карта действий XR
ta: எக்ச்ஆர் செயல் வரைபடம்
uk: Карта дій XR
zh_cn: XR 动作映射
zh_hant: XR 動作對應

source: Godot has an action map feature as part of the XR system. At this point in time this system is part of the OpenXR module. There are plans to encompass WebXR into this in the near future hence we call it the XR action map system in this document. It implements the built-in action map system of OpenXR mostly exactly as it is offered.
ga: Tá gné léarscáil gníomhaíochta ag Godot mar chuid den chóras XR. Ag an bpointe seo tá an córas seo mar chuid den mhodúl OpenXR. Tá pleananna ann WebXR a chuimsiú sa todhchaí go luath agus mar sin tugaimid córas léarscáil gníomhaíochta XR air sa doiciméad seo. Cuireann sé an córas léarscáil gníomhaíochta tógtha de OpenXR i bhfeidhm den chuid is mó go díreach mar a thairgtear é.
ta: கோடோட் எக்ச்ஆர் அமைப்பின் ஒரு பகுதியாக ஒரு செயல் வரைபட அம்சத்தைக் கொண்டுள்ளது. இந்த கட்டத்தில் இந்த அமைப்பு OpenXR தொகுதியின் ஒரு பகுதியாகும். எதிர்காலத்தில் வெப்எக்ச்ஆரை உள்ளடக்கிய திட்டங்கள் உள்ளன, எனவே இந்த ஆவணத்தில் எக்ச்ஆர் அதிரடி வரைபட அமைப்பு என்று அழைக்கிறோம். இது ஓபன்எக்ச்ஆரின் உள்ளமைக்கப்பட்ட செயல் வரைபட அமைப்பை பெரும்பாலும் வழங்கியபடியே செயல்படுத்துகிறது.
uk: Godot має функцію карти дій як частину системи XR. На даний момент ця система є частиною модуля OpenXR. У найближчому майбутньому планується включити WebXR до цього, тому в цьому документі ми називаємо це системою карти дій XR. Він реалізує вбудовану систему карт дій OpenXR переважно точно так, як вона пропонується.
zh_hant: Godot 的 XR 系統中包含動作對應功能。目前此系統屬於 OpenXR 模組。未來預計也會納入 WebXR，因此本文件統稱為 XR 動作對應系統。它幾乎完全依照 OpenXR 內建的動作對應系統實作。

source: The XR action map system exposes input, positional data and output for XR controllers to your game/application. It does this by exposing named actions that can be tailored to your game/application and binding these to the actual inputs and outputs on your XR devices.
ga: Nochtann córas léarscáile gníomhaíochta XR ionchur, sonraí suímh agus aschur do rialtóirí XR chuig do chluiche/iarratas. Déanann sé é seo trí ghníomhartha ainmnithe a nochtadh is féidir a chur in oiriúint do chluiche/feidhmchlár agus iad seo a cheangal leis na hionchuir agus na haschuir iarbhír ar do ghléasanna XR.
ta: எக்ச்ஆர் செயல் வரைபட அமைப்பு உங்கள் விளையாட்டு/பயன்பாட்டிற்கு எக்ச்ஆர் கட்டுப்படுத்திகளுக்கான உள்ளீடு, நிலை தரவு மற்றும் வெளியீட்டை அம்பலப்படுத்துகிறது. உங்கள் விளையாட்டு/பயன்பாட்டிற்கு ஏற்றவாறு பெயரிடப்பட்ட செயல்களை அம்பலப்படுத்துவதன் மூலமும், உங்கள் எக்ச்ஆர் சாதனங்களில் உண்மையான உள்ளீடுகள் மற்றும் வெளியீடுகளுடன் இவற்றை பிணைப்பதன் மூலமும் இது செய்கிறது.
uk: Система карти дій XR надає вхідні, позиційні дані та вихід для контролерів XR вашій грі/додатку. Це робиться шляхом надання іменованих дій, які можна адаптувати до вашої гри/програми, і прив’язування їх до фактичних входів і виходів на ваших пристроях XR.
zh_hant: XR 動作對應系統會將 XR 控制器的輸入、空間定位資料與輸出公開給您的遊戲/應用程式。其原理是公開可自訂的命名動作，並將這些動作綁定到 XR 裝置上的實際輸入與輸出。

source: As the XR action map is currently part of the OpenXR module, OpenXR needs to be enabled in your project settings to expose it:
ga: Ós rud é go bhfuil an léarscáil gníomhaíochta XR mar chuid den mhodúl OpenXR faoi láthair, ní mór OpenXR a chumasú i do shocruithe tionscadail chun é a nochtadh:
ru: Поскольку карта действий XR в настоящее время является частью модуля OpenXR, для ее отображения необходимо включить OpenXR в настройках проекта:
ta: எக்ச்ஆர் செயல் வரைபடம் தற்போது ஓபன்எக்ச்ஆர் தொகுதியின் ஒரு பகுதியாக இருப்பதால், அதை அம்பலப்படுத்த உங்கள் திட்ட அமைப்புகளில் ஓபன்எக்ச்ஆர் இயக்கப்பட வேண்டும்:
uk: Оскільки карта дій XR наразі є частиною модуля OpenXR, OpenXR потрібно ввімкнути в налаштуваннях вашого проекту, щоб відкрити її:
zh_cn: 由于 XR 动作映射目前是 OpenXR 模块的一部分，因此需要在项目设置中启用 OpenXR 才能显示它：
zh_hant: 由於 XR 動作對應目前屬於 OpenXR 模組，因此必須於專案設定中啟用 OpenXR 才能使用本功能：

source: You will then find the XR Action Map interface in the bottom of the screen:
ga: Ansin gheobhaidh tú comhéadan XR Action Map ag bun an scáileáin:
ru: Затем в нижней части экрана вы увидите интерфейс карты действий XR:
ta: நீங்கள் எக்ச்ஆர் அதிரடி வரைபட இடைமுகத்தை திரையின் அடிப்பகுதியில் காண்பீர்கள்:
uk: Потім ви знайдете інтерфейс карти дій XR у нижній частині екрана:
zh_cn: 然后，你会在屏幕底部看到 XR 行动地图界面：
zh_hant: 接著您會在畫面下方看到 XR 動作對應介面：

source: Godot's built-in input system has many things in common with the XR action map system. In fact our original idea was to add functionality to the existing input system and expose the data to the OpenXR action map system. We may revisit that idea at some point but as it turns out there were just too many problems to overcome. To name a few:
ga: Tá go leor rudaí i gcoiteann ag córas ionchuir ionsuite Godot leis an gcóras léarscáil gníomhaíochta XR. Go deimhin ba é an bunsmaoineamh a bhí againn ná feidhmiúlacht a chur leis an gcóras ionchuir atá ann cheana féin agus na sonraí a nochtadh do chóras léarscáil gníomhaíochta OpenXR. B'fhéidir go mbreathnóimid arís ar an smaoineamh sin ag pointe éigin ach mar a tharlaíonn sé ní raibh ach an iomarca fadhbanna le sárú. Chun cúpla ceann a ainmniú:
ta: கோடோட்டின் உள்ளமைக்கப்பட்ட உள்ளீட்டு அமைப்பு எக்ச்ஆர் அதிரடி வரைபட அமைப்புடன் பொதுவான பல விசயங்களைக் கொண்டுள்ளது. உண்மையில் எங்கள் அசல் சிந்தனை, தற்போதுள்ள உள்ளீட்டு அமைப்பில் செயல்பாட்டைச் சேர்ப்பது மற்றும் Openxr செயல் வரைபட அமைப்பில் தரவை அம்பலப்படுத்துவதாகும். அந்த யோசனையை ஒரு கட்டத்தில் நாம் மறுபரிசீலனை செய்யலாம், ஆனால் அது மாறிவிட்டால், கடக்க பல சிக்கல்கள் இருந்தன. ஒரு சிலருக்கு பெயரிட:
uk: Вбудована система введення Godot має багато спільного з системою карт дій XR. Фактично, наша початкова ідея полягала в тому, щоб додати функціональність до існуючої системи введення та надати дані системі карти дій OpenXR. Ми можемо повернутися до цієї ідеї в якийсь момент, але, як виявилося, було занадто багато проблем, які потрібно було подолати. Щоб назвати декілька:
zh_hant: Godot 的內建輸入系統與 XR 動作對應系統有許多共通之處。最初我們原本打算直接在既有輸入系統上增擴功能，並將資料公開給 OpenXR 動作對應系統。雖然這想法不排除未來重啟，但實際上障礙不少，例如：

source: Godot's input system mainly centers around button inputs, XR adds triggers, axis, poses and haptics (output) into the mix. This would greatly complicate the input system with features that won't work for normal controllers or contrast with the current approach. It was felt this would lead to confusion for the majority of Godot users.
ga: Tá córas ionchuir Godot dírithe den chuid is mó ar ionchuir cnaipe, cuireann XR truicir, ais, cúiseanna agus haptics (aschur) isteach sa mheascán. Chuirfeadh sé seo go mór leis an gcóras ionchuir le gnéithe nach n-oibreoidh do ghnáthrialaitheoirí nó codarsnacht leis an gcur chuige reatha. Measadh go gcuirfeadh sé seo mearbhall ar fhormhór na n-úsáideoirí Godot.
ta: கோடோட்டின் உள்ளீட்டு அமைப்பு முக்கியமாக பொத்தான் உள்ளீடுகளை மையமாகக் கொண்டுள்ளது, எக்ச்ஆர் தூண்டுதல்கள், அச்சு, போச் மற்றும் ஆப்டிக்ச் (வெளியீடு) ஆகியவற்றை கலவையில் சேர்க்கிறது. இது சாதாரண கட்டுப்பாட்டாளர்களுக்கு வேலை செய்யாத அல்லது தற்போதைய அணுகுமுறைக்கு முரணான அம்சங்களுடன் உள்ளீட்டு முறையை பெரிதும் சிக்கலாக்கும். இது பெரும்பான்மையான கோடோட் பயனர்களுக்கு குழப்பத்திற்கு வழிவகுக்கும் என்று உணரப்பட்டது.
uk: Система введення Godot здебільшого зосереджена навколо кнопкових вводів, XR додає в мікс тригери, вісь, пози та тактильні ефекти (вихід). Це значно ускладнить систему введення завдяки функціям, які не працюватимуть для звичайних контролерів, або контрастуватиме з поточним підходом. Вважалося, що це призведе до плутанини для більшості користувачів Godot.
zh_hant: Godot 的輸入系統主要以按鍵輸入為核心，而 XR 則增加了扳機、軸向、姿勢與觸覺（輸出）等概念。這會讓輸入系統變得過於複雜，且許多功能不適用於一般手把或會與現有設計衝突，進而造成多數 Godot 使用者困惑。

source: Godot's input system works with raw input data that is parsed and triggers emitting actions. This input data is made available to the end user. OpenXR completely hides raw data and does all the parsing for us, we only get access to already parsed action data. This inconsistency is likely to lead to bugs when an unsuspecting user tries to use an XR device as a normal input device.
ga: Oibríonn córas ionchuir Godot le sonraí ionchuir amh atá parsáilte agus a spreagann gníomhartha astaithe. Cuirtear na sonraí ionchuir seo ar fáil don úsáideoir deiridh. OpenXR seithí go hiomlán sonraí amh agus a dhéanann go léir an parsáil dúinn, a fháil againn ach rochtain ar shonraí gníomhaíochta parsed cheana féin. Is dócha go mbeidh fabhtanna mar thoradh ar an neamhréireacht seo nuair a dhéanann úsáideoir neamhspléach iarracht gléas XR a úsáid mar ghnáthghléas ionchuir.
ta: கோடோட்டின் உள்ளீட்டு அமைப்பு மூல உள்ளீட்டுத் தரவுகளுடன் செயல்படுகிறது, இது பாகுபடுத்தப்பட்ட மற்றும் உமிழும் செயல்களைத் தூண்டுகிறது. இந்த உள்ளீட்டு தரவு இறுதி பயனருக்கு கிடைக்கிறது. OpenXR மூல தரவை முற்றிலுமாக மறைக்கிறது மற்றும் எங்களுக்காக அனைத்து பாகுபடுத்தல்களையும் செய்கிறது, ஏற்கனவே பாகுபடுத்தப்பட்ட செயல் தரவுகளுக்கான அணுகலை மட்டுமே பெறுகிறோம். சந்தேகத்திற்கு இடமில்லாத பயனர் எக்ச்ஆர் சாதனத்தை சாதாரண உள்ளீட்டு சாதனமாகப் பயன்படுத்த முயற்சிக்கும்போது இந்த முரண்பாடு பிழைகளுக்கு வழிவகுக்கும்.
uk: Система введення Godot працює з необробленими вхідними даними, які аналізуються та запускають дії, що видають. Ці вхідні дані стають доступними для кінцевого користувача. OpenXR повністю приховує необроблені дані та виконує весь аналіз за нас, ми отримуємо доступ лише до вже проаналізованих даних дій. Ця невідповідність може призвести до помилок, коли нічого не підозрюючий користувач намагатиметься використовувати пристрій XR як звичайний пристрій введення.
zh_hant: Godot 的輸入系統是以原始資料為基礎，經解析後觸發動作，並將此類資料直接提供給用戶端。而 OpenXR 則完全隱藏原始資料，所有解析都內部完成，僅提供已處理好的動作資料。這樣的不一致，若開發者誤把 XR 裝置當作一般輸入裝置使用，容易發生錯誤。

source: Godot's input system allows changes to what inputs are bound to actions in runtime, OpenXR does not.
fr: Le système d'entrée de Godot permet de modifier les entrées liées aux actions en cours d'exécution, OpenXR ne le fait pas.
ga: Ceadaíonn córas ionchuir Godot athruithe ar na hionchuir atá faoi cheangal ag gníomhartha in am rite, ní dhéanann OpenXR.
ru: Система ввода Godot позволяет изменять привязку входных данных к действиям во время выполнения, а OpenXR — нет.
ta: கோடோட்டின் உள்ளீட்டு அமைப்பு இயக்க நேரத்தில் உள்ளீடுகள் என்ன செயல்களுக்கு பிணைக்கப்பட்டுள்ளன என்பதில் மாற்றங்களை அனுமதிக்கிறது, Openxr இல்லை.
uk: Система введення Godot дозволяє змінювати те, які вхідні дані прив’язані до дій під час виконання, а OpenXR — ні.
zh_cn: Godot 的输入系统允许在运行时更改输入与操作的绑定，而 OpenXR 则不允许。
zh_hant: Godot 的輸入系統允許在執行時動態更換輸入對應的動作，但 OpenXR 不支援。

source: Godot's input system is based on device ids which are meaningless in OpenXR.
fr: Le système d'entrée de Godot est basé sur les ids de périphériques qui sont sans signification dans OpenXR.
ga: Tá córas ionchuir Godot bunaithe ar ids gléas atá gan bhrí i OpenXR.
ru: Система ввода Godot основана на идентификаторах устройств, которые не имеют смысла в OpenXR.
ta: கோடோட்டின் உள்ளீட்டு அமைப்பு Openxr இல் அர்த்தமற்றதாக இருக்கும் சாதன ஐடிகளை அடிப்படையாகக் கொண்டது.
uk: Система введення Godot базується на ідентифікаторах пристроїв, які не мають сенсу в OpenXR.
zh_cn: Godot 的输入系统基于设备 ID，而这在 OpenXR 中毫无意义。
zh_hant: Godot 的輸入系統以裝置 ID 區分來源，但在 OpenXR 中並無此意義。

source: This does mean that a game/application that mixes traditional inputs with XR controllers will have a separation. For most applications either one or the other is used and this is not seen as a problem. In the end, it's a limitation of the system.
ga: Ciallaíonn sé seo go mbeidh scaradh ag cluiche / feidhmchlár a mheascann ionchuir thraidisiúnta le rialaitheoirí XR. I gcás fhormhór na n-iarratas úsáidtear ceann amháin nó an ceann eile agus ní fheictear é seo mar fhadhb. Sa deireadh, is teorainn ar an gcóras é.
ru: Это означает, что в игре/приложении, сочетающем традиционные устройства ввода с XR-контроллерами, будет присутствовать разделение. В большинстве приложений используется либо один, либо другой, и это не считается проблемой. В конечном счёте, это ограничение системы.
ta: பாரம்பரிய உள்ளீடுகளை எக்ச்ஆர் கட்டுப்படுத்திகளுடன் கலக்கும் ஒரு விளையாட்டு/பயன்பாடு ஒரு பிரிப்பைக் கொண்டிருக்கும் என்று இதன் பொருள். பெரும்பாலான பயன்பாடுகளுக்கு ஒன்று அல்லது மற்றொன்று பயன்படுத்தப்படுகின்றன, இது ஒரு சிக்கலாகக் கருதப்படவில்லை. இறுதியில், இது அமைப்பின் வரம்பு.
uk: Це означає, що гра/програма, яка поєднує традиційні входи з контролерами XR, матиме розділення. Для більшості програм використовується або один, або інший, і це не розглядається як проблема. Зрештою, це обмеження системи.
zh_cn: 这确实意味着混合了传统输入和 XR 控制器的游戏/应用将会有一个分离。对于大多数应用来说，要么使用一个，要么使用另一个，这不被视为问题。最后，这是系统的限制。
zh_hant: 這也意味著同時支援傳統輸入與 XR 控制器的遊戲/應用程式，這兩者會被系統分開處理。對大多數應用來說只需選用其中一種，並不成問題。歸根究柢，這是系統的設計限制。

source: The default action map
ga: An léarscáil ghníomhaíochta réamhshocraithe
it: La mappa di azioni predefinita
ru: Карта действий по умолчанию
ta: இயல்புநிலை செயல் வரைபடம்
uk: Стандартна карта дій
zh_cn: 默认动作映射
zh_hant: 預設動作對應

source: Godot will automatically create a default action map if no action map file is found.
ga: Cruthóidh Godot léarscáil ghníomhaíochta réamhshocraithe go huathoibríoch mura n-aimsítear aon chomhad mapa gníomhaíochta.
ru: Godot автоматически создаст карту действий по умолчанию, если файл карты действий не найден.
ta: செயல் வரைபடக் கோப்பு எதுவும் காணப்படாவிட்டால் கோடோட் தானாகவே இயல்புநிலை செயல் வரைபடத்தை உருவாக்கும்.
uk: Godot автоматично створить карту дій за замовчуванням, якщо файл карти дій не знайдено.
zh_cn: 如果找不到操作映射文件，Godot 会自动创建默认操作映射。
zh_hant: 若專案未偵測到動作對應檔，Godot 會自動建立一份預設動作對應。

source: This default map was designed to help developers port their XR games/applications from Godot 3 to Godot 4. As a result this map essentially binds all known inputs on all controllers supported by default, to actions one on one. This is not a good example of setting up an action map. It does allow a new developer to have a starting point when they want to become familiar with Godot XR. It prevents having to design a proper action map for their game/application first.
ga: Dearadh an léarscáil réamhshocraithe seo chun cabhrú le forbróirí a gcluichí / iarratais XR a phortáil ó Godot 3 go Godot 4. Mar thoradh air sin ceanglaíonn an léarscáil seo go bunúsach gach ionchur aitheanta ar gach rialaitheoir a fhaigheann tacaíocht de réir réamhshocraithe, le gníomhartha ceann ar cheann. Ní dea-shampla é seo chun léarscáil ghníomhaíochta a chur ar bun. Ligeann sé d'fhorbróir nua pointe tosaigh a bheith aige nuair is mian leo a bheith eolach ar Godot XR. Cuireann sé cosc ar léarscáil ghníomhaíochta chuí a dhearadh dá gcluiche / iarratas ar dtús.
ta: இந்த இயல்புநிலை வரைபடம் உருவாக்குபவர்கள் தங்கள் எக்ச்ஆர் கேம்கள்/பயன்பாடுகளை கோடோட் 3 இலிருந்து கோடோட் 4 க்கு அனுப்ப உதவும் வகையில் வடிவமைக்கப்பட்டுள்ளது. இதன் விளைவாக இந்த வரைபடம் இயல்புநிலையாக ஆதரிக்கப்படும் அனைத்து கட்டுப்பாட்டாளர்களிடமும் அறியப்பட்ட அனைத்து உள்ளீடுகளையும், ஒன்றில் செயல்களுக்கு பிணைக்கிறது. செயல் வரைபடத்தை அமைப்பதற்கு இது ஒரு சிறந்த எடுத்துக்காட்டு அல்ல. இது ஒரு புதிய டெவலப்பருக்கு கோடோட் எக்ச்ஆரை நன்கு அறிய விரும்பும் போது ஒரு தொடக்க புள்ளியைக் கொண்டிருக்க அனுமதிக்கிறது. முதலில் அவர்களின் விளையாட்டு/பயன்பாட்டிற்கான சரியான செயல் வரைபடத்தை வடிவமைப்பதை இது தடுக்கிறது.
uk: Цю мапу за замовчуванням було розроблено, щоб допомогти розробникам перенести свої ігри/програми XR з Godot 3 на Godot 4. У результаті ця карта по суті пов’язує всі відомі входи на всіх контролерах, які підтримуються за замовчуванням, до дій один на один. Це невдалий приклад створення карти дій. Це дійсно дозволяє новому розробнику мати відправну точку, коли він хоче ознайомитися з Godot XR. Це запобігає необхідності спочатку розробити відповідну карту дій для їхньої гри/програми.
zh_hant: 這份預設對應是為協助開發者將 XR 遊戲/應用從 Godot 3 移植到 Godot 4 而設計。它基本上將所有已知的預設控制器輸入一對一綁定到動作上。這並非良好的對應設計範例，但對初學者來說可直接上手 Godot XR，無須先行設計專屬動作對應。

source: For this walkthrough we're going to start with a blank action map. You can delete the "Godot action set" entry at the top by pressing the trash can icon. This will clear out all actions. You might also want to remove the controllers that you do not wish to setup, more on this later.
uk: У цій інструкції ми почнемо з порожньої карти дій. Ви можете видалити запис «Набір дій Godot» вгорі, натиснувши значок кошика. Це скасує всі дії. Ви також можете видалити контролери, які не бажаєте налаштовувати, докладніше про це пізніше.
zh_hant: 本教學將從一張空白的動作對應開始。可點選頂端的垃圾桶圖示刪除「Godot 操作集」條目，這會清空所有動作。你也可以移除不需要設定的控制器，後續會再說明。

source: Action sets
fr: Ensembles d'actions
ga: Tacair ghníomhaíochta
it: Insiemi di azioni
ru: Наборы действий
ta: செயல் தொகுப்புகள்
uk: Набори дій
zh_cn: 动作集
zh_hant: 動作集

source: Before we dive in, you will see the term XR runtime used throughout this document. With XR runtime we mean the software that is controlling and interacting with the AR or VR headset. The XR runtime then exposes this to us through an API such as OpenXR. So:
ga: Sula ndéanaimid tumadh isteach, feicfidh tú an téarma am rite XR a úsáidtear ar fud an doiciméid seo. Le runtime XR ciallaíonn muid na bogearraí atá ag rialú agus ag idirghníomhú leis an headset AR nó VR. Ansin nochtann am rite XR é seo dúinn trí API mar OpenXR. Mar sin:
it: Prima di continuare, in questo documento sarà utilizzato il termine "runtime XR". Con "runtime XR" intendiamo il software che controlla e interagisce con il visore AR o VR. Il runtime XR ci fornisce poi queste informazioni tramite un'API come OpenXR. Pertanto:
ta: நாங்கள் டைவ் செய்வதற்கு முன், இந்த ஆவணம் முழுவதும் பயன்படுத்தப்படும் எக்ச்ஆர் இயக்க நேரம் என்ற வார்த்தையை நீங்கள் காண்பீர்கள். எக்ச்ஆர் இயக்க நேரத்துடன் AR அல்லது VR எட்செட்டுடன் கட்டுப்படுத்தும் மற்றும் தொடர்பு கொள்ளும் மென்பொருளைக் குறிக்கிறோம். எக்ச்ஆர் இயக்க நேரம் இதை ஓபன்எக்ச்ஆர் போன்ற பநிஇ மூலம் எங்களுக்கு வெளிப்படுத்துகிறது. எனவே:
uk: Перш ніж ми зануримося, ви побачите термін XR runtime, який використовується в цьому документі. Під середовищем виконання XR ми маємо на увазі програмне забезпечення, яке контролює та взаємодіє з гарнітурою AR або VR. Потім середовище виконання XR надає нам це через API, наприклад OpenXR. Отже:
zh_hant: 在開始之前，你會多次看到「XR 執行環境」這個詞。這裡指的是負責控制與管理 AR/VR 頭戴裝置的軟體，並透過像 OpenXR 這類 API 對外提供服務。舉例來說：

source: for Steam this is SteamVR,
fr: pour Steam il s'agit de SteamVR,
ga: le haghaidh Gaile is é seo SteamVR,
it: Per Steam questo è Steam VR,
ru: для Steam это SteamVR,
ta: நீராவிக்கு இது நீராவி,
uk: для Steam це SteamVR,
zh_cn: 对于 Steam，这是 SteamVR，
zh_hant: Steam 平台即為 SteamVR，

source: for Meta on desktop this is the Oculus Client (including when using Quest link),
ga: le haghaidh Meta ar an deasc is é seo an Cliant Oculus (lena n-áirítear nuair a úsáidtear nasc Quest),
it: per Meta su desktop questo è il client Oculus (anche quando si utilizza Quest link),
ru: для Meta на десктопе это Oculus Client (в том числе при использовании Quest Link),
ta: டெச்க்டாப்பில் மெட்டாவுக்கு இது ஓக்குலச் வாங்கி (குவெச்ட் இணைப்பைப் பயன்படுத்தும் போது உட்பட),
uk: для Meta на настільному комп’ютері це клієнт Oculus (включно з використанням посилання Quest),
zh_cn: 对于桌面上的 Meta，这是 Oculus 客户端(包括使用 Quest link 时)，
zh_hant: 桌面端的 Meta 是 Oculus Client（包含使用 Quest Link 時），

source: for Meta on Quest this is the Quest's native OpenXR client,
fr: pour Meta sur Quest, il s'agit du client OpenXR natif du Quest,
ga: le haghaidh Meta on Quest is é seo cliant dúchais OpenXR an Quest,
it: per Meta su Quest questo è il client OpenXR nativo di Quest,
ru: для Meta on Quest это собственный клиент OpenXR от Quest,
ta: மேவு ஆன் குவெச்ட் இது குவெச்டின் சொந்த ஓபன்எக்ச்ஆர் கிளையன்ட்,
uk: для Meta on Quest це рідний клієнт Quest OpenXR,
zh_cn: 对于 Quest 上的 Meta，这是 Quest 的本地 OpenXR 客户端，
zh_hant: Quest 上的 Meta 則是 Quest 原生 OpenXR 客戶端，

source: on Linux this could be Monado, etc.
fr: sur Linux cela pourrait être Monado, etc...
ga: ar Linux d'fhéadfadh sé seo a bheith Monado, etc.
it: su Linux potrebbe essere Monado, ecc.
ru: в Linux это может быть Monado и т. д.
ta: லினக்சில் இது மோனாடோ, முதலியன.
uk: у Linux це може бути Monado тощо.
zh_cn: 在 Linux 上，这可能是 Monado 等。
zh_hant: 在 Linux 上則可能是 Monado 等。

source: The action map allows us to organize our actions in sets. Each set can be enabled or disabled on its own.
ga: Ligeann an léarscáil gníomhaíochta dúinn ár ngníomhartha a eagrú i dtacair. Is féidir gach tacar a chumasú nó a dhíchumasú leis féin.
it: La mappa delle azioni ci permette di organizzare le nostre azioni in insiemi. Ogni insieme può essere abilitato o disabilitato singolarmente.
ru: Карта действий позволяет нам организовывать действия в наборы. Каждый набор можно включать и отключать по отдельности.
ta: செயல் வரைபடம் எங்கள் செயல்களை செட்களில் ஒழுங்கமைக்க அனுமதிக்கிறது. ஒவ்வொரு தொகுப்பையும் சொந்தமாக இயக்கலாம் அல்லது முடக்கலாம்.
uk: Карта дій дозволяє нам організувати наші дії за наборами. Кожен набір можна ввімкнути або вимкнути самостійно.
zh_cn: 行动地图允许我们组织我们的行动。每组都可以单独启用或禁用。
zh_hant: 動作對應可以將動作分組為多個動作集，每組皆可獨立啟用或停用。

source: The concept here is that you could have different sets that provide bindings in different scenarios. You could have:
ga: Is é an coincheap anseo ná go bhféadfadh tacair éagsúla a bheith agat a sholáthraíonn ceangail i gcásanna éagsúla. D'fhéadfá:
it: Il concetto qui è che si potrebbero avere diversi insiemi che forniscono associazioni in scenari diversi. Si potrebbe avere:
ru: Идея здесь заключается в том, что можно использовать разные наборы, обеспечивающие привязки в разных сценариях. Например:
ta: இங்குள்ள கருத்து என்னவென்றால், வெவ்வேறு சூழ்நிலைகளில் பிணைப்புகளை வழங்கும் வெவ்வேறு தொகுப்புகளை நீங்கள் வைத்திருக்க முடியும். உங்களிடம் இருக்கலாம்:
uk: Ідея полягає в тому, що ви можете мати різні набори, які забезпечують прив’язки в різних сценаріях. Ви можете мати:
zh_cn: 这里的概念是，在不同的场景中，可以有不同的集合来提供绑定。你可以:
zh_hant: 可根據不同情境設計多組動作集，例如：

source: a ``Character control`` set for when you're walking around,
ga: tacar ''Rialú carachtar'' nuair a bhíonn tú ag siúl thart,
it: un insieme ``Character control`` per quando si cammina,
ru: набор ``Character control`` для тех случаев, когда вы ходите,
ta: நீங்கள் சுற்றி நடக்கும்போது ஒரு `` எழுத்துக்குறி கட்டுப்பாடு` `அமைக்கவும்,
uk: набір ``Character control``, коли ви ходите,
zh_hant: 「角色控制」動作集，對應玩家自由移動時，

source: a ``Vehicle control`` set for when you're operating a vehicle,
ga: socrú ''Rialú feithicle'' nuair atá feithicil á hoibriú agat,
it: un insieme ``Vehicle control`` per quando si guida un veicolo,
ru: ``Vehicle control``, установленное для случаев, когда вы управляете транспортным средством,
ta: நீங்கள் ஒரு வாகனத்தை இயக்கும்போது ஒரு `` வாகனக் கட்டுப்பாடு ஏற்படுகிறது,
uk: набір ``Керування транспортним засобом``, коли ви керуєте транспортним засобом,
zh_hant: 「載具控制」動作集，對應駕駛載具時，

source: a ``Menu`` set for when a menu is open.
ga: socraigh ''Menu'' nuair a bhíonn roghchlár ar oscailt.
it: un insieme ``Menu`` quando un menu è aperto.
ru: ``Menu`` устанавливается, когда меню открыто.
ta: பட்டியல் திறந்திருக்கும் போது ஒரு `` மெனு`` அமைக்கவும்.
uk: набір ``Меню``, коли меню відкрито.
zh_hant: 「選單」動作集，對應開啟遊戲選單時。

source: Only the action set applicable to the current state of your game/application can then be enabled.
ga: Ní féidir ach an tacar gníomhaíochta is infheidhme maidir le staid reatha do chluiche / d'iarratais a chumasú ansin.
it: Sarà quindi possibile abilitare solo l'insieme di azioni applicabile allo stato attuale del gioco/applicazione.
ru: После этого можно будет включить только тот набор действий, который применим к текущему состоянию вашей игры/приложения.
ta: உங்கள் விளையாட்டு/பயன்பாட்டின் தற்போதைய நிலைக்கு பொருந்தக்கூடிய செயல் தொகுப்பு மட்டுமே செயல்படுத்தப்படலாம்.
uk: Після цього можна ввімкнути лише набір дій, застосовний до поточного стану вашої гри/програми.
zh_hant: 每次僅啟用適用於遊戲/應用目前狀態的動作集。
