Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_action_map.po
Languages: fr, ga, it, ru, ta, uk, zh_cn, zh_hant

source: You shouldn't bind multiple actions of the same action set to the same controller input. If you do this, or if actions are bound from multiple action sets but they have overlapping priorities, the behavior is undefined. The XR runtime may simply not accept your action map, or it may take this on a first come first serve basis.
ga: Níor chóir duit ilghníomhartha den ghníomh céanna a leagtar ar an ionchur rialaitheora céanna a cheangal. Má dhéanann tú é seo, nó má tá gníomhartha faoi cheangal ó thacair ghníomhaíochta éagsúla ach go bhfuil tosaíochtaí forluiteacha acu, níl an t-iompar cinnte. B'fhéidir nach nglacfaidh am rite XR le do léarscáil ghníomhaíochta, nó d'fhéadfadh sé é seo a dhéanamh ar bhonn tús freastail ar dtús.
it: Non dovresti associare più azioni dello stesso insieme di azioni allo stesso input del controller. Se lo fai, o se le azioni sono associate a più insiemi di azioni ma hanno priorità sovrapposte, il comportamento non è definito. Il runtime XR potrebbe non accettare la tua mappa di azioni, oppure potrebbe accettarla secondo il principio "chi primo arriva meglio alloggia".
ru: Не следует привязывать несколько действий из одного набора к одному входу контроллера. В этом случае, или если действия привязаны из нескольких наборов действий с перекрывающимися приоритетами, поведение не определено. Среда выполнения XR может просто не принять вашу карту действий или будет принимать её в порядке живой очереди.
ta: ஒரே கட்டுப்பாட்டு உள்ளீட்டில் அமைக்கப்பட்ட ஒரே செயலின் பல செயல்களை நீங்கள் பிணைக்கக்கூடாது. நீங்கள் இதைச் செய்தால், அல்லது செயல்கள் பல செயல் தொகுப்புகளிலிருந்து பிணைக்கப்பட்டிருந்தால், ஆனால் அவற்றில் ஒன்றுடன் ஒன்று முன்னுரிமைகள் இருந்தால், நடத்தை வரையறுக்கப்படவில்லை. எக்ச்ஆர் இயக்க நேரம் உங்கள் செயல் வரைபடத்தை ஏற்றுக்கொள்ளக்கூடாது, அல்லது இதை முதலில் வந்த முதல் பணி அடிப்படையில் எடுக்கலாம்.
uk: Ви не повинні прив’язувати кілька дій одного набору дій до одного входу контролера. Якщо ви це зробите або якщо дії пов’язані з кількома наборами дій, але вони мають збігаються пріоритети, поведінка буде невизначеною. Середовище виконання XR може просто не прийняти вашу карту дій або прийняти її за принципом «хто прийшов, перший обслужився».
zh_hant: 請勿將同一動作集的多個動作綁定到同一控制器輸入。若跨動作集且優先權重疊，行為未定義，部分 XR 執行環境甚至可能拒絕載入你的動作對應，或只採用最先匹配的設定。

source: We are still investigating the restrictions around binding multiple actions to the same output as this scenario makes sense. The OpenXR specification seems to not allow this.
ga: Táimid fós ag fiosrú na srianta a bhaineann le gníomhartha iomadúla ceangailteacha ar an aschur céanna agus atá ciall leis an gcás seo. Is cosúil nach gceadaíonn an tsonraíocht OpenXR é seo.
it: Stiamo ancora valutando le restrizioni relative all'associazione di più azioni allo stesso output, poiché questo scenario ha senso. La specifica OpenXR sembra non consentirlo.
ru: Мы всё ещё изучаем ограничения, связанные с привязкой нескольких действий к одному и тому же выходу, поскольку этот сценарий имеет смысл. Спецификация OpenXR, похоже, не допускает этого.
ta: இந்த சூழ்நிலை அர்த்தமுள்ளதாக இருப்பதால், பல செயல்களை ஒரே வெளியீட்டில் பிணைப்பது தொடர்பான கட்டுப்பாடுகளை நாங்கள் இன்னும் ஆராய்ந்து வருகிறோம். OpenXR விவரக்குறிப்பு இதை அனுமதிக்கவில்லை.
uk: Ми все ще вивчаємо обмеження щодо прив’язки кількох дій до одного результату, оскільки цей сценарій має сенс. Здається, специфікація OpenXR не дозволяє цього.
zh_cn: 我们仍在研究将多个动作绑定到同一个输出的限制，因为这种场景是有意义的。OpenXR 规范似乎不允许这样做。
zh_hant: 我們仍在研究多個動作綁定到同一輸出的限制，雖然場景合理，但 OpenXR 規範目前似乎不允許。

source: Now that we have our basic actions defined, it's time to hook them up.
ga: Anois go bhfuil ár ngníomhartha bunúsacha sainithe againn, tá sé in am iad a chur suas.
it: Ora che abbiamo definito le nostre azioni di base, è il momento di collegarle.
ru: Теперь, когда мы определили основные действия, пришло время их подключить.
ta: இப்போது எங்கள் அடிப்படை செயல்கள் வரையறுக்கப்பட்டுள்ளன, அவற்றைக் கவர்ந்திழுக்கும் நேரம் இது.
uk: Тепер, коли ми визначили основні дії, настав час їх підключити.
zh_cn: 既然我们已经定义了基本的动作，那么是时候把它们连接起来了。
zh_hant: 基礎動作定義完成後，接下來要設定對應關聯。

source: Profiles
fr: Profils
ga: Próifílí
it: Profili
ta: சுயவிவரங்கள்
uk: Профілі
zh_cn: 配置文件
zh_hant: 設定檔

source: In OpenXR controller bindings are captured in so-called "Interaction Profiles". We've shortened it to "Profiles" because it takes up less space.
ru: В OpenXR привязки контроллеров хранятся в так называемых "Профилях взаимодействия". Мы сократили название до "Profiles", поскольку это занимает меньше места.
uk: У OpenXR прив’язки контролера фіксуються в так званих «Профілях взаємодії». Ми скоротили його до «Профілів», оскільки він займає менше місця.
zh_hant: 在 OpenXR 中，控制器綁定由「互動設定檔（Interaction Profile）」管理。為簡潔起見以下皆簡稱「設定檔」。

source: This generic name is chosen because controllers don't cover the entire system. Currently there are also profiles for trackers, remotes and tracked pens. There are also provisions for devices such as treadmills, haptic vests and such even though those are not part of the specification yet.
ga: Roghnaítear an t-ainm cineálach seo toisc nach gclúdaíonn rialaitheoirí an córas iomlán. Faoi láthair tá próifílí ann freisin do lorgairí, cianda agus pinn rianúcháin. Tá forálacha ann freisin maidir le feistí ar nós treadmills, veisteanna haptic agus a leithéid cé nach bhfuil siad sin mar chuid den tsonraíocht go fóill.
ru: Такое общее название выбрано потому, что контроллеры не охватывают всю систему. В настоящее время существуют также профили для трекеров, пультов дистанционного управления и отслеживаемых ручек. Также предусмотрены такие устройства, как беговые дорожки, тактильные жилеты и т.п., хотя они пока не включены в спецификацию.
ta: கட்டுப்பாட்டாளர்கள் முழு அமைப்பையும் மறைக்காததால் இந்த பொதுவான பெயர் தேர்வு செய்யப்படுகிறது. தற்போது டிராக்கர்கள், ரிமோட்டுகள் மற்றும் கண்காணிக்கப்பட்ட பேனாக்களுக்கான சுயவிவரங்களும் உள்ளன. டிரெட்மில்ச், ஆப்டிக் உள்ளாடைகள் போன்ற சாதனங்களுக்கான ஏற்பாடுகளும் உள்ளன, அவை இன்னும் விவரக்குறிப்பின் பகுதியாக இல்லை என்றாலும்.
uk: Цю загальну назву обрано тому, що контролери не охоплюють всю систему. На даний момент також існують профілі для трекерів, пультів і гусеничних ручок. Існують також положення щодо таких пристроїв, як бігові доріжки, тактильні жилети тощо, хоча вони ще не є частиною специфікації.
zh_cn: 选择这个通用名称是因为控制器不能覆盖整个系统。目前也有跟踪器、遥控器和跟踪笔的配置文件。对于跑步机、触觉背心等设备也有规定，尽管这些还不是规范的一部分。
zh_hant: 之所以用這種通用名稱，是因為設定檔不僅限於控制器，還包含追蹤器、遙控器、追蹤筆，甚至未來可能支援跑步機、觸覺背心等。

source: It is important to know that OpenXR has strict checking on supported devices. The core specification identifies a number of controllers and similar devices with their supported inputs and outputs. Every XR runtime must accept these interaction profiles even if they aren't applicable.
ga: Tá sé tábhachtach go mbeadh a fhios agat go bhfuil seiceáil dhian ag OpenXR ar ghléasanna tacaithe. Aithníonn an tsonraíocht lárnach roinnt rialaitheoirí agus feistí comhchosúla lena n-ionchuir agus aschuir tacaithe. Ní mór do gach rith-am XR glacadh leis na próifílí idirghníomhaíochta seo fiú mura bhfuil siad infheidhme.
ru: Важно знать, что OpenXR строго проверяет поддерживаемые устройства. Базовая спецификация определяет ряд контроллеров и аналогичных устройств с их поддерживаемыми входами и выходами. Каждая среда выполнения XR должна принимать эти профили взаимодействия, даже если они неприменимы.
ta: OpenXR உதவி சாதனங்களில் கண்டிப்பாக சோதனை செய்கிறது என்பதை அறிந்து கொள்வது தேவை. முக்கிய விவரக்குறிப்பு பல கட்டுப்பாட்டாளர்கள் மற்றும் ஒத்த சாதனங்களை அவற்றின் உதவி உள்ளீடுகள் மற்றும் வெளியீடுகளுடன் அடையாளம் காட்டுகிறது. ஒவ்வொரு எக்ச்ஆர் இயக்க நேரமும் இந்த தொடர்பு சுயவிவரங்கள் பொருந்தவில்லை என்றாலும் அவற்றை ஏற்க வேண்டும்.
uk: Важливо знати, що OpenXR суворо перевіряє підтримувані пристрої. Основна специфікація визначає низку контролерів і подібних пристроїв з їх підтримуваними входами та виходами. Кожне середовище виконання XR має приймати ці профілі взаємодії, навіть якщо вони не застосовуються.
zh_cn: 要知道 OpenXR 对支持的设备有严格的检查，这一点很重要。核心规范确定了许多控制器和类似设备及其支持的输入和输出。每个 XR 运行时都必须接受这些交互配置文件，即使它们不适用。
zh_hant: 需注意，OpenXR 對已支援的硬體裝置有嚴格檢查。標準規範列明數種控制器與其所支援的輸入/輸出，每種 XR 執行環境都必須接受這些設定檔（即使不一定有該硬體）。

source: New devices are added through extensions and XR runtimes must specify which ones they support. XR runtimes that do not support a device added through extensions will not accept these profiles. XR runtimes that do not support added input or output types will often crash if supplied.
ga: Cuirtear gléasanna nua leis trí shíntí agus ní mór do runtimes XR na cinn a dtacaíonn siad leo a shonrú. Ní ghlacfaidh am rite XR nach dtacaíonn le gléas a chuirtear leis trí shíntí leis na próifílí seo. Is minic a thuairteálfaidh am rite XR nach dtacaíonn le cineálacha ionchuir nó aschuir breise má sholáthraítear iad.
ru: Новые устройства добавляются через расширения, и среды выполнения XR должны указывать, какие из них они поддерживают. Среды выполнения XR, не поддерживающие устройства, добавленные через расширения, не будут принимать эти профили. Среды выполнения XR, не поддерживающие добавленные типы входных или выходных данных, часто приводят к сбоям при их наличии.
ta: நீட்டிப்புகள் மூலம் புதிய சாதனங்கள் சேர்க்கப்படுகின்றன மற்றும் எக்ச்ஆர் ரன் டைம்கள் அவை எதை ஆதரிக்கின்றன என்பதைக் குறிப்பிட வேண்டும். நீட்டிப்புகள் மூலம் சேர்க்கப்பட்ட சாதனத்தை ஆதரிக்காத எக்ச்ஆர் ரன் டைம்கள் இந்த சுயவிவரங்களை ஏற்காது. சேர்க்கப்பட்ட உள்ளீடு அல்லது வெளியீட்டு வகைகளை ஆதரிக்காத எக்ச்ஆர் ரன் டைம்கள் வழங்கப்பட்டால் பெரும்பாலும் செயலிழக்கும்.
uk: Нові пристрої додаються через розширення, а середовища виконання XR повинні вказувати, які з них вони підтримують. Середи виконання XR, які не підтримують пристрій, доданий через розширення, не сприйматимуть ці профілі. Середи виконання XR, які не підтримують додані типи вводу або виводу, часто аварійно завершують роботу.
zh_cn: 新设备是通过扩展添加的，XR 运行时必须指定它们支持哪些设备。不支持通过扩展添加的设备的 XR 运行时将不接受这些配置文件。不支持添加的输入或输出类型的 XR 运行时通常会崩溃。
zh_hant: 新裝置會經由擴充功能新增，XR 執行環境需明確告知支援清單。不支援的裝置設定檔會被拒絕，若載入不支援的輸入/輸出型別甚至可能導致系統崩潰。

source: As such Godot keeps meta data of all available devices, their inputs and outputs and which extension adds support for them. You can create interaction profiles for all devices you wish to support. Godot will filter out those not supported by the XR runtime the user is using.
ga: Mar sin, coinníonn Godot meiteashonraí de na gléasanna go léir atá ar fáil, a n-ionchuir agus a n-aschuir agus a chuireann tacaíocht ar fáil dóibh. Is féidir leat próifílí idirghníomhaíochta a chruthú do gach gléas ar mian leat tacú leo. Déanfaidh Godot scagadh orthu siúd nach dtacaíonn an rith-am XR atá á úsáid ag an úsáideoir leo.
ru: Таким образом, Godot хранит метаданные всех доступных устройств, их входов и выходов, а также информацию о том, какие расширения поддерживают их. Вы можете создать профили взаимодействия для всех устройств, которые хотите поддерживать. Godot отфильтрует те, которые не поддерживаются средой выполнения XR, используемой пользователем.
ta: இதுபோன்ற கோடோட் கிடைக்கக்கூடிய அனைத்து சாதனங்களின் மேவு தரவை வைத்திருக்கிறது, அவற்றின் உள்ளீடுகள் மற்றும் வெளியீடுகள் மற்றும் எந்த நீட்டிப்பு அவர்களுக்கு ஆதரவை சேர்க்கிறது. நீங்கள் ஆதரிக்க விரும்பும் அனைத்து சாதனங்களுக்கும் தொடர்பு சுயவிவரங்களை உருவாக்கலாம். கோடோட் பயனர் பயன்படுத்தும் எக்ச்ஆர் இயக்க நேரத்தால் ஆதரிக்கப்படாதவர்களை வடிகட்டுவார்.
uk: Таким чином, Godot зберігає метадані всіх доступних пристроїв, їхні входи та виходи, а також те, яке розширення додає підтримку для них. Ви можете створити профілі взаємодії для всіх пристроїв, які бажаєте підтримувати. Godot відфільтровує ті, які не підтримуються середовищем виконання XR, яке використовує користувач.
zh_hant: 因此 Godot 會保存所有可用裝置的 meta 資料、輸入/輸出列表，以及支援來源擴充。你可為欲支援裝置建立設定檔，Godot 會自動排除使用者執行環境不支援的部分。

source: This does mean that in order to support new devices, you might need to update to a more recent version of Godot.
ga: Ciallaíonn sé seo go mb'fhéidir go mbeadh ort nuashonrú a dhéanamh ar leagan níos déanaí de Godot chun tacú le gléasanna nua.
ru: Это означает, что для поддержки новых устройств вам может потребоваться обновить Godot до более новой версии.
ta: புதிய சாதனங்களை ஆதரிக்க, நீங்கள் கோடோட்டின் அண்மைக் கால பதிப்பிற்கு புதுப்பிக்க வேண்டியிருக்கும்.
uk: Це означає, що для підтримки нових пристроїв вам може знадобитися оновлення до новішої версії Godot.
zh_cn: 这意味着为了支持新的设备，你可能需要升级到最新版本的Godot。
zh_hant: 換言之，若要支援新裝置，可能需更新至較新版本的 Godot。

source: It is however also important to note that the action map has been designed with this in mind. When new devices enter the market, or when your users use devices that you do not have access to, the action map system relies on the XR runtime. It is the XR runtime's job to choose the best fitting interaction profile that has been specified and adapt it for the controller the user is using.
ga: Tá sé tábhachtach a thabhairt faoi deara freisin, áfach, gur dearadh an léarscáil ghníomhaíochta leis seo san áireamh. Nuair a théann gléasanna nua isteach sa mhargadh, nó nuair a úsáideann d'úsáideoirí gléasanna nach bhfuil rochtain agat orthu, braitheann an córas léarscáile gníomhaíochta ar am rite XR. Is é post an runtime XR an phróifíl idirghníomhaíochta is oiriúnaí a roghnú a sonraíodh agus é a oiriúnú don rialaitheoir atá á úsáid ag an úsáideoir.
ru: Однако важно отметить, что карта действий была разработана с учётом этого. Когда на рынке появляются новые устройства или ваши пользователи используют устройства, к которым у вас нет доступа, система карты действий опирается на среду выполнения XR. Задача среды выполнения XR — выбрать наиболее подходящий профиль взаимодействия из указанных и адаптировать его к контроллеру, используемому пользователем.
ta: இருப்பினும், செயல் வரைபடம் இதை மனதில் கொண்டு வடிவமைக்கப்பட்டுள்ளது என்பதையும் கவனத்தில் கொள்ள வேண்டும். புதிய சாதனங்கள் சந்தையில் நுழையும்போது, அல்லது உங்கள் பயனர்கள் உங்களுக்கு அணுகாத சாதனங்களைப் பயன்படுத்தும்போது, செயல் வரைபட அமைப்பு எக்ச்ஆர் இயக்க நேரத்தை நம்பியுள்ளது. குறிப்பிடப்பட்டுள்ள சிறந்த பொருத்துதல் தொடர்பு சுயவிவரத்தைத் தேர்ந்தெடுப்பது மற்றும் பயனர் பயன்படுத்தும் கட்டுப்படுத்திக்கு மாற்றியமைப்பது எக்ச்ஆர் இயக்க நேரத்தின் வேலை.
uk: Однак також важливо зазначити, що карту дій було розроблено з урахуванням цього. Коли нові пристрої з’являються на ринку або коли ваші користувачі використовують пристрої, до яких у вас немає доступу, система карт дій покладається на середовище виконання XR. Завдання середовища виконання XR — вибрати найкращий профіль взаємодії, який було зазначено, і адаптувати його для контролера, який використовує користувач.
zh_hant: 設計上動作對應系統已考慮此狀況。新裝置推出，或用戶使用你無法測試的裝置時，最終決定權在 XR 執行環境。它會自動選擇最合適的設定檔並做對應調整。

source: How the XR runtime does this is left to the implementation of the runtime and there are thus vast differences between the runtimes. Some runtimes might even permit users to edit the bindings themselves.
ga: Conas a dhéanann an runtime XR é seo a fhágáil le cur i bhfeidhm an runtime agus dá bhrí sin tá difríochtaí móra idir na runtimes. D'fhéadfadh roinnt runtimes cead a thabhairt d'úsáideoirí na ceangail féin a chur in eagar.
ru: То, как это делает среда выполнения XR, зависит от её реализации, поэтому между средами выполнения существуют существенные различия. Некоторые среды выполнения даже позволяют пользователям самостоятельно редактировать привязки.
ta: எக்ச்ஆர் இயக்க நேரம் இது இயக்க நேரத்தை செயல்படுத்துவதற்கு எவ்வாறு விடப்படுகிறது, இதனால் ரன் டைம்களுக்கு இடையே பரந்த வேறுபாடுகள் உள்ளன. சில ரன் டைம்கள் பயனர்களை பிணைப்புகளைத் திருத்த அனுமதிக்கக்கூடும்.
uk: Те, як середовище виконання XR це робить, залежить від реалізації середовища виконання, тому між середовищами виконання існують великі відмінності. Деякі середовища виконання можуть навіть дозволяти користувачам самостійно редагувати прив’язки.
zh_cn: XR 运行时如何做到这一点取决于运行时的实现，因此运行时之间有很大的差异。一些运行时甚至允许用户自己编辑绑定。
zh_hant: XR 執行環境如何翻配設定檔屬於實作細節，各家差異很大。有些甚至允許用戶端自行編輯動作綁定。

source: A common approach for a runtime is to look for a matching interaction profile first. If this is not found it will check the most common profiles such as that of the "Touch controller" and do a conversion. If all else fails, it will check the generic :ref:`"Simple controller" <doc_xr_action_map_simple>`.
ga: Cur chuige coitianta le haghaidh am rite is ea próifíl idirghníomhaíochta meaitseála a lorg ar dtús. Mura n-aimsítear é seo seiceálfaidh sé na próifílí is coitianta, mar shampla an "rialtóir dteagmháil" agus déanfaidh sé tiontú. Má theipeann ar gach rud eile, seiceálfaidh sé an cineálach :ref:`"Rialaitheoir simplí" <doc_xr_action_map_simple>`.
ru: Распространённый подход для среды выполнения — сначала найти соответствующий профиль взаимодействия. Если он не найден, она проверит наиболее распространённые профили, например, профиль "Touch controller", и выполнит преобразование. Если всё вышеперечисленное не удаётся, она проверит общий профиль :ref:`"Simple controller" <doc_xr_action_map_simple>`.
ta: இயக்க நேரத்திற்கான பொதுவான அணுகுமுறை முதலில் பொருந்தக்கூடிய தொடர்பு சுயவிவரத்தைத் தேடுவது. இது காணப்படாவிட்டால், அது "டச் கன்ட்ரோலர்" போன்ற பொதுவான சுயவிவரங்களை சரிபார்த்து ஒரு மாற்றத்தை செய்யும். மற்ற அனைத்தும் தோல்வியுற்றால், அது பொதுவானதை சரிபார்க்கும்: ref: `" எளிய கட்டுப்படுத்தி "<doc_xr_action_map_simple>`.
uk: Загальний підхід до середовища виконання полягає в тому, щоб спочатку знайти відповідний профіль взаємодії. Якщо цього не знайдено, він перевірить найпоширеніші профілі, такі як «Touch controller», і виконає перетворення. Якщо нічого не допомагає, він перевірить загальний :ref:`"Simple controller" <doc_xr_action_map_simple>`.
zh_hant: 常見做法是先尋找完全匹配的設定檔，找不到則退而求其次使用如「Touch 控制器」等常見檔案，最終再 fallback 到 :ref:`「簡單控制器」<doc_xr_action_map_simple>`。

source: There is an important conclusion to be made here: When a controller is found, and the action map is applied to it, the XR runtime is not limited to the exact configurations you set up in Godot's action map editor. While the runtime will generally choose a suitable mapping based on one of the bindings you set up in the action map, it can deviate from it.
ga: Tá conclúid thábhachtach le déanamh anseo: Nuair a aimsítear rialtóir, agus nuair a chuirtear an léarscáil ghníomhaíochta i bhfeidhm air, níl am rite XR teoranta do na cumraíochtaí beachta a bhunaigh tú in eagarthóir léarscáil gníomhaíochta Godot. Cé go roghnóidh an t-am rite mapáil oiriúnach de ghnáth bunaithe ar cheann de na ceangail a bhunaigh tú sa léarscáil gníomhaíochta, is féidir leis imeacht uaidh.
ru: Здесь следует сделать важный вывод: когда контроллер найден и к нему применена карта действий, среда выполнения XR не ограничена точными конфигурациями, заданными в редакторе карт действий Godot. Хотя среда выполнения обычно выбирает подходящее сопоставление на основе одной из привязок, заданных в карте действий, она может отклоняться от него.
ta: இங்கே ஒரு முக்கியமான முடிவு உள்ளது: ஒரு கட்டுப்படுத்தி கண்டுபிடிக்கப்பட்டதும், அதற்காக செயல் வரைபடம் பயன்படுத்தப்படும்போது, எக்ச்ஆர் இயக்க நேரம் கோடோட்டின் அதிரடி வரைபட எடிட்டரில் நீங்கள் அமைத்த சரியான உள்ளமைவுகளுக்கு மட்டுப்படுத்தப்படவில்லை. செயல் வரைபடத்தில் நீங்கள் அமைத்த பிணைப்புகளில் ஒன்றின் அடிப்படையில் இயக்க நேரம் பொதுவாக பொருத்தமான மேப்பிங்கைத் தேர்வு செய்யும், அது அதிலிருந்து விலகலாம்.
uk: Тут слід зробити важливий висновок: коли контролер знайдено та до нього застосовано карту дій, час виконання XR не обмежується точними конфігураціями, які ви встановили в редакторі карти дій Godot. Хоча середовище виконання зазвичай вибирає відповідне відображення на основі одного з прив’язок, які ви встановили в карті дій, воно може відхилятися від нього.
zh_hant: 重點在於：當 XR 執行環境偵測到控制器並套用動作對應時，不會嚴格按照 Godot 動作對應編輯器設定，通常會以你的設定為參考，必要時主動做出調整。

source: For example, when the Touch controller profile is used any of the following scenarios could be true:
ga: Mar shampla, nuair a úsáidtear próifíl an rialaitheora tadhaill d'fhéadfadh aon cheann de na cásanna seo a leanas a bheith fíor:
it: Ad esempio, quando è utilizzato il profilo del controller Touch, potrebbe avvenire uno qualsiasi dei seguenti scenari:
ru: Например, при использовании профиля "Touch controller" может иметь место любой из следующих сценариев:
ta: எடுத்துக்காட்டாக, டச் கன்ட்ரோலர் சுயவிவரம் பயன்படுத்தப்படும்போது பின்வரும் காட்சிகளில் ஏதேனும் உண்மையாக இருக்கலாம்:
uk: Наприклад, коли використовується профіль сенсорного контролера, може мати місце будь-який із наведених нижче сценаріїв:
zh_cn: 例如，当使用触摸控制器配置文件时，以下任何一种情况都可能发生:
zh_hant: 舉例來說，當使用 Touch 控制器設定檔時，可能出現下列任何一種狀況：

source: we could be using a Quest 1 controller,
ga: d'fhéadfaimis a bheith ag baint úsáide as rialtóir Quest 1,
it: potremmo star usando un controller Quest 1,
ru: мы могли бы использовать контроллер Quest 1,
ta: நாங்கள் குவெச்ட் 1 கட்டுப்படுத்தியைப் பயன்படுத்தலாம்,
uk: ми могли б використовувати контролер Quest 1,
zh_hant: 可能是 Quest 1 控制器，

source: we could be using a Quest 2 controller,
ga: d'fhéadfaimis a bheith ag baint úsáide as rialtóir Quest 2,
it: potremmo star usando un controller Quest 2,
ru: мы могли бы использовать контроллер Quest 2,
ta: நாங்கள் குவெச்ட் 2 கட்டுப்படுத்தியைப் பயன்படுத்தலாம்,
uk: ми могли б використовувати контролер Quest 2,
zh_hant: 也可能是 Quest 2 控制器，

source: we could be using a Quest Pro controller but no Quest Pro profile was given or the XR runtime being used does not support the Quest Pro controller,
fr: nous pourrions utiliser un contrôleur Quest Pro, mais aucun profil Quest Pro n'a été donné ou l'environnement d'exécution XR n'est pas compatible avec le contrôleur Quest Pro,
ga: d'fhéadfaimis a bheith ag baint úsáide as rialtóir Quest Pro ach níor tugadh aon phróifíl Quest Pro nó ní thacaíonn an runtime XR atá á úsáid leis an rialtóir Quest Pro,
it: potremmo star usando un controller Quest Pro ma nessun profilo Quest Pro è stato fornito oppure il runtime XR utilizzato non supporta il controller Quest Pro,
ru: мы могли использовать контроллер Quest Pro, но профиль Quest Pro не был предоставлен, или используемая среда выполнения XR не поддерживает контроллер Quest Pro,
ta: நாங்கள் ஒரு குவெச்ட் புரோ கன்ட்ரோலரைப் பயன்படுத்தலாம், ஆனால் எந்த குவெச்ட் புரோ சுயவிவரமும் வழங்கப்படவில்லை அல்லது எக்ச்ஆர் இயக்க நேரம் பயன்படுத்தப்படுவது குவெச்ட் புரோ கன்ட்ரோலரை ஆதரிக்காது,
uk: ми могли використовувати контролер Quest Pro, але не було надано профілю Quest Pro або використовуване середовище виконання XR не підтримує контролер Quest Pro,
zh_cn: 我们可以使用 Quest Pro 控制器，但没有提供 Quest Pro 配置文件，或者使用的 XR 运行时不支持 Quest Pro 控制器，
zh_hant: 或可能是 Quest Pro 控制器，但沒提供 Quest Pro 設定檔，或當前 XR 執行環境尚未支援 Quest Pro，

source: it could be a completely different controller for which no profile was given but the XR runtime is using the touch bindings as a base.
ga: d'fhéadfadh sé a bheith ina rialtóir go hiomlán difriúil nár tugadh aon phróifíl dó ach tá an rith-am XR ag baint úsáide as na ceangail tadhaill mar bhonn.
it: potrebbe essere controller completamente diverso per il quale nessun profilo è stato fornito, ma il runtime XR utilizza le associazioni touch come base.
ru: это может быть совершенно другой контроллер, для которого не предоставлен профиль, но среда выполнения XR использует сенсорные привязки в качестве базы.
ta: இது முற்றிலும் மாறுபட்ட கட்டுப்படுத்தியாக இருக்கலாம், அதற்காக எந்த சுயவிவரமும் வழங்கப்படவில்லை, ஆனால் எக்ச்ஆர் இயக்க நேரம் டச் பிணைப்புகளை ஒரு தளமாகப் பயன்படுத்துகிறது.
uk: це може бути зовсім інший контролер, для якого не було надано жодного профілю, але середовище виконання XR використовує сенсорні прив’язки як основу.
zh_cn: 它可能是一个完全不同的控制器，没有给出配置文件，但是 XR 运行时使用触摸绑定作为基础。
zh_hant: 甚至可能是完全不同的控制器，但 XR 執行環境以 touch 綁定作為參考。
