Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_action_map.po
Languages: fr, ga, it, ru, ta, uk, zh_cn, zh_hant

source: It is the recommendation from the OpenXR Working Group that only bindings for controllers actually tested by the developer are setup. The XR runtimes are designed with this in mind. They can perform a better job of rebinding a provided binding than a developer can make educated guesses. Especially as the developer can't test if this leads to a comfortable experience for the end user.
ga: Is é an moladh ón nGrúpa Oibre OpenXR nach bhfuil ach ceangail do rialaitheoirí a ndearna an forbróir tástáil orthu i ndáiríre socraithe. Tá na runtimes XR deartha leis seo san áireamh. Is féidir leo post níos fearr a dhéanamh chun ceangal a chur ar fáil ná mar is féidir le forbróir buille faoi thuairim oilte a dhéanamh. Go háirithe mar nach féidir leis an bhforbróir tástáil a dhéanamh má eascraíonn taithí chompordach as seo don úsáideoir deiridh.
ru: Рабочая группа OpenXR рекомендует настраивать только привязки для контроллеров, действительно протестированных разработчиком. Среды выполнения XR разработаны с учётом этого. Они могут лучше выполнить перепривязку предоставленной привязки, чем разработчик может делать обоснованные предположения. Тем более, что разработчик не может проверить, насколько это удобно для конечного пользователя.
ta: டெவலப்பரால் உண்மையில் சோதிக்கப்பட்ட கட்டுப்படுத்திகளுக்கான பிணைப்புகள் மட்டுமே அமைக்கப்படுகின்றன என்பது ஓபன்எக்ச்ஆர் பணிக்குழுவின் பரிந்துரையாகும். எக்ச்ஆர் ரன் டைம்கள் இதை மனதில் கொண்டு வடிவமைக்கப்பட்டுள்ளன. ஒரு உருவாக்குபவர் படித்த யூகங்களைச் செய்யக்கூடியதை விட வழங்கப்பட்ட பிணைப்புக்கு மறுதொடக்கம் செய்வதற்கான சிறந்த வேலையை அவர்கள் செய்ய முடியும். குறிப்பாக டெவலப்பருக்கு இது இறுதி பயனருக்கு வசதியான அனுபவத்திற்கு வழிவகுத்தால் சோதிக்க முடியாது.
uk: Робоча група OpenXR рекомендує встановлювати лише прив’язки для контролерів, фактично протестованих розробником. Середовище виконання XR розроблено з урахуванням цього. Вони можуть краще виконати повторне прив’язування наданого зв’язування, ніж розробник може зробити обґрунтовані припущення. Особливо тому, що розробник не може перевірити, чи це забезпечує комфортний досвід для кінцевого користувача.
zh_hant: OpenXR 工作小組建議：只設定你實際測過的控制器綁定。XR 執行環境設計時已考慮自動重配，效果比開發者盲目設想更佳，且開發者無法保證所有硬體的適用性與體驗。

source: This is our advice as well: limit your action map to the interaction profiles for devices you have actually tested your game with. The Oculus Touch controller is widely used as a fallback controller by many runtimes. If you are able to test your game using a Meta Rift or Quest and add this profile there is a high probability your game will work with other headsets.
ga: Is é seo ár gcomhairle chomh maith: teorainn a chur le do léarscáil gníomhaíochta leis na próifílí idirghníomhaíochta le haghaidh feistí a ndearna tú tástáil iarbhír ar do chluiche leo. Tá an rialtóir Oculus Touch in úsáid go forleathan mar rialtóir fallback ag go leor runtimes. Má tá tú in ann do chluiche a thástáil ag baint úsáide as Meta Rift nó rompu agus cuir an phróifíl seo leis tá dóchúlacht ard ann go n-oibreoidh do chluiche le headsets eile.
ru: Мы также советуем: ограничьте свою карту действий профилями взаимодействия для устройств, на которых вы действительно тестировали игру. Контроллер Oculus Touch широко используется в качестве резервного контроллера во многих средах выполнения. Если вы сможете протестировать игру на Meta Rift или Quest и добавить этот профиль, то с высокой вероятностью она будет работать и на других гарнитурах.
ta: இதுவும் எங்கள் ஆலோசனையும்: உங்கள் விளையாட்டை நீங்கள் உண்மையில் சோதித்த சாதனங்களுக்கான தொடர்பு சுயவிவரங்களுக்கு உங்கள் செயல் வரைபடத்தை மட்டுப்படுத்தவும். ஓக்குலச் டச் கன்ட்ரோலர் பல இயக்க நேரங்களால் குறைவடையும் கட்டுப்படுத்தியாக பரவலாகப் பயன்படுத்தப்படுகிறது. மேவு பிளவு அல்லது தேடலைப் பயன்படுத்தி உங்கள் விளையாட்டை சோதித்து இந்த சுயவிவரத்தைச் சேர்க்க முடிந்தால், உங்கள் விளையாட்டு மற்ற எட்செட்களுடன் வேலை செய்யும் அதிக நிகழ்தகவு உள்ளது.
uk: Це також наша порада: обмежте свою карту дій профілями взаємодії для пристроїв, на яких ви фактично тестували свою гру. Контролер Oculus Touch широко використовується як резервний контролер багатьма середовищами виконання. Якщо ви можете протестувати свою гру за допомогою Meta Rift або Quest і додати цей профіль, висока ймовірність того, що ваша гра працюватиме з іншими гарнітурами.
zh_hant: 我們也建議：僅針對實際測試過的裝置建立動作對應。Oculus Touch 控制器現已成多數平台常見後備選項，只要你能在 Meta Rift 或 Quest 上測試並加入設定檔，你的遊戲很可能可相容其他頭盔。

source: Binding Modifiers
fr: Modificateurs de liaison
it: Modificatori di associazioni
ru: Модификаторы привязки
uk: Модифікатори прив'язки
zh_cn: 绑定修改器
zh_hant: 綁定修飾器

source: One of the main goals of the action map is to remove the need for the application to know the hardware used. However, sometimes the hardware has physical differences that require inputs to be altered in ways other than how they are bound to actions. This need ranges from setting thresholds, to altering the inputs available on a controller.
ru: Одна из основных целей карты действий — исключить необходимость знания приложению используемого оборудования. Однако иногда оборудование имеет физические различия, требующие изменения входных данных способами, отличными от тех, которые привязаны к действиям. Эта потребность варьируется от установки пороговых значений до изменения входных данных, доступных на контроллере.
uk: Однією з головних цілей карти дій є усунення необхідності для програми знати апаратне забезпечення, що використовується. Однак інколи апаратне забезпечення має фізичні відмінності, які вимагають змінювати вхідні дані іншим способом, ніж те, як вони прив’язані до дій. Ця потреба варіюється від встановлення порогових значень до зміни входів, доступних на контролері.
zh_hant: 動作對應的主要目標之一是讓應用程式無需關心具體硬體型號。但部分硬體因物理設計差異，需對輸入做額外調整，而非僅僅改變綁定關聯，舉凡設定閾值或調整控制器可用輸入等。

source: Binding modifiers are not enabled by default and require enabling in the OpenXR project settings. Also there is no guarantee that these modifiers are supported by every runtime. You will need to consult the support for the runtimes you are targeting and decide whether to rely on the modifiers or implement some form of fallback mechanism.
ru: Модификаторы привязки отключены по умолчанию и требуют включения в настройках проекта OpenXR. Кроме того, нет гарантии, что эти модификаторы поддерживаются всеми средами выполнения. Вам необходимо обратиться в службу поддержки целевых сред выполнения и решить, стоит ли использовать модификаторы или реализовать какой-либо резервный механизм.
uk: Модифікатори прив’язки не ввімкнено за замовчуванням і потребують увімкнення в налаштуваннях проекту OpenXR. Крім того, немає гарантії, що ці модифікатори підтримуються кожною програмою виконання. Вам потрібно буде проконсультуватися зі службою підтримки для середовища виконання, яке ви націлюєте, і вирішити, чи покладатися на модифікатори, чи застосувати певну форму резервного механізму.
zh_hant: 綁定修飾器預設為關閉，必須在 OpenXR 專案設定中手動啟用。此外，並非所有執行環境都支援這些修飾器，你需查閱目標執行環境的支援情況，決定是否依賴這些修飾器，或自行實作備援機制。

source: If you are targeting multiple runtimes that have support for the same controllers, you may need to create separate action maps for each runtime. You can control which action map Godot uses by using different export templates for each runtime and using a custom :ref:`feature tag <doc_feature_tags>` to set the action map.
ru: Если вы ориентируетесь на несколько сред выполнения, поддерживающих одни и те же контроллеры, вам может потребоваться создать отдельные карты действий для каждой среды выполнения. Вы можете контролировать, какую карту действий будет использовать Godot, используя разные шаблоны экспорта для каждой среды выполнения и используя специальный тег :ref:`feature tag <doc_feature_tags>` для настройки карты действий.
uk: Якщо ви націлюєтеся на кілька середовищ виконання, які підтримують однакові контролери, вам може знадобитися створити окремі карти дій для кожного середовища виконання. Ви можете контролювати, яку карту дій використовує Godot, використовуючи різні шаблони експорту для кожного середовища виконання та використовуючи спеціальний :ref:`feature tag <doc_feature_tags>` для встановлення карти дій.
zh_hant: 若你的專案需同時支援多個執行環境且共用同一控制器，可能需針對不同執行環境各自建立專屬動作對應。你可以透過針對不同執行環境匯出的模板，以及自訂 :ref:`功能標籤 <doc_feature_tags>` 來指定要載入的動作對應檔案。

source: In Godot, binding modifiers are divided into two groups: modifiers that work on the interaction profile level, and modifiers that work on individual bindings.
ru: В Godot модификаторы привязок делятся на две группы: модификаторы, работающие на уровне профиля взаимодействия, и модификаторы, работающие на отдельных привязках.
uk: У Godot модифікатори прив’язки поділяються на дві групи: модифікатори, які працюють на рівні профілю взаємодії, і модифікатори, які працюють на окремих прив’язках.
zh_hant: Godot 的綁定修飾器分為兩種：一種作用於互動設定檔層級，另一種則僅針對單一綁定調整。

source: Binding modifiers on an interaction profile
fr: Modificateurs de liaison sur un profil d'interaction
it: Modificatori di associazioni su un profilo di interazione
ru: Модификаторы привязки в профиле взаимодействия
uk: Модифікатори прив’язки до профілю взаємодії
zh_hant: 互動設定檔層級的綁定修飾器

source: Binding modifiers that are applied to the whole interaction profile can be accessed through the modifier button on the right side of the interaction profile editor.
uk: Модифікатори прив’язки, які застосовуються до всього профілю взаємодії, можна отримати за допомогою кнопки модифікатора в правій частині редактора профілю взаємодії.
zh_hant: 若要在整個互動設定檔套用修飾器，可於互動設定檔編輯器右側找到修飾器按鈕進行管理。

source: You can add a new modifier by pressing the :button:`Add binding modifier` button.
it: È possibile aggiungere un nuovo modificatore premendo il pulsante :button:`Add binding modifier`.
uk: Ви можете додати новий модифікатор, натиснувши кнопку :button:`Add binding modifier`.
zh_hant: 按下 :button:`Add binding modifier` 按鈕即可新增修飾器。

source: As Godot doesn't know which controllers and runtimes support a modifier, there is no restriction to adding modifiers. Unsupported modifiers will be ignored.
uk: Оскільки Godot не знає, які контролери та середовища виконання підтримують модифікатор, немає обмежень на додавання модифікаторів. Непідтримувані модифікатори ігноруватимуться.
zh_hant: 由於 Godot 無法預先得知哪些控制器或執行環境支援哪些修飾器，因此不會限制你新增修飾器。若該修飾器不被支援，則會自動忽略。

source: Dpad Binding modifier
it: Modificatore dell'associazione del d-pad
ru: Модификатор привязки Dpad
uk: Модифікатор прив'язки Dpad
zh_hant: 方向鍵綁定修飾器

source: The dpad binding modifier adds new inputs to an interaction profile for each joystick and thumbpad input on this controller. It turns the input into a dpad with separate up, down, left and right inputs that are exposed as buttons:
uk: Модифікатор прив’язки dpad додає нові входи до профілю взаємодії для кожного введення джойстика та великого пальця на цьому контролері. Він перетворює вхід на dpad з окремими входами вгору, вниз, ліворуч і праворуч, які відображаються як кнопки:
zh_hant: 方向鍵綁定修飾器會針對控制器的每個搖桿或觸控板輸入，於互動設定檔中新增對應的輸入，將其轉換為四個獨立的上、下、左、右按鍵輸入。

source: Inputs related to extensions are denoted with an asterix.
it: Gli input relativi alle estensioni sono indicati con un asterisco.
uk: Вхідні дані, пов’язані з розширеннями, позначаються зірочкою.
zh_hant: 與擴充功能相關的輸入會以星號標記。

source: In order to use the dpad binding modifier you need to enable the dpad binding modifier extension in project settings:
fr: Afin d'utiliser le modificateur de lien dpad, vous devez activer l'extension de modificateur de lien dpad dans les paramètres du projet :
uk: Щоб використовувати модифікатор зв’язування dpad, вам потрібно ввімкнути розширення модифікатора зв’язування dpad у налаштуваннях проекту:
zh_hant: 要使用方向鍵綁定修飾器，需先於專案設定中啟用「方向鍵綁定修飾器」擴充功能：

source: Enabling the extension is enough to make this functionality work using default settings.
uk: Увімкнути розширення достатньо, щоб ця функція працювала з налаштуваннями за замовчуванням.
zh_hant: 僅需啟用此擴充功能，即可使用預設設定。

source: Adding the modifier is optional and allows you to fine tune the way the dpad functionality behaves. You can add the modifier multiple times to set different settings for different inputs.
uk: Додавання модифікатора є необов’язковим і дозволяє точно налаштувати роботу функціональності dpad. Ви можете додати модифікатор кілька разів, щоб встановити різні параметри для різних входів.
zh_hant: 新增修飾器為選用，可進一步微調方向鍵功能的行為。你可針對不同輸入多次新增修飾器，各自調整參數。

source: These settings are used as follows:
fr: Ces paramètres sont utilisés comme suit :
it: Queste impostazioni sono utilizzate come segue:
ru: Эти настройки используются следующим образом:
uk: Ці налаштування використовуються таким чином:
zh_hant: 各設定意義如下：

source: ``Action Set`` defines the action set to which these settings are applied.
it: ``Action Set`` definisce l'insieme di azioni a cui sono applicate queste impostazioni.
uk: ``Набір дій`` визначає набір дій, до якого застосовуються ці налаштування.
zh_hant: ``Action Set``：設定作用的動作集。

source: ``Input Path`` defines the original input that is mapped to the new dpad inputs.
it: ``Input Path`` definisce l'input originale che è mappato sui nuovi input del d-pad.
uk: ``Шлях введення`` визначає оригінальний вхід, який відображається на нових входах dpad.
zh_hant: ``Input Path``：原始輸入路徑，綁定到新方向鍵輸入。

source: ``Threshold`` specifies the threshold value that will enable a dpad action, e.g. a value of ``0.6`` means that if the distance from center goes above ``0.6`` the dpad action is pressed.
it: ``Threshold`` specifica il valore di soglia che abiliterà un'azione del d-pad, ad esempio un valore di ``0.6`` significa che se la distanza dal centro supera ``0.6`` l'azione del d-pad viene premuta.
uk: ``Поріг`` визначає порогове значення, яке увімкне дію dpad, напр. значення ``0,6`` означає, що якщо відстань від центру перевищує ``0,6``, буде натиснуто дію dpad.
zh_hant: ``Threshold``：觸發方向鍵動作所需的閾值。例如設為 ``0.6``，當搖桿離中心距離超過 0.6 時即觸發該方向。

source: ``Threshold Released`` specifies the threshold value that will disable a dpad action, e.g. a value of ``0.4`` means that if the distance from center goes below ``0.4`` the dpad action is released.
it: ``Threshold Released`` specifica il valore di soglia che disabiliterà un'azione del d-pad, ad esempio un valore di ``0.4`` significa che se la distanza dal centro scende al di sotto di ``0.4`` l'azione del d-pad viene rilasciata.
uk: Threshold Released визначає порогове значення, яке вимикає дію dpad, напр. значення ``0,4`` означає, що якщо відстань від центру опускається нижче ``0,4``, дія dpad скасовується.
zh_hant: ``Threshold Released``：解除方向鍵動作的閾值。例如設為 ``0.4``，當搖桿回到中心小於 0.4 時即解除該方向狀態。

source: ``Center Region`` specifies the distance from center that enabled the center action, this is only supported for trackpads.
it: ``Center Region`` specifica la distanza dal centro che abilita l'azione centrale; questa opzione è supportata solo per i trackpad.
uk: ``Центральна область`` визначає відстань від центру, яка вмикає центральну дію, це підтримується лише для трекпадів.
zh_hant: ``Center Region``：定義觸控板中心區域的半徑，超過此值才視為偏離中心，僅支援觸控板。

source: ``Wedge Angle`` specifies the angle of each wedge. A value of ``90 degrees`` or lower means that up, down, left and right each have a separate slice in which they are in the pressed state. A value above ``90 degrees`` means that the slices overlap and that multiple actions can be in the pressed state.
uk: ``Клиновий кут`` визначає кут кожного клина. Значення «90 градусів» або менше означає, що вгорі, внизу, ліворуч і праворуч кожен має окремий фрагмент, у якому вони знаходяться в натиснутому стані. Значення вище ``90 градусів`` означає, що фрагменти перекриваються і що кілька дій можуть бути в натиснутому стані.
zh_hant: ``Wedge Angle``：每個方向鍵的扇形角度。90 度或以下代表上下左右各自獨立，超過 90 度則會重疊，可能多個方向同時觸發。

source: ``Is Sticky``, when enabled means that an action stays in the pressed state until the thumbstick or trackpad moves into another wedge even if it has left the wedge for that action.
it: ``Is Sticky``, quando abilitato, significa che un'azione rimane nello stato premuto finché la levetta analogica o il trackpad non si sposta in un altro spicchio, anche se ha lasciato lo spicchio per quell'azione.
uk: ``Залипає``, коли ввімкнено, означає, що дія залишається в натиснутому стані, доки джойстик або трекпад не переміститься в інший клин, навіть якщо він залишив клин для цієї дії.
zh_hant: ``Is Sticky``：啟用後，動作會持續保持按下狀態，直到搖桿或觸控板進入其他方向區塊才解除。

source: ``On Haptic`` lets us define a haptic output that is automatically activated when an action becomes pressed.
uk: ``On Haptic`` дозволяє нам визначити тактильний вихід, який автоматично активується, коли натискається дія.
zh_hant: ``On Haptic``：當動作觸發時自動啟動的觸覺回饋。

source: ``Off Haptic`` lets us define a haptic output that is automatically activated when an action is released.
uk: ``Off Haptic`` дозволяє нам визначити тактильний вихід, який автоматично активується після відпускання дії.
zh_hant: ``Off Haptic`` 可讓我們定義在動作被釋放時自動啟動的觸覺輸出。

source: Binding modifiers on individual bindings
uk: Модифікатори прив’язки на окремих прив’язках
zh_hant: 單一綁定層級的綁定修飾器

source: Binding modifiers that are applied to individual bindings can be accessed through the binding modifier button next to action attached to an input:
uk: Доступ до модифікаторів прив’язки, які застосовуються до окремих прив’язок, можна отримати за допомогою кнопки модифікатора прив’язки поруч із дією, приєднаною до введення:
zh_hant: 若要針對單一綁定（某個動作對應某個輸入）套用修飾器，可點選輸入旁的修飾器按鈕設定：

source: As Godot doesn't know which inputs on each runtime support a modifier, there is no restriction to adding modifiers. If the modifier extension is unsupported, modifiers will be filtered out at runtime. Modifiers added to the wrong input may result in a runtime error.
uk: Оскільки Godot не знає, які входи в кожному середовищі виконання підтримують модифікатор, немає обмежень на додавання модифікаторів. Якщо розширення модифікатора не підтримується, модифікатори буде відфільтровано під час виконання. Модифікатори, додані до неправильного введення, можуть призвести до помилки виконання.
zh_hant: Godot 無法預知每個執行環境與輸入支援哪些修飾器，因此你可自由新增。若執行環境不支援該修飾器，會在執行時自動過濾。若誤加到不支援的輸入，也可能導致執行時錯誤。

source: You should test your action map on the actual hardware and runtime to verify the proper setup.
uk: Ви повинні перевірити свою карту дій на фактичному апаратному забезпеченні та середі виконання, щоб перевірити правильність налаштування.
zh_hant: 請務必在實際硬體及執行環境上測試你的動作對應，以確保設定正確。

source: Analog threshold modifier
fr: Modificateur de seuil analogique
it: Modificatore di soglia analogica
ru: Аналоговый модификатор порога
uk: Аналоговий пороговий модифікатор
zh_hant: 類比閾值修飾器

source: The analog threshold modifier allows you to specify the thresholds used for any analog input, like the trigger, that has a boolean input. This controls when the input is in the pressed state.
uk: Модифікатор аналогового порогу дозволяє вказати пороги, які використовуються для будь-якого аналогового входу, наприклад тригера, який має логічний вхід. Це контролює, коли вхід знаходиться в натиснутому стані.
zh_hant: 類比閾值修飾器可自訂任意類比輸入（如扳機鍵）觸發布林輸入時的閾值，決定何時算作按下。

source: In order to use this modifier you must enable the analog threshold extension in the project settings:
fr: Pour utiliser ce modificateur, vous devez activer l'extension de seuil analogique dans les paramètres du projet :
uk: Щоб використовувати цей модифікатор, необхідно ввімкнути аналогове розширення порогу в налаштуваннях проекту:
zh_hant: 使用此修飾器前，須先於專案設定啟用「類比閾值」擴充功能：

source: The analog threshold modifier has the following settings:
it: Il modificatore di soglia analogica ha le seguenti impostazioni:
ru: Аналоговый модификатор порога имеет следующие настройки:
uk: Аналоговий пороговий модифікатор має такі налаштування:
zh_hant: 類比閾值修飾器包含以下設定：

source: These are defined as follows:
it: Queste sono definite come segue:
ru: Они определяются следующим образом:
uk: Вони визначаються таким чином:
zh_hant: 各設定說明如下：

source: ``On Threshold`` specifies the threshold value that will enable the action, e.g. a value of ``0.6`` means that when the analog value gets above ``0.6`` the action is set to the pressed state.
uk: ``On Threshold`` вказує порогове значення, яке увімкне дію, напр. значення ``0,6`` означає, що коли аналогове значення стає вище ``0,6``, дія встановлюється у натиснутий стан.
zh_hant: ``On Threshold``：啟動動作的閾值。例如設為 ``0.6``，當類比數值超過 0.6 時即視為按下。

source: ``Off Threshold`` specifies the threshold value that will disable the action, e.g. a value of ``0.4`` means that when the analog value goes below ``0.4`` the action is set in to the released state.
uk: ``Off Threshold`` вказує порогове значення, яке вимикає дію, напр. значення ``0,4`` означає, що коли аналогове значення падає нижче ``0,4``, дія встановлюється у звільнений стан.
zh_hant: ``Off Threshold``：釋放動作的閾值。例如設為 ``0.4``，當類比數值低於 0.4 時即視為釋放。

source: ``On Haptic`` lets us define a haptic output that is automatically activated when the input is pressed.
uk: ``On Haptic`` дозволяє нам визначити тактильний вихід, який автоматично активується, коли натискається вхід.
zh_hant: ``On Haptic``：當輸入觸發時自動啟動的觸覺回饋。

source: ``Off Haptic`` lets us define a haptic output that is automatically activated when the input is released.
uk: ``Off Haptic`` дозволяє нам визначити тактильний вихід, який автоматично активується, коли вхід відпускається.
zh_hant: ``Off Haptic``：當輸入釋放時自動啟動的觸覺回饋。

source: Haptics on modifiers
ru: Тактильные ощущения на модификаторах
uk: Гаптики на модифікаторах
zh_hant: 修飾器的觸覺回饋設定

source: Modifiers can support automatic haptic output that is triggered when thresholds are reached.
uk: Модифікатори можуть підтримувати автоматичний тактильний вихід, який запускається при досягненні порогових значень.
zh_hant: 部分修飾器可設定當閾值觸發時自動啟動的觸覺回饋。

source: Currently both available modifiers support this feature however there is no rule future modifiers also have this capability. Only one type of haptic feedback is supported but in the future other options may become available.
uk: Наразі обидва доступні модифікатори підтримують цю функцію, однак немає правила, що майбутні модифікатори також матимуть цю можливість. Підтримується лише один тип тактильного зворотного зв’язку, але в майбутньому можуть з’явитися інші варіанти.
zh_hant: 目前所有內建修飾器皆支援此功能，但未來修飾器未必都有此能力。現階段僅支援一種基本觸覺回饋，未來有機會擴增更多類型。

source: Haptic vibration
fr: Vibration haptique
ru: Тактильная вибрация
uk: Тактильна вібрація
zh_hant: 觸覺震動

source: The haptic vibration allows us to specify a simple haptic pulse:
uk: Тактильна вібрація дозволяє нам визначити простий тактильний імпульс:
zh_hant: 觸覺震動功能可設定簡單的震動脈衝：

source: It has the following options:
it: Ha le seguenti opzioni:
ru: Он имеет следующие возможности:
uk: Він має такі параметри:
zh_hant: 可自訂以下選項：

source: ``Duration`` is the duration of the pulse in nanoseconds. ``-1`` lets the runtime choose an optimal value for a short pulse suitable for the current hardware.
it: ``Durata`` è la durata dell'impulso in nanosecondi. ``-1`` consente al runtime di scegliere un valore ottimale per un impulso breve adatto all'hardware attuale.
uk: ``Duration`` - це тривалість імпульсу в наносекундах. ``-1`` дозволяє середовищу виконання вибрати оптимальне значення для короткого імпульсу, що підходить для поточного апаратного забезпечення.
zh_hant: ``Duration``：脈衝持續時間（單位：奈秒），設為 ``-1`` 則由執行環境自動選擇最適合當前硬體的短脈衝時長。

source: ``Frequency`` is the frequency of the pulse in Hz. ``0`` lets the runtime choose an optimal frequency for a short pulse suitable for the current hardware.
it: ``Frequency`` è la frequenza dell'impulso in Hz. ``0`` consente al runtime di scegliere una frequenza ottimale per un impulso breve adatto all'hardware attuale.
uk: ``Частота`` – це частота імпульсу в Гц. ``0`` дозволяє середовищу виконання вибрати оптимальну частоту для короткого імпульсу, що підходить для поточного апаратного забезпечення.
zh_hant: ``Frequency``：脈衝頻率（Hz），設為 ``0`` 則由執行環境自動選擇最適合當前硬體的短脈衝頻率。
