Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_next_steps.po
Languages: ga, it, ru, ta, uk, zh_hans

source: Where to go from here
ga: Cá háit a rachaidh le dul as seo
it: Dove andare da qui
ru: Куда идти дальше
ta: இங்கிருந்து எங்கு செல்ல வேண்டும்
uk: Куди подітися звідси
zh_hans: 接下来该做什么

source: Now that we have the basics covered there are several options to look at for your XR game dev journey:
ga: Anois go bhfuil na buneilimintí clúdaithe againn tá roinnt roghanna le breathnú orthu le haghaidh do thuras forbartha cluiche XR:
it: Ora che abbiamo trattato le basi, ci sono diverse opzioni da considerare per il tuo percorso di sviluppo di giochi XR:
ru: Теперь, когда мы рассмотрели основы, есть несколько вариантов, которые вы можете рассмотреть для своего пути в разработке XR-игр:
ta: இப்போது எங்களிடம் அடிப்படைகள் உள்ளன, உங்கள் எக்ச்ஆர் கேம் தேவ் பயணத்தைப் பார்க்க பல விருப்பங்கள் உள்ளன:
uk: Тепер, коли ми розібралися з основами, є кілька варіантів для вашого шляху розробника ігор XR:
zh_hans: 现在我们已经掌握了基础知识，在之后 XR 游戏开发之旅中，有几个选项供你选择：

source: You can take a look at the :ref:`Advanced topics <openxr-advanced-topics>` section.
ga: Is féidir leat breathnú ar an rannán :ref:`Ardábhair <openxr-advanced-topics>`.
it: Puoi dare un'occhiata alla sezione :ref:`Argomenti avanzati <openxr-advanced-topics>`.
ru: Вы можете взглянуть на раздел :ref:`Дополнительные темы <openxr-advanced-topics>`.
ta: நீங்கள் அதைப் பார்க்கலாம்: ref: `மேம்பட்ட தலைப்புகள் <openxr- மேம்பட்ட-டோபிக்ச்>` பிரிவு.
uk: Ви можете переглянути розділ :ref:`Advanced topics <openxr-advanced-topics>`.
zh_hans: 你可以查看 :ref:`高级专题 <openxr-advanced-topics>` 部分。

source: You can look at a number of `XR demos here <https://github.com/godotengine/godot-demo-projects/tree/master/xr>`_.
ga: Is féidir leat breathnú ar roinnt `XR demos anseo <https://github.com/godotengine/godot-demo-projects/tree/master/xr>`_.
it: Puoi trovare diverse `demo di XR qui <https://github.com/godotengine/godot-demo-projects/tree/master/xr>`_.
ru: Вы можете увидеть некоторые `XR демо здесь <https://github.com/godotengine/godot-demo-projects/tree/master/xr>`_.
ta: நீங்கள் இங்கே பல `எக்ச்ஆர் டெமோக்களைப் பார்க்கலாம் <https://github.com/godotengine/godot-demo-projects/tree/master/xr>` _.
uk: Ви можете переглянути декілька `демонстрацій XR тут <https://github.com/godotengine/godot-demo-projects/tree/master/xr>`_.
zh_hans: 你可以在这里参考一些 `XR 演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/xr>`_\ 。

source: You can find 3rd party tutorials on our :ref:`Tutorials and resources <doc_community_tutorials>` page.
ga: Is féidir leat teacht ar ranganna teagaisc 3ú páirtí ar ár leathanach :ref:`Teagaisc agus acmhainní <doc_community_tutorials>`.
it: Puoi trovare tutorial di terze parti nella nostra pagina :ref:`Tutorial e risorse <doc_community_tutorials>`.
ru: Учебные пособия сторонних разработчиков можно найти на нашей странице :ref:`Учебные пособия и ресурсы <doc_community_tutorials>`.
ta: எங்கள் 3 வது தரப்பு பயிற்சிகளை நீங்கள் காணலாம்: குறிப்பு: `பயிற்சிகள் மற்றும் வளங்கள் <doc_community_tutorials>` பக்கம்.
uk: Ви можете знайти навчальні посібники третіх сторін на нашій сторінці :ref:`Tutorials and resources <doc_community_tutorials>`.
zh_hans: 你也可以在 :ref:`教程和资源 <doc_community_tutorials>` 页面上找到额外的第三方教程。

source: XR Toolkits
ga: Feisteáin Uirlisí XR
it: Toolkit XR
ru: Инструменты XR
ta: எக்ச்ஆர் கருவித்தொகுப்புகள்
uk: Набори інструментів XR
zh_hans: XR 工具包

source: There are various XR toolkits available that implement more complex XR logic ready for you to use. We have a :Ref:`small introduction to Godot XR Tools <godot-xr-tools>` that you can look at, a toolkit developed by core contributors of Godot.
ga: Tá uirlisí éagsúla XR ar fáil a chuireann loighic XR níos casta i bhfeidhm atá réidh le húsáid. Tá :Tag:`réamhrá beag againn ar Uirlisí Godot XR <godot-xr-tools>` ar féidir leat breathnú air, foireann uirlisí a d'fhorbair príomh-ranníocóirí Godot.
it: Sono disponibili vari toolkit XR che implementano logica XR pi√π complessa, pronta per l'uso. Abbiamo una :Ref:`piccola introduzione a Godot XR Tools <godot-xr-tools>` che puoi consultare, un toolkit sviluppato dai principali contributori di Godot.
ru: Существуют различные наборы инструментов для XR, реализующие более сложную логику XR, готовые к использованию. У нас есть :Ref:`небольшое введение в Godot XR Tools <godot-xr-tools>`, с которым вы можете ознакомиться. Это набор инструментов, разработанный основными разработчиками Godot.
ta: நீங்கள் பயன்படுத்த மிகவும் சிக்கலான எக்ச்ஆர் தர்க்கத்தை செயல்படுத்தும் பல்வேறு எக்ச்ஆர் கருவித்தொகுதிகள் உள்ளன. எங்களிடம் ஒரு: குறிப்பு உள்ளது: `கோடோட் எக்ச்ஆர் கருவிகளுக்கு சிறிய அறிமுகம் <கோடோட்-எக்ச்ஆர்-கருவிகள்>` நீங்கள் பார்க்கக்கூடிய, கோடோட்டின் முக்கிய பங்களிப்பாளர்களால் உருவாக்கப்பட்ட ஒரு கருவித்தொகுப்பு.
uk: Існують різні набори інструментів XR, які реалізують складнішу логіку XR, готову до використання. У нас є :Ref:`невеликий вступ до Godot XR Tools <godot-xr-tools>`, який ви можете переглянути, набір інструментів, розроблений основними учасниками Godot.
zh_hans: 有许多现成的 XR 工具包实现了更复杂的 XR 逻辑，比如 :ref:`Godot XR 工具简要介绍 <godot-xr-tools>`\ ，这是由 Godot 的核心贡献者开发的工具包。

source: There are more toolkits available for Godot:
ga: Tá níos mó trealamh uirlisí ar fáil do Godot:
it: Sono disponibili altri toolkit per Godot:
ru: Для Godot доступны дополнительные наборы инструментов:
ta: கோடோட்டுக்கு அதிகமான கருவித்தொகுப்புகள் உள்ளன:
uk: Для Godot доступні інші набори інструментів:
zh_hans: Godot 还有更多的工具包可供选择：

source: `Godot XR handtracking toolkit <https://github.com/RevolNoom/godot_xr_handtracking>`_ (GDScript)
ga: `Foireann uirlisí rianaithe láimhe Godot XR <https://github.com/RevolNoom/godot_xr_handtracking>`_ (GDScript)
it: `Toolkit per il tracciamento di mani XR di Godot <https://github.com/RevolNoom/godot_xr_handtracking>`_ (GDScript)
ru: `Набор инструментов для отслеживания рук Godot XR <https://github.com/RevolNoom/godot_xr_handtracking>`_ (GDScript)
ta: `கோடோட் எக்ச்ஆர் ஏண்ட்ராக்கிங் கருவித்தொகுப்பு <https://github.com/revolnoom/godot_xr_handtracking>` _ (gdscript)
uk: `Набір інструментів відстеження рук Godot XR <https://github.com/RevolNoom/godot_xr_handtracking>`_ (GDScript)
zh_hans: `Godot XR 手势跟踪工具包 <https://github.com/RevolNoom/godot_xr_handtracking>`_\ （GDScript）

source: `Godot XR Kit <https://github.com/patrykkalinowski/godot-xr-kit>`_ (GDScript)
ru: `Комплект Godot XR <https://github.com/patrykkalinowski/godot-xr-kit>`_ (GDScript)
ta: `கோடோட் எக்ச்ஆர் அறிவிலி <https://github.com/patrkkalinowski/godot-xr-kit>` _ (gdscript)
uk: `Godot XR Kiti <https://github.com/patrykkalinowski/godot-xr-kit>`_ (GDScript)
zh_hans: `Godot XR 套件 <https://github.com/patrykkalinowski/godot-xr-kit>`_\ （GDScript）

source: `Godot XR Tools <https://github.com/godotvr/godot-xr-tools>`_ (GDScript)
ga: `Uirlisí Godot XR <https://github.com/godotvr/godot-xr-tools> `_ (GDScript)
it: `Strumenti XR di Godot <https://github.com/godotvr/godot-xr-tools>`_ (GDScript)
ru: `Инструменты Godot XR <https://github.com/godotvr/godot-xr-tools>`_ (GDScript)
ta: `கோடோட் எக்ச்ஆர் கருவிகள் <https://github.com/godotvr/godot-xr-tools>` _ (gdscript)
zh_hans: `Godot XR 工具 <https://github.com/godotvr/godot-xr-tools>`_\ （GDScript）

source: `NXR <https://github.com/stumpynub/NXR>`_ (C#)
ta: `Nxr <https://github.com/stumpynub/nxr>` _ (சி#)
uk: `NXR a <https://github.com/stumpynub/NXR>`_ (C#)
