Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_room_scale.po
Languages: ga, ru, ta, uk, zh_cn, zh_tw

source: With both the approaches worked out up above we will prevent the character body from moving where the player can't go. As the player has physically moved to this location, the camera will now have moved into the room.
ga: Leis an dá chur chuige a oibríodh amach thuas cuirfimid cosc ar chorp an charachtair bogadh áit nach féidir leis an imreoir dul. Toisc go bhfuil an t-imreoir bogadh go fisiciúil go dtí an suíomh seo, beidh an ceamara ag bogadh isteach sa seomra anois.
ru: Используя оба подхода, описанных выше, мы предотвратим перемещение персонажа туда, куда не может попасть игрок. Поскольку игрок физически переместился в это место, камера переместится внутрь комнаты.
ta: இரண்டு அணுகுமுறைகளும் மேலே செயல்பட்டதால், வீரர் செல்ல முடியாத இடத்தில் கதாபாத்திர உடல் நகர்வதைத் தடுப்போம். பிளேயர் உடல் ரீதியாக இந்த இடத்திற்கு நகர்ந்ததால், கேமரா இப்போது அறைக்குள் சென்றிருக்கும்.
uk: За допомогою обох підходів, розроблених вище, ми не дамо тілу персонажа рухатися туди, де гравець не може потрапити. Оскільки гравець фізично перемістився в це місце, камера тепер переміститься в кімнату.
zh_tw: 上述兩種方法都會阻止角色本體移動到玩家不可進入的位置。但如果玩家在現實中真的走過去，相機還是會跑進房間裡。

source: The logical solution would be to prevent the movement altogether and adjust the placement of the XR origin point so the player stays outside of the room.
ga: Ba é an réiteach loighciúil ná an ghluaiseacht a chosc go hiomlán agus socrúchán an phointe tionscnaimh XR a choigeartú ionas go bhfanfadh an t-imreoir lasmuigh den seomra.
ru: Логичным решением было бы вообще запретить движение и скорректировать местоположение исходной точки XR так, чтобы игрок оставался за пределами комнаты.
ta: தர்க்கரீதியான தீர்வு இயக்கத்தை முழுவதுமாகத் தடுப்பதும், எக்ச்ஆர் மூலப்பொருளின் இடத்தை சரிசெய்வதும் ஆகும், எனவே வீரர் அறைக்கு வெளியே தங்குவார்.
uk: Логічним рішенням було б повністю запобігти переміщенню та налаштувати розташування початкової точки XR, щоб гравець залишався поза кімнатою.
zh_tw: 理論上可以完全禁止這種移動，並調整 XR 原點的位置，讓玩家待在房間外。

source: The problem with this approach is that physical movement is now not replicated in the virtual space. This will cause nausea for the player.
ga: Is í an fhadhb leis an gcur chuige seo ná nach ndéantar gluaiseacht fhisiciúil a mhacasamhail sa spás fíorúil anois. Beidh sé seo ina chúis le masc don imreoir.
ru: Проблема такого подхода в том, что физическое движение теперь не воспроизводится в виртуальном пространстве. Это может вызвать у игрока тошноту.
ta: இந்த அணுகுமுறையின் சிக்கல் என்னவென்றால், உடல் இயக்கம் இப்போது மெய்நிகர் இடத்தில் பிரதிபலிக்கவில்லை. இது வீரருக்கு குமட்டலை ஏற்படுத்தும்.
uk: Проблема цього підходу полягає в тому, що фізичний рух тепер не відтворюється у віртуальному просторі. Це спричинить нудоту у гравця.
zh_cn: 这种方法的问题在于玩家的物理移动并没有在虚拟空间中重现。这可能会导致玩家晕眩。
zh_tw: 但這麼做會讓物理移動無法在虛擬世界中如實反映，這可能導致玩家產生暈眩感。

source: What many XR games do instead, is to measure the distance between where the player physically is, and where the players virtual body has been left behind. As this distance increases, usually to a distance of a few centimeters, the screen slowly blacks out.
ga: Is é an rud a dhéanann go leor cluichí XR ina ionad sin, an fad idir an áit a bhfuil an t-imreoir go fisiciúil a thomhas, agus áit a bhfuil corp fíorúil na n-imreoirí fágtha taobh thiar de. De réir mar a mhéadaíonn an fad seo, de ghnáth go fad cúpla ceintiméadar, déanann an scáileán dubh go mall.
ta: அதற்கு பதிலாக பல எக்ச்ஆர் விளையாட்டுகள் என்ன செய்கின்றன, வீரர் உடல் ரீதியாக இருக்கும் இடத்திற்கும், வீரர்களின் மெய்நிகர் உடல் இடத்திற்கும் இடையிலான தூரத்தை அளவிடுவது. இந்த தூரம் அதிகரிக்கும் போது, வழக்கமாக சில சென்டிமீட்டர் தூரத்திற்கு, திரை மெதுவாக கறுப்பு நிற்கிறது.

source: Our solutions up above would allow us to add this logic into the code at the end of step 1.
ga: Ligfeadh ár réitigh thuas dúinn an loighic seo a chur isteach sa chód ag deireadh chéim 1.
ru: Наши решения, представленные выше, позволят нам добавить эту логику в код в конце шага 1.
ta: மேலே உள்ள எங்கள் தீர்வுகள் படி 1 இன் முடிவில் இந்த தர்க்கத்தை குறியீட்டில் சேர்க்க அனுமதிக்கும்.
uk: Наші рішення, наведені вище, дозволять нам додати цю логіку в код наприкінці кроку 1.
zh_tw: 上述解法可讓我們將這段判斷邏輯加入步驟 1 的程式碼最後。

source: Further improvements to the code presented could be:
ga: D'fhéadfadh feabhsuithe breise ar an gcód a chuirtear i láthair:
ru: Дальнейшие улучшения представленного кода могут быть следующими:
ta: வழங்கப்பட்ட குறியீட்டின் மேலும் மேம்பாடுகள்:
uk: Подальші вдосконалення представленого коду можуть бути:
zh_tw: 進一步改進程式碼的建議：

source: allowing controller input as long as this distance is still small,
ga: ag ligean ionchur rialaitheora chomh fada agus go bhfuil an fad seo fós beag,
ru: позволяя контроллеру вводить данные, пока это расстояние еще мало,
ta: இந்த தூரம் இன்னும் சிறியதாக இருக்கும் வரை கட்டுப்படுத்தி உள்ளீட்டை அனுமதிக்கிறது,
uk: дозволяючи ввод контролера, поки ця відстань все ще мала,
zh_tw: 只要這個距離尚小，仍允許控制器輸入動作，

source: still applying gravity to the player even when controller input is disabled.
ga: fós ag cur meáchanlár i bhfeidhm ar an imreoir fiú nuair atá ionchur an rialtóra díchumasaithe.
ru: по-прежнему применяет гравитацию к игроку, даже если управление контроллером отключено.
ta: கட்டுப்படுத்தி உள்ளீடு முடக்கப்பட்டிருந்தாலும் கூட பிளேயருக்கு ஈர்ப்பு விசையைப் பயன்படுத்துகிறது.
uk: все ще застосовуючи силу тяжіння до гравця, навіть якщо вхід контролера вимкнено.
zh_tw: 即便停用控制器輸入，也要讓玩家繼續受到重力影響。

source: The movement demos in our demo repository contain an example of blacking out the screen when a user walks into restricted areas.
ga: Tá sampla sna taispeántais ghluaiseachta inár stóras taispeána den scáileán a dhúnadh nuair a shiúlann úsáideoir isteach i gceantair srianta.
ru: Демонстрации движений в нашем демонстрационном репозитории содержат пример затемнения экрана, когда пользователь заходит в запрещенные зоны.
ta: எங்கள் டெமோ களஞ்சியத்தில் உள்ள இயக்கம் டெமோக்கள் ஒரு பயனர் தடைசெய்யப்பட்ட பகுதிகளுக்குள் செல்லும்போது திரையை வெளியேற்றுவதற்கான ஒரு எடுத்துக்காட்டு உள்ளது.
uk: Демонстрації руху в нашому демонстраційному репозиторії містять приклад затемнення екрана, коли користувач заходить у зони обмеженого доступу.
zh_tw: 我們的範例專案中有展示玩家走進限制區時畫面漸黑的實作範例。

source: Further suggestions for improvements
ga: Moltaí breise le haghaidh feabhsúcháin
ru: Дополнительные предложения по улучшению
ta: மேம்பாடுகளுக்கான மேலதிக பரிந்துரைகள்
uk: Подальші пропозиції щодо покращення
zh_cn: 进一步的改进建议
zh_tw: 更多改進建議

source: The above provides two good options as starting points for implementing room scale XR games.
ga: Soláthraíonn an méid thuas dhá rogha mhaith mar phointí tosaigh chun cluichí XR scála seomra a chur i bhfeidhm.
ru: Выше приведены два хороших варианта в качестве отправных точек для реализации XR-игр в масштабе комнаты.
ta: அறை அளவிலான எக்ச்ஆர் கேம்களை செயல்படுத்துவதற்கான தொடக்க புள்ளிகளாக மேலே உள்ள இரண்டு நல்ல விருப்பங்களை வழங்குகிறது.
uk: Вище наведено два хороші варіанти як відправні точки для реалізації ігор XR масштабу кімнати.
zh_tw: 以上兩種方法都很適合作為開發房間規模 XR 遊戲的起點。

source: A few more things that are worth pointing out that you will likely want to implement:
ga: Cúpla rud eile is fiú a chur in iúl gur dócha gur mhaith leat a chur i bhfeidhm:
ru: Еще несколько вещей, на которые стоит обратить внимание и которые вы, вероятно, захотите реализовать:
ta: நீங்கள் செயல்படுத்த விரும்புவதை சுட்டிக்காட்ட வேண்டிய இன்னும் சில விசயங்கள்:
uk: Ще кілька речей, на які варто звернути увагу, які ви, ймовірно, захочете реалізувати:
zh_tw: 還有幾項實作上值得注意的建議：

source: The height of the camera can be used to detect whether the player is standing up, crouching, jumping or lying down. You can adjust the size and orientation of the collision shape accordingly. Extra bonus points for adding multiple collision shapes so the head and body have their own, more accurately sized, shapes.
ga: Is féidir airde an cheamara a úsáid chun a bhrath an bhfuil an t-imreoir ag seasamh suas, ag crochadh, ag léim nó ina luí síos. Is féidir leat méid agus treoshuíomh an chruth imbhuailte a choigeartú dá réir. Pointí bónais breise chun cruthanna imbhuailte iolracha a chur leis ionas go mbeidh a gcruthanna féin, níos cruinne, ag an gceann agus an corp.
ru: Высота камеры позволяет определить, стоит ли игрок, приседает, прыгает или лежит. Вы можете соответствующим образом настроить размер и ориентацию формы столкновения. Дополнительный бонусный балл за добавление нескольких форм столкновения, чтобы голова и тело имели собственные, более точные размеры.
ta: கேமராவின் உயரத்தை வீரர் எழுந்து நிற்கிறாரா, வளைந்து கொடுக்கிறாரா, குதிக்கிறாரா என்பதைக் கண்டறிய பயன்படுத்தலாம். அதற்கேற்ப மோதல் வடிவத்தின் அளவு மற்றும் நோக்குநிலையை நீங்கள் சரிசெய்யலாம். பல மோதல் வடிவங்களைச் சேர்ப்பதற்கான கூடுதல் போனச் புள்ளிகள், எனவே தலை மற்றும் உடல் அவற்றின் சொந்த, மிகவும் துல்லியமான அளவிலான, வடிவங்களைக் கொண்டுள்ளன.
uk: За висотою камери можна визначити, чи гравець стоїть, присідає, стрибає чи лежить. Ви можете відповідно налаштувати розмір і орієнтацію форми зіткнення. Додаткові бонусні бали за додавання кількох форм зіткнень, щоб голова та тіло мали власні форми точнішого розміру.
zh_tw: 可利用相機高度判斷玩家是站立、蹲下、跳躍還是躺下，並據此動態調整碰撞形狀的大小與朝向。若能針對頭部和身體各自設置更精確的碰撞形狀，效果會更好。

source: When a scene first loads, the player may be far away from the center of the tracking space. This could result in the player spawning into a different room than our origin point. The game will now attempt, and fail, to move the player body from the starting point to where the player is standing. You should implement a reset function that moves the origin point so the player is in the correct starting position.
ga: Nuair a luchtaíonn radharc ar dtús, d'fhéadfadh an t-imreoir a bheith i bhfad ó lár an spáis rianaithe. D'fhéadfadh sé seo go dtiocfadh an t-imreoir isteach i seomra difriúil ná ár bpointe tionscnaimh. Déanfaidh an cluiche iarracht anois, agus teipeann air, corp an imreora a bhogadh ón bpointe tosaigh go dtí an áit a bhfuil an t-imreoir ina seasann. Ba chóir duit feidhm athshocraithe a chur i bhfeidhm a bhogann an pointe tionscnaimh ionas go mbeidh an t-imreoir sa suíomh tosaigh ceart.
ru: При первой загрузке сцены игрок может находиться далеко от центра области отслеживания. Это может привести к появлению игрока не в исходной точке, а в комнате, отличной от нашей. Теперь игра попытается переместить тело игрока из начальной точки туда, где он стоит, но безуспешно. Вам следует реализовать функцию сброса, которая перемещает исходную точку, чтобы игрок оказался в правильном исходном положении.
ta: ஒரு காட்சி முதலில் ஏற்றும்போது, கண்காணிப்பு இடத்தின் மையத்திலிருந்து வீரர் வெகு தொலைவில் இருக்கலாம். இது எங்கள் தோற்ற புள்ளியை விட வீரர் வேறு அறைக்குள் நுழைவதற்கு வழிவகுக்கும். தொடக்க இடத்திலிருந்து வீரர் நிற்கும் இடத்திற்கு வீரர் உடலை நகர்த்துவதற்கு விளையாட்டு இப்போது முயற்சிக்கும், தோல்வியடையும். மூல புள்ளியை நகர்த்தும் மீட்டமைப்பு செயல்பாட்டை நீங்கள் செயல்படுத்த வேண்டும், எனவே பிளேயர் சரியான தொடக்க நிலையில் இருக்கிறார்.
uk: Коли сцена завантажується вперше, гравець може бути далеко від центру простору відстеження. Це може призвести до появи гравця в кімнаті, відмінній від нашої вихідної точки. Тепер гра намагатиметься, але не вдасться, перемістити тіло гравця з початкової точки до місця, де гравець стоїть. Ви повинні застосувати функцію скидання, яка переміщує початкову точку, щоб гравець перебував у правильному початковому положенні.
zh_tw: 場景剛載入時，玩家可能離追蹤空間中心很遠，導致一開始就出現在不同房間。此時遊戲會嘗試讓角色本體從起始點移動到玩家實際所在處，但多半失敗。因此應設計重置功能，主動調整原點，讓玩家從正確的起始位置開始。

source: Both of the above improvements require the player to be ready and standing up straight. There is no guarantee as the player may still be putting their headset on.
ga: Éilíonn an dá fheabhsú thuas ar an imreoir a bheith réidh agus seasamh suas díreach. Níl aon ráthaíocht ann mar b'fhéidir go bhfuil an t-imreoir fós ag cur a headset air.
ru: Оба вышеперечисленных улучшения требуют, чтобы игрок был готов и стоял прямо. Гарантий нет, так как игрок может всё ещё надевать гарнитуру.
ta: மேலே உள்ள இரண்டு மேம்பாடுகளும் வீரர் தயாராக இருக்க வேண்டும், நேராக எழுந்து நிற்க வேண்டும். வீரர் இன்னும் எட்செட்டை போடுவதால் எந்த உத்தரவாதமும் இல்லை.
uk: Обидва вищезазначені вдосконалення вимагають, щоб гравець був готовий і стояв прямо. Гарантії немає, оскільки гравець може все ще одягати гарнітуру.
zh_tw: 上述這些改進都假設玩家已經站好準備，但實際上玩家可能還在戴頭戴裝置，因此無法保證隨時生效。

source: Many games, including XR Tools, solve this by introducing an intro screen or loading screen where the player must press a button when they are ready. This starting environment is often a large location where the positioning of the player has little impact on what the player sees. When the player is ready, and presses the button, this is the moment you record the position and height of the camera.
ga: Réitíonn go leor cluichí, lena n-áirítear XR Tools, é seo trí scáileán iontrála nó scáileán luchtaithe a thabhairt isteach ina gcaithfidh an t-imreoir cnaipe a bhrú nuair a bhíonn siad réidh Is minic gur áit mhór é an timpeallacht tosaigh seo ina bhfuil mórán tionchair ag suíomh an imreora ar an méid a fheiceann an t-imreoir. Nuair a bhíonn an t-imreoir réidh, agus brúíonn sé an cnaipe, is é seo an nóiméad a thaifeadann tú suíomh agus airde an cheamara.
ru: Многие игры, включая XR Tools, решают эту проблему, добавляя вступительный или загрузочный экран, где игрок должен нажать кнопку, когда будет готов. Эта стартовая среда часто представляет собой большую локацию, где положение игрока мало влияет на то, что он видит. Когда игрок готов и нажимает кнопку, вы фиксируете положение и высоту камеры.
ta: எக்ச்ஆர் கருவிகள் உட்பட பல விளையாட்டுகள், அறிமுகத் திரையை அறிமுகப்படுத்துவதன் மூலமோ அல்லது திரை ஏற்றுவதன் மூலமோ இதைத் தீர்க்கவும், அங்கு பிளேயர் தயாராக இருக்கும்போது ஒரு பொத்தானை அழுத்த வேண்டும். இந்த தொடக்க சூழல் பெரும்பாலும் ஒரு பெரிய இடமாகும், அங்கு வீரரின் நிலைப்பாடு வீரர் பார்க்கும் விசயத்தில் சிறிதளவு தாக்கத்தை ஏற்படுத்துகிறது. பிளேயர் தயாராக இருக்கும்போது, பொத்தானை அழுத்தும்போது, கேமராவின் நிலை மற்றும் உயரத்தை நீங்கள் பதிவுசெய்யும் தருணம் இது.
uk: Багато ігор, у тому числі XR Tools, вирішують це, вводячи вступний екран або екран завантаження, де гравець повинен натиснути кнопку, коли він буде готовий. Це початкове середовище часто є великою локацією, де позиціонування гравця мало впливає на те, що гравець бачить. Коли гравець готовий і натискає кнопку, це момент, коли ви записуєте положення та висоту камери.
zh_tw: 許多遊戲（包含 XR Tools）會設計一個起始或載入畫面，讓玩家在準備好時按下按鈕。通常這個起始區是一個很大的空間，玩家站在哪裡對所見畫面影響不大。當玩家按下按鈕時，即記錄下相機的位置與高度。

source: As a result, the origin node does not represent the position of the player. It represents the center, or start of, the tracking space in which the player can physically move. As the player moves around their room this movement is represented through the tracking of the player's headset. In game this translates to the camera node's position being updated accordingly. For all intents and purposes, we are tracking a disembodied head. Unless body tracking is available, we have no knowledge of the position or orientation of the player's body.
ru: В результате узел начала координат не отображает положение игрока. Он представляет собой центр, или начало, пространства отслеживания, в котором игрок может физически перемещаться. Перемещение игрока по комнате отображается с помощью отслеживания его гарнитуры. В игре это соответствует соответствующему обновлению положения узла камеры. Фактически, мы отслеживаем голову без тела. Если отслеживание тела недоступно, мы не знаем положения или ориентации тела игрока.

source: This will ensure that the player's location stays in sync with the character body's location.
ru: Это обеспечит синхронизацию местоположения игрока с местоположением тела персонажа.

source: What many XR games do instead, is to measure the distance between where the player physically is, and where the player's virtual body has been left behind. As this distance increases, usually to a distance of a few centimeters, the screen slowly blacks out.
ru: Вместо этого многие XR-игры измеряют расстояние между физическим местоположением игрока и местом, где его виртуальное тело осталось. По мере увеличения этого расстояния, обычно до нескольких сантиметров, экран постепенно затемняется.
