Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_room_scale.po
Languages: ga, ru, ta, uk, zh_cn, zh_tw

source: For our example we are going to keep this simple and straight forward. We are not going to worry about comfort features such as snap turning and applying a vignette. We highly recommend implementing such comfort features.
ga: Mar shampla, táimid chun é seo a choinneáil simplí agus díreach ar aghaidh. Nílimid chun a bheith buartha faoi ghnéithe compoird ar nós casadh snap agus vignette a chur i bhfeidhm. Molaimid go mór gnéithe compoird den sórt sin a chur i bhfeidhm.
ru: В нашем примере мы постараемся сделать всё просто и понятно. Мы не будем беспокоиться о таких удобных функциях, как мгновенный поворот и виньетка. Мы настоятельно рекомендуем реализовать такие удобные функции.
ta: எங்கள் எடுத்துக்காட்டுக்கு நாம் இதை எளிமையாகவும் நேராகவும் முன்னோக்கி வைத்திருக்கப் போகிறோம். ச்னாப் திருப்புதல் மற்றும் விக்னெட்டைப் பயன்படுத்துதல் போன்ற ஆறுதல் அம்சங்களைப் பற்றி நாங்கள் கவலைப்படப் போவதில்லை. அத்தகைய ஆறுதல் அம்சங்களை செயல்படுத்த நாங்கள் மிகவும் பரிந்துரைக்கிறோம்.
uk: Для нашого прикладу ми збираємося зберегти це просто і прямо вперед. Ми не збираємося турбуватися про комфортні функції, такі як поворот і накладення віньєтки. Ми настійно рекомендуємо реалізувати такі функції комфорту.
zh_tw: 在範例中，我們會以簡化方式示範，不會加入如「瞬間轉向」或「視角暈染」等舒適性設計。建議正式開發時務必加入這類舒適性功能。

source: We've added the call for processing our rotation to our physics process but we are only executing this if we were able to move our player fully. This means that if the player moves somewhere they shouldn't, we don't process further movement.
ga: Chuireamar an glaoch chun ár rothlú a phróiseáil chuig ár bpróiseas fisice ach nílimid ag feidhmiú ach amháin má bhíomar in ann ár n-imreoir a bhogadh go hiomlán. Ciallaíonn sé seo má bhogann an t-imreoir áit éigin nár chóir dóibh, ní dhéanaimid tuilleadh gluaiseachta a phróiseáil.
ru: Мы добавили вызов обработки вращения в наш физический процесс, но выполняем его только в том случае, если нам удалось полностью переместить игрока. Это означает, что если игрок перемещается туда, куда ему не следует, мы не обрабатываем дальнейшее движение.
ta: எங்கள் இயற்பியல் செயல்முறைக்கு எங்கள் சுழற்சியை செயலாக்குவதற்கான அழைப்பை நாங்கள் சேர்த்துள்ளோம், ஆனால் எங்கள் வீரரை முழுமையாக நகர்த்த முடிந்தால் மட்டுமே இதை செயல்படுத்துகிறோம். இதன் பொருள் என்னவென்றால், வீரர் எங்காவது நகர்ந்தால், நாங்கள் மேலும் இயக்கத்தை செயலாக்க மாட்டோம்.
uk: Ми додали виклик для обробки нашого обертання до нашого фізичного процесу, але ми виконуємо це, лише якщо ми змогли повністю перемістити нашого гравця. Це означає, що якщо гравець рухається кудись, де він не повинен, ми не обробляємо подальший рух.
zh_tw: 我們在物理流程中加入旋轉處理，但僅在玩家能完整移動時才執行。也就是說，若玩家移動到不該去的位置，我們就不再處理進一步移動。

source: Step 3
ga: Céim 3
ru: Шаг 3
ta: படி 3
uk: Крок 3
zh_cn: 第三步
zh_tw: 步驟 3

source: The third and final step is moving the player forwards, backwards or sideways as a result of user input.
ga: Is é an tríú céim agus an chéim deiridh ag bogadh an t-imreoir ar aghaidh, ar gcúl nó ar thaobhbhealaí mar thoradh ar ionchur úsáideora.
ru: Третий и последний шаг — перемещение игрока вперед, назад или в сторону в результате действий пользователя.
ta: மூன்றாவது மற்றும் இறுதி படி பயனர் உள்ளீட்டின் விளைவாக பிளேயரை முன்னோக்கி, பின்னோக்கி அல்லது பக்கவாட்டாக நகர்த்துவதாகும்.
uk: Третій і останній крок - це переміщення гравця вперед, назад або вбік у результаті введення користувача.
zh_tw: 第三步，也是最後一步，是根據玩家輸入讓角色前進、後退或側移。

source: Just like with the rotation the inputs differ from project to project so we are simply calling the function ``_get_movement_input``. This function should obtain the necessary input and return a directional vector scaled to the required velocity.
ga: Díreach cosúil leis an uainíocht tá na hionchuir difriúil ó thionscadal go tionscadal agus mar sin nílimid ach ag glaoch ar an bhfeidhm ''_get_movement_input''. Ba chóir go bhfaigheadh an fheidhm seo an t-ionchur is gá agus veicteoir treo atá scálaithe leis an treoluas riachtanach a thabhairt ar ais.
ru: Как и в случае с вращением, входные данные различаются от проекта к проекту, поэтому мы просто вызываем функцию ``_get_movement_input``. Эта функция должна получить необходимые входные данные и вернуть вектор направления, масштабированный до требуемой скорости.
ta: சுழற்சியைப் போலவே உள்ளீடுகளும் திட்டத்திலிருந்து திட்டத்திற்கு வேறுபடுகின்றன, எனவே நாங்கள் `_get_movement_input`` செயல்பாட்டை அழைக்கிறோம். இந்த செயல்பாடு தேவையான உள்ளீட்டைப் பெற வேண்டும் மற்றும் தேவையான வேகத்திற்கு அளவிடப்பட்ட ஒரு திசை திசையனைத் தர வேண்டும்.
uk: Як і у випадку з обертанням, вхідні дані відрізняються від проекту до проекту, тому ми просто викликаємо функцію ``_get_movement_input``. Ця функція повинна отримати необхідні вхідні дані та повернути направлений вектор, масштабований до необхідної швидкості.
zh_tw: 和旋轉一樣，不同專案的移動輸入也會不同，因此我們只需呼叫 `_get_movement_input` 函式，讓它取得輸入，並傳回經速度縮放的方向向量。

source: Just like with rotation we're keeping it simple. Here too it is advisable to look at adding comfort settings.
ga: Díreach cosúil le rothlú táimid á choinneáil simplí. Anseo freisin moltar breathnú ar shocruithe compoird a chur leis.
ru: Как и с вращением, мы стремимся к простоте. Здесь также рекомендуется рассмотреть возможность добавления настроек для комфорта.
ta: சுழற்சியைப் போலவே நாங்கள் அதை எளிமையாக வைத்திருக்கிறோம். இங்கேயும் ஆறுதல் அமைப்புகளைச் சேர்ப்பதைப் பார்ப்பது நல்லது.
uk: Так само, як і з ротацією, ми робимо це просто. Тут також бажано звернути увагу на додавання налаштувань комфорту.
zh_tw: 同樣地，這裡也只做簡單處理。實務上建議加上舒適性選項。

source: Character body centric solution
ga: Tuaslagán lárnaithe comhlacht carachtar
ru: Решение, ориентированное на тело персонажа
ta: எழுத்து உடல் மையக் கரைசல்
uk: Рішення, орієнтоване на тіло персонажа
zh_cn: 以角色身体为中心的解决方案
zh_tw: 以角色本體為中心的解決方案

source: In this setup we are going to keep our character body as our root node and as such is easier to combine with traditional game mechanics.
ga: Sa thus táimid ag dul a choinneáil ar ár gcomhlacht carachtar mar ár nód fréimhe agus mar sin tá sé níos éasca a chur le chéile le meicnic cluiche traidisiúnta.
ru: В этой настройке мы собираемся сохранить тело нашего персонажа в качестве корневого узла, и поэтому его легче комбинировать с традиционной игровой механикой.
ta: இந்த அமைப்பில், எங்கள் கதாபாத்திர உடலை எங்கள் ரூட் முனையாக வைத்திருக்கப் போகிறோம், மேலும் பாரம்பரிய விளையாட்டு இயக்கவியலுடன் ஒன்றிணைவது எளிது.
uk: У цьому налаштуванні ми збережемо тіло нашого персонажа як наш кореневий вузол, і тому його легше поєднувати з традиційною ігровою механікою.
zh_tw: 在這個架構下，我們將角色本體作為根節點，這樣更容易與傳統遊戲機制結合。

source: Here we have a standard character body with collision shape, and our XR origin node and camera as normal children. We also have our neck helper node.
ga: Anseo tá corp caighdeánach carachtair againn le cruth imbhuailte, agus ár nód agus ceamara tionscnaimh XR mar ghnáthpháistí. Tá ár nód cúntóra muineál againn freisin.
ru: Здесь у нас есть стандартное тело персонажа с формой столкновения, а также узел начала XR и камера в качестве обычных дочерних элементов. Также у нас есть вспомогательный узел шеи.
ta: இங்கே நாம் மோதல் வடிவத்துடன் ஒரு நிலையான எழுத்து உடல், மற்றும் சாதாரண குழந்தைகளாக எங்கள் எக்ச்ஆர் தோற்றம் முனை மற்றும் கேமரா உள்ளது. எங்கள் கழுத்து உதவி முனையும் உள்ளது.
uk: Тут ми маємо стандартне тіло персонажа з формою зіткнення, а також наш вихідний вузол XR і камеру як звичайні діти. У нас також є допоміжний вузол шиї.
zh_tw: 這裡我們有一個帶有碰撞形狀的標準角色本體，以及原點節點和相機作為普通子節點。還有脖子輔助節點。

source: Processing our character movement is done in the same three steps but implemented slightly differently.
ga: Déantar próiseáil ár ngluaiseacht carachtair sna trí chéim chéanna ach cuirtear i bhfeidhm beagán difriúil.
ru: Обработка движения нашего персонажа выполняется в те же три этапа, но реализована немного по-другому.
ta: எங்கள் எழுத்து இயக்கத்தை செயலாக்குவது அதே மூன்று படிகளில் செய்யப்படுகிறது, ஆனால் சற்று வித்தியாசமாக செயல்படுத்தப்படுகிறது.
uk: Обробка руху нашого персонажа виконується в ті самі три кроки, але реалізується дещо по-іншому.
zh_tw: 角色移動同樣以三步驟處理，但實作細節略有不同。

source: The `Character centric movement demo <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_character_centric_movement>`__ contains a more elaborate example of the technique described below.
ga: Sa `taispeána gluaiseachta Carachtar-lárnach <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_character_centric_movement>`__ tá sampla níos ilchasta den teicníocht a gcuirtear síos uirthi thíos.
ru: `Демонстрация движения, ориентированного на персонажа <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_character_centric_movement>`__ содержит более подробный пример техники, описанной ниже.
ta: `எழுத்துக்குறி சென்ட்ரிக் இயக்கம் டெமோ <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_character_centric_movement>` __ கீழே விவரிக்கப்பட்டுள்ள நுட்பத்தின் விரிவான எடுத்துக்காட்டு உள்ளது.
uk: `Демонстрація руху персонажів <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_character_centric_movement>`__ містить детальніший приклад техніки, описаної нижче.
zh_tw: `以角色本體為中心的移動範例 <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_character_centric_movement>`__ 提供了下述技術更完整的範例。

source: In this approach step 1 is where all the magic happens. Just like with our previous approach we will be applying our physical movement to the character body, but we will counter that movement on the origin node.
ga: Sa chur chuige seo is é céim 1 an áit a dtarlaíonn an draíocht ar fad. Díreach mar a bhí lenár gcur chuige roimhe seo beimid ag cur ár ngluaiseacht fhisiceach i bhfeidhm ar an gcorp carachtair, ach cuirfimid in aghaidh na gluaiseachta sin ar an nód tionscnaimh.
ru: В этом подходе вся магия происходит на шаге 1. Как и в предыдущем подходе, мы будем применять физическое движение к телу персонажа, но будем противодействовать этому движению в исходном узле.
ta: இந்த அணுகுமுறையில் படி 1 என்பது எல்லா மந்திரங்களும் நடக்கும் இடமாகும். எங்கள் முந்தைய அணுகுமுறையைப் போலவே, எங்கள் உடல் இயக்கத்தையும் கதாபாத்திர உடலுக்கு பயன்படுத்துவோம், ஆனால் அந்த இயக்கத்தை தோற்றம் முனையில் எதிர்ப்போம்.
uk: У цьому підході на кроці 1 відбувається вся магія. Так само, як і в нашому попередньому підході, ми будемо застосовувати наш фізичний рух до тіла персонажа, але ми будемо протидіяти цьому руху на початковому вузлі.
zh_tw: 這種方法的精髓就在步驟 1。我們會像前一個方法一樣，將物理移動套用到角色本體，但同時在原點節點上做反向抵消。

source: This will ensure that the players location stays in sync with the character body's location.
ga: Cinnteoidh sé seo go bhfanfaidh suíomh na n-imreoirí ar aon dul le suíomh comhlachta an charachtair.
ta: இது வீரர்களின் இருப்பிடம் எழுத்துக்குறி உடலின் இருப்பிடத்துடன் ஒத்திசைவாக இருப்பதை உறுதி செய்யும்.

source: In essence the code above will move the character body to where the player is, and then move the origin node back in equal amounts. The result is that the player stays centered above the character body.
ga: Go bunúsach bogfaidh an cód thuas an corp carachtair go dtí an áit a bhfuil an t-imreoir, agus ansin bogfaidh an nód tionscnaimh ar ais i méideanna comhionann. Is é an toradh atá air ná go bhfanann an t-imreoir dírithe os cionn an choirp charachtair.
ru: По сути, приведённый выше код перемещает тело персонажа туда, где находится игрок, а затем перемещает исходный узел назад на равное расстояние. В результате игрок остаётся по центру над телом персонажа.
ta: சாராம்சத்தில் மேலே உள்ள குறியீடு எழுத்து உடலை வீரர் இருக்கும் இடத்திற்கு நகர்த்தும், பின்னர் தோற்றம் முனையை சம அளவில் நகர்த்தும். இதன் விளைவாக, வீரர் கதாபாத்திர உடலுக்கு மேலே மையமாக இருக்கிறார்.
uk: По суті, наведений вище код перемістить тіло персонажа туди, де знаходиться гравець, а потім перемістить вихідний вузол рівними кількостями. Результатом є те, що гравець залишається в центрі над тілом персонажа.
zh_tw: 本質上，這種寫法會讓角色本體移動到玩家當前位置，再將原點節點等量向後移動，使玩家始終位於角色本體上方的中心。

source: We start with applying the rotation. The character body should be facing where the player was looking the previous frame. We calculate our camera orientation in the space of the character body. We can now calculate the angle by which the player has rotated their head. We rotate our character body by the same amount so our character body faces the same direction as the player. And then we reverse the rotation on the origin node so the camera ends up aligned with the player again.
ga: Tosaímid leis an rothlú a chur i bhfeidhm. Ba chóir go mbeadh corp an charachtair os comhair an áit a raibh an t-imreoir ag féachaint ar an bhfráma roimhe sin. Ríomhaimid ár dtreoshuíomh ceamara sa spás i gcorp an charachtair. Is féidir linn anois an uillinn a ríomh trínar rothlaigh an t-imreoir a cheann. Déanaimid ár gcorp carachtair a rothlú ar an méid céanna ionas go mbeidh aghaidh ár gcorp carachtair sa treo céanna leis an imreoir. Agus ansin déanaimid an rothlú ar an nód tionscnaimh a aisiompú ionas go gcríochnóidh an ceamara ailínithe leis an imreoir arís.
ru: Начинаем с применения поворота. Тело персонажа должно быть обращено туда, куда смотрел игрок в предыдущем кадре. Мы рассчитываем ориентацию камеры в пространстве тела персонажа. Теперь мы можем вычислить угол, на который повернула голову игрок. Мы поворачиваем тело персонажа на ту же величину, чтобы оно было обращено в ту же сторону, что и игрок. Затем мы обращаем поворот в узле начала координат, чтобы камера снова оказалась на одной линии с игроком.
ta: சுழற்சியைப் பயன்படுத்துவதில் தொடங்குகிறோம். வீரர் முந்தைய சட்டகத்தைப் பார்க்கும் இடத்தில் கதாபாத்திர உடல் எதிர்கொள்ள வேண்டும். எழுத்துக்குறி உடலின் இடத்தில் எங்கள் கேமரா நோக்குநிலையை கணக்கிடுகிறோம். வீரர் அவர்களின் தலையை சுழற்றிய கோணத்தை இப்போது நாம் கணக்கிட முடியும். நாங்கள் எங்கள் கதாபாத்திர உடலை அதே அளவால் சுழற்றுகிறோம், எனவே எங்கள் கதாபாத்திர உடல் வீரரின் அதே திசையை எதிர்கொள்கிறது. பின்னர் நாங்கள் தோற்றம் முனையில் சுழற்சியை மாற்றியமைக்கிறோம், எனவே கேமரா மீண்டும் பிளேயருடன் சீரமைக்கப்படுகிறது.
uk: Починаємо із застосування обертання. Тіло персонажа має бути повернуто туди, куди гравець дивився в попередньому кадрі. Розраховуємо орієнтацію нашої камери в просторі тіла персонажа. Тепер ми можемо обчислити кут, на який гравець повернув голову. Ми обертаємо тіло нашого персонажа на таку саму величину, щоб тіло нашого персонажа дивилося в тому ж напрямку, що й гравець. Потім ми змінюємо обертання початкового вузла, щоб камера знову вирівнялася з гравцем.
zh_tw: 我們先處理旋轉。角色本體應該朝向玩家在前一幀看的方向，因此需先計算相機在角色本體空間中的朝向，再計算玩家頭部旋轉的角度。然後以相同角度旋轉角色本體，使其朝向與玩家一致，最後在原點節點上做反向旋轉，讓相機再次與玩家對齊。

source: For the movement we do much the same. The character body should be where the player was standing the previous frame. We calculate by how much the player has moved from this location. Then we attempt to move the character body to this location.
ga: Maidir leis an ngluaiseacht déanaimid an rud céanna. Ba chóir go mbeadh an corp carachtair áit a raibh an t-imreoir ina seasann an fráma roimhe seo Ríomhaimid de réir cé mhéid a bhogadh an t-imreoir ón áit seo. Ansin déanaimid iarracht an corp carachtair a bhogadh go dtí an suíomh seo.
ru: Для движения мы делаем то же самое. Тело персонажа должно находиться там, где игрок стоял в предыдущем кадре. Мы рассчитываем, насколько игрок сместился от этой точки. Затем мы пытаемся переместить тело персонажа в эту точку.
ta: இயக்கத்திற்கு நாம் அவ்வாறே செய்கிறோம். முந்தைய சட்டகத்தில் வீரர் நின்று கொண்டிருந்த இடத்தில் எழுத்து உடல் இருக்க வேண்டும். இந்த இடத்திலிருந்து வீரர் எவ்வளவு நகர்ந்தார் என்பதை நாங்கள் கணக்கிடுகிறோம். பின்னர் கதாபாத்திர உடலை இந்த இடத்திற்கு நகர்த்த முயற்சிக்கிறோம்.
uk: Для руху ми робимо приблизно те саме. Тіло персонажа має бути там, де гравець стояв у попередньому кадрі. Розраховуємо, на скільки гравець перемістився з цієї локації. Потім ми намагаємося перемістити тіло персонажа в це місце.
zh_tw: 移動也是同樣道理。角色本體應該出現在玩家前一幀所站位置，計算玩家從該處移動的距離後，再嘗試將角色本體移動到這個新位置。

source: As the player may hit a collision body and be stopped, we only move the origin point back by the amount we actually moved the character body. The player may thus move away from this location but that will be reflected in the positioning of the player.
ga: Toisc go bhféadfadh an t-imreoir corp imbhuailte a bhualadh agus a stopadh, ní bhogaimid an pointe tionscnaimh ar ais ach an méid a bhogadh muid corp an charachtair i ndáiríre. Mar sin féadfaidh an t-imreoir bogadh ar shiúl ón áit seo ach léireofar é sin i shuíomh an imreora.
ru: Поскольку игрок может столкнуться с объектом столкновения и остановиться, мы смещаем исходную точку только на расстояние, равное фактическому перемещению тела персонажа. Таким образом, игрок может сместиться от этой точки, но это отразится на его положении.
ta: வீரர் ஒரு மோதல் உடலைத் தாக்கி நிறுத்தப்படுவதால், நாங்கள் உண்மையில் கதாபாத்திர உடலை நகர்த்திய தொகையால் மட்டுமே தோற்றம் புள்ளியை நகர்த்துவோம். வீரர் இந்த இடத்திலிருந்து விலகிச் செல்லக்கூடும், ஆனால் அது வீரரின் நிலைப்பாட்டில் பிரதிபலிக்கும்.
uk: Оскільки гравець може натрапити на тіло зіткнення й бути зупиненим, ми переміщуємо вихідну точку назад лише на ту величину, на яку фактично перемістили тіло персонажа. Таким чином, гравець може відійти від цього місця, але це відобразиться на позиціонуванні гравця.
zh_tw: 由於玩家可能因碰撞體而被阻擋，我們只將原點節點往回移動角色本體實際移動的距離。這樣即使玩家偏離原預期位置，仍可正確反映在定位上。

source: As with our previous solution we return true if this is the case.
ga: Mar is amhlaidh lenár réiteach roimhe seo filleann muid fíor más amhlaidh.
ru: Как и в нашем предыдущем решении, если это так, мы возвращаем true.
ta: எங்கள் முந்தைய தீர்வைப் போலவே, இதுபோன்றால் நாங்கள் உண்மையாகத் திரும்புகிறோம்.
uk: Як і в нашому попередньому рішенні, ми повертаємо true, якщо це так.
zh_tw: 如同前述解法，遇到這種情況時會回傳 true。

source: In this step we again apply the rotation based on controller input. However in this case the code is nearly identical to how one would implement this in a normal first person game.
ga: Sa chéim seo cuirimid i bhfeidhm arís an rothlú bunaithe ar ionchur rialtóra. Sa chás seo, áfach, tá an cód beagnach comhionann leis an gcaoi a gcuirfí é seo i bhfeidhm i ngnáthchluiche céad duine.
ru: На этом этапе мы снова применяем вращение, основанное на действиях контроллера. Однако в этом случае код практически идентичен тому, как это было бы реализовано в обычной игре от первого лица.
ta: இந்த கட்டத்தில் கட்டுப்பாட்டு உள்ளீட்டின் அடிப்படையில் சுழற்சியை மீண்டும் பயன்படுத்துகிறோம். எவ்வாறாயினும், இந்த விசயத்தில் ஒரு சாதாரண முதல் நபர் விளையாட்டில் ஒருவர் இதை எவ்வாறு செயல்படுத்துவார் என்பதற்கு குறியீடு கிட்டத்தட்ட ஒத்ததாக இருக்கிறது.
uk: На цьому кроці ми знову застосовуємо обертання на основі вхідних даних контролера. Однак у цьому випадку код майже ідентичний тому, як це можна реалізувати у звичайній грі від першої особи.
zh_tw: 這一步中，會根據控制器輸入套用旋轉，基本寫法就跟一般第一人稱遊戲一樣。

source: For step three we again apply the movement based on controller input. However just like at step 2, we can now implement this as we would in a normal first person game.
ga: Maidir le chéim a trí chuirimid an gluaiseacht i bhfeidhm arís bunaithe ar ionchur rialaithe Mar sin féin díreach cosúil le céim 2, is féidir linn é seo a chur i bhfeidhm anois mar a dhéanfaimis i ngnáthchluiche céad duine.
ru: На третьем шаге мы снова применяем движение, основанное на действиях контроллера. Однако, как и на втором шаге, теперь мы можем реализовать это так же, как в обычной игре от первого лица.
ta: படி மூன்றுக்கு நாங்கள் கட்டுப்பாட்டு உள்ளீட்டின் அடிப்படையில் இயக்கத்தை மீண்டும் பயன்படுத்துகிறோம். இருப்பினும் படி 2 இல் உள்ளதைப் போலவே, ஒரு சாதாரண முதல் நபர் விளையாட்டில் நாங்கள் இதைச் செயல்படுத்தலாம்.
uk: Для третього кроку ми знову застосовуємо рух на основі введення контролера. Однак, як і на кроці 2, тепер ми можемо реалізувати це, як у звичайній грі від першої особи.
zh_tw: 第三步同樣是根據控制器輸入執行移動，實作方式就和傳統第一人稱遊戲一樣。

source: When the player walks to somewhere they shouldn't
ga: Nuair a shiúlann an t-imreoir go dtí áit éigin nár
ru: Когда игрок идет туда, куда ему не следует идти
ta: வீரர் எங்காவது நடக்கும்போது அவர்கள் கூடாது
uk: Коли гравець йде туди, куди не повинен
zh_cn: 玩家走到不应该抵达的位置时
zh_tw: 當玩家走到不該去的地方

source: Think of a situation where the player is outside a locked room. You don't want the player to go into that room until the door is unlocked. You also don't want the player to see what is in this room.
ga: Smaoinigh ar chás ina bhfuil an t-imreoir lasmuigh de sheomra faoi ghlas. Níl tú ag iarraidh go dtéann an t-imreoir isteach sa seomra sin go dtí go ndíghlacfar an doras. Níl tú ag iarraidh freisin go bhfeicfeadh an t-imreoir cad atá sa seomra seo.
ru: Представьте себе ситуацию, когда игрок находится снаружи запертой комнаты. Вы не хотите, чтобы он входил в неё, пока дверь не будет открыта. Вы также не хотите, чтобы игрок видел, что находится в этой комнате.
ta: வீரர் பூட்டப்பட்ட அறைக்கு வெளியே இருக்கும் சூழ்நிலையைப் பற்றி சிந்தியுங்கள். கதவு திறக்கப்படும் வரை வீரர் அந்த அறைக்குள் செல்ல விரும்பவில்லை. இந்த அறையில் என்ன இருக்கிறது என்பதை வீரர் பார்க்க விரும்பவில்லை.
uk: Подумайте про ситуацію, коли гравець знаходиться за межами зачиненої кімнати. Ви не хочете, щоб гравець заходив у цю кімнату, доки двері не відчинено. Ви також не хочете, щоб гравець бачив, що знаходиться в цій кімнаті.
zh_cn: 想象这样一种情况：玩家身处于一个上锁房间的外边。你不希望玩家在房间门解锁前进入房间，也不希望玩家看到房间内的物体。
zh_tw: 想像玩家站在一間上鎖房間外面。你不希望玩家在門打開前就進房間，也不希望玩家看到房間內的內容。

source: The logic for moving the player through controller input nicely prevents this. The player encounters a static body, and the code prevents the player from moving into the room.
ga: Cuireann an loighic chun an t-imreoir a bhogadh trí ionchur rialaitheora cosc go deas Tagann an t-imreoir le corp statach, agus cuireann an cód cosc ar an imreoir bogadh isteach sa seomra.
ru: Логика перемещения игрока посредством управления контроллером прекрасно предотвращает это. Игрок сталкивается со статичным телом, и код не позволяет ему войти в комнату.
ta: கட்டுப்பாட்டு உள்ளீடு மூலம் பிளேயரை நகர்த்துவதற்கான வழக்கு இதைத் தடுக்கிறது. வீரர் ஒரு நிலையான உடலை எதிர்கொள்கிறார், மேலும் குறியீடு வீரர் அறைக்குள் செல்வதைத் தடுக்கிறது.
uk: Логіка переміщення програвача через вхід контролера чудово запобігає цьому. Гравець стикається зі статичним тілом, і код не дозволяє гравцеві перейти до кімнати.
zh_cn: 用手柄输入控制玩家移动的逻辑可以防止这种情况发生。玩家将会撞上一个 static body，然后代码会阻止玩家走入房间。
zh_tw: 透過控制器移動玩家時的邏輯能妥善阻止這種狀況。當玩家碰到靜態物件時，程式碼會阻止玩家進入房間。

source: However with XR, nothing is preventing the player from taking a real step forward.
ga: Mar sin féin le XR, níl aon rud ag cosc ar an imreoir fíor-chéim a thógáil ar aghaidh.
ru: Однако, с XR ничто не мешает игроку сделать настоящий шаг вперед.
ta: இருப்பினும், எக்ச்ஆர் மூலம், வீரர் ஒரு உண்மையான படி முன்னேறுவதைத் தடுக்கவில்லை.
uk: Проте з XR ніщо не заважає гравцеві зробити справжній крок вперед.
zh_cn: 然而，在 XR 游戏中，没有任何方法能阻止玩家在现实世界中向前行走。
zh_tw: 但在 XR 中，現實裡沒什麼能阻止玩家踏出真正的一步。
