Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/xr/xr_room_scale.po
Languages: ga, ru, ta, uk, zh_cn, zh_tw

source: Room scale in XR
ga: Scála seomra i XR
ru: Масштаб помещения в XR
ta: எக்ச்ஆரில் அறை அளவு
uk: Кімнатні ваги в XR
zh_cn: XR 中的房间尺度
zh_tw: XR 房間規模

source: One of the staples of XR projects is the ability to walk around freely in a large space. This space is often constrained by the room the player is physically in with tracking sensors placed within this space. With the advent of inside out tracking however ever larger play spaces are possible.
ga: Ceann de stáplaí na dtionscadal XR is ea an cumas siúl timpeall faoi shaoirse i spás mór. Is minic a chuireann an seomra srian ar an spás seo agus bíonn an t-imreoir istigh go fisiciúil le braiteoirí rianaithe a chuirtear laistigh den spás seo. Le teacht an taobh istigh rianú amach, áfach, is féidir spásanna súgartha níos mó a bheith ann.
ru: Одна из основных особенностей XR-проектов — возможность свободно перемещаться в большом пространстве. Это пространство часто ограничено комнатой, в которой физически находится игрок, и датчиками отслеживания, расположенными внутри этого пространства. Однако с появлением технологии отслеживания «изнутри наружу» стали возможны всё большие игровые пространства.
ta: எக்ச்ஆர் திட்டங்களின் பிரதானங்களில் ஒன்று ஒரு பெரிய இடத்தில் சுதந்திரமாக சுற்றி நடக்கும் திறன். இந்த இடத்திற்குள் வைக்கப்பட்டுள்ள கண்காணிப்பு சென்சார்களுடன் பிளேயர் உடல் ரீதியாக இருக்கும் அறையால் இந்த இடம் பெரும்பாலும் கட்டுப்படுத்தப்படுகிறது. இன்சைட் அவுட் கண்காணிப்பின் வருகையுடன், இருப்பினும் பெரிய விளையாட்டு இடங்கள் சாத்தியமாகும்.
uk: Одна з головних переваг XR-проектів — можливість вільно пересуватися у великому просторі. Цей простір часто обмежений кімнатою, у якій фізично перебуває гравець, із датчиками відстеження, розміщеними в цьому просторі. З появою відстеження навиворіт, однак ігровий простір стає більшим.
zh_tw: XR 專案的一大特色是能夠在大空間中自由走動。這個空間通常受限於玩家實際所在的房間，並在房間內設置追蹤感測器。然而，隨著「內向外」追蹤技術的出現，遊戲空間可以大幅擴展。

source: As a developer this introduces a number of interesting challenges. In this document we will look at a number of the challenges you may face and outline some solutions. We'll discuss the issues and challenges for seated XR games in another document.
ga: Mar fhorbróir tugann sé seo roinnt dúshlán suimiúil isteach. Sa doiciméad seo breathnóimid ar roinnt de na dúshláin a d'fhéadfadh a bheith romhat agus tabharfaimid breac-chuntas ar roinnt réiteach. Pléifimid na saincheisteanna agus na dúshláin a bhaineann le cluichí XR ina suí i gcáipéis eile.
ru: Для разработчика это создаёт ряд интересных сложностей. В этом документе мы рассмотрим ряд проблем, с которыми вы можете столкнуться, и предложим некоторые решения. Проблемы и сложности, связанные с играми XR, для которых нужно играть сидя, мы обсудим в другом документе.
ta: ஒரு டெவலப்பராக இது பல சுவையான சவால்களை அறிமுகப்படுத்துகிறது. இந்த ஆவணத்தில் நீங்கள் எதிர்கொள்ளக்கூடிய பல சவால்களைப் பார்த்து சில தீர்வுகளை கோடிட்டுக் காட்டுவோம். அமர்ந்த எக்ச்ஆர் கேம்களுக்கான சிக்கல்கள் மற்றும் சவால்களை மற்றொரு ஆவணத்தில் விவாதிப்போம்.
uk: Для розробника це створює ряд цікавих завдань. У цьому документі ми розглянемо ряд проблем, з якими ви можете зіткнутися, і окреслимо деякі рішення. Ми обговоримо проблеми та виклики сидячих ігор XR в іншому документі.
zh_tw: 對開發者來說，這帶來了許多有趣的挑戰。本文件將探討你可能遇到的各種挑戰並概述一些解決方案。針對坐式 XR 遊戲的相關議題，會在另一份文件中說明。

source: Often developers sit behind their desk while building the foundation to their game. In this mode the issues with developing for room scale don't show themselves until it is too late. The advice here is to start testing while standing up and walking around as early as possible. Once you are happy your foundation is solid, you can develop in comfort while remaining seated.
ga: Is minic a shuíonn forbróirí taobh thiar dá ndeasc agus iad ag tógáil an dúshraith dá gcluiche. Sa mhodh seo ní thaispeánann na saincheisteanna a bhaineann le forbairt do scála an tseomra iad féin go dtí go bhfuil sé ródhéanach. Is í an chomhairle anseo ná tús a chur le tástáil agus seasamh suas agus siúl timpeall chomh luath agus is féidir. Nuair atá tú sásta go bhfuil do bhunús láidir, is féidir leat forbairt i do chompord agus tú fágtha ina suí.
ru: Разработчики часто сидят за столом, создавая основу для своей игры. В этом режиме проблемы разработки в масштабе комнаты проявляются лишь тогда, когда становится слишком поздно. Советую начать тестирование стоя и ходить как можно раньше. Как только вы убедитесь, что основа прочна, вы сможете комфортно разрабатывать, не выходя из дома.
ta: பெரும்பாலும் உருவாக்குபவர்கள் தங்கள் விளையாட்டுக்கு அடித்தளத்தை உருவாக்கும் போது தங்கள் மேசைக்கு பின்னால் அமர்ந்திருக்கிறார்கள். இந்த பயன்முறையில் அறை அளவிற்கு வளரும் சிக்கல்கள் மிகவும் தாமதமாகிவிடும் வரை தங்களைக் காட்டாது. இங்குள்ள அறிவுரை என்னவென்றால், எழுந்து நின்று, சீக்கிரம் சுற்றி நடக்கும்போது சோதனையைத் தொடங்க வேண்டும். நீங்கள் மகிழ்ச்சியாகிவிட்டால், உங்கள் அடித்தளம் திடமானது, அமர்ந்திருக்கும்போது நீங்கள் ஆறுதலுடன் உருவாகலாம்.
uk: Часто розробники сидять за робочим столом, будуючи основу своєї гри. У цьому режимі проблеми з розробкою для масштабу кімнати не виявляються, доки не стане надто пізно. Порада полягає в тому, щоб якомога раніше починати тестування, стоячи та ходячи. Коли ви задоволені, що ваша основа міцна, ви можете комфортно розвиватися, сидячи.
zh_tw: 開發遊戲初期，開發者通常坐在桌前進行基礎開發。這種情況下，房間規模的相關問題往往到了較晚階段才顯現。因此建議盡早站起來走動測試，確保基礎功能穩固後，再選擇舒適地坐著開發。

source: In traditional first person games a player is represented by a :ref:`CharacterBody3D <class_characterbody3d>` node. This node is moved by processing traditional controller, mouse or keyboard input. A camera is attached to this node at a location roughly where the player's head will be.
ga: I gcluichí traidisiúnta céad pearsanaítear imreoir le nód :ref:`CharacterBody3D <class_characterbody3d>`. Bogtar an nód seo trí ionchur traidisiúnta rialaitheora, luch nó méarchláir a phróiseáil. Tá ceamara ceangailte den nód seo ag láthair go garbh ina mbeidh ceann an imreora.
ru: В традиционных играх от первого лица игрок представлен узлом :ref:`CharacterBody3D <class_characterbody3d>`. Этот узел перемещается, обрабатывая традиционный ввод с контроллера, мыши или клавиатуры. Камера прикреплена к этому узлу примерно в том месте, где будет находиться голова игрока.
ta: பாரம்பரிய முதல் நபர் விளையாட்டுகளில் ஒரு வீரர் ஒரு: ref: `reatolbody3d <class_characterbody3d>` முனை. பாரம்பரிய கட்டுப்படுத்தி, சுட்டி அல்லது விசைப்பலகை உள்ளீட்டை செயலாக்குவதன் மூலம் இந்த முனை நகர்த்தப்படுகிறது. பிளேயரின் தலை இருக்கும் இடத்தில் ஒரு இடத்தில் இந்த முனையில் ஒரு கேமரா இணைக்கப்பட்டுள்ளது.
uk: У традиційних іграх від першої особи гравець представлений вузлом :ref:`CharacterBody3D <class_characterbody3d>`. Цей вузол переміщується шляхом обробки традиційного введення з контролера, миші або клавіатури. Камера прикріплена до цього вузла приблизно в тому місці, де буде голова гравця.
zh_tw: 在傳統第一人稱遊戲中，玩家通常由 :ref:`CharacterBody3D <class_characterbody3d>` 節點表示。這個節點透過控制器、滑鼠或鍵盤輸入來移動，相機則安裝在該節點上、約略對應玩家的頭部位置。

source: Applying this model to the XR setup, we add an :ref:`XROrigin3D <class_xrorigin3d>` node as a child of the character body, and add an :ref:`XRCamera3D <class_xrcamera3d>` as a child of the origin node. At face value this seems to work. However, upon closer examination this model does not take into account that there are two forms of movement in XR. The movement through controller input, and the physical movement of the player in the real world.
ga: Agus an tsamhail seo á cur i bhfeidhm ar an socrú XR, cuirimid nód :ref:`XROrigin3D <class_xrorigin3d>` isteach mar leanbh de chorp an charachtair, agus cuirimid :ref:`XRCamera3D <class_xrcamera3d>` mar leanbh den bhun nód. Ar aghaidh is cosúil go n-oibríonn sé seo. Tar éis scrúdú níos géire a dhéanamh, áfach, ní chuireann an tsamhail seo san áireamh go bhfuil dhá chineál gluaiseachta in XR. An ghluaiseacht trí ionchur rialtóir, agus gluaiseacht fisiciúil an imreora sa saol fíor.
ru: Применяя эту модель к конфигурации XR, мы добавляем узел :ref:`XROrigin3D <class_xrorigin3d>` в качестве дочернего узла тела персонажа и добавляем узел :ref:`XRCamera3D <class_xrcamera3d>` в качестве дочернего узла исходного узла. На первый взгляд, это работает. Однако при более внимательном рассмотрении эта модель не учитывает, что в XR существуют два вида движения: движение посредством ввода с контроллера и физическое движение игрока в реальном мире.
ta: இந்த மாதிரியை எக்ச்ஆர் அமைப்பில் பயன்படுத்துகிறோம், நாங்கள் ஒரு: ref: `xrorigin3d <class_xrorigin3d>` கதாபாத்திர உடலின் குழந்தையாக முனையாகச் சேர்க்கிறோம், மேலும் ஒரு: ref: `xrcamera3d <class_xrcamera3d>` ஆரிசின் நோட்டின் குழந்தையாக. முக மதிப்பில் இது வேலை செய்யத் தோன்றுகிறது. இருப்பினும், நெருக்கமான பரிசோதனையின் போது, இந்த மாதிரி எக்ச்ஆரில் இரண்டு வடிவ இயக்கங்கள் உள்ளன என்பதை கணக்கில் எடுத்துக்கொள்ளவில்லை. கட்டுப்படுத்தி உள்ளீடு மூலம் இயக்கம் மற்றும் உண்மையான உலகில் வீரரின் உடல் இயக்கம்.
uk: Застосовуючи цю модель до налаштувань XR, ми додаємо вузол :ref:`XROrigin3D <class_xrorigin3d>` як дочірній вузол до тіла персонажа та додаємо :ref:`XRCamera3D <class_xrcamera3d>` як дочірній вузол для початкового вузла. За номіналом це, здається, працює. Однак при більш детальному розгляді ця модель не враховує, що в XR існують дві форми руху. Рух через введення контролера та фізичний рух гравця в реальному світі.
zh_tw: 將這種模型套用到 XR 設定時，我們會在角色本體下新增 :ref:`XROrigin3D <class_xrorigin3d>` 節點作為子節點，再在原點節點下新增 :ref:`XRCamera3D <class_xrcamera3d>` 作為其子節點。表面上這看起來可行，但實際上這個模型並未考慮到 XR 裡有兩種移動方式：一種是控制器輸入造成的移動，另一種是玩家在現實空間中的實體移動。

source: As a result, the origin node does not represent the position of the player. It represents the center, or start of, the tracking space in which the player can physically move. As the player moves around their room this movement is represented through the tracking of the players headset. In game this translates to the camera node's position being updated accordingly. For all intents and purposes, we are tracking a disembodied head. Unless body tracking is available, we have no knowledge of the position or orientation of the player's body.
ga: Mar thoradh air sin, ní hionann an nód tionscnaimh agus seasamh an imreora. Léiríonn sé an t-ionad, nó tús, an spás rianaithe inar féidir leis an imreoir bogadh go fisiciúil. De réir mar a ghluaiseann an t-imreoir timpeall a seomra léirítear an ghluaiseacht seo trí rianú headset na n-imreoirí. Sa chluiche aistríonn sé seo go dtí seasamh an nód ceamara á nuashonrú dá réir. Chun gach intinn agus críocha, táimid ag rianú ceann disembodied. Mura bhfuil rianú coirp ar fáil, níl aon eolas againn ar shuíomh ná ar threoshuíomh chorp an imreora.
ta: இதன் விளைவாக, தோற்றம் முனை வீரரின் நிலையை குறிக்கவில்லை. இது வீரர் உடல் ரீதியாக நகரக்கூடிய கண்காணிப்பு இடத்தை மையமாகக் அல்லது தொடக்கத்தைக் குறிக்கிறது. வீரர் தங்கள் அறையைச் சுற்றி நகரும்போது இந்த இயக்கம் வீரர்கள் எட்செட் கண்காணிப்பதன் மூலம் குறிப்பிடப்படுகிறது. விளையாட்டில் இது கேமரா முனையின் நிலை அதற்கேற்ப புதுப்பிக்கப்படுகிறது. எல்லா நோக்கங்களுக்கும் நோக்கங்களுக்கும், நாங்கள் ஒரு தலையை கண்காணிக்கிறோம். உடல் கண்காணிப்பு கிடைக்காவிட்டால், வீரரின் உடலின் நிலை அல்லது நோக்குநிலை குறித்து எங்களுக்கு எந்த அறிவும் இல்லை.

source: The first problem this causes is fairly obvious. When the player moves with controller input, we can use the same approach in normal games and move the player in a forward direction. However the player isn't where we think they are and as we move forward we're checking collisions in the wrong location.
ga: Tá an chéad fhadhb is cúis leis seo soiléir go leor. Nuair a bhogann an t-imreoir le hionchur rialtóir, is féidir linn an cur chuige céanna a úsáid i ngnáthchluichí agus an t-imreoir a bhogadh i dtreo ar aghaidh. Mar sin féin níl an t-imreoir san áit a gceapann muid go bhfuil siad agus de réir mar a bhogaimid ar aghaidh táimid ag seiceáil imbhuailtí san áit mhícheart.
ru: Первая проблема, возникающая в результате этого, довольно очевидна. Когда игрок движется с помощью контроллера, мы можем использовать тот же подход в обычных играх и перемещать его вперёд. Однако игрок находится не там, где мы предполагаем, и при движении вперёд мы проверяем столкновения в неправильном месте.
ta: இது ஏற்படுத்தும் முதல் சிக்கல் மிகவும் வெளிப்படையானது. வீரர் கட்டுப்படுத்தி உள்ளீட்டுடன் நகரும்போது, சாதாரண விளையாட்டுகளில் அதே அணுகுமுறையைப் பயன்படுத்தலாம் மற்றும் பிளேயரை முன்னோக்கி திசையில் நகர்த்தலாம். எவ்வாறாயினும், வீரர் அவர்கள் என்று நாங்கள் நினைக்கும் இடத்தில் இல்லை, நாங்கள் முன்னேறும்போது தவறான இடத்தில் மோதல்களைச் சரிபார்க்கிறோம்.
uk: Перша проблема, яку це викликає, досить очевидна. Коли гравець рухається за допомогою контролера, ми можемо використовувати той самий підхід у звичайних іграх і рухати гравця вперед. Однак гравець знаходиться не там, де ми думаємо, і, рухаючись вперед, ми перевіряємо зіткнення в неправильному місці.
zh_tw: 這會導致第一個很明顯的問題：當玩家透過控制器移動時，我們雖然用跟普通遊戲一樣的方式讓玩家角色向前移動，但其實玩家實際在空間中的位置早就偏離預期，導致碰撞檢查會判斷錯誤的位置。

source: The second problem really shows itself when the player walks further away from the center of the tracking space and uses controller input to turn. If we rotate our character body, the player will be moved around the room in a circular fashion.
ga: Taispeánann an dara fadhb é féin i ndáiríre nuair a shiúlann an t-imreoir níos faide ar shiúl ó lár an spáis rianaithe agus úsáideann sé ionchur rialaitheora chun dul. Má rothlaímid ár gcorp carachtar, bogfar an t-imreoir timpeall an tseomra ar bhealach ciorclach.
ru: Вторая проблема особенно ярко проявляется, когда игрок отходит дальше от центра пространства отслеживания и использует управление контроллером для поворота. Если мы вращаем тело персонажа, игрок будет двигаться по комнате по кругу.
ta: கண்காணிப்பு இடத்தின் மையத்திலிருந்து வீரர் மேலும் விலகிச் செல்லும்போது இரண்டாவது சிக்கல் உண்மையில் தன்னைக் காட்டுகிறது மற்றும் திரும்புவதற்கு கட்டுப்படுத்தி உள்ளீட்டைப் பயன்படுத்துகிறது. எங்கள் கதாபாத்திர உடலை நாம் சுழற்றினால், வீரர் அறையைச் சுற்றி வட்ட பாணியில் நகர்த்தப்படுவார்.
uk: Друга проблема справді проявляється, коли гравець відходить далі від центру трекінгового простору та використовує вхідні дані контролера для повороту. Якщо ми обертаємо тіло нашого персонажа, гравець рухатиметься кімнатою по колу.
zh_tw: 第二個問題在於玩家離開追蹤空間中心、並用控制器轉動時會出現。如果我們旋轉角色本體，玩家會以圓周方式在房間內移動。

source: If we fix the above issues, we will find a third issue. When the path for the player is blocked in the virtual world, the player can still physically move forward.
ga: Má shocraíonn muid na saincheisteanna thuas, gheobhaidh muid an tríú ceist. Nuair a chuirtear bac ar chosán an imreora sa domhan fíorúil, is féidir leis an imreoir bogadh ar aghaidh go fisiciúil fós.
ru: Если мы исправим эти проблемы, то обнаружим третью: даже если путь игрока в виртуальном мире заблокирован, он всё равно может физически двигаться вперёд.
ta: மேற்கண்ட சிக்கல்களை நாங்கள் சரிசெய்தால், மூன்றாவது சிக்கலைக் காண்போம். மெய்நிகர் உலகில் வீரருக்கான பாதை தடுக்கப்படும்போது, வீரர் இன்னும் உடல் ரீதியாக முன்னேற முடியும்.
uk: Якщо ми вирішимо вищезгадані проблеми, ми знайдемо третю проблему. Коли шлях для гравця заблоковано у віртуальному світі, гравець може фізично рухатися вперед.
zh_tw: 即使我們解決了上述問題，還會遇到第三個問題：當虛擬世界中玩家路徑被擋住時，玩家在現實中還是可以繼續往前走。

source: We will look at solving the first two problem with two separate solutions, and then discuss dealing with the third.
ga: Breathnóimid ar an gcéad dá fhadhb a réiteach le dhá réiteach ar leith, agus ansin pléifimid déileáil leis an tríú ceann.
ru: Мы рассмотрим решение первых двух проблем с помощью двух отдельных решений, а затем обсудим решение третьей.
ta: முதல் இரண்டு சிக்கலை இரண்டு தனித்தனி தீர்வுகளுடன் தீர்ப்பதைப் பார்ப்போம், பின்னர் மூன்றாவது நபர்களைக் கையாள்வது பற்றி விவாதிப்போம்.
uk: Ми розглянемо вирішення перших двох проблем за допомогою двох окремих рішень, а потім обговоримо вирішення третьої.
zh_tw: 我們將用兩種不同的解法處理前兩個問題，再討論第三個問題的應對方式。

source: Origin centric solution
ga: Tuaslagán lárnach tionscnaimh
ru: Решение, ориентированное на происхождение
ta: தோற்றம் மையக் கரைசல்
uk: Оригінально-центричне рішення
zh_cn: 以原点为中心的解决方案
zh_tw: 以原點為中心的解決方案

source: Looking at the first approach for solving this we are going to change our structure. This is the approach currently implemented in XR Tools.
ga: Ag féachaint ar an gcéad chur chuige chun é seo a réiteach táimid chun ár struchtúr a athrú. Is é seo an cur chuige atá i bhfeidhm faoi láthair in Uirlisí XR.
ru: Рассматривая первый подход к решению этой проблемы, мы изменим нашу структуру. Именно этот подход в настоящее время реализован в XR Tools.
ta: இதைத் தீர்ப்பதற்கான முதல் அணுகுமுறையைப் பார்க்கும்போது, நாங்கள் எங்கள் கட்டமைப்பை மாற்றப் போகிறோம். இது தற்போது எக்ச்ஆர் கருவிகளில் செயல்படுத்தப்பட்ட அணுகுமுறை.
uk: Дивлячись на перший підхід до вирішення цього питання, ми збираємося змінити нашу структуру. Це підхід, який зараз реалізовано в XR Tools.
zh_tw: 首先我們介紹結構調整的解法，這也是 XR Tools 目前採用的方法。

source: In this setup we mark the character body as top level so it does not move with the origin.
ga: Sa thus seo marcálaimid an comhlacht carachtar mar leibhéal barr ionas nach mbogann sé leis an mbunús.
ru: В этой настройке мы помечаем тело персонажа как верхний уровень, чтобы оно не перемещалось вместе с началом координат.
ta: இந்த அமைப்பில் நாம் எழுத்து உடலை மேல் மட்டமாகக் குறிக்கிறோம், எனவே அது தோற்றத்துடன் நகராது.
uk: У цьому налаштуванні ми позначаємо тіло персонажа як верхній рівень, щоб воно не рухалося разом з початком координат.
zh_tw: 在這種架構下，將角色本體標記為頂層，讓它不會隨原點一起移動。

source: We also have a helper node that tells us where our neck joint is in relation to our camera. We use this to determine where our body center is.
ga: Tá nód cabhrach againn freisin a insíonn dúinn cá bhfuil ár gcomhpháirt muineál maidir lenár gceamara. Bainimid úsáid as seo chun a chinneadh cá bhfuil ár n-ionad comhlacht.
ru: У нас также есть вспомогательный узел, который определяет положение шейного сустава относительно камеры. Мы используем его для определения центра тела.
ta: எங்கள் கேமரா தொடர்பாக எங்கள் கழுத்து கூட்டு எங்கே என்று சொல்லும் ஒரு உதவி முனையும் எங்களிடம் உள்ளது. எங்கள் உடல் நடுவண் எங்கே என்பதை தீர்மானிக்க இதைப் பயன்படுத்துகிறோம்.
uk: У нас також є допоміжний вузол, який повідомляє нам, де знаходиться наш шийний суглоб по відношенню до нашої камери. Ми використовуємо це, щоб визначити, де знаходиться центр нашого тіла.
zh_tw: 此外，我們會加入一個輔助節點，用於標示脖子關節相對於相機的位置，藉此推算身體中心點。

source: Processing our character movement is now done in three steps.
ga: Déantar próiseáil ar ár ngluaiseacht carachtar anois i dtrí chéim.
ru: Обработка движения нашего персонажа теперь выполняется в три этапа.
ta: செயலாக்க எங்கள் எழுத்து இயக்கம் இப்போது மூன்று படிகளில் செய்யப்படுகிறது.
uk: Обробка руху нашого персонажа тепер виконується в три етапи.
zh_cn: 角色移动的处理现在要分三步进行。
zh_tw: 角色移動現在分為三個步驟處理。

source: The `Origin centric movement demo <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_origin_centric_movement>`__ contains a more elaborate example of the technique described below.
ga: Tá sampla níos ilchasta den teicníocht a bhfuil cur síos déanta uirthi thíos sa taispeántas `Origin centric movement <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_origin_centric_movement>`__.
ru: `Демонстрация движения, ориентированного на Origin <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_origin_centric_movement>`__ содержит более подробный пример техники, описанной ниже.
ta: `ஆரிசின் சென்ட்ரிக் இயக்கம் டெமோ <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_origin_centric_movement> __ __ கீழே விவரிக்கப்பட்டுள்ள நுட்பத்தின் விரிவான எடுத்துக்காட்டைக் கொண்டுள்ளது.
uk: `Демонстрація орієнтованого руху Origin <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_origin_centric_movement>`__ містить детальніший приклад техніки, описаної нижче.
zh_tw: `以原點為中心的移動範例 <https://github.com/godotengine/godot-demo-projects/tree/master/xr/openxr_origin_centric_movement>`__ 提供了下述技術更詳細的實作範例。

source: Step 1
ga: Céim 1
ru: Шаг 1
ta: படி 1
uk: Крок 1
zh_cn: 第一步
zh_tw: 步驟 1

source: In the first step we're going to process the physical movement of the player. We determine where the player is right now, and attempt to move our character body there.
ga: Sa chéad chéim táimid chun gluaiseacht fhisiciúil an imreora a phróiseáil. Cinnimid cá bhfuil an t-imreoir anois, agus déanaimid iarracht ár gcorp carachtar a bhogadh ann.
ru: На первом этапе мы обработаем физическое движение игрока. Мы определяем, где игрок находится в данный момент, и пытаемся переместить туда тело персонажа.
ta: முதல் கட்டத்தில் வீரரின் உடல் இயக்கத்தை செயலாக்கப் போகிறோம். வீரர் இப்போது எங்கே இருக்கிறார் என்பதை நாங்கள் தீர்மானிக்கிறோம், மேலும் எங்கள் கதாபாத்திர உடலை அங்கு நகர்த்த முயற்சிக்கிறோம்.
uk: На першому кроці ми обробимо фізичний рух гравця. Ми визначаємо, де зараз знаходиться гравець, і намагаємося перемістити туди своє тіло персонажа.
zh_tw: 第一步是處理玩家的實體移動。我們會偵測玩家目前所在位置，並嘗試讓角色本體移動到該處。

source: Note that we're returning ``true`` from our ``_process_on_physical_movement`` function when we couldn't move our player all the way.
ga: Tabhair faoi deara go bhfuilimid ag filleadh ''fíor'' ón bhfeidhm ''_process_on_physical_movement'' atá againn nuair nach raibh muid in ann ár n-imreoir a bhogadh an bealach ar fad.
ru: Обратите внимание, что мы возвращаем ``true`` из нашей функции ``_process_on_physical_movement``, когда нам не удалось переместить нашего игрока полностью.
ta: எங்கள் `` `` `` `` _PROCESS_ON_PHYSICAL_MOVEMENT`` செயல்பாட்டிலிருந்து `` உண்மை`` திரும்புகிறோம் என்பதை நினைவில் கொள்க.
uk: Зверніть увагу, що ми повертаємо ``true`` з нашої функції ``_process_on_physical_movement``, коли ми не можемо перемістити нашого гравця до кінця.
zh_tw: 請注意，當我們無法讓玩家完全移動到目標位置時，`_process_on_physical_movement` 函式會回傳 ``true``。

source: Step 2
ga: Céim 2
ru: Шаг 2
ta: படி 2
uk: Крок 2
zh_cn: 第二步
zh_tw: 步驟 2

source: The second step is to handle rotation of the player as a result of user input.
ga: Is é an dara céim rothlú an imreora a láimhseáil mar thoradh ar ionchur úsáideora.
ru: Вторым шагом является обработка поворота проигрывателя в результате действий пользователя.
ta: பயனர் உள்ளீட்டின் விளைவாக பிளேயரின் சுழற்சியைக் கையாள்வது இரண்டாவது படி.
uk: Другим кроком є обробка обертання гравця в результаті введення користувача.
zh_tw: 第二步是根據使用者輸入處理玩家的旋轉。

source: As the input used can differ based on your needs we are simply calling the function ``_get_rotational_input``. This function should obtain the necessary input and return the rotational speed in radians per second.
ga: Ós rud é gur féidir leis an ionchur a úsáidtear a bheith difriúil bunaithe ar do chuid riachtanas, nílimid ach ag glaoch ar an bhfeidhm ''_get_rotational_input''. Ba chóir go bhfaigheadh an fheidhm seo an t-ionchur is gá agus an luas rothlach a thabhairt ar ais i radians in aghaidh an tsoicind.
ru: Поскольку используемые входные данные могут различаться в зависимости от ваших потребностей, мы просто вызываем функцию ``_get_rotational_input``. Эта функция должна получить необходимые входные данные и вернуть скорость вращения в радианах в секунду.
ta: பயன்படுத்தப்படும் உள்ளீடு உங்கள் தேவைகளின் அடிப்படையில் வேறுபடுவதால், நாங்கள் `` _get_rotational_input`` செயல்பாட்டை அழைக்கிறோம். இந்த செயல்பாடு தேவையான உள்ளீட்டைப் பெற வேண்டும் மற்றும் சுழற்சி வேகத்தை நொடிக்கு ரேடியன்களில் திருப்பித் தர வேண்டும்.
uk: Оскільки використовувані вхідні дані можуть відрізнятися залежно від ваших потреб, ми просто викликаємо функцію ``_get_rotational_input``. Ця функція повинна отримати необхідні вхідні дані та повернути швидкість обертання в радіанах на секунду.
zh_tw: 由於專案需求不同，輸入方式也會不同，因此我們單純呼叫 `_get_rotational_input` 函式。這個函式應該取得必要的輸入，並回傳每秒弧度的旋轉速度。
