Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/3d_rendering_limitations.po
Languages: ga, ja, ta, uk

source: 3D rendering limitations
ga: Teorainneacha rindreála 3D
ja: 3Dレンダリングの制限
ta: 3D வழங்குதல் வரம்புகள்
uk: Обмеження 3D відображення

source: Introduction
ga: Réamhrá
ja: はじめに
ta: அறிமுகம்
uk: Вступ

source: Due to their focus on performance, real-time rendering engines have many limitations. Godot's renderer is no exception. To work effectively with those limitations, you need to understand them.
ga: Mar gheall ar a bhfócas ar fheidhmíocht, tá go leor teorainneacha ag innill reddála fíor-ama. Ní haon eisceacht é renderóir Godot. Chun oibriú go héifeachtach leis na teorainneacha sin, ní mór duit iad a thuiscint.
ja: リアルタイムレンダリングエンジンはパフォーマンスに重点を置いているため、多くの制限があります。Godot のレンダラーも例外ではありません。効果的にレンダリングさせるには、様々な制限を理解する必要があります。
ta: செயல்திறனில் அவர்கள் கவனம் செலுத்துவதால், நிகழ்நேர வழங்குதல் என்சின்கள் பல வரம்புகளைக் கொண்டுள்ளன. கோடோட்டின் ரெண்டரர் விதிவிலக்கல்ல. அந்த வரம்புகளுடன் திறம்பட செயல்பட, நீங்கள் அவற்றைப் புரிந்து கொள்ள வேண்டும்.
uk: Візуалізатор Godot, як і інші графічні рушії, що працюють в реальному часі, має багато обмежень у зв'язку з тим, що він орієнтований на швидкість. Для того, щоб ефективно працювати з цими обмеженнями, необхідно знати про них.

source: Texture size limits
ga: teorainneacha méide uigeachta
ja: テクスチャサイズの制限
ta: அமைப்பு அளவு வரம்புகள்
uk: Межі розміру текстури

source: On desktops and laptops, textures larger than 8192×8192 may not be supported on older devices. You can check your target GPU's limitations on `GPUinfo.org <https://www.gpuinfo.org/>`__.
ga: Ar ríomhairí deisce agus ríomhairí glúine, d’fhéadfadh sé nach dtacaítear le huigeachtaí níos mó ná 8192×8192 ar ghléasanna níos sine. Is féidir leat teorainneacha do sprioc-GPU a sheiceáil ar `GPUinfo.org <https://www.gpuinfo.org/>`__.
ja: デスクトップやラップトップでは、8192×8192 より大きいテクスチャは古いデバイスではサポートされない可能性があります。ターゲット GPU の制限については、`GPUinfo.org <https://www.gpuinfo.org/>`__ で確認できます。
ta: டெச்க்டாப்புகள் மற்றும் மடிக்கணினிகளில், 8192 × 8192 ஐ விட பெரிய அமைப்புகள் பழைய சாதனங்களில் ஆதரிக்கப்படாமல் போகலாம். உங்கள் இலக்கு GPU இன் வரம்புகளை `gpuinfo.org <https://www.gpuinfo.org/> __ __ இல் சரிபார்க்கலாம்.
uk: Більш старі ПК та ноутбуки можуть не підтримувати текстури більші ніж 8192×8192. Ви можете перевірити свій графічний процесор на `GPUinfo.org <https://www.gpuinfo.org/>`__.

source: Mobile GPUs are typically limited to 4096×4096 textures. Also, some mobile GPUs don't support repeating non-power-of-two-sized textures. Therefore, if you want your texture to display correctly on all platforms, you should avoid using textures larger than 4096×4096 and use a power of two size if the texture needs to repeat.
ga: De ghnáth bíonn GPUanna soghluaiste teoranta do 4096 × 4096 uigeachtaí. Chomh maith leis sin, ní thacaíonn roinnt GPUanna soghluaiste le uigeachtaí neamh-chumhachta dhá mhéide athrá Dá bhrí sin, más mian leat d'uigeacht a thaispeáint i gceart ar gach ardán, ba cheart duit uigeachtaí níos mó ná 4096 × 4096 a sheachaint a úsáid agus cumhacht dhá mhéid a úsáid más gá an uigeacht a athdhéanamh.
ja: モバイルGPUは通常、テクスチャは 4096×4096 までに制限されています。また一部のモバイル GPU は、2の累乗サイズ以外のテクスチャのリピートをサポートしていません。したがってテクスチャをすべてのプラットフォームで正しく表示したい場合は、4096×4096 より大きいテクスチャの使用を避け、テクスチャをリピートする必要がある場合は2の累乗サイズを使用する必要があります。
ta: மொபைல் சி.பீ.யுகள் பொதுவாக 4096 × 4096 அமைப்புகளுக்கு மட்டுமே. மேலும், சில மொபைல் சி.பீ.யுகள் இரண்டு அளவிலான சக்திகளை மீண்டும் மீண்டும் செய்வதை ஆதரிக்கவில்லை. ஆகையால், உங்கள் அமைப்பு எல்லா தளங்களிலும் சரியாகக் காண்பிக்கப்பட விரும்பினால், நீங்கள் 4096 × 4096 ஐ விட பெரிய அமைப்புகளைப் பயன்படுத்துவதைத் தவிர்க்க வேண்டும், மேலும் அமைப்பு மீண்டும் செய்ய வேண்டுமானால் இரண்டு அளவிலான சக்தியைப் பயன்படுத்த வேண்டும்.
uk: Мобільні ГП зазвичай обмежують розмір текстур до 4096×4096. Окрім цього, деякі мобільні ГП не підтримують повторення текстур, розмір яких не є степенем двійки. Тому, якщо ви хочете, щоб ваша текстура правильно відображалась на всіх платформах то вам варто уникати текстур більших ніж 4096×4096 чи таких що мають розмір не степені двійки, якщо текстуру потрібно повторювати.

source: To limit the size of a specific texture that may be too large to render, you can set the **Process > Size Limit** import option to a value greater than ``0``. This will reduce the texture's dimensions on import (preserving aspect ratio) without affecting the source file.
ga: Chun méid uigeachta ar leith a d'fhéadfadh a bheith rómhór le rindreáil a theorannú, is féidir leat an rogha iompórtála **Próiseas > Teorainn Méid** a shocrú go luach níos mó ná ``0``. Laghdóidh sé seo toisí an uigeachta ar allmhairiú (cóimheas gné a chaomhnú) gan cur isteach ar an gcomhad foinse.
ja: レンダリングするには大きすぎる可能性がある特定のテクスチャのサイズを制限するには、インポートオプションの **インポートプロセス > サイズ制限** を ``0`` より大きい値に設定します。これによりソース ファイルに影響を与えることなく、インポート時にテクスチャのサイズが縮小されます (アスペクト比は維持されます)。
ta: வழங்குவதற்கு மிகப் பெரியதாக இருக்கும் ஒரு குறிப்பிட்ட அமைப்பின் அளவைக் கட்டுப்படுத்த, நீங்கள் ** செயல்முறை> அளவு வரம்பு ** இறக்குமதி விருப்பத்தை `` 0`` ஐ விட அதிகமான மதிப்புக்கு அமைக்கலாம். இது மூல கோப்பை பாதிக்காமல் இறக்குமதியின் (விகித விகிதத்தை பாதுகாக்கும்) அமைப்பின் பரிமாணங்களைக் குறைக்கும்.
uk: Щоб обмежити розмір певної текстури, яка може бути завеликою для візуалізації, ви можете встановити для параметра імпорту **Процес > Обмеження розміру** значення, що перевищує ``0``. Це зменшить розміри текстури під час імпорту (зберігаючи співвідношення сторін), не впливаючи на вихідний файл.

source: Color banding
ga: Bandáil dathanna
ja: 色の縞模様 (バンディング)
ta: வண்ண பேண்டிங்
uk: Розшарування кольорів

source: When using the Forward+ or Forward Mobile rendering methods, Godot's 3D engine renders internally in HDR. However, the rendering output will be tonemapped to a low dynamic range so it can be displayed on the screen. This can result in visible banding, especially when using untextured materials. For performance reasons, color precision is also lower when using the Forward Mobile rendering method compared to Forward+.
ga: Agus na modhanna rindreála Forward+nó Forward Mobile á úsáid agat, déanann inneall 3D Godot a léiriú go hinmheánach i HDR. Mar sin féin, déanfar an t-aschur rindreála tonemapú go raon dinimiciúil íseal ionas gur féidir é a thaispeáint ar an scáileán. D'fhéadfadh bandáil infheicthe a bheith mar thoradh air seo, go háirithe agus ábhair neamh-uigeachta á úsáid agat Ar chúiseanna feidhmíochta, tá cruinneas datha níos ísle freisin agus an modh rindreála Forward Mobile á úsáid agat i gcomparáid le Forward +.
ja: Forward+ または Forward Mobile レンダリング方法を使用する場合、Godot の 3Dエンジンは内部的に HDR でレンダリングします。ただしレンダリング結果は画面に表示できるようにLDR (低いダイナミックレンジ)にトーンマップされます。これにより特にテクスチャのないマテリアルを使用する場合に、目に見える縞模様(バンディング)が発生する可能性があります。パフォーマンス上の理由から Forward Mobile レンダリングを使用する場合、色の精度も Forward+ に比べて低くなります。
uk: Під час використання методів візуалізації Forward+ або Forward Mobile механізм 3D від Godot внутрішньо рендерить у HDR. Однак вихідні дані візуалізації буде відображено в низькому динамічному діапазоні, щоб його можна було відобразити на екрані. Це може призвести до видимих смуг, особливо при використанні нетекстурованих матеріалів. З міркувань продуктивності точність кольору також нижча при використанні методу візуалізації Forward Mobile порівняно з Forward+.

source: When using the Compatibility rendering method, HDR is not used and the color precision is the lowest of all rendering methods. This also applies to 2D rendering, where banding may be visible when using smooth gradient textures.
ga: Agus an modh rindreála Comhoiriúnachta á úsáid, ní úsáidtear HDR agus is é an cruinneas dath an ceann is ísle de na modhanna rindreála go léir. Baineann sé seo freisin le rindreáil 2T, áit a bhféadfadh bandáil a bheith le feiceáil agus uigeachtaí míne grádáin á n-úsáid.
ja: 互換性レンダリングを使用する場合、HDR は使用されず、色の精度はすべてのレンダリング方法の中で最も低くなります。これは2Dレンダリングにも当てはまり、滑らかなグラデーションテクスチャを使用するとバンドが見える場合があります。
ta: பொருந்தக்கூடிய வழங்குதல் முறையைப் பயன்படுத்தும் போது, எச்டிஆர் பயன்படுத்தப்படவில்லை மற்றும் வண்ண துல்லியம் அனைத்து வழங்குதல் முறைகளிலும் மிகக் குறைவு. இது 2 டி ரெண்டரிங்கிற்கும் பொருந்தும், அங்கு மென்மையான சாய்வு அமைப்புகளைப் பயன்படுத்தும் போது பேண்டிங் தெரியும்.
uk: Під час використання методу відтворення сумісності HDR не використовується, а точність кольору є найнижчою з усіх методів відтворення. Це також стосується 2D-рендерінгу, де смуги можуть бути помітні під час використання гладких градієнтних текстур.

source: There are two main ways to alleviate banding:
ga: Tá dhá phríomhbhealach ann chun bandáil a mhaolú:
ja: バンディングを軽減するには、主に2つの方法があります。
ta: பேண்டிங் தணிக்க இரண்டு முக்கிய வழிகள் உள்ளன:
uk: Побороти розшарування можна двома способами:

source: Alternatively, bake some noise into your textures. This is mainly effective in 2D, e.g. for vignetting effects. In 3D, you can also use a `custom debanding shader <https://github.com/fractilegames/godot-gles2-debanding-material>`__ to be applied on your *materials*. This technique works even if your project is rendered with low color precision, which means it will work when using the Mobile and Compatibility rendering methods.
ga: De rogha air sin, cuir roinnt torainn isteach i d’uigeachtaí. Tá sé seo éifeachtach go príomha i 2D, e.g. le haghaidh éifeachtaí vignetting. I 3D, is féidir leat `scáilitheoir díbhannaí saincheaptha <https://github.com/fractilegames/godot-gles2-debanding-material>`__ a úsáid freisin le cur i bhfeidhm ar do *ábhair*. Oibríonn an teicníocht seo fiú má tá do thionscadal rindreáilte le cruinneas íseal dath, rud a chiallaíonn go n-oibreoidh sé agus na modhanna rindreála Soghluaiste agus Comhoiriúnachta á n-úsáid agat.
ja: あるいはテクスチャにノイズを焼き付けます。これは主に2Dで効果的で、たとえばビネット効果を使うときに有効です。3Dでは `カスタムデバンドシェーダー <https://github.com/fractilegames/godot-gles2-debanding-material>`__ を使用して *マテリアル* に適用することもできます。このテクニックはプロジェクトが低い色精度でレンダリングされている場合でも機能します。つまりモバイルおよび互換性レンダリングを使用する場合も機能します。
ta: மாற்றாக, உங்கள் அமைப்புகளில் சிறிது சத்தத்தை சுட்டுக்கொள்ளுங்கள். இது முக்கியமாக 2D இல் பயனுள்ளதாக இருக்கும், எ.கா. விக்னெட்டிங் விளைவுகளுக்கு. 3D இல், நீங்கள் `தனிப்பயன் பற்றாக்குறை நிழல் <https://github.com/fractilegames/godot-gles2-debanding-material> __ உங்கள் *பொருட்களில் *பயன்படுத்தப்பட வேண்டும். உங்கள் திட்டம் குறைந்த வண்ண துல்லியத்துடன் வழங்கப்பட்டாலும் இந்த நுட்பம் செயல்படுகிறது, அதாவது மொபைல் மற்றும் பொருந்தக்கூடிய வழங்குதல் முறைகளைப் பயன்படுத்தும் போது இது செயல்படும்.
uk: Крім того, додайте трохи шуму у свої текстури. Це в основному ефективно в 2D, напр. для ефектів віньєтування. У 3D ви також можете використовувати `спеціальний шейдер дебандингу <https://github.com/fractilegames/godot-gles2-debanding-material>`__ для застосування до ваших *матеріалів*. Ця техніка працює, навіть якщо ваш проект відтворюється з низькою точністю кольорів, що означає, що вона працюватиме під час використання методів візуалізації Mobile та Compatibility.

source: Color banding comparison (contrast increased for more visibility)
ga: Comparáid bandála dathanna (méadaíodh codarsnacht le haghaidh níos infhe
ja: 色のバンディングの比較（視認性を高めるためにコントラストを強めています）
ta: வண்ண பேண்டிங் ஒப்பீடு (அதிக தெரிவுநிலைக்கு மாறுபாடு அதிகரித்தது)
uk: Порівняння кольорових смуг (збільшений контраст для кращої видимості)

source: See `Banding in Games: A Noisy Rant (PDF) <https://loopit.dk/banding_in_games.pdf>`__ for more details about banding and ways to combat it.
ga: Féach `Banding in Games: A Noisy Rant (PDF) <https://loopit.dk/banding_in_games.pdf>`__ le haghaidh tuilleadh sonraí maidir le bandáil agus bealaí chun é a chomhrac.
ja: バンディングとその対処方法の詳細については `Banding in Games: A Noisy Rant (PDF) <https://loopit.dk/banding_in_games.pdf>`__ を参照してください。
ta: `விளையாட்டுகளில் பேண்டிங்: ஒரு சத்தமில்லாத ரேண்ட் (PDF) <https://loopit.dk/banding_in_games.pdf> __ __ __ __ __ __ __ __ __ __ பேட்டிங் பற்றிய கூடுதல் விவரங்கள் மற்றும் அதை எதிர்த்துப் போராடுவதற்கான வழிகள்.
uk: Перегляньте `Бандінг в іграх: галасливий вигук (PDF) <https://loopit.dk/banding_in_games.pdf>`__, щоб дізнатися більше про смуги та способи боротьби з ними.

source: Depth buffer precision
ga: Cruinneas maolán doimhne
ja: 深度バッファの精度
ta: ஆழ இடையக துல்லியம்
uk: Точність буфера глибини

source: To sort objects in 3D space, rendering engines rely on a *depth buffer* (also called *Z-buffer*). This buffer has a finite precision: 24-bit on desktop platforms, sometimes 16-bit on mobile platforms (for performance reasons). If two different objects end up on the same buffer value, then Z-fighting will occur. This will materialize as textures flickering back and forth as the camera moves or rotates.
ga: Chun rudaí a shórtáil i spás 3D, bíonn innill rindreála ag brath ar *maolán doimhneachta* (ar a dtugtar *Z-maolán* freisin). Tá cruinneas teoranta ag an maolán seo: 24-giotán ar ardáin deisce, uaireanta 16-giotán ar ardáin soghluaiste (ar chúiseanna feidhmíochta). Má chríochnaíonn dhá rud dhifriúla ar an luach maolánach céanna, ansin tarlóidh Z-troid. Rachaidh sé seo i gcrích agus uigeachtaí ag caochadh anonn is anall de réir mar a ghluaiseann nó a rothlaíonn an ceamara.
ja: 3D空間でオブジェクトをソートするために、レンダリングエンジンは *深度バッファ* (Zバッファとも呼ばれます) に依存します。パフォーマンス上の理由からこのバッファの精度は有限で、デスクトッププラットフォームでは24ビット、モバイル プラットフォームでは16ビットになることもあります。2つの異なるオブジェクトが同じバッファ値になると、Zファイティングが発生します。これはカメラが移動または回転するとテクスチャが前後にちらつくことで現れます。
ta: 3D இடத்தில் பொருள்களை வரிசைப்படுத்த, வழங்குதல் என்சின்கள் *ஆழம் இடையகத்தை *நம்பியுள்ளன ( *Z- BUFFER *என்றும் அழைக்கப்படுகின்றன). இந்த இடையக ஒரு வரையறுக்கப்பட்ட துல்லியத்தைக் கொண்டுள்ளது: டெச்க்டாப் இயங்குதளங்களில் 24 பிட், சில நேரங்களில் மொபைல் தளங்களில் 16-பிட் (செயல்திறன் காரணங்களுக்காக). இரண்டு வெவ்வேறு பொருள்கள் ஒரே இடையக மதிப்பில் முடிவடைந்தால், இசட்-சண்டை ஏற்படும். கேமரா நகரும் அல்லது சுழலும் போது கட்டமைப்புகள் முன்னும் பின்னுமாக ஒளிரும் என்பதால் இது செயல்படும்.
uk: Візуалізатори використовують буфер глибини (який іноді називають *Z-буфер*) щоб відсортувати об'єкти в тривимірному просторі. Цей буфер має обмежену точність: 24 біти на комп'ютерах та 16 біт на мобільних пристроях (це питання продуктивности). Якщо два об'єкти мають однакове значення в буфері, то відбудеться конфлікт між ними. Виглядає це як постійне мерехтіння текстур взад-перед коли камера рухається чи обертається.

source: To make the depth buffer more precise over the rendered area, you should *increase* the Camera node's **Near** property. However, be careful: if you set it too high, players will be able to see through nearby geometry. You should also *decrease* the Camera node's **Far** property to the lowest permissible value for your use case, though keep in mind it won't impact precision as much as the **Near** property.
ga: Chun an maolán doimhneachta a dhéanamh níos cruinne thar an limistéar rindreáilte, ba cheart duit* maoin **Gear** an nód Ceamara a mhéadú*. Mar sin féin, bí cúramach: má shocraíonn tú é ró-ard, beidh imreoirí in ann a fheiceáil trí ghéimseadracht in aice láimhe. Ba chóir duit* maoin **Far** an nód Ceamara a laghdú* go dtí an luach is ísle incheadaithe le do chás úsáide, ach coinnigh i gcuimhne ní bheidh tionchar aige ar chruinneas an oiread agus an maoin **Near-**.
ja: レンダリングされた領域で深度バッファをより正確にするには、Cameraノードの **Near** プロパティを *増やす* 方法があります。ただし注意が必要で、Near値が高すぎるとプレイヤーは近くのジオメトリが透明になってしまいます。またCameraノードの **Far** プロパティを、使用ケースで許容される最小値まで *減らす* 方法もありますが、**Near** プロパティほど精度に影響しないことに注意してください。
ta: வழங்கப்பட்ட பகுதியை விட ஆழ இடையகத்தை மேலும் துல்லியமாக மாற்ற, நீங்கள் ** சொத்துக்கு அருகில் கேமரா முனையின் ** அதிகரிக்க வேண்டும். இருப்பினும், கவனமாக இருங்கள்: நீங்கள் அதை மிக அதிகமாக அமைத்தால், வீரர்கள் அருகிலுள்ள வடிவியல் மூலம் பார்க்க முடியும். கேமரா முனையின் ** தொலைதூர ** சொத்து உங்கள் பயன்பாட்டு வழக்குக்கு மிகக் குறைந்த அனுமதிக்கப்பட்ட மதிப்புக்கு நீங்கள்*குறைக்க வேண்டும், இருப்பினும் இது ** அருகிலுள்ள ** சொத்துக்களைப் போலவே துல்லியத்தை பாதிக்காது என்பதை நினைவில் வைத்துக் கொள்ளுங்கள்.
uk: Щоби буфер точніше працював з областю, що відображається, варто збільшити параметр вузла камери **Near** (ближня межа). Але будьте обережні: якщо задати надто високе значення, гравець може почати дивитись крізь ближні об'єкти. Також варто зменшити параметр камери **Far** (дальня межа) наскільки це можливо. Проте пам'ятайте, що він не так сильно впливає на точність як „**Near**“.

source: If you only need high precision when the player can see far away, you could change it dynamically based on the game conditions. For instance, if the player enters an airplane, the **Near** property can be temporarily increased to avoid Z-fighting in the distance. It can then be decreased once the player leaves the airplane.
ga: Mura dteastaíonn cruinneas ard uait ach nuair is féidir leis an imreoir a fheiceáil i bhfad ar shiúl, d'fhéadfá é a athrú go dinimiciúil bunaithe ar choinníoll Mar shampla, má théann an t-imreoir isteach in eitleán, is féidir an maoin **Near** a mhéadú go sealadach chun troid Z a sheachaint san achar. Is féidir é a laghdú ansin nuair a fhágann an t-imreoir an t-eitleán.
ja: プレイヤーが遠くを見るときにのみ高精度にする場合は、ゲームの状況に応じて動的に変更することもできます。たとえばプレイヤーが飛行機に乗ったとき、遠くのZファイティングを回避するために、**Near** プロパティを一時的に増加させます。そしてプレイヤーが飛行機を離れたら、**Near** プロパティを減らします。
ta: பிளேயர் வெகு தொலைவில் பார்க்கும்போது உங்களுக்கு அதிக துல்லியம் மட்டுமே தேவைப்பட்டால், விளையாட்டு நிலைமைகளின் அடிப்படையில் அதை மாறும் வகையில் மாற்றலாம். உதாரணமாக, வீரர் ஒரு விமானத்தில் நுழைந்தால், தூரத்தில் இசட்-சண்டையைத் தவிர்ப்பதற்காக ** அருகிலுள்ள ** சொத்துக்களை தற்காலிகமாக அதிகரிக்க முடியும். வீரர் விமானத்தை விட்டு வெளியேறியவுடன் அதைக் குறைக்கலாம்.
uk: Якщо вам потрібна висока точність лише коли гравець дивиться в далечінь, то ви можете змінювати її на ходу, залежно від ситуації. Для прикладу, якщо гравець сідає в літак, то параметр **Near** можна збільшити щоб уникнути конфліктів за Z-буфер на відстані. Значення можна зменшити щойно гравець покине літак.

source: Depending on the scene and viewing conditions, you may also be able to move the Z-fighting objects further apart without the difference being visible to the player.
ga: Ag brath ar an radharc agus ar na coinníollacha féachana, b'fhéidir go mbeidh tú in ann na rudaí troid Z a bhogadh níos faide óna chéile gan an difríocht a bheith le feiceáil don imreoir.
ja: シーンや表示条件によっては、プレイヤーに違いが見えない状態で、Zファイティングが発生するオブジェクトをさらに離すこともできます。
ta: காட்சி மற்றும் பார்க்கும் நிலைமைகளைப் பொறுத்து, பிளேயருக்கு வேறுபாடு இல்லாமல் நீங்கள் இசட்-சண்டை பொருள்களை மேலும் ஒதுக்கி வைக்க முடியும்.
uk: Залежно від сцени та умов, у вас може бути можливість просто розсунути конфліктні об'єкти один від одного без суттєвого впливу на вигляд сцени.

source: Z-fighting comparison (before and after tweaking the scene by offsetting the Label3D away from the floor)
ga: Comparáid comhrac Z (roimh agus tar éis an radharc a athrú tríd an Label3D a fhritháireamh ar shiúl ón urlár)
ja: Z ファイティングの比較 (Label3D を床からオフセットしてシーンを微調整する前と後)
ta: இசட்-சண்டை ஒப்பீடு (லேபிள் 3 டி தரையிலிருந்து விலகிச் செல்வதன் மூலம் காட்சியை மாற்றுவதற்கு முன்னும் பின்னும்)
uk: Порівняння Z-fighting (до та після налаштування сцени шляхом зміщення Label3D від підлоги)

source: Transparency sorting
ga: Sórtáil trédhearc
ja: 半透明のソート
ta: வெளிப்படைத்தன்மை வரிசையாக்கம்
uk: Перебір по прозорості

source: In Godot, transparent materials are drawn after opaque materials. Transparent objects are sorted back to front before being drawn based on the Node3D's position, not the vertex position in world space. Due to this, overlapping objects may often be sorted out of order. To fix improperly sorted objects, tweak the material's :ref:`Render Priority <class_Material_property_render_priority>` property or the node's :ref:`Sorting Offset <class_VisualInstance3D_property_sorting_offset>`. Render Priority will force specific materials to appear in front of or behind other transparent materials, while Sorting Offset will move the object forward or backward for the purpose of sorting. Even then, these may not always be sufficient.
ga: I Godot, tarraingítear ábhair thrédhearcacha tar éis ábhair teimhneach. Déantar réada trédhearcacha a shórtáil siar chun tosaigh sula dtarraingítear iad bunaithe ar shuíomh an Node3D, ní ar shuíomh na rinn sa spás domhanda. Mar gheall air seo, is minic go mbíonn rudaí forluiteacha curtha in ord in ord. Chun réada atá sórtáilte go míchuí a shocrú, tweak :tag:`Tosaíocht Rindreála <class_Material_property_render_priority>` airí nó :ref:`Fritháireamh Sórtáil <class_VisualInstance3D_property_sorting_offset>` an ábhair. Cuirfidh Tosaíocht Rindreála iallach ar ábhair shonracha láithriú os comhair nó taobh thiar d’ábhair thrédhearcacha eile, agus bogfaidh Sórtáil Fritháireamh an réad ar aghaidh nó siar chun críche sórtála. Fiú amháin ansin, b’fhéidir nach leor iad seo i gcónaí.
ja: Godot では半透明マテリアルは不透明マテリアルの後に描画されます。半透明オブジェクトはワールド空間の頂点位置ではなく、Node3D の位置に基づいて描画される前に後ろから前にソートされます。このため重なり合ったオブジェクトは順序どおりにソートされないことがよくあります。不適切にソートされたオブジェクトを修正するには、マテリアルの :ref:`レンダリング優先順位 <class_Material_property_render_priority>` プロパティまたはノードの :ref:`ソートオフセット <class_VisualInstance3D_property_sorting_offset>` を微調整します。レンダリング優先順位は特定のマテリアルを他の半透明マテリアルの前または後ろに表示するように強制し、ソートオフセットはソートのためにオブジェクトを前後に移動します。しかしこれらを行っても、必ずしも十分ではない場合があります。
ta: கோடோட்டில், ஒளிபுகா பொருட்களுக்குப் பிறகு வெளிப்படையான பொருட்கள் வரையப்படுகின்றன. நோட் 3 டி நிலையின் அடிப்படையில் வரையப்படுவதற்கு முன்பு வெளிப்படையான பொருள்கள் முன்னால் வரிசைப்படுத்தப்படுகின்றன, உலக இடைவெளியில் வெர்டெக்ச் நிலை அல்ல. இதன் காரணமாக, ஒன்றுடன் ஒன்று பொருள்களை ஒழுங்கற்றதாக வரிசைப்படுத்தலாம். முறையற்ற முறையில் வரிசைப்படுத்தப்பட்ட பொருள்களை சரிசெய்ய, பொருளை மாற்றியமைக்க: குறிப்பு: `முன்னுரிமையை வழங்கவும் <class_material_property_render_priority>` சொத்து அல்லது முனை: ref: `Class_visualinstance3d_property_sorting_offset>`. வழங்கும் முன்னுரிமை குறிப்பிட்ட பொருட்களை மற்ற வெளிப்படையான பொருட்களுக்கு முன்னால் அல்லது பின்னால் தோன்றும்படி கட்டாயப்படுத்தும், அதே நேரத்தில் ஆஃப்செட்டை வரிசைப்படுத்துவது வரிசைப்படுத்தும் நோக்கத்திற்காக பொருளை முன்னோக்கி அல்லது பின்னோக்கி நகர்த்தும். அப்படியிருந்தும், இவை எப்போதும் போதுமானதாக இருக்காது.
uk: У Годо прозорі матеріали малюються після непрозорих матеріалів. Прозорі об’єкти сортуються задом наперед перед малюванням на основі положення Node3D, а не положення вершини у світовому просторі. Через це об’єкти, що накладаються, часто можуть бути відсортовані не по порядку. Щоб виправити неправильно відсортовані об’єкти, змініть властивість :ref:`Render Priority <class_Material_property_render_priority>` матеріалу або :ref:`Sorting Offset <class_VisualInstance3D_property_sorting_offset>` вузла. Пріоритет візуалізації змусить певні матеріали відображатися перед або позаду інших прозорих матеріалів, тоді як Зміщення сортування переміщуватиме об’єкт вперед або назад з метою сортування. Навіть тоді цього не завжди може бути достатньо.

source: Some rendering engines feature *order-independent transparency* techniques to alleviate this, but this is costly on the GPU. Godot currently doesn't provide this feature. There are still several ways to avoid this problem:
ga: Tá teicnícke*trédhearcacht neamhspleách ar ordú* ag roinnt innill rindreála chun é seo a mhaolú, ach tá sé seo costasach ar an GPU. Faoi láthair ní sholáthraíonn Godot an ghné seo. Tá bealaí éagsúla ann fós chun an fhadhb seo a sheachaint:
ja: 一部のレンダリングエンジンでは、この問題を軽減するために *順序に依存しない半透明* 技術を採用していますが、これは GPU に負担がかかります。Godot は現在この機能を提供していません。この問題を回避する方法はいくつかあります。
ta: சில வழங்குதல் என்சின்கள் இதைத் தணிக்க ஆர்டர்-சுயாதீன வெளிப்படைத்தன்மை * நுட்பங்களைக் கொண்டுள்ளன, ஆனால் இது சி.பீ.யுவில் விலை உயர்ந்தது. கோடோட் தற்போது இந்த அம்சத்தை வழங்கவில்லை. இந்த சிக்கலைத் தவிர்க்க இன்னும் பல வழிகள் உள்ளன:
uk: Деякі візуалізатори мають змогу побороти це використовуючи *порядко-незалежну прозорість*, але вона сильно навантажує відеоприскорювач. На даний момент, Godot не має таких можливостей. Але у вас є декілька шляхів уникнення проблеми:
