Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/3d_rendering_limitations.po
Languages: ga, ja, ta, uk

source: Only make materials transparent if you actually need it. If a material only has a small transparent part, consider splitting it into a separate material. This will allow the opaque part to cast shadows and will also improve performance.
ga: Ní déan ábhair trédhearcach ach má theastaíonn uait i ndáiríre. Mura bhfuil ach cuid bheag trédhearcach ag ábhar, smaoinigh ar é a roinnt ina ábhar ar leithligh. Ligfidh sé seo don chuid trédhearcach scáthanna a chaitheamh agus feabhsóidh sé feidhmíocht freisin.
ja: 実際に必要なものだけマテリアルを半透明にしてください。マテリアルに小さな半透明部分しかない場合は、別のマテリアルに分割することを検討してください。これにより不透明部分は影を落とすことができ、パフォーマンスも向上します。
ta: உங்களுக்கு உண்மையில் தேவைப்பட்டால் மட்டுமே பொருட்களை வெளிப்படையானதாக ஆக்குங்கள். ஒரு பொருள் ஒரு சிறிய வெளிப்படையான பகுதியை மட்டுமே கொண்டிருந்தால், அதை ஒரு தனி பொருளாகப் பிரிப்பதைக் கவனியுங்கள். இது ஒளிபுகா பகுதியை நிழல்களைக் காட்ட அனுமதிக்கும், மேலும் செயல்திறனையும் மேம்படுத்தும்.
uk: Робіть матеріали прозорими, лише якщо це вам дійсно потрібно. Якщо матеріал має лише невелику прозору частину, розгляньте можливість розділити його на окремий матеріал. Це дозволить непрозорій частині відкидати тіні, а також покращить продуктивність.

source: If your texture mostly has fully opaque and fully transparent areas, you can use alpha testing instead of alpha blending. This transparency mode is faster to render and doesn't suffer from transparency issues. Enable **Transparency > Transparency** to **Alpha Scissor** in StandardMaterial3D, and adjust **Transparency > Alpha Scissor Threshold** accordingly if needed. Note that MSAA will not antialias the texture's edges unless alpha antialiasing is enabled in the material's properties. However, FXAA, TAA and supersampling will be able to antialias the texture's edges regardless of whether alpha antialiasing is enabled on the material.
ga: Má tá limistéir atá go hiomlán teimhneach agus go hiomlán trédhearcach den chuid is mó ag d'uigeacht, is féidir leat tástáil alfa a úsáid in ionad cumasc alfa. Is féidir an modh trédhearcachta seo a sholáthar níos tapúla agus ní bhíonn fadhbanna trédhearcachta ann. Cumasaigh **Trédhearcacht > Trédhearcacht** go **Alpha Scissor** i StandardMaterial3D, agus coigeartaigh **Trédhearcacht > Tairseach Siosúr Alfa** dá réir más gá. Tabhair faoi deara nach ndéanfaidh MSAA imill na huigeachta frithaliasú mura rud é go bhfuil alfa-frithaliasú cumasaithe in airíonna an ábhair. Mar sin féin, beidh FXAA, TAA agus supersampling in ann antialias imill an uigeachta is cuma an bhfuil antialiasing alfa cumasaithe ar an ábhar.
ja: テクスチャのほとんどが完全に不透明で完全に半透明な領域である場合は、アルファブレンディングの代わりにアルファテストを使用できます。この透過モードはレンダリングが高速で、半透明の問題が発生しません。StandardMaterial3D で **Transparency > Transparency** から **Alpha Scissor** を有効にし、必要に応じて **Transparency > Alpha Scissor Threshold** を調整します。マテリアルのプロパティでアルファアンチエイリアシングが有効になっていない限り、MSAA はテクスチャのエッジをアンチエイリアシングしないことに注意してください。ただし、FXAA、TAA、およびスーパーサンプリングは、マテリアルでアルファアンチエイリアシングが有効になっているかどうかに関係なく、テクスチャのエッジをアンチエイリアシングできます。
ta: உங்கள் அமைப்பு பெரும்பாலும் முழுமையாக ஒளிபுகா மற்றும் முழுமையாக வெளிப்படையான பகுதிகளைக் கொண்டிருந்தால், ஆல்பா கலப்புக்கு பதிலாக ஆல்பா சோதனையைப் பயன்படுத்தலாம். இந்த வெளிப்படைத்தன்மை பயன்முறை வழங்க வேகமானது மற்றும் வெளிப்படைத்தன்மை சிக்கல்களால் பாதிக்கப்படாது. ** வெளிப்படைத்தன்மை> வெளிப்படைத்தன்மை ** முதல் ** ஆல்பா கத்தரிக்கோல் ** வரை ச்டாண்டர்ட்டிமேட்டரியல் 3 டி இல் இயக்கவும், ** வெளிப்படைத்தன்மை> ஆல்பா கத்தரிக்கோல் வாசலை ** அதற்கேற்ப தேவைப்பட்டால் சரிசெய்யவும். பொருளின் பண்புகளில் ஆல்பா ஆன்டியாலியாசிங் இயக்கப்பட்டாலொழிய, MSAA அமைப்பின் விளிம்புகளை ஆன்டியாலியாச் செய்யாது என்பதை நினைவில் கொள்க. இருப்பினும், FXAA, TAA மற்றும் சூப்பர்சாம்ப்ளிங் ஆகியவை பொருளின் மீது ஆல்பா ஆன்டிலியாசிங் இயக்கப்பட்டிருக்கிறதா என்பதைப் பொருட்படுத்தாமல் அமைப்பின் விளிம்புகளை ஆன்டியாலியாச் செய்ய முடியும்.
uk: Якщо ваша текстура переважно має повністю непрозорі та повністю прозорі області, ви можете використовувати альфа-тестування замість альфа-змішування. Цей режим прозорості швидше візуалізується та не має проблем із прозорістю. Увімкніть **Прозорість > Прозорість** на **Альфа-ножиці** у StandardMaterial3D і відповідно налаштуйте **Прозорість > Порогове значення альфа-ножиць**, якщо потрібно. Зауважте, що MSAA не згладжуватиме краї текстури, якщо альфа-згладжування не ввімкнено у властивостях матеріалу. Однак FXAA, TAA та суперсемплінг зможуть згладжувати краї текстури незалежно від того, чи ввімкнено альфа-згладжування на матеріалі.

source: If you need to render semi-transparent areas of the texture, alpha scissor isn't suitable. Instead, setting the StandardMaterial3D's **Transparency > Transparency** property to **Depth Pre-Pass** can sometimes work (at a performance cost). You can also try the **Alpha Hash** mode.
ga: Más gá duit achair leath-trédhearcacha den uigeacht a sholáthar, níl an siosúr alfa oiriúnach. Ina áit sin, uaireanta is féidir oibriú uaireanta (ar chostas feidhmíochta) chun maoin **Trédhearcacht > Trédhearcacht** an StandardMaterial3D a shocrú go **Doimhneacht Réamhphas**. Is féidir leat freisin triail a bhaint as an modh **Alfa Hash**.
ja: テクスチャの半透明領域をレンダリングする必要がある場合、アルファシザーは適していません。代わりに StandardMaterial3D の **Transparency > Transparency** プロパティを **Depth Pre-Pass** に設定すると、機能する場合があります (いくらかパフォーマンス コストがかかります)。**Alpha Hash** モードを試すこともできます。
ta: அமைப்பின் அரை-வெளிப்படையான பகுதிகளை நீங்கள் வழங்க வேண்டும் என்றால், ஆல்பா கத்தரிக்கோல் பொருத்தமானதல்ல. அதற்கு பதிலாக, StandardMaterial3D இன் ** வெளிப்படைத்தன்மை> வெளிப்படைத்தன்மை ** சொத்தை ** ஆழம் முன்-பாச் ** க்கு அமைப்பது சில நேரங்களில் வேலை செய்யலாம் (செயல்திறன் செலவில்). நீங்கள் ** ஆல்பா ஆச் ** பயன்முறையையும் முயற்சி செய்யலாம்.
uk: Якщо вам потрібно відрендерити напівпрозорі ділянки текстури, alpha scissor не підходить. Натомість встановлення властивості **Прозорість > Прозорість** StandardMaterial3D на **Попередній проход глибини** іноді може спрацювати (за ціною продуктивності). Ви також можете спробувати режим **Alpha Hash**.

source: If you want a material to fade with distance, use the StandardMaterial3D distance fade mode **Pixel Dither** or **Object Dither** instead of **Pixel Alpha**. This will make the material opaque, which also speeds up rendering.
ga: Más mian leat go n-éireoidh ábhar le fad, bain úsáid as an modh éadú achair caighdeánMaterial3D**Pixel Dither** nó **Object Dither** in ionad**Pixel Alfa**. Déanfaidh sé seo an t-ábhar trédhearcach, a chuireann luasú le rindreáil freisin.
ja: 距離に応じてマテリアルをフェードさせたい場合は、**Pixel Alpha** ではなく、StandardMaterial3D 距離フェード モードの **Pixel Dither** または **Object Dither** を使用します。これによりマテリアルが不透明になり、レンダリングも高速化されます。
ta: ஒரு பொருள் தூரத்துடன் மங்க வேண்டும் என்று நீங்கள் விரும்பினால், ** படப்புள்ளி ஆல்பா ** க்கு பதிலாக StandardMaterial3D தூர மங்கலான பயன்முறையைப் பயன்படுத்தவும் ** படப்புள்ளி டில்ட் ** அல்லது ** பொருள் டிதர் **. இது பொருள் ஒளிபுகாதாக இருக்கும், இது வழங்குதல் செய்வதையும் விரைவுபடுத்துகிறது.
uk: Якщо ви хочете, щоб матеріал зникав із відстанню, використовуйте режим згасання на відстані StandardMaterial3D **Pixel Dither** або **Object Dither** замість **Pixel Alpha**. Це зробить матеріал непрозорим, що також прискорить рендеринг.

source: Transparency sorting comparison (alpha-blended materials on the left, alpha scissor materials on the right)
ga: Comparáid sórtála trédhearcachta (ábhair chumasctha alfa ar chlé, ábhair siosúr alfa ar dheis)
ja: 半透明のタイプの比較（左がアルファブレンド、右がアルファシザー）
ta: வெளிப்படைத்தன்மை வரிசையாக்க ஒப்பீடு (இடதுபுறத்தில் ஆல்பா-கலப்பு பொருட்கள், வலதுபுறத்தில் ஆல்பா கத்தரிக்கோல் பொருட்கள்)
uk: Порівняння сортування прозорості (альфа-змішані матеріали ліворуч, альфа-ножиці праворуч)

source: Multi-sample antialiasing
ga: Antialiasing ilshamplach
ja: MSAA
uk: Багатовибіркове згладжування

source: Antialiasing is explained in detail on the :ref:`doc_3d_antialiasing` page.
ga: Mínítear antialiasing go mion ar an leathanach:ref: `doc_3d_antialiasing`.
ja: アンチエイリアシングについては、 :ref:`doc_3d_antialiasing` ページで詳しく説明されています。
uk: Згладжування детально описано на сторінці :ref:`doc_3d_antialiasing`.

source: Multi-sample antialiasing (MSAA) takes multiple *coverage* samples at the edges of polygons when rendering objects. It does not increase the number of *color* samples used to render a scene. Here's what this means in practice:
ga: Tógann antialiasing il-shamplaí (MSAA) samplaí* clúdaithe* iolracha ag imill na bpolagóin agus rudaí á rindreáil. Ní mhéadaíonn sé líon na samplaí* dath* a úsáidtear chun radharc a léiriú. Seo a chiallaíonn sé seo go praiticiúil:
ja: MSAA (マルチサンプルアンチエイリアシング)は、オブジェクトをレンダリングするときにポリゴンのエッジで複数の *カバレッジ* サンプルを取得します。シーンのレンダリングに使用される *カラー* サンプルの数は増加しません。これは実際には次のことを意味します。
uk: Багатовибіркове зглажування (MSAA) бере декілька наборів *покривають* пікселів на ребрах полігонів коли об'єкти відображаються. Воно не збільшує кількости *кольорових* пікселів що використані у сцені. Що це значить на практиці:

source: Edges of meshes will be smoothed out nicely (as well as supersampling would).
ga: Déanfar imill na mogalra a réiteach go deas (chomh maith le supersampláil).
ja: メッシュのエッジは（スーパーサンプリングと同様に）きれいに滑らかになります。
uk: Ребра геометричних фігур будуть гладенькими (такими ж, якими вони були б при перевибірковому згладжуванні).

source: Transparent materials that use *alpha testing* (1-bit transparency) won't be smoothed out.
ga: Ní dhéanfar ábhair thrédhearcacha a úsáideann tástáil alfa* (trédhearcacht 1-giotán) a réiteach.
ja: *アルファテスト* (1ビットの透明度) を使用するマテリアルは滑らかになりません。
uk: Прозорі матеріяли, що використовують *alpha testing* (однобітну прозорість) не будуть згладжуватись.

source: Specular aliasing ("sparkles" that appear on reflective surfaces) won't be reduced.
ga: Ní laghdófar aileasú speisialta (“spréilí” atá le feiceáil ar dhromchlaí frithchaiteacha).
ja: 鏡面反射エイリアシング (反射面に現れる「輝き」) は軽減されません。
uk: Відблиски на блискучих поверхнях не будуть згладжуватись.

source: There are several ways to work around this limitation depending on your performance budget:
ga: Tá roinnt bealaí ann chun oibriú timpeall ar an teorainn seo ag brath ar do bhuiséad feidhmíochta:
ja: パフォーマンスの制約に応じて、この制限を回避する方法はいくつかあります:
uk: Залежно від величини продуктивності, якою ви можете пожертвувати, ви можете обійти вищезгадані обмеження таким чином:

source: To make specular aliasing less noticeable, open the Project Settings and enable **Rendering > Quality > Screen Space Filters > Screen Space Roughness Limiter**. This filter has a moderate cost on performance, so it should only be enabled if you actually need it.
ga: Chun an t-ailiasacht amhantrach a dhéanamh níos lú faoi deara, oscail Socruithe an Tionscadail agus cumasaigh ** Rindreáil > Cáilíocht > Scagairí Spáis Scáileáin > Teorantóir Garmhachta Spás Scáileáin**. Tá costas measartha ar fheidhmíocht ag an scagaire seo, mar sin níor cheart é a chumasú ach amháin má tá sé de dhíth ort i ndáiríre.
ja: 鏡面反射エイリアシングを目立たなくするには、プロジェクト設定を開き、**レンダリング > アンチエイリアス > Screen Space Roughness Limiter** を有効にします。このフィルターはパフォーマンスに中程度の負荷がかかるため、実際に必要な場合にのみ有効にしてください。
uk: Щоб зробити віддзеркалення менш помітним, відкрийте налаштування проекту та ввімкніть **Відтворення > Якість > Фільтри екранного простору > Обмежувач шорсткості екранного простору**. Цей фільтр має помірну вартість продуктивності, тому його слід увімкнути, лише якщо він вам дійсно потрібен.

source: Enable fast approximate antialiasing (FXAA) in addition to (or instead of) MSAA. Since FXAA is a screen-space antialiasing method, it will smooth out anything. As a downside, FXAA also makes the scene appear blurrier, especially at resolutions below 1440p. FXAA also lacks temporal information, which means its impact on specular aliasing is limited.
ga: Cumasaigh frith-thart tapa (FXAA) i dteannta (nó in ionad) MSAA. Ós rud é gur modh antialiasing spáis scáileáin é FXAA, déanfaidh sé rud ar bith a réiteach. Mar mhíbhuntáiste, déanann FXAA an radharc níos doiléire freisin, go háirithe ag rúin faoi bhun 1440p. Níl faisnéis ama ag FXAA freisin, rud a chiallaíonn go bhfuil a thionchar ar aliasing speisialta teoranta.
ja: MSAA に加えて (または MSAA の代わりに) 高速近似アンチエイリアシング (FXAA) を有効にします。FXAA はスクリーンスペース方式であるため、あらゆるものを滑らかにします。欠点として FXAA では、特に 1440p 未満の解像度では、シーンがぼやけて見えることがあります。FXAA には時間情報もないため、鏡面反射エイリアシングへの影響は限られています。
uk: Увімкніть швидке наближене згладжування (FXAA) на додаток до (або замість) MSAA. Оскільки FXAA — це метод згладжування екранного простору, він згладить будь-що. Як мінус, FXAA також робить сцену більш розмитою, особливо при роздільній здатності нижче 1440p. FXAA також не має тимчасової інформації, що означає, що його вплив на дзеркальне згладжування обмежений.

source: Enable temporal antialiasing (TAA) in addition to (or instead of) MSAA. Since TAA is a screen-space antialiasing method, it will smooth out anything. As a downside, TAA also makes the scene appear blurrier, especially at resolutions below 1440p. TAA provides superior quality compared to FXAA and can effectively combat specular aliasing. However, TAA has a greater performance cost compared to FXAA, and TAA can introduce ghosting artifacts with fast movement.
ga: Cumasaigh antialiasing ama (TAA) i dteannta (nó in ionad) MSAA. Ós rud é gur modh antialiasing spáis scáileáin é TAA, déanfaidh sé rud ar bith a réiteach. Mar mhíbhuntáiste, déanann TAA go bhfuil an radharc níos doiléire freisin, go háirithe ag rúin faoi bhun 1440p. Soláthraíonn TAA caighdeán níos fearr i gcomparáid le FXAA agus féadann sé dul i ngleic go héifeachtach ar aliasing Mar sin féin, tá costas feidhmíochta níos mó ag TAA i gcomparáid le FXAA, agus is féidir le TAA déantáin ghosting a thabhairt isteach le gluaiseacht tapa.
ja: MSAA に加えて (または MSAA の代わりに) テンポラルアンチエイリアシング (TAA) を有効にします。TAA はスクリーンスペース方式であるため、あらゆるものを滑らかにします。欠点としては TAA を使用すると、特に 1440p 未満の解像度では、シーンがぼやけて見えることがあります。TAA は FXAA に比べて優れた品質を提供し、鏡面反射エイリアシングを効果的に抑制できます。ただし TAA は FXAA に比べてパフォーマンス コストが高く、動きが速い場合にゴーストアーティファクトが発生する可能性があります。
uk: Увімкніть тимчасове згладжування (TAA) на додаток до (або замість) MSAA. Оскільки TAA — це метод згладжування екранного простору, він згладить будь-що. Як мінус, TAA також робить сцену більш розмитою, особливо при роздільній здатності нижче 1440p. TAA забезпечує кращу якість порівняно з FXAA та може ефективно боротися з дзеркальним накладанням. Однак TAA має більшу вартість продуктивності порівняно з FXAA, і TAA може вводити ореоли артефактів під час швидкого руху.

source: Render the scene at a higher resolution by increasing the **Scaling 3D > Scale** project setting above ``1.0``. This technique is called supersample antialiasing (SSAA) and is very slow. Its use is generally only recommended for offline rendering.
ga: Cuir an radharc ar fáil ar thaifeach níos airde tríd an socrú tionscadail **Scálú 3D > Scála** a mhéadú os cionn ``1.0``. Tugtar antialiasing supersample (SSAA) ar an teicníc seo agus tá sé an-mhall. Go ginearálta ní mholtar é a úsáid ach amháin le haghaidh rindreála as líne.
ja: プロジェクト設定の **3Dスケール > スケール** を ``1.0`` より大きくして、シーンをより高い解像度でレンダリングします。この手法はスーパーサンプルアンチエイリアシング (SSAA) と呼ばれ、品質は最高ですが非常に低速です。一般的にオフラインレンダリングでのみ使用することをお勧めします。
uk: Зробіть візуалізацію сцени з вищою роздільною здатністю, збільшивши параметр проекту **Scaling 3D > Scale** вище ``1.0``. Ця техніка називається згладжуванням супервибірки (SSAA) і є дуже повільною. Зазвичай його використання рекомендується лише для офлайн-рендерінгу.

source: When using the Forward+ or Mobile rendering methods, Godot's 3D engine renders internally in HDR. However, the rendering output will be tonemapped to a low dynamic range so it can be displayed on the screen. This can result in visible banding, especially when using untextured materials. For performance reasons, color precision is also lower when using the Mobile rendering method compared to Forward+.
ta: முன்னோக்கி+ அல்லது மொபைல் வழங்குதல் முறைகளைப் பயன்படுத்தும் போது, கோடோட்டின் 3D இயந்திரம் HDR இல் உள்நாட்டில் வழங்குகிறது. இருப்பினும், வழங்குதல் வெளியீடு குறைந்த மாறும் வரம்பிற்கு டன்மாப் செய்யப்படும், எனவே இது திரையில் காட்டப்படும். இது புலப்படும் பேண்டிங் ஏற்படலாம், குறிப்பாக உரையற்ற பொருட்களைப் பயன்படுத்தும் போது. செயல்திறன் காரணங்களுக்காக, முன்னோக்கி+உடன் ஒப்பிடும்போது மொபைல் வழங்குதல் முறையைப் பயன்படுத்தும் போது வண்ண துல்லியமும் குறைவாக இருக்கும்.

source: If using the Forward+ or Forward Mobile rendering methods, enable :ref:`Use Debanding<class_ProjectSettings_property_rendering/anti_aliasing/quality/use_debanding>` in **Project Settings > Rendering > Anti Aliasing**. This applies a fullscreen debanding shader as a post-processing effect and is very cheap.
ta: முன்னோக்கி+ அல்லது முன்னோக்கி மொபைல் வழங்குதல் முறைகளைப் பயன்படுத்தினால், இயக்கு: Ref: `டிஃபாண்டிங் <class_projectsettings_property_rendering/antialiasing/groade/Use_debanding>` ** திட்ட அமைப்புகள்> ரெண்டரிங்> எதிர்ப்பு மாற்றுப்பெயர் ** இல் பயன்படுத்தவும். இது ஒரு முழுத்திரை குறைக்கும் சேடரை ஒரு பிந்தைய செயலாக்க விளைவாகப் பயன்படுத்துகிறது மற்றும் மிகவும் மலிவானது.
