Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/csg_tools.po
Languages: ga, it, ja, pt_br, ta, tr

source: Prototyping levels with CSG
ga: Leibhéil fréamhshamhlacha le CSG
ja: CSGによるプロトタイピング
ta: சி.எச்.சி உடன் முன்மாதிரி நிலைகள்

source: CSG stands for **Constructive Solid Geometry**, and is a tool to combine basic shapes or custom meshes to create more complex shapes. In 3D modeling software, CSG is mostly known as "Boolean Operators".
ga: Seasann CSG d'**Geoiméadras Soladach Cuiditheach**, agus is uirlis é chun cruthanna bunúsacha nó mogalra saincheaptha a chur le chéile chun cruthanna níos casta a chruthú. I mbogearraí samhaltaithe 3D, tugtar “Oibreoirí Boolean” den chuid is mó ar CSG.
ja: CSGは **Constructive Solid Geometry** (空間領域構成法) の略で、基本的な形状あるいはカスタムメッシュを組み合わせることで、より複雑な形状を作成するツールです。3Dモデリングソフトウェアでは、CSGは『ブーリアン演算』という名でも知られています。
ta: சி.எச்.சி என்பது ** ஆக்கபூர்வமான திட வடிவியல் ** ஐ குறிக்கிறது, மேலும் இது மிகவும் சிக்கலான வடிவங்களை உருவாக்க அடிப்படை வடிவங்கள் அல்லது தனிப்பயன் மெச்களை இணைப்பதற்கான ஒரு கருவியாகும். 3 டி மாடலிங் மென்பொருளில், சி.எச்.சி பெரும்பாலும் "பூலியன் ஆபரேட்டர்கள்" என்று அழைக்கப்படுகிறது.

source: Level prototyping is one of the main uses of CSG in Godot. This technique allows users to create the most common shapes by combining primitives. Interior environments can be created by using inverted primitives.
ga: Tá fréamhshamhlú leibhéil ar cheann de na príomhúsáidí a bhaineann le CSG in Godot. Ligeann an teicníc seo d'úsáideoirí na cruthanna is coitianta a chruthú trí phrimitives a chomhcheangal. Is féidir timpeallachtaí taobh istigh a chruthú trí úsáid a bhaint as primitives inverted.
ja: レベルのプロトタイプ作成は、GodotでCSGを使う主な理由の一つです。このテクニックにより、ユーザーはプリミティブを組み合わせることで、レベル地形でよく使われるような形状を作れます。インテリアマッピングも反転したプリミティブで作成できます。
ta: கோடோட்டில் சி.எச்.சி.யின் முக்கிய பயன்பாடுகளில் நிலை முன்மாதிரி ஒன்றாகும். இந்த நுட்பம் பயனர்களை ஆதிமனிதர்களை இணைப்பதன் மூலம் மிகவும் பொதுவான வடிவங்களை உருவாக்க அனுமதிக்கிறது. தலைகீழ் ஆதிமனிதர்களைப் பயன்படுத்துவதன் மூலம் உள்துறை சூழல்களை உருவாக்க முடியும்.

source: If you're looking for an easy to use level design tool for a project, you may want to use `FuncGodot <https://github.com/func-godot/func_godot_plugin>`__ or `Cyclops Level Builder <https://github.com/blackears/cyclopsLevelBuilder>`__ instead.
ga: Má tá tú ag lorg uirlis deartha leibhéil atá éasca le húsáid do thionscadal, b'fhéidir gur mhaith leat `FuncGodot <https://github.com/func-godot/func_godot_plugin>`__ nó `Cyclops Level Builder <https://github.com/func-godot/func_godot_plugin>`__ a úsáid. /github.com/blackears/cyclopsLevelBuilder>`__ ina ionad sin.
ja: プロジェクト用の使いやすいレベルデザインツールを探している場合は、代わりに `FuncGodot <https://github.com/func-godot/func_godot_plugin>`__ または `Cyclops Level Builder <https://github.com/blackears/cyclopsLevelBuilder>`__ を使用することをお勧めします。
ta: ஒரு திட்டத்திற்கான நிலை வடிவமைப்பு கருவியை நீங்கள் பயன்படுத்த எளிதானது என்றால், நீங்கள் `funcgodot <https://github.com/func-godot/func_godot_plugin> __ __ அல்லது` சைக்ளோப்ச் லெவல் பில்டர் <https:/ .

source: You can check how to use CSG nodes to build various shapes (such as stairs or roads) using the `Constructive Solid Geometry demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/csg>`__.
ga: Is féidir leat a sheiceáil conas nóid CSG a úsáid chun cruthanna éagsúla a thógáil (ar nós staighrí nó bóithre) ag baint úsáide as an tionscadal taispeána `Céimseata Soladach Tógálach <https://github.com/godotenginine/godot-demo-projects/tree/master/3d/ csg>`__.
it: È possibile scoprire come utilizzare i nodi CSG per costruire varie forme (ad esempio scale o strade) attraverso il progetto demo `Constructive Solid Geometry <https://github.com/godotengine/godot-demo-projects/tree/master/3d/csg>`__.
ja: CSGノードを使用してさまざまな形状 (階段や道路など) を構築する方法については、`Constructive Solid Geometry デモプロジェクト <https://github.com/godotengine/godot-demo-projects/tree/master/3d/csg>`__ を使用して確認できます。
ta: `ஆக்கபூர்வமான திட வடிவியல் டெமோ திட்டத்தைப் பயன்படுத்தி பல்வேறு வடிவங்களை (படிக்கட்டுகள் அல்லது சாலைகள் போன்றவை) உருவாக்க சி.எச்.சி முனைகளை எவ்வாறு பயன்படுத்துவது என்பதை நீங்கள் சரிபார்க்கலாம் CSG> `__.

source: Introduction to CSG nodes
ga: Réamhrá ar nóid CSG
it: Introduzione ai nodi CSG
ja: CSGノードの入門
pt_br: Introdução aos nós de CSG
ta: சி.எச்.சி முனைகளுக்கு அறிமுகம்
tr: CSG düğümlerine giriş

source: Like other features of Godot, CSG is supported in the form of nodes. These are the CSG nodes:
ga: Cosúil le gnéithe eile de Godot, tacaítear le CSG i bhfoirm nóid. Seo iad na nóid CSG:
ja: Godotの他の機能と同様に、CSGもノードとしてサポートされています。これらがCSGノードです:
ta: கோடோட்டின் பிற அம்சங்களைப் போலவே, சி.எச்.சி முனைகளின் வடிவத்திலும் ஆதரிக்கப்படுகிறது. இவை சி.எச்.சி முனைகள்:

source: :ref:`CSGBox3D <class_CSGBox3D>`
ta: : குறிப்பு: `csgbox3d <class_csgbox3d>`

source: :ref:`CSGTorus3D <class_CSGTorus3D>`
ta: : குறிப்பு: `csgtorus3d <class_csgtorus3d>`

source: :ref:`CSGMesh3D <class_CSGMesh3D>`
ta: : குறிப்பு: `csgmesh3d <class_csgmesh3d>`

source: CSG tools features
ga: Gnéithe uirlisí CSG
ja: CSGツール機能
pt_br: Características das ferramentas CSG
ta: சி.எச்.சி கருவிகள் நற்பொருத்தங்கள்

source: Every CSG node supports 3 kinds of boolean operations:
ga: Tacaíonn gach nód CSG le 3 chineál oibríochtaí boolean:
ja: すべてのCSGノードは3種類のブーリアン演算に対応しています:
ta: ஒவ்வொரு சி.எச்.சி முனையும் 3 வகையான பூலியன் செயல்பாடுகளை ஆதரிக்கிறது:

source: **Union:** Geometry of both primitives is merged, intersecting geometry is removed.
ga: **Aontas: ** Comhcheanglaítear geoiméadra an dá phríomhaigh, baintear geoiméadracht thrasnaithe.
ja: **Union (和集合):** プリミティブのジオメトリを結合させて、共通部分のジオメトリは除去されます。
ta: ** யூனியன்: ** இரு ஆதிமனிதர்களின் வடிவியல் ஒன்றிணைக்கப்பட்டு, குறுக்குவெட்டு வடிவியல் அகற்றப்படுகிறது.

source: **Intersection:** Only intersecting geometry remains, the rest is removed.
ga: **Trasnán: ** Ní fhanann ach geoiméadracht thrasnaithe, baintear an chuid eile.
ja: **Intersection (共通部分):** ジオメトリの共通部分のみを残し、他は除去されます。
ta: ** குறுக்குவெட்டு: ** வடிவவியலை வெட்டுவது மட்டுமே உள்ளது, மீதமுள்ளவை அகற்றப்படுகின்றன.

source: **Subtraction:** The second shape is subtracted from the first, leaving a dent with its shape.
ga: **Thaarraingt: ** Déantar an dara cruth a shaoradh ón gcéad cheann, ag fágáil fiacla lena chruth.
ja: **Subtraction (差集合):** 第一の形状を、第二の形状で差し引いて、形状に穴を開けます。
ta: ** கழித்தல்: ** இரண்டாவது வடிவம் முதல்வரிலிருந்து கழிக்கப்படுகிறது, அதன் வடிவத்துடன் ஒரு துணியை விட்டு விடுகிறது.

source: The :ref:`CSGPolygon3D <class_CSGPolygon3D>` node extrude along a Polygon drawn in 2D (in X, Y coordinates) in the following ways:
ga: Easbhrúíonn an nód :ref:`CSGPolygon3D <class_CSGPolygon3D>` feadh Polagán a tharraingítear in 2T (i gcomhordanáidí X, Y) ar na bealaí seo a leanas:
ja: :ref:`CSGPolygon3D <class_CSGPolygon3D>`\ ノードは、2Dに描いたポリゴン (X, Y 座標にて) を、以下の方法により押し出します:
ta: தி: ref: `csgpolygon3d <class_csgpolygon3d>` பின்வரும் வழிகளில் 2D (x, ஒய் ஆயத்தொகுப்புகளில்) வரையப்பட்ட பலகோணத்துடன் முனை எக்ச்ட்ரூட்:

source: **Depth:** Extruded back a given amount.
ga: **Doimhneacht: ** Méid ar leith easbhrúite ar ais.
ja: **Depth (深さ):** 指定された量で後ろに押し出します。
ta: ** ஆழம்: ** கொடுக்கப்பட்ட தொகையை மீண்டும் வெளியேற்றியது.

source: **Spin:** Extruded while spinning around its origin.
ga: **Casadh: ** Easbhrúite agus é ag sníomh timpeall a bhunús.
ja: **Spin (回転):** 原点を中心に、回転しながら押し出します。
ta: ** ச்பின்: ** அதன் தோற்றத்தை சுற்றி சுழலும் போது வெளியேற்றப்பட்டது.

source: **Path:** Extruded along a Path node. This operation is commonly called lofting.
ga: **Conair: ** Easbhrúite feadh nód cosán. Tugtar lofting ar an oibríocht seo go coitianta.
ja: **Path (パス):** Pathノードに沿って押し出します。ロフティングともよく呼ばれる操作です。
ta: ** பாதை: ** பாதை முனையுடன் வெளியேற்றப்பட்டது. இந்த செயல்பாடு பொதுவாக லோஃப்டிங் என்று அழைக்கப்படுகிறது.

source: The **Path** mode must be provided with a :ref:`Path3D <class_Path3D>` node to work. In the Path node, draw the path and the polygon in CSGPolygon3D will extrude along the given path.
ga: Ní mór nód :ref:`Path3D <class_Path3D>` a chur ar fáil don mhód **Conair** chun oibriú. Sa nód Conair, tarraing an cosán agus easbhrúigh an polagán i CSGPolygon3D feadh an chosáin tugtha.
ja: **Path** モードを動かすには、まず\ :ref:`Path3D <class_Path3D>`\ ノードを用意しなければなりません。このPathノードにてパスを描くと、CSGPolygon3Dのポリゴンはそのパスに沿って押し出されます。
ta: ** பாதை ** பயன்முறை ஒரு: ref: `path3d <class_path3d>` வேலை செய்ய முனை வழங்கப்பட வேண்டும். பாதை முனையில், சி.எச்.சி.போலிகோன் 3 டி இல் உள்ள பாதையை வரையவும், கொடுக்கப்பட்ட பாதையில் பதுங்கியிருக்கும்.

source: Custom meshes
ga: Mogalra saincheaptha
it: Mesh personalizzate
ja: カスタム メッシュ
pt_br: Malhas personalizadas
ta: தனிப்பயன் மெச்கள்
tr: Özel örgüler

source: The :ref:`CSGCombiner3D <class_CSGCombiner3D>` node is an empty shape used for organization. It will only combine children nodes.
ga: Is cruth folamh é an nód :ref:`CSGCombiner3D <class_CSGCombiner3D>` a úsáidtear don eagraíocht. Ní dhéanfaidh sé ach nóid leanaí a chomhcheangal.
ja: \ :ref:`CSGCombiner3D <class_CSGCombiner3D>` ノードは、整理のための空のシェイプです。子ノードを一つにまとめます。
ta: தி: ரெஃப்: `csgcombiner3d <class_csgcombiner3d>` முனை என்பது நிறுவனத்திற்கு பயன்படுத்தப்படும் வெற்று வடிவம். இது குழந்தைகள் முனைகளை மட்டுமே இணைக்கும்.

source: Processing order
ga: Ordú próiseála
it: Ordine di elaborazione
ja: 処理の順番
pt_br: Ordem de processamento
ta: செயலாக்க வரிசை
tr: İşlem sırası

source: Every CSG node will first process its children nodes and their operations: union, intersection, or subtraction, in tree order, and apply them to itself one after the other.
ga: Déanfaidh gach nód CSG a nóid leanaí agus a n-oibríochtaí a phróiseáil ar dtús: aontas, trasna, nó faoin bhaint, in ord crainn, agus cuirfidh siad i bhfeidhm air féin ceann i ndiaidh a chéile.
ja: すべてのCSGノードは、まずその子ノードとその演算 (和集合、共通部分、差集合) をツリー順に処理し、それらを自身へ次々に適用します。
ta: ஒவ்வொரு சி.எச்.சி முனையும் முதலில் அதன் குழந்தைகளின் முனைகளையும் அவற்றின் செயல்பாடுகளையும் செயலாக்கும்: யூனியன், குறுக்குவெட்டு அல்லது கழித்தல், மர வரிசையில், அவற்றை ஒன்றன் பின் ஒன்றாகப் பயன்படுத்தும்.

source: In the interest of performance, make sure CSG geometry remains relatively simple, as complex meshes can take a while to process. If adding objects together (such as table and room objects), create them as separate CSG trees. Forcing too many objects in a single tree will eventually start affecting performance. Only use binary operations where you actually need them.
ga: Ar mhaithe le feidhmíocht, déan cinnte go bhfanann céimseata CSG sách simplí, toisc go bhféadfadh go dtógfaidh sé tamall le próiseáil a dhéanamh ar mhogaill chasta. Má chuirtear rudaí le chéile (ar nós rudaí boird agus seomra), cruthaigh iad mar chrainn CSG ar leith. Má chuirtear iallach ar an iomarca rudaí i gcrann amháin cuirfear tús le tionchar ar an bhfeidhmíocht sa deireadh. Ná húsáid ach oibríochtaí dénártha nuair a bhíonn siad de dhíth ort.
ja: 複雑なメッシュは処理に時間がかかるので、性能を上げるためには、CSGジオメトリを比較的シンプルなままに保ってください。(テーブルや部屋の物体など) 複数の物体を一緒にする場合は、それぞれ別のCSGツリーに分けましょう。ひとつのツリーに多くのオブジェクトを入れすぎると、やがて性能に影響が出始めます。バイナリ演算は本当に必要な時にだけ使用するようにしてください。
ta: செயல்திறனின் ஆர்வத்தில், சி.எச்.சி வடிவியல் ஒப்பீட்டளவில் எளிமையாக இருப்பதை உறுதிசெய்து கொள்ளுங்கள், ஏனெனில் சிக்கலான மெச்கள் செயலாக்க சிறிது நேரம் ஆகலாம். பொருள்களை ஒன்றாகச் சேர்த்தால் (அட்டவணை மற்றும் அறை பொருள்கள் போன்றவை), அவற்றை தனி சிஎச்சி மரங்களாக உருவாக்கவும். ஒரு மரத்தில் பல பொருட்களை கட்டாயப்படுத்துவது இறுதியில் செயல்திறனை பாதிக்கத் தொடங்கும். உங்களுக்கு உண்மையில் தேவைப்படும் இடத்தில் பைனரி செயல்பாடுகளை மட்டுமே பயன்படுத்தவும்.

source: Prototyping a level
ga: Fréamhshamhlú leibhéal
ja: レベルのプロトタイプ作成
pt_br: Prototipando um nível
ta: ஒரு நிலை முன்மாதிரி

source: We will prototype a room to practice the use of CSG tools.
ga: Déanfaimid seomra a fhréamhshamhlú chun úsáid uirlisí CSG a chleachtadh.
ja: CSGツールの練習に、部屋のプロトタイプを作ってみましょう。
ta: சி.எச்.சி கருவிகளின் பயன்பாட்டைப் பயிற்சி செய்ய ஒரு அறையை முன்மாதிரி செய்வோம்.

source: Working in **Orthogonal** projection gives a better view when combining the CSG shapes.
ga: Tugann obair i dteilgean Orthogonal** léargas níos fearr nuair a bhíonn cruthanna CSG á gcomhcheangal agat.
ja: CSGシェイプを組み合わせるときは、\ **平行投影**\ のほうが見えやすくなります。
ta: ** ஆர்த்தோகனல் ** திட்டத்தில் பணிபுரிவது சிஎச்சி வடிவங்களை இணைக்கும்போது சிறந்த பார்வையை அளிக்கிறது.

source: Our level will contain these objects:
ga: Beidh na rudaí seo inár leibhéal:
it: Il nostro livello conterrà questi oggetti:
ja: これから作るレベルには次のような物体があります:
ta: எங்கள் மட்டத்தில் இந்த பொருள்கள் இருக்கும்:
tr: Seviyemiz aşağıdaki nesneleri içerecektir:

source: a room,
ga: seomra,
it: una stanza,
ja: 部屋、
pt_br: um quarto,
ta: ஒரு அறை,
tr: bir oda,

source: a bed,
ga: leaba,
it: un letto,
ja: ベッド、
pt_br: uma cama,
ta: ஒரு படுக்கை,
tr: bir yatak,

source: a lamp,
ga: lampa,
it: una lampada,
ja: ランプ、
pt_br: uma lâmpada,
ta: ஒரு விளக்கு,
tr: bir lamba,

source: a desk,
ga: deasc,
it: una scrivania,
ja: 机、
pt_br: uma mesa,
ta: ஒரு மேசை,
tr: bir masa,

source: a bookshelf.
ga: seilf leabhar.
it: una libreria.
ja: 本棚。
pt_br: uma estante de livros.
ta: ஒரு புத்தக அலமாரி.
tr: bir kitaplık.

source: Create a scene with a Node3D node as root node.
ga: Cruthaigh radharc le nód Node3D mar nód fréimhe.
ja: Node3Dノードをルートにしてシーンを作成します。
ta: நோட் 3 டி முனையுடன் ஒரு காட்சியை ரூட் முனையாக உருவாக்கவும்.

source: The default lighting of the environment doesn't provide clear shading at some angles. Change the display mode using **Display Overdraw** in the 3D viewport menu, or add a DirectionalLight node to help you see clearly.
ga: Ní sholáthraíonn soilsiú réamhshocraithe an chomhshaoil scáthú soiléir ag roinnt uillinneacha. Athraigh an modh taispeána ag baint úsáid**Display Overdraw** sa roghchlár amharc 3D, nó cuir nód DirectionalLight leis chun cabhrú leat a fheiceáil go soiléir.
ja: 環境のデフォルトの照明設定では、角度によってはシェーディングがきれいに表示されません。3Dビューポート メニューにて表示モードを\ **オーバードロー表示**\ にするか、あるいは DirectionalLight をひとつ追加すれば、はっきりと見えるようになります。
ta: சுற்றுச்சூழலின் இயல்புநிலை விளக்குகள் சில கோணங்களில் தெளிவான நிழலை வழங்காது. 3D வியூச்போர்ட் பட்டியலில் ** காட்சி ஓவர் டிரா ** ஐப் பயன்படுத்தி காட்சி பயன்முறையை மாற்றவும் அல்லது தெளிவாகக் காண உதவும் திசைதட்டல் முனையைச் சேர்க்கவும்.

source: Create a CSGBox3D and name it ``room``, enable **Invert Faces** and change the dimensions of your room.
ga: Cruthaigh CSGBox3D agus ainmnigh air ``seomra``, cumasaí** Aghaidh Invert** agus athraigh toisí do sheomra.
ja: CSGBox3Dをひとつ作成し ``room`` という名前を付けて、\ **Invert Faces**\ を有効にしてから、部屋のサイズを変更してください。
ta: ஒரு CSGBOX3D ஐ உருவாக்கி அதற்கு `` அறை`` என்று பெயரிடுங்கள், ** தலைகீழ் முகங்களை இயக்கவும் ** மற்றும் உங்கள் அறையின் பரிமாணங்களை மாற்றவும்.

source: Next, create a CSGCombiner3D and name it ``desk``.
ga: Ansin, cruthaigh CSGCombiner3D agus ainmnigh air ``desk``.
ja: 次に、CSGCombiner3Dを作成して ``desk`` という名前を付けます。
ta: அடுத்து, ஒரு csgcombiner3d ஐ உருவாக்கி அதற்கு `` மேசை`` பெயரிடுங்கள்.

source: A desk has one surface and 4 legs:
ga: Tá dromchla amháin agus 4 chos ag deasc:
ja: デスクにはひとつの平面と４本の脚があります:
ta: ஒரு மேசையில் ஒரு மேற்பரப்பு மற்றும் 4 கால்கள் உள்ளன:
tr: Bir masa, bir tane yüzeye ve dört tane bacağa sahiptir:

source: Create 1 CSGBox3D children node in **Union** mode for the surface and adjust the dimensions.
ga: Cruthaigh 1 nód leanaí CSGBox3D i modh**Aon** don dromchla agus déan na toisí a choigeartú.
ja: 子ノードのCSGBox3Dを平面として1つ作成し、\ **Union (和集合)**\ モードにしてから大きさを変更します。
ta: மேற்பரப்புக்கு ** யூனியன் ** பயன்முறையில் 1 CSGBOX3D குழந்தைகள் முனையை உருவாக்கி பரிமாணங்களை சரிசெய்யவும்.

source: Create 4 CSGBox3D children nodes in **Union** mode for the legs and adjust the dimensions.
ga: Cruthaigh 4 nóid leanaí CSGBox3D i modh**Aon** do na cosa agus coigeartaigh na toisí.
ja: 脚は子ノードのCSGBox3Dを4個作成し、\ **Union**\ モードにしてから大きさを調節します。
ta: கால்களுக்கு ** யூனியன் ** பயன்முறையில் 4 CSGBOX3D குழந்தைகள் முனைகளை உருவாக்கி பரிமாணங்களை சரிசெய்யவும்.

source: Adjust their placement to resemble a desk.
ga: Coigeartaigh a socrúchán chun cosúil le deasc.
ja: それらの位置を調節してデスクの形にしましょう。
ta: ஒரு மேசையை ஒத்திருக்க அவற்றின் வேலைவாய்ப்பை சரிசெய்யவும்.

source: CSG nodes inside a CSGCombiner3D will only process their operation within the combiner. Therefore, CSGCombiner3Ds are used to organize CSG nodes.
ga: Ní phróiseálfaidh nóid CSG taobh istigh de CSGCombiner3D ach a n-oibríocht laistigh den chomhcheanglaí. Dá bhrí sin, úsáidtear CSGCombiner3Danna chun nóid CSG a eagrú.
ja: CSGCombiner3Dの中にあるCSGノードは、その combiner(連合) の中だけで演算処理を行います。そのため、CSGノードの整理にはCSGCombiner3Dが使われます。
ta: ஒரு CSGCombiner3D க்குள் உள்ள CSG முனைகள் அவற்றின் செயல்பாட்டை காம்பினருக்குள் மட்டுமே செயலாக்கும். எனவே, சி.எச்.சி முனைகளை ஒழுங்கமைக்க CSGCOMBINER3DS பயன்படுத்தப்படுகிறது.

source: Create a CSGCombiner3D and name it ``bed``.
ga: Cruthaigh CSGCombiner3D agus ainmnigh é ``leaba ``.
ja: CSGCombiner3Dを作り、\ ``bed``\ と名付けます。
ta: ஒரு csgcombiner3d ஐ உருவாக்கி அதற்கு `` படுக்கை`` என்று பெயரிடுங்கள்.

source: Our bed consists of 3 parts: the bed, the mattress and a pillow. Create a CSGBox3D and adjust its dimension for the bed. Create another CSGBox3D and adjust its dimension for the mattress.
ga: Is éard atá inár leaba 3 chuid: an leaba, an tocht agus piliúir. Cruthaigh CSGBox3D agus coigeartaigh a ghné don leaba. Cruthaigh CSGBox3d eile agus coigeartaigh a ghné don tocht.
ja: ベッドは3つのパーツからなります: ベッド本体、マットレス、そして枕です。まずCSGBox3Dを作成し、サイズ調整してベッド本体とします。さらにCSGBox3Dをもうひとつ作って、大きさ変更をしてマットレスにします。
ta: எங்கள் படுக்கையில் 3 பாகங்கள் உள்ளன: படுக்கை, மெத்தை மற்றும் ஒரு தலையணை. ஒரு CSGBOX3D ஐ உருவாக்கி, படுக்கைக்கு அதன் பரிமாணத்தை சரிசெய்யவும். மற்றொரு CSGBOX3D ஐ உருவாக்கி, மெத்தைக்கு அதன் பரிமாணத்தை சரிசெய்யவும்.

source: We will create another CSGCombiner3D named ``pillow`` as the child of ``bed``. The scene tree should look like this:
ga: Cruthóimid CSGCombiner3D eile darb ainm ``pillow`` mar leanbh ``leaba ``. Ba chóir go mbeadh cuma seo ar an gcrann radhairc:
ja: \ ``bed``\ の子として、\ ``pillow``\ という名前のCSGCombiner3Dを作ります。シーンツリーはこのようになるでしょう:
ta: `` படுக்கை`` என்ற குழந்தையாக `` தலையணை` என்ற பெயரிடப்பட்ட மற்றொரு csgcombiner3d ஐ உருவாக்குவோம். காட்சி மரம் இப்படி இருக்க வேண்டும்:

source: We will combine 3 CSGSphere3D nodes in **Union** mode to form a pillow. Scale the Y axis of the spheres and enable **Smooth Faces**.
ga: Comhcheanglófaimid 3 nóid CSGSPhere3D i modh**Aon** chun piliúir a fhoirmiú. Scála ais Y na sféir agus cumasaí**Aghdeanna Réamh**.
ja: それから3つの CSGSphere3Dノードを **Union (和)** モードにして組み合わせ、枕にします。それぞれの球体をY軸でサイズ変更し、\ **Smooth Faces** を有効にします。
ta: ஒரு தலையணையை உருவாக்க ** யூனியன் ** பயன்முறையில் 3 CSGSphere3D முனைகளை இணைப்போம். கோளங்களின் ஒய் அச்சை அளவிட்டு ** மென்மையான முகங்களை இயக்கவும் **.

source: Select the ``pillow`` node and switch the mode to **Subtraction**; the combined spheres will cut a hole into the mattress.
ga: Roghnaigh an nód ``piliúna`` agus aistrigh an modh chuig **Aistriscint**; gearrfaidh na sféifeanna comhcheangailte poll isteach sa tocht.
ja: \ ``pillow``\ ノードを選択して、モードを\ **Subtraction (差)**\ に切り替えます。すると組み合わせた球体により、マットレスに穴が開きます。
ta: `` தலையணை`` முனையைத் தேர்ந்தெடுத்து பயன்முறையை ** கழித்தல் ** க்கு மாற்றவும்; ஒருங்கிணைந்த கோளங்கள் மெத்தையில் ஒரு துளை வெட்டும்.

source: Try to re-parent the ``pillow`` node to the root ``Node3D`` node; the hole will disappear.
ga: Déan iarracht an nód ``pillow`` a aththuismitheoireacht chuig an nód fréimhe ``Node3D``; imeoidh an poll.
ja: \ ``pillow``\ ノードの親を、ルート\ ``Node3D``\ に変更してみましょう。そうすれば穴は消えます。
ta: `` Node3d`` முனை `` தலையணை`` முனையை மீண்டும் பெற்றோருக்கு முயற்சிக்கவும்; துளை மறைந்துவிடும்.

source: This is to illustrate the effect of CSG processing order. Since the root node is not a CSG node, the CSGCombiner3D nodes are the end of the operations; this shows the use of CSGCombiner3D to organize the CSG scene.
ga: Tá sé seo chun éifeacht ordú próiseála CSG a léiriú. Ós rud é nach nód CSG é an nód fréimhe, is iad na nóid CSGCombiner3D deireadh na n-oibríochtaí; taispeánann sé seo úsáid CSGCombiner3D chun radharc CSG a eagrú.
ja: これはCSGの処理順による影響を示すためのものです。ここでのルートノードは CSGノードではないため、CSGCombiner3Dノードの処理は最後になります。これがCSGCombiner3Dを使ったCSGシーン整理の一例です。
ta: இது சிஎச்சி செயலாக்க வரிசையின் விளைவை விளக்குவதாகும். ரூட் முனை ஒரு சி.எச்.சி முனை அல்ல என்பதால், CSGCombiner3D முனைகள் செயல்பாடுகளின் முடிவாகும்; சி.எச்.சி காட்சியை ஒழுங்கமைக்க CSGCombiner3D இன் பயன்பாட்டை இது காட்டுகிறது.

source: Undo the re-parent after observing the effect. The bed you've built should look like this:
ga: Cealaigh an t-aththuismitheoir tar éis an éifeacht a bhre Ba chóir go mbeadh cuma seo ar an leaba a thóg tú:
ja: 結果を確かめてから、親の変更とモード変更を取り消すと、ベッドはこのようになっているはずです:
pt_br: Desfaça a herança depois de observar o efeito. A cama que você construiu deve ter esta aparência:
ta: விளைவைக் கவனித்தபின் மறு பெற்றோரை செயல்தவிர்க்கவும். நீங்கள் கட்டிய படுக்கை இப்படி இருக்க வேண்டும்:
tr: Etkiyi gözlemledikten sonra, üst-öge birleştirmeyi geri alın. Yaptığınız yatak ögesi bunun gibi görünmelidir:

source: Create a CSGCombiner3D and name it ``lamp``.
ga: Cruthaigh CSGCombiner3D agus ainmnigh air ``lamp ``.
ja: CSGCombiner3Dを作成して\ ``lamp``\ と名付けます。
ta: ஒரு csgcombiner3d ஐ உருவாக்கி அதற்கு `` விளக்கு`` என்று பெயரிடுங்கள்.

source: A lamp consists of 3 parts: the stand, the pole and the lampshade. Create a CSGCylinder3D, enable the **Cone** option and make it the stand. Create another CSGCylinder3D and adjust the dimensions to use it as a pole.
ga: Is éard atá i lampa 3 chuid: an seastán, an cuaille agus an lampa. Cruthaigh CSGCylinder3D, cumasaigh an roghna** Cone** agus déan an seastán é. Cruthaigh CSGCylinder3D eile agus déan na toisí a choigeartú chun é a úsáid mar chuaille.
ja: ランプはスタンド、支柱、そしてランプシェードの、3つのパーツからなります。CSGCylinder3Dを作成し、\ **Cone** オプションを有効にしてスタンドにします。それから、もうひとつCSGCylinder3Dを作って、大きさを調整して支柱にします。
ta: ஒரு விளக்கு 3 பகுதிகளைக் கொண்டுள்ளது: ச்டாண்ட், கம்பம் மற்றும் விளக்கு விளக்குகள். ஒரு CSGCYLINDER3D ஐ உருவாக்கி, ** கூம்பு ** விருப்பத்தை இயக்கி அதை நிலைப்பாடு செய்யுங்கள். மற்றொரு CSGCYLINDER3D ஐ உருவாக்கி, அதை ஒரு துருவமாகப் பயன்படுத்த பரிமாணங்களை சரிசெய்யவும்.

source: We will use a CSGPolygon3D for the lampshade. Use the **Spin** mode for the CSGPolygon3D and draw a `trapezoid <https://en.wikipedia.org/wiki/Trapezoid>`_ while in **Front View** (numeric keypad 1); this shape will extrude around the origin and form the lampshade.
ga: Úsáidfimid CSGPolygon3D don scáth lampa. Úsáid an mód **Spin** don CSGPolygon3D agus tarraing `trapezoid <https://en.wikipedia.org/wiki/Trapezoid>`_ agus tú i **Front View** (eochaircheap uimhriúil 1); easbhrúfaidh an cruth seo timpeall an tionscnaimh agus foirmeoidh sé an scáthlán.
ja: ランプシェードにはCSGPolygon3Dを使います。CSGPolygon3Dを **Spin** モードにし、ビューを前面図 (テンキーの1) にしてから\ `台形 <https://ja.wikipedia.org/wiki/%E5%8F%B0%E5%BD%A2>`_\ を描きましょう。この形状は原点を中心に、回転しながら押し出されてランプシェードを形作ります。
ta: விளக்கு விளக்குக்கு ஒரு CSGPolygon3D ஐப் பயன்படுத்துவோம். CSGPolygon3D க்கு ** ச்பின் ** பயன்முறையைப் பயன்படுத்தவும், `ட்ரேப்சாய்டு <https://en.wikipedia.org/wiki/trapezoid>` _ ** முன் பார்வையில் ** (எண் விசைப்பலகையில் 1); இந்த வடிவம் தோற்றத்தை சுற்றி விரிவடைந்து விளக்கு விளக்கை உருவாக்கும்.

source: Adjust the placement of the 3 parts to make it look like a lamp.
ga: Coigeartaigh socrúchán na 3 chuid chun go mbeidh cuma lampa air.
ja: 3つのパーツの位置を調整して、ランプに見えるようにします。
ta: 3 பகுதிகளின் இடத்தை ஒரு விளக்கு போல தோற்றமளிக்க சரிசெய்யவும்.

source: Create a CSGCombiner3D and name it ``bookshelf``.
ga: Cruthaigh CSGCombiner3D agus ainmnigh air ``bookshelf``.
ja: CSGCombiner3Dを作り、\ ``bookshelf``\ と名付けます。
ta: ஒரு csgcombiner3d ஐ உருவாக்கி அதற்கு `` புத்தக அலமாரி`` என்று பெயரிடுங்கள்.

source: We will use 3 CSGBox3D nodes for the bookshelf. Create a CSGBox3D and adjust its dimensions; this will be the size of the bookshelf.
ga: Úsáidfimid 3 nóid CSGBox3D don seilf leabhar. Cruthaigh CSGBox3D agus déan a thoisí a choigeartú; is é seo méid an tseilf leabhar.
ja: 本棚には3つの CSGBox3D を使います。CSGBox3D をひとつ作って、サイズを調節してください。これが本棚のサイズになります。
ta: புத்தக அலமாரிக்கு 3 CSGBOX3D முனைகளைப் பயன்படுத்துவோம். ஒரு CSGBOX3D ஐ உருவாக்கி அதன் பரிமாணங்களை சரிசெய்யவும்; இது புத்தக அலமாரியின் அளவாக இருக்கும்.
