Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/csg_tools.po
Languages: ga, it, ja, pt_br, ta, tr

source: Duplicate the CSGBox3D and shorten the dimensions of each axis and change the mode to **Subtraction**.
ga: Déan an CSGBox3d a dhúbailt agus toisí gach ais a ghiorrú agus athraigh an modh chuig **Aistriscint**.
ja: この CSGBox3D を複製して、すべての軸で縮小させてから、モードを **Subtraction (差)** に変更します。
ta: CSGBOX3D ஐ நகலெடுத்து ஒவ்வொரு அச்சின் பரிமாணங்களையும் சுருக்கி, பயன்முறையை ** கழித்தல் ** ஆக மாற்றவும்.

source: You've almost built a shelf. Create one more CSGBox3D for dividing the shelf into two levels.
ga: Tá seilf beagnach tógtha agat. Cruthaigh CSGBox3D amháin eile chun an seilf a roinnt ina dhá leibhéal.
ja: 本棚はもうすぐ完成です。CSGBox3D をもうひとつ作成して、棚を二段に分けます。
ta: நீங்கள் கிட்டத்தட்ட ஒரு அலமாரியை உருவாக்கியுள்ளீர்கள். அலமாரியை இரண்டு நிலைகளாகப் பிரிக்க இன்னும் ஒரு CSGBOX3D ஐ உருவாக்கவும்.

source: Position your furniture in your room as you like and your scene should look this:
ga: Cuir do throscán i do sheomra mar is mian leat agus ba chóir go mbeadh cuma seo ar do radharc:
ja: 部屋の中に家具を自由に配置すれば、シーンはこういう風になるはずです。
pt_br: Posicione seus móveis em seu quarto como quiser e sua cena deve ficar assim:
ta: நீங்கள் விரும்பியபடி உங்கள் தளபாடங்களை உங்கள் அறையில் வைக்கவும், உங்கள் காட்சி இதைப் பார்க்க வேண்டும்:
tr: Odanızdaki mobilyaları istediğiniz gibi yerleştirin, işiniz bitince sahneniz bunun gibi görünmelidir:

source: You've successfully prototyped a room level with the CSG tools in Godot. CSG tools can be used for designing all kinds of levels, such as a maze or a city; explore its limitations when designing your game.
ga: D'éirigh leat leibhéal seomra a fhréamhshamhlú leis na huirlisí CSG i Godot. Is féidir uirlisí CSG a úsáid chun gach cineál leibhéil a dhearadh, mar shampla lúibhinn nó cathair; déan iniúchadh ar a theorainneacha agus do chluiche á dhearadh agat.
ja: これで部屋のレベルのプロトタイプを、Godot の CSG ツールを使って作ることができました。迷路や街など、あらゆる種類のレベルをデザインするのに CSG ツールは使えます。ゲームをデザインするときは、その限界まで探ってみてください。
ta: கோடோட்டில் உள்ள சி.எச்.சி கருவிகளுடன் ஒரு அறை அளவை வெற்றிகரமாக முன்மாதிரி செய்துள்ளீர்கள். சி.எச்.சி கருவிகள் பிரமை அல்லது நகரம் போன்ற அனைத்து வகையான நிலைகளையும் வடிவமைக்க பயன்படுத்தப்படலாம்; உங்கள் விளையாட்டை வடிவமைக்கும்போது அதன் வரம்புகளை ஆராயுங்கள்.

source: Using prototype textures
ga: Uigeachtaí fréamhshamhla
ja: プロトタイプテクスチャの使用
pt_br: Usando texturas protótipo
ta: முன்மாதிரி அமைப்புகளைப் பயன்படுத்துதல்

source: Godot's :ref:`doc_standard_material_3d` supports *triplanar mapping*, which can be used to automatically apply a texture to arbitrary objects without distortion. This is handy when using CSG as Godot doesn't support editing UV maps on CSG nodes yet. Triplanar mapping is relatively slow, which usually restricts its usage to organic surfaces like terrain. Still, when prototyping, it can be used to quickly apply textures to CSG-based levels.
ga: Godot's:ref: tacaíonn `doc_standard_material_3d` le *mapáil triplanar*, ar féidir a úsáid chun uigeacht a chur i bhfeidhm go huathoibríoch ar rudaí treallach gan saobhadh. Tá sé seo áisiúil agus CSG á úsáid agat mar ní thacaíonn Godot le léarscáileanna UV a eagarthóireacht ar nóid CSG fós. Tá mapáil triplanar réasúnta mall, rud a chuireann srian dá úsáid de ghnáth go dromchlaí orgánacha cosúil le tír-raon. Fós féin, agus tú ag fréamhshamhlú, is féidir é a úsáid chun uigeachtaí a chur i bhfeidhm go tapa ar leibhéil CSG-bhunaithe.
ja: Godot の :ref:`doc_standard_material_3d` は *三平面マッピング* (triplanar mapping) をサポートしています。Godot はまだ CSG ノード上の UV マップの編集をサポートしていないので、これは CSG を使うときに便利です。三平面マッピングは比較的低速なので、地形のような有機的なサーフェスには通常は不向きです。しかし、プロトタイピングの際には、CSGベースのレベルにテクスチャを素早く適用するために使用できます。
ta: கோடோட்ச்: குறிப்பு: `doc_standard_material_3d` ஆதரிக்கிறது *டிரிப்லானார் மேப்பிங் *, இது விலகல் இல்லாமல் தன்னிச்சையான பொருள்களுக்கு ஒரு அமைப்பை தானாகவே பயன்படுத்த பயன்படுகிறது. சி.எச்.சி.க்கு சி.எச்.சி. டிரிப்ளானார் மேப்பிங் ஒப்பீட்டளவில் மெதுவாக உள்ளது, இது வழக்கமாக நிலப்பரப்பு போன்ற கரிம மேற்பரப்புகளுக்கு அதன் பயன்பாட்டை கட்டுப்படுத்துகிறது. இருப்பினும், முன்மாதிரி செய்யும் போது, சி.எச்.சி அடிப்படையிலான நிலைகளுக்கு கட்டமைப்புகளை விரைவாகப் பயன்படுத்த இதைப் பயன்படுத்தலாம்.

source: If you need some textures for prototyping, Kenney made a `set of CC0-licensed prototype textures <https://kenney.nl/assets/prototype-textures>`__.
ga: Má theastaíonn roinnt uigeachtaí uait le haghaidh fréamhshamhlú, rinne Kenney `tacar d'uigeachtaí fréamhshamhlacha CC0-cheadúnaithe <https://kenney.nl/assets/prototype-textures>`__.
ja: プロトタイプ用のテクスチャが必要な場合は、Kenney が作成した `CC0ライセンスのプロトタイプテクスチャセット <https://kenney.nl/assets/prototype-textures>`__ を参照してください。
ta: முன்மாதிரி செய்வதற்கு உங்களுக்கு சில அமைப்புகள் தேவைப்பட்டால், கென்னி `CC0- வடிவமைக்கப்பட்ட முன்மாதிரி அமைப்புகளின் தொகுப்பை <https://enenney.nl/assets/prototype-textures> ____.

source: There are two ways to apply a material to a CSG node:
ga: Tá dhá bhealach ann chun ábhar a chur i bhfeidhm ar nód CSG:
it: Ci sono due modi per applicare un materiale a un nodo CSG:
ja: CSGノードにマテリアルを適用するには、次の2つの方法があります。
pt_br: Há duas maneiras de aplicar um material a um nó CSG:
ta: ஒரு சி.எச்.சி முனைக்கு ஒரு பொருளைப் பயன்படுத்த இரண்டு வழிகள் உள்ளன:
tr: Bir CSG düğümüne bir malzeme uygulamanın iki yolu var:

source: Applying it to a CSGCombiner3D node as a material override (**Geometry > Material Override** in the Inspector). This will affect its children automatically, but will make it impossible to change the material in individual children.
ga: É a chur i bhfeidhm ar nód CSGCombiner3D mar shárú ábhair (**Céimseata > Sárú Ábhair** sa Chigire). Cuirfidh sé seo isteach ar a leanaí go huathoibríoch, ach déanfaidh sé dodhéanta an t-ábhar a athrú i leanaí aonair.
ja: これを CSGCombiner3Dノードにマテリアル オーバーライドとして適用します (インスペクターの **Geometry > Material Override**)。これで子ノードに自動的に適用されますが、個々の子ノードのマテリアルを変更できなくなります。
ta: ஒரு பொருள் மேலெழுதலாக (** வடிவியல்> பொருள் மேலெழுத ** இன்ச்பெக்டரில்) அதை ஒரு CSGCombiner3D முனைக்கு பயன்படுத்துதல். இது அதன் குழந்தைகளை தானாகவே பாதிக்கும், ஆனால் தனிப்பட்ட குழந்தைகளில் பொருளை மாற்றுவது சாத்தியமில்லை.

source: Applying a material to individual nodes (**Material** in the Inspector). This way, each CSG node can have its own appearance. Subtractive CSG nodes will apply their material to the nodes they're "digging" into.
ga: Ábhar a chur i bhfeidhm ar nóid aonair (**Ábhar** sa Cigire). Ar an mbealach seo, is féidir le gach nód CSG a chuma féin a bheith aige. Cuirfidh nóid CSG tarraingteach a n-ábhar i bhfeidhm ar na nóid atá siad ag “tochailt” iontu.
ja: 個々のノードにマテリアルを適用します (インスペクターの **Material**)。この方法では、各CSGノードに独自の外観を持たせることができます。減算CSGノードは、他の形状を掘った内側のマテリアルに適用されます。
ta: தனிப்பட்ட முனைகளுக்கு ஒரு பொருளைப் பயன்படுத்துதல் (** பொருள் ** இன்ச்பெக்டரில்). இந்த வழியில், ஒவ்வொரு சி.எச்.சி முனையும் அதன் சொந்த தோற்றத்தைக் கொண்டிருக்கலாம். கழித்தல் சி.எச்.சி முனைகள் அவற்றின் பொருள்களை அவர்கள் "தோண்டி எடுக்கும்" முனைகளுக்குப் பயன்படுத்தும்.

source: To apply triplanar mapping to a CSG node, select it, go to the Inspector, click the **[empty]** text next to **Material Override** (or **Material** for individual CSG nodes). Choose **New StandardMaterial3D**. Click the newly created material's icon to edit it. Unfold the **Albedo** section and load a texture into the **Texture** property. Now, unfold the **Uv1** section and check **Triplanar**. You can change the texture offset and scale on each axis by playing with the **Scale** and **Offset** properties just above. Higher values in the **Scale** property will cause the texture to repeat more often.
ga: Chun mapáil triplanar a chur i bhfeidhm ar nód CSG, roghnaigh é, téigh chuig an gCigire, cliceáil ar an téacs** [folamh] ** in aice len**Ábhar Forride** (nó **Ábhar** do nóid CSG aonair). Roghnaithe** Ábhar Caighdeánach Nua 3D**. Cliceáil deilbhín an ábhair nua-chruthaithe chun é a chur in eagar. Déan an rannát**Albedo** a oscailt agus luchtaigh uigeacht isteach sa mhaoin **Texture**. Anois, déan an rannát**Uv1** a oscailt agus seiceáil**Triplanar**. Is féidir leat an fhritháireamh agus an scála uigeachta a athrú ar gach ais trí imirt leis na hairíonna **Scála** agus **Offset** díreach thuas. Cuirfidh luachanna níos airde sa mhaoin **Scála** mar thoradh ar an uigeacht arís níos minice.
ja: CSGノードに三平面マッピングを適用するには、ノードを選択してインスペクターに移動し、**Material Override** (または個々の CSGノードの場合は **Material**) の横にある **[empty]** テキストをクリックします。**New StandardMaterial3D** を選択します。新しく作成されたマテリアルのアイコンをクリックして編集します。**Albedo** セクションを展開し、**Texture** プロパティにテクスチャをロードします。次に、**Uv1** セクションを展開し、**Triplanar** をオンにします。上記の **Scale** プロパティと **Offset** プロパティを操作することで、各軸のテクスチャ オフセットとスケールを変更できます。**Scale** プロパティの値を大きくすると、テクスチャがより頻繁に繰り返されます。
ta: சி.எச்.சி முனைக்கு டிரிப்ளானார் மேப்பிங்கைப் பயன்படுத்த, அதைத் தேர்ந்தெடுத்து, இன்ச்பெக்டரிடம் சென்று, ** [வெற்று] ** உரையைக் சொடுக்கு செய்க ** பொருள் மேலெழுத ** (அல்லது ** பொருள் ** தனிப்பட்ட சி.எச்.சி முனைகளுக்கு). ** புதிய standandmaterial3d ** ஐத் தேர்வுசெய்க. அதைத் திருத்த புதிதாக உருவாக்கப்பட்ட பொருளின் ஐகானைக் சொடுக்கு செய்க. ** ஆல்பிடோ ** பிரிவை விரித்து ** அமைப்பு ** சொத்தில் ஒரு அமைப்பை ஏற்றவும். இப்போது, ** uv1 ** பகுதியை விரித்து ** டிரிப்லானார் ** சரிபார்க்கவும். ** அளவுகோல் ** மற்றும் ** ஆஃப்செட் ** பண்புகளுடன் விளையாடுவதன் மூலம் ஒவ்வொரு அச்சிலும் அமைப்பு ஆஃப்செட் மற்றும் அளவிலான அளவிலான மாற்றத்தை மாற்றலாம். ** அளவுகோல் ** சொத்தில் அதிக மதிப்புகள் அமைப்பு அடிக்கடி மீண்டும் நிகழும்.

source: You can copy a StandardMaterial3D to reuse it across CSG nodes. To do so, click the dropdown arrow next to a material property in the Inspector and choose **Copy**. To paste it, select the node you'd like to apply the material onto, click the dropdown arrow next to its material property then choose **Paste**.
ga: Is féidir leat StandardMaterial3D a chóipeáil chun é a athúsáid ar fud nóid CSG. Chun é sin a dhéanamh, cliceáil ar an saighead anuas in aice le maoin ábhartha sa Cigire agus roghnaigh **Cóipe**. Chun é a ghreamú, roghnaigh an nód ar mhaith leat an t-ábhar a chur i bhfeidhm air, cliceáil ar an saighead anuas in aice lena maoin ábhartha ansin roghnaigh **Greamaí**.
ja: StandardMaterial3Dをコピーして、CSGノード間で再利用することができます。これを行うにはインスペクターのマテリアル プロパティの横にあるドロップダウン矢印をクリックし、**コピー** を選択します。貼り付けるには、マテリアルを適用するノードを選択し、そのマテリアル プロパティの横にあるドロップダウン矢印をクリックして、**貼り付け** を選択します。
ta: சி.எச்.சி முனைகளில் மீண்டும் பயன்படுத்த நீங்கள் ஒரு ச்டாண்டர்ட் மெட்டீரியல் 3 டி நகலெடுக்கலாம். அவ்வாறு செய்ய, இன்ச்பெக்டரில் உள்ள ஒரு பொருள் சொத்துக்கு அடுத்தபடியாக கீழ்தோன்றும் அம்புக்குறியைக் சொடுக்கு செய்து ** நகல் ** ஐத் தேர்வுசெய்க. அதை ஒட்டுவதற்கு, நீங்கள் பொருளைப் பயன்படுத்த விரும்பும் முனையைத் தேர்ந்தெடுக்கவும், அதன் பொருள் சொத்துக்கு அடுத்த கீழ்தோன்றும் அம்புக்குறியைக் சொடுக்கு செய்து ** பேச்ட் ** தேர்வு செய்யவும்.

source: Exporting as glTF
ga: Onnmhairiú mar GltF
it: Esportare come glTF
ja: glTFとしてエクスポート
ta: Gltf ஆக ஏற்றுமதி

source: It can be useful to block out a level using CSG, then export it as a 3d model, to import into 3D modeling software. You can do this by selecting **Scene > Export As... > glTF 2.0 Scene**.
ga: D'fhéadfadh sé a bheith úsáideach leibhéal a bhlocáil ag baint úsáide as CSG, ansin é a onnmhairiú mar mhúnla 3d, chun é a allmhairiú isteach i mbogearraí samhaltaithe 3D. Is féidir leat é seo a dhéanamh ach **Radharc > Easpórtáil Mar... > glTF 2.0 Radharc** a roghnú.
ja: CSGを使用して作成したレベルをメッシュ化し、それを3Dモデルとしてエクスポートして、3Dモデリングソフトにインポートすると便利です。それを実現するには **シーン > 名前を付けてエクスポート... > glTF 2.0 シーン** を実行します。
ta: சி.எச்.சி.யைப் பயன்படுத்தி ஒரு நிலையைத் தடுப்பது பயனுள்ளதாக இருக்கும், பின்னர் அதை 3D மாதிரியாக ஏற்றுமதி செய்து, 3D மாடலிங் மென்பொருளில் இறக்குமதி செய்ய. ** காட்சி> ஏற்றுமதி என ...> gltf 2.0 காட்சி ** என்பதைத் தேர்ந்தெடுப்பதன் மூலம் இதைச் செய்யலாம்.

source: :ref:`CSGCylinder3D <class_CSGCylinder3D>` (also supports cone)
ga: :ref:`CSGCylinder3D <class_CSGCylinder3D>` (tacaíonn cón freisin)
it: :ref:`CSGCylinder3D <class_CSGCylinder3D>` (supporta anche il cono)
ja: :ref:`CSGCylinder3D <class_CSGCylinder3D>` (コーン形状も可能)

source: CSGPolygon
ga: CSGPolygón
pt_br: PolígonoCSG

source: be closed
it: sia chiusa

source: self-intersection
it: auto-intersezioni

source: interior faces
it: Facce interiori

source: Converting to MeshInstance3D
it: Convertire in MeshInstance3D

source: This has several benefits:
it: Ciò ha diversi vantaggi:
