Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/occlusion_culling.po
Languages: ga, it, ru, ta, uk

source: Toggling an OccluderInstance3D's visibility (or one of its parents' visibility) is not as expensive, as the update only needs to happen once (rather than continuously).
ga: Níl sé chomh costasach infheictheacht OccluderInstance3D (nó infheictheacht ceann dá thuismitheoirí) a athrú, mar ní gá don nuashonrú tarlú ach uair amháin (seachas go leanúnach).
ru: Переключение видимости OccluderInstance3D (или видимости одного из его родительских объектов) не так затратно, поскольку обновление необходимо выполнить только один раз (а не постоянно).
ta: ஒரு occluderinstance3d இன் தெரிவுநிலையை (அல்லது அதன் பெற்றோரின் தெரிவுநிலைகளில் ஒன்று) மாற்றுவது விலை உயர்ந்ததல்ல, ஏனெனில் புதுப்பிப்பு ஒரு முறை மட்டுமே நடக்க வேண்டும் (தொடர்ச்சியாக விட).
uk: Перемикання видимості OccluderInstance3D (або видимості одного з батьків) не таке дороге, оскільки оновлення має відбуватися лише один раз (а не постійно).

source: For example, if you have a sliding or rotating door, you can make the OccluderInstance3D node not be a child of the door itself (so that the occluder never moves), but you can hide the OccluderInstance3D visibility once the door starts opening. You can then reshow the OccluderInstance3D once the door is fully closed.
ga: Mar shampla, má tá doras sleamhnáin nó rothlach agat, is féidir leat an nód OccluderInstance3D a dhéanamh nach leanbh an dorais féin (ionas nach ngluaiseann an occluder riamh), ach is féidir leat infheictheacht OccluderInstance3D a cheilt nuair a thosaíonn an doras ag oscailt. Ansin is féidir leat an OccluderInstance3D a aththaispeáint nuair a bheidh an doras dúnta go hiomlán.
ru: Например, если у вас есть раздвижная или вращающаяся дверь, вы можете сделать узел OccluderInstance3D не дочерним элементом самой двери (чтобы окклюдер никогда не двигался), но вы можете скрыть видимость OccluderInstance3D, как только дверь начнет открываться. Затем вы можете повторно отобразить OccluderInstance3D, как только дверь полностью закроется.
ta: எடுத்துக்காட்டாக, உங்களிடம் ஒரு நெகிழ் அல்லது சுழலும் கதவு இருந்தால், நீங்கள் occluderinstance3d முனை கதவின் குழந்தையாக இருக்கக்கூடாது (அதனால் மறைமுகம் ஒருபோதும் நகராது), ஆனால் கதவு திறக்கத் தொடங்கியவுடன் நீங்கள் occluderinstance3d தெரிவுநிலையை மறைக்க முடியும். கதவு முழுமையாக மூடப்பட்டவுடன் நீங்கள் occluderinstance3d ஐ மாற்றலாம்.
uk: Наприклад, якщо у вас є розсувні або обертові двері, ви можете зробити так, щоб вузол OccluderInstance3D не був дочірнім елементом самих дверей (щоб загороджувач ніколи не рухався), але ви можете приховати видимість OccluderInstance3D, коли двері почнуть відкриватися. Потім ви можете повторно показати OccluderInstance3D, коли дверцята повністю зачиняться.

source: If you absolutely have to move an OccluderInstance3D node during gameplay, use a primitive Occluder3D shape for it instead of a complex baked shape.
ga: Má chaithfidh tú nód OccluderInstance3D a bhogadh go hiomlán le linn gameplay, bain úsáid as cruth primitheach Occluder3D dó in ionad cruth casta bácáilte.
ru: Если вам действительно необходимо переместить узел OccluderInstance3D во время игры, используйте для него примитивную форму Occluder3D вместо сложной запеченной формы.
ta: விளையாட்டின் போது நீங்கள் ஒரு Occluderinstance3d முனையை நகர்த்த வேண்டியிருந்தால், சிக்கலான சுடப்பட்ட வடிவத்திற்கு பதிலாக அதற்காக ஒரு பழமையான ஆக்லூடர் 3 டி வடிவத்தைப் பயன்படுத்தவும்.
uk: Якщо вам обов’язково потрібно перемістити вузол OccluderInstance3D під час гри, використовуйте для нього примітивну форму Occluder3D замість складної запеченої форми.

source: Use the simplest possible occluder shapes
ga: Úsáid na cruthanna occluder is simplí is féidir
ru: Используйте максимально простые формы окклюдеров
ta: எளிமையான சாத்தியமான மறைமுக வடிவங்களைப் பயன்படுத்தவும்
uk: Використовуйте найпростіші можливі форми оклюдерів

source: If you notice low performance or stuttering in complex 3D scenes, it may mean that the CPU is overloaded as a result of rendering detailed occluders. Select the OccluderInstance3D node, increase the **Bake > Simplification** property then bake occluders again.
ga: Má thugann tú faoi deara feidhmíocht íseal nó stuttering i radhairc casta 3D, d'fhéadfadh sé a chiallaíonn go bhfuil an LAP ró-ualach mar thoradh ar rindreáil occluders mionsonraithe. Roghnaigh an nód OccluderInstance3D, méadaigh an t-airí **Bácáil > Simpliú** agus bácáil occluders arís.
ru: Если вы заметили низкую производительность или подтормаживания в сложных 3D-сценах, это может означать, что процессор перегружен в результате рендеринга детализированных окклюдеров. Выберите узел OccluderInstance3D, увеличьте свойство **Bake > Simplification**, затем снова запеките окклюдеры.
ta: சிக்கலான 3D காட்சிகளில் குறைந்த செயல்திறன் அல்லது தடுமாற்றத்தை நீங்கள் கவனித்தால், விரிவான மறைமுகங்களை வழங்குவதன் விளைவாக சிபியு அதிக சுமை கொண்டது என்று பொருள். OCCLUDERINSTANCE3D முனையைத் தேர்ந்தெடுத்து, ** சுட்டுக்கொள்ள> எளிமைப்படுத்தல் ** சொத்தை அதிகரிக்கவும், பின்னர் மீண்டும் மறைக்க வீரர்களை சுட்டுக்கொள்ளுங்கள்.
uk: Якщо ви помітили низьку продуктивність або заїкання в складних 3D-сценах, це може означати, що ЦП перевантажено в результаті візуалізації детальних окклюдерів. Виберіть вузол OccluderInstance3D, збільште властивість **Bake > Simplification**, а потім знову запікайте оклюдери.

source: Remember to keep the simplification value reasonable. Values that are too high for the level's geometry may cause incorrect occlusion culling to occur, as in :ref:`doc_occlusion_culling_troubleshooting_false_negative`.
ga: Cuimhnigh an luach simplithe a choinneáil réasúnta. D'fhéadfadh luachanna atá ró-ard do ghéimseadracht an leibhéil a bheith ina chúis le ciúradh mícheart, mar atá in:ref: `doc_occlusion_culling_soluoting_false_negative`.
ru: Помните, что необходимо поддерживать разумное значение упрощения. Значения, которые слишком высоки для геометрии уровня, могут привести к неправильному отсечению окклюзии, как в :ref:`doc_occlusion_culling_troubleshooting_false_negative`.
ta: எளிமைப்படுத்தல் மதிப்பை நியாயமானதாக வைத்திருக்க நினைவில் கொள்ளுங்கள். மட்டத்தின் வடிவவியலுக்கு மிக அதிகமாக இருக்கும் மதிப்புகள் தவறான மறைமுகத்தை ஏற்படுத்தக்கூடும், இதுபோன்று: குறிப்பு: `doc_occlusion_culling_troubleshooting_false_negative`.
uk: Пам’ятайте, що значення спрощення має бути розумним. Значення, які є занадто високими для геометрії рівня, можуть спричинити неправильне відсічення оклюзії, як у :ref:`doc_occlusion_culling_troubleshooting_false_negative`.

source: If this still doesn't lead to low enough CPU usage, you can try adjusting the **Rendering > Occlusion Culling > BVH Build Quality** project setting and/or decreasing **Rendering > Occlusion Culling > Occlusion Rays Per Thread**. You'll need to enable the **Advanced** toggle in the Project Settings dialog to see those settings.
ga: Mura n-eascraíonn úsáid LAP íseal go leor dá bharr seo go fóill, is féidir leat triail a bhaint as socrú an tionscadail **Rindreáil > Marú Occlusion > Cáilíocht Tógála BVH** a choigeartú agus/nó **Rindeáil > Marú Occlusion > Occlusion Rays Per Thread** a choigeartú. Beidh ort an scoránaigh **Ardleibhéal** a chumasú sa dialóg Socruithe an Tionscadail chun na socruithe sin a fheiceáil.
ru: Если это все еще не приводит к достаточно низкому использованию CPU, вы можете попробовать настроить **Rendering > Occlusion Culling > BVH Build Quality** проектные настройки и/или уменьшить **Rendering > Occlusion Culling > Occlusion Rays Per Thread**. Вам нужно будет включить переключатель **Advanced** в диалоговом окне Project Settings, чтобы увидеть эти настройки.
ta: இது இன்னும் போதுமான அளவு சிபியு பயன்பாட்டிற்கு வழிவகுக்கவில்லை என்றால், நீங்கள் ** ரெண்டரிங்> ஆக்லூசன் கல்லிங்> பி.வி.எச் பில்ட் தகுதி ** திட்ட அமைப்பு மற்றும்/அல்லது குறைத்தல் ** ரெண்டரிங்> ஆக்லூசன் குல்லிங்> ஒரு நூலுக்கு எதிர்க்கும் கதிர்கள் **. அந்த அமைப்புகளைக் காண திட்ட அமைப்புகள் உரையாடலில் ** மேம்பட்ட ** மாற்றத்தை நீங்கள் இயக்க வேண்டும்.
uk: Якщо це все ще не призводить до достатньо низького використання ЦП, ви можете спробувати відкоригувати параметр проекту **Відображення > Відсічення перекриття > Якість збірки BVH** і/або зменшити значення **Візуалізація > Відсікання перекриття > Промені перекриття на потік**. Вам потрібно буде ввімкнути перемикач **Додатково** у діалоговому вікні налаштувань проекту, щоб побачити ці налаштування.

source: Troubleshooting
ga: Fabhtcheartú
it: Risoluzione dei problemi
ru: Устранение неполадок
ta: சரிசெய்தல்
uk: Вирішення проблем

source: My occludee isn't being culled when it should be
ga: Níl mo occludee á chailleadh nuair ba chóir é a bheith
ru: Мой окклюдер не уничтожается, когда это необходимо
ta: என் மறைமுகமானது எப்போது இருக்க வேண்டும் என்று குறைக்கப்படவில்லை
uk: Мій оклюд не вибраковується, коли це повинно бути

source: **On the occluder side:**
ga: ** Ar an taobh occluder: **
it: **Dal lato dell'occlusore:**
ru: **Со стороны окклюдера:**
ta: ** மறைமுக பக்கத்தில்: **
uk: **З боку оклюдера:**

source: First, double-check that the **Bake > Cull Mask** property in the OccluderInstance3D is set to allow baking the meshes you'd like. The visibility layer of the MeshInstance3D nodes must be present within the cull mask for the mesh to be included in the bake.
ga: Ar dtús, seiceáil faoi dhó go bhfuil an mhaoin **Bake > Cull Mask** san OccluderInstance3D socraithe chun na mogaill a theastaíonn uait a bhácáil. Caithfidh ciseal infheictheachta na nóid MeshInstance3D a bheith i láthair laistigh den masc maraithe chun an mogalra a chur san áireamh sa bhácáil.
ru: Во-первых, дважды проверьте, что свойство **Bake > Cull Mask** в OccluderInstance3D установлено для разрешения запекания нужных вам сеток. Слой видимости узлов MeshInstance3D должен присутствовать в маске отсечения, чтобы сетка была включена в запекание.
ta: முதலில், நீங்கள் விரும்பும் மெச்களை பேக்கிங் செய்ய அனுமதிக்க OccluderInstance3d இல் உள்ள ** bake> cull மறைப்பு ** சொத்து அமைக்கப்பட்டுள்ளது என்பதை இருமுறை சரிபார்க்கவும். மெசின்ச்டன்ச் 3 டி முனைகளின் தெரிவுநிலை அடுக்கு சுட்டியில் சேர்க்க கல் முகமூடிக்குள் இருக்க வேண்டும்.
uk: По-перше, ще раз переконайтеся, що властивість **Bake > Cull Mask** в OccluderInstance3D налаштовано на дозвіл запікання сіток, які ви хочете. Рівень видимості вузлів MeshInstance3D має бути присутнім у масці відбракування, щоб сітка була включена до запікання.

source: Also note that occluder baking only takes meshes with *opaque* materials into account. Surfaces will *transparent* materials will **not** be included in the bake, even if the texture applied on them is fully opaque.
ga: Tabhair faoi deara freisin nach gcuireann bácáil occluder ach mogalra le hábhaí* neamhdhéil* san áireamh. Ní chuirfear dromchla* trédhearcach* ábhair san áireamh sa bhácáil, fiú má tá an uigeacht a chuirtear i bhfeidhm orthu go hiomlán trédhearcach.
ru: Также обратите внимание, что запекание окклюдера учитывает только сетки с *непрозрачными* материалами. Поверхности с *прозрачными* материалами **не** будут включены в запекание, даже если примененная к ним текстура полностью непрозрачна.
ta: ஆக்லுடர் பேக்கிங் * ஒளிபுகா * பொருட்களுடன் மெச்களை மட்டுமே கணக்கில் எடுத்துக்கொள்கிறது என்பதையும் நினைவில் கொள்க. மேற்பரப்புகள்*வெளிப்படையான*பொருட்கள் ** அல்ல ** சுட்டுக்கொள்ளாது, அவற்றில் பயன்படுத்தப்படும் அமைப்பு முழுமையாக ஒளிபுகாதாக இருந்தாலும் கூட.
uk: Також зауважте, що запікання оклюдера враховує лише сітки з *непрозорими* матеріалами. Поверхні будуть *прозорі* матеріали **не** будуть включені в обпічку, навіть якщо нанесена на них текстура повністю непрозора.

source: Lastly, remember that MultiMeshInstance3D, GPUParticles3D, CPUParticles3D and CSG nodes are **not** taken into account when baking occluders. As a workaround, you can add OccluderInstance3D nodes for those manually.
ga: Ar deireadh, cuimhnigh nach gcuirtear nóid MultimesHinstance3D, GPUParticles3D, CPUParticles3D agus CSG** san áireamh agus occluders á bácáil. Mar réiteach, is féidir leat nóid OccluderInstance3D a chur dóibh siúd de láimh.
ru: Наконец, помните, что узлы MultiMeshInstance3D, GPUParticles3D, CPUParticles3D и CSG **не** учитываются при запекании окклюдеров. В качестве обходного пути вы можете вручную добавить для них узлы OccluderInstance3D.
ta: கடைசியாக, மல்டிமெசின்ச்டன்ச் 3 டி, சிபூபார்டிகல்ச் 3 டி, சிபூபார்டிகல்ச் 3 டி மற்றும் சிஎச்சி முனைகள் ** அல்ல ** பேக்கிங் செய்யும்போது கணக்கில் எடுத்துக்கொள்ளப்படுகின்றன என்பதை நினைவில் கொள்ளுங்கள். ஒரு பணித்தொகுப்பாக, நீங்கள் கைமுறையாக occluderinstance3d முனைகளை சேர்க்கலாம்.
uk: Нарешті, пам’ятайте, що вузли MultiMeshInstance3D, GPUParticles3D, CPUParticles3D і CSG **не** враховуються під час запікання оклюдерів. Як обхідний шлях ви можете додати для них вузли OccluderInstance3D вручну.

source: **On the occludee side:**
ga: **Ar an taobh occludee: **
it: **Dal lato dell'occluso:**
ru: **На окклюдированной стороне:**
ta: ** மறைமுக பக்கத்தில்: **
uk: **З боку оклюдії:**

source: Make sure **Extra Cull Margin** is set as low as possible (it should usually be ``0.0``), and that **Ignore Occlusion Culling** is disabled in the object's GeometryInstance3D section.
ga: Déan cinnte go bhfuil **Margin Breise Cull** socraithe chomh híseal agus is féidir (ba chóir go mbeadh sé `0.0`` de ghnáth), agus go ndéantar **Ignorate Occlusion Culling** faoi dhíchumasú i rannán GeometryInstance3D an réada.
ru: Убедитесь, что **Extra Cull Margin (Дополнительное поле отбраковки)** установлено как можно ниже (обычно оно должно быть равно ``0.0``), а параметр **Ignore Occlusion Culling (Игнорировать отбраковку перекрытий)** отключен в разделе GeometryInstance3D объекта.
ta: ** கூடுதல் குல் விளிம்பு ** முடிந்தவரை குறைவாக அமைக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் (இது வழக்கமாக `` 0.0`` ஆக இருக்க வேண்டும்), மேலும் ** புறக்கணிப்பு மறைவை குறைப்பது ** பொருளின் வடிவியல்இன்ச்டன்ச் 3 டி பிரிவில் முடக்கப்பட்டுள்ளது.
uk: Переконайтеся, що **Extra Cull Margin** установлено якомога менше (зазвичай воно має бути ``0.0``), а **Ignore Occlusion Culling** вимкнено в розділі GeometryInstance3D об’єкта.

source: Also, check the AABB's size (which is represented by an orange box when selecting the node). This axis-aligned bounding box must be *fully* occluded by the occluder shapes for the occludee to be hidden.
ga: Chomh maith leis sin, seiceáil méid an AABB (a léiríonn bosca oráiste agus an nód á roghnú agat). Caithfidh an bosca teorainneacha ailínithe le haiseach seo a bheith caoil* go hiomlán* ag na cruthanna occluder chun an occludee a bheith i bhfolach.
ru: Также проверьте размер AABB (который представлен оранжевым полем при выборе узла). Этот выровненный по оси ограничивающий прямоугольник должен быть *полностью* закрыт формами окклюдера, чтобы окклюдер был скрыт.
ta: மேலும், AABB இன் அளவை சரிபார்க்கவும் (இது முனையைத் தேர்ந்தெடுக்கும்போது ஆரஞ்சு பெட்டியால் குறிப்பிடப்படுகிறது). இந்த அச்சு-சீரமைக்கப்பட்ட எல்லை பெட்டி * முழுமையாக * மறைக்கப்பட வேண்டும்.
uk: Також перевірте розмір AABB (який позначається помаранчевою рамкою під час вибору вузла). Ця обмежувальна рамка, вирівняна за віссю, має бути *повністю* перекрита формами оклюдера, щоб оклюдію було приховано.

source: My occludee is being culled when it shouldn't be
ga: Tá mo occludee á chailleadh nuair nár chóir é a bheith
ru: Мой окклюдер отбраковывается, когда этого не должно быть
ta: என் மறைமுகமாக இருக்கக்கூடாது போது அது குறைக்கப்படுகிறது
uk: Мій окклюд вибраковується, коли цього не повинно бути

source: The most likely cause for this is that objects that were included in the occluder bake have been moved after baking occluders. For instance, this can occur when moving your level geometry around or rearranging its layout. To fix this, select the OccluderInstance3D node and bake occluders again.
ga: Is é an chúis is dóichí leis seo ná go ndearnadh rudaí a bhí san áireamh sa bhácáil occluder bogadh tar éis occluders bácála. Mar shampla, féadfaidh sé seo tarlú nuair a bhíonn do geoiméadacht leibhéil á bhogadh timpeall nó ag athshocrú Chun é seo a shocrú, roghnaigh an nód OccluderInstance3D agus bácáil occluders arís.
ru: Наиболее вероятной причиной этого является то, что объекты, включенные в запекание окклюдера, были перемещены после запекания окклюдеров. Например, это может произойти при перемещении геометрии уровня или перераспределении его макета. Чтобы исправить это, выберите узел OccluderInstance3D и запекайте окклюдеры снова.
ta: இதற்கு பெரும்பாலும் காரணம் என்னவென்றால், ஆக்லூடர் சுட்டுக்கொள்ளப்பட்ட பொருள்கள் பேக்கிங் மறைமுகங்களுக்குப் பிறகு நகர்த்தப்பட்டுள்ளன. உதாரணமாக, உங்கள் நிலை வடிவவியலை நகர்த்தும்போது அல்லது அதன் தளவமைப்பை மறுசீரமைக்கும்போது இது ஏற்படலாம். இதை சரிசெய்ய, occluderinstance3d முனை என்பதைத் தேர்ந்தெடுத்து மீண்டும் சுட்டுக்கொள்ளுங்கள்.
uk: Найімовірнішою причиною цього є те, що об’єкти, які були включені до запікання оклюдера, були переміщені після запікання оклюдерів. Наприклад, це може статися під час переміщення геометрії рівня або зміни його макета. Щоб виправити це, виберіть вузол OccluderInstance3D і знову запікайте оклюдери.

source: This can also happen because dynamic objects were included in the bake, even though they shouldn't be. Use the :ref:`occlusion culling debug draw mode <doc_occlusion_culling_preview>` to look for occluder shapes that shouldn't be present, then :ref:`adjust the bake cull mask accordingly <doc_occlusion_culling_baking>`.
ga: Is féidir leis seo tarlú freisin toisc go raibh rudaí dinimiciúla san áireamh sa bhácáil, cé nár cheart dóibh a bheith. Úsáid an modh tarraingthe dífhabhtaithe :ref:`occlusion maraithe <doc_occlusion_culling_preview>` chun cruthanna folaithe a lorg nár cheart a bheith i láthair, ansin :ref:`coigeartaigh an masc maraithe bácála dá réir <doc_occlusion_culling_baking>`.
ru: Это также может произойти, если в запекание были включены динамические объекты, хотя их там быть не должно. Используйте :ref:`режим отладки отрисовки occlusion culling <doc_occlusion_culling_preview>` для поиска форм окклюдера, которые не должны присутствовать, затем :ref:`соответственно отрегулируйте маску bake culling <doc_occlusion_culling_baking>`.
ta: இது நிகழலாம், ஏனெனில் மாறும் பொருள்கள் சுட்டுக்கொள்ளக்கூடாது என்றாலும், அவை சுடப்படவில்லை. : Ref: `ஆக்லூசன் கல்லிங் பிழைத்திருத்த டிரா பயன்முறை <doc_occlusion_culling_preview>` இல்லாத மறைமுக வடிவங்களைத் தேடுவதற்கு, பின்னர்: ref: `அதற்கேற்ப சுட்டுக்கொள்ள க்ரோல் முகமூடியை சரிசெய்யவும்.
uk: Це також може статися через те, що динамічні об’єкти були включені в пакет, хоча це не повинно бути. Використовуйте :ref:`occlusion culling debug draw mode <doc_occlusion_culling_preview>`, щоб шукати форми окклюдерів, яких не повинно бути, а потім :ref:`adjust the bake cull mask accordingly <doc_occlusion_culling_baking>`.

source: The last possible cause for this is overly aggressive mesh simplification during the occluder baking process. Select the OccluderInstance3D node, decrease the **Bake > Simplification** property then bake occluders again.
ga: Is é an chúis dheireanach a d'fhéadfadh a bheith leis seo ná simpliú mogalra ró-ionsaitheach le linn phróiseas bácála an occluder. Roghnaigh an nód OccluderInstance3D, laghdaigh an t-airí **Bácáil > Simpliú** agus bácáil occluders arís.
ru: Последняя возможная причина этого — чрезмерно агрессивное упрощение сетки во время процесса запекания окклюдеров. Выберите узел OccluderInstance3D, уменьшите свойство **Bake > Simplification**, затем запеките окклюдеры снова.
ta: இதற்கு கடைசி சாத்தியமான காரணம், ஆக்லூடர் பேக்கிங் செயல்பாட்டின் போது அதிகப்படியான வன்கவர்வு கண்ணி எளிமைப்படுத்தல் ஆகும். OCCLUDERINSTANCE3D முனையைத் தேர்ந்தெடுத்து, ** சுட்டுக்கொள்ள> எளிமைப்படுத்தல் ** சொத்தை குறைக்கவும், பின்னர் மீண்டும் சுட்டிக்காட்டுபவர்களை சுட்டுக்கொள்ளுங்கள்.
uk: Останньою можливою причиною цього є занадто агресивне спрощення сітки під час запікання оклюдера. Виберіть вузол OccluderInstance3D, зменшіть властивість **Bake > Simplification**, а потім знову запікайте оклюдери.

source: As a last resort, you can enable the **Ignore Occlusion Culling** property on the occludee. This will negate the performance improvements of occlusion culling for that object, but it makes sense to do this for objects that will never be culled (such as a first-person view model).
ga: Mar rogha dheiridh, is féidir leat an maoin **Neamhaird a dhéanamh ar Osclusion Culling** ar an occludee a chumasú. Déanfaidh sé seo diúltú ar fheabhsuithe feidhmíochta a bhaineann le diúltú oclusion don réad sin, ach tá sé ciallmhar é seo a dhéanamh le haghaidh rudaí nach ndéanfar riamh a scriosadh (mar shampla samhail radharc den chéad duine).
ru: В качестве последнего средства вы можете включить свойство **Ignore Occlusion Culling (Игнорировать отсечение окклюзии)** на occludee. Это сведет на нет улучшения производительности отсечения окклюзии для этого объекта, но имеет смысл сделать это для объектов, которые никогда не будут отсеиваться (например, модель вида от первого лица).
ta: கடைசி முயற்சியாக, நீங்கள் ** புறக்கணிப்பு மறைமுகத்தை குறைப்பதை இயக்கலாம் ** சொத்து. இது அந்த பொருளைக் குறைப்பதன் செயல்திறன் மேம்பாடுகளை மறுக்கும், ஆனால் ஒருபோதும் குறைக்கப்படாத பொருள்களுக்கு இதைச் செய்வது அர்த்தமுள்ளதாக இருக்கும் (முதல் நபர் பார்வை மாதிரி போன்றவை).
uk: В крайньому випадку, ви можете ввімкнути властивість **Ignore Occlusion Culling** для occludee. Це зведе нанівець покращення продуктивності відсіювання оклюзії для цього об’єкта, але має сенс робити це для об’єктів, які ніколи не будуть відбраковані (наприклад, модель перегляду від першої особи).

source: When using the Clustered Forward rendering backend, the engine already performs a *depth prepass*. This consists in rendering a depth-only version of the scene before rendering the scene's actual materials. This is used to ensure each opaque pixel is only shaded once, reducing the cost of overdraw significantly.
ga: Nuair a bhíonn an t-inneall rindreála Cnuasaithe ar Aghaidh á úsáid, déanann an t-inneall *réamhbhealach doimhneachta* cheana féin. Is éard atá i gceist leis seo leagan doimhneachta amháin den radharc a thabhairt sula rindreáiltear fíor-ábhair an radhairc. Úsáidtear é seo chun a chinntiú nach ndéantar gach picteilín teimhneach a scáthú ach uair amháin, rud a laghdóidh costas rótharraingt go suntasach.

source: The greatest performance benefits can be observed when using the Forward Mobile rendering backend, as it does not feature a depth prepass for performance reasons. As a result, occlusion culling will actively decrease shading overdraw with that rendering backend.
ga: Is féidir na buntáistí feidhmíochta is mó a fheiceáil agus an cúltaca rindreála Forward Mobile á úsáid agat, toisc nach bhfuil réamhas doimhneachta ann ar chúiseanna feidhmíochta. Mar thoradh air sin, laghdóidh culling occlusion rótharraingt scáthaithe go gníomhach leis an gcúltaca rindreála sin.

source: *"occluder" refers to the shape blocking the view, while "occludee" refers to the object being hidden.*
ga: * Tagraíonn “occluder” don chruth a chuireann bac ar an radharc, agus tagraíonn “occludee” don rud atá i bhfolach. *

source: To toggle occlusion culling at run-time, set ``use_occlusion_culling`` on the root viewport as follows:
ga: Chun cuileadh occlusion a athrú ag am rith, socraigh ``use_occlusion_culling`` ar an amharc fréimhe mar seo a leanas:

source: Toggling occlusion culling at run-time is useful to compare performance on a running project.
ga: Tá sé úsáideach chun feidhmíocht a chur i gcomparáid ar thionscadal reatha ag am rith chun comparáid a dhéanamh idir feidhmíocht.
