Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/occlusion_culling.po
Languages: ga, it, ru, ta, uk

source: Since Godot 4.4, CSG nodes can be taken into account in the baking process if they are :ref:`converted to a MeshInstance3D <doc_csg_tools_converting_to_mesh_instance_3d>` before baking occluders.
ru: Начиная с Godot 4.4, узлы CSG можно учитывать в процессе запекания, если они :ref:`converted to a MeshInstance3D <doc_csg_tools_converting_to_mesh_instance_3d>` перед запеканием окклюдеров.
uk: Починаючи з Godot 4.4, вузли CSG можна брати до уваги в процесі запікання, якщо їх :ref:`converted to a MeshInstance3D <doc_csg_tools_converting_to_mesh_instance_3d>` перед запіканням оклюдерів.

source: This restriction does not apply to *occludees*. Any node type that inherits from GeometryInstance3D can be occluded.
ga: Ní bhaineann an srian seo maidir le *occludeas*. Is féidir aon chineál nód a thagann oidhreacht ó GeometryInstance3D a dhícheangal.
ru: Это ограничение не распространяется на *occludees*. Любой тип узла, который наследуется от GeometryInstance3D, может быть occluded.
ta: இந்த கட்டுப்பாடு *மறைவுகளுக்கு *பொருந்தாது. Geometiminstance3d இலிருந்து பெறும் எந்த முனை வகையையும் மறைக்க முடியும்.
uk: Це обмеження не поширюється на *occludees*. Будь-який тип вузла, який успадковується від GeometryInstance3D, може бути закритий.

source: After enabling the occlusion culling project setting mentioned above, add an OccluderInstance3D node to the scene containing your 3D level.
ga: Tar éis duit an socrú tionscadail cuileála occlusion a luaitear thuas a chumasú, cuir nód OccluderInstance3D leis an radharc ina bhfuil do leibhéal 3D.
ru: После включения настройки проекта occluderculling, упомянутой выше, добавьте узел OccluderInstance3D в сцену, содержащую ваш 3D-уровень.
ta: மேலே குறிப்பிட்டுள்ள மறைமுகமான திட்ட திட்ட அமைப்பை இயக்கிய பிறகு, உங்கள் 3 டி மட்டத்தைக் கொண்ட காட்சியில் ஒரு occluderinstance3d முனையைச் சேர்க்கவும்.
uk: Увімкнувши згадане вище налаштування проекту відбору оклюзії, додайте вузол OccluderInstance3D до сцени, що містить ваш 3D-рівень.

source: Select the OccluderInstance3D node, then click **Bake Occluders** at the top of the 3D editor viewport. After baking, the OccluderInstance3D node will contain an Occluder3D resource that stores a simplified version of your level's geometry. This occluder geometry appears as purple wireframe lines in the 3D view (as long as **View Gizmos** is enabled in the **Perspective** menu). This geometry is then used to provide occlusion culling for both static and dynamic occludees.
ga: Roghnaigh an nód OccluderInstance3D, ansin cliceáil **Bake Occluders** ag barr radharc an eagarthóra 3D. Tar éis bácáil, beidh acmhainn Occluder3D sa nód OccluderInstance3D a stóráilíonn leagan simplithe de ghéiméadracht do leibhéal. Tá an geoiméadacht occluder seo le feiceáil mar línte sreangfhráma corcra sa radharc 3D (fad is atá **View Gizmos** cumasaithe sa roghchlár **Peirspictive**). Úsáidtear an geoiméadracht seo ansin chun diúltú oclúcháin a sholáthar d'occludes statacha agus dinimiciúla araon.
ru: Выберите узел OccluderInstance3D, затем нажмите **Bake Occluders** в верхней части окна просмотра 3D-редактора. После запекания узел OccluderInstance3D будет содержать ресурс Occluder3D, который хранит упрощенную версию геометрии вашего уровня. Эта геометрия окклюдера отображается в виде фиолетовых линий каркаса в 3D-виде (при условии, что **View Gizmos** включен в меню **Perspective**). Затем эта геометрия используется для обеспечения окклюзивного обрезания как для статических, так и для динамических окклюдеров.
ta: OCCLUDERINSTANCE3D முனையைத் தேர்ந்தெடுத்து, 3D எடிட்டர் வியூச்போர்ட்டின் மேற்புறத்தில் ** சுட்டுக் கொல்லுங்கள் **. பேக்கிங்கிற்குப் பிறகு, occluderinstance3d முனையில் உங்கள் மட்டத்தின் வடிவவியலின் எளிமையான பதிப்பை சேமிக்கும் Occluder3d வளத்தைக் கொண்டிருக்கும். இந்த மறைமுக வடிவியல் 3D பார்வையில் ஊதா வயர்ஃப்ரேம் கோடுகளாகத் தோன்றுகிறது (** பார்க்கும் வரை கிச்மோச் ** ** முன்னோக்கு ** பட்டியலில் இயக்கப்பட்டிருக்கும்). இந்த வடிவியல் பின்னர் நிலையான மற்றும் மாறும் மறைவுகளுக்கு இடையூறுகளை வழங்க பயன்படுகிறது.
uk: Виберіть вузол OccluderInstance3D, а потім натисніть **Bake Occluders** у верхній частині вікна перегляду 3D-редактора. Після запікання вузол OccluderInstance3D міститиме ресурс Occluder3D, який зберігає спрощену версію геометрії вашого рівня. Ця геометрія оклюдера відображається як фіолетові каркасні лінії в 3D-перегляді (поки **Перегляд штучок** увімкнено в меню **Перспектива**). Потім ця геометрія використовується для забезпечення відсікання оклюзії як для статичних, так і для динамічних оклюзій.

source: After baking, you may notice that your dynamic objects (such as the player, enemies, etc…) are included in the baked mesh. To prevent this, set the **Bake > Cull Mask** property on the OccluderInstance3D to exclude certain visual layers from being baked.
ga: Tar éis bácála, b'fhéidir go dtabharfaidh tú faoi deara go bhfuil do chuid rudaí dinimiciúla (amhail an t-imreoir, naimhde, srl...) san áireamh sa mhogalra bácáilte. Chun é seo a chosc, socraigh an t-airí **Bake > Cull Mask** ar an OccluderInstance3D chun sraitheanna amhairc áirithe a eisiamh ó bheith bácáilte.
ru: После запекания вы можете заметить, что ваши динамические объекты (такие как игрок, враги и т. д.) включены в запеченную сетку. Чтобы предотвратить это, установите свойство **Bake > Cull Mask** на OccluderInstance3D, чтобы исключить определенные визуальные слои из запекания.
ta: பேக்கிங்கிற்குப் பிறகு, உங்கள் மாறும் பொருள்கள் (வீரர், எதிரிகள் போன்றவை…) சுட்ட கண்ணி இல் சேர்க்கப்பட்டுள்ளன என்பதை நீங்கள் கவனிக்கலாம். இதைத் தடுக்க, சில காட்சி அடுக்குகளை சுடாமல் விலக்க, ** பேக்> குல் மாச்க் ** சொத்தை Occluderinstance3d இல் அமைக்கவும்.
uk: Після запікання ви можете помітити, що ваші динамічні об’єкти (такі як гравець, вороги тощо) включені в запечену сітку. Щоб запобігти цьому, установіть властивість **Bake > Cull Mask** на OccluderInstance3D, щоб виключити певні візуальні шари від запікання.

source: For example, you can disable layer 2 on the cull mask, then configure your dynamic objects' MeshInstance3D nodes to be located on the visual layer 2 (instead of layer 1). To do so, select the MeshInstance3D node in question, then on the **VisualInstance3D > Layers** property, uncheck layer 1 then check layer 2. After configuring both cull mask and layers, bake occluders again by following the above process.
ga: Mar shampla, is féidir leat ciseal 2 a dhíchumasú ar an masc maraithe, ansin do nóid MeshInstance3D do rudaí dinimiciúla a chumrú le bheith suite ar an gciseal amhairc 2 (in ionad ciseal 1). Chun é sin a dhéanamh, roghnaigh an nód MeshInstance3D atá i gceist, ansin ar an maoin **VisualInstance3D > Layers**, díthiceáil ciseal 1 ansin seiceáil ciseal 2. Tar éis an dá masc maraithe agus na sraitheanna a chumrú, bácáil occluders arís tríd an bpróiseas thuas a leanúint.
ru: Например, вы можете отключить слой 2 на маске отбраковки, а затем настроить узлы MeshInstance3D динамических объектов так, чтобы они располагались на визуальном слое 2 (вместо слоя 1). Для этого выберите нужный узел MeshInstance3D, затем в свойстве **VisualInstance3D > Layers** снимите отметку со слоя 1, а затем отметьте слой 2. После настройки маски отбраковки и слоев снова запеките окклюдеры, следуя описанному выше процессу.
ta: எடுத்துக்காட்டாக, நீங்கள் குல் முகமூடியில் அடுக்கு 2 ஐ முடக்கலாம், பின்னர் உங்கள் மாறும் பொருள்களின் மெசின்ச்டன்ச் 3 டி முனைகளை காட்சி அடுக்கு 2 இல் (அடுக்கு 1 க்கு பதிலாக) கட்டமைக்கலாம். அவ்வாறு செய்ய, கேள்விக்குரிய Meshinstance3d முனையைத் தேர்ந்தெடுக்கவும், பின்னர் ** VisualInstance3d> அடுக்குகள் ** சொத்து, தேர்வு செய்யப்படாத அடுக்கு 1 பின்னர் அடுக்கு 2 ஐ சரிபார்க்கவும்.
uk: Наприклад, ви можете вимкнути шар 2 на масці відбракування, а потім налаштувати вузли MeshInstance3D своїх динамічних об’єктів на розміщення на візуальному рівні 2 (замість шару 1). Для цього виберіть відповідний вузол MeshInstance3D, а потім у властивості **VisualInstance3D > Layers** зніміть прапорець із шару 1, а потім установіть прапорець із шару 2. Після налаштування маски відбракування та шарів знову запікайте оклюдери, дотримуючись описаного вище процесу.

source: Manually placing occluders
ga: Ag cur occluders de láimh
it: Posizionare manualmente gli occlusori
ru: Ручная установка окклюдеров
ta: கைமுறையாக ஆக்லூடர்களை வைக்கிறது
uk: Встановлення оклюдерів вручну

source: This approach is more suited for specialized use cases, such as creating occlusion for MultiMeshInstance3D setups or CSG nodes (due to the aforementioned limitation).
ga: Tá an cur chuige seo níos oiriúnaí do chásanna úsáide speisialaithe, mar shampla occlusion a chruthú do shocruithe MultimeShinstance3D nó nóid CSG (mar gheall ar an teorannú thuasluaite).
ru: Этот подход больше подходит для специализированных случаев использования, таких как создание окклюзии для установок MultiMeshInstance3D или узлов CSG (из-за вышеупомянутого ограничения).
ta: மல்டிமெசின்ச்டன்ச் 3 டி அமைப்புகள் அல்லது சி.எச்.சி முனைகளுக்கு (மேற்கூறிய வரம்பு காரணமாக) மறைவை உருவாக்குவது போன்ற சிறப்பு பயன்பாட்டு நிகழ்வுகளுக்கு இந்த அணுகுமுறை மிகவும் பொருத்தமானது.
uk: Цей підхід більше підходить для спеціальних випадків використання, таких як створення оклюзії для налаштувань MultiMeshInstance3D або вузлів CSG (через згадане вище обмеження).

source: After enabling the occlusion culling project setting mentioned above, add an OccluderInstance3D node to the scene containing your 3D level. Select the OccluderInstance3D node, then choose an occluder type to add in the **Occluder** property:
ga: Tar éis duit an socrú tionscadail cuileála occlusion a luaitear thuas a chumasú, cuir nód OccluderInstance3D leis an radharc ina bhfuil do leibhéal 3D. Roghnaigh an nód OccluderInstance3D, ansin roghnaigh cineál occluder le cur isteach sa mhaoin **Occluder**:
ru: После включения настройки проекта occlusion culling, упомянутой выше, добавьте узел OccluderInstance3D в сцену, содержащую ваш 3D-уровень. Выберите узел OccluderInstance3D, затем выберите тип occluder для добавления в свойстве **Occluder**:
ta: மேலே குறிப்பிட்டுள்ள மறைமுகமான திட்ட திட்ட அமைப்பை இயக்கிய பிறகு, உங்கள் 3 டி மட்டத்தைக் கொண்ட காட்சியில் ஒரு occluderinstance3d முனையைச் சேர்க்கவும். OCCLUDERINSTANCE3D முனையைத் தேர்ந்தெடுத்து, ** Occluder ** சொத்தில் சேர்க்க ஒரு மறைமுக வகையைத் தேர்வுசெய்க:
uk: Увімкнувши згадане вище налаштування проекту відбору оклюзії, додайте вузол OccluderInstance3D до сцени, що містить ваш 3D-рівень. Виберіть вузол OccluderInstance3D, а потім виберіть тип блокувальника, який потрібно додати у властивості **Occluder**:

source: QuadOccluder3D (a single plane)
ga: Quadoccluder3D (eitleán amháin)
ru: QuadOccluder3D (одна плоскость)
ta: Quadoccluder3d (ஒரு விமானம்)
uk: QuadOccluder3D (одна площина)

source: BoxOccluder3D (a cuboid)
ga: Boxoccluder3D (cuboid)
ru: BoxOccluder3D (кубоид)
ta: பாக்சோக்லுடர் 3 டி (ஒரு க்யூபாய்டு)
uk: BoxOccluder3D (кубоподібний)

source: SphereOccluder3D (a sphere-shaped occluder)
ga: SphereOccluder3D (occluder cruth sphéar)
ru: SphereOccluder3D (сферический окклюдер)
ta: SpehereOccluder3d (ஒரு கோள வடிவ மறைமுகம்)
uk: SphereOccluder3D (оклюдер у формі сфери)

source: PolygonOccluder3D (a 2D polygon with as many points as you want)
ga: Polygonoccluder3D (polagán 2D le an oiread pointí agus is mian leat)
ru: PolygonOccluder3D (2D-полигон с любым количеством точек)
ta: பலகோணோக்ளூடர் 3 டி (நீங்கள் விரும்பும் அளவுக்கு புள்ளிகளைக் கொண்ட 2 டி பலகோணம்)
uk: PolygonOccluder3D (2D-багатокутник із скільки завгодно точок)

source: There is also ArrayOccluder3D, whose points can't be modified in the editor but can be useful for procedural generation from a script.
ga: Tá ArrayOccluder3D ann freisin, nach féidir a phointí a mhodhnú san eagarthóir ach is féidir a bheith úsáideach chun nós imeachta a ghiniúint ó script.
ru: Существует также ArrayOccluder3D, точки которого нельзя изменять в редакторе, но они могут быть полезны для процедурной генерации из скрипта.
ta: ArrayOccluder3d ஐயும் உள்ளது, அதன் புள்ளிகளை எடிட்டரில் மாற்ற முடியாது, ஆனால் ஒரு ச்கிரிப்டிலிருந்து நடைமுறை தலைமுறைக்கு பயனுள்ளதாக இருக்கும்.
uk: Існує також ArrayOccluder3D, точки якого не можна змінити в редакторі, але можуть бути корисними для процедурної генерації зі сценарію.

source: Previewing occlusion culling
ga: Réamhamharc ar dhiúltú oclúcháin
ru: Предварительный просмотр окклюзии
ta: மறைவை முன்னோட்டமிடுதல்
uk: Попередній перегляд оклюзії

source: You can enable a debug draw mode to preview what the occlusion culling is actually "seeing". In the top-left corner of the 3D editor viewport, click the **Perspective** button (or **Orthogonal** depending on your current camera mode), then choose **Display Advanced… > Occlusion Culling Buffer**. This will display the low-resolution buffer that is used by the engine for occlusion culling.
ga: Is féidir leat modh tarraingthe dífhabhtaithe a chumasú chun réamhamharc a dhéanamh ar a bhfuil le feiceáil ag an marú occlusion i ndáiríre. Sa chúinne uachtarach ar chlé de radharc an eagarthóra 3D, cliceáil ar an gcnaipe **Peirspictíocht** (nó **Orthogonal** ag brath ar an modh ceamara atá agat faoi láthair), ansin roghnaigh **Taispeáin Casta…> Maolán Maraithe Occlusion**. Taispeánfaidh sé seo an maolán ísealtaifigh a úsáideann an t-inneall le haghaidh marú folaithe.
ru: Вы можете включить режим отладки рисования, чтобы просмотреть, что на самом деле «видит» occlusion culling. В верхнем левом углу окна просмотра 3D-редактора нажмите кнопку **Perspective** (или **Orthogonal** в зависимости от текущего режима камеры), затем выберите **Display Advanced… > Occlusion Culling Buffer**. Это отобразит буфер низкого разрешения, который используется движком для occlusion culling.
ta: மறைமுகக் குறித்தல் உண்மையில் "பார்ப்பது" என்பதை முன்னோட்டமிட பிழைத்திருத்த டிரா பயன்முறையை நீங்கள் இயக்கலாம். 3D எடிட்டர் வியூபோர்ட்டின் மேல்-இடது மூலையில், ** முன்னோக்கு ** பொத்தானைக் சொடுக்கு செய்க (அல்லது ** ஆர்த்தோகனல் ** உங்கள் தற்போதைய கேமரா பயன்முறையைப் பொறுத்து), பின்னர் ** மேம்பட்டதைக் காண்பி…> ஆக்ச்லூசன் கல்லிங் இடையகத்தை **. இது இயந்திரத்தால் பயன்படுத்தப்படும் குறைந்த தெளிவுத்திறன் கொண்ட இடையகத்தைக் காண்பிக்கும்.
uk: Ви можете ввімкнути режим малювання налагодження, щоб переглянути, що насправді «бачить» оклюзія. У верхньому лівому куті вікна перегляду 3D-редактора клацніть кнопку **Перспектива** (або **Ортогональна** залежно від поточного режиму камери), а потім виберіть **Відображення розширеного… > Буфер відсікання загородження**. Це відобразить буфер із низькою роздільною здатністю, який використовується механізмом для відсічення оклюзії.

source: In the same menu, you can also enable **View Information** and **View Frame Time** to view the number of draw calls and rendered primitives (vertices + indices) in the bottom-right corner, along with the number of frames per second rendered in the top-right corner.
ga: Sa roghchlár céanna, is féidir leat **Féach ar Faisnéis** agus **Amharc Fráma Aim** a chumasú chun líon na nglaonna tarraingthe agus na bpríomh-léirithe (coirteanna + innéacsanna) a fheiceáil sa chúinne bun ar dheis, mar aon le líon na bhfrámaí in aghaidh an tsoicind a rinneadh sa chúinne barr ar dheis.
ru: В этом же меню вы также можете включить **Просмотр информации** и **Просмотр времени кадра**, чтобы просмотреть количество вызовов отрисовки и отрисованных примитивов (вершины + индексы) в правом нижнем углу, а также количество отрисованных кадров в секунду в правом верхнем углу.
ta: அதே பட்டியலில், நீங்கள் ** ஐக் காண்க தகவல்களைக் காண்க ** மற்றும் ** பிரேம் நேரம் ** ஐக் காண்க டிரா அழைப்புகளின் எண்ணிக்கையையும், கீழ்-வலது மூலையில் வழங்கப்பட்ட ஆதிமனிதர்களையும் (செங்குத்துகள் + குறியீடுகள்) காணவும், எண்ணுடன் ஒரு நொடிக்கு பிரேம்கள் மேல்-வலது மூலையில் வழங்கப்படுகின்றன.
uk: У цьому ж меню ви також можете ввімкнути **Переглянути інформацію** та **Переглянути час кадру**, щоб переглянути кількість викликів малювання та відтворених примітивів (вершини + індекси) у нижньому правому куті, а також кількість кадрів за секунду, які відображаються у верхньому правому куті.

source: If you toggle occlusion culling in the project settings while this information is displayed, you can see how much occlusion culling improves performance in your scene. Note that the performance benefit highly depends on the 3D editor camera's view angle, as occlusion culling is only effective if there are occluders in front of the camera.
ga: Má thaispeánann tú culling occlusion i socruithe an tionscadail agus an fhaisnéis seo á thaispeáint, is féidir leat a fheiceáil cé mhéad a fheabhsaíonn culling occlusion feidhmíocht i do radharc. Tabhair faoi deara go mbraitheann an tairbhe feidhmíochta go mór ar uillinn radhairc an cheamara eagarthóra 3D, mar ní bhíonn cullú oclusion éifeachtach ach má tá occluders os comhair an cheamara.
ru: Если вы включите occlusion culling в настройках проекта, пока отображается эта информация, вы увидите, насколько occlusion culling улучшает производительность вашей сцены. Обратите внимание, что выигрыш в производительности сильно зависит от угла обзора камеры 3D-редактора, так как occlusion culling эффективен только в том случае, если перед камерой есть окклюдеры.
ta: இந்தத் செய்தி காண்பிக்கப்படும் போது திட்ட அமைப்புகளில் நீங்கள் மறைவைக் குறைப்பதை மாற்றினால், உங்கள் காட்சியில் செயல்திறனை எவ்வளவு குறைப்பது மேம்படுத்துகிறது என்பதை நீங்கள் காணலாம். செயல்திறன் நன்மை 3D எடிட்டர் கேமராவின் பார்வை கோணத்தைப் பொறுத்தது என்பதை நினைவில் கொள்க, ஏனெனில் கேமராவின் முன் மறைமுகங்கள் இருந்தால் மட்டுமே மறைவு குறைத்தல் பயனுள்ளதாக இருக்கும்.
uk: Якщо ви увімкнете відсічення оклюзії в налаштуваннях проекту, поки ця інформація відображається, ви зможете побачити, наскільки відсічення оклюзії покращує продуктивність вашої сцени. Зауважте, що перевага продуктивності значною мірою залежить від кута огляду камери 3D-редактора, оскільки оклюзія ефективна, лише якщо перед камерою є оклюдери.

source: To toggle occlusion culling at runtime, set ``use_occlusion_culling`` on the root viewport as follows:
ru: Чтобы включить отсечение окклюзии во время выполнения, установите ``use_occlusion_culling`` в корневом окне просмотра следующим образом:
uk: Щоб увімкнути відсічення оклюзії під час виконання, встановіть ``use_occlusion_culling`` на кореневому вікні перегляду таким чином:

source: Toggling occlusion culling at runtime is useful to compare performance on a running project.
ru: Включение и выключение функции occlusion culling (Окклюзивное обрезание) во время выполнения полезно для сравнения производительности в работающем проекте.
uk: Перемикання відсіку оклюзії під час виконання корисно для порівняння продуктивності запущеного проекту.

source: Performance considerations
ga: Creithniúcháin
it: Considerazioni sulle prestazioni
ru: Компенсация производительности
ta: செயல்திறன் பரிசீலனைகள்
uk: Міркування продуктивності

source: Design your levels to take advantage of occlusion culling
ga: Dearadh do leibhéil chun leas a bhaint as diúltú oclúcháin
ru: Спроектируйте свои уровни так, чтобы использовать преимущества окклюзивного обрезания
ta: மறைமுகக் குறைப்பைப் பயன்படுத்த உங்கள் நிலைகளை வடிவமைக்கவும்
uk: Створюйте рівні, щоб скористатися перевагами оклюзійного відбору

source: **This is the most important guideline.** A good level design is not just about what the gameplay demands; it should also be built with occlusion in mind.
ga: **Is é seo an treoirlínte is tábhachtaí. ** Ní bhaineann dearadh leibhéal maith leis an méid a éilíonn an gameplay amháin; ba chóir é a thógáil freisin le hochtadh san áireamh.
ru: **Это самое важное правило.** Хороший дизайн уровня — это не только то, что требует игровой процесс; он также должен быть создан с учетом окклюзии (ограничений).
ta: ** இது மிக முக்கியமான வழிகாட்டுதலாகும். ** ஒரு நல்ல நிலை வடிவமைப்பு என்பது விளையாட்டு கோருவதைப் பற்றியது மட்டுமல்ல; இது மனதில் மறைவுடன் கட்டமைக்கப்பட வேண்டும்.
uk: **Це найважливіша вказівка.** Хороший дизайн рівнів — це не лише вимоги ігрового процесу; його також слід будувати з урахуванням оклюзії.

source: For indoor environments, add opaque walls to "break" the line of sight at regular intervals and ensure not too much of the scene can be seen at once.
ga: Maidir le timpeallachtaí faoi dhíon, cuir ballaí trédhearcacha leis chun an líne radhairc a “bhriseadh” ag eatraimh rialta agus a chinntiú nach féidir an iomarca den radharc a fheiceáil ag an am céanna.
ru: В помещениях добавьте непрозрачные стены, чтобы «разрывать» линию обзора через равные интервалы и гарантировать, что не слишком большая часть сцены будет видна одновременно.
ta: உட்புற சூழல்களுக்கு, வழக்கமான இடைவெளியில் பார்வைக் கோட்டை "உடைக்க" ஒளிபுகா சுவர்களைச் சேர்த்து, காட்சியை அதிகமாகக் காண முடியாது என்பதை உறுதிப்படுத்தவும்.
uk: Для внутрішнього середовища додайте непрозорі стіни, щоб «розірвати» лінію огляду через рівні проміжки часу та переконатися, що не надто багато сцени можна побачити одночасно.

source: For large open scenes, use a pyramid-like structure for the terrain's elevation when possible. This provides the greatest culling opportunities compared to any other terrain shape.
ga: Maidir le radhairc oscailte móra, bain úsáid as struchtúr cosúil le pirimid le haghaidh airde an tírdhreach nuair is féidir. Soláthraíonn sé seo na deiseanna cullú is mó i gcomparáid le haon chruth tírdhreach eile.
ru: Для больших открытых сцен используйте пирамидальную структуру для возвышения рельефа, когда это возможно. Это обеспечивает наибольшие возможности отбраковки по сравнению с любой другой формой рельефа.
ta: பெரிய திறந்த காட்சிகளுக்கு, முடிந்தவரை நிலப்பரப்பின் உயரத்திற்கு பிரமிட் போன்ற கட்டமைப்பைப் பயன்படுத்தவும். இது வேறு எந்த நிலப்பரப்பு வடிவத்துடன் ஒப்பிடும்போது மிகப் பெரிய குறைக்கும் வாய்ப்புகளை வழங்குகிறது.
uk: Для великих відкритих сцен використовуйте пірамідоподібну структуру для висоти рельєфу, коли це можливо. Це забезпечує найбільші можливості для вибракування порівняно з будь-якою іншою формою місцевості.

source: Avoid moving OccluderInstance3D nodes during gameplay
ga: Seachain nóid OccluderInstance3D a bhogadh le linn gameplay
ru: Избегайте перемещения узлов OccluderInstance3D во время игры
ta: விளையாட்டின் போது occluderinstance3d முனைகளை நகர்த்துவதைத் தவிர்க்கவும்
uk: Уникайте переміщення вузлів OccluderInstance3D під час гри

source: This includes moving the parents of OccluderInstance3D nodes, as this will cause the nodes themselves to move in global space, therefore requiring the :abbr:`BVH (Bounding Volume Hierarchy)` to be rebuilt.
ga: Áirítear leis seo tuismitheoirí nóid OccluderInstance3D a bhogadh, toisc go gcuirfidh sé seo faoi deara na nóid féin bogadh sa spás domhanda, agus dá bhrí sin éilíonn u:abbr: `BVH (Ordlathas Toirte Teorainneacha) `a atógáil.
ru: Это включает в себя перемещение родительских узлов OccluderInstance3D, поскольку это приведет к перемещению самих узлов в глобальном пространстве, что потребует перестройки :abbr:`BVH (Bounding Volume Hierarchy)`.
ta: அக்லூடெரின்ச்டன்ச் 3 டி முனைகளின் பெற்றோரை நகர்த்துவது இதில் அடங்கும், ஏனெனில் இது முனைகள் உலகளாவிய இடத்தில் செல்ல வழிவகுக்கும், எனவே இது தேவைப்படுகிறது: ஏபிபிஆர்: `பி.வி.எச் (கட்டுப்பாட்டு தொகுதி வரிசைமுறை)` மீண்டும் கட்டப்பட வேண்டும்.
uk: Це включає переміщення батьківських вузлів OccluderInstance3D, оскільки це спричинить переміщення самих вузлів у глобальному просторі, отже, вимагаючи перебудови :abbr:`BVH (Bounding Volume Hierarchy)`.
