Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/occlusion_culling.po
Languages: ga, it, ru, ta, uk

source: Occlusion culling
ga: Cailleadh occlusion
ru: Отбраковка окклюзии
ta: மறைவு குறைத்தல்
uk: Вибракування оклюзії

source: In a 3D rendering engine, **occlusion culling** is the process of performing hidden geometry removal.
ga: In inneall rindreála 3D, is é **diúltú occlusion** an próiseas chun bainte geoiméadracht i bhfolach a dhéanamh.
ru: В движке 3D-рендеринга **occlusion culling** — это процесс удаления скрытой геометрии.
ta: ஒரு 3D வழங்குதல் எஞ்சினில், ** மறைக்கப்பட்ட வடிவியல் அகற்றும் செயல்முறையாகும் ** மறைமுகம் ** ஆகும்.
uk: У системі 3D-рендерінгу **відсічення оклюзії** — це процес видалення прихованої геометрії.

source: On this page, you'll learn:
ga: Ar an leathanach seo, foghlaimeoidh tú:
it: In questa pagina imparerai:
ru: В этом руководстве вы узнаете:
ta: இந்த பக்கத்தில், நீங்கள் கற்றுக்கொள்வீர்கள்:
uk: На цій сторінці ви дізнаєтеся:

source: What are the advantages and pitfalls of occlusion culling.
ga: Cad iad na buntáistí agus na gaistí a bhaineann le caoileadh oclusion.
ru: Каковы преимущества и недостатки метода occlusion culling (окклюзионной выборки).
ta: மறைவின் நன்மைகள் மற்றும் ஆபத்துகள் என்ன.
uk: Які переваги та підводні камені вибракування оклюзії.

source: How to set up occlusion culling in Godot.
ga: Conas culling occlusion a chur ar bun i Godot.
ru: Как настроить occlusion culling (Окклюзивного обрезания) в Godot.
ta: கோடோட்டில் மறைவைக் குறைப்பது எப்படி.
uk: Як налаштувати відбір оклюзії в Godot.

source: Troubleshooting common issues with occlusion culling.
ga: Saincheisteanna coitianta a fhabhtcheartú le caoileadh oclusion.
ru: Устранение распространенных проблем с occlusion culling.
ta: மறைவுடன் பொதுவான சிக்கல்களை சரிசெய்தல்.
uk: Усунення поширених проблем з оклюзійним відбором.

source: You can see how occlusion culling works in action using the `Occlusion Culling and Mesh LOD demo project <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__.
ga: Is féidir leat a fheiceáil conas a oibríonn marú occlusion i ngníomh ag baint úsáide as an `Occlusion Culling and Mogalra tionscadal taispeána LOD <https://github.com/godotenginine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__.
it: È possibile osservare il funzionamento dell'occlusion culling in azione attraverso il progetto demo `Occlusion Culling and Mesh LOD <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__.
ru: Вы можете увидеть, как работает отбраковка окклюзии, используя `Демонстрационный проект Occlusion Culling и Mesh LOD <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__.
ta: `மறைமுகமான கலிங் மற்றும் மெச் லாட் டெமோ திட்டம் <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod> ____.
uk: Ви можете побачити, як працює відбір оклюзії в дії, використовуючи демонстраційний проект LOD Occlusion Culling and Mesh <https://github.com/godotengine/godot-demo-projects/tree/master/3d/occlusion_culling_mesh_lod>`__.

source: Why use occlusion culling
ga: Cén fáth a n-úsáidtear díothú occlusion
it: Perché utilizzare l'occlusion culling
ru: Зачем использовать окклюзионную выборку (обрезание)
ta: மறைமுகக் குறைப்பைப் பயன்படுத்துவது ஏன்
uk: Навіщо використовувати оклюзію

source: In this example scene with hundreds of rooms stacked next to each other, a dynamic object (red sphere) is hidden behind the wall in the lit room (on the left of the door):
ga: Sa radharc sampla seo le na céadta seomra cruachtaithe in aice lena chéile, tá réad dinimiciúil (sféar dearg) i bhfolach taobh thiar den bhalla sa seomra soilsithe (ar thaobh clé den doras):
ru: В этом примере сцены с сотнями комнат, расположенных рядом друг с другом, динамический объект (красная сфера) спрятан за стеной в освещенной комнате (слева от двери):
ta: இந்த எடுத்துக்காட்டு காட்சியில் நூற்றுக்கணக்கான அறைகள் ஒருவருக்கொருவர் அடுக்கி வைக்கப்பட்டுள்ளன, ஒரு மாறும் பொருள் (சிவப்பு கோளம்) லிட் அறையில் சுவரின் பின்னால் மறைக்கப்பட்டுள்ளது (கதவின் இடதுபுறத்தில்):
uk: У цьому прикладі сцени з сотнями кімнат, розташованих одна біля одної, динамічний об’єкт (червона сфера) приховано за стіною в освітленій кімнаті (ліворуч від дверей):

source: Example scene with an occlusion culling-friendly layout
ga: Radharc samplach le leagan amach atá neamhdhíobhálach do dhíothú
ru: Пример сцены с макетом, дружественным к occlusion culling
ta: உதாரணமான காட்சி ஒரு மறைவுடன் நட்பு-நட்பு தளவமைப்பு
uk: Приклад сцени з макетом, зручним для вибракування оклюзії

source: With occlusion culling disabled, all the rooms behind the lit room have to be rendered. The dynamic object also has to be rendered:
ga: Nuair a dhéantar míchumasú ar dhíchlú, caithfear na seomraí go léir taobh thiar den seomra soilsithe a léiriú Caithfear an réad dinimiciúil a léiriú freisin:
ru: При отключенном occlusion culling все комнаты за освещенной комнатой должны быть визуализированы. Динамический объект также должен быть визуализирован:
ta: மறைமுகமாக முடக்கப்பட்ட நிலையில், எரியும் அறையின் பின்னால் உள்ள அனைத்து அறைகளையும் வழங்க வேண்டும். மாறும் பொருளையும் வழங்க வேண்டும்:
uk: Якщо вибракування оклюзії вимкнено, усі кімнати за освітленою кімнатою мають бути візуалізовані. Динамічний об’єкт також потрібно відобразити:

source: Example scene with occlusion culling disabled (wireframe)
ga: Radharc samplach le díchumadh oclúcháin faoi mhíchumas (sreangfhráma)
ru: Пример сцены с отключенным occlusion culling (каркас)
ta: மறைமுகமான கலிங் முடக்கப்பட்ட எடுத்துக்காட்டு காட்சி (வயர்ஃப்ரேம்)
uk: Приклад сцени з вимкненим блокуванням оклюзії (каркас)

source: Example scene with occlusion culling **disabled** (wireframe)
ga: Radharc samplach le caoileadh oclúisí**míchumasach** (sreangfhráma)
ru: Пример сцены с **неработоспособным** occlusion culling (каркас)
ta: மறைவுடன் எடுத்துக்காட்டு காட்சி ** முடக்கப்பட்டது ** (வயர்ஃப்ரேம்)
uk: Приклад сцени з вибракуванням оклюзії **вимкнено** (каркас)

source: With occlusion culling enabled, only the rooms that are actually visible have to be rendered. The dynamic object is also occluded by the wall, and therefore no longer has to be rendered:
ga: Nuair a dhéantar cur isteach ar chumas, ní gá ach na seomraí atá le feiceáil i ndáiríre a léiriú. Tá an réad dinimiciúil cosc ar an mballa freisin, agus dá bhrí sin ní gá é a léiriú a thuilleadh:
ru: При включенном occlusion culling рендерить нужно только те комнаты, которые действительно видны. Динамический объект также закрыт стеной, и поэтому его больше не нужно рендерить:
ta: மறைவைக் குறைப்பதன் மூலம், உண்மையில் காணக்கூடிய அறைகள் மட்டுமே வழங்கப்பட வேண்டும். மாறும் பொருளும் சுவரால் மறைக்கப்படுகிறது, எனவே இனி வழங்கப்பட வேண்டியதில்லை:
uk: Якщо ввімкнуто відсікання оклюзії, потрібно відобразити лише ті кімнати, які фактично видимі. Динамічний об’єкт також закритий стіною, і тому його більше не потрібно візуалізувати:

source: Example scene with occlusion culling enabled (wireframe)
ga: Radharc samplach le caoileadh oclusion cumasaithe (sreangfhráma)
ru: Пример сцены с включенным occlusion culling (каркас)
ta: ஆக்ச்லூசன் கல்லிங் இயக்கப்பட்ட எடுத்துக்காட்டு காட்சி (வயர்ஃப்ரேம்)
uk: Приклад сцени з увімкненим блокуванням оклюзії (каркас)

source: Example scene with occlusion culling **enabled** (wireframe)
ga: Radharc samplach le caoileadh oclúsaí** cumasachtaí** (sreangfhráma)
ru: Пример сцены с **включенным** occlusion culling (каркас)
ta: மறைவுடன் எடுத்துக்காட்டு காட்சி ** இயக்கப்பட்டது ** (வயர்ஃப்ரேம்)
uk: Приклад сцени з **увімкненим** блокуванням оклюзії (каркас)

source: Since the engine has less work to do (fewer vertices to render and fewer draw calls), performance will increase as long as there are enough occlusion culling opportunities in the scene. This means occlusion culling is most effective in indoor scenes, preferably with many smaller rooms instead of fewer larger rooms. Combine this with :ref:`doc_mesh_lod` and :ref:`doc_visibility_ranges` to further improve performance gains.
ga: Ós rud é go bhfuil níos lú oibre le déanamh ag an inneall (níos lú coirteanna le déanamh agus níos lú glaonna tarraingthe), méadóidh feidhmíocht chomh fada agus a bheidh go leor deiseanna cuaillithe oclusion sa radharc. Ciallaíonn sé seo go bhfuil cuileáil oclusion is éifeachtaí i radhairc faoi dhíon, b'fhearr le go leor seomraí níos lú in ionad níos lú seomraí níos mó. Comhcheangail é seo le:ref: `doc_mesh_lod` agus:ref: `doc_visibility_ranges` chun gnóthachain feidhmíochta a fheabhsú tuilleadh.
ru: Так как движку нужно сделать меньше работы (меньше вершин для рендеринга и меньше вызовов отрисовки), производительность будет расти, пока в сцене достаточно возможностей для отсечения окклюзии. Это означает, что отсечение окклюзии наиболее эффективно в сценах внутри помещений, предпочтительно с большим количеством небольших комнат вместо меньшего количества больших комнат. Объедините это с :ref:`doc_mesh_lod` и :ref:`doc_visibility_ranges`, чтобы еще больше повысить производительность.
ta: இயந்திரத்திற்குச் செய்ய குறைந்த வேலை இருப்பதால் (வழங்குவதற்கான குறைவான செங்குத்துகள் மற்றும் குறைவான டிரா அழைப்புகள்), காட்சியில் போதுமான மறைமுக வாய்ப்புகள் இருக்கும் வரை செயல்திறன் அதிகரிக்கும். இதன் பொருள் உட்புற காட்சிகளில் மறைவது மிகவும் பயனுள்ளதாக இருக்கும், முன்னுரிமை குறைவான பெரிய அறைகளுக்கு பதிலாக பல சிறிய அறைகளுடன். இதை இணைக்கவும்: ref: `doc_mesh_lod` மற்றும்: Ref:` doc_visibility_ranges` செயல்திறன் ஆதாயங்களை மேலும் மேம்படுத்த.
uk: Оскільки рушій має менше роботи (менше вершин для візуалізації та менше викликів малювання), продуктивність зростатиме, доки в сцені є достатньо можливостей відсічення оклюзії. Це означає, що видалення оклюзії є найефективнішим у сценах у приміщенні, бажано з великою кількістю менших кімнат замість меншої кількості великих кімнат. Поєднайте це з :ref:`doc_mesh_lod` і :ref:`doc_visibility_ranges`, щоб ще більше покращити продуктивність.

source: When using the Forward+ renderer, the engine already performs a *depth prepass*. This consists in rendering a depth-only version of the scene before rendering the scene's actual materials. This is used to ensure each opaque pixel is only shaded once, reducing the cost of overdraw significantly.
ru: При использовании рендерера Forward+ движок уже выполняет *depth prepass*. Он заключается в рендеринге версии сцены только с глубиной перед рендерингом фактических материалов сцены. Это используется для того, чтобы гарантировать, что каждый непрозрачный пиксель затеняется только один раз, что значительно снижает стоимость перерисовки.
uk: Під час використання засобу візуалізації Forward+ механізм уже виконує *попереднє проходження глибини*. Це полягає у відтворенні лише глибинної версії сцени перед відтворенням фактичних матеріалів сцени. Це використовується для того, щоб кожен непрозорий піксель був затінений лише один раз, що значно зменшує вартість перерисовки.

source: The greatest performance benefits can be observed when using the Mobile renderer, as it does not feature a depth prepass for performance reasons. As a result, occlusion culling will actively decrease shading overdraw with that renderer.
ru: Наибольшие преимущества производительности можно наблюдать при использовании мобильного рендерера, поскольку он не имеет предварительного прохода глубины по соображениям производительности. В результате, occlusion culling будет активно уменьшать перерисовку затенения с этим рендерером.
uk: Найбільші переваги в продуктивності можна спостерігати при використанні мобільного рендерера, оскільки він не має попереднього проходу глибини з міркувань продуктивності. Як наслідок, видалення оклюзії активно зменшуватиме надмірне затінення за допомогою цього рендерера.

source: Nonetheless, even when using a depth prepass, there is still a noticeable benefit to occlusion culling in complex 3D scenes. However, in scenes with few occlusion culling opportunities, occlusion culling may not be worth the added setup and CPU usage.
ga: Mar sin féin, fiú nuair a bhíonn réamh-mheas doimhneachta á úsáid agat, tá buntáiste suntasach ann fós le cur isteach i radhairc chasta 3D. Mar sin féin, i radhairc nach bhfuil mórán deiseanna díothaithe oclúcháin acu, b'fhéidir nach fiú an socrú breise agus úsáid LAP a chur ar dhíothú oclúsithe.
ru: Тем не менее, даже при использовании предварительного прохода глубины, все еще есть заметное преимущество occlusion culling в сложных 3D-сценах. Однако в сценах с небольшим количеством возможностей occlusion culling occlusion culling может не стоить дополнительных настроек и использования CPU.
ta: ஆயினும்கூட, ஆழமான ப்ரெபசைப் பயன்படுத்தும் போது கூட, சிக்கலான 3D காட்சிகளில் மறைவதற்கு இன்னும் குறிப்பிடத்தக்க நன்மை இருக்கிறது. இருப்பினும், சில மறைமுகமான வாய்ப்புகளைக் கொண்ட காட்சிகளில், மறைவைக் குறைப்பது கூடுதல் அமைப்பு மற்றும் சிபியு பயன்பாட்டிற்கு மதிப்புள்ளதாக இருக்காது.
uk: Тим не менш, навіть при використанні попереднього проходу глибини, є помітна перевага відсікання оклюзії в складних 3D-сценах. Однак у сценах з невеликою кількістю можливостей відсічення оклюзії відсічення оклюзії може не вартувати додаткових налаштувань і використання ЦП.

source: How occlusion culling works in Godot
ga: Conas a oibríonn culling occlusion i Godot
it: Come l'occlusion culling funziona in Godot
ru: Как работает Окклюзивное обрезание в Godot
ta: கோடோட்டில் மறைவது எவ்வாறு செயல்படுகிறது
uk: Як працює вибракування оклюзії в Godot

source: "occluder" refers to the shape blocking the view, while "occludee" refers to the object being hidden.
ru: "occluder" относится к форме, блокирующей обзор, в то время как "occludee" относится к скрываемому объекту.
uk: "окклюдер" відноситься до форми, яка блокує огляд, тоді як "окклюдер" стосується прихованого об'єкта.

source: In Godot, occlusion culling works by rasterizing the scene's occluder geometry to a low-resolution buffer on the CPU. This is done using the software raytracing library `Embree <https://github.com/embree/embree>`__.
ga: In Godot, oibríonn marú folachta trí chéimseata occluder an radharc a rasterizing go maolán ísealtaifigh ar an LAP. Déantar é seo trí úsáid a bhaint as an leabharlann raytracing bogearraí `Embree <https://github.com/embree/embree>`__.
ru: В Godot, occlusion culling работает путем растеризации геометрии occluder сцены в буфер низкого разрешения на CPU. Это делается с помощью библиотеки программной трассировки лучей `Embree <https://github.com/embree/embree>`__.
ta: கோடோட்டில், சிபியு இல் குறைந்த தெளிவுத்திறன் கொண்ட இடையகத்திற்கு காட்சியின் மறைமுக வடிவவியலை ராச்டர்சிங் செய்வதன் மூலம் மறைமுகம் செயல்படுகிறது. `எம்ப்ரீ <https://github.com/embree/embree> __ __.
uk: У Godot відбір оклюзії працює шляхом растеризації геометрії оклюдера сцени до буфера низької роздільної здатності на ЦП. Це робиться за допомогою програмної бібліотеки трасування променів `Embree <https://github.com/embree/embree>`__.

source: The engine then uses this low-resolution buffer to test the occludee's :abbr:`AABB (Axis-Aligned Bounding Box)` against the occluder shapes. The occludee's :abbr:`AABB (Axis-Aligned Bounding Box)` must be *fully occluded* by the occluder shape to be culled.
ga: Ansin úsáideann an t-inneall an maolán ísealtaifigh seo chun an occlude a thástáil: abbr: `AABB (Bosca Teorainneacha Aisínithe) `i gcoinne na cruthanna occluder. Caithfear an occlude: abbr: `AABB (Bosca Teorainneacha Aisínithe) `a bheith caite go hiomlán* ag an gcruth occlúdaithe atá le caoileadh.
ru: Затем движок использует этот буфер низкого разрешения для проверки :abbr:`AABB (Axis-Aligned Bounding Box)` occludee против форм occluder. :abbr:`AABB (Axis-Aligned Bounding Box)` occludee должен быть *полностью закрыт* формой occluder, чтобы быть отсеченным.
ta: இயந்திரம் இந்த குறைந்த-தெளிவுத்திறன் இடையகத்தைப் பயன்படுத்தி மறைவை சோதிக்க: abbr: `AABB (அச்சு-சீரமைக்கப்பட்ட எல்லை பெட்டி)` ஆக்லூடர் வடிவங்களுக்கு எதிராக. ஆக்லூடிச்: ஏபிபிஆர்: `ஏஏபி (அச்சு-சீரமைக்கப்பட்ட எல்லை பெட்டி)` * முழுமையாக மறைக்கப்பட வேண்டும் * ஆக்லுடர் வடிவத்தால் குறைக்கப்பட வேண்டும்.
uk: Далі механізм використовує цей буфер із низькою роздільною здатністю, щоб перевірити :abbr:`AABB (Axis-Aligned Bounding Box)` оклюдера щодо форм оклюдера. :abbr:`AABB (Axis-Aligned Bounding Box)` оклюдії має бути *повністю закрита* формою оклюдера, яку потрібно вилучити.

source: As a result, smaller objects are more likely to be effectively culled than larger objects. Larger occluders (such as walls) also tend to be much more effective than smaller ones (such as decoration props).
ga: Mar thoradh air sin, is dóichí go ndéanfar rudaí níos lú a dhíothú go héifeachtach ná rudaí níos mó. Is gnách go mbíonn occluders níos mó (mar shampla ballaí) i bhfad níos éifeachtaí ná cinn níos lú (mar shampla próps maisiúcháin).
ru: В результате, более мелкие объекты с большей вероятностью будут эффективно отбракованы, чем более крупные. Более крупные окклюдеры (например, стены) также, как правило, гораздо более эффективны, чем более мелкие (например, декоративный реквизит).
ta: இதன் விளைவாக, பெரிய பொருள்களை விட சிறிய பொருள்கள் திறம்பட குறைக்கப்படுவதற்கான வாய்ப்புகள் அதிகம். பெரிய மறைவாளர்கள் (சுவர்கள் போன்றவை) சிறியவற்றை விட (அலங்கார முட்டுகள் போன்றவை) மிகவும் பயனுள்ளதாக இருக்கும்.
uk: Як наслідок, менші об’єкти з більшою ймовірністю будуть ефективно відбраковані, ніж більші об’єкти. Більші оклюдери (наприклад, стіни) також, як правило, набагато ефективніші, ніж менші (наприклад, декоративні опори).

source: Setting up occlusion culling
ga: Cailliú oclúcháin a chur ar bun
it: Configurazione dell'occlusion culling
ru: Настройка Окклюзивного обрезания
ta: மறைவை அமைத்தல்
uk: Налаштування вибракування оклюзії

source: The first step to using occlusion culling is to enable the **Rendering > **Occlusion Culling > Use Occlusion Culling** project setting. (Make sure the **Advanced** toggle is enabled in the Project Settings dialog to be able to see it.)
ga: Is é an chéad chéim chun marú occlusion a úsáid ná socrú tionscadail **Rindeáil > **Occlusion Marú > Úsáid Occlusion Maraithe** a chumasú. (Bí cinnte go bhfuil an scorán **Ardleibhéal** cumasaithe sa dialóg Socruithe an Tionscadail chun é a fheiceáil.)
ru: Первым шагом к использованию occlusion culling является включение настройки проекта **Rendering > **Occlusion Culling > Use Occlusion Culling**. (Убедитесь, что переключатель **Advanced** включен в диалоговом окне Project Settings, чтобы его можно было увидеть.)
ta: ** ரெண்டரிங்> ** மறைவு கல்லிங்> ஆக்ச்லூசன் கல்லிங் ** திட்ட அமைப்பைப் பயன்படுத்துவதை இயக்குவதே மறைமுகக் குறைப்பைப் பயன்படுத்துவதற்கான முதல் படி. (திட்ட அமைப்புகள் உரையாடலில் ** மேம்பட்ட ** மாற்று இயக்கப்பட்டிருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.)
uk: Першим кроком до використання відсіку оклюзії є ввімкнення параметра проекту **Відтворення > **Відсікання перегородок > Використовувати відсіювання перекриття**. (Переконайтеся, що перемикач **Додатково** увімкнено в діалоговому вікні налаштувань проекту, щоб мати змогу його побачити.)

source: This project setting applies immediately, so you don't need to restart the editor.
ga: Tá feidhm ag an socrú tionscadail seo láithreach, mar sin ní gá duit an t-eagarthóir a atosú.
ru: Эта настройка проекта применяется немедленно, поэтому вам не нужно перезапускать редактор.
ta: இந்த திட்ட அமைப்பு உடனடியாக பொருந்தும், எனவே நீங்கள் எடிட்டரை மறுதொடக்கம் செய்ய தேவையில்லை.
uk: Цей параметр проекту застосовується негайно, тому вам не потрібно перезапускати редактор.

source: After enabling the project setting, you still need to create some occluders. For performance reasons, the engine doesn't automatically use all visible geometry as a basis for occlusion culling. Instead, the engine requires a simplified representation of the scene with only static objects to be baked.
ga: Tar éis duit socrú an tionscadail a chumasú, ní mór duit roinnt occluders a chruthú fós. Ar chúiseanna feidhmíochta, ní úsáideann an t-inneall gach geoiméadacht infheicthe go huathoibríoch mar bhunús le haghaidh caoileadh occlusion. Ina áit sin, éilíonn an t-inneall léiriú simplithe ar an radharc gan ach rudaí statacha a bhácáil.
ru: После включения настройки проекта вам все еще нужно создать несколько окклюдеров. По соображениям производительности движок не использует автоматически всю видимую геометрию в качестве основы для occlusion culling. Вместо этого движок требует упрощенного представления сцены, в которой будут запекаться только статические объекты.
ta: திட்ட அமைப்பை இயக்கிய பின், நீங்கள் இன்னும் சில மறைமுகங்களை உருவாக்க வேண்டும். செயல்திறன் காரணங்களுக்காக, இயந்திரம் தானாகவே காணக்கூடிய அனைத்து வடிவவியலையும் மறைவுக்கு அடிப்படையாகப் பயன்படுத்தாது. அதற்கு பதிலாக, இயந்திரத்திற்கு காட்சியின் எளிமைப்படுத்தப்பட்ட பிரதிநிதித்துவம் தேவைப்படுகிறது.
uk: Після ввімкнення налаштувань проекту вам все одно потрібно створити кілька оклюдерів. З міркувань продуктивності механізм автоматично не використовує всю видиму геометрію як основу для вилучення оклюзії. Натомість двигун вимагає спрощеного представлення сцени лише зі статичними об’єктами, які потрібно запікати.

source: There are two ways to set up occluders in a scene:
ga: Tá dhá bhealach ann chun occluders a chur ar bun i radharc:
it: Ci sono due modi per configurare gli occlusori in una scena:
ru: Существует два способа установки окклюдеров в сцене:
ta: ஒரு காட்சியில் மறைவாளர்களை அமைக்க இரண்டு வழிகள் உள்ளன:
uk: Існує два способи налаштування оклюдерів у сцені:

source: Automatically baking occluders (recommended)
ga: Osclúdaithe bácála go huathoibríoch (moltar)
ru: Автоматическое запекание окклюдеров (рекомендуется)
ta: தானாக பேக்கிங் ஆக்லூடர்கள் (பரிந்துரைக்கப்படுகிறது)
uk: Автоматичне запікання оклюдерів (рекомендовано)

source: Only MeshInstance3D nodes are currently taken into account in the *occluder* baking process. MultiMeshInstance3D, GPUParticles3D, CPUParticles3D and CSG nodes are **not** taken into account when baking occluders. If you wish those to be treated as occluders, you have to manually create occluder shapes that (roughly) match their geometry.
ga: Ní chuirtear ach nóid MeshInstance3D san áireamh faoi láthair sa phróiseas bácálaí* occluder*. Ní chuirtear nóid MultimeShinstance3D, GPUParticles3D, CPUParticles3D agus CSG** san áireamh agus occluders á bácáil. Más mian leat go ndéileálfaí leo siúd mar occluders, caithfidh tú cruthanna occluder a chruthú de láimh a mheaitseálann (go garbh) lena gcéiméadracht.
ru: В процессе запекания *occluder* в настоящее время учитываются только узлы MeshInstance3D. Узлы MultiMeshInstance3D, GPUParticles3D, CPUParticles3D и CSG **не** учитываются при запекании окклюдеров. Если вы хотите, чтобы они рассматривались как окклюдеры, вам придется вручную создать формы окклюдеров, которые (примерно) соответствуют их геометрии.
ta: Meshinstance3d முனைகள் மட்டுமே தற்போது * ஆக்லூடர் * பேக்கிங் செயல்பாட்டில் கணக்கில் எடுத்துக்கொள்ளப்படுகின்றன. மல்டிமெசின்ச்டன்ச் 3 டி, gpuparticles3d, cpuparticles3d மற்றும் csg முனைகள் ** அல்ல ** பேக்கிங் செய்யும் போது கணக்கில் எடுத்துக்கொள்ளப்படுகின்றன. நபர்களாக கருதப்பட வேண்டும் என்று நீங்கள் விரும்பினால், அவர்களின் வடிவவியலுடன் (தோராயமாக) பொருந்தக்கூடிய மறைமுக வடிவங்களை நீங்கள் கைமுறையாக உருவாக்க வேண்டும்.
uk: Лише вузли MeshInstance3D наразі враховуються в процесі запікання *occluder*. Вузли MultiMeshInstance3D, GPUParticles3D, CPUParticles3D і CSG **не** враховуються під час запікання оклюдерів. Якщо ви бажаєте, щоб їх розглядали як оклюдери, вам потрібно вручну створити форми оклюдерів, які (приблизно) відповідають їхній геометрії.
