Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/spring_arm.po
Languages: ru, ta, uk, zh_cn, zh_hant

source: Third-person camera with spring arm
ru: Камера от третьего лица с пружинным рычагом
ta: வசந்த கை கொண்ட மூன்றாம் நபர் கேமரா
uk: Камера від третьої особи з пружинним кронштейном
zh_cn: 带弹簧臂的第三人称相机
zh_hant: 帶有彈簧臂的第三人稱攝影機

source: Introduction
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_cn: 前言
zh_hant: 前言

source: 3D games will often have a third-person camera that follows and rotates around something such as a player character or a vehicle.
ru: В 3D-играх часто используется камера от третьего лица, которая следует за персонажем игрока или транспортным средством и вращается вокруг него.
ta: 3 டி கேம்களில் பெரும்பாலும் மூன்றாம் நபர் கேமரா இருக்கும், அது பிளேயர் கேரக்டர் அல்லது வண்டி போன்றவற்றைப் பின்தொடர்ந்து சுழலும்.
uk: Тривимірні ігри часто мають камеру від третьої особи, яка слідкує за чимось, наприклад персонажем гравця чи транспортним засобом, і обертається навколо них.
zh_cn: 3D 游戏经常会用到第三人称相机，相机会跟随玩家角色、车辆等物体，还能够围绕目标旋转。
zh_hant: 在 3D 遊戲中，常見的第三人稱攝影機會跟隨並繞著玩家角色或載具等物件旋轉。

source: In Godot, this can be done by setting a :ref:`Camera3D <class_Camera3D>` as a child of a node. However, if you try this without any extra steps, you'll notice that the camera clips through geometry and hides the scene.
ru: В Godot это можно сделать, установив :ref:`Camera3D <class_Camera3D>` как дочерний элемент узла. Однако, если вы попробуете сделать это без дополнительных шагов, вы заметите, что камера обрезает геометрию и скрывает сцену.
ta: கோடோட்டில், இதை அமைப்பதன் மூலம் இதைச் செய்யலாம்: ref: `கேமரா 3 டி <class_camera3d>` ஒரு முனையின் குழந்தையாக. இருப்பினும், கூடுதல் படிகள் இல்லாமல் நீங்கள் இதை முயற்சித்தால், கேமரா வடிவியல் மூலம் கிளிப் செய்து காட்சியை மறைப்பதை நீங்கள் கவனிப்பீர்கள்.
uk: У Godot це можна зробити, встановивши :ref:`Camera3D <class_Camera3D>` як дочірнього вузла. Однак, якщо ви спробуєте це без будь-яких додаткових кроків, ви помітите, що камера прорізає геометрію та приховує сцену.
zh_cn: 在 Godot 中将 :ref:`Camera3D <class_Camera3D>` 设置为某个节点的子节点就可以实现这种相机。不过如果直接这样做、不进行额外处理，你就会发现相机会穿过几何体，导致场景隐藏。
zh_hant: 在 Godot 中，可以將 :ref:`Camera3D <class_Camera3D>` 設為某個節點的子節點來達成這個效果。不過，如果只這樣做，攝影機會穿透場景幾何並導致畫面消失。

source: This is where the :ref:`SpringArm3D <class_SpringArm3D>` node comes in.
ru: Вот тут-то и пригодится узел :ref:`SpringArm3D <class_SpringArm3D>`.
ta: இங்குதான்: ref: `springarm3d <class_springarm3d>` முனை வருகிறது.
uk: Тут з’являється вузол :ref:`SpringArm3D <class_SpringArm3D>`.
zh_cn: 这就需要用到弹簧臂节点 :ref:`SpringArm3D <class_SpringArm3D>` 了。
zh_hant: 這時就可以使用 :ref:`SpringArm3D <class_SpringArm3D>` 節點來解決這個問題。

source: What is a spring arm?
ru: Что такое пружинный рычаг?
ta: வசந்த கை என்றால் என்ன?
uk: Що таке пружинна рука?
zh_cn: 弹簧臂是什么？
zh_hant: 什麼是彈簧臂？

source: A spring arm has two main components that affect its behavior.
ru: Пружинный рычаг состоит из двух основных компонентов, которые влияют на его поведение.
ta: ஒரு வசந்த கை அதன் நடத்தையை பாதிக்கும் இரண்டு முக்கிய கூறுகளைக் கொண்டுள்ளது.
uk: Пружинний важіль складається з двох основних компонентів, які впливають на його поведінку.
zh_cn: 弹簧臂有两个主要组件，都会影响其行为。
zh_hant: 彈簧臂有兩個主要組件會影響其行為。

source: The "length" of the spring arm is how far from its global position to check for collisions:
ru: «Длина» пружинного рычага — это расстояние от его глобального положения, на котором необходимо проверять наличие столкновений:
ta: வசந்தக் கையின் "நீளம்" என்பது மோதல்களை சரிபார்க்க அதன் உலகளாவிய நிலையில் இருந்து எவ்வளவு தூரம்:
uk: «Довжина» пружинного плеча — це те, наскільки далеко від його загального положення, щоб перевірити на наявність зіткнень:
zh_cn: 弹簧臂的“长度”是指从弹簧臂的全局位置开始检测碰撞的距离：
zh_hant: 彈簧臂的「長度」是用來檢查碰撞時，從其全域位置往外偵測的距離：

source: The "shape" of the spring arm is what it uses to check for collisions. The spring arm will "sweep" this shape from its origin out towards its length.
ru: «Форма» пружинного рычага — это то, что он использует для проверки столкновений. Пружинный рычаг «выметает» эту форму от ее начала по направлению к ее длине.
ta: வசந்தக் கையின் "வடிவம்" என்பது மோதல்களைச் சரிபார்க்க இது பயன்படுத்துகிறது. வசந்த கை இந்த வடிவத்தை அதன் தோற்றத்திலிருந்து அதன் நீளத்தை நோக்கி "துடைக்கும்".
uk: «Форма» пружинного важеля використовується для перевірки зіткнень. Пружинне плече «змітає» цю форму від її початку до її довжини.
zh_cn: 弹簧臂的“形状”则是用于碰撞检测的形状。弹簧臂会用这个形状从它的原点一路“扫”到长度的位置。
zh_hant: 彈簧臂的「形狀」則是用來檢查碰撞的碰撞體。彈簧臂會將這個形狀從其原點往長度方向掃描偵測。

source: The spring arm tries to keep all of its children at the end of its length. When the shape collides with something, the children are instead placed at or near that collision point:
ru: Пружинный рычаг пытается удержать всех своих потомков в конце своей длины. Когда форма сталкивается с чем-то, потомки вместо этого размещаются в точке столкновения или около нее:
ta: வசந்த கை அதன் குழந்தைகள் அனைவரையும் அதன் நீளத்தின் முடிவில் வைத்திருக்க முயற்சிக்கிறது. வடிவம் ஏதோவொன்றோடு மோதுகையில், அதற்கு பதிலாக குழந்தைகள் அந்த மோதல் புள்ளியில் அல்லது அதற்கு அருகில் வைக்கப்படுகிறார்கள்:
uk: Пружинне плече намагається утримати всіх своїх дітей на кінці своєї довжини. Коли фігура стикається з чимось, діти розміщуються в цій точці зіткнення або поблизу неї:
zh_cn: 弹簧臂会尝试将所有子节点保持在其长度的末端。当形状与其他物体发生碰撞时，就会将子节点放置在碰撞点处或其附近：
zh_hant: 彈簧臂會嘗試將它的所有子節點維持在長度的末端。如果碰撞形狀偵測到碰撞，子節點就會被放置在碰撞點上或附近：

source: Spring arm with a camera
ru: Пружинный рычаг с камерой
ta: கேமராவுடன் வசந்த கை
uk: Пружинне плече з камерою
zh_cn: 带相机的弹簧臂
zh_hant: 彈簧臂搭配攝影機

source: When a camera is placed as a child of a spring arm, a pyramid representing the camera will be used as the shape.
ru: Если камера размещена как дочерний элемент пружинного рычага, в качестве формы будет использоваться пирамида, представляющая камеру.
ta: ஒரு கேமரா ஒரு வசந்தக் கையின் குழந்தையாக வைக்கப்படும்போது, கேமராவைக் குறிக்கும் ஒரு பிரமிட் வடிவமாகப் பயன்படுத்தப்படும்.
uk: Коли камеру розміщують як дочірню частину пружинного плеча, піраміда, що представляє камеру, використовуватиметься як форма.
zh_hant: 當攝影機作為彈簧臂的子節點時，會使用一個代表攝影機的金字塔形狀作為碰撞形狀。

source: This pyramid represents the **near plane** of the camera:
ru: Эта пирамида представляет собой **near plane (ближнюю плоскость)** камеры:
ta: இந்த பிரமிடு கேமராவின் ** க்கு அருகில் ** ஐ குறிக்கிறது:
uk: Ця піраміда представляє **ближню площину** камери:
zh_hant: 這個金字塔代表攝影機的**近裁剪面**：

source: If the spring arm is given a specific shape, then that shape will **always** be used.
ru: Если пружинному рычагу придать определенную форму, то эта форма будет использоваться **всегда**.
ta: வசந்த கைக்கு ஒரு குறிப்பிட்ட வடிவம் வழங்கப்பட்டால், அந்த வடிவம் ** எப்போதும் ** பயன்படுத்தப்படும்.
uk: Якщо пружинному важелю надати певну форму, то ця форма використовуватиметься **завжди**.
zh_cn: 如果给弹簧臂指定了特定形状，那么该形状将**始终**被使用。
zh_hant: 如果彈簧臂已設定特定的碰撞形狀，就會**永遠**使用該形狀。

source: The camera's shape is only used if the camera is a **direct child** of the spring arm.
ru: Форма камеры используется только в том случае, если камера является **прямым потомком** пружинного рычага.
ta: கேமரா வசந்தக் கையின் ** நேரடி குழந்தை ** என்றால் மட்டுமே கேமராவின் வடிவம் பயன்படுத்தப்படுகிறது.
uk: Форма камери використовується, лише якщо камера є **прямим потомком** пружинного важеля.
zh_hant: 攝影機的形狀只有在攝影機是彈簧臂的**直接子節點**時才會被使用。

source: If no shape is provided and the camera is not a direct child, the spring arm will fall back to using a ray cast which is inaccurate for camera collisions and not recommended.
ru: Если форма не указана и камера не является прямым потомком, пружинный рычаг вернется к использованию луча, что неточно для столкновений камер и не рекомендуется.
ta: எந்த வடிவமும் வழங்கப்படவில்லை மற்றும் கேமரா ஒரு நேரடி குழந்தை அல்ல என்றால், கேமரா மோதல்களுக்கு தவறானது மற்றும் பரிந்துரைக்கப்படாத ஒரு ரே நடிகரைப் பயன்படுத்துவதற்கு வசந்த கை மீண்டும் விழும்.
uk: Якщо форма не надається, а камера не є прямим дочірнім елементом, пружинний важіль повернеться до використання відкидання променів, що є неточним для зіткнень камери та не рекомендується.
zh_cn: 如果没有提供形状并且摄像机不是直接子节点，弹簧臂将回退使用射线检测，这对于摄像机碰撞来说不准确，因此不推荐使用。
zh_hant: 如果沒有指定任何形狀且攝影機也不是直接子節點，彈簧臂會退回使用射線檢測（Ray Cast），這對攝影機碰撞而言不精確，並不推薦使用。

source: Every physics process frame, the spring arm will perform a motion cast to check if anything is collided with:
ru: В каждом кадре физического процесса пружинный рычаг будет выполнять приведение движения, чтобы проверить, сталкивается ли с чем-либо:
ta: ஒவ்வொரு இயற்பியல் செயல்முறை சட்டகமும், வசந்த கை ஒரு மோசன் காச்ட்டை ஏதாவது மோதியதா என்பதைச் சரிபார்க்க ஒரு மோசன் காச்ட் செய்யும்:
uk: У кожному кадрі фізичного процесу пружинна рука виконує рух, щоб перевірити, чи не зіткнулося з чимось:
zh_cn: 每个物理处理帧中，弹簧臂都会执行一次运动投射，以检查是否有物体发生碰撞：
zh_hant: 每個物理處理循環，彈簧臂都會進行一次移動碰撞檢查以偵測是否有碰撞發生：

source: When the shape hits something, the camera will be placed at or near the collision point:
ru: Когда фигура сталкивается с чем-либо, камера будет помещена в точку столкновения или рядом с ней:
ta: வடிவம் எதையாவது தாக்கும் போது, மோதல் புள்ளியில் அல்லது அதற்கு அருகில் கேமரா வைக்கப்படும்:
uk: Коли фігура стикається з чимось, камера розміщується в точці зіткнення або поблизу неї:
zh_cn: 当形状碰到物体时，摄像机将被放置在碰撞点或附近：
zh_hant: 當碰撞形狀撞到物件時，攝影機會被放置在碰撞點或其附近：

source: Setting up the spring arm and camera
ru: Установка пружинного рычага и камеры
ta: வசந்த கை மற்றும் கேமராவை அமைத்தல்
uk: Налаштування пружинного кронштейна та камери
zh_cn: 设置弹簧臂和相机
zh_hant: 設定彈簧臂與攝影機

source: Let's add a spring arm camera setup to the platformer demo.
ru: Давайте добавим в демо-версию платформера камеру с пружинным рычагом.
ta: இயங்குதள டெமோவில் ச்பிரிங் கை கேமரா அமைப்பைச் சேர்ப்போம்.
uk: Давайте додамо налаштування камери з пружинною рукою до демонстрації платформера.
zh_cn: 让我们在平台跳跃演示中添加弹簧臂和相机吧。
zh_hant: 我們來在平台遊戲範例中加上彈簧臂攝影機。

source: You can download the Platformer 3D demo on `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ or using the `Asset Library <https://godotengine.org/asset-library/asset/2748>`_.
ru: Вы можете загрузить демоверсию Platformer 3D на `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ или с помощью `Asset Library <https://godotengine.org/asset-library/asset/2748>`_.
ta: நீங்கள் இயங்குதள 3D டெமோவை `github <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer> _ _ _` சொத்து நூலகம் <https://godotengine.org/asset/asset/asset/asset/asset/asset/asset/asset/asset/asset/asset/asset/asset/asset/asset/asset/asset/ASSET ஐப் பயன்படுத்தலாம்.
uk: Ви можете завантажити демо-версію Platformer 3D на `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ або за допомогою `Бібліотеки ресурсів <https://godotengine.org/asset-library/asset/2748>`_.
zh_cn: 你可以在 `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ 上下载 Platformer 3D 演示，也可以使用\ `资产库 <https://godotengine.org/asset-library/asset/2748>`_\ 。
zh_hant: 你可以從 `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ 或 `資源庫 <https://godotengine.org/asset-library/asset/2748>`_ 下載 Platformer 3D 範例專案。

source: In general, for a third-person camera setup, you will have three nodes as children of the node that you're following:
ru: В общем случае для настройки камеры от третьего лица у вас будет три узла в качестве дочерних узлов узла, за которым вы следите:
ta: பொதுவாக, மூன்றாம் நபர் கேமரா அமைப்பிற்கு, நீங்கள் பின்பற்றும் முனையின் குழந்தைகளாக மூன்று முனைகள் இருக்கும்:
uk: Загалом, для налаштування камери від третьої особи ви матимете три дочірні вузли вузла, за яким ви стежите:
zh_hant: 通常在製作第三人稱攝影機時，會將三個節點設為玩家（或其他要跟隨物件）的子節點：

source: `Node3D` (the "pivot point" for the camera)
ru: `Node3D` («точка опоры» для камеры)
ta: `Node3d` (கேமராவிற்கான" பிவோட் புள்ளி ")
uk: `Node3D` ("точка опори" для камери)
zh_cn: `Node3D`\ （相机的“轴心点”）
zh_hant: `Node3D` （攝影機的「旋轉樞紐點」）

source: `Camera3D`
ta: `கேமரா 3 டி`

source: Open the ``player/player.tscn`` scene. Set these up as children of our player and give them unique names so we can find them in our script. **Make sure to delete the existing camera node!**
ru: Откройте сцену ``player/player.tscn``. Настройте их как дочерние элементы нашего игрока и дайте им уникальные имена, чтобы мы могли найти их в нашем скрипте. **Обязательно удалите существующий узел камеры!**
ta: `` பிளேயர்/பிளேயர்..டி.எச்.சி.என்`` காட்சியைத் திறக்கவும். இவற்றை எங்கள் வீரரின் குழந்தைகளாக அமைத்து, அவர்களுக்கு தனித்துவமான பெயர்களைக் கொடுங்கள், இதனால் அவற்றை எங்கள் ச்கிரிப்டில் காணலாம். ** இருக்கும் கேமரா முனையை நீக்குவதை உறுதிசெய்க! **
uk: Відкрийте сцену ``player/player.tscn``. Встановіть їх як дітей нашого гравця та дайте їм унікальні імена, щоб ми могли знайти їх у нашому сценарії. **Обов’язково видаліть існуючий вузол камери!**
zh_cn: 打开 ``player/player.tscn`` 场景。将这些节点设置为玩家节点的子节点，并为它们设置唯一的名称，以便我们可以在脚本中找到它们。**请确保删除现有的摄像机节点！**
zh_hant: 打開 ``player/player.tscn`` 場景。將這三個節點設為玩家的子節點，並給它們設定獨特的名稱，好讓我們在腳本中能正確取得。**記得要刪除原本的攝影機節點！**

source: Let's move the pivot point up by ``2`` on the Y-axis so that it's not on the ground:
ru: Давайте переместим точку опоры на ``2`` вверх по оси Y, чтобы она не находилась на земле:
ta: பிவோட் புள்ளியை `` 2`` மூலம் y- அச்சில் நகர்த்துவோம், அதனால் அது தரையில் இல்லை:
uk: Давайте перемістимо точку опори вгору на «2» по осі Y, щоб вона не була на землі:
zh_hant: 把旋轉樞紐點在 Y 軸上往上移動 ``2``，避免攝影機位於地面上：

source: Give the spring arm a length of ``3`` so that it is placed behind the character:
ru: Придайте пружинному рычагу длину ``3``, чтобы он располагался позади персонажа:
ta: வசந்த கைக்கு `` 3`` நீளத்தை கொடுங்கள், அதனால் அது பாத்திரத்தின் பின்னால் வைக்கப்படுகிறது:
uk: Надайте пружинному плечу довжину ``3`` так, щоб воно було розташоване за символом:
zh_hant: 將彈簧臂長度設為 ``3``，讓攝影機位於角色後方：

source: Leave the **Shape** of the spring arm as ``<empty>``. This way, it will use the camera's pyramid shape.
ru: Оставьте **Shape (Форму)** пружинного рычага как ``<empty>``. Таким образом, он будет использовать форму пирамиды камеры.
ta: வசந்தக் கையின் ** வடிவத்தை ** `` <alagion> `` ஆக விடுங்கள். இந்த வழியில், இது கேமராவின் பிரமிட் வடிவத்தைப் பயன்படுத்தும்.
uk: Залиште **Форму** пружинного плеча як ``<empty>``. Таким чином, він використовуватиме форму піраміди камери.
zh_cn: 将弹簧臂的 **Shape** 保持为 ``<空>``\ 。这样就会使用相机的视锥形状。
zh_hant: 彈簧臂的 **Shape** （形狀）欄位保持為 ``<empty>`` ，這樣就會使用攝影機的金字塔形狀作為碰撞體。

source: If you want, you can also try other shapes - a sphere is a common choice since it slides smoothly along edges.
ru: При желании вы можете попробовать и другие формы — сфера является распространенным выбором, поскольку она плавно скользит по краям.
ta: நீங்கள் விரும்பினால், நீங்கள் மற்ற வடிவங்களையும் முயற்சி செய்யலாம் - ஒரு கோளம் ஒரு பொதுவான தேர்வாகும், ஏனெனில் அது விளிம்புகளுடன் சீராக சறுக்குகிறது.
uk: Якщо ви хочете, ви також можете спробувати інші форми - сфера є звичайним вибором, оскільки вона плавно ковзає по краях.
zh_cn: 如果你愿意，也可以尝试其他形状——球体是一个常见的选择，因为它可以沿着边缘平滑滑动。
zh_hant: 你也可以嘗試其他形狀——例如球體，因為它能更平滑地沿著邊緣滑動，是常見的選擇。

source: Update the top of ``player/player.gd`` to grab the camera and the pivot points by their unique names:
ru: Обновите верхнюю часть ``player/player.gd``, чтобы получить камеру и точки поворота по их уникальным именам:
ta: கேமராவைப் பிடிக்க `` பிளேயர்/பிளேயர்.
uk: Оновіть верхню частину ``player/player.gd``, щоб отримати камеру та опорні точки за їхніми унікальними назвами:
zh_cn: 更新 ``player/player.gd`` 的顶部代码，通过其唯一名称获取相机和枢轴点：
zh_hant: 在 ``player/player.gd`` 檔案開頭，透過獨特的名稱取得攝影機與樞紐點節點：

source: player/player.gd
ta: பிளேயர்/பிளேயர் சி.டி.

source: Add an ``_unhandled_input`` function to check for camera movement and then rotate the pivot point accordingly:
ru: Добавьте функцию ``_unhandled_input`` для проверки движения камеры, а затем поверните точку поворота соответствующим образом:
ta: கேமரா இயக்கத்தை சரிபார்க்க `` _unhandled_input`` செயல்பாட்டைச் சேர்த்து, அதற்கேற்ப பிவோட் புள்ளியை சுழற்றுங்கள்:
uk: Додайте функцію ``_unhandled_input``, щоб перевірити рух камери, а потім відповідно повернути точку повороту:
zh_cn: 添加一个 ``_unhandled_input`` 函数来检测相机移动，然后相应地旋转轴心：
zh_hant: 新增 ``_unhandled_input`` 函式來檢查攝影機移動輸入，並根據輸入旋轉樞紐點：

source: By rotating the pivot point, the spring arm will also be rotated and it will change where the camera is positioned. Run the game and notice that mouse movement now rotates the camera around the character. If the camera moves into a wall, it collides with it.
ru: При вращении опорной точки пружинный рычаг также будет вращаться и он изменит положение камеры. Запустите игру и обратите внимание, что движение мыши теперь вращает камеру вокруг персонажа. Если камера движется в стену, она сталкивается с ней.
ta: பிவோட் புள்ளியை சுழற்றுவதன் மூலம், வசந்த கை சுழலும், மேலும் கேமரா நிலைநிறுத்தப்படும் இடத்தில் அது மாறும். விளையாட்டை இயக்கி, சுட்டி இயக்கம் இப்போது கதாபாத்திரத்தை சுற்றி கேமராவை சுழற்றுகிறது என்பதைக் கவனியுங்கள். கேமரா ஒரு சுவரில் நகர்ந்தால், அது அதனுடன் மோதுகிறது.
uk: Обертаючи точку повороту, пружинний важіль також повертатиметься, і він змінюватиме положення камери. Запустіть гру і помітите, що рух миші тепер обертає камеру навколо персонажа. Якщо камера рухається в стіну, вона стикається з нею.
zh_cn: 弹簧臂会随轴心旋转，改变相机的位置。运行游戏，你会发现现在移动鼠标移动就可以使相机围绕角色旋转。如果相机向墙壁移动，就会与墙壁发生碰撞。
zh_hant: 旋轉樞紐點時，彈簧臂也會跟著旋轉，進而改變攝影機的位置。執行遊戲後，你可以看到滑鼠移動會讓攝影機繞著角色旋轉。如果攝影機碰到牆壁，也會正確產生碰撞效果。
