Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/standard_material_3d.po
Languages: ta

source: Albedo: This is where you put an albedo texture you want to blend. If nothing is in this slot it will be interpreted as white by default.
ta: ஆல்பிடோ: நீங்கள் கலக்க விரும்பும் ஒரு ஆல்பிடோ அமைப்பை இங்குதான் வைப்பது இதுதான். இந்த ச்லாட்டில் எதுவும் இல்லை என்றால், அது இயல்பாகவே வெள்ளை என்று விளக்கப்படும்.

source: Normal: This is where you put a normal texture you want to blend. If nothing is in this slot it will be interpreted as a flat normal map. This can still be used even if the material does not have normal map enabled.
ta: இயல்பானது: நீங்கள் கலக்க விரும்பும் ஒரு சாதாரண அமைப்பை நீங்கள் வைப்பது இதுதான். இந்த ச்லாட்டில் எதுவும் இல்லை என்றால் அது ஒரு தட்டையான சாதாரண வரைபடமாக விளக்கப்படும். பொருள் சாதாரண வரைபடம் இயக்கப்பட்டிருந்தாலும் கூட இதைப் பயன்படுத்தலாம்.

source: UV1 and UV2
ta: UV1 மற்றும் UV2

source: Godot supports two UV channels per material. Secondary UV is often useful for ambient occlusion or emission (baked light). UVs can be scaled and offset, which is useful when using repeating textures.
ta: கோடோட் ஒரு பொருளுக்கு இரண்டு புற ஊதா சேனல்களை ஆதரிக்கிறது. இரண்டாம் நிலை புற ஊதா பெரும்பாலும் சுற்றுப்புற மறுப்பு அல்லது உமிழ்வு (வேகவைத்த ஒளி) க்கு பயனுள்ளதாக இருக்கும். யு.வி.க்களை அளவிடலாம் மற்றும் ஆஃப்செட் செய்யலாம், இது மீண்டும் மீண்டும் அமைப்புகளைப் பயன்படுத்தும் போது பயனுள்ளதாக இருக்கும்.

source: Triplanar Mapping
ta: டிரிப்ளனார்

source: Triplanar mapping is supported for both UV1 and UV2. This is an alternative way to obtain texture coordinates, sometimes called "Autotexture". Textures are sampled in X, Y and Z and blended by the normal. Triplanar mapping can be performed in either world space or object space.
ta: UV1 மற்றும் UV2 இரண்டிற்கும் டிரிப்லானார் மேப்பிங் ஆதரிக்கப்படுகிறது. அமைப்பு ஆயத்தொலைவுகளைப் பெற இது ஒரு மாற்று வழியாகும், சில நேரங்களில் "ஆட்டோடெக்ச்டெர்" என்று அழைக்கப்படுகிறது. அமைப்புகள் ஃச், ஒய் மற்றும் சட் இல் மாதிரி செய்யப்பட்டு சாதாரணத்தால் கலக்கப்படுகின்றன. டிரிப்லானார் மேப்பிங் உலக இடம் அல்லது பொருள் இடங்களில் செய்யப்படலாம்.

source: In the image below, you can see how all primitives share the same material with world triplanar, so the brick texture continues smoothly between them.
ta: கீழேயுள்ள படத்தில், எல்லா ஆதிமனிதர்களும் ஒரே பொருளை உலக டிரிப்ளானருடன் எவ்வாறு பகிர்ந்து கொள்கிறார்கள் என்பதை நீங்கள் காணலாம், எனவே செங்கல் அமைப்பு அவற்றுக்கிடையே சீராக தொடர்கிறது.

source: World Triplanar
ta: உலக டிரிப்ளனார்

source: When using triplanar mapping, it is computed in object local space. This option makes it use world space instead.
ta: டிரிப்ளானார் மேப்பிங்கைப் பயன்படுத்தும் போது, இது பொருள் உள்ளக இடத்தில் கணக்கிடப்படுகிறது. இந்த விருப்பம் அதற்கு பதிலாக உலக இடத்தைப் பயன்படுத்துகிறது.

source: Sampling
ta: மாதிரி எடுத்தல்

source: Filter
ta: வடிப்பி

source: The filtering method for the textures used by the material. See :ref:`this page<class_BaseMaterial3D_property_texture_filter>` for a full list of options and their description.
ta: பொருள் பயன்படுத்தும் அமைப்புகளுக்கான வடிகட்டுதல் முறை. காண்க: குறிப்பு: `இந்த பக்கம் <class_basematerial3d_property_texture_filter>` முழு விருப்பங்களின் பட்டியல் மற்றும் அவற்றின் விளக்கத்திற்கு.

source: Repeat
ta: மீண்டும்

source: if the textures used by the material repeat, and how they repeat. See :ref:`this page<class_BaseMaterial3D_property_texture_repeat>` for a full list of options and their description.
ta: பொருள் மீண்டும் மீண்டும் பயன்படுத்தப்படும் கட்டமைப்புகள், அவை எவ்வாறு மீண்டும் மீண்டும் நிகழ்கின்றன என்றால். காண்க: குறிப்பு: `இந்த பக்கம் <class_basematerial3d_property_texture_repeat>` முழு விருப்பங்களின் பட்டியல் மற்றும் அவற்றின் விளக்கத்திற்கு.

source: Shadows
ta: நிழல்கள்

source: Do Not Receive Shadows
ta: நிழல்களைப் பெற வேண்டாம்

source: Makes the object not receive any kind of shadow that would otherwise be cast onto it.
ta: பொருள் எந்தவொரு நிழலையும் பெறக்கூடாது, இல்லையெனில் அதன் மீது செலுத்தப்படும்.

source: Use Shadow to Opacity
ta: ஒளிபுகாநிலைக்கு நிழலைப் பயன்படுத்துங்கள்

source: Lighting modifies the alpha so shadowed areas are opaque and non-shadowed areas are transparent. Useful for overlaying shadows onto a camera feed in AR.
ta: லைட்டிங் ஆல்பாவை மாற்றியமைக்கிறது, எனவே நிழலாடிய பகுதிகள் ஒளிபுகா மற்றும் நிழல் இல்லாத பகுதிகள் வெளிப்படையானவை. AR இல் கேமரா ஊட்டத்தில் நிழல்களை மேலெழுத பயனுள்ளதாக இருக்கும்.

source: Billboard
ta: விளம்பர பலகை

source: Billboard Mode
ta: விளம்பர பலகை பயன்முறை

source: Enables billboard mode for drawing materials. This controls how the object faces the camera:
ta: பொருட்களை வரைவதற்கு பில்போர்டு பயன்முறையை இயக்குகிறது. பொருள் கேமராவை எவ்வாறு எதிர்கொள்கிறது என்பதை இது கட்டுப்படுத்துகிறது:

source: **Disabled:** Billboard mode is disabled.
ta: ** முடக்கப்பட்டது: ** பில்போர்டு பயன்முறை முடக்கப்பட்டுள்ளது.

source: **Enabled:** Billboard mode is enabled. The object's -Z axis will always face the camera's viewing plane.
ta: ** இயக்கப்பட்டது: ** பில்போர்டு பயன்முறை இயக்கப்பட்டது. பொருளின் -z அச்சு எப்போதும் கேமராவின் பார்க்கும் விமானத்தை எதிர்கொள்ளும்.

source: **Y-Billboard:** The object's X axis will always be aligned with the camera's viewing plane.
ta: ** y- பில்ல்போர்டு: ** பொருளின் ஃச் அச்சு எப்போதும் கேமராவின் பார்க்கும் விமானத்துடன் சீரமைக்கப்படும்.

source: **Particle Billboard:** Most suited for particle systems, because it allows specifying :ref:`flipbook animation <doc_process_material_properties_animation>`.
ta: **Particle Billboard:** பெரும்பாலானவை suited க்கு துகள்கள் systems, because it allows specifying :ref:`flipbook animation <doc_process_material_properties_animation>`.

source: The **Particles Anim** section is only visible when the billboard mode is **Particle Billboard**.
ta: பில்போர்டு பயன்முறை ** துகள் விளம்பர பலகை ** ஆக இருக்கும்போது மட்டுமே ** துகள்கள் அனிமே ** பிரிவு தெரியும்.

source: Billboard Keep Scale
ta: விளம்பர பலகை அளவுகோல்

source: Enables scaling a mesh in billboard mode.
ta: பில்போர்டு பயன்முறையில் ஒரு கண்ணி அளவிட உதவுகிறது.

source: Grow
ta: வளர

source: Grows the object vertices in the direction pointed by their normals:
ta: அவற்றின் இயல்புகளால் சுட்டிக்காட்டப்பட்ட திசையில் பொருள் செங்குத்துகளை வளர்க்கிறது:

source: This is commonly used to create cheap outlines. Add a second material pass, make it black and unshaded, reverse culling (Cull Front), and add some grow:
ta: மலிவான திட்டவட்டங்களை உருவாக்க இது பொதுவாகப் பயன்படுத்தப்படுகிறது. இரண்டாவது பொருள் பாசைச் சேர்த்து, அதை கருப்பு மற்றும் அசைக்கப்படாததாக ஆக்கி, தலைகீழ் கல்லிங் (குல் முன்) செய்து, சில வளர்ச்சியைச் சேர்க்கவும்:

source: For Grow to work as expected, the mesh must have connected faces with shared vertices, or "smooth shading". If the mesh has disconnected faces with unique vertices, or "flat shading", the mesh will appear to have gaps when using Grow.
ta: எதிர்பார்த்தபடி வேலை செய்ய, கண்ணி பகிரப்பட்ட செங்குத்துகள் அல்லது "மென்மையான நிழல்" உடன் இணைக்கப்பட்ட முகங்களைக் கொண்டிருக்க வேண்டும். கண்ணி தனித்துவமான செங்குத்துகள் அல்லது "தட்டையான நிழல்" கொண்ட முகங்களை துண்டித்துவிட்டால், வளர்ந்து பயன்படுத்தும் போது கண்ணி இடைவெளிகளைக் கொண்டிருப்பதாகத் தோன்றும்.

source: Transform
ta: உருமாற்று, உருமாற்றம்

source: Fixed Size
ta: நிலையான அளவு

source: This causes the object to be rendered at the same size no matter the distance. This is useful mostly for indicators (no depth test and high render priority) and some types of billboards.
ta: இது தூரத்தைப் பொருட்படுத்தாமல் ஒரே அளவில் பொருளை வழங்குவதற்கு காரணமாகிறது. இது பெரும்பாலும் குறிகாட்டிகள் (ஆழ சோதனை மற்றும் அதிக வழங்குதல் முன்னுரிமை இல்லை) மற்றும் சில வகையான விளம்பர பலகைகளுக்கு பயனுள்ளதாக இருக்கும்.

source: Use Point Size
ta: புள்ளி அளவைப் பயன்படுத்தவும்

source: This option is only effective when the geometry rendered is made of points (generally it's made of triangles when imported from 3D modeling software). If so, then those points can be resized (see below).
ta: வழங்கப்பட்ட வடிவியல் புள்ளிகளால் ஆனபோது மட்டுமே இந்த விருப்பம் பயனுள்ளதாக இருக்கும் (பொதுவாக இது 3D மாடலிங் மென்பொருளிலிருந்து இறக்குமதி செய்யும்போது முக்கோணங்களால் ஆனது). அப்படியானால், அந்த புள்ளிகளை மறுஅளவிடலாம் (கீழே காண்க).

source: Point Size
ta: புள்ளி அளவு

source: When drawing points, specify the point size in pixels.
ta: புள்ளிகளை வரையும்போது, புள்ளி அளவைக் பிக்சல்களில் குறிப்பிடவும்.

source: Transmission
ta: பரவும் முறை

source: Proximity and Distance Fade
ta: அருகாமையும் தூர மங்கலும்

source: Godot allows materials to fade by proximity to each other as well as depending on the distance from the viewer. Proximity fade is useful for effects such as soft particles or a mass of water with a smooth blending to the shores.
ta: கோடோட் ஒருவருக்கொருவர் அருகாமையில் இருப்பதற்கும் பார்வையாளரின் தூரத்தைப் பொறுத்து பொருட்களையும் மங்கச் செய்ய அனுமதிக்கிறது. மென்மையான துகள்கள் அல்லது கரையோரங்களுக்கு மென்மையான கலப்புடன் கூடிய வெகுசன நீர் போன்ற விளைவுகளுக்கு அருகாமையில் மங்கலானது பயனுள்ளதாக இருக்கும்.

source: Distance fade is useful for light shafts or indicators that are only present after a given distance.
ta: கொடுக்கப்பட்ட தூரத்திற்குப் பிறகு மட்டுமே இருக்கும் ஒளி தண்டுகள் அல்லது குறிகாட்டிகளுக்கு தூர மங்கல் பயனுள்ளதாக இருக்கும்.

source: Keep in mind enabling proximity fade or distance fade with **Pixel Alpha** mode enables alpha blending. Alpha blending is more GPU-intensive and can cause transparency sorting issues. Alpha blending also disables many material features such as the ability to cast shadows.
ta: ** படப்புள்ளி ஆல்பா ** பயன்முறையுடன் அருகாமையில் மங்கல் அல்லது தூர மங்கலை செயல்படுத்துவதை நினைவில் கொள்ளுங்கள். ஆல்பா கலத்தல் மிகவும் சி.பீ.யூ-தீவிரமானது மற்றும் வெளிப்படைத்தன்மை வரிசைப்படுத்தும் சிக்கல்களை ஏற்படுத்தும். ஆல்பா கலத்தல் நிழல்களை நடிக்கும் திறன் போன்ற பல பொருள் அம்சங்களையும் முடக்குகிறது.

source: To hide a character when they get too close to the camera, consider using **Pixel Dither** or better, **Object Dither** (which is even faster than **Pixel Dither**).
ta: ஒரு கதாபாத்திரம் கேமராவுடன் மிக நெருக்கமாக இருக்கும்போது மறைக்க, ** படப்புள்ளி டிதர் ** அல்லது சிறந்தது, ** பொருள் டிதர் ** (இது ** படப்புள்ளி டிதர் ** ஐ விட வேகமாக உள்ளது).

source: **Pixel Alpha** mode: The actual transparency of a pixel of the object changes with distance to the camera. This is the most effect, but forces the material into the transparency pipeline (which leads, for example, to no shadows).
ta: ** படப்புள்ளி ஆல்பா ** பயன்முறை: பொருளின் பிக்சலின் உண்மையான வெளிப்படைத்தன்மை கேமராவுக்கு தூரத்துடன் மாறுகிறது. இது மிகவும் விளைவு, ஆனால் பொருளை வெளிப்படைத்தன்மை குழாய்த்திட்டத்திற்குள் கட்டாயப்படுத்துகிறது (இது, எடுத்துக்காட்டாக, நிழல்களுக்கு வழிவகுக்கிறது).

source: **Pixel Dither** mode: What this does is sort of approximate the transparency by only having a fraction of the pixels rendered.
ta: ** படப்புள்ளி டிதர் ** பயன்முறை: இது என்ன செய்வது என்பது பிக்சல்களில் ஒரு பகுதியை மட்டுமே வைத்திருப்பதன் மூலம் வெளிப்படைத்தன்மையை தோராயமாக மதிப்பிடுவதாகும்.

source: **Object Dither** mode: Like the previous mode, but the calculated transparency is the same across the entire object's surface.
ta: ** பொருள் டிதர் ** பயன்முறை: முந்தைய பயன்முறையைப் போல, ஆனால் கணக்கிடப்பட்ட வெளிப்படைத்தன்மை முழு பொருளின் மேற்பரப்பிலும் ஒரே மாதிரியாக இருக்கும்.

source: Material Settings
ta: பொருள் அமைப்புகள்

source: Render priority
ta: முன்னுரிமை வழங்கவும்

source: The rendering order of objects can be changed, although this is mostly useful for transparent objects (or opaque objects that perform depth draw but no color draw, such as cracks on the floor).
ta: பொருள்களின் வழங்குதல் வரிசையை மாற்றலாம், இருப்பினும் இது வெளிப்படையான பொருள்களுக்கு பெரும்பாலும் பயனுள்ளதாக இருக்கும் (அல்லது ஆழமான டிராவைச் செய்யும் ஒளிபுகா பொருள்கள் ஆனால் தரையில் விரிசல் போன்ற வண்ண டிரா இல்லை).

source: Objects are sorted by an opaque/transparent queue, then :ref:`render_priority<class_Material_property_render_priority>`, with higher priority being drawn later. Transparent objects are also sorted by depth.
ta: பொருள்கள் ஒரு ஒளிபுகா/வெளிப்படையான வரிசையால் வரிசைப்படுத்தப்படுகின்றன, பின்னர்: ref: `ரெண்டர்_பிரியோரிட்டி <class_material_property_render_priority>`, பின்னர் அதிக முன்னுரிமை பெறப்படுகிறது. வெளிப்படையான பொருள்களும் ஆழத்தால் வரிசைப்படுத்தப்படுகின்றன.

source: Depth testing overrules priority. Priority alone cannot force opaque objects to be drawn over each other.
ta: ஆழம் சோதனை முன்னுரிமை. முன்னுரிமை மட்டுமே ஒளிபுகா பொருள்களை ஒருவருக்கொருவர் வரையும்படி கட்டாயப்படுத்த முடியாது.

source: Next Pass
ta: அடுத்த பாச்

source: Setting :ref:`next_pass<class_Material_property_next_pass>` on a material will cause an object to be rendered again with that next material.
ta: அமைத்தல்: குறிப்பு: `நெக்ச்ட்_பாச் <class_material_property_next_pass>` ஒரு பொருளின் மீது ஒரு பொருளை அந்த அடுத்த பொருளுடன் மீண்டும் வழங்கும்.

source: Materials are sorted by an opaque/transparent queue, then :ref:`render_priority<class_Material_property_render_priority>`, with higher priority being drawn later.
ta: பொருட்கள் ஒரு ஒளிபுகா/வெளிப்படையான வரிசையால் வரிசைப்படுத்தப்படுகின்றன, பின்னர்: ref: `ரெண்டர்_பிரியோட் <class_material_property_render_priority>`, பின்னர் அதிக முன்னுரிமை பெறப்படுகிறது.

source: Depth will test equal between both materials unless the grow setting or other vertex transformations are used. Multiple transparent passes should use :ref:`render_priority<class_Material_property_render_priority>` to ensure correct ordering.
ta: வளரும் அமைப்பு அல்லது பிற வெர்டெக்ச் மாற்றங்கள் பயன்படுத்தப்படாவிட்டால் இரு பொருட்களுக்கும் இடையில் ஆழம் சமமாக சோதிக்கப்படும். பல வெளிப்படையான பாச்கள் பயன்படுத்தப்பட வேண்டும்: Ref: `ரெண்டர்_பிரியோட் <class_material_property_render_priority>` சரியான வரிசைப்படுத்தலை உறுதிப்படுத்த.
