Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/standard_material_3d.po
Languages: ta

source: Standard Material 3D and ORM Material 3D
ta: நிலையான பொருள் 3D மற்றும் ORM பொருள் 3D

source: Introduction
ta: அறிமுகம்

source: ``StandardMaterial3D`` and ``ORMMaterial3D`` (Occlusion, Roughness, Metallic) are default 3D materials that aim to provide most of the features artists look for in a material, without the need for writing shader code. However, they can be converted to shader code if additional functionality is needed.
ta: `` Standardmaterial3d`` மற்றும் `` ormmaterial3d`` (மறைவு, கடினத்தன்மை, உலோகம்) இயல்புநிலை 3D பொருட்கள், அவை கலைஞர்கள் ஒரு பொருளில் தேடும் பெரும்பாலான அம்சங்களை வழங்குவதை நோக்கமாகக் கொண்டுள்ளன, நிழல் குறியீட்டை எழுத வேண்டிய அவசியமின்றி. இருப்பினும், கூடுதல் செயல்பாடு தேவைப்பட்டால் அவற்றை சேடர் குறியீடாக மாற்றலாம்.

source: This tutorial explains the parameters present in both materials.
ta: இந்த டுடோரியல் இரண்டு பொருட்களிலும் இருக்கும் அளவுருக்களை விளக்குகிறது.

source: There are 4 ways to add these materials to an object. A material can be added in the *Material* property of the mesh. It can be added in the *Material* property of the node using the mesh (such as a MeshInstance3D node), the *Material Override* property of the node using the mesh, and the *Material Overlay*.
ta: இந்த பொருட்களை ஒரு பொருளில் சேர்க்க 4 வழிகள் உள்ளன. கண்ணி * பொருள் * சொத்தில் ஒரு பொருளைச் சேர்க்கலாம். கண்ணி (மெசின்ச்டன்ச் 3 டி முனை போன்றவை), கண்ணி பயன்படுத்தி முனையின் *பொருள் மேலெழுத *சொத்து மற்றும் *பொருள் மேலடுக்கு *ஆகியவற்றைப் பயன்படுத்தி முனையின் *பொருள் *சொத்தில் இதைச் சேர்க்கலாம்.

source: If you add a material to the mesh itself, every time that mesh is used it will have that material. If you add a material to the node using the mesh, the material will only be used by that node, it will also override the material property of the mesh. If a material is added in the *Material Override* property of the node, it will only be used by that node. It will also override the regular material property of the node and the material property of the mesh.
ta: நீங்கள் கண்ணி மீது ஒரு பொருளைச் சேர்த்தால், ஒவ்வொரு முறையும் கண்ணி பயன்படுத்தப்படும் போது அதற்கு அந்த பொருள் இருக்கும். கண்ணி பயன்படுத்தி முனையில் ஒரு பொருளைச் சேர்த்தால், பொருள் அந்த முனையால் மட்டுமே பயன்படுத்தப்படும், அது கண்ணி பொருள் சொத்தை மேலெழுதும். முனையின் * பொருள் மேலெழுத * சொத்தில் ஒரு பொருள் சேர்க்கப்பட்டால், அது அந்த முனையால் மட்டுமே பயன்படுத்தப்படும். இது முனையின் வழக்கமான பொருள் சொத்து மற்றும் கண்ணி பொருள் சொத்து ஆகியவற்றை மேலெழுதும்.

source: The *Material Overlay* property will render a material **over** the current one being used by the mesh. As an example, this can be used to put a transparent shield effect on a mesh.
ta: *பொருள் மேலடுக்கு*சொத்து ஒரு பொருளை ** க்கு மேல் வழங்கும் ** மின்னோட்டத்தை கண்ணி பயன்படுத்துகிறது. உதாரணமாக, இது ஒரு கண்ணி மீது வெளிப்படையான கவச விளைவை வைக்க பயன்படுத்தப்படலாம்.

source: BaseMaterial 3D settings
ta: அடிப்படை 3D அமைப்புகள்

source: StandardMaterial3D has many settings that determine the look of a material. All of these are under the BaseMaterial3D category
ta: StandardMaterial3d ஒரு பொருளின் தோற்றத்தை தீர்மானிக்கும் பல அமைப்புகளைக் கொண்டுள்ளது. இவை அனைத்தும் அடிப்படை 3 டி பிரிவின் கீழ் உள்ளன

source: ORM materials are almost exactly the same with one difference. Instead of separate settings and textures for occlusion, roughness, and metallic, there is a single ORM texture. The different color channels of that texture are used for each parameter. Programs such as Substance Painter and Armor Paint will give you the option to export in this format, for these two programs it's with the export preset for unreal engine, which also uses ORM textures.
ta: ORM பொருட்கள் ஒரு வித்தியாசத்துடன் கிட்டத்தட்ட ஒரே மாதிரியானவை. மறைவு, கடினத்தன்மை மற்றும் உலோகத்திற்கான தனி அமைப்புகள் மற்றும் அமைப்புகளுக்கு பதிலாக, ஒரு ஒற்றை ORM அமைப்பு உள்ளது. அந்த அமைப்பின் வெவ்வேறு வண்ண சேனல்கள் ஒவ்வொரு அளவுருவுக்கும் பயன்படுத்தப்படுகின்றன. பொருள் பெயிண்டர் மற்றும் ஆர்மர் பெயிண்ட் போன்ற திட்டங்கள் இந்த வடிவமைப்பில் ஏற்றுமதி செய்வதற்கான விருப்பத்தை உங்களுக்கு வழங்கும், இந்த இரண்டு நிரல்களுக்கும் இது அன்ரியல் எஞ்சினுக்கான ஏற்றுமதி முன்னமைவுடன் உள்ளது, இது ORM அமைப்புகளையும் பயன்படுத்துகிறது.

source: Transparency
ta: வெளிப்படைத்தன்மை

source: By default, materials in Godot are opaque. This is fast to render, but it means the material can't be seen through even if you use a transparent texture in the **Albedo > Texture** property (or set **Albedo > Color** to a transparent color).
ta: இயல்பாக, கோடோட்டில் உள்ள பொருட்கள் ஒளிபுகா. இது வழங்குவது வேகமானது, ஆனால் ** ஆல்பிடோ> அமைப்பு ** சொத்தில் (அல்லது ** ஆல்பிடோ> வண்ணம் ** ஐ ஒரு வெளிப்படையான நிறத்திற்கு அமைக்கவும்) ஒரு வெளிப்படையான அமைப்பைப் பயன்படுத்தினாலும் பொருளைக் காண முடியாது என்பதாகும்.

source: To be able to see through a material, the material needs to be made *transparent*. Godot offers several transparency modes:
ta: ஒரு பொருள் மூலம் பார்க்க, பொருள் *வெளிப்படையான *செய்யப்பட வேண்டும். கோடோட் பல வெளிப்படைத்தன்மை முறைகளை வழங்குகிறது:

source: **Disabled:** Material is opaque. This is the fastest to render, with all rendering features supported.
ta: ** முடக்கப்பட்டது: ** பொருள் ஒளிபுகா. அனைத்து வழங்குதல் அம்சங்களும் ஆதரிக்கப்படுவதால், வழங்குவது மிக விரைவானது.

source: **Alpha:** Material is transparent. Semi-transparent areas are drawn with blending. This is slow to render, but it allows for partial transparency (also known as translucency). Materials using alpha blending also can't cast shadows, and are not visible in screen-space reflections.
ta: ** ஆல்பா: ** பொருள் வெளிப்படையானது. அரை-வெளிப்படையான பகுதிகள் கலப்புடன் வரையப்படுகின்றன. இது வழங்குவதில் மெதுவாக உள்ளது, ஆனால் இது பகுதி வெளிப்படைத்தன்மையை அனுமதிக்கிறது (ஒளிஊடுருவல் என்றும் அழைக்கப்படுகிறது). ஆல்பா கலப்பைப் பயன்படுத்தும் பொருட்களும் நிழல்களைக் காட்ட முடியாது, மேலும் அவை திரை-விண்வெளி பிரதிபலிப்புகளில் தெரியவில்லை.

source: **Alpha** is a good fit for particle effects and VFX.
ta: ** ஆல்பா ** துகள் விளைவுகள் மற்றும் VFX க்கு ஒரு நல்ல பொருத்தம்.

source: **Alpha Scissor:** Material is transparent. Semi-transparent areas whose opacity is below **Alpha Scissor Threshold** are not drawn (above this opacity, these are drawn as opaque). This is faster to render than Alpha and doesn't exhibit transparency sorting issues. The downside is that this results in "all or nothing" transparency, with no intermediate values possible. Materials using alpha scissor can cast shadows.
ta: ** ஆல்பா கத்தரிக்கோல்: ** பொருள் வெளிப்படையானது. அரை-வெளிப்படையான பகுதிகள் அதன் ஒளிபுகாநிலைக்கு கீழே உள்ளன ** ஆல்பா கத்தரிக்கோல் வாசல் ** வரையப்படவில்லை (இந்த ஒளிபுகாநிலைக்கு மேலே, இவை ஒளிபுகாதாக வரையப்படுகின்றன). இது ஆல்பாவை விட வேகமானது மற்றும் வெளிப்படைத்தன்மை வரிசைப்படுத்தும் சிக்கல்களை வெளிப்படுத்தாது. எதிர்மறையானது என்னவென்றால், இது "அனைத்தும் அல்லது எதுவும்" வெளிப்படைத்தன்மையில் விளைகிறது, இடைநிலை மதிப்புகள் எதுவும் சாத்தியமில்லை. ஆல்பா கத்தரிக்கோலைப் பயன்படுத்தும் பொருட்கள் நிழல்களை ஏற்படுத்தும்.

source: **Alpha Scissor** is ideal for foliage and fences, since these have hard edges and require correct sorting to look good.
ta: ** ஆல்பா கத்தரிக்கோல் ** பசுமையாக மற்றும் வேலிகளுக்கு ஏற்றது, ஏனெனில் இவை கடினமான விளிம்புகளைக் கொண்டுள்ளன, மேலும் அழகாக இருக்க சரியான வரிசையாக்கம் தேவைப்படுகிறது.

source: **Alpha Hash:** Material is transparent. Semi-transparent areas are drawn using dithering. This is also "all or nothing" transparency, but dithering helps represent partially opaque areas with limited precision depending on viewport resolution. Materials using alpha hash can cast shadows.
ta: ** ஆல்பா ஆச்: ** பொருள் வெளிப்படையானது. அரை-வெளிப்படையான பகுதிகள் டீச்சரிங்கைப் பயன்படுத்தி வரையப்படுகின்றன. இது "எல்லாம் அல்லது எதுவும்" வெளிப்படைத்தன்மை, ஆனால் வியூ துறைமுகம் தீர்மானத்தைப் பொறுத்து வரையறுக்கப்பட்ட துல்லியத்துடன் ஓரளவு ஒளிபுகா பகுதிகளைக் குறிக்க உதவுகிறது. ஆல்பா ஆசைப் பயன்படுத்தும் பொருட்கள் நிழல்களை அனுப்பும்.

source: **Alpha Hash** is suited for realistic-looking hair, although stylized hair may work better with alpha scissor.
ta: ** ஆல்பா ஆச் ** யதார்த்தமான தோற்றமுடைய கூந்தலுக்கு மிகவும் பொருத்தமானது, இருப்பினும் பகட்டான முடி ஆல்பா கத்தரிக்கோலால் சிறப்பாக செயல்படக்கூடும்.

source: **Depth Pre-Pass:** This renders the object's fully opaque pixels via the opaque pipeline first, then renders the rest with alpha blending. This allows transparency sorting to be *mostly* correct (albeit not fully so, as partially transparent regions may still exhibit incorrect sorting). Materials using depth prepass can cast shadows.
ta: ** ஆழம் முன்-பாச்: ** இது முதலில் ஒளிபுகா குழாய் வழியாக பொருளின் முழுமையான ஒளிபுகா பிக்சல்களை வழங்குகிறது, பின்னர் மீதமுள்ளவற்றை ஆல்பா கலப்புடன் வழங்குகிறது. இது வெளிப்படைத்தன்மை வரிசையாக்கத்தை * பெரும்பாலும் * சரியாக இருக்க அனுமதிக்கிறது (முழுமையாக இல்லை என்றாலும், ஓரளவு வெளிப்படையான பகுதிகள் இன்னும் தவறான வரிசையாக்கத்தை வெளிப்படுத்தக்கூடும்). ஆழமான ப்ரெபசைப் பயன்படுத்தும் பொருட்கள் நிழல்களை ஏற்படுத்தும்.

source: Godot will automatically force the material to be transparent with alpha blending if *any* of these conditions is met:
ta: இந்த நிபந்தனைகளில் * ஏதேனும் * நிறைவு செய்யப்பட்டால், ஆல்பா கலப்புடன் பொருள் வெளிப்படையாக இருக்க வேண்டும் என்று கோடோட் தானாகவே கட்டாயப்படுத்தும்:

source: Setting the transparency mode to **Alpha** (as described here).
ta: வெளிப்படைத்தன்மை பயன்முறையை ** ஆல்பா ** என அமைத்தல் (இங்கே விவரிக்கப்பட்டுள்ளபடி).

source: Setting a blend mode other than the default **Mix**
ta: இயல்புநிலையைத் தவிர வேறு கலப்பு பயன்முறையை அமைத்தல் ** கலவை **

source: Enabling **Refraction**, **Proximity Fade**, or **Distance Fade**.
ta: ** ஒளிவிலகல் **, ** அருகாமை மங்கலான **, அல்லது ** தூரம் மங்கலானது **.

source: Comparison between alpha blending (left) and alpha scissor (right) transparency:
ta: ஆல்பா கலத்தல் (இடது) மற்றும் ஆல்பா கத்தரிக்கோல் (வலது) வெளிப்படைத்தன்மை ஆகியவற்றுக்கு இடையேயான ஒப்பீடு:

source: Alpha-blended transparency has several :ref:`limitations <doc_3d_rendering_limitations_transparency_sorting>`:
ta: ஆல்பா-கலப்பு வெளிப்படைத்தன்மை பலவற்றைக் கொண்டுள்ளது: குறிப்பு: `வரம்புகள் <doc_3d_rendering_imitations_transparency_sorting>`:

source: Alpha-blended materials are significantly slower to render, especially if they overlap.
ta: ஆல்பா-கலப்பு பொருட்கள் வழங்குவதற்கு கணிசமாக மெதுவாக இருக்கும், குறிப்பாக அவை ஒன்றுடன் ஒன்று இருந்தால்.

source: Alpha-blended materials may exhibit sorting issues when transparent surfaces overlap each other. This means that surfaces may render in the incorrect order, with surfaces in the back appearing to be in front of those which are actually closer to the camera.
ta: வெளிப்படையான மேற்பரப்புகள் ஒருவருக்கொருவர் ஒன்றிணைக்கும்போது ஆல்பா-கலப்பு பொருட்கள் வரிசையாக்க சிக்கல்களை வெளிப்படுத்தக்கூடும். இதன் பொருள் மேற்பரப்புகள் தவறான வரிசையில் வழங்கப்படலாம், பின்புறத்தில் மேற்பரப்புகள் உண்மையில் கேமராவுக்கு நெருக்கமாக இருப்பதற்கு முன்னால் தோன்றும்.

source: Alpha-blended materials don't cast shadows, although they can receive shadows.
ta: ஆல்பா-கலந்த பொருட்கள் நிழல்களைப் பெறாது, இருப்பினும் அவை நிழல்களைப் பெறலாம்.

source: Alpha-blended materials don't appear in any reflections (other than reflection probes).
ta: ஆல்பா-கலப்பு பொருட்கள் எந்த பிரதிபலிப்புகளிலும் தோன்றாது (பிரதிபலிப்பு ஆய்வுகள் தவிர).

source: Screen-space reflections and sharp SDFGI reflections don't appear on alpha-blended materials. When SDFGI is enabled, rough reflections are used as a fallback regardless of material roughness.
ta: திரை-விண்வெளி பிரதிபலிப்புகள் மற்றும் கூர்மையான SDFGI பிரதிபலிப்புகள் ஆல்பா-சேர்க்கப்பட்ட பொருட்களில் தோன்றாது. SDFGI இயக்கப்பட்டால், பொருள் கடினத்தன்மையைப் பொருட்படுத்தாமல் கரடுமுரடான பிரதிபலிப்புகள் குறைவடையும்.

source: Before using the **Alpha** transparency mode, always consider whether another transparency mode is more suited for your needs.
ta: ** ஆல்பா ** வெளிப்படைத்தன்மை பயன்முறையைப் பயன்படுத்துவதற்கு முன், உங்கள் தேவைகளுக்கு மற்றொரு வெளிப்படைத்தன்மை பயன்முறை மிகவும் பொருத்தமானதா என்பதை எப்போதும் கவனியுங்கள்.

source: Alpha Antialiasing
ta: ஆல்பா ஆன்டியாலியாசிங்

source: This property is only visible when the transparency mode is **Alpha Scissor** or **Alpha Hash**.
ta: வெளிப்படைத்தன்மை பயன்முறை ** ஆல்பா கத்தரிக்கோல் ** அல்லது ** ஆல்பா ஆச் ** ஆக இருக்கும்போது மட்டுமே இந்த சொத்து தெரியும்.

source: While alpha scissor and alpha hash materials are faster to render than alpha-blended materials, they exhibit hard edges between opaque and transparent regions. While it's possible to use post-processing-based :ref:`antialiasing techniques <doc_3d_antialiasing>` such as FXAA and TAA, this is not always desired as these techniques tend to make the final result look blurrier or exhibit ghosting artifacts.
ta: ஆல்பா-கலப்பு பொருட்களை விட ஆல்பா கத்தரிக்கோல் மற்றும் ஆல்பா ஆச் பொருட்கள் வழங்க வேகமாக இருக்கும்போது, அவை ஒளிபுகா மற்றும் வெளிப்படையான பகுதிகளுக்கு இடையில் கடினமான விளிம்புகளை வெளிப்படுத்துகின்றன. பிந்தைய செயலாக்க அடிப்படையிலானவற்றைப் பயன்படுத்த முடியும் என்றாலும்: ref: `ஆன்டிலியாசிங் நுட்பங்கள் <doc_3d_antialiasing>` FXAA மற்றும் TAA போன்றவை, இந்த நுட்பங்கள் இறுதி முடிவை மங்கலானதாகவோ அல்லது பேய் கலைப்பொருட்களை வெளிப்படுத்தவோ முனைகின்றன என்பதால் இது எப்போதும் விரும்பவில்லை.

source: There are 3 alpha antialiasing modes available:
ta: 3 ஆல்பா ஆன்டிலியாசிங் முறைகள் உள்ளன:

source: **Disabled:** No alpha antialiasing. Edges of transparent materials will appear aliased unless a post-processing-based antialiasing solution is used.
ta: ** முடக்கப்பட்டது: ** ஆல்பா ஆன்டிலியாசிங் இல்லை. ஒரு பிந்தைய செயலாக்க அடிப்படையிலான ஆன்டிலியாசிங் தீர்வு பயன்படுத்தப்படாவிட்டால், வெளிப்படையான பொருட்களின் விளிம்புகள் மாற்றுப்பெயராகத் தோன்றும்.

source: **Alpha Edge Blend:** Results in a smooth transition between opaque and transparent areas. Also known as "alpha to coverage".
ta: ** ஆல்பா எட்ச் கலவை: ** ஒளிபுகா மற்றும் வெளிப்படையான பகுதிகளுக்கு இடையில் மென்மையான மாற்றத்தை ஏற்படுத்துகிறது. "ஆல்பா டு கவரேச்" என்றும் அழைக்கப்படுகிறது.

source: **Alpha Edge Clip:** Results in a sharp, but still antialiased transition between opaque and transparent areas. Also known as "alpha to coverage + alpha to one".
ta: ** ஆல்பா எட்ச் கிளிப்: ** ஒளிபுகா மற்றும் வெளிப்படையான பகுதிகளுக்கு இடையில் ஒரு கூர்மையான, ஆனால் இன்னும் ஆன்டிலியாச் மாற்றத்தை ஏற்படுத்துகிறது. "ஆல்பா டு கவரேச் + ஆல்பா டு ஒன்" என்றும் அழைக்கப்படுகிறது.

source: When the alpha antialiasing mode is set to **Alpha Edge Blend** or **Alpha Edge Clip**, a new **Alpha Antialiasing Edge** property becomes visible below in the inspector. This property controls the threshold below which pixels should be made transparent. While you've already defined an alpha scissor threshold (when using **Alpha Scissor** only), this additional threshold is used to smoothly transition between opaque and transparent pixels. **Alpha Antialiasing Edge** must *always* be set to a value that is strictly below the alpha scissor threshold. The default of ``0.3`` is a sensible value with an alpha scissor of threshold of ``0.5``, but remember to adjust this alpha antialiasing edge when modifying the alpha scissor threshold.
ta: ஆல்பா ஆன்டியாலியாசிங் பயன்முறை ** ஆல்பா எட்ச் கலப்பு ** அல்லது ** ஆல்பா எட்ச் கிளிப் ** என அமைக்கப்பட்டால், ஒரு புதிய ** ஆல்பா ஆன்டிலியாசிங் எட்ச் ** சொத்து இன்ச்பெக்டரில் கீழே தெரியும். இந்த சொத்து படப்புள்ளிகள் வெளிப்படையானதாக இருக்க வேண்டிய கீழே உள்ள நுழைவாயிலைக் கட்டுப்படுத்துகிறது. நீங்கள் ஏற்கனவே ஆல்பா கத்தரிக்கோல் வாசலை வரையறுத்துள்ள நிலையில் (** ஆல்பா கத்தரிக்கோல் ** மட்டும் பயன்படுத்தும் போது), இந்த கூடுதல் வாசல் ஒளிபுகா மற்றும் வெளிப்படையான பிக்சல்களுக்கு இடையில் சீராக மாற்ற பயன்படுகிறது. ** ஆல்பா ஆன்டிலியாசிங் எட்ச் ** ஆல்பா கத்தரிக்கோல் வாசலுக்கு கீழே கண்டிப்பாக இருக்கும் மதிப்புக்கு*எப்போதும்*அமைக்கப்பட வேண்டும். `` 0.3`` இன் இயல்புநிலை `` 0.5`` இன் ஆல்பா கத்தரிக்கோலால் விவேகமான மதிப்பு, ஆனால் ஆல்பா கத்தரிக்கோல் வாசலை மாற்றும்போது இந்த ஆல்பா ஆன்டிலியாசிங் விளிம்பை சரிசெய்ய நினைவில் கொள்ளுங்கள்.

source: If you find the antialiasing effect not effective enough, try increasing **Alpha Antialiasing Edge** while making sure it's below **Alpha Scissor Threshold** (if the material uses alpha scissor). On the other hand, if you notice the texture's appearance visibly changing as the camera moves closer to the material, try decreasing **Alpha Antialiasing Edge**.
ta: ஆன்டிலியாசிங் விளைவு போதுமானதாக இல்லை என்று நீங்கள் கண்டால், ** ஆல்பா ஆன்டியாலியாசிங் விளிம்பை அதிகரிக்க முயற்சிக்கவும் ** இது கீழே இருப்பதை உறுதிசெய்து ** ஆல்பா கத்தரிக்கோல் வாசல் ** (பொருள் ஆல்பா கத்தரிக்கோலைப் பயன்படுத்தினால்). மறுபுறம், கேமரா பொருளுக்கு நெருக்கமாக நகரும்போது அமைப்பின் தோற்றம் மாறுவதை நீங்கள் கவனித்தால், ** ஆல்பா ஆன்டிலியாசிங் எட்ச் ** ஐக் குறைக்க முயற்சிக்கவும்.

source: For best results, MSAA 3D should be set to at least 2× in the Project Settings when using alpha antialiasing. This is because this feature relies on alpha to coverage, which is a feature provided by MSAA.
ta: சிறந்த முடிவுகளுக்கு, ஆல்பா ஆன்டிலியாசிங்கைப் பயன்படுத்தும் போது திட்ட அமைப்புகளில் MSAA 3D குறைந்தது 2 with ஆக அமைக்கப்பட வேண்டும். ஏனென்றால், இந்த நற்பொருத்தம் ஆல்பா டு கவரேசை நம்பியுள்ளது, இது MSAA ஆல் வழங்கப்பட்ட அம்சமாகும்.

source: Without MSAA, a fixed dithering pattern is applied on the material's edges, which isn't very effective at smoothing out edges (although it can still help a little).
ta: MSAA இல்லாமல், பொருளின் விளிம்புகளில் ஒரு நிலையான டிதரிங் முறை பயன்படுத்தப்படுகிறது, இது விளிம்புகளை மென்மையாக்குவதில் மிகவும் பயனுள்ளதாக இல்லை (இது இன்னும் கொஞ்சம் உதவக்கூடும் என்றாலும்).

source: Blend Mode
ta: கலப்பு பயன்முறை

source: Controls the blend mode for the material. Keep in mind that any mode other than *Mix* forces the object to go through the transparent pipeline.
ta: பொருளுக்கான கலப்பு பயன்முறையை கட்டுப்படுத்துகிறது. * கலவை * தவிர வேறு எந்த பயன்முறையும் பொருளை வெளிப்படையான குழாய் வழியாக செல்ல கட்டாயப்படுத்துகிறது என்பதை நினைவில் கொள்ளுங்கள்.

source: **Mix:** Default blend mode, alpha controls how much the object is visible.
ta: ** கலவை: ** இயல்புநிலை கலப்பு பயன்முறை, பொருள் எவ்வளவு தெரியும் என்பதை ஆல்பா கட்டுப்படுத்துகிறது.

source: **Add:** The final color of the object is added to the color of the screen, nice for flares or some fire-like effects.
ta: ** சேர்: ** பொருளின் இறுதி நிறம் திரையின் நிறத்தில் சேர்க்கப்படுகிறது, எரிப்புகளுக்கு நல்லது அல்லது சில தீ போன்ற விளைவுகள்.

source: **Sub:** The final color of the object is subtracted from the color of the screen.
ta: ** துணை: ** பொருளின் இறுதி நிறம் திரையின் நிறத்திலிருந்து கழிக்கப்படுகிறது.

source: **Mul:** The final color of the object is multiplied with the color of the screen.
ta: ** MUL: ** பொருளின் இறுதி நிறம் திரையின் நிறத்துடன் பெருக்கப்படுகிறது.

source: Cull Mode
ta: குல் பயன்முறை

source: Determines which side of the object is not drawn when backfaces are rendered:
ta: பின்னிணைப்புகள் வழங்கப்படும்போது பொருளின் எந்தப் பக்கம் வரையப்படவில்லை என்பதை தீர்மானிக்கிறது:

source: **Back:** The back of the object is culled when not visible (default).
ta: ** பின்: ** காணப்படாதபோது பொருளின் பின்புறம் குறைக்கப்படுகிறது (இயல்புநிலை).

source: **Front:** The front of the object is culled when not visible.
ta: ** முன்: ** தெரியாதபோது பொருளின் முன்புறம் குறைக்கப்படுகிறது.

source: **Disabled:** Used for objects that are double-sided (no culling is performed).
ta: ** முடக்கப்பட்டது: ** இரட்டை பக்கமாக இருக்கும் பொருள்களுக்கு பயன்படுத்தப்படுகிறது (எதுவும் செய்யப்படவில்லை).

source: By default, Blender has backface culling disabled on materials and will export materials to match how they render in Blender. This means that materials in Godot will have their cull mode set to **Disabled**. This can decrease performance since backfaces will be rendered, even when they are being culled by other faces. To resolve this, enable **Backface Culling** in Blender's Materials tab, then export the scene to glTF again.
ta: முன்னிருப்பாக, பிளெண்டர் பேக்ஃபேச் கலிங் பொருட்களில் முடக்கப்பட்டுள்ளது மற்றும் அவை பிளெண்டரில் எவ்வாறு வழங்கப்படுகின்றன என்பதை பொருத்த பொருட்களை ஏற்றுமதி செய்யும். இதன் பொருள் கோடோட்டில் உள்ள பொருட்கள் அவற்றின் குல் பயன்முறையை ** முடக்கப்பட்ட ** என அமைக்கும். இது மற்ற முகங்களால் தேர்ந்தெடுக்கப்பட்டாலும் கூட, பின்னிணைப்புகள் வழங்கப்படும் என்பதால் இது செயல்திறனைக் குறைக்கலாம். இதைத் தீர்க்க, பிளெண்டரின் பொருட்கள் தாவலில் ** பேக்ஃபேச் கலிங் ** ஐ இயக்கவும், பின்னர் காட்சியை மீண்டும் GLTF க்கு ஏற்றுமதி செய்யவும்.

source: Depth Draw Mode
ta: ஆழம் டிரா பயன்முறை

source: Specifies when depth rendering must take place.
ta: ஆழம் வழங்குதல் நடக்கும்போது குறிப்பிடுகிறது.

source: **Opaque Only (default):** Depth is only drawn for opaque objects.
ta: ** ஒளிபுகா மட்டும் (இயல்புநிலை): ** ஒளிபுகா பொருள்களுக்கு மட்டுமே ஆழம் வரையப்படுகிறது.

source: **Always:** Depth draw is drawn for both opaque and transparent objects.
ta: ** எப்போதும்: ** ஒளிபுகா மற்றும் வெளிப்படையான பொருள்களுக்கு ஆழம் டிரா வரையப்படுகிறது.

source: **Never:** No depth draw takes place (do not confuse this with the No Depth Test option below).
ta: ** ஒருபோதும்: ** ஆழம் டிரா எதுவும் நடக்காது (கீழே உள்ள ஆழமான சோதனை விருப்பத்துடன் இதை குழப்ப வேண்டாம்).

source: **Depth Pre-Pass:** For transparent objects, an opaque pass is made first with the opaque parts, then transparency is drawn above. Use this option with transparent grass or tree foliage.
ta: ** ஆழம் முன்-பாச்: ** வெளிப்படையான பொருள்களுக்கு, ஒளிபுகா பகுதிகளுடன் முதலில் ஒரு ஒளிபுகா பாச் செய்யப்படுகிறது, பின்னர் வெளிப்படைத்தன்மை மேலே வரையப்படுகிறது. வெளிப்படையான புல் அல்லது மர பசுமையாக இந்த விருப்பத்தைப் பயன்படுத்தவும்.

source: No Depth Test
ta: ஆழ சோதனை இல்லை

source: In order for close objects to appear over far away objects, depth testing is performed. Disabling it has the result of objects appearing over (or under) everything else.
ta: நெருங்கிய பொருள்கள் தொலைதூர பொருள்களில் தோன்றுவதற்கு, ஆழமான சோதனை செய்யப்படுகிறது. அதை முடக்குவது எல்லாவற்றிற்கும் மேலாக (அல்லது கீழ்) தோன்றும் பொருள்களின் விளைவாகும்.

source: Disabling this makes the most sense for drawing indicators in world space, and works very well with the *Render Priority* property of Material (see the bottom of this page).
ta: இதை முடக்குவது உலக இடத்தில் குறிகாட்டிகளை வரைவதற்கு மிகவும் அர்த்தமுள்ளதாக இருக்கிறது, மேலும் * பொருளின் வழங்கல் முன்னுரிமை * சொத்துடன் நன்றாக வேலை செய்கிறது (இந்த பக்கத்தின் கீழே பார்க்கவும்).

source: Shading
ta: நிழல்

source: Shading mode
ta: நிழல் முறை

source: Materials support three shading modes: **Per-Pixel**, **Per-Vertex**, and **Unshaded**.
ta: பொருட்கள் மூன்று நிழல் முறைகளை ஆதரிக்கின்றன: ** ஒரு படப்புள்ளி **, ** பெர்-வெர்டெக்ச் **, மற்றும் ** மாற்றப்படாத **.

source: Three spheres showing the Per-Pixel, Per-Vertex, and Unshaded modes.
ta: ஒவ்வொரு படப்புள்ளி, பெர்-வெர்டெக்ச் மற்றும் மாற்றப்படாத முறைகளைக் காட்டும் மூன்று கோளங்கள்.

source: The **Per-Pixel** shading mode calculates lighting for each pixel, and is a good fit for most use cases. However, in some cases you may want to increase performance by using another shading mode.
ta: ** ஒவ்வொரு படப்புள்ளி ** நிழல் பயன்முறையும் ஒவ்வொரு பிக்சலுக்கும் விளக்குகளை கணக்கிடுகிறது, மேலும் பெரும்பாலான பயன்பாட்டு நிகழ்வுகளுக்கு இது ஒரு பொருத்தமானது. இருப்பினும், சில சந்தர்ப்பங்களில் நீங்கள் மற்றொரு நிழல் பயன்முறையைப் பயன்படுத்தி செயல்திறனை அதிகரிக்க விரும்பலாம்.

source: The **Per-Vertex** shading mode, often called "vertex shading" or "vertex lighting", instead calculates lighting once for each vertex, and interpolates the result between each pixel.
ta: ** பெர்-வெர்டெக்ச் ** நிழல் பயன்முறை, பெரும்பாலும் "வெர்டெக்ச் நிழல்" அல்லது "வெர்டெக்ச் லைட்டிங்" என்று அழைக்கப்படுகிறது, அதற்கு பதிலாக ஒவ்வொரு வெர்டெக்சிற்கும் ஒரு முறை விளக்குகளை கணக்கிடுகிறது, மேலும் ஒவ்வொரு பிக்சலுக்கும் இடையில் முடிவை இடைக்கணிக்கிறது.
