Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/standard_material_3d.po
Languages: ta

source: On low-end or mobile devices, using per-vertex lighting can considerably increase rendering performance. When rendering several layers of transparency, such as when using particle systems, using per-vertex shading can improve performance, especially when the camera is close to particles.
ta: குறைந்த-இறுதி அல்லது மொபைல் சாதனங்களில், பெர்-வெர்டெக்ச் விளக்குகளைப் பயன்படுத்துவது வழங்குதல் செயல்திறனை கணிசமாக அதிகரிக்கும். துகள் அமைப்புகளைப் பயன்படுத்தும் போது பல அடுக்கு வெளிப்படைத்தன்மையை வழங்கும்போது, ஒவ்வொரு பெர்டெக்ச் நிழலைப் பயன்படுத்துவதும் செயல்திறனை மேம்படுத்தலாம், குறிப்பாக கேமரா துகள்களுக்கு நெருக்கமாக இருக்கும்போது.

source: You can also use per-vertex lighting to achieve a retro look.
ta: ரெட்ரோ தோற்றத்தை அடைய நீங்கள் பெர்-வெர்டெக்ச் லைட்டிங் பயன்படுத்தலாம்.

source: Two cubes with a brick texture, one shaded and one unshaded.
ta: ஒரு செங்கல் அமைப்புடன் இரண்டு க்யூப்ச், ஒரு நிழல் மற்றும் ஒரு சேடி செய்யப்படாதது.

source: Texture from `AmbientCG <https://ambientcg.com/view?id=Bricks051>`__
ta: `Ampientcg <https://ambientcg.com/view?id=bricks051> __ __ இலிருந்து அமைப்பு

source: The **Unshaded** shading mode does not calculate lighting at all. Instead, the **Albedo** color is output directly. Lights will not affect the material at all, and unshaded materials will tend to appear considerably brighter than shaded materials.
ta: ** மாற்றப்படாத ** நிழல் பயன்முறை விளக்குகளை கணக்கிடாது. அதற்கு பதிலாக, ** ஆல்பிடோ ** நிறம் நேரடியாக வெளியீடு ஆகும். விளக்குகள் பொருளைப் பாதிக்காது, மேலும் மாற்றப்படாத பொருட்கள் நிழலாடிய பொருட்களை விட கணிசமாக பிரகாசமாகத் தோன்றும்.

source: Rendering unshaded is useful for some specific visual effects. If maximum performance is needed, it can also be used for particles, or low-end or mobile devices.
ta: அசைக்கப்படாத வழங்குதல் சில குறிப்பிட்ட காட்சி விளைவுகளுக்கு பயனுள்ளதாக இருக்கும். அதிகபட்ச செயல்திறன் தேவைப்பட்டால், இது துகள்கள் அல்லது குறைந்த முடிவு அல்லது மொபைல் சாதனங்களுக்கும் பயன்படுத்தப்படலாம்.

source: Diffuse Mode
ta: பரவல் பயன்முறை

source: Specifies the algorithm used by diffuse scattering of light when hitting the object. The default is **Burley**. Other modes are also available:
ta: பொருளைத் தாக்கும் போது ஒளியை சிதறடிப்பதன் மூலம் பயன்படுத்தப்படும் வழிமுறையைக் குறிப்பிடுகிறது. இயல்புநிலை ** பர்லி **. பிற முறைகளும் கிடைக்கின்றன:

source: **Burley:** Default mode, the original Disney Principled PBS diffuse algorithm.
ta: ** பர்லி: ** இயல்புநிலை பயன்முறை, அசல் டிச்னி கொள்கை ரீதியான பிபிஎச் பரவக்கூடிய வழிமுறை.

source: **Lambert:** Is not affected by roughness.
ta: ** லம்பேர்ட்: ** கடினத்தன்மையால் பாதிக்கப்படவில்லை.

source: **Lambert Wrap:** Extends Lambert to cover more than 90 degrees when roughness increases. Works great for hair and simulating cheap subsurface scattering. This implementation is energy conserving.
ta: ** லம்பேர்ட் மடக்கு: ** கடினத்தன்மை அதிகரிக்கும் போது 90 டிகிரிக்கு மேல் மறைக்க லம்பேர்ட்டை நீட்டிக்கிறது. கூந்தலுக்கு நன்றாக வேலை செய்கிறது மற்றும் மலிவான மேற்பரப்பு சிதறலை உருவகப்படுத்துகிறது. இந்த செயல்படுத்தல் ஆற்றல் பாதுகாப்பாகும்.

source: **Toon:** Provides a hard cut for lighting, with smoothing affected by roughness. It is recommended you disable sky contribution from your environment's ambient light settings or disable ambient light in the StandardMaterial3D to achieve a better effect.
ta: ** டூன்: ** விளக்குகளுக்கு ஒரு கடினமான வெட்டு வழங்குகிறது, கடினத்தன்மையால் மென்மையாக்குகிறது. உங்கள் சூழலின் சுற்றுப்புற ஒளி அமைப்புகளிலிருந்து வானம் பங்களிப்பை முடக்க பரிந்துரைக்கப்படுகிறது அல்லது சிறந்த விளைவை அடைய ச்டாண்டர்டிமேட்டரியல் 3 டி இல் சுற்றுப்புற ஒளியை முடக்க பரிந்துரைக்கப்படுகிறது.

source: Specular Mode
ta: ஏகப்பட்ட பயன்முறை

source: Specifies how the specular blob will be rendered. The specular blob represents the shape of a light source reflected in the object.
ta: ஏகப்பட்ட குமிழ் எவ்வாறு வழங்கப்படும் என்பதைக் குறிப்பிடுகிறது. ஏகப்பட்ட குமிழ் பொருளில் பிரதிபலிக்கும் ஒளி மூலத்தின் வடிவத்தைக் குறிக்கிறது.

source: **SchlickGGX:** The most common blob used by PBR 3D engines nowadays.
ta: ** ச்க்லிக்ச்: ** இப்போதெல்லாம் பிபிஆர் 3 டி என்சின்கள் பயன்படுத்தும் பொதுவான குமிழ்.

source: **Toon:** Creates a toon blob, which changes size depending on roughness.
ta: ** டூன்: ** ஒரு டூன் குமிழியை உருவாக்குகிறது, இது கடினத்தன்மையைப் பொறுத்து அளவை மாற்றுகிறது.

source: **Disabled:** Sometimes the blob gets in the way. Begone!
ta: ** முடக்கப்பட்டது: ** சில நேரங்களில் குமிழ் வழிவகுக்கிறது. BECT!

source: Disable Ambient Light
ta: சுற்றுப்புற ஒளியை முடக்கு

source: Makes the object not receive any kind of ambient lighting that would otherwise light it.
ta: பொருள் எந்தவொரு சுற்றுப்புற விளக்குகளையும் பெறாது, இல்லையெனில் அதை ஒளிரச் செய்யும்.

source: Disable Fog
ta: மூடுபனி முடக்கு

source: Makes the object unaffected by depth-based or volumetric fog. This is useful for particles or other additively blended materials that would otherwise show the shape of the mesh (even in places where it would be invisible without the fog).
ta: ஆழம் அடிப்படையிலான அல்லது அளவீட்டு மூடுபனியால் பாதிக்கப்படாத பொருளை உருவாக்குகிறது. இது துகள்கள் அல்லது பிற கூடுதல் கலப்பு பொருட்களுக்கு பயனுள்ளதாக இருக்கும், இல்லையெனில் கண்ணி வடிவத்தைக் காண்பிக்கும் (மூடுபனி இல்லாமல் கண்ணுக்கு தெரியாத இடங்களில் கூட).

source: Vertex Color
ta: வெர்டெக்ச் நிறம்

source: This setting allows choosing what is done by default to vertex colors that come from your 3D modeling application. By default, they are ignored.
ta: உங்கள் 3D மாடலிங் பயன்பாட்டிலிருந்து வரும் வெர்டெக்ச் வண்ணங்களுக்கு இயல்புநிலையாக செய்யப்படுவதைத் தேர்ந்தெடுப்பதை இந்த அமைப்பு அனுமதிக்கிறது. இயல்பாக, அவை புறக்கணிக்கப்படுகின்றன.

source: Use as Albedo
ta: ஆல்பிடோவாக பயன்படுத்தவும்

source: Choosing this option means vertex color is used as albedo color.
ta: இந்த விருப்பத்தைத் தேர்ந்தெடுப்பது என்பது வெர்டெக்ச் வண்ணம் ஆல்பிடோ வண்ணமாக பயன்படுத்தப்படுகிறது.

source: Is sRGB
ta: SRGB

source: Most 3D modeling software will likely export vertex colors as sRGB, so toggling this option on will help them look correct.
ta: பெரும்பாலான 3 டி மாடலிங் மென்பொருள் எச்ஆர்சிபியாக வெர்டெக்ச் வண்ணங்களை ஏற்றுமதி செய்யும், எனவே இந்த விருப்பத்தை மாற்றுவது அவர்களுக்கு சரியானதாக இருக்க உதவும்.

source: Albedo
ta: ஆல்பெடோ

source: *Albedo* is the base color for the material, on which all the other settings operate. When set to *Unshaded*, this is the only color that is visible. In previous versions of Godot, this channel was named *Diffuse*. The change of name mainly happened because, in PBR (Physically Based Rendering), this color affects many more calculations than just the diffuse lighting path.
ta: * ஆல்பிடோ* என்பது பொருளின் அடிப்படை வண்ணமாகும், அதில் மற்ற அனைத்து அமைப்புகளும் செயல்படுகின்றன. *மாற்றப்படாத *என அமைக்கப்பட்டால், இதுதான் காணக்கூடிய ஒரே நிறம். கோடோட்டின் முந்தைய பதிப்புகளில், இந்த சேனலுக்கு *டிஃப்யூச் *என்று பெயரிடப்பட்டது. பெயரின் மாற்றம் முக்கியமாக நிகழ்ந்தது, ஏனெனில், பிபிஆரில் (உடல் அடிப்படையிலான ரெண்டரிங்), இந்த வண்ணம் பரவலான லைட்டிங் பாதையை விட பல கணக்கீடுகளை பாதிக்கிறது.

source: Albedo color and texture can be used together as they are multiplied.
ta: ஆல்பிடோ வண்ணம் மற்றும் அமைப்பு பெருக்கப்படுவதால் அவை ஒன்றாகப் பயன்படுத்தப்படலாம்.

source: *Alpha channel* in albedo color and texture is also used for the object transparency. If you use a color or texture with *alpha channel*, make sure to either enable transparency or *alpha scissoring* for it to work.
ta: * ஆல்பிடோ வண்ணம் மற்றும் அமைப்பில் ஆல்பா சேனல்* பொருள் வெளிப்படைத்தன்மைக்கு பயன்படுத்தப்படுகிறது. *ஆல்பா சேனல் *உடன் வண்ணம் அல்லது அமைப்பைப் பயன்படுத்தினால், அது வேலை செய்ய வெளிப்படைத்தன்மையை அல்லது *ஆல்பா கத்தரிக்கோல் *ஐ இயக்குவதை உறுதிசெய்க.

source: Metallic
ta: உலோகம்

source: Godot uses a metallic model over competing models due to its simplicity. This parameter defines how reflective the material is. The more reflective, the less diffuse/ambient light affects the material and the more light is reflected. This model is called "energy-conserving".
ta: கோடோட் அதன் எளிமை காரணமாக போட்டியிடும் மாதிரிகள் மீது ஒரு உலோக மாதிரியைப் பயன்படுத்துகிறது. இந்த அளவுரு பொருள் எவ்வளவு பிரதிபலிக்கிறது என்பதை வரையறுக்கிறது. அதிக பிரதிபலிப்பு, குறைந்த பரவல்/சுற்றுப்புற ஒளி பொருளை பாதிக்கிறது மற்றும் அதிக ஒளி பிரதிபலிக்கிறது. இந்த மாதிரி "ஆற்றல் பாதுகாக்கும்" என்று அழைக்கப்படுகிறது.

source: The *Specular* parameter is a general amount for the reflectivity (unlike *Metallic*, this is not energy-conserving, so leave it at ``0.5`` and don't touch it unless you need to).
ta: *ஏகப்பட்ட *அளவுரு என்பது பிரதிபலிப்புக்கான பொதுவான தொகையாகும் ( *உலோக *போலல்லாமல், இது ஆற்றல் பாதுகாக்கும் அல்ல, எனவே அதை `` 0.5`` என்ற இடத்தில் விடுங்கள், உங்களுக்குத் தேவைப்பட்டால் அதைத் தொட வேண்டாம்).

source: The minimum internal reflectivity is ``0.04``, so it's impossible to make a material completely unreflective, just like in real life.
ta: குறைந்தபட்ச உள் பிரதிபலிப்பு `` 0.04`` ஆகும், எனவே நிச வாழ்க்கையைப் போலவே ஒரு பொருளை முழுவதுமாக மறுபரிசீலனை செய்ய முடியாது.

source: Roughness
ta: கடினத்தன்மை

source: *Roughness* affects the way reflection happens. A value of ``0`` makes it a perfect mirror while a value of ``1`` completely blurs the reflection (simulating natural microsurfacing). Most common types of materials can be achieved with the right combination of *Metallic* and *Roughness*.
ta: * கடினத்தன்மை* பிரதிபலிப்பு நடக்கும் விதத்தை பாதிக்கிறது. `` 0`` இன் மதிப்பு இது ஒரு சரியான கண்ணாடியாக அமைகிறது, அதே நேரத்தில் `` 1`` மதிப்பு பிரதிபலிப்பை முற்றிலுமாக மழுங்கடிக்கிறது (இயற்கையான மைக்ரோ சர்ஃபேசிங்கை உருவகப்படுத்துதல்). *உலோக *மற்றும் *கடினத்தன்மை *ஆகியவற்றின் சரியான கலவையுடன் மிகவும் பொதுவான வகை பொருட்களை அடைய முடியும்.

source: Emission
ta: உமிழ்வு

source: *Emission* specifies how much light is emitted by the material (keep in mind this does not include light surrounding geometry unless :ref:`VoxelGI <doc_using_voxel_gi>` or :ref:`SDFGI <doc_using_sdfgi>` are used). This value is added to the resulting final image and is not affected by other lighting in the scene.
ta: . இதன் விளைவாக வரும் இறுதி படத்தில் இந்த மதிப்பு சேர்க்கப்பட்டுள்ளது மற்றும் காட்சியில் உள்ள பிற விளக்குகளால் பாதிக்கப்படாது.

source: Normal map
ta: சாதாரண வரைபடம்

source: Normal mapping allows you to set a texture that represents finer shape detail. This does not modify geometry, only the incident angle for light. In Godot, only the red and green channels of normal maps are used for better compression and wider compatibility.
ta: இயல்பான மேப்பிங் சிறந்த வடிவ விவரங்களைக் குறிக்கும் ஒரு அமைப்பை அமைக்க உங்களை அனுமதிக்கிறது. இது வடிவவியலை மாற்றாது, ஒளிக்கான சம்பவ கோணம் மட்டுமே. கோடோட்டில், சாதாரண வரைபடங்களின் சிவப்பு மற்றும் பச்சை சேனல்கள் மட்டுமே சிறந்த சுருக்கத்திற்கும் பரந்த பொருந்தக்கூடிய தன்மைக்கும் பயன்படுத்தப்படுகின்றன.

source: Godot requires the normal map to use the X+, Y+ and Z+ coordinates, this is known as OpenGL style. If you've imported a material made to be used with another engine it may be DirectX style, in which case the normal map needs to be converted so its Y axis is flipped.
ta: கோடோட் x+, y+ மற்றும் z+ ஆயத்தொகுதிகளைப் பயன்படுத்த சாதாரண வரைபடம் தேவைப்படுகிறது, இது ஓபன்சிஎல் பாணி என்று அழைக்கப்படுகிறது. மற்றொரு இயந்திரத்துடன் பயன்படுத்தப்பட்ட ஒரு பொருளை நீங்கள் இறக்குமதி செய்திருந்தால், அது டைரக்ட்எக்ச் பாணியாக இருக்கலாம், இந்த விசயத்தில் சாதாரண வரைபடத்தை மாற்ற வேண்டும், எனவே அதன் ஒய் அச்சு புரட்டப்படுகிறது.

source: More information about normal maps (including a coordinate order table for popular engines) can be found `here <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.
ta: சாதாரண வரைபடங்களைப் பற்றிய கூடுதல் தகவல்களை (பிரபலமான இயந்திரங்களுக்கான ஒருங்கிணைப்பு ஆர்டர் அட்டவணை உட்பட) `இங்கே <http://wiki.polycount.

source: Rim
ta: ரிம்

source: Some fabrics have small micro-fur that causes light to scatter around it. Godot emulates this with the *Rim* parameter. Unlike other rim lighting implementations, which just use the emission channel, this one actually takes light into account (no light means no rim). This makes the effect considerably more believable.
ta: சில துணிகளில் சிறிய மைக்ரோ-ஃபர் உள்ளது, அதைச் சுற்றி ஒளி சிதற காரணமாகிறது. கோடோட் இதை * விளிம்பு * அளவுருவுடன் பின்பற்றுகிறார். உமிழ்வு சேனலைப் பயன்படுத்தும் மற்ற ரிம் லைட்டிங் செயலாக்கங்களைப் போலல்லாமல், இது உண்மையில் ஒளியை கணக்கில் எடுத்துக்கொள்கிறது (ஒளி இல்லை என்றால் விளிம்பு இல்லை). இது விளைவை கணிசமாக நம்பக்கூடியதாக ஆக்குகிறது.

source: Rim size depends on roughness, and there is a special parameter to specify how it must be colored. If *Tint* is ``0``, the color of the light is used for the rim. If *Tint* is ``1``, then the albedo of the material is used. Using intermediate values generally works best.
ta: விளிம்பு அளவு கடினத்தன்மையைப் பொறுத்தது, மேலும் அது எவ்வாறு வண்ணமயமாக இருக்க வேண்டும் என்பதைக் குறிப்பிட ஒரு சிறப்பு அளவுரு உள்ளது. * டின்ட் * `` 0`` என்றால், ஒளியின் நிறம் விளிம்புக்கு பயன்படுத்தப்படுகிறது. * டின்ட் * `` 1`` என்றால், பொருளின் ஆல்பிடோ பயன்படுத்தப்படுகிறது. இடைநிலை மதிப்புகளைப் பயன்படுத்துவது பொதுவாக சிறப்பாக செயல்படுகிறது.

source: Clearcoat
ta: கிளியர் கோட்

source: The *Clearcoat* parameter is used to add a secondary pass of transparent coat to the material. This is common in car paint and toys. In practice, it's a smaller specular blob added on top of the existing material.
ta: * கிளியர் கோட் * அளவுரு பொருளுக்கு வெளிப்படையான கோட்டின் இரண்டாம் நிலை பாசைச் சேர்க்கப் பயன்படுகிறது. கார் வண்ணப்பூச்சு மற்றும் பொம்மைகளில் இது பொதுவானது. நடைமுறையில், இது இருக்கும் பொருளின் மேல் சேர்க்கப்பட்ட ஒரு சிறிய ஏகப்பட்ட குமிழ்.

source: Anisotropy
ta: அனிசோட்ரோபி

source: This changes the shape of the specular blob and aligns it to tangent space. Anisotropy is commonly used with hair, or to make materials such as brushed aluminum more realistic. It works especially well when combined with flowmaps.
ta: இது ஏகப்பட்ட குமிழியின் வடிவத்தை மாற்றி அதை தொடுகோடு இடத்துடன் ஒருங்கிணைக்கிறது. அனிசோட்ரோபி பொதுவாக கூந்தலுடன் பயன்படுத்தப்படுகிறது, அல்லது பிரச்டு அலுமினியம் போன்ற பொருட்களை மிகவும் யதார்த்தமாக்குகிறது. ஃப்ளோமாப்களுடன் இணைந்தால் இது குறிப்பாக நன்றாக வேலை செய்கிறது.

source: Ambient Occlusion
ta: சுற்றுப்புற மறுப்பு

source: It is possible to specify a baked ambient occlusion map. This map affects how much ambient light reaches each surface of the object (it does not affect direct light by default). While it is possible to use Screen-Space Ambient Occlusion (SSAO) to generate ambient occlusion, nothing beats the quality of a well-baked AO map. It is recommended to bake ambient occlusion whenever possible.
ta: வேகவைத்த சுற்றுப்புற மறுப்பு வரைபடத்தைக் குறிப்பிட முடியும். இந்த வரைபடம் பொருளின் ஒவ்வொரு மேற்பரப்பையும் எவ்வளவு சுற்றுப்புற ஒளி அடைகிறது என்பதை பாதிக்கிறது (இது இயல்பாக நேரடி ஒளியை பாதிக்காது). சுற்றுப்புற மறைவை உருவாக்க ச்கிரீன்-ச்பேச் சுற்றுப்புற மறைமுகத்தை (எச்.எச்.ஏ.ஓ) பயன்படுத்த முடியும் என்றாலும், நன்கு சுடப்பட்ட AO வரைபடத்தின் தரத்தை எதுவும் துடிக்கவில்லை. முடிந்த போதெல்லாம் சுற்றுப்புற இடையூறுகளை சுட பரிந்துரைக்கப்படுகிறது.

source: Height
ta: உயரம்

source: Setting a height map on a material produces a ray-marched search to emulate the proper displacement of cavities along the view direction. This only creates an illusion of depth, and does not add real geometry — for a height map shape used for physics collision (such as terrain), see :ref:`class_HeightMapShape3D`. It may not work for complex objects, but it produces a realistic depth effect for textures. For best results, *Height* should be used together with normal mapping.
ta: ஒரு பொருளில் உயர வரைபடத்தை அமைப்பது, பார்வை திசையில் துவாரங்களின் சரியான இடப்பெயர்ச்சியைப் பின்பற்றுவதற்கு ஒரு கதிர்-அணிவகுப்பு தேடலை உருவாக்குகிறது. இது ஆழத்தின் ஒரு மாயையை மட்டுமே உருவாக்குகிறது, மேலும் உண்மையான வடிவவியலைச் சேர்க்காது - இயற்பியல் மோதலுக்குப் பயன்படுத்தப்படும் உயர வரைபட வடிவத்திற்கு (நிலப்பரப்பு போன்றவை), காண்க: குறிப்பு: `class_heightmapshape3d`. இது சிக்கலான பொருள்களுக்கு வேலை செய்யாது, ஆனால் இது அமைப்புகளுக்கு ஒரு யதார்த்தமான ஆழமான விளைவை உருவாக்குகிறது. சிறந்த முடிவுகளுக்கு, * உயரம் * சாதாரண மேப்பிங்குடன் பயன்படுத்தப்பட வேண்டும்.

source: Subsurface Scattering
ta: மேற்பரப்பு சிதறல்

source: *This is only available in the Forward+ renderer, not the Mobile or Compatibility renderers.*
ta: *இது முன்னோக்கி+ ரெண்டரரில் மட்டுமே கிடைக்கிறது, மொபைல் அல்லது பொருந்தக்கூடிய ரெண்டரர்கள் அல்ல.*

source: This effect emulates light that penetrates an object's surface, is scattered, and then comes out. It is useful to create realistic skin, marble, colored liquids, etc.
ta: இந்த விளைவு ஒரு பொருளின் மேற்பரப்பில் ஊடுருவி, சிதறடிக்கப்பட்டு, பின்னர் வெளியே வரும் ஒளியைப் பின்பற்றுகிறது. யதார்த்தமான தோல், பளிங்கு, வண்ண திரவங்கள் போன்றவற்றை உருவாக்க இது பயனுள்ளதாக இருக்கும்.

source: Back Lighting
ta: பின் விளக்குகள்

source: This controls how much light from the lit side (visible to light) is transferred to the dark side (opposite from the light). This works well for thin objects such as plant leaves, grass, human ears, etc.
ta: இது எரியும் பக்கத்திலிருந்து (ஒளிக்கு தெரியும்) எவ்வளவு ஒளி இருண்ட பக்கத்திற்கு மாற்றப்படுகிறது (ஒளியிலிருந்து எதிர்) மாற்றப்படுகிறது. தாவர இலைகள், புல், மனித காதுகள் போன்ற மெல்லிய பொருள்களுக்கு இது நன்றாக வேலை செய்கிறது.

source: Refraction
ta: ஒளித்திரிபு

source: When refraction is enabled, Godot attempts to fetch information from behind the object being rendered. This allows distorting the transparency in a way similar to refraction in real life.
ta: ஒளிவிலகல் இயக்கப்பட்டால், கோடோட் வழங்கப்படும் பொருளின் பின்னால் இருந்து தகவல்களைப் பெற முயற்சிக்கிறது. இது நிச வாழ்க்கையில் ஒளிவிலகலுக்கு ஒத்த வகையில் வெளிப்படைத்தன்மையை சிதைக்க அனுமதிக்கிறது.

source: Remember to use a transparent albedo texture (or reduce the albedo color's alpha channel) to make refraction visible, as refraction relies on transparency to have a visible effect.
ta: ஒளிவிலகல் காணக்கூடிய வகையில் ஒரு வெளிப்படையான ஆல்பிடோ அமைப்பைப் பயன்படுத்த நினைவில் கொள்ளுங்கள் (அல்லது ஆல்பிடோ வண்ணத்தின் ஆல்பா சேனலைக் குறைக்கவும்), ஏனெனில் ஒளிவிலகல் வெளிப்படைத்தன்மையை நம்பியுள்ளது.

source: Refraction also takes the material roughness into account. Higher roughness values will make the objects behind the refraction look blurrier, which simulates real life behavior. If you can't see behind the object when refraction is enabled and albedo transparency is reduced, decrease the material's **Roughness** value.
ta: ஒளிவிலகல் பொருள் கடினத்தன்மையையும் கணக்கில் எடுத்துக்கொள்கிறது. அதிக கரடுமுரடான மதிப்புகள் ஒளிவிலகல் பின்னால் உள்ள பொருள்களை மங்கலானதாக மாற்றும், இது நிச வாழ்க்கை நடத்தையை உருவகப்படுத்துகிறது. ஒளிவிலகல் இயக்கப்பட்டதும், ஆல்பிடோ வெளிப்படைத்தன்மை குறையும் போது பொருளின் பின்னால் நீங்கள் பார்க்க முடியாவிட்டால், பொருளின் ** கடினத்தன்மை ** மதிப்பைக் குறைக்கவும்.

source: A normal map can optionally be specified in the **Refraction Texture** property to allow distorting the refraction's direction on a per-pixel basis.
ta: ஒரு படப்புள்ளி அடிப்படையில் ஒளிவிலகல் திசையை சிதைக்க அனுமதிக்க ** ஒளிவிலகல் அமைப்பு ** சொத்தில் ஒரு சாதாரண வரைபடத்தை விருப்பமாக குறிப்பிடலாம்.

source: Refraction is implemented as a screen-space effect and forces the material to be transparent. This makes the effect relatively fast, but this results in some limitations:
ta: ஒளிவிலகல் ஒரு திரை-விண்வெளி விளைவாக செயல்படுத்தப்படுகிறது மற்றும் பொருள் வெளிப்படையானதாக இருக்கும்படி கட்டாயப்படுத்துகிறது. இது விளைவை ஒப்பீட்டளவில் வேகமாக ஆக்குகிறது, ஆனால் இது சில வரம்புகளை விளைவிக்கிறது:

source: :ref:`Transparency sorting <doc_3d_rendering_limitations_transparency_sorting>` issues may occur.
ta: :ref:`Transparency sorting <doc_3d_rendering_limitations_transparency_sorting>` issues சி-வைகாசி occur.

source: The refractive material cannot refract onto itself, or onto other transparent materials. A refractive material behind another transparent material will be invisible.
ta: ஒளிவிலகல் பொருள் தன்னைத்தானே, அல்லது பிற வெளிப்படையான பொருட்களின் மீது பயன்படுத்த முடியாது. மற்றொரு வெளிப்படையான பொருளின் பின்னால் ஒரு ஒளிவிலகல் பொருள் கண்ணுக்கு தெரியாததாக இருக்கும்.

source: Off-screen objects cannot appear in the refraction. This is most noticeable with high refraction strength values.
ta: ஆஃப்-ச்கிரீன் பொருள்கள் ஒளிவிலகலில் தோன்ற முடியாது. இது உயர் ஒளிவிலகல் வலிமை மதிப்புகளுடன் மிகவும் கவனிக்கப்படுகிறது.

source: Opaque materials in front of the refractive material will appear to have "refracted" edges, even though they shouldn't.
ta: ஒளிவிலகல் பொருளுக்கு முன்னால் உள்ள ஒளிபுகா பொருட்கள் "ஒளிவிலகல்" விளிம்புகளைக் கொண்டிருப்பதாகத் தோன்றும்.

source: Detail
ta: விவரம்

source: Godot allows using secondary albedo and normal maps to generate a detail texture, which can be blended in many ways. By combining this with secondary UV or triplanar modes, many interesting textures can be achieved.
ta: ஒரு விரிவான அமைப்பை உருவாக்க இரண்டாம் நிலை ஆல்பிடோ மற்றும் சாதாரண வரைபடங்களைப் பயன்படுத்துவதை கோடோட் அனுமதிக்கிறது, இது பல வழிகளில் கலக்கப்படலாம். இதை இரண்டாம் நிலை புற ஊதா அல்லது டிரிப்ளானார் முறைகளுடன் இணைப்பதன் மூலம், பல சுவையான அமைப்புகளை அடைய முடியும்.

source: There are several settings that control how detail is used.
ta: விவரம் எவ்வாறு பயன்படுத்தப்படுகிறது என்பதைக் கட்டுப்படுத்தும் பல அமைப்புகள் உள்ளன.

source: Mask: The detail mask is a black and white image used to control where the blending takes place on a texture. White is for the detail textures, Black is for the regular material textures, different shades of gray are for partial blending of the material textures and detail textures.
ta: முகமூடி: விவரம் முகமூடி என்பது ஒரு கருப்பு மற்றும் வெள்ளை படமாகும், இது ஒரு அமைப்பில் கலப்பு எங்கு நடைபெறுகிறது என்பதைக் கட்டுப்படுத்த பயன்படுகிறது. வெள்ளை என்பது விரிவான அமைப்புகளுக்கு, கருப்பு என்பது வழக்கமான பொருள் அமைப்புகளுக்கு, சாம்பல் நிறத்தின் வெவ்வேறு நிழல்கள் பொருள் அமைப்புகள் மற்றும் விவரம் அமைப்புகளின் பகுதி கலப்புக்கு.

source: Blend Mode: These four modes control how the textures are blended together.
ta: கலப்பு பயன்முறை: இந்த நான்கு முறைகள் அமைப்புகள் எவ்வாறு ஒன்றாக கலக்கப்படுகின்றன என்பதைக் கட்டுப்படுத்துகின்றன.

source: Mix: Combines pixel values of both textures. At black, only show the material texture, at white, only show the detail texture. Values of gray create a smooth blend between the two.
ta: கலவை: இரண்டு அமைப்புகளின் படப்புள்ளி மதிப்புகளை ஒருங்கிணைக்கிறது. கருப்பு நிறத்தில், பொருள் அமைப்பை மட்டுமே காட்டுங்கள், வெள்ளை நிறத்தில், விவரம் அமைப்பைக் காட்டுங்கள். சாம்பல் நிறத்தின் மதிப்புகள் இரண்டிற்கும் இடையே ஒரு மென்மையான கலவையை உருவாக்குகின்றன.

source: Add: Adds pixel values of one Texture with the other. Unlike mix mode both textures are completely mixed at white parts of a mask and not at gray parts. The original texture is mostly unchanged at black
ta: சேர்: ஒரு அமைப்பின் படப்புள்ளி மதிப்புகளை மற்றொன்றுடன் சேர்க்கிறது. கலவை பயன்முறையைப் போலன்றி, இரண்டு அமைப்புகளும் ஒரு முகமூடியின் வெள்ளை பகுதிகளில் முழுமையாக கலக்கப்படுகின்றன, ஆனால் சாம்பல் பகுதிகளில் அல்ல. அசல் அமைப்பு பெரும்பாலும் கருப்பு நிறத்தில் மாறாது

source: Sub: Subtracts pixel values of one texture with the other. The second texture is completely subtracted at white parts of a mask with only a little subtraction in black parts, gray parts being different levels of subtraction based on the exact texture.
ta: துணை: ஒரு அமைப்பின் படப்புள்ளி மதிப்புகளை மற்றொன்றுடன் கழிக்கிறது. இரண்டாவது அமைப்பு ஒரு முகமூடியின் வெள்ளை பகுதிகளில் முற்றிலும் கழிக்கப்படுகிறது, இது கருப்பு பகுதிகளில் ஒரு சிறிய கழித்தல் மட்டுமே, சாம்பல் பாகங்கள் சரியான அமைப்பின் அடிப்படையில் வெவ்வேறு நிலைகளில் கழித்தல்.

source: Mul: Multiplies the RGB channel numbers for each pixel from the top texture with the values for the corresponding pixel from the bottom texture.
ta: MUL: மேல் அமைப்பிலிருந்து ஒவ்வொரு பிக்சலுக்கும் RGB சேனல் எண்களை கீழே அமைப்பிலிருந்து தொடர்புடைய பிக்சலுக்கான மதிப்புகளுடன் பெருக்குகிறது.
