Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_gridmaps.po
Languages: ga, it, pl, pt_br, ru, ta, uk, zh_hant

source: Using GridMaps
ga: Ag baint úsáide as GridMaps
it: Utilizzo di GridMap
pt_br: Usando GridMaps
ru: Использование GridMaps (карты тайлов)
ta: கிரிட்மேப்சைப் பயன்படுத்துதல்
uk: Використання GridMap (Карт ґратки)
zh_hant: 使用圖塊地圖

source: Introduction
ga: Réamhrá
it: Introduzione
pl: Wprowadzenie
pt_br: Introdução
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_hant: 前言

source: :ref:`Gridmaps <class_GridMap>` are a tool for creating 3D game levels, similar to the way :ref:`TileMap <doc_using_tilemaps>` works in 2D. You start with a predefined collection of 3D meshes (a :ref:`class_MeshLibrary`) that can be placed on a grid, as if you were building a level with an unlimited amount of Lego blocks.
ga: :ref:`Gridmaps <class_GridMap>` is uirlis iad chun leibhéil cluiche 3D a chruthú, cosúil leis an mbealach :ref:`TileMap <doc_using_tilemaps>` oibríonn i 2D. Tosaíonn tú le bailiúchán réamhshainithe de mhogaill 3D (a :ref:`class_MeshLibrary`) is féidir a chur ar eangach, amhail is dá mbeadh tú ag tógáil leibhéal le méid neamhtheoranta bloic Lego.
ru: :ref:`Gridmaps <class_GridMap>` - это инструмент для создания 3D уровней игры, подобно тому, как :ref:`TileMap <doc_using_tilemaps>` работает в 2D. Вы начинаете с предопределённой коллекции 3D сеток (библиотека :ref:`class_MeshLibrary`), которые могут быть размещены на сетке, как если бы вы строили уровень из неограниченного количества блоков Lego.
ta: . நீங்கள் வரம்பற்ற அளவு லெகோ தொகுதிகளுடன் ஒரு நிலையை உருவாக்குவது போல, ஒரு கட்டத்தில் வைக்கக்கூடிய 3D மெச்களின் முன் வரையறுக்கப்பட்ட சேகரிப்புடன் (a: ref: `class_meshlibrary`) தொடங்குகிறீர்கள்.
uk: :ref:`Gridmaps <class_GridMap>` є інструментом для створення 3D-рівнів гри, подібно до того, як :ref:`TileMap <doc_using_tilemaps>` працює у 2D. Ви починаєте з попередньо визначеної колекції 3D-сіток (a :ref:`class_MeshLibrary`) які можна розмістити на сітці, ніби ви будуєте рівень із необмеженої кількості блоків Lego.
zh_hant: :ref:`Gridmaps <class_GridMap>` 是一種用於建立3D遊戲關卡的工具, 方式類似於2D中使用 :ref:`TileMap <doc_using_tilemaps>` . 使用一個定義好的可以放在一個網格中的 3D mesh (a :ref:`class_MeshLibrary`) (譯注,grid和mesh都譯作網格, 這裡為了清晰,mesh直接使用英文,grid則譯作網格)物件集合搭建關卡, 就像您使用無限多數量的樂高積木搭建世界一樣.

source: Collisions and navigation can also be added to the meshes, just like you would do with the tiles of a tilemap.
ga: Is féidir imbhuailtí agus nascleanúint a chur leis na mogalra freisin, díreach mar a dhéanfá le tíleanna téileapa.
pl: Kolizje i nawigacja mogą być również dodawane do siatki, tak jak w przypadku tile z tilemap.
ru: Столкновения и навигацию также можно добавить к сеткам, как это делается с тайлами tilemap`ов.
ta: ஒரு டில்மேப்பின் ஓடுகளை நீங்கள் செய்வது போலவே, மோதல்களும் வழிசெலுத்தலும் மெச்களில் சேர்க்கப்படலாம்.
uk: Як і плиткам з карти плиток, мешам також можна додати зіткнення та навігацію.
zh_hant: 就像使用tilemap的tile一樣, 碰撞和導覽也可以新增到網格中.

source: Example project
ga: Tionscadal sampla
it: Progetto d'esempio
pt_br: Exemplo de projeto
ru: Пример проекта
ta: எடுத்துக்காட்டு திட்டம்
uk: Приклад проекту
zh_hant: 範例專案

source: To learn how GridMaps work, start by downloading the sample project: `gridmap_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/gridmap_starter.zip>`_.
ga: Chun foghlaim conas a oibríonn GridMaps, cuir tús leis an tionscadal samplach a íoslódáil: `gridmap_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/gridmap_starter.zip> `_.
it: Per imparare come funzionano le GridMap, inizia scaricando il progetto di esempio: `gridmap_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/gridmap_starter.zip>`_.
ru: Чтобы узнать как работают GridMaps, скачайте тестовый проект : `gridmap_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/gridmap_starter.zip>`_.
ta: கிரிட்மேப்ச் எவ்வாறு செயல்படுகிறது என்பதை அறிய, மாதிரி திட்டத்தைப் பதிவிறக்குவதன் மூலம் தொடங்கவும்: `` kirdmap_starter.zip <https://github.com/godotengine/godotengs-project-starters/releaseases/latownload/latest-4.x/gridmap_starter.zip> `_.
uk: Щоб дізнатися, як працюють GridMaps, почніть із завантаження прикладу проекту: `gridmap_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/gridmap_starter.zip>`_.
zh_hant: 除了這份說明文件，你可能也會想看看 `Godot Demo 專案 <https://github.com/godotengine/godot-demo-projects>`_ 。

source: Unzip this project and add it to the Project Manager using the "Import" button. You may get a popup saying that it needs to be converted to a newer Godot version, click **Convert project.godot**.
ru: Распакуйте этот проект и добавьте его в Менеджер проектов, нажав кнопку "Import". Возможно, появится всплывающее окно с предложением конвертировать проект в более новую версию Godot. Нажмите **Convert project.godot**.
ta: இந்த திட்டத்தை அவிழ்த்து, "இறக்குமதி" பொத்தானைப் பயன்படுத்தி திட்ட மேலாளரிடம் சேர்க்கவும். இது ஒரு புதிய கோடோட் பதிப்பாக மாற்றப்பட வேண்டும் என்று ஒரு பாப்அப்பைப் பெறலாம், ** திட்டத்தை மாற்றவும்.
uk: Розпакуйте цей проєкт і додайте його до Менеджера проєктів за допомогою кнопки «Імпорт». Ви можете отримати спливаюче вікно з повідомленням про необхідність конвертації в новішу версію Godot, натисніть **Конвертувати project.godot**.
zh_hant: 解壓此專案後，使用「Import」按鈕將其加入專案管理器。若跳出提示需要轉換到較新的 Godot 版本，請點擊 **Convert project.godot**。

source: Creating a MeshLibrary
ga: MeshLibrary a chruthú
pl: Tworzenie MeshLibrary
pt_br: Criando uma MeshLibrary
ru: Создание MeshLibrary
ta: ஒரு மெச்லிபரியை உருவாக்குதல்
uk: Створення MeshLibrary (Бібліотеки мешів)
zh_hant: 建立 MeshLibrary

source: To begin, you need a :ref:`class_MeshLibrary`, which is a collection of individual meshes that can be used in the gridmap. Open the "mesh_library_source.tscn" scene to see an example of how to set up the mesh library.
ga: Chun tús a chur, teastaíonn a:ref: `Class_MeshLibrary` uait, ar bailiúchán mogalra aonair is féidir a úsáid sa gridmap. Oscail an radharc “mesh_library_source.tscn” chun sampla a fheiceáil de conas an leabharlann mogalra a chur ar bun.
ru: Для начала вам понадобится :ref:`class_MeshLibrary`, которая представляет собой коллекцию отдельных сеток, которые могут быть использованы в gridmap. Откройте сцену "mesh_library_source.tscn", чтобы посмотреть пример настройки библиотеки сеток.
ta: தொடங்க, உங்களுக்கு ஒரு: ref: `class_meshlibrary`, இது கிரிட்மேப்பில் பயன்படுத்தக்கூடிய தனிப்பட்ட மெச்களின் தொகுப்பாகும். மெச் நூலகத்தை எவ்வாறு அமைப்பது என்பதற்கான எடுத்துக்காட்டு காண "mesh_library_source.tscn" காட்சியைத் திறக்கவும்.
uk: Для початку вам потрібна :ref:`class_MeshLibrary`, яка є колекцією окремих сіток, які можна використовувати в карті сітки. Відкрийте сцену "mesh_library_source.tscn", щоб побачити приклад налаштування бібліотеки сіток.
zh_hant: 首先，您需要一個 :ref:`class_MeshLibrary`，它是可以在網格地圖中使用的 Mesh 的集合。打開“MeshLibrary_Source.tscn”場景以查看如何設定網格庫的範例。

source: As you can see, this scene has a :ref:`class_Node3D` node as its root, and a number of :ref:`class_MeshInstance3D` node children.
ga: Mar a fheiceann tú, tá nód a:ref: `Class_Node3d` ag an radharc seo mar fhréamh, agus roinnt leanaí nód: ref: `Class_MeshInstance3d`.
ru: Как вы можете видеть, в этой сцене :ref:`class_Node3D` - корневой узел, с ним - несколько дочерних :ref:`class_MeshInstance3D` узлов.
ta: நீங்கள் பார்க்க முடியும் என, இந்த காட்சியில் ஒரு: குறிப்பு: `class_node3d` முனை அதன் வேராக உள்ளது, மேலும் பல: ref:` class_meshinstance3d` முனை குழந்தைகள்.
uk: Як бачите, ця сцена має кореневий вузол :ref:`class_Node3D` і кілька дочірніх вузлів :ref:`class_MeshInstance3D`.
zh_hant: 可以看到, 這個場景有一個 :ref:`class_Node3D` 節點作為它的根, 以及一些 :ref:`class_MeshInstance3D` 子節點.

source: If you don't need any physics in your scene, then you're done. However, in most cases you'll want to assign collision bodies to the meshes.
ga: Mura dteastaíonn aon fhisic uait i do radharc, ansin tá tú déanta. Mar sin féin, i bhformhór na gcásanna beidh tú ag iarraidh comhlachtaí imbhuailte a shannadh do na mogalra.
pl: Jeśli nie potrzebujesz żadnej fizyki w swojej scenie, to już jesteś gotowy. Jednak w większości przypadków będziesz chciał przypisać kolizyjne obiekty do siatek.
ru: Если вам не нужна физика в вашей сцене, то всё готово. Однако в большинстве случаев вы захотите назначить тела столкновения сеткам.
ta: உங்கள் காட்சியில் உங்களுக்கு எந்த இயற்பியல் தேவையில்லை என்றால், நீங்கள் முடித்துவிட்டீர்கள். இருப்பினும், பெரும்பாலான சந்தர்ப்பங்களில் நீங்கள் மோதல் உடல்களை மெச்களுக்கு ஒதுக்க விரும்புவீர்கள்.
uk: Якщо вам не потрібна фізика у сцені, то ви закінчили. Однак у більшості випадків вам захочеться призначити мешам тіла зіткнення.
zh_hant: 如果您的場景中不需要任何物理, 那麼到這裡就完成了. 但是, 在大多數情況下, 您還需要給網格指定碰撞體.

source: Collisions
ga: Imbhuailtí
it: Collisioni
pl: Kolizje
pt_br: Colisões
ru: Коллизии
ta: மோதல்கள்
uk: Зіткнення
zh_hant: 碰撞

source: You can manually assign a :ref:`class_StaticBody3D` and :ref:`class_CollisionShape3D` to each mesh. Alternatively, you can use the "Mesh" menu to automatically create the collision body based on the mesh data.
ga: Is féidir leat a:ref: `Class_StaticBody3d` agus:ref: `Class_CollisionShape3D` a shannadh de láimh do gach mogalra. Nó is féidir leat an roghchlár “Mogalra” a úsáid chun an corp imbhuailte a chruthú go huathoibríoch bunaithe ar na sonraí mogalra.
ru: Вы можете вручную назначить :ref:`class_StaticBody3D` и :ref:`class_CollisionShape3D` для каждой сетки. В качестве альтернативы можно использовать меню "Mesh" для автоматического создания тела столкновения на основе данных сетки.
ta: நீங்கள் ஒரு: ref: `class_staticbody3d` மற்றும்: ref:` class_collesshape3d` ஒவ்வொரு கண்ணி. மாற்றாக, கண்ணி தரவின் அடிப்படையில் மோதல் உடலை தானாக உருவாக்க "மெச்" மெனுவைப் பயன்படுத்தலாம்.
uk: Ви можете вручну призначити :ref:`class_StaticBody3D` і :ref:`class_CollisionShape3D` кожній сітці. Крім того, ви можете використовувати меню «Сітка», щоб автоматично створити тіло зіткнення на основі даних сітки.
zh_hant: 您可以手動為每個 Mesh 指定 :ref:`class_StaticBody3D` 和 :ref:`class_CollisionShape3D` 。或者，您可以使用“網格”功能表根據 "Mesh" 資料自動建立碰撞體。

source: Note that a "Convex" collision body will work better for simple meshes. For more complex shapes, select "Create Trimesh Static Body". Once each mesh has a physics body and collision shape assigned, your mesh library is ready to be used.
ga: Tabhair faoi deara go n-oibreoidh corp imbhuailte “Convex” níos fearr le haghaidh mogalra simplí. Le haghaidh cruthanna níos casta, roghnaigh “Cruthaigh Comhlacht Statach Trimesh”. Nuair a bheidh corp fisice agus cruth imbhuailte sannta do gach mogalra, tá do leabharlann mogalra réidh le húsáid.
pl: Zwróć uwagę, że kolizja "Convex" będzie działała lepiej w przypadku prostych siatek. W przypadku bardziej złożonych kształtów wybierz opcję "Utwórz statyczne ciało trójsiatki". Gdy każda siatka ma przypisany ciało fizyczne i kształt kolizji, twoja biblioteka siatek jest gotowa do użycia.
ru: Обратите внимание, что тело столкновения "Convex" будет лучше работать для простых сеток. Для более сложных форм выберите "Create Trimesh Static Body". После того как каждой сетке назначено физическое тело и форма столкновения, ваша библиотека сеток готова к использованию.
ta: "குவிந்த" மோதல் உடல் எளிய மெச்களுக்கு சிறப்பாக செயல்படும் என்பதை நினைவில் கொள்க. மிகவும் சிக்கலான வடிவங்களுக்கு, "டிரிமேச் நிலையான உடலை உருவாக்கு" என்பதைத் தேர்ந்தெடுக்கவும். ஒவ்வொரு கண்ணி ஒரு இயற்பியல் உடல் மற்றும் மோதல் வடிவம் ஒதுக்கப்பட்டவுடன், உங்கள் கண்ணி நூலகம் பயன்படுத்த தயாராக உள்ளது.
uk: Відзначимо, що *Опукле* тіло зіткнення буде краще працювати для простих мешів (сіток). Для складніших фігур виберіть **Створити увігнуте статичне тіло**. Після того, як кожен меш отримає фізичне тіло та форму зіткнення, ваша бібліотека мешів буде готова до використання.
zh_hant: 請注意，“凸”（Convex）碰撞體對於簡單 Mesh 效果更好。對於更複雜的形狀，請選擇“建立三角網格靜態體”。一旦每個網格都分配了物理主體和碰撞形狀，就可以使用網格庫了。

source: Materials
ga: Ábhair
it: Materiali
pl: Materiały
pt_br: Materiais
ru: Материалы
ta: பொருட்கள்
uk: Матеріали
zh_hant: 材質

source: Only the materials from within the meshes are used when generating the mesh library. Materials set on the node will be ignored.
ga: Ní úsáidtear ach na hábhair ó na mogalra agus an leabharlann mogalra á ghiniúint. Déanfar neamhaird ar ábhair atá leagtha síos ar an nód.
pt_br: Somente materiais no interior das malhas serão usados quando gerado a biblioteca de malhas. Materiais definidos no Nó serão ignorados.
ru: При генерации библиотеки сеток используются только материалы из сеток. Материалы, установленные на узле, игнорируются.
ta: கண்ணி நூலகத்தை உருவாக்கும் போது மெச்களுக்குள் இருந்து வந்த பொருட்கள் மட்டுமே பயன்படுத்தப்படுகின்றன. முனையில் அமைக்கப்பட்ட பொருட்கள் புறக்கணிக்கப்படும்.
uk: При генеруванні бібліотеки мешів використовуються тільки матеріали мешів. Матеріали, встановлені на вузлі, будуть проігноровані.
zh_hant: 在生成網格庫時, 只使用網格內的材質. 節點上設定的材質將被忽略.

source: NavigationMeshes
it: Mesh di navigazione
pl: Siatki nawigacji (NavigationMeshes)
pt_br: Malhas de Navegação
ru: Навигационные сетки
ta: வழிசெலுத்தல் ஆகியவை
uk: Навігаційні меші (сітки) *(NavigationMeshes)*
zh_hant: 導覽網格

source: Like all mesh instances, MeshLibrary items can be assigned a :ref:`class_NavigationMesh` resource, which can be created manually, or baked as described below.
ga: Cosúil le gach cás mogalra, is féidir earraí MeshLibrary a shannadh acmhainn a:ref: `Class_NavigationMesh`, ar féidir iad a chruthú de láimh, nó a bhácáil mar a thuairiscítear thíos.
ru: Как все экземпляры mesh, объекты MeshLibrary могут быть назначенными как ресурс :ref:`class_NavigationMesh`, которые могут быть созданными вручную, или запеченными как описано ниже.
ta: எல்லா கண்ணி நிகழ்வுகளையும் போலவே, மெச்லிபிரரி உருப்படிகளையும் ஒதுக்கலாம் a: ref: `class_navigationmesh` வளம், அவை கைமுறையாக உருவாக்கப்படலாம் அல்லது கீழே விவரிக்கப்பட்டுள்ளபடி சுடப்படலாம்.
uk: Як будь які меші, компоненти MeshLibrary можуть мати :ref:`class_NavigationMesh`, що можна створити власноруч чи автоматично, як описано далі.
zh_hant: 和所有網格實例一樣，MeshLibrary 的專案可以用 :ref:`class_NavigationMesh` 賦值，既可以手動建立，也即可按下面的說明進行烘焙。

source: To create the NavigationMesh from a MeshLibrary scene export, place a :ref:`class_NavigationRegion3D` child node below the main MeshInstance3D for the GridMap item. Add a valid NavigationMesh resource to the NavigationRegion3D and some source geometry nodes below and bake the NavigationMesh.
ga: Chun an NavigationMesh a chruthú ó onnmhairiú radharc MeshLibrary, cuir a:ref: `Class_NavigationRegion3D` nód leanbh faoin bpríomh-mhír MeshInstance3D don mhír GridMap. Cuir acmhainn bailí NavigationMesh leis an NavigationRegion3D agus roinnt nóid geoiméadrachta foinse thíos agus bácáil an NavigationMesh.
ru: Чтобы создать NavigationMesh из экспорта сцены MeshLibrary, поместите дочерний узел :ref:`class_NavigationRegion3D` ниже основного MeshInstance3D для элемента GridMap. Добавьте допустимый ресурс NavigationMesh в NavigationRegion3D и несколько исходных узлов геометрии ниже и запеките NavigationMesh.
ta: ஒரு மெச்லிபிரரி காட்சி ஏற்றுமதியிலிருந்து நேவிகேசன்மேசை உருவாக்க, வைக்கவும்: குறிப்பு: `class_navigationRegion3d` குழந்தை முனை கிரிட்மேப் உருப்படியுக்கான முதன்மையான மெசின்ச்டன்ச் 3 டி கீழே. வழிசெலுத்தல் பிரேகியன் 3 டி மற்றும் கீழே உள்ள சில மூல வடிவியல் முனைகளில் செல்லுபடியாகும் நேவிகேசன்மேச் வளத்தைச் சேர்த்து, நேவிகேசன்மேசை சுட்டுக்கொள்ளுங்கள்.
uk: Щоб створити NavigationMesh з експорту сцени MeshLibrary, розмістіть дочірній вузол :ref:`class_NavigationRegion3D` під основним MeshInstance3D для елемента GridMap. Додайте дійсний ресурс NavigationMesh до NavigationRegion3D і деяких вихідних вузлів геометрії нижче та запікайте NavigationMesh.
zh_hant: 若要從 MeshLibrary 場景匯出建立 NavigationMesh，請在主要的 MeshInstance3D 下方放置一個 :ref:`class_NavigationRegion3D` 子節點，新增一個有效的 NavigationMesh 資源到 NavigationRegion3D，並在下方新增一些來源幾何體節點，然後烘焙 NavigationMesh。

source: With small grid cells it is often necessary to reduce the NavigationMesh properties for agent radius and region minimum size.
ga: Le cealla greille beaga is minic a bhíonn gá airíonna NavigationMesh a laghdú le haghaidh raidise gníomhaire agus íosmhéid réigiúin.
ru: При использовании небольших ячеек сетки обычно необходимо уменьшить свойства NavigationMesh для радиуса агента и минимального размера области.
ta: சிறிய கட்டம் செல்கள் மூலம் முகவர் ஆரம் மற்றும் பிராந்திய குறைந்தபட்ச அளவு ஆகியவற்றிற்கான வழிசெலுத்தல்மேச் பண்புகளைக் குறைப்பது பெரும்பாலும் தேவை.
uk: При використанні невеликих комірок сітки, часто необхідно зменшити параметри радіуса агента та мінімального розміру області NavigationMesh.
zh_hant: 如果儲存格比較小，一般需要把 NavigationMesh 屬性裡的代理半徑和最小地區大小降低。

source: Nodes below the NavigationRegion3D are ignored for the MeshLibrary scene export, so additional nodes can be added as source geometry just for baking the navmesh.
ga: Déantar neamhaird ar nóid faoi bhun an NavigationRegion3d le haghaidh onnmhairiú radharc MeshLibrary, mar sin is féidir nóid bhreise a chur leis mar gheoiméadra foinse díreach chun an navmesh a bácáil.
ru: Узлы ниже NavigationRegion3D игнорируются при экспорте сцены MeshLibrary, поэтому дополнительные узлы можно добавить в качестве исходной геометрии только для запекания навигационной сетки.
ta: மெச்லிபிரரி காட்சி ஏற்றுமதிக்கு வழிசெலுத்தல் பிரேகியன் 3 டி க்குக் கீழே உள்ள முனைகள் புறக்கணிக்கப்படுகின்றன, எனவே நவ்மேசை சுடுவதற்கு கூடுதல் முனைகளை மூல வடிவவியலாக சேர்க்கலாம்.
uk: Вузли нижче NavigationRegion3D ігноруються для експорту сцени MeshLibrary, тому додаткові вузли можна додати як вихідну геометрію лише для запікання навігаційної сітки.
zh_hant: NavigationMeshInstance 下的節點在匯出 MeshLibrary 場景時會被忽略，所以可以專門為烘焙導覽網格新增額外的節點，作為來源幾何體。

source: The baked cell size of the NavigationMesh must match the NavigationServer map cell size to properly merge the navigation meshes of different grid cells.
ga: Caithfidh méid cille bácáilte an NavigationMesh méid cille léarscáileála NavigationServer a mheaitseáil chun mogalra nascleanúna cealla greille éagsúla a chumasc i gceart.
ru: Размер запеченной ячейки NavigationMesh должен соответствовать размеру ячейки карты NavigationServer, чтобы правильно объединить навигационные сетки разных ячеек сетки.
ta: நேவிகேசன்மேசின் வேகவைத்த செல் அளவு வெவ்வேறு கட்டம் உயிரணுக்களின் வழிசெலுத்தல் மெச்களை சரியாக ஒன்றிணைக்க ஊடுருவல் வரைபட செல் அளவுடன் பொருந்த வேண்டும்.
uk: Розмір запеченої клітинки NavigationMesh має відповідати розміру клітинки карти NavigationServer, щоб правильно поєднати навігаційні сітки різних клітинок.
zh_hant: 烘焙 NavigationMesh 的儲存格大小必須與 NavigationServer 地圖的儲存格大小一致，才能把不同 Grid 儲存格的導覽網格合併起來。

source: Lightmaps
it: Lightmap
ru: Lightmaps (Карты освещения)
ta: லைட்மாப்ச்
zh_hant: 光照貼圖

source: It is possible to bake lightmaps onto a GridMap. Lightmap UV2 data will be reused from meshes if already present. If UV2 data is not present, then it will be automatically generated on bake with a lightmap texel size of 0.1 units. To generate UV2 data with a different lightmap texel size, you can set the global illumination mode in the Import dock to **Static Lightmaps** and specify the texel size there. This option must be changed *before* the scene is converted to a MeshLibrary, as changing it later on will not affect the existing MeshLibrary data.
ru: Карты освещения можно запекать на GridMap. Данные карт освещения UV2 будут повторно использованы из сеток, если они уже есть. Если данные UV2 отсутствуют, они будут автоматически сгенерированы при запекании с размером текселя карты освещения 0,1 единицы. Чтобы сгенерировать данные UV2-карт освещения с другим размером текселя, можно установить режим глобального освещения в панели импорта на **Static Lightmap** и указать там размер текселя. Этот параметр необходимо изменить *до* преобразования сцены в MeshLibrary, так как последующее изменение не повлияет на существующие данные MeshLibrary.
ta: லைட்மேப்சை ஒரு கிரிட்மேப்பில் சுட முடியும். லைட்மேப் UV2 தரவு ஏற்கனவே இருந்தால் மெச்களிலிருந்து மீண்டும் பயன்படுத்தப்படும். UV2 தரவு இல்லை என்றால், அது தானாகவே 0.1 அலகுகளின் லைட்மேப் டெக்செல் அளவைக் கொண்டு சுட்டுக்கொள்ளும். வேறுபட்ட லைட்மேப் டெக்செல் அளவைக் கொண்ட UV2 தரவை உருவாக்க, நீங்கள் இறக்குமதி கப்பல்துறையில் உலகளாவிய வெளிச்சம் பயன்முறையை ** நிலையான லைட்மாப்ச் ** என அமைக்கலாம் மற்றும் அங்குள்ள டெக்சல் அளவைக் குறிப்பிடலாம். இந்த விருப்பத்தை மாற்ற வேண்டும் * முன் * காட்சி ஒரு மெச்லிபிரரியாக மாற்றப்பட வேண்டும், ஏனெனில் அதை பின்னர் மாற்றுவது தற்போதுள்ள மெச்லிபிரரி தரவை பாதிக்காது.
zh_hant: 可以在 GridMap 上烘焙光照貼圖。若網格已具備 UV2，將會直接重用；若沒有，烘焙時會自動以 0.1 單位的光照 texel 尺寸產生。若需其他 texel 尺寸，可在匯入面板將全域光照模式設為 **Static Lightmaps** 並在該處指定 texel 大小。此選項必須在場景轉為 MeshLibrary *之前* 更改，之後修改將不會影響既有的 MeshLibrary 資料。

source: Aside from this peculiarity, the lightmap baking process is the same as for any other 3D scene. See :ref:`doc_using_lightmap_gi` for more information about lightmap baking.
ru: За исключением этой особенности, процесс запекания карты освещения ничем не отличается от процесса запекания любой другой 3D-сцены. Подробнее о запекании карты освещения см. в документе :ref:`doc_using_lightmap_gi`.
ta: இந்த தனித்தன்மையைத் தவிர, லைட்மேப் பேக்கிங் செயல்முறை வேறு எந்த 3D காட்சிக்கும் சமம். காண்க: குறிப்பு: லைட்மேப் பேக்கிங் பற்றிய கூடுதல் தகவலுக்கு `doc_using_lightmap_gi`.
zh_hant: 除上述特點外，其餘光照貼圖的烘焙流程與一般 3D 場景相同。更多資訊請參閱 :ref:`doc_using_lightmap_gi`。

source: MeshLibrary format
ru: Формат MeshLibrary
ta: மெச்லிபிரரி வடிவம்
uk: Формат MeshLibrary
zh_hant: MeshLibrary 格式

source: To summarize the specific constraints of the MeshLibrary format, a MeshLibrary scene has a Node3D as the root node, and several child nodes which will become MeshLibrary items. Each child of the root node should:
ru: Подводя итог конкретным ограничениям формата MeshLibrary, сцена MeshLibrary имеет Node3D в качестве корневого узла и несколько дочерних узлов, которые станут элементами MeshLibrary. Каждый дочерний узел корневого узла должен:
ta: மெச்லிபிரரி வடிவமைப்பின் குறிப்பிட்ட தடைகளைச் சுருக்கமாகக் கூற, ஒரு மெச்லிபிரரி காட்சியில் ரூட் முனையாக ஒரு முனை 3 டி உள்ளது, மேலும் பல குழந்தை முனைகள் மெச்லிபிரரி உருப்படிகளாக மாறும். ரூட் முனையின் ஒவ்வொரு குழந்தையும் வேண்டும்:
uk: Підсумовуючи конкретні обмеження формату MeshLibrary, сцена MeshLibrary має Node3D як кореневий вузол і кілька дочірніх вузлів, які стануть елементами MeshLibrary. Кожен дочірній елемент кореневого вузла повинен:
zh_hant: 總結 MeshLibrary 格式的特定限制：一個 MeshLibrary 場景必須以 Node3D 為根節點，並包含多個作為 MeshLibrary 項目的子節點。每個根節點的子節點須：

source: Be a :ref:`class_MeshInstance3D`, which will become the MeshLibrary item. Only this visual mesh will be exported.
ru: Быть :ref:`class_MeshInstance3D`, который станет элементом MeshLibrary. Только эта визуальная сетка будет экспортирована.
ta: ஒரு: ref: `class_meshinstance3d`, இது மெச்லிபிரரி பொருளாக மாறும். இந்த காட்சி கண்ணி மட்டுமே ஏற்றுமதி செய்யப்படும்.
uk: Бути :ref:`class_MeshInstance3D`, який стане елементом MeshLibrary. Буде експортовано лише цю візуальну сітку.
zh_hant: 必須是 :ref:`class_MeshInstance3D`，並成為 MeshLibrary 項目。只有這個可見的 Mesh 會被匯出。

source: Have a material, in the mesh's material slot, *not* the MeshInstance3D's material slots.
ru: Поместите материал в слот материала сетки, *а не* в слоты материала MeshInstance3D.
ta: மெசின் பொருள் ச்லாட்டில் ஒரு பொருள் வேண்டும், * இல்லை * மெசின்ச்டன்ச் 3 டி இன் பொருள் இடங்கள்.
uk: Майте матеріал у слоті матеріалу сітки, *а не* у слотах матеріалу MeshInstance3D.
zh_hant: 材質必須設在 mesh 的材質插槽中， *不能* 設在 MeshInstance3D 的材質插槽。
