Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_gridmaps.po
Languages: ga, it, pl, pt_br, ru, ta, uk, zh_hant

source: Have up to one :ref:`class_StaticBody3D` child, for collision. The StaticBody3D should have one or more :ref:`class_CollisionShape3D` children.
ru: Иметь до одного :ref:`class_StaticBody3D` потомка, для столкновения. StaticBody3D должен иметь одного или более :ref:`class_CollisionShape3D` потомков.
ta: ஒன்று வரை: Ref: `class_staticbody3d` குழந்தை, மோதலுக்காக. Staticbody3d ஒன்று அல்லது அதற்கு மேற்பட்டதாக இருக்க வேண்டும்: ref: `class_collisshape3d` குழந்தைகள்.
uk: Майте до одного дочірнього елемента :ref:`class_StaticBody3D` для зіткнення. StaticBody3D має мати одного чи кількох дочірніх елементів :ref:`class_CollisionShape3D`.
zh_hant: 最多只能有一個 :ref:`class_StaticBody3D` 子節點做為碰撞用途。該 StaticBody3D 須包含一個或多個 :ref:`class_CollisionShape3D` 子節點。

source: Have up to one :ref:`class_NavigationRegion3D` child, for navigation. The NavigationRegion3D can have one or more additional :ref:`class_MeshInstance3D` children, which can be baked for navigation, but won't be exported as a visual mesh.
ru: Иметь до одного дочернего элемента :ref:`class_NavigationRegion3D` для навигации. NavigationRegion3D может иметь один или несколько дополнительных дочерних элементов :ref:`class_MeshInstance3D`, которые могут быть запечены для навигации, но не будут экспортированы как визуальная сетка.
ta: ஒன்று வரை: ref: `class_navigationRegion3d` குழந்தை, வழிசெலுத்தலுக்கு. வழிசெலுத்தல் பிரேகியன் 3 டி ஒன்று அல்லது அதற்கு மேற்பட்ட கூடுதல்: ref: `class_meshinstance3d` குழந்தைகள், இது வழிசெலுத்தலுக்காக சுடப்படலாம், ஆனால் காட்சி கண்ணி என ஏற்றுமதி செய்யப்படாது.
uk: Майте до одного дочірнього :ref:`class_NavigationRegion3D` для навігації. NavigationRegion3D може мати одну або більше додаткових :ref:`class_MeshInstance3D` дочірніх елементів, які можна запікати для навігації, але не експортувати як візуальну сітку.
zh_hant: 最多只能有一個 :ref:`class_NavigationRegion3D` 子節點作為導覽用途。該 NavigationRegion3D 可包含一個或多個額外的 :ref:`class_MeshInstance3D` 子節點，這些可用於烘焙導覽網格，但不會被匯出為可見 Mesh。

source: Only this specific format is recognized. Other node types placed as children will not be recognized and exported. GridMap is not a general-purpose system for placing *nodes* on a grid, but rather a specific, optimized system, designed to place *meshes* with collisions and navigation.
ru: Распознается только этот конкретный формат. Другие типы узлов, размещенные как дочерние, не будут распознаны и экспортированы. GridMap — это не универсальная система для размещения *узлов* на сетке, а скорее специальная оптимизированная система, предназначенная для размещения *сеток* с коллизиями и навигацией.
ta: இந்த குறிப்பிட்ட வடிவம் மட்டுமே அங்கீகரிக்கப்பட்டுள்ளது. குழந்தைகளாக வைக்கப்படும் பிற முனை வகைகள் அங்கீகரிக்கப்பட்டு ஏற்றுமதி செய்யப்படாது. கிரிட்மேப் என்பது ஒரு கட்டத்தில் * முனைகளை * வைப்பதற்கான ஒரு பொதுவான நோக்கம் கொண்ட அமைப்பு அல்ல, மாறாக ஒரு குறிப்பிட்ட, உகந்த அமைப்பு, மோதல்கள் மற்றும் வழிசெலுத்தலுடன் * மெச்களை * வைக்க வடிவமைக்கப்பட்டுள்ளது.
uk: Розпізнається лише цей конкретний формат. Інші типи вузлів, розміщені як дочірні, не будуть розпізнані та експортовані. GridMap — це не система загального призначення для розміщення *вузлів* на сітці, а скоріше спеціальна, оптимізована система, призначена для розміщення *сіток* із зіткненнями та навігацією.
zh_hant: 僅支援此特定格式。其他類型的子節點不會被識別與匯出。GridMap 並非用來在網格上擺放 *節點* 的通用系統，而是針對於帶有碰撞與導覽功能的 *Mesh* 設計的特定優化系統。

source: Exporting the MeshLibrary
ga: An MeshLibrary a onnmhairiú
pl: Eksportowanie MeshLibrary
pt_br: Exportando a MeshLibrary
ru: Экспорт MeshLibrary
ta: மெச்லிபிரரியை ஏற்றுமதி செய்கிறது
uk: Експортування MeshLibrary
zh_hant: 匯出 MeshLibrary

source: To export the library, click on **Scene > Export As... > MeshLibrary...**, and save it as a resource.
ga: Chun an leabharlann a easpórtáil, cliceáil ar **Radharc > Easpórtáil Mar... > MeshLibrary...**, agus sábháil mar acmhainn í.
ru: Чтобы экспортировать библиотеку, нажмите **Scene > Export As... > MeshLibrary...** и сохраните ее как ресурс.
ta: நூலகத்தை ஏற்றுமதி செய்ய, ** காட்சி> ஏற்றுமதி என ...> மெச்லிபிரரி ... ** என்பதைக் சொடுக்கு செய்து, அதை ஒரு வளமாக சேமிக்கவும்.
uk: Щоб експортувати бібліотеку, натисніть **Сцена > Експортувати як... > MeshLibrary...** і збережіть її як ресурс.
zh_hant: 要匯出庫，點擊場景 -> 轉換為.. -> 網格庫...，並將其保存為資源。

source: You can find an already exported MeshLibrary in the project named ``MeshLibrary.tres``.
ru: Вы можете найти уже экспортированную MeshLibrary в проекте под названием ``MeshLibrary.tres``.
ta: `` Meshlibrary.tres`` என்ற திட்டத்தில் ஏற்கனவே ஏற்றுமதி செய்யப்பட்ட மெச்லிபிரரியைக் காணலாம்.
zh_hant: 你可以在專案中找到已匯出的 MeshLibrary，檔名為 ``MeshLibrary.tres``。

source: Using GridMap
ga: Ag baint úsáide as GridMap
it: Utilizzo di GridMap
pl: Korzystanie z GridMap
pt_br: Usando GridMap
ru: Использование GridMap
ta: கிரிட்மேப்பைப் பயன்படுத்துதல்
uk: Використання GridMap
zh_hant: 使用 GridMap

source: Create a new scene and add a GridMap node. Add the mesh library by dragging the resource file from the FileSystem dock and dropping it in the **Mesh Library** property in the Inspector.
ru: Создайте новую сцену и добавьте узел GridMap. Добавьте библиотеку сеток, перетащив файл ресурсов из дока FileSystem в свойство **Mesh Library** в Инспекторе.
ta: ஒரு புதிய காட்சியை உருவாக்கி ஒரு கிரிட்மேப் முனையைச் சேர்க்கவும். கோப்பு முறைமை கப்பல்துறையிலிருந்து வள கோப்பை இழுத்து, இன்ச்பெக்டரில் உள்ள ** மெச் நூலகம் ** சொத்தில் கைவிடுவதன் மூலம் மெச் நூலகத்தைச் சேர்க்கவும்.
uk: Створіть нову сцену та додайте вузол GridMap. Додайте бібліотеку сіток, перетягнувши файл ресурсів з панелі FileSystem у властивість **Бібліотека сіток** в Інспекторі.
zh_hant: 建立新場景並新增一個 GridMap 節點。將檔案系統面板中的資源檔拖放到屬性檢視器的 **Mesh Library** 屬性以加入網格庫。

source: Inspector properties
it: Propriet√† nelll'Ispettore
ru: Инспектор недвижимости
ta: இன்ச்பெக்டர் பண்புகள்
uk: Властивості інспектора
zh_hant: 屬性檢視器屬性

source: The **Physics Material** setting allows you to override the physics material for every mesh in the NavigationMesh.
ru: Параметр **Physics Material** позволяет переопределить физический материал для каждой сетки в NavigationMesh.
ta: ** இயற்பியல் பொருள் ** அமைத்தல் வழிசெலுத்தல்மேசில் உள்ள ஒவ்வொரு மெசுக்கும் இயற்பியல் பொருளை மேலெழுத உங்களை அனுமதிக்கிறது.
uk: Налаштування **Фізичний матеріал** дозволяє вам перевизначити фізичний матеріал для кожної сітки в NavigationMesh.
zh_hant: **Physics Material** 設定可覆寫 NavigationMesh 中每個網格所使用的物理材質。

source: Under **Cells**, the **Size** property should be set to the size of your meshes. You can leave it at the default value for the demo. Uncheck the **Center Y** property.
ru: В разделе **Cells** свойство **Size** должно быть установлено равным размеру ваших сеток. Для демонстрации можно оставить значение по умолчанию. Снимите флажок со свойства **Center Y**.
ta: ** கலங்கள் ** இன் கீழ், ** அளவு ** சொத்து உங்கள் மெச்களின் அளவிற்கு அமைக்கப்பட வேண்டும். டெமோவிற்கான இயல்புநிலை மதிப்பில் அதை விட்டுவிடலாம். ** மைய ஒய் ** சொத்தை தேர்வுநீக்கவும்.
uk: У розділі **Cells** властивість **Size** має бути встановлена на розмір ваших сіток. Ви можете залишити її за замовчуванням для демонстрації. Зніміть позначку з властивості **Center Y**.
zh_hant: 在 **Cells** 區段中，**Size** 應設為你的網格尺寸。本示例可維持預設值。請取消勾選 **Center Y** 屬性。

source: The **Collision** options allow you to set the collision layer, collision mask, and priority for the entire grid. For more information on how those work see the :ref:`doc_physics_index` section.
ru: Параметры **Collision** позволяют задать слой столкновений, маску столкновений и приоритет для всей сетки. Подробнее об этом см. в разделе :ref:`doc_physics_index`.
ta: ** மோதல் ** விருப்பங்கள் மோதல் அடுக்கு, மோதல் முகமூடி மற்றும் முழு கட்டத்திற்கும் முன்னுரிமையை அமைக்க உங்களை அனுமதிக்கின்றன. அந்த வேலைகள் எவ்வாறு காண்க: ref: `doc_physics_index` பிரிவு.
uk: Параметри **Колізія** дозволяють встановити шар колізії, маску колізії та пріоритет для всієї сітки. Для отримання додаткової інформації про те, як вони працюють, див. розділ :ref:`doc_physics_index`.
zh_hant: **Collision** 選項可為整個格子設定碰撞層、碰撞遮罩與優先度。其運作方式請參閱 :ref:`doc_physics_index`。

source: Under **Navigation** is the "Bake Navigation" option. If enabled it creates a navigation region for each cell that uses a mesh library item with a navigation mesh.
ru: В разделе **Navigation** находится опция "Bake Navigation". Если она включена, она создаёт навигационную область для каждой ячейки, использующей элемент библиотеки сеток с навигационной сеткой.
ta: ** வழிசெலுத்தல் ** இன் கீழ் "சுட்டுக்கொள்ள வழிசெலுத்தல்" விருப்பம். இயக்கப்பட்டால், ஒவ்வொரு கலத்திற்கும் ஒரு வழிசெலுத்தல் பகுதியை உருவாக்குகிறது, இது ஒரு வழிசெலுத்தல் கண்ணி கொண்ட கண்ணி நூலக உருப்படியைப் பயன்படுத்துகிறது.
uk: У розділі **Навігація** є опція «Запікати навігацію». Якщо її ввімкнути, вона створює область навігації для кожної комірки, яка використовує елемент бібліотеки сіток із сіткою навігації.
zh_hant: **Navigation** 底下有「Bake Navigation」選項。啟用後，對於使用了具備導覽網格之網格庫項目的每個格子，會建立對應的導覽區域。

source: If you click on the MeshLibrary itself in the inspector you can adjust settings for individual meshes, such as their navigation mesh, navigation layers, or if the mesh casts shadows.
ru: Если щелкнуть по самой MeshLibrary в инспекторе, можно настроить параметры отдельных сеток, например, их навигационную сетку, навигационные слои или отбрасывание сеткой теней.
ta: இன்ச்பெக்டரில் உள்ள மெச்லிபரியைக் சொடுக்கு செய்தால், தனிப்பட்ட மெச்களுக்கான அமைப்புகளை அவற்றின் வழிசெலுத்தல் கண்ணி, வழிசெலுத்தல் அடுக்குகள் அல்லது கண்ணி நிழல்களைக் காட்டினால் சரிசெய்யலாம்.
uk: Якщо ви клацнете на самій MeshLibrary в інспекторі, ви зможете налаштувати параметри для окремих сіток, такі як їхня навігаційна сітка, навігаційні шари або чи відкидає сітка тіні.
zh_hant: 在屬性檢視器中點選 MeshLibrary 本身，可調整各個網格的設定，例如其導覽網格、導覽圖層，或該網格是否投射陰影。

source: GridMap panel
it: Pannello GridMap
ru: Панель GridMap
ta: கிரிட்மேப் பேனல்
uk: Панель GridMap
zh_hant: GridMap 面板

source: At the bottom of the editor is the GridMap panel, which should have opened automatically when you added the GridMap node.
ru: В нижней части редактора находится панель GridMap, которая должна была открыться автоматически при добавлении узла GridMap.
ta: எடிட்டரின் அடிப்பகுதியில் கிரிட்மேப் பேனல் உள்ளது, நீங்கள் கிரிட்மேப் முனையைச் சேர்த்தபோது தானாகவே திறக்கப்பட வேண்டும்.
uk: Внизу редактора знаходиться панель GridMap, яка мала б відкритися автоматично після додавання вузла GridMap.
zh_hant: 編輯器底部是 GridMap 面板，新增 GridMap 節點時應會自動開啟。

source: From left to right in the toolbar:
ga: Ó chlé go deas sa uirlisí uirlisí:
ru: Слева направо на панели инструментов:
ta: கருவிப்பட்டியில் இடமிருந்து வலமாக:
uk: Зліва направо на панелі інструментів:
zh_hant: 工具列由左至右功能如下：

source: **Transform**: Adds a gizmo to the scene that allows you to change the relative position and rotation of the gridmap in the scene.
ru: **Transform**: добавляет к сцене элемент, позволяющий изменять относительное положение и поворот сетки на сцене.
ta: ** உருமாற்றம் **: காட்சியில் ஒரு கிச்மோவைச் சேர்க்கிறது, இது காட்சியில் உள்ள கிரிட்மேப்பின் ஒப்பீட்டு நிலை மற்றும் சுழற்சியை மாற்ற அனுமதிக்கிறது.
uk: **Трансформація**: Додає до сцени гізмо, який дозволяє змінювати відносне положення та обертання карти сітки в сцені.
zh_hant: **Transform**：在場景中加入操作器，讓你能調整 GridMap 在場景中的相對位置與旋轉。

source: **Selection**: While active you can select an area in the viewport, click and drag to select more than one space on the grid.
ru: **Selection**: В активном состоянии вы можете выбрать область в окне просмотра, щелкнуть и перетащить, чтобы выбрать более одного пространства на сетке.
ta: ** தேர்வு **: செயலில் இருக்கும்போது, நீங்கள் காட்சியமைப்பில் ஒரு பகுதியைத் தேர்ந்தெடுத்து, கட்டத்தில் ஒன்றுக்கு மேற்பட்ட இடங்களைத் தேர்ந்தெடுக்க சொடுக்கு செய்து இழுக்கலாம்.
uk: **Виділення**: Під час активації ви можете вибрати область у вікні перегляду, клацнути та перетягнути, щоб вибрати більше одного простору на сітці.
zh_hant: **Selection**：啟用時可在檢視區框選區域，點擊並拖曳即可一次選取多個格子。

source: **Erase**: While active, click in the viewport and delete meshes.
ru: **Erase**: В активном режиме щелкните в области просмотра и удалите сетки.
ta: ** அழிக்கவும் **: செயலில் இருக்கும்போது, வியூபோர்ட்டில் சொடுக்கு செய்து மெச்களை நீக்கு.
uk: **Стерти**: Поки активна функція, клацніть у вікні перегляду та видаліть сітки.
zh_hant: **Erase**：啟用時，在檢視區點擊即可刪除網格物件。

source: **Paint**: While active, click in the viewport and add whatever mesh is currently selected in the GridMap panel to the scene.
ru: **Paint**: В активном режиме щелкните в области просмотра и добавьте в сцену любую сетку, выбранную в данный момент на панели GridMap.
ta: **Paint**: While active, click in the viewport and கூட்டு whatever mesh is currently தேர்ந்தெடுக்கப்பட்டது in the GridMap panel பெறுநர் the scene.
uk: **Малювання**: Поки активна панель, клацніть у вікні перегляду та додайте до сцени будь-яку сітку, що наразі вибрана на панелі GridMap.
zh_hant: **Paint**：啟用時，在檢視區點擊即可將 GridMap 面板中目前選取的網格加入場景。

source: **Pick**: While active, clicking on a gridmap mesh in the viewport will cause it to be selected in the GridMap panel.
ru: **Pick**: Если щелкнуть gridmap сетки в области просмотра, когда она активна, она будет выбрана на панели GridMap.
ta: **Pick**: While active, clicking on a gridmap mesh in the viewport will cause it பெறுநர் be தேர்ந்தெடுக்கப்பட்டது in the GridMap panel.
uk: **Вибір**: Під час активації, клацання на сітці сітки у вікні перегляду призведе до її вибору на панелі GridMap.
zh_hant: **Pick**：啟用時，在檢視區點擊 GridMap 的網格物件，會在 GridMap 面板中選取對應的項目。

source: **Fill**: Fill the area that has been selected in the viewport with whatever mesh is selected in the GridMap bottom panel.
ru: **Fill**: Заполните область, выбранную в окне просмотра, сеткой, выбранной на нижней панели GridMap.
ta: **Fill**: Fill the area that has been தேர்ந்தெடுக்கப்பட்டது in the viewport with whatever mesh is தேர்ந்தெடுக்கப்பட்டது in the GridMap கீழே panel.
uk: **Заливка**: Заповнити область, вибрану у вікні перегляду, будь-якою сіткою, вибраною на нижній панелі GridMap.
zh_hant: **Fill**：以 GridMap 底部面板中選取的網格，填滿檢視區中已選取的區域。

source: **Move**: Move whatever mesh or meshes are currently selected in the viewport.
ru: **Move**: Переместить любую сетку или сетки, выбранные в данный момент в области просмотра.
ta: ** நகர்த்து **: காட்சியகத்தில் தற்போது தேர்ந்தெடுக்கப்பட்ட கண்ணி அல்லது மெச்கள் எதை நகர்த்தவும்.
uk: **Перемістити**: Перемістити будь-яку сітку або сітки, що наразі вибрані у вікні перегляду.
zh_hant: **Move**：移動檢視區中目前選取的網格物件。

source: **Duplicate**: Create a copy of whatever the selected mesh or meshes in the GridMap are.
ru: **Duplicate:** Создать копию выбранной сетки или сеток в GridMap.
ta: ** நகல் **: கிரிட்மேப்பில் தேர்ந்தெடுக்கப்பட்ட கண்ணி அல்லது மெச்கள் எதுவாக இருந்தாலும் நகலை உருவாக்கவும்.
uk: **Дублікат**: Створити копію вибраної сітки або сіток у GridMap.
zh_hant: **Duplicate**：複製 GridMap 中所選取的網格物件。

source: **Delete**: Similar to erase, but for the entire selected area.
ru: **Delete:** Аналогично стиранию, но для всей выделенной области.
ta: ** நீக்கு **: அழிப்பதைப் போன்றது, ஆனால் தேர்ந்தெடுக்கப்பட்ட முழு பகுதிக்கும்.
uk: **Видалити**: Подібно до стирання, але для всієї вибраної області.
zh_hant: **Delete**：類似 Erase，但會作用於整個已選取的區域。

source: **Cursor Rotate X**: While the paint tool is selected, this will rotate the mesh that will be painted on the X-axis. This will also rotate selected areas if they are being moved.
ru: **Cursor Rotate X**: При выборе инструмента рисования сетка, которую нужно нарисовать, будет вращаться по оси X. Кроме того, будут вращаться выбранные области, если они перемещаются.
ta: ** கர்சர் ஃச் **: வண்ணப்பூச்சு கருவி தேர்ந்தெடுக்கப்பட்டாலும், இது எக்ச்-அச்சில் நிறம் பூசப்படும் கண்ணி சுழலும். தேர்ந்தெடுக்கப்பட்ட பகுதிகளை நகர்த்தினால் அவை சுழலும்.
uk: **Поворот курсора по осі X**: Коли вибрано інструмент малювання, ця команда обертатиме сітку, яка буде намальована, по осі X. Також обертатиме вибрані області, якщо вони переміщуються.
zh_hant: **Cursor Rotate X**：當 Paint 工具啟用時，旋轉將要繪製的網格於 X 軸方向。若正在移動選取區域，也會一併旋轉。

source: **Cursor Rotate Y**: While the paint tool is selected, this will rotate the mesh that will be painted on the Y-axis. This will also rotate selected areas if they are being moved.
ru: **Cursor Rotate Y**: При выборе инструмента рисования сетка, которую нужно нарисовать, будет вращаться по оси Y. Кроме того, будут вращаться выбранные области, если они перемещаются.
ta: ** கர்சர் ஒய் ஐ சுழற்றுங்கள் **: வண்ணப்பூச்சு கருவி தேர்ந்தெடுக்கப்பட்டாலும், இது Y- அச்சில் வரையப்பட்ட கண்ணி சுழலும். தேர்ந்தெடுக்கப்பட்ட பகுதிகளை நகர்த்தினால் அவை சுழலும்.
uk: **Поворот курсора по осі Y**: Коли вибрано інструмент малювання, ця функція обертатиме сітку, яка буде намальована, по осі Y. Також обертатиме вибрані області, якщо вони переміщуються.
zh_hant: **Cursor Rotate Y**：當 Paint 工具啟用時，旋轉將要繪製的網格於 Y 軸方向。若正在移動選取區域，也會一併旋轉。

source: **Cursor Rotate Z**: While the paint tool is selected, this will rotate the mesh that will be painted on the Z-axis. This will also rotate selected areas if they are being moved.
ru: **Cursor Rotate Z**: При выборе инструмента рисования сетка, которую нужно нарисовать, будет вращаться по оси Z. Кроме того, будут вращаться выбранные области, если они перемещаются.
ta: ** கர்சர் சட் ஐ சுழற்றுங்கள் **: வண்ணப்பூச்சு கருவி தேர்ந்தெடுக்கப்பட்டாலும், இது Z- அச்சில் வரையப்பட்ட கண்ணி சுழலும். தேர்ந்தெடுக்கப்பட்ட பகுதிகளை நகர்த்தினால் அவை சுழலும்.
uk: **Поворот курсора по осі Z**: Коли вибрано інструмент малювання, ця функція обертатиме сітку, яка буде намальована по осі Z. Також обертатиме вибрані області, якщо вони переміщуються.
zh_hant: **Cursor Rotate Z**：當 Paint 工具啟用時，旋轉將要繪製的網格於 Z 軸方向。若正在移動選取區域，也會一併旋轉。

source: **Change Grid Floor**: Adjusts what floor is currently being worked on, can be changed with the arrows or typing
ru: **Change Grid Floor**: Регулирует, на каком этаже в данный момент ведутся работы. Можно изменить с помощью стрелок или ввода текста
ta: ** கட்டம் தளத்தை மாற்றவும் **: தற்போது என்ன தளம் வேலை செய்யப்படுகிறது என்பதை சரிசெய்கிறது, அம்புகள் அல்லது தட்டச்சு மூலம் மாற்றலாம்
uk: **Змінити поверх сітки**: Налаштовує поверх, на якому зараз ведеться робота. Цю опцію можна змінити за допомогою стрілок або введенням тексту
zh_hant: **Change Grid Floor**：調整目前操作的樓層，可用箭頭按鈕或鍵入數值更改

source: **Filter Meshes**: Used to search for a specific mesh in the bottom panel.
ru: **Filter Meshes**: Используется для поиска определенной сетки на нижней панели.
ta: ** வடிகட்டி மெச்கள் **: கீழ் பேனலில் ஒரு குறிப்பிட்ட கண்ணி தேட பயன்படுகிறது.
uk: **Фільтрувати сітки**: Використовується для пошуку певної сітки на нижній панелі.
zh_hant: **Filter Meshes**：用於在底部面板搜尋特定網格。

source: **Zoom**: Controls the zoom level on meshes in the bottom panel.
ru: **Zoom**: Управляет уровнем масштабирования сеток на нижней панели.
ta: ** சூம் **: கீழ் பேனலில் உள்ள மெச்களில் சூம் அளவைக் கட்டுப்படுத்துகிறது.
uk: **Масштаб**: Керує рівнем масштабування сітей на нижній панелі.
zh_hant: **Zoom**：控制底部面板中網格的縮放檢視。

source: **Layout toggles**: These two buttons toggle between different layouts for meshes in the bottom panel.
ru: **Layout toggles**: Эти две кнопки переключают различные макеты сеток на нижней панели.
ta: ** தளவமைப்பு மாற்றங்கள் **: இந்த இரண்டு பொத்தான்களும் கீழ் பேனலில் உள்ள மெச்களுக்கு வெவ்வேறு தளவமைப்புகளுக்கு இடையில் மாறுகின்றன.
uk: **Перемикачі макета**: Ці дві кнопки перемикають різні макети для сіток на нижній панелі.
zh_hant: **Layout toggles**：這兩個按鈕可在底部面板的不同網格排列方式間切換。

source: **Tools dropdown**: This button opens a dropdown menu with a few more options.
ru: **Tools dropdown**: Эта кнопка открывает раскрывающееся меню с несколькими дополнительными опциями.
ta: ** கருவிகள் கீழ்தோன்றும் **: இந்த பொத்தான் இன்னும் சில விருப்பங்களுடன் கீழ்தோன்றும் மெனுவைத் திறக்கிறது.
uk: **Випадаючий список інструментів**: Ця кнопка відкриває випадаючий список із кількома додатковими опціями.
zh_hant: **Tools dropdown**：開啟包含更多選項的下拉選單。

source: Clicking on **Settings** in that dropdown brings up a window that allows you to change the **Pick Distance**, which is the maximum distance at which tiles can be placed on a GridMap, relative to the camera position (in meters).
ru: Нажатие на **Settings** в этом раскрывающемся списке открывает окно, в котором можно изменить **Pick Distance**, которое представляет собой максимальное расстояние, на котором плитки могут быть размещены на GridMap, относительно положения камеры (в метрах).
ta: ** அமைப்புகள் ** இல் சொடுக்கு செய்வது, அந்த கீழ்தோன்றலில் ** பிக் தூரம் ** ஐ மாற்ற அனுமதிக்கும் ஒரு சாளரத்தைக் கொண்டுவருகிறது, இது கேமரா நிலைக்கு (மீட்டரில்) ஒப்பிடும்போது, ஒரு கிரிட்மேப்பில் ஓடுகளை வைக்கக்கூடிய அதிகபட்ச தூரமாகும்.
uk: Натискання на **Налаштування** у цьому випадаючому списку відкриває вікно, яке дозволяє змінити **Відстань вибору**, яка є максимальною відстанню, на якій можна розміщувати плитки на GridMap відносно положення камери (у метрах).
zh_hant: 在該下拉選單中點擊 **Settings** 會開啟視窗，讓你調整 **Pick Distance**，即相對相機位置（以公尺計）在 GridMap 上可放置方塊的最大距離。

source: Using GridMap in code
ga: Ag baint úsáide as GridMap sa chód
pt_br: Usando o GridMap no código
ru: Использование GridMap в коде
ta: குறியீட்டில் கிரிட்மேப்பைப் பயன்படுத்துதல்
uk: Використання GridMap в коді
zh_hant: 在程式碼中使用 GridMap

source: See :ref:`class_GridMap` for details on the node's methods and member variables.
ga: Féach:ref: `Class_GridMap` le haghaidh sonraí faoi mhodhanna agus athróga ball an nód.
pt_br: Veja :ref:`class_GridMap` para detalhes sobre os métodos do nó e variáveis de membro.
ru: Подробности о методах и переменных-членах узла см. в :ref:`class_GridMap`.
ta: காண்க: குறிப்பு: `class_gridmap` முனை முறைகள் மற்றும் உறுப்பினர் மாறிகள் பற்றிய விவரங்களுக்கு.
uk: Докладніше про методи та змінні-члени вузла дивіться в :ref:`class_GridMap`.
zh_hant: 有關節點方法和成員變數的詳細資訊, 請參閱 :ref:`class_GridMap`.

source: You can find an already exported MeshLibrary in the project named "MeshLibrary.tres".
ga: Is féidir leat MeshLibrary onnmhairithe cheana féin a fháil sa tionscadal darb ainm “MeshLibrary.tres”.
pt_br: Você encontra uma MeshLibrary já exportada no projeto chamado "MeshLibrary.tres".

source: Create a new scene and add a GridMap node. Add the mesh library by dragging the resource file from the FileSystem dock and dropping it in the "Theme" property in the Inspector.
pl: Utwórz nową scenę i dodaj węzeł GridMap. Dodaj mesh library, przeciągając plik źródłowy z panelu - system plików i upuszczając go w właściwości "Temat" w inspektorze.
pt_br: Cria uma nova cena e adiciona um nó GridMap. Adicione a biblioteca de malhas arrastando o arquivo do recurso do painel de arquivos e soltando-o na propriedade de "Tema" do Inspetor.

source: Holding :kbd:`Shift` and dragging with the left mouse button will draw a selection box. You can duplicate or clear the selected area using the respective menu options.
pt_br: Segurando :kbd:`Shift`e arrastando com o botão esquerdo do mouse irá desenhar uma caixa de seleção. Você pode duplicar ou limpar a área selecionada usando as opções do menu.

source: In the menu, you can also change the axis you're drawing on, as well as shift the drawing plane higher or lower on its axis.
pt_br: No menu, você também pode mudar o eixo em que está desenhando, assim como elevar ou abaixar o plano de desenho em seu eixo.

source: Translation status
pl: Status tłumaczenia
pt_br: Progresso da Tradução

source: Unzip this project and add it to the Project Manager using the "Import" button.
pl: Rozpakuj ten projekt i dodaj go do Menedżera Projektu za pomocą przycisku "Importuj".
