Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_decals.po
Languages: es, fr, ga, it, pt_br, ru, ta, uk, zh_tw

source: **Normal Fade:** Fades the Decal if the angle between the Decal's :abbr:`AABB (Axis-Aligned Bounding Box)` and the target surface becomes too large. A value of ``0.0`` projects the decal regardless of angle, while a value of ``0.999`` limits the decal to surfaces that are nearly perpendicular. Setting **Normal Fade** to a value greater than ``0.0`` has a small performance cost due to the added normal angle computations.
ga: ** Gnáth Fad: ** Iomsaíonn an Decal má éiríonn an uillinn idir na Decal: ABBR: `AABB (Bosca Teorainneacha Aisínithe) `agus éiríonn an dromchla spriocdhromchla ró-mhór. Tionscnaíonn luach ``0.0`` an decal beag beann ar uillinn, agus cuireann luach ``0.999`` teorainn leis an decal le dromchlaí atá beagnach ingearach. Tá costas beag feidhmíochta ag socrú **Gnáthchuid fade** go luach níos mó ná `0.0`` mar gheall ar na gnáthríomhanna uillinne breise.
pt_br: **Normal Fade:** Faz o decal desaparecer se o ângulo entre o :abbr:`AABB (Axis-Aligned Bounding Box)` do decal e a superfície alvo se tornar muito grande. Um valor de ``0.0`` projeta o decal independentemente do ângulo, enquanto um valor de ``0.999`` limita o decal a superfícies quase perpendiculares. Definir **Normal Fade** para um valor maior que ``0.0`` tem um pequeno custo de desempenho devido aos cálculos adicionais de ângulo normal.
ru: **Normal Fade: (Нормальное затухание:)** Затухает декаль, если угол между :abbr:`AABB (Axis-Aligned Bounding Box)` декали и целевой поверхностью становится слишком большим. Значение ``0.0`` проецирует декаль независимо от угла, тогда как значение ``0.999`` ограничивает декаль поверхностями, которые почти перпендикулярны. Установка **Нормального затухания** на значение больше ``0.0`` имеет небольшие затраты производительности из-за дополнительных вычислений нормального угла.
ta: . `` 0.0`` இன் மதிப்பு கோணத்தைப் பொருட்படுத்தாமல் டெக்கலை திட்டமிடுகிறது, அதே நேரத்தில் `` 0.999`` இன் மதிப்பு டெக்கலை கிட்டத்தட்ட செங்குத்தாக இருக்கும் மேற்பரப்புகளுக்கு கட்டுப்படுத்துகிறது. ** சாதாரண மங்கலான ** ஐ `` 0.0`` ஐ விட அதிகமான மதிப்புக்கு அமைப்பது சேர்க்கப்பட்ட சாதாரண கோண கணக்கீடுகள் காரணமாக ஒரு சிறிய செயல்திறன் செலவைக் கொண்டுள்ளது.
uk: **Звичайне вицвітання:** тьмяніє декаль, якщо кут між декалем :abbr:`AABB (вирівняна по осі обмежувальна рамка)` та цільовою поверхнею стає завеликим. Значення ``0.0`` проектує декаль незалежно від кута, тоді як значення ``0.999`` обмежує декаль поверхнями, які є майже перпендикулярними. Встановлення **Нормального згасання** на значення більше ``0.0`` має невеликі витрати на продуктивність через додані нормальні обчислення кута.
zh_tw: **Normal Fade：** 當貼花的 :abbr:`AABB (軸對齊包圍盒)` 與目標表面的角度過大時，貼花會逐漸淡出。設為 ``0.0`` 時，不論角度都會投影貼花；設為 ``0.999`` 時，貼花僅會顯示於幾乎垂直的表面。此數值越大，計算負擔略增。

source: Vertical Fade
es: Desvanecimiento vertical
ga: Fade Ingearach
it: Dissolvenza verticale
ru: Вертикальное затухание
ta: செங்குத்து மங்கல்
uk: Вертикальне згасання
zh_tw: 垂直淡出

source: **Upper Fade:** The curve over which the decal will fade as the surface gets further from the center of the :abbr:`AABB (Axis-Aligned Bounding Box)` (towards the decal's projection angle). Only positive values are valid.
ga: **Fade Uachtarach: ** An cuar thar a n-éireoidh an decal de réir mar a théann an dromchla níos faide ó lár an: abbr: `AABB (Bosca Teorainneacha Aisínithe) `(i dtreo uillinn teilgean an decal). Níl ach luachanna dearfacha bailí.
pt_br: **Upper Fade:** A curva ao longo da qual o decal desaparecerá à medida que a superfície se afasta do centro do :abbr:`AABB (Axis-Aligned Bounding Box)` (na direção do ângulo de projeção do decal). Somente valores positivos são válidos.
ru: **Upper Fade: (Верхнее затухание:)** Кривая, по которой декаль будет затухать по мере удаления поверхности от центра :abbr:`AABB (Axis-Aligned Bounding Box)` (по направлению к углу проекции декали). Допустимы только положительные значения.
ta: . நேர்மறை மதிப்புகள் மட்டுமே செல்லுபடியாகும்.
uk: **Верхнє вицвітання:** Крива, на якій декаль буде зникати, коли поверхня віддалятиметься від центру :abbr:`AABB (Axis-Aligned Bounding Box)` (у напрямку до кута проекції декалі). Допустимі лише позитивні значення.
zh_tw: **Upper Fade：** 隨著表面離 :abbr:`AABB (軸對齊包圍盒)` 中心越遠（朝貼花投影方向），貼花將沿此曲線淡出。僅接受正值。

source: **Lower Fade:** The curve over which the decal will fade as the surface gets further from the center of the :abbr:`AABB (Axis-Aligned Bounding Box)` (away from the decal's projection angle). Only positive values are valid.
ga: **Fade Íochtarach: ** An cuar thar a n-éireoidh an decal de réir mar a théann an dromchla níos faide ó lár an: abbr: `AABB (Bosca Teorainneacha Aisínithe) `(ar shiúl ó uillinn teilgean an decal). Níl ach luachanna dearfacha bailí.
pt_br: **Lower Fade:** A curva ao longo da qual o decal desaparecerá à medida que a superfície se afasta do centro do :abbr:`AABB (Axis-Aligned Bounding Box)` (na direção oposta ao ângulo de projeção do decal). Somente valores positivos são válidos.
ru: **Lower Fade: (Нижнее затухание:)** Кривая, по которой декаль будет затухать по мере удаления поверхности от центра :abbr:`AABB (Axis-Aligned Bounding Box)` (от угла проекции декали). Допустимы только положительные значения.
ta: . நேர்மறை மதிப்புகள் மட்டுமே செல்லுபடியாகும்.
uk: **Нижнє вицвітання:** Крива, за якою наклейка зникає, коли поверхня віддаляється від центру :abbr:`AABB (Axis-Aligned Bounding Box)` (від кута проекції наклейки). Допустимі лише позитивні значення.
zh_tw: **Lower Fade：** 隨著表面離 :abbr:`AABB (軸對齊包圍盒)` 中心越遠（遠離貼花投影方向），貼花將沿此曲線淡出。僅接受正值。

source: Distance Fade
es: Distancia de desvanecimiento
ga: Fad Fade
it: Distanza dissolvenza
ru: Затухание на расстоянии
ta: தூரம் மங்கிவிடும்
uk: Відстань Fade
zh_tw: 距離淡出

source: **Enabled:** Controls whether distance fade (a form of :abbr:`LOD (Level of Detail)`) is enabled. The decal will fade out over **Begin + Length**, after which it will be culled and not sent to the shader at all. Use this to reduce the number of active decals in a scene and thus improve performance.
ga: **Cumasaithe:** Rialaíonn cé acu an bhfuil fad-chéimniú (foirm de :abbr:`LOD (Leibhéal Mionsonraithe)`) cumasaithe. Rachaidh an decal amach thar **Tosaigh + Fad**, agus ina dhiaidh sin déanfar é a mharú agus ní sheolfar chuig an scáthlánóir é ar chor ar bith. Bain úsáid as seo chun líon na decals gníomhacha i radharc a laghdú agus mar sin feabhas a chur ar fheidhmíocht.
pt_br: **Enabled:** Controla se o desvanecimento por distância (uma forma de :abbr:`LOD (Level of Detail)`) está habilitado. O decal desaparecerá ao longo de **Begin + Length**, após o que será descartado e não será enviado para o shader. Use isso para reduzir o número de decals ativos em uma cena e, assim, melhorar o desempenho.
ru: **Enabled: (Включено:)** Управляет включением затухания на расстоянии (форма :abbr:`LOD (Level of Detail)`). Декаль будет затухать в течение **Begin + Length**, после чего она будет отбракована и вообще не будет отправлена в шейдер. Используйте это, чтобы уменьшить количество активных декалей в сцене и тем самым повысить производительность.
ta: ** இயக்கப்பட்டது: ** தூரம் மங்குமா (ஒரு வடிவம்: ABBR: `LOD (விவரம் நிலை)`) இயக்கப்பட்டதா என்பதை கட்டுப்படுத்துகிறது. ** தொடக்க + நீளம் ** க்கு மேல் டெக்கால் மங்கிவிடும், அதன் பிறகு அது வெட்டப்படும் மற்றும் சேடருக்கு அனுப்பப்படாது. ஒரு காட்சியில் செயலில் உள்ள டெக்கல்களின் எண்ணிக்கையைக் குறைக்க இதைப் பயன்படுத்தவும், இதனால் செயல்திறனை மேம்படுத்தவும்.
uk: **Увімкнено:** контролює, чи ввімкнено згасання відстані (форма :abbr:`LOD (Level of Detail)`). Наклейка зникає над **Початком + Довжиною**, після чого її буде відбраковано та взагалі не надсилатиметься до шейдера. Використовуйте це, щоб зменшити кількість активних написів у сцені та таким чином покращити продуктивність.
zh_tw: **Enabled：** 控制是否啟用距離淡出（屬於 :abbr:`LOD (細節等級)`）。貼花會在 **Begin + Length** 距離範圍內淡出，超過後會被裁切，不再送至著色器。這有助於減少場景中有效貼花數量，提升效能。

source: **Begin:** The distance from the camera at which the decal begins to fade away (in 3D units).
ga: **Tosaigh: ** An fad ón gceamara ag a dtosaíonn an decal ag dul as imeacht (in aonaid 3D).
pt_br: **Begin:** A distância da câmera na qual o decalque começa a desaparecer (em unidades 3D).
ru: **Begin (Начало):** Расстояние от камеры, на котором декаль начинает исчезать (в 3D-единицах).
ta: ** தொடங்கு: ** டெக்கால் மங்கத் தொடங்கும் கேமராவிலிருந்து தூரம் (3 டி அலகுகளில்).
uk: **Початок:** Відстань від камери, на якій наклейка починає зникати (у 3D-одиницях).
zh_tw: **Begin：** 從相機起算，貼花開始淡出的距離（3D 單位）。

source: **Length:** The distance over which the decal fades (in 3D units). The decal becomes slowly more transparent over this distance and is completely invisible at the end. Higher values result in a smoother fade-out transition, which is more suited when the camera moves fast.
ga: **Fad: ** An fad thar a dtagann an decal (in aonaid 3D). Éiríonn an decal níos trédhearcach go mall thar an achar seo agus tá sé dofheicthe go hiomlán ag an deireadh. Mar thoradh ar luachanna níos airde bíonn aistriú níos réidh ag fade-out, rud atá níos oiriúnaí nuair a ghluaiseann an ceamara go tapa.
pt_br: **Length:** A distância ao longo da qual o decal desaparece (em unidades 3D). O decal se torna lentamente mais transparente ao longo dessa distância e fica completamente invisível no final. Valores mais altos resultam em uma transição de desaparecimento mais suave, o que é mais adequado quando a câmera se move rapidamente.
ru: **Length (Длина):** Расстояние, на котором декаль исчезает (в 3D-единицах). Декаль постепенно становится более прозрачной на этом расстоянии и полностью невидима в конце. Более высокие значения приводят к более плавному переходу затухания, что больше подходит для случаев, когда камера движется быстро.
ta: ** நீளம்: ** டெக்கால் மங்கிவிடும் தூரம் (3D அலகுகளில்). இந்த தூரத்தை விட டெக்கால் மெதுவாக மிகவும் வெளிப்படையானதாகி, இறுதியில் முற்றிலும் கண்ணுக்கு தெரியாதது. அதிக மதிப்புகள் மென்மையான மங்கலான மாற்றத்தை விளைவிக்கின்றன, இது கேமரா வேகமாக நகரும் போது மிகவும் பொருத்தமானது.
uk: **Довжина:** відстань, на якій наклейка зникає (у 3D). Наклейка повільно стає прозорішою на цій відстані і стає зовсім непомітною в кінці. Вищі значення призводять до більш плавного переходу згасання, що більше підходить, коли камера рухається швидко.
zh_tw: **Length：** 貼花淡出所跨距離（3D 單位）。貼花會在這段距離內逐漸透明，最後完全消失。此值越大，淡出越平滑，適合攝影機快速移動時使用。

source: Cull Mask
ga: Masc Cull
it: Maschera di culling
ru: Маска отсечения
ta: குல் மாச்க்
uk: Відбірна маска
zh_tw: 裁切遮罩

source: **Cull Mask:** Specifies which VisualInstance3D layers this decal will project on. By default, decals affect all layers. This is used so you can specify which types of objects receive the decal and which do not. This is especially useful so you can ensure that dynamic objects don't accidentally receive a Decal intended for the terrain under them.
ga: **Masc Cull: ** Sonraíonn sé cé na sraitheanna VisualInstance3D a thionscnóidh an decal seo orthu. De réir réamhshocraithe, bíonn tionchar ag decals ar gach sraithe. Úsáidtear é seo ionas gur féidir leat a shonrú cé na cineálacha rudaí a fhaigheann an decal agus cé nach ndéanann. Tá sé seo úsáideach go háirithe ionas gur féidir leat a chinntiú nach bhfaigheann rudaí dinimiciúla Decal atá beartaithe don tír-raon fúthu de thaisme.
pt_br: **Cull Mask:** Especifica em quais camadas de VisualInstance3D este decal será projetado. Por padrão, decals afetam todas as camadas. Isso é usado para que você possa especificar quais tipos de objetos recebem o decal e quais não recebem. Isso é especialmente útil para garantir que objetos dinâmicos não recebam acidentalmente um Decal destinado ao terreno sob eles.
ru: **Cull Mask:** Указывает, на какие слои VisualInstance3D будет проецироваться эта декаль. По умолчанию декали влияют на все слои. Это используется, чтобы вы могли указать, какие типы объектов получают декаль, а какие нет. Это особенно полезно, чтобы вы могли гарантировать, что динамические объекты случайно не получат декаль, предназначенную для ландшафта под ними.
ta: ** குல் மாச்க்: ** இந்த டெக்கால் எந்த விசுவல்இன்ச்டன்ச் 3 டி அடுக்குகளைக் குறிப்பிடுகிறது. இயல்பாக, டெக்கல்கள் அனைத்து அடுக்குகளையும் பாதிக்கின்றன. இது பயன்படுத்தப்படுகிறது, எனவே எந்த வகையான பொருள்கள் டெக்கலைப் பெறுகின்றன, அவை இல்லை என்பதைக் குறிப்பிடலாம். இது மிகவும் பயனுள்ளதாக இருக்கும், எனவே மாறும் பொருள்கள் தற்செயலாக அவற்றின் கீழ் உள்ள நிலப்பரப்பை நோக்கமாகக் கொண்ட ஒரு டெக்கலைப் பெறாது என்பதை உறுதிப்படுத்த முடியும்.
uk: **Cull Mask:** визначає, на які шари VisualInstance3D проектуватиметься ця наклейка. За замовчуванням наклейки впливають на всі шари. Це використовується для того, щоб ви могли вказати, які типи об’єктів отримують декаль, а які ні. Це особливо корисно, щоб ви могли гарантувати, що динамічні об’єкти випадково не отримають наклейку, призначену для рельєфу під ними.
zh_tw: **Cull Mask：** 指定貼花會投影到哪些 VisualInstance3D 圖層。預設會影響所有圖層。可使用此功能指定哪些物件會套用貼花，哪些不會。這對於避免動態物件套用到原本僅想作用於地形的貼花特別有用。

source: Decal rendering order
fr: Ordre de rendu des calques
ga: Ordú rindreála decal
it: Ordine di rendering della decalcomania
ru: Порядок отрисовки декалей
ta: டெக்கால் வழங்குதல் ஆர்டர்
uk: Порядок оформлення наклейки
zh_tw: 貼花繪製順序

source: By default, decals are ordered based on the size of their :abbr:`AABB (Axis-Aligned Bounding Box)` and the distance to the camera. AABBs that are closer to the camera are rendered first, which means that decal rendering order can sometimes appear to change depending on camera position if some decals are positioned at the same location.
ga: De réir réamhshocraithe, ordaítear decals bunaithe ar mhéid a gcuid: abbr: `AABB (Bosca Teorainneacha Aisínithe) `agus an fad chuig an gceamara. Déantar AABBanna atá níos gaire don cheamara a rinneadh ar dtús, rud a chiallaíonn gur cosúil go n-athraíonn ordú rindreála decal uaireanta ag brath ar shuíomh an cheamara má tá roinnt decals suite san áit chéanna.
pt_br: Por padrão, os decalques são ordenados com base no tamanho de seu :abbr:`AABB (Axis-Aligned Bounding Box)` e na distância até a câmera. AABBs que estão mais próximos da câmera são renderizados primeiro, o que significa que a ordem de renderização dos decals pode às vezes parecer mudar dependendo da posição da câmera, caso alguns decals estejam posicionados no mesmo local.
ru: По умолчанию декали упорядочиваются на основе размера их :abbr:`AABB (Axis-Aligned Bounding Box)` и расстояния до камеры. AABB-ы, которые находятся ближе к камере, визуализируются первыми, что означает, что порядок визуализации декалей иногда может меняться в зависимости от положения камеры, если некоторые декали расположены в одном и том же месте.
ta: இயல்பாக, டெக்கல்கள் அவற்றின் அளவின் அடிப்படையில் ஆர்டர் செய்யப்படுகின்றன: ABBR: `AABB (அச்சு-சீரமைக்கப்பட்ட எல்லை பெட்டி)` மற்றும் கேமராவுக்கான தூரம். கேமராவுடன் நெருக்கமாக இருக்கும் AABB கள் முதலில் வழங்கப்படுகின்றன, அதாவது சில டெக்கல்கள் ஒரே இடத்தில் நிலைநிறுத்தப்பட்டால் கேமரா நிலையைப் பொறுத்து டெக்கால் வழங்குதல் ஆர்டர் சில நேரங்களில் மாறக்கூடும்.
uk: За замовчуванням наклейки впорядковуються на основі розміру їхнього :abbr:`AABB (Axis-Aligned Bounding Box)` та відстані до камери. AABB, розташовані ближче до камери, відображаються першими, що означає, що порядок візуалізації декалей іноді може змінюватися залежно від положення камери, якщо деякі декалі розташовані в тому самому місці.
zh_tw: 預設情況下，貼花的繪製順序會依據其 :abbr:`AABB (軸對齊包圍盒)` 的大小以及與相機的距離來排序。距離相機較近的 AABB 會先被繪製，這代表如果多個貼花重疊時，隨著相機位置改變，貼花的顯示順序也可能會改變。

source: To resolve this, you can adjust the **Sorting Offset** property in the VisualInstance3D section of the Decal node inspector. This offset is not a strict priority order, but a *guideline* that the renderer will use as the AABB size still affects how decal sorting works. Therefore, higher values will *always* result in the decal being drawn above other decals with a lower sorting offset.
ga: Chun é seo a réiteach, is féidir leat an maoin **Sorting Offset** a choigeartú sa chuid VisualInstance3D den chigire nód Decal. Ní ordú docht tosaíochta é an fhritháireamh seo, ach* treoirlín* a úsáidfidh an rindeoir mar bíonn tionchar fós ag méid an AABB ar an gcaoi a n-oibríonn sórtáil decal. Dá bhrí sin, beidh mar thoradh ar luachanna níos airde*i gcónaí* go dtarraingfear an decal os cionn decals eile le fritháireamh sórtála níos ísle.
pt_br: Para resolver isso, você pode ajustar a propriedade **Sorting Offset** na seção VisualInstance3D do inspetor do nó Decal. Esse deslocamento não é uma ordem de prioridade rígida, mas sim uma *diretriz* que o renderizador usará, já que o tamanho do AABB ainda afeta como a ordenação dos decals funciona. Portanto, valores mais altos irão *sempre* resultar no decal sendo desenhado acima de outros decals com um deslocamento de ordenação menor.
ru: Чтобы решить эту проблему, можно настроить свойство **Sorting Offset (Смещение сортировки)** в разделе VisualInstance3D инспектора узла Decal. Это смещение не является строгим порядком приоритета, а *руководством*, которое будет использовать рендерер, поскольку размер AABB по-прежнему влияет на то, как работает сортировка декалей. Поэтому более высокие значения *всегда* приведут к тому, что декаль будет отрисовываться выше других декалей с меньшим смещением сортировки.
ta: இதைத் தீர்க்க, டெக்கால் முனை இன்ச்பெக்டரின் விசுவல் இன்ச்டன்ச் 3 டி பிரிவில் ** வரிசையாக்க ஆஃப்செட் ** சொத்தை சரிசெய்யலாம். இந்த ஆஃப்செட் ஒரு கடுமையான முன்னுரிமை ஆணை அல்ல, ஆனால் AABB அளவு இன்னும் டெக்கால் வரிசையாக்கம் எவ்வாறு செயல்படுகிறது என்பதை AABB அளவு இன்னும் பாதிக்கும் என்பதால் ரெண்டரர் பயன்படுத்தும் * வழிகாட்டுதல் *. ஆகையால், அதிக மதிப்புகள் * எப்போதும் * குறைந்த வரிசையாக்க ஆஃப்செட் மூலம் மற்ற டெக்கல்களுக்கு மேலே வரையப்பட்டிருக்கும்.
uk: Щоб вирішити цю проблему, ви можете налаштувати властивість **Sorting Offset** у розділі VisualInstance3D інспектора вузлів Decal. Це зміщення не є суворим порядком пріоритету, але *керівним принципом*, який використовуватиме рендерер, оскільки розмір AABB усе ще впливає на роботу сортування декалей. Тому вищі значення *завжди* призведуть до того, що наклейка буде намальована над іншими наклейками з меншим зміщенням сортування.
zh_tw: 為了解決這個問題，你可以在 Decal 節點的屬性面板中，於 VisualInstance3D 區段調整 **Sorting Offset** 屬性。這個偏移量並不是嚴格的優先順序，而是給算繪器的一個*參考值*，因為 AABB 大小仍會影響貼花的排序。因此，較高的數值會*總是*讓該貼花繪製在 Sorting Offset 較低的貼花之上。

source: If you want to ensure a decal is always rendered on top of other decals, you need to set its **Sorting Offset** property to a positive value greater than the AABB length of the largest decal that may overlap it. To make this decal drawn behind other decals instead, set the **Sorting Offset** to the same negative value.
ga: Más mian leat a chinntiú go ndéantar decal a rinneadh i gcónaí ar bharr decals eile, ní mór duit a maoin **Sórtáil Offset** a shocrú go luach dearfach níos mó ná fad AABB den decal is mó a d'fhéadfadh forluí air. Chun an decal seo a tharraingt taobh thiar de decals eile ina ionad sin, socraigh an **Sórtáil Offset** go dtí an luach diúltach céanna.
pt_br: Se você quiser garantir que um decal seja sempre renderizado acima de outros decals, é necessário definir sua propriedade **Sorting Offset** para um valor positivo maior que o comprimento do AABB do maior decal que possa se sobrepor a ele. Para que esse decal seja desenhado atrás de outros decals, em vez disso, defina o **Sorting Offset** para o mesmo valor negativo.
ru: Если вы хотите, чтобы декаль всегда отображалась поверх других декалей, вам нужно установить ее свойство **Sorting Offset** на положительное значение, большее, чем длина AABB самой большой декали, которая может ее перекрывать. Чтобы сделать эту декаль нарисованной позади других декалей, установите **Sorting Offset** на то же отрицательное значение.
ta: ஒரு டெக்கால் எப்போதுமே மற்ற டெக்கல்களுக்கு மேல் வழங்கப்படுவதை நீங்கள் உறுதிப்படுத்த விரும்பினால், அதன் ** வரிசையாக்க ஆஃப்செட் ** சொத்தை மிகப் பெரிய டெக்காலின் AABB நீளத்தை விட அதிகமான நேர்மறையான மதிப்பாக அமைக்க வேண்டும். அதற்கு பதிலாக மற்ற டெக்கல்களுக்குப் பின்னால் இந்த டெக்கால் வரைய, ** வரிசையாக்க ஆஃப்செட் ** ஐ அதே எதிர்மறை மதிப்புக்கு அமைக்கவும்.
uk: Якщо ви хочете, щоб декаль завжди відтворювалася поверх інших декалей, вам потрібно встановити для властивості **Sorting Offset** додатне значення, що перевищує довжину AABB найбільшої декалі, яка може її перекривати. Щоб натомість ця декаль була намальована за іншими декалями, установіть для **Зміщення сортування** те саме від’ємне значення.
zh_tw: 若要確保某個貼花總是顯示在其他貼花之上，請將其 **Sorting Offset** 屬性設為比所有可能重疊的貼花最大 AABB 長度還要大的正值。若希望該貼花顯示在其他貼花之下，則設為相同數值的負值即可。

source: VisualInstance3D Sorting Offset comparison on Decals
ga: Comparáid fhritháireamh Sórtála VisualInstance3D ar Decals
pt_br: Comparação de Sorting Offset do VisualInstance3D em Decals
ru: Сравнение Смещения Сортировки VisualInstance3D на Декалях
ta: VisualInstance3d வரிசைப்படுத்தல் ஆஃப்செட் ஒப்பீடு டெக்கால்களில்
uk: Порівняння зсуву сортування VisualInstance3D на наклейках
zh_tw: VisualInstance3D Sorting Offset 在貼花上的比較

source: Tweaking performance and quality
es: Ajustar el rendimiento y la calidad
ga: Feidhmíocht agus cáilíocht a athrú
ru: Настройка производительности и качества
ta: செயல்திறன் மற்றும் தகுதி முறுக்குதல்
uk: Налаштування продуктивності та якості
zh_tw: 效能

source: Decal rendering performance is mostly determined by their screen coverage, but also their number. In general, a few large decals that cover up most of the screen will be more expensive to render than many small decals that are scattered around.
ga: Cinneann feidhmíocht rindreála decal den chuid is mó de réir a gclúdach scáileáin, ach freisin a líon. Go ginearálta, beidh cúpla decal mór a chlúdaíonn an chuid is mó den scáileán níos costasaí a rinneadh ná go leor decals beaga atá scaipthe timpeall.
pt_br: O desempenho da renderização de decals é determinado principalmente pela sua cobertura na tela, mas também pela sua quantidade. Em geral, alguns decals grandes que cobrem a maior parte da tela serão mais caros de renderizar do que muitos decals pequenos espalhados pela cena.
ru: Производительность рендеринга декалей в основном определяется их покрытием экрана, но также и их количеством. В целом, рендеринг нескольких больших декалей, покрывающих большую часть экрана, будет дороже, чем рендеринг множества маленьких декалей, разбросанных повсюду.
ta: டெக்கால் வழங்குதல் செயல்திறன் பெரும்பாலும் அவர்களின் திரை கவரேசால் தீர்மானிக்கப்படுகிறது, ஆனால் அவற்றின் எண்ணிக்கையும் கூட. பொதுவாக, திரையின் பெரும்பகுதியை மறைக்கும் சில பெரிய டெக்கல்கள் பல சிறிய டெக்கல்களை விட சிதறடிக்கப்பட்டதை விட வழங்க அதிக விலை கொண்டதாக இருக்கும்.
uk: Ефективність відтворення наклейок здебільшого визначається їх покриттям екрана, а також їх кількістю. Загалом, кілька великих наклейок, які покривають більшу частину екрана, будуть дорожчими для візуалізації, ніж багато маленьких наклейок, які розкидані навколо.
zh_tw: 裝飾算繪效能主要取決於其螢幕覆蓋範圍及其數量。一般來說，覆蓋大部分螢幕的一些大裝飾的算繪成本會比散佈在各處的許多小裝飾的算繪成本更高。
