Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_decals.po
Languages: es, fr, ga, it, pt_br, ru, ta, uk, zh_tw

source: To improve rendering performance, you can enable the **Distance Fade** property as described above. This will make distant decals fade out when they are far away from the camera (and may have little to no impact on the final scene rendering). Using node groups, you can also prevent non-essential decorative decals from spawning based on user configuration.
ga: Chun feidhmíocht rindreála a fheabhsú, is féidir leat an mhaoin **Distance Fade** a chumasú mar a thuairiscítear thuas. Fágfaidh sé seo go laghdófar decals i bhfad i gcéin nuair a bhíonn siad i bhfad ar shiúl ón gceamara (agus b’fhéidir nach mbeidh mórán tionchair acu ar rindreáil an radhairc deiridh). Ag baint úsáide as grúpaí nód, is féidir leat freisin decals maisiúil neamhriachtanacha a chosc ó sceite bunaithe ar chumraíocht úsáideora.
pt_br: Para melhorar o desempenho de renderização, você pode habilitar a propriedade **Distance Fade** conforme descrito acima. Isso fará com que decals distantes desapareçam quando estiverem longe da câmera (podendo ter pouco ou nenhum impacto na renderização final da cena). Usando grupos de nós, você também pode evitar que decals decorativos não essenciais sejam instanciados com base na configuração do usuário.
ru: Для повышения производительности рендеринга можно включить свойство **Distance Fade (Исчезать на расстоянии)**, как описано выше. Это заставит дальние декали исчезать, когда они находятся далеко от камеры (и может не оказать существенного влияния на конечный рендеринг сцены). Используя группы узлов, можно также предотвратить появление ненужных декоративных декалей на основе конфигурации пользователя.
ta: வழங்குதல் செயல்திறனை மேம்படுத்த, மேலே விவரிக்கப்பட்டுள்ளபடி ** தூர மங்கலான ** சொத்தை இயக்கலாம். இது கேமராவிலிருந்து வெகு தொலைவில் இருக்கும்போது தொலைதூர டெக்கல்கள் மங்கிவிடும் (மேலும் இறுதி காட்சி ஒழுங்கமைப்பில் எந்த தாக்கமும் ஏற்படாது). முனை குழுக்களைப் பயன்படுத்தி, பயனர் உள்ளமைவின் அடிப்படையில் அத்தியாவசியமற்ற அலங்கார டெக்கால்கள் முட்டையிடுவதைத் தடுக்கலாம்.
uk: Щоб покращити продуктивність візуалізації, ви можете ввімкнути властивість **Distance Fade**, як описано вище. Це призведе до того, що віддалені наклейки зникають, коли вони знаходяться далеко від камери (і можуть практично не вплинути на остаточне відтворення сцени). Використовуючи групи вузлів, ви також можете запобігти появі несуттєвих декоративних наклейок на основі конфігурації користувача.
zh_tw: 若要提高算繪效能，您可以如上所述啟用 **距離淡入淡出** 屬性。這將使遠處的裝飾在遠離相機時淡出（並且可能對最終場景算繪幾乎沒有影響）。使用節點群組，您還可以根據使用者配置防止產生非必要的裝飾裝飾。

source: The way decals are rendered also has an impact on performance. The :ref:`Rendering > Textures > Decals > Filter<class_ProjectSettings_property_rendering/textures/decals/filter>` advanced project setting lets you control how decal textures should be filtered. **Nearest/Linear** does not use mipmaps. However, decals will look grainy at a distance. **Nearest/Linear Mipmaps** will look smoother at a distance, but decals will look blurry when viewed from oblique angles. This can be resolved by using **Nearest/Linear Mipmaps Anisotropic**, which provides the highest quality, but is also slower to render.
pt_br: Como os decalques são renderizados também impacta no desempenho. A configuração avançada do projeto :ref:`Rendering > Textures > Decals > Filter<class_ProjectSettings_property_rendering/textures/decals/filter>` permite controlar como as texturas de decal devem ser filtradas. **Nearest/Linear** não utiliza mipmaps. No entanto, os decals parecerão granulados à distância. **Nearest/Linear Mipmaps** terão uma aparência mais suave à distância, mas os decals parecerão borrados quando vistos de ângulos oblíquos. Isso pode ser resolvido usando **Nearest/Linear Mipmaps Anisotropic**, que fornece a maior qualidade, mas também é mais lento para renderizar.
ru: Способ рендеринга декалей также влияет на производительность. Расширенная настройка проекта :ref:`Rendering > Textures > Decals > Filter<class_ProjectSettings_property_rendering/textures/decals/filter>` позволяет вам контролировать, как должны фильтроваться текстуры декалей. **Nearest/Linear** не использует mip-текстуры. Однако декали будут выглядеть зернистыми на расстоянии. **Nearest/Linear Mip-текстуры** будут выглядеть более гладкими на расстоянии, но декали будут выглядеть размытыми при просмотре под косыми углами. Эту проблему можно решить с помощью **Nearest/Linear Mip-текстуры Anisotropic**, которая обеспечивает наивысшее качество, но также медленнее рендерится.
uk: Спосіб відображення наклейок також впливає на продуктивність. Розширене налаштування проекту :ref:`Rendering > Textures > Decals > Filter<class_ProjectSettings_property_rendering/textures/decals/filter>` дозволяє контролювати, як слід фільтрувати текстури декалів. **Найближчий/лінійний** не використовує mip-карти. Однак на відстані наклейки виглядатимуть зернистими. **Найближчі/лінійні Mipmaps** виглядатимуть гладкішими на відстані, але наклейки виглядатимуть розмитими, якщо дивитися під кутом. Цю проблему можна вирішити за допомогою **Nearest/Linear Mipmaps Anisotropic**, яка забезпечує найвищу якість, але також повільніше рендериться.
zh_tw: 貼花的繪製方式也會影響效能。:ref:`Rendering > Textures > Decals > Filter<class_ProjectSettings_property_rendering/textures/decals/filter>` 進階專案設定可調整貼花貼圖的過濾方式。**Nearest/Linear** 不使用 mipmap，遠距離下貼花會顯得顆粒感強。**Nearest/Linear Mipmaps** 距離遠時較為平滑，但斜角觀看會模糊。**Nearest/Linear Mipmaps Anisotropic** 可解決此問題，畫質最佳但效能開銷較高。

source: If your project has a pixel art style, consider setting the filter to one of the **Nearest** values so that decals use nearest-neighbor filtering. Otherwise, stick to **Linear**.
ga: Má tá stíl ealaíne picteilín ag do thionscadal, smaoinigh ar an scagaire a shocrú go ceann de na luachanna **is gaire** ionas go n-úsáideann decals scagadh comharsa is gaire. Seachas sin, cloí len**Línear**.
pt_br: Se o seu projeto tiver um estilo de pixel art, considere definir o filtro para um dos valores **Nearest** para que os decals usem filtragem por vizinho mais próximo. Caso contrário, mantenha em **Linear**.
ru: Если ваш проект имеет стиль пиксельной графики, рассмотрите возможность установки фильтра на одно из значений **Nearest (Ближайший)**, чтобы декали использовали фильтрацию ближайшего соседа. В противном случае придерживайтесь **Linear (Линейный)**.
ta: உங்கள் திட்டத்திற்கு படப்புள்ளி கலை பாணி இருந்தால், வடிகட்டியை ** அருகிலுள்ள ** மதிப்புகளில் ஒன்றிற்கு அமைப்பதைக் கவனியுங்கள், இதனால் டெக்கால்கள் அருகிலுள்ள-அண்டை வடிகட்டலைப் பயன்படுத்துகின்றன. இல்லையெனில், ** நேரியல் ** உடன் ஒட்டிக்கொள்க.
uk: Якщо ваш проект має стиль піксельного мистецтва, спробуйте встановити для фільтра одне зі значень **Найближчий**, щоб наклейки використовували фільтрацію найближчого сусіда. В іншому випадку дотримуйтесь **Linear**.
zh_tw: 如果您的專案具有像素藝術風格，請考慮將濾鏡設定為**最近**值之一，以便裝飾使用最近鄰濾鏡。否則，請堅持**線性**。

source: Limitations
es: Limitaciones
fr: Limites
ga: Teorainneacha
it: Limitazioni
pt_br: Limitações
ru: Ограничения
ta: வரம்புகள்
uk: Обмеження
zh_tw: 限制

source: Decals cannot affect material properties other than the ones listed above, such as height (for parallax mapping).
ga: Ní féidir le maidí dul i bhfeidhm ar airíonna ábhair seachas na cinn atá liostaithe thuas, mar shampla airde (le haghaidh mapáil parallax).
pt_br: Decals não podem afetar propriedades de materiais além das listadas acima, como altura (para parallax mapping).
ru: Декали не могут влиять на свойства материала, кроме перечисленных выше, таких как высота (для параллаксного отображения).
ta: உயரம் (இடமாறு மேப்பிங்கிற்கு) போன்ற மேலே பட்டியலிடப்பட்டுள்ளதைத் தவிர வேறு பொருள் பண்புகளை டெக்கல்கள் பாதிக்க முடியாது.
uk: Наклейки не можуть впливати на властивості матеріалу, крім перерахованих вище, наприклад на висоту (для відображення паралакса).
zh_tw: 裝飾不能影響上面列出的屬性之外的材質屬性，例如高度（對於視差貼圖）。

source: For performance reasons, decals use purely fixed rendering logic. This means decals cannot use custom shaders. However, custom shaders on the projected surfaces are able to read the information that is overridden by decals on top of them, such as roughness and metallic.
ga: Ar chúiseanna feidhmíochta, úsáideann decals loighic rindreála seasta amháin. Ciallaíonn sé seo nach féidir le decals scáthóirí saincheaptha a úsáid. Mar sin féin, tá scáthóirí saincheaptha ar na dromchlaí réamh-mheasta in ann an fhaisnéis atá sáraithe ag decals ar a mbarr a léamh, mar shampla garbh agus miotalach.
pt_br: Por razões de desempenho, decals usam somente lógica de renderização fixa. Isso significa que decals não podem usar shaders personalizados. No entanto, shaders personalizados nas superfícies projetadas conseguem ler as informações que são substituídas por decals sobre elas, como roughness e metallic.
ru: По соображениям производительности декали используют чисто фиксированную логику рендеринга. Это означает, что декали не могут использовать пользовательские шейдеры. Однако пользовательские шейдеры на проецируемых поверхностях способны считывать информацию, которая переопределяется декалями поверх них, например, шероховатость и металличность.
ta: செயல்திறன் காரணங்களுக்காக, டெக்கல்கள் முற்றிலும் நிலையான வழங்குதல் தர்க்கத்தைப் பயன்படுத்துகின்றன. இதன் பொருள் டெக்கால்கள் தனிப்பயன் சேடர்களைப் பயன்படுத்த முடியாது. இருப்பினும், திட்டமிடப்பட்ட மேற்பரப்புகளில் உள்ள தனிப்பயன் சேடர்கள், கரடுமுரடான மற்றும் உலோகம் போன்ற டெக்கல்களால் மீறப்பட்டுள்ள தகவல்களைப் படிக்க முடிகிறது.
uk: З міркувань продуктивності наклейки використовують суто фіксовану логіку відтворення. Це означає, що наклейки не можуть використовувати власні шейдери. Однак спеціальні шейдери на спроектованих поверхнях можуть зчитувати інформацію, яку перекривають наклейки на них, як-от шорсткість і металік.
zh_tw: 出於性能原因，裝飾使用純粹固定的算繪邏輯。這意味著裝飾不能使用自訂著色器。但是，投影表面上的自訂著色器能夠讀取被其頂部的裝飾覆蓋的信息，例如粗糙度和金屬度。

source: When using the Forward+ renderer, Godot uses a *clustering* approach for decal rendering. As many decals as desired can be added (as long as performance allows). However, there's still a default limit of 512 *clustered elements* that can be present in the current camera view. A clustered element is an omni light, a spot light, a :ref:`decal <doc_using_decals>` or a :ref:`reflection probe <doc_reflection_probes>`. This limit can be increased by adjusting :ref:`Max Clustered Elements<class_ProjectSettings_property_rendering/limits/cluster_builder/max_clustered_elements>` in **Project Settings > Rendering > Limits > Cluster Builder**.
pt_br: Ao usar o renderizador Avançado+, o Godot utiliza uma abordagem de *clustering* para a renderização de decals. Quantos decals forem desejados podem ser adicionados (desde que o desempenho permita). No entanto, ainda existe um limite padrão de 512 *elementos agrupados* que podem estar presentes na visão atual da câmera. Um elemento agrupado é uma omni light, uma spot light, um :ref:`decal <doc_using_decals>` ou uma :ref:`reflection probe <doc_reflection_probes>`. Esse limite pode ser aumentado ajustando :ref:`Max Clustered Elements<class_ProjectSettings_property_rendering/limits/cluster_builder/max_clustered_elements>` em **Configurações de Projeto > Renderização > Limites > Cluster Builder**.
ru: При использовании рендерера Forward+ Godot использует подход *кластеризации* для рендеринга декалей. Можно добавить столько декалей, сколько необходимо (при условии, что позволяет производительность). Однако по-прежнему существует ограничение по умолчанию в 512 *кластеризованных элементов*, которые могут присутствовать в текущем виде камеры. Кластеризованный элемент — это всенаправленный свет, точечный свет, :ref:`decal <doc_using_decals>` или :ref:`reflection probe <doc_reflection_probes>`. Этот лимит можно увеличить, настроив :ref:`Max Clustered Elements<class_ProjectSettings_property_rendering/limits/cluster_builder/max_clustered_elements>` в **Project Settings > Rendering > Limits > Cluster Builder**.
uk: Використовуючи інструмент візуалізації Forward+, Godot використовує підхід *кластеризації* для візуалізації декалей. Можна додати скільки завгодно наклейок (якщо дозволяє продуктивність). Проте все ще існує обмеження за замовчуванням у 512 *згрупованих елементів*, які можуть бути присутніми в поточному поданні камери. Кластерним елементом є всесвітній світильник, прожектор, :ref:`decal <doc_using_decals>` або :ref:`reflection probe <doc_reflection_probes>`. Цей ліміт можна збільшити, налаштувавши :ref:`Max Clustered Elements<class_ProjectSettings_property_rendering/limits/cluster_builder/max_clustered_elements>` в **Project Settings > Rendering > Limits > Cluster Builder**.
zh_tw: 在使用 Forward+ 算繪器時，Godot 以*叢集*方式繪製貼花。你可以根據效能盡量加入貼花，但目前相機影格下仍有限制，預設最多 512 個*叢集元素*。叢集元素包括全向光、聚光燈、 :ref:`decal <doc_using_decals>` 及 :ref:`reflection probe <doc_reflection_probes>` 。 :ref:`Max Clustered Elements<class_ProjectSettings_property_rendering/limits/cluster_builder/max_clustered_elements>` 可於 **專案設定 > Rendering > Limits > Cluster Builder > Max Clustered Elements** 提高限制。

source: When using the Mobile renderer, only 8 decals can be applied on each individual Mesh *resource*. If there are more decals affecting a single mesh, not all of them will be rendered on the mesh.
pt_br: Ao usar o renderizador Mobile, apenas 8 decals podem ser aplicados em cada *resource* de Mesh individual. Se houver mais decals afetando uma única mesh, nem todos serão renderizados nela.
ru: При использовании Mobile рендерера на каждый отдельный Mesh *ресурс* можно нанести только 8 декалей. Если на одну сетку влияет больше декалей, не все из них будут отображены на сетке.
uk: У разі використання мобільного рендерера лише 8 наклейок можна застосувати до кожного окремого *ресурсу* Mesh. Якщо на одну сітку впливає більше декалів, не всі вони відображатимуться на сітці.
zh_tw: 當使用 Mobile 算繪器時，每個個別的 Mesh *資源* 上只能套用 8 個貼花。如果有更多貼花影響單個 Mesh，將不會在該 Mesh 上渲染所有貼花。

source: Decals are only supported in the Clustered Forward and Forward Mobile rendering backends, not the Compatibility backend.
ta: டெக்கல்கள் கொத்து முன்னோக்கி மற்றும் முன்னோக்கி மொபைல் வழங்குதல் பின்தளத்தில் மட்டுமே ஆதரிக்கப்படுகின்றன, பொருந்தக்கூடிய பின்தளத்தில் அல்ல.

source: If using the Compatibility backend, consider using Sprite3D as an alternative for projecting decals onto (mostly) flat surfaces.
ta: பொருந்தக்கூடிய பின்தளத்தில் பயன்படுத்தினால், (பெரும்பாலும்) தட்டையான மேற்பரப்புகளில் டெக்கல்களைக் காண்பிப்பதற்கான மாற்றாக SPRITE3D ஐப் பயன்படுத்துவதைக் கவனியுங்கள்.

source: When using the Forward Mobile backend, only 8 decals can be applied on each individual Mesh *resource*. If there are more decals affecting a single mesh, not all of them will be rendered on the mesh.
ta: முன்னோக்கி மொபைல் பின்தளத்தில் பயன்படுத்தும் போது, ஒவ்வொரு தனிப்பட்ட கண்ணி *வளத்திலும் 8 டெக்கல்களை மட்டுமே பயன்படுத்த முடியும். ஒரு கண்ணி பாதிக்கும் அதிகமான டெக்கல்கள் இருந்தால், அவை அனைத்தும் கண்ணி மீது வழங்கப்படாது.
