Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_decals.po
Languages: es, fr, ga, it, pt_br, ru, ta, uk, zh_tw

source: Using decals
fr: Utiliser des décalques
ga: Ag baint úsáide as decals
it: Utilizzo delle decalcomanie
ru: Использование декалей
ta: டெக்கல்களைப் பயன்படுத்துதல்
uk: Використання наклейок
zh_tw: 使用貼花

source: Decals are only supported in the Forward+ and Mobile renderers, not the Compatibility renderer.
ru: Декали поддерживаются только в рендерерах Forward+ и Mobile, но не в Compatibility.
uk: Наклейки підтримуються лише у засобах візуалізації Forward+ і Mobile, але не підтримуються для рендерера сумісності.
zh_tw: 貼花僅支援於 Forward+ 與 Mobile 算繪器，不支援 Compatibility 算繪器。

source: If using the Compatibility renderer, consider using Sprite3D as an alternative for projecting decals onto (mostly) flat surfaces.
pt_br: Se estiver usando o renderizador de Compatibilidade, considere usar o Sprite3D como alternativa para projetar decalques em superfícies (principalmente) planas.
ru: При использовании рендерера совместимости рассмотрите возможность использования Sprite3D в качестве альтернативы для проецирования декалей на (в основном) плоские поверхности.
uk: Якщо ви використовуєте рендерер сумісності, подумайте про використання Sprite3D як альтернативи для проектування наклейок на (переважно) плоскі поверхні.
zh_tw: 如果使用 Compatibility 算繪器，請考慮改用 Sprite3D 將貼花投射到（大多為）平坦表面上。

source: Decals are projected textures that apply on opaque or transparent surfaces in 3D. This projection happens in real-time and doesn't rely on mesh generation. This allows you to move decals every frame with only a small performance impact, even when applied on complex meshes.
ga: Is uigeachtaí réamh-mheasta iad decals a chuireann i bhfeidhm ar dromchlaí trédhearcacha nó trédhearcacha Tarlaíonn an teilgean seo i bhfíor-am agus ní bhraith sé ar ghiniúint mogalra. Ligeann sé seo duit decals a bhogadh gach fráma gan ach tionchar beag feidhmíochta, fiú nuair a chuirtear i bhfeidhm ar mogalra casta.
pt_br: Decals são texturas projetadas que se aplicam em superfícies opacas ou transparentes em 3D. Essa projeção acontece em tempo real e não depende da geração de malhas. Isso permite mover decals a cada frame com apenas um pequeno impacto no desempenho, mesmo quando aplicados em malhas complexas.
ru: Декали (Decals) — это проецируемые текстуры, которые применяются к непрозрачным или прозрачным поверхностям в 3D. Эта проекция происходит в реальном времени и не зависит от генерации сетки. Это позволяет перемещать декали в каждом кадре с небольшим влиянием на производительность, даже при применении к сложным сеткам.
ta: டெக்கல்கள் 3D இல் ஒளிபுகா அல்லது வெளிப்படையான மேற்பரப்புகளில் பொருந்தும் திட்டமிடப்பட்ட அமைப்புகள். இந்த திட்டம் நிகழ்நேரத்தில் நடக்கிறது மற்றும் கண்ணி தலைமுறையை நம்பவில்லை. சிக்கலான மெச்களில் பயன்படுத்தப்பட்டாலும் கூட, ஒவ்வொரு சட்டத்தையும் ஒரு சிறிய செயல்திறன் தாக்கத்துடன் மட்டுமே நகர்த்த இது உங்களை அனுமதிக்கிறது.
uk: Наклейки — це проектовані текстури, які наносяться на непрозорі або прозорі поверхні в 3D. Ця проекція виконується в реальному часі й не залежить від створення сітки. Це дозволяє переміщувати наклейки в кожному кадрі з невеликим впливом на продуктивність, навіть якщо накладено на складні сітки.
zh_tw: 裝飾是應用於 3D 不透明或透明表面的投影紋理。此投影是即時發生的，不依賴網格生成。這允許您在每一影格移動裝飾，即使在複雜的網格上應用時，也只會對性能產生很小的影響。

source: While decals cannot add actual geometry detail onto the projected surface, decals can still make use of physically-based rendering to provide similar properties to full-blown :abbr:`PBR (Physically-Based Rendering)` materials.
ga: Cé nach féidir le decals mionsonraí geoiméadrachta iarbhír a chur ar an dromchla réamh-mheasta, is féidir le decals úsáid a bhaint as rindreáil fisiciúil fós chun airíonna comhchosúla a sholáthar le hábhair iomlán-blown:abbr: `PBR (Fisicaly-Bhunaithe Rendering) `.
pt_br: Embora decalques (Decals) não possam adicionar detalhes geométricos reais à superfície projetada, eles ainda podem recorrer ao uso de renderização baseada em física para fornecer propriedades semelhantes a materiais completos de :abbr:`PBR (Physically-Based Rendering)`.
ru: Хотя декали не могут добавлять реальные геометрические детали на проецируемую поверхность, они все равно могут использовать физически обоснованный рендеринг, чтобы обеспечить свойства, аналогичные свойствам полноценных :abbr:`PBR (физически обоснованный рендеринг)` материалов.
ta: டெக்கால்கள் உண்மையான வடிவியல் விவரங்களை திட்டமிடப்பட்ட மேற்பரப்பில் சேர்க்க முடியாது என்றாலும், டெக்கால்கள் இன்னும் ஒரே மாதிரியான பண்புகளை வழங்குவதற்காக உடல் ரீதியாக அடிப்படையிலான ரெண்டரிங்கைப் பயன்படுத்தலாம்: ஏபிபிஆர்: `பிபிஆர் (உடல் அடிப்படையிலான ரெண்டரிங்)` பொருட்கள்.
uk: Хоча декалі не можуть додати фактичні геометричні деталі на спроектовану поверхню, декалі все одно можуть використовувати фізичну візуалізацію, щоб забезпечити подібні властивості до повномасштабних матеріалів :abbr:`PBR (Physical-Based Rendering)`.
zh_tw: 雖然貼花無法在投影表面新增實際幾何細節，但仍可利用 :abbr:`PBR (物理式著色)` 算繪，讓貼花擁有與完整 PBR 材質類似的特性。

source: On this page, you'll learn:
es: En esta pagina aprenderá:
ga: Ar an leathanach seo, foghlaimeoidh tú:
it: In questa pagina imparerai:
ru: В этом руководстве вы узнаете:
ta: இந்த பக்கத்தில், நீங்கள் கற்றுக்கொள்வீர்கள்:
uk: На цій сторінці ви дізнаєтеся:
zh_tw: 在本指南中，我們將學到：

source: How to set up decals in the 3D editor.
ga: Conas decals a chur ar bun san eagarthóir 3D.
pt_br: Como configurar decalques no editor 3D.
ru: Как настроить декали в 3D-редакторе.
ta: 3 டி எடிட்டரில் டெக்கல்களை அமைப்பது எப்படி.
uk: Як налаштувати декалі в 3D-редакторі.
zh_tw: 如何在 3D 編輯器中設定裝飾。

source: How to create decals during gameplay in a 3D scene (such as bullet impacts).
ga: Conas decals a chruthú le linn gameplay i radharc 3D (mar shampla tionchair piléar).
pt_br: Como criar decalques durante o jogo em uma cena 3D (como impactos de balas).
ru: Как создавать декали во время игрового процесса в 3D-сцене (например, попадания пуль).
ta: ஒரு 3D காட்சியில் (புல்லட் தாக்கங்கள் போன்றவை) விளையாட்டின் போது டெக்கல்களை உருவாக்குவது எப்படி.
uk: Як налаштувати декалі в 3D-редакторі.
zh_tw: 如何在遊戲過程中為 3D 場景建立裝飾（例如彈孔）。

source: How to balance decal configuration between performance and quality.
fr: Comment équilibrer la configuration des décalques entre performance et qualité.
ga: Conas cumraíocht decal a chothromú idir feidhmíocht agus cáilíocht.
pt_br: Como equilibrar a configuração do decalque entre desempenho e qualidade.
ru: Как сбалансировать конфигурацию наклеек между производительностью и качеством.
ta: செயல்திறன் மற்றும் தரத்திற்கு இடையில் டெக்கால் உள்ளமைவை எவ்வாறு சமநிலைப்படுத்துவது.
uk: Як збалансувати конфігурацію наклейки між продуктивністю та якістю.
zh_tw: 如何為裝飾的配置進行性能和品質之間的平衡。

source: The Godot demo projects repository contains a `3D decals demo <https://github.com/godotengine/godot-demo-projects/tree/master/3d/decals>`__.
it: Il repository dei progetti demo di Godot contiene una `demo per le decalcomanie 3D <https://github.com/godotengine/godot-demo-projects/tree/master/3d/decals>`__.
ru: Репозиторий демо-проектов Godot содержит `пример 3D декалей <https://github.com/godotengine/godot-demo-projects/tree/master/3d/decals>`__.
uk: Репозиторій демонстраційних проектів Godot містить `демонстрацію 3D decals <https://github.com/godotengine/godot-demo-projects/tree/master/3d/decals>`__.
zh_tw: Godot 的範例專案庫中包含了一個「3D 貼花」示範專案：`3D decals demo <https://github.com/godotengine/godot-demo-projects/tree/master/3d/decals>`__。

source: If you're looking to write arbitrary 3D text on top of a surface, use :ref:`doc_3d_text` placed close to a surface instead of a Decal node.
fr: Si vous cherchez à écrire un texte 3D arbitraire sur une surface, utilisez :ref:`doc_3d_text` placé près d'une surface au lieu d'un nœud Decal.
ga: Má tá tú ag iarraidh téacs treallach 3D a scríobh ar bharr dromchla, bain úsáid as: ref: `doc_3d_text` a chuirtear gar do dhromchla in ionad nód Decal.
pt_br: Se você deseja escrever texto 3D arbitrário sobre uma superfície, use :ref:`doc_3d_text` colocado próximo a uma superfície em vez de um nó Decal.
ru: Если вы хотите написать произвольный 3D-текст поверх поверхности, используйте :ref:`doc_3d_text`, размещенный близко к поверхности, вместо узла Decal.
ta: நீங்கள் ஒரு மேற்பரப்பின் மேல் தன்னிச்சையான 3D உரையை எழுத விரும்பினால், பயன்படுத்தவும்: குறிப்பு: `doc_3d_text` ஒரு டெக்கால் முனைக்கு பதிலாக ஒரு மேற்பரப்புக்கு அருகில் வைக்கப்படுகிறது.
uk: Якщо ви хочете написати довільний 3D-текст поверх поверхні, використовуйте :ref:`doc_3d_text`, розміщений близько до поверхні, замість вузла Decal.
zh_tw: 若你想在表面上顯示任意 3D 文字，請使用 :ref:`doc_3d_text` 並將其貼近表面，而不要用 Decal 節點。

source: Use cases
es: Casos de uso
fr: Cas d'utilisations
ga: Úsáid cásanna
it: Casi d'uso
pt_br: Casos de uso
ru: Случаи использования
ta: வழக்குகளைப் பயன்படுத்துங்கள்
uk: Випадки використання
zh_tw: 使用例

source: Static decoration
es: Decoración estática
fr: Décoration statique
ga: Maisiú statach
it: Decorazioni statiche
ru: Статический декор
ta: நிலையான ஒப்பனை
uk: Статичне оздоблення
zh_tw: 靜態裝飾

source: Sometimes, the fastest way to add texture detail to a scene is to use decals. This is especially the case for organic detail, such as patches of dirt or sand scattered on a large surface. Decals can help break up texture repetition in scenes and make patterns look more natural. On a smaller scale, decals can also be used to create detail variations for objects. For example, decals can be used to add nuts and bolts on top of hard-surface geometry.
ga: Uaireanta, is é an bealach is gasta chun mionsonraí uigeachta a chur le radharc ná decals a úsáid. Baineann sé seo go háirithe le mionsonraí orgánacha, mar shampla paistí salachar nó gaineamh scaipthe ar dhromchla mór. Is féidir le decals cabhrú le hathrú uigeachta a bhriseadh suas i radhairc agus breathnú ar phatrúin níos nádúr Ar scála níos lú, is féidir decals a úsáid freisin chun éagsúlachtaí mionsonraithe a chruthú do rudaí. Mar shampla, is féidir decals a úsáid chun cnónna agus boltaí a chur ar bharr geoiméadracht dromchla crua.
pt_br: Às vezes, a maneira mais rápida de adicionar detalhes de textura a uma cena é usar decalques. Isso é especialmente verdadeiro para detalhes orgânicos, como manchas de sujeira ou areia espalhadas em uma superfície grande. Os decalques podem ajudar a quebrar a repetição de texturas em cenas e fazer com que os padrões pareçam mais naturais. Em uma escala menor, os decalques também podem ser usados para criar variações de detalhes para objetos. Por exemplo, os decalques podem ser usados para adicionar porcas e parafusos sobre a geometria de uma superfície rígida.
ru: Иногда самый быстрый способ добавить текстурную детализацию к сцене — использовать декали. Это особенно актуально для органических деталей, таких как пятна грязи или песка, разбросанные по большой поверхности. Декали могут помочь разбить повторение текстур в сценах и сделать узоры более естественными. В меньшем масштабе декали также можно использовать для создания вариаций деталей для объектов. Например, декали можно использовать для добавления гаек и болтов поверх геометрии твердой поверхности.
ta: சில நேரங்களில், ஒரு காட்சியில் அமைப்பு விவரங்களைச் சேர்ப்பதற்கான விரைவான வழி டெக்கல்களைப் பயன்படுத்துவதாகும். ஒரு பெரிய மேற்பரப்பில் சிதறடிக்கப்பட்ட அழுக்கு அல்லது மணல் போன்ற கரிம விவரங்களுக்கு இது குறிப்பாக நிகழ்கிறது. காட்சிகளில் அமைப்பு மறுபடியும் முறைப்படுத்தவும், வடிவங்கள் மிகவும் இயற்கையாகவும் தோற்றமளிக்கும் டெக்கல்கள் உதவும். சிறிய அளவில், பொருள்களுக்கான விரிவான மாறுபாடுகளை உருவாக்க டெக்கால்கள் பயன்படுத்தப்படலாம். எடுத்துக்காட்டாக, கடின-மேற்பரப்பு வடிவவியலின் மேல் கொட்டைகள் மற்றும் போல்ட்களைச் சேர்க்க டெக்கால்களைப் பயன்படுத்தலாம்.
uk: Іноді найшвидший спосіб додати деталі текстури до сцени – це використовувати наклейки. Особливо це стосується органічних деталей, таких як плями бруду або піску, розкидані на великій поверхні. Наклейки можуть допомогти усунути повторення текстур у сценах і зробити візерунки більш природними. У меншому масштабі декалі також можна використовувати для створення варіацій деталей для об’єктів. Наприклад, наклейки можна використовувати для додавання гайок і болтів поверх геометрії твердої поверхні.
zh_tw: 有時，為場景新增紋理細節的最快方法是使用裝飾。對於有機細節尤其如此，例如散佈在大表面上的污垢或沙子。裝飾可以幫助打破場景中的紋理重複並使圖案看起來更自然。在較小的規模上，裝飾也可用於建立物件的細節變化。例如，裝飾可用於在硬表面幾何體頂部新增螺母和螺栓。

source: Since decals can inject their own :abbr:`PBR (Physically-Based Rendering)` properties on top of the projected surfaces, they can also be used to create footprints or wet puddles.
ga: Ós rud é gur féidir le decals a n-airíonna féin: abbr: `PBR (Fisicaly-Bhunaithe Rendering) `a instealladh ar bharr na dromchlaí réamh-mheasta, is féidir iad a úsáid freisin chun loirg nó loilíní fliuch a chruthú.
pt_br: Como decals podem injetar suas próprias propriedades de :abbr:`PBR (Physically-Based Rendering)` sobre as superfícies projetadas, eles também podem ser usados para criar pegadas ou poças de água.
ru: Поскольку декали могут добавлять собственные свойства :abbr:`PBR (Physically-Based Rendering)` поверх проецируемых поверхностей, их также можно использовать для создания следов или мокрых луж.
ta: டெக்கல்கள் தங்களது சொந்தமாக செலுத்த முடியும் என்பதால்: ஏபிபிஆர்: `பிபிஆர் (உடல் அடிப்படையிலான ரெண்டரிங்)` திட்டமிடப்பட்ட மேற்பரப்புகளின் மேல் பண்புகள், அவை தடம் அல்லது ஈரமான குட்டைகளை உருவாக்கவும் பயன்படுத்தப்படலாம்.
uk: Оскільки декалі можуть додавати свої власні властивості :abbr:`PBR (Physical-Based Rendering)` поверх проектованих поверхонь, їх також можна використовувати для створення слідів або мокрих калюж.
zh_tw: 因為貼花可以在投影表面上疊加自己的 :abbr:`PBR (物理式著色)` 特性，也能用來製作像是腳印或積水等效果。

source: Dirt added on top of level geometry using decals
ga: Cuireadh salachar leis ar bharr an geoiméadracht leibhéil ag baint
pt_br: Sujeira adicionada sobre a geometria do nível usando decalques
ru: Грязь, добавленная поверх геометрии уровня с помощью декалей
ta: டெக்கல்களைப் பயன்படுத்தி நிலை வடிவவியலின் மேல் அழுக்கு சேர்க்கப்பட்டது
uk: Бруд, доданий поверх геометрії рівня за допомогою наклейок
zh_tw: 使用裝飾在關卡幾何頂部新增污垢

source: Dynamic gameplay elements
fr: Éléments de gameplay dynamique
ga: Gnéithe gameplay dinimiciúla
pt_br: Elementos de jogabilidade dinâmicos
ru: Динамичные элементы игрового процесса
ta: மாறும் விளையாட்டு கூறுகள்
uk: Динамічні елементи ігрового процесу
zh_tw: 動態遊戲元素

source: Decals can represent temporary or persistent gameplay effects such as bullet impacts and explosion scorches.
ga: Is féidir le decals éifeachtaí gameplay sealadacha nó leanúnacha a léiriú mar thionchair piléar agus scáileanna pléasctha.
pt_br: Os decalques podem representar efeitos de jogo temporários ou persistentes, como impactos de balas e queimaduras de explosões.
ru: Наклейки (Decals) могут отображать временные или постоянные игровые эффекты, такие как попадания пуль и ожоги от взрывов.
ta: புல்லட் தாக்கங்கள் மற்றும் வெடிப்பு ச்கார்ச் போன்ற தற்காலிக அல்லது தொடர்ச்சியான விளையாட்டு விளைவுகளை டெக்கல்கள் குறிக்கலாம்.
uk: Наклейки можуть представляти тимчасові або постійні ефекти гри, як-от удари від куль і опіки від вибуху.
zh_tw: 裝飾可以代表暫時或持久的遊戲效果，例如子彈撞擊和爆炸燒焦。

source: Using an AnimationPlayer node or a script, decals can be made to fade over time (and then be removed using ``queue_free()``) to improve performance.
ga: Ag baint úsáide as nód AnimationPlayer nó script, is féidir decals a dhéanamh le titim le himeacht ama (agus ansin iad a bhaint ag úsáid ``queue_free () ``) chun feidhmíocht a fheabhsú.
pt_br: Usando um nó AnimationPlayer ou um script, decals podem ser configurados para desaparecer com o tempo (e depois serem removidos usando ``queue_free()``) para melhorar o desempenho.
ru: Используя узел AnimationPlayer или скрипт, можно сделать так, чтобы декали со временем исчезали (а затем удалялись с помощью ``queue_free()``) для повышения производительности.
ta: அனிமேசன் பிளேயர் முனை அல்லது ச்கிரிப்டைப் பயன்படுத்தி, செயல்திறனை மேம்படுத்த காலப்போக்கில் மங்கச் செய்யலாம் (பின்னர் `` queue_free () ``) ஐப் பயன்படுத்தி அகற்றப்படலாம்.
uk: За допомогою вузла AnimationPlayer або сценарію можна зробити так, щоб наклейки з часом зникали (а потім видалялися за допомогою ``queue_free()``), щоб покращити продуктивність.
zh_tw: 使用 AnimationPlayer 節點或腳本，可以使裝飾隨著時間的推移而褪色（然後使用「queue_free()」刪除）以提高效能。

source: Blob shadows
ga: Scáthanna blob
it: Ombre a chiazze
ru: Каплевидные тени (Blob shadows)
ta: குமிழ் நிழல்கள்
uk: Ляпкові тіні
zh_tw: 接觸陰影

source: Blob shadows are frequently used in mobile projects (or to follow a retro art style), as real-time lighting tends to be too expensive on low-end mobile devices. However, when relying on baked lightmaps with fully baked lights, dynamic objects will not cast *any* shadow from those lights. This makes dynamic objects in lightmapped scenes look flat in comparison to real-time lighting, with dynamic objects almost looking like they're floating.
ga: Is minic a úsáidtear scáthanna blobacha i dtionscadail shoghluaiste (nó chun stíl retro ealaíne a leanúint), toisc go mbíonn claonadh ag soilsiú fíor-ama a bheith ró-chostasach ar ghléasanna soghluaiste ísealchríocha. Mar sin féin, nuair a bhíonn tú ag brath ar léarscáileanna solais bácáilte le soilse lán-bhácáilte, ní chaithfidh rudaí dinimiciúla aon scáth* ó na soilse sin. Fágann sé seo go bhfuil cuma réidh ar réada dinimiciúla i radhairc le mapáil solais i gcomparáid le soilsiú fíor-ama, agus is cosúil go bhfuil rudaí dinimiciúla beagnach cosúil le snámh.
pt_br: Sombras blob são frequentemente usadas em projetos para dispositivos móveis (ou para seguir um estilo artístico retrô), já que a iluminação em tempo real tende a ser muito custosa em dispositivos móveis de baixo desempenho. No entanto, ao depender de lightmaps pré-calculados com luzes totalmente bakeadas, objetos dinâmicos não projetarão *nenhuma* sombra dessas luzes. Isso faz com que objetos dinâmicos em cenas com lightmaps pareçam planos em comparação com a iluminação em tempo real, quase dando a impressão de que estão flutuando.
ru: Blob-тени часто используются в мобильных проектах (или для следования стилю ретро-арта), поскольку освещение в реальном времени, как правило, слишком затратно на недорогих мобильных устройствах. Однако, полагаясь на запеченные карты освещения с полностью запеченными источниками света, динамические объекты не будут отбрасывать *никаких* теней от этих источников света. Это делает динамические объекты в сценах с картами освещения плоскими по сравнению с освещением в реальном времени, а динамические объекты выглядят почти так, как будто они парят.
ta: மொபைல் திட்டங்களில் (அல்லது ரெட்ரோ கலை பாணியைப் பின்பற்ற) குமிழ் நிழல்கள் அடிக்கடி பயன்படுத்தப்படுகின்றன, ஏனெனில் நிகழ்நேர விளக்குகள் குறைந்த-இறுதி மொபைல் சாதனங்களில் மிகவும் விலை உயர்ந்ததாக இருக்கும். இருப்பினும், முழு வேகவைத்த விளக்குகளுடன் வேகவைத்த லைட்மாப்புகளை நம்பும்போது, டைனமிக் பொருள்கள் அந்த விளக்குகளிலிருந்து * எந்த * நிழலையும் செலுத்தாது. இது நிகழ்நேர விளக்குகளுடன் ஒப்பிடுகையில் லைட்மாப் செய்யப்பட்ட காட்சிகளில் மாறும் பொருள்களை தட்டையாகத் தோன்றுகிறது, மாறும் பொருள்கள் மிதப்பது போல் தெரிகிறது.
uk: Тіні з крапками часто використовуються в мобільних проектах (або для дотримання стилю ретро), оскільки освітлення в реальному часі, як правило, надто дороге на мобільних пристроях низького класу. Однак, покладаючись на запечені карти освітлення з повністю запеченими вогнями, динамічні об’єкти не відкидають *жодної* тіні від цих вогнів. Це робить динамічні об’єкти в сценах зі світловою картою виглядати пласкими порівняно з освітленням у реальному часі, коли динамічні об’єкти виглядають майже так, ніби вони плавають.
zh_tw: 斑點陰影經常用於移動專案（或遵循復古藝術風格），因為實時照明在低端移動裝置上往往過於昂貴。但是，當依賴具有完全烘焙燈光的烘焙光照貼圖時，動態物件不會從這些燈光投射*任何*陰影。與即時光照相比，這使得光照貼圖場景中的動態物件看起來很平坦，動態物件幾乎看起來像是漂浮的。

source: Thanks to blob shadows, dynamic objects can still cast an approximative shadow. Not only this helps with depth perception in the scene, but this can also be a gameplay element, especially in 3D platformers. The blob shadow's length can be extended to let the player know where they will land if they fall straight down.
ga: A bhuíochas le scáthanna blob, is féidir le rudaí dinimiciúla scáth thart a chaitheamh fós. Ní amháin go gcabhraíonn sé seo le dearcadh doimhneachta sa radharc, ach is féidir leis seo a bheith ina ghné gameplay freisin, go háirithe in ardáin 3D. Is féidir fad scáth an blob a leathnú chun a chur in iúl don imreoir cá dtarlóidh siad má thiteann siad díreach síos.
pt_br: Graças às sombras blob, objetos dinâmicos ainda podem projetar uma sombra aproximada. Isso não apenas ajuda na percepção de profundidade na cena, como também pode ser um elemento de gameplay, especialmente em jogos de plataforma 3D. O comprimento da sombra blob pode ser estendido para indicar ao jogador onde ele irá aterrissar caso caia diretamente para baixo.
ru: Благодаря теням от капель динамические объекты все еще могут отбрасывать приблизительную тень. Это не только помогает с восприятием глубины сцены, но и может быть элементом игрового процесса, особенно в 3D-платформерах. Длина тени капли может быть увеличена, чтобы игрок знал, где он приземлится, если упадет прямо вниз.
ta: குமிழ் நிழல்களுக்கு நன்றி, மாறும் பொருள்கள் இன்னும் தோராயமான நிழலை செலுத்தலாம். இது காட்சியில் ஆழமான உணர்வுக்கு உதவுவது மட்டுமல்லாமல், இது ஒரு விளையாட்டு உறுப்பாகவும் இருக்கலாம், குறிப்பாக 3D இயங்குதளங்களில். நேராக கீழே விழுந்தால் அவர்கள் எங்கு இறங்குவார்கள் என்பதை வீரருக்குத் தெரியப்படுத்த, குமிழ் நிழலின் நீளத்தை நீட்டிக்க முடியும்.
uk: Завдяки тіням крапки динамічні об’єкти все ще можуть відкидати приблизну тінь. Це не тільки сприяє сприйняттю глибини сцени, але також може бути елементом ігрового процесу, особливо в 3D-платформерах. Довжину тіні можна збільшити, щоб гравець знав, куди вона приземлиться, якщо впаде прямо вниз.
zh_tw: 由於斑點陰影，動態物件仍然可以投射近似陰影。這不僅有助於場景中的深度感知，而且還可以成為一種遊戲元素，尤其是在 3D 平台遊戲中。斑點陰影的長度可以延長，讓玩家知道如果他們垂直落下他們會落在哪裡。

source: Even with real-time lighting, blob shadows can still be useful as a form of ambient occlusion for situations where SSAO is too expensive or too unstable due to its screen-space nature. For example, vehicles' underside shadows are well-represented using blob shadows.
ga: Fiú amháin le soilsiú fíor-ama, is féidir le scáthanna blob a bheith úsáideach fós mar chineál oclúcháin chomhthimpeallach do chásanna ina bhfuil SSAO ró-daor nó ró-éagobhsaí mar gheall ar a nádúr spáis scáileáin. Mar shampla, déantar scáthanna taobh íochtaracha na bhfeithiclí léiriú go maith ag úsáid scáthanna blob.
pt_br: Mesmo com iluminação em tempo real, sombras blob ainda podem ser úteis como uma forma de oclusão de ambiente para situações em que o SSAO é muito custoso ou instável devido à sua natureza em espaço de tela. Por exemplo, as sombras na parte inferior de veículos são bem representadas usando sombras blob.
ru: Даже при освещении в реальном времени, тени-blob могут быть полезны как форма окружающего затенения в ситуациях, когда SSAO слишком затратен или слишком нестабилен из-за своей экранной природы. Например, тени снизу транспортных средств хорошо представлены с помощью теней-blob.
ta: நிகழ்நேர விளக்குகளுடன் கூட, SSAO அதன் திரை-இட இயல்பு காரணமாக SSAO மிகவும் விலை உயர்ந்ததாகவோ அல்லது நிலையற்றதாகவோ இருக்கும் சூழ்நிலைகளுக்கு சுற்றுப்புற மறுப்பின் ஒரு வடிவமாக குமிழ் நிழல்கள் இன்னும் பயனுள்ளதாக இருக்கும். எடுத்துக்காட்டாக, வாகனங்களின் அடிப்பகுதி நிழல்கள் குமிழ் நிழல்களைப் பயன்படுத்தி நன்கு பிரதிநிதித்துவம் செய்யப்படுகின்றன.
uk: Навіть з освітленням у реальному часі тіні з крапками все ще можуть бути корисними як форма оклюзії навколишнього середовища в ситуаціях, коли SSAO занадто дорогий або занадто нестабільний через його природу екранного простору. Наприклад, тіні знизу транспортних засобів добре представлені за допомогою тіней з крапками.
zh_tw: 即使使用即時光照，斑點陰影仍然可以作為環境光遮擋的一種形式，適用於 SSAO 由於其螢幕空間性質而過於昂貴或過於不穩定的情況。例如，使用斑點陰影很好地表示了車輛的底部陰影。
