Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_decals.po
Languages: es, fr, ga, it, pt_br, ru, ta, uk, zh_tw

source: Blob shadow under object comparison
ga: Scáth blob faoi chomparáid réada
pt_br: Comparação de sombra blob sob o objeto
ru: Blob-тень пятна при сравнении объектов
ta: பொருள் ஒப்பீட்டின் கீழ் குமிழ் நிழல்
uk: Тінь під порівнянням об’єктів
zh_tw: 物體比較下的斑點陰影

source: Quick start guide
es: Guia inicio rápido
fr: Guide de démarrage rapide
ga: Treoir thapa tosaithe
it: Guida di inizio rapido
pt_br: Guia de início rápido
ru: Краткое руководство пользователя
ta: விரைவான தொடக்க வழிகாட்டி
uk: Короткий посібник
zh_tw: 快速入門指南

source: Creating decals in the editor
ga: Deicals a chruthú san eagarthóir
it: Creare le decalcomanie nell'editor
ru: Создание декалей в редакторе
ta: எடிட்டரில் டெக்கல்களை உருவாக்குதல்
uk: Створення декалей в редакторі
zh_tw: 在編輯器中建立貼花

source: Create a Decal node in the 3D editor.
ga: Cruthaigh nód Decal san eagarthóir 3D.
it: Crea un nodo Decal nell'editor 3D.
ru: Создайте узел Decal в 3D-редакторе.
ta: 3D எடிட்டரில் ஒரு டெக்கால் முனையை உருவாக்கவும்.
uk: Створіть вузол Decal у 3D-редакторі.
zh_tw: 在 3D 編輯器中建立一個 Decal 節點。

source: In the inspector, expand the **Textures** section and load a texture in **Textures > Albedo**.
es: En el inspector, expanda la sección **Texturas** y cargue una textura en **Texturas > Albedo**.
ga: Sa chigire, leathnaigh an roinn **Uigeachtaí** agus lódáil uigeacht in **Uigeachtaí > Albedo**.
it: Nell'ispettore, espandi la sezione **Texture** e carica una texture in **Texture > Albedo**.
ru: В инспекторе разверните раздел **Textures** и загрузите текстуру в **Albedo**.
ta: இன்ச்பெக்டரில், ** கட்டமைப்புகள் ** பகுதியை விரிவுபடுத்தி, ** கட்டமைப்புகள்> ஆல்பிடோ ** இல் ஒரு அமைப்பை ஏற்றவும்.
uk: В інспекторі розгорніть розділ **Текстури** і завантажте текстуру в **Текстури > Альбедо**.
zh_tw: 在屬性面板中展開 **Textures** 區段，於 **Textures > Albedo** 載入貼圖。

source: Move the Decal node towards an object, then rotate it so the decal is visible (and in the right orientation). If the decal appears mirrored, try to rotate it by 180 degrees. You can double-check whether it's in the right orientation by increasing **Parameters > Normal Fade** to 0.5. This will prevent the Decal from being projected on surfaces that are not facing the decal.
ga: Bog an nód Decal i dtreo réad, ansin rothlaigh é ionas go mbeidh an decal infheicthe (agus sa treoshuíomh ceart). Má tá cuma scáthánaithe ar an decal, déan iarracht é a rothlú 180 céim. Is féidir leat seiceáil faoi dhó an bhfuil sé sa treoshuíomh ceart trí **Paraiméadar > Gnáthchéimniú** a mhéadú go 0.5. Cuirfidh sé seo cosc ar an Decal a bheith réamh-mheasta ar dhromchlaí nach bhfuil os comhair an decal.
it: Sposta il nodo Decal verso un oggetto, quindi ruotalo in modo che la decalcomania sia visibile (e con l'orientamento corretto). Se la decalcomania appare specchiata, prova a ruotarla di 180 gradi. Puoi verificare che sia nell'orientamento corretto aumentando **Parametri > Dissolvenza normale** a 0.5. Ciò impedirà che la decalcomania venga proiettata su superfici non rivolte verso la decalcomania.
pt_br: Mova o nó Decal em direção a um objeto e, em seguida, gire-o para que o decal fique visível (e na orientação correta). Se o decal aparecer espelhado, tente girá-lo em 180 graus. Você pode verificar se ele está na orientação correta aumentando **Parameters > Normal Fade** para 0.5. Isso impedirá que o Decal seja projetado em superfícies que não estejam voltadas para ele.
ru: Переместите узел Decal к объекту, затем поверните его так, чтобы наклейка (decal) была видна (и имела правильную ориентацию). Если наклейка выглядит зеркально, попробуйте повернуть ее на 180 градусов. Вы можете еще раз проверить, имеет ли она правильную ориентацию, увеличив **Parameters > Normal Fade** до 0,5. Это предотвратит проецирование Decal на поверхности, которые не обращены к наклейке.
ta: டெக்கால் முனையை ஒரு பொருளை நோக்கி நகர்த்தவும், பின்னர் அதை சுழற்றவும், இதனால் டெக்கால் தெரியும் (மற்றும் சரியான நோக்குநிலையில்). டெக்கால் பிரதிபலித்ததாகத் தோன்றினால், அதை 180 டிகிரிக்குள் சுழற்ற முயற்சிக்கவும். ** அளவுருக்கள்> இயல்பான மங்கலை ** 0.5 ஆக அதிகரிப்பதன் மூலம் சரியான நோக்குநிலையில் உள்ளதா என்பதை நீங்கள் இருமுறை சரிபார்க்கலாம். இது டெக்கால் எதிர்கொள்ளாத மேற்பரப்புகளில் திட்டமிடப்படுவதைத் தடுக்கும்.
uk: Перемістіть вузол «Декаль» до об’єкта, а потім поверніть його, щоб деколь було видно (і в правильній орієнтації). Якщо наклейка виглядає дзеркально, спробуйте повернути її на 180 градусів. Ви можете ще раз перевірити, чи правильна орієнтація, збільшивши **Параметри > Нормальне згасання** до 0,5. Це запобіжить проеціювання наклейки на поверхні, які не звернені до наклейки.
zh_tw: 將裝飾節點移向對象，然後旋轉它以使裝飾可見（並且方向正確）。如果裝飾看起來是鏡像的，請嘗試將其旋轉 180 度。您可以將**參數 > 正常淡入淡出**增加到 0.5 來仔細檢查其方向是否正確。這將防止裝飾投影到不面向裝飾的表面。

source: If your decal is meant to affect static objects only, configure it to prevent affecting dynamic objects (or vice versa). To do so, change the decal's **Cull Mask** property to exclude certain layers. After doing this, modify your dynamic objects' MeshInstance3D nodes to change their visibility layers. For instance, you can move them from layer 1 to layer 2, then disable layer 2 in the decal's **Cull Mask** property.
ga: Má tá sé i gceist do decal dul i bhfeidhm ar rudaí statacha amháin, cumraigh é chun cosc a chur ar thionchar ar rudaí dinimiciúla (nó a mhalairt). Chun é sin a dhéanamh, athraigh maoin **Cull Mask** an decal chun sraitheanna áirithe a eisiamh. Tar éis é seo a dhéanamh, modhnaigh nóid MeshInstance3D d'earraí dinimiciúla chun a sraitheanna infheictheachta a athrú. Mar shampla, is féidir leat iad a bhogadh ó chiseal 1 go ciseal 2, ansin ciseal 2 a dhíchumasú i maoin **Cull Mask** an decal.
it: Se la tua decalcomania deve avere effetto solo sugli oggetti statici, configurala in modo che non influisca sugli oggetti dinamici (o viceversa). Per farlo, modifica la proprietà **Cull Mask** della decalcomania per escludere determinati strati. Dopodiché, modifica i nodi MeshInstance3D degli oggetti dinamici per modificarne gli strati di visibilità. Ad esempio, puoi spostarli dallo strato 1 allo strato 2, quindi disabilitare lo strato 2 nella proprietà **Cull Mask** della decalcomania.
pt_br: Se o seu decal for destinado a afetar somente objetos estáticos, configure-o para evitar que afete objetos dinâmicos (ou vice-versa). Para isso, altere a propriedade **Cull Mask** do decal para excluir certas camadas. Depois disso, modifique os nós MeshInstance3D de seus objetos dinâmicos para mudar suas camadas de visibilidade. Por exemplo, você pode movê-los da camada 1 para a camada 2 e, em seguida, desativar a camada 2 na propriedade **Cull Mask** do decal.
ru: Если ваша декаль должна влиять только на статические объекты, настройте ее так, чтобы она не влияла на динамические объекты (или наоборот). Для этого измените свойство **Cull Mask** декали, чтобы исключить определенные слои. После этого измените узлы MeshInstance3D ваших динамических объектов, чтобы изменить их слои видимости. Например, вы можете переместить их со слоя 1 на слой 2, а затем отключить слой 2 в свойстве **Cull Mask** декали.
ta: உங்கள் டெக்கால் நிலையான பொருள்களை மட்டுமே பாதிக்கும் என்றால், மாறும் பொருள்களைப் பாதிப்பதைத் தடுக்க அதை உள்ளமைக்கவும் (அல்லது நேர்மாறாக). அவ்வாறு செய்ய, சில அடுக்குகளை விலக்க டெக்கலின் ** குல் மாச்க் ** சொத்தை மாற்றவும். இதைச் செய்த பிறகு, உங்கள் மாறும் பொருள்களின் மெசின்ச்டன்ச் 3 டி முனைகளை அவற்றின் தெரிவுநிலை அடுக்குகளை மாற்ற மாற்றவும். உதாரணமாக, நீங்கள் அவற்றை அடுக்கு 1 இலிருந்து அடுக்கு 2 க்கு நகர்த்தலாம், பின்னர் டெக்கலின் ** குல் மாச்க் ** சொத்தில் அடுக்கு 2 ஐ முடக்கலாம்.
uk: Якщо ваша наклейка призначена для впливу лише на статичні об’єкти, налаштуйте її, щоб запобігти впливу на динамічні об’єкти (або навпаки). Для цього змініть властивість декалі **Cull Mask**, щоб виключити певні шари. Зробивши це, змініть вузли MeshInstance3D ваших динамічних об’єктів, щоб змінити їхні шари видимості. Наприклад, ви можете перемістити їх із шару 1 на шар 2, а потім вимкнути шар 2 у властивості **Cull Mask** наклейки.
zh_tw: 如果您的裝飾僅影響靜態對象，請將其配置為防止影響動態對象（反之亦然）。為此，請變更裝飾的 **剔除蒙版** 屬性以排除某些圖層。執行此操作後，修改動態物件的 MeshInstance3D 節點以變更其可見性層。例如，您可以將它們從第 1 層移至第 2 層，然後在裝飾的 **剔除蒙版** 屬性中停用第 2 層。

source: Decal node properties
ga: Airíonna nód decal
it: Proprietà del nodo Decal
ru: Свойства узла Decal
ta: டெக்கால் முனை பண்புகள்
uk: Властивості вузла декалі
zh_tw: 節點屬性

source: **Extents:** The size of the decal. The Y axis determines the length of the decal's projection. Keep the projection length as short as possible to improve culling opportunities, therefore improving performance.
ga: ** Méideanna:** Méid an decal. Cinneann an ais Y fad teilgean an decal. Coinnigh fad an teilgean chomh gearr agus is féidir chun deiseanna maraithe a fheabhsú, agus mar sin feabhas a chur ar fheidhmíocht.
pt_br: **Extensões:** O tamanho do decal. O eixo Y determina o comprimento da projeção do decal. Mantenha o comprimento da projeção o mais curto possível para melhorar as oportunidades de descarte (culling) e, consequentemente, o desempenho.
ru: **Extents (Экстенты):** Размер декали. Ось Y определяет длину проекции декали. Сохраняйте длину проекции как можно короче, чтобы улучшить возможности отбраковки, тем самым повышая производительность.
ta: ** நீட்டிப்புகள்: ** டெக்கலின் அளவு. ஒய் அச்சு டெக்கலின் திட்டத்தின் நீளத்தை தீர்மானிக்கிறது. வாய்ப்புகளை மேம்படுத்துவதற்கு திட்ட நீளத்தை முடிந்தவரை குறுகியதாக வைத்திருங்கள், எனவே செயல்திறனை மேம்படுத்துகிறது.
uk: **Розмір:** Розмір наклейки. Вісь Y визначає довжину проекції декалі. Зберігайте довжину проекції якомога коротшою, щоб покращити можливості вибракування, а отже, покращити продуктивність.
zh_tw: **範圍：** 貼花的大小。Y 軸決定貼花投影的深度。請盡量縮短投影長度，以增加裁切機會，進而提升效能。

source: Textures
es: Texturas
ga: uigeachtaí
it: Texture
ru: Текстуры
ta: கட்டமைப்புகள்
uk: Текстури
zh_tw: 紋理

source: **Albedo:** The albedo (diffuse/color) map to use for the decal. In most situations, this is the texture you want to set first. If using a normal or ORM map, an albedo map *must* be set to provide an alpha channel. This alpha channel will be used as a mask to determine how much the normal/ORM maps will affect the underlying surface.
ga: **Albedo: ** An léarscáil albedo (scaipte/dath) le húsáid don decal. I bhformhór na gcásanna, is é seo an uigeacht is mian leat a shocrú ar dtús. Má tá gnáthléarscáil nó ORM á úsáid agat, caithfear léarscáil albedo** a shocrú chun cainéal alfa a sholáthar. Úsáidfear an cainéal alfa seo mar masc chun a chinneadh cé mhéid a bheidh tionchar ag na gnáthléarscáileanna ORM ar an dromchla bunúsach.
pt_br: **Albedo:** O mapa de albedo (difuso/cor) a ser usado para o decal. Na maioria das situações, esta é a textura que você deve definir primeiro. Se estiver usando um mapa normal ou ORM, um mapa de albedo *deve* ser definido para fornecer um canal alfa. Esse canal alfa será usado como uma máscara para determinar o quanto os mapas normal/ORM irão afetar a superfície subjacente.
ru: **Albedo:** Карта альбедо (диффузия/цвет), используемая для декали. В большинстве случаев это текстура, которую вы хотите задать первой. Если вы используете карту нормалей или ORM, карта альбедо *должна* быть установлена для предоставления альфа-канала. Этот альфа-канал будет использоваться в качестве маски для определения того, насколько карты нормалей/ORM повлияют на нижележащую поверхность.
ta: ** ஆல்பிடோ: ** டெக்கலுக்கு பயன்படுத்த ஆல்பிடோ (பரவல்/வண்ணம்) வரைபடம். பெரும்பாலான சூழ்நிலைகளில், நீங்கள் முதலில் அமைக்க விரும்பும் அமைப்பு இது. சாதாரண அல்லது ORM வரைபடத்தைப் பயன்படுத்தினால், ஆல்பா சேனலை வழங்க ஒரு ஆல்பிடோ வரைபடம் * அமைக்கப்பட வேண்டும். இந்த ஆல்பா சேனல் சாதாரண/ORM வரைபடங்கள் அடிப்படை மேற்பரப்பை எவ்வளவு பாதிக்கும் என்பதை தீர்மானிக்க முகமூடியாக பயன்படுத்தப்படும்.
uk: **Альбедо:** Карта альбедо (дифузна/колірна), яка використовується для наклейки. У більшості ситуацій це текстура, яку ви хочете встановити першою. Якщо використовується звичайна чи ORM-карта, для забезпечення альфа-каналу *має* бути встановлено карту альбедо. Цей альфа-канал використовуватиметься як маска для визначення того, наскільки карти нормалей/ORM впливатимуть на підстилаючу поверхню.
zh_tw: **Albedo：** 貼花的反照率（漫反射/顏色）貼圖。大多數情況下，你會優先設定此貼圖。若要使用法線貼圖或 ORM 貼圖時，*必須* 指定 Albedo 以提供 Alpha 通道，該 Alpha 通道會作為遮罩，決定法線/ORM 貼圖對底層表面的影響程度。

source: **Normal:** The normal map to use for the decal. This can be used to increase perceived detail on the decal by modifying how light reacts to it. The impact of this texture is multiplied by the albedo texture's alpha channel (but not **Albedo Mix**).
ga: **Gnáth: ** An gnáthléarscáil le húsáid don decal. Is féidir é seo a úsáid chun mionsonraí braite ar an decal a mhéadú trí mhodhnú a dhéanamh ar an gcaoi a n-imoibríonn solas dó Déantar tionchar an uigeachta seo a iolrú le cainéal alfa uigeachta albedo (ach ní **Albedo Measc**).
pt_br: **Normal:** O mapa normal a ser usado para o decalque. Ele pode ser usado para aumentar a percepção de detalhe no decalque, modificando como a luz reage a ele. O impacto dessa textura é multiplicado pelo canal alfa da textura de albedo (mas não pelo **Albedo Mix**).
ru: **Normal:** Карта нормалей для использования в декале. Это можно использовать для увеличения воспринимаемой детализации декали, изменяя реакцию света на нее. Влияние этой текстуры умножается на альфа-канал текстуры альбедо (но не на **Albedo Mix**).
ta: ** இயல்பானது: ** டெக்கலுக்கு பயன்படுத்த சாதாரண வரைபடம். டெக்கால் வெளிச்சம் எவ்வாறு பிரதிபலிக்கிறது என்பதை மாற்றியமைப்பதன் மூலம் உணரப்பட்ட விவரங்களை அதிகரிக்க இதைப் பயன்படுத்தலாம். இந்த அமைப்பின் தாக்கம் ஆல்பிடோ அமைப்பின் ஆல்பா சேனலால் பெருக்கப்படுகிறது (ஆனால் ** ஆல்பிடோ கலவை ** அல்ல).
uk: **Звичайний:** Карта нормалей для використання наклейки. Це можна використати, щоб збільшити деталі, які сприймаються на наклейці, змінюючи те, як на неї реагує світло. Вплив цієї текстури помножується на альфа-канал текстури альбедо (але не **Albedo Mix**).
zh_tw: **Normal：** 貼花的法線貼圖。可用來調整光線反應，增加貼花細節。此貼圖效果會乘以 Albedo 貼圖的 Alpha 通道（但不受 **Albedo Mix** 影響）。

source: **ORM:** The Occlusion/Roughness/Metallic map to use for the decal. This is an optimized format for storing PBR material maps. Ambient Occlusion map is stored in the red channel, roughness map in the green channel, metallic map in the blue channel. The impact of this texture is multiplied by the albedo texture's alpha channel (but not **Albedo Mix**).
ga: **ORM: ** An léarscáil Occlusion/Garbh/Miotalach le húsáid don decal. Is formáid optamaithe é seo chun léarscáileanna ábhar PBR a stóráil. Stóráiltear léarscáil Occlusion Comhthimpeallach sa chainéal dearg, léarscáil garbh sa chainéal glas, léarscáil mhiotalach sa chainéal gorm. Déantar tionchar an uigeachta seo a iolrú le cainéal alfa uigeachta albedo (ach ní **Albedo Measc**).
pt_br: **ORM:** O mapa de Oclusão/Rugosidade/Metálico a ser usado para o decal. Este é um formato otimizado para armazenar mapas de materiais PBR. O mapa de Oclusão de Ambiente é armazenado no canal vermelho, o mapa de rugosidade no canal verde e o mapa metálico no canal azul. O impacto dessa textura é multiplicado pelo canal alfa da textura de albedo (mas não pelo **Albedo Mix**).
ru: **ORM:** Карта Occlusion/Roughness/Metallic для использования в декале. Это оптимизированный формат для хранения карт материалов PBR. Карта Ambient Occlusion хранится в красном канале, карта roughness — в зеленом канале, карта metallic — в синем канале. Влияние этой текстуры умножается на альфа-канал текстуры альбедо (но не на **Albedo Mix**).
ta: ** ORM: ** டெக்கலுக்கு பயன்படுத்த மறைவு/கடினத்தன்மை/உலோக வரைபடம். பிபிஆர் பொருள் வரைபடங்களை சேமிப்பதற்கான உகந்த வடிவமாகும். சுற்றுப்புற மறுப்பு வரைபடம் சிவப்பு சேனலில் சேமிக்கப்படுகிறது, பச்சை சேனலில் கடினத்தன்மை வரைபடம், நீல சேனலில் உலோக வரைபடம். இந்த அமைப்பின் தாக்கம் ஆல்பிடோ அமைப்பின் ஆல்பா சேனலால் பெருக்கப்படுகிறது (ஆனால் ** ஆல்பிடோ கலவை ** அல்ல).
uk: **ORM:** Карта оклюзії/шорсткості/металу, яка буде використана для наклейки. Це оптимізований формат для зберігання карт матеріалів PBR. Карта Ambient Occlusion зберігається в червоному каналі, карта шорсткості в зеленому каналі, металева карта в синьому каналі. Вплив цієї текстури помножується на альфа-канал текстури альбедо (але не **Albedo Mix**).
zh_tw: **ORM：** 貼花的遮蔽/粗糙度/金屬度貼圖，是最佳化的 PBR 材質貼圖格式。紅色通道儲存遮蔽，綠色通道為粗糙度，藍色通道為金屬度。此貼圖效果會乘以 Albedo 的 Alpha 通道（不受 **Albedo Mix** 影響）。

source: **Emission:** The emission texture to use for the decal. Unlike **Albedo**, this texture will appear to glow in the dark.
fr: **Émission :** La texture des émissions à utiliser pour le décalque. Contrairement à **Albedo**, cette texture va sembler briller dans le noir.
ga: **Astaíocht: ** An uigeacht astaíochta le húsáid don decal. Murab ionann agus **Albedo**, is cosúil go bhfuil an uigeacht seo ag gloine sa dorchadas.
pt_br: **Emission:** A textura de emissão a ser usada para o decalque. Diferente do **Albedo**, essa textura parecerá brilhar no escuro.
ru: **Emission:** Текстура эмиссии для использования в наклейке. В отличие от **Albedo**, эта текстура будет светиться в темноте.
ta: ** உமிழ்வு: ** டெக்கலுக்கு பயன்படுத்த உமிழ்வு அமைப்பு. ** ஆல்பிடோ ** போலல்லாமல், இந்த அமைப்பு இருட்டில் ஒளிரும்.
uk: **Випромінювання:** Текстура випромінювання, яка буде використана для наклейки. На відміну від **Albedo**, ця текстура світиться в темряві.
zh_tw: **Emission：** 貼花的自發光貼圖。與 **Albedo** 不同，此貼圖在黑暗中會發光。

source: Parameters
es: Parámetros
fr: Paramètres
ga: Paraiméadair
it: Parametri
pt_br: Parâmetros
ru: Параметры
ta: அளவுருக்கள்
uk: Параметри
zh_tw: 參數

source: **Emission Energy:** The brightness of the emission texture.
fr: **Énergie d'émission :** La luminosité de la texture d'émission.
ga: **Fuinneamh Astaíochta: ** Gile na uigeachta astaíochta.
pt_br: **Energia de Emissão:** O brilho da textura de emissão.
ru: **Emission Energy: (Энергия излучения:)** Яркость текстуры излучения.
ta: ** உமிழ்வு ஆற்றல்: ** உமிழ்வு அமைப்பின் ஒளி.
uk: **Енергія випромінювання:** яскравість текстури випромінювання.
zh_tw: **發射能量:** 發射紋理的亮度。

source: **Modulate:** Multiplies the color of the albedo and emission textures. Use this to tint decals (e.g. for paint decals, or to increase variation by randomizing each decal's modulation).
ga: **Modhnú: ** Iolraíonn dath an albedo agus uigeachtaí astaíochta. Úsáid é seo chun decals a thaint (m.sh. le haghaidh decals péint, nó chun éagsúlacht a mhéadú trí mhodhnú gach decal a randamú).
pt_br: **Modulate:** Multiplica a cor das texturas de albedo e emissão. Use isso para colorir decals (por exemplo, para decals de tinta ou para aumentar a variação ao randomizar a modulação de cada decal).
ru: **Modulate: (Модулировать:)** Умножает цвет текстур альбедо и излучения. Используйте это для тонирования декалей (например, для декалей-красок или для увеличения вариации путем рандомизации модуляции каждой декали).
ta: ** மாடுலேட்: ** ஆல்பிடோ மற்றும் உமிழ்வு அமைப்புகளின் நிறத்தை பெருக்குகிறது. டின்ட் டெக்கல்களுக்கு இதைப் பயன்படுத்தவும் (எ.கா. வண்ணப்பூச்சு டெக்கல்களுக்கு, அல்லது ஒவ்வொரு டெக்கலின் பண்பேற்றத்தையும் சீரற்ற முறையில் சீரற்ற முறையில் அதிகரிக்க).
uk: **Модулювати:** збільшує колір текстури альбедо та випромінювання. Використовуйте це, щоб відтінити наклейки (наприклад, для фарбування наклейок або збільшити варіацію шляхом рандомізації модуляції кожної наклейки).
zh_tw: **調變：** 乘以反照率和發射紋理的顏色。使用它來為裝飾著色（例如，用於油漆裝飾，或透過隨機化每個裝飾的調變來增加變化）。

source: **Albedo Mix:** The opacity of the albedo texture. Unlike using an albedo texture with a more transparent alpha channel, decreasing this value below ``1.0`` does *not* reduce the impact of the normal/ORM texture on the underlying surface. Set this to ``0.0`` when creating normal/ORM-only decals such as footsteps or wet puddles.
ga: **Meascán Albedo: ** Dréamhtheachtacht an uigeachta albedo. Murab ionann agus uigeacht albedo a úsáid le cainéal alfa níos trédhearcach, laghdaíonn an luach seo faoi bhun `1.0`` *ní laghdaí* tionchar na uigeachta gnáth/ORM ar an dromchla bunúsach. Socraigh é seo go ``0.0`` agus tú ag cruthú decals gnáth/ORM amháin mar shampla cosúil le cosúil le loisíní fliuch.
pt_br: **Albedo Mix:** A opacidade da textura de albedo. Diferente de usar uma textura de albedo com um canal alfa mais transparente, reduzir esse valor abaixo de ``1.0`` *não* diminui o impacto da textura normal/ORM sobre a superfície subjacente. Defina este valor como ``0.0`` ao criar decals apenas de normal/ORM, como pegadas ou poças de água.
ru: **Albedo Mix:** Непрозрачность текстуры альбедо. В отличие от использования текстуры альбедо с более прозрачным альфа-каналом, уменьшение этого значения ниже ``1.0`` *не* уменьшает влияние текстуры нормали/ORM на подстилающую поверхность. Установите это значение на ``0.0`` при создании декалей только нормали/ORM, таких как шаги или мокрые лужи.
ta: ** ஆல்பிடோ கலவை: ** ஆல்பிடோ அமைப்பின் ஒளிபுகாநிலை. மிகவும் வெளிப்படையான ஆல்பா சேனலுடன் ஒரு ஆல்பிடோ அமைப்பைப் பயன்படுத்துவதைப் போலன்றி, இந்த மதிப்பை `` 1.0`` கீழே குறைப்பது * அடிப்படை மேற்பரப்பில் சாதாரண/ORM அமைப்பின் தாக்கத்தை குறைக்காது. அடிச்சுவடுகள் அல்லது ஈரமான குட்டைகள் போன்ற சாதாரண/ORM- மட்டும் டெக்கல்களை உருவாக்கும்போது இதை `` 0.0`` என அமைக்கவும்.
uk: **Albedo Mix:** Непрозорість текстури альбедо. На відміну від використання текстури альбедо з більш прозорим альфа-каналом, зменшення цього значення нижче ``1.0`` *не* зменшує вплив звичайної/ORM текстури на нижню поверхню. Встановіть значення ``0.0`` під час створення звичайних/тільки для ORM наклейок, таких як кроки чи мокрі калюжі.
zh_tw: **Albedo Mix：** 反照率貼圖的不透明度。與直接降低 Alpha 通道不同，將此值設為低於 ``1.0`` 並*不會*減少法線/ORM 對底層表面的影響。若要製作純用法線或 ORM 的貼花（如腳印、積水等），可將此值設為 ``0.0``。
