Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/variable_rate_shading.po
Languages: ga, ko, ru, ta, uk

source: For example, this VRS density texture provides the highest shading density in the center of the viewport, and the lowest shading density in the corners:
ga: Mar shampla, soláthraíonn an uigeacht dlús VRS seo an dlús scáthaithe is airde i lár an radhairc, agus an dlús scáthaithe is ísle sna coirnéil:
ru: Например, эта текстура плотности VRS обеспечивает самую высокую плотность затенения в центре области просмотра и самую низкую плотность затенения в углах:
ta: எடுத்துக்காட்டாக, இந்த விஆர்எச் அடர்த்தி அமைப்பு காட்சியின் மையத்தில் மிக உயர்ந்த நிழல் அடர்த்தியையும், மூலைகளில் மிகக் குறைந்த நிழல் அடர்த்தியையும் வழங்குகிறது:
uk: Наприклад, ця текстура щільності VRS забезпечує найвищу щільність затінення в центрі вікна перегляду та найнижчу щільність затінення в кутах:

source: Example VRS density map texture, simulating foveated rendering
ga: Sampla uigeacht léarscáileála dlús VRS, ag insamhaladh rindreáil foveated
ru: Пример текстуры карты плотности VRS, имитирующей фовеальный рендеринг
ta: எடுத்துக்காட்டு வி.ஆர்.எச் அடர்த்தி வரைபட அமைப்பு, ஃபோவியட் வழங்குதல் உருவகப்படுத்துதல்
uk: Приклад текстури карти щільності VRS, що імітує фовеативне рендеринг

source: There are no size or aspect ratio requirements for the VRS density texture. However, there is no benefit to using a VRS density map that is larger than the viewport resolution divided by the GPU's *tile size*. The tile size is what determines the smallest area of pixels where the shading density can be changed separately from other tiles. On most GPUs, this tile size is 8×8 pixels. You can view the tile size by running Godot with the ``--verbose`` command line argument, as it's printed in the VRS debugging information.
ga: Níl aon riachtanais méide ná cóimheas gné ann maidir le uigeacht dlús VRS. Mar sin féin, níl aon tairbhe ann le léarscáil dlúis VRS a úsáid atá níos mó ná an taifeach amharc roinnte ar* méid tílea* an GPU. Is é méid an tíl an rud a chinneann an limistéar is lú picteilín inar féidir an dlús scáthaithe a athrú ar leithligh ó tíleanna eile. Ar fhormhór na GPUanna, is é an méid tíl seo 8 × 8 picteilín. Is féidir leat féachaint ar mhéid an tíl trí Godot a reáchtáil leis an argóint líne ordaithe ``--verbose`, mar atá sé clóite san fhaisnéis dífhabhtaithe VRS.
ru: Для текстуры плотности VRS нет требований к размеру или соотношению сторон. Однако нет никакой выгоды в использовании карты плотности VRS, которая больше разрешения области просмотра, деленного на *размер плитки* графического процессора. Размер плитки определяет наименьшую область пикселей, где плотность затенения может быть изменена отдельно от других плиток. На большинстве графических процессоров этот размер плитки составляет 8×8 пикселей. Вы можете просмотреть размер плитки, запустив Godot с аргументом командной строки ``--verbose``, так как он выводится в отладочной информации VRS.
ta: வி.ஆர்.எச் அடர்த்தி அமைப்புக்கு அளவு அல்லது விகித விகித தேவைகள் இல்லை. இருப்பினும், VRS அடர்த்தி வரைபடத்தைப் பயன்படுத்துவதில் எந்த நன்மையும் இல்லை, இது GPU இன் *ஓடு அளவு *ஆல் வகுக்கப்பட்டுள்ள வியூபோர்ட் தீர்மானத்தை விட பெரியது. ஓடு அளவு என்பது பிக்சல்களின் மிகச்சிறிய பகுதியை தீர்மானிக்கிறது, அங்கு நிழல் அடர்த்தியை மற்ற ஓடுகளிலிருந்து தனித்தனியாக மாற்ற முடியும். பெரும்பாலான சி.பீ.யுகளில், இந்த ஓடு அளவு 8 × 8 படப்புள்ளிகள். வி.ஆர்.எச் பிழைத்திருத்த தகவல்களில் அச்சிடப்பட்டிருப்பதால், கோடோட்டை `` --verbose`` கட்டளை வரி வாதத்துடன் இயக்குவதன் மூலம் ஓடு அளவைக் காணலாம்.
uk: Немає вимог до розміру чи співвідношення сторін для текстури щільності VRS. Однак використання карти щільності VRS, яка є більшою за роздільну здатність вікна перегляду, поділену на *розмір плитки* графічного процесора, не принесе жодних переваг. Розмір плитки – це те, що визначає найменшу область пікселів, де щільність затінення можна змінити окремо від інших плиток. На більшості графічних процесорів цей розмір плитки становить 8×8 пікселів. Ви можете переглянути розмір плитки, запустивши Godot з аргументом командного рядка ``--verbose``, як це надруковано в інформації про налагодження VRS.

source: Therefore, sticking to a relatively low resolution such as 256×256 (square) or 480×270 (16:9) is recommended. Depending on your use cases, a square texture may be more suited compared to a texture that matches the most common viewport aspect ratio in your project (such as 16:9).
ga: Dá bhrí sin, moltar cloí le taifeach réasúnta íseal mar 256 × 256 (cearnach) nó 480 × 270 (16:9). Ag brath ar do chásanna úsáide, d'fhéadfadh go mbeadh uigeacht chearnóg níos oiriúnaí i gcomparáid le uigeacht a mheaitseann leis an gcóimheas gné amharc is coitianta i do thionscadal (mar shampla 16:9).
ru: Поэтому рекомендуется придерживаться относительно низкого разрешения, например 256×256 (квадрат) или 480×270 (16:9). В зависимости от ваших вариантов использования квадратная текстура может быть более подходящей по сравнению с текстурой, которая соответствует наиболее распространенному соотношению сторон области просмотра в вашем проекте (например, 16:9).
ta: எனவே, 256 × 256 (சதுரம்) அல்லது 480 × 270 (16: 9) போன்ற ஒப்பீட்டளவில் குறைந்த தெளிவுத்திறனுடன் ஒட்டிக்கொள்வது பரிந்துரைக்கப்படுகிறது. உங்கள் பயன்பாட்டு நிகழ்வுகளைப் பொறுத்து, உங்கள் திட்டத்தில் (16: 9 போன்றவை) மிகவும் பொதுவான காட்சியக விகித விகிதத்துடன் பொருந்தக்கூடிய ஒரு அமைப்புடன் ஒப்பிடும்போது ஒரு சதுர அமைப்பு மிகவும் பொருத்தமானதாக இருக்கலாம்.
uk: Тому рекомендується дотримуватися відносно низької роздільної здатності, наприклад 256×256 (квадрат) або 480×270 (16:9). Залежно від ваших випадків використання, квадратна текстура може бути більш підходящою порівняно з текстурою, яка відповідає найпоширенішому формату вікна перегляду у вашому проекті (наприклад, 16:9).

source: When using variable rate shading, you can use a negative :ref:`texture mipmap LOD bias <doc_resolution_scaling_mipmap_bias>` to reduce blurriness in areas with reduced shading rate.
ga: Agus scáthú ráta inathraithe á úsáid agat, is féidir leat :ref:`claonadh uigeachta mipmap LOD <doc_resolution_scaling_mipmap_bias>` diúltach a úsáid chun doiléire a laghdú i limistéir a bhfuil ráta scáthaithe laghdaithe acu.
ru: При использовании затенения с переменной скоростью можно использовать отрицательное :ref:`смещение LOD mipmap текстуры <doc_resolution_scaling_mipmap_bias>`, чтобы уменьшить размытость в областях с пониженной скоростью затенения.
ta: மாறி வீத நிழலைப் பயன்படுத்தும் போது, நீங்கள் எதிர்மறையைப் பயன்படுத்தலாம்: குறிப்பு: `அமைப்பு MIPMAP LOD சார்பு <doc_resolution_scaling_mipmap_bias>` குறைக்கப்பட்ட நிழல் வீதத்துடன் மங்கலைக் குறைக்க.
uk: Використовуючи змінну швидкість затінення, ви можете використовувати негативне :ref:`texture mipmap LOD bias <doc_resolution_scaling_mipmap_bias>`, щоб зменшити розмитість у областях зі зниженою швидкістю затінення.

source: Note that the texture LOD bias is set globally, so this will also affect areas of the viewport with full shading rate. Don't use values that are too low, or textures will appear grainy.
ga: Tabhair faoi deara go bhfuil claontacht LOD uigeachta socraithe ar fud an domhain, mar sin beidh tionchar aige seo freisin ar réimsí an radhairc le ráta scáthaithe iomlán. Ná húsáid luachanna atá ró-íseal, nó beidh uigeachtaí le feiceáil gránach.
ru: Обратите внимание, что смещение LOD текстуры задается глобально, поэтому оно также повлияет на области окна просмотра с полной скоростью затенения. Не используйте слишком низкие значения, иначе текстуры будут выглядеть зернистыми.
ta: குறிப்பு that the texture LOD bias is கணம் globally, so this will also affect areas of the viewport with full shading rate. மிகக் குறைந்த மதிப்புகளைப் பயன்படுத்த வேண்டாம், அல்லது அமைப்புகள் தானியமாகத் தோன்றும்.
uk: Зауважте, що зміщення LOD текстури встановлюється глобально, тому це також вплине на області вікна перегляду з повною швидкістю затінення. Не використовуйте занадто низькі значення, інакше текстури виглядатимуть зернистими.

source: Performance comparison
ga: comparáid feidhmíochta
ru: Сравнение производительности
ta: செயல்திறன் ஒப்பீடு
uk: Порівняння продуктивності

source: To give an idea of how much VRS can improve performance in theory, here's a performance comparison with the textured example scene shown at the top of this page. The VRS density map example present on this page is used.
ga: Chun smaoineamh a thabhairt ar an méid is féidir le VRS feidhmíocht a fheabhsú go teoiriciúil, seo comparáid feidhmíochta leis an radharc sampla uigeach a thaispeántar ag barr an leathanaigh seo. Úsáidtear sampla léarscáil dlús VRS atá ar fáil ar an leathanach seo.
ru: Чтобы дать представление о том, насколько VRS может улучшить производительность в теории, вот сравнение производительности с текстурированным примером сцены, показанным в верхней части этой страницы. Используется пример карты плотности VRS, представленный на этой странице.
ta: கோட்பாட்டில் வி.ஆர்.எச் எவ்வளவு செயல்திறனை மேம்படுத்த முடியும் என்பதைப் பற்றிய ஒரு யோசனையை வழங்க, இந்த பக்கத்தின் மேலே காட்டப்பட்டுள்ள கடினமான எடுத்துக்காட்டு காட்சியுடன் செயல்திறன் ஒப்பீடு இங்கே. இந்த பக்கத்தில் இருக்கும் விஆர்எச் அடர்த்தி வரைபட எடுத்துக்காட்டு பயன்படுத்தப்படுகிறது.
uk: Щоб дати уявлення про те, наскільки VRS може покращити продуктивність у теорії, ось порівняння продуктивності з прикладом текстурованої сцени, показаним у верхній частині цієї сторінки. Використовується приклад карти щільності VRS, представлений на цій сторінці.

source: Results were captured on a GeForce RTX 4090 with the NVIDIA 525.60.11 driver.
ga: Gabhadh na torthaí ar GeForce RTX 4090 leis an tiománaí NVIDIA 525.60.11.
ru: Результаты были получены на GeForce RTX 4090 с драйвером NVIDIA 525.60.11.
ta: என்விடியா 525.60.11 டிரைவருடன் சியிபோர்ச் ஆர்.டி.எக்ச் 4090 இல் முடிவுகள் கைப்பற்றப்பட்டன.
uk: Результати були отримані на GeForce RTX 4090 з драйвером NVIDIA 525.60.11.

source: Resolution
ga: Réiteach
ru: Разрешение
ta: பகுத்தல்
uk: роздільна здатність

source: VRS disabled
ga: VRS faoi mhíchumas
ko: VRS 비활성화
ru: VRS отключен
ta: வி.ஆர்.எச் முடக்கப்பட்டது
uk: VRS вимкнено

source: VRS enabled
ga: VRS cumasaithe
ko: VRS 활성화
ru: VRS активирован
ta: VRS இயக்கப்பட்டது
uk: VRS увімкнено

source: Performance improvement
ga: Feabhsú feidhmíochta
ru: Улучшение производительности
ta: செயல்திறன் மேம்பாடு
uk: Поліпшення продуктивності

source: 1920×1080 (Full HD)
ga: 1920 × 1080 (HD Iomlán)
ta: 1920 × 1080 (முழு எச்டி)

source: 2832 FPS
ta: 2832 எஃப்.பி.எச்

source: 3136 FPS
ta: 3136 எஃப்.பி.எச்

source: 2008 FPS
ta: 2008 எஃப்.பி.எச்

source: 2256 FPS
ta: 2256 எஃப்.பி.எச்

source: 3840×2160 (4K)
ta: 3840 × 2160 (4 கே)

source: 1236 FPS
ta: 1236 எஃப்.பி.எச்

source: 1436 FPS
ta: 1436 எஃப்.பி.எச்

source: 7680×4320 (8K)
ta: 7680 × 4320 (8 கே)

source: 384 FPS
ta: 384 எஃப்.பி.எச்

source: 473 FPS
ta: 473 எஃப்.பி.எச்

source: In terms of performance improvements, variable rate shading is more beneficial at higher target resolutions. The reduction in visual quality is also less noticeable at high resolutions.
ga: Maidir le feabhsuithe feidhmíochta, tá scáthú ráta athraitheach níos tairbhiúla ag spriocrúin níos airde. Níl an laghdú ar cháilíocht amhairc chomh suntasach freisin ag rúin arda.
ru: С точки зрения повышения производительности затенение с переменной скоростью более выгодно при более высоком целевом разрешении. Снижение качества зрения также меньше заметно при высоком разрешении.
ta: செயல்திறன் மேம்பாடுகளைப் பொறுத்தவரை, அதிக இலக்கு தீர்மானங்களில் மாறி வீத நிழல் மிகவும் நன்மை பயக்கும். காட்சி தரத்தின் குறைப்பு உயர் தீர்மானங்களில் குறைவாக கவனிக்கப்படுகிறது.
uk: З точки зору підвищення продуктивності, затінення зі змінною швидкістю є більш вигідним при вищих цільових роздільних здатностях. Зниження якості зображення також менш помітне на високій роздільній здатності.

source: For non-VR games, you will probably have to use a less aggressive VRS texture than what was used in this example. As a result, the effective performance gains will be lower.
ga: Maidir le cluichí neamh-VR, is dócha go mbeidh ort uigeacht VRS chomh ionsaitheach a úsáid ná an méid a úsáideadh sa sampla seo. Mar thoradh air sin, beidh na gnóthachain feidhmíochta éifeachtacha níos ísle.
ru: Для игр без VR вам, вероятно, придется использовать менее агрессивную текстуру VRS, чем та, что использовалась в этом примере. В результате эффективный прирост производительности будет ниже.
ta: வி.ஆர் அல்லாத விளையாட்டுகளுக்கு, இந்த எடுத்துக்காட்டில் பயன்படுத்தப்பட்டதை விட குறைவான வன்கவர்வு வி.ஆர்.எச் அமைப்பைப் பயன்படுத்த வேண்டியிருக்கும். இதன் விளைவாக, பயனுள்ள செயல்திறன் ஆதாயங்கள் குறைவாக இருக்கும்.
uk: Для ігор без віртуальної реальності вам, ймовірно, доведеться використовувати менш агресивну текстуру VRS, ніж у цьому прикладі. У результаті ефективний приріст продуктивності буде нижчим.

source: Variable rate shading enabled in textured scene (lower quality, but higher performance)
ru: В текстурированной сцене включено затенение с переменной скоростью (более низкое качество, но более высокая производительность)

source: When used in scenes with low-frequency detail (such as scenes with a stylized/low-poly aesthetic), it's possible to achieve similar performance gains, but with less reduction in visual quality:
ru: При использовании в сценах с низкочастотной детализацией (например, сценах со стилизованной/низкополигональной эстетикой) можно добиться аналогичного прироста производительности, но с меньшим ухудшением визуального качества:

source: Variable rate shading enabled in untextured scene (lower quality, but higher performance)
ru: В нетекстурированной сцене включено затенение с переменной скоростью (более низкое качество, но более высокая производительность)

source: Both Forward+ and Mobile renderers support variable rate shading. VRS can be used in both pancake (non-XR) and XR display modes.
ru: Оба рендера Forward+ и Mobile поддерживают затенение с переменной скоростью. VRS может использоваться как в блинчатом (не XR), так и в XR-режиме отображения.

source: The Compatibility renderer does **not** support variable rate shading. For XR, you can use :ref:`foveation level <doc_openxr_settings_foveation_level>` as an alternative.
ru: Compatibility renderer **не** поддерживает затенение с переменной скоростью. Для XR вы можете использовать :ref:`foveation level <doc_openxr_settings_foveation_level>` в качестве альтернативы.
