Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/variable_rate_shading.po
Languages: ga, ko, ru, ta, uk

source: Variable rate shading
ga: Scáthú ráta athraitheach
ko: 가변 비율 셰이딩
ru: Затенение с переменной скоростью
ta: மாறி வீத நிழல்
uk: Затінення зі змінною швидкістю

source: What is variable rate shading?
ga: Cad is scáthú ráta athraitheach ann?
ko: 가변 비율 셰이딩이란 무엇입니까?
ru: Что такое затенение с переменной скоростью?
ta: மாறி வீத நிழல் என்றால் என்ன?
uk: Що таке затінення зі змінною швидкістю?

source: In modern 3D rendering engines, shaders are much more complex compared to before. The advent of physically-based rendering, real-time global illumination and screen-space effects has increased the number of *per-pixel* shading that must be performed to render each frame. Additionally, screen resolutions also have increased a lot, with 1440p and 4K now being common target resolutions. As a result, the total shading cost in scene rendering usually represents a significant amount of the time taken to render each frame.
ga: In innill rindreála 3D nua-aimseartha, tá scáthóirí i bhfad níos casta i gcomparáid le roimhe seo. Méadaigh teacht rindreáil fhisiciúil, soilsiú domhanda fíor-ama agus éifeachtaí spáis scáileáin líon na scáthannaí* in aghaidh picteilín* a chaithfear a dhéanamh chun gach fráma a léiriú. Ina theannta sin, tá méadú mór tagtha ar rúin scáileáin freisin, agus tá 1440p agus 4K anois ina spriocrúin coitianta. Mar thoradh air sin, is gnách go léiríonn an costas scáthaithe iomlán i rindreáil radhairc méid shuntasach den am a thógtar chun gach fráma a rinneadh.
ru: В современных движках 3D-рендеринга шейдеры стали намного сложнее, чем раньше. Появление физически обоснованного рендеринга, глобального освещения в реальном времени и эффектов экранного пространства увеличило количество *попиксельных* затенений, которые необходимо выполнить для рендеринга каждого кадра. Кроме того, разрешения экрана также значительно возросли, и теперь распространенными целевыми разрешениями являются 1440p и 4K. В результате общая стоимость затенения при рендеринге сцены обычно составляет значительную часть времени, необходимого для рендеринга каждого кадра.
ta: நவீன 3D வழங்குதல் என்சின்களில், சேடர்கள் முன்பை ஒப்பிடும்போது மிகவும் சிக்கலானவை. உடல் அடிப்படையிலான வழங்குதல், நிகழ்நேர உலகளாவிய வெளிச்சம் மற்றும் திரை-இட விளைவுகளின் வருகை ஒவ்வொரு சட்டகத்தையும் வழங்குவதற்கு செய்யப்பட வேண்டிய * ஒவ்வொரு படப்புள்ளி * நிழலின் எண்ணிக்கையை அதிகரித்துள்ளது. கூடுதலாக, திரை தீர்மானங்களும் நிறைய அதிகரித்துள்ளன, 1440p மற்றும் 4k இப்போது பொதுவான இலக்கு தீர்மானங்களாக உள்ளன. இதன் விளைவாக, காட்சி ரெண்டரிங்கில் மொத்த நிழல் செலவு பொதுவாக ஒவ்வொரு சட்டகத்தையும் வழங்குவதற்கு எடுக்கப்பட்ட நேரத்தின் குறிப்பிடத்தக்க அளவைக் குறிக்கிறது.
uk: У сучасних механізмах 3D-рендерінгу шейдери набагато складніші, ніж раніше. Поява фізичного рендерингу, глобального освітлення в реальному часі та ефектів екранного простору збільшила кількість *піксельних* затінень, які необхідно виконати для візуалізації кожного кадру. Крім того, роздільна здатність екрану також значно зросла, тепер 1440p і 4K є поширеними цільовими роздільними здатностями. Як результат, загальна вартість затінення під час візуалізації сцени зазвичай становить значну кількість часу, витраченого на рендеринг кожного кадру.

source: Variable rate shading (VRS) is a method of decreasing this shading cost by reducing the resolution of *per-pixel* shading (also called *fragment* shading), while keeping the original resolution for rendering geometry. This means geometry edges remain as sharp as they would without VRS. VRS can be combined with any :ref:`doc_3d_antialiasing` technique (MSAA, FXAA, TAA, SSAA).
ga: Is modh é scáthú ráta athraitheach (VRS) chun an costas scáthaithe seo a laghdú trí réiteach scáthaithe* in aghaidh picteilín* a laghdú (ar a dtugtar scáthú* ilroinn* freisin), agus an taifeach bunaidh a choinneáil le haghaidh geoiméadra rindreála. Ciallaíonn sé seo go bhfanann imill geoimnéadais chomh géar agus a bheadh siad gan VRS. Is féidir VRS a chomhcheangal le teicníc ar bith: ref: `doc_3d_antialiasing` (MSAA, FXAA, TAA, SSAA).
ru: Затенение с переменной скоростью (VRS) — это метод снижения стоимости затенения путем снижения разрешения *попиксельного* затенения (также называемого *фрагментным* затенением), сохраняя при этом исходное разрешение для рендеринга геометрии. Это означает, что края геометрии остаются такими же резкими, как и без VRS. VRS можно комбинировать с любой техникой :ref:`doc_3d_antialiasing` (MSAA, FXAA, TAA, SSAA).
ta: மாறி வீத நிழல் (வி.ஆர்.எச்) என்பது வடிவவியலை வழங்குதல் செய்வதற்கான அசல் தீர்மானத்தை வைத்திருக்கும் போது, * ஒவ்வொரு படப்புள்ளி * நிழல் ( * துண்டு * நிழல் என்றும் அழைக்கப்படுகிறது) தீர்மானத்தை குறைப்பதன் மூலம் இந்த நிழல் செலவைக் குறைக்கும் ஒரு முறையாகும். இதன் பொருள் வடிவியல் விளிம்புகள் வி.ஆர்.எச் இல்லாமல் கூர்மையாக இருக்கும். VR களை ஏதேனும் ஒன்றோடு இணைக்கலாம்: ref: `doc_3d_antialiasing` நுட்பம் (MSAA, FXAA, TAA, SSAA).
uk: Затінення зі змінною швидкістю (VRS) — це метод зменшення вартості затінення шляхом зменшення роздільної здатності затінення *на піксель* (також називається *фрагментним* затіненням), зберігаючи при цьому вихідну роздільну здатність для відтворення геометрії. Це означає, що ребра геометрії залишаються такими ж гострими, як і без VRS. VRS можна поєднувати з будь-якою технікою :ref:`doc_3d_antialiasing` (MSAA, FXAA, TAA, SSAA).

source: VRS allows specifying the shading quality in a local manner, which makes it possible to have certain parts of the viewport receive more detailed shading than others. This is particularly useful in virtual reality (VR) to achieve *foveated rendering*, where the center of the viewport is more detailed than the edges.
ga: Ligeann VRS cáilíocht an scáthaithe a shonrú ar bhealach áitiúil, rud a fhágann gur féidir codanna áirithe den radharc scáthú níos mionsonraithe a fháil ná a chéile. Tá sé seo úsáideach go háirithe i réaltacht fhíorúil (VR) chun rinneadh foveat* a bhaint amach, áit a bhfuil lár an radhairc níos mionsonraithe ná na himill.
ru: VRS позволяет локально задавать качество затенения, что позволяет определенным частям области просмотра получать более детальное затенение, чем другим. Это особенно полезно в виртуальной реальности (VR) для достижения *фовеального рендеринга*, когда центр области просмотра более детализирован, чем края.
ta: வி.ஆர்.எச் நிழல் தரத்தை உள்ளக முறையில் குறிப்பிட அனுமதிக்கிறது, இது வியூபோர்ட்டின் சில பகுதிகளை மற்றவர்களை விட விரிவான நிழலைப் பெறுவதை சாத்தியமாக்குகிறது. மெய்நிகர் ரியாலிட்டி (விஆர்) இல் *ஃபோவ்அட் வழங்குதல் *ஐ அடைய இது மிகவும் பயனுள்ளதாக இருக்கும், அங்கு காட்சியின் நடுவண் விளிம்புகளை விட விரிவாக உள்ளது.
uk: VRS дозволяє визначати якість затінення локально, що дає змогу отримати більш детальне затінення певних частин вікна перегляду, ніж інші. Це особливо корисно у віртуальній реальності (VR) для досягнення *фоветного рендерингу*, де центр вікна перегляду більш деталізований, ніж краї.

source: Here's a scene rendered with rate shading disabled then enabled, using the density map linked at the bottom of this page:
ga: Seo radharc a rindreáiltear le scáthú rátaí míchumasaithe ansin, ag baint úsáide as an léarscáil dlúis atá nasctha ag bun an leathanaigh seo:
ru: Ниже представлена сцена, визуализированная с отключенным и включенным затенением скорости с использованием карты плотности, ссылка на которую приведена в нижней части этой страницы:
ta: இந்த பக்கத்தின் கீழே இணைக்கப்பட்டுள்ள அடர்த்தி வரைபடத்தைப் பயன்படுத்தி, பின்னர் இயக்கப்பட்ட வீத நிழல் முடக்கப்பட்ட ஒரு காட்சி இங்கே:
uk: Ось сцена, відтворена з вимкненим, а потім увімкненим затіненням за допомогою карти щільності, посилання на яку наведено внизу цієї сторінки:

source: Variable rate shading disabled in textured scene
ga: Scáthú ráta athraitheach faoi mhíchumas i radharc uigeach
ru: В текстурированной сцене отключено затенение с переменной скоростью
ta: கடினமான காட்சியில் மாறி வீத நிழல் முடக்கப்பட்டுள்ளது
uk: Затінення зі змінною швидкістю вимкнено в текстурованій сцені

source: Variable rate shading disabled in untextured scene
ga: Scáthú ráta athraitheach faoi mhíchumas i radharc neamuigeach
ru: В нетекстурированной сцене отключено затенение с переменной скоростью
ta: மாற்றப்படாத காட்சியில் மாறி வீத நிழல் முடக்கப்பட்டுள்ளது
uk: Затінення зі змінною швидкістю вимкнено в сцені без текстур

source: Hardware support
ga: Tacaíocht crua-earraí
ko: 하드웨어 지원
ru: Поддержка оборудования
ta: வன்பொருள் உதவி
uk: Апаратна підтримка

source: Variable rate shading is only supported on specific GPUs:
ga: Ní thacaítear le scáthú ráta athraitheach ach ar GPUanna ar leith:
ko: 가변 비율 셰이딩은 특정 GPU에서만 지원됩니다:
ru: Затенение с переменной скоростью поддерживается только на определенных графических процессорах:
ta: மாறுபட்ட வீத நிழல் குறிப்பிட்ட சி.பீ.யுகளில் மட்டுமே ஆதரிக்கப்படுகிறது:
uk: Затінення зі змінною швидкістю підтримується лише на певних графічних процесорах:

source: **Desktop:**
ga: **Deisce: **
ko: **데스크톱:**
ru: **Desktop (Рабочий стол):**
ta: ** டெச்க்டாப்: **
uk: **Настільний комп’ютер:**

source: NVIDIA Turing and newer (including GTX 1600 series)
ga: NVIDIA Turing agus níos nuaí (lena n-áirítear sraith GTX 1600)
ko: NVIDIA Turing 이상 (GTX 1600 시리즈 포함)
ru: NVIDIA Turing и новее (включая серию GTX 1600)
ta: என்விடியா டூரிங் மற்றும் புதிய (சி.டி.எக்ச் 1600 தொடர் உட்பட)
uk: NVIDIA Turing і новіші (включаючи серію GTX 1600)

source: AMD RDNA2 and newer (both integrated and dedicated GPUs – including Steam Deck)
ga: AMD RDNA2 agus níos nuaí (GPUanna comhtháite agus tiomnaithe araon - lena n-áirítear Steam Deck)
ko: AMD RDNA2 이상 (통합 및 전용 GPU 모두 – Steam Deck 포함)
ru: AMD RDNA2 и новее (как интегрированные, так и выделенные графические процессоры – включая Steam Deck)
ta: AMD RDNA2 மற்றும் புதியது (ஒருங்கிணைந்த மற்றும் அர்ப்பணிக்கப்பட்ட GPU கள் - நீராவி டெக் உட்பட)
uk: AMD RDNA2 і новіші (інтегровані та виділені графічні процесори – включаючи Steam Deck)

source: Intel Arc Alchemist and newer **(dedicated GPUs only)**
ga: Intel Arc Alchemist agus níos nuai** (GPUanna tiomnaithe amháin) **
ko: Intel Arc Alchemist 이상 **(전용 GPU만)**
ru: Intel Arc Alchemist и более новые версии **(только выделенные графические процессоры)**
ta: இன்டெல் ஆர்க் அல்கெமிச்ட் மற்றும் புதிய ** (அர்ப்பணிக்கப்பட்ட சி.பீ.யுகள் மட்டும்) **
uk: Intel Arc Alchemist і новіші **(лише виділені графічні процесори)**

source: Intel integrated graphics do not support variable rate shading.
ga: Ní thacaíonn grafaicí comhtháite Intel le scáthú ráta athraitheach.
ko: Intel 통합 그래픽은 가변 비율 셰이딩을 지원하지 않습니다.
ru: Интегрированная графика Intel не поддерживает затенение с переменной скоростью.
ta: இன்டெல் ஒருங்கிணைந்த கிராபிக்ச் மாறி வீத நிழலை ஆதரிக்காது.
uk: Інтегрована графіка Intel не підтримує затінення зі змінною швидкістю.

source: **Mobile SoCs:**
ga: ** Socanna soghluaiste: **
ko: **모바일 SoC:**
ru: **Мобильные SoC-ы:**
ta: ** மொபைல் சொக்: **
uk: **Мобільні SoC:**

source: Snapdragon 888 and newer
ga: Snapdragon 888 agus níos nuaí
ko: Snapdragon 888 이상
ru: Snapdragon 888 и новее
ta: ச்னாப்டிராகன் 888 மற்றும் புதியது
uk: Snapdragon 888 і новіше

source: MediaTek Dimensity 9000 and newer
ga: MediaTek Dimensity 9000 agus níos nuaí
ko: MediaTek Dimensity 9000 이상
ru: MediaTek Dimensity 9000 и новее
ta: மீடியாடெக் அளவு 9000 மற்றும் புதியது
uk: MediaTek Dimensity 9000 і новіші

source: ARM Mali-G615 and newer
ga: ARM Mali-G615 agus níos nuaí
ko: ARM Mali-G615 이상
ru: ARM Mali-G615 и новее
ta: கை MALI-G615 மற்றும் புதியது
uk: ARM Mali-G615 і новіше

source: As of January 2023, Apple and Raspberry Pi GPUs do not support variable rate shading.
ga: Amhail Eanáir 2023, ní thacaíonn GPUanna Apple agus Raspberry Pi le scáthú ráta athraitheach.
ko: 2023년 1월 현재 Apple과 Raspberry Pi GPU는 가변 비율 셰이딩을 지원하지 않습니다.
ru: По состоянию на январь 2023 года графические процессоры Apple и Raspberry Pi не поддерживают затенение с переменной скоростью.
ta: சனவரி 2023 நிலவரப்படி, ஆப்பிள் மற்றும் ராச்பெர்ரி பை சி.பீ.யுகள் மாறி வீத நிழலை ஆதரிக்காது.
uk: Станом на січень 2023 року графічні процесори Apple і Raspberry Pi не підтримують затінення зі змінною швидкістю.

source: Using variable rate shading in Godot
ga: Ag baint úsáide as scáthú ráta athraitheach i Godot
ko: Godot에서 가변 비율 셰이딩 사용하기
ru: Использование затенения с переменной скоростью в Godot
ta: கோடோட்டில் மாறி வீத நிழலைப் பயன்படுத்துதல்
uk: Використання затінення зі змінною швидкістю в Godot

source: In the advanced Project Settings, the **Rendering > VRS** section offers settings to control variable rate shading on the root viewport:
ga: Sna Ardsocruithe Tionscadail, cuireann an rannán **Rindeáil > VRS** socruithe ar fáil chun scáthú ráta inathraithe a rialú ar an amharcphort fréimhe:
ru: В расширенных настройках проекта раздел **Rendering > VRS** предлагает параметры для управления затенением с переменной скоростью в корневом окне просмотра:
ta: மேம்பட்ட திட்ட அமைப்புகளில், ** ரெண்டரிங்> விஆர்எச் ** பிரிவு ரூட் வியாபோர்ட்டில் மாறி வீத நிழலைக் கட்டுப்படுத்த அமைப்புகளை வழங்குகிறது:
uk: У розширених налаштуваннях проекту в розділі **Відтворення > VRS** пропонуються налаштування для керування затіненням зі змінною швидкістю в кореневому вікні перегляду:

source: **Mode:** Controls the variable rate shading mode. **Disabled** disables variable rate shading. **Texture** uses a manually authored texture to set shading density (see the property below). **XR** automatically generates a texture suited for foveated rendering in virtual/augmented reality.
ga: **Mód: ** Rialaíonn sé an modh scáthaithe ráta athraitheach. ** Díchumasaí** díchumasaíonn scáthú ráta athraitheach. Úsáideann **Texture** uigeacht údar de láimh chun dlús scáthaithe a shocrú (féach an maoin thíos). Gineann **XR** uigeacht go huathoibríoch atá oiriúnach do rindreáil foveated i réaltacht fhíorúil/méadaithe.
ru: **Mode:** управляет режимом затенения с переменной скоростью. **Disabled** отключает затенение с переменной скоростью. **Texture** использует вручную созданную текстуру для установки плотности затенения (см. свойство ниже). **XR** автоматически генерирует текстуру, подходящую для фовеального рендеринга в виртуальной/дополненной реальности.
ta: ** பயன்முறை: ** மாறி வீத நிழல் பயன்முறையை கட்டுப்படுத்துகிறது. ** முடக்கப்பட்டது ** மாறி வீத நிழலை முடக்குகிறது. ** அமைப்பு ** நிழல் அடர்த்தியை அமைக்க கைமுறையாக எழுதப்பட்ட அமைப்பைப் பயன்படுத்துகிறது (கீழே உள்ள சொத்தைப் பார்க்கவும்). ** எக்ச்ஆர் ** மெய்நிகர்/பெரிதாக்கப்பட்ட யதார்த்தத்தில் ஃபோவேட் ரெண்டரிங்கிற்கு பொருத்தமான ஒரு அமைப்பை தானாக உருவாக்குகிறது.
uk: **Режим:** Керує режимом затінення зі змінною швидкістю. **Вимкнено** вимикає затінення зі змінною швидкістю. **Текстура** використовує створену вручну текстуру для встановлення щільності затінення (див. властивість нижче). **XR** автоматично генерує текстуру, придатну для візуалізації у віртуальній/доповненій реальності.

source: **Texture:** The texture to use to control shading density on the root viewport. Only used if **Mode** is **Texture**.
ga: **Uigeacht: ** An uigeacht le húsáid chun dlús scáthaithe a rialú ar an radharc fréimhe. Ní úsáidtear ach amháin mura bhfuil **Mod** **Uigeach**.
ru: **Texture:** Текстура, используемая для управления плотностью затенения в корневом окне просмотра. Используется только если **Mode** равен **Texture**.
ta: ** அமைப்பு: ** ரூட் வியூபோர்ட்டில் நிழல் அடர்த்தியைக் கட்டுப்படுத்த பயன்படுத்த வேண்டிய அமைப்பு. ** பயன்முறை ** என்றால் மட்டுமே பயன்படுத்தப்படுகிறது ** அமைப்பு **.
uk: **Текстура:** Текстура, яка використовується для керування щільністю затінення в кореневому вікні перегляду. Використовується, лише якщо **Режим** має значення **Текстура**.

source: For custom viewports, the VRS mode and texture must be set manually to the :ref:`class_Viewport` node.
ga: Maidir le radharcanna saincheaptha, caithfear an modh VRS agus an uigeacht a shocrú de láimh chuig an nód: ref: `Class_Viewport`.
ru: Для пользовательских видовых экранов режим VRS и текстура должны быть установлены вручную для узла :ref:`class_Viewport`.
ta: தனிப்பயன் காட்சிப் வகைகளுக்கு, விஆர்எச் பயன்முறையும் அமைப்பும் கைமுறையாக அமைக்கப்பட வேண்டும்: ref: `class_viewport` முனை.
uk: Для користувальницьких вікон перегляду режим VRS і текстуру потрібно встановити вручну для вузла :ref:`class_Viewport`.

source: On unsupported hardware, there is no visual difference when variable rate shading is enabled. You can check whether hardware supports variable rate shading by running the editor or project with the ``--verbose`` :ref:`command line argument <doc_command_line_tutorial>`.
ga: Ar chrua-earraí gan tacaíocht, níl aon difríocht amhairc nuair atá scáthú ráta inathraithe cumasaithe. Is féidir leat a sheiceáil cibé an dtacaíonn crua-earraí le scáthú ráta athraitheach tríd an eagarthóir nó tionscadal a rith leis an ``--verb`` : ref:`argóint líne ordaithe <doc_command_line_tutorial>`.
ru: На неподдерживаемом оборудовании нет визуальной разницы при включении переменного затенения. Вы можете проверить, поддерживает ли оборудование переменное затенение, запустив редактор или проект с ``--verbose`` :ref:`command line argument <doc_command_line_tutorial>`.
ta: ஆதரிக்கப்படாத வன்பொருளில், மாறி வீத நிழல் இயக்கப்பட்டிருக்கும் போது காட்சி வேறுபாடு இல்லை. `` --Verbose`` உடன் எடிட்டர் அல்லது திட்டத்தை இயக்குவதன் மூலம் வன்பொருள் மாறி வீத நிழலை ஆதரிக்கிறதா என்பதை நீங்கள் சரிபார்க்கலாம்: ref: `கட்டளை வரி உரையாடல் <doc_command_line_tutorial>`.
uk: На непідтримуваному апаратному забезпеченні немає візуальної різниці, коли ввімкнено затінення зі змінною швидкістю. Ви можете перевірити, чи апаратне забезпечення підтримує затінення зі змінною швидкістю, запустивши редактор або проект із аргументом ``--verbose`` :ref:`командного рядка <doc_command_line_tutorial>`.

source: Creating a VRS density map
ga: Léarscáil dlús VRS a chruthú
ru: Создание карты плотности VRS
ta: வி.ஆர்.எச் அடர்த்தி வரைபடத்தை உருவாக்குதல்
uk: Створення карти щільності VRS

source: If using the **Texture** VRS mode, you *must* set a texture to be used as a density map. Otherwise, no effect will be visible.
ga: Má úsáideann tú an modh**Texture** VRS, ní mór duit* uigeacht a shocrú le húsáid mar léarscáil dlúis. Seachas sin, ní bheidh aon éifeacht le feiceáil.
ru: При использовании режима VRS **Texture** вы *должны* установить текстуру, которая будет использоваться в качестве карты плотности. В противном случае никакого эффекта не будет видно.
ta: ** அமைப்பு ** VRS பயன்முறையைப் பயன்படுத்தினால், நீங்கள்*அடர்த்தி வரைபடமாகப் பயன்படுத்த ஒரு அமைப்பை*அமைக்க வேண்டும். இல்லையெனில், எந்த விளைவும் காணப்படாது.
uk: Якщо ви використовуєте режим **Texture** VRS, ви *потрібно* встановити текстуру, яка буде використовуватися як карта щільності. Інакше ефекту не буде видно.

source: You can create your own VRS density map manually using an image editor, or generate it using another method (e.g. on the CPU using the Image class, or on the GPU using a shader). However, beware of performance implications when generating a VRS image dynamically. If opting for dynamic generation, make sure the VRS image generation process is fast enough to avoid outweighing the performance gains from VRS.
ga: Is féidir leat do léarscáil dlús VRS féin a chruthú de láimh ag baint úsáide as eagarthóir íomhá, nó é a ghiniúint ag baint úsáide as modh eile (m.sh. ar an LAP ag baint úsáide as an rang Íomhá, nó ar an GPU ag baint úsáide as scáthóir). Mar sin féin, bí cúramach faoi impleachtaí feidhmíochta agus íomhá VRS á ghiniúint go dinimiciúil Má roghnaíonn tú giniúint dinimiciúil, déan cinnte go bhfuil próiseas giniúna íomhá VRS tapa go leor chun níos mó ná na gnóthachain feidhmíochta ó VRS a sheachaint.
ru: Вы можете создать собственную карту плотности VRS вручную с помощью редактора изображений или сгенерировать ее другим методом (например, на CPU с помощью класса Image или на GPU с помощью шейдера). Однако будьте осторожны с последствиями для производительности при динамической генерации изображения VRS. Если вы выбираете динамическую генерацию, убедитесь, что процесс генерации изображения VRS достаточно быстр, чтобы не перевесить выигрыш в производительности от VRS.
ta: பட எடிட்டரைப் பயன்படுத்தி உங்கள் சொந்த வி.ஆர்.எச் அடர்த்தி வரைபடத்தை கைமுறையாக உருவாக்கலாம் அல்லது மற்றொரு முறையைப் பயன்படுத்தி அதை உருவாக்கலாம் (எ.கா. பட வகுப்பைப் பயன்படுத்தி சிபியு இல் அல்லது ஒரு சேடரைப் பயன்படுத்தி GPU இல்). இருப்பினும், வி.ஆர்.எச் படத்தை மாறும் வகையில் உருவாக்கும் போது செயல்திறன் தாக்கங்களை கவனமாக. மாறும் தலைமுறையைத் தேர்வுசெய்தால், வி.ஆர்.எச் பட உருவாக்கும் செயல்முறை வி.ஆர்.எச் -யிலிருந்து செயல்திறன் ஆதாயங்களை விட அதிகமாக இருப்பதைத் தவிர்க்க போதுமானதாக இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: Ви можете створити власну карту щільності VRS вручну за допомогою редактора зображень або створити її за допомогою іншого методу (наприклад, на ЦП за допомогою класу Image або на GPU за допомогою шейдера). Однак уникайте наслідків для продуктивності під час динамічного створення образу VRS. Якщо ви обираєте динамічну генерацію, переконайтеся, що процес генерації зображень VRS достатньо швидкий, щоб не переважити підвищення продуктивності від VRS.

source: The texture must follow these rules:
ga: Caithfidh an uigeacht na rialacha seo a leanúint:
ru: Текстура должна соответствовать следующим правилам:
ta: அமைப்பு இந்த விதிகளைப் பின்பற்ற வேண்டும்:
uk: Текстура повинна відповідати таким правилам:

source: The texture *must* use a lossless compression format so that colors can be matched precisely.
ga: Ní mór don uigeacht ** formáid comhbhrúite gan chaillteanas a úsáid ionas gur féidir dathanna a mheaitseáil go beacht.
ru: Текстура *должна* использовать формат сжатия без потерь, чтобы цвета можно было точно сопоставить.
ta: அமைப்பு * இழப்பற்ற சுருக்க வடிவமைப்பைப் பயன்படுத்த வேண்டும், இதனால் வண்ணங்களை துல்லியமாக பொருத்த முடியும்.
uk: Текстура *має* використовувати формат стиснення без втрат, щоб кольори можна було точно підібрати.

source: The following VRS densities are mapped to various colors, with brighter colors representing a lower level of shading precision:
ga: Déantar na dlúis VRS seo a leanas a mhapáil le dathanna éagsúla, agus dathanna níos gile léiríonn leibhéal níos ísle cruinneas scáthaithe:
ru: Следующие плотности VRS сопоставлены с различными цветами, при этом более яркие цвета представляют более низкий уровень точности затенения:
ta: பின்வரும் வி.ஆர்.எச் அடர்த்தி பல்வேறு வண்ணங்களுடன் வரைபடமாக்கப்படுகிறது, பிரகாசமான வண்ணங்கள் குறைந்த அளவிலான நிழல் துல்லியத்தைக் குறிக்கின்றன:
uk: Наступні щільності VRS зіставляються з різними кольорами, причому яскравіші кольори представляють нижчий рівень точності затінення:

source: Density
ga: Dlús
ru: Плотность
ta: அடர்த்தி
uk: Щільність

source: Color
ga: Dath
ko: 색상
ru: Цвет
ta: நிறம்
uk: Колір

source: Comment
ga: Nóta Tráchta
ko: 주석
ru: Комментарий
ta: கருத்து
uk: Коментар

source: 1×1 (highest detail)
ga: 1 × 1 (mionsonraí is airde)
ru: 1×1 (наивысшая детализация)
ta: 1 × 1 (மிக உயர்ந்த விவரம்)
uk: 1×1 (найвища деталізація)

source: ``rgb(85, 0, 0) - #550000``
ta: `` ஆர்சிபி (85, 0, 0) - #550000``

source: ``rgb(85, 85, 0) - #555500``
ta: `` ஆர்சிபி (85, 85, 0) - #555500``

source: Not supported on most hardware.
ga: Ní thacaítear le formhór na crua-earraí.
ru: Не поддерживается на большинстве аппаратных средств.
ta: பெரும்பாலான வன்பொருளில் ஆதரிக்கப்படவில்லை.
uk: Не підтримується на більшості обладнання.

source: 8×8 (lowest detail)
ga: 8 × 8 (sonraí is ísle)
ru: 8×8 (самая низкая детализация)
ta: 8 × 8 (மிகக் குறைந்த விவரம்)
uk: 8×8 (найменша деталізація)
