Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/default_key_mapping.po
Languages: ga

source: cheatsheet, cheat sheet, shortcut
ga: bileog cheatsheet, bileog cheat, aicearra

source: Default editor shortcuts
ga: Aicearraí eagarthóra réamh

source: While some actions are universal, a lot of shortcuts are specific to individual tools. For this reason it is possible for some key combinations to be assigned to more than one function. The correct action will be performed depending on the context.
ga: Cé go bhfuil roinnt gníomhartha uilíoch, tá a lán aicearraí go sonrach le huirlisí aonair. Ar an gcúis seo is féidir roinnt teaglaim eochair a shannadh do níos mó ná feidhm amháin. Déanfar an gníomh ceart ag brath ar an gcomhthéacs.

source: While Windows and Linux builds of the editor share most of the default settings, some shortcuts may differ for macOS version. This is done for better integration of the editor into macOS ecosystem. Users fluent with standard shortcuts on that OS should find Godot Editor's default key mapping intuitive.
ga: Cé go roinneann Windows agus Linux an t-eagarthóir an chuid is mó de na socruithe réamhshocraithe, d'fhéadfadh go mbeadh roinnt aicearraí difriúil le haghaidh leagan macOS. Déantar é seo chun an t-eagarthóir a chomhtháthú níos fearr in éiceachóras macOS. Ba cheart d'úsáideoirí atá líofa le haicearraí caighdeánacha ar an OS sin mapáil eochair réamhshocraithe Godot Editor a fháil iomasach.

source: Action name
ga: Ainm gníomhaíochta

source: Editor setting
ga: Suíomh eagarthóra

source: Open 2D Editor
ga: Oscail Eagarthóir 2D

source: ``editor/editor_2d``
ga: ``eagarthóir/eagarthóir_2d``

source: Open 3D Editor
ga: Oscail Eagarthóir 3D

source: ``editor/editor_3d``
ga: ``eagarthóir/eagarthóir_3d``

source: Open Script Editor
ga: Eagarthóir Script Oscailte

source: ``editor/editor_script``
ga: ``eagarthóir/eagarthóir_script``

source: Search Help
ga: Cuardaigh Cabhair

source: :kbd:`Opt + Space`
ga: :kbd: `Opt + Spás `

source: ``editor/editor_help``
ga: ``cabhair eagarthóir/eagarthóir_eagarthóir``

source: Distraction Free Mode
ga: Modh saor in aisce seachráin

source: ``editor/distraction_free_mode``
ga: ``mod_eagarthóir/tarraing_saor-mhod``

source: :kbd:`Ctrl + Tab`
ga: :kbd: `Ctrl + Club`

source: ``editor/next_tab``
ga: ``eagarthóir/seach_tab``

source: :kbd:`Ctrl + Shift + Tab`
ga: :kbd: `Ctrl + Shift + Cluais`

source: ``editor/prev_tab``
ga: ``eagarthóir/réamh_tab``

source: Filter Files
ga: Comhaid Scagaire

source: ``editor/filter_files``
ga: ``eagarthóir/comhad_scagair``

source: Open Scene
ga: Radharc Oscailte

source: ``editor/open_scene``
ga: ``eagarthóir/scána_oscailte``

source: Close Scene
ga: Radharc Dún

source: ``editor/close_scene``
ga: ``eagarthóir/radharc dúnta ``

source: Reopen Closed Scene
ga: Athoscail Radharc Dúnta

source: ``editor/reopen_closed_scene``
ga: ``eagarthóir/athoscailt_scán_clúdaire``

source: Save Scene
ga: Sábháil Radharc

source: ``editor/save_scene``
ga: ``eagarthóir/save_scena ``

source: Save Scene As
ga: Sábháil Radharc Mar

source: ``editor/save_scene_as``
ga: ``eagarthóir/save_scene_as ``

source: Save All Scenes
ga: Sábháil Gach Radharc

source: ``editor/save_all_scenes``
ga: ``eagarthóir/sábháil_uach_radhairc``

source: Quick Open
ga: Tapa oscailte

source: :kbd:`Shift + Alt + O`
ga: :kbd: `Aistrithe+Alt + O`

source: ``editor/quick_open``
ga: ``eagarthóir/tapa_oscailt ``

source: Quick Open Scene
ga: Radharc Oscailte Tapa

source: ``editor/quick_open_scene``
ga: ``eagarthóir/quick_open_scena ``

source: Quick Open Script
ga: Script Oscailte Tapa

source: ``editor/quick_open_script``
ga: ``eagarthóir/quick_open_script``

source: Undo
ga: Cealaigh

source: ``editor/undo``
ga: ``eagarthóir/undo``

source: Redo
ga: Athchóirigh

source: ``editor/redo``
ga: ``eagarthóir/redo``

source: Quit
ga: Scoir

source: ``editor/file_quit``
ga: ``eagarthóir/file_quit``

source: Quit to Project List
ga: Stop go Liosta Tionscadail

source: ``editor/quit_to_project_list``
ga: ``eagarthóir/liosta_to_tionscadala``

source: Take Screenshot
ga: Tóg Scáileán

source: ``editor/take_screenshot``
ga: ``eagarthóir/léarscáileán a thógáil ``

source: Toggle Fullscreen
ga: Athraigh Scáileán Iomlán

source: :kbd:`Shift + F11`
ga: :kbd: `Aistriú + F11`

source: ``editor/fullscreen_mode``
ga: ``eagarthóir/mod_fullscreen ``

source: Play
ga: Seinn

source: ``editor/play``
ga: ``eagarthóir/seinm ``

source: Pause Scene
ga: Radharc Sos

source: ``editor/pause_scene``
ga: ``eagarthóir/scána_stopaire``

source: ``editor/stop``
ga: ``eagarthóir/stad ``

source: Play Scene
ga: Seinn Radharc

source: ``editor/play_scene``
ga: ``eagarthóir/play_scéine``

source: Play Custom Scene
ga: Seinn Radharc Saincheaptha

source: ``editor/play_custom_scene``
ga: ``eagarthóir/play_custom_scene ``

source: Expand Bottom Panel
ga: Leathnaigh Painéal Bun

source: :kbd:`Shift + F12`
ga: :kbd: `Aistriú + F12`

source: ``editor/bottom_panel_expand``
ga: ``eagarthóir/bun painéil_leathnaitheo``

source: Zoom In
ga: Súmáil isteach

source: ``canvas_item_editor/zoom_plus``
ga: ``eagarthóirí_earraí_canvas/zoom_plus``

source: Zoom Out
ga: Súmáil amach

source: ``canvas_item_editor/zoom_minus``
ga: ``eagarthóirí_earraí_canvas/zoom_minus``

source: Zoom Reset
ga: Athshocraigh Súmáil

source: ``canvas_item_editor/zoom_reset``
ga: ``eagarthóirí_earraí_canvas/zoom_athshocraithe``

source: Pan View
ga: Amharc Pan

source: :kbd:`Space`
ga: :kbd: `Spás

source: ``canvas_item_editor/pan_view``
ga: ``eagarthóirí_earraí_canvas/pan_view``

source: Select Mode
ga: Roghnaigh Mód

source: ``canvas_item_editor/select_mode``
ga: ``eagarthóirí_earraí_canvas/mod_roghnaigh ``

source: Move Mode
ga: Mód Bogadh

source: ``canvas_item_editor/move_mode``
ga: ``eagarthóirí_earraí_canvas/mod_gluaise``

source: Rotate Mode
ga: Rothlaigh Mód

source: ``canvas_item_editor/rotate_mode``
ga: ``eagarthóirí_earraí_canvas/mod_rothlacha``

source: Scale Mode
ga: Mód Scála

source: ``canvas_item_editor/scale_mode``
ga: ``eagarthóirí_earraí_canvas/mod_scála``

source: Ruler Mode
ga: Mód Rialóra

source: ``canvas_item_editor/ruler_mode``
ga: ``eagarthóirí_earraí_canvas/mod_rialaitheoir``

source: Use Smart Snap
ga: Úsáid Smart Snap

source: :kbd:`Shift + S`
ga: :kbd: `Aistriú + S`

source: ``canvas_item_editor/use_smart_snap``
ga: ``eagarthóirí_earraí_canvas/úsáid_smart_snap``

source: Use Grid Snap
ga: Úsáid Grid Snap

source: ``canvas_item_editor/use_grid_snap``
ga: ``eagarthóirí_earraí_canvas/úsáid_grid_snap``

source: Multiply grid step by 2
ga: Iolraigh greille céim ar 2

source: :kbd:`Num *`
ga: :kbd: `Uimh* `

source: ``canvas_item_editor/multiply_grid_step``
ga: ``eagarthóirí_earraí_canvas/iolraitheoir_grid_céime``

source: Divide grid step by 2
ga: Roinn greille céim ar 2

source: :kbd:`Num /`
ga: :kbd: `Uimhir /`

source: ``canvas_item_editor/divide_grid_step``
ga: ``eagarthóirí_earraí_canvas/deighilteoir_grid_step``

source: Always Show Grid
ga: Taispeáin Eangail i gcó

source: ``canvas_item_editor/show_grid``
ga: ``eagarthóirí_earraí_canvas/grid_taispeánaithe``

source: Show Helpers
ga: Taispeáin Cúntóirí

source: ``canvas_item_editor/show_helpers``
ga: ``eagarthóirí_earraí_canvas/cúntóirí_seón``

source: Show Guides
ga: Taispeáin Treoracha

source: ``canvas_item_editor/show_guides``
ga: ``eagarthóirí_earraí_canvas/treoracha taispeánaithe``

source: Center Selection
ga: Roghnú Ionad

source: ``canvas_item_editor/center_selection``
ga: ``eagarthóirí_earraí_canvas/roghnaí_ionaid ``

source: Frame Selection
ga: Roghnú Fráma

source: :kbd:`Shift + F`
ga: :kbd: `Aistriú + F`

source: ``canvas_item_editor/frame_selection``
ga: ``eagarthóirí_earraí_canvas/roghnaí_fráma``

source: Preview Canvas Scale
ga: Réamhamharc ar Scála

source: ``canvas_item_editor/preview_canvas_scale``
ga: ``eagarthóirí_earraí_canvas/réamhamhar_canvas_scála ``

source: Insert Key
ga: Cuir isteach eochair

source: ``canvas_item_editor/anim_insert_key``
ga: ``eagarthóirí_earraí_canvas/eochair_iontráil anim_``

source: Insert Key (Existing Tracks)
ga: Cuir isteach Eochair (Rianta atá ann cheana)

source: ``canvas_item_editor/anim_insert_key_existing_tracks``
ga: ``eagarthóirí_earraí_canvas/cuir isteach anim_key_rianta ann ``

source: Make Custom Bones from Nodes
ga: Déan Cnámha Saincheaptha ó Nóid

source: ``canvas_item_editor/skeleton_make_bones``
ga: ``eagarthóirí_earraí_canvas/cnámharlaí_déanaime_cnámha ``

source: Clear Pose
ga: Pose Soiléir

source: :kbd:`Shift + K`
ga: :kbd: `Aistriú + K`

source: ``canvas_item_editor/anim_clear_pose``
ga: ``eagarthóirí_earr_canvas/anim_clear_phosa``

source: Toggle Freelook
ga: Athraigh Freelook

source: ``spatial_editor/freelook_toggle``
ga: ``eagarthóir_spáis/freelook_toggle``

source: Freelook Left
ga: Freelook ar Chlé

source: ``spatial_editor/freelook_left``
ga: ``eagarthóir_spásal/freelook_left``

source: Freelook Right
ga: Freelook Ceart

source: ``spatial_editor/freelook_right``
ga: ``eagarthóir_spásal/freelook_right ``

source: Freelook Forward
ga: Breathnú ar aghaidh saor in aisce,

source: ``spatial_editor/freelook_forward``
ga: ``eagarthóir_spásal/freelook_forward ``

source: Freelook Backwards
ga: Freelook ar ais

source: ``spatial_editor/freelook_backwards``
ga: ``eagarthóir_spáis/freelook_backwards``

source: Freelook Up
ga: Freelook suas

source: ``spatial_editor/freelook_up``
ga: ``eagarthóir_spásal/freelook_up``

source: Freelook Down
ga: Freelook Síos

source: ``spatial_editor/freelook_down``
ga: ``eagarthóir_spásal/freelook_down``

source: Freelook Speed Modifier
ga: Athraitheoir Luais Freelook

source: :kbd:`Shift`
ga: :kbd: `Athraithe'

source: ``spatial_editor/freelook_speed_modifier``
ga: ``eagarthóir_spásal/freelook_speed_modifier``

source: Freelook Slow Modifier
ga: Athraitheoir Mall Freelook

source: ``spatial_editor/freelook_slow_modifier``
ga: ``eagarthóir_spásal/freelook_slow_modifier``

source: ``spatial_editor/tool_select``
ga: ``eagarthóir_spásal/roghnaitheo_uirlis``

source: ``spatial_editor/tool_move``
ga: ``eagarthóir_spásal/uirlis_gluaise``

source: ``spatial_editor/tool_rotate``
ga: ``eagarthóir_spásal/uirlis_rothlacha``

source: ``spatial_editor/tool_scale``
ga: ``eagarthóir_spásal/scála_uirlis``

source: Use Local Space
ga: Úsáid Spás Áitiúil

source: ``spatial_editor/local_coords``
ga: ``eagarthóir_spásal/comhorduithe áitiúla ``

source: Use Snap
ga: Úsáid Snap

source: ``spatial_editor/snap``
ga: ``eagarthóir_spásal/snap``

source: Snap Object to Floor
ga: Snap Cuspóir go Urlár

source: ``spatial_editor/snap_to_floor``
ga: ``eagarthóir_spásal/snap_to_urlár ``

source: Top View
ga: Amharc Barr

source: :kbd:`Num 7`
ga: :kbd: `Uimhir 7`

source: ``spatial_editor/top_view``
ga: ``eagarthóir_spásal/barr_amharc``

source: Bottom View
ga: Amharc Bun

source: :kbd:`Alt + Num 7`
ga: :kbd: `Alt + Uimhir 7`

source: :kbd:`Opt + Num 7`
ga: :kbd: `Opt + Uimhir 7`

source: ``spatial_editor/bottom_view``
ga: ``eagarthóir_spásal/amharc_bun ``

source: Front View
ga: Amharc Tosaigh

source: :kbd:`Num 1`
ga: :kbd: `Uimhir 1`

source: ``spatial_editor/front_view``
ga: ``eagarthóir_spásal/amharc tosaigh ``

source: Rear View
ga: Amharc Cúl

source: :kbd:`Alt + Num 1`
ga: :kbd: `Alt + Uimhir 1`

source: :kbd:`Opt + Num 1`
ga: :kbd: `Opt + Uimhir 1`

source: ``spatial_editor/rear_view``
ga: ``eagarthóir_spásal/amharc_cúil ``

source: Right View
ga: Amharc ceart

source: :kbd:`Num 3`
ga: :kbd: `Uimhir 3`

source: ``spatial_editor/right_view``
ga: ``eagarthóir_spásal/amharc ceart ``

source: Left View
ga: Amharc ar Chlé

source: :kbd:`Alt + Num 3`
ga: :kbd: `Alt + Uimhir 3`

source: :kbd:`Opt + Num 3`
ga: :kbd: `Opt + Uimhir 3`

source: ``spatial_editor/left_view``
ga: ``eagarthóir_spásal/amharc ar chlé ``

source: Switch Perspective/Orthogonal View
ga: Athraigh Amharc Peirspictíoch/Orthogonal

source: :kbd:`Num 5`
ga: :kbd: `Uimhir 5`

source: ``spatial_editor/switch_perspective_orthogonal``
ga: ``eagarthóir_spásal/lasc_peirspictíve_orthogonal``

source: Insert Animation Key
ga: Cuir isteach Eochair Beochana

source: ``spatial_editor/insert_anim_key``
ga: ``eagarthóir_spásal/cuir isteach eochair_anim_``

source: Focus Origin
ga: Fócas Bunús

source: ``spatial_editor/focus_origin``
ga: ``eagarthóir_spásal/fócas_bunaidh``

source: Focus Selection
ga: Roghnú Fócas

source: ``spatial_editor/focus_selection``
ga: ``eagarthóir_spásal/roghnaí_fócas``

source: Align Transform with View
ga: Ailínigh Claochlaigh le View

source: ``spatial_editor/align_transform_with_view``
ga: ``eagarthóir_spásal/align_transform_with_view``

source: Align Rotation with View
ga: Ailínigh Rotlú le Amharc

source: ``spatial_editor/align_rotation_with_view``
ga: ``eagarthóir_spásal/ailíniú_rothlach_le_amharc``

source: 1 Viewport
ga: 1 Amharc

source: ``spatial_editor/1_viewport``
ga: ``eagarthóir_spatial/1_viewport``

source: 2 Viewports
ga: 2 Radharcanna

source: ``spatial_editor/2_viewports``
ga: ``eagarthóir_spásal/2_viewports``

source: 2 Viewports (Alt)
ga: 2 Amharcphort (Alt)

source: ``spatial_editor/2_viewports_alt``
ga: ``eagarthóir_spásal/2_viewports_alt``

source: 3 Viewports
ga: 3 Radharcanna

source: ``spatial_editor/3_viewports``
ga: ``eagarthóir_spásal/3_viewports``

source: 3 Viewports (Alt)
ga: 3 Amharcphort (Alt)

source: ``spatial_editor/3_viewports_alt``
ga: ``eagarthóir_spásal/3_viewports_alt``

source: 4 Viewports
ga: 4 Radharcanna

source: ``spatial_editor/4_viewports``
ga: ``eagarthóir_spásal/4_viewports``

source: Cut
ga: Gearradh

source: ``script_text_editor/cut``
ga: ``script_text_eagarthóir/gearrth``

source: Copy
ga: Cóipeáil

source: ``script_text_editor/copy``
ga: ``script_text_eagarthóir/cóip ``

source: Paste
ga: Greamaigh

source: ``script_text_editor/paste``
ga: ``script_text_eagarthóir/greamaitheo``

source: Select All
ga: Roghnaigh Gach

source: ``script_text_editor/select_all``
ga: ``script_text_eagarthóir/roghnaitheo_gach uach`

source: Find
ga: Aimsigh

source: ``script_text_editor/find``
ga: ``script_text_eagarthóir/aimsitheo``

source: Find Next
ga: Faigh Ar Aghaidh

source: ``script_text_editor/find_next``
ga: ``script_text_eagarthóir/aimsitheo_next ``

source: Find Previous
ga: Faigh Roimhe Seo

source: :kbd:`Shift + F3`
ga: :kbd: `Aistriú + F3`

source: ``script_text_editor/find_previous``
ga: ``script_text_eagarthóir/aimsitheo_roimhe seach``

source: Find in Files
ga: Aimsigh i gComhaid

source: ``script_text_editor/find_in_files``
ga: ``eagarthóir_text_script/faigh_in_comhaid ``

source: Replace
ga: athsholáthair

source: ``script_text_editor/replace``
ga: ``script_text_eagarthóir/athsholáthair``

source: Replace in Files
ga: Athsholáthair i gComhaid

source: ``script_text_editor/replace_in_files``
ga: ``script_text_eagarthóir/athsholáthraí_in_comhaid ``

source: ``script_text_editor/undo``
ga: ``script_text_eagarthóir/undo``

source: ``script_text_editor/redo``
ga: ``script_text_eagarthóir/redo``

source: Move Up
ga: Bogadh Suas

source: :kbd:`Alt + Up Arrow`
ga: :kbd: `Alt + Suas Arrow`

source: :kbd:`Opt + Up Arrow`
ga: :kbd: `Opt + Suas Arrow`

source: ``script_text_editor/move_up``
ga: ``script_text_eagarthóir/gluaise_suaithe``

source: Move Down
ga: Bogadh síos

source: :kbd:`Alt + Down Arrow`
ga: :kbd: `Alt + Saigh Dúis`

source: :kbd:`Opt + Down Arrow`
ga: :kbd: `Roghnaigh + Saighead síos`

source: ``script_text_editor/move_down``
ga: ``script_text_eagarthóir/gluaise_síos``

source: Delete Line
ga: Scrios Líne

source: ``script_text_editor/delete_line``
ga: ``script_text_eagarthóir/scrios_line``

source: Toggle Comment
ga: Scoránaigh Trácht

source: ``script_text_editor/toggle_comment``
ga: ``script_text_eagarthóir/toggle_comment ``

source: Fold/Unfold Line
ga: Líne Fillteann/Díoscailte

source: ``script_text_editor/toggle_fold_line``
ga: ``script_text_eagarthóir/toggle_fold_line``

source: Duplicate Selection
ga: Roghnú Dúblach

source: ``script_text_editor/duplicate_selection``
ga: ``eagarthóir_text_script/roghnaí_dúbailt``

source: Complete Symbol
ga: Siombail iomlán

source: :kbd:`Ctrl + Space`
ga: :kbd: `Ctrl+Spás `

source: ``script_text_editor/complete_symbol``
ga: ``script_text_eagarthóir/siombail_iomlána``

source: Evaluate Selection
ga: Roghnú a mheas

source: ``script_text_editor/evaluate_selection``
ga: ``script_text_eagarthóir/roghnaí_meastóireach``

source: Trim Trailing Whitespace
ga: Trim Trailing Spás Bán

source: ``script_text_editor/trim_trailing_whitespace``
ga: ``script_text_eagarthóir/trim_trailing_space``

source: Uppercase
ga: Uachchlóir

source: :kbd:`Shift + F4`
ga: :kbd: `Aistriú + F4`

source: ``script_text_editor/convert_to_uppercase``
ga: ``script_text_eagarthóir/tiontaire_to_uppercase``

source: Lowercase
ga: Litreacha beaga

source: :kbd:`Shift + F5`
ga: :kbd: `Aistriú + F5`

source: ``script_text_editor/convert_to_lowercase``
ga: ``script_text_eagarthóir/tiontaire_to_lowercase``

source: Capitalize
ga: Caipitliú

source: :kbd:`Shift + F6`
ga: :kbd: `Aistriú + F6`

source: ``script_text_editor/capitalize``
ga: ``script_text_eagarthóir/capitalize``

source: Convert Indent to Spaces
ga: Tiontaigh Indent go Spásanna

source: ``script_text_editor/convert_indent_to_spaces``
ga: ``script_text_eagarthóir/tiontaire_indent_to_spásanna ``

source: Convert Indent to Tabs
ga: Tiontaigh Indent go Cluaisíní

source: ``script_text_editor/convert_indent_to_tabs``
ga: ``script_text_eagarthóir/tiontaire_indent_to_tabs``

source: Auto Indent
ga: Uathoibríoch

source: ``script_text_editor/auto_indent``
ga: ``script_text_eagarthóir/auto_indent``

source: Toggle Bookmark
ga: Athraigh Leabharmharc

source: ``script_text_editor/toggle_bookmark``
ga: ``script_text_eagarthóir/toggle_bookmark ``

source: Go to Next Bookmark
ga: Téigh go dtí an chéad leabharmharc eile

source: ``script_text_editor/goto_next_bookmark``
ga: ``script_text_eagarthóir/goto_next_bookmark ``

source: Go to Previous Bookmark
ga: Téigh go Leabharmharc Roimhe Seo

source: ``script_text_editor/goto_previous_bookmark``
ga: ``eagarthóir_text_script/goto_leabharmharcanna_roimhe seach``

source: Go to Function
ga: Téigh go dtí Feidhm

source: ``script_text_editor/goto_function``
ga: ``eagarthóirí_text_script/feidhm tochtúis``

source: Go to Line
ga: Téigh go dtí Líne

source: ``script_text_editor/goto_line``
ga: ``eagarthóir_text_script/goto_line``

source: Toggle Breakpoint
ga: Athraigh Brisephointe

source: ``script_text_editor/toggle_breakpoint``
ga: ``script_text_eagarthóir/toggle_breakpoint``

source: Remove All Breakpoints
ga: Bain gach brisephointe

source: ``script_text_editor/remove_all_breakpoints``
ga: ``eagarthóir_text_script/bain gach brisephointí ``

source: Go to Next Breakpoint
ga: Téigh go dtí an Next Breakpoint

source: ``script_text_editor/goto_next_breakpoint``
ga: ``script_text_eagarthóir/goto_next_breakpoint``

source: Go to Previous Breakpoint
ga: Téigh go dtí Breakpoint Roimhe Seo

source: ``script_text_editor/goto_previous_breakpoint``
ga: ``script_text_eagarthóir/to_brisephoint_roimhe seach``

source: Contextual Help
ga: Cabhair Comhthéacsúil

source: :kbd:`Opt + Shift + Space`
ga: :kbd: `Opt + Shift + Spás `

source: ``script_text_editor/contextual_help``
ga: ``script_text_eagarthóir/cabhrach_comhthéacsúil``

source: ``script_editor/find``
ga: ``script_eagarthóir/aimsitheo``

source: ``script_editor/find_next``
ga: ``script_eagarthóir/aimsitheo_next ``

source: ``script_editor/find_previous``
ga: ``script_eagarthóir/aimsitheo_roimhe seach``

source: ``script_editor/find_in_files``
ga: ``eagarthóirí_script/faigh_in_comhaid ``

source: :kbd:`Shift + Alt + Up Arrow`
ga: :kbd: `Shift + Alt + Suas Arrow`

source: :kbd:`Shift + Opt + Up Arrow`
ga: :kbd: `Shift + Ropt+Up Arrow`

source: ``script_editor/window_move_up``
ga: ``eagarthóirí_script/fuinne_gluaise_suaithe``

source: :kbd:`Shift + Alt + Down Arrow`
ga: :kbd: `Aistrigh + Alt + Saighead síos`

source: :kbd:`Shift + Opt + Down Arrow`
ga: :kbd: `Aistrigh + Rogh+Saigh síos`

source: ``script_editor/window_move_down``
ga: ``eagarthóirí_script/fuinne_gluaise_síos``

source: Next Script
ga: An Chéad Script Eile

source: ``script_editor/next_script``
ga: ``eagarthóirí_script/an chéad_script``

source: Previous Script
ga: Script Roimhe Seo

source: ``script_editor/prev_script``
ga: ``eagarthóirí_script/réamh_script``

source: Reopen Closed Script
ga: Athoscail Script Dúnta

source: ``script_editor/reopen_closed_script``
ga: ``script_eagarthóir/athosclaí_closed_script``

source: Save
ga: Sábháil

source: ``script_editor/save``
ga: ``script_eagarthóir/shábháil ``

source: Save All
ga: Sábháil Gach

source: ``script_editor/save_all``
ga: ``script_eagarthóir/save_all``

source: Soft Reload Script
ga: Script Athluchtaithe Bog

source: ``script_editor/reload_script_soft``
ga: ``script_eagarthóir/athlódáil_script_soft``

source: History Previous
ga: Stair Roimhe Seo

source: :kbd:`Alt + Left Arrow`
ga: :kbd: `Alt + Saibh ar Chlé`

source: :kbd:`Opt + Left Arrow`
ga: :kbd: `Opt + Saigha ar Chlé`

source: ``script_editor/history_previous``
ga: ``eagarthóirí_script/stair_roimhe sea``

source: History Next
ga: Stair Ar Aghaidh

source: :kbd:`Alt + Right Arrow`
ga: :kbd: `Alt + Saigh ar dheis`

source: :kbd:`Opt + Right Arrow`
ga: :kbd: `Roghnaigh + Saigh ar dheis`

source: ``script_editor/history_next``
ga: ``eagarthóirí_script/stair_next ``

source: Close
ga: Dún

source: ``script_editor/close_file``
ga: ``eagarthóirí_script/comhad dúnta ``

source: Run
ga: Rith

source: ``script_editor/run_file``
ga: ``eagarthóirí_script/run_comhad``

source: Toggle Scripts Panel
ga: Toggle Scripts Painéal

source: ``script_editor/toggle_scripts_panel``
ga: ``script_eagarthóir/toggle_scripts_painéal``

source: ``script_editor/zoom_in``
ga: ``eagarthóirí_script/zoom_in``

source: ``script_editor/zoom_out``
ga: ``eagarthóirí_script/zoom_out``

source: Reset Zoom
ga: Athshocraigh Súmáil

source: ``script_editor/reset_zoom``
ga: ``eagarthóirí_script/athshocraithe_zoom``

source: Copy Selection
ga: Cóipeáil Rogha

source: ``editor/copy_output``
ga: ``eagarthóir/cóipeach_aschur ``

source: Clear Output
ga: Aschur Soiléir

source: ``editor/clear_output``
ga: ``eagarthóir/clear_output``

source: Debugger
ga: Dífhabhtaitheoir

source: Step Into
ga: Céim isteach

source: Step Over
ga: Céim os cionn

source: Continue
ga: Lean ar aghaidh

source: ``debugger/continue``
ga: ``debugger/leanúint ar aghaidh ``

source: Go Back
ga: Téigh ar ais

source: ``file_dialog/go_back``
ga: ``dialóg comhaire/go_back``

source: Go Forward
ga: Téigh ar aghaidh

source: ``file_dialog/go_forward``
ga: ``dialóg comhad/go ar aghaidh ``

source: Go Up
ga: Téigh Suas

source: ``file_dialog/go_up``
ga: ``dialóg comhad/go suaithe``

source: Refresh
ga: Athnuachan

source: ``file_dialog/refresh``
ga: ``dialóg file/athnuachan ``

source: Toggle Hidden Files
ga: Athraigh Comhaid i bhfolach

source: ``file_dialog/toggle_hidden_files``
ga: ``dialóg file/toggle_hidden_comhaid ``

source: Toggle Favorite
ga: Togl Is Fearr

source: ``file_dialog/toggle_favorite``
ga: ``dialóg file/toggle_favorite``

source: Toggle Mode
ga: Mód Athraigh

source: ``file_dialog/toggle_mode``
ga: ``dialóg comhad/mod_toggle``

source: Create Folder
ga: Cruthaigh Fillteán

source: ``file_dialog/create_folder``
ga: ``dialóg/cruthaithe_fillteán ``

source: Delete
ga: Scrios

source: ``file_dialog/delete``
ga: ``file_dialog/scrios``

source: Focus Path
ga: Conair Fócas

source: ``file_dialog/focus_path``
ga: ``dialóg_comhad/fócas_path``

source: Move Favorite Up
ga: Bogadh Suas is Fearr

source: :kbd:`Ctrl + Up Arrow`
ga: :kbd: `Ctrl+Suas Saigh`

source: :kbd:`Cmd + Up Arrow`
ga: :kbd: `Cmd + Suas Saigh`

source: ``file_dialog/move_favorite_up``
ga: ``dialóg comhad/gluaise_favorite_suaithe``

source: Move Favorite Down
ga: Bogadh is fearr leat síos

source: :kbd:`Ctrl + Down Arrow`
ga: :kbd: `Ctrl + Saigh síos`

source: :kbd:`Cmd + Down Arrow`
ga: :kbd: `Cmd + Saigh síos`
