Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/default_key_mapping.po
Languages: ga

source: ``file_dialog/move_favorite_down``
ga: ``dialóg comhad/gluaise_favorite_síos``

source: Copy Path
ga: Cóipeáil Conair

source: ``filesystem_dock/copy_path``
ga: ``Córas comhad_dock/cóipeáil_path``

source: Duplicate
ga: Dúblach

source: ``filesystem_dock/duplicate``
ga: ``córas comhad dock/dúbailt``

source: Add Child Node
ga: Cuir Nód Leanaí leis

source: ``scene_tree/add_child_node``
ga: ``radhair_crann/cuir leis an nod_linne``

source: Batch Rename
ga: Athainmniú Baisc

source: ``scene_tree/batch_rename``
ga: ``scán_crann/batch_athainmniú ``

source: Copy Node Path
ga: Cóipeáil Conair Nód

source: ``scene_tree/copy_node_path``
ga: ``scán_crann/copy_node_path``

source: ``scene_tree/delete``
ga: ``scene_tree/scrios``

source: Force Delete
ga: Fórsa Scrios

source: ``scene_tree/duplicate``
ga: ''scene_tree/dúblach''

source: Duplicate Transposed
ga: Dúblach Trasuite

source: Delete Selection
ga: Scrios Roghnúchán

source: Go to Next Step
ga: Téigh go dtí an Chéad Chéim Eile

source: :kbd:`Ctrl + Right Arrow`
ga: :kbd:'Ctrl + Saighead Ceart'

source: :kbd:`Cmd + Right Arrow`
ga: :kbd:'Cmd + Saighead Ceart'

source: Go to Previous Step
ga: Téigh go dtí an Chéim Roimhe Seo

source: :kbd:`Ctrl + Left Arrow`
ga: :kbd:'Ctrl + Saighead Chlé'

source: :kbd:`Cmd + Left Arrow`
ga: :kbd:'Cmd + Saighead Chlé'

source: Select
ga: Roghnaigh

source: Cut Selection
ga: Gearr an Roghnúchán

source: ``tiles_editor/cut``
ga: ''tiles_editor/gearrtha''

source: ``tiles_editor/copy``
ga: ''tiles_editor/cóip''

source: Paste Selection
ga: Greamaigh an Roghnúchán

source: ``tiles_editor/paste``
ga: ''tiles_editor/greamaigh''

source: ``tiles_editor/delete``
ga: ''tiles_editor/scrios''

source: Cancel
ga: Cuir ar ceal

source: ``tiles_editor/cancel``
ga: ''tiles_editor/cealaigh''

source: Paint
ga: Péint

source: Line
ga: Líne

source: Rect
ga: RectName

source: Bucket
ga: Buicéad

source: Picker
ga: Roghnóir

source: ``tiles_editor/picker``
ga: ''tiles_editor/roghnóir''

source: Eraser
ga: Scriosán

source: ``tiles_editor/eraser``
ga: ''tiles_editor/scriosán''

source: Flip Horizontally
ga: Smeach go Cothrománach

source: Flip Vertically
ga: Smeach go hIngearach

source: Rotate Left
ga: Rothlaigh ar chlé

source: Rotate Right
ga: Rothlaigh ar dheis

source: Next Coordinate
ga: An Chéad Chomhordanáid Eile

source: Previous Coordinate
ga: Comhordanáid Roimhe Seo

source: Region Mode
ga: Mód Réigiúin

source: Collision Mode
ga: Mód Imbhuailtí

source: Occlusion Mode
ga: Mód Occlusion

source: Navigation Mode
ga: Mód Nascleanúna

source: Bitmask Mode
ga: Mód Bitmask

source: Priority Mode
ga: Mód Tosaíochta

source: Icon Mode
ga: Mód Deilbhíní

source: Z Index Mode
ga: Mód Innéacs Z
