Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/external_editor.po
Languages: fr, ga, it, ja, pt_br, ru, ta, tr, uk, zh_hant

source: Godot supports the `Language Server Protocol <https://microsoft.github.io/language-server-protocol/>`_ (**LSP**) for code completion and the `Debug Adapter Protocol <https://microsoft.github.io/debug-adapter-protocol/>`_ (**DAP**) for debugging. You can check the `LSP client list <https://microsoft.github.io/language-server-protocol/implementors/tools/>`_ and `DAP client list <https://microsoft.github.io/debug-adapter-protocol/implementors/tools/>`_ to find if your editor supports them. If this is the case, you should be able to take advantage of these features without the need of a custom plugin.
ga: Tacaíonn Godot leis an `Prótacal Freastalaí Teanga <https://microsoft.github.io/language-server-protocol/>`_ (**LSP**) chun an cód a chur i gcrích agus leis an `Prótacal Adaptóra Dífhabhtaithe <https://microsoft. github.io/debug-adapter-protocol/>`_ (**DAP**) le haghaidh dífhabhtaithe. Is féidir leat an liosta cliant `LSP a sheiceáil <https://microsoft.github.io/language-server-protocol/implementors/tools/>`_ agus `liosta cliant DAP <https://microsoft.github.io/debug- adapter-protocol/implementors/tools/>`_ le fáil amach an dtacaíonn d'eagarthóir leo. Más é seo an cás, ba cheart go mbeifeá in ann leas a bhaint as na gnéithe seo gan gá le breiseán saincheaptha.
it: Godot supporta il `Language Server Protocol <https://microsoft.github.io/language-server-protocol/>`_ (**LSP**) per il completamento del codice e il `Debug Adapter Protocol <https://microsoft.github.io/debug-adapter-protocol/>`_ (**DAP**) per il debug. Si può consultare l'`elenco dei client LSP <https://microsoft.github.io/language-server-protocol/implementors/tools/>`_ e l'`elenco dei client DAP <https://microsoft.github.io/debug-adapter-protocol/implementors/tools/>`_ per verificare se l'editor scelto li supporta. In tal caso, dovrebbe essere possibile sfruttare queste funzionalità senza la necessità di un'estensione personalizzata.
ja: Godot は、コード補完用の `Language Server Protocol <https://microsoft.github.io/language-server-protocol/>`_ (**LSP**) とデバッグ用の `Debug Adapter Protocol <https://microsoft.github.io/debug-adapter-protocol/>`_ (**DAP**) をサポートしています。エディタがこれらをサポートしているかどうかを確認するには、 `LSP クライアントリスト <https://microsoft.github.io/language-server-protocol/implementors/tools/>`_ と `DAP クライアントリスト <https://microsoft.github.io/debug-adapter-protocol/implementors/tools/>`_ を確認してください。サポートされている場合は、カスタムプラグインを必要とせずにこれらの機能を利用できるはずです。
pt_br: O Godot oferece suporte ao `Language Server Protocol <https://microsoft.github.io/language-server-protocol/>`_ (**LSP**) para autocompletar código e ao `Debug Adapter Protocol <https://microsoft.github.io/debug-adapter-protocol/>`_ (**DAP**) para depuração. Você pode consultar a `lista de clientes LSP <https://microsoft.github.io/language-server-protocol/implementors/tools/>`_ e a `lista de clientes DAP <https://microsoft.github.io/debug-adapter-protocol/implementors/tools/>`_ para verificar se seu editor oferece suporte. Se for o caso, você deverá conseguir aproveitar esses recursos sem a necessidade de um plugin personalizado.
ru: Godot поддерживает `Протокол языка <https://microsoft.github.io/language-server-protocol/>`_ (**LSP**) для автозавершения кода и `Протокол адаптера отладки <https://microsoft.github.io/debug-adapter-protocol/>`_ (**DAP**) для отладки. Вы можете проверить `Список клиентов LSP <https://microsoft.github.io/language-server-protocol/implementors/tools/>`_ и `Список клиентов DAP <https://microsoft.github.io/debug-adapter-protocol/implementors/tools/>`_, чтобы узнать, поддерживает ли ваш редактор эти протоколы. Если это так, вы сможете воспользоваться этими функциями без необходимости в создании пользовательского плагина.
ta: கோடோட் `மொழி சேவையக நெறிமுறை <https://microsoft.github.io/language-server-protocol/>` _ (** LSP **) குறியீடு நிறைவடையும் `பிழைத்திருத்த அடாப்டர் நெறிமுறை <https: // நுண்மென் ஆகியவற்றை ஆதரிக்கிறது. github.io/debug-adapter-protocol/>`_ (** dap **) பிழைத்திருத்தத்திற்கு. நீங்கள் `எல்எச்பி கிளையன்ட் பட்டியலை <https://microsoft.github.io/language-server-protocol/implementors/tools/>` _ மற்றும் `DAP கிளையன்ட் பட்டியல் <https://microsoft.github.io/debug- ஐ சரிபார்க்கலாம். உங்கள் ஆசிரியர் அவற்றை ஆதரிக்கிறாரா என்பதைக் கண்டறிய அடாப்டர்-நெறிமுறை/செயல்படுத்திகள்/கருவிகள்/> `_. இதுபோன்றால், தனிப்பயன் சொருகி தேவையில்லாமல் இந்த அம்சங்களை நீங்கள் பயன்படுத்திக் கொள்ள முடியும்.
tr: Godot kod tamamlama için `Dil Sunucusu Protokolünü <https://microsoft.github.io/language-server-protocol/>`_ (**LSP - Language Server Protocol**) ve hata ayıklama için `Hata Ayıklama Bağdaştırıcısı Protokolünü <https://microsoft.github.io/debug-adapter-protocol/>`_ (**DAP - Debug Adapter Protocol**) desteklemektedir. Düzenleyicinizin bunları destekleyip desteklemediğini öğrenmek için `LSP istemci listesini <https://microsoft.github.io/language-server-protocol/implementors/tools/>`_ ve `DAP istemci listesini <https://microsoft.github.io/debug-adapter-protocol/implementors/tools/>`_ kontrol edebilirsiniz. Eğer durum böyleyse, özel bir eklentiye ihtiyaç duymadan bu özelliklerden yararlanabilmeniz gerekir.
uk: Godot підтримує `Language Server Protocol <https://microsoft.github.io/language-server-protocol/>`_ (**LSP**) для доповнення коду та `Debug Adapter Protocol <https://microsoft.github.io/debug-adapter-protocol/>`_ (**DAP**) для налагодження. Ви можете перевірити `LSP client list <https://microsoft.github.io/language-server-protocol/implementors/tools/>`_ і `DAP client list <https://microsoft.github.io/debug-adapter-protocol/implementors/tools/>`_ щоб дізнатися, чи підтримує їх ваш редактор. Якщо це так, ви зможете скористатися перевагами цих функцій без спеціального плагіна.
zh_hant: Godot 支援用於程式碼補齊的 `語言伺服器協定 <https://microsoft.github.io/language-server-protocol/>`_ (**LSP**)，以及用於除錯的 `除錯轉接器協定 <https://microsoft.github.io/debug-adapter-protocol/>`_ (**DAP**)。您可以查看 `LSP 用戶端列表 <https://microsoft.github.io/language-server-protocol/implementors/tools/>`_ 和 `DAP 用戶端列表 <https://microsoft.github.io/debug-adapter-protocol/implementors/tools/>`_ 以了解您的編輯器是否支援它們。如果是這樣，您應該能夠無需自訂外掛程式即可利用這些功能。

source: To use these protocols, a Godot instance must be running on your current project. You should then configure your editor to communicate to the running adapter ports in Godot, which by default are ``6005`` for **LSP**, and ``6006`` for **DAP**. You can change these ports and other settings in the **Editor Settings**, under the **Network > Language Server** and **Network > Debug Adapter** sections respectively.
ga: Chun na prótacail seo a úsáid, ní mór sampla Godot a bheith ar siúl ar do thionscadal reatha. Ba cheart duit d'eagarthóir a chumrú ansin chun cumarsáid a dhéanamh leis na poirt oiriúnaitheora reatha in Godot, arb iad de réir réamhshocraithe ``6005`` le haghaidh **LSP**, agus `` 6006`` le haghaidh **DAP**. Is féidir leat na poirt seo agus socruithe eile a athrú sna **Socruithe Eagarthóra**, faoi na rannáin **Líonra > Freastalaí Teanga** agus **Líonra> Adaptóir Dífhabhtaithe** faoi seach.
it: Per utilizzare questi protocolli, è necessario che un'istanza di Godot sia in esecuzione sul progetto attuale. È quindi necessario configurare l'editor per comunicare con le porte dell'adattatore in esecuzione in Godot, che normalmente sono ``6005`` per **LSP** e ``6006`` per **DAP**. È possibile modificare queste porte e altre impostazioni nelle **Impostazioni dell'editor**, rispettivamente nelle sezioni **Rete > Server di linguaggio** e **Rete > Adattatore di debug**.
ja: これらのプロトコルを使用するには、現在のプロジェクトで Godot インスタンスが実行されている必要があります。次に Godot で実行中のアダプタポートと通信するようにエディタを構成する必要があります。デフォルトでは **LSP** の場合は ``6005`` 、 **DAP** の場合は ``6006`` です。これらのポートとその他の設定は、それぞれ **エディタ設定** の **ネットワーク > 言語サーバー** セクションと **ネットワーク > デバッグアダプタ** セクションで変更できます。
pt_br: Para usar esses protocolos, uma instância do Godot deve estar em execução no seu projeto atual. Você deve então configurar seu editor para se comunicar com as portas do adaptador em execução no Godot, que por padrão são ``6005`` para **LSP** e ``6006`` para **DAP**. Você pode alterar essas portas e outras configurações nas **Configurações do Editor**, nas seções **Rede > Servidor de Linguagem** e **Rede > Adaptador de Depuração**, respectivamente.
ru: Чтобы использовать эти протоколы, экземпляр Godot должен работать с вашим текущим проектом. Затем вам нужно настроить ваш редактор для связи с запущенными портами адаптера в Godot, которые по умолчанию составляют ``6005`` для **LSP** и ``6006`` для **DAP**. Вы можете изменить эти порты и другие настройки в **Настройках редактора**, в секциях **Сеть > Языковой сервер** и **Сеть > Адаптер отладки** соответственно.
ta: இந்த நெறிமுறைகளைப் பயன்படுத்த, உங்கள் தற்போதைய திட்டத்தில் ஒரு கோடோட் நிகழ்வு இயங்க வேண்டும். கோடோட்டில் இயங்கும் அடாப்டர் துறைமுகங்களுடன் தொடர்பு கொள்ள உங்கள் எடிட்டரை நீங்கள் கட்டமைக்க வேண்டும், அவை இயல்பாகவே ** lsp ** க்கு `` 6005``, மற்றும் `` 6006`` ** DAP ** க்கு. ** நெட்வொர்க்> மொழி சேவையகம் ** மற்றும் ** நெட்வொர்க்> பிழைத்திருத்த அடாப்டர் ** பிரிவுகளின் கீழ் ** எடிட்டர் அமைப்புகள் ** இல் இந்த துறைமுகங்கள் மற்றும் பிற அமைப்புகளை நீங்கள் மாற்றலாம்.
tr: Bu protokolleri kullanmak için mevcut projenizde bir Godot örneklemesinin çalışıyor olması gerekir. Daha sonra düzenleyicinizi Godot'da varsayılan olarak **LSP** için ``6005`` ve **DAP** için ``6006`` olarak çalışan bağdaştırıcı bağlantı noktalarıyla iletişim kuracak şekilde yapılandırmalısınız. Bu bağlantı noktalarını ve diğer ayarları **Düzenleyici Ayarları** içinde, sırasıyla **Ağ > Dil Sunucusu** ve **Ağ > Hata Ayıklama Bağdaştırıcısı** bölümleri altında değiştirebilirsiniz.
uk: Щоб використовувати ці протоколи, у вашому поточному проекті має бути запущено екземпляр Godot. Потім вам слід налаштувати ваш редактор на зв’язок із запущеними портами адаптера в Godot, які за замовчуванням мають значення ``6005`` для **LSP** і ``6006`` для **DAP**. Ви можете змінити ці порти та інші параметри в **Налаштуваннях редактора**, у розділах **Мережа > Мовний сервер** і **Мережа > Адаптер налагодження** відповідно.
zh_hant: 若要使用這些協定，必須有一個 Godot 實例正在您的目前專案上執行。您接著應該設定您的編輯器，以與 Godot 中正在執行的轉接器連接埠通訊，預設 **LSP** 為 ``6005``，**DAP** 為 ``6006``。您可以在 **編輯器設定** 中，分別位於 **網路 > 語言伺服器** 和 **網路 > 除錯轉接器** 區段下，變更這些連接埠及其他設定。

source: Below are some configuration steps for specific editors:
fr: Voilà ci-dessous quelques étapes de configuration pour des éditeurs spécifiques :
ga: Seo thíos roinnt céimeanna cumraíochta d'eagarthóirí ar leith:
it: Di seguito sono riportati alcuni passaggi di configurazione per editor specifici:
ja: 以下に特定のエディタの構成手順を示します。
pt_br: Abaixo estão algumas etapas de configuração para editores específicos:
ru: Ниже приведены шаги по настройке конкретных редакторов:
ta: குறிப்பிட்ட ஆசிரியர்களுக்கான சில உள்ளமைவு படிகள் கீழே:
tr: Aşağıda belirli düzenleyiciler için bazı yapılandırma adımları verilmiştir:
uk: Нижче наведено кілька кроків налаштування для конкретних редакторів:
zh_hant: 以下是一些針對特定編輯器的設定步驟：

source: You need to install the official `Visual Studio Code plugin <https://github.com/godotengine/godot-vscode-plugin>`_.
fr: Vous avez besoin d'installer `Visual Studio Code plugin <https://github.com/godotengine/godot-vscode-plugin>`_.
ga: Ní mór duit an breiseán oifigiúil `Visual Studio Code <https://github.com/godotengine/godot-vscode-plugin>`_.
it: È necessario installare l'`estensione ufficiale per Visual Studio Code <https://github.com/godotengine/godot-vscode-plugin>`_.
ja: 公式の `Visual Studio Code プラグイン <https://github.com/godotengine/godot-vscode-plugin>`_ をインストールする必要があります。
ru: Вам необходимо установить официальный `плагин Visual Studio Code <https://github.com/godotengine/godot-vscode-plugin>`_.
ta: நீங்கள் அதிகாரப்பூர்வ `விசுவல் ச்டுடியோ குறியீடு சொருகி <https://github.com/godotengine/godot-vscode-plugin> _ _ ஐ நிறுவ வேண்டும்.
tr: Resmi `Visual Studio Code eklentisini <https://github.com/godotengine/godot-vscode-plugin>`_ yüklemeniz gerekir.
uk: Вам потрібно встановити офіційний плагін `Visual Studio Code плагін <https://github.com/godotengine/godot-vscode-plugin>`_.
zh_hant: 您需要安裝官方的 `Visual Studio Code 外掛程式 <https://github.com/godotengine/godot-vscode-plugin>`_。

source: For **LSP**, follow `these instructions <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port>`_ to change the default LSP port. The connection status can be checked on the status bar:
fr: Pour **LSP**, suivez `ces instructions <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port>`_ pour modifier le port LSP par défaut. L'état de la connexion peut être vérifié sur la barre d'état :
ga: Le haghaidh **LSP**, lean `na treoracha seo <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port>`_ chun an calafort LSP réamhshocraithe a athrú. Is féidir stádas an cheangail a sheiceáil ar an mbarra stádais:
it: Per **LSP**, seguire `queste istruzioni <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port>`_ per modificare la porta LSP predefinita. Lo stato della connessione si può controllare sulla barra di stato:
ja: **LSP** の場合、デフォルトの LSP ポートを変更するには、`これらの手順 <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port>`_ に従ってください。接続ステータスはステータスバーで確認できます。
pt_br: Para **LSP**, siga `estas instruções <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port>`_ para alterar a porta padrão do LSP. O status da conexão pode ser verificado na barra de status:
ru: Для **LSP** следуйте `этим инструкциям <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port>` _ чтобы изменить порт LSP по умолчанию. Состояние соединения можно проверить в строке состояния:
ta: ** lsp ** க்கு, இந்த வழிமுறைகளைப் பின்பற்றவும் <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port> `_ _ _. இணைப்பு நிலையை நிலை பட்டியில் சரிபார்க்கலாம்:
tr: **LSP** için, varsayılan LSP bağlantı noktasını değiştirmek için `bu talimatları <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port>`_ izleyin. Bağlantı durumu durum çubuğundan kontrol edilebilir:
uk: Для **LSP** виконайте `ці інструкції <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port>`_, щоб змінити порт LSP за умовчанням. Статус підключення можна перевірити в рядку стану:
zh_hant: 對於 **LSP**，請依照 `這些指示 <https://github.com/godotengine/godot-vscode-plugin#gdscript_lsp_server_port>`_ 以變更預設的 LSP 連接埠。連線狀態可以在狀態列上查看：

source: For **DAP**, specify the ``debugServer`` property in your ``launch.json`` file:
fr: Pour **DAP**, spécifiez la propriété ``debugServer`` dans votre fichier ``launch.json`` :
ga: I gcás **DAP**, sonraigh an mhaoin ''debugServer'' i do chomhad ''launch.json'':
it: Per **DAP**, specificare la proprietà ``debugServer`` nel file ``launch.json``:
ja: **DAP** の場合は ``launch.json`` ファイルで ``debugServer`` プロパティを指定します。
pt_br: Para **DAP**, especifique a propriedade ``debugServer`` no seu arquivo ``launch.json``:
ru: Для **DAP**, укажите свойство ``debugServer`` в вашем файле ``launch.json``:
ta: ** DAP ** க்கு, உங்கள் `` துவக்க. JSON`` கோப்பில் `` பிழைத்திருத்தவாதி` சொத்தை குறிப்பிடவும்:
tr: **DAP** için, ``launch.json`` dosyanızda ``debugServer`` özelliğini belirtin:
uk: Для **DAP** вкажіть властивість ``debugServer`` у вашому файлі ``launch.json``:
zh_hant: 對於 **DAP**，請在您的 ``launch.json`` 檔案中指定 ``debugServer`` 屬性：

source: Check the official instructions to configure `LSP <https://github.com/godotengine/emacs-gdscript-mode#auto-completion-with-the-language-server-protocol-lsp>`_, and `DAP <https://github.com/godotengine/emacs-gdscript-mode#using-the-debugger>`_.
fr: Vérifiez les instructions officielles pour configurer `LSP <https://github.com/godotengine/emacs-gdscript-mode#auto-completion-with-the-language-server-protocol-lsp>`_, et `DAP <https://github.com/godotengine/emacs-gdscript-mode#using-the-debugger>`_.
ga: Seiceáil na treoracha oifigiúla chun `LSP <https://github.com/godotenginine/emacs-gdscript-mode#auto-completion-with-the-language-server-protocol-lsp>`_, agus `DAP <https: //github.com/godotengine/emacs-gdscript-mode#using-the-debugger> `_.
it: Consultare le istruzioni ufficiali per configurare `LSP <https://github.com/godotengine/emacs-gdscript-mode#auto-completion-with-the-language-server-protocol-lsp>`_ e `DAP <https://github.com/godotengine/emacs-gdscript-mode#using-the-debugger>`_.
ja: `LSP <https://github.com/godotengine/emacs-gdscript-mode#auto-completion-with-the-language-server-protocol-lsp>`_ と `DAP <https://github.com/godotengine/emacs-gdscript-mode#using-the-debugger>`_ を設定するには、公式の手順を確認してください。
pt_br: Consulte as instruções oficiais para configurar o `LSP <https://github.com/godotengine/emacs-gdscript-mode#auto-completion-with-the-language-server-protocol-lsp>`_ e o `DAP <https://github.com/godotengine/emacs-gdscript-mode#using-the-debugger>`_.
ru: Ознакомьтесь с официальными инструкциями по настройке `LSP <https://github.com/godotengine/emacs-gdscript-mode#auto-completion-with-the-language-server-protocol-lsp>`_, и `DAP <https://github.com/godotengine/emacs-gdscript-mode#using-the-debugger>`_.
ta: `Lsp <https://github.com/godotengine/emacs-gdscript-mode#auto-completion- உடன்-தி-லாங்கேச்-சர்வர்-புரோட்டோகால்-எல்எச்பி>` _, மற்றும் `dap <https: .
tr: Yapılandırmak için resmi `LSP <https://github.com/godotengine/emacs-gdscript-mode#auto-completion-with-the-language-server-protocol-lsp>`_ ve `DAP <https://github.com/godotengine/emacs-gdscript-mode#using-the-debugger>`_ talimatlarını kontrol edin.
uk: Перегляньте офіційні інструкції щодо налаштування `LSP <https://github.com/godotengine/emacs-gdscript-mode#auto-completion-with-the-language-server-protocol-lsp>`_ і `DAP <https://github.com/godotengine/emacs-gdscript-mode#using-the-debugger>`_.
zh_hant: 請查看官方指示以設定 `LSP <https://github.com/godotengine/emacs-gdscript-mode#auto-completion-with-the-language-server-protocol-lsp>`_，以及 `DAP <https://github.com/godotengine/emacs-gdscript-mode#using-the-debugger>`_。

source: ``{project} {file}:{line}:{column}``
uk: ``{проект} {файл}:{рядок}:{стовпець}``

source: `Emacs <https://github.com/godotengine/emacs-gdscript-mode>`_
ga: `Emacs <https://github.com/godotengin/emacs-gdscript-mode>`_
ru: `Ема́кс <https://github.com/godotengine/emacs-gdscript-mode>`_
uk: `Ємакс <https://github.com/godotengine/emacs-gdscript-mode>`_
zh_hant: `GitHub <https://github.com/godotengine/>`_

source: ``{project}``
ga: ''{tionscadal}''
pt_br: ``{projeto}``

source: ``{file}``
ga: ''{comhad}''
pt_br: ``{arquivo}``

source: ``{line}``
ga: ''{líne}''
pt_br: ``{linha}``

source: ``emacs +{line}:{col} {file}``
ru: ``emacs +{строка}:{кол} {файл}``
zh_hant: ``"+call cursor({line}, {col})" {file}``

source: \*: Arguments are not automatically detected, so you must fill them in manually.
zh_hant: \*：無法自動偵測參數，需手動填寫。

source: Since Godot 4.5, **Exec Flags** are automatically detected for all editors listed above (unless denoted with an asterisk). You don't need to paste them from this page for it to work, unless your editor has an executable name not recognized automatically (e.g. a fork of an editor listed here).
zh_hant: 自 Godot 4.5 起，以上列出的編輯器（除標註星號者外）會自動偵測 **Exec Flags**。通常不需從本頁貼上參數即可運作，除非你的編輯器可執行檔名稱無法自動辨識（例如上述編輯器的分支版本）。

source: ``{col}``
pt_br: ``{coluna}``

source: ``{file}:{line}``
pt_br: ``{arquivo}:{linha}``

source: ``{project} --goto {file}:{line}:{col}``
pt_br: ``{projeto} --goto {arquivo}:{linha}:{coluna}``
