Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/external_editor.po
Languages: fr, ga, it, ja, pt_br, ru, ta, tr, uk, zh_hant

source: Using an external text editor
fr: Utiliser un éditeur de texte externe
ga: Eagarthóir téacs seachtrach a úsáid
it: Utilizzare un editor di testo esterno
ja: 外部テキストエディタの使用
pt_br: Usando um editor de texto externo
ru: Использование стороннего текстового редактора
ta: வெளிப்புற உரை திருத்தியைப் பயன்படுத்துதல்
tr: Harici bir metin düzenleyici kullanma
uk: Використання зовнішнього текстового редактора
zh_hant: 使用外部文字編輯器

source: This page explains how to code using an external text editor.
fr: Cette page explique comment coder à l'aide d'un éditeur de texte externe.
ga: Mínítear ar an leathanach seo conas códú a dhéanamh le heagarthóir téacs seachtrach.
it: Questa pagina spiega come programmare utilizzando un editor di testo esterno.
ja: このページでは、外部のテキストエディタを使用してコーディングする方法について説明します。
pt_br: Esta página explica como codificar usando um editor de texto externo.
ru: На этой странице объясняется, как писать код с помощью внешнего текстового редактора.
ta: வெளிப்புற உரை திருத்தியைப் பயன்படுத்தி குறியீடு செய்வது எப்படி என்பதை இந்த பக்கம் விளக்குகிறது.
tr: Bu sayfa harici bir metin düzenleyici kullanarak nasıl kod yazılacağını açıklamaktadır.
uk: Ця сторінка пояснює, як писати код з допомогою зовнішнього текстового редактора.
zh_hant: 本頁說明如何使用外部文字編輯器進行程式開發。

source: To code C# in an external editor, see :ref:`the C# guide to configure an external editor <doc_c_sharp_setup_external_editor>`.
fr: Pour coder en C# dans un éditeur externe, voir :ref:`le guide de C# pour configurer un éditeur externe <doc_c_sharp_setup_external_editor>`.
ga: Chun C# a chódú in eagarthóir seachtrach, féach :tag:`an treoir C# chun eagarthóir seachtrach a chumrú <doc_c_sharp_setup_editor_external>`.
it: Per programmare in C# in un editor esterno, consultare :ref:`la guida di C# per configurare un editor esterno <doc_c_sharp_setup_external_editor>`.
ja: 外部エディタで C# をコーディングするには、 :ref:`外部エディタを構成するための C# ガイド <doc_c_sharp_setup_external_editor>` を参照してください。
pt_br: Para codificar em C# usando um editor externo, consulte :ref:`o guia C# para configurar um editor externo <doc_c_sharp_setup_external_editor>`.
ru: Чтобы программировать на C# в внешнем редакторе, смотрите :ref:`руководство по C#, как настроить внешний редактор <doc_c_sharp_setup_external_editor>`.
ta: வெளிப்புற எடிட்டரில் சி# குறியீட்டிற்கு, பார்க்க: குறிப்பு: `சி# வழிகாட்டி ஒரு வெளிப்புற எடிட்டரை உள்ளமைக்க <doc_c_sharp_setup_external_editor>`.
tr: C# ile kodlamayı harici bir düzenleyicide yapmak için, :ref:`harici bir düzenleyici yapılandırmak için C# kılavuzu <doc_c_sharp_setup_external_editor>`na bakın.
uk: Щоб закодувати C# у зовнішньому редакторі, перегляньте :ref:`the C# guide to configure an external editor <doc_c_sharp_setup_external_editor>`.
zh_hant: 若要使用外部編輯器編寫 C# 程式碼，請參閱 :ref:`設定外部編輯器的 C# 指南 <doc_c_sharp_setup_external_editor>`。

source: Godot can be used with an external text editor, such as Sublime Text or Visual Studio Code. Browse to the relevant editor settings: **Editor > Editor Settings > Text Editor > External**
fr: Godot peut être utilisé avec un éditeur de texte externe, comme Sublime Text ou Visual Studio Code. Naviguez jusqu'aux paramètres de l'éditeur concerné : **Éditeur > Paramètres de l'éditeur > Éditeur de texte > Externe**
ga: Is féidir Godot a úsáid le heagarthóir téacs seachtrach, ar nós Téacs Sublime nó Cód Stiúideo Amharc. Brabhsáil chuig na socruithe eagarthóra ábhartha: **Eagarthóir > Socruithe Eagarthóra > Eagarthóir Téacs > Seachtrach**
it: Godot può essere utilizzato con un editor di testo esterno, come Sublime Text o Visual Studio Code. Accedere alle impostazioni dell'editor: **Editor > Impostazioni dell'editor > Editor di testo > Esterno**
ja: Godot は Sublime Text や Visual Studio Code などの外部テキストエディタを使用できます。外部テキストエディタを有効にするには、次のページこちらのエディタ設定を参照して下さい: ``エディタ -> エディタ設定 -> テキストエディタ -> 外部``
ru: Godot можно использовать с внешним текстовым редактором, например Sublime Text или Visual Studio Code. Перейдите к соответствующим настройкам редактора: ``Редактор (Editor) -> Настройки редактора (Editor Settings) -> Текстовый редактор (Text Editor) -> Внешний (External)``
ta: குண்டோட் ஒரு வெளிப்புற உரை எடிட்டருடன், கம்பீரமான உரை அல்லது விசுவல் ச்டுடியோ குறியீடு போன்றவற்றைப் பயன்படுத்தலாம். தொடர்புடைய எடிட்டர் அமைப்புகளுக்கு உலாவுக: ** ஆசிரியர்> ஆசிரியர் அமைப்புகள்> உரை எடிட்டர்> வெளிப்புறம் **
tr: Godot, Sublime Text veya Visual Studio Code gibi harici bir metin düzenleyici ile kullanılabilir. İlgili düzenleyici ayarlarına göz atın: **Düzenleyici > Düzenleyici Ayarları > Metin Düzenleyici > Harici**
uk: Godot можна використовувати із зовнішнім текстовим редактором, таким як Sublime Text або Visual Studio Code. Перейдіть до відповідних налаштувань редактора: **Редактор > Параметри редактора > Текстовий редактор > Зовнішній**
zh_hant: Godot 可與外部編輯器一起使用，如 Sublime Text 或 Visual Studio Code。欲啟用外部文字編輯器，請於 ``編輯器 -> 編輯器設定 --> Text Editor（文字編輯器） -> External（外部）`` 瀏覽對應的編輯器設定

source: Text Editor > External section of the Editor Settings
fr: Éditeur de texte > Section externe des paramètres de l'éditeur
ga: Eagarthóir Téacs > Cuid sheachtrach de na Socruithe Eagarthóra
it: Sezione Editor di testo > Esterno delle Impostazioni dell'editor
ja: エディタ設定の テキストエディタ > 外部 セクション
pt_br: Editor de texto > Seção externa das configurações do editor
ru: ``Текстовый редактор (Text Editor) > Внешний (External)`` раздел редактора настроек
ta: உரை எடிட்டர்> எடிட்டர் அமைப்புகளின் வெளிப்புற பிரிவு
tr: Metin Düzenleyici > Düzenleyici Ayarlarının Harici bölümü
uk: Текстовий редактор > Зовнішній розділ налаштувань редактора
zh_hant: 文字編輯器 > 編輯器設定的外部部分

source: **Text Editor > External** section of the Editor Settings
fr: Section **Éditeur de texte > Externe ** des paramètres de l'éditeur
ga: Rannán **Eagarthóir Téacs > Seachtrach** de na Socruithe Eagarthóra
it: Sezione **Editor di testo > Esterno** delle Impostazioni dell'editor
ja: エディタ設定の **テキストエディタ > 外部** セクション
pt_br: Seção **Editor de texto > Externo** das Configurações do Editor
ru: Раздел **Text Editor > External** в настройках редактора
ta: ** உரை எடிட்டர்> வெளிப்புற ** ஆசிரியர் அமைப்புகளின் பிரிவு
tr: Düzenleyici Ayarları'nın **Metin Düzenleyici > Harici** bölümü
uk: Розділ **Текстовий редактор > Зовнішній** у налаштуваннях редактора
zh_hant: 編輯器設定中的 **文字編輯器 > 外部** 部分

source: There are two text fields: the executable path and command-line flags. The flags allow you to integrate the editor with Godot, passing it the file path to open and other relevant arguments. Godot will replace the following placeholders in the flags string:
fr: Il y a deux champs : le chemin de l'exécutable et les drapeaux de ligne de commande. Les drapeaux vous permettent d'intégrer l'éditeur avec Godot, en lui passant le chemin du fichier à ouvrir et d'autres arguments pertinents. Godot remplacera les champs temporaires suivants dans la chaîne des drapeaux :
ga: Tá dhá réimse téacs ann: an cosán inrite agus bratacha líne na n-orduithe. Ligeann na bratacha duit an t-eagarthóir a chomhtháthú le Godot, agus é ag dul thar chonair an chomhaid chun argóintí ábhartha eile a oscailt. Tiocfaidh Godot in áit na sealbhóirí áite seo a leanas sa teaghrán bratacha:
it: Ci sono due campi di testo: il percorso dell'eseguibile e i flag della riga di comando. I flag consentono di integrare l'editor con Godot, passandogli il percorso del file da aprire e altri argomenti al riguardo. Godot sostituirà i seguenti segnaposto nella stringa dei flag:
ja: ここには文字列を指定する場所が 2 つあります。実行パスと実行フラグです。このフラグを使用すると、エディタを Godot と統合したとき、開くファイルパスやその他の関連引数を渡すことができます。Godot はフラグ文字列内の次のプレースホルダーを置き換えます。
ru: Есть два текстовых поля: путь к исполняемому файлу и флаги командной строки. Флаги позволяют интегрировать редактор с Godot, передавая ему путь к файлу для открытия и другие соответствующие аргументы. Godot заменит следующие заполнители в строке флагов:
ta: இரண்டு உரை புலங்கள் உள்ளன: இயங்கக்கூடிய பாதை மற்றும் கட்டளை-வரி கொடிகள். கோடோட்டுடன் எடிட்டரை ஒருங்கிணைக்க கொடிகள் உங்களை அனுமதிக்கின்றன, திறந்த மற்றும் பிற தொடர்புடைய வாதங்களுக்கான கோப்பு பாதையை அனுப்புகின்றன. கோடோட் கொடிகள் சரத்தில் பின்வரும் ஒதுக்கீட்டாளர்களை மாற்றும்:
tr: İki metin giriş alanı vardır: çalıştırılabilir dosya yolu ve komut satırı bayrakları. Bayraklar, açılacak dosya yolunu ve diğer ilgili argümanları ona aktararak düzenleyiciyi Godot ile entegre etmenize olanak tanır. Godot, bayraklar dizesindeki aşağıdaki yer tutucuları değiştirecektir:
uk: Є два текстових поля: шлях до виконуваного файлу та прапорці командного рядка. Прапорці дозволяють вам інтегрувати редактор із Godot, передаючи йому шлях до файлу для відкриття та інші відповідні аргументи. Godot замінить такі заповнювачі в рядку прапорів:
zh_hant: 該設定有兩個欄位：執行路徑與命令列旗標。旗標可允許將該編輯器與 Godot 整合、傳入欲開啟的檔案、以及其他相關的參數。Godot 會取代旗標中的下列佔位字元：

source: Field in Exec Flags
fr: Champ dans les drapeaux d'exécution
ga: Réimse i Bratacha Exec
it: Campo nei flag di esecuzione
ja: 実行フラグのプレースホルダー
pt_br: Campo em Exec Flags
ru: Поле в Исполняемых Флагах
ta: EXEC கொடிகளில் புலம்
tr: Uygulama Bayraklarındaki Alan
uk: Поле Exec Flags
zh_hant: Exec Flags 中的欄位

source: Is replaced with
fr: Est remplacé par
ga: Cuirtear in ionad
it: È sostituito con
ja: 置き換えるもの
pt_br: É substituído por
ru: Заменяется на
ta: மாற்றப்படுகிறது
tr: şununla değiştirilir
uk: Замінюється на
zh_hant: 會取代為

source: The absolute path to the project directory
fr: Le chemin absolu vers le répertoire du projet
ga: Conair iomlán na comhadlainne tionscadail
it: Il percorso assoluto alla cartella del progetto
ja: プロジェクトディレクトリへの絶対パス
pt_br: O caminho absoluto para o diretório do projeto
ru: Абсолютный путь к каталогу проекта
ta: திட்ட கோப்பகத்திற்கான முழுமையான பாதை
tr: Proje dizininin mutlak yolu
uk: Абсолютний шлях до каталогу проєкту
zh_hant: 專案目錄的絕對路徑

source: The absolute path to the file
fr: Le chemin absolu vers le fichier
ga: Conair iomlán an chomhaid
it: Il percorso assoluto al file
ja: ファイルへの絶対パス
pt_br: O caminho absoluto para o arquivo
ru: Абсолютный путь к файлу
ta: கோப்பிற்கான முழுமையான பாதை
tr: Dosyanın mutlak yolu
uk: Абсолютний шлях до файла
zh_hant: 檔案的絕對路徑

source: The column number of the error
fr: Le numéro de colonne de l'erreur
ga: Uimhir cholúin na hearráide
it: Il numero di colonna dell'errore
ja: エラーの列番号
pt_br: O número da coluna do erro
ru: Номер столбца ошибки
ta: பிழையின் நெடுவரிசை எண்
tr: Hatanın sütun numarası
uk: Номер позиції помилки у рядку
zh_hant: 錯誤的列號

source: The line number of the error
fr: Le numéro de ligne de l’erreur
ga: Uimhir líne na hearráide
it: Il numero di riga dell'errore
ja: エラーの行番号
pt_br: O número da linha do erro
ru: Номер строки ошибки
ta: பிழையின் வரி எண்
tr: Hatanın satır numarası
uk: Номер рядка помилки
zh_hant: 錯誤的行號

source: Some example **Exec Flags** for various editors include:
fr: Quelques exemples de **Paramètres d'exécution** pour différents éditeurs de texte :
ga: I measc roinnt sampla **Exec Flags ** d'eagarthóirí éagsúla tá:
it: Alcuni esempi di **Flag di esecuzione** per vari editor includono:
ja: さまざまなエディタの実行フラグの例を次に示します:
ru: Вот несколько примеров **Exec Flags** для различных редакторов:
ta: சில எடுத்துக்காட்டு ** பல்வேறு ஆசிரியர்களுக்கு EXEC கொடிகள் ** பின்வருமாறு:
tr: Çeşitli düzenleyiciler için bazı örnek **Uygulama Bayrakları** şunlardır:
uk: Деякі приклади **Exec Flags** для різних редакторів включають:
zh_hant: 下列為各種編輯器的一些 Exec Flags 範例：

source: Editor
fr: Éditeur
ga: Eagarthóir
ja: エディタ
ru: Редактор
ta: திருத்தி
tr: Düzenleyici
uk: Редактор
zh_hant: 編輯器

source: Exec Flags
fr: Paramètres d'exécution
ga: Bratacha Exec
it: Flag di esecuzione
ja: 実行フラグ
pt_br: Sinalizadores de Execução
ru: Флаги исполнения
ta: EXEC கொடிகள்
tr: Uygulama Bayrakları
uk: Виконувані прапорці
zh_hant: 執行旗標

source: Geany/Kate
ru: Gеany/Kate
ta: குட்பை / கேட்
uk: Джіні/Кейт

source: ``{file} --line {line} --column {col}``
pt_br: ``{arquivo} --linha {linha} --coluna {coluna}``
ta: `` {file} -லைன் {line} - -நிறைவு {col} ``

source: Atom
ga: Adamh
ru: Атом
ta: அணு
uk: атом

source: JetBrains Rider
ga: Marcach JetBrains
ta: செட் பிரைன்ச் ரைடர்
uk: JetBrains Райдер

source: ``{project} --line {line} {file}``
fr: ``{projet} --line {ligne} {fichier}``
ta: `{project} -லைன் {line} {file}` `
uk: ``{проект} --line {рядок} {файл}``
zh_hant: ``--line {line} {file}``

source: Visual Studio Code
ga: Cód Stiúideo Amhairc
ru: Visuаl Studio Code
ta: விசுவல் ச்டுடியோ குறியீடு
uk: Visual Studio або VS Code

source: Vim (gVim)
ga: Power (GViM)
ta: ஏனெனில் (சி.வி.ஐ.எம்)

source: ``"+call cursor({line}, {col})" {file}``
pt_br: ``"+call cursor({linha}, {coluna})" {arquivo}``
ta: `` "+அழைப்பு கர்சர் ({line}, {col})" {file} ``

source: Emacs
ga: EmacsName
ru: Emаcs
ta: எமாக்கள்

source: Sublime Text
ga: Téacs Sublime
ru: Возвышенный текст
ta: விழுமிய உரை
uk: Піднесений текст

source: ``/edit "file"``
ta: ``/"கோப்பைத் திருத்து" ``

source: For Visual Studio Code on Windows, you will have to point to the ``code.cmd`` file.
fr: Pour Visual Studio Code sur Windows, vous devrez pointer vers le fichier ``code.cmd``.
ga: Maidir le Cód Stiúideo Amhairc ar Windows, beidh ort an comhad ''code.cmd'' a chur in iúl.
it: Per Visual Studio Code su Windows, sarà necessario puntare al file ``code.cmd``.
ja: Windows の Visual Studio Code の場合は ``code.cmd`` ファイルを指定する必要があります。
pt_br: Para o Visual Studio Code no Windows, você terá que apontar para o arquivo ``code.cmd``.
ru: Для Visual Studio Code на Windows вам нужно указать файл ``code.cmd``.
ta: சாளரங்களில் விசுவல் ச்டுடியோ குறியீட்டிற்கு, நீங்கள் `` code.cmd`` கோப்பை சுட்டிக்காட்ட வேண்டும்.
tr: Windows üzerinde Visual Studio Code için ``code.cmd`` dosyasına işaret etmeniz gerekecektir.
uk: Для Visual Studio Code у Windows вам доведеться вказати на файл ``code.cmd``.
zh_hant: 對於 Windows 平臺上的 Visual Studio Code，你需要指向 ``code.cmd`` 檔案。

source: For Emacs, you can call ``emacsclient`` instead of ``emacs`` if you use the server mode.
fr: Pour Emacs, vous pouvez appeler ``emacsclient`` au lieu de ``emacs`` si vous utilisez le mode serveur.
ga: I gcás Emacs, is féidir leat ''emacsclient'' a ghlaoch in ionad ''emacs'' má úsáideann tú an modh freastalaí.
it: Per Emacs, è possibile chiamare ``emacsclient`` invece di ``emacs`` se si usa la modalità server.
ja: Emacs のサーバーモードを使用する場合は、 ``emacs`` の代わりに ``emacsclient`` を呼び出すことができます。
ru: Для Emacs вы можете вызвать ``emacsclient`` вместо ``emacs``, если вы используете режим сервера.
ta: EMAC களைப் பொறுத்தவரை, நீங்கள் சேவையக பயன்முறையைப் பயன்படுத்தினால் `` EMACS`` க்கு பதிலாக `` எமாக்ச்க்ளியண்ட்`` ஐ அழைக்கலாம்.
tr: Emacs için, sunucu modunu kullanıyorsanız ``emacs`` yerine ``emacsclient`` çağırabilirsiniz.
uk: Для Emacs ви можете викликати ``emacsclient`` замість ``emacs``, якщо ви використовуєте режим сервера.
zh_hant: Visual Studio 必須指向 ``code.cmd`` 檔案。

source: For Visual Studio, you will have to open the solution file ``.sln`` manually to get access to the IDE features. Additionally, it will not go to a specific line.
it: Per Visual Studio, sarà necessario aprire manualmente il file di soluzione ``.sln`` per accedere alle funzionalità dell'IDE. Inoltre, non andrà su una riga specifica.
pt_br: No Visual Studio, você terá que abrir o arquivo de solução ``.sln`` manualmente para acessar os recursos do IDE. Além disso, ele não levará a uma linha específica.
ru: Для Visual Studio вам придется вручную открыть файл решения ``.sln``, чтобы получить доступ к функциям IDE. Кроме того, он не будет переходить к определенной строке.
ta: விசுவல் ச்டுடியோவைப் பொறுத்தவரை, ஐடிஇ அம்சங்களை அணுகுவதற்கு நீங்கள் தீர்வு கோப்பை `` .Sln`` கைமுறையாக திறக்க வேண்டும். கூடுதலாக, இது ஒரு குறிப்பிட்ட வரிக்கு செல்லாது.
uk: Для Visual Studio вам доведеться відкрити файл рішення ``.sln`` вручну, щоб отримати доступ до функцій IDE. Крім того, він не перейде до певного рядка.
zh_hant: 對於 Visual Studio，您必須手動開啟解決方案檔案 ``.sln`` 以存取 IDE 功能。此外，它將不會跳到特定行。

source: Automatically reloading your changes
it: Caricare automaticamente i propri cambiamenti
ru: Автоматическая перезагрузка ваших изменений
ta: உங்கள் மாற்றங்களை தானாக மீண்டும் ஏற்றுகிறது
uk: Автоматичне перезавантаження ваших змін
zh_hant: 自動重新載入您的變更

source: To have the Godot Editor automatically reload any script that has been changed by an external text editor, enable **Editor > Editor Settings > Text Editor > Behavior > Auto Reload Scripts on External Change**.
it: Per fare in modo che Godot Editor ricarichi automaticamente qualsiasi script modificato da un editor di testo esterno, abilitare **Editor > Impostazioni dell'editor > Editor di testo > Comportamento > Auto-ricarica gli script in caso di modifiche esterne**.
pt_br: Para que o Editor Godot recarregue automaticamente qualquer script que tenha sido alterado por um editor de texto externo, ative **Editor > Configurações do Editor > Editor de Texto > Comportamento > Recarregar Scripts Quando Houver Alterações Externas**.
ru: Чтобы редактор Godot автоматически перезагружал любой скрипт, измененный внешним текстовым редактором, включите **Редактор > Настройки редактора > Текстовый редактор > Поведение > Автоматическая перезагрузка скриптов при внешнем изменении**.
ta: வெளிப்புற உரை எடிட்டரால் மாற்றப்பட்ட எந்த ச்கிரிப்டையும் கோடோட் எடிட்டரை தானாகவே மீண்டும் ஏற்ற, ** எடிட்டர்> எடிட்டர் அமைப்புகள்> உரை எடிட்டர்> நடத்தை> வெளிப்புற மாற்றத்தில் ஆட்டோ ரீலோட் ச்கிரிப்ட்களை இயக்கவும் **.
uk: Щоб редактор Godot автоматично перезавантажував будь-який сценарій, який було змінено зовнішнім текстовим редактором, увімкніть **Редактор > Параметри редактора > Текстовий редактор > Поведінка > Автоматичне перезавантаження сценаріїв під час зовнішньої зміни**.
zh_hant: 若要讓 Godot 編輯器自動重新載入任何由外部文字編輯器變更過的腳本，請啟用 **編輯器 > 編輯器設定 > 文字編輯器 > 行為 > 外部變更時自動重新載入腳本**。

source: Using External Editor in Debugger
fr: Utiliser un éditeur de texte externe dans le débugueur
ga: Eagarthóir Seachtrach á Úsáid sa Dífhabhtóir
it: Utilizzare un editor di testo esterno nel debugger
ja: デバッガで外部エディタを使用する
ru: Использование Внешнего редактора в Отладчике
ta: பிழைத்திருத்தியில் வெளிப்புற எடிட்டரைப் பயன்படுத்துதல்
tr: Hata Ayıklayıcıda Harici Düzenleyici Kullanma
uk: Використання зовнішнього редактора в Debugger
zh_hant: 使用外部文字編輯器

source: Using external editor in debugger is determined by a separate option in settings. For details, see :ref:`Script editor debug tools and options <doc_debugger_tools_and_options>`.
fr: L'utilisation d'un éditeur externe dans le débogueur est déterminée par une option séparée dans les paramètres. Pour plus de détails, voir :ref:`Options et outils de débogage de l'éditeur de script <doc_debugger_tools_and_options>`.
ga: Cinntear úsáid a bhaint as eagarthóir seachtrach i ndífhabhtóir trí rogha ar leith i socruithe. Le haghaidh sonraí, féach :ref:`Uirlisí dífhabhtaithe agus roghanna eagarthóir scripte <doc_debugger_tools_and_options>`.
it: L'utilizzo di un editor esterno nel debugger è determinato da un'opzione separata nelle impostazioni. Per più dettagli, consultare :ref:`Strumenti e opzioni di debug dell'editor di script <doc_debugger_tools_and_options>`.
ja: デバッガで外部エディタを使用するかどうかは、設定の別のオプションによって決まります。詳細については :ref:`スクリプトエディタのデバッグツールとオプション <doc_debugger_tools_and_options>` を参照してください。
pt_br: O uso de um editor externo no depurador é determinado por uma opção separada nas configurações. Para obter detalhes, consulte :ref:`Ferramentas e opções de depuração do editor de scripts <doc_debugger_tools_and_options>`.
ru: Использование внешнего редактора в отладчике определяется отдельным параметром в настройках. Для получения подробной информации смотрите :ref:`Инструменты и параметры отладчика скриптов <doc_debugger_tools_and_options>`.
ta: பிழைத்திருத்தத்தில் வெளிப்புற எடிட்டரைப் பயன்படுத்துவது அமைப்புகளில் ஒரு தனி விருப்பத்தால் தீர்மானிக்கப்படுகிறது. விவரங்களுக்கு, காண்க: குறிப்பு: `ச்கிரிப்ட் எடிட்டர் பிழைத்திருத்த கருவிகள் மற்றும் விருப்பங்கள் <doc_debugger_tools_and_options>`.
tr: Hata ayıklayıcıda harici düzenleyicinin kullanılması ayarlardaki ayrı bir seçenekle belirlenir. Ayrıntılar için bkz :ref:`Betik düzenleyici hata ayıklama araçları ve seçenekleri <doc_debugger_tools_and_options>`.
uk: Використання зовнішнього редактора в налагоджувачі визначається окремою опцією в налаштуваннях. Для отримання додаткової інформації див. :ref:`Інструменти та параметри налагодження редактора сценаріїв <doc_debugger_tools_and_options>`.
zh_hant: 在除錯器中使用外部編輯器由設定中的單獨選項決定。更多細節詳見 :ref:`腳本編輯器除錯工具及選項<doc_debugger_tools_and_options>`。

source: Official editor plugins
fr: Plugins officiels d’éditeur
ga: Breiseáin oifigiúla eagarthóra
it: Estensioni ufficiali di editor
ja: 公式エディタプラグイン
pt_br: Editor oficial de plugins
ru: Официальные плагины для редактора
ta: அதிகாரப்பூர்வ ஆசிரியர் செருகுநிரல்கள்
tr: Resmi düzenleyici eklentileri
uk: Офіційні плагіни редактора
zh_hant: 官方 Git 外掛

source: We have official plugins for the following code editors:
fr: Nous avons des plugins officiels pour les éditeurs de code suivants :
ga: Tá breiseáin oifigiúla againn do na heagarthóirí cód seo a leanas:
it: Abbiamo estensioni ufficiali per i seguenti editor di codice:
ja: 以下にコードエディタ用の公式プラグインがあります。
pt_br: Temos plugins oficiais para os seguintes editores de código:
ru: У нас есть официальные плагины для следующих редакторов кода:
ta: பின்வரும் குறியீடு எடிட்டர்களுக்கான அதிகாரப்பூர்வ செருகுநிரல்கள் எங்களிடம் உள்ளன:
tr: Aşağıdaki kod düzenleyicileri için resmi eklentilerimiz var:
uk: Ми маємо офіційні плагіни для наступних редакторів коду:
zh_hant: 以下程式碼編輯器有官方外掛程式：

source: `Visual Studio Code <https://github.com/godotengine/godot-vscode-plugin>`_
ga: `Cód Stiúideo Amharc <https://github.com/godotengine/godot-vscode-plugin> `_
ta: `விசுவல் ச்டுடியோ குறியீடு <https://github.com/godotengine/godot-vscode-plugin>` _
uk: `Код Visual Studio <https://github.com/godotengine/godot-vscode-plugin>`_
zh_hant: `GitHub <https://github.com/godotengine/>`_

source: LSP/DAP support
fr: Support LSP/DAP
ga: Tacaíocht LSP / DAP
it: Supporto per LSP/DAP
ja: LSP/DAP のサポート
ru: Поддержка LSP/DAP
ta: LSP/DAP உதவி
tr: LSP/DAP desteği
uk: Підтримка LSP/DAP
zh_hant: LSP/DAP 支援
