Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/index.po
Languages: cs, es, fr, ga, it, ja, ru, ta, tr, uk

source: Editor introduction
cs: Úvod do editoru
es: Introducción al editor
fr: Présentation de l'éditeur
ga: Réamhrá eagarthóra
it: Presentazione dell'editor
ja: エディタの紹介
ru: Введение в работу с редактором
ta: ஆசிரியர் அறிமுகம்
tr: Düzenleyici tanıtımı
uk: Представлення редактора

source: In this section, we cover the Godot editor in general, from its interface to using it with the command line.
cs: V této sekci se zabýváme editorem Godotu ve vší obecnosti, od jeho rozhraní až po používání s příkazovým řádkem.
es: En esta sección, cubrimos el editor de Godot en general, desde su interfaz hasta cómo utilizarlo con la línea de comandos.
fr: Dans cette section, nous couvrons l'éditeur Godot en général, de son interface à l'utilisation en ligne de commande.
ga: Sa chuid seo, clúdaímid eagarthóir Godot i gcoitinne, óna chomhéadan go dtí é a úsáid leis an líne ordaithe.
it: In questa sezione tratteremo l'editor Godot in generale, dalla sua interfaccia al suo utilizzo tramite riga di comando.
ja: このセクションではインターフェースからコマンドラインでの使用まで、Godotエディタ全般について説明します。
ru: В этом разделе мы рассмотрим редактор Godot в целом, от его интерфейса до использования в командной строке.
ta: இந்த பிரிவில், கோடோட் எடிட்டரை பொதுவாக அதன் இடைமுகத்திலிருந்து கட்டளை வரியுடன் பயன்படுத்துவது வரை உள்ளடக்குகிறோம்.
tr: Bu bölümde Godot düzenleyiciyi, arayüzünden komut satırıyla kullanımına kadar genel olarak ele alıyoruz.
uk: У цьому розділі ми розглядаємо редактор Godot загалом, від його інтерфейсу до використання з командним рядком.

source: Editor's interface
cs: Rozhraní editoru
es: Interfaz del editor
fr: Interface de l'éditeur
ga: Comhéadan an Eagarthóra
it: Interfaccia dell'editor
ja: エディタのインターフェース
ru: Интерфейс редактора
ta: ஆசிரியரின் இடைமுகம்
tr: Düzenleyici arayüzü
uk: Інтерфейс редактора

source: The following pages explain how to use the various windows, workspaces, and docks that make up the Godot editor. We cover some specific editors' interfaces in other sections where appropriate. For example, the :ref:`animation editor <doc_introduction_animation>`.
it: Le pagine seguenti spiegano come utilizzare le varie finestre, spazi di lavoro e pannelli che compongono l'editor Godot. Tratteremo le interfacce di alcuni editor specifici in altre sezioni, dove opportuno. Ad esempio, l':ref:`editor di animazione <doc_introduction_animation>`.

source: XR editor
it: Editor XR
ru: XR-редактор
ta: எக்ச்ஆர் ஆசிரியர்

source: Godot offers a port of the editor designed to run natively on Meta Quest devices. The port can be downloaded from the `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__, or from the `Godot download page <https://godotengine.org/download/preview/>`__.
cs: Godot nabízí port editoru navržený pro nativní běh na zařízeních Meta Quest. Port lze stáhnout z `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__ nebo ze stránky `Godot download <https://godotengine.org/download/preview/>`__.
it: Godot offre una versione dell'editor progettata per funzionare nativamente sui dispositivi Meta Quest. Questa versione si può scaricare dal `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__, o dalla `pagina di download di Godot <https://godotengine.org/download/preview/>`__.
ja: GodotはMeta Questデバイス上でネイティブ動作をするよう設計されたエディタの移植版を提供しています。移植版は `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__, もしくは`Godot download page <https://godotengine.org/download/preview/>`__. からダウンロードできます。
ru: Godot предлагает порт редактора, разработанный для работы на устройствах Meta Quest. Порт можно загрузить с `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__, или из `Godot download page <https://godotengine.org/download/preview/>`__.
ta: மேவு குவெச்ட் சாதனங்களில் சொந்தமாக இயக்க வடிவமைக்கப்பட்ட எடிட்டரின் துறைமுகத்தை கோடோட் வழங்குகிறது. துறைமுகத்தை `மெட்டா ஒரைசன் கடை <https://www.meta.com/experiences/godot-game-ganennengine/7713660705416473/> __ __ அல்லது` கோடோட் பதிவிறக்கப் பக்கம் <https://gododengine இலிருந்து பதிவிறக்கம் செய்யலாம்.

source: Android editor
es: Editor en Android
fr: Éditeur Android
ga: Eagarthóir Android
it: Editor Android
ja: Androidエディタ
ru: Редактор андроид
ta: ஆண்ட்ராய்டு ஆசிரியர்
tr: Android düzenleyicisi
uk: Android редактор

source: Godot offers a native port of the editor running entirely on Android devices. The Android port can be downloaded from the `Android Downloads page <https://godotengine.org/download/android/>`__. While we strive for feature parity with the Desktop version of the editor, the Android port has a certain amount of caveats you should be aware of.
cs: Godot nabízí nativní port editoru, který běží výhradně na zařízeních Android. Android port lze stáhnout ze stránky `Android Downloads <https://godotengine.org/download/android/>`__. Přestože se snažíme o rovnoměrnost funkcí s verzí editoru pro desktopové platformy, Android port má určité odchylky, o kterých byste měli vědět.
es: Godot ofrece una versión nativa del editor que se ejecuta completamente en dispositivos Android. La versión para Android se puede descargar desde la `página de descargas de android <https://godotengine.org/download/android/>`__. Aunque nos esforzamos por lograr una paridad de funciones con la versión de escritorio del editor, la versión para Android tiene ciertas limitaciones de las que debes ser consciente.
fr: Godot offre un port natif de l'éditeur fonctionnant entièrement sur les appareils Android. Le port Android peut être téléchargé à partir de la page `Android Downloads page <https://godotengine.org/download/android/>`__. Alors que nous nous efforçons d'avoir une parité de fonctionnalités avec la version Bureau de l'éditeur, le port Android a une certaine quantité de contraintes dont vous devriez être conscient.
ga: Cuireann Godot port dúchais an eagarthóra ar fáil a ritheann go hiomlán ar ghléasanna Android. Is féidir an port Android a íoslódáil ón leathanach Íoslódálacha Android <https://godotengine.org/download/android/>`__. Cé go ndéanaimid ár ndícheall paireacht gné a bhaint amach le leagan Deisce an eagarthóra, tá méid áirithe caveat ag calafort Android ar chóir duit a bheith ar an eolas faoi.
it: Godot offre una versione nativa dell'editor, eseguibile interamente sui dispositivi Android. La versione per Android si può scaricata dalla `pagina dei download di Android <https://godotengine.org/download/android/>`__. Sebbene ci sforziamo a garantire la parità di funzionalità con la versione desktop dell'editor, la versione per Android ha certe limitazioni di cui è opportuno essere a conoscenza.
ja: GodotはAndroidデバイス上で実行可能なエディタのネイティブポートを提供します。 Androidポートは `Android版ダウンロードページ <https://godotengine.org/download/android/>`__ からダウンロードできます。エディタのデスクトップ版のバージョンと機能が同等になるよう努めていますが、Androidへの移植には注意しなければならない一定の注意事項があります。
ru: Godot предлагает собственный порт редактора, работающий полностью на устройствах Android. Порт для Android можно загрузить со страницы загрузок для Android <https://godotengine.org/download/android/>`__. Несмотря на то, что мы стремимся к равенству возможностей с настольной версией редактора, Android-порт имеет ряд нюансов, о которых вам следует знать.
ta: கோடோட் அண்ட்ராய்டு சாதனங்களில் முழுமையாக இயங்கும் எடிட்டரின் சொந்த துறைமுகத்தை வழங்குகிறது. ஆண்ட்ராய்டு போர்ட்டை `Android Downloads பக்கத்திலிருந்து <https://godotengine.org/download/android/> __ __. எடிட்டரின் டெச்க்டாப் பதிப்போடு அம்ச சமநிலைக்காக நாங்கள் பாடுபடுகையில், ஆண்ட்ராய்டு போர்ட்டில் நீங்கள் அறிந்திருக்க வேண்டிய ஒரு குறிப்பிட்ட அளவு எச்சரிக்கைகள் உள்ளன.
tr: Godot, tamamen Android cihazlarda çalışan yerel bir düzenleyici taşıması sunmaktadır. Android taşıması, `Android İndirmeler sayfası <https://godotengine.org/download/android/>`__ üzerinden indirilebilir. Düzenleyicinin Masaüstü sürümüyle özellik eşitliği için çabalarken, Android taşımasının bilmeniz gereken belirli uyarıları vardır.
uk: Godot пропонує рідний порт редактора, який повністю працює на пристроях Android. Порт Android можна завантажити зі `сторінки завантажень Android <https://godotengine.org/download/android/>`__. Хоча ми прагнемо дорівнювати функціям версії редактора для настільних комп’ютерів, порт Android має певні застереження, про які вам слід знати.

source: Web editor
cs: Webový editor
es: Editor en web
fr: Éditeur Web
ga: Eagarthóir gréasáin
it: Editor Web
ja: Webエディタ
ru: Web редактор
ta: வலை ஆசிரியர்
tr: Web düzenleyicisi
uk: Веб-редактор

source: Godot offers an HTML5 version of the editor running entirely in your browser. No download is required to use it, but it has a certain amount of caveats you should be aware of.
cs: Godot nabízí HTML5 verzi editoru, která běží zcela ve vašem prohlížeči. K jeho použití není nutné nic stahovat, ale má určité odchylky, o kterých byste měli vědět.
es: Godot ofrece una versión HTML5 del editor que se ejecuta completamente en tu navegador. No es necesario descargar nada para usarlo, pero tiene ciertas limitaciones de las que deberías estar al tanto.
fr: Godot offre une version HTML5 de l'éditeur tournant entièrement dans votre navigateur. Aucun téléchargement n'est requis, mais il y a un certain nombre de contraintes que vous devriez connaître.
ga: Cuireann Godot leagan HTML5 den eagarthóir ag rith go hiomlán i do bhrabhsálaí. Níl aon íoslódáil ag teastáil chun é a úsáid, ach tá méid áirithe rabhadh aige ba chóir duit a bheith ar an eolas fúthu.
it: Godot offre una versione HTML5 dell'editor, eseguibile interamente nel browser. Non è necessario alcun download per usarlo, ma ha certe limitazioni di cui è opportuno essere a conoscenza.
ja: GodotはWebブラウザ内で実行可能なエディタのHTML5版を提供します。使用するためにダウンロードする必要はありませんが、注意すべき点がいくつかあります。
ru: Godot предлагает HTML5-версию редактора, работающего полностью в вашем браузере. Для ее использования не требуется загрузка, но она имеет ряд нюансов, о которых вам следует знать.
ta: கோடோட் உங்கள் உலாவியில் முழுமையாக இயங்கும் எடிட்டரின் HTML5 பதிப்பை வழங்குகிறது. இதைப் பயன்படுத்த எந்த பதிவிறக்கமும் தேவையில்லை, ஆனால் நீங்கள் அறிந்திருக்க வேண்டிய ஒரு குறிப்பிட்ட அளவு எச்சரிக்கைகள் உள்ளன.
tr: Godot, tamamen tarayıcınızda çalışan bir HTML5 düzenleyici sürümü sunuyor. Kullanmak için indirme gerekmez, ancak bilmeniz gereken bazı uyarılar vardır.
uk: Godot пропонує версію редактора HTML5, яка повністю працює у вашому браузері. Для його використання не потрібно завантажувати, але він має певну кількість застережень, про які вам слід знати.

source: Advanced features
cs: Pokročilé funkce
es: Características avanzadas
fr: Fonctionnalités avancées
ga: Gnéithe chun cinn
it: Funzionalità avanzate
ja: 高度な機能
ru: Продвинутые функции
ta: மேம்பட்ட நற்பொருத்தங்கள்
tr: Gelişmiş özellikler
uk: Розширені функції

source: The articles below focus on advanced features useful for experienced developers, such as calling Godot from the command line and using an external text editor like Visual Studio Code or Emacs.
cs: Níže uvedené články se zaměřují na pokročilé funkce užitečné pro zkušené vývojáře, jako je volání Godotu z příkazového řádku a používání externích textových editorů, jako například Visual Studio Code nebo Emacs.
es: Los artículos a continuación se centran en características avanzadas útiles para desarrolladores experimentados, como llamar a Godot desde la línea de comandos y utilizar un editor de texto externo como Visual Studio Code o Emacs.
fr: Les articles ci-dessous se concentrent sur les fonctionnalités avancées utiles pour les développeurs expérimentés, comme appeler Godot depuis la ligne de commande et utiliser un éditeur de texte externe comme Visual Studio Code ou Emacs.
ga: Díríonn na hailt thíos ar ardghnéithe atá úsáideach d'fhorbróirí a bhfuil taithí acu, mar shampla glaoch ar Godot ón líne ordaithe agus eagarthóir téacs seachtrach mar Visual Studio Code nó Emacs a úsáid.
it: Gli articoli seguenti si concentrano su funzionalità avanzate utili per gli sviluppatori esperti, come chiamare Godot dalla riga di comando e utilizzare un editor di testo esterno come Visual Studio Code o Emacs.
ja: 以下の記事ではコマンド ラインからGodotを呼び出したり、Visual Studio CodeやEmacsといった外部テキスト エディタを使用したりするなど、経験豊富な開発者にとって役立つ高度な機能に焦点を当てています。
ru: Статьи ниже посвящены расширенным возможностям, полезным для опытных разработчиков, таким как вызов Godot из командной строки и использование внешнего текстового редактора, например Visual Studio Code или Emacs.
ta: கீழேயுள்ள கட்டுரைகள் பட்டறிவு வாய்ந்த டெவலப்பர்களுக்கு பயனுள்ள மேம்பட்ட அம்சங்களில் கவனம் செலுத்துகின்றன, அதாவது கட்டளை வரியிலிருந்து கோடோட்டை அழைப்பது மற்றும் விசுவல் ச்டுடியோ குறியீடு அல்லது எமாக்கள் போன்ற வெளிப்புற உரை திருத்தியைப் பயன்படுத்துதல்.
tr: Aşağıdaki makaleler, Godot'yu komut satırından çağırmak ve Visual Studio Code veya Emacs gibi harici bir metin düzenleyici kullanmak gibi deneyimli geliştiriciler için yararlı olan gelişmiş özelliklere odaklanmaktadır.
uk: Наведені нижче статті присвячені розширеним функціям, корисним для досвідчених розробників, таким як виклик Godot з командного рядка та використання зовнішнього текстового редактора, наприклад Visual Studio Code або Emacs.

source: Managing editor features
cs: Správa funkcí editoru
es: Administrando las caracteristicas del editor
fr: Gérer les fonctionnalités de l'éditeur
ga: Gnéithe eagarthóra bainistíochta
it: Gestione delle funzionalità dell'editor
ja: エディタ機能の管理
ru: Управление функциями редактора
ta: நிர்வாக ஆசிரியர் நற்பொருத்தங்கள்
tr: Düzenleyici özelliklerini yönetmek
uk: Керування функціями редактора

source: Godot allows you to remove features from the editor. This may be useful if you're an educator trying to ease students into the editor slowly, or if you're working on a project that's only 2D or only 3D and don't want to see what you don't need.
cs: Godot vám umožňuje z editoru odebrat funkce. To může být užitečné, pokud jste pedagog, který se snaží studentům zezačátku ulehčit práci v editoru, nebo pokud pracujete na projektu, který je pouze 2D nebo pouze 3D a nechcete zobrazovat funkce, které nepotřebujete.
es: Godot te permite eliminar características del editor. Esto puede ser útil si eres un educador tratando de familiarizar lentamente a los estudiantes con el editor, o si estás trabajando en un proyecto que es solo 2D o solo 3D y no quieres ver lo que no necesitas.
fr: Godot vous permet de supprimer des fonctionnalités de l'éditeur. Cela peut être utile si vous êtes un éducateur essayant d'initier des étudiants à l'éditeur lentement, ou si vous travaillez sur un projet qui est seulement 2D ou seulement 3D et ne voulez pas voir ce que vous n'avez pas besoin.
ga: Ligeann Godot duit gnéithe a bhaint ón eagarthóir. D'fhéadfadh sé seo a bheith úsáideach más oideachasóir tú ag iarraidh mic léinn a mhaolú isteach san eagarthóir go mall, nó má tá tú ag obair ar thionscadal nach bhfuil ach 2D nó 3D amháin agus nach dteastaíonn uait a fheiceáil.
it: Godot consente di rimuovere funzionalità dall'editor. Questo può servire per educatori che cercano di familiarizzare gli studenti all'editor, o per lavorare a un progetto soltanto in 2D oppure 3D, senza vedere ciò di cui non c'è bisogno.
ja: Godotではエディタから機能を削除することができます。これは教育者が学生をゆっくりとエディタに慣れさせようとしている場合や、2Dオンリー、または3Dオンリーのプロジェクトに取り組んでいて、不要なものを見たくない場合に便利です。
ru: Godot позволяет удалять функции из редактора. Это может быть полезно, если вы преподаватель, пытающийся постепенно вводить студентов в редактор, или если вы работаете над проектом, который состоит только из 2D или только из 3D, и не хотите видеть то, что вам не нужно.
ta: எடிட்டரிடமிருந்து அம்சங்களை அகற்ற கோடோட் உங்களை அனுமதிக்கிறது. நீங்கள் மாணவர்களை மெதுவாக எடிட்டருக்குள் எளிதாக்க முயற்சிக்கும் கல்வியாளராக இருந்தால், அல்லது 2 டி அல்லது 3 டி மட்டுமே இருக்கும் ஒரு திட்டத்தில் நீங்கள் பணிபுரிகிறீர்கள் என்றால் இது பயனுள்ளதாக இருக்கும், உங்களுக்குத் தேவையில்லாததைப் பார்க்க விரும்பவில்லை.
tr: Godot, düzenleyiciden özellikleri kaldırmanıza olanak tanır. Bu, öğrencileri düzenleyiciye yavaşça alıştırmaya çalışan bir eğitimciyseniz veya yalnızca 2B veya yalnızca 3B olan bir proje üzerinde çalışıyorsanız ve ihtiyacınız olmayan şeyleri görmek istemiyorsanız yararlı olabilir.
uk: Godot дозволяє видаляти функції з редактора. Це може бути корисним, якщо ви вчитель і намагаєтеся повільно засвоїти учнів у редакторі, або якщо ви працюєте над проектом, який є лише 2D або лише 3D, і не хочете бачити те, що вам не потрібно.

source: The following pages explain how to use the various windows, workspaces, and docks that make up the Godot editor. We cover some specific editors' interface in other sections where appropriate. For example, the :ref:`animation editor <doc_introduction_animation>`.
cs: Následující stránky vysvětlují, jak používat různá okna, pracovní plochy a doky, které dohromady utváří editor Godotu. Některým konkrétním rozhraním editorů se věnujeme v jiných, vhodnějších částech, například pro :ref:`editor animací <doc_introduction_animation>`.
es: En las siguientes páginas explicaremos cómo utilizar las diversas ventanas, espacios de trabajo y paneles que hacen el editor de Godot. Cubriremos algunas partes específicas de la interfaz del editor donde sea apropiado. Por ejemplo, el :ref:`editor de animación <doc_introduction_animation>`.
fr: Dans cette section, nous couvrons les différentes fenêtres, espaces de travail et docks qui constituent l'éditeur Godot. Nous couvrons l'interface de certains éditeurs spécifiques dans d'autres sections, le cas échéant. Par exemple, :ref:`l'éditeur d'animation <doc_introduction_animation>`.
ga: Míníonn na leathanaigh seo a leanas conas na fuinneoga, na spásanna oibre agus na duganna éagsúla atá mar eagarthóir Godot a úsáid. Clúdaímid roinnt comhéadan eagarthóirí ar leith i gcodanna eile nuair is cuí. Mar shampla, an :ref:`eagarthóir beochana <doc_introduction_animation>`.
ta: கோடோட் எடிட்டரை உருவாக்கும் பல்வேறு சன்னல்கள், பணியிடங்கள் மற்றும் கப்பல்துறைகளை எவ்வாறு பயன்படுத்துவது என்பதை பின்வரும் பக்கங்கள் விளக்குகின்றன. சில குறிப்பிட்ட எடிட்டர்களின் இடைமுகத்தை மற்ற பிரிவுகளில் பொருத்தமான இடங்களில் உள்ளடக்குகிறோம். எடுத்துக்காட்டாக, தி: ரெஃப்: `அனிமேசன் எடிட்டர் <doc_introduction_animation>`.
tr: Aşağıdaki sayfalarda Godot düzenleyiciyi oluşturan çeşitli pencerelerin, çalışma alanlarının ve yuvaların nasıl kullanılacağı açıklanmaktadır. Bazı özel düzenleyicilerin arayüzlerini uygun olan diğer bölümlerde ele alıyoruz. Örneğin, :ref:`canlandırma düzenleyici <doc_introduction_animation>`.
uk: На наступних сторінках пояснюється, як використовувати різноманітні вікна, робочі області та доки, які складають редактор Godot. Ми розглядаємо деякі конкретні інтерфейси редакторів в інших розділах, де це необхідно. Наприклад, :ref:`редактор анімації <doc_introduction_animation>`.

source: Translation status
es: Estado de la traducción
