Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/project_manager.po
Languages: de, es, fr, ga, it, ja, pt_br, ru, ta, tr, uk, zh_cn, zh_tw

source: Using the Project Manager
de: Verwenden des Projektmanagers
es: Utilizando el Administrador de Proyectos
fr: Utiliser le gestionnaire de projets
ga: Bainisteoir Tionscadail a úsáid
it: Utilizzare il Gestore dei progetti
ja: プロジェクトマネージャーの使用
ru: Использование Менеджера Проектов
ta: திட்ட மேலாளரைப் பயன்படுத்துதல்
tr: Proje Yöneticisini Kullanma
uk: Використання менеджера проекту
zh_cn: 使用项目管理器
zh_tw: 專案管理員

source: When you launch Godot, the first window you see is the Project Manager. It lets you create, remove, import, or play game projects:
es: Al iniciar Godot, la primera ventana que aparece es el Administrador de Proyectos. Este le permite crear, eliminar, importar o ejecutar proyectos de juegos:
fr: La première fenêtre que vous voyez en ouvrant Godot est le Gestionnaire de projets. Elle vous permet de créer, supprimer, importer ou jouer des projets de jeux :
it: Quando avvii Godot, la prima finestra che vedi è il Gestore dei progetti. Ti permette di creare, rimuovere, importare o giocare a progetti di gioco:
ru: При запуске Godot первым окном, которое вы видите, является Project Manager. Он позволяет вам создавать, удалять, импортировать или воспроизводить игровые проекты:
ta: நீங்கள் கோடோட்டைத் தொடங்கும்போது, நீங்கள் பார்க்கும் முதல் சாளரம் திட்ட மேலாளர். விளையாட்டு திட்டங்களை உருவாக்க, அகற்ற, இறக்குமதி செய்ய அல்லது விளையாட இது உங்களை அனுமதிக்கிறது:
uk: Коли ви запускаєте Godot, перше вікно, яке ви бачите, — це менеджер проектів. Він дозволяє створювати, видаляти, імпортувати або грати в ігрові проекти:
zh_cn: 当你启动 Godot 时，第一个看到的窗口是项目管理器（Project Manager）。它允许你创建、删除、导入或运行游戏项目：
zh_tw: 當您啟動 Godot 時，首先看到的視窗是專案管理員。它讓您可以建立、移除、匯入或遊玩遊戲專案：

source: To change the editors language click on the **Settings** Button in the top right corner:
es: Para modificar el idioma del editor, haz clic en el botón de **Configuración**, ubicado en la esquina superior derecha:
fr: Pour modifier la langue de l'éditeur, cliquez sur le bouton **Paramètres** dans le coin supérieur droit :
it: Per cambiare la lingua dell'editor clicca sul pulsante **Impostazioni** nell'angolo in alto a destra:
ru: Чтобы изменить язык редактора, нажмите кнопку **Settings (Настройки)** в правом верхнем углу:
ta: எடிட்டர்களின் மொழியை மாற்ற மேல் வலது மூலையில் உள்ள ** அமைப்புகள் ** பொத்தானைக் சொடுக்கு செய்க:
uk: Щоб змінити мову редактора, натисніть кнопку **Налаштування** у верхньому правому куті:
zh_cn: 要更改编辑器的语言，点击右上角的“设置”按钮。
zh_tw: 要更改編輯器的語言，請點擊右上角的 **設定** 按鈕：

source: In Project Manager Settings, you can change the interface **language** from the language dropdown menu, which is the system default language by default.
es: En la configuración del Administrador de proyectos, puede cambiar el **idioma** de la interfaz desde el menú desplegable de idioma, que es el idioma predeterminado del sistema.
fr: Dans les paramètres du gestionnaire de projets, vous pouvez changer la **langue** de l'interface depuis le menu déroulant de langage, qui est la langue par défaut du système par défaut.
it: Nelle impostazioni del Gestore dei progetti è possibile modificare la **lingua** dell'interfaccia dal menu a discesa della lingua, la quale è normalmente la lingua predefinita del sistema.
pt_br: Nas Configurações do Gerenciador de Projetos, você pode alterar o **idioma** da interface no menu suspenso de idiomas, cujo padrão é o idioma do sistema.
ru: В настройках менеджера проектов вы можете изменить **язык** интерфейса из раскрывающегося меню языков, который по умолчанию является языком системы.
ta: திட்ட மேலாளர் அமைப்புகளில், மொழி கீழ்தோன்றும் மெனுவிலிருந்து ** மொழி ** இடைமுகத்தை மாற்றலாம், இது இயல்புநிலையாக கணினி இயல்புநிலை மொழியாகும்.
uk: У налаштуваннях менеджера проектів ви можете змінити **мову** інтерфейсу зі спадного меню мови, яка за умовчанням є системною мовою за замовчуванням.
zh_cn: 在项目管理器设置中，你可以通过语言下拉菜单更改界面\ **语言**\ ，默认情况下是系统默认语言。
zh_tw: 在專案管理員設定中，您可以從語言下拉選單更改介面 **語言** 。預設情況下，此選單會顯示系統預設語言。

source: You can also change the **theme** of the editor, the **display scale** for different interface element sizes, and the availability of online functionality using **network mode**. If network mode is online, Godot will also check and inform you about new versions of Godot.
es: También puedes cambiar el **tema** del editor, la **escala de visualización** para diferentes tamaños de elementos de la interfaz y la disponibilidad de la funcionalidad en línea mediante el **modo de red**. Si el modo de red está en línea, Godot también comprobará y le informará sobre nuevas versiones.
fr: Vous pouvez aussi changer le **thème** de l'éditeur, **l'échelle d'affichage** pour différentes tailles d'éléments de l'interface, et la disponibilité des fonctionnalités en ligne en utilisant le **mode réseau**. Si le mode réseau est en ligne, Godot vérifiera et vous informera également des nouvelles versions de Godot.
it: È anche possibile modificare il **tema** dell'editor, la **scala di visualizzazione** per diverse dimensioni degli elementi dell'interfaccia, nonché la disponibilità delle funzionalità online attraverso la **modalità di rete**. Se la modalità di rete è online, Godot inoltre verificherà e informerà sulle nuove versioni di Godot.
pt_br: Você também pode alterar o **tema** do editor, a **escala de exibição** para diferentes tamanhos de elementos da interface e a disponibilidade de funcionalidades online usando o **modo de rede**. Se o modo de rede estiver online, o Godot também verificará e informará sobre novas versões disponíveis.
ru: Вы также можете изменить **тему** редактора, **масштаб отображения** для различных размеров элементов интерфейса и доступность онлайн-функций с помощью **сетевого режима**. Если сетевой режим находится в режиме онлайн, Godot также проверит и сообщит вам о новых версиях Godot.
ta: எடிட்டரின் ** கருப்பொருள் **, வெவ்வேறு இடைமுக உறுப்பு அளவுகளுக்கு ** காட்சி அளவுகோல் ** மற்றும் ** பிணையம் பயன்முறையைப் பயன்படுத்தி நிகழ்நிலை செயல்பாட்டின் கிடைக்கும் தன்மை ஆகியவற்றை மாற்றலாம். பிணையம் பயன்முறை ஆன்லைனில் இருந்தால், கோடோட் கோடோட்டின் புதிய பதிப்புகளைப் பற்றியும் சரிபார்த்து உங்களுக்குத் தெரிவிக்கும்.
uk: Ви також можете змінити **тему** редактора, **масштаб відображення** для різних розмірів елементів інтерфейсу та доступність онлайн-функцій за допомогою **режиму мережі**. Якщо режим мережі онлайн, Godot також перевірятиме та інформуватиме вас про нові версії Godot.
zh_cn: 你还可以更改编辑器的\ **主题**\ 、不同界面元素大小的\ **显示比例**\ ，以及使用\ **网络模式**\ 来决定在线功能是否可用。如果网络模式设为在线，Godot 还会检查是否有新版本并通知你。
zh_tw: 您也可以更改編輯器的 **佈景主題** 、不同介面元素尺寸的 **顯示縮放** ，以及使用 **網路模式** 來控制線上功能的可用性。如果網路模式為線上，Godot 也會檢查並通知您 Godot 的新版本。

source: The **directory naming convention** can also be changed to replace spaces according to the chosen format when creating folders automatically.
es: La **convención de nombres de directorio** también se puede cambiar para reemplazar espacios según el formato elegido al crear carpetas automáticamente.
fr: La **convention de nommage des dossiers** peut aussi être changée pour remplacer les espaces selon le format choisi lors de la création automatique de dossiers.
it: La **convenzione di denominazione per le cartelle** si può anche cambiare per sostituire gli spazi in base al formato scelto durante la creazione automatica delle cartelle.
pt_br: A **convenção de nomenclatura de diretórios** também pode ser alterada para substituir espaços conforme o formato escolhido ao criar pastas automaticamente.
ru: **Соглашение об именовании каталогов** также можно изменить, чтобы при автоматическом создании папок пробелы заменялись в соответствии с выбранным форматом.
ta: கோப்புறைகளை தானாக உருவாக்கும் போது தேர்ந்தெடுக்கப்பட்ட வடிவமைப்பின் படி இடைவெளிகளை மாற்றுவதற்கு ** அடைவு பெயரிடும் மாநாடு ** ஐ மாற்றலாம்.
uk: **Правила іменування каталогів** також можна змінити, щоб замінити пробіли відповідно до вибраного формату під час автоматичного створення папок.
zh_cn: **目录命名规则** 也可以更改，以便在自动创建文件夹时根据选择的格式替换空格。
zh_tw: **目錄命名慣例** 也可以更改，以便在自動建立資料夾時，根據所選格式替換空格。

source: Creating and importing projects
de: Erstellen und Importieren von Projekten
es: Creando e importando proyectos
fr: Créer et importer des projets
ga: Tionscadail a chruthú agus a
it: Creazione e importazione dei progetti
ja: プロジェクトの作成とインポート
ru: Создание и импортирование проектов
ta: திட்டங்களை உருவாக்குதல் மற்றும் இறக்குமதி செய்தல்
tr: Proje oluşturma ve içe aktarma
uk: Створення та імпорт проектів
zh_cn: 项目的创建与导入
zh_tw: 建立新專案

source: To create a new project:
de: So erstellen Sie ein neues Projekt:
es: Para crear un proyecto nuevo:
fr: Pour créer un nouveau projet :
ga: Chun tionscadal nua a chruthú:
it: Per creare un nuovo progetto:
ja: 新しいプロジェクトを作成するには:
pt_br: Para criar um novo projeto:
ru: Чтобы создать новый проект:
ta: புதிய திட்டத்தை உருவாக்க:
tr: Yeni bir proje oluşturmak için:
uk: Створіть новий проект:
zh_cn: 创建新项目：
zh_tw: 若要建立新專案：

source: Click the **Create** button on the top-left of the window.
fr: Cliquez sur le bouton **Créer** en haut à gauche de la fenêtre.
it: Clicca sul pulsante **Crea** in alto a sinistra della finestra.
ru: Нажмите кнопку **Create (Создать)** в левом верхнем углу окна.
ta: சாளரத்தின் மேல் இடதுபுறத்தில் ** உருவாக்கு ** பொத்தானைக் சொடுக்கு செய்க.
uk: Натисніть кнопку **Створити** у верхньому лівому куті вікна.
zh_cn: 单击窗口左上角的 **新建** 按钮。
zh_tw: 點擊視窗左上角的 **建立** 按鈕。

source: Give the project a name, then open the file browser using the **Browse** button, and choose an empty folder on your computer to save the files. Alternatively, you can enable **Create Folder** option to automatically create a new sub-folder with the project name, following the directory naming convention set in the settings. An empty folder will show a green tick on the right.
es: Asigne un nombre al proyecto, abra el explorador de archivos con el botón **Explorar** y selecciona una carpeta vacía en su ordenador para guardar los archivos. También puedes activar la opción **Crear carpeta** para crear automáticamente una subcarpeta con el nombre del proyecto, siguiendo la convención de nombres de directorios establecida en la configuración. Una carpeta vacía mostrará una marca de verificación verde a la derecha.
fr: Nommez le projet, puis ouvrez le navigateur de fichier en utilisant le bouton **Navigation**. Choisissez ensuite un dossier vide sur votre ordinateur pour sauvegarder les fichiers. Alternativement, vous pouvez activer l'option **Créer Dossier** qui créera automatiquement un sous-dossier portant le nom de votre projet en suivant la convention de nommage sélectionnée dans les paramètres. Si le dossier est vide, une coche verte apparaitra sur la droite.
it: Assegna un nome al progetto, quindi apri il file manager usando il pulsante **Sfoglia** e scegli una cartella vuota sul tuo computer in cui salvare i file. In alternativa, puoi abilitare l'opzione **Crea cartella** per creare automaticamente una nuova sottocartella con il nome del progetto, seguendo la convenzione di denominazione impostata nelle impostazioni. Una cartella vuota mostrerà un segno di spunta verde sulla destra.
pt_br: Dê um nome ao projeto, depois abra o navegador de arquivos usando o botão **Procurar** e escolha uma pasta vazia no seu computador para salvar os arquivos. Alternativamente, você pode ativar a opção **Criar Pasta** para criar automaticamente uma nova subpasta com o nome do projeto, seguindo a convenção de nomenclatura de diretórios definida nas configurações. Uma pasta vazia exibirá um tique verde à direita.
ru: Дайте проекту имя, затем откройте окно просмотра файлов с помощью кнопки **Обзор** и выберите пустую папку на вашем компьютере для сохранения файлов. В качестве альтернативы вы можете включить опцию **Создать папку**, чтобы автоматически создавать новую подпапку с именем проекта, следуя соглашению об именовании каталогов, установленному в настройках. Пустая папка будет отмечена зеленой галочкой справа.
ta: திட்டத்திற்கு ஒரு பெயரைக் கொடுங்கள், பின்னர் ** உலாவு ** பொத்தானைப் பயன்படுத்தி கோப்பு உலாவியைத் திறந்து, கோப்புகளைச் சேமிக்க உங்கள் கணினியில் வெற்று கோப்புறையைத் தேர்வுசெய்க. மாற்றாக, அமைப்புகளில் அமைக்கப்பட்ட அடைவு பெயரிடும் மாநாட்டைத் தொடர்ந்து, திட்ட பெயருடன் புதிய துணை கோப்புறையை தானாக உருவாக்க கோப்புறையை உருவாக்க ** விருப்பத்தை இயக்கலாம். ஒரு வெற்று கோப்புறை வலதுபுறத்தில் பச்சை டிக் காண்பிக்கும்.
uk: Дайте проекту назву, потім відкрийте файловий браузер за допомогою кнопки **Огляд** і виберіть порожню папку на вашому комп’ютері для збереження файлів. Крім того, ви можете ввімкнути опцію **Створити папку**, щоб автоматично створити нову вкладену папку з назвою проекту, дотримуючись правила іменування каталогів, установленого в налаштуваннях. Порожня папка буде мати зелену галочку праворуч.
zh_cn: 为项目命名，然后使用 **浏览** 按钮打开文件浏览器，选择计算机上一个空文件夹来保存文件。或者，你可以启用 **创建文件夹** 选项，自动创建一个带有项目名称的新子文件夹，遵循设置中指定的目录命名规范。空文件夹的右侧会显示一个绿色勾选。
zh_tw: 為專案命名，然後使用 **瀏覽** 按鈕開啟檔案總管，並選擇您電腦上的一個空資料夾來儲存檔案。或者，您可以啟用 **建立資料夾** 選項，以按照設定中指定的目錄命名慣例，自動建立一個以專案名稱命名的新子資料夾。空的資料夾會在右側顯示綠色勾號。

source: Select one of the renderers (this can also be changed later).
es: Selecciona uno de los renderizadores (esto también se puede cambiar más tarde).
fr: Sélectionnez l'un des moteurs de rendu (ceci peut également être changé plus tard).
it: Selezionare uno dei renderer (è possibile cambiarlo anche in seguito).
ru: Выберите один из рендереров (его также можно будет изменить позже).
ta: ரெண்டரர்களில் ஒன்றைத் தேர்ந்தெடுக்கவும் (இதை பின்னர் மாற்றலாம்).
uk: Виберіть один із рендерів (це також можна змінити пізніше).
zh_cn: 选择其中一个渲染器（这个设置稍后也可以更改）。
zh_tw: 選擇一個算繪器（此設定之後也可以更改）。

source: Click the **Create & Edit** button to create the project folder and open it in the editor.
de: Klicken Sie auf den Button **Erstellen & Bearbeiten**, um den Projektordner zu erstellen und ihn im Editor zu öffnen.
es: Haz clic en *Crear y Editar* para crear la carpeta del proyecto y abrirlo en el editor.
fr: Cliquez sur **Importer et modifier** pour créer le dossier du projet et l'ouvrir dans l'éditeur.
ga: Cliceáil ar an gcnaipe **Cruthaigh & Cuir in Eagar** chun an fillteán tionscadail a chruthú agus é a oscailt san eagarthóir.
it: Cliccare sul pulsante **Crea e modifica** per creare la cartella del progetto e aprirla nell'editor.
ja: **作成して編集** ボタンをクリックすると、プロジェクトフォルダを作成され、エディタが開きます。
ru: Нажмите **Импортировать и редактировать**, чтобы создать папку проекта и откройте его в редакторе.
ta: திட்டக் கோப்புறையை உருவாக்க ** உருவாக்கு & திருத்து ** பொத்தானைக் சொடுக்கு செய்து அதை எடிட்டரில் திறக்கவும்.
tr: Proje klasörünü oluşturmak ve düzenleyicide açmak için **Oluştur ve Düzenle** düğmesine tıklayın.
uk: Натисніть кнопку **Створити та редагувати**, щоб створити папку проекту та відкрити її в редакторі.
zh_cn: 单击 **创建并编辑** 按钮，这样就会创建项目文件夹并将其在编辑器中打开。
zh_tw: 點擊 **建立與編輯** 按鈕，以建立專案資料夾並在編輯器中開啟它。

source: You can optionally choose a version control system. Currently, only `git <https://git-scm.com>`__ is supported and it needs the Godot Git Plugin to be installed, either manually or using the :ref:`Asset Library <doc_using_assetlib>`. To learn more about the Godot Git Plugin, see its `wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__.
es: Opcionalmente, puede elegir un sistema de control de versiones. Actualmente, solo se admite `git <https://git-scm.com>`__ y requiere la instalación del complemento Godot Git, ya sea manualmente o mediante la :ref:`Asset Library <doc_using_assetlib>`. Para obtener más información sobre el complemento Godot Git, consulta su wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__.
fr: Vous avez la possibilité de sélectionner un système de contrôle de version. Actuellement, seulement `git <https://git-scm.com>`__ est disponible et il est nécessaire d'installer le plugin Godot Git, soit manuellement, soit en utilisant la :ref:`Asset Library <doc_using_assetlib>`. Pour obtenir plus d'information au sujet du plugin Godot Git, consultez son `wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__.
it: È possibile scegliere facoltativamente un sistema di controllo versioni. Attualmente, è supportato solo `git <https://git-scm.com>`__ e richiede l'installazione dell'estensione Git di Godot, manualmente o tramite la :ref:`Libreria dei contenuti <doc_using_assetlib>`. Per ulteriori informazioni sull'estensione Git di Godot, consultare la relativa `wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__.
pt_br: Você pode, opcionalmente, escolher um sistema de controle de versão. Atualmente, somente o `git <https://git-scm.com>`__ é suportado, e é necessário ter o Godot Git Plugin instalado, seja manualmente ou usando a :ref:`Asset Library <doc_using_assetlib>`. Para saber mais sobre o Godot Git Plugin, consulte seu `wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__.
ru: Вы можете дополнительно выбрать систему контроля версий. В настоящее время только `git <https://git-scm.com>`__ поддерживается, и для этого необходимо установить Godot Git Plugin, либо вручную, либо с помощью :ref:`Asset Library <doc_using_assetlib>`. Чтобы узнать больше о Godot Git Plugin, смотрите `wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__.
ta: பதிப்பு கட்டுப்பாட்டு அமைப்பை நீங்கள் விருப்பமாக தேர்வு செய்யலாம். தற்போது, `git <https://git-scm.com> __ __ ஆதரிக்கப்படுகிறது, அதற்கு கைமுறையாக அல்லது பயன்படுத்தும் கோடோட் அறிவிலி சொருகி தேவைப்படுகிறது: குறிப்பு:` சொத்து நூலகம் <doc_using_assetlib> `. கோடோட் அறிவிலி சொருகி பற்றி மேலும் அறிய, அதன் `விக்கி <https://github.com/godotengine/godot-git-plugin/wiki> __.
uk: За бажанням можна вибрати систему контролю версій. Наразі підтримується лише `git <https://git-scm.com>`__, і для нього потрібно встановити плагін Godot Git вручну або за допомогою :ref:`Asset Library <doc_using_assetlib>`. Щоб дізнатися більше про плагін Godot Git, перегляньте його `wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__.
zh_cn: 你可以选择性地选择一个版本控制系统。目前仅支持 `git <https://git-scm.com>`__，并且需要安装 Godot Git 插件，可以手动安装或通过 :ref:`资产库 <doc_using_assetlib>` 安装。要了解有关 Godot Git 插件的更多信息，请参见其 `wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__。
zh_tw: 您可以選擇性地使用版本控制系統。目前僅支援 `git <https://git-scm.com>`__ ，並且需要安裝 Godot Git 外掛，您可以手動安裝或使用 :ref:`資源庫 <doc_using_assetlib>`。若要了解更多關於 Godot Git 外掛的資訊，請參閱其 `wiki <https://github.com/godotengine/godot-git-plugin/wiki>`__ 。

source: Using the file browser
de: Verwenden des Dateibrowsers
es: Usando el explorador de archivos
fr: Utiliser l'explorateur de fichiers
ga: Úsáid an brabhsálaí comhad
it: Utilizzare l'esploratore di file
ja: ファイルブラウザの使用
ru: Использование браузера файлов
ta: கோப்பு உலாவியைப் பயன்படுத்துதல்
tr: Dosya tarayıcısını kullanma
uk: Використання файлового браузера
zh_cn: 使用文件浏览器
zh_tw: 提供檔案

source: From the **Create New Project** window, click the **Browse** button to open Godot's file browser. You can pick a location or type the folder's path in the **Path** field, after choosing a drive.
fr: Depuis la fenêtre **Créer un nouveau projet**, cliquez sur le bouton **Navigation** pour ouvrir le navigateur de fichier de Godot. Vous pouvez choisir un emplacement ou tapez le chemin du dossier dans le champ **Chemin du projet**.
it: Dalla finestra **Crea nuovo progetto**, cliccare sul pulsante **Sfoglia** per aprire il browser di file di Godot. È possibile scegliere una posizione o digitare il percorso della cartella nel campo **Percorso**, dopo aver scelto un'unità.
ru: В окне **Create New Project (Создать новый проект)** нажмите кнопку **Browse (Обзор)**, чтобы открыть файловый браузер Godot. Вы можете выбрать местоположение или ввести путь к папке в поле **Path (Путь)**, выбрав диск.
ta: ** புதிய திட்டத்தை உருவாக்கு ** சாளரத்திலிருந்து, கோடோட்டின் கோப்பு உலாவியைத் திறக்க ** உலாவு ** பொத்தானைக் சொடுக்கு செய்க. நீங்கள் ஒரு இடத்தைத் தேர்வுசெய்யலாம் அல்லது கோப்புறையின் பாதையை ** பாதை ** புலத்தில் தட்டச்சு செய்யலாம், ஒரு இயக்ககத்தைத் தேர்ந்தெடுத்த பிறகு.
uk: У вікні **Створити новий проект** натисніть кнопку **Огляд**, щоб відкрити файловий браузер Godot. Ви можете вибрати розташування або ввести шлях до папки в полі **Шлях** після вибору диска.
zh_cn: 单击 **浏览** 按钮打开 Godot 的文件浏览器，然后选中某个位置，或者在 \ *项目路径* \字段中输入文件夹的路径。
zh_tw: 在 **建立新專案** 視窗中，點擊 **瀏覽** 按鈕以開啟 Godot 的檔案總管。選擇磁碟機後，您可以選擇一個位置，或在 **路徑** 欄位中輸入資料夾的路徑。

source: Left of the path field on the top row contains arrows to navigate backward and forward through the last visited locations. The up arrow navigates to parent folder. On the right side of the path field, there are buttons to refresh the current folder's contents, favorite/unfavorite the current folder, and show/hide hidden folders.
es: A la izquierda del campo de ruta, en la fila superior, se encuentran flechas para navegar hacia adelante y hacia atrás por las últimas ubicaciones visitadas. La flecha hacia arriba dirige a la carpeta principal. A la derecha del campo de ruta, hay botones para actualizar el contenido de la carpeta actual, marcarla como favorita o desmarcarla, y mostrar u ocultar las carpetas ocultas.
fr: À gauche du champ du chemin d'accès, sur la ligne supérieure, se trouvent des flèches permettant de naviguer parmi les derniers emplacements visités. La flèche vers le haut permet de naviguer vers le dossier parent. À droite du champ de chemin d'accès, des boutons permettent d'actualiser le contenu du dossier en cours, d'ajouter/retirer le dossier des favoris et d'afficher/masquer les dossiers cachés.
it: A sinistra del campo del percorso, nella riga superiore, ci sono le frecce per navigare avanti e indietro tra le ultime posizioni visitate. La freccia verso l'alto porta alla cartella principale. Sul lato destro del campo del percorso, ci sono i pulsanti per aggiornare il contenuto della cartella attuale, aggiungere/rimuovere la cartella attuale dai preferiti e mostrare/nascondere le cartelle nascoste.
pt_br: À esquerda do campo de caminho na linha superior, há setas para navegar para frente e para trás entre os últimos locais visitados. A seta para cima navega para a pasta pai. No lado direito do campo de caminho, há botões para atualizar o conteúdo da pasta atual, adicionar/remover a pasta atual dos favoritos e mostrar/ocultar pastas ocultas.
ru: Слева от поля пути в верхней строке находятся стрелки для перемещения назад и вперед по последним посещенным местам. Стрелка вверх осуществляет переход к родительской папке. Справа от поля пути находятся кнопки для обновления содержимого текущей папки, добавления/удаления текущей папки из избранного и отображения/скрытия скрытых папок.
ta: மேல் வரிசையில் உள்ள பாதை புலத்தின் இடதுபுறத்தில் கடைசியாக பார்வையிட்ட இடங்கள் வழியாக பின்தங்கிய மற்றும் முன்னோக்கி செல்ல அம்புகள் உள்ளன. அப் அம்பு பெற்றோர் கோப்புறையில் செல்கிறது. பாதை புலத்தின் வலது பக்கத்தில், தற்போதைய கோப்புறையின் உள்ளடக்கங்களைப் புதுப்பிக்க பொத்தான்கள் உள்ளன, பிடித்த/தற்போதைய கோப்புறையில் சாதகமாக இருக்கின்றன, மேலும் மறைக்கப்பட்ட கோப்புறைகளைக் காட்ட/மறைக்கவும்.
uk: Ліворуч від поля шляху у верхньому рядку містяться стрілки для навігації назад і вперед між останніми відвіданими місцями. Стрілка вгору веде до батьківської папки. Праворуч від поля шляху є кнопки для оновлення вмісту поточної папки, вибору/зняття з обраного поточної папки та показу/приховання прихованих папок.
zh_cn: 路径字段的左侧包含箭头，用于在最近访问的位置之间向后和向前导航。上箭头导航到父文件夹。路径字段的右侧有按钮，用于刷新当前文件夹的内容、收藏/取消收藏当前文件夹以及显示/隐藏隐藏文件夹。
zh_tw: 位於頂端路徑欄位左側的箭頭可以用於在最近瀏覽過的位置之間向後和向前導航。向上箭頭會導航至父資料夾。在路徑欄位的右側，有一些按鈕可以重新整理目前資料夾的內容、將目前資料夾加入/移除我的最愛，以及顯示/隱藏隱藏資料夾。
