Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/project_manager.po
Languages: de, es, fr, ga, it, ja, pt_br, ru, ta, tr, uk, zh_cn, zh_tw

source: Next, the buttons to switch the display type of the folders and files between grid view and list view are seen.
es: A continuación, se ven los botones para cambiar el tipo de visualización de las carpetas y archivos entre vista de cuadrícula y vista de lista.
fr: Ensuite, les boutons pour basculer le type d'affichage des dossiers et des fichiers entre grille et liste sont visibles.
it: Successivamente, sono visibili i pulsanti per cambiare il tipo di visualizzazione delle cartelle e dei file, tra visualizzazione a griglia e visualizzazione a elenco.
pt_br: Em seguida, são exibidos os botões para alternar o tipo de exibição das pastas e arquivos entre visualização em grade e visualização em lista.
ru: Далее видны кнопки переключения вида отображения папок и файлов между видом сетки и видом списка.
ta: அடுத்து, கோப்புறைகளின் காட்சி வகையையும் கட்டம் பார்வைக்கும் பட்டியல் பார்வைக்கும் இடையிலான கோப்புகளை மாற்றுவதற்கான பொத்தான்கள் காணப்படுகின்றன.
uk: Далі відображаються кнопки для перемикання типу відображення папок і файлів між переглядом таблиці та переглядом списку.
zh_cn: 接下来，可以看到用于切换文件夹和文件显示类型的按钮，分别是网格视图和列表视图。
zh_tw: 接下來，您會看到切換資料夾和檔案顯示方式的按鈕，可以在網格檢視和列表檢視之間切換。

source: The last button on the right will create a new folder.
fr: Le dernier bouton sur la droite créera un nouveau dossier.
it: L'ultimo pulsante sulla sinistra creerà una nuova cartella.
ru: Последняя кнопка справа создаст новую папку.
ta: வலதுபுறத்தில் கடைசி பொத்தானை ஒரு புதிய கோப்புறையை உருவாக்கும்.
uk: Остання кнопка праворуч створить нову папку.
zh_cn: 右侧的最后一个按钮将创建一个新文件夹。
zh_tw: 最右邊最後一個按鈕將會建立一個新的資料夾。

source: Favorited folders will be displayed on the left side under the **Favorites** section. You can sort the favorites using the up and down buttons in this section. Last chosen folders will be listed under the **Recent** list.
es: Las carpetas marcadas como favoritas se mostrarán a la izquierda, en la sección **Favoritos**. Puede ordenarlas con los botones arriba y abajo de esta sección. Las últimas carpetas seleccionadas aparecerán en la lista **Recientes**.
fr: Les dossiers favoris seront affichés sur le côté gauche sous la section **Favoris**. Vous pouvez trier les favoris en utilisant les boutons haut et bas dans cette section. Les dossiers choisis dernièrement seront listés sous la liste **Récent**.
it: Le cartelle preferite saranno mostrate sul lato sinistro, nella sezione **Preferiti**. È possibile ordinare i preferiti tramite i pulsanti su e giù in questa sezione. Le cartelle selezionate per ultime saranno mostrate nell'elenco **Recenti**.
pt_br: Pastas adicionadas aos favoritos serão exibidas no lado esquerdo, na seção **Favoritos**. Você pode ordenar os favoritos usando os botões de subir e descer nessa seção. As últimas pastas acessadas serão listadas em **Recentes**.
ru: Избранные папки будут отображаться слева в разделе **Избранное**. Вы можете сортировать избранное с помощью кнопок вверх и вниз в этом разделе. Последние выбранные папки будут перечислены в списке **Недавние**.
ta: ** பிடித்தவை ** பிரிவின் கீழ் இடது பக்கத்தில் பிடித்த கோப்புறைகள் காண்பிக்கப்படும். இந்த பிரிவில் உள்ள மேல் மற்றும் கீழ் பொத்தான்களைப் பயன்படுத்தி பிடித்தவைகளை நீங்கள் வரிசைப்படுத்தலாம். கடைசியாக தேர்ந்தெடுக்கப்பட்ட கோப்புறைகள் ** அண்மைக் கால ** பட்டியலின் கீழ் பட்டியலிடப்படும்.
uk: Вибрані папки відображатимуться ліворуч у розділі **Вибране**. Ви можете сортувати вибране за допомогою кнопок вгору та вниз у цьому розділі. Останні вибрані папки будуть перераховані у списку **Останні**.
zh_cn: 收藏的文件夹将显示在左侧的 **收藏** 部分。你可以使用该部分中的上下按钮对收藏进行排序。最后选择的文件夹将列在 **最近** 列表下。
zh_tw: 已收藏的資料夾會顯示在左側的 **我的最愛** 區塊下方。您可以使用此區塊中的上下按鈕來排序我的最愛。最近選擇的資料夾會列在 **最近** 清單下方。

source: Opening and importing projects
de: Öffnen und Importieren von Projekten
es: Abriendo e importando proyectos
fr: Ouvrir et importer des projets
ga: Tionscadail a oscailt agus
it: Apertura e importazione dei progetti
ja: プロジェクトを開いてインポートする
ru: Открывание и импортирование проектов
ta: திட்டங்களைத் திறந்து இறக்குமதி செய்தல்
tr: Projeleri açma ve içe aktarma
uk: Відкриття та імпорт проектів
zh_cn: 项目的打开与导入
zh_tw: 建立新專案

source: The next time you open the Project Manager, you'll see your new project in the list. Double click on it to open it in the editor.
de: Wenn Sie das nächste Mal den Projektmanager öffnen, sehen Sie Ihr neues Projekt in der Liste. Doppelklicken Sie darauf, um es im Editor zu öffnen.
es: La próxima vez que abras el Administrador de Proyectos, verás tu nuevo proyecto en la lista. Haz doble clic en él para abrirlo en el editor.
fr: La prochaine fois que vous ouvrirez le gestionnaire de projet, vous verrez votre nouveau projet dans la liste. Double cliquez dessus pour l'ouvrir dans l'éditeur.
ga: An chéad uair eile a osclaíonn tú an Bainisteoir Tionscadail, feicfidh tú do thionscadal nua ar an liosta. Cliceáil faoi dhó air chun é a oscailt san eagarthóir.
it: La prossima volta che si aprirà il Gestore dei progetti, apparirà il nuovo progetto nell'elenco. Fare doppio clic su di esso per aprirlo nell'editor.
ja: 次回プロジェクトマネージャーを開くと、リストに新しいプロジェクトが表示されます。それをダブルクリックするとエディタで開けます。
pt_br: Na próxima vez que você abrir o Gerenciador de Projetos, verá seu novo projeto na lista. Dê um duplo clique nele para abri-lo no editor.
ru: Когда вы в следующий раз откроете Менеджер проектов, вы увидите в списке свой новый проект. Дважды щелкните по нему, чтобы открыть его в редакторе.
ta: அடுத்த முறை நீங்கள் திட்ட மேலாளரைத் திறக்கும்போது, உங்கள் புதிய திட்டத்தை பட்டியலில் காண்பீர்கள். அதை எடிட்டரில் திறக்க அதை இருமுறை சொடுக்கு செய்க.
tr: Proje Yöneticisini bir sonraki açışınızda, yeni projenizi listede göreceksiniz. Düzenleyicide açmak için üzerine çift tıklayın.
uk: Наступного разу, коли ви відкриєте менеджер проектів, ви побачите свій новий проект у списку. Двічі клацніть по ньому, щоб відкрити його в редакторі.
zh_cn: 下次打开项目管理器时，你将在列表中看到你的新项目。 双击它以在编辑器中将它打开。
zh_tw: 下次打開專案管理器時，你將在列表中看到你的新專案。 按兩下它以在編輯器中將它打開。

source: You can similarly import existing projects using the **Import** button. Locate the folder that contains the project or the **project.godot** file to import and edit it.
de: Sie können vorhandene Projekte auch über den **Importieren**-Button importieren. Suchen Sie den Ordner, der das Projekt oder die Datei **project.godot** enthält um es zu importieren und zu bearbeiten.
es: De manera similar, puedes importar proyectos existentes usando el botón **Importar**. Localiza la carpeta que contiene el proyecto o el archivo **project.godot** para importarlo y editarlo.
fr: Vous pouvez également importer des projets existants en utilisant le bouton **Importer**. Localisez le dossier qui contient le projet ou le ficher **project.godot** pour l'importer et le modifier.
ga: Is féidir leat tionscadail atá ann cheana a iompórtáil ar an gcaoi chéanna ag baint úsáide Aimsigh an fillteán ina bhfuil an tionscadal nó an comhad**project.godot** chun é a iompórtáil agus a chur in eagar.
it: In modo simile, è possibile importare progetti esistenti tramite il pulsante **Importa**. Individuare la cartella che contiene il progetto o il file **project.godot** per importarlo e modificarlo.
ja: **インポート** ボタンを使用して既存のプロジェクトをインポートできます。プロジェクトまたは **project.godot** ファイルが含まれるフォルダを見つけて、インポートすると編集することができます。
pt_br: Você também pode importar projetos existentes usando o botão **Importar**. Localize a pasta que contém o projeto ou o arquivo **project.godot** para importar e editá-lo.
ru: Аналогичным образом можно импортировать существующие проекты с помощью кнопки **Импорт**. Найдите папку, содержащую проект или файл **project.godot** для импорта, и отредактируйте его.
ta: ** இறக்குமதி ** பொத்தானைப் பயன்படுத்தி இருக்கும் திட்டங்களை இதேபோல் இறக்குமதி செய்யலாம். அதை இறக்குமதி செய்து திருத்துவதற்கு திட்டம் அல்லது ** Project.godot ** கோப்பைக் கொண்ட கோப்புறையைக் கண்டறியவும்.
tr: Benzer şekilde **İçe Aktar** düğmesini kullanarak mevcut projeleri içe aktarabilirsiniz. İçe aktarılacak projeyi veya **project.godot** dosyasını içeren klasörü bulun ve düzenleyin.
uk: Ви також можете імпортувати існуючі проекти за допомогою кнопки **Імпортувати**. Знайдіть папку, яка містить проект або файл **project.godot**, щоб імпортувати та редагувати його.
zh_cn: 同样地，你可以使用\ *导入*\ 按钮导入现有项目。 找到包含项目或 **project.godot** 文件的文件夹以导入并编辑它。
zh_tw: 您也可以使用 **匯入** 按鈕來匯入現有的專案。找到包含專案的資料夾或 **project.godot** 檔案，即可匯入並編輯。

source: Alternatively, it is possible to choose a zip file to be automatically extracted by Godot.
es: Alternativamente, es posible elegir un archivo zip para que Godot lo extraiga automáticamente.
fr: Alternativement, il est possible de choisir un fichier zip qui sera automatiquement extrait par Godot.
it: In alternativa, è possibile scegliere un file zip che verrà estratto automaticamente da Godot.
pt_br: Alternativamente, é possível escolher um arquivo zip para ser extraído automaticamente pelo Godot.
ru: Кроме того, можно выбрать zip-файл, который будет автоматически распакован программой Godot.
ta: மாற்றாக, கோடோட் தானாக பிரித்தெடுக்க ஒரு சிப் கோப்பைத் தேர்வுசெய்ய முடியும்.
uk: Крім того, можна вибрати zip-файл, який Godot автоматично розпакує.
zh_cn: 另外，你也可以选择一个 zip 文件，让 Godot 自动解压。
zh_tw: 或者，也可以選擇一個 ZIP 壓縮檔讓 Godot 自動解壓縮。

source: When the folder path is correct, you'll see a green checkmark.
de: Wenn der Ordnerpfad korrekt ist, werden Sie einen grünen Haken sehen.
es: Cuando la ruta de la carpeta es correcta, verás una marca de verificación verde.
fr: Lorsque le chemin de dossier est correct, vous verrez une coche verte.
ga: Nuair a bhíonn cosán an fhillteáin ceart, feicfidh tú seicmharc glas.
it: Se il percorso della cartella è corretto, apparirà un segno di spunta verde.
ja: フォルダのパスが正しい場合は、緑色のチェックマークが表示されます。
pt_br: Quando o caminho da pasta estiver correto, você irá ver uma marca de seleção verde.
ru: Если путь к папке указан правильно, вы увидите зеленую галочку.
ta: கோப்புறை பாதை சரியாக இருக்கும்போது, நீங்கள் ஒரு பச்சை சரிபார்ப்பு அடையாளத்தைக் காண்பீர்கள்.
tr: Klasör yolu doğru olduğunda, yeşil bir onay işareti göreceksiniz.
uk: Якщо шлях до папки правильний, ви побачите зелену позначку.
zh_cn: 当文件夹路径正确时，你会看到一个绿色的对勾。
zh_tw: 當資料夾路徑正確時，你會看到一個綠色的對勾。

source: Downloading demos and templates
de: Herunterladen von Demos und Templates
es: Descargando demos y plantillas
fr: Télécharger des démos et des modèles
ga: Taispeántais agus teimpléid a í
it: Scaricare demo e modelli
ja: デモとテンプレートのダウンロード
ru: Скачивание демок и шаблонов
ta: டெமோக்கள் மற்றும் வார்ப்புருக்கள் பதிவிறக்குதல்
tr: Demoları ve şablonları indirme
uk: Завантаження демонстрацій і шаблонів
zh_cn: 下载演示和模板
zh_tw: 建置匯出樣板

source: From the **Asset Library** tab you can download open source project templates and demos from the :ref:`Asset Library <toc-learn-features-assetlib>` to help you get started faster.
fr: À partir de l'onglet **Bibliothèque de ressources de projets**, vous pouvez télécharger des modèles de projet open source et des démos à partir de :ref:`la bibliothèque de ressources <toc-learn-features-assetlib>` afin de vous aider à démarrer plus rapidement.
it: Dalla scheda **Libreria dei contenuti** si possono scaricare modelli di progetti open source e demo dalla :ref:`Libreria dei contenuti <toc-learn-features-assetlib>` per cominciare più velocemente.
ru: На вкладке **Asset Library (Библиотека активов)** вы можете загрузить шаблоны проектов с открытым исходным кодом и демонстрации из :ref:`Библиотеки активов <toc-learn-features-assetlib>`, которые помогут вам быстрее приступить к работе.
ta: ** சொத்து நூலகம் ** தாவலில் இருந்து நீங்கள் திறந்த மூல திட்ட வார்ப்புருக்கள் மற்றும் டெமோக்களை பதிவிறக்கம் செய்யலாம்: குறிப்பு: `சொத்து நூலகம் <TOC-LEARN-FEATURES-ASSETLIB>` விரைவாகத் தொடங்க உதவுகிறது.
uk: На вкладці **Бібліотека активів** ви можете завантажити шаблони проектів із відкритим вихідним кодом і демонстрації з :ref:`Asset Library <toc-learn-features-assetlib>`, щоб допомогти вам швидше розпочати роботу.
zh_cn: 在\ **资产库项目**\ 选项卡中，你可以从\ :ref:`资产库 <toc-learn-features-assetlib>`\ 下载开源项目模板和演示程序，以便更快地开始。
zh_tw: 從**素材庫**分頁，您可以從 :ref:`資源庫 <toc-learn-features-assetlib>` 下載開源專案範本和展示範例，以協助您更快上手。

source: The first time you open this tab you'll notice that it's asking you to go online. For privacy reasons the project manager, and Godot editor, can't access the internet by default. To enable accessing the internet click the **Go Online** button. This will also allow project manager to notify you about updates. If you wish to turn this off in the future go into project manager settings and change **Network Mode** to "Offline"
fr: La première fois que vous ouvrez cet onglet, vous remarquerez qu'il vous demande de se connecter. Pour des raisons de confidentialité, le gestionnaire de projet et l'éditeur Godot ne peuvent pas accéder à Internet par défaut. Pour activer l'accès à Internet, cliquez sur le bouton **Se connecter**. Cela permettra également au gestionnaire de projet de vous informer des mises à jour. Si vous souhaitez désactiver cette option dans le futur, allez dans les paramètres du gestionnaire de projet et changez **Mode réseau** en "Hors-ligne"
it: La prima volta che si aprirà questa scheda, chiederà di connettersi online. Per motivi di privacy, il gestore dei progetti e l'editor Godot non possono accedere a Internet per impostazione predefinita. Per abilitare l'accesso a Internet, cliccare sul pulsante **Vai online**. Ciò inoltre consentirà al gestore di notificare aggiornamenti. Se si desidera disattivare questa opzione in futuro, accedere alle impostazioni del gestore e cambiare **Modalità di rete** in "Offline"
ru: При первом открытии этой вкладки вы заметите, что она просит вас выйти в интернет. Из соображений конфиденциальности менеджер проекта и редактор Godot по умолчанию не могут получить доступ к интернету. Чтобы включить доступ в интернет, нажмите кнопку **Go Online**. Это также позволит менеджеру проекта уведомлять вас об обновлениях. Если вы захотите отключить это в будущем, перейдите в настройки менеджера проекта и измените **Network Mode (Сетевой режим)** на "Offline"
ta: இந்த தாவலை நீங்கள் முதன்முதலில் திறக்கும்போது, ஆன்லைனில் செல்லும்படி கேட்கிறது என்பதை நீங்கள் கவனிப்பீர்கள். தனியுரிமை காரணங்களுக்காக திட்ட மேலாளர் மற்றும் கோடோட் எடிட்டர், இயல்பாக இணையத்தை அணுக முடியாது. இணையத்தை அணுக உதவுவதற்கு ** ஆன்லைனில் ** பொத்தானைக் சொடுக்கு செய்க. இது புதுப்பிப்புகளைப் பற்றி உங்களுக்குத் தெரிவிக்க திட்ட மேலாளரை அனுமதிக்கும். எதிர்காலத்தில் இதை முடக்க விரும்பினால், திட்ட மேலாளர் அமைப்புகளுக்குச் சென்று ** பிணையம் பயன்முறையை ** "இணைப்பில்லாத" ஆக மாற்றவும்
uk: Коли ви вперше відкриєте цю вкладку, ви помітите, що вона просить вас вийти в Інтернет. З міркувань конфіденційності менеджер проекту та редактор Godot не можуть отримати доступ до Інтернету за умовчанням. Щоб увімкнути доступ до Інтернету, натисніть кнопку **Вийти в Інтернет**. Це також дозволить менеджеру проекту повідомляти вас про оновлення. Якщо ви захочете вимкнути це в майбутньому, перейдіть до налаштувань менеджера проекту та змініть **Режим мережі** на «Офлайн»
zh_cn: 第一次打开此选项卡时，你会注意到它要求你联机。出于隐私原因，项目管理器和 Godot 编辑器默认情况下无法访问互联网。要启用访问互联网，请点击 **联机** 按钮。这也将允许项目管理器通知你有关更新的信息。如果你希望在未来关闭此功能，请进入项目管理器设置并将 **网络模式** 更改为 **脱机**
zh_tw: 您第一次開啟這個頁籤時，會注意到它要求您連線到網路。基於隱私考量，專案管理器和 Godot 編輯器預設無法存取網路。若要啟用網路存取，請點擊 **連線** 按鈕。這也會允許專案管理器通知您有關更新。如果您希望日後關閉此功能，請前往專案管理器設定並將 **網路模式** 更改為 "離線"

source: Now that Godot is connected to the internet you can download a demo or template, to do this:
de: Da Godot nun mit dem Internet verbunden ist, können Sie eine Demo oder eine Vorlage herunterladen, um dies zu tun:
es: Ahora que Godot está conectado a Internet puedes descargar una demostración o plantilla. Para hacer esto:
fr: Maintenant que Godot est connecté à Internet, vous pouvez télécharger une démo ou un modèle, pour ce faire :
ga: Anois go bhfuil Godot ceangailte leis an idirlíon is féidir leat taispeáint nó teimpléad a íoslódáil, chun seo a dhéanamh:
it: Ora che Godot è connesso a Internet, si può scaricare una demo o un modello. Per fare ciò:
ja: Godotがインターネットに接続されたので、デモまたはテンプレートをダウンロードしてエディタで開くことができます。
pt_br: Agora que o Godot está conectado à internet, você pode baixar uma demonstração ou um modelo. Para fazer isso:
ru: Теперь, когда Godot подключён к интернету, вы можете загрузить демо или шаблон. Для этого:
ta: இப்போது கோடோட் இணையத்துடன் இணைக்கப்பட்டுள்ளது, இதைச் செய்ய நீங்கள் ஒரு டெமோ அல்லது வார்ப்புருவைப் பதிவிறக்கம் செய்யலாம்:
tr: Artık Godot internete bağlı olduğuna göre bir demo veya şablon indirebilirsiniz, bunu yapmak için:
uk: Тепер, коли Godot підключено до Інтернету, ви можете завантажити демонстрацію або шаблон, щоб зробити це:
zh_cn: 现在 Godot 已经连接到互联网，你可以下载演示项目或模板，要做到这一点：
zh_tw: 現在 Godot 已經連線到網路，您可以下載範例專案或樣板，操作步驟如下：

source: Click on its title.
de: Klicken Sie auf ihren Titel.
es: Clic en su título.
fr: Cliquer sur son titre.
ga: Cliceáil ar a theideal.
it: Cliccare sul suo titolo.
ja: タイトルをクリックします。
pt_br: Clique no título dele.
ru: Щелкните на название.
ta: அதன் தலைப்பைக் சொடுக்கு செய்க.
tr: Başlığına tıklayın.
uk: Натисніть на його назву.
zh_cn: 点击它的标题。
zh_tw: 點擊它的標題。

source: On the page that opens, click the download button.
de: Auf der Seite die sich öffnet, klicken Sie auf den Download-Button.
es: En a página que se abre, haz clic en el botón de descargar.
fr: Sur la page qui s'ouvre, cliquez sur le bouton de téléchargement.
ga: Ar an leathanach a osclaíonn, cliceáil ar an gcnaipe íoslódála.
it: Nella pagina che si apre, cliccare sul pulsante di download.
ja: 開いたページで、"ダウンロード" ボタンをクリックします。
ru: На открывшейся странице нажмите на кнопку скачивания.
ta: திறக்கும் பக்கத்தில், பதிவிறக்க பொத்தானைக் சொடுக்கு செய்க.
tr: Açılan sayfada indirme düğmesine tıklayın.
uk: На сторінці, що відкриється, натисніть кнопку завантаження.
zh_cn: 在打开的页面上，点击\ *下载*\ 按钮。
zh_tw: 在開啟的頁面中，點擊下載按鈕。

source: Once it finished downloading, click install and choose where you want to save the project.
de: Sobald der Download fertig ist, klicken Sie auf Installieren und wählen Sie einen Ort, an dem Sie das Projekt speichern möchten.
es: Una vez que haya terminado de descargar, haz clic en instalar y elige dónde quieres guardar el proyecto.
fr: Une fois le téléchargement terminé, cliquez sur installer et choisissez où vous voulez sauvegarder le projet.
ga: Nuair a bheidh an íoslódáil críochnaithe, cliceáil ar shuiteáil agus roghnaigh an áit ar mhaith leat an tionscadal a shábháil.
it: Una volta completato il download, cliccare su Installa e scegliere dove salvare il progetto.
ja: ダウンロードが完了したら、"インストール" をクリックし、プロジェクトを保存する場所を選択します。
pt_br: Depois que o download for concluído, clique em instalar e escolha onde você deseja salvar o projeto.
ru: После завершения загрузки нажмите кнопку "Установить" и выберите место, где вы хотите сохранить проект.
ta: பதிவிறக்குவதை முடித்தவுடன், நிறுவு என்பதைக் சொடுக்கு செய்து, திட்டத்தை நீங்கள் எங்கு சேமிக்க விரும்புகிறீர்கள் என்பதைத் தேர்வுசெய்க.
tr: İndirmeyi tamamladıktan sonra Kur'a tıklayın ve projeyi kaydetmek istediğiniz yeri seçin.
uk: Після завершення завантаження натисніть «Установити» та виберіть місце збереження проекту.
zh_cn: 下载完成后，点击\*安装*\ 并选择你想要保存项目的位置。
zh_tw: 一旦下載完成，點擊\\\\*安裝*並選擇你想要保存專案的位置。

source: Managing projects with tags
de: Projekte mit Tags verwalten
es: Administrar el proyecto con etiquetas
fr: Gérer des projects avec des tags
ga: Bainistiú tionscadail le clibe
it: Gestione dei progetti con etichette
ja: タグを使用したプロジェクトの管理
ru: Менеджмент проектов с помощью тегов
ta: குறிச்சொற்களுடன் திட்டங்களை நிர்வகித்தல்
tr: Projeleri etiketlerle yönetme
uk: Управління проектами за допомогою тегів
zh_cn: 用标签管理项目
zh_tw: 使用標籤管理專案

source: For users with a lot of projects on one PC it can be a lot to keep track of. To aid in this Godot allows you to create project tags. To add a tag to a project click on the project in the project manager, then click on the **Manage Tags** button
fr: Pour les utilisateurs avec énormément de projets sur leur PC, il peut être compliqué de tout gérer. Pour les aider, Godot permet de créer des balises. Pour ajouter une balise à un projet, cliquez sur le projet dans le gestionnaire de projet puis cliquez sur le bouton **Gérer les Balises**
it: Per gli utenti con molti progetti su un PC, tenere traccia di tutto può essere complicato. Per facilitarlo, Godot consente di creare etichette di progetto. Per aggiungere un tag a un progetto, cliccare sul progetto nel gestore dei progetti, poi sul pulsante **Gestisci etichette**
ru: Для пользователей с большим количеством проектов на одном ПК может быть сложно отслеживать все. Чтобы помочь в этом, Godot позволяет создавать теги проектов. Чтобы добавить тег к проекту, щелкните по проекту в менеджере проектов, затем щелкните по кнопке **Manage Tags (Управление тегами)**
ta: ஒரு கணினியில் நிறைய திட்டங்களைக் கொண்ட பயனர்களுக்கு இது கண்காணிக்க நிறைய இருக்கும். இந்த கோடோட்டில் உதவுவது திட்ட குறிச்சொற்களை உருவாக்க உங்களை அனுமதிக்கிறது. ஒரு திட்டத்தில் ஒரு குறிச்சொல்லைச் சேர்க்க திட்ட மேலாளரில் உள்ள திட்டத்தைக் சொடுக்கு செய்து, பின்னர் ** குறிச்சொற்களை நிர்வகி ** பொத்தானைக் சொடுக்கு செய்க
uk: Для користувачів із великою кількістю проектів на одному комп’ютері це може бути багато для відстеження. Щоб допомогти в цьому, Godot дозволяє створювати теги проекту. Щоб додати тег до проекту, клацніть проект у менеджері проектів, а потім натисніть кнопку **Керувати тегами**
zh_cn: 对于在一台 PC 上有很多项目的用户来说，记录项目的进度可能会很累人。为了帮助解决这一问题，Godot 允许你创建项目标签。要向项目添加标签，请在项目管理器中点击项目，然后点击 **管理标签** 按钮
zh_tw: 對於在同一台電腦上有許多專案的使用者來說，追蹤這些專案可能會很麻煩。為了協助管理，Godot 允許您建立專案標籤。若要為專案新增標籤，請在專案管理器中點擊該專案，然後點擊 **管理標籤** 按鈕

source: This will open up the manage project tags window. To add a tag click the plus button.
de: Daraufhin öffnet sich das Fenster zum Verwalten von Projekt-Tags. Um ein Tag hinzuzufügen, klicken Sie auf den Plus-Button.
es: Esto abrirá la ventana de administración de etiquetas de proyecto. Para agregar una etiqueta, haz clic en el botón más.
fr: Cela ouvrira la fenêtre de gestion des balises de projet. Cliquez sur le bouton "plus" pour ajouter une balise.
ga: Osclóidh sé seo fuinneog clibeanna tionscadail bainistíochta. Chun clib a chur leis cliceáil ar an gcnaipe móide.
it: Si aprirà la finestra "Gestisci le etichette di progetto". Per aggiungere un'etichetta, cliccare sul pulsante "più".
pt_br: Isso abrirá a janela de gerenciamento de tags do projeto. Para adicionar uma tag, clique no botão de mais.
ru: Это откроет окно управления тегами проектов. Чтобы добавить тег, нажмите кнопку плюс.
ta: இது திட்ட குறிச்சொற்கள் சாளரத்தை நிர்வகிக்கும். குறிச்சொல்லைச் சேர்க்க பிளச் பொத்தானைக் சொடுக்கு செய்க.
tr: Bu proje etiketlerini yönetim penceresini açacaktır. Bir etiket eklemek için artı düğmesine tıklayın.
uk: Це відкриє вікно керування тегами проекту. Щоб додати тег, натисніть кнопку з плюсом.
zh_cn: 这将打开管理项目标签窗口。要添加一个标签，点击加号按钮。
zh_tw: 這會開啟專案標籤管理視窗。若要新增標籤，請點擊加號按鈕。
