Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/project_manager.po
Languages: de, es, fr, ga, it, ja, pt_br, ru, ta, tr, uk, zh_cn, zh_tw

source: Type out the tag name, and click **OK**. Your project will now have a tag added to it. These tags can be used for any other project in your project manager.
fr: Tapez le nom de la balise et cliquer sur **OK**. Votre projet a maintenant une nouvelle balise qui lui est associée. Ces balises peuvent être utilisées pour n'importe quel projet dans votre gestionnaire de projet.
it: Digitare il nome dell'etichetta e cliccare su **OK**. Il tuo progetto avrà ora un'etichetta aggiunta. Queste etichette si possono utilizzare per qualsiasi altro progetto nel proprio gestore dei progetti.
ru: Напишите имя тега и нажмите **OK**. Теперь у вашего проекта есть тег. Эти теги могут использоваться для любого вашего проекта в вашем менеджере проектов. Они сохраняются вместе с проектами. Поэтому если вы добавите тег к вашему проекту и отправите его другому устройству и импортируете его в менеджере проектов, то увидите созданный вами тег.
ta: குறிச்சொல் பெயரைத் தட்டச்சு செய்து, ** சரி ** என்பதைக் சொடுக்கு செய்க. உங்கள் திட்டத்தில் இப்போது ஒரு குறிச்சொல் சேர்க்கப்படும். இந்த குறிச்சொற்கள் உங்கள் திட்ட மேலாளரின் வேறு எந்த திட்டத்திற்கும் பயன்படுத்தப்படலாம்.
uk: Введіть назву тегу та натисніть **ОК**. Тепер до вашого проекту буде додано тег. Ці теги можна використовувати для будь-якого іншого проекту у вашому менеджері проектів.
zh_cn: 输入标签名称，然后点击 **确定** 。现在一个标签就添加到了你的项目上。这些标签可用于项目管理器中的其他所有项目。此外，标签会跟随项目本身。因此如果你给项目打上了标签，将其发送到另一台机器，并导入到项目管理器中，你将看到你创建的标签。
zh_tw: 輸入標籤名稱，然後點擊 **確定** 。您的專案現在會新增一個標籤。這些標籤可以用於專案管理器中的任何其他專案。

source: To show projects with a specific tag only, you can click on the tags or write ``tag:`` and type the tag you would like to search for in the filter bar. To limit the results using multiple tags, you can click on another tag or add ``tag:`` after a space and type another tag in the filter bar.
es: Para mostrar solo proyectos con una etiqueta específica, puede hacer clic en las etiquetas o escribir ``tag:`` y escribir la etiqueta que desea buscar en la barra de filtros. Para limitar los resultados usando varias etiquetas, puede hacer clic en otra etiqueta o añadir ``tag:`` después de un espacio y escribir otra etiqueta en la barra de filtros.
fr: Pour montrer seulement les projets avec une balise spécifique, vous pouvez cliquer sur les balises ou écrire ``tag:`` et taper la balise que vous recherchez dans la barre de filtrage. Pour limiter les résultats en utilisant plusieurs tags, vous pouvez cliquer sur une autre balise ou ajouter ``tag:`` après un espace et taper une autre balise dans la barre de filtrage.
it: Per mostrare solo i progetti con un'etichetta specifica, si puoi cliccare sull'etichetta o scrivere ``tag:`` e digitare l'etichetta da cercare nella barra di ricerca. Per limitare i risultati tramite più etichette, si può cliccare su un'altra etichetta o aggiungere ``tag:`` dopo uno spazio e digitare un altra etichetta nella barra di ricerca.
pt_br: Para exibir somente projetos com uma tag específica, você pode clicar nas tags ou escrever ``tag:`` e digitar a tag que deseja buscar na barra de filtro. Para limitar os resultados usando múltiplas tags, você pode clicar em outra tag ou adicionar ``tag:`` após um espaço e digitar outra tag na barra de filtro.
ru: Чтобы отобразить проекты только с определенным тегом, вы можете нажать на теги или написать ``tag:`` и ввести тег, который вы хотите найти, в строке фильтра. Чтобы ограничить результаты с помощью нескольких тегов, вы можете нажать на другой тег или добавить ``tag:`` после пробела и ввести другой тег в строке фильтра.
ta: ஒரு குறிப்பிட்ட குறிச்சொல்லுடன் மட்டுமே திட்டங்களைக் காண்பிக்க, நீங்கள் குறிச்சொற்களைக் சொடுக்கு செய்யலாம் அல்லது `` குறிச்சொல்: `` மற்றும் வடிகட்டி பட்டியில் நீங்கள் தேட விரும்பும் குறிச்சொல்லை தட்டச்சு செய்யலாம். பல குறிச்சொற்களைப் பயன்படுத்தி முடிவுகளை கட்டுப்படுத்த, நீங்கள் மற்றொரு குறிச்சொல்லைக் சொடுக்கு செய்யலாம் அல்லது `` குறிச்சொல்: `` ஒரு இடத்திற்குப் பிறகு மற்றும் வடிகட்டி பட்டியில் மற்றொரு குறிச்சொல்லை தட்டச்சு செய்யலாம்.
uk: Щоб показати проекти лише з певним тегом, ви можете натиснути на теги або написати ``tag:`` і ввести тег, який ви хочете знайти, на панелі фільтрів. Щоб обмежити результати за допомогою кількох тегів, ви можете клацнути інший тег або додати ``tag:`` після пробілу та ввести інший тег на панелі фільтрів.
zh_cn: 要仅显示具有特定标签的项目，你可以点击标签或在筛选栏中输入 ``tag:`` 并输入你想搜索的标签。要使用多个标签来限制结果，可以点击另一个标签，或者在空格后添加 ``tag:`` 并在筛选栏中输入另一个标签。
zh_tw: 若要僅顯示具有特定標籤的專案，您可以點擊標籤，或在篩選列中輸入 ``tag:`` 後加上您想搜尋的標籤。若要使用多個標籤限制結果，您可以點擊另一個標籤，或在空格後新增 ``tag:`` 並在篩選列中輸入另一個標籤。

source: In addition, tags will stay with projects. So if you tag your project, send it to another machine, and import it into the project manager you will see the tags you created.
fr: De plus ces balises restes attachées aux projets. Donc si vous attachez une balise à votre projet, que vous l'envoyez sur une autre machine et que vous l'importez dans un autre gestionnaire de projet, vous verrez les balises que vous avez créé.
it: In più, le etichette rimarranno associate ai progetti. Pertanto, se si etichetta un progetto, viene inviato a un altro computer e viene importato nel gestore dei progetti, saranno visibili le etichette create.
ru: Кроме того, теги останутся с проектами. Так что если вы пометите свой проект, отправите его на другую машину и импортируете в менеджер проектов, вы увидите теги, которые вы создали.
ta: கூடுதலாக, குறிச்சொற்கள் திட்டங்களுடன் இருக்கும். எனவே உங்கள் திட்டத்தை நீங்கள் குறிக்கவும், அதை வேறொரு இயந்திரத்திற்கு அனுப்பி, அதை திட்ட மேலாளருக்கு இறக்குமதி செய்தால், நீங்கள் உருவாக்கிய குறிச்சொற்களைக் காண்பீர்கள்.
uk: Крім того, теги залишаться в проектах. Отже, якщо ви позначите свій проект, надішлете його на іншу машину та імпортуєте в менеджер проектів, ви побачите теги, які ви створили.
zh_cn: 此外，标签会跟随项目本身。因此如果你给项目打上了标签，将其发送到另一台机器，并导入到项目管理器中，你将看到你创建的标签。
zh_tw: 此外，標籤也會隨著專案保留下來。所以如果您標記了您的專案，將它傳送到另一台電腦，然後匯入到專案管理器中，您將會看到您建立的標籤。

source: To remove a tag from your project manager it must be removed from all the projects it's used by. Once that's done close the project manager, open it up again, and the tag should be gone.
de: Um ein Tag aus dem Projektmanager zu entfernen, muss er aus allen Projekten entfernt werden, in denen er verwendet wird. Schließen Sie dann den Projektmanager, öffnen Sie ihn erneut, und der Tag sollte verschwunden sein.
es: Para eliminar una etiqueta de su administrador de proyectos, debe eliminarla de todos los proyectos que la utilizan. Una vez hecho esto, cierre el administrador de proyectos, ábralo nuevamente y la etiqueta debería desaparecer.
fr: Pour supprimer une balise de votre gestionnaire de projet, elle doit être supprimée de tous les projets auxquels elle est attachée. Une fois que c'est fait, fermez le gestionnaire de projet, ouvrez le à nouveau et la balise devrait avoir disparue.
ga: Chun clib a bhaint ó do bhainisteoir tionscadail caithfear é a bhaint as na tionscadail go léir a úsáideann sé. Nuair a bheidh sé sin déanta dún an bainisteoir tionscadail, oscail é arís, agus ba chóir go mbeadh an chlib imithe.
it: Per rimuovere un'etichetta dal proprio gestore dei progetti, è necessario rimuoverla da tutti i progetti in cui è utilizzata. Una volta fatto, chiudere il gestore, aprirlo nuovamente e l'etichetta dovrebbe essere scomparsa.
pt_br: Para remover uma tag do seu gerenciador de projetos, ela deve ser removida de todos os projetos nos quais está sendo usada. Depois de fazer isso, feche o gerenciador de projetos, abra-o novamente e a tag deverá ter desaparecido.
ru: Чтобы удалить тэг из вашего менеджера проектов, нужно удалить его из всех проектов в которых он используется. Если один раз это сделать, закрыть менеджер проектов и открыть его снова, то тэги уйдут.
ta: உங்கள் திட்ட மேலாளரிடமிருந்து ஒரு குறிச்சொல்லை அகற்ற, அது பயன்படுத்தும் அனைத்து திட்டங்களிலிருந்தும் அகற்றப்பட வேண்டும். அது முடிந்ததும் திட்ட மேலாளரை மூடிவிட்டு, அதை மீண்டும் திறந்து, குறிச்சொல் இல்லாமல் போய்விட வேண்டும்.
tr: Bir etiketi proje yöneticinizden kaldırmak için kullanıldığı tüm projelerden kaldırılması gerekir. Bu yapıldıktan sonra proje yöneticisini kapatın, tekrar açın ve etiket gitmiş olmalıdır.
uk: Щоб видалити тег із менеджера проектів, його потрібно видалити з усіх проектів, у яких він використовується. Коли це буде зроблено, закрийте менеджер проектів, відкрийте його знову, і тег повинен зникнути.
zh_cn: 要从项目管理器中删除一个标签，你必须从所有使用它的项目中都删除它。一但在项目管理器被关闭再打开它，这些标签都会不见。
zh_tw: 若要從專案管理器移除一個標籤，必須先將該標籤從所有使用它的專案中移除。完成後，關閉專案管理器再重新開啟，該標籤應該就會消失。

source: Recovery Mode
fr: Mode de récupération
it: Modalità di recupero
ru: Режим восстановления
ta: மீட்பு முறை
uk: Режим відновлення
zh_cn: 恢复模式
zh_tw: 恢復模式

source: If a project is immediately crashing on startup, or crashing frequently during editing it can be opened in recovery mode, to attempt to make it more stable while looking for the source of the crashing to fix it.
es: Si un proyecto se bloquea inmediatamente al iniciarse, o se bloquea con frecuencia durante la edición, se puede abrir en modo de recuperación para intentar hacerlo más estable mientras se busca la fuente del bloqueo para solucionarlo.
fr: Si un projet plante immédiatement au démarrage, ou plante fréquemment durant l'édition, il peut être ouvert en mode récupération pour tenter de le rendre plus stable pendant la recherche de la source du plantage pour le corriger.
it: Se un progetto si blocca immediatamente all'avvio o si blocca frequentemente durante la modifica, può essere aperto in modalità di recupero per tentare di renderlo più stabile e nel frattempo cercare la causa del crash per risolverla.
pt_br: Se um projeto estiver travando imediatamente ao iniciar ou travando com frequência durante a edição, ele pode ser aberto em modo de recuperação para tentar torná-lo mais estável enquanto você procura a causa dos travamentos para corrigi-la.
ru: Если проект сразу же вылетает при запуске или часто вылетает во время редактирования, его можно открыть в режиме восстановления, чтобы попытаться сделать его более стабильным, одновременно выявив источник сбоя и устранив его.
ta: தொடக்கத்தில் ஒரு திட்டம் உடனடியாக நொறுங்கினால், அல்லது திருத்துதல் போது அடிக்கடி செயலிழக்கச் செய்தால், அதை மீட்கும் பயன்முறையில் திறக்கலாம், அதை சரிசெய்ய செயலிழப்பின் மூலத்தைத் தேடும்போது அதை இன்னும் நிலையானதாக மாற்ற முயற்சிக்கவும்.
uk: Якщо проект негайно аварійно завершує роботу під час запуску або часто аварійно завершує роботу під час редагування, його можна відкрити в режимі відновлення, щоб спробувати зробити його більш стабільним, шукаючи джерело збою та виправити його.
zh_cn: 如果项目在启动时立即崩溃，或者在编辑过程中频繁崩溃，可以在恢复模式下打开该项目，尝试让项目更加稳定，从而寻找崩溃问题原因。
zh_tw: 如果專案在啟動時立即崩潰，或在編輯過程中頻繁崩潰，可以嘗試以安全模式開啟，以便在尋找崩潰原因並修復的同時，使其更穩定。

source: Usually a project should open in recovery mode automatically when you re-open it after a crash. If it doesn't you can manually open recovery mode by selecting the project in the project manager, to do that select the project from your list of projects, click the dropdown button next to the edit node, and select ``Edit in recovery mode``.
es: Normalmente, un proyecto debería abrirse en modo de recuperación automáticamente al reabrirlo tras un fallo. Si no es así, puede abrirlo manualmente seleccionando el proyecto en el administrador de proyectos. Para ello, selecciona el proyecto en la lista de proyectos, haz clic en el menú desplegable junto al nodo de edición y selecciona "Editar en modo de recuperación".
fr: Normalement un projet devrait s'ouvrir automatiquement en mode récupération quand vous le ré-ouvrez après un plantage. Si ce n'est pas le cas, vous pouvez ouvrir le mode récupération manuellement en sélectionnant le projet dans le Gestionnaire de projets. Pour faire cela, cliquez sur le bouton déroulant à côté du nœud édition, et sélectionnez ``Éditer en mode récupération``.
it: Solitamente, un progetto dovrebbe aprirsi automaticamente in modalità di recupero quando lo si riapre dopo un crash. Se no, è possibile farlo manualmente nel gestore dei progetti. Per fare ciò, selezionare il progetto dalla lista di progetti, cliccare sul pulsante a discesa accanto al pulsante Modifica e selezionare "Modifica in modalità di recupero".
pt_br: Normalmente, um projeto deve abrir automaticamente em modo de recuperação ao ser reaberto após um travamento. Caso isso não aconteça, você pode abrir manualmente o modo de recuperação selecionando o projeto no gerenciador de projetos. Para isso, selecione o projeto na sua lista de projetos, clique no botão de menu suspenso ao lado do botão de edição e selecione ``Editar em modo de recuperação``.
ru: Обычно проект должен автоматически открываться в режиме восстановления, когда вы повторно открываете его после сбоя. Если этого не происходит, вы можете вручную открыть режим восстановления, выбрав проект в менеджере проектов, для этого выберите проект из списка проектов, нажмите кнопку раскрывающегося списка рядом с узлом редактирования и выберите ``Редактировать в режиме восстановления``.
ta: விபத்துக்குப் பிறகு நீங்கள் அதை மீண்டும் திறக்கும்போது வழக்கமாக ஒரு திட்டம் தானாகவே மீட்பு பயன்முறையில் திறக்கப்பட வேண்டும். திட்ட மேலாளரில் திட்டத்தைத் தேர்ந்தெடுப்பதன் மூலம் மீட்பு பயன்முறையை கைமுறையாகத் திறக்க முடியும் என்றால், உங்கள் திட்டங்களின் பட்டியலிலிருந்து திட்டத்தைத் தேர்ந்தெடுத்து, திருத்து முனைக்கு அடுத்த டிராப்டவுன் பொத்தானைக் சொடுக்கு செய்து, `` மீட்பு பயன்முறையில் திருத்து என்பதைத் தேர்ந்தெடுக்கவும்.
uk: Зазвичай проект має відкриватися в режимі відновлення автоматично, коли ви знову відкриваєте його після збою. Якщо цього не відбувається, ви можете вручну відкрити режим відновлення, вибравши проект у менеджері проектів. Для цього виберіть проект зі свого списку проектів, натисніть кнопку спадного меню поруч із вузлом редагування та виберіть ``Редагувати в режимі відновлення``.
zh_cn: 通常情况下，项目在崩溃后重新打开时会自动进入恢复模式。如果没有自动进入恢复模式，你可以手动通过项目管理器选择项目来打开恢复模式。具体操作是：从项目列表中选择项目，点击编辑按钮旁边的下拉箭头，然后选择“在恢复模式下编辑”。
zh_tw: 通常專案在崩潰後重新開啟時，應該會自動進入救援模式。如果沒有，您可以手動開啟救援模式：在專案管理器中選擇該專案，要這麼做，請從您的專案列表中選取專案，點擊編輯按鈕旁的下拉選單按鈕，然後選擇 ``Edit in recovery mode`` 。

source: While in recovery mode the following are disabled:
fr: Lors du mode récupération, les fonctionnalités suivantes sont désactivées :
it: In modalità di recupero le seguenti funzioni sono disabilitate:
ru: В режиме восстановления отключены следующие функции:
ta: மீட்பு பயன்முறையில் பின்வருபவை முடக்கப்பட்டுள்ளன:
uk: У режимі відновлення вимкнено наступне:
zh_cn: 恢复模式下禁用了以下功能：
zh_tw: 在恢復模式中，以下功能將會停用：

source: Tool scripts
fr: Scripts d'outil
it: Script strumento (tool)
ru: Скрипты инструментов
ta: கருவி ச்கிரிப்ட்கள்
uk: Скрипти інструментів
zh_cn: 工具脚本
zh_tw: 工具腳本

source: Editor plugins
es: Plugins del editor
fr: Extensions pour l'éditeur
ga: Breiseáin eagarthóra
it: Estensioni per l'editor
pt_br: Plugins do editor
ru: Плагины редактора
ta: ஆசிரியர் செருகுநிரல்கள்
tr: Düzenleyici eklentileri
uk: Додатки редактора
zh_cn: 编辑器插件
zh_tw: 編輯器外掛程式

source: GDExtension addons
fr: Addons GDExtension
it: Componenti aggiuntivi in GDExtension
ru: GDExtension addons (дополнения)
uk: Надбудови GDExtension
zh_cn: GDExtension 插件
zh_tw: GDExtension 擴充套件

source: Automatic scene restoring
es: Restauración automática de escenas
fr: Restauration automatique de scène
it: Recupero automatico delle scene
ru: Автоматическое восстановление сцены
ta: தானியங்கி காட்சி மீட்டமைத்தல்
uk: Автоматичне відновлення сцени
zh_cn: 自动恢复场景
zh_tw: 自動場景回復

source: Running the project
es: Ejecutar el proyecto
fr: Exécuter le projet
it: Esecuzione del progetto
ru: Реализация проекта
ta: திட்டத்தை இயக்குகிறது
uk: Запуск проекту
zh_cn: 运行项目
zh_tw: 執行專案

source: It is recommended that you backup your project before editing it in recovery mode.
es: Se recomienda que hagas una copia de seguridad de tu proyecto antes de editarlo en el modo de recuperación.
fr: Il est recommandé de faire une sauvegarde du projet avant de l'éditer en mode récupération.
it: Si consiglia di effettuare un backup del progetto prima di modificarlo in modalità di recupero.
pt_br: É recomendável que você faça um backup do seu projeto antes de editá-lo em modo de recuperação.
ru: Рекомендуется создать резервную копию проекта перед его редактированием в режиме восстановления.
ta: உங்கள் திட்டத்தை மீட்பு பயன்முறையில் திருத்துவதற்கு முன்பு காப்புப் பிரதி எடுக்க பரிந்துரைக்கப்படுகிறது.
uk: Рекомендується створити резервну копію проекту перед редагуванням у режимі відновлення.
zh_cn: 建议在恢复模式下编辑项目之前，先备份你的项目。
zh_tw: 建議您在救援模式中編輯專案之前，先備份您的專案。

source: When you launch Godot, the first window you see is the Project Manager. It lets you create, remove, import, or play game projects.
de: Wenn Sie Godot starten, ist das erste Fenster, das Sie sehen, der Projektmanager. Hier können Sie Spieleprojekte erstellen, entfernen, importieren oder spielen.
ja: Godotを起動すると、最初に表示されるウィンドウはプロジェクトマネージャーです。ゲームプロジェクトを作成、削除、インポート、またはプレイできます。

source: To change the editors language click on the "Settings" Button in the top right corner.
de: Um die Sprache des Editors zu ändern, klicken Sie auf den Button "Einstellungen" in der oberen rechten Ecke.
ja: エディタの言語を変更するには、右上隅にある "設定" ボタンをクリックします。

source: Click the **New** button on the top-left of the window.
de: Klicken Sie auf den Button **Neu** oben links im Fenster.
ja: ウィンドウの左上にある **作成** ボタンをクリックします。

source: Give the project a name, choose an empty folder on your computer to save the files, and select a rendering backend.
de: Geben Sie dem Projekt einen Namen, wählen Sie einen leeren Ordner auf Ihrem Computer zum Speichern der Dateien aus und wählen Sie ein Rendering-Backend.
ja: プロジェクトに名前を付けて、ファイルを保存する空のフォルダを選択し、レンダリングバックエンドを選択します。

source: Click the **Browse** button to open Godot's file browser and pick a location or type the folder's path in the Project Path field.
de: Klicken Sie auf den **Durchsuchen**-Button, um den Dateibrowser von Godot zu öffnen, und wählen Sie einen Speicherort aus oder geben Sie den Pfad des Ordners in das Feld Projektpfad ein.
ja: **参照** ボタンをクリックし、ファイルブラウザを開いて場所を選択するか、プロジェクトパスのフィールドにフォルダのパスを入力します。

source: When you see the green tick on the right, it means the engine detects an empty folder. You can also click the **Create Folder** button to create an empty folder based on your project's name.
de: Wenn Sie das grüne Häkchen auf der rechten Seite sehen, bedeutet dies, dass die Engine einen leeren Ordner erkannt hat. Sie können auch auf den Button **Ordner erstellen** klicken, um einen leeren Ordner basierend auf dem Namen Ihres Projekts zu erstellen.
ja: 右側に緑色のチェックマークが表示されている場合は、エンジンが空のフォルダを検出したことを意味します。 **フォルダを作成** ボタンをクリックして、プロジェクトの名前に基づいて空のフォルダを作成することもできます。

source: From the **Asset Library Projects** tab you can download open source project templates and demos from the :ref:`Asset Library <doc_what_is_assetlib>` to help you get started faster.
de: Auf dem **Asset-Bibliotheks-Projekte**-Tab können Sie Open-Source-Projektvorlagen und Demos aus der :ref:`Asset-Bibliothek<doc_what_is_assetlib>` herunterladen, um Ihnen den Einstieg zu erleichtern.
ja: :ref:`アセットライブラリ <doc_what_is_assetlib>` タブから、オープン ソースのプロジェクトテンプレートとデモをダウンロードすると、より素早く開始できるようになります。

source: The first time you open this tab you'll notice that it's asking you to go online. For privacy reasons the project manager, and Godot editor, can't access the internet by default. To enable accessing the internet click the "Go Online" button. This will also allow project manager to notify you about updates. If you wish to turn this off in the future go into project manager settings and change "Network Mode" to "Offline"
de: Wenn Sie diesen Tab zum ersten Mal öffnen, werden Sie feststellen, dass Sie aufgefordert werden, online zu gehen. Aus Gründen des Datenschutzes können der Projektmanager und der Godot-Editor standardmäßig nicht auf das Internet zugreifen. Um den Internetzugang zu aktivieren, klicken Sie auf den Button "Online gehen". Dies ermöglicht es dem Projektmanager auch, Sie über Aktualisierungen zu informieren. Wenn Sie dies in Zukunft ausschalten möchten, gehen Sie in die Projektmanager-Einstellungen und ändern Sie "Netzwerkmodus" in "Offline"
ja: このタブを初めて開くと、オンラインに接続するように求められていることがわかります。プライバシーの理由から、プロジェクトマネージャーと Godotエディタはデフォルトではインターネットにアクセスできません。インターネットへのアクセスを有効にするには、"オンライン" ボタンをクリックします。これによりプロジェクトマネージャーがアップデートについて通知することもできます。将来これをオフにしたい場合はプロジェクト マネージャーの設定に移動し、"ネットワーク モード" を "オフライン" に変更します

source: For users with a lot of projects on one PC it can be a lot to keep track of. To aid in this Godot allows you to create project tags. To add a tag to a project click on the project in the project manager, then click on the "Manage Tags" button
de: Für Benutzer mit vielen Projekten auf einem PC kann es schwierig sein, den Überblick zu behalten. Um dies zu erleichtern, können Sie in Godot Projekt-Tags erstellen. Um ein Tag zu einem Projekt hinzuzufügen, klicken Sie im Projektmanager auf das Projekt und dann auf den Button "Tags verwalten"

source: Translation status
de: Übersetzungsstatus
ja: 翻訳ステータス
