Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/using_the_xr_editor.po
Languages: es, fr, it, ko, pt_br, ru, ta, uk, zh_cn, zh_hant

source: No Meta Quest 2 support due to the limited amount of memory on the device. However advanced users can grab the XR editor APK from the `download page <https://godotengine.org/download/preview/>`__ and sideload it onto their device if they desire to do so.
es: No es compatible con Meta Quest 2 debido a la memoria limitada del dispositivo. Sin embargo, los usuarios avanzados pueden descargar el APK del editor XR desde la página de descargas <https://godotengine.org/download/preview/>`__ y descargarlo en su dispositivo si lo desean.
fr: Pas de support du Meta Quest 2 en raison de la quantité limitée de mémoire sur l'appareil. Cependant, les utilisateurs avancés peuvent télécharger l'APK de l'éditeur XR depuis `la page de téléchargement <https://godotengine.org/download/preview/>`__ et le charger sur leur appareil s'ils le souhaitent.
it: Nessun supporto di Meta Quest 2 a causa della memoria limitata del dispositivo. Tuttavia, gli utenti più esperti possono scaricare l'APK dell'editor XR dalla `pagina di download <https://godotengine.org/download/preview/>`__ e installarlo sul proprio dispositivo, se lo desiderano.
ko: 기기에 메모리의 용량이 제한되어 Meta Quest 2는 지원되지 않습니다. 하지만 고급 사용자는 `다운로드 페이지 <https://godotengine.org/download/preview/>`__\ 에서 XR 편집기 APK를 다운로드하여 원하는 경우 사용자의 기기에 사이드로드할 수 있습니다.
pt_br: Sem suporte para o Meta Quest 2 devido à quantidade limitada de memória no dispositivo. No entanto, usuários avançados podem obter o APK do editor XR na `página de download <https://godotengine.org/download/preview/>`__ e instalá-lo manualmente em seus dispositivos, se desejarem.
ru: Нет поддержки Meta Quest 2 из-за ограниченного объема памяти на устройстве. Однако продвинутые пользователи могут взять APK-файл редактора XR со страницы загрузки <https://godotengine.org/download/preview/>`__ и загрузить его на свое устройство, если они этого хотят.
ta: சாதனத்தில் குறைந்த அளவு நினைவகம் காரணமாக மேவு குவெச்ட் 2 உதவி இல்லை. இருப்பினும் மேம்பட்ட பயனர்கள் `பதிவிறக்க பக்கத்திலிருந்து <https://godotengine.org/download/preview/> __ மற்றும் அவர்கள் விரும்பினால் அதை தங்கள் சாதனத்தில் பக்கவாட்டாக ஏற்றலாம்.
uk: Немає підтримки Meta Quest 2 через обмежений обсяг пам’яті на пристрої. Однак досвідчені користувачі можуть отримати файл APK редактора XR зі сторінки завантаження <https://godotengine.org/download/preview/>`__ і за бажанням завантажити його на свій пристрій.
zh_cn: 由于设备内存限制，不支持 Meta Quest 2。不过，高级用户可以从 `下载页面 <https://godotengine.org/download/preview/>`__ \ 获取 XR 编辑器 APK，并自行安装到设备上（如果他们希望这样做的话）。
zh_hant: 由於裝置記憶體有限，不支援 Meta Quest 2。不過進階使用者如有需要，可至 `下載頁面 <https://godotengine.org/download/preview/>`__ 取得 XR 編輯器 APK 並側載至裝置。

source: No gradle build support.
es: No hay soporte para compilación de Gradle.
fr: Pas de support de compilation gradle.
it: Nessun supporto per la compilazione Gradle.
ko: Gradle 빌드 지원이 없습니다.
pt_br: Não há suporte para compilação do Gradle.
ru: Поддержка сборки Gradle отсутствует.
ta: கிரேடில் உருவாக்க உதவி இல்லை.
uk: Немає підтримки збірки Gradle.
zh_cn: 不支持 gradle 构建。
zh_hant: 不支援 gradle 建置。

source: No support for Android plugins as they require gradle build support. GDExtension plugins are supported.
fr: Pas de support pour les plugins Android car ils nécessitent le support de la compilation gradle. Les plugins GDExtension sont pris en charge.
it: Nessun supporto per le estensioni Android, poiché richiedono il supporto per la compilazione Gradle. Le estensioni GDExtension sono supportate.
ko: Android 플러그인은 Gradle 빌드 지원이 필요하므로 지원이 없습니다. GDExtension 플러그인은 지원됩니다.
pt_br: Não há suporte para plugins do Android, pois eles exigem suporte para compilação do Gradle. Plugins GDExtension são suportados.
ru: Нет поддержки плагинов Android, так как для них требуется поддержка сборки Gradle. Поддерживаются плагины GDExtension.
ta: ஆண்ட்ராய்டு செருகுநிரல்களுக்கு கிரேடில் உருவாக்க உதவி தேவைப்படுவதால் அவர்களுக்கு எந்த ஆதரவும் இல்லை. Gdextension செருகுநிரல்கள் ஆதரிக்கப்படுகின்றன.
uk: Плагіни Android не підтримуються, оскільки вони потребують підтримки збірки gradle. Підтримуються плагіни GDExtension.
zh_cn: 不支持 Android 插件，因为需要 gradle 构建支持。支持 GDExtension 插件。
zh_hant: 不支援 Android 外掛程式，因為它們需要 gradle 建置支援。支援 GDExtension 外掛程式。

source: No C#/Mono support.
es: No hay soporte para C#/Mono.
fr: Pas de support C#/Mono.
it: Nessun supporto per C#/Mono.
ko: C#/Mono 지원이 없습니다.
pt_br: Sem suporte a C#/Mono.
ru: C#/Mono не поддерживается.
ta: சி#/மோனோ உதவி இல்லை.
uk: Не підтримується C#/Mono.
zh_cn: 不支持 C#/Mono。
zh_hant: \|eol\| 已停止支援。

source: No support for external script editors.
es: Sin soporte para editores de scripts externos.
fr: Editeurs de scripts externes non-supporté.
it: Nessun supporto per editor di script esterni.
ko: 외부 스크립트 편집기를 위한 지원이 없습니다.
pt_br: Sem suporte para editores de script externos.
ru: Внешние редакторы сценариев не поддерживаются.
ta: வெளிப்புற ச்கிரிப்ட் எடிட்டர்களுக்கு உதவி இல்லை.
uk: Немає підтримки зовнішніх редакторів скриптів.
zh_cn: 不支持外部脚本编辑器。
zh_hant: 尚未支援 MIDI 輸出。

source: While available, the *Vulkan Forward+* renderer is not recommended due to severe performance issues.
es: Aunque disponible, el renderizador *Vulkan Forward+* no está recomendado debido a los severos problemas de rendimiento.
fr: Bien que disponible, le moteur de rendu *Vulkan Forward+* n'est pas recommandé en raison de problèmes de performance graves.
it: Sebbene disponibile, il renderer *Vulkan Forward+* non è consigliato a causa di severi problemi di prestazioni.
ko: *Vulkan Forward+* 렌더러는 사용 가능하지만 심각한 성능 문제로 인해 권장되지 않습니다.
ru: Несмотря на доступность рендерера *Vulkan Forward+*, его использование не рекомендуется из-за серьезных проблем с производительностью.
ta: கிடைக்கும்போது, கடுமையான செயல்திறன் சிக்கல்கள் காரணமாக * வல்கன் ஃபார்வர்ட்+ * ரெண்டரர் பரிந்துரைக்கப்படவில்லை.
uk: Поки доступний, рендерер *Vulkan Forward+* не рекомендується через серйозні проблеми з продуктивністю.
zh_cn: *Vulkan Forward+* 渲染器虽然可用，但是由于存在严重的性能问题，所以不推荐使用。
zh_hant: *Vulkan Forward+* 著色器雖然可用，但是由於存在嚴重的效能問題，所以不推薦使用。
