Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/using_the_web_editor.po
Languages: ga, it, ta, tr

source: Using the Web editor
ga: Ag baint úsáide as an eagarthóir Gréasáin
it: Utilizzare l'editor web
ta: வலை எடிட்டரைப் பயன்படுத்துதல்
tr: Web düzenleyicisini kullanma

source: There is a `Web editor <https://editor.godotengine.org/>`__ you can use to work on new or existing projects.
it: Esiste un `editor Web <https://editor.godotengine.org/>`__ che si può utilizzare per lavorare su progetti nuovi o esistenti.
ta: `வலை ஆசிரியர் <https://editor.godotengine.org/> __ __ புதிய அல்லது ஏற்கனவே உள்ள திட்டங்களில் வேலை செய்ய நீங்கள் பயன்படுத்தலாம்.

source: The web editor is in a preliminary stage. While its feature set may be sufficient for educational purposes, it is currently **not recommended for production work**. See :ref:`doc_using_the_web_editor_limitations` below.
ga: Tá an t-eagarthóir gréasáin i réamhchéim. Cé go bhféadfadh a shraith gné a bheith leordhóthanach chun críocha oideachais, tá sé **ní mholtar faoi láthair le haghaidh obair léiriúcháin **. Féach :ref:'doc_using_the_web_editor_limitations' thíos.
it: L'editor web è in uno stato preliminare. Sebbene le sue funzionalità possano essere sufficienti per scopi didattici, al momento **non è consigliato per lavori di produzione**. Consultare :ref:`doc_using_the_web_editor_limitations` in seguito.
ta: வலை ஆசிரியர் ஒரு ஆரம்ப கட்டத்தில் இருக்கிறார். கல்வி நோக்கங்களுக்காக அதன் அம்சத் தொகுப்பு போதுமானதாக இருக்கலாம் என்றாலும், இது தற்போது ** விளைவாக்கம் பணிகளுக்கு பரிந்துரைக்கப்படவில்லை **. காண்க: குறிப்பு: `doc_using_the_web_editor_imitations` கீழே.
tr: Web düzenleyicisi ön hazırlık aşamasındadır. Özellik seti eğitim amaçları için yeterli olsa da, şu anda **üretim çalışmaları için önerilmemektedir**. Aşağıdaki :ref:`doc_using_the_web_editor_limitations` bölümüne bakınız.

source: Browser support
ga: Tacaíocht do bhrabhsálaí
it: Supporto dei browser
ta: உலாவி உதவி
tr: Tarayıcı desteği

source: The Web editor requires support for WebAssembly's SharedArrayBuffer. This is in turn required to support threading in the browser. The following desktop browsers support WebAssembly threading and can therefore run the web editor:
ga: Éilíonn an t-eagarthóir Gréasáin tacaíocht do SharedArrayBuffer WebAssembly. Tá sé seo ag teastáil ina dhiaidh sin chun tacú le snáitheáil sa bhrabhsálaí. Tacaíonn na brabhsálaithe deisce seo a leanas le snáitheáil WebAssembly agus dá bhrí sin is féidir leo an t-eagarthóir gréasáin a rith:
it: L'editor Web richiede il supporto per il SharedArrayBuffer di WebAssembly. Questo è a sua volta necessario per supportare più di un thread (threading) nel browser. I seguenti browser su desktop supportano il threading di WebAssembly e possono quindi eseguire l'editor Web:
ta: வலை எடிட்டருக்கு வெபாசெம்பிளியின் சேர்டாரே பஃபர் உதவி தேவை. உலாவியில் த்ரெடிங்கை ஆதரிக்க இது தேவை. பின்வரும் டெச்க்டாப் உலாவிகள் வெபாசெம்பிளி த்ரெடிங்கை ஆதரிக்கின்றன, எனவே வலை எடிட்டரை இயக்க முடியும்:
tr: Web düzenleyicisi, WebAssembly'nin SharedArrayBuffer desteğini gerektirir. Bu da tarayıcıda iş parçacıklarını desteklemek için gereklidir. Aşağıdaki masaüstü tarayıcıları WebAssembly iş parçacıklarını destekler ve bu nedenle web düzenleyicisini çalıştırabilir:

source: Chrome 68 or later
ga: Chrome 68 nó níos déanaí
it: Chrome 68 o versioni successive
ta: Chrome 68 அல்லது அதற்குப் பிறகு
tr: Chrome 68 veya üstü

source: Firefox 79 or later
ga: Firefox 79 nó níos déanaí
it: Firefox 79 o versioni successive
ta: பயர்பாக்ச் 79 அல்லது அதற்குப் பிறகு
tr: Firefox 79 veya üstü

source: Edge 79 or later
ga: Imeall 79 nó níos déanaí
it: Edge 79 o versioni successive
ta: எட்ச் 79 அல்லது அதற்குப் பிறகு
tr: Edge 79 veya üstü

source: Opera and Safari are not supported yet. Safari may work in the future once proper threading support is added.
ga: Ní thacaítear le Opera agus Safari go fóill. D'fhéadfadh Safari oibriú amach anseo nuair a chuirfear tacaíocht shnáthaithe chuí leis.
it: Opera e Safari non sono ancora supportati. Safari potrebbe funzionare in futuro, una volta aggiunto il supporto per più di un thread.
ta: ஓபரா மற்றும் சஃபாரி இன்னும் ஆதரிக்கப்படவில்லை. சரியான த்ரெட்டிங் உதவி சேர்க்கப்பட்டவுடன் சஃபாரி எதிர்காலத்தில் வேலை செய்யலாம்.
tr: Opera ve Safari henüz desteklenmemektedir. Safari, uygun iş parçacıkları desteği eklendiğinde gelecekte çalışabilir.

source: **Mobile browsers are currently not supported.**
ga: **Ní thacaítear le brabhsálaithe soghluaiste faoi láthair.**
it: **I browser mobili non sono attualmente supportati.**
ta: ** மொபைல் உலாவிகள் தற்போது ஆதரிக்கப்படவில்லை. **
tr: **Mobil tarayıcılar şu anda desteklenmemektedir.**

source: The web editor only supports the Compatibility rendering method, as there is no stable way to run Vulkan applications on the web yet.
ga: Ní thacaíonn an t-eagarthóir gréasáin ach leis an modh rindreáil Comhoiriúnachta, toisc nach bhfuil aon bhealach cobhsaí ann chun feidhmchláir Vulkan a reáchtáil ar an ngréasán go fóill.
it: L'editor Web supporta solo il metodo di rendering Compatibilità, poiché non esiste ancora un modo stabile per eseguire le applicazioni Vulkan sul Web.
ta: வலை ஆசிரியர் இணக்கத்தன்மை வழங்குதல் முறையை மட்டுமே ஆதரிக்கிறார், ஏனெனில் வல்கன் பயன்பாடுகளை வலையில் இயக்க இன்னும் நிலையான வழி இல்லை.
tr: Vulkan uygulamalarını web üzerinde çalıştırmanın henüz kararlı bir yolu olmadığından, web düzenleyicisi yalnızca Uyumluluk işleme yöntemini destekler.

source: If you use Linux, due to `poor Firefox WebGL performance <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>`__, it's recommended to use a Chromium-based browser instead of Firefox.
ga: Má úsáideann tú Linux, mar gheall ar `drochfheidhmíocht Firefox WebGL <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>`__, moltar brabhsálaí bunaithe ar Cróimiam a úsáid in ionad Firefox.
it: Se si utilizza Linux, a causa delle `scarse prestazioni di Firefox WebGL <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>`__, si consiglia di utilizzare un browser basato su Chromium al posto di Firefox.
ta: நீங்கள் லினக்சைப் பயன்படுத்தினால், `மோசமான பயர்பாக்ச் வெப்சிஎல் செயல்திறன் <https://bugzilla.mozilla.org/show_bug.cgi?
tr: Linux kullanıyorsanız, `zayıf Firefox WebGL performansı <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>`__ nedeniyle, Firefox yerine Chromium tabanlı bir tarayıcı kullanmanız önerilir.

source: Limitations
ga: Teorainneacha
it: Limitazioni
ta: வரம்புகள்
tr: Sınırlamalar

source: Due to limitations on the Godot or Web platform side, the following features are currently missing:
ga: Mar gheall ar theorainneacha ar thaobh ardán Godot nó Gréasáin, tá na gnéithe seo a leanas ar iarraidh faoi láthair:
it: A causa di limitazioni sul lato di Godot o della piattaforma Web, al momento mancano le seguenti funzionalità:
ta: கோடோட் அல்லது வலை இயங்குதள பக்கத்தில் உள்ள வரம்புகள் காரணமாக, பின்வரும் நற்பொருத்தங்கள் தற்போது காணவில்லை:
tr: Godot veya Web platformu tarafındaki sınırlamalar nedeniyle, aşağıdaki özellikler şu anda eksiktir:

source: No C#/Mono support.
ga: Gan tacaíocht C # / Mono.
it: Nessun supporto per C#/Mono.
ta: சி#/மோனோ உதவி இல்லை.
tr: C#/Mono desteği yok.

source: No GDExtension support.
ga: Gan tacaíocht GDExtension.
it: Nessun supporto per GDExtension.
ta: Gdextension உதவி இல்லை.
tr: GDExtension desteği yok.

source: No debugging support. This means GDScript debugging/profiling, live scene editing, the Remote Scene tree dock and other features that rely on the debugger protocol will not work.
ga: Gan tacaíocht dífhabhtaithe. Ciallaíonn sé seo nach n-oibreoidh dífhabhtú / próifíliú GDScript, eagarthóireacht radharc beo, duga crann Radharc cianda agus gnéithe eile atá ag brath ar phrótacal an dífhabhtóra.
it: Nessun supporto per il debugging. Ciò significa che il debugging/profiling di GDScript, la modifica delle scene in tempo reale, il pannello dell'albero di scene remoto e altre funzionalità che dipendono dal protocollo del debugger non funzioneranno.
ta: பிழைத்திருத்த உதவி இல்லை. இதன் பொருள் சி.டி.எச்ச்கிரிப்ட் பிழைத்திருத்தம்/விவரக்குறிப்பு, நேரடி காட்சி திருத்துதல், தொலைநிலை காட்சி மரம் கப்பல்துறை மற்றும் பிழைத்திருத்த நெறிமுறையை நம்பியிருக்கும் பிற நற்பொருத்தங்கள் இயங்காது.
tr: Hata ayıklama desteği yok. Bu, GDScript hata ayıklama/profil çıkarma, canlı sahne düzenleme, Uzak Sahne ağacı yuvası ve hata ayıklayıcı protokolüne dayanan diğer özelliklerin çalışmayacağı anlamına gelir.

source: No project exporting. As a workaround, you can download the project source using **Project > Tools > Download Project Source** and export it using a `native version of the Godot editor <https://godotengine.org/download>`__.
ga: Gan aon easpórtáil tionscadail. Mar réiteach oibre, is féidir leat foinse an tionscadail a íoslódáil trí úsáid a bhaint as **Project > Tools > Download Project Source** agus é a easpórtáil trí úsáid a bhaint as `leagan dúchasach d'eagarthóir Godot <https://godotenginine.org/download>`__.
it: Non è possibile esportare progetti. Come metodo alternativo, si può scaricare il codice sorgente del progetto tramite **Progetto > Strumenti > Scarica sorgente del progetto** ed esportarlo attraverso una `versione nativa dell'editor Godot <https://godotengine.org/download>`__.
ta: திட்ட ஏற்றுமதி இல்லை. ஒரு பணித்தொகுப்பாக, நீங்கள் ** திட்டம்> கருவிகள்> திட்ட மூலத்தை*பதிவிறக்கம் செய்து திட்ட மூலத்தைப் பதிவிறக்கம் செய்து, கோடோட் எடிட்டரின் `சொந்த பதிப்பைப் பயன்படுத்தி ஏற்றுமதி செய்யலாம் <https://godotengine.org/download> ____.
tr: Proje dışa aktarımı yok. Geçici bir çözüm olarak, **Proje > Araçlar > Proje Kaynağını İndir** seçeneğini kullanarak proje kaynağını indirebilir ve `Godot düzenleyicisinin yerel bir sürümünü <https://godotengine.org/download>`__ kullanarak dışa aktarabilirsiniz.

source: The editor won't warn you when closing the tab with unsaved changes.
ga: Ní thabharfaidh an t-eagarthóir rabhadh duit agus an cluaisín á dhúnadh le hathruithe gan sábháil.
it: L'editor non avviserà quando la scheda si chiude con modifiche non salvate.
ta: சேமிக்கப்படாத மாற்றங்களுடன் தாவலை மூடும்போது ஆசிரியர் உங்களுக்கு எச்சரிக்க மாட்டார்.
tr: Kaydedilmemiş değişiklikler varken sekmeyi kapatırken düzenleyici sizi uyarmaz.

source: No lightmap baking support. You can still use existing lightmaps if they were baked with a native version of the Godot editor (e.g. by importing an existing project).
ga: Níl aon tacaíocht bácála lightmap. Is féidir leat mapaí solais atá ann cheana a úsáid fós má bácáladh iad le leagan dúchasach d'eagarthóir Godot (m.sh. trí thionscadal atá ann cheana a iompórtáil).
it: Nessun supporto per la preparazione delle lightmap. È comunque possibile utilizzare le lightmap esistenti se sono state preparate con una versione nativa dell'editor Godot (ad esempio, importando un progetto esistente).
ta: லைட்மேப் பேக்கிங் உதவி இல்லை. கோடோட் எடிட்டரின் சொந்த பதிப்பில் (எ.கா. ஏற்கனவே இருக்கும் திட்டத்தை இறக்குமதி செய்வதன் மூலம்) அவை சுடப்பட்டால் நீங்கள் இன்னும் இருக்கும் லைட்மேப்களைப் பயன்படுத்தலாம்.
tr: Işık haritası pişirme desteği yok. Godot düzenleyicinin yerel bir sürümüyle (örneğin mevcut bir projeyi içe aktararak) pişirilmişlerse mevcut ışık haritalarını kullanmaya devam edebilirsiniz.

source: The following features are unlikely to be supported due to inherent limitations of the Web platform:
ga: Ní dócha go dtacófar leis na gnéithe seo a leanas mar gheall ar theorainneacha bunúsacha an ardáin Ghréasáin:
it: È poco probabile che le seguenti funzionalità siano supportate a causa delle limitazioni intrinseche della piattaforma Web:
ta: வலை தளத்தின் உள்ளார்ந்த வரம்புகள் காரணமாக பின்வரும் நற்பொருத்தங்கள் ஆதரிக்கப்பட வாய்ப்பில்லை:
tr: Aşağıdaki özelliklerin Web platformunun doğal sınırlamaları nedeniyle desteklenmesi olası değildir:

source: No support for external script editors.
ga: Gan tacaíocht d'eagarthóirí scripte seachtracha.
it: Nessun supporto per editor di script esterni.
ta: வெளிப்புற ச்கிரிப்ட் எடிட்டர்களுக்கு உதவி இல்லை.
tr: Harici betik düzenleyiciler için destek yok.

source: No support for Android one-click deploy.
ga: Níl aon tacaíocht do Android aon-cliceáil imscaradh.
it: Nessun supporto per la distribuzione con un clic su Android.
ta: ஆண்ட்ராய்டு ஒரு சொடுக்கு வரிசைப்படுத்தலுக்கு எந்த ஆதரவும் இல்லை.
tr: Android tek-tıkla dağıtım desteği yok.

source: See the `list of open issues on GitHub related to the web editor <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Aweb+label%3Atopic%3Aeditor>`__ for a list of known bugs.
it: Consultare l'elenco dei problemi aperti su GitHub riguardo l'`editor web <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Aweb+label%3Atopic%3Aeditor>`__ per un elenco dei bug conosciuti.
ta: வலை எடிட்டர் தொடர்பான கிட்அப்பில் திறந்த சிக்கல்களின் பட்டியலைக் காண்க <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3AISSUE+ சிட்டை மிக்கி

source: Importing a project
ga: Tionscadal á iompórtáil
it: Importare un progetto
ta: ஒரு திட்டத்தை இறக்குமதி செய்தல்
tr: Bir projeyi içe aktarma

source: To import an existing project, the current process is as follows:
ga: Chun tionscadal atá ann cheana a iompórtáil, is é seo a leanas an próiseas reatha:
it: Per importare un progetto esistente, il processo attuale è quanto seguente:
ta: ஏற்கனவே உள்ள திட்டத்தை இறக்குமதி செய்ய, தற்போதைய செயல்முறை பின்வருமாறு:
tr: Mevcut bir projeyi içe aktarmak için geçerli süreç aşağıdaki gibidir:

source: Specify a ZIP file to preload on the HTML5 filesystem using the **Preload project ZIP** input.
ga: Sonraigh comhad ZIP le réamhlódáil ar an gcóras comhad HTML5 ag baint úsáide as an ionchur **Preload project ZIP **.
it: Specificare un file ZIP da precaricare sul file system HTML5 attraverso l'input **Precarica progetto ZIP**.
ta: ** முன் ஏற்று திட்ட சிப் ** உள்ளீட்டைப் பயன்படுத்தி HTML5 கோப்பு முறைமையில் முன்பே ஏற்ற ஒரு சிப் கோப்பைக் குறிப்பிடவும்.
tr: HTML5 DosyaSistemi'ne önyüklenecek bir ZIP dosyasını **Preload project ZIP** girişini kullanarak belirtin.

source: Run the editor by clicking **Start Godot editor**. The Godot Project Manager should appear after 10-20 seconds. On slower machines or connections, loading may take up to a minute.
ga: Rith an t-eagarthóir trí chliceáil **Tosaigh eagarthóir Godot **. Ba chóir go mbeadh Bainisteoir Tionscadail Godot le feiceáil tar éis 10-20 soicind. Ar mheaisíní nó naisc níos moille, d'fhéadfadh luchtú suas le nóiméad a ghlacadh.
it: Avviare l'editor cliccando su **Avvia l'editor Godot**. Il Gestore dei progetti di Godot dovrebbe apparire dopo 10-20 secondi. Su computer o connessioni più lente, il caricamento potrebbe richiedere fino a un minuto.
ta: கோடோட் எடிட்டரைத் தொடங்கு ** சொடுக்கு செய்வதன் மூலம் ஆசிரியரை இயக்கவும் **. கோடோட் திட்ட மேலாளர் 10-20 வினாடிகளுக்குப் பிறகு தோன்ற வேண்டும். மெதுவான இயந்திரங்கள் அல்லது இணைப்புகளில், ஏற்றுவதற்கு ஒரு மணித்துளி வரை ஆகலாம்.
tr: **Start Godot editor** seçeneğine tıklayarak düzenleyiciyiçalıştırın. Godot Proje Yöneticisi 10-20 saniye sonra görünmelidir. Daha yavaş makinelerde veya bağlantılarda yükleme bir dakika kadar sürebilir.

source: In the dialog that appears at the middle of the window, specify a name for the folder to create then click the **Create Folder** button (it doesn't have to match the ZIP archive's name).
ga: Sa dialóg atá le feiceáil i lár na fuinneoige, sonraigh ainm don fhillteán le cruthú ansin cliceáil ar an gcnaipe **Cruthaigh Fillteán ** (ní gá ainm na cartlainne ZIP a mheaitseáil).
it: Nella finestra di dialogo che appare al centro della finestra, specificare un nome per la cartella da creare, quindi cliccare sul pulsante **Crea cartella** (non deve necessariamente corrispondere al nome dell'archivio ZIP).
ta: சாளரத்தின் நடுவில் தோன்றும் உரையாடலில், கோப்புறையின் பெயரைக் குறிப்பிடவும், பின்னர் ** கோப்புறை ** பொத்தானைக் சொடுக்கு செய்க (இது சிப் காப்பகத்தின் பெயருடன் பொருந்த வேண்டியதில்லை).
tr: Pencerenin ortasında görünen iletişim kutusunda, oluşturulacak klasör için bir ad belirleyin ve ardından **Create Folder** düğmesine tıklayın (ZIP arşivinin adıyla eşleşmesi gerekmez).

source: Click **Install & Edit** and the project will open in the editor.
ga: Cliceáil **Suiteáil agus Edit** agus osclófar an tionscadal san eagarthóir.
it: Cliccare su **Installa e modifica** e il progetto si aprirà nell'editor.
ta: ** நிறுவவும் திருத்து ** என்பதைக் சொடுக்கு செய்யவும், மேலும் திட்டம் எடிட்டரில் திறக்கப்படும்.
tr: **Install & Edit** seçeneğine tıkladığınızda proje düzenleyicide açılacaktır. (Web düzenleyici açıldığında, sağ üst köşedeki "settings" tıklayıp, "Language" menüsünden dili Türkçe yapabilirsiniz, dosyayı yeniden yüklemeniz gerekebilir).

source: It's important to place the project folder somewhere in ``/home/web_user/``. If your project folder is placed outside ``/home/web_user/``, you will lose your project when closing the editor!
ga: Tá sé tábhachtach fillteán an tionscadail a chur áit éigin i ''/home/web_user/''. Má chuirtear fillteán do thionscadail lasmuigh de ''/home/web_user/'', caillfidh tú do thionscadal agus an t-eagarthóir á dhúnadh agat!
it: È importante posizionare la cartella del progetto da qualche parte in ``/home/web_user/``. Se la cartella del progetto si trova all'esterno di ``/home/web_user/``, il progetto verrà perso alla chiusura dell'editor!
ta: திட்டக் கோப்புறையை ``/home/web_user/`` இல் எங்காவது வைப்பது முதன்மை. உங்கள் திட்ட கோப்புறை ``/home/web_user/`வெளியே வைக்கப்பட்டால், எடிட்டரை மூடும்போது உங்கள் திட்டத்தை இழப்பீர்கள்!
tr: Proje klasörünü ``/home/web_user/`` içinde bir yere yerleştirmek önemlidir. Proje klasörünüz ``/home/web_user/`` dışında bir yere yerleştirilirse, düzenleyiciyi kapatırken projenizi kaybedersiniz!

source: When you follow the steps described above, the project folder will always be located in ``/home/web_user/projects``, keeping it safe.
ga: Nuair a leanann tú na céimeanna a bhfuil cur síos orthu thuas, beidh fillteán an tionscadail suite i gcónaí in ''/home/web_user/projects'', agus é a choinneáil sábháilte.
it: Seguendo i passaggi descritti in precedenza, la cartella del progetto sarà sempre posizionata in ``/home/web_user/projects``, il che la manterrà al sicuro.
ta: மேலே விவரிக்கப்பட்ட படிகளை நீங்கள் பின்பற்றும்போது, திட்டக் கோப்புறை எப்போதும் ``/home/web_user/projects`` இல் அமைந்திருக்கும், அதைப் பாதுகாப்பாக வைத்திருக்கும்.
tr: Yukarıda açıklanan adımları izlediğinizde, proje klasörü her zaman ``/home/web_user/projects`` içinde yer alacak ve güvende olacaktır.

source: Editing and running a project
ga: Tionscadal a chur in eagar agus a reáchtáil
it: Modificare ed eseguire un progetto
ta: ஒரு திட்டத்தை திருத்துதல் மற்றும் இயக்குதல்
tr: Bir projeyi düzenleme ve çalıştırma

source: Unlike the native version of Godot, the web editor is constrained to a single window. Therefore, it cannot open a new window when running the project. Instead, when you run the project by clicking the Run button or pressing :kbd:`F5`, it will appear to "replace" the editor window.
ga: Murab ionann agus an leagan dúchais de Godot, tá an t-eagarthóir gréasáin srianta le fuinneog amháin. Dá bhrí sin, ní féidir leis fuinneog nua a oscailt agus an tionscadal á rith. Ina áit sin, nuair a ritheann tú an tionscadal trí chliceáil ar an gcnaipe Rith nó trí :kbd:'F5' a bhrú, is cosúil go "ionadaíonn" fuinneog an eagarthóra.
it: A differenza della versione nativa di Godot, l'editor web è limitato a una singola finestra. Pertanto, non può aprire una nuova finestra durante l'esecuzione del progetto. Invece, quando si esegue il progetto cliccando sul pulsante Esegui o premendo :kbd:`F5`, l'esecuzione sembrerà "sostituirsi" a quella dell'editor.
ta: கோடோட்டின் சொந்த பதிப்பைப் போலன்றி, வலை ஆசிரியர் ஒரு சாளரத்துடன் கட்டுப்படுத்தப்படுகிறது. எனவே, திட்டத்தை இயக்கும் போது புதிய சாளரத்தைத் திறக்க முடியாது. அதற்கு பதிலாக, ரன் பொத்தானைக் சொடுக்கு செய்வதன் மூலம் அல்லது அழுத்துவதன் மூலம் நீங்கள் திட்டத்தை இயக்கும்போது: KBD: `F5`, இது ஆசிரியர் சாளரத்தை" மாற்ற "தோன்றும்.
tr: Godot'un yerel sürümünden farklı olarak, web düzenleyici tek bir pencere ile sınırlıdır. Bu nedenle, projeyi çalıştırırken yeni bir pencere açamaz. Bunun yerine, Çalıştır düğmesine tıklayarak veya :kbd:`F5` tuşuna basarak projeyi çalıştırdığınızda, düzenleyici penceresinin "yerini alacak" şekilde görünecektir.

source: The web editor offers an alternative way to deal with the editor and game windows (which are now "tabs"). You can switch between the **Editor** and **Game** tabs using the buttons on the top. You can also close the running game or editor by clicking the **×** button next to those tabs.
ga: Cuireann an t-eagarthóir gréasáin bealach eile ar fáil chun déileáil leis an eagarthóir agus fuinneoga cluiche (atá anois "cluaisíní"). Is féidir leat aistriú idir na cluaisíní **Editor** agus **Game** ag baint úsáide as na cnaipí ar an mbarr. Is féidir leat an cluiche reatha nó an t-eagarthóir a dhúnadh freisin trí chliceáil ar an gcnaipe **×** in aice leis na cluaisíní sin.
it: L'editor web offre un modo alternativo per gestire le finestre dell'editor e di gioco (che ora sono "schede"). È possibile passare dalla scheda **Editor** a quella **Gioco** attraverso i pulsanti in alto. È anche possibile chiudere il gioco o l'editor in esecuzione cliccando sul pulsante **×** accanto a tali schede.
ta: வலை ஆசிரியர் ஆசிரியர் மற்றும் விளையாட்டு விண்டோசைக் கையாள ஒரு மாற்று வழியை வழங்குகிறது (அவை இப்போது "தாவல்கள்"). மேலே உள்ள பொத்தான்களைப் பயன்படுத்தி ** எடிட்டர் ** மற்றும் ** கேம் ** தாவல்களுக்கு இடையில் மாறலாம். அந்த தாவல்களுக்கு அடுத்த ** × ** பொத்தானைக் சொடுக்கு செய்வதன் மூலம் இயங்கும் விளையாட்டு அல்லது எடிட்டரை மூடலாம்.
tr: Web düzenleyicisi, düzenleyici ve oyun pencereleriyle (artık "sekmeler" olan) başa çıkmak için alternatif bir yol sunar. Üstteki düğmeleri kullanarak **Editor** ve **Game** sekmeleri arasında geçiş yapabilirsiniz. Ayrıca bu sekmelerin yanındaki **×** düğmesine tıklayarak çalışan oyunu veya düzenleyiciyi kapatabilirsiniz.

source: Where are my project files?
ga: Cá bhfuil mo chomhaid tionscadail?
it: Dove sono i file del mio progetto?
ta: எனது திட்ட கோப்புகள் எங்கே?
tr: Proje dosyalarım nerede?

source: Due to browser security limitations, the editor will save the project files to the browser's IndexedDB storage. This storage isn't accessible as a regular folder on your machine, but is abstracted away in a database.
ga: Mar gheall ar theorainneacha slándála brabhsálaí, sábhálfaidh an t-eagarthóir na comhaid tionscadail chuig stóráil IndexedDB an bhrabhsálaí. Níl an stóráil seo inrochtana mar fhillteán rialta ar do mheaisín, ach tá sé teibí ar shiúl i mbunachar sonraí.
it: A causa delle limitazioni di sicurezza del browser, l'editor salverà i file di progetto nell'archivio IndexedDB del browser. Questo archivio non è accessibile come una normale cartella sul computer, ma è astratto in un database.
ta: உலாவி பாதுகாப்பு வரம்புகள் காரணமாக, ஆசிரியர் திட்டக் கோப்புகளை உலாவியின் குறியீட்டுத் தடுப்பு சேமிப்பகத்தில் சேமிப்பார். இந்த சேமிப்பிடம் உங்கள் கணினியில் வழக்கமான கோப்புறையாக அணுக முடியாது, ஆனால் ஒரு தரவுத்தளத்தில் சுருக்கப்பட்டுள்ளது.
tr: Tarayıcı güvenlik sınırlamaları nedeniyle, düzenleyici proje dosyalarını tarayıcının IndexedDB depolama alanına kaydedecektir. Bu depolama alanı, makinenizde normal bir klasör olarak erişilebilir değildir, ancak bir veritabanı içine soyutlanmıştır.
