Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/using_the_xr_editor.po
Languages: es, fr, it, ko, pt_br, ru, ta, uk, zh_cn, zh_hant

source: When interacting with tracked controllers or tracked hands, you can toggle on the `interface/touchscreen/enable_long_press_as_right_click <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-enable-long-press-as-right-click>`__ editor setting to enable right-click by long press.
es: Al interactuar con controladores rastreados o manos rastreadas, puede activar la configuración del editor `interface/touchscreen/enable_long_press_as_right_click <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-enable-long-press-as-right-click>`__ para habilitar el clic derecho mediante una pulsación prolongada.
it: Quando si interagisce con controller tracciati o mani tracciate, è possibile attivare l'impostazione dell'editor `interface/touchscreen/enable_long_press_as_right_click <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-enable-long-press-as-right-click>`__ per abilitare il clic destro tramite pressione prolungata.
pt_br: Ao interagir com controladores rastreados ou mãos rastreadas, você pode ativar a configuração do editor `interface/touchscreen/enable_long_press_as_right_click <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-enable-long-press-as-right-click>`__ para habilitar o clique com o botão direito por meio de um pressionamento longo.
ru: При взаимодействии с отслеживаемыми контроллерами или отслеживаемыми руками вы можете включить параметр редактора `interface/touchscreen/enable_long_press_as_right_click <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-enable-long-press-as-right-click>`__, чтобы включить правый щелчок при длительном нажатии.
ta: கண்காணிக்கப்பட்ட கட்டுப்படுத்திகள் அல்லது கண்காணிக்கப்பட்ட கைகளுடன் தொடர்பு கொள்ளும்போது, நீங்கள் `இடைமுகம்/தொடுதிரை/enable_long_press_as_right_click இல் மாற்றலாம் <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-class-ditorsettings-property-interfacescreen-enable-long-right-click> `__ எடிட்டர் அமைப்பை நீண்ட அழுத்தமாக இருக்கும்.
uk: Під час взаємодії з відстеженими контролерами або відстеженими руками ви можете перемкнути редактор `interface/touchscreen/enable_long_press_as_right_click <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-enable-long-press-as-right-click>`__ налаштування для ввімкнення правої кнопки миші за допомогою тривалого натискання.
zh_cn: 在与追踪控制器或追踪手部交互时，你可以启用 \`interface/touchscreen/enable_long_press_as_right_click <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-enable-long-press-as-right-click>`__\ 编辑器设置，以通过长按实现右键点击功能。
zh_hant: 當與追蹤式控制器或追蹤式手部互動時，您可以開啟 `interface/touchscreen/enable_long_press_as_right_click <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-enable-long-press-as-right-click>`__ 編輯器設定，以啟用長按作為右鍵點擊。

source: When interacting with tracked controllers or tracked hands, you can increase the size of the scrollbar using the `interface/touchscreen/increase_scrollbar_touch_area <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-increase-scrollbar-touch-area>`__ editor setting.
es: Al interactuar con controladores o manos rastreadas, puede aumentar el tamaño de la barra de desplazamiento usando la configuración del editor `interface/touchscreen/increase_scrollbar_touch_area <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-increase-scrollbar-touch-area>`__.
it: Quando si interagisce con controller tracciati o mani tracciate, è possibile aumentare le dimensioni della barra di scorrimento attraverso l'impostazione dell'editor `interface/touchscreen/increase_scrollbar_touch_area <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-increase-scrollbar-touch-area>`__.
pt_br: Ao interagir com controladores rastreados ou mãos rastreadas, você pode aumentar o tamanho da barra de rolagem usando a configuração do editor `interface/touchscreen/increase_scrollbar_touch_area <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-increase-scrollbar-touch-area>`.
ru: При взаимодействии с отслеживаемыми контроллерами или отслеживаемыми руками вы можете увеличить размер полосы прокрутки с помощью настройки редактора `interface/touchscreen/increase_scrollbar_touch_area <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-increase-scrollbar-touch-area>`__.
ta: கண்காணிக்கப்பட்ட கட்டுப்படுத்திகள் அல்லது கண்காணிக்கப்பட்ட கைகளுடன் தொடர்பு கொள்ளும்போது, `இடைமுகம்/தொடுதிரை/அதிகரிப்பு_ச்கிரோல்பார்_டூச்_ரியா ஆகியவற்றைப் பயன்படுத்தி உருட்டலின் அளவை அதிகரிக்கலாம் <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-ditorsettings-property- இன்டர்ஃபேச்-டூச்ச்கிரீன்-அதிகபட்சம்-scrollbar-touch-area> __ எடிட்டர் அமைப்பு.
uk: Під час взаємодії з відстеженими контролерами або відстеженими руками ви можете збільшити розмір смуги прокрутки за допомогою `interface/touchscreen/increase_scrollbar_touch_area <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-increase-scrollbar-touch-area>`__ налаштування редактора.
zh_cn: 在与追踪控制器或追踪手部交互时，你可以通过 \`interface/touchscreen/increase_scrollbar_touch_area <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-increase-scrollbar-touch-area>`__ \编辑器设置来增加滚动条的触摸区域大小。
zh_hant: 當與追蹤控制器或追蹤手部互動時，您可以使用 `interface/touchscreen/increase_scrollbar_touch_area <https://docs.godotengine.org/en/stable/classes/class_editorsettings.html#class-editorsettings-property-interface-touchscreen-increase-scrollbar_touch-area>`__ 編輯器設定來增加捲軸的大小。

source: **Multi-tasking**
es: **Multitarea**
ru: **Multi-tasking (Многозадачность)**
ta: ** மல்டி டாச்கிங் **
uk: **Багатозадачність**
zh_cn: **多任务**
zh_hant: **多工處理**

source: `Theater View <https://www.meta.com/blog/quest/meta-quest-v67-update-new-window-layout-creator-content-horizon-feed/>`__ can be used to fullscreen the *Editor window*.
it: `Theater View <https://www.meta.com/blog/quest/meta-quest-v67-update-new-window-layout-creator-content-horizon-feed/>`__ si può utilizzare per mostrare a schermo intero la *Finestra dell'editor*.
pt_br: `Theater View <https://www.meta.com/blog/quest/meta-quest-v67-update-new-window-layout-creator-content-horizon-feed/>`__ pode ser usado para colocar a *janela do Editor* em modo de tela cheia.
ru: `Театральный вид <https://www.meta.com/blog/quest/meta-quest-v67-update-new-window-layout-creator-content-horizon-feed/>`__ можно использовать для полноэкранного просмотра *Editor window*.
ta: `தியேட்டர் பார்வை <https://www.meta.com/blog/quest/meta-quest-v67-Update-new-window- லேஅவுட்-கிரியேட்டர்-கான்டென்ட்-ஆர்சன்-ஃபீட்/> __ __ *எடிட்டர் சாளரத்தை முழுமையாக்க பயன்படுத்தலாம் *.
uk: `Theatre View <https://www.meta.com/blog/quest/meta-quest-v67-update-new-window-layout-creator-content-horizon-feed/>`__ можна використовувати для повноекранного перегляду *вікна редактора*.
zh_cn: \`Theater View <https://www.meta.com/blog/quest/meta-quest-v67-update-new-window-layout-creator-content-horizon-feed/>`__\ 可用于将 *编辑器窗口* 全屏显示。
zh_hant: `劇院視圖 <https://www.meta.com/blog/quest/meta-quest-v67-update-new-window-layout-creator-content-horizon-feed/>`__ 可用於全螢幕顯示 *編輯器視窗*。

source: Enable `Seamless Multitasking <https://www.uploadvr.com/seamless-multitasking-experimental-quest/>`__, available in the Quest *Experimental Settings*, to enable the ability to quickly transition between a running XR project and the *Editor window*.
es: Habilite `Multitarea sin interrupciones <https://www.uploadvr.com/seamless-multitasking-experimental-quest/>`__, disponible en *Configuración experimental* de Quest, para habilitar la capacidad de realizar una transición rápida entre un proyecto XR en ejecución y la *ventana del editor*.
it: Abilita `Seamless Multitasking <https://www.uploadvr.com/seamless-multitasking-experimental-quest/>`__, disponibile nelle *Impostazioni sperimentali* di Quest, per abilitare la possibilità di passare rapidamente tra un progetto XR in esecuzione e la *Finestra dell'editor*.
pt_br: Habilite `Seamless Multitasking <https://www.uploadvr.com/seamless-multitasking-experimental-quest/>`__, disponível nas *Configurações Experimentais* do Quest, para permitir a transição rápida entre um projeto XR em execução e a *janela do Editor*.
ru: Включите «Seamless Multitasking <https://www.uploadvr.com/seamless-multitasking-experimental-quest/>»__, доступную в *Экспериментальных настройках* Quest, чтобы иметь возможность быстрого перехода между запущенным проектом XR и *окном редактора*.
ta: இயங்கும் எக்ச்ஆர் திட்டம் மற்றும் *ஆசிரியர் சாளரத்திற்கு இடையில் விரைவாக மாற்றுவதற்கான திறனை செயல்படுத்த, `தடையற்ற மல்டி டாச்கிங் <https://www.uploadvr.com/seamless-multitasking- experimation-ceast/> __ __, குவெச்ட் *சோதனை அமைப்புகள் *இல் கிடைக்கிறது.
uk: Увімкніть `Seamless Multitasking <https://www.uploadvr.com/seamless-multitasking-experimental-quest/>`__, доступний у квесті *Experimental Settings*, щоб забезпечити можливість швидкого переходу між запущеним проектом XR і *вікном редактора*.
zh_cn: 启用 \`无缝多任务处理 <https://www.uploadvr.com/seamless-multitasking-experimental-quest/>`__\（在 Quest 的 *实验性设置* 中可用），以便在运行的 XR 项目和 *编辑器窗口* 之间快速切换。
zh_hant: 啟用 `無縫多工處理 <https://www.uploadvr.com/seamless-multitasking-experimental-quest/>`__ ，可在 Quest 的 *實驗性設定* 中找到，以啟用在執行中的 XR 專案與 *編輯器視窗* 之間快速切換的功能。

source: When developing a non-XR project, the Godot editor app icon will provide the ability to switch between the *Editor window* and the *Play window* when the latter is active, using Quest's *App menu* feature.
es: Al desarrollar un proyecto que no sea XR, el ícono de la aplicación del editor Godot brindará la posibilidad de cambiar entre la *ventana del editor* y la *ventana de reproducción* cuando esta última esté activa, usando la función *Menú de aplicaciones* de Quest.
fr: Lors du développement d'un projet non-XR, l'icône de l'application d'éditeur Godot fournira la possibilité de passer entre la *fenêtre Éditeur* et la *fenêtre Jouer* lorsque cette dernière est active, en utilisant la fonction *App menu* du Quest.
it: Durante lo sviluppo di un progetto non XR, l'icona dell'app dell'editor Godot consentirà di passare dalla *Finestra dell'editor* alla *Finestra di gioco* quando quest'ultima è attiva, attraverso la funzionalità *App menu* di Quest.
pt_br: Ao desenvolver um projeto não-XR, o ícone do aplicativo editor Godot fornecerá a capacidade de alternar entre a *janela do editor* e a *janela de reprodução* quando esta última estiver ativa, usando o recurso *menu do aplicativo* do Quest.
ru: При разработке не-XR-проекта значок приложения-редактора Godot предоставит возможность переключаться между *окном редактора* и *окном воспроизведения*, когда последнее активно, с помощью функции *меню приложений* Quest.
ta: எக்ச்ஆர் அல்லாத திட்டத்தை உருவாக்கும் போது, கோடோட் எடிட்டர் பயன்பாட்டு படவுரு * எடிட்டர் சாளரம் * மற்றும் * பிளே சாளரத்திற்கு இடையில் மாறும் திறனை வழங்கும், பிந்தையது செயலில் இருக்கும்போது, குவெச்டின் * பயன்பாட்டு பட்டியல் * அம்சத்தைப் பயன்படுத்தி.
uk: Під час розробки проекту, не пов’язаного з XR, піктограма програми Godot Editor забезпечить можливість перемикатися між *вікном редактора* та *вікном відтворення*, коли останнє активне, за допомогою функції *меню програми* Quest.
zh_cn: 在开发非 XR 项目时，当 *Play 窗口* 处于活动状态时，Godot 编辑器应用图标将提供使用 Quest 的 *App 菜单* 功能在 *编辑器窗口* 和 *Play 窗口* 之间切换的能力。
zh_hant: 開發非 XR 專案時，當遊玩視窗處於啟用狀態時，Godot 編輯器應用程式圖示將可以讓您使用 Quest 的 *應用程式選單* 功能，在 *編輯器視窗* 與 *遊玩視窗* 之間切換。

source: When developing and running an XR project, you can bring back the *Editor window* by:
es: Al desarrollar y ejecutar un proyecto XR, puede recuperar la *ventana del editor* de la siguiente manera:
fr: Lorsque vous développez et exécutez un projet XR, vous pouvez ramener la *fenêtre Éditeur* en :
it: Durante lo sviluppo e l'esecuzione di un progetto XR, è possibile ripristinare la *Finestra dell'editor* nei seguenti modi:
pt_br: Ao desenvolver e executar um projeto XR, você pode trazer de volta a *janela do Editor*:
ru: При разработке и запуске проекта XR вы можете вернуть *окно редактора* следующим образом:
ta: ஒரு எக்ச்ஆர் திட்டத்தை உருவாக்கி இயக்கும் போது, நீங்கள் * எடிட்டர் சாளரத்தை மீண்டும் கொண்டு வரலாம் *
uk: Під час розробки та запуску проекту XR ви можете повернути *вікно редактора*, виконавши такі дії:
zh_cn: 在开发和运行 XR 项目时，你可以通过以下方式唤回 *编辑器窗口* ：
zh_hant: 當開發並執行 XR 專案時，您可以透過以下方式叫回 *編輯器視窗*：

source: Pressing on the *Meta* button to invoke the menu bar
es: Presionando el botón *Meta* para invocar la barra de menú
it: Premendo il pulsante *Meta* per invocare la barra di menu
pt_br: Pressionando o botão *Meta* para invocar a barra de menu
ru: Нажатие кнопки *Meta* вызывает строку меню
ta: பட்டியல் பட்டியை அழைக்க * மேவு * பொத்தானை அழுத்தவும்
uk: Натисніть кнопку *Meta*, щоб відкрити панель меню
zh_cn: 按下 *Meta* 按钮以调用菜单栏
zh_hant: 按下 *Meta* 按鈕以叫出選單列

source: Clicking on the Godot editor app icon to summon the *App menu*, and select the *Editor window* tile.
es: Haciendo clic en el ícono de la aplicación del editor Godot para abrir el *Menú de la aplicación* y seleccionando el mosaico *Ventana del editor*.
it: Cliccando sull'icona dell'app del Godot Editor per invocare l'*App menu* e selezionare il riquadro *Finestra dell'editor*.
pt_br: Clique no ícone do aplicativo editor Godot para abrir o *Menu do aplicativo* e selecione o bloco *Janela do editor*.
ru: Щелкните значок приложения-редактора Godot, чтобы вызвать *меню приложения*, и выберите *Окно редактора*.
ta: *பயன்பாட்டு பட்டியல் *ஐ வரவழைக்க கோடோட் எடிட்டர் பயன்பாட்டு ஐகானைக் சொடுக்கு செய்து, *எடிட்டர் சாளரம் *ஓடு என்பதைத் தேர்ந்தெடுக்கவும்.
uk: Натисніть піктограму редактора програми Godot, щоб викликати *меню програми* та виберіть плитку *Вікно редактора*.
zh_cn: 点击 Godot 编辑器应用图标以唤出 *应用菜单* ，然后选择 *编辑器窗口* 图块。
zh_hant: 點擊 Godot 編輯器應用程式圖示以叫出 *應用程式選單*，並選擇 *編輯器視窗* 方塊。

source: **Projects sync**
es: **Sincronización de proyectos**
it: **Sincronizzazione dei progetti**
ko: **프로젝트 동기화**
ru: **Projects sync (Синхронизация проектов)**
ta: ** திட்டங்கள் ஒத்திசைவு **
uk: **Синхронізація проектів**
zh_cn: **项目同步**
zh_hant: **專案同步**

source: Syncing projects via Git can be done by downloading an Android Git client. We recommend the `Termux terminal <https://termux.dev/en/>`__, an Android terminal emulator which provides access to common terminal utilities such Git and SSH.
es: La sincronización de proyectos mediante Git, puede realizarse al descargar un cliente de Git para Android. Recomendamos `Terminal Termux <https://termux.dev/en/>`__, un emulador de terminal de Android que proporciona acceso a utilidades de terminal comunes como Git y SSH.
fr: La synchronisation des projets via Git peut être faite en téléchargeant un client Android Git. Nous recommandons le `terminal Termux <https://termux.dev/en/>`__, un émulateur de terminal Android qui fournit l'accès aux utilitaires terminaux communs tels que Git et SSH.
pt_br: A sincronização de projetos via Git pode ser feita baixando um cliente Git para Android. Recomendamos o `Termux terminal <https://termux.dev/en/>`__, um emulador de terminal para Android que fornece acesso a utilitários comuns de terminal, como Git e SSH.
ru: Синхронизация проектов через Git может быть выполнена путем загрузки клиента Android Git. Мы рекомендуем `Termux terminal <https://termux.dev/en/>`__, эмулятор терминала Android, который обеспечивает доступ к общим утилитам терминала, таким как Git и SSH.
ta: ஆண்ட்ராய்டு Git கிளையண்டைப் பதிவிறக்குவதன் மூலம் GIT வழியாக திட்டங்களை ஒத்திசைக்க முடியும். `டெர்சன் டெர்மினல் <https://termux.dev/en/> __, ஆண்ட்ராய்டு டெர்மினல் முன்மாதிரியை __ என்ற பரிந்துரைக்கிறோம், இது பொதுவான முனைய பயன்பாடுகளான அறிவிலி மற்றும் பாஓடு அணுகலை வழங்குகிறது.
uk: Синхронізувати проекти через Git можна, завантаживши клієнт Git для Android. Ми рекомендуємо `Termux terminal <https://termux.dev/en/>`__, емулятор терміналу Android, який надає доступ до звичайних термінальних утиліт, таких як Git і SSH.
zh_cn: 通过 Git 同步项目可以通过下载 Android Git 客户端来完成。我们推荐使用 \`Termux 终端 <https://termux.dev/cn/>`__\，这是一个 Android 终端模拟器，提供了对常见终端工具（如 Git 和 SSH）的访问。
zh_hant: 可透過下載 Android Git 客戶端來同步專案。我們推薦 `Termux 終端機 <https://termux.dev/en/>`__，這是一款 Android 終端機模擬器，能提供 Git 及 SSH 等常用終端工具的存取。

source: **Note:** To use Git with the Termux terminal, you'll need to grant *WRITE* permission to the terminal. This can be done by `running the following command <https://wiki.termux.com/wiki/Termux-setup-storage>`__ from within the terminal: ``termux-setup-storage``
es: **Nota:** Para usar Git con la terminal de Termux, deberá otorgarle permiso de *ESCRITURA*. Esto se puede hacer ejecutando el siguiente comando <https://wiki.termux.com/wiki/Termux-setup-storage> desde la terminal: ``termux-setup-storage``
fr: **Note :** Pour utiliser Git avec le terminal Termux, vous devrez accorder une autorisation *WRITE* au terminal. Ceci peut être fait en `exécutant la commande suivante <https://wiki.termux.com/wiki/Termux-setup-storage>`__ à l'intérieur du terminal : ``termux-setup-storage``
it: **Nota:** Per utilizzare Git con il terminale Termux, è necessario concedere il permesso *WRITE* al terminale. Ciò si può fare ``eseguendo il seguente comando <https://wiki.termux.com/wiki/Termux-setup-storage>`__ dal terminale: ``termux-setup-storage``
pt_br: **Nota:** Para usar o Git com o terminal Termux, você precisará conceder permissão de *ESCRITA* ao terminal. Isso pode ser feito `executando o seguinte comando <https://wiki.termux.com/wiki/Termux-setup-storage>`__ dentro do terminal: ``termux-setup-storage``
ru: **Примечание:** Чтобы использовать Git с терминалом Termux, вам нужно предоставить терминалу разрешение *WRITE*. Это можно сделать, `выполнив следующую команду <https://wiki.termux.com/wiki/Termux-setup-storage>`__ из терминала: ``termux-setup-storage``
ta: ** குறிப்பு: ** டெர்மக்ச் முனையத்துடன் அறிவிலி பயன்படுத்த, நீங்கள் முனையத்திற்கு*எழுத*அனுமதி வழங்க வேண்டும். பின்வரும் கட்டளையை இயக்குவதன் மூலம் இதைச் செய்யலாம்
uk: **Примітка.** Щоб використовувати Git із терміналом Termux, вам потрібно буде надати терміналу дозвіл *WRITE*. Це можна зробити, `запустивши таку команду <https://wiki.termux.com/wiki/Termux-setup-storage>`__ з терміналу: ``termux-setup-storage``
zh_cn: **注意：**\ 要在 Termux 终端中使用 Git，你需要授予终端\ *写*\ 权限。这可以通过\ `在终端中运行以下命令 <https://wiki.termux.com/wiki/Termux-setup-storage>`__\ 来实现：\ ``termux-setup-storage``
zh_hant: **注意：** 若要在 Termux 終端機使用 Git，必須為終端機授予 *寫入* 權限。可在終端機內 `執行以下指令 <https://wiki.termux.com/wiki/Termux-setup-storage>`__：``termux-setup-storage``

source: **Plugins**
it: **Estensioni**
ko: **플러그인**
ru: **Plugins (Плагины)**
ta: ** செருகுநிரல்கள் **
uk: **Плагіни**
zh_cn: **插件**
zh_hant: **外掛程式**

source: GDExtension plugins work as expected, but require the plugin developer to provide native Android binaries.
es: Los complementos de GDExtension funcionan como se espera, pero requieren que el desarrollador del complemento proporcione binarios nativos de Android.
fr: Les plugins GDExtension fonctionnent comme prévu, mais requirent au développeur de plugin de fournir des binaires Android natives.
it: Le estensioni GDExtension funzionano come previsto, ma richiedono che lo sviluppatore dell'estensione fornisca i binari nativi per Android.
ko: GDExtension 플러그인은 예상대로 작동하지만 플러그인 개발자가 네이티브 Android 바이너리를 제공해야 합니다.
pt_br: Os plugins GDExtension funcionam conforme o esperado, mas exigem que o desenvolvedor do plugin forneça binários nativos do Android.
ru: Плагины GDExtension работают как и ожидалось, но требуют от разработчика плагина предоставления собственных двоичных файлов Android.
ta: Gdextension செருகுநிரல்கள் எதிர்பார்த்தபடி செயல்படுகின்றன, ஆனால் சொருகி உருவாக்குபவர் சொந்த ஆண்ட்ராய்டு இருமங்களை வழங்க வேண்டும்.
uk: Плагіни GDExtension працюють належним чином, але вимагають, щоб розробник плагіна надав власні двійкові файли Android.
zh_cn: GDExtension 插件按预期工作，但需要插件开发者提供原生的 Android 二进制文件。
zh_hant: GDExtension 外掛程式如預期般運作，但需要外掛程式開發者提供原生 Android 二進位檔。

source: Limitations & known issues
es: Limitaciones y problemas conocidos
fr: Limitations et problèmes connus
it: Limitazioni e problemi noti
ko: 제한 사항 및 알려진 문제
ru: Ограничения и известные проблемы
ta: வரம்புகள் மற்றும் அறியப்பட்ட சிக்கல்கள்
uk: Обмеження та відомі проблеми
zh_cn: 局限性与已知问题
zh_hant: Xbox One 的限制

source: Here are the known limitations and issues of the XR editor:
es: Estas son las limitaciones y problemas conocidos del editor XR:
fr: Voici les limites connues et les problèmes de l'éditeur XR :
it: Ecco le limitazioni e i problemi noti dell'editor XR:
ko: XR 편집기의 알려진 제한 사항과 문제점은 다음과 같습니다:
ru: Вот известные ограничения и проблемы редактора XR:
ta: எக்ச்ஆர் எடிட்டரின் அறியப்பட்ட வரம்புகள் மற்றும் சிக்கல்கள் இங்கே:
uk: Ось відомі обмеження та проблеми редактора XR:
zh_cn: 以下是 XR 编辑器的已知局限性和问题：
zh_hant: 以下是 XR 編輯器的已知限制與問題：
