Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/using_the_xr_editor.po
Languages: es, fr, it, ko, pt_br, ru, ta, uk, zh_cn, zh_hant

source: Using the XR editor
es: Usar el editor XR
fr: Utilisation de l’éditeur XR
it: Utilizzare l'editor XR
ko: XR 편집기 사용하기
ru: Использование редактора XR
ta: எக்ச்ஆர் எடிட்டரைப் பயன்படுத்துதல்
uk: Використання редактора XR
zh_cn: 使用 XR 编辑器
zh_hant: 使用 XR 編輯器

source: In 2024, we introduced the `Godot XR editor <https://godotengine.org/article/godot-editor-horizon-store-early-access-release/>`__, a version of the Godot editor **designed to run natively on XR devices**, enabling the creation, development and export of 2D, 3D, and **XR** apps and games directly on device.
es: En 2024, presentamos el «editor Godot XR <https://godotengine.org/article/godot-editor-horizon-store-early-access-release/>`__, una versión del editor Godot **diseñada para ejecutarse de forma nativa en dispositivos XR**, lo que permite la creación, el desarrollo y la exportación de aplicaciones y juegos 2D, 3D y **XR** directamente en el dispositivo.
fr: En 2024, nous avons introduit l'`éditeur Godot XR <https://godotengine.org/article/godot-editor-horizon-store-early-access-release/>`__, une version de l'éditeur de Godot **conçue pour fonctionner nativement sur les appareils XR**, permettant la création, le développement et l'exportation d'applications et de jeux 2D, 3D et **XR** directement sur l'appareil.
it: Nel 2024 abbiamo introdotto l'`editor Godot XR <https://godotengine.org/article/godot-editor-horizon-store-early-access-release/>`__, una versione dell'editor Godot **progettata per funzionare nativamente sui dispositivi XR**, consentendo la creazione, lo sviluppo e l'esportazione di app e giochi 2D, 3D e **XR** direttamente sul dispositivo.
pt_br: Em 2024, introduzimos o `Godot XR editor <https://godotengine.org/article/godot-editor-horizon-store-early-access-release/>`__, uma versão do editor Godot **projetada para rodar nativamente em dispositivos XR**, permitindo a criação, desenvolvimento e exportação de aplicativos e jogos 2D, 3D e **XR** diretamente no dispositivo.
ru: В 2024 году мы представили `Godot XR editor <https://godotengine.org/article/godot-editor-horizon-store-early-access-release/>`__, версию редактора Godot, **разработанную для работы на устройствах XR**, что позволяет создавать, разрабатывать и экспортировать 2D, 3D и **XR** приложения и игры непосредственно на устройстве.
ta: In 2024, we introduced the `Godot XR திருத்தி <https://godotengine.org/article/godot-editor-horizon-store-early-access-release/>`__, a version of the Godot திருத்தி **designed பெறுநர் ஓடு natively on XR devices**, enabling the creation, வளர்ச்சி and ஏற்றுமதி of 2D, 3D, and **XR** apps and games directly on சாதனம்.
uk: У 2024 році ми представили «редактор Godot XR <https://godotengine.org/article/godot-editor-horizon-store-early-access-release/>`__, версію редактора Godot, **створену для роботи на пристроях XR**, що дозволяє створювати, розробляти та експортувати 2D, 3D і **XR** програми та ігри безпосередньо на пристрій.
zh_cn: 2024 年，我们推出了 `Godot XR 编辑器 <https://godotengine.org/article/godot-editor-horizon-store-early-access-release/>`__\ ，这是\ **专为 XR 设备原生运行而设计**\ 的 Godot 编辑器版本，使你能够直接在设备上创建、开发和导出 2D、3D 以及 **XR** 应用和游戏。
zh_hant: 在 2024 年，我們推出了 `Godot XR 編輯器 <https://godotengine.org/article/godot-editor-horizon-store-early-access-release/>`__ ，這是一個 **設計用於原生執行在 XR 裝置上** 的 Godot 編輯器版本，實現了在裝置上直接建立、開發與匯出 2D、3D 和 **XR** 應用程式與遊戲。

source: The app can be downloaded from the `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__, or from the `Godot download page <https://godotengine.org/download/preview/>`__.
es: La aplicación se puede descargar desde `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__, o desde la `página de descarga de Godot <https://godotengine.org/download/preview/>`__.
fr: L'application peut être téléchargée à partir du `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__, ou de la `page de téléchargement de Godot <https://godotengine.org/download/preview/>`__.
it: L'app si può scaricare dal `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__, oppure dalla `pagina di download di Godot <https://godotengine.org/download/preview/>`__.
pt_br: O aplicativo pode ser baixado na `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__, ou na `página de downloads do Godot <https://godotengine.org/download/preview/>`__.
ru: Приложение можно загрузить из `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__ или со `сGodot download page <https://godotengine.org/download/preview/>`__.
ta: பயன்பாட்டை `மெட்டா ஒரைசன் கடை <https://www.meta.com/experiences/godot-game-ganennengine/7713660705416473/> __ __ அல்லது` கோடோட் பதிவிறக்கப் பக்கம் <https://gododengine இலிருந்து பதிவிறக்கம் செய்யலாம்.
uk: Програму можна завантажити з магазину `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__ або зі сторінки завантаження `Godot <https://godotengine.org/download/preview/>`__.
zh_cn: 该应用可以从 `Meta Horizon Store <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__ 和 `Godot 下载页面 <https://godotengine.org/download/preview/>`__\ 下载。
zh_hant: 該應用程式可以從 `Meta Horizon 商店 <https://www.meta.com/experiences/godot-game-engine/7713660705416473/>`__，或從 `Godot 下載頁面 <https://godotengine.org/download/preview/>`__ 下載。

source: The XR editor is in early access, while we continue to refine the experience. See :ref:`doc_using_the_xr_editor_limitations` below.
es: El editor XR está en acceso anticipado mientras seguimos perfeccionando la experiencia. Consulta :ref:`doc_using_the_xr_editor_limitations` a continuación.
fr: Cet éditeur XR est en bêta-test, pendant que nous continuons à raffiner l'expérience. Voir :ref:`doc_using_the_xr_editor_limitations` ci dessous.
it: L'editor XR è in accesso anticipato, mentre continuiamo a perfezionarne l'esperienza. Consultare :ref:`doc_using_the_xr_editor_limitations` in seguito.
ru: Редактор XR находится в раннем доступе, пока мы продолжаем совершенствовать его. См. :ref:`doc_using_the_xr_editor_limitations` ниже.
ta: எக்ச்ஆர் எடிட்டர் ஆரம்பகால அணுகலில் உள்ளது, அதே நேரத்தில் அனுபவத்தை தொடர்ந்து செம்மைப்படுத்துகிறோம். காண்க: குறிப்பு: `doc_using_the_xr_editor_imitations` கீழே.
uk: Редактор XR знаходиться в ранньому доступі, поки ми продовжуємо вдосконалювати його. Див. :ref:`doc_using_the_xr_editor_limitations` нижче.
zh_cn: XR 编辑器仍处于提前试用阶段，我们将继续完善使用体验。请参阅下面的《\ :ref:`doc_using_the_xr_editor_limitations`\ 》。
zh_hant: XR 編輯器處於搶先體驗階段，同時我們持續改進使用者體驗。請參閱下方的 :ref:`doc_using_the_xr_editor_limitations`。

source: XR devices support
fr: Support des appareils XR
it: Supporto per dispositivi XR
ru: Поддержка устройств XR
ta: எக்ச்ஆர் சாதனங்கள் உதவி
uk: Підтримка пристроїв XR
zh_cn: XR 设备支持
zh_hant: XR 裝置支援

source: For now, the Godot XR editor is only available for the following `Meta Quest <https://www.meta.com/quest/>`__ devices running **Meta Horizon OS v69 or higher**:
es: Por ahora, el editor Godot XR solo está disponible para los siguientes dispositivos `Meta Quest <https://www.meta.com/quest/>`__ que ejecutan **Meta Horizon OS v69 o superior**:
fr: Pour l'instant, l'éditeur Godot XR n'est disponible que pour les appareils `Meta Quest <https://www.meta.com/quest/>`__ suivants, avec **Meta Horizon OS v69 ou supérieur** :
it: Per ora, l'editor Godot XR è disponibile solo per i seguenti dispositivi `Meta Quest <https://www.meta.com/quest/>`__ , con **Meta Horizon OS v69 o versione successiva**:
pt_br: Por enquanto, o editor Godot XR está disponível apenas para os seguintes dispositivos `Meta Quest <https://www.meta.com/quest/>`__ que executam o **Meta Horizon OS v69 ou superior**:
ru: На данный момент редактор Godot XR доступен только для следующих устройств `Meta Quest <https://www.meta.com/quest/>`__ под управлением **Meta Horizon OS v69 или выше**:
ta: இப்போதைக்கு, கோடோட் எக்ச்ஆர் எடிட்டர் பின்வரும் `மெட்டா குவெச்ட் <https://www.meta.com/quest/> __ இயங்கும் சாதனங்கள் ** மேவு ஒரைசன் ஓஎச் வி 69 அல்லது அதற்கு மேற்பட்டவை **:
uk: Наразі редактор Godot XR доступний лише для наступних пристроїв `Meta Quest <https://www.meta.com/quest/>`__, які працюють під керуванням **Meta Horizon OS v69 або новішої**:
zh_cn: 目前 Godot XR 编辑器仅适用于运行 **Meta Horizon OS v69 或更高版本**\ 的以下 `Meta Quest <https://www.meta.com/quest/>`__ 设备：
zh_hant: 目前，Godot XR 編輯器僅適用於執行 **Meta Horizon OS v69 或更高版本** 的以下 `Meta Quest <https://www.meta.com/quest/>`__ 裝置：

source: Meta Quest 3
ru: Мета Квест 3
ta: மேவு குவெச்ட் 3

source: Meta Quest 3s
ru: Мета Квест 3s
ta: மேவு குவெச்ட் 3 கள்

source: Meta Quest Pro
ru: Мета Квест Про
ta: மேவு குவெச்ட் புரோ

source: We are working to add support for more XR devices, including PCVR devices.
es: Estamos trabajando para agregar soporte para más dispositivos XR, incluidos los dispositivos PCVR.
fr: Nous travaillons à ajouter du support pour plus d'appareils XR, y compris des appareils PCVR.
it: Stiamo lavorando per aggiungere il supporto per più dispositivi XR, compresi i dispositivi PCVR.
pt_br: Estamos trabalhando para adicionar suporte para mais dispositivos XR, incluindo dispositivos PCVR.
ru: Мы работаем над добавлением поддержки большего количества устройств XR, включая устройства PCVR.
ta: பி.சி.வி.ஆர் சாதனங்கள் உட்பட மேலும் எக்ச்ஆர் சாதனங்களுக்கான ஆதரவைச் சேர்க்க நாங்கள் பணியாற்றி வருகிறோம்.
uk: Ми працюємо над додаванням підтримки для більшої кількості пристроїв XR, включаючи пристрої PCVR.
zh_cn: 我们正在努力添加对更多 XR 设备的支持，包括 PCVR 设备。
zh_hant: 我們正在努力新增對更多 XR 裝置的支援，包括 PCVR 裝置。

source: Runtime Permissions
es: Permisos de tiempo de ejecución
fr: Permissions pendant l'exécution
it: Permessi in fase di esecuzione
ru: Разрешения времени выполнения
ta: இயக்க நேர அனுமதிகள்
uk: Дозволи виконання
zh_cn: 运行时权限
zh_hant: 執行時期權限

source: `All files access permission <https://developer.android.com/training/data-storage/manage-all-files#all-files-access>`__: Enables the editor to create, import, and read project files from any file locations on the device. Without this permission, the editor is still functional, but has limited access to the device's files and directories.
fr: `Permission d'accès à tous les fichiers <https://developer.android.com/training/data-storage/manage-all-files#all-files-access>`__ : Permet à l'éditeur de créer, d'importer et de lire des fichiers de projet à partir de tous les emplacements de fichiers sur l'appareil. Sans cette autorisation, l'éditeur est toujours fonctionnel, mais a un accès limité aux fichiers et répertoires de l'appareil.
it: `Autorizzazione di accesso a tutti i file <https://developer.android.com/training/data-storage/manage-all-files#all-files-access>`__: permette all'editor di creare, importare e leggere file di progetto da qualsiasi posizione sul dispositivo. Senza questa autorizzazione, l'editor è comunque funzionante, ma ha accesso limitato ai file e alle cartelle del dispositivo.
ru: `Разрешение на доступ ко всем файлам <https://developer.android.com/training/data-storage/manage-all-files#all-files-access>`__: позволяет редактору создавать, импортировать и читать файлы проекта из любых местоположений файлов на устройстве. Без этого разрешения редактор по-прежнему функционирует, но имеет ограниченный доступ к файлам и каталогам устройства.
ta: `எல்லா கோப்புகளும் அணுகலை அணுகும் <https://developer.android.com/training/data-storage/manage-all-files#all-files-access> __: சாதனத்தில் உள்ள எந்த கோப்பு இருப்பிடங்களிலிருந்தும் திட்டக் கோப்புகளை உருவாக்கவும், இறக்குமதி செய்யவும், படிக்கவும் ஆசிரியரை இயக்குகிறது. இந்த அனுமதியின்றி, எடிட்டர் இன்னும் செயல்படுகிறது, ஆனால் சாதனத்தின் கோப்புகள் மற்றும் கோப்பகங்களுக்கு மட்டுப்படுத்தப்பட்ட அணுகல் உள்ளது.
uk: `Дозвіл на доступ до всіх файлів <https://developer.android.com/training/data-storage/manage-all-files#all-files-access>`__: дозволяє редактору створювати, імпортувати та читати файли проекту з будь-якого розташування файлів на пристрої. Без цього дозволу редактор все ще працює, але має обмежений доступ до файлів і каталогів пристрою.
zh_cn: \`所有文件访问权限 <https://developer.android.com/training/data-storage/manage-all-files#all-files-access>`__\ ：该权限允许编辑器从设备上的任何文件位置创建、导入和读取项目文件。没有该权限，编辑器仍可运行，但对设备文件和目录的访问受限。
zh_hant: `所有檔案存取權限 <https://developer.android.com/training/data-storage/manage-all-files#all-files-access>`__ : 讓編輯器能夠建立、匯入及讀取裝置上任何檔案位置的專案檔案。沒有這個權限，編輯器仍然可以運作，但對裝置的檔案和目錄存取權限受到限制。

source: `REQUEST_INSTALL_PACKAGES <https://developer.android.com/reference/android/Manifest.permission#REQUEST_INSTALL_PACKAGES>`__: Enables the editor to install exported project APKs.
es: `REQUEST_INSTALL_PACKAGES <https://developer.android.com/reference/android/Manifest.permission#REQUEST_INSTALL_PACKAGES>`__: Permite al editor instalar APK de proyectos exportados.
fr: `REQUEST_INSTALL_PACKAGES <https://developer.android.com/reference/android/Manifest.permission#REQUEST_INSTALL_PACKAGES>`__ : Permet à l'éditeur d'installer les APKs du projet exporté.
it: `REQUEST_INSTALL_PACKAGES <https://developer.android.com/reference/android/Manifest.permission#REQUEST_INSTALL_PACKAGES>`__: permette all'editor di installare gli APK del progetto esportato.
pt_br: `REQUEST_INSTALL_PACKAGES <https://developer.android.com/reference/android/Manifest.permission#REQUEST_INSTALL_PACKAGES>`__: Permite que o editor instale APKs de projetos exportados.
ru: `REQUEST_INSTALL_PACKAGES <https://developer.android.com/reference/android/Manifest.permission#REQUEST_INSTALL_PACKAGES>`__: позволяет редактору устанавливать экспортированные APK-файлы проекта.
ta: `Request_install_packages <https://developer.android.com/reference/android/manifest.permission#request_install_packages> __: ஏற்றுமதி செய்யப்பட்ட திட்ட APKS ஐ நிறுவ எடிட்டரை இயக்குகிறது.
uk: `REQUEST_INSTALL_PACKAGES <https://developer.android.com/reference/android/Manifest.permission#REQUEST_INSTALL_PACKAGES>`__: дозволяє редактору встановлювати експортовані APK проекту.
zh_cn: \`REQUEST_INSTALL_PACKAGES <https://developer.android.com/reference/android/Manifest.permission#REQUEST_INSTALL_PACKAGES>`__\ ：允许编辑器安装导出的项目 APK。
zh_hant: `REQUEST_INSTALL_PACKAGES <https://developer.android.com/reference/android/Manifest.permission#REQUEST_INSTALL_PACKAGES>`__ : 啟用編輯器能夠安裝匯出的專案 APK。

source: `RECORD_AUDIO <https://developer.android.com/reference/android/Manifest.permission#RECORD_AUDIO>`__: Requested when the `audio/driver/enable_input <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-audio-driver-enable-input>`__ project setting is enabled.
es: `RECORD_AUDIO <https://developer.android.com/reference/android/Manifest.permission#RECORD_AUDIO>`__: Se solicita cuando la configuración del proyecto `audio/driver/enable_input <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-audio-driver-enable-input>`__ está habilitada.
it: `RECORD_AUDIO <https://developer.android.com/reference/android/Manifest.permission#RECORD_AUDIO>`__: Richiesto quando l'impostazione del progetto `audio/driver/enable_input <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-audio-driver-enable-input>`__ è abilitata.
pt_br: `RECORD_AUDIO <https://developer.android.com/reference/android/Manifest.permission#RECORD_AUDIO>`__: Requisitado quando a configuração de projeto `audio/driver/enable_input <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-audio-driver-enable-input>`__ está habilitada.
ru: `RECORD_AUDIO <https://developer.android.com/reference/android/Manifest.permission#RECORD_AUDIO>`__: Запрашивается, когда включен параметр проекта `audio/driver/enable_input <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-audio-driver-enable-input>`__.
ta: `Record_audio <https://developer.android.com/reference/android/manifest.permission#record_audio> __:` ஆடியோ/இயக்கி/entable_input போது கோரப்பட்டது <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-adio-driver-enable-input> __ திட்ட அமைப்பு இயக்கப்பட்டது.
uk: `RECORD_AUDIO <https://developer.android.com/reference/android/Manifest.permission#RECORD_AUDIO>`__: запит, коли `audio/driver/enable_input <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-audio-driver-enable-input>`__ налаштування проекту ввімкнено.
zh_cn: \`RECORD_AUDIO <https://developer.android.com/reference/android/Manifest.permission#RECORD_AUDIO>`__\ ：当启用了 \`audio/driver/enable_input <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-audio-driver-enable-input>`__\ 项目设置时请求该权限。
zh_hant: `RECORD_AUDIO <https://developer.android.com/reference/android/Manifest.permission#RECORD_AUDIO>`__: 在啟用 `audio/driver/enable_input <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-audio-driver-enable-input>`__ 專案設定時請求。

source: `USE_SCENE <https://developers.meta.com/horizon/documentation/native/native-spatial-data-perm/>`__: Required to enable and access the scene APIs when running an XR project.
es: `USE_SCENE <https://developers.meta.com/horizon/documentation/native/native-spatial-data-perm/>`__: Necesario para habilitar y acceder a las API de escena cuando se ejecuta un proyecto XR.
fr: `USE_SCENE <https://developers.meta.com/horizon/documentation/native/native-spatial-data-perm/>`__ : Requis pour activer et accéder aux API de scène lors de l'exécution d'un projet XR.
it: `USE_SCENE <https://developers.meta.com/horizon/documentation/native/native-spatial-data-perm/>`__: Richiesto per abilitare e accedere alle API di scena durante l'esecuzione di un progetto XR.
pt_br: `USE_SCENE <https://developers.meta.com/horizon/documentation/native/native-spatial-data-perm/>`__: Necessário para habilitar e acessar as APIs de cena ao executar um projeto XR.
ru: `USE_SCENE <https://developers.meta.com/horizon/documentation/native/native-spatial-data-perm/>`__: Требуется для включения и доступа к API сцены при запуске проекта XR.
ta: `Use_scene <https://developers.meta.com/horizon/documentation/native/native-spatial-data-berm/> __: ஒரு எக்ச்ஆர் திட்டத்தை இயக்கும் போது காட்சி பநிஇ களை இயக்கவும் அணுகவும் தேவை.
uk: `USE_SCENE <https://developers.meta.com/horizon/documentation/native/native-spatial-data-perm/>`__: необхідний для ввімкнення та доступу до API сцени під час запуску проекту XR.
zh_cn: \`USE_SCENE <https://developers.meta.com/horizon/documentation/native/native-spatial-data-perm/>`__\ ：在运行 XR 项目时，启用并访问场景 API 所需的权限。
zh_hant: `USE_SCENE <https://developers.meta.com/horizon/documentation/native/native-spatial-data-perm/>`__: 執行 XR 專案時，需要啟用並存取場景 API。

source: Tips & Tricks
es: Consejos y trucos
fr: Trucs & Astuces
it: Consigli e trucchi
pt_br: Dicas e truques
ru: Советы и хитрости
ta: உதவிக்குறிப்புகள் மற்றும் தந்திரங்கள்
uk: Поради та підказки
zh_cn: 提示与技巧
zh_hant: 技巧與訣竅

source: **Input**
es: **Entrada**
fr: **Entrée**
ru: **Input (Вход)**
ta: ** உள்ளீடு **
uk: **Введення**
zh_cn: **输入**
zh_hant: **輸入**

source: For the best experience and high level of productivity, connecting a bluetooth keyboard & mouse is recommended to interact with the XR editor. The XR editor supports all of the `usual shortcuts and key mappings <https://docs.godotengine.org/en/stable/tutorials/editor/default_key_mapping.html>`__.
es: Para una mejor experiencia y un alto nivel de productividad, se recomienda conectar un teclado y un ratón Bluetooth para interactuar con el editor XR. El editor XR admite todos los atajos y asignaciones de teclas habituales (https://docs.godotengine.org/en/stable/tutorials/editor/default_key_mapping.html).
fr: Pour une meilleure expérience et un haut niveau de productivité, il est recommandé de connecter un clavier et une souris bluetooth pour interagir avec l'éditeur XR. L'éditeur XR prend en charge tous les `raccourcis habituels et mappages de touches <https://docs.godotengine.org/en/stable/tutorials/editor/default_key_mapping.html>`__.
it: Per un'esperienza ottimale e un alto livello di produttività, si consiglia di collegare una tastiera e un mouse Bluetooth per interagire con l'editor XR. L'editor XR supporta tutte le `scorciatoie e le mappature dei tasti più comuni <https://docs.godotengine.org/en/stable/tutorials/editor/default_key_mapping.html>`__.
pt_br: Para a melhor experiência e um alto nível de produtividade, recomenda-se conectar um teclado e mouse bluetooth para interagir com o editor XR. O editor XR oferece suporte a todos os `atalhos e mapeamentos de teclas usuais <https://docs.godotengine.org/en/stable/tutorials/editor/default_key_mapping.html>`__.
ru: Для лучшего опыта и высокого уровня производительности рекомендуется подключить клавиатуру и мышь Bluetooth для взаимодействия с редактором XR. Редактор XR поддерживает все `обычные сочетания клавиш и сопоставления клавиш <https://docs.godotengine.org/en/stable/tutorials/editor/default_key_mapping.html>`__.
ta: சிறந்த பட்டறிவு மற்றும் உயர் மட்ட உற்பத்தித்திறனுக்காக, ஊடலை விசைப்பலகை மற்றும் சுட்டியை இணைப்பது எக்ச்ஆர் எடிட்டருடன் தொடர்பு கொள்ள பரிந்துரைக்கப்படுகிறது. எக்ச்ஆர் எடிட்டர் `வழக்கமான குறுக்குவழிகள் மற்றும் முக்கிய வரைபடங்கள் <https://docs.godotengine.org/en/stable/tutorials/editor/default_key_mapph.html> __.
uk: Для найкращого досвіду та високого рівня продуктивності рекомендується підключити клавіатуру та мишу Bluetooth для взаємодії з редактором XR. Редактор XR підтримує всі `звичайні комбінації клавіш і зіставлення клавіш <https://docs.godotengine.org/en/stable/tutorials/editor/default_key_mapping.html>`__.
zh_cn: 为了获得最佳体验和高效工作效率，建议连接蓝牙键盘和鼠标来与 XR 编辑器进行交互。XR 编辑器支持所有 \`常用快捷键和键位映射 <https://docs.godotengine.org/en/stable/tutorials/editor/default_key_mapping.html>`__\ 。
zh_hant: 為了獲得最佳體驗和高生產力，建議連接藍牙鍵盤與滑鼠以便與 XR 編輯器互動。XR 編輯器支援所有\`常見捷徑與按鍵對應<https://docs.godotengine.org/en/stable/tutorials/editor/default_key_mapping.html>\`__ 。
