Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/using_the_web_editor.po
Languages: ga, it, ta, tr

source: You can download the project files as a ZIP archive by using **Project > Tools > Download Project Source**. This can be used to export the project using a `native Godot editor <https://godotengine.org/download>`__, since exporting from the web editor isn't supported yet.
ga: Is féidir leat comhaid an tionscadail a íoslódáil mar chartlann ZIP trí úsáid a bhaint as ** Tionscadal > Uirlisí > Íoslódáil Foinse an Tionscadail**. Is féidir é seo a úsáid chun an tionscadal a easpórtáil trí úsáid a bhaint as `eagarthóir Godot dúchais <https://godotengine.org/download>`__, mar ní thacaítear fós le heaspórtáil ón eagarthóir Gréasáin.
it: È possibile scaricare i file di progetto come archivio ZIP tramite **Progetto > Strumenti > Scarica sorgente del progetto**. Questo si può utilizzare per esportare il progetto attraverso un `editor Godot nativo <https://godotengine.org/download>`__, poiché l'esportazione dall'editor web non è ancora supportata.
ta: ** திட்டம்> கருவிகள்> திட்ட மூலத்தைப் பதிவிறக்குவதன் மூலம் திட்டக் கோப்புகளை சிப் காப்பகமாக பதிவிறக்கம் செய்யலாம். வலை எடிட்டரிடமிருந்து ஏற்றுமதி செய்வது இன்னும் ஆதரிக்கப்படவில்லை என்பதால், `சொந்த கோடோட் எடிட்டர் <https://godotengine.org/download> __ ஐப் பயன்படுத்தி திட்டத்தை ஏற்றுமதி செய்ய இதைப் பயன்படுத்தலாம்.
tr: Proje dosyalarını **Proje > Araçlar > Download Project Source** kullanarak bir ZIP arşivi olarak indirebilirsiniz. Bu, web düzenleyiciden dışa aktarma henüz desteklenmediğinden, projeyi bir `yerel Godot düzenleyici <https://godotengine.org/download>`__ kullanarak dışa aktarmak için kullanılabilir.

source: In the future, it may be possible to use the `HTML5 FileSystem API <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>`__ to store the project files on the user's filesystem as the native editor would do. However, this isn't implemented yet.
ga: Amach anseo, b'fhéidir go mbeifear in ann an `HTML5 FileSystem API a úsáid <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>`__ chun comhaid an tionscadail a stóráil ar chóras comhaid an úsáideora mar dhéanfadh an t-eagarthóir dúchais. Mar sin féin, níl sé seo curtha i bhfeidhm go fóill.
it: In futuro, potrebbe essere possibile utilizzare l'`API di FileSystem HTML5 <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>`__ per memorizzare i file di progetto sul file system dell'utente, come farebbe l'editor nativo. Tuttavia, questa funzionalità non è ancora implementata.
ta: எதிர்காலத்தில், `HTML5 கோப்பு முறைமை பநிஇ <https://developer.mozilla.org/en-us/docs/web/api/filesyste சொந்த ஆசிரியர் செய்வார். இருப்பினும், இது இன்னும் செயல்படுத்தப்படவில்லை.
tr: Gelecekte, proje dosyalarını yerel düzenleyicinin yaptığı gibi kullanıcının dosya sisteminde depolamak için `HTML5 FileSystem API <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>`__ kullanmak mümkün olabilir. Ancak, bu henüz uyarlanmamıştır.
