Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/class_reference/index.po
Languages: it, ru, ta, uk

source: ``Line 2.``
it: ``Riga 2.``
ta: `` வரி 2.``

source: Line 1.
it: Riga 1.
ru: Строка 1.
ta: வரி 1.
uk: Рядок 1.

source: Line 2.
it: Riga 2.
ru: Строка 2.
ta: வரி 2.
uk: Рядок 2.

source: ``[`` and ``]`` respectively
it: ``[`` e ``]`` rispettivamente
ru: ``[`` and ``]`` соответственно
ta: `` [`` மற்றும் ``] `முறையே
uk: ``[`` і ``]`` відповідно

source: ``[lb]b[rb]text[lb]/b[rb]``
it: ``[lb]b[rb]testo[lb]/b[rb]``
ta: `` [lb] b [rb] உரை [lb]/b [rb] ``

source: [b]text[/b]
it: [b]testo[/b]
ta: [b] உரை [/b]

source: Bold
it: Grassetto
ru: Жирный
ta: தடிமான
uk: Напівжирний

source: ``Do [b]not[/b] call this method.``
it: ``[b]Non[/b] chiamare questo metodo.``
ru: ``[b]Не[/b] вызывайте этот метод.``
ta: `` செய்யுங்கள் [b] [/b] இந்த முறையை அழைக்கவும் .``
uk: ``[b]Не[/b] викликайте цей метод.``

source: Do **not** call this method.
it: **Non** chiamare questo metodo.
ru: **Не** вызывайте этот метод.
ta: செய்யுங்கள் ** இல்லை ** இந்த முறையை அழைக்கவும்.
uk: **Не** викликайте цей метод.

source: Italic
it: Corsivo
ta: சாய்வு
uk: Курсив

source: ``Returns the [i]global[/i] position.``
it: ``Restituisce la posizione [i]globale[/i].``
ru: ``Возвращает [i]глобальную[/i] позицию.``
ta: `` [I] உலகளாவிய [/i] நிலையை வழங்குகிறது .``
uk: ``Повертає [i]глобальну[/i] позицію.``

source: Returns the *global* position.
it: Restituisce la posizione *globale*.
ru: Возвращает *глобальную* позицию.
ta: * உலகளாவிய * நிலையை வழங்குகிறது.
uk: Повертає *глобальну* позицію.

source: Underline
it: Sottolinea
ru: Подчеркнуть
ta: அடிக்கோடிட்டு
uk: Підкреслити

source: ``[u]Always[/u] use this method.``
it: ``Usa [u]sempre[/u] questo metodo.``
ru: ``[u]Всегда[/u] используйте этот метод.``
ta: `` [u] எப்போதும் [/u] இந்த முறையைப் பயன்படுத்தவும் .``
uk: ``[u]Завжди[/u] використовуйте цей метод.``

source: ``[s]`` ``[/s]``
ta: `` கள்] `` ``/கள்] ``

source: Strikethrough
it: Barrato
ru: Зачеркивание
ta: ச்ட்ரைகெத்ரோ
uk: Закреслення

source: ``[s]Outdated information.[/s]``
it: ``[s]Informazioni obsolete.[/s]``
ru: ``[s]Устаревшая информация.[/s]``
ta: `` [கள்] காலாவதியான செய்தி. [/கள்] ``
uk: ``[s]Застаріла інформація.[/s]``

source: Hyperlink
it: Collegamento ipertestuale
ru: Гиперссылка
ta: ஐப்பர்லிங்க்
uk: Гіперболічний синус

source: ``[url=https://example.com]Website[/url]``
ta: `` [url = https: //example.com] வலைத்தளம் [/url] ``

source: `Website <https://example.com>`_
it: `Sito web <https://example.com>`_
ta: `வலைத்தளம் <https://example.com>` _

source: ``[center]`` ``[/center]``
ta: `` [மையம்] `` `` [/மையம்] ``

source: Horizontal centering
it: Centratura orizzontale
ru: Горизонтальное центрирование
ta: கிடைமட்ட நடுவண்
uk: Горизонтальне центрування

source: ``[center]2 + 2 = 4[/center]``
ta: `` [மையம்] 2 + 2 = 4 [/மையம்] ``

source: Keyboard/mouse shortcut
it: Scorciatoia da tastiera/mouse
ru: Сочетание клавиш/мыши
ta: விசைப்பலகை/சுட்டி குறுக்குவழி
uk: Комбінація клавіш/миші

source: ``Press [kbd]Ctrl + C[/kbd].``
it: ``Premi [kbd]Ctrl + C[/kbd].``
ta: `` [Kbd] கட்டுப்பாடு + c [/kbd] ஐ அழுத்தவும் .``
uk: ``Натисніть [kbd]Ctrl + C[/kbd].``

source: Press :kbd:`Ctrl + C`.
it: Premi :kbd:`Ctrl + C`.
ru: Нажмите :kbd:`Ctrl + C`.
ta: அழுத்தவும்: KBD: `ctrl + c`.
uk: Натисніть :kbd:`Ctrl + C`.

source: ``[code]`` ``[/code]``
ta: `` [குறியீடு] `` `` [/குறியீடு] ``

source: Inline code fragment
it: Frammento di codice in riga
ru: Фрагмент встроенного кода
ta: இன்லைன் குறியீடு துண்டு
uk: Вбудований фрагмент коду

source: ``Returns [code]true[/code].``
it: ``Restituisce [code]true[/code].``
ru: ``Возвращает [code]true[/code].``
ta: `` [குறியீடு] உண்மை [/குறியீடு] ஐ வழங்குகிறது .``
uk: ``Повертає [code]true[/code].``

source: Returns ``true``.
it: Restituisce ``true``.
ru: Возвращает ``true``.
ta: `` உண்மை`` தருகிறது.
uk: Повертає ``true``.

source: Some supported tags like ``[color]`` and ``[font]`` are not listed here because they are not recommended in the engine documentation.
it: Alcuni tag supportati come ``[color]`` e ``[font]`` non sono elencati qui perché non sono consigliati nella documentazione del motore.
ru: Некоторые поддерживаемые теги как ``[color]`` and ``[font]`` не приведены здесь, потому что не рекомендованы в документации движка.
ta: `` [வண்ணம்] `` `மற்றும்` `[எழுத்துரு]` போன்ற சில உதவி குறிச்சொற்கள் இங்கே பட்டியலிடப்படவில்லை, ஏனெனில் அவை இயந்திர ஆவணங்களில் பரிந்துரைக்கப்படவில்லை.
uk: Деякі підтримувані теги, такі як ``[color]`` і ``[font]`` не перераховані тут, оскільки вони не рекомендовані в документації двигуна.

source: ``[kbd]`` disables BBCode until the parser encounters ``[/kbd]``.
it: ``[kbd]`` disattiva il BBCode finché il parser non incontra ``[/kbd]``.
ru: ``[kbd]`` отключает BBCode до тех пор, пока анализатор не встретит ``[/kbd]``.
ta: `` [KBD] `` பாகுபடுத்தி `` [/kbd] `` `` ``.
uk: ``[kbd]`` вимикає BBCode, поки аналізатор не зустріне ``[/kbd]``.

source: ``[code]`` disables BBCode until the parser encounters ``[/code]``.
it: ``[code]`` disattiva il BBCode finché il parser non incontra ``[/code]``.
ru: ``[code]`` отключает BBCode до тех пор, пока анализатор не встретит ``[/code]``.
ta: `` [குறியீடு] `` பாகுபடுத்தி `` [/குறியீடு] `` ஐ எதிர்கொள்ளும் வரை பிப்கோடை முடக்குகிறது.
uk: ``[code]`` вимикає BBCode, доки аналізатор не зустріне ``[/code]``.

source: Formatting code blocks
it: Formattazione dei blocchi di codice
ru: Блоки форматирования
ta: குறியீடு தொகுதிகளை வடிவமைத்தல்
uk: Форматування блоків коду

source: There are two options for formatting code blocks:
it: Ci sono due opzioni per formattare i blocchi di codice:
ru: Существует два варианта форматирования блоков:
ta: குறியீடு தொகுதிகளை வடிவமைப்பதற்கு இரண்டு விருப்பங்கள் உள்ளன:
uk: Є два варіанти форматування блоків коду:

source: Use ``[codeblock]`` if you want to add an example for a specific language.
it: Usa ``[codeblock]`` se desideri aggiungere un esempio per un linguaggio specifico.
ru: Используйте ``[codeblock]`` если вы хотите добавить пример для определенного языка.
ta: ஒரு குறிப்பிட்ட மொழிக்கு நீங்கள் ஒரு உதாரணத்தை சேர்க்க விரும்பினால் `` [குறியீட்டு பிளாக்] `` பயன்படுத்தவும்.
uk: Використовуйте ``[codeblock]``, якщо ви хочете додати приклад для певної мови.

source: Use ``[codeblocks]``, ``[gdscript]``, and ``[csharp]`` if you want to add the same example for both languages, GDScript and C#.
it: Usa ``[codeblocks]``, ``[gdscript]`` e ``[csharp]`` se desideri aggiungere lo stesso esempio per entrambi i linguaggi, GDScript e C#.
ru: Используйте ``[codeblocks]``, ``[gdscript]``,и ``[csharp]`` если вы хотите добавить такой же пример для обоих языков, GDScript и C#.
ta: `` [கோட் பிளாக்ச்] ``, `` [gdscript] `` `, மற்றும்` `[csharp]` `` `ஆகிய இரு மொழிகளுக்கும் ஒரே உதாரணத்தை சேர்க்க விரும்பினால், gdscript மற்றும் c#ஐப் பயன்படுத்தவும்.
uk: Використовуйте ``[codeblocks]``, ``[gdscript]`` і ``[csharp]``, якщо ви хочете додати той самий приклад для обох мов, GDScript і C#.

source: By default, ``[codeblock]`` highlights GDScript syntax. You can change it using the ``lang`` attribute. Currently supported options are:
it: Normalmente, ``[codeblock]`` evidenzia la sintassi in GDScript. È possibile modificarla utilizzando l'attributo ``lang``. Le opzioni attualmente supportate sono:
ru: По умолчанию ``[codeblock]`` подсвечивает синтаксис GDScript. Вы можете изменить это с помощью атрибута ``lang``. В настоящее время поддерживаются следующие параметры:
ta: இயல்பாக, `` [codeBlock] `` Gdscript தொடரியல் முன்னிலைப்படுத்துகிறது. `` லாங்`` பண்பைப் பயன்படுத்தி அதை மாற்றலாம். தற்போது ஆதரிக்கப்படும் விருப்பங்கள்:
uk: За замовчуванням ``[codeblock]`` підсвічує синтаксис GDScript. Ви можете змінити його за допомогою атрибута ``lang``. Наразі підтримуються такі варіанти:

source: ``[codeblock lang=text]`` disables syntax highlighting;
it: ``[codeblock lang=text]`` disabilita l'evidenziazione della sintassi;
ru: ``[codeblock lang=text]`` отключает подсветку синтаксиса;
ta: `` [குறியீடு தொகுதி மொழி = உரை] `` முடக்கப்பட்ட தொடரியல் சிறப்பம்சமாக;
uk: ``[codeblock lang=text]`` вимикає підсвічування синтаксису;

source: ``[codeblock lang=csharp]`` highlights C# syntax (only in .NET version).
it: ``[codeblock lang=csharp]`` evidenzia la sintassi in C# (solamente nella versione .NET).
ru: ``[codeblock lang=csharp]`` подсвечивает синтаксис C# (только в версии .NET).
ta: `` [குறியீடு தொகுதிகள் lang = csharp] `` சி# தொடரியல் (நெட் பதிப்பில் மட்டுமே) முன்னிலைப்படுத்தவும்.
uk: ``[codeblock lang=csharp]`` підсвічує синтаксис C# (лише у версії .NET).

source: ``[codeblock]`` disables BBCode until the parser encounters ``[/codeblock]``.
it: ``[codeblock]`` disattiva il BBCode finché il parser non incontra ``[/codeblock]``.
ru: ``[codeblock]`` отключает BBCode до тех пор, пока анализатор не встретит ``[/codeblock]``.
ta: `` [குறியீடு தொகுதிகள்] `` பார்சர் `` [/குறியீடு தொகுதி] `` ஐ எதிர்கொள்ளும் வரை `` முடக்கப்பட்டது.
uk: ``[codeblock]`` вимикає BBCode, доки аналізатор не зустріне ``[/codeblock]``.

source: For example:
it: Per esempio:
ru: Например:
ta: உதாரணமாக:
uk: Приклад:

source: Will display as:
it: Verrà visualizzato come:
ru: Будет показано как:
ta: இவ்வாறு காண்பிக்கப்படும்:
uk: Відображатиметься як:

source: If you need to have different code version in GDScript and C#, use ``[codeblocks]`` instead. If you use ``[codeblocks]``, you also need to have at least one of the language-specific tags, ``[gdscript]`` and ``[csharp]``.
it: Se è necessario avere versioni diverse di codice in GDScript e C#, usa invece ``[codeblocks]``. Se usi ``[codeblocks]``, devi anche avere almeno uno dei tag specifici della lingua, ``[gdscript]`` e ``[csharp]``.
ru: Если нужно одновременно иметь код в GDScript и C#, заключайте его в ``[codeblock]``, а также используйте специфические теги, такие как ``[gdscript]`` и ``[csharp]``.
ta: GDSCRIPT மற்றும் C#இல் நீங்கள் வெவ்வேறு குறியீடு பதிப்பைக் கொண்டிருக்க வேண்டும் என்றால், அதற்கு பதிலாக `` [CodeBlocks] `` ஐப் பயன்படுத்தவும். நீங்கள் `` [கோட் பிளாக்ச்] `` ஐப் பயன்படுத்தினால், மொழி சார்ந்த குறிச்சொற்களில் குறைந்தபட்சம் ஒன்றைக் கொண்டிருக்க வேண்டும், `` [gdscript] `` மற்றும் `` [csharp] ``.
uk: Якщо вам потрібна інша версія коду в GDScript і C#, використовуйте натомість ``[codeblocks]``. Якщо ви використовуєте ``[codeblocks]``, вам також потрібно мати принаймні один із специфічних для мови тегів ``[gdscript]`` і ``[csharp]``.

source: Always write GDScript code examples first! You can use this `experimental code translation tool <https://github.com/HaSa1002/codetranslator>`_ to speed up your workflow.
it: Scrivi sempre prima gli esempi di codice in GDScript! Puoi usare questo ` strumento sperimentale di traduzione del codice <https://github.com/HaSa1002/codetranslator>`_ per velocizzare il tuo flusso di lavoro.
ru: Всегда сначала пишите примеры кода GDScript! Вы можете использовать этот `экспериментальный инструмент перевода кода <https://github.com/HaSa1002/codetranslator>`_ для ускорения рабочего процесса.
ta: எப்போதும் GDSCRIPT குறியீடு எடுத்துக்காட்டுகளை முதலில் எழுதுங்கள்! உங்கள் பணிப்பாய்வுகளை விரைவுபடுத்த இந்த `சோதனை குறியீடு மொழிபெயர்ப்பு கருவியை <https://github.com/hasa1002/codetranslator> _ _ பயன்படுத்தலாம்.
uk: Завжди спочатку пишіть приклади коду GDScript! Ви можете використовувати цей `експериментальний інструмент перекладу коду <https://github.com/HaSa1002/codetranslator>`_, щоб пришвидшити робочий процес.

source: The above will display as:
it: Quanto sopra apparirà come:
ru: Снизу будет отображено как:
ta: மேலே உள்ளவை இவ்வாறு காண்பிக்கப்படும்:
uk: Вище відображатиметься так:

source: Formatting notes and warnings
it: Formattazione di note e avvertenze
ru: Форматирование заметок и предупреждений
ta: குறிப்புகள் மற்றும் எச்சரிக்கைகளை வடிவமைத்தல்
uk: Форматування приміток і попереджень

source: To denote important information, add a paragraph starting with "[b]Note:[/b]" at the end of the description:
it: Per indicare informazioni importanti, aggiungi un paragrafo che inizia con "[b]Nota:[/b]" alla fine della descrizione:
ru: Чтобы обозначить важную информацию, добавьте в конце описания абзац, начинающийся со слов "[b]Note:[/b]" (Примечание:):
ta: முக்கியமான தகவல்களைக் குறிக்க, விளக்கத்தின் முடிவில் "[b] குறிப்பு: [/b]" உடன் தொடங்கி ஒரு பத்தியைச் சேர்க்கவும்:
uk: Щоб позначити важливу інформацію, додайте в кінці опису абзац, який починається з «[b]Примітка:[/b]»:

source: To denote crucial information that could cause security issues or loss of data if not followed carefully, add a paragraph starting with "[b]Warning:[/b]" at the end of the description:
it: Per indicare informazioni cruciali che potrebbero causare problemi di sicurezza o perdita di dati se non seguite attentamente, aggiungi un paragrafo che inizia con "[b]Attenzione:[/b]" alla fine della descrizione:
ru: Чтобы обозначить важную информацию, несоблюдение которой может привести к проблемам безопасности или потере данных, добавьте в конец описания абзац, начинающийся со слов «[b]Warning: (Предупреждение:)[/b]»:
ta: கவனமாக பின்பற்றப்படாவிட்டால் பாதுகாப்பு சிக்கல்கள் அல்லது தரவு இழப்பை ஏற்படுத்தக்கூடிய முக்கியமான தகவல்களைக் குறிக்க, விளக்கத்தின் முடிவில் "[பி] எச்சரிக்கை: [/b]" உடன் தொடங்கி ஒரு பத்தியைச் சேர்க்கவும்:
uk: Щоб позначити важливу інформацію, яка може спричинити проблеми з безпекою або втрату даних, якщо її не дотримуватися, додайте абзац, що починається з «[b]Попередження:[/b]» у кінці опису:

source: In all the paragraphs described above, make sure the punctuation is part of the BBCode tags for consistency.
it: In tutti i paragrafi descritti in precedenza, assicurati che la punteggiatura faccia parte dei tag BBCode per coerenza.
ru: Во всех описанных выше параграфах убедитесь, что знаки препинания являются частью тегов BBCode для соблюдения единообразия.
ta: மேலே விவரிக்கப்பட்ட அனைத்து பத்திகளிலும், நிறுத்தற்குறி பிபிகோட் குறிச்சொற்களின் ஒரு பகுதியாகும் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: У всіх параграфах, описаних вище, переконайтеся, що пунктуація є частиною тегів BBCode для узгодженості.

source: Marking API as deprecated/experimental
it: Segnare l'API come deprecata/sperimentale
ru: Отметка API как устаревшего/экспериментального
ta: பநிஇ நீக்கப்பட்ட/சோதனை எனக் குறிக்கிறது
uk: Позначення API як застарілого/експериментального

source: To mark an API as deprecated or experimental, you need to add the corresponding XML attribute. The attribute value must be a message explaining why the API is not recommended (BBCode markup is supported) or an empty string (the default message will be used). If an API element is marked as deprecated/experimental, then it is considered documented even if the description is empty.
it: Per contrassegnare un'API come deprecata o sperimentale, è necessario aggiungere l'attributo XML corrispondente. Il valore dell'attributo deve essere un messaggio che spiega perché l'API non è consigliata (il markup BBCode è supportato) o una stringa vuota (sarà utilizzato il messaggio predefinito). Se un elemento dell'API è segnato come deprecato/sperimentale, viene considerato documentato anche se la descrizione è vuota.
ru: Чтобы отметить API как устаревший или экспериментальный, необходимо добавить соответствующий XML-атрибут. Значение атрибута должно быть сообщением, объясняющим, почему API не рекомендуется к использованию (поддерживается разметка BBCode), или пустой строкой (будет использовано сообщение по умолчанию). Если элемент API отмечен как устаревший/экспериментальный, он считается задокументированным, даже если описание пустое.
ta: ஒரு பநிஇ ஐ நீக்கப்பட்ட அல்லது சோதனைக்குரியதாகக் குறிக்க, நீங்கள் தொடர்புடைய எக்ச்எம்எல் பண்புக்கூறு சேர்க்க வேண்டும். பண்புக்கூறு மதிப்பு பநிஇ ஏன் பரிந்துரைக்கப்படவில்லை என்பதை விளக்கும் செய்தியாக இருக்க வேண்டும் (BBCODE MARKUP ஆதரிக்கப்படுகிறது) அல்லது வெற்று சரம் (இயல்புநிலை செய்தி பயன்படுத்தப்படும்). ஒரு பநிஇ உறுப்பு நீக்கப்பட்ட/சோதனை எனக் குறிக்கப்பட்டால், விளக்கம் காலியாக இருந்தாலும் அது ஆவணப்படுத்தப்பட்டதாக கருதப்படுகிறது.
uk: Щоб позначити API як застарілий або експериментальний, потрібно додати відповідний атрибут XML. Значення атрибута має бути повідомленням, що пояснює, чому API не рекомендовано (підтримується розмітка BBCode), або порожнім рядком (буде використано повідомлення за замовчуванням). Якщо елемент API позначено як застарілий/експериментальний, він вважається задокументованим, навіть якщо опис порожній.

source: To learn to submit your changes to the Godot project using the Git version control system, see `Class reference contribution documentation <https://contributing.godotengine.org/en/latest/documentation/class_reference.html>`__.
it: Per imparare a inviare le modifiche al progetto Godot attraverso il sistema di controllo versioni Git, consultare <https://contributing.godotengine.org/en/latest/documentation/class_reference.html>`__.
ru: Чтобы узнать, как отправлять изменения в проект Godot с помощью системы контроля версий Git, см. `Документацию по вкладу ссылок на классы <https://contributing.godotengine.org/en/latest/documentation/class_reference.html>`__.
uk: Щоб дізнатися, як надсилати зміни до проєкту Godot за допомогою системи контролю версій Git, див. `Документація щодо внесків у довідкову частину класу <https://contributing.godotengine.org/en/latest/documentation/class_reference.html>`__.

source: Write in a clear and simple language. Always follow the `writing guidelines <https://contributing.godotengine.org/en/latest/documentation/guidelines/docs_writing_guidelines.html>`__ to keep your descriptions short and easy to read. **Do not leave empty lines** in the descriptions: each line in the XML file will result in a new paragraph, even if it is empty.
it: Scrivere in un linguaggio chiaro e semplice. Seguire sempre le `linee guida di scrittura <https://contributing.godotengine.org/en/latest/documentation/guidelines/docs_writing_guidelines.html>`__ per rendere le descrizioni brevi e facili da leggere. **Non lasciare righe vuote** nelle descrizioni: ogni riga nel file XML risulterà in un nuovo paragrafo, anche se è vuota.
ru: Пишите понятным и простым языком. Всегда следуйте `правилам написания <https://contributing.godotengine.org/en/latest/documentation/guidelines/docs_writing_guidelines.html>`__, чтобы ваши описания были краткими и легко читаемыми. **Не оставляйте пустых строк** в описаниях: каждая строка в XML-файле будет начинаться с нового абзаца, даже если она пустая.
uk: Пишіть чіткою та простою мовою. Завжди дотримуйтесь `рекомендацій щодо написання <https://contributing.godotengine.org/en/latest/documentation/guidelines/docs_writing_guidelines.html>`__, щоб ваші описи були короткими та легкими для читання. **Не залишайте порожніх рядків** в описах: кожен рядок у файлі XML призведе до створення нового абзацу, навіть якщо він порожній.

source: Get :ref:`Node2D.scale <class_Node2D_property_scale>`.
it: Ottieni :ref:`Node2D.scale <class_Node2D_property_scale>`.
ru: Получите :ref:`Node2D.scale <class_Node2D_property_scale>`.
uk: Отримати :ref:`Node2D.scale <class_Node2D_property_scale>`.

source: ``[codeblock lang=gdscript]`` highlights GDScript syntax;
it: ``[codeblock lang=gdscript]`` evidenzia la sintassi in GDScript;
ru: ``[codeblock lang=gdscript]`` подсвечивает синтаксис GDScript;
uk: ``[codeblock lang=gdscript]`` підсвічує синтаксис GDScript;

source: Use ``[codeblock]`` for pre-formatted code blocks. Since Godot 4.5, **tabs** should be used for indentation.
it: Usa ``[codeblock]`` per i blocchi di codice preformattati. A partire da Godot 4.5, Si dovrebbero utilizzare **tabulazioni** per l'indentazione.
ru: Используйте ``[codeblock]`` для предварительно отформатированных блоков кода. Начиная с Godot 4.5, для разделения должны использоваться **отступы**.
uk: Використовуйте ``[codeblock]`` для попередньо відформатованих блоків коду. Починаючи з Godot 4.5, для відступів слід використовувати **табуляцію**.
