Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/class_reference/index.po
Languages: it, ru, ta, uk

source: Class reference primer
it: Principio di riferimento classi
ru: Справочник по классам
ta: வகுப்பு குறிப்பு ப்ரைமர்
uk: Базовий буквар класу

source: This page explains how to write the class reference. You will learn where to write new descriptions for the classes, methods, and properties for Godot's built-in node types.
it: Questa pagina spiega come scrivere il riferimento alle classi. Descrive dove scrivere nuove descrizioni per classi, metodi e proprietà per i tipi di nodo predefiniti di Godot.
ru: Эта страница объясняет, как написать ссылку на класс. Вы узнаете, где писать новые описания для классов, методов и свойств встроенных узлов Godot.
ta: வகுப்பு குறிப்பை எவ்வாறு எழுதுவது என்பதை இந்த பக்கம் விளக்குகிறது. கோடோட்டின் உள்ளமைக்கப்பட்ட முனை வகைகளுக்கான வகுப்புகள், முறைகள் மற்றும் பண்புகளுக்கு புதிய விளக்கங்களை எங்கு எழுதுவது என்பதை நீங்கள் கற்றுக்கொள்வீர்கள்.
uk: На цій сторінці пояснюється, як написати посилання на клас. Ви дізнаєтеся, де писати нові описи для класів, методів і властивостей для типів вбудованих вузлів Godot.

source: The reference for each class is contained in an XML file like the one below:
it: Il riferimento per ogni classe è contenuto in un file XML come quello seguente:
ru: Ссылка на каждый класс содержится в XML-файле, подобном приведенному ниже:
ta: ஒவ்வொரு வகுப்பிற்கான குறிப்பு கீழே உள்ளதைப் போன்ற எக்ச்எம்எல் கோப்பில் உள்ளது:
uk: Посилання на кожен клас міститься у файлі XML, подібному до наведеного нижче:

source: It starts with brief and long descriptions. In the generated docs, the brief description is always at the top of the page, while the long description lies below the list of methods, variables, and constants. You can find methods, member variables, constants, and signals in separate XML nodes.
it: Comincia con descrizioni brevi e lunghe. Nei documenti generati, la descrizione breve si trova sempre in cima alla pagina, mentre la descrizione lunga si trova sotto l'elenco di metodi, variabili e costanti. Metodi, variabili membro, costanti e segnali si trovano in nodi XML separati.
ru: Всё начинается с краткого и полного описаний. В сгенерированной документации краткое описание всегда находится в верхней части страницы, а полное — под списком методов, переменных и констант. Методы, переменные-члены, константы и сигналы находятся в отдельных узлах XML.
ta: இது சுருக்கமான மற்றும் நீண்ட விளக்கங்களுடன் தொடங்குகிறது. உருவாக்கப்பட்ட டாக்சில், சுருக்கமான விளக்கம் எப்போதும் பக்கத்தின் உச்சியில் இருக்கும், அதே நேரத்தில் நீண்ட விளக்கம் முறைகள், மாறிகள் மற்றும் மாறிலிகளின் பட்டியலுக்கு கீழே உள்ளது. தனித்தனி எக்ச்எம்எல் முனைகளில் முறைகள், உறுப்பினர் மாறிகள், மாறிலிகள் மற்றும் சமிக்ஞைகளை நீங்கள் காணலாம்.
uk: Починається з коротких і довгих описів. У згенерованих документах короткий опис завжди знаходиться у верхній частині сторінки, тоді як довгий опис знаходиться під списком методів, змінних і констант. Ви можете знайти методи, змінні-члени, константи та сигнали в окремих вузлах XML.

source: For each, you want to learn how they work in Godot's source code. Then, fill their documentation by completing or improving the text in these tags:
ru: Для каждого из них вам необходимо изучить, как они работают в исходном коде Godot. Затем заполните документацию, дополнив или улучшив текст в следующих тегах:
ta: ஒவ்வொன்றிற்கும், கோடோட்டின் மூலக் குறியீட்டில் அவை எவ்வாறு செயல்படுகின்றன என்பதை நீங்கள் அறிய விரும்புகிறீர்கள். பின்னர், இந்த குறிச்சொற்களில் உரையை நிறைவு செய்வதன் மூலம் அல்லது மேம்படுத்துவதன் மூலம் அவற்றின் ஆவணங்களை நிரப்பவும்:
uk: Для кожного ви хочете дізнатися, як вони працюють у вихідному коді Godot. Потім заповніть їхню документацію, доповнивши або покращивши текст у цих тегах:

source: `<brief_description>`
ta: `<சுருக்கமான விளக்கம்>`

source: `<description>`
ta: `<விளக்கம்>`

source: `<constant>`
ta: `<nountantal>`
uk: `<константа>`

source: `<method>` (in its `<description>` tag; return types and arguments don't take separate documentation strings)
it: `<method>` (nel suo tag `<description>`; i tipi restituiti e gli argomenti non richiedono stringhe di documentazione separate)
ru: `<method>` (в теге `<description>`; возвращаемые типы и аргументы не занимают отдельные строки документации)
ta: `<முறை>` (அதன் `<விளக்கம்> குறிச்சொல்; திரும்பும் வகைகள் மற்றும் வாதங்கள் தனி ஆவணப்படுத்தல் சரங்களை எடுக்க வேண்டாம்)
uk: `<method>` (у його тегу `<description>`; типи повернення та аргументи не приймають окремих рядків документації)

source: `<member>`
ta: `<உறுப்பினர்>`

source: `<signal>` (in its `<description>` tag; arguments don't take separate documentation strings)
it: `<signal>` (nel suo tag `<description>`; gli argomenti non richiedono stringhe di documentazione separate)
ru: `<signal>` (в теге `<description>`; аргументы не занимают отдельные строки документации)
ta: `<சமிக்ஞை>` (அதன் `<விளக்கம்>` குறிச்சொல்லில்; வாதங்கள் தனி ஆவணப்படுத்தல் சரங்களை எடுக்க வேண்டாம்)
uk: `<signal>` (у його тегу `<description>`; аргументи не приймають окремих рядків документації)

source: How to edit class XML
it: Come modificare un XML di classe
ru: Как отредактировать класс XML
ta: வகுப்பு நீகுமொ ஐ எவ்வாறு திருத்துவது
uk: Як редагувати XML класу

source: Edit the file for your chosen class in ``doc/classes/`` to update the class reference. The folder contains an XML file for each class. The XML lists the constants and methods you will find in the class reference. Godot generates and updates the XML automatically.
it: Modificare il file della classe scelta in ``doc/classes/`` per aggiornare il riferimento alla classe. La cartella contiene un file XML per ogni classe. Il file XML elenca le costanti e i metodi presenti nel riferimento alla classe. Godot genera e aggiorna automaticamente il file XML.
ru: Отредактируйте файл выбранного класса в ``doc/classes/``, чтобы обновить ссылку на класс. В этой папке содержится XML-файл для каждого класса. В XML-файле перечислены константы и методы, которые вы найдете в ссылке на класс. Godot автоматически генерирует и обновляет XML-файл.
ta: வகுப்பு குறிப்பைப் புதுப்பிக்க நீங்கள் தேர்ந்தெடுத்த வகுப்பிற்கான கோப்பை `` டாக்/வகுப்புகள்/`` இல் திருத்தவும். கோப்புறையில் ஒவ்வொரு வகுப்பிற்கும் ஒரு எக்ச்எம்எல் கோப்பு உள்ளது. வகுப்பு குறிப்பில் நீங்கள் காணும் மாறிலிகள் மற்றும் முறைகளை எக்ச்எம்எல் பட்டியலிடுகிறது. கோடோட் தானாக எக்ச்எம்எல்லை உருவாக்கி புதுப்பிக்கிறது.
uk: Відредагуйте файл для вибраного класу в ``doc/classes/``, щоб оновити посилання на клас. Папка містить файл XML для кожного класу. XML містить перелік констант і методів, які ви знайдете в довідці про клас. Godot створює та оновлює XML автоматично.

source: For some modules in the engine's source code, you'll find the XML files in the ``modules/<module_name>/doc_classes/`` directory instead.
it: Per alcuni moduli nel codice sorgente del motore, i file XML sono situati invece nella cartella ``modules/<nome_modulo>/doc_classes/``.
ru: Для некоторых модулей в исходном коде движка XML-файлы находятся в каталоге ``modules/<module_name>/doc_classes/``.
ta: இயந்திரத்தின் மூலக் குறியீட்டில் உள்ள சில தொகுதிகளுக்கு, எக்ச்எம்எல் கோப்புகளை `` தொகுதிகள்/<தொகுதி_நாம்>/doc_classes/`` கோப்பகத்தில் காணலாம்.
uk: Для деяких модулів у вихідному коді механізму ви знайдете файли XML у каталозі ``modules/<module_name>/doc_classes/``.

source: Edit it using your favorite text editor. If you use a code editor, make sure that it doesn't change the indent style: you should use tabs for the XML and four spaces inside BBCode-style blocks. More on that below.
it: Modificalo tramite un editor di testo a piacere. Se si usa un editor di codice, assicurarsi che non modifichi lo stile di indentazione: si dovrebbero utilizzare le tabulazioni per l'XML e quattro spazi all'interno dei blocchi in stile BBCode. Maggiori informazioni di seguito.
ru: Отредактируйте его в вашем любимом текстовом редакторе. Если вы используете редактор кода, убедитесь, что он не меняет стиль отступов: для XML следует использовать табуляцию, а внутри блоков в стиле BBCode — четыре пробела. Подробнее об этом ниже.
ta: உங்களுக்கு பிடித்த உரை எடிட்டரைப் பயன்படுத்தி அதைத் திருத்தவும். நீங்கள் ஒரு குறியீடு எடிட்டரைப் பயன்படுத்தினால், அது உள்தள்ளல் பாணியை மாற்றாது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்: நீங்கள் எக்ச்எம்எல் மற்றும் பிபிகோட் பாணி தொகுதிகளுக்குள் நான்கு இடங்களைப் பயன்படுத்த வேண்டும். மேலும் கீழே.
uk: Відредагуйте його за допомогою улюбленого текстового редактора. Якщо ви використовуєте редактор коду, переконайтеся, що він не змінює стиль відступу: ви повинні використовувати вкладки для XML і чотири пробіли всередині блоків у стилі BBCode. Детальніше про це нижче.

source: To check that the modifications you've made are correct in the generated documentation, navigate to the ``doc/`` folder and run the command ``make rst``. This will convert the XML files to the online documentation's format and output errors if anything's wrong.
it: Per verificare che le modifiche apportate siano corrette nella documentazione generata, navigare alla cartella ``doc/`` ed eseguire il comando ``make rst``. Questo convertirà i file XML nel formato della documentazione online e segnalerà eventuali errori.
ru: Чтобы проверить корректность внесённых вами изменений в сгенерированную документацию, перейдите в папку ``doc/`` и выполните команду ``make rst``. Это преобразует XML-файлы в формат онлайн-документации и выведет сообщения об ошибках, если что-то не так.
ta: உருவாக்கப்பட்ட ஆவணங்களில் நீங்கள் உருவாக்கிய மாற்றங்கள் சரியானவை என்பதைச் சரிபார்க்க, `` டாக்/`` கோப்புறையில் செல்லவும், கட்டளையை `` rst`` செய்யுங்கள். இது எக்ச்எம்எல் கோப்புகளை நிகழ்நிலை ஆவணத்தின் வடிவமைப்பு மற்றும் ஏதேனும் தவறு இருந்தால் வெளியீட்டு பிழைகள் என மாற்றும்.
uk: Щоб перевірити правильність внесених вами змін у створеній документації, перейдіть до папки ``doc/`` і виконайте команду ``make rst``. Це перетворить файли XML у формат онлайнової документації та виведе помилки, якщо щось не так.

source: Alternatively, you can build Godot and open the modified page in the built-in code reference. To learn how to compile the engine, read the :ref:`compilation guide <toc-devel-compiling>`.
ru: В качестве альтернативы вы можете собрать Godot и открыть изменённую страницу во встроенном справочнике по коду. Чтобы узнать, как скомпилировать движок, прочтите :ref:`руководство по компиляции <toc-devel-compiling>`.
ta: மாற்றாக, நீங்கள் கோடோட்டை உருவாக்கி மாற்றியமைக்கப்பட்ட பக்கத்தை உள்ளமைக்கப்பட்ட குறியீடு குறிப்பில் திறக்கலாம். இயந்திரத்தை எவ்வாறு தொகுப்பது என்பதை அறிய, இதைப் படியுங்கள்: குறிப்பு: `தொகுப்பு வழிகாட்டி <TOC-DEVEL- இணைத்தல்>`.
uk: Крім того, ви можете створити Godot і відкрити змінену сторінку у вбудованому довідковому коді. Щоб дізнатися, як скомпілювати двигун, прочитайте :ref:`compilation guide <toc-devel-compiling>`.

source: We recommend using a code editor that supports XML files like Vim, Atom, Visual Studio Code, Notepad++, or another to comfortably edit the file. You can also use their search feature to find classes and properties quickly.
it: Consigliamo di utilizzare un editor di codice che supporti i file XML come Vim, Atom, Visual Studio Code, Notepad++ o un altro per modificare comodamente il file. Si può anche utilizzare la funzione di ricerca per trovare rapidamente classi e proprietà.
ru: Для удобного редактирования файла рекомендуем использовать редактор кода с поддержкой XML-файлов, например Vim, Atom, Visual Studio Code, Notepad++ или другой. Вы также можете воспользоваться функцией поиска для быстрого поиска классов и свойств.
ta: விம், ஆட்டம், விசுவல் ச்டுடியோ கோட், நோட்பேட் ++ போன்ற எக்ச்எம்எல் கோப்புகளை ஆதரிக்கும் குறியீடு எடிட்டரைப் பயன்படுத்த பரிந்துரைக்கிறோம். வகுப்புகள் மற்றும் பண்புகளை விரைவாகக் கண்டுபிடிக்க அவர்களின் தேடல் அம்சத்தையும் பயன்படுத்தலாம்.
uk: Ми рекомендуємо використовувати редактор коду, який підтримує файли XML, наприклад Vim, Atom, Visual Studio Code, Notepad++ або інший, щоб зручно редагувати файл. Ви також можете скористатися їх функцією пошуку, щоб швидко знайти класи та властивості.

source: If you use Visual Studio Code, you can install the `vscode-xml extension <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__ to get linting for class reference XML files.
it: Se si utilizza Visual Studio Code, è possibile installare l'estensione `vscode-xml <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__ per ottenere il linting per i file XML di riferimento alle classi.
ru: Если вы используете Visual Studio Code, вы можете установить расширение `vscode-xml <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__, чтобы выполнить линтинг для XML-файлов ссылок на классы.
ta: நீங்கள் விசுவல் ச்டுடியோ குறியீட்டைப் பயன்படுத்தினால், நீங்கள் `vscode-xml நீட்டிப்பு <https://marketplace.visualstudio.com/items?itemmame=redhat.vscode-xml> __ __ வகுப்பு குறிப்பு எக்ச்எம்எல் கோப்புகளுக்கு லிண்டிங் பெற நிறுவலாம்.
uk: Якщо ви використовуєте Visual Studio Code, ви можете встановити розширення `vscode-xml <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__, щоб отримати linting для XML-файлів посилання на клас.

source: Improve formatting with BBCode style tags
it: Migliorare la formattazione con i tag di stile BBCode
ru: Улучши форматирование с тегами стиля BBCode
ta: பிபிகோட் பாணி குறிச்சொற்களுடன் வடிவமைப்பை மேம்படுத்தவும்
uk: Покращуйте форматування за допомогою тегів стилю BBCode

source: Godot's XML class reference supports BBCode-like tags for linking as well as formatting text and code. In the tables below you can find the available tags, usage examples and the results after conversion to reStructuredText.
it: Il riferimento alle classi XML di Godot supporta tag simili a BBCode per i collegamenti e la formattazione di testo e codice. Nelle tabelle seguenti sono riportati i tag disponibili, gli esempi di utilizzo e i risultati dopo la conversione in reStructuredText.
ru: Справочник XML-классов Godot поддерживает теги типа BBCode для связывания и форматирования текста и кода. В таблицах ниже представлены доступные теги, примеры использования и результаты преобразования в reStructuredText.
ta: கோடோட்டின் எக்ச்எம்எல் வகுப்பு குறிப்பு உரை மற்றும் குறியீட்டை இணைப்பதற்கும் வடிவமைப்பதற்கும் பிபிகோட் போன்ற குறிச்சொற்களை ஆதரிக்கிறது. கீழேயுள்ள அட்டவணையில், கிடைக்கக்கூடிய குறிச்சொற்கள், பயன்பாட்டு எடுத்துக்காட்டுகள் மற்றும் மறுசீரமைப்புக்கு மாற்றப்பட்ட பின் முடிவுகளைக் காணலாம்.
uk: Довідник класу XML Godot підтримує теги, подібні до BBCode, для зв’язування, а також форматування тексту та коду. У таблицях нижче ви можете знайти доступні теги, приклади використання та результати після перетворення на reStructuredText.

source: Linking
it: Collegamento
ru: Связывание
ta: இணைத்தல்
uk: Посилання

source: Whenever you link to a member of another class, you need to specify the class name. For links to the same class, the class name is optional and can be omitted.
it: Ogni volta che si crea un collegamento a un membro di un'altra classe, è necessario specificarne il nome. Per i collegamenti alla stessa classe, il nome della classe è facoltativo e può essere omesso.
ru: При ссылке на член другого класса необходимо указывать имя класса. Для ссылок на тот же класс имя класса необязательно и может быть опущено.
ta: நீங்கள் வேறொரு வகுப்பின் உறுப்பினருடன் இணைக்கும்போதெல்லாம், நீங்கள் வகுப்பு பெயரைக் குறிப்பிட வேண்டும். ஒரே வகுப்பிற்கான இணைப்புகளுக்கு, வகுப்பு பெயர் விருப்பமானது மற்றும் தவிர்க்கப்படலாம்.
uk: Щоразу, коли ви посилаєтеся на члена іншого класу, вам потрібно вказати назву класу. Для посилань на той самий клас ім’я класу є необов’язковим і його можна опустити.

source: Tag and Description
it: Tag e descrizione
ru: Тег и Описание
ta: குறிச்சொல் மற்றும் விளக்கம்
uk: Тег і опис

source: Example
it: Esempio
ru: Пример
ta: எடுத்துக்காட்டு
uk: Приклад

source: Result
it: Risultato
ru: Результат
ta: முடிவு
uk: Результат

source: ``[Class]``
ta: `` [வகுப்பு] ``

source: Link to class
it: Collega a una classe
ru: Ссылка на класс
ta: வகுப்பிற்கான இணைப்பு
uk: Посилання на клас

source: ``Move the [Sprite2D].``
it: ``Sposta lo [Sprite2D].``
ru: ``Переместите [Sprite2D].``
ta: `` [ச்ப்ரைட் 2 டி] ஐ நகர்த்தவும் .``
uk: ``Перемістити [Sprite2D].``

source: Move the :ref:`class_Sprite2D`.
it: Sposta lo :ref:`class_Sprite2D`.
ru: Переместите :ref:`class_Sprite2D`.
ta: : Ref: `class_sprite2d` ஐ நகர்த்தவும்.
uk: Перемістити :ref:`class_Sprite2D`.

source: ``[annotation Class.name]``
ta: `` [சிறுகுறிப்பு வகுப்பு. பெயர்] ``

source: Link to annotation
it: Collega a un'annotazione
ru: Ссылка на аннотацию
ta: சிறுகுறிப்புக்கான இணைப்பு
uk: Посилання на анотацію

source: ``See [annotation @GDScript.@rpc].``
it: ``Vedi [annotation @GDScript.@rpc].``
ru: ``См. [annotation @GDScript.@rpc].``
ta: `` [சிறுகுறிப்பு @gdscript ஐக் காண்க. @Rpc] .``
uk: ``Див. [annotation @GDScript.@rpc].``

source: See :ref:`@GDScript.@rpc <class_@GDScript_annotation_@rpc>`.
it: Vedi :ref:`@GDScript.@rpc <class_@GDScript_annotation_@rpc>`.
ru: См. :ref:`@GDScript.@rpc <class_@GDScript_annotation_@rpc>`.
ta: காண்க: குறிப்பு: `@gdscript.
uk: Перегляньте :ref:`@GDScript.@rpc <class_@GDScript_annotation_@rpc>`.

source: ``[constant Class.name]``
ta: `` [நிலையான வகுப்பு.நாம்] ``

source: Link to constant
it: Collega a una costante
ru: Ссылка на константу
ta: மாறிலி இணைப்பு
uk: Посилання на константу

source: ``See [constant Color.RED].``
it: ``Vedi [constant Color.RED].``
ru: ``См. [constant Color.RED].``
ta: `` [நிலையான color.red] ஐப் பார்க்கவும் .``
uk: ``Див. [constant Color.RED].``

source: See :ref:`Color.RED <class_Color_constant_RED>`.
it: Vedi :ref:`Color.RED <class_Color_constant_RED>`.
ru: См. :ref:`Color.RED <class_Color_constant_RED>`.
ta: காண்க: குறிப்பு: `color.red <class_color_constant_red>`.
uk: Перегляньте :ref:`Color.RED <class_Color_constant_RED>`.

source: Link to enum
it: Collega a un'enumerazione
ru: Ссылка на перечисление
ta: Enum உடன் இணைப்பு
uk: Посилання на enum

source: ``See [enum Mesh.ArrayType].``
it: ``Vedi [enum Mesh.ArrayType].``
ru: ``См. [enum Mesh.ArrayType].``
ta: `` காண்க [enum mesh.arraytype] .``
uk: ``Див. [enum Mesh.ArrayType].``

source: See :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`.
it: Vedi :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`.
ru: См. :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`.
ta: காண்க: குறிப்பு: `mesh.arraytype <enum_mesh_arraytype>`.
uk: Див. :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`.

source: ``[member Class.name]``
ta: `` [உறுப்பினர் வகுப்பு.நாம்] ``

source: Link to member
it: Collega a un membro
ru: Ссылка на участника
ta: உறுப்பினருக்கான இணைப்பு
uk: Посилання на учасника

source: ``Get [member Node2D.scale].``
it: ``Ottieni [member Node2D.scale].``
ru: ``Получить[member Node2D.scale].``
ta: `` [உறுப்பினர் node2d.scale] ஐப் பெறுங்கள் .``
uk: ``Отримати [member Node2D.scale].``

source: ``[method Class.name]``
ta: `` [முறை வகுப்பு.நாம்] ``

source: Link to method
it: Collega a un metodo
ru: Ссылка на метод
ta: முறைக்கு இணைப்பு
uk: Посилання на метод

source: ``Call [method Node3D.hide].``
it: ``Chiama [method Node3D.hide].``
ru: ``Вызов [method Node3D.hide].``
ta: `` அழைக்கவும் [முறை node3d.hide] .``
uk: ``Виклик [method Node3D.hide].``

source: Call :ref:`Node3D.hide() <class_Node3D_method_hide>`.
it: Chiama :ref:`Node3D.hide() <class_Node3D_method_hide>`.
ru: Вызов :ref:`Node3D.hide() <class_Node3D_method_hide>`.
ta: அழைப்பு: குறிப்பு: `node3d.hide () <class_node3d_method_hide>`.
uk: Виклик :ref:`Node3D.hide() <class_Node3D_method_hide>`.

source: ``[constructor Class.name]``
ta: `` [கட்டமைப்பாளர் வகுப்பு.நாம்] ``

source: Link to built-in constructor
it: Collega a un costruttore integrato
ru: Ссылка на встроенный конструктор
ta: உள்ளமைக்கப்பட்ட கட்டமைப்பாளருக்கான இணைப்பு
uk: Посилання на вбудований конструктор

source: ``Use [constructor Color.Color].``
it: ``Usa [constructor Color.Color].``
ru: ``Использовать [constructor Color.Color].``
ta: `` [கட்டமைப்பாளர் color.color] ஐப் பயன்படுத்தவும் .``
uk: ``Використовуйте [constructor Color.Color].``

source: Use :ref:`Color.Color <class_Color_constructor_Color>`.
it: Usa :ref:`Color.Color <class_Color_constructor_Color>`.
ru: Используйте :ref:`Color.Color <class_Color_constructor_Color>`.
ta: பயன்படுத்தவும்: ref: `color.color <class_color_constructor_color>`.
uk: Використовуйте :ref:`Color.Color <class_Color_constructor_Color>`.

source: ``[operator Class.name]``
ta: `` [ஆபரேட்டர் வகுப்பு.நாம்] ``

source: Link to built-in operator
it: Collega a un operatore integrato
ru: Ссылка на встроенный оператор
ta: உள்ளமைக்கப்பட்ட ஆபரேட்டருக்கான இணைப்பு
uk: Посилання на вбудований оператор

source: ``Use [operator Color.operator *].``
it: ``Usa [operator Color.operator *].``
ru: ``Использовать [operator Color.operator *].``
ta: `` [ஆபரேட்டர் கலர்.ஓப்பரேட்டர் *] ஐப் பயன்படுத்தவும். ``
uk: ``Використовуйте [operator Color.operator *].``

source: Use :ref:`Color.operator * <class_Color_operator_mul_int>`.
it: Usa :ref:`Color.operator * <class_Color_operator_mul_int>`.
ru: Используйте :ref:`Color.operator * <class_Color_operator_mul_int>`.
ta: பயன்படுத்தவும்: Ref: `color.operator * <class_color_operator_mul_int>`.
uk: Використовуйте :ref:`Color.operator * <class_Color_operator_mul_int>`.

source: ``[signal Class.name]``
ta: `` [சமிக்ஞை வகுப்பு.நாம்] ``
uk: ``[сигнал Class.name]``

source: Link to signal
it: Collega a un segnale
ru: Ссылка на сигнал
ta: சிக்னலுக்கான இணைப்பு
uk: Посилання на сигнал

source: ``Emit [signal Node.renamed].``
it: ``Emetti [signal Node.renamed].``
ru: ``Выдать [signal Node.renamed].``
ta: `` உமிழும் [சிக்னல் node.renamed] .``
uk: ``Подати [signal Node.renamed].``

source: Emit :ref:`Node.renamed <class_Node_signal_renamed>`.
it: Emetti :ref:`Node.renamed <class_Node_signal_renamed>`.
ru: Передать :ref:`Node.renamed <class_Node_signal_renamed>`.
ta: உமிழ்வு: ref: `node.renamed <class_node_signal_renemamed>`.
uk: Видати :ref:`Node.renamed <class_Node_signal_renamed>`.

source: ``[theme_item Class.name]``
ta: `` [தீம்_இடெம் வகுப்பு.நாம்] ``

source: Link to theme item
it: Collega a un elemento del tema
ru: Ссылка на тему
ta: கருப்பொருள் உருப்படியுடன் இணைப்பு
uk: Посилання на предмет теми

source: ``See [theme_item Label.font].``
it: ``Vedi [theme_item Label.font].``
ru: ``См. [theme_item Label.font].``
ta: `` [தீம்_இடெம் லேபிள்.ஃபோன்ட்] ஐப் பார்க்கவும் .``
uk: ``Див. [theme_item Label.font].``

source: See :ref:`Label.font <class_Label_theme_font_font>`.
it: Vedi :ref:`Label.font <class_Label_theme_font_font>`.
ru: См. :ref:`Label.font <class_Label_theme_font_font>`.
ta: காண்க: ref: `label.font <class_label_theme_font_font>`.
uk: Перегляньте :ref:`Label.font <class_Label_theme_font_font>`.

source: ``[param name]``
ta: `` [பரம் பெயர்] ``

source: Parameter name (as code)
it: Nome di parametro (come codice)
ru: Имя параметра (в виде кода)
ta: அளவுரு பெயர் (குறியீடாக)
uk: Назва параметра (як код)

source: ``Takes [param size] for the size.``
it: ``Accetta [param size] per le dimensioni.``
ru: ``Принимает [param size] в качестве размера.``
ta: `` அளவிற்கு [பாரம் அளவு] எடுக்கும் .``
uk: ``За розмір приймає [param size].``

source: Takes ``size`` for the size.
it: Accetta ``size`` per le dimensioni.
ru: Принимает ``size`` в качестве размера.
ta: அளவிற்கு `` அளவு`` எடுக்கும்.
uk: Використовує ``size`` для розміру.

source: Currently only :ref:`class_@GDScript` has annotations.
it: Attualmente solo :ref:`class_@GDScript` contiene annotazioni.
ru: В настоящее время аннотации имеются только у :ref:`class_@GDScript`.
ta: தற்போது மட்டும்: Ref: `class_@gdscript` சிறுகுறிப்புகளைக் கொண்டுள்ளது.
uk: Наразі лише :ref:`class_@GDScript` має анотації.

source: Formatting text
it: Formattazione del testo
ru: Форматирование текста
ta: உரையை வடிவமைத்தல்
uk: Форматування тексту

source: Line break
it: Interruzione di riga
ru: Перенос строки
ta: வரி இடைவெளி
uk: Розрив рядка

source: ``Line 1.[br]``
it: ``Riga 1.[br]``
ta: `` வரி 1. [br] ``
