Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/interpolation/physics_interpolation_introduction.po
Languages: it, ru, ta, uk, zh_hans, zh_tw

source: We have established that the most desirable physics/game logic arrangement for consistency and predictability is a physics tick rate that is fixed at design-time. The problem is the discrepancy between the physics position recorded, and where we "want" a physics object to be shown on a frame to give smooth motion.
it: Abbiamo stabilito che la soluzione fisica/logica di gioco più preferibile per coerenza e prevedibilità è una frequenza di tick di fisica fissata in fase di progettazione. Il problema è la discrepanza tra la posizione fisica registrata e il punto in cui "vorremmo" che un oggetto fisico sia mostrato su un frame per rendere un movimento fluido.
ru: Мы установили, что наиболее желательная конфигурация физики/игровой логики для обеспечения согласованности и предсказуемости — это фиксированная на этапе разработки частота тиков физики. Проблема заключается в несоответствии между зафиксированным положением физического объекта и тем, где мы "хотим" отображать физический объект в кадре для обеспечения плавности движения.
ta: நிலைத்தன்மை மற்றும் முன்கணிப்புக்கான மிகவும் விரும்பத்தக்க இயற்பியல்/விளையாட்டு வழக்கு ஏற்பாடு என்பது வடிவமைப்பு நேரத்தில் நிர்ணயிக்கப்பட்ட ஒரு இயற்பியல் டிக் விகிதம் என்பதை நாங்கள் நிறுவியுள்ளோம். பதிவுசெய்யப்பட்ட இயற்பியல் நிலைக்கு இடையிலான முரண்பாடு, மற்றும் மென்மையான இயக்கத்தை அளிக்க ஒரு சட்டத்தில் ஒரு இயற்பியல் பொருளை "விரும்புகிறோம்".
uk: Ми встановили, що найбажаніша логіка фізики/ігри для узгодженості та передбачуваності — це швидкість фізичних тактів, яка фіксується під час розробки. Проблема полягає в розбіжності між фізичною позицією, яку записали, і місцем, де ми «хочемо», щоб фізичний об’єкт був показаний на кадрі, щоб забезпечити плавний рух.
zh_tw: 我們已經確立，為了保持一致性和可預測性，最理想的物理/遊戲邏輯安排是將物理更新頻率在設計時就固定下來。問題在於記錄的物理位置，以及為了在畫面呈現流暢的運動，我們「希望」物理物件顯示在哪裡之間存在差異。

source: The answer turns out to be simple, but can be a little hard to get your head around at first.
it: La risposta risulta semplice, ma all'inizio può essere un po' difficile da assimilare.
ru: Ответ оказывается простым, но поначалу его может быть немного сложно осознать.
ta: பதில் எளிமையானதாக மாறும், ஆனால் முதலில் உங்கள் தலையைச் சுற்றி வருவதற்கு கொஞ்சம் கடினமாக இருக்கும்.
uk: Відповідь виявляється простою, але спочатку може бути трохи важко зрозуміти.
zh_tw: 答案其實很簡單，但一開始可能有點難以理解。

source: Instead of keeping track of just the current position of a physics object in the engine, we keep track of *both the current position of the object, and the previous position* on the previous physics tick.
it: Invece di tenere traccia solo della posizione attuale di un oggetto fisico nel motore, teniamo traccia *sia della posizione attuale dell'oggetto, sia della posizione precedente* sul tick di fisica precedente.
ru: Вместо того, чтобы отслеживать только текущее положение физического объекта в движке, мы отслеживаем *как текущее положение объекта, так и предыдущее положение* на предыдущем такте физики.
ta: இயந்திரத்தில் ஒரு இயற்பியல் பொருளின் தற்போதைய நிலையை கண்காணிப்பதற்குப் பதிலாக, பொருளின் தற்போதைய நிலை மற்றும் முந்தைய இயற்பியல் டிக்கில் முந்தைய நிலை * இரண்டையும் கண்காணிக்கிறோம்.
uk: Замість того, щоб відстежувати лише поточне положення фізичного об’єкта в механізмі, ми відстежуємо *поточне положення об’єкта та попереднє положення* на попередньому фізичному тику.
zh_tw: 引擎中，我們不只追蹤物理物件的當前位置，還會追蹤 **物件的當前位置，以及前一個物理週期的前一個位置** 。

source: Why do we need the previous position *(in fact the entire transform, including rotation and scaling)*? By using a little math magic, we can use **interpolation** to calculate what the transform of the object would be between those two points, in our ideal world of smooth continuous movement.
it: Perché abbiamo bisogno della posizione precedente *(in realtà dell'intera trasformazione, inclusa rotazione e scala)*? Con un po' di magia matematica, possiamo usare un'**interpolazione** per calcolare quale sarebbe la trasformazione dell'oggetto tra quei due punti, nel nostro mondo ideale di movimento fluido e continuo.
ru: Зачем нам нужна предыдущая позиция *(фактически, всё преобразование, включая поворот и масштабирование)*? Применив немного математической магии, мы можем с помощью **интерполяции** вычислить, каким будет преобразование объекта между этими двумя точками в нашем идеальном мире плавного непрерывного движения.
ta: முந்தைய நிலை நமக்கு ஏன் தேவை *(உண்மையில் சுழற்சி மற்றும் அளவிடுதல் உட்பட முழு மாற்றமும்) *? ஒரு சிறிய கணித மந்திரத்தைப் பயன்படுத்துவதன் மூலம், மென்மையான தொடர்ச்சியான இயக்கத்தின் நமது சிறந்த உலகில், அந்த இரண்டு புள்ளிகளுக்கும் இடையில் பொருளின் மாற்றம் என்ன என்பதைக் கணக்கிட ** இடைக்கணிப்பு ** ஐப் பயன்படுத்தலாம்.
uk: Навіщо нам потрібна попередня позиція *(фактично все перетворення, включаючи обертання та масштабування)*? Використовуючи трохи математичної магії, ми можемо використовувати **інтерполяцію**, щоб обчислити, яким буде перетворення об’єкта між цими двома точками в нашому ідеальному світі плавного безперервного руху.
zh_tw: 為什麼我們需要前一個位置 *(實際上是整個變換，包含旋轉和縮放)* ？透過一點數學技巧，我們可以使用 **插值** 來計算物體在這兩個點之間，在我們理想的平滑連續運動世界中，其變換會是什麼。

source: Linear interpolation
it: Interpolazione lineare
ru: Линейная интерполяция
ta: நேரியல் இடைக்கணிப்பு
uk: Лінійна інтерполяція
zh_hans: 线性插值
zh_tw: 線性內插

source: The simplest way to achieve this is linear interpolation, or lerping, which you may have used before.
it: Il modo più semplice per garantirlo è l'interpolazione lineare, o lerping, che potresti aver già utilizzato in precedenza.
ru: Самый простой способ добиться этого — линейная интерполяция, или лерпинг, который вы, возможно, уже использовали ранее.
ta: இதை அடைவதற்கான எளிய வழி நேரியல் இடைக்கணிப்பு அல்லது லெர்பிங் ஆகும், இது நீங்கள் முன்பு பயன்படுத்தியிருக்கலாம்.
uk: Найпростішим способом досягти цього є лінійна інтерполяція, або lerping, яку ви, можливо, використовували раніше.
zh_tw: 達成此目的最簡單的方法是線性內插，或稱作 Lerp，您之前可能已經使用過。

source: Let us consider only the position, and a situation where we know that the previous physics tick X coordinate was 10 units, and the current physics tick X coordinate is 30 units.
it: Consideriamo solo la posizione, e una situazione in cui sappiamo che la coordinata X del tick di fisica precedente era 10 unità e che la coordinata X del tick di fisica attuale è 30 unità.
ru: Рассмотрим только положение и ситуацию, когда мы знаем, что предыдущая координата X физического такта составляла 10 единиц, а текущая координата X физического такта составляет 30 единиц.
ta: முந்தைய இயற்பியல் டிக் ஃச் ஒருங்கிணைப்பு 10 அலகுகள் என்பதையும், தற்போதைய இயற்பியல் டிக் ஃச் ஒருங்கிணைப்பு 30 அலகுகள் என்பதையும் நாம் அறிந்த ஒரு நிலை மற்றும் ஒரு சூழ்நிலையை மட்டுமே கருத்தில் கொள்வோம்.
uk: Давайте розглянемо лише позицію та ситуацію, коли ми знаємо, що попередня фізична координата Х у фізичному тику становила 10 одиниць, а поточна координата Х у фізичному тику становить 30 одиниць.
zh_tw: 我們只考慮位置，以及一種情況：我們知道前一個物理幀的 X 座標是 10 單位，而目前的物理幀的 X 座標是 30 單位。

source: Although the maths is explained here, you do not have to worry about the details, as this step will be performed for you. Under the hood, Godot may use more complex forms of interpolation, but linear interpolation is the easiest in terms of explanation.
it: Anche se la matematica è spiegata qui, non c'è da preoccuparsi per i dettagli, poiché questo passaggio sarà eseguito automaticamente. In realtà, Godot potrebbe utilizzare forme di interpolazione più complesse, ma l'interpolazione lineare è la più semplice in termini di spiegazione.
ru: Хотя математические вычисления здесь объяснены, вам не нужно беспокоиться о деталях, так как этот шаг будет выполнен автоматически. Godot может использовать более сложные формы интерполяции, но линейная интерполяция — самый простой способ объяснения.
ta: கணிதம் இங்கே விளக்கப்பட்டாலும், விவரங்களைப் பற்றி நீங்கள் கவலைப்பட வேண்டியதில்லை, ஏனெனில் இந்த நடவடிக்கை உங்களுக்காக செய்யப்படும். ஊட்டின் கீழ், கோடோட் இடைக்கணிப்பின் மிகவும் சிக்கலான வடிவங்களைப் பயன்படுத்தலாம், ஆனால் விளக்கத்தின் அடிப்படையில் நேரியல் இடைக்கணிப்பு எளிதானது.
uk: Хоча тут пояснюється математика, вам не потрібно турбуватися про деталі, оскільки цей крок буде виконано за вас. Під капотом Godot може використовувати більш складні форми інтерполяції, але лінійна інтерполяція є найпростішою з точки зору пояснення.
zh_tw: 雖然這裡解釋了數學原理，但你不需要擔心細節，因為這個步驟會自動為你執行。在底層，Godot 可能會使用更複雜的差值運算，但線性差值就解釋而言是最容易理解的。

source: The physics interpolation fraction
it: La frazione di interpolazione fisica
ru: Фракция интерполяции физики
ta: இயற்பியல் இடைக்கணிப்பு பின்னம்
uk: Інтерполяційна частка фізики
zh_hans: 物理插值比例
zh_tw: 物理插值比例

source: If our physics ticks are happening 10 times per second (for this example), what happens if our rendered frame takes place at time 0.12 seconds? We can do some math to figure out where the object would be to obtain a smooth motion between the two ticks.
it: Se i nostri tick di fisica si verificano 10 volte al secondo (per questo esempio), cosa succede se il nostro frame renderizzato avviene a 0,12 secondi? Possiamo fare un po' di calcoli per capire dove si troverebbe l'oggetto per ottenere un movimento fluido tra i due tick.
ru: Если наши физические тики происходят 10 раз в секунду (в данном примере), что произойдёт, если отрендеренный кадр будет создан в момент времени 0,12 секунды? Мы можем выполнить некоторые математические вычисления, чтобы определить, где будет находиться объект, чтобы добиться плавного движения между двумя тиками.
ta: எங்கள் இயற்பியல் உண்ணி நொடிக்கு 10 முறை நடந்தால் (இந்த எடுத்துக்காட்டுக்கு), எங்கள் வழங்கப்பட்ட சட்டகம் 0.12 வினாடிகளில் நடந்தால் என்ன ஆகும்? இரண்டு உண்ணிகளுக்கும் இடையில் ஒரு மென்மையான இயக்கத்தைப் பெறுவதற்கான பொருள் எங்கே இருக்கும் என்பதைக் கண்டுபிடிக்க நாம் சில கணிதத்தைச் செய்யலாம்.
uk: Якщо наші фізичні тики відбуваються 10 разів на секунду (для цього прикладу), що станеться, якщо наш рендерений кадр відбудеться в момент часу 0,12 секунди? Ми можемо зробити трохи математики, щоб визначити, де буде знаходитися об’єкт, щоб отримати плавний рух між двома позначками.
zh_hans: 假设（在这个例子中）物理周期是每秒 10 次，那么渲染帧位于 0.12 秒的话会发生什么呢？要实现两个周期之间的平滑运动，物体所处的位置，我们来解一个数学题就知道了。
zh_tw: 如果我們的物理更新頻率是每秒 10 次（以這個例子來說），那麼當我們的算繪畫面發生在 0.12 秒時會發生什麼事？我們可以做一些數學運算來找出物件在兩個物理更新之間應該在哪個位置，以獲得平滑的運動。

source: First of all, we have to calculate how far through the physics tick we want the object to be. If the last physics tick took place at 0.1 seconds, we are 0.02 seconds *(0.12 - 0.1)* through a tick that we know will take 0.1 seconds (10 ticks per second). The fraction through the tick is thus:
it: Innanzitutto, dobbiamo calcolare quanto è avanti l'oggetto nel tick di fisica. Se l'ultimo tick è avvenuto a 0,1 secondi, ci troviamo a 0,02 secondi *(0,12 - 0,1)* avanti un tick che sappiamo durerà 0,1 secondi (10 tick al secondo). La frazione tra il tick è quindi:
ru: Прежде всего, нам нужно рассчитать, на каком расстоянии от физического тика должен находиться объект. Если последний физический тик был в 0,1 секунды, то мы находимся на 0,02 секунды *(0,12 - 0,1)* от тика, который, как мы знаем, будет длиться 0,1 секунды (10 тиков в секунду). Доля от тика равна:
ta: முதலாவதாக, இயற்பியல் மூலம் பொருள் எவ்வளவு தூரம் இருக்க வேண்டும் என்று நாம் கணக்கிட வேண்டும். கடைசி இயற்பியல் டிக் 0.1 வினாடிகளில் நடந்தால், நாங்கள் 0.02 வினாடிகள் * (0.12 - 0.1) * ஒரு டிக் மூலம் 0.1 வினாடிகள் (வினாடிக்கு 10 உண்ணி) எடுக்கும் என்று எங்களுக்குத் தெரியும். டிக் வழியாக பின்னம் இவ்வாறு:
uk: Перш за все, ми повинні обчислити, на якій відстані через фізичний тік ми хочемо, щоб об’єкт був. Якщо останній фізичний тік відбувся на 0,1 секунди, ми проходимо 0,02 секунди *(0,12 - 0,1)* через тік, який, як ми знаємо, займе 0,1 секунди (10 тактів на секунду). Таким чином, частка через галочку дорівнює:
zh_hans: 首先，我们要计算物体在物理周期中经过了多久。如果上一个物理周期在 0.1 秒，那么我们就在物理周期中经过了 *(0.12 - 0.1)* 即 0.02 秒，因为一个周期总共 0.1 秒（每秒 10 个周期）。所以周期中的比例就是：
zh_tw: 首先，我們必須計算物件在物理更新的哪個時間點。如果上次物理更新發生在 0.1 秒，那麼我們目前處於一個已知會耗時 0.1 秒（每秒 10 次更新）的更新週期中的 0.02 秒 *(0.12 - 0.1)*。因此，這個更新週期所經過的比例是：

source: This is called the **physics interpolation fraction**, and is handily calculated for you by Godot. It can be retrieved on any frame by calling :ref:`Engine.get_physics_interpolation_fraction<class_Engine_method_get_physics_interpolation_fraction>`.
it: Questa è chiamata **frazione di interpolazione fisica**, ed è calcolata comodamente da Godot. Può essere recuperata su qualsiasi frame chiamando :ref:`Engine.get_physics_interpolation_fraction<class_Engine_method_get_physics_interpolation_fraction>`.
ru: Это называется **дробью интерполяции физики**, и Godot легко рассчитывает её для вас. Её можно получить в любом кадре, вызвав :ref:`Engine.get_physics_interpolation_fraction<class_Engine_method_get_physics_interpolation_fraction>`.
ta: இது ** இயற்பியல் இடைக்கணிப்பு பின்னம் ** என்று அழைக்கப்படுகிறது, மேலும் இது கோடோட்டால் உங்களுக்காக கணக்கிடப்படுகிறது. அழைப்பதன் மூலம் எந்தவொரு சட்டத்திலும் இதை மீட்டெடுக்கலாம்: ref: `Engine.get_physics_interpolation_fraction <class_engine_method_get_physics_interpolation_fraction>`.
uk: Це називається **фізичною інтерполяційною часткою**, яку зручно розраховує для вас Godot. Його можна отримати з будь-якого кадру, викликавши :ref:`Engine.get_physics_interpolation_fraction<class_Engine_method_get_physics_interpolation_fraction>`.
zh_hans: 这个值叫做\ **物理插值比例**\ ，Godot 会帮你计算好，可以在任何帧中调用 :ref:`Engine.get_physics_interpolation_fraction<class_Engine_method_get_physics_interpolation_fraction>` 来获取。
zh_tw: 這稱為 **物理內插比例** ，Godot 會方便地為您計算好。您可以在任何影格中透過呼叫 :ref:`Engine.get_physics_interpolation_fraction<class_Engine_method_get_physics_interpolation_fraction>` 來取得這個數值。

source: Calculating the interpolated position
it: Calcolare la posizione interpolata
ru: Расчет интерполированного положения
ta: இடைக்கணிப்பு நிலையை கணக்கிடுதல்
uk: Обчислення інтерпольованої позиції
zh_hans: 计算插值位置
zh_tw: 計算插值後的位置

source: Once we have the interpolation fraction, we can insert it into a standard linear interpolation equation. The X coordinate would thus be:
it: Una volta ottenuta la frazione di interpolazione, possiamo inserirla in un'equazione standard di interpolazione lineare. La coordinata X sarebbe quindi:
ru: Получив интерполяционную дробь, мы можем подставить её в стандартное линейное интерполяционное уравнение. Таким образом, координата X будет равна:
ta: இடைக்கணிப்பு பின்னம் நம்மிடம் இருந்தவுடன், அதை ஒரு நிலையான நேரியல் இடைக்கணிப்பு சமன்பாட்டில் செருகலாம். ஃச் ஒருங்கிணைப்பு இவ்வாறு இருக்கும்:
uk: Отримавши інтерполяційний дріб, ми можемо вставити його в стандартне лінійне рівняння інтерполяції. Таким чином, координата X буде:
zh_hans: 得到插值比例后，我们就可以把它代入标准线性插值公式。所以 X 坐标就是：
zh_tw: 一旦我們取得插值比例，就可以將其代入標準的線性插值方程式。因此，X 座標會是：

source: So substituting our ``x_prev`` as 10, and ``x_curr`` as 30:
it: Quindi sostituendo ``x_prev`` con 10 e ``x_curr`` con 30:
ru: Итак, подставим ``x_prev`` на 10, а ``x_curr`` на 30:
ta: எனவே எங்கள் `` x_prev`` ஐ 10 ஆகவும், `` x_curr`` 30 ஆகவும் மாற்றுகிறது:
uk: Отже, замінивши наш ``x_prev`` на 10, а ``x_curr`` на 30:
zh_hans: 将 ``x_prev`` 替换为 10，将 ``x_curr`` 替换为 30：
zh_tw: 因此，將我們的 ``x_prev`` 代入 10，且 ``x_curr`` 代入 30：

source: Let's break that down:
it: Spieghiamolo in dettaglio:
ru: Давайте разберем это подробнее:
ta: அதை உடைப்போம்:
uk: Давайте розберемо це:
zh_hans: 让我们来拆解一下：
zh_tw: 讓我們逐步解析：

source: We know the X starts from the coordinate on the previous tick (``x_prev``) which is 10 units.
it: Sappiamo che la X parte dalla coordinata sul tick precedente (``x_prev``) che è 10 unità.
ru: Мы знаем, что X начинается с координаты на предыдущем тике (``x_prev``), что составляет 10 единиц.
ta: 10 அலகுகள் என்ற முந்தைய டிக் (`` x_prev``) இன் ஒருங்கிணைப்பிலிருந்து ஃச் தொடங்குகிறது என்பது எங்களுக்குத் தெரியும்.
uk: Ми знаємо, що X починається з координати на попередньому тику (``x_prev``), яка становить 10 одиниць.
zh_hans: 我们知道 X 从上一周期的坐标（\ ``x_prev``\ ）开始，该坐标为 10 个单位。
zh_tw: 我們知道 X 軸是從前一個刻度 (``x_prev``) 的座標開始，該座標是 10 個單位。

source: We know that after the full tick, the difference between the current tick and the previous tick will have been added (``x_curr - x_prev``) (which is 20 units).
it: Sappiamo che dopo il tick completo, sarà stata aggiunta la differenza tra il tick attuale e il tick precedente (``x_curr - x_prev``) (che è di 20 unità).
ru: Мы знаем, что после полного тика будет добавлена разница между текущим тиком и предыдущим тиком (``x_curr - x_prev``) (что составляет 20 единиц).
ta: முழு டிக்குக்குப் பிறகு, தற்போதைய டிக் மற்றும் முந்தைய டிக் இடையேயான வேறுபாடு சேர்க்கப்பட்டிருக்கும் என்பதை நாங்கள் அறிவோம் (`` x_curr - x_prev``) (இது 20 அலகுகள்).
uk: Ми знаємо, що після повного тику різниця між поточним і попереднім тиками буде додана (``x_curr - x_prev``) (це 20 одиниць).
zh_hans: 我们知道在完整的一个周期之后，会加上当前周期与上一周期之间的差值（\ ``x_curr - x_prev``\ ）（即 20 个单位）。
zh_tw: 我們知道在完整物理幀之後，目前物理幀和前一個物理幀之間的差值（ ``x_curr - x_prev`` ）將會被加上（也就是 20 個單位）。

source: The only thing we need to vary is the proportion of this difference we add, according to how far we are through the physics tick.
it: L'unica cosa che dobbiamo variare è la proporzione di questa differenza che aggiungiamo, a seconda di quanto siamo avanti nel tick di fisica.
ru: Единственное, что нам нужно изменить, — это пропорцию этой разницы, которую мы добавляем, в зависимости от того, насколько далеко мы продвинулись в физическом тике.
ta: இயற்பியல் டிக் மூலம் நாம் எவ்வளவு தூரம் இருக்கிறோம் என்பதைப் பொறுத்தவரை, நாம் சேர்க்கும் இந்த வேறுபாட்டின் விகிதமே நாம் மாறுபட வேண்டிய ஒரே சேதி.
uk: Єдине, що нам потрібно змінювати, це частка цієї різниці, яку ми додаємо, відповідно до того, наскільки далеко ми пройшли фізику.
zh_tw: 我們唯一需要調整的是加入這個差異的比例，取決於我們在物理更新週期中的進度。

source: Although this example interpolates the position, the same thing can be done with the rotation and scale of objects. It is not necessary to know the details as Godot will do all this for you.
it: Sebbene questo esempio interpoli la posizione, lo stesso si può fare con la rotazione e la scala degli oggetti. Non è necessario conoscere i dettagli, perché Godot farà tutto automaticamente.
ru: Хотя в этом примере интерполируется положение, то же самое можно сделать с поворотом и масштабом объектов. Знать детали не обязательно, Godot сделает всё за вас.
ta: இந்த எடுத்துக்காட்டு நிலையை இடமாற்றம் செய்தாலும், அதே காரியத்தை பொருள்களின் சுழற்சி மற்றும் அளவிலும் செய்ய முடியும். கோடோட் உங்களுக்காக இதையெல்லாம் செய்யும் என்பதால் விவரங்களை அறிந்து கொள்வது அவசியமில்லை.
uk: Хоча в цьому прикладі інтерполюється положення, те ж саме можна зробити з обертанням і масштабом об’єктів. Не обов'язково знати подробиці, адже все це за вас зробить Godot.
zh_tw: 雖然這個範例是針對位置進行插值，但物體的旋轉和縮放也能以相同方式處理。不需要了解細節，Godot 會為您處理所有這些事情。

source: Smoothed transformations between physics ticks?
it: Trasformazioni smussate tra tick di fisica?
ru: Сглаженные преобразования между физическими тиками?
ta: இயற்பியல் உண்ணிக்கு இடையில் மென்மையான மாற்றங்கள்?
uk: Згладжені перетворення між галочками фізики?
zh_hans: 物理周期之间的平滑变换？
zh_tw: 物理更新間的平滑變形？

source: Putting all this together shows that it should be possible to have a nice smooth estimation of the transform of objects between the current and previous physics tick.
it: Mettendo insieme il tutto, si dimostra che dovrebbe essere possibile ottenere una stima fluida e precisa della trasformazione degli oggetti tra il tick attuale e il tick precedente.
ru: Сопоставление всего этого показывает, что должна быть возможность получить хорошую и плавную оценку преобразования объектов между текущим и предыдущим физическим тиком.
ta: இவை அனைத்தையும் ஒன்றாக இணைப்பது, தற்போதைய மற்றும் முந்தைய இயற்பியல் டிக் இடையே பொருட்களின் உருமாற்றத்தின் நல்ல மென்மையான மதிப்பீட்டைக் கொண்டிருக்க முடியும் என்பதைக் காட்டுகிறது.
uk: Поєднання всього цього разом показує, що має бути можливим мати хорошу плавну оцінку трансформації об’єктів між поточною та попередньою фізикою.
zh_tw: 總結以上所述，這表示應該可以對物件在目前和前一個物理週期之間的變換進行良好且平滑的估算。

source: But wait, you may have noticed something. If we are interpolating between the current and previous ticks, we are not estimating the position of the object *now*, we are estimating the position of the object in the past. To be exact, we are estimating the position of the object *between 1 and 2 ticks* into the past.
it: Ma aspetta, potresti aver notato una cosa. Se interpoliamo tra i tick attuali e i tick precedenti, non stiamo stimando la posizione dell'oggetto *ora*, ma la posizione dell'oggetto nel passato. Per essere precisi, stiamo stimando la posizione dell'oggetto *tra 1 e 2 tick* nel passato.
ru: Но подождите, вы, возможно, заметили кое-что. При интерполяции между текущим и предыдущим тиками мы оцениваем не положение объекта *сейчас*, а положение объекта в прошлом. Точнее, мы оцениваем положение объекта *между 1 и 2 тиками* в прошлом.
ta: ஆனால் காத்திருங்கள், நீங்கள் ஏதாவது கவனித்திருக்கலாம். தற்போதைய மற்றும் முந்தைய உண்ணி இடையே நாம் இடைக்கணிப்பாக இருந்தால், பொருளின் நிலையை *இப்போது *மதிப்பிடவில்லை என்றால், கடந்த காலங்களில் பொருளின் நிலையை மதிப்பிடுகிறோம். சரியாகச் சொல்வதானால், 1 முதல் 2 உண்ணி * வரை பொருளின் நிலையை கடந்த காலத்திற்கு மதிப்பிடுகிறோம்.
uk: Але зачекайте, можливо, ви щось помітили. Якщо ми виконуємо інтерполяцію між поточним і попереднім тиками, ми не оцінюємо положення об’єкта *зараз*, ми оцінюємо положення об’єкта в минулому. Якщо бути точним, ми оцінюємо положення об'єкта *між 1 і 2 тиками* в минулому.
zh_hans: 但是等等，你可能已经注意到了。如果我们是在当前周期和上一个周期之间进行插值，那我们并不是在估计物体\ *现在*\ 的位置，而是在估计物体\ *过去*\ 的位置。准确地说，我们是在估计物体在过去的 *1 到 2 个周期之间*\ 的位置。
zh_tw: 等等，您可能已經注意到一些事情。如果我們是在目前和前一個影格之間進行插值，我們並非在估算物件「現在」的位置，而是在估算物件「過去」的位置。更精確地說，我們估算的是物件在「過去 1 到 2 個影格之間」的位置。

source: In the past
it: Nel passato
ru: В прошлом
ta: கடந்த காலத்தில்
uk: У минулому
zh_hans: 过去
zh_tw: 過去

source: What does this mean? This scheme does work, but it does mean we are effectively introducing a delay between what we see on the screen, and where the objects *should* be.
it: Cosa significa? Questo schema funziona, ma significa che stiamo effettivamente introducendo un ritardo tra ciò che vediamo sullo schermo e dove *dovrebbero* essere gli oggetti.
ru: Что это значит? Эта схема действительно работает, но это означает, что мы фактически создаём задержку между тем, что видим на экране, и тем, где объекты *должны* находиться.
ta: இதன் பொருள் என்ன? இந்த திட்டம் வேலை செய்கிறது, ஆனால் திரையில் நாம் காணும் விசயங்களுக்கும், பொருள்கள் * இருக்க வேண்டிய இடங்களுக்கும் இடையில் தாமதத்தை திறம்பட அறிமுகப்படுத்துகிறோம் என்று பொருள்.
uk: Що це означає? Ця схема дійсно працює, але це означає, що ми фактично вводимо затримку між тим, що ми бачимо на екрані, і тим, де *мають* бути об’єкти.
zh_hans: 这是什么意思？这种方案确实可行，但也意味着我们本质上是在屏幕上看到的内容和物体\ *应该*\ 在的位置之间引入了一个延迟。
zh_tw: 這是什麼意思？這個方法確實可行，但這也表示我們實際上會在螢幕上看到的畫面，和物件 *應該* 在的位置之間，引入一個延遲。
