Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/interpolation/physics_interpolation_introduction.po
Languages: it, ru, ta, uk, zh_hans, zh_tw

source: Introduction
it: Introduzione
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_hans: 前言
zh_tw: 前言

source: Physics ticks and rendered frames
it: Tick di fisica e frame renderizzati
ru: Физические тики и отрендеренные кадры
ta: இயற்பியல் உண்ணி பிரேம்கள்
uk: Фізичні кліщі та візуалізовані кадри
zh_hans: 物理周期与渲染帧
zh_tw: 物理更新與畫面算繪

source: One key concept to understand in Godot is the distinction between physics ticks (sometimes referred to as iterations or physics frames), and rendered frames. The physics proceeds at a fixed tick rate (set in :ref:`Project Settings > Physics > Common > Physics Tick per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>`), which defaults to 60 ticks per second.
it: Un concetto fondamentale da comprendere in Godot è la distinzione tra tick di fisica (a volte chiamati iterazioni o frame di fisica) e frame renderizzati. La fisica procede a una frequenza di tick fissa (impostata in :ref:`Impostazioni del progetto > Fisica > Comuni > Tick di fisica al secondo <class_ProjectSettings_property_physics/common/physics_ticks_per_second>`), che normalmente è di 60 tick al secondo.
ru: Одна из ключевых концепций, которую необходимо понимать в Godot, — это различие между физическими тиками (иногда называемыми итерациями или физическими кадрами) и отрендеренными кадрами. Физика выполняется с фиксированной частотой тиков (задаётся в :ref:`Project Settings > Physics > Common > Physics Tick per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>`), которая по умолчанию равна 60 тикам в секунду.
ta: கோடோட்டில் புரிந்து கொள்ள வேண்டிய ஒரு முக்கிய கருத்து இயற்பியல் உண்ணி (சில நேரங்களில் மறு செய்கைகள் அல்லது இயற்பியல் பிரேம்கள் என குறிப்பிடப்படுகிறது), மற்றும் பிரேம்கள் வழங்கப்பட்ட வேறுபாடு ஆகும். இயற்பியல் ஒரு நிலையான டிக் விகிதத்தில் தொடர்கிறது (அமைக்கவும்: `திட்ட அமைப்புகள்> இயற்பியல்> பொது> இயற்பியல் ஒரு நொடிக்கு டிக் <class_projectsettings_property_physics/பொதுவான/இயற்பியல்_டிக்ச்_பெர்_செக்ட்>`), இது நொடிக்கு 60 சாட்சிகளுக்கு இயல்புநிலையாகும்.
uk: Однією з ключових концепцій Godot, яку слід зрозуміти, є різниця між фізичними тиками (іноді їх називають ітераціями або фізичними фреймами) і відтвореними фреймами. Фізика виконується з фіксованою швидкістю (встановленою в :ref:`Project Settings > Physics > Common > Physics Tick per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>`), яка за замовчуванням становить 60 тактів за секунду.
zh_tw: 在 Godot 中需要理解的一個重要概念是物理更新 (有時也稱為迭代或物理幀) 與算繪幀之間的區別。物理是以固定的更新率進行的 (在 :ref:`專案設定 > 物理 > 通用 > 每秒物理更新次數<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` 中設定，預設為每秒 60 次更新)。

source: However, the engine does not necessarily **render** at the same rate. Although many monitors refresh at 60 Hz (cycles per second), many refresh at completely different frequencies (e.g. 75 Hz, 144 Hz, 240 Hz or more). Even though a monitor may be able to show a new frame e.g. 60 times a second, there is no guarantee that the CPU and GPU will be able to *supply* frames at this rate. For instance, when running with V-Sync, the computer may be too slow for 60 and only reach the deadlines for 30 FPS, in which case the frames you see will change at 30 FPS (resulting in stuttering).
it: Tuttavia, il motore non **renderizza** necessariamente alla stessa frequenza. Sebbene molti monitor si aggiornino a 60 Hz (cicli al secondo), molti altri lo fanno a frequenze completamente diverse (ad esempio 75 Hz, 144 Hz, 240 Hz o superiori). Anche se un monitor può essere in grado di visualizzare un nuovo frame, ad esempio 60 volte al secondo, non vi è alcuna garanzia che la CPU e la GPU siano in grado di *fornire* frame a questa frequenza. Ad esempio, quando si utilizza il V-Sync, il computer potrebbe essere troppo lento per 60 FPS e raggiungere solo i 30 FPS, nel qual caso i frame visualizzati passeranno a 30 FPS (causando scatti).
ru: Однако движок не обязательно **рендерит** с одинаковой частотой. Хотя многие мониторы обновляются с частотой 60 Гц (циклов в секунду), многие — с совершенно другой (например, 75 Гц, 144 Гц, 240 Гц и более). Даже если монитор может отображать новый кадр, например, 60 раз в секунду, нет гарантии, что центральный и графический процессоры смогут *выдавать* кадры с такой частотой. Например, при работе с вертикальной синхронизацией компьютер может быть слишком медленным для 60 кадров и достигать предельных значений только при 30 кадрах в секунду, в этом случае кадры, которые вы видите, будут меняться с частотой 30 кадров в секунду (что приведет к подтормаживанию).
ta: இருப்பினும், இயந்திரம் அதே விகிதத்தில் ** வழங்குதல் ** ஐ வழங்க வேண்டிய அவசியமில்லை. பல மானிட்டர்கள் 60 எர்ட்ச் (வினாடிக்கு சுழற்சிகள்) புதுப்பித்தாலும், பலர் முற்றிலும் மாறுபட்ட அதிர்வெண்களில் (எ.கா. 75 எர்ட்ச், 144 எர்ட்ச், 240 எர்ட்ச் அல்லது அதற்கு மேற்பட்டவை) புதுப்பிக்கின்றனர். ஒரு மானிட்டர் ஒரு புதிய சட்டகத்தைக் காட்ட முடியும் என்றாலும் எ.கா. ஒரு நொடிக்கு 60 முறை, சிபியு மற்றும் GPU இந்த விகிதத்தில் * பிரேம்களை வழங்க முடியும் என்பதற்கு எந்த உத்தரவாதமும் இல்லை. உதாரணமாக, வி-ஒத்திசைவுடன் இயங்கும்போது, கணினி 60 க்கு மிகவும் மெதுவாக இருக்கலாம் மற்றும் 30 எஃப்.பி.எச்-க்கு காலக்கெடுவை மட்டுமே அடையலாம், இந்த விசயத்தில் நீங்கள் பார்க்கும் பிரேம்கள் 30 எஃப்.பி.எச்சில் மாறும் (இதன் விளைவாக தடுமாறும்).
uk: Однак механізм не обов’язково **відтворює** з однаковою швидкістю. Хоча багато моніторів оновлюються з частотою 60 Гц (циклів на секунду), багато оновлюються на зовсім інших частотах (наприклад, 75 Гц, 144 Гц, 240 Гц або більше). Навіть якщо монітор може показати новий кадр, напр. 60 разів на секунду, немає гарантії, що ЦП і ГП зможуть *забезпечувати* кадри з такою швидкістю. Наприклад, під час роботи з V-Sync комп’ютер може бути надто повільним для 60 і досягати кінцевих термінів лише для 30 FPS, у цьому випадку кадри, які ви бачите, змінюватимуться на 30 FPS (що призведе до заїкань).
zh_tw: 然而，遊戲引擎不一定會以相同的速率進行**算繪**。雖然許多螢幕的更新頻率是 60 Hz（每秒週期），但也有許多螢幕使用完全不同的頻率（例如 75 Hz、144 Hz、240 Hz 或更高）。即使螢幕可能能夠每秒顯示 60 個新影格，也不能保證 CPU 和 GPU 能夠以這個速率 *提供* 影格。舉例來說，當啟用垂直同步時，電腦可能速度不夠快而無法達到 60 FPS，只能趕上 30 FPS 的時限，在這種情況下，您看到的影格將以 30 FPS 的速率變化（導致畫面卡頓）。

source: But there is a problem here. What happens if the physics ticks do not coincide with frames? What happens if the physics tick rate is out of phase with the frame rate? Or worse, what happens if the physics tick rate is *lower* than the rendered frame rate?
it: Ma qui c'è un problema. Cosa succede se i tick di fisica non coincidono con i frame? Cosa succede se la frequenza dei tick di fisica è sfasata rispetto al frame rate? O peggio, cosa succede se la frequenza dei tick di fisica è *inferiore* al frame rate renderizzato?
ru: Но здесь есть проблема. Что произойдёт, если тики физики не совпадают с кадрами? Что произойдёт, если частота тиков физики не совпадает по фазе с частотой кадров? Или, что ещё хуже, что произойдёт, если частота тиков физики *ниже* частоты кадров рендеринга?
ta: ஆனால் இங்கே ஒரு சிக்கல் உள்ளது. இயற்பியல் உண்ணி பிரேம்களுடன் ஒத்துப்போகவில்லை என்றால் என்ன ஆகும்? பிரேம் வீதத்துடன் இயற்பியல் டிக் விகிதம் கட்டத்திற்கு வெளியே இருந்தால் என்ன ஆகும்? அல்லது மோசமாக, இயற்பியல் டிக் விகிதம் வழங்கப்பட்ட பிரேம் வீதத்தை விட * குறைவாக இருந்தால் என்ன ஆகும்?
uk: Але тут є проблема. Що буде, якщо галочки фізики не збігаються з рамками? Що станеться, якщо фізична тактова частота не відповідає фазі частоти кадрів? Або ще гірше, що станеться, якщо частота тактів фізики буде *нижчою* за частоту кадрів рендерингу?
zh_tw: 但這裡有個問題。如果物理更新的頻率和畫面更新的頻率不同步會怎麼樣？如果物理更新的時序和畫面更新的時序不同步又會怎麼樣？更糟的是，如果物理更新的頻率 *低於* 算繪的畫面更新頻率會怎麼樣？

source: This problem is easier to understand if we consider an extreme scenario. If you set the physics tick rate to 10 ticks per second, in a simple game with a rendered frame rate of 60 FPS. If we plot a graph of the positions of an object against the rendered frames, you can see that the positions will appear to "jump" every 1/10th of a second, rather than giving a smooth motion. When the physics calculates a new position for a new object, it is not rendered in this position for just one frame, but for 6 frames.
it: Questo problema è più facile da comprendere se consideriamo uno scenario estremo. Se si imposta la frequenza di tick di fisica a 10 tick al secondo, in un gioco semplice con un frame rate renderizzato di 60 FPS, se tracciamo un grafico delle posizioni di un oggetto rispetto ai frame renderizzati, possiamo vedere che le posizioni sembreranno "scattare" ogni 1/10 di secondo, anziché fornire un movimento fluido. Quando la fisica calcola una nuova posizione per un nuovo oggetto, questo non viene renderizzato in questa posizione per un solo frame, ma per 6 frame.
ru: Эту проблему легче понять, если рассмотреть экстремальный сценарий. Если установить частоту физических тиков 10 в секунду в простой игре с частотой рендеринга 60 кадров в секунду, то можно увидеть, что положение объекта в зависимости от отрендеренных кадров будет "прыгать" каждую десятую секунды, а не обеспечивать плавное движение. Когда физические тиконы рассчитывают новое положение для нового объекта, он отображается в этом положении не один раз, а в течение 6 кадров.
ta: ஒரு தீவிரமான காட்சியை நாம் கருத்தில் கொண்டால் இந்த சிக்கலைப் புரிந்துகொள்வது எளிது. நீங்கள் இயற்பியல் டிக் விகிதத்தை நொடிக்கு 10 டிக் ஆக அமைத்தால், 60 FPS இன் வழங்குதல் பிரேம் வீதத்துடன் கூடிய எளிய விளையாட்டில். வழங்குதல் செய்யப்பட்ட பிரேம்களுக்கு எதிராக ஒரு பொருளின் நிலைகளின் வரைபடத்தை நாங்கள் சூழ்ச்சி செய்தால், ஒரு மென்மையான இயக்கத்தைக் கொடுப்பதை விட, ஒரு வினாடியின் ஒவ்வொரு 1/10 வது இடங்களும் "குதிக்க" தோன்றும் என்பதை நீங்கள் காணலாம். இயற்பியல் ஒரு புதிய பொருளுக்கு ஒரு புதிய நிலையை கணக்கிடும்போது, அது ஒரு சட்டகத்திற்கு இந்த நிலையில் வழங்கப்படவில்லை, ஆனால் 6 பிரேம்களுக்கு.
uk: Цю проблему легше зрозуміти, якщо розглянути екстремальний сценарій. Якщо ви встановите частоту фізичних тактів на 10 тактів на секунду, у простій грі з частотою відтворення кадрів 60 FPS. Якщо ми побудуємо графік позицій об’єкта на відтворених кадрах, ви побачите, що позиції будуть «стрибати» кожну 1/10 секунди, а не рухатися плавно. Коли фізика розраховує нове положення для нового об’єкта, він рендериться в цьому положенні не лише для одного кадру, а для 6 кадрів.
zh_tw: 如果我們考慮一個極端情境，這個問題會更容易理解。假設您將物理更新頻率設定為每秒 10 次，在一個簡單的遊戲中，算繪幀率為每秒 60 幀。如果我們繪製一個物件位置相對於算繪幀的圖表，您會看到物件的位置每 1/10 秒會「跳動」一次，而不是呈現平滑的運動。當物理計算出一個新物件的新位置時，這個新位置不會只在一個影格中算繪，而是會持續 6 個影格。

source: This jump can be seen in other combinations of tick / frame rate as glitches, or jitter, caused by this staircasing effect due to the discrepancy between physics tick time and rendered frame time.
it: È possibile osservare questo scatto in altre combinazioni di tick/frame rate come glitch o tremolio, causati da questo effetto a gradini dovuto alla discrepanza tra il tempo di tick di fisica e il tempo di frame renderizzati.
ru: Этот скачок можно увидеть в других сочетаниях тиков/частоты кадров как сбои или дрожание, вызванные этим лестничным эффектом из-за несоответствия между физическим временем тика и временем отрисовки кадра.
ta: இந்த தாவலை டிக் / பிரேம் வீதத்தின் பிற சேர்க்கைகளில் குறைபாடுகள் அல்லது நடுக்கம், இயற்பியல் டிக் நேரம் மற்றும் வழங்கப்பட்ட பிரேம் நேரம் ஆகியவற்றுக்கு இடையிலான வேறுபாடு காரணமாக இந்த படிக்கட்டு விளைவால் ஏற்படுகிறது.
uk: Цей стрибок можна побачити в інших комбінаціях тиків/частоти кадрів як збої або тремтіння, спричинені цим ефектом сходів через розбіжність між часом фізичного такту та часом відтворення кадру.
zh_tw: 這種跳動在其他刻度/影格率的組合中可能會看見，表現為故障、抖動或不穩，這是因為物理刻度時間和算繪影格時間之間的差異所造成的階梯效應。

source: What can we do about frames and ticks being out of sync?
it: Cosa possiamo fare se frame e tick non sono sincronizzati?
ru: Что можно сделать, если кадры и такты не синхронизированы?
ta: பிரேம்கள் மற்றும் உண்ணி ஒத்திசைவுக்கு வெளியே இருப்பது பற்றி நாம் என்ன செய்ய முடியும்?
uk: Що ми можемо зробити з розсинхронізацією кадрів і позначок?
zh_hans: 渲染帧和物理周期不同步怎么办？
zh_tw: 幀數和刻度不同步的問題，我們該怎麼處理？

source: Lock the tick / frame rate together?
it: Bloccare la frequenza dei tick/frame insieme?
ru: Заблокировать тиковую/кадровую частоту вместе?
ta: டிக் / பிரேம் வீதத்தை ஒன்றாக பூட்டவா?
uk: Зафіксувати тік/частоту кадрів разом?
zh_hans: 是否要将物理周期和渲染帧锁定？
zh_tw: 鎖定幀率與物理更新率同步？

source: The most obvious solution is to get rid of the problem, by ensuring there is a physics tick that coincides with every frame. This used to be the approach on old consoles and fixed hardware computers. If you know that every player will be using the same hardware, you can ensure it is fast enough to calculate ticks and frames at e.g. 50 FPS, and you will be sure it will work great for everybody.
it: La soluzione più ovvia è eliminare il problema, assicurandosi che ci sia un tick di fisica che coincida con ogni frame. Questo era l'approccio utilizzato sulle vecchie console e sui computer con hardware fisso. Se si sa che ogni giocatore utilizzerà lo stesso hardware, è possibile assicurare che sia abbastanza veloce per calcolare tick e frame, ad esempio a 50 FPS, e si avrà la certezza che funzionerà bene per tutti.
ru: Самое очевидное решение — избавиться от этой проблемы, обеспечив физический тик, совпадающий с каждым кадром. Этот подход использовался на старых консолях и компьютерах с фиксированным железом. Если вы знаете, что все игроки будут использовать одно и то же оборудование, вы можете убедиться, что оно достаточно быстрое для расчёта тактов и кадров, например, 50 FPS, и можете быть уверены, что всё будет работать отлично для всех.
ta: ஒவ்வொரு சட்டகத்துடனும் ஒத்துப்போகும் இயற்பியல் டிக் இருப்பதை உறுதி செய்வதன் மூலம், சிக்கலில் இருந்து விடுபடுவதே மிகவும் வெளிப்படையான தீர்வு. இது பழைய கன்சோல்கள் மற்றும் நிலையான வன்பொருள் கணினிகளில் அணுகுமுறையாக இருந்தது. ஒவ்வொரு வீரரும் ஒரே வன்பொருளைப் பயன்படுத்துவார்கள் என்பது உங்களுக்குத் தெரிந்தால், எ.கா. 50 எஃப்.பி.எச், இது எல்லோருக்கும் நன்றாக வேலை செய்யும் என்று நீங்கள் உறுதியாக நம்புவீர்கள்.
uk: Найбільш очевидним рішенням є позбутися проблеми, переконавшись, що галочка фізики збігається з кожним кадром. Раніше це був підхід на старих консолях і комп’ютерах зі стаціонарним обладнанням. Якщо ви знаєте, що всі гравці використовуватимуть одне й те саме обладнання, ви можете переконатися, що воно достатньо швидке для обчислення тиків і фреймів, наприклад. 50 FPS, і ви будете впевнені, що це буде чудово працювати для всіх.
zh_tw: 最直觀的解決方案是直接消除問題，方法是確保每個影格都伴隨著一次物理更新。這在舊式遊戲主機和固定規格的電腦上曾經是常見的做法。如果你確定所有玩家都會使用相同的硬體，你可以確保硬體效能足夠快速，能夠以例如 50 FPS 的速度計算物理更新和影格，這樣就能確保所有人的體驗都很順暢。

source: However, modern games are often no longer made for fixed hardware. You will often be planning to release on desktop computers, mobiles, and more. All of which have huge variations in performance, as well as different monitor refresh rates. We need to come up with a better way of dealing with the problem.
it: Tuttavia, i giochi moderni spesso non sono più progettati per hardware fisso. Si pensa spesso di pubblicarli su computer desktop, dispositivi mobili e altro ancora. Tutti questi dispositivi variano enormemente in prestazioni, oltre ad avere diverse frequenze di aggiornamento dei monitor. Dobbiamo pensare a un modo migliore per affrontare il problema.
ru: Однако современные игры часто не рассчитаны на стационарное оборудование. Вы часто планируете выпускать игры на настольных компьютерах, мобильных устройствах и других платформах. Производительность каждого из них сильно различается, как и частота обновления экрана. Нам нужно найти более эффективное решение этой проблемы.
ta: இருப்பினும், நவீன விளையாட்டுகள் பெரும்பாலும் நிலையான வன்பொருளுக்காக உருவாக்கப்படாது. டெச்க்டாப் கணினிகள், மொபைல்கள் மற்றும் பலவற்றை வெளியிட நீங்கள் அடிக்கடி திட்டமிட்டுள்ளீர்கள். இவை அனைத்தும் செயல்திறனில் பெரும் மாறுபாடுகளைக் கொண்டுள்ளன, அத்துடன் வெவ்வேறு மானிட்டர் புதுப்பிப்பு விகிதங்களும் உள்ளன. சிக்கலைக் கையாள்வதற்கான சிறந்த வழியை நாம் கொண்டு வர வேண்டும்.
uk: Однак сучасні ігри часто більше не створюються для фіксованого обладнання. Ви часто плануєте випуск на настільних комп’ютерах, мобільних телефонах тощо. Усі вони мають величезні варіації продуктивності, а також різні частоти оновлення монітора. Нам потрібно придумати кращий спосіб вирішення проблеми.
zh_tw: 然而，現代遊戲通常不再是為固定硬體打造。您經常會計劃在桌上型電腦、行動裝置以及更多平台上發行。這些平台在效能上差異極大，螢幕更新率也各不相同。我們需要想出更好的方法來處理這個問題。

source: Adapt the tick rate?
it: Adattare la frequenza dei tick?
ru: Адаптировать тиковую скорость?
ta: டிக் விகிதத்தை மாற்றியமைக்கவா?
uk: Адаптувати тікрейт?
zh_hans: 适应物理周期率？
zh_tw: 調整刻度率？

source: Instead of designing the game at a fixed physics tick rate, we could allow the tick rate to scale according to the end user's hardware. We could for example use a fixed tick rate that works for that hardware, or even vary the duration of each physics tick to match a particular frame duration.
it: Invece di progettare il gioco con una frequenza fissa dei tick di fisica, potremmo consentire alla frequenza dei tick di adattarsi all'hardware dell'utente finale. Potremmo, ad esempio, utilizzare una frequenza fissa di tick adatta a quell'hardware, o persino variare la durata di ogni tick di fisica per corrispondere a una specifica durata di frame.
ru: Вместо того, чтобы проектировать игру с фиксированной частотой физических тиков, мы могли бы масштабировать её в зависимости от оборудования конечного пользователя. Например, мы могли бы использовать фиксированную частоту физических тиков, подходящую для этого оборудования, или даже варьировать длительность каждого физического тика в соответствии с длительностью конкретного кадра.

source: This works, but there is a problem. Physics (*and game logic*, which is often also run in the ``_physics_process``) work best and most consistently when run at a **fixed**, predetermined tick rate. If you attempt to run a racing game physics that has been designed for 60 TPS (ticks per second) at e.g. 10 TPS, the physics will behave completely differently. Controls may be less responsive, collisions / trajectories can be completely different. You may test your game thoroughly at 60 TPS, then find it breaks on end users' machines when it runs at a different tick rate.
it: Questo funziona, ma c'è un problema. La fisica (*e la logica di gioco*, che spesso è eseguita anche nel ``_physics_process``) funziona meglio e più coerentemente quando è eseguita a una frequenza di tick **fissa** e predeterminata. Se si tenta di eseguire la fisica di un gioco di corsa progettato per 60 TPS (tick al secondo) a, ad esempio, 10 TPS, la fisica si comporterà in modo completamente diverso. I controlli potrebbero essere meno reattivi, le collisioni/traiettorie potrebbero essere completamente diverse. Si potrebbe testare il gioco a fondo a 60 TPS, per poi scoprire che non funziona bene sui computer degli utenti finali quando è eseguito a una frequenza diversa di tick.
ru: Это работает, но есть проблема. Физика (*и игровая логика*, которая часто также выполняется в ``_physics_process``) работают лучше всего и стабильнее всего при запуске с **фиксированной**, предопределённой частотой тиков. Если вы попытаетесь запустить гоночную игру с физикой, рассчитанной на 60 TPS (тиков в секунду), например, с 10 TPS, физика будет вести себя совершенно иначе. Управление может быть менее отзывчивым, столкновения и траектории могут быть совершенно иными. Вы можете тщательно протестировать свою игру при 60 TPS, а затем обнаружить, что она зависает на компьютерах конечных пользователей при запуске с другой частотой тиков.

source: This can make quality assurance difficult with hard to reproduce bugs, especially in AAA games where problems of this sort can be very costly. This can also be problematic for multiplayer games for competitive integrity, as running the game at certain tick rates may be more advantageous than others.
it: Ciò può rendere difficile garantire qualità a causa di bug difficili da riprodurre, soprattutto nei giochi AAA, dove problemi di questo tipo possono essere molto costosi. Ciò può anche essere problematico per l'integrità competitiva nei giochi multigiocatore, poiché eseguire il gioco a determinate frequenze di tick può essere più vantaggioso rispetto ad altre.
ru: Это может затруднить контроль качества из-за трудновоспроизводимых ошибок, особенно в играх класса AAA, где подобные проблемы могут обойтись очень дорого. Это также может быть проблематично для честности многопользовательских игр, поскольку запуск игры на определённых частотах тиков может быть более выгодным, чем на других.
ta: பிழைகளை இனப்பெருக்கம் செய்வது கடினமாக தரமான உத்தரவாதத்தை கடினமாக்கும், குறிப்பாக AAA விளையாட்டுகளில் இந்த வகையான பிரச்சினைகள் மிகவும் விலை உயர்ந்தவை. போட்டி ஒருமைப்பாட்டிற்கான மல்டிபிளேயர் கேம்களுக்கும் இது சிக்கலாக இருக்கும், ஏனெனில் சில டிக் விகிதங்களில் விளையாட்டை இயக்குவது மற்றவர்களை விட மிகவும் சாதகமாக இருக்கும்.
uk: Це може ускладнити перевірку якості через помилки, які важко відтворити, особливо в іграх AAA, де проблеми такого роду можуть коштувати дуже дорого. Це також може бути проблематичним для багатокористувацьких ігор для конкурентної цілісності, оскільки запуск гри з певними тиками може бути більш вигідним, ніж інші.
zh_tw: 這可能會使品質保證變得困難，尤其是在難以重現的錯誤方面，在 AAA 級遊戲中，這類問題的代價可能非常高昂。對於多人遊戲的競技公平性而言，這也可能造成問題，因為以特定的更新頻率運行遊戲可能比其他頻率更有優勢。

source: Lock the tick rate, but use interpolation to smooth frames in between physics ticks
it: Bloccare la frequenza dei tick, ma usare l'interpolazione per rendere fluidi i frame tra i tick di fisica
ru: Заблокируйте частоту тиков, но используйте интерполяцию для сглаживания кадров между физическими тиками
ta: டிக் விகிதத்தை பூட்டவும், ஆனால் இயற்பியல் உண்ணிக்கு இடையில் பிரேம்களை மென்மையாக்க இடைக்கணிப்பைப் பயன்படுத்தவும்
uk: Зафіксуйте частоту тактів, але використовуйте інтерполяцію, щоб згладити кадри між фізичними тактами
zh_hans: 锁定物理周期率，但在物理周期之间使用插值让渲染帧平滑
zh_tw: 鎖定更新頻率，但使用插值來平滑物理更新之間的畫面

source: This has become one of the most popular approaches to deal with the problem, although it is optional and disabled by default.
it: Questo è diventato uno degli approcci più diffusi per affrontare il problema, sebbene sia facoltativo e normalmente disabilitato.
ru: Это стало одним из самых популярных подходов к решению проблемы, хотя он необязателен и по умолчанию отключен.
ta: இது சிக்கலைச் சமாளிப்பதற்கான மிகவும் பிரபலமான அணுகுமுறைகளில் ஒன்றாக மாறியுள்ளது, இருப்பினும் இது இயல்புநிலையாக விருப்பமானது மற்றும் முடக்கப்பட்டுள்ளது.
uk: Це став один із найпопулярніших підходів до вирішення проблеми, хоча він необов’язковий і вимкнений за замовчуванням.
zh_tw: 這已成為處理此問題最受歡迎的方法之一，雖然它是可選的，並且預設為停用。
