Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/interpolation/physics_interpolation_introduction.po
Languages: it, ru, ta, uk, zh_hans, zh_tw

source: In practice, most people won't notice this delay, or rather, it is typically not *objectionable*. There are already significant delays involved in games, we just don't typically notice them. The most significant effect is there can be a slight delay to input, which can be a factor in fast twitch games. In some of these fast input situations, you may wish to turn off physics interpolation and use a different scheme, or use a high tick rate, which mitigates these delays.
it: In pratica, la maggioranza delle persone non noterà questo ritardo, o meglio, in genere non è *inaccettabile*. Ci sono già ritardi significativi nei giochi, ma solitamente non li notiamo. L'effetto più significativo è un leggero ritardo nell'input, che può essere un fattore determinante nei giochi con rapidi twitch. In alcune di queste situazioni di input rapidi, si potrebbe voler disattivare l'interpolazione fisica e utilizzare uno schema diverso, oppure utilizzare una frequenza di tick elevata, che mitiga questi ritardi.
ru: На практике большинство людей не заметят эту задержку, или, скорее, она, как правило, не *нежелательна*. В играх и так присутствуют значительные задержки, просто мы их обычно не замечаем. Наиболее существенный эффект заключается в небольшой задержке ввода, что может быть важным фактором в играх с быстрым вводом. В некоторых ситуациях с быстрым вводом может потребоваться отключить интерполяцию физики и использовать другую схему или использовать высокую частоту тиков, что смягчит эти задержки.
ta: நடைமுறையில், இந்த தாமதத்தை பெரும்பாலான மக்கள் கவனிக்க மாட்டார்கள், அல்லது மாறாக, இது பொதுவாக *ஆட்சேபனைக்குரியது அல்ல. விளையாட்டுகளில் ஏற்கனவே குறிப்பிடத்தக்க தாமதங்கள் உள்ளன, நாங்கள் பொதுவாக அவற்றைக் கவனிக்க மாட்டோம். மிக முக்கியமான விளைவு என்னவென்றால், உள்ளீட்டிற்கு சற்று நேரந்தவறுகை ஏற்படலாம், இது வேகமான இழுப்பு விளையாட்டுகளில் ஒரு காரணியாக இருக்கலாம். இந்த வேகமான உள்ளீட்டு சூழ்நிலைகளில் சிலவற்றில், நீங்கள் இயற்பியல் இடைக்கணிப்பை அணைத்து வேறு திட்டத்தைப் பயன்படுத்த விரும்பலாம் அல்லது அதிக டிக் விகிதத்தைப் பயன்படுத்தலாம், இது இந்த தாமதங்களைத் தணிக்கும்.
uk: На практиці більшість людей не помітять цю затримку, точніше, вона зазвичай не викликає *заперечень*. В іграх вже є значні затримки, просто ми зазвичай їх не помічаємо. Найсуттєвішим ефектом є невелика затримка введення, що може бути фактором у швидких іграх. У деяких із цих ситуацій швидкого введення ви можете вимкнути фізичну інтерполяцію та використати іншу схему або використати високу частоту тактів, що зменшить ці затримки.
zh_tw: 實際上，大多數人不會注意到這個延遲，或者更確切地說，它通常 **不會令人反感** 。遊戲中本來就存在顯著的延遲，只是我們通常不會察覺。最主要的影響是輸入可能會有一點延遲，這在需要快速反應的遊戲中可能會是一個考量因素。在某些需要快速輸入的情況下，您可能會希望關閉物理插值並使用不同的方案，或者使用較高的更新頻率（tick rate），這樣可以減輕這些延遲。

source: Why look into the past? Why not predict the future?
it: Perché guardare al passato? Perché non prevedere il futuro?
ru: Зачем заглядывать в прошлое? Почему бы не предсказать будущее?
ta: கடந்த காலத்தை ஏன் பார்க்க வேண்டும்? எதிர்காலத்தை ஏன் கணிக்கக்கூடாது?
uk: Навіщо дивитися в минуле? Чому б не передбачити майбутнє?
zh_hans: 为什么回顾过去？为什么不预测未来？
zh_tw: 為何回顧過去？為何不預測未來？

source: There is an alternative to this scheme, which is: instead of interpolating between the previous and current tick, we use maths to *extrapolate* into the future. We try to predict where the object *will be*, rather than show it where it was. This can be done and may be offered as an option in future, but there are some significant downsides:
it: Esiste un'alternativa a questo schema: invece di interpolare tra il tick precedente e tick attuale, usiamo la matematica per *estrapolare* nel futuro. Cerchiamo di prevedere dove *sarà* l'oggetto, piuttosto che mostrare dove si trovava. Questa soluzione è possibile e potrebbe essere offerta come opzione in futuro, ma presenta alcuni notevoli svantaggi:
ru: Существует альтернатива этой схеме: вместо интерполяции между предыдущим и текущим тиком мы используем математические вычисления для *экстраполяции* в будущее. Мы пытаемся предсказать, где объект *будет* находиться, а не показывать, где он был. Это возможно и, возможно, будет предложено в будущем, но есть несколько существенных недостатков:
ta: இந்த திட்டத்திற்கு ஒரு மாற்று உள்ளது, அதாவது: முந்தைய மற்றும் தற்போதைய டிக் இடையே இடைக்கணிப்பதற்கு பதிலாக, கணிதங்களை எதிர்காலத்தில் * எக்ச்ட்ராபோலேட் செய்ய பயன்படுத்துகிறோம். பொருள் *எங்கே இருக்கும் என்பதை கணிக்க முயற்சிக்கிறோம், அது எங்கிருந்தாலும் அதைக் காண்பிப்பதை விட. இதைச் செய்யலாம் மற்றும் எதிர்காலத்தில் ஒரு விருப்பமாக வழங்கப்படலாம், ஆனால் சில குறிப்பிடத்தக்க குறைபாடுகள் உள்ளன:
uk: Існує альтернатива цій схемі: замість інтерполяції між попереднім і поточним тиками ми використовуємо математику для *екстраполяції* на майбутнє. Ми намагаємося передбачити, де *буде* об’єкт, а не показувати, де він був. Це можна зробити та запропонувати як опцію в майбутньому, але є кілька суттєвих недоліків:
zh_tw: 這個方案有個替代做法：不是在先前和目前的刻度之間進行內插，而是使用數學來 *外插* 到未來。我們嘗試預測物體 *將會* 在哪裡，而不是顯示它過去在哪裡。這可以做到，未來也可能作為一個選項提供，但存在一些顯著的缺點：

source: The prediction may not be correct, especially when an object collides with another object during the physics tick.
it: La previsione potrebbe non essere corretta, soprattutto quando un oggetto entra in collisione con un altro oggetto durante il tick di fisica.
ru: Прогноз может быть неверным, особенно если объект сталкивается с другим объектом во время физического такта.
ta: கணிப்பு சரியாக இருக்காது, குறிப்பாக இயற்பியல் டிக் போது ஒரு பொருள் மற்றொரு பொருளுடன் மோதுகையில்.
uk: Прогноз може бути невірним, особливо якщо об’єкт стикається з іншим під час фізики.
zh_tw: 預測可能不準確，尤其是在物理更新時物件與其他物件發生碰撞的情況下。

source: Where a prediction was incorrect, the object may extrapolate into an "impossible" position, like inside a wall.
it: Quando una previsione è errata, l'oggetto può estrapolarsi in una posizione "impossibile", come all'interno di un muro.
ru: Если прогноз оказался неверным, объект может переместиться в "невозможное" положение, например, внутрь стены.
ta: ஒரு கணிப்பு தவறாக இருந்த இடத்தில், பொருள் ஒரு சுவருக்குள் இருப்பதைப் போல ஒரு "சாத்தியமற்ற" நிலைக்கு விரிவுபடுத்தக்கூடும்.
uk: Якщо передбачення було неправильним, об’єкт може екстраполюватися в «неможливе» положення, наприклад, усередині стіни.
zh_tw: 當預測不正確時，物件可能會外插到「不可能」的位置，像是牆壁裡面。

source: Providing the movement speed is slow, these incorrect predictions may not be too much of a problem.
it: Purché la velocità di movimento sia lenta, queste previsioni errate potrebbero non essere un grosso problema.
ru: Если скорость движения низкая, то эти неверные прогнозы могут не представлять большой проблемы.
ta: இயக்க வேகத்தை வழங்குவது மெதுவாக உள்ளது, இந்த தவறான கணிப்புகள் ஒரு பிரச்சினையாக இருக்காது.
uk: Якщо швидкість руху повільна, ці неправильні передбачення можуть не становити великої проблеми.
zh_tw: 如果移動速度不快，這些不正確的預測可能不會是太大的問題。

source: When a prediction was incorrect, the object may have to jump or snap back onto the corrected path. This can be visually jarring.
it: Quando una previsione è errata, l'oggetto potrebbe dover saltare o scattare indietro sul percorso corretto. Ciò può essere visivamente irritante.
ru: Если прогноз оказался неверным, объекту может потребоваться подпрыгнуть или резко вернуться на скорректированную траекторию. Это может вызывать визуальный дискомфорт.
ta: ஒரு கணிப்பு தவறாக இருந்தபோது, பொருள் திருத்தப்பட்ட பாதையில் குதிக்க வேண்டும் அல்லது மீண்டும் எடுக்க வேண்டியிருக்கும். இது பார்வைக்கு சார்ரிங் செய்யலாம்.
uk: Якщо передбачення виявилося неправильним, об’єкт може стрибнути або повернутися на виправлену траєкторію. Це може візуально дратувати.
zh_tw: 當預測不正確時，物件可能需要跳躍或突然彈回修正後的路徑。這在視覺上可能會很突兀。

source: Fixed timestep interpolation
it: Interpolazione con intervallo di tempo fisso
ru: Фиксированная интерполяция временного шага
ta: நிலையான நேர இடைக்கணிப்பு
uk: Виправлена інтерполяція з кроком за часом
zh_hans: 固定时间步长插值
zh_tw: 固定時間步差值

source: In Godot this whole system is referred to as physics interpolation, but you may also hear it referred to as **"fixed timestep interpolation"**, as it is interpolating between objects moved with a fixed timestep (physics ticks per second). In some ways the second term is more accurate, because it can also be used to interpolate objects that are not driven by physics.
it: In Godot, l'intero sistema è definito interpolazione fisica, ma è anche possibile sentirlo dire **"interpolazione a intervallo di tempo fisso"**, poiché interpola tra oggetti che si muovono con un intervallo di tempo (tick di fisica al secondo). In un certo senso, il secondo termine è più accurato, perché si può utilizzare anche per interpolare oggetti che non dipendono dalla fisica.
ru: В Godot вся эта система называется физической интерполяцией, но её также можно встретить под названием **"интерполяция с фиксированным временным шагом"**, поскольку она интерполирует объекты, перемещаемые с фиксированным временным шагом (физические такты в секунду). В некотором смысле второй термин точнее, поскольку его можно использовать и для интерполяции объектов, не подчиняющихся законам физики.
ta: கோடோட்டில் இந்த முழு அமைப்பும் இயற்பியல் இடைக்கணிப்பு என குறிப்பிடப்படுகிறது, ஆனால் இது ** "நிலையான நேர அட்டவணையின் இடைக்கணிப்பு" ** என்றும் குறிப்பிடப்படுவதையும் நீங்கள் கேட்கலாம், ஏனெனில் இது ஒரு நிலையான நேர அட்டவணையுடன் (வினாடிக்கு இயற்பியல் உண்ணி) நகர்த்தப்பட்ட பொருள்களுக்கு இடையில் இடைக்கணிக்கிறது. சில வழிகளில் இரண்டாவது சொல் மிகவும் துல்லியமானது, ஏனென்றால் இயற்பியலால் இயக்கப்படாத பொருள்களை இடைக்கணிக்க இது பயன்படுத்தப்படலாம்.
uk: У Ґодо всю цю систему називають фізичною інтерполяцією, але ви також можете почути, що її називають **"інтерполяцією з фіксованим кроком у часі"**, оскільки вона інтерполює між об’єктами, які переміщуються з фіксованим кроком у часі (фізичні тики за секунду). У певному сенсі другий термін більш точний, оскільки його також можна використовувати для інтерполяції об’єктів, які не керуються фізикою.
zh_tw: 在 Godot 中，這個完整的系統稱為物理內插，但您也可能聽過它被稱為 **「固定時間步內插」** ，因為它是基於以固定時間步（每秒物理更新次數）移動的物件之間進行內插。在某些方面，第二個名稱更準確，因為它也可以用於內插非物理驅動的物件。

source: Although physics interpolation is usually a good choice, there are exceptions where you may choose not to use Godot's built-in physics interpolation (or use it in a limited fashion). An example category is internet multiplayer games. Multiplayer games often receive tick or timing based information from other players or a server and these may not coincide with local physics ticks, so a custom interpolation technique can often be a better fit.
it: Sebbene l'interpolazione fisica sia solitamente una buona scelta, ci sono eccezioni in cui è possibile scegliere di non utilizzare l'interpolazione fisica integrata in Godot (o di usarla in modo limitato). Un esempio sono i giochi multigiocatore su Internet. I giochi multigiocatore spesso ricevono informazioni basate su tick o tempi da altri giocatori o da un server e queste potrebbero non coincidere con i tick di fisica locali, quindi una tecnica di interpolazione personalizzata può spesso essere più adeguata.
ru: Хотя интерполяция физики обычно является хорошим выбором, существуют исключения, когда вы можете отказаться от встроенной интерполяции физики Godot (или использовать её ограниченно). Примером могут служить многопользовательские интернет-игры. Многопользовательские игры часто получают информацию о тиках или времени от других игроков или сервера, и эта информация может не совпадать с локальными тиками физики, поэтому пользовательский метод интерполяции часто может оказаться более подходящим.
ta: இயற்பியல் இடைக்கணிப்பு பொதுவாக ஒரு நல்ல தேர்வாக இருந்தாலும், கோடோட்டின் உள்ளமைக்கப்பட்ட இயற்பியல் இடைக்கணிப்பைப் பயன்படுத்த வேண்டாம் என்று நீங்கள் தேர்வுசெய்யக்கூடிய விதிவிலக்குகள் உள்ளன (அல்லது அதை வரையறுக்கப்பட்ட பாணியில் பயன்படுத்தவும்). ஒரு எடுத்துக்காட்டு வகை இணைய மல்டிபிளேயர் விளையாட்டுகள். மல்டிபிளேயர் கேம்கள் பெரும்பாலும் பிற வீரர்கள் அல்லது சேவையகத்திலிருந்து டிக் அல்லது டைமிங் அடிப்படையிலான தகவல்களைப் பெறுகின்றன, மேலும் இவை உள்ளக இயற்பியல் உண்ணியுடன் ஒத்துப்போகாது, எனவே தனிப்பயன் இடைக்கணிப்பு நுட்பம் பெரும்பாலும் சிறந்த பொருத்தமாக இருக்கும்.
uk: Хоча фізична інтерполяція зазвичай є хорошим вибором, є винятки, коли ви можете не використовувати вбудовану фізичну інтерполяцію Godot (або використовувати її обмежено). Прикладом категорії є багатокористувацькі інтернет-ігри. Багатокористувацькі ігри часто отримують від інших гравців або сервера інформацію на основі тиків або часу, і вони можуть не збігатися з локальними фізичними тиками, тому спеціальна техніка інтерполяції часто може бути кращою.
zh_tw: 雖然物理插值通常是不錯的選擇，但有些例外情況您可能會選擇不使用 Godot 內建的物理插值（或僅限部分使用）。一個例子是網路多人遊戲。多人遊戲經常從其他玩家或伺服器接收基於時間或時序的資訊，這些資訊可能與本地物理更新不同步，因此自訂的插值技術通常會更適合。

source: Instead of designing the game at a fixed physics tick rate, we could allow the tick rate to scale according to the end users hardware. We could for example use a fixed tick rate that works for that hardware, or even vary the duration of each physics tick to match a particular frame duration.
ta: ஒரு நிலையான இயற்பியல் டிக் விகிதத்தில் விளையாட்டை வடிவமைப்பதற்கு பதிலாக, இறுதி பயனர்களின் வன்பொருளின் படி டிக் விகிதத்தை அளவிட அனுமதிக்கலாம். உதாரணமாக அந்த வன்பொருளுக்கு வேலை செய்யும் ஒரு நிலையான டிக் விகிதத்தைப் பயன்படுத்தலாம் அல்லது ஒரு குறிப்பிட்ட பிரேம் காலத்திற்கு பொருந்தக்கூடிய ஒவ்வொரு இயற்பியல் டிக்கின் காலத்தையும் வேறுபடுத்தலாம்.
uk: Замість того, щоб розробляти гру з фіксованою швидкістю фізичного тику, ми могли б дозволити частоті тику масштабуватися відповідно до апаратного забезпечення кінцевого користувача. Ми могли б, наприклад, використовувати фіксовану частоту тактів, яка працює для цього обладнання, або навіть змінювати тривалість кожного фізичного таку, щоб відповідати певній тривалості кадру.
zh_tw: 與其用固定的物理更新頻率來設計遊戲，我們可以允許更新頻率根據終端使用者的硬體進行調整。例如，我們可以針對該硬體使用一個可行的固定更新頻率，甚至可以調整每次物理更新的時間長度，使其符合特定的畫面更新時間。

source: This works, but there is a problem. Physics (*and game logic*, which is often also run in the ``_physics_process``) work best and most consistently when run at a **fixed**, predetermined tick rate. If you attempt to run a racing game physics that has been designed for 60 TPS (ticks per second) at e.g. 10 TPS, the physics will behave completely differently. Controls may be less responsive, collisions / trajectories can be completely different. You may test your game thoroughly at 60 TPS, then find it breaks on end users machines when it runs at a different tick rate.
ta: இது வேலை செய்கிறது, ஆனால் ஒரு சிக்கல் உள்ளது. இயற்பியல் (*மற்றும் கேம் லாசிக்*, இது பெரும்பாலும் `_Physics_Process``) இல் இயங்குகிறது, இது ** நிலையான **, முன்னரே தீர்மானிக்கப்பட்ட டிக் விகிதத்தில் இயங்கும்போது மிகச் சிறப்பாகவும், தொடர்ந்து செயல்படவும். எ.கா. 10 டி.பி.எச், இயற்பியல் முற்றிலும் வித்தியாசமாக நடந்து கொள்ளும். கட்டுப்பாடுகள் குறைவாக பதிலளிக்கக்கூடியதாக இருக்கலாம், மோதல்கள் / பாதைகள் முற்றிலும் வேறுபட்டதாக இருக்கலாம். உங்கள் விளையாட்டை 60 டி.பி.எச்சில் முழுமையாக சோதிக்கலாம், பின்னர் அது வேறு டிக் விகிதத்தில் இயங்கும்போது இறுதி பயனர்களின் இயந்திரங்களை உடைப்பதைக் காணலாம்.
uk: Це працює, але є проблема. Фізика (*та ігрова логіка*, яка часто також запускається в ``_physics_process``) працює найкраще та найпослідовніше, коли виконується з **фіксованою**, заздалегідь визначеною швидкістю. Якщо ви спробуєте запустити гоночну гру з фізикою, яка була розроблена для 60 TPS (тактів на секунду) напр. 10 TPS, фізика буде поводитися зовсім по-іншому. Елементи управління можуть бути менш чуйними, зіткнення / траєкторії можуть бути зовсім іншими. Ви можете ретельно перевірити свою гру на 60 TPS, а потім виявити, що вона ламається на машинах кінцевих користувачів, коли вона працює з іншою швидкістю.
zh_tw: 這樣做可行，但有個問題。物理（ *以及遊戲邏輯* ，通常也運行在 ``_physics_process`` 中）在以 **固定** 、預先決定的更新頻率運行時，表現最好且最穩定。如果您嘗試以例如 10 TPS（每秒更新次數）運行一個專為 60 TPS 設計的賽車遊戲物理，物理行為將會完全不同。控制可能較不靈敏，碰撞／軌跡可能會完全改變。您可能在 60 TPS 下徹底測試您的遊戲，然後發現在終端使用者的電腦上以不同的更新頻率運行時發生錯誤。
