Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_debug_tools.po
Languages: ga, ru, ta, uk, zh_cn, zh_tw

source: Navigation debug tools
ga: Uirlisí dífhabhtú nasclean
ru: Инструменты отладки навигации
ta: வழிசெலுத்தல் பிழைத்திருத்த கருவிகள்
uk: Інструменти налагодження навігації
zh_cn: 导航调试工具
zh_tw: 導航除錯工具

source: The debug tools, properties and functions are only available in Godot debug builds. Do not use any of them in code that will be part of a release build.
ga: Níl na huirlisí dífhabhtaithe, airíonna agus feidhmeanna ar fáil ach i dtógáil dífhabhtaithe Godot. Ná húsáid aon cheann acu i gcód a bheidh mar chuid de thógáil scaoilte.
ru: Инструменты отладки, свойства и функции доступны только в отладочных сборках Godot. Не используйте их в коде, который будет частью релизной сборки.
ta: பிழைத்திருத்த கருவிகள், பண்புகள் மற்றும் செயல்பாடுகள் கோடோட் பிழைத்திருத்த கட்டமைப்பில் மட்டுமே கிடைக்கின்றன. வெளியீட்டு கட்டமைப்பின் ஒரு பகுதியாக இருக்கும் குறியீட்டில் அவற்றில் எதையும் பயன்படுத்த வேண்டாம்.
uk: Інструменти налагодження, властивості та функції доступні лише в збірках налагодження Godot. Не використовуйте жодного з них у коді, який буде частиною збірки випуску.
zh_cn: 调试工具、调试属性、调试函数都只在调试版本的 Godot 中可用，请勿在发布版本的代码中使用。
zh_tw: 除錯工具、屬性與函式僅在 Godot 除錯版本中可用。請勿在正式發行版本的程式碼中使用這些功能。

source: Enabling navigation debug
ga: Dífhabhtú loingseoireachta a
ru: Включение отладки навигации
ta: வழிசெலுத்தல் பிழைத்திருத்தத்தை செயல்படுத்துதல்
uk: Увімкнення налагодження навігації
zh_cn: 启用调试导航
zh_tw: 啟用導航除錯

source: The navigation debug visualizations are enabled by default inside the editor. To visualize navigation meshes and connections at runtime too, enable the option **Visible Navigation** in the editor **Debug** menu.
ga: Cumasaítear na léirshamhlú dífhabhtaithe nascleanúna de réir réamhshocraithe taobh istigh Chun mogalra nascleanúna agus naisc nasctha a shamhlú ag am rith freisin, cumasaigh an rogha **Nascleanúint Infheicthe** sa roghchlár eagarthóraí**Debug**.
ru: Визуализация отладочной навигации включена по умолчанию в редакторе. Чтобы визуализировать навигационные сетки и соединения во время выполнения, включите опцию **Visible Navigation** в меню **Debug** редактора.
ta: வழிசெலுத்தல் பிழைத்திருத்த காட்சிப்படுத்தல் எடிட்டருக்குள் இயல்புநிலையாக இயக்கப்பட்டது. இயக்க நேரத்தில் வழிசெலுத்தல் மெச்கள் மற்றும் இணைப்புகளைக் காட்சிப்படுத்த, எடிட்டரில் ** புலப்படும் வழிசெலுத்தல் ** விருப்பத்தை இயக்கவும் ** பிழைத்திருத்த ** பட்டியலில்.
uk: Візуалізації налагодження навігації ввімкнено за замовчуванням у редакторі. Щоб візуалізувати сітки навігації та підключення під час виконання, увімкніть опцію **Видима навігація** в меню **Налагодження** редактора.
zh_cn: 默认情况下，导航调试可视化在编辑器中启用。若要在运行时可视化导航网格和连接，请在编辑器 **Debug** 菜单中启用选项 **Visible Navigation** 。
zh_tw: 編輯器內預設啟用導航除錯視覺化。若要在執行時也顯示導航網格與連線，請在編輯器的 **除錯** 選單中啟用 **顯示導航** 選項。

source: In Godot debug builds the navigation debug can also be toggled through the NavigationServer singletons from scripts.
ga: I dtógann dífhabhtú Godot is féidir an dífhabhtú nascleanúna a thógáil freisin tríd na singil NavigationServer ó scripteanna.
ru: В отладочных сборках Godot отладку навигации также можно переключать через синглтоны NavigationServer из скриптов.
ta: கோடோட் பிழைத்திருத்தத்தில் வழிசெலுத்தல் பிழைத்திருத்தத்தை ச்கிரிப்ட்களிலிருந்து வரும் ஊடுருவல் சிங்கிள்டன்கள் மூலமாகவும் மாற்றலாம்.
uk: У збірках налагодження Godot налагодження навігації також можна перемикати за допомогою синглтонів NavigationServer зі сценаріїв.
zh_cn: 在Godot调试构建中，导航调试也可以通过脚本中的NavigationServer单例进行切换。
zh_tw: 在 Godot 除錯版本中，也可以透過腳本使用 NavigationServer 單例來切換導航除錯。

source: Debug visualizations are currently based on Nodes in the SceneTree. If the :ref:`NavigationServer2D<class_NavigationServer2D>` or :ref:`NavigationServer3D<class_NavigationServer3D>` APIs are used exclusively then changes will not be reflected by the debug navigation tools.
ga: Tá léirshamhlú dífhabhtaithe bunaithe ar Nodes in the SceneTree faoi láthair. Má úsáidtear na APIanna :ref:`NavigationServer2D<class_NavigationServer2D>` nó :ref:`NavigationServer3D<class_NavigationServer3D>` ní bheidh na hathruithe léirithe ag na huirlisí nascleanúna dífhabhtaithe.
ru: Визуализация отладки в настоящее время основана на узлах в SceneTree. Если API :ref:`NavigationServer2D<class_NavigationServer2D>` или :ref:`NavigationServer3D<class_NavigationServer3D>` используются исключительно, то изменения не будут отражены инструментами навигации отладки.
ta: பிழைத்திருத்த காட்சிப்படுத்தல்கள் தற்போது காட்சியில் உள்ள முனைகளை அடிப்படையாகக் கொண்டவை. IF: ref: `assetationserver2d <class_navigationserver2d>` or: ref: `assetationserver3d <class_navigationserver3d>` பநிஇ கள் பிரத்தியேகமாகப் பயன்படுத்தப்படுகின்றன, பின்னர் மாற்றங்கள் பிழைத்திருத்த வழிசெலுத்தல் கருவிகளால் பிரதிபலிக்காது.
uk: Візуалізації налагодження наразі базуються на вузлах у SceneTree. Якщо :ref:`NavigationServer2D<class_NavigationServer2D>` або :ref:`NavigationServer3D<class_NavigationServer3D>` API використовуються винятково, зміни не відображатимуться інструментами навігації зневадження.
zh_tw: 目前的導航除錯視覺化是依據場景樹中的節點（Node）。如果僅透過 :ref:`NavigationServer2D<class_NavigationServer2D>` 或 :ref:`NavigationServer3D<class_NavigationServer3D>` API 來操作，則這些變更不會反映在導航除錯工具中。

source: Navigation debug settings
ga: Socruithe dífhabhtaithe nasclean
ru: Настройки Отладки Навигации
ta: வழிசெலுத்தல் பிழைத்திருத்த அமைப்புகள்
uk: Параметри налагодження навігації
zh_cn: 导航调试设置
zh_tw: 導航除錯設定

source: The appearance of navigation debug can be changed in the ProjectSettings under ``debug/shapes/navigation``. Certain debug features can also be enabled or disabled at will but may require a scene restart to take effect.
ga: Is féidir cuma an dífhabhtaithe nascleanúna a athrú sna Socruithe Tionscadail faoi ``debug/cruthanna/nascleanúint``. Is féidir gnéithe dífhabhtaithe áirithe a chumasú nó a dhíchumasú de réir toil freisin, ach d’fhéadfadh go mbeadh gá le hathréimniú radharc le dul i bhfeidhm.
ru: Внешний вид "отладки навигации" можно изменить в настройках проекта в разделе ``debug/shapes/navigation``. Некоторые функции отладки также можно включать и отключать по желанию, но для их вступления в силу может потребоваться перезапуск сцены.
ta: வழிசெலுத்தல் பிழைத்திருத்தத்தின் தோற்றத்தை `` பிழைத்திருத்த/வடிவங்கள்/வழிசெலுத்தல்`` இன் கீழ் உள்ள திட்டங்களில் மாற்றலாம். சில பிழைத்திருத்த அம்சங்களை விருப்பப்படி இயக்கலாம் அல்லது முடக்கலாம், ஆனால் ஒரு காட்சி மறுதொடக்கம் நடைமுறைக்கு வர வேண்டும்.
uk: Вигляд налагодження навігації можна змінити в параметрах проекту в розділі ``debug/shapes/navigation``. Певні функції налагодження також можна ввімкнути або вимкнути за бажанням, але може знадобитися перезапуск сцени, щоб вступити в силу.
zh_cn: 导航调试的外观可以在 ``debug/shapes/navigation`` 下的ProjectSettings中更改。某些调试功能也可以随意启用或禁用，但可能需要重新启动场景才能生效。
zh_tw: 導航除錯的外觀可在專案設定（ProjectSettings）中的 ``debug/shapes/navigation`` 進行調整。部分除錯功能可隨時開啟或關閉，但可能需重啟場景後才會生效。

source: Debug navigation mesh polygons
ga: Polagáin mogalra nascleanúna a dhífhab
ru: Отладка полигонов навигационной сетки
ta: பிழைத்திருத்த வழிசெலுத்தல் கண்ணி பலகோணங்கள்
uk: Налагодити полігони навігаційної сітки
zh_cn: 调试导航网格多边形
zh_tw: 導航網格多邊形除錯

source: If ``enable_edge_lines`` is enabled, the edges of navigation mesh polygons will be highlighted. If ``enable_edge_lines_xray`` is also enabled, the edges of navigation meshes will be visible through geometry.
ga: Má chumasaítear ``enable_edge_lines``, aibhsiú ar imill na bpolagóin mogalra nascleanúna. Má chumasaítear ``enable_edge_lines_xray`` freisin, beidh imill na mogalraí nascleanúna le feiceáil trí ghéimseadracht.
ru: Если включено ``enable_edge_lines``, края полигонов навигационной сетки будут подсвечены. Если также включено ``enable_edge_lines_xray``, края полигонов навигационной сетки будут видны сквозь геометрию.
ta: `` Enable_edge_lines`` இயக்கப்பட்டிருந்தால், வழிசெலுத்தல் மெச் பலகோணங்களின் விளிம்புகள் முன்னிலைப்படுத்தப்படும். `` Enable_edge_lines_xray`` இயக்கப்பட்டிருந்தால், வழிசெலுத்தல் மெச்களின் விளிம்புகள் வடிவியல் மூலம் தெரியும்.
uk: Якщо включено ``enable_edge_lines``, краї багатокутників навігаційної сітки будуть виділені. Якщо також увімкнено ``enable_edge_lines_xray``, краї навігаційних сіток будуть видимі через геометрію.
zh_cn: 如果启用了 ``enable_edge_lines`` ，则导航网格多边形的边将高亮显示。如果还启用了 ``enable_edge_lines_xray`` ，则导航网格的边将通过几何体可见。
zh_tw: 若啟用 ``enable_edge_lines``，導航網格多邊形的邊緣會被高亮顯示。若同時啟用 ``enable_edge_lines_xray``，則這些邊緣即使被其他幾何物件遮擋時也會顯示。

source: If ``enable_geometry_face_random_color`` is enabled, the color of each navigation mesh face will be mixed with a random color that is itself mixed with the color specified in ``geometry_face_color``.
ga: Má chumasaítear ``enable_geometry_face_random_color``, déanfar dath gach aghaidh mogalra nascleanúna a mheascadh le dath randamach atá measctha leis an dath a shonraítear i ``geometry_face_color``.
ru: Если включено ``enable_geometry_face_random_color``, цвет каждой грани навигационной сетки будет смешан со случайным цветом, который, в свою очередь, смешан с цветом, указанным в ``geometry_face_color``.
ta: `` Enable_geometry_face_random_color`` இயக்கப்பட்டிருந்தால், ஒவ்வொரு வழிசெலுத்தல் கண்ணி முகத்தின் வண்ணமும் சீரற்ற வண்ணத்துடன் கலக்கப்படும், இது `` `வடிவியல்_பேச்_கோலர்`` இல் குறிப்பிடப்பட்டுள்ள வண்ணத்துடன் கலக்கப்படுகிறது.
uk: Якщо включено ``enable_geometry_face_random_color``, колір кожної грані навігаційної сітки буде змішано з випадковим кольором, який сам поєднується з кольором, указаним у ``geometry_face_color``.
zh_cn: 如果启用了 ``enable_geometry_face_random_color`` ，则每个导航网格面的颜色将与随机颜色混合，该随机颜色本身与 ``geometry_face_color`` 中指定的颜色混合。
zh_tw: 若啟用 ``enable_geometry_face_random_color``，每個導航網格面將與 ``geometry_face_color`` 所指定的顏色混合隨機色彩。

source: Debug edge connections
ga: Naisc imeall dífhabhtaithe
ru: Отладка граничных соединений
ta: பிழைத்திருத்த விளிம்பு இணைப்புகள்
uk: Налагодити крайові з'єднання
zh_cn: 调试边缘连接
zh_tw: 邊緣連線除錯

source: When two navigation meshes are connected within ``edge_connection_margin`` distance, the connection is overlaid. The color of the overlay is controlled by ``edge_connection_color``. The connections can be made visible through geometry with ``enable_edge_connections_xray``.
ga: Nuair a bhíonn dhá mhogalra nascleanúna ceangailte laistigh d'achar ``edge_connection_margin``, cuirtear an nasc forleagtha. Tá dath an fhorleagtha á rialú ag ``edge_connection_color``. Is féidir na naisc a dhéanamh le feiceáil trí ghéimseata le ``enable_edge_connections_xray``.
ru: При соединении двух навигационных сеток на расстоянии ``edge_connection_margin`` соединение накладывается. Цвет наложения определяется параметром ``edge_connection_color``. Соединения можно сделать видимыми через геометрию с помощью параметра ``enable_edge_connections_xray``.
ta: இரண்டு வழிசெலுத்தல் மெச்கள் `` எட்ச்_கான்னெக்சன்_மார்சின்`` தூரத்திற்குள் இணைக்கப்படும்போது, இணைப்பு மூடப்பட்டிருக்கும். மேலடுக்கின் நிறம் `` எட்ச்_கான்னெக்சன்_கோலர்`` ஆல் கட்டுப்படுத்தப்படுகிறது. `` Enable_edge_connections_xray`` உடன் வடிவியல் மூலம் இணைப்புகள் காணப்படலாம்.
uk: Коли дві навігаційні сітки з’єднані на відстані ``edge_connection_margin``, з’єднання накладається. Колір накладення контролюється ``edge_connection_color``. З’єднання можна зробити видимими через геометрію за допомогою ``enable_edge_connections_xray``.
zh_cn: 当两个 navigation 网格在 ``edge_connection_margin`` 距离内连接时，连接被覆盖。覆盖层的颜色由 ``edge_connection_color`` 控制。可以使用 ``enable_edge_connections_xray`` 使连接通过几何图形可见。
zh_tw: 當兩個導航網格在 ``edge_connection_margin`` 距離內連接時，會以覆蓋方式顯示連線。覆蓋顏色由 ``edge_connection_color`` 控制。可藉由啟用 ``enable_edge_connections_xray`` 使連線在幾何物件後方也可見。

source: Edge connections are only visible when the NavigationServer is active.
ga: Ní bhíonn naisc imeall le feiceáil ach nuair a bhíonn an NavigationServer gníomhach.
ru: Соединения Edge видны только тогда, когда активен NavigationServer.
ta: ஊடுருவல் செயலாளர் செயலில் இருக்கும்போது மட்டுமே விளிம்பு இணைப்புகள் தெரியும்.
uk: Граничні підключення видимі лише тоді, коли NavigationServer активний.
zh_cn: 只有当NavigationServer处于活动状态时，边缘连接才可见。
zh_tw: 僅當 NavigationServer 處於啟用狀態時，邊緣連線才會顯示。

source: Debug performance
ga: Feidhmíocht dífhab
ru: Производительность отладки
ta: பிழைத்திருத்த செயல்திறன்
uk: Продуктивність налагодження
zh_cn: 调试性能
zh_tw: 效能除錯

source: To measure NavigationServer performance a dedicated monitor exists that can be found within the Editor Debugger under *Debugger->Monitors->Navigation Process*.
ga: Chun feidhmíocht NavigationServer a thomhas tá monatóir tiomnaithe ann atá le fáil laistigh den Dífhabhtóir Eagarthóra faoi *Dífhabhtóir->Monatóirí->Próiseas Nascleanúna*.
ru: Для измерения производительности NavigationServer существует специальный монитор, который можно найти в отладчике редактора в разделе *Debugger->Monitors->Navigation Process*.
ta: ஊடுருவல் செயல்திறனை அளவிடுவதற்கு *பிழைத்திருத்தம்-> மானிட்டர்கள்-> வழிசெலுத்தல் செயல்முறை *இன் கீழ் எடிட்டர் பிழைத்திருத்தத்திற்குள் காணக்கூடிய ஒரு பிரத்யேக மானிட்டர் உள்ளது.
uk: Для вимірювання продуктивності NavigationServer існує спеціальний монітор, який можна знайти в редакторі Debugger у розділі *Debugger->Monitors->Navigation Process*.
zh_cn: 要测试NavigationServer性能，可以在编辑器调试器中的 *Debugger->Monitors->Navigation Process* 下找到一个专用监视器。
zh_tw: 要檢視 NavigationServer 的效能，可透過編輯器除錯器中的 *除錯器->監視器->導航處理* 找到專屬監控項目。

source: Navigation Process shows how long the NavigationServer spends updating its internals this update frame in milliseconds. Navigation Process works similar to Process for visual frame rendering and Physics Process for collision and fixed updates.
ga: Léiríonn Próiseas Nascleanúna cá fhad a chaitheann an NavigationServer a chuid inmheánach an fráma nuashonraithe seo a nuashonrú i milleasoicindí. Oibríonn Próiseas Loingseoireachta cosúil le Próiseas le haghaidh rindreáil fhráma amhairc agus Próiseas Fisice le haghaidh nuashonruithe imbhuailte agus seasta.
ru: Navigation Process показывает, сколько времени NavigationServer тратит на обновление своих внутренних данных в этом кадре обновления (в миллисекундах). Navigation Process работает аналогично Process для визуального рендеринга кадров и Physics Process для столкновений и фиксированных обновлений.
ta: ஊடுருவல் செயல்முறை அதன் உள்நோக்கத்தை இந்த புதுப்பிப்பு சட்டகத்தை மில்லி விநாடிகளில் புதுப்பிக்க எவ்வளவு நேரம் செலவிடுகிறது என்பதைக் காட்டுகிறது. மோதல் மற்றும் நிலையான புதுப்பிப்புகளுக்கான விசுவல் பிரேம் வழங்குதல் மற்றும் இயற்பியல் செயல்முறைக்கான செயல்முறைக்கு வழிசெலுத்தல் செயல்முறை செயல்படுகிறது.
uk: Процес навігації показує, скільки часу NavigationServer витрачає на оновлення своїх внутрішніх елементів цього кадру оновлення в мілісекундах. Процес навігації працює подібно до процесу для візуалізації візуального кадру та процесу фізики для зіткнень і фіксованих оновлень.
zh_cn: Navigation Process以毫秒为单位显示NavigationServer更新其内部的时间。导航过程的工作原理类似于视觉帧渲染过程和碰撞和固定更新的物理过程。
zh_tw: 「導航處理」顯示 NavigationServer 在這個更新影格中花費多少毫秒進行內部更新。其運作方式類似於處理（Process）用於視覺影格算繪，以及物理處理（Physics Process）用於碰撞與固定更新。

source: Navigation Process accounts for all updates to **navigation maps**, **navigation regions** and **navigation agents** as well as all the **avoidance calculations** for the update frame.
ga: Tugann an Próiseas Nascleanúna cuntas ar gach nuashonrú ar **léarscáileanna nascleanúna**, **réigiúin nascleanúna** agus **gníomhairí nascleanúna** chomh maith leis na **ríomhanna seachanta uile don fhráma nuashonraithe.
ru: Navigation Process учитывает все обновления **навигационных карт**, **навигационных регионов** и **навигационных агентов**, а также все **расчеты уклонения** для кадра обновления.
ta: வழிசெலுத்தல் செயல்முறை ** வழிசெலுத்தல் வரைபடங்கள் **, ** வழிசெலுத்தல் பகுதிகள் ** மற்றும் ** வழிசெலுத்தல் முகவர்கள் ** மற்றும் புதுப்பிப்பு சட்டத்திற்கான அனைத்து ** தவிர்ப்பு கணக்கீடுகளும் ** க்கான அனைத்து புதுப்பிப்புகளுக்கும் கணக்குகள்.
uk: Навігаційний процес враховує всі оновлення **навігаційних карт**, **навігаційних регіонів** і **навігаційних агентів**, а також усі **обчислення уникнення** для кадру оновлення.
zh_cn: Navigation Process负责对 **navigation maps** 、**navigation regions**和 **navigation agents** 的所有更新，以及更新帧的所有 **avoidance calculations** 。
zh_tw: 導航處理包括對所有「導航地圖」、「導航區域」與「導航代理」的更新，以及本更新影格的所有「避障計算」。

source: Navigation Process does NOT include pathfinding performance cause pathfinding operates on the navigation map data independently from the server process update.
ga: NÍ áiríonn Próiseas Nascleanúna feidhmíocht aimsithe braite toisc go n-oibríonn braite-aimsiú ar shonraí na léarscáile loingseoireachta go neamhspleách ó nuashonrú an phróisis freastalaí.
ru: Navigation Process НЕ включает в себя производительность поиска пути, поскольку поиск пути выполняется на основе данных навигационной карты независимо от обновления процесса сервера.
ta: வழிசெலுத்தல் செயல்முறை பாத்ஃபைண்டிங் செயல்திறன் காரணமாக இல்லை, சேவையக செயல்முறை புதுப்பிப்பிலிருந்து சுயாதீனமாக வழிசெலுத்தல் வரைபடத் தரவில் பாத்ஃபைண்டிங் செயல்படுகிறது.
uk: Процес навігації НЕ включає продуктивність пошуку шляху, оскільки пошук шляху працює з даними навігаційної карти незалежно від оновлення процесу сервера.
zh_cn: 导航进程不包括寻路性能，因为寻路操作独立于服务器进程更新的导航地图数据。
zh_tw: 導航處理（Navigation Process）**不**包含尋路（pathfinding）的效能，因為尋路作業會獨立於伺服器處理程序，在導航地圖資料上進行。

source: Navigation Process should be in general kept as low and as stable as possible for runtime performance to avoid frame rate issues. Note that since the NavigationServer process update happens in the middle of the physics update an increase in Navigation Process will automatically increase Physics Process by the same amount.
ga: Go ginearálta, ba cheart an Próiseas Loingseoireachta a choinneáil chomh híseal agus chomh cobhsaí agus is féidir le haghaidh feidhmíochta rite ama chun saincheisteanna ráta fráma a sheachaint. Tabhair faoi deara, ó tharla go dtarlaíonn nuashonrú próisis NavigationServer i lár an nuashonraithe fisice, méadóidh méadú ar an bPróiseas Nascleanúna go huathoibríoch an Próiseas Fisice faoin méid céanna.
ru: В целом, для обеспечения производительности во время выполнения следует поддерживать максимально низкий уровень и стабильность Navigation Process, чтобы избежать проблем с частотой кадров. Обратите внимание, что, поскольку обновление процесса NavigationServer происходит в середине обновления физики, увеличение значения Navigation Process автоматически увеличит значение Physics Process на ту же величину.
ta: வழிசெலுத்தல் செயல்முறை பொதுவாக பிரேம் வீத சிக்கல்களைத் தவிர்க்க இயக்க நேர செயல்திறனுக்காக குறைந்த மற்றும் நிலையானதாக இருக்க வேண்டும். இயற்பியலின் நடுவில் ஊடுருவல் செயல்முறை புதுப்பிப்பு நிகழ்கிறது என்பதால், வழிசெலுத்தல் செயல்முறையின் அதிகரிப்பு தானாகவே இயற்பியல் செயல்முறையை அதே அளவு அதிகரிக்கும் என்பதை நினைவில் கொள்க.
uk: Щоб уникнути проблем із частотою кадрів, загалом процес навігації має бути максимально низьким і стабільним, наскільки це можливо, для продуктивності під час виконання. Зауважте, що оскільки оновлення процесу NavigationServer відбувається в середині оновлення фізики, збільшення процесу навігації автоматично збільшить процес фізики на таку ж величину.
zh_cn: 一般情况下，导航进程应尽可能保持低的运行时性能和稳定，以避免帧速率问题。请注意，由于NavigationServer进程更新发生在物理更新的中间，因此Navigation进程的增加将自动使物理进程增加相同的量。
zh_tw: 導航處理應盡量保持低且穩定，以避免執行時的效能問題，如影格率下降。請注意，由於 NavigationServer 的處理更新發生在物理更新中間，導航處理增加時也會同步增加物理處理（Physics Process）所耗費的時間。

source: Navigation also provides more detailed statistics about the current navigation related objects and navigation map composition on the NavigationServer.
ga: Soláthraíonn Nascleanúint freisin staitisticí níos mionsonraithe maidir leis na cuspóirí reatha a bhaineann le loingseoireacht agus comhdhéanamh na léarscáile loingseoireachta ar an NavigationServer.
ru: Навигация также предоставляет более подробную статистику о текущих объектах, связанных с навигацией, и составе навигационной карты на NavigationServer.
ta: வழிசெலுத்தல் தொடர்பான வழிசெலுத்தல் தொடர்பான பொருள்கள் மற்றும் ஊடுருவல் வரைபட அமைப்பு பற்றிய விரிவான புள்ளிவிவரங்களையும் வழிசெலுத்தல் வழங்குகிறது.
uk: Навігація також надає більш детальну статистику про поточні пов’язані з навігацією об’єкти та склад навігаційної карти на NavigationServer.
zh_cn: 导览还提供了关于目前导览相关物件和导览服务器上导览地图组成的更详细的统计数据。
zh_tw: 導航系統同時也會在 NavigationServer 上，提供目前導航相關物件與導航地圖組成的更詳細統計數據。

source: Navigation statistics shown here can not be judged as good or bad for performance as it depends entirely on the project what can be considered as reasonable or horribly excessive.
ga: Ní féidir na staitisticí loingseoireachta a thaispeántar anseo a mheas mar mhaith nó olc le haghaidh feidhmíochta mar braitheann sé go hiomlán ar an tionscadal cad is féidir a mheas mar réasúnta nó uafásach iomarcach.
ru: Приведенную здесь статистику навигации нельзя оценить как хорошую или плохую с точки зрения производительности, поскольку все зависит от проекта: что можно считать разумным, а что — ужасно чрезмерным.
ta: இங்கே காட்டப்பட்டுள்ள வழிசெலுத்தல் புள்ளிவிவரங்கள் செயல்திறனுக்கு நல்லது அல்லது கெட்டவை என்று தீர்மானிக்க முடியாது, ஏனெனில் இது முற்றிலும் திட்டத்தைப் பொறுத்தது, நியாயமான அல்லது பயங்கரமான அதிகப்படியானதாகக் கருதக்கூடியது.
uk: Наведену тут статистику навігації не можна оцінити як хорошу чи погану для продуктивності, оскільки це повністю залежить від проекту, що можна вважати розумним або жахливо надмірним.
zh_cn: 此处显示的导览统计数据无法判断性能的好坏，因为它完全取决于项目什么可以被认为是合理的或严重过度的。
zh_tw: 此處顯示的導航統計資料無法單純判斷效能好壞，因為合理或過度的標準，完全依賴各自的專案需求而定。

source: Navigation statistics help with identifying performance bottlenecks that are less obvious because the source might not always have a visible representation. E.g. pathfinding performance issues created by overly detailed navigation meshes with thousand of edges / polygons or problems caused by procedural navigation gone wrong.
ga: Cabhraíonn staitisticí loingseoireachta le scrogaill feidhmíochta a aithint nach bhfuil chomh soiléir sin toisc go bhféadfadh sé nach mbeadh léiriú infheicthe ag an bhfoinse i gcónaí. E.g. saincheisteanna feidhmíochta braite cruthaithe ag mogaill loingseoireachta ró-mhionsonraithe leis na mílte imill / polagáin nó fadhbanna de bharr loingseoireacht nós imeachta imithe amú.
ru: Статистика навигации помогает выявить узкие места производительности, которые менее очевидны, поскольку их источник не всегда может быть наглядно представлен. Например, проблемы с производительностью поиска пути, вызванные чрезмерно подробными навигационными сетками с тысячами рёбер/полигонов, или проблемы, вызванные сбоями в процедурной навигации.
ta: வழிசெலுத்தல் புள்ளிவிவரங்கள் குறைவான வெளிப்படையான செயல்திறன் இடையூறுகளை அடையாளம் காண உதவுகின்றன, ஏனெனில் மூலத்திற்கு எப்போதும் புலப்படும் பிரதிநிதித்துவம் இருக்காது. எ.கா. அதிகப்படியான விரிவான வழிசெலுத்தல் மெச்களால் உருவாக்கப்பட்ட செயல்திறன் சிக்கல்கள் ஆயிரக்கணக்கான விளிம்புகள் / பலகோணங்கள் அல்லது நடைமுறை வழிசெலுத்தலால் ஏற்படும் சிக்கல்களைக் கொண்டுள்ளன.
uk: Навігаційна статистика допомагає виявити вузькі місця продуктивності, які менш очевидні, оскільки джерело не завжди може мати видиме представлення. наприклад проблеми з продуктивністю пошуку шляху, спричинені надто деталізованими сітками навігації з тисячами країв/багатокутників або проблеми, спричинені неправильною процедурною навігацією.
zh_cn: 导览统计信息有助于识别不太明显的性能瓶颈，因为来源可能并不总是具有可见的表示形式。例如，由具有数千个边/多边形的过于详细的导览网格所建立的寻路性能问题，或由程序导览出错所引起的问题。
zh_tw: 導航統計資訊有助於找出那些不易察覺的效能瓶頸，因為問題來源未必有明顯表現。例如：由數千邊或多邊形組成的過度複雜導航網格導致的尋路效能問題，或是程序化導航失誤產生的問題。

source: Translation status
zh_cn: 翻译状态
