Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationobstacles.po
Languages: ga, it, ru, ta, uk, zh_hans, zh_tw

source: Using NavigationObstacles
ga: Nascleanúint a ÚsáidObstacles
it: Utilizzo degli NavigationObstacle
ru: Использовать NavigationObstacles
ta: வழிசெலுத்தல் பயன்பாடுகளைப் பயன்படுத்துதல்
uk: Використання навігаційних перешкод
zh_hans: 使用 NavigationObstacle
zh_tw: 使用 NavigationObstacle

source: 2D and 3D versions of NavigationObstacles nodes are available as :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` and :ref:`NavigationObstacle3D<class_NavigationObstacle3D>` respectively.
ga: Tá leaganacha 2T agus 3D de nóid Constaicí Nascleanúna ar fáil mar :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` agus :ref:`NavigationObstacle3D<class_NavigationObstacle3D>` faoi seach.
it: Le versioni 2D e 3D dei nodi NavigationObstacle sono disponibili rispettivamente come :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` e :ref:`NavigationObstacle3D<class_NavigationObstacle3D>`.
ru: 2D- и 3D-версии узлов NavigationObstacles доступны как :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` и :ref:`NavigationObstacle3D<class_NavigationObstacle3D>` соответственно.
ta: வழிசெலுத்தல் ஆப்ச்டாகல்ச் முனைகளின் 2 டி மற்றும் 3 டி பதிப்புகள் இவ்வாறு கிடைக்கின்றன: குறிப்பு: `வழிசெலுத்தல்:` class_navigationobstacle2d> `மற்றும்: குறிப்பு:` வழிசெலுத்தல்: _navigationobstacle3d> `முறையே.
uk: 2D і 3D версії вузлів NavigationObstacles доступні як :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` і :ref:`NavigationObstacle3D<class_NavigationObstacle3D>` відповідно.
zh_hans: 2D 和 3D 版本的 NavigationObstacle 节点分别为 :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` 和 :ref:`NavigationObstacle3D<class_NavigationObstacle3D>` 。
zh_tw: 2D 與 3D 版本的 NavigationObstacle 節點分別為 :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` 與 :ref:`NavigationObstacle3D<class_NavigationObstacle3D>`。

source: Navigation obstacles are dual purpose in that they can affect both the navigation mesh baking, and the agent avoidance.
ga: Is déchuspóir iad constaicí loingseoireachta sa mhéid is gur féidir leo difear a dhéanamh don bhácáil mogalra loingseoireachta, agus do sheachaint an ghníomhaire.
it: Gli ostacoli alla navigazione hanno un duplice scopo, in quanto possono influenzare sia la preparazione delle mesh di navigazione sia l'evitamento degli agenti.
ru: Навигационные препятствия имеют двойное назначение, поскольку они могут влиять как на выпечку навигационной сетки, так и на уклонение агента.
ta: வழிசெலுத்தல் தடைகள் இரட்டை நோக்கமாகும், அவை வழிசெலுத்தல் கண்ணி பேக்கிங் மற்றும் முகவர் தவிர்ப்பு இரண்டையும் பாதிக்கும்.
uk: Навігаційні перешкоди мають подвійне призначення, оскільки вони можуть впливати як на запікання навігаційної сітки, так і на уникнення агента.
zh_hans: 障碍物具有双重作用，可以影响导航网格烘焙和代理避障。
zh_tw: 導覽障礙物具有雙重用途，既能影響導覽網格（Navigation Mesh）的烘焙，也能影響代理（Agent）的避障行為。

source: With ``affect_navigation_mesh`` enabled the obstacle will affect navigation mesh when baked.
ga: Le ''affect_navigation_mesh'' cumasaithe, beidh tionchar ag an mbac ar mhogall loingseoireachta nuair a bhácáiltear é.
it: Con ``affect_navigation_mesh`` abilitato, l'ostacolo influenzerà la mesh di navigazione quando preparato.
ru: При включенном ``affect_navigation_mesh`` препятствие будет влиять на навигационную сетку при запекании.
ta: `` Faction_navigation_mesh`` செயல்படுத்தப்பட்டதால், தடையாக இருக்கும் போது வழிசெலுத்தல் கண்ணி பாதிக்கும்.
uk: Якщо ввімкнено ``affect_navigation_mesh``, перешкода впливатиме на навігаційну сітку під час запікання.
zh_hans: ``affect_navigation_mesh`` 启用时，障碍物会影响导航网格的烘焙。
zh_tw: 啟用 ``affect_navigation_mesh`` 屬性時，障礙物會在烘焙導覽網格時發揮作用。

source: With ``avoidance_enabled`` the obstacle will affect avoidance agents.
ga: Le ''avoidance_enabled'' beidh tionchar ag an mbac ar ghníomhairí seachanta.
it: Con ``avoidance_enabled`` l'ostacolo influenzerà gli agenti di evitamento.
ru: При ``avoidance_enabled`` препятствие будет влиять на агентов избегания.
ta: `` தவிர்ப்பது_இனபிள்`` உடன் தடையாகத் தவிர்ப்பது முகவர்களை பாதிக்கும்.
uk: Якщо ``avoidance_enabled``, перешкода впливатиме на агентів уникнення.
zh_hans: ``avoidance_enabled`` 启用时，障碍物会影响代理避障。
zh_tw: 啟用 ``avoidance_enabled`` 時，障礙物會影響啟用避障的代理。

source: Avoidance is enabled by default. If the obstacle is not used for avoidance disable ``enabled_avoidance`` to save performance.
ga: Cumasaítear seachaint de réir réamhshocraithe. Mura n-úsáidtear an chonstaic chun ''enabled_avoidance'' a sheachaint, díchumasaigh '''' chun feidhmíocht a shábháil.
it: L'evitamento è abilitato come predefinito. Se l'ostacolo non è utilizzato per l'evitamento, disabilitare ``enabled_avoidance`` per risparmiare sulle prestazioni.
ru: Функция избегания включена по умолчанию. Если препятствие не используется для избегания, отключите ``enabled_avoidance`` для экономии производительности.
ta: தவிர்ப்பு இயல்புநிலையாக இயக்கப்பட்டது. செயல்திறனைச் சேமிக்க `` இயக்கப்பட்ட தவிர்ப்பு` `தவிர்ப்பதற்கு தடையாகப் பயன்படுத்தப்படாவிட்டால்.
uk: Уникнення ввімкнено за умовчанням. Якщо перешкода не використовується для уникнення, вимкніть ``enabled_avoidance``, щоб зберегти продуктивність.
zh_hans: 避障默认是启用的。如果障碍物不需要参与避障，请禁用 ``enabled_avoidance`` 节省性能。
zh_tw: 預設情況下會啟用避障。如果障礙物不需要用於避障，請關閉 ``enabled_avoidance`` 以節省效能。

source: Obstacles and navigation mesh
ga: Constaicí agus mogall loingseoireachta
it: Mesh di navigazione e ostacoli
ru: Препятствия и навигационная сетка
ta: தடைகள் மற்றும் வழிசெலுத்தல் கண்ணி
uk: Перешкоди та навігаційна сітка
zh_hans: 障碍物与导航网格
zh_tw: 障礙物與導覽網格

source: Navigation obstacles affecting navigation mesh baking
ga: Bacainní loingseoireachta a dhéanann difear do bhácáil mogall loingseoireachta
it: Ostacoli di navigazione che influenzano la preparazione delle mesh di navigazione
ru: Навигационные препятствия, влияющие на запекание навигационной сетки
ta: வழிசெலுத்தல் மெச் பேக்கிங்கை பாதிக்கும் வழிசெலுத்தல் தடைகள்
uk: Навігаційні перешкоди, що впливають на запікання навігаційної сітки
zh_hans: 导航障碍物对导航网格烘焙的影响
zh_tw: 導覽障礙物對導覽網格烘焙的影響

source: Navigation obstacles affecting navigation mesh baking.
ga: Constaicí loingseoireachta a théann i bhfeidhm ar bhácáil mogalra loingseoireachta.
it: Ostacoli di navigazione che influenzano la preparazione delle mesh di navigazione.
ru: Навигационные препятствия, влияющие на запекание навигационной сетки.
ta: வழிசெலுத்தல் மெச் பேக்கிங்கை பாதிக்கும் வழிசெலுத்தல் தடைகள்.
uk: Навігаційні перешкоди, що впливають на запікання навігаційної сітки.
zh_hans: 导航障碍物对导航网格烘焙的影响。
zh_tw: 導覽障礙物影響導覽網格烘焙。

source: For navigation mesh baking, obstacles can be used to discard parts of all other source geometry inside the obstacle shape.
it: Per la preparazione delle mesh di navigazione, gli ostacoli si possono usare per scartare parti di tutta l'altra geometria sorgente all'interno della forma dell'ostacolo.
ru: При запекании навигационной сетки препятствия можно использовать для отбрасывания частей всей другой исходной геометрии внутри формы препятствия.
ta: வழிசெலுத்தல் கண்ணி பேக்கிங்கிற்கு, தடைகள் வடிவத்திற்குள் மற்ற அனைத்து மூல வடிவவியலின் பகுதிகளையும் நிராகரிக்க தடைகள் பயன்படுத்தப்படலாம்.
uk: Для запікання навігаційної сітки можна використовувати перешкоди, щоб відкинути частини всієї іншої вихідної геометрії всередині форми перешкоди.
zh_tw: 在導覽網格烘焙時，障礙物可用來排除其形狀範圍內的所有來源幾何體。

source: This can be used to stop navigation meshes being baked in unwanted places, e.g. inside "solid" geometry like thick walls or on top of other geometry that should not be included for gameplay like roofs.
ga: Is féidir é seo a úsáid chun stop a chur le mogaill loingseoireachta á bhácáil in áiteanna nach dteastaíonn, e.g. taobh istigh de gheoiméadracht "soladach" cosúil le ballaí tiubha nó ar bharr geoiméadracht eile nár chóir a chur san áireamh le haghaidh gameplay cosúil le díonta.
it: Questo può servire per impedire che le mesh di navigazione siano aggiunte in punti indesiderati, ad esempio all'interno di geometrie "solide" come muri spessi o sopra altre geometrie che non dovrebbero essere incluse nel gameplay, come i tetti.
ru: Это можно использовать, чтобы предотвратить запекание навигационных сеток в нежелательных местах, например, внутри «твердой» геометрии, таких как, толстых стен, или поверх другой геометрии, которая не должна быть включена в игровой процесс, например, крыш.
ta: தேவையற்ற இடங்களில் வழிசெலுத்தல் மெச்கள் சுடப்படுவதை நிறுத்த இதைப் பயன்படுத்தலாம், எ.கா. தடிமனான சுவர்கள் போன்ற "திட" வடிவவியலின் உள்ளே அல்லது கூரைகள் போன்ற விளையாட்டுக்கு சேர்க்கப்படக்கூடாது.
uk: Це можна використовувати, щоб зупинити запікання навігаційних сіток у небажаних місцях, напр. всередині «суцільної» геометрії, як-от товсті стіни, або поверх іншої геометрії, яку не слід включати в ігровий процес, як-от дахи.
zh_hans: 这可以用来避免在不需要的地方烘焙出导航网格，例如，类似厚墙的实心集合体的内部，或屋顶等不在游戏范围内的区域。
zh_tw: 這可用來避免在不需要的區域生成導覽網格，例如在厚牆等實體幾何體內部，或是在遊戲進行時不應被包含的區域（如屋頂）上方。

source: Navigation obstacles discard of unwanted navigation mesh
ga: Constaicí loingseoireachta a chaitear amach de mhogall loingseoireachta nach dteastaíonn
it: Gli ostacoli di navigazione scartano le parti indesiderate delle mesh di navigazione
ru: Препятствия к навигации: отбрасывание ненужной навигационной сетки
ta: வழிசெலுத்தல் தடைகள் தேவையற்ற வழிசெலுத்தல் கண்ணி நிராகரிக்கப்படுகின்றன
uk: Навігаційні перешкоди відкидають небажану навігаційну сітку
zh_hans: 导航障碍物弃置不需要的导航网格
zh_tw: 導覽障礙物移除不需要的導覽網格

source: Navigation obstacles discard of unwanted navigation mesh.
ga: Cuireann constaicí loingseoireachta mogall loingseoireachta nach dteastaíonn i leataobh.
it: Gli ostacoli di navigazione scartano le parti indesiderate delle mesh di navigazione.
ru: Препятствия к навигации: отбрасывание ненужной навигационной сетки.
ta: வழிசெலுத்தல் தடைகள் தேவையற்ற வழிசெலுத்தல் கண்ணி நிராகரிக்கப்படுகின்றன.
uk: Навігаційні перешкоди відкидають небажану навігаційну сітку.
zh_hans: 导航障碍物弃置不需要的导航网格。
zh_tw: 導覽障礙物可用來移除不需要的導覽網格。

source: An obstacle does not add geometry in the baking process, it only removes geometry. It does so by nullifying all the (voxel) cells with rasterized source geometry that are within the obstacle shape. As such its effect and shape detail is limited to the cell resolution used by the baking process.
ga: Ní chuireann constaic céimseata sa phróiseas bácála, ní bhaineann sé ach céimseata. Déanann sé amhlaidh trí na cealla (voxel) go léir a neamhniú le geoiméadracht foinse rasterized atá laistigh den chruth constaic. Mar sin tá a éifeacht agus a mhionsonraí crutha teoranta don taifeach cille a úsáideann an próiseas bácála.
it: Un ostacolo non aggiunge geometria al processo di preparazione, la rimuove solo. Lo fa annullando tutte le celle (voxel) con geometria sorgente rasterizzata che si trovano all'interno della forma dell'ostacolo. Pertanto, il suo effetto e il dettaglio della forma sono limitati alla risoluzione delle celle utilizzata dal processo di preparazione.
ru: Препятствие не добавляет геометрию в процессе запекания, а только удаляет её. Это достигается путём аннулирования всех ячеек (вокселей) с растеризованной исходной геометрией, находящихся внутри препятствия. Таким образом, его эффект и детализация формы ограничены разрешением ячеек, используемым в процессе запекания.
ta: ஒரு தடையாக பேக்கிங் செயல்பாட்டில் வடிவவியலை சேர்க்காது, இது வடிவவியலை மட்டுமே நீக்குகிறது. தடையாக வடிவத்திற்குள் இருக்கும் ராச்டரைச் மூல வடிவவியலுடன் அனைத்து (வோக்சல்) கலங்களையும் ரத்து செய்வதன் மூலம் இது அவ்வாறு செய்கிறது. எனவே அதன் விளைவு மற்றும் வடிவ விவரம் பேக்கிங் செயல்முறையால் பயன்படுத்தப்படும் செல் தெளிவுத்திறனுக்கு மட்டுமே.
uk: Перешкода не додає геометрії в процесі випікання, вона лише видаляє геометрію. Це робиться шляхом анулювання всіх (воксельних) комірок із растеризованою вихідною геометрією, які знаходяться в межах форми перешкоди. Таким чином, його ефект і деталі форми обмежені роздільною здатністю комірки, яка використовується в процесі випічки.
zh_hans: 障碍物在烘焙过程中并不会添加几何形状，它只会移除几何形状。它是通过消除障碍物形状内部所有被栅格化源几何覆盖的（体素）单元格来实现这一点的。因此，它的效果和形状细节受限于烘焙过程中使用的单元格分辨率。
zh_tw: 障礙物在烘焙過程中不會新增幾何體，只會移除幾何體。它會將障礙物形狀範圍內的所有（體素）格子設為無效，因此其效果與形狀細節會受限於烘焙時所用的格子解析度。

source: For more details on the navigation mesh baking see :ref:`doc_navigation_using_navigationmeshes`.
ga: Le haghaidh tuilleadh sonraí ar an bácáil mogalra nascleanúna féach :ref:'doc_navigation_using_navigationmeshes'.
it: Per maggiori dettagli sulla preparazione delle mesh di navigazione, consultare :ref:`doc_navigation_using_navigationmeshes`.
ru: Более подробную информацию о запекании навигационной сетки см. :ref:`doc_navigation_using_navigationmeshes`.
ta: வழிசெலுத்தல் கண்ணி பேக்கிங் பற்றிய கூடுதல் விவரங்களுக்கு காண்க: குறிப்பு: `doc_navigation_using_navigationmeshes`.
uk: Додаткову інформацію про запікання навігаційної сітки див. :ref:`doc_navigation_using_navigationmeshes`.
zh_hans: 更多关于导航网格烘焙的信息见 :ref:`doc_navigation_using_navigationmeshes`\ 。
zh_tw: 有關導覽網格烘焙的詳細資訊，請參考 :ref:`doc_navigation_using_navigationmeshes`。

source: The property ``affect_navigation_mesh`` makes the obstacle contribute to the navigation mesh baking. It will be parsed or unparsed like all other node objects in a navigation mesh baking process.
ga: Cuireann an mhaoin ''affect_navigation_mesh'' leis an mbac ar bhácáil mogall loingseoireachta. Beidh sé parsáilte nó unparsed cosúil le gach réad nód eile i bpróiseas bácála mogalra nascleanúna.
it: La proprietà ``affect_navigation_mesh`` fa contribuire l'ostacolo alla preparazione delle mesh di navigazione. Verrà analizzato, o meno, come tutti gli altri oggetti nodo in un processo di preparazione delle mesh di navigazione.
ru: Свойство ``affect_navigation_mesh`` позволяет препятствию участвовать в процессе запекания навигационной сетки. Оно будет подвергнуто или не подвергнуто анализу, как и все остальные объекты-узлы в процессе запекания навигационной сетки.
ta: சொத்து `` பாதிப்பு_நவிகேசன்_மெச்`` `வழிசெலுத்தல் கண்ணி பேக்கிங்கிற்கு தடையாக பங்களிக்கிறது. வழிசெலுத்தல் கண்ணி பேக்கிங் செயல்பாட்டில் மற்ற அனைத்து முனை பொருள்களையும் போல இது பாகுபடுத்தப்படும் அல்லது இனப்பெருக்கம் செய்யப்படும்.
uk: Властивість ``affect_navigation_mesh`` робить перешкоду учасником запікання навігаційної сітки. Він буде аналізуватися або скасовуватися, як і всі інші об’єкти вузлів у процесі запікання навігаційної сітки.
zh_hans: 属性 ``affect_navigation_mesh`` 使得障碍物能够参与到导航网格的烘焙过程中。它将像导航网格烘焙过程中的其他节点对象一样被解析或未解析。
zh_tw: ``affect_navigation_mesh`` 屬性可讓障礙物參與導覽網格烘焙。在導覽網格烘焙流程中，障礙物會像其他節點一樣被解析或略過。

source: The ``carve_navigation_mesh`` property makes the shape unaffected by offsets of the baking, e.g. the offset added by the navigation mesh ``agent_radius``. It will basically act as a stencil and cut into the already offset navigation mesh surface. It will still be affected by further postprocessing of the baking process like edge simplification.
ga: Fágann an mhaoin ''carve_navigation_mesh'' nach gcuireann fritháirimh na bácála isteach ar an gcruth, e.g. an fritháireamh a chuirtear leis an mogall nascleanúna ''agent_radius''. Beidh sé ag gníomhú go bunúsach mar stionsal agus a ghearradh isteach ar an dromchla mogalra loingseoireachta fhritháireamh cheana féin. Beidh tionchar aige fós ar iarphróiseáil bhreise ar an bpróiseas bácála cosúil le simpliú imeall.
it: La proprietà ``carve_navigation_mesh`` fa sì che la forma non venga influenzata dagli offset della preparazione, ad esempio l'offset aggiunto dal ``agent_radius`` di un mesh di navigazione. Fungerà sostanzialmente da stencil e taglierà la superficie di una mesh di navigazione già con un offset. Sarà comunque influenzata dalla post-elaborazione nella preparazione, come la semplificazione dei bordi.
ru: Свойство ``carve_navigation_mesh`` делает форму невосприимчивой к смещениям при запекании, например, к смещению, добавленному навигационной сеткой ``agent_radius``. По сути, оно действует как трафарет и вырезает уже смещенную поверхность навигационной сетки. На него по-прежнему будет влиять дальнейшая постобработка процесса запекания, например, упрощение рёбер.
ta: `` Carve_navigation_mesh`` சொத்து பேக்கிங்கின் ஆஃப்செட்டுகளால் வடிவத்தை பாதிக்காது, எ.கா. வழிசெலுத்தல் கண்ணி மூலம் ஆஃப்செட் சேர்க்கப்பட்டது `` முகவர்_ராடியச்``. இது அடிப்படையில் ஒரு ச்டென்சிலாக செயல்பட்டு ஏற்கனவே ஆஃப்செட் வழிசெலுத்தல் கண்ணி மேற்பரப்பில் வெட்டப்படும். எட்ச் எளிமைப்படுத்தல் போன்ற பேக்கிங் செயல்முறையை மேலும் பின் பதப்படுத்துவதன் மூலம் இது இன்னும் பாதிக்கப்படும்.
uk: Властивість ``carve_navigation_mesh`` робить форму незалежною від зсувів запікання, напр. зсув, доданий навігаційною сіткою ``agent_radius``. По суті, він діятиме як трафарет і врізатиметься у вже зміщену поверхню навігаційної сітки. На нього все одно впливатиме подальша постобробка процесу випікання, наприклад спрощення країв.
zh_hans: 属性 ``carve_navigation_mesh`` 使得形状不受烘焙过程中的偏移影响，例如由导航网格的 ``agent_radius`` 添加的偏移。它基本上会像一个模板一样，在已经加上偏移的导航网格表面上切割。它仍然会受到烘焙过程后期处理的影响，比如边缘简化。
zh_tw: ``carve_navigation_mesh`` 屬性可讓障礙物形狀不受烘焙偏移（例如導覽網格的 ``agent_radius`` 位移）影響。它基本上會像模板一樣直接切割已偏移的導覽網格表面，但仍會受到後續如邊緣簡化等烘焙後處理流程影響。

source: The obstacle shape and placement is defined with the ``height`` and ``vertices`` properties, and the ``global_position`` of the obstacle. The y-axis value of any Vector3 used for the vertices is ignored as the obstacle is projected on a flat horizontal plane.
ga: Sainmhínítear cruth agus socrúchán na constaic leis na hairíonna ''airde'' agus ''vertices'', agus ''global_position'' an chonstaic. Déantar neamhaird ar luach y-ais aon Veicteoir3 a úsáidtear le haghaidh na vertices mar go ndéantar an chonstaic a theilgean ar phlána cothrománach cothrom.
it: La forma e la posizione dell'ostacolo sono definite dalle proprietà ``height`` e ``vertices``, e dalla ``global_position`` dell'ostacolo. Il valore dell'asse y di qualsiasi Vector3 utilizzato per i vertici è ignorato poiché l'ostacolo è proiettato su un piano orizzontale piatto.
ru: Форма и расположение препятствия определяются свойствами ``height`` и ``vertices``, а также ``global_position`` препятствия. Значение по оси Y любого Vector3, используемого для вершин, игнорируется, поскольку препятствие проецируется на плоскую горизонтальную плоскость.
ta: தடையாக வடிவம் மற்றும் வேலைவாய்ப்பு `` உயரம்`` மற்றும் `` செங்குத்துகள்`` பண்புகள் மற்றும் தடையின் `` உலகளாவிய_போசிசன்` ஆகியவற்றுடன் வரையறுக்கப்படுகிறது. ஒரு தட்டையான கிடைமட்ட விமானத்தில் தடையாக திட்டமிடப்பட்டுள்ளதால், செங்குத்துகளுக்குப் பயன்படுத்தப்படும் எந்த திசையன் 3 இன் Y- அச்சு மதிப்பு புறக்கணிக்கப்படுகிறது.
uk: Форма та розташування перешкоди визначаються властивостями ``height`` і ``vertices``, а також ``global_position`` перешкоди. Значення осі Y для будь-якого Vector3, що використовується для вершин, ігнорується, оскільки перешкода проектується на плоску горизонтальну площину.
zh_hans: 障碍物的形状和放置位置由 ``height`` 和 ``vertices`` 属性以及障碍物的 ``global_position`` 定义。用于定义顶点的任何 Vector3 的 y 轴值会被忽略，因为障碍物是在一个平坦的水平面上投影的。
zh_tw: 障礙物的形狀與位置由 ``height`` （高度）、 ``vertices`` （頂點）屬性與障礙物的 ``global_position`` （全域位置）共同決定。頂點的 Vector3 資料中 y 軸的值會被忽略，因障礙物會投影在水平平面上。

source: When baking navigation meshes in scripts obstacles can be added procedurally as a projected obstruction. Obstacles are not involved in the source geometry parsing so adding them just before baking is enough.
ga: Nuair a bhíonn mogall loingseoireachta bácála i scripteanna is féidir constaicí a chur leis an nós imeachta mar bhac réamh-mheasta. Níl constaicí i gceist leis an parsáil geoiméadracht foinse mar sin iad a chur díreach roimh bácáil go leor.
it: Durante la preparazione delle mesh di navigazione negli script, è possibile aggiungere gli ostacoli proceduralmente come ostruzioni proiettate. Gli ostacoli non sono coinvolti nell'analisi della geometria sorgente, quindi aggiungerli appena prima della preparazione è sufficiente.
ru: При запекании навигационных сеток в скриптах препятствия можно добавлять процедурно как проецируемые. Препятствия не участвуют в анализе исходной геометрии, поэтому их достаточно добавить непосредственно перед запеканием.
ta: ச்கிரிப்டுகளில் பேக்கிங் வழிசெலுத்தல் மெச்கள் ஒரு திட்டமிடப்பட்ட தடையாக நடைமுறை ரீதியாக சேர்க்கப்படலாம். மூல வடிவியல் பாகுபடுத்தலில் தடைகள் ஈடுபடவில்லை, எனவே பேக்கிங் போதுமானதாக இருப்பதற்கு சற்று முன்பு அவற்றைச் சேர்ப்பது.
uk: Під час запікання навігаційних сіток у сценаріях перешкоди можна додавати процедурно як спроектовану перешкоду. Перешкоди не беруть участь у аналізі вихідної геометрії, тому достатньо додати їх безпосередньо перед запіканням.
zh_hans: 在脚本中烘焙导航网格时，可以过程式地添加障碍物作为投影遮挡。障碍物不会参与源几何的解析，所以在烘焙前立即添加它们就足够了。
zh_tw: 在腳本中烘焙導覽網格時，障礙物可以程式化加入作為投影阻礙物。障礙物不參與來源幾何體的解析，因此只需在烘焙前加入即可。

source: Obstacles and agent avoidance
ga: Constaicí agus seachaint gníomhaire
it: Ostacoli ed evitamento degli agenti
ru: Препятствия и избегание агента
ta: தடைகள் மற்றும் முகவர் தவிர்ப்பு
uk: Перешкоди та уникнення агента
zh_hans: 障碍物与代理避障
zh_tw: 障礙物與代理避障

source: For avoidance navigation obstacles can be used either as static or dynamic obstacles to affect avoidance controlled agents.
ga: Chun loingseoireacht a sheachaint, is féidir bacainní a úsáid mar chonstaicí statacha nó dinimiciúla chun difear a dhéanamh do ghníomhairí rialaithe seachanta.
it: Per l'evitamento, è possibile utilizzare gli ostacoli di navigazione come ostacoli statici o dinamici per influenzare gli agenti controllati dall'evitamento.
ru: Для уклонения от навигационных препятствий можно использовать как статические, так и динамические препятствия, чтобы воздействовать на контролируемые агенты уклонения.
ta: தவிர்ப்பதற்கு வழிசெலுத்தல் தடைகள் தவிர்ப்பு கட்டுப்படுத்தப்பட்ட முகவர்களைப் பாதிக்க நிலையான அல்லது மாறும் தடைகளாக பயன்படுத்தப்படலாம்.
uk: Для уникнення навігаційні перешкоди можуть використовуватися як статичні або динамічні перешкоди для впливу на керованих агентів уникнення.
zh_hans: 避障导航中的障碍物可以是静态障碍物也可以是动态障碍物，能够影响启用了避障处理的代理。
zh_tw: 在避障功能中，導覽障礙物可以作為靜態或動態障礙物，影響啟用避障控制的代理。

source: When used statically NavigationObstacles constrain avoidance controlled agents outside or inside a polygon defined area.
ga: Nuair a úsáidtear go statically NavigationObstacles srian a sheachaint gníomhairí rialaithe lasmuigh nó taobh istigh de limistéar polagán sainithe.
it: Se utilizzati staticamente, gli ostacoli di navigazione limitano gli agenti controllati dall'evitamento fuori o dentro un'area definita da un poligono.
ru: При статическом использовании NavigationObstacles ограничивает контролируемые агенты, находящиеся вне или внутри области, определенной многоугольником.
ta: பலகோணம் வரையறுக்கப்பட்ட பகுதிக்கு வெளியே அல்லது உள்ளே அல்லது உள்ளே கட்டுப்படுத்தப்பட்ட முகவர்களைத் தவிர்ப்பது சட்டப்பூர்வ வழிசெலுத்தல் தடைகள் தடைகள்.
uk: При статичному використанні навігаційні перешкоди обмежують уникнення контрольованих агентів за межами або всередині визначеної полігоном області.
zh_hans: 当静态使用时，导览障碍会限制多边形定义区域外部或内部的回避控制代理。
zh_tw: 當作為靜態障礙物時，NavigationObstacle 會限制啟用避障的代理位於多邊形所定義區域的外部或內部。

source: When used dynamically NavigationObstacles push away avoidance controlled agents in a radius around them.
ga: Nuair a úsáidtear go dinimiciúil NavigationObstacles bhrú ar shiúl gníomhairí rialaithe a sheachaint i ga timpeall orthu.
it: Se utilizzati dinamicamente, gli ostacoli alla navigazione allontanano gli agenti controllati dall'evitamento in un raggio attorno a loro.
ru: При динамическом использовании NavigationObstacles отталкивают агентов, контролируемых уклонением, в радиусе вокруг них.
ta: மாறும் வழிசெலுத்தல் ஆப்ச்டாக்கள் பயன்படுத்தும் போது, அவற்றைச் சுற்றியுள்ள ஒரு சுற்றளவில் தவிர்ப்பு கட்டுப்பாட்டு முகவர்களைத் தள்ளிவிடுகின்றன.
uk: При динамічному використанні Навігаційні перешкоди відштовхують агентів, керованих уникненням, у радіусі навколо них.
zh_hans: 当动态使用时，导览障碍会推开其周围半径范围内的回避控制代理。
zh_tw: 作為動態障礙物時，NavigationObstacle 會在其半徑範圍內推開啟用避障的代理。

source: Static avoidance obstacles
ga: Constaicí seachanta statacha
it: Ostacoli di evitamento statici
ru: Статические препятствия для избегания
ta: நிலையான தவிர்ப்பு தடைகள்
uk: Уникнення статичних перешкод
zh_hans: 静态避障障碍物
zh_tw: 靜態避障障礙物
