Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationobstacles.po
Languages: ga, it, ru, ta, uk, zh_hans, zh_tw

source: An avoidance obstacle is considered static when its ``vertices`` property is populated with an outline array of positions to form a polygon.
ga: Meastar constaic seachanta a bheith statach nuair a bhíonn a mhaoin ''vertices'' daonra le sraith imlíne de shuíomhanna chun polagán a chruthú.
it: Un ostacolo evitabile è considerato statico quando la sua proprietà ``vertices`` è popolata con un array di posizioni per formare un poligono.
ru: Препятствие для избегания считается статическим, если его свойство ``vertices`` заполнено массивом контуров позиций, образующих многоугольник.
ta: பலகோணத்தை உருவாக்குவதற்கான ஒரு நிலைப்பாடுகளுடன் அதன் `` செங்குத்துகள்` 'சொத்து நிறைந்திருக்கும்போது ஒரு தவிர்ப்பு தடையாக இருக்கும்.
uk: Перешкода для уникнення вважається статичною, якщо її властивість ``vertices`` заповнюється структурним масивом позицій для формування багатокутника.
zh_hans: 避障障碍物的 ``vertices`` 属性填充轮廓位置数组形成多边形后，就会被认为是静态障碍物。
zh_tw: 若障礙物的 ``vertices`` 屬性填入了一組輪廓頂點以形成多邊形，則該避障障礙物被視為靜態。

source: Static obstacle drawn in the editor to block or contain navigation agents
ga: Constaic statach a tharraingítear san eagarthóir chun gníomhairí nascleanúna a bhlocáil nó a shrianadh
it: Ostacolo statico disegnato nell'editor per bloccare o contenere gli agenti di navigazione
ru: Статическое препятствие, нарисованное в редакторе для блокировки или сдерживания навигационных агентов
ta: வழிசெலுத்தல் முகவர்களைத் தடுக்க அல்லது கட்டுப்படுத்த எடிட்டரில் நிலையான தடையாக வரையப்பட்டது
uk: Статична перешкода, намальована в редакторі для блокування або утримання агентів навігації
zh_hans: 编辑器中绘制的静态障碍物，障碍物可以阻挡或容纳导航代理
zh_tw: 於編輯器中繪製的靜態障礙物可用來阻擋或限制代理的移動

source: Static obstacle drawn in the editor to block or contain navigation agents.
ga: Constaic statach a tharraingítear san eagarthóir chun gníomhairí nascleanúna a bhlocáil nó a choinneáil.
it: Ostacolo statico disegnato nell'editor per bloccare o contenere gli agenti di navigazione.
ru: Статическое препятствие, нарисованное в редакторе для блокировки или сдерживания навигационных агентов.
ta: வழிசெலுத்தல் முகவர்களைத் தடுக்க அல்லது கட்டுப்படுத்த எடிட்டரில் நிலையான தடையாக வரையப்பட்டது.
uk: Статична перешкода, намальована в редакторі для блокування або утримання агентів навігації.
zh_hans: 编辑器中绘制的静态障碍物，障碍物可以阻挡或容纳导航代理。
zh_tw: 於編輯器繪製的靜態障礙物可用來阻擋或限制導覽代理的行動。

source: Static obstacles act as hard do-not-cross boundaries for avoidance using agents, e.g. similar to physics collision but for avoidance.
ga: Feidhmíonn constaicí statacha mar theorainneacha crua nach dtrasnaíonn iad chun gníomhairí a sheachaint, e.g. cosúil le himbhualadh fisice ach le seachaint.
it: Gli ostacoli statici agiscono come limiti rigidi da non oltrepassare per gli agenti usanti l'evitamento, ad esempio in modo simile alle collisioni fisiche, ma per l'evitamento.
ru: Статичные препятствия действуют как жесткие границы запрета на пересечение, которые можно обойти с помощью агентов, например, аналогично физическим столкновениям, но для обхода.
ta: நிலையான தடைகள் முகவர்களைப் பயன்படுத்தி தவிர்ப்பதற்கு கடினமாக செய்யப்படாத குறுக்கு எல்லைகளாக செயல்படுகின்றன, எ.கா. இயற்பியல் மோதலைப் போன்றது, ஆனால் தவிர்ப்பதற்கு.
uk: Статичні перешкоди діють як жорсткі межі, які заборонено перетинати, щоб уникнути їх за допомогою агентів, напр. схоже на фізичне зіткнення, але для уникнення.
zh_hans: 静态障碍物起着硬性作用——使代理无法跨越边界而回避，例如类似于物理碰撞，但用于回避。
zh_tw: 靜態障礙物對啟用避障的代理而言，會作為不可通過的硬性邊界，類似於物理碰撞，但僅用於避障。

source: Static obstacles define their boundaries with an array of outline ``vertices`` (positions), and in case of 3D with an additional ``height`` property.
ga: Sainmhíníonn constaicí statacha a dteorainneacha le sraith imlíne ''vertices'' (seasaimh), agus i gcás 3D le maoin bhreise ''airde''.
ru: Статичные препятствия определяют свои границы с помощью массива ``вершин`` контура (позиций), а в случае 3D — с помощью дополнительного свойства ``высоты``.
ta: நிலையான தடைகள் அவற்றின் எல்லைகளை `` செங்குத்துகள்`` (நிலைகள்) அவுட்லைன் வரிசையுடன் வரையறுக்கின்றன, மேலும் 3D விசயத்தில் கூடுதல் `` உயரம்`` சொத்துடன்.
uk: Статичні перешкоди визначають свої межі за допомогою масиву контурних ``вертик`` (положень), а у випадку 3D за допомогою додаткової властивості ``height``.
zh_hans: 静态障碍物用一组轮廓 ``vertices`` （位置）定义其边界，在3D的情况下，用额外的 ``height`` 属性定义其边界。
zh_tw: 靜態障礙物使用一組輪廓 ``vertices`` （頂點/位置）來定義其邊界，若為 3D 則還會有一個 ``height`` （高度）屬性。

source: Static obstacles only work for agents that use the 2D avoidance mode.
ga: Ní oibríonn constaicí statacha ach amháin do ghníomhairí a úsáideann an modh seachanta 2D.
ru: Статичные препятствия работают только для агентов, использующих режим 2D-избегания.
ta: 2 டி தவிர்ப்பு பயன்முறையைப் பயன்படுத்தும் முகவர்களுக்கு மட்டுமே நிலையான தடைகள் வேலை செய்கின்றன.
uk: Статичні перешкоди працюють лише для агентів, які використовують режим уникнення 2D.
zh_hans: 静态障碍物仅适用于使用2D回避模式的代理。
zh_tw: 靜態障礙物僅適用於使用 2D 避障模式的代理。

source: Static obstacles define through winding order of the vertices if agents are pushed out or sucked in.
ga: Sainmhíníonn constaicí statacha trí ordú foirceannadh na vertices má bhrúitear gníomhairí amach nó má shúitear isteach iad.
ru: Статические препятствия определяют посредством порядка обхода вершин, выталкиваются ли агенты или засасываются.
ta: முகவர்கள் வெளியே தள்ளப்பட்டால் அல்லது உறிஞ்சப்பட்டால், செங்குத்துகளின் முறுக்கு வரிசையின் மூலம் நிலையான தடைகள் வரையறுக்கின்றன.
uk: Статичні перешкоди визначають порядок звивистих вершин, якщо агенти виштовхуються або засмоктуються.
zh_hans: 如果代理人被推出或吸入，静态障碍物透过顶点的缠绕顺序来定义。
zh_tw: 靜態障礙物會依頂點的繞行順序決定代理是被推出還是被吸入障礙物內部。

source: Static obstacles can not change their position. They can only be warped to a new position and rebuilt from scratch. Static obstacles as a result are ill-suited for usages where the position is changed every frame, as the constant rebuild has a high performance cost.
ga: Ní féidir le constaicí statacha a seasamh a athrú. Ní féidir iad a warped ach amháin le seasamh nua agus atógadh ó thús. Tá constaicí statacha mar thoradh air sin droch-oiriúnach d'úsáidí ina n-athraítear an suíomh gach fráma, toisc go bhfuil costas ardfheidhmíochta ag an atógáil leanúnach.
ru: Статичные препятствия не могут менять своё положение. Их можно только переместить в новое положение и перестроить заново. Поэтому статические препятствия плохо подходят для ситуаций, где положение меняется в каждом кадре, поскольку постоянное перестроение приводит к высоким потерям производительности.
ta: நிலையான தடைகள் தங்கள் நிலையை மாற்ற முடியாது. அவை ஒரு புதிய நிலைக்கு மட்டுமே திசைதிருப்பப்பட்டு புதிதாக மீண்டும் கட்டமைக்க முடியும். இதன் விளைவாக நிலையான தடைகள் ஒவ்வொரு சட்டகத்தையும் மாற்றும் பயன்பாடுகளுக்கு மிகவும் பொருத்தமானவை, ஏனெனில் நிலையான மறுகட்டமைப்பு அதிக செயல்திறன் செலவைக் கொண்டுள்ளது.
uk: Статичні перешкоди не можуть змінити своє положення. Їх можна лише деформувати на нову позицію та відновити з нуля. У результаті статичні перешкоди погано підходять для використання, де положення змінюється кожного кадру, оскільки постійне відновлення має високу вартість продуктивності.
zh_hans: 静态障碍物不能改变位置，只能先传送到新的位置，然后重新构建。因此，静态障碍物不适合位置每帧都会改变的场合，因为不断重建会产生很高的性能成本。
zh_tw: 靜態障礙物無法直接改變位置，只能將其瞬移（warp）到新位置並重新建立，因此不適合每幀都要移動位置的用途，否則會有很高的效能開銷。

source: Static obstacles that are warped to another position can not be predicted by agents. This creates the risk of getting agents stuck should a static obstacle be warped on top of agents.
ga: Ní féidir le gníomhairí constaicí statacha atá warped le seasamh eile a thuar. Cruthaíonn sé seo an baol gníomhairí a fháil bhfostú ba chóir constaic statach a warped ar bharr gníomhairí.
ru: Агенты не могут предсказать, где находятся статические препятствия, деформированные в другое положение. Это создаёт риск застревания агентов, если статическое препятствие деформируется на них.
ta: வேறொரு நிலைக்கு திசைதிருப்பப்பட்ட நிலையான தடைகளை முகவர்களால் கணிக்க முடியாது. முகவர்களின் மேல் ஒரு நிலையான தடையாக இருக்க வேண்டும் என்றால் இது முகவர்களைப் பெறுவதற்கான அபாயத்தை உருவாக்குகிறது.
uk: Агенти не можуть передбачити статичні перешкоди, які переміщуються в інше положення. Це створює ризик застрягання агентів, якщо статична перешкода буде деформована поверх агентів.
zh_hans: 代理无法预测扭曲到另一个位置的静态障碍物。如果静态障碍物扭曲到代理顶部，这就会产生代理被卡住的风险。
zh_tw: 被瞬移到其他位置的靜態障礙物無法被代理預測。若靜態障礙物瞬移到代理上方，就有可能讓代理被卡住。

source: When the 2D avoidance is used in 3D the y-axis of Vector3 vertices is ignored. Instead, the global y-axis position of the obstacle is used as the elevation level. Agents will ignore static obstacles in 3D that are below or above them. This is automatically determined by global y-axis position of both obstacle and agent as the elevation level as well as their respective height properties.
ga: Nuair a úsáidtear an seachaint 2D i 3D déantar neamhaird ar y-ais vertices Vector3. Ina áit sin, úsáidtear suíomh domhanda y-ais an chonstaic mar leibhéal ingearchló. Déanfaidh gníomhairí neamhaird ar chonstaicí statacha i 3D atá thíos nó os a gcionn. Cinntear é seo go huathoibríoch de réir suíomh domhanda y-ais an chonstaic agus an ghníomhaire araon mar an leibhéal ingearchló chomh maith lena n-airíonna airde faoi seach.
ru: При использовании 2D-обхода в 3D ось Y вершин Vector3 игнорируется. Вместо этого в качестве уровня высоты используется глобальное положение препятствия по оси Y. Агенты будут игнорировать статические препятствия в 3D, находящиеся ниже или выше них. Это автоматически определяется глобальным положением препятствия и агента по оси Y, а также их соответствующими свойствами высоты.
ta: 3D இல் 2 டி தவிர்ப்பு பயன்படுத்தப்படும்போது, வெக்டர் 3 செங்குத்துகளின் ஒய்-அச்சு புறக்கணிக்கப்படுகிறது. அதற்கு பதிலாக, தடையின் உலகளாவிய Y- அச்சு நிலை உயர மட்டமாக பயன்படுத்தப்படுகிறது. 3D இல் நிலையான தடைகளை முகவர்கள் புறக்கணிப்பார்கள். இது தானாகவே தடையாக மற்றும் முகவர் ஆகிய இரண்டின் உலகளாவிய Y- அச்சு நிலை மற்றும் அந்தந்த உயர பண்புகள் ஆகியவற்றால் தீர்மானிக்கப்படுகிறது.
uk: Коли уникання 2D використовується в 3D, вісь y вершин Vector3 ігнорується. Натомість глобальне положення перешкоди по осі Y використовується як рівень висоти. Агенти ігноруватимуть статичні перешкоди в 3D, які знаходяться під або над ними. Це автоматично визначається глобальним положенням осі ординат як перешкоди, так і агента як рівень висоти, а також їхні відповідні властивості висоти.
zh_hans: 当在3D中使用2D回避时，Vector3顶点的y轴将被忽略。相反，障碍物的全局y轴位置用作海拔高度。代理将忽略3D中低于或高于其的静态障碍物。这是由障碍物和代理的全局y轴位置自动确定为海拔高度以及它们各自的高度属性。
zh_tw: 當在 3D 場景下使用 2D 避障時，Vector3 頂點的 y 軸會被忽略，會以障礙物的全域 y 軸位置為高度。代理會自動忽略位於其上下方（超出高度範圍）的靜態障礙物，這會根據障礙物與代理的全域 y 軸位置與各自的高度屬性自動判斷。

source: Dynamic avoidance obstacles
ga: Constaicí dinimiciúla seachanta
it: Ostacoli di evitamento dinamici
ru: Динамические препятствия для избегания
ta: மாறும் தவிர்ப்பு தடைகள்
uk: Динамічне уникнення перешкод
zh_hans: 动态避障障碍物
zh_tw: 動態避障障礙物

source: An avoidance obstacle is considered dynamic when its ``radius`` property is greater than zero.
ga: Meastar constaic seachanta a bheith dinimiciúil nuair is mó a mhaoin ''ga'' ná nialas.
ru: Препятствие для избегания считается динамическим, если его свойство ``радиус`` больше нуля.
ta: அதன் `` ஆரம்`` சொத்து பூச்சியத்தை விட அதிகமாக இருக்கும்போது தவிர்ப்பதற்கான தடையாக மாறும்.
uk: Перешкода для уникнення вважається динамічною, якщо її властивість ``радіус`` більше нуля.
zh_hans: 避障障碍物的 ``radius`` 属性大于零时就会被认为是动态障碍物。
zh_tw: 若障礙物的 ``radius`` （半徑）屬性大於零，則該避障障礙物被視為動態。

source: Dynamic obstacles act as a soft please-move-away-from-me object for avoidance using agents, e.g. similar to how they avoid other agents.
ga: Feidhmíonn constaicí dinimiciúla mar réad bog le do thoil-bogadh-as-dom le seachaint ag baint úsáide as gníomhairí, m.sh.
ru: Динамические препятствия действуют как мягкий объект "пожалуйста, отойдите от меня", который агенты избегают, например, аналогично тому, как они избегают других агентов.
ta: முகவர்களைப் பயன்படுத்தி தவிர்ப்பதற்கு மாறும் தடைகள் மென்மையான தயவுசெய்து-மூவ்-அவே-மீ பொருளாக செயல்படுகின்றன, எ.கா. மற்ற முகவர்களை அவர்கள் எவ்வாறு தவிர்க்கிறார்கள் என்பதைப் போன்றது.
uk: Динамічні перешкоди діють як м’який об’єкт, будь ласка, відійдіть від мене, щоб уникнути за допомогою агентів, напр. подібно до того, як вони уникають інших агентів.
zh_hans: 对于启用了避障的代理而言，动态障碍物就是一个“请离我远点”的对象，类似于它们自己躲避其他代理的行为。
zh_tw: 動態障礙物對啟用避障的代理而言，充當一個『請離我遠一點』的軟性阻擋物，類似於代理彼此之間的避讓行為。

source: Dynamic obstacles define their boundaries with a single ``radius`` for a 2D circle, or in case of 3D avoidance a sphere shape.
ga: Sainmhíníonn constaicí dinimiciúla a dteorainneacha le ''ga'' amháin do chiorcal 2D, nó i gcás cruth sféir a sheachaint 3D.
ru: Границы динамических препятствий определяются единым ``радиусом`` для двухмерного круга или, в случае трехмерного обхода, формой сферы.
ta: மாறும் தடைகள் அவற்றின் எல்லைகளை 2 டி வட்டத்திற்கு ஒற்றை `` ஆரம்` உடன் வரையறுக்கின்றன, அல்லது 3D தவிர்ப்பு ஒரு கோள வடிவத்தில்.
uk: Динамічні перешкоди визначають свої межі єдиним ``радіусом`` для двовимірного кола або, у разі уникнення 3D, форму сфери.
zh_hans: 动态障碍物使用 ``radius`` 半径来定义边界，2D 中是圆形，3D 中是球形。
zh_tw: 動態障礙物僅以一個 ``radius`` （半徑）屬性定義其邊界：2D 為圓形，3D 則為球形。

source: Dynamic obstacles can change their position every frame without additional performance cost.
ga: Is féidir le constaicí dinimiciúla a seasamh a athrú gach fráma gan costas feidhmíochta breise.
ru: Динамические препятствия могут менять свое положение в каждом кадре без дополнительных затрат производительности.
ta: மாறும் தடைகள் கூடுதல் செயல்திறன் செலவு இல்லாமல் ஒவ்வொரு சட்டத்தையும் தங்கள் நிலையை மாற்றலாம்.
uk: Динамічні перешкоди можуть змінювати своє положення кожного кадру без додаткових витрат на продуктивність.
zh_hans: 动态障碍物每一帧都可以改变位置，不会有额外的性能开销。
zh_tw: 動態障礙物可在每一幀自由移動，不會產生額外的效能耗損。

source: Dynamic obstacles with a set velocity can be predicted in their movement by agents.
ga: Is féidir constaicí dinimiciúla le treoluas socraithe a thuar ina ngluaiseacht ag gníomhairí.
ru: Динамические препятствия с заданной скоростью могут быть спрогнозированы агентами по их движению.
ta: ஒரு தொகுப்பு வேகத்துடன் கூடிய மாறும் தடைகளை முகவர்களால் அவற்றின் இயக்கத்தில் கணிக்க முடியும்.
uk: Динамічні перешкоди із заданою швидкістю можуть бути передбачені в їх русі агентами.
zh_hans: 动态障碍物设置速度后，其他代理就能够预测移动。
zh_tw: 若動態障礙物設定了速度，代理就可預測其移動路徑。

source: Dynamic obstacles are not a reliable way to constrain agents in crowded or narrow spaces.
ga: Ní bealach iontaofa iad constaicí dinimiciúla chun srian a chur ar ghníomhairí i spásanna plódaithe nó cúnga.
ru: Динамические препятствия не являются надежным способом ограничения движения агентов в людных или узких пространствах.
ta: நெரிசலான அல்லது குறுகிய இடைவெளிகளில் முகவர்களைக் கட்டுப்படுத்த மாறும் தடைகள் நம்பகமான வழி அல்ல.
uk: Динамічні перешкоди не є надійним способом стримування агентів у людних або вузьких місцях.
zh_hans: 动态障碍物不适合用来将代理限制在拥挤、狭窄的空间中。
zh_tw: 動態障礙物並不適合用來在擁擠或狹窄空間中限制代理的行動。

source: While both static and dynamic properties can be active at the same time on the same obstacle this is not recommended for performance. Ideally when an obstacle is moving the static vertices are removed and instead the radius activated. When the obstacle reaches the new final position it should gradually enlarge its radius to push all other agents away. With enough created safe space around the obstacle it should add the static vertices again and remove the radius. This helps avoid getting agents stuck in the suddenly appearing static obstacle when the rebuilt static boundary is finished.
ga: Cé gur féidir le hairíonna statacha agus dinimiciúla a bheith gníomhach ag an am céanna ar an mbac céanna ní mholtar é seo le haghaidh feidhmíochta. Go hidéalach nuair a bhíonn constaic ag gluaiseacht baintear na vertices statacha agus ina ionad sin gníomhachtaítear an ga. Nuair a shroicheann an constaic an suíomh deiridh nua ba chóir dó a gha a mhéadú de réir a chéile chun gach gníomhaire eile a bhrú ar shiúl. Le go leor spás sábháilte cruthaithe timpeall an chonstaic ba chóir dó na vertices statach a chur leis arís agus an ga a bhaint. Cuidíonn sé seo le gníomhairí a chur i bhfostú sa chonstaic statach a fheictear go tobann nuair a bhíonn an teorainn statach atógtha críochnaithe.
ru: Хотя статические и динамические свойства могут быть активны одновременно на одном и том же препятствии, это не рекомендуется для производительности. В идеале, когда препятствие движется, статические вершины удаляются и вместо них активируется радиус. Когда препятствие достигает нового конечного положения, оно должно постепенно увеличивать свой радиус, чтобы оттолкнуть всех остальных агентов. Создав достаточно безопасного пространства вокруг препятствия, следует снова добавить статические вершины и удалить радиус. Это помогает избежать застревания агентов во внезапно появляющемся статическом препятствии после завершения восстановления статической границы.
ta: நிலையான மற்றும் மாறும் பண்புகள் ஒரே நேரத்தில் ஒரே நேரத்தில் செயலில் இருக்க முடியும் என்றாலும், இது செயல்திறனுக்கு பரிந்துரைக்கப்படவில்லை. வெறுமனே ஒரு தடையாக இருக்கும்போது நிலையான செங்குத்துகள் அகற்றப்பட்டு, அதற்கு பதிலாக ஆரம் செயல்படுத்தப்படுகிறது. தடையாக புதிய இறுதி நிலையை அடையும் போது, மற்ற எல்லா முகவர்களையும் தள்ளிவைக்க அதன் ஆரம் படிப்படியாக விரிவுபடுத்த வேண்டும். தடையைச் சுற்றி போதுமான பாதுகாப்பான இடத்துடன் அது நிலையான செங்குத்துகளை மீண்டும் சேர்க்க வேண்டும் மற்றும் ஆரம் அகற்ற வேண்டும். மீண்டும் கட்டப்பட்ட நிலையான எல்லை முடிந்ததும் திடீரென தோன்றும் நிலையான தடையாக முகவர்கள் சிக்கிக்கொள்வதை இது தவிர்க்க உதவுகிறது.
uk: Хоча як статичні, так і динамічні властивості можуть бути активними одночасно на одній перешкоді, це не рекомендується для продуктивності. В ідеалі, коли перешкода рухається, статичні вершини видаляються, а замість цього активується радіус. Коли перешкода досягне нового кінцевого положення, вона повинна поступово збільшувати свій радіус, щоб відштовхнути всіх інших агентів. Якщо навколо перешкоди створено достатньо безпечного простору, слід знову додати статичні вершини та видалити радіус. Це допомагає уникнути того, щоб агенти застрягли на статичній перешкоді, що раптово з’явилася, коли відновлена статична межа буде завершена.
zh_hans: 虽然障碍物可以同时激活静态和动态属性，但是出于性能的考虑不建议这么做。理想情况下，障碍物移动时应该移除静态顶点、激活半径。障碍物到达目的地后则应该逐步增大半径，将其他代理推开。在障碍物的周围创造出足够大的安全区域后，就应该把静态顶点添加回来、移除半径。这样就能够避免重建静态边界后，代理因为静态障碍物的突然出现而被卡住的情况。
zh_tw: 同一個障礙物可以同時啟用靜態與動態屬性，但基於效能考量並不建議這麼做。理想作法是在障礙物移動時移除靜態頂點、啟用半徑；到達新位置後，逐漸擴大半徑以推開其他代理，確保周圍有足夠安全空間，再新增回靜態頂點並移除半徑。這樣可避免代理因障礙物靜態邊界突然出現而被卡住。

source: Similar to agents the obstacles can make use of the ``avoidance_layers`` bitmask. All agents with a matching bit on their own avoidance mask will avoid the obstacle.
ga: Cosúil le gníomhairí is féidir leis na constaicí úsáid a bhaint as an bitmask ''avoidance_layers''. Seachnóidh gach gníomhaire a bhfuil giota meaitseála acu ar a masc seachanta féin an chonstaic.
ru: Подобно агентам, препятствия могут использовать битовую маску ``avoidance_layers``. Все агенты с соответствующим битом в своей маске избегания будут избегать препятствия.
ta: முகவர்களைப் போலவே தடைகளும் `` தவிர்ப்பு_லேயர்கள்` `பிட்மாச்கைப் பயன்படுத்தலாம். தங்கள் சொந்த தவிர்ப்பு முகமூடியில் பொருந்தக்கூடிய பிட் கொண்ட அனைத்து முகவர்களும் தடையைத் தவிர்ப்பார்கள்.
uk: Подібно до агентів, перешкоди можуть використовувати бітову маску ``avoidance_layers``. Усі агенти з відповідним бітом на власній масці уникнення уникатимуть перешкоди.
zh_hans: 和代理类似，障碍物也能够使用 ``avoidance_layers`` 位掩码。自身的避障掩码中与之存在匹配位的代理都会躲避这个障碍物。
zh_tw: 與代理一樣，障礙物也能使用 ``avoidance_layers`` 位元遮罩。只要代理的避障遮罩與障礙物有相同位元，就會主動避開該障礙物。

source: Procedural obstacles
ga: Constaicí nós imeachta
it: Ostacoli procedurali
ru: Процедурные препятствия
ta: நடைமுறை தடைகள்
uk: Процесуальні перешкоди
zh_hans: 程序式障碍物
zh_tw: 程式產生障礙物

source: New obstacles can be created in a script without a Node by using the NavigationServer directly.
ga: Is féidir constaicí nua a chruthú i script gan Nód tríd an NavigationServer a úsáid go díreach.
ru: Новые препятствия можно создавать в скрипте без узла, используя напрямую NavigationServer.
ta: புதிய தடைகளை ஒரு முனை இல்லாமல் ஒரு ச்கிரிப்டில் நேரடியாகப் பயன்படுத்துவதன் மூலம் உருவாக்க முடியும்.
uk: Нові перешкоди можна створювати в сценарії без Node, використовуючи безпосередньо NavigationServer.
zh_hans: 可以不借助节点，直接在脚本中使用 NavigationServer 来新建障碍物。
zh_tw: 可以直接透過 NavigationServer 在腳本中建立障礙物，而不需依賴節點。

source: Obstacles created with scripts require at least a ``map`` and a ``position``. For dynamic use a ``radius`` is required. For static use an array of ``vertices`` is required.
ga: Teastaíonn ''léarscáil'' agus ''seasamh'' ar a laghad ó chonstaicí a chruthaítear le scripteanna. Chun úsáid dhinimiciúil a bhaint as, tá gá le 'ga''. Le haghaidh úsáid statach tá sraith de ''vertices'' ag teastáil.
ru: Для создания препятствий с помощью скриптов требуется как минимум ``карта`` и ``позиция``. Для динамического использования требуется ``радиус``. Для статического использования требуется массив ``вершин``.
ta: ச்கிரிப்ட்களுடன் உருவாக்கப்பட்ட தடைகளுக்கு குறைந்தபட்சம் ஒரு `` வரைபடம்`` மற்றும் ஒரு `` நிலை`` தேவைப்படுகிறது. மாறும் பயன்படுத்த `` ஆரம்`` தேவை. நிலையான பயன்பாட்டிற்கு `` செங்குத்துகள்`` தேவை.
uk: Перешкоди, створені за допомогою сценаріїв, потребують принаймні ``карти`` і ``позиції``. Для динамічного використання потрібен ``радіус``. Для статичного використання необхідний масив ``вершин``.
zh_hans: 使用脚本创建的障碍物至少需要有一个 ``map`` 和一个 ``position``\ 。动态障碍物还需要 ``radius``\ 。静态障碍物还需要 ``vertices`` 属性。
zh_tw: 用腳本建立的障礙物至少需要指定 ``map`` 及 ``position``。如為動態障礙物需指定 ``radius``，靜態障礙物則需指定 ``vertices`` 陣列。
