Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationregions.po
Languages: ga, ru, ta, uk, zh_hans, zh_hant

source: Using NavigationRegions
ga: Úsáid NavigationRegions
ru: Использование NavigationRegions
ta: வழிசெலுத்தல் பிராந்தியங்களைப் பயன்படுத்துதல்
uk: Використання NavigationRegions
zh_hans: 使用导航区块
zh_hant: 使用 NavigationRegion

source: NavigationRegions are the visual Node representation of a **region** of the navigation **map** on the NavigationServer. Each NavigationRegion node holds a resource for the navigation mesh data.
ga: Is iad NavigationRegions léiriú amhairc Nód d'**réigiún** den nascleanúna** léarscáil** ar an NavigationServer. Tá acmhainn ag gach nód NavigationRegion do na sonraí mogalra nascleanúna.
ru: NavigationRegions — это визуальное представление узлов **региона** навигационной **карты** на NavigationServer. Каждый узел NavigationRegion содержит ресурс для данных навигационной сетки.
ta: வழிசெலுத்தல் பிராந்தியங்கள் என்பது வழிசெலுத்தல் ** வரைபடம் ** இன் ஒரு ** பிராந்தியத்தின் ** இன் காட்சி முனை பிரதிநிதித்துவம் ஆகும். ஒவ்வொரு வழிசெலுத்தல் பிராந்திய முனையும் வழிசெலுத்தல் கண்ணி தரவுகளுக்கான ஆதாரத்தை வைத்திருக்கிறது.
uk: NavigationRegions — це візуальне представлення Node **регіону** навігаційної **карти** на NavigationServer. Кожен вузол NavigationRegion містить ресурс для даних навігаційної сітки.
zh_hans: NavigationRegion 即导航区块，是对 NavigationServer 的导航\ **地图**\ 中某个\ **区块**\ 的可视化 Node 表示。每个 NavigationRegion 节点中都存放着导航网格数据资源。
zh_hant: NavigationRegion 是 NavigationServer 上導航地圖中「區域」的可視化節點表示。每個 NavigationRegion 節點都儲存一份導航網格資源。

source: Both 2D and 3D version are available as :ref:`NavigationRegion2D<class_NavigationRegion2D>` and :ref:`NavigationRegion3D<class_NavigationRegion3D>` respectively.
ga: Tá an leagan 2T agus 3T araon ar fáil mar :ref:`NavigationRegion2D<class_NavigationRegion2D>` agus :ref:`NavigationRegion3D<class_NavigationRegion3D>` faoi seach.
ru: Доступны как 2D-, так и 3D-версии как :ref:`NavigationRegion2D<class_NavigationRegion2D>` и :ref:`NavigationRegion3D<class_NavigationRegion3D>` соответственно.
ta: 2 டி மற்றும் 3 டி பதிப்பு இரண்டும் இவ்வாறு கிடைக்கின்றன: குறிப்பு: `வழிசெலுத்தல் ரெசியன் 2 டி <class_navigationRegion2d>` மற்றும்: ref: `வழிசெலுத்தல் பிரேகோன் 3 டி <class_navigationRegion3d>` முறையே.
uk: Версії 2D і 3D доступні як :ref:`NavigationRegion2D<class_NavigationRegion2D>` і :ref:`NavigationRegion3D<class_NavigationRegion3D>` відповідно.
zh_hans: 2D 和 3D 版本分别为 :ref:`NavigationRegion2D<class_NavigationRegion2D>` 和 :ref:`NavigationRegion3D<class_NavigationRegion3D>`\ 。
zh_hant: 2D 與 3D 版本分別為 :ref:`NavigationRegion2D<class_NavigationRegion2D>` 與 :ref:`NavigationRegion3D<class_NavigationRegion3D>`。

source: Individual NavigationRegions upload their 2D NavigationPolygon or 3D NavigationMesh resource data to the NavigationServer. The NavigationServer map turns this information into a combined navigation map for pathfinding.
ga: Uaslódálann Réigiúin Nascleanúna Aonair a gcuid sonraí acmhainne 2D NavigationPolygon nó 3D NavigationMesh chuig an NavigationServer. Déanann an léarscáil NavigationServer an fhaisnéis seo a iompú ina léarscáil chomhcheangailte nascleanúna le haghaidh lorg cosáin.
ru: Отдельные NavigationRegions загружают данные о своих ресурсах 2D NavigationPolygon или 3D NavigationMesh на NavigationServer. Карта NavigationServer преобразует эту информацию в комбинированную навигационную карту для поиска пути.
ta: தனிப்பட்ட வழிசெலுத்தல் பிராந்தியங்கள் அவற்றின் 2 டி நேவிகேசன் போலிகான் அல்லது 3 டி நேவிகேசன்மேச் வள தரவை ஊடுருவல் சேவையாளருக்கு பதிவேற்றுகின்றன. ஊடுருவல் வரைபடம் இந்த தகவலை பாத்ஃபைண்டிங் செய்வதற்கான ஒருங்கிணைந்த வழிசெலுத்தல் வரைபடமாக மாற்றுகிறது.
uk: Окремі NavigationRegions завантажують дані своїх ресурсів 2D NavigationPolygon або 3D NavigationMesh на NavigationServer. Карта NavigationServer перетворює цю інформацію на комбіновану навігаційну карту для пошуку шляху.
zh_hans: 各个导航区域将其二维导航多边形或三维导航网格资源数据上传到导航服务器。导航服务器地图会将这些信息转化为用于寻路的组合导航地图。
zh_hant: 每個 NavigationRegion 會將其 2D NavigationPolygon 或 3D NavigationMesh 資源資料上傳至 NavigationServer。 它會將這些資訊組合成完整的導航地圖，以供路徑尋找使用。

source: To create a navigation region using the scene tree add a ``NavigationRegion2D`` or ``NavigationRegion3D`` node to the scene. All regions require a navigation mesh resource to function. See :ref:`doc_navigation_using_navigationmeshes` to learn how to create and apply navigation meshes.
ga: Chun réigiún nascleanúna a chruthú ag baint úsáide as an gcrann radhairc cuir nód ``NavigationRegion2D`` nó ``NavigationRegion3d`` leis an radharc. Éilíonn gach réigiún acmhainn mogalra nascleanúna chun feidhmiú. Féach:ref: `doc_navigation_using_navigationmeshes` chun foghlaim conas mogalra nascleanúna a chruthú agus a chur i bhfeidhm.
ru: Чтобы создать навигационную область с помощью дерева сцены, добавьте к сцене узел ``NavigationRegion2D`` или ``NavigationRegion3D``. Для работы всех областей требуется ресурс навигационной сетки. Чтобы узнать, как создавать и применять навигационные сетки, см. :ref:`doc_navigation_using_navigationmeshes`.
ta: காட்சி மரத்தைப் பயன்படுத்தி ஒரு வழிசெலுத்தல் பகுதியை உருவாக்க, காட்சிக்கு ஒரு `` வழிசெலுத்தல் பிரேரியோன் 2 டி`` அல்லது `` வழிசெலுத்தல் பிரேகோன் 3 டி`` முனை சேர்க்கவும். அனைத்து பிராந்தியங்களுக்கும் செயல்பட வழிசெலுத்தல் கண்ணி வளம் தேவைப்படுகிறது. காண்க: குறிப்பு: வழிசெலுத்தல் மெச்களை எவ்வாறு உருவாக்குவது மற்றும் பயன்படுத்துவது என்பதை அறிய `doc_navigation_using_navigationmeshes`.
uk: Щоб створити область навігації за допомогою дерева сцени, додайте до сцени вузол ``NavigationRegion2D`` або ``NavigationRegion3D``. Для функціонування всіх регіонів потрібен ресурс навігаційної сітки. Перегляньте :ref:`doc_navigation_using_navigationmeshes`, щоб дізнатися, як створювати та застосовувати навігаційні сітки.
zh_hans: 要使用场景树创建导航区块，请在场景中添加一个 ``NavigationRegion2D`` 或 ``NavigationRegion3D`` 节点。所有区块都需要导航网格资源才能正常工作。导航网格的创建和应用见 :ref:`doc_navigation_using_navigationmeshes`\ 。
zh_hant: 若要透過場景樹建立導航區域，請在場景中新增 ``NavigationRegion2D`` 或 ``NavigationRegion3D`` 節點。所有區域都需配置導航網格資源才能運作。詳見 :ref:`doc_navigation_using_navigationmeshes` 以瞭解如何建立與套用導航網格。

source: NavigationRegions will automatically push ``global_transform`` changes to the region on the NavigationServer which makes them suitable for moving platforms. The NavigationServer will attempt to connect the navigation meshes of individual regions when they are close enough. For more details see :ref:`doc_navigation_connecting_navmesh`. To connect NavigationRegions over arbitrary distances see :ref:`doc_navigation_using_navigationlinks` to learn how to create and use ``NavigationLinks``.
ga: Brúidh NavigationRegions athruithe ``global_transform`` go huathoibríoch ar an réigiún ar an NavigationServer rud a fhágann go bhfuil siad oiriúnach d'ardáin bhogadh. Déanfaidh an NavigationServer iarracht mogalra nascleanúna réigiúin aonair a nascadh nuair a bheidh siad gar go leor. Le haghaidh tuilleadh sonraí féach:ref: `doc_navigation_connecting_navmesh`. Chun NavigationRegions a nascadh thar achair treallach féach: ref: `doc_navigation_using_navigationlinks` chun foghlaim conas ``Navigationlinks`` a chruthú agus a úsáid.
ru: NavigationRegions автоматически передают изменения ``global_transform`` в регион на NavigationServer, что делает их пригодными для использования на движущихся платформах. NavigationServer попытается соединить навигационные сетки отдельных регионов, когда они находятся достаточно близко. Подробнее см. :ref:`doc_navigation_connecting_navmesh`. Чтобы узнать, как соединить NavigationRegions на произвольных расстояниях, см. :ref:`doc_navigation_using_navigationlinks`, чтобы узнать, как создавать и использовать ``NavigationLinks``.
ta: வழிசெலுத்தல் பிராந்தியங்கள் தானாகவே `` குளோபல்_ டிரான்ச்ஃபார்ம்`` `` `` பிராந்தியத்தில் உள்ள மாற்றங்களை மாற்றும், இது தளங்களை நகர்த்துவதற்கு ஏற்றதாக இருக்கும். தனிப்பட்ட பகுதிகளின் வழிசெலுத்தல் மெச்களை போதுமான அளவு நெருங்கி வரும்போது அவை ஊடுருவல் முயற்சிக்கும். மேலும் விவரங்களுக்கு காண்க: ref: `doc_navigation_connection_navmesh`. தன்னிச்சையான தூரங்களுக்கு வழிசெலுத்தல் பிராந்தியங்களை இணைக்க: குறிப்பு: `` NavigationLinks``` ஐ எவ்வாறு உருவாக்குவது மற்றும் பயன்படுத்துவது என்பதை அறிய `doc_navigation_using_navigationlinks`.
uk: NavigationRegions автоматично надсилає зміни ``global_transform`` до регіону на NavigationServer, що робить їх придатними для переміщення платформ. NavigationServer спробує підключити навігаційні сітки окремих регіонів, коли вони будуть достатньо близько. Для отримання додаткової інформації див. :ref:`doc_navigation_connecting_navmesh`. Щоб з’єднати NavigationRegions на довільній відстані, перегляньте :ref:`doc_navigation_using_navigationlinks`, щоб дізнатися, як створити та використовувати ``NavigationLinks``.
zh_hans: NavigationRegion 会自动将 ``global_transform`` 的变化推送到导航服务器上的对应区块，因此可用于移动的平台。当各个区块的导航网格足够接近时，NavigationServer 就会尝试将它们连接起来，详见 :ref:`doc_navigation_connecting_navmesh`\ 。NavigationLink 可以连接任意距离的 NavigationRegion，如何创建和使用见 :ref:`doc_navigation_using_navigationlinks`\ 。
zh_hant: NavigationRegion 會自動將 ``global_transform`` 變更推送到 NavigationServer 上的區域，因此很適合用於移動平台。當各區域相距夠近時，NavigationServer 會嘗試連接這些區域的導航網格。詳情請參考 :ref:`doc_navigation_connecting_navmesh`。若需跨任意距離連接 NavigationRegion，請參考 :ref:`doc_navigation_using_navigationlinks` 以瞭解如何建立與使用 ``NavigationLinks``。

source: While changing the transform of a NavigationRegion node does update the region position on the NavigationServer, changing the scale does not. A navigation mesh resource has no scale and needs to be fully updated when source geometry changes scale.
ga: Cé go n-athraítear athrú nód NavigationRegion, nuashonraítear suíomh an réigiúin ar an NavigationServer, ní athraítear an scála. Níl aon scála ag acmhainn mogalra loingseoireachta agus ní mór é a nuashonrú go hiomlán nuair a athraíonn céimseata foinse an scála.
ru: Изменение преобразования узла NavigationRegion приводит к изменению положения региона на NavigationServer, но изменение масштаба — нет. Ресурс навигационной сетки не имеет масштаба и должен быть полностью обновлен при изменении масштаба исходной геометрии.
ta: ஒரு வழிசெலுத்தல் பிராந்திய முனையின் உருமாற்றத்தை மாற்றுவது ஊடுருவல்களில் பிராந்திய நிலையை புதுப்பிக்கும் அதே வேளையில், அளவை மாற்றுவது இல்லை. ஒரு வழிசெலுத்தல் கண்ணி வளத்திற்கு எந்த அளவையும் இல்லை மற்றும் மூல வடிவியல் அளவை மாற்றும்போது முழுமையாக புதுப்பிக்கப்பட வேண்டும்.
uk: Хоча зміна перетворення вузла NavigationRegion оновлює позицію області на NavigationServer, зміна масштабу – ні. Ресурс навігаційної сітки не має масштабу і потребує повного оновлення, коли геометрія джерела змінює масштаб.
zh_hans: 虽然修改 NavigationRegion 节点的变换能够更新 NavigationServer 中对应区块的位置，但是修改缩放却不会。导航网格资源不具备缩放，所以来源几何体的缩放发生改变时需要进行完整的更新。
zh_hant: 雖然更動 NavigationRegion 節點的變換會更新 NavigationServer 上區域的位置，但縮放不會。導航網格資源本身不具備縮放屬性，當來源幾何體縮放時，必須完整重新產生網格。

source: Regions can be enabled / disabled and if disabled will not contribute to future pathfinding queries.
ga: Is féidir réigiúin a chumasú / a dhíchumasú agus mura bhfuil siad faoi mhíchumas ní chuirfidh siad le fiosruithe braite amach anseo.
ru: Регионы можно включать и отключать. В случае отключения они не будут участвовать в будущих запросах поиска пути.
ta: பகுதிகளை இயக்கலாம் / முடக்கலாம் மற்றும் முடக்கப்பட்டால் எதிர்கால பாத்ஃபைண்டிங் வினவல்களுக்கு பங்களிக்காது.
uk: Регіони можна ввімкнути або вимкнути, і якщо вимкнено, вони не сприятимуть майбутнім запитам пошуку шляху.
zh_hans: 区块可以启用/禁用，如果禁用，则不会参与寻路查询。
zh_hant: 導航區域可以啟用或停用。被停用的區域將不會參與後續的路徑尋找查詢。

source: Existing paths will not be automatically updated when a region gets enabled / disabled.
ga: Ní dhéanfar na cosáin atá ann cheana a nuashonrú go huathoibríoch nuair a bheidh réigiún cumasaithe / díchumasaithe.
ru: Существующие пути не будут автоматически обновляться при включении/отключении региона.
ta: ஒரு பகுதி இயக்கப்பட்ட / முடக்கப்பட்டால் இருக்கும் பாதைகள் தானாகவே புதுப்பிக்கப்படாது.
uk: Існуючі шляхи не оновлюватимуться автоматично, коли регіон увімкнено/вимкнено.
zh_hans: 启用/禁用区块时，现有路径不会自动更新。
zh_hant: 當區域被啟用或停用時，現有的路徑不會自動更新。

source: Creating new navigation regions
ga: Réigiúin nua loingseoireachta a
ru: Создание новых навигационных регионов
ta: புதிய வழிசெலுத்தல் பகுதிகளை உருவாக்குதல்
uk: Створення нових областей навігації
zh_hans: 新建导航区块
zh_hant: 建立新導航區域

source: New NavigationRegion nodes will automatically register to the default world navigation map for their 2D/3D dimension.
ga: Cláróidh nóid nua NavigationRegion go huathoibríoch chuig an léarscáil nascleanúna réamhshocraithe domhanda dá ngné 2D/3D.
ru: Новые узлы NavigationRegion будут автоматически регистрироваться на навигационной карте мира по умолчанию для их 2D/3D-измерения.
ta: புதிய வழிசெலுத்தல் பிராந்திய முனைகள் அவற்றின் 2 டி/3 டி பரிமாணத்திற்காக இயல்புநிலை உலக வழிசெலுத்தல் வரைபடத்தில் தானாகவே பதிவு செய்யும்.
uk: Нові вузли NavigationRegion автоматично зареєструються на навігаційній карті світу за замовчуванням для своїх 2D/3D вимірів.
zh_hans: 新的导航区块节点会在2D/3D 尺寸的默认世界导航地图上自动注册。
zh_hant: 新增的 NavigationRegion 節點會自動註冊到其 2D 或 3D 維度的預設世界導航地圖。

source: The region RID can then be obtained from NavigationRegion Nodes with ``get_rid()``.
ga: Is féidir RID an réigiún a fháil ansin ó NavigationRegion Nodes le ``get_rid () ``.
ru: Затем RID региона можно получить из узлов NavigationRegion с помощью ``get_rid()``.
ta: பிராந்தியத்தை RID பின்னர் வழிசெலுத்தல் பிராந்திய முனைகளிலிருந்து `` get_rid () `` உடன் பெறலாம்.
uk: Потім RID регіону можна отримати з вузлів NavigationRegion за допомогою ``get_rid()``.
zh_hans: 然后就可以通过 NavigationRegion 节点的 ``get_rid()`` 获取区块 RID。
zh_hant: 可以透過 NavigationRegion 節點的 ``get_rid()`` 取得區域的 RID。

source: New regions can also be created with the NavigationServer API and added to any existing map.
ga: Is féidir réigiúin nua a chruthú freisin leis an API NavigationServer agus iad a chur le haon léarscáil atá ann cheana.
ru: Новые регионы также можно создавать с помощью API NavigationServer и добавлять на любую существующую карту.
ta: புதிய பிராந்தியங்களை Assigationerver பநிஇ உடன் உருவாக்கலாம் மற்றும் தற்போதுள்ள எந்த வரைபடத்திலும் சேர்க்கலாம்.
uk: Нові регіони також можна створювати за допомогою NavigationServer API і додавати до будь-якої наявної карти.
zh_hans: 还可以使用导航服务器接口创建新区块，并将其添加到任何现有地图中。
zh_hant: 也可用 NavigationServer API 直接建立新區域，並新增到任一現有地圖。

source: If regions are created with the NavigationServer API directly they need to be assigned a navigation map manually.
ga: Má chruthaítear réigiúin leis an API NavigationServer go díreach caithfear léarscáil nascleanúna a shannadh de láimh dóibh.
ru: Если регионы создаются напрямую с помощью API NavigationServer, им необходимо вручную назначить навигационную карту.
ta: பிராந்தியங்கள் நேரடியான பநிஇ உடன் நேரடியாக உருவாக்கப்பட்டால், அவர்களுக்கு வழிசெலுத்தல் வரைபடத்தை கைமுறையாக ஒதுக்க வேண்டும்.
uk: Якщо регіони створюються безпосередньо за допомогою NavigationServer API, їм потрібно призначити навігаційну карту вручну.
zh_hans: 如果直接使用导航服务器接口创建区块，则需要手动为其分配导航地图。
zh_hant: 如果直接用 NavigationServer API 建立區域，需要手動指定導航地圖。

source: Navigation regions can only be assigned to a single navigation map. If an existing region is assigned to a new navigation map it will leave the old map.
ga: Ní féidir réigiúin nascleanúna a shannadh ach do léarscáil nascleanúna amháin. Má shanntar réigiún atá ann cheana do léarscáil nascleanúna nua fágfaidh sé an seanléarscáil.
ru: Регионы навигации можно назначить только одной навигационной карте. При назначении существующего региона новой навигационной карте он покинет старую карту.
ta: வழிசெலுத்தல் பகுதிகளை ஒரு வழிசெலுத்தல் வரைபடத்திற்கு மட்டுமே ஒதுக்க முடியும். ஏற்கனவே உள்ள பகுதி புதிய வழிசெலுத்தல் வரைபடத்திற்கு ஒதுக்கப்பட்டால், அது பழைய வரைபடத்தை விட்டு வெளியேறும்.
uk: Області навігації можна призначити лише одній навігаційній карті. Якщо існуючий регіон буде призначено для нової навігаційної карти, він залишить стару карту.
zh_hans: 导航区块只能分配给一个导航地图。如果将现有区块分配到新的导航地图，它就不属于旧地图了。
zh_hant: 導航區域只能分配給一個導航地圖。如果將已存在的區域指派到新地圖，該區域會自動離開舊地圖。
