Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationpaths.po
Languages: ga, ru, ta, uk, zh_cn, zh_hant

source: Using NavigationPaths
ga: Ag baint úsáide as NavigationPaths
ru: Использование NavigationPaths
ta: வழிசெலுத்தல் பாதைகளைப் பயன்படுத்துதல்
uk: Використання NavigationPaths
zh_cn: 使用 NavigationPath
zh_hant: 使用 NavigationPaths

source: Obtaining a NavigationPath
ga: Cosán Nascleanúna a Fháil
ru: Получение NavigationPath
ta: ஒரு வழிசெலுத்தல் பாதையைப் பெறுதல்
uk: Отримання NavigationPath
zh_cn: 获取 NavigationPath
zh_hant: 取得導覽路徑

source: Navigation paths can be directly queried from the NavigationServer and do not require any additional nodes or objects as long as the navigation map has a navigation mesh to work with.
ga: Is féidir cosáin nascleanúna a cheistiú go díreach ón NavigationServer agus ní theastaíonn aon nóid nó rudaí breise uathu fad is atá mogalra nascleanúna ag an léarscáil nascleanúna chun oibriú leis.
ru: Навигационные пути можно напрямую запрашивать из NavigationServer, для этого не требуются никакие дополнительные узлы или объекты, если на навигационной карте имеется навигационная сетка для работы.
ta: வழிசெலுத்தல் பாதைகள் ஊடுருவலிலிருந்து நேரடியாக வினவப்படலாம் மற்றும் வழிசெலுத்தல் வரைபடத்தில் பணிபுரிய வழிசெலுத்தல் கண்ணி இருக்கும் வரை கூடுதல் முனைகள் அல்லது பொருள்கள் தேவையில்லை.
uk: Шляхи навігації можна запитувати безпосередньо з NavigationServer і не потребують додаткових вузлів чи об’єктів, якщо навігаційна карта має навігаційну сітку для роботи.
zh_cn: 导航路径可以直接从NavigationServer查询，并且不需要任何其他节点或对象，只要导航地图具有可使用的导航网格即可。
zh_hant: 只要導覽地圖已有可用的導覽網格，導覽路徑就能直接從 NavigationServer 查詢，不需額外新增任何節點或物件。

source: To obtain a 2D path, use ``NavigationServer2D.map_get_path(map, from, to, optimize, navigation_layers)``.
ga: Chun cosán 2T a fháil, bain úsáid as ''NavigationServer2D.map_get_path(map, from, to, optimize, navigation_layers)''.
ru: Чтобы получить 2D-путь, используйте ``NavigationServer2D.map_get_path(map, from, to, optimize, navigation_layers)``.
ta: 2 டி பாதையைப் பெற, `` Asseligationserver2d.map_get_path (வரைபடம், இருந்து, மேம்படுத்த, வழிசெலுத்தல்_லேயர்கள்) `` ஐப் பயன்படுத்தவும்.
uk: Щоб отримати двовимірний шлях, використовуйте ``NavigationServer2D.map_get_path(map, from, to, optimize, navigation_layers)``.
zh_cn: 要获取 2D 路径，请使用 ``NavigationServer2D.map_get_path(地图, 起点, 终点, 优化, 导航层)``\ 。
zh_hant: 若要取得 2D 路徑，請使用 ``NavigationServer2D.map_get_path(map, from, to, optimize, navigation_layers)``。

source: To obtain a 3D path, use ``NavigationServer3D.map_get_path(map, from, to, optimize, navigation_layers)``.
ga: Chun cosán 3D a fháil, bain úsáid as ''NavigationServer3D.map_get_path(map, from, to, optimize, navigation_layers)''.
ru: Чтобы получить 3D-путь, используйте ``NavigationServer3D.map_get_path(map, from, to, optimize, navigation_layers)``.
ta: ஒரு 3D பாதையைப் பெற, `` Asseligationserver3d.map_get_path (வரைபடம், இருந்து, மேம்படுத்த, வழிசெலுத்தல்_லேயர்கள்) `` ஐப் பயன்படுத்தவும்.
uk: Щоб отримати тривимірний шлях, використовуйте ``NavigationServer3D.map_get_path(map, from, to, optimize, navigation_layers)``.
zh_cn: 要获取 3D 路径，请使用 ``NavigationServer3D.map_get_path(地图, 起点, 终点, 优化, 导航层)``\ 。
zh_hant: 若要取得 3D 路徑，請使用 ``NavigationServer3D.map_get_path(map, from, to, optimize, navigation_layers)``。

source: For more customizable navigation path queries that require additional setup see :ref:`doc_navigation_using_navigationpathqueryobjects`.
ga: Le haghaidh ceisteanna cosán nascleanúna níos customizable a éilíonn thus breise féach :ref:'doc_navigation_using_navigationpathqueryobjects'.
ru: Для получения дополнительных настраиваемых запросов пути навигации, требующих дополнительной настройки, см. :ref:`doc_navigation_using_navigationpathqueryobjects`.
ta: கூடுதல் அமைப்பு தேவைப்படும் தனிப்பயனாக்கக்கூடிய வழிசெலுத்தல் பாதை வினவல்களுக்கு: குறிப்பு: `doc_navigation_using_navigationpathqueryObjects`.
uk: Більше настроюваних запитів шляху навігації, які потребують додаткового налаштування, див. :ref:`doc_navigation_using_navigationpathqueryobjects`.
zh_cn: 有关需要额外设定的更多可自定义导览路径查询，请参阅 :ref:`doc_navigation_using_navigationpathqueryobjects`\ 。
zh_hant: 如需進行更多自訂化，並需額外設定的導覽路徑查詢，請參考 :ref:`doc_navigation_using_navigationpathqueryobjects`。

source: One of the required parameters for the query is the RID of the navigation map. Each game world has a default navigation map automatically created. The default navigation maps can be retrieved with ``get_world_2d().get_navigation_map()`` from any Node2D inheriting node or ``get_world_3d().get_navigation_map()`` from any Node3D inheriting node. The second and third parameters are the starting position and the target position as Vector2 for 2D or Vector3 for 3D.
ga: Ceann de na paraiméadair riachtanacha don cheist is ea RID na léarscáile loingseoireachta. Tá léarscáil réamhshocraithe nascleanúna cruthaithe go huathoibríoch ag gach domhan cluiche. Is féidir na léarscáileanna réamhshocraithe nascleanúna a aisghabháil le ``get_world_2d().get_navigation_map()`` ó aon nód oidhreachta Node2D nó ``get_world_3d().get_navigation_map()`` ó aon nód oidhreachta Node3D. Is é an dara agus an tríú paraiméadair an suíomh tosaigh agus an suíomh sprice mar Vector2 le haghaidh 2D nó Vector3 le haghaidh 3D.
ru: Одним из обязательных параметров запроса является RID навигационной карты. Для каждого игрового мира автоматически создается навигационная карта по умолчанию. Навигационные карты по умолчанию можно получить с помощью метода ``get_world_2d().get_navigation_map()`` из любого наследуемого узла Node2D или ``get_world_3d().get_navigation_map()`` из любого наследуемого узла Node3D. Второй и третий параметры — начальная и конечная позиции, например Vector2 для 2D или Vector3 для 3D.
ta: வினவலுக்கு தேவையான அளவுருக்களில் ஒன்று வழிசெலுத்தல் வரைபடத்தை அகற்றுவதாகும். ஒவ்வொரு விளையாட்டு உலகிலும் இயல்புநிலை வழிசெலுத்தல் வரைபடம் தானாக உருவாக்கப்பட்டுள்ளது. இயல்புநிலை வழிசெலுத்தல் வரைபடங்களை `` get_world_2d () மூலம் மீட்டெடுக்க முடியும். இரண்டாவது மற்றும் மூன்றாவது அளவுருக்கள் தொடக்க நிலை மற்றும் இலக்கு நிலை 2D க்கு வெக்டர் 2 அல்லது 3D க்கு வெக்டர் 3.
uk: Одним із обов’язкових параметрів для запиту є RID навігаційної карти. Для кожного ігрового світу автоматично створюється стандартна навігаційна карта. Стандартні навігаційні карти можна отримати за допомогою ``get_world_2d().get_navigation_map()`` з будь-якого вузла-спадкоємця Node2D або ``get_world_3d().get_navigation_map()`` з будь-якого вузла-спадкоємця Node3D. Другий і третій параметри – це початкова позиція та цільова позиція як Vector2 для 2D або Vector3 для 3D.
zh_cn: 查询所需的参数之一是导航地图的RID。每个游戏世界都有一个自动创建的默认导航地图。默认导航地图可以使用 ``get_world_2d().get_navigation_map()`` 从任何Node2D继承节点检索，也可以使用 ``get_world_3d().get_navigation_map()`` 从任意Node3D继承节点检索。第二和第三参数是起始位置和目标位置，作为2D的Vector2或3D的Vector3。
zh_hant: 查詢時需提供導覽地圖的 RID。每個遊戲世界都會自動建立一個預設導覽地圖。在任何繼承自 Node2D 的節點上，可使用 ``get_world_2d().get_navigation_map()`` 取得 2D 導覽地圖；在任何繼承自 Node3D 的節點上，則可用 ``get_world_3d().get_navigation_map()`` 取得 3D 導覽地圖。第二與第三個參數分別為起點與目標位置，2D 使用 Vector2，3D 則為 Vector3。

source: If the ``optimized`` parameter is ``true``, path positions will be shortened along polygon corners with an additional funnel algorithm pass. This works well for free movement on navigation meshes with unequally sized polygons as the path will hug around corners along the polygon corridor found by the A* algorithm. With small cells the A* algorithm creates a very narrow funnel corridor that can create ugly corner paths when used with grids.
ga: Má tá an paraiméadar ''optamaithe'' ''fíor'', déanfar suíomhanna cosáin a ghiorrú feadh coirnéil polagáin le pas algartam tonnadóir breise. Oibríonn sé seo go maith le haghaidh saorghluaiseachta ar mhogaill loingseoireachta le polagáin neamhmhéide mar go dtabharfaidh an cosán barróg timpeall coirnéil feadh chonair an pholagáin a d'aimsigh algartam A*. Le cealla beaga cruthaíonn an algartam A * conair tonnadóir an-chúng ar féidir leis cosáin chúinne ghránna a chruthú nuair a úsáidtear é le greillí.
ru: Если параметр ``optimized`` равен ``true``, положение траектории вдоль углов полигонов будет сокращено за счёт дополнительного прохода алгоритма воронки. Это хорошо подходит для свободного перемещения по навигационным сеткам с полигонами разного размера, поскольку траектория будет огибать углы вдоль коридора полигонов, найденного алгоритмом A*. С малыми ячейками алгоритм A* создаёт очень узкий коридор воронки, который может создавать некрасивые угловые пути при использовании с сетками.
ta: `` உகந்த`` அளவுரு `` உண்மை`` என்றால், கூடுதல் புனல் அல்காரிதம் பாசுடன் பலகோண மூலைகளில் பாதை நிலைகள் சுருக்கப்படும். ஏ* அல்காரிதத்தால் காணப்படும் பலகோண தாழ்வாரத்தில் மூலைகளைச் சுற்றி பாதை கட்டிப்பிடிக்கும் என்பதால், சமமற்ற அளவிலான பலகோணங்களைக் கொண்ட வழிசெலுத்தல் மெச்களில் இலவச இயக்கத்திற்கு இது நன்றாக வேலை செய்கிறது. சிறிய கலங்களுடன் A* வழிமுறை மிகவும் குறுகிய புனல் தாழ்வாரத்தை உருவாக்குகிறது, இது கட்டங்களுடன் பயன்படுத்தும்போது அசிங்கமான மூலையில் பாதைகளை உருவாக்க முடியும்.
uk: Якщо параметр ``optimized`` має значення ``true``, позиції шляху будуть скорочені вздовж кутів багатокутників за допомогою додаткового проходу алгоритму воронки. Це добре працює для вільного переміщення по навігаційній сітці з багатокутниками різного розміру, оскільки шлях буде обіймати кути вздовж коридору багатокутника, знайденого алгоритмом A*. З маленькими клітинками алгоритм A* створює дуже вузький коридор воронки, який може створювати потворні кутові шляхи при використанні з сітками.
zh_cn: 如果 ``optimized`` 参数为 ``true``\ ，则会额外做一遍漏斗算法，将路径点沿着多边形的角落缩短。这种处理适用于在多边形大小不一致的导航网格上自由移动的情况，因为路径会沿着 A* 算法找到的多边形走廊绕过拐角。如果单元格较小，A* 算法就会创建出非常狭窄的漏斗形走廊，使用栅格时，路径的拐角处就会很难看。
zh_hant: 若 ``optimized`` 參數為 ``true``，則會額外經過漏斗演算法處理，使路徑點順著多邊形角落縮短。這對於多邊形大小不一的導覽網格，且需自由移動時效果良好，因為路徑會沿著 A* 演算法找到的多邊形通道貼近轉角。但若格網很小時，A* 可能產生非常狹窄的漏斗型通道，會導致在格狀網格上出現不自然的轉角路徑。

source: If the ``optimized`` parameter is ``false``, path positions will be placed at the center of each polygon edge. This works well for pure grid movement on navigation meshes with equally sized polygons as the path will go through the center of the grid cells. Outside of grids due to polygons often covering large open areas with a single, long edge this can create paths with unnecessary long detours.
ga: Má tá an paraiméadar ''optamaithe'' ''bréagach'', cuirfear suíomhanna cosáin i lár gach imeall polagáin. Oibríonn sé seo go maith le haghaidh gluaiseacht greille íon ar mhogaill loingseoireachta le polagáin chomh meánmhéide agus a rachaidh an cosán trí lár na gceall greille. Lasmuigh de ghreillí mar gheall ar pholagáin a chlúdaíonn limistéir mhóra oscailte go minic le ciumhais fhada amháin is féidir leis seo cosáin a chruthú le detours fada gan ghá.
ru: Если параметр ``optimized`` равен ``false``, пути будут располагаться по центру каждого ребра полигона. Это хорошо подходит для движения по сетке в навигационных сетках с полигонами одинакового размера, поскольку путь будет проходить через центр ячеек сетки. За пределами сеток, поскольку полигоны часто покрывают большие открытые области одним длинным ребром, это может привести к появлению путей с ненужными длинными объездами.
ta: `` உகந்த`` அளவுரு `` தவறு`` என்றால், ஒவ்வொரு பலகோண விளிம்பின் மையத்திலும் பாதை நிலைகள் வைக்கப்படும். கட்டம் உயிரணுக்களின் மையத்தின் வழியாக பாதை செல்லும் என்பதால், சமமான அளவிலான பலகோணங்களைக் கொண்ட வழிசெலுத்தல் மெச்களில் தூய கட்டம் இயக்கத்திற்கு இது நன்றாக வேலை செய்கிறது. பலகோணங்கள் காரணமாக கட்டங்களுக்கு வெளியே பெரும்பாலும் பெரிய திறந்த பகுதிகளை ஒற்றை, நீண்ட விளிம்பில் உள்ளடக்கியது, இது தேவையற்ற நீண்ட மாற்றுப்பாதைகளுடன் பாதைகளை உருவாக்க முடியும்.
uk: Якщо параметр ``optimized`` має значення ``false``, позиції шляху будуть розміщені в центрі кожного краю багатокутника. Це добре працює для чистого руху сітки на навігаційних сітках з багатокутниками однакового розміру, оскільки шлях проходитиме через центр комірок сітки. За межами сітки через багатокутники, які часто охоплюють великі відкриті території з одним довгим краєм, це може створити шляхи з непотрібними довгими об’їздами.
zh_cn: 如果 ``optimized`` 参数为 ``false`` ，则路径位置将放置在每个多边形边缘的中心。这适用于具有相同大小多边形的导航网格上的纯网格移动，因为路径将穿过网格单元的中心。在网格之外，由于多边形通常用一条长边覆盖大的开放区域，这可能会产生不必要的长迂回路径。
zh_hant: 若 ``optimized`` 參數為 ``false``，路徑點則會落在每個多邊形邊的中心。這適合用於多邊形大小一致、以格子移動為主的導覽網格，因為路徑會穿越格子中心。若在非格子狀網格上，因多邊形常以單一長邊覆蓋大片開放區域，路徑可能會出現不必要的冗長繞路。

source: A returned ``path`` by the NavigationServer will be a ``PackedVector2Array`` for 2D or a ``PackedVector3Array`` for 3D. These are just a memory-optimized ``Array`` of vector positions. All position vectors inside the array are guaranteed to be inside a NavigationPolygon or NavigationMesh. The path array, if not empty, has the navigation mesh position closest to the starting position at the first index ``path[0]`` position. The closest available navigation mesh position to the target position is the last index ``path[path.size()-1]`` position. All indexes between are the path points that an actor should follow to reach the target without leaving the navigation mesh.
ga: Beidh ''path'' ar ais ag an NavigationServer ina ''PackedVector2Array'' le haghaidh 2D nó ''PackedVector3Array'' le haghaidh 3D. Níl iontu seo ach ''Array'' optamaithe cuimhne de shuíomhanna veicteora. Ráthaítear go mbeidh gach veicteoir suímh taobh istigh den eagar taobh istigh de NavigationPolygon nó NavigationMesh. Tá suíomh an mhogaill nascleanúna is gaire don suíomh tosaigh ag an eagar cosáin, mura bhfuil sé folamh, ag suíomh an chéad innéacs ''path[0]''. Is é an suíomh mogalra nascleanúna is gaire atá ar fáil don spriocshuíomh ná suíomh an innéacs deiridh ''path[path.size()-1]''. Is iad na hinnéacsanna go léir idir na pointí cosáin ba chóir d'aisteoir a leanúint chun an sprioc a bhaint amach gan an mogalra nascleanúna a fhágáil.
ru: Возвращаемый NavigationServer ``path`` будет ``PackedVector2Array`` для 2D или ``PackedVector3Array`` для 3D. Это всего лишь оптимизированный для памяти ``Array`` векторных позиций. Все векторы позиций внутри массива гарантированно находятся внутри NavigationPolygon или NavigationMesh. Массив путей, если он не пустой, содержит позицию навигационной сетки, ближайшую к начальной, в позиции с первым индексом ``path[0]``. Ближайшая доступная позиция навигационной сетки к целевой позиции — это позиция с последним индексом ``path[path.size()-1]``. Все индексы между ними — это точки пути, по которым должен следовать актёр, чтобы достичь цели, не выходя за пределы навигационной сетки.
ta: ஊடுருவலால் திரும்பிய `` பாதை`` 2D க்கு `` பேக் டெக்டர் 2 ஏர்`` அல்லது 3D க்கு `` பேக் டெக்டர் 3 அர்ரே`` இருக்கும். இவை திசையன் நிலைகளின் நினைவகம்-உகந்த `` வரிசை`` ஆகும். வரிசைக்குள் இருக்கும் அனைத்து நிலை திசையன்களும் ஒரு நேவிகேசன் பாலிகான் அல்லது நேவிகேசன்மேசுக்குள் இருக்கும் என்று பொறுப்பு அளிக்கப்படுகிறது. பாதை வரிசை, காலியாக இல்லாவிட்டால், முதல் குறியீட்டில் `` பாதை [0] `` நிலை ஆகியவற்றில் தொடக்க நிலைக்கு மிக நெருக்கமான வழிசெலுத்தல் கண்ணி நிலையை கொண்டுள்ளது. இலக்கு நிலைக்கு மிக நெருக்கமாக கிடைக்கக்கூடிய வழிசெலுத்தல் கண்ணி நிலை கடைசி குறியீடு `` பாதை [பாதை.சைச் ()-1] `` நிலை. வழிசெலுத்தல் கண்ணி வெளியேறாமல் இலக்கை அடைய ஒரு நடிகர் பின்பற்ற வேண்டிய பாதை புள்ளிகள் இடையேயான அனைத்து குறியீடுகளும்.
uk: Повернений ``шлях`` NavigationServer буде ``PackedVector2Array`` для 2D або ``PackedVector3Array`` для 3D. Це лише оптимізований для пам’яті ``Масив`` векторних позицій. Гарантовано, що всі вектори позиції всередині масиву знаходяться в NavigationPolygon або NavigationMesh. Масив шляхів, якщо він не порожній, має позицію навігаційної сітки, найближчу до початкової позиції в позиції першого індексу ``path[0]``. Найближча доступна позиція навігаційної сітки до цільової позиції – це позиція останнього індексу ``path[path.size()-1]``. Усі індекси між ними є точками шляху, якими актор має слідувати, щоб досягти мети, не виходячи з навігаційної сітки.
zh_cn: NavigationServer返回的 ``path`` 将是2D的 ``PackedVector2Array`` 或3D的 ``PackedVector3Array``\ 。这些只是一个经过内存优化的矢量位置 ``Array``\ 。阵列内的所有位置矢量都保证位于NavigationPolygon或NavigationMesh内。如果路径数组不是空的，则其导航网格位置最靠近第一个索引 ``path[0]`` 位置处的起始位置。离目标位置最近的可用导航网格位置是最后一个索引 ``path[path.size()-1]`` 位置。之间的所有索引都是参与者在不离开导航网格的情况下到达目标所应遵循的路径点。
zh_hant: NavigationServer 回傳的 ``path`` 會是 2D 的 ``PackedVector2Array`` 或 3D 的 ``PackedVector3Array``，皆為記憶體優化的向量陣列。陣列中所有位置向量都保證位於 NavigationPolygon 或 NavigationMesh 內。若路徑陣列非空，第一個索引 ``path[0]`` 會是離起點最近的網格位置，最後一個索引 ``path[path.size()-1]`` 則為距目標最近的可用網格位置。中間的索引則是角色在不離開導覽網格情況下，應依序通過的路徑點。

source: If the target position is on a different navigation mesh that is not merged or connected the navigation path will lead to the closest possible position on the starting position navigation mesh.
ga: Má tá an spriocshuíomh ar mhogall nascleanúna difriúil nach bhfuil cumaiscthe nó nasctha, beidh an suíomh is gaire is féidir ar an mogalra nascleanúna suímh tosaigh mar thoradh air.
ru: Если целевая позиция находится на другой навигационной сетке, которая не объединена и не подключена, то навигационный путь приведет к ближайшей возможной позиции на навигационной сетке начальной позиции.
ta: இலக்கு நிலை வேறு வழிசெலுத்தல் கண்ணி மீது ஒன்றிணைக்கப்படவில்லை அல்லது இணைக்கப்படாத வழிசெலுத்தல் பாதை தொடக்க நிலை வழிசெலுத்தல் கண்ணி மீது மிக நெருக்கமான நிலைக்கு வழிவகுக்கும்.
uk: Якщо цільова позиція знаходиться в іншій навігаційній сітці, яка не об’єднана або не з’єднана, шлях навігації приведе до найближчої можливої позиції на навігаційній сітці початкової позиції.
zh_cn: 如果目标位置位于未合并或连接的不同导览网格上，则导览路径将通往起始位置导览网格上最接近的可能位置。
zh_hant: 若目標位置位於未合併或未連接的不同導覽網格，則導覽路徑會引導到起點所屬網格中，距離目標位置最近的可達點。

source: The following script moves a Node3D inheriting node along a navigation path using the default navigation map by setting the target position with ``set_movement_target()``.
ga: Bogann an script seo a leanas nód oidhreachta Node3D feadh cosán nascleanúna ag baint úsáide as an léarscáil nascleanúna réamhshocraithe tríd an spriocshuíomh a shocrú le ''set_movement_target()''.
ru: Следующий скрипт перемещает наследующий узел Node3D по навигационному пути, используя навигационную карту по умолчанию, задавая целевую позицию с помощью ``set_movement_target()``.
ta: பின்வரும் ச்கிரிப்ட் `` set_movement_target () `` உடன் இலக்கு நிலையை அமைப்பதன் மூலம் இயல்புநிலை வழிசெலுத்தல் வரைபடத்தைப் பயன்படுத்தி வழிசெலுத்தல் பாதையில் ஒரு Node3D மரபுரிமை முனையை நகர்த்துகிறது.
uk: Наступний сценарій переміщує вузол-спадкоємець Node3D уздовж навігаційного шляху, використовуючи навігаційну карту за замовчуванням, встановлюючи цільову позицію за допомогою ``set_movement_target()``.
zh_cn: 以下脚本透过使用 ``set_movement_target()`` 设定目标位置，使用预设导览地图沿着导览路径移动Node3D继承节点。
zh_hant: 以下程式碼範例說明如何在 Node3D 繼承節點中，透過 ``set_movement_target()`` 設定目標位置，並利用預設導覽地圖讓節點沿著導覽路徑移動。
