Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationservers.po
Languages: ga, ru, ta, uk, zh_cn, zh_tw

source: Using NavigationServer
ga: Ag baint úsáide as NavigationServer
ru: С использованием NavigationServer
ta: ஊடுருவல்களைப் பயன்படுத்துதல்
uk: Використання NavigationServer
zh_cn: 使用 NavigationServer
zh_tw: 使用 NavigationServer

source: 2D and 3D version of the NavigationServer are available as :ref:`NavigationServer2D<class_NavigationServer2D>` and :ref:`NavigationServer3D<class_NavigationServer3D>` respectively.
ga: Tá leaganacha 2T agus 3D den Fhreastalaí Nascleanúna ar fáil mar :ref:`NavigationServer2D<class_NavigationServer2D>` agus :ref:`NavigationServer3D<class_NavigationServer3D>` faoi seach.
ru: 2D и 3D версии NavigationServer доступны как :ref:`NavigationServer2D<class_NavigationServer2D>` и :ref:`NavigationServer3D<class_NavigationServer3D>` соответственно.
ta: ஊடுருவல் சேவையகத்தின் 2 டி மற்றும் 3 டி பதிப்பு இவ்வாறு கிடைக்கிறது: குறிப்பு: `assetationserver2d <class_navigationserver2d>` மற்றும்: குறிப்பு: `assetationserver3d <class_navigationserver3d>` முறையே.
uk: 2D і 3D версії NavigationServer доступні як :ref:`NavigationServer2D<class_NavigationServer2D>` і :ref:`NavigationServer3D<class_NavigationServer3D>` відповідно.
zh_cn: NavigationServer 即导航服务器。2D 和 3D 版本的 NavigationServer 分别为 :ref:`NavigationServer2D<class_NavigationServer2D>` 和 :ref:`NavigationServer3D<class_NavigationServer3D>`\ 。
zh_tw: NavigationServer 提供了 2D 和 3D 兩個版本，分別為 :ref:`NavigationServer2D<class_NavigationServer2D>` 與 :ref:`NavigationServer3D<class_NavigationServer3D>`。

source: Both 2D and 3D use the same NavigationServer with NavigationServer3D being the primary server. The NavigationServer2D is a frontend that converts 2D positions into 3D positions and back. Hence it is entirely possible (if not a little cumbersome) to exclusively use the NavigationServer3D API for 2D navigation.
ga: Úsáideann 2D agus 3D an NavigationServer céanna agus is é NavigationServer3D an príomhfhreastalaí. Is tosaigh é an NavigationServer2D a athraíonn suíomhanna 2D go suíomhanna 3D agus ar ais. Dá bhrí sin is féidir go hiomlán (mura bhfuil sé beagán deacair) an API NavigationServer3D a úsáid go heisiach le haghaidh nascleanúint 2D.
ta: 2 டி மற்றும் 3 டி இரண்டும் ஒரே ஊடுருவல்களைப் பயன்படுத்துகின்றன. Assealationserver2d என்பது 2D நிலைகளை 3D நிலைகளாகவும் பின்புறமாகவும் மாற்றும் ஒரு முன்பக்கமாகும். ஆகவே, 2 டி வழிசெலுத்தலுக்கு Assaligationerver3d பநிஇ ஐ பிரத்தியேகமாகப் பயன்படுத்துவது முற்றிலும் சாத்தியமானது (கொஞ்சம் சிக்கலானது இல்லையென்றால்).
uk: І 2D, і 3D використовують той самий NavigationServer, при цьому NavigationServer3D є основним сервером. NavigationServer2D — це інтерфейс, який перетворює 2D-позиції в 3D-позиції та назад. Таким чином, цілком можливо (якщо не трохи громіздко) використовувати виключно NavigationServer3D API для двовимірної навігації.
zh_cn: 2D 和 3D 使用的 NavigationServer 是一样的，NavigationServer3D 是主要服务器。NavigationServer2D 只是一个前端，会进行 2D 位置和 3D 位置的相互转换。因此，完全可以只用 NavigationServer3D 的 API 来实现 2D 导航（就是会有点繁琐）。
zh_tw: 2D 與 3D 實際上共用同一個 NavigationServer，其中以 NavigationServer3D 為主要伺服器。NavigationServer2D 是一個前端，它負責將 2D 位置轉換為 3D 位置再轉回來。因此，完全可以（只是有點麻煩）只使用 NavigationServer3D API 來實作 2D 導覽。

source: Communicating with the NavigationServer
ga: Cumarsáid a dhéanamh leis an NavigationServer
ru: Связь с NavigationServer
ta: ஊடுருவல்களுடன் தொடர்புகொள்வது
uk: Зв'язок із навігаційним сервером
zh_cn: 与 NavigationServer 通信
zh_tw: 與 NavigationServer 溝通

source: To work with the NavigationServer means to prepare parameters for a **query** that can be sent to the NavigationServer for updates or requesting data.
ga: Oibriú leis an NavigationServer ciallaíonn paraiméadair a ullmhú d'**fiosrúch** is féidir a sheoladh chuig an NavigationServer le haghaidh nuashonruithe nó sonraí a iarraidh.
ru: Работать с NavigationServer означает подготавливать параметры для **запроса**, который можно отправить NavigationServer для обновления или запроса данных.
ta: ஊடுருவல் சேவையகத்துடன் பணிபுரிவது என்பது ** வினவல் ** க்கான அளவுருக்களைத் தயாரிப்பது, அவை புதுப்பிப்புகளுக்காக அல்லது தரவைக் கோருவதற்காக ஊடுருவல் சேவையாளருக்கு அனுப்பப்படலாம்.
uk: Працювати з NavigationServer означає підготувати параметри для **запиту**, який можна надіслати на NavigationServer для оновлення або запиту даних.
zh_cn: 要使用 NavigationServer 首先就需要为\ **请求**\ 准备参数，这个请求会被发送给 NavigationServer，用来进行更新和数据的请求。
zh_tw: 要與 NavigationServer 互動，必須先準備好查詢（**query**）的參數，這些查詢可以發送給 NavigationServer 以進行更新或取得資料。

source: To reference the internal NavigationServer objects like maps, regions and agents RIDs are used as identification numbers. Every navigation related node in the scene tree has a function that returns the RID for this node.
ga: Chun tagairt a thabhairt don nascleanúint inmheánachÚsáidtear rudaí freastalaí cosúil le léarscáileanna, réigiúin agus gníomhairí Tá feidhm ag gach nód a bhaineann le nascleanúint sa chrann radhairc a thugann an RID ar ais don nód seo.
ru: Для ссылки на внутренние объекты NavigationServer, такие как карты, регионы и агенты, используются RID-ы в качестве идентификационных номеров. Каждый узел в дереве сцены, связанный с навигацией, имеет функцию, возвращающую RID этого узла.
ta: வரைபடங்கள், பிராந்தியங்கள் மற்றும் முகவர்கள் இடது போன்ற உள் ஊடுருவல் பொருள்களைக் குறிப்பிட அடையாளம் காணும் எண்களாக பயன்படுத்தப்படுகின்றன. காட்சி மரத்தில் உள்ள ஒவ்வொரு வழிசெலுத்தல் தொடர்பான ஒவ்வொரு முனையிலும் இந்த முனைக்கு ரிட் திரும்பும் ஒரு செயல்பாடு உள்ளது.
uk: Для посилань на внутрішні об’єкти NavigationServer, такі як карти, регіони та агенти, RID використовуються як ідентифікаційні номери. Кожен пов’язаний з навігацією вузол у дереві сцени має функцію, яка повертає RID для цього вузла.
zh_cn: 地图、区块、代理等 NavigationServer 内部的对象使用 RID 来进行引用，这是一种用作标识符的数字。场景树中每个导航相关的节点都提供了返回该节点 RID 的函数。
zh_tw: 導覽伺服器內部的地圖、區域與代理等物件，都是用 RID 作為識別碼來引用。場景樹中每個與導覽相關的節點都提供一個可取得該節點 RID 的函式。

source: Threading and Synchronization
ga: Snáithe agus Sioncrónú
ru: Потоки и Синхронизация
ta: த்ரெட்டிங் மற்றும் ஒத்திசைவு
uk: Потоковість і синхронізація
zh_cn: 线程与同步
zh_tw: 執行緒與同步

source: The NavigationServer does not update every change immediately but waits until the end of the **physics frame** to synchronize all the changes together.
ga: Ní dhéanann an NavigationServer gach athrú a nuashonrú láithreach ach fanann sé go dtí deireadh an chráma fisice** chun na hathruithe go léir a shioncronú le chéile.
ru: NavigationServer не обновляет каждое изменение немедленно, а ждет окончания **кадра физики**, чтобы синхронизировать все изменения вместе.
ta: ஊடுருவல் ஒவ்வொரு மாற்றத்தையும் உடனடியாக புதுப்பிக்காது, ஆனால் அனைத்து மாற்றங்களையும் ஒன்றாக ஒத்திசைக்க ** இயற்பியல் சட்டகத்தின் இறுதி வரை காத்திருக்கிறது.
uk: NavigationServer не оновлює кожну зміну негайно, а чекає до кінця **фізичного кадру**, щоб синхронізувати всі зміни разом.
zh_cn: NavigationServer 不会立即为所有更改执行更新，而是会等到\ **物理帧**\ 的结尾再同步所有更改。
zh_tw: NavigationServer 並不會立即套用每一次的變更，而是等到**物理影格（physics frame）**結束時再一次同步所有的更動。

source: Waiting for synchronization is required to apply changes to all maps, regions and agents. Synchronization is done because some updates like a recalculation of the entire navigation map are very expensive and require updated data from all other objects. Also the NavigationServer uses a **threadpool** by default for some functionality like avoidance calculation between agents.
ga: Is gá fanacht le sioncrónú chun athruithe a chur i bhfeidhm ar gach léarscáil, réigiún agus gníomhaire. Déantar an sioncronú toisc go bhfuil roinnt nuashonruithe cosúil le hathríomh ar an léarscáil loingseoireachta ar fad an-chostasach agus go dteastaíonn sonraí nuashonraithe ó gach réad eile. Chomh maith leis sin úsáideann an NavigationServer **snáithe linn** de réir réamhshocraithe le haghaidh feidhmiúlachta áirithe amhail ríomh seachanta idir gníomhairí.
ru: Для применения изменений ко всем картам, регионам и агентам требуется ожидание синхронизации. Синхронизация необходима, поскольку некоторые обновления, такие как перерасчёт всей навигационной карты, требуют очень больших затрат и обновления данных со всех остальных объектов. Кроме того, NavigationServer по умолчанию использует **threadpool (пул потоков)** для некоторых функций, например, для расчёта маршрутов избегания между агентами.
ta: அனைத்து வரைபடங்கள், பிராந்தியங்கள் மற்றும் முகவர்களுக்கு மாற்றங்களைப் பயன்படுத்த ஒத்திசைவுக்காகக் காத்திருப்பது தேவை. ஒத்திசைவு செய்யப்படுகிறது, ஏனெனில் முழு வழிசெலுத்தல் வரைபடத்தின் மறுபரிசீலனை போன்ற சில புதுப்பிப்புகள் மிகவும் விலை உயர்ந்தவை மற்றும் மற்ற எல்லா பொருட்களிலிருந்தும் புதுப்பிக்கப்பட்ட தரவு தேவைப்படுகிறது. முகவர்களிடையே தவிர்ப்பு கணக்கீடு போன்ற சில செயல்பாடுகளுக்கு முன்னிருப்பாக ** த்ரெட்பூல் ** ஐப் பயன்படுத்துகிறது.
uk: Очікування синхронізації потрібне для застосування змін до всіх карт, регіонів і агентів. Синхронізація виконується, оскільки деякі оновлення, як-от перерахунок усієї навігаційної карти, є дуже дорогими та вимагають оновлення даних з усіх інших об’єктів. Крім того, NavigationServer використовує **threadpool** за замовчуванням для деяких функцій, як-от розрахунок уникнення між агентами.
zh_cn: 对地图、区块、代理进行更改都需要等待同步。之所以要进行同步，是因为部分更新的开销非常大，并且需要所有其他对象更新后的数据，例如重新计算整个导航地图。另外 NavigationServer 的部分功能默认会使用\ **线程池**\ ，例如代理之间的避障计算。
zh_tw: 所有對地圖、區域與代理的變更都必須經過同步後才會生效。進行同步是因為某些更新（如重新計算整張導覽地圖）非常耗費資源，也需要其他物件的最新資料。此外，NavigationServer 某些功能（如代理之間的避障計算）預設會使用**執行緒池（threadpool）**來處理。

source: Waiting is not required for most ``get()`` functions that only request data from the NavigationServer without making changes. Note that not all data will account for changes made in the same frame. E.g. if an avoidance agent changed the navigation map this frame the ``agent_get_map()`` function will still return the old map before the synchronization. The exception to this are nodes that store their values internally before sending the update to the NavigationServer. When a getter on a node is used for a value that was updated in the same frame it will return the already updated value stored on the node.
ga: Ní theastaíonn fanacht le haghaidh formhór na bhfeidhmeanna ``get () ``nach n-iarrann ach sonraí ón NavigationServer gan athruithe a dhéanamh. Tabhair faoi deara nach mbeidh gach sonraí cuntas ar athruithe a rinneadh sa fráma céanna. Mar shampla má d'athraigh gníomhaire seachanta an léarscáil nascleanúna an fráma seo cuirfidh an fheidhm ``agent_get_map () `ar ais an seanléarscáil fós roimh an sioncrónú. Is é an eisceacht as seo ná nóid a stóráilíonn a gcuid luachanna go hinmheánach sula gcuireann siad an nuashonrú chuig an NavigationServer. Nuair a úsáidtear getter ar nód le haghaidh luach a nuashonraíodh sa fráma céanna tabharfaidh sé an luach nuashonraithe cheana atá stóráilte ar an nód ar ais.
ru: Ожидание не требуется для большинства функций ``get()``, которые только запрашивают данные у NavigationServer, не внося изменений. Обратите внимание, что не все данные будут учитывать изменения, внесенные в том же кадре. Например, если агент избегания изменил навигационную карту в этом кадре, функция ``agent_get_map()`` всё равно вернет старую карту до синхронизации. Исключением являются узлы, которые сохраняют свои значения внутри себя перед отправкой обновления на NavigationServer. Когда геттер на узле используется для значения, обновлённого в том же кадре, он вернёт уже обновлённое значение, сохранённое в узле.
ta: மாற்றங்களைச் செய்யாமல் ஊடுருவலிலிருந்து தரவை மட்டுமே கோரும் பெரும்பாலான `` get () `` செயல்பாடுகளுக்கு காத்திருப்பு தேவையில்லை. ஒரே சட்டகத்தில் செய்யப்பட்ட மாற்றங்களுக்கு எல்லா தரவுகளும் கணக்கிடப்படாது என்பதை நினைவில் கொள்க. எ.கா. ஒரு தவிர்ப்பு முகவர் வழிசெலுத்தல் வரைபடத்தை மாற்றினால், இந்த சட்டகம் `` முகவர்_செட்_மாப் () `` செயல்பாடு ஒத்திசைவுக்கு முன்பே பழைய வரைபடத்தை திரும்பும். இதற்கு விதிவிலக்கு, புதுப்பிப்பை ஊடுருவல் சேவையாளருக்கு அனுப்புவதற்கு முன்பு அவற்றின் மதிப்புகளை உள்நாட்டில் சேமிக்கும் முனைகள். அதே சட்டகத்தில் புதுப்பிக்கப்பட்ட மதிப்புக்கு ஒரு முனையில் ஒரு பெறுநர் பயன்படுத்தப்படும்போது, அது ஏற்கனவே புதுப்பிக்கப்பட்ட மதிப்பை முனையில் சேமிக்கும்.
uk: Очікування не потрібне для більшості функцій ``get()``, які лише запитують дані від NavigationServer без внесення змін. Зауважте, що не всі дані враховуватимуть зміни, внесені в одному фреймі. наприклад якщо агент уникнення змінив навігаційну карту в цьому кадрі, функція ``agent_get_map()`` все одно повертатиме стару карту до синхронізації. Винятком є вузли, які зберігають свої значення всередині перед надсиланням оновлення на NavigationServer. Коли геттер на вузлі використовується для значення, яке було оновлено в тому самому кадрі, він поверне вже оновлене значення, що зберігається на вузлі.
zh_cn: 大多数 ``get()`` 函数都不需要等待，因为这些函数只会从 NavigationServer 请求数据，不会进行修改。请注意，并不是所有数据都会考虑到同一帧里做出的更改。比如避障代理在当前帧更改了导航地图的话，那么 ``agent_get_map()`` 函数在同步之前就仍然会返回旧的地图。部分节点会在向 NavigationServer 发送更新前在内部存储对应的值，所以这些节点属于例外。在这种节点上使用某个值的 getter 时，如果同一帧存在更新，那么返回的就是存储在该节点上的更新后的值。
zh_tw: 大多數僅用於取得資料、不會進行更動的 ``get()`` 函式，都不需要等待同步。但請注意，這些資料不一定會反映同一影格內做出的變更。例如，如果一個避障代理在這一影格修改了導覽地圖，那麼 ``agent_get_map()`` 在同步前仍會回傳舊地圖。例外情況是：有些節點會在送出更新給 NavigationServer 前，先在內部暫存資料，這種情況下，若在同一影格內用 getter 取得該值，就會拿到已被更新的內容。

source: The NavigationServer is **thread-safe** as it places all API calls that want to make changes in a queue to be executed in the synchronization phase. Synchronization for the NavigationServer happens in the middle of the physics frame after scene input from scripts and nodes are all done.
ga: Tá an NavigationServer **sábháilte snáith** toisc go gcuireann sé gach glao API atá ag iarraidh athruithe a dhéanamh i scuaine atá le forghníomhú sa chéim sioncrónaithe. Tarlaíonn sioncrónú don NavigationServer i lár an fhráma fisice tar éis ionchur radhairc ó scripteanna agus nóid go léir a dhéanamh.
ru: NavigationServer является **thread-safe (потокобезопасным)**, поскольку он помещает все вызовы API, требующие внесения изменений, в очередь для выполнения на этапе синхронизации. Синхронизация NavigationServer происходит в середине физического кадра после завершения ввода данных сцены из скриптов и узлов.
ta: ஒத்திசைவு கட்டத்தில் செயல்படுத்தப்பட வேண்டிய வரிசையில் மாற்றங்களைச் செய்ய விரும்பும் அனைத்து பநிஇ அழைப்புகளையும் இது வைக்கிறது என்பதால், ஊடுருவல் ** நூல்-பாதுகாப்பானது ** ஆகும். ச்கிரிப்ட்கள் மற்றும் முனைகளிலிருந்து காட்சி உள்ளீடு அனைத்தும் முடிந்தபின், ஊடுருவலுக்கான ஒத்திசைவு இயற்பியல் சட்டத்தின் நடுவில் நிகழ்கிறது.
uk: NavigationServer **потоково-безпечний**, оскільки розміщує всі виклики API, які хочуть внести зміни, у чергу для виконання на етапі синхронізації. Синхронізація для NavigationServer відбувається в середині кадру фізики після завершення введення сцени зі сценаріїв і вузлів.
zh_cn: NavigationServer 是\ **线程安全**\ 的，因为它会把所有需要执行更改的 API 调用放在队列中，在同步阶段再执行。NavigationServer 的同步发生在物理帧，在脚本以及节点的场景输入之后。
zh_tw: NavigationServer 具備**執行緒安全性（thread-safe）**，因為所有會產生變更的 API 呼叫都會放進佇列，等同步階段時再一起執行。導覽伺服器的同步會在物理影格內、所有腳本與節點場景輸入都處理完之後進行。

source: The important takeaway is that most NavigationServer changes take effect after the next physics frame and not immediately. This includes all changes made by navigation related nodes in the scene tree or through scripts.
ga: Is é an rud tábhachtach ná go dtagann an chuid is mó d'athruithe NavigationServer i bhfeidhm tar éis an chéad fhráma fisice eile agus ní láithreach Cuimsíonn sé seo gach athrú a dhéanann nóid a bhaineann le nascleanúint sa chrann radhairc nó trí scripteanna.
ru: Важно отметить, что большинство изменений NavigationServer вступают в силу не сразу, а после следующего кадра физики. Это включает в себя все изменения, вносимые узлами навигации в дереве сцены или скриптами.
ta: முக்கியமான டேக்அவே என்னவென்றால், அடுத்த இயற்பியல் சட்டகத்திற்குப் பிறகு பெரும்பாலான ஊடுருவல் மாற்றங்கள் நடைமுறைக்கு வருகின்றன, உடனடியாக இல்லை. காட்சி மரத்தில் அல்லது ச்கிரிப்டுகள் மூலம் வழிசெலுத்தல் தொடர்பான முனைகளால் செய்யப்பட்ட அனைத்து மாற்றங்களும் இதில் அடங்கும்.
uk: Важливим висновком є те, що більшість змін NavigationServer набувають чинності після наступного кадру фізики, а не відразу. Це включає всі зміни, внесені пов’язаними з навігацією вузлами в дереві сцени або за допомогою сценаріїв.
zh_cn: 划重点：大多数对 NavigationServer 的更改都会在下一个物理帧之后生效，不会立即生效。包括场景树中导航相关节点做出的更改，以及脚本做出的更改。
zh_tw: 重點是：大多數對 NavigationServer 的變更都要等到下一個物理影格後才會生效，而不是馬上見效。這包含在場景樹導覽相關節點或腳本中做的所有變動。

source: All setters and delete functions require synchronization.
ga: Teastaíonn sioncrónú ó gach socraithe agus feidhm scriosta.
ru: Все функции установки и удаления требуют синхронизации.
ta: அனைத்து செட்டர்கள் மற்றும் நீக்குதல் செயல்பாடுகளுக்கு ஒத்திசைவு தேவைப்படுகிறது.
uk: Усі функції встановлення та видалення потребують синхронізації.
zh_cn: Setter 和删除函数都需要同步。
zh_tw: 所有 setter 與刪除類型的函式都需要同步後才會生效。

source: 2D and 3D NavigationServer differences
ga: Navigation 2D agus 3DDifríochtaí freastalaí
ru: Различия между 2D и 3D NavigationServer
ta: 2 டி மற்றும் 3 டி ஊடுருவல் வேறுபாடுகள்
uk: Відмінності 2D і 3D NavigationServer
zh_cn: 2D 和 3D NavigationServer 的区别
zh_tw: 2D 與 3D NavigationServer 的差異

source: NavigationServer2D and NavigationServer3D are equivalent in functionality for their dimension and both use the same NavigationServer behind the scene.
ga: Tá NavigationServer2D agus NavigationServer3D coibhéiseach i bhfeidhmiúlacht dá ngné agus úsáideann an bheirt acu an NavigationServer céanna taobh thiar den radharc.
ta: Asselationserver2d மற்றும் AsseactationServer3d ஆகியவை அவற்றின் பரிமாணத்திற்கு செயல்பாட்டில் சமமானவை, மேலும் இருவரும் காட்சியின் பின்னால் ஒரே ஊடுருவல்களைப் பயன்படுத்துகின்றனர்.
uk: NavigationServer2D і NavigationServer3D еквівалентні за функціональністю за своїм виміром і обидва використовують один і той самий NavigationServer.
zh_cn: NavigationServer2D 和 NavigationServer3D 在各自维度中的功能是等价的，底层使用的相同的 NavigationServer。
zh_tw: NavigationServer2D 與 NavigationServer3D 在各自維度的功能是等價的，且底層都共用同一個 NavigationServer。

source: Strictly technical a NavigationServer2D is a myth. The NavigationServer2D is a frontend to facilitate conversions of ``Vector2(x, y)`` to ``Vector3(x, 0.0, z)`` and back for the NavigationServer3D API. 2D uses a flat 3D mesh pathfinding and the NavigationServer2D facilitates the conversions. When a guide uses just NavigationServer without the 2D or 3D suffix it usually works for both servers by exchange ``Vector2(x, y)`` with ``Vector3(x, 0.0, z)`` or reverse.
ga: Is miotas é NavigationServer2d go docht teicniúil. Is tosaigh é an NavigationServer2d chun tiontú ``Vector2 (x, y) ``a éascú go ``Vector3 (x, 0.0, z)`` agus ar ais don API NavigationServer3D. Úsáideann 2D beathaimh cothrom mogalra 3D agus éascaíonn an NavigationServer2D na tiontaithe. Nuair a úsáideann treoir ach NavigationServer gan an iarmhír 2D nó 3D is gnách go n-oibríonn sé don dá fhreastalaí trí mhalartú ``Vector2 (x, y) ``le `Vector3 (x, 0.0, z)`` nó ar ais.
ta: கண்டிப்பாக தொழில்நுட்பமானது ஒரு ஊடுருவல் 2 டி ஒரு கட்டுக்கதை. `` Vector2 (x, y) `` `` `` `` வெக்டர் 3 (x, 0.0, z) `` `` `` `மீண்டும் ஊடுருவல் சேவையகத்தின் மாற்றங்களை எளிதாக்குவதற்கான ஒரு முன்பக்கமாகும். 2 டி ஒரு தட்டையான 3D மெச் பாத்ஃபைண்டிங் பயன்படுத்துகிறது மற்றும் AsseationServer2d மாற்றங்களை எளிதாக்குகிறது. ஒரு வழிகாட்டி 2 டி அல்லது 3 டி பின்னொட்டு இல்லாமல் வெறும் ஊடுருவல்களைப் பயன்படுத்தும் போது, இது வழக்கமாக இரு சேவையகங்களுக்கும் `` வெக்டர் 2 (எக்ச், ஒய்) `` `` வெக்டர் 3 (எக்ச், 0.0, இசட்) `` அல்லது தலைகீழாக பரிமாற்றம் மூலம் வேலை செய்கிறது.
uk: Строго технічно NavigationServer2D є міфом. NavigationServer2D — це інтерфейс для полегшення перетворення ``Vector2(x, y)`` у ``Vector3(x, 0.0, z)`` і назад для API NavigationServer3D. 2D використовує плоску 3D-сітку для пошуку шляху, а NavigationServer2D полегшує перетворення. Коли посібник використовує лише NavigationServer без суфікса 2D або 3D, він зазвичай працює для обох серверів шляхом обміну ``Vector2(x, y)`` на ``Vector3(x, 0.0, z)`` або навпаки.
zh_cn: 严格来说，NavigationServer2D在技术上是一个神话。NavigationServer2D是一个前端，用于帮助NavigationServer3D API将``Vector2(x, y)`` 转换为 ``Vector3(x, 0.0, z)``并返回。2D使用平面三维网格路径查找，NavigationServer2D便于转换。当指南只使用NavigationServer而不使用2D或3D后缀时，它通常通过将 ``Vector2(x, y)`` 与 ``Vector3(x, 0.0, z)`` 交换或反向来对两个服务器都有效。
zh_tw: 嚴格來說，NavigationServer2D 其實只是個前端介面。它的作用是把 ``Vector2(x, y)`` 和 ``Vector3(x, 0.0, z)`` 互相轉換，以便調用 NavigationServer3D 的 API。2D 的導覽路徑規劃其實是基於平面的 3D 網格，NavigationServer2D 只負責轉換座標。當說明文件只提 NavigationServer 而沒加 2D 或 3D 字尾時，通常表示你只需把 ``Vector2(x, y)`` 跟 ``Vector3(x, 0.0, z)`` 互換即可。

source: Technically it is possible to use the tools for creating navigation meshes in one dimension for the other dimension, e.g. baking a 2D navigation mesh with the 3D NavigationMesh when using flat 3D source geometry or creating 3D flat navigation meshes with the polygon outline draw tools of NavigationRegion2D and NavigationPolygons.
ga: Go teicniúil is féidir na huirlisí a úsáid chun mogalra nascleanúna a chruthú i ngné amháin don ghné eile, m.sh. mogalra nascleanúna 2D a bácáil leis an 3D NavigationMesh agus geoiméadras foinse cothrom 3D á úsáid agat nó mogalra nascleanúna comhréidh 3D a chruthú le huirlisí tarraingthe imlíne polugún Navigation2D agus NavigationPolygons.
ru: Технически возможно использовать инструменты для создания навигационных сеток в одном измерении для другого измерения, например, запекание 2D-навигационной сетки с помощью 3D NavigationMesh при использовании плоской 3D-исходной геометрии или создание 3D-плоских навигационных сеток с помощью инструментов рисования контура полигона NavigationRegion2D и NavigationPolygons.
ta: தொழில்நுட்ப ரீதியாக மற்ற பரிமாணத்திற்கு ஒரு பரிமாணத்தில் வழிசெலுத்தல் மெச்களை உருவாக்குவதற்கான கருவிகளைப் பயன்படுத்த முடியும், எ.கா. பிளாட் 3 டி மூல வடிவவியலைப் பயன்படுத்தும் போது 3 டி நேவிகேசன்மேசுடன் 2 டி வழிசெலுத்தல் கண்ணி சுடுவது அல்லது பலகோண அவுட்லைன் மூலம் 3 டி பிளாட் வழிசெலுத்தல் மெச்களை உருவாக்குதல் வழிசெலுத்தல் பிரேரியோன் 2 டி மற்றும் நேவிகேசன் போலிகான்களின் கருவிகளை வரையவும்.
uk: Технічно можливо використовувати інструменти для створення навігаційних сіток в одному вимірі для іншого виміру, напр. запікання 2D навігаційної сітки за допомогою 3D NavigationMesh при використанні плоскої 3D вихідної геометрії або створення 3D плоских навігаційних сіток за допомогою інструментів малювання контуру багатокутника NavigationRegion2D і NavigationPolygons.
zh_cn: 从技术上讲，可以使用工具在一个维度上为另一个维度创建导航网格，例如，当使用平面三维源几何体时，使用3D NavigationMesh烘焙二维导航网格，或者使用NavigationRegion2D和NavigationPolygons的多边形轮廓绘制工具创建三维平面导航网格。
zh_tw: 技術上來說，也可以用一個維度的導覽網格工具來建立另一個維度的網格，例如：用平面 3D 幾何體搭配 3D NavigationMesh 來烘焙 2D 導覽網格，或是用 NavigationRegion2D 與 NavigationPolygons 的多邊形繪製工具來產生平面 3D 導覽網格。

source: Any RID created with the NavigationServer2D API works on the NavigationServer3D API as well and both 2D and 3D avoidance agents can exist on the same map.
ga: Oibríonn aon RID a cruthaíodh leis an NavigationServer2D API ar an NavigationServer3D API chomh maith agus is féidir le gníomhairí seachanta 2D agus 3D a bheith ann ar an léarscáil chéanna.
ta: Assaligationserver2d பநிஇ உடன் உருவாக்கப்பட்ட எந்தவொரு இடமாற்றமும் Assaligationserver3d பநிஇ இல் செயல்படுகிறது, மேலும் 2D மற்றும் 3D தவிர்ப்பது முகவர்கள் ஒரே வரைபடத்தில் இருக்கலாம்.
uk: Будь-який RID, створений за допомогою NavigationServer2D API, також працює з NavigationServer3D API, і як 2D, так і 3D агенти уникнення можуть існувати на одній карті.
zh_cn: 使用NavigationServer2D API创建的任何RID也适用于NavigationServer3D API，2D和3D回避代理都可以存在于同一地图上。
zh_tw: 任何用 NavigationServer2D API 建立的 RID 也能直接用於 NavigationServer3D API，2D 與 3D 的避障代理也可以同時存在於同一張地圖上。
