Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationmaps.po
Languages: ga, ru, ta, uk, zh_cn, zh_tw

source: Using NavigationMaps
ga: Ag baint úsáide as NavigationMaps
ru: Использование NavigationMaps
ta: வழிசெலுத்தல் வரைபடங்களைப் பயன்படுத்துதல்
uk: Використання NavigationMaps
zh_cn: 使用导航地图
zh_tw: 使用 NavigationMap

source: A NavigationMap is an abstract navigation world on the NavigationServer identified by a NavigationServer :ref:`RID<class_RID>`.
ga: Domhan nascleanúna teibí ar an bhFreastalaí Nascleanúna is ea NavigationMap a shainaithnítear ag Freastalaí Nascleanúna :ref:`RID<class_RID>`.
ru: NavigationMap — это абстрактный навигационный мир на NavigationServer, идентифицируемый NavigationServer :ref:`RID<class_RID>`.
ta: ஒரு வழிசெலுத்தல் வரைபடம் என்பது ஒரு ஊடுருவல் சேவையாளரால் அடையாளம் காணப்பட்ட ஊடுருவல் சேவையில் ஒரு சுருக்க வழிசெலுத்தல் உலகமாகும்: குறிப்பு: `RID <class_rid>`.
uk: NavigationMap — це абстрактний світ навігації на NavigationServer, ідентифікований NavigationServer :ref:`RID<class_RID>`.
zh_cn: NavigationMap 即导航地图，是抽象的导航世界，位于 NavigationServer 中，使用 NavigationServer 的 :ref:`RID<class_RID>` 标识。
zh_tw: NavigationMap 是 NavigationServer 上的抽象導航世界，並以 NavigationServer 的 :ref:`RID<class_RID>` 作為識別。

source: A map can hold and connect a near infinite number of navigation regions with navigation meshes to build the traversable areas of a game world for pathfinding.
ga: Is féidir le léarscáil líon gan teorainn réigiúin nascleanúna a shealbhú agus a nascadh le mogalra nascleanúna chun na limistéir inthráite de shaol cluiche a thógáil le haghaidh cosáin a fháil.
ru: Карта может содержать и соединять практически бесконечное количество навигационных регионов с навигационными сетками для создания проходимых областей игрового мира для поиска пути.
ta: பாத்ஃபைண்டிங் செய்வதற்காக ஒரு விளையாட்டு உலகின் பயணிக்கக்கூடிய பகுதிகளை உருவாக்க ஒரு வரைபடம் எண்ணற்ற வழிசெலுத்தல் பகுதிகளை வழிசெலுத்தல் மெச்களுடன் வைத்திருக்க முடியும் மற்றும் இணைக்க முடியும்.
uk: Карта може містити та з’єднувати майже нескінченну кількість навігаційних областей з навігаційними сітками, щоб побудувати прохідні області ігрового світу для пошуку шляху.
zh_cn: 地图中可以存放并连接几乎无限数量的导航区块，区块中的导航网格可以用来构建游戏世界中的可达区域，用于寻路操作。
zh_tw: 導航地圖可以容納並連接近乎無限數量的導航區域和導航網格，以構建遊戲世界中可行走的區域，提供路徑尋找功能。

source: A map can contain avoidance agents. Collision avoidance will be calculated based on the agents present in the map.
ga: Is féidir gníomhairí seachanta a bheith i léarscáil. Ríomhfar seachaint imbhuailte bunaithe ar na gníomhairí atá i láthair sa léarscáil.
ru: Карта может содержать агентов избегания столкновений. Расчет избегания столкновений будет производиться на основе агентов, присутствующих на карте.
ta: ஒரு வரைபடத்தில் தவிர்ப்பு முகவர்கள் இருக்கலாம். வரைபடத்தில் உள்ள முகவர்களின் அடிப்படையில் மோதல் தவிர்ப்பு கணக்கிடப்படும்.
uk: Карта може містити агентів уникнення. Уникнення зіткнення буде розраховано на основі агентів, присутніх на карті.
zh_cn: 地图中可以包含避障代理。碰撞躲避是根据地图中存在的代理来计算的。
zh_tw: 導航地圖可以包含避障代理。碰撞避免會根據地圖中存在的代理進行計算。

source: Different NavigationMaps are completely isolated from each other but navigation regions and avoidance agents can switch between different maps. Switches will become effective on NavigationServer synchronization.
ga: Tá Léarscáileanna nascleanúna éagsúla scoite go hiomlán óna chéile ach is féidir le réigiúin nascleanúna agus gníomhairí seachanta aistriú Beidh lasca éifeachtach ar shioncrónú NavigationServer.
ru: Различные NavigationMaps полностью изолированы друг от друга, но навигационные регионы и агенты избегания могут переключаться между разными картами. Переключения вступают в силу после синхронизации с навигационным сервером.
ta: வெவ்வேறு வழிசெலுத்தல் வரைபடங்கள் ஒருவருக்கொருவர் முற்றிலும் தனிமைப்படுத்தப்படுகின்றன, ஆனால் வழிசெலுத்தல் பகுதிகள் மற்றும் தவிர்ப்பு முகவர்கள் வெவ்வேறு வரைபடங்களுக்கு இடையில் மாறலாம். ஊடுருவல் ஒத்திசைவில் சுவிட்சுகள் பயனுள்ளதாக இருக்கும்.
uk: Різні навігаційні карти повністю ізольовані одна від одної, але навігаційні регіони та агенти уникнення можуть перемикатися між різними картами. Перемикачі почнуть діяти під час синхронізації NavigationServer.
zh_cn: 不同 NavigationMap 之间是相互独立的，但是导航区块和避障代理可以在不同地图之间进行切换。切换会在 NavigationServer 同步后生效。
zh_tw: 不同的導航地圖彼此完全獨立，但導航區域與避障代理可以在不同地圖間切換。切換動作會在 NavigationServer 同步時生效。

source: Default navigation maps
ga: Léarscáileanna loingseo
ru: Карты навигации по умолчанию
ta: இயல்புநிலை வழிசெலுத்தல் வரைபடங்கள்
uk: Стандартні навігаційні карти
zh_cn: 默认导航地图
zh_tw: 預設導航地圖

source: By default Godot creates a navigation map for each :ref:`World2D<class_World2D>` and :ref:`World3D<class_World3D>` of the root viewport.
ga: De réir réamhshocraithe, cruthaíonn Godot léarscáil nascleanúna le haghaidh gach :ref:`World2D <class_World2D>` agus :ref:`World3D <class_World3D>` den bhunamharc.
ru: По умолчанию Godot создает навигационную карту для каждого :ref:`World2D<class_World2D>` и :ref:`World3D<class_World3D>` корневого окна просмотра.
ta: முன்னிருப்பாக கோடோட் ஒவ்வொன்றிற்கும் ஒரு வழிசெலுத்தல் வரைபடத்தை உருவாக்குகிறது: குறிப்பு: `உலக 2 டி <class_world2d>` மற்றும்: rew: `world3d <class_world3d>` ரூட் வியாபோர்ட்.
uk: За замовчуванням Godot створює навігаційну карту для кожного :ref:`World2D<class_World2D>` та :ref:`World3D<class_World3D>` кореневого вікна перегляду.
zh_cn: Godot 默认会为根视口的每个 :ref:`World2D<class_World2D>` 和 :ref:`World3D<class_World3D>` 创建一个导航地图。
zh_tw: 預設情況下，Godot 會為根視窗的每個 :ref:`World2D<class_World2D>` 與 :ref:`World3D<class_World3D>` 建立一個導航地圖。

source: The 2D default navigation map RID can be obtained with ``get_world_2d().get_navigation_map()`` from any :ref:`Node2D<class_Node2D>` inheriting Node.
ga: Is féidir an RID léarscáil nascleanúna réamhshocraithe 2D a fháil le ``get_world_2d().get_navigation_map()`` ó aon :ref:`Node2D <class_Node2D>` Nód mar oidhreacht.
ru: RID 2D-карты навигации по умолчанию можно получить с помощью ``get_world_2d().get_navigation_map()`` из любого :ref:`Node2D<class_Node2D>`, наследующего Node.
ta: 2 டி இயல்புநிலை வழிசெலுத்தல் வரைபட RID `` get_world_2d () உடன் பெறலாம். Get_navigation_map () `` ஏதேனும் இருந்து: `node2d <class_node2d>` மரபுரிமை முனை.
uk: RID двовимірної карти навігації за замовчуванням можна отримати за допомогою ``get_world_2d().get_navigation_map()`` з будь-якого вузла :ref:`Node2D<class_Node2D>`, що успадковує Node.
zh_cn: 默认的 2D 导航地图 RID 可以从继承自 :ref:`Node2D<class_Node2D>` 的任何 Node 的 ``get_world_2d().get_navigation_map()`` 获取。
zh_tw: 2D 預設導航地圖的 RID 可以透過任何繼承 Node 的 :ref:`Node2D<class_Node2D>` 使用 ``get_world_2d().get_navigation_map()`` 取得。

source: The 3D default navigation map RID can be obtained with ``get_world_3d().get_navigation_map()`` from any :ref:`Node3D<class_Node3D>` inheriting Node.
ga: Is féidir an RID léarscáil nascleanúna réamhshocraithe 3D a fháil le ``get_world_3d().get_navigation_map()`` ó aon :ref:`Node3D <class_Node3D>` Nód mar oidhreacht.
ru: RID трехмерной навигационной карты по умолчанию можно получить с помощью ``get_world_3d().get_navigation_map()`` из любого :ref:`Node3D<class_Node3D>`, наследующего Node.
ta: 3D இயல்புநிலை வழிசெலுத்தல் வரைபட RID `` get_world_3d () உடன் பெறலாம். Get_navigation_map () `` ஏதேனும் இருந்து: `node3d <class_node3d>` மரபுரிமை முனை.
uk: RID 3D-карти навігації за замовчуванням можна отримати за допомогою ``get_world_3d().get_navigation_map()`` з будь-якого вузла :ref:`Node3D<class_Node3D>`, що успадковує Node.
zh_cn: 默认的 3D 导航地图 RID 可以从继承自 :ref:`Node3D<class_Node3D>` 的任何 Node 的 ``get_world_3d().get_navigation_map()`` 获取。
zh_tw: 3D 預設導航地圖的 RID 可以透過任何繼承 Node 的 :ref:`Node3D<class_Node3D>` 使用 ``get_world_3d().get_navigation_map()`` 取得。

source: Creating new navigation maps
ga: Léarscáileanna nascleanúna nua
ru: Создание новых навигационных карт
ta: புதிய வழிசெலுத்தல் வரைபடங்களை உருவாக்குதல்
uk: Створення нових навігаційних карт
zh_cn: 新建导航地图
zh_tw: 建立新導航地圖

source: The NavigationServer can create and support as many navigation maps as required for specific gameplay. Additional navigation maps are created and handled by using the NavigationServer API directly e.g. to support different avoidance agent or actor locomotion types.
ga: Is féidir leis an NavigationServer a oiread léarscáileanna loingseoireachta a chruthú agus a thacú agus a theastaíonn le haghaidh cluiche sonrach. Cruthaítear agus láimhseáiltear léarscáileanna loingseoireachta breise trí úsáid a bhaint as an NavigationServer API go díreach e.g. chun tacú le cineálacha difriúla iompair gníomhairí seachanta nó gníomhaithe.
ru: NavigationServer может создавать и поддерживать столько навигационных карт, сколько необходимо для конкретного игрового процесса. Дополнительные навигационные карты создаются и обрабатываются непосредственно через API NavigationServer, например, для поддержки различных типов агентов избегания или передвижения акторов.
ta: குறிப்பிட்ட விளையாட்டுக்குத் தேவையான பல வழிசெலுத்தல் வரைபடங்களை ஊடுருவல் சேவையகம் உருவாக்கி ஆதரிக்க முடியும். கூடுதல் வழிசெலுத்தல் வரைபடங்கள் நேரடியான பநிஇ ஐ நேரடியாகப் பயன்படுத்துவதன் மூலம் உருவாக்கப்பட்டு கையாளப்படுகின்றன எ.கா. வெவ்வேறு தவிர்ப்பு முகவர் அல்லது நடிகர் லோகோமோசன் வகைகளை ஆதரிக்க.
uk: NavigationServer може створювати та підтримувати стільки навігаційних карт, скільки потрібно для конкретного ігрового процесу. Додаткові навігаційні карти створюються та обробляються безпосередньо за допомогою NavigationServer API, наприклад. для підтримки різних типів пересування агентів уникнення або акторів.
zh_cn: 导航服务器可根据特定游戏的需要创建和支持尽可能多的导航地图。其他导航地图可通过直接使用导航服务器应用程序接口来创建和处理，例如支持不同的避障代理或演员运动类型。
zh_tw: NavigationServer 可以根據遊戲需求建立及支援任意數量的導航地圖。若需支援不同的避障代理或角色移動類型，可以直接使用 NavigationServer API 來建立與管理額外的導航地圖。

source: For example uses of different navigation maps see :ref:`doc_navigation_different_actor_types` and :ref:`doc_navigation_different_actor_locomotion`.
ga: Mar shampla úsáidí léarscáileanna nascleanúna éagsúla féach: ref: `doc_navigation_different_actor_types` agus:ref: `doc_navigation_different_actor_locomotion`.
ru: Примеры использования различных навигационных карт см. в разделах :ref:`doc_navigation_different_actor_types` и :ref:`doc_navigation_different_actor_locomotion`.
ta: எடுத்துக்காட்டாக வெவ்வேறு வழிசெலுத்தல் வரைபடங்களின் பயன்பாடுகள் காண்க: குறிப்பு: `doc_navigation_different_actor_types` மற்றும்: ref:` doc_navigation_different_actor_locomotion`.
uk: Для прикладу використання різних навігаційних карт див. :ref:`doc_navigation_different_actor_types` і :ref:`doc_navigation_different_actor_locomotion`.
zh_cn: 有关使用不同导航图的示例，请参阅 :ref:`doc_navigation_different_actor_types` 和 :ref:`doc_navigation_different_actor_locomotion`。
zh_tw: 有關不同導航地圖的應用範例，請參閱 :ref:`doc_navigation_different_actor_types` 及 :ref:`doc_navigation_different_actor_locomotion`。

source: Each navigation map individually synchronizes queued changes to its navigation regions and avoidance agents. A navigation map that has not received changes will consume little to no processing time. Navigation regions and avoidance agents can only be part of a single navigation map but they can switch map at any time.
ga: Déanann gach léarscáil nascleanúna a shioncronú ina n-aonar athruithe scuaine ar a réigiúin nascleanúna Ní chaithfidh léarscáil nascleanúna nach bhfuair athruithe mórán ama próiseála nó gan aon am próiseála. Ní féidir réigiúin nascleanúna agus gníomhairí seachanta a bheith mar chuid de léarscáil nascleanúna amháin ach is féidir leo léarscáil a athrú ag am ar bith.
ru: Каждая навигационная карта индивидуально синхронизирует изменения, поставленные в очередь, со своими навигационными регионами и агентами избегания. Навигационная карта, не получившая изменений, практически не потребляет времени на обработку. Навигационные регионы и агенты избегания могут быть частью только одной навигационной карты, но могут в любой момент переключиться между ними.
ta: ஒவ்வொரு வழிசெலுத்தல் வரைபடமும் தனித்தனியாக வரிசைப்படுத்தப்பட்ட மாற்றங்களை அதன் வழிசெலுத்தல் பகுதிகள் மற்றும் தவிர்ப்பு முகவர்களுக்கு ஒத்திசைக்கிறது. மாற்றங்களைப் பெறாத வழிசெலுத்தல் வரைபடம் எந்த செயலாக்க நேரத்திற்கும் குறைவாகவே இருக்கும். வழிசெலுத்தல் பகுதிகள் மற்றும் தவிர்ப்பு முகவர்கள் ஒரு வழிசெலுத்தல் வரைபடத்தின் ஒரு பகுதியாக மட்டுமே இருக்க முடியும், ஆனால் அவர்கள் எந்த நேரத்திலும் வரைபடத்தை மாற்ற முடியும்.
uk: Кожна навігаційна карта окремо синхронізує зміни в черзі для своїх навігаційних регіонів і агентів уникнення. Навігаційна карта, яка не отримала змін, оброблятиметься майже без часу. Навігаційні регіони та агенти уникнення можуть бути лише частиною однієї навігаційної карти, але вони можуть будь-коли змінити карту.
zh_cn: 每个导航地图都会单独同步其导航区块和避障代理的更改队列。未收到更改通知的导航地图几乎不会消耗任何处理时间。导航区块和避障代理只能是单个导航地图的一部分，但它们可以随时切换所属地图。
zh_tw: 每個導航地圖會獨立同步其導航區域和避障代理的變更佇列。未發生變更的導航地圖幾乎不會消耗處理時間。導航區域與避障代理僅能隸屬於單一導航地圖，但可隨時切換至其他地圖。

source: A navigation map switch will take effect only after the next NavigationServer synchronization.
ga: Ní thiocfaidh lasc léarscáil nascleanúna i bhfeidhm ach amháin tar éis an chéad shioncronú NavigationServer eile.
ru: Переключение навигационной карты вступит в силу только после следующей синхронизации NavigationServer.
ta: அடுத்த ஊடுருவல் ஒத்திசைவுக்கு ஒத்திசைவுக்குப் பிறகுதான் வழிசெலுத்தல் வரைபட சுவிட்ச் நடைமுறைக்கு வரும்.
uk: Перемикач карти навігації почне діяти лише після наступної синхронізації NavigationServer.
zh_cn: 导航地图切换只有在下一次同步导航服务器后才会生效。
zh_tw: 導航地圖的切換僅會在下次 NavigationServer 同步時生效。

source: There is no difference between navigation maps created with the NavigationServer2D API or the NavigationServer3D API.
ga: Níl aon difríocht idir léarscáileanna nascleanúna a cruthaíodh leis an NavigationServer2D API nó an NavigationServer3D API.
ru: Нет никакой разницы между навигационными картами, созданными с помощью API NavigationServer2D или API NavigationServer3D.
ta: AssealationServer2d பநிஇ அல்லது AsseligationServer3d பநிஇ உடன் உருவாக்கப்பட்ட வழிசெலுத்தல் வரைபடங்களுக்கு எந்த வித்தியாசமும் இல்லை.
uk: Немає різниці між навігаційними картами, створеними за допомогою API NavigationServer2D або API NavigationServer3D.
zh_cn: 使用 NavigationServer2D API 和 NavigationServer3D API 创建的导航地图没有任何区别。
zh_tw: 使用 NavigationServer2D API 或 NavigationServer3D API 建立的導航地圖沒有任何差異。

source: Translation status
zh_cn: 翻译状态
