Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_using_navigationservers.po
Languages: ga, ru, ta, uk, zh_cn, zh_tw

source: Regions created in 2D and 3D will merge their navigation meshes when placed on the same map and merge conditions apply. The NavigationServer does not discriminate between NavigationRegion2D and NavigationRegion3D nodes as both are regions on the server. By default those nodes register on different navigation maps so this merge can only happen when maps are changed manually e.g. with scripts.
ga: Déanfaidh réigiúin a chruthaítear i 2T agus i 3D a gcuid mogaill loingseoireachta a chumasc nuair a chuirtear ar an léarscáil chéanna iad agus beidh feidhm ag coinníollacha cumaisc. Ní dhéanann an NavigationServer idirdhealú idir nóid NavigationRegion2D agus NavigationRegion3D mar gur réigiúin iad an dá cheann ar an bhfreastalaí. De réir réamhshocraithe cláraíonn na nóid sin ar léarscáileanna loingseoireachta éagsúla agus mar sin ní féidir leis an gcumasc seo tarlú ach amháin nuair a athraítear léarscáileanna de láimh e.g. le scripteanna.
ta: 2D மற்றும் 3D இல் உருவாக்கப்பட்ட பகுதிகள் ஒரே வரைபடத்தில் வைக்கப்படும்போது அவற்றின் வழிசெலுத்தல் மெச்களை ஒன்றிணைத்து, ஒன்றிணைக்கும் நிலைமைகள் பொருந்தும். இரண்டும் சேவையகத்தில் உள்ள பகுதிகள் என்பதால் வழிசெலுத்தல் பிரெக்சியோன் 2 டி மற்றும் வழிசெலுத்தல் பிரேகியன் 3 டி முனைகளுக்கு இடையில் ஊடுருவல் பாகுபாடு காட்டாது. இயல்பாகவே அந்த முனைகள் வெவ்வேறு வழிசெலுத்தல் வரைபடங்களில் பதிவு செய்கின்றன, எனவே வரைபடங்கள் கைமுறையாக மாற்றப்படும்போது மட்டுமே இந்த ஒன்றிணைவு நிகழும் எ.கா. ச்கிரிப்டுகளுடன்.
uk: Регіони, створені в 2D і 3D, об’єднають свої навігаційні сітки, якщо їх розмістити на одній карті, і застосовуються умови злиття. NavigationServer не розрізняє вузли NavigationRegion2D і NavigationRegion3D, оскільки обидва є регіонами на сервері. За замовчуванням ці вузли реєструються на різних навігаційних картах, тому це злиття може відбутися лише тоді, коли карти змінено вручну, наприклад. зі скриптами.
zh_cn: 在二维和三维中创建的区域将在放置在同一地图上时合并其导航网格，并应用合并条件。NavigationServer不会区分NavigationRegion2D和NavigationRegion3D节点，因为这两个节点都是服务器上的区域。默认情况下，这些节点注册在不同的导航地图上，因此只有在手动更改地图（例如使用脚本）时才能进行合并。
zh_tw: 在 2D 與 3D 中建立的區域，只要放到同一個地圖上，且符合合併條件時，它們的導覽網格就會被合併。NavigationServer 不會區分 NavigationRegion2D 與 NavigationRegion3D 節點，因為在伺服器端它們都是區域。預設情況下，這些節點會註冊到不同的導覽地圖，所以只有手動變更地圖（例如用腳本時）才會發生這種合併。

source: Actors with avoidance enabled will avoid both 2D and 3D avoidance agents when placed on the same map.
ga: Seachnóidh aisteoirí a bhfuil seachaint cumasaithe acu gníomhairí seachaint 2D agus 3D nuair a chuirtear ar an léarscáil chéanna.
ta: தவிர்ப்பு இயக்கப்பட்ட நடிகர்கள் ஒரே வரைபடத்தில் வைக்கப்படும்போது 2 டி மற்றும் 3 டி தவிர்ப்பு முகவர்களைத் தவிர்ப்பார்கள்.
uk: Актори з увімкненим уникненням уникатимуть як 2D, так і 3D агентів уникнення, якщо їх розмістити на одній карті.
zh_cn: 启用回避的Actor在放置在同一张地图上时将同时回避2D和3D回避代理。
zh_tw: 若 Actor 啟用避障功能，當其與 2D 和 3D 的避障代理同時存在於同一張地圖時，都會進行避障。

source: It is not possible to use NavigationServer2D while disabling 3D on a Godot custom build.
ga: Ní féidir NavigationServer2D a úsáid agus 3D a dhíchumasú ar thógáil saincheaptha Godot.
ta: கோடோட் தனிப்பயன் கட்டமைப்பில் 3D ஐ முடக்கும்போது AssaligationServer2d ஐப் பயன்படுத்த முடியாது.
uk: Неможливо використовувати NavigationServer2D з вимкненим 3D у користувацькій збірці Godot.
zh_cn: 自定义的 Godot 构建如果禁用了 3D，则无法使用 NavigationServer2D。
zh_tw: 在 Godot 自訂編譯時若停用 3D，將無法使用 NavigationServer2D。

source: Waiting for synchronization
ga: Ag fanacht le sioncrónú
ru: Ожидание синхронизации
ta: ஒத்திசைவுக்காக காத்திருக்கிறது
uk: Очікування синхронізації
zh_cn: 等待同步
zh_tw: 等待同步

source: At the start of the game, a new scene or procedural navigation changes any path query to a NavigationServer will return empty or wrong.
ga: Ag tús an chluiche, athraíonn radharc nua nó nascleanúint nós imeachta aon cheist cosáin chuig NavigationServer fillfidh sé folamh nó mícheart.
ru: В начале игры, при появлении новой сцены или изменении процедурной навигации любой запрос пути к NavigationServer вернет пустой или неверный результат.
ta: விளையாட்டின் தொடக்கத்தில், ஒரு புதிய காட்சி அல்லது நடைமுறை வழிசெலுத்தல் எந்தவொரு பாதை வினவலையும் ஒரு ஊடுருவல் சேவையாளருக்கு மாற்றுகிறது.
uk: На початку гри нова сцена або процедурна навігація змінює будь-який запит шляху до NavigationServer, повертаючи пустий або неправильний.
zh_cn: 在游戏开始时，新场景或程序导览发生变化，对导览服务器的任何路径查询都将传回空或错误。
zh_tw: 在遊戲剛開始、新場景載入，或是程式動態變更導覽時，對 NavigationServer 發出的任何路徑查詢，可能都會回傳空值或錯誤值。

source: The navigation map is still empty or not updated at this point. All nodes from the scene tree need to first upload their navigation related data to the NavigationServer. Each added or changed map, region or agent need to be registered with the NavigationServer. Afterward the NavigationServer requires a **physics frame** for synchronization to update the maps, regions and agents.
ga: Tá an léarscáil nascleanúna fós folamh nó níl sé nuashonraithe ag an bpointe seo. Ní mór do gach nód ón gcrann radhairc a sonraí a bhaineann le nascleanúint a uaslódáil chuig an NavigationServer ar dtús. Ní mór gach léarscáil, réigiún nó gníomhaire breise nó athraithe a chlárú leis an NavigationServer. Ina dhiaidh sin tá **fráma fisice** ag teastáil ón NavigationServer le haghaidh sioncrónaithe chun na léarscáileanna, na réigiúin agus na gníomhairí a nuashonrú.
ru: На этом этапе навигационная карта всё ещё пуста или не обновлена. Все узлы дерева сцены должны сначала загрузить свои навигационные данные на NavigationServer. Каждая добавленная или изменённая карта, регион или агент должны быть зарегистрированы на NavigationServer. После этого NavigationServer потребуется **физический фрейм** для синхронизации и обновления карт, регионов и агентов.
ta: வழிசெலுத்தல் வரைபடம் இன்னும் காலியாக உள்ளது அல்லது இந்த கட்டத்தில் புதுப்பிக்கப்படவில்லை. காட்சி மரத்திலிருந்து வரும் அனைத்து முனைகளும் முதலில் தங்கள் வழிசெலுத்தல் தொடர்பான தரவை ஊடுருவல் சேவையில் பதிவேற்ற வேண்டும். ஒவ்வொன்றும் சேர்க்கப்பட்ட அல்லது மாற்றப்பட்ட வரைபடம், பகுதி அல்லது முகவர் ஊடுருவல் சேவையில் பதிவு செய்யப்பட வேண்டும். வரைபடங்கள், பகுதிகள் மற்றும் முகவர்களைப் புதுப்பிக்க ஒத்திசைவுக்கு ** இயற்பியல் சட்டகம் ** தேவைப்படுகிறது.
uk: На даний момент навігаційна карта все ще порожня або не оновлена. Усі вузли з дерева сцени повинні спочатку завантажити свої навігаційні дані на NavigationServer. Кожну додану або змінену карту, регіон або агента необхідно зареєструвати на NavigationServer. Після цього навігаційному серверу потрібен **фізичний фрейм** для синхронізації для оновлення карт, регіонів і агентів.
zh_cn: 此时导航地图仍然为空或未更新。场景树中的所有节点都需要首先将其导航相关数据上传到NavigationServer。每个添加或更改的地图、区域或代理都需要在NavigationServer中注册。之后，NavigationServer需要**物理帧**进行同步，以更新地图、区域和代理。
zh_tw: 這是因為導覽地圖此時尚未建構或尚未更新。場景樹中的所有節點都必須先把各自的導覽資料上傳到 NavigationServer，每個新增或變動的地圖、區域、代理都需要向伺服器註冊。完成後，NavigationServer 需要經過一個**物理影格**的同步流程，才能讓地圖、區域與代理的狀態正確更新。

source: One workaround is to make a deferred call to a custom setup function (so all nodes are ready). The setup function makes all the navigation changes, e.g. adding procedural stuff. Afterwards the function waits for the next physics frame before continuing with path queries.
ga: Réiteach amháin is ea glao iarchurtha a dhéanamh chuig feidhm socraithe saincheaptha (mar sin tá gach nóid réidh). Déanann an fheidhm socraithe na hathruithe nascleanúna go léir, m.sh. rudaí nós Ina dhiaidh sin fanann an fheidhm don chéad fhráma fisice eile sula leanann sé ar aghaidh le ceisteanna cosáin.
ru: Одним из обходных путей является отложенный вызов пользовательской функции настройки (чтобы все узлы были готовы). Функция настройки вносит все изменения в навигацию, например, добавляет процедурные элементы. После этого функция ожидает следующего физического кадра, прежде чем продолжить запросы пути.
ta: தனிப்பயன் அமைவு செயல்பாட்டிற்கு ஒத்திவைக்கப்பட்ட அழைப்பை உருவாக்குவது ஒரு பணித்தொகுப்பு (எனவே அனைத்து முனைகளும் தயாராக உள்ளன). அமைவு செயல்பாடு அனைத்து வழிசெலுத்தல் மாற்றங்களையும் செய்கிறது, எ.கா. நடைமுறை விசயங்களைச் சேர்ப்பது. பாதை வினவல்களுடன் தொடர்வதற்கு முன் அடுத்த இயற்பியல் சட்டத்திற்காக செயல்பாடு காத்திருக்கிறது.
uk: Один обхідний шлях полягає в тому, щоб зробити відкладений виклик спеціальної функції налаштування (щоб усі вузли були готові). Функція налаштування вносить усі зміни навігації, напр. додавання процедурних речей. Після цього функція чекає наступного фізичного кадру, перш ніж продовжити запити шляху.
zh_cn: 一种解决方法是延迟调用自定义设置函数（这样所有节点都准备好了）。设置功能进行所有导航更改，例如添加程序性内容。之后，函数在继续路径查询之前等待下一个物理帧。
zh_tw: 一種解法是使用延遲呼叫（deferred call）來執行自訂初始化函式，確保所有節點都已經準備好。在這個設定函式裡進行所有導覽相關的變更（比如新增程式產生的內容），然後等待下一個物理影格，再進行路徑查詢。

source: Server Avoidance Callbacks
ga: Glaonna Seachaint Freastalaí
ru: Обратные вызовы для избегания сервера
ta: சேவையக தவிர்ப்பு கால்பேக்குகள்
uk: Зворотні виклики для уникнення сервера
zh_cn: 服务器避障回调
zh_tw: 伺服器避障回呼

source: If RVO avoidance agents are registered for avoidance callbacks the NavigationServer dispatches their ``velocity_computed`` signals just before the PhysicsServer synchronization.
ga: Má tá gníomhairí seachanta RVO cláraithe le haghaidh aisghlaonna seachaint seolann an NavigationServer a gcomharthaí ``velocity_computed` díreach roimh shioncrónú PhysicsServer.
ru: Если агенты избегания RVO зарегистрированы для обратных вызовов избегания, NavigationServer отправляет свои сигналы ``velocity_computed`` непосредственно перед синхронизацией PhysicsServer.
ta: ஆர்.வி.ஓ தவிர்ப்பு முகவர்கள் தவிர்ப்பு கால்பேக்குகளுக்காக பதிவு செய்யப்பட்டால், இயற்பியல் சேவையக ஒத்திசைவுக்கு சற்று முன்னர் தங்கள் `` வேகம்_பக்கட்`` சமிக்ஞைகளை ஊடுருவல் சேவையகம் அனுப்புகிறது.
uk: Якщо агенти уникнення RVO зареєстровані для зворотних викликів уникнення, NavigationServer надсилає їхні сигнали ``velocity_computed`` безпосередньо перед синхронізацією PhysicsServer.
zh_cn: 如果 RVO 避障代理注册了避障回调，NavigationServer 会在 PhysicsServer 同步前发送对应的 ``velocity_computed`` 信号。
zh_tw: 如果 RVO 避障代理註冊了避障回呼，NavigationServer 會在 PhysicsServer 同步前，發出這些代理的 ``velocity_computed`` 訊號。

source: To learn more about NavigationAgents see :ref:`doc_navigation_using_navigationagents`.
ga: Chun tuilleadh a fhoghlaim faoi NavigationAgents féach: ref: `doc_navigation_using_navigationagents`.
ru: Чтобы узнать больше о NavigationAgents, см. :ref:`doc_navigation_using_navigationagents`.
ta: வழிசெலுத்தல் ஏசென்ட்களைப் பற்றி மேலும் அறிய: ref: `doc_navigation_using_navigationagents`.
uk: Щоб дізнатися більше про NavigationAgents, перегляньте :ref:`doc_navigation_using_navigationagents`.
zh_cn: 更多 NavigationAgent 相关的信息见 :ref:`doc_navigation_using_navigationagents`\ 。
zh_tw: 想進一步了解 NavigationAgent，請參閱 :ref:`doc_navigation_using_navigationagents`。

source: The simplified order of execution for NavigationAgents that use avoidance:
ga: An t-ord simplithe forghníomhaithe do NavigationAgents a úsáideann seachaint:
ru: Упрощенный порядок выполнения для NavigationAgents, использующих избегание:
ta: தவிர்ப்பதைப் பயன்படுத்தும் வழிசெலுத்தல் நிறுவனங்களுக்கான மரணதண்டனையின் எளிமைப்படுத்தப்பட்ட உத்தரவு:
uk: Спрощений порядок виконання для NavigationAgents, які використовують уникнення:
zh_cn: 使用避障的 NavigationAgent 的简化执行顺序如下：
zh_tw: 使用避障功能的 NavigationAgent 執行流程簡述如下：

source: physics frame starts.
ga: tosaíonn fráma fisice.
ru: начинается физический кадр.
ta: இயற்பியல் சட்டகம் தொடங்குகிறது.
uk: Починається фізичний кадр.
zh_cn: 物理帧开始。
zh_tw: 物理影格開始。

source: ``_physics_process(delta)``.
ga: ``_phróiseas fisiceach (delta) ``.
ta: `` _physics_process (டெல்டா) ``.
uk: ``_фізичні_процеси(delta)``.
zh_tw: 執行 ``_physics_process(delta)``。

source: ``velocity`` property is set on NavigationAgent Node.
ga: Tá maoin ``velocity`` socraithe ar Nód NavigationAgent.
ru: Свойство ``velocity`` задается в узле NavigationAgent.
ta: `` வேகம்`` சொத்து வழிசெலுத்தல் முனையில் அமைக்கப்பட்டுள்ளது.
uk: Властивість ``velocity`` встановлено на вузлі NavigationAgent.
zh_cn: 设置 NavigationAgent 节点的 ``velocity`` 属性。
zh_tw: 在 NavigationAgent 節點設置 ``velocity`` 屬性。

source: Agent sends velocity and position to NavigationServer.
ga: Seolann gníomhaire treoluas agus suíomh chuig NavigationServer.
ru: Агент отправляет скорость и положение на NavigationServer.
ta: முகவர் ஊடுருவல் சேவைக்கு வேகத்தையும் நிலையையும் அனுப்புகிறார்.
uk: Агент надсилає швидкість і положення до NavigationServer.
zh_cn: 代理向 NavigationServer 发送速度和位置。
zh_tw: 代理將速度與位置傳送給 NavigationServer。

source: NavigationServer waits for synchronization.
ga: Fanann NavigationServer le sioncrónú.
ru: NavigationServer ожидает синхронизации.
ta: ஊடுருவல் ஒத்திசைவுக்காக காத்திருக்கிறது.
uk: NavigationServer очікує на синхронізацію.
zh_cn: NavigationServer 等待同步。
zh_tw: NavigationServer 等待同步。

source: NavigationServer synchronizes and computes avoidance velocities for all registered avoidance agents.
ga: Déanann NavigationServer luasanna seachanta a shioncronú agus a ríomh do gach gníomhaire seachanta cláraithe.
ru: NavigationServer синхронизирует и вычисляет скорости избегания для всех зарегистрированных агентов избегания.
ta: பதிவுசெய்யப்பட்ட அனைத்து தவிர்ப்பு முகவர்களுக்கும் தவிர்ப்பது தவிர்க்கும் வேகங்களை ஒத்திசைத்து கணக்கிடுகிறது.
uk: NavigationServer синхронізує та обчислює швидкість уникнення для всіх зареєстрованих агентів уникнення.
zh_cn: NavigationServer 同步并为所有注册的避障代理计算避障速度。
zh_tw: NavigationServer 進行同步，並計算所有註冊避障代理的避障速度。

source: NavigationServer sends safe velocity vector with signals for each registered avoidance agents.
ga: Seolann NavigationServer veicteoir treoluas sábháilte le comharthaí do gach oibreán seachanta cláraithe.
ru: NavigationServer отправляет безопасный вектор скорости с сигналами для каждого зарегистрированного агента избегания.
ta: ஒவ்வொரு பதிவுசெய்யப்பட்ட தவிர்ப்பு முகவர்களுக்கும் சமிக்ஞைகளுடன் பாதுகாப்பான திசைவேக திசையனை AsselationServer அனுப்புகிறது.
uk: NavigationServer надсилає вектор безпечної швидкості з сигналами для кожного зареєстрованого агента уникнення.
zh_cn: NavigationServer 通过信号为每个注册的避障代理发送安全速度向量。
zh_tw: NavigationServer 會針對每個已註冊的避障代理，發送安全速度向量（safe velocity）訊號。

source: Agents receive the signal and move their parent e.g. with ``move_and_slide`` or ``linear_velocity``.
ga: Faigheann gníomhairí an comhartha agus bogann siad a dtuismitheoir m.sh. le ``move_and_slide`` nó ``linear_velocity``.
ru: Агенты получают сигнал и перемещают своего родителя, например, с помощью ``move_and_slide`` или ``linear_velocity``.
ta: முகவர்கள் சமிக்ஞையைப் பெற்று தங்கள் பெற்றோரை நகர்த்துகிறார்கள் எ.கா. `` move_and_slide`` அல்லது `` லீனியர்_வெலோசிட்டி`` உடன்.
uk: Агенти отримують сигнал і переміщують свого батька, напр. з ``move_and_slide`` або ``linear_velocity``.
zh_cn: 代理收到信号并移动父节点，例如通过 ``move_and_slide`` 或 ``linear_velocity`` 移动。
zh_tw: 代理收到訊號後，會用 ``move_and_slide`` 或 ``linear_velocity`` 等方式移動其父節點。

source: PhysicsServer synchronizes.
ga: Déanann PhysicsServer sioncrónú.
ru: PhysicsServer синхронизируется.
ta: இயற்பியல் சேவையகம் ஒத்திசைக்கிறது.
uk: PhysicsServer синхронізується.
zh_cn: PhysicsServer 同步。
zh_tw: PhysicsServer 進行同步。

source: physics frame ends.
ga: críochnaíonn fráma fisic.
ru: Физический кадр заканчивается.
ta: இயற்பியல் சட்டகம் முடிகிறது.
uk: закінчення фізики.
zh_cn: 物理帧结束。
zh_tw: 物理影格結束。

source: Therefore moving a physicsbody actor in the callback function with the safe velocity is perfectly thread- and physics-safe as all happens inside the same physics frame before the PhysicsServer commits to changes and does its own calculations.
ga: Dá bhrí sin tá aisteoir fisiceach a bhogadh sa fheidhm aisghlaonna leis an treoluas sábháilte go foirfe sábháilte - snáithe agus fisiceach mar a tharlaíonn gach rud taobh istigh den fhráma fisice céanna sula dtiomhann an PhysicsServer d'athruithe agus déanann sé a ríomhanna féin.
ru: Таким образом, перемещение субъекта physicsbody в функции обратного вызова с безопасной скоростью является абсолютно потоко- и физико-безопасным, поскольку все происходит внутри одного и того же физического кадра до того, как PhysicsServer зафиксирует изменения и выполнит собственные вычисления.
ta: ஆகவே, ஒரு இயற்பியல் பாடி நடிகரை பாதுகாப்பான வேகத்துடன் திரும்பப்பெறுதல் செயல்பாட்டில் நகர்த்துவது மிகச்சிறந்த நூல் மற்றும் இயற்பியல்-பாதுகாப்பானது, ஏனெனில் இயற்பியல் சேவையகம் மாற்றங்களைச் செய்து அதன் சொந்த கணக்கீடுகளைச் செய்வதற்கு முன்பு ஒரே இயற்பியல் சட்டகத்திற்குள் அனைத்தும் நிகழ்கின்றன.
uk: Тому переміщення актора фізичного тіла у функції зворотного виклику з безпечною швидкістю є абсолютно безпечним для потоків і фізики, оскільки все відбувається в одному фізичному кадрі до того, як PhysicsServer внесе зміни та зробить власні обчислення.
zh_cn: 因此，在回调函数中使用安全速度来移动角色物理体无论从线程还是物理的角度看都是安全的，因为相关的操作都在同一个物理帧中进行，之后 PhysicsServer 才会提交更改并进行计算。
zh_tw: 因此，在回呼函式中用安全速度（safe velocity）移動 physicsbody actor 是完全執行緒安全且物理安全的，因為這一切都發生在同一個物理影格內、PhysicsServer 正式套用所有變更與進行物理運算之前。

source: Translation status
zh_cn: 翻译状态

source: NavigationServer2D and NavigationServer3D are equivalent in functionality for their dimension.
ru: NavigationServer2D и NavigationServer3D эквивалентны по функциональности для своего измерения.
