Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_introduction_2d.po
Languages: ga, it, ja, ru, ta, uk, zh_tw

source: Links tell the pathfinding that a connection exists and at what cost. The actual agent handling and movement needs to happen in custom scripts.
ga: Insíonn naisc don lorg braite go bhfuil nasc ann agus cén costas. Caithfidh láimhseáil agus gluaiseacht iarbhír an ghníomhaire tarlú i scripteanna saincheaptha.
it: I collegamenti indicano alla ricerche che esiste una connessione e a quale costo. La gestione e lo spostamento effettivi degli agenti devono avvenire tramite script personalizzati.
ru: Ссылки сообщают системе поиска пути о наличии соединения и его стоимости. Фактическое управление агентом и его перемещение должны осуществляться в специальных скриптах.
ta: இணைப்புகள் ஒரு இணைப்பு இருப்பதாகவும், என்ன செலவில் என்றும் பாத்ஃபைண்டிங் கூறுகிறது. உண்மையான முகவர் கையாளுதல் மற்றும் இயக்கம் தனிப்பயன் ச்கிரிப்ட்களில் நடக்க வேண்டும்.
uk: Посилання повідомляють досліднику про те, що зв’язок існує та якою ціною. Фактична обробка та переміщення агента має відбуватися в спеціальних сценаріях.
zh_tw: 連結會告知尋路系統有此連接，並指定其消耗。實際的代理控制與移動需於自訂腳本處理。

source: :ref:`NavigationAgent2D<class_NavigationAgent2D>` Node
it: Node :ref:`NavigationAgent2D<class_NavigationAgent2D>`
ru: Узел :ref:`NavigationAgent2D<class_NavigationAgent2D>`
ta: :ref:`NavigationAgent2D<class_NavigationAgent2D>` கணு
zh_tw: :ref:`NavigationAgent2D<class_NavigationAgent2D>` 節點

source: A helper Node used to facilitate common NavigationServer2D API calls for pathfinding and avoidance. Use this Node with a Node2D inheriting parent Node.
ga: Éilíonn Nód cúntóra a úsáidtear chun API NavigationServer2D coitianta a éascú ar bhealach a aimsiú agus seachaint. Úsáid an Nód seo le Nód tuismitheora oidhreachta Node2D.
it: Un nodo ausiliare utilizzato per facilitare le chiamate comuni all'API del NavigationServer2D per le ricerche di percorsi e per l'evasione. Utilizza questo nodo con un nodo genitore che eredita Node2D.
ru: Вспомогательный Узел, используемый для упрощения выполнения общих вызовов API NavigationServer2D для поиска пути и обхода препятствий. Используйте этот Узел с унаследованным родительским Узлом Node2D.
ta: பொதுவான ஊடுருவல் 2 டி பநிஇ ஐ எளிதாக்குவதற்கு பயன்படுத்தப்படும் ஒரு உதவி முனை பாத்ஃபைண்டிங் மற்றும் தவிர்ப்பதற்கு அழைப்பு விடுகிறது. இந்த முனையை ஒரு Node2D மரபுரிமை பெற்றோர் முனையுடன் பயன்படுத்தவும்.
uk: Допоміжний вузол, який використовується для полегшення загальних викликів API NavigationServer2D для пошуку та уникнення. Використовуйте цей вузол із успадкованим батьківським вузлом Node2D.
zh_tw: 此輔助節點可簡化常用的 NavigationServer2D 尋路與避障 API 呼叫。請將本節點作為 Node2D 派生節點的子節點使用。

source: :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` Node
ga: :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` Nód
it: Nodo :ref:`NavigationObstacle2D<class_NavigationObstacle2D>`
ru: Узел :ref:`NavigationObstacle2D<class_NavigationObstacle2D>`
ta: :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` கணு
zh_tw: :ref:`NavigationObstacle2D<class_NavigationObstacle2D>` 節點

source: A Node that can be used to affect and constrain the avoidance velocity of avoidance enabled agents. This Node does NOT affect the pathfinding of agents. You need to change the navigation meshes for that instead.
ga: Nód is féidir a úsáid chun dul i bhfeidhm agus srian a chur ar treoluas seachanta gníomhairí cumasaithe seachanta. NÍ théann an Nód seo difear do bhealach a aimsiú gníomhairí. Ní mór duit na mogalra nascleanúna a athrú chuige sin ina ionad sin.
it: Un nodo che si può utilizzare per influenzare e limitare la velocità di evasione degli agenti abilitati all'evasione. Questo nodo NON influenza le ricerche di percorso degli agenti. Per farlo, è necessario modificare le mesh di navigazione.
ru: Узел, который можно использовать для управления и ограничения скорости уклонения агентов с включенной функцией уклонения. Этот узел НЕ влияет на поиск пути агентами. Для этого необходимо изменить навигационные сетки.
ta: தவிர்ப்பு இயக்கப்பட்ட முகவர்களின் தவிர்ப்பு வேகத்தை பாதிக்கவும் கட்டுப்படுத்தவும் பயன்படுத்தக்கூடிய ஒரு முனை. இந்த முனை முகவர்களின் பாதையை பாதிக்காது. அதற்கு பதிலாக நீங்கள் வழிசெலுத்தல் மெச்களை மாற்ற வேண்டும்.
uk: Вузол, який можна використовувати для впливу та обмеження швидкості уникнення агентів із увімкненим уникненням. Цей вузол НЕ впливає на пошук шляхів агентів. Для цього вам потрібно змінити навігаційні сітки.
zh_tw: 此節點可用來影響及限制啟用避障功能的代理的避障速度。注意：此節點**不會**影響代理的尋路，若要改變尋路必須修改導覽網格。

source: The 2D navigation meshes are defined with the following resources:
ga: Sainmhínítear na mogalra nascleanúna 2D leis na hacmhainní seo a leanas:
it: Le mesh di navigazione 2D sono definite con le seguenti risorse:
ru: 2D навигационные сетки определяются следующими ресурсами:
ta: 2 டி வழிசெலுத்தல் மெச்கள் பின்வரும் ஆதாரங்களுடன் வரையறுக்கப்படுகின்றன:
uk: Двовимірні навігаційні сітки визначаються за допомогою таких ресурсів:
zh_tw: 2D 導覽網格由下列資源定義：

source: :ref:`NavigationPolygon<class_NavigationPolygon>` Resource
ga: :ref:`NavigationPolygon<class_NavigationPolygon>` Acmhainn
it: Risorsa :ref:`NavigationPolygon<class_NavigationPolygon>`
ru: Ресурс :ref:`NavigationPolygon<class_NavigationPolygon>`
zh_tw: :ref:`NavigationPolygon<class_NavigationPolygon>` 資源

source: A resource that holds 2D navigation mesh data. It provides polygon drawing tools to allow defining navigation areas inside the Editor as well as at runtime.
ga: Acmhainn ina bhfuil sonraí mogalra nascleanúna 2D. Soláthraíonn sé uirlisí líníochta polugón chun ceantair nascleanúna a shainiú taobh istigh den Eagarthóir chomh maith le linn rith.
it: Una risorsa che contiene dati di mesh di navigazione 2D. Fornisce strumenti di disegno poligonale per definire aree di navigazione all'interno dell'Editor e in fase di esecuzione.
ru: Ресурс, содержащий данные двумерной навигационной сетки. Он предоставляет инструменты рисования полигонов, позволяющие определять области навигации как в редакторе, так и во время выполнения.
ta: 2 டி வழிசெலுத்தல் கண்ணி தரவை வைத்திருக்கும் சான்று. எடிட்டருக்குள் மற்றும் இயக்க நேரத்திலும் வழிசெலுத்தல் பகுதிகளை வரையறுக்க அனுமதிக்க இது பலகோண வரைதல் கருவிகளை வழங்குகிறது.
uk: Ресурс, який містить дані двовимірної навігаційної сітки. Він надає інструменти малювання багатокутників, які дозволяють визначати області навігації в редакторі, а також під час виконання.
zh_tw: 存放 2D 導覽網格資料的資源。提供多邊形繪製工具，可於編輯器內或執行時定義導覽區域。

source: The NavigationRegion2D Node uses this resource to define its navigation area.
ga: Úsáideann an Nód NavigationRegion2d an acmhainn seo chun a limistéar nascleanúna a shainiú.
it: Il nodo NavigationRegion2D utilizza questa risorsa per definire la propria area di navigazione.
ru: Узел NavigationRegion2D использует этот ресурс для определения своей области навигации.
ta: வழிசெலுத்தல் பிரேரியோன் 2 டி முனை இந்த வளத்தை அதன் வழிசெலுத்தல் பகுதியை வரையறுக்க பயன்படுத்துகிறது.
uk: Вузол NavigationRegion2D використовує цей ресурс для визначення своєї області навігації.
zh_tw: NavigationRegion2D 節點會使用該資源來定義其導覽區域。

source: The NavigationServer2D uses this resource to update the navigation mesh of individual regions.
ga: Úsáideann an NavigationServer2d an acmhainn seo chun mogalra nascleanúna réigiúin aonair a nuashonrú.
it: Il NavigationServer2D utilizza questa risorsa per aggiornare la mesh di navigazione delle singole regioni.
ru: NavigationServer2D использует этот ресурс для обновления навигационной сетки отдельных регионов.
ta: தனிப்பட்ட பிராந்தியங்களின் வழிசெலுத்தல் கண்ணி புதுப்பிக்க இந்த வளத்தை AssealationServer2d பயன்படுத்துகிறது.
uk: NavigationServer2D використовує цей ресурс для оновлення сітки навігації окремих регіонів.
zh_tw: NavigationServer2D 會用此資源更新各區塊的導覽網格。

source: The TileSet Editor creates and uses this resource internally when defining tile navigation areas.
ga: Cruthaíonn agus úsáideann Eagarthóir TileSet an acmhainn seo go hinmheánach nuair a bhíonn limistéir loingseoireachta tíl á sainiú.
it: L'editor di TileSet crea e utilizza questa risorsa internamente quando definisce le aree di navigazione dei tasselli.
ru: Редактор TileSet создает и использует этот ресурс внутренне при определении областей навигации плитки.
ta: ஓடு வழிசெலுத்தல் பகுதிகளை வரையறுக்கும் போது இந்த வளத்தை உள்நாட்டில் உருவாக்கி பயன்படுத்துகிறது.
uk: TileSet Editor створює та використовує цей ресурс усередині під час визначення областей навігації плиток.
zh_tw: TileSet 編輯器在定義圖塊導覽區域時，會內部建立並使用此資源。

source: You can see how 2D navigation works in action using the `2D Navigation Polygon <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation>`__ and `Grid-based Navigation with AStarGrid2D <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar>`__ demo projects.
ga: Is féidir leat a fheiceáil conas a oibríonn an loingseoireacht 2T i ngníomh ag baint úsáide as an `Polygon Nascleanúint 2D <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation>`__ agus ` Nascleanúint bunaithe ar eangach le AStarGrid2D <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar > `__ tionscadail taispeána.
it: È possibile osservare come funziona la navigazione 2D attraverso i progetti demo `2D Navigation Polygon <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation>`__ e `Grid-based Navigation with AStarGrid2D <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar>`__.
ru: Вы можете увидеть, как работает 2D-навигация в действии, с помощью демонстрационных проектов `2D Navigation Polygon <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation>`__ и `Grid-based Navigation with AStarGrid2D <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar>`__.
ta: `2 டி வழிசெலுத்தல் பலகோணத்தைப் பயன்படுத்தி 2 டி வழிசெலுத்தல் எவ்வாறு செயல்படுகிறது என்பதை நீங்கள் காணலாம் <https://github.com/godotengine/godotengine <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar> `__ டெமோ திட்டங்கள்.
uk: Ви можете побачити, як 2D-навігація працює в дії, використовуючи `2D Navigation Polygon <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation>`__ та `Grid-based Navigation with AStarGrid2D <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar>`__ демонстраційні проекти.
zh_tw: 你可以透過 `2D Navigation Polygon <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation>`__ 與 `使用 AStarGrid2D 的格狀導覽 <https://github.com/godotengine/godot-demo-projects/tree/master/2d/navigation_astar>`__ 等範例專案，實際了解 2D 導覽的運作方式。

source: Setup for 2D scene
ga: Socrú le haghaidh radharc 2D
it: Configurazione per una scena 2D
ru: Настройка для 2D-сцены
ta: 2 டி காட்சிக்கான அமைவு
uk: Налаштування для 2D сцени
zh_tw: 2D 場景設定

source: The following steps show the basic setup for minimal viable navigation in 2D. It uses the NavigationServer2D and a NavigationAgent2D for path movement.
ga: Taispeánann na céimeanna seo a leanas an socrú bunúsach le haghaidh nascleanúint inmharthana Úsáideann sé an NavigationServer2D agus NavigationAgent2D le haghaidh gluaiseacht cosáin.
it: I passaggi seguenti mostrano la configurazione di base per una navigazione minimamente praticabile in 2D. Utilizza il NavigationServer2D e un NavigationAgent2D per il movimento nel percorso.
ru: Следующие шаги демонстрируют базовую настройку минимально жизнеспособной навигации в 2D. Она использует NavigationServer2D и NavigationAgent2D для перемещения по траектории.
ta: பின்வரும் படிகள் 2D இல் குறைந்தபட்ச சாத்தியமான வழிசெலுத்தலுக்கான அடிப்படை அமைப்பைக் காட்டுகின்றன. இது பாதை இயக்கத்திற்கான AssaligationServer2d மற்றும் வழிசெலுத்தல் 2D ஐப் பயன்படுத்துகிறது.
uk: Наступні кроки показують базове налаштування для мінімальної життєздатної навігації у 2D. Він використовує NavigationServer2D і NavigationAgent2D для переміщення шляху.
zh_tw: 以下步驟說明如何建立最基本可用的 2D 導覽設定，會用到 NavigationServer2D 與 NavigationAgent2D 來進行路徑移動。

source: Add a NavigationRegion2D Node to the scene.
ga: Cuir Nód NavigationRegion2D leis an radharc.
it: Aggiungere un nodo NavigationRegion2D alla scena.
ru: Добавление к сцене Узел NavigationRegion2D.
ta: காட்சிக்கு ஒரு வழிசெலுத்தல் பிராந்திய 2 டி முனையைச் சேர்க்கவும்.
uk: Додайте до сцени вузол NavigationRegion2D.
zh_tw: 在場景中新增一個 NavigationRegion2D 節點。

source: Click on the region node and add a new NavigationPolygon Resource to the region node.
ga: Cliceáil ar an nód réigiúin agus cuir Acmhainn nua NavigationPolygon leis an nód réigiúin.
it: Cliccare sul nodo regione e aggiungere una nuova risorsa NavigationPolygon a esso.
ru: Щелкните узел региона и добавьте новый ресурс NavigationPolygon к узлу региона.
ta: பிராந்திய முனையைக் சொடுக்கு செய்து, பிராந்திய முனையில் புதிய நேவிகேசன் பேலிகான் வளத்தைச் சேர்க்கவும்.
uk: Клацніть вузол регіону та додайте новий ресурс NavigationPolygon до вузла регіону.
zh_tw: 點選該區塊節點，並新增一個 NavigationPolygon 資源至該節點。

source: Define the movable navigation area with the NavigationPolygon draw tool. Then click the :button:`Bake NavigationPolygon` button on the toolbar.
it: Definire l'area di navigazione movibile con lo strumento di disegno di NavigationPolygon. Quindi cliccare sul pulsante :button:`Bake NavigationPolygon` sulla barra degli strumenti.

source: The navigation mesh defines the area where an actor can stand and move with its center. Leave enough margin between the navigation polygon edges and collision objects to not get path following actors repeatedly stuck on collision.
ga: Sainmhíníonn an mogalra nascleanúna an limistéar inar féidir le haisteoir seasamh agus bogadh lena lár. Fág a dhóthain corrlaigh idir imill an pholagán loingseoireachta agus na réad imbhuailte ionas nach bhfaighidh tú an cosán tar éis na haisteoirí a bheith i bhfostú arís agus arís eile san imbhualadh.
it: La mesh di navigazione definisce l'area in cui un attore può posizionarsi e muoversi rispetto al suo centro. Lasciare un margine sufficiente tra i bordi del poligono di navigazione e gli oggetti di collisione per evitare che gli attori che seguono un percorso si blocchino ripetutamente nelle collisioni.
ru: Навигационная сетка определяет область, в которой актёр может стоять и двигаться, используя свой центр. Оставляйте достаточно места между краями навигационного полигона и объектами столкновений, чтобы актёры, следующие по пути, не застревали при столкновениях.
ta: வழிசெலுத்தல் கண்ணி ஒரு நடிகர் நின்று அதன் மையத்துடன் செல்லக்கூடிய பகுதியை வரையறுக்கிறது. வழிசெலுத்தல் பலகோண விளிம்புகளுக்கும் மோதல் பொருள்களுக்கும் இடையில் போதுமான விளிம்பை விட்டுச் செல்லுங்கள், தொடர்ந்து நடிகர்கள் மோதலில் சிக்கிக்கொண்டனர்.
uk: Навігаційна сітка визначає область, де актор може стояти та рухатися за допомогою свого центру. Залиште достатню межу між краями навігаційного багатокутника та об’єктами зіткнення, щоб актори, що слідують за шляхом, неодноразово застрягали під час зіткнення.
zh_tw: 導覽網格定義角色（中心點）可以站立與移動的區域。請於導覽多邊形邊緣與碰撞物件間預留足夠距離，避免路徑跟隨角色被碰撞體卡住。

source: Add a CharacterBody2D node in the scene with a basic collision shape and a sprite or mesh for visuals.
ga: Cuir nód CharacterBody2D leis sa radharc le cruth imbhuailte bunúsach agus sprite nó mogalra le haghaidh amhairc.
it: Aggiungere un nodo CharacterBody2D nella scena con una forma di collisione basilare e uno sprite o una mesh per poterlo vedere.
ru: Добавьте в сцену узел CharacterBody2D с базовой формой столкновения и спрайтом или сеткой для визуальных эффектов.
ta: ஒரு அடிப்படை மோதல் வடிவம் மற்றும் காட்சிகளுக்கு ஒரு ச்பிரிட் அல்லது கண்ணி ஆகியவற்றைக் கொண்டு காட்சியில் ஒரு எழுத்துக்குறி 2 டி முனையைச் சேர்க்கவும்.
uk: Додайте вузол CharacterBody2D у сцену з основною формою зіткнення та спрайтом або сіткою для візуальних ефектів.
zh_tw: 在場景新增 CharacterBody2D 節點，設置基本碰撞形狀與 Sprite 或 Mesh 作為顯示用。

source: Add a NavigationAgent2D node below the character node.
ga: Cuir nód NavigationAgent2d faoi bhun an nód carachtair.
it: Aggiungere un nodo NavigationAgent2D sotto il nodo CharacterBody2D.
ru: Добавьте узел NavigationAgent2D под узлом символа.
ta: எழுத்துக்குறி முனைக்கு கீழே ஒரு வழிசெலுத்தல் மேசென்ட் 2 டி முனையைச் சேர்க்கவும்.
uk: Додайте вузол NavigationAgent2D під вузлом символів.
zh_tw: 在角色節點下新增一個 NavigationAgent2D 子節點。

source: Add the following script to the CharacterBody2D node. We make sure to set a movement target after the scene has fully loaded and the NavigationServer had time to sync.
ga: Cuir an script seo a leanas leis an nód CharacterBody2D. Déanaimid cinnte sprioc gluaiseachta a shocrú tar éis don radharc a luchtú go hiomlán agus go mbeadh am ag an NavigationServer sioncrónú.
it: Aggiungiamo il seguente script al nodo CharacterBody2D. Ci assicuriamo di impostare un obiettivo di movimento dopo che la scena è stata caricata completamente e il NavigationServer ha avuto il tempo di sincronizzarsi.
ru: Добавьте следующий скрипт к узлу CharacterBody2D. Мы обязательно задаём цель движения после полной загрузки сцены и синхронизации NavigationServer.
ta: கேரக்டர் பாடி 2 டி முனையில் பின்வரும் ச்கிரிப்டைச் சேர்க்கவும். காட்சி முழுமையாக ஏற்றப்பட்டதும், ஊடுருவல் சேவையாளருக்கு ஒத்திசைக்க நேரம் இருந்தபின் ஒரு இயக்க இலக்கை அமைப்பதை உறுதிசெய்கிறோம்.
uk: Додайте наступний сценарій до вузла CharacterBody2D. Ми обов’язково встановлюємо ціль переміщення після того, як сцена повністю завантажилась і NavigationServer мав час для синхронізації.
zh_tw: 將下列腳本加入 CharacterBody2D 節點。我們會確保於場景完全載入、NavigationServer 完成同步後再設定移動目標。

source: On the first frame the NavigationServer map has not synchronized region data and any path query will return empty. Wait for the NavigationServer synchronization by awaiting one frame in the script.
ga: Ar an gcéad fhráma níl sonraí réigiúin sioncronaithe ag an léarscáil NavigationServer agus fillfidh aon cheist cosáin folamh. Fan le sioncrónú NavigationServer trí fanacht le fráma amháin sa script.
it: Nel primo frame, la mappa del NavigationServer non ha sincronizzato i dati delle regioni e qualsiasi query di percorso restituirà un valore vuoto. Attendere la sincronizzazione del NavigationServer, attendendo un frame nello script.
ru: В первом кадре карта NavigationServer не синхронизировала данные региона, и любой запрос пути вернёт пустой. Дождитесь синхронизации NavigationServer, подождав один кадр в скрипте.
ta: முதல் சட்டகத்தில் ஊடுருவல் வரைபடம் பிராந்திய தரவை ஒத்திசைக்கவில்லை மற்றும் எந்த பாதை வினவலும் காலியாக திரும்பும். ச்கிரிப்ட்டில் ஒரு சட்டகத்திற்காக காத்திருப்பதன் மூலம் ஊடுருவல் ஒத்திசைவுக்காக காத்திருங்கள்.
uk: У першому кадрі карта NavigationServer не синхронізувала дані регіону, і будь-який запит шляху буде порожнім. Зачекайте на синхронізацію NavigationServer, дочекавшись одного кадру в сценарії.
zh_tw: 在第一幀時，NavigationServer 的地圖尚未同步區域資料，此時任何路徑查詢都會回傳空結果。請於腳本中等待一幀，讓 NavigationServer 完成同步。

source: Define the movable navigation area with the NavigationPolygon draw tool. Then click the `Bake NavigationPolygon`` button on the toolbar.
ga: Sainmhínigh an limistéar nascleanúna soghluaiste leis an uirlis tarraingthe Navigation Ansin cliceáil ar an gcnaipe `Bake NavigationPolygon`` ar an uirlisí uirlisí.
ta: நகரக்கூடிய வழிசெலுத்தல் பகுதியை நேவிகேசன் பேலிகோன் டிரா கருவியுடன் வரையறுக்கவும். கருவிப்பட்டியில் `பேக் நேவிகேசன் போலிகான்`` பொத்தானைக் சொடுக்கு செய்க.
zh_tw: 使用 NavigationPolygon 繪圖工具定義可移動的導覽區域，然後在工具列點選「Bake NavigationPolygon」按鈕。

source: :ref:`AstarGrid2D<class_AstarGrid2D>`
ta: : குறிப்பு: `astargrid2d <class_astargrid2d>`
