Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/navigation/navigation_introduction_2d.po
Languages: ga, it, ja, ru, ta, uk, zh_tw

source: 2D navigation overview
ga: Forbhreathnú nascleanúna
it: Panoramica della navigazione 2D
ja: 2Dナビゲーション概要
ru: Обзор 2D-навигации
ta: 2 டி வழிசெலுத்தல் கண்ணோட்டம்
uk: Огляд двовимірної навігації
zh_tw: 2D 導覽總覽

source: Godot provides multiple objects, classes and servers to facilitate grid-based or mesh-based navigation and pathfinding for 2D and 3D games. The following section provides a quick overview over all available navigation related objects in Godot for 2D scenes and their primary use.
ga: Soláthraíonn Godot rudaí, ranganna agus freastalaithe iomadúla chun nascleanúint agus aimsiú cosáin bunaithe ar ghreille nó mogalla-bhunaithe a éascú do chluichí 2D agus 3D. Soláthraíonn an chuid seo a leanas forbhreathnú tapa ar gach rud a bhaineann le nascleanúint atá ar fáil i Godot le haghaidh radhairc 2D agus a bpríomhúsáid.
it: Godot fornisce numerosi oggetti, classi e server per facilitare la navigazione e le ricerche di percorsi basate su griglia o su mesh per i giochi 2D e 3D. La sezione seguente fornisce una rapida panoramica di tutti gli oggetti di navigazione disponibili in Godot per le scene 2D e del loro utilizzo principale.
ja: Godot は2Dと3Dについて、様々なオブジェクト、クラス、そしてサーバーをグリッドベース、もしくはメッシュベースのナビゲーションと経路探索を容易にするために提供します。以下のセクションではGodotの2Dシーンで使用できるナビゲーション関連のオブジェクトとその用途についての簡単に概説します。
ru: Godot предоставляет множество объектов, классов и серверов для упрощения навигации и поиска пути на основе сетки или сетки в 2D- и 3D-играх. В следующем разделе представлен краткий обзор всех доступных объектов навигации в Godot для 2D-сцен и их основных применений.
ta: 2D மற்றும் 3D விளையாட்டுகளுக்கான கட்டம் அடிப்படையிலான அல்லது கண்ணி அடிப்படையிலான வழிசெலுத்தல் மற்றும் பாத்ஃபைண்டிங் ஆகியவற்றை எளிதாக்க கோடோட் பல பொருள்கள், வகுப்புகள் மற்றும் சேவையகங்களை வழங்குகிறது. பின்வரும் பிரிவு 2 டி காட்சிகள் மற்றும் அவற்றின் முதன்மை பயன்பாட்டிற்கான கோடோட்டில் கிடைக்கக்கூடிய அனைத்து வழிசெலுத்தல் தொடர்பான பொருள்களையும் பற்றிய விரைவான கண்ணோட்டத்தை வழங்குகிறது.
uk: Godot надає численні об’єкти, класи та сервери для спрощення навігації на основі сітки або сітки та пошуку шляху для 2D та 3D ігор. У наступному розділі наведено короткий огляд усіх доступних навігаційних об’єктів у Godot для 2D-сцен та їх основного використання.
zh_tw: Godot 提供多種物件、類別與伺服器，協助 2D 與 3D 遊戲實作基於格狀或網格的導覽與尋路。以下將快速總覽 Godot 中所有 2D 場景可用的導覽相關物件及其主要用途。

source: Godot provides the following objects and classes for 2D navigation:
ga: Soláthraíonn Godot na rudaí agus na ranganna seo a leanas le haghaidh nascleanúint 2D:
it: Godot fornisce i seguenti oggetti e classi per la navigazione 2D:
ja: Godotは2Dナビゲーションのため、以下のオブジェクトとクラスを提供します:
ru: Godot предоставляет следующие объекты и классы для 2D-навигации:
ta: 2 டி வழிசெலுத்தலுக்கான பின்வரும் பொருள்கள் மற்றும் வகுப்புகளை கோடோட் வழங்குகிறது:
uk: Godot надає такі об’єкти та класи для двовимірної навігації:
zh_tw: Godot 提供以下物件與類別以支援 2D 導覽：

source: ``Astar2D`` objects provide an option to find the shortest path in a graph of weighted **points**.
ga: Soláthraíonn rudaí ``Astar2D`` rogha chun an cosán is giorra a aimsiú i ngraf de **pointí ualaithe **.
it: Gli oggetti ``Astar2D`` offrono l'opzione di trovare il percorso più breve in un grafico di **punti** pesati.
ja: \ ``Astar2D`` オブジェクトは、重み付き **point** のグラフの中で最短経路を見つけるオプションを提供します。
ru: Объекты ``Astar2D`` предоставляют возможность найти кратчайший путь в графе взвешенных **points (точек)**.
ta: `` Astar2d`` பொருள்கள் எடையுள்ள ** புள்ளிகள் ** இன் வரைபடத்தில் குறுகிய பாதையை கண்டுபிடிக்க ஒரு விருப்பத்தை வழங்குகின்றன.
uk: Об’єкти ``Astar2D`` надають можливість знайти найкоротший шлях у графіку зважених **точок**.
zh_tw: ``Astar2D`` 物件可在具有權重的**點**構成的圖中尋找最短路徑。

source: The AStar2D class is best suited for cell-based 2D gameplay that does not require actors to reach any possible position within an area but only predefined, distinct positions.
ga: Is é an rang AStar2D is fearr a oireann do chluiche 2D cille-bhunaithe nach n-éilíonn aisteoirí aon suíomh féideartha laistigh de limistéar a bhaint amach ach amháin suímh shainiúla réamhshainithe.
it: La classe AStar2D è più adatta al gameplay 2D basato su celle che non richiede agli attori di raggiungere qualsiasi posizione possibile all'interno di un'area, ma solo posizioni predefinite e distinte.
ja: Astar2D クラスは、エリア内の任意の位置に到達する必要がなく、あらかじめ定義された特定の位置にのみ到達するようなセルベースの2Dゲームプレイで最適です。
ru: Класс AStar2D лучше всего подходит для 2D-игры на основе ячеек, в которой от актеров не требуется достигать какой-либо возможной позиции в области, а только предопределенных, отдельных позиций.
ta: ASTAR2D வகுப்பு செல் அடிப்படையிலான 2 டி விளையாட்டுக்கு மிகவும் பொருத்தமானது, இது நடிகர்கள் ஒரு பகுதிக்குள் சாத்தியமான எந்த நிலையையும் அடைய தேவையில்லை, ஆனால் முன் வரையறுக்கப்பட்ட, தனித்துவமான நிலைகள் மட்டுமே.
uk: Клас AStar2D найкраще підходить для двовимірного геймплея на основі клітинок, який не вимагає від акторів досягнення будь-якої можливої позиції в межах області, а лише попередньо визначених, чітких позицій.
zh_tw: AStar2D 類別最適合用於格狀（儲存格）為基礎的 2D 遊戲，不需角色到達區域中任意位置，而僅需到達預先定義的特定位置。

source: ``AstarGrid2D`` is a variant of AStar2D that is specialized for partial 2D grids.
it: ``AstarGrid2D`` è una variante di AStar2D specializzata per griglie 2D parziali.
ru: ``AstarGrid2D`` — это вариант AStar2D, специализированный для частичных 2D-сеток.
ta: `` Astargrid2d`` என்பது ASTAR2D இன் மாறுபாடாகும், இது பகுதி 2D கட்டங்களுக்கு சிறப்பு வாய்ந்தது.
uk: ``AstarGrid2D`` — це варіант AStar2D, який спеціалізується на часткових 2D сітках.
zh_tw: ``AstarGrid2D`` 是 AStar2D 的變體，專為部分 2D 格狀結構（Grid）設計。

source: AstarGrid2D is simpler to use when applicable because it doesn't require you to manually create points and connect them together.
it: AstarGrid2D è più semplice da usare quando applicabile perché non richiede di creare manualmente punti e di collegarli tra loro.
ru: AstarGrid2D проще использовать, когда это применимо, поскольку не требует ручного создания точек и их соединения между собой.
ta: Astargrid2d பொருந்தும்போது பயன்படுத்த எளிதானது, ஏனெனில் நீங்கள் புள்ளிகளை கைமுறையாக உருவாக்கி அவற்றை ஒன்றாக இணைக்க தேவையில்லை.
uk: AstarGrid2D простіше у використанні, якщо це можливо, оскільки не вимагає вручну створювати точки та з’єднувати їх разом.
zh_tw: AstarGrid2D 在適用時更容易使用，因為不用手動建立點並將它們連接起來。

source: ``NavigationServer2D`` provides a powerful server API to find the shortest path between two positions on an area defined by a navigation mesh.
ga: Soláthraíonn ``NavigationServer2D`` API freastalaí cumhachtach chun an cosán is giorra idir dhá shuíomh a aimsiú ar limistéar atá sainmhínithe ag mogalra nascleanúna.
it: ``NavigationServer2D`` fornisce una potente API di server per trovare il percorso più breve tra due posizioni su un'area definita da una mesh di navigazione.
ja: \ ``NavigationServer2D`` ナビゲーションメッシュで定義されたエリア上で、2つの地点間の最短経路を見つけるための強力なAPIを提供します。
ru: ``NavigationServer2D`` предоставляет мощный серверный API для поиска кратчайшего пути между двумя позициями на области, определенной навигационной сеткой.
ta: `` Assetionationserver2d`` ஒரு வழிசெலுத்தல் கண்ணி மூலம் வரையறுக்கப்பட்ட பகுதியில் இரண்டு நிலைகளுக்கு இடையில் குறுகிய பாதையை கண்டுபிடிக்க ஒரு சக்திவாய்ந்த சேவையக பநிஇ ஐ வழங்குகிறது.
uk: ``NavigationServer2D`` надає потужний серверний API для пошуку найкоротшого шляху між двома позиціями в області, визначеній навігаційною сіткою.
zh_tw: ``NavigationServer2D`` 提供強大的伺服器 API，可在由導覽網格定義的區域中尋找兩個位置間的最短路徑。

source: The NavigationServer is best suited for 2D realtime gameplay that does require actors to reach any possible position within a navigation mesh defined area. Mesh-based navigation scales well with large game worlds as a large area can often be defined with a single polygon when it would require many, many grid cells.
ga: Is fearr a oireann an NavigationServer do gameplay fíor-ama 2D a éilíonn ar aisteoirí aon suíomh féideartha a bhaint amach laistigh de limistéar shainithe mogalra nascleanúna. Scálaíonn loingseoireacht bunaithe ar mhogalra go maith le domhan mór cluiche mar is minic gur féidir limistéar mór a shainiú le polagún amháin nuair a bheadh go leor, go leor cealla greille ag teastáil uaidh.
it: Il NavigationServer è particolarmente adatto per il gameplay 2D in tempo reale che richiede agli attori di raggiungere qualsiasi posizione possibile all'interno di un'area definita da una mesh di navigazione. La navigazione basata su mesh si adatta bene a grandi mondi di gioco, poiché un'area estesa si può spesso definire con un singolo poligono, mentre ciò richiederebbe molte, moltissime celle di griglia.
ja: NavigationServerは、ナビゲーションメッシュで定義されたエリア上で任意の地点に到達する必要があるような、2Dリアルタイムのゲームプレイに最も適しています。メッシュベースのナビゲーションは大きなゲームワールドでもよくスケールします。これは大きなエリアは非常に大量のグリッドセルを要求する場合でも、しばしば1つのポリゴンで定義されるためです。
ru: NavigationServer лучше всего подходит для двумерного игрового процесса в реальном времени, требующего от актёров достижения любой возможной позиции в области, заданной навигационной сеткой. Навигация на основе сетки хорошо масштабируется в больших игровых мирах, поскольку большую область часто можно определить одним полигоном, тогда как для этого потребовалось бы множество ячеек сетки.
ta: 2 டி ரியல் டைம் விளையாட்டுக்கு ஊடுருவல் சேவையகம் மிகவும் பொருத்தமானது, இது வழிசெலுத்தல் கண்ணி வரையறுக்கப்பட்ட பகுதிக்குள் நடிகர்கள் சாத்தியமான நிலையை அடைய வேண்டும். பெரிய விளையாட்டு உலகங்களுடன் மெச் அடிப்படையிலான வழிசெலுத்தல் அளவீடுகள் ஒரு பெரிய பகுதியாக பெரும்பாலும் ஒரு பலகோணத்துடன் வரையறுக்கப்படலாம், அதற்கு பல, பல கட்டம் செல்கள் தேவைப்படும்.
uk: NavigationServer найкраще підходить для двовимірної гри в реальному часі, яка вимагає від акторів досягнення будь-якої можливої позиції в межах визначеної навігаційною сіткою області. Навігація на основі сітки добре масштабується з великими ігровими світами, оскільки велику територію часто можна визначити за допомогою одного багатокутника, коли для цього потрібно багато, багато комірок сітки.
zh_tw: NavigationServer 最適合用於需讓角色移動至導覽網格區域內任意位置的 2D 即時遊戲。網格（Mesh）導覽適用於大型遊戲世界，因為一大片區域常可僅用單一多邊形定義，若用格子則需許多儲存格。

source: The NavigationServer holds different navigation maps that each consist of regions that hold navigation mesh data. Agents can be placed on a map for avoidance calculation. RIDs are used to reference internal maps, regions, and agents when communicating with the server.
ga: Coinníonn an NavigationServer léarscáileanna loingseoireachta éagsúla arb é atá iontu gach ceann de na réigiúin a choinníonn sonraí mogall loingseoireachta. Is féidir gníomhairí a chur ar léarscáil chun seachaint a ríomh. Úsáidtear RIDs chun tagairt a dhéanamh do léarscáileanna inmheánacha, réigiúin agus gníomhairí agus cumarsáid á déanamh leis an bhfreastalaí.
it: Il NavigationServer contiene diverse mappe di navigazione, ciascuna composta da regioni contenenti dati di mesh di navigazione. Gli agenti si possono posizionare su una mappa per i calcoli di evasione. I RID servono per fare riferimento a mappe, regioni e agenti interni quando si comunica con il server.
ja: NavigationServerは、複数のナビゲーションマップを管理しており、各マップはナビゲーションメッシュデータを保持する複数のリージョンで構成されています。回避計算のためにエージェントをマップ上に配置することができます。サーバーとの通信時には、内部のマップ、リージョン、およびエージェントを参照するために RIDが使用されます。
ru: NavigationServer хранит различные навигационные карты, каждая из которых состоит из регионов с данными навигационной сетки. Агенты могут быть размещены на карте для расчета маршрутов избегания столкновений. Идентификаторы RID используются для ссылки на внутренние карты, регионы и агентов при взаимодействии с сервером.
ta: ஊடுருவல் மெச் தரவைக் கொண்டிருக்கும் பகுதிகளைக் கொண்ட வெவ்வேறு வழிசெலுத்தல் வரைபடங்களை ஊடுருவல் வைத்திருப்பவர் வைத்திருக்கிறார். தவிர்ப்பு கணக்கீட்டிற்கு முகவர்கள் வரைபடத்தில் வைக்கப்படலாம். சேவையகத்துடன் தொடர்பு கொள்ளும்போது உள் வரைபடங்கள், பகுதிகள் மற்றும் முகவர்களைக் குறிக்க ரிட்ச் பயன்படுத்தப்படுகிறது.
uk: NavigationServer містить різні навігаційні карти, кожна з яких складається з регіонів, які містять дані навігаційної сітки. Агентів можна розмістити на карті для розрахунку уникнення. RID використовуються для посилань на внутрішні карти, регіони та агентів під час обміну даними із сервером.
zh_tw: NavigationServer 會管理多個導覽地圖，每張地圖由數個包含導覽網格資料的區域組成。代理可被放置於地圖上進行避障計算。與伺服器溝通時，會以 RID 來引用內部地圖、區域與代理。

source: The following NavigationServer RID types are available.
ga: Tá na cineálacha NavigationServer RID seo a leanas ar fáil.
it: Sono disponibili i seguenti tipi di RID per il NavigationServer.
ja: 以下のNavigationServer RIDタイプが使用可能です。
ru: Доступны следующие типы RID NavigationServer.
ta: பின்வரும் ஊடுருவல் RID வகைகள் கிடைக்கின்றன.
uk: Доступні наступні типи RID NavigationServer.
zh_tw: 可用的 NavigationServer RID 型別如下。

source: NavMap RID
it: RID di NavMap
ru: NavMap RID ((Навигационная карта RID)
zh_tw: 導覽地圖 RID

source: Reference to a specific navigation map that holds regions and agents. The map will attempt to join the navigation meshes of the regions by proximity. The map will synchronize regions and agents each physics frame.
ga: Tagairt do léarscáil loingseoireachta ar leith ina bhfuil réigiúin agus gníomhairí. Déanfaidh an léarscáil iarracht mogaill loingseoireachta na réigiún a cheangal de réir gaireachta. Sioncrónóidh an léarscáil réigiúin agus gníomhairí gach fráma fisice.
it: Riferimento a una mappa di navigazione specifica che contiene regioni e agenti. La mappa tenterà di unire le mesh di navigazione delle regioni in base alla prossimità. La mappa sincronizzerà regioni e agenti a ogni frame di fisica.
ja: リージョンやエージェントが含また特定のナビゲーションマップへの参照です。このマップは、リージョンのナビゲーションメッシュを近接性によって結合しようとします。マップは各物理フレームごとにリージョンとエージェントを同期します。
ru: Ссылка на конкретную навигационную карту, содержащую регионы и агентов. Карта будет пытаться объединить навигационные сетки регионов по близости. Карта будет синхронизировать регионы и агентов в каждом физическом кадре.
ta: பிராந்தியங்களையும் முகவர்களையும் வைத்திருக்கும் ஒரு குறிப்பிட்ட வழிசெலுத்தல் வரைபடத்தைப் பற்றிய குறிப்பு. வரைபடம் அருகாமையில் பிராந்தியங்களின் வழிசெலுத்தல் மெச்களில் சேர முயற்சிக்கும். வரைபடம் ஒவ்வொரு இயற்பியல் சட்டத்தையும் பகுதிகள் மற்றும் முகவர்களை ஒத்திசைக்கும்.
uk: Посилання на конкретну навігаційну карту, яка містить регіони та агентів. Карта намагатиметься приєднатися до навігаційних сіток регіонів за віддаленістю. Карта синхронізуватиме регіони та агентів у кожному кадрі фізики.
zh_tw: 引用特定的導覽地圖，地圖中包含區域與代理。地圖會根據區域間距離自動合併導覽網格，並於每個物理影格同步區域與代理。

source: NavRegion RID
ga: NavRéigiún RID
it: RID di NavRegion
ru: NavRegion RID (Навигационный регион RID)
zh_tw: 導覽區域 RID

source: Reference to a specific navigation region that can hold navigation mesh data. The region can be enabled / disabled or the use restricted with a navigation layer bitmask.
ga: Tagairt do réigiún nascleanúna ar leith a fhéadann sonraí mogalra nascleanúna a choinneáil Is féidir an réigiún a chumasú/a dhíchumasú nó an úsáid a theorannú le giotmask ciseal nascleanúna.
it: Riferimento a una specifica regione di navigazione che può contenere dati di mesh di navigazione. La regione si può abilitare/disabilitare o il suo utilizzo si può limitare con una maschera di bit di strati di navigazione.
ru: Ссылка на конкретную навигационную область, которая может содержать данные навигационной сетки. Область можно включить/отключить или ограничить её использование с помощью битовой маски навигационного слоя.
ta: வழிசெலுத்தல் கண்ணி தரவை வைத்திருக்கக்கூடிய ஒரு குறிப்பிட்ட வழிசெலுத்தல் பிராந்தியத்தைப் பற்றிய குறிப்பு. பிராந்தியத்தை இயக்கலாம் / முடக்கலாம் அல்லது வழிசெலுத்தல் அடுக்கு பிட்மாச்க் மூலம் தடைசெய்யப்பட்ட பயன்பாடு.
uk: Посилання на певну область навігації, яка може містити дані сітки навігації. Регіон можна ввімкнути/вимкнути або обмежити використання за допомогою бітової маски шару навігації.
zh_tw: 引用特定導覽區域，該區域可存放導覽網格資料。可啟用或停用區域，並可用導覽層（navigation layer）位元遮罩限制其用途。

source: NavLink RID
it: RID di NavLink
ru: NavLink RID (Навигационная ссылка RID)
zh_tw: 導覽連結 RID

source: Reference to a specific navigation link that connects two navigation mesh positions over arbitrary distances.
ga: Tagairt do nasc sonrach loingseoireachta a nascann dhá shuíomh mogaill loingseoireachta thar achair threallacha.
it: Riferimento a un collegamento di navigazione specifico che collega due posizioni di mesh di navigazione su distanze arbitrarie.
ru: Ссылка на конкретную навигационную ссылку, которая соединяет две позиции навигационной сетки на произвольных расстояниях.
ta: தன்னிச்சையான தூரங்களுக்கு மேல் இரண்டு வழிசெலுத்தல் கண்ணி நிலைகளை இணைக்கும் ஒரு குறிப்பிட்ட வழிசெலுத்தல் இணைப்பைக் குறிப்பு.
uk: Посилання на конкретне навігаційне посилання, яке з’єднує дві позиції навігаційної сітки на довільних відстанях.
zh_tw: 引用特定導覽連結，可連接導覽網格上兩個任意距離的位置。

source: NavAgent RID
it: RID di NavAgent
ru: NavAgent RID (Навигационный агент RID)
zh_tw: 導覽代理 RID

source: Reference to a specific avoidance agent. The avoidance is specified by a radius value.
ga: Tagairt do ghníomhaire seachanta ar leith. Sonraítear an seachaint le luach raidise.
it: Riferimento a uno specifico agente di evasione. L'evasione è specificata da un valore di raggio.
ru: Ссылка на конкретный агент избегания. Избегание определяется значением радиуса.
ta: ஒரு குறிப்பிட்ட தவிர்ப்பு முகவருக்கு குறிப்பு. தவிர்ப்பு ஒரு ஆரம் மதிப்பால் குறிப்பிடப்படுகிறது.
uk: Посилання на конкретного агента уникнення. Уникнення визначається значенням радіуса.
zh_tw: 引用特定避障代理。避障效果可透過半徑值設定。

source: NavObstacle RID
it: RID NavObstacle
ta: நாவ் தடையாக சவாரி
zh_tw: 導覽障礙 RID

source: Reference to a specific avoidance obstacle used to affect and constrain the avoidance velocity of agents.
ga: Tagairt do chonaic seachanta ar leith a úsáidtear chun dul i bhfeidhm agus srian a chur ar treoluas seachanta gníomhairí.
it: Riferimento a uno specifico ostacolo di evasione utilizzato per influenzare e limitare le velocità di evasione degli agenti.
ru: Ссылка на конкретное препятствие избегания, используемое для воздействия и ограничения скорости избегания агентов.
ta: முகவர்களின் தவிர்ப்பு வேகத்தை பாதிக்கவும் கட்டுப்படுத்தவும் பயன்படுத்தப்படும் ஒரு குறிப்பிட்ட தவிர்ப்பு தடையைப் பற்றிய குறிப்பு.
uk: Посилання на конкретну перешкоду для уникнення, що використовується для впливу та обмеження швидкості уникнення агентів.
zh_tw: 引用特定避障障礙，可用來影響及限制代理的避障速度。

source: The following scene tree nodes are available as helpers to work with the NavigationServer2D API.
ga: Tá na nóid crann radhairc seo a leanas ar fáil mar chúntóirí chun oibriú leis an API NavigationServer2D.
it: I seguenti nodi dell'albero di scene sono disponibili come supporto per lavorare con l'API del NavigationServer2D.
ru: Следующие узлы дерева сцены доступны в качестве вспомогательных средств для работы с API NavigationServer2D.
ta: பின்வரும் காட்சி மர முனைகள் AssealationServer2d பநிஇ உடன் பணிபுரிய உதவியாளர்களாக கிடைக்கின்றன.
uk: Наступні вузли дерева сцен доступні як допоміжні для роботи з NavigationServer2D API.
zh_tw: 以下場景樹節點可作為輔助元件，協助操作 NavigationServer2D API。

source: :ref:`NavigationRegion2D<class_NavigationRegion2D>` Node
it: Nodo :ref:`NavigationRegion2D<class_NavigationRegion2D>`
ru: Узел :ref:`NavigationRegion2D<class_NavigationRegion2D>`
ta: :ref:`NavigationRegion2D<class_NavigationRegion2D>` கணு
zh_tw: :ref:`NavigationRegion2D<class_NavigationRegion2D>` 節點

source: A Node that holds a NavigationPolygon resource that defines a navigation mesh for the NavigationServer2D.
ga: Nód a bhfuil acmhainn NavigationPolygon ina shainmhíníonn mogalra nascleanúna don NavigationServer2d.
it: Un nodo che contiene una risorsa NavigationPolygon che definisce una mesh di navigazione per il NavigationServer2D.
ru: Узел, содержащий ресурс NavigationPolygon, который определяет навигационную сетку для NavigationServer2D.
ta: AsselactionServer2d க்கான வழிசெலுத்தல் கண்ணி வரையறுக்கும் ஒரு நேவிகேசன் போலிகான் வளத்தை வைத்திருக்கும் ஒரு முனை.
uk: Вузол, який містить ресурс NavigationPolygon, який визначає навігаційну сітку для NavigationServer2D.
zh_tw: 此節點持有 NavigationPolygon 資源，定義供 NavigationServer2D 使用的導覽網格。

source: The region can be enabled / disabled.
ga: Is féidir an réigiún a chumasú/a mhíchumasú.
it: La regione può essere abilitata/disabilitata.
ru: Регион можно включить/отключить.
ta: இப்பகுதியை இயக்கலாம் / முடக்கலாம்.
uk: Регіон можна включити / вимкнути.
zh_tw: 區域可設為啟用或停用。

source: The use in pathfinding can be further restricted through the ``navigation_layers`` bitmask.
ga: Is féidir srian tuilleadh a dhéanamh ar an úsáid i bhfionnacht cosáin tríd an giotmask ``navigation_layers`.
it: L'uso nelle ricerche di percorsi può essere ulteriormente limitato tramite la maschera di bit ``navigation_layers``.
ru: Использование при поиске пути можно дополнительно ограничить с помощью битовой маски ``navigation_layers``.
ta: பாத்ஃபைண்டிங் பயன்பாட்டை `` வழிசெலுத்தல்_லேயர்கள்` `பிட்மாச்க் மூலம் மேலும் கட்டுப்படுத்தலாம்.
uk: Використання для пошуку шляху може бути додатково обмежено за допомогою бітової маски ``navigation_layers``.
zh_tw: 可透過 ``navigation_layers`` 位元遮罩進一步限制其在尋路時的用途。

source: The NavigationServer2D will join the navigation meshes of regions by proximity for a combined navigation mesh.
ga: Beidh an NavigationServer2d isteach le mogalra loingseoireachta na réigiúin de réir gaireachta le haghaidh mogalra nascleanúna comhcheangailte.
it: Il NavigationServer2D unirà le mesh di navigazione delle regioni in base alla prossimità per una mesh di navigazione combinata.
ru: NavigationServer2D объединит навигационные сетки регионов по близости для создания объединенной навигационной сетки.
ta: ஊடுருவல் சேவையக 2 டி ஒருங்கிணைந்த வழிசெலுத்தல் கண்ணி அருகாமையில் பிராந்தியங்களின் வழிசெலுத்தல் மெச்களில் சேரும்.
uk: NavigationServer2D об’єднає навігаційні сітки регіонів за близькістю для комбінованої навігаційної сітки.
zh_tw: NavigationServer2D 會根據區塊間的距離，自動將不同區塊的導覽網格合併為一個整體導覽網格。

source: :ref:`NavigationLink2D<class_NavigationLink2D>` Node
it: Node :ref:`NavigationLink2D<class_NavigationLink2D>`
ru: Узел :ref:`NavigationLink2D<class_NavigationLink2D>`
ta: :ref:`NavigationLink2D<class_NavigationLink2D>` கணு
zh_tw: :ref:`NavigationLink2D<class_NavigationLink2D>` 節點

source: A Node that connects two positions on navigation meshes over arbitrary distances for pathfinding.
ga: Nód a nascann dhá shuíomh ar mogalra nascleanúna thar achair treallach chun cosán a aimsiú.
it: Un nodo che collega due posizioni su mesh di navigazione su distanze arbitrarie per le ricerche di percorsi.
ru: Узел, соединяющий две позиции на навигационных сетках на произвольных расстояниях для поиска пути.
ta: வழிசெலுத்தல் குறித்த இரண்டு நிலைகளை இணைக்கும் ஒரு முனை பாத்ஃபிண்ட்டிற்கான தன்னிச்சையான தூரங்களுக்கு மேல் மெச்கள்.
uk: Вузол, який з’єднує дві позиції на навігаційних сітках на довільних відстанях для пошуку шляху.
zh_tw: 此節點可連接導覽網格上兩個任意距離的位置，供尋路使用。

source: The link can be enabled / disabled.
ga: Is féidir an nasc a chumasú/díchumasú.
it: Il collegamento può essere abilitato/disabilitato.
ru: Ссылку можно включить/отключить.
ta: இணைப்பை இயக்கலாம் / முடக்கலாம்.
uk: Посилання можна включити/вимкнути.
zh_tw: 連結可設為啟用或停用。

source: The link can be made one-way or bidirectional.
ga: Is féidir an nasc a dhéanamh aon bhealach nó déthreorach.
it: Il collegamento può essere unidirezionale o bidirezionale.
ru: Связь может быть односторонней или двунаправленной.
ta: இணைப்பை ஒரு வழி அல்லது இருதரப்பு செய்ய முடியும்.
uk: Посилання можна зробити одностороннім або двонаправленим.
zh_tw: 連結可設為單向或雙向。
