Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_library.po
Languages: ga, it, ru, ta, uk, zh_cn, zh_tw

source: While the app is running on device, you can check `Android logcat <https://developer.android.com/studio/debug/logcat>`_ to investigate any errors or crashes.
ga: Cé go bhfuil an aip ag rith ar ghléas, is féidir leat `Android logcat <https://developer.android.com/studio/debug/logcat>`_ a sheiceáil chun aon earráidí nó tuairteanna a fhiosrú.
ru: Пока приложение работает на устройстве, вы можете проверить `Android logcat <https://developer.android.com/studio/debug/logcat>`_, чтобы исследовать любые ошибки или сбои.
ta: பயன்பாடு சாதனத்தில் இயங்கும்போது, ஏதேனும் பிழைகள் அல்லது செயலிழப்புகளை விசாரிக்க `Android logCat <https://developer.android.com/studio/dudio/debug/logcat> _ _ சரிபார்க்கலாம்.
uk: Коли програма працює на пристрої, ви можете перевірити `Android logcat <https://developer.android.com/studio/debug/logcat>`_, щоб дослідити будь-які помилки чи збої.
zh_cn: 应用在设备上运行时，你可以通过 `Android logcat <https://developer.android.com/studio/debug/logcat>`_ 来调查报错和崩溃的情况。
zh_tw: App 執行期間，可透過 `Android logcat <https://developer.android.com/studio/debug/logcat>`_ 檢查錯誤或當機資訊。

source: For reference, check the `build and install instructions <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ for the GLTF Viewer sample app.
ga: Le haghaidh tagartha, seiceáil na treoracha `tóg agus suiteáil <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ don aip shamplach GLTF Viewer.
ru: Для справки ознакомьтесь с `инструкциями по сборке и установке <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ для примера приложения GLTF Viewer.
ta: குறிப்புக்கு, `வழிமுறைகளை உருவாக்கி நிறுவவும் <https://github.com/m4gr3d/godot-android-samples/blob/master/apps/gltf_viewer/readme.md>` _ _ _.
uk: Для довідки перегляньте `інструкції зі збирання та встановлення <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ прикладу програми GLTF Viewer.
zh_cn: 作为参考，你可以查看一下 GLTF 查看器示例应用的\ `构建和安装步骤 <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_\ 。
zh_tw: 可參考 GLTF Viewer 範例的 `建置與安裝說明 <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_。
