Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_plugin.po
Languages: ga, it, ru, ta, uk, zh_hans, zh_tw

source: Godot Android plugins
ga: Breiseáin Godot Android
it: Estensioni Android di Godot
ru: Плагины Godot для Android
ta: கோடோட் ஆண்ட்ராய்டு செருகுநிரல்கள்
uk: Плагіни Godot для Android
zh_hans: Godot Android 插件
zh_tw: Godot Android 外掛

source: Introduction
ga: Réamhrá
it: Introduzione
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_hans: 前言
zh_tw: 前言

source: Android plugins are powerful tools to extend the capabilities of the Godot engine by tapping into the functionality provided by Android platforms and ecosystem.
ga: Is uirlisí cumhachtacha iad breiseáin Android chun cumais inneall Godot a leathnú trí thapáil ar an bhfeidhmiúlacht a sholáthraíonn ardáin agus éiceachóras Android.
ru: Плагины Android — это мощные инструменты для расширения возможностей движка Godot путем использования функциональных возможностей, предоставляемых платформами и экосистемой Android.
ta: ஆண்ட்ராய்டு இயங்குதளங்கள் மற்றும் சுற்றுச்சூழல் அமைப்பு வழங்கிய செயல்பாட்டைத் தட்டுவதன் மூலம் கோடோட் இயந்திரத்தின் திறன்களை விரிவுபடுத்துவதற்கான சக்திவாய்ந்த கருவிகள் ஆண்ட்ராய்டு செருகுநிரல்கள்.
uk: Плагіни Android — це потужні інструменти для розширення можливостей механізму Godot за допомогою функціональних можливостей платформ і екосистеми Android.
zh_hans: Android 插件能够利用 Android 平台及其生态系统所提供的功能来扩展 Godot 引擎的功能，是一种强大工具。
zh_tw: Android 外掛是強大工具，可以透過存取 Android 平台與生態系統所提供的功能，來擴展 Godot 引擎的能力。

source: For example in Godot 4, Android plugins are used to support multiple Android-based XR platforms without encumbering the core codebase with vendor specific code or binaries.
ga: Mar shampla i Godot 4, úsáidtear breiseáin Android chun tacú le go leor ardáin XR atá bunaithe ar Android-bhunaithe gan an croí-chód a chur faoi ualach le cód nó dénártha sonrach don díoltóir.
ru: Например, в Godot 4 плагины Android используются для поддержки нескольких XR-платформ на базе Android, не перегружая основную кодовую базу кодом или двоичными файлами, специфичными для конкретного поставщика.
ta: எடுத்துக்காட்டாக, கோடோட் 4 இல், விற்பனையாளர் குறிப்பிட்ட குறியீடு அல்லது பைனரிகளுடன் கோர் கோட்பேசை இணைக்காமல் பல ஆண்ட்ராய்டு அடிப்படையிலான எக்ச்ஆர் இயங்குதளங்களை ஆதரிக்க ஆண்ட்ராய்டு செருகுநிரல்கள் பயன்படுத்தப்படுகின்றன.
uk: Наприклад, у Godot 4 плагіни Android використовуються для підтримки кількох платформ XR на базі Android, не обтяжуючи основну кодову базу кодом або двійковими файлами постачальника.
zh_hans: 例如在 Godot 4 中，不少基于 Android 的 XR 平台就是通过 Android 插件来支持的，无需在核心代码中增加供应商专用代码和二进制文件。
zh_tw: 舉例來說，在 Godot 4 中，Android 外掛被用來支援多種基於 Android 的 XR 平台，且無需將特定廠商的程式碼或二進位檔案混入核心程式碼庫。

source: Android plugin
ga: Breiseán Android
it: Plugin Android
ru: Android плагин
ta: ஆண்ட்ராய்டு சொருகி
uk: Плагін для Android
zh_hans: Android 插件
zh_tw: Android 外掛

source: **Version 1 (v1)** of the Android plugin system was introduced in Godot 3 and compatible with Godot 4.0 and 4.1. That version allowed developers to augment the Godot engine with Java, Kotlin and native functionality.
ga: **Tugadh leagan 1 (v1) ** den chóras breiseán Android isteach i Godot 3 agus tá sé comhoiriúnach le Godot 4.0 agus 4.1. Lig an leagan sin d'fhorbróirí inneall Godot a mhéadú le Java, Kotlin agus feidhmiúlacht dhúchasach.
ru: **Version 1 (v1)** системы плагинов Android была представлена в Godot 3 и совместима с Godot 4.0 и 4.1. Эта версия позволила разработчикам дополнить движок Godot функциями Java, Kotlin и нативными функциями.
ta: ** ஆண்ட்ராய்டு சொருகி அமைப்பின் பதிப்பு 1 (வி 1) ** கோடோட் 3 இல் அறிமுகப்படுத்தப்பட்டது மற்றும் கோடோட் 4.0 மற்றும் 4.1 உடன் இணக்கமானது. அந்த பதிப்பு டெவலப்பர்களை சாவா, கோட்லின் மற்றும் சொந்த செயல்பாட்டுடன் கோடோட் இயந்திரத்தை அதிகரிக்க அனுமதித்தது.
uk: **Версія 1 (v1)** системи плагінів Android була представлена в Godot 3 і сумісна з Godot 4.0 і 4.1. Ця версія дозволила розробникам розширити движок Godot за допомогою Java, Kotlin і нативної функціональності.
zh_hans: Android 插件系统的\ **第一版（v1）**\ 是在 Godot 3 中引入的，与 Godot 4.0 和 4.1 兼容。这个版本能够让开发者使用 Java、Kotlin 和原生功能增强 Godot 引擎。
zh_tw: Android 外掛系統的 **第一版 (v1)** 最早於 Godot 3 推出，並相容於 Godot 4.0 和 4.1。這個版本允許開發者用 Java、Kotlin 及原生功能來擴充 Godot 引擎。

source: Starting in Godot 4.2, Android plugins built on the v1 architecture are now deprecated. Instead, Godot 4.2 introduces a new **Version 2 (v2)** architecture for Android plugins.
ga: Ag tosú i Godot 4.2, tá breiseáin Android tógtha ar an ailtireacht v1 díscothaithe anois. Ina áit sin, tugann Godot 4.2 ailtireacht nua **Leagan 2 (v2) ** isteach do bhreiseáin Android.
ru: Начиная с Godot 4.2, плагины для Android, основанные на архитектуре v1, объявлены устаревшими. Вместо этого в Godot 4.2 представлена новая архитектура **Version 2 (v2)** для плагинов Android.
ta: கோடோட் 4.2 இல் தொடங்கி, வி 1 கட்டிடக்கலையில் கட்டப்பட்ட ஆண்ட்ராய்டு செருகுநிரல்கள் இப்போது நீக்கப்பட்டன. அதற்கு பதிலாக, கோடோட் 4.2 ஆண்ட்ராய்டு செருகுநிரல்களுக்கான புதிய ** பதிப்பு 2 (வி 2) ** கட்டமைப்பை அறிமுகப்படுத்துகிறது.
uk: Починаючи з Godot 4.2, плагіни Android, побудовані на архітектурі v1, більше не підтримуються. Натомість Godot 4.2 представляє нову архітектуру **версії 2 (v2)** для плагінів Android.
zh_hans: 使用 v1 架构构建的 Android 插件已从 Godot 4.2 开始弃用。Godot 4.2 为 Android 插件引入了全新的\ **第二版（v2）**\ 架构。
zh_tw: 從 Godot 4.2 起，以 v1 架構建立的 Android 外掛已經被棄用。Godot 4.2 引入了全新的 **第二版 (v2)** Android 外掛架構。

source: v2 Architecture
ga: ailtireacht v2
it: Architettura v2
ru: v2 Архитектура
ta: வி 2 கட்டிடக்கலை
uk: v2 Архітектура
zh_hans: v2 架构
zh_tw: v2 架構

source: Godot Android plugin leverages the :ref:`Gradle build system <doc_android_gradle_build>`.
ga: Úsáideann breiseán Godot Android an :ref:`córas tógála gradle <doc_android_gradle_build>`.
ru: Плагин Godot для Android использует :ref:`Gradle build system <doc_android_gradle_build>`.
ta: கோடோட் ஆண்ட்ராய்டு செருகுநிரல்: Ref: `கிரேடில் உருவாக்க அமைப்பு <doc_android_gradle_build>`.
uk: Плагін Godot для Android використовує :ref:`Gradle build system <doc_android_gradle_build>`.
zh_hans: Godot Android 插件使用 :ref:`Gradle 构建系统 <doc_android_gradle_build>`\ 。
zh_tw: Godot Android 外掛採用 :ref:`Gradle 建構系統 <doc_android_gradle_build>`。

source: Building on the previous v1 architecture, Android plugins continue to be derived from the `Android archive library <https://developer.android.com/studio/projects/android-library#aar-contents>`_.
ga: Ag tógáil ar an ailtireacht v1 roimhe seo, leanann forlíontáin Android le díorthú ó leabharlann cartlainne `Android <https://developer.android.com/studio/projects/android-library#aar-contents>`_.
ru: Плагины Android, созданные на основе предыдущей архитектуры v1, по-прежнему создаются на основе `библиотеки архива Android <https://developer.android.com/studio/projects/android-library#aar-contents>`_.
ta: முந்தைய வி 1 கட்டமைப்பை உருவாக்கி, ஆண்ட்ராய்டு செருகுநிரல்கள் `ஆண்ட்ராய்டு காப்பக நூலகம் <https://developer.android.com/studio/projects/android-libribrary#aar- உள்ளடக்கங்கள்>` _ ஆகியவற்றிலிருந்து தொடர்ந்து பெறப்படுகின்றன.
uk: Спираючись на попередню архітектуру v1, плагіни Android продовжують походити з `бібліотеки архівів Android <https://developer.android.com/studio/projects/android-library#aar-contents>`_.
zh_hans: 与之前的 v1 架构一样，Android 插件仍然是基于 `Android 归档库 <https://developer.android.com/studio/projects/android-library#aar-contents>`_\ 的。
zh_tw: 延續 v1 架構，Android 外掛依然基於 `Android 歸檔庫 <https://developer.android.com/studio/projects/android-library#aar-contents>`_ （AAR 檔案）。

source: At its core, a Godot Android plugin v2 is an Android library with a dependency on the :ref:`Godot Android library <doc_android_library>`, and a custom Android library manifest.
ga: Ag a chroílár, is leabharlann Android é breiseán Godot Android v2 a bhraitheann ar an :ref:`leabharlann Android Godot <doc_android_library>`, agus léiriú ar leabharlann saincheaptha Android.
ru: По своей сути плагин Godot Android v2 представляет собой библиотеку Android с зависимостью от :ref:`Godot Android library <doc_android_library>` и пользовательского манифеста библиотеки Android.
ta: அதன் மையத்தில், ஒரு கோடோட் ஆண்ட்ராய்டு செருகுநிரல் வி 2 என்பது ஒரு ஆண்ட்ராய்டு நூலகமாகும்: குறிப்பு: ref: `கோடோட் ஆண்ட்ராய்டு நூலகம் <doc_android_library>`, மற்றும் தனிப்பயன் ஆண்ட்ராய்டு நூலக வெளிப்பாடு.
uk: За своєю суттю плагін Godot Android v2 — це бібліотека Android із залежністю від :ref:`Godot Android library <doc_android_library>` та спеціального маніфесту бібліотеки Android.
zh_hans: Godot Android 插件 v2 的本质仍然是一个 Android 库，依赖于 :ref:`Godot Android 库 <doc_android_library>`\ 和自定义的 Android 库说明文件。
zh_tw: 根本上，Godot Android 外掛 v2 是一個依賴 :ref:`Godot Android 函式庫 <doc_android_library>` 的 Android 函式庫，並且包含自訂的 Android 函式庫資訊清單（manifest）。

source: This architecture allows Android plugins to extend the functionality of the engine with:
ga: Ligeann an ailtireacht seo breiseáin Android feidhmiúlacht an innill a leathnú le:
it: Questa architettura consente ai plugin di Android di estendere le funzionalità del motore con:
ru: Такая архитектура позволяет плагинам Android расширять функциональность движка с помощью:
ta: இந்த கட்டமைப்பு ஆண்ட்ராய்டு செருகுநிரல்களை இயந்திரத்தின் செயல்பாட்டை நீட்டிக்க அனுமதிக்கிறது:
uk: Ця архітектура дозволяє плагінам Android розширювати функціональні можливості двигуна за допомогою:
zh_hans: 这个架构能够让 Android 插件通过以下方法扩展功能：
zh_tw: 這種架構讓 Android 外掛可以用下列方式擴充引擎功能：

source: Android platform APIs
ga: APIs ardán Android
it: API della piattaforma Android
ru: API-ы платформы Android
ta: ஆண்ட்ராய்டு இயங்குதள பநிஇ கள்
uk: API платформи Android
zh_hans: Android 平台 API
zh_tw: Android 平台 API

source: Android libraries
ga: Leabharlanna Android
it: Librerie Android
ru: Android библиотеки
ta: ஆண்ட்ராய்டு நூலகங்கள்
uk: Бібліотеки Android
zh_hans: Android 库
zh_tw: Android 函式庫

source: Kotlin and Java libraries
ga: Leabharlanna Kotlin agus Java
it: Librerie di Java e Kotlin
ru: Kotlin и Java библиотеки
ta: கோட்லின் மற்றும் சாவா நூலகங்கள்
uk: Бібліотеки Kotlin і Java
zh_hans: Kotlin 和 Java 库
zh_tw: Kotlin 與 Java 函式庫

source: Native libraries (via JNI)
ga: Leabharlanna dúchasacha (trí JNI)
it: Librerie native (tramite JNI)
ru: Нативные библиотеки (через JNI)
ta: சொந்த நூலகங்கள் (சே.என்.ஐ வழியாக)
uk: Власні бібліотеки (через JNI)
zh_hans: 原生库（通过 JNI）
zh_tw: 原生函式庫（透過 JNI）

source: GDExtension libraries
ga: Leabharlanna GDExtension
it: Librerie GDExtension
ru: Библиотеки GDExtension
ta: Gdextension நூலகங்கள்
uk: Бібліотеки GDExtension
zh_hans: GDExtension 库
zh_tw: GDExtension 函式庫

source: Each plugin has an init class extending from the `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_ class which is provided by the :ref:`Godot Android library <doc_android_library>`.
ga: Tá rang init ag gach breiseán a shíneann ón `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/orggod/Pgodot. L80> `_ rang a sholáthraíonn an :ref:`leabharlann Android Godot <doc_android_library>`.
ru: Каждый плагин имеет класс init, расширяющийся от класса `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_, который предоставляется :ref:`Godot Android library <doc_android_library>`.
ta: ஒவ்வொரு சொருகி ஒரு தொடக்க வகுப்பைக் கொண்டுள்ளது. சாவா# L80> `_ வகுப்பு வழங்கிய வகுப்பு: ref:` கோடோட் ஆண்ட்ராய்டு நூலகம் <doc_android_library> `.
uk: Кожен плагін має клас ініціалізації, що походить від `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_ класу, який надається :ref:`Godot Android library <doc_android_library>`.
zh_hans: 每个插件都有一个从 `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_ 类扩展而来的 init 类，该类由 :ref:`Godot Android 库 <doc_android_library>` 提供。
zh_tw: 每個外掛都必須有一個繼承自 `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_ 類別的初始化類別，該類別由 :ref:`Godot Android 函式庫 <doc_android_library>` 提供。

source: The ``GodotPlugin`` class provides APIs to access the running Godot instance and hook into its lifecycle. It is loaded at runtime by the Godot engine.
ga: Soláthraíonn an rang ``GodotPlugin` APIs chun rochtain a fháil ar an gcás Godot atá ag rith agus chun a shaolré a chur isteach. Tá sé luchtaithe ag am rith ag inneall Godot.
ru: Класс ``GodotPlugin`` предоставляет API для доступа к запущенному экземпляру Godot и подключения к его жизненному циклу. Он загружается во время выполнения движком Godot.
ta: `` கோடோட்ப்ளூசின்`` வகுப்பு பநிஇ களை இயங்கும் கோடோட் நிகழ்வை அணுகவும் அதன் வாழ்க்கைச் சுழற்சியில் இணைந்ததாகவும் வழங்குகிறது. இது கோடோட் எஞ்சின் இயக்க நேரத்தில் ஏற்றப்படுகிறது.
uk: Клас ``GodotPlugin`` надає API для доступу до запущеного екземпляра Godot і підключення до його життєвого циклу. Він завантажується під час виконання за допомогою механізму Godot.
zh_hans: ``GodotPlugin`` 类提供了访问运行中的Godot实例以及添加钩子到其生命周期。它在运行时由 Godot 引擎加载。
zh_tw: ``GodotPlugin`` 類別提供 API 來存取執行中的 Godot 實例，並可掛勾其生命週期。該類別會於執行時由 Godot 引擎載入。

source: v2 Packaging format
ga: Formáid Pacáistiú v2
ru: Формат упаковки v2
ta: வி 2 பேக்கேசிங் வடிவம்
uk: Формат упаковки v2
zh_hans: v2 打包格式
zh_tw: v2 封裝格式

source: v1 Android plugins required a custom ``gdap`` configuration file that was used by the Godot Editor to detect and load them. However this approach had several drawbacks, primary ones being that it lacked flexibility and departed from the `existing Godot EditorExportPlugin format, delivery and installation flow <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/installing_plugins.html>`_.
ga: Bhí comhad cumraíochta saincheaptha `` gdap`` ag teastáil ó fhorlíontáin Android v1 a d'úsáid Eagarthóir Godot chun iad a bhrath agus a luchtú. Bhí go leor míbhuntáistí ag baint leis an gcur chuige seo, áfach, is iad na príomhchinn a bhí ann ná go raibh easpa solúbthachta ann agus gur imigh sé ó fhormáid, seachadadh agus sreabhadh suiteála Godot EditorExportPlugin a bhí ann <https://docs.godotenginine.org/en/stable/tutorials/plugins/editor/installing_plugins .html>`_.
ru: Для плагинов Android версии v1 требовался специальный конфигурационный файл ``gdap``, который Godot Editor использовал для их обнаружения и загрузки. Однако этот подход имел ряд недостатков, главными из которых были недостаточная гибкость и отход от `существующего формата Godot EditorExportPlugin, процесса доставки и установки <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/installing_plugins.html>`_.
ta: வி 1 ஆண்ட்ராய்டு செருகுநிரல்களுக்கு தனிப்பயன் `` சி.டி.ஏ.பி` உள்ளமைவு கோப்பு தேவைப்பட்டது, அவற்றைக் கண்டறிந்து ஏற்ற கோடோட் எடிட்டரால் பயன்படுத்தப்பட்டது. எவ்வாறாயினும், இந்த அணுகுமுறை பல குறைபாடுகளைக் கொண்டிருந்தது, முதன்மையானது நெகிழ்வுத்தன்மையைக் கொண்டிருக்கவில்லை மற்றும் `தற்போதுள்ள கோடோட் எடிட்டர் எக்ச்போர்ட் பிளூகின் வடிவம், வழங்கல் மற்றும் நிறுவல் ஓட்டம் <https://docs.godotengine.org/en/stable/tutorials/plugins/installing_pluguns .html> `_.
uk: Плагіни Android v1 вимагали спеціального файлу конфігурації ``gdap``, який використовувався редактором Godot для їх виявлення та завантаження. Однак цей підхід мав кілька недоліків, основними з яких були те, що йому бракувало гнучкості та відходив від «існуючого формату Godot EditorExportPlugin, потоку доставки та встановлення <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/installing_plugins.html>`_.
zh_hans: v1 Android插件需要一个自定义的 ``gdap`` 配置文件，由Godot Editor来检测和加载。然而，这种方法有几个缺点，主要是缺乏灵活性，而且偏离了 `现有的 Godot EditorExportPlugin 格式、交付和安装流程 <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/installing_plugins.html>`_ 。
zh_tw: v1 版 Android 外掛需要自訂 ``gdap`` 設定檔，供 Godot 編輯器偵測與載入外掛。但這種方式有諸多缺點，最主要是彈性不足，且脫離了 `現有的 Godot EditorExportPlugin 格式、發佈與安裝流程 <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/installing_plugins.html>`_。

source: This has been resolved for v2 Android plugins by deprecating the ``gdap`` packaging and configuration mechanism in favor of the existing Godot ``EditorExportPlugin`` packaging format. The ``EditorExportPlugin`` API in turn has been extended to properly support Android plugins.
ga: Réitigh sé seo do bhreiseáin v2 Android tríd an meicníocht pacáistithe agus cumraíochta ``gdap`` a dhíspreagadh i bhfabhar an fhormáid phacáistithe Godot ``EditorExportPlugin ``atá ann cheana. Leathnaíodh an API `EditorExportPlugin ``ina dhiaidh sin chun tacú le breiseáin Android i gceart.
ru: Для плагинов Android версии 2 эта проблема была решена путём отказа от механизма упаковки и настройки ``gdap`` в пользу существующего формата упаковки Godot ``EditorExportPlugin``. API ``EditorExportPlugin``, в свою очередь, был расширен для корректной поддержки плагинов Android.
ta: தற்போதுள்ள கோடோட்டுக்கு ஆதரவாக `` gdap`` பேக்கேசிங் மற்றும் உள்ளமைவு பொறிமுறையை நீக்குவதன் மூலம் வி 2 ஆண்ட்ராய்டு செருகுநிரல்களுக்கு இது தீர்க்கப்பட்டுள்ளது. ஆண்ட்ராய்டு செருகுநிரல்களை சரியாக ஆதரிக்க `` itientorexportplugin`` பநிஇ நீட்டிக்கப்பட்டுள்ளது.
uk: Це було вирішено для плагінів Android версії 2 шляхом припинення пакування та механізму конфігурації ``gdap`` на користь існуючого формату пакування Godot ``EditorExportPlugin``. У свою чергу API EditorExportPlugin було розширено для належної підтримки плагінів Android.
zh_hans: 这已经通过弃用 ``gdap`` 打包和配置机制，并改为使用现有的 Godot ``EditorExportPlugin`` 打包格式，解决了 v2 Android 插件的问题。同时，\ ``EditorExportPlugin API`` 也得到了扩展，以正确支持 Android 插件。
zh_tw: v2 版 Android 外掛已經棄用 ``gdap`` 封裝與設定機制，改採現有的 Godot ``EditorExportPlugin`` 封裝格式。同時也擴充了 ``EditorExportPlugin`` API，以正確支援 Android 外掛。

source: Building a v2 Android plugin
ga: Breiseán v2 Android a thógáil
it: Creazione di estensioni v2 Android
ru: Создание v2 Android плагина
ta: வி 2 ஆண்ட்ராய்டு சொருகி உருவாக்குதல்
uk: Створення плагіна v2 для Android
zh_hans: 构建 v2 Android 插件
zh_tw: 建置 v2 Android 外掛

source: A github project template **is provided** at https://github.com/m4gr3d/Godot-Android-Plugin-Template as a **quickstart for building Godot Android plugins for Godot 4.2+**. You can follow the `template README <https://github.com/m4gr3d/Godot-Android-Plugin-Template#readme>`_ to set up your own Godot Android plugin project.
ga: Soláthraítear teimpléad tionscadail github ** ag https://github.com/m4gr3d/Godot-Android-Plugin-Template mar **thosú gasta chun forlíontáin Godot Android a thógáil do Godot 4.2+**. Is féidir leat an `teimpléad README <https://github.com/m4gr3d/Godot-Android-Plugin-Template#readme>`_ a leanúint chun do thionscadal breiseán Godot Android féin a bhunú.
ru: Шаблон проекта GitHub **предоставлен** по адресу https://github.com/m4gr3d/Godot-Android-Plugin-Template в качестве **быстрого старта для создания плагинов Godot для Android 4.2+**. Вы можете воспользоваться файлом README для шаблона <https://github.com/m4gr3d/Godot-Android-Plugin-Template#readme>`_, чтобы настроить свой собственный проект плагина Godot для Android.
ta: ஒரு அறிவிலிமையம் திட்ட வார்ப்புரு ** ** https://github.com/m4gr3d/godot-android-plugin-template இல் கோடோட் ஆண்டோட் அண்ட்ராய்டு செருகுநிரல்களை கோடோட் ஆண்டோட் அண்ட்ராய்டு செருகுநிரல்களை உருவாக்குவதற்கான விரைவுச்டார்ட் என வழங்கப்படுகிறது 4.2+**. உங்கள் சொந்த கோடோட் ஆண்டோட் ஆண்ட்ராய்டு சொருகி திட்டத்தை அமைக்க `வார்ப்புரு ரீட்மே <https://github.com/m4gr3d/godot-android-plugin-template#readme> _ _ _ _` _ ஆகியவற்றைப் பின்பற்றலாம்.
uk: Шаблон проекту github **надається** на https://github.com/m4gr3d/Godot-Android-Plugin-Template як **швидкий старт для створення плагінів Godot Android для Godot 4.2+**. Ви можете слідувати `шаблону README <https://github.com/m4gr3d/Godot-Android-Plugin-Template#readme>`_, щоб налаштувати власний проект плагіна Godot для Android.
zh_hans: 一个 GitHub 项目模板 **已提供** 在 https://github.com/m4gr3d/Godot-Android-Plugin-Template ，以 **快速启动构建适用于 Godot 4.2+ 的 Godot Android 插件** 。你可以参考 `template README <https://github.com/m4gr3d/Godot-Android-Plugin-Template#readme>`_ 来设置你自己的 Godot Android 插件项目。
zh_tw: 官方提供了 github 專案範本：https://github.com/m4gr3d/Godot-Android-Plugin-Template，讓你可以快速建立適用於 Godot 4.2+ 的 Android 外掛。你可以依循 `範本 README <https://github.com/m4gr3d/Godot-Android-Plugin-Template#readme>`_ 來設定自己的 Godot Android 外掛專案。

source: To provide further understanding, here is a break-down of the steps used to create the project template:
ga: Chun tuiscint bhreise a sholáthar, seo miondealú ar na céimeanna a úsáidtear chun teimpléad an tionscadail a chruthú:
ru: Для лучшего понимания ниже приводится описание шагов, используемых для создания шаблона проекта:
ta: மேலும் புரிதலை வழங்க, திட்ட வார்ப்புருவை உருவாக்கப் பயன்படுத்தப்படும் படிகளின் முறிவு இங்கே:
uk: Щоб краще зрозуміти, ось розбивка кроків, використаних для створення шаблону проекту:
zh_hans: 为了进一步理解，以下是创建项目模板所使用步骤的详细分解：
zh_tw: 為了幫助理解，以下分解了建立專案範本的步驟：

source: Create an Android library module using `these instructions <https://developer.android.com/studio/projects/android-library>`_
ga: Cruthaigh modúl leabharlainne Android ag baint úsáide as `na treoracha seo <https://developer.android.com/studio/projects/android-library>`_
it: Crea un modulo libreria di Android seguendo `queste istruzioni <https://developer.android.com/studio/projects/android-library>`_
ru: Создайте модуль библиотеки Android, используя `эти инструкции <https://developer.android.com/studio/projects/android-library>`_
ta: `இந்த வழிமுறைகளைப் பயன்படுத்தி ஆண்ட்ராய்டு நூலக தொகுதியை உருவாக்கவும் <https://developer.android.com/studio/projects/android-library>` _
uk: Створіть модуль бібліотеки Android за допомогою `цих інструкцій <https://developer.android.com/studio/projects/android-library>`_
zh_hans: 按照 `这些说明 <https://developer.android.com/studio/projects/android-library>`_ 创建一个Android库模块。
zh_tw: 依照 `這份官方說明 <https://developer.android.com/studio/projects/android-library>`_ 建立 Android 函式庫模組

source: Add the Godot Android library as a dependency by updating the module's ``gradle`` `build file <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/build.gradle.kts#L42>`_::
ta: தொகுதியின் `` கிரேடில்`` `கோப்பை உருவாக்குதல் <https://github.com/m4gr3d/godot-android-plugin-template/blob/main/plugin/puild.credle.kts #L42> `_ ::
uk: Додайте бібліотеку Godot Android як залежність, оновивши файл збірки ``gradle`` `модуля <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/build.gradle.kts#L42>`_::

source: The Godot Android library is `hosted on MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_, and updated for each release.
ga: Tá leabharlann Godot Android `á óstáil ar MavenCentral <https://central.sonatype.com/artifact/org.godotenginine/godot>`_, agus nuashonraithe do gach eisiúint.
ru: Библиотека Godot для Android `размещена на MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_ и обновляется для каждого выпуска.
ta: கோடோட் ஆண்ட்ராய்டு நூலகம் `Mavencentral <https://central.sonatype.com/artifact/org.godotengine/godot> _ _ இல் வழங்கப்படுகிறது, மேலும் ஒவ்வொரு வெளியீட்டிற்கும் புதுப்பிக்கப்படுகிறது.
uk: Бібліотека Godot Android `розміщується на MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_ та оновлюється для кожного випуску.
zh_hans: Godot Android 库\ `托管在 MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_ 上，并在每次发布时更新。
zh_tw: Godot Android 函式庫已發佈到 `MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_，每個新版本都會更新。
