Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_plugin.po
Languages: ga, it, ru, ta, uk, zh_hans, zh_tw

source: If the plugin exposes Kotlin or Java methods to be called from GDScript, they must be annotated with `@UsedByGodot <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/UsedByGodot.java#L45>`_. The name called from GDScript **must match the method name exactly**. There is **no** coercing ``snake_case`` to ``camelCase``. For example, from GDScript:
ru: Если плагин предоставляет методы Kotlin или Java для вызова из GDScript, они должны быть аннотированы `@UsedByGodot <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/UsedByGodot.java#L45>`_. Имя, вызываемое из GDScript, **должно точно совпадать** с именем метода. Приведение ``snake_case`` к ``camelCase`` **не** возможно. Например, из GDScript:

source: Update the plugin ``AndroidManifest.xml`` `file <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/src/main/AndroidManifest.xml>`_ with the following meta-data:
ru: Обновите файл плагина ``AndroidManifest.xml`` `<https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/src/main/AndroidManifest.xml>`_, добавив следующие метаданные:

source: Or you can switch to the MavenCentral provided dependency:
ru: Или вы можете переключиться на предоставленную MavenCentral зависимость:

source: The ``Godot`` instance provided by ``GodotPlugin::getGodot()`` no longer has access to an ``android.content.Context`` reference. Use ``GodotPlugin::getActivity()`` instead.
ru: Экземпляр ``Godot``, предоставляемый ``GodotPlugin::getGodot()``, больше не имеет доступа к ссылке ``android.content.Context``. Вместо этого используйте ``GodotPlugin::getActivity()``.

source: The export tool script is used to configure the Android plugin and hook it within the Godot Editor's export process. It should look something like this:
it: Lo script tool di esportazione è utilizzato per configurare il plugin Android e integrarlo nel processo di esportazione di Godot Editor. Dovrebbe apparire più o meno così:
ru: Скрипт инструмента экспорта используется для настройки плагина Android и его подключения к процессу экспорта в редакторе Godot. Он должен выглядеть примерно так:

source: Create a ``plugin.cfg``. This is an INI file with metadata about your plugin:
it: Creare un file ``plugin.cfg``. È un file INI con metadati sul plugin:
ru: Создайте ``plugin.cfg``. Это INI-файл с метаданными вашего плагина:

source: For GDExtension, we follow the same steps as for `Packaging a v2 Android plugin`_ and add the `GDExtension config file <https://docs.godotengine.org/en/stable/tutorials/scripting/cpp/gdextension_cpp_example.html#using-the-gdextension-module>`_ in the same location as ``plugin.cfg``.
ru: Для GDExtension мы выполняем те же шаги, что и для `Упаковки плагина Android v2`_ и добавляем `файл конфигурации GDExtension <https://docs.godotengine.org/en/stable/tutorials/scripting/cpp/gdextension_cpp_example.html#using-the-gdextension-module>`_ в то же место, что и ``plugin.cfg``.

source: Here is what the ``plugin.gdextension`` config file should look like:
ru: Вот как должен выглядеть конфигурационный файл ``plugin.gdextension``:

source: Update the project's scripts as needed to access the plugin's functionality. For example:
ru: Обновите скрипты проекта по мере необходимости, чтобы получить доступ к функционалу плагина. Например:
zh_hans: 根据需要更新项目的脚本以访问插件功能。例如：

source: For example:
ga: Mar shampla:
it: Per esempio:
ru: Например:
zh_hans: 例如：
zh_tw: 例如：
