Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_plugin.po
Languages: ga, it, ru, ta, uk, zh_hans, zh_tw

source: As mentioned, a v2 Android plugin is now provided to the Godot Editor as an ``EditorExportPlugin`` plugin, so it shares a lot of the `same packaging steps <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#creating-a-plugin>`_.
ga: Mar a luadh, cuirtear breiseán v2 Android ar fáil anois d'Eagarthóir Godot mar bhreiseán ``EditorExportPlugin``, mar sin roinneann sé go leor de na `céimeanna pacáistithe céanna <https://docs.godotenginine.org/en/stable/tutorials /plugins/editor/making_plugins.html#creating-a-plugin>`_.
ru: Как уже упоминалось, плагин Android v2 теперь предоставляется Редактору Godot в виде плагина ``EditorExportPlugin``, поэтому он имеет много общих `этапов упаковки <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#creating-a-plugin>`_.
ta: குறிப்பிட்டுள்ளபடி, ஒரு வி 2 ஆண்ட்ராய்டு சொருகி இப்போது கோடோட் எடிட்டருக்கு ஒரு `` எடிட்டோர்எக்ச்போர்ட் பிளூகின்`` சொருகி என வழங்கப்படுகிறது, எனவே இது நிறைய `அதே பேக்கேசிங் படிகளை <https://docs.godotengine.org/en/stable/tutorials ஐப் பகிர்ந்து கொள்கிறது .
uk: Як згадувалося, плагін версії 2 для Android тепер надається редактору Godot як плагін ``EditorExportPlugin``, тому він має багато `одних і тих самих кроків пакування <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#creating-a-plugin>`_.
zh_hans: 如前文所述，v2 版本的 Android 插件现在是以 ``EditorExportPlugin`` 插件的形式提供给 Godot 编辑器的，所以\ `打包方法也大致相同 <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#creating-a-plugin>`_\ 。
zh_tw: 如前所述，v2 Android 外掛現在以 ``EditorExportPlugin`` 外掛的形式提供給 Godot 編輯器，因此其封裝流程大致與 `一般編輯器外掛 <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#creating-a-plugin>`_ 相同。

source: Add the plugin output binaries within the plugin directory (e.g: in ``addons/<plugin_name>/``)
ga: Cuir leis na roghanna dénártha aschuir laistigh den eolaire breiseán (m.sh.: in `` addons / <plugin_name>/``)
ru: Добавьте выходные двоичные файлы плагина в каталог плагина (например: в ``addons/<plugin_name>/``)
ta: சொருகி வெளியீட்டு பைனரிகளை சொருகி கோப்பகத்திற்குள் சேர்க்கவும் (எ.கா.: `` addons/<செருகுநிரல்_பெயர்>/``)
uk: Додайте вихідні двійкові файли плагіна в каталог плагіна (наприклад, у ``addons/<plugin_name>/``)
zh_hans: 在插件目录（例如 ``addons/<插件名称>/``\ ）中添加插件输出的二进制文件
zh_tw: 將外掛產生的二進位檔案放入外掛目錄（例如：``addons/<plugin_name>/``）

source: Add the `tool script <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#the-script-file>`_ for the export functionality within the plugin directory (e.g: in ``addons/<plugin_name>/``)
ga: Cuir an `uirlis script <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#the-script-file>`_ don fheidhmiúlacht easpórtála laistigh den eolaire breiseán (m.sh.: i ``addons/<plugin_name>/``)
ru: Добавьте `инструментальный скрипт <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#the-script-file>`_ для функциональности экспорта в каталог плагина (например: в ``addons/<plugin_name>/``)
ta: கருவியின் ச்கிரிப்ட் <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#the-script-file> `_ `` addons/<plugin_name>/``)
uk: Додайте `скрипт інструмента <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#the-script-file>`_ для функції експорту в каталозі плагіна (наприклад, у ``addons/<назва_плагіна>/``)
zh_hans: 在插件目录（例如 ``addons/<插件名称>/``\ ）中添加实现导出功能的\ `工具脚本 <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#the-script-file>`_
zh_tw: 在外掛目錄（例如： ``addons/<plugin_name>/`` ）中加入匯出用的 `tool script <https://docs.godotengine.org/en/stable/tutorials/plugins/editor/making_plugins.html#the-script-file>`_

source: The created script must be a ``@tool`` script, or else it will not work properly
ga: Caithfidh script ``@tool`` a bheith sa script cruthaithe, nó ní oibreoidh sé i gceart
it: Lo script creato deve essere uno script ``@tool``, altrimenti non funzionerà correttamente
ru: Созданный скрипт должен быть ``@tool`` скриптом, иначе он не будет работать корректно
ta: உருவாக்கப்பட்ட ச்கிரிப்ட் ``@கருவி`` ச்கிரிப்டாக இருக்க வேண்டும், இல்லையெனில் அது சரியாக வேலை செய்யாது
uk: Створений сценарій має бути сценарієм ``@tool``, інакше він не працюватиме належним чином
zh_hans: 创建的脚本必须是 ``@tool`` 脚本，否则无法正常工作
zh_tw: 建立的腳本必須為 ``@tool`` 腳本，否則將無法正常運作

source: The export tool script is used to configure the Android plugin and hook it within the Godot Editor's export process. It should look something like this::
ta: ஆண்ட்ராய்டு சொருகி கட்டமைக்கவும், கோடோட் எடிட்டரின் ஏற்றுமதி செயல்முறைக்குள் அதை இணைக்கவும் ஏற்றுமதி கருவி ச்கிரிப்ட் பயன்படுத்தப்படுகிறது. இது இதுபோன்றதாக இருக்க வேண்டும் ::
uk: Сценарій інструмента експорту використовується для налаштування плагіна Android і підключення його в процесі експорту редактора Godot. Це має виглядати приблизно так::

source: Here are the set of `EditorExportPlugin APIs <https://docs.godotengine.org/en/stable/classes/class_editorexportplugin.html>`_ most relevant to use in this tool script:
ta: `EtitoRexportPlugin Apis <https://docs.godotengine.org/en/stable/classes/class_editorexportplugin.html>` _ _ இந்த கருவி ச்கிரிப்டில் பயன்படுத்த மிகவும் பொருத்தமானது:
uk: Ось набір `API EditorExportPlugin <https://docs.godotengine.org/en/stable/classes/class_editorexportplugin.html>`_, який найбільше підходить для використання в цьому сценарії інструменту:

source: `_supports_platform <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-supports-platform>`_: returns ``true`` if the plugin supports the given platform. For Android plugins, this must return ``true`` when ``platform`` is `EditorExportPlatformAndroid <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html>`_
ta: . ஆண்ட்ராய்டு செருகுநிரல்களுக்கு, `` இயங்குதளம்`` ஆக இருக்கும்போது இது `` உண்மை`` திரும்ப வேண்டும்
uk: `_supports_platform <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-supports-platform>`_: повертає ``true``, якщо плагін підтримує дану платформу. Для плагінів Android це має повертати ``true``, якщо ``platform`` має значення `EditorExportPlatformAndroid <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html>`_

source: `_get_android_libraries <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-libraries>`_: retrieve the local paths of the Android libraries binaries (AAR files) provided by the plugin
ta: . ) சொருகி வழங்கியது
uk: `_get_android_libraries <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-libraries>`_: отримати локальні шляхи двійкових файлів бібліотек Android (файли AAR) ), що надається плагіном

source: `_get_android_dependencies <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-dependencies>`_: retrieve the set of Android maven dependencies (e.g: `org.godot.example:my-plugin:0.0.0`) provided by the plugin
ta: . .godot.example: my-plugin: 0.0.0`) சொருகி வழங்கியது
uk: `_get_android_dependencies <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-dependencies>`_: отримати набір залежностей Android maven (наприклад: `org .godot.example:my-plugin:0.0.0`), що надається плагіном

source: `_get_android_dependencies_maven_repos <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-dependencies-maven-repos>`_: retrieve the urls of the maven repos for the android dependencies provided by ``_get_android_dependencies``
ta: . `` _GET_ANDROID_DEPENDENCES`` வழங்கிய ஆண்ட்ராய்டு சார்புநிலைகள்
uk: `_get_android_dependencies_maven_repos <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-dependencies-maven-repos>`_: отримати URL-адреси сховищ maven для залежності android, надані ``_get_android_dependencies``

source: `_get_android_manifest_activity_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-activity-element-contents>`_: update the contents of the `<activity>` element in the generated Android manifest
ta: `_get_android_manifest_activity_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-activity-element-contents>`_: புதுப்பிப்பு the contents of the ` <செயல்பாடு> `உருவாக்கப்பட்ட ஆண்ட்ராய்டு மேனிஃபெச்டில் உறுப்பு
uk: `_get_android_manifest_activity_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-activity-element-contents>`_: оновити вміст ` <activity>` у створеному маніфесті Android

source: `_get_android_manifest_application_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-application-element-contents>`_: update the contents of the `<application>` element in the generated Android manifest
ta: `_get_android_manifest_application_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-application-element-contents>`_: புதுப்பிப்பு the contents of the ` <பயன்பாடு> `உருவாக்கப்பட்ட ஆண்ட்ராய்டு மேனிஃபெச்டில் உறுப்பு
uk: `_get_android_manifest_application_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-application-element-contents>`_: оновити вміст ` <application>` у створеному маніфесті Android

source: `_get_android_manifest_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-element-contents>`_: update the contents of the `<manifest>` element in the generated Android manifest
ta: `_get_android_manifest_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-element-contents>`_: புதுப்பிப்பு the contents of the `<manifest > `உருவாக்கப்பட்ட ஆண்ட்ராய்டு மேனிஃபெச்டில் உறுப்பு
uk: `_get_android_manifest_element_contents <https://docs.godotengine.org/en/latest/classes/class_editorexportplugin.html#class-editorexportplugin-method-get-android-manifest-element-contents>`_: оновити вміст `<manifest >` у створеному маніфесті Android

source: The ``_get_android_manifest_*`` methods allow the plugin to automatically provide changes to the app's manifest which are preserved when the Godot Editor is updated, resolving a long standing issue with v1 Android plugins.
ta: `` _Get_android_manifest_*`` முறைகள் கோடோட் எடிட்டர் புதுப்பிக்கப்படும் போது பாதுகாக்கப்படும் பயன்பாட்டின் மேனிஃபெச்ட்டில் மாற்றங்களை தானாகவே வழங்க அனுமதிக்கின்றன, இது வி 1 ஆண்ட்ராய்டு செருகுநிரல்களுடன் நீண்டகால சிக்கலைத் தீர்க்கிறது.
uk: Методи ``_get_android_manifest_*`` дозволяють плагіну автоматично вносити зміни до маніфесту програми, які зберігаються під час оновлення редактора Godot, вирішуючи давню проблему з плагінами Android версії 1.

source: Create a ``plugin.cfg``. This is an INI file with metadata about your plugin::
ta: ஒரு `` செருகுநிரல்.கஃப்சி`` ஐ உருவாக்கவும். இது உங்கள் சொருகி பற்றிய மெட்டாடேட்டாவுடன் கூடிய ஐ.என்.ஐ கோப்பு ::
uk: Створіть ``plugin.cfg``. Це INI-файл із метаданими про ваш плагін:

source: For reference, here is the `folder structure for the Godot Android plugin project template <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. At build time, the contents of the ``export_scripts_template`` directory as well as the generated plugin binaries are copied to the ``addons/<plugin_name>`` directory:
ga: Mar thagairt, seo é an struchtúr fillteáin do theimpléad tionscadail breiseán Godot Android <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. Ag an am tógála, déantar inneachar an eolaire ``export_scripts_template`` chomh maith leis na binaries breiseán ginte a chóipeáil chuig an eolaire `` addons / <plugin_name>``:
ru: Для справки, вот `структура папок для шаблона проекта плагина Godot для Android <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. Во время сборки содержимое каталога ``export_scripts_template``, а также сгенерированные двоичные файлы плагина копируются в каталог ``addons/<plugin_name>``:
ta: குறிப்புக்கு, கோடோட் ஆண்டோட் ஆண்ட்ராய்டு செருகுநிரல் திட்ட வார்ப்புருவுக்கான `கோப்புறை அமைப்பு <https://github.com/m4gr3d/godot-android-plugin-template/tree/main/plugin/export_scripts_template>` _. உருவாக்க நேரத்தில், `` export_scripts_template` `கோப்பகத்தின் உள்ளடக்கங்களும் உருவாக்கப்பட்ட சொருகி பைனரிகளும்` `addons/<splogin_name>` `கோப்பகத்திற்கு நகலெடுக்கப்படுகின்றன:
uk: Для довідки, ось `структура папок для шаблону проекту плагіна Godot Android <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. Під час збирання вміст каталогу ``export_scripts_template``, а також згенеровані двійкові файли плагіна копіюються до каталогу ``addons/<plugin_name>``:
zh_hans: 作为参考，这里是 `Godot Android 插件项目模板的文件夹结构 <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_\ 。在构建时，\ ``export_scripts_template`` 目录的内容，以及生成的插件二进制文件，被复制到 ``addons/<plugin_name>`` 目录：
zh_tw: 供參考，這是 `Godot Android 外掛專案範本 <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_ 的資料夾結構。建置時，``export_scripts_template`` 目錄內容與產生的外掛二進位檔會複製到 ``addons/<plugin_name>`` 目錄：

source: Packaging a v2 Android plugin with GDExtension capabilities
ga: Breiseán v2 Android a phacáistiú le cumais GDExtension
ru: Упаковка плагина Android v2 с возможностями GDExtension
ta: Gdextension திறன்களுடன் வி 2 ஆண்ட்ராய்டு சொருகி பேக்கேசிங்
uk: Упаковка плагіна Android v2 із можливостями GDExtension
zh_hans: 使用 GDExtension 功能打包 v2 Android 插件
zh_tw: 封裝支援 GDExtension 的 v2 Android 外掛

source: For GDExtension, we follow the same steps as for `Packaging a v2 Android plugin`_ and add the `GDExtension config file <https://docs.godotengine.org/en/stable/tutorials/scripting/gdextension/gdextension_cpp_example.html#using-the-gdextension-module>`_ in the same location as ``plugin.cfg``.
ta: Gdextension க்கு, `ஒரு வி 2 ஆண்ட்ராய்டு செருகுநிரலை பேக்கேசிங் செய்வதற்கான அதே படிகளைப் பின்பற்றி,` GDextension கட்டமைப்பு கோப்பு <https://docs.godotengine.org/en/stable/tutorials/scripting/gdextension_cpp_example.html# `` plugin.cfg`` போன்ற அதே இடத்தில்-gdextension-module> `_ ஆகியவற்றைப் பயன்படுத்துதல்.
uk: Для GDExtension ми виконуємо ті самі кроки, що й для `Packaging a v2 Android plugin`_ і додаємо `GDExtension файл конфігурації <https://docs.godotengine.org/en/stable/tutorials/scripting/gdextension/gdextension_cpp_example.html#using-the-gdextension-module>`_ у тому ж місці, що й ``plugin.cfg``.

source: For reference, here is the `folder structure for the GDExtension Android plugin project template <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. At build time, the contents of the ``export_scripts_template`` directory as well as the generated plugin binaries are copied to the ``addons/<plugin_name>`` directory:
ga: Mar thagairt, seo é an `struchtúr fillteáin do theimpléad tionscadail breiseán Android GDExtension <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. Ag an am tógála, déantar inneachar an eolaire ``export_scripts_template`` chomh maith leis na binaries breiseán ginte a chóipeáil chuig an eolaire `` addons / <plugin_name>``:
ru: Для справки, вот `структура папок для шаблона проекта плагина GDExtension для Android <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. Во время сборки содержимое каталога ``export_scripts_template``, а также сгенерированные двоичные файлы плагина копируются в каталог ``addons/<plugin_name>``:
ta: குறிப்புக்கு, kDextension ஆண்ட்ராய்டு செருகுநிரல் திட்ட வார்ப்புருவுக்கான கோப்புறை அமைப்பு <https://github.com/m4gr3d/gdextension-android-plugin-template/tree/main/plugin/export_scripts_template> _. உருவாக்க நேரத்தில், `` export_scripts_template` `கோப்பகத்தின் உள்ளடக்கங்களும் உருவாக்கப்பட்ட சொருகி பைனரிகளும்` `addons/<splogin_name>` `கோப்பகத்திற்கு நகலெடுக்கப்படுகின்றன:
uk: Для довідки, ось структура папок для шаблону проекту плагіна `Android GDExtension <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_. Під час збирання вміст каталогу ``export_scripts_template``, а також згенеровані двійкові файли плагіна копіюються до каталогу ``addons/<plugin_name>``:
zh_hans: 作为参考，这里是 `GDExtension Android 插件项目模板的文件夹结构 <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_\ 。在构建时，\ ``export_scripts_template`` 目录的内容以及生成的插件二进制文件将被复制到 ``addons/<plugin_name>`` 目录：
zh_tw: 供參考，這是 `GDExtension Android 外掛專案範本 <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_ 的目錄結構。建置時，``export_scripts_template`` 目錄內容與產生的外掛二進位檔會複製到 ``addons/<plugin_name>`` 目錄：

source: Here is what the ``plugin.gdextension`` config file should look like::
ta: இங்கே இது `` சொருகி. Gdextension`` கட்டமைப்பு கோப்பு எப்படி இருக்க வேண்டும் ::
uk: Ось як має виглядати конфігураційний файл ``plugin.gdextension``:

source: Of note is the ``android_aar_plugin`` field that specifies this GDExtension module is provided as part of a v2 Android plugin. During the export process, this will indicate to the Godot Editor that the GDExtension native shared libraries are exported by the Android plugin AAR binaries.
ga: Is é an réimse ``android_aar_plugin`` a shonraíonn an modúl GDExtension seo a sholáthraítear mar chuid de bhreiseán v2 Android. Le linn an phróisis easpórtála, léirfidh sé seo don Eagarthóir Godot go n-onnmhairíonn dénártha AAR breiseán Android na leabharlanna roinnte dúchasacha GDExtension.
ru: Обратите внимание на поле ``android_aar_plugin``, которое указывает, что этот модуль GDExtension предоставляется как часть плагина Android v2. В процессе экспорта это укажет редактору Godot, что собственные общие библиотеки GDExtension экспортируются двоичными файлами AAR плагина Android.
ta: குறிப்பு என்பது `` Android_aar_plugin`` புலம் இந்த gdextension தொகுதி ஒரு வி 2 ஆண்ட்ராய்டு சொருகி ஒரு பகுதியாக வழங்கப்படுகிறது. ஏற்றுமதி செயல்பாட்டின் போது, ஆண்ட்ராய்டு சொருகி AAR பைனரிகளால் gdextension சொந்த பகிரப்பட்ட நூலகங்கள் ஏற்றுமதி செய்யப்படுவதை இது கோடோட் எடிட்டருக்கு குறிக்கும்.
uk: Слід зазначити, що поле ``android_aar_plugin`` вказує, що цей модуль GDExtension надається як частина плагіна Android v2. Під час процесу експорту це вкаже редактору Godot, що рідні спільні бібліотеки GDExtension експортуються двійковими файлами плагіна Android AAR.
zh_hans: 需要注意的是这里的 ``android_aar_plugin`` 字段，这个字段说明该 GDExtension 模块是以 v2 Android 插件的形式提供的。导出过程中就会告诉 Godot 编辑器，这个 GDExtension 原生共享库是由 Android 插件 AAR 二进制导出的。
zh_tw: 需要注意的是 ``android_aar_plugin`` 欄位，這代表此 GDExtension 模組是 v2 Android 外掛的一部分。在匯出流程中，這可讓 Godot 編輯器辨識 GDExtension 原生共享函式庫由 Android 外掛的 AAR 檔案提供。

source: For GDExtension Android plugins, the plugin init class must override `GodotPlugin::getPluginGDExtensionLibrariesPaths() <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L277>`_, and return the paths to the bundled GDExtension libraries config files (``*.gdextension``).
ga: Le haghaidh breiseán GDExtension Android, ní mór don rang init breiseán sárú a dhéanamh ar `GodotPlugin::getPluginGDExtensionLibrariesPaths() <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d63ds/platform/ dotengine/godot /plugin/GodotPlugin.java#L277>`_, agus cuir na cosáin ar ais chuig na comhaid cumraíochta leabharlanna GDExtension cuachta (``*.gdextension``).
ru: Для плагинов Android GDExtension класс init плагина должен переопределять `GodotPlugin::getPluginGDExtensionLibrariesPaths() <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L277>`_, и вернуть пути к конфигурационным файлам библиотек GDExtension, входящим в комплект поставки (``*.gdextension``).
ta: Gdextension ஆண்ட்ராய்டு செருகுநிரல்களுக்கு, சொருகி init `getPlugingDextensionlibrarySpaths () /org/கோடோடெங்கின்/கோடோட் .
uk: Для плагінів GDExtension для Android клас ініціалізації плагіна має перевизначати `GodotPlugin::getPluginGDExtensionLibrariesPaths() <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L277>`_, і повертає шляхи до конфігураційних файлів бібліотек GDExtension (``*.gdextension``).
zh_hans: 对 GDExtension Android 插件而言，插件的初始类必须覆盖 `GodotPlugin::getPluginGDExtensionLibrariesPaths() <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L277>`_\ ，并且返回所捆绑的 GDExtension 库配置文件的路径（\ ``*.gdextension``\ ）。
zh_tw: 對於 GDExtension Android 外掛，初始化類別必須覆寫 `GodotPlugin::getPluginGDExtensionLibrariesPaths() <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L277>`_ 方法，並回傳附帶的 GDExtension 函式庫設定檔（``*.gdextension``）路徑。

source: The paths must be relative to the Android library's ``assets`` directory. At runtime, the plugin will provide these paths to the Godot engine which will use them to load and initialize the bundled GDExtension libraries.
ga: Caithfidh na cosáin a bheith i gcoibhneas le eolaire ``assets` leabharlann Android. Ag am rith, soláthróidh an breiseán na cosáin seo don inneall Godot a úsáidfidh iad chun na leabharlanna GDExtension cuachta a luchtú agus a thionscnamh.
ru: Пути должны быть указаны относительно каталога ``assets`` библиотеки Android. Во время выполнения плагин предоставит эти пути движку Godot, который будет использовать их для загрузки и инициализации встроенных библиотек GDExtension.
ta: பாதைகள் ஆண்ட்ராய்டு நூலகத்தின் `` சொத்துக்கள்` `கோப்பகத்துடன் தொடர்புடையதாக இருக்க வேண்டும். இயக்க நேரத்தில், சொருகி இந்த பாதைகளை கோடோட் எஞ்சினுக்கு வழங்கும், இது தொகுக்கப்பட்ட gdextension நூலகங்களை ஏற்றவும் துவக்கவும் அவற்றைப் பயன்படுத்தும்.
uk: Шляхи мають бути відносними до каталогу ``assets`` бібліотеки Android. Під час виконання плагін надасть ці шляхи механізму Godot, який використовуватиме їх для завантаження та ініціалізації бібліотек GDExtension, що входять у комплект.
zh_hans: 路径必须相对于 Android 库的 ``assets`` 目录。运行时，插件会向 Godot 引擎提供这些路径，用于加载并初始化所捆绑的 GDExtension 库。
zh_tw: 這些路徑必須是相對於 Android 函式庫的 ``assets`` 目錄。執行時，外掛會將這些路徑提供給 Godot 引擎，引擎便會載入並初始化所附的 GDExtension 函式庫。

source: Using a v2 Android plugin
ga: Ag baint úsáide as breiseán v2 Android
it: Utilizzo di un'estensione Android v2
ru: Использование v2 Android плагина
ta: வி 2 ஆண்ட்ராய்டு சொருகி பயன்படுத்துதல்
uk: Використання плагіна v2 Android
zh_hans: 使用 v2 Android 插件
zh_tw: 使用 v2 Android 外掛
