Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_library.po
Languages: ga, it, ru, ta, uk, zh_cn, zh_tw

source: The runtime ``GodotPlugin`` can also be used by ``gdscript`` logic to access JVM methods. For more information, see :ref:`Godot Android plugins <doc_android_plugin>`.
ga: Is féidir an t-am rite ``GodotPlugin`` a úsáid freisin le loighic ``gdscript`` chun teacht ar mhodhanna JVM. Le haghaidh tuilleadh faisnéise, féach :ref:`Forlíontáin Godot Android <doc_android_plugin>`.
ru: ``GodotPlugin`` среды выполнения также может использоваться логикой ``gdscript`` для доступа к методам JVM. Подробнее см. в разделе :ref:`Godot Android plugins <doc_android_plugin>`.
ta: JVM முறைகளை அணுக `` கோடோட்ப்ளூசின்`` இயக்க நேரத்தை `` gdscript`` வழக்கு பயன்படுத்தலாம். மேலும் தகவலுக்கு, காண்க: குறிப்பு: `கோடோட் ஆண்ட்ராய்டு செருகுநிரல்கள் <doc_android_plugin>`.
uk: Середовище виконання ``GodotPlugin`` також може використовуватися логікою ``gdscript`` для доступу до методів JVM. Для отримання додаткової інформації див. :ref:`Godot Android plugins <doc_android_plugin>`.
zh_cn: ``gdscript`` 逻辑也可以用运行时的 ``GodotPlugin`` 来访问 JVM 方法。详情见 :ref:`Godot Android 插件 <doc_android_plugin>`\ 。
zh_tw: 執行時的 ``GodotPlugin`` 也可讓 GDScript 邏輯呼叫 JVM 方法。詳情請見 :ref:`Godot Android 外掛 <doc_android_plugin>`。

source: Add any additional logic that will be used by your application
ga: Cuir aon loighic bhreise leis a úsáidfidh d'iarratas
ru: Добавьте любую дополнительную логику, которая будет использована в вашем приложении
ta: உங்கள் பயன்பாட்டால் பயன்படுத்தப்படும் கூடுதல் தர்க்கத்தை சேர்க்கவும்
uk: Додайте будь-яку додаткову логіку, яку використовуватиме ваша програма
zh_cn: 添加你的程序所需使用的额外逻辑
zh_tw: 新增應用程式所需的其他邏輯

source: For the sample app, this includes adding the `ItemsSelectionFragment fragment <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/ItemsSelectionFragment.kt>`_ (and related classes), a fragment used to build and show the list of glTF items
ru: Для примера приложения это включает добавление фрагмента `ItemsSelectionFragment <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/ItemsSelectionFragment.kt>`_ (и связанных классов), фрагмента, используемого для построения и отображения списка элементов glTF
uk: Для зразка програми це включає додавання `фрагмента ItemsSelectionFragment <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/ItemsSelectionFragment.kt>`_ (і пов’язаних класів), фрагмента, який використовується для створити та показати список елементів glTF
zh_tw: 以範例 App 為例，需加入 `ItemsSelectionFragment <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/ItemsSelectionFragment.kt>`_ 及相關類別，用來建立與顯示 glTF 項目清單

source: Open the ``AndroidManifest.xml`` file, and configure the orientation if needed using the `android:screenOrientation attribute <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_
ga: Oscail an comhad ``AndroidManifest.xml``, agus cumraigh an treoshuíomh más gá leis an tréith `android:screenOrientation <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_
ru: Откройте файл ``AndroidManifest.xml`` и при необходимости настройте ориентацию с помощью атрибута `android:screenOrientation <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_
ta: `` Androidmanifest.xml`` கோப்பைத் திறந்து, `Android: திரைக்கதை: திரைக்கதை பண்புக்கூறு <https://developer.android.com/guide/topics/manifest/activity-element#screen>` _ ஆகியவற்றைப் பயன்படுத்தி தேவைப்பட்டால் நோக்குநிலையை உள்ளமைக்கவும்
uk: Відкрийте файл ``AndroidManifest.xml`` і за потреби налаштуйте орієнтацію за допомогою `android:screenOrientation атрибута <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_
zh_cn: 打开 ``AndroidManifest.xml`` 文件，如果需要配置朝向，可以使用 `android:screenOrientation attribute <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_
zh_tw: 開啟 ``AndroidManifest.xml`` 檔案，依需要使用 `android:screenOrientation 屬性 <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_ 設定畫面方向

source: If needed, disable automatic resizing / orientation configuration changes using the `android:configChanges attribute <https://developer.android.com/guide/topics/manifest/activity-element#config>`_
ga: Más gá, díchumasaigh athruithe cumraíochta uathmhéadaithe / treoshuímh ag baint úsáide as an aitreabúid `android:configChanges <https://developer.android.com/guide/topics/manifest/activity-element#config>`_
ru: При необходимости, отключите автоматическое изменение размера и изменение конфигурации ориентации с помощью атрибута `android:configChanges <https://developer.android.com/guide/topics/manifest/activity-element#config>`_
ta: தேவைப்பட்டால், `Android: configchanges பண்புக்கூறு <https://developer.android.com/guide/topics/manifest/activity-element#config>` _
uk: За потреби вимкніть автоматичне змінення розміру/конфігурації орієнтації за допомогою атрибута `android:configChanges <https://developer.android.com/guide/topics/manifest/activity-element#config>`_
zh_cn: 如果需要，请使用 `android:configChanges 属性 <https://developer.android.com/guide/topics/manifest/activity-element#config>`_\ 禁用自动调整大小/方向配置更改
zh_tw: 如需停用自動調整大小／方向等設定變更，請使用 `android:configChanges 屬性 <https://developer.android.com/guide/topics/manifest/activity-element#config>`_

source: 2. Create the Godot project
ga: 2. Cruthaigh an tionscadal Godot
it: 2. Creare il progetto Godot
ru: 2. Создайте проект
ta: 2. கோடோட் திட்டத்தை உருவாக்கவும்
uk: 2. Створіть проект Godot
zh_cn: 2. 创建 Godot 项目
zh_tw: 2. 建立 Godot 專案

source: On Android, Godot's project files are exported to the ``assets`` directory of the generated ``apk`` binary.
ga: Ar Android, onnmhairítear comhaid tionscadail Godot chuig eolaire ``assets`` den dénártha ``apk`` a ghintear.
ru: На Android файлы проекта Godot экспортируются в каталог ``assets`` сгенерированного двоичного файла ``apk``.
ta: ஆண்ட்ராய்டு இல், கோடோட்டின் திட்டக் கோப்புகள் உருவாக்கப்பட்ட `` apk`` பைனரியின் `` சொத்துக்கள்` கோப்பகத்திற்கு ஏற்றுமதி செய்யப்படுகின்றன.
uk: На Android файли проекту Godot експортуються до каталогу ``assets`` згенерованого двійкового файлу ``apk``.
zh_cn: 在 Android 上，Godot 的项目文件会被导入到所生成 ``apk`` 二进制文件的 ``assets`` 目录中。
zh_tw: 在 Android 平臺，Godot 專案檔案會匯出到產生的 ``apk`` 檔案中的 ``assets`` 目錄下。

source: We leverage that architecture to bind our Android app and Godot project together by creating the Godot project in the Android app's ``assets`` directory.
ga: Déanaimid an ailtireacht sin a ghiaráil chun ár n-aip Android agus tionscadal Godot a cheangal le chéile trí thionscadal Godot a chruthú in eolaire ``sócmhainní ``an aip Android.
ru: Мы используем эту архитектуру, чтобы связать наше приложение Android и проект Godot, создав проект Godot в каталоге ``assets`` приложения Android.
ta: ஆண்ட்ராய்டு பயன்பாட்டின் `` சொத்துக்கள்`` கோப்பகத்தில் கோடோட் திட்டத்தை உருவாக்குவதன் மூலம் எங்கள் ஆண்ட்ராய்டு பயன்பாடு மற்றும் கோடோட் திட்டத்தை ஒன்றாக பிணைக்க அந்த கட்டமைப்பை நாங்கள் பயன்படுத்துகிறோம்.
uk: Ми використовуємо цю архітектуру, щоб зв’язати нашу програму Android і проект Godot разом, створивши проект Godot у каталозі ``assets`` програми Android.
zh_cn: 通过在 Android 应用程序的 ``assets`` 目录中创建 Godot 项目，我们利用该架构将 Android 应用程序和 Godot 项目绑定在一起。
zh_tw: 我們可以利用這個架構，直接在 Android 專案的 ``assets`` 目錄下建立 Godot 專案，將兩者整合。

source: Note that it's also possible to create the Godot project in a separate directory and export it as a `PCK or ZIP file <https://docs.godotengine.org/en/stable/tutorials/export/exporting_projects.html#pck-versus-zip-pack-file-formats>`_ to the Android app's ``assets`` directory. Using this approach requires passing the ``--main-pack <pck_or_zip_filepath_relative_to_assets_dir>`` argument to the hosted Godot Engine instance using `GodotHost#getCommandLine() <https://github.com/godotengine/godot/blob/6916349697a4339216469e9bf5899b983d78db07/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java#L45>`_.
ga: Tabhair faoi deara gur féidir freisin an tionscadal Godot a chruthú in eolaire ar leith agus é a easpórtáil mar `PCK nó ZIP chomhad <https://docs.godotenginine.org/ga/stable/tutorials/export/exporting_projects.html#pck-versus -zip-pack-file-formats> `_ chuig eolaire ``sócmhainní`` an aip Android. Chun an cur chuige seo a úsáid ní mór an argóint ``--main-pack <pck_or_zip_filepath_relative_to_assets_dir>`` a rith chuig an ásc óstáilte Inneall Godot ag baint úsáide as `GodotHost#getCommandLine() <https://github.com/godotenginine/godot/blob/69163496997a43 /ardán /android/java/lib/src/org/godotengine/godot/GodotHost.java#L45>`_.
ru: Обратите внимание, что проект Godot также можно создать в отдельном каталоге и экспортировать его как файл `PCK или ZIP <https://docs.godotengine.org/en/stable/tutorials/export/exporting_projects.html#pck-versus-zip-pack-file-formats>`_ в каталог ``assets`` приложения Android. При использовании этого подхода необходимо передать аргумент ``--main-pack <pck_or_zip_filepath_relative_to_assets_dir>`` размещенному экземпляру Godot Engine с помощью `GodotHost#getCommandLine() <https://github.com/godotengine/godot/blob/6916349697a4339216469e9bf5899b983d78db07/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java#L45>`_.
ta: கோடோட் திட்டத்தை ஒரு தனி கோப்பகத்தில் உருவாக்கி அதை `பி.சி.கே அல்லது சிப் கோப்பாக ஏற்றுமதி செய்ய முடியும் என்பதையும் நினைவில் கொள்க ஆண்ட்ராய்டு பயன்பாட்டின் `` சொத்துக்கள்`` கோப்பகத்திற்கு -சிப்-பேக்-கோப்பு-வடிவங்கள்> `_. இந்த அணுகுமுறையைப் பயன்படுத்தி ``--மெய்ன்-பேக் <pck_or_zip_filepath_to_assets_dir> `` `godothost#getCommandline () <https://godotegn/godotengine ஐப் பயன்படுத்தி உரையாடல் 99B983D78DB07/இயங்குதளம் .
uk: Зауважте, що також можна створити проект Godot в окремому каталозі та експортувати його як a `Файл PCK або ZIP <https://docs.godotengine.org/en/stable/tutorials/export/exporting_projects.html#pck-versus-zip-pack-file-formats>`_ до каталогу ``assets`` програми Android. Використання цього підходу вимагає передачі аргументу ``--main-pack <pck_or_zip_filepath_relative_to_assets_dir>`` розміщеному екземпляру Godot Engine за допомогою `GodotHost#getCommandLine() <https://github.com/godotengine/godot/blob/6916349697a4339216469e9bf5899b983d78db07/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java#L45>`_.
zh_cn: 请注意，也可以在单独的目录中创建 Godot 项目，并将其导出为 `PCK 或 ZIP 文件 <https://docs.godotengine.org/en/stable/tutorials/export/exporting_projects.html#pck-versus-zip-pack-file-formats>`_ 到 Android 应用程序的 ``assets`` 目录。使用这种方法需要使用 `GodotHost#getCommandLine() <https://github.com/godotengine/godot/blob/6916349697a4339216469e9bf5899b983d78db07/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java#L45>`_ 将 ``--main-pack <pck_or_zip_filepath_relative_too_assets_dir>`` 参数传递给托管的 Godot 引擎实例。
zh_tw: 你也可以選擇將 Godot 專案建在獨立目錄，並匯出成 `PCK 或 ZIP 檔 <https://docs.godotengine.org/en/stable/tutorials/export/exporting_projects.html#pck-versus-zip-pack-file-formats>`_，再放到 Android App 的 ``assets`` 目錄。這種方式需透過 `GodotHost#getCommandLine() <https://github.com/godotengine/godot/blob/6916349697a4339216469e9bf5899b983d78db07/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java#L45>`_ 傳入 ``--main-pack <檔案路徑>`` 參數給 Godot 引擎。

source: Example:
ga: Sampla:
it: Esempio:
ru: Пример:
zh_cn: 示例：

source: The instructions below and the sample app follow the first approach of creating the Godot project in the Android app's ``assets`` directory.
ga: Leanann na treoracha thíos agus an aip samplach an chéad chur chuige chun tionscadal Godot a chruthú in eolaire ``sócmhainní ``an aip Android.
ru: Приведенные ниже инструкции и пример приложения соответствуют первому подходу создания проекта Godot в каталоге ``assets`` приложения Android.
ta: அண்ட்ராய்டு பயன்பாட்டின் `` சொத்துக்கள்`` கோப்பகத்தில் கோடோட் திட்டத்தை உருவாக்குவதற்கான முதல் அணுகுமுறையை கீழே உள்ள வழிமுறைகளும் மாதிரி பயன்பாடும் பின்பற்றுகின்றன.
uk: Наведені нижче інструкції та зразок програми відповідають першому підходу створення проекту Godot у каталозі ``assets`` програми Android.
zh_cn: 下面的说明和示例应用程序采用了第一种方法，即在 Android 应用程序的 ``assets`` 目录中创建 Godot 项目。
zh_tw: 以下教學與範例 App 都採用第一種方式：直接將 Godot 專案建在 Android App 的 ``assets`` 目錄下。

source: As mentioned in the **note** above, open the Godot Editor and create a Godot project directly (no subfolder) in the ``assets`` directory of the Android application project
ga: Mar a luadh san **nóta** thuas, oscail Eagarthóir Godot agus cruthaigh tionscadal Godot go díreach (gan aon fhofillteán) in eolaire ``sócmhainní ``de thionscadal feidhmchláir Android
ru: Как указано в **примечании** выше, откройте редактор Godot и создайте проект Godot напрямую (без подпапок) в каталоге ``assets`` проекта приложения Android
ta: மேலே உள்ள ** குறிப்பு ** இல் குறிப்பிட்டுள்ளபடி, கோடோட் எடிட்டரைத் திறந்து, ஆண்ட்ராய்டு பயன்பாட்டு திட்டத்தின் `` சொத்துக்கள்` `கோப்பகத்தில் நேரடியாக ஒரு கோடோட் திட்டத்தை (துணை கோப்புறை இல்லை) உருவாக்கவும்
uk: Як зазначено в **примітці** вище, відкрийте редактор Godot і створіть проект Godot безпосередньо (без підпапки) у каталозі ``assets`` проекту програми Android
zh_cn: 如上面的\ **备注**\ 所述，打开 Godot 编辑器，直接在 Android 应用程序项目的 ``assets`` 目录下创建一个 Godot 项目（无子文件夹）
zh_tw: 如上方 **備註** ，請直接在 Android 專案的 ``assets`` 目錄（不需子資料夾）建立 Godot 專案

source: See the sample app's `Godot project <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer/src/main/assets>`_ for reference
ga: Féach ar an tionscadal samplach 'Godot' <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer/src/main/assets>`_ le haghaidh tagartha
ru: Для справки см. app's `Godot project <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer/src/main/assets>`_
ta: மாதிரி பயன்பாட்டின் `கோடோட் திட்டம் <https://github.com/m4gr3d/godot-android-samples/tree/apster/apps/gltf_viewer/src/main/assets>` _ குறிப்புக்கு
uk: Для довідки перегляньте приклад програми `Godot project <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer/src/main/assets>`_
zh_cn: 请参阅示例应用程序的 `Godot 项目 <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer/src/main/assets>`_ 以获取参考
zh_tw: 可參考範例 App 的 `Godot 專案 <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer/src/main/assets>`_

source: Configure the Godot project as desired
ga: Cumraigh tionscadal Godot de réir mar is mian
it: Configurare il progetto Godot come desiderato
ru: Настройка проекта Godot по своему усмотрению
ta: கோடோட் திட்டத்தை விரும்பியபடி உள்ளமைக்கவும்
uk: Налаштуйте проект Godot за бажанням
zh_cn: 按需配置 Godot 项目
zh_tw: 依需求設定 Godot 專案

source: Make sure the `orientation <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-display-window-handheld-orientation>`_ set for the Godot project matches the one set in the Android app's manifest
ga: Cinntigh go bhfuil an `treoshuíomh <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-display-window-handheld-orientation>`_ socraithe don tionscadal Godot ag teacht leis an gceann socraithe i léiriú an aip Android
ru: Убедитесь, что `ориентация <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-display-window-handheld-orientation>`_, заданная для проекта Godot, совпадает с ориентацией, заданной в манифесте приложения Android
ta: `நோக்குநிலை <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectSettings ஆண்ட்ராய்டு பயன்பாட்டின் மேனிஃபெச்டில் அமைக்கவும்
uk: Переконайтеся, що `орієнтація <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-display-window-handheld-orientation>`_, встановлена для проекту Godot, відповідає у маніфесті програми Android
zh_cn: 请确保 Godot 项目设置的\ `朝向 <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-display-window-handheld-orientation>`_\ 与 Android 应用 manifest 文件中的设置一致
zh_tw: 請確保 Godot 專案中 `orientation <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-display-window-handheld-orientation>`_ （螢幕方向）設定與 Android App 的 manifest 設定一致

source: For Android, make sure `textures/vram_compression/import_etc2_astc <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-rendering-textures-vram-compression-import-etc2-astc>`_ is set to `true`
ga: Le haghaidh Android, cinntigh `textures/vram_compression/import_etc2_astc <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-rendering-textures-vram-compression-import-etc2- astc> Tá `_ socraithe go `fíor`
ru: Для Android убедитесь, что `textures/vram_compression/import_etc2_astc <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-rendering-textures-vram-compression-import-etc2-astc>`_ установлено в значение `true`
ta: க்கு ஆண்ட்ராய்டு, make sure `textures/vram_compression/import_etc2_astc <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-rendering-textures-vram-compression-import-etc2- ASTC> `_` உண்மை` என அமைக்கப்பட்டுள்ளது
uk: Для Android переконайтеся, що `textures/vram_compression/import_etc2_astc <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-rendering-textures-vram-compression-import-etc2-astc>`_ має значення `true`
zh_cn: 请确保 Android 平台的 `textures/vram_compression/import_etc2_astc <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-rendering-textures-vram-compression-import-etc2-astc>`_ 已设为 `true`
zh_tw: 針對 Android，請將 `textures/vram_compression/import_etc2_astc <https://docs.godotengine.org/en/stable/classes/class_projectsettings.html#class-projectsettings-property-rendering-textures-vram-compression-import-etc2-astc>`_ 設為 `true`

source: Update the Godot project script logic as needed
ga: Déan loighic script tionscadail Godot a nuashonrú de réir mar
ru: При необходимости обновите логику сценария проекта Godot
ta: தேவட் திட்ட ச்கிரிப்ட் தர்க்கத்தை தேவைக்கேற்ப புதுப்பிக்கவும்
uk: За потреби оновіть логіку сценарію проекту Godot
zh_cn: 按需更新 Godot 项目的脚本逻辑
zh_tw: 依需求更新 Godot 專案腳本邏輯

source: For the sample app, the `script logic <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/assets/main.gd>`_ queries for the runtime ``GodotPlugin`` instance and uses it to register for signals fired by the app logic
ga: Maidir leis an aip shamplach, cuireann an loighic scripte <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/assets/main.gd> `_ ceisteanna don am rite Mar shampla `` GodotPlugin`` agus úsáideann sé é chun clárú le haghaidh comharthaí a scaoiltear le loighic na haipe
ru: Для примера приложения `логика скрипта <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/assets/main.gd>`_ запрашивает экземпляр ``GodotPlugin`` среды выполнения и использует его для регистрации сигналов, запускаемых логикой приложения
ta: மாதிரி பயன்பாட்டிற்கு, `ச்கிரிப்ட் வழக்கு <https://github.com/m4gr3d/godot-android-samples/blob/master/apps/gltf_viewer/src/main/assets/main.gd> _ _ _ வினவல்கள் `` கோடோட்ப்ளூசின்` சான்று மற்றும் பயன்பாட்டு தர்க்கத்தால் சுடப்பட்ட சமிக்ஞைகளுக்கு பதிவு செய்ய அதைப் பயன்படுத்துகிறது
uk: Для зразка програми `логіка сценарію <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/assets/main.gd>`_ запитує для середовища виконання Екземпляр ``GodotPlugin`` і використовує його для реєстрації сигналів, що надсилаються логікою програми
zh_cn: 示例项目中的\ `脚本逻辑 <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/assets/main.gd>`_\ 会查询运行时的 ``GodotPlugin`` 实例，并将其注册到应用逻辑所发出的信号
zh_tw: 範例 App 中，`main.gd <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/assets/main.gd>`_ 腳本會查詢執行時的 ``GodotPlugin`` 實例，註冊接收 App 邏輯發送的 signal

source: The app logic fires a signal every time an item is selected in the list. The signal contains the filepath of the glTF model, which is used by the ``gdscript`` logic to render the model.
ru: Логика приложения генерирует сигнал каждый раз при выборе элемента в списке. Сигнал содержит путь к файлу модели glTF, который используется логикой ``gdscript`` для рендеринга модели.
uk: Логіка програми запускає сигнал кожного разу, коли елемент вибирається в списку. Сигнал містить шлях до файлу моделі glTF, який використовується логікою ``gdscript`` для відтворення моделі.
zh_tw: 每當清單中有項目被選取時，App 邏輯會發送一個 signal，內容包含該 glTF 模型的檔案路徑，GDScript 會根據路徑渲染對應模型。

source: 3. Build and run the app
ga: 3. Tóg agus reáchtáil an aip
it: 3. Compilare ed eseguire l'applicazione
ru: 3. Создайте и запустите приложение
ta: 3. பயன்பாட்டை உருவாக்கி இயக்கவும்
uk: 3. Створіть і запустіть додаток
zh_cn: 3. 构建并运行应用
zh_tw: 3. 建置並執行應用程式

source: Once you complete configuration of your Godot project, build and run the Android app. If set up correctly, the host Activity will initialize the embedded Godot Engine on startup. The Godot Engine will check the ``assets`` directory for project files to load (unless configured to look for a ``main pack``), and will proceed to run the project.
ga: Nuair a chríochnaíonn tú cumraíocht do thionscadal Godot, tóg agus reáchtáil an aip Android. Má tá sé curtha ar bun i gceart, cuirfidh an Gníomhaíocht óstach an Inneall Godot leabaithe a thosú ar an tosú. Seiceálfaidh an Inneall Godot an eolaire ``assets` chun comhaid tionscadail a luchtú (mura bhfuil sé cumraithe chun ``príomhphacáistéa' a lorg), agus leanfaidh sé ar aghaidh chun an tionscadal a reáchtáil.
ru: После завершения настройки проекта Godot соберите и запустите приложение (app) для Android. При правильной настройке host Activity инициализирует встроенный Godot Engine при запуске. Godot Engine проверит каталог ``assets`` на наличие файлов проекта для загрузки (если не настроен поиск ``main pack``), а затем приступит к запуску проекта.
ta: உங்கள் கோடோட் திட்டத்தின் உள்ளமைவை நீங்கள் முடித்தவுடன், ஆண்ட்ராய்டு பயன்பாட்டை உருவாக்கி இயக்கவும். சரியாக அமைக்கப்பட்டால், புரவலன் செயல்பாடு தொடக்கத்தில் உட்பொதிக்கப்பட்ட கோடோட் இயந்திரத்தைத் தொடங்கும். கோடோட் எஞ்சின் திட்டக் கோப்புகள் ஏற்றுவதற்கான `` சொத்துக்கள்`` கோப்பகத்தை சரிபார்க்கிறது (`` முதன்மையான பேக்`` தேடுவதற்கு கட்டமைக்கப்படாவிட்டால்), மேலும் திட்டத்தை இயக்கத் தொடரும்.
uk: Після завершення налаштування проекту Godot створіть і запустіть програму Android. Якщо налаштовано правильно, хост Activity ініціалізує вбудований Godot Engine під час запуску. Godot Engine перевірить каталог ``assets`` для завантаження файлів проекту (якщо не налаштовано шукати ``main pack``), і продовжить виконання проекту.
zh_cn: 完成对 Godot 项目的配置后，请构建并运行该 Android 应用。如果设置无误，宿主 Activity 就会在启动时初始化内嵌的 Godot 引擎。Godot 引擎会在 ``assets`` 目录中查找要加载的项目文件（除非配置中要求查找 ``main pack``\ ），然后开始运行项目。
zh_tw: 完成 Godot 專案設定後，建置並執行 Android 應用程式。若設定無誤，主 Activity 啟動時會初始化嵌入的 Godot 引擎，Godot 會自動從 ``assets`` 目錄載入專案（除非有指定 ``main pack``），然後執行專案。
