Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_library.po
Languages: ga, it, ru, ta, uk, zh_cn, zh_tw

source: Godot Android library
ga: Leabharlann Godot Android
it: Libreria Android di Godot
ru: Android библиотека в Godot
ta: கோடோட் ஆண்ட்ராய்டு நூலகம்
uk: Бібліотека Godot Android
zh_cn: Godot Android 库
zh_tw: Godot Android 函式庫

source: The Godot Engine for Android platforms is designed to be used as an `Android library <https://developer.android.com/studio/projects/android-library>`_. This architecture enables several key features on Android platforms:
ga: Tá an Inneall Godot le haghaidh ardáin Android deartha le húsáid mar leabharlann `Android <https://developer.android.com/studio/projects/android-library>`_. Cumasaíonn an ailtireacht seo roinnt príomhghnéithe ar ardáin Android:
ru: Godot Engine для платформ Android предназначен для использования в качестве `библиотеки Android <https://developer.android.com/studio/projects/android-library>`_. Эта архитектура обеспечивает несколько ключевых функций на платформах Android:
ta: ஆண்ட்ராய்டு இயங்குதளங்களுக்கான கோடோட் இயந்திரம் `Android நூலகமாக <https://developer.android.com/studio/projects/android-library>` _ ஆக பயன்படுத்த வடிவமைக்கப்பட்டுள்ளது. இந்த கட்டமைப்பு ஆண்ட்ராய்டு இயங்குதளங்களில் பல முக்கிய அம்சங்களை செயல்படுத்துகிறது:
uk: Godot Engine для платформ Android розроблено для використання як `бібліотеки Android <https://developer.android.com/studio/projects/android-library>`_. Ця архітектура забезпечує кілька ключових функцій на платформах Android:
zh_cn: 适用于 Android 平台的 Godot 引擎旨在作为 `Android 库 <https://developer.android.com/studio/projects/android-library>`_ 使用。该架构可在 Android 平台上实现多项关键功能：
zh_tw: Godot 引擎在 Android 平臺上被設計成可作為 `Android 函式庫 <https://developer.android.com/studio/projects/android-library>`_ 使用。這種架構在 Android 平臺上實現了幾項關鍵功能：

source: Ability to integrate the Gradle build system within the Godot Editor, which provides the ability to leverage more components from the Android ecosystem such as libraries and tools
ga: Cumas córas tógála Gradle a chomhtháthú laistigh den Eagarthóir Godot, a sholáthraíonn an cumas níos mó comhpháirteanna a ghiaráil ón éiceachóras Android mar leabharlanna agus uirlisí
ru: Возможность интеграции системы сборки Gradle в редактор Godot, что позволяет использовать больше компонентов экосистемы Android, таких как библиотеки и инструменты
ta: கோடோட் எடிட்டருக்குள் கிரேடில் பில்ட் அமைப்பை ஒருங்கிணைக்கும் திறன், இது நூலகங்கள் மற்றும் கருவிகள் போன்ற ஆண்ட்ராய்டு சுற்றுச்சூழல் அமைப்பிலிருந்து கூடுதல் கூறுகளை மேம்படுத்தும் திறனை வழங்குகிறது
uk: Можливість інтегрувати систему збирання Gradle у редактор Godot, що надає можливість використовувати більше компонентів екосистеми Android, таких як бібліотеки та інструменти
zh_cn: 能够将 Gradle 构建系统整合进 Godot 编辑器，从而提供了利用 Android 生态系统中更多组件的能力，比如库和工具
zh_tw: 可以在 Godot 編輯器內整合 Gradle 建構系統，進而運用更多 Android 生態系的函式庫與工具

source: Ability to make the engine portable and embeddable:
ga: Cumas an t-inneall iniompartha agus leabaithe a dhéanamh:
ru: Возможность сделать движок портативным и встраиваемым:
ta: இயந்திரத்தை சிறியதாகவும் உட்பொதிக்கக்கூடியதாகவும் மாற்றும் திறன்:
uk: Можливість зробити двигун портативним і вбудовуваним:
zh_cn: 能够使引擎具有便携性和可嵌入性:
zh_tw: 讓引擎具備可攜性與可嵌入性：

source: Key in enabling the port of the Godot Editor to Android and mobile XR devices
ga: Eochair chun calafort an Eagarthóra Godot a chumasú do ghléasanna Android agus soghluaiste XR
ru: Ключевой фактор, обеспечивающий возможность порта Godot Editor на устройства Android и мобильные устройства XR
ta: கோடோட் எடிட்டரின் துறைமுகத்தை ஆண்ட்ராய்டு மற்றும் மொபைல் எக்ச்ஆர் சாதனங்களுக்கு செயல்படுத்துவதில் முக்கியமானது
uk: Увімкніть порт редактора Godot для Android і мобільних пристроїв XR
zh_cn: 在使 Godot 编辑器能够移植到 Android 和移动 XR 设备中发挥关键作用
zh_tw: 這是讓 Godot 編輯器能移植到 Android 與行動 XR 裝置的關鍵

source: Key in allowing the integration and reuse of Godot's capabilities within existing codebase
ga: Eochair chun cumais Godot a chomhtháthú agus a athúsáid a cheadú laistigh den chód bonn atá ann cheana
ru: Ключ к обеспечению интеграции и повторного использования возможностей Godot в существующей кодовой базе
ta: ஏற்கனவே உள்ள கோட்பேசுக்குள் கோடோட்டின் திறன்களை ஒருங்கிணைத்து மறுபயன்பாடு செய்வதை அனுமதிப்பதில் முக்கியமானது
uk: Ключ у дозволі інтеграції та повторного використання можливостей Godot в існуючій кодовій базі
zh_cn: 在现有代码库中集成和重复使用 Godot 功能发挥关键作用
zh_tw: 也是將 Godot 功能整合並重複利用於現有程式碼庫的關鍵

source: Below we describe some of the use-cases and scenarios this architecture enables.
ga: Anseo thíos déanaimid cur síos ar chuid de na cásanna úsáide agus cásanna a chumasaíonn an ailtireacht seo.
ru: Ниже мы описываем некоторые варианты использования и сценарии, которые позволяет реализовать эта архитектура.
ta: இந்த கட்டிடக்கலை செயல்படுத்தும் சில பயன்பாட்டு-வழக்குகள் மற்றும் காட்சிகளை கீழே விவரிக்கிறோம்.
uk: Нижче ми описуємо деякі варіанти використання та сценарії, які дозволяє ця архітектура.
zh_cn: 下面我们描述了该架构支持的一些用例和场景。
zh_tw: 以下說明這種架構能實現的部分應用情境與案例。

source: Using the Godot Android library
ga: Leabharlann Godot Android a úsáid
it: Utilizzo della libreria Android di Godot
ru: Использование Android библиотеки
ta: கோடோட் ஆண்ட்ராய்டு நூலகத்தைப் பயன்படுத்துதல்
uk: Використання бібліотеки Godot Android
zh_cn: 使用 Godot Android 库
zh_tw: 使用 Godot Android 函式庫

source: The Godot Android library is packaged as an AAR archive file and hosted on `MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_ along with `its documentation <https://javadoc.io/doc/org.godotengine/godot/latest/index.html>`_.
ga: Tá leabharlann Godot Android pacáistithe mar chomhad cartlainne AAR agus á óstáil ar `MavenCentral <https://central.sonatype.com/artifact/org.godotenginine/godot>`_ mar aon le `a doiciméadú <https://javadoc.io /doc/org.godotengine/godot/latest/index.html>`_.
ru: Библиотека Godot для Android упакована в архивный файл AAR и размещена на `MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_ вместе с `ее документацией <https://javadoc.io/doc/org.godotengine/godot/latest/index.html>`_.
ta: கோடோட் ஆண்ட்ராய்டு நூலகம் ஒரு AAR காப்பகக் கோப்பாக தொகுக்கப்பட்டுள்ளது மற்றும் `Mavencentral <https://central.sonatype.com/artifact/org.godotengine/godot>` _ அதன் ஆவணங்களுடன் <https://javadoc.io /doc/org.godotengine/godot/latest/index.html>`_.
uk: Бібліотека Godot Android упакована як архівний файл AAR і розміщена на `MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_ разом із `її документацією <https://javadoc.io/doc/org.godotengine/godot/latest/index.html>`_.
zh_cn: Godot Android 库以 AAR 归档文件的形式打包，连同其 `文档 <https://javadoc.io/doc/org.godotengine/godot/latest/index.html>`_ 寄存在 `MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_ 上。
zh_tw: Godot Android 函式庫以 AAR 封裝格式發佈，托管於 `MavenCentral <https://central.sonatype.com/artifact/org.godotengine/godot>`_，同時提供 `API 文件 <https://javadoc.io/doc/org.godotengine/godot/latest/index.html>`_。

source: It provides access to Godot APIs and capabilities on Android platforms for the following non-exhaustive use-cases.
ga: Soláthraíonn sé rochtain ar APIs agus cumais Godot ar ardáin Android do na cásanna úsáide neamh-uileghabhálacha seo a leanas.
ru: Он обеспечивает доступ к API Godot и возможностям на платформах Android для следующих, неисчерпывающих вариантов использования.
ta: இது கோடோட் ஏபிஐகளுக்கான அணுகலை வழங்குகிறது மற்றும் பின்வரும் முழுமையான பயன்பாட்டு-வழக்குகளுக்கு ஆண்ட்ராய்டு இயங்குதளங்களில் திறன்களை வழங்குகிறது.
uk: Він надає доступ до API Godot і можливостей на платформах Android для наступних невичерпних варіантів використання.
zh_cn: 它提供了在 Android 平台上访问 Godot 应用程序接口和功能的途径，适用于以下不完全用例。
zh_tw: 它讓你可在 Android 平臺上存取 Godot API 與功能，應用情境包括但不限於。

source: Godot Android plugins
ga: Breiseáin Godot Android
it: Estensioni Android di Godot
ru: Плагины Godot для Android
ta: கோடோட் ஆண்ட்ராய்டு செருகுநிரல்கள்
uk: Плагіни Godot для Android
zh_cn: Godot Android 插件
zh_tw: Godot Android 外掛

source: Android plugins are powerful tools to extend the capabilities of the Godot Engine by tapping into the functionality provided by Android platforms and ecosystem.
ga: Is uirlisí cumhachtacha iad breiseáin Android chun cumais an Inneall Godot a leathnú trí thapáil ar an bhfeidhmiúlacht a sholáthraíonn ardáin agus éiceachóras Android.
ru: Плагины Android — это мощные инструменты для расширения возможностей Godot Engine путем использования функциональных возможностей, предоставляемых платформами и экосистемой Android.
ta: ஆண்ட்ராய்டு இயங்குதளங்கள் மற்றும் சுற்றுச்சூழல் அமைப்பு வழங்கிய செயல்பாட்டைத் தட்டுவதன் மூலம் கோடோட் இயந்திரத்தின் திறன்களை விரிவுபடுத்துவதற்கான சக்திவாய்ந்த கருவிகள் ஆண்ட்ராய்டு செருகுநிரல்கள்.
uk: Плагіни Android — це потужні інструменти для розширення можливостей Godot Engine за допомогою функціональних можливостей платформ і екосистеми Android.
zh_cn: Android 插件是一种强大的工具，可利用 Android 平台和生态系统提供的功能来扩展 Godot 引擎的功能。
zh_tw: Android 外掛是能擴充 Godot 引擎在 Android 平臺功能的強大工具，可利用 Android 生態系提供的各種功能。

source: An Android plugin is an Android library with a dependency on the Godot Android library which the plugin uses to integrate into the engine's lifecycle and to access Godot APIs, granting it powerful capabilities such as GDExtension support which allows to update / mod the engine behavior as needed.
ga: Is leabharlann Android é breiseán Android le spleáchas ar leabharlann Godot Android a úsáideann an breiseán chun comhtháthú i saolré an innill agus chun rochtain a fháil ar APIs Godot, ag tabhairt cumais chumhachtacha dó mar thacaíocht GDExTension a cheadaíonn iompar an innill a nuashonrú/mod de réir mar is gá.
ru: Плагин Android — это библиотека Android, зависящая от библиотеки Godot Android, которую плагин использует для интеграции в жизненный цикл движка и доступа к API Godot, предоставляя ему мощные возможности, такие как поддержка GDExtension, которая позволяет обновлять/модифицировать поведение движка по мере необходимости.
ta: அண்ட்ராய்டு சொருகி என்பது கோடோட் ஆண்ட்ராய்டு நூலகத்தை சார்ந்து இருக்கும் ஆண்ட்ராய்டு நூலகமாகும், இது இயந்திரத்தின் வாழ்க்கைச் சுழற்சியில் ஒருங்கிணைக்கவும், கோடோட் ஏபிஐக்களை அணுகவும் சொருகி பயன்படுத்துகிறது, இது gdextension உதவி போன்ற சக்திவாய்ந்த திறன்களை வழங்குகிறது, இது தேவைக்கேற்ப இயந்திர நடத்தையை புதுப்பிக்க / மோட் செய்ய அனுமதிக்கிறது .
uk: Плагін Android — це бібліотека Android із залежністю від бібліотеки Godot Android, яку плагін використовує для інтеграції в життєвий цикл двигуна та доступу до API Godot, надаючи йому потужні можливості, такі як підтримка GDExtension, яка дозволяє оновлювати/змінювати поведінку двигуна за потреби.
zh_cn: Android 插件是一个依赖于 Godot Android 库的 Android 库，插件使用该库集成到引擎的生命周期中，并访问 Godot API，从而赋予其强大的功能，例如 GDExtension 支持，允许根据需要更新/修改引擎行为。
zh_tw: Android 外掛本質上是依賴 Godot Android 函式庫的 Android 函式庫，可整合進 Godot 引擎的生命週期並存取 Godot API，進而實現強大功能，例如 GDExtension 支援，讓你可依需求動態擴充或修改引擎行為。

source: For more information, see :ref:`Godot Android plugins <doc_android_plugin>`.
ga: Le haghaidh tuilleadh faisnéise, féach :ref:`Forlíontáin Godot Android <doc_android_plugin>`.
it: Per ulteriori informazioni, consultare :ref:`Godot Android plugins <doc_android_plugin>`.
ru: Для получения более подробной информации см. :ref:`Godot Android plugins <doc_android_plugin>`.
ta: மேலும் தகவலுக்கு, காண்க: குறிப்பு: `கோடோட் ஆண்ட்ராய்டு செருகுநிரல்கள் <doc_android_plugin>`.
uk: Для отримання додаткової інформації див. :ref:`Godot Android plugins <doc_android_plugin>`.
zh_cn: 详情见 :ref:`Godot Android 插件 <doc_android_plugin>`\ 。
zh_tw: 詳情請參見 :ref:`Godot Android 外掛 <doc_android_plugin>`。

source: Embedding Godot in existing Android projects
ga: Godot a ionchorprú i dtionscadail Android atá ann cheana
ru: Встраивание Godot в существующие проекты Android
ta: தற்போதுள்ள ஆண்ட்ராய்டு திட்டங்களில் கோடோட்டை உட்பொதித்தல்
uk: Вбудовування Godot в існуючі проекти Android
zh_cn: 将 Godot 嵌入到已有 Android 项目中
zh_tw: 將 Godot 嵌入現有 Android 專案

source: The Godot Engine can be embedded within existing Android applications or libraries, allowing developers to leverage mature and battle-tested code and libraries better suited to a specific task.
ga: Is féidir an Inneall Godot a neadú laistigh d'fheidhmchláir nó do leabharlanna Android atá ann cheana féin, rud a ligeann d'fhorbróirí cód aibí agus cath-thástáil agus leabharlanna a oireann níos fearr do thasc ar leith a ghiaráil.
ru: Godot Engine можно встраивать в существующие приложения или библиотеки Android, что позволяет разработчикам использовать проверенный и надежный код и библиотеки, которые лучше подходят для решения конкретной задачи.
ta: கோடோட் எஞ்சின் தற்போதுள்ள ஆண்ட்ராய்டு பயன்பாடுகள் அல்லது நூலகங்களுக்குள் உட்பொதிக்கப்படலாம், இது உருவாக்குபவர்கள் முதிர்ந்த மற்றும் போர் சோதிக்கப்பட்ட குறியீட்டை மேம்படுத்த அனுமதிக்கிறது மற்றும் நூலகங்கள் ஒரு குறிப்பிட்ட பணிக்கு மிகவும் பொருத்தமானவை.
uk: Godot Engine можна вбудувати в існуючі програми або бібліотеки Android, дозволяючи розробникам використовувати зрілий і перевірений у боях код і бібліотеки, які краще підходять для конкретного завдання.
zh_cn: Godot 引擎可以嵌入现有的 Android 应用程序或库中，使开发人员能够利用成熟且经过考验的代码和库，更适合特定任务。
zh_tw: Godot 引擎可嵌入現有的 Android 應用程式或函式庫，讓開發者能善用既有穩定的程式碼與函式庫，提升專案效率。

source: The hosting component is responsible for driving the engine lifecycle via Godot's Android APIs. These APIs can also be used to provide bidirectional communication between the host and the embedded Godot instance allowing for greater control over the desired experience.
ga: Tá an chomhpháirt óstála freagrach as saolré an innill a thiomáint trí APIs Android Godot. Is féidir na APIs seo a úsáid freisin chun cumarsáid dhá threorach a sholáthar idir an t-óstach agus an sampla Godot leabaithe a cheadaíonn smacht níos mó ar an taithí atá ag teastáil.
ru: Компонент хостинга отвечает за управление жизненным циклом движка через API-ы Godot для Android. Эти API-ы также можно использовать для обеспечения двунаправленной связи между хостом и встроенным экземпляром Godot, что обеспечивает более точный контроль над желаемым взаимодействием.
ta: கோடோட்டின் ஆண்ட்ராய்டு ஏபிஐக்கள் வழியாக என்சின் வாழ்க்கைச் சுழற்சியை இயக்குவதற்கு ஓச்டிங் கூறு பொறுப்பாகும். இந்த பநிஇ கள் ஓச்டுக்கும் உட்பொதிக்கப்பட்ட கோடோட் நிகழ்வுக்கும் இடையில் இருதரப்பு தகவல்தொடர்புகளை வழங்கவும் பயன்படுத்தப்படலாம்.
uk: Компонент хостингу відповідає за керування життєвим циклом двигуна через Android API Godot. Ці API також можна використовувати для забезпечення двонаправленого зв’язку між хостом і вбудованим екземпляром Godot, що дозволяє краще контролювати бажаний досвід.
zh_cn: 托管组件负责通过 Godot 的 Android API 来驱动引擎的生命周期。这些 API 还可用于在主机和嵌入式 Godot 实例之间提供双向通信，从而更好地控制所需的体验。
zh_tw: 主程式負責透過 Godot 的 Android API 管理引擎生命週期。這些 API 也可用來實現主程式與嵌入的 Godot 實例之間的雙向通訊，讓你更細緻地掌控整體體驗。

source: We showcase how this is done using a sample Android app that embeds the Godot Engine as an Android view, and uses it to render 3D glTF models.
ru: Мы демонстрируем, как это делается, на примере приложения для Android, которое встраивает Godot Engine в качестве представления Android и использует его для рендеринга 3D-моделей glTF.
uk: Ми демонструємо, як це робиться, використовуючи зразок програми для Android, яка вбудовує Godot Engine як вигляд Android і використовує його для візуалізації 3D-моделей glTF.
zh_tw: 以下將以範例 Android App 說明如何將 Godot 引擎嵌入 Android 檢視元件並用於渲染 3D glTF 模型。

source: The `GLTF Viewer <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_ sample app uses an `Android RecyclerView component <https://developer.android.com/develop/ui/views/layout/recyclerview>`_ to create a list of glTF items, populated from `Kenney's Food Kit pack <https://kenney.nl/assets/food-kit>`_. When an item on the list is selected, the app's logic interacts with the embedded Godot Engine to render the selected glTF item as a 3D model.
ru: Пример приложения `GLTF Viewer <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_ использует компонент `Android RecyclerView <https://developer.android.com/develop/ui/views/layout/recyclerview>`_ для создания списка элементов glTF, заполненного из набора `Kenney's Food Kit <https://kenney.nl/assets/food-kit>`_. При выборе элемента из списка логика приложения взаимодействует со встроенным движком Godot Engine для визуализации выбранного элемента glTF в виде 3D-модели.
uk: Зразок програми `GLTF Viewer <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_ використовує компонент `Android RecyclerView <https://developer.android.com/develop/ui/views/layout/recyclerview>`_ для створення списку елементів glTF, заповненого з `Kenney's Food Комплект набору <https://kenney.nl/assets/food-kit>`_. Коли вибрано елемент у списку, логіка програми взаємодіє з вбудованим механізмом Godot Engine, щоб відобразити вибраний елемент glTF як 3D-модель.
zh_cn: `GLTF Viewer <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_ 示例应用程序使用 `Android RecyclerView component <https://developer.android.com/develop/ui/views/layout/recyclerview>`_ 来创建 GLTF 项目列表，该列表由 `Kenney's Food Kit pack <https://kenney.nl/assets/food-kit>`_ 填充 。当选择列表中的项目时，应用程序的逻辑与嵌入式 Godot 引擎交互，将选定的 GLTF 项目渲染为 3D 模型。
zh_tw: `GLTF Viewer <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_ 範例 App 採用 Android 的 `RecyclerView <https://developer.android.com/develop/ui/views/layout/recyclerview>`_ 元件，顯示來自 `Kenney's Food Kit <https://kenney.nl/assets/food-kit>`_ 資源包的 glTF 項目清單。當某項目被選取時，App 會呼叫嵌入的 Godot 引擎渲染該 3D 模型。

source: The sample app source code can be found `on GitHub <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_. Follow the instructions on `its README <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ to build and install it.
ga: Is féidir cód foinse na haipe samplach a fháil `ar GitHub <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_. Lean na treoracha ar `a README <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ chun é a thógáil agus a shuiteáil.
ru: Исходный код примера приложения можно найти `на GitHub <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_. Следуйте инструкциям `в файле README <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_, чтобы собрать и установить его.
ta: மாதிரி பயன்பாட்டு மூலக் குறியீட்டை `Kithub <https://github.com/m4gr3d/godot-android-samples/tree/master/apps/gltf_viewer>` _ இல் காணலாம். `அதன் ரீட்மே <https://github.com/m4gr3d/godot-android-samples/blob/master/apps/gltf_viewer/readme.md>` _ _ இல் உள்ள வழிமுறைகளைப் பின்பற்றவும்.
uk: Зразок вихідного коду програми можна знайти `on GitHub <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_. Дотримуйтесь інструкцій на `its README <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ побудувати та встановити його.
zh_cn: 示例应用程序源代码可以在 `GitHub <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_ 上找到。按照其 `README <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ 上的说明来进行构建和安装。
zh_tw: 範例 App 原始碼可於 `GitHub <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/apps/gltf_viewer>`_ 取得，請依 `README <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/README.md>`_ 說明進行建置與安裝。

source: Below we break-down the steps used to create the GLTF Viewer app.
ga: Thíos déanaimid miondealú síos na céimeanna a úsáidtear chun an aip GLTF Viewer a chruthú.
ru: Ниже мы подробно описываем этапы создания приложения GLTF Viewer.
ta: GLTF பார்வையாளர் பயன்பாட்டை உருவாக்கப் பயன்படுத்தப்படும் படிகளை கீழே உடைப்போம்.
uk: Нижче ми розбираємо етапи створення програми GLTF Viewer.
zh_cn: 下面我们详细介绍了创建 GLTF 查看器应用程序的步骤。
zh_tw: 以下拆解 GLTF Viewer app 的製作步驟。

source: Currently only a single instance of the Godot Engine is supported per process. You can configure the process the Android Activity runs under using the `android:process attribute <https://developer.android.com/guide/topics/manifest/activity-element#proc>`_.
ga: Faoi láthair ní thacaítear ach le cás amháin den Inneall Godot in aghaidh an phróisis. Is féidir leat an próiseas a ritheann Gníomhaíocht Android faoi a chumrú trí úsáid a bhaint as an tréith `android:process' <https://developer.android.com/guide/topics/manifest/activity-element#proc>`_.
ru: В настоящее время поддерживается только один экземпляр Godot Engine на процесс. Вы можете настроить процесс, в котором будет запущена Android Activity, с помощью `атрибута android:process <https://developer.android.com/guide/topics/manifest/activity-element#proc>`_.
ta: தற்போது கோடோட் இயந்திரத்தின் ஒரு நிகழ்வு மட்டுமே ஒரு செயல்முறைக்கு ஆதரிக்கப்படுகிறது. `Android: செயல்முறை பண்புக்கூறு <https://developer.android.com/guide/topics/manifest/activity-element#proc>` _ ஆகியவற்றைப் பயன்படுத்தி ஆண்ட்ராய்டு செயல்பாடு இயங்கும் செயல்முறையை நீங்கள் உள்ளமைக்கலாம்.
uk: Наразі для кожного процесу підтримується лише один екземпляр Godot Engine. Ви можете налаштувати процес, у якому виконується Android Activity, за допомогою атрибута `android:process <https://developer.android.com/guide/topics/manifest/activity-element#proc>`_.
zh_cn: 目前，每个进程仅支持单个 Godot 引擎实例。你可以使用 `android:process 属性 <https://developer.android.com/guide/topics/manifest/activity-element#proc>`_ 来配置 Android Activity 运行的进程。
zh_tw: 目前每個行程僅支援一個 Godot 引擎實例。你可使用 `android:process 屬性 <https://developer.android.com/guide/topics/manifest/activity-element#proc>`_ 設定 Activity 所屬行程。

source: Automatic resizing / orientation configuration events are not supported and may cause a crash. You can disable those events:
ga: Ní thacaítear le himeachtaí cumraíochta athraitheacha/treoshuíomh uathoibríoch agus féadfaidh siad timpiste Is féidir leat na himeachtaí sin a dhíchumasú:
ru: События автоматического изменения размера/ориентации не поддерживаются и могут привести к сбою. Вы можете отключить эти события:
ta: தானியங்கி மறுஅளவிடுதல் / நோக்குநிலை உள்ளமைவு நிகழ்வுகள் ஆதரிக்கப்படவில்லை மற்றும் செயலிழப்பை ஏற்படுத்தக்கூடும். அந்த நிகழ்வுகளை நீங்கள் முடக்கலாம்:
uk: Події автоматичної зміни розміру/конфігурації орієнтації не підтримуються та можуть призвести до збою. Ви можете вимкнути ці події:
zh_cn: 不支持自动调整大小/方向配置事件，这些事件可能会导致系统崩溃。你可以禁用这些事件：
zh_tw: 目前不支援自動調整大小／方向等設定事件，否則可能導致當機。你可停用相關事件：

source: By locking to a specific orientation using the `android:screenOrientation attribute <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_.
ga: Trí ghlasáil chuig treoshuíomh sonrach ag baint úsáide as an aitreabúid `android:screenOrientation <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_.
ru: Путем фиксации определенной ориентации с помощью `атрибута android:screenOrientation <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_.
ta: `Android: ச்கிரீனோயண்டேசன் பண்புக்கூறு <https://developer.android.com/guide/topics/manifest/activity-element#screen> _ _ ஐப் பயன்படுத்தி ஒரு குறிப்பிட்ட நோக்குநிலைக்கு பூட்டுவதன் மூலம்.
uk: За допомогою фіксації певної орієнтації за допомогою атрибута `android:screenOrientation <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_.
zh_cn: 通过使用 `android:screenOrientation 属性 <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_ 来锁定到特定方向。
zh_tw: 可透過 `android:screenOrientation 屬性 <https://developer.android.com/guide/topics/manifest/activity-element#screen>`_ 鎖定特定畫面方向。
