Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_plugin.po
Languages: ga, it, ru, ta, uk, zh_hans, zh_tw

source: Create `GodotAndroidPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/a01286b4cb459133bf07b11dfabdfd3980268797/plugin/src/main/java/org/godotengine/plugin/android/template/GodotAndroidPlugin.kt#L10>`_, an init class for the plugin extending `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_.
ga: Cruthaigh `GodotAndroidPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/a01286b4cb459133bf07b11dfabdfd3980268797/plugin/src/main/java/orgplugin/ .kt#L10> `_, rang init don breiseán a leathnaíonn `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/srcot/Godgina/ #L80>`_.
ru: Создайте `GodotAndroidPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/a01286b4cb459133bf07b11dfabdfd3980268797/plugin/src/main/java/org/godotengine/plugin/android/template/GodotAndroidPlugin.kt#L10>`_, класс инициализации для плагина, расширяющего `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_.
ta: Create `GodotAndroidPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/a01286b4cb459133bf07b11dfabdfd3980268797/plugin/src/main/java/org/godotengine/plugin/android/template/GodotAndroidPlugin.kt#L10> `_, an init வகுப்பு க்கு the சொருகு extending `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java #L80> `_.
uk: Створити `GodotAndroidPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/a01286b4cb459133bf07b11dfabdfd3980268797/plugin/src/main/java/org/godotengine/plugin/android/template/GodotAndroidPlugin.kt#L10>`_, клас ініціалізації для розширення плагіна `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_.
zh_hans: 创建 `GodotAndroidPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/a01286b4cb459133bf07b11dfabdfd3980268797/plugin/src/main/java/org/godotengine/plugin/android/template/GodotAndroidPlugin.kt#L10>`_\ ，这是一个用于插件的初始化类，扩展自 `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_\ 。
zh_tw: 建立 `GodotAndroidPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/a01286b4cb459133bf07b11dfabdfd3980268797/plugin/src/main/java/org/godotengine/plugin/android/template/GodotAndroidPlugin.kt#L10>`_，該類別需繼承自 `GodotPlugin <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L80>`_。

source: If the plugin exposes Kotlin or Java methods to be called from GDScript, they must be annotated with `@UsedByGodot <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/UsedByGodot.java#L45>`_. The name called from GDScript **must match the method name exactly**. There is **no** coercing ``snake_case`` to ``camelCase``. For example, from GDScript::
ta: சொருகி gdscript இலிருந்து அழைக்கப்படும் கோட்லின் அல்லது சாவா முறைகளை அம்பலப்படுத்தினால், அவை `@usedbygodot <https://github.com/godotengine/godot/blob/0a7f75ec7b464b6496c8f5f5f1d638adbolorgalorgalorg . GDSCRIPT ** இலிருந்து அழைக்கப்படும் பெயர் முறை பெயருடன் சரியாக பொருந்த வேண்டும் **. ** இல்லை ** `` பாம்பு_கேச்`` `` ஒட்டக கேச்`` கட்டாயப்படுத்துகிறது. எடுத்துக்காட்டாக, gdscript :: இலிருந்து
uk: Якщо плагін надає методи Kotlin або Java для виклику з GDScript, вони повинні бути анотовані `@UsedByGodot <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/UsedByGodot.java#L45>`_. Ім’я, викликане з GDScript, **має точно відповідати імені методу**. **Немає** приведення ``snake_case`` до ``camelCase``. Наприклад, з GDScript::

source: If the plugin uses `signals <https://docs.godotengine.org/en/stable/getting_started/step_by_step/signals.html>`_, the init class must return the set of signals used by overriding `GodotPlugin::getPluginSignals() <https://github.com/godotengine/godot/blob/fa3428ff25bc577d2a3433090478a6d615567056/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L302>`_. To emit signals, the plugin can use the `GodotPlugin::emitSignal(...) method <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L317>`_.
ga: Má úsáideann an breiseán `comharthaí <https://docs.godotengine.org/en/stable/getting_started/step_by_step/signals.html>`_, ní mór don rang tionscnaimh an tacar comharthaí a úsáideadh trí `GodotPlugin a shárú::getPluginSignals( ) <https://github.com/godotengine/godot/blob/fa3428ff25bc577d2a3433090478a6d615567056/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotLu3 Chun comharthaí a astú, is féidir leis an mbreiseán an modh `GodotPlugin::emitSignal(...) a úsáid <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platformandroit/ /godot/plugin/GodotPlugin.java#L317>`_.
ru: Если плагин использует `signals <https://docs.godotengine.org/en/stable/getting_started/step_by_step/signals.html>`_, класс init должен возвращать набор сигналов, используемых при переопределении `GodotPlugin::getPluginSignals() <https://github.com/godotengine/godot/blob/fa3428ff25bc577d2a3433090478a6d615567056/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L302>`_.Для подачи сигналов плагин может использовать метод `GodotPlugin::emitSignal(...)<https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L317>`_.
ta: சொருகி `சிக்னல்களை <https://docs.godotengine.org/en/stable/getting_started/step_by_step/signals.html> _ _ பயன்படுத்தினால், init வகுப்பு` gototpluguningin :: getPluginignals (getpluginalals ( ) <https://github.com/godotengine/godot/blob/fa3428ff25bc577d2a3433333333333333333333333333334615567056/platform/android/java/src/orc/gruganol. சமிக்ஞைகளை வெளியிடுவதற்கு, சொருகி `kodotplugin :: emitsignal (...) முறை <https://github.com/godotengin/godot/blob/0a7f75ec7b46565604b6496f5f5f1d638aed250d550d6dmatrgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgorgans ஐப் பயன்படுத்தலாம். /godot/plugin/godotplugin.java#l317>`_.
uk: Якщо плагін використовує `signals <https://docs.godotengine.org/en/stable/getting_started/step_by_step/signals.html>`_, клас ініціалізації має повертати набір сигналів, які використовуються шляхом перевизначення `GodotPlugin::getPluginSignals() <https://github.com/godotengine/godot/blob/fa3428ff25bc577d2a3433090478a6d615567056/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L302>`_. Щоб надсилати сигнали, плагін може використовувати метод ` GodotPlugin::emitSignal(...) <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L317>`_.
zh_hans: 如果插件使用了 `signals <https://docs.godotengine.org/en/stable/getting_started/step_by_step/signals.html>`_ ，则类初始化时必须通过重写 `GodotPlugin::getPluginSignals() <https://github.com/godotengine/godot/blob/fa3428ff25bc577d2a3433090478a6d615567056/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L302>`_ 方法以返回所使用的信号集。\要发射信号，插件可以使用 `GodotPlugin::emitSignal(...) <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L317>`_ 方法。
zh_tw: 如果外掛有使用 `signals <https://docs.godotengine.org/en/stable/getting_started/step_by_step/signals.html>`_，初始化類別必須覆寫 `GodotPlugin::getPluginSignals() <https://github.com/godotengine/godot/blob/fa3428ff25bc577d2a3433090478a6d615567056/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L302>`_ 方法來回傳所有使用到的 signal。發送 signal 時可使用 `GodotPlugin::emitSignal(...) <https://github.com/godotengine/godot/blob/0a7f75ec7b465604b6496c8f5f1d638aed250d6d/platform/android/java/lib/src/org/godotengine/godot/plugin/GodotPlugin.java#L317>`_ 方法。

source: Update the plugin ``AndroidManifest.xml`` `file <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/src/main/AndroidManifest.xml>`_ with the following meta-data::
ta: செருகுநிரலைப் புதுப்பிக்கவும் மெட்டா-டேட்டா ::
uk: Оновіть плагін ``AndroidManifest.xml`` `file <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/src/main/AndroidManifest.xml>`_ з такими метаданими::

source: Where:
ga: Cá háit:
ru: Где:
ta: எங்கே:
uk: Де:
zh_hans: 其中：
zh_tw: 說明：

source: ``PluginName`` is the name of the plugin
ga: Is é ``PluginName`` ainm an breiseáin
ru: ``PluginName`` — имя плагина
ta: `` செருகுநிரல் பெயர்`` என்பது சொருகி பெயர்
uk: ``PluginName`` - це назва плагіна
zh_hans: ``PluginName`` 是插件的名称
zh_tw: ``PluginName``：外掛名稱

source: ``plugin.init.ClassFullName`` is the full component name (package + class name) of the plugin init class (e.g: ``org.godotengine.plugin.android.template.GodotAndroidPlugin``).
ga: Is é ``Plugin.init.classFullName`` ainm iomlán comhpháirteanna (ainm an phacáiste + ranga) den rang init breiseán (m.sh.: ``Org.GodoTengine.Plugin.Android.Template.GodotAndroidPlugin``).
it: ``plugin.init.ClassFullName`` è il nome completo del componente (pacchetto + nome della classe) della classe init del plugin (ad esempio: ``org.godotengine.plugin.android.template.GodotAndroidPlugin``).
ru: ``plugin.init.ClassFullName`` — это полное имя компонента (пакета + имя класса) класса init плагина (например: ``org.godotengine.plugin.android.template.GodotAndroidPlugin``).
ta: `` செருகுநிரல்.இன்.
uk: ``plugin.init.ClassFullName`` — це повна назва компонента (пакет + назва класу) класу ініціалізації плагіна (наприклад: ``org.godotengine.plugin.android.template.GodotAndroidPlugin``).
zh_hans: ``plugin.init.ClassFullName`` 是插件初始化类的完整组件名称（包 + 类名）（例如：\ ``org.godotengine.plugin.android.template.GodotAndroidPlugin``\ ）。
zh_tw: ``plugin.init.ClassFullName``：外掛初始化類別的完整元件名稱（套件名稱 + 類別名稱），例如 ``org.godotengine.plugin.android.template.GodotAndroidPlugin``。

source: Create the `EditorExportPlugin configuration <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_ to package the plugin. The steps used to create the configuration can be seen in the `Packaging a v2 Android plugin`_ section.
ga: Cruthaigh cumraíocht `EditorExportPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_ chun an breiseán a phacáistiú. Is féidir na céimeanna a úsáideadh chun an chumraíocht a chruthú a fheiceáil sa rannán `Pacáistiú breiseán v2 Android`_.
ru: Создайте конфигурацию `EditorExportPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_ для упаковки плагина. Шаги по созданию конфигурации можно найти в разделе `Упаковка плагина Android v2`_.
ta: Create the `EditorExportPlugin உள்ளமைவு <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_ பெறுநர் தொகுப்பு the plugin. உள்ளமைவை உருவாக்கப் பயன்படுத்தப்படும் படிகளை `பேக்கேசிங் ஒரு வி 2 ஆண்ட்ராய்டு செருகுநிரல்`_ பிரிவில் காணலாம்.
uk: Створіть конфігурацію `EditorExportPlugin <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_, щоб запакувати плагін. Кроки, використані для створення конфігурації, можна побачити в розділі `Пакування плагіна Android v2`_.
zh_hans: 创建 `EditorExportPlugin 配置 <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_\ 来打包插件。创建配置的步骤可以在《\ `打包 v2 Android 插件`_\ 》章节中看到。
zh_tw: 建立 `EditorExportPlugin 設定檔 <https://github.com/m4gr3d/Godot-Android-Plugin-Template/tree/main/plugin/export_scripts_template>`_ 以封裝外掛。詳細步驟請參考下方 `Packaging a v2 Android plugin`_ 章節。

source: Building a v2 Android plugin with GDExtension capabilities
ga: Breiseán v2 Android a thógáil le cumais GDExtension
ru: Создание плагина Android v2 с возможностями GDExtension
ta: Gdextension திறன்களுடன் வி 2 ஆண்ட்ராய்டு சொருகி உருவாக்குதல்
uk: Створення плагіна Android v2 із можливостями GDExtension
zh_hans: 构建带 GDExtension 能力的 v2 Android 插件
zh_tw: 建置具備 GDExtension 能力的 v2 Android 外掛

source: Similar to GDNative support in v1 Android plugins, v2 Android plugins support the ability to integrate GDExtension capabilities.
ga: Cosúil le tacaíocht GDNative i bhforlíontaí v1 Android, tacaíonn breiseáin v2 Android leis an gcumas cumais GDExtension a chomhtháthú.
ru: Подобно поддержке GDNative в плагинах Android v1, плагины Android v2 поддерживают возможность интеграции возможностей GDExtension.
ta: வி 1 ஆண்ட்ராய்டு செருகுநிரல்களில் சி.டி.என்.ஏடிவ் ஆதரவைப் போலவே, வி 2 ஆண்ட்ராய்டு செருகுநிரல்கள் சிடெக்ச்டென்சன் திறன்களை ஒருங்கிணைக்கும் திறனை ஆதரிக்கின்றன.
uk: Подібно до підтримки GDNative у плагінах Android версії 1, плагіни Android версії 2 підтримують можливість інтегрувати можливості GDExtension.
zh_hans: 与 v1 Android 插件中的 GDNative 支持类似，v2 Android 插件支持集成 GDExtension 功能。
zh_tw: 如同 v1 Android 外掛支援 GDNative，v2 Android 外掛同樣支援整合 GDExtension 能力。

source: A github project template is provided at https://github.com/m4gr3d/GDExtension-Android-Plugin-Template as a quickstart for building GDExtension Android plugins for Godot 4.2+. You can follow the `template's README <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template#readme>`_ to set up your own Godot Android plugin project.
ga: Soláthraítear teimpléad tionscadail github ag https://github.com/m4gr3d/GDExtension-Android-Plugin-Template mar thús tapa chun forlíontáin GDExtension Android a thógáil do Godot 4.2+. Is féidir leat an `teimpléad README a leanúint <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template#readme>`_ chun do thionscadal breiseán Godot Android féin a shocrú.
ru: Шаблон проекта GitHub доступен по адресу https://github.com/m4gr3d/GDExtension-Android-Plugin-Template в качестве руководства по быстрому началу работы над созданием плагинов GDExtension для Android для Godot 4.2 и более поздних версий. Чтобы настроить свой собственный проект плагина Godot для Android, ознакомьтесь с файлом README к шаблону <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template#readme>`_.
ta: ஒரு அறிவிலிமையம் திட்ட வார்ப்புரு https://github.com/m4gr3d/gdextension-android-plugin-template இல் கோடோட் 4.2+ க்கான gdextension ஆண்ட்ராய்டு செருகுநிரல்களை உருவாக்குவதற்கான விரைவானச்டார்டாக வழங்கப்படுகிறது. உங்கள் சொந்த கோடோட் ஆண்டோட் ஆண்ட்ராய்டு செருகுநிரல் திட்டத்தை அமைக்க `வார்ப்புருவின் ரீட்மே <https://github.com/m4gr3d/gdextension-android-plugin-template#readme> _ _ _ _` _ ஆகியவற்றைப் பின்பற்றலாம்.
uk: Шаблон проекту github надається за адресою https://github.com/m4gr3d/GDExtension-Android-Plugin-Template як швидкий старт для створення плагінів GDExtension Android для Godot 4.2+. Ви можете переглянути `README шаблону <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template#readme>`_, щоб налаштувати власний проект плагіна Godot для Android.
zh_hans: 在 https://github.com/m4gr3d/GDExtension-Android-Plugin-Template 提供了一个 github 项目模板，作为为 Godot 4.2+ 构建 GDExtension Android 插件的快速入门。你可以按照\ `模板的 README <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template#readme>`_ 来设置你自己的 Godot Android 插件项目。
zh_tw: 官方亦提供 https://github.com/m4gr3d/GDExtension-Android-Plugin-Template github 專案範本，可快速建立適用於 Godot 4.2+ 的 GDExtension Android 外掛。你可以參考 `範本 README <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template#readme>`_ 來設定自己的外掛專案。

source: Migrating a v1 Android plugin to v2
ga: Breiseán v1 Android a aistriú go v2
it: Migrazione di un'estensione Android v1 a v2
ru: Мигрирование v1 Android плагина в v2
ta: வி 1 ஆண்ட்ராய்டு சொருகி வி 2 க்கு இடம்பெயர்கிறது
uk: Перенесення плагіна Android v1 на v2
zh_hans: 将 v1 Android 插件迁移至 v2
zh_tw: 將 v1 Android 外掛移植至 v2

source: Use the following steps if you have a v1 Android plugin you want to migrate to v2:
ga: Úsáid na céimeanna seo a leanas má tá breiseán v1 Android agat gur mhaith leat aistriú go v2:
ru: Используйте следующие шаги, если хотите мигрировать ваш v1 Android плагин в v2:
ta: நீங்கள் வி 1 க்கு இடம்பெயர விரும்பும் வி 1 ஆண்ட்ராய்டு சொருகி இருந்தால் பின்வரும் படிகளைப் பயன்படுத்தவும்:
uk: Виконайте наведені нижче дії, якщо у вас є плагін Android версії 1, який ви хочете перенести на версію 2:
zh_hans: 如果你想要将 v1 Android 插件迁移至 v2，请使用以下步骤：
zh_tw: 如果你有 v1 Android 外掛想要移植到 v2，請依照下列步驟進行：

source: Update the plugin's manifest file:
ga: Nuashonraigh comhad léirithe an bhreiseáin:
ru: Обновите файл манифеста плагина:
ta: சொருகி வெளிப்படையான கோப்பைப் புதுப்பிக்கவும்:
uk: Оновіть файл маніфесту плагіна:
zh_hans: 更新插件的清单文件：
zh_tw: 更新外掛的 manifest 檔案：

source: Change the ``org.godotengine.plugin.v1`` prefix to ``org.godotengine.plugin.v2``
ga: Athraigh an réimír ``org.godotengine.plugin.v1 ``go ``org.godotengine.plugin.v2``
it: Cambia il prefisso ``org.godotengine.plugin.v1`` in ``org.godotengine.plugin.v2``
ru: Замените префикс ``org.godotengine.plugin.v1`` на ``org.godotengine.plugin.v2``
ta: `` Org.godotengine.plugin.v1`` முன்னொட்டை `` org.godotengine.plugin.v2`` ஆக மாற்றவும்
uk: Змініть префікс ``org.godotengine.plugin.v1`` на ``org.godotengine.plugin.v2``
zh_hans: 将 ``org.godotengine.plugin.v1`` 前缀改为 ``org.godotengine.plugin.v2``
zh_tw: 將 ``org.godotengine.plugin.v1`` 前綴改為 ``org.godotengine.plugin.v2``

source: Update the Godot Android library build dependency:
ga: Nuashonraigh spleáchas tógála leabharlann Godot Android:
ru: Обновите зависимость сборки библиотеки Godot для Android:
ta: கோடோட் ஆண்ட்ராய்டு நூலகத்தை உருவாக்குதல் சார்புநிலையைப் புதுப்பிக்கவும்:
uk: Оновіть залежність збірки бібліотеки Godot Android:
zh_hans: 更新 Godot Android 库构建依赖：
zh_tw: 更新 Godot Android 函式庫建置相依性：

source: You can continue using the ``godot-lib.<version>.<status>.aar`` binary from `Godot's download page <https://godotengine.org/download>`_ if that's your preference. Make sure it's updated to the latest stable version.
ga: Is féidir leat leanúint ar aghaidh ag baint úsáide as an ``godot-lib.<leagan>.<status>.aar`` dhénártha ó leathanach íoslódála `Godot <https://godotengine.org/download>`_ más é sin do rogha. Déan cinnte go bhfuil sé nuashonraithe go dtí an leagan cobhsaí is déanaí.
ru: Вы можете продолжать использовать исполняемый файл ``godot-lib.<version>.<status>.aar`` со страницы загрузки Godot <https://godotengine.org/download>`_, если вам так удобнее. Убедитесь, что он обновлён до последней стабильной версии.
ta: `` கோடோட்-லிப். இது அண்மைக் கால நிலையான பதிப்பிற்கு புதுப்பிக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: Ви можете продовжувати використовувати двійковий файл ``godot-lib.<version>.<status>.aar`` зі `сторінки завантаження Godot <https://godotengine.org/download>`_, якщо це ваші переваги. Переконайтеся, що його оновлено до останньої стабільної версії.
zh_hans: 如果你愿意，你可以继续使用\ `Godot 的下载页面 <https://godotengine.org/download>`_\ 中的 ``godot-lib.<version>.<status>.aar`` 可执行文件。确保它已更新到最新的稳定版本。
zh_tw: 你可以繼續使用從 `Godot 下載頁 <https://godotengine.org/download>`_ 取得的 ``godot-lib.<版本>.<狀態>.aar`` 二進位檔，但請確認已更新到最新穩定版。

source: Or you can switch to the MavenCentral provided dependency::
ta: அல்லது நீங்கள் மேவென்சென்ட்ரல் வழங்கப்பட்ட சார்புநிலைக்கு மாறலாம் ::
uk: Або ви можете перейти до наданої MavenCentral залежності::

source: After updating the Godot Android library dependency, sync or build the plugin and resolve any compile errors:
ga: Tar éis spleáchas leabharlann Godot Android a nuashonrú, sioncrónaigh nó tóg an breiseán agus réitigh aon earráidí tiomsaithe:
ru: После обновления зависимости библиотеки Godot для Android синхронизируйте или соберите плагин и устраните любые ошибки компиляции:
ta: கோடோட் ஆண்ட்ராய்டு நூலக சார்புநிலையைப் புதுப்பித்த பிறகு, சொருகி ஒத்திசைக்கவும் அல்லது உருவாக்கவும் மற்றும் ஏதேனும் தொகுத்தல் பிழைகள் தீர்க்கவும்:
uk: Після оновлення залежності бібліотеки Godot Android синхронізуйте або створіть плагін і виправте будь-які помилки компіляції:
zh_hans: 更新 Godot Android 库依赖项后，同步或构建插件并解决任何编译错误：
zh_tw: 更新 Godot Android 函式庫相依性後，請同步或建置外掛，並解決所有編譯錯誤：

source: The ``Godot`` instance provided by ``GodotPlugin::getGodot()`` no longer has access to a ``android.content.Context`` reference. Use ``GodotPlugin::getActivity()`` instead.
ta: `` கோடோட்` நிகழ்வு `` கோடோட்ப்ளூசின் :: கெட்கோடோட் () `` இனி ஒரு `` android.content.context`` குறிப்புக்கு அணுகல் இல்லை. `` கோடோட்ப்ளூசின் :: getActivity () `` க்கு பதிலாக பயன்படுத்தவும்.
uk: Екземпляр ``Godot``, наданий ``GodotPlugin::getGodot()``, більше не має доступу до посилання ``android.content.Context``. Натомість використовуйте ``GodotPlugin::getActivity()``.

source: Delete the ``gdap`` configuration file(s) and follow the instructions in the `Packaging a v2 Android plugin`_ section to set up the plugin configuration.
ga: Scrios an comhad cumraíochta ``gdap`` agus lean na treoracha sa chuid `Pacáistiú a v2 Android plugin`_ chun cumraíocht an bhreiseáin a bhunú.
ru: Удалите файл(ы) конфигурации ``gdap`` и следуйте инструкциям в разделе `Packaging a v2 Android plugin`_, чтобы настроить конфигурацию плагина.
ta: செருகுநிரல் உள்ளமைவை அமைக்க `` GDAP`` உள்ளமைவு கோப்பு (கள்) நீக்கி, `பேக்கேசிங் ஒரு வி 2 ஆண்ட்ராய்டு செருகுநிரல்`_ பிரிவில் உள்ள வழிமுறைகளைப் பின்பற்றவும்.
uk: Видаліть файл(и) конфігурації ``gdap`` і дотримуйтесь інструкцій у розділі `Пакування плагіна v2 Android`_, щоб налаштувати конфігурацію плагіна.
zh_hans: 删除 ``gdap`` 配置文件并按照\ `打包 v2 Android 插件`_\ 章节中的说明设置插件配置。
zh_tw: 請刪除 ``gdap`` 設定檔，並依照 `Packaging a v2 Android plugin`_ 章節的說明重新設定外掛。

source: Packaging a v2 Android plugin
ga: Pacáistiú le breiseán v2 Android
ru: Упаковка плагина Android v2
ta: வி 2 ஆண்ட்ராய்டு சொருகி பேக்கேசிங்
uk: Пакування плагіна v2 для Android
zh_hans: 打包 v2 Android 插件
zh_tw: 封裝 v2 Android 外掛
