Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_library.po
Languages: ga, it, ru, ta, uk, zh_cn, zh_tw

source: By declaring that the Activity will handle these configuration events using the `android:configChanges attribute <https://developer.android.com/guide/topics/manifest/activity-element#config>`_.
ga: Agus é á dhearbhú go láimhseálfaidh an Ghníomhaíocht na himeachtaí cumraíochta seo ag baint úsáide as an aitreabúid `android:configChanges <https://developer.android.com/guide/topics/manifest/activity-element#config>`_.
ru: Объявив, что Activity будет обрабатывать эти события конфигурации с помощью `атрибута android:configChanges <https://developer.android.com/guide/topics/manifest/activity-element#config>`_.
ta: `Android: configchanges பண்புக்கூறு <https://developer.android.com/guide/topics/manifest/activity-element#config>` _ ஆகியவற்றைப் பயன்படுத்தி இந்த உள்ளமைவு நிகழ்வுகளை செயல்பாடு கையாளும் என்று அறிவிப்பதன் மூலம்.
uk: Оголосивши, що Activity оброблятиме ці події конфігурації за допомогою атрибута `android:configChanges <https://developer.android.com/guide/topics/manifest/activity-element#config>`_.
zh_cn: 通过声明 Activity 将使用 `android:configChanges 属性 <https://developer.android.com/guide/topics/manifest/activity-element#config>`_ 来处理这些配置事件。
zh_tw: 或於 AndroidManifest.xml 宣告 Activity 將處理這些設定事件（使用 `android:configChanges 屬性 <https://developer.android.com/guide/topics/manifest/activity-element#config>`_）。

source: 1. Create the Android app
ga: 1. Cruthaigh an aip Android
it: 1. Creare l'applicazione Android
ru: 1. Создание приложения (app) для Android
ta: 1. ஆண்ட்ராய்டு பயன்பாட்டை உருவாக்கவும்
uk: 1. Створіть додаток для Android
zh_cn: 1. 创建 Android 应用
zh_tw: 1. 建立 Android 應用程式

source: The Android sample app was created using `Android Studio <https://developer.android.com/studio>`_ and using `Gradle <https://developer.android.com/build>`_ as the build system.
ga: Cruthaíodh an aip shamplach Android ag baint úsáide as `Android Studio <https://developer.android.com/studio>`_ agus ag baint úsáide as `Gradle <https://developer.android.com/build>`_ mar an córas tógála.
ru: Пример приложения Android был создан с использованием `Android Studio <https://developer.android.com/studio>`_ и `Gradle <https://developer.android.com/build>`_ в качестве системы сборки.
ta: ஆண்ட்ராய்டு மாதிரி பயன்பாடு `Android ச்டுடியோ <https://developer.android.com/studio>` _ ஐப் பயன்படுத்தி உருவாக்கப்பட்டது மற்றும் `கிரேடில் <https://developer.android.com/build>` _ உருவாக்க அமைப்பைப் பயன்படுத்துகிறது.
uk: Зразок програми для Android було створено за допомогою `Android Studio <https://developer.android.com/studio>`_ з використанням `Gradle <https://developer.android.com/build>`_ як системи збірки.
zh_cn: Android 示例应用是使用 `Android Studio <https://developer.android.com/studio>`_ 和 `Gradle <https://developer.android.com/build>`_ 构建系统创建的。
zh_tw: 本範例 App 是透過 `Android Studio <https://developer.android.com/studio>`_ 製作，並使用 `Gradle <https://developer.android.com/build>`_ 當作建置系統。

source: The Android ecosystem provides multiple tools, IDEs, build systems for creating Android apps so feel free to use what you're familiar with, and update the steps below accordingly (contributions to this documentation are welcomed as well!).
ga: Soláthraíonn éiceachóras Android uirlisí iolracha, IDEanna, córais tógála chun aipeanna Android a chruthú agus mar sin ná bíodh drogall ort úsáid a bhaint as a bhfuil cur amach agat air, agus na céimeanna thíos a nuashonrú dá réir (cuirtear fáilte roimh ranníocaíochtaí leis an doiciméadú seo freisin!).
ru: Экосистема Android предоставляет множество инструментов, IDE и систем сборки для создания приложений Android, поэтому смело используйте то, с чем вы знакомы, и соответствующим образом обновляйте приведенные ниже шаги (вклад в эту документацию также приветствуется!).
ta: ஆண்ட்ராய்டு சுற்றுச்சூழல் அமைப்பு பல கருவிகள், IDE கள், ஆண்ட்ராய்டு பயன்பாடுகளை உருவாக்குவதற்கான அமைப்புகளை உருவாக்குகிறது, எனவே உங்களுக்கு தெரிந்ததைப் பயன்படுத்த தயங்கவும், அதற்கேற்ப கீழேயுள்ள படிகளைப் புதுப்பிக்கவும் (இந்த ஆவணங்களுக்கான பங்களிப்புகள் வரவேற்கப்படுகின்றன!).
uk: Екосистема Android надає численні інструменти, IDE, системи побудови для створення програм Android, тож не соромтеся використовувати те, що ви знаєте, і відповідним чином оновлювати наведені нижче кроки (внесок у цю документацію також вітається!).
zh_cn: Android 生态系统提供了多种工具、集成开发环境（IDE）和构建系统来创建 Android 应用程序，因此你可以自由选择自己熟悉的方式，并相应地更新下面的步骤（欢迎为这份文档做出贡献！）。
zh_tw: Android 生態系提供多種工具、IDE 與建置系統可用於開發 App，請依你習慣的工具調整下列步驟（也歡迎回饋本文件！）。

source: Set up an Android application project. It may be a brand new empty project, or an existing project
ga: Cuir tionscadal feidhmchláir Android ar bun. D'fhéadfadh gur tionscadal folamh úrnua é, nó tionscadal atá ann cheana
ru: Создайте проект приложения для Android. Это может быть совершенно новый пустой проект или существующий проект
ta: ஆண்ட்ராய்டு பயன்பாட்டு திட்டத்தை அமைக்கவும். இது ஒரு புதிய வெற்று திட்டமாக இருக்கலாம் அல்லது ஏற்கனவே உள்ள திட்டமாக இருக்கலாம்
uk: Налаштуйте проект програми Android. Це може бути абсолютно новий порожній проект або існуючий проект
zh_cn: 设置一个 Android 应用程序项目，可以是全新的空项目，也可以是现有的项目
zh_tw: 建立一個 Android 專案，可為全新或既有專案

source: Add the `maven dependency for the Godot Android library <https://central.sonatype.com/artifact/org.godotengine/godot>`_
ga: Cuir leis an `spleáchas maven do leabharlann Godot Android <https://central.sonatype.com/artifact/org.godotenginine/godot>`_
ru: Добавьте `maven-зависимость для библиотеки Godot для Android <https://central.sonatype.com/artifact/org.godotengine/godot>`_
ta: கோடோட் ஆண்ட்ராய்டு நூலகத்திற்கான `மேவன் சார்புநிலையைச் சேர்க்கவும்
uk: Додайте залежність `maven для бібліотеки Godot Android <https://central.sonatype.com/artifact/org.godotengine/godot>`_
zh_cn: 添加指向 `Godot Android 库的 Maven 依赖项 <https://central.sonatype.com/artifact/org.godotengine/godot>`_
zh_tw: 加入 `Godot Android 函式庫的 Maven 相依性 <https://central.sonatype.com/artifact/org.godotengine/godot>`_

source: If using ``gradle``, add the following to the ``dependency`` section of the app's gradle build file. Make sure to update ``<version>`` to the latest version of the Godot Android library:
ga: Má tá ``gradle`` in úsáid agat, cuir an méid seo a leanas leis an rannán ``dependency`` i gcomhad tógála gradle na haipe. Déan cinnte ``<leagan>`` a nuashonrú go dtí an leagan is déanaí de leabharlann Godot Android:
ru: Если вы используете ``gradle``, добавьте следующее в раздел ``dependency`` файла сборки Gradle приложения. Обязательно обновите ``<version>`` до последней версии библиотеки Godot для Android:
ta: `` கிரேடில்`` ஐப் பயன்படுத்தினால், பயன்பாட்டின் கிரேடில் பில்ட் கோப்பின் `` சார்பு`` பிரிவில் பின்வருவனவற்றைச் சேர்க்கவும். கோடோட் ஆண்ட்ராய்டு நூலகத்தின் அண்மைக் கால பதிப்பிற்கு `` <version> `` புதுப்பிக்க உறுதிசெய்க:
uk: Якщо ви використовуєте ``gradle``, додайте наступне до розділу ``dependency`` файлу збірки gradle програми. Обов’язково оновіть ``<version>`` до останньої версії бібліотеки Godot Android:
zh_cn: 如果使用 ``gradle``\ ，请在应用的 gradle 构建文件的 ``dependency`` 部分添加以下内容。确保将 ``<version>`` 更新为 Godot Android 库的最新版本：
zh_tw: 若使用 ``gradle``，請將以下內容加入 app gradle 設定檔的 ``dependency`` 區段，並將 ``<version>`` 換成 Godot Android 函式庫的最新版：

source: If using ``gradle``, include the following ``aaptOptions`` configuration under the ``android > defaultConfig`` section of the app's gradle build file. Doing so allows ``gradle`` to include Godot's hidden directories when building the app binary.
ga: Má tá ``gradle`` á úsáid agat, cuir an chumraíocht ``aaptOptions`` seo a leanas san áireamh faoin rannán `` android > defaultConfig`` de chomhad tógála gradle na haipe. Ligeann sé sin do ``gradle`` eolairí folaithe Godot a chur san áireamh agus an aip dhénártha á thógáil.
ru: При использовании ``gradle`` включите следующую конфигурацию ``aaptOptions`` в раздел ``android > defaultConfig`` файла сборки gradle приложения. Это позволит ``gradle`` включить скрытые каталоги Godot при сборке двоичного файла приложения.
ta: `` கிரேடில்`` ஐப் பயன்படுத்தினால், பயன்பாட்டின் கிரேடில் பில்ட் கோப்பின் `` Android> DefaultConfig`` பிரிவின் கீழ் பின்வரும் `` AAPTOPTIONS`` உள்ளமைவைச் சேர்க்கவும். அவ்வாறு செய்வது பைனரி பயன்பாட்டை உருவாக்கும் போது கோடோட்டின் மறைக்கப்பட்ட கோப்பகங்களை சேர்க்க `` கிரேடில்`` அனுமதிக்கிறது.
uk: Якщо ви використовуєте ``gradle``, додайте таку конфігурацію ``aaptOptions`` у розділ ``android > defaultConfig`` файлу збірки gradle програми. Це дозволяє ``gradle`` включати приховані каталоги Godot під час створення двійкового файлу програми.
zh_cn: 如果使用 ``gradle``\ ，请在应用的 gradle 构建文件的 ``android > defaultConfig`` 部分包含以下 ``aaptOptions`` 配置。这样就可以让 ``gradle`` 在构建应用二进制文件时包含 Godot 的隐藏目录。
zh_tw: 若使用 ``gradle``，請在 app gradle 設定檔的 ``android > defaultConfig`` 區段加入下列 ``aaptOptions`` 設定，可讓 gradle 在建置應用程式時包含 Godot 的隱藏目錄。

source: If your build system does not support including hidden directories, you can configure the Godot project to not use hidden directories by deselecting :ref:`Application > Config > Use Hidden Project Data Directory<class_ProjectSettings_property_application/config/use_hidden_project_data_directory>` in the Project Settings.
ru: Если ваша система сборки не поддерживает включение скрытых каталогов, вы можете настроить проект Godot так, чтобы он не использовал скрытые каталоги, сняв флажок :ref:`Application > Config > Use Hidden Project Data Directory<class_ProjectSettings_property_application/config/use_hidden_project_data_directory>` в Project Settings.
uk: Якщо ваша система збірки не підтримує включення прихованих каталогів, ви можете налаштувати проект Godot так, щоб він не використовував приховані каталоги, скасувавши прапорець :ref:`Application > Config > Use Hidden Project Data Directory<class_ProjectSettings_property_application/config/use_hidden_project_data_directory>` в налаштуваннях проекту.
zh_cn: 如果你的构建的系统不支持包含隐藏目录，你可以配置 Godot 项目不使用隐藏目录，通过在项目设置中取消选择 :ref:`应用 > 配置 > 使用隐藏的项目数据目录 <class_ProjectSettings_property_application/config/use_hidden_project_data_directory>` 。
zh_tw: 如果你的建置系統無法納入隱藏目錄，可在 Godot 專案設定取消勾選 :ref:`Application > Config > Use Hidden Project Data Directory<class_ProjectSettings_property_application/config/use_hidden_project_data_directory>`，避免使用隱藏專案資料夾。

source: Create / update the application's Activity that will be hosting the Godot Engine instance. For the sample app, this is `MainActivity <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt>`_
ga: Cruthaigh / nuashonraigh Gníomhaíocht an fheidhmchláir a bheidh mar óstach ar shampla Inneall Godot. Maidir leis an aip shamplach, is é seo `Príomhghníomhaíocht <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/ Príomhghníomhaíocht.kt>`_
it: Creare / aggiornare l'Attività dell'applicazione che ospiterà l'istanza di Godot Engine. Per l'applicazione di esempio, questa è `MainActivity <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt>`_
ru: Создайте/обновите Activity приложения, в котором будет размещен экземпляр Godot Engine. Для примера приложения это `MainActivity <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt>`_
ta: கோடோட் என்சின் நிகழ்வை வழங்கும் பயன்பாட்டின் செயல்பாட்டை உருவாக்கவும் / புதுப்பிக்கவும். மாதிரி பயன்பாட்டிற்கு, இது `முக்கியத்துவம் <https://github.com/m4gr3d/godot-android-samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/aptroid/android/gltfwiewer/ Mainactivity.kt> `_
uk: Створіть/оновіть програму Activity, яка розміщуватиме примірник Godot Engine. Для прикладу програми це `MainActivity <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt>`_
zh_cn: 创建或更新应用程序的 Activity，用于承载 Godot 引擎实例。即示例应用中的 `MainActivity <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt>`_
zh_tw: 建立或更新託管 Godot 引擎實例的 Activity。以範例 App 而言，對應檔案為 `MainActivity <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt>`_

source: The host Activity should implement the `GodotHost interface <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java>`_
ga: Ba cheart don Ghníomhaíocht óstaigh an comhéadan `GodotHost a chur i bhfeidhm <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java>`_
it: L'Attività host dovrebbe implementare l'interfaccia `GodotHost <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java>`_
ru: Хост Activity должен реализовывать `интерфейс GodotHost <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java>`_
ta: புரவலன் செயல்பாடு `கோடோச்ட் இடைமுகத்தை <https://github.com/godotengine/blob/master/platform/android/java/lib/src/org/godotengine/godotengine/godot/godothost.java> _ _
uk: Активність хоста має реалізовувати `інтерфейс GodotHost <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java>`_
zh_cn: 用于承载的 Activity 应当实现 `GodotHost 接口 <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java>`_
zh_tw: 主 Activity 應實作 `GodotHost 介面 <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotHost.java>`_

source: The sample app uses `Fragments <https://developer.android.com/guide/fragments>`_ to organize its UI, so it uses `GodotFragment <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotFragment.java>`_, a fragment component provided by the Godot Android library to automatically host and manage the Godot Engine instance.
ga: Úsáideann an aip shamplach `Fragments <https://developer.android.com/guide/fragments>`_ chun a Chomhéadain a eagrú, mar sin úsáideann sé `GodotFragment <https://github.com/godotenginine/godot/blob/master/ platform/android/java/lib/src/org/godotengine/godot/GodotFragment.java>`_, comhpháirt blúirí a sholáthraíonn leabharlann Godot Android chun ásc Inneall Godot a óstáil agus a bhainistiú go huathoibríoch.
ru: В примере приложения для организации пользовательского интерфейса используются `Фрагменты <https://developer.android.com/guide/fragments>`_, поэтому в нем используется компонент фрагмента `GodotFragment <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotFragment.java>`_, предоставляемый библиотекой Godot Android для автоматического размещения и управления экземпляром Godot Engine.
ta: மாதிரி பயன்பாடு `துண்டுகள் <https://developer.android.com/guide/fragments> அதன் இடைமுகம் ஐ ஒழுங்கமைக்க _ _ _, எனவே இது` கோடோட்ஃப்ராக்மென்ட் <https://github.com/godotengine/godotengine/godotengine/blob/master/ இயங்குதளம்/Android/java/lib/src/org/kodotengine/கோடோட்/கோடோட்ஃப்ராக்மென்ட்.சாவா> `_, கோடோட் ஆண்ட்ராய்டு நூலகத்தால் வழங்கப்பட்ட ஒரு துண்டு கூறு தானாகவே கோடோட் எஞ்சின் நிகழ்வை புரவலன் செய்யவும் நிர்வகிக்கவும்.
uk: Зразок програми використовує `Fragments <https://developer.android.com/guide/fragments>`_ для організації свого інтерфейсу користувача, тому він використовує `GodotFragment <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotFragment.java>`_, компонент фрагмента, наданий бібліотекою Godot Android для автоматичного розміщення та керування примірником Godot Engine.
zh_cn: 示例应用程序使用 `Fragment <https://developer.android.com/guide/fragments>`_ 来组织 UI，所以它使用 `GodotFragment <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotFragment.java>`_\ ，这是由 Godot Android 库提供的 fragment 组件，用于自动托管和管理 Godot 引擎实例。
zh_tw: 範例 App 以 `Fragments <https://developer.android.com/guide/fragments>`_ 組織 UI，並採用 Godot Android 函式庫內建的 `GodotFragment <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotFragment.java>`_ 元件自動託管與管理 Godot 引擎實例。

source: The Godot Android library also provide `GodotActivity <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotActivity.kt>`_, an Activity component that can be extended to automatically host and manage the Godot Engine instance.
ga: Soláthraíonn leabharlann Godot Android freisin `GodotActivity <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotActivity.kt>`_, agus Gníomhaíocht comhpháirt is féidir a leathnú chun go n-óstálann agus go n-óstálann sé go huathoibríoch an t-ionad Inneall Godot.
ru: Библиотека Godot для Android также предоставляет `GodotActivity <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotActivity.kt>`_, компонент Activity, который можно расширить для автоматического размещения и управления экземпляром Godot Engine.
ta: கோடோட் ஆண்ட்ராய்டு நூலகம் `கோடோடாக்டிவிட்டி <https://githodengin/godot/blob/master/platform/android/java/lib/src/org/godotengine/godotengin கோடோட் என்சின் நிகழ்வை தானாக புரவலன் செய்வதற்கும் நிர்வகிப்பதற்கும் நீட்டிக்கக்கூடிய கூறு.
uk: Бібліотека Godot Android також надає `GodotActivity <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotActivity.kt>`_, дію компонент, який можна розширити для автоматичного розміщення та керування примірником Godot Engine.
zh_cn: Godot Android 库还提供 `GodotActivity <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotActivity.kt>`_\ ，这是一个可以被扩展以自动托管和管理 Godot 引擎实例的 Activity 组件。
zh_tw: Godot Android 函式庫同時提供 `GodotActivity <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/GodotActivity.kt>`_，可直接繼承該 Activity，自動託管與管理 Godot 引擎實例。

source: Alternatively, applications can directly create a `Godot <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/Godot.kt>`_ instance, host and manage it themselves.
ga: De rogha air sin, is féidir le feidhmchláir `Godot <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/Godot.kt>`_ a chruthú go díreach, é a óstáil agus a bhainistiú iad féin.
ru: В качестве альтернативы приложения могут напрямую создавать экземпляр `Godot <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/Godot.kt>`_, размещать его и управлять им самостоятельно.
ta: மாற்றாக, பயன்பாடுகள் நேரடியாக ஒரு `கோடோட் <https://github.com/godotengine/godot/blob/mastor/platform/android/java/lib/src/org/godotengine/godotengine/godot/godot.kt> அதை புரவலன் செய்து நிர்வகிக்கவும்.
uk: Крім того, програми можуть безпосередньо створювати екземпляр `Godot <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/Godot.kt>`_, розміщувати та керувати ним самостійно.
zh_cn: 或者，应用程序可以直接创建一个 `Godot <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/Godot.kt>`_ 实例，来托管和管理。
zh_tw: 你也可以選擇直接建立 `Godot <https://github.com/godotengine/godot/blob/master/platform/android/java/lib/src/org/godotengine/godot/Godot.kt>`_ 實例，自行託管與管理。

source: Using `GodotHost#getHostPlugins(...) <https://github.com/m4gr3d/Godot-Android-Samples/blob/0e3440f357f8be5b4c63a4fe75766793199a99d0/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt#L55>`_, the sample app creates a `runtime GodotPlugin instance <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/AppPlugin.kt>`_ that's used to send :ref:`signals <doc_signals>` to the ``gdscript`` logic
ga: Ag baint úsáide as `GodotHost#getHostPlugins(...) <https://github.com/m4gr3d/Godot-Android-Samples/blob/0e3440f357f8be5b4c63a4fe75766793199a99d0/views/gltufrc/ /gltfviewer /MainActivity.kt#L55>`_, cruthaíonn an aip shamplach sampla `runtime GodotPlugin <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/ fhuyakou/godot/app/android/gltfviewer/AppPlugin.kt>`_ a úsáidtear chun :ref:`comharthaí <doc_signals>` a sheoladh chuig an loighic ``gdscript``
ru: Используя `GodotHost#getHostPlugins(...) <https://github.com/m4gr3d/Godot-Android-Samples/blob/0e3440f357f8be5b4c63a4fe75766793199a99d0/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt#L55>`_, пример приложения создает `экземпляр GodotPlugin среды выполнения <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/AppPlugin.kt>`_, который используется для отправки :ref:`signals <doc_signals>` к логике ``gdscript``
ta: `கோடோச்ட்#gethostplugins (...) roid/gltfviewer . fhuyakou/kodot/app/android/gltfviewer/appplugin.kt> `_ இது அனுப்ப பயன்படுகிறது: குறிப்பு:` சிக்னல்கள் <ock_signals> `` `gdscript`` தர்க்கத்திற்கு
uk: Використання `GodotHost#getHostPlugins(...) <https://github.com/m4gr3d/Godot-Android-Samples/blob/0e3440f357f8be5b4c63a4fe75766793199a99d0/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt#L55>`_, зразок програми створює екземпляр ` GodotPlugin під час виконання <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/AppPlugin.kt>`_ який використовується для надсилання :ref:`signals <doc_signals>` до логіки ``gdscript``
zh_cn: 使用 `GodotHost#getHostPlugins(...) <https://github.com/m4gr3d/Godot-Android-Samples/blob/0e3440f357f8be5b4c63a4fe75766793199a99d0/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt#L55>`_\ ，示例应用程序会创建一个\ `运行时 GodotPlugin 实例 <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/AppPlugin.kt>`_\ 来发送\ :ref:`信号 <doc_signals>`\ 到 ``gdscript`` 逻辑
zh_tw: 範例 App 透過 `GodotHost#getHostPlugins(...) <https://github.com/m4gr3d/Godot-Android-Samples/blob/0e3440f357f8be5b4c63a4fe75766793199a99d0/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/MainActivity.kt#L55>`_ 建立一個 `執行時 GodotPlugin 實例 <https://github.com/m4gr3d/Godot-Android-Samples/blob/master/apps/gltf_viewer/src/main/java/fhuyakou/godot/app/android/gltfviewer/AppPlugin.kt>`_ ，用於向 GDScript 邏輯發送 :ref:`signals <doc_signals>`
