Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/android/android_plugin.po
Languages: ga, it, ru, ta, uk, zh_hans, zh_tw

source: Godot 4.2 or higher is required
ga: Teastaíonn Godot 4.2 nó níos airde
ru: Необходим Godot 4.2 и выше
ta: கோடோட் 4.2 அல்லது அதற்கு மேற்பட்டது தேவை
uk: Потрібна версія Godot 4.2 або вище
zh_hans: 要求 Godot 4.2 或更高版本
zh_tw: 需要 Godot 4.2 或更高版本

source: v2 Android plugin requires the use of the `Gradle build process <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html#class-editorexportplatformandroid-property-gradle-build-use-gradle-build>`_.
ga: Éilíonn an breiseán v2 Android go n-úsáidfear an próiseas tógála gradle <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html#class-editorexportplatformandroid-property-gradle-build-use-gradle-build>` _.
ru: Для плагина Android v2 требуется использование `процесса сборки Gradle <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html#class-editorexportplatformandroid-property-gradle-build-use-gradle-build>`_.
ta: வி 2 ஆண்ட்ராய்டு செருகுநிரலுக்கு `கிரேடில் உருவாக்க செயல்முறை <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html#class-editorexportplatformandroid-pulal-buldustuse-buldustuse _.
uk: Плагін версії 2 для Android вимагає використання `процесу збирання Gradle <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html#class-editorexportplatformandroid-property-gradle-build-use-gradle-build>`_.
zh_hans: v2 Android 插件需要使用 `Gradle 构建过程 <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html#class-editorexportplatformandroid-property-gradle-build-use-gradle-build>`_\ 。
zh_tw: v2 Android 外掛必須配合 `Gradle 建構流程 <https://docs.godotengine.org/en/stable/classes/class_editorexportplatformandroid.html#class-editorexportplatformandroid-property-gradle-build-use-gradle-build>`_ 使用。

source: The provided github project templates include demo Godot projects for quick testing.
ga: Áirítear leis na teimpléid tionscadail github a chuirtear ar fáil tionscadail taispeána Godot le haghaidh tástála tapa.
ru: Предоставленные шаблоны проектов GitHub включают демонстрационные проекты Godot для быстрого тестирования.
ta: வழங்கப்பட்ட அறிவிலிமையம் திட்ட வார்ப்புருக்களில் விரைவான சோதனைக்கான டெமோ கோடோட் திட்டங்கள் அடங்கும்.
uk: Надані шаблони проектів github містять демонстраційні проекти Godot для швидкого тестування.
zh_hans: 提供的 github 项目模板包括用于快速测试的演示 Godot 项目。
zh_tw: 上述 github 專案範本都附有示範 Godot 專案，方便快速測試。

source: Copy the plugin's output directory (``addons/<plugin_name>``) to the target Godot project's directory
ga: Cóipeáil eolaire aschuir an bhreiseáin (`` addons/ <plugin_name>``) go dtí an sprioc-eolaire tionscadail Godot
ru: Скопируйте выходной каталог плагина (``addons/<plugin_name>``) в каталог целевого проекта Godot
ta: சொருகி வெளியீட்டு கோப்பகத்தை (`` addons/<செருகுநிரல்_பெயர்> ``) இலக்கு கோடோட் திட்டத்தின் கோப்பகத்திற்கு நகலெடுக்கவும்
uk: Скопіюйте вихідний каталог плагіна (``addons/<plugin_name>``) до каталогу цільового проекту Godot
zh_hans: 将插件的输出目录（\ ``addons/<plugin_name>``\ ）复制到目标 Godot 项目的目录
zh_tw: 將外掛的輸出目錄（``addons/<plugin_name>``）複製到目標 Godot 專案目錄下

source: Open the project in the Godot Editor; the Editor should detect the plugin
ga: Oscail an tionscadal san Eagarthóir Godot; ba cheart don Eagarthóir an breiseán a bhrath
ru: Откройте проект в редакторе Godot; Редактор должен обнаружить плагин
ta: கோடோட் எடிட்டரில் திட்டத்தைத் திறக்கவும்; ஆசிரியர் சொருகி கண்டறிய வேண்டும்
uk: Відкрийте проект у редакторі Godot; редактор повинен виявити плагін
zh_hans: 在 Godot 编辑器中打开项目；编辑器应该会检测到该插件
zh_tw: 用 Godot 編輯器開啟專案，編輯器應會自動偵測到該外掛

source: Navigate to ``Project`` -> ``Project Settings...`` -> ``Plugins``, and ensure the plugin is enabled
ga: Déan nascleanúint go `` Tionscadal`` -> ``Socruithe an Tionscadail...`` -> ``Breiseáin``, agus cinntigh go bhfuil an breiseán cumasaithe
ru: Перейдите в ``Project`` -> ``Project Settings...`` -> ``Plugins`` и убедитесь, что плагин включен
ta: `` திட்டம்`` -> `` திட்ட அமைப்புகள் ... `` -> `` செருகுநிரல்கள்`` க்கு செல்லவும், சொருகி இயக்கப்பட்டிருப்பதை உறுதிப்படுத்தவும்
uk: Перейдіть до ``Проект`` -> ``Налаштування проекту...`` -> ``Плагіни`` та переконайтеся, що плагін увімкнено
zh_hans: 导航到 ``项目`` -> ``项目设置...`` -> ``插件`` ，并确保插件已启用
zh_tw: 進入 ``專案`` → ``專案設定...`` → ``外掛``，確認外掛已啟用

source: Install the Godot Android build template by clicking on ``Project`` -> ``Install Android Build Template...``
ga: Suiteáil teimpléad tógála Godot Android trí chliceáil ar `` Tionscadal`` -> ``Suiteáil Teimpléad Tógála Android…`
ru: Установите шаблон сборки Android Godot, нажав ``Project`` -> ``Install Android Build Template...``
ta: `` திட்டம்`` -> `` அண்ட்ராய்டு பில்ட் வார்ப்புருவை நிறுவுவதன் மூலம் கோடோட் ஆண்ட்ராய்டு உருவாக்க வார்ப்புருவை நிறுவவும் ... ``
uk: Установіть шаблон збірки Godot для Android, натиснувши ``Проект`` -> ``Установити шаблон збірки Android...``
zh_hans: 通过点击\ ``项目`` -> ``安装 Android 构建模板...``\ 来安装 Godot Android 构建模板
zh_tw: 點選 ``專案`` → ``安裝 Android 建置範本...`` 來安裝 Godot Android 建置範本

source: Navigate to ``Project`` -> ``Export...``
ga: Déan nascleanúint go `` Tionscadal`` -> ``Easpórtáil...``
it: Naviga su ``Project`` -> ``Export...``
ru: Перейдите в ``Project`` -> ``Export...``
ta: `` திட்டம்`` -> `` ஏற்றுமதி ... `` க்கு செல்லவும்
uk: Перейдіть до ``Проект`` -> ``Експорт...``
zh_hans: 导航到\ ``项目`` -> ``导出...``
zh_tw: 進入 ``專案`` → ``匯出...``

source: In the ``Export`` window, create an ``Android export preset``
ga: Sa fhuinneog ``Easpórtáil ``, cruthaigh réamhshocrú onnmhairiúcháin ``Android``
it: Nella finestra ``Export``, creare un ``Android export preset``
ru: В окне ``Export`` создайте ``Android export preset``
ta: `` ஏற்றுமதி`` சாளரத்தில், `` ஆண்ட்ராய்டு ஏற்றுமதி முன்னமைவு`` உருவாக்கவும்
uk: У вікні ``Експорт`` створіть ``попереднє налаштування експорту Android``
zh_hans: 在\ ``导出``\ 窗口中，创建一个 ``Android 导出预设``
zh_tw: 於 ``匯出`` 視窗中建立一個 ``Android 匯出預設值``

source: In the ``Android export preset``, scroll to ``Gradle Build`` and set ``Use Gradle Build`` to ``true``
ga: Sa réamhshocrú ``Android onnmhairiúcháin ``, scrollaigh go dtí ``Gradle Build`` agus socraigh ``Úsáid Gradle Build`` go ``True``
it: Nel ``Android export preset``, scorrere fino a ``Gradle Build`` e impostare ``Use Gradle Build`` su ``true``
ru: В ``Android export preset`` прокрутите до ``Gradle Build`` и установите для параметра ``Use Gradle Build`` значение ``true``
ta: `` ஆண்ட்ராய்டு ஏற்றுமதி முன்னமைவு`` இல், `` கிரேடில் பில்ட்`` க்கு உருட்டவும், `` கிரேடில் பில்டை` `` உண்மை`` ஐப் பயன்படுத்தவும்
uk: У ``стандарті експорту Android`` прокрутіть до ``Gradle Build`` і встановіть ``Use Gradle Build`` значення ``true``
zh_hans: 在 ``Android 导出预设``\ 中，滚动到 ``Gradle 构建``\ ，并将\ ``使用 Gradle 构建`` 设置为 ``true``
zh_tw: 在 ``Android 匯出預設值`` 中，找到 ``Gradle Build`` 設定，將 ``Use Gradle Build`` 設為 ``true``

source: Update the project's scripts as needed to access the plugin's functionality. For example::
ta: சொருகி செயல்பாட்டை அணுக தேவையான திட்டத்தின் ச்கிரிப்ட்களைப் புதுப்பிக்கவும். உதாரணமாக ::
uk: За потреби оновіть сценарії проекту, щоб отримати доступ до функцій плагіна. Наприклад::

source: Connect an Android device to your machine and run the project on it
ga: Ceangail gléas Android le do mheaisín agus reáchtáil an tionscadal air
it: Connettere un dispositivo Android al computer ed eseguire il progetto su di esso
ru: Подключите Android-устройство к своему компьютеру и запустите на нем проект
ta: உங்கள் கணினியில் ஆண்ட்ராய்டு சாதனத்தை இணைத்து, திட்டத்தை இயக்கவும்
uk: Підключіть пристрій Android до своєї машини та запустіть на ньому проект
zh_hans: 将 Android 设备连接到你的机器并在其上运行该项目
zh_tw: 將 Android 裝置連接到電腦並在裝置上執行專案

source: Using a v2 Android plugin as an Android library
ga: Breiseán v2 Android a úsáid mar leabharlann Android
it: Utilizzo di un'estensione Android v2 come libreria Android
ru: Использование v2 Android плагина как Android библиотеку
ta: ஆண்ட்ராய்டு நூலகமாக வி 2 ஆண்ட்ராய்டு சொருகி பயன்படுத்துதல்
uk: Використання плагіна Android v2 як бібліотеки Android
zh_hans: 使用 v2 Android 插件作为 Android 库
zh_tw: 以 Android 函式庫形式使用 v2 Android 外掛

source: Since they are also Android libraries, Godot v2 Android plugins can be stripped from their ``EditorExportPlugin`` packaging and provided as raw ``AAR`` binaries for use as libraries alongside the :ref:`Godot Android library <doc_android_library>` by Android apps.
ga: Ós rud é gur leabharlanna Android iad freisin, is féidir forlíontáin Godot v2 Android a bhaint as a bpacáistíocht ``EditorExportPlugin`` agus iad a sholáthar mar dhénártaí amh ``AAR`` lena n-úsáid mar leabharlanna taobh leis an :ref:`leabharlann Godot Android <doc_android_library>` le apps Android.
ru: Поскольку они также являются библиотеками Android, плагины Godot v2 для Android можно извлечь из упаковки ``EditorExportPlugin`` и предоставить в виде необработанных двоичных файлов ``AAR`` для использования в качестве библиотек вместе с :ref:`Godot Android library <doc_android_library>` в приложениях Android.
ta: அவை ஆண்ட்ராய்டு நூலகங்களாக இருப்பதால், கோடோட் வி 2 ஆண்ட்ராய்டு செருகுநிரல்களை அவற்றின் `` எடிட்டர் எக்ச்போர்ட் பிளூகின்` பேக்கேசிங்கிலிருந்து அகற்றி, ரா `` அர்`` பைனரிகளாக நூலகங்களாகப் பயன்படுத்தலாம்: ref: `கோடோட் அண்ட்ராய்டு நூலகம் <doc_android_library>` ஆண்ட்ராய்டு பயன்பாடுகள்.
uk: Оскільки плагіни Godot v2 для Android також є бібліотеками Android, їх можна вилучити з упаковки ``EditorExportPlugin`` і надати як необроблені двійкові файли ``AAR`` для використання як бібліотеки поряд із :ref:`Godot Android library <doc_android_library>` програми для Android.
zh_hans: 由于它们也是 Android 库，Godot v2 Android 插件可以从其 ``EditorExportPlugin`` 包装中剥离出来，并作为原始 ``AAR`` 二进制文件提供，以便与 :ref:`Godot Android 库 <doc_android_library>`\ 一起作为库被 Android 应用程序使用。
zh_tw: 由於 v2 Android 外掛本質上也是 Android 函式庫，因此可以不經 ``EditorExportPlugin`` 封裝，直接將 ``AAR`` 檔案作為原生函式庫，讓 Android 應用程式與 :ref:`Godot Android 函式庫 <doc_android_library>` 一同使用。

source: If targeting this use-case, make sure to include additional instructions for how the ``AAR`` binaries should be included (e.g: custom additions to the Android app's manifest).
ga: Má dhíríonn tú ar an gcás úsáide seo, déan cinnte treoracha breise a áireamh maidir leis an gcaoi ar chóir na dénártha `AAR`` a chur san áireamh (m.sh.: breiseanna saincheaptha le léargas an aip Android).
ru: Если вы ориентируетесь на этот вариант использования, обязательно включите дополнительные инструкции о том, как следует включать двоичные файлы ``AAR`` (например, пользовательские дополнения к манифесту приложения Android).
ta: இந்த பயன்பாட்டு-வழக்கை குறிவைத்தால், `` aar`` பைனரிகள் எவ்வாறு சேர்க்கப்பட வேண்டும் என்பதற்கான கூடுதல் வழிமுறைகளைச் சேர்ப்பதை உறுதிசெய்க (எ.கா: ஆண்ட்ராய்டு பயன்பாட்டின் மேனிஃபெச்ட்டுக்கு தனிப்பயன் சேர்த்தல்).
uk: Якщо ви націлюєтеся на цей випадок використання, обов’язково включите додаткові вказівки щодо включення двійкових файлів ``AAR`` (наприклад, спеціальні доповнення до маніфесту програми Android).
zh_hans: 如果针对这种用例，请确保包含有关如何包含 ``AAR`` 二进制文件的附加说明（例如：Android 应用程序清单的自定义添加）。
zh_tw: 若採用此用法，請務必在文件中詳細說明如何將 ``AAR`` 檔案納入（例如：如何在 Android app 的 manifest 中加入自訂內容）。

source: Reference implementations
ga: Cur i bhfeidhm tagartha
it: Implementazioni di riferimento
ru: Референтные реализации
ta: குறிப்பு செயலாக்கங்கள்
uk: Еталонні реалізації
zh_hans: 参考实现
zh_tw: 參考實作

source: `Godot Android Plugins Samples <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/plugins>`_
ga: `Samplaí Breiseáin Android Godot <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/plugins>`_
it: `Esempi di plugin Android per Godot <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/plugins>`_
ru: `Примеры плагинов Godot для Android <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/plugins>`_
ta: `கோடோட் ஆண்ட்ராய்டு செருகுநிரல்கள் மாதிரிகள் <https://github.com/m4gr3d/godot-android-samples/tree/master/plugins>` _
uk: `Приклади плагінів Godot Android <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/plugins>`_
zh_hans: `Godot Android 插件范例 <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/plugins>`_
zh_tw: `Godot Android 外掛範例 <https://github.com/m4gr3d/Godot-Android-Samples/tree/master/plugins>`_

source: `Godot Android Plugin Template <https://github.com/m4gr3d/Godot-Android-Plugin-Template>`_
ga: `Teimpléad Breiseán Android Godot <https://github.com/m4gr3d/Godot-Android-Plugin-Template>`_
it: `Modello di plugin Android per Godot <https://github.com/m4gr3d/Godot-Android-Plugin-Template>`_
ru: `Шаблон плагина Godot для Android <https://github.com/m4gr3d/Godot-Android-Plugin-Template>`_
ta: `கோடோட் ஆண்ட்ராய்டு சொருகி வார்ப்புரு <https://github.com/m4gr3d/godot-android-plugin-template>` _
uk: `Шаблон плагіна Godot для Android <https://github.com/m4gr3d/Godot-Android-Plugin-Template>`_
zh_hans: `Godot Android 插件模板 <https://github.com/m4gr3d/Godot-Android-Plugin-Template>`_
zh_tw: `Godot Android 外掛範本 <https://github.com/m4gr3d/Godot-Android-Plugin-Template>`_

source: `GDExtension Android Plugin Template <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template>`_
ga: `Teimpléad Breiseán Android GDExtension <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template>`_
ru: `Шаблон плагина Android GDExtension <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template>`_
ta: `Gdextension ஆண்ட்ராய்டு செருகுநிரல் வார்ப்புரு <https://github.com/m4gr3d/gdextension-android-plugin-template>` _
uk: `Шаблон плагіна Android GDExtension <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template>`_
zh_hans: `GDExtension Android 插件模板 <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template>`_
zh_tw: `GDExtension Android 外掛範本 <https://github.com/m4gr3d/GDExtension-Android-Plugin-Template>`_

source: `Godot OpenXR Loaders <https://github.com/GodotVR/godot_openxr_loaders>`_
ga: `Lódálaithe Godot OpenXR <https://github.com/GodotVR/godot_openxr_loaders> `_
it: `Caricatori OpenXR di Godot <https://github.com/GodotVR/godot_openxr_loaders>`_
ru: `Загрузчики Godot OpenXR <https://github.com/GodotVR/godot_openxr_loaders>`_
ta: `கோடோட் ஓபன்எக்ச்ஆர் லோடர்கள் <https://github.com/godotvr/godot_openxr_loaders>` _
uk: `Godot OpenXR Вантажники <https://github.com/GodotVR/godot_openxr_loaders>`_
zh_hans: `Godot OpenXR 加载程序 <https://github.com/GodotVR/godot_openxr_loaders>`_
zh_tw: `Godot OpenXR 載入器 <https://github.com/GodotVR/godot_openxr_loaders>`_

source: Tips and Guidelines
ga: Leideanna agus Treorlínte
it: Consigli e linee guida
ru: Советы и рекомендации
ta: உதவிக்குறிப்புகள் மற்றும் வழிகாட்டுதல்கள்
uk: Поради та вказівки
zh_hans: 技巧与指南
zh_tw: 提示與建議

source: Simplify access to the exposed Java / Kotlin APIs
ga: Rochtain ar na APIs Java/Kotlin nochtaithe a shimpliú
ru: Упростите доступ к открытым API Java/Kotlin
ta: வெளிப்படும் சாவா / கோட்லின் பநிஇ களுக்கான அணுகலை எளிதாக்குங்கள்
uk: Спростіть доступ до доступних Java/Kotlin API
zh_hans: 简化对暴露的 Java / Kotlin API 的访问
zh_tw: 簡化存取外掛 Java / Kotlin API 的方式

source: To make it easier to access the exposed Java / Kotlin APIs in the Godot Editor, it's recommended to provide one (or multiple) gdscript wrapper class(es) for your plugin users to interface with.
ga: Chun é a dhéanamh níos éasca rochtain a fháil ar na APIs Java/Kotlin nochtaithe san Eagarthóir Godot, moltar aicme fillte gdscript amháin (nó iolracha) a sholáthar d'úsáideoirí breiseán le comhéadan leo.
ru: Чтобы упростить доступ к открытым API Java/Kotlin в редакторе Godot, рекомендуется предоставить один (или несколько) классов-оболочек gdscript, с которыми смогут взаимодействовать пользователи вашего плагина.
ta: கோடோட் எடிட்டரில் வெளிப்படும் சாவா / கோட்லின் ஏபிஐகளை அணுகுவதை எளிதாக்குவதற்கு, உங்கள் சொருகி பயனர்களுக்கு இடைமுகப்படுத்த ஒன்று (அல்லது பல) சி.டி.எச்ச்கிரிப்ட் ரேப்பர் வகுப்பை (எச்) வழங்க பரிந்துரைக்கப்படுகிறது.
uk: Щоб спростити доступ до відкритих API Java/Kotlin у редакторі Godot, рекомендується надати один (або кілька) класів-оболонок gdscript для взаємодії користувачів плагінів.
zh_hans: 为了更轻松地访问 Godot 编辑器中公开的 Java / Kotlin API，建议为插件用户提供一个（或多个） gdscript 包装器类以供交互。
zh_tw: 為方便在 Godot 編輯器中存取外掛暴露的 Java / Kotlin API，建議你提供一組或多組 GDScript 包裝類別，讓外掛使用者直接操作。

source: For example::
ta: உதாரணமாக ::
uk: Наприклад::

source: Support using the GDExtension functionality in the Godot Editor
ga: Tacaíocht ag baint úsáide as feidhmiúlacht GDExtension san Eagarthóir Godot
ru: Поддержка использования функциональности GDExtension в Godot Editor
ta: கோடோட் எடிட்டரில் gdextension செயல்பாட்டைப் பயன்படுத்தி உதவி
uk: Підтримка використання функції GDExtension у редакторі Godot
zh_hans: 支持在 Godot 编辑器中使用 GDExtension 功能
zh_tw: 支援在 Godot 編輯器內使用 GDExtension 功能

source: If planning to use the GDExtension functionality in the Godot Editor, it is recommended that the GDExtension's native binaries are compiled not just for Android, but also for the OS onto which developers / users intend to run the Godot Editor. Not doing so may prevent developers / users from writing code that accesses the plugin from within the Godot Editor.
ga: Má tá sé beartaithe feidhmiúlacht GDExtension a úsáid in Eagarthóir Godot, moltar go ndéanfaí binaries dúchais an GDExtension a thiomsú, ní hamháin le haghaidh Android, ach freisin don OS a bhfuil sé ar intinn ag forbróirí / úsáideoirí Eagarthóir Godot a rith air. Mura ndéantar amhlaidh d’fhéadfadh sé cosc a chur ar fhorbróirí/úsáideoirí cód a scríobh a fhaigheann rochtain ar an mbreiseán laistigh d’Eagarthóir Godot.
ru: Если вы планируете использовать функциональность GDExtension в редактор Godot, рекомендуется скомпилировать его собственные двоичные файлы не только для Android, но и для ОС, на которой разработчики/пользователи планируют запустить редактор Godot. В противном случае разработчики/пользователи не смогут писать код, обращающийся к плагину из редактора Godot.
ta: கோடோட் எடிட்டரில் gdextension செயல்பாட்டைப் பயன்படுத்தத் திட்டமிட்டால், gdextension இன் சொந்த பைனரிகள் ஆண்ட்ராய்டு க்கு மட்டுமல்ல, OS க்காகவும் உருவாக்குபவர்கள் / பயனர்கள் கோடோட் எடிட்டரை இயக்க விரும்புகிறார்கள் என்று பரிந்துரைக்கப்படுகிறது. அவ்வாறு செய்யாதது உருவாக்குபவர்கள் / பயனர்கள் கோடோட் எடிட்டருக்குள் இருந்து சொருகி அணுகும் குறியீட்டை எழுதுவதைத் தடுக்கலாம்.
uk: Якщо ви плануєте використовувати функціональні можливості GDExtension у редакторі Godot, рекомендовано, щоб рідні двійкові файли GDExtension були скомпільовані не лише для Android, а й для ОС, у якій розробники/користувачі мають намір запускати редактор Godot. Інакше це може перешкодити розробникам/користувачам писати код, який отримує доступ до плагіна з редактора Godot.
zh_hans: 如果计划在 Godot 编辑器中使用 GDExtension 功能，建议对 GDExtension 的原生二进制文件的编译，不仅要针对 Android ，还要针对开发人员/用户打算在其上运行 Godot 编辑器的操作系统。如果不这样做，可能会阻止开发人员/用户编写从 Godot 编辑器内部访问插件的代码。
zh_tw: 如果你打算在 Godot 編輯器中也能使用 GDExtension 功能，建議同時替 Android 及開發者／使用者用來執行 Godot 編輯器的作業系統編譯 GDExtension 原生二進位檔。否則，開發者／使用者將無法在編輯器內撰寫與測試存取外掛的程式碼。

source: This may involve creating dummy plugins for the host OS just so the API is published to the editor. You can use the `godot-cpp-template <https://github.com/godotengine/godot-cpp-template>`__ github template for reference on how to do so.
ga: D’fhéadfadh sé go mbeadh i gceist leis seo forlíontáin chaocha a chruthú don óstach OS ionas go bhfoilsítear an API don eagarthóir. Is féidir leat an teimpléad `godot-cpp-template <https://github.com/godotengine/godot-cpp-template>`__ teimpléad github a úsáid le haghaidh tagartha ar conas é sin a dhéanamh.
ru: Это может потребовать создания фиктивных плагинов для хостовой ОС, чтобы API было доступно в редакторе. Вы можете использовать шаблон `godot-cpp-template <https://github.com/godotengine/godot-cpp-template>`__ на GitHub, чтобы узнать, как это сделать.
ta: இது புரவலன் ஓஎச் -க்கு போலி செருகுநிரல்களை உருவாக்குவதை உள்ளடக்கியிருக்கலாம், எனவே பநிஇ எடிட்டருக்கு வெளியிடப்படுகிறது. நீங்கள் `கோடோட்-சிபிபி-டெம்ப்ளேட் <https://github.com/godotengine/godot-cpp-template>` __ அறிவிலிமையம் வார்ப்புருவைப் பயன்படுத்தலாம்.
uk: Це може передбачати створення фіктивних плагінів для головної ОС, щоб API було опубліковано в редакторі. Ви можете використати `godot-cpp-template <https://github.com/godotengine/godot-cpp-template>`__ шаблон github, щоб дізнатися, як це зробити.
zh_hans: 这可能涉及为主机操作系统创建虚拟插件，以便将 API 发布给编辑器。你可以使用 `godot-cpp-template <https://github.com/godotengine/godot-cpp-template>`__ github 模板来参考如何操作。
zh_tw: 這有時可能需要為主機作業系統建立虛擬外掛（dummy plugin），以便將 API 發佈到編輯器。你可以參考 `godot-cpp-template <https://github.com/godotengine/godot-cpp-template>`__ github 範本。

source: Godot crashes upon load
ga: Timpeálann Godot ar ualach
ru: Godot аварийно завершает работу при загрузке
ta: கோடோட் சுமையில் செயலிழக்கிறார்
uk: Godot падає під час завантаження
zh_hans: Godot 在加载时崩溃
zh_tw: Godot 載入時當機

source: Check ``adb logcat`` for possible problems, then:
ga: Seiceáil ``adb logcat`` le haghaidh fadhbanna féideartha, ansin:
ru: Проверьте ``adb logcat`` на возможные проблемы, затем:
ta: சாத்தியமான சிக்கல்களுக்கு `` adb logcat`` சரிபார்க்கவும்:
uk: Перевірте ``adb logcat`` на наявність можливих проблем, а потім:
zh_hans: 检查 ``adb logcat`` 是否存在可能的问题，然后：
zh_tw: 請檢查 ``adb logcat`` 以尋找潛在問題，然後：

source: Check that the methods exposed by the plugin used the following Java types: ``void``, ``boolean``, ``int``, ``float``, ``java.lang.String``, ``org.godotengine.godot.Dictionary``, ``int[]``, ``byte[]``, ``float[]``, ``java.lang.String[]``.
ga: Seiceáil gur úsáid na modhanna a nochtaigh an breiseán na cineálacha Java seo a leanas: `void``, `boolean``, `int``, `float``, `java.lang.string``, ``org.godotengine.godot.Dictionary``, ``int [] ``, `byte []``, `float [] ``, ``Java.lang.String []``.
ru: Проверьте, что методы, предоставляемые плагином, используют следующие типы Java: ``void``, ``boolean``, ``int``, ``float``, ``java.lang.String``, ``org.godotengine.godot.Dictionary``, ``int[]``, ``byte[]``, ``float[]``, ``java.lang.String[]``.
ta: சொருகி அம்பலப்படுத்தப்பட்ட முறைகள் பின்வரும் சாவா வகைகளைப் பயன்படுத்துகின்றனவா என்பதைச் சரிபார்க்கவும்: `` வெற்றிடத்தை`, `` பூலியன்``, `` இன்ட்``, `` மிதவை``, `` java.lang.string`, `` ` org.godotengine.godot.dictionary```, `` int [] ``, `` பைட் [] ``, `` ``] ``, `` java.lang.string [] ``.
uk: Перевірте, чи методи, надані плагіном, використовували такі типи Java: ``void``, ``boolean``, ``int``, ``float``, ``java.lang.String``, `` org.godotengine.godot.Dictionary``, ``int[]``, ``byte[]``, ``float[]``, ``java.lang.String[]``.
zh_hans: 检查插件暴露的方法是否使用了下列 Java 类型：\ ``void``\ 、\ ``boolean``\ 、\ ``int``\ 、\ ``float``\ 、\ ``java.lang.String``\ 、\ ``org.godotengine.godot.Dictionary``\ 、\ ``int[]``\ 、\ ``byte[]``\ 、\ ``float[]``\ 、\ ``java.lang.String[]``\ 。
zh_tw: 請確認外掛暴露的方法僅使用以下 Java 型別：``void``、``boolean``、``int``、``float``、``java.lang.String``、``org.godotengine.godot.Dictionary``、``int[]``、``byte[]``、``float[]``、``java.lang.String[]``。

source: More complex datatypes are not supported for now.
ga: Ní thacaítear le cineálacha sonraí níos casta anois.
ru: Более сложные типы данных пока не поддерживаются.
ta: மிகவும் சிக்கலான தரவுத்தொகுப்புகள் இப்போது ஆதரிக்கப்படவில்லை.
uk: Більш складні типи даних наразі не підтримуються.
zh_hans: 暂时不支持更复杂的数据类型.
zh_tw: 目前暫不支援更複雜的資料型別。

source: Add the Godot Android library as a dependency by updating the module's ``gradle`` `build file <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/build.gradle.kts#L42>`_:
ru: Добавьте библиотеку Godot для Android в качестве зависимости, обновив ``gradle`` `файл сборки модуля <https://github.com/m4gr3d/Godot-Android-Plugin-Template/blob/main/plugin/build.gradle.kts#L42>`_:
