Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/change_scenes_manually.po
Languages: ga, ta, uk, zh_tw

source: Change scenes manually
ga: Athraigh radhairc de láimh
ta: காட்சிகளை கைமுறையாக மாற்றவும்
uk: Змінюйте сцени вручну
zh_tw: 手動切換場景

source: Sometimes it helps to have more control over how you swap scenes around. A :ref:`Viewport <class_Viewport>`'s child nodes will render to the image it generates. This holds true even for nodes outside of the "current" scene. Autoloads fall into this category, and also scenes which you instantiate and add to the tree at runtime:
ta: சில நேரங்களில் நீங்கள் காட்சிகளை எவ்வாறு மாற்றிக் கொள்கிறீர்கள் என்பதில் அதிக கட்டுப்பாட்டைக் கொண்டிருக்க இது உதவுகிறது. ப: குறிப்பு: `ViewPort <class_viewport>` இன் குழந்தை முனைகள் அது உருவாக்கும் படத்தை வழங்கும். "தற்போதைய" காட்சிக்கு வெளியே உள்ள முனைகளுக்கு கூட இது உண்மைதான். ஆட்டோலோடுகள் இந்த வகைக்குள் வருகின்றன, மேலும் இயக்க நேரத்தில் நீங்கள் உடனடியாக மரத்தில் சேர்க்கும் காட்சிகளும்:
uk: Іноді допомагає краще контролювати, як ви змінюєте сцени. Дочірні вузли :ref:`Viewport <class_Viewport>` будуть відтворювати зображення, яке воно генерує. Це справедливо навіть для вузлів за межами «поточної» сцени. До цієї категорії належать автозавантаження, а також сцени, які ви створюєте та додаєте до дерева під час виконання:
zh_tw: 有時候你會需要更細緻地控制場景的切換方式。:ref:`Viewport <class_Viewport>` 的子節點會算繪到它所產生的影像中，即使這些節點並不屬於「目前」場景也一樣。自動載入（Autoload）的節點屬於這一類，同時在執行時動態實例化並加入樹狀結構的場景也是：

source: To complete the cycle and swap out the new scene with the old one, you have a choice to make. Many strategies exist for removing a scene from view of the :ref:`Viewport <class_Viewport>`. The tradeoffs involve balancing operation speed and memory consumption, as well as balancing data access and integrity.
ta: சுழற்சியை முடிக்க மற்றும் பழைய ஒன்றைக் கொண்டு புதிய காட்சியை மாற்ற, நீங்கள் செய்ய ஒரு தேர்வு உள்ளது. பார்வையில் இருந்து ஒரு காட்சியை அகற்ற பல உத்திகள் உள்ளன: ref: `viewport <class_viewport>`. பரிமாற்றங்கள் செயல்பாட்டு விரைவு மற்றும் நினைவக நுகர்வு சமநிலைப்படுத்துதல், அத்துடன் தரவு அணுகல் மற்றும் ஒருமைப்பாட்டை சமநிலைப்படுத்துதல் ஆகியவை அடங்கும்.
uk: Щоб завершити цикл і замінити нову сцену на стару, вам потрібно зробити вибір. Існує багато стратегій для видалення сцени з поля зору :ref:`Viewport <class_Viewport>`. Компроміси передбачають збалансування швидкості роботи та споживання пам’яті, а також збалансування доступу та цілісності даних.
zh_tw: 要完成流程，將新場景與舊場景交換時，你有多種選擇。從 :ref:`Viewport <class_Viewport>` 視圖中移除場景的方法有很多，這些方法在操作速度、記憶體消耗，以及資料存取與完整性等方面都各有取捨。

source: **Delete the existing scene.** :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` and :ref:`SceneTree.change_scene_to_packed() <class_SceneTree_method_change_scene_to_packed>` will delete the current scene immediately. You can also delete the main scene. Assuming the root node's name is "Main", you could do ``get_node("/root/Main").free()`` to delete the whole scene.
ta: ** தற்போதுள்ள காட்சியை நீக்கு. நீங்கள் முக்கிய காட்சியையும் நீக்கலாம். ரூட் முனையின் பெயர் "முதன்மையான" என்று கருதி, நீங்கள் `` get_node ("/root/main") செய்ய முடியும். முழு காட்சியையும் நீக்க இலவச () ``.
uk: **Видалити наявну сцену.** :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` і :ref:`SceneTree.change_scene_to_packed() <class_SceneTree_method_change_scene_to_packed>` негайно видалять поточну сцену. Ви також можете видалити головну сцену. Якщо припустити, що кореневий вузол має назву «Main», ви можете виконати ``get_node("/root/Main").free()``, щоб видалити всю сцену.
zh_tw: **刪除現有場景。** :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` 與 :ref:`SceneTree.change_scene_to_packed() <class_SceneTree_method_change_scene_to_packed>` 會立即刪除目前場景。你也可以手動刪除主場景，假設根節點名稱為「Main」，可以執行 ``get_node("/root/Main").free()`` 來刪除整個場景。

source: Unloads memory.
ga: Díluchtú cuimhne.
ta: நினைவகத்தை இறக்குகிறது.
uk: Розвантажує пам'ять.
zh_tw: 釋放記憶體。

source: Pro: RAM is no longer dragging the dead weight.
ga: Pro: Níl RAM ag tarraingt an meáchan marbh a thuilleadh.
ta: புரோ: ராம் இனி இறந்த எடையை இழுக்கவில்லை.
uk: Плюси: оперативна пам’ять більше не тягне мертвим вантажем.
zh_tw: 優點：記憶體不再被佔用。

source: Con: Returning to that scene is now more expensive since it must be loaded back into memory again (takes time AND memory). Not a problem if returning soon is unnecessary.
ga: Con: Tá sé níos costasaí anois filleadh ar an radharc sin ós rud é go gcaithfear é a luchtú ar ais i gcuimhne arís (tógann sé am AGUS cuimhne). Ní fadhb í mura bhfuil sé gan ghá filleadh go luath.
ta: கான்: அந்த காட்சிக்குத் திரும்புவது இப்போது மிகவும் விலை உயர்ந்தது, ஏனெனில் அது மீண்டும் நினைவகத்தில் ஏற்றப்பட வேண்டும் (நேரத்தையும் நினைவகத்தையும் எடுக்கும்). விரைவில் திரும்புவது தேவையற்றது என்றால் சிக்கல் அல்ல.
uk: Мінус: повернення до цієї сцени тепер дорожче, оскільки її потрібно знову завантажити в пам’ять (потрібен час І пам’ять). Не проблема, якщо незабаром повертатися не потрібно.
zh_tw: 缺點：若要再次回到該場景，必須重新載入到記憶體，這會消耗更多時間與記憶體。如果不需要很快切回原場景，這通常不是問題。

source: Con: No longer have access to that scene's data. Not a problem if using that data soon is unnecessary.
ga: Con: Níl rochtain agat ar shonraí an radhairc sin a thuilleadh. Ní fadhb í mura bhfuil gá na sonraí sin a úsáid go luath.
ta: கான்: அந்த காட்சியின் தரவை இனி அணுக முடியாது. அந்தத் தரவைப் பயன்படுத்துவது தேவையற்றது என்றால் சிக்கல் இல்லை.
uk: Мінус: більше немає доступу до даних цієї сцени. Не проблема, якщо використання цих даних незабаром стане непотрібним.
zh_tw: 缺點：無法再存取該場景的資料。如果短期內不需要用到這些資料，問題不大。

source: Note: It can be useful to preserve the data in a soon-to-be-deleted scene by re-attaching one or more of its nodes to a different scene, or even directly to the :ref:`SceneTree <class_SceneTree>`.
ga: Nóta: Is féidir go mbeadh sé úsáideach na sonraí a chaomhnú i radharc atá le scriosadh go luath trí cheann amháin nó níos mó dá nóid a athcheangal le radharc eile, nó fiú go díreach leis an :ref:`SceneTree <class_SceneTree>`.
ta: குறிப்பு: அதன் முனைகளில் ஒன்று அல்லது அதற்கு மேற்பட்டவற்றை வேறு காட்சிக்கு மீண்டும் இணைப்பதன் மூலம் விரைவில் நீக்கப்பட வேண்டிய காட்சியில் தரவைப் பாதுகாப்பது பயனுள்ளதாக இருக்கும், அல்லது நேரடியாக: குறிப்பு: `காட்சி <class_scenetree>`.
uk: Примітка. Може бути корисно зберегти дані в сцені, яку незабаром буде видалено, повторно приєднавши один або більше її вузлів до іншої сцени або навіть безпосередньо до :ref:`SceneTree <class_SceneTree>`.
zh_tw: 注意：如果需要保留即將被刪除場景中的資料，可以將其中一個或多個節點重新掛載到其他場景，甚至直接掛載到 :ref:`SceneTree <class_SceneTree>` 上。

source: Processing stops.
ga: Stopann próiseála.
ta: செயலாக்க நிறுத்தங்கள்.
uk: Обробка зупинок.
zh_tw: 處理停止。

source: Pro: No nodes means no processing, physics processing, or input handling. The CPU is available to work on the new scene's contents.
ta: புரோ: எந்த முனைகளும் செயலாக்கம், இயற்பியல் செயலாக்கம் அல்லது உள்ளீட்டு கையாளுதல் இல்லை. புதிய காட்சியின் உள்ளடக்கங்களில் பணியாற்ற சிபியு கிடைக்கிறது.
uk: За: відсутність вузлів означає відсутність обробки, фізичної обробки чи обробки вхідних даних. ЦП доступний для роботи з вмістом нової сцени.
zh_tw: 優點：沒有節點就沒有運算、物理運算或輸入處理，CPU 可專注處理新場景內容。

source: Con: Those nodes' processing and input handling no longer operate. Not a problem if using the updated data is unnecessary.
ga: Con: Ní oibríonn próiseáil agus láimhseáil ionchuir na nóid sin a thuilleadh. Ní fadhb í mura bhfuil gá na sonraí nuashonraithe a úsáid.
ta: கான்: அந்த முனைகளின் செயலாக்கம் மற்றும் உள்ளீட்டு கையாளுதல் இனி செயல்படாது. புதுப்பிக்கப்பட்ட தரவைப் பயன்படுத்துவது தேவையற்றது என்றால் சிக்கல் இல்லை.
uk: Мінус: обробка та обробка вхідних даних цих вузлів більше не працюють. Не проблема, якщо використання оновлених даних не потрібне.
zh_tw: 缺點：這些節點的運算與輸入處理都不再進行。如果不需要即時的資料更新，問題不大。

source: **Hide the existing scene.** By changing the visibility or collision detection of the nodes, you can hide the entire node sub-tree from the player's perspective.
ta: ** தற்போதுள்ள காட்சியை மறைக்கவும். ** முனைகளின் தெரிவுநிலை அல்லது மோதல் கண்டறிதலை மாற்றுவதன் மூலம், முழு முனை துணை மரத்தையும் வீரரின் கண்ணோட்டத்தில் மறைக்க முடியும்.
uk: **Приховати наявну сцену.** Змінивши видимість або виявлення зіткнень вузлів, ви можете приховати все піддерево вузлів від точки зору гравця.
zh_tw: **隱藏現有場景。** 你可以透過更改節點的可見性或碰撞屬性，將整個節點子樹從玩家視角隱藏。

source: Memory still exists.
ga: Tá cuimhne ann fós.
ta: நினைவகம் இன்னும் உள்ளது.
uk: Пам'ять все ще існує.
zh_tw: 記憶體仍被佔用。

source: Pro: You can still access the data if needed.
ta: புரோ: தேவைப்பட்டால் தரவை நீங்கள் இன்னும் அணுகலாம்.
uk: Pro: Ви все ще можете отримати доступ до даних, якщо це необхідно.
zh_tw: 優點：如有需要，仍可存取資料。

source: Pro: There's no need to move any more nodes around to save data.
ga: Pro: Ní gá aon nóid níos mó a bhogadh timpeall chun sonraí a shábháil.
ta: புரோ: தரவைச் சேமிக்க மேலும் முனைகளை நகர்த்த வேண்டிய அவசியமில்லை.
uk: Профі: немає необхідності переміщувати вузли, щоб зберегти дані.
zh_tw: 優點：不必再移動任何節點即可保留資料。

source: Con: More data is being kept in memory, which will be become a problem on memory-sensitive platforms like web or mobile.
ta: கான்: மேலும் தரவு நினைவகத்தில் வைக்கப்படுகிறது, இது வலை அல்லது மொபைல் போன்ற நினைவக உணர்திறன் தளங்களில் சிக்கலாக மாறும்.
uk: Мінус: у пам’яті зберігається більше даних, що стане проблемою для чутливих до пам’яті платформ, таких як Інтернет або мобільні пристрої.
zh_tw: 缺點：更多資料會繼續佔用記憶體，對於像網頁或手機這種對記憶體敏感的平台可能會造成問題。

source: Processing continues.
ga: Leanann an próiseáil.
ta: செயலாக்கம் தொடர்கிறது.
uk: Обробка продовжень.
zh_tw: 仍然持續處理。

source: Pro: Data continues to receive processing updates, so the scene will keep any data within it that relies on delta time or frame data updated.
ta: புரோ: தரவு தொடர்ந்து செயலாக்க புதுப்பிப்புகளைப் பெறுகிறது, எனவே டெல்டா நேரம் அல்லது ஃபிரேம் தரவை புதுப்பித்த எந்த தரவையும் அதற்குள் இருக்கும்.
uk: Pro: Дані продовжують отримувати оновлення обробки, тому сцена зберігатиме будь-які дані в ній, які залежать від дельта-часу або даних кадру, оновленими.
zh_tw: 優點：資料會持續接收處理更新，因此場景內依賴 delta time 或影格資料的內容會持續更新。

source: Pro: Nodes are still members of groups (since groups belong to the :ref:`SceneTree <class_SceneTree>`).
ga: Pro: Tá nóid fós ina mbaill de ghrúpaí (toisc go mbaineann grúpaí leis an :ref:`SceneTree <class_SceneTree>`).
ta: புரோ: முனைகள் இன்னும் குழுக்களின் உறுப்பினர்களாக இருக்கின்றன (குழுக்கள்: ref: `SCESETREE <class_scenetree>`).
uk: За: вузли все ще є членами груп (оскільки групи належать до :ref:`SceneTree <class_SceneTree>`).
zh_tw: 優點：節點仍然會是群組的成員（因為群組屬於 :ref:`SceneTree <class_SceneTree>`）。

source: Con: The CPU's attention is now divided between both scenes. Too much load could result in low frame rates. You should be sure to test performance as you go to ensure the target platform can support the load from this approach.
ta: கான்: சிபியு இன் கவனம் இப்போது இரு காட்சிகளுக்கும் இடையில் பிரிக்கப்பட்டுள்ளது. அதிகப்படியான சுமை குறைந்த பிரேம் விகிதங்களை ஏற்படுத்தக்கூடும். இந்த அணுகுமுறையிலிருந்து ஏற்றத்தை ஆதரிக்க முடியும் என்பதை உறுதிப்படுத்த நீங்கள் செல்லும்போது செயல்திறனை சோதிக்க வேண்டும்.
uk: Мінус: увага центрального процесора тепер розподілена між обома сценами. Занадто велике навантаження може призвести до низької частоти кадрів. Ви повинні обов’язково перевіряти продуктивність під час роботи, щоб переконатися, що цільова платформа може витримати навантаження від цього підходу.
zh_tw: 缺點：CPU 的運算量會分散到多個場景，如果負載過大可能導致畫面更新率降低。建議隨時測試效能，確保目標平台能承受這種負載。

source: **Remove the existing scene from the tree.** Assign a variable to the existing scene's root node. Then use :ref:`Node.remove_child(Node) <class_Node_method_remove_child>` to detach the entire scene from the tree.
ta: ** மரத்திலிருந்து இருக்கும் காட்சியை அகற்றவும். ** தற்போதுள்ள காட்சியின் ரூட் முனைக்கு ஒரு மாறியை ஒதுக்கவும். பின்னர் பயன்படுத்தவும்: ref: `node.remove_child (முனை) <class_node_method_remove_child>` மரத்திலிருந்து முழு காட்சியையும் பிரிக்க.
uk: **Видаліть існуючу сцену з дерева.** Призначте змінну кореневому вузлу існуючої сцени. Потім використовуйте :ref:`Node.remove_child(Node) <class_Node_method_remove_child>`, щоб від’єднати всю сцену від дерева.
zh_tw: **從樹狀結構中移除現有場景。** 先將現有場景的根節點指定給一個變數，然後使用 :ref:`Node.remove_child(Node) <class_Node_method_remove_child>` 將整個場景從樹中分離。

source: Memory still exists (similar pros/cons as hiding it from view).
ta: நினைவகம் இன்னும் உள்ளது (பார்வையில் இருந்து அதை மறைப்பது போன்ற ஒத்த நன்மை தீமைகள்).
uk: Пам’ять все ще існує (плюси/мінуси схожі на приховування її від очей).
zh_tw: 記憶體仍被佔用（優缺點與隱藏場景方式相似）。

source: Processing stops (similar pros/cons as deleting it completely).
ta: செயலாக்க நிறுத்தங்கள் (அதை முழுவதுமாக நீக்குவது போன்ற ஒத்த நன்மை தீமைகள்).
uk: Обробка припиняється (плюси/мінуси аналогічні повному видаленню).
zh_tw: 停止處理（優缺點與完全刪除場景相似）。

source: Pro: This variation of "hiding" it is much easier to show/hide. Rather than potentially keeping track of multiple changes to the scene, you only need to call the add/remove_child methods. This is similar to disabling game objects in other engines.
ta: புரோ: "மறைப்பதன்" இந்த மாறுபாடு காண்பிப்பது/மறைப்பது மிகவும் எளிதானது. காட்சியில் பல மாற்றங்களைக் கண்காணிப்பதற்கு பதிலாக, நீங்கள் சேர்/remove_child முறைகளை மட்டுமே அழைக்க வேண்டும். இது மற்ற இயந்திரங்களில் விளையாட்டு பொருட்களை முடக்குவதற்கு ஒத்ததாகும்.
uk: За: цей варіант «приховування» набагато легше показати/приховати. Замість того, щоб потенційно відстежувати численні зміни сцени, вам потрібно лише викликати методи add/remove_child. Це схоже на відключення ігрових об’єктів в інших двигунах.
zh_tw: 優點：這種「隱藏」變體更容易顯示/隱藏場景，只需呼叫 add_child 或 remove_child 方法，而不必追蹤場景的多次變動。這類似於其他引擎裡的遊戲物件啟用/停用功能。

source: Con: Unlike with hiding it from view only, the data contained within the scene will become stale if it relies on delta time, input, groups, or other data that is derived from :ref:`SceneTree <class_SceneTree>` access.
ga: Con: Murab ionann agus é a chur i bhfolach ón radharc amháin, beidh na sonraí atá sa radharc sean má bhíonn sé ag brath ar am deilte, ionchur, grúpaí, nó sonraí eile a dhíorthaítear ó :ref:`SceneTree <class_SceneTree>` access.
ta: CON: பார்வையில் இருந்து மட்டுமே அதை மறைப்பதைப் போலல்லாமல், டெல்டா நேரம், உள்ளீடு, குழுக்கள் அல்லது பெறப்பட்ட பிற தரவுகளை நம்பியிருந்தால் காட்சிக்குள் உள்ள தரவு பழையதாகிவிடும்: ref: `SceseTree <class_scenetree>` அணுகல்.
uk: Мінус: на відміну від приховування лише для перегляду, дані, що містяться в сцені, стануть застарілими, якщо вони покладаються на дельта-час, вхідні дані, групи чи інші дані, отримані від доступу :ref:`SceneTree <class_SceneTree>`.
zh_tw: 缺點：與單純隱藏場景不同，如果場景內的資料依賴 delta time、輸入、群組或其他來自 :ref:`SceneTree <class_SceneTree>` 的資料，這些內容會變得過時。

source: There are also cases where you may wish to have many scenes present at the same time, such as adding your own singleton at runtime, or preserving a scene's data between scene changes (adding the scene to the root node).
ta: இயக்க நேரத்தில் உங்கள் சொந்த சிங்கிள்டனைச் சேர்ப்பது அல்லது காட்சி மாற்றங்களுக்கு இடையில் ஒரு காட்சியின் தரவைப் பாதுகாப்பது (காட்சியை ரூட் முனையில் சேர்ப்பது) போன்ற பல காட்சிகளை நீங்கள் ஒரே நேரத்தில் வைத்திருக்க விரும்பும் சந்தர்ப்பங்களும் உள்ளன.
uk: Існують також випадки, коли вам може знадобитися мати багато сцен одночасно, наприклад, додати свій власний синглтон під час виконання або зберегти дані сцени між змінами сцени (додавання сцени до кореневого вузла).
zh_tw: 有時你可能需要同時存在多個場景，例如在執行時新增自訂單例，或在切換場景時保留資料（將場景加到根節點下）。

source: Another case may be displaying multiple scenes at the same time using :ref:`SubViewportContainers <class_SubViewportContainer>`. This is optimal for rendering different content in different parts of the screen (e.g. minimaps, split-screen multiplayer).
ta: மற்றொரு வழக்கு ஒரே நேரத்தில் பல காட்சிகளைக் காண்பிக்கும்: குறிப்பு: `subviewportcontainers <class_subviewportcontainer>`. திரையின் வெவ்வேறு பகுதிகளில் வெவ்வேறு உள்ளடக்கங்களை வழங்க இது உகந்தது (எ.கா. மினிமாப்ச், பிளவு-திரை மல்டிபிளேயர்).
uk: Іншим випадком може бути відображення кількох сцен одночасно за допомогою :ref:`SubViewportContainers <class_SubViewportContainer>`. Це оптимально для рендерингу різного вмісту в різних частинах екрана (наприклад, міні-карти, багатокористувацька гра з розділеним екраном).
zh_tw: 另一種情境是使用 :ref:`SubViewportContainers <class_SubViewportContainer>` 同時顯示多個場景。這非常適合在螢幕不同區域算繪不同內容（如小地圖或分割畫面的多人遊戲）。

source: Each option will have cases where it is best appropriate, so you must examine the effects of each approach, and determine what path best fits your unique situation.
ta: ஒவ்வொரு விருப்பத்திலும் இது மிகவும் பொருத்தமான நிகழ்வுகளைக் கொண்டிருக்கும், எனவே ஒவ்வொரு அணுகுமுறையின் விளைவுகளையும் நீங்கள் ஆராய வேண்டும், மேலும் உங்கள் தனித்துவமான சூழ்நிலைக்கு எந்த பாதைக்கு ஏற்றது என்பதை தீர்மானிக்க வேண்டும்.
uk: Кожен варіант матиме випадки, коли він найкраще підходить, тому ви повинні перевірити наслідки кожного підходу та визначити, який шлях найкраще підходить для вашої унікальної ситуації.
zh_tw: 每種選項都有其最合適的應用時機，因此你必須評估每種方式的效果，選擇最適合自己專案需求的做法。
