Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/groups.po
Languages: de, ga, it, ja, pt_br, ta, uk, zh_tw

source: The :ref:`SceneTree <class_SceneTree>` class provides many more useful methods to interact with scenes, their node hierarchy, and groups. It allows you to switch scenes easily or reload them, quit the game or pause and unpause it. It also provides useful signals.
de: Die Klasse :ref:`SceneTree <class_SceneTree>` bietet viele weitere nützliche Methoden zur Interaktion mit Szenen, ihrer Node-Hierarchie und Gruppen. Sie erlaubt es, Szenen einfach zu wechseln oder neu zu laden, das Spiel zu beenden oder es zu pausieren und zu beenden. Außerdem bietet sie nützliche Signale.
ga: Soláthraíonn an rang :ref:`SceneTree <class_SceneTree>` modhanna i bhfad níos úsáidí chun idirghníomhú le radhairc, lena n-ordlathas nód, agus le grúpaí. Ligeann sé duit radhairc a athrú go héasca nó iad a athlódáil, éirí as an gcluiche nó sos agus é a chur ar sos. Soláthraíonn sé comharthaí úsáideacha freisin.
it: La classe :ref:`SceneTree <class_SceneTree>` fornisce molti altri metodi utili per interagire con le scene, la loro gerarchia di nodi e i gruppi. Consente di cambiare facilmente le scene o ricaricarle, uscire dal gioco o metterlo in pausa e riprenderlo. Fornisce anche segnali utili.
ja: \ :ref:`SceneTree <class_SceneTree>`\ クラスは、シーン、ノードの階層、ノードのグループとの対話など、多くの便利なメソッドを提供します。シーンを簡単に切り替えたり、リロード、ゲーム終了、一時停止、一時停止の解除もできます。そのうえ、興味深いシグナルもあります。時間があればチェックしてみてください。
pt_br: A classe :ref:`SceneTree <class_SceneTree>` fornece muitos métodos úteis para interagir com cenas, suas hierarquias e grupos de nós. Ela lhe permite facilmente trocar ou recarregar cenas, sair do jogo ou pausa-lo ou retomá-lo. Ela também fornece sinais úteis.
ta: தி: ref: `SCESETREE <class_scenetree>` வகுப்பு காட்சிகள், அவற்றின் முனை வரிசைமுறை மற்றும் குழுக்களுடன் தொடர்பு கொள்ள இன்னும் பல பயனுள்ள முறைகளை வழங்குகிறது. காட்சிகளை எளிதாக மாற்ற அல்லது அவற்றை மீண்டும் ஏற்றவும், விளையாட்டை விட்டு வெளியேறவும் அல்லது இடைநிறுத்தவும், அதை போட்டியிடவும் இது உங்களை அனுமதிக்கிறது. இது பயனுள்ள சமிக்ஞைகளையும் வழங்குகிறது.
uk: Клас :ref:`SceneTree <class_SceneTree>` надає безліч корисних функцій, таких як взаємодія зі сценами, ієрархією їх вузлів та групами вузлів. Він дозволяє вам легко перемикати сцени, або перезавантажувати їх, виходити з гри, або призупиняти та відновлювати її. Він також надає корисні сигнали.
zh_tw: :ref:`SceneTree <class_SceneTree>` 類別還提供許多實用方法，方便你操作場景、節點階層與群組，例如可以輕鬆切換或重新載入場景、結束遊戲、暫停與取消暫停等。此外也有很多實用訊號可供使用。

source: Select a node in the Scene dock then click the add button with the + symbol.
it: Selezionare un nodo nel pannello Scena, poi cliccare sul pulsante Aggiungi con il simbolo +.
ta: காட்சி கப்பல்துறையில் ஒரு முனையைத் தேர்ந்தெடுத்து, + சின்னத்துடன் சேர் பொத்தானைக் சொடுக்கு செய்க.
zh_tw: 在「場景」面板中選擇一個節點，然後點選帶有「+」符號的新增按鈕。

source: A selected Node from the Scene dock can be added into groups by marking the checkbox on the left side of the groups in the Groups dock. The node you had selected when creating a new group will be automatically checked.
it: Un nodo selezionato dal pannello Scena può essere aggiunto ai gruppi selezionando la casella di spunta sul lato sinistro dei gruppi nel pannello Gruppi. Il nodo selezionato durante la creazione di un nuovo gruppo sarà automaticamente selezionato.
ta: குழுக் கப்பல்துறைகளில் உள்ள குழுக்களின் இடது பக்கத்தில் உள்ள தேர்வுப்பெட்டியைக் குறிப்பதன் மூலம் காட்சி கப்பல்துறையிலிருந்து தேர்ந்தெடுக்கப்பட்ட முனை குழுக்களில் சேர்க்கப்படலாம். புதிய குழுவை உருவாக்கும் போது நீங்கள் தேர்ந்தெடுத்த முனை தானாகவே சரிபார்க்கப்படும்.
zh_tw: 在「群組」分頁中，勾選群組名稱左側的核取方塊即可將場景面板選中的節點加入群組。新建群組時，當前選中的節點會自動被勾選加入該群組。

source: Translation status
pt_br: Progresso da Tradução
