Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/groups.po
Languages: de, ga, it, ja, pt_br, ta, uk, zh_tw

source: Groups
de: Gruppen
ga: Grúpaí
it: Gruppi
ja: グループ
pt_br: Grupos
ta: குழுக்கள்
uk: Групи
zh_tw: 群組

source: Groups in Godot work like tags in other software. You can add a node to as many groups as you want. Then, in code, you can use the SceneTree to:
de: Gruppen in Godot funktionieren wie Tags in anderer Software. Sie können einen Node zu so vielen Gruppen hinzufügen, wie Sie möchten. Im Code können Sie dann den SceneTree verwenden, um:
ga: Oibríonn grúpaí i Godot cosúil le clibeanna i mbogearraí eile. Is féidir leat nód a chur leis an oiread grúpaí agus is mian leat. Ansin, sa chód, is féidir leat an SceneTree a úsáid chun:
it: I gruppi in Godot funzionano come i tag in altri software. È possibile aggiungere un nodo a tutti i gruppi desiderati. Quindi, nel codice, è possibile utilizzare lo SceneTree per:
ja: Godotのグループは他のソフトウェアのタグと同じような機能です。ノードは複数のグループへ追加できます。次にコードではSceneTreeを使用して以下のことを行うことができます。
ta: கோடோட்டில் உள்ள குழுக்கள் மற்ற மென்பொருளில் குறிச்சொற்களைப் போல வேலை செய்கின்றன. நீங்கள் விரும்பும் பல குழுக்களில் ஒரு முனையைச் சேர்க்கலாம். பின்னர், குறியீட்டில், நீங்கள் காட்சியைப் பயன்படுத்தலாம்:
uk: Групи в Godot працюють як теги в іншому програмному забезпеченні. Ви можете додати вузол до будь-якої кількості груп. Потім у коді ви можете використовувати SceneTree для:
zh_tw: Godot 中的群組功能類似於其他軟體的標籤。你可以將一個節點加入任意數量的群組。之後，你可以在程式碼中透過 SceneTree 進行以下操作：

source: Get a list of nodes in a group.
de: Eine Liste von Nodes in einer Gruppe abzurufen.
ga: Faigh liosta nóid i ngrúpa.
it: Ottenere una lista di nodi in un gruppo.
ja: グループ内のノードのリストを取得。
ta: ஒரு குழுவில் முனைகளின் பட்டியலைப் பெறுங்கள்.
uk: Отримайте список вузлів у групі.
zh_tw: 取得群組中的節點清單。

source: Call a method on all nodes in a group.
de: Eine Methode für alle Nodes in einer Gruppe aufrufen.
ga: Glaoigh modh ar gach nóid i ngrúpa.
it: Chiamare un metodo su tutti i nodi in un gruppo.
ja: グループ内のすべてのノードのメソッドを呼び出し。
ta: ஒரு குழுவில் உள்ள அனைத்து முனைகளிலும் ஒரு முறையை அழைக்கவும்.
uk: Викликати метод на всіх вузлах у групі.
zh_tw: 對群組內所有節點呼叫某個方法。

source: Send a notification to all nodes in a group.
de: Eine Benachrichtigung an alle Nodes in einer Gruppe senden.
ga: Seol fógra chuig gach nóid i ngrúpa.
it: Inviare una notifica a tutti i nodi in un gruppi.
ja: グループ内のすべてのノードへ通知を送信。
ta: ஒரு குழுவில் உள்ள அனைத்து முனைகளுக்கும் அறிவிப்பை அனுப்பவும்.
uk: Надіслати сповіщення всім вузлам у групі.
zh_tw: 向群組內所有節點發送通知。

source: This is a useful feature to organize large scenes and decouple code.
de: Dies ist eine nützliche Funktion, um große Szenen zu organisieren und Code zu entkoppeln.
ga: Is gné úsáideach é seo chun radhairc mhóra a eagrú agus cód a dhícheangal.
it: Questa è un'utile funzionalità per organizzare grandi scene e disaccoppiare il codice.
ja: これは大規模なシーンを整理し、コードを分離するのに便利な機能です。
ta: பெரிய காட்சிகளை ஒழுங்கமைக்க மற்றும் குறியீட்டு குறியீட்டை ஒழுங்கமைக்க இது ஒரு பயனுள்ள அம்சமாகும்.
uk: Це корисна функція для організації великих сцен і відокремлення коду.
zh_tw: 這個功能對於管理大型場景及降低程式碼耦合度非常有用。

source: Managing groups
de: Verwalten von Gruppen
ga: Grúpaí a bhainisti
it: Gestione dei gruppi
ja: グループの管理
pt_br: Gerenciando grupos
ta: குழுக்கள் நிர்வகித்தல்
uk: Керування групами
zh_tw: 管理群組

source: Groups are created by adding a node to a new group name, and likewise they are removed by removing all nodes from a given group.
de: Gruppen werden durch Hinzufügen eines Nodes zu einem neuen Gruppennamen erstellt, und ebenso werden sie durch Entfernen aller Nodes aus einer bestimmten Gruppe entfernt.
ga: Cruthaítear grúpaí trí nód a chur le hainm nua grúpa, agus mar an gcéanna baintear iad trí gach nóid a bhaint as grúpa ar leith.
it: I gruppi sono creati aggiungendo un nodo a un nuovo nome di gruppo e, similmente, sono rimossi rimuovendo tutti i nodi da un determinato gruppo.
ja: グループは新しいグループ名へノードを追加することによって作成され、同様に特定のグループからすべてのノードを削除することによって削除されます。
ta: ஒரு புதிய குழு பெயருக்கு ஒரு முனையைச் சேர்ப்பதன் மூலம் குழுக்கள் உருவாக்கப்படுகின்றன, அதேபோல் கொடுக்கப்பட்ட குழுவிலிருந்து அனைத்து முனைகளையும் அகற்றுவதன் மூலம் அவை அகற்றப்படுகின்றன.
uk: Групи створюються шляхом додавання вузла до імені нової групи, і так само вони видаляються шляхом видалення всіх вузлів із даної групи.
zh_tw: 群組是在你將節點新增到一個新的群組名稱時建立的，當某一個群組中的所有節點都被移除時，該群組也就不存在了。

source: There are two ways to add/remove nodes to groups:
de: Es gibt zwei Möglichkeiten, Nodes zu Gruppen hinzuzufügen/zu entfernen:
ga: Tá dhá bhealach ann chun nóid a chur leis /a bhaint le grúpaí:
it: Esistono due modi per aggiungere/rimuovere i gruppi dai nodi:
ja: グループにノードを追加/削除するには2つの方法があります。
pt_br: Há duas maneiras de acrescentar/remover nós aos grupos:
ta: குழுக்களில் முனைகளைச் சேர்க்க/அகற்ற இரண்டு வழிகள் உள்ளன:
uk: Існує два способи додавати/видаляти вузли до груп:
zh_tw: 有兩種方式可以將節點加入或移除群組：

source: During design, by using the Node dock in the editor, or the Global Groups in project settings.
de: Während des Entwurfs, über das Node-Dock im Editor oder über die Globalen Gruppen in den Projekteinstellungen.
ga: Le linn an dearaidh, tríd an duga Node san eagarthóir a úsáid, nó na Grúpaí Domhanda i suíomhanna tionscadail.
it: Durante la progettazione, attraverso il pannello Nodo nell'editor o i Gruppi globali nelle impostazioni del progetto.
ja: 設計中にエディターのノードドック、またはプロジェクト設定のグローバルグループから追加します。
ta: வடிவமைப்பின் போது, எடிட்டரில் முனை கப்பல்துறை அல்லது திட்ட அமைப்புகளில் உலகளாவிய குழுக்களைப் பயன்படுத்துவதன் மூலம்.
uk: Під час проектування за допомогою док-станції Node у редакторі або глобальних груп у налаштуваннях проекту.
zh_tw: 設計階段時，可以在編輯器內透過「節點」面板的「群組」分頁，或在專案設定中的「全域群組」來管理。

source: During execution, by calling :ref:`Node.add_to_group() <class_Node_method_add_to_group>` or :ref:`Node.remove_from_group() <class_Node_method_remove_from_group>`.
de: Während der Ausführung, durch Aufruf von :ref:`Node.add_to_group() <class_Node_method_add_to_group>` oder :ref:`Node.remove_from_group() <class_Node_method_remove_from_group>`.
ga: Le linn an fhorghníomhaithe, trí ghlao a chur ar :ref:`Node.add_to_group() <class_Node_method_add_to_group>` nó :ref:`Node.remove_from_group() <class_Node_method_remove_from_group>`.
it: Durante l'esecuzione, chiamando :ref:`Node.add_to_group() <class_Node_method_add_to_group>` o :ref:`Node.remove_from_group() <class_Node_method_remove_from_group>`.
ja: 実行中に :ref:`Node.add_to_group() <class_Node_method_add_to_group>` または :ref:`Node.remove_from_group() <class_Node_method_remove_from_group>` を呼び出します。
ta: செயல்படுத்தும் போது, அழைப்பதன் மூலம்: ref: `node.add_to_group () <class_node_method_to_to_group>` or: ref: `node.remove_from_group () <class_node_method_remove_from_group>`.
uk: Під час виконання викликом :ref:`Node.add_to_group() <class_Node_method_add_to_group>` або :ref:`Node.remove_from_group() <class_Node_method_remove_from_group>`.
zh_tw: 執行階段時，使用 :ref:`Node.add_to_group() <class_Node_method_add_to_group>` 或 :ref:`Node.remove_from_group() <class_Node_method_remove_from_group>` 來加入或移除群組。

source: Using the Node dock
de: Verwendung des Node-Docks
ga: Ag baint úsáide as an duga Nód
it: Utilizzo del pannello Nodo
ja: ノードドックの使用
pt_br: Usando o painel do nó
ta: முனை கப்பல்துறை பயன்படுத்துதல்
uk: Використання док-станції Node
zh_tw: 使用節點面板

source: You can create new groups using the Groups tab in the Node dock.
de: Sie können neue Gruppen über den Gruppen-Tab im Node-Dock erstellen.
ga: Is féidir leat grúpaí nua a chruthú ag baint úsáide as an cluaisín Grúpaí sa duga Nód.
it: È possibile creare nuovi gruppi utilizzando la scheda Gruppi nel pannello Nodo.
ja: ノードドックの"グループ"タブを使用して、新しいグループを作成できます。
ta: முனை கப்பல்துறையில் குழுக்கள் தாவலைப் பயன்படுத்தி புதிய குழுக்களை உருவாக்கலாம்.
uk: Ви можете створювати нові групи за допомогою вкладки «Групи» в док-станції Node.
zh_tw: 你可以在「節點」面板中的「群組」分頁建立新的群組。

source: Select one or more nodes in the Scene dock then click the add button with the + symbol.
de: Wählen Sie einen oder mehrere Nodes im Szenendock aus und klicken Sie dann auf den Hinzufügen-Button mit dem Symbol +.

source: You should now see the Create New Group modal appear. Write the group name in the field.
de: Es sollte nun das Modal "Neue Gruppe erstellen" angezeigt werden. Geben Sie den Gruppennamen in das Feld ein.
ga: Ba chóir duit an modh Cruthaigh Grúpa Nua a fheiceáil anois. Scríobh ainm an ghrúpa sa réimse.
it: Ora dovrebbe apparire la finestra modale "Crea un nuovo gruppo". Scrivere il nome del gruppo nel campo.
ja: "新規グループの作成" というモーダルダイアログが表示されるはずです。フィールドにグループ名を打ち込みます。
ta: புதிய குழு மோடல் தோற்றத்தை உருவாக்கு இப்போது நீங்கள் காண வேண்டும். குழு பெயரை புலத்தில் எழுதுங்கள்.
uk: Тепер ви повинні побачити модаль «Створити нову групу». Напишіть назву групи в полі.
zh_tw: 此時會跳出「建立新群組」的視窗，請在欄位中輸入群組名稱。

source: You can optionally mark the option "Global", which will make the group visible project-wide, and able to be reused in any project scene. This will also allow you to give it a description.
de: Sie können optional die Option "Global" markieren, wodurch die Gruppe projektweit sichtbar wird und in jeder Projektszene wiederverwendet werden kann. Außerdem können Sie dann eine Beschreibung für die Gruppe eingeben.
ga: Is féidir leat an rogha “Domhanda” a mharcáil go roghnach, a fhágfaidh go mbeidh an grúpa infheicthe ar fud an tionscadail, agus in ann é a athúsáid in aon radharc tionscadail. Ligfidh sé seo duit cur síos a thabhairt dó freisin.
it: Facoltativamente, si può selezionare l'opzione "Globale", la quale renderà il gruppo visibile in tutto il progetto e riutilizzabile in qualsiasi scena del progetto. Ciò permetterà anche di assegnargli una descrizione.
ja: オプションで"グローバル"オプションをマークすると、グループがプロジェクト全体で表示され、任意のプロジェクトシーンで再利用できるようになります。グローバルグループは説明を付けることもできます。
ta: "உலகளாவிய" விருப்பத்தை நீங்கள் விருப்பமாக குறிக்கலாம், இது குழுவைக் காணக்கூடிய திட்ட அளவிற்கு மாற்றும், மேலும் எந்தவொரு திட்டக் காட்சியிலும் மீண்டும் பயன்படுத்த முடியும். இது ஒரு விளக்கத்தை வழங்கவும் உங்களை அனுமதிக்கும்.
uk: За бажанням можна позначити опцію «Глобальна», що зробить групу видимою для всього проекту та її можна буде повторно використовувати в будь-якій сцені проекту. Це також дозволить вам дати йому опис.
zh_tw: 你可以選擇勾選「全域」選項，這樣該群組將會在整個專案中可見，並可於任何場景重複使用。此時也能為群組新增描述。

source: When done, press Ok to create it.
de: Wenn Sie fertig sind, drücken Sie Ok, um sie zu erstellen.
ga: Nuair a dhéantar é, brúigh Ok chun é a chruthú.
it: Una volta terminato, premere Ok per crearlo.
ja: 入力が完了したら、"OK"を押すとグループが作成されます。
ta: முடிந்ததும், அதை உருவாக்க சரி என்பதை அழுத்தவும்.
uk: Після завершення натисніть OK, щоб створити його.
zh_tw: 完成後，按下「確定」以建立群組。

source: You should see the new groups appear in the Groups tab under Scene Groups if the Global option was unmarked, or under Global Groups if that option was marked.
de: Die neuen Gruppen sollten auf dem Gruppen-Tab unter Szenengruppen erscheinen, wenn die Option Global nicht markiert war, oder unter Globale Gruppen, wenn diese Option markiert war.
ga: Ba chóir duit na grúpaí nua a fheiceáil sa chluaisín Grúpaí faoi Grúpaí Radhairc má bhí an rogha Domhanda gan mharcáil, nó faoi Grúpaí Domhanda má bhí an rogha sin marcáilte.
it: I nuovi gruppi dovrebbero apparire nella scheda Gruppi, sotto "Gruppi di scena" se l'opzione Globale non è stata spuntata, oppure in "Gruppi globali" se tale opzione è stata spuntata.
ja: "グローバル"オプションがオフの場合は"シーングループ"の下の"グループ"タブに、そのオプションがオンになっている場合は"グローバルグループ"の下に新しいグループが表示されます。
ta: உலகளாவிய விருப்பம் குறிக்கப்படாவிட்டால் அல்லது அந்த விருப்பம் குறிக்கப்பட்டால் உலகளாவிய குழுக்களின் கீழ் புதிய குழுக்கள் காட்சிக் குழுக்களின் கீழ் குழுக்கள் தாவலில் தோன்றுவதை நீங்கள் காண வேண்டும்.
uk: Ви повинні побачити нові групи на вкладці «Групи» у розділі «Групи сцен», якщо параметр «Глобальні» не було позначено, або в розділі «Глобальні групи», якщо цей параметр було позначено.
zh_tw: 你會在「群組」分頁下看到新群組：若未勾選「全域」，會顯示於「場景群組」；若勾選，則於「全域群組」下顯示。

source: Selected Node(s) from the Scene dock can be added into groups by marking the checkbox on the left side of the groups in the Groups dock. The node(s) you had selected when creating a new group will be automatically checked.
de: Ausgewählte Node(s) aus dem Szenendock können zu Gruppen hinzugefügt werden, indem die Checkbox auf der linken Seite der Gruppen im Gruppendock markiert wird. Der/die Node(s), den/die Sie beim Erstellen einer neuen Gruppe ausgewählt hatten, wird/werden automatisch markiert.

source: All groups present in the project that were marked as Global, created from any scene, will be visible under Global Groups.
de: Alle im Projekt vorhandenen Gruppen, die als Global markiert wurden und aus einer beliebigen Szene erstellt wurden, werden unter Globale Gruppen angezeigt.
ga: Beidh gach grúpa atá i láthair sa tionscadal a mharcáladh mar Domhanda, a cruthaíodh ó aon radharc, le feiceáil faoi Grúpaí Domhanda.
it: Tutti i gruppi presenti nel progetto segnati come globali, creati da qualsiasi scena, saranno visibili sotto "Gruppi globali".
ja: プロジェクト内に存在する、グローバルとしてマークされ、任意のシーンから作成されたすべてのグループは、グローバルグループの下に表示されます。
ta: எந்தவொரு காட்சியிலிருந்தும் உருவாக்கப்பட்ட உலகளாவிய எனக் குறிக்கப்பட்ட திட்டத்தில் உள்ள அனைத்து குழுக்களும் உலகளாவிய குழுக்களின் கீழ் காணப்படும்.
uk: Усі групи, присутні в проекті, які були позначені як Глобальні, створені з будь-якої сцени, будуть видимі в Глобальних групах.
zh_tw: 所有在專案中被設為全域的群組，不論在哪個場景建立，都會在「全域群組」下顯示。

source: Any other group derived from nodes in the current scene will appear under Scene Groups.
de: Jede andere Gruppe, die von Nodes in der aktuellen Szene abgeleitet ist, erscheint unter Szenengruppen.
ga: Beidh aon ghrúpa eile a dhíorthaítear ó nóid sa radharc reatha le feiceáil faoi Ghrúpaí Radharc.
it: Qualsiasi altro gruppo derivato dai nodi nella scena attuale apparirà in "Gruppi di scena".
ja: 現在のシーンのノードから派生した他のグループは、シーングループ の下に表示されます。
ta: தற்போதைய காட்சியில் முனைகளிலிருந்து பெறப்பட்ட வேறு எந்த குழுவும் காட்சிக் குழுக்களின் கீழ் தோன்றும்.
uk: Будь-яка інша група, отримана з вузлів у поточній сцені, з’явиться в розділі «Групи сцен».
zh_tw: 其他從目前場景節點建立的群組則會顯示在「場景群組」下。

source: The same underlying logic is used for both Global and Scene groups. Groups with the same name are considered one and the same. This feature is purely organizational.
de: Für globale Gruppen und Szenengruppen wird dieselbe Logik verwendet. Gruppen mit demselben Namen werden als ein und dieselbe Gruppe betrachtet. Diese Funktion ist rein organisatorisch.
ga: Úsáidtear an loighic bhunúsach céanna do ghrúpaí Domhanda agus Radhairc. Meastar go bhfuil grúpaí leis an ainm céanna mar cheann agus mar an gcéanna. Tá an ghné seo eagraíochtúil amháin.
it: La stessa logica di base è utilizzata per entrambi i gruppi Globali e di Scena. I gruppi con lo stesso nome sono considerati gli stessi. Questa funzionalitàè puramente organizzativa.
ja: 同じベースとなるロジックがグローバルグループとシーングループの両方に使用されます。同じ名前のグループは同一とみなされます。この機能は純粋に組織的なものです。
ta: உலகளாவிய மற்றும் காட்சிக் குழுக்களுக்கும் அதே அடிப்படை வழக்கு பயன்படுத்தப்படுகிறது. ஒரே பெயரைக் கொண்ட குழுக்கள் ஒன்றுதான் என்று கருதப்படுகின்றன. இந்த நற்பொருத்தம் முற்றிலும் நிறுவனமானது.
uk: Та сама основна логіка використовується як для глобальних, так і для груп сцен. Групи з однаковою назвою вважаються однією. Ця особливість суто організаційна.
zh_tw: 全域群組和場景群組的底層邏輯完全相同，只是歸類方式不同。具有相同名稱的群組會被視為同一個群組。這個設計純粹是為了組織方便。

source: You can manage Global Groups in the Global Groups dock, inside Project Settings. There, you will be able to add new global groups, or change existing groups' names and descriptions.
de: Globale Gruppen können Sie im Globale Gruppen-Dock in den Projekteinstellungen verwalten. Dort können Sie neue globale Gruppen hinzufügen oder die Namen und Beschreibungen der vorhandenen Gruppen ändern.
ga: Is féidir leat Grúpaí Domhanda a bhainistiú i nduga na nGrúpaí Domhanda, taobh istigh de Socru Ansin, beidh tú in ann grúpaí domhanda nua a chur leis, nó ainmneacha agus tuairiscí na ngrúpaí atá ann cheana a athrú.
it: Si possono gestire i Gruppi globali nel pannello Gruppi globali, all'interno delle Impostazioni del progetto. Da qui, si possono aggiungere nuovi gruppi globali o cambiare i nomi e le descrizioni dei gruppi esistenti.
ja: グローバルグループは、プロジェクト設定内のグローバルグループドックで管理できます。そこで新しいグローバルグループを追加したり、既存のグループの名前や説明を変更したりできます。
ta: திட்ட அமைப்புகளுக்குள், உலகளாவிய குழுக்கள் கப்பல்துறையில் உலகளாவிய குழுக்களை நீங்கள் நிர்வகிக்கலாம். அங்கு, நீங்கள் புதிய உலகளாவிய குழுக்களைச் சேர்க்க முடியும் அல்லது ஏற்கனவே உள்ள குழுக்களின் பெயர்கள் மற்றும் விளக்கங்களை மாற்ற முடியும்.
uk: Ви можете керувати глобальними групами в док-станції Global Groups у налаштуваннях проекту. Там ви зможете додавати нові глобальні групи або змінювати назви та описи існуючих груп.
zh_tw: 你可以在「專案設定」中的「全域群組」面板中管理全域群組，包含新增、修改名稱與描述等操作。

source: Using code
de: Verwendung von Code
ga: Cód ag baint úsáide
it: Tramite codice
ja: コードの使用
pt_br: Usando código
ta: குறியீட்டைப் பயன்படுத்துதல்
uk: Використання коду
zh_tw: 使用程式碼

source: You can also manage groups from scripts. The following code adds the node to which you attach the script to the ``guards`` group as soon as it enters the scene tree.
de: Sie können Gruppen auch von Skripten aus verwalten. Der folgende Code fügt den Node, an den Sie das Skript anhängen, der Gruppe ``guards`` hinzu, sobald er den Szenenbaum betritt.
ga: Is féidir leat grúpaí a bhainistiú ó scripteanna freisin. Cuireann an cód seo a leanas an nód lena gceanglaíonn tú an script leis an ngrúpa ``gards` a luaithe a théann sé isteach sa chrann radhairc.
it: È anche possibile gestire i gruppi dagli script. Il seguente codice aggiunge il nodo a cui viene allegato lo script al gruppo ``guards`` appena entra nell'albero di scene.
ja: スクリプトからグループを管理することもできます。次のコードはスクリプトをアタッチするノードがシーンツリーに入ったときに ``guards`` グループに追加します。
pt_br: Você também pode administrar grupos a partir de scripts. O seguinte código adiciona o nó ao qual você anexa o script ao grupo ``guards`` assim que ele entra na árvore de cena.
ta: ச்கிரிப்ட்களிலிருந்து குழுக்களையும் நிர்வகிக்கலாம். காட்சி மரத்திற்குள் நுழைந்தவுடன் ச்கிரிப்டை `` காவலர்கள்`` குழுவுடன் இணைக்கும் முனையை பின்வரும் குறியீடு சேர்க்கிறது.
uk: Ви також можете керувати групами за допомогою сценаріїв. Наступний код додає вузол, до якого ви приєднуєте сценарій, до групи ``guards``, щойно він потрапляє в дерево сцени.
zh_tw: 你也可以用腳本來管理群組。下列程式碼會在節點進入場景樹時，將其加入 ``guards`` 群組。

source: Imagine you're creating an infiltration game. When an enemy spots the player, you want all guards and robots to be on alert.
de: Stellen Sie sich vor, Sie entwickeln ein Infiltrationsspiel. Wenn ein Feind den Spieler entdeckt, sollen alle Wachen und Roboter in Alarmbereitschaft sein.
ga: Samhlaigh go bhfuil tú ag cruthú cluiche insíothaithe. Nuair a aimsíonn namhaid an t-imreoir, ba mhaith leat go mbeadh na gardaí agus na robots go léir ar airdeall.
it: Si immagini di creare un gioco di infiltrazione. Quando un nemico individua il giocatore, si desidera che tutte le guardie e i robot siano in allerta.
ja: 潜入ゲームを作成していると想像してください。敵がプレイヤーを発見したら、すべての警備員とロボットが警戒する必要があります。
ta: நீங்கள் ஒரு ஊடுருவல் விளையாட்டை உருவாக்குகிறீர்கள் என்று கற்பனை செய்து பாருங்கள். ஒரு எதிரி வீரரைக் காணும்போது, எல்லா காவலர்களும் ரோபோக்களும் எச்சரிக்கையாக இருக்க வேண்டும் என்று நீங்கள் விரும்புகிறீர்கள்.
uk: Уявіть, що ви створюєте гру проникнення. Коли ворог помічає гравця, ви хочете, щоб усі охоронці та роботи були напоготові.
zh_tw: 假設你正在開發一款潛行遊戲。當有敵人發現玩家時，你希望所有守衛與機器人都進入警戒狀態。

source: In the fictional example below, we use ``SceneTree.call_group()`` to alert all enemies that the player was spotted.
de: Im folgenden fiktiven Beispiel verwenden wir ``SceneTree.call_group()``, um alle Feinde darauf hinzuweisen, daß der Spieler entdeckt wurde.
ga: Sa sampla ficseanúil thíos, úsáidimid ``SceneTree.call_group () ``chun na naimhde go léir a chur ar an eolas gur chonaic an t-imreoir.
it: Nell'esempio fittizio riportato di seguito, utilizziamo ``SceneTree.call_group()`` per avvertire tutti i nemici che il giocatore è stato individuato.
ja: 以下の例では ``SceneTree.call_group()`` を使用して、プレイヤーが発見されたことをすべての敵にアラートします。
ta: கீழேயுள்ள கற்பனையான எடுத்துக்காட்டில், வீரர் கண்டுபிடிக்கப்பட்ட அனைத்து எதிரிகளையும் எச்சரிக்க `` schiveree.call_group () `` பயன்படுத்துகிறோம்.
uk: У вигаданому прикладі нижче ми використовуємо ``SceneTree.call_group()``, щоб сповістити всіх ворогів про те, що гравця помітили.
zh_tw: 在下方的範例中，我們使用 ``SceneTree.call_group()`` 來通知所有敵人，玩家已被發現。

source: The above code calls the function ``enter_alert_mode`` on every member of the group ``guards``.
de: Der obige Code ruft die Funktion ``enter_alert_mode`` bei jedem Member der Gruppe ``guards`` auf.
ga: Glaonn an cód thuas an fheidhm ``enter_alert_mode`` ar gach ball den ghrúpa ``guards``.
it: Il codice sopra chiama la funzione ``enter_alert_mode`` su ogni membro del gruppo ``guards``.
ja: 上記のコードは、グループ ``guards`` のすべてのメンバーに対して関数 ``enter_alert_mode`` を呼び出します。
pt_br: O código acima chama a função ``enter_alert_mode`` em cada membro do grupo ``guards``.
ta: மேலே உள்ள குறியீடு `` காவலர்கள்`` குழுவின் ஒவ்வொரு உறுப்பினரிடமும் `` Enter_alert_mode`` செயல்பாட்டை அழைக்கிறது.
uk: Наведений вище код викликає функцію ``enter_alert_mode`` для кожного члена групи ``guards``.
zh_tw: 上述程式碼會對 ``guards`` 群組所有成員呼叫 ``enter_alert_mode`` 方法。

source: To get the full list of nodes in the ``guards`` group as an array, you can call :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
de: Um die komplette Liste der Nodes in der ``guards``-Gruppe als Array zu erhalten, kann man :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>` aufrufen:
ga: Chun liosta iomlán na nóid sa ghrúpa ``guards`` a fháil mar eagar, is féidir glaoch a chur ar :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
it: È anche possibile ottenere la lista completa dei nodi nel gruppo ``guards`` sotto forma di array, chiamando :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
ja: ``guards`` グループ内のノードの完全なリストを配列として取得するには、 :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>` を呼び出すことができます。
pt_br: Para obter a lista completa de nós no grupo ``guards`` como uma matriz, você pode chamar :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
ta: `` காவலர்கள்`` குழுவில் உள்ள முனைகளின் முழு பட்டியலையும் ஒரு வரிசையாகப் பெற, நீங்கள் அழைக்கலாம்: ref: `schivere.get_nodes_in_group () <class_scenetree_method_get_nodes_in_group>`:
uk: Щоб отримати повний список вузлів у групі ``guards`` у вигляді масиву, ви можете викликати :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`:
zh_tw: 如果你想取得 ``guards`` 群組所有節點的陣列，可以呼叫 :ref:`SceneTree.get_nodes_in_group() <class_SceneTree_method_get_nodes_in_group>`：
