Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/how_to_read_the_godot_api.po
Languages: ga, it, pl, ru, ta, uk, zh_tw

source: The Enumerations list details the enumerable data types associated with the current class.
ga: Sonraítear sa liosta Áirimh na cineálacha sonraí ináirithe a bhaineann leis an aicme reatha.
it: L'elenco delle Enumerazioni descrive in dettaglio i tipi di dati enumerabili associati alla classe attuale.
ru: Список "Enumerations (Перечисления)" содержит подробные данные о перечисляемых типах данных, связанных с текущим классом.
ta: தற்போதைய வகுப்போடு தொடர்புடைய கணக்கிடக்கூடிய தரவு வகைகளை கணக்கீட்டு பட்டியல் விவரிக்கிறது.
uk: У списку Enumeration деталізуються перелічувані типи даних, пов’язані з поточним класом.
zh_tw: 列舉列表會詳細說明與該類別關聯的可列舉資料型別。

source: For each enumeration, the page states its name and then lists its possible values.
ga: I gcás gach áirimh, luann an leathanach a ainm agus ansin liostaítear a luachanna féideartha.
it: Per ogni enumerazione, la pagina ne indica il nome e poi elenca i possibili valori.
ru: Для каждого перечисления на странице указано его название, а затем перечислены его возможные значения.
ta: ஒவ்வொரு கணக்கீட்டிற்கும், பக்கம் அதன் பெயரைக் கூறுகிறது, பின்னர் அதன் சாத்தியமான மதிப்புகளை பட்டியலிடுகிறது.
uk: Для кожного переліку на сторінці вказується його назва, а потім перераховуються його можливі значення.
zh_tw: 每個列舉都會說明其名稱並列出所有可能的值。

source: For each enumeration value, the page states its name, its integer value, and an explanation of its use case(s) and/or affects.
ga: I gcás gach luach áirimh, luann an leathanach a ainm, a luach slánuimhir, agus míniú ar a chás(anna) úsáide agus/nó a théann i bhfeidhm air.
it: Per ogni valore di enumerazione, la pagina ne indica il nome, il valore intero e una spiegazione dei casi d'uso e/o degli effetti.
ru: Для каждого значения перечисления на странице указано его имя, его целочисленное значение и объяснение его варианта(ов) использования и/или влияния.
ta: ஒவ்வொரு கணக்கீட்டு மதிப்பிற்கும், பக்கம் அதன் பெயர், அதன் முழு மதிப்பு மற்றும் அதன் பயன்பாட்டு வழக்கு (கள்) மற்றும்/அல்லது பாதிப்புகளின் விளக்கம் ஆகியவற்றைக் கூறுகிறது.
uk: Для кожного значення переліку на сторінці зазначається його назва, ціле значення та пояснення його варіантів використання та/або ефектів.
zh_tw: 每個列舉值都會說明其名稱、整數值，及其用途或影響。

source: Constants
ga: Coimeádanna
it: Costanti
pl: Stałe
ru: Константы
ta: மாறிலிகள்
uk: Константи
zh_tw: 常數

source: The Constants list details named integer constants in the current class.
ga: Liostaíonn na Tairisigh sonraí ainmnithe tairisigh slánuimhir sa rang reatha.
it: L'elenco delle Costanti descrive in dettaglio le costanti intere denominate nella classe attuale.
ru: В списке "Constants (Константы)" содержатся именованные целочисленные константы в текущем классе.
ta: தற்போதைய வகுப்பில் முழு எண் மாறிலிகள் பெயரிடப்பட்ட விவரங்களை மாறிலிகள் பட்டியலிடுகின்றன.
uk: Список констант містить деталі, названі цілочисельними константами в поточному класі.
zh_tw: 常數列表會詳細說明此類別中命名的整數常數。

source: For each constant, the page states its name, its integer value, and an explanation of its use case(s) and/or affects.
ga: I gcás gach tairiseach, luann an leathanach a ainm, a luach slánuimhir, agus míniú ar a chás (í) úsáide agus / nó a théann i bhfeidhm air.
it: Per ogni costante, la pagina ne indica il nome, il valore intero e una spiegazione dei casi d'uso e/o degli effetti.
ru: Для каждой константы на странице указано ее имя, целочисленное значение и объяснение ее вариантов использования и/или влияний.
ta: ஒவ்வொரு மாறிலருக்கும், பக்கம் அதன் பெயர், அதன் முழு மதிப்பு மற்றும் அதன் பயன்பாட்டு வழக்கு (கள்) மற்றும்/அல்லது பாதிப்புகளின் விளக்கம் ஆகியவற்றைக் கூறுகிறது.
uk: Для кожної константи на сторінці вказується її назва, ціле значення та пояснення варіантів використання та/або ефектів.
zh_tw: 每個常數都會說明其名稱、整數值，以及用途或影響的說明。

source: ``NOTIFICATION_*`` constants' descriptions will state which engine event triggers the notification.
ga: Luafar i dtuairiscí ''NOTIFICATION_*'' ar na tairisigh cén teagmhas innill a spreagann an fógra.
it: Le descrizioni delle costanti ``NOTIFICATION_*`` indicheranno quale evento del motore attiva la notifica.
ru: Описания констант ``NOTIFICATION_*`` будут указывать, какое событие движка запускает уведомление.
ta: `` அறிவிப்பு_*`` `மாறிலிகள் 'விளக்கங்கள் எந்த இயந்திர நிகழ்வு அறிவிப்பைத் தூண்டுகிறது என்பதைக் குறிப்பிடும்.
uk: Описи констант ``NOTIFICATION_*`` вказуватимуть, яка подія двигуна викликає сповіщення.
zh_tw: ``NOTIFICATION_*`` 常數的說明會標示是哪個引擎事件會觸發該通知。

source: Property Descriptions
ga: Tuairiscí Maoine
it: Descrizioni di proprietà
ru: Property Descriptions (Описания недвижимости)
ta: சொத்து விளக்கங்கள்
uk: Опис власності
zh_tw: 屬性說明

source: The Property Descriptions list details everything about each property.
ga: Sonraítear gach rud faoi gach maoin sa liosta Tuairiscí Maoine.
it: L'elenco delle descrizioni delle proprietà fornisce informazioni dettagliate su ciascuna proprietà.
ru: В списке Property Descriptions (Описания свойста) содержится подробная информация о каждом объекте свойства.
ta: சொத்து விளக்கங்கள் பட்டியல் ஒவ்வொரு சொத்து பற்றிய அனைத்தையும் விவரிக்கிறது.
uk: У списку «Описи властивостей» детально описано все про кожну власність.
zh_tw: 屬性說明列表會詳細說明每個屬性的所有資訊。

source: It restates the data type and name of the property.
ga: Athdhearbhaíonn sé cineál sonraí agus ainm na maoine.
it: Ribadisce il tipo di dato e il nome della proprietà.
ru: В нем повторно указывается тип данных и название свойства.
ta: இது தரவு வகை மற்றும் சொத்தின் பெயரைக் குறிக்கிறது.
uk: Він змінює тип даних і назву властивості.
zh_tw: 會再次說明屬性的資料型別與名稱。

source: Every property in the Godot API is bound to a pair of setter and getter functions. Using either is equivalent. They are listed here.
ga: Tá gach maoin sa API Godot faoi cheangal le péire feidhmeanna socraitheora agus getter. Is ionann ceachtar acu a úsáid. Tá siad liostaithe anseo.
it: Ogni proprietà nell'API di Godot è associata a una coppia di funzioni setter e getter. L'utilizzo di una delle due è equivalente. Le funzioni sono elencate qui.
ru: Каждое свойство в API Godot привязано к паре функций-сеттеров и геттеров. Использование любой из них равнозначно. Они перечислены здесь.
ta: கோடோட் ஏபிஐயில் உள்ள ஒவ்வொரு சொத்தும் ஒரு இணை செட்டர் மற்றும் பெறுநர் செயல்பாடுகளுடன் பிணைக்கப்பட்டுள்ளது. ஒன்றைப் பயன்படுத்துவது சமம். அவை இங்கே பட்டியலிடப்பட்டுள்ளன.
uk: Кожна властивість в Godot API прив’язана до пари установчих і приймальних функцій. Використання будь-якого є еквівалентним. Вони перераховані тут.
zh_tw: Godot API 中的每個屬性都會綁定一對 setter 和 getter 函式。使用任一者都可以。這裡會列出它們。

source: Below that is a detailed summary of what the property's data represents, its use case(s) and/or the affects of changing it. It may include code samples and/or links to relevant parts of the Godot API.
ga: Anseo thíos tá achoimre mhionsonraithe ar an méid a léiríonn sonraí na maoine, a cás/cásanna úsáide agus/nó an tionchar a bhaineann lena athrú. D'fhéadfadh samplaí cóid agus/nó naisc chuig codanna ábhartha de API Godot a bheith san áireamh ann.
it: Di seguito è riportato un riepilogo dettagliato di ciò che rappresentano i dati della proprietà, dei suoi casi d'uso e/o degli effetti delle modifiche. Potrebbe includere esempi di codice e/o collegamenti a parti pertinenti all'API di Godot.
ru: Ниже представлено подробное описание того, что представляют собой данные свойства, вариантов их использования и/или последствий их изменения. Оно может включать примеры кода и/или ссылки на соответствующие разделы API Godot.
ta: அதற்குக் கீழே சொத்தின் தரவு எதைக் குறிக்கிறது, அதன் பயன்பாட்டு வழக்கு (கள்) மற்றும்/அல்லது அதை மாற்றுவதன் பாதிப்புகள் ஆகியவற்றின் விரிவான சுருக்கம். இதில் குறியீடு மாதிரிகள் மற்றும்/அல்லது கோடோட் ஏபிஐயின் தொடர்புடைய பகுதிகளுக்கான இணைப்புகள் இருக்கலாம்.
uk: Нижче наведено детальний підсумок того, що представляють дані властивості, варіанти використання та/або наслідки їх зміни. Він може містити зразки коду та/або посилання на відповідні частини API Godot.
zh_tw: 下方會有該屬性資料代表的意義、用途及更改後的影響等詳細說明，可能還會包含程式碼範例或是 Godot API 相關部分的連結。

source: Knowing the setter and getter names is useful when one must bind a method name or :ref:`Callable<class_Callable>` to something.
ga: Tá sé úsáideach na hainmneacha socraitheora agus faighteoir a bheith ar eolas nuair is gá ainm modha nó :tag:`Inghlaoite <class_Callable>` a cheangal le rud éigin.
it: Conoscere i nomi dei setter e dei getter è utile quando si deve associare il nome di un metodo o :ref:`Callable<class_Callable>` a qualcosa.
ru: Знание имен setter и getter полезно, когда необходимо связать имя метода или :ref:`Callable<class_Callable>` с чем-либо.
ta: ஒரு முறை பெயரை பிணைக்க வேண்டும் போது செட்டர் மற்றும் பெறுநர் பெயர்களை அறிவது பயனுள்ளதாக இருக்கும்: குறிப்பு: `அழைக்கக்கூடிய <class_callable>` எதையாவது.
uk: Знати імена установщика та отримувача корисно, коли необхідно прив’язати назву методу або :ref:`Callable<class_Callable>` до чогось.
zh_tw: 當你需要將方法名稱或 :ref:`Callable<class_Callable>` 綁定到某個目標時，知道 setter 與 getter 的名稱會很有幫助。

source: Method Descriptions
ga: Cur Síos ar an Modh
it: Descrizioni dei metodi
ru: Method Descriptions (Описания методов)
ta: முறை விளக்கங்கள்
uk: Опис методів
zh_tw: 方法說明

source: The Method Descriptions list details everything about each method.
ga: Sonraíonn an liosta Cur síos Modh gach rud faoi gach modh.
it: L'elenco delle descrizioni dei metodi fornisce informazioni dettagliate su ciascun metodo.
ru: В списке "Описания методов" подробно описан каждый метод.
ta: முறை விளக்கங்கள் பட்டியல் ஒவ்வொரு முறையையும் பற்றிய அனைத்தையும் விவரிக்கிறது.
uk: У списку описів методів детально описано кожен метод.
zh_tw: 方法說明列表會詳細說明每個方法的所有內容。

source: It restates the method's return data type, parameter names/types/defaults, and qualifiers.
ga: Athdhearbhaíonn sé cineál sonraí fillte an mhodha, ainmneacha paraiméadair / cineálacha / mainneachtainí, agus cáilitheoirí.
it: Ribadisce il tipo di dato restituito dal metodo, i nomi/tipi/valori predefiniti dei parametri e i qualificatori.
ru: В нем перечисляются возвращаемый методом тип данных, parameter names/types/defaults (имена параметров/типы/значения) по умолчанию и qualifiers (квалификаторы).
ta: இது முறையின் திரும்பும் தரவு வகை, அளவுரு பெயர்கள்/வகைகள்/இயல்புநிலை மற்றும் தகுதிகள் ஆகியவற்றை மறுபரிசீலனை செய்கிறது.
uk: Він повторює тип даних, що повертаються методом, назви параметрів/типи/за замовчуванням і кваліфікатори.
zh_tw: 會再次說明方法的回傳資料型別、參數名稱／型別／預設值，以及限定符。

source: Below that is a detailed summary of what the method does and its use case(s). It may include code samples and/or links to relevant parts of the Godot API.
ga: Anseo thíos tá achoimre mhionsonraithe ar cad a dhéanann an modh agus a chás (í) úsáide. D'fhéadfadh samplaí cóid agus/nó naisc chuig codanna ábhartha de API Godot a bheith san áireamh ann.
it: Di seguito è riportato un riepilogo dettagliato di cosa fa il metodo e dei suoi casi d'uso. Potrebbe includere esempi di codice e/o collegamenti a parti pertinenti all'API di Godot.
ru: Ниже представлено подробное описание метода и вариантов его использования. Оно может включать примеры кода и/или ссылки на соответствующие разделы API Godot.
ta: அதற்குக் கீழே முறை என்ன செய்கிறது மற்றும் அதன் பயன்பாட்டு வழக்கு (கள்) ஆகியவற்றின் விரிவான சுருக்கம். இதில் குறியீடு மாதிரிகள் மற்றும்/அல்லது கோடோட் ஏபிஐயின் தொடர்புடைய பகுதிகளுக்கான இணைப்புகள் இருக்கலாம்.
uk: Нижче наведено детальний опис того, що робить метод, і варіанти його використання. Він може містити зразки коду та/або посилання на відповідні частини API Godot.
zh_tw: 下方會有該方法的用途與用例等詳細說明，可能還會包含程式碼範例或是 Godot API 相關部分的連結。
