Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/how_to_read_the_godot_api.po
Languages: ga, it, pl, ru, ta, uk, zh_tw

source: How to read the Godot API
ga: Conas API Godot a léamh
it: Come leggere l'API di Godot
pl: Jak czytać dokumentacje Godot API
ru: Как читать API Godot
ta: கோடோட் பநிஇ படிப்பது எப்படி
uk: Як читати Godot API
zh_tw: 如何閱讀 Godot API

source: On this page, you'll learn how to read the class reference for the Godot API.
ga: Ar an leathanach seo, foghlaimeoidh tú conas an tagairt ranga don API Godot a léamh.
it: In questa pagina, imparerai come leggere il riferimento alle classi per l'API di Godot.
pl: Na tej stronie, dowiesz się jak czytać dokumentację klas dla API Godota.
ru: На этой странице вы узнаете, как читать справочник классов для API Godot.
ta: இந்த பக்கத்தில், கோடோட் ஏபிஐக்கான வகுப்பு குறிப்பை எவ்வாறு படிப்பது என்பதை நீங்கள் கற்றுக்கொள்வீர்கள்.
uk: На цій сторінці ви дізнаєтеся, як читати посилання на клас для Godot API.
zh_tw: 在本頁您將學會如何閱讀 Godot API 的類別參考。

source: The API, or Application Programming Interface, is an index of what Godot offers users. It provides a brief summary of which classes exist, how they are related to each other, what features they have, and how to use them.
ga: Is innéacs é an API, nó Comhéadan Feidhmchláir den mhéid a thairgeann Godot d'úsáideoirí. Tugtar achoimre ghairid ann ar na ranganna atá ann, ar an gcaoi a bhfuil siad gaolta lena chéile, ar na gnéithe atá acu, agus ar conas iad a úsáid.
it: L'API, o Application Programming Interface, è un indice di ciò che Godot offre agli utenti. Fornisce un breve riepilogo delle classi esistenti, di come sono correlate tra loro, delle loro funzionalità e di come utilizzarle.
pl: API, lub Interfejs Programowania Aplikacji, to indeks tego co Godot oferuje użytkownikom. Zapewnia on krótkie podsumowanie tego jakie klasy istnieją, jakie mają między sobą zależności, jakie funkcjonalności posiadają, oraz jak je tworzyć.
ru: API (Интерфейс Прикладного Программирования) — это каталог того, что Godot предлагает пользователям. Он содержит краткую информацию о существующих классах, их взаимосвязях, функциях и способах их использования.
ta: பநிஇ, அல்லது பயன்பாட்டு நிரலாக்க இடைமுகம், கோடோட் பயனர்களுக்கு வழங்கும் ஒரு குறியீடாகும். எந்த வகுப்புகள் உள்ளன, அவை ஒருவருக்கொருவர் எவ்வாறு தொடர்புடையவை, அவற்றில் என்ன நற்பொருத்தங்கள் உள்ளன, அவற்றை எவ்வாறு பயன்படுத்துவது என்பது பற்றிய சுருக்கமான சுருக்கத்தை இது வழங்குகிறது.
uk: API, або інтерфейс прикладного програмування, є покажчиком того, що Godot пропонує користувачам. У ньому подано коротку інформацію про те, які класи існують, як вони пов’язані один з одним, які функції вони мають і як ними користуватися.
zh_tw: API（應用程式介面）是 Godot 提供給使用者的功能索引。它簡要說明有哪些類別、彼此之間的關係、各自的功能，以及如何使用它們。

source: Inheritance
ga: Oidhreacht
it: Ereditarietà
pl: Dziedziczenie
ru: Наследование
ta: பரம்பரை
uk: Успадкування
zh_tw: 繼承

source: At the top of each file, you will see the name of the class.
ga: Ag barr gach comhaid, feicfidh tú ainm an ranga.
it: In alto a ogni file, vedrai il nome della classe.
pl: Na górze plików znajduje się nazwa klasy.
ru: В верхней части каждого файла вы увидите название класса.
ta: ஒவ்வொரு கோப்பின் மேலேயும், வகுப்பின் பெயரைக் காண்பீர்கள்.
uk: У верхній частині кожного файлу ви побачите назву класу.
zh_tw: 每個檔案的頂部都會顯示該類別的名稱。

source: The "Inherits" section lists each class the current one inherits. Here ``CanvasItem`` inherits ``Node`` and ``Node`` inherits ``Object``.
ga: Liostaíonn an rannóg "Oidhreacht" gach rang a fhaigheann an ceann reatha le hoidhreacht. Anseo faigheann ''CanvasItem'' oidhreacht ''Node'' agus ''Node'' le hoidhreacht ''Object''.
it: La sezione "Eredita" elenca ogni classe ereditata da quella attuale. Qui ``CanvasItem`` eredita ``Node`` e ``Node`` eredita ``Object``.
pl: Sekcja "Dziedziczenie" wymienia każdą klasę po której obecna dziedziczy. Tutaj ``CanvasItem`` dziedziczy po ``Node`` i ``Node`` dziedziczy po ``Object``.
ru: В разделе "Наследует" перечислены все классы, которые наследует текущий класс. Здесь ``CanvasItem`` наследует ``Node``, а ``Node`` наследует ``Object``.
ta: "மரபுரிமை" பிரிவு ஒவ்வொரு வகுப்பையும் தற்போதையது மரபுரிமையாக பட்டியலிடுகிறது. இங்கே `` canvasitem`` `` முனை`` மற்றும் `` முனை`` ஆகியவற்றை `` பொருள்` ஆகியவற்றைப் பெறுகிறது.
uk: У розділі «Наслідування» перераховано кожен клас, який успадковує поточний. Тут ``CanvasItem`` успадковує ``Node``, а ``Node`` успадковує ``Object``.
zh_tw: 「繼承」區段會列出當前類別繼承自哪些類別。例如 ``CanvasItem`` 繼承自 ``Node``，而 ``Node`` 則繼承自 ``Object``。

source: The "Inherited By" section lists each class which directly inherits the current class. Here ``Control`` and ``Node2D`` both inherit ``CanvasItem``.
ga: Liostaítear sa rannán "Oidhreacht De réir" gach aicme a fhaigheann an aicme reatha le hoidhreacht go díreach. Anseo faigheann ''Control'' agus ''Node2D'' ''CanvasItem'' le hoidhreacht.
it: La sezione "Ereditato da" elenca ciascuna classe che eredita direttamente la classe attuale. Qui ``Control`` e ``Node2D`` ereditano entrambi ``CanvasItem``.
pl: Sekcja "Dziedziczony Przez" zawiera klasy które są bezpośrednio dziedziczone przez aktualnie otwartą klasę. Na przykładzie ``Control`` oraz ``Node2D`` dziedziczą po klasie ``CanvasItem``.
ru: В разделе "Inherited By" перечислены все классы, которые напрямую наследуют текущий класс. Здесь ``Control`` и ``Node2D`` оба наследуют ``CanvasItem``.
ta: "மரபுரிமை பெற்றது" பிரிவு ஒவ்வொரு வகுப்பையும் பட்டியலிடுகிறது, இது தற்போதைய வகுப்பை நேரடியாக பெறுகிறது. இங்கே `` கட்டுப்பாடு`` மற்றும் `` node2d`` இரண்டும் `` canvasitem`` ஐப் பெறுகின்றன.
uk: У розділі «Успадковано» перераховано кожен клас, який безпосередньо успадковує поточний клас. Тут ``Control`` і ``Node2D`` успадковують ``CanvasItem``.
zh_tw: 「被繼承」區段會列出直接繼承此類別的其他類別。例如 ``Control`` 和 ``Node2D`` 都繼承自 ``CanvasItem``。

source: Brief Description
ga: Cur Síos Gairid
it: Breve descrizione
pl: Krótki Opis
ru: Краткое описание
ta: சுருக்கமான விளக்கம்
uk: Короткий опис
zh_tw: 簡要說明

source: Next a brief description of the class. This text appears in Godot Editor popups for creating Nodes, Resources, and other types.
ga: Seo chugainn cur síos gairid ar an rang. Tá an téacs seo le feiceáil i popups Eagarthóir Godot chun Nóid, Acmhainní agus cineálacha eile a chruthú.
it: Segue una breve descrizione della classe. Questo testo appare nei popup dell'editor Godot per la creazione di nodi, risorse e altri tipi.
pl: Następnie krótki opis klasy. Ten tekst pojawia się jako popup w edytorze Godota, przy tworzeniu Węzłów, Zasobów i innych typów.
ru: Далее следует краткое описание класса. Этот текст отображается во всплывающих окнах редактора Godot для создания Узлов (Nodes), Ресурсов (Resources) и других типов.
ta: அடுத்து வகுப்பின் சுருக்கமான விளக்கம். இந்த உரை கோடோட் எடிட்டர் பாப்அப்களில் முனைகள், வளங்கள் மற்றும் பிற வகைகளை உருவாக்குவதற்காக தோன்றும்.
uk: Далі короткий опис класу. Цей текст з’являється у спливаючих вікнах редактора Godot для створення вузлів, ресурсів та інших типів.
zh_tw: 接著會有該類別的簡要說明。這段文字會出現在 Godot 編輯器建立節點、資源等類型時的彈出視窗中。

source: Description
ga: Cur síos
it: Descrizione
pl: Opis
ru: Описание
ta: விவரம்
uk: Опис
zh_tw: 說明

source: Next a more detailed description the class, its features, and its use case(s).
ga: Seo chugainn cur síos níos mionsonraithe ar an rang, a ghnéithe, agus a chás(anna) úsáide.
it: Successivamente una descrizione più dettagliata della classe, delle sue caratteristiche e dei suoi casi d'uso.
pl: Następnie, bardziej szczegółowy opis klasy, jej funkcjonalności i przykładów użycia.
ru: Далее следует более подробное описание класса, его особенностей и варианта(ов) использования.
ta: அடுத்து மேலும் விரிவான விளக்கம் வகுப்பு, அதன் நற்பொருத்தங்கள் மற்றும் அதன் பயன்பாட்டு வழக்கு (கள்).
uk: Далі більш детальний опис класу, його функцій і варіантів використання.
zh_tw: 接下來會有更詳細的類別說明、其功能及用例。

source: Things you may find here:
ga: Rudaí is féidir leat a fháil anseo:
it: Cose che potresti trovare qui:
pl: Rzeczy które możesz tutaj znaleźć:
ru: Что вы можете здесь найти:
ta: நீங்கள் இங்கே காணலாம்:
uk: Речі, які ви можете знайти тут:
zh_tw: 你可以在這裡找到：

source: Specifics of how the class works.
ga: Sonraí faoin gcaoi a n-oibríonn an rang.
it: Dettagli su come funziona la classe.
pl: Szczegółowe informacje na temat działania klasy.
ru: Особенности работы класса.
ta: வகை எவ்வாறு செயல்படுகிறது என்பதற்கான விவரக்குறிப்புகள்.
uk: Специфіка роботи класу.
zh_tw: 類別的運作細節。

source: Code samples of common use cases.
ga: Samplaí cóid de chásanna úsáide coitianta.
it: Esempi di codice di casi d'uso comuni.
pl: Przykładowe wykorzystanie kodu w praktyce.
ru: Примеры кода распространенных вариантов использования.
ta: பொதுவான பயன்பாட்டு நிகழ்வுகளின் குறியீடு மாதிரிகள்.
uk: Зразки коду типових випадків використання.
zh_tw: 常見用法的程式碼範例。

source: Usage details which are shared between each of the class's methods.
ga: Sonraí úsáide a roinntear idir gach ceann de mhodhanna an ranga.
it: Dettagli di utilizzo condivisi tra ciascuno dei metodi della classe.
pl: Konkretne wykorzystanie dostępnych funkcji klasy.
ru: Подробности использования, которые являются общими для всех методов класса.
ta: வகுப்பின் ஒவ்வொரு முறைகளுக்கும் இடையில் பகிரப்பட்ட பயன்பாட்டு விவரங்கள்.
uk: Деталі використання, які є спільними для кожного з методів класу.
zh_tw: 該類別每個方法都適用的使用細節。

source: Warnings about required dependencies or configuration.
ga: Rabhaidh faoi spleáchais nó cumraíocht riachtanach.
it: Avvertimenti riguardo le dipendenze o la configurazione richiesta.
pl: Ostrzeżenia o wymaganych zależnościach lub potrzebnej konfiguracji.
ru: Предупреждения о необходимых зависимостях или конфигурации.
ta: தேவையான சார்புகள் அல்லது உள்ளமைவு பற்றிய எச்சரிக்கைகள்.
uk: Попередження про необхідні залежності або конфігурацію.
zh_tw: 有關必要相依項或組態的警告訊息。

source: Links to other related parts of the Godot API.
ga: Naisc le codanna gaolmhara eile den API Godot.
it: Collegamenti ad altre parti correlate dell'API di Godot.
pl: Linki do innych, powiązanych części API Godota.
ru: Ссылки на другие связанные части API Godot.
ta: கோடோட் ஏபிஐயின் பிற தொடர்புடைய பகுதிகளுக்கான இணைப்புகள்.
uk: Посилання на інші пов’язані частини Godot API.
zh_tw: 與 Godot API 其他相關部分的連結。

source: Tutorials
ga: Ranganna Teagaisc
it: Tutorial
pl: Samouczki
ru: Уроки
ta: பயிற்சிகள்
uk: Посібники
zh_tw: 教學

source: The page then provides links to parts of the manual which mention or make use of the current class.
ga: Ansin soláthraíonn an leathanach naisc chuig codanna den lámhleabhar a luann nó a bhaineann úsáid as an rang reatha.
it: La pagina fornisce poi collegamenti alle parti del manuale che menzionano o utilizzano la classe attuale.
pl: Poniżej strona dostarcza linki do dokumentacji gdzie wspomniano bądź wykorzystano klasę.
ru: Затем на странице приводятся ссылки на части руководства, в которых упоминается или используется текущий класс.
ta: தற்போதைய வகுப்பைக் குறிப்பிட அல்லது பயன்படுத்தும் கையேட்டின் பகுதிகளுக்கான இணைப்புகளை பக்கம் வழங்குகிறது.
uk: Потім на сторінці надаються посилання на частини посібника, в яких згадується або використовується поточний клас.
zh_tw: 頁面會提供手冊中提到或使用此類別的相關連結。

source: Properties
ga: Airíonna
it: Proprietà
pl: Właściwości
ru: Свойства
ta: பண்புகள்
uk: Властивості
zh_tw: 屬性

source: The Properties table lists the variables which belong to each instance of the class, also known as the "properties."
ga: Liostaíonn an tábla Airíonna na hathróga a bhaineann le gach cás den aicme, ar a dtugtar freisin na "airíonna."
it: Nella tabella Proprietà sono elencate le variabili che appartengono a ciascuna istanza della classe, note anche come "proprietà".
pl: Tabela Właściwości przedstawia listę zmiennych, które posiada instancja klasy.
ru: В таблице "Properties (Свойства)" перечислены переменные, принадлежащие каждому экземпляру класса, также известные как "properties."
ta: பண்புகள் அட்டவணை வகுப்பின் ஒவ்வொரு நிகழ்விற்கும் சொந்தமான மாறிகளை பட்டியலிடுகிறது, இது "பண்புகள்" என்றும் அழைக்கப்படுகிறது.
uk: Таблиця властивостей містить перелік змінних, які належать до кожного екземпляра класу, також відомого як «властивості»
zh_tw: 屬性表會列出此類別每個實例所擁有的變數，也就是「屬性」

source: The left column contains the data type of the property. The text is also a link to that data type's Godot API page.
ga: Tá cineál sonraí na maoine sa cholún ar chlé. Is nasc é an téacs freisin chuig leathanach API Godot den chineál sonraí sin.
it: La colonna sinistra contiene il tipo di dato della proprietà. Il testo è anche un collegamento alla pagina dell'API di Godot riguardo quel tipo di dato.
pl: Lewa kolumna przedstawia rodzaj danych właściwości. Tekst ten jest także odnośnikiem do typu danych w API Godota.
ru: В левом столбце указан тип данных свойства. Текст также является ссылкой на страницу API Godot для этого типа данных.
ta: இடது நெடுவரிசையில் சொத்தின் தரவு வகை உள்ளது. உரை அந்த தரவு வகையின் கோடோட் பநிஇ பக்கத்திற்கான இணைப்பாகும்.
uk: Ліва колонка містить тип даних властивості. Текст також є посиланням на сторінку Godot API цього типу даних.
zh_tw: 左欄顯示屬性的資料型別，並同時提供該型別在 Godot API 的連結。

source: The center column contains the name of the property. The text is also a link to that property's full description on the page. Use this name to get the property's data or set a new value to it.
ga: Tá ainm na maoine sa cholún láir. Is nasc é an téacs freisin le cur síos iomlán na maoine sin ar an leathanach. Úsáid an t-ainm seo chun sonraí na maoine a fháil nó chun luach nua a shocrú dó.
it: La colonna centrale contiene il nome della proprietà. Il testo è anche un collegamento alla descrizione completa della proprietà nella pagina. Utilizza questo nome per ottenere i dati della proprietà o impostarne un nuovo valore.
pl: Środkowa kolumna zawiera nazwę zmiennej. Tekst jest także odnośnikiem do pełnego opisu tej właściwości. Używaj tej nazwy, aby uzyskać lub nadać właściwości nową wartość.
ru: В центральном столбце указано название свойства. Этот текст также является ссылкой на полное описание свойства на странице. Используйте это название, чтобы получить данные о свойстве или задать для него новое значение.
ta: மைய நெடுவரிசையில் சொத்தின் பெயர் உள்ளது. உரை அந்த சொத்தின் முழு விளக்கத்திற்கும் ஒரு இணைப்பாகும். சொத்தின் தரவைப் பெற இந்த பெயரைப் பயன்படுத்தவும் அல்லது அதற்கு புதிய மதிப்பை அமைக்கவும்.
uk: Центральна колонка містить назву властивості. Текст також є посиланням на повний опис цієї власності на сторінці. Використовуйте це ім’я, щоб отримати дані властивості або встановити для неї нове значення.
zh_tw: 中間欄位顯示屬性的名稱，也會連結到該屬性的詳細說明。可用該名稱取得屬性值或設定新值。

source: The right column contains the default value of the property. To initialize it with a different value, you must set a different value via script or the Inspector.
ga: Tá luach réamhshocraithe na maoine sa cholún ar dheis. Chun é a thúsú le luach difriúil, ní mór duit luach difriúil a shocrú trí script nó tríd an gCigire.
it: La colonna destra contiene il valore predefinito della proprietà. Per inizializzarla con un valore diverso, è necessario impostarne uno diverso tramite script o tramite l'Ispettore.
pl: Prawa kolumna zawiera domyślną wartość właściwości. Aby zainicjować ją inną wartością, musisz ustawić inną wartość poprzez skrypt, bądź Inspektor.
ru: Правый столбец содержит значение свойства по умолчанию. Чтобы инициализировать его другим значением, необходимо задать другое значение через скрипт или Инспектор.
ta: வலது நெடுவரிசையில் சொத்தின் இயல்புநிலை மதிப்பு உள்ளது. வேறு மதிப்புடன் அதைத் தொடங்க, நீங்கள் ச்கிரிப்ட் அல்லது இன்ச்பெக்டர் வழியாக வேறு மதிப்பை அமைக்க வேண்டும்.
uk: Правий стовпець містить стандартне значення властивості. Щоб ініціалізувати його іншим значенням, ви повинні встановити інше значення за допомогою сценарію або інспектора.
zh_tw: 右欄顯示屬性的預設值。如果要用其他值初始化，必須透過腳本或屬性面板設定新值。

source: Methods
ga: Modhanna
it: Metodi
pl: Metody
ru: Методы
ta: முறைகள்
uk: Методи
zh_tw: 方法

source: The Methods table lists the functions which belong to each instance of the class, also known as the "methods."
ga: Liostaíonn an tábla Modhanna na feidhmeanna a bhaineann le gach cás den aicme, ar a dtugtar freisin na "modhanna."
it: Nella tabella Metodi sono elencate le funzioni che appartengono a ciascuna istanza della classe, note anche come "metodi".
pl: Tabela Metody opisuje funkcje, które należą do każdej instancji klasy, także znane jako "metody."
ru: В таблице "Methods (Методы)" перечислены функции, принадлежащие каждому экземпляру класса, также известные как "methods."
ta: முறைகள் அட்டவணை வகுப்பின் ஒவ்வொரு நிகழ்விற்கும் சொந்தமான செயல்பாடுகளை பட்டியலிடுகிறது, இது "முறைகள்" என்றும் அழைக்கப்படுகிறது.
uk: У таблиці «Методи» перераховано функції, які належать кожному екземпляру класу, також відомі як «методи»
zh_tw: 方法表會列出此類別每個實例所擁有的函式，也就是「方法」

source: The left column contains the data type of the method's return value.
ga: Sa cholún ar chlé tá cineál sonraí luach fillte an mhodha.
it: La colonna sinistra contiene il tipo di dato del valore restituito dal metodo.
pl: Lewa kolumna zawiera zwracany typ wartości metody.
ru: Левый столбец содержит тип данных возвращаемого значения метода.
ta: இடது நெடுவரிசையில் முறையின் வருவாய் மதிப்பின் தரவு வகை உள்ளது.
uk: Ліва колонка містить тип даних значення, яке повертає метод.
zh_tw: 左欄顯示方法的回傳資料型別。

source: The right column contains the name, parameters, and qualifiers of the method. The name is the text before the opening parenthesis. It is also a link to the method's full description on the page. Use this name to call the method.
ga: Tá ainm, paraiméadair agus cáilitheoirí an mhodha sa cholún ceart. Is é an t-ainm an téacs roimh an lúibín oscailte. Is nasc é freisin le cur síos iomlán an mhodha ar an leathanach. Úsáid an t-ainm seo chun an modh a ghlaoch.
it: La colonna destra contiene il nome, i parametri e i qualificatori del metodo. Il nome è il testo prima della parentesi aperta. È anche un collegamento alla descrizione completa del metodo nella pagina. Utilizza questo nome per richiamare il metodo.
pl: Prawa kolumna zawiera, nazwę, parametry i modyfikatory metody. Nazwa jest tekstem przed nawiasem otwierającym. Jest ona także odnośnikiem do strony z pełnym opisem metody. Używaj tej nazwy aby wywołać metodę.
ru: Правый столбец содержит имя, параметры и квалификаторы метода. Имя — это текст перед открывающейся скобкой. Оно также является ссылкой на полное описание метода на странице. Используйте это имя для вызова метода.
ta: வலது நெடுவரிசையில் முறையின் பெயர், அளவுருக்கள் மற்றும் தகுதிகள் உள்ளன. திறக்கும் அடைப்புக்குறிக்கு முந்தைய உரை பெயர். இது பக்கத்தில் உள்ள முறையின் முழு விளக்கத்திற்கும் ஒரு இணைப்பாகும். முறையை அழைக்க இந்த பெயரைப் பயன்படுத்தவும்.
uk: Правий стовпець містить назву, параметри та кваліфікатори методу. Ім'я - це текст перед відкриваючою дужкою. Це також посилання на повний опис методу на сторінці. Використовуйте це ім'я для виклику методу.
zh_tw: 右欄顯示方法名稱（括號前的文字）、參數及限定符，並連結到方法的詳細說明。可用此名稱呼叫該方法。

source: For each parameter, the page details its data type, name, and default value, if any.
ga: I gcás gach paraiméadar, sonraíonn an leathanach a chineál sonraí, a ainm, agus a luach réamhshocraithe, más ann dó.
it: Per ogni parametro, la pagina ne specifica il tipo di dato, il nome, e il valore predefinito se presente.
pl: Dla każdego parametru, strona przedstawia jego typ danych, nazwę i wartość domyślną, jeśli jakąś posiada.
ru: Для каждого параметра на странице указаны тип данных, имя и значение по умолчанию, если таковое имеется.
ta: ஒவ்வொரு அளவுருவுக்கும், பக்கம் அதன் தரவு வகை, பெயர் மற்றும் இயல்புநிலை மதிப்பை ஏதேனும் இருந்தால் விவரிக்கிறது.
uk: Для кожного параметра на сторінці детально описано тип даних, назву та значення за замовчуванням, якщо таке є.
zh_tw: 每個參數都會說明其資料型別、名稱及預設值（如果有的話）。

source: Possible qualifiers include...
ga: I measc na gcáilitheoirí féideartha tá...
it: I possibili qualificatori includono...
pl: Możliwe modyfikatory obejmują...
ru: Возможные квалификаторы включают в себя...
ta: சாத்தியமான தகுதிகள் அடங்கும் ...
uk: Серед можливих кваліфікаторів...
zh_tw: 可能的限定符包括...

source: ``const``: the method does not change any data in the class instance.
ga: ''const'': ní athraíonn an modh aon sonraí sa chás ranga.
it: ``const``: il metodo non cambia alcun dato nell'istanza della classe.
pl: ``const``: metoda nie zmienia żadnych danych w instancji klasy.
ru: ``const``: метод не изменяет никаких данных в экземпляре класса.
ta: `` const``: முறை வகுப்பு நிகழ்வில் எந்த தரவையும் மாற்றாது.
uk: ``const``: метод не змінює жодних даних в екземплярі класу.
zh_tw: ``const``：此方法不會修改類別實例的任何資料。

source: ``virtual``: the method does nothing but wait for a script to override it.
ga: ''fíorúil'': ní dhéanann an modh tada ach fanacht go sáróidh script é.
it: ``virtual``: il metodo non fa altro che attendere che uno script lo sovrascriva.
pl: ``virtual``: metoda nic nie robi, ale oczekuje na skrypt który ją nadpisze.
ru: ``virtual``: метод не делает ничего, кроме ожидания, пока скрипт его переопределит.
ta: `` மெய்நிகர்``: ஒரு ச்கிரிப்ட் அதை மேலெழுத காத்திருக்கத் தவிர வேறு எதுவும் இல்லை.
uk: ``virtual``: метод нічого не робить, окрім очікування сценарію, щоб перевизначити його.
zh_tw: ``virtual``：此方法本身不執行任何操作，只等待腳本覆寫。

source: ``vararg``: the method can accept an arbitrary number of arguments.
ga: ''vararg'': is féidir leis an modh glacadh le líon treallach argóintí.
it: ``vararg``: Il metodo può accettare un numero arbitrario di argomenti.
pl: ``vararg``: metoda może akceptować dowolną liczbę argumentów.
ru: ``vararg``: метод может принимать произвольное количество аргументов.
ta: `` வரர்க்``: முறை தன்னிச்சையான எண்ணிக்கையிலான வாதங்களை ஏற்க முடியும்.
uk: ``vararg``: метод може приймати довільну кількість аргументів.
zh_tw: ``vararg``：此方法可以接收任意數量的參數。

source: Signals
ga: Comharthaí
it: Segnali
pl: Sygnały
ru: Сигналы
ta: சமிக்ஞைகள்
uk: Сигнали
zh_tw: 訊號

source: The Signals list details the names and parameters of events which "signal" a change in game state to other class instances.
ga: Sonraíonn an liosta Comharthaí ainmneacha agus paraiméadair na n-imeachtaí a "comhartha" athrú ar staid an chluiche go cásanna ranga eile.
it: L'elenco dei Segnali riporta i nomi e i parametri degli eventi che "segnalano" un cambiamento nello stato del gioco ad altre istanze di classe.
ru: В списке "Signals (Сигналы)" приводятся названия и параметры событий, которые "сигнализируют" об изменении состояния игры другим экземплярам класса.
ta: சிக்னல்கள் பட்டியல் நிகழ்வுகளின் பெயர்கள் மற்றும் அளவுருக்களை விவரிக்கிறது, இது மற்ற வகுப்பு நிகழ்வுகளுக்கு விளையாட்டு நிலையில் மாற்றத்தை "சமிக்ஞை" செய்கிறது.
uk: Список Сигналів детально описує назви та параметри подій, які «сигналізують» про зміну стану гри іншим примірникам класу.
zh_tw: 訊號列表會詳細說明這些事件的名稱和參數，這些事件會「發出訊號」通知其他類別實例遊戲狀態的變化。

source: Like the Methods table, any parameters will include their data type and name.
ga: Cosúil leis an tábla Modhanna, beidh aon paraiméadair san áireamh a gcineál sonraí agus ainm.
it: Come la tabella Metodi, tutti i parametri includeranno il tipo di dato e il nome.
ru: Как и в таблице "Methods", все параметры будут включать тип данных и имя.
ta: முறைகள் அட்டவணையைப் போலவே, எந்த அளவுருக்களிலும் அவற்றின் தரவு வகை மற்றும் பெயர் ஆகியவை அடங்கும்.
uk: Подібно до таблиці «Методи», будь-які параметри включатимуть тип даних і назву.
zh_tw: 與方法表一樣，每個參數都會包含其資料型別與名稱。

source: Each signal also has a detailed explanation of when the signal is emitted.
ga: Tá míniú mionsonraithe ag gach comhartha freisin ar cathain a astaítear an comhartha.
it: Inoltre, ogni segnale include una spiegazione dettagliata di quando viene emesso.
ru: Каждый сигнал также сопровождается подробным объяснением момента его подачи.
ta: ஒவ்வொரு சமிக்ஞையும் சமிக்ஞை எப்போது வெளியேற்றப்படும் என்பதற்கான விரிவான விளக்கமும் உள்ளது.
uk: Кожен сигнал також має детальне пояснення того, коли сигнал випромінюється.
zh_tw: 每個訊號也都會詳細說明其觸發時機。

source: Enumerations
ga: Áirimh
it: Enumerazioni
ru: Enumerations (Перечисления)
ta: கணக்கீடுகள்
uk: Перерахування
zh_tw: 列舉
