Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/logging.po
Languages: it, ru, ta, uk, zh_hans, zh_hant

source: Note that to avoid infinite recursion, you cannot effectively use :ref:`print() <class_@GlobalScope_method_print>` and its related methods in ``_log_message()``. You also can't effectively use :ref:`push_error() <class_@GlobalScope_method_push_error>` or :ref:`push_warning() <class_@GlobalScope_method_push_warning>` in ``_log_error()``. Attempting to do so will print a message to the same stream as the original message. This message is not available in the custom logger, which is what prevents infinite recursion from occurring:
it: Si noti che per evitare una ricorsione infinita, non è possibile effettivamente utilizzare :ref:`print() <class_@GlobalScope_method_print>` e i metodi correlati in ``_log_message()``. Non è inoltre possibile utilizzare effettivamente :ref:`push_error() <class_@GlobalScope_method_push_error>` o :ref:`push_warning() <class_@GlobalScope_method_push_warning>` in ``_log_error()``. Tentando di farlo, verrà stampato un messaggio sullo stesso flusso del messaggio originale. Questo messaggio non è disponibile nel logger personalizzato, il che impedisce una ricorsione infinita:
ru: Обратите внимание, что для предотвращения бесконечной рекурсии невозможно эффективно использовать :ref:`print() <class_@GlobalScope_method_print>` и связанные с ним методы в ``_log_message()``. Также невозможно эффективно использовать :ref:`push_error() <class_@GlobalScope_method_push_error>` или :ref:`push_warning() <class_@GlobalScope_method_push_warning>` в ``_log_error()``. Попытка сделать это приведёт к выводу сообщения в тот же поток, что и исходное сообщение. Это сообщение недоступно в пользовательском логгере, что и предотвращает возникновение бесконечной рекурсии:
ta: எல்லையற்ற மறுநிகழ்வைத் தவிர்ப்பதற்கு, நீங்கள் திறம்பட பயன்படுத்த முடியாது என்பதை நினைவில் கொள்க: ref: `அச்சு () <class_@globalscope_method_print>` மற்றும் `_log_message ()` `இல் அதனுடன் தொடர்புடைய முறைகள். நீங்கள் திறம்பட பயன்படுத்த முடியாது: ref: `push_error () <class_@globalscope_method_push_error>` or: ref: `` `_log_error ()` `இல்` `` `_log_error ()` இல் `` `` `_log_error ()` இல் `` `` `_log_error ()` இல் `` `` in இல் `` `` `` `` `` `` இல் `` `` இல் `globalscope ()@globalscope () அவ்வாறு செய்ய முயற்சிப்பது அசல் செய்தியின் அதே ச்ட்ரீமுக்கு ஒரு செய்தியை அச்சிடும். இந்த செய்தி தனிப்பயன் லாகரில் கிடைக்கவில்லை, இது எல்லையற்ற மறுநிகழ்வு ஏற்படுவதைத் தடுக்கிறது:
uk: Зверніть увагу, що для уникнення нескінченної рекурсії ви не можете ефективно використовувати :ref:`print() <class_@GlobalScope_method_print>` та пов'язані з ним методи в ``_log_message()``. Ви також не можете ефективно використовувати :ref:`push_error() <class_@GlobalScope_method_push_error>` або :ref:`push_warning() <class_@GlobalScope_method_push_warning>` в ``_log_error()``. Спроба зробити це призведе до виведення повідомлення в той самий потік, що й оригінальне повідомлення. Це повідомлення недоступне в користувацькому логері, що запобігає виникненню нескінченної рекурсії:
zh_hans: 请注意，为避免无限递归，在 ``_log_message()`` 中不能有效使用 :ref:`print() <class_@GlobalScope_method_print>` 及其相关方法；同样，在 ``_log_error()`` 中也不能有效使用 :ref:`push_error() <class_@GlobalScope_method_push_error>` 或 :ref:`push_warning() <class_@GlobalScope_method_push_warning>`。若尝试这样做，消息将被输出到与原始消息相同的流中，而该消息对自定义日志记录器不可见，这正是防止无限递归发生的原因：
zh_hant: 請注意，為了避免無限遞迴，你無法在 ``_log_message()`` 中有效地使用 :ref:`print() <class_@GlobalScope_method_print>` 及其相關方法；同樣地，你也無法在 ``_log_error()`` 中有效地使用 :ref:`push_error() <class_@GlobalScope_method_push_error>` 或 :ref:`push_warning() <class_@GlobalScope_method_push_warning>`。嘗試這麼做時，會將訊息列印到與原始訊息相同的串流。此訊息不會出現在自訂記錄器中，如此即可避免發生無限遞迴：

source: You can find an example of an in-game console built with a custom logger in the `Custom Logging demo project <https://github.com/godotengine/godot-demo-projects/tree/master/misc/custom_logging>`__.
it: È possibile trovare un esempio di una console di gioco creata con un logger personalizzato nel `Progetto demo Custom Logging <https://github.com/godotengine/godot-demo-projects/tree/master/misc/custom_logging>`__.
ru: Пример игровой консоли, созданной с помощью пользовательского регистратора, можно найти в `демонстрационном проекте Custom Logging <https://github.com/godotengine/godot-demo-projects/tree/master/misc/custom_logging>`__.
ta: `தனிப்பயன் பதிவு டெமோ திட்டம் <https://github.com/godotengine/godotengine/godotengine ஐத் பயன்படுத்துவதில் தனிப்பயன் லாகருடன் கட்டப்பட்ட ஒரு விளையாட்டு கன்சோலின் உதாரணத்தை நீங்கள் காணலாம்.
uk: Ви можете знайти приклад ігрової консолі, зібраної з використанням власного логера, у `Custom Logging demo project <https://github.com/godotengine/godot-demo-projects/tree/master/misc/custom_logging>`__.
zh_hant: 你可以在 `自訂記錄範例專案 <https://github.com/godotengine/godot-demo-projects/tree/master/misc/custom_logging>`__ 中找到一個以自訂記錄器製作的遊戲內主控台範例。
