Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/logging.po
Languages: it, ru, ta, uk, zh_hans, zh_hant

source: For some use cases like dedicated servers, it can be preferred to have release builds always flush stdout on print, so that logging services like journald can collect logs while the process is running. This can be done by enabling ``application/run/flush_stdout_on_print`` in the Project Settings.
it: Per alcuni casi d'uso, come i server dedicati, può essere preferibile che le build di rilascio svuotino sempre lo stdout durante la stampa, così che i servizi di logging come journald possano raccogliere i log mentre il processo è in esecuzione. Ciò si può ottenere abilitando ``application/run/flush_stdout_on_print`` nelle Impostazioni del progetto.
ru: Для некоторых случаев использования, например, для выделенных серверов, может быть предпочтительнее, чтобы сборки релиза всегда очищали stdout при печати, чтобы службы журналирования, такие как journald, могли собирать журналы во время выполнения процесса. Это можно сделать, включив ``application/run/flush_stdout_on_print`` в Project Settings.
ta: பிரத்யேக சேவையகங்கள் போன்ற சில பயன்பாட்டு நிகழ்வுகளுக்கு, வெளியீட்டைக் கட்டியெழுப்ப விரும்பலாம். திட்ட அமைப்புகளில் `` பயன்பாடு/ரன்/flush_stdout_print`` ஐ இயக்குவதன் மூலம் இதைச் செய்யலாம்.
uk: Для деяких випадків використання, таких як виділені сервери, може бути бажано, щоб релізні збірки завжди скидали stdout під час друку, щоб служби логування, такі як journald, могли збирати журнали під час виконання процесу. Це можна зробити, увімкнувши ``application/run/flush_stdout_on_print`` у налаштуваннях проекту.
zh_hant: 在某些情境（如專用伺服器）下，可能希望發行建置在列印時也總是沖洗標準輸出，讓 journald 等日誌服務能在行程執行期間收集日誌。你可以在專案設定中啟用 ``application/run/flush_stdout_on_print`` 來達成。

source: Script backtraces
it: Backtrace di script
ru: Обратная трассировка скрипта
ta: ச்கிரிப்ட் பின்னடைவுகள்
uk: Зворотні трасування скриптів
zh_hant: 腳本回溯

source: Since Godot 4.5, when GDScript code encounters an error, it will log a backtrace that points to the origin of the error, while also containing the call stack leading to it. This behavior is always enabled when running in the editor, or when the project is exported in debug mode.
it: A partire da Godot 4.5, quando il codice GDScript incontra un errore, registra un backtrace che punta all'origine dell'errore, contenendo anche il stack di chiamate che lo ha generato. Questo comportamento è sempre abilitato durante l'esecuzione nell'editor o quando il progetto è esportato in modalità debug.
ru: Начиная с Godot 4.5, при возникновении ошибки в коде GDScript регистрируется обратная трассировка, указывающая на источник ошибки, а также содержащая стек вызовов, приведших к ней. Это поведение всегда включено при запуске в редакторе или при экспорте проекта в режиме отладки.
ta: கோடோட் 4.5 முதல், சி.டி.எச்ச்கிரிப்ட் குறியீடு ஒரு பிழையை எதிர்கொள்ளும்போது, அது பிழையின் தோற்றத்தை சுட்டிக்காட்டும் ஒரு பின்னணியை பதிவு செய்யும், அதே நேரத்தில் அதற்கு வழிவகுக்கும் அழைப்பு அடுக்கையும் உள்ளது. எடிட்டரில் இயங்கும் போது அல்லது திட்டம் பிழைத்திருத்த பயன்முறையில் ஏற்றுமதி செய்யப்படும்போது இந்த நடத்தை எப்போதும் இயக்கப்படும்.
uk: Починаючи з Godot 4.5, коли код GDScript зустрічає помилку, він реєструє зворотний трасування, яке вказує на джерело помилки, а також містить стек викликів, що призвели до неї. Ця функція завжди ввімкнена під час роботи в редакторі або коли проект експортується в режимі налагодження.
zh_hans: 自 Godot 4.5 起，当 GDScript 代码遇到错误时，会记录一个指向错误源头的回溯信息（backtrace），并包含导致该错误的调用栈。此功能在编辑器内运行或项目以调试模式导出时始终启用。
zh_hant: 自 Godot 4.5 起，當 GDScript 程式碼遇到錯誤時，會記錄一份回溯，指出錯誤的來源，並包含導致該錯誤的呼叫堆疊。此行為在編輯器中執行或以除錯模式匯出專案時一律啟用。

source: In projects exported in release mode, backtraces are disabled by default for performance reasons. You can enable them by checking **Debug > Settings > GDScript > Always Track Call Stacks** in the Project Settings. If you use a custom logging system that reports exceptions to a remote service, it's recommended to enable this to make reported errors more actionable.
it: Nei progetti esportati in modalità rilascio, i backtrace sono normalmente disabilitati per motivi di prestazioni. È possibile abilitarli selezionando **Debug > Impostazioni > GDScript > Traccia sempre stack di chiamate** nelle Impostazioni del progetto. Se si utilizza un sistema di log personalizzato che segnala le eccezioni a un servizio remoto, si consiglia di abilitarlo per rendere più fruibili gli errori segnalati.
ru: В проектах, экспортированных в режиме релиза, обратные трассировки по умолчанию отключены из соображений производительности. Вы можете включить их, установив флажок **Отладка > Настройки > GDScript > Всегда отслеживать стеки вызовов** в настройках проекта. Если вы используете собственную систему журналирования, которая сообщает об исключениях удалённой службе, рекомендуется включить её, чтобы сделать сообщаемые об ошибках более оперативными.
ta: வெளியீட்டு பயன்முறையில் ஏற்றுமதி செய்யப்பட்ட திட்டங்களில், செயல்திறன் காரணங்களுக்காக இயல்புநிலையாக பின்னடைவுகள் முடக்கப்படுகின்றன. திட்ட அமைப்புகளில் ** பிழைத்திருத்தம்> அமைப்புகள்> gdscript> எப்போதும் அழைப்பு அடுக்குகளை ** ஐக் கண்காணிப்பதன் மூலம் அவற்றை இயக்கலாம். தொலைதூர சேவைக்கு விதிவிலக்குகளைப் புகாரளிக்கும் தனிப்பயன் பதிவு முறையைப் பயன்படுத்தினால், அறிவிக்கப்பட்ட பிழைகளை மேலும் செயல்படச் செய்ய இதை இயக்க பரிந்துரைக்கப்படுகிறது.
uk: У проектах, експортованих у режимі випуску, відстеження зворотного проходження за замовчуванням вимкнено з міркувань продуктивності. Ви можете увімкнути його, встановивши прапорець **Debug > Settings > GDScript > Always Track Call Stacks** (Налагодження > Налаштування > GDScript > Завжди відстежувати стеки викликів) у налаштуваннях проекту. Якщо ви використовуєте власну систему журналювання, яка повідомляє про винятки віддаленому сервісу, рекомендується увімкнути цю опцію, щоб повідомлення про помилки були більш корисними.
zh_hans: 在以发布模式导出的项目中，出于性能考虑，默认禁用回溯功能。您可以通过在项目设置中勾选 **调试 > 设置 > GDScript > 始终跟踪调用栈（Debug > Settings > GDScript > Always Track Call Stacks）** 来启用该功能。如果您使用自定义日志系统将异常上报至远程服务，建议启用此选项，以便让上报的错误信息更具可操作性。
zh_hant: 在以發行模式匯出的專案中，為了效能，預設會停用回溯。你可以在專案設定中勾選 **Debug > Settings > GDScript > Always Track Call Stacks** 來啟用它。若你使用自訂的日誌系統將例外回報到遠端服務，建議啟用此選項以提升錯誤的可處理性。

source: Crash backtraces
it: Backtrace dei crash
ru: Следы сбоев
ta: பின்னடைவுகளை செயலிழக்கச் செய்யுங்கள்
uk: Зворотні трасування аварій
zh_hans: 崩溃回溯
zh_hant: 崩潰回溯

source: Crash backtraces are only useful if they were recorded in a build that contains :ref:`debugging symbols <doc_introduction_to_the_buildsystem_debugging_symbols>`. Official Godot binaries do not contain debugging symbols, so you must compile a custom editor or export template binary to get useful crash backtraces.
it: I backtrace dei crash sono utili solo se registrati in una build che contiene :ref:`simboli di debug <doc_introduction_to_the_buildsystem_debugging_symbols>`. I binari ufficiali di Godot non contengono simboli di debug, quindi è necessario compilare un binario personalizzato dell'editor o di un modello d'esportazione per ottenere utili backtrace dei crash.
ru: Трассировки сбоев полезны только в том случае, если они были записаны в сборке, содержащей :ref:`отладочные символы <doc_introduction_to_the_buildsystem_debugging_symbols>`. Официальные двоичные файлы Godot не содержат отладочных символов, поэтому для получения полезных трассировок сбоев необходимо скомпилировать пользовательский редактор или экспортировать двоичный файл шаблона.
ta: செயலிழப்பு பின்னடைவுகள் ஒரு கட்டமைப்பில் பதிவு செய்யப்பட்டிருந்தால் மட்டுமே பயனுள்ளதாக இருக்கும்: குறிப்பு: `பிழைத்திருத்த சின்னங்கள் <doc_introduction_to_the_buildsystem_debugging_symbols>`. அதிகாரப்பூர்வ கோடோட் பைனரிகளில் பிழைத்திருத்த சின்னங்கள் இல்லை, எனவே நீங்கள் ஒரு தனிப்பயன் எடிட்டரை தொகுக்க வேண்டும் அல்லது பயனுள்ள செயலிழப்பு பின்னடைவைப் பெற வார்ப்புரு பைனரியை ஏற்றுமதி செய்ய வேண்டும்.
uk: Відстеження аварійних ситуацій корисні лише в тому випадку, якщо вони були записані в збірці, що містить :ref:`debugging symbols <doc_introduction_to_the_buildsystem_debugging_symbols>`. Офіційні бінарні файли Godot не містять символів налагодження, тому для отримання корисних відстежень аварійних ситуацій необхідно скомпілювати власний редактор або експортний шаблон бінарного файлу.
zh_hans: 崩溃回溯仅在包含 :ref:`debugging symbols <doc_introduction_to_the_buildsystem_debugging_symbols>` 的构建版本中才有实际意义。官方发布的 Godot 二进制文件不包含调试符号，因此您必须自行编译自定义的编辑器或导出模板二进制文件，才能获得有用的崩溃回溯信息。
zh_hant: 崩潰回溯只有在以包含 :ref:`除錯符號 <doc_introduction_to_the_buildsystem_debugging_symbols>` 的建置記錄時才有用。官方 Godot 二進位不含除錯符號，因此你必須自行編譯自訂的編輯器或匯出樣板二進位，才能取得有用的崩潰回溯。

source: When the project crashes, a crash backtrace is printed to the standard error stream. This is what it can look like in a build with debug symbols:
it: Quando il progetto si blocca, viene visualizzato un backtrace del crash nel flusso di errore standard. Ecco come potrebbe apparire in una build con simboli di debug:
ru: При сбое проекта в стандартный поток ошибок выводится трассировка сбоя. Вот как это может выглядеть при сборке с отладочными символами:
ta: திட்டம் செயலிழக்கும்போது, ஒரு செயலிழப்பு பின்வாங்கல் நிலையான பிழை ச்ட்ரீமில் அச்சிடப்படுகிறது. பிழைத்திருத்த சின்னங்களுடன் ஒரு கட்டமைப்பில் இது எப்படி இருக்கும்:
uk: Коли проєкт аварійно завершує роботу, у стандартний потік помилок виводиться трасування аварійного завершення. Ось як це може виглядати у збірці з символами налагодження:
zh_hans: 当项目崩溃时，崩溃回溯信息会被打印到标准错误流。在包含调试符号的构建版本中，其输出可能如下所示：
zh_hant: 當專案崩潰時，崩潰回溯會列印到標準錯誤串流。以下是在包含除錯符號的建置中可能的樣子：

source: On the other hand, without debug symbols, it will look like this instead:
it: D'altro canto, senza simboli di debug, apparirà simile a questo:
ru: С другой стороны, без отладочных символов это будет выглядеть так:
ta: மறுபுறம், பிழைத்திருத்த சின்னங்கள் இல்லாமல், அதற்கு பதிலாக இது போல் இருக்கும்:
uk: З іншого боку, без символів налагодження це виглядатиме так:
zh_hans: 另一方面，如果没有调试符号，输出将如下所示：
zh_hant: 相對地，若沒有除錯符號，則會長得像這樣：

source: This backtrace is also logged to the file for the current session, but it is **not** visible in the editor Output panel. Since the engine's scripting system is not running anymore when the engine is crashing, it is not possible to access it from scripting in the same session. However, you can still read the crash backtrace on the next session by loading log files and searching for the crash backtrace string (``Program crashed with signal``) using :ref:`class_FileAccess`. This allows you to access the backtrace information even after a crash, as long as the user restarts the project and file logging is enabled:
it: Questo backtrace viene registrato anche nel file per la sessione attuale, ma **non** è visibile nel pannello Output nell'editor. Poiché il sistema di scripting del motore non è più in esecuzione quando il motore si blocca, non è possibile accedervi tramite scripting nella stessa sessione. Tuttavia, è comunque possibile leggere il backtrace del crash nella sessione successiva, caricando i file di log e cercando la stringa del backtrace del crash (``Program crashed with signal``) tramite :ref:`class_FileAccess`. Questo consente di accedere alle informazioni del backtrace anche dopo un crash, purché l'utente riavvii il progetto e il logging su file sia abilitata:
ru: Эта трассировка также регистрируется в файле текущего сеанса, но **не** отображается на панели вывода редактора. Поскольку система скриптов движка не работает во время сбоя, доступ к ней из скриптов в том же сеансе невозможен. Тем не менее, вы можете прочитать трассировку сбоя в следующем сеансе, загрузив файлы журналов и выполнив поиск строки трассировки сбоя (``Program crashed with signal``) с помощью :ref:`class_FileAccess`. Это позволяет получить доступ к информации трассировки даже после сбоя, если пользователь перезапустит проект и включено ведение журнала файла:
ta: இந்த பின்னணி தற்போதைய அமர்வுக்கான கோப்பில் உள்நுழைந்துள்ளது, ஆனால் இது எடிட்டர் வெளியீட்டு குழுவில் ** இல்லை ** தெரியவில்லை. இயந்திரம் செயலிழக்கும்போது இயந்திரத்தின் ச்கிரிப்டிங் அமைப்பு இனி இயங்காது என்பதால், அதே அமர்வில் ச்கிரிப்டிங்கிலிருந்து அதை அணுக முடியாது. இருப்பினும், பதிவு கோப்புகளை ஏற்றுவதன் மூலமும், செயலிழப்பு பின்னடைவு சரம் (`` நிரல் சிக்னல் ``) ஐப் பயன்படுத்துவதன் மூலமும் அடுத்த அமர்வில் செயலிழப்பு பின்னணியை நீங்கள் இன்னும் படிக்கலாம்: ref: `class_fileaccess`. விபத்துக்குப் பிறகும், பயனர் திட்டத்தை மறுதொடக்கம் செய்து கோப்பு பதிவு இயக்கப்பட்டிருக்கும் வரை, விபத்துக்குப் பிறகும் பின்னடைவு தகவலை அணுக இது உங்களை அனுமதிக்கிறது:
uk: Цей трасування також записується у файл поточної сесії, але **не** відображається у панелі виводу редактора. Оскільки система скриптів движка більше не працює під час збою движка, неможливо отримати до неї доступ із скриптів у тій самій сесії. Однак ви все одно можете прочитати трасування збою в наступній сесії, завантаживши файли журналу та знайшовши рядок трасування збою (``Program crashed with signal``) за допомогою :ref:`class_FileAccess`. Це дозволяє отримати доступ до інформації про трасування навіть після збою, якщо користувач перезапустить проект і ввімкне журнал файлів:
zh_hans: 此回溯信息也会被记录到当前会话的日志文件中，但 **not** 显示在编辑器的输出面板中。由于引擎崩溃时脚本系统已停止运行，因此无法在同一次会话中通过脚本访问该信息。不过，您仍可在下一次会话中通过加载日志文件，并使用 :ref:`class_FileAccess` 搜索崩溃回溯字符串（``Program crashed with signal``）来读取崩溃回溯内容。只要用户重新启动项目且已启用文件日志记录，即可在崩溃后获取回溯信息：
zh_hant: 這份回溯也會記錄到目前工作階段的日誌檔中, 但它在編輯器的 Output 面板中是看 **不** 到的。由於引擎在崩潰時, 其腳本系統已不再執行, 因此無法在同一工作階段中以腳本方式存取。不過, 你仍可在下一次啟動時讀取日誌檔, 並使用 :ref:`class_FileAccess` 搜尋崩潰回溯字串 (``Program crashed with signal``) 以取得回溯資訊, 只要使用者重新啟動專案且已啟用檔案日誌即可:

source: You can customize the message that appears at the top of the backtrace using the **Debug > Settings > Crash Handler > Message** project setting. This can be used to point to a URL or email address that users can report issues to.
it: È possibile personalizzare il messaggio mostrato in cima al backtrace attraverso l'impostazione di progetto **Debug > Impostazioni > Gestore arresti anomali > Messaggio**. Questa impostazione può servire per indirizzare gli utenti a un URL o a un indirizzo email a cui segnalare eventuali problemi.
ru: Вы можете настроить сообщение, отображаемое в верхней части трассировки, с помощью параметра проекта **Отладка > Настройки > Обработчик сбоев > Сообщение**. Его можно использовать для указания URL-адреса или адреса электронной почты, по которому пользователи могут сообщать о проблемах.
ta: ** பிழைத்திருத்தம்> அமைப்புகள்> செயலிழப்பு கையாளுபவர்> செய்தி ** திட்ட அமைப்பைப் பயன்படுத்தி பின்னணியின் மேற்புறத்தில் தோன்றும் செய்தியைத் தனிப்பயனாக்கலாம். பயனர்கள் சிக்கல்களைப் புகாரளிக்கக்கூடிய முகவரி அல்லது மின்னஞ்சல் முகவரியை சுட்டிக்காட்ட இது பயன்படுத்தப்படலாம்.
uk: Ви можете налаштувати повідомлення, яке з'являється у верхній частині трасування, за допомогою налаштування проекту **Debug > Settings > Crash Handler > Message**. Це можна використовувати для вказання URL-адреси або адреси електронної пошти, на яку користувачі можуть надсилати повідомлення про проблеми.
zh_hans: 您可以通过 **调试 > 设置 > 崩溃处理器 > 消息（Debug > Settings > Crash Handler > Message）** 项目设置，自定义回溯信息顶部显示的消息内容。此功能可用于引导用户访问指定的网址或邮箱地址，以便提交问题反馈。
zh_hant: 你可以透過專案設定 **Debug > Settings > Crash Handler > Message** 自訂回溯頂端顯示的訊息。這可用來提供回報問題的 URL 或電子郵件地址。

source: Creating custom loggers
it: Creare logger personalizzati
ru: Создание пользовательских регистраторов
ta: தனிப்பயன் லாகர்களை உருவாக்குதல்
uk: Створення користувацьких логгерів
zh_hant: 建立自訂記錄器

source: Since Godot 4.5, it is possible to create custom loggers. This custom logging can be used for many purposes:
it: A partire da Godot 4.5, è possibile creare logger personalizzati. Un logging personalizzato può servire a diversi scopi:
ru: Начиная с версии Godot 4.5, появилась возможность создавать собственные логгеры. Эти пользовательские логгеры можно использовать для различных целей:
ta: கோடோட் 4.5 என்பதால், தனிப்பயன் லாகர்களை உருவாக்க முடியும். இந்த தனிப்பயன் பதிவு பல நோக்கங்களுக்காக பயன்படுத்தப்படலாம்:
uk: Починаючи з Godot 4.5, можна створювати власні логери. Ці власні логери можна використовувати для багатьох цілей:
zh_hans: 自 Godot 4.5 起，可以创建自定义日志记录器。自定义日志功能可用于多种用途：
zh_hant: 自 Godot 4.5 起，可以建立自訂記錄器。這類自訂記錄可用於多種目的：

source: Show an in-game console with the same messages as printed by the engine, without requiring other scripts to be modified.
it: Mostrare una console di gioco con gli stessi messaggi stampati dal motore, senza richiedere la modifica di altri script.
ru: Показывать игровую консоль с теми же сообщениями, которые выводит движок, без необходимости изменения других скриптов.
ta: மற்ற ச்கிரிப்ட்களை மாற்றியமைக்க தேவையில்லாமல், இயந்திரத்தால் அச்சிடப்பட்ட அதே செய்திகளுடன் ஒரு விளையாட்டு கன்சோலைக் காட்டுங்கள்.
uk: Відображати ігрову консоль з тими ж повідомленнями, що й рушій, без необхідності модифікації інших скриптів.
zh_hans: 在游戏内显示一个控制台，展示与引擎输出相同的消息，而无需修改其他脚本。
zh_hant: 顯示遊戲內主控台，與引擎所列印的訊息保持一致，而無需修改其他腳本。

source: Report printed errors from the player's machine to a remote server. This can make it easier for developers to fix bugs when the game is already released, or during playtesting.
it: Segnalare gli errori stampati dal computer del giocatore a un server remoto. Questo può rendere più facile correggere bug per gli sviluppatori quando il gioco è già stato rilasciato o durante i playtest.
ru: Передавайте сообщения об ошибках печати с компьютера игрока на удалённый сервер. Это может облегчить разработчикам исправление ошибок после выхода игры или во время её тестирования.
ta: பிளேயரின் கணினியிலிருந்து அச்சிடப்பட்ட பிழைகளை தொலை சேவையகத்திற்கு புகாரளிக்கவும். விளையாட்டு ஏற்கனவே வெளியிடப்பட்டபோது அல்லது பிளேச்டெச்டிங்கின் போது உருவாக்குபவர்கள் பிழைகளை சரிசெய்வதை இது எளிதாக்கும்.
uk: Повідомляйте про помилки друку з машини гравця на віддалений сервер. Це може полегшити розробникам виправлення помилок, коли гра вже випущена, або під час ігрового тестування.
zh_hans: 将玩家设备上打印的错误信息上报至远程服务器。这有助于开发者在游戏已发布或进行试玩测试时更便捷地修复错误。
zh_hant: 將玩家機器上列印出的錯誤回報到遠端伺服器，讓開發者在遊戲已發行或測試期間更容易修復問題。

source: Integrate a dedicated server export with monitoring platforms.
it: Integrare un'esportazione di server dedicato con piattaforme di monitoraggio.
ru: Интегрируйте выделенный серверный экспорт с платформами мониторинга.
ta: கண்காணிப்பு தளங்களுடன் பிரத்யேக சேவையக ஏற்றுமதியை ஒருங்கிணைக்கவும்.
uk: Інтегруйте експорт виділеного сервера з платформами моніторингу.
zh_hans: 将专用服务器导出版本与监控平台集成。
zh_hant: 將專用伺服器的匯出版本與監控平台整合。

source: A custom logger can be registered by creating a class that inherits from :ref:`class_logger`, then passing an instance of this class to :ref:`OS.add_logger <class_OS_method_add_logger>`, in a script's :ref:`_init() <class_Object_private_method__init>` method. A good place to do this is an :ref:`autoload <doc_singletons_autoload>`.
it: È possibile registrare un logger personalizzato creando una classe che eredita da :ref:`class_logger`, poi passando un'istanza di questa classe a :ref:`OS.add_logger <class_OS_method_add_logger>`, nel metodo :ref:`_init() <class_Object_private_method__init>` di uno script. Un buon punto per farlo è in un :ref:`autoload <doc_singletons_autoload>`.
ru: Пользовательский регистратор можно зарегистрировать, создав класс, наследующий от :ref:`class_logger`, и передав экземпляр этого класса методу :ref:`OS.add_logger <class_OS_method_add_logger>` в методе :ref:`_init() <class_Object_private_method__init>` скрипта. Хорошим местом для этого является метод :ref:`autoload <doc_singletons_autoload>`.
ta: இதிலிருந்து பெறும் ஒரு வகுப்பை உருவாக்குவதன் மூலம் தனிப்பயன் லாகரை பதிவு செய்யலாம்: ref: `class_logger`, பின்னர் இந்த வகுப்பின் ஒரு நிகழ்வைக் கடந்து செல்கிறது: ref:` os.add_logger <class_os_method_add_logger> `, ஒரு ச்கிரிப்டில்: Ref:` _INIT () <வர்க்கம்_பிரிவெக்ட்_பிரிவெக்ட்_பிரிவெக்ட்_பிரிவெக்ட்_பிரிவெக்ட்_பிரிவெக்ட்_பிரிவெக்ட்_பிரிவெக்ட்_பிரிவெக்ட்_ இதைச் செய்ய ஒரு நல்ல இடம் ஒரு: குறிப்பு: `ஆட்டோலோட் <doc_singletons_autoload>`.
uk: Настроюваний логер можна зареєструвати, створивши клас, який успадковує від :ref:`class_logger`, а потім передавши екземпляр цього класу до :ref:`OS.add_logger <class_OS_method_add_logger>` у методі :ref:`_init() <class_Object_private_method__init>` скрипта. Хорошим місцем для цього є :ref:`autoload <doc_singletons_autoload>`.
zh_hans: 可通过创建一个继承自 :ref:`class_logger` 的类来注册自定义日志记录器，然后在脚本的 :ref:`OS.add_logger <class_OS_method_add_logger>` 方法中，将该类的实例传递给 :ref:`_init() <class_Object_private_method__init>`。一个合适的实现位置是 :ref:`autoload <doc_singletons_autoload>`。
zh_hant: 要註冊自訂記錄器，先建立一個繼承自 :ref:`class_logger` 的類別，然後在腳本的 :ref:`_init() <class_Object_private_method__init>` 方法中，將其實例傳給 :ref:`OS.add_logger <class_OS_method_add_logger>`。不錯的放置地點是 :ref:`自動載入 <doc_singletons_autoload>`。

source: The class must define two methods: :ref:`_log_message() <class_Logger_private_method__log_message>` and :ref:`_log_error() <class_Logger_private_method__log_error>`.
it: La classe deve definire due metodi: :ref:`_log_message() <class_Logger_private_method__log_message>` e :ref:`_log_error() <class_Logger_private_method__log_error>`.
ru: Класс должен определять два метода: :ref:`_log_message() <class_Logger_private_method__log_message>` и :ref:`_log_error() <class_Logger_private_method__log_error>`.
ta: வகை இரண்டு முறைகளை வரையறுக்க வேண்டும் :: குறிப்பு: `_log_message () <class_logger_private_method__log_message>` மற்றும்: ref: `_log_error () <class_logger_method__log_error>`.
uk: Клас повинен визначити два методи: :ref:`_log_message() <class_Logger_private_method__log_message>` і :ref:`_log_error() <class_Logger_private_method__log_error>`.
zh_hans: 该类必须定义两个方法：:ref:`_log_message() <class_Logger_private_method__log_message>` 和 :ref:`_log_error() <class_Logger_private_method__log_error>`。
zh_hant: 該類別必須定義兩個方法：:ref:`_log_message() <class_Logger_private_method__log_message>` 與 :ref:`_log_error() <class_Logger_private_method__log_error>`。

source: Here is a minimal working example of a custom logger, with the script added as an autoload:
ru: Вот минимальный рабочий пример пользовательского регистратора со скриптом, добавленным в качестве автозагрузки:
ta: தனிப்பயன் லாகரின் குறைந்தபட்ச வேலை எடுத்துக்காட்டு இங்கே, ச்கிரிப்ட் ஒரு ஆட்டோலோடாக சேர்க்கப்பட்டுள்ளது:
uk: Ось мінімальний робочий приклад користувацького логера зі скриптом, доданим як автозавантаження:
zh_hans: 以下是一个最小可运行的自定义日志记录器示例，该脚本已作为自动加载（autoload）添加：
zh_hant: 以下是一個可運作的最小自訂記錄器範例，並將腳本加入為自動載入：
