Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/logging.po
Languages: it, ru, ta, uk, zh_hans, zh_hant

source: Logging
ru: Ведение журнала
ta: பதிவு
uk: Лісозаготівля
zh_hans: 日志
zh_hant: 記錄

source: Godot comes with several ways to organize and collect log messages.
it: Godot offre diversi modi per organizzare e recuperare i messaggi di log.
ru: Godot предлагает несколько способов организации и сбора сообщений журнала.
ta: பதிவு செய்திகளை ஒழுங்கமைக்கவும் சேகரிக்கவும் கோடோட் பல வழிகளுடன் வருகிறது.
uk: Godot пропонує кілька способів упорядкування та збору повідомлень журналів.
zh_hans: Godot 提供了多种方式来组织和收集日志消息。
zh_hant: Godot 提供多種方式來整理與蒐集日誌訊息。

source: Printing messages
it: Stampare i messaggi
ru: Печать сообщений
ta: செய்திகளை அச்சிடுதல்
uk: Друк повідомлень
zh_hans: 打印消息
zh_hant: 列印訊息

source: See :ref:`doc_output_panel_printing_messages` for instructions on printing messages. The printed output is generally identical to the logged output.
it: Consultare :ref:`doc_output_panel_printing_messages` per istruzioni sulla stampa dei messaggi. L'output stampato è generalmente identico a quello registrato.
ru: Инструкции по печати сообщений см. в документе :ref:`doc_output_panel_printing_messages`. Вывод на печать, как правило, идентичен выводу, зафиксированному в журнале.
ta: காண்க: குறிப்பு: செய்திகளை அச்சிடுவதற்கான வழிமுறைகளுக்கு `doc_output_panel_printing_messages`. அச்சிடப்பட்ட வெளியீடு பொதுவாக உள்நுழைந்த வெளியீட்டிற்கு ஒத்ததாக இருக்கும்.
uk: Див. :ref:`doc_output_panel_printing_messages` для отримання інструкцій щодо друку повідомлень. Вивід, що друкується, загалом ідентичний виводу, що записується в журнал.
zh_hans: 有关打印消息的说明，请参阅:ref:`doc_output_panel_printing_messages`。打印输出的内容通常与日志输出内容一致。
zh_hant: 關於如何列印訊息，請見 :ref:`doc_output_panel_printing_messages`。列印輸出通常與記錄的輸出相同。

source: When running a project from the editor, the editor will display logged text in the :ref:`doc_output_panel`.
it: Quando si esegue un progetto dall'editor, l'editor visualizzerà il testo registrato nel :ref:`doc_output_panel`.
ru: При запуске проекта из редактора редактор отобразит зарегистрированный текст в :ref:`doc_output_panel`.
ta: எடிட்டரிடமிருந்து ஒரு திட்டத்தை இயக்கும் போது, ஆசிரியர் உள்நுழைந்த உரையை: ref: `doc_output_panel` இல் காண்பிப்பார்.
uk: Під час запуску проєкту з редактора, редактор відображатиме записаний текст у :ref:`doc_output_panel`.
zh_hant: 從編輯器執行專案時，編輯器會在 :ref:`doc_output_panel` 顯示日誌文字。

source: Project settings
it: Impostazioni del progetto
ru: Настройки проекта
ta: திட்ட அமைப்புகள்
uk: Параметри проекту
zh_hans: 项目设置
zh_hant: 專案設定

source: There are several project settings to control logging behavior in Godot:
it: Ci sono varie impostazioni del progetto che controllano il comportamento di logging in Godot:
ru: Для управления поведением логирования в Godot существует несколько настроек проекта:
ta: கோடோட்டில் பதிவு செய்யும் நடத்தையைக் கட்டுப்படுத்த பல திட்ட அமைப்புகள் உள்ளன:
uk: Існує кілька налаштувань проекту для керування поведінкою логування в Godot:
zh_hant: Godot 提供數個專案設定可控制日誌行為：

source: **Application > Run > Disable stdout:** Disables logging to standard output entirely. This also affects what custom loggers receive. This can be controlled at runtime by setting :ref:`Engine.print_to_stdout <class_Engine_property_print_to_stdout>`.
ru: **Приложение > Выполнить > Отключить stdout:** Полностью отключает запись журнала в стандартный вывод. Это также влияет на то, что получают пользовательские средства регистрации. Это можно контролировать во время выполнения, установив :ref:`Engine.print_to_stdout <class_Engine_property_print_to_stdout>`.
ta: . தனிப்பயன் லாகர்கள் பெறுவதையும் இது பாதிக்கிறது. அமைப்பதன் மூலம் இதை இயக்க நேரத்தில் கட்டுப்படுத்தலாம்: குறிப்பு: `Engine.print_to_stdout <class_engine_property_print_to_stdout>`.
uk: **Програма > Виконати > Вимкнути стандартний вивід:** Повністю вимикає ведення журналу у стандартний вивід. Це також впливає на те, що отримують користувацькі реєстратори. Цим можна керувати під час виконання, встановивши :ref:`Engine.print_to_stdout <class_Engine_property_print_to_stdout>`.
zh_hans: **应用程序 > 运行 > 禁用标准输出（Application > Run > Disable stdout）：** 完全禁用向标准输出的日志记录。这也会影响自定义日志记录器接收到的内容。可在运行时通过设置:ref:`Engine.print_to_stdout <class_Engine_property_print_to_stdout>`来控制此选项。
zh_hant: **Application > Run > Disable stdout:** 完全停用輸出到標準輸出的日誌。這也會影響自訂記錄器所接收到的內容。執行時可透過設定 :ref:`Engine.print_to_stdout <class_Engine_property_print_to_stdout>` 來控制.

source: **Application > Run > Disable stderr:** Disables logging to standard error entirely. This also affects what custom loggers receive. This can be controlled at runtime by setting :ref:`Engine.print_error_messages <class_Engine_property_print_error_messages>`.
ru: **Приложение > Выполнить > Отключить stderr:** Полностью отключает запись в стандартный поток ошибок. Это также влияет на то, что получают пользовательские средства ведения журнала. Это можно контролировать во время выполнения, установив :ref:`Engine.print_error_messages <class_Engine_property_print_error_messages>`.
ta: ** பயன்பாடு> ரன்> STDERR ஐ முடக்கு: ** நிலையான பிழைக்கு உள்நுழைவதை முடக்குகிறது. தனிப்பயன் லாகர்கள் பெறுவதையும் இது பாதிக்கிறது. அமைப்பதன் மூலம் இதை இயக்க நேரத்தில் கட்டுப்படுத்தலாம்: ref: `Engine.print_error_messages <class_engine_property_print_error_messages>`.
uk: **Програма > Виконати > Вимкнути stderr:** Повністю вимикає ведення журналу стандартних помилок. Це також впливає на те, що отримують користувацькі реєстратори. Цим можна керувати під час виконання, встановивши :ref:`Engine.print_error_messages <class_Engine_property_print_error_messages>`.
zh_hans: **应用程序 > 运行 > 禁用标准错误（Application > Run > Disable stderr）：** 完全禁用向标准错误输出的日志记录。这也会影响自定义日志记录器接收到的内容。可在运行时通过设置:ref:`Engine.print_error_messages <class_Engine_property_print_error_messages>`来控制此选项。
zh_hant: **Application > Run > Disable stderr:** 完全停用輸出到標準錯誤的日誌。這也會影響自訂記錄器所接收到的內容。執行時可透過設定 :ref:`Engine.print_error_messages <class_Engine_property_print_error_messages>` 來控制.

source: **Debug > Settings > stdout > Verbose stdout:** Enables verbose logging to standard output. Prints from :ref:`print_verbose() <class_@GlobalScope_method_print_verbose>` are only visible if verbose mode is enabled.
ru: **Отладка > Настройки > stdout > Подробный stdout:** Включает подробное протоколирование в стандартный вывод. Вывод из :ref:`print_verbose() <class_@GlobalScope_method_print_verbose>` отображается только при включенном режиме подробного вывода.
ta: . இருந்து அச்சிடுகிறது: ref: `print_verbose () <class_@globalscope_method_print_verbose>` வாய்மொழி பயன்முறை இயக்கப்பட்டிருந்தால் மட்டுமே தெரியும்.
uk: **Debug > Settings > stdout > Verbose stdout:** Увімкнення детального журналу в стандартному виводі. Виводи з :ref:`print_verbose() <class_@GlobalScope_method_print_verbose>` відображаються лише в разі увімкнення детального режиму.
zh_hans: **调试 > 设置 > 标准输出 > 详细标准输出（Debug > Settings > stdout > Verbose stdout）：** 启用向标准输出的详细日志记录。仅当启用详细模式时，:ref:`print_verbose() <class_@GlobalScope_method_print_verbose>`的输出内容才会显示。
zh_hant: **Debug > Settings > stdout > Verbose stdout:** 啟用輸出到標準輸出的詳細日誌。來自 :ref:`print_verbose() <class_@GlobalScope_method_print_verbose>` 的輸出僅在啟用詳細模式時可見。

source: **Debug > Settings > stdout > Print FPS:** Prints the frames per second every second, as well as the V-Sync status on startup (as it can effectively cap the maximum framerate).
it: **Debug > Impostazioni > stdout > Stampa FPS:** Stampa i frame al secondo ogni secondo, nonché lo stato del V-Sync all'avvio (poiché può effettivamente limitare la frequenza massima dei frame).
ru: **Отладка > Настройки > stdout > Печать FPS:** Выводит количество кадров в секунду каждую секунду, а также состояние вертикальной синхронизации при запуске (поскольку это может эффективно ограничить максимальную частоту кадров).
ta: **Debug > அமைப்புகள் > stdout > அச்சிடுக FPS:** Prints the சட்டங்கள் per second every second, அச் well அச் the V-Sync நிலை on தொடங்கு (as it can effectively cap the பெருமம் framerate).
uk: **Налагодження > Налаштування > stdout > Друк FPS:** Друкує кількість кадрів за секунду щосекунди, а також стан вертикальної синхронізації під час запуску (оскільки це може ефективно обмежити максимальну частоту кадрів).
zh_hans: **调试 > 设置 > 标准输出 > 打印 FPS（Debug > Settings > stdout > Print FPS）：** 每秒打印一次帧率（FPS），并在启动时打印垂直同步（V-Sync）状态（因为它可能有效限制最大帧率）。
zh_hant: **Debug > Settings > stdout > Print FPS:** 每秒列印每秒幀數, 並在啟動時列印 V-Sync 狀態 (因為它會有效限制最大幀率)。

source: **Debug > Settings > stdout > Print GPU Profile:** Prints a report of GPU utilization every second, using the same data source as the :ref:`doc_debugger_panel_visual_profiler`.
it: **Debug > Impostazioni > stdout > Stampa profilo GPU:** Stampa un report sull'utilizzo della GPU ogni secondo, attraverso la stessa origine dati di :ref:`doc_debugger_panel_visual_profiler`.
ru: **Отладка > Настройки > stdout > Печать профиля GPU:** Печатает отчет об использовании GPU каждую секунду, используя тот же источник данных, что и :ref:`doc_debugger_panel_visual_profiler`.
ta: ** பிழைத்திருத்தம்> அமைப்புகள்> stdout> சி.பீ.
uk: **Налагодження > Налаштування > stdout > Друк профілю графічного процесора:** Друкує звіт про використання графічного процесора щосекунди, використовуючи те саме джерело даних, що й :ref:`doc_debugger_panel_visual_profiler`.
zh_hans: **调试 > 设置 > 标准输出 > 打印 GPU 性能分析（Debug > Settings > stdout > Print GPU Profile）：** 每秒打印一次 GPU 使用情况报告，数据来源与 :ref:`doc_debugger_panel_visual_profiler`相同。
zh_hant: **Debug > Settings > stdout > Print GPU Profile:** 每秒列印 GPU 使用狀況報告, 資料來源與 :ref:`doc_debugger_panel_visual_profiler` 相同。

source: Some of these project settings can also be overridden using :ref:`command line arguments <doc_command_line_tutorial>` such as ``--quiet``, ``--verbose``, and ``--print-fps``.
it: È possibile anche sovrascrivere alcune di queste impostazioni del progetto attraverso gli :ref:`argomenti della riga di comando <doc_command_line_tutorial>` come ``--quiet``, ``--verbose`` e ``--print-fps``.
ru: Некоторые из этих настроек проекта также можно переопределить с помощью :ref:`аргументов командной строки <doc_command_line_tutorial>`, таких как ``--quiet``, ``--verbose`` и ``--print-fps``.
ta: இந்த திட்ட அமைப்புகளில் சிலவற்றையும் பயன்படுத்தி மீறப்படலாம்: குறிப்பு: `கட்டளை வரி வாதங்கள் <doc_command_line_tutorial>` போன்ற `` --quiet``, `` --verbose``, மற்றும் `` --print-fps`` போன்றவை.
uk: Деякі з цих налаштувань проєкту також можна змінити за допомогою :ref:`command line arguments <doc_command_line_tutorial>`, таких як ``--quiet``, ``--verbose`` та ``--print-fps``.
zh_hans: 这些项目设置中的一部分也可以通过 :ref:`command line arguments <doc_command_line_tutorial>` 进行覆盖，例如 ``--quiet``（静默模式）、``--verbose``（详细模式）和 ``--print-fps``（打印帧率）。
zh_hant: 其中一些專案設定也可透過 :ref:`指令列參數 <doc_command_line_tutorial>` 覆寫，例如 ``--quiet``、``--verbose`` 與 ``--print-fps``。

source: The engine's own file logging is also configurable, as described in the section below.
it: Anche il logging su file del motore è configurabile, come descritto nella sezione seguente.
ru: Также можно настроить собственное ведение журнала файлов движка, как описано в разделе ниже.
ta: கீழே உள்ள பிரிவில் விவரிக்கப்பட்டுள்ளபடி, இயந்திரத்தின் சொந்த கோப்பு பதிவும் கட்டமைக்கக்கூடியது.
uk: Власне ведення журналу файлів двигуна також налаштовується, як описано в розділі нижче.
zh_hans: 引擎自身的文件日志记录功能也可进行配置，具体说明见下文。
zh_hant: 引擎內建的檔案日誌也可設定，如下節所述。

source: Built-in file logging
it: Logging integrato su file
ru: Встроенное ведение журнала файлов
ta: உள்ளமைக்கப்பட்ட கோப்பு பதிவு
uk: Вбудоване ведення журналу файлів
zh_hant: 內建檔案日誌

source: By default, Godot writes log files in ``user://logs/godot.log`` on desktop platforms. You can change this location by modifying the ``debug/file_logging/log_path`` project setting. Logs are rotated to keep older files available for inspection. Each session creates a new log file, with the old file renamed to contain the date at which it was rotated. Up to 5 log files are kept by default, which can be adjusted using the ``debug/file_logging/max_log_files`` project setting.
it: Come predefinito, Godot scrive i file di log in ``user://logs/godot.log`` sulle piattaforme desktop. È possibile modificare questa posizione modificando l'impostazione di progetto ``debug/file_logging/log_path``. I log vengono ruotati per mantenere i file più vecchi disponibili per l'ispezione. Ogni sessione crea un nuovo file di log, con il vecchio file rinominato per contenere la data in cui è stato ruotato. Come predefinito, sono conservati fino a 5 file di log, il che è possibile regolare attraverso l'impostazione del progetto ``debug/file_logging/max_log_files``.
ru: По умолчанию Godot записывает файлы журналов в ``user://logs/godot.log`` на настольных платформах. Вы можете изменить это местоположение, изменив настройку проекта ``debug/file_logging/log_path``. Журналы ротируются, чтобы старые файлы были доступны для проверки. Каждый сеанс создает новый файл журнала, при этом старый файл переименовывается, чтобы содержать дату его ротации. По умолчанию сохраняется до 5 файлов журнала, это количество можно изменить с помощью настройки проекта ``debug/file_logging/max_log_files``.
ta: இயல்பாக, கோடோட் பதிவு கோப்புகளை `` பயனர்: // பதிவுகள்/கோடோட்.லாக்`` டெச்க்டாப் இயங்குதளங்களில் எழுதுகிறார். `` பிழைத்திருத்த/கோப்பு_லோகிங்/லாக்_பாத்`` திட்ட அமைப்பை மாற்றியமைப்பதன் மூலம் இந்த இருப்பிடத்தை மாற்றலாம். பழைய கோப்புகளை ஆய்வுக்கு கிடைக்கச் செய்ய பதிவுகள் சுழற்றப்படுகின்றன. ஒவ்வொரு அமர்வும் ஒரு புதிய பதிவு கோப்பை உருவாக்குகிறது, பழைய கோப்பு மறுபெயரிடப்பட்டது, அது சுழற்றப்பட்ட தேதியைக் கொண்டுள்ளது. 5 பதிவு கோப்புகள் இயல்புநிலையாக வைக்கப்படுகின்றன, இது `` பிழைத்திருத்த/கோப்பு_ லாக்சிங்/மேக்ச்_லாக்_ஃபைல்கள்` திட்ட அமைப்பைப் பயன்படுத்தி சரிசெய்யலாம்.
uk: За замовчуванням Godot записує файли журналів у ``user://logs/godot.log`` на настільних платформах. Ви можете змінити це розташування, змінивши налаштування проекту ``debug/file_logging/log_path``. Журнали ротуються, щоб старі файли були доступні для перевірки. Кожен сеанс створює новий файл журналу, а старий файл перейменовується, щоб містити дату ротації. За замовчуванням зберігається до 5 файлів журналів, що можна налаштувати за допомогою налаштування проекту ``debug/file_logging/max_log_files``.
zh_hant: 預設情況下，Godot 會在桌面平台的 ``user://logs/godot.log`` 寫入日誌檔。你可透過修改專案設定 ``debug/file_logging/log_path`` 來變更此位置。為了保留舊檔供檢視，日誌會進行輪替。每次執行都會建立新的日誌檔，舊檔則會重新命名以包含被輪替時的日期。預設會保留最多 5 個日誌檔，可透過 ``debug/file_logging/max_log_files`` 調整。

source: File logging can also be disabled completely using the ``debug/file_logging/enable_file_logging`` project setting.
it: È possibile anche disattivare il logging su file completamente attraverso l'impostazione del progetto ``debug/file_logging/enable_file_logging``.
ru: Ведение журнала файлов также можно полностью отключить с помощью настройки проекта ``debug/file_logging/enable_file_logging``.
ta: `` பிழைத்திருத்த/கோப்பு_லாக்சிங்/enable_file_logging`` திட்ட அமைப்பைப் பயன்படுத்தி கோப்பு உள்நுழைவு முழுமையாக முடக்கப்படலாம்.
uk: Реєстрацію файлів також можна повністю вимкнути за допомогою налаштування проекту ``debug/file_logging/enable_file_logging``.
zh_hant: 也可透過 ``debug/file_logging/enable_file_logging`` 完全停用檔案日誌。

source: When the project crashes, crash logs are written to the same file as the log file. The crash log will only contain a usable backtrace if the binary that was run contains debugging symbols, or if it can find a debug symbols file that matches the binary. Official binaries don't provide debugging symbols, so this requires a custom build to work. See :ref:`Debugging symbols <doc_introduction_to_the_buildsystem_debugging_symbols>` for guidance on compiling binaries with debugging symbols enabled.
it: Quando il progetto si blocca, i log dei crash vengono scritti nello stesso file del file di log. Il log dei crash conterrà un backtrace utilizzabile solo se il binario eseguito contiene simboli di debug, o se riesce a trovare un file di simboli di debug corrispondente al binario. I binari ufficiali non forniscono simboli di debug, quindi è necessaria una build personalizzata per funzionare. Consultare :ref:`Simboli di debug <doc_introduction_to_the_buildsystem_debugging_symbols>` per istruzioni sulla compilazione di binari con i simboli di debug abilitati.
ru: При сбое проекта журналы сбоев записываются в тот же файл, что и файл журнала. Журнал сбоев будет содержать пригодную для использования обратную трассировку только в том случае, если запущенный исполняемый файл содержит отладочные символы или если программа сможет найти файл отладочных символов, соответствующий исполняемому файлу. Официальные исполняемые файлы не предоставляют отладочные символы, поэтому для работы требуется специальная сборка. Инструкции по компиляции исполняемых файлов с включёнными отладочными символами см. в разделе :ref:`Debugging symbols <doc_introduction_to_the_buildsystem_debugging_symbols>`.
ta: திட்டம் செயலிழக்கும்போது, செயலிழப்பு பதிவுகள் பதிவு கோப்பின் அதே கோப்பில் எழுதப்படும். இயங்கும் பைனரியில் பிழைத்திருத்த சின்னங்கள் இருந்தால், அல்லது பைனரியுடன் பொருந்தக்கூடிய பிழைத்திருத்த சின்னங்கள் கோப்பைக் கண்டுபிடிக்க முடிந்தால் செயலிழப்பு பதிவில் பயன்படுத்தக்கூடிய பின்னணி மட்டுமே இருக்கும். அதிகாரப்பூர்வ பைனரிகள் பிழைத்திருத்த சின்னங்களை வழங்காது, எனவே இதற்கு வேலை செய்ய தனிப்பயன் கட்டமைப்பை தேவைப்படுகிறது. காண்க: குறிப்பு: `பிழைத்திருத்த சின்னங்கள் <doc_introduction_to_the_the_buildsystem_debugging_symbols>` பிழைத்திருத்த சின்னங்களுடன் பைனரிகளை தொகுத்தல் குறித்த வழிகாட்டுதலுக்காக.
uk: Коли проект аварійно завершується, журнали аварій записуються в той самий файл, що й файл журналу. Журнал аварій міститиме корисний трасування лише в тому випадку, якщо запущений бінарний файл містить символи налагодження або якщо можна знайти файл символів налагодження, що відповідає бінарному файлу. Офіційні бінарні файли не містять символів налагодження, тому для роботи потрібно створити спеціальну збірку. Дивіться :ref:`Debugging symbols <doc_introduction_to_the_buildsystem_debugging_symbols>` для отримання вказівок щодо компіляції бінарних файлів з увімкненими символами налагодження.
zh_hant: 當專案崩潰時，崩潰日誌會寫入與一般日誌相同的檔案。只有在執行的二進位包含除錯符號，或能找到與之相符的除錯符號檔時，崩潰日誌才會包含可用的回溯。官方二進位不提供除錯符號，因此需要自訂建置才能生效。請見 :ref:`除錯符號 <doc_introduction_to_the_buildsystem_debugging_symbols>` 以了解如何在啟用除錯符號的情況下編譯二進位。

source: Log files for :ref:`print() <class_@GlobalScope_method_print>` statements are updated when standard output is *flushed* by the engine. Standard output is flushed on every print in debug builds only. In projects that are exported in release mode, standard output is only flushed when the project exits or crashes to improve performance, especially if the project is often printing text to standard output.
it: I file di log per le istruzioni :ref:`print() <class_@GlobalScope_method_print>` sono aggiornati quando l'output standard viene *svuotato* dal motore. L'output standard viene svuotato a ogni stampa solo nelle build di debug. Nei progetti esportati in modalità rilascio, l'output standard viene svuotato solo quando il progetto si chiude o si blocca per migliorare le prestazioni, soprattutto se il progetto stampa spesso testo sull'output standard.
ru: Файлы журналов для операторов :ref:`print() <class_@GlobalScope_method_print>` обновляются при *очистке* стандартного вывода движком. Стандартный вывод очищается при каждой печати только в отладочных сборках. В проектах, экспортированных в режиме выпуска, стандартный вывод очищается только при завершении проекта или его сбое для повышения производительности, особенно если проект часто выводит текст в стандартный вывод.
ta: இதற்கான கோப்புகளை பதிவுசெய்க: ref: `print () <class_@globalscope_method_print>` இயந்திரத்தால் நிலையான வெளியீடு * சுத்தப்படுத்தப்படும்போது அறிக்கைகள் புதுப்பிக்கப்படும். பிழைத்திருத்த கட்டமைப்பில் உள்ள ஒவ்வொரு அச்சிலும் நிலையான வெளியீடு சுத்தப்படுத்தப்படுகிறது. வெளியீட்டு பயன்முறையில் ஏற்றுமதி செய்யப்படும் திட்டங்களில், செயல்திறனை மேம்படுத்த திட்டத்திலிருந்து வெளியேறும்போது அல்லது செயலிழக்கும்போது மட்டுமே நிலையான வெளியீடு சுத்தப்படுத்தப்படுகிறது, குறிப்பாக திட்டம் பெரும்பாலும் நிலையான வெளியீட்டிற்கு உரையை அச்சிட்டால்.
uk: Файли журналу для операторів :ref:`print() <class_@GlobalScope_method_print>` оновлюються, коли движок *очищає* стандартний вивід. Стандартний вивід очищується при кожному виведенні тільки в збігах для налагодження. У проектах, що експортуються в режимі випуску, стандартний вивід очищується тільки при виході з проекту або його аварійному завершенні для підвищення продуктивності, особливо якщо проект часто виводить текст у стандартний вивід.
zh_hant: 針對 :ref:`print() <class_@GlobalScope_method_print>` 所列印的訊息, 日誌檔會在引擎將標準輸出 *flush* 時更新。僅在除錯建置中, 標準輸出會於每次列印時進行 flush。在以發行模式匯出的專案中, 標準輸出只會在專案結束或崩潰時才進行 flush, 以提升效能, 特別是在專案經常列印文字到標準輸出的情況下。

source: On the other hand, the standard error stream (used by :ref:`printerr() <class_@GlobalScope_method_printerr>`, :ref:`push_error() <class_@GlobalScope_method_push_error>`, and :ref:`push_warning() <class_@GlobalScope_method_push_warning>`) is always flushed on every print, even in projects exported in release mode.
it: D'altro parte, il flusso di errore standard (utilizzato da :ref:`printerr() <class_@GlobalScope_method_printerr>`, :ref:`push_error() <class_@GlobalScope_method_push_error>` e :ref:`push_warning() <class_@GlobalScope_method_push_warning>`) viene sempre svuotato a ogni stampa, anche nei progetti esportati in modalità rilascio.
ru: С другой стороны, стандартный поток ошибок (используемый :ref:`printerr() <class_@GlobalScope_method_printerr>`, :ref:`push_error() <class_@GlobalScope_method_push_error>` и :ref:`push_warning() <class_@GlobalScope_method_push_warning>`) всегда очищается при каждой печати, даже в проектах, экспортированных в режиме выпуска.
ta: மறுபுறம், நிலையான பிழை ச்ட்ரீம் (பயன்படுத்திய: `அச்சுப்பொறி () <class_@globalscope_method_printerr>`,: ref: `pust_error () <class_@globalscope_method_push_error>`, மற்றும்: fust_mowal_molkal_@istornonging () <sollorning_@@bullows_@@blows_@@vollows_@@blows_molkals_@bullows_@@ வெளியீட்டு பயன்முறையில் ஏற்றுமதி செய்யப்பட்ட திட்டங்களில் கூட அச்சு.
uk: З іншого боку, стандартний потік помилок (який використовується :ref:`printerr() <class_@GlobalScope_method_printerr>`, :ref:`push_error() <class_@GlobalScope_method_push_error>`, і :ref:`push_warning() <class_@GlobalScope_method_push_warning>`) завжди зчищається при кожному друку, навіть у проектах, експортованих у режимі випуску.
zh_hant: 相對地，標準錯誤串流（由 :ref:`printerr() <class_@GlobalScope_method_printerr>`、:ref:`push_error() <class_@GlobalScope_method_push_error>` 與 :ref:`push_warning() <class_@GlobalScope_method_push_warning>` 使用）在每次列印時都會進行沖洗，即使在以發行模式匯出的專案也是如此。
