Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/nodes_and_scene_instances.po
Languages: ga, it, ja, ru, ta, uk, zh_tw

source: Nodes and scene instances
ga: Nóid agus cásanna radhairc
it: Nodi e istanze di scene
ja: ノードとシーンインスタンス
ru: Узлы и экземпляры сцены
ta: முனைகள் மற்றும் காட்சி நிகழ்வுகள்
uk: Вузли та екземпляри сцени
zh_tw: 節點與場景實體

source: This guide explains how to get nodes, create nodes, add them as a child, and instantiate scenes from code.
ga: Míníonn an treoir seo conas nóid a fháil, nóid a chruthú, iad a chur mar leanbh, agus radhairc a ionchosú ón gcód.
it: Questa guida spiega come ottenere nodi, creare nodi, aggiungerli come figli e istanziare scene da codice.
ja: このガイドでは、ノードの取得、ノードの作成、それらを子として追加し、コードからシーンをインスタンス化する方法について説明します。
ru: В этом руководстве объясняется, как получать узлы, создавать узлы, добавлять их в качестве дочерних элементов и создавать сцены из кода.
ta: இந்த வழிகாட்டி முனைகளை எவ்வாறு பெறுவது, முனைகளை உருவாக்குவது, குழந்தையாகச் சேர்ப்பது மற்றும் குறியீட்டிலிருந்து காட்சிகளை உடனடிப்படுத்துவது ஆகியவற்றை விளக்குகிறது.
uk: У цьому посібнику пояснюється, як отримувати вузли, створювати вузли, додавати їх як дочірні елементи та створювати екземпляри сцен із коду.
zh_tw: 本指南將說明如何獲取節點、建立節點、將節點新增為子節點，以及如何用程式碼實體化場景。

source: Check the :ref:`doc_instancing` tutorial to learn about Godot's approach to scene instancing.
it: Consulta il tutorial :ref:`doc_instancing` per saperne di più sull'approccio di Godot all'istanziazione delle scene.
ru: Ознакомьтесь с руководством :ref:`doc_instancing`, чтобы узнать о подходе Godot к созданию копий сцен.
uk: Перегляньте підручник :ref:`doc_instancing`, щоб дізнатися про підхід Godot до створення екземплярів сцени.
zh_tw: 請參閱 :ref:`doc_instancing` 教學，進一步瞭解 Godot 處理場景實體化的方法。

source: Getting nodes
ga: Nóid a fháil
it: Ottenere nodi
ja: ノードの取得
ru: Получение узлов
ta: முனைகளைப் பெறுதல்
uk: Отримання вузлів
zh_tw: 取得節點

source: You can get a reference to a node by calling the :ref:`Node.get_node() <class_Node_method_get_node>` method. For this to work, the child node must be present in the scene tree. Getting it in the parent node's ``_ready()`` function guarantees that.
ga: Is féidir leat tagairt do nód a fháil ach glaoch ar an modh :ref:`Node.get_node() <class_Node_method_get_node>`. Chun go n-oibreoidh sé seo, caithfidh nód an linbh a bheith i láthair sa chrann radhairc. Má fhaigheann tú é i bhfeidhm `` _ready()`` nód an tuismitheora ráthaítear é sin.
it: È possibile ottenere un riferimento a un nodo chiamando il metodo :ref:`Node.get_node() <class_Node_method_get_node>`. Affinché ciò funzioni, il nodo figlio deve essere presente nell'albero di scene. Ottenere il riferimento nella funzione ``_ready()`` del nodo padre garantisce questo.
ja: ノードへの参照を取得するには :ref:`Node.get_node() <class_Node_method_get_node>` メソッドを呼び出します。これが機能するには、子ノードがシーンツリーに存在する必要があります。親ノードの ``_ready()`` 関数でそれを取得することで、それが保証されます。
ru: Ссылку на узел можно получить, вызвав метод :ref:`Node.get_node() <class_Node_method_get_node>`. Для этого дочерний узел должен присутствовать в дереве сцены. Получение ссылки в функции ``_ready()`` родительского узла гарантирует это.
ta: இதை அழைப்பதன் மூலம் ஒரு முனைக்கு ஒரு குறிப்பைப் பெறலாம்: ref: `node.get_node () <class_node_method_get_node>` முறை. இது வேலை செய்ய, குழந்தை முனை காட்சி மரத்தில் இருக்க வேண்டும். பெற்றோர் முனையின் `` _ready () `` செயல்பாடு அதற்கு பொறுப்பு அளிக்கிறது.
uk: Ви можете отримати посилання на вузол, викликавши метод :ref:`Node.get_node() <class_Node_method_get_node>`. Щоб це працювало, дочірній вузол має бути присутнім у дереві сцени. Отримання його у функції ``_ready()`` батьківського вузла гарантує це.
zh_tw: 你可以透過呼叫 :ref:`Node.get_node() <class_Node_method_get_node>` 方法來取得節點的參考。要讓這個方法正常運作，該子節點必須已經存在於場景樹中。在父節點的 ``_ready()`` 函式中取得節點可以保證這一點。

source: If, for example, you have a scene tree like this, and you want to get a reference to the Sprite2D and Camera2D nodes to access them in your script.
ga: Má tá crann radhairc mar seo agat, mar shampla, agus gur mhaith leat tagairt a fháil do na nóid Sprite2D agus Camera2D chun rochtain a fháil orthu i do script.
it: Ad esempio, se hai un albero di scene come questo e vuoi ottenere un riferimento ai nodi Sprite2D e Camera2D per accedervi nel proprio script.
ja: たとえばこのようなシーンツリーがあり、Sprite2DノードとCamera2Dノードへの参照を取得してスクリプト内でアクセスしたいとします。
ru: Например, если у вас есть такое дерево сцены, и вы хотите получить ссылку на узлы Sprite2D и Camera2D, чтобы получить к ним доступ в вашем скрипте.
ta: எடுத்துக்காட்டாக, உங்களிடம் இது போன்ற ஒரு காட்சி மரம் இருந்தால், அவற்றை உங்கள் ச்கிரிப்டில் அணுக ச்பிரிட் 2 டி மற்றும் கேமரா 2 டி முனைகள் பற்றிய குறிப்பைப் பெற விரும்பினால்.
uk: Якщо, наприклад, у вас є дерево сцен, як це, і ви хочете отримати посилання на вузли Sprite2D і Camera2D, щоб отримати доступ до них у вашому сценарії.
zh_tw: 舉例來說，如果你有如下的場景樹，並且想在腳本中取得 Sprite2D 和 Camera2D 節點的參考。

source: To do so, you can use the following code.
ga: Chun é sin a dhéanamh, is féidir leat an cód seo a leanas a úsáid.
it: Per fare ciò, puoi utilizzare il seguente codice.
ja: これを行うには、次のコードを書きます。
ru: Для этого вы можете использовать следующий код.
ta: அவ்வாறு செய்ய, நீங்கள் பின்வரும் குறியீட்டைப் பயன்படுத்தலாம்.
uk: Для цього ви можете скористатися наступним кодом.
zh_tw: 你可以使用以下程式碼來達成。

source: Note that you get nodes using their name, not their type. Above, "Sprite2D" and "Camera2D" are the nodes' names in the scene.
ga: Tabhair faoi deara go bhfaigheann tú nóid ag úsáid a n-ainm, ní a gcineál. Thuas, is iad “Sprite2D” agus “Camera2D” ainmneacha na nóid sa radharc.
it: Nota che i nodi si ottengono tramite il loro nome, non il loro tipo. Sopra, "Sprite2D" e "Camera2D" sono i nomi dei nodi nella scena.
ja: ノードは型ではなく名前を使用して取得することに注意してください。上の"Sprite2D"と"Camera2D"はシーン内のノードの名前です。
ru: Обратите внимание, что узлы определяются по имени, а не по типу. Выше "Sprite2D" и "Camera2D" — это имена узлов в сцене.
ta: அவற்றின் பெயரைப் பயன்படுத்தி நீங்கள் முனைகளைப் பெறுவீர்கள் என்பதை நினைவில் கொள்க, அவற்றின் வகை அல்ல. மேலே, "ச்ப்ரைட் 2 டி" மற்றும் "கேமரா 2 டி" ஆகியவை காட்சியில் உள்ள முனைகளின் பெயர்கள்.
uk: Зверніть увагу, що ви отримуєте вузли, використовуючи їх ім’я, а не тип. Вище «Sprite2D» і «Camera2D» є іменами вузлів у сцені.
zh_tw: 請注意，取得節點時是使用節點名稱，而非型別。上述範例中的「Sprite2D」與「Camera2D」都是該節點在場景中的名稱。

source: If you rename the Sprite2D node as Skin in the Scene dock, you have to change the line that gets the node to ``get_node("Skin")`` in the script.
ga: Má athainmníonn tú an nód Sprite2D mar Skin sa duga Radhairc, caithfidh tú an líne a fhaigheann an nód a athrú go ``get_node (“Skin”) ``sa script.
it: Se si rinomina il nodo Sprite2D come Skin nel pannello Scena, è necessario modificare la riga che ottiene il nodo in ``get_node("Skin")`` nello script.
ja: シーンドックでSprite2Dノードの名前をSkinに変更した場合は、スクリプト内でノードを取得する行を ``get_node("Skin")`` に変更する必要があります。
ru: Если вы переименуете узел Sprite2D в Skin в доке сцены, вам придется изменить строку, которая получает узел, на ``get_node("Skin")`` в скрипте.
ta: ச்பிரிட் 2 டி முனையை காட்சி கப்பல்துறையில் தோல் என்று மறுபெயரிட்டால், நீங்கள் ச்கிரிப்டில் `` get_node ("தோல்") `` என முனையை மாற்ற வேண்டும்.
uk: Якщо ви перейменуєте вузол Sprite2D на Skin у доку Scene, вам доведеться змінити рядок, який отримує вузол, на ``get_node("Skin")`` у сценарії.
zh_tw: 如果你在「場景」面板中將 Sprite2D 節點重新命名為 Skin，那就必須在腳本中將取得該節點的程式碼更改為 ``get_node("Skin")``。

source: Node paths
ga: Cosáin nód
it: Percorsi di nodo
ja: ノードパス
ru: Пути узлов
ta: முனை பாதைகள்
uk: Шляхи вузлів
zh_tw: 節點路徑

source: When getting a reference to a node, you're not limited to getting a direct child. The ``get_node()`` function supports paths, a bit like when working with a file browser. Add a slash to separate nodes.
ga: Agus tagairt á fháil do nód, níl tú teoranta do leanbh díreach a fháil. Tacaíonn an fheidhm ``get_node () ``le cosáin, rud beag cosúil le nuair a bhíonn tú ag obair le brabhsálaí comhad. Cuir slash le nóid ar leithligh.
it: Quando si ottiene un riferimento a un nodo, non ci si limita a ottenere un nodo figlio diretto. La funzione ``get_node()`` supporta i percorsi, un po' come quando si lavora con un file browser. Aggiungi una barra per separare i nodi.
ja: ノードへの参照を取得する場合、直接の子を取得することに限定されません。 ``get_node()`` 関数はパスをサポートしており、ファイルブラウザを操作する場合と似ています。ノードを区切るにはスラッシュを追加します。
ru: При получении ссылки на узел вы не ограничены получением непосредственно дочернего элемента. Функция ``get_node()`` поддерживает пути, что немного похоже на работу с файловым браузером. Для разделения узлов добавьте косую черту.
ta: ஒரு முனையைப் பற்றிய குறிப்பைப் பெறும்போது, நீங்கள் ஒரு நேரடி குழந்தையைப் பெறுவதில் மட்டுப்படுத்தப்படவில்லை. `` Get_node () `` செயல்பாடு பாதைகளை ஆதரிக்கிறது, இது ஒரு கோப்பு உலாவியுடன் பணிபுரியும் போது போன்றது. தனித்தனி முனைகளுக்கு ஒரு குறைப்பு சேர்க்கவும்.
uk: Отримавши посилання на вузол, ви не обмежені отриманням безпосереднього дочірнього елемента. Функція ``get_node()`` підтримує шляхи, схоже на роботу з файловим браузером. Додайте косу риску для розділення вузлів.
zh_tw: 在取得節點參考時，不只限於直接子節點。``get_node()`` 方法支援路徑，有點像是在檔案總管中操作，使用斜線分隔各節點。

source: Take the following example scene, with the script attached to the UserInterface node.
ga: Tóg an radharc sampla seo a leanas, leis an script ceangailte leis an nód UserInterface.
it: Prendiamo la seguente scena di esempio, con lo script allegato al nodo UserInterface.
ja: 次のシーン例を考えてみましょう。UserInterfacノードにスクリプトがアタッチされています。
ru: Возьмем следующий пример сцены со скриптом, прикрепленным к узлу UserInterface.
ta: பயனர் இன்டர்ஃபேச் முனையுடன் இணைக்கப்பட்ட ச்கிரிப்டுடன் பின்வரும் எடுத்துக்காட்டு காட்சியை எடுத்துக் கொள்ளுங்கள்.
uk: Візьмемо наступний приклад сцени зі сценарієм, приєднаним до вузла UserInterface.
zh_tw: 以下列範例場景為例，腳本掛載在 UserInterface 節點上。

source: To get the AnimationPlayer node, you would use the following code.
ga: Chun an nód AnimationPlayer a fháil, úsáideann tú an cód seo a leanas.
it: Per ottenere il nodo AnimationPlayer, useresti il seguente codice.
ja: AnimationPlayerノードを取得するには、次のコードを使用します。
ru: Чтобы получить узел AnimationPlayer, используйте следующий код.
ta: அனிமேசன் பிளேயர் முனையைப் பெற, நீங்கள் பின்வரும் குறியீட்டைப் பயன்படுத்துவீர்கள்.
uk: Щоб отримати вузол AnimationPlayer, слід скористатися наступним кодом.
zh_tw: 要取得 AnimationPlayer 節點，可以使用以下程式碼。

source: As with file paths, you can use ".." to get a parent node. The best practice is to avoid doing that though not to break encapsulation. You can also start the path with a forward slash to make it absolute, in which case your topmost node would be "/root", the application's predefined root viewport.
ga: Mar is amhlaidh le cosáin comhaid, is féidir leat “..” a úsáid chun nód tuismitheora a fháil. Is é an cleachtas is fearr ná é sin a sheachaint cé gan ionfhabhtú a bhriseadh. Is féidir leat an cosán a thosú freisin le slash ar aghaidh chun é a dhéanamh iomlán, sa chás sin is é “/root” do nód is barr, amharc fréimhe réamhshainithe an fheidhmchláir.
it: Come per i percorsi dei file, è possibile usare ".." per ottenere un nodo padre. La migliore pratica è però di evitare di farlo per non rompere l'incapsulamento. È anche possibile iniziare il percorso con una barra per renderlo assoluto, nel qual caso il nodo più in alto sarebbe "/root", la viewport radice predefinita dell'applicazione.
ja: ファイル パスと同様に ".." を使用して親ノードを取得できますが、なるべくカプセル化を壊さないようにするためにこれを避けたほうがいいです。パスをスラッシュで開始して絶対パスにすることもできます。その場合、最上位のノードはアプリケーションの事前定義されたルートビューポートである "/root" になります。
ru: Как и в случае с путями к файлам, для получения родительского узла можно использовать "..". Рекомендуется избегать этого, но при этом не нарушать инкапсуляцию. Путь также можно начать с косой черты, чтобы сделать его абсолютным. В этом случае самым верхним узлом будет "/root" — предопределённая корневая область просмотра приложения.
ta: கோப்பு பாதைகளைப் போலவே, பெற்றோர் முனையைப் பெற ".." ஐப் பயன்படுத்தலாம். சிறந்த நடைமுறை என்னவென்றால், அதைச் செய்வதைத் தவிர்ப்பது. பயன்பாட்டின் முன் வரையறுக்கப்பட்ட ரூட் வியாபோர்ட், உங்கள் மிக உயர்ந்த முனை "/ரூட்" ஆக இருக்கும்.
uk: Як і у випадку шляхів до файлів, ви можете використовувати «..», щоб отримати батьківський вузол. Найкраще уникати цього, хоча й не порушувати інкапсуляцію. Ви також можете починати шлях із косої риски, щоб зробити його абсолютним. У цьому випадку ваш верхній вузол буде «/root», попередньо визначене кореневе вікно перегляду програми.
zh_tw: 和檔案路徑一樣，可以使用「..」取得父節點。不過，最佳實踐是避免這樣做，以維持良好的封裝性。你也可以讓路徑以斜線開頭，代表這是絕對路徑，此時最上層節點會是「/root」，也就是應用程式預設的根視窗。

source: Syntactic sugar
ga: Siúcra sintéactúil
it: Zucchero sintattico
ja: シンタックスシュガー
ru: Синтаксический сахар
ta: தொடரியல் சர்க்கரை
uk: Синтаксичний цукор
zh_tw: 語法糖

source: You can use two shorthands to shorten your code in GDScript. Firstly, putting the ``@onready`` annotation before a member variable makes it initialize right before the ``_ready()`` callback.
ga: Is féidir leat dhá ghearrthand a úsáid chun do chód a ghiorrú i GDScript. Ar dtús, cuirtear an t-anótáil ``@onready`` roimh athróg ball, déanann sé a thionscnamh díreach roimh an aisghlao ``_ready () ``.
it: È possibile usare due scorciatoie per abbreviare il codice in GDScript. Innanzitutto, inserendo l'annotazione ``@onready`` prima di una variabile membro, questa è inizializzata subito prima del callback ``_ready()``.
ja: 2つの短縮表現を使用して、GDScriptのコードを短縮できます。まずメンバー変数の前に ``@onready`` アノテーションを置くと、 ``_ready()`` コールバックの直前に初期化されます。
ru: Для сокращения кода в GDScript можно использовать два способа. Во-первых, добавление аннотации ``@onready`` перед переменной-членом приводит к её инициализации непосредственно перед функцией обратного вызова ``_ready()``.
ta: GDSCRIPT இல் உங்கள் குறியீட்டைக் குறைக்க இரண்டு சுருக்கெழுத்து பயன்படுத்தலாம். முதலாவதாக, ஒரு உறுப்பினர் மாறிக்கு முன் ``@onready`` சிறுகுறிப்பை வைப்பது `` _ready () `` திரும்பப்பெறுதலுக்கு முன் தொடங்குகிறது.
uk: Щоб скоротити свій код у GDScript, можна використовувати два скорочення. По-перше, розміщення анотації ``@onready`` перед змінною-членом ініціалізує її безпосередньо перед зворотним викликом ``_ready()``.
zh_tw: 在 GDScript 中，你可以使用兩個速記法來簡化你的程式碼。第一個是在成員變數前加上 ``@onready`` 標註，這樣變數會在 ``_ready()`` 回呼前自動初始化。

source: There is also a short notation for ``get_node()``: the dollar sign, "$". You place it before the name or path of the node you want to get.
ga: Tá notáil ghearr ann freisin le haghaidh ``get_node () ``: an comhartha dollar, “$”. Cuireann tú é roimh ainm nó cosán an nód a theastaíonn uait a fháil.
it: Esiste anche una breve notazione per ``get_node()``: il simbolo del dollaro, "$". Deve essere inserito prima del nome o del percorso del nodo che si desidera ottenere.
ja: ``get_node()`` には、ドル記号"$"という短い表記法もあります。これを取得するノードの名前またはパスの前に置きます。
ru: Существует также сокращённая запись для ``get_node()``: знак доллара ($). Он помещается перед именем или путём к узлу, который нужно получить.
ta: `` Get_node () ``: டாலர் அடையாளம், "$" க்கான ஒரு குறுகிய குறியீடும் உள்ளது. நீங்கள் பெற விரும்பும் முனையின் பெயர் அல்லது பாதைக்கு முன் அதை வைக்கவும்.
uk: Існує також коротке позначення для ``get_node()``: знак долара, "$". Ви розміщуєте його перед назвою або шляхом до вузла, який хочете отримати.
zh_tw: 此外，也可以用美元符號「$」作為 ``get_node()`` 的簡寫。只要將「$」放在你想取得的節點名稱或路徑前即可。

source: Creating nodes
ga: Nóid a chruthú
it: Creare nodi
ja: ノード作成
ru: Создание узлов
ta: முனைகளை உருவாக்குதல்
uk: Створення вузлів
zh_tw: 建立節點

source: To create a node from code, call its ``new()`` method like for any other class-based datatype.
ga: Chun nód a chruthú ón gcód, glaoigh ar a mhodh ``new () ``mar aon chineál sonraí rang-bhunaithe eile.
it: Per creare un nodo tramite codice, chiama il suo metodo ``new()`` come per qualsiasi altro tipo di dati basato su una classe.
ja: コードからノードを作成するには、他のクラスベースのデータ型と同様に、\ ``new()``\ メソッドを呼び出します。
ru: Чтобы создать узел из кода, вызовите его метод ``new()``, как для любого другого типа данных, основанного на классе.
ta: குறியீட்டிலிருந்து ஒரு முனையை உருவாக்க, அதன் `` புதிய () `` முறையைப் போன்ற வேறு எந்த வகுப்பு அடிப்படையிலான தரவுத்தொகுப்பையும் அழைக்கவும்.
uk: Щоб створити вузол з коду, викличте його метод ``new()``, як і для будь-якого іншого типу даних, заснованого на класі.
zh_tw: 要從程式碼建立節點，只需像其他類別型資料一樣呼叫 ``new()`` 方法即可。

source: You can store the newly created node's reference in a variable and call ``add_child()`` to add it as a child of the node to which you attached the script.
ga: Is féidir leat tagairt an nód nua-chruthaithe a stóráil in athróg agus glaoch ar ``add_child () ``chun é a chur leis mar leanbh den nód lena cheangail tú an script.
it: È possibile memorizzare il riferimento di un nodo appena creato in una variabile e chiamare ``add_child()`` per aggiungerlo come figlio del nodo a cui è stato allegato lo script.
ja: スクリプトから新しく作成したノードの参照を変数にセットし、add_child() を呼び出すと自分のノードの子として追加できます。
ru: Вы можете сохранить ссылку на вновь созданный узел в переменной и вызвать ``add_child()``, чтобы добавить его в качестве дочернего узла того узла, к которому вы прикрепили скрипт.
ta: புதிதாக உருவாக்கப்பட்ட முனையின் குறிப்பை ஒரு மாறியில் சேமித்து, ச்கிரிப்டை இணைத்த முனையின் குழந்தையாக இதைச் சேர்க்க `` கூடுதல்_சில்ட் () `` ஐ அழைக்கலாம்.
uk: Ви можете зберегти посилання на щойно створений вузол у змінній і викликати ``add_child()``, щоб додати його як дочірнього вузла, до якого ви прикріпили сценарій.
zh_tw: 你可以將新建立的節點參考存入變數，然後用 ``add_child()`` 把它加入為腳本掛載節點的子節點。

source: To delete a node and free it from memory, you can call its ``queue_free()`` method. Doing so queues the node for deletion at the end of the current frame after it has finished processing. At that point, the engine removes the node from the scene and frees the object in memory.
ga: Chun nód a scriosadh agus é a shaoradh ó chuimhne, is féidir leat a mhodh ``queue_free () ``a ghlaoch. Ag déanamh amhlaidh cuaineanna an nód le scriosadh ag deireadh an fhráma reatha tar éis dó próiseáil a chríochnú. Ag an bpointe sin, baineann an t-inneall an nód ón radharc agus saoraíonn sé an réad i gcuimhne.
it: Per eliminare un nodo e liberarlo dalla memoria, è possibile chiamare il suo metodo ``queue_free()``. In questo modo, il nodo viene messo in coda per essere eliminato alla fine del frame attuale, al termine della sua elaborazione. A quel punto, il motore rimuove il nodo dalla scena e libera l'oggetto in memoria.
ja: ノードを削除してメモリから解放するには、ノードの ``queue_free()`` メソッドを呼び出します。これを行うとノードの処理が完了した後、ノードが削除キューに入れられます。削除キューに入れられたノードは現在のフレームの最後に実際に削除されます。その時点でエンジンはシーンからノードを削除し、メモリ内のオブジェクトを解放します。
ru: Чтобы удалить узел и освободить его из памяти, можно вызвать его метод ``queue_free()``. Это добавит узел в очередь на удаление в конце текущего кадра после завершения его обработки. В этот момент движок удаляет узел из сцены и освобождает объект в памяти.
ta: ஒரு முனையை நீக்கி நினைவகத்திலிருந்து விடுவிக்க, நீங்கள் அதன் `` Queue_free () `` முறையை அழைக்கலாம். அவ்வாறு செய்வது செயலாக்கத்தை முடித்த பிறகு தற்போதைய சட்டகத்தின் முடிவில் நீக்குவதற்கான முனையை வரிசைப்படுத்துகிறது. அந்த நேரத்தில், இயந்திரம் காட்சியில் இருந்து முனையை அகற்றி, பொருளை நினைவகத்தில் விடுவிக்கிறது.
uk: Щоб видалити вузол і звільнити його з пам’яті, ви можете викликати його метод ``queue_free()``. Це поставить вузол у чергу на видалення в кінці поточного кадру після завершення його обробки. У цей момент механізм видаляє вузол зі сцени та звільняє об’єкт у пам’яті.
zh_tw: 要刪除節點並釋放其記憶體，可以呼叫它的 ``queue_free()`` 方法。這會將節點排入佇列，在本幀處理結束後刪除。屆時，Godot 會把該節點從場景移除並釋放記憶體資源。

source: Before calling ``sprite2d.queue_free()``, the remote scene tree looks like this.
ga: Sula nglaonn sé ar ``sprite2d.queue_free () ``, tá cuma seo ar an gcrann radharc iargúlta.
it: Prima di chiamare ``sprite2d.queue_free()``, l'albero di scene remoto appare così.
ja: ``sprite2d.queue_free()`` を呼び出す前のリモートシーンツリーは次のようになります。
ru: Перед вызовом ``sprite2d.queue_free()`` дерево удаленной сцены выглядит следующим образом.
ta: `` Sprite2d.queue_free () `` என்று அழைப்பதற்கு முன், தொலைநிலை காட்சி மரம் இப்படி தெரிகிறது.
uk: Перед викликом ``sprite2d.queue_free()`` дерево віддаленої сцени виглядає так.
zh_tw: 在呼叫 ``sprite2d.queue_free()`` 之前，遠端場景樹看起來如下。

source: After the engine freed the node, the remote scene tree doesn't display the sprite anymore.
ga: Tar éis don inneall an nód a shaoradh, ní thaispeánann an crann radharc iargúlta an sprite níos mó.
it: Dopo che il motore ha liberato il nodo, l'albero di scene remoto non mostra più lo sprite.
ja: エンジンがノードを解放すると、リモートシーンツリーにはスプライトが表示されなくなります。
ru: После того, как движок освободил узел, удаленное дерево сцены больше не отображает спрайт.
ta: எஞ்சின் முனையை விடுவித்த பிறகு, தொலை காட்சி மரம் இனி ச்ப்ரைட்டைக் காட்டாது.
uk: Після того як механізм звільнив вузол, дерево віддаленої сцени більше не відображає спрайт.
zh_tw: 當引擎釋放該節點後，遠端場景樹就不會再顯示這個精靈了。

source: You can alternatively call ``free()`` to immediately destroy the node. You should do this with care as any reference to it will instantly become ``null``. We recommend using ``queue_free()`` unless you know what you're doing.
ga: Is féidir leat glaoch ar ``free () ```` chun an nód a scriosadh láithreach. Ba chóir duit é seo a dhéanamh go cúramach mar go mbeidh aon tagairt dó láithreach ina ``null``. Molaimid ``queue_free () ``a úsáid mura bhfuil a fhios agat cad atá á dhéanamh agat.
it: In alternativa, si può chiamare ``free()`` per distruggere immediatamente il nodo. Prendi precauzioni però, perché qualsiasi riferimento ad esso diventerà immediatamente ``null``. Ti consigliamo di usare ``queue_free()`` a meno che tu non sappia cosa stai facendo.
ja: あるいは ``free()`` を呼び出してノードを即座に破棄することもできます。この参照は即座に ``null`` になるため、扱いに注意する必要があります。これが何をしているのかわからない場合は ``queue_free()`` を使用することをお勧めします。
ru: Вы также можете вызвать ``free()``, чтобы немедленно уничтожить узел. Делайте это с осторожностью, так как любая ссылка на него мгновенно станет ``null``. Рекомендуем использовать ``queue_free()``, если вы не уверены в своих действиях.
ta: உடனடியாக முனையை அழிக்க நீங்கள் மாற்றாக `` இலவச () `` என்று அழைக்கலாம். இதைப் பற்றிய எந்தவொரு குறிப்பும் உடனடியாக `` NULL`` ஆக மாறும் என்பதால் நீங்கள் இதை கவனமாக செய்ய வேண்டும். நீங்கள் என்ன செய்கிறீர்கள் என்று உங்களுக்குத் தெரியாவிட்டால் `` queue_free () `` ஐப் பயன்படுத்த பரிந்துரைக்கிறோம்.
uk: Ви також можете викликати ``free()``, щоб негайно знищити вузол. Ви повинні робити це обережно, оскільки будь-яке посилання на нього миттєво стане ``нульовим``. Ми рекомендуємо використовувати ``queue_free()``, якщо ви не знаєте, що робите.
zh_tw: 你也可以呼叫 ``free()`` 立即銷毀節點，但需謹慎使用，因為所有對該節點的參考會立即變成 ``null``。除非你確定這樣做沒問題，否則建議用 ``queue_free()``。

source: When you free a node, it also frees all its children. Thanks to this, to delete an entire branch of the scene tree, you only have to free the topmost parent node.
ga: Nuair a shaorann tú nód, saoraíonn sé a leanaí go léir freisin. A bhuíochas leis seo, chun brainse iomlán den chrann radhairc a scriosadh, ní gá duit ach an nód tuismitheora is barr a shaoradh.
it: Quando si libera un nodo, vengono liberati anche tutti i suoi figli. Grazie a questo, per eliminare un intero ramo dell'albero di scene, basta liberare solo il nodo padre più in alto.
ja: ノードを解放すると、そのノードのすべての子も解放されます。このおかげでシーンツリーのブランチ全体を削除するには、最上位の親ノードを解放するだけで済みます。
ru: При освобождении узла освобождаются и все его дочерние узлы. Благодаря этому, чтобы удалить всю ветвь дерева сцены, достаточно освободить только самый верхний родительский узел.
ta: நீங்கள் ஒரு முனையை விடுவிக்கும் போது, அது அதன் எல்லா குழந்தைகளையும் விடுவிக்கிறது. இதற்கு நன்றி, காட்சி மரத்தின் முழு கிளையையும் நீக்க, நீங்கள் பெற்றோர் முனையை மட்டுமே விடுவிக்க வேண்டும்.
uk: Коли ви звільняєте вузол, він також звільняє всіх своїх дітей. Завдяки цьому, щоб видалити цілу гілку дерева сцени, вам потрібно звільнити лише самий верхній батьківський вузол.
zh_tw: 釋放節點時也會同時釋放其所有子節點。因此，若要刪除場景樹的整個分支，只需釋放最上層的父節點即可。

source: Instancing scenes
ga: Radhairc inspreagtha
it: Istanziare scene
ja: シーンのインスタンス化
ru: Инстанцирование сцен
ta: நிறுவும் காட்சிகள்
uk: Інстансування сцени
zh_tw: 場景實體化
