Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/nodes_and_scene_instances.po
Languages: ga, it, ja, ru, ta, uk, zh_tw

source: Scenes are templates from which you can create as many reproductions as you'd like. This operation is called instancing, and doing it from code happens in two steps:
ga: Is teimpléid iad radhairc inar féidir leat an oiread atáirgí a chruthú agus is mian leat. Tugtar instancing ar an oibríocht seo, agus tarlaíonn sé é a dhéanamh ó chód i dhá chéim:
it: Le scene sono modelli da cui è possibile creare tutte le riproduzioni desiderate. Questa operazione è detta "istanziazione" e, tramite codice, avviene in due fasi:
ja: シーンは必要なだけ複製を作成できるいわゆるテンプレートです。この操作はインスタンス化と呼ばれ、コードからの実行は次の2つの順序で行われます。
ru: Сцены — это шаблоны, на основе которых можно создать столько копий, сколько нужно. Эта операция называется инстансингом и выполняется из кода в два этапа:
ta: காட்சிகள் நீங்கள் விரும்பும் அளவுக்கு இனப்பெருக்கங்களை உருவாக்கக்கூடிய வார்ப்புருக்கள். இந்த செயல்பாடு நிறுவனம் என்று அழைக்கப்படுகிறது, மேலும் குறியீட்டிலிருந்து அதைச் செய்வது இரண்டு படிகளில் நடக்கிறது:
uk: Сцени — це шаблони, з яких можна створити скільки завгодно репродукцій. Ця операція називається екземпляром, і її виконання з коду відбувається в два етапи:
zh_tw: 場景是可以重複產生多份副本的範本。這個動作稱為「實體化」，在程式碼中實體化場景需分兩個步驟：

source: Loading the scene from the local drive.
ga: An radharc á luchtú ón tiomáint áitiúil.
it: Caricare la scena dal disco locale.
ja: ローカルドライブからシーンをロードします。
ru: Загрузка сцены с локального диска.
ta: உள்ளக இயக்ககத்திலிருந்து காட்சியை ஏற்றுகிறது.
uk: Завантажуємо сцену з локального диска.
zh_tw: 從本地磁碟載入場景。

source: Creating an instance of the loaded :ref:`PackedScene <class_PackedScene>` resource.
ga: Is féidir leat tagairt do nód a fháil ach glaoch ar an modh :ref:`Node.get_node() <class_Node_method_get_node>`. Chun go n-oibreoidh sé seo, caithfidh sé nód an linbh a bheith i láthair sa chrann radhairc. Má fhaigheann tú é i bhfeidhm `` _ready()`` nód an tuismitheora ráthaítear é sin.
it: Creazione di un'istanza della risorsa :ref:`PackedScene <class_PackedScene>` caricata.
ja: ロードされた :ref:`PackedScene <class_PackedScene>` リソースのインスタンスを作成します。
ru: Создание экземпляра загруженного ресурса :ref:`PackedScene <class_PackedScene>`.
ta: ஏற்றப்பட்ட ஒரு உதாரணத்தை உருவாக்குதல்: ref: `பேக்ச்சீன் <class_packedScene>` வள.
uk: Створення екземпляра завантаженого ресурсу :ref:`PackedScene <class_PackedScene>`.
zh_tw: 將載入的 :ref:`PackedScene <class_PackedScene>` 資源產生實體。

source: Preloading the scene can improve the user's experience as the load operation happens when the compiler reads the script and not at runtime. This feature is only available with GDScript.
ga: Is féidir le réamh-luchtú an radharc eispéireas an úsáideora a fheabhsú mar a tharlaíonn an oibríocht ualaigh nuair a léann an tiomsaitheoir an script agus ní ag am rith. Níl an ghné seo ar fáil ach le GDScript.
it: Precaricare la scena può migliorare l'esperienza dell'utente, poiché l'operazione di caricamento avviene quando il compilatore legge lo script e non durante l'esecuzione. Questa funzionalità è disponibile solo con GDScript.
ja: シーンをプリロードすると、ロード操作は実行時ではなくコンパイラがスクリプトを読み取るときに実行されるため、ユーザー エクスペリエンスが向上します。この機能は GDScript でのみ使用できます。
ru: Предварительная загрузка сцены может улучшить пользовательский опыт, поскольку операция загрузки происходит при чтении скрипта компилятором, а не во время выполнения. Эта функция доступна только в GDScript.
ta: காட்சியை முன்பே ஏற்றுவது பயனரின் அனுபவத்தை மேம்படுத்தலாம், ஏனெனில் கம்பைலர் ச்கிரிப்டைப் படிக்கும்போது சுமை செயல்பாடு நிகழ்கிறது, இயக்க நேரத்தில் அல்ல. இந்த நற்பொருத்தம் GDSCRIPT உடன் மட்டுமே கிடைக்கிறது.
uk: Попереднє завантаження сцени може покращити роботу користувача, оскільки операція завантаження відбувається, коли компілятор читає сценарій, а не під час виконання. Ця функція доступна лише з GDScript.
zh_tw: 預先載入場景可以提升使用者體驗，因為載入動作會在編譯器讀取腳本時發生，而不是在執行階段才載入。這個功能僅支援 GDScript。

source: At that point, ``scene`` is a packed scene resource, not a node. To create the actual node, you need to call :ref:`PackedScene.instantiate() <class_PackedScene_method_instantiate>`. It returns a tree of nodes that you can use as a child of your current node.
ga: Ag an bpointe sin, acmhainn lánléargais é ``radharc``, ní nód. Chun an nód iarbhír a chruthú, ní mór duit glaoch a chur ar :ref:`PackedScene.instantiate() <class_PackedScene_method_instantiate>`. Filleann sé crann nóid is féidir leat a úsáid mar leanbh de do nód reatha.
it: A quel punto, ``scene`` è una risorsa scena impacchettata, non un nodo. Per creare il nodo effettivo, devi chiamare :ref:`PackedScene.instantiate() <class_PackedScene_method_instantiate>`. Restituisce un albero di nodi che puoi usare come figlio del tuo nodo attuale.
ja: その時点で ``scene`` はまだノードではなく、パックされたシーンのリソースです。実際のノードを作成するには、 :ref:`PackedScene.instantiate() <class_PackedScene_method_instantiate>` 関数を呼び出す必要があります。これにより現在のノードの子として使用できるノードのツリーが返されます。
ru: На этом этапе ``scene`` — это упакованный ресурс сцены, а не узел. Чтобы создать сам узел, необходимо вызвать метод :ref:`PackedScene.instantiate() <class_PackedScene_method_instantiate>`. Он возвращает дерево узлов, которое можно использовать как дочерний элемент текущего узла.
ta: அந்த நேரத்தில், `` காட்சி`` என்பது ஒரு நிரம்பிய காட்சி வளமாகும், ஒரு முனை அல்ல. உண்மையான முனையை உருவாக்க. இது உங்கள் தற்போதைய முனையின் குழந்தையாக நீங்கள் பயன்படுத்தக்கூடிய முனைகளின் மரத்தை வழங்குகிறது.
uk: У цей момент ``scene`` є ресурсом упакованої сцени, а не вузлом. Щоб створити власне вузол, вам потрібно викликати :ref:`PackedScene.instantiate() <class_PackedScene_method_instantiate>`. Він повертає дерево вузлів, яке ви можете використовувати як дочірнє до поточного вузла.
zh_tw: 此時，``scene`` 仍是一個打包場景資源，而不是節點。要建立實際的節點，需呼叫 :ref:`PackedScene.instantiate() <class_PackedScene_method_instantiate>`。這個方法會回傳一個節點樹，可以作為目前節點的子節點使用。

source: The advantage of this two-step process is you can keep a packed scene loaded and create new instances on the fly. For example, to quickly instance several enemies or bullets.
ga: Is é an buntáiste a bhaineann leis an bpróiseas dhá chéim seo ná gur féidir leat radharc pacáilte a choinneáil luchtaithe agus cásanna nua a chruthú ar an Mar shampla, chun roinnt naimhde nó piléar a chur chun cinn go tapa.
it: Il vantaggio di questo processo diviso in due parti è che si può mantenere la scena impacchettata caricata e creare istanze al volo. Ad esempio, per creare parecchi nemici o proiettili.
ja: この2段階のプロセスの利点は、パックされたシーンをロードしたままにして、その場で新しいインスタンスを作成できることです。たとえば複数の敵や弾丸を素早くインスタンス化します。
ru: Преимущество этого двухэтапного процесса в том, что вы можете держать сцену загруженной и создавать новые экземпляры «на лету». Например, чтобы быстро создать несколько экземпляров врагов или пуль.
ta: இந்த இரண்டு-படி செயல்முறையின் நன்மை என்னவென்றால், நீங்கள் ஒரு நிரம்பிய காட்சியை ஏற்றி, புதிய நிகழ்வுகளை பறக்கும்போது உருவாக்கலாம். எடுத்துக்காட்டாக, பல எதிரிகள் அல்லது தோட்டாக்களை விரைவாக உதாரணமாக.
uk: Перевага цього двоетапного процесу полягає в тому, що ви можете тримати упаковану сцену завантаженою та створювати нові екземпляри на льоту. Наприклад, щоб швидко інстантувати кілька ворогів або куль.
zh_tw: 這種兩步驟的方式好處是可以維持場景資源已載入的狀態，隨時快速產生新實體。例如可用於即時生成多個敵人或子彈。
