Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/overridable_functions.po
Languages: ga, it, ru, ta, uk, zh_tw

source: Overridable functions
ga: Feidhmeanna in-athshealbhaithe
it: Funzioni sovrascrivibili
ru: Переопределяемые функции
ta: மீறக்கூடிய செயல்பாடுகள்
uk: Переобумовленої функції
zh_tw: 可覆寫函式

source: Godot's Node class provides virtual functions you can override to update nodes every frame or on specific events, like when they enter the scene tree.
ga: Soláthraíonn rang Node Godot feidhmeanna fíorúla is féidir leat a athshlánú chun nóid a nuashonrú gach fráma nó ar imeachtaí ar leith, cosúil le nuair a théann siad isteach sa chrann radhairc.
it: La classe Node di Godot fornisce funzioni virtuali che è possibile sovrascrivere per aggiornare i nodi a ogni frame o in base a eventi specifici, ad esempio quando entrano nell'albero di scene.
ru: Класс Node в Godot предоставляет виртуальные функции, которые можно переопределить для обновления узлов в каждом кадре или при определенных событиях, например, когда они попадают в дерево сцены.
ta: கோடோட்டின் முனை வகுப்பு மெய்நிகர் செயல்பாடுகளை வழங்குகிறது, நீங்கள் ஒவ்வொரு சட்டகத்தையும் அல்லது குறிப்பிட்ட நிகழ்வுகளையும் புதுப்பிக்க மேலெழுதலாம்.
uk: Клас Node Godot надає віртуальні функції, які можна перевизначати, щоб оновлювати вузли кожного кадру або під час певних подій, наприклад, коли вони потрапляють у дерево сцен.
zh_tw: Godot 的 Node 類別提供可覆寫的虛擬函式，你可以透過這些函式在每個影格或特定事件（例如節點進入場景樹時）對節點進行更新。

source: This document presents the ones you'll use most often.
ga: Cuireann an doiciméad seo na cinn a úsáidfidh tú is minice i láthair.
it: Questo documento presenta quelli che utilizzerai più spesso.
ru: В этом документе представлены те из них, которые вы будете использовать чаще всего.
ta: இந்த ஆவணம் நீங்கள் அடிக்கடி பயன்படுத்துவதை வழங்குகிறது.
uk: У цьому документі представлені ті, якими ви будете користуватися найчастіше.
zh_tw: 本文件介紹你最常用到的這些函式。

source: Under the hood, these functions rely on Godot's low-level notifications system. To learn more about it, see :ref:`doc_godot_notifications`.
ga: Faoin gcochall, braitheann na feidhmeanna seo ar chóras fógraí leibhéal íseal Godot. Chun tuilleadh eolais a fhoghlaim faoi, féach:ref: `doc_godot_notifications`.
it: In realtà, queste funzioni si basano sul sistema di notifiche di basso livello di Godot. Per saperne di più, consulta :ref:`doc_godot_notifications`.
ru: По сути, эти функции используют низкоуровневую систему уведомлений Godot. Подробнее о ней см. :ref:`doc_godot_notifications`.
ta: ஊட்டின் கீழ், இந்த செயல்பாடுகள் கோடோட்டின் குறைந்த அளவிலான அறிவிப்புகள் முறையை நம்பியுள்ளன. இதைப் பற்றி மேலும் அறிய, காண்க: ref: `doc_godot_notifications`.
uk: Під капотом ці функції покладаються на низькорівневу систему сповіщень Godot. Щоб дізнатися більше про це, перегляньте :ref:`doc_godot_notifications`.
zh_tw: 這些函式在底層是依靠 Godot 的通知系統運作。想進一步瞭解，請參閱 :ref:`doc_godot_notifications`。

source: Two functions allow you to initialize and get nodes besides the class's constructor: ``_enter_tree()`` and ``_ready()``.
ga: Ligeann dhá fheidhm duit nóid a thosú agus a fháil seachas tógálaí an ranga: ``_enter_tree () ``agus ``_ready ()``.
it: Due funzioni consentono di inizializzare e ottenere nodi, oltre al costruttore della classe: ``_enter_tree()`` e ``_ready()``.
ru: Помимо конструктора класса, инициализировать и получать узлы позволяют две функции: ``_enter_tree()`` и ``_ready()``.
ta: இரண்டு செயல்பாடுகள் வகுப்பின் கட்டமைப்பாளரைத் தவிர்த்து முனைகளைத் துவக்கி பெற அனுமதிக்கின்றன: `` _Enter_tree () `` மற்றும் `_ _ready ()` `.
uk: Дві функції дозволяють ініціалізувати та отримувати вузли, крім конструктора класу: ``_enter_tree()`` і ``_ready()``.
zh_tw: 除了類別的建構子外，還有兩個函式可用來初始化並取得節點：``_enter_tree()`` 與 ``_ready()``。

source: When the node enters the Scene Tree, it becomes active and the engine calls its ``_enter_tree()`` method. That node's children may not be part of the active scene yet. As you can remove and re-add nodes to the scene tree, this function may be called multiple times throughout a node's lifetime.
ga: Nuair a théann an nód isteach sa Chrann Radhairc, éiríonn sé gníomhach agus glaonn an t-inneall ar a mhodh ``_enter_tree () ``. B'fhéidir nach bhfuil leanaí an nód sin mar chuid den radharc gníomhach fós. Toisc gur féidir leat nóid a bhaint agus a athchur leis an gcrann radhairc, féadfar an fheidhm seo a ghlaoch arís agus arís eile ar feadh saolré nód.
it: Quando il nodo entra nell'albero di scene, diventa attivo e il motore chiama il suo metodo ``_enter_tree()``. I nodi figlio di quel nodo potrebbero non far ancora parte della scena attiva. Poiché è possibile rimuovere e riaggiungere nuovamente nodi all'albero di scene, questa funzione potrebbe essere richiamata più volte durante il ciclo di vita di un nodo.
ru: Когда узел попадает в дерево сцены, он становится активным, и движок вызывает его метод ``_enter_tree()``. Дочерние элементы этого узла могут ещё не быть частью активной сцены. Поскольку узлы можно удалять и добавлять заново в дерево сцены, эта функция может вызываться несколько раз в течение жизненного цикла узла.
ta: முனை காட்சி மரத்திற்குள் நுழையும் போது, அது செயலில் மாறி, இயந்திரம் அதன் `_ enter_tree ()` `முறை என்று அழைக்கிறது. அந்த முனையின் குழந்தைகள் இன்னும் செயலில் உள்ள காட்சியின் ஒரு பகுதியாக இருக்கக்கூடாது. காட்சி மரத்திற்கு நீங்கள் முனைகளை அகற்றி மீண்டும் சேர்க்க முடியும் என்பதால், இந்த செயல்பாடு ஒரு முனையின் வாழ்நாள் முழுவதும் பல முறை அழைக்கப்படலாம்.
uk: Коли вузол потрапляє в дерево сцен, він стає активним, і механізм викликає його метод ``_enter_tree()``. Дочірні елементи цього вузла можуть ще не бути частиною активної сцени. Оскільки ви можете видаляти та повторно додавати вузли до дерева сцени, цю функцію можна викликати кілька разів протягом життя вузла.
zh_tw: 當節點進入場景樹時，會變為啟用狀態，且引擎會呼叫其 ``_enter_tree()`` 方法。此時該節點的子節點可能還不是活動場景的一部分。由於你可以隨時將節點移除並重新加回場景樹，因此這個函式在節點的生命週期中可能被呼叫多次。

source: Most of the time, you'll use ``_ready()`` instead. This function is called only once in a node's lifetime, after ``_enter_tree()``. ``_ready()`` ensures that all children have entered the scene tree first, so you can safely call ``get_node()`` on them.
ga: An chuid is mó den am, úsáidfidh tú ``_ready () ``ina ionad. Ní thugtar an fheidhm seo ach uair amháin i saol nód, tar éis ``_enter_tree () ``. Cinntíonn ``_ready () ``go bhfuil gach páiste isteach sa chrann radhairc ar dtús, ionas gur féidir leat glaoch ar ``get_node ()`` orthu go sábháilte.
it: La maggior parte delle volte, userai invece ``_ready()``. Questa funzione viene chiamata solo una volta nel ciclo di vita di un nodo, dopo ``_enter_tree()``. ``_ready()`` garantisce che tutti i nodi figlio siano entrati per primi nell'albero di scene, quindi puoi chiamare ``get_node()`` su di essi in tutta sicurezza.
ru: В большинстве случаев вместо этого вы будете использовать ``_ready()``. Эта функция вызывается только один раз за время существования узла, после ``_enter_tree()``. ``_ready()`` гарантирует, что все дочерние элементы первыми вошли в дерево сцены, поэтому вы можете безопасно вызвать для них ``get_node()``.
ta: பெரும்பாலான நேரங்களில், நீங்கள் அதற்கு பதிலாக `` _ ரெடி () `` பயன்படுத்துவீர்கள். இந்த செயல்பாடு ஒரு முனையின் வாழ்நாளில் ஒரு முறை மட்டுமே அழைக்கப்படுகிறது, `_ enter_tree ()` `. `` _ ரெடி () `` எல்லா குழந்தைகளும் முதலில் காட்சி மரத்தில் நுழைந்ததை உறுதி செய்கிறது, எனவே நீங்கள் பாதுகாப்பாக `` get_node () `` அவர்கள் மீது அழைக்கலாம்.
uk: У більшості випадків замість цього ви використовуєте ``_ready()``. Ця функція викликається лише один раз за час існування вузла, після ``_enter_tree()``. ``_ready()`` гарантує, що всі дочірні елементи першими увійшли до дерева сцен, тому ви можете безпечно викликати ``get_node()`` для них.
zh_tw: 多數情況下你會使用 ``_ready()``。此函式只會在節點生命週期中被呼叫一次，且發生在 ``_enter_tree()`` 之後。``_ready()`` 可以保證所有子節點都已進入場景樹，因此你可以安全地對它們呼叫 ``get_node()``。

source: To learn more about getting node references, read :ref:`doc_nodes_and_scene_instances`.
ga: Chun tuilleadh a fhoghlaim faoi thagairtí nód a fháil, léi:ref: `doc_nodes_and_scene_instances`.
it: Per saperne di più su come ottenere riferimenti ai nodi, leggere :ref:`doc_nodes_and_scene_instances`.
ru: Чтобы узнать больше о получении ссылок на узлы, прочитайте :ref:`doc_nodes_and_scene_instances`.
ta: முனை குறிப்புகளைப் பெறுவது பற்றி மேலும் அறிய, படிக்க: குறிப்பு: `doc_nodes_and_scene_instances`.
uk: Щоб дізнатися більше про отримання посилань на вузли, прочитайте :ref:`doc_nodes_and_scene_instances`.
zh_tw: 如需瞭解更多關於取得節點參照的內容，請閱讀 :ref:`doc_nodes_and_scene_instances`。

source: Another related callback is ``_exit_tree()``, which the engine calls every time a node is about to exit the scene tree. This can be when you call :ref:`Node.remove_child() <class_Node_method_remove_child>` or when you free a node.
ga: Aisghlaoch gaolmhar eile is ea ``_exit_tree()``, a ghlaonn an t-inneall air gach uair a bhíonn nód ar tí imeacht ón gcrann radhairc. Féadfaidh sé seo tarlú nuair a ghlaonn tú :ref:`Node.remove_child() <class_Node_method_remove_child>` nó nuair a shaorann tú nód.
it: Un altro callback correlato è ``_exit_tree()``, che il motore richiama ogni volta che un nodo sta per uscire dall'albero di scene. Questo può avvenire quando si chiama :ref:`Node.remove_child() <class_Node_method_remove_child>` o quando si libera un nodo.
ru: Другой связанный обратный вызов — ``_exit_tree()``, который движок вызывает каждый раз, когда узел собирается покинуть дерево сцены. Это может происходить при вызове :ref:`Node.remove_child() <class_Node_method_remove_child>` или при освобождении узла.
ta: மற்றொரு தொடர்புடைய அழைப்பு `` _exit_tree () ``, இது ஒவ்வொரு முறையும் ஒரு முனை காட்சி மரத்திலிருந்து வெளியேறப் போகும் போது இயந்திரம் அழைக்கிறது. நீங்கள் அழைக்கும்போது இது இருக்கலாம்: ref: `node.remove_child () <class_node_method_remove_child>` அல்லது நீங்கள் ஒரு முனையை விடுவிக்கும் போது.
uk: Інший пов’язаний зворотний виклик — це ``_exit_tree()``, який движок викликає кожного разу, коли вузол збирається вийти з дерева сцени. Це може бути, коли ви викликаєте :ref:`Node.remove_child() <class_Node_method_remove_child>` або коли ви звільняєте вузол.
zh_tw: 另一個相關的回呼函式是 ``_exit_tree()``，引擎會在節點即將離開場景樹時呼叫它。這可能發生於你呼叫 :ref:`Node.remove_child() <class_Node_method_remove_child>` 或釋放節點時。

source: The two virtual methods ``_process()`` and ``_physics_process()`` allow you to update the node, every frame and every physics frame respectively. For more information, read the dedicated documentation: :ref:`doc_idle_and_physics_processing`.
ga: Ligeann an dá mhodh fíorúil ``_process () ``agus ``_physics_process ()`` duit an nód, gach fráma agus gach fráma fisice a nuashonrú faoi seach. Le haghaidh tuilleadh faisnéise, léigh an doiciméadú tiomnaithe: :ref: `doc_idle_and_physics_processing`.
it: I due metodi virtuali ``_process()`` e ``_physics_process()`` consentono di aggiornare il nodo, a ogni frame e a ogni frame di fisica, rispettivamente. Per maggiori informazioni, consulta la documentazione dedicata: :ref:`doc_idle_and_physics_processing`.
ru: Два виртуальных метода ``_process()`` и ``_physics_process()`` позволяют обновлять узел, каждый кадр и каждый кадр физики соответственно. Подробнее см. в специальной документации: :ref:`doc_idle_and_physics_processing`.
ta: இரண்டு மெய்நிகர் முறைகள் `` _PROCESS () `` மற்றும் `_ _Physics_Process ()` `முறையே முனை, ஒவ்வொரு சட்டகம் மற்றும் ஒவ்வொரு இயற்பியல் சட்டத்தையும் புதுப்பிக்க உங்களை அனுமதிக்கின்றன. மேலும் தகவலுக்கு, பிரத்யேக ஆவணங்களைப் படியுங்கள் :: குறிப்பு: `doc_idle_and_physics_processing`.
uk: Два віртуальних методи ``_process()`` і ``_physics_process()`` дозволяють оновлювати вузол, кожен кадр і кожен кадр фізики відповідно. Для отримання додаткової інформації прочитайте спеціальну документацію: :ref:`doc_idle_and_physics_processing`.
zh_tw: 虛擬函式 ``_process()`` 與 ``_physics_process()`` 分別讓你在每個影格或每個物理影格對節點進行更新。更多資訊請參閱專門文件：:ref:`doc_idle_and_physics_processing`。

source: Two more essential built-in node callback functions are :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` and :ref:`Node._input() <class_Node_private_method__input>`, which you use to both receive and process individual input events. The ``_unhandled_input()`` method receives every key press, mouse click, etc. that have not been handled already in an ``_input()`` callback or in a user interface component. You want to use it for gameplay input in general. The ``_input()`` callback allows you to intercept and process input events before ``_unhandled_input()`` gets them.
ga: Is iad dhá fheidhm aisghlao nód ionsuite eile atá riachtanach ná :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` agus :ref:`Node._input() <class_Node_private_method_input>`, a úsáideann tú chun imeachtaí ionchuir aonair a fháil agus a phróiseáil. Faigheann an modh `` _unhandled_input()`` gach eochairbhrú, cliceáil luiche, etc. nár láimhseáladh cheana féin i `` _input()`` aisghlao nó i gcomhpháirt comhéadan úsáideora. Ba mhaith leat é a úsáid le haghaidh ionchur gameplay i gcoitinne. Ligeann an aisghlao `` _input()`` duit teagmhais ionchuir a thascradh agus a phróiseáil sula bhfaigheann `` _input_unhandled()`` iad.
it: Altre due funzioni di callback integrate essenziali per i nodi sono :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` e :ref:`Node._input() <class_Node_private_method__input>`, che servono sia per ricevere sia per elaborare i singoli eventi di input. Il metodo ``_unhandled_input()`` riceve ogni pressione di tasto, clic del mouse, ecc. che non siano già stati gestiti in un callback ``_input()`` o in un componente dell'interfaccia utente. È consigliabile utilizzarlo per gli input durante il gameplay in generale. Il callback ``_input()`` consente di intercettare ed elaborare gli eventi di input prima che siano ricevuti da ``_unhandled_input()``.
ru: Две другие важные встроенные функции обратного вызова узла — это :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` и :ref:`Node._input() <class_Node_private_method__input>`, которые используются для получения и обработки отдельных событий ввода. Метод ``_unhandled_input()`` принимает каждое нажатие клавиши, щелчок мыши и т. д., которые ещё не были обработаны в функции обратного вызова ``_input()`` или в компоненте пользовательского интерфейса. Вы хотите использовать его для ввода в игровом процессе в целом. Функция обратного вызова ``_input()`` позволяет перехватывать и обрабатывать события ввода до того, как их получит ``_unhandled_input()``.
ta: இன்னும் இரண்டு அத்தியாவசிய உள்ளமைக்கப்பட்ட முனை கால்பேக் செயல்பாடுகள்: ref: `node._unhandled_input () <class_node_private_method__unhandled_input>` மற்றும்: ref: `node._input () <class_node_private_method__input>`, இரண்டையும் பெறுவது மற்றும் செயலாக்குதல். `` _Unhandled_input () `` முறை ஒவ்வொரு முக்கிய செய்தித் தாள், மவுச் சொடுக்கு போன்றவற்றைப் பெறுகிறது. பொதுவாக விளையாட்டு உள்ளீட்டிற்கு இதைப் பயன்படுத்த விரும்புகிறீர்கள். `` _Input () `` கால்பேக் `_ _unhandled_input ()` `அவற்றைப் பெறுவதற்கு முன்பு உள்ளீட்டு நிகழ்வுகளை இடைமறிக்கவும் செயலாக்கவும் உங்களை அனுமதிக்கிறது.
uk: Ще дві важливі вбудовані функції зворотного виклику вузла: :ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` і :ref:`Node._input() <class_Node_private_method__input>`, які ви використовуєте як для отримання, так і для обробки окремих вхідних подій. Метод ``_unhandled_input()`` отримує кожне натискання клавіші, клацання мишею тощо, які ще не були оброблені у зворотному виклику ``_input()`` або в компоненті інтерфейсу користувача. Ви хочете використовувати його для введення в ігровий процес загалом. Зворотний виклик ``_input()`` дозволяє вам перехоплювати та обробляти події введення до того, як ``_unhandled_input()`` їх отримає.
zh_tw: 還有兩個非常重要的內建節點回呼函式：:ref:`Node._unhandled_input() <class_Node_private_method__unhandled_input>` 與 :ref:`Node._input() <class_Node_private_method__input>`，你可以用來接收並處理各種輸入事件。``_unhandled_input()`` 會接收所有尚未被 ``_input()`` 回呼或 UI 元件處理過的鍵盤、滑鼠等事件，通常用於遊戲流程中對玩家輸入的反應。而 ``_input()`` 則可以在這些事件傳遞給 ``_unhandled_input()`` 之前攔截並處理它們。

source: To learn more about inputs in Godot, see the :ref:`Input section <toc-learn-features-inputs>`.
ga: Chun tuilleadh a fhoghlaim faoi ionchuir in Godot, féach an :ref:`Rannán ionchuir <toc-learn-features-inputs>`.
it: Per saperne di più sugli input in Godot, vedi la :ref:`sezione Input <toc-learn-features-inputs>`.
ru: Дополнительную информацию о входных данных в Godot см. в разделе :ref:`Input section <toc-learn-features-inputs>`.
ta: கோடோட்டில் உள்ளீடுகளைப் பற்றி மேலும் அறிய, இதைக் காண்க: ref: `உள்ளீட்டு பிரிவு <TOC-LEARN-FEATURES-INPUTS>`.
uk: Щоб дізнатися більше про введення в Godot, перегляньте :ref:`розділ введення <toc-learn-features-inputs>`.
zh_tw: 想進一步瞭解 Godot 輸入系統，請參閱 :ref:`輸入章節 <toc-learn-features-inputs>`。

source: There are some more overridable functions like :ref:`Node._get_configuration_warnings() <class_Node_private_method__get_configuration_warnings>`. Specialized node types provide more callbacks like :ref:`CanvasItem._draw() <class_CanvasItem_private_method__draw>` to draw programmatically or :ref:`Control._gui_input() <class_Control_private_method__gui_input>` to handle clicks and input on UI elements.
ga: Tá roinnt feidhmeanna sáraithe eile cosúil le :ref:`Node._get_configuration_warnings() <class_Node_private_method__get_configuration_warnings>`. Soláthraíonn cineálacha sainnóid tuilleadh aisghlaonna mar :ref:`CanvasItem._draw() <class_CanvasItem_private_method__draw>` chun tarraingt go ríomhchláraithe nó :ref:`Control._gui_input() <class_Control_private_method_gui_input>` chun cliceáil agus ionchur ar eilimintí UI a láimhseáil.
it: Ci sono altre funzioni sovrascrivibili come :ref:`Node._get_configuration_warnings() <class_Node_private_method__get_configuration_warnings>`. I tipi di nodo specializzati forniscono più callback, come :ref:`CanvasItem._draw() <class_CanvasItem_private_method__draw>` per disegnare tramite codice o :ref:`Control._gui_input() <class_Control_private_method__gui_input>` per gestire clic e input sugli elementi dell'interfaccia utente.
ru: Есть ещё несколько переопределяемых функций, например: :ref:`Node._get_configuration_warnings() <class_Node_private_method__get_configuration_warnings>`. Специализированные типы узлов предоставляют больше обратных вызовов, например: :ref:`CanvasItem._draw() <class_CanvasItem_private_method__draw>` для программного рисования или :ref:`Control._gui_input() <class_Control_private_method__gui_input>` для обработки щелчков и ввода на элементах пользовательского интерфейса.
ta: இன்னும் சில மீறக்கூடிய செயல்பாடுகள் உள்ளன: குறிப்பு: `முனை. சிறப்பு முனை வகைகள் போன்ற கூடுதல் கால்பேக்குகளை வழங்குகின்றன: Ref: `canvasitem._draw () <class_canvasitem_private_method__draw>` நிரல் ரீதியாக வரைய அல்லது: ref: `control.
uk: Є ще деякі функції, які можна замінити, наприклад :ref:`Node._get_configuration_warnings() <class_Node_private_method__get_configuration_warnings>`. Спеціалізовані типи вузлів забезпечують більше зворотних викликів, наприклад :ref:`CanvasItem._draw() <class_CanvasItem_private_method__draw>` для програмного малювання або :ref:`Control._gui_input() <class_Control_private_method__gui_input>` для обробки клацань і введення в елементи інтерфейсу користувача.
zh_tw: 還有一些其他可覆寫的函式，例如 :ref:`Node._get_configuration_warnings() <class_Node_private_method__get_configuration_warnings>`。特定節點型別也會提供更多回呼，例如 :ref:`CanvasItem._draw() <class_CanvasItem_private_method__draw>` 可用於程式化繪圖，或 :ref:`Control._gui_input() <class_Control_private_method__gui_input>` 用來處理 UI 元素上的點擊與輸入。
