Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/scene_unique_nodes.po
Languages: ga, it, ja, ru, ta, uk, zh_cn, zh_hant

source: :ref:`Node.find_child() <class_Node_method_find_child>` finds a node by name without knowing its full path. This seems similar to a scene unique node, but this method is able to find nodes in nested scenes, and doesn't require marking the node in the scene editor in any way. However, this method is slow. Scene unique nodes are cached by Godot and are fast to retrieve, but each time the method is called, ``find_child()`` needs to check every descendant (every child, grandchild, and so on).
ga: :ref:`Node.find_child() <class_Node_method_find_child>` aimsíonn nód de réir ainm gan fios a chonair iomlán. Is cosúil go bhfuil sé seo cosúil le nód radharc uathúil, ach tá an modh seo in ann nóid a aimsiú i radhairc neadaithe, agus ní gá an nód a mharcáil in eagarthóir an radhairc ar bhealach ar bith. Mar sin féin, tá an modh seo mall. Déanann Godot nóid uathúla radhairc a thaisceadh ag Godot agus is féidir iad a aisghabháil go tapa, ach gach uair a thugtar an modh, caithfidh ``find_child()`` seiceáil a dhéanamh ar gach sliocht (gach leanbh, garchlann, agus mar sin de).
it: :ref:`Node.find_child() <class_Node_method_find_child>` trova un nodo per nome senza conoscerne il percorso completo. Sembra simile a un nodo univoco, ma questo metodo è in grado di trovare nodi in scene annidate e non richiede in alcun modo di segnare il nodo nell'editor di scene. Tuttavia, questo metodo è lento. I nodi univoci delle scene sono memorizzati nella cache da Godot e sono veloci da recuperare, ma ogni volta che il metodo viene chiamato, ``find_child()`` deve verificare ogni discendente (ogni figlio, nipote e così via).
ja: :ref:`Node.find_child() <class_Node_method_find_child>` はフルパスを知らなくても名前でノードを検索します。これはシーン固有のノードに似ているように見えますが、この方法はネストされたシーン内の深い所のノードも見つけることができ、シーンエディタでノードをマークする必要はまったくありません。ただしこの方法は時間がかかります。シーン固有のノードはGodotによってキャッシュされ高速に取得できますが、 ``find_child()`` はメソッドが呼び出されるたびにすべての子孫 (すべての子、孫など) をチェックする必要があります。
ru: :ref:`Node.find_child() <class_Node_method_find_child>` находит узел по имени, не зная его полного пути. Это похоже на уникальный узел сцены, но этот метод может находить узлы во вложенных сценах и не требует какой-либо пометки узла в редакторе сцен. Однако этот метод медленный. Уникальные узлы сцены кэшируются Godot и быстро извлекаются, но при каждом вызове метода ``find_child()`` необходимо проверить каждого потомка (каждого дочернего элемента, каждого внучатого элемента и так далее).
ta: . இது ஒரு காட்சி தனித்துவமான முனைக்கு ஒத்ததாகத் தோன்றுகிறது, ஆனால் இந்த முறை உள்ளமைக்கப்பட்ட காட்சிகளில் முனைகளைக் கண்டுபிடிக்க முடியும், மேலும் காட்சி எடிட்டரில் உள்ள முனையை எந்த வகையிலும் குறிக்க தேவையில்லை. இருப்பினும், இந்த முறை மெதுவாக உள்ளது. காட்சி தனித்துவமான முனைகள் கோடோட்டால் தற்காலிகமாக சேமிக்கப்படுகின்றன, மேலும் அவை மீட்டெடுக்க வேகமாக இருக்கும், ஆனால் ஒவ்வொரு முறையும் முறை அழைக்கப்படும் போது, `` find_child () `` ஒவ்வொரு வழித்தோன்றலையும் (ஒவ்வொரு குழந்தை, பேரக்குழந்தையும், மற்றும் பல) சரிபார்க்க வேண்டும்.
uk: :ref:`Node.find_child() <class_Node_method_find_child>` знаходить вузол за назвою, не знаючи його повного шляху. Здається, це схоже на унікальний вузол сцени, але цей метод може знаходити вузли у вкладених сценах і не вимагає жодного позначення вузла в редакторі сцени. Однак цей спосіб повільний. Унікальні вузли сцени кешуються Годо, і їх швидко отримати, але кожного разу, коли викликається метод, ``find_child()`` має перевірити кожного нащадка (кожну дитину, онука тощо).
zh_cn: :ref:`Node.find_child() <class_Node_method_find_child>` 可以根据名称来查找节点，无需知道完整路径。这种做法看上去和场景唯一节点类似，并且可以查找到嵌套场景里的节点，也不需要在场景编辑器里标记节点。但是这个方法相对较慢。Godot 会缓存场景唯一节点，所以获取的时候比较快，而调用 ``find_child()`` 时则需要查找每一个后代节点（子节点、孙节点等）。
zh_hant: :ref:`Node.find_child() <class_Node_method_find_child>` 可以透過名稱找到節點，而不需要知道完整路徑。這看似和場景唯一節點類似，但它能找到巢狀場景中的節點，而且不需在場景編輯器中特別標記。不過這個方法較慢，因為 Godot 會快取場景唯一節點、查找速度快，但每次呼叫 ``find_child()`` 時都必須檢查所有子代（每個孩子、孫節點等）。

source: Translation status
zh_cn: 翻译状态
