Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/scene_unique_nodes.po
Languages: ga, it, ja, ru, ta, uk, zh_cn, zh_hant

source: Scene Unique Nodes
ga: Nóid Uathúla Radharc
it: Nodi univoci di scena
ja: シーン固有ノード
ru: Уникальные Узлы Сцены
ta: தனித்துவமான முனைகள் காட்சி
uk: Унікальні вузли сцени
zh_cn: 场景唯一节点
zh_hant: 場景唯一節點

source: Introduction
ga: Réamhrá
it: Introduzione
ja: はじめに
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_cn: 前言
zh_hant: 前言

source: Using ``get_node()`` to reference nodes from a script can sometimes be fragile. If you move a button in a UI scene from one panel to another, the button's node path changes, and if a script uses ``get_node()`` with a hard-coded node path, the script will not be able to find the button anymore.
ga: Is féidir le ``get_node () ``a úsáid chun nóid tagartha ó script a bheith leochaileach uaireanta. Má bhogann tú cnaipe i radharc Chomhéadain ó phainéal amháin go painéal eile, athraíonn cosán nód an chnaipe, agus má úsáideann script ``get_node () `le cosán nód crua-chódaithe, ní bheidh an script in ann an cnaipe a aimsiú níos mó.
ja: ``get_node()`` を使用してスクリプトからノードを参照するコードは壊れやすい可能性があります。 たとえばUIシーン内のボタンをあるパネルから別のパネルに移動すると、ボタンのノードパスが変更されます。スクリプトではハードコーディングされたノードパスで ``get_node()`` しているため、スクリプトはそのボタンを見つけることができなくなります。
ru: Использование ``get_node()`` для ссылки на узлы из скрипта иногда может быть ненадёжным. При перемещении кнопки в сцене пользовательского интерфейса с одной панели на другую путь к узлу кнопки изменится, а если скрипт использует ``get_node()`` с жёстко заданным путём к узлу, скрипт больше не сможет найти кнопку.
ta: ச்கிரிப்டிலிருந்து முனைகளைக் குறிப்பிட `` get_node () `` பயன்படுத்துவது சில நேரங்களில் உடையக்கூடியதாக இருக்கும். ஒரு இடைமுகம் காட்சியில் ஒரு பொத்தானை ஒரு பேனலில் இருந்து இன்னொரு பேருக்கு நகர்த்தினால், பொத்தானின் முனை பாதை மாறுகிறது, மேலும் ஒரு ச்கிரிப்ட் `` get_node () `` கடின குறியிடப்பட்ட முனை பாதையுடன் பயன்படுத்தினால், ச்கிரிப்ட் கண்டுபிடிக்க முடியாது இனி பொத்தான்.
uk: Використання ``get_node()`` для посилання на вузли зі сценарію іноді може бути крихким. Якщо ви переміщуєте кнопку в сцені інтерфейсу користувача з однієї панелі на іншу, шлях до вузла кнопки змінюється, і якщо сценарій використовує ``get_node()`` із жорстко закодованим шляхом до вузла, сценарій не зможе знайти кнопка більше.
zh_cn: 在脚本中使用 ``get_node()`` 来引用节点在某些情况下可能比较脆弱。如果你把 UI 场景里的某个按钮移到了别的面板里，那么这个按钮的节点路径就会发生改变，而如果脚本中正好使用了写死的节点路径来调用 ``get_node()``\ ，那这样一来这个脚本就无法再找到这个按钮了。
zh_hant: 使用 ``get_node()`` 在腳本中引用節點有時會很脆弱。如果你將 UI 場景中的按鈕從一個面板移動到另一個面板，按鈕的節點路徑就會改變。如果腳本使用硬編碼的節點路徑來呼叫 ``get_node()``，那麼腳本將無法再找到該按鈕。

source: In situations like this, the node can be turned into a scene unique node to avoid having to update the script every time the node's path is changed.
ga: I gcásanna mar seo, is féidir an nód a iompú ina nód uathúil radhairc chun a sheachaint go gcaithfear an script a nuashonrú gach uair a athraítear cosán an nód.
ja: このような状況では、特定のノードをシーン固有ノードに変えることで、そのノードのパスが変更されるたびにスクリプトを更新する必要を回避できます。
ru: В подобных ситуациях узел можно превратить в уникальный узел сцены, чтобы избежать необходимости обновлять скрипт каждый раз при изменении пути к узлу.
ta: இது போன்ற சூழ்நிலைகளில், ஒவ்வொரு முறையும் முனையின் பாதை மாற்றப்படும் போது ச்கிரிப்டைப் புதுப்பிப்பதைத் தவிர்ப்பதற்காக முனை தனித்துவமான முனையாக மாற்றப்படலாம்.
uk: У подібних ситуаціях вузол можна перетворити на унікальний вузол сцени, щоб уникнути необхідності оновлювати сценарій кожного разу, коли шлях вузла змінюється.
zh_cn: 类似这种情况，可以将节点设为场景唯一节点，这样该节点的路径发生变化时就不必再更新脚本了。
zh_hant: 在這種情況下，可以將該節點設為場景唯一節點，這樣每次節點路徑改變時，就不用再去更新腳本。

source: Creation and usage
ga: Cruthú agus úsáid
it: Creazione e utilizzo
ja: シーン固有ノードの作り方
ru: Создание и использование
ta: படைப்பு மற்றும் பயன்பாடு
uk: Створення та використання
zh_cn: 创建与使用
zh_hant: 建立與使用

source: There are two ways to create a scene unique node.
it: Ci sono due modi per creare un nodo univoco di scena.
ru: Создать уникальный узел сцены можно двумя способами.
zh_hant: 有兩種方式可以建立場景唯一節點。

source: In the Scene tree dock, right-click on a node and select **Access as Unique Name** in the context menu.
ga: Sa duga crann Radhairc, cliceáil ar dheis ar nód agus roghnaigh **Rochtain mar Ainm Uathúl** sa roghchlár comhthéacs.
ja: シーンツリードックでノードを右クリックし、コンテキストメニューから **固有名でアクセス** を選択します。
ru: В дереве Сцены щелкните правой кнопкой мыши по узлу и выберите в контекстном меню пункт **Доступ как уникальное имя**.
ta: காட்சி மரக் கப்பல்துறையில், ஒரு முனையில் வலது சொடுக்கு செய்து, சூழல் பட்டியலில் ** அணுகலை தனித்துவமான பெயராக ** என்பதைத் தேர்ந்தெடுக்கவும்.
uk: У панелі дерева сцени клацніть вузол правою кнопкою миші та виберіть у контекстному меню **Доступ як унікальне ім’я**.
zh_cn: 在场景树面板中，右键单击节点并在上下文菜单中选择\ **作为唯一名称访问**\ 。
zh_hant: 在場景樹面板中，於節點上點擊右鍵，並在右鍵選單選擇 **作為唯一名稱存取**。

source: After selecting the option, the node will now have a percent symbol (**%**) next to its name in the scene tree:
ga: Tar éis an rogha a roghnú, beidh siombail faoin gcéad (**%**) ag an nód anois in aice lena ainm sa chrann radhairc:
ja: 固有名でアクセスを選択すると、シーンツリー内のノード名の横にパーセント記号 (**%**) が表示されます。
ru: После выбора этой опции рядом с именем узла в дереве сцены появится символ процента (**%**):
ta: விருப்பத்தைத் தேர்ந்தெடுத்த பிறகு, முனை இப்போது காட்சி மரத்தில் அதன் பெயருக்கு அடுத்ததாக ஒரு விழுக்காடு அடையாளம் (**%**) இருக்கும்:
uk: Після вибору параметра вузол тепер матиме символ відсотка (**%**) біля свого імені в дереві сцени:
zh_cn: 勾选后，场景树中该节点的名称旁边就会显示一个百分号（\ **%**\ ）：
zh_hant: 選擇此選項後，該節點在場景樹中的名稱旁邊會出現百分號（**%**）：

source: You can also do this while renaming the node by adding "%" to the beginning of the name. Once you confirm, the percent symbol will appear next to its name.
ru: Вы также можете сделать это при переименовании узла, добавив "%" в начало имени. После подтверждения рядом с именем появится символ процента.
zh_hant: 你也可以在重新命名節點時，於名稱開頭加上「%」來達成。確認後，名稱旁邊會自動顯示百分號。

source: You can now use the node in your script. For example, you can reference it with a ``get_node()`` method call by typing the % symbol, followed by the node's name:
ga: Is féidir leat an nód i do script a úsáid anois. Mar shampla, is féidir leat tagairt a dhéanamh dó le glao modh ``get_node () ``tríd an tsiombail% a chlóscríobh, agus ainm an nód ina dhiaidh sin:
ja: これでスクリプト内で固有ノードを使用できるようになります。たとえば ``get_node()`` メソッド呼び出しで % 記号を入力し、その後にノード名を入力することで固有ノードを参照できます。
ru: Теперь вы можете использовать узел в своём скрипте. Например, вы можете обратиться к нему с помощью вызова метода ``get_node()``, введя символ % и имя узла:
ta: நீங்கள் இப்போது உங்கள் ச்கிரிப்டில் உள்ள முனையைப் பயன்படுத்தலாம். எடுத்துக்காட்டாக, % குறியீட்டைத் தட்டச்சு செய்வதன் மூலம் `` get_node () `` முறை அழைப்பு மூலம் அதை நீங்கள் குறிப்பிடலாம், அதைத் தொடர்ந்து முனையின் பெயர்:
uk: Тепер ви можете використовувати вузол у своєму сценарії. Наприклад, ви можете посилатися на нього за допомогою виклику методу ``get_node()``, ввівши символ %, а потім назву вузла:
zh_cn: 现在你就可以在脚本中使用这个节点了。例如先打一个 % 符号，在后面跟上节点的名称，这样就可以使用 ``get_node()`` 方法来引用这个节点：
zh_hant: 現在你可以在腳本中使用這個節點。例如，你可以在呼叫 ``get_node()`` 時，輸入 % 符號接著節點名稱來引用它：

source: Same-scene limitation
ga: Teorannú an radharc céanna
it: Limite della stessa scena
ja: 同一シーンの制限
ru: Ограничение одной сцены
ta: ஒரே காட்சி வரம்பு
uk: Обмеження однієї сцени
zh_cn: 同场景限制
zh_hant: 同場景限制

source: A scene unique node can only be retrieved by a node inside the same scene. To demonstrate this limitation, consider this example **Player** scene that instances a **Sword** scene:
ga: Ní féidir le nód uathúil radharc a aisghabháil ach le nód taobh istigh den radharc céanna. Chun an teorannú seo a thaispeáint, smaoinigh ar an sampla seo radharc **Imreor** a chuireann radharc **Sword** mar shampla:
ja: シーン固有ノードは、同じシーン内のノードによってのみ取得できます。この制限を示すために、**Sword** シーンをインスタンス化する次の **Player** シーンの例を考えてみましょう。
ru: Уникальный узел сцены может быть получен только узлом внутри той же сцены. Чтобы продемонстрировать это ограничение, рассмотрим пример сцены **Player**, которая является экземпляром сцены **Sword**:
ta: ஒரு காட்சி தனித்துவமான முனையை அதே காட்சிக்குள் ஒரு முனை மூலம் மட்டுமே மீட்டெடுக்க முடியும். இந்த வரம்பை நிரூபிக்க, இந்த உதாரணத்தைக் கவனியுங்கள் ** பிளேயர் ** காட்சி ஒரு ** வாள் ** காட்சி:
uk: Унікальний вузол сцени може бути отриманий лише вузлом усередині тієї самої сцени. Щоб продемонструвати це обмеження, розглянемо цей приклад сцени **Гравець**, яка встановлює сцену **Меч**:
zh_cn: 场景唯一节点只能获取同一场景中的节点。我们可以举些例子来演示一下，比如这个示例场景是在 **Player** 场景中实例化了一个 **Sword** 场景：
zh_hant: 場景唯一節點只能被同一個場景內的節點取得。為了說明此限制，以下是一個 **Player** 場景實例化 **Sword** 場景的範例：

source: Here are the results of ``get_node()`` calls inside the **Player** script:
ga: Seo torthaí glaonna ``get_node () ``taobh istigh den scripte**Player**:
it: Ecco i risultati delle chiamate a ``get_node()`` all'interno dello script **Player**:
ja: **Player** スクリプト内の ``get_node()`` 呼び出しの結果は次のとおり。
ru: Вот результаты вызовов ``get_node()`` внутри скрипта **Player**:
ta: ** பிளேயர் ** ச்கிரிப்டுக்குள் `` get_node () `` அழைப்புகளின் முடிவுகள் இங்கே:
uk: Ось результати викликів ``get_node()`` всередині сценарію **Player**:
zh_cn: 以下是在 **Player** 脚本中调用 ``get_node()`` 的结果：
zh_hant: 以下是在 **Player** 腳本內呼叫 ``get_node()`` 的結果：

source: ``get_node("%Eyes")`` returns the **Eyes** node.
ga: Tugann ``get_node (“%Eyes”) ``an nód**Eyes** ar ais.
it: ``get_node("%Eyes")`` restituisce il nodo **Eyes**.
ja: ``get_node("%Eyes")`` は **Eyes** ノードを返します。
ru: ``get_node("%Eyes")`` возвращает узел **Eyes**.
ta: `` get_node ("%கண்கள்") `` ** கண்கள் ** முனையை வழங்குகிறது.
uk: ``get_node("%Eyes")`` повертає вузол **Eyes**.
zh_cn: ``get_node("%Eyes")`` 会返回 **Eyes** 节点。
zh_hant: ``get_node("%Eyes")`` 會回傳 **Eyes** 節點。

source: ``get_node("%Hilt")`` returns ``null``.
ga: Tugann ``get_node (“%Hilt”) ``ar ais ``null``.
it: ``get_node("%Hilt")`` restituisce ``null``.
ja: ``get_node("%Hilt")`` は ``null`` を返します。
ru: ``get_node("%Hilt")`` возвращает ``null``.
ta: `` get_node ("%hilt") `` `` null`` ஐத் தருகிறது.
uk: ``get_node("%Hilt")`` повертає ``null``.
zh_cn: ``get_node("%Hilt")`` 会返回 ``null``\ 。
zh_hant: ``get_node("%Hilt")`` 會回傳 ``null``。

source: These are the results of ``get_node()`` calls inside the **Sword** script:
ga: Seo torthaí glaonna ``get_node () ``taobh istigh den scripte**Sword**:
it: Questi sono i risultati delle chiamate a ``get_node()`` all'interno dello script **Sword**:
ja: **Sword** スクリプト内の ``get_node()`` 呼び出しの結果は次のとおり:
ru: Вот результаты вызовов ``get_node()`` внутри скрипта **Sword**:
ta: இவை `` get_node () `` ** வாள் ** ச்கிரிப்டுக்குள் அழைப்புகளின் முடிவுகள்:
uk: Це результати викликів ``get_node()`` всередині сценарію **Sword**:
zh_cn: 以下是在 **Sword** 脚本中调用 ``get_node()`` 的结果：
zh_hant: 以下是在 **Sword** 腳本內呼叫 ``get_node()`` 的結果：

source: ``get_node("%Eyes")`` returns ``null``.
ga: Filleann ``get_node (“%Eyes”) ```null``.
it: ``get_node("%Eyes")`` restituisce ``null``.
ja: ``get_node("%Eyes")`` は ``null`` を返します。
ru: ``get_node("%Eyes")`` возвращает ``null``.
ta: `` get_node ("%கண்கள்") `` `` null`` திரும்பும்.
uk: ``get_node("%Eyes")`` повертає ``null``.
zh_cn: ``get_node("%Eyes")`` 会返回 ``null``\ 。
zh_hant: ``get_node("%Eyes")`` 會回傳 ``null``。

source: ``get_node("%Hilt")`` returns the **Hilt** node.
ga: Tugann ``get_node (“%Hilt”) ``an nód**Hilt** ar ais.
it: ``get_node("%Hilt")`` restituisce il nodo **Hilt**.
ja: ``get_node("%Hilt")`` は **Hilt** ノードを返します。
ru: ``get_node("%Hilt")`` возвращает узел **Hilt**.
ta: `` get_node ("%hilt") `` ** இல்ட் ** முனையை வழங்குகிறது.
uk: ``get_node("%Hilt")`` повертає вузол **Hilt**.
zh_cn: ``get_node("%Hilt")`` 会返回 **Hilt** 节点。
zh_hant: ``get_node("%Hilt")`` 會回傳 **Hilt** 節點。

source: If a script has access to a node in another scene, it can call ``get_node()`` on that node to get scene unique nodes from that node's scene. This also works in a node path, which avoids multiple ``get_node()`` calls. Here are two ways to get the **Hilt** node from the **Player** script using scene unique nodes:
ga: Má tá rochtain ag script ar nód i radharc eile, is féidir leis ``get_node()`` a ghlaoch ar an nód sin chun nóid uathúla radhairc a fháil ó radharc an nód sin. Oibríonn sé seo freisin ar chonair nód, a sheachnaíonn glaonna ``get_node()`` iolrach. Seo dhá bhealach chun an nód **Hilt** a fháil ón script **Player** ag baint úsáide as nóid uathúla radhairc:
it: Se uno script ha accesso a un nodo in un'altra scena, può chiamare ``get_node()`` su quel nodo per ottenere nodi univoci dalla scena di quel nodo. Questo funziona anche in un percorso di nodo, evitando più chiamate a ``get_node()``. Ecco due modi per ottenere il nodo **Hilt** dallo script **Player** tramite nodi univoci:
ja: スクリプトが別のシーンのノードにアクセスしたいとき、そのノード上で ``get_node()`` を呼び出して、そのノードのシーンからシーン固有のノードを取得できます。これはノードパスでもよくて、そうすると複数の ``get_node()`` 呼び出しを回避します。シーン固有のノードを使用して **Player** スクリプトから **Hilt** ノードを取得する2つの方法を次に示します。
ru: Если скрипт имеет доступ к узлу в другой сцене, он может вызвать ``get_node()`` для этого узла, чтобы получить уникальные узлы сцены из сцены этого узла. Это также работает в пути к узлам, что позволяет избежать множественных вызовов ``get_node()``. Вот два способа получить узел **Hilt** из скрипта **Player**, используя уникальные узлы сцены:
ta: ஒரு ச்கிரிப்டுக்கு மற்றொரு காட்சியில் ஒரு முனை அணுகல் இருந்தால், அந்த முனையின் காட்சியில் இருந்து தனித்துவமான முனைகளைப் பெற அந்த முனையில் `` get_node () `` என்று அழைக்கலாம். இது ஒரு முனை பாதையிலும் செயல்படுகிறது, இது பல `` get_node () `` அழைப்புகளைத் தவிர்க்கிறது. காட்சியைப் பயன்படுத்தி ** பிளேயர் ** ச்கிரிப்டிலிருந்து ** இல்ட் ** முனையைப் பெற இரண்டு வழிகள் இங்கே:
uk: Якщо сценарій має доступ до вузла в іншій сцені, він може викликати ``get_node()`` на цьому вузлі, щоб отримати унікальні вузли сцени зі сцени цього вузла. Це також працює в шляху до вузла, що дозволяє уникнути кількох викликів ``get_node()``. Ось два способи отримати вузол **Hilt** зі сценарію **Player** за допомогою унікальних вузлів сцени:
zh_cn: 如果脚本能够获取到另一个场景中的节点，那么就可以调用该节点的 ``get_node()`` 来获取该节点所在场景中的场景唯一节点。你也可以在节点路径中做类似的操作，从而避免多次调用 ``get_node()``\ 。以下两种方法均可从 **Player** 脚本中利用场景唯一节点来获取 **Hilt** 节点：
zh_hant: 如果腳本能取得另一個場景的節點，就可以在該節點上呼叫 ``get_node()``，以取得該場景中的場景唯一節點。這同樣適用於節點路徑，可以避免重複呼叫 ``get_node()``。以下是在 **Player** 腳本中使用場景唯一節點取得 **Hilt** 節點的兩種寫法：

source: ``get_node("Hand/Sword").get_node("%Hilt")`` returns the **Hilt** node.
ga: Tugann ``get_node (“Hand/Sword”) .get_node (“%Hilt”) ``an nód**Hilt** ar ais.
it: ``get_node("Hand/Sword").get_node("%Hilt")`` restituisce il nodo **Hilt**.
ja: ``get_node("Hand/Sword").get_node("%Hilt")`` は **Hilt** ノードを返します。
ru: ``get_node("Hand/Sword").get_node("%Hilt")`` возвращает узел **Hilt**.
ta: `` get_node ("கை/வாள்"). get_node ("%hilt") `` ** இல்ட் ** முனையை வழங்குகிறது.
uk: ``get_node("Hand/Sword").get_node("%Hilt")`` повертає вузол **Hilt**.
zh_cn: ``get_node("Hand/Sword").get_node("%Hilt")`` 会返回 **Hilt** 节点。
zh_hant: ``get_node("Hand/Sword").get_node("%Hilt")`` 會回傳 **Hilt** 節點。

source: ``get_node("Hand/Sword/%Hilt")`` also returns the **Hilt** node.
ga: Tugann ``get_node (“Hand/Sword/%Hilt”) ``an nód**Hilt** ar ais freisin.
it: ``get_node("Hand/Sword/%Hilt")`` restituisce egualmente il nodo **Hilt**.
ja: ``get_node("Hand/Sword/%Hilt")`` は **Hilt** ノードを返します。
ru: ``get_node("Hand/Sword/%Hilt")`` также возвращает узел **Hilt**.
ta: `` get_node ("கை/வாள்/%இல்ட்") `` மேலும் ** இல்ட் ** முனையை வழங்குகிறது.
uk: ``get_node("Hand/Sword/%Hilt")`` також повертає вузол **Hilt**.
zh_cn: ``get_node("Hand/Sword/%Hilt")`` 也会返回 **Hilt** 节点。
zh_hant: ``get_node("Hand/Sword/%Hilt")`` 也會回傳 **Hilt** 節點。

source: Scene unique names don't only work at the end of a node path. They can be used in the middle to navigate from one node to another. For example, the **Sword** node is marked as a scene unique node in the **Player** scene, so this is possible:
ga: Ní amháin go n-oibríonn ainmneacha uathúla radhairc ag deireadh cosán nód. Is féidir iad a úsáid sa lár chun nascleanúint a dhéanamh ó nód amháin go nód eile. Mar shampla, tá an nód**Sword** marcáilte mar nód uathúil radhairc sa radharc **Imreor**, mar sin is féidir é seo a dhéanamh:
it: I nomi univoci delle scene non funzionano solo alla fine di un percorso di nodi. Si possono usare anche al centro per navigare da un nodo all'altro. Ad esempio, il nodo **Sword** è segnato come nodo univoco nella scena **Player**, quindi il seguente è possibile:
ja: シーンの固有名は、ノードパスの末尾でのみ機能するわけではありません。これらはあるノードから別のノードに移動するために中間でも使用できます。たとえば **Sword** ノードは **Player** シーン内でシーン固有のノードとしてマークされているため、次のことが可能です。
ru: Уникальные имена сцены работают не только в конце пути узла. Их можно использовать в середине для навигации от одного узла к другому. Например, узел **Sword** отмечен как уникальный узел сцены в сцене **Player**, поэтому возможно следующее:
ta: காட்சி தனித்துவமான பெயர்கள் ஒரு முனை பாதையின் முடிவில் மட்டுமே வேலை செய்யாது. ஒரு முனையிலிருந்து இன்னொரு முனைக்கு செல்ல அவை நடுவில் பயன்படுத்தப்படலாம். எடுத்துக்காட்டாக, ** வாள் ** முனை ** பிளேயர் ** காட்சியில் ஒரு காட்சி தனித்துவமான முனையாக குறிக்கப்பட்டுள்ளது, எனவே இது சாத்தியம்:
uk: Унікальні імена сцени працюють не лише в кінці шляху вузла. Їх можна використовувати в середині для переходу від одного вузла до іншого. Наприклад, вузол **Меч** позначено як унікальний вузол сцени в сцені **Гравець**, тому це можливо:
zh_cn: 场景唯一名称不止可以用在节点路径的末尾，也可以用在路径的中间来实现跳转。例如 **Player** 场景中的 **Sword** 节点就是一个场景唯一节点，因此可以这样写：
zh_hant: 場景唯一名稱不只可以用在節點路徑的最末端，也可以在中間使用，讓你從一個節點導覽到另一個節點。例如，**Sword** 節點在 **Player** 場景中被設為場景唯一節點，因此你可以這樣寫：

source: ``get_node("%Sword/%Hilt")`` returns the **Hilt** node.
ga: Tugann ``get_node (“%Sword/%Hilt”) ``an nód**Hilt** ar ais.
it: ``get_node("%Sword/%Hilt")`` restituisce il nodo **Hilt**.
ja: ``get_node("%Sword/%Hilt")`` は **Hilt** ノードを返します。
ru: ``get_node("%Sword/%Hilt")`` возвращает узел **Hilt**.
ta: `` get_node ("%வாள்/%இல்ட்") `` ** இல்ட் ** முனையை வழங்குகிறது.
uk: ``get_node("%Sword/%Hilt")`` повертає вузол **Hilt**.
zh_cn: ``get_node("%Sword/%Hilt")`` 会返回 **Hilt** 节点。
zh_hant: ``get_node("%Sword/%Hilt")`` 會回傳 **Hilt** 節點。

source: Alternatives
ga: Roghanna eile
it: Alternative
ja: 代替アプローチ
ru: Альтернативы
ta: மாற்று
uk: Альтернативи
zh_cn: 替代方案
zh_hant: 其他方法

source: Scene unique nodes are a useful tool to navigate a scene. However, there are some situations where other techniques may be better.
ga: Is uirlis úsáideach iad nóid uathúla radharc chun radharc a nascleanúint. Mar sin féin, tá roinnt cásanna ann ina bhféadfadh teicnící eile a bheith níos fearr.
it: I nodi univoci delle scene sono uno strumento utile per navigare in una scena. Tuttavia, ci sono alcune situazioni in cui altre tecniche potrebbero essere migliori.
ja: シーン固有ノードは、シーンをナビゲートするための便利なツールです。ただし状況によっては、他のテクニックの方が優れている場合もあります。
ru: Уникальные узлы сцены — полезный инструмент для навигации по ним. Однако в некоторых ситуациях другие методы могут оказаться более эффективными.
ta: காட்சி தனித்துவமான முனைகள் ஒரு காட்சிக்கு செல்ல ஒரு பயனுள்ள கருவியாகும். இருப்பினும், பிற நுட்பங்கள் சிறப்பாக இருக்கும் சில சூழ்நிலைகள் உள்ளன.
uk: Унікальні вузли сцени є корисним інструментом для навігації сценою. Однак є ситуації, коли інші методи можуть бути кращими.
zh_cn: 使用场景唯一节点可以很方便地在场景中进行跳转。但是有些情况下其他写法会更好一些。
zh_hant: 場景唯一節點是導覽場景很實用的工具，不過在某些情況下，其他技巧可能會更適合。

source: A :ref:`Group <doc_groups>` allows locating a node (or a group of many nodes) from any other node, no matter what scene the two nodes are located in.
ga: A :ref:`Ceadaíonn grúpa <doc_groups>` nód (nó grúpa go leor nóid) a aimsiú ó aon nód ar bith eile, is cuma cén radharc ina bhfuil an dá nód suite.
it: Un :ref:`gruppo <doc_groups>` consente di individuare un nodo (o un gruppo di molti nodi) da qualsiasi altro nodo, a prescindere dalla scena in cui si trovano i due nodi.
ja: :ref:`Group <doc_groups>` を使用すると、2つのノードがどのようなシーンに配置されているかに関係なく、他のノードから特定のノード (または多数のノードのグループ) を見つけることができます。
ru: :ref:`Group <doc_groups>` позволяет определить местоположение узла (или группы из многих узлов) из любого другого узла, независимо от того, в какой сцене находятся два узла.
ta: ப: குறிப்பு: `குழு <doc_groups>` இரண்டு முனைகளும் எந்த காட்சியில் அமைந்தாலும், வேறு எந்த முனையிலிருந்தும் ஒரு முனையை (அல்லது பல முனைகளின் குழுவை) கண்டுபிடிக்க அனுமதிக்கிறது.
uk: :ref:`Group <doc_groups>` дозволяє знайти вузол (або групу багатьох вузлів) з будь-якого іншого вузла, незалежно від того, на якій сцені ці два вузли розташовані.
zh_cn: 使用\ :ref:`分组 <doc_groups>`\ 可以从任意节点定位到某个节点（或一组节点），无需考虑所处的场景。
zh_hant: :ref:`群組 <doc_groups>` 可以讓你從任何節點定位另一個節點（或多個節點），無論它們分屬於哪個場景。

source: A :ref:`Singleton (Autoload) <doc_singletons_autoload>` is an always loaded node that can be accessed directly by any node regardless of the scene. These are useful when some data or functionality is shared globally.
ga: A :ref:`Singleton (Autoload) <doc_singletons_autoload>` is nód lódáilte i gcónaí é is féidir a rochtain go díreach ag aon nód beag beann ar an ardán. Bíonn siad seo úsáideach nuair a roinntear roinnt sonraí nó feidhmiúlacht ar fud an domhain.
it: Un :ref:`singleton (autoload) <doc_singletons_autoload>` è un nodo sempre caricato a cui è possibile accedere direttamente da qualsiasi nodo, a prescindere dalla scena. Sono utili quando alcuni dati o funzionalità sono condivisi globalmente.
ja: :ref:`Singleton (Autoload) <doc_singletons_autoload>` はシーンに関係なく任意のノードから直接アクセスできる、常にロードされるノードです。これは一部のデータまたは関数がグローバルに共有される場合に便利です。
ru: :ref:`Singleton (Autoload) <doc_singletons_autoload>` — это всегда загруженный узел, к которому любой узел может получить прямой доступ независимо от сцены. Такие узлы полезны, когда некоторые данные или функции используются глобально.
ta: ப: குறிப்பு: `சிங்கிள்டன் (ஆட்டோலோட்) <doc_singletons_autoload>` என்பது எப்போதும் ஏற்றப்பட்ட முனையாகும், இது காட்சியைப் பொருட்படுத்தாமல் எந்த முனையாலும் நேரடியாக அணுக முடியும். உலகளவில் சில தரவு அல்லது செயல்பாடு பகிரப்படும்போது இவை பயனுள்ளதாக இருக்கும்.
uk: :ref:`Singleton (Autoload) <doc_singletons_autoload>` — це завжди завантажений вузол, до якого може отримати прямий доступ будь-який вузол незалежно від сцени. Це корисно, коли деякі дані чи функції надаються глобально.
zh_cn: :ref:`单例（自动加载） <doc_singletons_autoload>`\ 是一种始终存在的节点，任何节点都可以直接访问，无需考虑所处的场景。适合需要全局共享数据或功能的时候使用。
zh_hant: :ref:`單例（自動載入） <doc_singletons_autoload>` 是一個無論在哪個場景都會載入的節點，任何節點都可以直接存取它。當有資料或功能需要全域共用時，這會很有用。
