Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/particles/creating_a_3d_particle_system.po
Languages: de, ga, it, pt_br, ru, ta, tr, uk, zh_hans, zh_tw

source: Creating a 3D particle system
de: Erstellen eines 3D-Partikel-Systems
ga: Córas cáithníní 3D a chruthú
it: Creazione di un sistema di particelle 3D
ru: Создание системы 3D-частиц
ta: ஒரு 3D துகள் அமைப்பை உருவாக்குதல்
tr: 3B parçacık sistemi oluşturma
uk: Створення 3D системи частинок
zh_hans: 创建 3D 粒子系统
zh_tw: 建立 3D 粒子系統

source: Required particle node properties
de: Erforderliche Propertys von Partikel-Nodes
ga: Airíonna nód cáithníní gá
it: Proprietà richieste dei nodi di particelle
ru: Обязательные свойства узла частиц
ta: தேவையான துகள் முனை பண்புகள்
tr: Gerekli parçacık düğümü özellikleri
uk: Необхідні властивості вузла частинки
zh_hans: 所需的粒子节点属性
zh_tw: 必需的粒子節點屬性

source: To get started with particles, the first thing we need to do is add a ``GPUParticles3D`` node to the scene. Before we can actually see any particles, we have to set up two parameters on the node: the ``Process Material`` and at least one ``Draw Pass``.
de: Um mit den Partikeln zu beginnen, müssen wir als erstes einen ``GPUParticles3D``-Node in die Szene einfügen. Bevor wir irgendwelche Partikel sehen können, müssen wir zwei Parameter auf dem Node einstellen: das ``Prozessmaterial`` und mindestens einen ``Zeichendurchlauf``.
ga: Chun tús a chur le cáithníní, is é an chéad rud a chaithfimid a dhéanamh ná nód `GPUparticles3d`` a chur leis an radharc. Sula bhfeicfimid aon cháithníní a fheiceáil i ndáiríre, caithfimid dhá pharaiméadar a chur ar bun ar an nód: an ``Ábhar Próise`` agus ``Pas Tarraing`` amháin ar a laghad.
it: Per iniziare a lavorare con le particelle, la prima cosa che dobbiamo fare è aggiungere un nodo ``GPUParticles3D`` alla scena. Prima di poter effettivamente vedere le particelle, dobbiamo impostare due parametri sul nodo: ``Process Material`` e almeno un ``Draw Pass``.
pt_br: Para começar com partículas, a primeira coisa que precisamos fazer é adicionar um nó ``GPUParticles3D`` à cena. Antes de podermos realmente ver qualquer partícula, temos que configurar dois parâmetros no nó: o ``Process Material`` e pelo menos um ``Draw Pass``.
ru: Чтобы начать работу с частицами, первым делом нам нужно добавить в сцену узел ``GPUParticles3D``. Прежде чем мы сможем увидеть частицы, нам нужно задать два параметра узла: ``Process Material`` и хотя бы один ``Draw Pass``.
ta: துகள்களுடன் தொடங்க, நாம் செய்ய வேண்டியது முதல் சேதி காட்சிக்கு ஒரு `` gpuparticles3d`` முனையைச் சேர்க்க வேண்டும். எந்தவொரு துகள்களையும் நாம் உண்மையில் காணும் முன், முனையில் இரண்டு அளவுருக்களை அமைக்க வேண்டும்: `` செயல்முறை பொருள்`` மற்றும் குறைந்தது ஒரு `` பாச் பாச்`.
uk: Щоб почати роботу з частинками, перше, що нам потрібно зробити, це додати до сцени вузол ``GPUParticles3D``. Перш ніж ми зможемо побачити будь-які частинки, ми повинні налаштувати два параметри на вузлі: ``Process Material`` і принаймні один ``Draw Pass``.
zh_hans: 创建粒子系统的第一步是向场景中添加一个 ``GPUParticles3D`` 节点。 为了能看到粒子，还需要在该节点上设置两个参数 ``Process Material`` 材质 和至少一个 ``Draw Pass`` 绘制通道。
zh_tw: 要開始使用粒子系統，首先需要在場景中加入一個 ``GPUParticles3D`` 節點。在能夠看到任何粒子之前，必須先在該節點上設定兩個參數：一個 ``處理材質（Process Material）`` 以及至少一個 ``繪製通道（Draw Pass）``。

source: The process material
de: Das Prozessmaterial
ga: An t-ábhar próiseas
ru: Процессуальный материал
ta: செயல்முறை பொருள்
tr: İşleme malzemesi
uk: Матеріал процесу
zh_hans: 处理材质
zh_tw: 處理材質

source: To add a process material to your particles node, go to ``Process Material`` in the inspector panel. Click on the box next to ``Process Material`` and from the dropdown menu select ``New ParticleProcessMaterial``.
de: Um ein Prozessmaterial zu Ihrem Node hinzuzufügen, gehen Sie auf ``Prozessmaterial`` im Inspektor-Panel. Klicken Sie auf das Kästchen neben ``Prozessmaterial`` und wählen Sie aus dem Dropdown-Menü ``Neu: ParticleProcessMaterial``.
ga: Chun ábhar próisis a chur le do nód cáithníní, téigh chuig ``Ábhar Próiseála`` sa phainéal cigirí. Cliceáil ar an mbosca in aice le ``Ábhar Próiseála`` agus ón roghchlár anuas roghnaigh ``New PickleProcessMaterial ``.
ru: Чтобы добавить процессуальный материал к узлу частиц, перейдите к ``Process Material`` в инспекторе. Нажмите на поле рядом с ``Process Material`` и выберите ``New ParticleProcessMaterial`` в выпадающем меню.
ta: உங்கள் துகள்கள் முனையில் ஒரு செயல்முறை பொருளைச் சேர்க்க, இன்ச்பெக்டர் பேனலில் `` செயல்முறை பொருள்` க்குச் செல்லவும். `` செயல்முறை பொருள்` `மற்றும் கீழ்தோன்றும் மெனுவிலிருந்து அடுத்த பெட்டியில் சொடுக்கு செய்க` `புதிய துகள் பதவி நீக்கம் ஆகியவற்றைத் தேர்ந்தெடுக்கவும்.
uk: Щоб додати технологічний матеріал до вузла частинок, перейдіть до ``Процесний матеріал`` на панелі інспектора. Клацніть на полі поруч із ``Process Material`` і виберіть у спадному меню ``New ParticleProcessMaterial``.
zh_hans: 要将处理材质添加到粒子节点，请转到检查器面板中的 ``Process Material``\ 。单击 ``Process Material`` 旁边的框，然后从下拉菜单中选择 ``新建 ParticleProcessMaterial``\ 。
zh_tw: 要為粒子節點新增處理材質，請在屬性面板（Inspector）中找到 ``Process Material``。點擊 ``Process Material`` 旁的方框，然後從下拉選單中選擇 ``新建 ParticleProcessMaterial``。

source: Creating a process material
de: Anlegen eines Prozessmaterials
ga: Ábhar próisis a chruthú
ru: Создание процессуального материала
ta: ஒரு செயல்முறை பொருளை உருவாக்குதல்
tr: İşleme malzemesi oluşturma
uk: Створення технологічного матеріалу
zh_hans: 创建处理材质
zh_tw: 建立處理材質

source: :ref:`class_ParticleProcessMaterial` is a special kind of material. We don't use it to draw any objects. We use it to update particle data and behavior on the GPU instead of the CPU, which comes with a massive performance boost. A click on the newly added material displays a long list of properties that you can set to control each particle's behavior.
de: :ref:`class_ParticleProcessMaterial` ist eine besondere Art von Material. Wir verwenden es nicht, um Objekte zu zeichnen. Wir verwenden es, um die Partikeldaten und das Verhalten der Partikel auf dem Grafikprozessor statt auf der CPU zu aktualisieren, was einen enormen Performanceschub mit sich bringt. Ein Klick auf das neu hinzugefügte Material zeigt eine lange Liste von Eigenschaften an, die Sie einstellen können, um das Verhalten der einzelnen Partikel zu steuern.
ga: :ref: Is cineál speisialta ábhar é `Class_ParticleProcessMaterial`. Ní úsáidimid é chun aon rudaí a tharraingt. Úsáidimid é chun sonraí agus iompar cáithníní a nuashonrú ar an GPU in ionad an LAP, a thagann le borradh ollmhór feidhmíochta. Taispeánann cliceáil ar an ábhar nua-bhreise liosta fada airíonna is féidir leat a shocrú chun iompar gach cáithníní a rialú.
pt_br: :ref:`class_ParticleProcessMaterial` é um tipo especial de material. Nós não o usamos para desenhar nenhum objeto. Nós o usamos para atualizar os dados e o comportamento das partículas na GPU em vez da CPU, o que traz um enorme aumento de desempenho. Um clique no material recém-adicionado exibe uma longa lista de propriedades que você pode definir para controlar o comportamento de cada partícula.
ru: :ref:`class_ParticleProcessMaterial` - это особый вид материала. Мы не используем его для отрисовки объектов. Мы используем его для обновления данных и поведения частиц на GPU, а не на CPU, что дает огромный прирост производительности. Щелчок на только что добавленном материале отображает длинный список свойств, которые вы можете установить для управления поведением каждой частицы.
ta: . எந்தவொரு பொருளையும் வரைய நாங்கள் இதைப் பயன்படுத்தவில்லை. சிபியு க்கு பதிலாக GPU இல் துகள் தரவு மற்றும் நடத்தைகளைப் புதுப்பிக்க இதைப் பயன்படுத்துகிறோம், இது ஒரு பெரிய செயல்திறன் ஊக்கத்துடன் வருகிறது. புதிதாக சேர்க்கப்பட்ட பொருளின் சொடுக்கு ஒவ்வொரு துகள் நடத்தையையும் கட்டுப்படுத்த நீங்கள் அமைக்கக்கூடிய பண்புகளின் நீண்ட பட்டியலைக் காட்டுகிறது.
uk: :ref:`class_ParticleProcessMaterial` — це особливий вид матеріалу. Ми не використовуємо його для малювання будь-яких об'єктів. Ми використовуємо його для оновлення даних про частинки та поведінки на графічному процесорі замість ЦП, що забезпечує значне підвищення продуктивності. Клацання щойно доданого матеріалу відображає довгий список властивостей, які ви можете налаштувати, щоб контролювати поведінку кожної частинки.
zh_hans: :ref:`class_ParticleProcessMaterial` 是一种特殊的材质。它不是用于绘制对象，是在 GPU 上更新粒子数据和行为，而不是 CPU，这可以带来巨大的性能提升。单击新添加的材质会显示一个长长的属性列表，可以设置这些属性来控制粒子的行为。
zh_tw: :ref:`class_ParticleProcessMaterial` 是一種特殊的材質，它並不是用來繪製物件，而是用來在 GPU 上更新粒子的數據與行為，取代原本在 CPU 執行的方式，這能大幅提升效能。點選新加入的處理材質後，會顯示一長串可調整的屬性，讓你控制每個粒子的行為。

source: Draw passes
de: Zeichendurchläufe
ga: Tarraing pasanna
it: Passaggi di disegno
ru: Проходы отрисовки
ta: பாச் டிரா
uk: Розіграш пасів
zh_hans: 绘制阶段
zh_tw: 繪製通道

source: At least one draw pass is required
de: Mindestens ein Zeichendurchlauf ist erforderlich
ga: Teastaíonn pas tarraingthe amháin ar a laghad
it: È richiesto almeno un passaggio di disegno
pt_br: É necessário pelo menos um "draw pass"
ru: Требуется как минимум один пропуск для розыгрыша
ta: குறைந்தது ஒரு டிரா பாச் தேவை
uk: Потрібен принаймні один пропуск для розіграшу
zh_hans: 至少需要一个绘制阶段
zh_tw: 至少需要一個繪製通道

source: In order to render any particles, at least one draw pass needs to be defined. To do that, go to ``Draw Passes`` in the inspector panel. Click on the box next to ``Pass 1`` and select ``New QuadMesh`` from the dropdown menu. After that, click on the mesh and set its ``Size`` to 0.1 for both ``x`` and ``y``. Reducing the mesh's size makes it a little easier to tell the individual particle meshes apart at this stage.
de: Um Partikel zu rendern, muss mindestens ein Zeichendurchlauf definiert werden. Um das zu tun, gehen Sie zu ``Zeichendurchläufe`` im Inspektor Panel. Klicken Sie auf das Kästchen neben ``Durchlauf 1`` und wählen Sie ``Neu: QuadMesh`` aus dem Dropdown-Menü. Danach klicken Sie auf das Mesh und setzen seine ``Größe`` auf 0.1 für ``x`` und ``y``. Die Verkleinerung des Meshes macht es ein wenig einfacher, die einzelnen Partikelmeshes in diesem Stadium zu unterscheiden.
ga: D'fhonn aon cháithníní a thabhairt, is gá pas tarraingthe amháin ar a laghad a shainiú. Chun é sin a dhéanamh, téigh chuig ``Tarraing Pases`` sa phainéal cigirí. Cliceáil ar an mbosca in aice le ``Pas 1`` agus roghnaigh ``New Quadmesh`` ón roghchlár anuas. Ina dhiaidh sin, cliceáil ar an mogalra agus socraigh a ``Méid ``go 0.1 do ``x`` agus ``y`` araon. De bharr méid na mogalra a laghdú bíonn sé beagán níos éasca na mogalra cáithníní aonair a insint óna chéile ag an gcéim seo.
pt_br: Para renderizar qualquer partícula, pelo menos um "draw pass" precisa ser definido. Para fazer isso, vá em ``Draw Passes`` no painel do inspetor. Clique na caixa ao lado de ``Pass 1`` e selecione ``New QuadMesh`` no menu suspenso. Depois disso, clique na malha e defina seu ``Size`` para 0.1 para ``x`` e ``y``. Reduzir o tamanho da malha torna um pouco mais fácil distinguir as malhas de partículas individuais nesta etapa.
ru: Для рендеринга частиц необходимо определить хотя бы один проход отрисовки. Для этого перейдите в раздел ``Draw Passes`` на панели инспектора. Щелкните на поле рядом с ``Pass 1`` и выберите ``New QuadMesh`` из выпадающего меню. После этого щелкните на сетке и установите ее ``Размер`` на 0,1 для ``x`` и ``y``. Уменьшение размера сетки позволяет немного легче различать отдельные сетки частиц на данном этапе.
ta: எந்தவொரு துகள்களையும் வழங்க, குறைந்தது ஒரு டிரா பாச் வரையறுக்கப்பட வேண்டும். அதைச் செய்ய, இன்ச்பெக்டர் பேனலில் `` பாச்களை வரையவும். `` பாச் 1`` க்கு அடுத்த பெட்டியில் சொடுக்கு செய்து, கீழ்தோன்றும் மெனுவிலிருந்து `` புதிய குவாட்மேச்`` என்பதைத் தேர்ந்தெடுக்கவும். அதன்பிறகு, கண்ணி என்பதைக் சொடுக்கு செய்து, `` x`` மற்றும் `` y`` ஆகிய இரண்டிற்கும் அதன் `` அளவு`` 0.1 ஆக அமைக்கவும். கண்ணி அளவைக் குறைப்பது இந்த கட்டத்தில் தனிப்பட்ட துகள் மெச்களைத் தவிர்ப்பது கொஞ்சம் எளிதாக்குகிறது.
uk: Щоб відобразити будь-які частинки, потрібно визначити принаймні один прохід малювання. Для цього перейдіть до ``Draw Passes`` на панелі інспектора. Клацніть на полі поруч із ``Pass 1`` і виберіть ``New QuadMesh`` зі спадного меню. Після цього натисніть на сітку та встановіть її ``Size`` на 0,1 як для ``x``, так і для ``y``. Зменшення розміру сітки полегшує розрізнення окремих сіток частинок на цьому етапі.
zh_hans: 为了渲染粒子，至少需要定义一个绘制通道。为此，请转到检查器面板中的 ``Draw Passes``\ 。点击 ``Pass 1`` 旁边的框，然后从下拉菜单中选择新建 QuadMesh（\ ``New QuadMesh``\ ）。之后，点击网格并将其 ``Size`` 中的 ``x`` 和 ``y`` 设置为 0.1。减小网格的大小可以在该阶段更容易区分各个粒子网格。
zh_tw: 為了讓粒子能夠被繪製，必須定義至少一個繪製通道。請在屬性面板中找到 ``Draw Passes``，點擊 ``Pass 1`` 旁的方框，從下拉選單選擇 ``新建 QuadMesh``。接著點擊該網格，將其 ``Size`` 設定為 x 與 y 都是 0.1。縮小網格尺寸可以讓你更容易分辨各個粒子的外觀。

source: You can use up to 4 draw passes per particle system. Each pass can render a different mesh with its own unique material. All draw passes use the data that is computed by the process material, which is an efficient method for composing complex effects: Compute particle behavior once and feed it to multiple render passes.
de: Sie können bis zu 4 Zeichendurchläufe pro Partikelsystem verwenden. Jeder Durchlauf kann ein anderes Mesh mit seinem eigenen einzigartigen Material rendern. Alle Zeichendurchläufe verwenden die Daten, die vom Prozessmaterial berechnet werden, was eine effiziente Methode für die Komposition komplexer Effekte ist: Berechnen Sie das Partikelverhalten einmal und leiten Sie es an mehrere Render-Durchläufe weiter.
ga: Is féidir leat suas le 4 pas tarraingthe a úsáid in aghaidh an chórais cáithníní. Is féidir le gach pas mogalra difriúil a thabhairt lena ábhar uathúil féin. Úsáideann gach pas tarraingthe na sonraí a ríomh ag an ábhar próisis, ar modh éifeachtach é chun éifeachtaí casta a chumadh: Ríomh iompar cáithníní uair amháin agus cothaigh iad do phasanna rindrithe iolracha.
pt_br: Você pode usar até 4 "draw passes" por sistema de partículas. Cada "pass" pode renderizar uma malha diferente com seu próprio material exclusivo. Todos os "draw passes" usam os dados que são computados pelo material de processo, o que é um método eficiente para compor efeitos complexos: Calcule o comportamento das partículas uma vez e alimente-o para múltiplos "render passes".
ru: Вы можете использовать до 4 проходов отрисовки для каждой системы частиц. Каждый проход может отрисовывать отдельную сетку со своим уникальным материалом. Все проходы отрисовки используют данные, вычисляемые материалом процесса, что является эффективным методом для создания сложных эффектов: Вычислите поведение частиц один раз и передайте его на несколько проходов рендеринга.
ta: ஒரு துகள் அமைப்புக்கு 4 டிரா பாச்கள் வரை பயன்படுத்தலாம். ஒவ்வொரு பாசும் அதன் சொந்த தனித்துவமான பொருளைக் கொண்டு வெவ்வேறு கண்ணி வழங்க முடியும். அனைத்து டிரா பாச்களும் செயல்முறை பொருளால் கணக்கிடப்பட்ட தரவைப் பயன்படுத்துகின்றன, இது சிக்கலான விளைவுகளை உருவாக்குவதற்கான திறமையான முறையாகும்: துகள் நடத்தையை ஒரு முறை கணக்கிட்டு பல வழங்குதல் பாச்களுக்கு உணவளிக்கவும்.
uk: Ви можете використовувати до 4 проходів протягування на систему частинок. Кожен прохід може рендерити іншу сітку з власним унікальним матеріалом. Усі проходи малювання використовують дані, обчислені матеріалом процесу, що є ефективним методом компонування складних ефектів: обчислюйте поведінку частинок один раз і передайте його на кілька проходів візуалізації.
zh_hans: 每个粒子系统最多可以使用 4 个绘制通道。每个通道可以渲染一个不同的网格，并使用自己独特的材质。所有绘制通道都使用由处理材质计算的数据，这是一种用于组合复杂效果的高效方法：一次计算粒子的行为，然后将其提供给多个渲染通道。
zh_tw: 每個粒子系統最多可使用 4 個繪製通道，每個通道都可以使用不同的網格與材質進行渲染。所有繪製通道都會共用處理材質所運算出的粒子資料，這是一種高效合成複雜特效的方法：只需一次計算粒子行為，即可應用於多個繪製通道。

source: Using multiple draw passes: yellow rectangles (pass1) and blue spheres (pass 2)
de: Verwendung mehrerer Zeichendurchläufe: gelbe Rechtecke (Durchgang 1) und blaue Kugeln (Durchgang 2)
ga: Ag baint úsáide as pasanna tarraingthe iolracha: dronuilleoga buí (pas1) agus sféirí gorma (pas 2)
it: Utilizzo di più passaggi di disegno: rettangoli gialli (passaggio 1) e sfere blu (passaggio 2)
pt_br: Usando múltiplos "draw passes": retângulos amarelos (pass 1) e esferas azuis (pass 2)
ru: Использование нескольких проходов рисования: желтые прямоугольники (проход 1) и синие сферы (проход 2)
ta: பல டிரா பாச்களைப் பயன்படுத்துதல்: மஞ்சள் செவ்வகங்கள் (பாச் 1) மற்றும் நீல கோளங்கள் (பாச் 2)
uk: Використання кількох проходів: жовті прямокутники (прохід 1) і сині сфери (прохід 2)
zh_hans: 使用多个绘制通道：黄色矩形 (pass1) 和蓝色球体 (pass 2)
zh_tw: 使用多重繪製通道：黃色矩形（通道 1）、藍色球體（通道 2）

source: If you followed the steps above, your particle system should now be emitting particles in a waterfall-like fashion, making them move downwards and disappear after a few seconds. This is the foundation for all particle effects. Take a look at the documentation for :ref:`particle <doc_3d_particles_properties>` and :ref:`particle material <doc_process_material_properties>` properties to learn how to make particle effects more interesting.
de: Wenn Sie die obigen Schritte befolgt haben, sollte Ihr Partikelsystem nun Partikel in einer wasserfallähnlichen Art und Weise ausstoßen, so dass sie sich nach unten bewegen und nach ein paar Sekunden verschwinden. Dies ist die Grundlage für alle Partikeleffekte. Werfen Sie einen Blick in die Dokumentation zu den Propertys :ref:`particle <doc_3d_particles_properties>` und :ref:`particle material <doc_process_material_properties>`, um zu erfahren, wie Sie Partikeleffekte interessanter gestalten können.
ga: Má lean tú na céimeanna thuas, ba chóir go mbeadh do chóras cáithníní ag astú cáithníní ar bhealach eas, rud a fhágann go n-imíonn siad anuas agus go n-imíonn siad tar éis cúpla soicind. Is é seo an bunús le haghaidh gach éifeacht na gcáithníní. Breathnaigh ar an gcáipéisíocht le haghaidh :ref:`particle <doc_3d_particles_properties>` agus :ref:`ábhar cáithníní <doc_process_material_properties>` airíonna chun foghlaim conas éifeachtaí cáithníní a dhéanamh níos suimiúla.
it: Se hai seguito i passaggi precedenti, il tuo sistema di particelle dovrebbe ora emettere particelle a cascata, facendole muovere verso il basso e scomparire dopo pochi secondi. Questa è la base di tutti gli effetti particellari. Dai un'occhiata alla documentazione delle proprietà :ref:`particle <doc_3d_particles_properties>` e :ref:`particle material <doc_process_material_properties>` per imparare a rendere gli effetti particellari più interessanti.
pt_br: Se você seguiu os passos acima, seu sistema de partículas deve agora estar emitindo partículas de forma parecida com uma cachoeira, fazendo-as mover-se para baixo e desaparecer após alguns segundos. Esta é a base para todos os efeitos de partículas. Dê uma olhada na documentação das propriedades de :ref:`partículas <doc_3d_particles_properties>` e :ref:`material de partículas <doc_process_material_properties>` para aprender como tornar os efeitos de partículas mais interessantes.
ru: Если вы выполнили шаги выше, ваша система частиц должна теперь испускать частицы в водопадной манере, заставляя их двигаться вниз и исчезать через несколько секунд. Это основа для всех эффектов частиц. Ознакомьтесь с документацией по свойствам :ref:`particle <doc_3d_particles_properties>` и :ref:`particle material <doc_process_material_properties>`, чтобы узнать, как сделать эффекты частиц более интересными.
ta: மேலே உள்ள படிகளைப் பின்பற்றினால், உங்கள் துகள் அமைப்பு இப்போது நீர்வீழ்ச்சி போன்ற பாணியில் துகள்களை உமிழும், அவை கீழ்நோக்கி நகர்ந்து சில நொடிகளுக்குப் பிறகு மறைந்துவிடும். அனைத்து துகள் விளைவுகளுக்கும் இது அடித்தளம். இதற்கான ஆவணங்களைப் பாருங்கள்: குறிப்பு: `துகள் <doc_3d_particles_properties>` மற்றும்: குறிப்பு: `துகள்_பிராசச்_மாட்டேரியல்_பிராபர்டீச்>` துகள் விளைவுகளை எவ்வாறு சுவாரச்யமாக்குவது என்பதை அறிய பண்புகள்.
uk: Якщо ви виконали наведені вище кроки, ваша система частинок повинна випромінювати частинки у вигляді водоспаду, змушуючи їх рухатися вниз і зникати через кілька секунд. Це основа для всіх ефектів частинок. Перегляньте документацію щодо властивостей :ref:`particle <doc_3d_particles_properties>` і :ref:`particle material <doc_process_material_properties>`, щоб дізнатися, як зробити ефекти частинок цікавішими.
zh_hans: 如果遵循了上述步骤，你的粒子系统现在应该会以类似瀑布的方式发射粒子，其向下移动并在几秒后消失。这是所有粒子效果的基础。请查看\ :ref:`粒子 <doc_3d_particles_properties>`\ 和\ :ref:`粒子材质 <doc_process_material_properties>`\ 属性的文档，了解如何制作更有趣的粒子效果。
zh_tw: 如果你按照上述步驟操作，現在你的粒子系統應該會以類似瀑布的方式發射粒子，讓它們往下移動並在幾秒後消失。這是所有粒子特效的基礎。你可以參考 :ref:`粒子屬性 <doc_3d_particles_properties>` 以及 :ref:`粒子材質屬性 <doc_process_material_properties>` 的文件，進一步學習如何讓你的粒子特效更加有趣。

source: Particle conversion
de: Umwandlung von Partikeln
ga: Tiontú cáithníní
it: Conversione di particelle
ru: Конвертация частиц
ta: துகள் மாற்றம்
tr: Parçacık dönüşümü
uk: Перетворення частинок
zh_hans: 粒子转换
zh_tw: 粒子轉換

source: Turning GPU into CPU particles
de: Umwandlung von GPU- in CPU-Partikel
ga: GPU a iompú ina cháithníní LAP
it: Convertire le particelle GPU in CPU
pt_br: Transformando partículas de GPU em partículas de CPU
ru: Превращаем GPU в частицы CPU
ta: GPU ஐ சிபியு துகள்களாக மாற்றுகிறது
uk: Перетворення GPU на частинки CPU
zh_hans: 将 GPU 粒子转换为 CPU 粒子
zh_tw: 將 GPU 粒子轉換為 CPU 粒子

source: You can convert GPU particles to CPU particles at any time using the entry in the viewport menu. When you do so, keep in mind that not every feature of GPU particles is available for CPU particles, so the resulting particle system will look and behave differently from the original.
de: Sie können GPU-Partikel jederzeit in CPU-Partikel umwandeln, indem Sie den Eintrag im Viewport-Menü verwenden. Beachten Sie dabei, dass nicht alle Funktionen der GPU-Partikel auch für CPU-Partikel zur Verfügung stehen, sodass das resultierende Partikelsystem anders aussehen und sich anders verhalten wird als das Original.
ga: Is féidir leat cáithníní GPU a thiontú go cáithníní LAP ag am ar bith ag baint úsáide as an iontráil sa roghchlár viewport. Nuair a dhéanann tú amhlaidh, coinnigh i gcuimhne nach bhfuil gach gné de cháithníní GPU ar fáil do cháithníní LAP, mar sin beidh cuma agus iompraíonn an córas cáithníní mar thoradh air go difriúil ón gcáithníní bunaidh.
it: È possibile convertire le particelle GPU in particelle CPU in qualsiasi momento attraverso la voce nel menu nella viewport. Facendolo, tieni presente che non tutte le funzionalità delle particelle GPU sono disponibili per le particelle CPU, quindi il sistema di particelle risultante avrà un aspetto e un comportamento diversi dall'originale.
pt_br: Você pode converter partículas de GPU para partículas de CPU a qualquer momento usando a entrada no menu da viewport. Ao fazer isso, tenha em mente que nem todos os recursos de partículas de GPU estão disponíveis para partículas de CPU, então o sistema de partículas resultante parecerá e se comportará de forma diferente do original.
ru: Вы можете преобразовать частицы GPU в частицы CPU в любое время, используя запись в меню viewport. Когда вы это делаете, имейте в виду, что не все функции частиц GPU доступны для частиц CPU, поэтому полученная система частиц будет выглядеть и вести себя иначе, чем оригинал.
ta: வியூபோர்ட் பட்டியலில் உள்ளீட்டைப் பயன்படுத்தி எந்த நேரத்திலும் சி.பீ.யூ துகள்களை சிபியு துகள்களாக மாற்றலாம். நீங்கள் அவ்வாறு செய்யும்போது, சி.பீ.யூ துகள்களின் ஒவ்வொரு அம்சமும் சிபியு துகள்களுக்கு கிடைக்கவில்லை என்பதை நினைவில் கொள்ளுங்கள், எனவே இதன் விளைவாக வரும் துகள் அமைப்பு அசலில் இருந்து வித்தியாசமாக நடந்து கொள்ளும்.
uk: Ви можете будь-коли перетворити частинки графічного процесора на частинки процесора, використовуючи пункт у меню вікна перегляду. Коли ви це робите, майте на увазі, що не кожна функція частинок GPU доступна для частинок CPU, тому отримана система частинок виглядатиме та поводитиметься інакше, ніж оригінальна.
zh_hans: 你可以通过视口菜单中的条目随时将 GPU 粒子转换为 CPU 粒子。请注意，并非 GPU 粒子的所有功能都可用于 CPU 粒子，因而粒子系统生成的外观和行为将与原始粒子系统有所不同。
zh_tw: 你可以隨時透過檢視區（Viewport）選單中的選項，將 GPU 粒子轉換為 CPU 粒子。但請注意，並非所有 GPU 粒子的功能在 CPU 粒子中都適用，因此轉換後的粒子系統在外觀和行為上可能會與原來有所不同。
