Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/particles/creating_a_3d_particle_system.po
Languages: de, ga, it, pt_br, ru, ta, tr, uk, zh_hans, zh_tw

source: You can also convert CPU particles to GPU particles if you no longer need to use CPU particles. This is also done from the viewport menu.
de: Sie können auch CPU-Partikel in GPU-Partikel umwandeln, wenn Sie die CPU-Partikel nicht mehr benötigen. Dies geschieht ebenfalls über das Vieport-Menü.
ga: Is féidir leat cáithníní LAP a thiontú go cáithníní GPU mura gá duit cáithníní LAP a úsáid a thuilleadh. Déantar é seo freisin ón roghchlár viewport.
it: È anche possibile convertire le particelle CPU in particelle GPU se non c'è più bisogno di utilizzare le particelle CPU. Anche ciò si può fare dal menu nella viewport.
pt_br: Você também pode converter partículas de CPU para partículas de GPU se não precisar mais usar partículas de CPU. Isso também é feito a partir do menu da viewport.
ru: Вы также можете преобразовать частицы CPU в частицы GPU, если вам больше не нужно использовать частицы CPU. Это также делается из меню области просмотра.
ta: நீங்கள் இனி சிபியு துகள்களைப் பயன்படுத்தத் தேவையில்லை என்றால் நீங்கள் சிபியு துகள்களை GPU துகள்களாக மாற்றலாம். இது வியூபோர்ட் மெனுவிலிருந்தும் செய்யப்படுகிறது.
uk: Ви також можете перетворити частинки CPU на частинки GPU, якщо вам більше не потрібно використовувати частинки CPU. Це також робиться з меню вікна перегляду.
zh_hans: 如果你不再需要使用 CPU 粒子，也可以将其转换为 GPU 粒子，这也是通过视口菜单完成。
zh_tw: 如果不再需要 CPU 粒子，也可以將其轉換回 GPU 粒子，這同樣可以從檢視區選單中完成。

source: Some of the most notable features that are lost during the conversion include:
de: Einige der wichtigsten Merkmale, die bei der Konvertierung verloren gehen, sind:
ga: I measc cuid de na gnéithe is suntasaí a chailltear le linn an chomhshó tá:
it: Alcune delle funzionalità più importanti che vanno perse durante la conversione includono:
pt_br: Alguns dos recursos mais notáveis que são perdidos durante a conversão incluem:
ru: Некоторые из наиболее примечательных особенностей, которые теряются во время преобразования, включают в себя:
ta: மாற்றத்தின் போது இழந்த சில குறிப்பிடத்தக்க நற்பொருத்தங்கள் பின்வருமாறு:
uk: Деякі з найбільш помітних функцій, які втрачаються під час перетворення, включають:
zh_hans: 在转换过程中失去的一些显著特性包括：
zh_tw: 在轉換過程中，會失去以下幾項重要功能：

source: multiple draw passes
de: mehrere Zeichendurchläufe
ga: pas tarraingthe iolracha
it: molteplici passaggi di disegno
ru: несколько проходов отрисовки
ta: பல டிரா பாச்
uk: кілька розіграшів
zh_hans: 多重绘制通道
zh_tw: 多重繪製通道

source: turbulence
de: Turbulenzen
ga: suaitheadh
it: turbolenza
pt_br: turbulência
ru: турбулентность
ta: (காற்றுக்)கொந்தளிப்பு
uk: турбулентність
zh_hans: 湍流
zh_tw: 亂流

source: sub-emitters
de: Sub-Emitter
ga: fo-astaitheoirí
it: sotto-emettitori
ru: суб-эмиттеры
ta: துணை முன்மாதிரிகள்
tr: alt-yayıcılar
uk: підвипромінювачі
zh_hans: 子发射器
zh_tw: 子發射器

source: trails
de: Spuren
ga: cosáin
it: scie
pt_br: trilhas
ru: тропы
ta: தடங்கள்
uk: стежки
zh_hans: 尾迹
zh_tw: 拖尾

source: attractors
de: Attraktoren
ga: tarraingtí
it: attrattori
ru: аттракторы
ta: ஈர்ப்பவர்கள்
uk: атрактори
zh_hans: 吸引器
zh_tw: 吸引器

source: collision
de: Kollision
ga: imbhualadh
it: collisioni
ru: столкновения
ta: மோதுகை
tr: çarpışma
uk: зіткнення
zh_hans: 碰撞
zh_tw: 碰撞

source: You also lose the following properties:
de: Sie verlieren auch die folgenden Propertys:
ga: Cailleann tú na hairíonna seo a leanas freisin:
it: Si perdono anche le seguenti proprietà:
ru: Также теряются следующие свойства:
ta: பின்வரும் பண்புகளையும் இழக்கிறீர்கள்:
tr: Ayrıca aşağıdaki özellikleri de kaybedersiniz:
uk: Ви також втрачаєте такі властивості:
zh_hans: 你还会丢失以下属性：
zh_tw: 你也會失去以下屬性：

source: ``Amount Ratio``
de: ``Mengenverhältnis``
ga: ``Cóimheas Méideai`
it: ``Rapporto di quantità``
ta: `` தொகை விகிதம்``
uk: ``Коефіцієнт суми``
zh_hans: ``数量比（Amount Ratio）``
zh_tw: ``數量比例``

source: ``Interp to End``
de: ``Interp zum Ende``
ga: ``Interp go dtí deireadh ``
it: ``Interpola fino alla fine``
ta: `` முடிவுக்கு உட்பட்டது``
zh_hans: ``插值至结尾（Interp to End）``
zh_tw: ``插值至結束``

source: ``Damping as Friction``
de: ``Dämpfung als Reibung``
ga: ``Damping mar Friction``
it: ``Smorzamento come frizione``
ta: `` உராய்வாக ஈரப்பதம்``
uk: ``Демпінг як тертя``
zh_hans: ``阻尼作为摩擦（Damping as Friction）``
zh_tw: ``阻尼作為摩擦``

source: ``Emission Shape Offset``
de: ``Emissions-Shape-Offset``
ga: ``Oifigiú Cruth Astaíochta ``
it: ``Scostamento di forma d'emissione``
ta: `` உமிழ்வு வடிவம் ஆஃப்செட்``
tr: ``Yayılma Şekli Kayması``
uk: ``Зміщення форми випромінювання``
zh_hans: ``发射形状偏移（Emission Shape Offset）``
zh_tw: ``發射形狀偏移``

source: ``Emission Shape Scale``
de: ``Emissions-Shape-Skalierung``
ga: ``Scála Cruth Astaíochta ``
it: ``Scala forma d'emissione``
ta: `` உமிழ்வு வடிவ அளவு``
tr: ``Yayılma Şekli Ölçeği``
uk: ``Шкала форми випромінювання``
zh_hans: ``发射形状缩放（Emission Shape Scale）``
zh_tw: ``發射形狀縮放``

source: ``Inherit Velocity Ratio``
de: ``Geschwindigkeits-Verhältnis erben``
ga: ``Cóimheas Treochta Oidhreachta ``
it: ``Rapporto di velocità ereditata``
ta: `` விரைவு விகிதத்தை மரபுரிமை பெறவும்
uk: ``Наслідувати коефіцієнт швидкості``
zh_hans: ``继承速度比（Inherit Velocity Ratio）``
zh_tw: ``繼承速度比例``

source: ``Velocity Pivot``
de: ``Geschwindigkeits-Pivot``
it: ``Fulcro della velocità``
ta: `` விரைவு முன்னிலை``
zh_hans: ``速度轴心（Velocity Pivot）``
zh_tw: ``速度樞紐``

source: ``Directional Velocity``
de: ``Richtungsgeschwindigkeit``
ga: ``Luas Treorach``
it: ``Velocità direzionale``
ta: `` திசை வேகம்``
tr: ``Yönlü Hız``
uk: ``Направлена швидкість``
zh_hans: ``方向速度（Directional Velocity）``
zh_tw: ``方向速度``

source: ``Radial Velocity``
de: ``Radialgeschwindigkeit``
ga: ``Luas Gathaigh``
it: ``Velocità radiale``
ta: `` ரேடியல் வேகம்``
tr: ``Dairesel Hız``
uk: ``Променева швидкість``
zh_hans: ``径向速度（Radial Velocity）``
zh_tw: ``徑向速度``

source: ``Velocity Limit``
de: ``Geschwindigkeits-Limit``
ga: ``Teorainn Veloca``
it: ``Limite velocità``
pt_br: ``Velocidade Limite``
ru: ``Velocity Limit (Ограничение скорости)``
ta: `` திசைவேக வரம்பு``
uk: ``Обмеження швидкості``
zh_hans: ``速度限制（Velocity Limit）``
zh_tw: ``速度上限``

source: ``Scale Over Velocity``
de: ``Skalierung über Geschwindigkeit``
ga: ``Scála thar Luas ``
it: ``Scala relativa alla velocità``
pt_br: ``Escala Sobre Velocidade``
ru: ``Scale Over Velocity (Масштаб важнее скорости)``
ta: `` விரைவு மீது அளவுகோல்``
zh_hans: ``随速度缩放（Scale Over Velocity）``
zh_tw: ``速度縮放``

source: Converting GPU particles to CPU particles can become necessary when you want to release a game on older devices that don't support modern graphics APIs.
de: Die Umwandlung von GPU-Partikeln in CPU-Partikel kann notwendig werden, wenn Sie ein Spiel auf älteren Geräten veröffentlichen wollen, die keine modernen Grafik-APIs unterstützen.
ga: Is féidir go mbeidh gá le cáithníní GPU a thiontú go cáithníní LAP agus tú ag iarraidh cluiche a scaoileadh ar ghléasanna níos sine nach dtacaíonn APInna grafaic nua-aimseartha leo.
it: La conversione delle particelle GPU in particelle CPU può rivelarsi necessaria quando si desidera rilasciare un gioco su dispositivi più vecchi che non supportano le API grafiche moderne.
pt_br: A conversão de partículas de GPU para partículas de CPU pode se tornar necessária quando você quiser lançar um jogo em dispositivos mais antigos que não suportam APIs gráficas modernas.
ru: Преобразование частиц графического процессора в частицы центрального процессора может стать необходимым, если вы хотите выпустить игру на старых устройствах, которые не поддерживают современные графические API-ы.
ta: நவீன கிராபிக்ச் பநிஇ களை ஆதரிக்காத பழைய சாதனங்களில் ஒரு விளையாட்டை வெளியிட விரும்பினால், GPU துகள்களை சிபியு துகள்களாக மாற்றுவது அவசியமாகிவிடும்.
uk: Перетворення частинок GPU на частинки CPU може стати необхідним, якщо ви хочете випустити гру на старіших пристроях, які не підтримують сучасні графічні API.
zh_hans: 要在不支持现代图形 API 的较旧设备上发布游戏时，可能有必要将 GPU 粒子转换为 CPU 粒子。
zh_tw: 當你要在不支援現代圖形 API 的舊裝置上發行遊戲時，將 GPU 粒子轉換為 CPU 粒子可能是必要的。
