Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/particles/index.po
Languages: ga, it, pt_br, ru, ta, uk, zh_hant

source: Particle systems (3D)
ga: Córais cáithníní (3D)
it: Sistemi di particelle (2D)
ru: Системы частиц (3D)
ta: துகள் அமைப்புகள் (3 டி)
uk: Системи частинок (3D)
zh_hant: 粒子系統（3D）

source: This section of the tutorial covers (3D) GPU-accelerated particle systems. Most of the things discussed here apply to CPU particles as well.
ga: Clúdaíonn an chuid seo den rang teagaisc córais cáithníní luasaithe GPU (3D). Baineann an chuid is mó de na rudaí a phléitear anseo le cáithníní LAP freisin.
it: Questa sezione del tutorial tratta i sistemi di particelle (3D) accelerati dalla GPU. La maggior parte degli argomenti trattati qui si applica anche alle particelle basate sulla CPU.
pt_br: Esta seção do tutorial cobre os sistemas de partículas (3D) acelerados por GPU. A maioria das coisas discutidas aqui se aplica também às partículas de CPU.
ta: டுடோரியல் கவர்கள் (3 டி) சி.பீ.யூ-முடுக்கப்பட்ட துகள் அமைப்புகளின் இந்த பகுதி. இங்கு விவாதிக்கப்பட்ட பெரும்பாலான விசயங்கள் சிபியு துகள்களுக்கும் பொருந்தும்.
uk: Цей розділ підручника охоплює (3D) системи частинок із прискоренням GPU. Більшість речей, які тут обговорюються, також стосуються частинок ЦП.
zh_hant: 本教學的這一部分介紹 (3D) GPU 加速的粒子系統。這裡討論的大部分內容也適用於 CPU 顆粒。

source: Introduction
ga: Réamhrá
it: Introduzione
pt_br: Introdução
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_hant: 前言

source: You can use particle systems to simulate complex physical effects like fire, sparks, smoke, magical effects, and many more. They are very well suited for creating dynamic and organic behavior and adding "life" to your scenes.
ga: Is féidir leat córais cháithníní a úsáid chun éifeachtaí fisiciúla casta cosúil le tine, spréacha, deatach, éifeachtaí draíochta, agus go leor eile a insamhail. Tá siad an-oiriúnach chun iompar dinimiciúil agus orgánach a chruthú agus “saol” a chur le do radhairc.
it: È possibile utilizzare sistemi di particelle per simulare effetti fisici complessi come fuoco, scintille, fumo, effetti magici e molti altri. Sono particolarmente adatti per creare comportamenti dinamici e organici e aggiungere "vita" alle scene.
pt_br: Você pode usar sistemas de partículas para simular efeitos físicos complexos como fogo, faíscas, fumaça, efeitos mágicos e muitos outros. Eles são muito adequados para criar comportamentos dinâmicos e orgânicos e adicionar "vida" às suas cenas.
ta: தீ, தீப்பொறிகள், புகை, மந்திர விளைவுகள் மற்றும் பல போன்ற சிக்கலான உடல் விளைவுகளை உருவகப்படுத்த நீங்கள் துகள் அமைப்புகளைப் பயன்படுத்தலாம். மாறும் மற்றும் கரிம நடத்தை உருவாக்குவதற்கும் உங்கள் காட்சிகளில் "வாழ்க்கையை" சேர்ப்பதற்கும் அவை மிகவும் பொருத்தமானவை.
uk: Ви можете використовувати системи частинок для імітації складних фізичних ефектів, таких як вогонь, іскри, дим, магічні ефекти та багато іншого. Вони дуже добре підходять для створення динамічної та органічної поведінки та додавання «життя» вашим сценам.
zh_hant: 您可以使用粒子系統來模擬複雜的物理效果，例如火焰、火花、煙霧、魔法效果等等。它們非常適合建立動態和有機的行為，並為您的場景新增“生命”。

source: The idea is that a particle is emitted at a fixed interval and with a fixed lifetime. During its lifetime, every particle will have the same base behavior. What makes each particle different from the others and creates the organic look is the randomness that you can add to most of its parameters and behaviors.
ga: Is é an smaoineamh go n-astaítear cáithnín ag eatramh seasta agus le saol seasta. Le linn a shaoil, beidh an bonn-iompar céanna ag gach cáithníní. Is é an rud a fhágann go bhfuil gach cáithnín difriúil ó na cinn eile agus a chruthaíonn an cuma orgánach ná an randamachas is féidir leat a chur leis an gcuid is mó dá pharaiméadair agus iompraíochtaí.
it: L'idea è che una particella è emessa a intervalli fissi e con una durata di vita fissa. Durante la sua vita, ogni particella avrà lo stesso comportamento di base. Ciò che rende ogni particella diversa dalle altre, e ne determina l'aspetto organico, è la casualità che si può aggiungere a gran parte dei suoi parametri e comportamenti.
ta: ஒரு துகள் ஒரு நிலையான இடைவெளியில் மற்றும் ஒரு நிலையான வாழ்நாளில் வெளியேற்றப்படுகிறது என்பது சிந்தனை. அதன் வாழ்நாளில், ஒவ்வொரு துகளுக்கும் ஒரே அடிப்படை நடத்தை இருக்கும். ஒவ்வொரு துகள்களும் மற்றவர்களிடமிருந்து வேறுபட்டவை மற்றும் கரிம தோற்றத்தை உருவாக்குவது என்னவென்றால், அதன் பெரும்பாலான அளவுருக்கள் மற்றும் நடத்தைகளில் நீங்கள் சேர்க்கக்கூடிய சீரற்ற தன்மை.
uk: Ідея полягає в тому, що частинка випромінюється через фіксований інтервал і з фіксованим часом життя. Протягом свого життя кожна частинка матиме однакову базову поведінку. Що робить кожну частинку відмінною від інших і створює органічний вигляд, так це випадковість, яку ви можете додати до більшості її параметрів і поведінки.
zh_hant: 這個想法是以固定的間隔發射具有固定的壽命的 "粒子". 在其生命週期中, 每個粒子都具有相同的基本行為. 讓每個粒子變得不同並提供整體更加 "有機" 外觀的是與各個參數相關的 "隨機性". 實質上, 建立粒子系統意味著設定基本物理參數, 然後為它們新增隨機性.

source: Every particle system you create in Godot consists of two main parts: particles and emitters.
ga: Tá dhá phríomhchuid i ngach córas cáithníní a chruthaíonn tú i Godot: cáithníní agus astóirí.
it: Ogni sistema di particelle creato in Godot è costituito da due parti principali: particelle ed emettitori.
pt_br: Cada sistema de partículas que você cria em Godot consiste em duas partes principais: partículas e emissores.
ru: Каждая система частиц, которую вы создаете в Godot, состоит из двух основных частей: частиц и эмиттеров.
ta: கோடோட்டில் நீங்கள் உருவாக்கும் ஒவ்வொரு துகள் அமைப்பும் இரண்டு முக்கிய பகுதிகளைக் கொண்டுள்ளது: துகள்கள் மற்றும் உமிழ்வுகள்.
uk: Кожна система частинок, яку ви створюєте в Godot, складається з двох основних частин: частинок і емітерів.
zh_hant: 您在 Godot 中建立的每個粒子系統都包含兩個主要部分：粒子和發射器。

source: Particles
ga: cáithníní
it: Particelle
pt_br: Partículas
ru: Частицы
ta: துகள்கள்

source: A particle is the visible part of a particle system. It's what you see on the screen when a particle system is active: The tiny specks of dust, the flames of a fire, the glowing orbs of a magical effect. You can have anywhere between a couple hundred and tens of thousands of particles in a single system. You can randomize a particle's size, its speed and movement direction, and change its color over the course of its lifetime. When you think of a fire, you can think of all the little embers flying away from it as individual particles.
ga: Is é cáithnín an chuid infheicthe de chóras cáithníní. Is é an méid a fheiceann tú ar an scáileán nuair a bhíonn córas cáithníní gníomhach: Na pointí beaga deannaigh, lasair tine, orbs ghala éifeacht draíochta. Is féidir leat áit ar bith idir cúpla céad agus na mílte cáithníní a bheith agat i gcóras amháin. Is féidir leat méid cáithníní, a luas agus a threo gluaiseachta a randamú, agus a dath a athrú le linn a shaoil. Nuair a smaoiníonn tú ar tine, is féidir leat smaoineamh ar na brabhar beaga go léir ag eitilt ar shiúl uaidh mar cháithníní aonair.
it: Una particella è la parte visibile di un sistema di particelle. È ciò che si vede sullo schermo quando un sistema di particelle è attivo: minuscoli granelli di polvere, le fiamme di un fuoco, le sfere brillanti di un effetto magico. È possibile avere da un paio di centinaia a decine di migliaia di particelle in un singolo sistema. Per una particella, è possibile randomizzarne la dimensione, la velocità e la direzione di movimento, e cambiarne il colore nel corso della sua durata. Pensando a un fuoco, tutte le piccole braci che si allontanano da esso si possono interpretare come singole particelle.
pt_br: Uma partícula é a parte visível de um sistema de partículas. É o que você vê na tela quando um sistema de partículas está ativo: os pequenos grãos de poeira, as chamas de um fogo, as orbes brilhantes de um efeito mágico. Você pode ter entre algumas centenas e dezenas de milhares de partículas em um único sistema. Você pode randomizar o tamanho, a velocidade e a direção do movimento de uma partícula, e mudar sua cor ao longo de sua vida útil. Quando você pensa em um fogo, você pode pensar em todas as pequenas brasas voando para longe dele como partículas individuais.
ru: Частица - это видимая часть системы частиц. Это то, что вы видите на экране, когда система частиц активна: Крошечные пылинки, пламя огня, светящиеся шары магического эффекта. В одной системе может быть от пары сотен до десятков тысяч частиц. Вы можете рандомизировать размер частицы, ее скорость и направление движения, а также менять ее цвет в течение всего времени жизни. Когда вы думаете о пожаре, вы можете представить себе все маленькие угольки, разлетающиеся от него, как отдельные частицы.
ta: ஒரு துகள் ஒரு துகள் அமைப்பின் புலப்படும் பகுதியாகும். ஒரு துகள் அமைப்பு செயலில் இருக்கும்போது திரையில் நீங்கள் காண்பது இதுதான்: தூசியின் சிறிய புள்ளிகள், நெருப்பின் தீப்பிழம்புகள், ஒரு மந்திர விளைவின் ஒளிரும் உருண்டைகள். ஒரே அமைப்பில் நீங்கள் ஒரு இணை நூற்று பல்லாயிரக்கணக்கான துகள்களுக்கு இடையில் எங்கும் இருக்கலாம். நீங்கள் ஒரு துகள் அளவு, அதன் விரைவு மற்றும் இயக்க திசையை சீரற்றதாக மாற்றலாம் மற்றும் அதன் வாழ்நாளில் அதன் நிறத்தை மாற்றலாம். நீங்கள் ஒரு நெருப்பைப் பற்றி நினைக்கும் போது, அதிலிருந்து விலகிச் செல்லும் அனைத்து சிறிய எம்பர்களும் தனிப்பட்ட துகள்களாக சிந்திக்கலாம்.
uk: Частинка - це видима частина системи частинок. Це те, що ви бачите на екрані, коли активна система частинок: крихітні порошинки, полум’я вогню, сяючі кулі з магічним ефектом. В одній системі може бути від кількох сотень до десятків тисяч частинок. Ви можете рандомізувати розмір частинки, її швидкість і напрямок руху, а також змінювати її колір протягом її життя. Коли ви думаєте про вогонь, ви можете уявити всі маленькі вуглинки, що відлітають від нього, як окремі частинки.
zh_hant: 粒子是粒子系統的可見部分。這就是當粒子系統處於活動狀態時您在螢幕上看到的內容：微小的塵埃、火焰、魔法效果的發光球體。單一系統中可以有幾百到數萬個粒子。您可以隨機化粒子的大小、速度和運動方向，並在其生命週期中改變其顏色。當你想到火時，你可以把所有從火中飛走的小餘燼想像成單一粒子。

source: Emitters
ga: Aistritheoirí
it: Emettitori
ta: உமிழ்ப்பவர்கள்
uk: Випромінювачі
zh_hant: 抖動

source: An emitter is what's creating the particles. Emitters are usually not visible, but they can have a shape. That shape controls where and how particles are spawned, for example whether they should fill a room like dust or shoot away from a single point like a fountain. Going back to the fire example, an emitter would be the heat at the center of the fire that creates the embers and the flames.
ga: Is é astaitheoir an rud atá ag cruthú na cáithníní. De ghnáth ní bhíonn astairí le feiceáil, ach is féidir leo cruth a bheith acu. Rialaíonn an cruth sin cá háit agus conas a spreagtar cáithníní, mar shampla cibé acu ba chóir dóibh seomra cosúil le deannach a líonadh nó lámhach ó phointe amháin cosúil le tobair. Ag dul ar ais chuig an sampla dóiteáin, ba é astaitheoir an teas i lár an tine a chruthaíonn na brabhar agus na lasair.
it: Un emettitore è ciò che crea le particelle. Gli emettitori di solito non sono visibili, ma possono avere una forma. Questa forma controlla dove e come le particelle vengono generate, ad esempio se devono riempire una stanza come polvere oppure schizzare via da un singolo punto come una fontana. Tornando all'esempio del fuoco, un emettitore sarebbe il calore al centro del fuoco che crea le braci e le fiamme.
pt_br: Um emissor é o que está criando as partículas. Os emissores geralmente não são visíveis, mas podem ter uma forma. Essa forma controla onde e como as partículas são criadas, por exemplo, se devem preencher uma sala como poeira ou serem disparadas de um único ponto como uma fonte. Voltando ao exemplo do fogo, um emissor seria o calor no centro do fogo que cria as brasas e as chamas.
ru: Эмиттер - это то, что создает частицы. Обычно эмиттеры не видны, но они могут иметь форму. Эта форма определяет, где и как порождаются частицы, например, должны ли они заполнять комнату, как пыль, или вылетать из одной точки, как фонтан. Возвращаясь к примеру с огнем, эмиттер - это тепло в центре огня, которое создает угли и пламя.
ta: ஒரு உமிழ்ப்பான் என்பது துகள்களை உருவாக்குகிறது. உமிழ்ப்பவர்கள் பொதுவாகத் தெரியவில்லை, ஆனால் அவர்களுக்கு ஒரு வடிவம் இருக்க முடியும். அந்த வடிவம் துகள்கள் எங்கு, எப்படி உருவாகின்றன என்பதைக் கட்டுப்படுத்துகிறது, எடுத்துக்காட்டாக அவை தூசி போன்ற ஒரு அறையை நிரப்ப வேண்டுமா அல்லது நீரூற்று போன்ற ஒரு புள்ளியிலிருந்து சுட வேண்டுமா. நெருப்பு உதாரணத்திற்குச் செல்லும்போது, ஒரு உமிழ்ப்பான் எம்பர்களையும் தீப்பிழம்புகளையும் உருவாக்கும் நெருப்பின் மையத்தில் வெப்பமாக இருப்பார்.
uk: Емітер - це те, що створює частинки. Випромінювачі зазвичай не видно, але вони можуть мати форму. Ця форма контролює, де і як породжуються частинки, наприклад, чи мають вони заповнювати кімнату, як пил, чи вилітати з однієї точки, як фонтан. Повертаючись до прикладу з пожежею, випромінювач — це тепло в центрі вогню, яке створює вугілля та полум’я.
zh_hant: 發射器是產生粒子的東西。發射器通常不可見，但它們可以具有形狀。該形狀控製粒子產生的位置和方式，例如它們是否應該像灰塵一樣充滿房間，或者像噴泉一樣從單點射出。回到火的例子，發射器是火中心的熱量，產生餘燼和火焰。

source: Node overview
ga: Forbhreathnú Nód
it: Panoramica dei nodi
ta: முனை கண்ணோட்டம்
uk: Огляд вузла
zh_hant: 節點屬性

source: A list of nodes related to 3D particles
ga: Liosta nóid a bhaineann le cáithníní 3D
it: Un elenco di nodi relativi alle particelle 3D
pt_br: Uma lista de nós relacionados a partículas 3D
ru: Список узлов, относящихся к 3D-частицам
ta: 3D துகள்கள் தொடர்பான முனைகளின் பட்டியல்
uk: Список вузлів, пов’язаних із 3D-частинками
zh_hant: 在群組中的節點列表

source: All 3D particle nodes available in Godot
ga: Gach nóid cáithníní 3D atá ar fáil i Godot
it: Tutti i nodi di particelle 3D disponibili in Godot
pt_br: Todos os nós de partículas 3D disponíveis no Godot
ru: Все узлы 3D-частиц, доступные в Godot
ta: கோடோட்டில் கிடைக்கும் அனைத்து 3 டி துகள் முனைகளும்
uk: Усі тривимірні вузли частинок доступні в Godot
zh_hant: Godot 中可用的所有 3D 粒子節點

source: There are two types of 3D particle systems in Godot: :ref:`class_GPUParticles3D`, which are processed on the GPU, and :ref:`class_CPUParticles3D`, which are processed on the CPU.
ga: Tá dhá chineál córais cáithníní 3D i Godot: :ref: `Class_GPUparticles3D`, a phróiseáiltear ar an GPU, agus:ref: `Class_cpuParticles3D`, a phróiseáiltear ar an LAP.
it: In Godot ci sono due tipi di sistemi di particelle 3D: :ref:`class_GPUParticles3D`, che sono elaborati sulla GPU, e :ref:`class_CPUParticles3D`, che sono elaborati sulla CPU.
pt_br: Existem dois tipos de sistemas de partículas 3D no Godot: :ref:`class_GPUParticles3D`, que são processadas na GPU, e :ref:`class_CPUParticles3D`, que são processadas na CPU.
ru: В Godot есть два типа систем 3D-частиц: :ref:`class_GPUParticles3D`, которые обрабатываются на GPU, и :ref:`class_CPUParticles3D`, которые обрабатываются на CPU.
ta: கோடோட்டில் 3 டி துகள் அமைப்புகளில் இரண்டு வகைகள் உள்ளன :: ref: `class_gpuparticles3d`, அவை GPU இல் செயலாக்கப்படுகின்றன, மேலும்: ref:` class_cpuparticles3d`, அவை சிபியு இல் செயலாக்கப்படுகின்றன.
uk: У Godot існує два типи систем 3D-частинок: :ref:`class_GPUParticles3D`, які обробляються на GPU, і :ref:`class_CPUParticles3D`, які обробляються на CPU.
zh_hant: Godot 中有兩種 3D 粒子系統：:ref:`class_GPUParticles3D` （由 GPU 處理），以及 :ref:`class_CPUParticles3D` （由 CPU 處理）。

source: CPU particle systems are less flexible than their GPU counterpart, but they work on a wider range of hardware and provide better support for older devices and mobile phones. Because they are processed on the CPU, they are not as performant as GPU particle systems and can't render as many individual particles. In addition they currently do not have all the available options GPU particles have for control.
ga: Níl córais cháithníní LAP chomh solúbtha ná a gcomhghleacaí GPU, ach oibríonn siad ar raon níos leithne crua-earraí agus soláthraíonn siad tacaíocht níos fearr do ghléasanna agus d'fhóin phóca Toisc go ndéantar iad a phróiseáil ar an LAP, níl siad chomh feidhmiúil le córais cháithníní GPU agus ní féidir leo an oiread cáithníní aonair a rinneadh. Ina theannta sin níl na roghanna go léir atá ar fáil acu faoi láthair atá ag cáithníní GPU le rialú.
it: I sistemi di particelle sulla CPU sono meno flessibili delle loro controparti sulla GPU, ma funzionano su una gamma più ampia di hardware e offrono un supporto migliore per dispositivi e telefoni più datati. Poiché sono elaborati dalla CPU, non sono performanti quanto i sistemi di particelle sulla GPU e non possono renderizzare altrettante particelle singole. Inoltre, al momento non offrono tutte le opzioni disponibili in confronto alle particelle sulla GPU.
pt_br: Os sistemas de partículas de CPU são menos flexíveis que os seus equivalentes de GPU, mas funcionam em uma variedade maior de hardware e oferecem melhor suporte para dispositivos mais antigos e celulares. Como são processados na CPU, eles não são tão performáticos quanto os sistemas de partículas de GPU e não podem renderizar tantas partículas individuais. Além disso, atualmente não possuem todas as opções de controle disponíveis nas partículas de GPU.
ru: Системы частиц на CPU менее гибкие, чем их аналоги на GPU, но они работают на более широком спектре оборудования и обеспечивают лучшую поддержку старых устройств и мобильных телефонов. Поскольку они обрабатываются на CPU, они не так производительны, как системы частиц GPU, и не могут отрисовывать такое количество отдельных частиц. Кроме того, в настоящее время они не имеют всех доступных опций для управления частицами GPU.
ta: சிபியு துகள் அமைப்புகள் அவற்றின் சி.பீ.யூ எண்ணை விட குறைவான நெகிழ்வானவை, ஆனால் அவை பரந்த அளவிலான வன்பொருளில் வேலை செய்கின்றன மற்றும் பழைய சாதனங்கள் மற்றும் மொபைல் போன்களுக்கு சிறந்த ஆதரவை வழங்குகின்றன. அவை சிபியு இல் செயலாக்கப்படுவதால், அவை சி.பீ.யூ துகள் அமைப்புகளைப் போல செயல்படவில்லை, மேலும் பல தனிப்பட்ட துகள்களை வழங்க முடியாது. கூடுதலாக, அவர்கள் தற்போது கிடைக்கக்கூடிய அனைத்து விருப்பங்களும் இல்லை, சி.பீ.யூ துகள்கள் கட்டுப்பாட்டுக்கு உள்ளன.
uk: Системи частинок центрального процесора менш гнучкі, ніж їхні аналоги GPU, але вони працюють на більш широкому діапазоні апаратного забезпечення та забезпечують кращу підтримку старіших пристроїв і мобільних телефонів. Оскільки вони обробляються центральним процесором, вони не такі продуктивні, як системи частинок GPU, і не можуть відтворити стільки окремих частинок. Крім того, наразі вони не мають усіх доступних опцій керування частинками GPU.
zh_hant: CPU 粒子系統的彈性不如 GPU 版本，但它們能在更廣泛的硬體上運作，並為較舊的裝置和手機提供更好的支援。由於它們是在 CPU 上處理的，效能不如 GPU 粒子系統，且無法算繪那麼多獨立的粒子。此外，它們目前也沒有 GPU 粒子所擁有的所有控制選項。

source: GPU particle systems run on the GPU and can render hundreds of thousands of particles on modern hardware. You can write custom particle shaders for them, which makes them very flexible. You can also make them interact with the environment by using attractor and collision nodes.
ga: Ritheann córais cáithníní GPU ar an GPU agus is féidir leo na céadta mílte cáithníní a dhéanamh ar chrua-earraí nua-aimseartha. Is féidir leat scáthóirí cáithníní saincheaptha a scríobh dóibh, rud a fhágann go bhfuil siad an-solúbtha. Is féidir leat iad a chur idirghníomhú leis an gcomhshaol freisin trí nóid tarraingthe agus imbhuailte a úsáid.
it: I sistemi di particelle sulla GPU possono renderizzare centinaia di migliaia di particelle su hardware moderno. È possibile scrivere shader di particelle personalizzati, il che li rende molto flessibili. È anche possibile farli interagire con l'ambiente utilizzando nodi di attrattore e di collisione.
pt_br: Sistemas de partículas de GPU rodam na GPU e podem renderizar centenas de milhares de partículas em hardware moderno. Você pode escrever shaders de partículas customizados para eles, o que os torna muito flexíveis. Você também pode fazê-los interagir com o ambiente usando nós de atração e colisão.
ru: GPU-системы частиц работают на GPU и могут рендерить сотни тысяч частиц на современном оборудовании. Для них можно писать собственные шейдеры частиц, что делает их очень гибкими. Вы также можете заставить их взаимодействовать с окружением, используя узлы аттракторов и коллизий.
ta: சி.பீ.யூ துகள் அமைப்புகள் சி.பீ.யில் இயங்குகின்றன மற்றும் நவீன வன்பொருளில் நூறாயிரக்கணக்கான துகள்களை வழங்க முடியும். அவர்களுக்காக தனிப்பயன் துகள் சேடர்களை நீங்கள் எழுதலாம், இது மிகவும் நெகிழ்வானதாக ஆக்குகிறது. ஈர்ப்பவர் மற்றும் மோதல் முனைகளைப் பயன்படுத்துவதன் மூலம் அவற்றை சூழலுடன் தொடர்பு கொள்ளலாம்.
uk: Системи частинок GPU працюють на GPU та можуть відтворювати сотні тисяч частинок на сучасному обладнанні. Ви можете написати для них власні шейдери частинок, що робить їх дуже гнучкими. Ви також можете змусити їх взаємодіяти з навколишнім середовищем, використовуючи вузли атрактора та зіткнення.
zh_hant: GPU 粒子系統在 GPU 上運作，可在現代硬體上算繪數十萬個粒子。您可以為它們編寫自訂粒子著色器，這使得它們非常靈活。您還可以使用吸引器和碰撞節點使它們與環境互動。

source: There are three particle attractor nodes: :ref:`class_GPUParticlesAttractorBox3D`, :ref:`class_GPUParticlesAttractorSphere3D`, and :ref:`class_GPUParticlesAttractorVectorField3D`. An attractor node applies a force to all particles in its reach and pulls them closer or pushes them away based on the direction of that force.
ga: Tá trí nóid tarraingthe cáithníní ann: :ref: `Class_GPUparticlesAttractorBox3D`, :ref: `Class_GPUParticlesAttractorSphere3D`, agus:ref: `Class_GPUParticlesAttractorVectorField3D`. Cuireann nód tarraingthe fórsa i bhfeidhm ar na cáithníní go léir atá ina shroicheadh agus tarraingíonn sé níos gaire iad nó iad a bhrú ar shiúl bunaithe ar threo na fórsa sin.
it: Ci sono tre nodi attrattori di particelle: :ref:`class_GPUParticlesAttractorBox3D`, :ref:`class_GPUParticlesAttractorSphere3D` e :ref:`class_GPUParticlesAttractorVectorField3D`. Un nodo attrattore applica una forza a tutte le particelle nel suo raggio d'azione e le avvicina o le allontana in base alla direzione di tale forza.
pt_br: Existem três nós de atração de partículas: :ref:`class_GPUParticlesAttractorBox3D`, :ref:`class_GPUParticlesAttractorSphere3D`, e :ref:`class_GPUParticlesAttractorVectorField3D`. Um nó de atração aplica uma força a todas as partículas ao seu alcance e as puxa para mais perto ou as empurra para longe com base na direção dessa força.
ru: Существует три узла аттрактора частиц: :ref:`class_GPUParticlesAttractorBox3D`, :ref:`class_GPUParticlesAttractorSphere3D` и :ref:`class_GPUParticlesAttractorVectorField3D`. Узел аттрактора прикладывает силу ко всем частицам в зоне его действия и притягивает или отталкивает их в зависимости от направления этой силы.
ta: மூன்று துகள் கவச முனைகள் உள்ளன :: குறிப்பு: `class_gpuparticlesattractorbox3d`,: ref:` class_gpuparticlesattractorsphere3d`, மற்றும்: ref: `class_gpuparticlesattroctorvectorfield3d`. ஒரு ஈர்ப்பவர் முனை அதன் வரம்பில் உள்ள அனைத்து துகள்களுக்கும் ஒரு சக்தியைப் பயன்படுத்துகிறது மற்றும் அவற்றை நெருக்கமாக இழுக்கிறது அல்லது அந்த சக்தியின் திசையின் அடிப்படையில் அவற்றைத் தள்ளிவிடுகிறது.
uk: Є три вузли атрактора частинок: :ref:`class_GPUParticlesAttractorBox3D`, :ref:`class_GPUParticlesAttractorSphere3D` і :ref:`class_GPUParticlesAttractorVectorField3D`. Вузол атрактора застосовує силу до всіх частинок, які знаходяться в його досяжності, і притягує їх ближче або відштовхує залежно від напрямку цієї сили.
zh_hant: Godot 有三種粒子吸引器節點：:ref:`class_GPUParticlesAttractorBox3D`、:ref:`class_GPUParticlesAttractorSphere3D` 以及 :ref:`class_GPUParticlesAttractorVectorField3D`。吸引器節點會對其範圍內所有粒子施加力，根據方向將粒子拉近或推遠。
