Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/particles/index.po
Languages: ga, it, pt_br, ru, ta, uk, zh_hant

source: There are several particle collision nodes. :ref:`class_GPUParticlesCollisionBox3D` and :ref:`class_GPUParticlesCollisionSphere3D` are the simple ones. You can use them to create basic shapes like boxes, a floor, or a wall that particles collide with. The other two nodes provide more complex collision behavior. The :ref:`class_GPUParticlesCollisionSDF3D` is useful when you want indoor scenes to collide with particles without having to create all the individual box and sphere colliders by hand. If you want particles to collide with large outdoor scenes, you would use the :ref:`class_GPUParticlesCollisionHeightField3D` node. It creates a heightmap of your world and the objects in it and uses that for large-scale particle collisions.
ga: Tá roinnt nóid imbhuailte cáithníní ann. :ref: `Class_GPUparticlesCollisionBox3D` agus:ref: `Class_GPUParticlesCollisionsPhere3D` iad na cinn simplí. Is féidir leat iad a úsáid chun cruthanna bunúsacha a chruthú cosúil le boscaí, urlár, nó balla a imbhuaileann cáithníní leo. Soláthraíonn an dá nóid eile iompar imbhuailte níos casta. Tá an:ref: `Class_GPUparticlesCollisionSDF3D` úsáideach nuair is mian leat radhairc faoi dhíon imbhualadh le cáithníní gan na bosca aonair agus na imbhuailtí sféar uile a chruthú de láimh. Más mian leat cáithníní a imbhualadh le radhairc mhóra lasmuigh, úsáidfeá an nód: ref: `Class_GPUparticlesCollisionHeightField3D`. Cruthaíonn sé léarscáil airde de do shaol agus de na rudaí ann agus úsáideann sé é sin le haghaidh imbhuailtí cáithníní ar scála mór.
it: Ci sono vari nodi di collisione di particelle. :ref:`class_GPUParticlesCollisionBox3D` e :ref:`class_GPUParticlesCollisionSphere3D` sono quelli più semplici. È possibile utilizzarli per creare forme base come scatole, un pavimento o un muro con cui le particelle collidono. Gli altri due nodi forniscono un comportamento di collisione più complesso. :ref:`class_GPUParticlesCollisionSDF3D` è utile quando si desidera che le scene al coperto collidano con le particelle senza dover creare manualmente tutti i singoli collisori di scatole e sfere. Se si desidera che le particelle collidano con grandi scene all'aperto, si utilizza il nodo :ref:`class_GPUParticlesCollisionHeightField3D`. Crea una heightmap del mondo e degli oggetti in esso contenuti e la utilizza per collisioni di particelle su larga scala.
pt_br: Existem vários nós de colisão de partículas. :ref:`class_GPUParticlesCollisionBox3D` e :ref:`class_GPUParticlesCollisionSphere3D` são os mais simples. Você pode usá-los para criar formas básicas como caixas, um chão ou uma parede com as quais as partículas colidem. Os outros dois nós fornecem um comportamento de colisão mais complexo. O :ref:`class_GPUParticlesCollisionSDF3D` é útil quando você quer que as cenas internas colidam com partículas sem ter que criar todos os colliders de caixa e esfera individualmente à mão. Se você quiser que as partículas colidam com grandes cenas externas, você usaria o nó :ref:`class_GPUParticlesCollisionHeightField3D`. Ele cria um mapa de altura do seu mundo e dos objetos nele e o usa para colisões de partículas em larga escala.
ru: Существует несколько узлов столкновения частиц. :ref:`class_GPUParticlesCollisionBox3D` и :ref:`class_GPUParticlesCollisionSphere3D` - самые простые. С их помощью можно создать базовые фигуры, такие как коробки, пол или стена, с которыми сталкиваются частицы. Два других узла обеспечивают более сложное поведение столкновений. Узел :ref:`class_GPUParticlesCollisionSDF3D` полезен, когда вы хотите, чтобы частицы сталкивались в закрытых сценах без необходимости вручную создавать все отдельные коллайдеры для коробок и сфер. Если вы хотите, чтобы частицы сталкивались с большими открытыми сценами, используйте ноду :ref:`class_GPUParticlesCollisionHeightField3D`. Он создает карту высот вашего мира и объектов в нем и использует ее для масштабных коллизий частиц.
ta: பல துகள் மோதல் முனைகள் உள்ளன. . பெட்டிகள், ஒரு தளம் அல்லது துகள்கள் மோதும் சுவர் போன்ற அடிப்படை வடிவங்களை உருவாக்க நீங்கள் அவற்றைப் பயன்படுத்தலாம். மற்ற இரண்டு முனைகளும் மிகவும் சிக்கலான மோதல் நடத்தையை வழங்குகின்றன. தி: ரெஃப்: `class_gpuparticlescollissdf3d` உட்புற காட்சிகள் துகள்களுடன் மோதிக் கொள்ள விரும்பும்போது பயனுள்ளதாக இருக்கும். பெரிய வெளிப்புற காட்சிகளுடன் துகள்கள் மோதிக் கொள்ள விரும்பினால், நீங்கள்: ref: `class_gpuparticlescollisionheightfield3d` முனை பயன்படுத்துவீர்கள். இது உங்கள் உலகத்தின் உயரத்தையும் அதில் உள்ள பொருட்களையும் உருவாக்குகிறது மற்றும் பெரிய அளவிலான துகள் மோதல்களைப் பயன்படுத்துகிறது.
uk: Є кілька вузлів зіткнення частинок. :ref:`class_GPUParticlesCollisionBox3D` і :ref:`class_GPUParticlesCollisionSphere3D` є простими. Ви можете використовувати їх для створення базових форм, як-от ящиків, підлоги чи стіни, з якими стикаються частинки. Інші два вузли забезпечують більш складну поведінку при зіткненні. :ref:`class_GPUParticlesCollisionSDF3D` корисний, коли ви хочете, щоб сцени в приміщенні зіткнулися з частинками без необхідності створювати всі окремі коробчасті та сферічні колайдери вручну. Якщо ви хочете, щоб частинки стикалися з великими сценами на відкритому повітрі, ви повинні використовувати вузол :ref:`class_GPUParticlesCollisionHeightField3D`. Він створює карту висот вашого світу та об’єктів у ньому та використовує її для великомасштабних зіткнень частинок.
zh_hant: 粒子碰撞節點有多種。:ref:`class_GPUParticlesCollisionBox3D` 和 :ref:`class_GPUParticlesCollisionSphere3D` 屬於基礎型，可用於建立方塊、地板或牆壁等簡單形狀的碰撞。另有兩種較進階的節點：:ref:`class_GPUParticlesCollisionSDF3D` 適合室內場景要與粒子碰撞時使用，無需手動建立多個方塊或球體碰撞器。若要讓粒子與大型戶外場景碰撞，可用 :ref:`class_GPUParticlesCollisionHeightField3D` 節點，這會產生場景與物件的高度圖，以實現大範圍碰撞。

source: Basic usage
ga: Úsáid bunúsach
it: Utilizzo di base
pt_br: Uso básico
ta: அடிப்படை பயன்பாடு
uk: Базове використання
zh_hant: 基本用法

source: Advanced topics
ga: Ard-ábhair
it: Argomenti avanzati
ta: மேம்பட்ட தலைப்புகள்
uk: Розширені теми
zh_hant: 進階匯出

source: Translation status
ru: Статус перевода
