Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/particles/properties.po
Languages: de, ga, pt_br, ru, ta, uk, zh_cn, zh_tw

source: The ``Transform Align`` property controls the particle's default rotation. ``Disabled`` means they don't align in any particular way. Instead, their rotation is determined by the values set in the process material. ``Z-Billboard`` means that the particles will always face the camera. This is similar to the ``Billboard`` property in the :ref:`Standard Material <doc_standard_material_3d>`. ``Y to Velocity`` means that each particle's Y-axis aligns with its movement direction. This can be useful for things like bullets or arrows, where you want particles to always point "forward". ``Z-Billboard + Y to Velocity`` combines the previous two modes. Each particle's Z-axis will point towards the camera while its Y-axis will align with their velocity.
de: Die Property ``Transformationsausrichtung`` kontrolliert die Standardrotation des Partikels. ``Deaktiviert`` bedeutet, dass sie sich nicht auf eine bestimmte Weise ausrichten. Stattdessen wird ihre Drehung durch die im Prozessmaterial eingestellten Werte bestimmt. ``Z-Billboard`` bedeutet, dass die Partikel immer in Richtung der Kamera ausgerichtet sind. Dies ist ähnlich der Property ``Billboard`` im :ref:`Standard-Material <doc_standard_material_3d>`. ``Y nach Bewegungsrichtung`` bedeutet, dass die Y-Achse eines jeden Partikels mit seiner Bewegungsrichtung übereinstimmt. Dies kann für Dinge wie Geschosse oder Pfeile nützlich sein, bei denen man möchte, dass die Partikel immer "nach vorne" zeigen. ``Z-Billboard + Y nach Bewegungsrichtung`` kombiniert die beiden vorherigen Modi. Die Z-Achse eines jeden Partikels zeigt in Richtung der Kamera, während die Y-Achse mit dem Geschwindigkeitsvektor übereinstimmt.
ga: Rialaíonn an t-airí ``Transform Align`` rothlú réamhshocraithe an cháithnín. Ciallaíonn ``Díchumasaithe`` nach bhfuil siad ailínithe ar bhealach ar leith. Ina áit sin, déantar a n-uainíocht a chinneadh ag na luachanna atá leagtha síos san ábhar próiseas. Ciallaíonn ``Z-Billboard`` go mbeidh na cáithníní os comhair an cheamara i gcónaí. Tá sé seo cosúil leis an airí ``Billboard`` sa :ref:`Ábhar Caighdeánach <doc_standard_material_3d>`. Ciallaíonn ``Y go Treoluas`` go ailíníonn Y-ais gach cáithnín lena threo gluaiseachta. Is féidir é seo a bheith úsáideach le haghaidh rudaí cosúil le urchair nó saigheada, áit ar mhaith leat cáithníní a chur in iúl i gcónaí "ar aghaidh". Comhcheanglaíonn ``Z-Billboard + Y go Treoluas`` an dá mhodh roimhe seo. Díreoidh ais Z gach cáithnín i dtreo an cheamara agus beidh a Y-ais ag ailíniú lena threoluas.
pt_br: A propriedade ``Transform Align`` controla a rotação padrão das partículas. ``Disabled`` significa que elas não se alinham de nenhuma forma particular. Em vez disso, sua rotação é determinada pelos valores definidos no material de processo. ``Z-Billboard`` significa que as partículas sempre ficarão de frente para a câmera. Isso é semelhante à propriedade ``Billboard`` no :ref:`Standard Material <doc_standard_material_3d>`. ``Y to Velocity`` significa que o eixo Y de cada partícula se alinha com sua direção de movimento. Isso pode ser útil para coisas como balas ou flechas, onde você quer que as partículas sempre apontem "para frente". ``Z-Billboard + Y to Velocity`` combina os dois modos anteriores. O eixo Z de cada partícula apontará para a câmera enquanto seu eixo Y se alinhará com sua velocidade.
ru: Свойство ``Transform Align`` управляет вращением частицы по умолчанию. ``Disabled`` означает, что они не выравниваются каким-либо определенным образом. Вместо этого их вращение определяется значениями, установленными в материале процесса. ``Z-Billboard`` означает, что частицы всегда будут направлены к камере. Это похоже на свойство ``Billboard`` в :ref:`Standard Material <doc_standard_material_3d>`. ``Y to Velocity`` означает, что ось Y каждой частицы совпадает с направлением ее движения. Это может быть полезно для таких вещей, как пули или стрелы, где вы хотите, чтобы частицы всегда указывали «вперед». ``Z-Billboard + Y to Velocity`` объединяет два предыдущих режима. Ось Z каждой частицы будет указывать на камеру, а ось Y будет совпадать с ее скоростью.
ta: `` உருமாற்றம் சீரமை`` சொத்து துகள் இயல்புநிலை சுழற்சியைக் கட்டுப்படுத்துகிறது. `` முடக்கப்பட்டது`` என்றால் அவை எந்த குறிப்பிட்ட வழியிலும் சீரமைக்காது. அதற்கு பதிலாக, அவற்றின் சுழற்சி செயல்முறை பொருளில் அமைக்கப்பட்ட மதிப்புகளால் தீர்மானிக்கப்படுகிறது. `` இசட்-பில்ல்போர்டு`` என்றால் துகள்கள் எப்போதும் கேமராவை எதிர்கொள்ளும். இது `` பில்போர்டு`` சொத்துக்கு ஒத்ததாகும்: ref: `நிலையான பொருள் <doc_standard_material_3d>`. `` ஒய் வேகத்திற்கு `` என்றால் ஒவ்வொரு துகள் y- அச்சு அதன் இயக்க திசையுடன் ஒத்துப்போகிறது. தோட்டாக்கள் அல்லது அம்புகள் போன்ற விசயங்களுக்கு இது பயனுள்ளதாக இருக்கும், அங்கு துகள்கள் எப்போதும் "முன்னோக்கி" சுட்டிக்காட்ட வேண்டும். `` Z- பில் போர்டு + ஒய் முதல் வேகம்` `முந்தைய இரண்டு முறைகளை ஒருங்கிணைக்கிறது. ஒவ்வொரு துகள் இசட்-அச்சு கேமராவை நோக்கி சுட்டிக்காட்டும், அதே நேரத்தில் அதன் ஒய்-அச்சு அவற்றின் வேகத்துடன் சீரமைக்கப்படும்.
uk: Властивість ``Transform Align`` керує поворотом частинки за умовчанням. ``Disabled`` означає, що вони не вирівнюються жодним чином. Натомість їх обертання визначається величинами, заданими в технологічному матеріалі. ``Z-Billboard`` означає, що частинки завжди дивляться в камеру. Це схоже на власність ``Billboard`` у :ref:`Standard Material <doc_standard_material_3d>`. ``Y to Velocity`` означає, що вісь Y кожної частинки збігається з напрямком її руху. Це може бути корисно для таких речей, як кулі чи стріли, на які потрібно, щоб частинки завжди вказували "вперед". ``Z-Billboard + Y to Velocity`` поєднує попередні два режими. Кожна вісь Z частинки вказуватиме на камеру, а її вісь Y вирівнюватиметься з їхньою швидкістю.
zh_cn: ``Transform Align`` 属性控制粒子的默认旋转。\ ``Disabled`` 意味着它们不以任何特定的方式对齐，相反，它们的旋转由处理材质设置的值决定。\ ``Z-Billboard`` 表示粒子将始终面向相机，类似于 :ref:`Standard Material <doc_standard_material_3d>` 的 ``Billboard`` 属性。\ ``Y to Velocity`` 表示每个粒子的 Y 轴与其移动方向对齐，这对于子弹或箭矢之类的物体很有帮助，因为你希望粒子一直指向“前方”。\ ``Z-Billboard + Y to Velocity`` 结合了前两种模式。每个粒子的 Z 轴将指向相机，而Y 轴与速度对齐。
zh_tw: 「Transform Align」屬性決定粒子的預設旋轉。「Disabled」表示不強制對齊，旋轉取決於處理材質設定。「Z-Billboard」會讓粒子永遠面向攝影機，類似 :ref:`Standard Material <doc_standard_material_3d>` 的「Billboard」屬性。「Y to Velocity」則將每個粒子的 Y 軸對齊其移動方向，適合像子彈、箭矢這類必須朝前的效果。「Z-Billboard + Y to Velocity」則會讓 Z 軸朝向攝影機，Y 軸同時對齊速度方向。

source: Trail properties
de: Trail-Propertys
ga: Airíonna na conaire
ru: Свойства трейлов
ta: பாதை பண்புகள்
uk: Властивості стежки
zh_cn: 尾迹属性
zh_tw: 軌跡屬性

source: Particle trails
de: Partikel-Trails
ga: Cosáin cháithnín
ru: Трейлы частиц
ta: துகள் தடங்கள்
uk: Сліди частинок
zh_cn: 粒子尾迹
zh_tw: 粒子軌跡

source: Particle trail properties
de: Partikel-Trail-Propertys
ga: Airíonna rian na gcáithníní
ru: Свойства трейлов частиц
ta: துகள் பாதை பண்புகள்
uk: Властивості слідів частинок
zh_cn: 粒子尾迹属性
zh_tw: 粒子軌跡屬性

source: The ``Enabled`` property controls whether particles are rendered as trails. The box needs to be checked if you want to make use of particle trails.
de: Die Property ``Aktiviert`` steuert, ob Partikel als Trails gerendert werden. Das Kästchen muss markiert sein, wenn Sie Partikel-Trails verwenden wollen.
ga: Rialaíonn an mhaoin ''Cumasaithe'' cibé an ndéantar cáithníní mar chosáin. Ní mór an bosca a sheiceáil más mian leat úsáid a bhaint as cosáin cáithníní.
pt_br: A propriedade ``Enabled`` controla se as partículas são renderizadas como trilhas. A caixa precisa ser marcada se você quiser usar trilhas de partículas.
ru: Свойство ``Enabled`` управляет тем, отображаются ли частицы как следы. Этот флажок должен быть установлен, если вы хотите использовать следы частиц.
ta: `` இயக்கப்பட்ட`` சொத்து துகள்கள் பாதைகளாக வழங்கப்படுகிறதா என்பதைக் கட்டுப்படுத்துகிறது. நீங்கள் துகள் தடங்களைப் பயன்படுத்த விரும்பினால் பெட்டியை சரிபார்க்க வேண்டும்.
uk: Властивість ``Enabled`` контролює, чи відображаються частинки як сліди. Поставте прапорець, якщо ви хочете використовувати сліди частинок.
zh_cn: ``Enabled`` 属性控制粒子是否渲染为尾迹。如果想使用粒子尾迹，就需要勾选该框。
zh_tw: 「Enabled」屬性決定是否啟用粒子軌跡。若要顯示軌跡，請務必勾選此選項。

source: The ``Length Secs`` property controls for how long a trail should be emitted. The longer this duration is, the longer the trail will be.
de: Das Property ``Länge in Sek`` bestimmt, wie lange ein Trail emittiert werden soll. Je länger diese Dauer ist, desto länger wird der Trail sein.
ga: Rialaíonn an mhaoin ''Fad Secs'' cé chomh fada agus ba chóir rian a astú. Dá fhad an ré seo, is ea is faide a bheidh an rian.
pt_br: A propriedade ``Length Secs`` controla por quanto tempo uma trilha deve ser emitida. Quanto maior essa duração, mais longa será a trilha.
ru: Свойство ``Length Secs`` контролирует, как долго должен быть испущен шлейф. Чем больше эта длительность, тем длиннее будет шлейф.
ta: ஒரு பாதை எவ்வளவு காலம் வெளியேற்றப்பட வேண்டும் என்பதற்கான `` நீள நொடி` சொத்து கட்டுப்பாடுகள். இந்த காலம் நீண்ட காலம், நீண்ட பாதை இருக்கும்.
uk: Властивість ``Length Secs`` контролює тривалість випромінювання сліду. Чим довша ця тривалість, тим довшим буде слід.
zh_cn: ``Length Secs`` 属性控制尾迹应该被发射多长。该持续时间越长，尾迹就会越长。
zh_tw: 「Length Secs」屬性設定軌跡的持續時間，數值越高，顯示的軌跡越長。

source: See the :ref:`Particle trails <doc_3d_particles_trails>` section in this manual for a detailed explanation of how particle trails work and how to set them up.
de: Siehe den Abschnitt :ref:`Partikel-Trails <doc_3d_particles_trails>` in diesem Handbuch für eine detaillierte Erklärung, wie Partikel-Trails funktionieren und wie man sie einrichtet.
ga: Féach an rannán :ref:`Cosáin na gcáithníní <doc_3d_particles_trails>` sa lámhleabhar seo le haghaidh míniú mionsonraithe ar conas a oibríonn rianta cáithníní agus conas iad a shocrú.
pt_br: Consulte a seção :ref:`Particle trails <doc_3d_particles_trails>` neste manual para uma explicação detalhada de como as trilhas de partículas funcionam e como configurá-las.
ru: Подробное объяснение того, как работают следы частиц и как их настроить, см. в разделе :ref:`Следы частиц <doc_3d_particles_trails>` этого руководства.
ta: : Ref: `துகள் தடங்கள் எவ்வாறு செயல்படுகின்றன, அவற்றை எவ்வாறு அமைப்பது என்பதற்கான விரிவான விளக்கத்திற்கு இந்த கையேட்டில்` துகள் தடங்கள் <doc_3d_particles_trails> `பிரிவு.
uk: Перегляньте розділ :ref:`Particle trails <doc_3d_particles_trails>` в цьому посібнику, щоб отримати детальне пояснення того, як працюють сліди частинок і як їх налаштувати.
zh_cn: 有关粒子尾迹工作原理及其设置方法的详细说明，请参阅本手册中的\ :ref:`粒子尾迹 <doc_3d_particles_trails>`\ 部分。
zh_tw: 詳細說明請參考本手冊的 :ref:`粒子軌跡 <doc_3d_particles_trails>` 章節，瞭解粒子軌跡的運作原理與設定方式。
