Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/particles/properties.po
Languages: de, ga, pt_br, ru, ta, uk, zh_cn, zh_tw

source: 3D Particle system properties
de: Propertys des 3D-Partikelsystems
ga: Airíonna córais cáithníní 3D
ru: Свойства системы 3D-частиц
ta: 3D துகள் அமைப்பு பண்புகள்
uk: Властивості системи 3D частинок
zh_cn: 3D 粒子系统属性
zh_tw: 3D 粒子系統屬性

source: Emitter properties
de: Emitter-Propertys
ga: Airíonna astaithe
ru: Свойства эмиттера
ta: உமிழ்ப்பான் பண்புகள்
uk: Властивості емітера
zh_cn: 发射器属性
zh_tw: 發射器屬性

source: The checkbox next to the ``Emitting`` property activates and deactivates the particle system. Particles will only be processed and rendered if the box is checked. You can set this property at runtime if you want to activate or deactivate particle systems dynamically.
de: Die Checkbox neben der Property ``Emittierend`` aktiviert und deaktiviert das Partikelsystem. Partikel werden nur verarbeitet und gerendert, wenn die Box aktiviert ist. Sie können diese Property zur Laufzeit setzen, wenn Sie Partikelsysteme dynamisch aktivieren oder deaktivieren wollen.
ga: Gníomhaíonn agus díghníomhachtaíonn an ticbhosca in aice leis an maoin ''Astú'' córas na gcáithníní. Ní dhéanfar cáithníní a phróiseáil agus a dhéanamh ach amháin má chuireann tú tic sa bhosca. Is féidir leat an mhaoin seo a shocrú ag am rite más mian leat córais cháithníní a ghníomhachtú nó a dhíghníomhachtú go dinimiciúil.
pt_br: A caixa de seleção ao lado da propriedade ``Emitting`` ativa e desativa o sistema de partículas. As partículas só serão processadas e renderizadas se a caixa estiver marcada. Você pode definir esta propriedade em tempo de execução se quiser ativar ou desativar sistemas de partículas dinamicamente.
ru: Флажок рядом со свойством ``Emitting (Излучение)`` активирует и деактивирует систему частиц. Частицы будут обрабатываться и визуализироваться только если флажок установлен. Вы можете задать это свойство во время выполнения, если хотите активировать или деактивировать системы частиц динамически.
ta: `` உமிழும்` சொத்துக்கு அடுத்துள்ள தேர்வுப்பெட்டி துகள் அமைப்பை செயல்படுத்துகிறது மற்றும் செயலிழக்கச் செய்கிறது. பெட்டி சரிபார்க்கப்பட்டால் மட்டுமே துகள்கள் செயலாக்கப்பட்டு வழங்கப்படும். துகள் அமைப்புகளை மாறும் வகையில் செயல்படுத்த அல்லது செயலிழக்க விரும்பினால் இந்த சொத்தை இயக்க நேரத்தில் அமைக்கலாம்.
uk: Прапорець поруч із властивістю ``Emitting`` активує та вимикає систему частинок. Частинки оброблятимуться та візуалізуватимуться, лише якщо позначено прапорець. Ви можете встановити цю властивість під час виконання, якщо ви хочете динамічно активувати або деактивувати системи частинок.
zh_cn: ``Emitting`` 属性旁边的复选框用于激活和停用粒子系统。只有选中该复选框被时，才会处理和渲染粒子。如果需要动态激活或停用粒子系统，可以在运行时设置此属性。
zh_tw: 「Emitting」屬性旁的核取方塊可用來啟用或停用粒子系統。只有在勾選時，粒子系統才會被處理與顯示。你也可以在執行時動態切換這個屬性，以便動態啟動或關閉粒子系統。

source: The ``Amount`` property controls the maximum number of particles visible at any given time. Increase the value to spawn more particles at the cost of performance.
de: Das Property ``Menge`` steuert die maximale Anzahl von Partikeln, die zu einem bestimmten Zeitpunkt sichtbar sind. Erhöhen Sie den Wert, um mehr Partikel zu erzeugen, allerdings auf Kosten der Performance.
ga: Rialaíonn an mhaoin ''Méid'' an líon uasta cáithníní atá infheicthe ag aon am ar leith. Méadaigh an luach chun níos mó cáithníní a sceitheadh ar chostas feidhmíochta.
pt_br: A propriedade ``Amount`` controla o número máximo de partículas visíveis a qualquer momento. Aumente o valor para gerar mais partículas, ao custo de desempenho.
ru: Свойство ``Amount (Количество)`` контролирует максимальное количество частиц, видимых в любой момент времени. Увеличьте значение, чтобы создать больше частиц за счет производительности.
ta: `` தொகை` சொத்து எந்த நேரத்திலும் காணக்கூடிய அதிகபட்ச துகள்களைக் கட்டுப்படுத்துகிறது. செயல்திறன் செலவில் அதிக துகள்களை உருவாக்க மதிப்பை அதிகரிக்கவும்.
uk: Властивість ``Amount`` контролює максимальну кількість частинок, видимих у будь-який момент часу. Збільште значення, щоб створити більше частинок за рахунок продуктивності.
zh_cn: ``Amount`` 属性控制着在任何时间下可见粒子的最大数量。增加这个值将会在消耗性能的同时生成更多的粒子。
zh_tw: 「Amount」屬性用來設定同時可見的最大粒子數。提高這個數值能產生更多粒子，但會犧牲效能。

source: The ``Amount Ratio`` property is the ratio of particles compared to the amount that will be emitted. If it's less than ``1.0``, the amount of particles emitted through the lifetime will be the ``Amount`` * ``Amount Ratio``. Changing this value while emitted doesn't affect already created particles and doesn't cause the particle system to restart. It's useful for making effects where the number of emitted particles varies over time.
de: Das Property ``Mengenverhältnis`` ist die Anzahl der Partikel im Vergleich zu der Menge, die emittiert wird. Wenn der Wert kleiner als ``1.0`` ist, wird die Menge der Partikel, die während der Lebensdauer emittiert werden, dem Wert ``Menge`` * ``Mengenverhältnis`` entsprechen. Das Ändern dieses Wertes während des Emittierens wirkt sich nicht auf bereits erzeugte Partikel aus und führt nicht zu einem Neustart des Partikelsystems. Dies ist nützlich, um Effekte zu erzeugen, bei denen die Anzahl der emittierten Partikel über die Zeit variiert.
ga: Is ionann an mhaoin ''Cóimheas Méide'' agus cóimheas na gcáithníní i gcomparáid leis an méid a astófar. Má tá sé níos lú ná ''1.0'', is é an méid cáithníní a astaítear tríd an saolré ná an ''Méid'' * ''Cóimheas Méid''. Ní dhéanann athrú ar an luach seo agus astaítear difear do cháithníní atá cruthaithe cheana féin agus ní chuireann sé faoi deara córas na gcáithníní a atosú. Tá sé úsáideach chun éifeachtaí a dhéanamh nuair a athraíonn líon na gcáithníní astaithe le himeacht ama.
pt_br: A propriedade ``Amount Ratio`` é a proporção de partículas em comparação com a quantidade que será emitida. Se for menor que ``1.0``, a quantidade de partículas emitidas durante a vida útil será a ``Amount`` * ``Amount Ratio``. Alterar este valor durante a emissão não afeta as partículas já criadas e não faz com que o sistema de partículas reinicie. É útil para criar efeitos onde o número de partículas emitidas varia ao longo do tempo.
ru: Свойство ``Amount Ratio (Сумма Соотношения)`` - это соотношение частиц по сравнению с количеством, которое будет испущено. Если оно меньше ``1.0``, количество частиц, испущенных за время жизни, будет равно ``Amount (Количество)`` * ``Amount Ratio (Сумма Соотношения)``. Изменение этого значения во время испускания не влияет на уже созданные частицы и не приводит к перезапуску системы частиц. Это полезно для создания эффектов, в которых количество испускаемых частиц меняется со временем.
ta: `` தொகை விகிதம்`` சொத்து என்பது வெளிப்படும் அளவோடு ஒப்பிடும்போது துகள்களின் விகிதமாகும். இது `` 1.0`` ஐ விடக் குறைவாக இருந்தால், வாழ்நாளில் வெளிப்படும் துகள்களின் அளவு `` தொகை` * `` தொகை விகிதம்``. உமிழ்க்கும் போது இந்த மதிப்பை மாற்றுவது ஏற்கனவே உருவாக்கப்பட்ட துகள்களை பாதிக்காது, மேலும் துகள் அமைப்பு மறுதொடக்கம் செய்யப்படாது. உமிழப்படும் துகள்களின் எண்ணிக்கை காலப்போக்கில் மாறுபடும் விளைவுகளை ஏற்படுத்த இது பயனுள்ளதாக இருக்கும்.
uk: Властивість ``Співвідношення кількості`` - це співвідношення часток у порівнянні з кількістю, яка буде викинута. Якщо він менший за ``1,0``, кількість частинок, випущених за час існування, буде ``Кількість`` * ``Коефіцієнт кількості``. Зміна цього значення під час випромінювання не впливає на вже створені частинки та не спричиняє перезапуск системи частинок. Це корисно для створення ефектів, коли кількість випромінюваних частинок змінюється з часом.
zh_cn: ``Amount Ratio`` 属性是粒子与要射出的粒子数量的比例。如果它小于 ``1.0``\ ，则生命周期内发射的粒子数量将为 ``Ammount`` * ``Amount Ratio``\ 。发射后更改此数值不会影响已创建的粒子，也不会导致粒子系统重新启动。对于制作发射粒子的数量随时间变化的效果来说这个属性很有用。
zh_tw: 「Amount Ratio」屬性用來設定實際發射粒子的比例。如果小於 1.0，整個生命週期釋放的粒子數會等於「Amount」乘以「Amount Ratio」。在粒子系統運作中修改這個值，不會影響已經存在的粒子，也不會重啟粒子系統。這非常適合做粒子數量隨時間變化的特效。

source: You can set another particle node as a ``Sub Emitter``, which will be spawned as a child of each particle. See the :ref:`Sub-emitters <doc_3d_particles_subemitters>` section in this manual for a detailed explanation of how to add a sub-emitter to a particle system.
de: Sie können einen anderen Node als ``Sub-Emitter`` festlegen, der als Child-Node eines jeden Partikels erzeugt wird. Siehe den :ref:`Sub-Emitter <doc_3d_particles_subemitters>`-Abschnitt in diesem Handbuch für eine detaillierte Erklärung, wie man einen Sub-Emitter zu einem Partikelsystem hinzufügt.
ga: Is féidir leat nód cáithníneach eile a shocrú mar ``Fo-Astaitheoir``, a bheidh sceite mar leanbh de gach cáithnín. Féach an rannán :ref:`Fo-astaírí <doc_3d_particles_subemitters>` sa lámhleabhar seo le haghaidh míniú mionsonraithe ar conas fo-astaitheoir a chur le córas cáithníní.
pt_br: Você pode definir outro nó de partícula como um ```Sub Emitter``, que será criado como um filho de cada partícula. Consulte a seção :ref:`Sub-emitters <doc_3d_particles_subemitters>` neste manual para uma explicação detalhada sobre como adicionar um sub-emissor a um sistema de partículas.
ru: Вы можете установить другой узел частиц как ``Sub Emitter``, который будет порождаться как дочерний элемент каждой частицы. Подробное объяснение того, как добавить sub-emitter в систему частиц, см. в разделе :ref:`Sub-emitters <doc_3d_particles_subemitters>` в этом руководстве.
ta: நீங்கள் மற்றொரு துகள் முனையை ஒரு `` துணை உமிழ்ப்பான்` ஆக அமைக்கலாம், இது ஒவ்வொரு துகள்களின் குழந்தையாக உருவாகும். பார்க்க: ref: `சப்-எமிட்டர்ச் <doc_3d_particles_subemitters>` ஒரு துகள் அமைப்பில் ஒரு துணை வெளியீட்டாளரை எவ்வாறு சேர்ப்பது என்பதற்கான விரிவான விளக்கத்திற்கு இந்த கையேட்டில் பிரிவு.
uk: Ви можете встановити інший вузол частинки як ``Sub Emitter``, який буде породжений як дочірній елемент кожної частинки. Дивіться розділ :ref:`Суб-випромінювачі <doc_3d_particles_subemitters>` цього посібника, щоб отримати детальне пояснення того, як додати суб-емітер до системи частинок.
zh_cn: 可以将另一个粒子节点设置为 ``子发射器``\ ，它将作为每个粒子的子节点生成。有关如何将子发射器添加到粒子系统的详细说明，请参阅本手册中的\ :ref:`子发射器 <doc_3d_particles_subemitters>`\ 部分。
zh_tw: 你可以將另一個粒子節點設為「Sub Emitter」，這個子發射器會在每個粒子的生命週期中作為其子物件生成。詳細說明請參考本手冊中的 :ref:`子發射器 <doc_3d_particles_subemitters>` 章節。

source: Time properties
de: Zeit-Propertys
ga: Airíonna ama
ru: Свойства времени
ta: நேர பண்புகள்
uk: Властивості часу
zh_cn: 时间属性
zh_tw: 時間屬性

source: The ``Lifetime`` property controls how long each particle exists before it disappears again. It is measured in seconds. A lot of particle properties can be set to change over the particle's lifetime and blend smoothly from one value to another.
de: Die Property ``Lebensdauer`` bestimmt, wie lange jedes Teilchen existiert, bevor es wieder verschwindet. Sie wird in Sekunden gemessen. Viele Propertys der Partikel können so eingestellt werden, dass sie sich während der Lebensdauer des Partikels ändern und nahtlos von einem Wert zum anderen übergehen.
ga: Rialaíonn an mhaoin ''Saoil'' cé chomh fada is atá gach cáithnín ann sula n-imíonn sé arís. Déantar é a thomhas i soicindí. Is féidir a lán airíonna cáithníní a shocrú chun athrú thar shaolré an cháithnín agus cumasc go réidh ó luach amháin go luach eile.
pt_br: A propriedade ``Lifetime`` controla por quanto tempo cada partícula existe antes de desaparecer novamente. É medida em segundos. Muitas propriedades das partículas podem ser configuradas para mudar ao longo da vida útil da partícula e fazer uma transição suave de um valor para outro.
ru: Свойство ``Lifetime (Продолжительность жизни)`` контролирует, как долго существует каждая частица, прежде чем она снова исчезнет. Измеряется в секундах. Многие свойства частиц могут быть настроены на изменение в течение времени жизни частицы и плавное смешивание от одного значения к другому.
ta: `` வாழ்நாள்`` சொத்து ஒவ்வொரு துகள்களும் மீண்டும் மறைந்துவிடுவதற்கு முன்பு எவ்வளவு காலம் உள்ளன என்பதைக் கட்டுப்படுத்துகிறது. இது நொடிகளில் அளவிடப்படுகிறது. துகள் வாழ்நாளில் மாற்றவும், ஒரு மதிப்பிலிருந்து இன்னொரு மதிப்புக்கு சீராக கலக்கவும் நிறைய துகள் பண்புகள் அமைக்கப்படலாம்.
uk: Властивість ``Lifetime`` контролює, скільки часу існує кожна частинка, перш ніж вона знову зникне. Вимірюється в секундах. Багато властивостей частинок можна налаштувати так, щоб вони змінювалися протягом життя частинки та плавно переходили від одного значення до іншого.
zh_cn: ``Lifetime`` 属性控制每个粒子在消失之前存在的时间长短，以秒为单位。许多粒子属性都可以在粒子生命周期内设置而变化，从一个值平滑过渡到另一个值。
zh_tw: 「Lifetime」屬性設定每個粒子存在多久（以秒為單位），時間到就會消失。許多粒子屬性都可以設定於粒子生命週期內平滑變化。

source: ``Lifetime`` and ``Amount`` are related. They determine the particle system's emission rate. Whenever you want to know how many particles are spawned per second, this is the formula you would use:
de: ``Lebensdauer`` und ``Menge`` sind miteinander verbunden. Sie bestimmen die Emissionsrate des Partikelsystems. Wann immer Sie wissen wollen, wie viele Partikel pro Sekunde erzeugt werden, ist dies die Formel, die Sie verwenden würden:
ga: Tá baint ag ''Saolré'' agus ''Méid''. Cinneann siad ráta astaíochta chóras na gcáithníní. Aon uair is mian leat a fháil amach cé mhéad cáithníní a sceitear in aghaidh an tsoicind, is í seo an fhoirmle a d'úsáidfeá:
pt_br: ``Lifetime`` e ``Amount`` estão relacionados. Eles determinam a taxa de emissão do sistema de partículas. Se você quiser saber quantas partículas são geradas por segundo, esta é a fórmula que você usaria:
ru: ``Lifetime`` и ``Amount`` связаны. Они определяют скорость эмиссии системы частиц. Всякий раз, когда вы хотите узнать, сколько частиц создается в секунду, вот формула, которую вы должны использовать:
ta: `` வாழ்நாள்`` மற்றும் `` தொகை`` தொடர்புடையவை. அவை துகள் அமைப்பின் உமிழ்வு வீதத்தை தீர்மானிக்கின்றன. நொடிக்கு எத்தனை துகள்கள் உருவாகின்றன என்பதை நீங்கள் அறிய விரும்பும் போதெல்லாம், நீங்கள் பயன்படுத்தும் தேற்றம் இதுதான்:
uk: ``Тривалість`` і ``Сума`` пов'язані. Вони визначають швидкість випромінювання системи частинок. Щоразу, коли ви хочете знати, скільки частинок породжується за секунду, ви скористаєтеся цією формулою:
zh_cn: ``Lifetime`` 和 ``Amount`` 是相互关联的，决定了粒子系统的发射速率，要知道每秒产生多少粒子，可以使用以下公式：
zh_tw: 「Lifetime」和「Amount」兩個屬性相關聯，決定了粒子系統的發射速率。若要計算每秒產生的粒子數，可使用以下公式：

source: Particles per second = \frac{Amount}{Lifetime}
de: Partikel pro Sekunde = \frac{Menge}{Lebensdauer}
ga: Cáithníní in aghaidh an tsoicind = \frac{Amount}{Lifetime}
pt_br: Partículas por segundo = \frac{Amount}{Lifetime}
ru: Частиц в секунду = \frac{Amount}{Lifetime}
ta: ஒரு நொடிக்கு துகள்கள் = \ frac {Amount} {Lifetime}
uk: Частинок за секунду = \frac{кількість}{час життя}
zh_cn: 每秒粒子数 = \frac{Amount}{Lifetime}
zh_tw: 每秒粒子數 = \frac{Amount}{Lifetime}

source: Example: Emitting 32 particles with a lifetime of 4 seconds each would mean the system emits 8 particles per second.
de: Beispiel: Beim Emittieren von 32 Partikeln mit einer Lebensdauer von jeweils 4 Sekunden würde das System 8 Partikel pro Sekunde emittieren.
ga: Sampla: Dá n-astófaí 32 cháithnín le saolré 4 shoicind, chiallódh gach ceann acu go n-astaíonn an córas 8 gcáithníní in aghaidh an tsoicind.
pt_br: Exemplo: emitir 32 partículas com vida útil de 4 segundos cada significaría que o sistema emite 8 partículas por segundo.
ru: Пример: испускание 32 частиц со временем жизни каждой 4 секунды будет означать, что система испускает 8 частиц в секунду.
ta: எடுத்துக்காட்டு: 32 துகள்களை வாழ்நாள் முழுவதும் 4 வினாடிகள் வெளியேற்றுவது, கணினி நொடிக்கு 8 துகள்களை வெளியிடுகிறது.
uk: Приклад: випромінювання 32 частинок із часом життя 4 секунди кожна означатиме, що система випромінює 8 частинок на секунду.
zh_cn: 示例：以每个粒子寿命为4秒的速度发射32个粒子，意味着该系统每秒发射8个粒子。
zh_tw: 例如：如果「Amount」為 32，「Lifetime」為 4 秒，代表系統每秒發射 8 個粒子。

source: The ``Interp to End`` property causes all the particles in the node to interpolate towards the end of their lifetime.
de: Das Property ``Interp zum Ende`` bewirkt, dass alle Partikel des Nodes gegen das Ende ihrer Lebensdauer interpolieren.
ga: Fágann an mhaoin ''Interp to End'' go bhfuil na cáithníní go léir sa nód ag idirshuíomh i dtreo dheireadh a saoil.
pt_br: A propriedade ``Interp to End`` faz com que todas as partículas no nó sejam interpoladas em direção ao fim de sua vida útil.
ru: Свойство ``Interp to End`` заставляет все частицы в узле интерполироваться к концу своего жизненного цикла.
ta: `` இன்டர்பி டு எண்ட்`` சொத்து முனையில் உள்ள அனைத்து துகள்களும் அவற்றின் வாழ்நாளின் முடிவில் ஒன்றிணைக்க காரணமாகின்றன.
uk: Властивість ``Interp to End`` змушує всі частинки у вузлі інтерполюватись до кінця свого життя.
zh_cn: ``Interp to End`` 属性会使节点中的所有粒子在其生命周期结束时进行插值。
zh_tw: 「Interp to End」屬性會讓所有粒子在其生命週期結束時平滑插值到最終狀態。

source: If the checkbox next to the ``One Shot`` property is checked, the particle system will emit ``amount`` particles and then disable itself. It "runs" only once. This property is unchecked by default, so the system will keep emitting particles until it is disabled or destroyed manually. One-shot particles are a good fit for effects that react to a single event, like item pickups or splinters that burst away when a bullet hits a wall.
de: Wenn die Checkbox neben dem Property ``Einmalig`` angekreuzt ist, wird das Partikelsystem so viele Partikel aussenden, wie in ``Menge`` angegeben ist und sich dann selbst deaktivieren. Es "läuft" nur einmal. Diese Property ist standardmäßig nicht aktiviert, so dass das System so lange Partikel ausstößt, bis es deaktiviert oder manuell zerstört wird. Einmalige Partikel eignen sich gut für Effekte, die auf ein einzelnes Ereignis reagieren, wie z.B. das Aufnehmen von Gegenständen oder Splitter, die abplatzen, wenn ein Geschoss auf eine Wand trifft.
ga: Má sheiceáiltear an ticbhosca in aice leis an maoin ''One Shot'', scaoilfidh córas na gcáithníní cáithníní ''méid'' agus ansin díchumasóidh sé é féin. Ní "ritheann" sé ach aon uair amháin. Ní dhéantar an mhaoin seo a sheiceáil de réir réamhshocraithe, mar sin coinneoidh an córas cáithníní astaithe go dtí go mbeidh sí díchumasaithe nó scriosta de láimh. Tá cáithníní aon-lámhaigh oiriúnach go maith d'éifeachtaí a imoibríonn le teagmhas amháin, cosúil le pickups mír nó splinters a phléascann ar shiúl nuair a bhuaileann piléar balla.
pt_br: Se a caixa de seleção ao lado da propriedade ``One Shot`` estiver marcada, o sistema de partículas irá emitir a quantidade (``amount``) de partículas e depois se desativar. Ele "roda" apenas uma vez. Esta propriedade fica desmarcada por padrão, então o sistema continuará emitindo partículas até ser desativado ou destruído manualmente. Partículas de "one-shot" são uma boa opção para efeitos que reagem a um único evento, como a coleta de itens ou estilhaços que explodem quando uma bala atinge uma parede.
ru: Если флажок рядом со свойством ``One Shot`` отмечен, система частиц будет испускать частицы ``amount``, а затем отключится. Она «запускается» только один раз. Это свойство не отмечено по умолчанию, поэтому система будет продолжать испускать частицы, пока не будет отключена или уничтожена вручную. Частицы One Shot хорошо подходят для эффектов, которые реагируют на единичное событие, например, на подбор предметов или осколки, которые разлетаются при попадании пули в стену.
ta: `` ஒரு சாட்` சொத்துக்கு அடுத்துள்ள தேர்வுப்பெட்டி சரிபார்க்கப்பட்டால், துகள் அமைப்பு `` அளவு` துகள்களை வெளியிட்டு பின்னர் தன்னை முடக்கும். இது ஒரு முறை மட்டுமே "இயங்குகிறது". இந்த சொத்து இயல்புநிலையாக தேர்வு செய்யப்படாது, எனவே கணினி முடக்கப்படும் வரை அல்லது கைமுறையாக அழிக்கப்படும் வரை துகள்களை உமிழும். ஒரு-சாட் துகள்கள் ஒரு நிகழ்வுக்கு வினைபுரியும் விளைவுகளுக்கு ஒரு நல்ல பொருத்தம், ஒரு புல்லட் ஒரு சுவரைத் தாக்கும் போது வெடிக்கும் உருப்படி இடும் அல்லது பிளவுகள் போன்றவை.
uk: Якщо встановлено прапорець поруч із властивістю ``One Shot``, система частинок буде випромінювати ``кількість`` частинок, а потім вимкнеться. Він «запускається» лише один раз. Ця властивість не позначена за замовчуванням, тому система продовжуватиме випромінювати частки, доки її не буде вимкнено або знищено вручну. Одноразові частинки добре підходять для ефектів, які реагують на одну подію, як-от підхоплення предметів або осколки, які розриваються, коли куля влучає в стіну.
zh_cn: 如果选中 ``One Shot`` 属性旁边的复选框，则粒子系统将会发射 ``amount`` 数量的粒子，然后自行禁用，会仅运行一次。默认未选中此属性，系统将持续发射粒子，直到手动禁用或销毁。一次性粒子非常适合用于单个事件做出反应的特效，例如，物品拾取或子弹击中墙壁时迸发出的碎片。
zh_tw: 如果勾選「One Shot」屬性，粒子系統將只發射一次（共「Amount」個粒子）後自動停用。預設未勾選時，粒子系統會持續發射直到被手動停用或移除。「One Shot」很適合用在單一事件觸發的特效，例如道具取得或子彈撞牆時飛散的碎片。

source: The ``Preprocess`` property is a way to fast-forward to a point in the middle of the particle system's lifetime and start rendering from there. It is measured in seconds. A value of ``1`` means that when the particle system starts, it will look as if it has been running for one second already.
de: Das Property ``Vorverarbeitung`` ist eine Möglichkeit, zu einem Punkt in der Mitte der Lebensdauer des Partikelsystems vorzuspulen und von dort aus mit dem Rendering zu beginnen. Sie wird in Sekunden gemessen. Ein Wert von ``1`` bedeutet, dass wenn das Partikelsystem startet, es so aussieht, als ob es bereits eine Sekunde gelaufen wäre.
ga: Is bealach é an mhaoin ''Réamhphróiseála'' chun dul ar aghaidh go pointe i lár shaolré chóras na gcáithníní agus tús a chur le rindreáil as sin. Déantar é a thomhas i soicindí. Ciallaíonn luach ''1'' nuair a thosaíonn córas na gcáithníní, go bhféachfaidh sé amhail is go bhfuil sé ag rith ar feadh soicind amháin cheana féin.
pt_br: A propriedade ``Preprocess`` é uma forma de avançar rapidamente para um ponto no meio da vida útil do sistema de partículas e começar a renderizar a partir daí. Ela é medida em segundos. Um valor de ``1`` significa que quando o sistema de partículas iniciar, ele parecerá que já esteve rodando por um segundo.
ru: Свойство ``Preprocess (Предварительная обработка)`` — это способ быстро перейти к точке в середине жизненного цикла системы частиц и начать рендеринг оттуда. Измеряется в секундах. Значение ``1`` означает, что при запуске системы частиц она будет выглядеть так, как будто она уже работает одну секунду.
ta: `` முன் செயலாக்கம்`` சொத்து என்பது துகள் அமைப்பின் வாழ்நாளின் நடுவில் ஒரு புள்ளியை வேகமாக முன்னேற்றுவதற்கான ஒரு வழியாகும், மேலும் அங்கிருந்து வழங்குதல் செய்யத் தொடங்குகிறது. இது நொடிகளில் அளவிடப்படுகிறது. `` 1`` இன் மதிப்பு, துகள் அமைப்பு தொடங்கும் போது, அது ஏற்கனவே ஒரு நொடி இயங்குவதைப் போல இருக்கும்.
uk: Властивість ``Preprocess`` — це спосіб перемотати вперед до точки в середині життя системи частинок і почати рендеринг звідти. Вимірюється в секундах. Значення «1» означає, що коли система частинок запускається, вона виглядатиме так, ніби вона працює вже одну секунду.
zh_cn: ``Preprocess`` 属性用于将时间快速推进到粒子系统生命周期的中间某个点，从那里开始渲染，以秒为单位进行测量。如果值为 ``1`` ，则粒子系统开始运行时，将看起来已经运行了一秒钟。
zh_tw: 「Preprocess」屬性可以讓粒子系統在啟動時模擬已經運行了一段時間（以秒為單位），直接渲染那個狀態。設為 1 代表系統啟動時，就像已經運作了一秒一樣。
