Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/particles/properties.po
Languages: de, ga, pt_br, ru, ta, uk, zh_cn, zh_tw

source: This can be useful if you want the particle system to look like it has been active for a while even though it was just loaded into the scene. Consider the example below. Both particle systems simulate dust flying around in the area. With a preprocess value of ``0``, there wouldn't be any dust for the first couple of seconds because the system has not yet emitted enough particles for the effect to become noticeable. This can be seen in the video on the left. Compare that to the video on the right where the particle system is preprocessed for ``4`` seconds. The dust is fully visible from the very beginning because we skipped the first four seconds of "setup" time.
de: Dies kann nützlich sein, wenn Sie möchten, dass das Partikelsystem so aussieht, als sei es schon eine Weile aktiv, obwohl es gerade erst in die Szene geladen wurde. Betrachten Sie das folgende Beispiel. Beide Partikelsysteme simulieren Staub, der in der Gegend herumfliegt. Mit einem Preprocess-Wert von ``0`` würde es in den ersten paar Sekunden keinen Staub geben, da das System noch nicht genug Partikel emittiert hat, um den Effekt wahrnehmbar zu machen. Dies ist im Video auf der linken Seite zu sehen. Vergleichen Sie das mit dem Video auf der rechten Seite, in dem das Partikelsystem für ``4`` Sekunden vorverarbeitet wird. Der Staub ist von Anfang an voll sichtbar, weil wir die ersten vier Sekunden der "Einrichtungszeit" übersprungen haben.
ga: D'fhéadfadh sé seo a bheith úsáideach más mian leat go bhféachfadh córas na gcáithníní mar a bhí sé gníomhach ar feadh tamaill cé go raibh sé luchtaithe díreach isteach sa radharc. Smaoinigh ar an sampla thíos. Déanann an dá chóras cáithníní insamhladh ar dheannach ag eitilt timpeall sa cheantar. Le luach réamhphróiseála ''0'', ní bheadh aon deannach ann don chéad chúpla soicind toisc nach bhfuil dóthain cáithníní astaithe ag an gcóras go fóill le go mbeadh an éifeacht le tabhairt faoi deara. Is féidir é seo a fheiceáil san fhíseán ar chlé. Cuir é sin i gcomparáid leis an bhfíseán ar dheis ina bhfuil córas na gcáithníní réamhphróiseáilte le haghaidh soicind ''4''. Tá an deannach le feiceáil go hiomlán ón tús toisc go ndearna muid an chéad cheithre shoicind d'am "thus".
pt_br: Isso pode ser útil se você quiser que o sistema de partículas pareça que está ativo há algum tempo, mesmo que tenha acabado de ser carregado na cena. Considere o exemplo abaixo. Ambos os sistemas de partículas simulam poeira voando na área. Com um valor de preprocess de ``0``, não haveria poeira nos primeiros segundos porque o sistema ainda não emitiu partículas suficientes para que o efeito se tornasse perceptível. Isso pode ser visto no vídeo à esquerda. Compare isso com o vídeo à direita, onde o sistema de partículas é pré-processado por ``4`` segundos. A poeira fica totalmente visível desde o início porque pulamos os primeiros quatro segundos de tempo de "configuração".
ru: Это может быть полезно, если вы хотите, чтобы система частиц выглядела так, будто она была активна некоторое время, даже если она только что загружена в сцену. Рассмотрим пример ниже. Обе системы частиц имитируют пыль, летающую в области. При значении предварительной обработки ``0`` в течение первых нескольких секунд пыли не будет, потому что система еще не испустила достаточно частиц, чтобы эффект стал заметным. Это можно увидеть на видео слева. Сравните это с видео справа, где система частиц предварительно обрабатывается в течение ``4`` секунд. Пыль полностью видна с самого начала, потому что мы пропустили первые четыре секунды времени «setup (настройки)».
ta: துகள் அமைப்பு காட்சிக்குள் ஏற்றப்பட்டிருந்தாலும் சிறிது நேரம் செயலில் இருப்பது போல் இருக்க வேண்டும் என்று நீங்கள் விரும்பினால் இது பயனுள்ளதாக இருக்கும். கீழே உள்ள உதாரணத்தைக் கவனியுங்கள். இரண்டு துகள் அமைப்புகளும் இப்பகுதியில் சுற்றி வரும் தூசி உருவாகின்றன. `` 0`` ஒரு முன் செயலாக்க மதிப்புடன், முதல் இரண்டு விநாடிகளுக்கு எந்த தூசும் இருக்காது, ஏனெனில் கணினி இன்னும் குறிப்பிடத்தக்க துகள்களை வெளிப்படுத்தவில்லை. இதை இடதுபுறத்தில் உள்ள வீடியோவில் காணலாம். துகள் அமைப்பு `` 4`` வினாடிகளுக்கு முன் செயலாக்கப்பட்ட வலதுபுறத்தில் உள்ள வீடியோவுடன் ஒப்பிடுங்கள். "அமைவு" நேரத்தின் முதல் நான்கு வினாடிகளை நாங்கள் தவிர்த்ததால் ஆரம்பத்தில் இருந்தே தூசி முழுமையாகத் தெரியும்.
uk: Це може бути корисно, якщо ви хочете, щоб система частинок виглядала так, ніби вона деякий час була активною, навіть якщо її щойно завантажили в сцену. Розглянемо наведений нижче приклад. Обидві системи частинок імітують пил, що летить навколо. Зі значенням попередньої обробки ``0`` пилу не було б протягом перших кількох секунд, оскільки система ще не випустила достатньо частинок, щоб ефект став помітним. Це можна побачити на відео зліва. Порівняйте це з відео праворуч, де система частинок попередньо обробляється протягом ``4`` секунд. Пил повністю видно з самого початку, оскільки ми пропустили перші чотири секунди часу «налаштування».
zh_cn: 尽管刚刚加载到场景中，希望粒子系统看起来已经活跃了一段时间，那么这个功能非常有用。请考虑以下示例。两个粒子系统都模拟了在该区域内飞舞的灰尘。如果预处理值为 ``0`` ，则在前几秒钟内不会有灰尘，因为系统还没有发射足够的粒子以使效果变得明显。这可以在左侧的视频中看到，与其右侧的视频进行比较，其中粒子系统已预处理了 ``4`` 秒。从一开始，灰尘就完全可见了，因为跳过了前四秒的 "装载" 时间。
zh_tw: 這很適合讓剛載入場景的粒子系統，看起來像已經運行了一段時間。比如下方範例，兩個系統都模擬區域內飛舞的灰塵。若「Preprocess」設為 0，系統啟動前幾秒會看不到灰塵，因為粒子還沒累積出效果。若設為 4，畫面一開始就會看到完全效果，因為跳過了前 4 秒的「預備」時間。

source: No preprocess (left) vs. 4 seconds of preprocess (right)
de: Keine Vorverarbeitung (links) vs. 4 Sekunden Vorverarbeitung (rechts)
ga: Gan réamhphróiseáil (ar chlé) vs. 4 soicind de réamhphróiseálaí (ar dheis)
pt_br: Sem pré-processamento (esquerda) vs. 4 segundos de pré-processamento (direita)
ru: Без предварительной обработки (слева) против 4 секунд предварительной обработки (справа)
ta: முன் செயலாக்கம் (இடது) எதிராக 4 வினாடிகள் முன் செயலாக்கங்கள் (வலது)
uk: Без попередньої обробки (ліворуч) проти 4 секунд попередньої обробки (праворуч)
zh_cn: 无预处理（左侧）与 4 秒预处理（右侧）
zh_tw: 無預處理（左）vs. 預處理 4 秒（右）

source: You can slow down or speed up the particle system with the ``Speed Scale`` property. This applies to processing the data as well as rendering the particles. Set it to ``0`` to pause the particle system completely or set it to something like ``2`` to make it move twice as fast.
de: Sie können das Partikelsystem mit der Property ``Geschwindigkeitsskalierung`` verlangsamen oder beschleunigen. Dies gilt sowohl für die Verarbeitung der Daten als auch für das Rendern der Partikel. Setzen Sie sie auf ``0``, um das Partikelsystem komplett anzuhalten oder setzen Sie sie auf etwas wie ``2``, um es doppelt so schnell zu machen.
ga: Is féidir leat córas na gcáithníní a mhoilliú nó a bhrostú leis an maoin ''Scála Luais''. Baineann sé seo le próiseáil na sonraí chomh maith leis na cáithníní a dhéanamh. Socraigh é go ''0'' chun córas na gcáithníní a chur ar sos go hiomlán nó é a shocrú do rud éigin cosúil le ''2'' chun é a bhogadh dhá uair chomh tapa.
pt_br: Você pode desacelerar ou acelerar o sistema de partículas com a propriedade ``Speed Scale``. Isso se aplica tanto ao processamento dos dados quanto à renderização das partículas. Defina-o como ``0`` para pausar o sistema de partículas completamente ou defina-o como algo como ``2`` para fazê-lo se mover duas vezes mais rápido.
ru: Вы можете замедлить или ускорить систему частиц с помощью свойства ``Speed Scale (Шкала скорости)``. Это относится как к обработке данных, так и к рендерингу частиц. Установите его на ``0``, чтобы полностью приостановить систему частиц, или установите его на что-то вроде ``2``, чтобы заставить ее двигаться в два раза быстрее.
ta: `` வேக அளவுகோல்`` சொத்துடன் துகள் அமைப்பை மெதுவாக்கலாம் அல்லது வேகப்படுத்தலாம். தரவை செயலாக்குவதற்கும் துகள்களை வழங்குவதற்கும் இது பொருந்தும். துகள் அமைப்பை முழுவதுமாக இடைநிறுத்த அல்லது `` 2`` போன்ற ஒன்றை அமைக்க `` 0`` என அமைக்கவும்.
uk: Ви можете уповільнити або прискорити систему частинок за допомогою властивості ``Speed Scale``. Це стосується як обробки даних, так і візуалізації частинок. Встановіть значення ``0``, щоб повністю призупинити систему частинок, або встановіть значення ``2``, щоб вона рухалася вдвічі швидше.
zh_cn: 可以设置 ``Speed Scale`` 属性来减慢或加快粒子系统的速度。这既适用于数据处理，也适用于渲染粒子。将其设置为 ``0`` 可以完全暂停粒子系统，或者将其设置为 ``2`` ，使其移动速度加快一倍。
zh_tw: 你可以用「Speed Scale」屬性來調整粒子系統的快慢。這會影響粒子的運算與渲染速度。設為 0 可完全暫停粒子系統，設為 2 則會讓系統加速一倍。

source: Different speed scale values: 0.1 (left), 0.5 (middle), 1.0 (right)
de: Verschiedene Geschwindigkeitsskalierungswerte: 0,1 (links), 0,5 (Mitte), 1,0 (rechts)
ga: Luachanna scála luais éagsúla: 0.1 (ar chlé), 0.5 (lár), 1.0 (ar dheis)
pt_br: Valores diferentes para a escala de velocidade: 0.1 (esquerda), 0.5 (meio), 1.0 (direita)
ru: Различные значения шкалы скорости: 0,1 (слева), 0,5 (посередине), 1,0 (справа)
ta: வெவ்வேறு வேக அளவிலான மதிப்புகள்: 0.1 (இடது), 0.5 (நடுத்தர), 1.0 (வலது)
uk: Різні значення шкали швидкості: 0,1 (ліворуч), 0,5 (посередині), 1,0 (праворуч)
zh_cn: 不同的速度缩放值：0.1（左侧），0.5（中间），1.0（右侧）
zh_tw: 不同的速度倍率：0.1（左）、0.5（中）、1.0（右）

source: The ``Explosiveness`` property controls whether particles are emitted sequentially or simultaneously. A value of ``0`` means that particles emit one after the other. A value of ``1`` means that all ``amount`` particles emit at the same time, giving the effect a more "explosive" appearance.
de: Das Property ``Explosivität`` steuert, ob die Partikel nacheinander oder gleichzeitig emittiert werden. Ein Wert von ``0`` bedeutet, dass die Partikel nacheinander emittiert werden. Ein Wert von ``1`` bedeutet, daß alle in ``Menge`` definierten Partikel gleichzeitig emittiert werden, was dem Effekt ein "explosiveres" Aussehen verleiht.
ga: Rialaíonn an mhaoin ''Pléascán'' cibé an astaítear cáithníní go seicheamhach nó ag an am céanna. Ciallaíonn luach ''0'' go n-astaíonn cáithníní ceann i ndiaidh a chéile. Ciallaíonn luach ''1'' go n-astaíonn gach cáithníní ''méid'' ag an am céanna, rud a thugann cuma níos "pléascach" don éifeacht.
pt_br: A propriedade ``Explosiveness`` controla se as partículas são emitidas sequencialmente ou simultaneamente. Um valor de ``0`` significa que as partículas são emitidas uma após a outra. Um valor de ``1`` significa que todas as partículas de ``amount`` são emitidas ao mesmo tempo, dando ao efeito uma aparência mais "explosiva".
ru: Свойство ``Explosiveness (Взрывоопасность)`` контролирует, испускаются ли частицы последовательно или одновременно. Значение ``0`` означает, что частицы испускаются одна за другой. Значение ``1`` означает, что все частицы ``amount (количество)`` испускаются одновременно, придавая эффекту более «взрывной» вид.
ta: துகள்கள் தொடர்ச்சியாகவோ அல்லது ஒரே நேரத்தில் வெளியேற்றப்படுகிறதா என்பதை `` வெடிக்கும் தன்மை` சொத்து கட்டுப்படுத்துகிறது. `` 0`` இன் மதிப்பு துகள்கள் ஒன்றன் பின் ஒன்றாக வெளியிடுகின்றன. `` 1`` இன் மதிப்பு என்பது அனைத்து `` தொகை`` துகள்களும் ஒரே நேரத்தில் வெளியிடுகின்றன, இதன் விளைவுக்கு மேலும் "வெடிக்கும்" தோற்றத்தை அளிக்கிறது.
uk: Властивість ``Explosiveness`` контролює, чи випромінюються частинки послідовно чи одночасно. Значення «0» означає, що частинки випромінюють одна за одною. Значення ``1`` означає, що всі частинки ``amount`` випромінюють одночасно, надаючи ефекту більш "вибуховий" вигляд.
zh_cn: ``Explosiveness`` 属性控制粒子是顺序发射还是同时发射。值为 ``0`` 表示粒子一个接一个地发射。值为 ``1`` 表示所有 ``amount`` 粒子同时发射，从而使效果看起来更具爆炸性。
zh_tw: 「Explosiveness」屬性決定粒子是依序發射還是同時發射。設為 0 時粒子會一個接一個發射，設為 1 時則會全部同時發射，呈現出更「爆炸」的效果。

source: The ``Randomness`` property adds some randomness to the particle emission timing. When set to ``0``, there is no randomness at all and the interval between the emission of one particle and the next is always the same: the particles are emitted at *regular* intervals. A ``Randomness`` value of ``1`` makes the interval completely random. You can use this property to break up some of the uniformity in your effects. When ``Explosiveness`` is set to ``1``, this property has no effect.
de: Das Property ``Zufälligkeit`` fügt dem Timing der Partikelemission eine gewisse Zufälligkeit hinzu. Wenn sie auf ``0`` gesetzt ist, gibt es überhaupt keine Zufälligkeit und das Intervall zwischen der Emission eines Teilchens und dem nächsten ist immer gleich: die Teilchen werden in *regelmäßigen* Abständen emittiert. Eine ``Zufälligkeit`` von ``1`` macht das Intervall komplett zufällig. Sie können diese Property benutzen, um die Gleichförmigkeit Ihrer Effekte aufzubrechen. Wenn ``Explosivität`` auf ``1`` gesetzt ist, hat diese Property keinen Effekt.
ga: Cuireann an mhaoin ''Randomness'' roinnt randamachta le huainiú astaíochtaí na gcáithníní. Nuair a shocraítear ''0'', níl aon randamacht ann ar chor ar bith agus bíonn an t-eatramh idir astú cáithnín amháin agus an chéad cheann eile mar an gcéanna i gcónaí: astaítear na cáithníní ag eatraimh *rialta *. Déanann luach ''Randomness'' de ''1'' an t-eatramh go hiomlán randamach. Is féidir leat an mhaoin seo a úsáid chun cuid den aonfhoirmeacht i do chuid éifeachtaí a bhriseadh suas. Nuair a leagtar ''Pléascán'' ar ''1'', níl aon éifeacht ag an maoin seo.
pt_br: A propriedade ``Randomness`` adiciona um pouco de aleatoriedade ao tempo de emissão das partículas. Quando definido como ``0``, não há aleatoriedade alguma e o intervalo entre a emissão de uma partícula e a próxima é sempre o mesmo: as partículas são emitidas em intervalos *regulares*. Um valor de ``Randomness`` de ``1`` torna o intervalo completamente aleatório. Você pode usar essa propriedade para quebrar um pouco da uniformidade em seus efeitos. Quando ``Explosiveness`` é definido como ``1``, esta propriedade não tem efeito.
ru: Свойство ``Randomness`` добавляет некоторую случайность к времени испускания частиц. Если установлено значение ``0``, случайности нет вообще, и интервал между испусканием одной частицы и следующей всегда одинаков: частицы испускаются с *регулярными* интервалами. Значение ``Randomness``, равное ``1``, делает интервал полностью случайным. Вы можете использовать это свойство, чтобы нарушить некоторую однородность в ваших эффектах. Если ``Explosiveness`` установлено значение ``1``, это свойство не имеет никакого эффекта.
ta: `` சீரற்ற தன்மை`` சொத்து துகள் உமிழ்வு நேரத்திற்கு சில சீரற்ற தன்மையை சேர்க்கிறது. `` 0`` என அமைக்கப்பட்டால், எந்தவிதமான சீரற்ற தன்மையும் இல்லை, ஒரு துகள் உமிழ்வுக்கு இடையிலான இடைவெளி எப்போதும் ஒரே மாதிரியாக இருக்கும்: துகள்கள் * வழக்கமான * இடைவெளியில் வெளியேற்றப்படுகின்றன. `` 1`` இன் `` சீரற்ற தன்மை` மதிப்பு இடைவெளியை முற்றிலும் சீரற்றதாக ஆக்குகிறது. உங்கள் விளைவுகளில் சில சீரான தன்மையை உடைக்க இந்த சொத்தை நீங்கள் பயன்படுத்தலாம். `` வெடிக்கும் தன்மை`` `` 1`` என அமைக்கப்பட்டால், இந்த சொத்து எந்த விளைவையும் ஏற்படுத்தாது.
uk: Властивість ``Випадковість`` додає деяку випадковість до часу випромінювання частинок. Якщо встановлено значення ``0``, випадковість взагалі відсутня, а інтервал між випромінюванням однієї частинки та наступною завжди однаковий: частинки випромінюються з *регулярними* інтервалами. Значення ``випадковості`` ``1`` робить інтервал абсолютно випадковим. Ви можете використовувати цю властивість, щоб порушити певну одноманітність ефектів. Якщо для ``Explosiveness`` встановлено ``1``, ця властивість не впливає.
zh_cn: ``Randomness`` 属性为粒子发射时间添加了一些随机性。当设置为 ``0`` 时，完全没有随机性，一个粒子和下一个粒子的发射间隔始终相同：粒子以\ *固定*\ 间隔发射。当 ``Randomness`` 值为 ``1`` 时，间隔完全随机。可以使用该属性来打破效果中的一些均匀性。当 ``Explosiveness`` 设置为 ``1`` 时，该属性无效。
zh_tw: 「Randomness」屬性會讓粒子的發射時機帶有隨機性。設為 0 時，發射間隔完全固定，粒子均勻出現。設為 1 時，間隔完全隨機，可以讓效果更自然。若「Explosiveness」設為 1，此屬性則無作用。

source: Particles running at low FPS
de: Partikel, die mit niedrigen FPS laufen
ga: Cáithníní ag rith ag FPS íseal
pt_br: Partículas rodando em FPS baixo
ru: Частицы, работающие на низких FPS
ta: குறைந்த FPS இல் இயங்கும் துகள்கள்
uk: Частинки, що працюють на низькому FPS
zh_cn: 粒子以低帧率运行
zh_tw: 低 FPS 下執行的粒子效果

source: Interpolation off (left) vs. on (right)
pt_br: Interpolação desligada (esquerda) vs. ligada (direita)
ru: Интерполяция (слева) против (справа)
uk: Інтерполяція вимкнена (зліва) проти ввімкнення (праворуч)
zh_tw: 關閉插值（左）vs. 啟用插值（右）

source: The ``Fixed FPS`` property limits how often the particle system is processed. This includes property updates as well as collision and attractors. This can improve performance a lot, especially in scenes that make heavy use of particle collision. Note that this does not change the speed at which particles move or rotate. You would use the ``Speed Scale`` property for that.
de: Die Property ``Feste FPS`` begrenzt, wie oft das Partikelsystem abgearbeitet wird. Dies beinhaltet Property-Updates sowie Kollisionen und Attraktoren. Dies kann die Performance erheblich verbessern, besonders in Szenen, die viel Gebrauch von Partikelkollisionen machen. Beachten Sie, dass dies nicht die Geschwindigkeit ändert, mit der sich die Partikel bewegen oder rotieren. Hierfür würde man die Property ``Geschwindigkeitsskalierung`` verwenden.
ga: Cuireann an mhaoin 'FPS Seasta'' teorainn le cé chomh minic is a phróiseáiltear córas na gcáithníní. Áirítear leis seo nuashonruithe maoine chomh maith le himbhualadh agus mealltóirí. Is féidir leis seo feidhmíocht a fheabhsú go leor, go háirithe i radhairc a bhaineann úsáid throm as imbhualadh cáithníní. Tabhair faoi deara nach n-athraíonn sé seo an luas ag a ngluaiseann nó a rothlaíonn cáithníní. D'úsáidfeá an mhaoin ''Scála Luais'' chuige sin.
pt_br: A propriedade ``Fixed FPS`` limita a frequência com que o sistema de partículas é processado. Isso inclui atualizações de propriedades, bem como colisões e atratores. Isso pode melhorar muito o desempenho, especialmente em cenas que fazem uso intenso de colisão de partículas. Observe que isso não altera a velocidade com que as partículas se movem ou giram. Você usaria a propriedade ``Speed Scale`` para isso.
ru: Свойство ``Fixed FPS`` ограничивает частоту обработки системы частиц. Сюда входят обновления свойств, а также столкновения и аттракторы. Это может значительно повысить производительность, особенно в сценах, где активно используются столкновения частиц. Обратите внимание, что это не изменяет скорость, с которой частицы движутся или вращаются. Для этого можно использовать свойство ``Speed Scale``.
ta: `` நிலையான FPS`` சொத்து துகள் அமைப்பு எவ்வளவு அடிக்கடி செயலாக்கப்படுகிறது என்பதை கட்டுப்படுத்துகிறது. இதில் சொத்து புதுப்பிப்புகள் மற்றும் மோதல் மற்றும் ஈர்ப்பவர்கள் உள்ளனர். இது செயல்திறனை நிறைய மேம்படுத்தலாம், குறிப்பாக துகள் மோதலை அதிக அளவில் பயன்படுத்தும் காட்சிகளில். இது துகள்கள் நகரும் அல்லது சுழலும் வேகத்தை மாற்றாது என்பதை நினைவில் கொள்க. அதற்காக நீங்கள் `` வேக அளவுகோல்` சொத்தைப் பயன்படுத்துவீர்கள்.
uk: Властивість ``Fixed FPS`` обмежує частоту обробки системи частинок. Це включає оновлення властивостей, а також колізії та атрактори. Це може значно підвищити продуктивність, особливо в сценах, де активно використовуються зіткнення частинок. Зверніть увагу, що це не змінює швидкість, з якою частинки рухаються чи обертаються. Для цього слід використовувати властивість ``Speed Scale``.
zh_cn: ``Fixed FPS`` 属性限制了粒子系统的处理频率，包括属性更新以及碰撞和吸引器。这可以有效提高性能，特别是在大量使用粒子碰撞的场景中。请注意，这不会改变粒子移动或旋转的速度。要更改这些属性，应该使用 ``Speed Scale`` 属性。
zh_tw: 「Fixed FPS」屬性限制粒子系統更新的頻率，包含屬性、碰撞、吸引器等計算。這可以大幅提升效能，特別是在有大量粒子碰撞時。注意這不會影響粒子的移動或旋轉速度，若要調整速度請使用「Speed Scale」。

source: When you set ``Fixed FPS`` to very low values, you will notice that the particle animation starts to look choppy. This can sometimes be desired if it fits the art direction, but most of the time, you'll want particle systems to animate smoothly. That's what the ``Interpolate`` property does. It blends particle properties between updates so that even a particle system running at ``10`` FPS appears as smooth as running at ``60``.
de: Wenn Sie ``Feste FPS`` auf sehr niedrige Werte setzen, werden Sie feststellen, dass die Partikelanimation abgehackt aussieht. Dies kann manchmal erwünscht sein, wenn es zum Designkonzept passt, aber meistens möchte man, dass die Partikelsysteme flüssig animiert werden. Dafür gibt es die Property ``Interpolieren``. Sie überblendet die Partikel-Propertys zwischen den Aktualisierungen, so dass selbst ein Partikelsystem, das mit ``10`` FPS läuft, so gleichmäßig erscheint wie ein System, das mit ``60`` läuft.
ga: Nuair a shocraíonn tú ''FPS Seasta'' le luachanna an-íseal, tabharfaidh tú faoi deara go dtosaíonn beochan na gcáithníní ag breathnú choppy. Is féidir é seo a bheith ag teastáil uaireanta má oireann sé an treo ealaíne, ach an chuid is mó den am, beidh tú ag iarraidh córais cáithníní a bheochan go réidh. Sin a dhéanann an mhaoin ''Idirshuíomh''. Cumascann sé airíonna na gcáithníní idir nuashonruithe ionas go bhfeictear fiú córas cáithníní a ritheann ag ''10'' FPS chomh réidh le rith ag ''60''.
pt_br: Quando você define o ``Fixed FPS`` para valores muito baixos, você notará que a animação das partículas começa a parecer instável. Isso pode ser desejável se encaixar na direção de arte, mas na maioria das vezes, você vai querer que os sistemas de partículas animem suavemente. Isso é o que a propriedade ``Interpolate`` faz. Ela mistura as propriedades das partículas entre as atualizações para que mesmo um sistema de partículas rodando a ``10`` FPS pareça tão suave quanto rodando a ``60``.
ru: Если вы установите ``Fixed FPS`` на очень низкие значения, вы заметите, что анимация частиц начинает выглядеть прерывистой. Иногда это может быть желательно, если это соответствует художественному направлению, но в большинстве случаев вы захотите, чтобы системы частиц анимировались плавно. Именно это и делает свойство ``Interpolate``. Оно смешивает свойства частиц между обновлениями, так что даже система частиц, работающая на ``10`` FPS, выглядит такой же плавной, как и работающая на ``60``.
ta: நீங்கள் `` நிலையான FPS`` ஐ மிகக் குறைந்த மதிப்புகளுக்கு அமைக்கும் போது, துகள் அனிமேசன் வெறுக்கத்தக்கதாகத் தோன்றும் என்பதை நீங்கள் கவனிப்பீர்கள். கலை திசைக்கு பொருந்தினால் இது சில நேரங்களில் விரும்பப்படலாம், ஆனால் பெரும்பாலான நேரங்களில், துகள் அமைப்புகள் சீராக உயிரூட்ட விரும்புவீர்கள். அதைத்தான் `` இடைக்கணிப்பு` சொத்து செய்கிறது. இது புதுப்பிப்புகளுக்கிடையேயான துகள் பண்புகளை கலக்கிறது, இதனால் `` 10`` இல் இயங்கும் ஒரு துகள் அமைப்பு கூட `` 60`` இல் இயங்குவதைப் போல மென்மையாகத் தோன்றுகிறது.
uk: Коли ви встановлюєте ``Fixed FPS`` на дуже низькі значення, ви помітите, що анімація частинок починає виглядати переривчастою. Іноді це може бути бажаним, якщо це відповідає напрямку мистецтва, але в більшості випадків ви хочете, щоб системи частинок анімувалися плавно. Ось що робить властивість ``Interpolate``. Він поєднує властивості частинок між оновленнями, щоб навіть система частинок, що працює на ``10`` FPS, виглядала так само гладко, як і на ``60``.
zh_cn: 当 ``Fixed FPS`` 设置为非常低的值时，你会注意到粒子动画开始看起来不流畅。如果符合艺术设计，有可能是期望的效果，但大多数情况下，会希望粒子系统动画是平滑的。这就是 ``Interpolate`` 属性的作用，它会在更新之间混合粒子属性，因此即使粒子系统以 ``10`` FPS运行，看起来也像是 ``60`` FPS运行一样平滑。
zh_tw: 若將「Fixed FPS」設得太低，粒子的動畫會變得不流暢。某些美術風格可用這效果，但大多數情況下你會希望動畫平滑。這時可啟用「Interpolate」屬性，在更新之間內插粒子屬性，即使僅 10 FPS 也能呈現如 60 FPS 的流暢度。
