Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/particles/properties.po
Languages: de, ga, pt_br, ru, ta, uk, zh_cn, zh_tw

source: When using :ref:`particle collision <doc_3d_particles_collision>`, tunneling can occur if the particles move fast and colliders are thin. This can be remedied by increasing ``Fixed FPS`` (at a performance cost).
de: Bei Verwendung von :ref:`Partikelkollision <doc_3d_particles_collision>` kann es zu Tunneleffekten kommen, wenn sich die Partikel schnell bewegen und die Kollider dünn sind. Dies kann durch Erhöhen der ``Festen FPS`` (auf Kosten der Leistung) behoben werden.
ga: Nuair a úsáidtear :ref:`imbhualadh cáithníní <doc_3d_particles_collision>`, is féidir tollánú a dhéanamh má ghluaiseann na cáithníní go tapa agus má bhíonn imbhuailteoirí tanaí. Is féidir é seo a leigheas trí ``FPS Seasta`` a mhéadú (ar chostas feidhmíochta).
pt_br: Ao usar :ref:`colisão de partículas <doc_3d_particles_collision>`, o "tunneling" pode ocorrer se as partículas se moverem rapidamente e os colisores forem finos. Isso pode ser remediado aumentando o ``Fixed FPS`` (com custo de desempenho).
ru: При использовании :ref:`particle collision <doc_3d_particles_collision>` может возникнуть туннелирование, если частицы движутся быстро, а коллайдеры тонкие. Это можно исправить, увеличив ``Fixed FPS`` (за счет производительности).
ta: பயன்படுத்தும் போது: குறிப்பு: `துகள் மோதல் <doc_3d_particles_collision>`, துகள்கள் வேகமாக நகர்ந்து கோலிடர்கள் மெல்லியதாக இருந்தால் சுரங்கப்பாதை ஏற்படலாம். `` நிலையான FPS`` ஐ அதிகரிப்பதன் மூலம் இதை சரிசெய்யலாம் (செயல்திறன் செலவில்).
uk: Під час використання :ref:`particle collision <doc_3d_particles_collision>` може виникнути тунелювання, якщо частинки рухаються швидко, а колайдери тонкі. Це можна виправити, збільшивши ``Fixed FPS`` (за ціною продуктивності).
zh_cn: 使用 :ref:`粒子碰撞 <doc_3d_particles_collision>` 时，如果粒子移动速度快且碰撞器较薄，则可能会发生隧道效应。这可以通过增加\ ``固定 FPS``\ （以性能为代价）来解决。
zh_tw: 當使用 :ref:`粒子碰撞 <doc_3d_particles_collision>` 時，如果粒子速度很快且碰撞體很薄，可能會發生穿透現象。這可透過提升「Fixed FPS」（會犧牲效能）來改善。

source: Collision properties
de: Kollisions-Propertys
ga: Airíonna imbhuailtí
ru: Свойства столкновений
ta: மோதல் பண்புகள்
uk: Колізійні властивості
zh_cn: 碰撞属性
zh_tw: 碰撞屬性

source: Setting up particle collision requires following further steps described in :ref:`doc_3d_particles_collision`.
de: Zum Einrichten einer Partikelkollision sind die folgenden weiteren Schritte erforderlich, die in :ref:`doc_3d_particles_collision` beschrieben sind.
ga: Chun imbhualadh cáithníní a chur ar bun, is gá céimeanna breise a leanúint a bhfuil cur síos orthu in :ref:'doc_3d_particles_collision'.
pt_br: A configuração da colisão de partículas requer realizar passos adicionais descritos em :ref:`doc_3d_particles_collision`.
ru: Настройка столкновения частиц требует выполнения дальнейших шагов, описанных в :ref:`doc_3d_particles_collision`.
ta: துகள் மோதலை அமைப்பதற்கு விவரிக்கப்பட்டுள்ள கூடுதல் படிகளைப் பின்பற்ற வேண்டும்: குறிப்பு: `doc_3d_particles_collision`.
uk: Налаштування зіткнення частинок вимагає виконання подальших кроків, описаних у :ref:`doc_3d_particles_collision`.
zh_cn: 设置粒子碰撞需要按照《\ :ref:`doc_3d_particles_collision`\ 》中描述的进一步步骤进行。
zh_tw: 設定粒子碰撞需要依照 :ref:`doc_3d_particles_collision` 章節的進階步驟操作。

source: The ``Base Size`` property defines each particle's default collision size, which is used to check whether a particle is currently colliding with the environment. You would usually want this to be about the same size as the particle. It can make sense to increase this value for particles that are very small and move very fast to prevent them from clipping through the collision geometry.
de: Die Property ``Basisgröße`` definiert die Default-Kollisionsgröße eines jeden Partikels, die verwendet wird, um zu überprüfen, ob ein Partikel gerade mit der Umgebung kollidiert. Normalerweise sollte diese Größe ungefähr der Größe des Partikels entsprechen. Es kann sinnvoll sein, diesen Wert für Partikel zu erhöhen, die sehr klein sind und sich sehr schnell bewegen, um zu verhindern, dass sie durch die Kollisionsgeometrie dringen.
ga: Sainmhíníonn an mhaoin ''Bunmhéid'' méid imbhuailte réamhshocraithe gach cáithnín, a úsáidtear chun a sheiceáil an bhfuil cáithnín ag imbhualadh leis an gcomhshaol faoi láthair. Ba mhaith leat de ghnáth go mbeadh sé seo thart ar an méid céanna leis an gcáithnín. Is féidir leis ciall a bhaint as an luach seo a mhéadú do cháithníní atá an-bheag agus bogadh go han-tapa chun cosc a chur orthu bearradh tríd an geoiméadracht imbhuailte.
pt_br: A propriedade ``Base Size`` define o tamanho de colisão padrão de cada partícula, que é usado para verificar se uma partícula está atualmente colidindo com o ambiente. Você geralmente vai querer que este valor seja aproximadamente do mesmo tamanho da partícula. Pode fazer sentido aumentar este valor para partículas que são muito pequenas e se movem muito rápido para evitar que elas passem pela geometria de colisão.
ru: Свойство ``Base Size`` определяет размер столкновения по умолчанию для каждой частицы, который используется для проверки того, сталкивается ли частица в данный момент с окружающей средой. Обычно вы хотите, чтобы он был примерно такого же размера, как и частица. Может иметь смысл увеличить это значение для частиц, которые очень малы и движутся очень быстро, чтобы предотвратить их прорезание через геометрию столкновения.
ta: `` அடிப்படை அளவு`` சொத்து ஒவ்வொரு துகள் இயல்புநிலை மோதல் அளவையும் வரையறுக்கிறது, இது ஒரு துகள் தற்போது சுற்றுச்சூழலுடன் மோதுகிறதா என்பதைச் சரிபார்க்கப் பயன்படுகிறது. இது வழக்கமாக இது துகள் அதே அளவு இருக்க வேண்டும் என்று நீங்கள் விரும்புவீர்கள். மிகச் சிறிய துகள்களுக்கு இந்த மதிப்பை அதிகரிப்பதும், மோதல் வடிவியல் மூலம் கிளிப்பிங் செய்வதைத் தடுக்க மிக வேகமாக நகரும்.
uk: Властивість ``Базовий розмір`` визначає розмір зіткнення кожної частинки за замовчуванням, який використовується для перевірки того, чи частинка зараз стикається з середовищем. Зазвичай ви хочете, щоб це було приблизно такого ж розміру, як і частинка. Має сенс збільшити це значення для дуже малих частинок, які рухаються дуже швидко, щоб запобігти їхньому вирізанню через геометрію зіткнення.
zh_cn: ``Base Size`` 属性定义了每个粒子的默认碰撞大小，用于检查粒子当前是否与环境发生碰撞。通常，希望这个大小与粒子的大小大致相同。对于非常小且移动非常快的粒子，增加此值可以防止其穿过碰撞几何体。
zh_tw: 「Base Size」屬性設定每個粒子的預設碰撞大小，用來檢查粒子是否與環境發生碰撞。通常應設為與粒子本身差不多的大小。若粒子體積極小且速度很快，建議適度提高此值，以避免粒子穿透碰撞體。

source: Drawing properties
de: Zeichnung-Propertys
ga: Airíonna líníochta
ru: Свойства отрисовки
ta: வரைதல் பண்புகள்
uk: Властивості малюнка
zh_cn: 绘制属性
zh_tw: 繪製屬性

source: Particle drawing properties
de: Partikelzeichnungs-Propertys
ga: Airíonna líníochta cáithníní
ru: Свойства отрисовки частиц
ta: துகள் வரைதல் பண்புகள்
uk: Властивості малювання частинок
zh_cn: 粒子绘制属性
zh_tw: 粒子繪製屬性

source: The ``Visibility AABB`` property defines a box around the particle system's origin. As long as any part of this box is in the camera's field of view, the particle system is visible. As soon as it leaves the camera's field of view, the particle system stops being rendered at all. You can use this property to boost performance by keeping the box as small as possible.
de: Die Eigenschaft ``Sichtbarkeit AABB`` definiert eine Box um den Ursprung des Partikelsystems. Solange sich ein Teil dieser Box im Sichtfeld der Kamera befindet, ist das Partikelsystem sichtbar. Sobald es das Sichtfeld der Kamera verlässt, wird das Partikelsystem nicht mehr gerendert. Sie können diese Property verwenden, um die Performance zu steigern, indem Sie die Box so klein wie möglich halten.
ga: Sainmhíníonn an mhaoin ''Infheictheacht AABB'' bosca timpeall ar bhunús chóras na gcáithníní. Fad is atá aon chuid den bhosca seo i réimse radhairc an cheamara, tá córas na gcáithníní le feiceáil. Chomh luath agus a fhágann sé réimse radhairc an cheamara, stopann córas na gcáithníní á dhéanamh ar chor ar bith. Is féidir leat an mhaoin seo a úsáid chun feidhmíocht a threisiú tríd an mbosca a choinneáil chomh beag agus is féidir.
pt_br: A propriedade ``Visibility AABB`` define uma caixa ao redor da origem do sistema de partículas. Enquanto qualquer parte desta caixa estiver no campo de visão da câmera, o sistema de partículas é visível. Assim que sai do campo de visão da câmera, o sistema de partículas para de ser renderizado por completo. Você pode usar esta propriedade para aumentar o desempenho mantendo a caixa o menor possível.
ru: Свойство ``Visibility AABB`` определяет рамку вокруг начала системы частиц. Пока любая часть этой рамки находится в поле зрения камеры, система частиц видна. Как только она покидает поле зрения камеры, система частиц вообще перестает рендериться. Вы можете использовать это свойство для повышения производительности, сохраняя рамку как можно меньше.
ta: `` தெரிவுநிலை AABB`` சொத்து துகள் அமைப்பின் தோற்றத்தைச் சுற்றியுள்ள ஒரு பெட்டியை வரையறுக்கிறது. இந்த பெட்டியின் எந்த பகுதியும் கேமராவின் பார்வையில் இருக்கும் வரை, துகள் அமைப்பு தெரியும். அது கேமராவின் பார்வையை விட்டு வெளியேறியவுடன், துகள் அமைப்பு வழங்கப்படுவதை நிறுத்துகிறது. பெட்டியை முடிந்தவரை சிறியதாக வைத்திருப்பதன் மூலம் செயல்திறனை அதிகரிக்க இந்த சொத்தை நீங்கள் பயன்படுத்தலாம்.
uk: Властивість ``Видимість AABB`` визначає рамку навколо початку системи частинок. Поки будь-яка частина цього ящика знаходиться в полі зору камери, система частинок видима. Як тільки вона залишає поле зору камери, система частинок взагалі перестає рендеритися. Ви можете використовувати цю властивість для підвищення продуктивності, зберігаючи коробку якомога меншою.
zh_cn: ``Visibility AABB`` 属性定义了一个围绕粒子系统原点的盒子。只要这个盒子的任意部分在相机的视野内，粒子系统就是可见的，一旦离开相机视野，粒子系统将停止渲染，可以尽可能使盒子较小来提高性能。
zh_tw: 「Visibility AABB」設定粒子系統原點周圍的可見方塊，只要方塊有任何部分在攝影機畫面內，粒子系統就會被渲染。若完全離開畫面，則不再渲染。建議將方塊設得越小越好，以提升效能。

source: One thing to keep in mind when you set a size for the ``Visibility AABB`` is that particles that are outside of its bounds disappear instantly when it leaves the camera's field of view. Particle collision will also not occur outside the ``Visibility AABB``. While not technically a bug, this can have a negative effect on the visual experience.
de: Beachten Sie beim Festlegen einer Größe für „Sichtbarkeit AABB“ Folgendes: Partikel, die sich außerhalb dieser Grenzen befinden, verschwinden sofort, wenn sie das Sichtfeld der Kamera verlassen. Partikelkollisionen treten auch außerhalb von „Sichtbarkeit AABB“ nicht auf. Obwohl dies technisch gesehen kein Fehler ist, kann es sich negativ auf das visuelle Erlebnis auswirken.
ga: Rud amháin atá le coinneáil i gcuimhne nuair a shocraíonn tú méid don ''Visibility AABB'' ná go n-imíonn cáithníní atá taobh amuigh dá theorainneacha láithreach nuair a fhágann sé réimse radhairc an cheamara. Ní tharlóidh imbhualadh cáithníní lasmuigh den ''Infheictheacht AABB''. Cé nach fabht é go teicniúil, d'fhéadfadh tionchar diúltach a bheith aige seo ar an eispéireas amhairc.
pt_br: Uma coisa a ter em mente quando você define um tamanho para a ``Visibility AABB`` é que as partículas que estão fora de seus limites desaparecem instantaneamente quando ela sai do campo de visão da câmera. A colisão de partículas também não ocorrerá fora da ``Visibility AABB``. Embora não seja tecnicamente um bug, isso pode ter um efeito negativo na experiência visual.
ru: При установке размера для ``Visibility AABB`` следует помнить, что частицы, находящиеся за его пределами, мгновенно исчезают, как только они покидают поле зрения камеры. Столкновение частиц также не произойдет за пределами ``Visibility AABB``. Хотя технически это не ошибка, это может негативно сказаться на визуальном восприятии.
ta: `` தெரிவுநிலை AABB`` க்கு நீங்கள் ஒரு அளவை அமைக்கும் போது மனதில் கொள்ள வேண்டிய ஒரு சேதி என்னவென்றால், அதன் எல்லைக்கு வெளியே இருக்கும் துகள்கள் கேமராவின் பார்வையை விட்டு வெளியேறும்போது உடனடியாக மறைந்துவிடும். `` தெரிவுநிலை AABB`` க்கு வெளியே துகள் மோதல் ஏற்படாது. தொழில்நுட்ப ரீதியாக ஒரு பிழை இல்லை என்றாலும், இது காட்சி அனுபவத்தில் எதிர்மறையான விளைவை ஏற்படுத்தும்.
uk: Коли ви встановлюєте розмір для ``Видимості AABB``, слід пам’ятати про те, що частинки, які перебувають за його межами, миттєво зникають, коли вони залишають поле зору камери. Зіткнення частинок також не відбудеться за межами ``Видимості AABB``. Хоча технічно це не помилка, це може негативно вплинути на візуальний досвід.
zh_cn: 设置 ``Visibility AABB`` 的大小时需要注意的一点是，当粒子系统离开相机视野时，超出其边界的粒子会立即消失。虽然在技术上来说这不算bug，但可能带来不好的视觉体验。
zh_tw: 設定「Visibility AABB」時要注意，超出方塊邊界的粒子會立即消失，且該範圍外不會發生粒子碰撞。雖然這不是 bug，但可能影響視覺效果。

source: When the ``Local Coords`` property is checked, all particle calculations use the local coordinate system to determine things like up and down, gravity, and movement direction. Up and down, for example, would follow the particle system's or its parent node's rotation. When the property is unchecked, the global world space is used for these calculations: Down will always be -Y in world space, regardless of the particle system's rotation.
de: Wenn die Property ``Lokale Koordinaten`` aktiviert ist, verwenden alle Partikelberechnungen das lokale Koordinatensystem, um Dinge wie Oben und Unten, Schwerkraft und Bewegungsrichtung zu bestimmen. Oben und unten würden zum Beispiel der Rotation des Partikelsystems oder des übergeordneten Nodes folgen. Wenn die Property nicht aktiviert ist, wird der globale World Space für diese Berechnungen verwendet: Unten ist immer -Y im World Space, unabhängig von der Rotation des Partikelsystems.
ga: Nuair a dhéantar seiceáil ar an maoin ''Coords Áitiúil'', úsáideann gach ríomh cáithníní an córas comhordanáidí áitiúil chun rudaí cosúil le suas agus síos, domhantarraingt agus treo gluaiseachta a chinneadh. Suas agus síos, mar shampla, leanfadh rothlú chóras na gcáithníní nó a mháthair-nód. Nuair a bhíonn an mhaoin unchecked, tá an spás domhan domhanda a úsáidtear le haghaidh na ríomhanna: Beidh Down a bheith i gcónaí -Y i spás domhanda, beag beann ar rothlú an chórais cáithníní.
pt_br: Quando a propriedade ``Local Coords`` está marcada, todos os cálculos de partículas usam o sistema de coordenadas local para determinar coisas como para cima e para baixo, gravidade e direção do movimento. Para cima e para baixo, por exemplo, seguiriam a rotação do sistema de partículas ou do seu nó pai. Quando a propriedade não está marcada, o espaço de mundo global é usado para estes cálculos: Para baixo sempre será -Y no espaço de mundo, independentemente da rotação do sistema de partículas.
ru: Если свойство ``Local Coords`` активно, все вычисления частиц используют локальную систему координат для определения таких вещей, как верх и низ, гравитация и направление движения. Например, верх и низ будут следовать вращению системы частиц или ее родительского узла. Если свойство не отмечено, для этих вычислений используется глобальное мировое пространство: низ всегда будет -Y в мировом пространстве, независимо от вращения системы частиц.
ta: `` உள்ளக கோடுகள்`` சொத்து சரிபார்க்கப்படும்போது, அனைத்து துகள் கணக்கீடுகளும் உள்ளக ஒருங்கிணைப்பு முறையைப் பயன்படுத்தி மேல் மற்றும் கீழ், ஈர்ப்பு மற்றும் இயக்க திசை போன்ற விசயங்களைத் தீர்மானிக்கின்றன. எடுத்துக்காட்டாக, மேலேயும் கீழ்நோக்கி, துகள் அமைப்பின் அல்லது அதன் பெற்றோர் முனையின் சுழற்சியைப் பின்பற்றும். சொத்து தேர்வு செய்யப்படும்போது, இந்த கணக்கீடுகளுக்கு உலகளாவிய உலக இடம் பயன்படுத்தப்படுகிறது: துகள் அமைப்பின் சுழற்சியைப் பொருட்படுத்தாமல், உலக இடைவெளியில் எப்போதும் இருக்கும்.
uk: Якщо позначено властивість ``Місцеві координати``, усі обчислення частинок використовують локальну систему координат для визначення таких речей, як вгору та вниз, силу тяжіння та напрямок руху. Вгору та вниз, наприклад, слідуватиме обертанню системи частинок або її батьківського вузла. Якщо властивість не позначено, для цих обчислень використовується глобальний світовий простір: вниз завжди буде -Y у світовому просторі, незалежно від обертання системи частинок.
zh_cn: 当选中 ``Local Coords`` 属性时，所有粒子计算都使用局部坐标系来确定诸如上下、重力和运动方向等。例如，上下会跟随粒子系统或其父节点而旋转。当未选中该属性时，这些计算将使用全局世界空间：在世界空间中，向下始终为 -Y ，不跟随粒子系统旋转。
zh_tw: 勾選「Local Coords」時，所有粒子的運算（重力、上下方向、移動方向等）都以本地座標系統為準，例如上下會跟隨粒子系統或父節點的旋轉。若未勾選，則以全域世界座標計算，無論粒子系統旋轉與否，下方永遠是世界空間的 -Y。

source: Local space coordinates (left) vs. world space coordinates (right)
de: Local-Space-Koordinaten (links) vs. World-Space-Koordinaten (rechts)
ga: Comhordanáidí spáis áitiúla (ar chlé) vs comhordanáidí spáis domhanda (ar dheis)
pt_br: Coordenadas do espaço local (esquerda) vs. coordenadas do espaço de mundo (direita)
ru: Локальные координаты (слева) vs. мировые координаты (справа)
ta: உள்ளக விண்வெளி ஒருங்கிணைப்புகள் (இடது) எதிராக உலக விண்வெளி ஆயத்தொகுப்புகள் (வலது)
uk: Локальні просторові координати (ліворуч) проти світових просторових координат (праворуч)
zh_cn: 局部空间坐标（左）与世界空间坐标（右）
zh_tw: 本地座標（左）與世界座標（右）

source: The ``Draw Order`` property controls the order in which individual particles are drawn. ``Index`` means that they are drawn in the order of emission: particles that are spawned later are drawn on top of earlier ones. ``Lifetime`` means that they are drawn in the order of their remaining lifetime. ``Reverse Lifetime`` reverses the ``Lifetime`` draw order. ``View Depth`` means particles are drawn according to their distance from the camera: The ones closer to the camera on top of those farther away.
de: Die Property ``Zeichenreihenfolge`` bestimmt die Reihenfolge, in der die einzelnen Partikel gezeichnet werden. ``Index`` bedeutet, dass sie in der Reihenfolge ihrer Emission gezeichnet werden: Partikel, die später erzeugt werden, werden über die früheren gezeichnet. ``Lebensdauer`` bedeutet, dass sie in der Reihenfolge ihrer verbleibenden Lebensdauer gezeichnet werden. ``Umgekehrte Lebensdauer`` kehrt die Zeichenreihenfolge der ``Lebensdauer`` um. ``Sichttiefe`` bedeutet, dass die Partikel entsprechend ihrer Entfernung von der Kamera gezeichnet werden: Diejenigen, die näher an der Kamera sind, werden über denjenigen gezeichnet, die weiter entfernt sind.
ga: Rialaíonn an mhaoin ''Ordú Tarraingthe'' an t-ord ina dtarraingítear cáithníní aonair. Ciallaíonn ""innéacs" go dtarraingítear iad in ord na n-astaíochtaí: tarraingítear cáithníní a sceitheann níos déanaí ar bharr na gcáithníní níos luaithe. Ciallaíonn ''Saolré'' go dtarraingítear iad in ord a saolré atá fágtha. Aisiompaíonn ''Reverse Lifetime'' an t-ordú tarraingthe ''Lifetime''. Ciallaíonn ''Doimhneacht Radhairc'' cáithníní a tharraingt de réir a n-achar ón gceamara: Na cinn atá níos gaire don cheamara ar bharr na ndaoine is faide ar shiúl.
pt_br: A propriedade ``Draw Order`` controla a ordem em que as partículas individuais são desenhadas. ``Index`` significa que elas são desenhadas na ordem de emissão: partículas que são geradas mais tarde são desenhadas sobre as mais antigas. ``Lifetime`` significa que elas são desenhadas na ordem de seu tempo de vida restante. ``Reverse Lifetime`` inverte a ordem de desenho de ``Lifetime``. ``View Depth`` significa que as partículas são desenhadas conforme a sua distância da câmera: As mais próximas da câmera ficam sobre as mais distantes.
ru: Свойство ``Draw Order`` управляет порядком, в котором отрисовываются отдельные частицы. ``Index`` означает, что они отрисовываются в порядке испускания: частицы, которые создаются позже, отрисовываются поверх более ранних. ``Lifetime`` означает, что они отрисовываются в порядке их оставшегося времени жизни. ``Reverse Lifetime`` меняет порядок отрисовки ``Lifetime`` на противоположный. ``View Depth`` означает, что частицы отрисовываются в соответствии с их расстоянием от камеры: те, что ближе к камере, поверх тех, что дальше.
ta: `` டிரா ஆர்டர்`` சொத்து தனிப்பட்ட துகள்கள் வரையப்பட்ட வரிசையை கட்டுப்படுத்துகிறது. `` குறியீட்டு`` என்றால் அவை உமிழ்வு வரிசையில் வரையப்படுகின்றன: பின்னர் உருவாகும் துகள்கள் முந்தையவற்றின் மேல் வரையப்படுகின்றன. `` வாழ்நாள்`` என்றால் அவை மீதமுள்ள வாழ்நாளின் வரிசையில் வரையப்படுகின்றன. `` வாழ்நாள் `` `வாழ்நாள்`` டிரா ஆர்டரை மாற்றியமைக்கிறது. `` ஆழத்தைக் காண்க` என்றால், கேமராவிலிருந்து அவற்றின் தூரத்திற்கு ஏற்ப துகள்கள் வரையப்படுகின்றன: தூரத்தில் உள்ள கேமராவுக்கு நெருக்கமானவை.
uk: Властивість ``Порядок малювання`` контролює порядок малювання окремих частинок. ``Індекс`` означає, що вони малюються в порядку випромінювання: частинки, які породжуються пізніше, малюються поверх попередніх. ``Життєвий ресурс`` означає, що вони малюються в порядку, що залишився до кінця життя. ``Reverse Lifetime`` змінює порядок розіграшу ``Lifetime``. ``Глибина огляду`` означає, що частинки малюються відповідно до їх відстані від камери: ті, що ближче до камери, над тими, що знаходяться далі.
zh_cn: ``Draw Order`` 属性控制着单个粒子绘制时的顺序。\ ``Index`` 代表以发射顺序绘制：即后生成的粒子会绘制在先生成的粒子的顶层。。\ ``Lifetime`` 代表以剩余生命周期顺序绘制。\ ``Reverse Lifetime`` 则是反转了 ``Lifetime`` 的绘制顺序。\ ``View Depth`` 代表以与摄像机的距离顺序绘制：距离摄像机更近的粒子绘制在更远的粒子顶层。
zh_tw: 「Draw Order」屬性決定粒子的繪製順序。「Index」按發射順序繪製，後發射的粒子會蓋在前一個之上。「Lifetime」則依剩餘壽命排序繪製。「Reverse Lifetime」則反轉壽命順序。「View Depth」則依據與攝影機的距離，較近的粒子會蓋在較遠的上面。
