Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/custom_resource_format_loaders.po
Languages: ga, it, pl, ru, ta, uk, zh_tw

source: Custom resource format loaders
ga: Luchtaitheoirí formáid acmhainní
it: Caricatori di formato di risorse personalizzati
pl: Dołącz obraz jako zasób {ścieżka}
ru: Собственные загрузчики форматов ресурсов
ta: தனிப்பயன் வள வடிவமைப்பு ஏற்றிகள்
uk: Завантажувачі власних форматів ресурсів
zh_tw: 自訂資源格式載入器

source: Introduction
ga: Réamhrá
it: Introduzione
pl: Wprowadzenie
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_tw: 前言

source: ResourceFormatLoader is a factory interface for loading file assets. Resources are primary containers. When load is called on the same file path again, the previous loaded Resource will be referenced. Naturally, loaded resources must be stateless.
ga: Is comhéadan monarchan é ResourceFormatLoader chun sócmhainní comhaid a luchtú. Is coimeádáin phríomhchoimeádá Nuair a ghlaofar ualach ar an gcosán comhaid céanna arís, déanfar tagairt don Acmhainn luchtaithe roimhe seo. Ar ndóigh, ní mór acmhainní luchtaithe a bheith gan stát.
it: ResourceFormatLoader è un'interfaccia per il caricamento di file. Le risorse sono contenitori primari. Quando il caricamento è richiamato sullo stesso percorso di file, la risorsa caricata in precedenza verrà referenziata. Naturalmente, le risorse caricate devono essere senza stato (stateless).
ru: ResourceFormatLoader это интерфейс фабрики для загрузки файлов ассетов. Ресурсы это первичные контейнеры. Когда загрузка вызывается для того же файла снова, предыдущий загруженный Resource создаст ссылку. Естественно, загруженные ресурсы должны быть stateless.
ta: Rounceformatloader என்பது கோப்பு சொத்துக்களை ஏற்றுவதற்கான தொழிற்சாலை இடைமுகமாகும். வளங்கள் முதன்மை கொள்கலன்கள். சுமை மீண்டும் அதே கோப்பு பாதையில் அழைக்கப்படும்போது, முந்தைய ஏற்றப்பட்ட வளம் குறிப்பிடப்படும். இயற்கையாகவே, ஏற்றப்பட்ட வளங்கள் நிலையற்றதாக இருக்க வேண்டும்.
uk: ResourceFormatLoader — це заводський інтерфейс для завантаження файлів. Ресурси є основними контейнерами. Коли load буде викликано за тим самим шляхом до файлу знову, посилатиметься на попередній завантажений ресурс. Природно, завантажені ресурси повинні бути без стану.
zh_tw: ResourceFormatLoader 是用來載入檔案資產的工廠介面。資源是主要的容器，當再次於相同檔案路徑呼叫載入時，會參照到先前已載入的 Resource。理論上，載入的資源必須是無狀態的。

source: This guide assumes the reader knows how to create C++ modules and Godot data types. If not, refer to this guide: :ref:`doc_custom_modules_in_cpp`
ga: Glacann an treoir seo leis go bhfuil a fhios ag an léitheoir conas modúil C ++ agus cineálacha sonraí Godot a chruthú. Mura bhfuil, féach don treoir seo: :ref: `doc_custom_modules_in_cpp`
it: Questa guida presuppone che il lettore sappia come creare moduli C++ e tipi di dati di Godot. Se no, consultare questa guida: :ref:`doc_custom_modules_in_cpp`
ru: Это руководство подразумевает что читатель знаком с созданием модулей на C++ и разбирается в типах данных Godot. Если нет, то ознакомьтесь с данным гайдом: :ref:`doc_custom_modules_in_c++`.
ta: இந்த வழிகாட்டி சி ++ தொகுதிகள் மற்றும் கோடோட் தரவு வகைகளை எவ்வாறு உருவாக்குவது என்பது வாசகருக்குத் தெரியும் என்று கருதுகிறது. இல்லையென்றால், இந்த வழிகாட்டியைப் பார்க்கவும் :: ref: `doc_custom_modules_in_cpp`
uk: Цей посібник передбачає, що читач знає, як створювати модулі C++ і типи даних Godot. Якщо ні, зверніться до цього посібника: :ref:`doc_custom_modules_in_cpp`
zh_tw: 本指南假設讀者已經了解如何建立 C++ 模組與 Godot 資料型別。若不熟悉，請參考 :ref:`doc_custom_modules_in_cpp` 此指南

source: References
ga: Tagairtí
it: Riferimenti
pl: Odniesienia
ru: Ссылки
ta: குறிப்புகள்
uk: Посилання
zh_tw: 參考資料

source: What for?
ga: Céard dó?
pl: Po co?
ru: Для чего это?
ta: என்ன?
uk: для чого?
zh_tw: 用途說明?

source: Adding new support for many file formats
ga: Tacaíocht nua a chur leis do go leor formáidí comhaid
it: Aggiungere nuovo supporto per numerosi formati di file
pl: Dodawanie wsparcia dla wielu formatów plików
ru: Добавление новой поддержки для множества форматов файлов
ta: பல கோப்பு வடிவங்களுக்கு புதிய ஆதரவைச் சேர்ப்பது
uk: Додавання нової підтримки для багатьох форматів файлів
zh_tw: 新增多種檔案格式的支援

source: Audio formats
ga: Formáidí fuaime
it: Formati audio
pl: Formaty dźwięku
ru: Форматы звука
ta: ஆடியோ வடிவங்கள்
uk: Формати звукових даних
zh_tw: 音訊格式

source: Video formats
ga: Formáidí físe
it: Formati video
pl: Formaty Video
ru: Форматы видео
ta: வீடியோ வடிவங்கள்
uk: Формати відео
zh_tw: 影片格式

source: Machine learning models
ga: Samhlacha foghlama meaisín
it: Modelli di machine learning
pl: Modele maszynowego uczenia
ru: Форматы машинного обучения
ta: இயந்திர கற்றல் மாதிரிகள்
uk: Моделі машинного навчання
zh_tw: 機器學習模型

source: What not?
ga: Cad nach bhfuil?
pl: Dlaczego nie?
ru: Что нет?
ta: என்ன இல்லை?
uk: Що ні?
zh_tw: 不適用於哪些？

source: Raster images
ga: Íomhánna raster
it: Immagini raster
pl: Obrazy rastrowe
ru: Растровые изображения
ta: ராச்டர் படங்கள்
uk: Растрові зображення
zh_tw: 點陣圖

source: ImageFormatLoader should be used to load images.
ga: Ba chóir ImageFormatLoader a úsáid chun íomhánna a luchtú.
it: Si dovrebbe utilizzare ImageFormatLoader per caricare immagini.
pl: ImageFormatLoader powinien zostać użyty do załadowania obrazu.
ru: ImageFormatLoader должен использоваться для загрузки изображений.
ta: படங்களை ஏற்ற இமேச் ஃபார்மாட்லோடர் பயன்படுத்தப்பட வேண்டும்.
uk: Для завантаження зображень слід використовувати ImageFormatLoader.
zh_tw: 應使用 ImageFormatLoader 來載入圖片。

source: `core/io/image_loader.h <https://github.com/godotengine/godot/blob/master/core/io/image_loader.h>`_
ta: `core/io/image_loader.h <https://github.com/godotengine/godot/blob/master/core/image_loader.h>` _ _

source: Creating a ResourceFormatLoader
ga: Cruthú ResourceFormatLoader
it: Creare un ResourceFormatLoader
ru: Создание ResourceFormatLoader
ta: ஒரு வள வடிவத்தை உருவாக்குதல்
uk: Створення ResourceFormatLoader
zh_tw: 建立 ResourceFormatLoader

source: Each file format consist of a data container and a ``ResourceFormatLoader``.
ga: Is éard atá i ngach formáid comhaid ná coimeádán sonraí agus ``ResourceFormatLoader``.
it: Ogni formato di file consiste in un contenitore di dati e da un ``ResourceFormatLoader``.
ru: Каждый формат файла состоит из контейнера данных и ``ResourceFormatLoader``.
ta: ஒவ்வொரு கோப்பு வடிவமும் தரவு கொள்கலன் மற்றும் `` resourceformatalatalor`` ஆகியவற்றைக் கொண்டுள்ளது.
uk: Кожен формат файлу складається з контейнера даних і ``ResourceFormatLoader``.
zh_tw: 每個檔案格式都包含一個資料容器以及一個 ``ResourceFormatLoader``。

source: ResourceFormatLoaders are classes which return all the necessary metadata for supporting new extensions in Godot. The class must return the format name and the extension string.
ga: Is ranganna iad ResourceFormatLoaders a thugann na meiteashonraí riachtanacha go léir ar ais chun tacú le síntí nua i Godot. Caithfidh an rang an t-ainm formáide agus an teaghrán síneadh a thabhairt ar ais.
it: I ResourceFormatLoader sono classi che restituiscono tutti i metadati necessari per supportare nuove estensioni in Godot. La classe deve restituire il nome del formato e l'estensione.
ru: ResourceFormatLoader'ы - это классы, которые возвращают все необходимые метаданные для поддержки новых расширений в Godot. Класс должен возвращать имя формата и название расширения.
ta: ரிசோர்ச்ஃபார்மாட்லோடர்கள் என்பது கோடோட்டில் புதிய நீட்டிப்புகளை ஆதரிப்பதற்கு தேவையான அனைத்து மெட்டாடேட்டாவையும் திருப்பித் தரும் வகுப்புகள். வகுப்பு வடிவமைப்பு பெயர் மற்றும் நீட்டிப்பு சரத்தை திருப்பித் தர வேண்டும்.
uk: ResourceFormatLoaders — це класи, які повертають усі необхідні метадані для підтримки нових розширень у Godot. Клас має повертати назву формату та рядок розширення.
zh_tw: ResourceFormatLoader 是回傳所有必要後設資料以支援 Godot 新副檔名的類別。該類別必須回傳格式名稱與副檔名字串。

source: In addition, ResourceFormatLoaders must convert file paths into resources with the ``load`` function. To load a resource, ``load`` must read and handle data serialization.
ga: Ina theannta sin, ní mór do ResourceFormatLoaders cosáin comhaid a thiontú ina acmhainní leis an bhfeidhm ``load`. Chun acmhainn a luchtú, ní mór ``load ``sraitheadh sonraí a léamh agus a láimhseáil.
it: Inoltre, i ResourceFormatLoader devono convertire i percorsi dei file in risorse con la funzione ``load``. Per caricare una risorsa, ``load`` deve leggere e gestire la serializzazione dei dati.
ru: Кроме того, загрузчики Resourceformat должны преобразовывать пути к файлам в ресурсы с помощью функции ``загрузки``. Чтобы загрузить ресурс, ``загрузка`` должна читать и записывать сериализацию данных.
ta: கூடுதலாக, ரிசோர்ச்ஃபார்மட்லோடர்கள் கோப்பு பாதைகளை `` சுமை`` செயல்பாட்டுடன் வளங்களாக மாற்ற வேண்டும். ஒரு வளத்தை ஏற்றுவதற்கு, `` சுமை`` தரவு சீரியலைசேசனைப் படித்து கையாள வேண்டும்.
uk: Крім того, ResourceFormatLoaders повинні перетворювати шляхи до файлів у ресурси за допомогою функції ``load``. Щоб завантажити ресурс, ``load`` має прочитати та обробити серіалізацію даних.
zh_tw: 此外，ResourceFormatLoader 必須實作 ``load`` 函式，將檔案路徑轉換為資源。載入資源時，``load`` 必須負責讀取並處理資料序列化。

source: Creating a ResourceFormatSaver
ga: Cruthú ResourceFormatSaver
it: Creare un ResourceFormatSaver
ru: Создание ResourceFormatSaver
ta: ஒரு வள வடிவத்தை உருவாக்குதல்
uk: Створення ResourceFormatSaver
zh_tw: 建立 ResourceFormatSaver

source: If you'd like to be able to edit and save a resource, you can implement a ``ResourceFormatSaver``:
ga: Más mian leat a bheith in ann acmhainn a chur in eagar agus a shábháil, is féidir leat `ResourceFormatsaver`` a chur i bhfeidhm:
it: Se si desidera modificare e salvare una risorsa, è possibile implementare un ``ResourceFormatSaver``:
ru: Если вы хотите иметь возможность изменять и сохранять ресурс, то вы можете реализовать ``ResourceFormatSaver``:
ta: ஒரு வளத்தைத் திருத்தவும் சேமிக்கவும் நீங்கள் விரும்பினால், நீங்கள் ஒரு `` ரிசோர்சச்ஃபார்மேட்சேவர்`` ஐ செயல்படுத்தலாம்:
uk: Якщо ви хочете мати можливість редагувати та зберігати ресурс, ви можете реалізувати ``ResourceFormatSaver``:
zh_tw: 若希望能夠編輯並儲存資源，可實作一個 ``ResourceFormatSaver``：

source: Creating custom data types
ga: Cruthú cineálacha sonraí saincheaptha
it: Creare tipi di dati personalizzati
ru: Создание кастомных типов данных
ta: தனிப்பயன் தரவு வகைகளை உருவாக்குதல்
uk: Створення власних типів даних
zh_tw: 建立自訂資料型別

source: Godot may not have a proper substitute within its :ref:`doc_core_types` or managed resources. Godot needs a new registered data type to understand additional binary formats such as machine learning models.
ga: B'fhéidir nach mbeidh ionadaí ceart ag Godot laistigh dá: ref: `doc_core_types` nó acmhainní bainistithe. Teastaíonn cineál sonraí cláraithe nua ó Godot chun formáidí dénártha breise mar shamhlacha foghlama meaisín a thuiscint.
it: Godot potrebbe non avere un sostituto adeguato dentro i suoi :ref:`doc_core_types` o nelle risorse gestite. Godot necessita di un nuovo tipo di dati registrato per comprendere ulteriori formati binari, come i modelli di machine learning.
ru: У Godot может не быть подходящей замены в его :ref:`doc_core_types` или управляемых ресурсах. Godot нужен новый зарегистрированный тип данных, чтобы понять дополнительные двоичные форматы, такие как модели машинного обучения.
ta: கோடோட் அதன் சரியான மாற்றீட்டைக் கொண்டிருக்காமல் இருக்கலாம்: குறிப்பு: `doc_core_types` அல்லது நிர்வகிக்கப்பட்ட வளங்கள். இயந்திர கற்றல் மாதிரிகள் போன்ற கூடுதல் பைனரி வடிவங்களைப் புரிந்துகொள்ள கோடோட் ஒரு புதிய பதிவு செய்யப்பட்ட தரவு வகை தேவை.
uk: Godot може не мати належної заміни в межах своїх :ref:`doc_core_types` чи керованих ресурсів. Godot потребує нового зареєстрованого типу даних, щоб розуміти додаткові двійкові формати, такі як моделі машинного навчання.
zh_tw: Godot 的 :ref:`doc_core_types` 或管理的資源中可能沒有適當的替代品。這時需註冊新的資料型別，讓 Godot 能夠辨識如機器學習模型等額外的二進位格式。

source: Here is an example of creating a custom datatype:
ga: Seo sampla de chineál sonraí saincheaptha a chruthú:
it: Ecco un esempio di creazione di un tipo di dati personalizzato:
pl: Oto przykład jak stworzyć własny typ danych:
ru: Вот простой пример создания кастомного типа данных:
ta: தனிப்பயன் தரவுத்தளத்தை உருவாக்குவதற்கான எடுத்துக்காட்டு இங்கே:
uk: Ось приклад створення спеціального типу даних:
zh_tw: 以下為建立自訂資料型別的範例：

source: Considerations
ga: Creithnithe
it: Considerazioni
pl: Rozważania
ru: Соображения
ta: பரிசீலனைகள்
uk: міркування
zh_tw: 注意事項

source: Some libraries may not define certain common routines such as IO handling. Therefore, Godot call translations are required.
ga: B'fhéidir nach sainmhíníonn roinnt leabharlanna gnáthaimh choitianta áirithe mar láimhseáil Dá bhrí sin, teastaíonn aistriúcháin ghlaonna Godot.
it: Alcune librerie potrebbero non definire certe routine comuni, come la gestione degli I/O. Pertanto, sono necessarie traduzioni delle chiamate Godot.
ta: சில நூலகங்கள் IO கையாளுதல் போன்ற சில பொதுவான நடைமுறைகளை வரையறுக்காது. எனவே, கோடோட் அழைப்பு மொழிபெயர்ப்புகள் தேவை.
uk: Деякі бібліотеки можуть не визначати певні загальні процедури, такі як обробка вводу-виводу. Тому потрібні переклади викликів Годо.
zh_tw: 有些函式庫可能未定義像是 IO 處理等常用操作，因此必須將 Godot 的呼叫進行轉換。

source: For example, here is the code for translating ``FileAccess`` calls into ``std::istream``.
ga: Mar shampla, seo an cód chun glaonna ``FileAccess`` a aistriú go ``std: :istream``.
it: Ad esempio, ecco il codice per tradurre le chiamate di ``FileAccess`` in ``std::istream``.
ru: Для примера, вот код для перевода вызовов `FileAccess` в `std::istream`.
ta: எடுத்துக்காட்டாக, `` FileAccess`` அழைப்புகளை `` std :: istream`` இல் மொழிபெயர்ப்பதற்கான குறியீடு இங்கே.
uk: Наприклад, ось код для перетворення викликів ``FileAccess`` у ``std::istream``.
zh_tw: 例如，以下程式碼示範如何將 ``FileAccess`` 呼叫轉換為 ``std::istream``。

source: `istream <https://cplusplus.com/reference/istream/istream/>`_
ta: `ச்ட்ரீம் <https://cpluplus.com/reference/istream/istream/>` _

source: Registering the new file format
ga: An fhormáid chomhaid nua a chlárú
it: Registrare il nuovo formato di file
ru: Регистрация нового формата файлов
ta: புதிய கோப்பு வடிவமைப்பை பதிவு செய்தல்
uk: Реєстрація нового формату файлу
zh_tw: 註冊新檔案格式

source: Godot registers ``ResourcesFormatLoader`` with a ``ResourceLoader`` handler. The handler selects the proper loader automatically when ``load`` is called.
ga: Cláraíonn Godot ``ResourcesFormatLoader`` le láimhseálaí ``ResourceLoader``. Roghnaíonn an láimhseálaí an lódóir ceart go huathoibríoch nuair a ghlaítear ``ualach`.
ru: Godot регистрирует ``ResourcesFormatLoader`` с обработчиком` ResourceLoader". Обработчик автоматически выбирает нужный загрузчик при вызове ``load``.
ta: கோடோட் `` ரிசோர்ச்ஃபார்மட்லோட்லோடர்`` ஒரு `` ரிசோர்ச் கனடர்`` கையாளுபவருடன் பதிவு செய்கிறார். `` சுமை`` அழைக்கப்படும்போது கையாளுபவர் தானாகவே சரியான ஏற்றியைத் தேர்ந்தெடுக்கிறார்.
uk: Godot реєструє ``ResourcesFormatLoader`` за допомогою обробника ``ResourceLoader``. Обробник автоматично вибирає відповідний завантажувач під час виклику ``load``.
zh_tw: Godot 會利用 ``ResourceLoader`` 處理器註冊 ``ResourceFormatLoader``，當 ``load`` 被呼叫時，該處理器會自動選擇適合的載入器。

source: Loading it on GDScript
ga: Ag luchtú é ar GDScript
pl: Ładowanie go do GDScript
ru: Загрузка GDScript
ta: GDSCRIPT இல் அதை ஏற்றுகிறது
uk: Завантаження на GDScript
zh_tw: 在 GDScript 載入

source: Save a file called ``demo.json`` with the following contents and place it in the project's root folder:
ga: Sábháil comhad darb ainm `demo.json`` leis an ábhar seo a leanas agus cuir é i bhfillteán fréimhe an tionscadail:
ru: Сохраните файл под названием ``demo.json`` со следующим содержанием и положите его в корневую папку проекта:
ta: பின்வரும் உள்ளடக்கங்களுடன் `` டெமோ.சோன்` என்ற கோப்பைச் சேமித்து திட்டத்தின் ரூட் கோப்புறையில் வைக்கவும்:
uk: Збережіть файл під назвою ``demo.json`` із таким вмістом і розмістіть його в кореневій папці проекту:
zh_tw: 建立一個名為 ``demo.json`` 的檔案，填入以下內容，並放在專案根目錄下：

source: Then attach the following script to any node::
ga: Ansin ceangail an script seo a leanas le haon nód::
it: Poi allega il seguente script a qualsiasi nodo::
pl: Stwórz Węzeł i załącz do niego skrypt:
ru: После чего прикрепите этот скрипт к любому узлу::
ta: பின்வரும் ச்கிரிப்டை எந்த முனையிலும் இணைக்கவும் ::
uk: Потім прикріпіть наступний сценарій до будь-якого вузла::

source: Translation status
pl: Status tłumaczenia
