Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/unit_testing.po
Languages: ga, tr, uk, zh_cn, zh_tw

source: Test if condition does not hold true. Does not fail the test under any circumstance, but logs a warning if something holds true.
ga: Tástáil mura bhfuil an coinníoll fíor. Ní theipeann ar an tástáil faoi imthosca ar bith, ach logálann sé rabhadh má tá rud éigin fíor.
tr: Koşulun doğru olmadığını test edin. Hiçbir koşulda testi başarısızlığa uğratmaz, ancak bir şey doğru çıkarsa bir uyarı günlüğü tutar.
uk: Перевірте, чи умова не виконується. Не проходить тест за жодних обставин, але реєструє попередження, якщо щось вірно.
zh_cn: 检查条件是否不成立。任何情况下都不会让测试失败，但是成立时会记录一条警告。
zh_tw: 測試條件是否為假。不論條件如何都不會使測試失敗，但若條件成立則會記錄警告訊息。

source: All of the above assertions have corresponding ``*_MESSAGE`` macros, which allow to print optional message with rationale of what should happen.
ga: Tá macraí comhfhreagracha `*_MESSAGE`` ag gach ceann de na dearbhú thuas, a cheadaíonn teachtaireacht roghnach a phriontáil le réasúnaíocht ar an méid ba chóir tarlú.
tr: Yukarıdaki tüm onaylamaların, ne olması gerektiğine ilişkin gerekçeleri içeren isteğe bağlı mesaj yazdırmaya izin veren, isme karşılık gelen ``*_MESSAGE`` makroları vardır.
uk: Усі наведені вище твердження мають відповідні макроси ``*_MESSAGE``, які дозволяють надрукувати необов’язкове повідомлення з обґрунтуванням того, що має статися.
zh_cn: 以上断言都有对应的 ``*_MESSAGE`` 宏，能够在原有行为的基础上输出可选的消息。
zh_tw: 上述所有判斷提示皆有對應 ``*_MESSAGE`` 巨集，可用來輸出補充說明訊息。

source: Prefer to use ``CHECK`` for self-explanatory assertions and ``CHECK_MESSAGE`` for more complex ones if you think that it deserves a better explanation.
ga: Is fearr leat ``CHECK`` a úsáid le haghaidh dearbhú féinmhíniúcháin agus ``CHECK_MESSAGE`` le haghaidh cinn níos casta má cheapann tú go bhfuil míniú níos fearr tuillte aige.
tr: Kendi kendini açıklayan onaylamalar için ``CHECK`` ve daha iyi bir açıklamayı hak ettiğini düşündüğünüz daha karmaşık olanlar için ``CHECK_MESSAGE`` kullanmayı tercih edin.
uk: Віддавайте перевагу використанню ``CHECK`` для тверджень, що не потребують пояснень, і ``CHECK_MESSAGE`` для більш складних, якщо ви вважаєте, що це заслуговує на краще пояснення.
zh_cn: 对于能够自我说明的断言请尽量使用 ``CHECK``\ ，如果你认为相对复杂的断言需要更好的解释再使用 ``CHECK_MESSAGE``\ 。
zh_tw: 若判斷提示意義明確，建議用 ``CHECK``，較複雜且需補充說明之處則用 ``CHECK_MESSAGE``。

source: Logging
ga: Logáil
tr: Günlük kaydı
uk: Лісозаготівля
zh_cn: 日志
zh_tw: 記錄

source: The test output is handled by doctest itself, and does not rely on Godot printing or logging functionality at all, so it's recommended to use dedicated macros which allow to log test output in a format written by doctest.
ga: Láimhseálann doctest féin an t-aschur tástála, agus níl sé ag brath ar fheidhmiúlacht priontála nó logála Godot ar chor ar bith, mar sin moltar macros tiomnaithe a úsáid a cheadaíonn aschur tástála a logáil i bhformáid scríofa ag doctest.
tr: Test çıktısı doctest'in kendisi tarafından işlenir ve Godot'nun yazdırma veya günlüğe kaydetme işlevine hiç bağlı değildir, bu nedenle test çıktısını doctest tarafından yazılan bir biçimde günlüğe kaydetmeye izin veren özel makroların kullanılması önerilir.
uk: Тестовий результат обробляється самим doctest і взагалі не покладається на функцію друку або журналювання Godot, тому рекомендується використовувати спеціальні макроси, які дозволяють реєструвати тестовий вихід у форматі, написаному doctest.
zh_cn: 测试输出由 doctest 本身处理，完全不依赖于 Godot 打印或日志功能，因此建议使用专用宏，允许以 doctest 编写的格式记录测试输出。
zh_tw: 測試輸出由 doctest 處理，完全不依賴 Godot 內建的列印或記錄功能，因此建議使用專用巨集以 doctest 格式記錄測試輸出。

source: **Macro**
ga: **Macra**
tr: **Makro**
uk: **Макро**
zh_tw: **巨集**

source: Prints a message.
ga: Priontáil teachtaireacht.
tr: Bir mesaj yazdırır.
uk: Друкує повідомлення.
zh_cn: 打印一条信息.
zh_tw: 輸出一則訊息。

source: Marks the test as failing, but continue the execution. Can be wrapped in conditionals for complex checks.
ga: Marcaíonn sé an tástáil mar theip, ach lean ar aghaidh leis an bhforghníomhú Is féidir é a fhilleadh i gcoinníollacha le haghaidh seiceálacha casta.
tr: Testi başarısız olarak işaretler, ancak yürütmeye devam eder. Karmaşık kontroller için koşullara sarılabilir.
uk: Позначає тест як невдалий, але продовжує виконання. Можна загорнути в умови для складних перевірок.
zh_cn: 将测试标记为失败，但继续执行。可以包含在条件中以进行复杂的检查。
zh_tw: 將測試標記為失敗，但會繼續執行。可用於條件判斷中處理複雜檢查。

source: Fails the test immediately. Can be wrapped in conditionals for complex checks.
ga: Teipeann ar an tástáil láithreach. Is féidir é a fhilleadh i gcoinníollacha le haghaidh seiceálacha casta.
tr: Testi hemen başarısız kılar. Karmaşık kontroller için koşullara sarılabilir.
uk: Одразу провалює тест. Можна загорнути в умови для складних перевірок.
zh_cn: 立即使测试失败。可以包含在条件语句中以进行复杂的检查。
zh_tw: 立即使測試失敗。可用於條件判斷中進行複雜檢查。

source: Different reporters can be chosen at runtime. For instance, here's how the output can be redirected to an XML file:
zh_tw: 執行時可指定不同輸出格式，舉例來說，以下指令可將輸出導向 XML 檔案：

source: Testing failure paths
ga: Cosáin teip a thástáil
tr: Arıza yollarının test edilmesi
uk: Тестування шляхів відмов
zh_cn: 测试故障路径
zh_tw: 測試失敗路徑

source: Sometimes, it's not always feasible to test for an *expected* result. With the Godot development philosophy of that the engine should not crash and should gracefully recover whenever a non-fatal error occurs, it's important to check that those failure paths are indeed safe to execute without crashing the engine.
ga: Uaireanta, ní bhíonn sé indéanta i gcónaí tástáil a dhéanamh le haghaidh tortha* súil leis. Le fealsúnacht forbartha Godot nár chóir don inneall timpiste agus gur cheart go n-aisghabháil go grásta aon uair a tharlaíonn earráid neamh-mharfach, tá sé tábhachtach a sheiceáil go bhfuil na cosáin teip sin sábháilte a fhorghníomhú gan an t-inneall a thréalú.
tr: Bazen, *beklenen* bir sonuç için test yapmak her zaman mümkün olmayabilir. Motorun çökmemesi ve ölümcül olmayan bir hata oluştuğunda zarif bir şekilde iyileşmesi gerektiği üzerine olan Godot geliştirme felsefesi ile, bu hata yollarının motoru çökertmeden yürütülmesinin gerçekten güvenli olup olmadığını kontrol etmek önemlidir.
uk: Іноді не завжди можливо перевірити *очікуваний* результат. Зважаючи на філософію розробки Godot, яка полягає в тому, що двигун не повинен виходити з ладу та повинен плавно відновлюватися щоразу, коли виникає нефатальна помилка, важливо перевірити, чи ці шляхи відмов справді безпечні для виконання без збою двигуна.
zh_cn: 有时，测试\ *预期*\ 结果并不总是可行的。根据 Godot 开发理念，引擎不应崩溃，并且应在发生非致命错误时正常恢复，因此，重要的是检查这些故障路径确实可以安全执行而不会导致引擎崩溃。
zh_tw: 有時無法總是測試「預期」結果。根據 Godot 的開發理念，引擎不應當機，遇到非致命錯誤時須能正常恢復，因此必須確認這些失敗路徑確實能安全執行，不會導致引擎當機。

source: *Unexpected* behavior can be tested in the same way as anything else. The only problem this creates is that the error printing shall unnecessarily pollute the test output with errors coming from the engine itself (even if the end result is successful).
ga: * Is féidir iompar gan súil leis a thástáil ar an mbealach céanna le haon rud eile. Is í an t-aon fhadhb a chruthaíonn sé seo ná go gcuirfidh an priontáil earráide an t-aschur tástála truailliú gan ghá le hearráidí a thagann ón inneall féin (fiú má éiríonn leis an toradh deiridh).
tr: *Beklenmeyen* davranışlar da diğer her şey gibi aynı şekilde test edilebilir. Bunun yarattığı tek sorun, hata yazdırmanın test çıktısını gereksiz yere motorun kendisinden gelen hatalarla kirletmesidir (nihai sonuç başarılı olsa bile).
uk: *Неочікувану* поведінку можна перевірити так само, як і будь-що інше. Єдина проблема, яку це створює, полягає в тому, що друк помилок буде без потреби забруднювати результат тесту помилками, що надходять від самого механізму (навіть якщо кінцевий результат буде успішним).
zh_cn: *意外*\ 行为可以像其他任何行为一样进行测试。这样做的唯一问题是，错误打印会不必要地污染测试输出，因为测试输出中会出现来自引擎本身的错误（即使最终结果是成功的）。
zh_tw: 「非預期」行為同樣可以用一般方式測試。唯一的問題是，這些錯誤訊息會讓測試輸出混入引擎本身產生的錯誤（即使測試結論是成功）。

source: To alleviate this problem, use ``ERR_PRINT_OFF`` and ``ERR_PRINT_ON`` macros directly within test cases to temporarily disable the error output coming from the engine, for instance:
ga: Chun an fhadhb seo a mhaolú, bain úsáid as macros ``ERR_PRINT_OFF`` agus ``ERR_PRINT_ON`` go díreach laistigh de chásanna tástála chun an t-aschur earráide a thagann ón inneall a dhíchumasú go sealadach, mar shampla:
tr: Bu sorunu hafifletmek için, örneğin motordan gelen hata çıktısını geçici olarak devre dışı bırakmak için doğrudan test senaryoları içinde ``ERR_PRINT_OFF`` ve ``ERR_PRINT_ON`` makrolarını kullanın:
uk: Щоб полегшити цю проблему, використовуйте макроси ``ERR_PRINT_OFF`` і ``ERR_PRINT_ON`` безпосередньо в тестових випадках, щоб тимчасово вимкнути виведення помилок, що надходить від механізму, наприклад:
zh_cn: 为了缓解这个问题，请在测试用例中直接使用 ``ERR_PRINT_OFF`` 和 ``ERR_PRINT_ON`` 宏来暂时禁用来自引擎的错误输出，例如：
zh_tw: 為避免上述問題，可在測試案例中直接用 ``ERR_PRINT_OFF`` 與 ``ERR_PRINT_ON`` 巨集，暫時關閉來自引擎的錯誤輸出，例如：

source: Special tags in test case names
zh_tw: 測試案例名稱的特殊標籤

source: These tags can be added to the test case name to modify or extend the test environment:
zh_tw: 可在測試案例名稱內加上下列標籤，以變更或擴充測試環境：

source: **Tag**
zh_cn: **标签**
zh_tw: **標籤**

source: Required for test cases that rely on a scene tree with MessageQueue to be available. It also enables a mock rendering server and :ref:`ThemeDB<class_ThemeDB>`.
zh_tw: 若測試案例需要可用的 SceneTree 以及 MessageQueue，必須加上此標籤。此標籤同時啟用模擬繪圖伺服器與 :ref:`ThemeDB<class_ThemeDB>`。

source: Like ``[SceneTree]``, but with additional editor-related infrastructure available, such as :ref:`EditorSettings<class_EditorSettings>`.
zh_tw: 和 ``[SceneTree]`` 類似，但會額外啟用與編輯器相關的基礎設施，如 :ref:`EditorSettings<class_EditorSettings>`。

source: Initializes the :ref:`AudioServer<class_AudioServer>` using a mock audio driver.
zh_tw: 使用模擬音訊驅動程式初始化 :ref:`AudioServer<class_AudioServer>`。

source: Creates the default 2D/3D navigation servers and makes them available for testing.
zh_tw: 建立預設的 2D/3D 導航伺服器，並讓其可供測試使用。

source: You can use them together to combine multiple test environment extensions.
zh_tw: 這些標籤可組合使用，以同時擴充多種測試環境。

source: Testing signals
zh_cn: 测试信号
zh_tw: 測試訊號

source: The following macros can be use to test signals:
zh_cn: 可以使用以下宏来测试信号：
zh_tw: 可用下列巨集來測試訊號：

source: Macro
zh_cn: 宏
zh_tw: 巨集

source: Description
ga: Cur síos
tr: Tanım
uk: Опис
zh_cn: 描述
zh_tw: 說明

source: Starts watching the specified signal on the given object.
zh_tw: 開始監看指定物件的訊號。

source: Stops watching the specified signal on the given object.
zh_tw: 停止監看指定物件的訊號。

source: Checks the arguments of all fired signals. The outer vector contains each fired signal, while the inner vector contains the list of arguments for that signal. The order of signals is significant.
zh_tw: 檢查所有已發出的訊號參數。外層 Vector 代表每次發出的訊號，內層 Vector 則為該次訊號帶入的參數清單。訊號的順序具有意義。

source: Checks if the specified signal was not fired.
zh_tw: 檢查指定訊號是否未被發送。

source: Discards all records of the specified signal.
zh_tw: 丟棄指定訊號的所有紀錄。

source: Below is an example demonstrating the use of these macros:
zh_tw: 以下為這些巨集用法的範例：

source: Test tools
ga: Uirlisí tástála
tr: Test araçları
uk: Інструменти тестування
zh_cn: 测试工具
zh_tw: 測試工具

source: Test tools are advanced methods which allow you to run arbitrary procedures to facilitate the process of manual testing and debugging the engine internals.
ga: Is ardmhodhanna iad uirlisí tástála a ligeann duit nósanna imeachta treallach a rith chun an próiseas tástála láimhe agus dífhabhtaithe inmheánacha an innill a éascú.
tr: Test araçları, elden test sürecini kolaylaştırmak ve motorun iç kısımlarında hata ayıklamak için rastgele prosedürler çalıştırmanıza olanak tanıyan gelişmiş yöntemlerdir.
uk: Інструменти тестування — це розширені методи, які дозволяють запускати довільні процедури для полегшення процесу ручного тестування та налагодження внутрішніх елементів двигуна.
zh_cn: 测试工具是一种高级方法，允许你运行任意程序，以促进手动测试和调试引擎内部的过程。
zh_tw: 測試工具是進階用法，可讓你執行自訂流程，方便手動測試與偵錯引擎內部運作。

source: These tools can be run by supplying the name of a tool after the ``--test`` command-line option. For instance, the GDScript module implements and registers several tools to help the debugging of the tokenizer, parser, and compiler:
ga: Is féidir na huirlisí seo a reáchtáil trí ainm uirlis a sholáthar tar éis an rogha líne ordaithe ``--tástáil ``. Mar shampla, cuireann an modúl GDScript roinnt uirlisí i bhfeidhm agus a chláraíonn chun cabhrú le dífhabhtú an tokenizer, an parser agus an tiomsaitheoir:
tr: Bu araçlar ``--test`` komut satırı seçeneğinden sonra bir araç adı verilerek çalıştırılabilir. Örneğin, GDScript modülü parçalayıcı (tokenizer), ayrıştırıcı (parser) ve derleyicinin (compiler) hata ayıklamasına yardımcı olmak için çeşitli araçlar uyarlar ve kaydeder:
uk: Ці інструменти можна запускати, вказавши назву інструменту після параметра командного рядка ``--test``. Наприклад, модуль GDScript реалізує та реєструє кілька інструментів, які допомагають налагоджувати токенізатор, парсер і компілятор:
zh_cn: 可以通过在 ``--test`` 命令行选项后提供工具名称来运行这些工具。例如，GDScript 模块实现并注册了几个工具来帮助调试标记器、解析器和编译器：
zh_tw: 這些工具可在 ``--test`` 命令列選項後指定工具名稱來執行。例如 GDScript 模組便實作並註冊了多個工具，協助偵錯分詞器、語法剖析器與編譯器：

source: If any such tool is detected, then the rest of the unit tests are skipped.
ga: Má aimsítear aon uirlis den sórt sin, ansin scipeántar an chuid eile de na tástálacha aonaid.
tr: Böyle bir araç tespit edilirse, birim testlerinin geri kalanı atlanır.
uk: Якщо будь-який такий інструмент виявлено, решта модульних тестів пропускаються.
zh_cn: 如果检测到任何此类工具，则会跳过其余的单元测试。
zh_tw: 若有偵測到這類工具，其餘單元測試會被略過。

source: Test tools can be registered anywhere throughout the engine as the registering mechanism closely resembles of what doctest provides while registering test cases using dynamic initialization technique, but usually these can be registered at corresponding ``register_types.cpp`` sources (per module or core).
ga: Is féidir uirlisí tástála a chlárú áit ar bith ar fud an innill mar go bhfuil an mheicníocht chláraithe cosúil go dlúth leis an méid a sholáthraíonn doctest agus cásanna tástála á gclárú ag baint úsáide as teicníc thúsaithe dinimiciúil, ach de ghnáth is féidir iad seo a chlárú ag foinsí comhfhreagracha ``register_types.cpp`` (de réir an mhodúil nó an chroílár) .
tr: Test araçları motorun herhangi bir yerinden kaydedilebilir, çünkü kayıt mekanizması doctest'in dinamik ilk değerleme tekniğini kullanarak test senaryolarını kaydederken sağladığına çok benzer, ancak genellikle bunlar ilgili ``register_types.cpp`` kaynaklarında (modül veya çekirdek başına) kaydedilebilir.
uk: Інструменти тестування можна зареєструвати будь-де в системі, оскільки механізм реєстрації дуже схожий на той, який надає doctest під час реєстрації тестових випадків за допомогою техніки динамічної ініціалізації, але зазвичай їх можна зареєструвати у відповідних джерелах ``register_types.cpp`` (на модуль або ядро). .
zh_cn: 测试工具可以在整个引擎的任何地方注册，因为该注册机制与 doctest 在使用动态初始化技术注册测试用例时提供的机制非常相似，但通常这些工具可以在相应的 ``register_types.cpp`` 源（每个模块或核心）中注册。
zh_tw: 測試工具可於引擎各處註冊，註冊機制與 doctest 註冊測試案例（採用動態初始化）類似，通常建議在各模組或核心的 ``register_types.cpp`` 檔案中註冊。

source: Here's an example of how GDScript registers test tools in ``modules/gdscript/register_types.cpp``:
ga: Seo sampla den chaoi a gcláraíonn GDScript uirlisí tástála i ``modules/gdscript/register_types.cpp``:
tr: GDScript'in test araçlarını ``modules/gdscript/register_types.cpp`` içinde nasıl kaydettiğine dair bir örnek:
uk: Ось приклад того, як GDScript реєструє інструменти тестування в ``modules/gdscript/register_types.cpp``:
zh_cn: 下面是 GDScript 如何在 ``modules/gdscript/register_types.cpp`` 中注册测试工具的示例：
zh_tw: 以下是 GDScript 在 ``modules/gdscript/register_types.cpp`` 註冊測試工具的範例：

source: The custom command-line parsing can be performed by a test tool itself with the help of OS :ref:`get_cmdline_args<class_OS_method_get_cmdline_args>` method.
ga: Is féidir le huirlis tástála féin parsáil na líne ordaithe saincheaptha a dhéanamh le cabhair ó mhodh OS :ref:`get_cmdline_args<class_OS_method_get_cmdline_args>`.
tr: Özel komut satırı ayrıştırması, OS :ref:`get_cmdline_args <class_OS_method_get_cmdline_args>` yöntemi yardımıyla bir test aracının kendisi tarafından gerçekleştirilebilir.
uk: Настроюваний аналіз командного рядка може виконуватися самим інструментом тестування за допомогою методу ОС :ref:`get_cmdline_args<class_OS_method_get_cmdline_args>`.
zh_cn: 自定义命令行解析可以在 OS 的 :ref:`get_cmdline_args<class_OS_method_get_cmdline_args>` 方法的帮助下由测试工具本身执行。
zh_tw: 測試工具也可自行透過 OS 的 :ref:`get_cmdline_args<class_OS_method_get_cmdline_args>` 方法進行自訂命令列解析。

source: Integration tests for GDScript
ga: Tástálacha comhtháthaithe do GDScript
tr: GDScript için entegrasyon testleri
uk: Інтеграційні тести для GDScript
zh_cn: GDScript 的集成测试
zh_tw: GDScript 整合測試

source: Godot uses doctest to prevent regressions in GDScript during development. There are several types of test scripts which can be written:
ga: Úsáideann Godot doctest chun aischéimnithe i GDScript a chosc le linn na forbartha. Tá cineálacha éagsúla scripteanna tástála ann is féidir a scríobh:
tr: Godot, geliştirme sırasında GDScript'teki gerilemeleri önlemek için doctest kullanır. Yazılabilecek birkaç test betik dosyası türü vardır:
uk: Godot використовує doctest для запобігання регресії в GDScript під час розробки. Існує кілька типів тестових сценаріїв, які можна написати:
zh_cn: Godot 使用 doctest 来防止在开发时引入回归问题。可以编写以下几种测试脚本：
zh_tw: Godot 利用 doctest 防止 GDScript 開發過程中出現回歸錯誤。可撰寫多種類型的測試腳本：

source: tests for expected errors;
ga: tástálacha le haghaidh earráidí súil leis;
tr: beklenen hatalar için testler;
uk: тести на очікувані помилки;
zh_cn: 对预期错误的测试；
zh_tw: 預期錯誤測試;

source: tests for warnings;
ga: tástálacha le haghaidh rabhaidh;
tr: uyarılar için testler;
uk: тести на попередження;
zh_cn: 对警告的测试；
zh_tw: 警告測試;

source: tests for features.
ga: tástálacha le haghaidh gnéithe.
tr: özellikler için testler.
uk: тестує можливості.
zh_cn: 对功能的测试。
zh_tw: 功能測試。

source: Therefore, the process of writing integration tests for GDScript is the following:
ga: Dá bhrí sin, is é seo a leanas an próiseas chun tástálacha comhtháthaithe a scríobh do GDScript:
tr: Bu nedenle, GDScript için entegrasyon testleri yazma süreci aşağıdaki gibidir:
uk: Отже, процес написання інтеграційних тестів для GDScript такий:
zh_cn: 因此，为 GDScript 编写集成测试的步骤如下：
zh_tw: 因此，GDScript 的整合測試流程如下：

source: Pick a type of a test script you'd like to write, and create a new GDScript file under the ``modules/gdscript/tests/scripts`` directory within corresponding sub-directory.
ga: Roghnaigh cineál script tástála ar mhaith leat a scríobh, agus cruthaigh comhad nua GDScript faoin eolaire ``modules/gdscript/tests/scripts` laistigh den fho-eolaire comhfhreagrach.
tr: Yazmak istediğiniz test betiği türünü seçin ve ``modules/gdscript/tests/scripts`` dizini altında ilgili alt dizin içinde yeni bir GDScript dosyası oluşturun.
uk: Виберіть тип тестового сценарію, який ви хочете написати, і створіть новий файл GDScript у каталозі ``modules/gdscript/tests/scripts`` у відповідному підкаталозі.
zh_cn: 选择你想要编写的测试脚本类型，然后在 ``modules/gdscript/tests/scripts`` 目录下对应的子目录中新建 GDScript 脚本。
zh_tw: 選擇欲撰寫的測試腳本類型，在 ``modules/gdscript/tests/scripts`` 下對應子資料夾建立新的 GDScript 檔案。

source: Write GDScript code. The test script must have a function called ``test()`` which takes no arguments. Such function will be called by the test runner. The test should not have any dependency unless it's part of the test too. Global classes (using ``class_name``) are registered before the runner starts, so those should work if needed.
ga: Scríobh cód GDScript. Ní mór feidhm a bheith ag an script tástála darb ainm `test () ``nach dtógann aon argóintí. Glaoifidh an reathóir tástála ar fheidhm den sórt sin. Níor chóir go mbeadh aon spleáchas ag an tástáil mura bhfuil sé mar chuid den tástáil freisin. Cláraítear ranganna domhanda (ag úsáid ``class_name``) sula dtosaíonn an reathóir, mar sin ba chóir dóibh siúd a bheith ag obair más gá.
tr: GDScript kodu yazın. Test betiğinde ``test()`` adında, hiçbir argüman almayan bir fonksiyon bulunmalıdır. Bu fonksiyon test çalıştırıcısı tarafından çağrılacaktır. Testin bir parçası olmadığı sürece testin herhangi bir bağımlılığı da olmamalıdır. Genel sınıflar (``class_name`` kullanılarak) çalıştırıcı başlamadan önce kaydedilir, bu nedenle bunlar gerektiğinde çalışmalıdır.
uk: Напишіть код GDScript. Тестовий сценарій повинен мати функцію під назвою ``test()``, яка не приймає аргументів. Така функція буде викликана тестувальником. Тест не повинен мати жодних залежностей, якщо він також не є частиною тесту. Глобальні класи (з використанням ``class_name``) реєструються перед запуском бігуна, тому вони повинні працювати, якщо потрібно.
zh_cn: 编写 GDScript 代码。测试脚本必须包含一个名叫 ``test()`` 的函数，不带任何参数。这个函数会由测试运行器调用。测试不应存在任何依赖项，除非依赖项本身也是测试的一部分。全局类（使用 ``class_name``\ ）是在运行器启动前注册的，所以需要时应该能够正常工作。
zh_tw: 撰寫 GDScript 程式碼。測試腳本需有一個無參數的 ``test()`` 函式，該函式將由測試運作器自動呼叫。測試不應有外部依賴，除非該依賴本身也是測試的一部分。全域類別（使用 ``class_name``）會在運作器啟動前註冊，因此可於測試內使用。

source: Here's an example test script:
ga: Seo script tástála sampla:
tr: İşte örnek bir test betik dosyası:
uk: Ось приклад тестового сценарію:
zh_cn: 这是一个测试脚本的示例：
zh_tw: 以下為範例測試腳本：

source: Change directory to the Godot source repository root.
ga: Athraigh eolaire go fréamh stór foinse Godot.
tr: Dizini Godot kaynak deposu kök dizinine değiştirin.
uk: Змініть каталог на кореневий каталог вихідного сховища Godot.
zh_cn: 切换到 Godot 源码仓库的根目录。
zh_tw: 切換目錄至 Godot 原始碼倉庫根目錄。

source: Generate ``*.out`` files to update the expected results from the output:
ga: Cruthaigh comhaid `*.out`` chun na torthaí a bhfuil súil leis ón aschur a nuashonrú:
tr: Çıktıdan beklenen sonuçları güncellemek için ``*.out`` dosyaları oluşturun:
uk: Згенеруйте файли ``*.out``, щоб оновити очікувані результати з виведення:
zh_cn: 生成 ``*.out`` 文件，更新期望输出的结果：
zh_tw: 產生 ``*.out`` 檔案以更新預期輸出結果：

source: You may add the ``--print-filenames`` option to see filenames as their test outputs are generated. If you are working on a new feature that is causing hard crashes, you can use this option to quickly find which test file causes the crash and debug from there.
ga: Féadfaidh tú an rogha ``--print-filenames`` a chur leis chun ainmneacha comhaid a fheiceáil de réir mar a ghintear a n-aschur tástála. Má tá tú ag obair ar ghné nua atá ina chúis le timpistí crua, is féidir leat an rogha seo a úsáid chun a fháil go tapa cén comhad tástála is cúis leis an timpiste agus dífhabhtú as sin.
tr: Test çıktıları oluşturulurken dosya adlarını görmek için ``--print-filenames`` seçeneğini ekleyebilirsiniz. Sert çökmelere neden olan yeni bir özellik üzerinde çalışıyorsanız, hangi test dosyasının çökmeye neden olduğunu hızlı bir şekilde bulmak ve hata ayıklamaya oradan başlamak için bu seçeneği kullanabilirsiniz.
uk: Ви можете додати опцію ``--print-filenames``, щоб бачити назви файлів під час генерації їхніх тестових результатів. Якщо ви працюєте над новою функцією, яка спричиняє серйозні збої, ви можете скористатися цією опцією, щоб швидко знайти, який тестовий файл спричинив збій, і налагодити з нього.
zh_cn: 你可以加上 ``--print-filenames`` 选项，查看生成测试输出时对应的文件名。如果你在开发新功能时造成了硬崩溃，就可以使用使用这个选项快速定位到造成崩溃的测试文件，从而开始调试。
zh_tw: 你可以加上 ``--print-filenames`` 選項來顯示產生測試輸出時的檔案名稱。若在開發新功能出現嚴重當機，可用此選項快速找出是哪個測試檔造成當機，方便後續偵錯。

source: Run GDScript tests with:
ga: Rith tástálacha GDScript le:
tr: GDScript testlerini şöyle çalıştırın:
uk: Запустіть тести GDScript за допомогою:
zh_cn: 运行 GDScript 测试：
zh_tw: 以以下指令執行 GDScript 測試：

source: This also accepts the ``--print-filenames`` option (see above).
ga: Glacann sé seo leis an rogha ``--print-filenames`` freisin (féach thuas).
tr: Bu aynı zamanda ``--print-filenames`` seçeneğini de kabul eder (yukarıya bakın).
uk: Це також приймає опцію ``--print-filenames`` (див. вище).
zh_cn: 此处也能够使用 ``--print-filenames`` 选项（见上文）。
zh_tw: 此指令同樣支援 ``--print-filenames`` 選項（見上文）。
