Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/unit_testing.po
Languages: ga, tr, uk, zh_cn, zh_tw

source: If no errors are printed and everything goes well, you're done!
ga: Mura gclóitear aon earráidí agus mura dtéann gach rud go maith, tá tú déanta!
tr: Herhangi bir hata yazdırılmazsa ve her şey yolunda giderse, işiniz tamamdır!
uk: Якщо помилки не друкуються і все йде добре, готово!
zh_cn: 如果没有打印错误并且一切顺利，那么就完成了！
zh_tw: 若未出現錯誤訊息且一切順利，代表測試完成！

source: Make sure the output does have the expected values before submitting a pull request. If ``--gdscript-generate-tests`` produces ``*.out`` files which are unrelated to newly added tests, you should revert those files back and only commit ``*.out`` files for new tests.
ga: Déan cinnte go bhfuil na luachanna a bhfuil súil leis ag an aschur sula gcuireann tú iarratas tarraingthe isteach. Má tháirgeann ``--gdscript-generate-tests`` comhaid ``*.out`` nach bhfuil baint acu le tástálacha nua-bhreise, ba cheart duit na comhaid sin a chur ar ais agus ní cheadtar ach comhaid ``*.out`` le haghaidh tástálacha nua.
tr: Bir çekme isteği göndermeden önce çıktının beklenen değerlere sahip olduğundan emin olun. Eğer ``--gdscript-generate-tests`` yeni eklenen testlerle ilgisi olmayan ``*.out`` dosyaları üretiyorsa, bu dosyaları geri almalı ve sadece yeni testler için ``*.out`` dosyalarını işlemelisiniz.
uk: Перш ніж надсилати запит на отримання, переконайтеся, що вихідні дані мають очікувані значення. Якщо ``--gdscript-generate-tests`` створює файли ``*.out``, які не пов’язані з щойно доданими тестами, вам слід повернути ці файли назад і зафіксувати лише файли ``*.out`` для нових тестів.
zh_cn: 在提交拉取请求之前，请确保输出确实具有预期值。如果 ``--gdscript-generate-tests`` 生成的 ``*.out`` 文件与新添加的测试无关，则应恢复这些文件并仅为新测试提交 ``*.out`` 文件。
zh_tw: 提交 pull request 前，請先確保輸出結果皆為預期值。若 ``--gdscript-generate-tests`` 產生的 ``*.out`` 檔與新測試無關，請勿提交，僅須提交與新測試相關的 ``*.out`` 檔案。

source: The GDScript test runner is meant for testing the GDScript implementation, not for testing user scripts nor testing the engine using scripts. We recommend writing new tests for already resolved `issues related to GDScript at GitHub <https://github.com/godotengine/godot/issues?q=is%3Aissue+label%3Atopic%3Agdscript+is%3Aclosed>`_, or writing tests for currently working features.
ga: Tá an rádala tástála GDScript ceaptha chun feidhmiú GDScript a thástáil, ní chun scripteanna úsáideora a thástáil ná chun an t-inneall a thástáil ag baint úsáide as scripteanna. Molaimid trialacha nua a scríobh le haghaidh `ceisteanna a bhaineann le GDScript réitithe cheana féin ag GitHub <https://github.com/godotengine/godot/issues?q=is%3Aissue+label%3Atopic%3Agdscript+is%3Aclosed>`_, nó tástálacha scríbhneoireachta le haghaidh gnéithe atá ag obair faoi láthair.
tr: GDScript test çalıştırıcısı, GDScript uyarlamasını test etmek içindir, kullanıcı betiklerini test etmek veya betikleri kullanarak motoru test etmek için değildir. GitHub`da halihazırda çözülmüş `GDScript ile ilgili sorunlar <https://github.com/godotengine/godot/issues?q=is%3Aissue+label%3Atopic%3Agdscript+is%3Aclosed>`_ için yeni testler yazmanızı veya şu anda çalışan özellikler için testler yazmanızı öneririz.
uk: Програма тестування GDScript призначена для тестування реалізації GDScript, а не для тестування користувальницьких сценаріїв або тестування механізму за допомогою сценаріїв. Ми рекомендуємо писати нові тести для вже вирішених `«проблем, пов’язаних із GDScript, на GitHub <https://github.com/godotengine/godot/issues?q=is%3Aissue+label%3Atopic%3Agdscript+is%3Aclosed>`_, або написання тестів для поточних працюючих функцій.
zh_cn: GDScript 测试运行器用于测试 GDScript 实现，而不是用于测试用户脚本或测试引擎使用脚本。我们建议为已解决的 `GitHub 上与 GDScript 相关的问题 <https://github.com/godotengine/godot/issues?q=is%3Aissue+label%3Atopic%3Agdscript+is%3Aclosed>`_\ 编写新测试，或为当前正在工作的功能编写测试。
zh_tw: GDScript 測試運作器僅用於測試 GDScript 實作本身，並非用來測試使用者腳本或透過腳本測試引擎本體。建議針對 GitHub 上已解決的 `GDScript 相關議題 <https://github.com/godotengine/godot/issues?q=is%3Aissue+label%3Atopic%3Agdscript+is%3Aclosed>`_ 撰寫新測試，或針對現有功能撰寫測試。

source: If your test case requires that there is no ``test()`` function present inside the script file, you can disable the runtime section of the test by naming the script file so that it matches the pattern ``*.notest.gd``. For example, "test_empty_file.notest.gd".
ga: Má éilíonn do chás tástála nach bhfuil aon fheidhm ``test () `i láthair taobh istigh den chomhad script, is féidir leat an chuid rith den tástáil a dhíchumasú tríd an gcomhad script a ainmniú ionas go n-oireann sé leis an bpatrún `*.notest.gd``. Mar shampla, “test_empty_file.notest.gd”.
tr: Test senaryonuz betik dosyası içinde ``test()`` işlevinin bulunmamasını gerektiriyorsa, kod dosyasını ``*.notest.gd`` kalıbıyla eşleşecek şekilde adlandırarak testin çalışma zamanı bölümünü devre dışı bırakabilirsiniz. Örneğin, "test_empty_file.notest.gd".
uk: Якщо ваш тест вимагає, щоб у файлі сценарію не було функції ``test()``, ви можете вимкнути розділ часу виконання тесту, назвавши файл сценарію так, щоб він відповідав шаблону ``*.notest.gd``. Наприклад, "test_empty_file.notest.gd".
zh_cn: 如果你的测试用例要求脚本文件中不存在 ``test()`` 函数，你可以通过命名脚本文件使其与模式 ``*.notest.gd`` 匹配来禁用测试的运行时部分。例如，“test_empty_file.notest.gd”。
zh_tw: 若你的測試案例需要腳本中不含 ``test()`` 函式，可將腳本命名為 ``*.notest.gd`` 來停用執行階段測試區段，例如：test_empty_file.notest.gd。

source: ``--test-suite``
ga: ``--trealamh tástála``

source: ``--test-case``
ga: ``--cás tástála``

source: ``--source-file``
ga: ``--comhad foinse``

source: ``-sf="*test_color*"``
ga: ``-SF ="*tástála_dath*"``

source: ``REQUIRE``
ga: ```RIACHTAN``
uk: ``ВИМАГАТИ``

source: ``REQUIRE_FALSE``
ga: ``RIACHTAN_BRÉAG``

source: ``CHECK``
ga: ``SEICEÁIL ``
uk: ``ПЕРЕВІРКА``

source: ``CHECK_FALSE``
ga: ``SEICEÁIL_BRÉAG``

source: ``WARN``
ga: ``RABHADH ``
uk: ``ПОПЕРЕДЖЕННЯ``

source: ``WARN_FALSE``
ga: ``RABHAD_BRÉAG``

source: ``MESSAGE``
ga: ``TEACHTAIREACHT ``
uk: ``ПОВІДОМЛЕННЯ``

source: ``FAIL_CHECK``
ga: ``FEACH_SEICEÁIL ``

source: ``FAIL``
ga: ```TEIP``
uk: ``НЕВДАЧА``

source: Godot Engine allows to write unit tests directly in C++. The engine integrates the `doctest <https://github.com/onqtam/doctest>`_ unit testing framework which gives ability to write test suites and test cases next to production code, but since the tests in Godot go through a different ``main`` entry point, the tests reside in a dedicated ``tests/`` directory instead, which is located at the root of the engine source code.
uk: Godot Engine дозволяє писати модульні тести безпосередньо на C++. Механізм інтегрує структуру модульного тестування `doctest <https://github.com/onqtam/doctest>`_, яка дає можливість писати набори тестів і тестові випадки поруч із робочим кодом, але оскільки тести в Godot проходять через інший ` `main`` точка входу, натомість тести знаходяться у спеціальному каталозі ``tests/``, який знаходиться в корені вихідного коду двигуна.

source: Test cases are created using ``TEST_CASE`` function-like macro. Each test case must have a brief description written in parentheses, optionally including custom tags which allow to filter the tests at run-time, such as ``[String]``, ``[Stress]`` etc.
uk: Тестові випадки створюються за допомогою макросу ``TEST_CASE``. Кожен тестовий випадок повинен мати короткий опис, написаний у дужках, за бажанням, включаючи спеціальні теги, які дозволяють фільтрувати тести під час виконання, наприклад ``[String]``, ``[Stress]`` тощо.

source: `doctest: Assertion macros <https://github.com/onqtam/doctest/blob/master/doc/markdown/assertions.md>`_.
uk: `doctest: Макроси твердження <https://github.com/onqtam/doctest/blob/master/doc/markdown/assertions.md>`_.

source: Different reporters can be chosen at run-time. For instance, here's how the output can be redirected to an XML file:
uk: Під час виконання можна вибрати різних репортерів. Наприклад, ось як вихідні дані можна перенаправити у файл XML:

source: `doctest: Logging macros <https://github.com/onqtam/doctest/blob/master/doc/markdown/logging.md>`_.
uk: `doctest: макроси журналювання <https://github.com/onqtam/doctest/blob/master/doc/markdown/logging.md>`_.
