Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/unit_testing.po
Languages: ga, tr, uk, zh_cn, zh_tw

source: Unit testing
ga: Tástáil aonaid
tr: Birim testleri
uk: Модульне тестування
zh_cn: 单元测试
zh_tw: 單元測試

source: Platform and target support
ga: Tacaíocht ardán agus spriocdhíoc
tr: Platform ve hedef desteği
uk: Платформа та цільова підтримка
zh_cn: 平台及目标支持
zh_tw: 平台與目標支援

source: C++ unit tests can be run on Linux, macOS, and Windows operating systems.
ga: Is féidir tástálacha aonaid C ++ a reáchtáil ar chórais oibriúcháin Linux, macOS, agus Windows.
tr: C++ birim testleri Linux, macOS ve Windows işletim sistemlerinde çalıştırılabilir.
uk: Модульні тести C++ можна запускати в операційних системах Linux, macOS і Windows.
zh_cn: C++ 单元测试可以在 Linux、macOS 和 Windows 操作系统上运行。
zh_tw: C++ 單元測試可在 Linux、macOS 與 Windows 作業系統上執行。

source: Tests can only be run with editor ``tools`` enabled, which means that export templates cannot be tested currently.
ga: Ní féidir tástálacha a reáchtáil ach le eagarthóir ``uirlis`` cumasaithe, rud a chiallaíonn nach féidir teimpléid easpórtála a thástáil faoi láthair.
tr: Testler yalnızca ``tools`` düzenleyici etkinken çalıştırılabilir, bu da dışa aktarma şablonlarının şu anda test edilemeyeceği anlamına gelir.
uk: Тести можна виконувати лише з увімкненими ``інструментами`` редактора, що означає, що шаблони експорту наразі не можна перевірити.
zh_cn: 测试只能在启用编辑器 ``tools`` 的情况下运行，这意味着目前无法测试导出模板。
zh_tw: 僅在啟用編輯器 ``tools`` 時才能執行測試，代表目前無法針對匯出範本進行測試。

source: Running tests
ga: Tástálacha reatha
tr: Testleri çalıştırma
uk: Запуск тестів
zh_cn: 运行测试
zh_tw: 執行測試

source: Before tests can be actually run, the engine must be compiled with the ``tests`` build option enabled (and any other build option you typically use), as the tests are not compiled as part of the engine by default:
ga: Sula féidir tástálacha a reáchtáil i ndáiríre, caithfear an t-inneall a thiomsú leis an rogha tógála `tástálacha 'cumasaithe (agus aon rogha tógála eile a úsáideann tú de ghnáth), toisc nach ndéantar na tástálacha a thiomsú mar chuid den inneall de réir réamhshocraithe:
tr: Testler gerçekten çalıştırılmadan önce, testler varsayılan olarak motorun bir parçası olarak derlenmediğinden, motor ``tests`` derleme seçeneği etkinleştirilerek (ve genellikle kullandığınız diğer derleme seçenekleriyle) derlenmelidir:
uk: Перш ніж можна буде фактично запустити тести, двигун має бути скомпільовано з увімкненою опцією збірки ``tests`` (і будь-якою іншою опцією збирання, яку ви зазвичай використовуєте), оскільки тести не скомпільовані як частина механізму за замовчуванням:
zh_cn: 在测试被实际运行之前，必须在启用 ``tests`` 构建选项（并使用你通常使用的任何其他构建选项）的情况下编译引擎，因为默认情况下测试不会作为引擎的一部分进行编译：
zh_tw: 在實際執行測試前，必須以啟用 ``tests`` 編譯選項（以及你慣用的其他選項）來編譯引擎，因為預設情況下測試不會納入引擎本身：

source: Once the build is done, run the tests with a ``--test`` command-line option:
ga: Nuair a bheidh an tógáil déanta, reáchtáil na tástálacha le rogha líne ordaithe ``--test``:
tr: Derleme tamamlandığında, testleri ``--test`` komut satırı seçeneği ile çalıştırın:
uk: Після завершення збірки запустіть тести за допомогою параметра командного рядка ``--test``:
zh_cn: 构建完成后，使用 ``--test`` 命令行选项运行测试：
zh_tw: 編譯完成後，使用 ``--test`` 命令列選項執行測試：

source: The test run can be configured with the various doctest-specific command-line options. To retrieve the full list of supported options, run the ``--test`` command with the ``--help`` option:
ga: Is féidir an rith tástála a chumrú leis na roghanna líne ordaithe éagsúla atá sonrach le doiciméad. Chun an liosta iomlán de na roghanna tacaithe a aisghabháil, reáchtáil an t-ordú ``--test`` leis an rogha ``--help``:
tr: Test çalıştırması, doctest'e özgü çeşitli komut satırı seçenekleriyle yapılandırılabilir. Desteklenen seçeneklerin tam listesini almak için ``--test`` komutunu ``--help`` seçeneğiyle birlikte çalıştırın:
uk: Тестовий запуск можна налаштувати за допомогою різних параметрів командного рядка doctest. Щоб отримати повний список підтримуваних опцій, запустіть команду ``--test`` з опцією ``--help``:
zh_cn: 可以使用各种 doctest 特定的命令行选项来配置测试运行。要检索受支持选项的完整列表，请使用 ``--help`` 选项运行 ``--test`` 命令：
zh_tw: 測試執行時可透過多種 doctest 專用命令列選項來設定。若要取得所有支援的選項，可在 ``--test`` 命令後加上 ``--help``：

source: Any other options and arguments after the ``--test`` command are treated as arguments for doctest.
ga: Déileáltar le haon roghanna agus argóintí eile tar éis an ordaithe ``--test`` mar argóintí do doctest.
tr: ``--test`` komutundan sonra gelen diğer seçenekler ve argümanlar doctest için argüman olarak değerlendirilir.
uk: Будь-які інші параметри та аргументи після команди ``--test`` розглядаються як аргументи для doctest.
zh_cn: ``--test`` 命令后的任何其他选项和参数都被视为 doctest 的参数。
zh_tw: ``--test`` 命令之後的所有選項與參數，都會作為 doctest 的參數。

source: Tests are compiled automatically if you use the ``dev_mode=yes`` SCons option. ``dev_mode=yes`` is recommended if you plan on contributing to the engine development as it will automatically treat compilation warnings as errors. The continuous integration system will fail if any compilation warnings are detected, so you should strive to fix all warnings before opening a pull request.
ga: Tiomsaítear tástálacha go huathoibríoch má úsáideann tú an rogha ``dev_mode=yes`` SCons. Moltar ``dev_mode=yes`` má tá sé ar intinn agat cur le forbairt an innill mar go ndéileálfaidh sé go huathoibríoch le rabhaidh tiomsaithe mar earráidí. Teipfidh ar an gcóras comhtháthaithe leanúnaigh má aimsítear aon rabhaidh tiomsaithe, mar sin ba chóir duit iarracht a dhéanamh gach rabhadh a shocrú sula n-osclaítear iarratas tarraingthe.
tr: Eğer ``dev_mode=yes`` SCons seçeneğini kullanırsanız testler otomatik olarak derlenir. Derleme uyarılarını otomatik olarak hata olarak değerlendireceğinden, motorun geliştirilmesine katkıda bulunmayı planlıyorsanız ``dev_mode=yes`` seçeneğini kullanmanız önerilir. Herhangi bir derleme uyarısı tespit edilirse sürekli entegrasyon sistemi başarısız olacaktır, bu nedenle bir çekme isteği açmadan önce tüm uyarıları düzeltmeye çalışmalısınız.
uk: Тести компілюються автоматично, якщо ви використовуєте параметр SCons ``dev_mode=yes``. ``dev_mode=yes`` рекомендується, якщо ви плануєте зробити внесок у розробку двигуна, оскільки він автоматично розглядатиме попередження компіляції як помилки. Система безперервної інтеграції вийде з ладу, якщо будуть виявлені будь-які попередження компіляції, тому ви повинні прагнути виправити всі попередження перед тим, як відкривати запит на отримання.
zh_cn: 如果你使用 ``dev_mode=yes`` SCons 选项，则测试会被自动编译。如果你计划为引擎开发做出贡献，建议使用 ``dev_mode=yes``\ ，因为它会自动将编译警告视为错误。如果检测到任何编译警告，持续集成系统将失败，因此你应该努力在打开拉取请求之前修复所有警告。
zh_tw: 如果你在 SCons 編譯時加上 ``dev_mode=yes``，測試會自動編譯。如果你有意貢獻引擎開發，建議使用 ``dev_mode=yes``，因為它會把編譯警告自動視為錯誤。持續整合（CI）系統偵測到任何警告都會讓檢查失敗，因此請於發送 pull request 前修正所有警告。

source: Filtering tests
ga: Tástálacha scagtha
tr: Testleri filtreleme
uk: Фільтрування тестів
zh_cn: 筛选测试
zh_tw: 篩選測試

source: By default, all tests are run if you don't supply any extra arguments after the ``--test`` command. But if you're writing new tests or would like to see the successful assertions output coming from those tests for debugging purposes, you can run the tests of interest with the various filtering options provided by doctest.
ga: De réir réamhshocraithe, reáchtáiltear gach tástáil mura soláthraíonn tú aon argóintí breise tar éis an ordaithe ``--- tástáil ``. Ach má tá tástálacha nua á scríobh agat nó más mian leat aschur na ndearbhú rathúla a fheiceáil ag teacht ó na tástálacha sin chun críocha dífhabhtaithe, is féidir leat na tástálacha spéise a reáchtáil leis na roghanna scagtha éagsúla a sholáthraíonn doctest.
tr: Varsayılan olarak, ``--test`` komutundan sonra herhangi bir ekstra argüman sağlamazsanız tüm testler çalıştırılır. Ancak yeni testler yazıyorsanız veya hata ayıklama amacıyla bu testlerden gelen başarılı onaylama (assert) çıktılarını görmek istiyorsanız, doctest tarafından sağlanan çeşitli filtreleme seçenekleriyle ilgilendiğiniz testleri çalıştırabilirsiniz.
uk: За замовчуванням усі тести виконуються, якщо ви не вказуєте жодних додаткових аргументів після команди ``--test``. Але якщо ви пишете нові тести або бажаєте побачити успішні висновки цих тестів для цілей налагодження, ви можете запустити цікаві тести з різними параметрами фільтрації, які надає doctest.
zh_cn: 默认情况下，如果你在 ``--test`` 命令后不提供任何额外参数，则所有测试都会运行。但是，如果你正在编写新测试，或者希望出于调试目的查看来自这些测试的成功断言输出，则可以使用 doctest 提供的各种过滤选项运行感兴趣的测试。
zh_tw: 預設狀況下，若在 ``--test`` 指令後未加任何參數，會執行所有測試。但若你正在撰寫新測試，或想針對特定測試進行偵錯並觀察其成功判斷提示輸出，可以搭配 doctest 提供的各種篩選選項來執行特定測試。

source: The wildcard syntax ``*`` is supported for matching any number of characters in test suites, test cases, and source file names:
ga: Tacaítear leis an gcomhréir cárta fiáin ``*`` chun aon líon carachtair a mheaitseáil i sraith tástála, cásanna tástála, agus ainmneacha comhaid foinse:
tr: Joker karakter ``*`` sözdizimi test paketleri, test senaryoları ve kaynak dosya adlarındaki herhangi bir sayıda karakteri eşleştirmek için desteklenir:
uk: Синтаксис символів підстановки ``*`` підтримується для відповідності будь-якої кількості символів у наборах тестів, тестових прикладах і назвах вихідних файлів:
zh_cn: 支持通配符语法 ``*`` 来匹配测试套件、测试用例和源文件名中的任意数量的字符：
zh_tw: 支援萬用字元 ``*`` 語法，可在測試組、測試案例、原始檔案名稱中配對任意字元：

source: **Filter options**
ga: ** Roghanna scagair**
tr: **Filtre seçenekleri**
uk: **Параметри фільтра**
zh_cn: **过滤选项**
zh_tw: **篩選選項**

source: **Shorthand**
ga: **Gearrthán**
tr: **Kısa yazım**
uk: **Стенографія**
zh_tw: **縮寫**

source: **Examples**
ga: **Samplaí**
tr: **Örnekler**
uk: **Приклади**
zh_tw: **範例**

source: For instance, to run only the ``String`` unit tests, run:
ga: Mar shampla, chun na tástálacha aonaid ``String ``a reáchtáil, reáchtáil:
tr: Örneğin, yalnızca ``String`` birim testlerini çalıştırmak için şunu çalıştırın:
uk: Наприклад, щоб запустити лише модульні тести ``String``, запустіть:
zh_cn: 例如，要仅运行 ``String`` 单元测试，请运行：
zh_tw: 例如，只執行 ``String`` 單元測試時，請執行：

source: Successful assertions output can be enabled with the ``--success`` (``-s``) option, and can be combined with any combination of filtering options above, for instance:
ga: Is féidir aschur dearbhaithe rathúla a chumasú leis an rogha ``--rath`` (`-s``), agus is féidir é a chomhcheangal le haon teaglaim de roghanna scagtha thuas, mar shampla:
tr: Başarılı onaylamalar çıktısı ``--success`` (``-s``) seçeneği ile etkinleştirilebilir ve yukarıdaki filtreleme seçeneklerinin herhangi bir kombinasyonu ile birleştirilebilir, örneğin :
uk: Успішний вихід тверджень можна ввімкнути за допомогою параметра ``--success`` (``-s``), і його можна поєднати з будь-якою комбінацією параметрів фільтрації вище, наприклад:
zh_cn: 可以使用 ``--success`` (``-s``) 选项启用成功断言输出，并且可以与上面的任意过滤选项组合使用，例如：
zh_tw: 可加上 ``--success``（縮寫 ``-s``）選項來顯示成功判斷提示的輸出，也可以與前述篩選選項組合，例如：

source: Specific tests can be skipped with corresponding ``-exclude`` options. As of now, some tests include random stress tests which take a while to execute. In order to skip those kind of tests, run the following command:
ga: Is féidir tástálacha sonracha a scipeáil le roghanna comhfhreagracha ``-eisiam`. Faoi láthair, tá tástálacha struis randamacha tá roinnt tástálacha struis a thógann sé tamall le cur i bhfeidhm D'fhonn na dtástálacha sin a scipeáil, reáchtáil an t-ordú seo a leanas:
tr: Belirli testler ilgili ``-exclude`` seçenekleri ile atlanabilir. Şu an itibariyle, bazı testler yürütülmesi biraz zaman alan rastgele stres testleri içermektedir. Bu tür testleri atlamak için aşağıdaki komutu çalıştırın:
uk: Певні тести можна пропустити за допомогою відповідних параметрів ``-exclude``. На даний момент деякі тести включають випадкові стрес-тести, виконання яких вимагає певного часу. Щоб пропустити такі тести, виконайте таку команду:
zh_cn: 可以使用相应的 ``-exclude`` 选项跳过特定测试。到目前为止，包括随机压力测试在内的一些测试需要执行一段时间。为了跳过这些类型的测试，请运行以下命令：
zh_tw: 可用對應的 ``-exclude`` 選項來略過特定測試。目前有部分測試屬於隨機壓力測試，執行時間較長。若要略過這些測試，可執行以下命令：

source: Writing tests
ga: Tástála scríbhneo
tr: Testleri yazma
uk: Написання контрольних робіт
zh_cn: 编写测试
zh_tw: 撰寫測試

source: Test suites represent C++ header files which must be included as part of the main test entry point in ``tests/test_main.cpp``. Most test suites are located directly under ``tests/`` directory.
ga: Léiríonn sraith tástála comhaid ceanntásc C ++ a chaithfear a chur san áireamh mar chuid den phríomhphointe iontrála tástála in ``tests/test_main.cpp``. Tá an chuid is mó de na sraith tástála suite go díreach faoi eolaire ``tástálacha/``.
tr: Test paketleri, ``tests/test_main.cpp`` içindeki ana test giriş noktasının bir parçası olarak dahil edilmesi gereken C++ başlık dosyalarını temsil eder. Çoğu test paketi doğrudan ``tests/`` dizini altında bulunur.
uk: Набори тестів представляють файли заголовків C++, які повинні бути включені як частина основної точки входу тесту в ``tests/test_main.cpp``. Більшість наборів тестів знаходяться безпосередньо в каталозі ``tests/``.
zh_cn: 测试套件代表 C++ 头文件，必须将其作为主测试入口点的一部分包含在 ``tests/test_main.cpp`` 中。大多数测试套件都直接位于 ``tests/`` 目录下。
zh_tw: 測試組對應 C++ 標頭檔（header），必須包含在主要測試進入點 ``tests/test_main.cpp`` 之中。大多數測試組直接放在 ``tests/`` 資料夾下。

source: All header files are prefixed with ``test_``, and this is a naming convention which the Godot build system relies on to detect tests throughout the engine.
ga: Tá `test_`` réamhshocraithe ar gach comhad ceanntásc, agus is coinbhinsiún ainmniúcháin é seo a mbraitheann córas tógála Godot air chun tástálacha a bhrath ar fud an innill.
tr: Tüm başlık dosyalarının başına ``test_`` eklenir ve bu, Godot derleme sisteminin motor boyunca testleri tespit etmek için kullandığı bir adlandırma kuralıdır.
uk: Усі файли заголовків мають префікс ``test_``, і це домовленість про найменування, на яку покладається система збірки Godot для виявлення тестів у системі.
zh_cn: 所有头文件都以 ``test_`` 为前缀，这是一个命名约定，Godot 构建系统将依赖于此来检测整个引擎的测试。
zh_tw: 所有測試標頭檔名稱都以 ``test_`` 為前綴，這是 Godot 編譯系統用來自動偵測引擎測試的命名慣例。

source: Here's a minimal working test suite with a single test case written:
ga: Seo sraith tástála oibre íosta le cás tástála amháin scríofa:
tr: İşte tek bir test senaryosu yazılmış minimal bir çalışan test paketi:
uk: Ось мінімальний робочий набір тестів з одним написаним тестом:
zh_cn: 这是一个最小的工作测试套件，其中只包含单个测试用例：
zh_tw: 以下是一個僅含一個測試案例的最基本測試組範例：

source: You can quickly generate new tests using the ``create_test.py`` script found in the ``tests/`` directory. This script automatically creates a new test file with the required boilerplate code in the appropriate location. It's also able to automatically include the new header in ``tests/test_main.cpp`` using invasive mode (``-i`` flag). To view usage instructions, run the script with the ``-h`` flag.
zh_tw: 你可以用 ``tests/`` 目錄下的 ``create_test.py`` 腳本快速產生新測試。這個腳本會在正確的位置自動建立含有必要模板程式碼的新測試檔案，也可用侵入式模式（``-i`` 參數）自動在 ``tests/test_main.cpp`` 加入新標頭檔。欲查看使用說明，請加上 ``-h`` 參數執行該腳本。

source: The ``tests/test_macros.h`` header encapsulates everything which is needed for writing C++ unit tests in Godot. It includes doctest assertion and logging macros such as ``CHECK`` as seen above, and of course the definitions for writing test cases themselves.
ga: Cuimsíonn an ceannteideal ``tests/test_macros.h`` gach rud atá riachtanach chun tástálacha aonaid C ++ a scríobh i Godot. Cuimsíonn sé macros dearbhú dochtástála agus logála mar ``CHECK`` mar a fheictear thuas, agus ar ndóigh na sainmhínithe maidir le cásanna tástála a scríobh féin.
tr: ``tests/test_macros.h`` başlığı Godot'ta C++ birim testleri yazmak için gerekli olan her şeyi kapsar. Yukarıda görüldüğü gibi ``CHECK`` gibi doctest onaylama ve günlükleme makrolarını ve tabii ki test senaryoların kendilerini yazmak için tanımları içerir.
uk: Заголовок tests/test_macros.h інкапсулює все, що потрібно для написання модульних тестів C++ у Godot. Він включає в себе doctest assertion і макроси журналювання, такі як ``CHECK``, як показано вище, і, звичайно, визначення для написання самих тестів.
zh_cn: ``tests/test_macros.h`` 头文件封装了在 Godot 中编写 C++ 单元测试所需的一切。它包括 doctest 断言和类似如上所述的 ``CHECK`` 等日志记录宏，当然还有用于编写测试用例本身的定义。
zh_tw: ``tests/test_macros.h`` 標頭檔包涵了在 Godot 撰寫 C++ 單元測試所需的一切，包括如上例的 doctest 判斷提示宏（如 ``CHECK``），以及撰寫測試案例所需的定義。

source: `tests/test_macros.h <https://github.com/godotengine/godot/blob/master/tests/test_macros.h>`_ source code for currently implemented macros and aliases for them.
ga: `tests/test_macros.h <https://github.com/godotenginine/godot/blob/master/tests/test_macros.h> `_ cód foinse do mhacraí agus ailiasanna atá curtha i bhfeidhm faoi láthair dóibh.
tr: `tests/test_macros.h <https://github.com/godotengine/godot/blob/master/tests/test_macros.h>`_ kaynak kodu, şu anki uyarlanmış makrolar ve bunların takma adları için.
uk: `tests/test_macros.h <https://github.com/godotengine/godot/blob/master/tests/test_macros.h>`_ вихідний код для поточних реалізованих макросів і псевдонімів для них.
zh_cn: 用于当前实现的宏及其别名的 `tests/test_macros.h <https://github.com/godotengine/godot/blob/master/tests/test_macros.h>`_ 源代码。
zh_tw: `tests/test_macros.h <https://github.com/godotengine/godot/blob/master/tests/test_macros.h>`_ 提供目前所有巨集與別名的原始碼。

source: Test cases are created using ``TEST_CASE`` function-like macro. Each test case must have a brief description written in parentheses, optionally including custom tags which allow to filter the tests at runtime, such as ``[String]``, ``[Stress]`` etc.
zh_tw: 測試案例需使用 ``TEST_CASE`` 類函式巨集建立。每個測試案例必須在括號內加上簡要描述，也可選擇性附加自訂標籤（如 ``[String]``、``[Stress]``），以便於執行時過濾測試。

source: Test cases are written in a dedicated namespace. This is not required, but allows to prevent naming collisions for when other static helper functions are written to accommodate the repeating testing procedures such as populating common test data for each test, or writing parameterized tests.
ga: Scríobhtar cásanna tástála in ainmspás tiomnaithe. Níl sé seo ag teastáil, ach ceadaíonn sé imbhuailtí ainmniúcháin a chosc nuair a scríobhtar feidhmeanna cúntóra statach eile chun freastal ar na nósanna imeachta ath-tástála, mar shampla sonraí tástála coitianta a líonadh le haghaidh gach tástála, nó tástálacha paraiméadaraithe a scríobh.
tr: Test senaryoları adanmış bir isim alanına yazılır. Bu gerekli değildir, ancak her test için ortak test verilerinin doldurulması veya parametrelendirilmiş testlerin yazılması gibi tekrar eden test prosedürlerine uyum sağlamak için diğer statik yardımcı işlevler yazıldığında adlandırma çakışmalarını önlemeye izin verir.
uk: Тестові випадки записуються у спеціальному просторі імен. Це не є обов’язковим, але дозволяє запобігти конфліктам іменування, коли інші статичні допоміжні функції написані для повторюваних процедур тестування, таких як заповнення загальних тестових даних для кожного тесту або написання параметризованих тестів.
zh_cn: 测试用例编写在专用的命名空间中。这不是必需的，但可以防止在编写其他静态帮助函数以适应重复测试程序（例如为每个测试填充通用测试数据或编写参数化测试）时发生命名冲突。
zh_tw: 建議將測試案例寫在專用命名空間內，雖然不是強制，但這樣能避免你為了重複測試流程（如共用測試資料、參數化測試等）編寫輔助函式時發生命名衝突。

source: Godot supports writing tests per C++ module. For instructions on how to write module tests, refer to :ref:`doc_custom_module_unit_tests`.
ga: Tacaíonn Godot le tástálacha scríbhneoireachta in aghaidh an mhodúil Le haghaidh treoracha maidir le conas tástálacha modúl a scríobh, féach u:ref: `doc_custom_module_unit_tests`.
tr: Godot, her C++ modülü için test yazmayı destekler. Modül testlerinin nasıl yazılacağına ilişkin talimatlar için :ref:`doc_custom_module_unit_tests` bölümüne bakın.
uk: Godot підтримує написання тестів для кожного модуля C++. Щоб отримати інструкції щодо написання модульних тестів, зверніться до :ref:`doc_custom_module_unit_tests`.
zh_cn: Godot 支持为每个 C++ 模块编写测试。有关如何编写模块测试的说明，请参阅 :ref:`doc_custom_module_unit_tests`\ 。
zh_tw: Godot 支援針對 C++ 模組撰寫測試。如何撰寫模組測試，請參考 :ref:`doc_custom_module_unit_tests`。

source: Subcases
zh_tw: 子案例

source: In situations where you have a common setup for several test cases with only slight variations, subcases can be very helpful. Here's an example:
zh_tw: 若多個測試案例僅有細微差異且共用大部分設定，可善用子案例（subcases）簡化程式碼。以下為範例：

source: Each ``SUBCASE`` causes the ``TEST_CASE`` to be executed from the beginning. Subcases can be nested to an arbitrary depth, but it is advised to limit nesting to no more than one level deep.
zh_tw: 每個 ``SUBCASE`` 都會讓 ``TEST_CASE`` 從頭開始執行。子案例可任意巢狀，但建議最多只巢狀一層。

source: Assertions
ga: Dearbhú
tr: Onaylamalar
uk: Твердження
zh_cn: 断言
zh_tw: 判斷提示

source: A list of all commonly used assertions used throughout the Godot tests, sorted by severity.
ga: Liosta de na dearbhú go léir a úsáidtear go coitianta le linn na dtástálacha Godot, a shórtáil de réir déine.
tr: Godot testleri boyunca yaygın olarak kullanılan tüm onaylamaların, önem derecesine göre sıralanmış bir listesi.
uk: Список усіх часто використовуваних тверджень, які використовуються в тестах Годо, відсортованих за ступенем тяжкості.
zh_cn: Godot 测试中常用的断言列表，按严格程度排序。
zh_tw: 以下為 Godot 測試常用的判斷提示，依嚴重性排序。

source: **Assertion**
ga: **Dearbhóth**
tr: **Onaylama**
uk: **Твердження**
zh_cn: **断言**
zh_tw: **判斷提示**

source: **Description**
ga: **Tuairisc**
tr: **Tanım**
uk: **Опис**
zh_cn: **描述**
zh_tw: **說明**

source: Test if condition holds true. Fails the entire test immediately if the condition does not hold true.
ga: Tástáil an bhfuil an coinníoll fíor. Teipeann ar an tástáil iomlán láithreach mura bhfuil an coinníoll fíor.
tr: Koşulun doğru olup olmadığını test edin. Koşul doğru değilse testin tamamı hemen başarısız olur.
uk: Перевірте, чи виконується умова. Відразу провалює весь тест, якщо умова не виконується.
zh_cn: 检查条件是否成立。如果条件不成立则会立即让整个测试失败。
zh_tw: 測試條件是否為真。若條件不成立，立即使整個測試失敗。

source: Test if condition does not hold true. Fails the entire test immediately if the condition holds true.
ga: Tástáil mura bhfuil an coinníoll fíor. Teipeann ar an tástáil iomlán láithreach má tá an coinníoll fíor.
tr: Koşulun doğru olmadığını test edin. Koşul doğruysa testin tamamı hemen başarısız olur.
uk: Перевірте, чи умова не виконується. Не проходить весь тест негайно, якщо умова виконується.
zh_cn: 检查条件是否不成立。如果条件成立则会立即让整个测试失败。
zh_tw: 測試條件是否為假。若條件成立，立即使整個測試失敗。

source: Test if condition holds true. Marks the test run as failing, but allow to run other assertions.
ga: Tástáil an bhfuil an coinníoll fíor. Marcálann sé an rith tástála mar theip, ach ligeann sé dearbhú eile a reáchtáil.
tr: Koşulun doğru olup olmadığını test edin. Test çalışmasını başarısız olarak işaretler, ancak diğer onaylamaların çalıştırılmasına izin verir.
uk: Перевірте, чи виконується умова. Позначає тестовий запуск як невдалий, але дозволяє виконувати інші твердження.
zh_cn: 检查条件是否成立。会将测试表示为失败，但允许运行其他断言。
zh_tw: 測試條件是否為真。若失敗會標記該測試為失敗，但仍繼續執行其他判斷提示。

source: Test if condition does not hold true. Marks the test run as failing, but allow to run other assertions.
ga: Tástáil mura bhfuil an coinníoll fíor. Marcálann sé an rith tástála mar theip, ach ligeann sé dearbhú eile a reáchtáil.
tr: Koşulun doğru olmadığını test edin. Test çalışmasını başarısız olarak işaretler, ancak diğer onaylamaların çalıştırılmasına izin verir.
uk: Перевірте, чи умова не виконується. Позначає тестовий запуск як невдалий, але дозволяє виконувати інші твердження.
zh_cn: 检查条件是否不成立。会将测试表示为失败，但允许运行其他断言。
zh_tw: 測試條件是否為假。若失敗會標記該測試為失敗，但仍繼續執行其他判斷提示。

source: Test if condition holds true. Does not fail the test under any circumstance, but logs a warning if something does not hold true.
ga: Tástáil an bhfuil an coinníoll fíor. Ní theipeann sé ar an tástáil faoi imthosca ar bith, ach logálann sé rabhadh mura bhfuil rud éigin fíor.
tr: Koşulun doğru olup olmadığını test eder. Hiçbir koşulda testi başarısızlığa uğratmaz, ancak bir şey doğru değilse bir uyarı günlüğü tutar.
uk: Перевірте, чи виконується умова. Не проходить тест за жодних обставин, але реєструє попередження, якщо щось не відповідає дійсності.
zh_cn: 检查条件是否成立。任何情况下都不会让测试失败，但是不成立时会记录一条警告。
zh_tw: 測試條件是否為真。不論條件如何都不會使測試失敗，但若條件不成立則會記錄警告訊息。
