Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/http_request_class.po
Languages: ga, ru, ta, uk, zh_tw

source: Making HTTP requests
ga: Iarrataí HTTP a dhéanamh
ru: Выполнение HTTP-запросов
ta: HTTP கோரிக்கைகளை உருவாக்குதல்
uk: Виконання HTTP-запитів
zh_tw: 發送 HTTP 請求

source: Why use HTTP?
ga: Cén fáth HTTP a úsáid?
ru: Для чего использовать HTTP?
ta: HTTP ஐ ஏன் பயன்படுத்த வேண்டும்?
uk: Навіщо використовувати HTTP?
zh_tw: 為什麼要用 HTTP？

source: `HTTP requests <https://developer.mozilla.org/en-US/docs/Web/HTTP>`_ are useful to communicate with web servers and other non-Godot programs.
ga: `Tá iarratais HTTP <https://developer.mozilla.org/en-US/docs/Web/HTTP>`_ úsáideach chun cumarsáid a dhéanamh le freastalaithe gréasáin agus le cláir eile nach cláir Godot iad.
ru: `HTTP-запросы <https://developer.mozilla.org/en-US/docs/Web/HTTP>`_ используются для взаимодействия с веб-серверами и программами вне Godot.
ta: `Http கோரிக்கைகள் <https://developer.mozilla.org/en-us/docs/web/http>` _ வலை சேவையகங்கள் மற்றும் பிற கண்ணி அல்லாத திட்டங்களுடன் தொடர்பு கொள்ள பயனுள்ளதாக இருக்கும்.
uk: `HTTP-запити <https://developer.mozilla.org/en-US/docs/Web/HTTP>`_ корисні для зв’язку з веб-серверами та іншими програмами, що не належать Godot.
zh_tw: `HTTP 請求 <https://developer.mozilla.org/en-US/docs/Web/HTTP>`_ 常用於與 Web 伺服器及其他非 Godot 程式溝通。

source: Compared to Godot's other networking features (like :ref:`High-level multiplayer <doc_high_level_multiplayer>`), HTTP requests have more overhead and take more time to get going, so they aren't suited for real-time communication, and aren't great to send lots of small updates as is common for multiplayer gameplay.
ga: I gcomparáid le gnéithe líonraithe eile Godot (cosúil le :ref:`Il-imreoir ardleibhéil <doc_high_level_multiplayer>`), bíonn níos mó lastuas ag iarratais HTTP agus tógann siad níos mó ama le tosú, mar sin níl siad feiliúnach do chumarsáid fíor-ama, agus níl' t iontach a sheoladh go leor de nuashonruithe beaga mar is coitianta do gameplay il.
ru: По сравнению с другими сетевыми функциями Godot (такими как :ref:`высокоуровневый мультиплеер <doc_high_level_multiplayer>`), HTTP-запросы создают большую нагрузку и требуют больше времени на выполнение. Поэтому они не подходят для коммуникации в реальном времени и неэффективны для частой отправки небольших обновлений, что типично для мультиплеерных игр.
ta: கோடோட்டின் பிற நெட்வொர்க்கிங் அம்சங்களுடன் ஒப்பிடும்போது (இது: குறிப்பு: `உயர்-நிலை மல்டிபிளேயர் <doc_high_level_multiplayer>`), HTTP கோரிக்கைகள் அதிக மேல்நிலை கொண்டவை மற்றும் செல்ல அதிக நேரம் எடுக்கும், எனவே அவை நிகழ்நேர தகவல்தொடர்புக்கு பொருந்தாது, மற்றும் அரங்கில் ' மல்டிபிளேயர் கேம் பிளேவுக்கு பொதுவானது போல நிறைய சிறிய புதுப்பிப்புகளை அனுப்புவது சிறந்தது.
uk: Порівняно з іншими мережевими функціями Godot (як-от :ref:`High-level multiplayer <doc_high_level_multiplayer>`), запити HTTP мають більше накладних витрат і потребують більше часу, тому вони не підходять для спілкування в реальному часі, і Не чудово надсилати багато невеликих оновлень, як це зазвичай буває в багатокористувацькій грі.
zh_tw: 相較於 Godot 其他網路功能（如 :ref:`高階多人連線 <doc_high_level_multiplayer>`），HTTP 請求有較多額外負擔、啟動較慢，因此不適合即時溝通，也不適合像多人遊戲那樣頻繁傳送小量資料。

source: HTTP, however, offers interoperability with external web resources and is great at sending and receiving large amounts of data, for example to transfer files like game assets. These assets can then be loaded using :ref:`runtime file loading and saving <doc_runtime_loading_and_saving>`.
ga: Tairgeann HTTP, áfach, idir-inoibritheacht le hacmhainní gréasáin seachtracha agus tá sé iontach ar mhéid mór sonraí a sheoladh agus a fháil, mar shampla chun comhaid a aistriú cosúil le sócmhainní cluiche. Is féidir na sócmhainní seo a lódáil ansin le :ref: `comhad ama rite á luchtú agus á shábháil <doc_runtime_loading_and_saving>`.
ru: HTTP, однако, обеспечивает взаимодействие с внешними веб-ресурсами и отлично подходит для передачи больших объёмов данных — например, для пересылки файлов вроде игровых ассетов. Эти ассеты затем можно загружать с помощью :ref:`загрузки и сохранения файлов во время выполнения <doc_runtime_loading_and_saving>`.
ta: இருப்பினும், HTTP வெளிப்புற வலை வளங்களுடன் இயங்குதளத்தை வழங்குகிறது மற்றும் பெரிய அளவிலான தரவை அனுப்புவதிலும் பெறுவதிலும் சிறந்தது, எடுத்துக்காட்டாக விளையாட்டு சொத்துக்கள் போன்ற கோப்புகளை மாற்ற. இந்த சொத்துக்களை பின்னர் பயன்படுத்தி ஏற்றலாம்: ref: `இயக்க நேர கோப்பு ஏற்றுதல் மற்றும் சேமித்தல் <doc_runtime_loading_and_saving>`.
uk: Проте HTTP забезпечує взаємодію із зовнішніми веб-ресурсами та чудово підходить для надсилання й отримання великих обсягів даних, наприклад для передачі файлів, як-от ігрових ресурсів. Потім ці ресурси можна завантажити за допомогою :ref:`runtime file loading and saving <doc_runtime_loading_and_saving>`.
zh_tw: 不過，HTTP 適合與外部 Web 資源互動，也很適合大量資料傳輸，例如交換遊戲素材檔。這些檔案可以再透過 :ref:`執行時檔案讀寫 <doc_runtime_loading_and_saving>` 載入。

source: So HTTP may be useful for your game's login system, lobby browser, to retrieve some information from the web or to download game assets.
ga: Mar sin d'fhéadfadh HTTP a bheith úsáideach do chóras logáil isteach do chluiche, do bhrabhsálaí stocaireachta, chun roinnt faisnéise a aisghabháil ón ngréasán nó chun sócmhainní cluiche a íoslódáil.
ru: Таким образом, HTTP может быть полезен для системы входа в игру, браузера лобби, получения данных из интернета или загрузки игровых ассетов.
ta: எனவே உங்கள் விளையாட்டின் உள்நுழைவு அமைப்பு, லாபி உலாவிக்கு, வலையிலிருந்து சில தகவல்களை மீட்டெடுக்க அல்லது விளையாட்டு சொத்துக்களைப் பதிவிறக்க HTTP பயனுள்ளதாக இருக்கும்.
uk: Таким чином, HTTP може бути корисним для системи входу у вашу гру, лобі-браузера, щоб отримати деяку інформацію з Інтернету або завантажити ресурси гри.
zh_tw: 因此，HTTP 特別適合用於遊戲的登入系統、大廳清單、獲取網路資料或下載遊戲素材。

source: This tutorial assumes some familiarity with Godot and the Godot Editor. Refer to the :ref:`Introduction <toc-learn-introduction>` and the :ref:`Step by step <toc-learn-step_by_step>` tutorial, especially its :ref:`Nodes and Scenes <doc_nodes_and_scenes>` and :ref:`Creating your first script <doc_scripting_first_script>` pages if needed.
ga: Glacann an rang teagaisc seo roinnt cur amach ar Godot agus an Eagarthóir Godot. Déan tagairt don :ref:`Réamhrá <toc-learn-introduction>` agus an :ref:`Céim ar chéim <toc-learn-step_by_step>`, go háirithe a :ref:`Nóid agus Radhairc <doc_nodes_and_scenes>` agus : ref: `Ag cruthú do chéad script <doc_scripting_first_script>` leathanaigh más gá.
ta: இந்த பயிற்சி கோடோட் மற்றும் கோடோட் எடிட்டருடன் சில பரிச்சயத்தை ஏற்றுக்கொள்கிறது. : Ref: `அறிமுகம் <toc-learn- அறிமுகம்>` மற்றும் the: ref: `படி படி <toc-learn-tep_by_step>` டுடோரியல், குறிப்பாக அதன்: குறிப்பு: `முனைகள் மற்றும் காட்சிகள் <doc_nodes_and_scenes>` மற்றும்: குறிப்பு: `உங்கள் முதல் ச்கிரிப்டை உருவாக்குதல் <doc_scripting_first_script>` தேவைப்பட்டால் பக்கங்கள்.

source: HTTP requests in Godot
ga: Iarrataí HTTP i Godot
ru: HTTP запросы в Godot
ta: கோடோட்டில் HTTP கோரிக்கைகள்
uk: HTTP запити в Godot
zh_tw: Godot 裡的 HTTP 請求

source: The :ref:`HTTPRequest <class_HTTPRequest>` node is the easiest way to make HTTP requests in Godot. It is backed by the more low-level :ref:`HTTPClient <class_HTTPClient>`, for which a tutorial is available :ref:`here <doc_http_client_class>`.
ga: Is é an nód :ref:`HTTPRequest <class_HTTPRequest>` an bealach is éasca chun iarratais HTTP a dhéanamh in Godot. Faigheann sé tacaíocht ón :ref:`HTTPClient <class_HTTPClient>`, a bhfuil rang teagaisc ar fáil dó :ref:`anseo <doc_http_client_class>`.
ru: Узел :ref:`HTTPRequest <class_HTTPRequest>` — самый простой способ выполнять HTTP-запросы в Godot. Он работает на базе более низкоуровневого :ref:`HTTPClient <class_HTTPClient>`, для которого есть отдельное руководство :ref:`здесь <doc_http_client_class>`.
ta: தி: ref: `httprequest <class_httprequest>` கோடோட்டில் HTTP கோரிக்கைகளைச் செய்வதற்கான எளிதான வழி முனை. இது மிகவும் குறைந்த-நிலை: ref: `httpclient <class_httpclient>`, இதற்காக ஒரு பயிற்சி கிடைக்கிறது: குறிப்பு: `இங்கே <doc_http_client_class>`.
uk: Робити HTTP-запити в Godot найпростіше за допомогою вузла :ref:`HTTPRequest <class_HTTPRequest>`. Він підтримується класом більш низького рівня :ref:`HTTPClient <class_HTTPClient>`, про який є стаття :ref:`тут <doc_http_client_class>`.
zh_tw: Godot 最簡單的 HTTP 請求方式是使用 :ref:`HTTPRequest <class_HTTPRequest>` 節點。底層則有 :ref:`HTTPClient <class_HTTPClient>` 類可用，相關教學可參考 :ref:`這裡 <doc_http_client_class>`。

source: For this example, we will make an HTTP request to GitHub to retrieve the name of the latest Godot release.
ga: Maidir leis an sampla seo, déanfaimid iarratas HTTP chuig GitHub chun ainm an eisiúint Godot is déanaí a aisghabháil.
ru: В этом примере мы выполним HTTP-запрос к GitHub, чтобы узнать название последнего релиза Godot.
ta: இந்த எடுத்துக்காட்டுக்கு, அண்மைக் கால கோடோட் வெளியீட்டின் பெயரை மீட்டெடுக்க Github க்கு ஒரு HTTP கோரிக்கையை நாங்கள் செய்வோம்.
uk: Для цього прикладу ми зробимо HTTP-запит до GitHub, щоб отримати назву останнього випуску Godot.
zh_tw: 以下範例將向 GitHub 發送 HTTP 請求，取得最新 Godot 版本名稱。

source: When exporting to **Android**, make sure to enable the **Internet** permission in the Android export preset before exporting the project or using one-click deploy. Otherwise, network communication of any kind will be blocked by the Android OS.
ga: Agus tú ag onnmhairiú chuig **Android**, déan cinnte an cead**Idirlíon** a chumasú i réamhshocrú onnmhairiúcháin Android sula n-onnmhairigh an tionscadal nó úsáidte imscaradh Seachas sin, cuirfidh an Android OS bac ar chumarsáid líonra de chineál ar bith.
ru: При экспорте под **Android** обязательно включите разрешение **Интернет** в пресете экспорта Android до экспорта проекта или использования развертывания в один клик. Иначе любые сетевые коммуникации будут заблокированы ОС Android.
ta: ** ஆண்ட்ராய்டு ** க்கு ஏற்றுமதி செய்யும் போது, திட்டத்தை ஏற்றுமதி செய்வதற்கு முன் அல்லது ஒரு சொடுக்கு வரிசைப்படுத்தலைப் பயன்படுத்துவதற்கு முன்பு ஆண்ட்ராய்டு ஏற்றுமதி முன்னமைவில் ** இணையம் ** அனுமதியை இயக்குவதை உறுதிசெய்க. இல்லையெனில், எந்தவொரு பிணையம் தகவல்தொடர்பு ஆண்ட்ராய்டு OS ஆல் தடுக்கப்படும்.
uk: Під час експорту в **Android** обов’язково ввімкніть дозвіл **Інтернет** у попередньому налаштуванні експорту Android перед експортом проекту або використанням розгортання в один клік. Інакше будь-який мережевий зв’язок буде заблоковано ОС Android.
zh_tw: 匯出至 **Android** 時，請在專案匯出設定裡啟用 **Internet** 權限，否則任何網路傳輸都會被 Android 系統阻擋。

source: Preparing the scene
ga: An radharc a ullmhú
ru: Подготовка сцены
ta: காட்சியைத் தயாரித்தல்
uk: Підготовка сцени
zh_tw: 場景準備

source: Create a new empty scene, add a root :ref:`Node <class_Node>` and add a script to it. Then add an :ref:`HTTPRequest <class_HTTPRequest>` node as a child.
ga: Cruthaigh radharc folamh nua, cuir fréamh :ref:`Nód <class_Node>` agus cuir script leis. Ansin cuir nód :ref:`HTTPRequest <class_HTTPRequest>' leis mar leanbh.
ru: Создайте новую пустую сцену, добавьте корневой узел :ref:`Node <class_Node>` и присоедините к нему скрипт. Затем добавьте дочерний узел :ref:`HTTPRequest <class_HTTPRequest>`.
ta: ஒரு புதிய வெற்று காட்சியை உருவாக்கி, ஒரு வேரைச் சேர்க்கவும்: குறிப்பு: `முனை <class_node>` மற்றும் அதில் ஒரு ச்கிரிப்டைச் சேர்க்கவும். பின்னர் ஒரு: ref: `httprequest <class_httprequest>` ஒரு குழந்தையாக முனை சேர்க்கவும்.
uk: Створіть нову порожню сцену, додайте кореневий :ref:`Node <class_Node>` і додайте до нього сценарій. Потім додайте вузол :ref:`HTTPRequest <class_HTTPRequest>` як дочірній.
zh_tw: 建立新空場景，新增一個 :ref:`Node <class_Node>` 當根節點並掛上腳本，再加一個 :ref:`HTTPRequest <class_HTTPRequest>` 節點作為子節點。

source: Scripting the request
ga: An iarratas a scríobh
ru: Написание запроса
ta: கோரிக்கையை ச்கிரிப்ட் செய்தல்
uk: Створення сценарію запиту
zh_tw: 撰寫請求腳本

source: When the project is started (so in ``_ready()``), we're going to send an HTTP request to Github using our :ref:`HTTPRequest <class_HTTPRequest>` node, and once the request completes, we're going to parse the returned JSON data, look for the ``name`` field and print that to console.
ga: Nuair a bheidh an tionscadal tosaithe (mar sin in `` _réidh()``), táimid chun iarratas HTTP a sheoladh chuig Github ag baint úsáide as ár nód :ref:`HTTPRequest <class_HTTPRequest>`, agus nuair a bheidh an t-iarratas críochnaithe, táimid ag dul a pharsáil na sonraí JSON a tugadh ar ais, lorg an réimse ``name`` agus priontáil é sin le consól.
ru: При запуске проекта (в методе ``_ready()``) мы отправим HTTP-запрос к GitHub через наш узел :ref:`HTTPRequest <class_HTTPRequest>`. После завершения запроса мы обработаем полученные JSON-данные, найдём поле ``name`` и выведем его значение в консоль.
ta: திட்டம் தொடங்கப்படும் போது (எனவே `` _ready () ``), எங்கள்: ref: `httprequest <class_httprequest>` முனை, மற்றும் கோரிக்கை முடிந்ததும், நாங்கள் ஒரு HTTP கோரிக்கையை அனுப்பப் போகிறோம் திரும்பிய சாதொபொகு தரவை அலசப் போகிறது, `` பெயர்` `புலத்தைத் தேடி, அதை ஆறுதலளிக்க அச்சிடுங்கள்.
uk: Коли проект розпочато (тобто в ``_ready()``), ми надішлемо HTTP-запит до Github за допомогою нашого вузла :ref:`HTTPRequest <class_HTTPRequest>`, і після завершення запиту ми щоб розібрати отримані дані JSON, знайдіть поле ``name`` і виведіть його на консоль.
zh_tw: 啟動專案時（即 ``_ready()`` 階段），將透過 :ref:`HTTPRequest <class_HTTPRequest>` 節點向 Github 發送 HTTP 請求。完成後會解析回傳的 JSON 資料，尋找 ``name`` 欄位並印出至主控台。

source: Save the script and the scene, and run the project. The name of the most recent Godot release on Github should be printed to the output log. For more information on parsing JSON, see the class references for :ref:`JSON <class_JSON>`.
ga: Sábháil an script agus an radharc, agus rith an tionscadal. Ba cheart ainm an scaoileadh Godot is déanaí ar Github a phriontáil ar an loga aschuir. Le haghaidh tuilleadh eolais ar JSON a pharsáil, féach na tagairtí ranga le haghaidh :ref:`JSON <class_JSON>`.
ru: Сохраните скрипт и сцену, затем запустите проект. В выходном логе должно отобразиться название последнего релиза Godot на GitHub. Подробнее о работе с JSON см. в документации класса :ref:`JSON <class_JSON>`.
ta: ச்கிரிப்ட் மற்றும் காட்சியைச் சேமித்து, திட்டத்தை இயக்கவும். கிட்அப்பில் மிக அண்மைக் கால கோடோட் வெளியீட்டின் பெயர் வெளியீட்டு பதிவுக்கு அச்சிடப்பட வேண்டும். சாதொபொகு ஐ பாகுபடுத்துவது பற்றிய கூடுதல் தகவலுக்கு, வகுப்பு குறிப்புகளைப் பார்க்கவும்: ref: `json <class_json>`.
uk: Збережіть сценарій і сцену та запустіть проект. Назва останнього випуску Godot на Github має бути надрукована в журналі виводу. Щоб отримати додаткові відомості про аналіз JSON, перегляньте посилання на класи для :ref:`JSON <class_JSON>`.
zh_tw: 儲存腳本與場景，執行專案後，Github 上最新的 Godot 發行名稱會輸出至訊息紀錄。如需解析 JSON 請參考 :ref:`JSON <class_JSON>` 的說明文件。

source: Note that you may want to check whether the ``result`` equals ``RESULT_SUCCESS`` and whether a JSON parsing error occurred, see the JSON class reference and :ref:`HTTPRequest <class_HTTPRequest>` for more.
ga: Tabhair faoi deara go mb'fhéidir gur mhaith leat a sheiceáil cibé an ionann an ``toradh`` agus ``RESULT_SUCCESS`` agus cibé ar tharla earráid pharsála JSON, féach tagairt ranga JSON agus :ref:`HTTPRequest <class_HTTPRequest>` le haghaidh tuilleadh.
ru: Обратите внимание: стоит проверить, равен ли ``result`` значению ``RESULT_SUCCESS``, а также отсутствие ошибок парсинга JSON. Подробнее см. в документации класса JSON и :ref:`HTTPRequest <class_HTTPRequest>`.
ta: `` முடிவு`` `` fully_success`` க்கு சமமானதா என்பதையும், சாதொபொகு பாகுபடுத்தும் பிழை ஏற்பட்டதா என்பதை நீங்கள் சரிபார்க்க விரும்பலாம் என்பதை நினைவில் கொள்க, சாதொபொகு வகுப்பு குறிப்பைக் காண்க: குறிப்பு: `httprequest <class_httprequest>` மேலும்.
uk: Зауважте, що ви можете перевірити, чи ``result`` дорівнює ``RESULT_SUCCESS``, і чи не сталася помилка аналізу JSON, дивіться посилання на клас JSON і :ref:`HTTPRequest <class_HTTPRequest>`, щоб дізнатися більше.
zh_tw: 請注意，建議檢查 ``result`` 是否等於 ``RESULT_SUCCESS`` 以及 JSON 是否有解析錯誤。更多細節請參閱 JSON class reference 和 :ref:`HTTPRequest <class_HTTPRequest>` 文件。

source: You have to wait for a request to finish before sending another one. Making multiple request at once requires you to have one node per request. A common strategy is to create and delete HTTPRequest nodes at runtime as necessary.
ga: Caithfidh tú fanacht go gcríochnóidh iarratas sula seoltar ceann eile. Éilíonn iarratas iolrach a dhéanamh ag an am céanna go mbeidh nód amháin agat in aghaidh an iarratais. Is straitéis choiteann ná nóid HttpRequest a chruthú agus a scriosadh ag am rith de réir mar is gá.
ru: Необходимо дождаться завершения запроса перед отправкой следующего. Для одновременных запросов потребуется отдельный узел на каждый запрос. Стандартная практика — создавать и удалять узлы HTTPRequest во время выполнения по мере необходимости.
ta: இன்னொன்றை அனுப்புவதற்கு முன்பு ஒரு கோரிக்கை முடிக்க நீங்கள் காத்திருக்க வேண்டும். ஒரே நேரத்தில் பல கோரிக்கையை மேற்கொள்வது உங்களுக்கு ஒரு கோரிக்கைக்கு ஒரு முனை இருக்க வேண்டும். ஒரு பொதுவான உத்தி என்னவென்றால், தேவையான அளவு இயக்க நேரத்தில் Httprequest முனைகளை உருவாக்கி நீக்குவது.
uk: Ви повинні дочекатися завершення запиту, перш ніж надсилати інший. Щоб зробити декілька запитів одночасно, потрібно мати один вузол на запит. Загальною стратегією є створення та видалення вузлів HTTPRequest під час виконання, якщо це необхідно.
zh_tw: 你必須等一個請求處理完才能發送下一個。若要同時送多個請求，每個請求都需一個 HTTPRequest 節點。一般做法是根據需求在執行時動態建立與刪除 HTTPRequest 節點。

source: Sending data to the server
ga: Sonraí a sheoladh chuig an freastalaí
ru: Отправка данных на сервер
ta: சேவையகத்திற்கு தரவை அனுப்புகிறது
uk: Відправка даних на сервер
zh_tw: 傳送資料到伺服器

source: Until now, we have limited ourselves to requesting data from a server. But what if you need to send data to the server? Here is a common way of doing it:
ga: Go dtí seo, tá teorainn againn féin chun sonraí a iarraidh ó fhreastalaí. Ach cad má theastaíonn uait sonraí a sheoladh chuig an bhfreastalaí? Seo bealach coitianta chun é a dhéanamh:
ru: До сих пор мы ограничивались запросом данных с сервера. Но что, если вам нужно отправить данные на сервер? Вот общий способ сделать это:
ta: இப்போது வரை, ஒரு சேவையகத்திலிருந்து தரவைக் கோருவதற்கு நாங்கள் மட்டுப்படுத்தப்பட்டிருக்கிறோம். ஆனால் நீங்கள் சேவையகத்திற்கு தரவை அனுப்ப வேண்டும் என்றால் என்ன செய்வது? இதைச் செய்வதற்கான பொதுவான வழி இங்கே:
uk: Досі ми обмежувалися запитом даних із сервера. Але що робити, якщо потрібно відправити дані на сервер? Ось загальний спосіб зробити це:
zh_tw: 前面只介紹了從伺服器取得資料。若要傳資料到伺服器，可以這樣做：

source: Setting custom HTTP headers
ga: Ceanntásca saincheaptha HTTP a shocrú
ru: Настройка собственных HTTP заголовков
ta: தனிப்பயன் HTTP தலைப்புகளை அமைத்தல்
uk: Встановлення спеціальних заголовків HTTP
zh_tw: 自訂 HTTP 標頭

source: Of course, you can also set custom HTTP headers. These are given as a string array, with each string containing a header in the format ``"header: value"``. For example, to set a custom user agent (the HTTP ``User-Agent`` header) you could use the following:
ga: Ar ndóigh, is féidir leat ceanntásca saincheaptha HTTP a shocrú freisin. Tugtar iad seo mar eagar teaghrán, agus tá ceannteideal sa fhormáid ``"ceannteideal: luach"`` i ngach teaghrán. Mar shampla, chun gníomhaire úsáideora saincheaptha a shocrú (an ceannteideal HTTP ``User-Agent ``) d'fhéadfá an méid seo a leanas a úsáid:
ru: Конечно, вы также можете задавать собственные HTTP-заголовки. Они передаются в виде массива строк, где каждая строка содержит заголовок в формате ``"заголовок: значение"``. Например, для установки пользовательского агента (HTTP-заголовок ``User-Agent``) можно использовать следующий код:
ta: நிச்சயமாக, நீங்கள் தனிப்பயன் HTTP தலைப்புகளையும் அமைக்கலாம். இவை ஒரு சரம் வரிசையாக வழங்கப்படுகின்றன, ஒவ்வொரு சரமும் `` "தலைப்பு: மதிப்பு" வடிவத்தில் ஒரு தலைப்பைக் கொண்டிருக்கும். எடுத்துக்காட்டாக, தனிப்பயன் பயனர் முகவரை அமைக்க (HTTP `` பயனர்-முகவர்` தலைப்பு) நீங்கள் பின்வருவனவற்றைப் பயன்படுத்தலாம்:
uk: Звичайно, ви також можете встановити власні заголовки HTTP. Вони подані у вигляді масиву рядків, причому кожен рядок містить заголовок у форматі «заголовок: значення». Наприклад, щоб встановити спеціальний агент користувача (заголовок HTTP ``User-Agent``), ви можете використати таке:
zh_tw: 你也可以設定自訂 HTTP 標頭，只要傳入字串陣列，每個字串格式為 ``"header: value"``。例如，要自訂 User-Agent（HTTP 的 ``User-Agent`` 標頭），可以這樣：

source: Be aware that someone might analyse and decompile your released application and thus may gain access to any embedded authorization information like tokens, usernames or passwords. That means it is usually not a good idea to embed things such as database access credentials inside your game. Avoid providing information useful to an attacker whenever possible.
ga: Bí ar an eolas go bhféadfadh duine d'fheidhmchlár scaoilte a anailísiú agus a dhíchumasú agus dá bhrí sin d'fhéadfadh sé rochtain a fháil ar aon fhaisnéis údaraithe leabaithe cosúil le Ciallaíonn sé sin nach smaoineamh maith de ghnáth rudaí mar dhintiúir rochtana bunachar sonraí a leabú taobh istigh de do chluiche. Seachain faisnéis úsáideach a sholáthar d'ionsaitheoir nuair is féidir.
ru: Важно понимать злоумышленники могут проанализировать и декомпилировать ваше опубликованное приложение! Так они смогут получить доступ к авторизационным данным — токенам, логинам или паролям. Поэтому настоятельно не рекомендуется хранить в игре критически важную информацию, например учётные данные для доступа к базе данных. По возможности избегайте хранения любой информации, которая может быть полезна атакующему.
ta: நீங்கள் வெளியிட்ட பயன்பாட்டை யாராவது பகுப்பாய்வு செய்து சிதைக்கக்கூடும் என்பதை அறிந்து கொள்ளுங்கள், இதனால் டோக்கன்கள், பயனர்பெயர்கள் அல்லது கடவுச்சொற்கள் போன்ற உட்பொதிக்கப்பட்ட அங்கீகார தகவல்களுக்கான அணுகலைப் பெறலாம். அதாவது, உங்கள் விளையாட்டுக்குள் தரவுத்தள அணுகல் நற்சான்றிதழ்கள் போன்றவற்றை உட்பொதிப்பது பொதுவாக நல்ல யோசனையல்ல. தாக்குபவருக்கு பயனுள்ள தகவல்களை முடிந்தவரை வழங்குவதைத் தவிர்க்கவும்.
uk: Майте на увазі, що хтось може проаналізувати та декомпілювати вашу випущену програму та таким чином отримати доступ до будь-якої вбудованої інформації авторизації, як-от маркерів, імен користувачів або паролів. Це означає, що зазвичай не варто вбудовувати в гру такі речі, як облікові дані доступу до бази даних. Уникайте надання інформації, корисної для зловмисника, коли це можливо.
zh_tw: 請注意，任何人都可能分析、反編譯你的遊戲，取得嵌入的授權資訊（如 token、帳號、密碼等）。所以千萬不要將資料庫等敏感憑證放進遊戲中，也盡量避免提供任何對攻擊者有用的資訊。
