Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/ssl_certificates.po
Languages: de, it, ru, ta, uk, zh_hant

source: SSL/TLS certificates
de: SSL/TLS-Zertifikate

source: Introduction
de: Einführung
it: Introduzione
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_hant: 前言

source: It is often desired to use :abbr:`SSL (Secure Sockets Layer)` connections (also known as :abbr:`TLS (Transport Layer Security)` connections) for communications to avoid "man in the middle" attacks. Godot has a connection wrapper, :ref:`StreamPeerTLS <class_StreamPeerTLS>`, which can take a regular connection and add security around it. The :ref:`HTTPClient <class_HTTPClient>` and :ref:`HTTPRequest <class_HTTPRequest>` classes also support HTTPS using this same wrapper.
de: Es ist oft erwünscht, :abbr:`SSL (Secure Sockets Layer)`-Verbindungen (auch bekannt als :abbr:`TLS (Transport Layer Security)`-Verbindungen) für die Kommunikation zu verwenden, um "Man in the Middle"-Angriffe zu vermeiden. Godot verfügt über einen Verbindungs-Wrapper, :ref:`StreamPeerTLS <class_StreamPeerTLS>`, der eine reguläre Verbindung mit zusätzlichen Sicherheitsfunktionen versehen kann. Die Klassen :ref:`HTTPClient <class_HTTPClient>` und :ref:`HTTPRequest <class_HTTPRequest>` unterstützen ebenfalls HTTPS unter Verwendung dieses Wrappers.

source: Godot includes the `SSL certificate bundle from Mozilla <https://github.com/godotengine/godot/blob/master/thirdparty/certs/ca-certificates.crt>`__, but you can provide your own with a CRT file in the Project Settings:
de: Godot enthält das `SSL-Zertifikatspaket von Mozilla <https://github.com/godotengine/godot/blob/master/thirdparty/certs/ca-certificates.crt>`__, aber Sie können Ihr eigenes mit einer CRT-Datei in den Projekteinstellungen bereitstellen:

source: Setting the TLS certificate bundle override project setting
de: Einstellung des TLS-Zertifikat-Bundles überschreibt die Projekteinstellung
ru: Переопределение набора TLS-сертификатов через настройки проекта
ta: டி.எல்.எச் சான்றிதழ் மூட்டை மேலெழுதும் திட்ட அமைப்பை அமைத்தல்
uk: Налаштування пакета сертифікатів TLS перевизначає налаштування проекту
zh_hant: 設定 TLS 憑證包覆蓋專案選項

source: When set, this file *overrides* the Mozilla certificate bundle Godot uses by default. This file should contain any number of public certificates in `PEM format <https://en.wikipedia.org/wiki/Privacy-enhanced_Electronic_Mail>`__.
de: Wenn diese Datei gesetzt ist, *überschreibt* sie das Mozilla-Zertifikat-Bundle, das Godot standardmäßig verwendet. Diese Datei sollte eine beliebige Anzahl von öffentlichen Zertifikaten im `PEM-Format <https://en.wikipedia.org/wiki/Privacy-enhanced_Electronic_Mail>`__ enthalten.

source: Remember to add ``*.crt`` as the non-resource export filter to your export preset, so that the exporter recognizes this when exporting your project:
de: Denken Sie daran, ``*.crt`` als Nicht-Ressourcen-Exportfilter zu Ihrer Exportvorgabe hinzuzufügen, damit der Exporter dies beim Exportieren Ihres Projekts erkennt:

source: Adding ``*.crt`` to non-resource export filter in the export preset
de: Hinzufügen von ``*.crt`` zum Nicht-Ressourcen-Exportfilter in der Exportvorgabe

source: There are two ways to obtain certificates:
de: Es gibt zwei Wege Zertifikate zu erhalten:
it: Ci sono due modi per ottenere i certificati:
ru: Существует два способа получить сертификаты:
ta: சான்றிதழ்களைப் பெற இரண்டு வழிகள் உள்ளன:
uk: Є два способи отримати сертифікати:
zh_hant: 獲取憑證有兩種方式：

source: Acquire a certificate from a certificate authority
de: Erwerben Sie ein Zertifikat von einer Zertifizierungsstelle

source: The main approach to getting a certificate is to use a certificate authority (CA) such as `Let's Encrypt <https://letsencrypt.org/>`__. This is a more cumbersome process than a self-signed certificate, but it's more "official" and ensures your identity is clearly represented. The resulting certificate is also trusted by applications such as web browsers, unlike a self-signed certificate which requires additional configuration on the client side before it's considered trusted.
de: Die übliche Methode, um ein Zertifikat zu erhalten, ist die Verwendung einer Zertifizierungsstelle (certificate authority, CA) wie `Let's Encrypt <https://letsencrypt.org/>`__. Dies ist ein umständlicheres Verfahren als ein selbstsigniertes Zertifikat, aber es ist "offizieller" und stellt sicher, dass Ihre Identität eindeutig dargestellt wird. Das resultierende Zertifikat wird auch von Anwendungen wie Webbrowsern als vertrauenswürdig eingestuft, im Gegensatz zu einem selbstsignierten Zertifikat, das eine zusätzliche Konfiguration auf der Client-Seite erfordert, bevor es als vertrauenswürdig eingestuft wird.
it: L'approccio principale per ottenere un certificato è utilizzare un'autorità di certificazione (CA) come `Let's Encrypt <https://letsencrypt.org/>`__. È un processo più macchinoso rispetto a un certificato auto-firmato, ma è più "ufficiale" e garantisce che la propria identità sia chiaramente rappresentata. Il certificato risultante è inoltre considerato attendibile da applicazioni come i browser web, a differenza di un certificato auto-firmato che richiede una configurazione aggiuntiva lato client prima di essere considerato attendibile.
ru: Основной способ получения сертификата — обратиться в центр сертификации (CA), например `Let's Encrypt <https://letsencrypt.org/>`__. Этот процесс сложнее, чем создание самоподписанного сертификата, но более "официальный" и гарантирует чёткую идентификацию. Кроме того, такие сертификаты автоматически доверяют браузеры и другие приложения, в отличие от самоподписанных, которые требуют дополнительной настройки на стороне клиента.
ta: சான்றிதழைப் பெறுவதற்கான முக்கிய அணுகுமுறை `<https://letsencrypt.org/> __ __ போன்ற ஒரு சான்றிதழ் அதிகாரத்தை (CA) பயன்படுத்துவதாகும். இது தன்வய கையொப்பமிடப்பட்ட சான்றிதழைக் காட்டிலும் மிகவும் சிக்கலான செயல்முறையாகும், ஆனால் இது மிகவும் "அதிகாரப்பூர்வமானது" மற்றும் உங்கள் அடையாளம் தெளிவாக குறிப்பிடப்படுவதை உறுதி செய்கிறது. இதன் விளைவாக சான்றிதழ் வலை உலாவிகள் போன்ற பயன்பாடுகளால் நம்பப்படுகிறது, தன்வய கையொப்பமிடப்பட்ட சான்றிதழைப் போலல்லாமல், நம்பகமானதாகக் கருதப்படுவதற்கு முன்பு கிளையன்ட் பக்கத்தில் கூடுதல் உள்ளமைவு தேவைப்படுகிறது.
uk: Основним підходом до отримання сертифіката є використання центру сертифікації (CA), наприклад `Let's Encrypt <https://letsencrypt.org/>`__. Це більш громіздкий процес, ніж самопідписаний сертифікат, але він більш «офіційний» і забезпечує чітке представлення вашої особи. Отриманому сертифікату також довіряють такі програми, як веб-браузери, на відміну від самопідписаного сертифіката, який потребує додаткової конфігурації на стороні клієнта, перш ніж вважатиметься надійним.
zh_hant: 最常見的做法是透過憑證授權機構（CA），如 `Let's Encrypt <https://letsencrypt.org/>`__ 申請憑證。這比自簽憑證麻煩，但更「正式」，可清楚證明身份。這類憑證會被主流瀏覽器等應用信任，而自簽憑證則需額外設定才會被接受。

source: These certificates do not require any configuration on the client to work, since Godot already bundles the Mozilla certificate bundle in the editor and exported projects.
de: Diese Zertifikate erfordern keine Konfiguration auf dem Client, da Godot das Mozilla-Zertifikatspaket bereits im Editor und in den exportierten Projekten bündelt.
it: Per funzionare, questi certificati non richiedono alcuna configurazione sul client, poiché Godot integra già il pacchetto di certificati Mozilla nell'editor e nei progetti esportati.
ru: Эти сертификаты не требуют дополнительной настройки на стороне клиента, так как Godot уже включает набор сертификатов Mozilla как в редакторе, так и в экспортированных проектах.
ta: இந்த சான்றிதழ்களுக்கு கிளையன்ட் வேலை செய்ய எந்த உள்ளமைவும் தேவையில்லை, ஏனெனில் கோடோட் ஏற்கனவே மொசில்லா சான்றிதழ் மூட்டை எடிட்டரில் தொகுத்து, ஏற்றுமதி செய்யப்பட்ட திட்டங்களை தொகுக்கிறார்.
uk: Ці сертифікати не потребують жодної конфігурації на клієнті для роботи, оскільки Godot уже об’єднує пакет сертифікатів Mozilla у редакторі та експортованих проектах.
zh_hant: 這類憑證在 Godot 及其匯出專案中無需用戶端設定，因為 Godot 已內建 Mozilla 憑證包。

source: Generate a self-signed certificate
de: Erzeugen Sie ein selbst signiertes Zertifikat
it: Generare un certificato auto-firmato
ru: Генерация самоподписанного сертификата
ta: தன்வய கையொப்பமிடப்பட்ட சான்றிதழை உருவாக்கவும்
uk: Створіть самопідписаний сертифікат
zh_hant: 產生自簽名憑證

source: For most use cases, it's recommended to go through certificate authority as the process is free with certificate authorities such as Let's Encrypt. However, if using a certificate authority is not an option, then you can generate a self-signed certificate and tell the client to consider your self-signed certificate as trusted.
de: Für die meisten Anwendungsfälle empfiehlt es sich, über eine Zertifizierungsstelle zu gehen, da der Prozess bei Zertifizierungsstellen wie Let's Encrypt kostenlos ist. Wenn die Verwendung einer Zertifizierungsstelle jedoch keine Option ist, können Sie ein selbstsigniertes Zertifikat erstellen und dem Client mitteilen, dass er Ihr selbstsigniertes Zertifikat als vertrauenswürdig betrachten soll.
it: Nella maggioranza dei casi d'uso, si consiglia di rivolgersi a un'autorità di certificazione, poiché il processo è gratuito con autorità di certificazione come Let's Encrypt. Tuttavia, se non è possibile utilizzare un'autorità di certificazione, è possibile generare un certificato auto-firmato e indicare al client di considerarlo attendibile.
ru: В большинстве случаев рекомендуется получать сертификат через центр сертификации, так как этот процесс бесплатен с такими CA как Let's Encrypt. Однако если использование CA невозможно, вы можете создать самоподписанный сертификат и вручную добавить его в доверенные на стороне клиента.
ta: பெரும்பாலான பயன்பாட்டு நிகழ்வுகளுக்கு, லெட்ச் குறியாக்க போன்ற சான்றிதழ் அதிகாரிகளுடன் செயல்முறை இலவசம் என்பதால் சான்றிதழ் ஆணையம் வழியாக செல்ல பரிந்துரைக்கப்படுகிறது. இருப்பினும், ஒரு சான்றிதழ் அதிகாரத்தைப் பயன்படுத்துவது ஒரு விருப்பமல்ல என்றால், நீங்கள் தன்வய கையொப்பமிடப்பட்ட சான்றிதழை உருவாக்கி, உங்கள் தன்வய கையொப்பமிடப்பட்ட சான்றிதழை நம்பகமானதாகக் கருத கிளையண்டிடம் சொல்லலாம்.
uk: Для більшості випадків використання рекомендується пройти через центр сертифікації, оскільки цей процес є безкоштовним у таких центрах сертифікації, як Let's Encrypt. Однак, якщо використання центру сертифікації не є варіантом, ви можете створити самопідписаний сертифікат і повідомити клієнта вважати ваш самопідписаний сертифікат надійним.
zh_hant: 大多數情境建議直接用 CA（如 Let's Encrypt），因為免費又簡單。但若無法用 CA，可自行產生自簽名憑證，並在用戶端信任該憑證。

source: To create a self-signed certificate, generate a private and public key pair and add the public key (in PEM format) to the CRT file specified in the Project Settings.
de: Um ein selbstsigniertes Zertifikat zu erstellen, erzeugen Sie ein Schlüsselpaar aus privatem und öffentlichem Schlüssel und fügen den öffentlichen Schlüssel (im PEM-Format) zu der in den Projekteinstellungen angegebenen CRT-Datei hinzu.
it: Per creare un certificato auto-firmato, generare una coppia di chiavi privata e pubblica e aggiungere la chiave pubblica (in formato PEM) al file CRT specificato nelle Impostazioni del progetto.
ru: Для создания самоподписанного сертификата сгенерируйте пару приватного и публичного ключей, затем добавьте публичный ключ (в PEM-формате) в CRT-файл, указанный в Project Settings.
ta: தன்வய கையொப்பமிடப்பட்ட சான்றிதழை உருவாக்க, ஒரு தனியார் மற்றும் பொது விசை சோடியை உருவாக்கி, திட்ட அமைப்புகளில் குறிப்பிடப்பட்டுள்ள CRT கோப்பில் பொது விசையை (PEM வடிவத்தில்) சேர்க்கவும்.
uk: Щоб створити самопідписаний сертифікат, згенеруйте пару закритого та відкритого ключів і додайте відкритий ключ (у форматі PEM) до файлу CRT, указаного в параметрах проекту.
zh_hant: 建立自簽名憑證時，請產生一組私鑰/公鑰，將公鑰（PEM 格式）加入專案設定中的 CRT 檔。

source: The private key should **only** go to your server. The client must not have access to it: otherwise, the security of the certificate will be compromised.
de: Der private Schlüssel sollte **nur** auf Ihrem Server liegen. Der Client darf keinen Zugang zu ihm haben: Andernfalls ist die Sicherheit des Zertifikats gefährdet.
it: La chiave privata deve essere inviata **solo** al server. Il client non deve avervi accesso: altrimenti, la sicurezza del certificato sarà compromessa.
ru: Приватный ключ должен попасть **только** на ваш сервер. Клиент не должен иметь к нему доступа: в противном случае безопасность сертификата будет скомпрометирована.
ta: தனிப்பட்ட விசை ** மட்டுமே ** உங்கள் சேவையகத்திற்குச் செல்ல வேண்டும். வாடிக்கையாளருக்கு இதை அணுகக்கூடாது: இல்லையெனில், சான்றிதழின் பாதுகாப்பு வேறுபாடின்மை செய்யப்படும்.
uk: Закритий ключ має надходити **лише** на ваш сервер. Клієнт не повинен мати до нього доступу: інакше безпека сертифіката буде порушена.
zh_hant: 私鑰必須**僅存放於伺服器**，切勿放入用戶端，否則憑證安全性會被破壞。

source: OpenSSL has `some documentation <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ about this. For local development purposes **only**, `mkcert <https://github.com/FiloSottile/mkcert>`__ can be used as an alternative.
de: OpenSSL hat `einige Dokumentationen <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ dazu. Für **ausschließlich** lokale Entwicklungszwecke kann `mkcert <https://github.com/FiloSottile/mkcert>`__ als Alternative verwendet werden.

source: Translation status
de: Übersetzungsstatus

source: TLS/SSL certificates
it: Certificati SSL/TLS
ru: TLS/SSL сертификаты
ta: TLS/SSL சான்றிதழ்கள்
uk: Сертифікати TLS/SSL
zh_hant: TLS/SSL 憑證

source: It is often desired to use :abbr:`TLS (Transport Layer Security)` connections (also known as :abbr:`SSL (Secure Sockets Layer)` connections) for communications to avoid "man in the middle" attacks. Godot has a connection wrapper, :ref:`StreamPeerTLS <class_StreamPeerTLS>`, which can take a regular connection and add security around it. The :ref:`HTTPClient <class_HTTPClient>` and :ref:`HTTPRequest <class_HTTPRequest>` classes also support HTTPS using this same wrapper.
it: Spesso si preferisce usare connessioni :abbr:`TLS (Transport Layer Security)` (note anche come connessioni :abbr:`SSL (Secure Sockets Layer)`) per le comunicazioni, pur di evitare attacchi "man in the middle". Godot dispone di un wrapper di connessione, :ref:`StreamPeerTLS <class_StreamPeerTLS>`, che può accettare una connessione standard e aggiungervi sicurezza. Anche le classi :ref:`HTTPClient <class_HTTPClient>` e :ref:`HTTPRequest <class_HTTPRequest>` supportano HTTPS attraverso lo stesso wrapper.
ru: Для безопасного соединения рекомендуется использовать :abbr:`TLS (Transport Layer Security)` (также известный как :abbr:`SSL (Secure Sockets Layer)`), чтобы предотвратить атаки типа "man in the middle" (человек посередине). В Godot есть обёртка соединения :ref:`StreamPeerTLS <class_StreamPeerTLS>`, которая может взять обычное соединение и добавить защиту. Классы :ref:`HTTPClient <class_HTTPClient>` и :ref:`HTTPRequest <class_HTTPRequest>` также поддерживают HTTPS через эту же обёртку.
ta: இது பெரும்பாலும் பயன்படுத்த விரும்பப்படுகிறது: ஏபிபிஆர்: `டிஎல்எச் (போக்குவரத்து அடுக்கு பாதுகாப்பு)` இணைப்புகள் (என்றும் அழைக்கப்படுகிறது: ஏபிபிஆர்: `எச்எச்எல் (பாதுகாப்பான சாக்கெட் லேயர்)` இணைப்புகள்) தகவல்தொடர்புகள் "நடுத்தர மனிதனின்" தாக்குதல்களைத் தவிர்ப்பதற்கு. கோடோட்டில் ஒரு இணைப்பு ரேப்பர் உள்ளது,: ref: `streampeertls <class_streampeertls>`, இது வழக்கமான இணைப்பை எடுத்து அதைச் சுற்றி பாதுகாப்பைச் சேர்க்கலாம். தி: ரெஃப்: `httpclient <class_httpclient>` மற்றும்: ref: `httprequest <class_httprequest>` வகுப்புகள் இதே ரேப்பரைப் பயன்படுத்தி https ஐ ஆதரிக்கின்றன.
uk: Часто бажано використовувати з’єднання :abbr:`TLS (Transport Layer Security)` (також відомі як з’єднання :abbr:`SSL (Secure Sockets Layer)`) для зв’язку, щоб уникнути атак «людина посередині». Godot має обгортку підключення, :ref:`StreamPeerTLS <class_StreamPeerTLS>`, яка може прийняти звичайне з’єднання та додати йому захист. Класи :ref:`HTTPClient <class_HTTPClient>` і :ref:`HTTPRequest <class_HTTPRequest>` також підтримують HTTPS за допомогою цієї самої оболонки.
zh_hant: 通常會希望使用 :abbr:`TLS (傳輸層安全)` 連線 (也稱為 :abbr:`SSL (安全通訊端層)` 連線) 以避免「中間人」攻擊。Godot 有一個連線封裝器 :ref:`StreamPeerTLS <class_StreamPeerTLS>`，它可以接受一個常規連線並為其增加安全層。:ref:`HTTPClient <class_HTTPClient>` 和 :ref:`HTTPRequest <class_HTTPRequest>` 類別也支援使用同一個封裝器的 HTTPS。

source: Godot will try to use the TLS certificate bundle provided by the operating system, but also includes the `TLS certificate bundle from Mozilla <https://github.com/godotengine/godot/blob/master/thirdparty/certs/ca-certificates.crt>`__ as a fallback.
it: Godot tenterà di utilizzare il pacchetto di certificati TLS fornito dal sistema operativo, ma include anche il `pacchetto di certificati TLS di Mozilla <https://github.com/godotengine/godot/blob/master/thirdparty/certs/ca-certificates.crt>`__ come alternativa di riserva.
ru: Godot попытается использовать сертификаты TLS из системного хранилища ОС, но также включает `резервный набор сертификатов Mozilla <https://github.com/godotengine/godot/blob/master/thirdparty/certs/ca-certificates.crt>`__ на случай проблем.
ta: இயக்க முறைமையால் வழங்கப்பட்ட டி.எல்.எச் சான்றிதழ் மூட்டையைப் பயன்படுத்த கோடோட் முயற்சிக்கும், ஆனால் மொசில்லாவிலிருந்து `டி.எல்.எச் சான்றிதழ் மூட்டையும் அடங்கும் <https://github.com/godotengine/godot/blob/master/tirdparty/certs/ca-certificates.crt>` __ __.
uk: Godot спробує використати пакет сертифікатів TLS, наданий операційною системою, `але також включає пакет сертифікатів TLS від Mozilla <https://github.com/godotengine/godot/blob/master/thirdparty/certs/ca-certificates.crt>`__ як запасний варіант.
zh_hant: Godot 會優先使用作業系統提供的 TLS 憑證包，若無則會使用內建的 Mozilla TLS 憑證（<https://github.com/godotengine/godot/blob/master/thirdparty/certs/ca-certificates.crt>）。

source: You can alternatively force your own certificate bundle in the Project Settings:
it: In alternativa, è possibile forzare il proprio pacchetto di certificati nelle Impostazioni del progetto:
ru: Вы можете переназначить свои собственные сертификаты в Project Settings:
ta: திட்ட அமைப்புகளில் உங்கள் சொந்த சான்றிதழ் மூட்டை மாற்றாக கட்டாயப்படுத்தலாம்:
uk: Ви також можете створити власний пакет сертифікатів у налаштуваннях проекту:
zh_hant: 你也可以在專案設定裡強制指定自己的憑證包：

source: When set, this file *overrides* the operating system provided bundle by default. This file should contain any number of public certificates in `PEM format <https://en.wikipedia.org/wiki/Privacy-enhanced_Electronic_Mail>`__.
it: Se impostato, questo file *sovrascrive* il pacchetto predefinito fornito dal sistema operativo. Questo file dovrebbe contenere un numero qualsiasi di certificati pubblici in formato `PEM <https://en.wikipedia.org/wiki/Privacy-enhanced_Electronic_Mail>`__.
ru: При установке этот файл *переопределяет* системные сертификаты ОС по умолчанию. Файл должен содержать произвольное количество сертификатов в `PEM-формате <https://en.wikipedia.org/wiki/Privacy-enhanced_Electronic_Mail>`__.
ta: அமைக்கும்போது, இந்த கோப்பு * மேலெழுதும் * இயக்க முறைமை முன்னிருப்பாக மூட்டை வழங்கியது. இந்த கோப்பில் `பெம் வடிவத்தில் <https://en.wikipedia.org/wiki/privacy- மேம்படுத்தப்பட்ட_ எலக்ட்ரோனிக்_மெயில்> __ __.
uk: Якщо встановлено, цей файл за замовчуванням *перевизначає* пакет, наданий операційною системою. Цей файл має містити будь-яку кількість публічних сертифікатів у `форматі PEM <https://en.wikipedia.org/wiki/Privacy-enhanced_Electronic_Mail>`__.
zh_hant: 設定此選項時，會*覆蓋*作業系統的預設憑證包。此檔案需包含任意數量的公開憑證，格式為 `PEM <https://en.wikipedia.org/wiki/Privacy-enhanced_Electronic_Mail>`__。

source: Obtain a certificate from a certificate authority
it: Ottenere un certificato da un'autorità di certificazione
ru: Получить сертификат в центре сертификации
ta: சான்றிதழ் அதிகாரத்திடமிருந்து சான்றிதழைப் பெறுங்கள்
uk: Отримати сертифікат в центрі сертифікації
zh_hant: 向憑證授權機構（CA）申請憑證

source: When specifying a self-signed certificate as TLS bundle in the project settings, normal domain name validation is enforced via the certificate :abbr:`CN (common name)` and alternative names. See :ref:`TLSOptions <class_TLSOptions>` to customize domain name validation.
it: Quando si specifica un certificato auto-firmato come pacchetto TLS nelle impostazioni del progetto, la normale convalida del nome di dominio è applicata tramite il :abbr:`CN (nome comune)` del certificato e nomi alternativi. Consultare :ref:`TLSOptions <class_TLSOptions>` per personalizzare la convalida del nome di dominio.
ru: При использовании самоподписанного сертификата в качестве TLS-набора в настройках проекта, стандартная проверка доменного имени осуществляется через :abbr:`CN (Common Name)` сертификата и альтернативные имена. Для настройки проверки доменных имён см. :ref:`TLSOptions <class_TLSOptions>`.
ta: திட்ட அமைப்புகளில் தன்வய கையொப்பமிடப்பட்ட சான்றிதழை டி.எல்.எச் மூட்டையாக குறிப்பிடும்போது, இயல்பான டொமைன் பெயர் சரிபார்ப்பு சான்றிதழ் வழியாக செயல்படுத்தப்படுகிறது: ஏபிபிஆர்: `சிஎன் (பொதுவான பெயர்)` மற்றும் மாற்று பெயர்கள். காண்க: குறிப்பு: டொமைன் பெயர் சரிபார்ப்பைத் தனிப்பயனாக்க `tlsoptions <class_tlsoptions>`.
uk: Якщо в налаштуваннях проекту вказано самопідписаний сертифікат як пакет TLS, звичайна перевірка доменного імені виконується через сертифікат :abbr:`CN (common name)` та альтернативні імена. Перегляньте :ref:`TLSOptions <class_TLSOptions>`, щоб налаштувати перевірку доменного імені.
zh_hant: 當你把自簽名憑證指定為 TLS 憑證包後，Godot 仍會檢查憑證的 :abbr:`CN（通用名稱）` 與替代名稱以驗證網域。詳見 :ref:`TLSOptions <class_TLSOptions>` 可自訂驗證規則。

source: For development purposes Godot can generate self-signed certificates via :ref:`Crypto.generate_self_signed_certificate <class_Crypto_method_generate_self_signed_certificate>`.
it: Per scopi di sviluppo, Godot può generare certificati auto-firmati tramite :ref:`Crypto.generate_self_signed_certificate <class_Crypto_method_generate_self_signed_certificate>`.
ru: Для целей разработки Godot может генерировать самоподписанные сертификаты через :ref:`Crypto.generate_self_signed_certificate <class_Crypto_method_generate_self_signed_certificate>`.
ta: மேம்பாட்டு நோக்கங்களுக்காக கோடோட் தன்வய கையொப்பமிடப்பட்ட சான்றிதழ்களை உருவாக்க முடியும்: குறிப்பு: `கிரிப்டோ.செனரேட்_எல்ஃபி_சைன் செய்யப்பட்ட_செர்ஃபிகேட் <class_crypto_method_generate_self_signed_certificate>`.
uk: Для цілей розробки Godot може генерувати самопідписані сертифікати через :ref:`Crypto.generate_self_signed_certificate <class_Crypto_method_generate_self_signed_certificate>`.
zh_hant: 開發階段可用 :ref:`Crypto.generate_self_signed_certificate <class_Crypto_method_generate_self_signed_certificate>` 讓 Godot 直接產生自簽名憑證。

source: Alternatively, OpenSSL has some documentation about `generating keys <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ and `certificates <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/certificates.txt>`__.
it: In alternativa, OpenSSL dispone di documentazione sulla `generazione di chiavi <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ e `certificati <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/certificates.txt>`__.
ru: В качестве альтернативы, OpenSSL предоставляет документацию по `генерации ключей <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ и `сертификатов <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/certificates.txt>`__.
ta: மாற்றாக, Openssl `உருவாக்கும் விசைகள் <https://raw.githubusercontent.com/openssl/apenssl/master/doc/howto/keys.txt>` __ மற்றும் `சான்றிதழ்கள் பற்றிய சில ஆவணங்கள் உள்ளன <https://raw.githubusercontent.com/openssl/openssl/master/doc/howto/certificates.txt> __.
uk: Крім того, OpenSSL має певну документацію щодо `генерації ключів <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ і `сертифікатів <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/certificates.txt>`__.
zh_hant: 另外也可以參考 OpenSSL 的官方文件，如 `產生金鑰 <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ 和 `產生憑證 <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/certificates.txt>`__。
