Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/static_typing.po
Languages: fr, ga, it, ru, ta, uk, zh_hant

source: The array will remain untyped, but the ``name`` variable within the ``for`` loop will always be of ``String`` type.
fr: Le tableau restera non typé, mais la variable ``name`` dans la boucle ``for`` sera toujours de type ``String``.
ga: Fanfaidh an tsraith gan chlóscríobh, ach beidh an t-athróg ``ainm ``laistigh den lúb ``for`` de chineál ``String`` i gcónaí.
it: L'array rimarrà non tipizzato, ma la variabile ``name`` all'interno del ciclo ``for`` sarà sempre di tipo ``String``.
ru: Массив останется нетипизированным, но переменная ``name`` внутри цикла ``for`` всегда будет иметь тип ``String``.
ta: வரிசை வெட்டப்படாமல் இருக்கும், ஆனால் `` `வளையத்திற்குள் உள்ள` `பெயர்`` எப்போதும்` `சரம்`` வகையாக இருக்கும்.
uk: Масив залишатиметься без типів, але змінна ``name`` у циклі ``for`` завжди буде типу ``String``.
zh_hant: 陣列本身仍然是無型別，但 ``for`` 內的 ``name`` 變數會被固定為 ``String`` 型別。

source: Specify the element type of a ``Dictionary``
it: Definire il tipo degli elementi in un ``Dictionary``
ru: Укажите тип элемента ``Dictionary``
ta: ஒரு `` அகராதி`` இன் உறுப்பு வகையைக் குறிப்பிடவும்
uk: Вкажіть тип елемента a ``Dictionary``
zh_hant: 指定 ``Dictionary`` 的元素型別

source: To define the type of a ``Dictionary``'s keys and values, enclose the type name in ``[]`` and separate the key and value type with a comma.
it: Per definire il tipo delle chiavi e dei valori di un ``Dictionary``, racchiudere il nome del tipo tra ``[]`` e separa il tipo delle chiavi e dei valori con una virgola.
ru: Чтобы определить тип ключей и значений ``Dictionary``, заключите имя типа в ``[]`` и разделите ключ и тип значения запятой.
ta: ஒரு `` அகராதி`` இன் விசைகள் மற்றும் மதிப்புகளின் வகையை வரையறுக்க, வகை பெயரை `` [] `` இல் இணைக்கவும், விசை மற்றும் மதிப்பு வகையை கமாவுடன் பிரிக்கவும்.
uk: Щоб визначити тип ключів та значень ``Dictionary``, укладіть назву типу в ``[]`` та розділіть тип ключа та значення комою.
zh_hant: 要定義 ``Dictionary`` 的鍵與值的型別，請將型別名稱包在 ``[]`` 內，並以逗號分隔鍵與值的型別。

source: A dictionary's value type applies to ``for`` loop variables, as well as some operators like ``[]`` and ``[...] =`` (assignment). Dictionary methods that return values and other operators (such as ``==``) are still untyped. Built-in types, native and custom classes, and enums may be used as element types. Nested typed collections (like ``Dictionary[String, Dictionary[String, int]]``) are not supported.
it: Il tipo dei valori di un dizionario si applica alle variabili del ciclo ``for``, così come ad alcuni operatori come ``[]`` e ``[]=`` (assegnamento). I metodi dei dizionari che restituiscono valori e altri operatori (come ``==``) sono comunque non tipizzati. Tipi integrati, classi native e personalizzate, ed enumerazioni si possono utilizzare come tipi degli elementi. Le raccolte tipizzate annidate (come ``Dictionary[String, Dictionary[String, int]]``) non sono supportate.
ru: Тип значения словаря применяется к переменным цикла ``for``, а также к некоторым операторам, таким как ``[]`` и ``[...] =`` (присваивание). Методы словаря, возвращающие значения, и другие операторы (например, ``==``) по-прежнему нетипизированы. В качестве типов элементов могут использоваться встроенные типы, собственные и пользовательские классы, а также перечисления. Вложенные типизированные коллекции (например, ``Dictionary[String, Dictionary[String, int]]``) не поддерживаются.
ta: ஒரு அகராதியின் மதிப்பு வகை `` `` `வளைய மாறிகள், அத்துடன்` `[]` `மற்றும்` `[...] =` `(ஒதுக்கீடு) போன்ற சில ஆபரேட்டர்களுக்கும் பொருந்தும். மதிப்புகளைத் தரும் அகராதி முறைகள் மற்றும் பிற ஆபரேட்டர்கள் (`` == `` போன்றவை) இன்னும் குறைக்கப்படவில்லை. உள்ளமைக்கப்பட்ட வகைகள், சொந்த மற்றும் தனிப்பயன் வகுப்புகள் மற்றும் ENUM கள் உறுப்பு வகைகளாகப் பயன்படுத்தப்படலாம். உள்ளமைக்கப்பட்ட தட்டச்சு சேகரிப்புகள் (`` அகராதி [சரம், அகராதி [சரம், எண்ணாக]] ``) ஆதரிக்கப்படவில்லை.
uk: Тип значення словника застосовується до змінних циклу ``for``, а також до деяких операторів, таких як ``[]`` і ``[...] =`` (присвоювання). Методи словника, що повертають значення, та інші оператори (такі як ``==``) залишаються нетипізованими. Вбудовані типи, нативні та користувацькі класи, а також переліки можуть використовуватися як типи елементів. Вкладені типізовані колекції (такі як ``Dictionary[String, Dictionary[String, int]]``) не підтримуються.
zh_hant: 字典的值型別會套用到 ``for`` 迴圈中的變數, 以及某些運算子, 如 ``[]`` 與 ``[...] =`` (指定)。回傳值的字典方法與其他運算子 (例如 ``==``) 仍是不具型別的。元素型別可以是內建型別、原生與自訂類別, 或列舉。巢狀具型別的集合 (例如 ``Dictionary[String, Dictionary[String, int]]``) 目前不支援。

source: Type casting
fr: La conversion de type
ga: Cineál réitigh
ru: Приведение типа
ta: வார்ப்பு தட்டச்சு
uk: Лиття типу
zh_hant: 型別轉換

source: Type casting is an important concept in typed languages. Casting is the conversion of a value from one type to another.
fr: Le changement de type est un concept clé dans les langages typés. Le casting est la conversion d'une valeur d'un type à un autre.
ga: Is coincheap tábhachtach é réitigh cineálacha i dteangacha clóscríofa. Is é réitigh comhshó luach ó chineál amháin go cineál eile.
it: Il type casting è un concetto importante nei linguaggi tipizzati. Il casting è la conversione di un valore da un tipo a un altro.
ru: Приведение типов — важная концепция в типизированных языках. Приведение типов — это преобразование значения из одного типа в другой.
ta: தட்டச்சு செய்யப்பட்ட மொழிகளில் வகை வார்ப்பு ஒரு முக்கியமான கருத்தாகும். வார்ப்பு என்பது ஒரு மதிப்பை ஒரு வகையிலிருந்து மற்றொரு வகைக்கு மாற்றுவதாகும்.
uk: Приведення типів є важливою концепцією в типізованих мовах. Приведення — це перетворення значення з одного типу в інший.
zh_hant: 型別轉換是有型別語言很重要的觀念，意思是將一個值從一種型別轉成另一種型別。

source: Imagine an ``Enemy`` in your game, that ``extends Area2D``. You want it to collide with the ``Player``, a ``CharacterBody2D`` with a script called ``PlayerController`` attached to it. You use the ``body_entered`` signal to detect the collision. With typed code, the body you detect is going to be a generic ``PhysicsBody2D``, and not your ``PlayerController`` on the ``_on_body_entered`` callback.
fr: Imaginez un ``Enemy`` dans votre jeu, avec ``extends Area2D``. Vous voulez qu'il entre en collision avec le joueur ``Player``, un ``CharacterBody2D`` avec un script attaché appelé ``PlayerController``. Vous utilisez le signal ``body_entered`` pour détecter la collision. Avec le code qui est écrit, le corps que vous détecterez sera un ``PhysicsBody2D`` générique, et non votre ``PlayerController`` via le rappel ``_on_body_entered``.
ga: Samhlaigh ``Naimhde`` i do chluiche, a shíneann `Area2D``. Ba mhaith leat go mbuailfidh sé leis an `Player``, `CharacterBody2D`` le script darb ainm `PlayerController`` atá ceangailte leis. Úsáideann tú an comhartha ``body_entered ``chun an imbhualadh a bhrath. Le cód clóscríofa, is cineálach ``PhysicsBody2D`` a bheidh an corp a bhraitheann tú, agus ní do `PlayerController`` ar an nglaoch ``_on_body_entered``.
it: Immagina un ``Enemy`` nel tuo gioco, che ``extends Area2D``. Vuoi che entri in collisione con il ``Player``, un ``CharacterBody2D`` con uno script denominato ``PlayerController`` associato. Utilizzi il segnale ``body_entered`` per rilevare la collisione. Con codice tipizzato, il corpo rilevato sarà un ``PhysicsBody2D`` generico, e non il tuo ``PlayerController`` sul callback ``_on_body_entered``.
ru: Представьте себе ``Enemy`` в вашей игре, который ``расширяет Area2D``. Вы хотите, чтобы он столкнулся с ``Игроком``, объектом ``CharacterBody2D``, к которому прикреплён скрипт ``PlayerController``. Для обнаружения столкновения используется сигнал ``body_entered``. При использовании типизированного кода обнаруженным телом будет обобщённый ``PhysicsBody2D``, а не ваш ``PlayerController`` в обратном вызове ``_on_body_entered``.
ta: உங்கள் விளையாட்டில் ஒரு `` எதிரி`` ஐ கற்பனை செய்து பாருங்கள், அது `` ஏரியா 2 டி`` ஐ நீட்டிக்கிறது. `` பிளேயர்``, ஒரு `` `` `பிளேயர்கண்ட்ரோலர்`` என்று அழைக்கப்படும் ச்கிரிப்டுடன் இது மோதிக் கொள்ள விரும்புகிறீர்கள். மோதலைக் கண்டறிய நீங்கள் `` body_entered`` சமிக்ஞையைப் பயன்படுத்துகிறீர்கள். தட்டச்சு செய்த குறியீட்டைக் கொண்டு, நீங்கள் கண்டறிந்த உடல் ஒரு பொதுவான `` இயற்பியல் பாடி 2 டி`` ஆக இருக்கும், ஆனால் `` _ON_BODY_ENTERED`` கால்பேக்கில் உங்கள் `` Playercontroller`` அல்ல.
uk: Уявіть ``Ворога`` у вашій грі, який ``розширює Area2D``. Ви хочете, щоб він зіткнувся з ``Player``, ``CharacterBody2D`` із прикріпленим до нього сценарієм під назвою ``PlayerController``. Ви використовуєте сигнал ``body_entered`` для виявлення зіткнення. За допомогою введеного коду тіло, яке ви виявляєте, буде загальним ``PhysicsBody2D``, а не вашим ``PlayerController`` у зворотному виклику ``_on_body_entered``.
zh_hant: 假設你的遊戲中有一個繼承自 ``Area2D`` 的 ``Enemy``，你希望它能和附有 ``PlayerController`` 腳本的 ``CharacterBody2D`` 玩家碰撞，並用 ``body_entered`` 訊號來偵測。這時，型別化的程式碼中你取得到的 body 其實是通用的 ``PhysicsBody2D``，而不是你自訂的 ``PlayerController``。

source: You can check if this ``PhysicsBody2D`` is your ``Player`` with the ``as`` keyword, and using the colon ``:`` again to force the variable to use this type. This forces the variable to stick to the ``PlayerController`` type:
it: Puoi verificare se ``PhysicsBody2D`` è il tuo ``Player`` con la parola chiave ``as`` e usando nuovamente i due punti ``:`` per forzare la variabile a usare questo tipo. Ciò forza la variabile a rimanere di tipo ``PlayerController``:
ru: Вы можете проверить, является ли этот ``PhysicsBody2D`` вашим ``Player``, с помощью ключевого слова ``as`` и двоеточия ``:``, чтобы принудительно использовать этот тип переменной. Это привязывает переменную к типу ``PlayerController``:
ta: இந்த `` இயற்பியல் பாடி 2 டி`` ```` முக்கிய சொல்லுடன் உங்கள்` `பிளேயர்` என்பதை நீங்கள் சரிபார்க்கலாம், மேலும் பெருங்குடல்` `:` `இந்த வகையைப் பயன்படுத்த மாறியை கட்டாயப்படுத்த மீண்டும். இது `` Playercontroller`` வகையுடன் ஒட்டிக்கொள்ள மாறுகிறது:
uk: Ви можете перевірити, чи є цей ``PhysicsBody2D`` вашим ``Player``, за допомогою ключового слова ``as`` та повторного використання двокрапки ``:``, щоб змусити змінну використовувати цей тип. Це змушує змінну дотримуватися типу ``PlayerController``:
zh_hant: 你可以用 ``as`` 關鍵字檢查這個 ``PhysicsBody2D`` 是否是你的 ``Player``，並再次使用冒號 ``:`` 來強制變數採用該型別。這會讓變數被固定為 ``PlayerController`` 型別：

source: As we're dealing with a custom type, if the ``body`` doesn't extend ``PlayerController``, the ``player`` variable will be set to ``null``. We can use this to check if the body is the player or not. We will also get full autocompletion on the player variable thanks to that cast.
fr: Comme il s'agit d'un type personnalisé, si ``body`` n'hérite pas de ``PlayerController``, la variable ``player`` sera défini avec ``null``. Nous pouvons utiliser cela pour vérifier si body est le joueur ou non. Nous obtiendrons également l'auto-complétion complète de la variable player grâce à cette conversion.
ga: Agus muid ag déileáil le cineál saincheaptha, mura leathnaíonn an ``body` `playerController``, socraítear an athróg ``player`` go `null``. Is féidir linn é seo a úsáid chun a sheiceáil an é an comhlacht an t-imreoir nó nach bhfuil. Gheobhaidh muid uathchomhlánú iomlán freisin ar an athróg imreoir a bhuíochas leis an gcaitheadh sin.
it: Dato che abbiamo a che fare con un tipo personalizzato, se ``body`` non estende ``PlayerController``, la variabile ``player`` verrà impostata a ``null``. Possiamo utilizzare questo per verificare se il corpo è il player o meno. Otterremo anche il completamento automatico completo sulla variabile player grazie a questa conversione.
ru: Поскольку мы имеем дело с пользовательским типом, если ``body`` не расширяет ``PlayerController``, переменная ``player`` будет установлена в ``null``. Мы можем использовать это для проверки, является ли body игроком. Благодаря этому приведению мы также получим полное автодополнение для переменной player.
ta: நாங்கள் தனிப்பயன் வகையுடன் கையாள்வதால், `` உடல்`` `` பிளேர்கண்ட்ரோலர்`` ஐ நீட்டிக்கவில்லை என்றால், `` பிளேயர்`` மாறி `` பூச்யம்`` என அமைக்கப்படும். உடல் வீரரா இல்லையா என்பதை சரிபார்க்க இதைப் பயன்படுத்தலாம். அந்த நடிகர்களுக்கு நன்றி பிளேயர் மாறியில் முழு தன்னியக்கவியல் பெறுவோம்.
uk: Оскільки ми маємо справу з користувацьким типом, якщо ``body`` не розширює ``PlayerController``, змінна ``player`` буде встановлена на ``null``. Ми можемо використовувати це, щоб перевірити, чи є тіло гравцем чи ні. Ми також отримаємо повне автозавершення для змінної гравця завдяки цьому касту.
zh_hant: 因為這裡處理的是自訂型別，如果 ``body`` 不是 ``PlayerController`` 的子類，``player`` 變數就會是 ``null``。你可以用這個特性來判斷 body 是否為玩家。轉型之後，player 變數也會有完整的自動補全。

source: The ``as`` keyword silently casts the variable to ``null`` in case of a type mismatch at runtime, without an error/warning. While this may be convenient in some cases, it can also lead to bugs. Use the ``as`` keyword only if this behavior is intended. A safer alternative is to use the ``is`` keyword:
it: La parola chiave ``as`` converte silenziosamente la variabile a ``null`` in caso di incompatibilità di tipo in fase di esecuzione, senza generare errori/avvertimenti. Sebbene ciò sia comodo in alcuni casi, può anche causare bug. Utilizzare la parola chiave ``as`` solo se si desidera questo comportamento. Un'alternativa più sicura è utilizzare la parola chiave ``is``:
ru: Ключевое слово ``as`` автоматически приводит переменную к ``null`` в случае несоответствия типов во время выполнения, без выдачи ошибки/предупреждения. Хотя в некоторых случаях это может быть удобно, это также может привести к ошибкам. Используйте ключевое слово ``as`` только если это предусмотрено. Более безопасной альтернативой является использование ключевого слова ``is``:
ta: ``` 'முக்கிய சொல் ஒரு பிழை/எச்சரிக்கையின்றி, இயக்க நேரத்தில் ஒரு வகை பொருந்தாத விசயத்தில் மாறியை` `NULL`` க்கு ம silent னமாக அளிக்கிறது. சில சந்தர்ப்பங்களில் இது வசதியாக இருக்கும்போது, இது பிழைகளுக்கும் வழிவகுக்கும். இந்த நடத்தை நோக்கம் இருந்தால் மட்டுமே `` AS`` முக்கிய சொல்லைப் பயன்படுத்தவும். ஒரு பாதுகாப்பான மாற்று `` ஐஎச்` முக்கிய சொல்லைப் பயன்படுத்துவது:
uk: Ключове слово ``as`` непомітно перетворює змінну на ``null`` у разі невідповідності типів під час виконання, без помилки/попередження. Хоча це може бути зручно в деяких випадках, це також може призвести до помилок. Використовуйте ключове слово ``as``, лише якщо це передбачено. Безпечнішою альтернативою є використання ключового слова ``is``:
zh_hant: ``as`` 關鍵字在執行階段若型別不相符，會在沒有錯誤或警告的情況下，將變數悄悄轉為 ``null``。雖然某些情況下很方便，但也可能造成錯誤。只有在你確實想要這種行為時才使用 ``as``。較安全的替代作法是使用 ``is`` 關鍵字：

source: You can also simplify the code by using the ``is not`` operator:
it: È anche possibile semplificare il codice utilizzando l'operatore ``is not``:
ru: Вы также можете упростить код, используя оператор ``is not``:
ta: `` அல்ல`` ஆபரேட்டரைப் பயன்படுத்துவதன் மூலம் குறியீட்டை எளிமைப்படுத்தலாம்:
uk: Ви також можете спростити код, використовуючи оператор ``is not``:
zh_hant: 你也可以使用 ``is not`` 運算子讓程式碼更簡潔：

source: Alternatively, you can use the ``assert()`` statement:
it: In alternativa, è possibile utilizzare l'istruzione ``assert()``:
ru: В качестве альтернативы вы можете использовать оператор ``assert()``:
ta: மாற்றாக, நீங்கள் `` assert () `` அறிக்கையைப் பயன்படுத்தலாம்:
uk: Або ж ви можете скористатися оператором ``assert()``:
zh_hant: 或者，你也可以使用 ``assert()`` 敘述：

source: If you try to cast with a built-in type and it fails, Godot will throw an error.
fr: Si vous essayez de convertir avec un type intégré et que cela échoue, Godot lancera une erreur.
ga: Má dhéanann tú iarracht caitheamh le cineál ionsuite agus má theipeann air, caithfidh Godot earráid.
it: Se si tenta di convertire con un tipo integrato e l'operazione fallisce, Godot genererà un errore.
ru: Если вы попытаетесь выполнить приведение со встроенным типом, и это не удастся, Godot выдаст ошибку.
ta: நீங்கள் ஒரு உள்ளமைக்கப்பட்ட வகையுடன் நடிக்க முயற்சித்தால், அது தோல்வியுற்றால், கோடோட் ஒரு பிழையை வீசும்.
uk: Якщо ви спробуєте привести за допомогою вбудованого типу, але це не вдасться, Godot видасть помилку.
zh_hant: 如果你嘗試轉型成內建型別但失敗，Godot 會直接拋出錯誤。

source: Safe lines
fr: Lignes sécurisées
ga: Línte sábháil
it: Righe sicure
ru: Безопасные строки
ta: பாதுகாப்பான கோடுகள்
uk: Безпечні рядки
zh_hant: 安全行

source: You can also use casting to ensure safe lines. Safe lines are a tool to tell you when ambiguous lines of code are type-safe. As you can mix and match typed and dynamic code, at times, Godot doesn't have enough information to know if an instruction will trigger an error or not at runtime.
fr: Vous pouvez également utiliser le casting pour garantir la sécurité des lignes. Les lignes sécurisées sont un outil qui vous indique quand des lignes de code ambiguës sont sécurisées en termes de type. Comme vous pouvez mélanger et assortir du code typé et dynamique, Godot n'a parfois pas suffisamment d'informations pour savoir si une instruction déclenchera une erreur ou non au moment de l'exécution.
ga: Is féidir leat réitigh a úsáid chun línte sábháilte a chinntiú. Is uirlis iad línte sábháilte chun insint duit nuair a bhíonn línte débhríoch cód sábháilte Toisc gur féidir leat cód clóscríofa agus dinimiciúil a mheascadh agus a mheaitseáil, uaireanta, níl go leor faisnéise ag Godot chun a fháil amach an spreagfaidh treoir earráid nó nach bhfuil ag am rith.
it: È anche possibile usare il casting per garantire la sicurezza delle righe. Le righe sicure sono un mezzo che indica quando le righe di codice ambigue sono di tipo sicuro. Dato che è possibile combinare codice tipizzato e dinamico, a volte Godot non ha informazioni sufficienti per sapere se un'istruzione genererà o meno un errore in fase di esecuzione.
ru: Вы также можете использовать приведение типов для обеспечения безопасности строк. Безопасные строки — это инструмент, который определяет, являются ли неоднозначные строки кода типобезопасными. Поскольку типизированный и динамический код могут комбинироваться, Godot иногда не имеет достаточной информации, чтобы определить, вызовет ли инструкция ошибку во время выполнения.
ta: பாதுகாப்பான வரிகளை உறுதிப்படுத்த நீங்கள் வார்ப்பைப் பயன்படுத்தலாம். குறியீட்டின் தெளிவற்ற கோடுகள் வகை-பாதுகாப்பாக இருக்கும்போது உங்களுக்குச் சொல்ல ஒரு கருவியாகும். தட்டச்சு செய்யப்பட்ட மற்றும் மாறும் குறியீட்டை நீங்கள் கலந்து பொருத்தலாம் என்பதால், சில நேரங்களில், ஒரு அறிவுறுத்தல் ஒரு பிழையைத் தூண்டும் அல்லது இயக்க நேரத்தில் இல்லையா என்பதை அறிய கோடோட் போதுமான தகவல்கள் இல்லை.
uk: Ви також можете використовувати лиття для забезпечення безпечних ліній. Безпечні рядки — це інструмент, який повідомляє вам, коли неоднозначні рядки коду безпечні для типів. Оскільки ви можете поєднувати введений і динамічний код, інколи Godot не має достатньо інформації, щоб знати, чи інструкція викличе помилку чи ні під час виконання.
zh_hant: 你也可以用型別轉換來確保安全行。安全行是 Godot 的一種輔助工具，用來告訴你某行有歧義的程式碼在型別上是否安全。因為你可以混用有型別和動態程式碼，有時 Godot 無法判斷某行指令在執行時會不會錯。

source: This happens when you get a child node. Let's take a timer for example: with dynamic code, you can get the node with ``$Timer``. GDScript supports `duck-typing <https://stackoverflow.com/a/4205163/8125343>`__, so even if your timer is of type ``Timer``, it is also a ``Node`` and an ``Object``, two classes it extends. With dynamic GDScript, you also don't care about the node's type as long as it has the methods you need to call.
fr: Cela se produit lorsque vous avez un nœud enfant. Prenons un timer par exemple : avec du code dynamique, vous pouvez obtenir le nœud avec ``$Timer``. GDScript supporte le `duck-typing <https://stackoverflow.com/a/4205163/8125343>`__, donc même si votre timer est de type ``Timer``, c'est aussi un ``Node`` et un ``Object``, deux classes auxquelles il appartient. Avec le GDScript dynamique, vous ne vous souciez pas non plus du type du nœud tant qu'il possède les méthodes que vous avez besoin d'appeler.
ga: Tarlaíonn sé seo nuair a fhaigheann tú nód linbh. Glacaimid lasc ama mar shampla: le cód dinimiciúil, is féidir leat an nód a fháil le ``$Timer``. Tacaíonn GDScript le `clóscríobh lachan <https://stackoverflow.com/a/4205163/8125343>`__, mar sin fiú má tá an t-amadóir den chineál `` Uaineadóir``, is `` Nód`` agus `` é freisin `Réad``, dhá rang leathnaíonn sé. Le GDScript dinimiciúil, is cuma leat ach an oiread faoi chineál an nóid chomh fada agus a bhfuil na modhanna a theastaíonn uait chun glaoch a chur air.
it: Questo accade quando si ottiene un nodo figlio. Prendiamo ad esempio un timer: con codice dinamico, si può ottenere il nodo con ``$Timer``. GDScript supporta il `duck-typing <https://stackoverflow.com/a/4205163/8125343>`__, quindi anche se il timer è di tipo ``Timer``, è anche un ``Node`` e un ``Object``, due classi che estende. Con GDScript dinamico, inoltre, il tipo del nodo non importa, purché abbia i metodi che si necessita chiamare.
ru: Это происходит, когда вы получаете дочерний узел. Возьмем, к примеру, таймер: с динамическим кодом вы можете получить узел с помощью ``$Timer``. GDScript поддерживает `Утиную типизацию <https://stackoverflow.com/a/4205163/8125343>`__, поэтому даже если ваш таймер имеет тип ``Timer``, он также является ``Node`` и ``Object``, два класса которые он расширяет. В динамическом GDScript вы также не заботитесь о типе узла, если у него есть необходимые вам методы для вызова.
ta: நீங்கள் ஒரு குழந்தை முனை பெறும்போது இது நிகழ்கிறது. எடுத்துக்காட்டாக ஒரு டைமரை எடுத்துக்கொள்வோம்: மாறும் குறியீட்டைக் கொண்டு, நீங்கள் `` $ டைமர்`` உடன் முனையைப் பெறலாம். Gdscript `duck-tiping <https://stackoverflow.com/a/4205163/8125343> ____, எனவே உங்கள் டைமர்` `டைமர்`` வகையாக இருந்தாலும், இது ஒரு` `நோட்`` மற்றும் ஒரு` `பொருள்``, அது நீட்டிக்கிறது. மாறும் சி.டி.எச்ச்கிரிப்ட் மூலம், நீங்கள் அழைக்க வேண்டிய முறைகள் இருக்கும் வரை முனையின் வகையைப் பற்றியும் நீங்கள் கவலைப்படவில்லை.
uk: Це відбувається, коли ви отримуєте дочірній вузол. Візьмемо для прикладу таймер: за допомогою динамічного коду ви можете отримати вузол з допомогою``$Timer``. GDScript підтримує `качину типізацію <https://stackoverflow.com/a/4205163/8125343>`__, тому навіть якщо ваш таймер типу ``Timer``, він також є ``Node`` і ``Object``, два класи він розширює. За допомогою динамічного GDScript ви також не піклуєтесь про тип вузла, якщо він має методи, необхідні для виклику.
zh_hant: 這種情況通常發生在你取得子節點時。以 Timer 為例，動態寫法可以用 ``$Timer`` 直接取得節點。GDScript 支援 `鴨子型別 <https://stackoverflow.com/a/4205163/8125343>`__，所以即使 Timer 是 ``Timer`` 型別，它同時也是 ``Node`` 和 ``Object``。用動態 GDScript，只要該節點有你要呼叫的方法，型別不是重點。
