Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/static_typing.po
Languages: fr, ga, it, ru, ta, uk, zh_hant

source: However, this code will produce ``UNSAFE_PROPERTY_ACCESS`` and ``UNSAFE_METHOD_ACCESS`` warnings as the property and method are not present in the referenced type - in this case a ``Node2D``. To make these operations safe, you can first check if the object is of type ``MyScript`` using the ``is`` keyword and then declare a variable with the type ``MyScript`` on which you can set its properties and call its methods:
it: Tuttavia, questo codice genererà gli avvertimenti ``UNSAFE_PROPERTY_ACCESS`` e ``UNSAFE_METHOD_ACCESS`` poiché la proprietà e il metodo non sono presenti nel tipo referenziato, in questo caso ``Node2D``. Per rendere queste operazioni sicure, è possibile prima verificare se l'oggetto è di tipo ``MyScript`` tramite la parola chiave ``is`` e poi dichiarare una variabile di tipo ``MyScript`` su cui è possibile impostarne le proprietà e chiamarne i metodi:
ru: Однако этот код выдаст предупреждения ``UNSAFE_PROPERTY_ACCESS`` и ``UNSAFE_METHOD_ACCESS``, поскольку свойство и метод отсутствуют в указанном типе — в данном случае ``Node2D``. Чтобы сделать эти операции безопасными, можно сначала проверить, принадлежит ли объект типу ``MyScript``, с помощью ключевого слова ``is``, а затем объявить переменную типа ``MyScript``, для которой можно задать её свойства и вызвать её методы:
ta: எவ்வாறாயினும், இந்த குறியீடு `` பாதுகாப்பற்ற_பிராபர்ட்டி_அக்சச்`` மற்றும் `` பாதுகாப்பற்ற_மெத்தோட்_அக்சச்`` எச்சரிக்கைகள் என சொத்து மற்றும் முறை குறிப்பிடப்பட்ட வகைகளில் இல்லை - இந்த விசயத்தில் ஒரு `` முனை 2 டி``. இந்த செயல்பாடுகளை பாதுகாப்பாக மாற்ற, பொருள் `` ``` முக்கிய சொல்லைப் பயன்படுத்தி `` மைச்கிரிப்ட்` வகை என்பதை நீங்கள் முதலில் சரிபார்க்கலாம், பின்னர் `` மைச்கிரிப்ட்`` வகையுடன் ஒரு மாறியை அறிவிக்கவும், அதன் பண்புகளை அமைத்து அதன் முறைகளை அழைக்கலாம்:
uk: Однак, цей код видасть попередження ``UNSAFE_PROPERTY_ACCESS`` та ``UNSAFE_METHOD_ACCESS``, оскільки властивість та метод відсутні у вказаному типі – у цьому випадку ``Node2D``. Щоб зробити ці операції безпечними, ви можете спочатку перевірити, чи об'єкт належить до типу ``MyScript``, використовуючи ключове слово ``is``, а потім оголосити змінну з типом ``MyScript``, для якої ви можете встановити її властивості та викликати її методи:
zh_hant: 然而，這段程式碼會產生 ``UNSAFE_PROPERTY_ACCESS`` 與 ``UNSAFE_METHOD_ACCESS`` 警告，因為所參考的型別（本例為 ``Node2D``）並沒有這個屬性與方法。為了讓操作安全，你可以先用 ``is`` 關鍵字檢查物件是否為 ``MyScript`` 型別，然後宣告一個 ``MyScript`` 型別的變數，再對其設定屬性並呼叫方法：

source: Alternatively, you can declare a variable and use the ``as`` operator to try to cast the object. You'll then want to check whether the cast was successful by confirming that the variable was assigned:
it: Alternativamente, è possibile dichiarare una variabile e usare l'operatore ``as`` per provare a convertire l'oggetto. Sarà quindi necessario verificare se la conversione è riuscita confermando che la variabile sia stata assegnata:
ru: В качестве альтернативы вы можете объявить переменную и использовать оператор ``as``, чтобы попытаться привести объект к типу. Затем вам нужно будет проверить, успешно ли произошло приведение, убедившись, что переменная была назначена:
ta: மாற்றாக, நீங்கள் ஒரு மாறியை அறிவிக்கலாம் மற்றும் பொருளை நடிக்க முயற்சிக்க `` `` ஆபரேட்டரைப் பயன்படுத்தலாம். மாறி ஒதுக்கப்பட்டதை உறுதிப்படுத்துவதன் மூலம் நடிகர்கள் வெற்றிகரமாக இருந்தார்களா என்பதை நீங்கள் சரிபார்க்க வேண்டும்:
uk: Або ж ви можете оголосити змінну та використати оператор ``as``, щоб спробувати привести тип об'єкта. Потім вам потрібно буде перевірити, чи було приведення успішним, підтвердивши, що змінній було присвоєно тип:
zh_hant: 或者，你可以先宣告一個變數，並使用 ``as`` 運算子嘗試轉型。接著檢查該變數是否已被賦值，以確認轉型是否成功：

source: ``UNSAFE_CAST`` warning
fr: Avertissement ``UNSAFE_CAST``
ga: Rabhadh ``UNSAFE_CAST``
it: Avvertimento ``UNSAFE_CAST``
ru: Предупреждение ``UNSAFE_CAST``
ta: `` பாதுகாப்பற்ற_ காச்ட்`` எச்சரிக்கை
uk: Попередження ``UNSAFE_CAST``
zh_hant: ``UNSAFE_CAST`` 警告

source: In this example, we would like the label connected to an object entering our collision area to show the area's name. Once the object enters the collision area, the physics system sends a signal with a ``Node2D`` object, and the most straightforward (but not statically typed) solution to do what we want could be achieved like this:
it: In questo esempio, vorremmo che l'etichetta collegata a un oggetto che entra nella nostra area di collisione ne mostrasse il nome. Una volta che l'oggetto entra nell'area di collisione, il sistema di fisica invia un segnale con un oggetto ``Node2D`` e la soluzione più diretta (ma non staticamente tipizzata) per ottenere ciò che desideriamo si potrebbe ottenere in questo modo:
ru: В этом примере мы хотим, чтобы метка, прикреплённая к объекту, входящему в область столкновения, отображала название этой области. Как только объект попадает в область столкновения, физическая система отправляет сигнал с объектом ``Node2D``, и наиболее простое (но не статически типизированное) решение для достижения нашей цели можно реализовать следующим образом:
ta: இந்த எடுத்துக்காட்டில், எங்கள் மோதல் பகுதிக்குள் நுழையும் ஒரு பொருளுடன் இணைக்கப்பட்ட சிட்டை இப்பகுதியின் பெயரைக் காட்ட விரும்புகிறோம். பொருள் மோதல் பகுதிக்குள் நுழைந்ததும், இயற்பியல் அமைப்பு ஒரு `` node2d`` பொருளைக் கொண்ட ஒரு சமிக்ஞையை அனுப்புகிறது, மேலும் நாம் விரும்பியதைச் செய்வதற்கான மிகவும் நேரடியான (ஆனால் சட்டப்பூர்வமாக தட்டச்சு செய்யப்படவில்லை) தீர்வு இப்படி அடையப்படலாம்:
uk: У цьому прикладі ми хочемо, щоб мітка, пов'язана з об'єктом, що входить у нашу область зіткнення, відображала назву цієї області. Щойно об'єкт потрапляє в область зіткнення, фізична система надсилає сигнал з об'єктом ``Node2D``, і найпростіше (але не статично типізоване) рішення для досягнення бажаного результату можна отримати таким чином:
zh_hant: 在此例中，我們希望當有物件進入碰撞區域時，與該物件關聯的標籤能顯示此區域的名稱。當物件進入碰撞區域時，物理系統會送出帶有 ``Node2D`` 物件的訊號；最直接（但不是靜態型別）的作法如下：

source: This piece of code produces an ``UNSAFE_PROPERTY_ACCESS`` warning because ``label`` is not defined in ``Node2D``. To solve this, we could first check if the ``label`` property exist and cast it to type ``Label`` before settings its text property like so:
it: Questo frammento di codice genera un avvertimento ``UNSAFE_PROPERTY_ACCESS`` perché ``label`` non è definito in ``Node2D``. Per risolvere questo problema, potremmo prima verificare se la proprietà ``label`` esiste e convertirla al tipo ``Label`` prima di impostare la sua proprietà text, in questo modo:
ru: Этот фрагмент кода выдаёт предупреждение ``UNSAFE_PROPERTY_ACCESS``, поскольку ``label`` не определено в ``Node2D``. Чтобы решить эту проблему, можно сначала проверить, существует ли свойство ``label``, и привести его к типу ``Label``, прежде чем задавать его свойство text, например:
ta: இந்த குறியீடு ஒரு `` பாதுகாப்பற்ற_பிராபர்ட்டி_செச்`` எச்சரிக்கையை உருவாக்குகிறது, ஏனெனில் `` லேபிள்`` `` node2d`` இல் வரையறுக்கப்படவில்லை. இதைத் தீர்க்க, முதலில் `` லேபிள்`` சொத்து இருக்கிறதா என்று சரிபார்த்து, அதன் உரை சொத்தை அமைப்பதற்கு முன்பு `` லேபிள்`` தட்டச்சு செய்ய அதை அனுப்பலாம்:
uk: Цей фрагмент коду видає попередження ``UNSAFE_PROPERTY_ACCESS``, оскільки властивість ``label`` не визначена в ``Node2D``. Щоб вирішити цю проблему, ми можемо спочатку перевірити, чи існує властивість ``label``, і привести її до типу ``Label``, перш ніж встановлювати її властивість text ось так:
zh_hant: 這段程式碼會產生 ``UNSAFE_PROPERTY_ACCESS`` 警告，因為 ``Node2D`` 中未定義 ``label``。要解決這點，可以先檢查 ``label`` 屬性是否存在，並在設定其文字屬性之前將其轉型為 ``Label``：

source: However, this produces an ``UNSAFE_CAST`` warning because ``body.label`` is of a ``Variant`` type. To safely get the property in the type you want, you can use the ``Object.get()`` method which returns the object as a ``Variant`` value or returns ``null`` if the property doesn't exist. You can then determine whether the property contains an object of the right type using the ``is`` keyword, and finally declare a statically typed variable with the object:
it: Tuttavia, questo genera un avvertimento ``UNSAFE_CAST`` perché ``body.label`` è di tipo ``Variant``. Per ottenere in modo sicuro la proprietà nel tipo desiderato, è possibile utilizzare il metodo ``Object.get()`` che restituisce l'oggetto sotto forma di un valore ``Variant`` o restituisce ``null`` se la proprietà non esiste. È quindi possibile determinare se la proprietà contiene un oggetto del tipo corretto tramite la parola chiave ``is`` e infine dichiarare una variabile staticamente tipizzata con l'oggetto:
ru: Однако это приводит к предупреждению ``UNSAFE_CAST``, поскольку ``body.label`` имеет тип ``Variant``. Чтобы безопасно получить свойство нужного типа, можно использовать метод ``Object.get()``, который возвращает объект как значение ``Variant`` или ``null``, если свойство не существует. Затем можно определить, содержит ли свойство объект нужного типа, с помощью ключевого слова ``is``, и, наконец, объявить статически типизированную переменную с этим объектом:
ta: இருப்பினும், இது ஒரு `` பாதுகாப்பற்ற_காண்`` எச்சரிக்கையை உருவாக்குகிறது, ஏனெனில் `` body.label`` ஒரு `` மாறுபாடு`` வகையாகும். நீங்கள் விரும்பும் வகையை பாதுகாப்பாகப் பெற, நீங்கள் `` `மாறுபாடு`` `` முறையைப் பயன்படுத்தலாம், இது பொருளை `` மாறுபாடு` `மதிப்பாக வழங்குகிறது அல்லது சொத்து இல்லையென்றால்` `பூச்ய`` திருப்பித் தருகிறது. `` `` முக்கிய சொல்லைப் பயன்படுத்தி சொத்து சரியான வகையின் ஒரு பொருளைக் கொண்டிருக்கிறதா என்பதை நீங்கள் தீர்மானிக்க முடியும், இறுதியாக பொருளுடன் நிலையான தட்டச்சு செய்யப்பட்ட மாறியை அறிவிக்கவும்:
uk: Однак, це призводить до появи попередження ``UNSAFE_CAST``, оскільки ``body.label`` має тип ``Variant``. Щоб безпечно отримати властивість потрібного типу, можна скористатися методом ``Object.get()``, який повертає об'єкт як значення ``Variant`` або повертає ``null``, якщо властивість не існує. Потім можна визначити, чи містить властивість об'єкт потрібного типу, використовуючи ключове слово ``is``, і, нарешті, оголосити статично типізовану змінну з об'єктом:
zh_hant: 不過，這會產生 ``UNSAFE_CAST`` 警告，因為 ``body.label`` 的型別是 ``Variant``。要安全地以你想要的型別取得該屬性，可以使用 ``Object.get()`` 方法取得它；該方法會回傳 ``Variant`` 值，若屬性不存在則回傳 ``null``。接著使用 ``is`` 關鍵字判斷是否為正確型別，最後以該物件宣告一個靜態型別變數：

source: Cases where you can't specify types
fr: Cas dans lesquels vous ne pouvez pas spécifier de types
ga: Cásanna nach féidir leat cineálacha a shonrú
it: Casi in cui non è possibile specificare i tipi
ru: Случаи, когда невозможно указать типы
ta: நீங்கள் வகைகளைக் குறிப்பிட முடியாத வழக்குகள்
uk: Випадки, коли ви не можете вказати типи
zh_hant: 無法指定型別的情境

source: To wrap up this introduction, let's mention cases where you can't use type hints. This will trigger a **syntax error**.
fr: Pour conclure cette introduction, mentionnons les cas où vous ne pouvez pas utiliser les indications de type. Cela déclenchera une **erreur de syntaxe**.
ga: Chun an réamhrá seo a fhilleadh, luaimis cásanna nach féidir leat leideanna cineál a úsáid. Spreagfaidh sé seo earráid**comhréireach**.
it: Per concludere questa introduzione, accenniamo ai casi in cui non è possibile utilizzare i suggerimenti di tipi. Questo genererà un **errore di sintassi**.
ru: В заключение этого введения рассмотрим случаи, когда использовать подсказки типов нельзя. Это приведёт к **синтаксической ошибке**.
ta: இந்த அறிமுகத்தை மடக்குவதற்கு, நீங்கள் வகை குறிப்புகளைப் பயன்படுத்த முடியாத நிகழ்வுகளைக் குறிப்பிடுவோம். இது ** தொடரியல் பிழையைத் தூண்டும் **.
uk: Підсумовуючи цей вступ, давайте згадаємо випадки, коли ви не можете використовувати підказки типу. Це викличе **синтаксичну помилку**.
zh_hant: 最後補充無法使用型別提示的情況。以下做法都會造成 **語法錯誤** 。

source: You can't specify the type of individual elements in an array or a dictionary:
it: Non è possibile specificare il tipo di singoli elementi in un array o in un dizionario:
ru: Вы не можете указать тип отдельных элементов в массиве или словаре:
ta: ஒரு வரிசை அல்லது அகராதியில் தனிப்பட்ட கூறுகளின் வகையை நீங்கள் குறிப்பிட முடியாது:
uk: Ви не можете вказати тип окремих елементів у масиві або словнику:
zh_hant: 你不能為陣列或字典的個別元素指定型別：

source: Nested types are not currently supported:
it: I tipi annidati non sono attualmente supportati:
ru: Вложенные типы в настоящее время не поддерживаются:
ta: உள்ளமை வகைகள் தற்போது ஆதரிக்கப்படவில்லை:
uk: Вкладені типи наразі не підтримуються:
zh_hant: 目前不支援巢狀型別：

source: Summary
fr: Résumé
ga: Achoimre
it: Riepilogo
ru: Подведение итогов
ta: சுருக்கம்
uk: Підсумок
zh_hant: 總結

source: Typed GDScript is a powerful tool. It helps you write more structured code, avoid common errors, and create scalable and reliable systems. Static types improve GDScript performance and more optimizations are planned for the future.
fr: GDScript typé est un outil puissant. Il vous aide à écrire du code plus structuré, à éviter les erreurs courantes et à créer des systèmes évolutifs et fiables. Les types statiques améliorent les performances de GDScript et d'autres optimisations sont prévues à l'avenir.
ga: Is uirlis chumhachtach é GDScript Clóscríofa. Cabhraíonn sé leat cód níos struchtúrtha a scríobh, earráidí coitianta a sheachaint, agus córais inscálaithe iontaofa a chruthú. Feabhsaíonn cineálacha statacha feidhmíocht GDScript agus tá níos mó optimizations beartaithe don todhchaí.
it: GDScript tipizzato è uno strumento potente. Aiuta a scrivere codice più strutturato, evitare errori comuni e creare sistemi scalabili e affidabili. I tipi statici migliorano le prestazioni di GDScript e sono previste ulteriori ottimizzazioni per il futuro.
ru: Типизированный GDScript — мощный инструмент. Он помогает писать более структурированный код, избегать распространённых ошибок и создавать масштабируемые и надёжные системы. Статические типы повышают производительность GDScript, и в будущем планируется дальнейшая оптимизация.
ta: தட்டச்சு செய்யப்பட்ட GDSCRIPT ஒரு சக்திவாய்ந்த கருவியாகும். இது மேலும் கட்டமைக்கப்பட்ட குறியீட்டை எழுதவும், பொதுவான பிழைகளைத் தவிர்க்கவும், அளவிடக்கூடிய மற்றும் நம்பகமான அமைப்புகளை உருவாக்கவும் உதவுகிறது. நிலையான வகைகள் GDSCRIPT செயல்திறனை மேம்படுத்துகின்றன, மேலும் எதிர்காலத்திற்காக அதிக மேம்படுத்தல்கள் திட்டமிடப்பட்டுள்ளன.
uk: Типізований GDScript є потужним інструментом. Це допомагає вам писати більш структурований код, уникати поширених помилок і створювати масштабовані та надійні системи. Статичні типи покращують продуктивність GDScript, і на майбутнє планується більше оптимізацій.
zh_hant: 靜態型別的 GDScript 是一項強大的工具。它能幫助你寫出結構更清晰的程式、減少常見錯誤，並建立更具擴充性與可靠性的系統。靜態型別也能提升 GDScript 效能，未來還會有更多最佳化。

source: Imagine you're programming an inventory system. You code an ``Item`` class, then an ``Inventory``. To add items to the inventory, the people who work with your code should always pass an ``Item`` to the ``Inventory.add()`` method. With types, you can enforce this::
fr: Imaginons que vous programmez un système d’inventaire. Vous codez une classe ``Item``, puis un ``Inventaire``. Pour ajouter des éléments à l'inventaire, les personnes qui travaillent avec votre code doivent toujours passer un ``Item`` à la méthode ``Inventaire.add()``. Avec les types, vous pouvez imposer ceci :
ga: Samhlaigh go bhfuil córas fardail á chlárú agat. Códaíonn tú rang ``Mír ``, ansin ``Fardal``. Chun míreanna a chur leis an bhfardal, ba chóir do dhaoine a oibríonn le do chód ``Item ``a chur ar aghaidh chuig an modh ``Inventory.add () `i gcónaí. Le cineálacha, is féidir leat é seo a fhorfheidhmiú:

source: To define the type of a variable, parameter, or constant, write a colon after the name, followed by its type. E.g. ``var health: int``. This forces the variable's type to always stay the same::
fr: Pour définir le type d'une variable, d'un paramètre ou d'une constante, écrivez deux points après le nom de la variable, suivi de son type. Par exemple : ``var health: int``. Ceci force le type de la variable à rester toujours le même : :
ga: Chun cineál athróg, paraiméadar nó tairiseach a shainiú, scríobh colon tar éis an ainm, agus a chineál ina dhiaidh sin. Mar shampla ``var shláinte: int``. Cuireann sé seo iallach ar chineál an athróg fanacht mar an gcéanna i gcónaí::

source: Godot will try to infer types if you write a colon, but you omit the type::
fr: Godot essaiera de déduire les types si vous écrivez deux points, mais que vous omettez le type ::
ga: Déanfaidh Godot iarracht cineálacha a thabhairt amach má scríobhann tú colon, ach fágann tú an cineál:

source: You can use any class, including your custom classes, as types. There are two ways to use them in scripts. The first method is to preload the script you want to use as a type in a constant::
fr: Vous pouvez utiliser n'importe quelle classe, y compris vos classes personnalisées, en tant que types. Il y a deux façons de les utiliser dans des scripts. La première méthode consiste à précharger le script que vous voulez utiliser comme type dans une constante ::
ga: Is féidir leat aon rang a úsáid, lena n-áirítear do ranganna saincheaptha, mar chineálacha. Tá dhá bhealach ann chun iad a úsáid i scripteanna. Is é an chéad mhodh ná an script a theastaíonn uait a úsáid mar chineál i dtairiseach a réamh-luchtú:

source: The second method is to use the ``class_name`` keyword when you create. For the example above, your ``rifle.gd`` would look like this::
fr: La seconde méthode consiste à utiliser le mot-clé ``class_name`` lors de la création. Pour l'exemple ci-dessus, votre ``rifle.gd`` ressemblerait à ceci ::
ga: Is é an dara modh ná an eochairfhocal `class_name`` a úsáid nuair a chruthaíonn tú. Mar an sampla thuas, bheadh cuma seo ar do `rifle.gd``:

source: If you use ``class_name``, Godot registers the ``Rifle`` type globally in the editor, and you can use it anywhere, without having to preload it into a constant::
fr: Si vous utilisez ``class_name``, Godot enregistre globalement le type ``Rifle`` dans l'éditeur et vous pouvez l'utiliser n'importe où, sans avoir à le précharger dans une constante ::
ga: Má úsáideann tú ``class_name``, cláraíonn Godot an cineál ``Rifle`` ar fud an domhain san eagarthóir, agus is féidir leat é a úsáid in áit ar bith, gan é a réamh-luchtú isteach i dtairiseach:

source: To define the return type of a function, write a dash and a right angle bracket ``->`` after its declaration, followed by the return type::
fr: Pour définir le type de retour d'une fonction, écrivez un tiret et un signe supérieur ``->`` après sa déclaration, suivi du type de retour ::
ga: Chun cineál fillte feidhme a shainiú, scríobh dash agus lúibín dronuillinn ``->`` tar éis é a dhearbhú, agus an cineál fillte ina dhiaidh::

source: The type ``void`` means the function does not return anything. You can use any type, as with variables::
fr: Le type ``void`` signifie que la fonction ne renvoie rien. Vous pouvez utiliser n'importe quel type, comme pour les variables ::
ga: Ciallaíonn an cineál ``void`` nach bhfilleann an fheidhm aon rud ar ais. Is féidir leat aon chineál a úsáid, mar atá le hathróga:

source: You can also use your own classes as return types::
fr: Vous pouvez également utiliser vos propres classes comme types de retour ::
ga: Is féidir leat do ranganna féin a úsáid freisin mar chineálacha tuairisceáin:

source: Example::
fr: Exemple ::
ga: Sampla::

source: Since Godot 4.2, you can also specify a type for the loop variable in a ``for`` loop. For instance, you can write::
fr: Depuis Godot 4.2, vous pouvez également spécifier un type pour la variable de boucle dans une boucle ``for``. Par exemple, vous pouvez écrire ::
ga: Ós rud é go Godot 4.2, is féidir leat cineál a shonrú don athróg lúb i lúb ``for ``. Mar shampla, is féidir leat scríobh:

source: You can check if this ``PhysicsBody2D`` is your ``Player`` with the ``as`` keyword, and using the colon ``:`` again to force the variable to use this type. This forces the variable to stick to the ``PlayerController`` type::
fr: Vous pouvez vérifier si ce ``PhysicsBody2D`` est votre joueur avec le mot-clé de conversion ``as`` , et utiliser à nouveau les deux points ``:`` pour forcer la variable à utiliser ce type. Ceci force la variable à s'en tenir au type ``PlayerController`` ::
ga: Is féidir leat a sheiceáil an é an `PhysicsBody2D`` seo do ``Player`` leis an eochairfhocal ``as ``, agus an colon``: ``á úsáid arís chun iallach a chur ar an athróg an cineál seo a úsáid. Cuireann sé seo iallach ar an athróg cloí leis an gcineál ``PlayerController``:

source: The ``as`` keyword silently casts the variable to ``null`` in case of a type mismatch at runtime, without an error/warning. While this may be convenient in some cases, it can also lead to bugs. Use the ``as`` keyword only if this behavior is intended. A safer alternative is to use the ``is`` keyword::
fr: Le mot-clé ``as`` convertit silencieusement la variable en ``null`` en cas d'incompatibilité de type lors de l'exécution, sans erreur/avertissement. Bien que cela puisse être pratique dans certains cas, cela peut également entraîner des bogues. Utilisez le mot-clé ``as`` uniquement si ce comportement est prévu. Une alternative plus sûre consiste à utiliser le mot-clé ``is`` ::
ga: Casann an eochairfhocal ``as`` an athróg go `` null`` go ciúin i gcás neamhréir chineál ag am rite, gan earráid/rabhadh. Cé go bhféadfadh sé seo a bheith áisiúil i gcásanna áirithe, is féidir go dtiocfadh fabhtanna air freisin. Bain úsáid as an eochairfhocal ``as`` ach amháin má tá an t-iompar seo beartaithe. Rogha eile níos sábháilte ná an eochairfhocal ``is`` a úsáid::

source: or ``assert()`` statement::
fr: ou l'instruction ``assert()`` ::

source: Safe lines do not always mean better or more reliable code. See the note above about the ``as`` keyword. For example::
fr: Les lignes sécurisées ne signifient pas toujours un code meilleur ou plus fiable. Voir la note ci-dessous sur le mot-clé ``as``. Par exemple ::
ga: Ní chiallaíonn línte sábháilte cód níos fearr nó níos iontaofa i gcónaí. Féach an nóta thuas faoin eochairfhocal ``as ``. Mar shampla::

source: Typed code takes a little more writing, but you get the benefits we discussed above. Here's an example of the same, empty script, in a dynamic style::
fr: Le code typé prend un peu plus de temps à écrire, mais vous bénéficiez des avantages décrits plus haut. Voici un exemple du même script vide, dans un style dynamique ::
ga: Tógann cód clóscríofa beagán níos mó scríbhneoireachta, ach faigheann tú na buntáistí a phléamar thuas. Seo sampla den script folamh céanna, i stíl dhinimiciúil:

source: And with static typing::
fr: Et avec le typage statique ::
ga: Agus le clóscríobh statach::

source: As you can see, you can also use types with the engine's virtual methods. Signal callbacks, like any methods, can also use types. Here's a ``body_entered`` signal in a dynamic style::
fr: Comme vous pouvez le voir, vous pouvez également utiliser des types avec les méthodes virtuelles du moteur. Les rappels de signaux, comme toutes les méthodes, peuvent également utiliser des types. Voici un signal ``body_entered`` dans un style dynamique :::
ga: Mar a fheiceann tú, is féidir leat cineálacha a úsáid le modhanna fíorúla an innill freisin. Is féidir le glaonna comharthaí, cosúil le haon mhodhanna, cineálacha a úsáid freisin. Seo comhartha ``body_entered ``i stíl dhinimiciúil::

source: And the same callback, with type hints::
fr: Et le même rappel, avec des indications de type ::
ga: Agus an glaoch ar ais céanna, le leideanna cineál::
