Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/static_typing.po
Languages: fr, ga, it, ru, ta, uk, zh_hant

source: You can use casting to tell Godot the type you expect when you get a node: ``($Timer as Timer)``, ``($Player as CharacterBody2D)``, etc. Godot will ensure the type works and if so, the line number will turn green at the left of the script editor.
fr: Vous pouvez utiliser la conversion de type pour dire à Godot le type que vous attendez lorsque vous obtenez un nœud : ``($Timer as Timer)``, ``($Player as CharacterBody2D)``, etc. Godot s'assurera que le type fonctionne et si c'est le cas, le numéro de ligne deviendra vert à gauche de l'éditeur de script.
ga: Is féidir leat réitigh a úsáid chun a insint do Godot an cineál a bhfuil súil agat nuair a gheobhaidh tú nód: ``($Timer as Timer)``, ``($ Player as CharacterBody2D)``, srl Cinnteoidh Godot an cineál agus más amhlaidh, casfaidh an uimhir líne glas ar thaobh clé den eagarthóir script.
it: È possibile utilizzare il casting per indicare a Godot il tipo che ci si aspetta quando si ottiene un nodo: ``($Timer as Timer)``, ``($Player as CharacterBody2D)``, ecc. Godot si assicurerà che il tipo funzioni e, in tal caso, il numero di riga diventerà verde a sinistra dell'editor di script.
ru: Вы можете использовать приведение типов, чтобы сообщить Godot, какой тип вы ожидаете при получении узла: ``($Timer as Timer)``, ``($Player as CharacterBody2D)`` и т. д. Godot проверит, работает ли тип, и если это так, номер строки в левой части редактора скриптов станет зеленым.
ta: நீங்கள் ஒரு முனையைப் பெறும்போது நீங்கள் எதிர்பார்க்கும் வகையைச் சொல்ல நீங்கள் வார்ப்பைப் பயன்படுத்தலாம்: `` ($ நேரங்குறிகருவி டைமராக) ``, `` `(` பிளேயர் ரேசன்போடி 2 டி) `` போன்றவை. , வரி எண் ச்கிரிப்ட் எடிட்டரின் இடதுபுறத்தில் பச்சை நிறமாக மாறும்.
uk: Ви можете використовувати кастинг, щоб повідомити Godot тип, який ви очікуєте, коли отримаєте вузол: ``($Timer як Timer)``, ``($Player як CharacterBody2D)`` тощо. Godot переконається, що тип працює, і якщо так, номер рядка стане зеленим ліворуч від редактора сценаріїв.
zh_hant: 你可以用型別轉換讓 Godot 知道你預期取得什麼型別的節點，例如 ``($Timer as Timer)``、``($Player as CharacterBody2D)`` 等。Godot 會檢查型別是否正確，如果正確，腳本編輯器左側的行號會變綠色。

source: Unsafe vs Safe Line
fr: Ligne dangereuse contre ligne sûre
ga: Líne Neamhshábháilte vs S
it: Confronto tra riga non sicura e sicura
ru: Небезопасная и Безопасная Линия
ta: பாதுகாப்பற்ற Vs பாதுகாப்பான வரி
uk: Небезпечна проти безпечної лінії
zh_hant: 不安全 v.s. 安全行

source: Unsafe line (line 7) vs Safe Lines (line 6 and 8)
fr: Ligne non sécurisée (ligne 7) contre ligne sécurisée (lignes 6 et 8)
ga: Líne neamhshábháilte (líne 7) vs Línte Sábháilte (líne 6 agus 8)
it: Riga non sicura (riga 7) contro righe sicure (righe 6 e 8)
ru: Небезопасная строка (строка 7) против Безопасных Строк (строки 6 и 8)
ta: பாதுகாப்பற்ற வரி (வரி 7) vs பாதுகாப்பான கோடுகள் (வரி 6 மற்றும் 8)
uk: Небезпечний рядок (рядок 7) проти безпечних рядків (рядки 6 та 8)
zh_hant: 不安全行（第 7 行）v.s. 安全行（第 6、8 行）

source: Safe lines do not always mean better or more reliable code. See the note above about the ``as`` keyword. For example:
it: Le righe sicure non sempre significano codice migliore o più affidabile. Consultare la nota precedente sulla parola chiave ``as``. Per esempio:
ru: Безопасные строки не всегда означают лучший или более надёжный код. См. примечание выше о ключевом слове ``as``. Например:
ta: பாதுகாப்பான கோடுகள் எப்போதும் சிறந்த அல்லது நம்பகமான குறியீட்டைக் குறிக்காது. `` ஆச்` முக்கிய சொல்லைப் பற்றி மேலே உள்ள குறிப்பைக் காண்க. உதாரணமாக:
uk: Безпечні рядки не завжди означають кращий або надійніший код. Дивіться примітку вище щодо ключового слова ``as``. Наприклад:
zh_hant: 所謂的安全行並不一定代表程式碼更好或更可靠；請參考上面關於 ``as`` 關鍵字的說明。例如：

source: Even though ``node_2`` declaration is marked as an unsafe line, it is more reliable than ``node_1`` declaration. Because if you change the node type in the scene and accidentally forget to change it in the script, the error will be detected immediately when the scene is loaded. Unlike ``node_1``, which will be silently cast to ``null`` and the error will be detected later.
fr: Même si la déclaration ``node_2`` est marquée comme une ligne non sécurisée, elle est plus fiable que la déclaration ``node_1``. En effet, si vous modifiez le type de nœud dans la scène et oubliez accidentellement de le modifier dans le script, l'erreur sera détectée immédiatement lors du chargement de la scène. Contrairement à ``node_1``, qui sera silencieusement converti en ``null`` et l'erreur sera détectée plus tard.
ga: Cé go bhfuil dearbhú `node_2`` marcáilte mar líne neamhshábháilte, tá sé níos iontaofa ná dearbhú `node_1'. Toisc má athraíonn tú an cineál nód sa radharc agus má dhéanann tú dearmad de thaisme é a athrú sa script, braithfear an earráid láithreach nuair a luchtaítear an radharc. Murab ionann agus `node_1``, a chaithfear go ciúin go ``null`` agus braithfear an earráid níos déanaí.
it: Sebbene la dichiarazione di ``node_2`` sia contrassegnata come riga non sicura, è più affidabile della dichiarazione di ``node_1``. Infatti, se si modifica il tipo di nodo nella scena e si dimentica accidentalmente di modificarlo nello script, l'errore verrà rilevato immediatamente al caricamento della scena. A differenza di ``node_1``, che verrà automaticamente convertito in ``null`` e l'errore verrà rilevato dopo.
ru: Несмотря на то, что объявление ``node_2`` отмечено как небезопасное, оно надёжнее объявления ``node_1``. Если вы измените тип узла в сцене и случайно забудете изменить его в скрипте, ошибка будет обнаружена сразу при загрузке сцены. В отличие от ``node_1``, которое будет автоматически преобразовано в ``null``, и ошибка будет обнаружена позже.
ta: `` Node_2`` அறிவிப்பு பாதுகாப்பற்ற வரியாக குறிக்கப்பட்டிருந்தாலும், இது `` node_1`` அறிவிப்பை விட நம்பகமானது. ஏனெனில் நீங்கள் காட்சியில் முனை வகையை மாற்றி, தற்செயலாக ச்கிரிப்டில் அதை மாற்ற மறந்துவிட்டால், காட்சி ஏற்றப்பட்டவுடன் பிழை உடனடியாக கண்டறியப்படும். `` Node_1`` போலல்லாமல், இது அமைதியாக `` NULL`` க்கு அனுப்பப்படும், பின்னர் பிழை கண்டறியப்படும்.
uk: Незважаючи на те, що декларація ``node_2`` позначена як небезпечний рядок, вона надійніша, ніж декларація ``node_1``. Тому що якщо ви зміните тип вузла в сцені і випадково забудете змінити його в сценарії, помилка буде виявлена відразу після завантаження сцени. На відміну від `` node_1 ``, який буде мовчки приведений до `` null``, і помилка буде виявлена пізніше.
zh_hant: 即使 ``node_2`` 宣告被標記為不安全，但其實比 ``node_1`` 更可靠。因為如果你在場景裡變更節點型別，在腳本裡沒同步更新，載入場景時會立刻報錯。反之，``node_1`` 會靜默被轉成 ``null``，錯誤會延後發現。

source: You can turn off safe lines or change their color in the editor settings.
fr: Vous pouvez désactiver les lignes sécurisées ou modifier leur couleur dans les paramètres de l'éditeur.
ga: Is féidir leat línte sábháilte a mhúchadh nó a dath a athrú i socruithe an eagarthóra.
it: È possibile disattivare le righe sicure o modificarne il colore nelle impostazioni dell'editor.
ru: Вы можете отключить безопасные строки или изменить их цвет в настройках редактора.
ta: நீங்கள் பாதுகாப்பான வரிகளை அணைக்கலாம் அல்லது ஆசிரியர் அமைப்புகளில் அவற்றின் நிறத்தை மாற்றலாம்.
uk: Ви можете вимкнути безпечні рядки, або змінити їх колір у налаштуваннях редактора.
zh_hant: 你可以在編輯器設定中關閉安全行功能，或改變其顏色。

source: Typed or dynamic: stick to one style
fr: Typé ou dynamique : s'en tenir à un style
ga: Clóscríofa nó dinimiciúil: cloí le stíl amháin
it: Tipizzazione statica o dinamica: attieniti a un unico stile
ru: Типизированный или динамичный: придерживайтесь одного стиля
ta: தட்டச்சு செய்யப்பட்ட அல்லது மாறும்: ஒரு பாணியில் ஒட்டிக்கொள்க
uk: Типізований, або динамічний: дотримуйтеся одного стилю
zh_hant: 靜態型別或動態型別：建議統一風格

source: Typed GDScript and dynamic GDScript can coexist in the same project. But it's recommended to stick to either style for consistency in your codebase, and for your peers. It's easier for everyone to work together if you follow the same guidelines, and faster to read and understand other people's code.
fr: Le GDScript typé et le GDScript dynamique peuvent coexister dans le même projet. Mais il est préférable de s'en tenir à l'un ou l'autre pour assurer la cohérence de votre base de code et pour vos pairs. Il est plus facile pour tout le monde de travailler ensemble si vous suivez les mêmes lignes directrices, et plus rapide pour lire et comprendre le code des autres.
ga: Is féidir le GDScript clóscríofa agus GDScript dinimiciúil a bheith taobh istigh den tionscadal céanna. Ach moltar cloí le ceachtar den dá stíl ar mhaithe le comhsheasmhacht i do bhunachar cód, agus do chomhghleacaithe. Tá sé níos éasca do gach duine oibriú le chéile má leanann tú na treoirlínte céanna, agus níos tapúla chun cód daoine eile a léamh agus a thuiscint.
it: GDScript tipizzato staticamente e GDScript tipizzato dinamicamente possono coesistere nello stesso progetto. Tuttavia, è consigliabile attenersi a uno dei due stili per garantire coerenza nel codice, e per altri colleghi. È più facile per tutti lavorare insieme se si seguono le stesse linee guida, e leggere e capire il codice degli altri diventa più veloce.
ru: Типизированный GDScript и динамический GDScript могут сосуществовать в одном проекте. Но рекомендуется придерживаться единого стиля написания вашего кода. Всем будет проще понимать код, если все будет использоваться единый стиль написания.
ta: தட்டச்சு செய்யப்பட்ட GDSCRIPT மற்றும் மாறும் சி.டி.எச்ச்கிரிப்ட் அதே திட்டத்தில் இணைந்து வாழ முடியும். ஆனால் உங்கள் கோட்பேசில் நிலைத்தன்மைக்காகவும், உங்கள் சகாக்களுக்காகவும் பாணியில் ஒட்டிக்கொள்ள பரிந்துரைக்கப்படுகிறது. நீங்கள் ஒரே வழிகாட்டுதல்களைப் பின்பற்றினால், மற்றவர்களின் குறியீட்டைப் படித்து புரிந்துகொள்வது விரைவாகவும், விரைவாகவும் ஒன்றாக வேலை செய்வது எளிதானது.
uk: Типізований GDScript і динамічний GDScript можуть співіснувати в одному проекті. Але радимо дотримуватися будь-якого стилю для узгодженості вашої кодової бази та для ваших аналогів. Усім легше працювати разом, якщо ви дотримуєтеся однакових інструкцій, і швидше читати та розуміти код інших людей.
zh_hant: 靜態型別和動態型別的 GDScript 可以在同一個專案共存，但建議你選擇一種風格統一使用，有助於團隊協作和維護。大家遵循同一套規範，彼此閱讀、理解程式碼會更有效率。

source: Typed code takes a little more writing, but you get the benefits we discussed above. Here's an example of the same, empty script, in a dynamic style:
it: Il codice tipizzato richiede un po' più da scrivere, ma si ottengono i vantaggi di cui abbiamo parlato sopra. Ecco un esempio dello stesso script vuoto, in stile dinamico:
ru: Типизированный код требует немного больше времени на написание, но вы получаете те же преимущества, о которых мы говорили выше. Вот пример того же пустого скрипта в динамическом стиле:
ta: தட்டச்சு செய்யப்பட்ட குறியீடு இன்னும் கொஞ்சம் எழுத்தை எடுக்கும், ஆனால் நாங்கள் மேலே விவாதித்த நன்மைகளைப் பெறுவீர்கள். மாறும் பாணியில், அதே, வெற்று ச்கிரிப்ட்டின் எடுத்துக்காட்டு இங்கே:
uk: Типізований код потребує трохи більше написання, але ви отримуєте переваги, які ми обговорювали вище. Ось приклад того ж, порожнього скрипта, в динамічному стилі:
zh_hant: 帶型別的寫法會多一些字，但你能獲得上述的好處。以下是相同的空白腳本，以動態風格撰寫：

source: And with static typing:
it: E con la tipizzazione statica:
ru: И со статической типизацией:
ta: மற்றும் நிலையான தட்டச்சு:
uk: А зі статичною типізацією:
zh_hant: 改用靜態型別則如下：

source: As you can see, you can also use types with the engine's virtual methods. Signal callbacks, like any methods, can also use types. Here's a ``body_entered`` signal in a dynamic style:
it: Come puoi vedere, puoi usare i tipi anche con i metodi virtuali del motore. Anche i callback dei segnali, come qualsiasi metodo, possono usare i tipi. Ecco un segnale ``body_entered`` in uno stile dinamico:
ru: Как видите, вы также можете использовать типы с виртуальными методами движка. Обратные вызовы сигналов, как и любые методы, также могут использовать типы. Вот сигнал ``body_entered`` в динамическом стиле:
ta: நீங்கள் பார்க்க முடியும் என, இயந்திரத்தின் மெய்நிகர் முறைகளுடன் வகைகளையும் பயன்படுத்தலாம். சிக்னல் கால்பேக்குகள், எந்தவொரு முறைகளையும் போலவே, வகைகளையும் பயன்படுத்தலாம். மாறும் பாணியில் `` body_entered`` சமிக்ஞை இங்கே:
uk: Як бачите, ви також можете використовувати типи з віртуальними методами движка. Зворотні виклики сигналів, як і будь-які методи, також можуть використовувати типи. Ось сигнал ``body_entered`` у динамічному стилі:
zh_hant: 如你所見，也可以在引擎的虛擬方法上使用型別。訊號回呼（和任何方法一樣）也可以使用型別。以下是以動態風格撰寫的 ``body_entered`` 訊號：

source: And the same callback, with type hints:
it: E lo stesso callback, con suggerimenti di tipo:
ru: И тот же обратный вызов, с подсказками типов:
ta: வகை குறிப்புகளுடன் அதே கால்பேக்:
uk: І той самий зворотний виклик, з підказками типу:
zh_hant: 同樣的回呼，加入型別提示：

source: pass
zh_hant: 階段

source: Warning system
fr: Système d'avertissement
ga: Córas rabhaidh
it: Sistema di avvertimento
ru: Система предупреждений
ta: எச்சரிக்கை அமைப்பு
uk: Система попередження
zh_hant: 警告系統

source: Detailed documentation about the GDScript warning system has been moved to :ref:`doc_gdscript_warning_system`.
fr: La documentation sur le système d'avertissement de GDScript a été déplacée vers :ref:`doc_gdscript_warning_system`.
ga: Tá doiciméadú mionsonraithe faoin gcóras rabhaidh GDScript aistrithe chuig: ref: `doc_gdscript_warning_system`.
it: La documentazione dettagliata sul sistema di avvertimento in GDScript è stata spostata in :ref:`doc_gdscript_warning_system`.
ru: Подробная документация о системе предупреждений GDScript перенесена в :ref:`doc_gdscript_warning_system`.
ta: GDSCRIPT எச்சரிக்கை முறையைப் பற்றிய விரிவான ஆவணங்கள் நகர்த்தப்பட்டுள்ளன: Ref: `Doc_gdscript_warning_system`.
uk: Детальну документацію про систему попереджень GDScript переміщено до :ref:`doc_gdscript_warning_system`.
zh_hant: 關於 GDScript 警告系統的詳細說明請參見 :ref:`doc_gdscript_warning_system`。

source: Godot gives you warnings about your code as you write it. The engine identifies sections of your code that may lead to issues at runtime, but lets you decide whether or not you want to leave the code as it is.
it: Godot emette avvertimenti mentre scrivi il tuo codice: il motore identifica sezioni del tuo codice che potrebbero causare problemi in fase di esecuzione, ma lascia a te decidere se mantenere il codice così com'è.
ru: Godot выдаёт предупреждения о вашем коде по мере его написания. Движок выявляет фрагменты кода, которые могут привести к проблемам во время выполнения, но позволяет вам решить, оставить код как есть или нет.
ta: உங்கள் குறியீட்டை நீங்கள் எழுதும்போது கோடோட் உங்களுக்கு எச்சரிக்கைகளைத் தருகிறார். இயக்க நேரத்தில் சிக்கல்களுக்கு வழிவகுக்கும் உங்கள் குறியீட்டின் பிரிவுகளை இயந்திரம் அடையாளம் காட்டுகிறது, ஆனால் நீங்கள் குறியீட்டை அப்படியே விட்டுவிட விரும்புகிறீர்களா இல்லையா என்பதை தீர்மானிக்க அனுமதிக்கிறது.
uk: Godot дає вам попередження про ваш код, коли ви його пишете. Механізм визначає розділи вашого коду, які можуть призвести до проблем під час виконання, але дозволяє вам вирішити, чи бажаєте ви залишити код таким, як він є.
zh_hant: Godot 會在你寫程式時即時顯示警告。引擎會標示出可能在執行時發生問題的程式碼區段，但最終是否要修改還是保留原樣，由你自己決定。

source: We have a number of warnings aimed specifically at users of typed GDScript. By default, these warnings are disabled, you can enable them in Project Settings (**Debug > GDScript**, make sure **Advanced Settings** is enabled).
fr: Nous avons un certain nombre d'avertissements destinés spécifiquement aux utilisateurs de GDScript typé. Par défaut, ces avertissements sont désactivés, vous pouvez les activer dans les paramètres du projet (**Debug > GDScript**, assurez-vous que **Advanced Settings** est activé).
ga: Tá roinnt rabhadh againn atá dírithe go sonrach ar úsáideoirí clóscríofa GDScript. De réir réamhshocraithe, tá na rabhaidh seo díchumasaithe, is féidir leat iad a chumasú i Socruithe an Tionscadail (**Debug> GDScript**, cinntigh go bhfuil **Ardsocruithe** cumasaithe).
it: Esistono una serie di avvisi rivolti specificamente agli utenti di GDScript tipizzato. Normalmente, questi avvisi sono disabilitati; è possibile abilitarli nelle Impostazioni del progetto (**Debug > GDScript**, assicurandosi che **Impostazioni avanzate** sia abilitato).
ru: У нас есть ряд предупреждений, предназначенных специально для пользователей типизированного GDScript. По умолчанию эти предупреждения отключены. Вы можете включить их в настройках проекта (**Debug > GDScript**, убедитесь, что опция **Advanced Settings** включена).
ta: தட்டச்சு செய்யப்பட்ட சி.டி.எச்.ச்கிரிப்ட் பயனர்களை குறிப்பாக இலக்காகக் கொண்ட பல எச்சரிக்கைகள் எங்களிடம் உள்ளன. இயல்பாக, இந்த எச்சரிக்கைகள் முடக்கப்பட்டுள்ளன, அவற்றை திட்ட அமைப்புகளில் இயக்கலாம் (** பிழைத்திருத்தம்> gdscript **, ** மேம்பட்ட அமைப்புகள் ** இயக்கப்பட்டிருப்பதை உறுதிசெய்க).
uk: У нас є низка попереджень, спрямованих саме на користувачів введеного GDScript. За замовчуванням ці попередження вимкнено. Ви можете ввімкнути їх у налаштуваннях проекту (**Debug > GDScript**, переконайтеся, що **Advanced Settings** увімкнено).
zh_hant: 系統中有不少警告特別針對使用靜態型別 GDScript 的用戶。這些警告預設是關閉的，你可以在專案設定（**偵錯 > GDScript**，記得先開啟 **進階設定**）裡啟用。

source: You can enable the ``UNTYPED_DECLARATION`` warning if you want to always use static types. Additionally, you can enable the ``INFERRED_DECLARATION`` warning if you prefer a more readable and reliable, but more verbose syntax.
fr: Vous pouvez activer l'avertissement ``UNTYPED_DECLARATION`` si vous souhaitez toujours utiliser des types statiques. De plus, vous pouvez activer l'avertissement ``INFERRED_DECLARATION`` si vous préférez une syntaxe plus lisible et plus fiable, mais plus détaillée.
ga: Is féidir leat an rabhadh ``UNTYPED_DECLARATION`` a chumasú más mian leat cineálacha statacha a úsáid i gcónaí. Ina theannta sin, is féidir leat an rabhadh ``INFERRED_DECLARATION`` a chumasú más fearr leat comhréir níos inléite agus níos iontaofa, ach níos luaithe.
it: È possibile abilitare l'avvertimento ``UNTYPED_DECLARATION`` se si desidera utilizzare sempre tipi statici. Inoltre, è possibile abilitare l'avvertimento ``INFERRED_DECLARATION`` se si preferisce una sintassi più leggibile e affidabile, ma più verbosa.
ru: Вы можете включить предупреждение ``UNTYPED_DECLARATION``, если хотите всегда использовать статические типы. Кроме того, вы можете включить предупреждение ``INFERRED_DECLARATION``, если предпочитаете более читабельный и надёжный, но более многословный синтаксис.
ta: நீங்கள் எப்போதும் நிலையான வகைகளைப் பயன்படுத்த விரும்பினால் `` wantyped_declaration`` எச்சரிக்கையை இயக்கலாம். கூடுதலாக, நீங்கள் மிகவும் படிக்கக்கூடிய மற்றும் நம்பகமான, ஆனால் மேலும் சொற்களஞ்சியத் தொடரியல் விரும்பினால் `` அனுமானிக்கப்பட்ட_டிக்ளரேசன்`` எச்சரிக்கையை இயக்கலாம்.
uk: Ви можете ввімкнути попередження ``UNTYPED_DECLARATION``, якщо хочете завжди використовувати статичні типи. Крім того, ви можете ввімкнути попередження ``INFERRED_DECLARATION``, якщо ви віддаєте перевагу більш читабельному та надійному, але більш докладному синтаксису.
zh_hant: 如果你想要強制全程使用靜態型別，可以啟用 ``UNTYPED_DECLARATION`` 警告。若你偏好更可讀、更可靠但較冗長的語法，也可以啟用 ``INFERRED_DECLARATION`` 警告。

source: ``UNSAFE_*`` warnings make unsafe operations more noticeable, than unsafe lines. Currently, ``UNSAFE_*`` warnings do not cover all cases that unsafe lines cover.
fr: Les avertissements ``UNSAFE_*`` rendent les opérations non sécurisées plus visibles que les lignes non sécurisées. Actuellement, les avertissements ``UNSAFE_*`` ne couvrent pas tous les cas couverts par les lignes non sécurisées.
ga: Fágann rabhaidh ``UNSAFE_*`` oibríochtaí míshábháilte níos suntasaí, ná línte neamhshábháilte. Faoi láthair, ní chlúdaíonn rabhaidh ``UNSAFE_*`` gach cás a chlúdaíonn línte neamhshábháilte.
it: Gli avvertimenti ``UNSAFE_*`` rendono le operazioni non sicure più evidenti rispetto alle righe non sicure. Attualmente, gli avvertimenti ``UNSAFE_*`` non coprono tutti i casi coperti dalle righe non sicure.
ru: Предупреждения ``UNSAFE_*`` делают небезопасные операции более заметными, чем небезопасные линии. В настоящее время предупреждения ``UNSAFE_*`` не охватывают все случаи, которые покрывают небезопасные линии.
ta: `` பாதுகாப்பற்ற_*`` எச்சரிக்கைகள் பாதுகாப்பற்ற செயல்பாடுகளை பாதுகாப்பற்ற கோடுகளை விட கவனிக்கத்தக்கதாக ஆக்குகின்றன. தற்போது, `` பாதுகாப்பற்ற_*`` எச்சரிக்கைகள் பாதுகாப்பற்ற கோடுகள் மறைக்கும் அனைத்து நிகழ்வுகளையும் மறைக்காது.
uk: Попередження ``UNSAFE_*`` роблять небезпечні операції більш помітними, ніж небезпечні рядки. Наразі попередження ``UNSAFE_*`` не охоплюють усі випадки, які охоплюють небезпечні лінії.
zh_hant: ``UNSAFE_*`` 警告會讓不安全的操作比安全行標記更顯眼。目前 ``UNSAFE_*`` 警告還沒有涵蓋所有安全行會標示的狀況。

source: Common unsafe operations and their safe counterparts
fr: Opérations courantes non sécurisées et leurs équivalents sécurisés
ga: Oibríochtaí coitianta míshábháilte agus a gcomh
it: Operazioni comuni non sicure e le loro controparti sicure
ru: Распространенные небезопасные операции и их безопасные аналоги
ta: பொதுவான பாதுகாப்பற்ற செயல்பாடுகள் மற்றும் அவற்றின் பாதுகாப்பான சகாக்கள்
uk: Поширені небезпечні операції та їхні безпечні аналоги
zh_hant: 常見的不安全操作與對應的安全寫法

source: ``UNSAFE_PROPERTY_ACCESS`` and ``UNSAFE_METHOD_ACCESS`` warnings
fr: Avertissements ``UNSAFE_PROPERTY_ACCESS`` et ``UNSAFE_METHOD_ACCESS``
ga: Rabhadh ``UNSAFE_PROPERTY_ACCESS`` agus ``UNSAFE_METHOD_ACCESS``
it: Avvertimenti ``UNSAFE_PROPERTY_ACCESS`` e ``UNSAFE_METHOD_ACCESS``
ru: Предупреждения ``UNSAFE_PROPERTY_ACCESS`` и ``UNSAFE_METHOD_ACCESS``
ta: `` பாதுகாப்பற்ற_பிரபர்ட்டி_அக்சச்`` மற்றும் `` பாதுகாப்பற்ற_மெதோட்_அக்சச்` எச்சரிக்கைகள்
uk: Попередження ``UNSAFE_PROPERTY_ACCESS`` і ``UNSAFE_METHOD_ACCESS``
zh_hant: ``UNSAFE_PROPERTY_ACCESS`` 和 ``UNSAFE_METHOD_ACCESS`` 警告

source: In this example, we aim to set a property and call a method on an object that has a script attached with ``class_name MyScript`` and that ``extends Node2D``. If we have a reference to the object as a ``Node2D`` (for instance, as it was passed to us by the physics system), we can first check if the property and method exist and then set and call them if they do:
it: In questo esempio, vogliamo impostare una proprietà e chiamare un metodo su un oggetto a cui è associato uno script con ``class_name MyScript`` e che ``extends Node2D``. Se abbiamo un riferimento all'oggetto sotto forma di un ``Node2D`` (ad esempio, come ci è stato passato dal sistema di fisica), possiamo prima verificare se la proprietà e il metodo esistono e poi impostarli e chiamarli in tal caso:
ru: В этом примере мы хотим задать свойство и вызвать метод объекта, к которому прикреплён скрипт с именем ``class_name MyScript``, и который ``extends Node2D``. Если у нас есть ссылка на объект как ``Node2D`` (например, переданная нам системой физики), мы можем сначала проверить, существуют ли свойство и метод, а затем задать и вызвать их, если они есть:
ta: இந்த எடுத்துக்காட்டில், `` class_name myScript`` உடன் இணைக்கப்பட்ட ச்கிரிப்டைக் கொண்ட ஒரு பொருளின் மீது ஒரு சொத்தை அமைத்து, `` Node2d`` ஐ நீட்டிக்கிறது. ஒரு `` node2d`` (உதாரணமாக, இது இயற்பியல் அமைப்பால் நமக்கு அனுப்பப்பட்டதைப் போல) பொருளைப் பற்றிய குறிப்பு இருந்தால், முதலில் சொத்து மற்றும் முறை இருக்கிறதா என்று சரிபார்த்து, அவை செய்தால் அவற்றை அமைத்து அழைக்கலாம்:
uk: У цьому прикладі ми маємо на меті встановити властивість та викликати метод для об'єкта, до якого приєднаний скрипт з назвою ``class_name MyScript``, і який ``розширює Node2D``. Якщо у нас є посилання на об'єкт як ``Node2D`` (наприклад, оскільки його передала нам фізична система), ми можемо спочатку перевірити, чи існують властивість і метод, а потім встановити та викликати їх, якщо вони існують:
zh_hant: 在這個例子中, 我們想要對一個物件設定屬性並呼叫方法; 該物件掛有使用 ``class_name MyScript`` 、且 ``extends Node2D`` 的腳本。若我們手上的參考是 ``Node2D`` (例如由物理系統傳入), 可以先檢查該屬性與方法是否存在, 若存在再設定與呼叫:
