Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/static_typing.po
Languages: fr, ga, it, ru, ta, uk, zh_hant

source: You don't need to write type hints for constants, as Godot sets it automatically from the assigned value. But you can still do so to make the intent of your code clearer. Also, this is useful for typed arrays (like ``const A: Array[int] = [1, 2, 3]``), since untyped arrays are used by default.
fr: Vous n'avez pas besoin d'écrire des indications de type pour les constantes, car Godot les définit automatiquement à partir de la valeur assignée. Mais vous pouvez toujours le faire pour rendre l'intention de votre code plus claire. De plus, cela est utile pour les tableaux typés (comme ``const A: Array[int] = [1, 2, 3]``), car les tableaux non typés sont utilisés par défaut.
ga: Ní gá duit leideanna cineál a scríobh le haghaidh comhsheasmhainní, toisc go socraíonn Godot é go huathoibríoch ón luach sannta. Ach is féidir leat é sin a dhéanamh fós chun rún do chód a dhéanamh níos soiléire. Chomh maith leis sin, tá sé seo úsáideach le haghaidh eagair chlóscríofa (cosúil le ``const A: Array [int] = [1, 2, 3] ``), ós rud é go n-úsáidtear eagair neamhchlóipthe de réir réamhshocraithe.
it: Non è necessario scrivere suggerimenti di tipo per le costanti, poiché Godot le imposta automaticamente in base al valore assegnato. Tuttavia, è comunque possibile farlo per rendere più chiaro l'intento del codice. Inoltre, questo è utile per gli array tipizzati (come ``const A: Array[int] = [1, 2, 3]``), poiché normalmente gli array non sono tipizzati.
ru: Вам не нужно указывать тип констант, поскольку Godot автоматически устанавливает его на основе присвоенного значения. Но вы всё равно можете сделать это, чтобы сделать код более понятным. Кроме того, это полезно для типизированных массивов (например, ``const A: Array[int] = [1, 2, 3]``), поскольку по умолчанию используются нетипизированные массивы.
ta: கோடோட் அதை ஒதுக்கப்பட்ட மதிப்பிலிருந்து தானாக அமைக்கும் என்பதால், மாறிலிகளுக்கான வகை குறிப்புகளை நீங்கள் எழுதத் தேவையில்லை. ஆனால் உங்கள் குறியீட்டின் நோக்கத்தை தெளிவுபடுத்துவதற்கு நீங்கள் இன்னும் அவ்வாறு செய்யலாம். மேலும், இது தட்டச்சு செய்யப்பட்ட வரிசைகளுக்கு பயனுள்ளதாக இருக்கும் (`` const a: வரிசை [int] = [1, 2, 3] ``), ஏனெனில் இயல்புநிலையாக பயன்படுத்தப்படாத வரிசைகள் பயன்படுத்தப்படுகின்றன.
uk: Вам не потрібно писати підказки типу для констант, оскільки Godot автоматично встановлює їх із призначеного значення. Але ви можете зробити це, щоб зробити зміст вашого коду зрозумілішим. Крім того, це корисно для типізованих масивів (наприклад, ``const A: Array[int] = [1, 2, 3]``), оскільки нетипізовані масиви використовуються за замовчуванням.
zh_hant: 常數不一定要寫型別提示，Godot 會自動根據賦值推斷型別。不過，如果你要讓程式碼意圖更明確，還是可以寫上型別。特別是陣列，如果需要使用有型別的陣列（如 ``const A: Array[int] = [1, 2, 3]``），就很有幫助，因為預設是無型別陣列。

source: What can be a type hint
fr: Qu'est-ce qu'un indice de type peut être
ga: Cad is féidir a bheith ina leid cineál
it: Cosa può essere un suggerimento del tipo
ru: Что может быть подсказкой типа
ta: ஒரு வகை குறிப்பு என்னவாக இருக்கும்
uk: Що може бути підказкою типу
zh_hant: 哪些內容可以作為型別提示

source: Here is a complete list of what can be used as a type hint:
fr: Voici une liste complète de ce qui peut être utilisé comme indice de type :
ga: Seo liosta iomlán de na rudaí is féidir a úsáid mar leid cineál:
it: Ecco un elenco completo di ciò che si può utilizzare come suggerimento del tipo:
ru: Вот полный список того, что можно использовать в качестве подсказки типа:
ta: ஒரு வகை குறிப்பாக பயன்படுத்தக்கூடியவற்றின் முழுமையான பட்டியல் இங்கே:
uk: Ось повний список того, що можна використовувати як підказку типу:
zh_hant: 以下是所有可以用來當作型別提示的項目：

source: ``Variant``. Any type. In most cases this is not much different from an untyped declaration, but increases readability. As a return type, forces the function to explicitly return some value.
fr: ``Variant``. Tout type. Dans la plupart des cas, cela n'est pas très différent d'une déclaration non typée, mais augmente la lisibilité. En tant que type de retour, cela force la fonction à renvoyer explicitement une valeur.
ga: ``Variant``. Cineál ar bith. I bhformhór na gcásanna níl sé seo mórán difriúil ó dhearbhú neamhchlóite, ach méadaíonn sé inléiteacht. Mar chineál tuairisceáin, cuireann sé iallach ar an bhfeidhm luach éigin a thabhairt ar ais go sainráite.
it: ``Variant``. Qualsiasi tipo. Nella maggior parte dei casi non è molto diverso da una dichiarazione non tipizzata, ma aumenta la leggibilità. Come tipo restituito, costringe la funzione a restituire esplicitamente un valore.
ru: ``Variant``. Любой тип. В большинстве случаев это не сильно отличается от нетипизированного объявления, но повышает читаемость. Как возвращаемый тип, заставляет функцию явно возвращать некоторое значение.
ta: `` மாறுபாடு``. எந்த வகை. பெரும்பாலான சந்தர்ப்பங்களில் இது ஒரு அறிவிக்கப்படாத அறிவிப்பிலிருந்து மிகவும் வேறுபட்டதல்ல, ஆனால் வாசிப்புத்திறனை அதிகரிக்கிறது. திரும்பும் வகையாக, சில மதிப்புகளை வெளிப்படையாக திருப்பித் தர செயல்பாட்டை கட்டாயப்படுத்துகிறது.
uk: ``Варіант``. Будь-який тип. У більшості випадків це мало чим відрізняється від нетипової декларації, але покращує читабельність. Як тип повернення, змушує функцію явно повертати певне значення.
zh_hant: ``Variant``。代表任何型別。通常和未指定型別差異不大，但能提升可讀性。若指定為回傳型別，則強制函式必須有回傳值。

source: *(Only return type)* ``void``. Indicates that the function does not return any value.
ga: * (Cineál tuairisceáin amháin) * ``void``. Léiríonn sé nach dtugann an fheidhm aon luach ar ais.
it: *(Solo tipo restituito)* ``void``. Indica che la funzione non restituisce alcun valore.
ru: *(Только возвращаемый тип)* ``void``. Указывает, что функция не возвращает никакого значения.
ta: * (திரும்பும் வகை)* `` வெற்றிடத்தை``. செயல்பாடு எந்த மதிப்பையும் திருப்பித் தராது என்பதைக் குறிக்கிறது.
uk: *(Тільки тип повернення)* ``void``. Вказує, що функція не повертає жодного значення.
zh_hant: （僅用於回傳型別） ``void``。代表函式不會有回傳值。

source: :ref:`Built-in types <doc_gdscript_builtin_types>`.
fr: :ref:`Types intégrés <doc_gdscript_builtin_types>`.
ga: :ref:`Cineálacha ionsuite <doc_gdscript_builtin_types>`.
it: :ref:`Tipi integrati <doc_gdscript_builtin_types>`.
ru: :ref:`Встроенные типы <doc_gdscript_builtin_types>`.
ta: : குறிப்பு: `உள்ளமைக்கப்பட்ட வகைகள் <doc_gdscript_builtin_types>`.
zh_hant: :ref:`內建型別 <doc_gdscript_builtin_types>`。

source: Native classes (``Object``, ``Node``, ``Area2D``, ``Camera2D``, etc.).
fr: Classes natives (``Object``, ``Node``, ``Area2D``, ``Camera2D``, etc.).
ga: Ranganna dúchasacha (``Object``, `Node``, `Area2D``, `Ceamara2D``, etc.).
it: Classi native (``Object``, ``Node``, ``Area2D``, ``Camera2D``, ecc.).
ru: Родные классы (``Object``, ``Node``, ``Area2D``, ``Camera2D``, и т.д.).
ta: சொந்த வகுப்புகள் (`` பொருள்``, `` முனை``, `` ஏரியா 2 டி``, `` கேமரா 2 டி`` போன்றவை).
uk: Нативні класи (``Object``, ``Node``, ``Area2D``, ``Camera2D`` тощо).
zh_hant: 原生類別（如 ``Object``、``Node``、``Area2D``、``Camera2D`` 等）。

source: :ref:`Global classes <doc_gdscript_basics_class_name>`.
fr: :ref:`Classes globales <doc_gdscript_basics_class_name>`.
ga: :ref:`Ranganna domhanda <doc_gdscript_basics_class_name>`.
it: :ref:`Classi globali <doc_gdscript_basics_class_name>`.
ta: : குறிப்பு: `உலகளாவிய வகுப்புகள் <doc_gdscript_basics_class_name>`.
zh_hant: :ref:`全域類別 <doc_gdscript_basics_class_name>`。

source: :ref:`Inner classes <doc_gdscript_basics_inner_classes>`.
fr: :ref:`Classes internes <doc_gdscript_basics_inner_classes>`.
ga: :ref:`Ranganna istigh <doc_gdscript_basics_inner_classes>`.
it: :ref:`Classi interne <doc_gdscript_basics_inner_classes>`.
ta: : குறிப்பு: `உள் வகுப்புகள் <doc_gdscript_basics_inner_classes>`.
zh_hant: :ref:`內部類別 <doc_gdscript_basics_inner_classes>`。

source: Global, native and custom named enums. Note that an enum type is just an ``int``, there is no guarantee that the value belongs to the set of enum values.
fr: Les énumérations nommées globales, natives et personnalisées. Notez qu'un type d'énumération est simplement un ``int``, il n'y a aucune garantie que la valeur appartienne à l'ensemble des valeurs d'énumération.
ga: Enums domhanda, dúchasach agus saincheaptha ainmnithe. Tabhair faoi deara nach bhfuil cineál enum ach `int ``, níl aon ráthaíocht ann go mbaineann an luach leis an tacar luachanna enum.
it: Enumerazioni denominate globali, native e personalizzate. Si noti che un tipo di enumerazione è semplicemente un ``int``, non vi è alcuna garanzia che il valore appartenga all'insieme dei valori nell'enumerazione.
ru: Глобальные, собственные и пользовательские именованные перечисления. Обратите внимание, что тип перечисления — это просто ``int``, нет гарантии, что значение принадлежит множеству значений перечисления.
ta: உலகளாவிய, பூர்வீக மற்றும் தனிப்பயன் என பெயரிடப்பட்டது. ஒரு enum வகை என்பது ஒரு `` int`` என்பதை நினைவில் கொள்க, மதிப்பு ENUM மதிப்புகளின் தொகுப்பிற்கு சொந்தமானது என்பதற்கு எந்த உத்தரவாதமும் இல்லை.
uk: Глобальні, нативні та власні іменовані переліки. Зауважте, що тип переліку – це лише ``int``, немає гарантії, що значення належить до набору значень переліку.
zh_hant: 全域、核心與自訂命名的 enum。請注意 enum 實際上是 ``int`` 型別，無法保證它的值一定來自 enum 列舉值集合。

source: Constants (including local ones) if they contain a preloaded class or enum.
fr: Les constantes (y compris les locales) si elles contiennent une classe ou une énumération préchargée.
ga: Coinbhinní (lena n-áirítear cinn áitiúla) má tá aicme nó enum réamh-luchtaithe iontu.
it: Costanti (comprese quelle locali) se contengono una classe o un'enumerazione precaricata.
ru: Константы (включая локальные), если они содержат предварительно загруженный класс или перечисление.
ta: மாறிலிகள் (உள்ளூர் உட்பட) அவை முன்பே ஏற்றப்பட்ட வகுப்பு அல்லது enum ஐக் கொண்டிருந்தால்.
uk: Константи (включаючи локальні), якщо вони містять попередньо завантажений клас або перелік.
zh_hant: 常數（包含區域常數），只要內容是預載入的類別或 enum。

source: You can use any class, including your custom classes, as types. There are two ways to use them in scripts. The first method is to preload the script you want to use as a type in a constant:
it: Puoi usare qualsiasi classe, incluse le tue classi personalizzate, come tipo. Ci sono due modi per usarle negli script. Il primo metodo consiste nel precaricare in una costante lo script che vuoi usare come tipo:
ru: В качестве типов можно использовать любой класс, включая ваши собственные. Существует два способа использования их в скриптах. Первый способ — предварительно загрузить скрипт, который вы хотите использовать в качестве типа, в константу:
ta: உங்கள் தனிப்பயன் வகுப்புகள் உட்பட எந்த வகுப்பையும் வகைகளாகப் பயன்படுத்தலாம். ச்கிரிப்ட்களில் அவற்றைப் பயன்படுத்த இரண்டு வழிகள் உள்ளன. முதல் முறை நீங்கள் ஒரு மாறிலியில் ஒரு வகையாக பயன்படுத்த விரும்பும் ச்கிரிப்டை முன்னர் ஏற்றுவது:
uk: Ви можете використовувати будь-який клас, включаючи ваші власні класи, як типи. Існує два способи їх використання в скриптах. Перший метод полягає в попередньому завантаженні скрипта, який ви хочете використовувати як тип, у константу:
zh_hant: 你可以使用任何類別（包含自訂類別）作為型別。在腳本中有兩種使用方式。第一種是先在常數中預載要作為型別的腳本：

source: The second method is to use the ``class_name`` keyword when you create. For the example above, your ``rifle.gd`` would look like this:
it: Il secondo metodo consiste nell'utilizzare la parola chiave ``class_name`` nella creazione. Nell'esempio precedente, il file ``rifle.gd`` avrebbe questo aspetto:
ru: Второй способ — использовать ключевое слово ``class_name`` при создании. В приведённом выше примере ваш ``rifle.gd`` будет выглядеть так:
ta: இரண்டாவது முறை நீங்கள் உருவாக்கும்போது `` class_name`` முக்கிய சொல்லைப் பயன்படுத்துவது. மேலே உள்ள எடுத்துக்காட்டுக்கு, உங்கள் `` rifle.gd`` இப்படி இருக்கும்:
uk: Другий метод полягає у використанні ключового слова ``class_name`` під час створення. Для наведеного вище прикладу ваш ``rifle.gd`` виглядатиме так:
zh_hant: 第二種方法是在建立類別時使用 ``class_name`` 關鍵字。以上述範例來說，你的 ``rifle.gd`` 會像這樣：

source: If you use ``class_name``, Godot registers the ``Rifle`` type globally in the editor, and you can use it anywhere, without having to preload it into a constant:
it: Se si utilizza ``class_name``, Godot registra il tipo ``Rifle`` globalmente nell'editor, e sarà possibile utilizzarlo ovunque, senza doverlo precaricare in una costante:
ru: Если вы используете ``class_name``, Godot регистрирует тип ``Rifle`` глобально в редакторе, и вы можете использовать его где угодно, без необходимости предварительной загрузки его в константу:
ta: நீங்கள் `` class_name`` ஐப் பயன்படுத்தினால், கோடோட் உலகளவில் `` துப்பாக்கி` `வகையை எடிட்டரில் பதிவு செய்கிறார், மேலும் அதை ஒரு மாறாமல் ஏற்றாமல், அதை எங்கும் பயன்படுத்தலாம்:
uk: Якщо ви використовуєте ``class_name``, Godot реєструє тип ``Rifle`` глобально в редакторі, і ви можете використовувати його будь-де, без необхідності попереднього завантаження його в константу:
zh_hant: 如果使用 ``class_name``，Godot 會在編輯器中將 ``Rifle`` 型別註冊為全域，你就可以在任何地方使用它，而不需要先預載到常數：

source: Specify the return type of a function with the arrow ``->``
fr: Définissez le type de retour d'une fonction à l'aide de la flèche ``->``
ga: Sonraigh cineál aischuir feidhme leis an tsaighead ``->``
it: Definisci il tipo restituito da una funzione con la freccia ``->``
ru: Укажите тип возвращаемого значения функции с помощью стрелки ``->``
ta: அம்புக்குறியுடன் ஒரு செயல்பாட்டின் வருவாய் வகையைக் குறிப்பிடவும் `->` `
uk: Вкажіть тип повернення функції за допомогою стрілки ``->``
zh_hant: 用箭頭 ``->`` 指定函式的回傳型別

source: To define the return type of a function, write a dash and a right angle bracket ``->`` after its declaration, followed by the return type:
it: Per definire il tipo restituito di una funzione, scrivere un trattino e una parentesi angolare destra ``->`` dopo la sua dichiarazione, seguiti dal tipo restituito:
ru: Чтобы определить тип возвращаемого значения функции, напишите тире и правую угловую скобку ``->`` после ее объявления, а затем укажите тип возвращаемого значения:
ta: ஒரு செயல்பாட்டின் வருவாய் வகையை வரையறுக்க, ஒரு கோடு மற்றும் வலது கோண அடைப்புக்குறி ``-> `` அதன் அறிவிப்புக்குப் பிறகு, திரும்பும் வகை எழுதுங்கள்:
uk: Щоб визначити тип повернення функції, напишіть тире та праву кутову дужку ``->`` після її оголошення, а потім тип повернення:
zh_hant: 若要定義函式的回傳型別，在宣告後加上一個連字號與右角括號 ``->``，接著寫上回傳型別：

source: The type ``void`` means the function does not return anything. You can use any type, as with variables:
it: Il tipo ``void`` significa che la funzione non restituisce nulla. È possibile utilizzare qualsiasi tipo, come per le variabili:
ru: Тип ``void`` означает, что функция ничего не возвращает. Вы можете использовать любой тип, как и для переменных:
ta: `` வெற்றிடத்தை` வகை என்பது செயல்பாடு எதையும் திருப்பித் தராது. மாறிகள் போல நீங்கள் எந்த வகையையும் பயன்படுத்தலாம்:
uk: Тип ``void`` означає, що функція нічого не повертає. Ви можете використовувати будь-який тип, як і у випадку зі змінними:
zh_hant: 型別 ``void`` 代表函式不回傳任何東西。就像變數一樣，你可以使用任何型別：

source: You can also use your own classes as return types:
it: È possibile anche utilizzare le proprie classi come tipi restituiti:
ru: Вы также можете использовать собственные классы в качестве возвращаемых типов:
ta: உங்கள் சொந்த வகுப்புகளையும் திரும்ப வகைகளாகப் பயன்படுத்தலாம்:
uk: Ви також можете використовувати власні класи як типи повернення:
zh_hant: 你也可以使用自己的類別作為回傳型別：

source: Covariance and contravariance
fr: Covariance et contravariance
ga: Coathraitheacht agus frithsheasmhacht
it: Covarianza e controvarianza
ru: Ковариация и контравариация (Covariance and contravariance)
ta: கோவாரன்ச் மற்றும் முரண்பாடு
uk: Коваріація та контраваріація
zh_hant: 協變與逆變

source: When inheriting base class methods, you should follow the `Liskov substitution principle <https://en.wikipedia.org/wiki/Liskov_substitution_principle>`__.
fr: Lors de l'héritage des méthodes de classe de base, vous devez suivre le `principe de substitution de Liskov <https://fr.wikipedia.org/wiki/Principe_de_substitution_de_Liskov>`__.
ga: Agus modhanna bunranga á n-oidhreacht agat, ba cheart duit prionsabal an ionadaíochta `Liskov <https://en.wikipedia.org/wiki/Liskov_substitution_principle>`__ a leanúint.
it: Quando si ereditano i metodi di una classe padre, si dovrebbe seguire il `principio di sostituzione di Liskov <https://it.wikipedia.org/wiki/Principio_di_sostituzione_di_Liskov>`__.
ru: При наследовании методов базового класса следует следовать `принципу подстановки Лисков <https://en.wikipedia.org/wiki/Liskov_substitution_principle>`__.
ta: அடிப்படை வகுப்பு முறைகளைப் பெறும்போது, நீங்கள் `லிச்கோவ் மாற்றுக் கொள்கையை <https://en.wikipedia.org/wiki/liskov_substitution_principle> ____ ஐப் பின்பற்ற வேண்டும்.
uk: Успадковуючи методи базового класу, слід дотримуватися `принципу підстановки Ліскова <https://en.wikipedia.org/wiki/Liskov_substitution_principle>`__.
zh_hant: 繼承基底類別方法時，應遵循 `Liskov 替換原則 <https://en.wikipedia.org/wiki/Liskov_substitution_principle>`__。

source: **Covariance:** When you inherit a method, you can specify a return type that is more specific (**subtype**) than the parent method.
fr: **Covariance :** lorsque vous héritez d’une méthode, vous pouvez spécifier un type de retour plus spécifique (**sous-type**) que la méthode parent.
ga: **Coathraitheacht: ** Nuair a dhéanann tú modh oidhreachta, is féidir leat cineál tuairisceáin a shonrú atá níos sainiúla (**fo-chineál**) ná an modh tuismitheora.
it: **Covarianza:** quando si eredita un metodo, è possibile specificare un tipo restituito più specifico (**sottotipo**) rispetto al metodo padre.
ru: **Covariance (Ковариантность):** При наследовании метода можно указать тип возвращаемого значения, который является более конкретным (**subtype (подтип)**), чем родительский метод.
ta: ** கோவாரன்ச்: ** நீங்கள் ஒரு முறையைப் பெறும்போது, பெற்றோர் முறையை விட குறிப்பிட்ட (** துணை வகை **) திரும்பும் வகையை நீங்கள் குறிப்பிடலாம்.
uk: **Коваріація:** Коли ви успадковуєте метод, ви можете вказати тип повернення, який є більш конкретним (**підтип**), ніж батьківський метод.
zh_hant: **協變(Covariance)：** 當你覆寫繼承的方法時，可以指定比父類別更具體（**子型別**）的回傳型別。

source: **Contravariance:** When you inherit a method, you can specify a parameter type that is less specific (**supertype**) than the parent method.
fr: **Contravariance :** lorsque vous héritez d'une méthode, vous pouvez spécifier un type de paramètre moins spécifique (**supertype**) que la méthode parent.
ga: **Contraathrú: ** Nuair a dhéanann tú modh a oidhreacht, is féidir leat cineál paraiméadar a shonrú nach bhfuil chomh sonrach (**supertype**) ná an modh tuismitheora.
it: **Controvarianza:** quando si eredita un metodo, è possibile specificare un tipo di parametro meno specifico (**supertipo**) rispetto al metodo padre.
ru: **Contravariance (Контравариантность)**: при наследовании метода можно указать тип параметра, который менее специфичен (**supertype (супертип)**), чем родительский метод.
ta: ** முரண்பாடு: ** நீங்கள் ஒரு முறையைப் பெறும்போது, பெற்றோர் முறையை விட குறைவான குறிப்பிட்ட (** சூப்பர் டைப் **) ஒரு அளவுரு வகையை நீங்கள் குறிப்பிடலாம்.
uk: **Контраваріантність:** Коли ви успадковуєте метод, ви можете вказати тип параметра, який є менш конкретним (**супертип**), ніж батьківський метод.
zh_hant: **逆變(Contravariance)：** 當你覆寫繼承的方法時，可以指定比父類別更寬泛（**父型別**）的參數型別。

source: Example:
it: Esempio:
ru: Пример:
ta: எடுத்துக்காட்டு:
uk: Приклад:
zh_hant: 範例：

source: Specify the element type of an ``Array``
fr: Spécifier le type d'élément d'un ``Array``
ga: Sonraigh cineál eilimint ``Array``
it: Definire il tipo degli elementi in un ``Array``
ru: Укажите тип элемента ``Array``
ta: ஒரு `` வரிசை`` இன் உறுப்பு வகையைக் குறிப்பிடவும்
uk: Укажіть тип елемента ``Array``
zh_hant: 指定 ``Array`` 元素的型別

source: To define the type of an ``Array``, enclose the type name in ``[]``.
fr: Pour définir le type d'un ``Array``, placez le nom du type entre ``[]``.
ga: Chun cineál ``Array`` a shainiú, cuir an t-ainm cineál in ``[]``.
it: Per definire il tipo di un ``Array``, racchiudere il nome del tipo tra ``[]``.
ru: Чтобы определить тип ``Array``, заключите имя типа в ``[]``.
ta: `` வரிசை`` வகையை வரையறுக்க, வகை பெயரை `` [] `` இல் இணைக்கவும்.
uk: Щоб визначити тип «масиву», укладіть назву типу в «[]».
zh_hant: 要定義 ``Array`` 的型別，請把型別名稱放在 ``[]`` 內。

source: An array's type applies to ``for`` loop variables, as well as some operators like ``[]``, ``[...] =`` (assignment), and ``+``. Array methods (such as ``push_back``) and other operators (such as ``==``) are still untyped. Built-in types, native and custom classes, and enums may be used as element types. Nested array types (like ``Array[Array[int]]``) are not supported.
it: Il tipo di un array si applica alle variabili del ciclo ``for``, così come ad alcuni operatori come ``[]``, ``[]=`` (assegnamento) e ``+``. I metodi degli array (come ``push_back``) e altri operatori (come ``==``) sono comunque non tipizzati. Tipi integrati, classi native e personalizzate, ed enumerazioni si possono utilizzare come tipi degli elementi. Gli array tipizzati annidati (come ``Array[Array[int]]``) non sono supportati.
ru: Тип массива применяется к переменным цикла ``for``, а также к некоторым операторам, таким как ``[]``, ``[...] =`` (присваивание) и ``+``. Методы массивов (например, ``push_back``) и другие операторы (например, ``==``) по-прежнему нетипизированы. В качестве типов элементов могут использоваться встроенные типы, собственные и пользовательские классы, а также перечисления. Вложенные типы массивов (например, ``Array[Array[int]]``) не поддерживаются.
ta: ஒரு வரிசையின் வகை ``` வளைய மாறிகள், அத்துடன்` `[]` `,` `...] =` `(ஒதுக்குதல்), மற்றும்` `+` `போன்ற சில ஆபரேட்டர்களுக்கும் பொருந்தும். வரிசை முறைகள் (`` புச்_பேக்`` போன்றவை) மற்றும் பிற ஆபரேட்டர்கள் (`` == `` போன்றவை) இன்னும் குறைக்கப்படவில்லை. உள்ளமைக்கப்பட்ட வகைகள், சொந்த மற்றும் தனிப்பயன் வகுப்புகள் மற்றும் ENUM கள் உறுப்பு வகைகளாகப் பயன்படுத்தப்படலாம். உள்ளமைக்கப்பட்ட வரிசை வகைகள் (`` வரிசை [வரிசை [int]] `` போன்றவை) ஆதரிக்கப்படவில்லை.
uk: Тип масиву застосовується до змінних циклу ``for``, а також до деяких операторів, таких як ``[]``, ``[...] =`` (присвоювання) та ``+``. Методи масиву (такі як ``push_back``) та інші оператори (такі як ``==``) все ще не мають типів. Вбудовані типи, нативні та користувацькі класи, а також переліки можуть використовуватися як типи елементів. Вкладені типи масивів (такі як ``Array[Array[int]]``) не підтримуються.
zh_hant: 陣列的元素型別會套用到 ``for`` 迴圈變數, 以及某些運算子, 如 ``[]`` 、 ``[...] =`` (指定) 與 ``+``。不過, 陣列方法 (例如 ``push_back``) 以及其他運算子 (例如 ``==``) 仍是不具型別的。元素型別可以是內建型別、原生與自訂類別, 也可以是列舉。巢狀陣列型別 (例如 ``Array[Array[int]]``) 目前不支援。

source: Since Godot 4.2, you can also specify a type for the loop variable in a ``for`` loop. For instance, you can write:
it: A partire da Godot 4.2, è anche possibile specificare un tipo per la variabile di ciclo in un ciclo ``for``. Ad esempio, si può scrivere:
ru: Начиная с Godot 4.2, вы также можете указать тип переменной цикла в цикле ``for``. Например, можно написать:
ta: கோடோட் 4.2 என்பதால், லூப் மாறிக்கான ஒரு வகையை `` `வளையத்தில் குறிப்பிடலாம். உதாரணமாக, நீங்கள் எழுதலாம்:
uk: Починаючи з Godot 4.2, ви також можете вказати тип для змінної циклу в циклі ``for``. Наприклад, ви можете написати:
zh_hant: 自 Godot 4.2 起，也可以在 ``for`` 迴圈中為迴圈變數指定型別。例如：
