Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/static_typing.po
Languages: fr, ga, it, ru, ta, uk, zh_hant

source: In this example, we aim to set a property and call a method on an object that has a script attached with ``class_name MyScript`` and that ``extends Node2D``. If we have a reference to the object as a ``Node2D`` (for instance, as it was passed to us by the physics system), we can first check if the property and method exist and then set and call them if they do::
fr: Dans cet exemple, nous cherchons à définir une propriété et à appeler une méthode sur un objet auquel est attaché un script avec ``class_name MyScript`` et qui étend Node2D (``extends Node2D``). Si nous avons une référence à l'objet en tant que ``Node2D`` (par exemple, tel qu'il nous a été transmis par le système physique), nous pouvons d'abord vérifier si la propriété et la méthode existent, puis les définir et les appeler si c'est le cas :
ga: Sa sampla seo, tá sé mar aidhm againn airí a shocrú agus modh a ghlaoch ar réad a bhfuil script ceangailte le `` class_name MyScript`` agus a leathnaíonn `` extends Node2D``. Má tá tagairt againn don réad mar ``Node2D`` (mar shampla, mar a thug an córas fisice dúinn é), is féidir linn a sheiceáil ar dtús an bhfuil an t-airí agus an modh ann agus ansin iad a shocrú agus glaoch orthu má dhéanann siad é. ::

source: However, this code will produce ``UNSAFE_PROPERTY_ACCESS`` and ``UNSAFE_METHOD_ACCESS`` warnings as the property and method are not present in the referenced type - in this case a ``Node2D``. To make these operations safe, you can first check if the object is of type ``MyScript`` using the ``is`` keyword and then declare a variable with the type ``MyScript`` on which you can set its properties and call its methods::
fr: Cependant, ce code génèrera les avertissements ``UNSAFE_PROPERTY_ACCESS`` et ``UNSAFE_METHOD_ACCESS`` car la propriété et la méthode ne sont pas présentes dans le type référencé - dans le cas présent, un ``Node2D``. Pour sécuriser ces opérations, vous pouvez d'abord vérifier si l'objet est de type ``MyScript`` à l'aide du mot-clé ``is`` puis déclarer une variable de type ``MyScript`` sur laquelle vous pouvez définir ses propriétés et appeler ses méthodes ::
ga: Mar sin féin, cuirfidh an cód seo rabhaidh ``UNSAFE_PROPERTY_ACCESS`` agus ``UNSAFE_METHOD_ACCESS`` toisc nach bhfuil an maoin agus an modh i láthair sa chineál tagartha - sa chás seo ``Node2D``. Chun na hoibríochtaí seo a dhéanamh sábháilte, is féidir leat a sheiceáil ar dtús an bhfuil an réad de chineál `Myscript`` ag baint úsáide as an eochairfhocal ``is ``agus ansin athróg a dhearbhú leis an gcineál ``MyScript`` ar féidir leat a airíonna a shocrú agus a mhodhanna a ghlaoch:

source: Alternatively, you can declare a variable and use the ``as`` operator to try to cast the object. You'll then want to check whether the cast was successful by confirming that the variable was assigned::
fr: Autrement, vous pouvez déclarer une variable et utiliser l'opérateur ``as`` pour essayer de convertir l'objet. Vous devrez ensuite vérifier si le transtypage a réussi en confirmant que la variable a été affectée ::
ga: De rogha air sin, is féidir leat athróg a dhearbhú agus an t-oibreoir `as` a úsáid chun iarracht a dhéanamh an réad a chaitheamh. Ansin beidh tú ag iarraidh a sheiceáil an raibh éirigh leis an gcaitheadh trí dhearbhú gur sannadh an t-athróg:

source: In this example, we would like the label connected to an object entering our collision area to show the area's name. Once the object enters the collision area, the physics system sends a signal with a ``Node2D`` object, and the most straightforward (but not statically typed) solution to do what we want could be achieved like this::
fr: Dans cet exemple, nous souhaitons qu'un ``Label`` connecté à un objet entrant dans notre zone de collision indique le nom de la zone. Une fois que l'objet entre dans la zone de collision, le système physique envoie un signal avec un objet ``Node2D``, et la solution la plus simple (mais pas typée statiquement) pour faire ce que nous voulons pourrait être obtenue comme ceci ::
ga: Sa sampla seo, ba mhaith linn an lipéad atá ceangailte le réad a théann isteach inár limistéar imbhuailte ainm an cheantair a thaispeáint. Nuair a théann an réad isteach sa limistéar imbhuailte, seolann an córas fisice comhartha le réad ``Node2D`, agus d'fhéadfaí an réiteach is simplí (ach ní clóscríofa go statach) chun an rud a theastaíonn uainn a dhéanamh mar seo:

source: This piece of code produces an ``UNSAFE_PROPERTY_ACCESS`` warning because ``label`` is not defined in ``Node2D``. To solve this, we could first check if the ``label`` property exist and cast it to type ``Label`` before settings its text property like so::
fr: Ce morceau de code génère un avertissement ``UNSAFE_PROPERTY_ACCESS`` car ``label`` n'est pas défini dans ``Node2D``. Pour résoudre ce problème, nous pourrions d'abord vérifier si la propriété ``label`` existe et la convertir en type ``Label`` avant de définir sa propriété de texte comme suit ::
ga: Táirgeann an píosa cód seo rabhadh ``UNSAFE_PROPERTY_ACCESS`` toisc nach bhfuil `lipéad ``sainmhínithe i `Node2D``. Chun é seo a réiteach, d'fhéadfaimis a sheiceáil ar dtús an bhfuil an maoin `lipéad`` ann agus í a chaitheamh chun ``Lipéad` a chlóscríobh sula socraítear a maoin téacs mar sin:

source: However, this produces an ``UNSAFE_CAST`` warning because ``body.label`` is of a ``Variant`` type. To safely get the property in the type you want, you can use the ``Object.get()`` method which returns the object as a ``Variant`` value or returns ``null`` if the property doesn't exist. You can then determine whether the property contains an object of the right type using the ``is`` keyword, and finally declare a statically typed variable with the object::
fr: Cependant, cela génère un avertissement ``UNSAFE_CAST`` car ``body.label`` est de type ``Variant``. Pour obtenir en toute sécurité la propriété dans le type souhaité, vous pouvez utiliser la méthode ``Object.get()``qui renvoie l'objet sous forme de valeur ``Variant`` ou renvoie ``null`` si la propriété n'existe pas. Vous pouvez ensuite déterminer si la propriété contient un objet du bon type à l'aide du mot-clé ``is`` et enfin déclarer une variable typée statiquement avec l'objet ::
ga: Mar sin féin, táirgeann sé seo rabhadh ``UNSAFE_CAST`` toisc go bhfuil `body.label`` de chineál ``Variant``. Chun an maoin a fháil go sábháilte sa chineál atá uait, is féidir leat an modh `Object.get () `a úsáid a thugann an réad ar ais mar luach ``Variant`` nó a fhilleann ``null`` mura bhfuil an maoin ann. Is féidir leat a chinneadh ansin an bhfuil réad den chineál ceart sa mhaoin ag baint úsáide as an eochairfhocal ``is ``, agus ar deireadh athróg clóscríofa go statach a dhearbhú leis an réad:

source: You can't specify the type of individual elements in an array or a dictionary::
fr: Vous ne pouvez pas spécifier le type de membres individuels dans un tableau ou dans un dictionnaire ::
ga: Ní féidir leat an cineál eilimintí aonair a shonrú i sraith nó i bhfoclóir:

source: Nested types are not currently supported::
fr: Les types imbriqués ne sont actuellement pas pris en charge ::
ga: Ní thacaítear le cineálacha neadaithe faoi láthair::

source: Typed dictionaries are not currently supported::
fr: Les dictionnaires typés ne sont actuellement pas pris en charge ::
