Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/static_typing.po
Languages: fr, ga, it, ru, ta, uk, zh_hant

source: Static typing in GDScript
fr: Typage statique en GDScript
ga: Clóscríobh statach i GDScript
it: Tipizzazione statica in GDScript
ru: Статическая типизация в GDScript
ta: GDSCRIPT இல் நிலையான தட்டச்சு
uk: Статична типізація в GDScript
zh_hant: GDScript 的靜態型別

source: In this guide, you will learn:
fr: Dans ce guide, vous apprendrez :
ga: Sa treoir seo, foghlaimeoidh tú:
it: In questa guida imparerai:
ru: В этом руководстве вы узнаете:
ta: இந்த வழிகாட்டியில், நீங்கள் கற்றுக்கொள்வீர்கள்:
uk: У цьому посібнику ви дізнаєтесь:
zh_hant: 在本指南中，你將學到：

source: how to use static typing in GDScript;
fr: comment utiliser le typage statique avec GDScript ;
ga: conas clóscríobh statach a úsáid i GDScript;
it: come utilizzare la tipizzazione statica in GDScript;
ru: как использовать статическую типизацию в GDScript;
ta: GDSCRIPT இல் நிலையான தட்டச்சு எவ்வாறு பயன்படுத்துவது;
uk: як використовувати статичну типізацію в GDScript;
zh_hant: 如何在 GDScript 中使用靜態型別;

source: that static types can help you avoid bugs;
fr: que les types statiques peuvent vous aider à éviter les bugs ;
ga: gur féidir le cineálacha statacha cabhrú leat fabhtanna a sheachaint;
it: che la tipizzazione statica può aiutarti a evitare bug;
ru: эти статические типы могут помочь вам избежать ошибки;
ta: பிழைகள் தவிர்க்க அந்த நிலையான வகைகள் உங்களுக்கு உதவும்;
uk: що статичні типи можуть допомогти вам уникнути помилок;
zh_hant: 靜態型別可以幫助你避免錯誤;

source: that static typing improves your experience with the editor.
fr: que le typage statique améliore votre expérience avec l'éditeur.
ga: feabhsaíonn clóscríobh statach do thaithí leis an eagarthóir.
it: che la tipizzazione statica migliora la tua esperienza con l'editor.
ru: что статическая типизация улучшает работу с редактором.
ta: அந்த நிலையான தட்டச்சு எடிட்டருடனான உங்கள் அனுபவத்தை மேம்படுத்துகிறது.
uk: що статичне введення тексту покращує роботу з редактором.
zh_hant: 靜態型別可以提升你在編輯器中的使用體驗。

source: Where and how you use this language feature is entirely up to you: you can use it only in some sensitive GDScript files, use it everywhere, or don't use it at all.
fr: Vous êtes libre de choisir où et comment utiliser cette nouvelle fonctionnalité de langage : vous pouvez ne l'utiliser que dans certains fichiers sensibles GDScript, l'utiliser partout ou ne pas l'utiliser.
ga: Is fútsa go hiomlán cá háit agus conas a úsáideann tú an ghné teanga seo: ní féidir leat é a úsáid ach i roinnt comhaid íogair GDScript, é a úsáid i ngach áit, nó gan é a úsáid ar chor ar bith.
it: Dove e come usare questa nuova funzionalità del linguaggio dipende completamente da te: puoi usarla solo in certi file GDScript sensibili, dappertutto o non usarla affatto.
ru: Где и как использовать эту языковую функцию, решать только вам: вы можете использовать ее только в некоторых конфиденциальных файлах GDScript, использовать ее везде или не использовать ее вообще.
ta: இந்த மொழி அம்சத்தை நீங்கள் எங்கே, எப்படி பயன்படுத்துகிறீர்கள் என்பது முற்றிலும் உங்களுடையது: நீங்கள் இதை சில உணர்திறன் வாய்ந்த சி.டி.எச்ச்கிரிப்ட் கோப்புகளில் மட்டுமே பயன்படுத்தலாம், எல்லா இடங்களிலும் பயன்படுத்தலாம், அல்லது அதைப் பயன்படுத்த வேண்டாம்.
uk: Де і як ви будете використовувати цю мовну функцію, залежить тільки від вас: ви можете використовувати її тільки в деяких чутливих файлах GDScript, використовувати її скрізь або не використовувати взагалі.
zh_hant: 你可以完全自由決定在哪裡以及如何使用這個語言特性：你可以只在某些關鍵的 GDScript 檔案使用、全專案都使用，或完全不使用。

source: Static types can be used on variables, constants, functions, parameters, and return types.
fr: Les types statiques peuvent être utilisés sur des variables, constantes, fonctions, paramètres et types de retour.
ga: Is féidir cineálacha statacha a úsáid ar athróga, comhsheasmhainní, feidhmeanna, paraiméadair agus cineálacha tuairisceáin.
it: La tipizzazione statica può essere usata su variabili, costanti, funzioni, parametri e tipi restituiti.
ru: Статические типы могут использоваться для переменных, констант, функций, параметров и возвращаемых типов.
ta: நிலையான வகைகளை மாறிகள், மாறிலிகள், செயல்பாடுகள், அளவுருக்கள் மற்றும் திரும்பும் வகைகளில் பயன்படுத்தலாம்.
uk: Статичні типи можна використовувати для змінних, констант, функцій, параметрів та типів повернення.
zh_hant: 你可以在變數、常數、函式、參數及回傳型別上使用靜態型別。

source: A brief look at static typing
fr: Un bref aperçu du typage statique
ga: Breathnú gairid ar chlóscríobh statach
it: Un breve sguardo alla tipizzazione statica
ru: Краткий обзор статической типизации
ta: நிலையான தட்டச்சு குறித்த சுருக்கமான பார்வை
uk: Короткий огляд статичної типізації
zh_hant: 靜態型別簡介

source: With static typing, GDScript can detect more errors without even running the code. Also type hints give you and your teammates more information as you're working, as the arguments' types show up when you call a method. Static typing improves editor autocompletion and :ref:`documentation <doc_gdscript_documentation_comments>` of your scripts.
fr: Avec le typage statique, GDScript peut détecter encore plus d’erreurs lors de l’écriture du code. Cela vous donne, à vous et à vos collègues, plus d’informations pendant que vous travaillez, comme les types d’arguments apparaissant lorsque vous appelez une méthode. Le typage statique améliore la saisie semi-automatique de l'éditeur et la :ref:`documentation <doc_gdscript_documentation_comments>` de vos scripts.
ga: Le clóscríobh statach, is féidir le GDScript níos mó earráidí a bhrath gan fiú an cód a rith. Chomh maith leis sin tugann leideanna clóscríofa tuilleadh eolais duit féin agus le do chomhpháirtithe agus tú ag obair, de réir mar a thagann cineálacha argóintí chun cinn nuair a ghlaonn tú ar mhodh. Feabhsaíonn clóscríobh statach uathchríochnú an eagarthóra agus :ref:`doiciméadúchán <doc_gdscript_documentation_comments>` do scripteanna.
it: Grazie alla tipizzazione statica, GDScript può rilevare più errori senza nemmeno eseguire il codice. Inoltre, i suggerimenti sui tipi forniscono a te e ai tuoi colleghi più informazioni mentre programmate, poiché i tipi degli argomenti appaiono quando chiamate un metodo. La tipizzazione statica migliora il completamento automatico dell'editor e la :ref:`documentazione <doc_gdscript_documentation_comments>` dei tuoi script.
ru: Благодаря статической типизации GDScript может обнаруживать больше ошибок, даже не запуская код. Кроме того, подсказки типов предоставляют вам и вашим коллегам больше информации в процессе работы, поскольку типы аргументов отображаются при вызове метода. Статическая типизация улучшает автодополнение в редакторе и :ref:`documentation <doc_gdscript_documentation_comments>` ваших скриптов.
ta: நிலையான தட்டச்சு மூலம், GDSCRIPT குறியீட்டை இயக்காமல் அதிக பிழைகளைக் கண்டறிய முடியும். நீங்கள் ஒரு முறையை அழைக்கும்போது வாதங்களின் வகைகள் காண்பிக்கப்படுவதால், நீங்கள் பணிபுரியும் போது தட்டச்சு குறிப்புகள் உங்களுக்கும் உங்கள் குழு உறுப்பினர்களுக்கும் கூடுதல் தகவல்களைத் தருகின்றன. நிலையான தட்டச்சு எடிட்டர் தன்னியக்கவியல் மற்றும்: ref: `ஆவணங்கள் <doc_gdscript_documentation_comments>` உங்கள் ச்கிரிப்ட்களின் `.
uk: За допомогою статичної типізації GDScript може виявити більше помилок без запуску кода. Підказки типів також надають вам і вашим товаришам по команді більше інформації під час роботи, оскільки типи аргументів з’являються під час виклику методу. Статичні типи покращують підказки редактора та :ref:`documentation <doc_gdscript_documentation_comments>` ваших скриптів.
zh_hant: 有了靜態型別，GDScript 可以在不執行程式碼的情況下偵測出更多錯誤。型別提示也能在你或團隊成員撰寫程式時，於方法呼叫時顯示參數型別，讓大家獲得更多資訊。靜態型別還能提升編輯器的自動補全與 :ref:`腳本註解文件 <doc_gdscript_documentation_comments>` 的效果。

source: Imagine you're programming an inventory system. You code an ``Item`` class, then an ``Inventory``. To add items to the inventory, the people who work with your code should always pass an ``Item`` to the ``Inventory.add()`` method. With types, you can enforce this:
it: Immagina di programmare un sistema di inventario. Programmi una classe ``Item``, poi un ``Inventory``. Per aggiungere elementi all'inventario, le persone che lavorano con il tuo codice devono sempre passare un oggetto di tipo ``Item`` al metodo ``Inventory.add()``. Con la tipizzazione, lo si può imporre:
ru: Представьте, что вы программируете систему управления инвентарём. Вы пишете класс ``Item``, а затем ``Inventory``. Чтобы добавить предметы в инвентарь, разработчики вашего кода должны всегда передавать ``Item`` методу ``Inventory.add()``. С помощью типов вы можете реализовать это:
ta: நீங்கள் ஒரு சரக்கு அமைப்பை நிரலாக்குகிறீர்கள் என்று கற்பனை செய்து பாருங்கள். நீங்கள் ஒரு `` உருப்படி`` வகுப்பைக் குறியிடுகிறீர்கள், பின்னர் ஒரு `` சரக்கு``. சரக்குகளில் உருப்படிகளைச் சேர்க்க, உங்கள் குறியீட்டோடு பணிபுரியும் நபர்கள் எப்போதும் `` உருப்படி`` ஐ `` சரக்குகள். கூட்டு () `` முறைக்கு அனுப்ப வேண்டும். வகைகளுடன், இதை நீங்கள் செயல்படுத்தலாம்:
uk: Уявіть, що ви програмуєте систему управління інвентаризацією. Ви створюєте клас ``Item``, а потім ``Inventory``. Щоб додати елементи до інвентаризації, люди, які працюють з вашим кодом, повинні завжди передавати ``Item`` методу ``Inventory.add()``. За допомогою типів ви можете забезпечити це:
zh_hant: 想像你正在撰寫一個物品欄系統。你寫了一個 ``Item`` 類別，然後再寫一個 ``Inventory``。要把物品加入物品欄，使用你程式碼的人應該永遠把 ``Item`` 傳給 ``Inventory.add()`` 方法。有了型別，你可以強制這件事：

source: Static types also give you better code completion options. Below, you can see the difference between a dynamic and a static typed completion options.
fr: Les types statiques vous offrent également de meilleures options de complétion du code. Ci-dessous, vous pouvez voir la différence entre les options de complétion de type dynamique et de type statique.
ga: Tugann cineálacha statacha roghanna comhlánaithe cód níos fearr duit freisin. Anseo thíos, is féidir leat an difríocht idir roghanna críochnaithe clóscríofa dinimiciúla agus statacha a fheiceáil.
it: La tipizzazione statica inoltre fornisce migliori opzioni di completamento del codice. Di seguito, puoi vedere la differenza tra le opzioni di completamento di tipo dinamico e di tipo statico.
ru: Статические типы также предоставляют улучшенные возможности автодополнения кода. Ниже показана разница между динамическими и статическими типизированными вариантами автодополнения.
ta: நிலையான வகைகள் உங்களுக்கு சிறந்த குறியீடு நிறைவு விருப்பங்களையும் வழங்குகின்றன. கீழே, ஒரு மாறும் மற்றும் நிலையான தட்டச்சு செய்யப்பட்ட நிறைவு விருப்பங்களுக்கு இடையிலான வித்தியாசத்தை நீங்கள் காணலாம்.
uk: Статичні типи також дають вам кращі варіанти завершення коду. Нижче ви можете побачити різницю між динамічним і статичним варіантами завершення.
zh_hant: 靜態型別也能帶來更優秀的程式碼自動補全體驗。下面可以看到動態型別與靜態型別的補全選項差異。

source: You've probably encountered a lack of autocomplete suggestions after a dot:
fr: Vous avez probablement rencontré un manque de suggestions de saisie semi-automatique après un point :
ga: Is dócha go raibh easpa moltaí uathchomhlánaithe agat tar éis ponc:
it: Hai probabilmente riscontrato la mancanza di suggerimenti di completamento automatico dopo un punto:
ru: Вероятно, вы сталкивались с отсутствием подсказок автодополнения после точки:
ta: ஒரு புள்ளிக்குப் பிறகு தன்னியக்கவியல் பரிந்துரைகளின் பற்றாக்குறையை நீங்கள் சந்தித்திருக்கலாம்:
uk: Можливо, ви стикалися з відсутністю пропозицій автозаповнення після крапки:
zh_hant: 你也許遇過在輸入「.」後沒有自動補全建議：

source: Completion options for dynamic typed code.
fr: Options de complétion pour le code typé dynamique.
ga: Roghanna críochnaithe le haghaidh cód clóscríofa dinimiciúil.
it: Opzioni di completamento per il codice dinamicamente tipizzato.
ru: Варианты завершения для динамически типизированного кода.
ta: மாறும் தட்டச்சு செய்யப்பட்ட குறியீட்டிற்கான நிறைவு விருப்பங்கள்.
uk: Параметри завершення для динамічного введеного коду.
zh_hant: 動態型別程式碼的補全選項。

source: This is due to dynamic code. Godot cannot know what value type you're passing to the function. If you write the type explicitly however, you will get all methods, properties, constants, etc. from the value:
fr: Cela est dû au code dynamique. Godot ne peut pas savoir quel type de valeur vous transmettez à la fonction. Cependant, si vous écrivez le type explicitement, vous obtiendrez toutes les méthodes, propriétés, constantes, etc. à partir de la valeur :
ga: Tá sé seo mar gheall ar chód dinimiciúil. Ní féidir le Godot a fhios cén cineál luacha atá tú ag dul chuig an bhfeidhm. Má scríobhann tú an cineál go sainráite áfach, gheobhaidh tú gach modh, airíonna, comhsheasmhainní, srl ón luach:
it: Questo è per via della tipizzazione dinamica. Godot non può sapere quale nodo o tipo stai passando alla funzione. Tuttavia, se dichiari il tipo esplicitamente, otterrai tutti i metodi, proprietà, costanti, ecc. dal valore:
ru: Это происходит из-за динамического кода. Godot не может знать, какой тип значения вы передаёте функции. Однако, если вы укажете тип явно, вы получите все методы, свойства, константы и т. д. из значения:
ta: இது மாறும் குறியீடு காரணமாகும். நீங்கள் செயல்பாட்டிற்கு எந்த மதிப்பு வகையை கடந்து செல்கிறீர்கள் என்று கோடோட் அறிய முடியாது. இருப்பினும் நீங்கள் வகையை வெளிப்படையாக எழுதினால், மதிப்பிலிருந்து அனைத்து முறைகள், பண்புகள், மாறிலிகள் போன்றவற்றைப் பெறுவீர்கள்:
uk: Це пов'язано з динамічним кодом. Godot не може знати, який тип значення ви передаєте функції. Однак якщо ви напишете тип явно, ви отримаєте всі методи, властивості, константи тощо зі значення:
zh_hant: 這是因為動態程式碼下，Godot 無法知道你傳遞給函式的值是什麼型別。如果你明確寫出型別，補全就會顯示該型別的所有方法、屬性、常數等：

source: Completion options for static typed code.
fr: Options de complétion pour le code typé statique.
ga: Roghanna críochnaithe le haghaidh cód clóscríofa statach.
it: Opzioni di completamento per il codice staticamente tipizzato.
ru: Варианты завершения для статического типизированного кода.
ta: நிலையான தட்டச்சு செய்யப்பட்ட குறியீட்டிற்கான நிறைவு விருப்பங்கள்.
uk: Параметри завершення для статичного коду.
zh_hant: 靜態型別程式碼的補全選項。

source: If you prefer static typing, we recommend enabling the **Text Editor > Completion > Add Type Hints** editor setting. Also consider enabling `some warnings <Warning system_>`_ that are disabled by default.
fr: Si vous préférez la saisie statique, nous vous recommandons d'activer le paramètre d'éditeur **Éditeur de texte > Complétion > Ajouter des indices de type**. Pensez également à activer ``certains avertissements <Warning system_>`_ qui sont désactivés par défaut.
ga: Más fearr leat clóscríobh statach, molaimid an socrú eagarthóra **Eagarthóir Téacs> Críochnú> Cuir Leideanna Cineál Leis** a chumasú. Smaoinigh freisin ar `roinnt rabhaidh <Warning system_> `_ atá díchumasaithe de réir réamhshocraithe a chumasú.
it: Se preferisci la tipizzazione statica, consigliamo di abilitare l'impostazione **Editor di testo > Completamento > Aggiungi suggerimenti del tipo**. Considera anche di abilitare `alcuni avvertimenti <Warning system_>`_ che sono normalmente disabilitati.
ru: Если вы предпочитаете статическую типизацию, рекомендуем включить настройку редактора **Text Editor > Completion > Add Type Hints**. Также рассмотрите возможность включить `некоторые предупреждения <Warning system_>`_, которые отключены по умолчанию.
ta: நீங்கள் நிலையான தட்டச்சு விரும்பினால், ** உரை எடிட்டர்> நிறைவு> வகை குறிப்புகளைச் சேர் ** எடிட்டர் அமைப்பை இயக்க பரிந்துரைக்கிறோம். இயல்புநிலையாக முடக்கப்பட்ட `சில எச்சரிக்கைகள் <எச்சரிக்கை அமைப்பு_>` _ ஐ இயக்குவதையும் கருத்தில் கொள்ளுங்கள்.
uk: Якщо ви віддаєте перевагу статичному введенню, рекомендуємо ввімкнути параметр редактора **Текстовий редактор > Завершення > Додати підказки типу**. Також варто ввімкнути `деякі попередження <Warning system_>`_ які вимкнено за замовчуванням.
zh_hant: 如果你偏好靜態型別，建議啟用 **文字編輯器 > 自動完成 > 新增型別提示** 編輯器設定，也可考慮啟用預設停用的 `部分警告 <Warning system>`_ 。

source: Also, typed GDScript improves performance by using optimized opcodes when operand/argument types are known at compile time. More GDScript optimizations are planned in the future, such as JIT/AOT compilation.
fr: De plus, le GDScript typé améliore les performances en utilisant des opcodes optimisés lorsque les types d'opérandes/arguments sont connus au moment de la compilation. D'autres optimisations de GDScript sont prévues à l'avenir, telles que la compilation JIT/AOT.
ga: Chomh maith leis sin, feabhsaíonn GDScript clóscríofa feidhmíocht trí opcóid optamaithe a úsáid nuair a bhíonn cineálacha oibríochta/argóint ar eolas ag am Tá níos mó optamaithe GDScript beartaithe sa todhchaí, mar shampla tiomsú JIT/AOT.
it: Inoltre, il GDScript tipizzato migliora le prestazioni utilizzando opcode ottimizzati quando i tipi di operandi/argomenti sono noti in fase di compilazione. Sono previste ulteriori ottimizzazioni di GDScript in futuro, come la compilazione JIT/AOT.
ru: Кроме того, типизированный GDScript повышает производительность за счёт использования оптимизированных опкодов, когда типы операндов/аргументов известны во время компиляции. В будущем планируется реализовать дополнительные оптимизации GDScript, такие как JIT/AOT-компиляция.
ta: மேலும், தட்டச்சு செய்யப்பட்ட GDSCRIPT தொகுக்கும் நேரத்தில் செயல்படும் போது உகந்த OPCodes ஐப் பயன்படுத்துவதன் மூலம் செயல்திறனை மேம்படுத்துகிறது. JIT/AOT தொகுப்பு போன்ற எதிர்காலத்தில் மேலும் GDSCRIPT மேம்படுத்தல்கள் திட்டமிடப்பட்டுள்ளன.
uk: Крім того, типізований GDScript покращує продуктивність, використовуючи оптимізовані коди операцій, коли типи операндів/аргументів відомі під час компіляції. У майбутньому планується більше оптимізацій GDScript, наприклад компіляція JIT/AOT.
zh_hant: 此外，使用靜態型別的 GDScript 在編譯時若已知運算元／參數型別，會自動使用最佳化的位元碼，提升執行效能。未來還會加入更多最佳化，例如 JIT/AOT 編譯。

source: Overall, typed programming gives you a more structured experience. It helps prevent errors and improves the self-documenting aspect of your scripts. This is especially helpful when you're working in a team or on a long-term project: studies have shown that developers spend most of their time reading other people's code, or scripts they wrote in the past and forgot about. The clearer and the more structured the code, the faster it is to understand, the faster you can move forward.
fr: Dans l'ensemble, la programmation typée vous donne une expérience plus structurée. Elle aide à prévenir les erreurs et améliore l'aspect d'auto-documentation de vos scripts. Ceci est particulièrement utile lorsque vous travaillez en équipe ou sur un projet à long terme : des études ont montré que les développeurs passent la plupart de leur temps à lire le code d'autres personnes, ou des scripts qu'ils ont écrits dans le passé et ont oubliés. Plus le code est clair et structuré, plus il est rapide à comprendre, plus vous pouvez travailler rapidement.
ga: Ar an iomlán, tugann cláir chlóscríofa eispéireas níos struchtúrtha duit. Cuidíonn sé le hearráidí a chosc agus feabhsaíonn sé gné féindhoiciméadaithe do scripteanna. Tá sé seo cabhrach go háirithe nuair a bhíonn tú ag obair i bhfoireann nó ar thionscadal fadtéarmach: léirigh staidéir go gcaitheann forbróirí an chuid is mó dá gcuid ama ag léamh cód daoine eile, nó scripteanna a scríobh siad san am atá thart agus rinne siad dearmad orthu. An níos soiléire agus níos struchtúrtha an cód, is amhlaidh is tapa é a thuiscint, is amhlaidh is féidir leat bogadh ar aghaidh.
it: In generale, la programmazione tipizzata offre un'esperienza più strutturata. Aiuta a prevenire gli errori e migliora l'aspetto auto-documentante degli script. Questo è particolarmente utile quando si lavora in team o su progetti a lungo termine: studi hanno dimostrato che gli sviluppatori trascorrono la maggior parte del tempo a leggere il codice di altri o script scritti in passato e dimenticati. Più il codice è chiaro e strutturato, più è veloce da comprendere e più velocemente si può procedere.
ru: В целом, типизированное программирование дает вам более структурированный опыт. Это помогает предотвратить ошибки и улучшает аспект самодокументирования ваших скриптов. Это особенно полезно, когда вы работаете в команде или над долгосрочным проектом: исследования показали, что разработчики проводят большую часть своего времени за чтением чужого кода или скриптов, которые они написали в прошлом и о которых забыли. Чем яснее и структурированнее код, тем быстрее его понять, тем быстрее вы сможете двигаться вперед.
ta: ஒட்டுமொத்தமாக, தட்டச்சு செய்யப்பட்ட நிரலாக்கமானது உங்களுக்கு மிகவும் கட்டமைக்கப்பட்ட அனுபவத்தை வழங்குகிறது. இது பிழைகளைத் தடுக்க உதவுகிறது மற்றும் உங்கள் ச்கிரிப்ட்களின் சுய-ஆவணப்படுத்தல் அம்சத்தை மேம்படுத்துகிறது. நீங்கள் ஒரு குழுவில் அல்லது நீண்ட கால திட்டத்தில் பணிபுரியும் போது இது மிகவும் உதவியாக இருக்கும்: உருவாக்குபவர்கள் மற்றவர்களின் குறியீட்டைப் படிக்க அல்லது கடந்த காலத்தில் அவர்கள் எழுதிய ச்கிரிப்ட்களைப் படித்து மறந்துவிட்டதாக ஆய்வுகள் தெரிவிக்கின்றன. தெளிவான மற்றும் மிகவும் கட்டமைக்கப்பட்ட குறியீடு, விரைவாக புரிந்துகொள்வது, வேகமாக நீங்கள் முன்னேற முடியும்.
uk: Загалом, типізоване програмування дає вам більш структурований досвід. Воно допомагає запобігти помилкам і покращує само-документування аспектів ваших скриптів. Це особливо корисно, коли ви працюєте в команді, або над довготривалим проєктом: дослідження показали, що розробники проводять більшу частину свого часу за читанням кодів інших людей, або скриптів, які вони писали раніше і про які вже забули. Чим чіткіший і структурований код, тим легше його зрозуміти, і тим швидше ви зможете рухатися далі.
zh_hant: 總體來說，靜態型別讓你的程式架構更明確，有助於防止錯誤，也讓腳本更容易自我說明。在團隊協作或長期專案中特別實用：研究顯示，多數開發者花最多的時間在閱讀他人或自己過去寫但早已忘記的程式碼。程式碼越清晰、結構越明確，理解就越快，也能讓開發更順暢。

source: How to use static typing
fr: Comment utiliser le typage statique
ga: Conas clóscríobh statach a úsáid
it: Come utilizzare la tipizzazione statica
ru: Как использовать статическую типизацию
ta: நிலையான தட்டச்சு எவ்வாறு பயன்படுத்துவது
uk: Як використовувати статичну типізацію
zh_hant: 如何使用靜態型別

source: To define the type of a variable, parameter, or constant, write a colon after the name, followed by its type. E.g. ``var health: int``. This forces the variable's type to always stay the same:
it: Per definire il tipo di una variabile, un parametro o una costante, scrivi due punti dopo il nome, seguito dal suo tipo. Ad esempio, ``var health: int``. Questo forza il tipo della variabile a rimanere sempre lo stesso:
ru: Чтобы определить тип переменной, параметра или константы, поставьте двоеточие после имени, а затем укажите тип. Например, ``var health: int``. Это гарантирует, что тип переменной всегда останется неизменным:
ta: ஒரு மாறி, அளவுரு அல்லது மாறிலியின் வகையை வரையறுக்க, பெயருக்குப் பிறகு ஒரு பெருங்குடலை எழுதுங்கள், அதைத் தொடர்ந்து அதன் வகை. எ.கா. `` var உடல்நலம்: int``. இது எப்போதும் ஒரே மாதிரியாக இருக்க மாறியின் வகையை கட்டாயப்படுத்துகிறது:
uk: Щоб визначити тип змінної, параметра або константи, напишіть двокрапку після назви, а потім її тип. Наприклад, ``var health: int``. Це змушує тип змінної завжди залишатися незмінним:
zh_hant: 要定義變數、參數或常數的型別，在名稱後面寫上冒號，接著是型別。例如 ``var health: int``。這會強制該變數的型別保持不變：

source: Godot will try to infer types if you write a colon, but you omit the type:
it: Godot proverà a dedurre il tipo se scrivi i due punti, ma ometti il tipo:
ru: Godot попытается вывести типы, если вы напишете двоеточие, но опустите тип:
ta: நீங்கள் ஒரு பெருங்குடலை எழுதினால் கோடோட் வகைகளை ஊகிக்க முயற்சிக்கும், ஆனால் நீங்கள் வகையைத் தவிர்க்கவும்:
uk: Godot спробує визначити типи, якщо ви поставите двокрапку, але пропустите тип:
zh_hant: 若你寫了冒號卻省略型別，Godot 會嘗試推斷型別：

source: There is no difference between ``=`` and ``:=`` for constants.
fr: Il n'y a pas de différence entre ``=`` et ``:=`` pour les constantes.
ga: Níl aon difríocht idir ``=`` agus ``: =`` le haghaidh comhsheasmhainní.
it: Non c'è differenza tra ``=`` e ``:=`` per le costanti.
ru: Для констант нет разницы между ``=`` и ``:=``.
ta: `` = `` மற்றும் ``: = `` ஆகியவற்றுக்கு இடையே எந்த வித்தியாசமும் இல்லை.
uk: Немає різниці між ``=`` і ``:=`` для констант.
zh_hant: 對於常數來說，``=`` 與 ``:=`` 沒有差別。
