Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/debug/custom_performance_monitors.po
Languages: ga, it, ru, ta, uk, zh_hans, zh_tw

source: Custom performance monitors
ga: Monatóirí feidhmíochta saincheaptha
it: Monitor personalizzati delle prestazioni
ru: Пользовательские мониторы производительности
ta: தனிப்பயன் செயல்திறன் கண்காணிப்பாளர்கள்
uk: Спеціальні монітори продуктивності
zh_hans: 自定义性能监视器
zh_tw: 自訂效能監控

source: Introduction
ga: Réamhrá
it: Introduzione
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_hans: 前言
zh_tw: 前言

source: As explained in the :ref:`doc_debugger_panel` documentation, Godot features a **Debugger > Monitors** bottom panel that allows tracking various values with graphs showing their evolution over time. The data for those graphs is sourced from the engine's :ref:`class_Performance` singleton.
ga: Mar a mhínítear sa cháipéisíocht :ref:`doc_debugger_panel`, tá bunphainéal ** Dífhabhtóir > Monatóirí** ag Godot a ligeann do luachanna éagsúla a rianú le graif a thaispeánann a n-éabhlóid le himeacht ama. Faightear na sonraí do na graif sin ó shingilton :ref:`class_Performance` an innill.
ru: Как объясняется в документации :ref:`doc_debugger_panel`, в Godot есть нижняя панель **Debugger > Monitors**, которая позволяет отслеживать различные значения с помощью графиков, отображающих их динамику. Данные для этих графиков берутся из синглтона движка :ref:`class_Performance`.
ta: : Ref: `doc_debugger_panel` ஆவணங்கள் இதில் விளக்கப்பட்டுள்ளபடி, கோடோட் ஒரு ** பிழைத்திருத்த> மானிட்டர்கள் ** கீழ் குழு ஆகியவற்றைக் கொண்டுள்ளது, இது காலப்போக்கில் அவற்றின் பரிணாமத்தைக் காட்டும் வரைபடங்களுடன் பல்வேறு மதிப்புகளைக் கண்காணிக்க அனுமதிக்கிறது. அந்த வரைபடங்களுக்கான தரவு இயந்திரத்திலிருந்து பெறப்படுகிறது: குறிப்பு: `class_performance` சிங்கிள்டன்.
uk: Як пояснюється в документації :ref:`doc_debugger_panel`, Godot має нижню панель **Debugger > Monitors**, яка дозволяє відстежувати різні значення за допомогою графіків, що показують їх зміну з часом. Дані для цих графіків отримано з синглтона :ref:`class_Performance` двигуна.
zh_hans: 如 :ref:`doc_debugger_panel` 文档所述，Godot 中的 **调试器 > 监视** 底部面板可以跟踪显示各种值，用图表展示这些值随时间的变化。这些图的数据来源于引擎的 :ref:`class_Performance` 单例。
zh_tw: 如 :ref:`doc_debugger_panel` 說明，Godot 提供下方 **除錯器 > 效能監控** 分頁，可透過圖表追蹤各項數值隨時間變化。這些數據來自引擎的 :ref:`class_Performance` 單例物件。

source: Since Godot 4.0, you can declare custom values to be displayed in the Monitors tab. Example use cases for custom performance monitors include:
ga: Ós rud é Godot 4.0, is féidir leat a dhearbhú luachanna saincheaptha a bheith ar taispeáint sa chluaisín Monitors. I measc na gcásanna úsáide samplacha le haghaidh monatóirí feidhmíochta saincheaptha tá:
ru: Начиная с Godot 4.0, вы можете задавать пользовательские значения для отображения на вкладке «Monitors». Примеры использования пользовательских мониторов производительности:
ta: கோடோட் 4.0 என்பதால், தனிப்பயன் மதிப்புகள் மானிட்டர்கள் தாவலில் காண்பிக்கப்படுவதை நீங்கள் அறிவிக்கலாம். எடுத்துக்காட்டு தனிப்பயன் செயல்திறன் கண்காணிப்பாளர்களுக்கான வழக்குகள் பின்வருமாறு:
uk: Починаючи з Godot 4.0, ви можете оголошувати власні значення для відображення на вкладці «Монітори». Приклади використання спеціальних моніторів продуктивності включають:
zh_hans: 从 Godot 4.0 开始，你可以声明要在“监视”选项卡中显示的自定义值。自定义性能监视器的示例用例包括：
zh_tw: 自 Godot 4.0 起，你可自訂在效能監控分頁顯示的任意數值。常見用途包括：

source: Displaying performance metrics that are specific to your project. For instance, in a voxel game, you could create a performance monitor to track the number of chunks that are loaded every second.
ga: Ag taispeáint méadrachtaí feidhmíochta a bhaineann go sonrach le do thionscadal. Mar shampla, i gcluiche voxel, d'fhéadfá monatóireacht feidhmíochta a chruthú chun líon na smután atá luchtaithe gach soicind a rianú.
ru: Отображение показателей производительности, специфичных для вашего проекта. Например, в воксельной игре можно создать монитор производительности для отслеживания количества фрагментов, загружаемых каждую секунду.
ta: உங்கள் திட்டத்திற்கு குறிப்பிட்ட செயல்திறன் அளவீடுகளைக் காண்பிக்கும். உதாரணமாக, ஒரு வோக்சல் விளையாட்டில், ஒவ்வொரு நொடியும் ஏற்றப்படும் துகள்களின் எண்ணிக்கையைக் கண்காணிக்க செயல்திறன் மானிட்டரை உருவாக்கலாம்.
uk: Відображення показників ефективності, які стосуються вашого проекту. Наприклад, у воксельній грі ви можете створити монітор продуктивності для відстеження кількості фрагментів, які завантажуються щосекунди.
zh_tw: 顯示專案特有的效能指標。例如體素遊戲可追蹤每秒載入的區塊數量。

source: Displaying in-game metrics that are not strictly related to performance, but are still useful to graph for debugging purposes. For instance, you could track the number of enemies present in the game to make sure your spawning mechanic works as intended.
ga: Ag taispeáint méadrachtaí in-chluiche nach mbaineann go docht le feidhmíocht, ach atá fós úsáideach chun graf chun críocha dífhabhtaithe. Mar shampla, d'fhéadfá líon na naimhde atá i láthair sa chluiche a rianú chun a chinntiú go n-oibríonn do mheicneoir sceite mar atá beartaithe.
ru: Отображение внутриигровых показателей, которые не связаны напрямую с производительностью, но всё же полезны для построения графиков в целях отладки. Например, вы можете отслеживать количество врагов в игре, чтобы убедиться, что механика появления врагов работает правильно.
ta: செயல்திறனுடன் கண்டிப்பாக தொடர்புடையதாக இல்லாத விளையாட்டு அளவீடுகளைக் காண்பித்தல், ஆனால் பிழைத்திருத்த நோக்கங்களுக்காக வரைபடத்திற்கு இன்னும் பயனுள்ளதாக இருக்கும். உதாரணமாக, உங்கள் முட்டையிடும் மெக்கானிக் நோக்கம் கொண்டதாக செயல்படுவதை உறுதிசெய்ய விளையாட்டில் இருக்கும் எதிரிகளின் எண்ணிக்கையை நீங்கள் கண்காணிக்க முடியும்.
uk: Відображення внутрішньоігрових показників, які не пов’язані виключно з продуктивністю, але все ж корисні для побудови графіків для налагодження. Наприклад, ви можете відстежувати кількість ворогів, присутніх у грі, щоб переконатися, що ваша механіка нересту працює належним чином.
zh_tw: 記錄與效能無關但有助於除錯的遊戲指標。例如追蹤場上敵人數，檢查敵人產生機制是否正常。

source: Creating a custom performance monitor
ga: Monatóir feidhmíochta saincheaptha a chruthú
it: Creare un monitor delle prestazioni personalizzato
ru: Создание собственного монитора производительности
ta: தனிப்பயன் செயல்திறன் மானிட்டரை உருவாக்குதல்
uk: Створення спеціального монітора продуктивності
zh_hans: 创建自定义性能监视器
zh_tw: 建立自訂效能監控

source: In this example, we'll create a custom performance monitor to track how many enemies are present in the currently running project.
ga: Sa sampla seo, cruthóimid monatóir feidhmíochta saincheaptha chun rianú a dhéanamh ar cé mhéad naimhde atá i láthair sa tionscadal atá ag rith faoi láthair.
ru: В этом примере мы создадим специальный монитор производительности, который будет отслеживать количество врагов в текущем запущенном проекте.
ta: இந்த எடுத்துக்காட்டில், தற்போது இயங்கும் திட்டத்தில் எத்தனை எதிரிகள் உள்ளனர் என்பதைக் கண்டறிய தனிப்பயன் செயல்திறன் மானிட்டரை உருவாக்குவோம்.
uk: У цьому прикладі ми створимо спеціальний монітор продуктивності, щоб відстежувати кількість ворогів у поточному проекті.
zh_hans: 在这个例子中，我们将创建一个自定义性能监视器来跟踪当前运行的项目中存在多少敌人。
zh_tw: 本範例將建立一個自訂效能監控，追蹤當前專案中的敵人數量。

source: The main scene features a :ref:`class_Timer` node with the following script attached:
ga: Tá nód :ref:'class_Timer' sa phríomh-radharc agus an script seo a leanas ceangailte leis:
it: La scena principale presenta un nodo :ref:`class_Timer` con il seguente script allegato:
ru: Основная сцена содержит узел :ref:`class_Timer` со следующим прикрепленным скриптом:
ta: முக்கிய காட்சியில் ஒரு: ref: `class_timer` முனை பின்வரும் ச்கிரிப்டுடன் இணைக்கப்பட்டுள்ளது:
uk: Головна сцена містить вузол :ref:`class_Timer` з таким прикріпленим сценарієм:
zh_hans: 主场景中有一个 :ref:`class_Timer` 节点，附加了以下脚本：
zh_tw: 主場景中有一個 :ref:`class_Timer` 節點，附加以下腳本：

source: The second parameter of :ref:`Performance.add_custom_monitor<class_Performance_method_add_custom_monitor>` is a :ref:`class_Callable`.
ga: Is é an dara paraiméadar de :ref:`Performance.add_custom_monitor<class_Performance_method_add_custom_monitor>` ná :ref:`class_Callable`.
it: Il secondo parametro di :ref:`Performance.add_custom_monitor<class_Performance_method_add_custom_monitor>` è un :ref:`class_Callable`.
ru: Вторым параметром :ref:`Performance.add_custom_monitor<class_Performance_method_add_custom_monitor>` является :ref:`class_Callable`.
ta: இதன் இரண்டாவது அளவுரு: குறிப்பு: `செயல்திறன்.ஆட்_கச்டம்_மோனிட்டர் <class_performance_method_add_custom_monitor>` என்பது ஒரு: குறிப்பு: `class_callable`.
uk: Другим параметром :ref:`Performance.add_custom_monitor<class_Performance_method_add_custom_monitor>` є :ref:`class_Callable`.
zh_hans: :ref:`Performance.add_custom_monitor<class_Performance_method_add_custom_monitor>` 方法的第二个参数是一个 :ref:`class_Callable`\ 。
zh_tw: :ref:`Performance.add_custom_monitor<class_Performance_method_add_custom_monitor>` 的第二個參數為 :ref:`class_Callable`。

source: ``enemy.tscn`` is a scene with a Node2D root node and Timer child node. The Node2D has the following script attached:
ga: Is radharc é ''enemy.tscn'' le nód fréimhe Node2D agus nód linbh Timer. Tá an script seo a leanas ceangailte leis an Node2D:
it: ``enemy.tscn`` è una scena con un nodo radice Node2D e un nodo figlio Timer. Il Node2D ha il seguente script allegato:
ru: ``enemy.tscn`` — это сцена с корневым узлом Node2D и дочерним узлом Timer. К Node2D прикреплён следующий скрипт:
ta: `` எதிரி. Node2D இல் பின்வரும் ச்கிரிப்ட் இணைக்கப்பட்டுள்ளது:
uk: ``enemy.tscn`` — це сцена з кореневим вузлом Node2D і дочірнім вузлом Timer. До Node2D додається такий сценарій:
zh_hans: ``enemy.tscn`` 是一个根节点为 Node2D、带有 Timer 子节点的场景。Node2D 附加了以下脚本：
zh_tw: ``enemy.tscn`` 是一個擁有 Node2D 根節點與 Timer 子節點的場景，Node2D 節點附有如下腳本：

source: In this example, since we spawn 20 enemies per second, and each enemy despawns 2.5 seconds after they spawn, we expect the number of enemies present in the scene to stabilize to 50. We can make sure about this by looking at the graph.
ga: Sa sampla seo, ós rud é sceithimid naimhde 20 in aghaidh an tsoicind, agus go sceitheann gach namhaid 2.5 soicind tar éis dóibh sceitheadh, táimid ag súil le líon na naimhde atá i láthair sa radharc chun cobhsú go 50. Is féidir linn a chinntiú faoi seo trí bhreathnú ar an ngraf.
it: In questo esempio, poiché generiamo 20 nemici al secondo e ogni nemico scompare 2,5 secondi dopo essere stati generati, ci aspettiamo che il numero di nemici presenti nella scena si stabilizzi a 50. Possiamo esserne sicuri osservando il grafico.
ru: В этом примере, поскольку мы создаем 20 врагов в секунду и каждый враг исчезает через 2,5 секунды после появления, мы ожидаем, что количество врагов, присутствующих на сцене, стабилизируется на уровне 50. Мы можем убедиться в этом, посмотрев на график.
ta: இந்த எடுத்துக்காட்டில், நாங்கள் நொடிக்கு 20 எதிரிகளை உருவாக்கியதிலிருந்து, ஒவ்வொரு எதிரியும் 2.5 வினாடிகளுக்குப் பிறகு, காட்சியில் இருக்கும் எதிரிகளின் எண்ணிக்கை 50 ஆக உறுதிப்படுத்தப்படும் என்று நாங்கள் எதிர்பார்க்கிறோம். வரைபடத்தைப் பார்ப்பதன் மூலம் இதைப் பற்றி உறுதி செய்யலாம்.
uk: У цьому прикладі, оскільки ми створюємо 20 ворогів на секунду, і кожен ворог зникає через 2,5 секунди після появи, ми очікуємо, що кількість ворогів, присутніх у сцені, стабілізується до 50. Ми можемо переконатися в цьому, подивившись на графік.
zh_hans: 在这个例子中，由于我们每秒生成20个敌人，每个敌人在生成后2.5秒就会死亡，我们预计场景中存在的敌人数量将稳定在50个。我们可以通过查看图表来确定这一点。
zh_tw: 本例中，每秒產生 20 名敵人，每名敵人存活 2.5 秒，理論上場景內敵人數將穩定於 50。可透過監控圖表驗證此數值。

source: To visualize the graph created from this custom performance monitor, run the project, switch to the editor while the project is running and open **Debugger > Monitors** at the bottom of the editor window. Scroll down to the newly available **Game** section and check **Enemies**. You should see a graph appearing as follows:
ga: Chun an graf a chruthaítear ón monatóir feidhmíochta saincheaptha seo a shamhlú, rith an tionscadal, aistrigh go dtí an t-eagarthóir agus an tionscadal ar siúl agus oscail **Dífhabhtóir > Monatóirí** ag bun na fuinneoige eagarthóra. Scrollaigh síos go dtí an rannán ** Cluiche** nua atá ar fáil agus seiceáil **Naimhde**. Ba cheart go bhfeicfeá graf mar seo a leanas:
it: Per visualizzare il grafico creato da questo monitor di prestazioni personalizzato, eseguire il progetto, passare all'editor mentre il progetto è in esecuzione e aprire **Debugger > Monitor** in basso alla finestra dell'editor. Scorri verso il basso fino alla nuova sezione **Game** e seleziona **Enemies**. Dovrebbe esserci un grafico come questo:
ru: Чтобы визуализировать график, созданный этим пользовательским монитором производительности, запустите проект, перейдите в редактор во время его работы и откройте **Debugger > Monitors** в нижней части окна редактора. Прокрутите вниз до нового раздела **Game** и отметьте **Enemies**. Вы увидите следующий график:
ta: இந்த தனிப்பயன் செயல்திறன் மானிட்டரிலிருந்து உருவாக்கப்பட்ட வரைபடத்தைக் காட்சிப்படுத்த, திட்டத்தை இயக்கவும், திட்டம் இயங்கும் போது எடிட்டருக்கு மாறவும், எடிட்டர் சாளரத்தின் அடிப்பகுதியில் ** பிழைத்திருத்தம்> மானிட்டர்கள் ** ஐ திறக்கவும். புதிதாக கிடைக்கக்கூடிய ** கேம் ** பிரிவுக்கு உருட்டவும், ** எதிரிகள் ** சரிபார்க்கவும். ஒரு வரைபடம் பின்வருமாறு தோன்றுவதை நீங்கள் காண வேண்டும்:
uk: Щоб візуалізувати графік, створений за допомогою цього спеціального монітора продуктивності, запустіть проект, перейдіть до редактора під час виконання проекту та відкрийте **Налагоджувач > Монітори** внизу вікна редактора. Прокрутіть униз до нещодавно доступного розділу **Гра** та позначте **Вороги**. Ви повинні побачити наступний графік:
zh_tw: 要檢視自訂效能監控的圖表，執行專案後切回編輯器，於下方 **除錯器 > 效能監控** 分頁中，捲動至新出現的 **遊戲** 分類，勾選 **敵人**，即可看到如下圖表：

source: Example editor graph from a custom performance monitor
ga: Graf eagarthóra samplach ó mhonatóir feidhmíochta saincheaptha
it: Esempio di grafico dell'editor da un monitor delle prestazioni personalizzato
ru: Пример графика редактора из пользовательского монитора производительности
ta: தனிப்பயன் செயல்திறன் மானிட்டரிலிருந்து எடுத்துக்காட்டு எடிட்டர் வரைபடம்
uk: Приклад графіка редактора з настроюваного монітора продуктивності
zh_hans: 自定义性能监视器的编辑器图表示例
zh_tw: 自訂效能監控於編輯器內的圖表示例

source: The performance monitor handling code doesn't have to live in the same script as the nodes themselves. You may choose to move the performance monitor registration and getter function to an :ref:`autoload <doc_singletons_autoload>` instead.
ga: Ní gá go mbeadh an cód láimhseála monatóireachta feidhmíochta beo sa script chéanna leis na nóid féin. Is féidir leat an fheidhm chláraithe agus glacadóir feidhmíochta a bhogadh go dtí :ref:`uathlódáil <doc_singletons_autoload>` ina ionad sin.
it: Il codice di gestione del monitor di prestazioni non deve necessariamente risiedere nello stesso script dei nodi stessi. È possibile scegliere di spostare la registrazione del monitor di prestazioni e la funzione getter in un :ref:`autoload <doc_singletons_autoload>`.
ru: Код обработки данных монитора производительности не обязательно должен располагаться в том же скрипте, что и сами узлы. Вы можете перенести регистрацию и функцию получения данных монитора производительности в :ref:`autoload <doc_singletons_autoload>`.
ta: செயல்திறன் மானிட்டர் கையாளுதல் குறியீடு முனைகளின் அதே ச்கிரிப்டில் வாழ வேண்டியதில்லை. செயல்திறன் மானிட்டர் பதிவு மற்றும் பெறுநர் செயல்பாட்டை ஒரு க்கு நகர்த்த நீங்கள் தேர்வு செய்யலாம்: குறிப்பு: `ஆட்டோலோட் <doc_singletons_autoload>` அதற்கு பதிலாக.
uk: Код обробки монітора продуктивності не обов’язково повинен міститись у тому ж сценарії, що й самі вузли. Натомість ви можете перемістити реєстрацію монітора продуктивності та функцію отримання до :ref:`autoload <doc_singletons_autoload>`.
zh_hans: 性能监视器处理代码不必与节点本身位于同一脚本中。你可以选择将性能监视器的注册和 getter 函数移动到\ :ref:`自动加载 <doc_singletons_autoload>`\ 中。
zh_tw: 效能監控相關程式碼不一定要寫在節點自身腳本內。也可將註冊與取值函式移到 :ref:`autoload <doc_singletons_autoload>` 中集中管理。

source: Querying a performance monitor in a project
ga: Monatóir feidhmíochta a chuardach i dtionscadal
it: Consultare un monitor delle prestazioni in un progetto
ru: Запрос к монитору производительности в проекте
ta: ஒரு திட்டத்தில் செயல்திறன் மானிட்டரை வினவுகிறது
uk: Запит до монітора продуктивності в проекті
zh_hans: 在项目中查询性能监视器
zh_tw: 於專案中查詢效能監控數值

source: If you wish to display the value of the performance monitor in the running project's window (rather than the editor), use ``Performance.get_custom_monitor("category/name")`` to fetch the value of the custom monitor. You can display the value using a :ref:`class_Label`, :ref:`class_RichTextLabel`, :ref:`doc_custom_drawing_in_2d`, :ref:`doc_3d_text`, etc.
ga: Más mian leat luach an mhonatóra feidhmíochta a thaispeáint i bhfuinneog an tionscadail reatha (seachas an t-eagarthóir), bain úsáid as ''Performance.get_custom_monitor("catagóir/ainm")'' chun luach an mhonatóra saincheaptha a fháil. Is féidir leat an luach a thaispeáint ag baint úsáide as :ref:'class_Label', :ref:'class_RichTextLabel', :ref:'doc_custom_drawing_in_2d', :ref:'doc_3d_text', etc.
it: Se si desidera visualizzare il valore del monitor delle prestazioni nella finestra del progetto in esecuzione (anziché nell'editor), usare ``Performance.get_custom_monitor("category/name")`` per recuperare il valore del monitor personalizzato. È possibile visualizzare il valore usando un :ref:`class_Label`, :ref:`class_RichTextLabel`, :ref:`doc_custom_drawing_in_2d`, :ref:`doc_3d_text`, ecc.
ru: Если вы хотите отобразить значение монитора производительности в окне запущенного проекта (а не в редакторе), используйте ``Performance.get_custom_monitor("category/name")`` для получения значения пользовательского монитора. Вы можете отобразить значение, используя :ref:`class_Label`, :ref:`class_RichTextLabel`, :ref:`doc_custom_drawing_in_2d`, :ref:`doc_3d_text` и т. д.
ta: செயல்திறன் மானிட்டரின் மதிப்பை இயங்கும் திட்டத்தின் சாளரத்தில் (எடிட்டரை விட) காண்பிக்க விரும்பினால், தனிப்பயன் மானிட்டரின் மதிப்பைப் பெற `` செயல்திறன். A: ref: `class_label`,: ref:` class_richtextlabel`,: ref: `doc_custom_drawing_in_2d`,: ref:` doc_3d_text`, போன்றவை.
uk: Якщо ви хочете відобразити значення монітора продуктивності у вікні запущеного проекту (а не в редакторі), використовуйте ``Performance.get_custom_monitor("category/name")``, щоб отримати значення користувацького монітора. Ви можете відобразити значення за допомогою :ref:`class_Label`, :ref:`class_RichTextLabel`, :ref:`doc_custom_drawing_in_2d`, :ref:`doc_3d_text` тощо.
zh_hans: 如果你想在运行中的项目窗口（而不是编辑器窗口）中显示性能监视器的值，可以使用 ``Performance.get_custom_monitor("分类/名称")`` 来获取自定义监视器的值，这个值可以放在 :ref:`class_Label`\ 、\ :ref:`class_RichTextLabel`\ 、\ :ref:`doc_custom_drawing_in_2d`\ 、\ :ref:`doc_3d_text` 中显示。
zh_tw: 若你想在遊戲視窗（非編輯器）顯示監控數值，可用 ``Performance.get_custom_monitor("分類/名稱")`` 讀取。可用 :ref:`class_Label`、:ref:`class_RichTextLabel`、:ref:`doc_custom_drawing_in_2d`、:ref:`doc_3d_text` 等方式顯示。

source: This method can be used in exported projects as well (debug and release mode), which allows you to create visualizations outside the editor.
ga: Is féidir an modh seo a úsáid i dtionscadail onnmhairithe chomh maith (modh dífhabhtaithe agus scaoilte), a ligeann duit léirshamhlú a chruthú lasmuigh den eagarthóir.
it: Questo metodo può servire anche nei progetti esportati (in modalità debug e rilascio), consentendo di creare visualizzazioni al di fuori dell'editor.
ru: Этот метод можно использовать и в экспортированных проектах (режим отладки и выпуска), что позволяет создавать визуализации вне редактора.
ta: இந்த முறையை ஏற்றுமதி செய்யப்பட்ட திட்டங்களிலும் (பிழைத்திருத்த மற்றும் வெளியீட்டு முறை) பயன்படுத்தலாம், இது எடிட்டருக்கு வெளியே காட்சிப்படுத்தல்களை உருவாக்க உங்களை அனுமதிக்கிறது.
uk: Цей метод також можна використовувати в експортованих проектах (режим налагодження та випуску), що дозволяє створювати візуалізації поза редактором.
zh_hans: 此方法也可用于导出项目（调试和发布模式），你可以在编辑器外创建可视化内容。
zh_tw: 此方法可用於匯出專案（除錯與發行模式），讓你在編輯器外也能顯示自訂效能圖表。
