Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/bug_triage_guidelines.po
Languages: ga, it, pl, ru, ta, tr, uk, zh_tw

source: The categories are used for general triage of the issues. They can be combined in some way when relevant, e.g. an issue can be labelled *Enhancement* and *Usability* at the same time if it's an issue to improve usability. Or *Feature proposal* and *Discussion* if it's a non-consensual feature request, or one that is not precise enough to be worked on. At least one of the categories *Bug*, *Enhancement* or *Discussion* is used to describe an issue or pull request.
ta: பிரிவுகள் சிக்கல்களின் பொதுவான சோதனைக்கு பயன்படுத்தப்படுகின்றன. பொருத்தமானதாக இருக்கும்போது அவை ஏதோவொரு வகையில் இணைக்கப்படலாம், எ.கா. பயன்பாட்டினை மேம்படுத்துவதற்கான சிக்கலாக இருந்தால், அதே நேரத்தில் ஒரு சிக்கலை * விரிவாக்கம் * மற்றும் * பயன்பாட்டினை * என்று பெயரிடலாம். அல்லது * அம்ச முன்மொழிவு * மற்றும் * கலந்துரையாடல் * இது ஒரு சம்மதமில்லாத அம்சக் கோரிக்கை அல்லது வேலை செய்ய போதுமான துல்லியமானதாக இல்லாவிட்டால். ஒரு சிக்கலை விவரிக்க அல்லது கோரிக்கையை விவரிக்க *பிழை *, *விரிவாக்கம் *அல்லது *கலந்துரையாடல் *வகைகளில் குறைந்தபட்சம் ஒன்று பயன்படுத்தப்படுகிறது.
tr: Kategoriler, sorunların genel olarak önceliklendirilmesi için kullanılır. İlgili olduğunda bir şekilde birleştirilebilirler, örneğin bir sorun kullanılabilirliği geliştirmeye yönelik bir sorunsa aynı anda *Enhancement* ve *Usability* olarak etiketlenebilir. Ya da eğer bu üzerinde anlaşma sağlanmamış bir özellik talebiyse ya da üzerinde çalışılacak kadar kesin durumda değilse *Feature proposal* ve *Discussion* olarak etiketlenebilir. Bir sorunu veya çekme isteğini tanımlamak için *Bug*, *Enhancement* veya *Discussion* kategorilerinden en az biri kullanılır.

source: **Topics:**
pl: **Tematy:**
ru: **Темы:**
ta: ** தலைப்புகள்: **
tr: **Konular:**

source: *2D*: relates to 2D-specific issues. Should be coupled with one of the labels below, and should not be coupled with *3D*.
ta: *2 டி*: 2 டி-குறிப்பிட்ட சிக்கல்களுடன் தொடர்புடையது. கீழே உள்ள லேபிள்களில் ஒன்றோடு இணைக்கப்பட வேண்டும், மேலும் *3d *உடன் இணைக்கப்படக்கூடாது.
tr: *2D*: 2B'ye özgü konularla ilgilidir. Aşağıdaki etiketlerden biriyle birleştirilmeli ama *3D* ile birleştirilmemelidir.

source: *3D*: relates to 3D-specific issues. Should be coupled with one of the labels below, and should not be coupled with *2D*.
ta: *3D*: 3D- குறிப்பிட்ட சிக்கல்களுடன் தொடர்புடையது. கீழே உள்ள லேபிள்களில் ஒன்றோடு இணைக்கப்பட வேண்டும், மேலும் *2d *உடன் இணைக்கக்கூடாது.
tr: *3D*: 3B'ye özgü konularla ilgilidir. Aşağıdaki etiketlerden biriyle birleştirilmeli ama *2D* ile birleştirilmemelidir.

source: *Audio*: relates to the audio features (low and high level).
ru: *Audio*: относится к аудиофункциям (низкий и высокий уровень).
ta: *ஆடியோ*: ஆடியோ அம்சங்களுடன் தொடர்புடையது (குறைந்த மற்றும் உயர் நிலை).

source: *Dotnet*: relates to the C# / Dotnet bindings.
ta: *டாட்நெட்*: சி# / டாட்நெட் பிணைப்புகளுடன் தொடர்புடையது.
tr: *Dotnet*: C# / Dotnet bağlamaları ile ilgilidir.

source: **Platforms:**
pl: **Platformy:**
ru: **Платформы:**
ta: ** தளங்கள்: **
tr: **Platformlar:**

source: **Area:**
ta: ** பகுதி: **
tr: **Alan:**

source: **Content:**
ta: ** உள்ளடக்கம்: **
tr: **İçerik:**

source: **Topic:**
ta: ** தலைப்பு: **
tr: **Konu:**

source: `Milestones <https://github.com/godotengine/godot/milestones>`_ correspond to planned future versions of Godot for which there is an existing roadmap. Issues that fit in the said roadmap should be filed under the corresponding milestone; if they don't correspond to any current roadmap, they should be left without milestone. As a rule of thumb, an issue corresponds to a given milestone if it concerns a feature that is new in the milestone, or a critical bug that can't be accepted in any future stable release, or anything that Juan wants to work on right now. :)
ru: `Вехи <https://github.com/godotengine/godot/milestones>`_ соответствуют запланированным будущим версиям Godot, для которых существует дорожная карта. Проблемы, которые соответствуют указанной дорожной карте, должны быть зарегистрированы в соответствии с соответствующей вехой; если они не соответствуют какой-либо текущей дорожной карте, их следует оставить без вех. Как правило, проблема соответствует заданной вехе, если она касается функции, которая является новой в вехе, или критической ошибки, которая не может быть принята ни в одной будущей стабильной версии, или чего-либо, над чем Хуан хочет работать правильно. сейчас. :)
ta: `மைல்கற்கள் <https://github.com/godotengine/godot/milestones>` _ கோடோட்டின் திட்டமிடப்பட்ட எதிர்கால பதிப்புகளுடன் ஒத்துப்போகிறது, அதற்காக ஏற்கனவே உள்ள பாதை வரைபடம் உள்ளது. அந்த சாலை வரைபடத்தில் பொருந்தக்கூடிய சிக்கல்கள் தொடர்புடைய மைல்கல்லின் கீழ் தாக்கல் செய்யப்பட வேண்டும்; அவை தற்போதைய சாலை வரைபடத்துடன் ஒத்துப்போகவில்லை என்றால், அவை மைல்கல் இல்லாமல் இருக்க வேண்டும். கட்டைவிரல் விதியாக, மைல்கல்லில் புதியதாக இருக்கும் ஒரு நற்பொருத்தம் அல்லது எதிர்கால நிலையான வெளியீட்டில் ஏற்றுக்கொள்ள முடியாத ஒரு முக்கியமான பிழை அல்லது சுவான் சரியான முறையில் செயல்பட விரும்பும் எதையும் பற்றி ஒரு குறிப்பிட்ட மைல்கல்லுக்கு ஒத்திருக்கிறது இப்போது. :)
tr: `Kilometre Taşları <https://github.com/godotengine/godot/milestones>`_ hazırda bir yol haritası bululan Godot'nun planlanan gelecek sürümlerine karşılık gelir. Söz konusu yol haritasına uyan sorunlar ilgili kilometre taşı altında dosyalanmalıdır; mevcut herhangi bir yol haritasına karşılık gelmiyorlarsa, kilometre taşı olmadan bırakılmalıdırlar. Genel bir kural olarak, kilometre taşında yeni olan bir özelliğe karşılık geliyorsa, veya gelecekteki herhangi bir kararlı sürümde kabul edilemeyecek kritik bir hata hakkındaysa, veya Juan'ın şu anda üzerinde çalışmak isteyeceği herhangi bir şeyle ilgiliyse, her sorun belirli bir kilometre taşına karşılık gelecektir :)

source: Contributors are free to pick issues regardless of their assigned milestone; if a fix is proposed for a bug that was not deemed urgent and thus without milestone, it would likely still be very welcome.
ru: Вкладчики могут выбирать проблемы независимо от назначенной им вехи; если предлагается исправление ошибки, которая не считалась срочной и поэтому не имела вехи, оно, вероятно, все равно будет очень приветствоваться.
ta: ஒதுக்கப்பட்ட மைல்கல்லைப் பொருட்படுத்தாமல் பங்களிப்பாளர்கள் சிக்கல்களைத் தேர்வுசெய்ய இலவசம்; அவசரமாகக் கருதப்படாத ஒரு பிழைக்கு ஒரு பிழைத்திருத்தம் முன்மொழியப்பட்டால், இதனால் மைல்கல் இல்லாமல், அது இன்னும் மிகவும் வரவேற்கத்தக்கதாக இருக்கும்.
tr: Katkıda bulunanlar, atanan kilometre taşına bakılmaksızın sorunları seçmekte özgürdür; acil olarak kabul edilmeyen ve dolayısıyla kilometre taşı atanmamış bir hata için bir düzeltme önerilirse, muhtemelen yine de çok hoş karşılanacaktır.

source: Translation status
ru: Статус перевода
