Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/bug_triage_guidelines.po
Languages: ga, it, pl, ru, ta, tr, uk, zh_tw

source: *Performance*: issues that directly impact engine or editor performance. Can also be used for pull requests that improve performance or add low-end-friendly options. Should not be coupled with *Usability*.
ga: * Feidhmíocht*: saincheisteanna a théann i bhfeidhm go díreach ar fheidhmíocht inne Is féidir é a úsáid freisin le haghaidh iarratais tarraingthe a fheabhsaíonn feidhmíocht nó a chuireann roghanna neamhdhíobhál Níor chóir é a chur in éineacht len*Úsáidteacht*.
it: *Performance*: problemi che hanno un impatto diretto sulle prestazioni del motore o dell'editor. Può anche essere usato per richieste di pull che migliorano le prestazioni o aggiungono opzioni di fascia bassa. Non dovrebbe essere accoppiato con *Usabilità*.
ta: *செயல்திறன்*: இயந்திரம் அல்லது எடிட்டர் செயல்திறனை நேரடியாக பாதிக்கும் சிக்கல்கள். செயல்திறனை மேம்படுத்தும் அல்லது குறைந்த இறுதி நட்பு விருப்பங்களைச் சேர்க்கும் இழுக்கும் கோரிக்கைகளுக்கும் பயன்படுத்தலாம். *பயன்பாட்டினை *உடன் இணைக்கக்கூடாது.
tr: *Performance*: Motor veya düzenleyici performansını doğrudan etkileyen sorunlar. Performansı artıran veya düşük-uç-dostu seçenekler ekleyen çekme istekleri için de kullanılabilir. *Usability* ile birleştirilmemelidir.
uk: *Продуктивність*: проблеми, які безпосередньо впливають на роботу механізму або редактора. Також може використовуватися для запитів на витягування, які покращують продуктивність або додають зручні опції. Не має поєднуватися з *Юзабіліті*.
zh_tw: *Performance*：直接影響引擎或編輯器效能的問題。也適用於提升效能或增加低階裝置友善選項的 PR。不應與 *Usability* 標籤同時使用。

source: *Regression*: the bug appeared after a stable release not exhibiting the bug was released.
ga: * Aischéimniú*: bhí an fabht le feiceáil tar éis scaoileadh cobhsaí nach dtaispeánann an fabht a scaoilfear.
it: *Regression*: il bug è apparso dopo il rilascio di una versione stabile che non presentava il bug.
ta: *பின்னடைவு*: பிழையை வெளிப்படுத்தாத நிலையான வெளியீட்டிற்குப் பிறகு பிழை தோன்றியது.
tr: *Regression*: (gerileme) Hata, hatayı göstermeyen bir kararlı sürüm yayınlandıktan sonra ortaya çıktı.
uk: *Регресія*: помилка з’явилася після випуску стабільної версії, у якій не виявлено помилки.
zh_tw: *Regression*：此 Bug 在某個無此問題的穩定版發佈後才出現。

source: *Salvageable*: the pull request can't be merged due to design issues or merge conflicts and its author is not active anymore. However, it can still be picked up by another contributor to bring it to a mergeable state. To do so, you need to open a new pull request based on the original pull request.
uk: *Можна відновити*: запит на злиття не можна об'єднати через проблеми з дизайном або конфлікти злиття, а його автор більше неактивний. Однак, його все ще може взяти інший учасник, щоб привести до стану, придатного для об'єднання. Для цього потрібно відкрити новий запит на злиття на основі оригінального запиту на злиття.

source: *Spam*: intentional spam issues, and extremely low-effort PRs. Used sparingly, since we give contributors and users the benefit of the doubt. In most cases, *Needs work* or *Archived* is more appropriate.
uk: *Спам*: навмисні проблеми зі спамом та надзвичайно низькопрофільні PR-повідомлення. Використовується економно, оскільки ми даємо авторам та користувачам шанс на успіх. У більшості випадків доречніше використовувати *Потрібно доопрацювання* або *Архівовано*.

source: *Tracker*: issue used to track other issues (like all issues related to the plugin system).
ga: * Rianó*: saincheist a úsáidtear chun saincheisteanna eile a rianú (cosúil le gach saincheist a bhaineann leis an gcóras breiseán).
pl: *Tracker*: Zgłoszenie problemu który służy do śledzenia powiązanych ze sobą problemów lub pull requestów(np. związanych z systemem rozszerzeń).
ta: *டிராக்கர்*: பிற சிக்கல்களைக் கண்காணிக்கப் பயன்படுத்தப்படும் சிக்கல் (சொருகி அமைப்பு தொடர்பான அனைத்து சிக்கல்களும் போல).
tr: *Tracker*: (izleyici) bu sorun, diğer sorunları izlemek için kullanılır (eklenti sistemiyle ilgili tüm sorunlar gibi).
uk: *Tracker*: проблема, яка використовується для відстеження інших проблем (наприклад, усіх проблем, пов’язаних із системою плагінів).
zh_tw: *Tracker*：用於追蹤其他 Issue 的 Issue（如所有與外掛系統相關的議題）。

source: *Usability*: issues that directly impact user usability. Should not be coupled with *Performance*.
ga: * Úsáidteacht*: saincheisteanna a théann i bhfeidhm go díreach ar inúsáideacht úsáideora Níor chóir é a chur in éineacht len*Feidhmíocht*.
it: *Usabilità*: problemi che hanno un impatto diretto sull'usabilità per l'utente. Non dovrebbe essere accoppiato con *Performance*.
ta: *பயன்பாட்டினை*: பயனர் பயன்பாட்டினை நேரடியாக பாதிக்கும் சிக்கல்கள். *செயல்திறன் *உடன் இணைக்கக்கூடாது.
tr: *Usability*: (kulanılabilirlik) Kullanıcı kullanılabilirliğini doğrudan etkileyen sorunlar. *Performance* ile birleştirilmemelidir.
uk: *Юзабіліті*: проблеми, які безпосередньо впливають на зручність використання. Не слід поєднувати з *продуктивністю*.
zh_tw: *Usability*：直接影響使用者體驗或可用性的問題。不應與 *Performance* 標籤同時使用。

source: The categories are used for general triage of the issues. They can be combined in some way when relevant, e.g. an issue can be labeled *Bug* and *Usability* at the same time if it's a bug that affects usability. Or *Enhancement* and *Discussion* if it's an improvement that requires discussion of the best approach. At least one of the categories *Bug*, *Enhancement*, or *Discussion* are used to describe an issue or pull request.
uk: Категорії використовуються для загального сортування проблем. Їх можна певним чином поєднувати, коли це доречно, наприклад, проблему можна позначити одночасно як *Помилка* та *Зручність використання*, якщо це помилка, яка впливає на зручність використання. Або *Покращення* та *Обговорення*, якщо це покращення, яке вимагає обговорення найкращого підходу. Принаймні одна з категорій *Помилка*, *Покращення* або *Обговорення* використовується для опису проблеми або запиту на внесення змін.

source: Topics:
uk: Теми:

source: *2D*: relates to 2D nodes. Should be coupled with one of the labels below, and should not be coupled with *3D*.
uk: *2D*: стосується 2D-вузлів. Слід поєднувати з однією з наведених нижче міток, а не з *3D*.

source: *3D*: relates to 3D nodes. Should be coupled with one of the labels below, and should not be coupled with *2D*.
uk: *3D*: стосується 3D-вузлів. Слід поєднувати з однією з наведених нижче міток, а не з *2D*.

source: *Animation*: relates to the Animation system, editors and importers.
ga: *Beochanach*: baineann leis an gcóras Beochana, eagarthóirí agus allmhaireoirí.
it: *Animation*: si riferisce al sistema di animazione, agli editor e agli importatori.
ta: *அனிமேசன்*: அனிமேசன் சிச்டம், தொகுப்பாளர்கள் மற்றும் இறக்குமதியாளர்களுடன் தொடர்புடையது.
tr: *Canlandırma*: Canlandırma sistemi, düzenleyicileri ve dışa aktarıcıları ile ilgilidir.
uk: *Анімація*: стосується системи анімації, редакторів та імпортерів.
zh_tw: *Animation*：與動畫系統、動畫編輯器與動畫匯入工具相關。

source: *Assetlib*: relates to issues with the asset library.
ga: *Assetlib*: baineann le saincheisteanna leis an leabharlann sócmhainní.
it: *Assetlib*: si riferisce ai problemi con la libreria dei contenuti.
pl: *Assetlib*: odnosi się do kwestii związanych z biblioteką zasobów.
ru: *Assetlib*: относится к проблемам с библиотекой активов.
ta: *ASSETLIB*: சொத்து நூலகத்துடனான சிக்கல்களுடன் தொடர்புடையது.
tr: *Assetlib*: varlık kütüphanesi ile ilgili sorunlarla ilgilidir.
uk: *Assetlib*: стосується вад у бібліотеці asset.
zh_tw: *Assetlib*：與素材庫相關的問題。

source: *Audio*: relates to the audio features (low- and high-level).
it: *Audio*: si riferisce alle funzionalità audio (basso e alto livello).
uk: *Аудіо*: стосується аудіофункцій (низький і високий рівень).
zh_tw: *Audio*：與音訊功能（包括低層與高層）有關的問題。

source: *Buildsystem*: relates to building issues, either linked to the SCons buildsystem or to compiler peculiarities.
ga: *Córas Tógála*: baineann sé le saincheisteanna tógála, atá nasctha leis an gcóras tógála SCons nó le saintréithe tiomsaitheora.
it: *Buildsystem*: si riferisce a problemi di compilazione, collegati al buildsystem di SCons o a peculiarità del compilatore.
pl: *Buildsystem*: odnosi się do problemów z budowaniem programu, połączeniem z SCons i kompilacją.
ru: *Buildsystem*: относится к вопросам сборки, связанным либо с системой сборки SCons, либо с особенностями компилятора.
ta: *Buildsystem*: relates பெறுநர் building issues, either linked பெறுநர் the SCons buildsystem or பெறுநர் தொகுப்பி peculiarities.
tr: *Buildsystem*: SCons yapı sistemiyle ya da derleyici özellikleriyle bağlantılı olan derleme sorunlarıyla ilgilidir.
uk: *Buildsystem*: стосується вад зі збиранням, пов'язаних або із системою збирання SCons, або із особливостями компілятора.
zh_tw: *Buildsystem*：與建置問題有關，可能涉及 SCons 建置系統或特定編譯器。

source: *Codestyle*: relates to the programming style used within the codebase.
ga: *Stíl Cód*: baineann sé leis an stíl cláraithe a úsáidtear laistigh den chód-bhunachar.
it: *Codestyle*: si riferisce allo stile di programmazione utilizzato nel codice sorgente.
ta: *கோட்ச்டைல்*: குறியீட்டுக்குள் பயன்படுத்தப்படும் நிரலாக்க பாணியுடன் தொடர்புடையது.
tr: *Codestyle*: kod tabanı içinde kullanılan programlama tarzıyla ilgilidir.
uk: *Стиль коду*: стосується стилю програмування, який використовується в кодовій базі.
zh_tw: *Codestyle*：與程式碼風格有關的問題。

source: *Core*: anything related to the core engine. Specific topics are split off separately as they crop up.
ga: *Core*: aon rud a bhaineann leis an gcroí-inneall. Roinntear topaicí sonracha ar leithligh agus iad ag teacht chun cinn.
it: *Core*: tutto ciò che riguarda il motore principale. Gli argomenti specifici sono suddivisi separatamente man mano che si presentano.
ta: *கோர்*: கோர் எஞ்சின் தொடர்பான எதுவும். குறிப்பிட்ட தலைப்புகள் தனித்தனியாக பிரிக்கப்படுகின்றன.
tr: *Core*: çekirdek motorla ilgili her şey. Belirli konular ortaya çıktıkça ayrı ayrı ele alınmaktadır.
uk: *Core*: усе, що стосується основного двигуна. Конкретні теми виділяються окремо в міру появи.
zh_tw: *Core*：與核心引擎相關的任何內容。若主題夠大會拆分為獨立議題。

source: *Dotnet*: relates to the C# / .NET bindings.
uk: *Dotnet*: стосується зв'язок C# / .NET.

source: *Editor*: relates to issues in the editor (mainly UI).
ga: *Eagarthóir*: baineann sé le saincheisteanna san eagarthóir (UI den chuid is mó).
it: *Editor*: si riferisce ai problemi dell'editor (principalmente l'interfaccia utente).
pl: *Editor*: odnosi się do edytora (głównie UI).
ru: *Editor*: относится к проблемам в редакторе (в основном к пользовательскому интерфейсу).
ta: *ஆசிரியர்*: எடிட்டரில் உள்ள சிக்கல்களுடன் தொடர்புடையது (முக்கியமாக UI).
tr: *Editor*: düzenleyicideki sorunlarla ilgilidir (özellikle kullanıcı arayüzü).
uk: *Editor*: стосується вад у редакторів (в основному, інтерфейсі користувача).
zh_tw: *Editor*：與 Godot 編輯器本身（主要是 UI）相關的問題。

source: *Export*: relates to the export system and templates.
ga: * Easpórtáil*: baineann sé leis an gcóras easpórtála agus teimpléid.
it: *Esporta*: si riferisce al sistema di esportazione e ai modelli.
ta: *ஏற்றுமதி*: ஏற்றுமதி அமைப்பு மற்றும் வார்ப்புருக்கள் தொடர்பானது.
tr: *Export*: dışa aktarma sistemi ve şablonlarla ilgilidir.
uk: *Експорт*: відноситься до системи експорту та шаблонів.
zh_tw: *Export*：與匯出系統及匯出範本相關的問題。

source: *GDExtension*: relates to the GDExtension system for native extensions.
ga: * GDExtension*: baineann sé leis an gdeXtension le haghaidh síntí dúchasacha.
it: *GDExtension*: si riferisce al sistema GDExtension per le estensioni native.
ta: *Gdextension*: சொந்த நீட்டிப்புகளுக்கான gdextension அமைப்புடன் தொடர்புடையது.
tr: *GDExtension*: yerel uzantılar için GDExtension sistemi ile ilgilidir.
uk: *GDExtension*: відноситься до системи GDExtension для власних розширень.
zh_tw: *GDExtension*：與原生擴充功能 GDExtension 系統相關的問題。

source: *GDScript*: relates to GDScript.
ga: *GDScript*: baineann sé le GDScript.
it: *GDScript*: si riferisce a GDScript.
pl: *GDScript*: odnosi się do GDScript.
ru: *GDScript*: относится к GDScript.
ta: *Gdscript*: GDSCRIPT உடன் தொடர்புடையது.
tr: *GDScript*: GDScript ile ilgilidir.
uk: *GDScript*: стосується GDScript.
zh_tw: *GDScript*：與 GDScript 腳本語言相關的問題。

source: *GUI*: relates to GUI (Control) nodes or to Nodes that compose user interfaces.
ga: *GUI*: baineann sé le nóid GUI (Rialú) nó le Nóid a chumann comhéadain úsáideora.
it: *GUI*: si riferisce ai nodi GUI (Control) o ai nodi che compongono le interfacce utente.
ta: *GUI*: GUI (கட்டுப்பாடு) முனைகள் அல்லது பயனர் இடைமுகங்களை உருவாக்கும் முனைகளுடன் தொடர்புடையது.
tr: *GUI*: GUI (Control) düğümleriyle veya kullanıcı arayüzleri oluşturan düğümlerle ilgilidir.
uk: *GUI*: стосується вузлів GUI (контролю) або вузлів, які складають інтерфейси користувача.
zh_tw: *GUI*：與 GUI（Control 節點）或構成使用者介面之節點相關的問題。

source: *Import*: relates to the resource import system.
ga: *Iompórtáil*: baineann an córas allmhairithe acmhainní.
it: *Import*: si riferisce al sistema di importazione delle risorse.
ta: *இறக்குமதி*: வள இறக்குமதி முறையுடன் தொடர்புடையது.
tr: *Import*: kaynak içe aktarma sistemiyle ilgilidir.
uk: *Імпорт*: відноситься до системи імпорту ресурсів.
zh_tw: *Import*：與資源匯入系統相關的問題。

source: *Input*: relates to the input system.
ga: * Ionchuir*: baineann leis an gcóras ionchuir.
it: *Input*: si riferisce al sistema di input.
ta: *உள்ளீடு*: உள்ளீட்டு அமைப்புடன் தொடர்புடையது.
tr: *Input*: girdi sistemi ile ilgilidir.
uk: *Введення*: відноситься до системи введення.
zh_tw: *Input*：與輸入系統相關的問題。

source: *I18n*: relates to internationalization.
uk: *I18n*: стосується інтернаціоналізації.

source: *Multiplayer*: relates to multiplayer (high-level networking) systems.
ga: *Multiplayer*: baineann sé le córais il-imreora (líonrú ardleibhéil).
it: *Multiplayer*: si riferisce ai sistemi multigiocatore (networking di alto livello).
ta: *மல்டிபிளேயர்*: மல்டிபிளேயர் (உயர் மட்ட நெட்வொர்க்கிங்) அமைப்புகளுடன் தொடர்புடையது.
tr: *Multiplayer*: çok oyunculu (üst düzey ağ) sistemlerle ilgilidir.
uk: *Багатокористувацька*: відноситься до багатокористувацьких (мережевих систем високого рівня).
zh_tw: *Multiplayer*：與多人遊戲（高階網路系統）相關的問題。

source: *Navigation*: relates to the navigation system (including A* and navmeshes).
ga: *Loingseoireach*: baineann sé leis an gcóras nascleanúna (lena n-áirítear A* agus navmeshes).
it: *Navigation*: si riferisce al sistema di navigazione (inclusi A* e navmesh).
ta: *வழிசெலுத்தல்*: வழிசெலுத்தல் அமைப்பு (A*மற்றும் NAVMESHES உட்பட) தொடர்பானது.
tr: *Navigation*: gezinti sistemi ile ilgilidir (A* ve gezinti örgüleri dahil).
uk: *Навігація*: відноситься до навігаційної системи (включаючи A* та навігаційні сітки).
zh_tw: *Navigation*：與尋路系統（包含 A* 與導航網格）相關的問題。

source: *Network*: relates to (low-level) networking.
it: *Network*: si riferisce al networking (di basso livello).
uk: *Мережа*: відноситься до (низького рівня) мережі.
zh_tw: *Network*：與（低層）網路系統相關的問題。

source: *Particles*: particles, particle systems and their editors.
ga: *Cáithníne*: cáithníní, córais cháithníní agus a n-eagarthóirí.
it: *Particelle*: particelle, sistemi di particelle e relativi editor.
ta: *துகள்கள்*: துகள்கள், துகள் அமைப்புகள் மற்றும் அவற்றின் ஆசிரியர்கள்.
tr: *Particles*: parçacıklar, parçacık sistemleri ve bunların düzenleyicileri.
uk: *Частинки*: частинки, системи частинок та їх редактори.
zh_tw: *Particles*：與粒子、粒子系統及其編輯工具相關的問題。

source: *Physics*: relates to the physics engine (2D/3D).
ga: * Físice*: baineann sé leis an inneall fisice (2D/3D).
it: *Physics*: si riferisce al motore di fisica (2D/3D).
pl: *Physics*: odnosi się do silnika fizyki (2D/3D).
ru: *Physics*: относится к физическому движку (2D/3D).
ta: *இயற்பியல்*: இயற்பியல் இயந்திரத்துடன் (2 டி/3 டி) தொடர்புடையது.
tr: *Physics*: fizik motoru (2B/3B) ile ilgilidir.
uk: *Physics*: стосується фізичного рушія (2D/3D).
zh_tw: *Physics*：與物理引擎（2D/3D）相關的問題。

source: *Plugin*: relates to problems encountered while writing plugins.
ga: * Breiseán*: baineann sé le fadhbanna a thagann chun cinn agus breiseáin á scríobh.
it: *Plugin*: si riferisce ai problemi riscontrati durante la scrittura delle estensioni.
pl: *Plugin*: odnosi się do problemów z pisaniem wtyczek.
ru: *Plugin*: относится к проблемам, возникающим при написании плагинов.
ta: *சொருகி*: செருகுநிரல்களை எழுதும் போது எதிர்கொள்ளும் சிக்கல்களுடன் தொடர்புடையது.
tr: *Plugin*: eklenti yazarken karşılaşılan sorunlarla ilgilidir.
uk: *Plugin*: стосується проблем, з якими ви зіштовхнулися під час написання додатків.
zh_tw: *Plugin*：與撰寫外掛（Plugin）時遇到的問題有關。

source: *Porting*: relates to some specific platforms or exporting projects.
ga: *Iompar: baineann sé le roinnt ardáin shonracha nó tionscadail onnmhairithe.
it: *Porting*: si riferisce ad alcune piattaforme specifiche o l'esportazione di progetti.
ta: *போர்ட்டிங்*: சில குறிப்பிட்ட தளங்கள் அல்லது ஏற்றுமதி திட்டங்களுடன் தொடர்புடையது.
tr: *Porting*: bazı özel platformlar veya projeleri dışa aktarma ile ilgilidir.
uk: *Портування*: стосується певних платформ або експортованих проектів.
zh_tw: *Porting*：與特定平台或專案移植相關的問題。

source: *Rendering*: relates to the 2D and 3D rendering engines.
ga: * Rendering*: baineann leis na hinnill rindreála 2D agus 3D.
it: *Rendering*: si riferisce ai motori di rendering 2D e 3D.
pl: *Rendering*: odnosi się do błędów renderowania silnika 2D i 3D.
ru: *Rendering*: относится к движкам 2D и 3D рендеринга.
ta: *ரெண்டரிங்*: 2 டி மற்றும் 3 டி வழங்குதல் என்சின்களுடன் தொடர்புடையது.
tr: *Rendering*: 2B ve 3B işleme motorları ile ilgilidir.
uk: *Rendering*: стосується рушіїв обробки плоского і просторового зображення.
zh_tw: *Rendering*：與 2D、3D 算圖引擎相關的問題。

source: *Shaders*: relates to the Godot shader language or visual shaders.
ga: * Scáthóirí*: baineann sé le teanga scáthaithe Godot nó le scáthóirí amhairc.
it: *Shaders*: si riferisce al linguaggio di shader di Godot o ai visual shader.
ta: *சேடர்ச்*: கோடோட் சேடர் மொழி அல்லது காட்சி சேடர்களுடன் தொடர்புடையது.
tr: *Shaders*: Godot gölgelendirici dili veya görsel gölgelendiricilerle ilgilidir.
uk: *Шейдери*: відноситься до мови шейдерів Godot або візуальних шейдерів.
zh_tw: *Shaders*：與 Godot 著色器語言或視覺著色器相關的問題。

source: *Tests*: relates to unit tests.
ga: * Tástálach*: baineann sé le tástálacha aonaid.
it: *Tests*: si riferisce ai test unitari.
ta: *சோதனைகள்*: அலகு சோதனைகளுடன் தொடர்புடையது.
tr: *Tests*: birim testleri ile ilgilidir.
uk: *Тести*: відноситься до модульних тестів.
zh_tw: *Tests*：與單元測試相關的問題。

source: *Thirdparty*: relates to third-party libraries used in Godot.
ga: *Tríú páirti*: baineann sé le leabharlanna tríú páirtí a úsáidtear i Godot.
it: *Thirdparty*: si riferisce alle librerie di terze parti utilizzate in Godot.
ta: *மூன்றாம் தரப்பு*: கோடோட்டில் பயன்படுத்தப்படும் மூன்றாம் தரப்பு நூலகங்களுடன் தொடர்புடையது.
tr: *Thirdparty*: Godot'ta kullanılan üçüncü taraf kütüphanelerle ilgilidir.
uk: *Третя сторона*: відноситься до сторонніх бібліотек, які використовуються в Godot.
zh_tw: *Thirdparty*：與 Godot 使用的第三方函式庫相關的問題。

source: *XR*: relates to Augmented Reality or Virtual Reality.
ga: * XR*: baineann sé le Réaltacht Méadaithe nó Réaltacht Fíorúil.
it: *XR*: si riferisce alla Realtà Aumentata (AR) o Realtà Virtuale (VR).
ta: *Xr*: பெரிதாக்கப்பட்ட உண்மைநிலை அல்லது மெய்நிகர் யதார்த்தத்துடன் தொடர்புடையது.
tr: *XR*: Artırılmış Gerçeklik veya Sanal Gerçeklik ile ilgilidir.
uk: *XR*: відноситься до доповненої реальності або віртуальної реальності.
zh_tw: *XR*：與擴增實境（AR）或虛擬實境（VR）相關的問題。

source: Issues would typically correspond to only one topic, though it's not unthinkable to see issues that fit two bills. The general idea is that there will be specialized contributors teams behind all topics, so they can focus on the issues labelled with their team's topic.
ga: De ghnáth ní fhreagródh saincheisteanna le hábhar amháin, cé nach féidir smaoineamh saincheisteanna a fheiceáil a oireann dhá bhilla. Is é an smaoineamh ginearálta go mbeidh foirne rannpháirtithe speisialaithe taobh thiar de gach ábhar, ionas gur féidir leo díriú ar na saincheisteanna atá lipéadaithe le hábhar a bhfoirne.
it: In genere, i problemi corrispondono a un solo argomento, anche se non è impensabile che si tratti di due argomenti. L'idea generale è che ci saranno team di collaboratori specializzati per ogni argomento, in modo che possano concentrarsi sui problemi etichettati con l'argomento del loro team.
ru: Вопросы обычно соответствуют только одной теме, хотя не исключено, что вопросы будут соответствовать двум темам. Общая идея заключается в том, что за всеми темами будут стоять специализированные команды авторов, и они смогут сосредоточиться на вопросах, помеченных темой их команды.
ta: சிக்கல்கள் பொதுவாக ஒரே ஒரு தலைப்புக்கு மட்டுமே ஒத்திருக்கும், இருப்பினும் இரண்டு பில்களுக்கு பொருந்தக்கூடிய சிக்கல்களைப் பார்ப்பது நினைத்துப் பார்க்க முடியாது. பொதுவான சிந்தனை என்னவென்றால், அனைத்து தலைப்புகளுக்கும் பின்னால் சிறப்பு பங்களிப்பாளர்கள் குழுக்கள் இருக்கும், எனவே அவர்கள் தங்கள் அணியின் தலைப்புடன் பெயரிடப்பட்ட சிக்கல்களில் கவனம் செலுத்த முடியும்.
tr: Sorunlar genellikle sadece bir konuya karşılık gelirler, ancak iki hedefe uyan sorunları görmek imkansız değildir. Genel fikir, tüm konuların arkasında uzmanlaşmış katılımcı ekiplerin olacağıdır, böylece ekiplerinin konusuyla etiketlenmiş konulara odaklanabilirler.
uk: Проблеми, як правило, стосуються лише однієї теми, хоча ймовірно побачити проблеми, які відповідають двом вимогам. Загальна ідея полягає в тому, що за всіма темами будуть спеціалізовані команди учасників, щоб вони могли зосередитися на проблемах, позначених темою їх команди.
zh_tw: Issue 通常僅對應單一主題，雖然偶爾也會有同時屬於兩個主題的情況。這樣分工能讓各主題專責團隊專注處理屬於自己領域的 Issue。

source: Platforms:
uk: Платформи:

source: By default, it is assumed that a given issue applies to all platforms. If one of the platform labels is used, it is then exclusive and the previous assumption doesn't stand anymore (so if it's a bug on e.g. Android and Linux exclusively, select those two platforms).
ga: De réir réamhshocraithe, glactar leis go mbaineann saincheist áirithe le gach ardán. Má úsáidtear ceann de na lipéid ardáin, tá sé eisiach ansin agus ní sheasann an toimhde roimhe seo níos mó (mar sin más fabht é ar e.g. Android agus Linux go heisiach, roghnaigh an dá ardán sin).
ru: По умолчанию предполагается, что данная проблема относится ко всем платформам. Если используется один из ярлыков платформы, то он является эксклюзивным, и предыдущее предположение больше не действует (поэтому, если это ошибка, например, только для Android и Linux, выберите эти две платформы).
ta: இயல்பாக, கொடுக்கப்பட்ட சிக்கல் அனைத்து தளங்களுக்கும் பொருந்தும் என்று கருதப்படுகிறது. இயங்குதள லேபிள்களில் ஒன்று பயன்படுத்தப்பட்டால், அது பிரத்தியேகமானது மற்றும் முந்தைய அனுமானம் இனி நிற்காது (எனவே இது எ.கா. ஆண்ட்ராய்டு மற்றும் லினக்சில் பிரத்தியேகமாக ஒரு பிழை என்றால், அந்த இரண்டு தளங்களையும் தேர்ந்தெடுக்கவும்).
tr: Varsayılan olarak, belirli bir sorunun tüm platformlar için geçerli olduğu varsayılır. Platform etiketlerinden biri kullanılırsa, o zaman özeldir ve baştaki varsayım artık geçerli değildir (bu nedenle, örneğin yalnızca Android ve Linux'ta bir hata varsa, bu iki platformu seçin).
uk: За замовчуванням передбачається, що дана проблема стосується всіх платформ. Якщо використовується одна з міток платформи, вона є ексклюзивною, і попереднє припущення більше не діє (тому, якщо це помилка, наприклад, виключно для Android і Linux, виберіть ці дві платформи).
zh_tw: 預設情況下，所有 Issue 都認為適用於所有平台。若有指派特定平台標籤，則僅限於該標籤所示平台（例如只在 Android 與 Linux 發生的 Bug，就要勾選這兩個平台）。

source: Documentation labels
ga: Lipéid doiciméad
it: Etichette di documentazione
ta: ஆவணப்படுத்தல் லேபிள்கள்
tr: Belgeler etiketleri
uk: Ярлики документації
zh_tw: 說明文件標籤
