Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/bug_triage_guidelines.po
Languages: ga, it, pl, ru, ta, tr, uk, zh_tw

source: In the `documentation repository <https://github.com/godotengine/godot-docs>`__, we use the following `labels <https://github.com/godotengine/godot-docs/labels>`__:
it: Nel `repository della documentazione <https://github.com/godotengine/godot-docs>`__, utilizziamo le seguenti `etichette <https://github.com/godotengine/godot-docs/labels>`__:
uk: У `репозиторії документації <https://github.com/godotengine/godot-docs>`__ ми використовуємо наступні `мітки <https://github.com/godotengine/godot-docs/labels>`__:
zh_tw: 在 `說明文件倉庫 <https://github.com/godotengine/godot-docs>`__ 中，我們使用下列 `標籤 <https://github.com/godotengine/godot-docs/labels>`__：

source: *Archived*: either a duplicate of another issue, or invalid. Such an issue would also be closed.
ga: *Cartlannaí*: dúbailt d'eisiúint eile, nó neamhbhailí. Dúnfaí saincheist den sórt sin freisin.
pl: *Archived*: opisuje duplikaty innych zgłoszeń błędów, lub jest niepoprawny. Może zostać zamknięty.
ta: *காப்பகப்படுத்தப்பட்ட*: மற்றொரு சிக்கலின் நகல், அல்லது தவறானது. அத்தகைய பிரச்சினையும் மூடப்படும்.
tr: *Archived*: (arşivlendi) ya başka bir konunun kopyası ya da geçersiz. Ayrıca böyle bir sorun kapatılacaktır.
uk: *Архівовано*: або дублікат іншого випуску, або недійсний. Таке питання також буде закрито.
zh_tw: *Archived*：重複或無效的 Issue，通常也會直接關閉。

source: *Bug*: Incorrect information in an existing page. Not to be used for *missing* information.
ga: *Bug*: Faisnéis mhícheart i leathanach atá ann cheana. Gan a úsáid le haghaidh faisnéis* in easnamh*.
it: *Bug*: Informazioni errate in una pagina esistente. Da non utilizzare per informazioni che *mancano*.
ta: *பிழை*: ஏற்கனவே உள்ள பக்கத்தில் தவறான செய்தி. * காணாமல் போன * தகவல்களுக்கு பயன்படுத்தக்கூடாது.
tr: *Bug*: Mevcut bir sayfadaki yanlış bilgiler. *Eksik* bilgiler için kullanılmamalıdır.
uk: *Помилка*: Неправильна інформація на існуючій сторінці. Не використовувати для *відсутньої* інформації.
zh_tw: *Bug*：現有頁面中的錯誤資訊。不適用於缺漏資訊。

source: *Dependencies*: describes pull requests that update a dependency file.
ga: *Cleithiúlachtaí*: cuireann sé síos ar iarratais ar tharraingt a nuashonraíonn comhad spleáchais.
it: *Dependencies*: descrive le richieste di pull che aggiornano un file di dipendenza.
ta: *சார்புநிலைகள்*: சார்பு கோப்பைப் புதுப்பிக்கும் இழுப்பு கோரிக்கைகளை விவரிக்கிறது.
tr: *Dependencies*: bir bağımlılık dosyasını güncelleyen çekme isteklerini tanımlar.
uk: *Залежності*: описує запити на отримання, які оновлюють файл залежностей.
zh_tw: *Dependencies*：描述更新相依性檔案的 PR。

source: *Enhancement*: new information to be added in an existing page.
ga: *Feabhsaithe*: faisnéis nua le cur i leathanach atá ann cheana.
it: *Enhancement*: nuove informazioni da aggiungere a una pagina esistente.
ta: *விரிவாக்கம்*: ஏற்கனவே உள்ள பக்கத்தில் சேர்க்கப்பட வேண்டிய புதிய தகவல்கள்.
tr: *Enhancement*: Mevcut bir sayfaya eklenecek yeni bilgiler.
uk: *Покращення*: нова інформація буде додана на існуючу сторінку.
zh_tw: *Enhancement*：於現有頁面新增內容。

source: *Linked demo PR*: the PR has a corresponding PR to the `Godot Demo Projects <https://github.com/godotengine/godot-demo-projects>`__ repository which must be merged at the same time. Any changes to code in tutorials that have a corresponding demo, such as :ref:`doc_your_first_2d_game`, need to update both repositories so that the tutorial code stays in sync with the completed demo.
uk: *Зв'язаний демонстраційний запит на зміни*: запит на зміни має відповідний запит на зміни до репозиторію `Godot Demo Projects <https://github.com/godotengine/godot-demo-projects>`__, який необхідно об'єднати одночасно. Будь-які зміни до коду в навчальних посібниках, що мають відповідний демонстраційний файл, наприклад :ref:`doc_your_first_2d_game`, потребують оновлення обох репозиторіїв, щоб код навчального посібника залишався синхронізованим із завершеним демонстраційним файлом.

source: *Needs work*: the pull request needs additional work before it can be merged.
ga: * Teastaíonn obair*: teastaíonn obair bhreise ón iarraidh tarraingthe sula bhféadfar é a chumasc.
it: *Needs work*: la richiesta di pull necessita di ulteriore lavoro prima di poter essere unita.
ta: *வேலை தேவை*: இழுக்கும் கோரிக்கை ஒன்றிணைவதற்கு முன்பு கூடுதல் வேலை தேவை.
tr: *Needs work*: (üzerinde çalışılması gerekiyor) Çekme isteğinin birleştirilebilmesi için ek çalışma yapılması gerekiyor.
uk: *Потрібна доопрацювання*: запит на отримання потребує додаткової роботи, перш ніж його можна буде об’єднати.
zh_tw: *Needs work*：此 PR 尚需補強才能合併。

source: *Python*: Pull requests that update Python code.
ga: * Python*: Tarraing iarratais a nuashonraíonn cód Python.
it: *Python*: richieste di pull che aggiornano il codice Python.
ta: *பைதான்*: பைதான் குறியீட்டைப் புதுப்பிக்கும் கோரிக்கைகளை இழுக்கவும்.
tr: *Python*: Python kodunu güncelleyen çekme istekleri.
uk: *Python*: Pull-запити, які оновлюють код Python.
zh_tw: *Python*：更新 Python 程式碼的 PR。

source: *Salvageable*: the pull request can't be merged due to design issues or merge conflicts and its author is not active anymore. However, it can still be picked up by an external contributor to bring it to a mergeable state. To do so, you need to open a new pull request based on the original pull request.
ga: * Sábháilte*: ní féidir an t-iarratas tarraingthe a chumasc mar gheall ar shaincheisteanna dearaidh nó coinbhleachtaí a chumasc agus níl a údar gníomhach níos mó. Mar sin féin, is féidir le ranníocóir seachtrach é a phiocadh suas fós chun é a thabhairt go stát inchumasaithe. Chun é sin a dhéanamh, ní mór duit iarratas tarraingthe nua a oscailt bunaithe ar an iarratas tarraingthe bunaidh.
ta: *சால்வாகபிள்*: வடிவமைப்பு சிக்கல்கள் அல்லது ஒன்றிணைக்கும் மோதல்கள் காரணமாக இழுத்தல் கோரிக்கையை இணைக்க முடியாது, அதன் ஆசிரியர் இனி செயலில் இல்லை. இருப்பினும், இணைக்கக்கூடிய நிலைக்கு கொண்டு வர வெளிப்புற பங்களிப்பாளரால் அதை இன்னும் எடுக்கலாம். அவ்வாறு செய்ய, அசல் இழுப்பு கோரிக்கையின் அடிப்படையில் புதிய இழுப்பு கோரிக்கையை நீங்கள் திறக்க வேண்டும்.
tr: *Salvageable*: (kurtarılabilir) Çekme isteği tasarım sorunları veya birleştirme çakışmaları nedeniyle birleştirilemiyor ve yazarı artık aktif değil. Bununla birlikte hala, başka bir katkıda bulunan tarafından birleştirilebilir bir duruma getirmek için ele alınabilir. Bunu yapmak için, orijinal çekme isteğine dayalı yeni bir çekme isteği açmanız gerekir.
uk: *Salvageable*: запит на отримання не можна об’єднати через проблеми з дизайном або конфлікти злиття, а його автор більше не активний. Однак його все ще може підібрати зовнішній учасник, щоб привести його до стану зливання. Для цього вам потрібно відкрити новий запит на отримання на основі початкового запиту на отримання.
zh_tw: *Salvageable*：由於設計問題或合併衝突，該 PR 目前無法合併，且原作者不再活躍。但外部貢獻者仍可接手，將其修正至可合併狀態。若要接手，請基於原 PR 開啟新 PR。

source: *Waiting on PR merge*: the PR documents an engine PR that has not been merged yet.
uk: *Очікування об'єднання запитів на розробку*: запит на розробку документує запит на розробку двигуна, який ще не об'єднано.

source: *About*: Issues and PRs related to the About section of the documentation and other general articles.
ga: * Maidir fao*: Saincheisteanna agus PRanna a bhaineann leis an gcuid Maidir den doiciméadú agus ailt ghinearálta eile.
ta: *பற்றி*: ஆவணங்களின் பிரிவு மற்றும் பிற பொதுக் கட்டுரைகள் தொடர்பான சிக்கல்கள் மற்றும் பி.ஆர் கள்.
tr: *About*: Belgelerin "Hakkında/About" bölümü ve diğer genel makalelerle ilgili sorunlar ve PR'ler.
uk: *Про*: проблеми та рекламні повідомлення, пов’язані з розділом «Про» документації та іншими загальними статтями.
zh_tw: *About*：與文件的「關於」區塊或一般文章相關的 Issue 或 PR。

source: *Class reference*: the issue is about the class reference, not a documentation page.
ga: *Tagairt ranga*: baineann an cheist leis an tagairt ranga, ní leathanach doiciméadaithe.
it: *Class reference*: il problema riguarda il riferimento alle classi, non una pagina di documentazione.
ta: *வகுப்பு குறிப்பு*: சிக்கல் வகுப்பு குறிப்பு பற்றியது, ஆவணப்படுத்தல் பக்கம் அல்ல.
tr: *Class reference*: Sorun "sınıf referansı" ile ilgilidir, belgeler sayfası ile ilgili değildir.
uk: *Посилання на клас*: проблема стосується посилання на клас, а не сторінки документації.
zh_tw: *Class reference*：與類別參考（非一般文件頁面）相關的問題。

source: *Community*: Issues and PRs related to the Community section of the documentation.
ga: *Pobal*: Saincheisteanna agus PRanna a bhaineann leis an rannán Chomhphobail den doiciméadú.
ta: *சமூகம்*: ஆவணங்களின் சமூக பிரிவு தொடர்பான சிக்கல்கள் மற்றும் பி.ஆர் கள்.
tr: *Community*: Belgelerin "Topluluk" bölümü ile ilgili sorunlar ve PR'ler.
uk: *Спільнота*: проблеми та рекламні повідомлення, пов’язані з розділом спільноти документації.
zh_tw: *Community*：與文件社群區塊相關的 Issue 或 PR。

source: *Contributing*: Issues and PRs related to the Contributing/Development section of the documentation.
ga: *Ranníocaíocht*: Saincheisteanna agus PRanna a bhaineann leis an rannán Ranníoc/Forbartha den doiciméadú.
ta: *பங்களிப்பு*: ஆவணங்களின் பங்களிப்பு/மேம்பாட்டு பிரிவு தொடர்பான சிக்கல்கள் மற்றும் பி.ஆர் கள்.
tr: *Contributing*: Belgelerin "Katkıda Bulunma/Geliştirme" bölümüyle ilgili sorunlar ve PR'ler.
uk: *Внесок*: Проблеми та PR, пов’язані з розділом Внесок/Розробка документації.
zh_tw: *Contributing*：與文件「貢獻」/「開發」區塊相關的 Issue 或 PR。

source: *Getting started*: Issues and PRs related to the Getting Started section of the documentation.
ga: *Ag tosaí*: Saincheisteanna agus PRanna a bhaineann leis an gcuid Ag Thosaigh den doiciméadú.
ta: *தொடங்குதல்*: ஆவணங்களின் தொடங்குவது தொடர்பான சிக்கல்கள் மற்றும் பி.ஆர் கள்.
tr: *Getting started*: Belgelerin "Başlarken" bölümüyle ilgili sorunlar ve PR'ler.
uk: *Початок роботи*: Проблеми та PR, пов’язані з розділом документації «Початок роботи».
zh_tw: *Getting started*：與文件「入門」區塊相關的 Issue 或 PR。

source: *Manual*: Issues and PRs related to the Manual/Tutorials section of the documentation.
ga: *Lámhleabhair*: Saincheisteanna agus PRanna a bhaineann leis an rannán Lámhleabhair/Ranganna Teagaisc den doiciméadú.
it: *Manual*: Problemi e PR relativi alla sezione Manuale/Tutorial della documentazione.
ta: *கையேடு*: ஆவணத்தின் கையேடு/டுடோரியல் பிரிவு தொடர்பான சிக்கல்கள் மற்றும் பி.ஆர் கள்.
tr: *Manual*: Belgelerin "Kılavuz/Öğreticiler" bölümüyle ilgili sorunlar ve PR'ler.
uk: *Посібник*: проблеми та PR, пов’язані з розділом документації «Посібник/навчальні посібники».
zh_tw: *Manual*：與文件「手冊」或「教學」區塊相關的 Issue 或 PR。

source: Content:
uk: Зміст:

source: *Images*: Issues and PRs involving outdated or incorrect images in articles.
ga: *Íomhán*: Saincheisteanna agus PRanna a bhaineann le híomhánna atá as dáta nó mícheart in alt.
it: *Images*: Problemi e PR relativi a immagini obsolete o errate negli articoli.
ta: *படங்கள்*: கட்டுரைகளில் காலாவதியான அல்லது தவறான படங்கள் சம்பந்தப்பட்ட சிக்கல்கள் மற்றும் பி.ஆர்.
tr: *Images*: Makalelerdeki güncel olmayan veya yanlış resimlerle ilgili sorunlar ve PR'lar.
uk: *Зображення*: проблеми та рекламні оголошення, що стосуються застарілих або неправильних зображень у статтях.
zh_tw: *Images*：涉及文章中過時或錯誤圖片的 Issue 或 PR。

source: *Example code*: Issues and PRs involving writing or updating code examples.
it: *Example code*: Problemi e PR relativi alla scrittura o all'aggiornamento di esempi di codice.
uk: *Приклад коду*: Проблеми та PR, пов’язані з написанням або оновленням прикладів коду.
zh_tw: *Example code*：涉及撰寫或更新程式碼範例的 Issue 或 PR。

source: *New page*: Issues and PRs related to creation of new documentation pages for new or undocumented features.
ga: *Leathanach nua*: Saincheisteanna agus PRanna a bhaineann le leathanaigh doiciméadaithe nua a chruthú le haghaidh gnéithe nua nó neamhdhoiciméadaithe.
it: *New page*: Problemi e PR relativi alla creazione di nuove pagine di documentazione per funzionalità nuove o non documentate.
ta: *புதிய பக்கம்*: புதிய அல்லது ஆவணமற்ற அம்சங்களுக்கான புதிய ஆவணங்கள் பக்கங்களை உருவாக்குவது தொடர்பான சிக்கல்கள் மற்றும் பி.ஆர் கள்.
tr: *New page*: Yeni veya belgelenmemiş özellikler için yeni belgeler sayfalarının oluşturulmasıyla ilgili sorunlar ve PR'ler.
uk: *Нова сторінка*: проблеми та рекламні пропозиції, пов’язані зі створенням нових сторінок документації для нових або незадокументованих функцій.
zh_tw: *New page*：與建立新文件頁面（針對新功能或未記錄功能）相關的 Issue 或 PR。

source: *Organization*: Issues and PRs related to reorganizing the content.
ga: *Eagraíocht*: Saincheisteanna agus PRanna a bhaineann leis an ábhar a atheagrú.
it: *Organization*: Problemi e PR relativi alla riorganizzazione dei contenuti.
ta: *அமைப்பு*: உள்ளடக்கத்தை மறுசீரமைப்பது தொடர்பான சிக்கல்கள் மற்றும் பி.ஆர் கள்.
tr: *Organization*: İçeriğin yeniden düzenlenmesiyle ilgili sorunlar ve PR'lar.
uk: *Організація*: Питання та PR, пов’язані з реорганізацією контенту.
zh_tw: *Organization*：與重新組織內容或移動頁面相關的 Issue 或 PR。

source: *Proofreading*: Issues and PRs related to proofreading the documentation.
ga: *Cruthléitheo*: Saincheisteanna agus PRanna a bhaineann le prófléamh na doiciméadaithe.
ta: *சரிபார்ப்பு*: ஆவணங்களை சரிபார்த்தல் தொடர்பான சிக்கல்கள் மற்றும் பி.ஆர் கள்.
tr: *Proofreading*: Belgelerin yazım denetlemesi ile ilgili sorunlar ve PR'ler.
uk: *Коректура*: проблеми та запити, пов’язані з перевіркою документації.
zh_tw: *Proofreading*：與校對文件內容相關的 Issue 或 PR。

source: *Redirect*: Issues and PRs involving moving content and adding a redirect rule on the backend.
ga: * Athsheolt*: Saincheisteanna agus PRanna a bhaineann le hábhar a bhogadh agus riail atreoraithe a chur leis ar an gcúltaca.
it: *Redirect*: problemi e PR relativi allo spostamento di contenuti e all'aggiunta di una regola di reindirizzamento nel backend.
ta: *Redirect*: Issues and PRs involving moving content and adding a redirect விதி on the backend.
tr: *Redirect*: İçerik taşıma ve arka uçta bir yönlendirme kuralı eklemeyi içeren sorunlar ve PR'ler.
uk: *Переадресація*: проблеми та PR, пов’язані з переміщенням вмісту та додаванням правила переадресації на сервері.
zh_tw: *Redirect*：涉及移動內容與後端新設重定向規則的 Issue 或 PR。

source: *Website*: Issues related to adding website features and fixing bugs, whether on the front or back-end,
ga: *Láithreán Gréasáin: Saincheisteanna a bhaineann le gnéithe láithreáin ghréasáin a chur leis agus fabhtanna a shocrú, cibé acu ar an tosaigh nó ar chúl,
it: *Website*: problemi relativi all'aggiunta di funzionalità al sito web e alla correzione di bug, sia nel front-end sia nel back-end,
ta: *வலைத்தளம்*: வலைத்தள அம்சங்களைச் சேர்ப்பது மற்றும் பிழைகள் சரிசெய்வது தொடர்பான சிக்கல்கள், முன் அல்லது பின் இறுதியில் இருந்தாலும்,
tr: *Website*: İster ön ister arka uçta olsun, web sitesi özellikleri ekleme ve hataları düzeltme ile ilgili sorunlar,
uk: *Веб-сайт*: проблеми, пов’язані з додаванням функцій веб-сайту та виправленням помилок, як на передній, так і на серверній частині,
zh_tw: *Website* ：與網站功能新增或 Bug 修正相關的 Issue，無論前端或後端，

source: Topic:
uk: Тема:

source: The available topics describe the same content as the topics in the main repository.
ga: Déanann na hábhair atá ar fáil cur síos ar an ábhar céanna leis na hábhair sa phríomhstór.
it: Gli argomenti disponibili descrivono lo stesso contenuto degli argomenti nel repository principale.
ta: கிடைக்கக்கூடிய தலைப்புகள் முதன்மையான களஞ்சியத்தில் உள்ள தலைப்புகளின் அதே உள்ளடக்கத்தை விவரிக்கின்றன.
tr: Mevcut konular, ana depodaki konularla aynı içeriği tanımlamaktadır.
uk: Доступні теми описують той самий вміст, що й теми в основному сховищі.
zh_tw: 可用主題內容與主倉庫相同。

source: Milestones
ga: Príomh-mhíle
it: Pietre miliari
pl: Kamienie Milowe
ru: Основные этапы
ta: மைல்கற்கள்
tr: Kilometre Taşları
uk: Віхи
zh_tw: 里程碑（Milestone）

source: `Milestones <https://github.com/godotengine/godot/milestones>`_ are used for some issues and all PRs.
uk: `Віхи <https://github.com/godotengine/godot/milestones>`_ використовуються для деяких проблем та всіх запитів на виконання (PR).

source: We have milestones for specific minor engine versions, like ``4.5`` and ``4.6``, as well as general milestones for major engine versions, like ``3.x`` and ``4.x``. In the ``godot-proposals`` repo, we also have a ``5.0`` milestone for compatibility-breaking changes that will be considered for Godot 5.0, in many years.
uk: У нас є етапи для конкретних другорядних версій рушіїв, таких як ``4.5`` та ``4.6``, а також загальні етапи для основних версій рушіїв, таких як ``3.x`` та ``4.x``. У репозиторії ``godot-proposals`` ми також маємо етап ``5.0`` для змін, що порушують сумісність, які будуть розглянуті для Godot 5.0 через багато років.

source: Issues are assigned to the current development milestone, such as ``4.5``, if they are related to features introduced in that engine version, or are bugs (regressions) in that version. Additionally, all issues completed during the development of that engine version are added to the milestone, so that users can see at a glance in which minor version an issue was first fixed. We don't always use the ``4.x`` milestone for issues, since by default all issues are related to Godot 4.x. However, we do use the ``3.x`` milestone to mark issues that are specific to Godot 3.x.
uk: Проблеми призначаються до поточної віхи розробки, такої як ``4.5``, якщо вони пов’язані з функціями, запровадженими в цій версії рушія, або є помилками (регресіями) в цій версії. Крім того, всі проблеми, вирішені під час розробки цієї версії рушія, додаються до віхи, щоб користувачі могли одразу побачити, в якій мінорній версії проблема була вперше виправлена. Ми не завжди використовуємо віху ``4.x`` для проблем, оскільки за замовчуванням усі проблеми пов’язані з Godot 4.x. Однак ми використовуємо віху ``3.x`` для позначення проблем, специфічних для Godot 3.x.

source: All pull requests are assigned to a milestone. By default, enhancement and feature PRs are assigned to the ``4.x`` milestone, and bugs are assigned to the current development milestone, such as ``4.5``. Towards the end of the minor version's development, PRs currently in that milestone are reassessed. If a PR is no longer being considered for that version, it is reassigned to either the major version milestone (``4.x``), or the next minor version milestone (such as ``4.6``).
uk: Усі запити на зняття (pull requests) призначаються до певного етапу (віхи). За замовчуванням запити на вдосконалення та функції призначаються до етапу ``4.x``, а запити на помилки – до поточного етапу розробки, такого як ``4.5``. Ближче до кінця розробки другорядної версії запити на зняття (pull requests), які наразі перебувають на цьому етапі, переоцінюються. Якщо запит на зняття більше не розглядається для цієї версії, його переносять до етапу основної версії (``4.x``) або до наступного етапу другорядної версії (наприклад, ``4.6``).

source: Pull requests in the ``4.x`` milestone are reassigned to the current minor engine version, such as ``4.5``, when the review process is complete, and the production team decides that the PR is ready to be merged soon. Note that this usually requires more than one approving review.
uk: Запити на зняття (pull requests) на етапі ``4.x`` перепризначаються поточній версії мінорного рушія, такій як ``4.5``, коли процес перевірки завершено, і команда розробників вирішує, що запит на зняття готовий до об'єднання найближчим часом. Зверніть увагу, що для цього зазвичай потрібно більше одного схвалення.

source: The milestone assigned to a PR is a goal, not a guarantee. New features and enhancements are merged when they are ready. While reviewers and maintainers do their best to review PRs in time for the current version, at some point we reach the beta, feature freeze, and then release; and existing PRs are reassigned to the next minor version, or to ``4.x``. As a rule, we assign new features to the ``4.x`` milestone initially to avoid continually reassigning a PR from version to version. However, a PR being in ``4.x`` does not mean it won't be merged; it's just the default for new features.
uk: Віха, призначена запиту на оновлення (PR), є метою, а не гарантією. Нові функції та вдосконалення об'єднуються, коли вони готові. Хоча рецензенти та розробники роблять усе можливе, щоб вчасно переглянути запити на оновлення для поточної версії, у певний момент ми досягаємо бета-версії, функції заморожуються, а потім випускаються; і існуючі запити на оновлення переносяться на наступну проміжну версію або на ``4.x``. Як правило, ми спочатку призначаємо нові функції до етапу ``4.x``, щоб уникнути постійного перепризначення запиту на оновлення з версії в версію. Однак, якщо запит на оновлення знаходиться в ``4.x``, це не означає, що він не буде об'єднаний; це просто налаштування за замовчуванням для нових функцій.

source: GitHub proposes various features to manage issues:
ta: சிக்கல்களை நிர்வகிக்க அறிவிலிமையம் பல்வேறு அம்சங்களை முன்மொழிகிறார்:
tr: GitHub, sorunları yönetmek için çeşitli özellikler önermektedir:

source: Set one or several labels from a predefined list
ta: முன் வரையறுக்கப்பட்ட பட்டியலிலிருந்து ஒன்று அல்லது பல லேபிள்களை அமைக்கவும்
tr: Önceden tanımlanmış bir listeden bir veya birkaç etiket belirleyin

source: Set one milestone from a predefined list
ta: முன் வரையறுக்கப்பட்ட பட்டியலிலிருந்து ஒரு மைல்கல்லை அமைக்கவும்
tr: Önceden tanımlanmış bir listeden bir kilometre taşı belirleyin

source: Keep track of the issue in the project dashboard
ta: திட்ட டாச்போர்டில் சிக்கலைக் கண்காணிக்கவும்
tr: Proje kontrol panelinde sorunu takip edin

source: Define one contributor as "assignee" among the Godot engine organization members
ta: கோடோட் என்சின் அமைப்பு உறுப்பினர்களிடையே ஒரு பங்களிப்பாளரை "ஒதுக்குபவர்" என்று வரையறுக்கவும்
tr: Godot motoru organizasyon üyeleri arasında bir katılımcıyı "atanan" olarak tanımlayın

source: As the Godot engine organization on GitHub currently has a restricted number of contributors, we do not use assignees extensively for now. All contributors are welcome to take on any issue, if relevant after mentioning it on the issue ticket and/or discussing the best way to resolve it with other developers.
ta: கிட்அப்பில் உள்ள கோடோட் என்சின் அமைப்பு தற்போது தடைசெய்யப்பட்ட எண்ணிக்கையிலான பங்களிப்பாளர்களைக் கொண்டிருப்பதால், நாங்கள் இப்போது ஒதுக்கீட்டாளர்களை விரிவாகப் பயன்படுத்துவதில்லை. எந்தவொரு பிரச்சினையையும் மேற்கொள்வதற்கு அனைத்து பங்களிப்பாளர்களும் வரவேற்கப்படுகிறார்கள், இதில் சிக்கல் டிக்கெட்டில் அதைக் குறிப்பிட்ட பிறகு மற்றும்/அல்லது பிற டெவலப்பர்களுடன் அதைத் தீர்ப்பதற்கான சிறந்த வழியைப் பற்றி விவாதித்தால்.
tr: GitHub'daki Godot motoru organizasyonu şu anda sınırlı sayıda katılımcıya sahip olduğundan, atamaları şimdilik yaygın olarak kullanmıyoruz. Tüm katkıda bulunanlar, sorun biletinde bahsettikten ve/veya diğer geliştiricilerle çözmenin en iyi yolunu tartıştıktan sonra, ilgili olması halinde herhangi bir sorunu üstlenebilirler.

source: For the time being, we do not use the project dashboard feature either.
ta: தற்போதைக்கு, நாங்கள் திட்ட டாச்போர்டு அம்சத்தையும் பயன்படுத்த மாட்டோம்.
tr: Şu an için proje kontrol paneli özelliğini de kullanmıyoruz.

source: As far as possible, we try to assign labels (and milestones, when relevant) to both issues and pull requests.
ta: முடிந்தவரை, இரு சிக்கல்களுக்கும் லேபிள்களை (மற்றும் மைல்கற்கள், பொருத்தமானதாக) ஒதுக்க முயற்சிக்கிறோம்.
tr: Mümkün olduğunca, hem sorunlara hem de çekme isteklerine etiketler (ve ilgili olduğunda kilometre taşları) atamaya çalışıyoruz.

source: **Categories:**
pl: **Kategorie:**
ru: **Категории:**
ta: ** பிரிவுகள்: **
tr: **Kategoriler:**

source: *Production*: Relates to the production team.
ta: *உற்பத்தி*: தயாரிப்புக் குழுவுடன் தொடர்புடையது.
tr: *Production*: (üretim) Üretim ekibiyle ilgilidir.
