Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/bug_triage_guidelines.po
Languages: ga, it, pl, ru, ta, tr, uk, zh_tw

source: Bug triage guidelines
ga: Treoirlínte treoirlíthe
pl: Wytyczne dotyczące usuwania błędów
ta: பிழை சோதனை வழிகாட்டுதல்கள்
tr: Hata önceliklendirme kılavuzları
uk: Настанови щодо пошуку причин вад
zh_tw: Bug 分級指引

source: This page describes the typical workflow of the bug triage team aka bugsquad when handling issues and pull requests on Godot's `GitHub repository <https://github.com/godotengine/godot>`__. It is bound to evolve together with the bugsquad, so do not hesitate to propose modifications to the following guidelines.
ga: Déanann an leathanach seo cur síos ar ghnáthshreabhadh oibre na foirne triáise fabhtanna aka bugsquad agus iad ag láimhseáil saincheisteanna agus ag tarraingt iarratais ar stór `GitHub Godot <https://github.com/godotenginine/godot>`__. Beidh sé ag teacht chun cinn in éineacht leis an fabht, mar sin ná bíodh drogall ort modhnuithe a mholadh ar na treoirlínte seo a leanas.
ta: சிக்கல்களைக் கையாளும் போது பிழை சோதனை குழுவின் வழக்கமான பணிப்பாய்வுகளை இந்த பக்கம் விவரிக்கிறது மற்றும் கோடோட்டின் `கிட்அப் களஞ்சியத்தில் கோரிக்கைகளை இழுக்கவும் <https://github.com/godotengine/godot> __. இது பிழைத்திருத்தத்துடன் இணைந்து உருவாகிறது, எனவே பின்வரும் வழிகாட்டுதல்களில் மாற்றங்களை முன்மொழிய தயங்க வேண்டாம்.
tr: Bu sayfa, Godot'nun `GitHub deposu <https://github.com/godotengine/godot>`__ üzerindeki sorunları ve çekme isteklerini ele alırken bugsquad (hata ekibi) olarak da bilinen hata önceliklendirme ekibinin tipik iş akışını açıklamaktadır. İş akışı ve Bugsquad birlikte gelişmek zorundadır, bu nedenle aşağıdaki yönergelerde değişiklik önermekten çekinmeyin.
uk: На цій сторінці описано типовий робочий процес команди сортування помилок, також відомої як bugsquad, під час обробки проблем і запитів на отримання в `репозиторії GitHub Godot <https://github.com/godotengine/godot>`__. Він обов’язково розвиватиметься разом із командою жуків, тому не вагайтеся пропонувати зміни до наведених нижче інструкцій.
zh_tw: 本頁描述 Bug 分級團隊（bugsquad）在 Godot 的 `GitHub 倉庫 <https://github.com/godotengine/godot>`__ 上處理 Issue 和 Pull Request 的標準流程。隨著 bugsquad 的發展，這些指引也會持續調整，歡迎隨時提出修正建議。

source: Issues management
ga: bainistíocht saincheisteanna
it: Gestione dei problemi (issues)
pl: Zarządzanie problemami
ta: மேலாண்மை சிக்கல்கள்
tr: Sorun yönetimi
uk: Керування вадами
zh_tw: Issue 管理

source: For issue management, we use the following GitHub processes:
uk: Для управління проблемами ми використовуємо такі процеси GitHub:

source: Each issue and pull request (PR) is categorized with a set of *labels*, sometimes called "tags".
uk: Кожна проблема та запит на зняття (PR) класифікується за допомогою набору *міток*, які іноді називають «тегами».

source: Each PR is assigned to a *milestone*. Some issues can also be assigned to a *milestone* (see below).
uk: Кожному запиту на реалізацію проектів (PR) присвоюється певна *віха*. Деякі проблеми також можна призначити певну *віху* (див. нижче).

source: Issues can have an *assignee*, who is a contributor among Godot maintainers.
uk: Проблеми можуть мати *правонаступника*, який є одним із розробників Godot.

source: Issues can be put in one or more *projects*.
uk: Проблеми можна розмістити в одному або кількох *проектах*.

source: PRs can be *linked* to one or more issues which they "fix" or "close".
uk: Запити на вирішення проблем можуть бути *пов’язані* з однією або кількома проблемами, які вони «виправляють» або «закривають».

source: We don't yet extensively use or rely on some other GitHub processes:
uk: Ми ще не використовуємо та не покладаємося на деякі інші процеси GitHub у великій мірі:

source: Issue close reasons (completed, not planned, duplicate). While we use these, it is not consistent, and older issues are all closed as "completed", so the issue close reason should not be relied on.
uk: Причини закриття проблеми (завершено, не заплановано, дублікат). Хоча ми використовуємо їх, це не послідовно, і всі старіші проблеми закриті як «завершені», тому не слід покладатися на причину закриття проблеми.

source: Issue *types* (Bug, Feature, Task).
uk: *Типи* проблем (помилка, функція, завдання).

source: Issue *relationships*.
uk: Проблема *стосунки*.

source: We only use the assignees feature for Godot maintainers who are members of the Godot Engine GitHub organization, and even then not in all cases. For other issues, we track who is working on an issue by comments on the issue and linked pull requests. Most issues are available for any contributor to take on, after discussing it with other contributors. If you would like to work on an issue, first check that no one else is working on it, by looking for a linked pull request, a comment "claiming" the issue, or an assignee. If no one else is working on the issue, leave a comment on the issue to "claim" it and start working on it.
uk: Ми використовуємо функцію правонаступників лише для розробників Godot, які є членами організації Godot Engine GitHub, і навіть тоді не у всіх випадках. Для інших проблем ми відстежуємо, хто працює над проблемою, за коментарями до проблеми та пов’язаними запитами на зняття. Більшість проблем доступні для будь-якого учасника після обговорення з іншими учасниками. Якщо ви хочете працювати над проблемою, спочатку перевірте, чи ніхто інший над нею не працює, знайшовши пов’язаний запит на зняття, коментар, який «заявляє права» на проблему, або правонаступника. Якщо ніхто інший не працює над проблемою, залиште коментар до проблеми, щоб «заявити права» на неї та почати працювати над нею.

source: Labels
ga: Lipéid
it: Etichette
pl: Labels(Etykiety)
ru: Обозначения на карте
ta: சிட்டைகள்
tr: Etiketler
uk: Мітки
zh_tw: 標籤（Label）

source: The following `labels <https://github.com/godotengine/godot/labels>`__ are currently defined in the Godot repository:
it: Le seguenti `etichette <https://github.com/godotengine/godot/labels>`__ sono attualmente definite nel repository di Godot:
uk: Наступні `мітки <https://github.com/godotengine/godot/labels>`__ наразі визначені в репозиторії Godot:
zh_tw: Godot 倉庫目前已定義下列 `標籤 <https://github.com/godotengine/godot/labels>`__：

source: Categories:
uk: Категорії:

source: *Archived*: used to filter issues closed with a resolution other than "fixed".
uk: *Архів*: використовується для фільтрації проблем, закритих з рішенням, відмінним від «виправлено».

source: For issues, added to all issues that are not resolved by engine or documentation changes. This includes duplicate issues, user error, or reports in the wrong repository. Since we don't rely on GitHub's issue close reasons (``completed``, ``not planned``, and ``duplicate``), it is possible for an issue to be closed as ``completed`` with the *Archived* label.
uk: Для задач, що додаються до всіх задач, які не вирішено змінами в движку або документації. Це включає дублікати задач, помилки користувача або звіти в неправильному репозиторії. Оскільки ми не покладаємося на причини закриття задачі GitHub (``completed``, ``not planned`` та ``duplicate``), задачу можливо закрити як ``завершену`` з міткою *Архівовано*.

source: For PRs, added to all closed PRs that are not merged. This includes superseded or duplicate PRs, Git or GitHub mistakes, and valid PRs that end up not merged.
uk: Для запитів на оновлення (PR) додається до всіх закритих запитів на оновлення, які не об'єднано. Це включає замінені або дубліковані запити на оновлення, помилки Git або GitHub, а також дійсні запити на оновлення, які не об'єднано.

source: *Breaks compat*: describes something that can only be fixed by breaking compatibility with existing projects.
ga: *Breaks compat*: cuireann sé síos ar rud nach féidir a shocrú ach trí chomhoiriúnacht le tionscadail atá ann cheana a bhriseadh.
ta: *உடைகள் இணக்கமாக*: ஏற்கனவே உள்ள திட்டங்களுடன் பொருந்தக்கூடிய தன்மையை உடைப்பதன் மூலம் மட்டுமே சரிசெய்யக்கூடிய ஒன்றை விவரிக்கிறது.
tr: *Breaks compat*: (uyumluluğu bozar) mevcut projelerle uyumluluğu sadece bozarak düzeltilebilecek bir şeyi tanımlar.
uk: *Порушує сумісність*: описує щось, що можна виправити, лише порушивши сумісність із існуючими проектами.
zh_tw: *Breaks compat*：描述只能通過破壞現有專案相容性來修復的問題。

source: *Bug*: describes something that is not working properly.
ga: *Bug*: déanann cur síos ar rud nach bhfuil ag obair i gceart.
pl: *Bug*: opisuje coś, co nie działa poprawnie.
ta: *பிழை*: சரியாக வேலை செய்யாத ஒன்றை விவரிக்கிறது.
tr: *Bug*: (hata) düzgün çalışmayan bir şeyi tanımlar.
uk: *Помилка*: описує те, що не працює належним чином.
zh_tw: *Bug*：描述未正常運作的問題。

source: *Cherrypick*: describes something that can be backported to a stable branch after being merged in the ``master`` branch.
ga: *Cherrypick*: déanann cur síos ar rud ar féidir a chur ar ais chuig brainse chobhsaí tar éis é a chumasc sa bhrainse ``máistir`.
ta: *செர்ரிபிக்*: `` மாச்டர்`` கிளையில் ஒன்றிணைக்கப்பட்ட பின்னர் ஒரு நிலையான கிளைக்கு பின்வாங்கக்கூடிய ஒன்றை விவரிக்கிறது.
tr: *Cherrypick*: (özel seçimlik) ``master`` dalında birleştirildikten sonra kararlı bir dala geri aktarılabilecek bir şeyi tanımlar.
uk: *Cherrypick*: описує щось, що може бути перенесено до стабільної гілки після об’єднання в гілку ``master``.
zh_tw: *Cherrypick*：描述合併到 ``master`` 分支後仍可回溯到穩定分支的內容。

source: *Confirmed*: has been confirmed by at least one other contributor than the bug reporter (typically for *Bug* reports). The purpose of this label is to let developers know which issues are still reproducible when they want to select what to work on. It is therefore a good practice to add in a comment on what platform and what version or commit of Godot the issue could be reproduced; if a developer looks at the issue one year later, the *Confirmed* label may not be relevant anymore.
ga: *Deimhnithe*: tá ranníocóir amháin eile ar a laghad deimhnithe ann seachas an tuairisceoir fabht (de ghnáth le haghaidh tuairiscí* Bug*). Is é cuspóir an lipéid seo cur in iúl d'fhorbróirí na saincheisteanna atá fós in-atáirgeadh nuair is mian leo cad atá le bheith ag obair orthu a roghnú. Is dea-chleachtas é dá bhrí sin trácht a chur isteach ar cén ardán agus cén leagan nó tiomantas de Godot a d'fhéadfaí an tsaincheist a atáirgeadh; má fhéachann forbróir ar an tsaincheist bliain ina dhiaidh sin, b'fhéidir nach mbeidh an lipéad* Deimhnithe ábhartha níos mó.
pl: *Confirmed*: został potwierdzony przez co najmniej jednego użytkownika niż zgłaszający błąd . Celem tej etykiety jest poinformowanie programistów, które problemy są możliwe do odtworzenia, aby móc łatwo znaleźć błąd i jego przyczynę. Dlatego też dobrą praktyką jest dodanie w komentarzu, na jakiej platformie i w jakiej wersji Godota(również nieoficjalnych) sprawa ta mogłaby zostać powielona; jeśli deweloper rozpatrzy problem dopiero rok później, oznaczenie *Confirmed* może już nie mieć znaczenia.
ru: *Confirmed*: было подтверждено по крайней мере ещ` одним участником, кроме автора сообщения об ошибке (обычно для сообщений *Bug* ). Цель этой пометки - дать разработчикам знать, какие проблемы все ещ` воспроизводимы, когда они хотят выбрать, над чем работать. Поэтому хорошей практикой является добавление комментария о том, на какой платформе и в какой версии или коммите Godot проблема может быть воспроизведена; если разработчик посмотрит на проблему год спустя, метка *Confirmed* может быть уже неактуальной.
ta: *உறுதிப்படுத்தப்பட்டது*: பிழை நிருபரை விட குறைந்தது ஒரு பங்களிப்பாளரால் உறுதிப்படுத்தப்பட்டுள்ளது (பொதுவாக*பிழை*அறிக்கைகளுக்கு). இந்த லேபிளின் நோக்கம் என்னவென்றால், உருவாக்குபவர்கள் என்ன வேலை செய்ய வேண்டும் என்பதைத் தேர்ந்தெடுக்க விரும்பும் போது எந்த சிக்கல்கள் இன்னும் இனப்பெருக்கம் செய்யப்படுகின்றன என்பதைத் தெரியப்படுத்துவதாகும். ஆகவே, எந்த தளம், எந்த பதிப்பு அல்லது கோடோட்டின் உறுதிப்பாட்டை மீண்டும் உருவாக்க முடியும் என்ற கருத்தில் சேர்ப்பது ஒரு நல்ல நடைமுறையாகும்; ஒரு உருவாக்குபவர் ஒரு வருடம் கழித்து சிக்கலைப் பார்த்தால், * உறுதிப்படுத்தப்பட்ட * சிட்டை இனி பொருந்தாது.
tr: *Confirmed*: (onaylandı) Hata raporlayan kişiden başka en az bir katılımcı tarafından onaylanmıştır (genellikle *Bug* raporları için). Bu etiketin amacı, geliştiricilerin üzerinde çalışacakları konuları seçmek istediklerinde hangi sorunların hala tekrarlanabilir olduğunu bilmelerini sağlamaktır. Bu nedenle, sorunun hangi platformda ve Godot'un hangi sürümü veya işlemesinde yeniden üretilebileceğine dair bir yorum eklemek iyi bir uygulamadır; bir geliştirici soruna bir yıl sonra bakacak olduğunda, bu *Confirmed* etiketi artık geçerli olmayabilir.
uk: *Підтверджено*: було підтверджено принаймні одним іншим учасником, окрім повідомлення про помилку (зазвичай для звітів про помилки). Мета цієї мітки— повідомити розробникам, які проблеми ще можна відтворити, коли вони хочуть вибрати, над чим працювати. Тому доцільно додати в коментарі, на якій платформі та в якій версії чи коміті Godot можна було б відтворити проблему; якщо розробник розглядає проблему через рік, позначка *Підтверджено* може більше не бути актуальною.
zh_tw: *Confirmed*：已確認。除回報者外，至少有一位其他貢獻者確認該 Bug（通常用於 Bug 報告）。這個標籤讓開發者能快速知道哪些問題目前仍可重現。建議在留言中註明可重現的平台與 Godot 版本或 Commit，若日後狀況改變，*Confirmed* 標籤可能就不再適用。

source: *Crash:* describes a bug that causes the engine to crash. This label is only used for "hard" crashes, not freezes.
ga: *Timpeadh: * Déanann cur síos ar fhabht a chuireann an t-inneall timpiste. Ní úsáidtear an lipéad seo ach le haghaidh timpeanna “crua”, ní reoiteann.
ta: * செயலிழப்பு:* இயந்திரத்தை செயலிழக்கச் செய்யும் பிழையை விவரிக்கிறது. இந்த சிட்டை "கடினமான" செயலிழப்புகளுக்கு மட்டுமே பயன்படுத்தப்படுகிறது, உறைந்தது அல்ல.
tr: *Crash:* (çökme) motorun çökmesine neden olan bir hatayı tanımlar. Bu etiket sadece "sert" çökmeler için kullanılır, donmalar için değil.
uk: *Збій:* описує помилку, яка спричиняє збій двигуна. Ця мітка використовується лише для «жорстких» збоїв, а не для зависань.
zh_tw: *Crash*：引擎發生當機（Crash）的問題。僅限「硬性當機」，不包括程式卡死（freeze）。

source: *Discussion*: the issue is not consensual and needs further discussion to define what exactly should be done to address the topic.
ga: *Pléithe*: níl an cheist comhthoiliúil agus teastaíonn tuilleadh plé uait chun a shainiú cad ba cheart a dhéanamh go díreach chun aghaidh a thabhairt ar an ábhar.
pl: *Discussion*: kwestia ta nie jest jednomyślna i wymaga dalszych dyskusji w celu określenia, co dokładnie należy zrobić, aby dojść do rozwiązania problemu lub dojścia do kompromisu.
ta: *கலந்துரையாடல்*: சிக்கல் சம்மதமானது அல்ல, தலைப்பைத் தீர்க்க சரியாக என்ன செய்ய வேண்டும் என்பதை வரையறுக்க மேலும் விவாதம் தேவை.
tr: *Discussion*: (tartışma) konu üzerinde uzlaşma sağlanmamıştır ve konunun ele alınması için tam olarak ne yapılması gerektiğini tanımlamak için daha fazla tartışmaya ihtiyaç vardır.
uk: *Обговорення*: питання не є консенсусним і потребує подальшого обговорення, щоб визначити, що саме слід зробити для вирішення теми.
zh_tw: *Discussion*：此議題尚未有共識，需要進一步討論以決定如何處理。

source: *Documentation*: related to the documentation. PRs with this label improve the class reference. Issues with this label are either for wrong documentation, or are user-reported "bugs" that are actually limitations to be further documented. Often paired with *Discussion*. Issues related to the ReadTheDocs documentation should be filed on the `godot-docs <https://github.com/godotengine/godot-docs>`_ repository.
uk: *Документація*: пов’язана з документацією. PR з цією міткою покращують посилання на клас. Проблеми з цією міткою пов’язані або з неправильною документацією, або з повідомленнями користувачів про «помилки», які насправді є обмеженнями, які необхідно додатково задокументувати. Часто в парі з *Обговоренням*. Питання, пов’язані з документацією ReadTheDocs, слід зберігати в репозиторії `godot-docs <https://github.com/godotengine/godot-docs>`_.
zh_tw: *Documentation*：與說明文件相關。此標籤的 PR 用於改善類別參考文件。若是 Issue，則可能是文件錯誤，或是使用者回報的「Bug」實際上只是需要補充文件說明的限制。常與 *Discussion* 搭配。若是 ReadTheDocs 文件相關問題，請在 `godot-docs <https://github.com/godotengine/godot-docs>`_ 倉庫提出。

source: *Enhancement*: describes a proposed enhancement to an existing functionality.
ga: * Feabhsaithe*: déanann cur síos ar fheabhsú beartaithe ar fheidhmiúlacht atá ann cheana.
pl: *Enhancement*: opisuje proponowane rozszerzenie istniejącej funkcjonalności.
ta: *விரிவாக்கம்*: ஏற்கனவே உள்ள செயல்பாட்டிற்கு முன்மொழியப்பட்ட மேம்பாட்டை விவரிக்கிறது.
tr: *Enhancement*: (iyileştirme) mevcut bir işlevsellik için önerilen bir geliştirmeyi tanımlar.
uk: *Покращення*: описує запропоноване вдосконалення наявної функції.
zh_tw: *Enhancement*：對現有功能的改善建議。

source: *Feature proposal*: used for PRs adding new features which do not have a corresponding proposal use this label. The label is removed when a feature proposal is created and linked. The main Godot repository no longer accepts feature requests as issues. Please use the `godot-proposals <https://github.com/godotengine/godot-proposals>`__ repository instead.
uk: *Пропозиція щодо функції*: використовується для запитів на оновлення, що додають нові функції, для яких немає відповідної пропозиції, використовуйте цю мітку. Мітка видаляється після створення та посилання на пропозицію щодо функції. Основний репозиторій Godot більше не приймає запити на нові функції як проблеми. Будь ласка, використовуйте замість цього репозиторій `godot-proposals <https://github.com/godotengine/godot-proposals>`__.

source: *For PR meeting*: the issue needs to be discussed in a pull request meeting. These meetings are public and are held on the `Godot Contributors Chat <https://chat.godotengine.org/>`_.
ga: *Do chruinniú Caidreamh Poiblí*: ní mór an cheist a phlé ag cruinniú iarratais tarraingthe. Is cruinnithe poiblí iad na cruinnithe seo agus tionóltar iad ar an `Godot Contributors Chat <https://chat.godotengine.org/>`_.
ta: *PR கூட்டத்திற்கு*: புல் கோரிக்கை கூட்டத்தில் சிக்கல் விவாதிக்கப்பட வேண்டும். இந்த கூட்டங்கள் பொதுவில் உள்ளன, மேலும் `கோடோட் பங்களிப்பாளர்கள் அரட்டை <https://chat.godotengine.org/> _ _.
tr: *For PR meeting*: (PR toplantısı için) sorunun bir çekme isteği toplantısında tartışılması gerekir. Bu toplantılar herkese açıktır ve `Godot Contributors Chat <https://chat.godotengine.org/>`_ üzerinde gerçekleştirilir.
uk: *Для PR-зустрічі*: питання потрібно обговорити на зустрічі за запитом на підключення. Ці зустрічі є публічними та проводяться в `чаті учасників Godot <https://chat.godotengine.org/>`_.
zh_tw: *For PR meeting*：此議題需在拉取請求（PR）會議中討論。會議為公開舉行，地點在 `Godot 貢獻者聊天室 <https://chat.godotengine.org/>`_。

source: *Good first issue*: the issue is *assumed* to be an easy one to fix, which makes it a great fit for new contributors who want to become familiar with the code base. It should be removed while an active PR is available, that resolves this issue.
ga: * An chéad cheist mhaí*: * glactar leis gurb é an tsaincheist éasca le socrú, rud a fhágann go bhfuil sé an-oiriúnach do rannpháirtithe nua atá ag iarraidh dul i dtaithí ar an mbonn cód. Ba chóir é a bhaint nuair a bhíonn PR gníomhach ar fáil, a réitíonn an cheist seo.
ta: . செயலில் உள்ள பி.ஆர் கிடைக்கும்போது அதை அகற்ற வேண்டும், இது இந்த சிக்கலை தீர்க்கும்.
tr: *Good first issue*: (İyi bir ilk sorun) Sorunun düzeltilmesinin kolay olduğu *varsayılmaktadır*, bu da onu kod tabanına aşina olmak isteyen yeni katılımcılar için mükemmel bir hedef haline getirmektedir. Bu sorunu çözen aktif bir PR mevcut ise kaldırılmalıdır.
uk: *Хороша перша проблема*: *передбачається*, що проблему легко виправити, тому вона чудово підходить для нових учасників, які хочуть ознайомитися з базою коду. Його слід видалити, поки доступний активний PR, який вирішує цю проблему.
zh_tw: *Good first issue*：假設為容易修正的問題，適合新手貢獻者熟悉程式碼基礎。若已有解決該問題的 PR，應移除此標籤。

source: *High priority:* the issue is particularly important as it can prevent people from releasing their projects or cause data loss.
ga: *High priority:* tá tábhacht ar leith ag baint leis an tsaincheist mar go bhféadfadh sé cosc a chur ar dhaoine a dtionscadail a scaoileadh nó a bheith ina gcúis le cailliúint sonraí.
ta: * அதிக முன்னுரிமை:* சிக்கல் குறிப்பாக முக்கியமானது, ஏனெனில் இது மக்கள் தங்கள் திட்டங்களை வெளியிடுவதைத் தடுக்கலாம் அல்லது தரவு இழப்பை ஏற்படுத்தும்.
tr: *High priority:* (yüksek öncelik) insanların projelerini yayınlamalarını engelleyebileceği veya veri kaybına neden olabileceği için bu konu özellikle önemlidir.
uk: *Високий пріоритет:* проблема особливо важлива, оскільки може перешкодити людям оприлюднити їхні проекти або спричинити втрату даних.
zh_tw: *High priority*：此問題極為重要，可能導致專案無法發佈或資料遺失。

source: *Needs testing*: the issue/pull request could not be completely tested and thus need further testing. This can mean that it needs to be tested on different hardware/software configurations or even that the steps to reproduce are not certain.
ga: * Riachtanais a thástáil*: ní fhéadfaí an saincheiste/iarraidh tarraingthe a thástáil go hiomlán agus dá bhrí sin tástáil breise D'fhéadfadh sé seo a chiallú go gcaithfear é a thástáil ar chumraíochtaí crua-earraí/bogearraí éagsúla nó fiú nach bhfuil na céimeanna chun atáirgeadh cinnte.
pl: *Needs testing*: Zgłoszenie błędu/Pull Request potrzebuje testów by wyeliminować problemy. Może to oznaczać, że musi być przetestowany na różnych konfiguracjach sprzętu/oprogramowania lub nawet, że kroki do odtworzenia określonych zachowań nie są pewne.
ta: *சோதனை தேவை*: பிரச்சினை/இழுக்கும் கோரிக்கையை முழுமையாக சோதிக்க முடியவில்லை, இதனால் மேலும் சோதனை தேவை. இது வெவ்வேறு வன்பொருள்/மென்பொருள் உள்ளமைவுகளில் சோதிக்கப்பட வேண்டும் அல்லது இனப்பெருக்கம் செய்வதற்கான படிகள் கூட உறுதியாக இல்லை என்று பொருள்.
tr: *Needs testing*: (test edilmesi gerekiyor) sorun/çekme talebi tam olarak test edilememiştir ve bu nedenle daha fazla test edilmesi gerekmektedir. Bu, farklı donanım/yazılım konfigürasyonlarında test edilmesi gerektiği veya hatta yeniden üretme adımlarının kesin olmadığı anlamına gelebilir.
uk: *Потребує тестування*: проблему/запит на вилучення не вдалося повністю перевірити, тому потребує подальшого тестування. Це може означати, що його потрібно перевірити на різних апаратних/програмних конфігураціях або навіть те, що кроки для відтворення не визначені.
zh_tw: *Needs testing*：此 Issue/PR 尚未完全測試，需要進一步測試。可能需於不同硬體/軟體設定下測試，或重現步驟尚不明確。

source: *Needs work*: the pull request needs additional work before it can be merged. Also for issues that are very incomplete, such as missing reproduction steps.
uk: *Потрібна доопрацювання*: запит на отримання потребує додаткової роботи, перш ніж його можна буде об’єднати. Також для проблем, які є дуже неповними, наприклад, відсутні кроки відтворення.
zh_tw: *Needs work*：此 PR 尚需補強才能合併。若 Issue 缺乏必要資訊（如重現步驟），也會使用本標籤。
