Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_projects.po
Languages: ga, it, ja, ta

source: Exporting projects
ga: Tionscadail onnmhairithe
it: Esportazione di progetti
ja: プロジェクトのエクスポート
ta: திட்டங்கள் ஏற்றுமதி

source: Why export?
ga: Cén fáth onnmhairiú?
it: Perché esportare?
ja: エクスポートする理由は?
ta: ஏன் ஏற்றுமதி?

source: Originally, Godot did not have any means to export projects. The developers would compile the proper binaries and build the packages for each platform manually.
ga: Ar dtús, ní raibh aon acmhainn ag Godot tionscadail a onnmhairiú. Bheadh na forbróirí a thiomsú na binaries cuí agus a thógáil ar na pacáistí do gach ardán de láimh.
it: Originariamente, Godot non aveva alcun mezzo per esportare i progetti. Gli sviluppatori compilavano i binari appropriati e creavano i pacchetti per ogni piattaforma manualmente.
ja: 当初、Godotにはプロジェクトをエクスポートする手段がありませんでした。 開発者は適切なバイナリをコンパイルし、各プラットフォーム用のパッケージを手動でビルドします。
ta: முதலில், கோடோட் திட்டங்களை ஏற்றுமதி செய்ய எந்த வழியும் இல்லை. உருவாக்குபவர்கள் சரியான பைனரிகளைத் தொகுத்து ஒவ்வொரு தளத்திற்கும் கைமுறையாக தொகுப்புகளை உருவாக்குவார்கள்.

source: When more developers (and even non-programmers) started using it, and when our company started taking more projects at the same time, it became evident that this was a bottleneck.
ga: Nuair a thosaigh níos mó forbróirí (agus fiú neamh-ríomhchláraitheoirí) á úsáid, agus nuair a thosaigh ár gcuideachta ag glacadh níos mó tionscadal ag an am céanna, ba léir gur scrogaill a bhí ann.
it: Quando sempre più sviluppatori (e anche non programmatori) hanno iniziato a utilizzarlo e quando la nostra azienda ha iniziato ad accettare più progetti alla volta, è diventato evidente che questo fu un collo di bottiglia.
ja: より多くの開発者(さらには非プログラマ)がそれを使用し始め、当社が同時により多くのプロジェクトを取り始めたとき、これがボトルネックであることが明らかになりました。
ta: அதிகமான உருவாக்குபவர்கள் (மற்றும் நிரல் அல்லாதவர்கள் கூட) இதைப் பயன்படுத்தத் தொடங்கியபோது, எங்கள் நிறுவனம் ஒரே நேரத்தில் அதிக திட்டங்களை எடுக்கத் தொடங்கியபோது, இது ஒரு இடையூறாக இருந்தது என்பது தெளிவாகத் தெரிந்தது.

source: On PC
ga: Ar ríomhaire
it: Su PC
ja: PC上
ta: பிசியில்

source: Distributing a game project on PC with Godot is rather easy. Drop the Godot binary in the same directory as the ``project.godot`` file, then compress the project directory and you are done.
ga: Tá sé sách éasca tionscadal cluiche a dháileadh ar ríomhaire le Godot. Buail an dénártha Godot san eolaire céanna leis an gcomhad ''project.godot'', ansin comhbhrúigh eolaire an tionscadail agus déantar tú.
it: Distribuire un progetto di gioco su PC con Godot è piuttosto semplice. Basta copiare l'eseguibile di Godot nella stessa cartella del file ``project.godot``, quindi comprimere la cartella del progetto e detto fatto.
ja: Godotを使用してPC上でゲームプロジェクトを配布することはかなり簡単です。Godotバイナリを ``project.godot`` ファイルと同じディレクトリにドロップし、プロジェクトディレクトリを圧縮すれば完了です。
ta: பி.சி.யில் ஒரு விளையாட்டு திட்டத்தை கோடோட்டுடன் விநியோகிப்பது மிகவும் எளிதானது. கோடோட் பைனரியை `` திட்டம்.கோடோட்`` கோப்பின் அதே கோப்பகத்தில் விடுங்கள், பின்னர் திட்ட கோப்பகத்தை சுருக்கவும், நீங்கள் முடித்துவிட்டீர்கள்.

source: It sounds simple, but there are probably a few reasons why the developer may not want to do this. The first one is that it may not be desirable to distribute loads of files. Some developers may not like curious users peeking at how the game was made, others may find it inelegant, and so on. Another reason is that the developer might prefer a specially-compiled binary, which is smaller in size, more optimized and does not include tools like the editor and debugger.
ga: Fuaimeanna sé simplí, ach is dócha go bhfuil roinnt cúiseanna ann nach bhfuil an forbróir ag iarraidh é seo a dhéanamh. Is é an chéad cheann ná go mb'fhéidir nach mbeadh sé inmhianaithe ualaí comhaid a dháileadh. B'fhéidir nach maith le roinnt forbróirí úsáideoirí aisteacha ag peeking ar an gcaoi a ndearnadh an cluiche, d'fhéadfadh daoine eile é a fháil inelegant, agus mar sin de. Cúis eile is ea go mb'fhéidir gurbh fhearr leis an bhforbróir dénártha a thiomsaítear go speisialta, atá níos lú i méid, níos optamaithe agus nach n-áirítear uirlisí cosúil leis an eagarthóir agus an dífhabhtóir.
it: Suona facile, ma ci sono probabilmente diverse ragioni per cui lo sviluppatore potrebbe non volerlo fare. La prima è che potrebbe non essere attraente distribuire grandi quantità di file. Alcuni sviluppatori potrebbero non gradire che utenti curiosi sbircino come è stato realizzato il gioco, altri potrebbero trovarlo poco elegante, e così via. Un altro motivo è che lo sviluppatore potrebbe preferire un eseguibile compilato appositamente, di dimensioni ridotte, più ottimizzato e privo di strumenti come l'editor e il debugger.
ja: これは簡単に聞こえますが、おそらく開発者がこれをしたくない理由がいくつかあります。 1つ目は、ファイルの読み込みを分散することが望ましくない場合があることです。一部の開発者は、好奇心旺盛なゲームユーザーがゲームの作成方法を覗き見るのを好まない場合があり、また他の開発者はゲームが洗練されていないなどと感じるかもしれません。もう1つの理由は、開発者が特別にコンパイルされたバイナリを好む可能性があることです。バイナリはサイズが小さく、より最適化されており、エディタやデバッガーなどのツールは含まれません。
ta: இது எளிமையானதாகத் தெரிகிறது, ஆனால் உருவாக்குபவர் இதைச் செய்ய விரும்பாததற்கு சில காரணங்கள் இருக்கலாம். முதலாவது, கோப்புகளின் சுமைகளை விநியோகிப்பது விரும்பத்தக்கதாக இருக்காது. சில உருவாக்குபவர்கள் ஆர்வமுள்ள பயனர்கள் விளையாட்டு எவ்வாறு தயாரிக்கப்பட்டார்கள் என்பதைப் பார்க்க விரும்பவில்லை, மற்றவர்கள் அதை பொருத்தமற்றதாகக் காணலாம், மற்றும் பல. மற்றொரு காரணம் என்னவென்றால், உருவாக்குபவர் விசேசமாக தொகுக்கப்பட்ட பைனரியை விரும்பலாம், இது அளவு சிறியது, அதிக உகந்ததாக உள்ளது மற்றும் ஆசிரியர் மற்றும் பிழைத்திருத்தர் போன்ற கருவிகளைக் கொண்டிருக்கவில்லை.

source: Finally, Godot has a simple but efficient system for :ref:`creating DLCs as extra package files <doc_exporting_pcks>`.
ga: Ar deireadh, tá córas simplí ach éifeachtach ag Godot le haghaidh :ref:`DLCanna a chruthú mar chomhaid pacáiste breise <doc_exporting_pcks>`.
it: Infine, Godot ha un sistema semplice ma efficiente per :ref:`creare DLC come file di pacchetto in più <doc_exporting_pcks>`.
ja: 最後に、Godotには :ref:`追加のパッケージファイルとしてDLCを作成する <doc_exporting_pcks>` ためのシンプルだが効率的なシステムがあります。
ta: இறுதியாக, கோடோட் ஒரு எளிய ஆனால் திறமையான அமைப்பைக் கொண்டுள்ளது: குறிப்பு: `கூடுதல் தொகுப்பு கோப்புகளாக டி.எல்.சிகளை உருவாக்குதல் <doc_exporting_pcks>`.

source: On mobile
ga: Ar an bhfón póca
it: Su dispositivi mobili
ja: モバイル上
ta: மொபைலில்

source: The same scenario on mobile platforms is a little worse. To distribute a project on those devices, a binary for each of those platforms is built, then added to a native project together with the game data.
ga: Tá an scéal céanna ar ardáin mhóibíleacha beagáinín níos measa. Chun tionscadal a dháileadh ar na feistí sin, tá dénártha do gach ceann de na hardáin sin tógtha, ansin a chur le tionscadal dúchais mar aon leis na sonraí cluiche.
it: Lo stesso scenario sulle piattaforme mobili è un po' peggiore. Per distribuire un progetto su questi dispositivi, viene creato un eseguibile per ciascuna di queste piattaforme, che viene poi aggiunto a un progetto nativo insieme ai dati di gioco.
ja: モバイルプラットフォームでの同じシナリオは少し厄介です。これらのデバイスでプロジェクトを配布するには、これらの各プラットフォームのバイナリがビルドされ、ゲームデータと共にネイティブプロジェクトに追加されます。
ta: மொபைல் தளங்களில் அதே காட்சி கொஞ்சம் மோசமானது. அந்த சாதனங்களில் ஒரு திட்டத்தை விநியோகிக்க, அந்த ஒவ்வொரு தளங்களுக்கும் ஒரு பைனரி கட்டப்பட்டு, பின்னர் விளையாட்டு தரவுகளுடன் ஒரு சொந்த திட்டத்தில் சேர்க்கப்படுகிறது.

source: This can be troublesome because it means that the developer must be familiarized with the SDK of each platform before even being able to export. While learning each SDK is always encouraged, it can be frustrating to be forced to do it at an undesired time.
ga: Is féidir é seo a bheith trioblóideach toisc go gciallaíonn sé go gcaithfidh an forbróir a bheith eolach ar SDK gach ardán sula mbeidh sé in ann onnmhairiú fiú. Cé go spreagtar foghlaim gach SDK i gcónaí, is féidir leis a bheith frustrating a bheith éigean é a dhéanamh ag am undesired.
it: Ciò può essere problematico perché significa che lo sviluppatore deve familiarizzarsi con l'SDK di ciascuna piattaforma prima ancora di poter esportare. Sebbene imparare a usare ogni SDK sia sempre incoraggiato, può essere frustrante essere costretti a farlo in un momento indesiderato.
ja: これは、開発者がエクスポートする前に各プラットフォームのSDKに精通している必要があることを意味するため、面倒な場合があります。各SDKを学ぶことは常に奨励されていますが、望ましくない時間にそれを行うことを余儀なくされることはイライラする可能性があります。
ta: இது தொந்தரவாக இருக்கும், ஏனென்றால் ஏற்றுமதி செய்வதற்கு முன்பே உருவாக்குபவர் ஒவ்வொரு தளத்தின் எச்.டி.கேவையும் அறிந்திருக்க வேண்டும். ஒவ்வொரு எச்.டி.கேவையும் கற்றுக்கொள்வது எப்போதுமே ஊக்குவிக்கப்படுகையில், விரும்பத்தகாத நேரத்தில் அதைச் செய்ய நிர்பந்திக்கப்படுவது வெறுப்பாக இருக்கும்.

source: There is also another problem with this approach: different devices prefer some data in different formats to run. The main example of this is texture compression. All PC hardware uses S3TC (BC) compression and that has been standardized for more than a decade, but mobile devices use different formats for texture compression, such as ETC1 and ETC2.
ga: Tá fadhb eile leis an gcur chuige seo freisin: is fearr le gléasanna éagsúla roinnt sonraí i bhformáidí éagsúla a rith. Is é an sampla is mó de seo comhbhrú uigeachta. Úsáideann gach crua-earraí ríomhaire comhbhrú S3TC (BC) agus tá sé sin caighdeánaithe ar feadh níos mó ná deich mbliana, ach úsáideann gléasanna soghluaiste formáidí éagsúla le haghaidh comhbhrú uigeachta, mar shampla ETC1 agus ETC2.
it: C'è anche un altro problema con questo approccio: dispositivi diversi preferiscono che alcuni dati siano in formati diversi per poterli eseguire. L'esempio principale è la compressione delle texture. Tutto l'hardware per PC utilizza la compressione S3TC (BC), standardizzata da oltre un decennio, ma i dispositivi mobili utilizzano formati diversi per la compressione delle texture, come ETC1 ed ETC2.
ja: このアプローチには別の問題もあります: 異なるデバイスは、実行するのに異なる形式のデータを好みます。この主な例は、テクスチャ圧縮です。すべてのPCハードウェアはS3TC(BC)圧縮を使用し、10年以上にわたって標準化されていますが、モバイルデバイスはETC1やETC2などのさまざまな形式のテクスチャ圧縮を使用します。
ta: இந்த அணுகுமுறையில் மற்றொரு சிக்கலும் உள்ளது: வெவ்வேறு சாதனங்கள் இயங்குவதற்கு சில தரவை விரும்புகின்றன. இதற்கு முக்கிய எடுத்துக்காட்டு அமைப்பு சுருக்கமானது. அனைத்து பிசி வன்பொருளும் S3TC (BC) சுருக்கத்தைப் பயன்படுத்துகின்றன, அவை ஒரு தசாப்தத்திற்கும் மேலாக தரப்படுத்தப்பட்டுள்ளன, ஆனால் மொபைல் சாதனங்கள் ETC1 மற்றும் முதலியன போன்ற அமைப்பு சுருக்கத்திற்கு வெவ்வேறு வடிவங்களைப் பயன்படுத்துகின்றன.

source: Export menu
ga: Easpórtáil roghchlár
it: Menu di esportazione
ja: エクスポートメニュー
ta: ஏற்றுமதி பட்டியல்

source: After many attempts at different export workflows, the current one has proven to work the best. At the time of this writing, not all platforms are supported yet, but the supported platforms continue to grow.
ga: Tar éis go leor iarrachtaí ar shreabhadh oibre onnmhairithe éagsúla, tá sé cruthaithe go n-oibríonn an ceann reatha an chuid is fearr. Ag am na scríbhneoireachta seo, ní thacaítear le gach ardán go fóill, ach tá na hardáin a dtacaítear leo ag fás i gcónaí.
it: Dopo numerosi tentativi con diversi flussi di lavoro di esportazione, quello attuale si è dimostrato il migliore. Al momento di scrittura di questa pagina, non tutte le piattaforme sono ancora supportate, ma il numero di piattaforme supportate continua ad aumentare.
ja: 異なるエクスポートワークフローで多くの試みを行った後、現在のワークフローが最適に機能することが実証されています。この執筆時点では、すべてのプラットフォームがまだサポートされているわけではありませんが、サポートされているプラットフォームは引き続き拡張されています。
ta: வெவ்வேறு ஏற்றுமதி பணிப்பாய்வுகளில் பல முயற்சிகளுக்குப் பிறகு, தற்போதையது சிறப்பாக செயல்படுவதாக நிரூபிக்கப்பட்டுள்ளது. இந்த எழுத்தின் போது, எல்லா தளங்களும் இன்னும் ஆதரிக்கப்படவில்லை, ஆனால் ஆதரிக்கப்பட்ட தளங்கள் தொடர்ந்து வளர்ந்து வருகின்றன.

source: To open the export menu, click the **Export** button:
ga: Chun an roghchlár easpórtála a oscailt, cliceáil ar an **Export** cnaipe:
it: Per aprire il menu di esportazione, cliccare sul pulsante **Esporta**:
ja: エクスポートメニューを開くには、[エクスポート]ボタンをクリックします:
ta: ஏற்றுமதி மெனுவைத் திறக்க, ** ஏற்றுமதி ** பொத்தானைக் சொடுக்கு செய்க:

source: The export menu will open. However, it will be completely empty. This is because we need to add an export preset.
ga: Osclófar an roghchlár easpórtála. Mar sin féin, beidh sé go hiomlán folamh. Tá sé seo toisc go gcaithfimid réamhshocraithe easpórtála a chur leis.
it: Si aprirà il menu di esportazione. Tuttavia, sarà completamente vuoto. Questo perché dobbiamo aggiungere una preimpostazione di esportazione.
ja: エクスポートメニューが開きます。ただし、完全に空の状態です。これは、エクスポートプリセットを追加する必要があるためです。
ta: ஏற்றுமதி பட்டியல் திறக்கப்படும். இருப்பினும், அது முற்றிலும் காலியாக இருக்கும். ஏற்றுமதி முன்னமைவை நாம் சேர்க்க வேண்டும் என்பதே இதற்குக் காரணம்.

source: To create an export preset, click the **Add…** button at the top of the export menu. This will open a drop-down list of platforms to choose from for an export preset.
ga: Chun réamhshocrú easpórtála a chruthú, cliceáil ar an gcnaipe **Add...** ag barr an roghchláir easpórtála. Osclóidh sé seo liosta anuas na n-ardán a roghnú as le haghaidh réamhshocraithe easpórtála.
it: Per creare una preimpostazione di esportazione, cliccare sul pulsante **Aggiungi…** in alto al menu di esportazione. Si aprirà un elenco a discesa di piattaforme tra cui scegliere per una preimpostazione di esportazione.
ja: エクスポートプリセットを作成するには、エクスポートメニューの上部にある[**追加…**]ボタンをクリックします。これにより、エクスポートプリセット用に選択できるプラットフォームのドロップダウンリストが開きます。
ta: ஏற்றுமதி முன்னமைவை உருவாக்க, ஏற்றுமதி மெனுவின் மேலே உள்ள ** சேர்… ** பொத்தானைக் சொடுக்கு செய்க. இது ஏற்றுமதி முன்னமைவைத் தேர்வுசெய்ய வேண்டிய தளங்களின் கீழ்தோன்றும் பட்டியலைத் திறக்கும்.

source: The default options are often enough to export, so tweaking them is usually not necessary. However, many platforms require additional tools (SDKs) to be installed to be able to export. Additionally, Godot needs export templates installed to create packages. The export menu will complain when something is missing and will not allow the user to export for that platform until they resolve it:
ga: Is minic a bhíonn na roghanna réamhshocraithe go leor le honnmhairiú, mar sin ní gá iad a tweaking de ghnáth. Mar sin féin, éilíonn go leor ardán uirlisí breise (SDKs) a shuiteáil chun a bheith in ann onnmhairiú. Ina theannta sin, teastaíonn teimpléid easpórtála ó Godot atá suiteáilte chun pacáistí a chruthú. Déanfaidh an roghchlár easpórtála gearán nuair a bhíonn rud éigin ar iarraidh agus ní ligfidh sé don úsáideoir onnmhairiú don ardán sin go dtí go réiteoidh siad é:
it: Le opzioni predefinite sono spesso sufficienti per l'esportazione, quindi di solito non è necessario aggiustarle. Tuttavia, molte piattaforme richiedono l'installazione di strumenti aggiuntivi (SDK) per poter esportare. Inoltre, Godot richiede l'installazione di modelli di esportazione per creare pacchetti. Il menu di esportazione segnalerà se manca qualcosa e non permetterà all'utente di esportare per quella piattaforma finché non lo risolverà:
ja: 多くの場合、エクスポートするにはデフォルトのオプションで十分なので、それらを微調整する必要は通常ありません。ただし、多くのプラットフォームでは、エクスポートできるように追加のツール(SDK)をインストールする必要があります。さらに、Godotはパッケージを作成するためにエクスポートテンプレートをインストールする必要があります。エクスポートメニューは、何かが欠けていると文句を言い、ユーザーが解決するまでそのプラットフォームにエクスポートすることを許可しません。
ta: இயல்புநிலை விருப்பங்கள் பெரும்பாலும் ஏற்றுமதி செய்ய போதுமானவை, எனவே அவற்றை முறுக்குவது பொதுவாக தேவையில்லை. இருப்பினும், பல தளங்களுக்கு ஏற்றுமதி செய்ய கூடுதல் கருவிகள் (எச்.டி.கே) நிறுவப்பட வேண்டும். கூடுதலாக, கோடோட் தொகுப்புகளை உருவாக்க ஏற்றுமதி வார்ப்புருக்கள் நிறுவப்பட வேண்டும். ஏதேனும் காணாமல் போகும்போது ஏற்றுமதி பட்டியல் குற்றச்சாட்டு அளிக்கும், மேலும் அந்த தளத்தை தீர்க்கும் வரை பயனரை ஏற்றுமதி செய்ய அனுமதிக்காது:

source: At that time, the user is expected to come back to the documentation and follow instructions on how to properly set up that platform.
ga: Ag an am sin, táthar ag súil go dtiocfaidh an t-úsáideoir ar ais chuig an doiciméadú agus treoracha a leanúint maidir le conas an t-ardán sin a chur ar bun i gceart.
it: A quel punto, è previsto che l'utente torni alla documentazione e segui le istruzioni su come configurare correttamente la piattaforma.
ja: その時点で、ユーザーはドキュメントに戻り、そのプラットフォームを適切にセットアップする方法の指示に従うことが期待されます。
ta: அந்த நேரத்தில், பயனர் ஆவணங்களுக்கு திரும்பி வந்து அந்த தளத்தை எவ்வாறு சரியாக அமைப்பது என்பதற்கான வழிமுறைகளைப் பின்பற்றுவார் என்று எதிர்பார்க்கப்படுகிறது.

source: The buttons at the bottom of the menu allow you to export the project in a few different ways:
ga: Ligeann na cnaipí ag bun an roghchláir duit an tionscadal a easpórtáil ar roinnt bealaí éagsúla:
it: I pulsanti in fondo al menu consentono di esportare il progetto in diversi modi:
ja: メニューの下部にあるボタンを使用すると、いくつかの異なる方法でプロジェクトをエクスポートできます:
ta: மெனுவின் அடிப்பகுதியில் உள்ள பொத்தான்கள் திட்டத்தை சில வெவ்வேறு வழிகளில் ஏற்றுமதி செய்ய அனுமதிக்கின்றன:

source: Export All: Export the project as a playable build (Godot executable and project data) for all the presets defined. All presets must have an **Export Path** defined for this to work.
ga: Easpórtáil Gach: Easpórtáil an tionscadal mar thógáil playable (Godot inrite agus sonraí tionscadail) do na réamhshocruithe sainithe. Ní mór **Export Path ** a bheith ag gach réamhshocrú chun go n-oibreoidh sé seo.
it: Esporta tutto: esporta il progetto come build riproducibile (eseguibile Godot e dati del progetto) per tutte le preimpostazioni definite. Per poter funzionare, tutte le preimpostazioni devono avere un **Percorso di esportazione** definito.
ja: **すべてをエクスポート**: プロジェクトをプレイ可能なビルド(Godotの実行ファイルとプロジェクトデータ)として、定義されたすべてのプリセットに対してエクスポートします。この機能を使用するには、すべてのプリセットに **エクスポート先のパス** が定義されている必要があります。
ta: அனைத்தையும் ஏற்றுமதி: வரையறுக்கப்பட்ட அனைத்து முன்னமைவுகளுக்கும் திட்டத்தை ஒரு விளையாடக்கூடிய கட்டமைப்பாக (கோடோட் இயங்கக்கூடிய மற்றும் திட்ட தரவு) ஏற்றுமதி செய்யுங்கள். அனைத்து முன்னமைவுகளிலும் இது வேலை செய்ய ** ஏற்றுமதி பாதை ** வரையறுக்கப்பட வேண்டும்.

source: Export Project: Export the project as a playable build (Godot executable and project data) for the selected preset.
ga: Tionscadal Easpórtála: Easpórtáil an tionscadal mar thógáil playable (sonraí inrite Godot agus tionscadail) don réamhshocrú roghnaithe.
it: Esporta progetto: esporta il progetto come build riproducibile (eseguibile Godot e dati del progetto) per la preimpostazione selezionata.
ja: **プロジェクトのエクスポート**: プロジェクトをプレイ可能なビルド(Godotの実行ファイルとプロジェクトデータ)として、選択されたプリセットに対してエクスポートします。
ta: ஏற்றுமதி திட்டம்: தேர்ந்தெடுக்கப்பட்ட முன்னமைவுக்கு திட்டத்தை இயக்கக்கூடிய கட்டமைப்பாக (கோடோட் இயங்கக்கூடிய மற்றும் திட்ட தரவு) ஏற்றுமதி செய்யுங்கள்.

source: Export PCK/ZIP: Export the project resources as a PCK or ZIP package. This is not a playable build, it only exports the project data without a Godot executable.
ga: Easpórtáil PCK / ZIP: Easpórtáil acmhainní an tionscadail mar phacáiste PCK nó ZIP. Ní tógáil playable é seo, ní onnmhairíonn sé ach sonraí an tionscadail gan inrite Godot.
it: Esporta PCK/ZIP: esporta le risorse del progetto come pacchetto PCK o ZIP. Questa non è una build riproducibile, esporta solo i dati del progetto senza un eseguibile Godot.
ja: **PCK/ZIP のエクスポート**: プロジェクトのリソースを PCK または ZIP パッケージとしてエクスポートします。これはプレイ可能なビルドではなく、Godot の実行ファイルを含まないプロジェクトデータのみをエクスポートします。
ta: PCK/ZIP ஐ ஏற்றுமதி செய்யுங்கள்: திட்ட வளங்களை PCK அல்லது ZIP தொகுப்பாக ஏற்றுமதி செய்யுங்கள். இது விளையாடக்கூடிய கட்டமைப்பல்ல, இது கோடோட் இயங்கக்கூடிய இல்லாமல் திட்டத் தரவை மட்டுமே ஏற்றுமதி செய்கிறது.

source: Export templates
ga: Easpórtáil teimpléid
it: Modelli di esportazione
ja: エクスポートテンプレート
ta: ஏற்றுமதி வார்ப்புருக்கள்

source: Apart from setting up the platform, the export templates must be installed to be able to export projects. They can be obtained as a TPZ file (which is a renamed ZIP archive) from the `download page of the website <https://www.godotengine.org/download>`_.
ga: Seachas an t-ardán a chur ar bun, ní mór na teimpléid easpórtála a shuiteáil le bheith in ann tionscadail a onnmhairiú. Is féidir iad a fháil mar chomhad TPZ (atá mar chartlann ZIP athainmnithe) ó `leathanach íoslódála an tsuímh Ghréasáin <https://www.godotengine.org/download>`_.
it: Oltre alla configurazione della piattaforma, per poter esportare i progetti è necessario installare i modelli di esportazione. Sono disponibili come file TPZ (un archivio ZIP rinominato) dalla `pagina di download del sito web <https://www.godotengine.org/download>`_.
ja: プラットフォームの設定とは別に、プロジェクトをエクスポートできるようにエクスポートテンプレートをインストールする必要があります。これらは、\ `ウェブサイトのダウンロードページ<https://www.godotengine.org/download>` からTPZファイル(名前が変更されたZIPアーカイブ)として取得できます。
ta: தளத்தை அமைப்பதைத் தவிர, திட்டங்களை ஏற்றுமதி செய்ய ஏற்றுமதி வார்ப்புருக்கள் நிறுவப்பட வேண்டும். <https://www.godotengine.org/download> `_ என்ற வலைத்தளத்தின்` பதிவிறக்க பக்கத்திலிருந்து அவற்றை TPZ கோப்பாக (இது மறுபெயரிடப்பட்ட சிப் காப்பகம்) பெறலாம்.

source: Once downloaded, they can be installed using the **Install Export Templates** option in the editor:
ga: Nuair a íoslódáiltear iad, is féidir iad a shuiteáil ag baint úsáide as an **Suiteáil Teimpléid Easpórtála ** rogha san eagarthóir:
it: Una volta scaricati, si possono installare attraverso l'opzione **Installa modelli di esportazione** nell'editor:
ja: ダウンロードしたら、エディタの **エクスポートテンプレートの管理 [ファイルからインストール]** オプションを使用してインストールできます。
ta: பதிவிறக்கம் செய்யப்பட்டதும், அவற்றை ** நிறுவல் ஏற்றுமதி வார்ப்புருக்கள் ** விருப்பத்தைப் பயன்படுத்தி நிறுவலாம்:

source: Resource options
ga: Roghanna acmhainne
it: Opzioni di risorse
ja: リソースオプション
ta: வள விருப்பங்கள்

source: When exporting, Godot makes a list of all the files to export and then creates the package. There are 3 different modes for exporting:
ga: Nuair a onnmhairiú, Déanann Godot liosta de na comhaid go léir a onnmhairiú agus ansin cruthaíonn an pacáiste. Tá 3 modhanna éagsúla le haghaidh onnmhairithe:
it: All'esportazione, Godot crea un elenco di tutti i file da esportare e poi crea il pacchetto. Esistono 3 diverse modalità di esportazione:
ja: エクスポート時に、Godotはエクスポートするすべてのファイルのリストを作成し、パッケージを作成します。エクスポートには3つの異なるモードがあります:
ta: ஏற்றுமதி செய்யும் போது, கோடோட் அனைத்து கோப்புகளின் பட்டியலையும் ஏற்றுமதி செய்ய உருவாக்கி பின்னர் தொகுப்பை உருவாக்குகிறது. ஏற்றுமதி செய்ய 3 வெவ்வேறு முறைகள் உள்ளன:

source: Export all resources in the project
ga: Easpórtáil na hacmhainní go léir sa tionscadal
it: Esporta tutte le risorse nel progetto
ja: プロジェクト内のリソースをすべてエクスポート
ta: திட்டத்தில் உள்ள அனைத்து வளங்களையும் ஏற்றுமதி செய்யுங்கள்

source: Export selected scenes (and dependencies)
ga: Easpórtáil radhairc roghnaithe (agus spleáchais)
it: Esporta le scene selezionate (incluse le dipendenze)
ja: 選択したシーン(と依存関係にあるもの)をエクスポート
ta: தேர்ந்தெடுக்கப்பட்ட காட்சிகளை ஏற்றுமதி செய்யுங்கள் (மற்றும் சார்புகள்)

source: Export selected resources (and dependencies)
ga: Easpórtáil acmhainní roghnaithe (agus spleáchais)
it: Esporta le risorse selezionate (incluse le dipendenze)
ja: 選択したリソース(と依存関係にあるもの)をエクスポート
ta: தேர்ந்தெடுக்கப்பட்ட வளங்களை ஏற்றுமதி செய்யுங்கள் (மற்றும் சார்புகள்)
