Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_projects.po
Languages: ga, it, ja, ta

source: **Export all resources in the project** will export every resource in the project. **Export selected scenes** and **Export selected resources** gives you a list of the scenes or resources in the project, and you have to select every scene or resource you want to export.
ga: **Easpórtáil na hacmhainní go léir sa tionscadal** a onnmhaireoidh gach acmhainn sa tionscadal. **Easpórtáil radhairc roghnaithe** agus **Easpórtáil acmhainní roghnaithe** tugann sé liosta duit de na radhairc nó na hacmhainní sa tionscadal, agus caithfidh tú gach radharc nó acmhainn is mian leat a onnmhairiú a roghnú.
it: **Esporta tutte le risorse nel progetto** esporterà tutte le risorse nel progetto. **Esporta scene selezionate** ed **Esporta risorse selezionate** forniscono un elenco delle scene o delle risorse nel progetto, e sarà necessario selezionare ogni scena o risorsa che si desidera esportare.
ja: **プロジェクト内のリソースをすべてエクスポート** は、プロジェクト内のすべてのリソースをエクスポートします。 **選択したシーンをエクスポート** と **選択したリソースをエクスポート** は、プロジェクト内のシーンまたはリソースのリストを表示し、エクスポートしたいシーンやリソースを個別に選択する必要があります。
ta: ** திட்டத்தில் உள்ள அனைத்து வளங்களையும் ஏற்றுமதி செய்யுங்கள் ** திட்டத்தில் ஒவ்வொரு வளத்தையும் ஏற்றுமதி செய்யும். ** தேர்ந்தெடுக்கப்பட்ட காட்சிகளை ஏற்றுமதி செய்யுங்கள் ** மற்றும் ** தேர்ந்தெடுக்கப்பட்ட வளங்களை ஏற்றுமதி செய்யுங்கள் ** திட்டத்தில் உள்ள காட்சிகள் அல்லது வளங்களின் பட்டியலை உங்களுக்கு வழங்குகிறது, மேலும் நீங்கள் ஏற்றுமதி செய்ய விரும்பும் ஒவ்வொரு காட்சி அல்லது வளத்தையும் தேர்ந்தெடுக்க வேண்டும்.

source: **Export all resources in the project except resources checked below** does exactly what it says, everything will be exported except for what you select in the list.
it: **Esporta tutte le risorse nel progetto eccetto quelle selezionate di seguito** fa esattamente ciò che dice: tutto verrà esportato tranne ciò che è selezionato nell'elenco.

source: **Export as dedicated server** will remove all visuals from a project and replace them with a placeholder. This includes Cubemap, CubemapArray, Material, Mesh, Texture2D, Texture2DArray, Texture3D. You can also go into the list of files and specify specific visual resources that you do wish to keep.
it: **Esporta come server dedicato** rimuoverà tutti gli elementi visivi da un progetto e li sostituirà con un segnaposto. Questo include Cubemap, CubemapArray, Material, Mesh, Texture2D, Texture2DArray, Texture3D. È anche possibile accedere all'elenco dei file e specificare le risorse visive specifiche che si desidera mantenere.

source: Files and folders whose name begin with a period will never be included in the exported project. This is done to prevent version control folders like ``.git`` from being included in the exported PCK file.
ga: Ní bheidh comhaid agus fillteáin a dtosaíonn a n-ainm le tréimhse san áireamh sa tionscadal a onnmhairítear. Déantar é seo chun cosc a chur ar fhillteáin rialaithe leaganacha cosúil le ''.git'' a bheith san áireamh sa chomhad PCK onnmhairithe.
it: I file e le cartelle i cui nomi iniziano con un punto non saranno mai inclusi nel progetto esportato. Questo per evitare che cartelle di controllo versione come ``.git`` siano incluse nel file PCK esportato.
ja: 名前がピリオド(.)で始まるファイルやフォルダーは、エクスポートされたプロジェクトには決して含まれません。これは、エクスポートされたPCKファイルに ``.git`` のようなバージョン管理フォルダーが含まれるのを防ぐためです。
ta: ஏற்றுமதி செய்யப்பட்ட திட்டத்தில் ஒருபோதும் ஒரு காலத்துடன் தொடங்கும் கோப்புகள் மற்றும் கோப்புறைகள் ஒருபோதும் சேர்க்கப்படாது. `` .Git`` போன்ற பதிப்பு கட்டுப்பாட்டு கோப்புறைகளை ஏற்றுமதி செய்யப்பட்ட பி.சி.கே கோப்பில் சேர்க்கப்படுவதைத் தடுக்க இது செய்யப்படுகிறது.

source: Below the list of resources are two filters that can be setup. The first allows non-resource files such as ``.txt``, ``.json`` and ``.csv`` to be exported with the project. The second filter can be used to exclude every file of a certain type without manually deselecting every one. For example, ``.png`` files.
it: Sotto l'elenco delle risorse sono presenti due filtri configurabili. Il primo consente di esportare file risorsa non di tipo ``.txt``, ``.json`` e ``.csv`` con il progetto. Il secondo filtro serve per escludere tutti i file di un certo tipo senza deselezionarli manualmente. Ad esempio, i file ``.png``.
ta: வளங்களின் பட்டியலுக்கு கீழே அமைக்கக்கூடிய இரண்டு வடிப்பான்கள் உள்ளன. முதலாவது `` .txt``, `.சோன்`` மற்றும்` .csv`` போன்ற வளங்கள் அல்லாத கோப்புகளை திட்டத்துடன் ஏற்றுமதி செய்ய அனுமதிக்கிறது. இரண்டாவது வடிப்பானை ஒரு குறிப்பிட்ட வகையின் ஒவ்வொரு கோப்பையும் கைமுறையாக தேர்வு செய்யாமல் விலக்க பயன்படுத்தலாம். எடுத்துக்காட்டாக, `` .png`` கோப்புகள்.

source: Configuration files
ga: Comhaid chumraíochta
it: File di conﬁgurazione
ja: 設定ファイル
ta: உள்ளமைவு கோப்புகள்

source: The export configuration is stored in two files that can both be found in the project directory:
ga: Stóráiltear an chumraíocht easpórtála in dhá chomhad ar féidir an dá cheann a fháil san eolaire tionscadail:
it: La configurazione di esportazione è memorizzata in due file, entrambi reperibili nella cartella del progetto:
ja: エクスポート設定は、プロジェクトディレクトリ内にある以下の2つのファイルに保存されます:
ta: ஏற்றுமதி உள்ளமைவு இரண்டு கோப்புகளில் சேமிக்கப்படுகிறது, அவை இரண்டும் திட்ட கோப்பகத்தில் காணப்படுகின்றன:

source: ``export_presets.cfg``: This file contains the vast majority of the export configuration and can be safely committed to version control. There is nothing in here that you would normally have to keep secret.
ga: ''export_presets.cfg'': Tá formhór mór na cumraíochta easpórtála sa chomhad seo agus is féidir é a thiomnú go sábháilte do rialú leaganacha. Níl aon rud anseo go mbeadh ort de ghnáth a choinneáil faoi rún.
it: ``export_presets.cfg``: questo file contiene la maggior parte della configurazione di esportazione e si può tranquillamente inviare al controllo versione. Non contiene nulla che normalmente si dovrebbe tenere segreto.
ja: \ ``export_presets.cfg``: このファイルにはエクスポート設定の大部分が含まれており、安全にバージョン管理システムにコミットできます。このファイルには通常秘密にする必要のある情報は含まれていません。
ta: `` export_presets.cfg``: இந்த கோப்பில் ஏற்றுமதி உள்ளமைவின் பெரும்பகுதி உள்ளது மற்றும் பதிப்பு கட்டுப்பாட்டுக்கு பாதுகாப்பாக உறுதியாக இருக்க முடியும். நீங்கள் பொதுவாக ரகசியமாக வைத்திருக்க வேண்டிய எதுவும் இங்கே இல்லை.

source: ``.godot/export_credentials.cfg``: This file contains export options that are considered confidential, like passwords and encryption keys. It should generally **not** be committed to version control or shared with others unless you know exactly what you are doing.
ga: ''.godot/export_credentials.cfg'': Tá roghanna easpórtála sa chomhad seo a mheastar a bheith rúnda, cosúil le pasfhocail agus eochracha criptithe. Ba chóir go ginearálta **ní** a bheith tiomanta do rialú leagan nó a roinnt le daoine eile mura bhfuil a fhios agat go díreach cad atá á dhéanamh agat.
it: ``.godot/export_credentials.cfg``: Questo file contiene opzioni di esportazione considerate riservate, come password e chiavi di crittografia. In genere, **non** si dovrebbe inviare al controllo versione o condiviso con altri, a meno che non si sappia esattamente cosa si sta facendo.
ja: \ ``.godot/export_credentials.cfg``: このファイルにはパスワードや暗号化キーなど、機密性の高いエクスポートオプションが含まれています。通常、このファイルはバージョン管理にコミットしたり、他人と共有したりすることは、その意味を十分に理解していない限り **すべきではありません** 。
ta: `. நீங்கள் என்ன செய்கிறீர்கள் என்பது உங்களுக்குத் தெரியாவிட்டால் இது பொதுவாக ** அல்ல ** பதிப்பு கட்டுப்பாட்டுக்கு உறுதியளிக்கப்பட வேண்டும் அல்லது மற்றவர்களுடன் பகிர்ந்து கொள்ள வேண்டும்.

source: Since the credentials file is usually kept out of version control systems, some export options will be missing if you clone the project to a new machine. The easiest way to deal with this is to copy the file manually from the old location to the new one.
ga: Ós rud é go gcoinnítear an comhad dintiúir as córais rialaithe leagan de ghnáth, beidh roinnt roghanna easpórtála ar iarraidh má chlónálann tú an tionscadal chuig meaisín nua. Is é an bealach is éasca chun déileáil leis seo ná an comhad a chóipeáil de láimh ón sean-suíomh go dtí an ceann nua.
it: Poiché il file delle credenziali è solitamente escluso dai sistemi di controllo versione, alcune opzioni di esportazione risulteranno mancanti se si clona il progetto su una nuova macchina. Il modo più semplice per risolvere ciò è copiare manualmente il file dalla vecchia posizione a quella nuova.
ja: 認証情報ファイルは通常バージョン管理システムから除外されるため、新しいマシンにプロジェクトをクローンすると一部のエクスポートオプションが欠落することがあります。この問題への最も簡単な対処方法は、古い場所から新しい場所へ手動でファイルをコピーすることです。
ta: நற்சான்றிதழ் கோப்பு வழக்கமாக பதிப்பு கட்டுப்பாட்டு அமைப்புகளுக்கு வெளியே வைக்கப்படுவதால், நீங்கள் திட்டத்தை ஒரு புதிய இயந்திரத்திற்கு நகலி செய்தால் சில ஏற்றுமதி விருப்பங்கள் காணாமல் போகும். இதைச் சமாளிப்பதற்கான எளிதான வழி, கோப்பை பழைய இடத்திலிருந்து புதிய இடத்திற்கு கைமுறையாக நகலெடுப்பதாகும்.

source: Exporting from the command line
ga: Easpórtáil ó líne na n- orduithe
it: Esportare dalla riga di comando
ja: コマンドラインからエクスポート
ta: கட்டளை வரியிலிருந்து ஏற்றுமதி

source: In production, it is useful to automate builds, and Godot supports this with the ``--export-release`` and ``--export-debug`` command line parameters. Exporting from the command line still requires an export preset to define the export parameters. A basic invocation of the command would be:
ga: I dtáirgeadh, tá sé úsáideach tógáil a uathoibriú, agus tacaíonn Godot leis seo leis na paraiméadair líne ordaithe ''--export-release'' agus ''--export-debug''. Éilíonn onnmhairiú ó líne na n-orduithe réamhshocraithe onnmhairithe fós chun na paraiméadair onnmhairithe a shainiú. Is éard a bheadh i gceist le agairt bhunúsach an ordaithe ná:
it: In produzione, è utile automatizzare le build, e Godot lo supporta con i parametri della riga di comando ``--export-release`` e ``--export-debug``. L'esportazione dalla riga di comando richiede comunque una preimpostazione di esportazione per definire i parametri di esportazione. Un'invocazione basilare del comando sarebbe:
ja: 制作においては自動ビルドが便利ですが、Godotではコマンドラインのパラメーター\ ``--export-release``\ および\ ``--export-debug``\ を使うことで可能になります。コマンドラインからのエクスポートでも、設定のためにエクスポート用プリセットを指定する必要があります。コマンドラインでの基本的な呼び出し方はこうです:
ta: உற்பத்தியில், கட்டமைப்பை தானியக்கமாக்குவது பயனுள்ளதாக இருக்கும், மேலும் கோடோட் இதை ``-எக்ச்போர்ட்-வெளியீடு` மற்றும் ``-எக்ச்போர்ட்-டெபக்`` கட்டளை வரி அளவுருக்களுடன் ஆதரிக்கிறது. கட்டளை வரியிலிருந்து ஏற்றுமதி செய்வதற்கு ஏற்றுமதி அளவுருக்களை வரையறுக்க ஏற்றுமதி முன்னமைவு தேவைப்படுகிறது. கட்டளையின் அடிப்படை அழைப்பு:

source: This will export to ``some_name.exe``, assuming there is a preset called "Windows Desktop" and the template can be found. (The export preset name must be written within quotes if it contains spaces or special characters.) The output path is *relative to the project path* or *absolute*; **it does not respect the directory the command was invoked from**.
ga: Easpórtálfaidh sé seo go ''some_name.exe'', ag glacadh leis go bhfuil réamhshocrú ann ar a dtugtar "Windows Desktop" agus is féidir an teimpléad a aimsiú. (Ní mór an t-ainm réamhshocraithe easpórtála a scríobh laistigh de luachana má tá spásanna nó carachtair speisialta ann.) Tá an cosán aschuir *i gcoibhneas le cosán an tionscadail *nó *absolute *; **níl meas aige ar an eolaire a agairt an t-ordú ó**.
it: Questo esporterà in ``some_name.exe``, supponendo che esista una preimpostazione chiamata "Windows Desktop" e che il modello si possa trovate. (Il nome della preimpostazione di esportazione deve essere scritto tra virgolette se contiene spazi o caratteri speciali.) Il percorso di output è *relativo al percorso del progetto* o *assoluto*; **non rispetta la cartella da cui è stato invocato il comando**.
ja: "Windows Desktop" というプリセットと、テンプレートが見つかれば、これで\ ``some_name.exe``\ へとエクスポートします。(エクスポートのプリセット名に空白や特殊文字が含まれている場合は、引用符(")で囲む必要があります)出力先のパスは、 *プロジェクトからの相対パス* か、* 絶対パス* を指定します。 **コマンド実行時のディレクトリは関係ありません** 。
ta: இது `` சில_நேம்.இஎக்ச்`` க்கு ஏற்றுமதி செய்யும், "சாளரங்கள் டெச்க்டாப்" என்று அழைக்கப்படும் ஒரு முன்னமைவு இருப்பதாகவும், வார்ப்புருவைக் காணலாம். (ஏற்றுமதி முன்னமைக்கப்பட்ட பெயர் இடங்கள் அல்லது சிறப்பு எழுத்துக்களைக் கொண்டிருந்தால் மேற்கோள்களுக்குள் எழுதப்பட வேண்டும்.) வெளியீட்டு பாதை *திட்ட பாதையுடன் தொடர்புடையது *அல்லது *முழுமையான *; ** இது கட்டளை ** இலிருந்து பயன்படுத்தப்பட்ட கோப்பகத்தை மதிக்காது.

source: The output file extension should match the one used by the Godot export process:
ga: Ba chóir go mbeadh an síneadh comhad aschur comhoiriúnach leis an gceann a úsáideann an próiseas onnmhairithe Godot:
it: L'estensione del file risultante dovrebbe corrispondere a quella utilizzata dal processo di esportazione di Godot:
ja: 出力ファイルの拡張子はGodotのエクスポートプロセスで使われているものと同じ必要があります:
ta: வெளியீட்டு கோப்பு நீட்டிப்பு கோடோட் ஏற்றுமதி செயல்முறையால் பயன்படுத்தப்பட்டவற்றுடன் பொருந்த வேண்டும்:

source: macOS: ``.app`` or ``.zip`` (or ``.dmg`` when exporting *from* macOS)
it: macOS: ``.app`` o ``.zip`` (o ``.dmg`` quando si esporta *da* macOS)

source: Linux: Any extension (including none). ``.x86_64`` is typically used for 64-bit x86 binaries.
ga: Linux: Aon síneadh (lena n-áirítear aon cheann). Úsáidtear ''.x86_64'' de ghnáth le haghaidh dénártha x86 64-giotán.
it: Linux: qualsiasi estensione (inclusa nessuna). ``.x86_64`` è in genere utilizzato per gli eseguibili x86 a 64 bit.
ja: Linux: 任意の拡張子 (拡張子なしも含む)。 ``.x86_64`` が64bit x86バイナリで典型的に使われています。
ta: லினக்ச்: எந்த நீட்டிப்பு (எதுவும் உட்பட). `` .x86_64`` பொதுவாக 64-பிட் ஃச் 86 பைனரிகளுக்கு பயன்படுத்தப்படுகிறது.

source: It is often useful to combine the ``--export-release`` flag with the ``--path`` flag, so that you do not need to ``cd`` to the project folder before running the command:
ga: Is minic a bhíonn sé úsáideach an bhratach ''--export-release'' a chur le chéile leis an mbratach ''--path'', ionas nach gá duit ''cd'' a chur le fillteán an tionscadail sula ritheann tú an t-ordú:
it: Spesso è utile combinare il flag ``--export-release`` con il flag ``--path``, in modo da non dover passare alla cartella del progetto tramite ``cd`` prima di eseguire il comando:
ja: \ ``--export-release``\ フラグに\ ``--path``\ フラグを組み合わせると、コマンドを実行する前にプロジェクトフォルダに ``cd`` する必要がなくなり、しばしば便利です。
ta: ``--பாத்`` கொடியுடன் ``-எக்ச்போர்ட்-வெளியீடு`` கொடியை இணைப்பது பெரும்பாலும் பயனுள்ளதாக இருக்கும், இதனால் கட்டளையை இயக்குவதற்கு முன்பு நீங்கள் திட்டக் கோப்புறையில் `` சிடி`` தேவையில்லை:

source: See :ref:`doc_command_line_tutorial` for more information about using Godot from the command line.
ga: Féach :ref:'doc_command_line_tutorial' le haghaidh tuilleadh eolais faoi Godot a úsáid ó líne na n-orduithe.
it: Consultare :ref:`doc_command_line_tutorial` per maggiori informazioni sull'utilizzo di Godot dalla riga di comando.
ja: Godotのコマンドラインからの使用については、 :ref:`doc_command_line_tutorial` で詳細を参照してください。
ta: காண்க: குறிப்பு: கட்டளை வரியிலிருந்து கோடோட்டைப் பயன்படுத்துவது பற்றிய கூடுதல் தகவலுக்கு `doc_command_line_tutorial`.

source: PCK versus ZIP pack file formats
ga: PCK versus formáidí comhaid pacáiste ZIP
it: Formati di file di pacchetto PCK control ZIP
ja: PCK と ZIP、 packファイル形式の比較
ta: பி.சி.கே மற்றும் சிப் பேக் கோப்பு வடிவங்கள்

source: Each format has its upsides and downsides. PCK is the default and recommended format for most use cases, but you may want to use a ZIP archive instead depending on your needs.
ga: Tá gach formáid a upsides agus downsides. Is é PCK an fhormáid réamhshocraithe agus molta don chuid is mó de na cásanna úsáide, ach b'fhéidir gur mhaith leat cartlann ZIP a úsáid ina ionad sin ag brath ar do chuid riachtanas.
it: Ogni formato ha i suoi vantaggi e svantaggi. PCK è il formato predefinito e consigliato per la maggior parte dei casi d'uso, ma si potrebbe voler usare un archivio ZIP in alternativa, a seconda delle proprie esigenze.
ja: それぞれのフォーマットには長所と短所があります。PCKはデフォルトで、ほとんどの用途で推奨されますが、場面によってはZIPアーカイブを代わりに使いたいこともあるでしょう。
ta: ஒவ்வொரு வடிவமைப்பும் அதன் தலைகீழ்கள் மற்றும் தீமைகளைக் கொண்டுள்ளது. பி.சி.கே என்பது பெரும்பாலான பயன்பாட்டு நிகழ்வுகளுக்கான இயல்புநிலை மற்றும் பரிந்துரைக்கப்பட்ட வடிவமாகும், ஆனால் உங்கள் தேவைகளைப் பொறுத்து அதற்கு பதிலாக ஒரு சிப் காப்பகத்தைப் பயன்படுத்த விரும்பலாம்.

source: **PCK format:**
ga: ** Formáid PCK:**
it: **Formato PCK:**
ja: \ **PCK フォーマット:**
ta: ** பி.சி.கே வடிவம்: **

source: Uncompressed format. Larger file size, but faster to read/write.
ga: Formáid neamhchomhbhrúite. Méid comhaid níos mó, ach níos tapúla a léamh / scríobh.
it: Formato non compresso. File di dimensioni maggiori, ma più veloce in lettura/scrittura.
ja: 非圧縮のフォーマットです。ファイルサイズが大きいですが、読み/書きが早いです。
ta: சுருக்கப்படாத வடிவம். பெரிய கோப்பு அளவு, ஆனால் படிக்க/எழுத வேகமாக.

source: Not readable and writable using tools normally present on the user's operating system, even though there are `third-party tools <https://github.com/hhyyrylainen/GodotPckTool>`__ to extract and create PCK files.
ga: Níl sé inléite agus inscríofa ag baint úsáide as uirlisí a bhíonn i láthair de ghnáth ar chóras oibriúcháin an úsáideora, cé go bhfuil `uirlisí tríú páirtí <https://github.com/hhyyrylainen/GodotPckTool>`__ ann chun comhaid PCK a bhaint agus a chruthú.
it: Non leggibile e scrivibile tramite gli strumenti normalmente presenti nel sistema operativo dell'utente, nonostante esistano `strumenti di terze parti <https://github.com/hhyyrylainen/GodotPckTool>`__ per estrarre e creare file PCK.
ja: 通常、ユーザーのオペレーティングシステムに備わっているツールでは読み書きできませんが、PCKファイルを抽出および作成するための `サードパーティーツール <https://github.com/hhyyrylainen/GodotPckTool>`__ が存在します。
ta: `மூன்றாம் தரப்பு கருவிகள் <https://github.com/hhyyryrylainen/godotpcktool> __ __ பி.சி.கே கோப்புகளை பிரித்தெடுக்கவும் உருவாக்கவும் இருந்தாலும், பயனரின் இயக்க முறைமையில் பொதுவாக இருக்கும் கருவிகளைப் பயன்படுத்தாத மற்றும் எழுதக்கூடியது அல்ல.

source: **ZIP format:**
ga: ** Formáid ZIP:**
it: **Formato ZIP:**
ja: \ **ZIPフォーマット:**
ta: ** சிப் வடிவம்: **

source: Compressed format. Smaller file size, but slower to read/write.
ga: Formáid chomhbhrúite. Méid comhaid níos lú, ach níos moille le léamh / scríobh.
it: Formato compresso. File di dimensioni inferiori, ma più lento in lettura/scrittura.
ja: 圧縮されたフォーマットです。ファイルサイズが小さく、読み/書きが遅いです。
ta: சுருக்கப்பட்ட வடிவம். சிறிய கோப்பு அளவு, ஆனால் படிக்க/எழுத மெதுவாக.

source: Readable and writable using tools normally present on the user's operating system. This can be useful to make modding easier (see also :ref:`doc_exporting_pcks`).
ga: Inléite agus inscríofa ag baint úsáide as uirlisí a bhíonn i láthair de ghnáth ar chóras oibriúcháin an úsáideora. Is féidir é seo a bheith úsáideach chun modding a dhéanamh níos éasca (féach freisin :ref:'doc_exporting_pcks').
it: Leggibile e scrivibile tramite gli strumenti normalmente presenti nel sistema operativo dell'utente. Ciò può essere utile facilitare il modding (consultare anche :ref:`doc_exporting_pcks`).
ja: ユーザーのオペレーティングシステムに通常備わっているツールで読み書き可能です。この性質はMOD作成を容易にするのに役立ちます( :ref:`doc_exporting_pcks` も参照してください)。
ta: பயனரின் இயக்க முறைமையில் பொதுவாக இருக்கும் கருவிகளைப் பயன்படுத்தி படிக்கக்கூடிய மற்றும் எழுதக்கூடியது. மோடிங்கை எளிதாக்க இது பயனுள்ளதாக இருக்கும் (மேலும் காண்க: ref: `doc_exporting_pcks`).

source: Due to a `known bug <https://github.com/godotengine/godot/pull/42123>`__, when using a ZIP file as a pack file, the exported binary will not try to use it automatically. Therefore, you have to create a *launcher script* that the player can double-click or run from a terminal to launch the project:
it: A causa di un `bug noto <https://github.com/godotengine/godot/pull/42123>`__, quando si utilizza un file ZIP come file di pacchetto, l'eseguibile esportato non tenterà di utilizzarlo automaticamente. Pertanto, è necessario creare uno *script di avvio* su cui il giocatore possa fare doppio clic o eseguire da un terminale per avviare il progetto:

source: Save the launcher script and place it in the same folder as the exported binary. On Linux, make sure to give executable permissions to the launcher script using the command ``chmod +x launch.sh``.
ga: Sábháil an script Tosaitheoir agus é a chur san fhillteán céanna leis an dénártha a onnmhairítear. Ar Linux, déan cinnte ceadanna inrite a thabhairt do script an tosaitheora ag baint úsáide as an ordú ''chmod +x launch.sh''.
it: Salvare lo script di avvio e posizionarlo nella stessa cartella dell'eseguibile esportato. Su Linux, assicurarsi di assegnare i permessi di esecuzione allo script di avvio tramite il comando ``chmod +x launch.sh``.
ja: launcherスクリプトを保存し、エクスポートされるバイナリと同じフォルダに置いてください。Linuxでは、launcherスクリプトに ``chmod +x launch.sh`` コマンドを使い、実行のパーミッションを付与するようにしてください。
ta: துவக்கி ச்கிரிப்டைச் சேமித்து ஏற்றுமதி செய்யப்பட்ட பைனரி போன்ற கோப்புறையில் வைக்கவும். லினக்சில், `` chmod +x வெளியீடு. `` கட்டளையைப் பயன்படுத்தி துவக்கி ச்கிரிப்ட்டுக்கு இயங்கக்கூடிய அனுமதிகளை வழங்குவதை உறுதிசெய்க.

source: Below the list of resources are two filters that can be setup. The first allows non resource files such as ``.txt``, ``.json`` and ``.csv`` to be exported with the project. The second filter can be used to exclude every file of a certain type without manually deselecting every one. For example, ``.png`` files.
ga: Faoi bhun liosta na n-acmhainní tá dhá scagaire is féidir a shocrú. Ceadaíonn an chéad cheann comhaid neamhacmhainne ar nós ''.txt'', ''.json'' agus ''.csv'' a easpórtáil leis an tionscadal. Is féidir an dara scagaire a úsáid chun gach comhad de chineál áirithe a eisiamh gan gach ceann a dhíroghnú de láimh. Mar shampla, comhaid ''.png''.
ja: リソース一覧の下には、2つのフィルターを設定することができます。1つ目のフィルターでは、 ``.txt`` 、 ``.json`` 、 ``.csv`` などのリソース以外のファイルをプロジェクトと一緒にエクスポートすることができます。2つ目のフィルターでは、特定の種類のファイル、例えば、 ``.png`` ファイルなど、を手動で一つずつ選択解除することなく、一括で除外することができます。

source: macOS: ``.zip`` (from all platforms) or ``.dmg`` (only when exporting *from* macOS). ``.app`` is not supported directly, although the generated ZIP archive contains an ``.app`` bundle.
ga: macOS: ''.zip'' (ó gach ardán) nó ''.dmg'' (ach amháin nuair a onnmhairítear *ó * macOS). Ní thacaítear go díreach le ''.app'', cé go bhfuil beart ''.app'' sa chartlann ZIP a ghintear.
ja: macOS: ``.zip`` (全プラットフォームから) または ``.dmg`` (macOS *から* エクスポートする時のみ)。 ``.app`` は直接サポートされていません。ただ、生成された ZIPアーカイブには ``.app`` バンドルが含まれています。

source: You can also configure it to export *only* the PCK or ZIP file, allowing a single exported main pack file to be used with multiple Godot executables. When doing so, the export preset name must still be specified on the command line:
ga: Is féidir leat é a chumrú freisin chun * amháin * an comhad PCK nó ZIP a onnmhairiú, rud a ligeann comhad príomhphacáiste onnmhairithe amháin a úsáid le il-inrite Godot. Agus é sin á dhéanamh, ní mór an t-ainm réamhshocraithe easpórtála a shonrú fós ar líne na n-orduithe:
ja: また、PCK または ZIP ファイル *のみ* をエクスポートするように設定することもできます。これにより、1 つのエクスポートされたメインのパックファイルを複数の Godot 実行ファイルと併用することができます。その際、エクスポートプリセット名をコマンドラインで指定する必要があります:
ta: பி.சி.கே அல்லது சிப் கோப்பை மட்டும் * ஏற்றுமதி செய்ய நீங்கள் அதை உள்ளமைக்கலாம், இது ஒரு ஏற்றுமதி செய்யப்பட்ட முதன்மையான பேக் கோப்பை பல கோடோட் இயங்கக்கூடியவற்றுடன் பயன்படுத்த அனுமதிக்கிறது. அவ்வாறு செய்யும்போது, ஏற்றுமதி முன்னமைக்கப்பட்ட பெயர் இன்னும் கட்டளை வரியில் குறிப்பிடப்பட வேண்டும்:

source: Due to a `known bug <https://github.com/godotengine/godot/pull/42123>`__, when using a ZIP file as a pack file, the exported binary will not try to use it automatically. Therefore, you have to create a *launcher script* that the player can double-click or run from a terminal to launch the project::
ga: De bharr `fabht ar a dtugtar <https://github.com/godotenginine/godot/pull/42123>`__, agus comhad ZIP á úsáid mar chomhad pacáiste, ní dhéanfaidh an dénártha easpórtáilte iarracht é a úsáid go huathoibríoch. Mar sin, caithfidh tú *script tosaitheoir* a chruthú gur féidir leis an imreoir cliceáil faoi dhó nó a rith ó theirminéal chun an tionscadal a sheoladh::
ja: `既知のバグ <https://github.com/godotengine/godot/pull/42123>`__ により、ZIPファイルをpackファイルとして使う際、エクスポートされたバイナリは自動でそれを使おうとしません。したがって、プロジェクトを起動するためには *launcher スクリプト* を作り、プレイヤーがダブルクリックかまたはターミナルから実行できるようにする必要があります::

source: Windows: ``.exe``
ta: விண்டோச்: `` .exe``
