Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_linux.po
Languages: ga, ru

source: Exporting for Linux
ga: Easpórtáil le haghaidh Linux
ru: Экспорт для Linux

source: This page describes how to export a Godot project to Linux. If you're looking to compile editor or export template binaries from source instead, read :ref:`doc_compiling_for_linuxbsd`.
ga: Déanann an leathanach seo cur síos ar conas tionscadal Godot a onnmhairiú go Linux. Má tá tú ag iarraidh eagarthóir nó binaries teimpléad onnmhairithe a thiomsú ón bhfoinse ina ionad sin, léigh :ref:'doc_compiling_for_linuxbsd'.
ru: На этой странице описано, как экспортировать проект Godot в Linux. Если вы хотите скомпилировать редактор или экспортировать исполняемые файлы шаблона из исходного кода, см. :ref:`doc_compiling_for_linuxbsd`.

source: The simplest way to distribute a game for PC is to copy the executable (``godot``), compress the folder and send it to someone else. However, this is often not desired.
ga: Is é an bealach is simplí chun cluiche a dháileadh le haghaidh ríomhaire ná an inrite ('godot') a chóipeáil, an fillteán a chomhbhrú agus é a sheoladh chuig duine eile. Mar sin féin, is minic nach bhfuil sé seo ag teastáil.
ru: Самый простой способ распространения игры для ПК — скопировать исполняемый файл (``godot``), заархивировать папку и отправить её кому-нибудь ещё. Однако часто это нежелательно.

source: Godot offers a more elegant approach for PC distribution when using the export system. When exporting for Linux, the exporter takes all the project files and creates a ``data.pck`` file. This file is bundled with a specially optimized binary that is smaller, faster and does not contain the editor and debugger.
ga: Godot Cuireann cur chuige níos galánta do dháileadh ríomhaire nuair a úsáid an córas onnmhairithe. Agus é ag easpórtáil le haghaidh Linux, glacann an t-onnmhaireoir na comhaid tionscadail go léir agus cruthaíonn sé comhad ''data.pck''. Tá an comhad seo cuachta le dénártha optamaithe go speisialta atá níos lú, níos tapúla agus nach bhfuil an t-eagarthóir agus an dífhabhtóir ann.
ru: Godot предлагает более элегантный подход к распространению на ПК с помощью системы экспорта. При экспорте для Linux экспортер берёт все файлы проекта и создаёт файл ``data.pck``. Этот файл поставляется вместе со специально оптимизированным исполняемым файлом, который меньше по размеру, быстрее и не содержит редактора и отладчика.

source: Environment variables
ga: Athróga timpeallachta
ru: Переменные среды

source: You can use the following environment variables to set export options outside of the editor. During the export process, these override the values that you set in the export menu.
ga: Is féidir leat na hathróga timpeallachta seo a leanas a úsáid chun roghanna easpórtála a shocrú lasmuigh den eagarthóir. Le linn an phróisis easpórtála, sáraíonn siad seo na luachanna a shocraíonn tú sa roghchlár easpórtála.
ru: Вы можете использовать следующие переменные окружения, чтобы задавать опции экспорта вне редактора. Во время процесса экспорта, они переопределяют значения, которые были заданы в меню экспорта.

source: Linux export environment variables
ga: Athróga timpeallachta easpórtála Linux
ru: Переменные среды экспорта Linux

source: Export option
ga: Rogha easpórtála
ru: Опции экспорта

source: Environment variable
ga: Athróg timpeallachta
ru: Переменная окружения

source: Encryption / Encryption Key
ga: Eochair Chriptithe / Chriptithe
ru: Шифрование / Ключ шифрования

source: Export options
ru: Опции экспорта

source: You can find a full list of export options available in the :ref:`class_EditorExportPlatformLinuxBSD` class reference.
ru: Полный список доступных параметров экспорта можно найти в справочнике классов :ref:`class_EditorExportPlatformLinuxBSD`.
