Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/cpp/about_godot_cpp.po
Languages: ru, ta, uk, zh_cn, zh_hant

source: About godot-cpp
ru: О godot-cpp
ta: கோடோட்-சிபிபி பற்றி
uk: Про godot-cpp
zh_cn: 关于 godot-cpp
zh_hant: 關於 godot-cpp

source: `godot-cpp <https://github.com/godotengine/godot-cpp>`__ are the official C++ GDExtension bindings, maintained as part of the Godot project.
ru: `godot-cpp <https://github.com/godotengine/godot-cpp>`__ являются официальными привязками C++ GDExtension, поддерживаемыми как часть проекта Godot.
ta: `கோடோட்-சி.பி.பி <https://github.com/godotengine/godot-cpp>` __ என்பது கோடோட் திட்டத்தின் ஒரு பகுதியாக பராமரிக்கப்படும் அதிகாரப்பூர்வ சி ++ சிடெக்ச்டென்சன் பிணைப்புகள்.
uk: `godot-cpp <https://github.com/godotengine/godot-cpp>`__ — це офіційні прив'язки C++ GDExtension, що підтримуються як частина проєкту Godot.
zh_cn: `godot-cpp <https://github.com/godotengine/godot-cpp>`__ 是官方的 C++ GDExtension 绑定，作为 Godot 项目的一部分进行维护。
zh_hant: `godot-cpp <https://github.com/godotengine/godot-cpp>`__ 是官方的 C++ GDExtension 繫結，作為 Godot 專案的一部分進行維護。

source: godot-cpp is built with the :ref:`GDExtension system <doc_gdextension>`, which allows access to Godot in almost the same way as :ref:`modules <doc_custom_modules_in_cpp>`: A lot of `engine code <https://github.com/godotengine/godot>`__ can be used in your godot-cpp project almost exactly as it is.
ru: godot-cpp собран с использованием :ref:`GDExtension system <doc_gdextension>`, которая позволяет получить доступ к Godot почти таким же образом, как :ref:`modules <doc_custom_modules_in_cpp>`: большую часть `кода движка <https://github.com/godotengine/godot>`__ можно использовать в вашем проекте godot-cpp почти так же, как он есть.
ta: கோடோட்-சிபிபி: ref: `gdextension சிச்டம் <doc_gdextension>` உடன் கட்டப்பட்டுள்ளது, இது கோடோட்டை அணுக அனுமதிக்கிறது: குறிப்பு: `தொகுதிகள் <doc_custom_modules_in_cpp>`: நிறைய `இன்சின் குறியீடு <https:/ugithelub. அது.
uk: godot-cpp зібрано за допомогою системи :ref:`GDExtension system <doc_gdextension>`, яка дозволяє доступ до Godot майже так само, як :ref:`modules <doc_custom_modules_in_cpp>`: Багато коду `рушія <https://github.com/godotengine/godot>`__ можна використовувати у вашому проекті godot-cpp майже так само, як він є.
zh_cn: godot-cpp 基于 :ref:`GDExtension 系统 <doc_gdextension>` 构建，其访问 Godot 的方式与 :ref:`C++ 模块 <doc_custom_modules_in_cpp>` 几乎一致：您可以直接在 godot-cpp 项目中复用大量 `引擎代码 <https://github.com/godotengine/godot>`__，几乎无需修改。
zh_hant: godot-cpp 建立在 :ref:`GDExtension 系統 <doc_gdextension>` 之上，能以與 :ref:`模組 <doc_custom_modules_in_cpp>` 幾乎相同的方式存取 Godot：許多 `引擎程式碼 <https://github.com/godotengine/godot>`__ 幾乎可原封不動地用在你的 godot-cpp 專案中。

source: In particular, godot-cpp has access to all functions that :ref:`GDScript <doc_gdscript>` and :ref:`C# <doc_c_sharp>` have, and additional access to a few more for fast low-level access of data, or deeper integration with Godot.
ru: В частности, godot-cpp имеет доступ ко всем функциям, которые есть в :ref:`GDScript <doc_gdscript>` и :ref:`C# <doc_c_sharp>`, а также дополнительный доступ к нескольким другим для быстрого низкоуровневого доступа к данным или более глубокой интеграции с Godot.
ta: குறிப்பாக, கோடோட்-சிபிபிக்கு அனைத்து செயல்பாடுகளுக்கும் அணுகல் உள்ளது: ref: `gdscript <doc_gdscript>` மற்றும்: ref: `c# <doc_c_sharp>` வைத்திருங்கள், மேலும் தரவை விரைவாக குறைந்த அளவிலான அணுகலுக்காக அல்லது கோடோட்டுடன் ஆழமான ஒருங்கிணைப்புக்கு கூடுதல் அணுகல்.
uk: Зокрема, godot-cpp має доступ до всіх функцій, що й :ref:`GDScript <doc_gdscript>` та :ref:`C# <doc_c_sharp>`, а також додатковий доступ до кількох інших для швидкого низькорівневого доступу до даних або глибшої інтеграції з Godot.
zh_cn: 特别是，godot-cpp 能够访问 :ref:`GDScript <doc_gdscript>` 和 :ref:`C# <doc_c_sharp>` 的所有功能，并额外提供一些更底层的快速数据访问接口，以及与 Godot 更深度的集成能力。
zh_hant: 特別是，godot-cpp 能存取 :ref:`GDScript <doc_gdscript>` 與 :ref:`C# <doc_c_sharp>` 可用的所有功能，並額外提供一些介面以便快速地低階存取資料，或與 Godot 進行更深度的整合。

source: Differences between godot-cpp and C++ modules
ru: Различия между модулями godot-cpp и C++
ta: கோடோட்-சிபிபி மற்றும் சி ++ தொகுதிகளுக்கு இடையிலான வேறுபாடுகள்
uk: Різниця між модулями godot-cpp та C++
zh_cn: godot-cpp 与 C++ 模块的区别
zh_hant: godot-cpp 與 C++ 模組的差異

source: You can use both `godot-cpp <https://github.com/godotengine/godot-cpp>`__ and :ref:`C++ modules <doc_custom_modules_in_cpp>` to run C or C++ code in a Godot project.
ru: Вы можете использовать как `godot-cpp <https://github.com/godotengine/godot-cpp>`__, так и :ref:`C++ modules <doc_custom_modules_in_cpp>` для запуска кода C или C++ в проекте Godot.
ta: கோடோட் திட்டத்தில் சி அல்லது சி ++ குறியீட்டை இயக்க `` __ மற்றும் __ மற்றும் __: `சி ++ தொகுதிகள் <doc_custom_modules_in_cpp>` சி ++ தொகுதிகள் <doc_custom_modules_in_cpp> இரண்டையும் நீங்கள் பயன்படுத்தலாம்.
uk: Ви можете використовувати як `godot-cpp <https://github.com/godotengine/godot-cpp>`__, так і :ref:`C++ modules <doc_custom_modules_in_cpp>` для запуску коду C або C++ у проекті Godot.
zh_cn: 你可以使用 `godot-cpp <https://github.com/godotengine/godot-cpp>`__ 和 :ref:`C++ 模块 <doc_custom_modules_in_cpp>`\ 在 Godot 项目中执行 C/C++ 代码。
zh_hant: 你可以使用 `godot-cpp <https://github.com/godotengine/godot-cpp>`__ 或 :ref:`C++ 模組 <doc_custom_modules_in_cpp>` 在 Godot 專案中執行 C/C++ 程式碼。

source: They also both allow you to integrate third-party libraries into Godot. The one you should choose depends on your needs.
ru: Они также позволяют интегрировать в Godot библиотеки сторонних разработчиков. Выбор того или иного варианта зависит от ваших потребностей.
ta: மூன்றாம் தரப்பு நூலகங்களை கோடோட்டில் ஒருங்கிணைக்க அவை இரண்டும் உங்களை அனுமதிக்கின்றன. நீங்கள் தேர்வு செய்ய வேண்டிய ஒன்று உங்கள் தேவைகளைப் பொறுத்தது.
uk: Вони також дозволяють інтегрувати бібліотеки сторонніх розробників у Godot. Той, який ви повинні вибрати, залежить від ваших потреб.
zh_cn: 它们都可以用来将第三方库集成进 Godot。选用哪一个取决于你的需求。
zh_hant: 這兩者也都能將第三方函式庫整合進 Godot。你該選哪一種方式，取決於你的需求。

source: Advantages of godot-cpp
ru: Преимущества godot-cpp
ta: கோடோட்-சிபிபியின் நன்மைகள்
uk: Переваги godot-cpp
zh_cn: godot-cpp 的优势
zh_hant: godot-cpp 的優點

source: Unlike modules, godot-cpp (and GDExtensions, in general) don't require compiling the engine's source code, making it easier to distribute your work. It gives you access to most of the API available to GDScript and C#, allowing you to code game logic with full control regarding performance. It's ideal if you need high-performance code you'd like to distribute as an add-on in the :ref:`asset library <doc_what_is_assetlib>`.
ru: В отличие от модулей, godot-cpp (и GDExtensions в целом) не требует компиляции исходного кода движка, что упрощает распространение вашей работы. Он предоставляет доступ к большей части API, доступных для GDScript и C#, позволяя программировать игровую логику с полным контролем производительности. Он идеально подходит, если вам нужен высокопроизводительный код, который вы хотели бы распространять как дополнение в библиотеке :ref:`asset library <doc_what_is_assetlib>`.
ta: தொகுதிகள் போலல்லாமல், கோடோட்-சிபிபி (மற்றும் gdextensions, பொதுவாக) இயந்திரத்தின் மூலக் குறியீட்டை தொகுக்க தேவையில்லை, இது உங்கள் வேலையை விநியோகிப்பதை எளிதாக்குகிறது. இது GDSCRIPT மற்றும் C#க்கு கிடைக்கக்கூடிய பெரும்பாலான பநிஇ க்கான அணுகலை உங்களுக்கு வழங்குகிறது, இது செயல்திறன் தொடர்பான முழு கட்டுப்பாட்டுடன் விளையாட்டு தர்க்கத்தை குறியிட உங்களை அனுமதிக்கிறது. உங்களுக்கு உயர் செயல்திறன் குறியீடு தேவைப்பட்டால் இது சிறந்தது: ref: `சொத்து நூலகம் <doc_what_is_assetlib>`.
uk: На відміну від модулів, godot-cpp (і GDExtensions загалом) не потребують компіляції вихідного коду рушія, що спрощує розповсюдження вашої роботи. Він надає вам доступ до більшості API, доступних для GDScript та C#, що дозволяє вам кодувати ігрову логіку з повним контролем над продуктивністю. Він ідеально підходить, якщо вам потрібен високопродуктивний код, який ви хотіли б розповсюджувати як доповнення в :ref:`asset library <doc_what_is_assetlib>`.
zh_cn: 与模块不同，godot-cpp（以及一般意义上的 GDExtensions）无需编译引擎源码，这可以让你的作品更易于分发。GDExtension 可以让你访问 GDScript 和 C# 中大多数可用的API，让你在编写游戏逻辑时能够完全掌控性能，是你在\ :ref:`资产库 <doc_what_is_assetlib>`\ 中以插件形式分发高性能代码的理想选择。
zh_hant: 與模組不同，godot-cpp（以及一般的 GDExtension）不需要編譯引擎原始碼，使散佈你的作品更容易。它提供與 GDScript 與 C# 幾乎相同的 API，讓你在撰寫遊戲邏輯時能完全掌控效能。若你需要將高效能的程式碼製作成附加元件並發佈到 :ref:`素材庫 <doc_what_is_assetlib>`，這是理想的選擇。

source: Also:
ru: А также:
ta: மேலும்:
uk: також:
zh_cn: 并且：
zh_hant: 此外：

source: You can use the same compiled godot-cpp library in the editor and exported project. With C++ modules, you have to recompile all the export templates you plan to use if you require its functionality at runtime.
ru: Вы можете использовать одну и ту же скомпилированную библиотеку godot-cpp в редакторе и экспортированном проекте. При использовании модулей C++ вам потребуется перекомпилировать все шаблоны экспорта, которые вы планируете использовать, если вам потребуется их функциональность во время выполнения.
ta: எடிட்டர் மற்றும் ஏற்றுமதி திட்டத்தில் அதே தொகுக்கப்பட்ட கோடோட்-சிபிபி நூலகத்தை நீங்கள் பயன்படுத்தலாம். சி ++ தொகுதிகள் மூலம், இயக்க நேரத்தில் அதன் செயல்பாடு தேவைப்பட்டால் நீங்கள் பயன்படுத்தத் திட்டமிடும் அனைத்து ஏற்றுமதி வார்ப்புருக்களையும் மீண்டும் தொகுக்க வேண்டும்.
uk: Ви можете використовувати ту саму скомпільовану бібліотеку godot-cpp у редакторі та експортованому проекті. З модулями C++ вам доведеться перекомпілювати всі шаблони експорту, які ви плануєте використовувати, якщо вам потрібна її функціональність під час виконання.
zh_cn: 你可以在编辑器和导出项目中使用相同的编译后的 godot-cpp 库。而对于 C++ 模块，如果你想在运行时使用相关功能，就必须重新编译所有想要使用的导出模板。
zh_hant: 你可以在編輯器與匯出後的專案中使用同一份已編譯的 godot-cpp 程式庫。相較之下，若使用 C++ 模組，若要在執行時提供其功能，則必須重新編譯所有計畫使用的匯出範本。

source: godot-cpp only requires you to compile your library, not the whole engine. That's unlike C++ modules, which are statically compiled into the engine. Every time you change a module, you need to recompile the engine. Even with incremental builds, this process is slower than using godot-cpp.
ru: godot-cpp требует компиляции только вашей библиотеки, а не всего движка. В отличие от модулей C++, которые статически компилируются в движок. Каждый раз при изменении модуля необходимо перекомпилировать движок. Даже при инкрементальной сборке этот процесс медленнее, чем при использовании godot-cpp.
ta: கோடோட்-சிபிபி உங்கள் நூலகத்தை தொகுக்க வேண்டும், முழு இயந்திரமும் அல்ல. இது சி ++ தொகுதிகள் போலல்லாது, அவை நிலையான முறையில் இயந்திரத்தில் தொகுக்கப்படுகின்றன. ஒவ்வொரு முறையும் நீங்கள் ஒரு தொகுதியை மாற்றும்போது, நீங்கள் இயந்திரத்தை மீண்டும் தொகுக்க வேண்டும். அதிகரிக்கும் கட்டடங்களுடன் கூட, இந்த செயல்முறை கோடோட்-சிபிபியைப் பயன்படுத்துவதை விட மெதுவாக உள்ளது.
uk: godot-cpp вимагає лише компіляції бібліотеки, а не всього движка. Це відрізняється від модулів C++, які статично компілюються в движок. Щоразу, коли ви змінюєте модуль, вам потрібно перекомпілювати движок. Навіть з інкрементальними збірками цей процес повільніший, ніж використання godot-cpp.
zh_cn: godot-cpp 只需编译你自己的库，而无需编译整个引擎。这与 C++ 模块不同，后者会被静态编译进引擎中。每修改一次模块，你就需要重新编译整个引擎。即使使用增量构建，这一过程也比编译 Godot-C++ 要慢。
zh_hant: 使用 godot-cpp 時只需編譯你的程式庫，而非整個引擎。這與 C++ 模組不同，後者會被靜態編譯進引擎中。每次你變更模組，都得重編整個引擎；即使有增量建置，這流程仍比使用 godot-cpp 慢。

source: Advantages of C++ modules
ru: Преимущества модулей C++
ta: சி ++ தொகுதிகளின் நன்மைகள்
uk: Переваги модулів C++
zh_cn: C++ 模块的优点
zh_hant: C++ 模組的優點

source: We recommend :ref:`C++ modules <doc_custom_modules_in_cpp>` in cases where godot-cpp (or another GDExtension system) isn't enough:
ru: Мы рекомендуем :ref:`C++ modules <doc_custom_modules_in_cpp>` в случаях, когда godot-cpp (или другой системы GDExtension) недостаточно:
ta: நாங்கள் பரிந்துரைக்கிறோம்: குறிப்பு: `சி ++ தொகுதிகள் <doc_custom_modules_in_cpp>` கோடோட்-சிபிபி (அல்லது மற்றொரு gdextension அமைப்பு) போதுமானதாக இல்லாத சந்தர்ப்பங்களில்:
uk: Ми рекомендуємо :ref:`C++ modules <doc_custom_modules_in_cpp>` у випадках, коли godot-cpp (або іншої системи GDExtension) недостатньо:
zh_cn: 如果 godot-cpp（或其他 GDExtension 系统）无法满足需求，我们推荐使用 :ref:`C++ 模块 <doc_custom_modules_in_cpp>`\ ：
zh_hant: 若你遇到 godot-cpp（或其他 GDExtension 系統）無法滿足需求的情況，建議改用 :ref:`C++ 模組 <doc_custom_modules_in_cpp>`：

source: C++ modules provide deeper integration into the engine. GDExtension's access is not as deep as static modules.
ru: Модули C++ обеспечивают более глубокую интеграцию с движком. GDExtension не обладает такой же глубиной доступа, как статические модули.
ta: சி ++ தொகுதிகள் இயந்திரத்தில் ஆழமான ஒருங்கிணைப்பை வழங்குகின்றன. Gdextension இன் அணுகல் நிலையான தொகுதிகள் போல ஆழமாக இல்லை.
uk: Модулі C++ забезпечують більш глибоку інтеграцію в механізм. Доступ GDExtension не такий глибокий, як статичні модулі.
zh_cn: C++ 模块提供了与引擎更深层次的集成。GDExtension 的访问能力不如静态模块那般深入。
zh_hant: C++ 模組可以與引擎有更深度的整合。GDExtension 的存取層級不如靜態模組。

source: You can use C++ modules to provide additional features in a project without carrying native library files around. This extends to exported projects.
ru: Вы можете использовать модули C++ для реализации дополнительных функций в проекте без необходимости переносить с собой файлы собственных библиотек. Это также распространяется на экспортированные проекты.
ta: சொந்த நூலகக் கோப்புகளைச் சுமக்காமல் ஒரு திட்டத்தில் கூடுதல் அம்சங்களை வழங்க சி ++ தொகுதிகள் பயன்படுத்தலாம். இது ஏற்றுமதி செய்யப்பட்ட திட்டங்களுக்கு நீண்டுள்ளது.
uk: Ви можете використовувати модулі C++, щоб надати додаткові функції в проекті, не маючи з собою файлів рідної бібліотеки. Це поширюється на експортовані проекти.
zh_cn: 使用 C++ 模块为项目提供额外功能，就可以免去携带原生库文件的麻烦。同样也适用于导出的项目。
zh_hant: 你可以透過 C++ 模組為專案加入額外功能，不必攜帶原生函式庫檔案。這同樣適用於匯出的專案。

source: If you notice that specific systems are not accessible via godot-cpp but are via custom modules, feel free to open an issue on the `godot-cpp repository <https://github.com/godotengine/godot-cpp>`__ to discuss implementation options for exposing the missing functionality.
ru: Если вы заметили, что определенные системы недоступны через godot-cpp, но доступны через пользовательские модули, не стесняйтесь открыть вопрос в `репозитории godot-cpp <https://github.com/godotengine/godot-cpp>`__, чтобы обсудить варианты реализации для предоставления отсутствующей функциональности.
ta: குறிப்பிட்ட அமைப்புகள் கோடோட்-சிபிபி வழியாக அணுக முடியாது என்பதை நீங்கள் கவனித்தால், ஆனால் தனிப்பயன் தொகுதிகள் வழியாக, `கோடோட்-சிபிபி களஞ்சியத்தில் <https://github.com/godotengine/godot-cpp>` __ காணாமல் போன செயல்பாட்டை அம்பலப்படுத்துவதற்கான செயல்படுத்தல் விருப்பங்களைப் பற்றி விவாதிக்க தயங்க.
uk: Якщо ви помітили, що певні системи доступні не через godot-cpp, а через користувацькі модулі, не соромтеся відкривати задачу в `repository godot-cpp <https://github.com/godotengine/godot-cpp>`__, щоб обговорити варіанти реалізації для розкриття відсутньої функціональності.
zh_cn: 如果你发现某些特定功能在 godot-cpp 中不可用，在自定义模块中却可用，欢迎在 `godot-cpp 仓库 <https://github.com/godotengine/godot-cpp>`__\ 上提交新问题，探讨实现该等缺失功能的技术途径。
zh_hant: 如果你發現某些系統可透過自訂模組存取，但無法透過 godot-cpp 存取，歡迎在 `godot-cpp 儲存庫 <https://github.com/godotengine/godot-cpp>`__ 提出 issue，討論如何實作並公開缺少的功能。

source: Version compatibility
ru: Совместимость версий
ta: பதிப்பு பொருந்தக்கூடிய தன்மை
uk: Сумісність версій
zh_cn: 版本兼容性
zh_hant: 版本相容性

source: GDExtensions targeting an earlier version of Godot should work in later minor versions, but not vice-versa. For example, a GDExtension targeting Godot 4.2 should work just fine in Godot 4.3, but one targeting Godot 4.3 won't work in Godot 4.2.
ru: Расширения GDExtensions, предназначенные для более ранних версий Godot, должны работать в более поздних младших версиях, но не наоборот. Например, расширение GDExtension, предназначенное для Godot 4.2, должно работать без проблем в Godot 4.3, но расширение, предназначенное для Godot 4.3, не будет работать в Godot 4.2.
ta: கோடோட்டின் முந்தைய பதிப்பைக் குறிவைக்கும் gdextensions பிற்கால சிறிய பதிப்புகளில் வேலை செய்ய வேண்டும், ஆனால் அதற்கு நேர்மாறாக அல்ல. எடுத்துக்காட்டாக, கோடோட் 4.2 ஐ குறிவைக்கும் ஒரு gdextension கோடோட் 4.3 இல் நன்றாக வேலை செய்ய வேண்டும், ஆனால் கோடோட் 4.3 ஐ குறிவைக்கும் ஒருவர் கோடோட் 4.2 இல் செயல்படாது.
uk: Розширення GDE, що орієнтовані на попередню версію Godot, повинні працювати в пізніших проміжних версіях, але не навпаки. Наприклад, розширення GDE, орієнтоване на Godot 4.2, має чудово працювати в Godot 4.3, але розширення, орієнтоване на Godot 4.3, не працюватиме в Godot 4.2.
zh_cn: 我们的长期目标是，确保旧版 GDExtension 能在后续版本中持续兼容，反之则不可行。例如，一个面向 Godot 4.2 的 GDExtension 应当在 Godot 4.3 中正常运作，但面向 Godot 4.3 的则不能在 Godot 4.2 中运作。
zh_hant: 以較早的 Godot 版本為目標所建置的 GDExtension 通常可在後續的小版本中運作，反之則不行。例如，目標為 Godot 4.2 的 GDExtension 在 Godot 4.3 應可正常運作，但目標為 Godot 4.3 的 GDExtension 無法在 Godot 4.2 運作。

source: For this reason, when creating GDExtensions, you may want to target the lowest version of Godot that has the features you need, *not* the most recent version of Godot. This can save you from needing to create multiple builds for different versions of Godot.
ru: По этой причине при создании GDExtensions вы можете ориентироваться на самую раннюю версию Godot, содержащую необходимые вам функции, а *не* на самую последнюю. Это избавит вас от необходимости создавать несколько сборок для разных версий Godot.
ta: இந்த காரணத்திற்காக, gdextensions ஐ உருவாக்கும் போது, உங்களுக்கு தேவையான அம்சங்களைக் கொண்ட கோடோட்டின் மிகக் குறைந்த பதிப்பை நீங்கள் குறிவைக்க விரும்பலாம், * கோடோட்டின் மிக அண்மைக் கால பதிப்பு * அல்ல. கோடோட்டின் வெவ்வேறு பதிப்புகளுக்கு பல கட்டடங்களை உருவாக்க வேண்டிய அவசியத்திலிருந்து இது உங்களை காப்பாற்றும்.
uk: З цієї причини, створюючи GDExtensions, ви можете націлитися на найстаршу версію Godot, яка має потрібні вам функції, *а не* на останню версію Godot. Це може позбавити вас від необхідності створювати кілька збірок для різних версій Godot.
zh_cn: 因此，在创建 GDExtension 时，你应该以具备你所需功能的最低版本 Godot 为目标，\ *而非*\ 最新版本的 Godot。这可使你免于为不同版本的 Godot 创建多个构建。
zh_hant: 因此，在開發 GDExtension 時，建議以支援你所需功能的最低 Godot 版本為目標，而非最新版本。如此可避免為不同 Godot 版本重複建置多份函式庫。

source: There is one exception to this: extensions targeting Godot 4.0 will **not** work with Godot 4.1 and later (see :ref:`updating_your_gdextension_for_godot_4_1`).
ru: Из этого правила есть одно исключение: расширения, предназначенные для Godot 4.0, **не** будут работать с Godot 4.1 и более поздними версиями (см. :ref:`updating_your_gdextension_for_godot_4_1`).
ta: இதற்கு ஒரு விதிவிலக்கு உள்ளது: கோடோட் 4.0 ஐ குறிவைக்கும் நீட்டிப்புகள் ** அல்ல ** கோடோட் 4.1 மற்றும் அதற்குப் பிறகு வேலை செய்யாது (பார்க்க: குறிப்பு: `புதுப்பித்தல்_ உங்கள்_சி டெக்ச்டென்சன்_ஃபோர்_கோடோட்_4_1`).
uk: Є один виняток: розширення, орієнтовані на Godot 4.0, **не** працюватимуть з Godot 4.1 та пізнішими версіями (див. :ref:`updating_your_gdextension_for_godot_4_1`).
zh_cn: 有一个例外：针对 Godot 4.0 的扩展将\ **无法**\ 在 Godot 4.1 及后续版本中运行（参见 :ref:`为 Godot 4.1 更新您的 GDExtension <updating_your_gdextension_for_godot_4_1>`）。
zh_hant: 此規則有一個例外: 以 Godot 4.0 為目標的擴充在 Godot 4.1 及後續版本中將 **無法** 運作 (請見 :ref:`updating_your_gdextension_for_godot_4_1`)。

source: GDExtensions are also only compatible with engine builds that use the same level of floating-point precision the extension was compiled for. This means that if you use an engine build with double-precision floats, the extension must also be compiled for double-precision floats and use an ``extension_api.json`` file generated by your custom engine build. See :ref:`doc_large_world_coordinates` for details.
ru: Расширения GDExtensions также совместимы только со сборками движка, использующими тот же уровень точности чисел с плавающей запятой, для которого было скомпилировано расширение. Это означает, что если вы используете сборку движка с числами с плавающей запятой двойной точности, расширение также должно быть скомпилировано для чисел с плавающей запятой двойной точности и использовать файл ``extension_api.json``, сгенерированный вашей сборкой движка. Подробности см. в :ref:`doc_large_world_coordinates`.
ta: Gdextensions எஞ்சின் கட்டமைப்போடு மட்டுமே ஒத்துப்போகின்றன, அவை அதே அளவிலான மிதக்கும்-புள்ளி துல்லியத்தைப் பயன்படுத்துகின்றன. இதன் பொருள் என்னவென்றால், நீங்கள் இரட்டை துல்லியமான மிதவைகளுடன் ஒரு எஞ்சின் கட்டமைப்பைப் பயன்படுத்தினால், நீட்டிப்பு இரட்டை துல்லியமான மிதவைகளுக்காக தொகுக்கப்பட வேண்டும் மற்றும் உங்கள் தனிப்பயன் எஞ்சின் உருவாக்கத்தால் உருவாக்கப்பட்ட `` Extand_API.JSON`` கோப்பைப் பயன்படுத்த வேண்டும். காண்க: குறிப்பு: விவரங்களுக்கு `doc_large_world_coordinates`.
uk: GDExtensions також сумісні лише зі збірками механізмів, які використовують той самий рівень точності з плаваючою комою, для якого було скомпільовано розширення. Це означає, що якщо ви використовуєте збірку двигуна з числами з плаваючою точкою подвійної точності, розширення також має бути скомпільовано для чисел з плаваючою точкою подвійної точності та використовувати файл ``extension_api.json``, згенерований вашою спеціальною збіркою двигуна. Перегляньте :ref:`doc_large_world_coordinates` для деталей.
zh_cn: GDExtension 的兼容性还要求引擎构建版本与扩展编译时使用的浮点数精度级别必须一致，即如果你使用支持双精度浮点数的引擎构建版本，则插件也必须针对双精度浮点数进行编译。并且必须使用你的自定义引擎构建生成的 ``extension_api.json`` 文件。有关详细信息，请参见： :ref:`doc_large_world_coordinates`。
zh_hant: GDExtension 也僅支援與其編譯時浮點精度相同的引擎版本。也就是說，如果你使用的是雙精度浮點（double precision）引擎，GDExtension 也必須用雙精度建置，並且必須使用你自訂引擎版本所產生的 ``extension_api.json``。詳情請參考 :ref:`doc_large_world_coordinates`。

source: Generally speaking, if you build a custom version of Godot, you should generate an ``extension_api.json`` from it for your GDExtensions, because it may have some differences from official Godot builds.
ru: В общем случае, если вы создаете пользовательскую версию Godot, вам следует сгенерировать ``extension_api.json`` для ваших GDExtensions, поскольку она может иметь некоторые отличия от официальных сборок Godot.
uk: Загалом кажучи, якщо ви створюєте спеціальну версію Godot, вам слід згенерувати з неї ``extension_api.json`` для ваших GDExtensions, оскільки він може мати деякі відмінності від офіційних збірок Godot.
zh_cn: 通常而言，若你构建了一个自定义版本的 Godot，你应该为其生成一个 ``extension_api.json`` 文件用于 GDExtensions，因为它可能与官方 Godot 构建版本存在一些差异。
zh_hant: 一般來說，如果你有自訂 Godot 引擎版本，建議使用該版本產生一份 ``extension_api.json`` 來給你的 GDExtension 使用，因為這可能與官方版本有細微差異。
