Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/community/tutorials.po
Languages: cs, es, ga, ja, ko, pl, ta, tr, uk

source: Tutorials and resources
cs: Návody a zdroje
es: Tutoriales y recursos
ga: Ranganna teagaisc agus acmhain
ja: チュートリアルとリソース
ko: 튜토리얼과 리소스
pl: Samouczki oraz materiały
ta: பயிற்சிகள் மற்றும் வளங்கள்
tr: Öğreticiler ve kaynaklar
uk: Підручники та ресурси

source: This is a list of third-party tutorials and resources created by the Godot community. For resources, remember that there is the official `Godot Asset Library <https://godotengine.org/asset-library/asset>`_ full of official and community resources too!
cs: Toto je seznam návodů a zdrojů třetích stran vytvořených Godot komunitou. Pokud jde o zdroje, nezapomeňte, že existuje oficiální `Knihovna zdrojů (AssetLib) <https://godotengine.org/asset-library/asset>`_ plná oficiálních zdrojů, stejně jako těch komunitních!
ja: これは、Godot コミュニティによって作成されたサードパーティのチュートリアルとリソースのリストです。公式の `Godot Asset Library <https://godotengine.org/asset-library/asset>`_ もあり、こちらも公式リソースとコミュニティリソースが満載であることを忘れないでください！
ko: 다음은 Godot 커뮤니티에서 만든 서드 파티 튜토리얼과 리소스의 목록입니다. 리소스에 대해서는 공식 `Godot 애셋 라이브러리 <https://godotengine.org/asset-library/asset>`_\ 에도 공식 및 커뮤니티 리소스가 가득하다는 점을 기억하세요!
ta: இது கோடோட் சமூகத்தால் உருவாக்கப்பட்ட மூன்றாம் தரப்பு பயிற்சிகள் மற்றும் வளங்களின் பட்டியல். வளங்களைப் பொறுத்தவரை, அதிகாரப்பூர்வ `கோடோட் சொத்து நூலகம் <https://godotengine.org/asset-library/asset>` _ உத்தியோகபூர்வ மற்றும் சமூக வளங்களும் நிறைந்தவை என்பதை நினைவில் கொள்ளுங்கள்!
uk: Це список сторонніх посібників і ресурсів, створених спільнотою Godot. Що стосується ресурсів, пам’ятайте, що існує офіційна `Бібліотека ресурсів Godot <https://godotengine.org/asset-library/asset>`_, яка також містить офіційні ресурси та ресурси спільноти!

source: Think there is something missing here? Feel free to submit a `Pull Request <https://github.com/godotengine/godot-docs/blob/master/community/tutorials.rst>`_ as always.
cs: Připadá vám, že zde něco chybí? Neváhejte a pošlete nám `Pull Request <https://github.com/godotengine/godot-docs/blob/master/community/tutorials.rst>`_ jako kdykoli jindy.
es: ¿Crees que falta algo aquí? No dude en enviar una `Pull Request <https://github.com/godotengine/godot-docs/blob/master/community/tutorials.rst>`_ como siempre.
ga: An gceapann tú go bhfuil rud éigin ar iarraidh anseo? Ná bíodh drogall ort `Iarratas Tarraingthe <https://github.com/godotenginine/godot-docs/blob/master/community/tutorials.rst>`_ a chur isteach mar i gcónaí.
ja: ここに何か欠けていると思いますか？いつものように、\ `Pull Request <https://github.com/godotengine/godot-docs/blob/master/community/tutorials.rst>`_ を送信してください。
ko: 뭔가 빠진 게 있다고 생각되십니까? 언제나 `풀 리퀘스트 <https://github.com/godotengine/godot-docs/blob/master/community/tutorials.rst>`_\ 를 자유롭게 제출하세요.
ta: இங்கே ஏதோ காணவில்லை என்று நினைக்கிறீர்களா? `இழுப்பு கோரிக்கையை சமர்ப்பிக்க தயங்க <https://github.com/godotengine/godotengs/blob/master/community/tutorials.rst>` _ எப்போதும் போல.
tr: Burada eksik bir şey olduğunu mu düşünüyorsunuz? Her zaman olduğu gibi, bir "Çekme İsteği (Pull Request )<https://github.com/godotengine/godot-docs/blob/master/community/tutorials.rst>" _ göndermekten çekinmeyin.
uk: Думаєте, тут чогось не вистачає? Не соромтеся надсилати `запит на вилучення <https://github.com/godotengine/godot-docs/blob/master/community/tutorials.rst>`_, як завжди.

source: Where to start
cs: Kde začít
es: Donde empezar
ga: Cá háit le tosú
ja: 開始する場所
ko: 어디서부터 시작할까요
pl: Gdzie zacząć naukę
ta: எங்கு தொடங்குவது
tr: Nereden başlamalı
uk: З чого почати

source: The Godot video tutorials by `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_ are well-regarded in the community and often recommended as a gentle introduction to beginners.
cs: Video tutoriály pro Godot od `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_ jsou v komunitě ceněny a často doporučovány jako jednoduchý úvod pro začátečníky.
ga: Tá meas mór ag an bpobal ar na ranganna teagaisc físe Godot le `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_ agus moltar go minic iad mar réamhrá réidh do thosaitheoirí.
ja: Godotの動画チュートリアル `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_ は 、コミュニティで高く評価されており、初心者にはやさしい入門書としてよく勧められています。
ko: `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_\ 의 Godot 동영상 튜토리얼은 커뮤니티에서 좋은 평가를 받고 있으며, 초보자를 위한 쉬운 소개 자료로 자주 추천됩니다.
ta: `Gdquest <https://www.youtube.com/channel/ucxbow7x0jzqfdmdcfktmsq/playlists>` _ ஆகியவற்றின் கோடோட் வீடியோ டுடோரியல்கள் சமூகத்தில் நன்கு கருதப்படுகின்றன, மேலும் ஆரம்பத்தில் ஒரு சிறந்த அறிமுகமாக பரிந்துரைக்கப்படுகின்றன.
tr: `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_ 'in Godot video eğitimleri, toplulukta iyi karşılanır ve genellikle yeni başlayanlar için nazik bir giriş olarak önerilir.
uk: Відеоуроки Godot від `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_ добре оцінюються в спільноті та часто рекомендуються як легкий вступ для початківців.

source: GDQuest's *Learn GDScript From Zero* is a free and open source interactive tutorial for absolute beginners to learn to program with Godot's GDScript language. It is available as a `desktop application <https://gdquest.itch.io/learn-godot-gdscript>`_ or `in the browser <https://gdquest.github.io/learn-gdscript>`_.
cs: *Learn GDScript From Zero* od GDQuestu je bezplatný interaktivní návod s otevřeným zdrojovým kódem pro úplné začátečníky, který se učí programovat s jazykem Godotu, GDScriptem. Je k dispozici jako `desktopová aplikace <https://gdquest.itch.io/learn-godot-gdscript>`_ nebo `v prohlížeči <https://gdquest.github.io/learn-gdscript>`_.
es: GDQuest's *Aprende GDScript desde cero* es un tutorial interactivo libre y de código abierto destinado a principiantes para aprender a programar con el lenguaje GDScript de Godot. Se encuentra disponible como aplicación de escritorio en <https://gdquest.itch.io/learn-godot-gdscript>`_ o `in the browser <https://gdquest.github.io/learn-gdscript>`_.
ga: Is teagaisc idirghníomhach saor in aisce agus foinse oscailte é *Learn GDScript From Zero* de chuid GDQuest do ghlantosaitheoirí chun foghlaim conas ríomhchlárú a dhéanamh le teanga GDScript Godot. Tá sé ar fáil mar `fheidhmchlár deisce <https://gdquest.itch.io/learn-godot-gdscript>`_ nó `sa bhrabhsálaí <https://gdquest.github.io/learn-gdscript>`_.
ja: GDQuestの *Learn GDScript From Zero* は完全な初心者がGodotのGDScript言語によるプログラムを学ぶための無料かつオープンソースのインタラクティブチュートリアルです。 `デスクトップアプリケーション <https://gdquest.itch.io/learn-godot-gdscript>`_ または `ブラウザ上で <https://gdquest.github.io/learn-gdscript>`_ 利用できます。
pl: GDQuest's* Naucz się języka GDScript od zera* jest darmowym oraz otwartym źródłem interaktywnychsamouczków dla początkujących, które pozwala poznać podstawy języka GDScript. GDQuest dostępne jest jako aplikacja <https://gdquest.itch.io/learn-godot-gdscript> oraz w przeglądarce internetowej pod adresem <https://gdquest.github.io/learn-gdscript>`_.
ta: GDQuest இன் * சீரோவிலிருந்து GDSCRIPT ஐக் கற்றுக்கொள்ளுங்கள் * என்பது முழுமையான தொடக்கக்காரர்களுக்கான இலவச மற்றும் திறந்த மூல ஊடாடும் டுடோரியல் ஆகும், இது கோடோட்டின் GDSCRIPT மொழியுடன் நிரல் செய்ய கற்றுக்கொள்ள வேண்டும். இது `டெச்க்டாப் பயன்பாடாக <https://gdquest.ich.ior/learn-godot-gdscript>` _ அல்லது `உலாவியில் <https://gdquest.github.io/learn-gdscript>` _.
tr: GDQuest'in *Learn GDScript From Zero*, Godot'un GDScript dili ile programlamayı öğrenmek için tamamen yeni başlayanlar için ücretsiz ve açık kaynaklı etkileşimli bir eğitimdir. `masaüstü uygulaması <https://gdquest.itch.io/learn-godot-gdscript>`_ ya da `tarayıcı sayfası <https://gdquest.github.io/learn-gdscript>`_ olarak mevcuttur. (Türkçe dil seçeneği de mevcut).
uk: *Вивчіть GDScript з нуля* від GDQuest — це безкоштовний інтерактивний посібник із відкритим вихідним кодом для абсолютних початківців, щоб навчитися програмувати мовою GDScript Godot. Він доступний як `настільна програма <https://gdquest.itch.io/learn-godot-gdscript>`_ або `у браузері <https://gdquest.github.io/learn-gdscript>`_.

source: Some tutorials mentioned below cover more advanced subjects, e.g. on 3D or shaders.
cs: Některé níže uvedené návody pokrývají pokročilejší témata, např. 3D nebo shadery.
ja: 以下で説明するチュートリアルでは、3D やシェーダーなど、より高度なテーマを取り上げています。
ko: 아래에 언급된 일부 튜토리얼은 3D나 셰이더와 같은 더 고급 주제를 다룹니다.
pl: Niektóre samouczki wspomniane poniżej obejmują bardziej zaawansowane tematy, np. 3D bądź Cienie
ta: கீழே குறிப்பிடப்பட்டுள்ள சில பயிற்சிகள் மிகவும் மேம்பட்ட பாடங்களை உள்ளடக்கியது, எ.கா. 3 டி அல்லது சேடர்களில்.
uk: Деякі навчальні посібники, згадані нижче, охоплюють більш складні теми, напр. на 3D або шейдерах.

source: Video tutorials
cs: Video tutoriály
es: Vídeo tutoriales
ga: Ranganna teagaisc físe
ja: ビデオチュートリアル
ko: 비디오 튜토리얼
pl: Poradniki wideo
ta: வீடியோ பயிற்சிகள்
tr: Video öğreticiler
uk: Відеоуроки

source: For video tutorials we recommend looking on `YouTube <https://www.youtube.com/>`_. There are many great channels covering a wide array of subjects.
cs: Pro video tutoriály doporučujeme podívat se na `YouTube <https://www.youtube.com/>`_. Najdete tam mnoho skvělých kanálů pokrývajících širokou škálu témat.
ja: ビデオチュートリアルについては `YouTube <https://www.youtube.com/>`_ を参照することをお勧めします。幅広いテーマを扱った優れたチャンネルが多数あります。
ko: 비디오 튜토리얼은 `YouTube <https://www.youtube.com/>`__\ 에서 시청하시는 것을 추천합니다. 다양한 주제를 다루는 훌륭한 채널들이 많이 있습니다.
pl: Listę zalecanych przed nas poradników znajdziesz na <YouTube <https://www.youtube.com/>. Znajdziesz tutaj wiele wspaniałych kanałów obejmujących szerokie spektrum tematów oscylujących dookoła silnika Godot
ta: வீடியோ டுடோரியல்களுக்கு `YouTube <https://www.youtube.com/>` _ ஐப் பார்க்க பரிந்துரைக்கிறோம். பரந்த அளவிலான பாடங்களை உள்ளடக்கிய பல சிறந்த சேனல்கள் உள்ளன.
uk: Відеоуроки рекомендуємо переглянути на `YouTube <https://www.youtube.com/>`_. Є багато чудових каналів, які охоплюють широкий спектр тем.

source: Text tutorials
cs: Textové návody
es: Tutoriales en texto
ga: Ranganna teagaisc téacs
ja: テキストチュートリアル
ko: 텍스트 튜토리얼
pl: Samouczki tekstowe
ta: உரை பயிற்சிகள்
tr: Metin tabanlı öğreticiler
uk: Текстові підручники

source: `FinePointCGI website by Mitch <https://finepointcgi.io/>`__
cs: `Web FinePointCGI od Mitche <https://finepointcgi.io/>`__
ga: `Láithreán Gréasáin FinePointCGI le Mitch <https://finepointcgi.io/>`__
ja: `FinePointCGI MitchによるWebサイト <https://finepointcgi.io/>`__
ko: `Mitch 가 만든 FinePointCGI 웹사이트 <http://finepointcgi.io/>`__
pl: FinePointCGI strona stworzona przez Andrew Wilkes <https://finepointcgi.io/>
ta: `Finepointcgi வலைத்தளம் மிட்ச் <https://finepointcgi.io/> ____ __ __
tr: `Mitch'in FinePointCGI websitesi <https://finepointcgi.io/>`__
uk: `Веб-сайт FinePointCGI від Мітча <https://finepointcgi.io/>`__

source: `Catlike Coding by Jasper Flick <https://catlikecoding.com/godot/>`__
cs: `Catlike Coding od Jaspera Flicka <https://catlikecoding.com/godot/>`__
ko: `Jasper Flick가 만든 Catlike Coding <https://catlikecoding.com/godot/>`__
pl: Catlike Coding stworzone przez Jasper Flick <https://catlikecoding.com/godot/>
ta: `சாச்பர் ஃபிளிக் எழுதிய` கேட்லிக் குறியீட்டு முறை <https://catlikecoding.com/godot/> `__
uk: `Котяче кодування Джаспера Фліка <https://catlikecoding.com/godot/>`__

source: `GDScript website by Andrew Wilkes <https://gdscript.com>`__
cs: `Web GDScript od Andrewa Wilkese <https://gdscript.com>`__
es: `Sitio web acerca de GDScript por Andrew Wilkes <https://gdscript.com>`__
ga: `Láithreán Gréasáin GDScript le Andrew Wilkes <https://gdscript.com>`__
ko: `Andrew Wilkes가 만든 GDScript 웹사이트 <https://gdscript.com>`__
pl: GDScript strona stworzona przez Andrew Wilkes <https://gdscript.com>`__
ta: ஆண்ட்ரூ வில்கேச் எழுதிய `சி.டி.எச்.ச்கிரிப்ட் வலைத்தளம் <https://gdscript.com> ____ __ __
tr: `GDScript websitesi (Andrew Wilkes tarafından) <https://gdscript.com>`__
uk: `Веб-сайт GDScript Ендрю Вілкса <https://gdscript.com>`__

source: `Godot Recipes by KidsCanCode <https://kidscancode.org/godot_recipes/4.x/>`__
cs: `Godot Recipes od KidsCanCode <https://kidscancode.org/godot_recipes/4.x/>`__
ga: `Oidis Godot le KidsCanCode <https://kidscancode.org/godot_recipes/4.x/>`__
ko: `KidsCanCode가 만든 Godot 레시피 <http://godotrecipes.com/godot_recipes/4.x/>`__
pl: Godot Formuły stworzone przez KidsCanCode <http://godotrecipes.com/>`__
ta: `கிட்ச்கான்கோட் <https://kidscancode.org/godot_recipes/4.x/> __ __ எழுதிய கோடோட் ரெசிபிகள் __ __
tr: `KidsCanCode tarafından: Godot Recipes <https://kidscancode.org/godot_recipes/4.x/>`__
uk: `Рецепти Godot від KidsCanCode <https://kidscancode.org/godot_recipes/4.x/>`__

source: `Godot Tutorials by SomethingLikeGames <https://www.somethinglikegames.de/en/tags/godot-engine/>`__
cs: `Godot Tutorials od SomethingLikeGames <https://www.somethinglikegames.de/en/tags/godot-engine/>`__
ga: `Godot Ranganna Teagaisc le SomethingLikeGames <https://www.somethinglikegames.de/ga/tags/godot-engine/>`__
ko: `SomethingLikeGames가 만든 Godot 튜토리얼 <https://www.somethinglikegames.de/en/tags/godot-engine/>`__
pl: Godot Tutorials stworzone przez SomethingLikeGames <https://www.somethinglikegames.de/en/tags/godot-engine/>`__
ta: `Boodlikegames இன்` கோடோட் டுடோரியல்கள் <https://www.somethinglikegames.de/en/tags/godot-ngine/> __ __ __
tr: `SomethingLikeGames tarafından: Godot Tutorials <https://www.somethinglikegames.de/en/tags/godot-engine/>`__
uk: `Навчальні посібники Godot від SomethingLikeGames <https://www.somethinglikegames.de/en/tags/godot-engine/>`__

source: `GameDev Academy by Zenva <https://gamedevacademy.org/category/godot-tutorials/godot-4/>`__
ko: `Zenva의 GameDev 아카데미 <https://gamedevacademy.org/category/godot-tutorials/godot-4/>`__
uk: `Академія розробки ігор від Zenva <https://gamedevacademy.org/category/godot-tutorials/godot-4/>`__

source: `Game Dev Artisan website <https://gamedevartisan.com/>`__
cs: `Web Game Dev Artisan <https://gamedevartisan.com/>`__
ga: `suíomh Gréasáin Game Dev Artisan <https://gamedevartisan.com/>`__
ko: `Game Dev Artisan 웹사이트 <https://gamedevartisan.com/>`__
pl: Strona Game Dev Artisan <https://gamedevartisan.com/>`__
ta: `விளையாட்டு தேவ் கைவினைஞர் வலைத்தளம் <https://gimeadevartisan.com/>` __
tr: `Game Dev Artisan websitesi <https://gamedevartisan.com/>`__
uk: `Веб-сайт Game Dev Artisan <https://gamedevartisan.com/>`__

source: `Night Quest Games Blog <https://www.nightquestgames.com/blog-articles/>`__
cs: `Blog Night Quest Games <https://www.nightquestgames.com/blog-articles/>`__
ga: `Blag Cluichí Rompu na Oíche <https://www.nightquestgames.com/blog-articles/>`__
ko: `Night Quest Games 블로그 <https://www.nightquestgames.com/blog-articles/>`__
ta: `நைட் குவெச்ட் கேம்ச் வலைப்பதிவு <https://www.ainghtquestgames.com/blog-articles/>` __
tr: `Night Quest Games Blog'u <https://www.nightquestgames.com/blog-articles/>`__
uk: `Блог ігор Night Quest <https://www.nightquestgames.com/blog-articles/>`__

source: Resources
cs: Zdroje
es: Recursos
ga: Acmhainní
ja: リソース
ko: 리소스
pl: Zasoby
ta: வளங்கள்
tr: Kaynaklar
uk: Ресурси

source: `awesome-godot: A curated list of free/libre plugins, scripts and add-ons <https://github.com/godotengine/awesome-godot>`_
cs: `awesome-godot: Spravovaný seznam bezplatných/libre zásuvných modulů, skriptů a doplňků <https://github.com/godotengine/awesome-godot>`_
es: `awesome-godot: Una lista curada de plugins, scripts y complementos gratuitos/libre <https://github.com/godotengine/awesome-godot>`_
ga: `awesome-godot: Liosta coimeádta breiseán, scripteanna agus breiseáin saor in aisce/libre <https://github.com/godotenginine/awesome-godot>`_
ja: `awesome-godot: 無料の(free/libre) プラグイン、スクリプトおよび アドオンの厳選リスト <https://github.com/godotengine/awesome-godot>`_
ko: `awesome-godot: 자유 플러그인, 스크립트 및 애드온의 선별된 목록 <https://github.com/godotengine/awesome-godot>`_
pl: awesome-godot: Zbiór darmowych zasobów udostępniany przez Calinou <https://github.com/Calinou/awesome-godot>`_
ta: `அற்புதமான-காடோட்: இலவச/லிப்ரே செருகுநிரல்கள், ச்கிரிப்ட்கள் மற்றும் துணை நிரல்களின் பட்டியல் <https://github.com/godotengine/awesome-godot>` _ _
tr: `awesome-godot: Ücretsiz/libre eklentiler, betikler ve diğer eklentiler listesi <https://github.com/godotengine/awesome-godot>`_
uk: `awesome-godot: підібраний список безкоштовних/лібре плагінів, сценаріїв і доповнень <https://github.com/godotengine/awesome-godot>`_

source: `Godot Asset Library <https://godotengine.org/asset-library/asset>`_
cs: `Godot Knihovna zdrojů (AssetLib) <https://godotengine.org/asset-library/asset>`_
ga: `Leabharlann Sócmhainní Godot <https://godotengine.org/asset-library/asset>`_
ko: `Godot 애셋 라이브러리 <https://godotengine.org/asset-library/asset>`_
pl: Biblioteka Zasobów Godot(godotdevelopers.org) <https://godotdevelopers.org/forum>`_
ta: `கோடோட் சொத்து நூலகம் <https://godotengine.org/asset-library/asset>` _
tr: `Godot Varlık Kütüphanesi <https://godotengine.org/asset-library/asset>`_
uk: `Бібліотека активів Godot <https://godotengine.org/asset-library/asset>`_

source: `Godot Shaders: A community-driven shader library <https://godotshaders.com/>`_
cs: `Godot Shaders: Knihovna shaderů řízená komunitou <https://godotshaders.com/>`_
es: `Godot Shaders: Una librería de shaders manejada por la comunidad <https://godotshaders.com/>`_
ga: `Godot Shaders: Leabharlann scáthaithe faoi thiomáint an phobail <https://godotshaders.com/>`_
ja: `Godot Shaders: コミュニティが作成したシェーダーライブラリ <https://godotshaders.com/>`_
ko: `Godot Shaders: 커뮤니티가 주도하는 셰이더 라이브러리 <https://godotshaders.com/>`_
pl: Godot Shaders: Tworzona przez społeczność bilbioteka Shaderów
ta: `கோடோட் சேடர்ச்: ஒரு சமூகத்தால் இயக்கப்படும் சேடர் நூலகம் <https://godotshaders.com/>` _
tr: `Godot Shaders: Topluluk odaklı bir gölgelendirici kitaplığı <https://godotshaders.com/>`_
uk: `Godot Shaders: бібліотека шейдерів, керована спільнотою <https://godotshaders.com/>`_

source: This is a list of third-party tutorials and resources created by the Godot community. For resources, remember that there is the official `Godot Asset Library <https://godotengine.org/asset-library/asset>`_ full of official and community resources too! Also, have a look at this `huge list over at Reddit <https://www.reddit.com/r/godot/comments/an0iq5/godot_tutorials_list_of_video_and_written/>`_.
es: Esta es una lista de tutoriales y recursos de terceros creados por la comunidad de Godot. Para recursos, recuerda que existe la `Godot Asset Library <https://godotengine.org/asset-library/asset>` _ ¡llena de recursos oficiales y comunitarios también! Además echa un vistazo a esta `gran lista en Reddit <https://www.reddit.com/r/godot/comments/an0iq5/godot_tutorials_list_of_video_and_written/>`_.

source: Some tutorials mentioned below provide more advanced tutorials, e.g. on 3D or shaders.
es: Algunos de los mencionados a continuación proporcionan tutoriales más avanzados, pj.: en 3D o shaders.

source: `BornCG <https://www.youtube.com/playlist?list=PLda3VoSoc_TTp8Ng3C57spnNkOw3Hm_35>`_ (2D and 3D, GDScript)
es: `BornCG <https://www.youtube.com/playlist?list=PLda3VoSoc_TTp8Ng3C57spnNkOw3Hm_35>`_ (2D y 3D, GDScript)

source: `Clear Code <https://www.youtube.com/watch?v=nAh_Kx5Zh5Q>`_ (2D, GDScript, Programming Basics)
es: `Clear Code <https://www.youtube.com/watch?v=nAh_Kx5Zh5Q>`_ (2D, GDScript, Bases de Programación)

source: `FinePointCGI <https://www.youtube.com/channel/UCSojAWUnEUTUcdA9iJ6bryQ>`_ (2D, 3D, GDScript and C#)
es: `FinePointCGI <https://www.youtube.com/channel/UCSojAWUnEUTUcdA9iJ6bryQ>`_ (2D, 3D, GDScript y C#)

source: `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_ (2D and 3D, GDScript and C#)
es: `GDQuest <https://www.youtube.com/channel/UCxboW7x0jZqFdvMdCFKTMsQ/playlists>`_ (2D y 3D, GDScript y C#)

source: `Game Development Center <https://www.youtube.com/c/GameDevelopmentCenter>`_ (2D, networked multiplayer, GDScript)
es: `Game Development Center <https://www.youtube.com/c/GameDevelopmentCenter>`_ (2D, multiplayer en red, GDScript)

source: `KidsCanCode <https://www.youtube.com/channel/UCNaPQ5uLX5iIEHUCLmfAgKg/playlists>`__ (2D and 3D, GDScript)
es: `KidsCanCode <https://www.youtube.com/channel/UCNaPQ5uLX5iIEHUCLmfAgKg/playlists>`__ (2D y 3D, GDScript)

source: Translation status
es: Estado de la traducción
