Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/internationalizing_games.po
Languages: ga, it, ko, ru, ta, uk, zh_hans, zh_tw

source: Internationalizing games
ga: Cluichí idirnáisiúnta
it: Internazionalizzazione dei giochi
ko: 게임 국제화하기
ru: Локализация игр
ta: பன்னாட்டுமயமாக்கல் விளையாட்டுகள்
uk: Інтернаціоналізація ігор
zh_hans: 游戏的国际化
zh_tw: 將遊戲國際化

source: Introduction
ga: Réamhrá
it: Introduzione
ko: 소개
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_hans: 前言
zh_tw: 前言

source: While indie or niche games usually do not need localization, games targeting a more massive market often require localization. Godot offers many tools to make this process more straightforward, so this tutorial is more like a collection of tips and tricks.
ga: Cé nach dteastaíonn logánú de ghnáth ag teastáil ó chluichí indie nó nideoige, is minic a theastaíonn logánú ar chluichí Cuireann Godot go leor uirlisí ar fáil chun an próiseas seo a dhéanamh níos simplí, mar sin tá an rang teagaisc seo níos cosúla le bailiúchán leideanna agus cleasanna.
it: Mentre i giochi indie o di nicchia solitamente non hanno bisogno di localizzazione, i giochi rivolti a un mercato più ampio spesso sì. Godot offre molti strumenti per rendere questo processo più semplice, quindi questo tutorial è più tipo una raccolta di suggerimenti e trucchi.
ru: Хотя инди- или нишевые игры обычно не требуют локализации, игры, ориентированные на более массовый рынок, часто требуют локализации. Godot предлагает множество инструментов для упрощения этого процесса, поэтому это руководство скорее похоже на сборник советов и рекомендаций.
ta: இண்டி அல்லது முக்கிய விளையாட்டுகளுக்கு வழக்கமாக உள்ளூர்மயமாக்கல் தேவையில்லை என்றாலும், மிகவும் பெரிய சந்தையை குறிவைக்கும் விளையாட்டுகளுக்கு பெரும்பாலும் உள்ளூர்மயமாக்கல் தேவைப்படுகிறது. இந்த செயல்முறையை மேலும் நேரடியானதாக மாற்ற கோடோட் பல கருவிகளை வழங்குகிறது, எனவே இந்த பயிற்சி உதவிக்குறிப்புகள் மற்றும் தந்திரங்களின் தொகுப்பு போன்றது.
uk: Хоча інді-ігри або нішеві ігри зазвичай не потребують локалізації, ігри, орієнтовані на більший ринок, часто потребують локалізації. Godot пропонує багато інструментів, щоб зробити цей процес більш простим, тому цей підручник більше схожий на збірку порад і підказок.
zh_hans: 虽然独立游戏和小众游戏通常不需要本地化，但瞄准更大市场的游戏通常需要本地化。Godot 提供了许多工具来使这个过程更加简单，因此本教程更像一个妙招和技巧的合集。
zh_tw: 雖然獨立或小眾遊戲通常不需要本地化，但如果目標是更大規模的市場，則經常需要翻譯和本地化。Godot 提供了許多工具，讓這個流程更加簡單，因此這份教學更像是匯集了一些實用的小技巧和建議。

source: Localization is usually done by specific studios hired for the job. Despite the huge amount of software and file formats available for this, the most common way to do localization to this day is still with spreadsheets. The process of creating the spreadsheets and importing them is already covered in the :ref:`doc_importing_translations` tutorial. If you haven't read the Importing translations page before, we recommend you give it a read before reading this page.
ga: De ghnáth déanann stiúideonna ar leith a fhostaítear don phost logánú. In ainneoin an méid ollmhór bogearraí agus formáidí comhaid atá ar fáil chuige seo, is é an bealach is coitianta chun logánú a dhéanamh go dtí an lá inniu ná scarbhileoga fós. Tá an próiseas chun na scarbhileoga a chruthú agus iad a allmhairiú clúdaithe cheana féin sa rang teagaisc:ref: `doc_importing_translations`. Mura léigh tú an leathanach aistriúcháin Allmhairithe roimhe seo, molaimid duit léamh é sula léann tú an leathanach seo.
it: La localizzazione è solitamente effettuata da studi specifici incaricati per questo lavoro. Nonostante l'enorme quantità di software e formati di file disponibili, il metodo più comune per la localizzazione rimane ancora oggi tramite fogli di calcolo. Il processo di creazione e importazione dei fogli di calcolo è già trattato nel tutorial :ref:`doc_importing_translations`. Se non hai ancora letto questa pagina, consigliamo di farlo prima di continuare a leggere.
ru: Локализацией обычно занимаются специальные студии, нанятые для этой работы, и, несмотря на огромное количество программного обеспечения и форматов файлов, наиболее распространенным способом локализации по сей день остаются электронные таблицы. Процесс создания электронных таблиц и их импорта уже рассмотрен в уроке :ref:`doc_importing_translations`, поэтому этот урок можно рассматривать как продолжение этого.
ta: வேலைக்கு பணியமர்த்தப்பட்ட குறிப்பிட்ட ச்டுடியோக்களால் உள்ளூர்மயமாக்கல் பொதுவாக செய்யப்படுகிறது. இதற்கு பெரிய அளவு மென்பொருள் மற்றும் கோப்பு வடிவங்கள் இருந்தபோதிலும், இன்றுவரை உள்ளூர்மயமாக்கல் செய்வதற்கான பொதுவான வழி இன்னும் விரிதாள்களுடன் உள்ளது. விரிதாள்களை உருவாக்கி அவற்றை இறக்குமதி செய்யும் செயல்முறை ஏற்கனவே: ref: `doc_importing_translations` டுடோரியல். இறக்குமதி செய்யும் மொழிபெயர்ப்பு பக்கத்தை நீங்கள் இதற்கு முன்பு படிக்கவில்லை என்றால், இந்தப் பக்கத்தைப் படிப்பதற்கு முன்பு அதைப் படிக்க பரிந்துரைக்கிறோம்.
uk: Локалізацією зазвичай займаються спеціальні студії, найняті для цієї роботи. Незважаючи на величезну кількість програмного забезпечення та форматів файлів, доступних для цього, найпоширенішим способом локалізації досі залишаються електронні таблиці. Процес створення електронних таблиць та їх імпортування вже описано в посібнику :ref:`doc_importing_translations`. Якщо ви раніше не читали сторінку «Імпортування перекладів», радимо прочитати її перед тим, як читати цю сторінку.
zh_hans: 本地化通常是通过雇佣特定的工作室来完成的，尽管有大量的软件和文件格式可供使用，但迄今为止进行本地化最常见的方式仍然是使用电子表格。创建电子表格并导入电子表格的过程已经在《\ :ref:`doc_importing_translations`\ 》教程中介绍过了。如果你之前尚未阅读导入翻译页面，我们建议你在阅读本页面之前先阅读该页面。
zh_tw: 當地語系化通常是通過雇傭特定的工作室來完成的，儘管有大量的軟體和檔案格式可供使用，但迄今為止進行當地語系化最常見的方式仍然是使用試算表。建立試算表並匯入試算表的過程已經在 :ref:`doc_importing_translations` 教學中介紹過了，所以這個教學更像是對那個教學的後續。

source: We will be using the official demo as an example; you can `download it from the Asset Library <https://godotengine.org/asset-library/asset/2776>`_.
ga: Beimid ag baint úsáide as an taispeántas oifigiúil mar shampla; is féidir leat `é a íoslódáil ón Leabharlann Sócmhainní <https://godotengine.org/asset-library/asset/2776>`_.
it: Utilizzeremo la demo ufficiale come esempio; puoi `scaricarla dalla Libreria dei contenuti <https://godotengine.org/asset-library/asset/2776>`_.
ko: 우리는 예제로써 공식 데모를 사용합니다. `애셋 라이브러리에서 다운로드 <https://godotengine.org/asset-library/asset/2776>`_\ 할 수 있습니다.
ru: В качестве примера мы будем использовать официальную демо-версию; вы можете `скачать ее из библиотеки ресурсов <https://godotengine.org/asset-library/asset/2776>`_.
ta: நாங்கள் அதிகாரப்பூர்வ டெமோவை ஒரு உதாரணமாகப் பயன்படுத்துவோம்; நீங்கள் அதை சொத்து நூலகத்திலிருந்து பதிவிறக்கம் செய்யலாம் <https://godotengine.org/asset-library/asset/2776> `_.
uk: Ми будемо використовувати офіційну демонстрацію як приклад; ви можете `завантажити його з Asset Library <https://godotengine.org/asset-library/asset/2776>`_.
zh_hans: 我们将使用官方演示作为示例，可以\ `从资产库下载 <https://godotengine.org/asset-library/asset/2776>`_\ 。
zh_tw: 我們將以官方範例專案作為示範，你可以從「資源庫」下載：`Asset Library <https://godotengine.org/asset-library/asset/2776>`_。

source: Configuring the imported translation
ga: An t-aistriúchán allmhairithe a chum
it: Configurazione della traduzione importata
ko: 가져온 번역 구성하기
ru: Настройка импортированного перевода
ta: இறக்குமதி செய்யப்பட்ட மொழிபெயர்ப்பை உள்ளமைத்தல்
uk: Налаштування імпортованого перекладу
zh_hans: 配置导入的译文
zh_tw: 配置匯入的譯文

source: Translations can get updated and re-imported when they change, but they still have to be added to the project. This is done in **Project → Project Settings → Localization**:
ga: Is féidir aistriúcháin a nuashonrú agus a athiompórtáil nuair a athraíonn siad, ach caithfear iad a chur leis an tionscadal fós. Déantar é seo in**Tionscadal → Socruithe Tionscadail → Logánach**:
it: Le traduzioni possono essere aggiornate e reimportate quando cambiano, ma devono comunque essere state aggiunte al progetto. Ciò si fa in **Progetto → Impostazioni del progetto → Localizzazione**:
ko: 번역은 변경될 때 업데이트되고 다시 가져올 수 있지만 여전히 프로젝트에 추가해야 합니다. **프로젝트 → 프로젝트 설정 → 현지화**\ 에서 완료합니다:
ru: Переводы могут обновляться и повторно импортироваться при их изменении, но они все равно должны быть добавлены в проект. Это делается в разделе **Проект → Настройки проекта → Локализация**:
ta: மொழிபெயர்ப்புகள் மாறும்போது புதுப்பிக்கப்பட்டு மீண்டும் இறக்குமதி செய்ய முடியும், ஆனால் அவை இன்னும் திட்டத்தில் சேர்க்கப்பட வேண்டும். இது ** திட்ட → திட்ட அமைப்புகள் → உள்ளூராக்கல் **:
uk: Переклади можуть оновлюватися та повторно імпортуватися, при їх заміні, але їх все одно потрібно додати до проекту. Це робиться в **Проект → Параметри проекту → Локалізація**:
zh_hans: 翻译可以在更改时得到更新并重新导入，但仍必须将其添加到项目中。可通过\ **项目 → 项目设置 → 本地化**\ 来完成：
zh_tw: 翻譯可以在更改時得到更新和重新匯入，但仍必須新增到專案中。可通過**專案 → 專案設定 → 當地語系化**來完成：

source: The above dialog is used to add or remove translations project-wide.
ga: Úsáidtear an dialóg thuas chun aistriúcháin a chur leis nó a bhaint ar fud an tionscadail.
it: La finestra soprastante consente di aggiungere o rimuovere traduzioni in tutto il progetto.
ko: 위의 대화 상자는 프로젝트 전체적으로 번역을 추가 혹은 제거에 사용합니다.
ru: Приведенное выше диалоговое окно используется для добавления или удаления переводов в рамках всего проекта.
ta: திட்ட அளவிலான மொழிபெயர்ப்புகளைச் சேர்க்க அல்லது அகற்ற மேலே உள்ள உரையாடல் பயன்படுத்தப்படுகிறது.
uk: Наведене вище діалогове вікно використовується для додавання, або видалення, перекладів по всьому проекту.
zh_hans: 上述对话框用于添加或移除用于整个项目范围的翻译。
zh_tw: 上述對話方塊用於新增或刪除專案範圍內的翻譯。

source: Localizing resources
ga: Acmhainní a logánú
it: Localizzazione delle risorse
ko: 리소스 현지화하기
ru: Локализация ресурсов
ta: வளங்களை உள்ளூர்மயமாக்குதல்
uk: Локалізація ресурсів
zh_hans: 资源的本地化
zh_tw: 資源的當地語系化

source: It is also possible to instruct Godot to use alternate versions of assets (resources) depending on the current language. This can be used for localized images such as in-game billboards or localized voices.
ga: Is féidir freisin treoir a thabhairt do Godot leaganacha malartacha de shócmhainní (acmhainní) a úsáid ag brath ar an teanga reatha. Is féidir é seo a úsáid le haghaidh íomhánna logánaithe mar chláir fógraí in-chluiche nó guthanna logánaithe.
it: È anche possibile istruire Godot a utilizzare versioni alternative di risorse a seconda della lingua attuale. Questo si può utilizzare per immagini localizzate, come cartelloni, o voci localizzate.
ru: Также можно указать Godot использовать другие текстуры в зависимости от текущего языка. Это можно использовать для локализации изображений, или локализации звуков.
ta: தற்போதைய மொழியைப் பொறுத்து சொத்துக்களின் மாற்று பதிப்புகளை (வளங்கள்) பயன்படுத்த கோடோட்டுக்கு அறிவுறுத்தவும் முடியும். விளையாட்டு விளம்பர பலகைகள் அல்லது உள்ளூர்மயமாக்கப்பட்ட குரல்கள் போன்ற உள்ளூர்மயமாக்கப்பட்ட படங்களுக்கு இதைப் பயன்படுத்தலாம்.
uk: Також можна доручити Godot використовувати альтернативні версії ресурсів (ресурсів) залежно від поточної мови. Це може бути використано для локалізованих зображень, таких як ігрові білборди або локалізовані голоси.
zh_hans: 还可以指示 Godot 根据当前语言使用资产（资源）的替代版本。这可用于本地化诸如游戏内广告牌之类的图像或者语音。
zh_tw: 也可以指示 Godot 使用資產 (資源) 的替代版本，根據目前的語言。這可用於本地化影像，例如遊戲內的看板或本地化語音。

source: The **Remaps** tab can be used for this:
ga: Is féidir an cluais**Remaps** a úsáid chuige seo:
it: La scheda **Rimappature** si può utilizzare per questo:
ko: **리맵** 탭이 이를 위해 사용됩니다:
ru: Для этого можно использовать вкладку **Переназначения** (**Remaps**):
ta: ** ரீமேப்ச் ** தாவலை இதற்குப் பயன்படுத்தலாம்:
uk: Для цього можна використовувати вкладку **Remaps**:
zh_hans: **重定向**\ 选项卡便可用于此：
zh_tw: **重新對應** 分頁可用於此目的：

source: Select the resource to be remapped then add some alternatives for each locale.
ga: Roghnaigh an acmhainn atá le hathscríobh ansin cuir roinnt roghanna eile le haghaidh gach áitiúil.
it: Selezionare la risorsa da rimappare, quindi aggiungere alcune alternative per ogni lingua.
ru: Выберите ресурс, который необходимо переназначить, затем добавьте несколько версий для каждого языка.
ta: மறுவடிவமைக்கப்பட வேண்டிய ஆதாரத்தைத் தேர்ந்தெடுத்து, ஒவ்வொரு இடத்திற்கும் சில மாற்று வழிகளைச் சேர்க்கவும்.
uk: Виберіть ресурс, який потрібно змінити, а потім додайте кілька альтернатив для кожної мови.
zh_hans: 选择需要重定向的资源，然后为每个区域设置添加一些替代项。
zh_tw: 選擇需要重定向的資源，並指定它在其他語言地區的替代方案。

source: The resource remapping system isn't supported for DynamicFonts. To use different fonts depending on the language's script, use the DynamicFont fallback system instead, which lets you define as many fallback fonts as you want.
ga: Ní thacaítear leis an gcóras athmhapála acmhainní do DynamicFonts. Chun clónna éagsúla a úsáid ag brath ar script na teanga, bain úsáid as an gcóras fallback DynamicFont ina ionad sin, a ligeann duit an oiread clónna fillte agus is mian leat a shainiú.
it: Il sistema di rimappatura delle risorse non è supportato per i DynamicFont. Per utilizzare font diversi a seconda dell'alfabeto della lingua, è possibile usare invece il sistema di alternative di DynamicFont, che consente di definire tutti i font di riserva desiderati.
ru: Система переназначения ресурсов не поддерживается для DynamicFonts. Чтобы использовать разные шрифты в зависимости от письменности языка, используйте резервную систему DynamicFont, которая позволяет определить любое количество резервных шрифтов.
ta: வளத்தை மாற்றியமைத்தல் அமைப்பு டைனமிக்ஃபாண்ட்களுக்கு ஆதரிக்கப்படவில்லை. மொழியின் ச்கிரிப்டைப் பொறுத்து வெவ்வேறு எழுத்துருக்களைப் பயன்படுத்த, அதற்கு பதிலாக டைனமிக்ஃபாண்ட் குறைவடையும் முறையைப் பயன்படுத்தவும், இது நீங்கள் விரும்பும் பல குறைவடையும் எழுத்துருக்களை வரையறுக்க உதவுகிறது.
uk: Система перепризначення ресурсів не підтримується для DynamicFonts. Щоб використовувати різні шрифти залежно від сценарію мови, скористайтеся резервною системою DynamicFont, яка дозволяє визначати скільки завгодно резервних шрифтів.
zh_hans: DynamicFont 不支持资源重定向系统。要根据语言文字使用不同的字体，请改用 DynamicFont 回退系统，可以让你根据需要定义任意数量的回退字体。
zh_tw: DynamicFonts 不支援資源重新對應系統。若要根據語言的腳本使用不同的字形，請改用 DynamicFont 後備系統，它允許您定義任意數量的後備字形。

source: The upside of the DynamicFont fallback system is that it works regardless of the current language, making it ideal for things like multiplayer chat where the text language may not match the client's language.
ga: Is é an buntáiste atá ag an gcóras bacainn DynamicFont ná go n-oibríonn sé beag beann ar an teanga reatha, rud a fhágann go bhfuil sé oiriúnach do rudaí cosúil le comhrá il-imreora inar féidir nach n-oireann an teanga téacs teanga an chliaint.
it: Il vantaggio del sistema di alternative di DynamicFont è che funziona a prescindere dalla lingua attuale, il che lo rende ideale per attività come la chat multigiocatore, in cui la lingua del testo potrebbe non corrispondere alla lingua del client.
ru: Преимущество резервной системы DynamicFont заключается в том, что она работает независимо от текущего языка, что делает ее идеальной для таких задач, как многопользовательский чат, где язык текста может не совпадать с языком клиента.
ta: மாறும் ஃபோன்ட் குறைவடையும் அமைப்பின் தலைகீழ் என்னவென்றால், இது தற்போதைய மொழியைப் பொருட்படுத்தாமல் செயல்படுகிறது, இது மல்டிபிளேயர் அரட்டை போன்ற விசயங்களுக்கு ஏற்றதாக அமைகிறது, அங்கு உரை மொழி வாடிக்கையாளரின் மொழியுடன் பொருந்தாது.
uk: Перевагою резервної системи DynamicFont є те, що вона працює незалежно від поточної мови, що робить її ідеальною для таких речей, як чат для кількох гравців, де мова тексту може не збігатися з мовою клієнта.
zh_hans: DynamicFont 后备系统的优点是它可以忽略当前语言而工作，这使得它非常适合多人聊天即文本语言可能与客户端语言不匹配的情况。
zh_tw: DynamicFont 後備系統的優點是，無論目前語言如何，它都可以工作，這使其非常適合文字語言可能與客戶端語言不配對的多人聊天等情況。

source: Automatically setting a language
it: Impostazione automatica di una lingua
ko: 자동으로 언어 설정하기
ru: Автоматическая установка языка
zh_hans: 自动设置语言
zh_tw: 自動設定語言

source: It is recommended to default to the user's preferred language which can be obtained via :ref:`OS.get_locale_language() <class_OS_method_get_locale_language>`. If your game is not available in that language, it will fall back to the :ref:`Fallback <class_ProjectSettings_property_internationalization/locale/fallback>` in **Project Settings > Internationalization > Locale**, or to ``en`` if empty. Nevertheless letting players change the language in game is recommended for various reasons (e.g. translation quality or player preference).
it: Si consiglia di impostare come predefinita la lingua preferita dall'utente, ricavabile tramite :ref:`OS.get_locale_language() <class_OS_method_get_locale_language>`. Se il gioco non è disponibile in quella lingua, sarà utilizzata l':ref:`Alternativa <class_ProjectSettings_property_internationalization/locale/fallback>` in **Impostazioni progetto > Internazionalizzazione > Locale**, oppure ``en`` se vuoto. Tuttavia, consentire ai giocatori di cambiare la lingua nel gioco è consigliato per vari motivi (ad esempio, per la qualità della traduzione o per le preferenze dei giocatori).
ko: 디폴트로 :ref:`OS.get_locale_language() <class_OS_method_get_locale_language>`\ 를 통해 얻을 수 있는 사용자가 선호하는 언어로 설정하는 것을 권장합니다. 게임이 해당 언어로 사용할 수 없는 경우, **프로젝트 설정 > 국제화 > 로케일**\ 의 :ref:`폴백 <class_ProjectSettings_property_internationalization/locale/fallback>`\ 으로 , 또는 비어 있는 경우 ``en``\ 으로 폴백됩니다. 그렇지만 (번역 품질이나 플레이어 선호도 등) 여러 가지 이유로 플레이어가 게임 내에서 언어를 변경할 수 있도록 하는 것이 좋습니다.
ru: Рекомендуется использовать предпочитаемый пользователем язык по умолчанию, который можно получить с помощью :ref:`OS.get_locale_language() <class_OS_method_get_locale_language>`. Если игра недоступна на этом языке, она будет переключена на :ref:`Fallback <class_ProjectSettings_property_internationalization/locale/fallback>` в разделе **Project Settings > Internationalization > Locale**, или на ``en``, если он пуст. Тем не менее, по разным причинам (например, из-за качества перевода или предпочтений игроков) рекомендуется разрешить игрокам менять язык в игре.
zh_hans: 建议默认使用用户的首选语言，可以通过 :ref:`OS.get_locale_language() <class_OS_method_get_locale_language>` 获取。如果你的游戏不支持该语言，则会回退到 **项目设置 > 国际化 > 区域** 中的 :ref:`回退语言 <class_ProjectSettings_property_internationalization/locale/fallback>`\ ，如果为空则回退到 ``en``\ 。不过，出于各种原因（例如翻译质量或玩家偏好），建议让玩家能够在游戏中更改语言。
zh_tw: 建議預設為使用者偏好的語言，這可以透過 :ref:`OS.get_locale_language() <class_OS_method_get_locale_language>` 取得。如果您的遊戲不提供該語言版本，它將會回退到 **專案設定 > 國際化 > 地區** 中的 :ref:`回退 <class_ProjectSettings_property_internationalization/locale/fallback>`，如果為空則回退到 ``en``。然而，基於各種原因 (例如翻譯品質或玩家偏好)，仍建議允許玩家在遊戲中變更語言。

source: Locale vs. language
it: Localizzazione vs. lingua
ko: 로케일 대 언어
ru: Локаль vs. языка
zh_hans: 区域设置 vs 语言
zh_tw: 本地化和語系

source: A :ref:`locale <doc_locales>` is commonly a combination of a language with a region or country, but can also contain information like a script or a variant.
it: Una :ref:`localizzazione <doc_locales>` è solitamente una combinazione di una lingua con una regione o un paese, ma può anche contenere informazioni come un alfabeto o una variante.
ko: :ref:`locale <doc_locales>`\ 은 일반적으로 언어와 지역 또는 국가의 조합이지만, 스크립트나 변종과 같은 정보도 포함할 수 있습니다.
ru: :ref:`locale <doc_locales>` обычно представляет собой комбинацию языка с регионом или страной, но может также содержать информацию, например, о письменности или варианте.
zh_hans: :ref:`区域设置 <doc_locales>`\ 通常是语言与地区或国家的组合，还可能包含文字、变体等信息。
zh_tw: 一個 :ref:`語系 <doc_locales>` 通常是語言與地區或國家的組合，但也可以包含像是文字書寫系統或變體等資訊。

source: Examples:
it: Esempi:
ko: 예시:
ru: Примеры:
ta: எடுத்துக்காட்டுகள்:
zh_hans: 示例：
zh_tw: 範例：

source: ``en``: English language
it: ``en``: Lingua inglese
ko: ``en``: 영어
ru: ``en``: English язык
zh_hans: ``en``\ ：英语语言
zh_tw: ``en``: 英文

source: ``en_GB``: English in Great Britain / British English
it: ``en_GB``: inglese in Gran Bretagna / inglese britannico
ko: ``en_GB``: 영국의 영어 / 영국 영어
ru: ``en_GB``: English в Great Britain (Великобритания) / British English
zh_hans: ``en_GB``\ ：英国的英语 / 英式英语
zh_tw: ``en_GB``: 英文(英國)

source: ``en_US``: English in the USA / American English
it: ``en_US``: inglese negli Stati Uniti / inglese americano
ko: ``en_US``: 미국의 영어 / 미국 영어
ru: ``en_US``: English в USA / American English
zh_hans: ``en_US``\ ：美国的英语 / 美式英语
zh_tw: ``en_US``: 英文（美國

source: ``en_DE``: English in Germany
it: ``en_DE``: inglese in Germania
ko: ``en_DE``: 독일의 영어
ru: ``en_DE``: English в Germany
zh_hans: ``en_DE``\ ：德国的英语
zh_tw: ``en_DE``: 英文（德國）

source: Indie games generally only need to care about language, but read on for more information.
it: In genere, i giochi indie devono preoccuparsi solo della lingua, ma continua a leggere per maggiori informazioni.
ko: 인디 게임은 일반적으로 언어만 신경 쓰면 되지만, 자세한 정보는 계속 읽어보세요.
ru: Инди-играм, как правило, важен только язык, но читайте дальше, чтобы узнать больше.
zh_hans: 独立游戏通常只需要关注语言，但请继续往下看更多信息。
zh_tw: 獨立遊戲一般只需要關心語言，但請繼續閱讀以獲得更多資訊。

source: Why locales exist can be illustrated through the USA and Great Britain. Both speak the same language (English), yet differ in many aspects: - Spelling: E.g. gray (USA), grey (GB) - Use of words: E.g. eggplant (USA), aubergine (GB) - Units or currencies: E.g. feet/inches (USA), metres/cm (GB)
it: Il motivo per cui le localizzazioni esistono si può illustrare prendendo come esempio gli Stati Uniti e la Gran Bretagna. Entrambi parlano la stessa lingua (inglese), ma differiscono in molti aspetti: - Ortografia: gray (USA), grey (GB) - Uso delle parole: eggplant (USA), aubergine (GB) - Unità di misura o valute: feet/inches (USA), metres/cm (GB)
ko: 로케일의 존재 이유는 미국과 영국을 통해 설명할 수 있습니다. 두 나라는 같은 언어(영어)를 사용하지만 여러 측면에서 차이가 있습니다: - 철자: 예: gray (미국), grey (영국) - 단어 사용: 예: eggplant (미국), aubergine (영국) - 단위 또는 통화: 예: feet/inches (미국), meters/cm (영국)
ru: Причины существования локальных различий можно проиллюстрировать на примере США и Великобритании. Обе страны говорят на одном языке (English), но во многом различаются: - Орфография: например, gray (США), grey (Великобритания). - Использование слов: например, eggplant (США), aubergine (Великобритания). - Единицы измерения или валюты: например, футы/дюймы (США), метры/см (Великобритания)
zh_hans: 可以通过美国和英国的例子来解释区域设置存在的必要性。他们所说的同一种语言（英语），但在很多方面又有区别：——拼写：如 gray（美）和 grey（英）——用词：如 eggplant（美）和 aubergine（英）——单位和货币：如 feet/inch（美）和 metre/cm（英）
zh_tw: 為什麼需要地區設定（locale）？以美國與英國為例，兩者都說英文，但有很多不同：- 拼字不同，如 gray（美）、grey（英）- 用詞不同，如 eggplant（美）、aubergine（英）- 使用的單位或貨幣不同，如 feet/inches（美）、metres/cm（英）

source: It can get more complex however. Imagine you offer different content in Europe and in China (e.g. in an MMO). You will need to translate each of those content variations into many languages and store and load them accordingly.
it: Tuttavia, il tutto può diventare più complesso. Immagina di offrire contenuti diversi in Europa e in Cina (ad esempio, in un MMO). Dovrai tradurre ciascuna di queste varianti di contenuto in diverse lingue, memorizzandole e caricandole appropriatamente.
ko: 하지만 상황은 더 복잡해질 수 있습니다. (예: MMO에서) 유럽과 중국에서 서로 다른 내용을 제공한다고 가정해 보겠습니다. 해당 내용 변종을 여러 언어 안으로 번역하고 그에 따라 저장 및 불러와야 합니다.
ru: Однако это может быть сложнее. Представьте, что вы предлагаете разный контент в Европе и Китае (например, в MMO). Вам потребуется перевести каждый из этих вариантов контента на множество языков, а также хранить и загружать их соответствующим образом.
zh_hans: 甚至可以变得更加复杂。可以想象一下在欧洲和中国提供不同的内容（例如在 MMO 中）。你需要把每种内容变体都翻译成多种语言，进行相应的存储和加载。
zh_tw: 然而，這可能會變得更複雜。假設您在歐洲和中國提供不同的內容 (例如在大型多人線上遊戲中)。您需要將各種不同的內容翻譯為多種語言，並據此進行儲存和載入。

source: Converting keys to text
ga: Eochracha a thiontú go téacs
it: Conversione delle chiavi in testo
ko: 키를 텍스트로 변환하기
ru: Преобразование ключей в текст
ta: விசைகளை உரையாக மாற்றும்
uk: Перетворення ключів на текст
zh_hans: 将键转换为文本
zh_tw: 將鍵轉換為文字
