Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/internationalizing_games.po
Languages: ga, it, ko, ru, ta, uk, zh_hans, zh_tw

source: Translations can also be tested when :ref:`running Godot from the command line <doc_command_line_tutorial>`. For example, to test a game in French, the following argument can be supplied:
ga: Is féidir aistriúcháin a thástáil freisin nuair a :ref:`Godot a rith ón líne ordaithe <doc_command_line_tutorial>`. Mar shampla, chun cluiche i bhFraincis a thástáil, is féidir an argóint seo a leanas a sholáthar:
it: È possibile testare le traduzioni anche :ref:`eseguendo Godot dalla riga di comando <doc_command_line_tutorial>`. Ad esempio, per testare un gioco in francese, è possibile fornire il seguente argomento:
ru: Переводы также можно тестировать, :ref:`запуская Godot из командной строки <doc_command_line_tutorial>`. Например, для тестирования игры на французском языке можно указать следующий аргумент:
ta: மொழிபெயர்ப்புகளையும் எப்போது சோதிக்க முடியும்: ref: `கட்டளை வரியிலிருந்து கோடோட்டை இயக்குகிறது <doc_command_line_tutorial>`. எடுத்துக்காட்டாக, பிரெஞ்சு மொழியில் ஒரு விளையாட்டைச் சோதிக்க, பின்வரும் வாதத்தை வழங்க முடியும்:
uk: Переклади також можна перевірити, :ref:`запустивши Godot з командного рядка <doc_command_line_tutorial>`. Наприклад, щоб перевірити гру французькою мовою, можна надати такий аргумент:
zh_hans: 还可以\ :ref:`在从命令行运行 Godot <doc_command_line_tutorial>` 时测试翻译。例如，要使用法语测试游戏，可以提供以下参数：
zh_tw: 翻譯也可以在 :ref:`從命令列執行 Godot 時 <doc_command_line_tutorial>` 測試。例如，若要測試法文的遊戲，可以提供以下引數：

source: Translating the project name
ga: Ainm an tionscadail a aistriú
it: Tradurre il nome del progetto
ru: Перевод названия проекта
ta: திட்ட பெயரை மொழிபெயர்க்கிறது
uk: Переклад назви проекту
zh_hans: 翻译项目名称
zh_tw: 專案名稱翻譯

source: The project name becomes the app name when exporting to different operating systems and platforms. To specify the project name in more than one language go to **Project > Project Settings> Application > Config**. From here click on the button that says ``Localizable String (Size 0)``. Now there should be a button below that which says ``Add Translation``. Click on that and it will take you to a page where you can choose the language (and country if needed) for your project name translation. After doing that you can now type in the localized name.
ga: Déantar ainm an tionscadail mar ainm an aip nuair a bhíonn sé á onnmhairiú chuig córais oibriúcháin agus ardáin éagsúla. Chun ainm an tionscadail a shonrú i níos mó ná teanga amháin téigh chuig **Tionscadal > Socruithe an Tionscadail> Feidhmchlár > Cumraíocht**. Ó anseo cliceáil ar an gcnaipe a deir `` Teaghrán Logánta (Méid 0)``. Anois ba chóir go mbeadh cnaipe faoi bhun an chnaipe a deir ``Cuir Aistriúchán``. Cliceáil air sin agus tabharfaidh sé go dtí leathanach tú inar féidir leat an teanga (agus an tír más gá) a roghnú le haghaidh d’aistriúchán ainm tionscadail. Tar éis duit é sin a dhéanamh is féidir leat an t-ainm logánta a chlóscríobh anois.
it: Il nome del progetto diventa il nome dell'app quando si esporta su sistemi operativi e piattaforme diversi. Per specificare il nome del progetto in più lingue, andare su **Progetto > Impostazioni del progetto > Applicazione > Configurazione**. Da qui, cliccare sul pulsante ``Stringa localizzabile (dimensione 0)``. Ora dovrebbe esserci un pulsante sottostante con la scritta ``Aggiungi traduzione``. Cliccandoci sopra si accederà a una pagina in cui è possibile scegliere la lingua (e il paese, se necessario) per la traduzione del nome del progetto. Dopodiché, si può digitare il nome localizzato.
ru: Название проекта становится названием приложения при экспорте в различные операционные системы и платформы. Чтобы указать название проекта на нескольких языках, перейдите в раздел **Project > Project Settings> Application > Config**. Нажмите кнопку ``Localizable String (Size 0)``. Под ней должна появиться кнопка ``Add Translation``. Нажмите на неё, и вы перейдёте на страницу, где можно выбрать язык (и страну, если необходимо) для перевода названия проекта. После этого можно ввести локализованное название.
ta: வெவ்வேறு இயக்க முறைமைகள் மற்றும் தளங்களுக்கு ஏற்றுமதி செய்யும் போது திட்டத்தின் பெயர் பயன்பாட்டு பெயராக மாறும். திட்டத்தின் பெயரை ஒன்றுக்கு மேற்பட்ட மொழிகளில் குறிப்பிட ** திட்ட> திட்ட அமைப்புகள்> பயன்பாடு> கட்டமைப்பு ** க்குச் செல்லவும். இங்கிருந்து `` உள்ளூர்மயமாக்கக்கூடிய சரம் (அளவு 0) `` என்று சொல்லும் பொத்தானைக் சொடுக்கு செய்க. `` மொழிபெயர்ப்பைச் சேர்`` என்று சொல்லும் ஒரு பொத்தானை இப்போது கீழே இருக்க வேண்டும். அதைக் சொடுக்கு செய்து, உங்கள் திட்ட பெயர் மொழிபெயர்ப்புக்கு மொழியை (தேவைப்பட்டால்) தேர்வுசெய்யக்கூடிய ஒரு பக்கத்திற்கு இது உங்களை அழைத்துச் செல்லும். அதைச் செய்த பிறகு நீங்கள் இப்போது உள்ளூர்மயமாக்கப்பட்ட பெயரைத் தட்டச்சு செய்யலாம்.
uk: Назва проекту стає назвою програми під час експорту в інші операційні системи та платформи. Щоб указати назву проекту кількома мовами, перейдіть до **Проект > Параметри проекту > Програма > Конфігурація**. Звідси натисніть кнопку з написом ``Локалізований рядок (розмір 0)``. Тепер під цією має бути кнопка «Додати переклад». Натисніть на це, і ви перейдете на сторінку, де ви зможете вибрати мову (і країну, якщо потрібно) для перекладу назви вашого проекту. Після цього ви можете ввести локалізовану назву.
zh_hans: 项目名称将在导出到不同的操作系统和平台时成为应用名称。要以多种语言指定项目名称，请转到\ **项目 > 项目设置 > 应用 > 配置**\ 。从这里点击\ ``可本地化字符串（大小 0）``\ 按钮。现在下面应该有一个标有\ ``添加翻译``\ 按钮。点击该按钮，它将带你到一个页面，可以在其中为项目名称翻译选择语言（如果需要，还可以选择地区）。完成后，你现在可以输入本地化的名称。
zh_tw: 匯出到不同作業系統和平台時，專案名稱會變成應用程式名稱。若要指定多種語言的專案名稱，請前往 「專案 > 專案設定 > 應用程式 > 配置」。從這裡按一下「可本地化字串 (size 0)」按鈕。現在下面應該有一個按鈕，上面寫著 ``Add Translation``。按一下該按鈕，就會轉到一個頁面，您可以在此選擇專案名稱翻譯的語言 (如果需要，也可以選擇國家/地區)。完成後，您就可以輸入本地化的名稱。

source: If you are unsure about the language code to use, refer to the :ref:`list of locale codes <doc_locales>`.
ga: Mura bhfuil tú cinnte faoin gcód teanga atá le húsáid, déan tagairt don :ref:`list of locale codes <doc_locales>`.
it: Se non si è sicuri del codice di lingua da utilizzare, fare riferimento alla :ref:`lista di codici lingua <doc_locales>`.
ru: Если вы не уверены в том, какой код языка использовать, обратитесь к :ref:`списку кодов локалей <doc_locales>`.
ta: பயன்படுத்த வேண்டிய மொழி குறியீடு பற்றி உங்களுக்குத் தெரியாவிட்டால், அதைப் பார்க்கவும்: ref: `லோகேல் குறியீடுகளின் பட்டியல் <Doc_locales>`.
uk: Якщо ви не впевнені в коді мови для використання, зверніться до :ref:`списку кодів мов<doc_locales>`.
zh_hans: 如果你不确定要使用的语言代码，请参阅\ :ref:`区域代码列表 <doc_locales>`\ 。
zh_tw: 如果您不確定要使用的語言代碼，請參閱 :ref:`語言環境代碼列表 <doc_locales>`。

source: To check whether your UI can accommodate translations with longer strings than the original, you can enable *pseudolocalization* in the advanced Project Settings. This will replace all your localizable strings with longer versions of themselves, while also replacing some characters in the original strings with accented versions (while still being readable). Placeholders are kept as-is, so that they keep working when pseudolocalization is enabled.
ga: Chun a sheiceáil an féidir le do Chomhéadain freastal ar aistriúcháin le teaghráin níos faide ná an bunaidh, is féidir leat *pseudolocalization *a chumasú sna Socruithe Tionscadail chun cinn. Beidh sé seo in ionad gach do teaghráin localizable le leaganacha níos faide de féin, agus freisin in ionad roinnt carachtair sna teaghráin bunaidh le leaganacha accented (cé go bhfuil fós inléite). Coinnítear sealbhóirí áite mar atá, ionas go gcoinníonn siad ag obair nuair a chumasaítear pseudolocalization.
ta: உங்கள் இடைமுகம் அசலை விட நீண்ட சரங்களைக் கொண்ட மொழிபெயர்ப்புகளை இடமளிக்க முடியுமா என்பதைச் சரிபார்க்க, மேம்பட்ட திட்ட அமைப்புகளில் * சூடோலோகலைசேசன் * ஐ இயக்கலாம். இது உங்கள் உள்ளூர்மயமாக்கக்கூடிய அனைத்து சரங்களையும் தங்களுக்கு நீண்ட பதிப்புகளுடன் மாற்றும், அதே நேரத்தில் அசல் சரங்களில் சில எழுத்துக்களை உச்சரிக்கப்பட்ட பதிப்புகளுடன் மாற்றும் (இன்னும் படிக்கக்கூடியதாக இருக்கும்போது). இடப்பெயர்ச்சியாளர்களே வைக்கப்பட்டுள்ளனர், இதனால் சூடோலோகலைசேசன் இயக்கப்படும் போது அவர்கள் தொடர்ந்து செயல்படுகிறார்கள்.
uk: Щоб перевірити, чи може ваш інтерфейс користувача вмістити переклади з довшими рядками, ніж оригінал, ви можете ввімкнути *псевдолокалізацію* в розширених налаштуваннях проекту. Це замінить усі ваші рядки, які можна локалізувати, на довші версії самих себе, а також замінить деякі символи в оригінальних рядках на версії з діакритичними знаками (при цьому їх можна буде прочитати). Заповнювачі зберігаються як є, тому вони продовжують працювати, коли ввімкнено псевдолокалізацію.

source: Godot has a server handling low-level translation management called the :ref:`TranslationServer <class_TranslationServer>`. Translations can be added or removed during run-time; the current language can also be changed at run-time.
ga: Tá freastalaí ag Godot a láimhseálann bainistíocht aistriúcháin ar leibhéal íseal ar a dtugtar an :ref:`TranslationServer <class_TranslationServer>`. Is féidir aistriúcháin a chur leis nó a bhaint le linn am rite; is féidir an teanga reatha a athrú freisin ag am rite.
uk: Godot має сервер, який обробляє низькорівневе управління перекладами під назвою :ref:`TranslationServer <class_TranslationServer>`. Переклади можуть бути додані, або видалені, під час виконання; поточну мову також можна змінити під час виконання.

source: Some languages are written without spaces, and word and line breaking requires more than rules over character sequences. Godot includes ICU rule and dictionary based, break iterator data, but this data is not included into exported projects by default. To include it go to **Project → Project Settings → Localization → Text Server Data** and click **Install support data...**. Break iterator data is about 4 MB large.
ga: Scríobhtar roinnt teangacha gan spásanna, agus éilíonn briseadh focal agus líne níos mó ná rialacha maidir le seichimh charachtair. Cuimsíonn Godot riail ICU agus foclóir bunaithe, briseadh sonraí iterator, ach níl na sonraí seo san áireamh i dtionscadail onnmhairithe de réir réamhshocraithe. Chun é a chur san áireamh téigh go dtí ** Socruithe Tionscadail → → Logánú → Sonraí Freastalaí Téacs ** agus cliceáil ** Suiteáil sonraí tacaíochta ...**. Tá briseadh sonraí iterator thart ar 4 MB mór.
ta: சில மொழிகள் இடைவெளிகள் இல்லாமல் எழுதப்பட்டுள்ளன, மேலும் சொல் மற்றும் வரி உடைப்பது எழுத்து வரிசைமுறைகள் மீதான விதிகளை விட அதிகமாக தேவைப்படுகிறது. கோடோட் ஐ.சி.யூ விதி மற்றும் அகராதி அடிப்படையிலான, பிரேக் ஐடரேட்டர் தரவை உள்ளடக்கியது, ஆனால் இந்த தரவு முன்னிருப்பாக ஏற்றுமதி செய்யப்பட்ட திட்டங்களில் சேர்க்கப்படவில்லை. இதைச் சேர்க்க ** திட்ட → திட்ட அமைப்புகள் → உள்ளூராக்கல் → உரை சேவையக தரவு ** க்குச் சென்று ** உதவி தரவை நிறுவவும் ... **. பிரேக் ஐடரேட்டர் தரவு சுமார் 4 எம்பி பெரியது.
uk: Деякі мови пишуться без пробілів, і розрив слів і рядків вимагає не лише правил щодо послідовності символів. Godot містить дані ітератора розриву на основі правил ICU та словника, але ці дані за замовчуванням не включено до експортованих проектів. Щоб включити його, перейдіть до **Проект → Параметри проекту → Локалізація → Дані текстового сервера** та натисніть **Встановити дані підтримки...**. Розмір даних ітератора розриву становить приблизно 4 МБ.

source: You may want to test a project's translation before releasing it. Godot provides two ways to do this.
ga: B'fhéidir gur mhaith leat aistriúchán tionscadail a thástáil sula scaoilfear saor é. Soláthraíonn Godot dhá bhealach chun é seo a dhéanamh.
ta: ஒரு திட்டத்தின் மொழிபெயர்ப்பை வெளியிடுவதற்கு முன்பு அதை சோதிக்க விரும்பலாம். இதைச் செய்ய கோடோட் இரண்டு வழிகளை வழங்குகிறது.
uk: Можливо, ви захочете перевірити переклад проекту, перш ніж випустити його. Godot дає два способи зробити це.

source: First, in the Project Settings, under **Internationalization > Locale** (with advanced settings enabled), there is a **Test** property. Set this property to the locale code of the language you want to test. Godot will run the project with that locale when the project is run (either from the editor or when exported).
ga: Ar an gcéad dul síos, i Socruithe an Tionscadail, faoi **Idirnáisiúnú > Locale** (agus ardsocruithe cumasaithe), tá maoin **Tástáil**. Socraigh an t-airí seo chuig cód locale na teanga is mian leat a thástáil. Reáchtálfaidh Godot an tionscadal leis an locale sin nuair a bheidh an tionscadal á reáchtáil (ón eagarthóir nó nuair a easpórtálfar é).
ta: முதலாவதாக, திட்ட அமைப்புகளில், ** சர்வதேசமயமாக்கல்> லோகேல் ** (மேம்பட்ட அமைப்புகள் இயக்கப்பட்டவை) கீழ், ஒரு ** சோதனை ** சொத்து உள்ளது. நீங்கள் சோதிக்க விரும்பும் மொழியின் லோகேல் குறியீட்டிற்கு இந்த சொத்தை அமைக்கவும். திட்டம் இயங்கும்போது (எடிட்டரிலிருந்து அல்லது ஏற்றுமதி செய்யும் போது) கோடோட் அந்த இடத்துடன் திட்டத்தை இயக்கும்.
uk: По-перше, у налаштуваннях проекту в розділі **Інтернаціоналізація > Локаль** (з увімкненими розширеними налаштуваннями) є властивість **Тестувати**. Установіть для цієї властивості код мови мови, яку ви хочете перевірити. Godot запустить проект із цією мовою під час запуску проекту (або з редактора, або під час експорту).
