Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/internationalizing_games.po
Languages: ga, it, ko, ru, ta, uk, zh_hans, zh_tw

source: Providing pluralized translations is only supported with :ref:`doc_localization_using_gettext`, not CSV.
ga: Ní thacaítear le haistriúcháin iolraithe a sholáthar ach le :ref:'doc_localization_using_gettext', ní CSV.
it: La capacità di fornire traduzioni plurali è supportata solo con :ref:`doc_localization_using_gettext`, non con CSV.
ru: Предоставление переводов во множественном числе поддерживается только с помощью :ref:`doc_localization_using_gettext`, а не CSV.
ta: பன்மைமயமாக்கப்பட்ட மொழிபெயர்ப்புகளை வழங்குவது மட்டுமே ஆதரிக்கப்படுகிறது: குறிப்பு: `doc_localization_using_gettext`, காபிம அல்ல.
uk: Переклад у формі множини підтримується лише :ref:`doc_localization_using_gettext`, а не CSV.
zh_hans: 提供复数翻译仅支持\ :ref:`doc_localization_using_gettext`\ ，不支持 CSV。
zh_tw: 僅 :ref:`doc_localization_using_gettext` 支援提供複數化翻譯，CSV 格式不支援。

source: Making controls resizable
ga: Rialuithe a dhéanamh in-athdhíolta
it: Rendere i controlli ridimensionabili
ru: Изменение размеров элементов управления
ta: கட்டுப்பாடுகளை மறுசீரமைக்கக்கூடியதாக ஆக்குகிறது
uk: Контроль розміру
zh_hans: 使控件的大小可调
zh_tw: 讓控制項可調整大小

source: The same text in different languages can vary greatly in length. For this, make sure to read the tutorial on :ref:`doc_size_and_anchors`, as dynamically adjusting control sizes may help. :ref:`Container <class_Container>` can be useful, as well as the text wrapping options available in :ref:`Label <class_Label>`.
ga: Is féidir le fad an téacs céanna i dteangacha éagsúla a bheith éagsúil. Chun é seo a dhéanamh, déan cinnte an teagaisc ar : ref: `doc_size_and_anchors` a léamh, mar b'fhéidir go gcabhróidh sé le méideanna rialaithe a choigeartú go dinimiciúil. :ref:`Is féidir le coimeádán <class_Container>` a bheith úsáideach, chomh maith leis na roghanna fillte téacs atá ar fáil in :ref:`Lipéad <class_Label>`.
it: Lo stesso testo in lingue diverse può variare notevolmente in lunghezza. Per questo, assicurati di leggere il tutorial su :ref:`doc_size_and_anchors`, poiché potrebbe aiutare adattare le dimensioni dei controlli dinamicamente. :ref:`Container <class_Container>` può essere utile, così come le opzioni di testo a capo disponibili in :ref:`Label <class_Label>`.
ru: Один и тот же текст на разных языках может сильно отличаться по длине. Для этого обязательно прочитайте руководство по :ref:`doc_size_and_anchors`, так как динамическая настройка размеров элементов управления может помочь. :ref:`Container <class_Container>` может быть полезен, также как и опции обертывания текста, доступные в :ref:`Label <class_Label>`.
ta: வெவ்வேறு மொழிகளில் ஒரே உரை நீளமாக மாறுபடும். இதற்காக, டுடோரியலைப் படிக்க உறுதிப்படுத்திக் கொள்ளுங்கள்: குறிப்பு: `doc_size_and_anchors`, கட்டுப்பாட்டு அளவுகளை மாறும் வகையில் சரிசெய்தல் உதவக்கூடும். .
uk: Один і той же текст на різних мовах може сильно відрізнятися за довжиною. Для цього обов'язково прочитайте підручник :ref:`doc_size_and_anchors`, оскільки динамічне регулювання розмірів може допомогти. Корисним може бути :ref:`Контейнер<class_Container>`, як і параметри обтікання текстом, доступні в :ref:`Мітці <class_Label>`.
zh_hans: 不同语言的相同文本的长度差异很大。为此，请务必阅读教程《\ :ref:`doc_size_and_anchors`\ 》，因为动态调整控件大小可能有所帮助。\ :ref:`Container <class_Container>` 可能很有用，\ :ref:`Label <class_Label>` 的文本换行选项应该也能帮上忙。
zh_tw: 不同語言的相同文字的長度差異很大。為此，請務必閱讀教學 :ref:`doc_size_and_anchors`，因為動態調整控制項大小可能有所説明。:ref:`Container <class_Container>` 可能很有用，:ref:`Label <class_Label>` 的文字換行選項應該也能幫上忙。

source: To check whether your UI can accommodate translations with longer strings than the original, you can enable :ref:`pseudolocalization <doc_pseudolocalization>` in the advanced Project Settings. This will replace all your localizable strings with longer versions of themselves, while also replacing some characters in the original strings with accented versions (while still being readable). Placeholders are kept as-is, so that they keep working when pseudolocalization is enabled.
it: Per verificare se la propria interfaccia utente supporta traduzioni con stringhe più lunghe dell'originale, è possibile abilitare la :ref:`pseudolocalizzazione <doc_pseudolocalization>` nelle Impostazioni avanzate del progetto. Questa sostituirà tutte le stringhe localizzabili con versioni più lunghe di se stesse, sostituendo anche alcuni caratteri nelle stringhe originali con versioni accentate (pur rimanendo leggibili). I segnaposto sono lasciati così come sono, affinché continuino a funzionare quando la pseudolocalizzazione è abilitata.
ru: Чтобы проверить, поддерживает ли ваш пользовательский интерфейс (UI) переводы с более длинными строками, чем исходный текст, можно включить :ref:`pseudolocalization <doc_pseudolocalization>` в расширенных настройках проекта. Это заменит все локализуемые строки их более длинными версиями, а также заменит некоторые символы в исходных строках их диакритическими версиями (при этом они останутся читаемыми). Заполнители сохраняются как есть, поэтому они продолжают работать при включении псевдолокализации.
zh_tw: 要檢查你的 UI 是否能容納比原文更長的譯文，可以在進階專案設定中啟用 :ref:`pseudolocalization <doc_pseudolocalization>`。這會將所有可在地化的字串替換為更長的版本，同時把原字串中的部分字元換成帶重音（仍可辨識）的版本。佔位符會保持不變，以確保在啟用偽本地化時仍可正常運作。

source: For example, the string ``Hello world, this is %s!`` becomes ``[Ĥéłłô ŵôŕłd́, ŧh̀íš íš %s!]`` when pseudolocalization is enabled.
ga: Mar shampla, déantar ''[Ĥéłłô ŵôŕłd́, ŧh̀íš íš %s!] '' nuair a chumasaítear pseudolocalization.
it: Ad esempio, la stringa ``Hello world, this is %s!`` diventa ``[Ĥéłłô ŵôŕłd́, ŧh̀íš íš %s!]`` quando la pseudolocalizzazione è abilitata.
ru: Например, строка ``Hello world, this is %s!`` становится ``[Ĥéłłô ŵôŕłd́, ŧh̀íš íš %s!]``, если включена псевдолокализация.
ta: எடுத்துக்காட்டாக, `` அலோ வேர்ல்ட், இது %s!
uk: Наприклад, рядок ``Hello world, this is %s!`` стає ``[Ĥéłłô ŵôŕłd́, ŧh̀íš íš %s!]``, коли псевдолокалізацію ввімкнено.
zh_hans: 例如，当启用伪本地化时，字符串 ``Hello world, this is %s!`` 会变为 ``[Ĥéłłô ŵôŕłd́, ŧh̀íš íš %s!]``\ 。
zh_tw: 例如，當啟用偽本地化時，字串「Hello world, this is %s!」將變為「[Ĥéłłô ŵôŕłd́, ŧh̀íš íš %s!]」。

source: While looking strange at first, pseudolocalization has several benefits:
ga: Agus é ag féachaint aisteach ar dtús, tá roinnt buntáistí ag baint le pseudolocalization:
it: Anche se a prima vista può sembrare strano, la pseudolocalizzazione ha diversi vantaggi:
ru: Хотя на первый взгляд это может показаться странным, псевдолокализация имеет ряд преимуществ:
ta: முதலில் விசித்திரமாக இருக்கும்போது, சூடோலோகலைசேசன் பல நன்மைகளைக் கொண்டுள்ளது:
uk: Хоча на перший погляд виглядає дивно, псевдолокалізація має кілька переваг:
zh_hans: 虽然第一眼看上去很奇怪，但是伪本地化的好处有很多：
zh_tw: 雖然第一眼看上去很奇怪，但是偽當地語系化的好處有很多：

source: It lets you spot non-localizable strings quickly, so you can go over them and make them localizable (if it makes sense to do so).
ga: Ligeann sé duit teaghráin neamh-localizable a fheiceáil go tapa, ionas gur féidir leat dul os a gcionn agus iad a dhéanamh logánaithe (má dhéanann sé ciall é sin a dhéanamh).
it: Permette di individuare rapidamente le stringhe non localizzabili, in modo da poterle riguardare e renderle localizzabili (se ha senso farlo).
ru: Это позволяет быстро обнаружить нелокализуемые строки, чтобы можно было просмотреть их и сделать локализуемыми (если это имеет смысл).
ta: இது உள்ளக அல்லாத சரங்களை விரைவாகக் கண்டுபிடிக்க உங்களை அனுமதிக்கிறது, எனவே நீங்கள் அவற்றைக் கடந்து செல்லலாம் மற்றும் அவற்றை உள்ளூர்மயமாக்கலாம் (அவ்வாறு செய்வது அர்த்தமுள்ளதாக இருந்தால்).
uk: Це дозволяє швидко помітити нелокалізовані рядки, тож ви можете переглянути їх і зробити їх локалізованими (якщо це має сенс).
zh_hans: 它可以让你快速发现不可本地化的字串，这样你就可以检查它们并使它们可本地化（如果这样做有意义的话）。
zh_tw: 它可以讓您快速發現不可本地化的字串，這樣您就可以檢查它們並使它們可本地化（如果這樣做有意義的話）。

source: It lets you check UI elements that can't fit long strings. Many languages will feature much longer translations than the source text, so it's important to ensure your UI can accommodate longer-than-usual strings.
ga: Ligeann sé duit eilimintí Chomhéadain a sheiceáil nach féidir leo teaghráin fhada a fheistiú. Beidh aistriúcháin i bhfad níos faide i gceist le go leor teangacha ná an téacs foinseach, mar sin tá sé tábhachtach a chinntiú gur féidir le do UI freastal ar teaghráin níos faide ná mar is gnách.
it: Permette di individuare gli elementi dell'interfaccia utente che non possono contenere stringhe lunghe. Molte lingue presentano traduzioni molto più lunghe del testo originale, quindi è importante assicurarsi che l'interfaccia utente si possa adattare a stringhe più lunghe del solito.
ru: Он позволяет проверять элементы пользовательского интерфейса, которые не вмещают длинные строки. Переводы на многие языки гораздо длиннее исходного текста, поэтому важно убедиться, что ваш пользовательский интерфейс способен вместить строки большей длины, чем обычно.
ta: நீண்ட சரங்களுக்கு பொருந்த முடியாத இடைமுகம் கூறுகளை சரிபார்க்க இது உங்களை அனுமதிக்கிறது. பல மொழிகளில் மூல உரையை விட மிக நீண்ட மொழிபெயர்ப்புகள் இடம்பெறும், எனவே உங்கள் இடைமுகம் வழக்கத்தை விட நீண்ட சரங்களுக்கு இடமளிக்க முடியும் என்பதை உறுதிப்படுத்துவது முதன்மை.
uk: Це дозволяє перевіряти елементи інтерфейсу користувача, які не можуть вмістити довгі рядки. Багато мов містять набагато довші переклади, ніж вихідний текст, тому важливо переконатися, що ваш інтерфейс користувача може вміщувати довші, ніж зазвичай, рядки.
zh_hans: 它可以让你检查无法容纳长字符串的 UI 元素。许多语言的翻译会比源文本长得多，因此确保你的 UI 能够容纳比平常更长的字符串非常重要。
zh_tw: 它可以讓您檢查無法容納長字串的 UI 元素。許多語言的翻譯都會比原始文字長得多，因此確保您的 UI 能夠容納比平常更長的字串非常重要。

source: It lets you check whether your font contains all the characters required to support various languages. However, since the goal of pseudolocalization is to keep the original strings readable, it's not an effective test for checking whether a font can support :abbr:`CJK (Chinese, Japanese, Korean)` or right-to-left languages.
ga: Ligeann sé duit a sheiceáil an bhfuil na carachtair go léir a theastaíonn chun tacú le teangacha éagsúla i do chló. Mar sin féin, ós rud é gurb é sprioc an pseudolocalization na teaghráin bhunaidh a choinneáil inléite, ní tástáil éifeachtach é chun a sheiceáil an féidir le cló tacú le :abbr:'CJK (Sínis, Seapáinis, Cóiréis)' nó teangacha deas go clé.
it: Permette di verificare se il proprio font contiene tutti i caratteri necessari per supportare diverse lingue. Tuttavia, poiché l'obiettivo della pseudolocalizzazione è mantenere leggibili le stringhe originali, non è un test efficace per verificare se un font supporta :abbr:`CJK (cinese, giapponese, coreano)` o le lingue con scrittura da destra a sinistra.
ru: Он позволяет проверить, содержит ли ваш шрифт все символы, необходимые для поддержки различных языков. Однако, поскольку цель псевдолокализации — сохранить читаемость исходных строк, этот тест неэффективен для проверки поддержки шрифтом :abbr:`CJK (Chinese, Japanese, Korean)` или языков с письмом справа налево.
ta: உங்கள் எழுத்துருவில் பல்வேறு மொழிகளை ஆதரிக்க தேவையான அனைத்து எழுத்துக்களும் உள்ளதா என்பதை சரிபார்க்க இது உங்களை அனுமதிக்கிறது. இருப்பினும், சூடோலோகலைசேசனின் குறிக்கோள் அசல் சரங்களை படிக்கக்கூடியதாக வைத்திருப்பதால், ஒரு எழுத்துரு ஆதரிக்க முடியுமா என்பதைச் சரிபார்க்க இது ஒரு சிறந்த சோதனை அல்ல: ஏபிபிஆர்: `சி.சே.கே (சீன, சப்பானிய, கொரியன்)` அல்லது இடது-இடது மொழிகள்.
uk: Це дозволяє перевірити, чи ваш шрифт містить усі символи, необхідні для підтримки різних мов. Однак, оскільки метою псевдолокалізації є збереження вихідних рядків читабельними, це не є ефективним тестом для перевірки того, чи підтримує шрифт :abbr:`CJK (китайська, японська, корейська)` або мови з написанням справа наліво.
zh_hans: 它可以让你检查你的字体是否包含支持各种语言所需的所有字符。然而，由于伪本地化的目标是保持原始字符串的可读性，因此它并不是检查字体是否支持 :abbr:`CJK（中文、日文、韩文）` 或从右到左语言的有效测试。
zh_tw: 它讓您檢查您的字型是否包含支援各種語言所需的所有字元。然而，由於偽本地化的目標是保持原始字串可讀，因此它不是一個有效的測試，無法檢查字型是否能支援 :abbr:`CJK (中文、日文、韓文)` 或由右至左書寫的語言。

source: The project settings allow you to tune pseudolocalization behavior, so that you can disable parts of it if desired.
ga: Ligeann socruithe an tionscadail duit iompar pseudolocalization a thiúnadh, ionas gur féidir leat codanna de a dhíchumasú más gá.
it: Le impostazioni del progetto consentono di regolare il comportamento della pseudolocalizzazione, in modo da poterne disattivare in parti se lo si desidera.
ru: Настройки проекта позволяют настраивать поведение псевдолокализации, так что при желании можно отключить ее части.
ta: திட்ட அமைப்புகள் சூடோலோகலைசேசன் நடத்தையை இசைக்க உங்களை அனுமதிக்கின்றன, இதன் மூலம் நீங்கள் விரும்பினால் அதன் பகுதிகளை முடக்கலாம்.
uk: Параметри проекту дозволяють вам налаштувати поведінку псевдолокалізації, щоб за бажанням ви могли вимкнути її частини.
zh_hans: 项目设置允许你调整伪本地化行为，以便你可以根据需要禁用它的某些部分。
zh_tw: 專案設定可讓您調整偽本地化行為，以便您可以根據需要停用其部分內容。

source: TranslationServer
ga: Freastalaí Aistriúcháin
ru: TranslationSеrver
ta: மொழிபெயர்ப்பாளர்
uk: Сервер Перекладу
zh_tw: TranslationServer（翻譯伺服器）

source: Godot has a server handling low-level translation management called the :ref:`TranslationServer <class_TranslationServer>`. Translations can be added or removed during runtime; the current language can also be changed at runtime.
it: Godot fornisce un server che gestisce le traduzioni di basso livello chiamato :ref:`TranslationServer <class_TranslationServer>`. Le traduzioni si possono aggiungere o rimuovere durante l'esecuzione; anche la lingua attuale si può cambiare durante l'esecuzione.
ru: В Godot есть сервер, отвечающий за низкоуровневое управление переводами, который называется :ref:`TranslationServer <class_TranslationServer>`. Переводы можно добавлять и удалять во время выполнения; текущий язык также можно изменить во время выполнения.
zh_hans: Godot 中负责底层翻译管理的服务器叫作 :ref:`TranslationServer <class_TranslationServer>`\ 。可以在运行时添加或删除翻译；当前语言也可以在运行时更改。
zh_tw: Godot 具有一個處理底層翻譯管理的伺服器，稱為 :ref:`翻譯伺服器 <class_TranslationServer>`。可以在執行期間新增或移除翻譯；目前的語言也可以在執行期間變更。

source: Bidirectional text and UI Mirroring
ga: Téacs déthreo agus scáthánú UI
it: Testo bidirezionale e rispecchiamento dell'interfaccia
ru: Двунаправленный текст и Зеркалирование Пользовательского Интерфейса
ta: இருதரப்பு உரை மற்றும் இடைமுகம் பிரதிபலிப்பு
uk: Двонаправлений текст і віддзеркалення інтерфейсу користувача
zh_hans: 双向文本和 UI 镜像
zh_tw: 雙向文字和 UI 鏡像

source: Arabic and Hebrew are written from right to left (except for the numbers and Latin words mixed in), and the user interface for these languages should be mirrored as well. In some languages the shape of a glyph changes depending on the surrounding characters.
ga: Scríobhtar an Araibis agus an Eabhrais ó dheis go clé (seachas na huimhreacha agus na focail Laidine measctha isteach), agus ba chóir comhéadan úsáideora na dteangacha seo a scáthánú chomh maith. I roinnt teangacha athraíonn cruth glyph ag brath ar na carachtair máguaird.
it: L'arabo e l'ebraico si scrivono da destra a sinistra (eccetto per i numeri e le parole latine incluse), e anche l'interfaccia utente di queste lingue dovrebbe essere invertita. In alcune lingue, la forma di un glifo cambia a seconda dei caratteri circostanti.
ru: В Арабском языке и Иврите буквы пишутся справа налево (за исключением цифр и латинских слов), и пользовательский интерфейс для этих языков также должен быть зеркальным. В некоторых языках форма глифа меняется в зависимости от окружающих символов.
ta: அரபு மற்றும் எபிரேய மொழிகள் வலமிருந்து இடமாக எழுதப்பட்டுள்ளன (எண்கள் மற்றும் லத்தீன் சொற்களைத் தவிர), மேலும் இந்த மொழிகளுக்கான பயனர் இடைமுகமும் பிரதிபலிக்க வேண்டும். சில மொழிகளில் சுற்றியுள்ள எழுத்துக்களைப் பொறுத்து கிளிஃபின் வடிவம் மாறுகிறது.
uk: Арабська та іврит пишуться справа наліво (за винятком змішаних цифр і латинських слів), і інтерфейс користувача для цих мов також має бути дзеркальним. У деяких мовах форма гліфа змінюється залежно від навколишніх символів.
zh_hans: 阿拉伯语和希伯来语是从右到左书写的（除了混合的数字和拉丁单字），这些语言的用户界面也应该是镜像的。在某些语言中，字形的形状会根据周围的字符而变化。
zh_tw: 阿拉伯語和希伯來語是從右到左書寫的（除了混合的數字和拉丁單字），這些語言的使用者介面也應該是鏡像的。在某些語言中，字形的形狀會根據周圍的字元而變化。

source: Support for bidirectional writing systems and UI mirroring is transparent, you don't usually need to change anything or have any knowledge of the specific writing system.
ga: Tá tacaíocht do chórais scríbhneoireachta déthreo agus scáthánú UI trédhearcach, ní gá duit aon rud a athrú de ghnáth nó aon eolas a bheith agat ar an gcóras scríbhneoireachta ar leith.
it: Il supporto per i sistemi di scrittura bidirezionali e il rispecchiamento dell'interfaccia utente è trasparente: solitamente non è necessario apportare modifiche o avere alcuna conoscenza di un particolare sistema di scrittura.
ru: Поддержка двунаправленных систем письма и зеркалирования пользовательского интерфейса прозрачна, обычно вам не нужно ничего менять или иметь какие-либо знания о конкретной системе письма.
ta: இருதரப்பு எழுதும் முறைகள் மற்றும் இடைமுகம் பிரதிபலிப்புக்கான உதவி வெளிப்படையானது, நீங்கள் வழக்கமாக எதையும் மாற்றத் தேவையில்லை அல்லது குறிப்பிட்ட எழுத்து முறையைப் பற்றி எந்த அறிவும் இல்லை.
uk: Підтримка двонаправлених систем письма та віддзеркалення інтерфейсу користувача є прозорою, зазвичай вам не потрібно нічого змінювати або знати про конкретну систему письма.
zh_hans: 对双向书写系统和 UI 镜像的支持是透明的，你通常不需要更改任何内容或了解特定的书写系统。
zh_tw: 對雙向書寫系統和 UI 鏡像的支援是透明的，您通常不需要更改任何內容或了解特定書寫系統。

source: For RTL languages, Godot will automatically do the following changes to the UI:
ga: Maidir le teangacha RTL, déanfaidh Godot na hathruithe seo a leanas go huathoibríoch ar an UI:
it: Per le lingue RTL, Godot apporterà automaticamente le seguenti modifiche all'interfaccia utente:
ru: Для языков с написанием справа налево Godot автоматически внесет следующие изменения в пользовательский интерфейс:
ta: ஆர்டிஎல் மொழிகளைப் பொறுத்தவரை, கோடோட் தானாகவே இடைமுகம் இல் பின்வரும் மாற்றங்களைச் செய்யும்:
uk: Для мов RTL Godot автоматично внесе такі зміни в інтерфейс користувача:
zh_hans: 对于 RTL（从右至左）语言，Godot 会自动对 UI 进行以下调整：
zh_tw: 對於 RTL（從右至左）語言，Godot 會自動對 UI 進行以下調整：

source: Mirrors left/right anchors and margins.
ga: Scátháin ar chlé / ar dheis anchors agus corrlaigh.
it: Rispecchia le ancore e i margini sinistro/destro.
ru: Mirrors отображает левые/правые якоря и поля.
ta: கண்ணாடிகள் இடது/வலது நங்கூரங்கள் மற்றும் விளிம்புகள்.
uk: Дзеркальні ліві/праві прив’язки та поля.
zh_hans: 镜像左右锚点和边距。
zh_tw: 鏡像左右錨點和邊距。

source: Swaps left and right text alignment.
ga: Babhtálacha ailíniú téacs ar chlé agus ar dheis.
it: Inverte l'allineamento del testo a sinistra e a destra.
ru: Меняет местами выравнивание текста слева и справа.
ta: இடது மற்றும் வலது உரை சீரமைப்பை மாற்றுகிறது.
uk: Міняє місцями вирівнювання тексту по лівому та правому краю.
zh_hans: 交换文本的左对齐和右对齐。
zh_tw: 交換文字的左對齊和右對齊。

source: Mirrors horizontal order of the child controls in the containers, and items in Tree/ItemList controls.
ga: Scátháin ord cothrománach rialuithe an linbh sna coimeádáin, agus míreanna i rialuithe Crann / Mírliosta.
it: Rispecchia l'ordine orizzontale dei controlli figlio nei contenitori, e degli elementi nei controlli Tree/ItemList.
ru: Mirrors отображает горизонтальный порядок дочерних элементов управления в контейнерах и элементов в элементах управления Tree/ItemList.
ta: கொள்கலன்களில் குழந்தையின் கிடைமட்ட வரிசையையும், மரம்/உருப்படி பட்டியல் கட்டுப்பாடுகளிலும் உள்ள பொருட்களின் கிடைமட்ட வரிசை.
uk: Віддзеркалює горизонтальний порядок дочірніх елементів керування в контейнерах і елементи в елементах керування Tree/ItemList.
zh_hans: 镜像容器中子控件的水平顺序以及 Tree/ItemList 控件中项目的水平顺序。
zh_tw: 鏡像容器中子控制項的水平順序以及 Tree/ItemList 控制項中專案的水平順序。

source: Uses mirrored order of the internal control elements (e.g. OptionButton dropdown button, checkbox alignment, List column order, Tree item icons and connecting line alignment, e.t.c.), in some cases mirrored controls use separate theme styles.
ga: Úsáideann an páiste ord scáthánaithe na n-eilimintí rialaithe inmheánaigh (m.sh. cnaipe anuas OptionButton, ailíniú ticbhosca, ordú colún Liosta, deilbhíní mír crann agus ailíniú líne nasctha, e.t.c.), i gcásanna áirithe úsáideann rialuithe scáthánaithe stíleanna téama ar leith.
it: Utilizza l'ordine rispecchiato degli elementi interni dei controlli (ad esempio, il pulsante a discesa in OptionButton, l'allineamento nelle casella di spunta, l'ordine delle colonne in List, l'allineamento di entrambe le icone degli elementi e le linee di collegamento in Tree, ecc.); in alcuni casi i controlli rispecchiati utilizzano stili di tema separati.
ru: Использует зеркальный порядок внутренних элементов управления (например, кнопка раскрывающегося списка OptionButton, выравнивание флажков, порядок столбцов списка, значки элементов дерева и выравнивание соединительных линий и т. д.), в некоторых случаях зеркальные элементы управления используют отдельные стили темы.
ta: உள் கட்டுப்பாட்டு கூறுகளின் பிரதிபலித்த வரிசையைப் பயன்படுத்துகிறது (எ.கா. விருப்பப்படி கீழ்தோன்றும் பொத்தானை, தேர்வுப்பெட்டி சீரமைப்பு, பட்டியல் நெடுவரிசை ஒழுங்கு, மர உருப்படி சின்னங்கள் மற்றும் இணைக்கும் வரி சீரமைப்பு, E.T.C.), சில சந்தர்ப்பங்களில் பிரதிபலித்த கட்டுப்பாடுகள் தனித்தனி கருப்பொருள் பாணிகளைப் பயன்படுத்துகின்றன.
uk: Використовує дзеркальний порядок внутрішніх елементів керування (наприклад, кнопка спадного списку OptionButton, вирівнювання прапорців, порядок стовпців у списку, піктограми елементів дерева та вирівнювання сполучних ліній тощо), у деяких випадках дзеркальні елементи керування використовують окремі стилі теми.
zh_hans: 控件内部元素使用镜像顺序（例如 OptionButton 的下拉按钮、勾选框的位置、列表框列的顺序、Tree 项目的图标和连接线的位置等），某些镜像的控件会使用单独的主题样式。
zh_tw: 控制項內部元素使用鏡像順序（例如 OptionButton 的下拉按鈕、單選框的位置、列表方塊列的順序、Tree 專案的圖示和連接線的位置等），某些鏡像的控制項會使用單獨的主題樣式。

source: Coordinate system is not mirrored, and non-UI nodes (sprites, e.t.c) are not affected.
ga: Ní scáthánaítear an córas comhordanáidí, agus ní dhéantar difear do nóid neamh-UI (sprites, e.t.c).
it: Il sistema di coordinate non è rispecchiato e i nodi non dell'UI (sprite, ecc.) non sono influenzati.
ru: Система координат не зеркальна, и узлы, не относящиеся к пользовательскому интерфейсу (спрайты и т. д.), не затрагиваются.
ta: ஒருங்கிணைப்பு அமைப்பு பிரதிபலிக்கவில்லை, மற்றும் யுஐ அல்லாத முனைகள் (ச்ப்ரைட்ச், ஈ.டி.சி) பாதிக்கப்படவில்லை.
uk: Система координат не віддзеркалюється, і вузли, що не належать до інтерфейсу користувача (спрайти тощо), не впливають.
zh_hans: 坐标系不会镜像，非 UI 节点（精灵等）不受影响。
zh_tw: 坐標系不會鏡像，非 UI 節點（精靈等）不受影響。

source: It is possible to override text and control layout direction by using the following control properties:
ga: Is féidir téacs a shárú agus treo leagan amach a rialú trí na hairíonna rialaithe seo a leanas a úsáid:
it: È possibile sovrascrivere la direzione del testo e del layout in un controllo attraverso le seguenti proprietà:
ru: Можно переопределить текст и управлять направлением макета, используя следующие свойства элемента управления:
ta: பின்வரும் கட்டுப்பாட்டு பண்புகளைப் பயன்படுத்துவதன் மூலம் உரை மற்றும் தளவமைப்பு திசையை மேலெழுத முடியும்:
uk: Можна змінити текст і керувати напрямком макета за допомогою таких властивостей елемента керування:
zh_hans: 可以使用下列控件属性来覆盖文字和控件布局方向：
zh_tw: 可以使用下列控制項屬性來覆寫文字和控制項佈局方向：
