Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/internationalizing_games.po
Languages: ga, it, ko, ru, ta, uk, zh_hans, zh_tw

source: Some controls, such as :ref:`Button <class_Button>` and :ref:`Label <class_Label>`, will automatically fetch a translation if their text matches a translation key. For example, if a label's text is "MAIN_SCREEN_GREETING1" and that key exists in the current translation, then the text will automatically be translated.
ga: Gheobhaidh roinnt rialtáin, mar shampla :ref:`Button <class_Button>` agus :ref:`Lipéad <class_Label>`, aistriúchán go huathoibríoch má mheaitseálann a dtéacs eochair aistriúcháin. Mar shampla, más é "MAIN_SCREEN_GREETING1" téacs lipéad agus go bhfuil an eochair sin san aistriúchán reatha, aistreofar an téacs go huathoibríoch.
it: Alcuni controlli, come :ref:`Button <class_Button>` e :ref:`Label <class_Label>`, recuperano automaticamente una traduzione se il loro testo corrisponde a una chiave di traduzione. Ad esempio, se il testo di un'etichetta è "MAIN_SCREEN_GREETING1" e quella chiave esiste nella traduzione attuale, il testo verrà tradotto automaticamente.
ko: :ref:`Button <class_Button>`\ 과 :ref:`Label <class_Label>`\ 과 같은 일부 컨트롤은 만약 그 텍스트가 번역 키와 일치하면 자동으로 번역을 가져옵니다. 예로 들어, 레이블의 텍스트가 "MAIN_SCREEN_GREETING1"이고 해당 키가 현재 번역에 존재한다면, 텍스트는 자동으로 번역됩니다.
ru: Некоторые элементы управления, такие как :ref:`Button <class_Button>` и :ref:`Label <class_Label>`, автоматически получают перевод, если их текст соответствует ключу перевода. Например, если текст метки имеет значение "MAIN_SCREEN_GREETING1" и этот ключ существует в текущем переводе, то текст будет автоматически переведен.
ta: சில கட்டுப்பாடுகள், போன்றவை: ref: `பொத்தான் <class_button>` மற்றும்: Ref: `லேபிள் <class_label>`, அவற்றின் உரை மொழிபெயர்ப்பு விசையுடன் பொருந்தினால் தானாகவே மொழிபெயர்ப்பைப் பெறும். எடுத்துக்காட்டாக, ஒரு லேபிளின் உரை "main_creen_greeting1" மற்றும் தற்போதைய மொழிபெயர்ப்பில் அந்த விசை இருந்தால், உரை தானாக மொழிபெயர்க்கப்படும்.
uk: Деякі елементи керування, такі як :ref:`Кнопка <class_Button>` і :ref:`Мітка <class_Label>`, автоматично отримуватимуть переклад, якщо їх текст відповідає ключу перекладу. Наприклад, якщо текст мітки є "MAIN_SCREEN_GREETING1" і цей ключ існує в поточному перекладі, то текст буде автоматично перекладений.
zh_hans: 对于 :ref:`Button <class_Button>`\ 、\ :ref:`Label <class_Label>` 等部分控件，如果它们的文本与某个翻译键名相匹配，则将自动获取翻译内容。例如，如果标签的文本为“MAIN_SCREEN_GREETING1”，并且该键存在于当前翻译中，则该文本将被自动翻译。
zh_tw: 一些控制項，例如 :ref:`Button <class_Button>` 和 :ref:`Label <class_Label>`，如果它們的文字與一個翻譯鍵值相配對，將自動獲取翻譯內容。例如，如果一個標籤的文字是“MAIN_SCREEN_GREETING1”並且該鍵值存在於目前的翻譯中，那麼該文字將被自動翻譯。

source: This automatic translation behavior may be undesirable in certain cases. For instance, when using a Label to display a player's name, you most likely don't want the player's name to be translated if it matches a translation key. To disable automatic translation on a specific node, disable **Localization > Auto Translate** in the inspector.
ga: D’fhéadfadh an t-iompar uathoibríoch aistriúcháin seo a bheith neamh-inmhianaithe i gcásanna áirithe. Mar shampla, agus Lipéad á úsáid agat chun ainm imreora a thaispeáint, is dócha nach dteastaíonn uait go n-aistreofaí ainm an imreora má mheaitseálann sé eochair aistriúcháin. Chun aistriúchán uathoibríoch ar nód ar leith a dhíchumasú, díchumasaigh **Localization > Auto Translate** sa chigire.
it: Questo comportamento di traduzione automatica potrebbe essere indesiderato in certi casi. Ad esempio, quando si utilizza un'etichetta per visualizzare il nome di un giocatore, molto probabilmente non si desidera che il nome del giocatore venga tradotto se corrisponde a una chiave di traduzione. Per disabilitare la traduzione automatica su un nodo specifico, disattivare **Localizzazione > Traduzione automatica** nell'ispettore.
ko: 이 자동 번역은 특정 상황에서는 바람직하지 않을 수 있습니다. 예를 들어, 레이블을 사용하여 플레이어의 이름을 표시할 때, 플레이어의 이름이 번역 키와 일치하면 번역되는 것을 원하지 않을 것입니다. 특정 노드에서 자동 번역을 비활성화하려면 인스펙터에서 **현지화 > 자동 번역**\ 을 비활성화하세요.
ru: Такое автоматическое поведение перевода может быть нежелательным в некоторых случаях. Например, при использовании узла Label для отображения имени игрока вы, скорее всего, не захотите, чтобы имя игрока переводилось, если оно соответствует ключу перевода. Чтобы отключить автоматический перевод на определенном узле, отключите «Локализация» > «Автоперевод» в инспекторе.
ta: இந்த தானியங்கி மொழிபெயர்ப்பு நடத்தை சில சந்தர்ப்பங்களில் விரும்பத்தகாததாக இருக்கலாம். உதாரணமாக, ஒரு வீரரின் பெயரைக் காண்பிக்க ஒரு லேபிளைப் பயன்படுத்தும் போது, மொழிபெயர்ப்பு விசையுடன் பொருந்தினால் பிளேயரின் பெயர் மொழிபெயர்க்கப்படுவதை நீங்கள் விரும்புவதில்லை. ஒரு குறிப்பிட்ட முனையில் தானியங்கி மொழிபெயர்ப்பை முடக்க, இன்ச்பெக்டரில் ** உள்ளூராக்கல்> ஆட்டோ மொழிபெயர்ப்பு ** ஐ முடக்கு.
uk: Така поведінка автоматичного перекладу може бути небажаною у певних випадках. Наприклад, якщо ви використовуєте мітку для відображення імені гравця, ви, найімовірніше, не хочете, щоб ім'я гравця перекладалося, якщо воно збігається з клавішею перекладу. Щоб вимкнути автоматичний переклад на певному вузлі, вимкніть **Локалізація > Автоматичний переклад** в інспекторі.
zh_hans: 这种自动翻译行为在某些情况下可能是不可取的。例如，当使用 Label 来显示玩家的名字时，如果玩家的名字与翻译键相匹配，你很可能不希望进行翻译。要禁用某个节点的自动翻译，请在检查器中禁用\ **Localization > Auto Translate**\ （本地化 > 自动翻译）。
zh_tw: 這種自動翻譯行為在某些情況下可能是不可取的。例如，當使用 Label 來顯示玩家的名字時，如果玩家的名字與翻譯鍵相配對，你很可能不希望進行翻譯。要禁用某個節點的自動翻譯，請在屬性檢視器中禁用**Localization > Auto Translate**（當地語系化 > 自動翻譯）。

source: In code, the :ref:`Object.tr() <class_Object_method_tr>` function can be used. This will just look up the text in the translations and convert it if found:
ga: Sa chód, is féidir an fheidhm :ref:`Object.tr() <class_Object_method_tr>` a úsáid. Ní dhéanfaidh sé seo ach breathnú ar an téacs sna haistriúcháin agus é a thiontú má aimsítear é:
it: Nel codice, è possibile utilizzare la funzione :ref:`Object.tr() <class_Object_method_tr>`. Questa funzione recupererà il testo nelle traduzioni e, se trovato, lo convertirà:
ko: 코드에서는 :ref:`Object.tr() <class_Object_method_tr>` 함수를 사용될 수 있습니다. 이것은 번역에서 텍스트를 찾아 찾으면 이를 변환합니다.
ru: В коде можно использовать функцию :ref:`Object.tr() <class_Object_method_tr>`. Она будет просто искать текст в переводах и преобразовывать его, если он найден:
ta: குறியீட்டில், தி: ref: `object.tr () <class_object_method_tr>` செயல்பாட்டைப் பயன்படுத்தலாம். இது மொழிபெயர்ப்புகளில் உரையைப் பார்த்து, கிடைத்தால் அதை மாற்றும்:
uk: У коді можна використовувати функцію :ref:`Object.tr() <class_Object_method_tr>`. Вона просто буде шукати текст у перекладах і конвертувати його, якщо він знайдений:
zh_hans: 在代码中，可以使用 :ref:`Object.tr() <class_Object_method_tr>` 函数。这将只在翻译中查找文本，并在找到后进行转换：
zh_tw: 在程式碼中, 可以使用 :ref:`Object.tr() <class_Object_method_tr>` 函式. 這將只是在翻譯中搜尋文字, 如果找到的話就進行轉換:

source: If no text is displayed after changing the language, try to use a different font. The default project font only supports a subset of the Latin-1 character set, which cannot be used to display languages like Russian or Chinese.
ga: Mura dtaispeántar aon téacs tar éis an teanga a athrú, déan iarracht cló difriúil a úsáid. Ní thacaíonn cló réamhshocraithe an tionscadail ach le fo-thacar den tacar carachtair Laidin-1, nach féidir a úsáid chun teangacha cosúil le Rúisis nó Sínis a thaispeáint.
it: Se nessun testo è visualizzato dopo aver cambiato lingua, prova a utilizzare un font diverso. Il font predefinito del progetto supporta solo un sottoinsieme dei caratteri Latin-1, che non consente di visualizzare lingue come il russo o il cinese.
ru: Если после смены языка текст не отображается, попробуйте использовать другой шрифт. Шрифт проекта по умолчанию поддерживает только подмножество набора символов Latin-1, который нельзя использовать для отображения таких языков, как русский или китайский.
ta: மொழியை மாற்றிய பின் எந்த உரையும் காட்டப்படாவிட்டால், வேறு எழுத்துருவைப் பயன்படுத்த முயற்சிக்கவும். இயல்புநிலை திட்ட எழுத்துரு லத்தீன் -1 எழுத்து தொகுப்பின் துணைக்குழுவை மட்டுமே ஆதரிக்கிறது, இது ரச்ய அல்லது சீன போன்ற மொழிகளைக் காண்பிக்க பயன்படுத்த முடியாது.
uk: Якщо після зміни мови текст не відображається, спробуйте використати інший шрифт. Шрифт проекту за замовчуванням підтримує лише підмножину набору символів Latin-1, який не можна використовувати для відображення таких мов, як російська чи китайська.
zh_hans: 如果更改语言后不显示任何文字，请尝试换一个字体。默认项目字体仅支持 Latin-1 字符集的子集，无法用于显示俄语、汉语等文字。
zh_tw: 如果更改語言後不顯示任何文字，請嘗試換一個字形。預設專案字形僅支援 Latin-1 字元集的子集，無法用於顯示俄語、漢語等文字。

source: A good resource for multilingual fonts is `Noto Fonts <https://www.google.com/get/noto/>`__. Make sure to download the correct variation if you're using a less common language.
ga: Acmhainn mhaith le haghaidh clónna ilteangacha is ea `Noto Fonts <https://www.google.com/get/noto/>`__. Déan cinnte an t-athrú ceart a íoslódáil má tá teanga nach bhfuil chomh coitianta in úsáid agat.
it: Una buona risorsa per font multilingue è `Noto Fonts <https://www.google.com/get/noto/>`__. Assicurati di scaricare la variazione adeguata se utilizzi una lingua meno comune.
ru: Хорошим ресурсом по многоязычным шрифтам является `Noto Fonts <https://www.google.com/get/noto/>`__. Обязательно загрузите правильный вариант, если вы используете менее распространенный язык.
ta: பன்மொழி எழுத்துருக்களுக்கான ஒரு நல்ல சான்று `நோட்டோ எழுத்துருக்கள் <https://www.google.com/get/noto/> __. நீங்கள் குறைவான பொதுவான மொழியைப் பயன்படுத்துகிறீர்கள் என்றால் சரியான மாறுபாட்டைப் பதிவிறக்குவதை உறுதிசெய்க.
uk: Хорошим ресурсом для багатомовних шрифтів є `Noto Fonts <https://www.google.com/get/noto/>`__. Переконайтеся, що ви завантажили правильний варіант, якщо ви використовуєте менш поширену мову.
zh_hans: `Noto Fonts <https://www.google.com/get/noto/>`__ 是一系列不错的多语言字体资源。如果你使用的是不太常见的语言，请确保下载正确的变体。
zh_tw: 多語言字形的一個很好的資源是「Noto Fonts <https://www.google.com/get/noto/>」。如果您使用的是不太常見的語言，請確保下載正確的變體。

source: Once you've downloaded the font, load the TTF file into a DynamicFont resource and use it as a custom font of your Control node. For better reusability, associate a new a Theme resource to your root Control node and define the DynamicFont as the Default Font in the theme.
ga: Nuair a bheidh an cló íoslódáilte agat, luchtaigh an comhad TTF isteach in acmhainn DynamicFont agus bain úsáid as mar chló saincheaptha de do nód Rialaithe. Le haghaidh athúsáidteacht níos fearr, ceangail acmhainn nua Téama le do nód Rialaithe fréimhe agus sainmhínigh an DynamicFont mar an Cló Réamhshocraithe sa téama.
it: Una volta scaricato il font, carica il file TTF in una risorsa DynamicFont e usalo come font personalizzato del tuo nodo Control. Per riusarlo meglio, associa una nuova risorsa Theme al tuo nodo Control radice e definisci il DynamicFont come font predefinito nel tema.
ru: После загрузки шрифта загрузите TTF-файл в ресурс DynamicFont и используйте его в качестве пользовательского шрифта вашего узла Control. Для удобства повторного использования свяжите новый ресурс Theme с корневым узлом Control и определите DynamicFont как шрифт по умолчанию в теме.
ta: நீங்கள் எழுத்துருவை பதிவிறக்கம் செய்தவுடன், TTF கோப்பை டைனமிக்ஃபாண்ட் வளத்தில் ஏற்றி, உங்கள் கட்டுப்பாட்டு முனையின் தனிப்பயன் எழுத்துருவாகப் பயன்படுத்தவும். சிறந்த மறுபயன்பாட்டிற்கு, உங்கள் ரூட் கட்டுப்பாட்டு முனையுடன் ஒரு புதிய கருப்பொருள் வளத்தை தொடர்புபடுத்தி, டைனமிக்ஃபாண்டை கருப்பொருளில் இயல்புநிலை எழுத்துருவாக வரையறுக்கவும்.
uk: Завантаживши шрифт, завантажте файл TTF у ресурс DynamicFont і використовуйте його як спеціальний шрифт вашого вузла керування. Для кращого повторного використання зв’яжіть новий ресурс теми з кореневим вузлом керування та визначте DynamicFont як шрифт за замовчуванням у темі.
zh_hans: 下载字体后，将 TTF 文件加载到 DynamicFont 资源中，并将其用作 Control 节点的自定义字体。为了获得更好的可重用性，请将新的主题资源关联到根 Control 节点，并将 DynamicFont 定义为主题中的默认字体。
zh_tw: 下載字形後，將 TTF 檔案載入到 DynamicFont 資源中，並將其用作控制節點的自訂字形。為了獲得更好的可重複使用性，請將新的主題資源關聯到根控制節點，並將 DynamicFont 定義為主題中的預設字形。

source: Placeholders
ga: Sealbhóirí áit
it: Segnaposto
ko: 자리표시자
ru: Placeholders (Заполнители)
ta: இடம் வைத்திருப்பவர்கள்
uk: Заповнювачі
zh_hans: 占位符
zh_tw: 佔位符

source: To feature placeholders in your translated strings, use :ref:`doc_gdscript_printf` or the equivalent feature in C#. This lets translators move the location of the placeholder in the string freely, which allows translations to sound more natural. Named placeholders with the ``String.format()`` function should be used whenever possible, as they also allow translators to choose the *order* in which placeholders appear:
ga: Chun sealbhóirí áite a chur i do teaghráin aistrithe, bain úsáid as :ref:'doc_gdscript_printf' nó an ghné choibhéiseach i C #. Ligeann sé seo d'aistritheoirí suíomh an áitshealbhóra sa tsreang a bhogadh gan bhac, rud a ligeann d'aistriúcháin fuaim níos nádúrtha a dhéanamh. Ba cheart sealbhóirí áite ainmnithe leis an bhfeidhm ''String.format()'' a úsáid nuair is féidir, toisc go gceadaíonn siad d'aistritheoirí an *order *a roghnú ina bhfuil sealbhóirí áite le feiceáil:
it: Per includere i segnaposto nelle stringhe tradotte, usa :ref:`doc_gdscript_printf` o la funzionalità equivalente in C#. Ciò consente ai traduttori di spostare liberamente la posizione dei segnaposto nella stringa, rendendo le traduzioni più naturali. È consigliato utilizzare i segnaposto denominati tramite la funzione ``String.format()`` ove possibile, poiché consentono anche ai traduttori di scegliere l'*ordine* in cui appaiono i segnaposto:
ru: Чтобы добавить особенные заполнители в переведённые строки, используйте функцию :ref:`doc_gdscript_printf` или эквивалентную функцию в C#. Это позволяет переводчикам свободно перемещать местоположение заполнителя в строке, что делает перевод более естественным. По возможности следует использовать именованные заполнители с функцией ``String.format()``, поскольку они также позволяют переводчикам выбирать *порядок* отображения заполнителей:
ta: உங்கள் மொழிபெயர்க்கப்பட்ட சரங்களில் இருப்பிடங்களை இடம்பெற, பயன்படுத்தவும்: குறிப்பு: `doc_gdscript_printf` அல்லது c#இல் சமமான நற்பொருத்தம். இது மொழிபெயர்ப்பாளர்களை பிளேச்ஓல்டரின் இருப்பிடத்தை சரத்தில் சுதந்திரமாக நகர்த்த அனுமதிக்கிறது, இது மொழிபெயர்ப்புகளை மிகவும் இயற்கையாக ஒலிக்க அனுமதிக்கிறது. `` String.format () `` செயல்பாட்டைக் கொண்ட பெயரிடப்பட்ட பிளேச்ஓல்டர்கள் முடிந்தவரை பயன்படுத்தப்பட வேண்டும், ஏனெனில் அவர்கள் மொழிபெயர்ப்பாளர்களை * ஆர்டரை * தேர்வு செய்ய அனுமதிக்கிறார்கள், இதில் எந்த பிளேச்ஓல்டர்கள் தோன்றும்:
uk: Щоб додати заповнювачі у ваші перекладені рядки, використовуйте :ref:`doc_gdscript_printf` або еквівалентну функцію в C#. Це дозволяє перекладачам вільно переміщувати місце заповнювача в рядку, що дозволяє перекладам звучати більш природно. По можливості слід використовувати іменовані заповнювачі з функцією ``String.format()``, оскільки вони також дозволяють перекладачам вибирати *порядок*, у якому з’являються заповнювачі:
zh_hans: 若要在翻译的字符串中使用占位符，请使用 :ref:`doc_gdscript_printf` 或 C# 中的等效功能。这使得翻译者可以自由移动字符串中占位符的位置，使得翻译听起来更自然。为了允许翻译人员决定占位符出现的\ *顺序*\ ，应尽可能使用搭配使用带命名的占位符和 ``String.format()`` 的函数：
zh_tw: 若要在您的翻譯字串中使用占位符，請使用 :ref:`doc_gdscript_printf` 或 C# 中的等效功能。這讓翻譯者可以在字串中自由地移動占位符的位置，使得翻譯聽起來更自然。應盡可能使用具名占位符搭配 ``String.format()`` 函式，因為它們也讓翻譯者能夠選擇占位符出現的順序：

source: Translation contexts
ga: Comhthéacsanna aistriúcháin
it: Contesti di traduzione
ko: 번역 맥락
ru: Translation contexts (Контексты перевода)
ta: மொழிபெயர்ப்பு சூழல்கள்
uk: Контексти перекладу
zh_hans: 翻译上下文
zh_tw: 翻譯語境

source: If you're using plain English as source strings (rather than message codes ``LIKE_THIS``), you may run into ambiguities when you have to translate the same English string to different strings in certain target languages. You can optionally specify a *translation context* to resolve this ambiguity and allow target languages to use different strings, even though the source string is identical:
ga: Má tá Béarla simplí á úsáid agat mar théada foinseacha (seachas cóid teachtaireachta ''LIKE_THIS''), d'fhéadfá rith isteach i débhríonna nuair a chaithfidh tú an teaghrán Béarla céanna a aistriú go teaghráin éagsúla i sprioctheangacha áirithe. Is féidir leat *comhthéacs aistriúcháin *a shonrú go roghnach chun an débhríocht seo a réiteach agus ligean do sprioctheangacha teaghráin éagsúla a úsáid, cé go bhfuil an teaghrán foinseach comhionann:
it: Se si utilizza l'inglese chiaro come stringhe originali (anziché i codici di messaggi ``COME_QUESTO``), si potrebbero verificare ambiguità quando la stessa stringa inglese si deve tradurre in stringhe diverse in certe lingue di destinazione. È possibile specificare facoltativamente un *contesto di traduzione* per risolvere questa ambiguità e consentire alle lingue di destinazione di utilizzare stringhe diverse, anche se la stringa originale è identica:
ru: Если вы используете обычный английский язык в качестве исходных строк (а не коды сообщений ``LIKE_THIS``), вы можете столкнуться с неоднозначностями при переводе одной и той же английской строки в разные строки на определённых целевых языках. При желании вы можете указать *контекст перевода*, чтобы устранить эту неоднозначность и разрешить целевым языкам использовать разные строки, даже если исходная строка идентична:
ta: நீங்கள் எளிய ஆங்கிலத்தை மூல சரங்களாகப் பயன்படுத்துகிறீர்கள் என்றால் (செய்தி குறியீடுகளை விட `` போன்ற_தீச்``), அதே ஆங்கில சரத்தை சில இலக்கு மொழிகளில் வெவ்வேறு சரங்களுக்கு மொழிபெயர்க்க வேண்டியிருக்கும் போது நீங்கள் தெளிவற்ற தன்மைகளுக்குள் ஓடலாம். இந்த தெளிவின்மையைத் தீர்க்க * மொழிபெயர்ப்பு சூழலைப் பயன்படுத்த அனுமதிக்கவும், மூல சரம் ஒரே மாதிரியாக இருந்தாலும், இலக்கு மொழிகளை வெவ்வேறு சரங்களைப் பயன்படுத்த அனுமதிக்கவும் நீங்கள் விருப்பமாக ஒரு * மொழிபெயர்ப்பு சூழலைக் குறிப்பிடலாம்:
uk: Якщо ви використовуєте звичайну англійську мову як вихідні рядки (а не коди повідомлень ``LIKE_THIS``), ви можете зіткнутися з двозначностями, коли вам доведеться перекладати той самий англійський рядок різними рядками на певних цільових мовах. Ви можете додатково вказати *контекст перекладу*, щоб вирішити цю двозначність і дозволити цільовим мовам використовувати різні рядки, навіть якщо вихідний рядок ідентичний:
zh_hans: 如果你使用普通的英文作为源字符串（而不是类似于 ``LIKE_THIS`` 的消息代码），那么就有可能会遇到歧义的情况，同一个英文字符串可能需要在某些目标语言中翻译为不同的字符串。你可以通过指定可选的\ *翻译上下文*\ 来消除歧义，即便源字符串是相同的，也能够让目标语言能够使用不同的字符串：
zh_tw: 如果你使用普通的英文所謂來源字串（而不是類似於 ``LIKE_THIS`` 的消息程式碼），那麼就有可能會遇到歧義的情況，同一個英文字串可能需要在某些目的語言中翻譯為不同的字串。你可以通過指定可選的*翻譯本文*來消除歧義，即便原始字串是相同的，也能夠讓目的語言能夠使用不同的字串：

source: Pluralization
ga: Iolrachas
it: Pluralizzazione
ko: 복수형
ru: Pluralization (Множественность)
ta: பன்மைமயமாக்கல்
uk: Множинність
zh_hans: 复数
zh_tw: 複數化

source: Most languages require different strings depending on whether an object is in singular or plural form. However, hardcoding the "is plural" condition depending on whether there is more than 1 object is not valid in all languages.
ga: Bíonn teaghráin dhifriúla de dhíth ar fhormhór na dteangacha ag brath ar cibé an bhfuil réad i bhfoirm uatha nó iolra. Mar sin féin, hardcoding an coinníoll "is iolra" ag brath ar cibé an bhfuil níos mó ná 1 réad nach bhfuil bailí i ngach teanga.
it: La maggior parte delle lingue richiede stringhe diverse a seconda che un oggetto sia in forma singolare o plurale. Tuttavia, codificare la condizione "è plurale" in modo rigido a seconda che ci sia più di un oggetto non è buono in tutte le lingue.
ru: В большинстве языков требуются разные строки в зависимости от того, находится ли объект в единственном или множественном числе. Однако жёсткое кодирование условия "является объектом множественного числа" в зависимости от наличия более одного объекта недопустимо во всех языках.
ta: ஒரு பொருள் ஒருமை அல்லது பன்மை வடிவத்தில் உள்ளதா என்பதைப் பொறுத்து பெரும்பாலான மொழிகளுக்கு வெவ்வேறு சரங்கள் தேவைப்படுகின்றன. இருப்பினும், 1 க்கும் மேற்பட்ட பொருள் உள்ளதா என்பதைப் பொறுத்து "பன்மை" நிலையை ஆர்ட்கோடிங் செய்வது எல்லா மொழிகளிலும் செல்லுபடியாகாது.
uk: Більшість мов вимагають різних рядків залежно від форми об’єкта в однині чи множині. Однак жорстке кодування умови "є множини" залежно від того, чи існує більше ніж 1 об’єкт, не є дійсним для всіх мов.
zh_hans: 很多语言会根据对象的单复数使用不同的字符串。但是把“是否为复数”的条件硬编码为“对象数量是否大于 1 ”并不是对所有语言都有效。
zh_tw: 多數語言會根據單數或複數而使用不同的字串。不過，單純以物件數量是否大於 1 來判斷是否為複數，對所有語言都不適用。

source: Some languages have more than two plural forms, and the rules on the number of objects required for each plural form vary. Godot offers support for *pluralization* so that the target locales can handle this automatically.
ga: Tá níos mó ná dhá fhoirm iolra ag roinnt teangacha, agus athraíonn na rialacha maidir le líon na réad a theastaíonn do gach foirm iolra. Cuireann Godot tacaíocht ar fáil do *pluralization *ionas gur féidir leis na daoine áitiúla sprioc é seo a láimhseáil go huathoibríoch.
it: Alcune lingue hanno più di due forme plurali e le regole sul numero di oggetti richiesti per ciascuna forma plurale variano. Godot offre supporto per la *pluralizzazione* in modo che le localizzazioni finali possano gestirle automaticamente.
ru: В некоторых языках существует более двух форм множественного числа, и правила относительно количества объектов, необходимых для каждой формы, различаются. Godot поддерживает *образование множественного числа (pluralization)*, чтобы целевые языки могли обрабатывать это автоматически.
ta: சில மொழிகளில் இரண்டு பன்மை வடிவங்கள் உள்ளன, மேலும் ஒவ்வொரு பன்மை வடிவத்திற்கும் தேவையான பொருட்களின் எண்ணிக்கை குறித்த விதிகள் வேறுபடுகின்றன. கோடோட் * பன்மைமயமாக்கல் * க்கு ஆதரவை வழங்குகிறது, இதனால் இலக்கு இடங்கள் இதை தானாகவே கையாள முடியும்.
uk: Деякі мови мають більше двох форм множини, і правила щодо кількості об’єктів, необхідних для кожної форми множини, відрізняються. Godot пропонує підтримку *множини*, щоб цільові локалі могли виконувати це автоматично.
zh_hans: 有些语言有两种以上的复数形式，不同的复数需要的对象数量也各不相同。Godot 提供了对\ *复数*\ 的支持，目标地区可以自动进行处理。
zh_tw: 有些語言有兩種以上的複數形式，不同的複數需要的物件數量也各不相同。Godot 提供了對*複數*的支援，目標地區可以自動進行處理。

source: Pluralization is meant to be used with positive (or zero) integer numbers only. Negative and floating-point values usually represent physical entities for which singular and plural don't clearly apply.
ga: Is éard atá i gceist le hiolracht ná slánuimhreacha dearfacha (nó nialasacha) a úsáid ach amháin. Is iondúil gurb ionann luachanna diúltacha agus snámhphointe agus eintitis fhisiciúla nach bhfuil feidhm shoiléir ag uatha agus iolra ina leith.
it: La pluralizzazione è adatta solo con numeri interi positivi (o nulli). I valori negativi e in virgola mobile rappresentano solitamente entità fisiche per le quali singolare e plurale non sono chiaramente applicabili.
ru: Множественное число следует использовать только с положительными (или нулевыми) целыми числами. Отрицательные числа и числа с плавающей запятой обычно представляют физические объекты, для которых единственное и множественное число не имеют явного соответствия.
ta: பன்மைமயமாக்கல் என்பது நேர்மறை (அல்லது பூச்சிய) முழு எண்களுடன் மட்டுமே பயன்படுத்தப்பட வேண்டும். எதிர்மறை மற்றும் மிதக்கும்-புள்ளி மதிப்புகள் பொதுவாக ஒருமை மற்றும் பன்மை தெளிவாக பொருந்தாத உடல் நிறுவனங்களைக் குறிக்கின்றன.
uk: Множина призначена для використання лише з додатними (або нульовими) цілими числами. Від’ємні значення та значення з плаваючою комою зазвичай представляють фізичні об’єкти, для яких однина та множина не застосовуються однозначно.
zh_hans: 复数应该只用于正整数（或零）的情况。负数和浮点数所代表的物理实体数量是单数还是复数一般无法明确区分。
zh_tw: 複數應該只用於正整數（或零）的情況。負數和浮點數所代表的物理實體數量是單數還是複數一般無法明確區分。

source: This can be combined with a context if needed:
ga: Is féidir é seo a chomhcheangal le comhthéacs más gá:
it: Questo si può abbinare a un contesto, se necessario:
ko: 필요한 경우 맥락과 결합할 수 있습니다:
ru: При необходимости это можно объединить с контекстом:
ta: தேவைப்பட்டால் இதை ஒரு சூழலுடன் இணைக்க முடியும்:
uk: За потреби це можна поєднати з контекстом:
zh_hans: 如果有需要也可以和上下文组合使用：
zh_tw: 如有需要，也可以與語境（context）結合使用：
