Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/internationalizing_games.po
Languages: ga, it, ko, ru, ta, uk, zh_hans, zh_tw

source: ``text_direction``, sets the base text direction. When set to "auto", direction depends on the first strong directional character in the text according to the Unicode Bidirectional Algorithm,
ga: ''text_direction'', an treo buntéacs. Nuair a leagtar go "uathoibríoch", braitheann treo ar an gcéad charachtar treo láidir sa téacs de réir Algartam Déthreo Unicode,
it: ``text_direction`` imposta la direzione base del testo. Se impostata su "auto", la direzione dipende dal primo carattere direzionale forte nel testo, secondo l'algoritmo bidirezionale Unicode,
ru: ``text_direction`` — задаёт базовое направление текста. При значении "auto" направление определяется первым чётким символом направления в тексте в соответствии с Unicode Bidirectional Algorithm (Двунаправленный алгоритм Unicode),
ta: `` Text_direction``, அடிப்படை உரை திசையை அமைக்கிறது. "ஆட்டோ" என அமைக்கப்பட்டால், திசை யூனிகோட் இருதரப்பு வழிமுறையின் படி உரையில் உள்ள முதல் வலுவான திசை தன்மையைப் பொறுத்தது,
uk: ``text_direction``, встановлює основний напрямок тексту. Якщо встановлено значення «авто», напрямок залежить від першого сильного спрямованого символу в тексті відповідно до двонаправленого алгоритму Unicode,
zh_hans: ``text_direction`` 设定基本文字方向。当设定为“auto”时，方向取决于根据 Unicode 双向算法的文字中的第一个强方向字符，
zh_tw: ``text_direction``，設定基本文字方向。當設定為“auto”時，方向取決於根據 Unicode 雙向演算法的文字中的第一個強方向字符，

source: ``language``, overrides current project locale.
ga: ''teanga'', a sháraíonn logchaighdeán an tionscadail reatha.
it: ``language``, sovrascrive la lingua attuale del progetto.
ru: ``language``, переопределяет текущую локаль проекта.
ta: `` மொழி``, தற்போதைய திட்ட இருப்பிடத்தை மீறுகிறது.
uk: ``мова``, замінює поточну мову проекту.
zh_hans: ``language`` 覆盖目前项目区域设定。
zh_tw: “語言”，覆蓋目前專案區域設定。

source: ``structured_text_bidi_override`` property and ``_structured_text_parser`` callback, enables special handling for structured text.
ga: Cumasaíonn maoin ''structured_text_bidi_override'' agus aisghlaoch ''_structured_text_parser'', láimhseáil speisialta do théacs struchtúrtha.
it: La proprietà ``structured_text_bidi_override`` e il callback ``_structured_text_parser`` consentono di gestire particolarmente il testo strutturato.
ru: ``structured_text_bidi_override`` свойство и обратный вызов ``_structured_text_parser`` позволяют выполнять специальную обработку структурированного текста.
ta: `` கட்டமைக்கப்பட்ட_டெக்ச்ட்_பிட்_ஓவர்ரைடு`` சொத்து மற்றும் `` _STRUCTURED_TEXT_PARSER`` திரும்பப்பெறுதல், கட்டமைக்கப்பட்ட உரைக்கு சிறப்பு கையாளுதலை செயல்படுத்துகிறது.
uk: Властивість ``structured_text_bidi_override`` і ``_structured_text_parser`` зворотний виклик, дозволяють спеціальну обробку структурованого тексту.
zh_hans: ``structured_text_bidi_override`` 属性和 ``_structured_text_parser`` 回调，可以对结构化文本进行特殊处理。
zh_tw: ``structured_text_bidi_override`` 屬性與 ``_structured_text_parser`` 回呼，可啟用對結構化文字的特殊處理。

source: ``layout_direction``, overrides control mirroring.
ga: ''layout_direction'', sáraíonn sé scáthánú rialaithe.
it: ``layout_direction``, sostituisce il rispecchiamento del controllo.
ru: ``layout_direction``, переопределяет управление зеркалированием.
ta: `` லேஅவுட் டிரெக்சன்``, கட்டுப்பாட்டு பிரதிபலிப்பை மேலெழுதவும்.
uk: ``layout_direction``, замінює дзеркальне відображення керування.
zh_hans: ``layout_direction`` 覆盖控件的镜像。
zh_tw: “layout_direction”，覆蓋控制鏡像。

source: You can see how right-to-left typesetting works in action using the `BiDI and Font Features demo project <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
ga: Is féidir leat a fheiceáil conas a oibríonn clóchuradóireacht dheis go clé i ngníomh ag baint úsáide as an tionscadal taispeána `BiDI agus Clóghnéithe <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
it: È possibile osservare il funzionamento della composizione da destra a sinistra attraverso il `progetto demo BiDI and Font Features <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
ru: Вы можете увидеть, как работает набор текста справа налево, используя `BiDI and Font Features demo project <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
ta: `பி.ஐ.டி.ஐ மற்றும் எழுத்துரு நற்பொருத்தங்கள் டெமோ திட்டம் <https://github.com/godotengine/godotengine/godotengine ஐ பயன்படுத்தி எவ்வாறு செயல்படுகிறது என்பதை நீங்கள் காணலாம்.
uk: Ви можете побачити, як набір справа наліво працює в дії, використовуючи демонстраційний проект BiDI та Font Features <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
zh_hans: 你可以使用 `BiDI 和字体功能演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__\ 来查看从右到左排版的实际工作方式。
zh_tw: 您可以使用 `BiDI 與字型功能示範專案 <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__ 來實際查看由右至左排版是如何運作的。

source: Adding break iterator data to exported project
ga: Ag cur sonraí iterator sosa leis an tionscadal a onnmhairítear
ru: Добавление данных итератора прерывания в экспортированный проект
ta: ஏற்றுமதி செய்யப்பட்ட திட்டத்திற்கு பிரேக் ஈட்டரேட்டர் தரவைச் சேர்ப்பது
uk: Додавання даних ітератора розриву до експортованого проекту
zh_hans: 在导出后的项目中添加分词迭代器数据
zh_tw: 將斷詞資料新增到匯出專案

source: Some languages are written without spaces. In those languages, word and line breaking require more than rules over character sequences. Godot includes ICU rule and dictionary-based break iterator data, but this data is not included in exported projects by default.
it: Alcune lingue sono scritte senza spazi. In queste lingue, I ritorni a capo tra parole e tra righe richiedono più che regole sulle sequenze di caratteri. Godot include regole ICU e dati basati su un dizionario di iteratori sui ritorni, ma questi dati non sono inclusi nei progetti esportati per impostazione predefinita.
ru: В некоторых языках нет пробелов. В этих языках для переноса слов и строк требуется больше, чем просто правила для последовательностей символов. Godot включает данные правил ICU и итераторов переноса на основе словаря, но эти данные по умолчанию не включаются в экспортируемые проекты.
zh_hans: 有些语言在书写时没有空格，分词和断行需要的不仅仅是基于字符序列规则。Godot 包含 ICU 规则和基于字典的分词迭代器数据，但默认情况下这些数据不包含在导出的项目中。
zh_tw: 有些語言書寫時不使用空格。對於這些語言，斷詞與換行需要不僅僅是字元序列規則。Godot 包含基於 ICU 規則與字典的斷詞迭代器資料，但在匯出的專案中預設不會包含這些資料。

source: To include it, go to **Project → Project Settings**, enable **Internationalization → Locale → Include Text Server Data**, then export the project. Break iterator data is about 4 MB in size.
it: Per includerli, vai su **Progetto → Impostazioni del progetto**, abilita **Internazionalizzazione → Impostazioni locali → Includi dati sul server di testo**, quindi esporta il progetto. I dati dell'iteratore di ritorni a capo hanno una dimensione di circa 4 MB.
ru: Чтобы включить его, перейдите в раздел **Project → Project Settings**, включите **Internationalization → Locale → Include Text Server Data**, а затем экспортируйте проект. Размер данных итератора прерывания составляет около 4 МБ.
zh_hans: 如果要包含这些数据，请前往\ **项目 → 项目设置**\ ，启用\ **国际化 → 区域设置 → 包含文本服务器数据**\ 后导出项目。分词断行迭代器数据的大小约为 4MB。
zh_tw: 若要包含它，請前往 **Project → Project Settings**，啟用 **Internationalization → Locale → Include Text Server Data**，然後匯出專案。斷詞迭代器資料大小約為 4 MB。

source: Structured text BiDi override
ga: Sháraigh téacs struchtúrtha BiDi
it: Sostituzione del BiDi di testo strutturato
ru: Переопределение структурированного текста BiDi
ta: கட்டமைக்கப்பட்ட உரை பிடி மேலெழுதும்
uk: Перевизначення структурованого тексту BiDi
zh_hans: 结构化文本 BiDi 覆盖
zh_tw: 結構化文字 BiDi 覆寫

source: Unicode BiDi algorithm is designed to work with natural text and it's incapable of handling text with the higher level order, like file names, URIs, email addresses, regular expressions or source code.
ga: Tá algartam Unicode BiDi deartha chun oibriú le téacs nádúrtha agus níl sé in ann téacs a láimhseáil leis an ord ardleibhéil, cosúil le hainmneacha comhaid, URIanna, seoltaí ríomhphoist, nathanna rialta nó cód foinse.
it: L'algoritmo Unicode BiDi è progettato per funzionare con testo naturale e non è in grado di gestire testo con ordine di livello superiore, come nomi di file, URI, indirizzi e-mail, espressioni regolari o codice sorgente.
ru: Алгоритм Unicode BiDi предназначен для работы с естественным текстом и не способен обрабатывать текст с более высоким уровнем порядка, таким как имена файлов, URI, адреса электронной почты, регулярные выражения или исходный код.
ta: யூனிகோட் பி.ஐ.டி.ஐ வழிமுறை இயற்கையான உரையுடன் வேலை செய்ய வடிவமைக்கப்பட்டுள்ளது மற்றும் கோப்பு பெயர்கள், யுஆர்ஐஎச், மின்னஞ்சல் முகவரிகள், வழக்கமான வெளிப்பாடுகள் அல்லது மூலக் குறியீடு போன்ற உயர் மட்ட வரிசையுடன் உரையை கையாள இயலாது.
uk: Алгоритм Unicode BiDi розроблений для роботи з природним текстом і не може обробляти текст із порядком вищого рівня, як-от імена файлів, URI, адреси електронної пошти, регулярні вирази чи вихідний код.
zh_hans: Unicode BiDi 算法设计用于处理自然文本，它无法处理具有更高级别顺序的文本，例如文件名、URI、电子邮件地址、正则表达式或源代码。
zh_tw: Unicode BiDi 演算法設計用於處理自然文字，它無法處理具有更高層級順序的文字，例如檔案名稱、URI、電子郵件地址、正規表示式或原始程式碼。

source: For example, the path for this shown directory structure will be displayed incorrectly (top "LineEdit" control). "File" type structured text override splits text into segments, then BiDi algorithm is applied to each of them individually to correctly display directory names in any language and preserve correct order of the folders (bottom "LineEdit" control).
ga: Mar shampla, taispeánfar an cosán don struchtúr eolaire seo a thaispeántar go mícheart (barr "LineEdit" rialú). Scoilteann "Comhad" cineál téacs struchtúrtha téacs i ndeighleoga, ansin cuirtear algartam BiDi i bhfeidhm ar gach ceann acu ina n-aonar chun ainmneacha eolaire a thaispeáint i gceart in aon teanga agus ord ceart na bhfillteán a chaomhnú (bun "LineEdit" rialú).
it: Ad esempio, il percorso della struttura di cartelle qui sopra verrà visualizzato incorrettamente (controllo "LineEdit" in alto). La sostituzione di testo strutturato di tipo "File" suddivide il testo in segmenti, quindi l'algoritmo BiDi è applicato a ciascuno di essi individualmente per visualizzare correttamente i nomi delle cartelle in qualsiasi lingua e preservare l'ordine corretto delle cartelle (controllo "LineEdit" in basso).
ru: Например, путь для этой показанной структуры каталогов будет отображаться некорректно (верхний элемент управления "LineEdit"). Переопределение структурированного текста типа "File" разбивает текст на сегменты, а затем к каждому из них применяется алгоритм BiDi индивидуально для корректного отображения имён каталогов на любом языке и сохранения правильного порядка папок (нижний элемент управления "LineEdit").
ta: எடுத்துக்காட்டாக, இந்த காட்டப்பட்ட அடைவு கட்டமைப்பிற்கான பாதை தவறாக காட்டப்படும் (மேல் "லைன்ச்டிட்" கட்டுப்பாடு). "கோப்பு" வகை கட்டமைக்கப்பட்ட உரை மேலெழுதும் உரையை பிரிவுகளாகப் பிரிக்கிறது, பின்னர் எந்தவொரு மொழியிலும் அடைவு பெயர்களைக் சரியாகக் காண்பிப்பதற்கும் கோப்புறைகளின் சரியான வரிசையை பாதுகாக்க) அவை ஒவ்வொன்றிற்கும் தனித்தனியாக BIDI வழிமுறை பயன்படுத்தப்படுகிறது (கீழே "லைன்டிட்" கட்டுப்பாடு).
uk: Наприклад, шлях до цієї показаної структури каталогу буде відображено неправильно (верхній елемент керування «LineEdit»). Заміна структурованого тексту типу "Файл" розбиває текст на сегменти, а потім алгоритм BiDi застосовується до кожного з них окремо для правильного відображення імен каталогів будь-якою мовою та збереження правильного порядку папок (нижній елемент керування "LineEdit").
zh_hans: 例如，所显示的目录结构的路径将显示不正确（顶部“LineEdit”控件）。“文件”类型结构化文本覆盖将文本拆分为段，然后将 BiDi 算法分别应用于每个段，以正确显示任何语言的目录名称并保留文件夹的正确顺序（底部“LineEdit”控件）。
zh_tw: 例如，所顯示的目錄結構的路徑將顯示不正確（頂部「LineEdit」控制項）。 「檔案」型別結構化文字會覆寫將文字分割成段，然後將 BiDi 演算法單獨套用到每個段，以正確顯示任何語言的目錄名稱並保留資料夾的正確順序（底部「LineEdit」控制項）。

source: Custom callbacks provide a way to override BiDi for the other types of structured text.
ga: Soláthraíonn aisghlaoigh saincheaptha bealach chun BiDi a shárú do na cineálacha eile téacs struchtúrtha.
it: I callback personalizzati forniscono un modo per sovrascrivere il BiDi per gli altri tipi di testo strutturato.
ru: Пользовательские обратные вызовы предоставляют возможность переопределить BiDi для других типов структурированного текста.
ta: தனிப்பயன் கால்பேக்குகள் மற்ற வகை கட்டமைக்கப்பட்ட உரைக்கு பிடியை மேலெழுத ஒரு வழியை வழங்குகின்றன.
uk: Користувальницькі зворотні виклики забезпечують спосіб замінити BiDi для інших типів структурованого тексту.
zh_hans: 自定义回调提供了一种为其他类型的结构化文本覆盖 BiDi 的方法。
zh_tw: 自訂回調提供了一種覆蓋其他型別結構化文字的 BiDi 的方法。

source: Localizing numbers
ga: Uimhreacha logánaithe
it: Localizzare i numeri
ko: 숫자 현지화하기
ru: Локализация чисел
ta: எண்களை உள்ளூர்மயமாக்குதல்
uk: Локалізація чисел
zh_hans: 数字的本地化
zh_tw: 數字本地化

source: Controls specifically designed for number input or output (e.g. ProgressBar, SpinBox) will use localized numbering system automatically, for the other control :ref:`TextServer.format_number(string, language) <class_TextServer_method_format_number>` can be used to convert Western Arabic numbers (0..9) to the localized numbering system and :ref:`TextServer.parse_number(string, language) <class_TextServer_method_parse_number>` to convert it back.
ga: Úsáidfidh rialuithe atá deartha go sonrach le haghaidh ionchur nó aschur uimhreach (m.sh. ProgressBar, SpinBox) córas uimhrithe logánta go huathoibríoch, don rialtán eile :tag:`TextServer.format_number(teaghrán, teanga) <class_TextServer_method_format_number>` is féidir a úsáid chun uimhreacha Araibis Thiar a thiontú ( 0..9) chuig an gcóras uimhrithe logánta agus :ref:`TextServer.parse_number(teaghrán, teanga) <class_TextServer_method_parse_number>` chun é a thiontú ar ais.
it: I controlli progettati specificamente per inserire o mostrare numeri (ad esempio ProgressBar, SpinBox) useranno automaticamente il sistema di numerazione localizzato, mentre per l'altro controllo :ref:`TextServer.format_number(string, language) <class_TextServer_method_format_number>` si può usare per convertire i numeri arabi occidentali (0..9) nel sistema di numerazione localizzato e :ref:`TextServer.parse_number(string, language) <class_TextServer_method_parse_number>` per riconvertirli.
ru: Элементы управления, специально разработанные для ввода или вывода чисел (например, ProgressBar, SpinBox), будут автоматически использовать локализованную систему исчисления, для других элементов управления :ref:`TextServer.format_number(string, language) <class_TextServer_method_format_number>` можно использовать для преобразования западных арабских чисел (0..9) в локализованную систему исчисления и :ref:`TextServer.parse_number(string, language) <class_TextServer_method_parse_number>` для обратного преобразования.
ta: எண் உள்ளீடு அல்லது வெளியீட்டிற்காக குறிப்பாக வடிவமைக்கப்பட்ட கட்டுப்பாடுகள் (எ.கா. முன்னேற்றமானது, ச்பின் பாக்ச்) மற்ற கட்டுப்பாட்டுக்கு தானாகவே உள்ளூர்மயமாக்கப்பட்ட எண் முறையைப் பயன்படுத்தும்: ref: `textserver.format_number (சரம், மொழி) <class_texserver_method_format_number>` மேற்கு அரபு எண்களை இணைக்கப் பயன்படுத்தலாம் ( 0..9) உள்ளூர்மயமாக்கப்பட்ட எண் அமைப்புக்கு மற்றும்: ref: `textserver.parse_number (சரம், மொழி) <class_texerver_method_parse_number>` அதை மாற்ற.
uk: Елементи керування, спеціально розроблені для введення чи виведення чисел (наприклад, ProgressBar, SpinBox), автоматично використовуватимуть локалізовану систему нумерації, для іншого елемента керування :ref:`TextServer.format_number(string, language) <class_TextServer_method_format_number>` можна використовувати для перетворення західноарабських чисел ( 0..9) до локалізованої системи нумерації та :ref:`TextServer.parse_number(string, language) <class_TextServer_method_parse_number>`, щоб перетворити його назад.
zh_hans: 专为数位输入或输出设计的控件（例如 ProgressBar、SpinBox）将自动使用本地化编号系统，对于其他控件，\ :ref:`TextServer.format_number(string, language) <class_TextServer_method_format_number>` 可用于将西方阿拉伯数字（0..9）转换为本地化的数字系统，而 :ref:`TextServer.parse_number(string, language) <class_TextServer_method_parse_number>` 可以将其转换回来。
zh_tw: 專門設計用於數值輸入或輸出的 Control (例如 ProgressBar、SpinBox) 將會自動使用本地化數字系統，對於其他 Control，:ref:`TextServer.format_number(string, language) <class_TextServer_method_format_number>` 可用於將西方阿拉伯數字 (0..9) 轉換到本地化數字系統，以及 :ref:`TextServer.parse_number(string, language) <class_TextServer_method_parse_number>` 將其轉換回來。

source: Localizing icons and images
ga: Deilbhíní agus íomhánna a logánú
it: Localizzare le icone e immagini
ru: Локализация иконок и изображений
ta: சின்னங்கள் மற்றும் படங்களை உள்ளூர்மயமாக்குதல்
uk: Локалізація значків і зображень
zh_hans: 图标和图像的本地化
zh_tw: 圖示與圖片本地化

source: Icons with left and right pointing arrows which may need to be reversed for Arabic and Hebrew locales, in case they indicate movement or direction (e.g. back/forward buttons). Otherwise, they can remain the same.
ga: Deilbhíní le saigheada pointeála ar chlé agus ar dheis a d'fhéadfadh a bheith riachtanach a aisiompú do mhuintir na háite Araibise agus Eabhraise, ar eagla go léiríonn siad gluaiseacht nó treo (m.sh. cnaipí ar ais / ar aghaidh). Seachas sin, is féidir leo fanacht mar an gcéanna.
it: Icone con frecce rivolte a sinistra e a destra che forse si dovrebbero invertire per le lingue araba ed ebraica, nel caso in cui indichino movimento o direzione (ad esempio, pulsanti avanti/indietro). Altrimenti, possono rimanere invariate.
ru: Значки со стрелками, направленными влево и вправо, могут потребовать замены для Арабской и Ивритской локалей, если они обозначают движение или направление (например, кнопки «назад»/«вперёд»). В противном случае их можно оставить без изменений.
ta: அரபு மற்றும் எபிரேய இடங்களுக்கு தலைகீழாக மாற்ற வேண்டிய இடது மற்றும் வலது சுட்டிக்காட்டி அம்புகளைக் கொண்ட சின்னங்கள், அவை இயக்கம் அல்லது திசையை (எ.கா. பின்/முன்னோக்கி பொத்தான்கள்) சுட்டிக்காட்டினால். இல்லையெனில், அவை அப்படியே இருக்க முடியும்.
uk: Піктограми зі стрілками вліво та вправо, які, можливо, потрібно поміняти місцями для арабської та івритської мови, якщо вони вказують на рух або напрямок (наприклад, кнопки назад/вперед). В іншому випадку вони можуть залишитися такими ж.
zh_hans: 当带有左右指向箭头的图标指示移动或方向（例如后退/前进按钮）时，它们可能需要在阿拉伯语和希伯来语语言环境中翻转过来。否则，它们可以保持不变。
zh_tw: 帶有左右指向箭頭的圖示可能需要在阿拉伯語和希伯來語語言環境中顛倒過來，以防它們指示移動或方向（例如後退/前進按鈕）。否則，它們可以保持不變。

source: Testing translations
ga: Aistriúcháin a thástáil
it: Testare le traduzioni
ru: Тестирование переводов
ta: மொழிபெயர்ப்புகளை சோதனை
uk: Тестування перекладів
zh_hans: 测试翻译
zh_tw: 翻譯測試

source: You may want to test a project's translation before releasing it. Godot provides three ways to do this.
it: Potresti voler testare la traduzione di un progetto prima di pubblicarlo. Godot fornisce tre modi per farlo.
ru: Возможно, вам захочется протестировать перевод проекта перед его публикацией. Godot предлагает три способа сделать это.
zh_hans: 你可能会想要在发布前测试项目的翻译。Godot 为此提供了三种方法。
zh_tw: 在發佈前你可能會想測試專案的翻譯。Godot 為此提供三種方法。

source: First, in the Project Settings, under :menu:`Internationalization > Locale` (with advanced settings enabled), there is a **Test** property. Set this property to the locale code of the language you want to test. Godot will run the project with that locale when the project is run (either from the editor or when exported).
it: Innanzitutto, nelle Impostazioni del progetto, sotto :menu:`Internationalization > Locale` (con le impostazioni avanzate abilitate), è presente la proprietà **Test**. Imposta questa proprietà sul codice della lingua che desideri testare. Godot eseguirà il progetto con quella lingua quando il progetto è eseguito (dall'editor o all'esportazione).
ru: Во-первых, в Project Settings, в разделе :menu:`Internationalization > Locale` (при включенных расширенных настройках), есть свойство **Test**. Задайте для него код локали языка, который вы хотите протестировать. Godot запустит проект с этой локалью при запуске (из редактора или при экспорте).
zh_hans: 首先，在项目设置中的\ :menu:`国际化 > 区域设置`\ （启用高级设置）下有一个\ **测试**\ 属性。将这个属性设置为你想测试的语言的区域设置代码。Godot 将在项目运行时使用该区域设置运行该项目（无论是从编辑器运行还是导出后运行）。
zh_tw: 首先, 在 Project Settings 的 :menu:`Internationalization > Locale` (需啟用進階設定) 下有一個 **Test** 屬性。將此屬性設定為你想測試的語言區碼。當專案執行時 (無論在編輯器或匯出後), Godot 都會以該語言區執行。

source: Keep in mind that since this is a project setting, it will show up in version control when it is set to a non-empty value. Therefore, it should be set back to an empty value before committing changes to version control.
ga: Coinnigh i gcuimhne, ós rud é gur socrú tionscadail é seo, go dtaispeánfaidh sé rialú leaganacha nuair a bheidh sé socraithe do luach neamhfholamh. Dá bhrí sin, ba cheart é a shocrú ar ais go dtí luach folamh sula ndéantar athruithe ar rialú leaganacha.
it: Tieni presente che, essendo un'impostazione del progetto, apparirà nel controllo versione quando è impostata su un valore non vuoto. Pertanto, è consigliabile reimpostarla su un valore vuoto prima effettuare il commit delle modifiche nel controllo versione.
ru: Имейте в виду, что, поскольку это project setting, она отобразится в системе контроля версий, если ей присвоено непустое значение. Поэтому перед внесением изменений в систему контроля версий следует вернуть ей пустое значение.
ta: இது ஒரு திட்ட அமைப்பு என்பதால், அது காலியாக இல்லாத மதிப்புக்கு அமைக்கப்படும்போது பதிப்பு கட்டுப்பாட்டில் காண்பிக்கப்படும் என்பதை நினைவில் கொள்ளுங்கள். எனவே, பதிப்பு கட்டுப்பாட்டில் மாற்றங்களைச் செய்வதற்கு முன் இது வெற்று மதிப்புக்கு அமைக்கப்பட வேண்டும்.
uk: Майте на увазі, що оскільки це параметр проекту, він відображатиметься в елементі керування версіями, коли встановлено непусте значення. Таким чином, він повинен бути повернутий назад до порожнього значення, перед внесенням змін до керування версіями.
zh_hans: 请记住，因为这是一个项目设置，设为非空时它会在版本控制中显示。因此，将修改提交到版本控制之前，应该将其设回空值。
zh_tw: 請記住，因為這是一個專案設定，設為非空時會在版本控制中顯示。因此，將修改提交到版本控制之前，應該將其設回空值。

source: Second, from within the editor go to the top bar and click on :button:`View` on the top bar, then go down to :ui:`Preview Translation` and select the language you want to preview.
it: Successivamente, dall'editor vai alla barra in alto e clicca su :button:`View` nella barra in alto, poi vai su :ui:`Preview Translation` e seleziona la lingua che desideri mostrare in anteprima.
ru: Во-вторых, в редакторе перейдите на верхнюю панель и нажмите :button:`View` на верхней панели, затем перейдите к :ui:`Preview Translation` и выберите язык, который вы хотите просмотреть.
zh_hans: 其次，在编辑器中点击顶部工具栏的\ :button:`视图`\ ，然后在\ :ui:`预览翻译`\ 中选择要预览的语言。
zh_tw: 其次，在編輯器中前往上方選單點選 :button:`View`，接著前往 :ui:`Preview Translation` 並選擇你想預覽的語言。

source: All text in scenes in the editor should now be displayed using the selected language.
it: Ora tutto il testo nelle scene nell'editor si dovrebbe visualizzare nella lingua selezionata.
ru: Весь текст в сценах редактора теперь должен отображаться с использованием выбранного языка.
zh_hans: 编辑器场景中的所有文本现在都会以所选语言显示。
zh_tw: 此時編輯器中場景的所有文字應會以所選語言顯示。
