Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/localization_using_gettext.po
Languages: ga, it, ru, ta, uk, zh_cn, zh_tw

source: If there are syntax errors or warnings, they will be displayed in the console. Otherwise, ``msgfmt`` won't output anything.
ga: Má tá earráidí nó rabhaidh chomhréire ann, taispeánfar iad sa chonsól. Seachas sin, ní bheidh ''msgfmt'' aschur rud ar bith.
it: Se ci sono errori di sintassi o avvertimenti, questi saranno visualizzati nella console. Se no, ``msgfmt`` non produrrà alcun output.
ru: Если есть синтаксические ошибки или предупреждения, они будут выведены в консоль. В противном случае ``msgfmt`` ничего не выведет.
ta: தொடரியல் பிழைகள் அல்லது எச்சரிக்கைகள் இருந்தால், அவை கன்சோலில் காண்பிக்கப்படும். இல்லையெனில், `` msgfmt`` எதையும் வெளியிடாது.
uk: Якщо є синтаксичні помилки, або попередження, вони будуть відображатися в консолі. В іншому випадку ``msgfmt``, нічого не буде виводити.
zh_cn: 如果有语法错误或警告就会显示在控制台中。否则 ``msgfmt`` 不会输出任何内容。
zh_tw: 如有語法錯誤或警告，將顯示於終端機，否則 ``msgfmt`` 不會有任何輸出。

source: Using binary MO files (useful for large projects only)
ga: Ag baint úsáide as comhaid MO dénártha (úsáideach do thionscadail mhóra amháin)
it: Utilizzare file MO binari (utile solo per i grandi progetti)
ru: Использование двоичных MO-файлов (полезно только для больших проектов)
ta: பைனரி MO கோப்புகளைப் பயன்படுத்துதல் (பெரிய திட்டங்களுக்கு மட்டுமே பயனுள்ளதாக இருக்கும்)
uk: Використання бінарних файлів MO (корисно лише для великих проектів)
zh_cn: 使用二进制 MO 文件（仅适用于大型项目）
zh_tw: 使用二進位 MO 檔案（僅適用於大型專案）

source: For large projects with several thousands of strings to translate or more, it can be worth it to use binary (compiled) MO message files instead of text-based PO files. Binary MO files are smaller and faster to read than the equivalent PO files.
ga: I gcás tionscadail mhóra le roinnt mílte teaghráin a aistriú nó níos mó, is féidir é a bheith fiú é a úsáid dénártha (tiomsaithe) comhaid teachtaireacht MO in ionad téacs-bhunaithe comhaid PO. Tá comhaid MO Dénártha níos lú agus níos tapúla a léamh ná na comhaid PO coibhéiseacha.
it: Per progetti grandi con diverse migliaia di stringhe da tradurre o più, può essere utile utilizzare file di messaggi MO binari (compilati) invece di file PO testuali. I file MO binari sono più piccoli e più veloci da leggere rispetto ai file PO equivalenti.
ru: Для крупных проектов, требующих перевода нескольких тысяч строк и более, может быть целесообразно использовать двоичные (скомпилированные) файлы сообщений MO вместо текстовых PO-файлов. Двоичные MO-файлы меньше по размеру и читаются быстрее, чем аналогичные PO-файлы.
ta: மொழிபெயர்க்க அல்லது அதற்கு மேற்பட்ட பல ஆயிரம் சரங்களைக் கொண்ட பெரிய திட்டங்களுக்கு, உரை அடிப்படையிலான பிஓ கோப்புகளுக்கு பதிலாக பைனரி (தொகுக்கப்பட்ட) MO செய்தி கோப்புகளைப் பயன்படுத்துவது மதிப்புக்குரியது. பைனரி MO கோப்புகள் சமமான PO கோப்புகளை விட சிறியவை மற்றும் படிக்க வேகமானவை.
uk: У великих проектах, де потрібно перекласти кілька тисяч рядків або більше, замість текстових PO-файлів варто використовувати бінарні (скомпільовані) файли MO-повідомлень. Бінарні MO-файли мають менший розмір і швидше читаються, ніж еквівалентні PO-файли.
zh_cn: 大型项目会有成千上万的字符串要翻译，相比于基于文本的 PO 文件，使用（编译为）二进制的 MO 消息文件可能更加划算。二进制 MO 文件比对应的 PO 文件更小、读起来更快。
zh_tw: 若你的專案有成千上萬條需翻譯字串，建議使用二進位（編譯後）MO 檔案取代文字型 PO 檔案。MO 檔案體積更小、讀取速度更快。

source: You can generate an MO file with the command below:
ga: Is féidir leat comhad MO a ghiniúint leis an ordú thíos:
it: È possibile generare un file MO con il comando seguente:
ru: Вы можете создать MO-файл с помощью следующей команды:
ta: கீழே உள்ள கட்டளையுடன் நீங்கள் ஒரு MO கோப்பை உருவாக்கலாம்:
uk: Ви можете створити файл MO за допомогою команди нижче:
zh_cn: 可以使用以下命令生成 MO 文件：
zh_tw: 可用下列指令產生 MO 檔案：

source: If the PO file is valid, this command will create an ``fr.mo`` file besides the PO file. This MO file can then be loaded in Godot as described above.
it: Se il file PO è valido, questo comando creerà un file ``fr.mo`` oltre al file PO. Questo file MO si potrà quindi caricare in Godot come descritto qui sopra.
ru: Если PO-файл корректен, эта команда создаст файл ``fr.mo`` помимо PO-файла. Этот MO-файл затем можно загрузить в Godot, как описано выше.
ta: PO கோப்பு செல்லுபடியாகும் என்றால், இந்த கட்டளை PO கோப்பைத் தவிர `` fr.mo`` கோப்பை உருவாக்கும். இந்த MO கோப்பை மேலே விவரிக்கப்பட்டுள்ளபடி கோடோட்டில் ஏற்றலாம்.
uk: Якщо PO-файл дійсний, ця команда створить файл ``fr.mo`` окрім PO-файлу. Цей MO-файл потім можна завантажити в Godot, як описано вище.

source: The original PO file should be kept in version control so you can update your translation in the future. In case you lose the original PO file and wish to decompile an MO file into a text-based PO file, you can do so with:
ga: Ba chóir an bunchomhad PO a choinneáil i rialú leaganacha ionas gur féidir leat d'aistriúchán a nuashonrú amach anseo. Sa chás go gcailleann tú an comhad PO bunaidh agus gur mian leat comhad MO a dhianscaoileadh i gcomhad PO téacsbhunaithe, is féidir leat é sin a dhéanamh le:
it: Il file PO originale dovrebbe essere mantenuto nel controllo versioni in modo che sia possibile aggiornare la traduzione in futuro. Nel caso in cui si perda il file PO originale e si desideri decompilare un file MO in un file PO testuale, è possibile farlo con:
ru: Исходный PO-файл следует хранить в системе контроля версий, чтобы иметь возможность обновить перевод в будущем. Если вы потеряете исходный PO-файл и захотите декомпилировать MO-файл в текстовый PO-файл, это можно сделать следующим образом:
ta: அசல் PO கோப்பு பதிப்பு கட்டுப்பாட்டில் வைக்கப்பட வேண்டும், எனவே எதிர்காலத்தில் உங்கள் மொழிபெயர்ப்பைப் புதுப்பிக்கலாம். நீங்கள் அசல் PO கோப்பை இழந்து, ஒரு MO கோப்பை உரை அடிப்படையிலான PO கோப்பில் சிதைக்க விரும்பினால், நீங்கள் அவ்வாறு செய்யலாம்:
uk: Оригінальний файл PO слід зберігати в системі керування версіями, щоб ви могли оновити свій переклад у майбутньому. Якщо ви втратите оригінальний файл PO і хочете декомпілювати файл MO у текстовий файл PO, ви можете зробити це за допомогою:
zh_cn: 原始 PO 文件应保留在版本控制中，以便你将来更新翻译。如果你丢失了原始 PO 文件，并希望将 MO 文件反编译为基于文本的 PO 文件，你可以这样做：
zh_tw: 建議將原始 PO 檔案納入版本控制，便於日後維護翻譯。若遺失原始 PO 檔需將 MO 檔反編譯回文字 PO 檔，可用下列指令：

source: The decompiled file will not include comments or fuzzy strings, as these are never compiled in the MO file in the first place.
ga: Ní bheidh tuairimí ná teaghráin doiléire san áireamh sa chomhad díthiomsaithe, mar ní thiomsaítear iad seo sa chomhad MO ar an gcéad dul síos.
it: Il file decompilato non includerà commenti o stringhe "fuzzy", poiché questi non vengono mai compilati nel file MO.
ru: Декомпилированный файл не будет содержать комментариев или нечетких строк, поскольку они изначально не компилируются в файле MO.
ta: சிதைந்த கோப்பில் கருத்துகள் அல்லது தெளிவற்ற சரங்கள் இருக்காது, ஏனெனில் இவை ஒருபோதும் MO கோப்பில் முதலில் தொகுக்கப்படவில்லை.
uk: Декомпільований файл не міститиме коментарів або нечітких рядків, оскільки вони ніколи не компілюються у файлі MO.
zh_cn: 反编译出的文件不包含注释和模糊字符串，因为它们一开始就没有编译进 MO 文件里。
zh_tw: 反編譯回來的檔案不會包含註解或 fuzzy 標記，因為這些資訊原本就不會被編入 MO 檔案中。

source: Extracting localizable strings from GDScript files
it: Estrarre le stringhe localizzabili dai file GDScript
ru: Извлечение локализуемых строк из файлов GDScript
ta: GDSCRIPT கோப்புகளிலிருந்து உள்ளூர்மயமாக்கக்கூடிய சரங்களை பிரித்தெடுத்தல்
uk: Вилучення локалізованих рядків із файлів GDScript
zh_cn: 从 GDScript 文件中提取可本地化的字符串
zh_tw: 從 GDScript 檔案擷取可在地化字串

source: The built-in `editor plugin <https://github.com/godotengine/godot/blob/master/modules/gdscript/editor/gdscript_translation_parser_plugin.h>`_ recognizes a variety of patterns in source code to extract localizable strings from GDScript files, including but not limited to the following:
it: L'`estensione integrata dell'editor <https://github.com/godotengine/godot/blob/master/modules/gdscript/editor/gdscript_translation_parser_plugin.h>`_ riconosce una varietà di modelli nel codice sorgente per estrarre stringhe localizzabili dai file GDScript, inclusi ma non solo dai seguenti:
ru: Встроенный `плагин редактора <https://github.com/godotengine/godot/blob/master/modules/gdscript/editor/gdscript_translation_parser_plugin.h>`_ распознает различные шаблоны в исходном коде для извлечения локализуемых строк из файлов GDScript, включая, помимо прочего, следующие:
ta: உள்ளமைக்கப்பட்ட `எடிட்டர் சொருகி <https://github.com/godotengine/godotengine/blob/master/modules/gdscript/editor/gdscript_translation_parser_plugin.h>` `_ _ _ உள்ளூர்மயமாக்கக்கூடிய கோடுகள் உட்பட, மூலக் குறியீட்டில் பல்வேறு வடிவங்களை அங்கீகரிக்கிறது: உள்ளூர்மயமாக்கக்கூடிய கோடுகள் உட்பட
uk: Вбудований `плагін редактора <https://github.com/godotengine/godot/blob/master/modules/gdscript/editor/gdscript_translation_parser_plugin.h>`_ розпізнає різноманітні шаблони у вихідному коді, щоб витягти локалізовані рядки з файлів GDScript, включаючи, але не обмежуючись цим:
zh_cn: 内置的\ `编辑器插件 <https://github.com/godotengine/godot/blob/master/modules/gdscript/editor/gdscript_translation_parser_plugin.h>`_\ 能够识别源代码中的多种模式，可以从 GDScript 文件中提取可本地化的字符串，包括但不限于以下内容：
zh_tw: 內建的 `編輯器外掛 <https://github.com/godotengine/godot/blob/master/modules/gdscript/editor/gdscript_translation_parser_plugin.h>`_ 可識別多種原始碼模式，從 GDScript 檔案中擷取可在地化字串，包含但不限於下列類型：

source: ``tr()``, ``tr_n()``, ``atr()``, and ``atr_n()`` calls;
it: ``tr()``, ``tr_n()``, ``atr()`` e le chiamate a ``atr_n()``;
ru: ``tr()``, ``tr_n()``, ``atr()``, и ``atr_n()`` звонки;
uk: Виклики ``tr()``, ``tr_n()``, ``atr()`` і ``atr_n()``;
zh_cn: 对 ``tr()``\ 、\ ``tr_n()``\ 、\ ``atr()``\ 、\ ``atr_n()`` 的调用；
zh_tw: ``tr()`` 、 ``tr_n()`` 、 ``atr()`` 及 ``atr_n()`` 呼叫;

source: assigning properties ``text``, ``placeholder_text``, and ``tooltip_text``;
it: assegnare le proprietà ``text``, ``placeholder_text`` e ``tooltip_text``;
ru: назначение свойств ``text``, ``placeholder_text``, и ``tooltip_text``;
ta: பண்புகளை ஒதுக்குதல் `` உரை``, `` பிளேச்ஓல்டர்_டெக்ச்ட்``, மற்றும் `` கருவிப்பட்டியல்_டெக்ச்ட்`;
uk: призначення властивостей ``text``, ``placeholder_text`` і ``tooltip_text``;
zh_cn: 为 ``text``\ 、\ ``placeholder_text``\ 、\ ``tooltip_text`` 等属性赋值；
zh_tw: 設定 ``text`` 、 ``placeholder_text`` 、 ``tooltip_text`` 屬性時;

source: ``add_tab()``, ``add_item()``, ``set_tab_title()``, and other calls;
it: ``add_tab()``, ``add_item()``, ``set_tab_title()`` e altre chiamate;
ru: ``add_tab()``, ``add_item()``, ``set_tab_title()``, и другие звонки;
ta: `` add_tab () ``, `` add_item () ``, `` set_tab_title () ``, மற்றும் பிற அழைப்புகள்;
uk: ``add_tab()``, ``add_item()``, ``set_tab_title()`` та інші виклики;
zh_cn: 对 ``add_tab()``\ 、\ ``add_item()``\ 、\ ``set_tab_title()`` 等函数的调用；
zh_tw: 呼叫 ``add_tab()`` 、 ``add_item()`` 、 ``set_tab_title()`` 等方法;

source: ``FileDialog`` filters like ``"*.png ; PNG Images"``.
it: Filtri dei ``FileDialog`` come ``"*.png ; PNG Images"``.
ru: ``FileDialog`` фильтры типа ``"*.png ; PNG Images"``.
ta: `` `"*.Png; png படங்கள் "போன்ற வடிப்பான்கள்` `.
uk: ``FileDialog`` фільтрує як ``"*.png; PNG зображення"``.
zh_cn: ``FileDialog`` 的过滤器格式如 ``"*.png ; PNG 图像"``\ 。
zh_tw: ``FileDialog`` 篩選字串，如 ``"*.png ; PNG Images"``。

source: The argument or right operand must be a constant string, otherwise the plugin will not be able to evaluate the expression and will ignore it.
it: L'argomento o l'operando di destra deve essere una stringa costante, altrimenti l'estensione non sarà in grado di valutare l'espressione e la ignorerà.
ru: Аргумент или правый операнд должен быть константной строкой, в противном случае плагин не сможет оценить выражение и проигнорирует его.
ta: உரையாடல் அல்லது வலது செயல்பாடு ஒரு நிலையான சரமாக இருக்க வேண்டும், இல்லையெனில் சொருகி வெளிப்பாட்டை மதிப்பிட முடியாது, அதை புறக்கணிக்கும்.
uk: Аргумент або правий операнд має бути постійним рядком, інакше плагін не зможе обчислити вираз і проігнорує його.
zh_cn: 参数和右操作数必须为字符串常量，否则插件无法对表达式求值，会将其忽略。
zh_tw: 參數或右側運算元必須是常數字串，否則編輯器外掛將無法解析並會忽略該表達式。

source: If the plugin extracts unnecessary strings, you can ignore them with the ``NO_TRANSLATE`` comment. You can also provide additional information for translators using the ``TRANSLATORS:`` comment. These comments must be placed either on the same line as the recognized pattern or precede it.
it: Se l'estensione estrae stringhe non necessarie, è possibile ignorarle con il commento ``NO_TRANSLATE``. È inoltre possibile fornire informazioni aggiuntive per i traduttori attraverso il commento ``TRANSLATORS:``. Questi commenti si devono inserire sulla stessa riga del modello riconosciuto o precederla.
ru: Если плагин извлекает ненужные строки, вы можете игнорировать их с помощью комментария ``NO_TRANSLATE``. Вы также можете предоставить дополнительную информацию для переводчиков с помощью комментария ``TRANSLATORS:``. Эти комментарии должны располагаться либо на той же строке, что и распознанный шаблон, либо перед ним.
ta: சொருகி தேவையற்ற சரங்களை பிரித்தெடுத்தால், அவற்றை `` NO_TRANSLATE`` கருத்து மூலம் புறக்கணிக்கலாம். `` மொழிபெயர்ப்பாளர்களைப் பயன்படுத்தி மொழிபெயர்ப்பாளர்களுக்கு கூடுதல் தகவல்களை நீங்கள் வழங்கலாம்: `` கருத்து. இந்த கருத்துக்கள் அங்கீகரிக்கப்பட்ட வடிவத்தின் அதே வரியில் வைக்கப்பட வேண்டும் அல்லது அதற்கு முன்னதாக வைக்கப்பட வேண்டும்.
uk: Якщо плагін витягує непотрібні рядки, ви можете проігнорувати їх за допомогою коментаря ``NO_TRANSLATE``. Ви також можете надати додаткову інформацію для перекладачів за допомогою коментаря ``TRANSLATORS:``. Ці коментарі повинні бути розміщені або в одному рядку з розпізнаним шаблоном, або перед ним.
zh_cn: 如果插件提取了不必要的字符串，你可以使用 ``NO_TRANSLATE`` 注释来忽略。你也可以使用 ``TRANSLATORS:`` 注释为翻译人员提供额外信息。这些注释必须放在与识别模式相同的行上，或者放在前一行。
zh_tw: 若外掛擷取了不需翻譯的字串，可在其前方加上 ``NO_TRANSLATE`` 註解來忽略。你也可以用 ``TRANSLATORS:`` 註解提供補充說明給譯者。這些註解必須與被識別的程式碼在同一行或直接前一行。

source: Using context
it: Utilizzare il contesto
ru: Использование контекста
ta: சூழலைப் பயன்படுத்துதல்
uk: Використання контексту

source: The ``context`` parameter can be used to differentiate the situation where a translation is used, or to differentiate polysemic words (words with multiple meanings).
it: Il parametro ``context`` serve per distinguere la situazione in cui è utilizzata una traduzione o per differenziare parole polisemiche (parole con più significati).
ru: Параметр ``context`` можно использовать для различения ситуации, в которой используется перевод, или для различения полисемичных слов (слов с несколькими значениями).
ta: ஒரு மொழிபெயர்ப்பு பயன்படுத்தப்படும் சூழ்நிலையை வேறுபடுத்துவதற்கு அல்லது பாலிசெமிக் சொற்களை வேறுபடுத்துவதற்கு `` சூழல்`` அளவுரு பயன்படுத்தப்படலாம் (பல அர்த்தங்களைக் கொண்ட சொற்கள்).
uk: Параметр ``context`` можна використовувати для розрізнення ситуації, де використовується переклад, або для розрізнення полісемічних слів (слів з кількома значеннями).

source: For example:
it: Per esempio:
ru: Например:
ta: உதாரணமாக:
uk: Приклад:
zh_cn: 例如：
zh_tw: 例如：

source: Updating PO files
it: Aggiornare i file PO
ru: Обновление файлов PO
ta: PO கோப்புகளை புதுப்பித்தல்
uk: Оновлення файлів PO

source: Some time or later, you'll add new content to our game, and there will be new strings that need to be translated. When this happens, you'll need to update the existing PO files to include the new strings.
it: Prima o poi, saranno aggiunti nuovi contenuti al gioco e ci saranno nuove stringhe da tradurre. Quando ciò accadrà, sarà necessario aggiornare i file PO esistenti per includere le nuove stringhe.
ru: Рано или поздно вы добавите в нашу игру новый контент, и появятся новые строки, которые необходимо будет перевести. В этом случае вам потребуется обновить существующие PO-файлы, включив в них новые строки.
ta: சிறிது நேரம் அல்லது அதற்குப் பிறகு, எங்கள் விளையாட்டில் புதிய உள்ளடக்கத்தை நீங்கள் சேர்ப்பீர்கள், மேலும் மொழிபெயர்க்கப்பட வேண்டிய புதிய சரங்கள் இருக்கும். இது நிகழும்போது, புதிய சரங்களை சேர்க்க ஏற்கனவே இருக்கும் PO கோப்புகளை புதுப்பிக்க வேண்டும்.
uk: Колись чи пізніше ви додасте новий контент до нашої гри, і з'являться нові рядки, які потрібно буде перекласти. Коли це станеться, вам потрібно буде оновити існуючі PO-файли, щоб включити нові рядки.

source: First, generate a new POT file containing all the existing strings plus the newly added strings. After that, merge the existing PO files with the new POT file. There are two ways to do this:
it: Innanzitutto, generare un nuovo file POT contenente tutte le stringhe esistenti, più quelle appena aggiunte. Dopodiché, unire i file PO esistenti con il nuovo file POT. Ci sono due modi per farlo:
ru: Сначала создайте новый POT-файл, содержащий все существующие строки и вновь добавленные строки. После этого объедините существующие PO-файлы с новым POT-файлом. Это можно сделать двумя способами:
ta: முதலில், தற்போதுள்ள அனைத்து சரங்களையும், புதிதாக சேர்க்கப்பட்ட சரங்களையும் கொண்ட புதிய பானை கோப்பை உருவாக்கவும். அதன் பிறகு, தற்போதுள்ள PO கோப்புகளை புதிய பானை கோப்புடன் ஒன்றிணைக்கவும். இதைச் செய்ய இரண்டு வழிகள் உள்ளன:
uk: Спочатку згенеруйте новий POT-файл, що містить усі існуючі рядки, а також щойно додані рядки. Після цього об'єднайте існуючі PO-файли з новим POT-файлом. Є два способи зробити це:

source: Use a gettext editor, and it should have an option to update a PO file from a POT file.
it: Utilizzare un editor di gettext, che dovrebbe avere un'opzione per aggiornare un file PO da un file POT.
ru: Используйте редактор GetText, в нем должна быть возможность обновления файла PO из файла POT.
ta: உரைபெறு எடிட்டரைப் பயன்படுத்தவும், மேலும் ஒரு பானை கோப்பிலிருந்து ஒரு PO கோப்பைப் புதுப்பிக்க இது ஒரு விருப்பம் இருக்க வேண்டும்.
uk: Використовуйте редактор gettext, і він повинен мати опцію оновлення PO-файлу з POT-файлу.

source: Use the gettext ``msgmerge`` tool:
it: Utilizzare lo strumento ``msgmerge`` di gettext:
ru: Используйте инструмент gettext ``msgmerge``:
ta: உரைபெறு `` Msgmerge`` கருவியைப் பயன்படுத்தவும்:
uk: Використайте інструмент gettext ``msgmerge``:

source: POT generation custom plugin
it: Estensione personalizzata di generazione POT
ru: Пользовательский плагин для генерации POT
ta: பானை தலைமுறை தனிப்பயன் சொருகி
uk: Користувацький плагін для генерації POT

source: If you have any extra file format to deal with, you could write a custom plugin to parse and and extract the strings from the custom file. This custom plugin will extract the strings and write into the POT file when you hit **Generate POT**. To learn more about how to create the translation parser plugin, see :ref:`EditorTranslationParserPlugin <class_EditorTranslationParserPlugin>`.
it: Se c'è un formato da gestire in più, è possibile scrivere una propria estensione per analizzare ed estrarre le stringhe dal file personalizzato. Questa estensione estrarrà le stringhe e le scriverà nel file POT quando si clicca su **Genera POT**. Per saperne di più su come creare le estensioni per i parser di traduzione, consultare :ref:`EditorTranslationParserPlugin <class_EditorTranslationParserPlugin>`.
ru: Если вам нужно работать с файлами других форматов, вы можете написать плагин для анализа и извлечения строк из файла. Этот плагин извлечет строки и запишет их в POT-файл после нажатия кнопки **Generate POT**. Подробнее о создании плагина для анализа перевода см. в разделе :ref:`EditorTranslationParserPlugin <class_EditorTranslationParserPlugin>`.
ta: சமாளிக்க கூடுதல் கோப்பு வடிவம் உங்களிடம் இருந்தால், தனிப்பயன் கோப்பிலிருந்து சரங்களை அலசுவதற்கும் பிரித்தெடுக்கவும் தனிப்பயன் சொருகி எழுதலாம். இந்த தனிப்பயன் சொருகி சரங்களை பிரித்தெடுத்து, நீங்கள் அடிக்கும்போது பானை கோப்பில் எழுதும் ** பானை உருவாக்கு **. மொழிபெயர்ப்பு பாகுபடுத்தி சொருகி எவ்வாறு உருவாக்குவது என்பது பற்றி மேலும் அறிய, காண்க: குறிப்பு: `எடிட்டர் டிரான்ச்லேசன் பார்சர் பிளூகின் <class_editortranslationParserPlugin>`.
uk: Якщо у вас є якийсь додатковий формат файлів, ви можете написати власний плагін для розбору та вилучення рядків з власного файлу. Цей власний плагін вилучить рядки та запише їх у POT-файл, коли ви натиснете **Згенерувати POT**. Щоб дізнатися більше про те, як створити плагін для розбору перекладів, див. :ref:`EditorTranslationParserPlugin <class_EditorTranslationParserPlugin>`.

source: Manual creation
ga: Cruthú láimhe
it: Creazione manuale
ta: கையேடு உருவாக்கம்
uk: Ручне створення
zh_cn: 手动创建
zh_tw: 手動建立

source: Localization using gettext
ga: Logánú ag baint úsáide as gettext

source: In addition to :ref:`doc_importing_translations` in CSV format, Godot also supports loading translation files written in the GNU gettext format (text-based ``.po`` and compiled ``.mo`` since Godot 4.0).
ga: Chomh maith le :ref:'doc_importing_translations' i bhformáid CSV, tacaíonn Godot freisin le comhaid aistriúcháin a luchtú atá scríofa i bhformáid gettext GNU (téacs-bhunaithe ''.po'' agus tiomsaithe ''.mo'' ó Godot 4.0).

source: gettext is a standard format, which can be edited using any text editor or GUI editors such as `Poedit <https://poedit.net/>`_.
ga: Is formáid chaighdeánach é gettext, ar féidir eagarthóireacht a dhéanamh air trí úsáid a bhaint as aon eagarthóir téacs nó eagarthóirí GUI ar nós `Poedit <https://poedit.net/>`_.

source: Compared to CSV, gettext works better with version control systems like Git, as each locale has its own messages file.
ga: I gcomparáid le CSV, oibríonn gettext níos fearr le córais rialaithe leagan cosúil le Git, toisc go bhfuil a chomhad teachtaireachtaí féin ag gach logán.

source: Multiline strings are more convenient to edit in gettext files compared to CSV files.
ga: Tá teaghráin Multiline níos áisiúla a chur in eagar i gcomhaid gettext i gcomparáid le comhaid CSV.

source: gettext is a more complex format than CSV and can be harder to grasp for people new to software localization.
ga: Is gettext formáid níos casta ná CSV agus is féidir a bheith níos deacra a thuiscint do dhaoine nua logánú bogearraí.

source: It is possible to check whether a gettext file's syntax is valid by running the command below:
ga: Is féidir a sheiceáil an bhfuil comhréir comhad gettext bailí tríd an ordú thíos a rith:

source: If the PO file is valid, this command will create a ``fr.mo`` file besides the PO file. This MO file can then be loaded in Godot as described above.
ga: Má tá an comhad PO bailí, cruthóidh an t-ordú seo comhad ''fr.mo'' seachas an comhad PO. Is féidir an comhad MO seo a luchtú ansin i Godot mar a thuairiscítear thuas.
