Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/localization_using_gettext.po
Languages: ga, it, ru, ta, uk, zh_cn, zh_tw

source: Localization using gettext (PO files)
it: Localizzazione tramite gettext (file PO)
ru: Локализация с помощью gettext (PO-файлы)
ta: உரைபெறு (PO கோப்புகள்) ஐப் பயன்படுத்தி உள்ளூர்மயமாக்கல்
uk: Локалізація за допомогою gettext (PO-файли)

source: In addition to importing translations in :ref:`CSV format <doc_localization_using_spreadsheets>`, Godot also supports loading translation files written in the GNU gettext format (text-based ``.po`` and compiled ``.mo`` since Godot 4.0).
ru: Помимо импорта переводов в формате :ref:`CSV format <doc_localization_using_spreadsheets>`, Godot также поддерживает загрузку файлов переводов, написанных в формате GNU gettext (текстовые ``.po`` и скомпилированные ``.mo`` начиная с Godot 4.0).
ta: மொழிபெயர்ப்புகளை இறக்குமதி செய்வதோடு மட்டுமல்ல: `சி.எச்.வி வடிவம் <doc_localization_using_spreadsheets>`, கியூனு கெட் எக்ச்ட் வடிவத்தில் எழுதப்பட்ட மொழிபெயர்ப்பு கோப்புகளை ஏற்றுவதையும் கோடோட் ஆதரிக்கிறார் (உரை அடிப்படையிலான `.po`` மற்றும்` `.mo```.

source: For an introduction to gettext, check out `A Quick Gettext Tutorial <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_. It's written with C projects in mind, but much of the advice also applies to Godot (with the exception of ``xgettext``).
ga: Chun réamhrá a fháil ar gettext, féach ar `A Quick Gettext Teagaisc <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_. Tá sé scríofa le tionscadail C san áireamh, ach baineann go leor den chomhairle le Godot freisin (cé is moite de ``xgettext``).
it: Per un'introduzione a gettext, dare un'occhiata a ``A Quick Gettext Tutorial <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_. È scritto per i progetti in C, ma molti dei consigli sono validi anche per Godot (ad eccezione di ``xgettext``).
ru: Для ознакомления с gettext посмотрите `A Quick Gettext Tutorial <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_. Он написан для проектов на C, но большая часть советов применима и к Godot (за исключением ``xgettext``).
ta: உரைபெறு க்கான அறிமுகத்திற்கு, `விரைவான உரைபெறு டுடோரியலை <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html> _ _ ஐப் பாருங்கள். இது சி திட்டங்களை மனதில் கொண்டு எழுதப்பட்டுள்ளது, ஆனால் பெரும்பாலான ஆலோசனைகள் கோடோட்டிற்கும் பொருந்தும் (`` xgetText`` தவிர).
uk: Для знайомства з gettext, перегляньте `Короткий Посібник з Gettext <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_. Він написаний для проектів на С, але велика частина порад підійде і для Godot (за винятком ``xgettext``).
zh_cn: 有关 gettext 的介绍，请查看\ `快速 Gettext 教程 <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_\ 。它是针对 C 项目编写的，但其中许多建议也适用于 Godot（\ ``xgettext``\ 除外）。
zh_tw: 如需 gettext 的基礎介紹，請參考 `A Quick Gettext Tutorial <https://www.labri.fr/perso/fleury/posts/programming/a-quick-gettext-tutorial.html>`_。雖然該教學以 C 專案為例，但大多數內容同樣適用於 Godot（除了 ``xgettext`` 相關部分）。

source: For the complete documentation, see `GNU Gettext <https://www.gnu.org/software/gettext/manual/gettext.html>`_.
it: Per la documentazione completa, consultare `GNU Gettext <https://www.gnu.org/software/gettext/manual/gettext.html>`_.
ru: Полную документацию см. в `GNU Gettext <https://www.gnu.org/software/gettext/manual/gettext.html>`_.
ta: முழுமையான ஆவணங்களுக்கு, `குனு உரைபெறு <https://www.gnu.org/software/gettext/manual/gettext.html>` _ ஐப் பார்க்கவும்.
uk: Повну документацію див. за посиланням `GNU Gettext <https://www.gnu.org/software/gettext/manual/gettext.html>`_.

source: Advantages
ga: Buntáistí
it: Vantaggi
ru: Преимущества
ta: நன்மைகள்
uk: Переваги
zh_cn: 优势
zh_tw: 優點

source: gettext is a standard format, which can be edited using any text editor or GUI editors such as `Poedit <https://poedit.net/>`_. This can be significant as it provides a lot of tools for translators, such as marking outdated strings, finding strings that haven't been translated etc.
ru: gettext — это стандартный формат, который можно редактировать в любом текстовом редакторе или графическом редакторе, например, `Poedit <https://poedit.net/>`_. Это может быть важно, поскольку он предоставляет множество инструментов для переводчиков, таких как отметка устаревших строк, поиск непереведенных строк и т. д.
ta: உரைபெறு என்பது ஒரு நிலையான வடிவமாகும், இது `Poedit <https://poedit.net/>` _ போன்ற எந்த உரை எடிட்டர் அல்லது GUI ஆசிரியர்களைப் பயன்படுத்தி திருத்தப்படலாம். காலாவதியான சரங்களைக் குறிப்பது, மொழிபெயர்க்கப்படாத சரங்களைக் கண்டுபிடிப்பது போன்ற மொழிபெயர்ப்பாளர்களுக்கு இது நிறைய கருவிகளை வழங்குவதால் இது குறிப்பிடத்தக்கதாக இருக்கும்.

source: gettext supports plurals and context.
ru: gettext поддерживает множественное число и контекст.
ta: உரைபெறு பன்மை மற்றும் சூழலை ஆதரிக்கிறது.

source: gettext is supported by translation platforms such as `Transifex <https://www.transifex.com/>`_ and `Weblate <https://weblate.org/>`_, which makes it easier for people to collaborate to localization.
ga: Tacaíonn ardáin aistriúcháin ar nós `Transifex <https://www.transifex.com/>`_ agus `Weblate <https://weblate.org/>`_ le gettext, rud a fhágann gur fusa do dhaoine comhoibriú le logánú .
it: gettext è supportato da piattaforme di traduzione come `Transifex <https://www.transifex.com/>`_ e `Weblate <https://weblate.org/>`_, il che rende più facile collaborare alla localizzazione.
ru: gettext поддерживается такими платформами перевода, как `Transifex <https://www.transifex.com/>`_ и `Weblate <https://weblate.org/>`_, что облегчает совместную работу людей над локализацией.
ta: `டிரான்ச்ஃபெக்ச் <https://www.transifex.com/>` _ மற்றும் `வெப்லேட் <https://weblate.org/>` _ போன்ற மொழிபெயர்ப்பு தளங்களால் உரைபெறு ஆதரிக்கப்படுகிறது, இது மக்கள் உள்ளூர்மயமாக்கலுக்கு ஒத்துழைப்பதை எளிதாக்குகிறது .
uk: gettext підтримується платформами перекладу, такими як `Transifex <https://www.transifex.com/>`_ та `Weblate <https://weblate.org/>`_, що полегшує людям співпрацю по локалізації.
zh_cn: `Transifex <https://www.transifex.com/>`_ 和 `Weblate <https://weblate.org/>`_ 等翻译平台也支持 gettext，让人们可以更容易地进行本地化协作。
zh_tw: 如 `Transifex <https://www.transifex.com/>`_ 及 `Weblate <https://weblate.org/>`_ 等翻譯平台也支援 gettext，讓多人協作在地化更加便利。

source: Compared to CSV, gettext files work better with version control systems like Git, as each locale has its own messages file.
it: Rispetto a CSV, i file gettext funzionano meglio con i sistemi di controllo versioni come Git, poiché ogni localizzazione ha il proprio file di messaggi.
ru: По сравнению с CSV, файлы gettext лучше работают с системами контроля версий, такими как Git, поскольку каждая локаль имеет свой собственный файл сообщений.
ta: காபிம உடன் ஒப்பிடும்போது, GIT போன்ற பதிப்பு கட்டுப்பாட்டு அமைப்புகளுடன் உரைபெறு கோப்புகள் சிறப்பாக செயல்படுகின்றன, ஏனெனில் ஒவ்வொரு இடத்திற்கும் அதன் சொந்த செய்திகள் கோப்பு உள்ளது.
uk: Порівняно з CSV, файли gettext краще працюють із системами контролю версій, такими як Git, оскільки кожна локалізація має свій власний файл повідомлень.

source: Multiline strings are more convenient to edit in gettext PO files compared to CSV files.
it: Le stringhe su più righe sono più comode da modificare nei file gettext PO rispetto ai file CSV.
ru: Многострочные строки удобнее редактировать в PO-файлах gettext, чем в CSV-файлах.
ta: காபிம கோப்புகளுடன் ஒப்பிடும்போது உரைபெறு PO கோப்புகளில் திருத்த மல்டிலைன் சரங்கள் மிகவும் வசதியானவை.
uk: Багаторядкові рядки зручніше редагувати у файлах gettext PO порівняно з файлами CSV.

source: Disadvantages
ga: Míbhuntáistí
it: Svantaggi
ru: Недостатки
ta: குறைபாடுகள்
uk: Недоліки
zh_cn: 缺点
zh_tw: 缺點

source: gettext PO files have a more complex format than CSV and can be harder to grasp for people new to software localization.
it: I file gettext PO hanno un formato più complesso dei CSV e possono essere più difficili da comprendere per chi non è esperto con la localizzazione di software.
ru: Файлы PO gettext имеют более сложный формат, чем CSV, и их может быть сложнее понять новичкам в локализации программного обеспечения.
ta: உரைபெறு PO கோப்புகள் காபிம ஐ விட மிகவும் சிக்கலான வடிவமைப்பைக் கொண்டுள்ளன, மேலும் மென்பொருள் உள்ளூர்மயமாக்கலுக்கு புதியவர்களைப் புரிந்துகொள்வது கடினமாக இருக்கும்.
uk: Файли gettext PO мають складніший формат, ніж CSV, і їх може бути важче зрозуміти новачкам у локалізації програмного забезпечення.

source: People who maintain localization files will have to install gettext tools on their system. However, as Godot supports using text-based message files (``.po``), translators can test their work without having to install gettext tools.
ga: Beidh ar dhaoine a choinníonn comhaid logánaithe uirlisí gettext a shuiteáil ar a gcóras. Mar sin féin, de réir mar a thacaíonn Godot le comhaid teachtaireachta téacsbhunaithe (''.po''), is féidir le haistritheoirí a gcuid oibre a thástáil gan uirlisí gettext a shuiteáil.
it: Chi si occupa di gestire i file di localizzazione dovrà installare gli strumenti gettext sul proprio sistema. Tuttavia, poiché Godot supporta l'utilizzo di file di messaggi basati su testo (``.po``), i traduttori possono testare il proprio lavoro senza dover installare gli strumenti gettext.
ru: Тем, кто поддерживает файлы локализации, потребуется установить инструменты GetText в своей системе. Однако, поскольку Godot поддерживает использование текстовых файлов сообщений (``.po``), переводчики могут тестировать свою работу без установки инструментов GetText.
ta: உள்ளூர்மயமாக்கல் கோப்புகளை பராமரிக்கும் நபர்கள் தங்கள் கணினியில் கெட்டெக்ச்ட் கருவிகளை நிறுவ வேண்டும். இருப்பினும், உரை அடிப்படையிலான செய்தி கோப்புகளை (`` .போ``) பயன்படுத்துவதை கோடோட் ஆதரிப்பதால், மொழிபெயர்ப்பாளர்கள் உரைபெறு கருவிகளை நிறுவாமல் தங்கள் வேலையை சோதிக்க முடியும்.
uk: Люди, які підтримують файли локалізації, повинні будуть встановити в свою систему інструменти gettext. Однак, оскільки Godot підтримує використання текстових файлів повідомлень (``.po``), перекладачі можуть перевіряти свою роботу без необхідності встановлювати інструменти gettext.
zh_cn: 维护本地化文件的人员必须在其系统上安装 gettext 工具。但是，由于 Godot 支持使用基于文本的消息文件（\ ``.po``\ ），翻译人员无需安装 gettext 工具即可测试他们的工作。
zh_tw: 維護在地化檔案的人員需要在系統上安裝 gettext 工具。不過，由於 Godot 支援以文字為基礎的 ``.po`` 檔案，譯者無需安裝 gettext 工具也可直接測試翻譯成果。

source: gettext PO files usually use English as the base language. Translators will use this base language to translate to other languages. You could still user other languages as the base language, but this is not common.
it: I file PO di gettext solitamente usano l'inglese come lingua base. I traduttori useranno questa lingua base per tradurre in altre lingue. È comunque possibile usare altre lingue come lingua base, ma non è comune.
ru: В PO-файлах gettext обычно используется английский язык в качестве базового. Переводчики используют этот язык для перевода на другие языки. Вы также можете использовать другие языки в качестве базового, но это встречается нечасто.
ta: உரைபெறு PO கோப்புகள் பொதுவாக ஆங்கிலத்தை அடிப்படை மொழியாகப் பயன்படுத்துகின்றன. மொழிபெயர்ப்பாளர்கள் இந்த அடிப்படை மொழியைப் பயன்படுத்தி மற்ற மொழிகளுக்கு மொழிபெயர்க்கப்படுவார்கள். நீங்கள் இன்னும் பிற மொழிகளை அடிப்படை மொழியாகப் பயன்படுத்தலாம், ஆனால் இது பொதுவானதல்ல.
uk: Файли gettext PO зазвичай використовують англійську як базову мову. Перекладачі використовуватимуть цю базову мову для перекладу на інші мови. Ви все ще можете використовувати інші мови як базову, але це не поширене явище.

source: Installing gettext tools
ga: Uirlisí gettext a shuiteáil
it: Installare gli strumenti gettext
ru: Установка инструментов gettext
ta: உரைபெறு கருவிகளை நிறுவுதல்
uk: Встановлення інструментів gettext
zh_cn: 安装 gettext 工具
zh_tw: 安裝 gettext 工具

source: The command line gettext tools are required to perform maintenance operations, such as updating message files. Therefore, it's strongly recommended to install them.
ga: Tá uirlisí gettext líne na n-orduithe ag teastáil chun oibríochtaí cothabhála a dhéanamh, mar shampla comhaid teachtaireachta a nuashonrú. Dá bhrí sin, moltar go láidir iad a shuiteáil.
it: Gli strumenti gettext da riga di comando sono necessari per eseguire operazioni di manutenzione, come aggiornare i file di messaggi. Pertanto, si consiglia vivamente di installarli.
ru: Инструменты командной строки gettext необходимы для выполнения операций обслуживания, таких как обновление файлов сообщений. Поэтому настоятельно рекомендуется их установить.
ta: செய்தி கோப்புகளைப் புதுப்பிப்பது போன்ற பராமரிப்பு செயல்பாடுகளைச் செய்ய கட்டளை வரி உரைபெறு கருவிகள் தேவை. எனவே, அவற்றை நிறுவ கடுமையாக பரிந்துரைக்கப்படுகிறது.
uk: Інструменти командного рядка gettext необхідні для виконання операцій технічного обслуговування, таких як оновлення файлів повідомлень. Тому настійно рекомендуємо їх встановити.
zh_cn: 命令行 gettext 工具是执行维护操作（例如更新消息文件）所必需的。因此，强烈建议安装它们。
zh_tw: 部分維護操作（如更新訊息檔案）需使用命令列 gettext 工具，因此強烈建議安裝。

source: **Windows:** Download an installer from `this page <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_. Any architecture and binary type (shared or static) works; if in doubt, choose the 64-bit static installer.
ga: **Windows:** Íoslódáil suiteálaí ón leathanach seo <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_. Aon ailtireacht agus oibreacha de chineál dénártha (roinnte nó statach); má tá amhras ort, roghnaigh an suiteálaí statach 64-giotán.
it: **Windows:** Scaricare un installer da `questa pagina <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_. Funziona con qualsiasi architettura e tipo di binario (condiviso o statico); in caso di dubbio, scegliere l'installer statico a 64 bit.
ru: **Windows:** Загрузите программу установки с `этой страницы <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_. Работает любая архитектура и бинарный тип (разделяемый или статический); если есть сомнения, выбирайте 64-битный статический инсталлятор.
ta: . எந்த கட்டிடக்கலை மற்றும் பைனரி வகை (பகிரப்பட்ட அல்லது நிலையான) வேலை செய்கிறது; ஐயம் இருந்தால், 64-பிட் நிலையான நிறுவியைத் தேர்வுசெய்க.
uk: **Windows:** Завантажте інсталятор з `цієї сторінки <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_. Працює будь-яка архітектура і бінарний тип (спільний, чи статичний); якщо ви сумніваєтеся, виберіть 64-розрядний статичний інсталятор.
zh_cn: **Windows：**\ 从\ `该页面 <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_\ 下载安装程序。任何架构和二进制类型（共享或静态）均可；如有疑问，请选择 64 位静态安装程序。
zh_tw: **Windows：** 請從 `此頁面 <https://mlocati.github.io/articles/gettext-iconv-windows.html>`_ 下載安裝程式。各種架構與二進位型式（動態或靜態）皆可使用；若不確定，建議選擇 64 位元靜態安裝程式。

source: **macOS:** Install gettext either using `Homebrew <https://brew.sh/>`_ with the ``brew install gettext`` command, or using `MacPorts <https://www.macports.org/>`_ with the ``sudo port install gettext`` command.
ga: **macOS:** Suiteáil gettext trí úsáid a bhaint as `Homebrew <https://brew.sh/>`_ leis an ordú `` brew install gettext``, nó ag baint úsáide as `MacPorts <https://www.macports.org/ >`_ leis an ordú `` sudo port install gettext``.
it: **macOS:** Installare gettext tramite `Homebrew <https://brew.sh/>`_ con il comando ``brew install gettext`` oppure tramite `MacPorts <https://www.macports.org/>`_ con il comando ``sudo port install gettext``.
ru: **macOS:** Установите gettext либо с помощью `Homebrew <https://brew.sh/>`_ с командой ``brew install gettext``, либо с помощью ``MacPorts <https://www.macports.org/>`_ с командой ``sudo port install gettext``.
ta: . > `` சூடோ துறைமுகம் நிறுவல் getText`` கட்டளையுடன்.
uk: **macOS:** Встановіть gettext або за допомогою `Homebrew <https://brew.sh/>`_ за допомогою команди ``brew install gettext``, або за допомогою `MacPorts <https://www.macports.org/>`_ з командою ``sudo port install gettext``.
zh_cn: **macOS：**\ 使用 `Homebrew <https://brew.sh/>`_ 的 ``brew install gettext`` 命令来安装 gettext，或使用 `MacPorts <https://www.macports.org/>`_ 的 ``sudo port install gettext`` 命令来安装。
zh_tw: **macOS：** 可透過 `Homebrew <https://brew.sh/>`_ 使用 ``brew install gettext`` 指令安裝，或使用 `MacPorts <https://www.macports.org/>`_ 的 ``sudo port install gettext`` 指令。

source: **Linux:** On most distributions, install the ``gettext`` package from your distribution's package manager.
ga: **Linux:** Ar fhormhór na ndáiltí, suiteáil an pacáiste ''gettext'' ó bhainisteoir pacáiste do dháileadh.
it: **Linux:** Nella maggior parte delle distribuzioni, installare il pacchetto ``gettext`` dal gestore pacchetti della propria distribuzione.
ru: **Linux:** В большинстве дистрибутивов установите пакет ``gettext`` из менеджера пакетов вашего дистрибутива.
ta: ** லினக்ச்: ** பெரும்பாலான விநியோகங்களில், உங்கள் விநியோகத்தின் தொகுப்பு மேலாளரிடமிருந்து `` getText`` தொகுப்பை நிறுவவும்.
uk: **Linux:** У більшості дистрибутивів встановіть ``gettext`` пакет із диспетчера пакунків дистрибутива.
zh_cn: **Linux：**\ 在大多数发行版上，请使用发行版的包管理器安装 ``gettext`` 包。
zh_tw: **Linux：** 在大多數發行版上，請透過套件管理器安裝 ``gettext`` 套件。

source: For a GUI tool you can get Poedit from its `Official website <https://poedit.net/>`_. The basic version is open source and available under the MIT license.
it: Per uno strumento GUI, è possibile scaricare Poedit dal suo `Sito web ufficiale <https://poedit.net/>`_. La versione base è open source e disponibile con la licenza MIT.
ru: Для графического интерфейса (GUI) Poedit можно загрузить с `Официального сайта <https://poedit.net/>`_. Базовая версия имеет открытый исходный код и доступна по лицензии MIT.
ta: ஒரு GUI கருவிக்கு நீங்கள் அதன் `அதிகாரப்பூர்வ வலைத்தளத்திலிருந்து <https://poedit.net/> _ _ இலிருந்து போய்டிட் பெறலாம். அடிப்படை பதிப்பு திறந்த மூலமாகும் மற்றும் எம்ஐடி உரிமத்தின் கீழ் கிடைக்கிறது.
uk: Для інструменту з графічним інтерфейсом ви можете завантажити Poedit з його `офіційного вебсайту <https://poedit.net/>`_. Базова версія має відкритий код та доступна за ліцензією MIT.

source: Creating the PO template
ga: An teimpléad PO a chruthú
it: Creare il modello PO
ru: Создание шаблона PO
ta: PO வார்ப்புருவை உருவாக்குதல்
uk: Створення шаблону замовлення на замовлення
zh_cn: 创建 PO 模板
zh_tw: 建立 PO 範本

source: Automatic generation using the editor
ga: Giniúint uathoibríoch ag baint úsáide as an eagarthóir
it: Generazione automatica utilizzando l'editor
ru: Автоматическая генерация с помощью редактора
ta: எடிட்டரைப் பயன்படுத்தி தானியங்கி தலைமுறை
uk: Автоматична генерація за допомогою редактора
zh_cn: 使用编辑器自动生成
zh_tw: 用編輯器自動產生

source: Since Godot 4.0, the editor can generate a PO template automatically from specified scene and GDScript files. This POT generation also supports translation contexts and pluralization if used in a script, with the optional second argument of ``tr()`` and the ``tr_n()`` method.
ga: Ós rud é Godot 4.0, is féidir leis an eagarthóir teimpléad PO a ghiniúint go huathoibríoch ó radharc sonraithe agus comhaid GDScript. Tacaíonn an ghlúin POT seo freisin le comhthéacsanna aistriúcháin agus iolrachas má úsáidtear iad i script, leis an dara hargóint roghnach de ''tr()'' agus an modh ''tr_n()''.
ru: Начиная с Godot 4.0, редактор может автоматически генерировать шаблон PO из указанных файлов сцены и GDScript. Эта генерация POT также поддерживает контексты перевода и образование множественного числа при использовании в скрипте с помощью необязательного второго аргумента ``tr()`` и метода ``tr_n()``.
ta: கோடோட் 4.0 என்பதால், குறிப்பிட்ட காட்சி மற்றும் சி.டி.எச்ச்கிரிப்ட் கோப்புகளிலிருந்து தானாகவே ஒரு பிஓ வார்ப்புருவை ஆசிரியர் உருவாக்க முடியும். `` Tr () `` மற்றும் `` tr_n () `` முறையின் விருப்பமான இரண்டாவது வாதத்துடன், ச்கிரிப்ட்டில் பயன்படுத்தப்பட்டால் மொழிபெயர்ப்பு சூழல்களையும் பன்முகப்படுத்தலையும் இந்த பானை உருவாக்கம் ஆதரிக்கிறது.
zh_cn: 自 Godot 4.0 以来，编辑器可以从指定的场景和 GDScript 文件中自动生成 PO 模板。如果在脚本中使用，此 POT 生成还支持翻译上下文和复数形式，使用 ``tr()`` 和 ``tr_n()`` 方法的可选的第二个实参。
zh_tw: 自 Godot 4.0 起，編輯器可根據指定的場景與 GDScript 檔案自動產生 PO 範本。此 POT 產生亦支援翻譯語境與複數形式（如於腳本中使用 ``tr()`` 的第二參數或 ``tr_n()`` 方法）。

source: Open the Project Settings' **Localization > POT Generation** tab, then use the **Add…** button to specify the path to your project's scenes and scripts that contain localizable strings:
ga: Oscail cluaisín ** Logánú > Giniúint POT** Socruithe an Tionscadail, ansin bain úsáid as an gcnaipe **Cuir…** leis chun an chonair chuig radhairc agus scripteanna do thionscadail a shonrú a bhfuil teaghráin logánta iontu:
ru: Откройте вкладку **Localization > POT Generation** в настройках проекта, затем используйте кнопку **Add…**, чтобы указать путь к сценам и скриптам вашего проекта, содержащим локализуемые строки:
ta: திட்ட அமைப்புகளின் '** உள்ளூர்மயமாக்கல்> பானை உருவாக்கம் ** தாவலைத் திறந்து, பின்னர் உங்கள் திட்டத்தின் காட்சிகள் மற்றும் உள்ளூர்மயமாக்கக்கூடிய சரங்களைக் கொண்ட ச்கிரிப்ட்களுக்கான பாதையை குறிப்பிட ** சேர்… ** பொத்தானைப் பயன்படுத்தவும்:
zh_cn: 打开项目设置的\ **本地化 > POT 生成**\ 选项卡，然后使用\ **添加...** 按钮指定项目中包含可本地化字符串的场景和脚本的路径：
zh_tw: 開啟專案設定的 **在地化 > POT 產生** 分頁，點選 **新增…** 按鈕，指定專案中含有可在地化字串的場景與腳本路徑：

source: Creating a PO template in the Localization > POT Generation tab of the Project Settings
ga: Teimpléad PO a chruthú sa chluaisín Logánú > Giniúint POT i Socruithe an Tionscadail
ru: Создание шаблона PO на вкладке "Localization > POT Generation" в Project Settings
ta: திட்ட அமைப்புகளின் உள்ளூர்மயமாக்கல்> பானை தலைமுறை தாவலில் ஒரு PO வார்ப்புருவை உருவாக்குதல்
zh_cn: 在项目设置的“本地化 > POT 生成”选项卡中创建 PO 模板
zh_tw: 於專案設定的「在地化 > POT 產生」分頁中建立 PO 範本

source: Creating a PO template in the **Localization > POT Generation** tab of the Project Settings
ga: Teimpléad PO a chruthú sa chluaisín ** Logánú > Giniúint POT** i Socruithe an Tionscadail
ru: Создание шаблона PO на вкладке **Localization > POT Generation** в Project Settings
ta: திட்ட அமைப்புகளின் ** உள்ளூராக்கல்> பானை உருவாக்கம் ** தாவலில் ஒரு PO வார்ப்புருவை உருவாக்குதல்
zh_cn: 在项目设置的\ **本地化 > POT 生成**\ 选项卡中创建 PO 模板
zh_tw: 於專案設定的 **在地化 > POT 產生** 分頁中建立 PO 範本

source: After adding at least one scene or script, click **Generate POT** in the top-right corner, then specify the path to the output file. This file can be placed anywhere in the project directory, but it's recommended to keep it in a subdirectory such as ``locale``, as each locale will be defined in its own file.
ga: Tar éis radharc nó script amháin ar a laghad a chur leis, cliceáil ** Gin POT ** sa chúinne ar bharr ar dheis, ansin sonraigh an cosán chuig an gcomhad aschuir. Is féidir an comhad seo a chur áit ar bith san eolaire tionscadail, ach moltar é a choinneáil i bhfochomhadlann ar nós ''locale'', mar go saineofar gach logán ina chomhad féin.
ru: После добавления хотя бы одной сцены или скрипта нажмите кнопку **Generate POT** в правом верхнем углу, а затем укажите путь к выходному файлу. Этот файл можно разместить в любом месте каталога проекта, но рекомендуется хранить его в подкаталоге, например ``locale``, поскольку каждая локаль будет определена в отдельном файле.
ta: குறைந்தது ஒரு காட்சி அல்லது ச்கிரிப்டைச் சேர்த்த பிறகு, மேல்-வலது மூலையில் ** பானை உருவாக்க ** என்பதைக் சொடுக்கு செய்து, வெளியீட்டு கோப்பிற்கான பாதையை குறிப்பிடவும். இந்த கோப்பை திட்ட கோப்பகத்தில் எங்கும் வைக்கலாம், ஆனால் ஒவ்வொரு இடமும் அதன் சொந்த கோப்பில் வரையறுக்கப்படும் என்பதால், அதை `` லோகேல்` போன்ற துணை அடைவில் வைத்திருக்க பரிந்துரைக்கப்படுகிறது.
zh_cn: 添加至少一个场景或脚本后，点击右上角的\ **生成 POT**\ ，然后指定输出文件的路径。该文件可以放在项目目录中的任何位置，但建议将其保存在子目录如 ``locale``\ 中，因为每个区域都将在其自己的文件中定义。
zh_tw: 新增至少一個場景或腳本後，請點選右上角的 **產生 POT**，再指定輸出檔案的路徑。該檔案可存放於專案目錄任一位置，但建議集中於如 ``locale`` 的子目錄，因每種語言環境將有獨立檔案。
