Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/localization_using_gettext.po
Languages: ga, it, ru, ta, uk, zh_cn, zh_tw

source: See :ref:`below <doc_localization_using_gettext_gdscript>` for how to add comments for translators or exclude some strings from being added to the PO template for GDScript files.
it: Vedere :ref:`di seguito <doc_localization_using_gettext_gdscript>` per informazioni su come aggiungere commenti per i traduttori o escludere alcune stringhe dall'aggiunta al modello PO per i file GDScript.
ru: См. :ref:`below <doc_localization_using_gettext_gdscript>` информацию о том, как добавлять комментарии для переводчиков или исключать некоторые строки из добавления в шаблон PO для файлов GDScript.
ta: காண்க: ref: `கீழே <doc_localization_using_gettext_gdscript>` மொழிபெயர்ப்பாளர்களுக்கான கருத்துகளை எவ்வாறு சேர்ப்பது அல்லது சில சரங்களை gdscript கோப்புகளுக்கான PO வார்ப்புருவில் சேர்க்காமல் விலக்குவது.
uk: Дивіться :ref:`below <doc_localization_using_gettext_gdscript>`, щоб дізнатися, як додати коментарі для перекладачів або виключити деякі рядки з додавання до шаблону PO для файлів GDScript.
zh_cn: 请参阅\ :ref:`下文 <doc_localization_using_gettext_gdscript>`\ 了解如何添加面向翻译者的注释，以及如何从 GDScript 文件的 PO 模板中排除某些字符串。
zh_tw: 關於在 GDScript 檔案中加入譯者註解或排除特定字串不加入 PO 範本，請參閱下方 :ref:`doc_localization_using_gettext_gdscript`。

source: You can then move over to :ref:`creating a messages file from a PO template <doc_localization_using_gettext_messages_file>`.
ga: Is féidir leat bogadh anonn ansin go :ref: `comhad teachtaireachtaí a chruthú ó theimpléad PO <doc_localization_using_gettext_messages_file>`.
it: Si può quindi passare alla :ref:`creazione di un file di messaggi da un modello PO <doc_localization_using_gettext_messages_file>`.
ru: Затем вы можете перейти к :ref:`creating a messages file from a PO template <doc_localization_using_gettext_messages_file>`.
ta: நீங்கள் அதற்கு முன்னேறலாம்: ref: `ஒரு PO வார்ப்புருவில் இருந்து ஒரு செய்திகளை உருவாக்குதல் <doc_localization_using_gettext_messages_file>`.
uk: Потім ви можете перейти до :ref:`створення файлу повідомлень із шаблону PO <doc_localization_using_gettext_messages_file>`.
zh_cn: 然后就可以转到《\ :ref:`从 PO 模板创建消息文件 <doc_localization_using_gettext_messages_file>`\ 》。
zh_tw: 接著，請參考 :ref:`如何從 PO 範本建立訊息檔 <doc_localization_using_gettext_messages_file>`。

source: Remember to regenerate the PO template after making any changes to localizable strings, or after adding new scenes or scripts. Otherwise, newly added strings will not be localizable and translators won't be able to update translations for outdated strings.
ga: Cuimhnigh an teimpléad PO a athghiniúint tar éis aon athruithe a dhéanamh ar théada logánaithe, nó tar éis radhairc nó scripteanna nua a chur leis. Seachas sin, ní bheidh teaghráin nua-bhreise logánaithe agus ní bheidh aistritheoirí in ann aistriúcháin a nuashonrú le haghaidh teaghráin atá as dáta.
it: Ricordare di rigenerare il modello PO dopo aver apportato modifiche alle stringhe localizzabili o dopo aver aggiunto nuove scene o script. Altrimenti, le stringhe nuovamente aggiunte non saranno localizzabili e i traduttori non saranno in grado di aggiornare le traduzioni per le stringhe obsolete.
ru: Не забудьте перегенерировать шаблон PO после внесения любых изменений в локализуемые строки или добавления новых сцен или сценариев. В противном случае вновь добавленные строки не будут локализованы, и переводчики не смогут обновить переводы устаревших строк.
ta: உள்ளூர்மயமாக்கக்கூடிய சரங்களில் ஏதேனும் மாற்றங்களைச் செய்தபின் அல்லது புதிய காட்சிகள் அல்லது ச்கிரிப்ட்களைச் சேர்த்த பிறகு PO வார்ப்புருவை மீண்டும் உருவாக்க நினைவில் கொள்ளுங்கள். இல்லையெனில், புதிதாக சேர்க்கப்பட்ட சரங்கள் உள்ளூர்மயமாக்க முடியாதவை மற்றும் மொழிபெயர்ப்பாளர்கள் காலாவதியான சரங்களுக்கான மொழிபெயர்ப்புகளைப் புதுப்பிக்க முடியாது.
uk: Не забувайте повторно генерувати шаблон PO після внесення будь-яких змін у локалізовані рядки або після додавання нових сцен чи сценаріїв. Інакше щойно додані рядки не можна буде локалізувати, а перекладачі не зможуть оновити переклади для застарілих рядків.
zh_cn: 请记住，在对可本地化的字符串进行任何更改或新增新场景或脚本后重新生成 PO 模板。否则，新添加的字符串将不可本地化，并且翻译人员将无法更新过时字符串的翻译。
zh_tw: 每當你變更可在地化字串、或新增場景、腳本後，請記得重新產生 PO 範本。否則，新字串將無法在地化，且舊有字串的翻譯也無法及時更新。

source: If the automatic generation approach doesn't work out for your needs, you can create a PO template by hand in a text editor. This file can be placed anywhere in the project directory, but it's recommended to keep it in a subdirectory, as each locale will be defined in its own file.
ga: Mura n-oibríonn an cur chuige giniúna uathoibríoch amach do chuid riachtanas, is féidir leat teimpléad PO a chruthú de láimh in eagarthóir téacs. Is féidir an comhad seo a chur in áit ar bith san eolaire tionscadail, ach moltar é a choinneáil i bhfochomhadlann, mar go saineofar gach logán ina chomhad féin.
it: Se l'approccio della generazione automatica non dovesse funzionare, è possibile creare manualmente un modello PO in un editor di testo. Questo file può essere situato ovunque nella cartella del progetto, ma è consigliabile mantenerlo in una sottocartella, poiché ogni localizzazione sarà definita in un file separato.
ru: Если автоматическая генерация вам не подходит, вы можете создать шаблон PO вручную в текстовом редакторе. Этот файл можно разместить в любом месте каталога проекта, но рекомендуется хранить его в подкаталоге, так как каждая локаль будет определена в отдельном файле.
ta: உங்கள் தேவைகளுக்கு தானியங்கி தலைமுறை அணுகுமுறை செயல்படவில்லை என்றால், நீங்கள் ஒரு உரை எடிட்டரில் கையால் ஒரு PO வார்ப்புருவை உருவாக்கலாம். இந்த கோப்பை திட்ட கோப்பகத்தில் எங்கும் வைக்கலாம், ஆனால் ஒவ்வொரு இடமும் அதன் சொந்த கோப்பில் வரையறுக்கப்படும் என்பதால், அதை ஒரு துணை அடைவில் வைத்திருக்க பரிந்துரைக்கப்படுகிறது.
uk: Якщо підхід автоматичного створення не підходить для ваших потреб, ви можете створити шаблон замовлення на замовлення вручну в текстовому редакторі. Цей файл можна розмістити будь-де в каталозі проекту, але рекомендується зберігати його в підкаталозі, оскільки кожна локаль буде визначена в окремому файлі.
zh_cn: 如果该自动生成的方法不能满足你的需求，你可以在文本编辑器中手动创建 PO 模板。该文件可以放在项目目录中的任何位置，但建议将其保存在子目录中，因为每个区域设置都将在其自己的文件中定义。
zh_tw: 如果自動產生無法滿足需求，你也可以用文字編輯器手動建立 PO 範本。檔案可放在專案目錄任意位置，但建議集中於子目錄，以利各語言版本管理。

source: Create a directory named ``locale`` in the project directory. In this directory, save a file named ``messages.pot`` with the following contents:
ga: Cruthaigh comhadlann darb ainm ''locale'' san eolaire tionscadail. Sa chomhadlann seo, sábháil comhad darb ainm ''messages.pot'' leis an ábhar seo a leanas:
ru: Создайте каталог ``locale`` в каталоге проекта. В этом каталоге сохраните файл ``messages.pot`` со следующим содержимым:
ta: திட்ட கோப்பகத்தில் `` லோகேல்`` என்ற கோப்பகத்தை உருவாக்கவும். இந்த கோப்பகத்தில், பின்வரும் உள்ளடக்கங்களுடன் `` செய்திகள்.போட்`` என்ற கோப்பை சேமிக்கவும்:
zh_cn: 在项目目录中创建一个名为 ``locale`` 的目录。在该目录中，保存一个名为 ``messages.pot`` 的文件，其内容如下：
zh_tw: 在專案目錄下建立名為 ``locale`` 的資料夾，並於該資料夾內儲存名為 ``messages.pot`` 的檔案，內容如下：

source: Messages in gettext are made of ``msgid`` and ``msgstr`` pairs. ``msgid`` is the source string (usually in English), ``msgstr`` will be the translated string.
ga: Teachtaireachtaí i gettext atá déanta as ''msgid'' agus ''msgstr'' péirí. Is é ''msgid'' an teaghrán foinseach (i mBéarla de ghnáth), is é ''msgstr'' an teaghrán aistrithe.
it: I messaggi in gettext sono composti dalle coppie ``msgid`` e ``msgstr``. ``msgid`` è la stringa sorgente (solitamente in inglese), ``msgstr`` sarà la stringa tradotta.
ru: Сообщения в gettext состоят из пар ``msgid`` и ``msgstr``. ``msgid`` - это исходная строка (обычно на английском языке), ``msgstr`` - это переведенная строка.
ta: உரைபெறு இல் உள்ள செய்திகள் `` msgid`` மற்றும் `` msgstr` `சோடிகளால் ஆனவை. `` msgid`` என்பது மூல சரம் (பொதுவாக ஆங்கிலத்தில்), `` msgstr`` மொழிபெயர்க்கப்பட்ட சரமாக இருக்கும்.
uk: Повідомлення в gettext складаються з пар ``msgid`` і ``msgstr``. ``msgid`` є вихідним рядком (зазвичай англійською мовою), ``msgstr`` буде перекладеним рядком.
zh_cn: gettext 中的消息由 ``msgid`` 和 ``msgstr`` 对组成。\ ``msgid`` 为源字符串（一般为英文），\ ``msgstr`` 为翻译后的字符串。
zh_tw: gettext 的訊息由 ``msgid`` 與 ``msgstr`` 配對組成。``msgid`` 是原文（通常為英文），``msgstr`` 則是對應的譯文。

source: The ``msgstr`` value in PO template files (``.pot``) should **always** be empty. Localization will be done in the generated ``.po`` files instead.
ga: Ba chóir go mbeadh an luach ''msgstr'' i gcomhaid teimpléid PO (''.pot'') **i gcónaí** folamh. Déanfar logánú sna comhaid ''.po'' a ghintear ina ionad.
it: Il valore ``msgstr`` nei file di modello PO (``.pot``) dovrebbe **sempre** essere vuoto. La localizzazione sarà invece effettuata nei file ``.po`` generati.
ru: Значение ``msgstr`` в файлах шаблонов PO (``.pot``) должно **всегда** быть пустым. Локализация будет выполнена в сгенерированных файлах ``.po`` вместо этого.
ta: PO வார்ப்புரு கோப்புகளில் (`` .pot``) `` msgstr`` மதிப்பு ** எப்போதும் ** காலியாக இருக்க வேண்டும். அதற்கு பதிலாக உருவாக்கப்பட்ட `` .po`` கோப்புகளில் உள்ளூர்மயமாக்கல் செய்யப்படும்.
uk: Значення ``msgstr`` у файлах шаблонів PO (``.pot``) **завжди** має бути порожнім. Локалізацію буде зроблено у згенерованих файлах ``.po``.
zh_cn: PO 模板文件（\ ``.pot``\ ）中的 ``msgstr`` 值应\ **始终**\ 为空。本地化会在生成的 ``.po`` 文件中进行。
zh_tw: PO 範本檔（``.pot``）裡的 ``msgstr`` 值應 **一律** 保持空白。在地化內容則會填寫於產生的 ``.po`` 檔案中。

source: Creating a messages file from a PO template
ga: Comhad teachtaireachtaí a chruthú ó theimpléad PO
it: Creare un file di messaggi da un modello PO
ru: Создание файла сообщений из шаблона PO
ta: PO வார்ப்புருவில் இருந்து ஒரு செய்திகளை உருவாக்குதல்
uk: Створення файлу повідомлень із шаблону PO
zh_cn: 从 PO 模板创建消息文件
zh_tw: 從 PO 範本建立訊息檔案

source: The ``msginit`` command is used to turn a PO template into a messages file. For instance, to create a French localization file, use the following command while in the ``locale`` directory:
ga: Úsáidtear an t-ordú ''msginit'' chun teimpléad PO a iompú ina chomhad teachtaireachtaí. Mar shampla, chun comhad logánaithe Francach a chruthú, bain úsáid as an ordú seo a leanas agus é san eolaire ''locale'':
it: Il comando ``msginit`` è utilizzato per trasformare un modello PO in un file di messaggi. Ad esempio, per creare un file di localizzazione in francese, utilizzare nella cartella ``locale`` il seguente comando:
ru: Команда ``msginit`` используется для превращения шаблона PO в файл сообщений. Например, чтобы создать файл французской локализации, используйте следующую команду, находясь в каталоге ``locale``:
ta: ஒரு PO வார்ப்புருவை செய்திகள் கோப்பாக மாற்ற `` MSGinit`` கட்டளை பயன்படுத்தப்படுகிறது. உதாரணமாக, ஒரு பிரெஞ்சு உள்ளூர்மயமாக்கல் கோப்பை உருவாக்க, `` லோகேல்`` கோப்பகத்தில் இருக்கும்போது பின்வரும் கட்டளையைப் பயன்படுத்தவும்:
uk: Команда ``msginit`` використовується для перетворення шаблону PO у файл повідомлень. Наприклад, щоб створити файл локалізації французької мови, скористайтеся такою командою, перебуваючи в каталозі ``locale``:
zh_cn: ``msginit`` 命令用于将 PO 模板转换为消息文件。例如，要创建法语本地化文件，请在 ``locale`` 目录中使用以下命令：
zh_tw: ``msginit`` 指令可將 PO 範本轉換為訊息檔案。例如，若要建立法文翻譯檔，請在 ``locale`` 目錄下執行以下指令：

source: The command above will create a file named ``fr.po`` in the same directory as the PO template.
ga: Cruthóidh an t-ordú thuas comhad darb ainm ''fr.po'' san eolaire céanna leis an teimpléad PO.
it: Il comando sopra riportato creerà un file denominato ``fr.po`` nella stessa cartella del modello PO.
ru: Приведенная выше команда создаст файл с именем ``fr.po`` в том же каталоге, что и шаблон PO.
ta: மேலே உள்ள கட்டளை PO வார்ப்புருவின் அதே கோப்பகத்தில் `` fr.po`` என்ற கோப்பை உருவாக்கும்.
uk: Команда вище створить файл ``fr.po``, в тому ж каталозі, що і шаблон PO.
zh_cn: 上面的命令会在 PO 模板所在的目录下创建一个名为 ``fr.po`` 的文件。
zh_tw: 上述指令會在同目錄下產生名為 ``fr.po`` 的檔案。

source: Alternatively, you can do that graphically using Poedit, or by uploading the POT file to your web platform of choice.
ga: De rogha air sin, is féidir leat é sin a dhéanamh go grafach ag baint úsáide as Poedit, nó tríd an gcomhad POT a uaslódáil chuig do rogha ardán gréasáin.
it: In alternativa, è possibile fare ciò graficamente tramite Poedit oppure caricando il file POT su una piattaforma web a scelta.
ru: Кроме того, это можно сделать графически с помощью Poedit или загрузив файл POT на выбранную вами веб-платформу.
ta: மாற்றாக, நீங்கள் அதை வரைபடமாக போய்டிட்டைப் பயன்படுத்தி செய்யலாம் அல்லது பானை கோப்பை உங்கள் வலை தளத்தில் பதிவேற்றுவதன் மூலம் செய்யலாம்.
uk: Крім того, ви можете зробити це графічно за допомогою Poedit, або завантаживши файл POT на свою веб-платформу за вибором.
zh_cn: 你也可以使用 Poedit 以图形方式完成此操作，或者通过将 POT 文件上传到你选择的 Web 平台。
zh_tw: 你也可以用 Poedit 圖形介面操作，或將 POT 檔上傳至你選用的協作平台來建立。

source: Loading a messages file in Godot
ga: Comhad teachtaireachtaí á luchtú i Godot
it: Caricare un file di messaggi in Godot
ru: Загрузка файла сообщений в Godot
ta: கோடோட்டில் ஒரு செய்திகளை ஏற்றுகிறது
uk: Завантаження файлу повідомлень у Godot
zh_cn: 在 Godot 中加载消息文件
zh_tw: 在 Godot 載入訊息檔案

source: To register a messages file as a translation in a project, open the **Project Settings**, then go to the **Localization** tab. In **Translations**, click **Add…** then choose the ``.po`` or ``.mo`` file in the file dialog. The locale will be inferred from the ``"Language: <code>\n"`` property in the messages file.
ga: Chun comhad teachtaireachtaí a chlárú mar aistriúchán i dtionscadal, oscail **Socruithe an Tionscadail**, ansin téigh go dtí an táb **Localization**. In **Aistriúcháin**, cliceáil **Cuir leis…** ansin roghnaigh an comhad ``.po`` nó ``.mo`` sa dialóg comhaid. Déanfar an logán a thuiscint ón airí ``"Teanga: <code>\n"`` sa chomhad teachtaireachtaí.
ru: Чтобы зарегистрировать файл сообщений в качестве перевода в проекте, откройте **Project Settings** и перейдите на вкладку **Localization**. В разделе **Translations** нажмите **Add…** и выберите файл ``.po`` или ``.mo`` в диалоговом окне файла. Локаль будет определена из свойства ``"Language: <code>\n"`` в файле сообщений.
ta: ஒரு திட்டத்தில் மொழிபெயர்ப்பாக ஒரு செய்திகளை பதிவு செய்ய, ** திட்ட அமைப்புகள் ** ஐத் திறந்து, பின்னர் ** உள்ளூர்மயமாக்கல் ** தாவலுக்குச் செல்லவும். ** மொழிபெயர்ப்புகளில் **, ** சேர்… ** என்பதைக் சொடுக்கு செய்க… ** பின்னர் கோப்பு உரையாடலில் `` .போ`` அல்லது `.mo`` கோப்பைத் தேர்வுசெய்க. செய்திகள் கோப்பில் உள்ள `` "மொழி: <code> \ n" `` சொத்திலிருந்து லோகேல் ஊகிக்கப்படும்.
zh_cn: 如果要将消息文件注册为项目的翻译，请打开\ **项目设置**\ ，然后进入\ **本地化**\ 选项卡。在\ **翻译**\ 中单击\ **添加...**\ ，然后在文件对话框中选择该 ``.po`` 或者 ``.mo`` 文件。区域设置将从消息文件的 ``"Language: <code>\n"`` 属性中推断出来。
zh_tw: 若要將訊息檔註冊為專案翻譯，請打開 **專案設定**，進入 **在地化** 分頁。在 **翻譯** 區域點選 **新增...**，於檔案對話框選擇 ``.po`` 或 ``.mo`` 檔案。語言區域會根據訊息檔中的 ``"Language: <code>\n"`` 屬性自動判斷。

source: See :ref:`doc_internationalizing_games` for more information on importing and testing translations in Godot.
ga: Féach :ref:'doc_internationalizing_games' le haghaidh tuilleadh eolais ar aistriúcháin a iompórtáil agus a thástáil i Godot.
it: Consultare :ref:`doc_internationalizing_games` per ulteriori informazioni sull'importazione e il test delle traduzioni in Godot.
ru: Смотрите :ref:`doc_internationalizing_games` для получения дополнительной информации об импорте и тестировании переводов в Godot.
ta: காண்க: ref: `doc_internationaliging_games` கோடோட்டில் மொழிபெயர்ப்புகளை இறக்குமதி செய்தல் மற்றும் சோதிப்பது பற்றிய கூடுதல் தகவலுக்கு.
uk: Дивіться :ref:`doc_internationalizing_games`, щоб дізнатися більше про імпорт і тестування перекладів у Godot.
zh_cn: 关于在 Godot 中导入和测试翻译的更多信息，请参阅《\ :ref:`doc_internationalizing_games`\ 》。
zh_tw: 更多關於在 Godot 匯入與測試翻譯的資訊，請參閱 :ref:`doc_internationalizing_games`。

source: Updating message files to follow the PO template
ga: Comhaid teachtaireachta á nuashonrú chun an teimpléad PO a leanúint
it: Aggiornare i file di messaggi per seguire il modello PO
ru: Обновление файлов сообщений в соответствии с шаблоном PO
ta: PO வார்ப்புருவைப் பின்பற்ற செய்தி கோப்புகளைப் புதுப்பித்தல்
uk: Оновлення файлів повідомлень для відповідності з шаблоном PO
zh_cn: 按照 PO 模板更新消息文件
zh_tw: 依照 PO 範本更新訊息檔案

source: After updating the PO template, you will have to update message files so that they contain new strings, while removing strings that are no longer present in the PO template. This can be done automatically using the ``msgmerge`` tool:
ga: Tar éis an teimpléad PO a nuashonrú, beidh ort comhaid teachtaireachta a nuashonrú ionas go mbeidh teaghráin nua iontu, agus teaghráin nach bhfuil i láthair sa teimpléad PO a thuilleadh a bhaint. Is féidir é seo a dhéanamh go huathoibríoch ag baint úsáide as an uirlis ''msgmerge'':
it: Dopo aver aggiornato il modello PO, sarà necessario aggiornare i file di messaggi in modo che contengano nuove stringhe, rimuovendo quelle non più presenti nel modello PO. Questa operazione si può effettuare automaticamente tramite lo strumento ``msgmerge``:
ru: После обновления шаблона PO вам нужно будет обновить файлы сообщений, чтобы они содержали новые строки, удалив при этом строки, которые больше не присутствуют в шаблоне PO. Это можно сделать автоматически с помощью инструмента ``msgmerge``:
ta: PO வார்ப்புருவைப் புதுப்பித்த பிறகு, நீங்கள் செய்தி கோப்புகளை புதுப்பிக்க வேண்டும், இதனால் அவை புதிய சரங்களைக் கொண்டிருக்க வேண்டும், அதே நேரத்தில் PO வார்ப்புருவில் இனி இல்லாத சரங்களை அகற்றும். `` Msgmerge`` கருவியைப் பயன்படுத்தி இதை தானாகவே செய்ய முடியும்:
uk: Після оновлення шаблону PO вам доведеться оновити файли повідомлень, щоб вони містили нові рядки, видаливши рядки, які більше не присутні в шаблоні PO. Зробити це можна автоматично за допомогою інструменту ``msgmerge``:
zh_cn: 更新 PO 模板后，你必须更新消息文件以使其包含新字符串，同时删除已经在 PO 模板中不复存在的字符串。这可以使用 ``msgmerge`` 工具自动完成：
zh_tw: 更新 PO 範本後，也要同步更新各語言訊息檔，以包含新字串並移除已不存在的字串。此操作可用 ``msgmerge`` 工具自動完成：

source: If you want to keep a backup of the original message file (which would be saved as ``fr.po~`` in this example), remove the ``--backup=none`` argument.
ga: Más mian leat cúltaca a choinneáil den bhunchomhad teachtaireachta (a shábhálfaí mar ''fr.po~'' sa sampla seo), bain an argóint ''--backup=none''.
it: Se si desidera conservare un backup del file di messaggi originale (che in questo esempio sarebbe salvato come ``fr.po~``), rimuovere l'argomento ``--backup=none``.
ru: Если вы хотите сохранить резервную копию исходного файла сообщения (который в данном примере будет сохранен как ``fr.po~``), удалите аргумент ``--backup=none``.
ta: அசல் செய்தி கோப்பின் காப்புப்பிரதியை நீங்கள் வைத்திருக்க விரும்பினால் (இது இந்த எடுத்துக்காட்டில் `` Fr.po ~ `` என சேமிக்கப்படும்), ``--Backup = எதுவுமில்லை` வாதத்தை அகற்றவும்.
uk: Якщо потрібно зберегти резервну копію вихідного файлу повідомлення (який буде збережено, як ``fr.po~`` у цьому прикладі), видаліть аргумент ``--backup=none``.
zh_cn: 如果你想保留原始消息文件的备份（在本例中会保存为 ``fr.po~``\ ），请删除 ``--backup=none`` 参数。
zh_tw: 若需保留原始訊息檔備份（如本例將備份為 ``fr.po~``），請移除 ``--backup=none`` 參數。

source: After running ``msgmerge``, strings which were modified in the source language will have a "fuzzy" comment added before them in the ``.po`` file. This comment denotes that the translation should be updated to match the new source string, as the translation will most likely be inaccurate until it's updated.
ga: Tar éis ''msgmerge'' a rith, beidh trácht "doiléir" curtha os a gcomhair sa chomhad ''.po'' ag teaghráin a athraíodh sa teanga fhoinseach. Léiríonn an trácht seo gur chóir an t-aistriúchán a nuashonrú chun an teaghrán foinse nua a mheaitseáil, mar is dóichí go mbeidh an t-aistriúchán míchruinn go dtí go ndéanfar é a nuashonrú.
it: Dopo aver eseguito ``msgmerge``, le stringhe modificate nella lingua di origine saranno precedute da un commento "fuzzy" nel file ``.po``. Questo commento indica che la traduzione si deve aggiornare per corrispondere alla nuova stringa di origine, poiché la traduzione sarà molto probabilmente non accurata finché non verrà aggiornata.
ru: После запуска ``msgmerge`` строки, изменённые на исходном языке, будут иметь в файле ``.po`` "нечёткий" комментарий. Этот комментарий означает, что перевод следует обновить в соответствии с новой исходной строкой, поскольку до обновления перевод, скорее всего, будет неточным.
ta: `` Msgmerge`` ஐ இயக்கிய பிறகு, மூல மொழியில் மாற்றியமைக்கப்பட்ட சரங்களுக்கு `` .போ`` கோப்பில் அவர்களுக்கு முன் சேர்க்கப்பட்ட "தெளிவற்ற" கருத்து இருக்கும். புதிய மூல சரத்துடன் பொருந்தக்கூடிய வகையில் மொழிபெயர்ப்பு புதுப்பிக்கப்பட வேண்டும் என்பதைக் குறிக்கிறது, ஏனெனில் மொழிபெயர்ப்பு புதுப்பிக்கப்படும் வரை துல்லியமாக இருக்கும்.
uk: Після запуску ``msgmerge``, рядки, змінені на мові оригіналу, матимуть "нечіткий" коментар, доданий до них у файлі ``.po``. Цей коментар означає, що переклад повинен бути оновлений відповідно до нового вихідного рядка, оскільки переклад, швидше за все, буде неточним, поки він не буде оновлений.
zh_cn: 运行 ``msgmerge`` 后，在 ``.po`` 文件中，源语言中修改过的字符串的前面会添加一条“fuzzy”注释。该注释表示翻译应更新以匹配新的源字符串，因为翻译在更新之前很可能是不准确的。
zh_tw: 執行 ``msgmerge`` 後，若原文有改動，則對應譯文前會自動添加 "fuzzy" 註解。這表示翻譯需檢查修正，否則可能已不精確。

source: Strings with "fuzzy" comments will **not** be read by Godot until the translation is updated and the "fuzzy" comment is removed.
ga: Beidh teaghráin le tuairimí "doiléir" ** ní ** a léamh ag Godot go dtí go bhfuil an t-aistriúchán cothrom le dáta agus an "doiléir" trácht a bhaint.
it: Le stringhe con commenti "fuzzy" **non** verranno lette da Godot finché la traduzione non verrà aggiornata e il commento "fuzzy" non verrà rimosso.
ru: Строки с "нечеткими" комментариями **не** будут прочитаны Godot, пока перевод не будет обновлен и "нечеткий" комментарий не будет удален.
ta: மொழிபெயர்ப்பு புதுப்பிக்கப்பட்டு, "தெளிவில்லாத" கருத்து அகற்றப்படும் வரை "தெளிவற்ற" கருத்துக்களைக் கொண்ட சரங்கள் ** ** கோடோட் படிக்காது.
uk: Рядки з "нечіткими" коментарями ("fuzzy") **не будуть** прочитані Godot, поки переклад не буде оновлений і "нечіткий" коментар не буде видалений.
zh_cn: 在翻译更新并删除“fuzzy”注释之前，Godot **不会**\ 读取带有“fuzzy”注释的字符串。
zh_tw: 帶有「fuzzy」註解的字串將**不會**被 Godot 讀取，直到翻譯被更新且「fuzzy」註解被移除。

source: Checking the validity of a PO file or template
ga: Bailíocht comhaid nó teimpléid PO a sheiceáil
it: Verificare la validità di un file o modello PO
ru: Проверка достоверности файла или шаблона PO
ta: ஒரு PO கோப்பு அல்லது வார்ப்புருவின் செல்லுபடியை சரிபார்க்கிறது
uk: Перевірка дійсності файлу PO, або шаблону
zh_cn: 检查 PO 文件或模板的有效性
zh_tw: 檢查 PO 檔案或範本有效性

source: It is possible to check whether a gettext file's syntax is valid.
it: È possibile verificare se la sintassi di un file gettext è valida.
ru: Можно проверить правильность синтаксиса файла gettext.
ta: உரைபெறு கோப்பின் தொடரியல் செல்லுபடியாகுமா என்பதை சரிபார்க்க முடியும்.
uk: Можна перевірити, чи є синтаксис файлу gettext коректним.

source: If you open with Poeditor, it will display the appropriate warnings if there's some syntax errors. You can also verify by running the gettext command below:
it: Se aperto con Poeditor, verranno mostrati gli avvisi appropriati se ci sono errori di sintassi. Si può anche verificare eseguendo il seguente comando gettext:
ru: Если открыть файл в Poeditor, он выведет соответствующие предупреждения, если есть синтаксические ошибки. Вы также можете проверить это, выполнив команду gettext ниже:
ta: நீங்கள் கவிதருடன் திறந்தால், சில தொடரியல் பிழைகள் இருந்தால் அது பொருத்தமான எச்சரிக்கைகளைக் காண்பிக்கும். கீழே உள்ள உரைபெறு கட்டளையை இயக்குவதன் மூலமும் நீங்கள் சரிபார்க்கலாம்:
uk: Якщо ви відкриєте за допомогою Poeditor, він відобразить відповідні попередження, якщо є якісь синтаксичні помилки. Ви також можете перевірити це, виконавши команду gettext нижче:
