Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_sdfgi.po
Languages: ga, pt_br, ru, ta, uk

source: The signed distance field is only updated when the camera moves in and out of a cascade. This means that if geometry is modified in the distance, the global illumination appearance will be correct once the camera gets closer. However, if a nearby object with a bake mode set to **Static** or **Dynamic** is moved (such as a door), the global illumination will appear incorrect until the camera moves away from the object.
ga: Ní dhéantar an réimse achair sínithe a nuashonrú ach nuair a bhogann an ceamara isteach agus amach as cascadh. Ciallaíonn sé seo má dhéantar geoiméadacht a mhodhnú san achar, go mbeidh an chuma soilsithe domhanda ceart nuair a thiocfaidh an ceamara níos gaire. Mar sin féin, má bhogtar réad in aice láimhe le modh bácála atá socraithe u**Statach** nó **Dinimic** (mar shampla doras), beidh an soilsiú domhanda mícheart go dtí go mbogann an ceamara ar shiúl ón réad.
pt_br: O campo de distância assinado (signed distance field) é atualizado apenas quando a câmera entra e sai de uma cascata. Isso significa que, se a geometria for modificada à distância, a aparência da iluminação global estará correta assim que a câmera se aproximar. No entanto, se um objeto próximo com o modo de cálculo (bake mode) definido como Static ou Dynamic for movido (como uma porta), a iluminação global parecerá incorreta até que a câmera se afaste do objeto.
ru: Поле знаковых расстояний обновляется только при перемещении камеры между каскадами. Это означает, что при изменении геометрии вдали глобальное освещение будет корректным после приближения камеры. Однако если перемещается близкий объект с режимом запекания **Static** или **Dynamic** (например, дверь), глобальное освещение будет отображаться некорректно до тех пор, пока камера не отдалится от объекта.
ta: கேமரா ஒரு அடுக்குக்கு உள்ளேயும் வெளியேயும் நகரும் போது மட்டுமே கையொப்பமிடப்பட்ட தூர புலம் புதுப்பிக்கப்படும். இதன் பொருள் தூரத்தில் வடிவியல் மாற்றியமைக்கப்பட்டால், கேமரா நெருங்கியவுடன் உலகளாவிய வெளிச்சம் சரியாக இருக்கும். இருப்பினும், ** நிலையான ** அல்லது ** மாறும் ** என அமைக்கப்பட்ட அருகிலுள்ள பொருள் (ஒரு கதவு போன்றவை) நகர்த்தப்பட்டால், கேமரா பொருளிலிருந்து விலகிச் செல்லும் வரை உலகளாவிய வெளிச்சம் தவறாக தோன்றும்.
uk: Поле відстані зі знаком оновлюється лише тоді, коли камера входить у каскад і виходить із нього. Це означає, що якщо геометрію змінено на відстані, зовнішній вигляд глобального освітлення буде правильним, коли камера наблизиться. Однак, якщо об’єкт поблизу, для якого встановлено режим запікання **Статичний** або **Динамічний**, переміщається (наприклад, двері), загальне освітлення відображатиметься неправильним, доки камера не відійде від об’єкта.

source: SDFGI's sharp reflections are only visible on opaque materials. Transparent materials will only use rough reflections, even if the material's roughness is lower than 0.2.
ga: Níl machnaimh ghéara SDFGI le feiceáil ach ar ábhair thrédhearcacha. Ní úsáidfidh ábhair thrédhearcacha ach machnaimh garbh, fiú má tá garbh an ábhair níos ísle ná 0.2.
pt_br: As reflexões nítidas (sharp reflections) do SDFGI são visíveis apenas em materiais opacos. Materiais transparentes usarão apenas reflexões ásperas (rough reflections), mesmo que a rugosidade (roughness) do material seja inferior a 0.2.
ru: Чёткие отражения в SDFGI видны только на непрозрачных материалах. Прозрачные материалы используют только размытые отражения, даже если шероховатость (roughness) материала меньше ``0.2``.
ta: SDFGI இன் கூர்மையான பிரதிபலிப்புகள் ஒளிபுகா பொருட்களில் மட்டுமே தெரியும். பொருளின் கடினத்தன்மை 0.2 ஐ விட குறைவாக இருந்தாலும், வெளிப்படையான பொருட்கள் தோராயமான பிரதிபலிப்புகளை மட்டுமே பயன்படுத்தும்.
uk: Різкі відблиски SDFGI помітні лише на непрозорих матеріалах. Прозорі матеріали використовуватимуть лише грубі відображення, навіть якщо шорсткість матеріалу нижча за 0,2.

source: SDFGI is only supported when using the Forward Plus rendering backend, not the Forward Mobile or Compatibility backends.
ta: முன்னோக்கி பிளச் வழங்குதல் பின்தளத்தில் பயன்படுத்தும்போது மட்டுமே SDFGI ஆதரிக்கப்படுகிறது, முன்னோக்கி மொபைல் அல்லது பொருந்தக்கூடிய பின்தளத்தில் அல்ல.
