Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_sdfgi.po
Languages: ga, pt_br, ru, ta, uk

source: Signed distance field global illumination (SDFGI)
ga: Soilsiú domhanda réimse achair sínithe (SDFGI)
pt_br: Iluminação global por Campo de Distância com Sinal (SDFGI)
ru: Глобальное освещение на основе полей знаковых расстояний (SDFGI)
ta: கையொப்பமிடப்பட்ட தூர புலம் உலகளாவிய வெளிச்சம் (எச்.டி.எஃப்.சி.ஐ)
uk: Глобальне освітлення поля відстані зі знаком (SDFGI)

source: Signed distance field global illumination (SDFGI) is a novel technique available in Godot 4.0. It provides semi-real-time global illumination that scales to any world size and works with procedurally generated levels.
ga: Teicníc úrnua atá ar fáil in Godot 4.0 is ea soilsiú domhanda an achair sínithe (SDFGI). Soláthraíonn sé soilsiú domhanda leathfhíor-ama a scálaíonn go haon mhéid dhomhanda agus a oibríonn le leibhéil a ghintear de réir nós imeachta.
ru: Signed distance field global illumination (SDFGI) — это новая технология, доступная в Godot 4.0. Она обеспечивает полуреалтаймовое глобальное освещение, которое работает со сценами любого масштаба и поддерживает процедурно генерируемые уровни.
ta: கையொப்பமிடப்பட்ட தூர புலம் உலகளாவிய வெளிச்சம் (எச்.டி.எஃப்.சி.ஐ) என்பது கோடோட் 4.0 இல் கிடைக்கும் ஒரு புதிய நுட்பமாகும். இது எந்தவொரு உலக அளவிற்கும் அளவிடப்படும் மற்றும் நடைமுறை ரீதியாக உருவாக்கப்பட்ட நிலைகளுடன் வேலை செய்யும் அரை-உண்மையான நேர உலகளாவிய வெளிச்சத்தை வழங்குகிறது.
uk: Глобальне освітлення дистанційного поля зі знаком (SDFGI) — це нова техніка, доступна в Godot 4.0. Він забезпечує глобальне освітлення в напівреальному часі, яке масштабується до будь-якого розміру світу та працює з процедурно згенерованими рівнями.

source: SDFGI supports dynamic lights, but *not* dynamic occluders or dynamic emissive surfaces. Therefore, SDFGI provides better real-time ability than :ref:`baked lightmaps <doc_using_lightmap_gi>`, but worse real-time ability than :ref:`VoxelGI <doc_using_voxel_gi>`.
ga: Tacaíonn SDFGI le soilse dinimiciúla, ach * ní * occluders dinimiciúil nó dromchlaí dinimiciúil emissive. Dá bhrí sin, soláthraíonn SDFGI cumas fíor-ama níos fearr ná :ref:`léarscáileanna bácáilte <doc_using_lightmap_gi>`, ach cumas fíor-ama níos measa ná :ref:`VoxelGI <doc_using_voxel_gi>`.
pt_br: O SDFGI oferece suporte a luzes dinâmicas, mas *não* a oclusores dinâmicos nem a superfícies emissivas dinâmicas. Portanto, o SDFGI oferece uma capacidade de tempo real melhor do que os :ref:`lightmaps pré-calculados <doc_using_lightmap_gi>`, mas pior do que o :ref:`VoxelGI <doc_using_voxel_gi>`.
ru: SDFGI поддерживает динамические источники света, но *не* поддерживает динамические окклюдеры или динамические эмиссивные поверхности. Таким образом, SDFGI обеспечивает лучшую производительность в реальном времени по сравнению с :ref:`baked lightmaps <doc_using_lightmap_gi>`, но уступает в этом отношении :ref:`VoxelGI <doc_using_voxel_gi>`.
ta: SDFGI மாறும் விளக்குகளை ஆதரிக்கிறது, ஆனால் * அல்ல * மாறும் ஆக்லூடர்கள் அல்லது மாறும் உமிழ்வு மேற்பரப்புகள். ஆகையால், SDFGI விட சிறந்த நிகழ்நேர திறனை வழங்குகிறது: ref: `வேகவைத்த லைட்மாப்ச் <doc_using_lightmap_gi>`, ஆனால் விட மோசமான நிகழ்நேர திறன்: குறிப்பு: `voxelgi <doc_using_voxel_gi>`.
uk: SDFGI підтримує динамічне світло, але *не* динамічні оклюдери або динамічні емісійні поверхні. Таким чином, SDFGI забезпечує кращу здатність у реальному часі, ніж :ref:`baked lightmaps <doc_using_lightmap_gi>`, але гіршу здатність у реальному часі, ніж :ref:`VoxelGI <doc_using_voxel_gi>`.

source: From a performance standpoint, SDFGI is one of the most demanding global illumination techniques in Godot. Like with VoxelGI, there are still many settings available to tweak its performance requirements at the cost of quality.
ga: Ó thaobh feidhmíochta, tá SDFGI ar cheann de na teicnící soilsithe domhanda is déine i Godot. Cosúil le VoxelGI, tá go leor socruithe ar fáil fós chun a riachtanais feidhmíochta a thaispeáint ar chostas cáilíochta.
pt_br: Do ponto de vista de desempenho, o SDFGI é uma das técnicas de iluminação global mais exigentes do Godot. Assim como no VoxelGI, ainda existem várias configurações disponíveis para ajustar suas exigências de desempenho, ao custo de qualidade.
ru: С точки зрения производительности, SDFGI — одна из самых ресурсоёмких технологий глобального освещения в Godot. Как и в случае с VoxelGI, доступно множество настроек для оптимизации производительности за счёт качества.
ta: செயல்திறன் நிலைப்பாட்டில், கோடோட்டில் மிகவும் தேவைப்படும் உலகளாவிய வெளிச்ச நுட்பங்களில் எச்.டி.எஃப்.சி.ஐ ஒன்றாகும். வோக்சல்கியைப் போலவே, தரத்தின் செலவில் அதன் செயல்திறன் தேவைகளை மாற்றியமைக்க இன்னும் பல அமைப்புகள் உள்ளன.
uk: З точки зору продуктивності, SDFGI є одним із найвимогливіших глобальних методів освітлення в Godot. Як і у випадку з VoxelGI, все ще доступно багато налаштувань, щоб налаштувати вимоги до продуктивності ціною якості.

source: SDFGI is only supported when using the Forward+ renderer, not the Mobile or Compatibility renderers.
ru: SDFGI поддерживается только при использовании рендерера Forward+ и не работает с рендерерами Mobile или Compatibility.
uk: SDFGI підтримується лише під час використання засобу візуалізації Forward+, а не для мобільного чи сумісного рендерера.

source: Not sure if SDFGI is suited to your needs? See :ref:`doc_introduction_to_global_illumination_comparison` for a comparison of GI techniques available in Godot 4.
ga: Níl tú cinnte an bhfuil SDFGI oiriúnach le do riachtanais? Féach:ref: `doc_introduction_to_global_illumination_comparison` le haghaidh comparáid a dhéanamh ar theicnící GI atá ar fáil i Godot 4.
pt_br: Não tem certeza se o SDFGI é adequado às suas necessidades? Consulte :ref:`doc_introduction_to_global_illumination_comparison` para uma comparação das técnicas de GI disponíveis no Godot 4.
ru: Не уверены, подходит ли вам SDFGI? Сравните все технологии глобального освещения Godot 4 в разделе :ref:`doc_introduction_to_global_illumination_comparison`.
ta: SDFGI உங்கள் தேவைகளுக்கு ஏற்றதா என்பது உறுதியாக தெரியவில்லையா? காண்க: குறிப்பு: கோடோட் 4 இல் கிடைக்கும் சி.ஐ நுட்பங்களை ஒப்பிடுவதற்கு `Doc_introduction_to_global_illumination_comparison`.
uk: Не впевнені, чи SDFGI відповідає вашим потребам? Перегляньте :ref:`doc_introduction_to_global_illumination_comparison` для порівняння методів GI, доступних у Godot 4.

source: Visual comparison
ga: Comparáid amhairc
pt_br: Comparação visual
ru: Визуальное сравнение
ta: காட்சி ஒப்பீடு
uk: Візуальне порівняння

source: SDFGI disabled.
ga: SDFGI faoi mhíchumas.
ru: SDFGI отключен.
ta: SDFGI முடக்கப்பட்டது.
uk: SDFGI відключено.

source: SDFGI enabled.
ga: SDFGI cumasaithe.
pt_br: SDFGI ativado.
ru: SDFGI включен.
ta: SDFGI இயக்கப்பட்டது.
uk: SDFGI увімкнено.

source: Setting up SDFGI
ga: SDFGI a bhunú
ru: Настройка SDFGI
ta: SDFGI ஐ அமைத்தல்
uk: Налаштування SDFGI

source: In Godot, SDFGI is the global illumination technique with the fewest required steps to enable:
ga: I Godot, is é SDFGI an teicníc soilsithe domhanda leis an gcéimeanna is lú riachtanacha chun:
pt_br: No Godot, o SDFGI é a técnica de iluminação global com o menor número de etapas necessárias para ser habilitada:
ru: В Godot SDFGI — технология глобального освещения с минимальными шагами для включения:
ta: கோடோட்டில், எச்.டி.எஃப்.சி.ஐ என்பது உலகளாவிய வெளிச்சம் நுட்பமாகும், இது செயல்படுத்த மிகக் குறைவான படிகளைக் கொண்டுள்ளது:
uk: У Godot SDFGI — це техніка глобального освітлення з найменшою кількістю необхідних кроків, щоб увімкнути:

source: Make sure your MeshInstance nodes have their **Global Illumination > Mode** property set to **Static** in the inspector.
ga: Cinntigh go bhfuil an t-airí **Global Illumination> Mode** ar do nóid MeshInstance socraithe go **Statach** sa chigire.
pt_br: Certifique-se de que os nós MeshInstance tenham a propriedade **Global Illumination > Mode** definida como **Static** no inspetor.
ru: Убедитесь, что для узлов MeshInstance в инспекторе **Global Illumination > Mode** установлено в **Static**.
ta: உங்கள் மெசின்ச்டன்ச் முனைகளில் அவற்றின் ** உலகளாவிய வெளிச்சம்> பயன்முறை ** சொத்து ** நிலையான ** என அமைக்கப்பட்டிருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: Переконайтеся, що для ваших вузлів MeshInstance для властивості **Global Illumination > Mode** встановлено значення **Static** в інспекторі.

source: For imported 3D scenes, the bake mode can be configured in the Import dock after selecting the 3D scene file in the FileSystem dock.
ga: Maidir le radhairc 3D allmhairithe, is féidir an modh bácála a chumrú sa duga Iompórtála tar éis an comhad radhairc 3D a roghnú sa duga Comhchórais.
pt_br: Para cenas 3D importadas, o modo de bake pode ser configurado no painel Import após selecionar o arquivo da cena 3D no painel FileSystem.
ru: Для импортированных 3D-сцен режим запекания можно настроить в доке Import после выбора файла сцены в доке FileSystem.
ta: இறக்குமதி செய்யப்பட்ட 3D காட்சிகளுக்கு, கோப்பு முறைமை கப்பல்துறையில் 3D காட்சி கோப்பைத் தேர்ந்தெடுத்த பிறகு இறக்குமதி கப்பல்துறையில் சுட்டுக்கொள்ளும் பயன்முறையை கட்டமைக்க முடியும்.
uk: Для імпортованих 3D-сцен режим запікання можна налаштувати в док-станції «Імпорт» після вибору файлу 3D-сцени в док-станції FileSystem.

source: Add a WorldEnvironment node and create an Environment resource for it.
ga: Cuir nód WorldEnvironment leis agus cruthaigh acmhainn Comhshaoil dó.
pt_br: Adicione um nó WorldEnvironment e crie um recurso Environment para ele.
ru: Добавьте узел WorldEnvironment и создайте для него ресурс Environment.
ta: ஒரு உலக சுற்றுச்சூழல் முனையைச் சேர்த்து, அதற்கான சுற்றுச்சூழல் வளத்தை உருவாக்கவும்.
uk: Додайте вузол WorldEnvironment і створіть для нього ресурс Environment.

source: Edit the Environment resource, scroll down to the **SDFGI** section and unfold it.
ga: Cuir an acmhainn Comhshaoil in eagar, scrollaigh síos go dtí an rannán**SDFGI** agus déan é a oscailt.
pt_br: Edite o recurso Environment, role para baixo até a seção **SDFGI** e desdobre-o.
ru: Отредактируйте ресурс Environment, прокрутите вниз до раздела **SDFGI** и раскройте его.
ta: சுற்றுச்சூழல் வளத்தைத் திருத்தி, ** SDFGI ** பிரிவுக்கு உருட்டி அதை விரிவாக்குங்கள்.
uk: Відредагуйте ресурс середовища, прокрутіть вниз до розділу **SDFGI** і розгорніть його.

source: Enable **SDFGI > Enabled**. SDFGI will automatically follow the camera when it moves, so you do not need to configure extents (unlike VoxelGI).
ga: Cumasaigh **SDFGI > Cumasaithe**. Leanfaidh SDFGI an ceamara go huathoibríoch nuair a ghluaiseann sé, mar sin ní gá duit méideanna a chumrú (murab ionann agus VoxelGI).
pt_br: Habilite **SDFGI > Enabled**. O SDFGI seguirá automaticamente a câmera quando ela se mover, portanto você não precisa configurar as extensões (diferente do VoxelGI).
ru: Активируйте параметр **SDFGI > Enabled**. SDFGI автоматически следует за камерой при её перемещении, поэтому в отличие от VoxelGI не требует настройки границ.
ta: ** SDFGI> இயக்கப்பட்டது ** ஐ இயக்கு. கேமராவை நகர்த்தும்போது SDFGI தானாகவே பின்பற்றும், எனவே நீங்கள் நீட்டிப்புகளை உள்ளமைக்க தேவையில்லை (வோக்சல்கியைப் போலல்லாமல்).
uk: Увімкніть **SDFGI > Увімкнуто**. SDFGI автоматично слідуватиме за камерою, коли вона рухається, тому вам не потрібно налаштовувати екстенти (на відміну від VoxelGI).

source: Environment SDFGI properties
ga: Airíonna SDFGI comhshaoil
ru: Параметры окружения SDFGI
ta: சுற்றுச்சூழல் SDFGI பண்புகள்
uk: Властивості середовища SDFGI

source: In the Environment resource, there are several properties available to adjust SDFGI appearance and quality:
ga: San acmhainn Comhshaoil, tá roinnt airíonna ar fáil chun cuma agus cáilíocht SDFGI a choigeartú:
pt_br: No recurso Environment , há várias propriedades disponíveis para ajustar a aparência e a qualidade do SDFGI:
ru: В ресурсе Environment доступно несколько свойств для настройки внешнего вида и качества SDFGI:
ta: சுற்றுச்சூழல் வளத்தில், SDFGI தோற்றம் மற்றும் தரத்தை சரிசெய்ய பல பண்புகள் உள்ளன:
uk: На ресурсі середовища є кілька властивостей, доступних для налаштування зовнішнього вигляду та якості SDFGI:

source: **Use Occlusion:** If enabled, SDFGI will throw additional rays to find and reduce light leaks. This has a performance cost, so only enable this property if you actually need it.
ga: ** Úsáid Occlusion: ** Má tá sé cumasaithe, caithfidh SDFGI gathanna breise chun sceitheanna solais a aimsiú agus a laghdú. Tá costas feidhmíochta aige seo, mar sin ní chumasaigh an mhaoin seo ach má theastaíonn í uait i ndáiríre.
pt_br: **Use Occlusion:** Se habilitado, o SDFGI lançará raios adicionais para localizar e reduzir vazamentos de luz. Isso tem um custo de desempenho, então habilite essa propriedade apenas se realmente for necessário.
ru: **Use Occlusion (Использовать окклюзию)**: Если включено, SDFGI будет использовать дополнительные лучи для выявления и устранения утечек света. Это снижает производительность, поэтому включайте параметр только при необходимости.
ta: . இது செயல்திறன் செலவைக் கொண்டுள்ளது, எனவே உங்களுக்கு உண்மையில் தேவைப்பட்டால் மட்டுமே இந்த சொத்தை இயக்கவும்.
uk: **Використовувати оклюзію:** якщо ввімкнено, SDFGI викидає додаткові промені, щоб знаходити та зменшувати витоки світла. Це має вартість продуктивності, тому вмикайте цю властивість, лише якщо вона вам дійсно потрібна.

source: **Read Sky Light:** If enabled, the environment lighting is represented in the global illumination. This should be enabled in outdoor scenes and disabled in fully indoor scenes.
ga: **Léigh Sky Light:** Má tá sé cumasaithe, léirítear an soilsiú timpeallachta sa soilsiú domhanda. Ba chóir é seo a chumasú i radhairc lasmuigh agus é a dhíchumasú i radhairc go hiomlán laistigh.
pt_br: **Read Sky Light:** Se habilitado, a iluminação do ambiente será representada na iluminação global. Isso deve ser habilitado em cenas externas e desabilitado em cenas totalmente internas.
ru: **Read Sky Light (Учитывать свет от неба)**: Если включено, освещение окружения учитывается в глобальном освещении. Этот параметр следует включать для открытых сцен и отключать для полностью закрытых помещений.
ta: ** ச்கை லைட்டைப் படியுங்கள்: ** இயக்கப்பட்டிருந்தால், சுற்றுச்சூழல் விளக்குகள் உலகளாவிய வெளிச்சத்தில் குறிப்பிடப்படுகின்றன. இது வெளிப்புற காட்சிகளில் இயக்கப்பட வேண்டும் மற்றும் முழு உட்புற காட்சிகளில் முடக்கப்பட வேண்டும்.
uk: **Read Sky Light:** Якщо ввімкнено, навколишнє освітлення відображається в глобальному освітленні. Це має бути ввімкнено у сценах на відкритому повітрі та вимкнено у сценах, які повністю закриті.

source: **Bounce Feedback:** By default, indirect lighting only bounces once when using SDFGI. Setting this value above ``0.0`` will cause SDFGI to bounce more than once, which provides more realistic indirect lighting at a small performance cost. Sensible values are usually between ``0.3`` and ``1.0`` depending on the scene. Note that in some scenes, values above ``0.5`` can cause infinite feedback loops to happen, causing the scene to become extremely bright in a few seconds' time. If your indirect lighting looks "splotchy", consider increasing this value above ``0.0`` to get more uniform-looking lighting. If your lighting ends up looking too bright as a result, decrease **Energy** to compensate.
ga: **Aiseolas Bounce: ** De réir réamhshocraithe, ní bhreabhann soilsiú indíreach ach uair amháin nuair a úsáidtear SDFGI. Má shocraíonn an luach seo os cionn ``0.0`` beidh SDFGI ag preabháil níos mó ná uair amháin, rud a sholáthraíonn soilsiú indíreach níos réalaíoch ar chostas feidhmíochta beag. De ghnáth bíonn luachanna ciallmhar idir ``0.3`` agus ``1.0`` ag brath ar an radharc. Tabhair faoi deara go bhféadfadh luachanna os cionn ``0.5`` lúb aiseolais gan teorainn tarlú i roinnt radhairc, rud a fhágann go mbeidh an radharc thar a bheith geal i gceann cúpla soicind. Má tá cuma “splotach” ar do soilsiú indíreach, smaoinigh ar an luach seo a mhéadú os cionn ``0.0`` chun soilsiú níos aonfhoirmeach a fháil. Má chríochnaíonn do shoilsiú ró-gheal mar thoradh air sin, laghdaigh **Fuinneim** chun cúiteamh a dhéanamh.
pt_br: **Bounce Feedback:** Por padrão, a iluminação indireta só é refletida uma vez ao usar SDFGI. Definir esse valor acima de ``0.0`` fará com que o SDFGI reflita mais de uma vez, proporcionando uma iluminação indireta mais realista com um pequeno custo de desempenho. Valores sensatos geralmente ficam entre ``0.3`` e ``1.0``, dependendo da cena. Note que, em algumas cenas, valores acima de ``0.5`` podem causar loops de feedback infinitos, fazendo com que a cena fique extremamente brilhante em poucos segundos. Se sua iluminação indireta parecer "manchada", considere aumentar esse valor acima de ``0.0`` para obter uma iluminação mais uniforme. Se a iluminação ficar muito intensa como resultado, diminua **Energy** para compensar.
ru: **Bounce Feedback (Обратная связь отражений)**: По умолчанию непрямое освещение отражается только один раз при использовании SDFGI. Установка значения выше ``0.0`` заставит SDFGI выполнять несколько отражений, что обеспечит более реалистичное непрямое освещение ценой небольшого снижения производительности. Рекомендуемые значения обычно находятся между ``0.3`` и ``1.0`` в зависимости от сцены. Обратите внимание, что в некоторых сценах значения выше ``0.5`` могут вызывать бесконечные циклы обратной связи, приводящие к чрезмерному яркому освещению за несколько секунд. Если непрямое освещение выглядит "пятнистым", попробуйте увеличить это значение выше ``0.0`` для более равномерного освещения. Если освещение становится слишком ярким, уменьшите **Energy** для компенсации.
ta: ** பவுன்ச் பின்னூட்டம்: ** இயல்புநிலையாக, SDFGI ஐப் பயன்படுத்தும் போது மறைமுக விளக்குகள் ஒரு முறை மட்டுமே துள்ளுகின்றன. இந்த மதிப்பை `` 0.0`` க்கு மேலே அமைப்பது எச்.டி.எஃப்.சி.ஐ ஒன்றுக்கு மேற்பட்ட முறை துள்ளிக் கொள்ளும், இது ஒரு சிறிய செயல்திறன் செலவில் மிகவும் யதார்த்தமான மறைமுக விளக்குகளை வழங்குகிறது. விவேகமான மதிப்புகள் பொதுவாக காட்சியைப் பொறுத்து `` 0.3`` மற்றும் `` 1.0` க்கு இடையில் இருக்கும். சில காட்சிகளில், `` 0.5`` க்கு மேலே உள்ள மதிப்புகள் எல்லையற்ற பின்னூட்ட சுழல்கள் நடக்கக்கூடும், இதனால் சில நொடிகளில் காட்சி மிகவும் பிரகாசமாகிறது. உங்கள் மறைமுக விளக்குகள் "ச்ப்ளோச்சி" என்று தோன்றினால், இந்த மதிப்பை `` 0.0`` க்கு மேலே அதிகரிப்பதைக் கவனியுங்கள். இதன் விளைவாக உங்கள் விளக்குகள் மிகவும் பிரகாசமாகத் தெரிந்தால், ஈடுசெய்ய ** ஆற்றல் ** ஐக் குறைக்கவும்.
uk: **Зворотній зв’язок:** За замовчуванням непряме освітлення відбивається лише один раз під час використання SDFGI. Якщо встановити це значення вище ``0.0``, SDFGI буде відбиватися більше одного разу, що забезпечує більш реалістичне непряме освітлення за невеликих витрат на продуктивність. Розумні значення зазвичай знаходяться між ``0,3`` і ``1,0`` залежно від сцени. Зауважте, що в деяких сценах значення вище ``0,5`` можуть спричинити нескінченні цикли зворотного зв’язку, через що сцена стане надзвичайно яскравою за кілька секунд. Якщо ваше непряме освітлення виглядає "з плямами", спробуйте збільшити це значення вище ``0.0``, щоб отримати більш рівномірне освітлення. Якщо в результаті ваше освітлення виглядає занадто яскравим, зменшіть **Енергію**, щоб компенсувати це.

source: **Cascades:** Higher values result in more detailed GI information (and/or greater maximum distance), but are significantly more expensive on the CPU and GPU. The performance cost of having more cascades especially increases when the camera moves fast, so consider decreasing this to ``4`` or lower if your camera moves fast.
ga: **Cascades: ** Mar thoradh ar luachanna níos airde bíonn faisnéis GI níos mionsonraithe (agus/nó an t-achar uasta níos mó), ach tá siad i bhfad níos costasaí ar an LAP agus ar an GPU. Méadaíonn costas feidhmíochta níos mó cascades a bheith agat go háirithe nuair a ghluaiseann an ceamara go tapa, mar sin smaoinigh ar é seo a laghdú go ``4`` nó níos ísle má ghluaiseann do cheamara go tapa.
pt_br: **Cascades:** Valores mais altos resultam em informações de GI mais detalhadas (e/ou maior distância máxima), mas são significativamente mais exigentes para a CPU e a GPU. O custo de desempenho de ter mais cascatas aumenta especialmente quando a câmera se move rapidamente, portanto, considere reduzir este valor para ``4`` ou menos se sua câmera se mover em alta velocidade.
ru: **Cascades (Каскады)**: Более высокие значения увеличивают детализацию глобального освещения (и/или максимальную дистанцию), но значительно нагружают CPU и GPU. Затраты производительности особенно возрастают при быстром движении камеры, поэтому для динамичных камер рекомендуется уменьшить значение до ``4`` или ниже.
ta: ** அடுக்கை: ** அதிக மதிப்புகள் மிகவும் விரிவான சி.ஐ தகவல்களை (மற்றும்/அல்லது அதிக அதிகபட்ச தூரம்) விளைவிக்கின்றன, ஆனால் சிபியு மற்றும் GPU இல் கணிசமாக அதிக விலை கொண்டவை. கேமரா வேகமாக நகரும் போது அதிக அடுக்குகளைக் கொண்டிருப்பதற்கான செயல்திறன் செலவு அதிகரிக்கிறது, எனவே உங்கள் கேமரா வேகமாக நகர்ந்தால் இதை `` 4`` ஆகக் குறைப்பதைக் கவனியுங்கள்.
uk: **Каскади:** вищі значення отримують детальнішу інформацію про ГІ (та/або більшу максимальну відстань), але значно дорожчі для ЦП і ГП. Вартість продуктивності більшої кількості каскадів особливо зростає, коли камера рухається швидко, тому подумайте про зменшення цього значення до ``4`` або менше, якщо ваша камера рухається швидко.

source: **Min Cell Size:** The minimum SDFGI cell size to use for the nearest, most detailed cascade. Lower values result in more accurate indirect lighting and reflection at the cost of lower performance. Adjusting this setting also affects **Cascade 0 Distance** and **Max Distance** automatically.
ga: ** Íosta Méid na gcille: ** An méid cille SDFGI íosta le húsáid don cascadh is gaire, is mionsonraithe. Mar thoradh ar luachanna níos ísle bíonn soilsiú indíreach agus machnamh níos cruinne ar chostas feidhmíochta níos ísle. Bíonn tionchar ag an socrú seo a choigeartú freisin ar ** Fad Cascade 0** agus **Fad Uas** go huathoibríoch.
pt_br: **Min Cell Size:** O tamanho mínimo de célula do SDFGI a ser usado para a cascata mais próxima e detalhada. Valores mais baixos resultam em iluminação indireta e reflexos mais precisos, ao custo de menor desempenho. Ajustar essa configuração também afeta automaticamente **Cascade 0 Distance** e **Max Distance**.
ru: **Min Cell Size (Минимальный размер ячейки)**: Определяет размер ячейки SDFGI для ближайшего (наиболее детального) каскада. Меньшие значения повышают точность непрямого освещения и отражений ценой снижения производительности. Изменение этого параметра автоматически влияет на **Cascade 0 Distance** и **Max Distance**.
ta: ** மணித்துளி செல் அளவு: ** அருகிலுள்ள, மிக விரிவான அடுக்குக்கு பயன்படுத்த குறைந்தபட்ச SDFGI செல் அளவு. குறைந்த மதிப்புகள் குறைந்த செயல்திறன் செலவில் மிகவும் துல்லியமான மறைமுக விளக்குகள் மற்றும் பிரதிபலிப்பை விளைவிக்கின்றன. இந்த அமைப்பை சரிசெய்வது ** அடுக்கை 0 தூரம் ** மற்றும் ** அதிகபட்ச தூரம் ** தானாகவே பாதிக்கிறது.
uk: **Мінальний розмір комірки:** мінімальний розмір комірки SDFGI для найближчого, найдетальнішого каскаду. Менші значення призводять до більш точного непрямого освітлення та відбиття ціною нижчої продуктивності. Налаштування цього параметра також автоматично впливає на **Cascade 0 Distance** і **Max Distance**.
