Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_sdfgi.po
Languages: ga, pt_br, ru, ta, uk

source: **Cascade 0 Distance:** The distance at which the nearest, most detailed cascade ends. Greater values make the nearest cascade transition less noticeable, at the cost of reducing the level of detail in the nearest cascade. Adjusting this setting also affects **Min Cell Size** and **Max Distance** automatically.
ga: **Cascade 0 Fad: ** An fad ag a gcríochnaíonn an cascadh is gaire, is mionsonraithe. Fágann luachanna níos mó an t-aistriú cascadh is gaire nach bhfuil chomh suntasach, ar an gcostas a bhaineann le leibhéal na sonraí sa choscaire is gaire a laghdú Bíonn tionchar ag an socrú seo a choigeartú ar ** Méid Cill Mion** agus **Fad Uas** go huathoibríoch.
pt_br: **Cascade 0 Distance:** A distância na qual a cascata mais próxima e detalhada termina. Valores maiores tornam a transição da cascata mais próxima menos perceptível, ao custo de reduzir o nível de detalhe dessa cascata. Ajustar essa configuração também afeta automaticamente **Min Cell Size** e **Max Distance**.
ru: **Cascade 0 Distance (Дистанция каскада 0)**: Определяет расстояние, на котором заканчивается ближайший (наиболее детализированный) каскад. Бóльшие значения делают переход ближайшего каскада менее заметным, но снижают детализацию в ближней зоне. Изменение этого параметра автоматически влияет на **Min Cell Size** и **Max Distance**.
ta: ** அடுக்கை 0 தூரம்: ** அருகிலுள்ள, மிக விரிவான அடுக்கை முடிவடையும் தூரம். அருகிலுள்ள அடுக்கில் விவரங்களின் அளவைக் குறைக்கும் செலவில், அதிக மதிப்புகள் அருகிலுள்ள அடுக்கை மாற்றத்தை குறைவாகக் கவனிக்கின்றன. இந்த அமைப்பை சரிசெய்வது ** மணித்துளி செல் அளவு ** மற்றும் ** அதிகபட்ச தூரம் ** தானாகவே பாதிக்கிறது.
uk: **Відстань каскаду 0:** відстань, на якій закінчується найближчий, найбільш детальний каскад. Більші значення роблять найближчий каскадний перехід менш помітним за рахунок зниження рівня деталізації в найближчому каскаді. Налаштування цього параметра також автоматично впливає на **Мін. розмір комірки** та **Макс. відстань**.

source: **Max Distance:** Controls how far away the signed distance field will be computed (for the least detailed cascade). SDFGI will not have any effect past this distance. This value should always be set below the Camera's Far value, as there is no benefit in computing SDFGI past the viewing distance. Adjusting this setting also affects **Min Cell Size** and **Cascade 0 Distance** automatically.
ga: **Fad Uasta: ** Rialaíonn sé cé chomh fada agus ar shiúl a ríomhfar an réimse achair shínithe (don cascadh is lú mionsonraithe). Ní bheidh aon éifeacht ag SDFGI thar an achar seo. Ba chóir an luach seo a shocrú i gcónaí faoi bhun luach Far an Cheamara, mar níl aon tairbhe ann SDFGI a ríomh thar an achar féachana. Bíonn tionchar ag an socrú seo a choigeartú ar **Méid Cill Mion** agus **Fad Cascade 0** go huathoibríoch.
pt_br: **Max Distance:** Controla até que distância o campo de distância com sinal será calculado (para a cascata menos detalhada). O SDFGI não terá efeito além dessa distância. Esse valor deve sempre ser definido abaixo do valor Far da câmera, pois não há benefício em calcular o SDFGI além da distância de visualização. Ajustar essa configuração também afeta automaticamente **Min Cell Size** e **Cascade 0 Distance**.
ru: **Max Distance (Максимальная дистанция)**: Определяет дистанцию, на которой вычисляется поле знаковых расстояний (для наименее детального каскада). SDFGI не действует за пределами этого расстояния. Значение всегда должно быть ниже параметра Far камеры, так как расчёт SDFGI за пределами видимости не имеет смысла. Изменение этого параметра автоматически влияет на **Min Cell Size** и **Cascade 0 Distance**.
ta: ** அதிகபட்ச தூரம்: ** கையொப்பமிடப்பட்ட தூர புலம் எவ்வளவு தொலைவில் கணக்கிடப்படும் என்பதைக் கட்டுப்படுத்துகிறது (குறைந்த விரிவான அடுக்குக்கு). SDFGI இந்த தூரத்தை கடந்த எந்த விளைவையும் ஏற்படுத்தாது. இந்த மதிப்பு எப்போதும் கேமராவின் தொலைதூர மதிப்புக்கு கீழே அமைக்கப்பட வேண்டும், ஏனெனில் SDFGI ஐக் கணக்கிடுவதில் எந்த நன்மையும் இல்லை. இந்த அமைப்பை சரிசெய்வது ** மணித்துளி செல் அளவு ** மற்றும் ** அடுக்கை 0 தூரம் ** தானாகவே பாதிக்கிறது.
uk: **Максимальна відстань:** контролює, наскільки далеко буде обчислюватися поле відстані зі знаком (для найменш детального каскаду). SDFGI не матиме жодного ефекту на цій відстані. Це значення завжди має бути нижчим від значення Camera's Far, оскільки обчислення SDFGI поза дистанцією перегляду не приносить користі. Налаштування цього параметра також автоматично впливає на **Мінімальний розмір комірки** та **Каскадна відстань 0**.

source: **Y Scale:** Controls how far apart SDFGI probes are spread *vertically*. By default, vertical spread is the same as horizontal. However, since most game scenes aren't highly vertical, setting the Y Scale to ``75%`` or even ``50%`` can provide better quality and reduce light leaks without impacting performance.
ga: **Scála Y: ** Rialaíonn sé cé chomh fada agus a scaiptear tábhairí SDFGI* go ingearach*. De réir réamhshocraithe, tá leathadh ingearach mar an gcéanna le cothrománach Mar sin féin, ós rud é nach bhfuil an chuid is mó de radhairc cluiche an-ingearach, is féidir an Scála Y a shocrú go ``75%`` nó fiú ``50%`` caighdeán níos fearr a sholáthar agus sceitheanna solais a laghdú gan tionchar a imirt ar fheidhmíocht.
pt_br: **Y Scale:** Controla o quão espaçadas as sondas do SDFGI são distribuídas *verticalmente*. Por padrão, a distribuição vertical é igual à horizontal. No entanto, como a maioria das cenas de jogos não possui grande verticalidade, definir o Y Scale para ``75%`` ou até ``50%`` pode proporcionar melhor qualidade e reduzir vazamentos de luz sem impactar o desempenho.
ru: **Y Scale (Масштаб по Y)**: Управляет вертикальным расстоянием между пробами SDFGI. По умолчанию вертикальное расстояние равно горизонтальному. Однако, поскольку большинство игровых сцен не имеют высокой вертикальной протяжённости, установка значения ``75%`` или даже ``50%`` может улучшить качество и уменьшить утечки света без потери производительности.
ta: ** ஒய் அளவுகோல்: ** SDFGI ஆய்வுகள் எவ்வளவு தொலைவில் உள்ளன என்பதை கட்டுப்படுத்துகிறது*செங்குத்தாக*. இயல்பாக, செங்குத்து பரவல் கிடைமட்டத்திற்கு சமம். இருப்பினும், பெரும்பாலான விளையாட்டு காட்சிகள் மிகவும் செங்குத்தாக இல்லாததால், ஒய் அளவை `` 75%`` அல்லது `` 50%`` கூட அமைப்பது சிறந்த தரத்தை வழங்கும் மற்றும் செயல்திறனை பாதிக்காமல் ஒளி கசிவைக் குறைக்கும்.
uk: **Шкала Y:** контролює, наскільки *вертикально* розташовані зонди SDFGI один від одного. За замовчуванням вертикальне розповсюдження таке ж, як і горизонтальне. Однак, оскільки більшість ігрових сцен не дуже вертикальні, встановлення масштабу Y на ``75%`` або навіть ``50%`` може забезпечити кращу якість і зменшити витоки світла без впливу на продуктивність.

source: **Energy:** The brightness multiplier for SDFGI's indirect lighting.
ga: **Fuinneamh: ** An iolraitheoir gile do soilsiú indíreach SDFGI.
pt_br: **Energy:** O multiplicador de brilho para iluminação indireta do SDFGI.
ru: **Energy (Энергия)**: Множитель яркости для непрямого освещения SDFGI.
ta: ** ஆற்றல்: ** SDFGI இன் மறைமுக விளக்குகளுக்கான ஒளி பெருக்கி.
uk: **Енергія:** Коефіцієнт яскравості для непрямого освітлення SDFGI.

source: **Normal Bias:** The normal bias to use for SDFGI's probe ray bounces. Unlike **Probe Bias**, this only increases the value in relation to the mesh's normals. This makes the bias adjustment more nuanced and avoids increasing the bias too much for no reason. Increase this value if you notice striping artifacts in indirect lighting or reflections.
ga: ** Gnáthchlaontacht: ** An gnáthchlaonadh atá le húsáid le haghaidh preabhálacha gatha taiscéalaí SDFGI. Murab ionann agus **Probe Bath**, ní mhéadaíonn sé seo ach an luach i ndáil le gnáthmhála na mogalra. Déanann sé seo an coigeartú claonta níos nuasaí agus seachnaíonn sé an claontacht a mhéadú an iomarca gan chúis ar bith. Méadaigh an luach seo má thugann tú faoi deara déantáin striping i soilsiú indíreach nó machnaimh.
pt_br: **Normal Bias:** O viés normal a ser usado para os raios refletidos das sondas do SDFGI. Diferente de **Probe Bias**, esse valor é aumentado apenas em relação às normais da malha. Isso torna o ajuste do viés mais sutil e evita aumentá-lo demais sem necessidade. Aumente esse valor se você notar artefatos em faixas na iluminação indireta ou nos reflexos.
ru: **Normal Bias (Смещение по нормали)**: Определяет смещение для отражений лучей проб SDFGI. В отличие от **Probe Bias**, это значение увеличивается только относительно нормалей меша. Это обеспечивает более тонкую настройку смещения и предотвращает его беспричинное увеличение. Повышайте значение при появлении полосатых артефактов (striping) в непрямом освещении или отражениях.
ta: ** சாதாரண சார்பு: ** SDFGI இன் ஆய்வுக்கு பயன்படுத்த வேண்டிய சாதாரண சார்பு ரே பவுன்ச். ** ஆய்வு சார்பு ** போலல்லாமல், இது மெசின் இயல்பு தொடர்பான மதிப்பை மட்டுமே அதிகரிக்கிறது. இது சார்பு சரிசெய்தலை மிகவும் நுணுக்கமாக ஆக்குகிறது மற்றும் எந்த காரணமும் இல்லாமல் சார்புகளை அதிகமாக அதிகரிப்பதைத் தவிர்க்கிறது. மறைமுக விளக்குகள் அல்லது பிரதிபலிப்புகளில் ச்ட்ரைப்பிங் கலைப்பொருட்களை நீங்கள் கவனித்தால் இந்த மதிப்பை அதிகரிக்கவும்.
uk: **Нормальне зміщення:** Нормальне зміщення, яке використовується для відскоку пробного променя SDFGI. На відміну від **Probe Bias**, це лише збільшує значення по відношенню до нормалей сітки. Це робить коригування зміщення більш тонким і дозволяє уникнути надмірного збільшення зміщення без причини. Збільште це значення, якщо ви помітили артефакти в непрямому освітленні або відблисках.

source: **Probe Bias:** The bias to use for SDFGI's probe ray bounces. Increase this value if you notice striping artifacts in indirect lighting or reflections.
ga: **Claonadh Tróibhéil: ** An claonadh atá le húsáid le haghaidh preabhálacha gatha tóibre SDFGI. Méadaigh an luach seo má thugann tú faoi deara déantáin striping i soilsiú indíreach nó machnaimh.
pt_br: **Probe Bias:** O viés a ser usado para os reflexos de raios de sondagem do SDFGI. Aumente este valor se notar artefatos de listras em iluminação indireta ou reflexos.
ru: **Probe Bias (Смещение проб)**: Смещение, применяемое при отражениях лучей проб SDFGI. Увеличивайте это значение при появлении полосатых артефактов (striping) в непрямом освещении или отражениях.
ta: ** ஆய்வு சார்பு: ** SDFGI இன் ஆய்வுக்கு பயன்படுத்த வேண்டிய சார்பு ரே பவுன்ச். மறைமுக விளக்குகள் அல்லது பிரதிபலிப்புகளில் ச்ட்ரைப்பிங் கலைப்பொருட்களை நீங்கள் கவனித்தால் இந்த மதிப்பை அதிகரிக்கவும்.
uk: **Зміщення зонда:** Зміщення, яке використовується для відскоку пробного променя SDFGI. Збільште це значення, якщо ви помітили артефакти в непрямому освітленні або відблисках.

source: SDFGI interaction with lights and objects
ga: Idirghníomhaíocht SDFGI le soilse agus rudaí
ru: Взаимодействие SDFGI со светом и объектами
ta: விளக்குகள் மற்றும் பொருள்களுடன் SDFGI தொடர்பு
uk: Взаємодія SDFGI зі світлом і об'єктами

source: The amount of indirect energy emitted by a light is governed by its color, energy *and* indirect energy properties. To make a specific light emit more or less indirect energy without affecting the amount of direct light emitted by the light, adjust the **Indirect Energy** property in the Light3D inspector.
ga: Rialaítear an méid fuinnimh indíreach a astaíonn solas ag a dhath, a fhuinnim* agus* airíonna fuinnimh indíreacha. Chun solas ar leith fuinneamh indíreach níos mó nó níos lú a scaoileadh gan dul i bhfeidhm ar an méid solais dhíreach a astaíonn an solas, coigeartaigh an maoin **Fuinneamh Indíreach sa chigire Light3D.
pt_br: A quantidade de energia indireta emitida por uma luz é determinada por suas propriedades de cor, energia *e* energia indireta. Para fazer com que uma luz específica emita mais ou menos energia indireta sem afetar a quantidade de luz direta emitida, ajuste a propriedade **Indirect Energy** no inspetor do Light3D.
ru: Интенсивность непрямого света от источника света управляется его цветом, энергией *и* параметром Indirect Energy. Чтобы изменить только непрямое освещение (не влияя на прямой свет), отрегулируйте свойство **Indirect Energy** в инспекторе Light3D.
ta: ஒரு ஒளியால் வெளிப்படும் மறைமுக ஆற்றலின் அளவு அதன் நிறம், ஆற்றல் * மற்றும் * மறைமுக ஆற்றல் பண்புகளால் நிர்வகிக்கப்படுகிறது. ஒரு குறிப்பிட்ட ஒளியை ஒளியால் வெளிப்படும் நேரடி ஒளியின் அளவைப் பாதிக்காமல் அதிகமாகவோ அல்லது குறைவாகவோ மறைமுக ஆற்றலை வெளியிடுவதற்கு, லைட் 3 டி இன்ச்பெக்டரில் உள்ள ** மறைமுக ஆற்றல் ** சொத்தை சரிசெய்யவும்.
uk: Кількість непрямої енергії, випромінюваної світлом, залежить від його кольору, енергії *і* властивостей непрямої енергії. Щоб певне джерело світла випромінювало більше або менше непрямої енергії, не впливаючи на кількість прямого світла, випромінюваного світлом, налаштуйте властивість **Indirect Energy** в інспекторі Light3D.

source: To ensure correct visuals when using SDFGI, you must configure your meshes and lights' global illumination properties according to their *purpose* in the scene (static or dynamic).
ga: Chun íomhánna cearta a chinntiú agus SDFGI á úsáid agat, ní mór duit airíonna soilsithe domhanda do mhogalra agus do shoilse a chumrú de réir a g*cuspóir* sa radharc (statach nó dinimiciúil).
pt_br: Para garantir visuais corretos ao usar SDFGI, você deve configurar as propriedades de iluminação global de suas malhas e luzes de acordo com sua *finalidade* na cena (estática ou dinâmica).
ru: Для корректного отображения SDFGI настройте свойства глобального освещения (Global Illumination) мешей и источников света в соответствии с их *назначением* в сцене (статическим или динамическим).
ta: SDFGI ஐப் பயன்படுத்தும் போது சரியான காட்சிகளை உறுதிப்படுத்த, உங்கள் மெச்கள் மற்றும் விளக்குகளின் உலகளாவிய வெளிச்ச பண்புகளை அவற்றின் * நோக்கத்திற்கு ஏற்ப * காட்சியில் (நிலையான அல்லது மாறும்) கட்டமைக்க வேண்டும்.
uk: Щоб забезпечити правильні візуальні ефекти під час використання SDFGI, ви повинні налаштувати властивості глобального освітлення своїх сіток і джерел світла відповідно до їхнього *призначення* в сцені (статичного чи динамічного).

source: There are 3 global illumination modes available for meshes:
ga: Tá 3 mhodh soilsithe domhanda ar fáil le haghaidh mogalra:
ru: В Godot Engine доступны три режима глобального освещения для мешей:
ta: மெச்களுக்கு 3 உலகளாவிய வெளிச்ச முறைகள் உள்ளன:
uk: Для сіток доступні 3 режими глобального освітлення:

source: **Disabled:** The mesh won't be taken into account in SDFGI generation. The mesh will receive indirect lighting from the scene, but it will not contribute indirect lighting to the scene.
ga: ** Míchumas: ** Ní chuirfear an mogalra san áireamh i nginiúint SDFGI. Gheobhaidh an mogalra soilsiú indíreach ón radharc, ach ní chuirfidh sé soilsiú indíreach leis an radharc.
pt_br: **Desativado:** A malha não será considerada na geração do SDFGI. A malha receberá iluminação indireta da cena, mas não contribuirá com iluminação indireta para a cena.
ru: **Disabled (Отключено)**: Меш не учитывается при генерации SDFGI. Он будет получать непрямое освещение от сцены, но не будет влиять на непрямое освещение сцены.
ta: ** முடக்கப்பட்டது: ** SDFGI தலைமுறையில் கண்ணி கணக்கில் எடுத்துக்கொள்ளப்படாது. கண்ணி காட்சியில் இருந்து மறைமுக விளக்குகளைப் பெறும், ஆனால் அது காட்சிக்கு மறைமுக விளக்குகளை பங்களிக்காது.
uk: **Вимкнено:** Сітка не враховуватиметься під час генерації SDFGI. Сітка буде отримувати непряме освітлення зі сцени, але не сприятиме непрямому освітленню сцени.

source: **Static (default):** The mesh will be taken into account in SDFGI generation. The mesh will both receive *and* contribute indirect lighting to the scene. If the mesh is changed in any way after SDFGI is generated, the camera must move away from the object then move back close to it for SDFGI to regenerate. Alternatively, SDFGI can be toggled off and back on. If neither is done, indirect lighting will look incorrect.
ga: ** Statach (réamhshocraithe) :** Cuirfear an mogalra san áireamh i nginiúint SDFGI. Gheobhaidh an mogalra* agus* soilsiú indíreach leis an radharc. Má athraítear an mogalra ar bhealach ar bith tar éis SDFGI a ghiniúint, caithfidh an ceamara bogadh ar shiúl ón réad ansin bogadh ar ais gar dó chun SDFGI athghiniúint. De rogha air sin, is féidir SDFGI a chasadh amach agus ar ais. Mura ndéantar ceachtar acu, beidh cuma mícheart ag soilsiú indíreach.
pt_br: **Static (padrão):** A malha será considerada na geração do SDFGI. Ela receberá *e também* contribuirá com iluminação indireta para a cena. Se a malha for alterada de qualquer forma após a geração do SDFGI, a câmera deve se afastar do objeto e depois se aproximar novamente para que o SDFGI seja regenerado. Alternativamente, o SDFGI pode ser desativado e reativado. Se nenhuma dessas ações for feita, a iluminação indireta ficará incorreta.
ru: **Static (Статический, по умолчанию)**: Меш учитывается при генерации SDFGI. Он *и получает* непрямое освещение от сцены, *и влияет* на него. Если меш изменяется после генерации SDFGI, камера должна отдалиться от объекта, а затем снова приблизиться к нему, чтобы SDFGI пересгенерировался. Альтернативно, SDFGI можно выключить и снова включить. Если ни одно из этих действий не выполнено, непрямое освещение будет отображаться некорректно.
ta: ** நிலையான (இயல்புநிலை): ** SDFGI தலைமுறையில் கண்ணி கணக்கில் எடுத்துக்கொள்ளப்படும். கண்ணி இரண்டும் * பெறும் மற்றும் * காட்சிக்கு மறைமுக விளக்குகளை வழங்கும். எச்.டி.எஃப்.சி.ஐ உருவாக்கப்பட்ட பிறகு எந்த வகையிலும் கண்ணி மாற்றப்பட்டால், கேமரா பொருளிலிருந்து விலகி, எச்.டி.எஃப்.சி.ஐ மீளுருவாக்கம் செய்ய அதற்கு அருகில் செல்ல வேண்டும். மாற்றாக, SDFGI ஐ மாற்றி மீண்டும் இயக்கலாம். எதுவும் செய்யப்படாவிட்டால், மறைமுக விளக்குகள் தவறாக இருக்கும்.
uk: **Статичний (за замовчуванням):** Сітка буде врахована під час генерації SDFGI. Сітка отримуватиме *і* сприятиме непрямому освітленню сцени. Якщо після створення SDFGI сітка будь-яким чином змінюється, камера має відійти від об’єкта, а потім повернутися до нього, щоб SDFGI відновився. Крім того, SDFGI можна вимкнути та знову ввімкнути. Якщо нічого не зробити, непряме освітлення виглядатиме неправильно.

source: **Dynamic (not supported with SDFGI):** The mesh won't be taken into account in SDFGI generation. The mesh will receive indirect lighting from the scene, but it will not contribute indirect lighting to the scene. *This acts identical to the **Disabled** bake mode when using SDFGI.*
ga: ** Dinimiciúil (nach dtacaítear le SDFGI) :** Ní chuirfear an mogalra san áireamh i nginiúint SDFGI. Gheobhaidh an mogalra soilsiú indíreach ón radharc, ach ní chuirfidh sé soilsiú indíreach leis an radharc. * Feidhmíonn sé seo comhionann leis an modh bácáilte **Díchumasa** agus SDFGI á úsáid agat. *
pt_br: **Dynamic (não suportado com SDFGI):** A malha não será considerada na geração do SDFGI. Ela receberá iluminação indireta da cena, mas não contribuirá com iluminação indireta para a cena. *Isso funciona de forma idêntica ao modo de bake **Disabled** ao usar SDFGI.*
ru: **Dynamic (не поддерживается в SDFGI):** Меш не учитывается при генерации SDFGI. Он будет получать непрямое освещение от сцены, но не будет влиять на непрямое освещение сцены. *При использовании SDFGI этот режим работает идентично режиму **Disabled**.*
ta: ** மாறும் (SDFGI உடன் ஆதரிக்கப்படவில்லை): ** SDFGI தலைமுறையில் கண்ணி கணக்கில் எடுத்துக்கொள்ளப்படாது. கண்ணி காட்சியில் இருந்து மறைமுக விளக்குகளைப் பெறும், ஆனால் அது காட்சிக்கு மறைமுக விளக்குகளை பங்களிக்காது. *இது SDFGI ஐப் பயன்படுத்தும் போது ** முடக்கப்பட்ட ** பேக் பயன்முறைக்கு ஒத்ததாக செயல்படுகிறது.*
uk: **Динамічний (не підтримується SDFGI):** Сітка не враховуватиметься під час створення SDFGI. Сітка буде отримувати непряме освітлення зі сцени, але не сприятиме непрямому освітленню сцени. *Це діє ідентично **Вимкненому** режиму запікання під час використання SDFGI.*

source: Additionally, there are 3 bake modes available for lights (DirectionalLight3D, OmniLight3D and SpotLight3D):
ga: Ina theannta sin, tá 3 mhodh bácála ar fáil le haghaidh soilse (DirectionalLight3D, OmniLight3D agus Spotlight3D):
pt_br: Além disso, existem 3 modos de bake disponíveis para luzes (DirectionalLight3D, OmniLight3D e SpotLight3D):
ru: Для источников света (DirectionalLight3D, OmniLight3D и SpotLight3D) доступны три режима запекания:
ta: கூடுதலாக, விளக்குகளுக்கு 3 சுட்டுக்கொள்ள முறைகள் உள்ளன (திசைதிருப்பல் 3 டி, ஓம்னிலைட் 3 டி மற்றும் ச்பாட்லைட் 3 டி):
uk: Крім того, для світильників доступні 3 режими запікання (DirectionalLight3D, OmniLight3D і SpotLight3D):

source: **Disabled:** The light won't be taken into account for SDFGI baking. The light won't contribute indirect lighting to the scene.
ga: **Míchumas: ** Ní chuirfear an solas san áireamh le haghaidh bácáil SDFGI. Ní chuirfidh an solas soilsiú indíreach leis an radharc.
pt_br: **Disabled:** A luz não será considerada no bake do SDFGI. Ela não contribuirá com iluminação indireta para a cena.
ru: **Disabled (Отключено):** Источник света не учитывается при генерации SDFGI и не влияет на непрямое освещение сцены.
ta: ** முடக்கப்பட்டது: ** SDFGI பேக்கிங்கிற்கு ஒளி கணக்கில் எடுத்துக்கொள்ளப்படாது. ஒளி காட்சிக்கு மறைமுக விளக்குகளை பங்களிக்காது.
uk: **Вимкнено:** світло не враховуватиметься для випічки SDFGI. Світло не буде сприяти непрямому освітленню сцени.

source: **Static:** The light will be taken into account for SDFGI baking. The light will contribute indirect lighting to the scene. If the light is changed in any way after baking, indirect lighting will look incorrect until the camera moves away from the light and back (which causes SDFGI to be baked again). will look incorrect. If in doubt, use this mode for level lighting.
ga: **Statach: ** Cuirfear an solas san áireamh le haghaidh bácáil SDFGI. Cuirfidh an solas soilsiú indíreach leis an radharc. Má athraítear an solas ar bhealach ar bith tar éis bácáil, beidh cuma mícheart ar an soilsiú indíreach go dtí go mbogann an ceamara ar shiúl ón solas agus ar ais (rud a fhágann go ndéanfar SDFGI a bácáil arís). beidh cuma mícheart. Má tá amhras ort, bain úsáid as an modh seo le haghaidh soilsiú leibhéil.
pt_br: **Static:** A luz será considerada para o baking do SDFGI. A luz contribuirá com iluminação indireta para a cena. Se a luz for alterada de alguma forma após o baking, a iluminação indireta parecerá incorreta até que a câmera se afaste da luz e volte (o que faz com que o SDFGI seja novamente submetido ao baking). Se estiver em dúvida, use este modo para iluminação de nível.
ru: **Static (Статический):** Источник света учитывается при генерации SDFGI и влияет на непрямое освещение сцены. Если параметры света изменяются после генерации, непрямое освещение будет отображаться некорректно, пока камера не отдалится от источника и не вернётся обратно (что вызывает повторную генерацию SDFGI). Если сомневаетесь, используйте *этот* режим для основного освещения уровня.
ta: ** நிலையானது: ** SDFGI பேக்கிங்கிற்கு ஒளி கணக்கில் எடுத்துக்கொள்ளப்படும். ஒளி காட்சிக்கு மறைமுக விளக்குகளை பங்களிக்கும். பேக்கிங்கிற்குப் பிறகு எந்த வகையிலும் ஒளி மாற்றப்பட்டால், கேமரா ஒளியிலிருந்தும் பின்புறத்திலும் இருந்து விலகிச் செல்லும் வரை மறைமுக விளக்குகள் தவறாக இருக்கும் (இது SDFGI ஐ மீண்டும் சுட காரணமாகிறது). தவறாக இருக்கும். ஐயம் இருந்தால், நிலை விளக்குகளுக்கு இந்த பயன்முறையைப் பயன்படுத்தவும்.
uk: **Статичний:** Світло буде враховано для випічки SDFGI. Світло сприятиме непрямому освітленню сцени. Якщо після випікання будь-яким чином змінити освітлення, непряме освітлення виглядатиме неправильно, доки камера не відійде від світла та назад (що спричиняє повторне випікання SDFGI). буде виглядати неправильно. Якщо сумніваєтеся, використовуйте цей режим для рівного освітлення.
