Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/global_illumination/using_sdfgi.po
Languages: ga, pt_br, ru, ta, uk

source: **Dynamic (default):** The light won't be taken into account for SDFGI baking, but it will still contribute indirect lighting to the scene in real-time. This option is slower compared to **Static**. Only use the **Dynamic** global illumination mode on lights that will change significantly during gameplay.
ga: ** Dinimiciúil (réamhshocraithe) :** Ní chuirfear an solas san áireamh le haghaidh bácáil SDFGI, ach cuirfidh sé soilsiú indíreach leis an radharc i bhfíor-am fós. Tá an rogha seo níos moille i gcomparáid len**Statach**. Ná húsáid ach an modh soilsithe domhanda **Dinimic** ar shoilse a athróidh go suntasach le linn gameplay.
pt_br: **Dynamic (padrão):** A luz não será considerada no bake do SDFGI, mas ainda assim contribuirá com iluminação indireta para a cena em tempo real. Essa opção é mais lenta em comparação com **Static**. Use o modo de iluminação global **Dynamic** apenas em luzes que mudarão significativamente durante a jogabilidade.
ru: **Dynamic (Динамический, по умолчанию):** Источник света не учитывается при генерации SDFGI, но продолжает влиять на непрямое освещение сцены в реальном времени. Этот режим работает медленнее, чем **Static**. Используйте **Dynamic** только для источников света, параметры которых будут существенно изменяться в процессе игры.
ta: ** மாறும் (இயல்புநிலை): ** எச்.டி.எஃப்.சி.ஐ பேக்கிங்கிற்கு ஒளி கணக்கில் எடுத்துக்கொள்ளப்படாது, ஆனால் இது நிகழ்நேரத்தில் காட்சிக்கு மறைமுக விளக்குகளை பங்களிக்கும். ** நிலையான ** உடன் ஒப்பிடும்போது இந்த விருப்பம் மெதுவாக உள்ளது. விளையாட்டின் போது கணிசமாக மாறும் விளக்குகளில் ** மாறும் ** உலகளாவிய வெளிச்சம் பயன்முறையை மட்டுமே பயன்படுத்தவும்.
uk: **Динамічний (за замовчуванням):** Світло не враховуватиметься для запікання SDFGI, але воно все одно вноситиме непряме освітлення в сцену в режимі реального часу. Цей параметр працює повільніше, ніж **Static**. Використовуйте режим глобального освітлення **Динамічний** лише для освітлення, яке значно змінюється під час гри.

source: The amount of indirect energy emitted by a light depends on its color, energy *and* indirect energy properties. To make a specific light emit more or less indirect energy without affecting the amount of direct light emitted by the light, adjust the **Indirect Energy** property in the Light3D inspector.
ga: Braitheann méid an fhuinnimh indíreach a astaíonn solas ar a dhath, fuinnim* agus* airíonna fuinnimh indíreacha. Chun solas ar leith fuinneamh indíreach níos mó nó níos lú a scaoileadh gan dul i bhfeidhm ar an méid solais dhíreach a astaíonn an solas, coigeartaigh an maoin **Fuinneamh Indíreach sa chigire Light3D.
pt_br: A quantidade de energia indireta emitida por uma luz depende de suas propriedades de cor, energia *e* energia indireta. Para fazer com que uma luz específica emita mais ou menos energia indireta sem afetar a quantidade de luz direta emitida, ajuste a propriedade **Indirect Energy** no inspetor do Light3D.
ru: Количество непрямой энергии, излучаемой источником света, зависит от его цвета, энергии и свойства indirect energy. Чтобы конкретный источник света излучал больше или меньше непрямой энергии, не влияя на количество прямого света, отрегулируйте свойство **Indirect Energy** в инспекторе Light3D.
ta: ஒரு ஒளியால் வெளிப்படும் மறைமுக ஆற்றலின் அளவு அதன் நிறம், ஆற்றல் * மற்றும் * மறைமுக ஆற்றல் பண்புகளைப் பொறுத்தது. ஒரு குறிப்பிட்ட ஒளியை ஒளியால் வெளிப்படும் நேரடி ஒளியின் அளவைப் பாதிக்காமல் அதிகமாகவோ அல்லது குறைவாகவோ மறைமுக ஆற்றலை வெளியிடுவதற்கு, லைட் 3 டி இன்ச்பெக்டரில் உள்ள ** மறைமுக ஆற்றல் ** சொத்தை சரிசெய்யவும்.
uk: Кількість непрямої енергії, яку випромінює світло, залежить від його кольору, енергії *і* властивостей непрямої енергії. Щоб певне джерело світла випромінювало більше або менше непрямої енергії, не впливаючи на кількість прямого світла, випромінюваного світлом, налаштуйте властивість **Indirect Energy** в інспекторі Light3D.

source: See :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations` for general usage recommendations.
ga: Féach:ref: `doc_introduction_to_global_illumination_gi_mode_molations` le haghaidh moltaí úsáide ginearálta.
pt_br: Consulte :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations` para recomendações gerais de uso.
ru: Загляните в :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations` за советами по использованию.
ta: காண்க: Ref: `doc_introduction_to_global_illumination_gi_mode_recommentations` பொதுவான பயன்பாட்டு பரிந்துரைகளுக்கு.
uk: Перегляньте :ref:`doc_introduction_to_global_illumination_gi_mode_recommendations` для загальних рекомендацій щодо використання.

source: Adjusting SDFGI performance and quality
ga: Feidhmíocht agus cáilíocht SDFGI a choigeart
pt_br: Ajustando o desempenho e a qualidade do SDFGI
ru: Настройка производительности и качества SDFGI
ta: SDFGI செயல்திறன் மற்றும் தரத்தை சரிசெய்தல்
uk: Налаштування продуктивності та якості SDFGI

source: Since SDFGI is relatively demanding, it will perform best on systems with recent dedicated GPUs. On older dedicated GPUs and integrated graphics, tweaking the settings is necessary to achieve reasonable performance.
ga: Ós rud é go bhfuil SDFGI réasúnta éilimh, feidhmeoidh sé is fearr ar chórais a bhfuil GPUanna tiomnaithe le déanaí acu. Ar GPUanna tiomnaithe níos sine agus grafaicí comhtháite, is gá na socruithe a athrú chun feidhmíocht réasúnta a bhaint amach.
pt_br: Como o SDFGI é relativamente exigente, ele terá o melhor desempenho em sistemas com GPUs dedicadas recentes. Em GPUs dedicadas mais antigas e gráficos integrados, é necessário ajustar as configurações para obter desempenho razoável.
ru: Поскольку SDFGI достаточно требователен к ресурсам, наилучшая производительность достигается на системах с современными дискретными GPU. На старых дискретных и интегрированных видеокартах требуется настройка параметров для достижения приемлемой производительности.
ta: எச்.டி.எஃப்.சி.ஐ ஒப்பீட்டளவில் கோருவதால், இது அண்மைக் கால அர்ப்பணிப்பு சி.பீ.யுகளுடன் கணினிகளில் சிறப்பாக செயல்படும். பழைய அர்ப்பணிப்பு சி.பீ.யுகள் மற்றும் ஒருங்கிணைந்த கிராபிக்ச் ஆகியவற்றில், நியாயமான செயல்திறனை அடைய அமைப்புகளை மாற்றுவது தேவை.
uk: Оскільки SDFGI є відносно вимогливим, він працюватиме найкраще на системах із останніми виділеними графічними процесорами. На старіших виділених графічних процесорах та інтегрованій графічній карті потрібно налаштувати параметри, щоб досягти прийнятної продуктивності.

source: In the Project Settings' **Rendering > Global Illumination** section, SDFGI quality can also be adjusted in several ways:
ga: Sa rannán **Rindreáil > Soilsiú Domhanda** i Socruithe an Tionscadail, is féidir cáilíocht SDFGI a choigeartú ar bhealaí éagsúla freisin:
pt_br: Na seção **Renderização > Iluminação Global** das Configurações do Projeto, a qualidade do SDFGI também pode ser ajustada de várias maneiras:
ru: В разделе **Rendering > Global Illumination** (Рендеринг > Глобальное освещение) настроек проекта качество SDFGI можно настроить несколькими способами:
ta: திட்ட அமைப்புகள் '** ரெண்டரிங்> உலகளாவிய வெளிச்சம் ** பிரிவில், SDFGI தரத்தையும் பல வழிகளில் சரிசெய்ய முடியும்:
uk: У розділі **Візуалізація > Глобальне освітлення** параметрів проекту якість SDFGI також можна налаштувати кількома способами:

source: **Sdfgi > Probe Ray Count:** Higher values result in better quality, at the cost of higher GPU usage. If this value is set too low, this can cause surfaces to have visible "splotches" of indirect lighting on them due to the number of rays thrown being very low.
ga: ** Sdfgi > Comhaireamh Probe Ray:** Bíonn cáilíocht níos fearr mar thoradh ar luachanna níos airde, ar chostas úsáide GPU níos airde. Má shocraítear an luach seo ró-íseal, féadann sé seo a bheith ina chúis le dromchlaí “splotches” soilsithe indíreacha a bheith orthu mar gheall ar líon na gathanna a chaitear a bheith an-íseal.
pt_br: **Sdfgi > Número de Raios de Sonda:** Valores mais altos resultam em melhor qualidade, mas com maior uso da GPU. Se esse valor for definido muito baixo, as superfícies podem apresentar "manchas" visíveis de iluminação indireta devido ao número muito baixo de raios emitidos.
ru: **Sdfgi > Probe Ray Count (Количество лучей проб):** Более высокие значения улучшают качество, но увеличивают нагрузку на GPU. При слишком низком значении на поверхностях могут появляться заметные "пятна" непрямого освещения из-за недостаточного количества лучей.
ta: ** SDFGI> ஆய்வு கதிர் எண்ணிக்கை: ** அதிக மதிப்புகள் சிறந்த தரத்தை விளைவிக்கின்றன, அதிக GPU பயன்பாட்டின் செலவில். இந்த மதிப்பு மிகக் குறைவாக அமைக்கப்பட்டால், இது மேற்பரப்புகளை மறைமுக விளக்குகளின் "ச்ப்ளோட்சுகள்" காணக்கூடியதாக இருக்கும், ஏனெனில் கதிர்களின் எண்ணிக்கை மிகக் குறைவாக இருப்பதால்.
uk: **Sdfgi > Probe Ray Count:** Вищі значення забезпечують кращу якість за рахунок більшого використання GPU. Якщо це значення встановлено надто низьким, це може призвести до того, що на поверхнях з’являться видимі «плями» непрямого освітлення через дуже низьку кількість випромінюваних променів.

source: **Sdfgi > Frames To Converge:** Higher values result in better quality, but GI will take more time to fully converge. The effect of this setting is especially noticeable when first loading a scene, or when lights with a bake mode other than **Disabled** are moving fast. If this value is set too low, this can cause surfaces to have visible "splotches" of indirect lighting on them due to the number of rays thrown being very low. If your scene's lighting doesn't have fast-moving lights that contribute to GI, consider setting this to ``30`` to improve quality without impacting performance.
ga: **Sdfgi > Frámaí le Cóineasú:** Bíonn cáilíocht níos fearr mar thoradh ar luachanna níos airde, ach tógfaidh sé níos mó ama ar GI teacht le chéile go hiomlán. Tá éifeacht an tsocraithe seo le feiceáil go háirithe agus radharc á luchtú ar dtús, nó nuair a bhíonn soilse le modh bácála seachas **Díchumasaithe** ag gluaiseacht go tapa. Má shocraítear an luach seo ró-íseal, féadann sé seo a bheith ina chúis le dromchlaí “splotches” soilsithe indíreacha a bheith orthu mar gheall ar líon na gathanna a chaitear a bheith an-íseal. Mura bhfuil soilse mearghluaiseachta a chuireann le GI i soilsiú do radharc, smaoinigh ar é seo a shocrú go ``30`` chun cáilíocht a fheabhsú gan cur isteach ar fheidhmíocht.
ru: **Sdfgi > Frames To Converge (Кадры до схождения):** Более высокие значения улучшают качество, но глобальное освещение будет дольше полностью сходиться. Эффект особенно заметен при загрузке сцены или быстром движении источников света с режимом запекания, отличным от **Disabled**. Слишком низкое значение может вызвать появление "пятен" непрямого освещения из-за недостатка лучей. Если в сцене нет быстродвижущихся источников, влияющих на GI, установите значение ``30`` для улучшения качества без потери производительности.
ta: ** SDFGI> ஒன்றிணைக்க பிரேம்கள்: ** அதிக மதிப்புகள் சிறந்த தரத்தை விளைவிக்கின்றன, ஆனால் சி.ஐ முழுமையாக ஒன்றிணைக்க அதிக நேரம் எடுக்கும். முதலில் ஒரு காட்சியை ஏற்றும்போது, அல்லது ** முடக்கப்பட்ட ** தவிர வேறு சுட்டுக்கொள்ளும் பயன்முறையுடன் விளக்குகள் வேகமாக நகரும் போது இந்த அமைப்பின் விளைவு குறிப்பாக கவனிக்கப்படுகிறது. இந்த மதிப்பு மிகக் குறைவாக அமைக்கப்பட்டால், இது மேற்பரப்புகளை மறைமுக விளக்குகளின் "ச்ப்ளோட்சுகள்" காணக்கூடியதாக இருக்கும், ஏனெனில் கதிர்களின் எண்ணிக்கை மிகக் குறைவாக இருப்பதால். உங்கள் காட்சியின் விளக்குகளில் சி.ஐ.க்கு பங்களிக்கும் வேகமாக நகரும் விளக்குகள் இல்லை என்றால், செயல்திறனை பாதிக்காமல் தரத்தை மேம்படுத்த இதை `` 30`` என அமைப்பதைக் கவனியுங்கள்.
uk: **Sdfgi > Frames To Converge:** Вищі значення забезпечують кращу якість, але GI потребує більше часу для повного зближення. Ефект цього параметра особливо помітний під час першого завантаження сцени або коли світло з режимом запікання, відмінним від **Вимкнено**, швидко рухається. Якщо це значення встановлено надто низьким, це може призвести до того, що на поверхнях з’являться видимі «плями» непрямого освітлення через дуже низьку кількість випромінюваних променів. Якщо освітлення вашої сцени не має швидкоплинних джерел світла, які сприяють GI, подумайте про встановлення значення «30», щоб покращити якість без впливу на продуктивність.

source: **Sdfgi > Frames To Update Light:** Lower values result in moving lights being reflected faster, at the cost of higher GPU usage. If your scene's lighting doesn't have fast-moving lights that contribute to GI, consider setting this to ``16`` to improve performance.
ga: ** Sdfgi > Frámaí chun Solas a Nuashonrú:** Mar thoradh ar luachanna níos ísle léirítear soilse ag gluaiseacht níos tapúla, ar chostas úsáide GPU níos airde. Mura bhfuil soilse mearghluaiseachta a chuireann le GI i soilsiú do radharc, smaoinigh ar seo a shocrú go ``16`` chun feidhmíocht a fheabhsú.
ru: **Sdfgi > Frames To Update Light (Кадры для обновления света):** Низкие значения обеспечивают более быстрое отражение изменений движущихся источников света, но увеличивают нагрузку на GPU. Если в сцене нет быстродвижущихся источников, влияющих на GI, установите значение ``16`` для повышения производительности.
ta: ** SDFGI> ஒளியைப் புதுப்பிக்க பிரேம்கள்: ** குறைந்த மதிப்புகள் அதிக சி.பீ.யூ பயன்பாட்டின் செலவில், விளக்குகள் வேகமாக பிரதிபலிக்கின்றன. உங்கள் காட்சியின் விளக்குகளில் சி.ஐ.க்கு பங்களிக்கும் வேகமாக நகரும் விளக்குகள் இல்லை என்றால், செயல்திறனை மேம்படுத்த இதை `` 16`` என அமைப்பதைக் கவனியுங்கள்.
uk: **Sdfgi > Frames To Update Light:** Нижчі значення призводять до того, що світло, що рухається, відбивається швидше, ціною більшого використання GPU. Якщо освітлення вашої сцени не має вогні, що швидко рухаються, що сприяють GI, подумайте про встановлення значення ``16``, щоб покращити продуктивність.

source: **Gi > Use Half Resolution:** If enabled, both SDFGI and VoxelGI will have their GI buffer rendering at halved resolution. For instance, when rendering in 3840×2160, the GI buffer will be computed at a 1920×1080 resolution. Enabling this option saves a lot of GPU time, but it can introduce visible aliasing around thin details.
ga: **Gi > Úsáid Leathtaifeach:** Má tá sé cumasaithe, beidh rindreáil maoláin GI SDFGI agus VoxelGI ag taifeach leath. Mar shampla, agus 3840×2160 á rindreáil, déanfar an maolán GI a ríomh ag taifeach 1920×1080. Sábhálann cumasú an rogha seo go leor ama GPU, ach féadann sé ailiasú infheicthe a thabhairt isteach thart ar mhionsonraí tanaí.
ru: **Gi > Use Half Resolution (Использовать половинное разрешение):** Если включено, буфер глобального освещения (GI) для SDFGI и VoxelGI будет рендериться в половинном разрешении. Например, при рендеринге в 3840×2160 буфер GI будет вычисляться в разрешении 1920×1080. Включение этой опции значительно экономит ресурсы GPU, но может вызывать заметные артефакты сглаживания на тонких деталях.
ta: . உதாரணமாக, 3840 × 2160 இல் வழங்குதல் செய்யும் போது, சிஐ இடையக 1920 × 1080 தீர்மானத்தில் கணக்கிடப்படும். இந்த விருப்பத்தை செயல்படுத்துவது நிறைய சி.பீ.யூ நேரத்தை மிச்சப்படுத்துகிறது, ஆனால் இது மெல்லிய விவரங்களைச் சுற்றி காணக்கூடிய மாற்றுப்பெயரை அறிமுகப்படுத்தலாம்.
uk: **Gi > Використовувати половинну роздільну здатність:** якщо ввімкнено, SDFGI та VoxelGI матимуть відтворення буфера GI із роздільною здатністю вдвічі. Наприклад, під час візуалізації в 3840×2160 буфер GI обчислюватиметься з роздільною здатністю 1920×1080. Увімкнення цього параметра економить багато часу графічного процесора, але це може ввести видимі накладки навколо тонких деталей.

source: SDFGI rendering performance also depends on the number of cascades and the cell size chosen in the Environment resource (see above).
ga: Braitheann feidhmíocht rindreála SDFGI freisin ar líon na gcascaí agus ar mhéid na gcille a roghnaítear san acmhainn Comhshaoil (féach thuas).
pt_br: O desempenho de renderização SDFGI também depende do número de cascatas e do tamanho da célula escolhido no recurso Ambiente (ver acima).
ru: Производительность рендеринга SDFGI также зависит от количества каскадов и размера ячейки, заданных в ресурсе Environment (см. выше).
ta: SDFGI வழங்குதல் செயல்திறன் அடுக்குகளின் எண்ணிக்கை மற்றும் சுற்றுச்சூழல் வளத்தில் தேர்ந்தெடுக்கப்பட்ட செல் அளவைப் பொறுத்தது (மேலே காண்க).
uk: Продуктивність відтворення SDFGI також залежить від кількості каскадів і розміру комірки, вибраного в ресурсі середовища (див. вище).

source: SDFGI caveats
ga: Rabhadh SDFGI
pt_br: Ressalvas do SDFGI
ru: Вот с чем стоит быть осторожным
ta: SDFGI CATEATS
uk: Застереження SDFGI

source: SDFGI has some downsides due to its cascaded nature. When the camera moves, cascade shifts may be visible in indirect lighting. This can be alleviated by adjusting the cascade size, but also by adding fog (which will make distant cascade shifts less noticeable).
ga: Tá roinnt míbhuntáistí ag SDFGI mar gheall ar a nádúr cascádáilte. Nuair a ghluaiseann an ceamara, d'fhéadfadh go mbeadh aistrithe cascaire le feiceáil i so Is féidir é seo a mhaolú trí mhéid an choscaire a choigeartú, ach freisin trí ceo a chur leis (rud a fhágfaidh go mbeidh athruithe cascadh i gcéin chomh suntasach).
pt_br: O SDFGI tem algumas desvantagens devido à sua natureza em cascata. Quando a câmera se move, as mudanças em cascata podem ser visíveis na iluminação indireta. Isso pode ser aliviado ajustando o tamanho da cascata, mas também adicionando névoa (que fará deslocamentos de cascata distantes menos perceptíveis).
ru: SDFGI имеет некоторые недостатки из-за каскадной природы. При движении камеры сдвиги каскадов могут быть заметны в непрямом освещении. Это можно смягчить настройкой размера каскадов или добавлением тумана (который сделает сдвиги вдали менее заметными).
ta: எச்.டி.எஃப்.சி.ஐ அதன் அடுக்கப்பட்ட தன்மை காரணமாக சில தீங்குகளைக் கொண்டுள்ளது. கேமரா நகரும்போது, மறைமுக விளக்குகளில் அடுக்கை மாற்றங்கள் தெரியும். அடுக்கை அளவை சரிசெய்வதன் மூலம் இதைத் தணிக்க முடியும், ஆனால் மூடுபனியைச் சேர்ப்பதன் மூலமும் (இது தொலைதூர அடுக்கை மாற்றங்களை குறைவாக கவனிக்க வைக்கும்).
uk: SDFGI має деякі недоліки через свою каскадну природу. Коли камера рухається, у непрямому освітленні можуть бути помітні каскадні зсуви. Це можна пом’якшити, відрегулювавши розмір каскаду, а також додавши туман (що зробить віддалені зсуви каскаду менш помітними).

source: Additionally, performance will suffer if the camera moves too fast. This can be fixed in two ways:
ga: Ina theannta sin, beidh feidhmíocht ag fulaingt má bhogann an ceamara ró-tapa. Is féidir é seo a shocrú ar dhá bhealach:
pt_br: Além disso, o desempenho sofrerá se a câmera se mover muito rápido. Isso pode ser corrigido de duas maneiras:
ru: Кроме того, производительность снизится при слишком быстром движении камеры. Это можно исправить двумя способами:
ta: கூடுதலாக, கேமரா மிக வேகமாக நகர்ந்தால் செயல்திறன் பாதிக்கப்படும். இதை இரண்டு வழிகளில் சரி செய்யலாம்:
uk: Крім того, продуктивність погіршиться, якщо камера рухається надто швидко. Це можна виправити двома способами:

source: Ensuring the camera doesn't move too fast in any given situation.
ga: A chinntiú nach mbogann an ceamara ró-thapa in aon chás ar leith.
pt_br: Garantir que a câmera não se move muito rápido em qualquer situação.
ru: Обеспечение плавного движения камеры во всех ситуациях.
ta: எந்தவொரு சூழ்நிலையிலும் கேமரா மிக வேகமாக நகராது.
uk: Переконайтеся, що камера не рухається надто швидко в будь-якій ситуації.

source: Temporarily disabling SDFGI in the Environment resource if the camera needs to be moved at a high speed, then enabling SDFGI once the camera speed slows down.
ga: SDFGI a dhíchumasú go sealadach san acmhainn Comhshaoil más gá an ceamara a bhogadh ar luas ard, ansin SDFGI a chumasú nuair a mhoilligh luas an cheamara.
pt_br: Desabilitar temporariamente o SDFGI no recurso Ambiente se a câmera precisar ser movida em alta velocidade, e depois habilitar o SDFGI assim que a velocidade da câmera diminuir.
ru: Временное отключение SDFGI в ресурсе Environment при быстром перемещении камеры с последующим включением после снижения скорости.
ta: சுற்றுச்சூழல் வளத்தில் SDFGI ஐ தற்காலிகமாக முடக்குவது கேமராவை அதிவேகமாக நகர்த்த வேண்டுமானால், கேமரா விரைவு குறைந்தவுடன் SDFGI ஐ இயக்குகிறது.
uk: Тимчасове вимкнення SDFGI в ресурсі середовища, якщо камеру потрібно рухати з високою швидкістю, а потім увімкнення SDFGI, коли швидкість камери сповільнюється.

source: When SDFGI is enabled, it will also take some time for global illumination to be fully converged (25 frames by default). This can create a noticeable transition effect while GI is still converging. To hide this, you can use a ColorRect node that spans the whole viewport and fade it out when switching scenes using an AnimationPlayer node.
ga: Nuair a chumasaítear SDFGI, tógfaidh sé roinnt ama freisin go ndéanfar soilsiú domhanda a chomhcheangal go hiomlán (25 fráma de réir réamhshocraithe). Féadann sé seo éifeacht aistrithe suntasach a chruthú agus GI fós ag teacht le chéile. Chun é seo a cheilt, is féidir leat nód ColorRect a úsáid a chuimsíonn an radharc iomlán agus é a chaitheamh amach agus radhairc á athrú ag baint úsáide as nód AnimationPlayer.
pt_br: Quando o SDFGI está habilitado, também levará algum tempo para a iluminação global convergir completamente (25 frames por padrão). Isso pode criar um efeito de transição perceptível enquanto a Iluminação Global (GI) ainda está convergindo. Para esconder isso, você pode usar um nó ColorRect que se estende por toda a viewport e desvanece-o (fade out) ao trocar de cena, usando um nó AnimationPlayer.
ru: При включении SDFGI глобальному освещению требуется время для полного схождения (по умолчанию 25 кадров). Это может создавать заметный переходный эффект во время схождения GI. Для маскировки используйте узел ColorRect, охватывающий весь вьюпорт, с плавным исчезновением (fade out) при переключении сцен через AnimationPlayer.
ta: SDFGI இயக்கப்பட்டால், உலகளாவிய வெளிச்சம் முழுமையாக ஒன்றிணைக்க சிறிது நேரம் எடுக்கும் (இயல்பாக 25 பிரேம்கள்). சி.ஐ இன்னும் ஒன்றிணைந்து கொண்டிருக்கும்போது இது ஒரு குறிப்பிடத்தக்க மாற்றம் விளைவை உருவாக்க முடியும். இதை மறைக்க, நீங்கள் முழு காட்சியகத்தையும் பரப்பும் மற்றும் அனிமேசன் பிளேயர் முனையைப் பயன்படுத்தி காட்சிகளை மாற்றும்போது அதை மங்கச் செய்யலாம்.
uk: Коли SDFGI увімкнено, для повної конвергенції глобального освітлення також знадобиться деякий час (25 кадрів за замовчуванням). Це може створити помітний ефект переходу, поки GI все ще зближується. Щоб приховати це, ви можете використовувати вузол ColorRect, який охоплює все вікно перегляду та зникає під час перемикання сцен за допомогою вузла AnimationPlayer.
