Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/development/debugging/profiling/sampling_profilers.po
Languages: ga, tr, uk

source: Recommended profilers
ga: Próifíleoirí molta
tr: Önerilen profil çıkarıcılar
uk: Рекомендовані профайлери

source: `VerySleepy <http://www.codersnotes.com/sleepy/>`__ (Windows only)
ga: `An-Sleepy <http://www.codersnotes.com/sleepy/>`__ (Windows amháin)
tr: `VerySleepy <http://www.codersnotes.com/sleepy/>`__ (sadece Windows)
uk: `VerySleepy <http://www.codersnotes.com/sleepy/>`__ (тільки для Windows)

source: `HotSpot <https://github.com/KDAB/hotspot>`__ (Linux only)
ga: `HotSpot <https://github.com/KDAB/hotspot>`__ (Linux amháin)
tr: `HotSpot <https://github.com/KDAB/hotspot>`__ (sadece Linux)
uk: `HotSpot <https://github.com/KDAB/hotspot>`__ (тільки для Linux)

source: `Xcode Instruments <https://developer.apple.com/xcode/>`__ (macOS only)
ga: `Xcode Instruments <https://developer.apple.com/xcode/>`__ (macOS amháin)
tr: `Xcode Instruments <https://developer.apple.com/xcode/>`__ (sadece macOS)
uk: `Xcode Instruments <https://developer.apple.com/xcode/>`__ (лише для macOS)

source: These profilers may not be the most powerful or flexible options, but their standalone operation and limited feature set tends to make them easier to use.
ga: B'fhéidir nach iad na próifíleoirí seo na roghanna is cumhachtaí nó is solúbtha, ach is iondúil go mbíonn a n-oibriú neamhspleách agus a sraith gné teoranta níos éasca le húsáid.
tr: Bu profil çıkarıcılar en güçlü veya esnek seçenekler olmayabilir, ancak bağımsız çalışmaları ve sınırlı özellik setleri kullanımlarını kolaylaştırma eğilimindedir.
uk: Ці профайлери можуть бути не найпотужнішими чи найгнучкішими варіантами, але їхня автономна робота та обмежений набір функцій, як правило, роблять їх зручнішими у використанні.

source: Setting up Godot
ga: Godot a bhunú
tr: Godot'nun Ayarlanması
uk: Налаштування Godot

source: To get useful profiling information, it is **absolutely required** to use a Godot build that includes debugging symbols. Official binaries do not include debugging symbols, since these would make the download size significantly larger.
ga: Chun faisnéis úsáideach próifílithe a fháil, tá sé **ag teastáil go hiomlán** tógáil Godot a úsáid lena n-áirítear siombailí dífhabhtaithe. Ní binaries oifigiúla san áireamh siombailí debugging, ós rud é go mbeadh na dhéanamh ar an méid íoslódáil i bhfad níos mó.
tr: Yararlı profilleme bilgileri elde etmek için, hata ayıklama sembolleri içeren bir Godot derlemesi kullanmak **kesinlikle gereklidir**. Resmi ikili dosyalar hata ayıklama sembollerini içermez, çünkü bunlar indirme boyutunu önemli ölçüde artırır.
uk: Щоб отримати корисну інформацію профілювання, **абсолютно необхідно** використовувати збірку Godot, яка містить символи налагодження. Офіційні двійкові файли не включають символи налагодження, оскільки вони значно збільшать розмір завантаження.

source: To get profiling data that best matches the production environment (but with debugging symbols), you should compile binaries with the ``production=yes debug_symbols=yes`` SCons options.
ga: Chun sonraí próifílithe a fháil is fearr a oireann don timpeallacht táirgthe (ach le siombailí dífhabhtaithe), ba chóir duit binaries a thiomsú leis na roghanna SCons ''production=yes debug_symbols=yes''.
tr: Üretim ortamına (ancak hata ayıklama sembolleriyle) en iyi uyan profil çıkarma verilerini elde etmek için, ikili dosyaları ``production=yes debug_symbols=yes`` SCons seçenekleriyle derlemelisiniz.
uk: Щоб отримати дані профілювання, які найкраще відповідають робочому середовищу (але з символами налагодження), вам слід скомпілювати двійкові файли з параметрами ``production=yes debug_symbols=yes`` SCons.

source: It is possible to run a profiler on less optimized builds (e.g. ``target=template_debug`` without LTO), but results will naturally be less representative of real world conditions.
ga: Is féidir próifíleoir a reáchtáil ar thógáil nach bhfuil chomh optamaithe (e.g. ''target =template_debug'' gan LTO), ach ar ndóigh ní bheidh na torthaí chomh hionadaíoch céanna ar dhálaí an tsaoil mhóir.
tr: Daha az optimize edilmiş yapılarda (örneğin LTO olmadan ``target=template_debug``) bir profil çıkarıcı çalıştırmak mümkündür, ancak sonuçlar doğal olarak gerçek dünya koşullarını daha az temsil edecektir.
uk: Можна запустити профайлер на менш оптимізованих збірках (наприклад, ``target=template_debug`` без LTO), але результати, природно, будуть менш репрезентативними для умов реального світу.

source: Do *not* strip debugging symbols on the binaries using the ``strip`` command after compiling the binaries. Otherwise, you will no longer get useful profiling information when running a profiler.
ga: Ná *not * stiall siombailí debugging ar na binaries ag baint úsáide as an ordú ''stiall'' tar éis thiomsú na binaries. Seachas sin, ní bhfaighidh tú faisnéis úsáideach próifílithe a thuilleadh agus próifíleoir á rith agat.
tr: İkilileri derledikten sonra ``strip`` komutunu kullanarak ikililerdeki hata ayıklama sembollerini *sıyırmayın*. Aksi takdirde, bir profil çıkarıcı çalıştırırken artık yararlı profilleme bilgileri elde edemezsiniz.
uk: *Не* видаляйте символи налагодження у двійкових файлах за допомогою команди ``strip`` після компіляції двійкових файлів. Інакше ви більше не отримуватимете корисну інформацію профілювання під час запуску профайлера.

source: Benchmarking startup/shutdown times
ga: Amanna tosaithe / múchadh tagarmharcála
tr: Başlatma/kapatma sürelerinin kıyaslanması
uk: Порівняльний аналіз часу запуску/вимкнення

source: See :ref:`doc_command_line_tutorial` for more command line arguments supported by Godot.
ga: Féach :ref:'doc_command_line_tutorial' le haghaidh níos mó argóintí líne ordaithe le tacaíocht ó Godot.
tr: Godot tarafından desteklenen daha fazla komut satırı argümanı için :ref:`doc_command_line_tutorial` sayfasına bakın.
uk: Перегляньте :ref:`doc_command_line_tutorial` більше аргументів командного рядка, які підтримує Godot.

source: Profiler-specific instructions
ga: Treoracha a bhaineann go sonrach le próifíleoir
tr: Profil-çıkarıcıya-özel talimatlar
uk: Спеціальні інструкції профайлера

source: VerySleepy
ga: An-Chodladh
uk: Дуже Сонний

source: Start the Godot editor or your project first. If you start the Project Manager, make sure to edit or run a project first. Otherwise, the profiler will not track the child process since the Project Manager will spawn a child process for every project edited or run.
ga: Tosaigh an t-eagarthóir Godot nó do thionscadal ar dtús. Má thosaíonn tú an Bainisteoir Tionscadail, déan cinnte tionscadal a chur in eagar nó a reáchtáil ar dtús. Seachas sin, ní dhéanfaidh an próifíleoir an próiseas leanaí a rianú ós rud é go sceithfidh an Bainisteoir Tionscadail próiseas leanaí do gach tionscadal a chuirtear in eagar nó a rithfear.
tr: Önce Godot düzenleyicisini veya projenizi başlatın. Proje Yöneticisi'ni başlatırsanız, önce bir projeyi düzenlediğinizden veya çalıştırdığınızdan emin olun. Aksi takdirde, Proje Yöneticisi düzenlenen veya çalıştırılan her proje için bir alt süreç oluşturacaktır ama profil oluşturucu bu alt süreci izlemeyecektir.
uk: Спочатку запустіть редактор Godot або свій проект. Якщо ви запускаєте менеджер проектів, переконайтеся, що спочатку відредагували або запустили проект. В іншому випадку профайлер не відстежуватиме дочірній процес, оскільки менеджер проекту створюватиме дочірній процес для кожного редагованого або запущеного проекту.

source: Open VerySleepy and select the Godot executable in the list of processes on the left:
ga: Oscail VerySleepy agus roghnaigh an inrite Godot i liosta na bpróiseas ar chlé:
tr: VerySleepy'yi açın ve soldaki işlemler listesinden Godot yürütülebilir dosyasını seçin:
uk: Відкрийте VerySleepy і виберіть виконуваний файл Godot у списку процесів ліворуч:

source: Click the **Profile All** button on the right to start profiling.
ga: Cliceáil ar an gcnaipe **Profile All ** ar dheis chun próifíliú a thosú.
tr: Profil oluşturmaya başlamak için sağdaki **Profile All** düğmesine tıklayın.
uk: Натисніть кнопку **Профілювати всі** праворуч, щоб почати профілювання.

source: Perform the actions you wish to profile in the editor or project. When you're done, click **Stop** (*not* Abort).
ga: Déan na gníomhartha is mian leat a phróifíliú san eagarthóir nó sa tionscadal. Nuair a bheidh tú déanta, cliceáil **Stop** (*not* Tobscoir).
tr: Düzenleyicide veya projede profilini oluşturmak istediğiniz eylemleri gerçekleştirin. İşiniz bittiğinde **Stop** seçeneğine tıklayın (*Abort* değil) .
uk: Виконайте дії, які ви хочете профілювати, у редакторі чи проекті. Коли закінчите, натисніть **Зупинити** (*а не* Перервати).

source: Wait for the results window to appear.
ga: Fan go mbeidh fuinneog na dtorthaí le feiceáil.
tr: Sonuçlar penceresinin görünmesini bekleyin.
uk: Дочекайтеся появи вікна з результатами.

source: Once the results window appears, filter the view to remove external modules (such as the graphics driver). You can filter by module by finding a line whose **Module** matches the Godot executable name, right-clicking that line then choosing **Filter Module to <Godot executable name>** in the dropdown that appears.
ga: Nuair a bheidh an fhuinneog torthaí le feiceáil, scagaigí an t-amharc chun modúil sheachtracha a bhaint (amhail an tiománaí grafaic). Is féidir leat scagadh de réir modúil trí líne a aimsiú a mheaitseálann **Modúl** leis an ainm inrite Godot, cliceáil ar dheis ar an líne sin agus roghnaigh **Modúl Scagaire go <ainm inrite Godot>** sa roghchlár anuas a fheictear.
tr: Sonuçlar penceresi göründüğünde, harici modülleri (grafik sürücüsü gibi) kaldırmak için görünümü filtreleyin. Modüle göre filtrelemeyi, **Module** değerinin Godot yürütülebilir dosyasının adıyla eşleştiği bir satır bulup bu satıra sağ tıklayarak ve ardından beliren açılır menüden **Filter Module to <Godot ikilisinin ismi>** seçeneğini belirleyerek yapabilirsiniz.
uk: Коли з’явиться вікно результатів, відфільтруйте подання, щоб видалити зовнішні модулі (наприклад, графічний драйвер). Ви можете відфільтрувати за модулем, знайшовши рядок, у якому **Модуль** збігається з назвою виконуваного файлу Godot, клацнувши правою кнопкою миші цей рядок і вибравши **Фільтрувати модуль до <ім’я виконуваного файлу Godot>** у спадному списку, що з’явиться.

source: Your results window should now look something like this:
ga: Ba chóir go mbeadh cuma éigin mar seo ar fhuinneog do thorthaí anois:
tr: Sonuçlar pencereniz şimdi bunun gibi bir şeye benzemelidir:
uk: Тепер вікно результатів має виглядати приблизно так:

source: HotSpot
ga: HotSpotName

source: Open HotSpot. Click **Record Data**:
ga: Oscail HotSpot. Cliceáil **Taifead Sonraí **:
tr: HotSpot'u açın. **Record Data** ögesine tıklayın:
uk: Відкрийте HotSpot. Натисніть **Записати дані**:

source: In the next window, specify the path to the Godot binary that includes debug symbols.
ga: Sa chéad fhuinneog eile, sonraigh an cosán chuig an dénártha Godot lena n-áirítear siombailí dífhabhtaithe.
tr: Bir sonraki pencerede, hata ayıklama sembollerini içeren Godot ikili dosyasının yolunu belirtin.
uk: У наступному вікні вкажіть шлях до двійкового файлу Godot, який містить символи налагодження.

source: Specify command line arguments to run a specific project, with or without the editor.
ga: Sonraigh argóintí líne na n-orduithe chun tionscadal ar leith a reáchtáil, leis an eagarthóir nó gan é.
tr: Belirli bir projeyi düzenleyici ile veya düzenleyici olmadan çalıştırmak için komut satırı argümanlarını belirtin.
uk: Укажіть аргументи командного рядка для запуску конкретного проекту, з редактором або без нього.

source: Click **Start Recording** and perform the actions you wish to profile in the editor/project.
ga: Cliceáil **Tosaigh Taifeadadh** agus déan na gníomhartha is mian leat a phróifíliú san eagarthóir/tionscadal.
tr: **Start Recording** ögesine tıklayın ve düzenleyicide/projede profil oluşturmak istediğiniz eylemleri gerçekleştirin.
uk: Натисніть **Почати запис** і виконайте дії, які ви бажаєте профілювати, у редакторі/проекті.

source: Click **View Results** and wait for the profiling visualization to be generated:
ga: Cliceáil **Féach ar Thorthaí** agus fan go nginfear an léirshamhlú próifílithe:
tr: **View Results** ögesine tıklayın ve profil oluşturma görselleştirmesinin oluşturulmasını bekleyin:
uk: Натисніть **Переглянути результати** та зачекайте, поки буде створено візуалізацію профілювання:

source: Use the tabs at the top to navigate between the different views. These views show the same data, but in different ways. The **Flame Graph** tab is a good way to see which functions take up the most time at a glance. These functions are therefore the most important ones to optimize, since optimizing them will improve performance the most.
ga: Bain úsáid as na cluaisíní ag an mbarr chun nascleanúint a dhéanamh idir na tuairimí éagsúla. Léiríonn na tuairimí seo na sonraí céanna, ach ar bhealaí éagsúla. Is bealach maith é an cluaisín **Flame Graph ** chun a fheiceáil cé na feidhmeanna a ghlacann an t-am is mó sracfhéachaint. Dá bhrí sin, is iad na feidhmeanna seo na cinn is tábhachtaí chun an leas is fearr a bhaint astu, ós rud é go bhfeabhsóidh siad feidhmíocht an chuid is mó.
tr: Farklı görünümler arasında gezinmek için üst kısımdaki sekmeleri kullanın. Bu görünümler aynı verileri farklı şekillerde gösterir. **Flame Graph** sekmesi, hangi fonksiyonların en çok zaman aldığını bir bakışta görmek için iyi bir yoldur. Bu nedenle, bu fonksiyonlar optimize edilmesi gereken en önemli fonksiyonlardır, çünkü performansı en çok bunların optimize edilmesi artıracaktır.
uk: Використовуйте вкладки вгорі, щоб переходити між різними видами. Ці перегляди показують однакові дані, але різними способами. Вкладка **Flame Graph** — це хороший спосіб одразу побачити, які функції займають найбільше часу. Тому ці функції є найважливішими для оптимізації, оскільки їхня оптимізація найбільше покращить продуктивність.

source: If you don't want the startup procedure to be included in the profile, you can also attach HotSpot to a running process by clicking **Record Data** then setting the **Launch Application** dropdown option to **Attach To Process(es)**.
ga: Mura dteastaíonn uait go gcuirfí an nós imeachta tosaithe san áireamh sa phróifíl, is féidir leat HotSpot a cheangal le próiseas reatha trí chliceáil ar **Sonraí Taifead** ansin an rogha anuas **Feidhmchlár Seolsaí** a shocrú chuig **Ceangail Le Próiseas (í) **.
tr: Başlatma prosedürünün profile dahil edilmesini istemiyorsanız, **Record Data** seçeneğine tıklayıp ardından **Launch Application** açılır seçeneğini **Attach To Process(es)** olarak ayarlayarak HotSpot'u çalışan bir işleme de iliştirebilirsiniz.
uk: Якщо ви не бажаєте, щоб процедура запуску була включена в профіль, ви також можете приєднати HotSpot до запущеного процесу, клацнувши **Записати дані**, а потім установивши для параметра спадного меню **Запустити програму** значення **Приєднати до процесу (es)**.

source: This process attachment-based workflow is similar to the one used by VerySleepy.
ga: Tá an sreabhadh oibre bunaithe ar cheangal próisis seo cosúil leis an gceann a úsáideann VerySleepy.
tr: Bu süreç-iliştirme-tabanlı iş akışı VerySleepy tarafından kullanılana benzer.
uk: Цей робочий процес, заснований на підключенні процесу, подібний до того, який використовує VerySleepy.

source: Xcode Instruments
ga: Ionstraimí Xcode
tr: Xcode Araçları
uk: Інструменти Xcode

source: Open Xcode. Select **Open Developer Tool** - **Instruments** from the **Xcode** app menu:
ga: Oscail Xcode. Roghnaigh **Uirlis Forbróra Oscail** - **Ionstraimí** ón roghchlár aipe**Xcode**:
tr: Xcode'u açın. **Xcode** uygulama menüsünden **Open Developer Tool** - **Instruments** ögesini seçin:
uk: Відкрийте Xcode. Виберіть **Open Developer Tool** - **Instruments** у меню програми **Xcode**:

source: Double-click on **Time Profiler** in the **Instruments** window:
ga: Cliceáil faoi dhó ar **Próifíl Ama** sa fhuinneog **Ionstraimí**:
tr: **Instruments** penceresinde **Time Profiler** üzerine çift tıklayın:
uk: Двічі клацніть **Time Profiler** у вікні **Instruments**:

source: You can also attach the Time Profiler to a running process by selecting it from the **Target** menu.
ga: Is féidir leat an Próifíl Ama a cheangal le próiseas reatha freisin tríd é a roghnú ón roghchlár **Sprioc**.
tr: Time Profiler'ı, **Target** menüsünden seçerek çalışan bir sürece de iliştirebilirsiniz.
uk: Ви також можете приєднати Time Profiler до запущеного процесу, вибравши його в меню **Target**.

source: Click the **Start an immediate mode recording** button to start profiling.
ga: Cliceáil ar an gcnaipe** Tosaigh taifeadadh mód láithreach** chun próifíliú a thosú.
tr: Profil oluşturmayı başlatmak için **Start an immediate mode recording** düğmesine tıklayın.
uk: Натисніть кнопку **Почати негайний режим запису**, щоб почати профілювання.

source: Perform the actions you wish to profile in the editor or project. When you're done, click the **Stop** button.
ga: Déan na gníomhartha is mian leat a phróifílú san eagarthóir nó sa tionscadal. Nuair a bheidh tú críochnaithe, cliceáil ar an gcnaipe **Stop**.
tr: Düzenleyicide veya projede profilini oluşturmak istediğiniz eylemleri gerçekleştirin. İşiniz bittiğinde **Stop** düğmesine tıklayın.
uk: Виконайте дії, які ви хочете профілювати, у редакторі чи проекті. Коли закінчите, натисніть кнопку **Зупинити**.

source: Wait for the results to appear.
ga: Fan go mbeidh na torthaí le feiceáil.
tr: Sonuçların görünmesini bekleyin.
uk: Дочекайтеся появи результатів.

source: At the bottom of the window you will see a call tree for all CPU threads started, and the **Heaviest Stack Trace** overview.
ga: Ag bun na fuinneoige feicfidh tú crann glaonna do gach snáithe LAP a thosaíodh, agus an forbhreathnú **Rá Stack is Trom**.
tr: Pencerenin altında, başlatılan tüm CPU iş parçacıkları için bir çağrı ağacı ve **Heaviest Stack Trace** genel görünümü göreceksiniz.
uk: У нижній частині вікна ви побачите дерево викликів для всіх запущених потоків процесора та огляд **Найважчого стека**.

source: You can use the timeline at the top of the window to display details for the specific time period.
ga: Is féidir leat an amlíne ag barr na fuinneoige a úsáid chun sonraí a thaispeáint don tréimhse ama sonrach.
tr: Belirli bir zaman dilimine ilişkin ayrıntıları görüntülemek için pencerenin üst kısmındaki zaman çizelgesini kullanabilirsiniz.
uk: Ви можете використовувати шкалу часу у верхній частині вікна, щоб відобразити деталі за певний період часу.
