Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/05.the_main_game_scene.po
Languages: ga, it, ta, tr, uk, zh_hant

source: The main game scene
ga: An príomhradharc cluiche
it: La scena principale del gioco
ta: முக்கிய விளையாட்டு காட்சி
tr: Ana oyun sahnesi
uk: Головна сцена гри
zh_hant: 測試場景

source: Now it's time to bring everything we did together into a playable game scene.
ga: Anois tá sé in am gach rud a rinneamar le chéile a thabhairt isteach i radharc cluiche in-imeartha.
it: Adesso è il momento di riunire tutto ciò che abbiamo fatto in una scena di gioco giocabile.
ta: இப்போது நாங்கள் செய்த அனைத்தையும் ஒரு விளையாடக்கூடிய விளையாட்டு காட்சியில் கொண்டு வர வேண்டிய நேரம் இது.
tr: Şimdi sırada, yaptığımız her şeyi bir araya getirip oynanabilir bir oyun sahnesi yapma zamanı.
uk: Тепер настав час об'єднати все, що ми зробили, разом, в ігрову сцену.
zh_hant: 現在是時候將我們所做的一切整合到一個可玩的遊戲場景中了。

source: Create a new scene and add a :ref:`Node <class_Node>` named ``Main``. (The reason we are using Node instead of Node2D is because this node will be a container for handling game logic. It does not require 2D functionality itself.)
ga: Cruthaigh radharc nua agus cuir leis :ref:`Nóid <class_Node>` darb ainm ``Príomh``. (Is é an chúis go bhfuilimid ag baint úsáide as Nód in ionad Node2D ná mar go mbeidh an nód seo ina choimeádán chun loighic cluiche a láimhseáil. Ní gá feidhmiúlacht 2D féin a bheith ann.)
it: Crea una nuova scena e aggiungi un :ref:`Node <class_Node>` chiamato ``Main``. (Il motivo per cui usiamo Node invece di Node2D è che questo nodo sarà un contenitore per gestire la logica di gioco. Non richiede di per sé la funzionalità 2D.)
ta: ஒரு புதிய காட்சியை உருவாக்கி A: Ref: `முனை <stoss_node>` `` main`` என்று சேர்க்கவும். (NODE2D க்கு பதிலாக நாங்கள் முனையைப் பயன்படுத்துவதற்கான காரணம், இந்த முனை விளையாட்டு தர்க்கத்தைக் கையாள ஒரு கொள்கலனாக இருக்கும். இதற்கு 2D செயல்பாடு தேவையில்லை.)
tr: Yeni bir sahne oluşturun ve ``Main`` isminde bir düğüm, :ref:`Node <class_Node>`, ekleyin. (Node2D yerine Node kullanma sebebimiz, bu düğümü oyunun mantığını tutması için kullanacak olmamızdır. Bunun kendisinde 2B işlevselliği gerekli değildir.)
uk: Створіть нову сцену та додайте :ref:`Node <class_Node>`*(Вузол)* з ім'ям ``Main``. (Ми використовуємо Node, а не Node2D, тому що саме цей вузол буде контейнером для обробки логіки гри. Він не вимагає 2D-функціональності.)
zh_hant: 創建新場景，然後加入一個 :ref:`Node <class_Node>` 節點，並命名為``Main``\ 。（我們之所以使用 Node 而不是 Node2D ，是因為這個節點是處理遊戲邏輯的容器，本身並不需 2D 的功能。）

source: Click the **Instance** button (represented by a chain link icon) and select your saved ``player.tscn``.
ga: Cliceáil ar an gcnaipe**Instance** (arna léiriú ag deilbhín nasc slabhra) agus roghnaigh do `player.tscn` shábháilte.
it: Clicca sul pulsante **Istanza** (rappresentato dall'icona di una catena) e selezionare il file ``player.tscn`` salvato.
ta: ** நிகழ்வு ** பொத்தானைக் சொடுக்கு செய்க (சங்கிலி இணைப்பு ஐகானால் குறிப்பிடப்படுகிறது) மற்றும் உங்கள் சேமித்த `` player.tscn`` என்பதைத் தேர்ந்தெடுக்கவும்.
tr: **Örnekleme** düğmesine tıklayın (zincir bağlantı simgesiyle gösterilir) ve kaydettiğiniz ``player.tscn`` dosyasını seçin.
uk: Клацніть кнопку **Створити екземпляр дочірньої сцени** (іконка ланцюжка) і виберіть збережений ``player.tscn``.
zh_hant: 點擊 **產生實體** 按鈕（由鏈條圖示表示）並選擇保存的 ``player.tscn`` 。

source: Now, add the following nodes as children of ``Main``, and name them as shown:
ga: Anois, cuir na nóid seo a leanas mar pháistí ``Main`, agus ainmnigh iad mar a thaispeántar:
it: Ora, aggiungi i seguenti nodi come figli di ``Main``, e rinominali come mostrato:
ta: இப்போது, பின்வரும் முனைகளை `` பிரதான`` குழந்தைகளாக சேர்த்து, காட்டப்பட்டுள்ளபடி பெயரிடுங்கள்:
tr: Şimdi, aşağıdaki düğümleri ``Main`` düğümünün alt ögeleri olarak ekleyin ve gösterildiği gibi adlandırın:
uk: Тепер додайте наступні вузли як дочірні вузли ``Main`` і назвіть їх, як показано:
zh_hant: 現在，將下列節點新增為 ``Main`` 的子節點，並依照所示命名：

source: :ref:`Timer <class_Timer>` (named ``MobTimer``) - to control how often mobs spawn
ga: :ref:`Timer <class_Timer>` (darb ainm ``MobTimer``) - chun rialú a dhéanamh ar cé chomh minic a sceitheann mobs
it: :ref:`Timer <class_Timer>` (chiamato ``MobTimer``) - per controllare la frequenza con cui i mob si generano
ta: :ref:`Timer <class_Timer>` (named ``MobTimer``) - பெறுநர் control how often mobs spawn
tr: :ref:`Timer <class_Timer>`, (``MobTimer`` isminde) - düşmanların ne sıklıkta ortaya çıkacağını denetleyecek
uk: :ref:`Timer <class_Timer>` (названий ``MobTimer``) - щоб контролювати, як часто виникають моби
zh_hant: :ref:`Timer <class_Timer>` （名稱為 ``MobTimer`` ）——用以控制怪物產生的頻率

source: :ref:`Timer <class_Timer>` (named ``ScoreTimer``) - to increment the score every second
ga: :ref:`Amadóir <class_Timer>` (ainmnithe ``ScoreTimer``) - chun an scór a mhéadú gach soicind
it: :ref:`Timer <class_Timer>` (chiamato ``ScoreTimer``) - per incrementare il punteggio ogni secondo
ta: :ref:`Timer <class_Timer>` (named ``ScoreTimer``) - பெறுநர் increment the கெலிப்பெண் every second
tr: :ref:`Timer <class_Timer>` (``ScoreTimer`` isminde) - her saniye puanı arttıracak
uk: :ref:`Timer <class_Timer>` (названий ``ScoreTimer``) - збільшуватиме рахунок щосекунди
zh_hant: :ref:`Timer <class_Timer>` （名稱為 ``ScoreTimer`` ）——用以每秒增加成績

source: :ref:`Timer <class_Timer>` (named ``StartTimer``) - to give a delay before starting
ga: :ref:`Timer <class_Timer>` (ainmnithe ``StartTimer``) - chun moill a chur roimh tosú
it: :ref:`Timer <class_Timer>` (chiamato ``StartTimer``) - per dare un ritardo prima di iniziare
ta: :ref:`Timer <class_Timer>` (named ``StartTimer``) - பெறுநர் give a சுணக்கம் before starting
tr: :ref:`Timer <class_Timer>` (``StartTimer`` isminde) - başlamadan önce kısa bir gecikme yapacak
uk: :ref:`Timer <class_Timer>` (названий ``StartTimer``) - щоб дати затримку перед запуском
zh_hant: :ref:`Timer <class_Timer>` （名稱為 ``StartTimer`` ）——用以在開始前延遲

source: :ref:`Marker2D <class_Marker2D>` (named ``StartPosition``) - to indicate the player's start position
ga: :ref:`Marker2D <class_Marker2D>` (ainmnithe ``StartPosition``) - chun suíomh tosaithe an imreora a chur in iúl
it: :ref:`Marker2D <class_Marker2D>` (denominato ``StartPosition``) - per indicare la posizione di partenza del giocatore
ta: :ref:`Marker2D <class_Marker2D>` (named ``StartPosition``) - பெறுநர் indicate the player's தொடங்கு position
tr: :ref:`Marker2D <class_Marker2D>` (``StartPosition`` olarak adlandırın) - oyuncunun başlangıç konumunu belirtmek için
uk: :ref:`Marker2D <class_Marker2D>` (названий ``StartPosition``) - для визначення стартової позиції гравця
zh_hant: :ref:`Marker2D <class_Marker2D>`（命名為 ``StartPosition``）—用來標示玩家的起始位置

source: Set the ``Wait Time`` property of each of the ``Timer`` nodes as follows (values are in seconds):
ga: Socraigh maoin ``Am Feith`` gach ceann de na nóid ``Timer`` mar seo a leanas (tá luachanna i soicindí):
it: Imposta la proprietà ``Wait Time`` di ciascuno dei nodi ``Timer`` come segue (i valori sono in secondi):
ta: ஒவ்வொரு `` டைமர்`` முனைகளின் `` காத்திருப்பு நேரம்` `சொத்தை பின்வருமாறு அமைக்கவும் (மதிப்புகள் நொடிகளில் உள்ளன):
tr: Her bir ``Timer`` düğümünün ``Wait Time`` özelliğini aşağıdaki gibi ayarlayın (değerler saniye cinsindendir):
uk: Встановіть властивість ``Час очікування`` кожного з вузлів ``Таймер`` наступним чином (значення в секундах):
zh_hant: 將每個 ``Timer`` 節點的 ``等待時間`` 屬性設定如下（數值單位為秒）：

source: In addition, set the ``One Shot`` property of ``StartTimer`` to "On" and set ``Position`` of the ``StartPosition`` node to ``(240, 450)``.
ga: Ina theannta sin, socraigh maoin ``One Shoot`` de `StartTimer`` go “On” agus socraigh ``Suíomh ``den nód ``StartPosition`` go`` (240, 450) ``.
it: Inoltre, imposta la proprietà ``One Shot`` di ``StartTimer`` su "On" e imposta la ``Position`` del nodo ``StartPosition`` su ``(240, 450)``.
ta: கூடுதலாக, `` ஒரு சாட்`` சொத்தை `` ச்டார்ட் டிமர்`` ஆன் "என்று அமைத்து,` `ச்டார்ட்ச்போசன்`` முனையின்` `(240, 450)` `` `` `நிலை`.
tr: Buna ek olarak, başlatma zamanlayıcısının, ``StartTimer``, ``One Shot`` (tek-seferlik) özelliğini "Açık" yapın, ve başlama konumu, ``StartPosition``, düğümünün konumu, ``Position``, özelliğini ``(240, 450)`` olarak ayarlayın.
uk: Крім того, встановіть властивість ``One Shot`` *(одна спроба)* в ``StartTimer`` на "включено" і задайте ``Position`` *(позиція)* в ``StartPosition`` на ``(240, 450)``.
zh_hant: 另外，將 ``StartTimer`` 的 ``One Shot`` 屬性設為「開啟」，並將 ``StartPosition`` 節點的 ``Position`` 設為 ``(240, 450)`` 。

source: Spawning mobs
ga: Mobáin sceitheadh
it: Generazione dei Mostri
ta: முட்டையிடும் கும்பல்கள்
tr: Düşmanların ortaya çıkması
uk: Поява мобів
zh_hant: 產生怪物

source: The Main node will be spawning new mobs, and we want them to appear at a random location on the edge of the screen. Click the ``Main`` node in the Scene dock, then add a child :ref:`Path2D <class_Path2D>` node named ``MobPath``. When you select ``Path2D``, you will see some new buttons at the top of the editor:
uk: Головний вузол породжуватиме нових мобів, і ми хочемо, щоб вони з'являлися у випадковому місці на краю екрана. Клацніть вузол ``Головний`` на панелі сцени, потім додайте дочірній вузол :ref:`Path2D <class_Path2D>` з назвою ``MobPath``. Коли ви виберете ``Path2D``, ви побачите кілька нових кнопок у верхній частині редактора:
zh_hant: Main 節點將會產生新的怪物，而我們希望它們在螢幕邊緣的隨機位置出現。於 Scene 面板點選 ``Main`` 節點，新增一個名為 ``MobPath`` 的子節點 :ref:`Path2D <class_Path2D>`。選取 ``Path2D`` 後，你會在編輯器上方看到一些新的按鈕：

source: Select the middle one ("Add Point") and draw the path by clicking to add the points at the corners shown. To have the points snap to the grid, make sure "Use Grid Snap" and "Use Smart Snap" are both selected. These options can be found to the left of the "Lock" button, appearing as a magnet next to some dots and intersecting lines, respectively.
ga: Roghnaigh an ceann lár (“Cuir Pointe”) agus tarraing an cosán trí chliceáil chun na pointí a chur leis ag na coirnéil a thaispeántar. Chun na pointí a chur ar an eangach, déan cinnte go roghnaítear “Úsáid Grid Snap” agus “Úsáid Smart Snap” araon. Is féidir na roghanna seo a fháil ar thaobh clé den chnaipe “Glas”, le feiceáil mar mhaighnéad in aice le roinnt poncanna agus línte crostghnaithe, faoi seach.
it: Seleziona quello centrale ("Add Point") e disegna il percorso cliccando per aggiungere i punti agli angoli mostrati. Per fare in modo che i punti si aggancino alla griglia, assicurati che "Usa la griglia magnetica" e "Usa lo scatto intelligente" siano entrambi selezionati. Queste opzioni si trovano a sinistra del pulsante "Blocca", apparendo come un magnete accanto ad alcuni punti e linee intersecanti, rispettivamente.
ta: நடுத்தர ஒன்றைத் தேர்ந்தெடுத்து ("புள்ளியைச் சேர்") மற்றும் காட்டப்பட்ட மூலைகளில் உள்ள புள்ளிகளைச் சேர்க்க சொடுக்கு செய்வதன் மூலம் பாதையை வரையவும். புள்ளிகள் கட்டத்திற்கு ச்னாப் செய்ய, "கிரிட் ச்னாப்பைப் பயன்படுத்துங்கள்" மற்றும் "அறிவுள்ள ச்னாப்பைப் பயன்படுத்துங்கள்" இரண்டும் தேர்ந்தெடுக்கப்பட்டுள்ளன என்பதை உறுதிப்படுத்தவும். இந்த விருப்பங்களை "பூட்டு" பொத்தானின் இடதுபுறத்தில் காணலாம், முறையே சில புள்ளிகள் மற்றும் குறுக்குவெட்டு வரிகளுக்கு அடுத்த காந்தமாக தோன்றும்.
tr: Ortadakini ("Nokta Ekle") seçin ve noktaları gösterilen köşelere eklemek için tıklayarak yolu çizin. Noktaların ızgaraya tutunmasını sağlamak için "Izgara Tutunmayı Kullan" ve "Akıllı Tutunmayı Kullan" seçeneklerinin her ikisinin de seçili olduğundan emin olun. Bu seçenekler, sırasıyla bazı noktaların ve kesişen çizgilerin yanında bir mıknatıs olarak görünen "Kilit" düğmesinin solunda bulunabilir.
uk: Виберіть середню ("Додати точку") та намалюйте шлях, клацнувши, щоб додати точки у вказаних кутах. Щоб точки прикріпилися до сітки (ґратки), переконайтеся, що опції "Використати до ґратки" та "Використати прив'язку", обидві включені. Ці опції можна знайти зліва від кнопки «Блокування», виглядає як магніт з кількома лініями, що перетинаються.
zh_hant: 選擇中間的按鈕 (「新增控制點」)，然後點擊顯示的轉角處來新增控制點並繪製路徑。若要將控制點吸附到網格上，請開啟「使用網格吸附」與「使用吸附」選項，這兩個選項在「鎖定」按鈕的左邊，顯示的圖示是一個磁鐵跟幾條相交的線。

source: Draw the path in *clockwise* order, or your mobs will spawn pointing *outwards* instead of *inwards*!
ga: Tarraing an cosán in ord *deiseal*, nó sceithfidh do chulóga ag díriú *amach* in ionad *isteach*!
it: Disegna il percorso in ordine *orario*, o i tuoi nemici verranno generati *verso l'esterno* invece che *verso l'interno*!
ta: *கடிகார திசையில் *வரிசையில் பாதையை வரையவும், அல்லது உங்கள் கும்பல் *உள்நோக்கி *க்கு பதிலாக *வெளிப்புறமாக *சுட்டிக்காட்டும்!
tr: Yolu saat yönü sırasında çizin, aksi takdirde düşmanlar *içeriye* değil *dışarıya* yönelmiş olarak ortaya çıkacaklardır!
uk: Малюйте доріжку *за годинниковою стрілкою* , інакше ваші моби будуть виникати спрямовані *назовні*, а не *всередину*!
zh_hant: 請確定以 **順時針** 方向繪製路徑，不然的話怪物會 **向外** 產生而不是 **向內** 產生！

source: After placing point ``4`` in the image, click the "Close Curve" button and your curve will be complete.
ga: Tar éis pointe ''4'' a chur san íomhá, cliceáil ar an gcnaipe "Dún Cuar" agus beidh do chuar críochnaithe.
it: Dopo aver posizionato il punto ``4`` nell'immagine, fare clic sul pulsante "Chiudi curva" e la curva sarà completa.
ta: படத்தில் `` 4`` ஐ வைத்த பிறகு, "மூடு வளைவு" பொத்தானைக் சொடுக்கு செய்து, உங்கள் வளைவு முழுமையானதாக இருக்கும்.
tr: Resimdeki ``4`` numaralı noktayı koyduğunuzda, "Eğriyi Kapat" tuşuna basın ve eğriyi tamamlayın.
uk: Після розміщення четвертої точки на зображенні натисніть кнопку "Закрити криву", і ваша крива буде завершена.
zh_hant: 在圖片內放置了點 ``4`` 以後，點擊「關閉曲線」按鈕，就可以完成繪製曲線。

source: Now that the path is defined, add a :ref:`PathFollow2D <class_PathFollow2D>` node as a child of ``MobPath`` and name it ``MobSpawnLocation``. This node will automatically rotate and follow the path as it moves, so we can use it to select a random position and direction along the path.
ga: Anois go bhfuil an cosán sainithe, cuir nód :ref:`PathFollow2D <class_PathFollow2D>> leis mar leanbh de ``MobPath`` agus ainmnigh ``MobSpawnLocation`` é. Rothlóidh an nód seo go huathoibríoch agus leanfaidh sé an cosán de réir mar a ghluaiseann sé, ionas gur féidir linn é a úsáid chun suíomh agus treo randamach a roghnú feadh an chosáin.
it: Ora che il percorso è definito, aggiungere un nodo :ref:'PathFollow2D <class_PathFollow2D>' come figlio di ''MobPath'' e denominarlo ''MobSpawnLocation''. Questo nodo ruoterà automaticamente e seguirà il percorso mentre si muove, quindi possiamo usarlo per selezionare una posizione e una direzione casuali lungo il percorso.
ta: இப்போது பாதை வரையறுக்கப்பட்டுள்ளதால், A: Ref: `pathfollow2d <class_pathfollow2d>` `` mobpath`` குழந்தையாக முனை மற்றும் அதற்கு `` mobspanlocation`` என்று பெயரிடுங்கள். இந்த முனை தானாகவே சுழற்றி பாதையை நகர்த்தும்போது பின்பற்றும், எனவே பாதையில் ஒரு சீரற்ற நிலை மற்றும் திசையைத் தேர்ந்தெடுக்க இதைப் பயன்படுத்தலாம்.
tr: Artık yol tanımlandığına göre, ``MobPath`` 'in alt-ögesi olarak bir 2B yol izleme, :ref:`PathFollow2D <class_PathFollow2D>`, düğümünü ekleyin ve ismini ``MobSpawnLocation`` (düşman çıkış konumu) olarak değiştirin. Bu düğüm, otomatik olarak dönecek ve hareket ederken yolu takip edecektir, bu yüzden bunu, yol üzerinde rastgele bir konum ve yön seçmek için kullanabiliriz.
uk: Тепер, коли шлях визначений, додайте вузол :ref:`PathFollow2D <class_PathFollow2D>` (слідувати за шляхом 2D) нащадком ``MobPath`` та назвіть його ``MobSpawnLocation``. Цей вузол автоматично обертатиметься та рухатиметься по шляху, тому ми можемо використовувати його для вибору випадкової позиції та напрямку вздовж шляху.
zh_hant: 現在路徑已經定義好了，接著我們新增一個 :ref:`PathFollow2D <class_PathFollow2D>` 節點作為 ``MobPath`` 的子節點，並將其命名為 ``MobSpawnLocation`` 。這個節點會在移動的時候自動旋轉並跟著路徑移動，所以我們可以用 MobPath 來在路徑上隨機選擇位置與方向。

source: Your scene should look like this:
ga: Ba chóir go mbeadh cuma mar seo ar do radharc:
it: La tua scena dovrebbe assomigliare a questa:
ta: உங்கள் காட்சி இப்படி இருக்க வேண்டும்:
tr: Sahneniz bunun gibi görünmelidir:
uk: Ваше сцена має виглядати так:
zh_hant: 現在場景看起來會這樣：

source: Main script
ga: Príomhscript
it: Script principale
ta: முதன்மை ச்கிரிப்ட்
tr: Ana betik
uk: Головний скрипт
zh_hant: Main（主要）腳本

source: Add a script to ``Main``. At the top of the script, we use ``@export var mob_scene: PackedScene`` to allow us to choose the Mob scene we want to instance.
ga: Cuir script le ''Main''. Ag barr na scripte, úsáidimid ''@export var mob_scene: PackedScene'' chun ligean dúinn an radharc Mob a theastaíonn uainn a roghnú.
it: Aggiungi uno script a `` Main``. In alto allo script, utilizziamo ``@export var mob_scene: PackedScene`` per permetterci di scegliere la scena Mob che vogliamo istanziare.
ta: `` MAIN`` இல் ஒரு ச்கிரிப்டைச் சேர்க்கவும். ச்கிரிப்ட்டின் மேற்புறத்தில், நாங்கள் உதாரணமாக விரும்பும் கும்பல் காட்சியைத் தேர்வுசெய்ய அனுமதிக்க `` `` ஏற்றுமதி var mob_scene: packedscene`` ஐப் பயன்படுத்துகிறோம்.
tr: ``Main`` için bir betik ekleyin. Betiğin üst kısmında, örneklemek istediğimiz "Mob" sahnesini seçmemizi sağlamak için ``@export var mob_scene: PackedScene`` kullanıyoruz.
uk: Додайте скрипт до вузла ``Main``. У верхній частині скрипту ми використовуємо ``@export var mob_scene: PackedScene``, щоб ми могли вибрати сцену ``Mob``, екземпляр якої ми хочемо створити.
zh_hant: 為 ``Main`` 新增一個腳本。在腳本的頂部，我們會用 ``export (PackedScene)`` 來選擇要實體化的 ``Mob`` 場景。

source: Click the ``Main`` node and you will see the ``Mob Scene`` property in the Inspector under "Main.gd".
ga: Cliceáil ar an nód ''Main'' agus feicfidh tú an mhaoin ''Radharc mob'' sa Chigire faoi "Main.gd".
it: Clicca sul nodo ``Main`` e vedrai la proprietà ``Mob Scene`` nell'Ispettore sotto "Main.gd".
ta: `` பிரதான`` முனையைக் சொடுக்கு செய்து, "Main.gd" இன் கீழ் இன்ச்பெக்டரில் `` கும்பல் காட்சி`` சொத்தை நீங்கள் காண்பீர்கள்.
tr: ``Main`` düğümüne tıklarsanız, Denetleyici'de "Main.gd" altında ``Mob Scene`` özelliğini göreceksiniz.
uk: Натисніть вузол ``Main``, і ви побачите властивість ``Mob Scene`` в інспекторі під "Main.gd".
zh_hant: 點擊 ``Main`` 節點，您會在 Inspector（屬性檢視器）中「Main.gd」下方看到 ``Mob Scene`` 屬性。

source: You can assign this property's value in two ways:
ga: Féadtar luach na maoine seo a shannadh ar dhá bhealach:
it: Puoi assegnare il valore di questa proprietà in due modi:
ta: இந்த சொத்தின் மதிப்பை நீங்கள் இரண்டு வழிகளில் ஒதுக்கலாம்:
tr: Bu özelliğin değerini iki şekilde atayabilirsiniz:
uk: Ви можете змінити значення цієї властивості двома шляхами:
zh_hant: 要為這個屬性賦值有兩個方法：

source: Drag ``mob.tscn`` from the "FileSystem" dock and drop it in the **Mob Scene** property.
ga: Tarraing ''mob.tscn'' ón duga "FileSystem" agus scaoil isteach sa mhaoin **Mob Scene** é.
it: Trascina ``mob.tscn`` dal pannello "FileSystem" e rilascialo nella proprietà **Mob Scene**.
ta: "கோப்பு முறைமை" கப்பல்துறையிலிருந்து `` mob.tscn`` ஐ இழுத்து ** கும்பல் காட்சி ** சொத்தில் விடுங்கள்.
tr: "DosyaSistemi" yuvasından ``mob.tscn`` dosyasını sürükleyin ve **Mob Scene** özelliğinin içine bırakın.
uk: Перетягнути ``mob.tscn`` з панелі "Файлова система" у властивість ``Mob Scene``.
zh_hant: 從「檔案系統」面板中拖移 ``Mob.tscn`` 到 ``Mob`` 屬性來。

source: Click the down arrow next to "[empty]" and choose "Load". Select ``mob.tscn``.
ga: Cliceáil ar an arrow síos in aice le "[folamh]" agus roghnaigh "Luchtaigh". Roghnaigh ''mob.tscn''.
it: Clicca la freccia in giù accanto a "[empty]" e scegli "Carica". Seleziona ``mob.tscn``.
ta: "[வெற்று]" க்கு அடுத்த கீழ் அம்புக்குறியைக் சொடுக்கு செய்து "சுமை" என்பதைத் தேர்வுசெய்க. `` Mob.tscn`` என்பதைத் தேர்ந்தெடுக்கவும்.
tr: "[boş]" ögesinin yanındaki aşağı oka tıklayın ve "Yükle" ögesini seçin. ``mob.tscn`` dosyasını seçin.
uk: Клацнути стрілочку вниз поряд з "[empty]"(пусто) і вибрати "Load" (Завантажити). Виберіть ``mob.tscn``.
zh_hant: 點擊「[空]」旁邊的下拉箭頭，並選擇「載入」。接著選擇 ``Mob.tscn`` 。

source: Next, select the instance of the ``Player`` scene under ``Main`` node in the Scene dock, and access the Node dock on the sidebar. Make sure to have the Signals tab selected in the Node dock.
ga: Ansin, roghnaigh sampla an radhairc ''Player'' faoi nód ''Main'' i nduga an Radhairc, agus téigh chuig duga na Nód ar an mbarra taoibh. Déan cinnte go bhfuil an cluaisín Signals roghnaithe sa duga Node.
it: Successivamente, nel pannello Scene, seleziona l'istanza della scena ``Player`` sotto il nodo ``Main`` e accedi al pannello Nodo sulla barra laterale. Assicurati di avere la scheda Segnali selezionata nel pannello Nodo.
ta: அடுத்து, காட்சி கப்பல்துறையில் `` பிரதான`` முனையின் கீழ் `` பிளேயர்`` காட்சியின் நிகழ்வைத் தேர்ந்தெடுத்து, பக்கப்பட்டியில் முனை கப்பல்துறையை அணுகவும். முனை கப்பல்துறையில் சிக்னல்கள் தாவல் தேர்ந்தெடுக்கப்பட்டிருப்பதை உறுதிசெய்க.
tr: Sonra, Sahne yuvasında ``Main`` düğümü altındaki ``Player`` sahnesinin örneğini seçin ve diğer yandaki Düğüm yuvasına erişin. Düğüm yuvasında Sinyaller sekmesinin seçili olduğundan emin olun.
uk: Далі виберіть вузол ``Player`` на вузлі ``Main`` на панелі Сцена і відкрийте панель Вузла збоку. Переконайтесь, що на панелі Вузла вибрано Сигнали.
zh_hant: 接著，從場景 Dock 中選擇 ``Player`` 節點，然後前往側欄的節點 Dock 中。節選選擇節點 Dock 中的 [訊號] 分頁。
