Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/05.the_main_game_scene.po
Languages: ga, it, ta, tr, uk, zh_hant

source: You should see a list of the signals for the ``Player`` node. Find and double-click the ``hit`` signal in the list (or right-click it and select "Connect..."). This will open the signal connection dialog. We want to make a new function named ``game_over``, which will handle what needs to happen when a game ends. Type "game_over" in the "Receiver Method" box at the bottom of the signal connection dialog and click "Connect". You are aiming to have the ``hit`` signal emitted from ``Player`` and handled in the ``Main`` script. Add the following code to the new function, as well as a ``new_game`` function that will set everything up for a new game:
ga: Ba chóir duit liosta de na comharthaí don nód ''Player'' a fheiceáil. Aimsigh agus cliceáil faoi dhó ar an gcomhartha ''hit'' sa liosta (nó deaschliceáil air agus roghnaigh "Ceangail..."). Osclóidh sé seo an dialóg nasc comhartha. Ba mhaith linn feidhm nua a dhéanamh darb ainm ''game_over'', a láimhseálfaidh cad is gá a tharlóidh nuair a thiocfaidh deireadh le cluiche. Clóscríobh "game_over" sa bhosca "Modh Glacadóra" ag bun na dialóige nasc comhartha agus cliceáil "Ceangail". Tá sé mar aidhm agat an comhartha ''hit'' a astú ó ''Player'' agus a láimhseáil sa script ''Main''. Cuir an cód seo a leanas leis an bhfeidhm nua, chomh maith le feidhm ''new_game'' a chuirfidh gach rud ar bun le haghaidh cluiche nua:
it: Dovresti vedere una lista dei segnali per il nodo ``Player``. Trova e clicca due volte sul segnale ``hit`` dalla lista (o fai clic destro e seleziona "Connetti..."). In questo modo si aprirà la finestra di dialogo per connettere il segnale. Vogliamo creare una nuova funzione chiamata ``game_over``, che gestirà ciò che deve accadere quando un gioco finisce. Digita "game_over nel campo "Metodo ricevitore" in fondo alla finestra di dialogo e clicca su "Connetti". Il tuo obiettivo è che il segnale ``hit`` venga emesso da ``Player`` e gestito nello script ``Main``. Aggiungi il seguente codice alla nuova funzione, così come una funzione ``new_game`` che preparerà tutto per una nuova partita:
ta: `` பிளேயர்`` முனைக்கான சமிக்ஞைகளின் பட்டியலை நீங்கள் காண வேண்டும். பட்டியலில் உள்ள `` இட்`` சமிக்ஞையை கண்டுபிடித்து இருமுறை சொடுக்கு செய்யவும் (அல்லது அதை வலது சொடுக்கு செய்து "இணைக்கவும் ..." என்பதைத் தேர்ந்தெடுக்கவும்). இது சமிக்ஞை இணைப்பு உரையாடலைத் திறக்கும். `` கேம்_ஓவர்` என்ற புதிய செயல்பாட்டை நாங்கள் உருவாக்க விரும்புகிறோம், இது ஒரு விளையாட்டு முடிவடையும் போது என்ன நடக்க வேண்டும் என்பதைக் கையாளும். சமிக்ஞை இணைப்பு உரையாடலின் கீழே உள்ள "ரிசீவர் முறை" பெட்டியில் "கேம்_ஓவர்" என தட்டச்சு செய்து "இணைக்கவும்" என்பதைக் சொடுக்கு செய்யவும். `` பிளேயர்`` `` பிளேயர்`` யிலிருந்து வெளியேற்றப்பட்டு `` பிரதான`` ச்கிரிப்ட்டில் கையாளப்படுவதை நீங்கள் நோக்கமாகக் கொண்டுள்ளீர்கள். புதிய செயல்பாட்டிற்கு பின்வரும் குறியீட்டைச் சேர்க்கவும், அதே போல் ஒரு புதிய விளையாட்டுக்காக எல்லாவற்றையும் அமைக்கும் `` புதிய_கேம்`` செயல்பாடு:
tr: ``Player`` düğümü için sinyallerin bir listesini görmelisiniz. Listede ``hit`` sinyalini bulun ve çift tıklayın (ya da sağ tıklayın ve "Bağlan..." seçeneğini seçin). Bu, sinyal bağlantısı iletişim kutusunu açacaktır. Bir oyun sona erdiğinde ne olması gerektiğini işleyecek ``game_over`` (oyun bitti) adında yeni bir fonksiyon yapmak istiyoruz. Sinyal bağlantı iletişim kutusunun altındaki "Alıcı Yöntem" kutusuna "game_over" yazın ve "Bağlan "a tıklayın. Amacınız ``hit`` sinyalinin ``Player`` dan yayılması ve ``Main`` betiğinde işlenmesidir. Aşağıdaki bu yeni fonksiyonun kodunu, ve altındaki yeni bir oyun için her şeyi ayarlayacak olan ``new_game`` fonksiyonunun kodunu ekleyin:
uk: Ви повинні побачити список сигналів для вузла ``Гравець``. Знайдіть і двічі клацніть сигнал ``hit`` у списку (або клацніть його правою кнопкою миші та виберіть «Підключити...»). Відкриється діалогове вікно підключення сигналу. Ми хочемо створити нову функцію під назвою ``game_over``, яка оброблятиме те, що має статися після закінчення гри. Введіть «game_over» у полі «Метод приймача» внизу діалогового вікна підключення сигналу та натисніть «Підключити». Ви прагнете, щоб сигнал ``хіт`` надсилався з ``Player`` і оброблявся в ``Main`` сценарії. Додайте наступний код до нової функції, а також функцію ``new_game``, яка налаштує все для нової гри:
zh_hant: 接著應該可以看到所有 ``Player`` 節點的訊號。點兩下列表中的 ``hit`` 訊號 (或是右鍵點擊然後選擇 [連接...])。這樣便可以打開訊號連接對話框。這裡我們要把新函式命名為 ``game_over`` ，這個函式會負責處理遊戲結束時要做的事。在 [連接訊號] 視窗中的 [Receiver 方法] 內輸入「game_over」，並點擊 [連接]。將下列程式碼加到新建立的函式當中，接著新增一個 ``new_game`` 函式，負責在遊戲開始時搞定一切：

source: Now we'll connect the ``timeout()`` signal of each Timer node (``StartTimer``, ``ScoreTimer``, and ``MobTimer``) to the main script. For each of the three timers, select the timer in the Scene dock, open the Signals tab of the Node dock, then double-click the ``timeout()`` signal in the list. This will open a new signal connection dialog. The default settings in this dialog should be fine, so select **Connect** to create a new signal connection.
uk: Тепер ми підключимо сигнал ``timeout()`` кожного вузла Таймера (``StartTimer``, ``ScoreTimer`` та ``MobTimer``) до основного скрипта. Для кожного з трьох таймерів виберіть таймер на панелі Сцена, відкрийте вкладку Сигнали на панелі Вузлів, потім двічі клацніть сигнал ``timeout()`` у списку. Це відкриє діалогове вікно підключення нового сигналу. Налаштування за замовчуванням у цьому діалоговому вікні мають бути влаштовними, тому виберіть **Підключити**, щоб створити нове підключення сигналу.
zh_hant: 接著我們要把每個 Timer 節點（``StartTimer``、``ScoreTimer``、``MobTimer``）的 ``timeout()`` 訊號連到主腳本。對每個計時器，在 Scene 面板選中後，打開右側 Node 面板的 Signals 分頁，接著在清單中按兩下 ``timeout()`` 訊號。會開啟新的訊號連線對話框，使用預設設定即可，點選 **Connect** 建立連線。

source: Once all three timers have this set up, you should be able to see each timer have a Signal connection for their respective ``timeout()`` signal, showing in green, within their respective Signals tabs:
uk: Після того, як усі три таймери налаштовано, ви зможете побачити, що кожен таймер має підключення Signal для відповідного сигналу ``timeout()``, що відображається зеленим кольором, у відповідних вкладках Signals:
zh_hant: 三個計時器都設定完成後，你應該能在各自的 Signals 分頁中看到其 ``timeout()`` 訊號已顯示為綠色並完成連線：

source: (For MobTimer): ``_on_mob_timer_timeout()``
uk: (Для MobTimer): ``_on_mob_timer_timeout()``
zh_hant: （MobTimer）：``_on_mob_timer_timeout()``

source: (For ScoreTimer): ``_on_score_timer_timeout()``
uk: (Для ScoreTimer): ``_on_score_timer_timeout()``
zh_hant: （ScoreTimer）：``_on_score_timer_timeout()``

source: (For StartTimer): ``_on_start_timer_timeout()``
uk: (Для StartTimer): ``_on_start_timer_timeout()``
zh_hant: （StartTimer）：``_on_start_timer_timeout()``

source: Now we define how each of these timers operate by adding the code below. Notice that ``StartTimer`` will start the other two timers, and that ``ScoreTimer`` will increment the score by 1.
uk: Тепер ми визначимо, як працює кожен із цих таймерів, додавши наведений нижче код. Зверніть увагу, що ``StartTimer`` запустить два інших таймери, а ``ScoreTimer`` збільшить рахунок на 1.
zh_hant: 現在我們以以下程式碼定義各計時器的行為。請注意，``StartTimer`` 會啟動另外兩個計時器，而 ``ScoreTimer`` 會將分數加 1。

source: In ``_on_mob_timer_timeout()``, we will create a mob instance, pick a random starting location along the ``Path2D``, and set the mob in motion. The ``PathFollow2D`` node will automatically rotate as it follows the path, so we will use that to select the mob's direction as well as its position. When we spawn a mob, we'll pick a random value between ``150.0`` and ``250.0`` for how fast each mob will move (it would be boring if they were all moving at the same speed).
ga: In ''_on_mob_timer_timeout()'', cruthóimid ásc mob, piocfaimid suíomh tosaigh randamach ar feadh an ''Path2D'', agus cuirfimid an mob ag gluaiseacht. Rothlóidh an nód ''PathFollow2D'' go huathoibríoch de réir mar a leanann sé an cosán, mar sin úsáidfimid é sin chun treo an mhóib a roghnú chomh maith lena shuíomh. Nuair a sceitheann muid mob, piocfaimid luach randamach idir ''150.0'' agus ''250.0'' maidir le cé chomh tapa agus a bhogfaidh gach mob (bheadh sé leadránach dá mbogfadh siad ar fad ar an luas céanna).
it: In ``_on_MobTimer_timeout()``, creeremo un'istanza di mob, sceglieremo una posizione di partenza casuale lungo il ``Path2D``, e metteremo in movimento il mob. Il nodo ``PathFollow2D`` ruoterà automaticamente mentre segue il percorso, quindi lo useremo per selezionare la direzione e la posizione del mob. Quando generiamo un mob, sceglieremo un valore casuale tra ``150.0`` e ``250.0`` per la velocità con cui ogni mob si muoverà (sarebbe noioso se si muovessero tutti alla stessa velocità).
ta: `` _ON_MOB_TIMER_TIMEOUT () `` இல், நாங்கள் ஒரு கும்பல் நிகழ்வை உருவாக்குவோம், `` path2d`` உடன் ஒரு சீரற்ற தொடக்க இடத்தைத் தேர்ந்தெடுத்து, கும்பலை இயக்கத்தில் அமைப்போம். `` Pathfollow2d``` முனை அது பாதையைப் பின்பற்றும்போது தானாகவே சுழலும், எனவே கும்பலின் திசையையும் அதன் நிலையையும் தேர்ந்தெடுக்க அதைப் பயன்படுத்துவோம். நாங்கள் ஒரு கும்பலை உருவாக்கும்போது, ஒவ்வொரு கும்பலும் எவ்வளவு விரைவாக நகரும் என்பதற்காக `` 150.0`` மற்றும் `250.0`` இடையே ஒரு சீரற்ற மதிப்பைத் தேர்ந்தெடுப்போம் (அவை அனைத்தும் ஒரே வேகத்தில் நகர்ந்தால் அது சலிப்பை ஏற்படுத்தும்).
tr: ``_on_mob_timer_timeout()`` fonksiyonunda, bir düşman örneği oluşturacak, ``Path2D`` boyunca rastgele bir başlangıç konumu seçecek ve düşmanı harekete geçireceğiz. ``PathFollow2D`` düğümü yolu takip ederken otomatik olarak dönecektir, bu nedenle düşmanın yönünü ve konumunu seçmek için bunu kullanacağız. Bir düşman oluşturduğumuzda, her birinin ne kadar hızlı hareket edeceğini belirlemek için ``150.0`` ile ``250.0`` arasında rastgele bir değer seçeceğiz (hepsi aynı hızda hareket etseydi sıkıcı olurdu).
uk: У функції ``_on_mob_timer_timeout()`` ми створимо екземпляр моба, підберемо випадкове початкове місце уздовж ``Path2D`` та приведемо моба у рух. Вузол ``PathFollow2D`` буде автоматично обертатися по мірі просування по шляху, так що ми будемо використовувати його, щоб вибрати напрямок моба, а також його позицію. Під час появи моба, ми вибираємо випадкове значення між ``150.0`` і ``250.0`` визначаючи швидкість руху (було б нудно, якби всі вони рухалися з однаковою швидкістю).
zh_hant: 接著我們在 ``_on_MobTimer_timeout()`` 中建立怪物的實體，並沿著 ``Path2D`` 來隨機選擇一個起始位置，然後讓怪物開始移動。在跟隨路徑時 ``PathFollow2D`` 節點會自動旋轉，所以我們在使用這個節點來選擇怪物的位置的同時也會一起選擇方向。

source: Note that a new instance must be added to the scene using ``add_child()``.
ga: Tabhair faoi deara go gcaithfear cás nua a chur leis an radharc le ''add_child()''.
it: Nota che una nuova istanza deve essere aggiunta alla scena usando ``add_child()``.
ta: `` Add_child () `` ஐப் பயன்படுத்தி ஒரு புதிய நிகழ்வு காட்சியில் சேர்க்கப்பட வேண்டும் என்பதை நினைவில் கொள்க.
tr: Dikkat edin, sahneye yeni bir örnekleme eklemek için ``add_child()`` (alt-öge ekle) kullanmak gerekiyor.
uk: Зауважте, що новий екземпляр потрібно додати до сцени за допомогою ``add_child()``.
zh_hant: 需要注意的是，新建立的節點必須要使用 ``add_child()`` 來將節點新增到場景中。

source: Why ``PI``? In functions requiring angles, Godot uses *radians*, not degrees. Pi represents a half turn in radians, about ``3.1415`` (there is also ``TAU`` which is equal to ``2 * PI``). If you're more comfortable working with degrees, you'll need to use the ``deg_to_rad()`` and ``rad_to_deg()`` functions to convert between the two.
ga: Cén fáth ''PI''? I bhfeidhmeanna a éilíonn uillinneacha, úsáideann Godot *radians *, ní céimeanna. Is ionann Pi agus casadh go leith i radians, thart ar ''3.1415'' (tá ''TAU'' ann freisin atá comhionann le ''2 * PI''). Má tá tú níos compordaí ag obair le céimeanna, beidh ort na feidhmeanna ''deg_to_rad()'' agus ''rad_to_deg()'' a úsáid chun tiontú idir an dá cheann.
it: Perché ``PI``? Nelle funzioni che richiedono angoli, GDScript utilizza i *radianti*, non i gradi. Pi rappresenta un mezzo giro in radianti, circa ``3,1415`` (esiste anche ``TAU`` che è uguale a ``2 * PI``). Se sei più familiare con i gradi, avrai bisogno di usare le funzioni ``deg_to_rad()`` e ``rad_to_deg()`` per convertire tra i due.
ta: ஏன் `` பை``? கோணங்கள் தேவைப்படும் செயல்பாடுகளில், கோடோட் *ரேடியன்களைப் பயன்படுத்துகிறார், டிகிரி அல்ல. சுமார் `` 3.1415`` (`` த au`` என்பதற்கு சமமான `` 2 * பை``). டிகிரிகளுடன் பணிபுரிவதற்கு நீங்கள் மிகவும் வசதியாக இருந்தால், நீங்கள் `` deg_to_rad () `` மற்றும் `` rad_to_deg () `` இரண்டிற்கும் இடையில் மாற்றுவதற்கு செயல்பாடுகளைப் பயன்படுத்த வேண்டும்.
tr: Neden ``PI``? Açı gerektiren fonksiyonlarda Godot derece değil *radyan* kullanır. Pi, radyan cinsinden yarım tur dönüşü temsil eder, değeri yaklaşık ``3.1415`` tir (ayrıca ``2 * PI`` ye eşit olan ``TAU`` da vardır). Eğer derece ile daha rahat çalışıyorsanız, ikisi arasında dönüşüm yapmak için ``deg_to_rad()`` ve ``rad_to_deg()`` fonksiyonlarını kullanmanız gerekecektir.
uk: Чому ``PI``? У функціях, що вимагають кутів, Godot використовує *радіани* , а не градуси. Пі являє собою половину повороту в радіанах, близько ``3.1415`` (є також ``TAU``, що дорівнює ``2 * PI``). Якщо вам зручніше працювати з градусами, вам потрібно буде скористатися функціями ``deg_to_rad()`` та ``rad_to_deg()`` для перетворення між ними.
zh_hant: 為什麼要使用 ``PI`` （圓周率）呢？在需要角度的函式中，GDScript 會使用 **弧度** 而不是角度。如果你比較喜歡用角度的話，則需要使用 ``deg2rad()`` （角度轉弧度）與 ``rad2deg()`` （弧度轉角度）兩個函式來轉換弧度與角度。

source: Testing the scene
ga: An radharc a thástáil
it: Testare la scena
ta: காட்சியை சோதித்தல்
tr: Sahneyi test etmek
uk: Тестування сцени
zh_hant: 測試場景

source: Let's test the scene to make sure everything is working. Add this ``new_game`` call to ``_ready()``:
ga: Déanaimis tástáil ar an radharc chun a chinntiú go bhfuil gach rud ag obair. Cuir an glao ''new_game'' seo le ''_ready()'':
it: Andiamo a provare la scena per assicurarci che tutto funzioni. Aggiungi questa chiamata a ``new_game`` a ``_ready()``:
ta: எல்லாம் செயல்படுகிறதா என்பதை உறுதிப்படுத்த காட்சியை சோதிப்போம். இந்த `` புதிய_கேம்`` அழைப்பை `` _ ரெடி () ``:
tr: Herşeyin çalıştığından emin olmak için sahneyi test edelim. Aşağıdaki ``new_game`` çağrısını ``_ready()`` içine ekleyin:
uk: Давайте протестуємо сцену, щоб переконати, що все працює. Додайте ``new_game`` до ``_ready()``:
zh_hant: 來測試一下場景，看看是不是所有東西都正常了。將下面這段程式碼新增至 ``_ready()`` 中：

source: Let's also assign ``Main`` as our "Main Scene" - the one that runs automatically when the game launches. Press the "Play" button and select ``main.tscn`` when prompted.
ga: Déanaimis ''Main'' a shannadh freisin mar ár "Príomh-Radharc" - an ceann a ritheann go huathoibríoch nuair a sheolann an cluiche. Brúigh an cnaipe "Seinn" agus roghnaigh ''main.tscn'' nuair a spreagtar é.
it: Assegniamo anche ``Main`` come nostra "Scena principale" - quella che viene eseguita automaticamente all'avvio del gioco. Premi il pulsante "Play" e seleziona ``Main.tscn`` quando richiesto.
ta: `` மெயின்`` எங்கள் "முதன்மையான காட்சியாக" ஒதுக்குவோம் - விளையாட்டு தொடங்கும்போது தானாகவே இயங்கும். "ப்ளே" பொத்தானை அழுத்தி, கேட்கும்போது `` main.tscn`` என்பதைத் தேர்ந்தெடுக்கவும்.
tr: Ayrıca ``Main`` i "Ana Sahne" olarak atayalım - oyun başlatıldığında otomatik olarak çalışan sahne. "Oynat" düğmesine basın ve istendiğinde ``main.tscn`` dosyasını seçin.
uk: Також визначимо ``Main``, як нашу "Головну Сцену" - вона буде запускатися автоматично при кожному запуску гри. Натисніть кнопку "Відтворити" і виберіть ``main.tscn`` при появі запиту.
zh_hant: 同時，將 ``Main`` 設為「主要場景」——也就是遊戲啟動後會自動執行的場景。點擊「執行」按鈕，當提示框出現後選擇 ``Main.tscn`` 。

source: If you had already set another scene as the "Main Scene", you can right click ``main.tscn`` in the FileSystem dock and select "Set As Main Scene".
ga: Má bhí radharc eile socraithe agat cheana féin mar an "Príomh-Radharc", is féidir leat cliceáil ar dheis ar ''main.tscn'' i nduga an Chórais Comhad agus roghnaigh "Set As Main Scene".
it: Se hai già impostato un'altra scena come "Scena principale", puoi cliccare con il pulsante destro su ``main.tscn`` nel pannello FileSystem e selezionare "Rendi scena principale".
ta: நீங்கள் ஏற்கனவே மற்றொரு காட்சியை "முதன்மையான காட்சி" என்று அமைத்திருந்தால், கோப்பு முறைமை கப்பல்துறையில் `` main.tscn`` ஐ வலது சொடுக்கு செய்து "முதன்மையான காட்சியாக அமைக்க" என்பதைத் தேர்ந்தெடுக்கலாம்.
tr: Başka bir sahneyi "Ana Sahne" olarak ayarladıysanız, DosyaSistemi yuvasında ``main.tscn`` dosyasına sağ tıklayıp "Ana Sahne Olarak Ayarla"yı seçebilirsiniz.
uk: Якщо ви вже встановили іншу сцену як "Головну сцену", ви можете клацнути правою кнопкою мишки по ``main.tscn`` на панелі Файлова система і вибрати "Встановити головною сценою".
zh_hant: 如果你已經將別的場景設定為“主場景”了，你可以在“檔案系統”面板上右鍵點擊 ``main.tscn`` 並選擇“設為主場景”。

source: You should be able to move the player around, see mobs spawning, and see the player disappear when hit by a mob.
ga: Ba chóir go mbeifeá in ann an t-imreoir a bhogadh timpeall, mobs a fheiceáil ag sceitheadh, agus an t-imreoir a fheiceáil ag imeacht nuair a bhuaileann mob é.
it: Dovresti essere in grado di muovere il giocatore, vedere i nemici che vengono generati e vedere il giocatore scomparire quando viene colpito da uno di essi.
ta: நீங்கள் வீரரை நகர்த்தவும், கும்பல் முட்டையிடுவதைப் பார்க்கவும், ஒரு கும்பலால் தாக்கும்போது வீரர் மறைந்து போவதைப் பார்க்கவும் முடியும்.
tr: Bu noktada, oyuncuyu hareket ettirebiliyor, düşmanların ortaya çıkmasını görebiliyor, ve bir düşman çarpınca oyuncunun kaybolduğunu görüyor olmanız gerek.
uk: Ви мали би успішно переміщати повсюди гравця, спостерігати, як народжуються моби, і бачити, як зникає гравець при зіткненні з мобом.
zh_hant: 現在應該可以到處移動玩家了，並會看到怪物產生出來。玩家在被怪物撞到後會消失。

source: When you're sure everything is working, remove the call to ``new_game()`` from ``_ready()`` and replace it with ``pass``.
ga: Nuair atá tú cinnte go bhfuil gach rud ag obair, bain an glao ar ''new_game()'' ó ''_ready()'' agus cuir ''pass' ina áit.
it: Quando sei sicuro che tutto funzioni, rimuovi la chiamata a ``new_game()`` da ``_ready()`` e sostituiscila con ``pass``.
ta: எல்லாம் செயல்படுகிறது என்று நீங்கள் உறுதியாக நம்பும்போது, `` `_ ஆயத்தம் ()` `இலிருந்து` `புதிய_கேம் ()` `` `` `பாச்`` என்ற அழைப்பை அகற்றவும்.
tr: Her şeyin çalıştığından emin olduğunuzda, ``_ready()`` fonksiyonundaki ``new_game()`` çağrısını kaldırın ve ``pass`` ile değiştirin.
uk: Переконавшись, що все працює вилучає виклик ``new_game()`` з ``_ready()`` і замініть його на ``pass``.
zh_hant: 當您確定一切運作正常後，請從 ``_ready()`` 中移除呼叫 ``new_game()`` 的程式碼，並將其替換為 ``pass`` 。

source: What's our game lacking? Some user interface. In the next lesson, we'll add a title screen and display the player's score.
ga: Cad atá in easnamh ar ár gcluiche? Roinnt comhéadan úsáideora. Sa chéad cheacht eile, cuirfimid scáileán teidil leis agus taispeánfaimid scór an imreora.
it: Cosa manca al nostro gioco? Un'interfaccia utente. Nella prossima lezione aggiungeremo una schermata del titolo e visualizzeremo il punteggio del giocatore.
ta: எங்கள் விளையாட்டு இல்லாதது என்ன? சில பயனர் இடைமுகம். அடுத்த பாடத்தில், நாங்கள் ஒரு தலைப்புத் திரையைச் சேர்த்து பிளேயரின் மதிப்பெண்ணைக் காண்பிப்போம்.
tr: Oyunumuzda eksik olan ne? Kullanıcı için bir arayüz. Sıradaki derste, bir başlık ekranı ekleyecek ve oyuncunun puanını görüntüleyeceğiz.
uk: Чого не вистачає нашій грі? Деякого інтерфейсу. На наступному уроці ми додамо титульний екран і відображення рахунку гравця.
zh_hant: 我們的遊戲還缺點啥？缺使用者介面。在下一課中，我們將會新增標題介面並且顯示玩家的分數。

source: ``MobTimer``: ``0.5``
ta: `` மொப்டிமர்``: `` 0.5``

source: ``ScoreTimer``: ``1``
ga: ``Scortimer``: ``1``
ta: `` ச்கோரிங் டைமர்`: `` 1`

source: ``StartTimer``: ``2``
ga: ``Timer tosaithe``: ``2``
ta: `` ச்டார்ட் டிமர்``: `` 2``

source: The Main node will be spawning new mobs, and we want them to appear at a random location on the edge of the screen. Add a :ref:`Path2D <class_Path2D>` node named ``MobPath`` as a child of ``Main``. When you select ``Path2D``, you will see some new buttons at the top of the editor:
ta: முக்கிய முனை புதிய கும்பல்களைத் தூண்டிவிடும், மேலும் அவை திரையின் விளிம்பில் ஒரு சீரற்ற இடத்தில் தோன்ற வேண்டும் என்று நாங்கள் விரும்புகிறோம். A: ref: `path2d <class_path2d>` `Mobpath`` என்ற குழந்தையாக` `Main`` என்ற பெயரைச் சேர்க்கவும். நீங்கள் `` path2d`` என்பதைத் தேர்ந்தெடுக்கும்போது, எடிட்டரின் மேற்புறத்தில் சில புதிய பொத்தான்களைக் காண்பீர்கள்:
tr: Ana düğüm yeni düşmanlar ortaya çıkarma işini yapacak, ve bunların ekranın kenarlarında rastgele belirmesini istiyoruz. ``Main`` 'in bir alt-ögesi olarak bir 2B yol, :ref:`Path2D <class_Path2D>`, düğümü ekleyin ve ismini ``MobPath`` (düşman yolu) olarak değiştirin. Bu ``Path2D`` düğümünü seçtiğinizde, düzenleyicinin üst kısmında yeni düğmelerin ortaya çıktığını göreceksiniz:

source: Now connect the ``timeout()`` signal of each of the Timer nodes (``StartTimer``, ``ScoreTimer``, and ``MobTimer``) to the main script. ``StartTimer`` will start the other two timers. ``ScoreTimer`` will increment the score by 1.
ta: இப்போது ஒவ்வொரு நேரங்குறிகருவி முனைகளின் (`` ச்டார்ட் டைமர்``, `` ச்கோரெடிமர்``, மற்றும் `` மொப்டிமர்``) முதன்மையான ச்கிரிப்டுடன் `` காலக்கெடு () `` சமிக்ஞையை இணைக்கவும். `` ச்டார்டிமர்`` மற்ற இரண்டு டைமர்களையும் தொடங்கும். `` ச்கோரெடிமர்`` மதிப்பெண்ணை 1 அதிகரிக்கும்.
tr: Şimdi tüm Timer düğümlerinin (``StartTimer``, ``ScoreTimer`` ve ``MobTimer``) her birinin ``timeout()`` sinyalini ana betiğe bağlayın. ``StartTimer`` diğer iki zamanlayıcıyı başlatacaktır. ``ScoreTimer`` puanı 1 artıracaktır.
