Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/06.heads_up_display.po
Languages: cs, fr, ga, it, ta, tr, zh_hant

source: We can then add the following line to the ``new_game()`` function in ``Main``:
cs: Poté můžeme do funkce ``new_game()`` v ``Main`` přidat následující řádek:
fr: Nous pouvons ensuite ajouter la ligne suivante à la fonction ``new_game()`` dans ``Main`` :
it: Possiamo quindi aggiungere la seguente riga alla funzione ``new_game()`` in ``Main``:
ta: `` புதிய_கேம் () `செயல்பாட்டில்` `பிரதான`` இல் பின்வரும் வரியை நாம் சேர்க்கலாம்:
zh_hant: 然後我們可以在 ``Main`` 腳本的 ``new_game()`` 函式中加入以下這行：

source: The ``call_group()`` function calls the named function on every node in a group - in this case we are telling every mob to delete itself.
cs: Funkce ``call_group()`` ("zavolat skupinu") zavolá pojmenovanou funkci na každém uzlu ve skupině - v tomto případě říkáme každému nepříteli, aby se sám odstranil.
fr: La fonction ``call_group()`` appelle la fonction nommée sur chaque nœud d'un groupe - dans ce cas nous disons à chaque mob de s'effacer eux-même.
ga: Tugann an fheidhm ''call_group()'' an fheidhm ainmnithe ar gach nód i ngrúpa - sa chás seo táimid ag rá le gach mob é féin a scriosadh.
it: La funzione ``call_group()`` chiama la funzione cosi denominata su ogni nodo di un gruppo - cosi facendo diciamo a ogni mob di cancellarsi.
ta: `` Call_Group () `` செயல்பாடு ஒரு குழுவில் உள்ள ஒவ்வொரு முனையிலும் பெயரிடப்பட்ட செயல்பாட்டை அழைக்கிறது - இந்த விசயத்தில் ஒவ்வொரு கும்பலையும் தன்னை நீக்கச் சொல்கிறோம்.
tr: ``call_group()`` fonksiyonu, ismi verilen fonksiyonu gruptaki tüm düğümlerde çalıştırır - bu durumda bütün düşmanlara kendilerini silmelerini söylüyoruz.
zh_hant: ``call_group()`` 函式會呼叫群組中所有節點的指定名稱的函式——在這裡我們用來讓所有怪物刪除自己。

source: The game's mostly done at this point. In the next and last part, we'll polish it a bit by adding a background, looping music, and some keyboard shortcuts.
cs: V tuto chvíli je hra z většiny hotová. V dalším a posledním díle ji trochu vypilujeme přidáním pozadí, hudební smyčky a klávesových zkratek.
fr: Le jeu est pratiquement terminé à ce stade. Dans la prochaine et dernière partie, nous allons le peaufiner un peu en ajoutant un arrière-plan, une musique qui boucle et quelques raccourcis clavier.
ga: Is ag an bpointe seo is mó a dhéantar an cluiche. Sa chéad chuid eile agus sa chuid dheireanach, cuirfimid snas air beagán trí chúlra a chur leis, ceol a lúbadh, agus roinnt aicearraí méarchláir.
it: A questo punto il gioco è quasi completato. Nella prossima e ultima parte, lo rifiniremo un po' aggiungendo uno sfondo, musica in ripetizione e alcune scorciatoie da tastiera.
ta: இந்த கட்டத்தில் விளையாட்டு பெரும்பாலும் செய்யப்படுகிறது. அடுத்த மற்றும் கடைசி பகுதியில், பின்னணி, சுழற்சி இசை மற்றும் சில விசைப்பலகை குறுக்குவழிகளைச் சேர்ப்பதன் மூலம் அதை கொஞ்சம் கொஞ்சமாக மெருகூட்டுவோம்.
tr: Oyunumuz artık neredeyse tamamlandı. Sıradaki son bölümde, buna biraz cilalama yapacağız; bir arka plan, tekrar eden müzik, ve birkaç klavye kısayolu ekleyeceğiz.
zh_hant: 遊戲在這一點上大部分已經完成。在下一部分和最後一部分中，我們將通過新增背景，迴圈音樂和一些鍵盤快捷鍵來對其進行一些潤色。

source: This function is called when the player loses. It will show "Game Over" for 2 seconds, then return to the title screen and, after a brief pause, show the "Start" button.
tr: Bu fonksiyon, oyuncu kaybedince çalışır. 2 saniye süreyle "Game Over" yazasını gösterecek, sonra başlık ekranına geri dönecek, kısa bir duraklama yapacak ve "Başlat" düğmesini gösterecek.
