Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/06.heads_up_display.po
Languages: cs, fr, ga, it, ta, tr, zh_hant

source: Choose the "Anchor Preset" ``Center Bottom``.
cs: Vyberte "Předvolbu ukotvení" ``Uprostřed dole``.
fr: Choisissez le « Préréglage d'ancrage » ``Centre Bas``.
ga: Roghnaigh an "Anchor Preset" ''Center Bottom''.
it: Scegli la "preimpostazione di ancoraggio" ``Al centro in basso``.
ta: "நங்கூரம் முன்னமைவு" `` சென்டர் பாட்டம்`` என்பதைத் தேர்வுசெய்க.
tr: "Çapa Ön Ayarı" için ``Merkez Alt`` ögesini seçin.
zh_hant: 為“Anchor Preset”選擇 ``Center Bottom``。

source: Under "Control - Layout/Transform", set "Position Y" to ``580``.
cs: Pod "Control - Rozvržení/Transformace" nastavte "Pozice Y" na ``580``.
fr: Sous "Contrôle - Disposition/Transformation", définissez "Position Y" sur ``580``.
ga: Faoi "Control - Layout/Transform", leag "Seasamh Y" go ''580''.
it: In "Control - Layout/Transform", imposta "Position Y" su ``580``.
ta: "கட்டுப்பாடு - தளவமைப்பு/உருமாற்றம்" இன் கீழ், "நிலை ஒய்" ஐ `` 580`` ஆக அமைக்கவும்.
tr: "Kontrol - Yerleşim Düzeni/Dönüştürme" altında, "Y Konumu"nu ``580`` olarak ayarlayın.
zh_hant: 在“Control - Layout/Transform”中將“Position Y”設定為 ``580``。

source: On the ``MessageTimer``, set the ``Wait Time`` to ``2`` and set the ``One Shot`` property to "On".
cs: V ``MessageTimer`` nastavte ``Čas čekání`` na ``2`` a nastavte vlastnost ``Jednorázový`` na "Zapnuto".
fr: Sur le ``MessageTimer``, mettez le ``Wait Time`` à ``2`` et mettez la propriété ``One Shot`` à "On".
ga: Ar an ''MessageTimer'', socraigh an ''Wait Time'' go ''2'' agus socraigh an mhaoin ''One Shot'' go "Ar".
it: Sul ``MessageTimer``, imposta ``Tempo d'attesa`` su ``2`` e imposta la proprietà ``Colpo singolo`` su "On".
ta: `` செய்தி டைமர்`` இல், `` காத்திருப்பு நேரத்தை`` `2`` ஆக அமைத்து,` `ஒரு சாட்`` சொத்தை" ஆன் "என்று அமைக்கவும்.
tr: ``MessageTimer`` için, ``Bekleme Süresi``'ni ``2`` ve ``Tek Seferlik`` özelliğini "Açık" yapın.
zh_hant: 將 ``MessageTimer`` 的 ``Wait Time`` 設為 ``2`` ，將 ``One Shot`` 設為「開啟」。

source: Now add this script to ``HUD``:
cs: Nyní připojte tento skript k ``HUD``:
fr: Ajoutez à présent ce script au ``HUD`` :
ga: Anois cuir an script seo le ''HUD'':
it: Ora aggiungi questo script a ''HUD'':
ta: இப்போது இந்த ச்கிரிப்டை `` அட்`` இல் சேர்க்கவும்:
tr: Şimdi bu betiği ``HUD`` 'a ekleyin:
zh_hant: 現在將這個腳本新增至 ``HUD`` ：

source: We now want to display a message temporarily, such as "Get Ready", so we add the following code
cs: Chceme zobrazit dočasnou zprávu, například "Připravte se". K tomu přidáme následující kód
fr: Nous pouvant maintenant afficher un message temporaire, comme "Prêt", nous ajoutons donc le code suivant
ga: Ba mhaith linn teachtaireacht a thaispeáint go sealadach anois, mar shampla "Get Ready", mar sin cuirimid an cód seo a leanas leis
it: Ora vogliamo visualizzare temporaneamente un messaggio, ad esempio "Get Ready", quindi aggiungiamo il seguente codice
ta: "தயாராகுங்கள்" போன்ற தற்காலிகமாக ஒரு செய்தியைக் காட்ட இப்போது விரும்புகிறோம், எனவே பின்வரும் குறியீட்டைச் சேர்க்கிறோம்
tr: Şimdi geçici olarak "Hazır Ol" gibi bir mesaj görüntülemek istiyoruz, bu yüzden aşağıdaki kodu ekliyoruz
zh_hant: 我們現在想要暫時顯示訊息（例如「Get Ready」），所以新增以下程式碼

source: We also need to process what happens when the player loses. The code below will show "Game Over" for 2 seconds, then return to the title screen and, after a brief pause, show the "Start" button.
cs: Musíme také zpracovat, co se stane, když hráč prohraje. Níže uvedený kód na 2 vteřiny zobrazí "Konec hry", poté se vrátí na úvodní obrazovku a po krátké pauze zobrazí tlačítko "Spustit".
fr: Nous devons également traiter ce qui se passe lorsque le joueur perd. Le code ci-dessous affichera "Game Over" pendant 2 secondes, puis reviendra à l'écran titre et, après une brève pause, affichera le bouton "Start".
ga: Ní mór dúinn freisin a phróiseáil cad a tharlaíonn nuair a chailleann an t-imreoir. Taispeánfaidh an cód thíos "Game Over" ar feadh 2 soicind, ansin fill ar an scáileán teidil agus, tar éis sos gairid, taispeáin an cnaipe "Tosaigh".
it: Dobbiamo anche elaborare cosa succede quando il giocatore perde. Il seguente codice mostrerà "Game Over" per 2 secondi, poi ritornerà alla schermata del titolo e, dopo una breve pausa, mostrerà il pulsante "Start".
ta: வீரர் தோற்றால் என்ன நடக்கிறது என்பதையும் நாம் செயலாக்க வேண்டும். கீழேயுள்ள குறியீடு 2 விநாடிகள் "கேம் ஓவர்" காண்பிக்கும், பின்னர் தலைப்புத் திரைக்குத் திரும்பும், சுருக்கமான இடைநிறுத்தத்திற்குப் பிறகு, "தொடக்க" பொத்தானைக் காண்பி.
tr: Ayrıca oyuncu kaybettiğinde ne olacağını da işlememiz gerekir. Aşağıdaki kod 2 saniye boyunca "Game Over" (oyun bitti) ifadesini gösterecek, ardından giriş ekranına dönecek ve kısa bir duraklamanın ardından "Başlat" düğmesini gösterecektir.
zh_hant: 當玩家輸了之後會呼叫這個函式。會在畫面上顯示 2 秒「Game Over」，然後回到標題畫面、暫停一下，最後顯示「Start」按鈕。

source: When you need to pause for a brief time, an alternative to using a Timer node is to use the SceneTree's ``create_timer()`` function. This can be very useful to add delays such as in the above code, where we want to wait some time before showing the "Start" button.
cs: Když potřebujete hru na krátkou dobu pozastavit, alternativou k použití uzlu Timer je použití funkce ``create_timer()`` ("vytvořit časovač") třídy SceneTree ("strom scén"). To může být velmi užitečné pro přidání zpoždění, jako například v kódu výše, kdy chceme počkat, než se zobrazí tlačítko "Spustit".
fr: Quand vous avez besoin d'une courte pause, une alternative à l'utilisation d'un nœud Timer est d'utiliser la fonction ``create_timer()`` de l'arborescence de scène. Ceci peut être très utile pour créer un délais, comme dans le code ci-dessus, où nous voulons attendre un peu avant de faire apparaître le bouton "Start".
ga: Nuair is gá duit sos a ghlacadh ar feadh tréimhse ghairid, rogha eile seachas nód Timer a úsáid ná feidhm ''create_timer()'' an SceneTree a úsáid. D'fhéadfadh sé seo a bheith an-úsáideach chun moilleanna a chur leis, mar shampla sa chód thuas, áit ar mhaith linn fanacht tamall sula dtaispeántar an cnaipe "Tosaigh".
it: Quando è necessario sospendere per un breve periodo di tempo, un'alternativa all'utilizzo di un nodo Timer consiste nell'utilizzare la funzione ``create_timer()`` di SceneTree. Questo può essere molto utile per ritardare, come nel codice sopra, dove vogliamo aspettare un po 'di tempo prima di mostrare il pulsante "Start".
ta: நீங்கள் ஒரு சுருக்கமான நேரத்திற்கு இடைநிறுத்த வேண்டியிருக்கும் போது, டைமர் முனையைப் பயன்படுத்துவதற்கு மாற்றாக, காட்சிரீயின் `` create_timer () `` செயல்பாட்டைப் பயன்படுத்துவது. மேலே உள்ள குறியீடு போன்ற தாமதங்களைச் சேர்க்க இது மிகவும் பயனுள்ளதாக இருக்கும், அங்கு "தொடக்க" பொத்தானைக் காண்பிப்பதற்கு முன்பு சிறிது நேரம் காத்திருக்க விரும்புகிறோம்.
tr: Belli bir süreliğine duraklama isterseniz, bir Timer düğümü kullanmak yerine, sahne ağacının ``create_timer()`` fonksiyonunu kullanabilirsiniz. Yukarıdaki kodda olduğu gibi, "Başlat" düğmesini göstermeden önce bir süre beklemeyi istediğimiz yerlerde, biraz gecikme eklemek için oldukça kullanışlı olabilir.
zh_hant: 需要暫停一下下的時候，除了使用 Timer 節點外也可以使用 SceneTree（場景樹）的 ``create_timer()`` 函式。當需要像上面的程式碼一樣新增一點延遲的時候很有用，上面的例子中我們用它來在顯示「Start」按鈕前增加一點點等待時間。

source: Add the code below to ``HUD`` to update the score
cs: K ``HUD`` přidejte následující kód pro aktualizaci skóre
fr: Ajoutez le code ci-dessous à ``HUD`` pour mettre à jour le score
ga: Cuir an cód thíos le ''HUD'' chun an scór a nuashonrú
it: Aggiungi il codice seguente a ``HUD`` per aggiornare il punteggio
ta: மதிப்பெண்ணைப் புதுப்பிக்க கீழே உள்ள குறியீட்டை `` அட்`` இல் சேர்க்கவும்
tr: Puanı güncellemek için aşağıdaki kodu ``HUD``'a ekleyin
zh_hant: 將以下更新分數程式碼新增到 ``HUD`` 中

source: Connect the ``pressed()`` signal of ``StartButton`` and the ``timeout()`` signal of ``MessageTimer`` to the ``HUD`` node, and add the following code to the new functions:
cs: Připojte signál ``pressed()`` ("stisknuto") tlačítka ``StartButton`` a signál ``timeout()`` časovače ``MessageTimer`` k uzlu ``HUD`` a k novým funkcím přidejte následující kód:
fr: Connectez le signal ``pressed()`` de ``StartButton`` et le signal ``timeout()`` de ``MessageTimer`` au nœud ``HUD`` et ajoutez le code suivant aux nouvelles fonctions :
ga: Ceangail an comhartha ''brúite()'' de ''StartButton'' agus an comhartha ''timeout()'' de ''MessageTimer'' leis an nód ''HUD'', agus cuir an cód seo a leanas leis na feidhmeanna nua:
it: Collega il segnale ``pressed()`` di ``StartButton`` e il segnale ``timeout()`` di ``MessageTimer`` al nodo ``HUD`` e aggiungi il seguente codice alle nuove funzioni:
ta: `` StartButton`` இன் `` அழுத்தப்பட்ட () `` சிக்னலையும், `` MessageTimer`` இன் `` Hud`` `முனையுடன்` `காலக்கெடு ()` சமிக்ஞையை இணைத்து, பின்வரும் குறியீட்டை புதிய செயல்பாடுகளுக்குச் சேர்க்கவும் :
tr: ``StartButton`` düğmesinin ``pressed()`` sinyalini ve ``MessageTimer`` düğmesinin ``timeout()`` sinyalini ``HUD`` düğümüne bağlayın ve aşağıdaki kodu yeni fonksiyonlara ekleyin:
zh_hant: 將 ``StartButton`` 的 ``pressed()`` 訊號和 ``MessageTimer`` 的 ``timeout()`` 訊號連接到 ``HUD`` 節點，並將下列程式碼新增到新的函式中：

source: Connecting HUD to Main
cs: Propojení HUD a Main
fr: Connecter le HUD à Main
ga: HUD a nascadh leis an bPríomhroinn
it: Collegamento di HUD a Main
ta: HUD ஐ பிரதானமாக இணைக்கிறது
tr: HUD 'u Main 'e bağlamak
zh_hant: 將 HUD 場景連接至 Main 場景

source: Now that we're done creating the ``HUD`` scene, go back to ``Main``. Instance the ``HUD`` scene in ``Main`` like you did the ``Player`` scene. The scene tree should look like this, so make sure you didn't miss anything:
cs: Nyní, když jsme dokončili scénu ``HUD``, se vraťte do hlavní scény ``Main``. Instancujte scénu ``HUD`` v ``Main``, tak jako jste to udělali se scénou ``Player``. Strom scén by měl vypadat takto, takže se ujistěte, že vám nic neuniklo:
fr: Maintenant que nous avons fini de créer la scène du ``HUD``, sauvegardez-la et retournez à ``Main``. Instanciez la scène ``HUD`` dans ``Main`` comme vous l'avez fait dans la scène ``Player``. L'arbre de scène devrait ressembler à ça, alors assurez-vous de ne rien manquer :
ga: Anois agus an radharc ''HUD'' á chruthú againn, téigh ar ais go dtí ''Main''. Cuir an radharc ''HUD'' i ''Main'' mar a rinne tú an radharc ''Player''. Ba chóir go mbeadh cuma mar seo ar an gcrann radhairc, mar sin déan cinnte nár chaill tú rud ar bith:
it: Ora che abbiamo finito di creare la scena ``HUD``, tornare a ``Main``. Istanza la scena ``HUD`` in ``Main`` come hai fatto per la scena ``Player``. L'albero della scena completo dovrebbe essere simile a questo, quindi assicurati di non aver tralasciato nulla:
ta: இப்போது நாங்கள் `` அட்` காட்சியை உருவாக்கி முடித்துவிட்டோம், மீண்டும் `` பிரதான`` க்குச் செல்லுங்கள். உதாரணமாக `` பிளேயர்`` காட்சியை நீங்கள் செய்ததைப் போல `` மெயின்` `காட்சி. காட்சி மரம் இப்படி இருக்க வேண்டும், எனவே நீங்கள் எதையும் இழக்கவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்:
tr: ``HUD`` sahnesi oluşturmamız bittiğine göre, ``Main`` sahnesine geri dönün. Daha önce ``Player`` sahnesine yaptığınız gibi, ``HUD`` sahnesini ``Main`` içerisine örnekleyin. Sahne ağacınız şunun gibi görünmelidir, yani bir şeyi atlamadığınızdan emin olun:
zh_hant: 我們現在做好 ``HUD`` 場景了。讓我們回到 ``Main``。像剛才實體化 ``Player`` 場景一樣，在 ``Main`` 場景中實體化 ``HUD``。場景樹會看起來像這樣，檢查一下有沒有漏了什麼：

source: Now we need to connect the ``HUD`` functionality to our ``Main`` script. This requires a few additions to the ``Main`` scene:
cs: Nyní musíme propojit funkce ``HUD`` se skriptem ``Main``. K tomu musíme ke scéně ``Main`` přidat několik věcí:
fr: Nous devons maintenant connecter la fonctionnalité ``HUD`` à notre script ``Main``. Cela nécessite quelques ajouts à la scène ``Main`` :
ga: Anois ní mór dúinn an fheidhmiúlacht ''HUD'' a nascadh lenár script ''Main''. Éilíonn sé seo cúpla breisiú ar an radharc ''Main'':
it: Ora dobbiamo collegare la funzionalità ``HUD`` al nostro script ``Main``. Ciò richiede alcune aggiunte alla scena ``Main``:
ta: இப்போது நாம் `` HUD`` செயல்பாட்டை எங்கள் `` பிரதான`` ச்கிரிப்டுடன் இணைக்க வேண்டும். இதற்கு `` பிரதான`` காட்சிக்கு சில சேர்த்தல்கள் தேவை:
tr: Şimdi ``HUD``işlevselliğini ``Main`` betiğimize bağlamamız gerekiyor. Bunun için ``Main`` sahnemize birkaç şey eklememiz gerekiyor:
zh_hant: 我們現在需要把 ``HUD`` 的功能連接到 ``Main`` 腳本。所以我們需要在 ``Main`` 場景內新增一點點東西：

source: In the Node tab, connect the HUD's ``start_game`` signal to the ``new_game()`` function of the Main node by clicking the "Pick" button in the "Connect a Signal" window and selecting the ``new_game()`` method or type "new_game" below "Receiver Method" in the window. Verify that the green connection icon now appears next to ``func new_game()`` in the script.
cs: V záložce Uzel připojte signál ``start_game`` HUDu k funkci ``new_game()`` uzlu Main kliknutím na tlačítko "Vybrat" v okně "Připojit signál" a výběrem metody ``new_game()``, případně napište "new_game" pod do pole "Přijímací metoda". Ověřte, že se ve skriptu vedle ``func new_game()`` objevila zelená ikona připojení.
fr: Dans l'onglet Nœud, connectez le signal ``start_game`` du HUD à la fonction ``new_game()`` du nœud principal en cliquant sur le bouton "Choisir" dans la fenêtre "Connecter un signal" et en sélectionnant la méthode ``new_game()`` ou saisissez "new_game" sous "Méthode du récepteur" dans la fenêtre. Vérifiez que l'icône de connexion verte apparaît maintenant à côté de ``func new_game()`` dans le script.
ga: Sa chluaisín Node, ceangail comhartha ''start_game'' an HUD le feidhm ''new_game()'' an Phríomh-nód trí chliceáil ar an gcnaipe "Pioc" san fhuinneog "Ceangail Comhartha" agus roghnaigh an modh ''new_game()'' nó clóscríobh "new_game" faoi bhun "Modh glacadóra" san fhuinneog. Fíoraigh go bhfuil deilbhín an naisc ghlais le feiceáil anois in aice le ''func new_game()'' sa script.
it: Nella scheda Node, collega il segnale ``start_game`` dell'HUD alla funzione ``new_game()`` del nodo Main, cliccando sul pulsante "Scegli" nella finestra "Connetti un segnale" e selezionando il metodo ``new_game()``, oppure digitando "new_game" in "Metodo ricevitore" nella stessa finestra. Verifica che l'icona verde di connessione appaia ora accanto a ``func new_game()`` nello script.
ta: முனை தாவலில், HUD இன் `` start_game`` சமிக்ஞையை `` புதிய_கேம் () `` முதன்மையான முனையின் செயல்பாட்டுடன் "ஒரு சமிக்ஞை இணைக்கவும்" சாளரத்தில் "பிக்" பொத்தானைக் சொடுக்கு செய்து `` புதிய_கேம் (புதிய_கேம் ஆகியவற்றைத் தேர்ந்தெடுப்பதன் மூலம் இணைக்கவும் ) சாளரத்தில் "ரிசீவர் முறை" கீழே "புதிய_கேம்" முறை அல்லது தட்டச்சு செய்க. ச்கிரிப்ட்டில் `` func new_game () `` க்கு அடுத்ததாக பச்சை இணைப்பு படவுரு இப்போது தோன்றும் என்பதை சரிபார்க்கவும்.
tr: Düğüm sekmesinde, HUD'un ``start_game`` sinyalini Ana düğümün ``new_game()`` işlevine bağlamak için "Bir Sinyal Bağla" penceresindeki "Seç" düğmesine tıklayın ve ``new_game()`` yöntemini seçin veya penceredeki "Alıcı Yöntem"in altına "new_game" yazın. Kodda ``func new_game()`` metodunun yanında artık yeşil bağlantı simgesinin göründüğünü doğrulayın.
zh_hant: 在「節點」頁籤中，將 HUD 的 ``start_game`` 訊號連接到 Main 節點的 ``new_game()`` 函式。方法是在「連接訊號」視窗中點擊「選取」按鈕，然後選擇 ``new_game()`` 方法，或是在視窗中「接收器方法」下方輸入 "new_game"。確認腳本中 ``func new_game()`` 的旁邊現在出現綠色的連接圖示。

source: In ``new_game()``, update the score display and show the "Get Ready" message:
cs: V ``new_game()`` aktualizujte zobrazené skóre a zobrazte zprávu "Připravte se":
fr: Dans ``new_game()``, mettez à jour l'affichage des scores et affichez le message "Get Ready" :
ga: In ''new_game()'', nuashonraigh taispeáint an scór agus taispeáin an teachtaireacht "Get Ready":
it: In ``new_game()``, aggiorna la visualizzazione del punteggio e mostra il messaggio "Get Ready":
ta: `` புதிய_கேம் () `` இல், மதிப்பெண் காட்சியைப் புதுப்பித்து, "தயாராகுங்கள்" செய்தியைக் காட்டுங்கள்:
tr: ``new_game()`` fonksiyonunda, puan görüntülemeyi güncelleyip, "Hazır Ol" iletisini görüntüleyin:
zh_hant: ``new_game()`` 中，需要更新分數並顯示「Get Ready」訊息：

source: In ``game_over()`` we need to call the corresponding ``HUD`` function:
cs: V ``game_over()`` musíme zavolat odpovídající ``HUD`` funkci:
fr: Dans ``game_over()`` nous devons appeler la fonction ``HUD`` correspondante :
ga: In ''game_over()'' ní mór dúinn an fheidhm chomhfhreagrach ''HUD'' a ghlaoch:
it: In ``game_over()`` dobbiamo chiamare la corrispondente funzione ``HUD``:
ta: `` கேம்_ஓவர் () `` இல் நாம் தொடர்புடைய `` அட்`` செயல்பாட்டை அழைக்க வேண்டும்:
tr: ``game_over()`` fonksiyonunda, karşılık gelen ``HUD`` fonksiyonunu çağırmamız gerekiyor:
zh_hant: ``game_over()`` 中我們需要呼叫對應的 ``HUD`` 函式：

source: Finally, add this to ``_on_score_timer_timeout()`` to keep the display in sync with the changing score:
cs: Nakonec přidejte do ``_on_score_timer_timeout()`` tento kód, který aktualizuje displej s tím, jak se skóre zvyšuje:
fr: Enfin, ajoutez ceci à ``on_score_timer_timeout()`` pour que l'affichage reste synchronisé avec le changement de score :
ga: Ar deireadh, cuir é seo le ''_on_score_timer_timeout()'' chun an taispeáint a choinneáil sioncronaithe leis an scór athraitheach:
it: Infine, aggiungi questo a ``_on_score_timer_timeout()`` per mantenere la schermata sincronizzata con il punteggio che cambia:
ta: இறுதியாக, இதை `` _ON_SCORE_TIMER_TIMEOUT () `` இல் சேர்க்கவும், மாறிவரும் மதிப்பெண்ணுடன் காட்சியை ஒத்திசைக்க:
tr: Son olarak, görüntüyü değişen puanla eş zamanlı tutmak için bunu ``_on_score_timer_timeout()`` işlevine ekleyin:
zh_hant: 最後，將這段程式碼加到 ``_on_ScoreTimer_timeout()`` 來讓分數改變的時候能同步顯示：

source: Remember to remove the call to ``new_game()`` from ``_ready()`` if you haven't already, otherwise your game will start automatically.
cs: Pokud jste tak ještě neučinili, nezapomeňte odstranit volání ``new_game()`` z ``_ready()``, jinak se vaše hra spustí automaticky.
fr: N'oubliez pas de supprimer l'appel à ``new_game()`` dans ``_ready()`` si vous ne l'avez pas déjà fait, sinon votre jeu démarrera automatiquement.
ga: Ná déan dearmad an glaoch ar ''new_game()'' a bhaint as ''_ready()'' mura bhfuil tú cheana féin, nó tosóidh do chluiche go huathoibríoch.
it: Ricordati di rimuovere la chiamata a ``new_game()`` da ``_ready()`` se non lo hai già fatto, altrimenti il tuo gioco partirà automaticamente.
ta: அழைப்பை `` புதிய_கேம் () `` `` _ _ready () `` `` நீங்கள் ஏற்கனவே இல்லையென்றால், இல்லையெனில் உங்கள் விளையாட்டு தானாகவே தொடங்கும் என்பதை நினைவில் கொள்ளுங்கள்.
tr: Henüz yapmadıysanız ``new_game()`` çağrısını ``_ready()`` işlevinden kaldırmayı unutmayın, aksi takdirde oyununuz otomatik olarak başlayacaktır.
zh_hant: 記得移除 ``_ready()`` 中對 ``new_game()`` 的呼叫（如果你還沒做的話），否則你的遊戲會自動開始。

source: Now you're ready to play! Click the "Play the Project" button.
cs: Nyní můžeme hrát! Klikněte na tlačítko "Spustit projekt".
fr: Vous êtes maintenant prêt à jouer ! Cliquez sur le bouton "Lancer le projet".
it: Ora sei pronto per giocare! Clicca sul pulsante "Esegui il progetto".
ta: இப்போது நீங்கள் விளையாட தயாராக இருக்கிறீர்கள்! "திட்டத்தை விளையாடுங்கள்" பொத்தானைக் சொடுக்கு செய்க.
zh_hant: 現在你已經準備好開始遊玩了！點擊「執行專案」按鈕。

source: Removing old creeps
cs: Odstranění starých hnusáků
fr: Supprimer les vieux Creeps
ga: Deireadh a chur creeps d'aois
it: Rimuovere i vecchi "creeps"
ta: பழைய க்ரீப்சை நீக்குகிறது
tr: Eski düşmanları kaldırmak
zh_hant: 刪除舊的怪物

source: If you play until "Game Over" and then start a new game right away, the creeps from the previous game may still be on the screen. It would be better if they all disappeared at the start of a new game. We just need a way to tell *all* the mobs to remove themselves. We can do this with the "group" feature.
cs: Když budete hrát až do "Konec hry" a ihned poté zahájíte novou hru, můžou se na obrazovce stále zobrazovat nepřátelé z předchozí hry. Bylo by lepší, kdyby na začátku nové hry všichni zmizeli. Potřebujeme jen způsob, jak říct *všem* nepřátelům, aby zmizeli. Můžeme to udělat pomocí funkce "skupin".
fr: Si vous jouez jusqu'au "Game Over" et que vous commencez une nouvelle partie immédiatement, les monstres de la partie précédente sont toujours à l'écran. Il vaudrait mieux qu'ils disparaissent tous au début d'une nouvelle partie. Il nous faut juste un moyen de dire à *tous* les monstres de se supprimer. Nous pouvons le faire grâce à la fonction "groupe".
ga: Má imríonn tú go dtí "Cluiche Thar" agus ansin tús a chur le cluiche nua ar an bpointe boise, d'fhéadfadh an creeps ón gcluiche roimhe seo a bheith fós ar an scáileán. Bheadh sé níos fearr dá n-imeodh siad ar fad ag tús cluiche nua. Níl uainn ach bealach chun na mobs *all *a insint chun iad féin a bhaint. Is féidir linn é seo a dhéanamh leis an ngné "grúpa".
it: Se giochi fino al "Game Over" e inizi subito una nuova partita, i creeps del gioco precedente potrebbero essere ancora sullo schermo. Sarebbe meglio se scomparissero tutti all'inizio di una nuova partita. Abbiamo solo bisogno di un modo per dire a *tutti* i mob di sparire. Possiamo farlo con la funzione "gruppo".
ta: நீங்கள் "கேம் ஓவர்" வரை விளையாடினால், உடனே ஒரு புதிய விளையாட்டைத் தொடங்கினால், முந்தைய விளையாட்டிலிருந்து தவழும் திரையில் இருக்கலாம். புதிய விளையாட்டின் தொடக்கத்தில் அவர்கள் அனைவரும் காணாமல் போனால் நல்லது. தங்களை அகற்றுவதற்கு * அனைத்து * கும்பல்களையும் சொல்ல எங்களுக்கு ஒரு வழி தேவை. "குழு" அம்சத்துடன் இதைச் செய்யலாம்.
tr: Eğer "Oyun Bitti" görene kadar oynar, ve sonra hemen yeni bir oyun başlatırsanız, önceki oyundan kalan düşmanlar hala ekranda duruyor olabilir. Yeni bir oyun başlatınca öncekilerin hepsi kaybolsa çok daha iyi olurdu. Bize, bütün düşmanlara kendilerini silmelerini söylemek için bir yol gerekiyor. Bunu, "grup" özelliğini kullanarak yapabiliriz.
zh_hant: 如果一直玩到「Game Over」並直接開始新遊戲的話，上一場遊戲的怪物可能還在畫面上。開始遊戲的時候如果能讓舊的怪物消失會更好。而我們只需要告訴 **所有** 怪物，刪除自己。我們可以在這裡使用「群組」功能。

source: In the ``Mob`` scene, select the root node and click the "Node" tab next to the Inspector (the same place where you find the node's signals). Next to "Signals", click "Groups" to open the group overview and the "+" button to open the "Create New Group" dialog.
cs: Ve scéně ``Mob`` vyberte kořenový uzel a klikněte na kartu "Uzel" vedle Inspektoru (na stejném místě, kde najdete signály uzlu). Vedle položky "Signály" klikněte na "Skupiny". Zde najdete přehled definovaných skupin a kliknutím na tlačítko "+" otevřete okno "Vytvořit novou skupinu".
fr: Dans la scène ``Mob``, sélectionnez le nœud racine et cliquez sur l'onglet "Nœud" à côté de l'inspecteur (le même endroit où vous trouvez les signaux du nœud). À côté de "Signaux", cliquez sur "Groupes" pour ouvrir la vue des groupes et le bouton "+" pour ouvrir la fenêtre "Créer nouveau groupe".
it: Nella scena ``Mob``, seleziona il nodo radice e clicca sulla scheda "Nodo" accanto all'Ispettore (lo stesso posto dove si trovano i segnali del nodo). Accanto a "Segnali", clicca su "Gruppi" per aprire il riepilogo dei gruppi e il pulsante "+" per aprire la finestra di dialogo "Crea un nuovo gruppo".
ta: `` கும்பல்`` காட்சியில், ரூட் முனையைத் தேர்ந்தெடுத்து, இன்ச்பெக்டருக்கு அடுத்த "முனை" தாவலைக் சொடுக்கு செய்க (முனையின் சமிக்ஞைகளை நீங்கள் கண்டுபிடிக்கும் அதே இடம்). "சிக்னல்கள்" அடுத்து, குழு கண்ணோட்டத்தைத் திறக்க "குழுக்கள்" மற்றும் "புதிய குழுவை உருவாக்கு" உரையாடலைத் திறக்க "+" பொத்தானைக் சொடுக்கு செய்க.
zh_hant: 在 ``Mob`` 場景中，選取根節點，然後點擊 Inspector 旁邊的「節點」頁籤（與您找到節點訊號的相同位置）。在「訊號」旁邊，點擊「群組」以開啟群組總覽，然後點擊「+」按鈕以開啟「建立新群組」對話框。

source: Name the group ``mobs`` and click "ok" to add a new scene group.
cs: Skupinu pojmenujte ``mobs`` a kliknutím na "ok" vytvořte novou skupinu scén.
fr: Nommez le groupe ``mobs`` et cliquez sur "ok" pour ajouter un nouveau groupe de scène.
it: Assegna al gruppo il nome ``mobs`` e clicca su "ok" per aggiungere un nuovo gruppo di scena.
ta: `` கும்பல்`` குழுவிற்கு பெயரிட்டு, புதிய காட்சிக் குழுவைச் சேர்க்க "சரி" என்பதைக் சொடுக்கு செய்க.
zh_hant: 將群組命名為 ``mobs`` ，然後點擊「確定」以新增一個場景群組。

source: Now all mobs will be in the "mobs" group.
cs: Nyní budou všichni mobové ve skupině "mobs".
fr: Maintenant, toutes les monstres seront dans le groupe "monstres".
it: Ora tutti i mob saranno nel gruppo "mobs".
ta: இப்போது அனைத்து கும்பல்களும் "கும்பல்" குழுவில் இருக்கும்.
zh_hant: 現在所有怪物都會在「mobs」群組裡了。
