Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/06.heads_up_display.po
Languages: cs, fr, ga, it, ta, tr, zh_hant

source: Heads up display
cs: Informační displej
fr: Heads up display (HUD)
ga: Cinn suas taispeáint
it: Heads up display (HUD)
ta: டிச்ப்ளே எட்ச் அப்
tr: Kafa üstü gösterge (HUD)
zh_hant: 遊戲資訊顯示

source: The final piece our game needs is a User Interface (UI) to display things like score, a "game over" message, and a restart button.
cs: Posledním kouskem, který naše hra potřebuje, je uživatelské rozhraní (UI), ve kterém zobrazíme informace jako skóre, zprávu "konec hry" a tlačítko pro restart hry.
fr: La dernière pièce dont notre jeu a besoin est une Interface Utilisateur (IU), User Interface (UI) en anglais, pour afficher des éléments comme le score, un message "game over" et un bouton de redémarrage.
ga: Is é an píosa deiridh ár riachtanais cluiche Comhéadan Úsáideora (Chomhéadain) chun rudaí cosúil le scór, teachtaireacht "cluiche thar" a thaispeáint, agus cnaipe atosú.
it: L'ultimo pezzo di cui il nostro gioco ha bisogno è un'interfaccia utente (UI) che visualizzi informazioni come il punteggio, un messaggio "game over" e un pulsante per riavviare.
ta: எங்கள் விளையாட்டுக்குத் தேவையான இறுதி துண்டு மதிப்பெண், "கேம் ஓவர்" செய்தி மற்றும் மறுதொடக்கம் பொத்தானைக் காண்பிப்பதற்கான பயனர் இடைமுகம் (UI) ஆகும்.
tr: Oyunumuzun son parçası, toplam puanı, bir "oyun bitti" iletisini, ve bir tekrar başlatma düğmesi gibi şeyleri göstermesi için bir Kullanıcı Arayüzü (UI) gerektiriyor.
zh_hant: 我們的遊戲最後還需要使用者介面（User Interface，UI），顯示分數、“遊戲結束”資訊、重啟按鈕。

source: Create a new scene, click the "Other Node" button and add a :ref:`CanvasLayer <class_CanvasLayer>` node named ``HUD``. "HUD" stands for "heads-up display", an informational display that appears as an overlay on top of the game view.
cs: Vytvořte novou scénu, klikněte na tlačítko "Jiný uzel" a přidejte uzel :ref:`CanvasLayer <class_CanvasLayer>` ("vrstva plátna") s názvem ``HUD``. "HUD" je zkratka pro "heads-up display", informační displej, který se zobrazuje jako průhledná vrstva překrývající hru.
fr: Créez une nouvelle scène, cliquez sur le bouton "Autre nœud" et ajoutez un nœud :ref:`CanvasLayer <class_CanvasLayer>` nommé ``HUD``. "HUD"» signifie « Heads-Up Display (affichage tête haute) », un affichage d'informations qui apparaît en superposition au-dessus de la vue du jeu.
ga: Cruthaigh radharc nua, cliceáil ar an gcnaipe "Nóid Eile" agus cuir leis :ref:`CanvasLayer <class_CanvasLayer>` nód darb ainm ``HUD``. Seasann "HUD" do "taispeáint cinn", taispeáint faisnéise a fheictear mar fhorleagan ar bharr an amharc cluiche.
it: Creare una nuova scena, clicca sul pulsante "Altro nodo" e aggiungi un nodo :ref:`CanvasLayer <class_CanvasLayer>` denominato ``HUD``. "HUD" sta per "heads-up display", un schermata informativa che appare sovrapposta alla vista di gioco.
ta: ஒரு புதிய காட்சியை உருவாக்கி, "பிற முனை" பொத்தானைக் சொடுக்கு செய்து: குறிப்பு: `கேன்வாச்லேயர் <class_canvaslayer>` `Hud`` என்று பெயரிடப்பட்ட முனை. "HUD" என்பது "எட்ச்-அப் டிச்ப்ளே" ஐ குறிக்கிறது, இது ஒரு செய்தி காட்சி, இது விளையாட்டுக் காட்சியின் மேல் மேலடுக்காகத் தோன்றும்.
tr: Yeni bir sahne oluşturun, "Diğer Düğüm" düğmesine tıklayın ve ``HUD`` adında bir :ref:`CanvasLayer <class_CanvasLayer>` düğümü ekleyin. "HUD", oyun görünümünün üstünde bir kaplama olarak görünen bir bilgi ekranı olan "heads-up display" anlamına gelir.
zh_hant: 建立一個新的場景，點擊「其他節點」按鈕並新增一個 :ref:`CanvasLayer <class_CanvasLayer>` 節點，命名為 ``HUD`` 。「HUD」是 "heads-up display"（抬頭顯示器）的縮寫，是一種資訊顯示方式，會以覆蓋層的形式出現在遊戲畫面之上。

source: The :ref:`CanvasLayer <class_CanvasLayer>` node lets us draw our UI elements on a layer above the rest of the game, so that the information it displays isn't covered up by any game elements like the player or mobs.
cs: Uzel :ref:`CanvasLayer <class_CanvasLayer>` umožňuje kreslit naše prvky uživatelského rozhraní do vrstvy nad zbytkem hry, takže informace, které zobrazuje, nejsou zakryty žádnými herními prvky, jako je hráč nebo nepřátelé.
fr: Le nœud :ref:`CanvasLayer <class_CanvasLayer>` nous permet de dessiner nos éléments de l'interface utilisateur sur un calque au-dessus du reste du jeu, de sorte que les informations qu'il affiche ne sont couvertes par aucun élément du jeu comme le joueur ou les monstres.
ga: Ligeann an nód :ref:`CanvasLayer <class_CanvasLayer>` dúinn ár n-eilimintí Chomhéadain a tharraingt ar shraith os cionn an chuid eile den chluiche, ionas nach mbeidh an fhaisnéis a thaispeánann sé clúdaithe ag aon eilimintí cluiche ar nós an t-imreoir nó mobs.
it: Il nodo :ref:'CanvasLayer <class_CanvasLayer>' ci consente di disegnare i nostri elementi dell'interfaccia utente su un livello sopra il resto del gioco, in modo che le informazioni visualizzate non vengano coperte da elementi di gioco come il giocatore o i mob.
ta: தி: ரெஃப்: `கேன்வாச்லேயர் <class_canvaslayer>` முனை எங்கள் இடைமுகம் கூறுகளை மீதமுள்ள விளையாட்டின் மேலே ஒரு அடுக்கில் வரைய அனுமதிக்கிறது, இதனால் அது காண்பிக்கும் தகவல்கள் பிளேயர் அல்லது கும்பல் போன்ற எந்த விளையாட்டு கூறுகளாலும் மறைக்கப்படாது.
tr: :ref:`CanvasLayer <class_CanvasLayer>` düğümü, oyunun diğer bütün ögelerinin üstünde kalacak bir katmanda kullanıcı arayüzünü (UI) çizmemize olanak verir, bu şekilde görüntülenen bilginin, oyuncu ya da düşmanlar gibi hiçbir oyun ögesi tarafından, önü kapatılamaz.
zh_hant: 使用 :ref:`CanvasLayer <class_CanvasLayer>` 節點可以讓我們在遊戲上方的圖層上繪製 UI 元素，這樣上面顯示的資訊就不會被其他遊戲元素如玩家或怪物給蓋住。

source: The HUD needs to display the following information:
cs: HUD musí zobrazit následující informace:
fr: Le HUD doit afficher les informations suivantes :
ga: Ní mór don HUD an fhaisnéis seo a leanas a thaispeáint:
it: L'HUD deve mostrare le seguenti informazioni:
ta: HUD பின்வரும் தகவல்களைக் காட்ட வேண்டும்:
tr: HUD'un aşağıdaki bilgileri göstermesi gerekiyor:
zh_hant: HUD 需要顯示如下資訊：

source: Score, changed by ``ScoreTimer``.
cs: Skóre, měněné uzlem ``ScoreTimer``.
fr: Le score, modifié par ``ScoreTimer``.
ga: Scór, athraithe ag ''ScoreTimer''.
it: Punteggio, modificato da ''ScoreTimer''.
ta: மதிப்பெண், `` ச்கோரெடிமர்`` ஆல் மாற்றப்பட்டது.
tr: Toplam Puan, ``ScoreTimer`` tarafından değiştirilir.
zh_hant: 分數，會通過 ``ScoreTimer`` 來更改。

source: A message, such as "Game Over" or "Get Ready!"
cs: Zprávu, například "Konec hry" nebo "Připravte se!"
fr: Un message, tel que "Game Over" ou "Get Ready"
ga: Teachtaireacht, mar shampla "Game Over" nó "Get Ready!"
it: Un messaggio, ad esempio "Game Over" o "Get Ready!"
ta: "கேம் ஓவர்" அல்லது "தயாராகுங்கள்!"
tr: Bir ileti, "Oyun Bitti" ya da "Hazır Ol!" gibi
zh_hant: 訊息，如「Gamer Over」或「請準備！」

source: A "Start" button to begin the game.
cs: Tlačítko "Start" pro zahájení hry.
fr: Un bouton "Démarrer" pour commencer le jeu.
ga: Cnaipe "Tosaigh" chun tús a chur leis an gcluiche.
it: Un pulsante "Start" per iniziare il gioco.
ta: விளையாட்டைத் தொடங்க ஒரு "தொடக்க" பொத்தான்.
tr: Oyunu başlatmak için bir "Başlat" düğmesi.
zh_hant: 用來開始遊戲的「Start」按鈕。

source: The basic node for UI elements is :ref:`Control <class_Control>`. To create our UI, we'll use two types of :ref:`Control <class_Control>` nodes: :ref:`Label <class_Label>` and :ref:`Button <class_Button>`.
cs: Základní uzel pro prvky uživatelského rozhraní je :ref:`Control <class_Control>` ("ovládací prvek"). K vytvoření našeho uživatelského rozhraní použijeme dva typy :ref:`Control <class_Control>` nodes: :ref:`Label <class_Label>` ("popisek") a :ref:`Button <class_Button>` ("tlačítko").
fr: Le nœud de base pour les éléments de l'interface utilisateur est :ref:`Control <class_Control>`. Pour créer notre interface utilisateur, nous utiliserons deux types de nœuds :ref:`Control <class_Control>` : :ref:`Label <class_Label>` et :ref:`Button <class_Button>`.
ga: Is é an nód bunúsach d'eilimintí Chomhéadain ná :ref:`Control <class_Control>`. Chun ár n-UI a chruthú, úsáidfimid dhá chineál :ref:`Control <class_Control>` nóid: :ref:`Lipéad <class_Label>` agus :ref:`Button <class_Button>`.
it: Il nodo di base per gli elementi dell'interfaccia utente è :ref:'Control <class_Control>'. Per creare l'interfaccia utente, useremo due tipi di nodi :ref:'Control <class_Control>': :ref:'Label <class_Label>' e :ref:'Button <class_Button>'.
ta: இடைமுகம் கூறுகளுக்கான அடிப்படை முனை: ref: `கட்டுப்பாடு <class_control>`. எங்கள் இடைமுகம் ஐ உருவாக்க, நாங்கள் இரண்டு வகைகளைப் பயன்படுத்துவோம்: re: `கட்டுப்பாடு <class_control>` முனைகள் :: குறிப்பு: `லேபிள் <class_label>` மற்றும்: `பொத்தான் <class_button>`.
tr: Arayüz ögeleri için en temel düğüm :ref:`Control <class_Control>` 'dür (denetim). Kendi arayüzümüz için, bu düğümün iki çeşidini kullanacağız: :ref:`Label <class_Label>` (etiket) ve :ref:`Button <class_Button>` (düğme).
zh_hant: UI 元素所使用的基本節點是 :ref:`Control <class_Control>` 。我們需要使用兩種類型的 :ref:`Control <class_Control>` 節點來給這個遊戲建立 UI： :ref:`Label <class_Label>` （標籤）與 :ref:`Button <class_Button>` （按鈕）。

source: Create the following as children of the ``HUD`` node:
cs: Jako potomky uzlu ``HUD`` vytvořte následující uzly:
fr: Créez les éléments suivants en tant qu'enfants du nœud ``HUD`` :
ga: Cruthaigh an méid seo a leanas mar leanaí den nód ''HUD'':
it: Crea i seguenti come figli del nodo ``HUD``:
ta: `` அட்`` முனையின் குழந்தைகளாக பின்வருவனவற்றை உருவாக்கவும்:
tr: ``HUD`` düğümünün alt-ögesi olarak aşağıdakileri oluşturun:
zh_hant: 為 ``HUD`` 節點建立下列子節點：

source: :ref:`Label <class_Label>` named ``ScoreLabel``.
cs: :ref:`Label <class_Label>` s názvem ``ScoreLabel``.
fr: Un :ref:`Label <class_Label>` nommé ``ScoreLabel``.
ga: :ref:`Lipéad <class_Label>` darb ainm ``ScoreLabel``.
it: :ref:`Label <class_Label>` denominato ``ScoreLabel``.
tr: ``ScoreLabel`` isminde bir :ref:`Label <class_Label>` düğümü.
zh_hant: :ref:`Label <class_Label>` ，命名為 ``ScoreLabel`` 。

source: :ref:`Label <class_Label>` named ``Message``.
cs: :ref:`Label <class_Label>` pojmenovaný ``Message`` ("zpráva").
fr: Un :ref:`Label <class_Label>` nommé ``Message``.
ga: :ref:`Lipéad <class_Label>` darb ainm ``Teachtaireacht``.
it: :ref:`Label <class_Label>` denominato ``Message``.
tr: ``Message`` isminde bir :ref:`Label <class_Label>` düğümü.
zh_hant: :ref:`Label <class_Label>` ，命名為 ``Message`` 。

source: :ref:`Button <class_Button>` named ``StartButton``.
cs: :ref:`Button <class_Button>` s názvem ``StartButton``.
fr: Un :ref:`Button <class_Button>` nommé ``StartButton``.
ga: :dearg:`Cnaipe <cnaipe ranga>` ainmneacha ``Cnaipe Tosaigh``.
it: :ref:`Button <class_Button>` denominato ``StartButton``.
ta: : சிவப்பு: `பொத்தான் <வகுப்பு பொத்தான்>` பெயர்கள் `` தொடக்க பொத்தான்``.
tr: ``StartButton`` isminde bir :ref:`Button <class_Button>` düğümü.
zh_hant: :ref:`Button <class_Button>` ，命名為 ``StartButton`` 。

source: :ref:`Timer <class_Timer>` named ``MessageTimer``.
cs: :ref:`Timer <class_Timer>` s názvem ``MessageTimer``.
fr: Un :ref:`Timer <class_Timer>` nommé ``MessageTimer``.
ga: :ref:`Amadóir <class_Timer>` darb ainm ``MessageTimer``.
it: :ref:`Timer <class_Timer>` denominato ``MessageTimer``.
tr: ``MessageTimer`` isminde bir :ref:`Timer <class_Timer>` düğümü.
zh_hant: :ref:`Timer <class_Timer>` ，命名為 ``MessageTimer`` 。

source: Click on the ``ScoreLabel`` and type a number into the ``Text`` field in the Inspector. The default font for ``Control`` nodes is small and doesn't scale well. There is a font file included in the game assets called "Xolonium-Regular.ttf". To use this font, do the following:
cs: Klikněte na ``ScoreLabel`` a zadejte číslo do pole ``Text`` v Inspektoru. Výchozí písmo pro uzly ``Control`` je malé a neškáluje dobře na vyšší velikosti. V herních zdrojích je obsažen soubor s názvem "Xolonium-Regular.ttf". Toto písmo použijeme následujícím způsobem:
fr: Cliquez sur le ``ScoreLabel`` et dans l'inspecteur, entrez un nombre dans le champ ``Text``. La police par défaut pour les nœuds ``Control`` est petite et ne s'ajuste pas correctement. Il existe un fichier de police inclus dans les ressources du jeu appelé "Xolonium-Regular.ttf". Pour utiliser cette police, procédez comme suit :
ga: Cliceáil ar an ''ScoreLabel'' agus clóscríobh uimhir sa réimse ''Téacs'' sa Chigire. Tá an cló réamhshocraithe le haghaidh nóid ''Control'' beag agus ní scálaíonn sé go maith. Tá comhad cló san áireamh sna sócmhainní cluiche ar a dtugtar "Xolonium-Regular.ttf". Chun an cló seo a úsáid, déan an méid seo a leanas:
it: Fare clic su ``ScoreLabel`` e digitare un numero nel campo ``Testo`` nell'Inspector. Il tipo di font predefinito per i nodi ``Control`` è piccolo e non scala bene. C'è un file di font incluso nelle risorse di gioco chiamato "Xolonium-Regular.ttf". Per utilizzare questo font, eseguire le operazioni seguenti:
ta: `` ச்கோரலேபிள்`` என்பதைக் சொடுக்கு செய்து, இன்ச்பெக்டரில் `` உரை` துறையில் ஒரு எண்ணைத் தட்டச்சு செய்க. `` கட்டுப்பாடு`` முனைகளுக்கான இயல்புநிலை எழுத்துரு சிறியது மற்றும் சரியாக அளவிடாது. "Xolonium-regular.ttf" எனப்படும் விளையாட்டு சொத்துகளில் எழுத்துரு கோப்பு சேர்க்கப்பட்டுள்ளது. இந்த எழுத்துருவைப் பயன்படுத்த, பின்வருவனவற்றைச் செய்யுங்கள்:
tr: ``ScoreLabel`` üzerine tıklayın ve Denetleyicide metin alanına, ``Text``, bir sayı girin. ``Control`` düğümleri için varsayılan yazıtipi küçüktür ve pek iyi ölçeklenmez. Oyun varlıkları ile birlikte gelen "Xolonium-Regular.ttf" isimli bir yazıtipi var. Bu yazıtipini kullanmak için şunu yapın:
zh_hant: 點擊 ``ScoreLabel`` 並在屬性檢視器中的 ``Text`` 輸入一個數字。 ``Control`` 節點的預設字形很小，而且也縮放得不是很好。遊戲素材裡有包含了一個字形檔，檔名為「Xolonium-Regular.ttf」。依照下列步驟來使用這個字形：

source: Under "Theme Overrides > Fonts", choose "Load" and select the "Xolonium-Regular.ttf" file.
cs: V části "Přepsání motivu > Fonty" vyberte "Načíst" a vyberte soubor "Xolonium-Regular.ttf".
fr: Sous "Thèmes de remplacement > Polices", choisissez "Charger" et sélectionnez le fichier "Xolonium-Regular.ttf".
ga: Faoi "Téama Sáraítear > Clónna", roghnaigh "Luchtaigh" agus roghnaigh an comhad "Xolonium-Regular.ttf".
it: Sotto "Sostituzioni del tema > Font", scegli "Carica" e seleziona il file "Xolonium-Regular.ttf".
ta: "கருப்பொருள் மேலெழுதல்கள்> எழுத்துருக்கள்" என்பதன் கீழ், "சுமை" என்பதைத் தேர்ந்தெடுத்து "Xolonium-regular.ttf" கோப்பைத் தேர்ந்தெடுக்கவும்.
tr: "Tema Üstüne Yazma -> Yazı Tipleri" altında, "Yükle "yi seçin ve "Xolonium-Regular.ttf" dosyasını seçin.
zh_hant: 在“Theme Overrides > Fonts”（主題覆蓋 > 字體）中選擇“載入”，然後選中“Xolonium-Regular.ttf”檔。

source: The font size is still too small, increase it to ``64`` under "Theme Overrides > Font Sizes". Once you've done this with the ``ScoreLabel``, repeat the changes for the ``Message`` and ``StartButton`` nodes.
cs: Velikost písma je stále příliš malá, zvyšte ji na ``64`` v části "Přepisy motivu > Velikosti fontů". Toto udělejte jak pro ``ScoreLabel``, tak pro uzly ``Message`` a ``StartButton``.
fr: La taille de la police est encore trop petite, augmentez-la à ``64`` sous "Remplacements de thème > Tailles de police". Une fois que vous avez fait cela avec ``ScoreLabel``, répétez les modifications pour les nœuds ``Message`` et ``StartButton``.
ga: Tá an clómhéid fós róbheag, méadaigh go `` 64`` é faoi "Sáraíonn Téama > Méideanna Cló". Nuair a bheidh sé seo déanta agat leis an ``ScoreLabel``, déan na hathruithe arís ar na nóid ``Message`` agus ``StartButton``.
it: La dimensione del font è ancora troppo piccola, aumentala a ``64`` in "Sostituzioni del tema > Dimensioni del font". Dopo aver modificato ``ScoreLabel``, ripeti le modifiche per i nodi ``Message`` e ``StartButton``.
ta: எழுத்துரு அளவு இன்னும் சிறியதாக உள்ளது, அதை `` 64`` கீழ் "கருப்பொருள் மேலெழுதும்> எழுத்துரு அளவுகள்" ஆக அதிகரிக்கவும். `` ச்கோர்லேபெல்`` உடன் இதைச் செய்தவுடன், `` செய்தி`` மற்றும் `` ச்டார்ட் பட்டன்` 'முனைகளுக்கான மாற்றங்களை மீண்டும் செய்யவும்.
tr: Yazı tipi boyutu hala çok küçük, "Tema Üstüne Yazma -> Yazı Tipi Boyutları" altında ``64`` e yükseltin. Bunu ``ScoreLabel`` ile yaptıktan sonra, ``Message`` ve ``StartButton`` düğümleri için değişiklikleri tekrarlayın.
zh_hant: 字形尺寸仍然太小，請在“Theme Overrides > Font Sizes”（主題覆蓋 > 字形大小）下將其增加到 ``64`` 。當 ``ScoreLabel`` 完成此操作後，請重複對 ``Message`` 和 ``StartButton`` 節點做同樣的修改。

source: **Anchors:** ``Control`` nodes have a position and size, but they also have anchors. Anchors define the origin - the reference point for the edges of the node.
cs: **Ukotvení:** Uzly ``Control`` mají polohu a velikost, ale mají také ukotvení. Ta definují počátek - referenční bod pro hrany uzlu.
fr: **Ancres :** les nœuds ``Control`` ont une position et une taille, mais ils ont également des ancres. Les ancres définissent l'origine, c'est-à-dire le point de référence des arêtes du nœud.
ga: **Anchors:** Tá suíomh agus méid ag nóid ''Control'', ach tá ancairí acu freisin. Sainmhíníonn anchors an tionscnamh - an pointe tagartha d'imill an nód.
it: **Ancoraggi**: I nodi ``Control`` hanno una posizione e dimensioni, ma hanno anche ancoraggi. Gli ancoraggi definiscono l'origine, ovvero il punto di riferimento per gli spigoli del nodo.
ta: ! நங்கூரங்கள் தோற்றத்தை வரையறுக்கின்றன - முனையின் விளிம்புகளுக்கான குறிப்பு புள்ளி.
tr: **Çapalar:** ``Control`` düğümlerinin bir konumu ve boyutu vardır, ancak aynı zamanda çapaları da vardır. Çapalar, düğümün kenarları için referans noktası olan başlangıç yerini tanımlar.
zh_hant: **錨點 (Anchors)：** ``Control`` 節點除了位置和尺寸之外，還有錨點。錨點定義了原點 - 作為節點邊緣的參考點。

source: Arrange the nodes as shown below. You can drag the nodes to place them manually, or for more precise placement, use "Anchor Presets".
cs: Uspořádejte uzly podobně, jak je znázorněno níže. Uzly můžete přetáhnout a umístit ručně, chcete-li však přesnější umístění kontrolu, použijte "Předvolby ukotvení".
fr: Disposez les nœuds comme affiché ci-dessous. Vous pouvez faire glisser les nœuds pour les placer manuellement ou, pour un placement plus précis, utiliser les "préréglages d'ancre".
ga: Socraigh na nóid mar a thaispeántar thíos. Is féidir leat na nóid a tharraingt chun iad a chur de láimh, nó le haghaidh socrúcháin níos cruinne, bain úsáid as "Anchor Presets".
it: Organizza i nodi come mostrato in seguito. Puoi trascinare i nodi per posizionarli manualmente o, per un posizionamento più preciso, utilizzare le "preimpostazioni di ancoraggio".
ta: கீழே காட்டப்பட்டுள்ளபடி முனைகளை ஏற்பாடு செய்யுங்கள். முனைகளை கைமுறையாக வைக்க நீங்கள் இழுக்கலாம், அல்லது இன்னும் துல்லியமான வேலைவாய்ப்புக்கு, "நங்கூரம் முன்னமைவுகள்" பயன்படுத்தலாம்.
tr: Düğümleri aşağıda gösterildiği gibi düzenleyin. Düğümleri elle yerleştirmek için sürükleyebilir, veya daha hassas yerleştirme için "Çapa Hazır-ayarlarını" kullanabilirsiniz.
zh_hant: 請將節點如下圖排列。拖動節點可以手動放置，也可以使用"錨點預設（Anchor Preset）"進行更精確的定位。

source: ScoreLabel
cs: Popisek skóre (ScoreLabel)
ga: ScórLabel
ta: ச்கோரலேபிள்

source: Add the text ``0``.
cs: Přidejte text ``0``.
fr: Dans l'inspecteur, ajouter le texte ``0``.
ga: Cuir an téacs ''0' leis.
it: Aggiungi il testo ``0``.
ta: `` 0`` என்ற உரையைச் சேர்க்கவும்.
tr: ``0`` metnini ekleyin.
zh_hant: 新增文字 ``0`` 。

source: Set the "Horizontal Alignment" and "Vertical Alignment" to ``Center``.
cs: Nastavte "Horizontální zarovnání" a "Vertikální zarovnání" na ``Uprostřed``.
fr: Dans l'inspecteur, réglez "Alignement horizontal" et "Alignement vertical" sur ``Centre``.
ga: Socraigh an "ailíniú cothrománach" agus "ailíniú ingearach" go ''lár''.
ta: "கிடைமட்ட சீரமைப்பு" மற்றும் "செங்குத்து சீரமைப்பு" ஐ `` சென்டர்`` க்கு அமைக்கவும்.
tr: "Yatay Hizalama" ve "Dikey Hizalama "yı ``Merkez`` olarak ayarlayın.
zh_hant: 將“Horizontal Alignment”和“Vertical Alignment”設定為 ``Center`` 。

source: Choose the "Anchor Preset" ``Center Top``.
cs: Vyberte "Předvolbu ukotvení" ``Uprostřed nahoře``.
fr: Dans l'inspecteur sous "Contrôle - Disposition" ou dans l'espace de travail 2D, choisissez le « Préréglage d'ancrage » ``Centre Haut``.
ga: Roghnaigh an "Anchor Preset" ''Center Top''.
it: Scegli la "preimpostazione di ancoraggio" ``Al centro in alto``.
ta: "நங்கூரம் முன்னமைவு" `` சென்டர் டாப்`` என்பதைத் தேர்வுசெய்க.
tr: "Çapa Ön Ayarı" için ``Merkez Üst`` ögesini seçin.
zh_hant: 為“Anchor Preset”選擇 ``Center Top`` 。

source: Message
cs: Zpráva (Message)
ga: Teachtaireacht
it: Messaggio
ta: செய்தி
zh_hant: 訊息

source: Add the text ``Dodge the Creeps!``.
cs: Přidejte text ``Uhni Hnusákům!``.
fr: Dans l'inspecteur de nœud, ajoutez le texte : ``Dodge the Creeps !``.
ga: Cuir an téacs ''Dodge the Creeps!''.
it: Aggiungi il testo ``Dodge the Creeps!``.
ta: `` க்ரீப்ச்! `` என்ற உரையைச் சேர்க்கவும்.
tr: Bu yazıyı ekleyin ``Dodge the Creeps!``.
zh_hant: 新增文字： ``Dodge the Creeps!``。

source: Set the "Autowrap Mode" to ``Word``, otherwise the label will stay on one line.
cs: Nastavte "Režim automatického zalamování" na ``Slovo``, jinak popisek zůstane na jednom řádku.
fr: Réglez le "Autowrap Mode" sur ``Word``, sinon l'étiquette restera sur une seule ligne.
ga: Socraigh an "Mód Autowrap" go ''Word'', nó fanfaidh an lipéad ar líne amháin.
it: Impostare l'"Autowrap Mode" su ``Word``, altrimenti l'etichetta rimarrà su una riga.
ta: "ஆட்டோவ்ராப் பயன்முறையை" `` சொல்`` ஆக அமைக்கவும், இல்லையெனில் சிட்டை ஒரு வரியில் இருக்கும்.
tr: "Otomatik Sarma Kipi"ni ``Kelime`` olarak ayarlayın, aksi takdirde etiket tek satırda kalacaktır.
zh_hant: 將“Autowrap Mode”設定為 ``Word`` ，否則標籤只會有一行。

source: Under "Control - Layout/Transform" set "Size X" to ``480`` to use the entire width of the screen.
cs: Pod "Control - Rozvržení/Transformace" nastavte "Velikost X" na ``480`` pro využití celé šířky obrazovky.
fr: Sous "Contrôle - Disposition/Transformation", définissez "Taille X" sur ``480`` pour utiliser toute la largeur de l'écran.
ga: Faoi "Rialú - Leagan Amach / Trasfhoirmigh" leagtar "Méid X" go ''480'' chun leithead iomlán an scáileáin a úsáid.
it: In "Control - Layout/Trasform" imposta "Size X" su ``480`` per utilizzare l'intera larghezza dello schermo.
ta: திரையின் முழு அகலத்தையும் பயன்படுத்த "கட்டுப்பாடு - தளவமைப்பு/உருமாற்றம்" கீழ் "அளவு ஃச்" ஐ `` 480`` ஆக அமைக்கவும்.
tr: Ekranın tüm genişliğini kullanmak için "Kontrol - Yerleşim Düzeni/Dönüştür" altında "X Boyutu"nu ``480`` olarak ayarlayın.
zh_hant: 在“Control - Layout/Transform”中將“Size X”設定為 ``480`` ，使用螢幕的完整寬度。

source: Choose the "Anchor Preset" ``Center``.
cs: Vyberte "Předvolbu ukotvení" ``Uprostřed``.
fr: Dans l'espace de travail 2D, choisir le "préréglage d'ancre" ``Centre``.
ga: Roghnaigh an "Anchor Preset" ''Center''.
it: Scegli la "preimpostazione di ancoraggio" ``Al centro``.
ta: "நங்கூரம் முன்னமைவு" `` மையம்`` என்பதைத் தேர்வுசெய்க.
tr: "Çapa Ön Ayarı" için ``Merkez`` i seçin.
zh_hant: 為“Anchor Preset”選擇 ``Center`` 。

source: StartButton
cs: Tlačítko start (StartButton)
ga: TosaighButton
ta: ச்டார்ட் பட்டன்

source: Add the text ``Start``.
cs: Přidejte text ``Spustit``.
fr: Ajoutez le texte ``Start``.
ga: Cuir an téacs ''Tosaigh'' leis.
it: Aggiungi il testo ``Start``.
ta: `` தொடக்க`` என்ற உரையைச் சேர்க்கவும்.
tr: Bu yazıyı ekleyin ``Start``.
zh_hant: 新增文字： ``Start``。

source: Under "Control - Layout/Transform", set "Size X" to ``200`` and "Size Y" to ``100`` to add a little bit more padding between the border and text.
cs: Pod "Control - Rozvržení/Transformace" nastavte "Velikost X" na ``200`` a "Velikost Y" na ``100``, ať trochu odsadíme text od okraje.
fr: Sous "Contrôle - Disposition/Transformation", définissez "Taille X" sur ``200`` et "Taille Y" sur ``100`` pour ajouter un peu plus de remplissage entre la bordure et le texte.
ga: Faoi "Control - Layout/Transform", socraigh "Méid X" go ''200'' agus "Méid Y" go ''100'' chun beagán níos mó stuála a chur idir an teorainn agus an téacs.
it: In "Control - Layout/Transform", imposta "Size X" su ``200`` e "Size Y" su ``100`` per aggiungere un po' più di spaziatura tra il bordo e il testo.
ta: "கட்டுப்பாடு - தளவமைப்பு/உருமாற்றம்" என்பதன் கீழ், எல்லைக்கும் உரைக்கும் இடையில் இன்னும் கொஞ்சம் திணிப்பைச் சேர்க்க "அளவு ஃச்" மற்றும் "அளவு ஒய்" ஆக `` 100`` ஆக அமைக்கவும்.
tr: "Kontrol - Yerleşim Düzeni/Dönüştür" altında, kenarlık ve metin arasına biraz daha fazla dolgu eklemek için "X Boyutu"nu ``200`` ve "Y Boyutu"nu ``100`` olarak ayarlayın.
zh_hant: 在“Control - Layout/Transform”中將“Size X”設定為 ``200``、“Size Y”設定為 ``100``，在邊框和文字之間新增間距。
