Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: Changes will reflect in the editor and will be kept after closing the running project.
cs: Změny se projeví v editoru a budou zachovány i po ukončení běžícího projektu.
fr: Les changements seront répercutés dans l'éditeur et seront conservés après la fermeture du projet en cours.
ga: Léireoidh na hathruithe san eagarthóir agus coinneofar iad tar éis an tionscadal reatha a dhúnadh.
it: Le modifiche si rifletteranno nell'editor e verranno mantenute dopo la chiusura del progetto in esecuzione.
ja: 変更はエディタに反映され、実行プロジェクトを閉じた後も保存されます。
ko: 변경사항은 편집기에 반영되며 실행 중인 프로젝트를 닫은 후에도 유지됩니다.
pl: Zmiany zostaną odzwierciedlone w edytorze i zostaną zachowane po zamknięciu uruchomionego projektu.
ru: Изменения будут отражены в редакторе и будут сохранены после закрытия запущенного проекта.
ta: மாற்றங்கள் எடிட்டரில் பிரதிபலிக்கும் மற்றும் இயங்கும் திட்டத்தை மூடிய பின் வைக்கப்படும்.
tr: Değişiklikler düzenleyiciye yansıtılacak, ve çalışan proje kapatıldıktan sonra da tutulacaktır.

source: Remote inspector.
cs: Vzdálený inspektor.
fr: Inspecteur à distance.
ga: Cigire cianda.
it: Inspector remoto.
ja: リモート インスペクタ。
ko: 원격 인스펙터.
pl: Zdalny inspektor.
ru: Удалённый инспектор.
ta: தொலை இன்ச்பெக்டர்.
tr: Uzaktan denetleyici.

source: Changes won't reflect in the editor and won't be kept after closing the running project.
cs: Změny se neprojeví v editoru a po ukončení běžícího projektu nebudou zachovány.
fr: Les changements ne seront pas répercutés dans l'éditeur et ne seront pas conservés après la fermeture du projet en cours d'exécution.
ga: Ní léireofar athruithe san eagarthóir agus ní choinneofar iad tar éis an tionscadal reatha a dhúnadh.
it: Le modifiche non si rifletteranno nell'editor e non verranno mantenute dopo la chiusura del progetto in esecuzione.
ja: 変更内容はエディタに反映されず、実行中のプロジェクトを閉じた後は保持されません。
ko: 변경사항은 편집기에 반영되지 않으며 실행 중인 프로젝트를 닫은 후에는 유지되지 않습니다.
pl: Zmiany nie zostaną odzwierciedlone w edytorze i nie zostaną zapisane po zamknięciu uruchomionego projektu.
ru: Изменения не будут отражены в редакторе и не будут сохранены после закрытия запущенного проекта.
ta: மாற்றங்கள் எடிட்டரில் பிரதிபலிக்காது, மேலும் இயங்கும் திட்டத்தை மூடிய பிறகு வைக்கப்படாது.
tr: Değişiklikler düzenleyiciye yansıtılmayacak, ve çalışan proje kapatıldıktan sonra da saklanmayacaktır.

source: Live camera replication.
cs: Replikace kamery za běhu.
fr: Réplication de caméra en direct.
ga: Macasamhlú ceamara beo.
it: Replica della telecamera in tempo reale.
ja: 実行時カメラ複製。
ko: 실시간 카메라 복제.
pl: Przejęcie kontroli nad kamerą.
ru: Репликация камеры в режиме реального времени.
ta: நேரடி கேமரா பிரதி.
tr: Canlı kamera çoğaltma.

source: Move the in-editor camera and see the result in the running project.
cs: Přesuňte kameru v editoru a uvidíte výsledek v běžícím projektu.
fr: Déplacez la caméra de l'éditeur et voyez le résultat dans le projet en cours d'exécution.
ga: Bog an ceamara in-eagarthóir agus féach an toradh sa tionscadal reatha.
it: Spostare la telecamera dell'editor e vedi il risultato nel progetto in esecuzione.
ja: エディタ内のカメラを移動し、実行プロジェクトで結果を確認してください。
ko: 편집기 내 카메라를 움직여 실행 중인 프로젝트에서 결과를 봅니다.
pl: Ruszanie kamerą w edytorze wpływa na kamerę w uruchomionym projekcie.
ru: Переместите камеру в редакторе и посмотрите результат в запущенном проекте.
ta: இன்-எடிட்டர் கேமராவை நகர்த்தி, இயங்கும் திட்டத்தின் முடிவைக் காண்க.
tr: Düzenleyici-içi kamerayı hareket ettirin ve çalışan projede sonucu görün.

source: Built-in offline class reference documentation.
cs: Vestavěná offline dokumentace tříd.
fr: Documentation de référence de classe hors ligne intégrée.
ga: Doiciméadú tagartha ranga as líne tógtha.
it: Documentazione di riferimento delle classi offline integrata.
ja: 内蔵かつオフラインで読めるクラスリファレンスドキュメント。
ko: 내장 오프라인 클래스 참조 문서.
pl: Wbudowane odnośniki do klas w dokumentacji offline.
ru: Встроенная оффлайн документация класса.
ta: உள்ளமைக்கப்பட்ட இணைப்பில்லாத வகுப்பு குறிப்பு ஆவணங்கள்.
tr: Yerleşik çevrimdışı sınıf başvuru belgeleri.

source: Use the editor in dozens of languages contributed by the community.
cs: Používejte editor v desítkách jazyků přispěných komunitou.
fr: Utilisez l'éditeur dans des dizaines de langues fournies par la communauté.
ga: Bain úsáid as an eagarthóir i mórán teangacha a chuireann an pobal ar fáil.
it: Usa l'editor in svariate lingue fornite dalla community.
ja: コミュニティによって翻訳された数十の言語にてエディタを使用できます。
ko: 커뮤니티에서 기여한 수십 가지 언어로 편집기를 사용하세요.
pl: Używaj edytora w dziesiątkach języków dodanych przez społeczność.
ru: Используйте редактор на десятках языков, предоставленных сообществом.
ta: சமூகத்தால் பங்களித்த டசன் கணக்கான மொழிகளில் எடிட்டரைப் பயன்படுத்தவும்.
tr: Düzenleyiciyi, topluluğun katkıda bulunduğu, düzinelerce dilde kullanın.

source: **Plugins:**
cs: **Zásuvné moduly:**
ga: ** Breiseáin:**
ja: **プラグイン:**
ko: **플러그인:**
pl: **Wtyczki:**
ru: **Плагины:**
ta: ** செருகுநிரல்கள்: **
tr: **Eklentiler:**

source: Editor plugins can be downloaded from the :ref:`asset library <doc_what_is_assetlib>` to extend editor functionality.
cs: Zásuvné moduly pro rozšíření funkcí editoru lze stáhnout z :ref:`knihovny zdrojů <doc_what_is_assetlib>`.
fr: Les plugins de l'éditeur peuvent être téléchargés depuis la :ref:`bibliothèque de ressources <doc_what_is_assetlib>` pour étendre les fonctionnalités de l'éditeur.
ga: Is féidir forlíontáin eagarthóireachta a íoslódáil ón :ref:`leabharlann sócmhainní <doc_what_is_assetlib>` chun feidhmiúlacht an eagarthóra a leathnú.
it: Le estensioni dell'editor si possono scaricare dalla :ref:`Libreria dei contenuti <doc_what_is_assetlib>` per estendere la funzionalità dell'editor.
ja: :ref:`アセット ライブラリ <doc_what_is_assetlib>`\ からエディタプラグインをダウンロードして、エディタの機能を拡張することができます。
ko: 편집기 플러그인은 :ref:`애셋 라이브러리 <doc_what_is_assetlib>`\ 에서 다운로드받아 편집기 기능을 확장할 수 있습니다.
pl: Wtyczki edytora można pobrać z :ref:'biblioteki zasobów <doc_what_is_assetlib>', aby rozszerzyć funkcjonalność edytora.
ru: Плагины редактора можно загрузить из :ref:`библиотеки ресурсов <doc_what_is_assetlib>` для расширения функциональности редактора.
ta: எடிட்டர் செருகுநிரல்களை பதிவிறக்கம் செய்யலாம்: ref: `சொத்து நூலகம் <doc_what_is_assetlib>` எடிட்டர் செயல்பாட்டை நீட்டிக்க.
tr: Düzenleyicinin işlevselliğini arttırmak için, :ref:`varlık kütüphanesi <doc_what_is_assetlib>` 'nden düzenleyici eklentileri indirilebilir.

source: :ref:`Create your own plugins <doc_making_plugins>` using GDScript to add new features or speed up your workflow.
cs: :ref:`Vytvářejte si vlastní pluginy <doc_making_plugins>` v GDScriptu pro nové funkce nebo urychlení své práce.
fr: :ref:`Créez vos propres plugins <doc_making_plugins>` en utilisant GDScript pour ajouter de nouvelles fonctionnalités ou accélérer votre flux de travail.
ga: :ref:`Cruthaigh do chuid breiseán féin <doc_making_plugins>` ag úsáid GDScript chun gnéithe nua a chur leis nó chun do shreabhadh oibre a bhrostú.
it: :ref:`Crea i tuoi plugin <doc_making_plugins>` usando GDScript per aggiungere nuove funzionalità o velocizzare il tuo flusso di lavoro.
ja: 新しい機能を追加したりワークフロー高速化するために、GDScript を使用して\ :ref:`独自のプラグインを作成し<doc_making_plugins>`\てください。
ko: 새로운 플러그인을 추가하기 위해 GDScript를 사용하여 :ref:`자신의 플러그인 생성 <doc_making_plugins>`.
pl: :ref:`Twórz swoje własne wtyczki <doc_making_plugins>` wykorzystując GDScript, by dodać nowe funkcjonalności lub przyspieszyć swoją pracę.
ru: :ref:`Создавайте свои собственные плагины <doc_making_plugins>` с помощью GDScript для добавления новых возможностей или ускорения вашего процесса работы.
ta: :ref:`Create your own செருகுநிரல்கள் <doc_making_plugins>` using GDScript பெறுநர் கூட்டு புதிய நற்பொருத்தங்கள் or விரைவு மேலே your workflow.
tr: Yeni özellikler eklemek veya iş akışınızı hızlandırmak için GDScript'i kullanarak :ref:`kendi eklentilerinizi oluşturun <doc_making_plugins>`.

source: :ref:`Download projects from the asset library <doc_using_assetlib_editor>` in the Project Manager and import them directly.
cs: :ref:`Stáhněte si projekty z knihovny zdrojů <doc_using_assetlib_editor>` ve Správci projektů a obratem je naimportujte.
fr: :ref:`Téléchargez les projets depuis la bibliothèque de ressources <doc_using_assetlib_editor>` dans le gestionnaire de projet et importez-les directement.
ga: :ref:`Íoslódáil tionscadail ón leabharlann sócmhainní <doc_using_assetlib_editor>` sa Bhainisteoir Tionscadail agus iompórtáil go díreach iad.
it: :ref:`Scarica progetti dalla libreria dei contenuti <doc_using_assetlib_editor>` nel Gestore dei progetti e importali direttamente.
ja: プロジェクトマネージャーの :ref:`アセットライブラリからプロジェクトをダウンロード <doc_using_assetlib_editor>` し、直接インポートします。
ko: 프로젝트 매니저의 :ref:`애셋 라이브러리에서 프로젝트를 다운로드 <doc_using_assetlib_editor>`\ 하고 직접 가져옵니다.
pl: :ref:`Pobierz projekty z biblioteki zasobów <doc_using_assetlib_editor>` w Menadżerze Projektów i importuj je bezpośrednio.
ru: :ref:`Загрузите проекты из библиотеки ресурсов <doc_using_assetlib_editor>` в менеджер проектов и импортируйте их напрямую.
ta: :ref:`Download திட்டங்கள் இருந்து the சொத்துடைமை library <doc_using_assetlib_editor>` in the திட்டம் Manager and இறக்குமதி them directly.
tr: Proje yöneticisindeki :ref:`varlık kitaplığından proje indirin <doc_using_assetlib_editor>` ve doğrudan içe aktarın.

source: Rendering
cs: Vykreslování
fr: Rendu
ga: Rindreáil
it: Renderer
ja: レンダリング
ko: 렌더링
pl: Renderowanie
ru: Отрисовка
ta: வழங்குதல்
tr: İşleme

source: Godot 4 includes three renderers:
cs: Godot 4 zahrnuje tři vykreslovací nástroje:
fr: Godot 4 comprend trois moteurs de rendu :
it: Godot 4 include tre renderer:
ja: Godot 4には3つのレンダラーが含まれています。
ko: Godot 4에는 세 가지 렌더러가 포함되어 있습니다:
pl: Godot 4 zawiera trzy renderery:
ru: Godot 4 включает в себя три рендера:
ta: கோடோட் 4 மூன்று ரெண்டரர்களை உள்ளடக்கியது:

source: **Forward+**. The most advanced renderer, suited for desktop platforms only. Used by default on desktop platforms. This renderer uses **Vulkan**, **Direct3D 12**, or **Metal** as the rendering driver, and it uses the **RenderingDevice** backend.
cs: **Forward+**. Nejpokročilejší vykreslovací nástroj, vhodný pouze pro desktopové platformy. Ve výchozím nastavení se používá na desktopových platformách. Tento nástroj používá jako ovladač vykreslování **Vulkan**, **Direct3D 12** nebo **Metal** a používá backend **RenderingDevice**.
fr: **Forward+**. Le moteur de rendu le plus avancé, adapté uniquement aux plateformes de bureau. Utilisé par défaut sur les plateformes de bureau. Ce moteur de rendu utilise **Vulkan**, **Direct3D 12**, ou **Metal** comme pilote de rendu, et il utilise le backend **RenderingDevice**.
it: **Forward+**. Il renderer più avanzato, adatto solo a piattaforme desktop. Utilizzato come predefinito sulle piattaforme desktop. Questo renderer utilizza **Vulkan**, **Direct3D 12** o **Metal** come driver di rendering e si basa sul backend **RenderingDevice**.
ja: **Forward+** 。デスクトッププラットフォーム専用の最も高度なレンダラー。デスクトッププラットフォームではデフォルトで使用されます。このレンダラーは、レンダリングドライバーとして **Vulkan** 、 **Direct3D 12** 、または **Metal** を使用し、 **RenderingDevice** バックエンドを使用します。
ko: **Forward+**. 데스크톱 플랫폼에만 적합한 가장 고급 렌더러입니다. 데스크톱 플랫폼에서는 기본으로 사용됩니다. 이 렌더러는 **Vulkan**, **Direct3D 12**, 또는 **Metal**\ 을 렌더링 드라이버로 사용하며, **RenderingDevice** 백엔드를 사용합니다.
pl: **Forward+**. Najbardziej zaawansowany renderer, tylko dla platform desktopowych. Domyślnie używany na platformach desktopowych. Używa on **Vulkan**, **Direct3D 12**, lub **Metal** jako silnika renderowania używając backendu **Rendering device**.
ru: **Forward+**. Самый продвинутый рендерер, подходящий только для настольных платформ. Используется по умолчанию на настольных платформах. Этот рендерер использует **Vulkan**, **Direct3D 12**, или **Metal** в качестве драйвера рендеринга, и использует бэкенд **RenderingDevice**.
ta: ** முன்னோக்கி+**. மிகவும் மேம்பட்ட ரெண்டரர், டெச்க்டாப் தளங்களுக்கு மட்டுமே பொருத்தமானது. டெச்க்டாப் இயங்குதளங்களில் இயல்பாக பயன்படுத்தப்படுகிறது. இந்த ரெண்டரர் ** வல்கன் **, ** டைரக்ட் 3 டி 12 **, அல்லது ** மெட்டல் ** ஐ வழங்குதல் டிரைவராகப் பயன்படுத்துகிறது, மேலும் இது ** வழங்குதல் டெவிச் ** பின்தளத்தில் பயன்படுத்துகிறது.

source: **Mobile**. Fewer features, but renders simple scenes faster. Suited for mobile and desktop platforms. Used by default on mobile platforms. This renderer uses **Vulkan**, **Direct3D 12**, or **Metal** as the rendering driver, and it uses the **RenderingDevice** backend.
cs: **Mobile**. Méně funkcí, ale vykresluje jednoduché scény rychleji. Vhodné pro mobilní a desktopové platformy. Ve výchozím nastavení se používá na mobilních platformách. Tento nástroj používá jako ovladač vykreslování **Vulkan**, **Direct3D 12** nebo **Metal** a používá backend **RenderingDevice**.
fr: **Mobile**. Moins de fonctionnalités, mais rend des scènes simples plus rapidement. Adapté aux plateformes mobiles et de bureau. Utilisé par défaut sur les plateformes mobiles. Ce rendu utilise **Vulkan**, **Direct3D 12**, ou **Metal** comme pilote de rendu, et il utilise le backend **RenderingDevice**.
it: **Mobile**. Meno funzionalità, ma renderizza scene semplici più velocemente. Adatto a piattaforme mobili e desktop. Utilizzato come predefinito sulle piattaforme mobili. Questo renderer utilizza **Vulkan**, **Direct3D 12** o **Metal** come driver di rendering e si basa sul backend **RenderingDevice**.
ja: **モバイル** 。機能は少ないが、シンプルなシーンをより速くレンダリングします。モバイルおよびデスクトッププラットフォームに適しています。モバイルプラットフォームではデフォルトで使用されます。このレンダラーは、レンダリングドライバーとして **Vulkan** 、 **Direct3D 12** 、または **Metal** を使用し、 **RenderingDevice** バックエンドを使用します。
ko: **모바일**. 기능은 적지만 단순한 씬을 더 빠르게 렌더링합니다. 모바일 및 데스크톱 플랫폼에 적합합니다. 모바일 플랫폼에서는 기본으로 사용됩니다. 이 렌더러는 **Vulkan**, **Direct3D 12**, 또는 **Metal**\ 을 렌더링 드라이버로 사용하며, **RenderingDevice** 백엔드를 사용합니다.
pl: **Mobile**. Mniej funkcjonalności, lecz renderuje małe sceny szybciej. Przygotowany pod platformy mobilne i desktopowe. Używa **Vulkan**, **Direct3D 12**, lub **Metal** jako silnika renderowania, oraz **RenderingDevice** backendu.
ru: **Mobile**. Меньше возможностей, однако рендерит простые сцены быстрее. Предназначен для мобильных и настольных платформ. Используется по умолчанию на мобильных платформах. Этот рендерер использует **Vulkan**, **Direct3D 12**, или **Metal** в качестве драйвера рендеринга, и **RenderingDevice** как бэкенд.
ta: ** மொபைல் **. குறைவான நற்பொருத்தங்கள், ஆனால் எளிய காட்சிகளை வேகமாக வழங்குகின்றன. மொபைல் மற்றும் டெச்க்டாப் தளங்களுக்கு ஏற்றது. மொபைல் தளங்களில் இயல்பாக பயன்படுத்தப்படுகிறது. இந்த ரெண்டரர் ** வல்கன் **, ** டைரக்ட் 3 டி 12 **, அல்லது ** மெட்டல் ** ஐ வழங்குதல் டிரைவராகப் பயன்படுத்துகிறது, மேலும் இது ** வழங்குதல் டெவிச் ** பின்தளத்தில் பயன்படுத்துகிறது.

source: **Compatibility**, sometimes called **GL Compatibility**. The least advanced renderer, suited for low-end desktop and mobile platforms. Used by default on the web platform. This renderer uses **OpenGL** as the rendering driver.
cs: **Compatibility**, někdy nazývaný **GL Compatibility**. Nejméně pokročilý vykreslovací nástroj, vhodný pro nízkovýkonné desktopové a mobilní platformy. Ve výchozím nastavení se používá na webové platformě. Tento náastroj používá jako ovladač vykreslování **OpenGL**.
fr: **Compatibilité**, parfois appelé **Compatibilité GL**. Le moteur de rendu le moins avancé, adapté aux plateformes de bureau bas de gamme et aux plateformes mobiles. Utilisé par défaut sur la plateforme web. Ce moteur de rendu utilise **OpenGL** comme driver de rendu.
it: **Compatibilità**, talvolta chiamato **Compatibilità GL**. Il renderer meno avanzato, adatto a piattaforme desktop e mobili di fascia bassa. Utilizzato come predefinito sulla piattaforma web. Questo renderer utilizza **OpenGL** come driver di rendering.
ja: **互換性** (**GL互換** と呼ばれることもあります)。最も低機能なレンダラーで、ローエンドのデスクトップおよびモバイル プラットフォームに適しています。Web プラットフォームではデフォルトで使用されます。このレンダラーはレンダリングドライバーとして **OpenGL** を使用します。
ko: **호환성**, 때때로 **GL 호환성**\ 이라고도 불립니다. 가장 덜 발전된 렌더러로, 저사양 데스크톱 및 모바일 플랫폼에 적합합니다. 웹 플랫폼에서는 기본으로 사용됩니다. 이 렌더러는 **OpenGL**\ 을 렌더링 드라이버로 사용합니다.
pl: **Kompatybilny**, czasami nazywany **GL Kompatybilny**. Najmniej zaawansowany renderer, odpowiedni dla low-endowych platform desktopowych i mobilnych. Używany domyślnie na platformie webowej. Ten renderer używa **OpenGL** jako sterownika renderowania.
ru: **Compatibility**, работает на OpenGL 3.3/OpenGL ES 3.0/WebGL 2.0. Наименее продвинутый графический отрисовщик, подходящий для бюджетных настольных и мобильных устройств. Используется по умолчанию на веб-платформе.
ta: ** பொருந்தக்கூடிய தன்மை **, சில நேரங்களில் ** gl பொருந்தக்கூடிய தன்மை ** என்று அழைக்கப்படுகிறது. குறைந்த-இறுதி டெச்க்டாப் மற்றும் மொபைல் தளங்களுக்கு ஏற்றது. வலை இயங்குதளத்தில் இயல்பாக பயன்படுத்தப்படுகிறது. இந்த ரெண்டரர் ** ஓபன்சிஎல் ** ஐ வழங்குதல் டிரைவராகப் பயன்படுத்துகிறார்.

source: See :ref:`doc_renderers` for a detailed comparison of the rendering methods.
cs: Podrobné srovnání vykreslovacích metod najdete v :ref:`doc_renderers`.
fr: Voir :ref:`doc_renderers` pour une comparaison détaillée des méthodes de rendu.
it: Vedasi :ref:`doc_renderers` per un confronto dettagliato dei vari metodi di rendering.
ja: ハードウェアおよびソフトウェアのバージョン要件に関する情報は :ref:`doc_renderers` を参照してください。
ko: 렌더링 메서드의 자세한 비교는 :ref:`doc_renderers`\ 를 참조하세요.
pl: Zobacz :ref:`doc_renderers` po szczegółowe porównanie metod renderowania.
ru: См. :ref:`doc_renderers`, для детального сравнения методов рендера.
ta: காண்க: குறிப்பு: வழங்குதல் முறைகளின் விரிவான ஒப்பீட்டிற்கு `doc_renderers`.

source: 2D graphics
cs: 2D grafika
fr: Graphismes 2D
ga: Grafaicí 2T
it: Grafica 2D
ja: 2Dグラフィックス
ko: 2D 그래픽
pl: Grafika 2D
ru: 2D графика
ta: 2 டி கிராபிக்ச்
tr: 2B grafikler

source: Sprite, polygon and line rendering.
cs: Vykreslování spritů, polygonů a čar.
fr: Rendu de sprite, polygone et ligne.
ga: Sprite, polagán agus rindreáil líne.
it: Rendering di Sprite, poligoni e linee .
ja: スプライト、ポリゴン、ラインのレンダリング。
ko: 스프라이트, 폴리곤 및 직선 렌더링.
pl: Renderowanie duszków, wielokątów i linii.
ru: Рендеринг линий, полигонов и спрайтов.
ta: ச்பிரிட், பலகோணம் மற்றும் வரி வழங்குதல்.
tr: Grafik öge (sprite), çokgen, ve çizgi işleme.

source: High-level tools to draw lines and polygons such as :ref:`class_Polygon2D` and :ref:`class_Line2D`, with support for texturing.
cs: Vysokoúrovňové nástroje pro kreslení čar a mnohoúhelníků, jako například :ref:`class_Polygon2D` a :ref:`class_Line2D` s podporou texturování.
fr: Des outils de haut niveau pour dessiner des lignes et des polygones tels que :ref:`class_Polygon2D` et :ref:`class_Line2D`, avec un support pour la texturisation.
ga: Uirlisí ardleibhéil chun línte agus polagáin a tharraingt, mar shampla :ref:'class_Polygon2D' agus :ref:'class_Line2D', le tacaíocht do théacsáil.
it: Strumenti di alto livello per disegnare linee e poligoni come :ref:`class_Polygon2D` e :ref:`class_Line2D`, con supporto per le texture.
ja: :ref:`class_Polygon2D` や :ref:`class_Line2D` のような線やポリゴンを描くための高レベルなツールのテクスチャリングへの対応。
ko: :ref:`class_Polygon2D` 와 :ref:`class_Line2D` 같은 직선이나 폴리곤을 그리는 고수준 툴. 텍스처링도 지원합니다.
pl: Wysoko-poziomowe narzędzia do rysowania linii i wielokątów, takie jak :ref:`class_Polygon2D` i :ref:`class_Line2D` ze wsparciem dla teksturowania.
ru: Инструменты высокого уровня для рисования линий и полигонов, такие как :ref:`class_Polygon2D` и :ref:`class_Line2D`, с поддержкой текстурирования.
ta: போன்ற கோடுகள் மற்றும் பலகோணங்களை வரைய உயர் மட்ட கருவிகள்: ref: `class_polygon2d` மற்றும்: ref:` class_line2d`, அமைப்புக்கான ஆதரவுடன்.
tr: Çizgileri ve poligonları, dokulandırma desteği ile, çizmek için üst-düzey araçlar: :ref:`class_Polygon2D` ve :ref:`class_Line2D` gibi.

source: AnimatedSprite2D as a helper for creating animated sprites.
cs: AnimatedSprite2D jako pomocník při vytváření animovaných spritů.
fr: AnimatedSprite2D comme un assistant à la création de sprites animés.
ga: BeoiteSprite2D mar chuiditheoir chun sprites beoite a chruthú.
it: AnimatedSprite2D come supporto per la creazione di sprite animati.
ja: アニメーションするスプライトを作るのに役立つAnimatedSprite2D。
ko: 애니메이션 스프라이트 제작 도우미 AnimatedSprite2D.
pl: AnimatedSprite2D jako pomoc przy tworzeniu animowanych sprite'ów.
ru: AnimatedSprite2D в качестве помощника для создания анимированных спрайтов.
ta: அனிமேசன் செய்யப்பட்ட உருவங்களை உருவாக்குவதற்கான உதவியாளராக அனிமேசன்ச்பிரைட் 2 டி.
tr: Canlandırmalı resimcikler oluşturmak için CanlandırmaResimcik2B (AnimatedSprite2D) yardımcı aracı.

source: Parallax layers.
cs: Paralaxní vrstvy.
fr: Couches de parallaxe.
ga: Sraitheanna Parallax.
it: Livelli di parallasse.
ja: 視差レイヤー。
ko: 패럴랙스 레이어.
pl: Płótna.
ru: Слои параллакса.
ta: இடமாறு அடுக்குகள்.
tr: Iraklık açısı (paralaks) katmanları.

source: Pseudo-3D support including preview in the editor.
cs: Podpora pseudo-3D zobrazení, včetně náhledu v editoru.
fr: Pseudo-3D supportée incluant un aperçu dans l'éditeur.
ga: Tacaíocht Pseudo-3D lena n-áirítear réamhamharc san eagarthóir.
it: Supporto pseudo-3D, compresa l'anteprima nell'editor.
ja: エディタでのプレビューを含む疑似3Dサポート。
ko: 편집기의 미리보기를 포함한 Pseudo-3D 지원.
pl: Obsługa pseudo-3D wraz z podglądem w edytorze.
ru: Поддержка псевдо-3D графики с предпросмотром в редакторе.
ta: எடிட்டரில் முன்னோட்டம் உட்பட போலி -3 டி உதவி.
tr: Düzenleyicide önizlemesi dahil, sözde-3D desteği.

source: :ref:`2D lighting <doc_2d_lights_and_shadows>` with normal maps and specular maps.
cs: :ref:`2D osvětlení <doc_2d_lights_and_shadows>` s normálovými a zrcadlovými mapami.
fr: :ref:`Éclairage 2D <doc_2d_lights_and_shadows>` avec une carte normale et une carte spéculaire.
ga: :ref:`Soilsiú 2D <doc_2d_lights_and_shadows>` le gnáthléarscáileanna agus léarscáileanna amhantrach.
it: :ref:`Illuminazione 2D <doc_2d_lights_and_shadows>` con mappe normal e speculari.
ja: 法線マップとスペキュラマップによる :ref:`2Dライティング <doc_2d_lights_and_shadows>` 。
ko: 노멀 맵과 스페큘러 맵을 이용한 :ref:`2D 조명 <doc_2d_lights_and_shadows>`.
pl: :ref:` Oświetlenie 2D <doc_2d_lights_and_shadows>` z mapami normalnymi i mapami lustrzanymi.
ru: :ref:`2D освещение <doc_2d_lights_and_shadows>` с картами нормалей и отражений.
tr: Normal haritaları ve yansıtıcı haritalar ile :ref:`2B aydınlatma <doc_2d_lights_and_shadows>`.

source: Point (omni/spot) and directional 2D lights.
cs: Bodová (všesměrová/bodová) a směrová 2D světla.
fr: Lumières ponctuelles (omnidirectionnelles/spot) et directionnelles 2D.
ga: Pointe (omni / spota) agus soilse directional 2D.
it: Luci puntiformi (omnidirezionali/spot) e direzionali 2D.
ja: 点(全方位(omni)/スポット(spot))と指向性(Directional)の2Dライト。
ko: 전방위 점 조명, 스팟 점 조명, 방향성 2D 조명.
pl: Punktowe (dookólne/miejscowe) i kierunkowe światła 2D.
ru: Точечное (всенаправленное/прожекторное) и направленное 2D освещение.
ta: புள்ளி (ஓம்னி/ச்பாட்) மற்றும் திசை 2 டி விளக்குகள்.
tr: Noktasal (Her-yönlü/benek) ve yönlü 2B ışıklar.

source: Hard or soft shadows (adjustable on a per-light basis).
cs: Tvrdé a měkké stíny (nastavitelné pro jednotlivá světla).
fr: Ombres dures ou douces (réglables en fonction de chaque lumière).
ga: Scáthanna crua nó boga (inchoigeartaithe in aghaidh an tsolais).
it: Ombre nette o sfumate (regolabili per ogni luce).
ja: ハードシャドウやソフトシャドウ(ライトごとに調整できます)。
ko: 딱딱하거나 부드러운 그림자 (조명 단위로 조정 가능).
pl: Twarde lub miękkie cienie (regulowane na podstawie światła).
ru: Жесткие или мягкие тени (изменяются для каждого источника).
ta: கடினமான அல்லது மென்மையான நிழல்கள் (ஒரு ஒளி அடிப்படையில் சரிசெய்யக்கூடியவை).
tr: Sert veya yumuşak gölgeler (her bir ışık bazında ayarlanabilir).
