Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: Screen-space ambient occlusion (SSAO) at half or full resolution.
cs: Okolní zastínění v prostoru obrazovky (SSAO) při polovičním nebo plném rozlišení.
fr: Occlusion ambiante en espace d'écran (SSAO) à demi ou pleine résolution.
ga: Occlusion comhthimpeallach spás scáileáin (SSAO) ag leathtaifeach nó lántaifeach.
it: Occlusione ambientale nello spazio dello schermo (SSAO) a metà o piena risoluzione.
ja: 半分または完全解像度によるスクリーン空間アンビエントオクルージョン (SSAO)。
ko: 절반 또는 전체 해상도의 스크린 스페이스 앰비언트 오클루전(SSAO).
ru: Окружающая окклюзия экранного пространства (SSAO) при половинном или полном разрешении.
ta: திரை-விண்வெளி சுற்றுப்புற மறைவு (SSAO) பாதி அல்லது முழு தெளிவுத்திறனில்.
tr: Yarım veya tam çözünürlükte ekran-uzayı çevresel perdelemesi (SSAO).

source: Glow/bloom with optional bicubic upscaling and several blend modes available: Screen, Soft Light, Add, Replace, Mix.
cs: Záře/bloom s volitelným bikubickým zvětšením a několika dostupnými režimy prolnutí: Screen, Soft Light, Add, Replace, Mix.
fr: Effet d'éblouissement /de flou lumineux avec mise à l'échelle bicubique en option et plusieurs modes de fusion disponibles : Écran, Lumière Douce, Ajouter, Remplacer, Mélanger.
ga: Glow / bloom le upscaling bicubic roghnach agus roinnt modhanna cumaisc ar fáil: Scáileán, Solas Bog, Cuir, Ionadaigh, Meascán.
ja: オプションのバイキュービック アップスケーリング付きのグロー / ブルームと、複数のブレンドモード: スクリーン、ソフトライト、追加、置換、ミックス。
ko: 선택적 바이큐빅 업스케일링 및 각종 블렌딩 모드(Screen, Soft Light, Add, Replace, Mix)를 사용하는 글로우/블룸 효과.
pl: Blask z opcjonalnym dwu-sześciennym skalowaniem i kilkoma typami mieszania: Ekran(Screen), Miękkie światło(Soft Light), Dodaj(Add), Zamień(Replace), Mieszany(Mix).
ru: Свечение c возможностью бикубического увеличения разрешения и несколькими доступными режимами смешивания: Screen (Экранный), Soft Light (Мягкий свет), Add (Добавление), Replace (Замена), Mix (Смешивание).
ta: விருப்பமான பிக்யூபிக் அப்ச்கேலிங் மற்றும் பல கலப்பு முறைகள் மூலம் பளபளப்பு/பூக்கும்: திரை, மென்மையான ஒளி, சேர், மாற்ற, கலக்க.
tr: İsteğe bağlı çift-küpsel üst-ölçekleme ve çeşitli harmanlama modları ile ışıltı/parlama: Ekran, Yumuşak Işık, Ekle, Değiştir, Karıştır.

source: Glow can have a colored dirt map texture, acting as a lens dirt effect.
cs: Záře může mít barevnou texturu mapy nečistot, která působí jako efekt znečištění čočky.
fr: Glow peut avoir une texture de carte de saleté colorée, agissant comme un effet de lentille sale.
ga: Is féidir uigeacht léarscáil salachar daite a bheith ag Glow, ag gníomhú mar éifeacht salachar lionsa.
ja: グローには色付きの汚れマップテクスチャを適用でき、レンズの汚れ効果として使えます。
ko: 글로우에는 렌즈 먼지 효과처럼 작용하는 컬러 더트 맵 텍스처를 사용할 수 있습니다.
ru: Свечение может иметь окрашенную текстуру карты грязи, действующую как эффект загрязнения линзы.
ta: பளபளப்பு ஒரு வண்ண அழுக்கு வரைபட அமைப்பைக் கொண்டிருக்கலாம், இது லென்ச் அழுக்கு விளைவாக செயல்படுகிறது.
tr: Işıltı, mercek kiri efekti olarak işlev gören, renkli bir kir haritası dokusuna sahip olabilir.

source: Glow can be :ref:`used as a screen-space blur effect <doc_environment_and_post_processing_using_glow_to_blur_the_screen>`.
cs: Záře lze :ref:`použít jako efekt rozostření prostoru obrazovky <doc_environment_and_post_processing_using_glow_to_blur_the_screen>`.
fr: La lueur peut être :ref:`utilisée comme un effet de flou de la taille de l'écran <doc_environment_and_post_processing_using_glow_to_blur_the_screen>`.
ga: Is féidir glow a :ref: `a úsáid mar éifeacht doilithe scáileáin-spáis <doc_environment_and_post_processing_using_glow_to_blur_the_screen>`.
ja: グローは :ref:`スクリーン スペースのブラー効果 <doc_environment_and_post_processing_using_glow_to_blur_the_screen>` として使用できます。
ko: 글로우는 :ref:`스크린 공간 블러 효과 <doc_environment_and_post_processing_using_glow_to_blur_the_screen>`\ 로 사용할 수 있습니다.
ru: Свечение можно :ref:`использовать в качестве эффекта размытия <doc_environment_and_post_processing_using_glow_to_blur_the_screen>`.
ta: பளபளப்பு இருக்க முடியும்: குறிப்பு: `ஒரு திரை-இட மங்கலான விளைவாகப் பயன்படுத்தப்படுகிறது <doc_enveronment_and_post_processing_using_glow_to_blur_the_screen>`.
tr: Işıltı, :ref:`ekran alanı bulanıklaştırma efekti <doc_environment_and_post_processing_using_glow_to_blur_the_screen>` olarak kullanılabilir.

source: Color correction using a one-dimensional ramp or a 3D LUT texture.
cs: Korekce barev pomocí jednorozměrného gradientu nebo 3D LUT textury.
fr: Correction des couleurs à l'aide d'une rampe unidimensionnelle ou d'une texture LUT tridimensionnelle .
ga: Ceartú datha ag baint úsáide as rampa aontoiseach nó uigeacht LUT 3D.
it: Correzione del colore mediante una rampa unidimensionale o una texture LUT 3D.
ja: 1次元の諧調か3D LUTテクスチャによる色補正。
ko: 1차원 램프 또는 3D LUT 텍스처를 사용하는 색 교정.
ru: Коррекция цвета с использованием одномерной рамп-функции (линейно-временной функции) или текстуры 3D LUT.
ta: ஒரு பரிமாண வளைவு அல்லது 3D LUT அமைப்பைப் பயன்படுத்தி வண்ண திருத்தம்.
tr: Tek boyutlu bir rampa veya 3D LUT dokusu kullanarak renk düzeltme.

source: Roughness limiter to reduce the impact of specular aliasing.
cs: Omezovač hrubosti pro snížení vlivu aliasingu zrcadlení.
fr: Limiteur de rugosité pour réduire l'impact du crénelage spéculaire.
ga: Limiter roughness chun tionchar ailiasáil specular a laghdú.
it: Limitatore di rugosità per ridurre l'impatto dell'aliasing speculare.
ja: スペキュラ・エイリアシングの影響を低減するためのラフネス・リミッタ。
ko: 스페큘러 에일리어싱의 영향을 줄이기 위한 거칠기 제한 기능.
ru: Ограничитель значения шероховатости для уменьшения влияния отраженного алиасинга.
ta: ஏகப்பட்ட மாற்றுப்பெயரின் தாக்கத்தை குறைக்க கடினத்தன்மை வரம்பு.
tr: Yansıtıcı örtüşmenin etkisini azaltmak için pürüzlülük sınırlayıcı.

source: Brightness, contrast and saturation adjustments.
cs: Nastavení jasu, kontrastu a sytosti.
fr: Réglages de la luminosité, du contraste et de la saturation.
ga: Gile, codarsnacht agus coigeartuithe saturation.
it: Regolazione della luminosità, contrasto e saturazione.
ja: 明るさ、コントラスト、彩度の調整。
ko: 밝기, 대비 및 채도 조정.
pl: Dostosowanie jasności, kontrastu oraz nasycenia.
ru: Регулирование яркости, контрастности и насыщенности.
ta: ஒளி, மாறுபாடு மற்றும் செறிவு சரிசெய்தல்.
tr: Parlaklık, kontrast ve doygunluk ayarları.

source: **Texture filtering:**
cs: **Filtrování textur:**
fr: **Filtrage de texture :**
ga: **Scagadh uigeachta:**
it: **Filtraggio delle texture:**
ja: **テクスチャ フィルタリング:**
ko: **텍스처 필터링:**
pl: **Filtrowanie tekstur:**
ru: **Фильтрация текстур:**
ta: ** அமைப்பு வடிகட்டுதல்: **
tr: **Doku filtreleme:**

source: Nearest, bilinear, trilinear or anisotropic filtering.
cs: Nejbližší, bilineární, trilineární nebo anizotropní filtrování.
fr: Filtrage au plus proche, bilinéaire, trilinéaire ou anisotrope.
ga: Scagadh is gaire, bilinear, trilinear nó anisotropic.
it: Filtraggio per vicinanza, bilineare, trilineare o anisotropico.
ja: ニアレスト、バイリニア、トリリニア、または異方性のフィルタリング。
ko: 근접, 이중선형, 삼중선형 또는 비등방성 필터링.
pl: Filtrowanie, bliskie, dwuliniowe, trójliniowe lub anizotropiczne.
ru: Ближайшая, билинейная, трилинейная или анизотропная фильтрация.
ta: அருகிலுள்ள, பிலினியர், ட்ரிலினியர் அல்லது அனிசோட்ரோபிக் வடிகட்டுதல்.
tr: En yakın, çift-doğrusal, üç-doğrusal veya eşyönsüz filtreleme.

source: Filtering options are defined on a per-use basis, not a per-texture basis.
cs: Možnosti filtrování jsou definovány pro jednotlivá použití, nikoli pro jednotlivé textury.
fr: Les options de filtrage sont définies en fonction de l'utilisation, et non en fonction de la texture.
ga: Sainmhínítear roghanna scagtha ar bhonn in aghaidh na húsáide, ní ar bhonn in aghaidh na huigeachta.
ja: フィルタリング機能は、テクスチャ単位ではなく使用されるごとに定義されます。
ko: 필터링 옵션은 텍스처 기준이 아닌 사용별 기준로 정의됩니다.
ru: Фильтрация может быть определена для каждого пикселя или объекта.
ta: வடிகட்டுதல் விருப்பங்கள் ஒரு பயன்பாட்டு அடிப்படையில் வரையறுக்கப்படுகின்றன, ஒரு உரை அடிப்படையில் அல்ல.
tr: Filtreleme seçenekleri, doku-bazlı değil, kullanım-bazlı tanımlanır.

source: **Texture compression:**
cs: **Komprese textur:**
fr: **Compression de texture :**
ga: **Comhbhrú uigeachta:**
it: **Compressione delle texture:**
ja: **テクスチャ圧縮:**
ko: **텍스처 압축:**
pl: **Kompresja tekstur:**
ru: **Сжатие текстур:**
ta: ** அமைப்பு சுருக்க: **
tr: **Doku sıkıştırma:**

source: Basis Universal (slow, but results in smaller files).
cs: Basis Universal (pomalá, ale vede k menším souborům).
fr: Base universelle (lent, mais génère des fichiers plus petits).
ga: Bunús Uilíoch (mall, ach torthaí i gcomhaid níos lú).
it: Basis Universal (lenta, ma produce file più piccoli).
ja: Basis Universal (遅いものの、より小さいファイルになる)。
ko: Basis Universal (느리지만 더 작은 파일 크기를 제공합니다).
ru: Basis Universal (медленно, но позволяет получить файлы меньшего размера).
ta: அடிப்படை உலகளாவிய (மெதுவானது, ஆனால் சிறிய கோப்புகளில் விளைகிறது).
tr: Basis Universal (yavaş, ancak daha küçük dosyalarla sonuçlanır).

source: BPTC for high-quality compression (not supported on macOS).
cs: BPTC pro vysoce kvalitní kompresi (není podporováno v systému macOS).
fr: BPTC pour une compression de haute qualité (non supporté sur macOS).
ga: BPTC le haghaidh comhbhrú ardchaighdeáin (ní thacaítear leis ar macOS).
it: BPTC per una compressione di alta qualità (non supportata su macOS).
ja: 高品質圧縮のためのBPTC (macOSには未対応)。
ko: 고품질 압축을 위한 BPTC (macOS에서는 지원하지 않음).
pl: BPTC dla wysokiej jakości kompresji (nie wspierane w systemie macOS).
ru: BPTC для высококачественного сжатия (не поддерживается на macOS).
ta: உயர்தர சுருக்கத்திற்கான பிபிடிசி (MACOS இல் ஆதரிக்கப்படவில்லை).
tr: Yüksek kaliteli sıkıştırma için BPTC (macOS'ta desteklenmez).

source: ETC2 (not supported on macOS).
cs: ETC2 (není podporováno v systému macOS).
fr: ETC2 (non supporté sur macOS).
ga: ETC2 (ní thacaítear leis ar macOS).
it: ETC2 (non supportato su macOS).
ja: ETC2 (macOSには未対応)。
ko: ETC2 (macOS에서는 지원하지 않음).
pl: ETC2 (nie wspierane w systemie macOS).
ru: ETC2 (не поддерживается на macOS).
ta: முதலியன (MACOS இல் ஆதரிக்கப்படவில்லை).
tr: ETC2 (macOS'ta desteklenmez).

source: S3TC (not supported on mobile/Web platforms).
cs: S3TC (není podporováno na mobilních/webových platformách).
fr: S3TC (non pris en charge sur les plateformes mobiles/Web).
ga: S3TC (ní thacaítear leis ar ardáin soghluaiste / Gréasáin).
it: S3TC (supportato solo su piattaforme mobili/Web).
ja: S3TC (モバイル / Webプラットフォームでは非対応)。
ko: S3TC (모바일/웹 플랫폼은 지원하지 않음).
pl: S3TC (nie wspierane w platformach mobilnych oraz webowych).
ru: S3TC (не поддерживается на мобильных/Web платформах).
ta: S3TC (மொபைல்/வலை தளங்களில் ஆதரிக்கப்படவில்லை).
tr: S3TC (mobil/Web platformlarında desteklenmez).

source: **Antialiasing:**
cs: **Vyhlazování:**
fr: **Anticrénelage :**
ja: **アンチエイリアシング:**
ko: **안티 앨리어싱:**
ru: **Сглаживание:**
ta: ** ஆன்டிலிசிங்: **

source: Temporal :ref:`antialiasing <doc_3d_antialiasing>` (TAA).
cs: Časové :ref:`vyhlazování <doc_3d_antialiasing>` (TAA).
fr: Temporel :ref:`anticrénelage <doc_3d_antialiasing>` (TAA).
ga: Sealadach :ref:`antialiasing <doc_3d_antialiasing>` (TAA).
it: :ref:`Antialiasing <doc_3d_antialiasing>` temporale (TAA).
ja: テンポラル :ref:`アンチエイリアシング <doc_3d_antialiasing>` (TAA)。
ko: 시간적 :ref:`안티앨리어싱 <doc_3d_antialiasing>` (TAA).
ru: Временное :ref:`сглаживание <doc_3d_antialiasing>` (TAA).
ta: தற்காலிக: ref: `ஆன்டிலிசிங் <doc_3d_antialiasing>` (taa).
tr: Geçici :ref:`kenar yumuşatma <doc_3d_antialiasing>` (TAA).

source: AMD FidelityFX Super Resolution 2.2 :ref:`antialiasing <doc_3d_antialiasing>` (FSR2), which can be used at native resolution as a form of high-quality temporal antialiasing.
cs: AMD FidelityFX Super Resolution 2.2 :ref:`vyhlazování <doc_3d_antialiasing>` (FSR2), které lze použít v nativním rozlišení jako formu vysoce kvalitního časového vyhlazování.
fr: AMD FidelityFX Super Resolution 2.2 (FSR2) :ref:`anticrénelage <doc_3d_antialiasing>` , peut être utilisé à la résolution native comme une forme de haute qualité temporaire d'anticrénelage.
ga: AMD FidelityFX Super Resolution 2.2 :ref:`antialiasing <doc_3d_antialiasing>` (FSR2), ar féidir a úsáid ag taifeach dúchais mar fhoirm d'fhrithaliasú ama ar ardchaighdeán.
it: :ref:`Antialiasing <doc_3d_antialiasing>` AMD FidelityFX Super Resolution 2.2 (FSR2), che si può utilizzare alla risoluzione nativa come una forma di antialiasing temporale di alta qualità.
ja: AMD FidelityFX Super Resolution 2.2 :ref:`antialiasing<doc_3d_antialiasing>` (FSR2) 。これは、ネイティブの解像度で高品質な時間アンチエイリアシングの形式として使用できます。
ko: AMD FidelityFX Super Resolution 2.2 :ref:`안티앨리어싱 <doc_3d_antialiasing>` (FSR2), 고품질 시간적 안티앨리어싱 형태로 네이티브 해상도에서 사용할 수 있습니다.
ru: AMD FidelityFX Super Resolution 2.2 :ref:`сглаживание <doc_3d_antialiasing>` (FSR2), может быть использован в родном разрешении как форма высококачественного временного сглаживания.
ta: AMD FIDELITYFX சூப்பர் தெளிவுத்திறன் 2.2: Ref: `ஆன்டியாலியாசிங் <doc_3d_antialiasing>` (FSR2), இது சொந்தத் தீர்மானத்தில் உயர்தர தற்காலிக ஆன்டியாலியாசிங்கின் வடிவமாகப் பயன்படுத்தப்படலாம்.
tr: AMD FidelityFX Super Resolution 2.2 (FSR2) :ref:`kenar yumuşatması<doc_3d_antialiasing>`, doğal çözünürlükte yüksek kaliteli geçici kenar yumuşatma olarak kullanılabiliyor.

source: Multi-sample antialiasing (MSAA), for both :ref:`doc_2d_antialiasing` and :ref:`doc_3d_antialiasing`.
cs: Vícevzorkové vyhlazování (MSAA), pro :ref:`doc_2d_antialiasing` i :ref:`doc_3d_antialiasing`.
fr: Anticrénelage multi-échantillons (MSAA), pour les deux :ref:`doc_2d_antialiasing` et :ref:`doc_3d_antialiasing`.
ga: Antialiasing ilshamplach (MSAA), le haghaidh :ref:'doc_2d_antialiasing' agus :ref:'doc_3d_antialiasing'.
it: Antialiasing multi-campione (MSAA), sia per :ref:`doc_2d_antialiasing` sia per :ref:`doc_3d_antialiasing`.
ja: :ref:`doc_2d_antialiasing` および :ref:`doc_3d_antialiasing` へのマルチサンプル・アンチエイリアシング (MSAA)。
ko: 멀티 샘플 안티앨리어싱(MSAA), :ref:`2D 안티앨리어싱 <doc_2d_antialiasing>` 및 :ref:`3D 안티앨리어싱 <doc_3d_antialiasing>` 모두에 사용됩니다.
ru: MSAA можно использовать как для :ref:`doc_2d_antialiasing`, так и для :ref:`doc_3d_antialiasing`.
ta: இரண்டிற்கும் பல-மாதிரி ஆன்டிலியாசிங் (MSAA): ref: `doc_2d_antialiasing` மற்றும்: ref:` doc_3d_antialiasing`.
tr: Çok-örnekli kenar yumuşatma (MSAA), hem :ref:`doc_2d_antialiasing` hem de :ref:`doc_3d_antialiasing` için.

source: Fast approximate antialiasing (FXAA).
cs: Rychlé přibližné vyhlazování (FXAA).
fr: Anticrénelage approximatif rapide (FXAA).
ga: Antialiasing garbh tapa (FXAA).
it: Antialiasing approssimativo veloce (FXAA).
ja: 高速近似アンチエイリアス(FXAA)。
ko: 고속 근사 안티앨리어싱 (FXAA).
pl: Szybki aproksymacyjny antyaliasing (FXAA).
ru: Быстрое приблизительное сглаживание (FXAA).
ta: வேகமான தோராயமான ஆன்டிலியாசிங் (FXAA).
tr: Hızlı yaklaşıklık kenar yumuşatması (FXAA).

source: Super-sample antialiasing (SSAA) using bilinear 3D scaling and a 3D resolution scale above 1.0.
cs: Vyhlazování supervzorkováním (SSAA) využívající bilineární 3D škálování a měřítko 3D rozlišení nad 1.0.
fr: Anticrénelage de super-échantillon (SSAA) utilise la mise à l'échelle 3D bilinéaire et la mise à l'échelle de résolution 3D au dessus de 1.0.
ga: Antialiasing Super-sampla (SSAA) ag baint úsáide as scálú bilinear 3D agus scála réitigh 3D os cionn 1.0.
it: Antialiasing supercampione (SSAA), tramite ridimensionamento 3D bilineare e una scala di risoluzione 3D superiore a 1,0.
ja: スーパーサンプル・アンチエイリアシング (SSAA) を用いたバイリニア3Dスケーリングと1.0を超える3D解像度スケール。
ko: 1.0 이상의 3D 해상도 스케일과 양선형 3D 스케일링을 사용하는 슈퍼 샘플 안티앨리어싱(SSAA).
ru: Сверхвысокочастотное сглаживание (SSAA) с использованием билинейного 3D-масштабирования и увеличения масштаба 3D-разрешения выше 1.0.
ta: பிலினியர் 3 டி அளவிடுதல் மற்றும் 1.0 க்கு மேல் 3 டி தெளிவுத்திறன் அளவைப் பயன்படுத்தி சூப்பர்-மாதிரி ஆன்டிலியாசிங் (எச்எச்ஏஏ).
tr: çift-doğrusal 3B ölçeklendirme ve 1.0'ın üzerinde bir 3B çözünürlük ölçeği kullanan süper-örnekli kenar yumuşatma (SSAA).

source: Alpha antialiasing, MSAA alpha to coverage and alpha hashing on a per-material basis.
cs: Alfa vyhlazování, MSAA alfa na pokrytí a alfa hashování pro daný materiál.
fr: Alpha d'anticrénelage, utilisez l'alpha MSAA pour la couverture et l'alpha de hachage sur une base de matériau.
ga: Alfa antialiasing, MSAA alfa le clúdach agus alfa hashing ar bhonn in aghaidh an ábhair.
ja: アルファ・アンチエイリアシング、MSAAアルファをカバレッジに変換、およびマテリアルごとのアルファハッシュ。
ko: 알파 안티앨리어싱, MSAA 알파 투 커버리지 및 알파 해싱을 재질별로 지원합니다.
ru: Альфа-сглаживание, альфа-сглаживание MSAA для покрытия и альфа-хэширование на основе каждого материала.
ta: ஆல்பா ஆன்டியலலாசிங், எம்.எச்.ஏ.ஏ ஆல்பா டு கவரேச் மற்றும் ஆல்பா ஒரு பொருள் அடிப்படையில் தூக்கி எறியும்.
tr: Alfa kenar yumuşatma, MSAA alfadan kaplamaya ve malzeme bazında alfa sağlaması.

source: **Resolution scaling:**
cs: **Škálování rozlišení:**
fr: **Échelle de résolution :**
ga: **Scálú taifigh:**
ja: **解像度スケーリング:**
ko: **해상도 스케일링:**
pl: **Skalowanie rozdzielczości:**
ru: **Масштабирование разрешения:**
ta: ** தீர்மானம் அளவிடுதல்: **
tr: **Çözünürlük ölçeklendirme:**

source: Support for :ref:`rendering 3D at a lower resolution <doc_resolution_scaling>` while keeping 2D rendering at the original scale. This can be used to improve performance on low-end systems or improve visuals on high-end systems.
cs: Podpora :ref:`vykreslování 3D v nižším rozlišení <doc_resolution_scaling>` při zachování 2D vykreslování v původním měřítku. Toho lze využít ke zlepšení výkonu na systémech nižší třídy nebo ke zlepšení vizuálního zobrazení na systémech vyšší třídy.
fr: Le support pour :ref:`un rendu en 3D à une basse résolution <doc_resolution_scaling>` tout en gardant le rendu 2D à l'échelle originale. Cela peut être utilisé pour améliorer la performance sur les système bas de gamme ou pour améliorer les visuels des systèmes haut de gamme.
ga: Tacaíocht do :ref:`3D a dhéanamh ar thaifeach níos ísle <doc_resolution_scaling>` agus rindreáil 2T á choinneáil ag an mbunscála. Is féidir é seo a úsáid chun feidhmíocht ar chórais íseal-deireadh a fheabhsú nó chun amhairc ar chórais ardleibhéil a fheabhsú.
it: Supporto per il :ref:`rendering in 3D a una risoluzione inferiore <doc_resolution_scaling>` pur mantenendo il rendering in 2D alla scala originale. Ciò si può utilizzare per migliorare le prestazioni sui sistemi di fascia bassa o le visuali sui sistemi di fascia alta.
ja: 2Dレンダリングは元のスケールのまま、 :ref:`3Dを低解像度でレンダリング <doc_resolution_scaling>` する機能をサポートしています。この機能は、低スペックのシステムでパフォーマンスを向上させたり、高スペックのシステムでビジュアルを改善したりするために使用できます。
ko: 2D 렌더링을 원래 스케일을 유지하면서 :ref:`낮은 해상도로 3D 렌더링 <doc_resolution_scaling>`\ 하는 기능을 지원합니다. 이는 저사양 시스템에서 성능을 향상시키거나 고사양 시스템에서 시각적 품질을 개선하는 데 사용할 수 있습니다.
ru: Поддержка :ref:`отрисовки 3D в более низком разрешении <doc_resolution_scaling>` при сохранении 2D-рендеринга в исходном масштабе. Это может быть использовано для повышения производительности на низкопроизводительных системах или улучшения визуального восприятия на высокопроизводительных системах.
ta: இதற்கான ஆதரவு: ref: `3D ஐ குறைந்த தெளிவுத்திறனில் வழங்குதல் <doc_resolution_scaling>` 2D வழங்குதல் அசல் அளவில் வைத்திருக்கும்போது. குறைந்த-இறுதி அமைப்புகளில் செயல்திறனை மேம்படுத்த அல்லது உயர்நிலை அமைப்புகளில் காட்சிகளை மேம்படுத்த இதைப் பயன்படுத்தலாம்.
tr: 2B görüntülemeyi orijinal ölçekte tutarken :ref:`3B'yi daha düşük çözünürlükte oluşturma <doc_resolution_scaling>` desteği. Bu, düşük seviyeli sistemlerde performansı artırmak veya yüksek seviyeli sistemlerde görselleri iyileştirmek için kullanılabilir.

source: Resolution scaling uses bilinear filtering, AMD FidelityFX Super Resolution 1.0 (FSR1) or AMD FidelityFX Super Resolution 2.2 (FSR2).
cs: Škálování rozlišení využívá bilineární filtrování, AMD FidelityFX Super Resolution 1.0 (FSR1) nebo AMD FidelityFX Super Resolution 2.2 (FSR2).
fr: La mise à l'échelle de la résolution utilise un filtrage bilinéaire, AMD FidelityFX Super Resolution 1.0 (FSR1) ou AMD FidelityFX Super Resolution 2.2 (FSR2).
ga: Úsáideann scálú réitigh scagadh bilinear, AMD FidelityFX Super Resolution 1.0 (FSR1) nó AMD FidelityFX Super Resolution 2.2 (FSR2).
it: Il ridimensionamento della risoluzione utilizza il filtraggio bilineare, AMD FidelityFX Super Resolution 1.0 (FSR1) oppure AMD FidelityFX Super Resolution 2.2 (FSR2).
ja: 解像度スケーリングでは、バイリニアフィルタリング、AMDのFidelityFX Super Resolution 1.0 (FSR1)、またはAMDのFidelityFX Super Resolution 2.2 (FSR2) が使用されます。
ko: 해상도 스케일링은 양선형 필터링, AMD FidelityFX Super Resolution 1.0 (FSR1) 또는 AMD FidelityFX Super Resolution 2.2 (FSR2)를 사용합니다.
ru: При масштабировании разрешения используется билинейная фильтрация, AMD FidelityFX Super Resolution 1.0 (FSR1) или AMD FidelityFX Super Resolution 2.2 (FSR2).
ta: தெளிவுத்திறன் அளவிடுதல் பிலினியர் வடிகட்டுதல், AMD FIDELITYFX சூப்பர் தெளிவுத்திறன் 1.0 (FSR1) அல்லது AMD FIDELITYFX சூப்பர் தெளிவுத்திறன் 2.2 (FSR2) ஆகியவற்றைப் பயன்படுத்துகிறது.
tr: Çözünürlük ölçeklendirme çift-doğrusal filtreleme, AMD FidelityFX Super Resolution 1.0 (FSR1) veya AMD FidelityFX Super Resolution 2.2 (FSR2) kullanır.

source: Texture mipmap LOD bias is adjusted automatically to improve quality at lower resolution scales. It can also be modified with a manual offset.
cs: Preference LOD mipmap textur se nastavuje automaticky, aby se zlepšila kvalita při nižším rozlišení. Lze jej také upravit ručním nastavením offsetu.
fr: Le biais des niveaux de détails (LOD) des mipmaps de texture est automatiquement ajusté pour améliorer la qualité aux résolutions inférieures. Il peut également être modifié avec un décalage manuel.
ga: Déantar claonadh LOD mipmap uigeachta a choigeartú go huathoibríoch chun cáilíocht a fheabhsú ag scálaí réitigh níos ísle. Is féidir é a mhodhnú freisin le fritháireamh láimhe.
ja: テクスチャのミップマップLODバイアスは、低解像度スケールでの品質向上のために自動的に調整されます。また、手動でオフセットを変更することも可能です。
ko: 텍스처 밉맵 LOD 바이어스는 자동으로 조정되어 낮은 해상도 스케일에서 품질을 향상시킵니다. 수동 오프셋으로도 수정할 수 있습니다.
ru: Смещение (bias) LOD mip-карты текстуры автоматически настраивается для повышения качества на низких разрешениях. Оно также может быть изменено вручную.
ta: குறைந்த தெளிவுத்திறன் அளவீடுகளில் தரத்தை மேம்படுத்த அமைப்பு MIPMAP LOD சார்பு தானாக சரிசெய்யப்படுகிறது. இதை ஒரு கையேடு ஆஃப்செட் மூலம் மாற்றலாம்.
tr: Doku mipmap LOD sapması, düşük çözünürlük ölçeklerinde kaliteyi artırmak için otomatik olarak ayarlanır. Elden verilen bir kaydırma değeri ile de değiştirilebilir.
