Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: Optional distance fade system to fade distant lights and their shadows, improving performance.
cs: Volitelný systém vzdáleného blednutí pro ztlumení vzdálených světel a jejich stínů pro zlepšení výkonu.
fr: Système optionnel d'atténuation de la distance permettant d'atténuer les lumières éloignées et leurs ombres, ce qui améliore les performances.
ga: Córas céimnithe achar roghnach chun soilse i bhfad i gcéin agus a scáthanna a céimnithe, feidhmíocht a fheabhsú.
it: Sistema opzionale di dissolvenza a distanza per attenuare le luci distanti e le loro ombre, migliorando le prestazioni.
ja: オプションの距離フェードシステムは、遠くにある光源とそれによる影をフェードさせ、パフォーマンスを向上できます。
ko: 성능을 향상시키기 위해 먼 거리의 조명과 그림자를 점차적으로 사라지게 하는 선택적 거리 페이드 시스템.
pl: Nieobowiązkowy system zanikania na odległość aby światła znikały i ich cienie, poprawiając wydajność.
ru: Система опционального затухания на дистанции обеспечивает затухание далёкого света, а также созданных им теней, улучшает производительность.
ta: தொலைதூர விளக்குகள் மற்றும் அவற்றின் நிழல்களை மங்கச் செய்ய விருப்ப தூரம் மங்கலான அமைப்பு, செயல்திறனை மேம்படுத்துகிறது.
tr: Uzak ışıkları ve onların gölgelerini soldurarak performansı iyileştiren, isteğe bağlı uzaklık solma sistemi.

source: When using the Forward+ renderer (default on desktop), lights are rendered with clustered forward optimizations to decrease their individual cost. Clustered rendering also lifts any limits on the number of lights that can be used on a mesh.
cs: Při použití vykreslovacího nástroje Forward+ (výchozí nastavení na desktopových platformách) jsou světla vykreslována pomocí sdružených dopředných optimalizací, aby se snížily jejich individuální náklady. Seskupená světla také odstraňují jakákoli omezení na počet světel, která lze aplikovat na síť.
fr: Lors de l'utilisation du moteur de rendu Forward+ (par défaut pour les ordinateurs de bureau), les lumières sont rendues avec des optimisations avancées groupées pour réduire leur coût individuel. Le rendu groupé enlève également toute limite quant au nombre de lumières pouvant être utilisées sur un maillage.
it: Quando si utilizza il renderer Forward+ (predefinito su desktop), le luci sono renderizzate con ottimizzazioni di tipo "clustered forward" per ridurre il loro costo computazionale individuale. Ciò rimuove anche ogni limite sul numero di luci che si possono usare su una mesh.
ja: Forward+ レンダラー (デスクトップのデフォルト) を使用する場合、ライトはクラスター化された前方最適化でレンダリングされ、個々のコストが削減されます。クラスタ化されたレンダリングでは、メッシュで使用できるライトの数の制限も解除されます。
ko: Forward+ 백엔드(데스크톱에서 디폴트)를 사용할 때, 조명의 개별 비용을 줄이기 위해 클러스터형 전방 최적화 기법을 사용하여 렌더링합니다. 클러스터형 렌더링은 한 메시에 사용할 수 있는 조명의 최대 수 제한도 제거합니다.
pl: Kiedy używając backendu Forward+ (domyślny dla platform desktopowych), światła są renderowane przy użyciu grupowych optymalizacji aby zredukować ich indywidualny koszt. Grupowe renderowanie także podnosi każdy limit na liczbę świateł które mogły być użyte na siatce.
ru: При использовании программы Forward+ Рендер (по умолчанию на рабочем столе), источники света отображаются с кластерной оптимизацией для уменьшения их индивидуальной стоимости. Кластерный рендеринг также снимает любые ограничения на количество источников света, которые могут использоваться в сетке.
ta: முன்னோக்கி+ ரெண்டரர் (டெச்க்டாப்பில் இயல்புநிலை) பயன்படுத்தும் போது, விளக்குகள் அவற்றின் தனிப்பட்ட செலவைக் குறைக்க கொத்து முன்னோக்கி மேம்படுத்தல்களுடன் வழங்கப்படுகின்றன. கிளச்டர்டு வழங்குதல் ஒரு கண்ணி மீது பயன்படுத்தக்கூடிய விளக்குகளின் எண்ணிக்கையிலும் எந்த வரம்புகளையும் உயர்த்துகிறது.

source: When using the Mobile renderer, up to 8 omni lights and 8 spot lights can be displayed per mesh resource. Baked lighting can be used to overcome this limit if needed.
cs: Při použití vykreslovacího nástroje Mobile lze na jeden zdroj sítě zobrazit až 8 všesměrových a 8 bodových světel. V případě potřeby lze pro překročení tohoto limitu použít vypálená světla.
fr: Lors de l'utilisation du moteur de rendu Mobile, jusqu'à 8 lumières omnidirectionnelles et 8 lumières ponctuelles peuvent être affichées par ressource de maillage. L'éclairage précalculé peut être utilisé pour surmonter cette limite si nécessaire.
it: Quando si utilizza il renderer Mobile, è possibile visualizzare fino a 8 luci omni e 8 luci spot per ogni risorsa di tipo mesh. L'illuminazione precalcolata si può sfruttare per superare tale limite, se necessario.
ja: Mobile レンダラーを使用する場合、メッシュリソースごとに最大 8 つのオムニライトと 8 つのスポットライトを表示できます。ベイクしたライティングは、必要に応じてこの制限を克服するために使用できます。
ko: 모바일 렌더러를 사용하는 경우, 메시 리소스당 최대 8개의 전방위 조명과 8개의 스포트 조명이 표시될 수 있습니다. 필요한 경우 구운 조명을 사용하여 이러한 한계를 극복할 수 있습니다.
pl: W przypadku używania backendu Mobile, aż do 8 wszech świateł i 8 punktowych świateł może być wyświetlane na zasób sieci. Wbudowane światło może być użyte do przekroczenia tego limitu.
ru: При использовании мобильного отрисовщика в качестве рендера, на сетке (mesh) могут отображаться до 8 источников всенаправленного и 8 источников точечного света. При необходимости для преодоления этого ограничения можно использовать встроенное освещение.
ta: மொபைல் ரெண்டரரைப் பயன்படுத்தும் போது, ஒரு கண்ணி வளத்திற்கு 8 ஓம்னி விளக்குகள் மற்றும் 8 ச்பாட் விளக்குகள் காட்டப்படலாம். தேவைப்பட்டால் இந்த வரம்பைக் கடக்க சுட்ட விளக்குகள் பயன்படுத்தப்படலாம்.

source: **Shadow mapping:**
cs: **Mapování stínů:**
fr: **Cartographie des ombres :**
ga: **Scáthmhapáil:**
it: **Mappatura delle ombre:**
ja: **シャドウマッピング:**
ko: **그림자 매핑**
pl: **Mapowanie cieni**
ru: **Карта теней**
ta: ** நிழல் மேப்பிங்: **
tr: **Gölge haritalama:**

source: *DirectionalLight:* Orthogonal (fastest), PSSM 2-split and 4-split. Supports blending between splits.
cs: *DirectionalLight (globální směrové světlo):* Ortogonální (nejrychlejší), 2-splitové a 4-splitové PSSM. Podporuje prolnutí mezi vrstvami.
fr: *DirectionalLight :* Orthogonal (le plus rapide), PSSM 2-split and 4-split. Supporte le mélange entre les divisions (splits).
ga: * DirectionalLight: * Orthogonal (is tapúla), PSSM 2-scoilt agus 4-scoilt. Tacaíochtaí chumasc idir scoilteanna.
it: *DirectionalLight:* Ortogonale (più veloce), PSSM a 2 e 4 suddivisioni. Supporta la sfumatura tra le suddivisioni.
ja: *DirectionLight:* 直交 (最速)、PSSM 2分割および4分割。分割間におけるブレンドに対応しています。
ko: *방향성 조명(DirectionalLight):* 직교 (가장 빠름), PSSM 2-split 및 4-split. 스플릿 간 블렌딩을 지원합니다.
pl: *DirectionalLight:* Ortogonalny (najszybszy), PSSM 2-częściowy i 4-częściowy. Obsługuje mieszanie między podziałami.
ru: *DirectionalLight:* Ортогональный (самый быстрый), PSSM 2-сегментный и 4-сегментный. Поддерживает смешивание между разделениями.
ta: * திசைஅலைட்:* ஆர்த்தோகனல் (வேகமான), பிஎச்எச்எம் 2-பிளவு மற்றும் 4-பிளவு. பிளவுகளுக்கு இடையில் கலப்பதை ஆதரிக்கிறது.
tr: *Yönlü Işık:* (DirectionalLight) Dik açılı (en hızlı), 2'ye ve 4'e bölünmüş PSSM. Bölünmeler arasında harmanlamayı destekler.

source: *OmniLight:* Dual paraboloid (fast) or cubemap (slower but more accurate). Supports colored projector textures in the form of panoramas.
cs: *OmniLight (všesměrové světlo):* Duální paraboloid (rychlý) nebo krychlová mapa (pomalejší, ale přesnější). Podporuje barevné projekční textury ve formě panoramat.
fr: *OmniLight :* Double paraboloïde (rapide) ou cubemap (plus lent mais plus précis). Supporte les textures colorées du projecteur sous forme de panoramas.
ga: * OmniLight: * Paraboloid Dual (tapa) nó cubemap (níos moille ach níos cruinne). Tacaíochtaí uigeachtaí teilgeoir daite i bhfoirm panoramas.
it: *OmniLight:* Doppia paraboloide (veloce) o cubemap (più lento ma più preciso). Supporta le texture colorate e proiettabili sotto forma di panorami.
ja: *OmniLight:* デュアル パラボロイド (高速) またはキューブマップ (低速だがより正確)。パノラマの形でカラープロジェクターテクスチャに対応。
ko: *OmniLight:* 쌍포물선(빠름) 또는 큐브맵(느리지만 더 정확). 색이 있는 프로젝터 텍스처를 파노라마의 형태로 지원합니다.
pl: *OmniLight:* Podwójna paraboloida (szybka) lub cubemapa (wolniejsza, ale dokładniejsza). Obsługuje kolorowe tekstury nakładane w postaci panoram.
ru: *OmniLight:* Двойной параболоид (быстрый) или кубическая карта (медленнее, но точнее). Поддерживает цветные текстуры проектора в виде панорам.
ta: . பனோரமாசின் வடிவத்தில் வண்ண ப்ரொசெக்டர் அமைப்புகளை ஆதரிக்கிறது.
tr: *Her Yönlü Işık:* (OmniLight) Çift paraboloid (hızlı) veya küp haritası (daha yavaş ama daha doğru). Panoramalar biçiminde renkli yansıtma dokularını destekler.

source: *SpotLight:* Single texture. Supports colored projector textures.
cs: *SpotLight:* Jedna textura. Podporuje barevné projekční textury.
fr: *SpotLight :* Texture unique. Supporte les textures de projecteur colorées.
ga: * SpotLight: * Uigeacht aonair. Tacaíochtaí uigeachtaí teilgeoir daite.
it: *SpotLight:* Texture singola. Supporta texture di proiettore colorate.
ja: *スポットライト:* 単一テクスチャ。色付き投影テクスチャに対応。
ko: *스포트라이트:* 단일 텍스처. 색이 있는 투영 텍스처에 대응.
pl: *Reflektor:* Pojedyncza tekstura. Wspiera kolorowe tekstury projektora.
ru: *SpotLight:* Одна текстура. Поддерживает цветную проекцию текстур.
ta: * ச்பாட்லைட்:* ஒற்றை அமைப்பு. வண்ண ப்ரொசெக்டர் அமைப்புகளை ஆதரிக்கிறது.
tr: *Spot Işık:* (SpotLight) Tekil doku. Renkli yansıtıcı dokuları destekler.

source: Shadow normal offset bias and shadow pancaking to decrease the amount of visible shadow acne and peter-panning.
cs: Preference offsetu stínových normál a palačinkování stínů pro snížení množství viditelných stínových artefaktů a odskakujících stínů.
fr: Décalage du biais de l'offset normal des ombres et compression des ombres pour réduire la quantité d'acné des ombres et l'effet Peter Pan.
ga: Scáth claonadh fritháireamh gnáth agus pancaking scáth a laghdú ar an méid acne scáth infheicthe agus peter-panning.
ja: シャドウ法線オフセットバイアスとシャドウパンケーキは、目に見えるシャドウアクネとピーターパンの量を減らします。
ko: 그림자 노멀 오프셋 바이어스와 그림자 팬케이킹을 통해 그림자 아티팩트와 피터 팬 현상을 줄입니다.
pl: Normalne przesunięcie cienia i rozpłaszcznia cienia w celu zmniejszenia ilości widocznych zanieczyszceń obrazu, a tak że peter-panning.
ru: Нормальное смещение тени и запекание теней используют, чтобы уменьшить количество видимых прыщей в тенях (shadow acne) и питер-пеннинга.
ta: நிழல் இயல்பான ஆஃப்செட் சார்பு மற்றும் நிழல் பான்கேக்கிங் ஆகியவை காணக்கூடிய நிழல் முகப்பரு மற்றும் பீட்டர்-பானிங் அளவைக் குறைக்க.
tr: Görünür gölge sivilceleşmesi ve peter-panning (gölgenin cisimden ayrı kalması ) miktarını azaltmak için gölge normali kayma sapması ve gölge krepleme (pancaking).

source: :abbr:`PCSS (Percentage Closer Soft Shadows)`-like shadow blur based on the light size and distance from the surface the shadow is cast on.
cs: Rozmazání stínů podobné :abbr:`PCSS (Percentage Closer Soft Shadows - Měkké stíny založené na procentu bližších)` založené na velikosti světla a vzdálenosti of povrchu, ne který je stín vržen.
fr: Flou d'ombre de type :abbr:`PCSS (Ombres Douces Plus Proches en Pourcentage)` basé sur la taille de la lumière et la distance par rapport à la surface sur laquelle l'ombre est projetée.
ga: : abbr: 'PCSS (Céatadán Níos Dlúithe Scáthanna Bog) '-mhaith blur scáth bunaithe ar an méid solais agus fad ón dromchla a bhfuil an scáth a caitheadh ar.
it: Sfocatura di ombre simile a :abbr:`PCSS (Percentage Closer Soft Shadows)` basato sulle dimensioni della luce e sulla distanza dalla superficie su cui viene proiettata l'ombra.
ja: :abbr:`PCSS (Percentage Closer Soft Shadows)` に似たシャドウブラーで、ライトのサイズとシャドウが投影されるサーフェスからの距離に基づいています。
ko: :abbr:`PCSS (Percentage Closer Soft Shadows)` 와 유사한 그림자 흐림 효과는 조명의 크기와 그림자가 드리워진 표면과의 거리를 기반으로 합니다.
pl: :abbr:`PCSS (Percentage Closer Soft Shadows)`- podobnie do rozmycia cienia jest opartegy na rozmiarze swiatła i odległości od powierzchni na, którą pada cień.
ru: :abbr:`PCSS (Percentage Closer Soft Shadows)`-подобное размытие теней, основанное на размере света и расстоянии от поверхности, на которую отбрасывается тень.
ta: :abbr:`PCSS (Percentage Closer Soft Shadows)`-like shadow blur based on the light அளவு and distance இருந்து the surface the shadow is cast on.
tr: Işık boyutuna ve gölgenin düştüğü yüzeye olan uzaklığa bağlı :abbr:`PCSS (Percentage Closer Soft Shadows, Yüzdelik Yakınlıklı Yumuşak Gölgeler)` benzeri gölge bulanıklığı.

source: Adjustable shadow blur on a per-light basis.
cs: Rozmazání stínů lze nastavit pro každé světlo zvlášť.
fr: Flou d'ombre réglable pour chaque lumière.
ga: Blur scáth adjustable ar bhonn in aghaidh an tsolais.
it: Sfocatura di ombra, regolabile per ciascuna luce.
ja: ライトごとに調節可能なシャドウブラー。
ko: 조명 단위로 조정할 수 있는 그림자 블러 효과.
pl: Dostosowywalne rozmycie cienia, odzielnie dla konkretnych swiateł.
ru: Регулируемое размытие теней для каждого источника света.
ta: ஒரு ஒளி அடிப்படையில் சரிசெய்யக்கூடிய நிழல் மங்கலானது.
tr: Işık bazında ayarlanabilir gölge bulanıklığı.

source: **Global illumination with indirect lighting:**
cs: **Globální osvětlení s nepřímým světlem:**
fr: **Éclairage global avec éclairage indirect :**
ga: **Soilsiú domhanda le soilsiú indíreach:**
it: **Illuminazione globale con illuminazione indiretta:**
ja: **間接照明によるグローバルイルミネーション:**
ko: **간접 조명을 통한 전역 조명(Global illumination):**
pl: **Globalne oświetlenie z pośrednim światłem:**
ru: **Глобальное освещение с непрямым освещением:**
ta: ** மறைமுக விளக்குகளுடன் உலகளாவிய வெளிச்சம்: **
tr: **Dolaylı ışıklandırma ile küresel aydınlatma (Global Illumination, GI):**

source: :ref:`Baked lightmaps <doc_using_lightmap_gi>` (fast, but can't be updated at runtime).
cs: :ref:`Vypálené světelné mapy <doc_using_lightmap_gi>` (rychlé, ale nelze je aktualizovat za běhu).
fr: :ref:`Lightmaps précalculées <doc_using_lightmap_gi>` (rapide, mais ne peut pas être mis à jour pendant l'exécution) .
it: :ref:`Lightmap precalcolate <doc_using_lightmap_gi>` (veloci, ma non si possono aggiornare durante l'esecuzione).
ja: :ref:`ベイク済みライトマップ <doc_using_lightmap_gi>` (高速ですが、実行時に更新することはできません)。
ko: :ref:`구워진 라이트맵 <doc_using_lightmap_gi>` (빠르지만, 런타임 중에 업데이트할 수 없음).
pl: :ref:`Oświetlenie policzone w czsie kompilacji <doc_using_lightmap_gi>` (szybkie, ale nie mogą być aktualizowane w czasie działania aplikacji).
ru: :ref:`Запечённые карты освещения <doc_using_lightmap_gi>` (быстр, но не может быть обновлен во время выполнения).

source: Supports baking indirect light only or baking both direct and indirect lighting. The bake mode can be adjusted on a per-light basis to allow for hybrid light baking setups.
cs: Podpora vypálení pouze nepřímého nebo přímého i nepřímého světla. Režim vypálení lze upravit pro každé světlo zvlášť a dosáhnout tak hybridních nastavení vypalování.
fr: Supporte le pré-calcul de l'éclairage indirect seul ou le pré-calcul de l'éclairage direct et indirect. Le mode de pré-calcul peut être ajusté pour chaque lumière afin de permettre le pré-calcul de configurations d'éclairages hybrides.
ga: Tacaíonn sé le bácáil solas indíreach amháin nó bácáil soilsiú díreach agus indíreach araon. Is féidir an modh bácála a choigeartú in aghaidh an tsolais chun socruithe bácála solais hibrideacha a cheadú.
it: Supporta il baking della sola luce indiretta o di entrambe le luci diretta e indiretta. La modalità bake può essere regolata indipendentemente per ogni luce, per permettere una organizzazione ibrida della stessa.
ja: ベイクは間接照明のみ、または直接照明と間接照明の両方をサポート。ベイクモードは、ライトごとに調整して、ハイブリッドライトベーキングが可能。
ko: 간접 조명만 굽기나 직접 및 간접 조명을 모두 굽기를 지원합니다. 굽기 모드는 하이브리드 조명 베이킹 설정을 허용하도록 조명별로 조정할 수 있습니다.
pl: Obsługuje baking tylko światła pośredniego lub baking zarówno światła bezpośredniego, jak i pośredniego. Tryb bakingu można regulować w zależności od światła, aby umożliwić hybrydowe ustawienia bakingu przy świetle.
ru: Поддерживает запекание либо непрямого света, либо запекание прямого и непрямого света. Режим запекания можно регулировать для каждого источника света, что позволяет использовать гибридное запекание света.
ta: பேக்கிங் மறைமுக ஒளியை மட்டுமே ஆதரிக்கிறது அல்லது நேரடி மற்றும் மறைமுக விளக்குகள் இரண்டையும் பேக்கிங் செய்கிறது. ஐப்ரிட் லைட் பேக்கிங் அமைப்புகளை அனுமதிக்க ஒரு ஒளி அடிப்படையில் பேக் பயன்முறையை சரிசெய்யலாம்.
tr: Yalnızca dolaylı ışığı pişirmeyi veya hem doğrudan hem de dolaylı ışıklandırmayı pişirmeyi destekler. Pişirme modu, melez ışık pişirme kurulumlarına izin vermek için ışık-başına temelli olarak ayarlanabilir.

source: Supports lighting dynamic objects using automatic and manually placed probes.
cs: Podpora osvětlení dynamických objektů pomocí automatických a ručně umístěných sond.
fr: Supporte l'éclairage dynamique d'objets en utilisant un système automatique et manuel de sondes.
ga: Tacaíochtaí soilsiú rudaí dinimiciúla ag baint úsáide as probes uathoibríoch agus de láimh a chur.
it: Supporta l'illuminazione dinamica di oggetti attraverso un sistema automatico e manuale di sonde.
ja: 自動および手動で配置されたプローブによる、動的オブジェクトのライティングが可能。
ko: 자동 및 수동으로 배치된 프로브를 사용하여 동적 오브젝트에 라이팅을 지원합니다.
pl: Obsługuje oświetlenie dynamicznych obiektów za pomocą automatycznie i ręcznie ustawionych próbników.
ru: Поддерживает освещение динамических объектов используя автоматические и ручные датчики.
ta: தானியங்கி மற்றும் கைமுறையாக வைக்கப்பட்டுள்ள ஆய்வுகளைப் பயன்படுத்தி லைட்டிங் மாறும் பொருள்களை ஆதரிக்கிறது.
tr: Otomatik ve elle yerleştirilmiş sondaları kullanarak dinamik nesneleri aydınlatmayı destekler.

source: Optionally supports directional lighting and rough reflections based on spherical harmonics.
cs: Volitelná podpora směrového osvětlení a hrubých odrazů založených na sférických harmonických funkcích.
fr: Prend en charge, de manière optionnelle, l'éclairage directionnel et les réflexions approximatives basées sur les harmoniques sphériques.
ga: Roghnach Tacaíonn soilsiú directional agus reflections garbh bunaithe ar armóin sféarúil.
it: Supporta, facoltativamente, l'illuminazione direzionale e i riflessi approssimativi basati su armoniche sferiche.
ja: オプションで、球面調和関数に基づく指向性ライティングと粗い反射をサポートします。
ko: 선택적으로 구형 고조파를 기반으로 한 방향성 라이팅 및 거친 반사를 지원합니다.
pl: Okazjonalnie wspiera oświetlenie skierowane i surowe odbicia oparte na harmoni sferycznej.
ru: Опционально поддерживает направленное освещение и грубые отражения, основанные на сферической гармонии.
ta: விருப்பமாக திசை விளக்குகள் மற்றும் கோள ஆர்மோனிக்ச் அடிப்படையில் தோராயமான பிரதிபலிப்புகளை ஆதரிக்கிறது.
tr: İsteğe bağlı olarak küresel harmoniklere dayalı yönlü aydınlatma ve kaba yansımaları destekler.

source: Lightmaps are baked on the GPU using compute shaders (much faster compared to CPU lightmapping). Baking can only be performed from the editor, not in exported projects.
cs: Světelné mapy se vypalují pomocí GPU za pomoci výpočetních shaderů (mnohem rychlejší než vypalování na CPU). Vypalovat je možné pouze z editoru, nikoli v exportovaných projektech.
fr: Les lightmaps sont pré-calculées avec la carte graphique en utilisant des shaders de calcul (qui sont beaucoup plus rapides comparé au calcul du processeur pour créer une lightmap). Pré-calculer peut uniquement être effectué à partir de l'éditeur, pas dans les projets exportés.
ga: Déantar mapaí solais a bhácáil ar an GPU ag baint úsáide as shaders ríofa (i bhfad níos tapúla i gcomparáid le mapáil solais LAP). Ní féidir bácáil a dhéanamh ach ón eagarthóir, ní i dtionscadail onnmhairithe.
ja: ライトマップはコンピュートシェーダーを利用してGPUでベイクされます (CPUライトマッピングよりも高速です)。ベイクはエクスポートされたプロジェクトではなく、エディタ内でのみ実行できます。
ko: 라이트맵은 GPU에서 컴퓨트 셰이더를 사용하여 구워집니다 (CPU 라이트매핑에 비해 훨씬 빠릅니다). 굽기는 편집기에서만 수행할 수 있으며, 내보낸 프로젝트에서는 수행할 수 없습니다.
pl: Mapy oświetlenia są wypalane(wyliczne) na GPU za pomocą shaderów (jest to szybsze w porównaniu do mapowania oświetlenia na CPU). Wypalania można dokonać tylko w edytorze, nie w wyeksportowanym projekcie.
ru: Карты освещенности (lightmap) запекаются на GPU с помощью вычислительных шейдеров (гораздо быстрее по сравнению с лайтмаппингом на CPU). Запекание может быть выполнено только в редакторе, но не в экспортированных проектах.
ta: கம்ப்யூட் சேடர்களைப் பயன்படுத்தி சி.பீ.யில் லைட்மாப்கள் சுடப்படுகின்றன (CPU லைட்மாப்பிங்குடன் ஒப்பிடும்போது மிக வேகமாக). ஏற்றுமதி செய்யப்பட்ட திட்டங்களில் அல்ல, எடிட்டரிடமிருந்து மட்டுமே பேக்கிங் செய்ய முடியும்.
tr: Işık haritaları, hesaplama gölgelendiricileri (compute shaders) kullanılarak GPU'da pişirilir (CPU ışık haritalamasına kıyasla çok daha hızlıdır). Pişirme işlemi yalnızca düzenleyicide gerçekleştirilebilir, dışa aktarılan projelerde yapılamaz.

source: Supports GPU-based :ref:`denoising <doc_using_lightmap_gi_denoising>` with JNLM, or CPU/GPU-based denoising with OIDN.
cs: Podpora :ref:`odstraňování šumu <doc_using_lightmap_gi_denoising>` na GPU s JNLM nebo na CPU/GPU s OIDN.
fr: Supporte le :ref:`débruitage <doc_using_lightmap_gi_denoising>` avec JNLM ou le débruitage basé sur le CPU/GPU avec OIDN.
ga: Tacaíonn sé le :tag: `déanadh <doc_using_lightmap_gi_denoising>' bunaithe ar GPU le JNLM, nó le hainmfhocal CPU/GPU-bhunaithe le OIDN.
it: Supporta la :ref:`riduzione del rumore <doc_using_lightmap_gi_denoising>` basato su GPU con JNLM, o riduzione del rumore basata su CPU/GPU con OIDN.
ja: GPUベースの :ref:`ノイズ除去 (denoising) <doc_using_lightmap_gi_denoising>` (JNLMを使用)、またはCPU/GPUベースのノイズ除去 (OIDNを使用) をサポートします。
ko: JNLM을 사용한 GPU 기반의 :ref:`디노이징 <doc_using_lightmap_gi_denoising>`\ 이나 OIDN을 사용한 CPU/GPU 기반의 디노이징을 지원합니다.
ru: Поддержка GPU шумоподавление :ref:`denoising <doc_using_lightmap_gi_denoising>` с помощью JNLM, или CPU/GPU шумоподавление с помощью OIDN.
ta: சி.பீ.
tr: JNLM ile GPU tabanlı :ref:`gürültü giderme<doc_using_lightmap_gi_denoising>` veya OIDN ile CPU/GPU tabanlı gürültü gidermeyi destekler.

source: :ref:`Voxel-based GI probes <doc_using_voxel_gi>`. Supports dynamic lights *and* dynamic occluders, while also supporting reflections. Requires a fast baking step which can be performed in the editor or at runtime (including from an exported project).
cs: :ref:`Sondy globálního osvětlené založené na voxelech (VoxelGI) <doc_using_voxel_gi>`. Podporují dynamická světla *i* dynamická stínidla společně s podporou odrazů. Vyžadují rychlý krok vypálení, který lze provést jak v editoru, tak za běhu (i v exportovaných projektech).
fr: :ref:`Sondes voxel-based GI <doc_using_voxel_gi>`. Supporte les lumières dynamiques *et* les occlusions dynamiques, tout en supportant aussi les réflexions. Requiert une étape de pré-calcul rapide qui peut être effectuée dans l'éditeur ou pendant la durée d'exécution (même dans un projet exporté).
it: :ref:`Sonde GI basate su voxel <doc_using_voxel_gi>`. Supporta luci dinamiche *e* occlusori dinamici, anche supportando riflessi. Richiede una fase rapida di precalcolo che si può eseguire nell'editor o in fase d'esecuzione (anche in un progetto esportato).
ja: :ref:`ボクセルベースのGIプローブ<doc_using_voxel_gi>`。動的ライト*および*動的オクルーダーをサポートし、反射もサポートします。エディターまたは実行時 (エクスポートされたプロジェクトからを含む) に実行できる高速ベイク処理手順が必要です。
ko: :ref:`복셀 기반 GI 프로브 <doc_using_voxel_gi>`. 동적 조명 *및* 동적 오클루더를 지원하며, 반사도 지원합니다. 빠른 굽기 단계가 필요하며, 이는 편집기나 실행 중(내보낸 프로젝트 포함)에 수행할 수 있습니다.
ru: :ref:`Voxel-based GI probes <doc_using_voxel_gi>`. Поддерживает динамическое освещение *и* динамические окклюдеры, а также отражения. Требуется быстрый этап запекания, который может быть выполнен в редакторе или во время выполнения (в том числе из экспортированного проекта).
ta: : குறிப்பு: `வோக்சல் அடிப்படையிலான சி.ஐ ஆய்வுகள் <doc_using_voxel_gi>`. மாறும் விளக்குகள் * மற்றும் * மாறும் ஆக்லூடர்களை ஆதரிக்கிறது, அதே நேரத்தில் பிரதிபலிப்புகளையும் ஆதரிக்கிறது. எடிட்டரில் அல்லது இயக்க நேரத்தில் (ஏற்றுமதி செய்யப்பட்ட திட்டத்திலிருந்து உட்பட) செய்யக்கூடிய வேகமான பேக்கிங் படி தேவைப்படுகிறது.
