Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: When using the Mobile renderer, up to 8 decals can be displayed per mesh resource.
cs: Při použití vykreslovacího nástroje Mobile lze na jeden zdroj sítě zobrazit až 8 nálepek.
fr: Lors de l'utilisation du backend Mobile, jusqu'à 8 décalques peuvent être affichés par ressource de maillage.
it: Quando si utilizza il renderer Mobile, è possibile visualizzare fino a 8 decalcomanie per ogni risorsa di mesh.
ja: Mobile レンダラーを使用する場合、メッシュリソースごとに最大8個のデカールを表示できます。
ko: 모바일 렌더러를 사용하는 경우, 메시 리소스당 최대 8개의 데칼이 표시될 수 있습니다.
ru: При использовании Mobile рендерера на один ресурс сетки может быть отображено до 8 декалей.
ta: மொபைல் ரெண்டரரைப் பயன்படுத்தும் போது, ஒரு கண்ணி வளத்திற்கு 8 டெக்கல்கள் வரை காட்டப்படலாம்.

source: **Sky:**
cs: **Obloha:**
fr: **Ciel :**
ga: **Spéir:**
it: **Cielo:**
ja: **空:**
ko: **하늘:**
pl: **Niebo:**
ru: **Небо:**
ta: ** வானம்: **
tr: **Gökyüzü:**

source: Panorama sky (using an HDRI).
cs: Panoramatická obloha (pomocí HDRI).
fr: Ciel panoramique (en utilisant un HDRI).
ga: Spéir lánléargais (ag baint úsáide as HDRI).
it: Cielo panoramico (utilizzando un HDRI).
ja: パノラマ空 (HDRIを使用)。
ko: 파노라마 하늘(HDRI 사용).
pl: Panoramiczne niebo (używając HDRI).
ru: Панорамное небо (с использованием HDRI).
ta: பனோரமா ச்கை (ஒரு HDRI ஐப் பயன்படுத்தி).
tr: Panorama gökyüzü (bir HDRI kullanarak).

source: Procedural sky and Physically-based sky that respond to the DirectionalLights in the scene.
cs: Procedurální a fyzikálně založená obloha, které reagují na směrová světla ve scéně.
fr: Ciel procédural et basé sur la physique qui répondent aux lumières directionnelles (DirectionalLights) de la scène.
ga: Spéir nós imeachta agus spéir fhisiciúil-bhunaithe a fhreagraíonn do na DirectionalLights sa radharc.
it: Cielo procedurale e cielo basato sulla fisica che reagiscono alle luci direzionali (nodo DirectionalLight) presenti nella scena.
ja: シーン内のDirectionalLightsに反応する手続き型の空と物理ベースの空。
ko: 씬의 방향성 조명에 반응하는 절차적 하늘과 물리 기반 하늘.
pl: Niebo generowane proceduralnie i niebo oparte na fizyce, które reaguje na DirectionalLight umieszczone w scenie.
ru: Процедурное небо и небо на основе физики, которые реагируют на DirectionalLight в сцене.
ta: நடைமுறை வானம் மற்றும் உடல் ரீதியாக அடிப்படையிலான வானம் காட்சியில் உள்ள திசைகளுக்கு பதிலளிக்கும்.
tr: Sahnedeki yönlü ışıklara tepki veren Yöntemsel gökyüzü ve Fiziksel-tabanlı gökyüzü.

source: Support for :ref:`custom sky shaders <doc_sky_shader>`, which can be animated.
cs: Podpora pro :ref:`vlastní shadery oblohy <doc_sky_shader>`, které lze animovat.
fr: Support pour :ref:`shaders de ciel personnalisé <doc_sky_shader>`, qui peut être animé.
ga: Tacaíocht do :ref:`custom sky shaders <doc_sky_shader>`, ar féidir iad a bheochan.
it: Supporto per :ref:`shader di cielo personalizzati <doc_sky_shader>`, che possono essere animati.
ja: アニメーション化可能な :ref:`custom sky shaders<doc_sky_shader>` のサポート。
ko: 애니메이션이 가능한 :ref:`사용자 지정 하늘 셰이더 <doc_sky_shader>`\ 에 대한 지원.
ru: Поддерживает :ref:`пользовательские шейдеры неба <doc_sky_shader>`, которые могут быть анимированы.
ta: இதற்கான ஆதரவு: குறிப்பு: `தனிப்பயன் ச்கை சேடர்கள் <doc_sky_shader>`, இது அனிமேசன் செய்யப்படலாம்.
tr: Canlandırılabilen :ref:`özel gökyüzü gölgelendiricileri <doc_sky_shader>`desteği.

source: The radiance map used for ambient and specular light can be updated in real-time depending on the quality settings chosen.
cs: Mapu záření používanou pro ambientní a zrcadlové světlo lze aktualizovat v reálném čase v závislosti na zvoleném nastavení kvality.
fr: La carte de rayonnement utilisée pour les lumières ambiantes et spéculaires peuvent être mises à jour en temps réel en fonction des paramètres de qualité choisis.
ga: Is féidir an léarscáil radiance a úsáidtear le haghaidh solas comhthimpeallach agus specular a nuashonrú i bhfíor-am ag brath ar na socruithe cáilíochta a roghnaíodh.
it: La mappa di radianza utilizzata per la luce ambientale e speculare si può aggiornare in tempo reale a seconda delle impostazioni di qualità scelte.
ja: アンビエントライトとスペキュラライトに使用される放射輝度マップは、選択した品質設定に応じてリアルタイムで更新できます。
ko: 선택한 품질 설정에 따라 환경광 및 스페큘러 조명에 사용되는 복사 맵이 실시간으로 업데이트될 수 있습니다.
ru: Карта сияния, используемая для рассеянного и зеркального света, может обновляться в режиме реального времени в зависимости от выбранных настроек качества.
ta: தேர்ந்தெடுக்கப்பட்ட தர அமைப்புகளைப் பொறுத்து சுற்றுப்புற மற்றும் ஏகப்பட்ட ஒளிக்கு பயன்படுத்தப்படும் பிரகாசமான வரைபடத்தை நிகழ்நேரத்தில் புதுப்பிக்க முடியும்.
tr: Ortamsal ve yansıtıcı ışık için kullanılan ışınım haritası, seçilen kalite ayarlarına bağlı olarak gerçek zamanlı olarak güncellenebilir.

source: **Fog:**
cs: **Mlha:**
fr: **Brouillard :**
ga: **Ceo:**
it: **Nebbia:**
ja: **霧:**
ko: **안개:**
pl: **Mgła:**
ru: **Туман:**
ta: ** மூடுபனி: **
tr: **Sis:**

source: Exponential depth fog.
cs: Mlha s exponenciální hloubkou.
fr: Profondeur de brouillard exponentielle.
ga: Ceo doimhneachta easpónantúil.
it: Nebbia di profondità esponenziale.
ja: 指数的距離フォグ。
ko: 지수형 깊이 안개.
pl: Wykładnicza mgła głębokościowa.
ru: Туман с экспоненциальной глубиной.
ta: அதிவேக ஆழ மூடுபனி.
tr: Üstel derinlik sisi.

source: Exponential height fog.
cs: Mlha s exponenciální výškou.
fr: Hauteur exponentielle du brouillard.
ga: Ceo airde easpónantúil.
it: Nebbia di altezza esponenziale.
ja: 指数的高さフォグ。
ko: 지수형 높이 안개.
pl: Wykładnicza mgła wysokościowa.
ru: Туман с экспоненциальной высотой.
ta: அதிவேக உயர மூடுபனி.
tr: Üstel yükseklik sisi.

source: Support for automatic fog color depending on the sky color (aerial perspective).
cs: Podpora automatické barvy mlhy v závislosti na barvě nebe (letecká perspektiva).
fr: Prise en charge automatique de la coloration du brouillard en fonction de la couleur du ciel (perspective aérienne).
ga: Tacaíocht do dath ceo uathoibríoch ag brath ar an dath spéir (peirspictíocht ón aer).
ja: 空の色に基づく自動の深度フォグ色に対応 (空気遠近法)。
ko: 하늘색에 따라 자동으로 안개 색상을 조정하는 기능을 지원합니다(aerial perspective).
pl: Wsparcie dla automatycznego koloru głębi mgły w zależności od koloru nieba (perspektywa powietrzna).
ru: Поддержка автоматического изменения цвета тумана в зависимости от цвета неба (воздушная перспектива).
ta: வானம் நிறத்தைப் பொறுத்து தானியங்கி மூடுபனி நிறத்திற்கான உதவி (வான்வழி முன்னோக்கு).
tr: Gökyüzü rengine bağlı olarak otomatik sis rengi desteği (hava perspektifi).

source: Support for sun scattering in the fog.
cs: Podpora rozptylu slunce v mlze.
fr: Prise en charge de la diffusion du soleil dans le brouillard.
ga: Tacaíocht do ghrian ag scaipeadh sa cheo.
it: Supporto per la diffusione della luce solare nella nebbia.
ja: 霧の中での太陽光の散乱をサポート。
ko: 안개에서 태양 산란 효과를 지원합니다.
pl: Wsparcie dla rozproszenia światła w mgle.
ru: Поддержка рассеивания солнца в тумане.
ta: மூடுபனியில் சூரிய சிதறலுக்கான உதவி.
tr: Sis içinde güneş saçılması için destek.

source: Support for controlling how much fog rendering should affect the sky, with separate controls for traditional and volumetric fog.
cs: Podpora ovládání toho, jak moc velký vliv má vykreslování mlhy mít na oblohu, se samostatnými ovládacími prvky pro tradiční a volumetrickou mlhu.
fr: Prise en charge du contrôle de la quantité de brouillard qui doit affecter le ciel, avec des contrôles séparés pour le brouillard traditionnel et volumétrique.
ga: Tacaíocht chun rialú a dhéanamh ar an méid rindreáil ceo ba chóir tionchar a imirt ar an spéir, le rialuithe ar leith le haghaidh ceo traidisiúnta agus toirtmhéadrach.
it: Supporto per il controllo della quantità di nebbia che dovrebbe influenzare il cielo, con controlli separati per la nebbia tradizionale e volumetrica.
ja: 空に影響するフォグレンダリングの量を制御できるようになりました。従来のフォグとボリュームフォグを個別に制御できます。
ko: 전통적인 안개와 볼륨 안개에 대해 별도의 제어를 통해 안개 렌더링이 하늘에 미치는 영향을 조절할 수 있습니다.
pl: Wsparcie do kontrolowania jak bardzo renderowanie mgły powinno mieć wpływ na niebo, z oddzielnym ustawieniami dla mgły tradycyjnej i objętościowej.
ru: Поддержка управления тем, как сильно туман влияет на небо, с отдельными элементами управления для традиционного и объемного тумана.
ta: பாரம்பரிய மற்றும் அளவீட்டு மூடுபனிக்கு தனி கட்டுப்பாடுகளுடன், மூடுபனி வழங்குதல் வானத்தை எவ்வளவு பாதிக்க வேண்டும் என்பதைக் கட்டுப்படுத்துவதற்கான உதவி.
tr: Geleneksel ve hacimsel sis için ayrı kontroller ile, sis işlemenin gökyüzünü ne kadar etkileyeceğini kontrol etme desteği.

source: Support for making specific materials ignore fog.
cs: Podpora ignorování mlhy konkrétními materiály.
fr: Prise en charge de la création de matériaux spécifiques ignorant le brouillard.
ga: Tacaíocht chun ábhair ar leith a dhéanamh neamhaird ceo.
it: Supporto per creare materiali specifici che ignorano la nebbia.
ja: 特定のマテリアルでフォグをマスクできるようになりました。
ko: 특정 머티리얼이 안개 효과를 무시하도록 설정할 수 있는 기능을 지원합니다.
pl: Wsparcie dla ignorowania mgły przez wybrane materiały.
ru: Поддержка определенных материалов игнорирующих туман.
ta: குறிப்பிட்ட பொருட்களை உருவாக்குவதற்கான உதவி மூடுபனியை புறக்கணிக்கிறது.
tr: Belirli malzemelerin sisi görmezden gelmesi için destek.

source: **Volumetric fog:**
cs: **Volumetrická mlha:**
fr: **Brouillard volumétrique :**
ga: **Ceo toirtmhéadrach:**
it: **Nebbia volumetrica:**
ja: **フォグボリューム:**
ko: **볼륨 안개:**
pl: **Mgła objętościowa:**
ru: **Объемный туман:**
ta: ** வால்யூமெட்ரிக் மூடுபனி: **
tr: **Hacimsel sis:**

source: Global :ref:`volumetric fog <doc_volumetric_fog>` that reacts to lights and shadows.
cs: Globální :ref:`volumetrická mlha <doc_volumetric_fog>`, která reaguje na světla a stíny.
fr: :ref:`Brouillard volumétrique <doc_volumetric_fog>` global qui réagit aux lumières et aux ombres.
ga: Global :ref:`ceo toirte <doc_volumetric_fog>` a imoibríonn do shoilse agus do scáthanna.
it: :ref:`Nebbia volumetrica <doc_volumetric_fog>` globale che reagisce a luci e ombre.
ja: グローバル :ref:`volumetric fog<doc_volumetric_fog>` ライトとシャドウに反応します。
ko: 조명과 그림자에 반응하는 글로벌 :ref:`볼륨 안개 <doc_volumetric_fog>`.
ru: Глобальный :ref:`объемный туман <doc_volumetric_fog>` реагирующий на свет и тени.
ta: உலகளாவிய: குறிப்பு: `வால்யூமெட்ரிக் மூடுபனி <டாக் வால்யூமெட்ரிக் மூடுபனி>` இது ஒளி மற்றும் நிழல்களுக்கு வினைபுரிகிறது.
tr: Işıklara ve gölgelere tepki veren genel :ref:`hacimsel sis <doc_volumetric_fog>`.

source: Volumetric fog can take indirect light into account when using VoxelGI or SDFGI.
cs: Volumetrická mlha může při použití VoxelGI nebo SDFGI reagovat na nepřímé světlo.
fr: Le brouillard volumétrique peut prendre en compte la lumière indirecte lors de l'utilisation de VoxelGI ou SDFGI.
ga: Is féidir le ceo toirtmhéadrach solas indíreach a chur san áireamh agus VoxelGI nó SDFGI á úsáid.
it: La nebbia volumetrica può tenere conto della luce indiretta quando si utilizza VoxelGI o SDFGI.
ja: ボリュームフォグでは、VoxelGIまたはSDFGIを使用する場合に間接光を考慮できます。
ko: 복셀GI(VoxelGI) 또는 부호화 거리 필드(SDFGI)를 사용할 때, 볼륨 안개는 간접 조명을 고려할 수 있습니다.
pl: Mgła objętościowa może wziąć pod uwagę światło pośrednie, kiedy użyty jest VoxelGI lub SDFGI.
ru: Объемный туман может учитывать косвенный (indirect) свет при использовании воксельного GI или SDFGI.
ta: வோக்சல்கி அல்லது எச்.டி.எஃப்.சி.ஐ பயன்படுத்தும் போது வால்யூமெட்ரிக் மூடுபனி மறைமுக ஒளியை கணக்கில் எடுத்துக்கொள்ளலாம்.
tr: Hacimsel sis, VoxelGI veya SDFGI kullanırken dolaylı ışığı hesaba katabilir.

source: Fog volume nodes that can be placed to add fog to specific areas (or remove fog from specific areas). Supported shapes include box, ellipse, cone, cylinder, and 3D texture-based density maps.
cs: Uzly objemů mlhy, které lze umístit za účelem přidání mlhy do (nebo odstranění z) určitých oblastí. Mezi podporované tvary patří kvádr, elipsa, kužel, válec a mapy hustoty založené na 3D texturách.
fr: Les nœuds de brouillard volumétriques qui peuvent être placés pour ajouter du brouillard dans des endroits spécifiques (ou retirer du brouillard d'endroits spécifiques). Les formes prises en charge sont les boîtes, les ellipses, les cônes, les cylindres, et des cartes de densités basées sur les textures 3D.
ga: Nóid toirte ceo is féidir a chur chun ceo a chur le limistéir ar leith (nó ceo a bhaint as limistéir ar leith). I measc na gcruthanna tacaithe tá bosca, éilips, cón, sorcóir, agus léarscáileanna dlús uigeacht-bhunaithe 3D.
it: Nodi del volume di nebbia che si possono posare per aggiungere nebbia ad aree specifiche (o rimuoverla da aree specifiche). Le forme supportate includono parallelepipedo, ellisse, cono, cilindro e mappe di densità basate su texture 3D.
ja: 特定の領域にフォグを追加する (または特定の領域からフォグを削除する) ために配置できるフォグボリュームノード。サポートされている図形には、ボックス、楕円、円錐、円柱、および3Dテクスチャベースの密度マップが含まれます。
ko: 특정 영역에 안개를 추가하거나 제거할 수 있는 안개 볼륨 노드. 지원되는 형태로는 상자, 타원, 원뿔, 원통, 3D 텍스처 기반 밀도 맵이 있습니다.
ru: Узлы объема тумана, которые можно разместить для добавления тумана в определенные области (или удаления тумана из определенных областей). Поддерживаемые формы включают прямоугольник, эллипс, конус, цилиндр и карты плотности на основе 3D-текстур.
ta: குறிப்பிட்ட பகுதிகளுக்கு மூடுபனி சேர்க்க (அல்லது குறிப்பிட்ட பகுதிகளிலிருந்து மூடுபனியை அகற்ற) வைக்கக்கூடிய மூடுபனி தொகுதி முனைகள். உதவி வடிவங்களில் பெட்டி, நீள்வட்டம், கூம்பு, சிலிண்டர் மற்றும் 3D அமைப்பு அடிப்படையிலான அடர்த்தி வரைபடங்கள் அடங்கும்.
tr: Belirli alanlara sis eklemek (veya belirli alanlardan sisi kaldırmak) için yerleştirilebilen sis hacmi düğümleri. Desteklenen şekiller arasında kutu, elips, koni, silindir ve 3B doku tabanlı yoğunluk haritaları bulunur.

source: Each fog volume can have its own custom shader.
cs: Každý objem mlhy může mít vlastní shader.
fr: Chaque volume de brouillard peut avoir son propre shader personnalisé.
ga: Is féidir le gach toirt ceo a shader saincheaptha féin a bheith aige.
it: Ogni volume di nebbia può avere il proprio shader personalizzato.
ja: 各フォグボリュームは独自のカスタムシェーダを持つことができます。
ko: 각 안개 볼륨에는 고유한 사용자 지정 셰이더를 가질 수 있습니다.
ru: Каждый туман может иметь свой собственный пользовательский шейдер.
ta: ஒவ்வொரு மூடுபனி தொகுதியும் அதன் சொந்த தனிப்பயன் நிழலைக் கொண்டிருக்கலாம்.
tr: Her sis hacmi kendi özel gölgelendiricisine sahip olabilir.

source: Can be used together with traditional fog.
cs: Lze použít společně s tradiční mlhou.
fr: Peut être utilisé avec un brouillard traditionnel.
ga: Is féidir é a úsáid in éineacht le ceo traidisiúnta.
it: Si può utilizzare insieme alla nebbia tradizionale.
ja: 従来のフォグと併用できます。
ko: 전통적인 안개와 함께 사용할 수 있습니다.
ru: Может использоваться вместе с традиционным туманом.
ta: பாரம்பரிய மூடுபனியுடன் சேர்ந்து பயன்படுத்தலாம்.
tr: Geleneksel sis ile birlikte kullanılabilir.

source: **Particles:**
cs: **Částice:**
fr: **Particules :**
ga: **Cáithníní:**
it: **Particelle:**
ja: **パーティクル:**
ko: **입자:**
pl: **Cząsteczki:**
ru: **Частицы:**
ta: ** துகள்கள்: **
tr: **Parçacıklar:**

source: GPU-based particles with support for subemitters (2D + 3D), trails (2D + 3D), attractors (3D only) and collision (2D + 3D).
cs: Částice na bázi GPU s podporou pro dílčí emitory (2D + 3D), stopy (2D + 3D), atraktory (pouze 3D) a kolize (2D + 3D).
fr: Particules basées sur le GPU avec prise en charge des sous-émetteurs (2D + 3D), des traînées (2D + 3D), des attracteurs (3D uniquement) et des collisions (2D + 3D).
ga: Cáithníní GPU-bhunaithe le tacaíocht do subemitters (2D + 3D), cosáin (2D + 3D), mealltóirí (3D amháin) agus imbhualadh (2D + 3D).
it: Particelle basate sulla GPU, con supporto per sotto-emettitori (2D + 3D), scie (2D + 3D), attrattori (solo 3D) e collisioni (2D + 3D).
ja: サブエミッタ (2D+3D)、トレイル (2D+3D)、アトラクタ (3Dのみ)、およびコリジョン (2D+3D) をサポートするGPUベースのパーティクル。
ko: 하위방출기(2D + 3D), 트레일(2D + 3D), 어트랙터(3D 전용) 및 콜리전(2D + 3D)을 지원하는 GPU 기반 입자.
ru: Частицы использующие видеокарту с поддержкой субэмиттеров (subemitters) (2D + 3D), троп (2D + 3D), аттракторов (только 3D) и столкновений (2D + 3D).
ta: துணை மெமிட்டர்கள் (2 டி + 3 டி), தடங்கள் (2 டி + 3 டி), ஈர்ப்பவர்கள் (3 டி மட்டும்) மற்றும் மோதல் (2 டி + 3 டி) ஆகியவற்றிற்கான ஆதரவுடன் சி.பீ.யு அடிப்படையிலான துகள்கள்.
tr: Alt yayıcılar (2B + 3B), izler (2B + 3B), çekiciler (yalnızca 3B) ve çarpışma (2B + 3B) desteğine sahip GPU-tabanlı parçacıklar.

source: 3D particle attractor shapes supported: box, sphere and 3D vector fields.
cs: Podporované tvary atraktorů 3D částic: krabice, sféra a 3D vektorová pole.
fr: Attracteur de particules 3D avec des formes supportées : boîte, sphère et des champs de vecteurs 3D.
ga: Cruthanna mealltóra cáithníní 3D tacaithe: réimsí bosca, sféar agus veicteoir 3D.
it: Attrattore di particelle 3D con forme supportate: parallepipedo, sfera e campi di vettori 3D.
ja: 使用可能な3Dパーティクル・アトラクタの形状: ボックス、球体、および3Dベクトルフィールド。
ko: 지원되는 3D 입자 어트랙터 모양: 상자, 구체와 3D 벡터 필드.
ru: Поддерживаются формы 3D-аттракторов частиц: параллелепипед, сфера и 3D-векторные поля.
ta: 3 டி துகள் ஈர்ப்பது வடிவங்கள் ஆதரிக்கப்படுகின்றன: பெட்டி, கோளம் மற்றும் 3 டி திசையன் புலங்கள்.
tr: 3B parçacık çekici şekiller desteklenir: kutu, küre ve 3B vektör alanları.

source: 3D particle collision shapes supported: box, sphere, baked signed distance field and real-time heightmap (suited for open world weather effects).
cs: Podporované tvary kolize 3D částic: kvádr, sféra, vypálené pole vzdáleností se znaménkem a výšková mapa v reálném čase (vhodná pro efekty počasí v otevřeném světě).
fr: Formes de collision de particules 3D prises en charge : boîte, sphère, champ de distance signée précalculé et carte de hauteur en temps réel (adapté aux effets météorologiques en monde ouvert).
ga: Tacaítear le cruthanna imbhuailte cáithníní 3D: bosca, sféar, réimse achair shínithe bácáilte agus mapa airde fíor-ama (a oireann d'éifeachtaí aimsire oscailte an domhain).
it: Forme di collisione di particelle 3D supportate: parallelepipedo, sfera, SDF precalcolato e heightmap in tempo reale (adatto per effetti meteorologici in mondi aperti).
ja: 使用可能な3Dパーティクルの衝突の形状: 箱型、球体、ベイク済みの符号付距離フィールド、およびリアルタイム・ハイトマップ (オープンワールドの天候効果に最適)。
ko: 지원되는 3D 입자 콜리전 모양: 상자, 구체, 구워진 부호화 디스턴스 필드(SDF) 및 실시간 높이맵 (오픈 월드 날씨 효과에 적합).
ru: Поддерживаются формы столкновения 3D-частиц: параллелепипед, сфера, запеченное поле расстояния со знаком и карта высот в режиме реальном времени (подходит для погодных эффектов открытого мира).
ta: 3 டி துகள் மோதல் வடிவங்கள் ஆதரிக்கப்படுகின்றன: பெட்டி, கோளம், வேகவைத்த கையொப்பமிடப்பட்ட தூர புலம் மற்றும் நிகழ்நேர உயரம் (திறந்த உலக வானிலை விளைவுகளுக்கு ஏற்றது).
tr: 3B parçacık çarpışma şekilleri desteklenir: kutu, küre, pişirilmiş işaretli mesafe alanı ve gerçek zamanlı yükseklik haritası (açık dünya hava efektleri için uygundur).

source: 2D particle collision is handled using a signed distance field generated in real-time based on :ref:`class_LightOccluder2D` nodes in the scene.
cs: Kolize 2D částic je řešena pomocí pole vzdáleností se znaménkem generovaného v reálném čase na základě :ref:`class_LightOccluder2D` ("2D stínidlo světla") uzlů ve scéně.
fr: La collision de particules en 2D est gérée en utilisant un champ de distance signée généré en temps réel, basé sur les nœuds :ref:`class_LightOccluder2D` présents dans la scène.
ga: Déantar imbhualadh cáithníní 2D a láimhseáil ag baint úsáide as réimse achar sínithe a ghintear i bhfíor-am bunaithe ar nóid :ref:'class_LightOccluder2D' sa radharc.
it: La collisione delle particelle 2D viene gestita utilizzando un SDF generato in tempo reale in base ai nodi :ref:`class_LightOccluder2D` nella scena.
ja: 2Dパーティクル・コリジョンは、シーン内の :ref:`class_LightOccluder2D` ノードに基づいて、リアルタイムで生成された符号付き距離フィールドを使用して処理されます。
ko: 2D 입자 콜리전은 씬의 :ref:`class_LightOccluder2D` 노드를 기반으로 실시간으로 생성된 부호화 디스턴스 필드를 사용하여 처리됩니다.
ru: Столкновение двумерных частиц обрабатывается с использованием signed distance field, сгенерированного в режиме реального времени с помощью узлов :ref:`class_LightOccluder2D` в сцене.
ta: 2 டி துகள் மோதல் நிகழ்நேரத்தில் உருவாக்கப்பட்ட கையொப்பமிடப்பட்ட தூர புலத்தைப் பயன்படுத்தி கையாளப்படுகிறது: குறிப்பு: `class_lightoccluder2d` காட்சியில்.
tr: 2B parçacık çarpışması, sahnedeki :ref:`class_LightOccluder2D` düğümlerine dayalı olarak gerçek zamanlı olarak oluşturulan bir işaretli mesafe alanı kullanılarak işlenir.

source: Trails can use the built-in ribbon trail and tube trail meshes, or custom meshes with skeletons.
cs: Stopy mohou využívat vestavěné sítě pro pásové a trubicové stopy nebo vlastní sítě s kostrami.
fr: Les traînées peuvent utiliser les maillages de traînée ruban et tube intégrés, ou des maillages personnalisés avec des squelettes.
ga: Is féidir le cosáin úsáid a bhaint as an rian ribíneach tógtha agus mogall rian feadán, nó mogalraí saincheaptha le cnámharlaigh.
it: Le scie possono usare le mesh integrate a nastro e a tubo, oppure mesh personalizzate con scheletri.
ja: トレイルは、組み込みのリボン形トレイルやチューブ形トレイルメッシュ、またはスケルトンを含むカスタムメッシュを使用できます。
ko: 트레일은 내장 리본 트레일과 튜브 트레일 메시를 사용하거나, 스켈레톤이 있는 사용자 지정 메시를 사용할 수 있습니다.
ru: Следы (trails) могут использовать встроенные модели ленты (ribbon trail) и трубы (tube trail), а так же пользовательские модели со скелетами.
ta: தடங்கள் உள்ளமைக்கப்பட்ட ரிப்பன் டிரெயில் மற்றும் டியூப் டிரெயில் மெச்கள் அல்லது எலும்புக்கூடுகளுடன் தனிப்பயன் மெச்களைப் பயன்படுத்தலாம்.
tr: Yollar, yerleşik şerit iz ve tüp iz örgülerini veya iskeletli özel örgülerini kullanabilir.

source: Support for custom particle shaders with manual emission.
cs: Podpora pro vlastní částicové shadery s manuální emisí.
fr: Prise en charge des shaders de particules personnalisés avec une émission manuelle.
ga: Tacaíocht do shaders cáithníní saincheaptha le hastaíocht láimhe.
it: Supporto per shader di particelle personalizzati con emissione manuale.
ja: 手動放出ができるカスタムのパーティクルシェーダーをサポート。
ko: 수동 방출로 사용자 지정 입자 셰이더를 지원합니다.
ru: Поддержка пользовательских шейдеров частиц с настраиваемой эмиссией.
ta: கையேடு உமிழ்வுடன் தனிப்பயன் துகள் சேடர்களுக்கான உதவி.
tr: Elden denetimli yayılım ile özel parçacık gölgelendiriciler için destek.

source: **Post-processing:**
cs: **Následné zpracování:**
fr: **Post-traitement :**
ga: **Iarphróiseáil:**
it: **Post-elaborazione:**
ja: **ポストプロセッシング:**
ko: **포스트 프로세싱:**
ru: **Постобработка:**
ta: ** பிந்தைய செயலாக்கம்: **
tr: **Sonra-işleme**

source: Automatic exposure adjustments based on viewport brightness (and manual exposure override).
cs: Automatické nastavení expozice na základě jasu průzoru (a ruční přenastavení expozice).
fr: Ajustements automatiques de l'exposition basés sur la luminosité de la fenêtre d'affichage (et remplacement manuelle de l'exposition).
ga: Coigeartuithe nochta uathoibríocha bunaithe ar ghile viewport (agus sárú nochta láimhe).
it: Regolazione automatica dell'esposizione in base alla luminosità della viewport (e sostituzione manuale dell'esposizione).
ja: ビューポートの明るさに基づく自動露出調節(および手動での露出オーバーライド)。
ko: 뷰포트의 밝기에 따라 자동으로 노출을 조정하는 기능을 지원합니다(수동으로 노출을 재정의하는 것도 가능).
ru: Автоматическая регулировка экспозиции в зависимости от яркости области просмотра (и ручного переопределения).
ta: வியூபோர்ட் பிரகாசத்தின் அடிப்படையில் தானியங்கி வெளிப்பாடு சரிசெய்தல் (மற்றும் கையேடு வெளிப்பாடு மேலெழுதல்).
tr: Çerçeve parlaklığına göre otomatik pozlama ayarlamaları (ve elden denetimli pozlama geçersiz kılma).

source: Near and far depth of field with adjustable bokeh simulation (box, hexagon, circle).
cs: Blízká a vzdálená hloubka ostrosti s nastavitelnou simulací bokehu (kostkový, šestiúhelníkový, kruhový).
fr: Profondeur de champ rapprochée et lointaine avec simulation de bokeh ajustable (boîte, hexagone, cercle).
ga: In aice agus i bhfad doimhneacht réimse le insamhalta bokeh adjustable (bosca, heicseagán, ciorcal).
it: Profondità di campo vicina e lontana con simulazione bokeh regolabile (riquadro, esagono, cerchio).
ja: 調節可能なボケのシミュレーション (箱形、六角形、円形) 付きの、近景と遠景の被写界深度。
ko: 조절 가능한 보케 시뮬레이션(상자, 육각형, 원)이 포함된 근거리 및 원거리 피사계 심도.
ru: Глубина резкости вблизи и вдали с настраиваемой имитацией боке (прямоугольник, шестиугольник, круг).
ta: சரிசெய்யக்கூடிய பொக்கே உருவகப்படுத்துதலுடன் (பெட்டி, அறுகோணம், வட்டம்) புலத்தின் அருகிலுள்ள மற்றும் தூர ஆழம்.
tr: Ayarlanabilir bokeh benzetimi (kutu, altıgen, daire) ile yakın ve uzak alan derinliği.
