Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: Most effects listed above can be adjusted for better performance or to further improve quality. This can be helpful when :ref:`using Godot for offline rendering <doc_creating_movies>`.
cs: Většinu výše uvedených efektů lze upravit pro lepší výkon nebo další zlepšení kvality. To může být užitečné, když :ref:`používáte Godot pro offline vykreslování <doc_creating_movies>`.
fr: La plupart des effets mentionnés ci-dessus peuvent être ajustés pour améliorer les performances ou pour améliorer davantage la qualité. Cela peut être utile lorsque vous utilisez :ref:`Utilisation de Godot pour le rendu hors ligne <doc_creating_movies>`.
ga: Is féidir an chuid is mó de na héifeachtaí atá liostaithe thuas a choigeartú le haghaidh feidhmíochta níos fearr nó chun cáilíocht a fheabhsú tuilleadh. D'fhéadfadh sé seo a bheith ina chuidiú nuair a :ref:`úsáid Godot le haghaidh rindreála as líne <doc_creating_movies>`.
it: La maggior parte di questi effetti si possono regolare per migliorare le prestazioni o per migliorare ulteriormente la qualità. Ciò può essere utile quando :ref:`si utilizza Godot per il rendering offline <doc_creating_movies>`.
ja: これらエフェクトのほとんどは、より良いパフォーマンス、もしくはクオリティー改善のために調整できます。これは :ref:`Godotをオフラインレンダリングで使用する <doc_creating_movies>` 際に役立ちます。
ko: 이 효과들의 대부분은 더 나은 성능 또는 더 나은 품질을 위해 조정할 수 있습니다. 이는 :ref:`Godot를 오프라인 렌더링에 사용할 때 <doc_creating_movies>` 유용합니다.
ru: Большинство перечисленных выше эффектов можно отрегулировать для повышения производительности или дальнейшего улучшения качества. Это может быть полезно при :ref:`использовании Godot для оффлайн рендеринга <doc_creating_movies>`.
ta: மேலே பட்டியலிடப்பட்டுள்ள பெரும்பாலான விளைவுகள் சிறந்த செயல்திறனுக்காக அல்லது தரத்தை மேலும் மேம்படுத்த சரிசெய்யலாம். இது உதவியாக இருக்கும்: ref: `ஆஃப்லைன் ரெண்டரிங்கிற்கு கோடோட்டைப் பயன்படுத்துதல் <doc_creating_movies>`.
tr: Yukarıda listelenen efektlerden birçoğu, daha iyi performans elde etmek ya da kaliteyi artırmak için ayarlanabilir. Bu, :ref:`Godot'u çevrim dışı işleme için kullanma <doc_creating_movies>` konusunda yardımcı olabilir.

source: 3D tools
cs: 3D nástroje
fr: Outils 3D
ga: Uirlisí 3D
it: Strumenti 3D
ja: 3Dツール
ko: 3D 툴
pl: Narzędzia 3D
ru: 3D инструменты
ta: 3D கருவிகள்
tr: 3B araçlar

source: Built-in meshes: cube, cylinder/cone, (hemi)sphere, prism, plane, quad, torus, ribbon, tube.
cs: Vestavěné sítě: krychle, válec/kužel, (polo)koule, hranol, rovina, čtyřúhelník, torus, pás, trubice.
fr: Maillages intégrés : cube, cylindre/cône, (hémisphère)sphère, prisme, plan, quadrilatère, tore, ruban, tube.
ga: Mogalraí tógtha: ciúb, sorcóir / cón, (hemi) sféar, priosma, eitleán, quad, torus, ribín, feadán.
it: Mesh integrate: cubo, cilindro/cono, (emi)sfera, prisma, piano, quad, toro, nastro, tubo.
ja: ビルトインのメッシュ: 立方体・円柱・円錐・(半)球・角柱・平面・四角形・トーラス・リボン・チューブ。
ko: 내장 메시: 육면체, 원통/원뿔, (반)구체, 각기둥, 평면, 사변형, 원환체, 리본, 튜브.
pl: Wbudowane siatki: sześcian, cylinder/stożek, (pół)kula, pryzmat, płaszczyzna, wielokąt, torus, wstążka, rura.
ru: Встроенные сетки: куб, цилиндр/конус, (полу)сфера, призма, плоскость, четырёхугольник, тор, лента, труба.
ta: உள்ளமைக்கப்பட்ட மெச்கள்: கியூப், சிலிண்டர்/கூம்பு, (எமி) கோளம், ப்ரிசம், வானூர்தி, குவாட், டோரச், ரிப்பன், குழாய்.
tr: Gömülü örgüler: küp, silindir/koni, (yarım)küre, prizma, düzlem, dörtgen, torus, şerit, tüp.

source: :ref:`GridMaps <doc_using_gridmaps>` for 3D tile-based level design.
cs: :ref:`Mřížkové mapy <doc_using_gridmaps>` pro návrh úrovní založených na 3D dlaždicích.
fr: :ref:`GridMaps <doc_using_gridmaps>` pour la conception de niveaux basés sur des tuiles.
ga: :ref:`GridMaps <doc_using_gridmaps>` le haghaidh dearadh leibhéal 3D bunaithe ar tíleanna.
it: :ref:`GridMap <doc_using_gridmaps>` per la progettazione di livelli basati su tasselli 3D.
ja: :ref:`GridMaps <doc_using_gridmaps>` は、3Dタイルベースのレベルデザインに使用されす。
ko: :ref:`GridMaps <doc_using_gridmaps>`\ 를 사용한 3D 타일 기반 레벨 디자인.
ru: :ref:`GridMaps <doc_using_gridmaps>` для 3D дизайна уровней на основе тайлов.
ta: :ref:`GridMaps <doc_using_gridmaps>` க்கு 3D tile-based நிலை design.
tr: 3B karo tabanlı seviye tasarımı için :ref:`Izgara Haritaları (GridMap) <doc_using_gridmaps>`.

source: :ref:`Constructive solid geometry <doc_csg_tools>` (intended for prototyping).
cs: :ref:`Konstrukční geometrie těles <doc_csg_tools>` (určená pro prototypování).
fr: :ref:`Géométrie constructive des solides (CSG)<doc_csg_tools>` (destiné au prototypage).
ga: :ref:`Céimseata soladach inchiallaithe <doc_csg_tools>` (atá beartaithe le haghaidh fréamhshamhla).
it: :ref:`Geometria solida costruttiva <doc_csg_tools>` (pensata per la prototipazione).
ja: :ref:`空間領域構成法(CSG) <doc_csg_tools>` (プロトタイピング用)。
ko: :ref:`구조적 입체기하학 <doc_csg_tools>`\ (프로토타이핑을 위해 의도됨).
pl: :ref:`Konstruktywna geometria <doc_csg_tools>` (przydatne prototypowaniu).
ru: :ref:`Конструктивная твердотельная геометрия <doc_csg_tools>` (предназначена для прототипирования).
ta: : குறிப்பு: `ஆக்கபூர்வமான திட வடிவியல் <doc_csg_tools>` (முன்மாதிரி நோக்கம்).
tr: :ref:`Yapıcı katı geometri <doc_csg_tools>` (ön-örnekleme amaçlı).

source: Tools for :ref:`procedural geometry generation <doc_procedural_geometry>`.
cs: Nástroje pro :ref:`procedurální generování geometrie <doc_procedural_geometry>`
fr: Outils pour la :ref:`génération de la géométrie procédurale <doc_procedural_geometry>`.
ga: Uirlisí le haghaidh :ref:`glúin céimseata nós imeachta <doc_procedural_geometry>`.
it: Strumenti per :ref:`generazione geometrica procedurale <doc_procedural_geometry>`.
ja: :ref:`手続き型ジオメトリ生成 <doc_procedural_geometry>` 用ツール。
ko: :ref:`절차적 기하 생성 <doc_procedural_geometry>`\ 을 위한 툴.
pl: :ref:`Geometria generowana procedularnie <toc-procedural_geometry>`.
ru: Инструменты для :ref:`генерации процедурной геометрии <doc_procedural_geometry>`.
ta: இதற்கான கருவிகள்: குறிப்பு: `நடைமுறை வடிவியல் தலைமுறை <doc_procedural_geometry>`.
tr: :ref:`Yöntemsel geometri üretimi <doc_procedural_geometry>` için araçlar.

source: Path3D node to represent a path in 3D space.
cs: Uzel Path3D reprezentující cestu ve 3D prostoru.
fr: Nœud Path3D pour représenter un chemin dans l'espace 3D.
ga: Nód Path3D chun cosán a léiriú i spás 3D.
it: Nodo Path3D per rappresentare un percorso nello spazio 3D.
ja: 3D空間で経路を表現する Path3D ノード。
ko: 3D 공간에서의 경로를 나타내는 Path3D 노드.
pl: Węzeł Path3D (Ścieżka3D) by pokazać ścieżkę w przestrzeni 3D.
ru: Узел Path3D для представления пути в 3D пространстве.
ta: 3D இடத்தில் ஒரு பாதையை குறிக்க PATH3D முனை.
tr: 3B uzayda bir yolu temsil eden Path3D düğümü.

source: PathFollow3D node to make nodes follow a Path3D.
cs: Uzel PathFollow3D, za pomoci kterého mohou uzly sledovat cestu definovanou Path3D.
fr: PathFollow3D pour que les nœuds suivent un Path3D.
ga: Nód PathFollow3D chun nóid a dhéanamh lean Path3D.
it: Nodo PathFollow3D per fare in modo che i nodi seguano un Path3D.
ja: ノードを Path3D に追従させるためのノードである PathFollow3D。
ko: 노드가 Path3D 경로를 따라가도록 하는 PathFollow3D 노드.
pl: Węzeł PathFollow3D (ŚledzenieŚcieżki3D) by węzeł podążał za Path3D (Ścieżka3D).
ru: Узел PathFollow3D, позволяющий узлам следовать по Path3D.
ta: Pathfollow3d முனை முனைகள் ஒரு பாதை 3D ஐப் பின்பற்றுகின்றன.
tr: Düğümlerin bir Path3D'yi takip etmesini sağlamak için PathFollow3D düğümü.

source: :ref:`3D geometry helper class <class_Geometry3D>`.
cs: :ref:`Pomocná třída pro 3D geometrii <class_Geometry3D>`.
fr: :ref:`Classe d'assistance géométrique 3D <class_Geometry3D>`.
ga: :ref:`rang cúntóir céimseata 3D <class_Geometry3D>`.
it: :ref:`Classe ausiliare per la geometria 3D. <class_Geometry3D>`.
ja: :ref:`3Dジオメトリ用ヘルパークラス <class_Geometry3D>`。
ko: :ref:`3D 기하 도우미 클래스 <class_Geometry3D>`.
ru: :ref:`Вспомогательный класс 3D геометрии <class_Geometry3D>`.
ta: :ref:`3D geometry helper வகுப்பு <class_Geometry3D>`.
tr: :ref:`3B geometri yardımcı sınıfı <class_Geometry3D>`.

source: Support for exporting the current scene as a glTF 2.0 file, both from the editor and at runtime from an exported project.
cs: Podpora exportu aktuální scény jako souboru glTF 2.0, a to jak z editoru, tak za běhu z exportovaného projektu.
fr: Support pour l'exportation de la scène actuelle au format glTF 2.0, à la fois depuis l'éditeur et au moment de l'exécution depuis un projet exporté.
it: Supporto per l'esportazione della scena attuale come file in formato glTF 2.0, sia dall'editor sia durante l'esecuzione di un progetto esportato.
ja: エディタとエクスポートされたランタイム上で、現在のシーンをglTF2.0ファイルへのエクスポートすることができます。
ru: Поддержка экспорта текущей сцены в виде файла glTF 2.0 как из редактора, так и во время выполнения из экспортированного проекта.
ta: தற்போதைய காட்சியை சி.எல்.டி.எஃப் 2.0 கோப்பாக ஏற்றுமதி செய்வதற்கான உதவி, எடிட்டரிடமிருந்து மற்றும் ஏற்றுமதி செய்யப்பட்ட திட்டத்திலிருந்து இயக்க நேரத்தில்.

source: 3D physics
cs: 3D fyzika
fr: Physique 3D
ga: Fisic 3T
it: Fisica 3D
ja: 3D物理
ko: 3D 물리
pl: Fizyka 3D
ru: 3D физика
ta: 3 டி இயற்பியல்
tr: 3B fizik

source: Vehicle bodies (intended for arcade physics, not simulation).
cs: Tělesa vozidel (určené pro arkádovou fyziku, nikoli pro simulaci).
fr: Corps de véhicules (destinées à la physique arcade, pas à la simulation).
ga: Comhlachtaí feithiclí (atá beartaithe le haghaidh fisice stuara, ní insamhalta).
it: Corpi di veicoli (destinati alla fisica arcade, non alla simulazione).
ja: 乗り物ボディ (シミュレーションではなく、アーケード物理用)。
ko: 차체 (시뮬레이션이 아닌 오락용 물리를 위한 물체).
pl: Ciała pojazdów (stworzone dla fizyki arcade, nie symulacji).
ru: Тела транспортных средств (предназначается для аркадной физики, не симуляций).
ta: வாகன உடல்கள் (ஆர்கேட் இயற்பியலுக்காக நோக்கம் கொண்டவை, உருவகப்படுத்துதல் அல்ல).
tr: Araç cisimleri (arcade oyun fiziği için tasarlanmıştır, benzetim için değil).

source: Soft bodies.
cs: Měkká tělesa.
fr: Corps mous.
ga: Comhlachtaí boga.
it: Corpi morbidi.
ja: ソフトボディ。
ko: 연체.
pl: Miękkie ciała.
ru: Мягкие тела.
ta: மென்மையான உடல்கள்.
tr: Yumuşak cisimler.

source: Ragdolls.
cs: Ragdolly.
ga: Ragdoll.
ja: ラグドール。
ko: 래그돌.
pl: Ragdolle.
ru: Система Ragdolls.
ta: ராக்டோல்ச்.
tr: Kuklalar.

source: Built-in shapes: cuboid, sphere, capsule, cylinder, world boundary (infinite plane).
cs: Vestavěné tvary: šestistěn, sféra, kapsle, válec, hranice světa (nekonečná rovina).
fr: Formes intégrées : parallélépipède, sphère, capsule, cylindre, limite du monde (plan infini).
ga: Cruthanna tógtha: cuboid, sféar, capsule, sorcóir, teorainn an domhain (plána gan teorainn).
it: Forme integrate: cuboide, sfera, capsula, cilindro, confine di mondo (piano infinito).
ja: ビルトインのシェイプ: 直方体・球・カプセル・円柱・ワールド境界 (無限平面)。
ko: 내장 모양: 직육면체, 구체, 캡슐, 원통, 세계 경계 (무한 평면).
pl: Wbudowane kształty: prostopadłościan, kula, kapsułka, walec, granica świata (nieskończona płaszczyzna).
ru: Встроенные формы: кубоид, сфера, капсула, цилиндр, граница мира (бесконечная плоскость).
ta: உள்ளமைக்கப்பட்ட வடிவங்கள்: க்யூபாய்டு, கோளம், காப்ச்யூல், சிலிண்டர், உலக எல்லை (எல்லையற்ற விமானம்).
tr: Yerleşik şekiller: dikdörtgen prizma, küre, kapsül, silindir, dünya sınırı (sonsuz düzlem).

source: Generate triangle collision shapes for any mesh from the editor.
cs: Generujte trojúhelníkové kolizní tvary pro libovolnou síť v editoru.
fr: Générer des formes de collision triangle pour n'importe quel maillage à partir de l'éditeur.
ga: Gin cruthanna imbhuailte triantáin d'aon mhogall ón eagarthóir.
it: Genera forme di collisione a triangolo per qualsiasi mesh dall'editor.
ja: エディタから任意のメッシュの形状の三角コリジョンが生成可能。
ko: 어느 메시든지 편집기에서 삼각형 콜리전 모양을 생성합니다.
pl: Generuj trójkątne kształty kolizji dla dowolnej siatki z edytora.
ru: Создание треугольных форм столкновения для любой сетки из редактора.
ta: எடிட்டரிடமிருந்து எந்த கண்ணியத்திற்கும் முக்கோண மோதல் வடிவங்களை உருவாக்குங்கள்.
tr: Düzenleyici içinden herhangi bir örgü için üçgen çarpışma şekilleri oluşturun.

source: Generate one or several convex collision shapes for any mesh from the editor.
cs: Generujte jeden nebo několik konvexních kolizních tvarů pro libovolnou síť v editoru.
fr: Générer une ou plusieurs formes de collision convexes pour n'importe quel maillage à partir de l'éditeur.
ga: Gin cruthanna imbhuailte dronnach amháin nó níos mó d'aon mhogall ón eagarthóir.
it: Genera una o più forme di collisione convesse per qualsiasi mesh dall'editor.
ja: エディタから任意のメッシュの形状の、一つまたは複数の凸型コリジョンが生成可能。
ko: 어느 메시든지 편집기에서 하나 이상의 컨벡스 콜리전 모양을 생성합니다.
pl: Wygeneruj jeden lub parę wypukłych kształtów kolizji dla dowolnej siatki obiektu 3D z edytora.
ru: Создание одной или нескольких выпуклых форм столкновения для любой сетки из редактора.
ta: எடிட்டரிடமிருந்து எந்த கண்ணியத்திற்கும் ஒன்று அல்லது பல குவிந்த மோதல் வடிவங்களை உருவாக்குங்கள்.
tr: Düzenleyici içinden herhangi bir örgü için bir veya birçok dışbükey çarpışma şekli oluşturun.

source: Shaders
cs: Shadery
ga: Scáthóirí
it: Shader
ja: シェーダー
ko: 셰이더
pl: Shadery
ru: Шейдеры
ta: சேடர்ச்
tr: Gölgelendiriciler

source: *2D:* Custom vertex, fragment, and light shaders.
cs: *2D:* Vlastní vertexové, fragmentové a světelné shadery.
fr: *2D :* Vertex, fragment et shaders de lumière personnalisés.
ga: * 2D: * Vertex saincheaptha, blúire, agus shaders éadrom.
it: *2D:* Shader personalizzati per vertici, frammenti e illuminazione.
ja: *2D:* 頂点、フラグメント、ライト用のカスタムのシェーダ。
ko: *2D:* 사용자 지정 버텍스, 프래그먼트 및 라이트 셰이더.
pl: *2D:* niestandardowe wierzchołki, fragmenty oraz shadery światła.
ru: *2D:* Пользовательские вершинные, фрагментные и световые шейдеры.
ta: * 2 டி:* தனிப்பயன் வெர்டெக்ச், துண்டு மற்றும் ஒளி சேடர்கள்.
tr: *2B:* Özel köşe, parça ve ışık gölgelendiricileri.

source: *3D:* Custom vertex, fragment, light, and sky shaders.
cs: *3D:* Vlastní vertexové, fragmentové, světelné shadery a shadery oblohy.
fr: *3D :* Vertex, fragment, lumière et shaders de ciel personnalisés.
ga: * 3D: * Vertex saincheaptha, blúire, solas, agus shaders spéir.
it: *3D:* Shader personalizzati per vertici, frammenti, illuminazione e cielo.
ja: *3D:* 頂点、フラグメント、ライト、天球用のカスタムのシェーダ。
ko: *3D:* 사용자 지정 버텍스, 프래그먼트, 라이트 및 하늘 셰이더.
pl: *3D:* Niestandardowe wierzchołki, fragmenty, światło oraz shadery nieba.
ru: *3D:* Пользовательские вершинные, фрагментные, световые и шейдеры неба.
ta: * 3 டி:* தனிப்பயன் வெர்டெக்ச், துண்டு, ஒளி மற்றும் வான சேடர்கள்.
tr: *3B:* Özel köşe, parça, ışık ve gökyüzü gölgelendiricileri.

source: Text-based shaders using a :ref:`shader language inspired by GLSL <doc_shading_language>`.
cs: Textové shadery používající :ref:`shaderový jazyk inspirovaný jazykem GLSL <doc_shading_language>`.
fr: Shaders basés sur du texte utilisant un :ref:`langage de shader inspiré de GLSL <doc_shading_language>`.
ga: Shaders téacs-bhunaithe ag baint úsáide as :ref:`teanga shader spreagtha ag GLSL <doc_shading_language>`.
it: Shader basati su testo che utilizzano un :ref:`linguaggio di shader ispirato da GLSL <doc_shading_language>`.
ja: テキストベースのシェーダは :ref:`GLSLにインスパイアされたシェーダ言語 <doc_shading_language>`\ を使っています。
ko: :ref:`GLSL에서 영감을 얻은 셰이더 언어 <doc_shading_language>`\ 를 사용한 텍스트 기반 셰이더.
ru: Текстовые шейдеры, использующие :ref:`язык шейдеров, вдохновлённый GLSL <doc_shading_language>`.
ta: A: ref ஐப் பயன்படுத்தும் உரை அடிப்படையிலான சேடர்கள்: `GLSL <oc_shading_language> by ஆல் ஈர்க்கப்பட்ட சேடர் மொழி.
tr: :ref:`GLSL'den ilham alan gölgelendirici dili <doc_shading_language>` kullanan metin tabanlı gölgelendiriciler.

source: Visual shader editor.
cs: Vizuální editor shaderů.
fr: Éditeur de shaders visuels.
ga: Eagarthóir scáthaithe amhairc.
it: Editor di visual shader.
ja: ビジュアルシェーダーエディタ。
ko: 비주얼 셰이더 편집기.
pl: Wizualny edytor shaderów.
ru: Визуальный редактор шейдеров.
ta: விசுவல் சேடர் எடிட்டர்.
tr: Görsel gölgelendirici düzenleyici.

source: Support for visual shader plugins.
cs: Podpora zásuvných modulů pro vizuální shadery.
fr: Prise en charge des plugins de shaders visuels.
ga: Tacaíocht do bhreiseáin shader amhairc.
it: Supporto per plug-in visual shader.
ja: ビジュアルシェーダープラグイン。
ko: 비주얼 셰이더 플러그인 지원.
pl: Wsparcie dla wizualnego tworzenia wtyczek.
ru: Поддержка плагинов визуальных шейдеров.
ta: காட்சி சேடர் செருகுநிரல்களுக்கான உதவி.
tr: Görsel gölgelendirici eklenti desteği.

source: Scripting
cs: Skriptování
fr: Scripts
ga: Scriptiú
ja: スクリプト
ko: 스크립팅
pl: Programowanie
ru: Написание скриптов
ta: ச்கிரிப்டிங்
tr: Betiklendirme

source: **General:**
cs: **Obecné:**
fr: **Général :**
ga: **Ginearálta:**
it: **Generale:**
ja: **全般:**
ko: **일반:**
pl: **Ogólne:**
ru: **Общее:**
ta: ** பொது: **
tr: **Genel:**

source: Object-oriented design pattern with scripts extending nodes.
cs: Objektově orientovaný návrhový vzor, kde skripty rozšiřují uzly.
fr: Modèle de conception orientée-objet avec des scripts étendant(extend) des nœuds.
ga: Patrún dearaidh atá dírithe ar oibiachtaí le scripteanna a shíneann nóid.
it: Modello di progettazione orientato agli oggetti con script che estendono i nodi.
ja: スクリプトがノードを拡張する、オブジェクト指向デザインパターン。
ko: 노드를 확장하는 스크립트를 통한 객체 지향 디자인 패턴.
pl: Wzorzec zorientowany obiektowo z skryptami rozszerzającymi węzły.
ru: Объектно-ориентированный шаблон проектирования со скриптами, расширяющими узлы.
ta: ச்கிரிப்ட்கள் நீட்டிக்கும் முனைகளுடன் பொருள் சார்ந்த வடிவமைப்பு முறை.
tr: Düğümleri genişletmek için betikler kullanan nesne-yönelimli tasarım kalıbı.

source: Signals and groups for communicating between scripts.
cs: Signály a skupiny pro komunikaci mezi skripty.
fr: Signaux et groupes pour la communication entre les scripts.
ga: Comharthaí agus grúpaí chun cumarsáid a dhéanamh idir scripteanna.
it: Segnali e gruppi per la comunicazione tra gli script.
ja: スクリプト間で通信するためのシグナルとグループ。
ko: 시그널과 그룹을 이용한 스크립트 간 통신.
pl: Sygnały i grupy do komunikacji pomiędzy skryptami.
ru: Сигналы и группы для обмена данными между скриптами.
ta: ச்கிரிப்ட்களுக்கு இடையில் தொடர்புகொள்வதற்கான சமிக்ஞைகள் மற்றும் குழுக்கள்.
tr: Betikler arasında iletişim kurmak için sinyaller ve gruplar.

source: Support for :ref:`cross-language scripting <doc_cross_language_scripting>`.
cs: Podpora pro :ref:`mezijazykové skriptování <doc_cross_language_scripting>`.
fr: Prise en charge de :ref:`script cross-langage <doc_cross_language_scripting>`.
ga: Tacaíocht do :ref:`scripting thrastheanga <doc_cross_language_scripting>`.
it: Supporto per :ref:`scripting cross-language <doc_cross_language_scripting>`.
ja: :ref:`異なる言語でのスクリプティング <doc_cross_language_scripting>`\ に対応。
ko: :ref:`교차 언어 스크립팅 <doc_cross_language_scripting>` 지원.
pl: Wsparcie dla :ref:`międzyjęzykowego pisania skryptów <doc_cross_language_scripting>`.
ru: Поддержка :ref:`межъязыкового написания скриптов <doc_cross_language_scripting>`.
ta: இதற்கான ஆதரவு: சிவப்பு: `குறுக்கு மொழி ச்கிரிப்டிங் <doc_cross மொழி ச்கிரிப்டிங்>`.
tr: :ref:`Çapraz-dil betik yazımı <doc_cross_language_scripting>` için destek.

source: Many 2D, 3D and 4D linear algebra data types such as vectors and transforms.
cs: Mnoho 2D, 3D a 4D datových typů pro lineární algebru, jako jsou vektory a transformace.
fr: De nombreux types de données d'algèbre linéaire en 2D, 3D et 4D, tels que les vecteurs et les transformations.
ga: Go leor cineálacha sonraí ailgéabar líneach 2D, 3D agus 4D, mar shampla veicteoirí agus transforms.
it: Numerosi tipi di dati di algebra lineare 2D, 3D e 4D, come vettori e trasformazioni.
ja: ベクトルやトランスフォームといった、多くの2Dや3D、4Dの線形代数データ型。
ko: 벡터나 트랜스폼 같은 다양한 2D, 3D 및 4D 선형대수 데이터 타입.
pl: Wiele typów danych algebry liniowej 2D, 3D o 4D, takich jak wektory i transformaty.
ru: Многие типы данных 2D, 3D и 4D линейной алгебры, такие как векторы и трансформации.
ta: திசையன்கள் மற்றும் உருமாற்றங்கள் போன்ற பல 2 டி, 3 டி மற்றும் 4 டி நேரியல் இயற்கணித தரவு வகைகள்.
tr: Vektörler ve dönüşümler gibi birçok 2B, 3B ve 4B doğrusal cebir veri türleri.

source: Syntax inspired by Python. However, GDScript is **not** based on Python.
cs: Syntaxe inspirovaná Pythonem. GDScript nicméně **není** založený na Pythonu.
fr: Syntaxe inspirée de Python. Cependant, GDScript **n'est pas** basé sur ce dernier.
ga: Comhréir spreagtha ag Python. Mar sin féin, tá GDScript **not ** bunaithe ar Python.
it: Sintassi ispirata a Python. Tuttavia, GDScript **non** è basato su Python.
ja: Pythonにインスパイアされた文法。 しかし、GDScript は Python を基にしてはいません。
ko: 문법은 파이썬에서 영감을 받았지만, GDScript는 **파이썬 기반이 아닙니다**.
pl: Składnia inspirowana Pythonem. Jednakże GDScript **nie** jest oparty na Pythonie.
ru: Синтаксис вдохновлен Python. Однако GDScript **не** основан на Python.
ta: பைத்தானால் ஈர்க்கப்பட்ட தொடரியல். இருப்பினும், gdscript ** அல்ல ** பைதானை அடிப்படையாகக் கொண்டது.
tr: Python'dan esinlenen sözdizimi. Ancak, GDScript **Python tabanlı değildir**.

source: Syntax highlighting is provided on GitHub.
cs: Zvýrazňování syntaxe je k dispozici na GitHubu.
fr: La coloration syntaxique est fournie sur GitHub.
ga: Cuirtear aibhsiú comhréire ar fáil ar GitHub.
it: L'evidenziazione della sintassi è fornita su GitHub.
ja: GitHubでのシンタックスハイライトに対応。
ko: Github에서 구문 강조 지원.
pl: Podświetlenie składni jest dostępne na GitHubie.
ru: Подсветка синтаксиса предусмотрена на GitHub.
ta: கிதுபில் தொடரியல் சிறப்பம்சமாக வழங்கப்படுகிறது.
tr: Sözdizimi vurgulama GitHub üzerinde verilmiştir.

source: :ref:`Use threads <doc_using_multiple_threads>` to perform asynchronous actions or make use of multiple processor cores.
cs: :ref:`Umožňuje použít vlákna <doc_using_multiple_threads>` k provádění asynchronních akcí nebo pro využití více jader procesoru.
fr: :ref:`Utiliser les threads <doc_using_multiple_threads>` pour effectuer des actions asynchrones ou utiliser plusieurs cœurs de processeur.
ga: :ref:`Úsáid snáitheanna <doc_using_multiple_threads>` chun gníomhartha asincrónacha a dhéanamh nó úsáid a bhaint as croíleacáin phróiseálaithe iolracha.
it: :ref:`Usa i thread <doc_using_multiple_threads>` per eseguire azioni asincrone o utilizzare più core del processore.
ja: :ref:`スレッドの使用 <doc_using_multiple_threads>`\ で非同期処理を行ったり、複数のプロセッサコアを利用したりできます。
ko: :ref:`쓰레드를 사용해 <doc_using_multiple_threads>` 비동기 액션이나 멀티 프로세서 코어 작업을 할 수 있습니다.
pl: :ref:`Użyj wątków <doc_using_multiple_threads>` by wykonywać działania asynchroniczne bądź spożytkować wiele rdzeni procesora.
ru: :ref:`Применение потоков <doc_using_multiple_threads>` для выполнения асинхронных действий или использования нескольких процессорных ядер.
ta: :ref:`Use threads <doc_using_multiple_threads>` பெறுநர் perform asynchronous செயல்கள் or make use of multiple processor cores.
tr: Eşzamansız eylemler gerçekleştirmek veya birden çok işlemci çekirdeğini kullanmak için :ref:`çoklu iş parçacıkları kullanır <doc_using_multiple_threads>`.

source: Packaged in a separate binary to keep file sizes and dependencies down.
cs: Zabalený v samostatném binárním souboru pro snížení velikosti souborů a počtu závislostí.
fr: Emballé dans un binaire séparé pour limiter la taille des fichiers et les dépendances.
ga: Pacáistithe i dénártha ar leith a choinneáil méideanna comhaid agus spleáchais síos.
it: Confezionato in un binario separato per mantenere basse le dimensioni e le dipendenze dei file.
ja: ファイルサイズと依存関係を抑えるために、異なるバイナリでパッケージ化されています。
ko: 파일 크기를 줄이고 의존성을 낮추기 위해 별도의 바이너리로 패키징했습니다.
pl: Pakowane w osobnym pliku binarnym, by utrzymać mały rozmiar plików i niską ilość zależności.
ru: Упакован в отдельный двоичный файл для уменьшения размеров файлов и зависимостей.
ta: கோப்பு அளவுகள் மற்றும் சார்புகளை கீழே வைத்திருக்க ஒரு தனி பைனரியில் தொகுக்கப்பட்டுள்ளது.
tr: Dosya boyutlarını ve bağımlılıkları düşük tutmak için ayrı bir ikili-tip dosya olarak paketlenmiştir.

source: Supports .NET 8 and higher.
cs: Podporuje .NET 8 a vyšší.
fr: Supporte .NET 8 et versions ultérieures.
it: Supporta .NET 8 e versioni superiori.
ja: .NET8 以上に対応。
ko: .NET 8 및 상위 버전을 지원합니다.
pl: Obsługuje .NET 8 i nowsze.
ru: Поддерживает .NET 8 и выше.
ta: நெட் 8 மற்றும் அதற்கு மேற்பட்டதை ஆதரிக்கிறது.
