Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: Scale to :ref:`multiple resolutions <doc_multiple_resolutions>` using the ``canvas_items`` or ``viewport`` stretch modes.
cs: Pomocí režimů roztažení ``canvas_items`` ("položky plátna") nebo ``viewport`` ("průzor") můžete škálovat pro :ref:`více rozlišení <doc_multiple_resolutions>`.
fr: Mise à l'échelle vers :ref:`plusieurs résolutions <doc_multiple_resolutions>` en utilisant les modes d'étirement ``canvas_items`` ou ``viewport``.
ga: Scála go :ref:`il-rún <doc_multiple_resolutions>` ag baint úsáide as na modhanna stráice ``canbhás_ítimí`` nó ``viewport``.
ja: ``canvas_items`` または ``viewport`` ストレッチモードを使用して :ref:`複数の解像度 <doc_multiple_resolutions>` にスケールします。
ko: ``canvas_items`` 또는 ``viewport`` 의 늘리기 모드를 사용하여 :ref:`multiple resolutions <doc_multiple_resolutions>` 로 확장합니다.
ru: Масштабирование до :ref:`нескольких разрешений <doc_multiple_resolutions>` с помощью ``canvas_items`` или ``viewport`` режимов растяжения.
ta: அளவீடு: குறிப்பு: `பல தீர்மானங்கள் <doc_multiple_resolutions>` `` canvas_items`` அல்லது `` ViewPort`` நீட்டிக்க முறைகளைப் பயன்படுத்துதல்.
tr: ``Canvas_items`` veya ``viewport`` esnetme modlarını kullanarak :ref:`çoklu çözünürlük <doc_multiple_resolutions>` değerlerine ölçeklendirin.

source: Support any aspect ratio using anchors and the ``expand`` stretch aspect.
cs: Podporujte jakýkoli poměr stran pomocí kotev a aspektu roztažení ``expand`` ("rozšířit").
fr: Prise en charge de la conservation de l'aspect en utilisant des ancres et l'aspect d'étirement ``expand``.
ga: Tacaigh le haon chóimheas gné ag baint úsáide as ancairí agus an ghné stráice ''leathnú''.
it: Supporta qualsiasi rapporto d'aspetto attraverso ancore e l'aspetto di stiramento ``expand``.
ja: アンカーと ``expand`` を使用して任意のアスペクト比をサポートするストレッチアスペクト。
ko: 앵커와 ``expand`` 늘이기 비율을 사용한 모든 종횡비 지원.
ru: Поддержка любого соотношения сторон с помощью якорей и соотношения растяжения ``expand``.
ta: நங்கூரங்களைப் பயன்படுத்தி எந்த விகித விகிதத்தையும் ஆதரிக்கவும் மற்றும் `` விரிவாக்கு`` நீட்டிக்க நற்பொருத்தம்.
tr: Çapaları ve ``genişlet`` esnetme görünüşünü kullanarak herhangi bir en-boy oranını destekleyin.

source: **Theming:**
cs: **Motivy vzhledu:**
fr: **Thèmes :**
ga: **Téamaí:**
it: ** Temi: **
ja: **テーマ:**
ko: **테마:**
pl: **Motywy:**
ru: **Тематизация:**
ta: ** கருப்பொருள்: **
tr: **Temalaştırma:**

source: Built-in theme editor.
cs: Vestavěný editor motivů.
fr: Éditeur de thèmes intégré.
ga: Eagarthóir téama tógtha.
it: Editor di temi integrato.
ja: 内蔵テーマエディタ。
ko: 내장 테마 편집기.
pl: Wbudowany edytor motywów.
ru: Встроенный редактор тем.
ta: உள்ளமைக்கப்பட்ட கருப்பொருள் எடிட்டர்.
tr: Yerleşik tema düzenleyici.

source: Generate a theme based on the current editor theme settings.
cs: Vygenerujte motiv na základě aktuálního nastavení motivu editoru.
fr: Générer un thème basé sur les paramètres actuels du thème de l'éditeur.
ga: Gin téama bunaithe ar shocruithe téama reatha an eagarthóra.
it: Genera un tema in base alle attuali impostazioni del tema dell'editor.
ja: 現在のエディタのテーマ設定に基づいて、テーマを生成します。
ko: 현재 편집기 테마 설정에 따라 테마를 생성합니다.
pl: Tworzenie nowego motywu w oparciu o aktualne ustawienia motywu w edytorze.
ru: Создание тем на основе текущих настроек темы редактора.
ta: தற்போதைய எடிட்டர் கருப்பொருள் அமைப்புகளின் அடிப்படையில் ஒரு கருப்பொருளை உருவாக்கவும்.
tr: Mevcut düzenleyici tema ayarlarına dayalı bir tema üretin.

source: Procedural vector-based theming using :ref:`class_StyleBoxFlat`.
cs: Procedurální vektorové motivy pomocí :ref:`class_StyleBoxFlat`.
fr: Thème vectoriel procédural utilisant :ref:`class_StyleBoxFlat`.
ga: Téama bunaithe ar veicteoir nós imeachta ag baint úsáide as :ref:'class_StyleBoxFlat'.
it: Temi procedurali basati su vettoriali utilizzando :ref:`class_StyleBoxFlat`.
ja: :ref:`class_StyleBoxFlat` を使用したプロシージャルなベクターベースのテーマ設定。
ko: :ref:`class_StyleBoxFlat`\ 를 사용한 벡터 기반 절차적 테마.
pl: Motywy oparte na proceduralnej grafice wektorowej stworzone przy pomocy :ref:`class_StyleBoxFlat`.
ru: Процедурные векторные темы, использующие :ref:`class_StyleBoxFlat`.
ta: நடைமுறை திசையன் அடிப்படையிலான தீமிங்: ref: `class_styleboxflat`.
tr: :ref:`class_StyleBoxFlat` kullanarak yöntemsel vektör-tabanlı temalar oluşturma.

source: Supports rounded/beveled corners, drop shadows, per-border widths and antialiasing.
cs: Podporuje zaoblené/zkosené rohy, vržené stíny, nastavení šířek jednotlivých okrajů a vyhlazování.
fr: Prends en charge les coins arrondis/biseautés, les ombres portées, et les largeurs par bordure et l'anticrénelage.
ga: Tacaíochtaí coirnéil chothromú / beveled, scáthanna titim, leithead in aghaidh na teorann agus antialiasing.
it: Supporta angoli arrotondati/smussati, ombreggiature, spessore per ogni bordo e antialiasing.
ja: 丸みを帯びた/面取りされたコーナー、ドロップシャドウ、ボーダ毎の幅、アンチエイリアスをサポートします。
ko: 둥근 모서리와 굽은 모서리, 그림자 및 테두리별 너비와 안티에일리어싱 지원.
ru: Поддерживает закруглённые/скошенные углы, тени, указание толщины отдельных границ и сглаживание.
ta: வட்டமான/பெவெல்ட் மூலைகளை ஆதரிக்கிறது, துளி நிழல்கள், ஒரு குறிப்பிட்ட அகலங்கள் மற்றும் ஆன்டிலியாசிங்.
tr: Yuvarlatılmış/eğimli köşeleri, düşürme gölgeleri, kenarlık-başına genişlikleri ve kenar yumuşatmayı destekler.

source: Texture-based theming using :ref:`class_StyleBoxTexture`.
cs: Motivy vytvořené z textur pomocí :ref:`class_StyleBoxTexture`.
fr: Thème basée sur une texture en utilisant :ref:`class_StyleBoxTexture`.
ga: Téamaí bunaithe ar uigeacht ag baint úsáide as :ref:'class_StyleBoxTexture'.
it: Temi basati sulle texture utilizzando :ref:`class_StyleBoxTexture`.
ja: :ref:`class_StyleBoxTexture` を使用した、テクスチャベースのテーマ設定。
ko: :ref:`class_StyleBoxTexture`\ 를 사용한 텍스트 기반 테마.
pl: Motywy oparte na teksturach używające :ref:`class_StyleBoxTexture`.
ru: Темы на основе текстур с использованием :ref:`class_StyleBoxTexture`.
ta: பயன்படுத்தி அமைப்பு அடிப்படையிலான தீமிங்: ref: `class_styleboxtexture`.
tr: :ref:`class_StyleBoxTexture` kullanarak doku-tabanlı temalar oluşturma.

source: Godot's small distribution size can make it a suitable alternative to frameworks like Electron or Qt.
cs: Malá velikost distribuce Godot z něj činí vhodnou alternativu k frameworkům jako Electron nebo Qt.
fr: La petite taille de distribution de Godot peut en faire une alternative appropriée à des frameworks comme Electron ou Qt.
ga: Is féidir le méid dáileacháin beag Godot rogha oiriúnach a dhéanamh de chreataí cosúil le Leictreon nó Qt.
it: Le ridotte dimensioni di Godot possono renderlo un'alternativa adatta a framework come Electron o Qt.
ja: Godot はディストリビューションサイズが小さいため、Electron や Qt のようなフレームワークの代替としても適しています。
ko: Godot의 작은 배포 크기는 Electron이나 Qt같은 프레임워크의 적절한 대안이 될 수 있습니다.
pl: Mały rozmiar dystrybucji Godot może czynić go wartościową alternatywą dla frameworków takich jak Electron czy Qt.
ru: Небольшой размер дистрибутива Godot может сделать его подходящей альтернативой таким фреймворкам, как Electron или Qt.
ta: கோடோட்டின் சிறிய விநியோக அளவு இது எலக்ட்ரான் அல்லது க்யூடி போன்ற கட்டமைப்பிற்கு பொருத்தமான மாற்றாக மாற்றும்.
tr: Godot'nun küçük dağıtım boyutu, onu Electron veya Qt gibi geliştirme altyapılarına uygun bir alternatif haline getirebilir.

source: Animation
cs: Animace
ga: Beochan
it: Animazione
ja: アニメーション
ko: 애니메이션
pl: Animacja
ru: Анимация
ta: அனிமேசன்
tr: Canlandırma

source: Direct kinematics and inverse kinematics.
cs: Přímá kinematika a inverzní kinematika.
fr: Cinématiques directes et cinématiques inverses.
ga: Kinematics díreach agus kinematics inbhéartach.
it: Cinematica diretta e cinematica inversa.
ja: ダイレクトキネマティクスとインバースキネマティクス。
ko: 직접 운동학과 역 운동학.
pl: Bezpośrednia kinematyka i kinematyka odwrócona.
ru: Прямая кинематика и обратная кинематика.
ta: நேரடி இயக்கவியல் மற்றும் தலைகீழ் இயக்கவியல்.
tr: Doğrudan kinematik ve ters kinematik.

source: Support for animating any property with customizable interpolation.
cs: Podpora animace libovolné vlastnosti s přizpůsobitelnou interpolací.
fr: Prise en charge de l'animation de n'importe quelle propriété avec interpolation personnalisable.
ga: Tacaíocht chun aon mhaoin a bheochan le hidirshuíomh saincheaptha.
it: Supporto per l'animazione di qualsiasi proprietà con interpolazione personalizzabile.
ja: カスタマイズ可能な補間による、あらゆるプロパティのアニメーションに対応。
ko: 모든 속성에 대해 보간법을 사용자 지정할 수 있는 애니메이팅 지원.
pl: Obsługa animacji i właściwości z konfigurowalną interpolacją.
ru: Поддержка любого свойства анимации с настраиваемой интерполяцией.
ta: தனிப்பயனாக்கக்கூடிய இடைக்கணிப்புடன் எந்தவொரு சொத்தையும் அனிமேசன் செய்வதற்கான உதவி.
tr: Özelleştirilebilir ara değerleme kullanarak herhangi bir özelliğe canlandırma uygulama desteği.

source: Support for calling methods in animation tracks.
cs: Podpora pro volání metod ve stopách animací.
fr: Prise en charge de l'appel des méthodes dans les pistes d'animation.
ga: Tacaíocht do mhodhanna glaonna i rianta beochana.
it: Supporto per la chiamata di metodi nelle tracce di animazione.
ja: アニメーショントラックでのメソッド呼び出しに対応。
ko: 애니메이션 트랙에서 메서드 호출 지원.
ru: Поддержка вызова методов в дорожках анимации.
ta: அனிமேசன் தடங்களில் அழைப்பு முறைகளுக்கான உதவி.
tr: Canlandırma izlerinde yöntem çağırma desteği.

source: Support for playing sounds in animation tracks.
cs: Podpora přehrávání zvuků ve stopách animací.
fr: Prise en charge de la lecture de sons dans les pistes d'animation.
ga: Tacaíocht chun fuaimeanna a sheinm i rianta beochana.
it: Supporto per la riproduzione di suoni nelle tracce di animazione.
ja: アニメーショントラックでのサウンド再生に対応。
ko: 애니메이션 트랙에서 음향 지원.
pl: Obsługa odgrywania dźwięków w ścieżkach animacji (animation tracks).
ru: Поддержка воспроизведения звуков в анимационных дорожках.
ta: அனிமேசன் தடங்களில் ஒலிகளை இயக்குவதற்கான உதவி.
tr: Canlandırma izlerinde ses oynatma desteği.

source: Support for Bézier curves in animation.
cs: Podpora Bézierových křivek v animacích.
fr: Prise en charge des courbes de Bézier dans les animations.
ga: Tacaíocht do curves Bézier i beochan.
it: Supporto per le curve di Bézier nell'animazione.
ja: アニメーションでのベジエ曲線に対応。
ko: 애니메이션에서 베지에 곡선(Bézier curves) 지원.
pl: Obsługa krzywych Béziera w animacjach.
ru: Поддержка кривых Безье в анимации.
ta: அனிமேசனில் பெசியர் வளைவுகளுக்கான உதவி.
tr: Canlandırmada Bézier eğrileri için destek.

source: File formats
cs: Formáty souborů
fr: Formats de fichier
ga: Formáidí comhaid
it: Formati del file
ja: ファイルフォーマット
ko: 파일 형식
pl: Formaty plików
ru: Форматы файлов
ta: கோப்பு வடிவங்கள்
tr: Dosya biçimleri

source: Scenes and resources can be saved in :ref:`text-based <doc_tscn_file_format>` or binary formats.
cs: Scény a herní zdroje lze uložit v :ref:`textovém <doc_tscn_file_format>` nebo binárním formátu.
fr: Les scènes et les ressources peuvent être enregistrées dans des formats :ref:`textes<doc_tscn_file_format>` ou binaires.
ga: Is féidir radhairc agus acmhainní a shábháil i :ref:`text-based <doc_tscn_file_format>` nó formáidí dénártha.
it: Scene e risorse possono essere salvate in formati :ref:`testuali <doc_tscn_file_format>` o binari.
ja: シーンやリソースは :ref:`テキストベース <doc_tscn_file_format>` またはバイナリ形式で保存可能。
ko: 씬과 리소스는 :ref:`텍스트 기반 <doc_tscn_file_format>` 또는 바이너리 형식으로 저장 가능.
pl: Sceny i zasoby można zapisać w :ref:` tekstowym <doc_tscn_file_format>` bądź binarnym formacie.
ru: Сцены и ресурсы могут быть сохранены в :ref:`текстовом <doc_tscn_file_format>` или двоичном формате.
ta: காட்சிகள் மற்றும் வளங்களை சேமிக்க முடியும்: குறிப்பு: `உரை அடிப்படையிலான <doc_tscn_file_format>` அல்லது பைனரி வடிவங்கள்.
tr: Sahneler ve kaynaklar :ref:`metin-tabanlı <doc_tscn_file_format>` veya ikili-tip biçimlerinde kaydedilebilir.

source: Text-based formats are human-readable and more friendly to version control.
cs: Textové formáty jsou lidsky čitelné a vhodné pro správu verzí.
fr: Les formats Texte sont lisibles par l'homme et plus compatible avec le contrôle de version.
ga: Tá formáidí téacs-bhunaithe inléite ag an duine agus níos cairdiúla do rialú leagan.
it: I formati basati su testo sono leggibile in chiaro e più facili per il controllo versione.
ja: テキストベースのフォーマットは人間が読むことができ、バージョン管理にも適しています。
ko: 텍스트 기반 형식은 사람이 읽을 수 있고, 버전 관리 친화적입니다.
pl: Formaty tekstowe są czytelne i bardziej przystosowane do systemu kontroli wersji.
ru: Текстовые форматы удобочитаемы и более удобны для контроля версий.
ta: உரை அடிப்படையிலான வடிவங்கள் மனிதனால் படிக்கக்கூடியவை மற்றும் பதிப்பு கட்டுப்பாட்டுக்கு மிகவும் நட்பானவை.
tr: Metin-tabanlı biçimler, insanın-okuyabileceği şekildedir ve sürüm kontrolü için de daha dost canlısıdır.

source: Binary formats are faster to save/load for large scenes/resources.
cs: Binární formáty se rychleji ukládají a načítají pro velké scény/zdroje.
fr: Les formats binaires sont plus rapides à sauvegarder/charger pour les grandes scènes/ressources.
ga: Tá formáidí dénártha níos tapúla a shábháil / ualach do radhairc / acmhainní móra.
it: I formati binari sono più veloci da salvare/caricare per scene/risorse di grandi dimensioni.
ja: バイナリ形式は、大きなシーンやリソースの保存・読み込みがより高速です。
ko: 바이너리 형식은 큰 씬 또는 리소스에 대해 저장과 불러오기가 빠릅니다.
pl: W przypadku dużych scen/zasobów formaty binarne są szybciej zapisywane/ładowane.
ru: Двоичные форматы быстрее сохранять/загружать для больших сцен/ресурсов.
ta: பெரிய காட்சிகள்/வளங்களை சேமிக்க/ஏற்ற பைனரி வடிவங்கள் வேகமாக உள்ளன.
tr: İkili-tip biçimler, büyük sahneleri/kaynakları kaydetmek/yüklemek için çok daha hızlıdır.

source: Read and write text or binary files using :ref:`class_FileAccess`.
cs: Čtení a zápis textových nebo binárních souborů pomocí :ref:`class_FileAccess`.
fr: Lecture et écriture de fichiers texte ou binaires en utilisant :ref:`class_FileAccess`.
ga: Léigh agus scríobh téacs nó comhaid dhénártha ag baint úsáide as :ref:'class_FileAccess'.
it: Leggere e scrivere file di testo o file binari utilizzando :ref:`class_FileAccess`.
ja: :ref:`class_FileAccess` を使用した、テキストファイルやバイナリファイルの読み書き。
ko: :ref:`class_FileAccess` 을 이용해 텍스트나 바이너리 파일을 읽고 쓰기.
ru: Чтение и запись текстовых или двоичных файлов с помощью :ref:`class_FileAccess`.
ta: பயன்படுத்தி உரை அல்லது பைனரி கோப்புகளைப் படித்து எழுதுங்கள்: குறிப்பு: `class_fileaccess`.
tr: :ref:`class_FileAccess` kullanarak metin veya ikili-tip dosyaları okuyun ve yazın.

source: Can optionally be compressed or encrypted.
cs: Lze volitelně komprimovat nebo šifrovat.
fr: Peut éventuellement être compressé ou chiffré.
ga: Is féidir é a chomhbhrú nó a chriptiú go roghnach.
it: A scelta può essere compresso o criptato.
ja: オプションで圧縮や暗号化が可能です。
ko: 선택적으로 압축하거나 암호화할 수 있습니다.
pl: Mogą być opcjonalnie skompresowane lub zaszyfrowane.
ru: При необходимости могут быть сжаты или зашифрованы.
ta: விருப்பமாக சுருக்கப்படலாம் அல்லது குறியாக்கம் செய்யலாம்.
tr: İsteğe bağlı olarak sıkıştırılabilir veya şifrelenebilir.

source: Read and write :ref:`class_JSON` files.
cs: Čtení a zápis :ref:`class_JSON` souborů.
fr: Lecture et écriture de fichiers :ref:`class_JSON`.
ga: Léigh agus scríobh comhaid :ref:'class_JSON'.
it: Leggere e scrivere file :ref:`class_JSON`.
ja: :ref:`class_JSON` ファイルの読み書き。
ko: :ref:`class_JSON` 파일 읽고 쓰기.
pl: Odczyt i zapis plików :ref:`class_JSON`.
ru: Чтение и запись файлов :ref:`class_JSON`.
ta: படித்து எழுதுங்கள்: குறிப்பு: `class_json` கோப்புகள்.
tr: :ref:`class_JSON` dosyalarını okuyun ve yazın.

source: Read and write INI-style configuration files using :ref:`class_ConfigFile`.
cs: Čtení a zápis konfiguračních souborů ve stylu INI pomocí :ref:`class_ConfigFile`.
fr: Lecture et écriture de fichiers de configuration de type INI en utilisant :ref:`class_ConfigFile`.
ga: Léigh agus scríobh comhaid chumraíochta stíl INI ag baint úsáide as :ref:'class_ConfigFile'.
it: Leggere e scrivere file di configurazione in stile INI usando :ref:`class_ConfigFile`.
ja: :ref:`class_ConfigFile` を使用した、INIスタイルの設定ファイルの読み書き。
ko: :ref:`class_ConfigFile`\ 을 사용해 INI 스타일 구성 파일 읽고 쓰기.
pl: Odczyt i zapis konfiguracji w formacie INI przy pomocy :ref:`class_ConfigFile`.
ru: Чтение и запись конфигурационных INI-файлов с помощью :ref:`class_ConfigFile`.
ta: Ini- பாணி உள்ளமைவு கோப்புகளைப் படித்து எழுதுங்கள்: குறிப்பு: `class_configfile`.
tr: :ref:`class_ConfigFile` ayar dosyası sınıfını kullanarak, INI-tarzı yapılandırma dosyalarını okuyun ve yazın.

source: Can (de)serialize any Godot datatype, including Vector2/3, Color, ...
cs: Je možné (de)serializovat jakýkoli datový typ Godotu, včetně Vector2/3, Color, ...
fr: Peut (dé)sérialiser tous les types de données Godot, comme Vector2/3, Color, ...
ga: An féidir (de)serialize aon datatype Godot, lena n-áirítear Vector2/3, Dath, ...
it: Può (de)serializzare qualsiasi tipo di dati di Godot, compresi Vector2/3, Color, ...
ja: Vector2、Vector3、Color などを含む、あらゆる Godot データ型は (デ)シリアライズできます。
ko: 벡터2/3, 컬러를 포함한 모든 Godot 데이터 타입을 (역)직렬화할 수 있습니다.
pl: Można zserializować/zdeserializować dowolny typ danych Godot, włączając w to Vector2/3, Color, ...
ru: Может (де)сериализовать любой тип данных Godot, включая Vector2/3, Color, ...
ta: வெக்டர் 2/3, வண்ணம், ...
tr: Vector2/3, Color, vb. dahil olmak üzere, herhangi bir Godot veri türünü serileştirebilir / seriden açabilir.

source: Read XML files using :ref:`class_XMLParser`.
cs: Čtení souborů XML pomocí :ref:`class_XMLParser`.
fr: Lecture des fichiers XML en utilisant :ref:`class_XMLParser`.
ga: Léigh comhaid XML ag baint úsáide as :ref:'class_XMLParser'.
it: Leggere i file XML utilizzando :ref:`class_XMLParser`.
ja: :ref:`class_XMLParser` を使用した、XMLファイルの読み込み。
ko: :ref:`class_XMLParser`\ 를 사용한 XML 파일 읽기.
pl: Odczyt plików XML przy użyciu :ref:`class_XMLParser`.
ru: Чтение файлов XML с помощью :ref:`class_XMLParser`.
ta: பயன்படுத்தும் எக்ச்எம்எல் கோப்புகளைப் படியுங்கள்: குறிப்பு: `class_xmlparser`.
tr: :ref:`class_XMLParser` sınıfını kullanarak XML dosyalarını okuyun.

source: :ref:`Load and save images, audio/video, fonts and ZIP archives <doc_runtime_loading_and_saving>` in an exported project without having to go through Godot's import system.
cs: :ref:`Nahrávejte a ukládejte obrázky, audio/video, fonty a ZIP archivy <doc_runtime_loading_and_saving>` v exportovaných projektech bez nutnosti používat importovací systém Godotu.
fr: :ref:`Chargez et enregistrez des images, de l'audio/vidéo, des polices et des archives ZIP <doc_runtime_loading_and_saving>` dans un projet exporté sans avoir à passer par le système d'importation de Godot.
ga: :ref:`Lódáil agus sábháil íomhánna, fuaime/físeán, clónna agus cartlanna ZIP <doc_runtime_loading_and_saving>` i dtionscadal easpórtáilte gan dul trí chóras iompórtála Godot.
it: :ref:`Carica e salva immagini, audio/video, font e archivi ZIP <doc_runtime_loading_and_saving>` in un progetto esportato, senza dover passare per il sistema di importazione di Godot.
ja: エクスポートされたプロジェクトで、Godot のインポートシステムを通さずに :ref:`画像、音声/映像、フォント、ZIPアーカイブをロード及びセーブ <doc_runtime_loading_and_saving>`。
ko: Godot의 가져오기 시스템을 거치지 않고도 내보낸 프로젝트에서 :ref:`이미지, 오디오/비디오, 글꼴 및 ZIP 아카이브를 불러오고 저장 <doc_runtime_loading_and_saving>`\ 합니다.
ru: :ref:`Загрузка и сохранение изображений, аудио/видео, шрифтов и ZIP-архивов <doc_runtime_loading_and_saving>` в экспортируемом проекте без необходимости проходить через систему импорта Godot.
ta: :ref:`Load and சேமி images, audio/video, fonts and ZIP archives <doc_runtime_loading_and_saving>` in an exported திட்டம் without having பெறுநர் go through Godot's இறக்குமதி system.
tr: Godot'un içe aktarma sisteminden geçmek zorunda kalmadan dışa aktarılan bir projede :ref:`görüntü, ses/video, yazı tipi ve ZIP arşivlerini yükleme ve kaydetme <doc_runtime_loading_and_saving>` yapabilirsiniz.

source: Pack game data into a PCK file (custom format optimized for fast seeking), into a ZIP archive, or directly into the executable for single-file distribution.
cs: Zabalte herní data do souboru PCK (vlastní formát optimalizovaný pro rychlé vyhledávání), do archivu ZIP nebo přímo do jednoho spustitelného souboru pro distribuci.
fr: Emballez les données de jeu dans un fichier PCK (format particulièrement optimisé pour la recherche rapide), dans une archive ZIP ou directement dans l'exécutable pour une distribution en fichier unique.
ga: Pacáil sonraí cluiche isteach i gcomhad PCK (formáid saincheaptha optamaithe le haghaidh lorg tapa), isteach i gcartlann ZIP, nó go díreach isteach sa inrite le haghaidh dáileadh comhad amháin.
it: Impacchetta i dati di gioco in un file PCK (formato personalizzato ottimizzato per la ricerca veloce), in un archivio ZIP, o direttamente nell'eseguibile per la distribuzione di un singolo file.
ja: ゲームデータを PCK ファイル (高速シークに最適化されたカスタムフォーマット)、ZIP アーカイブ、またはシングルファイル配布用の実行ファイルに直接パック可能。
ko: 게임 데이터를 PCK 파일(빠른 검색에 최적화된 전용 포맷), ZIP 파일, 또는 직접 실행 가능한 한 개의 파일 안에 압축.
pl: Pakowanie danych gry do pliku PCK (własny format plików zoptymalizowany pod kątem szybkiego wyszukiwania), do archiwum ZIP, lub bezpośrednio do pojedynczego pliku EXE do rozpowszechniania dalej.
ru: Упаковка данных игры в файл PCK (пользовательский формат, оптимизированный для быстрого поиска), в ZIP-архив или непосредственно в исполняемый файл для распространения в виде одного файла.
ta: விளையாட்டு தரவை பி.சி.கே கோப்பில் (தனிப்பயன் வடிவம் வேகமாக தேடுவதற்கு உகந்ததாக), சிப் காப்பகமாக அல்லது நேரடியாக ஒற்றை கோப்பு விநியோகத்திற்காக இயங்கக்கூடியதாக இருக்கும்.
tr: Oyun verilerini, tekli-dosya dağıtımı için, PCK dosyası (hızlı gözatma için en iyileştirilmiş özel biçim), ZIP arşivi, ya da doğrudan çalıştırılabilir dosya biçiminde paketleyin.

source: :ref:`Export additional PCK files<doc_exporting_pcks>` that can be read by the engine to support mods and DLCs.
cs: :ref:`Exportujte dodatečné soubory PCK <doc_exporting_pcks>`, čitelné enginem pro podporu modů a DLC.
fr: :ref:`Exporter des fichiers PCK supplémentaires <doc_exporting_pcks>` qui peuvent être lus par le moteur pour supporter les mods et les DLCs.
ga: :ref:`Easpórtáil comhaid PCK breise <doc_exporting_pcks>` is féidir leis an inneall a léamh chun tacú le mods agus DLCanna.
it: :ref:`Esportare ulteriori file PCK<doc_exporting_pcks>` che possono essere letti dal motore per supportare mod e DLC.
ja: MOD や DLC に対応するため、エンジンにて読み込める :ref:`追加のPCKファイル <doc_exporting_pcks>` をエクスポート可能。
ko: 모드와 DLC를 지원하기 위해 엔진이 읽을 수 있는 :ref:`추가적인 PCK 파일 내보내기 <doc_exporting_pcks>`.
pl: :ref:`Eksport dodatkowych plików PCK<doc_exporting_pcks>`, które silnik może traktować jako mody i DLC.
ru: :ref:`Экспорт дополнительных файлов PCK <doc_exporting_pcks>`, которые могут быть прочитаны движком для поддержки модов и DLC.
ta: :ref:`Export additional PCK files<doc_exporting_pcks>` that can be read by the விசைப்பொறி பெறுநர் support mods and DLCs.
tr: Mod'ları ve DLC'leri desteklemek için, motorun okuyabileceği :ref:`PCK ek paketlerini dışa aktarın <doc_exporting_pcks>`.

source: Miscellaneous
cs: Různé
fr: Divers
ga: Ilghnéitheach
it: Varie
ja: その他
ko: 기타
pl: Różne
ru: Разное
ta: மற்றவை
tr: Çeşitli

source: :ref:`Video playback <doc_playing_videos>` with built-in support for Ogg Theora.
cs: :ref:`Přehrávání videí <doc_playing_videos>` s vestavěnou podporou pro Ogg Theora.
fr: :ref:`Lecture vidéo <doc_playing_videos>` avec prise en charge intégrée d'Ogg Theora.
ga: :ref:`Athsheinm físe <doc_playing_videos>` le tacaíocht ionsuite do Ogg Theora.
it: :ref:`Riproduzione video <doc_playing_videos>` con supporto integrato per Ogg Theora.
ja: :ref:`動画再生 <doc_playing_videos>` 、Ogg Theora に標準で対応。
ko: Ogg Theora를 내장 지원하여 :ref:`비디오 재생 <doc_playing_videos>`\ 을 할 수 있습니다.
ru: :ref:`Воспроизведение видео <doc_playing_videos>` со встроенной поддержкой Ogg Theora.
ta: :ref:`Video playback <doc_playing_videos>` with built-in support க்கு Ogg Theora.
tr: Ogg Theora için yerleşik destekli :ref:`video oynatma <doc_playing_videos>`.
