Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: Custom shaders can access a real-time :abbr:`SDF (Signed Distance Field)` representation of the 2D scene based on :ref:`class_LightOccluder2D` nodes, which can be used for improved 2D lighting effects including 2D global illumination.
cs: Vlastní shadery mají v reálném čase přístup k :abbr:`SDF (Signed Distance Field - Pole vzdáleností se znaménky)`reprezentaci 2D scény založené na :ref:` class_LightOccluder2D` uzlech, které mohou být použity ke zlepšení 2D světelných efektů včetně 2D globálního osvětlení.
fr: Les shaders personnalisés peuvent accéder en temps réel a une représentation :abbr:`SDF (Champs de Distance Signée)` de la scène 2D basé sur les nœuds :ref:`class_LightOccluder2D`, qui peut être utilisé pour améliorer les effets d'éclairage 2D, y compris l'éclairage global 2D.
ga: Is féidir le shaders saincheaptha rochtain a fháil ar léiriú fíor-ama: abbr: 'SDF (Achar Réimse Sínithe)' ar an radharc 2D bunaithe ar nóid :ref: 'class_LightOccluder2D', ar féidir iad a úsáid le haghaidh éifeachtaí soilsithe 2D feabhsaithe lena n-áirítear soilsiú domhanda 2D.
it: Gli shader personalizzati posso accedere in tempo reale a una rappresentazione :abbr:`SDF (Signed Distance Field)` della scena 2D basata sui nodi :ref:`class_LightOccluder2D`, che è possibile usare per migliorare gli effetti d'illuminazione 2D, tra cui l'illuminazione globale 2D.
ja: カスタムシェーダーは、 :ref:`class_LightOccluder2D` ノードに基づいた 2D シーンの実時間 :abbr:`SDF (Signed Distance Field)` 表現にアクセスできます。これは、2D グローバル照明を含む 2D 照明効果を向上させるために使用できます。
ko: 사용자 지정 셰이더는 :ref:`class_LightOccluder2D` 노드를 기반으로 2D 씬의 실시간 :abbr:`SDF (Signed Distance Field)` 표현에 접근할 수 있으며, 이를 통해 2D 글로벌 일루미네이션을 포함한 향상된 2D 조명 효과를 구현할 수 있습니다.
pl: Niestandardowe shadery mogą uzyskać dostęp do reprezentacji 2D sceny w czasie rzeczywistym :abbr:`SDF (Signed Distance Field)` w oparciu o węzły :ref:`class_LightOccluder2D`, które mogą być wykorzystane do ulepszonych efektów oświetlenia 2D, w tym globalnego oświetlenia 2D.
ru: Пользовательские шейдеры могут получить доступ в реальном времени к :abbr:`SDF (Signed Distance Field)` представлению 2D-сцены с помощью узлов :ref:`class_LightOccluder2D`, которые могут быть использованы для улучшения 2D-световых эффектов, включая 2D-глобальное освещение.
ta: தனிப்பயன் சேடர்கள் ஒரு நிகழ்நேரத்தை அணுகலாம்: ஏபிபிஆர்: `எச்.டி.எஃப் (கையொப்பமிடப்பட்ட தூர புலம்)` 2 டி காட்சியின் பிரதிநிதித்துவம்: குறிப்பு: `கிளாச்_ லைட்ஓக்லுடர் 2 டி` முனைகள், இது 2 டி உலகளாவிய வெளிச்சம் உள்ளிட்ட மேம்பட்ட 2 டி லைட்டிங் விளைவுகளுக்கு பயன்படுத்தப்படலாம்.
tr: Özel gölgelendiriciler, :ref:`class_LightOccluder2D` düğümlerine dayalı olarak 2B sahnenin gerçek zamanlı :abbr:`SDF (İşaretli Uzaklık Alanı, İng. Signed Distance Field)` gösterimine erişebilir ve bu, 2B genel aydınlatma dahil olmak üzere gelişmiş 2B aydınlatma efektleri için kullanılabilir.

source: :ref:`Font rendering <doc_gui_using_fonts>` using bitmaps, rasterization using FreeType or multi-channel signed distance fields (MSDF).
cs: :ref:`Vykreslování fontů <doc_gui_using_fonts>` za pomoci bitmap, rastrování pomocí FreeType nebo vícekanálových polí vzdáleností se znaménkem (MSDF).
fr: :ref:`Rendu de police <doc_gui_using_fonts>` utilisant des bitmaps, la rasterisation avec FreeType ou des champs de distances signées multicanal (MSDF).
ga: :ref:`Rindeáil cló <doc_gui_using_fonts>` ag baint úsáide as bitmaps, rasterization ag baint úsáide as FreeType nó réimsí achair sínithe ilchainéil (MSDF).
it: :ref:`Rendering dei font <doc_gui_using_fonts>` utilizzando bitmap, rasterizzazione tramite FreeType o Multichannel Signed Distance Field (MSDF).
ja: ビットマップを用いた :ref:`Font レンダリング <doc_gui_using_fonts>`、FreeType またはマルチチャネル署名された距離フィールド (MSDF) を用いたラスタライズ。
ko: 비트맵, FreeType의 래스터화, 또는 멀티채널 부호화 디스턴스 필드 (MSDF, Multi-channel Signed Distance Fields)를 사용한 :ref:`글꼴 렌더링 <doc_gui_using_fonts>`.
pl: ref:`Renderowanie czcionek <doc_gui_using_fonts>` przy użyciu bitmap, rasteryzacja przy użyciu FreeType lub wielokanałowych podpisanych pól odległości (MSDF).
ru: :ref:`Отрисовка шрифтов <doc_gui_using_fonts>` с использованием bitmap, растеризация с помощью FreeType или многоканальных знаковых полей расстояний (MSDF).
ta: :ref:`Font rendering <doc_gui_using_fonts>` using bitmaps, rasterization using FreeType or multi-channel signed distance புலங்கள் (MSDF).
tr: Bitmap kullanarak :ref:`yazı tipi işleme <doc_gui_using_fonts>`, FreeType veya çok-kanallı işaretli uzaklık alanları (ÇİUA, ing. MSDF) kullanarak pikselleştirme.

source: Bitmap fonts can be exported using tools like BMFont, or imported from images (for fixed-width fonts only).
cs: Bitmapové fonty lze exportovat pomocí nástrojů jako BMFont nebo importovat z obrázků (pouze pro fonty s pevnou šířkou).
fr: Les polices bitmap peuvent être exportées à l'aide d'outils comme BMFont, ou importé d'images (pour des polices avec une largeur fixée seulement).
ga: Is féidir clónna Mapa Giotán a onnmhairiú ag baint úsáide as uirlisí cosúil le BMFont, nó a allmhairiú ó íomhánna (le haghaidh clónna leithead seasta amháin).
it: I font bitmap si possono esportare attraverso strumenti come BMFont, o importati da immagini (solo per font con una larghezza fissa).
ja: ビットマップフォントは、BMFontのようなツールを使ってエクスポートすることも、画像からインポートすることも可能 (固定幅フォントのみ)。
ko: 비트맵 글꼴은 BMFont와 같은 툴로 내보내거나 이미지 파일을 통해 불러올 수 있습니다(고정폭 글꼴 전용).
pl: Czcionki bitmapowe mogą zostać wyeksportowane przy użyciu narzędzi takich jak BMFont, lub zostać zaimportowane z obrazów (tylko dla czcionek z stałą szerokością).
ru: Растровые шрифты можно экспортировать с помощью таких инструментов, как BMFont, или импортировать из изображений (только для шрифтов с фиксированной шириной).
ta: பிட்மேப் எழுத்துருக்களை BMFONT போன்ற கருவிகளைப் பயன்படுத்தி ஏற்றுமதி செய்யலாம், அல்லது படங்களிலிருந்து இறக்குமதி செய்யலாம் (நிலையான அகல எழுத்துருக்களுக்கு மட்டுமே).
tr: Bitmap yazı tipleri, BMFont gibi araçlar kullanılarak dışa aktarılabilir, veya resimlerden içe aktarılabilir (yalnızca sabit genişlikli yazı tipleri için).

source: Dynamic fonts support monochrome fonts as well as colored fonts (e.g. for emoji). Supported formats are TTF, OTF, WOFF1 and WOFF2.
cs: Dynamické fonty podporují monochromatická i barevná písma (např. pro emoji). Podporované formáty jsou TTF, OTF, WOFF1 a WOFF2.
fr: Les polices dynamiques prennent en charge les polices monochromes ainsi que les polices colorées (par exemple les émojis). Les formats pris en charge sont TTF, OTF, WOFF1 et WOFF2.
ga: Tacaíonn clónna dinimiciúla le clónna monacrómacha chomh maith le clónna daite (m.sh. le haghaidh emoji). Is iad na formáidí tacaithe TTF, OTF, WOFF1 agus WOFF2.
it: DynamicFont supporta sia i font monocromatici sia i font colorati (ad esempio per le emoji). I formati supportati sono TTF, OTF, WOFF1 e WOFF2.
ja: ダイナミックフォントは、モノクロフォントと色付きフォント (例えば絵文字用のもの) をサポート。対応形式は TTF と OTF と WOFF1 と WOFF2 です。
ko: 다이나믹 글꼴는 흑백 글꼴 뿐만 아니라 색상 글꼴 역시 지원합니다 (이모지 등). TTF, OTF, WOFF1, WOFF2 형식을 지원합니다.
pl: Dynamic Font obsługuje zarówno czcionki monochromatyczne, jak i kolorowe (np. emotikony). Obsługiwane formaty to TTF, OTF, WOFF1 oraz WOFF2.
ru: Динамичные шрифты поддерживают монохромные шрифты, а также цветные шрифты (например, для эмодзи). Поддерживаемые форматы: TTF, OTF, WOFF1 и WOFF2.
ta: மாறும் எழுத்துருக்கள் மோனோக்ரோம் எழுத்துருக்கள் மற்றும் வண்ண எழுத்துருக்களை ஆதரிக்கின்றன (எ.கா. ஈமோசிக்கு). உதவி வடிவங்கள் TTF, OTF, WOFF1 மற்றும் WOFF2.
tr: Dinamik yazı tipleri, tek renkli yazı tipleri kadar renkli yazı tiplerini de destekler (örn. emojiler). Desteklenen biçimler: TTF, OTF, WOFF1 ve WOFF2.

source: Dynamic fonts support optional font outlines with adjustable width and color.
cs: Dynamické fonty podporují volitelné obrysy písma s nastavitelnou šířkou a barvou.
fr: Le support des polices dynamiques propose des contours de police facultatifs avec une largeur et une couleur ajustables.
ga: Tacaíonn clónna dinimiciúla le imlíne roghnacha cló le leithead agus dath inchoigeartaithe.
it: I font dinamici supportano contorni facoltativi per il font, con spessore e colore regolabili.
ja: ダイナミックフォントは、幅と色を調整可能なオプションのフォントアウトラインをサポート。
ko: 다이나믹 글꼴는 선택적 글꼴 윤곽선의 두께와 색상 조정을 지원합니다.
pl: Dynamic Font obsługuje opcjonalne kontury z regulowaną szerokością i kolorem.
ru: Динамичные шрифты поддерживают дополнительные контуры шрифтов с регулируемой шириной и цветом.
ta: மாறும் எழுத்துருக்கள் உதவி விருப்ப எழுத்துரு சரிசெய்யக்கூடிய அகலம் மற்றும் வண்ணத்துடன் கோடிட்டுக் காட்டுகின்றன.
tr: Dinamik yazı tipleri, ayarlanabilir genişlik ve renge sahip isteğe bağlı yazı tipi hatlarını destekler.

source: Dynamic fonts support variable fonts and OpenType features including ligatures.
cs: Dynamické fonty podporují variabilní písma a OpenType funkce včetně ligatur.
fr: Les polices dynamiques supportent les polices variables et les fonctionnalités d'OpenType ainsi que les ligatures.
ga: Tacaíonn clónna dinimiciúla le clónna athraitheacha agus gnéithe OpenType lena n-áirítear ligatures.
it: I font dinamici supportano i font variabili e le funzionalità OpenType, incluse legature.
ja: 動的フォントは、 リガチャを含む可変フォントと OpenType の機能をサポートしています。
ko: 다이나믹 글꼴는 가변 글꼴, 합자 기능을 포함한 OpenType 기능들을 지원합니다.
pl: Czcionki dynamiczne obsługują zmienne czcionki i funkcje OpenType, w tym ligatury.
ru: Динамические шрифты поддерживают изменяемые шрифты и функции OpenType, в том числе, лигатуры.
ta: மாறும் எழுத்துருக்கள் மாறி எழுத்துருக்கள் மற்றும் தசைநார் உள்ளிட்ட ஓபன்டைப் அம்சங்களை ஆதரிக்கின்றன.
tr: Dinamik yazı tipleri, değişken yazı tiplerini ve bitişik harfler dahil OpenType özelliklerini destekler.

source: Dynamic fonts support simulated bold and italic when the font file lacks those styles.
cs: Dynamické fonty podporují simulované tučné písmo a kurzívu, pokud v souboru fontu tyto styly chybí.
fr: Les polices dynamiques supportent la simulation du gras et l'italique quand le fichier de la police n'a pas ces styles.
ga: Tacaíonn clónna dinimiciúla le clónna trom agus iodálach a insamhladh nuair nach bhfuil na stíleanna sin sa chomhad cló.
it: I font dinamici supportano la simulazione del grassetto e l'italico quando il file del font non possiede questi stili.
ja: 動的フォントは、フォントファイルに太字とイタリック体についてのスタイルがない場合に、そのシミュレートに対応しています。
ko: 다이나믹 글꼴는 글꼴 파일에 상관없이 굵게와 기울임을 지원합니다.
pl: Czcionki dynamiczne obsługują symulowane pogrubienie i kursywę, gdy plik czcionki nie zawiera tych stylów.
ru: Динамические шрифты поддерживают жирные шрифты и курсив для случаев, когда в файле шрифтов отсутствуют эти стили.
ta: எழுத்துரு கோப்பில் அந்த பாணிகள் இல்லாதபோது மாறும் எழுத்துருக்கள் உருவகப்படுத்தப்பட்ட தைரியமான மற்றும் சாய்வு உதவி.
tr: Dinamik yazı tipleri, yazı tipi dosyasında bu tarzlar bulunmadığında simüle edilmiş kalın ve italik yazı tiplerini destekler.

source: Dynamic fonts support oversampling to keep fonts sharp at higher resolutions.
cs: Dynamické fonty podporují převzorkování pro zachování ostrosti písma ve vyšších rozlišeních.
fr: Prise en charge du sur-échantillonnage des polices dynamiques pour maintenir la netteté des polices à des résolutions plus élevées.
ga: Tacaíonn clónna dinimiciúla le róshampláil chun clónna a choinneáil géar ag rúin níos airde.
it: I font dinamici supportano il sovracampionamento dei caratteri per mantenerli nitidi a risoluzioni più elevate.
ja: ダイナミックフォントは、高解像度でもフォントをシャープに保つオーバーサンプリングをサポート。
ko: 다이나믹 글꼴는 더 높은 해상도에서도 글꼴이 선명하게 보이도록 오버샘플링을 지원합니다.
pl: Dynamic Fonts wspiera nadpróbkowania w celu utrzymania ostrości przy wyższych rozdzielczościach.
ru: Динамичные шрифты поддерживают передискретизацию шрифтов для сохранения четкости шрифтов при более высоком разрешении.
ta: அதிக தீர்மானங்களில் எழுத்துருக்களை கூர்மையாக வைத்திருக்க மாறும் எழுத்துருக்கள் மிகைப்படுத்தலை ஆதரிக்கின்றன.
tr: Dinamik yazı tipleri, daha yüksek çözünürlüklerde yazı tiplerinin keskin kalmasını sağlamak için aşırı örneklemeyi destekler.

source: Dynamic fonts support subpixel positioning to make fonts crisper at low sizes.
cs: Dynamické fonty podporují subpixelové polohování pro zachování ostrosti písma při malých velikostech.
fr: Les polices dynamiques prennent en charge le positionnement subpixel pour rendre les polices plus nettes à de petites tailles.
ga: Tacaíonn clónna dinimiciúla le suíomh subpixel chun clónna a dhéanamh crisper ag méideanna ísle.
it: I font dinamici supportano il posizionamento subpixel per rendere i caratteri più nitidi a piccole dimensioni.
ja: 動的フォントは、小サイズでの文字表示を鮮明化するためのサブピクセル単位での位置指定をサポートしています。
ko: 다이나믹 글꼴는 글씨를 작은 크기에서 선명하게 보이게 하기 위해 서브픽셀 포지셔닝을 지원합니다.
pl: Dynamiczne czcionki obsługują pozycjonowanie subpikseli, dzięki czemu czcionki są wyraźniejsze przy małych rozmiarach.
ru: Динамические шрифты поддерживают субпиксельное позиционирование, которое делать шрифт чётче при маленьких размерах.
ta: மாறும் எழுத்துருக்கள் குறைந்த அளவுகளில் எழுத்துருக்களை மிருதுவாக மாற்ற சப் படப்புள்ளி நிலைப்படுத்தலை ஆதரிக்கின்றன.
tr: Dinamik yazı tipleri düşük boyutlarda keskinlik sağlamak için alt-piksel konumlandırmayı destekler.

source: Dynamic fonts support LCD subpixel optimizations to make fonts even crisper at low sizes.
cs: Dynamické fonty podporují optimalizace LCD subpixelů pro ještě ostřejší písmo při malých velikostech.
fr: Les polices dynamique supportent les optimisations LCD subpixel pour rendre les polices encore plus nettes à des petites tailles.
ga: Tacaíonn clónna dinimiciúla le optimizations subpixel LCD chun clónna a dhéanamh fiú crisper ag méideanna ísle.
it: I font dinamici supportano le ottimizzazioni subpixel LCD per rendere i caratteri ancora più nitidi a piccole dimensioni.
ja: 動的フォントは、小サイズでの文字表示を鮮明化するためのLCDサブピクセル最適化をサポートしています。
ko: 다이나믹 글꼴는 글씨를 작은 크기에서 더욱 더 선명하게 보이게 하기 위해 LCD 서브픽셀 포지셔닝을 지원합니다.
pl: Dynamiczne czcionki obsługują optymalizacje subpikseli LCD, aby czcionki były jeszcze wyraźniejsze przy małych rozmiarach.
ru: Динамические шрифты поддерживают LCD-субпиксельные оптимизации, которое делает шрифт чётче при маленьких размерах.
ta: மாறும் எழுத்துருக்கள் எல்.சி.டி சப் படப்புள்ளி மேம்படுத்தல்களை ஆதரிக்கின்றன, எழுத்துருக்களை குறைந்த அளவுகளில் மிருதுவாக மாற்றுகின்றன.
tr: Dinamik yazı tipleri, düşük boyutlarda ilave keskinlik sağlamak için LCD alt-piksel iyileştirmelerini destekler.

source: Signed distance field fonts can be scaled at any resolution without requiring re-rasterization. Multi-channel usage makes SDF fonts scale down to lower sizes better compared to monochrome SDF fonts.
cs: Fonty s polem vzdáleností se znaménkem (SDF) mohou být škálovány na jakékoli rozlišení bez nutnosti opětovného rastrování. Použití více kanálů umožňuje SDF fonty lépe zmenšovat ve srovnání s monochromatickými SDF fonty.
fr: Les polices de caractères de cartes de distances signés peuvent être étirées dans n'importe quelle résolution sans passer par une re-rastérisation. L'usage multi-canaux permet aux polices de caractères SDF d'être réduites à de plus petites tailles comparés à des polices SDF monochromes.
ga: Is féidir clónna réimse achar sínithe a scála ag aon rún gan gá ath-rasterization. Déanann úsáid il-chainéil clónna SDF scála síos go dtí méideanna níos ísle níos fearr i gcomparáid le clónna SDF monacrómacha.
it: I font signed distance field (SDF) possono essere ridimensionati a qualsiasi risoluzione senza richiedere una nuova rasterizzazione. L'uso multi-canale consente ai font SDF di ridursi meglio a dimensioni inferiori rispetto ai font SDF monocromatici.
ja: 符号付きディスタンスフィールドフォントは、再ラスタライズを必要とせず、どの解像度でも拡大縮小が可能です。マルチチャンネルの使用により、SDFフォントは、モノクロSDFフォントと比較して、より低いサイズにスケールダウンすることができます。
ko: 부호화 디스턴스 필드(SDF, Signed Distance Field) 글꼴는 재래스터화 없이도 모든 해상도로 스케일 조정이 가능합니다. 다중 채널 SDF는 단색 SDF 글꼴에 비해 SDF 글꼴를 작은 크기로 더 잘 축소할 수 있게 합니다.
pl: Czcionki Signed Distance Field można skalować w dowolnej rozdzielczości bez konieczności ponownej rasteryzacji. Użycie wielu kanałów sprawia, że czcionki SDF skalują się do niższych rozmiarów lepiej niż monochromatyczne czcionki SDF.
ru: Шрифты, задающиеся знаковым полем расстояния (SDF-шрифты), могут масштабироваться на любое разрешение без перерастеризации. Использование многоканальности позволяет масштабировать многоканальные SDF-шрифты до мелких размеров лучше, по сравнению с монохромными SDF-шрифтами.
ta: கையொப்பமிடப்பட்ட தொலைதூர புல எழுத்துருக்கள் எந்தவொரு தீர்மானத்திலும் மறு-ரச்டரைசேசன் தேவையில்லாமல் அளவிடப்படலாம். மல்டி-சேனல் பயன்பாடு மோனோக்ரோம் எச்டிஎஃப் எழுத்துருக்களுடன் ஒப்பிடும்போது எச்.டி.எஃப் எழுத்துருக்கள் அளவைக் குறைக்கும்.
tr: İşaretli uzaklık alanı (SDF) yazı tipleri, yeniden pikselleştirmeye gerek duymadan herhangi bir çözünürlüğe ölçeklenebilir. Çoklu kanal kullanımı, İUA yazı tiplerini tek renkli İUA yazı tiplerine kıyasla daha düşük boyutlara ölçeklemeyi sağlar.

source: GPU-based :ref:`particles <doc_particle_systems_2d>` with support for :ref:`custom particle shaders <doc_particle_shader>`.
cs: GPU generované :ref:`částice <doc_particle_systems_2d>` s podporou :ref:`vlastních částicových shaderů <doc_particle_shader>`.
fr: :ref:`Particules <doc_particle_systems_2d>` calculées par le GPU avec prise en charge de :ref:`shaders de particules personnalisés<doc_particle_shader>`.
ga: GPU-bhunaithe :ref:`cáithníní <doc_particle_systems_2d>` le tacaíocht do :ref:`scáthairí cáithníní saincheaptha <doc_particle_shader>`.
it: :ref:`Particelle <doc_particle_systems_2d>` calcolate dalla GPU con supporto per :ref:`shader personalizzati di particelle <doc_particle_shader>`.
ja: GPUベースの :ref:`パーティクル <doc_particle_systems_2d>` と :ref:`カスタムパーティクルシェーダー <doc_particle_shader>` をサポート。
ko: :ref:`사용자 지정 입자 셰이더<doc_particle_shader>`\ 를 지원하는 :ref:`GPU 기반 입자<doc_particle_systems_2d>`.
pl: :ref:`Cząsteczki <doc_particle_systems_2d>` oparte na GPU z obsługą :ref:`własnych shaderów cząstek<doc_particle_shader>`.
ru: :ref:`Частицы <doc_particle_systems_2d>` на базе GPU с поддержкой :ref:`пользовательских шейдеров частиц <doc_particle_shader>`.
ta: GPU- அடிப்படையிலான: ref: `துகள்கள் <doc_particle_systems_2d>` இதற்கான ஆதரவுடன்: ref: `தனிப்பயன் துகள் சேடர்கள் <doc_particle_shader>`.
tr: :ref:`Özel parçacık gölgelendiricileri<doc_particle_shader>` desteğiyle GPU-tabanlı :ref:`parçacıklar <doc_particle_systems_2d>`.

source: CPU-based particles.
cs: CPU generované částice.
fr: Particules générées par le CPU.
ga: Cáithníní lap-bhunaithe.
it: Particelle basate sulla CPU.
ja: CPUベースのパーティクル。
ko: CPU 기반 입자.
pl: Cząsteczki oparte na CPU.
ru: Частицы на базе процессора.
ta: CPU- அடிப்படையிலான துகள்கள்.
tr: CPU-tabanlı parçacıklar.

source: Optional :ref:`2D HDR rendering <doc_environment_and_post_processing_using_glow_in_2d>` for better glow capabilities.
cs: Volitelné :ref:`2D HDR vykreslování <doc_environment_and_post_processing_using_glow_in_2d>` pro lepší možnosti záření.
fr: Optionnel :ref:`Rendu HDR 2D<doc_environment_and_post_processing_using_glow_in_2d>` pour de meilleurs effets de brillance.
ga: Roghnach :tag:` rindreáil HDR 2D <doc_environment_and_post_processing_using_glow_in_2d>` le haghaidh cumais níos fearr glow.
it: :ref:`Rendering in HDR 2D <doc_environment_and_post_processing_using_glow_in_2d>` opzionale per migliori effetti di bagliore.
ja: オプション :ref:`2D HDRレンダリング<doc_environment_and_post_processing_using_glow_in_2d>` を使用すると、グロー機能が向上します。
ko: 향상된 글로우 능력을 위한 선택적 :ref:`2D HDR 렌더링 <doc_environment_and_post_processing_using_glow_in_2d>`.
pl: Nieobowiązkowy :ref:`2D HDR rendering <doc_environment_and_post_processing_using_glow_in_2d>` dla lepszych możliwości.
ru: Опциональная :ref:`2D HDR отрисовка <doc_environment_and_post_processing_using_glow_in_2d>` для лучшего использования эффектов свечения.
ta: விரும்பினால்: Ref: `2D HDR வழங்குதல் <doc_enveronment_and_post_processing_using_glow_in_2d>` சிறந்த பளபளப்பான திறன்களுக்கு.
tr: Daha iyi parlama yetenekleri için isteğe bağlı :ref:`2B HDR işleme <doc_environment_and_post_processing_using_glow_in_2d>`.

source: 2D tools
cs: 2D nástroje
fr: Outils 2D
ga: Uirlisí 2D
it: Strumenti 2D
ja: 2Dツール
ko: 2D 툴
pl: Narzędzia 2D
ru: 2D инструменты
ta: 2 டி கருவிகள்
tr: 2B araçlar

source: :ref:`TileMaps <doc_using_tilemaps>` for 2D tile-based level design.
cs: :ref:`Mapy dlaždic <doc_using_tilemaps>` pro návrh úrovní založených na 2D dlaždicích.
fr: :ref:`TileMaps <doc_using_tilemaps>` pour de la conception de niveau 2D basé sur des tuiles.
ga: :ref:`TileMaps <doc_using_tilemaps>` le haghaidh dearadh leibhéal 2T bunaithe ar tíleanna.
it: :ref:`TileMaps <doc_using_tilemaps>` per level design basato su Tile 2D.
ja: :ref:`TileMaps <doc_using_tilemaps>` は2Dタイルベースのレベルデザインです。
ko: :ref:`타일맵 <doc_using_tilemaps>`\ 을 통한 2D 타일 기반 레벨 디자인.
pl: ref:`TileMaps <doc_using_tilemaps>` do projektowania poziomów opartych na kafelkach 2D.
ru: :ref:`Карты тайлов <doc_using_tilemaps>` для дизайна 2D уровней, состоящих из тайлов.
ta: :ref:`TileMaps <doc_using_tilemaps>` க்கு 2D tile-based நிலை design.
tr: 2B karo temelli seviye tasarımı için :ref:`karo haritaları (TileMap) <doc_using_tilemaps>`.

source: 2D camera with built-in smoothing and drag margins.
cs: 2D kamera s vestavěným vyhlazováním a okraji pro tažení.
fr: Caméra 2D avec lissage intégré et marges de déplacement.
ga: Ceamara 2D le smúdála tógtha agus corrlaigh tarraing.
it: Telecamera 2D con movimento fluido integrato e margini di scorrimento.
ja: 2Dカメラは、スムージングとドラッグマージンを内蔵。
ko: 내장 스무딩과 드래그 여백으로 된 2D 카메라.
pl: Kamera 2D z wbudowanym wygładzaniem i marginesami przeciągania.
ru: 2D-камера со встроенной функцией сглаживания и перетаскивания полей.
ta: உள்ளமைக்கப்பட்ட மென்மையான மற்றும் இழுவை விளிம்புகளுடன் 2 டி கேமரா.
tr: Yerleşik düzleştirme ve sürükleme kenar boşluklarına sahip 2B kamera.

source: Path2D node to represent a path in 2D space.
cs: Uzel Path2D reprezentující cestu ve 2D prostoru.
fr: Nœud Path2D pour représenter un chemin dans l'espace 2D.
ga: Nód Path2D chun cosán a léiriú i spás 2D.
it: Nodo Path2D per rappresentare un percorso nello spazio 2D.
ja: 2D空間で経路を表現する Path2D ノード。
ko: 2D 공간에서의 경로를 나타내는 Path2D 노드.
pl: Węzeł Path2D reprezentujący ścieżkę w przestrzeni 2D.
ru: Узел Path2D для представления пути в 2D пространстве.
ta: 2 டி இடத்தில் ஒரு பாதையை குறிக்க பாதை 2 டி முனை.
tr: 2B uzayda bir yolu temsil eden Path2D düğümü.

source: Can be drawn in the editor or generated procedurally.
cs: Lze nakreslit v editoru nebo generovat procedurálně.
fr: Peut être dessiné dans l'éditeur ou généré de manière procédurale.
ga: Is féidir é a tharraingt san eagarthóir nó a ghiniúint nós imeachta.
it: Può essere disegnato nell'editor o generato proceduralmente.
ja: エディタ内で描画したり、手続き的に生成が可能。
ko: 편집기에서 그리거나 절차적으로 생성할 수 있습니다.
pl: Może być narysowany w edytorze lub wygenerowany proceduralnie.
ru: Пути могут быть нарисованы в редакторе или сгенерированы процедурно.
ta: எடிட்டரில் வரையப்படலாம் அல்லது நடைமுறை ரீதியாக உருவாக்கப்படலாம்.
tr: Düzenleyicide çizilebilir, veya yöntemsel olarak üretilebilir.

source: PathFollow2D node to make nodes follow a Path2D.
cs: Uzel PathFollow2D, za pomoci kterého mohou uzly sledovat cestu definovanou Path2D.
fr: Nœud PathFollow2D pour que les nœuds suivent un Path2D.
ga: Nód PathFollow2D chun nóid a dhéanamh lean Path2D.
it: Nodo PathFollow2D per fare in modo che i nodi seguano un Path2D.
ja: ノードを Path2D に追従させるためのノードである PathFollow2D。
ko: 노드가 Path2D 경로를 따라가도록 하는 PathFollow2D 노드.
pl: Węzeł PathFollow2D pozwalający węzłom podążać za Path2D.
ru: Узел PathFollow2D позволяет следовать по Path2D.
ta: Pathfollow2D முனை முனைகள் ஒரு பாதை 2D ஐப் பின்பற்றுகின்றன.
tr: Düğümlerin bir Path2D'yi takip etmesini sağlamak için PathFollow2D düğümü.
