Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: glTF 2.0 *(recommended)*.
cs: glTF 2.0 *(doporučeno)*.
fr: glTF 2.0 *(recommandé)*.
ga: glTF 2.0 *(molta)*.
it: glTF 2.0 *(consigliato)*.
ja: glTF 2.0 *(推奨)*。
ko: glTF 2.0 *(권장)*.
pl: glTF 2.0 *(zalecane)*.
ru: glTF 2.0 *(рекомендуется)*.
ta: gltf 2.0 *(பரிந்துரைக்கப்படுகிறது) *.
tr: glTF 2.0 *(önerilen)*.

source: ``.blend`` (by calling Blender's glTF export functionality transparently).
cs: ``.blend`` (za transparentního použití funkcí Blenderu pro export glTF).
fr: ``.blend`` (en appelant de manière transparente la fonctionnalité d'exportation glTF de Blender).
ga: ''.blend'' (trí fheidhmiúlacht onnmhairithe glTF Blender a ghlaoch go trédhearcach).
it: ``.blend`` (chiamando in modo trasparente la funzionalità di esportazione glTF di Blender).
ja: ``.blend`` 拡張子ファイル (内部的にブレンダーの glTF 出力機能が使用されます)。
ko: ``.blend`` 파일 (Blender의 glTF 내보내기 기능을 투명하게 호출하여).
ru: ``.blend`` (при помощи вызова функционала экспорта glTF из Blender).
ta: `` .ஃப்ளெண்ட்`` (பிளெண்டரின் சி.எல்.டி.எஃப் ஏற்றுமதி செயல்பாட்டை வெளிப்படையாக அழைப்பதன் மூலம்).
tr: ``.blend`` (Blender'ın glTF dışa aktarma işlevini şeffaf bir şekilde çağırarak).

source: FBX (by calling `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ transparently).
cs: FBX (za transparentního použití `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__).
fr: FBX (en appelant `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ de manière transparente).
ga: FBX (trí ghlao a chur ar `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ go trédhearcach).
it: FBX (chiamando `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ in modo trasparente).
ja: FBX 形式のファイル (内部的に `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ が使用されます)。
ko: FBX 파일 (백그라운드에서 `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ 호출하여).
ru: FBX (при помощи вызова `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ конвертера).
ta: Fbx (`fbx2gltf <https://github.com/godotengine/fbx2gltf> __ வெளிப்படையாக) அழைப்பதன் மூலம்).
tr: FBX (şeffaf şekilde `FBX2glTF <https://github.com/godotengine/FBX2glTF>`__ çağırarak).

source: Collada (.dae).
ja: Collada (.dae 拡張子のファイル)。
ru: Collada (.daе).
ta: கொலடா (.டே).

source: Wavefront OBJ (static scenes only, can be loaded directly as a mesh or imported as a 3D scene).
cs: Wavefront OBJ (pouze statické scény, lze načíst přímo jako síť nebo importovat jako 3D scény).
fr: Wavefront OBJ (scènes statiques uniquement, peut être chargé directement sous forme de maillage ou importé sous forme de scène 3D).
ga: Wavefront OBJ (radhairc statacha amháin, is féidir iad a luchtú go díreach mar mogalra nó a allmhairiú mar radharc 3D).
it: Wavefront OBJ (solamente scene statiche, si possono caricare direttamente come mesh o importate sotto forma di scena 3D).
ja: Wavefront OBJ (静的シーンのみ、メッシュとして直接ロードするか3Dシーンとしてインポート可能)。
ko: Wavefront OBJ (정적 씬에서만 가능, 메시로 직접 로드하거나 3D 씬으로 가져올 수 있습니다).
ru: Wavefront OBJ (только статические сцены, могут быть загружены непосредственно как 3D-модель или импортированы как 3D-сцена).
ta: அலைமுனை OBJ (நிலையான காட்சிகள் மட்டும், நேரடியாக ஒரு கண்ணி என ஏற்றப்படலாம் அல்லது 3D காட்சியாக இறக்குமதி செய்யப்படலாம்).
tr: Wavefront OBJ (yalnızca statik sahneler içindir, doğrudan örgü olarak yüklenebilir veya 3B sahne olarak içe aktarılabilir).

source: Support for loading glTF 2.0 scenes at runtime, including from an exported project.
cs: Podpora načítání scén glTF 2.0 za běhu i v exportovaných projektech.
fr: Support du chargement de scènes glTF 2.0 au moment de l'exécution, y compris à partir d'un projet exporté.
it: Supporto per il caricamento di scene in formato glTF 2.0 in fase di esecuzione, anche da un progetto esportato.
ja: エクスポートされたプロジェクトも含め、glTF2.0シーンの実行時ロードに対応。
ko: 내보낸 프로젝트를 포함하여 런타임에 glTF 2.0 씬을 불러오기를 지원합니다.
ru: Поддержка загрузки сцен glTF 2.0 во время выполнения, в том числе из экспортированного проекта.
ta: ஏற்றுமதி செய்யப்பட்ட திட்டத்தின் உட்பட, இயக்க நேரத்தில் சி.எல்.டி.எஃப் 2.0 காட்சிகளை ஏற்றுவதற்கான உதவி.

source: 3D meshes use `Mikktspace <http://www.mikktspace.com/>`__ to generate tangents on import, which ensures consistency with other 3D applications such as Blender.
cs: 3D sítě používají `Mikktspace <http://www.mikktspace.com/>`__ ke generování tečen při importu pro zajištění konzistence s jinými 3D aplikacemi, jako je Blender.
fr: Les maillages 3D utilisent `Mikktspace <http://www.mikktspace.com/>`__ pour générer les tangentes à l'importation, ce qui permet de s'assurer de la cohérence avec les autres applications 3D comme Blender.
ga: Úsáideann meshes 3D `Mikktspace <http://www.mikktspace.com/>`__ chun tadhlaí a ghiniúint ar allmhairiú, rud a chinntíonn comhsheasmhacht le feidhmchláir 3D eile ar nós Cumascóir.
it: Le mesh 3D utilizzano `Mikktspace <http://www.mikktspace.com/>`__ per generare le tangenti all'importazione, il che garantisce la coerenza con altre applicazioni 3D come Blender.
ja: 3D メッシュは\ `Mikktspace <http://www.mikktspace.com/>`__\ を使用してインポート時に接線を生成し、Blenderなどの他の 3D アプリケーションとの一貫性を確保します。
ko: 3D 메시는 `Mikktspace <http://www.mikktspace.com/>`__\ 를 사용하여 가져올 때 탄젠트를 생성하고, 블렌더=와 같은 3D 애플리케이션과의 일관성을 확보합니다.
pl: Siatki 3D używają `Mikktspace <http://www.mikktspace.com/>`__ do generowania stycznych podczas importu, co zapewnia spójność z innymi aplikacjami 3D, takimi jak Blender.
ru: 3D-модели используют `Mikktspace <http://www.mikktspace.com/>`__ для создания касательных при импорте, что обеспечивает совместимость с другими 3D-приложениями, такими как Blender.
ta: 3D மெச்கள் `மைக்க்ட்ச்பேச் <http://www.mikktspace.com/> __ இறக்குமதியில் தொடுகோடுகளை உருவாக்குவதற்கு __ பயன்படுத்துகின்றன, இது பிளெண்டர் போன்ற பிற 3D பயன்பாடுகளுடன் நிலைத்தன்மையை உறுதி செய்கிறது.
tr: 3B örgüler, içe aktarma sırasında teğetler üretmek için `Mikktspace <http://www.mikktspace.com/>`__ kullanır, bu da Blender gibi diğer 3B uygulamalarla tutarlılık sağlar.

source: Input
cs: Vstup
fr: Entrée
ga: Ionchur
ja: 入力
ko: 입력
pl: Wejście
ru: Вход
ta: உள்ளீடு
tr: Girdi

source: :ref:`Input mapping system <doc_input_examples>` using hardcoded input events or remappable input actions.
cs: :ref:`Systém mapování vstupů <doc_input_examples>` využívající natvrdo zakódované vstupní události nebo přemapovatelné vstupní akce.
fr: :ref:`Système de mappage d'entrée <doc_input_examples>` utilisant des événements d'entrée codés en dur ou des actions d'entrée reconfigurables.
ga: :ref:`Córas mapála ionchuir <doc_input_examples>` ag baint úsáide as teagmhais ionchuir le cód crua nó gníomhartha ionchuir inathshuite.
it: :ref:`Sistema di mappatura degli input<doc_input_examples>` che utilizza eventi codificati o azioni rimappabili di input.
ja: ハードコードされた入力イベントまたは再マップ可能な入力アクションを使用した :ref:`入力マッピングシステム <doc_input_examples>`。
ko: 하드코딩된 입력 이벤트 또는 다시 매핑할 수 있는 입력 액션을 이용한 :ref:`입력 매핑 시스템 <doc_input_examples>`.
ru: :ref:`Система сопоставления ввода <doc_input_examples>` с использованием жёстко запрограммированных событий ввода или переназначаемых действий ввода.
ta: :ref:`Input கோர்ப்பு மண்டலம் <doc_input_examples>` using hardcoded input நிகழ்வுகள் or remappable input actions.
tr: Kodlanmış giriş olaylarını veya yeniden atanabilir giriş eylemlerini kullanan :ref:`girdi haritalama sistemi <doc_input_examples>`.

source: Axis values can be mapped to two different actions with a configurable deadzone.
cs: Hodnoty os lze mapovat na dvě různé akce pomocí konfigurovatelného mrtvého pásma.
fr: Les valeurs des axes peuvent être associées à deux actions différentes avec une zone morte configurable.
ga: Is féidir luachanna ais a mhapáil le dhá ghníomh éagsúla le deadzone configurable.
it: I valori degli assi possono essere mappati su due diverse azioni con una zona morta configurabile.
ja: 軸の値は、設定可能なデッドゾーンを使用して 2 つの異なるアクションにマップできます。
ko: 입력 축 값은 데드존을 구성하여 두 개의 다른 액션으로 매핑할 수 있습니다.
pl: Wartości osi mogą być przypisane do dwóch różnych akcji z konfigurowalną martwą strefą.
ru: Значения осей могут быть сопоставлены с двумя различными действиями с настраиваемой мёртвой зоной.
ta: அச்சு மதிப்புகளை உள்ளமைக்கக்கூடிய டெட்சோன் மூலம் இரண்டு வெவ்வேறு செயல்களுக்கு மாற்றலாம்.
tr: Eksen değerleri, ayarlanabilir ölü bölge ile iki farklı eyleme haritalanabilirler.

source: Use the same code to support both keyboards and gamepads.
cs: Používejte stejný kód pro podporu klávesnice i gamepadů.
fr: Utilise le même code pour prendre en charge les claviers et les manettes de jeu.
ga: Bain úsáid as an cód céanna chun tacú le méarchláir agus gamepads araon.
it: Usa lo stesso codice per supportare sia tastiere sia gamepad.
ja: キーボードとゲームパッドの両方をサポートするために同じコードを使います。
ko: 같은 코드로 키보드와 게임패드 둘 다 지원 가능합니다.
pl: Użyj takiego samego codu ,by wspierać oba: klawiaturę i gamypad'y.
ru: Используйте один и тот же код для поддержки клавиатур и геймпадов.
ta: விசைப்பலகை மற்றும் கேம்பேட் இரண்டையும் ஆதரிக்க ஒரே குறியீட்டைப் பயன்படுத்தவும்.
tr: Hem klavyeleri hem de oyun kumandalarını desteklemek için aynı kodu kullanın.

source: Keyboard input.
cs: Vstup z klávesnice.
fr: Entrée clavier.
ga: Ionchur méarchláir.
it: Input da tastiera.
ja: キーボード入力。
ko: 키보드 입력.
pl: Klawiatura.
ru: Ввод клавиатуры.
ta: விசைப்பலகை உள்ளீடு.
tr: Klavye girişi.

source: Keys can be mapped in "physical" mode to be independent of the keyboard layout.
cs: Klávesy lze mapovat ve "fyzickém“ režimu, aby byly nezávislé na rozvržení klávesnice.
fr: Les touches peuvent être mappées en mode "physique" pour être indépendantes de la disposition du clavier.
ga: Is féidir eochracha a mhapáil i mód "fisiciúil" le bheith neamhspleách ar leagan amach an mhéarchláir.
it: I tasti possono essere mappati in modalità "fisica" per essere indipendenti dal layout della tastiera.
ja: キーは、キーボード レイアウトに依存しない "物理" モードでマップできます。
ko: "물리" 모드로 키를 매핑하여 키보드 레이아웃에 독립적이게 할 수 있습니다.
pl: Klucze mogą być mapowane w modzie "fizycznym" ,by być niezależne od układu klawiatury.
ru: Клавиши могут быть назначены в "физическом" режиме, для того, чтобы быть независимыми от раскладки клавиатуры.
ta: விசைப்பலகை தளவமைப்பிலிருந்து சுயாதீனமாக இருக்க விசைகளை "இயற்பியல்" பயன்முறையில் வரைபடமாக்கலாம்.
tr: Tuşlar, klavye düzeninden bağımsız olacak şekilde "fiziksel" kipte haritalanabilir.

source: Mouse input.
cs: Vstup myši.
fr: Entrée souris.
ga: Ionchur luiche.
it: Input del mouse.
ja: マウス入力。
ko: 마우스 입력.
pl: Mysz.
ru: Ввод мышью.
ta: சுட்டி உள்ளீடு.
tr: Fare girişi.

source: The mouse cursor can be visible, hidden, captured or confined within the window.
cs: Kurzor myši může být viditelný, skrytý, zachycený nebo omezený na pohyb v okně.
fr: Le curseur de la souris peut être visible, caché, capturé ou confiné dans la fenêtre.
ga: Is féidir cúrsóir na luiche a fheiceáil, a cheilt, a ghabháil nó a theorannú laistigh den fhuinneog.
it: Il cursore del mouse può essere visibile, nascosto, catturato o confinato all'interno della finestra.
ja: マウスカーソルは、ウィンドウ内で表示、非表示、キャプチャ、または閉じ込めることができます。
ko: 마우스 커서를 보이게 하거나 숨기거나 캡처하거나 창 안으로 가둘 수 있습니다.
pl: Kursor myszy może być widoczny, schowany, złapany lub ograniczony w obrębie okna.
ru: Курсор мыши может быть видимым, скрытым, фиксированным или ограниченным в пределах окна.
ta: மவுச் கர்சர் சாளரத்திற்குள் தெரியும், மறைக்கப்பட்ட, கைப்பற்றப்பட்ட அல்லது கட்டுப்படுத்தப்படலாம்.
tr: Fare imleci görünebilir, gizlenebilir, yakalanabilir veya pencere içinde tutulabilir.

source: When captured, raw input will be used on Windows and Linux to sidestep the OS' mouse acceleration settings.
cs: Při zachycení bude v systémech Windows a Linux použitý nezpracovaný vstup, aby se vyhnul nastavení akcelerace myši operačního systému.
fr: Une fois capturée, l'entrée brute sera utilisée sous Windows et Linux pour contourner les paramètres d'accélération de la souris du système d'exploitation.
ga: Nuair a ghabhtar é, úsáidfear ionchur amh ar Windows agus Linux chun socruithe luasghéaraithe luiche an OS a thaobhú.
it: Quando acquisito, l'input grezzo verrà utilizzato su Windows e Linux per eludere le impostazioni di accelerazione del mouse del sistema operativo.
ja: キャプチャすると、WindowsやLinuxでは未加工の入力値が使用され、OSのマウスアクセラレーション設定を回避することができます。
ko: 입력이 캡쳐되는 경우 Windows나 Linux에서는 OS의 마우스 가속 설정에 맞춰 입력의 로우값을(raw input) 사용하게 됩니다.
pl: Po przechwyceniu surowe dane wejściowe zostaną użyte w systemach Windows i Linux, aby ominąć ustawienia przyspieszenia myszy w systemie operacyjnym.
ru: После захвата необработанный ввод будет использоваться в Windows и Linux, чтобы обойти настройки ускорения мыши ОС.
ta: கைப்பற்றப்படும்போது, OS இன் சுட்டி முடுக்கம் அமைப்புகளைத் தவிர்ப்பதற்கு சாளரங்கள் மற்றும் லினக்சில் மூல உள்ளீடு பயன்படுத்தப்படும்.
tr: Yakalandığında, Windows ve Linux'ta işletim sisteminin fare hızlandırma ayarlarından kaçınmak için ham girdi kullanılacaktır.

source: Gamepad input (up to 8 simultaneous controllers).
cs: Vstup z gamepadu (až 8 současně připojených ovladačů).
fr: Entrée manette de jeu (jusqu'à 8 contrôleurs en simultané).
ga: Ionchur Gamepad (suas le 8 rialaitheoirí comhuaineacha).
it: Input Gamepad (fino a 8 controller simultanei).
ja: ゲームパッド入力 (最大8台同時使用コントローラ)。
ko: 게임패드 입력(최대 8개 컨트롤러까지 동시 입력 가능).
pl: Wejście gamepada (do 8 jednoczesnych kontrolerów).
ru: Ввод от геймпада (до 8 контроллеров одновременно).
ta: கேம்பேட் உள்ளீடு (ஒரே நேரத்தில் 8 வரை).
tr: Oyun kumandası girişi (8 adede kadar eşzamanlı denetleyici).

source: Pen/tablet input with pressure support.
cs: Vstup pera/tabletu s podporou tlaku.
fr: Saisie au stylet/tablette avec support de la pression.
ga: Ionchur peann / táibléid le tacaíocht brú.
it: Input penna/tablet con supporto della pressione.
ja: 筆圧対応のペン/タブレット入力。
ko: 펜/태블릿의 압력에 의한 입력 지원.
pl: Wejście pióra/tabletu graficznego z obsługą nacisku.
ru: Перо и планшет с поддержкой давления.
ta: அழுத்தம் ஆதரவுடன் பேனா/டேப்லெட் உள்ளீடு.
tr: Basınç destekli kalem/tablet girişi.

source: Navigation
cs: Navigace
ga: Nascleanúint
it: Navigazione
ja: ナビゲーション
ko: 내비게이션
pl: Nawigacja
ru: Навигация
ta: வானோடல்
tr: Gezinti

source: A* algorithm in :ref:`2D <class_AStar2D>` and :ref:`3D <class_AStar3D>`.
cs: Algoritmus A* ve :ref:`2D <class_AStar2D>` a :ref:`3D <class_AStar3D>`.
fr: Algorithme A* en :ref:`2D <class_AStar2D>` et :ref:`3D <class_AStar3D>`.
ga: Algartam A* i :ref:`2D <class_AStar2D>` agus :tag:`3D <class_AStar3D>`.
it: Algoritmo A* in :ref:`2D <class_AStar2D>` e :ref:`3D <class_AStar3D>`.
ja: :ref:`2D <class_AStar2D>` と :ref:`3D <class_AStar3D>` の A* アルゴリズム。
ko: :ref:`2D <class_AStar2D>` 및 :ref:`3D <class_AStar3D>`\ 에서 A* 알고리즘 지원.
ru: Алгоритм A* в :ref:`2D <class_AStar2D>` и :ref:`3D <class_AStar3D>`.
ta: A* வழிமுறை: ref: `2d <class_astar2d>` மற்றும்: ref: `3d <class_astar3d>`.
tr: :ref:`2B <class_AStar2D>` ve :ref:`3B <class_AStar3D>` için A* algoritması.

source: Navigation meshes with dynamic obstacle avoidance in :ref:`2D <doc_navigation_overview_2d>` and :ref:`3D <doc_navigation_overview_3d>`.
cs: Navigační sítě s dynamickým vyhýbáním překážkám ve :ref:`2D <doc_navigation_overview_2d>` a :ref:`3D <doc_navigation_overview_3d>`.
fr: Maillages de navigation avec évitement dynamique d'obstacle en :ref:`2D <doc_navigation_overview_2d>` et :ref:`3D <doc_navigation_overview_3d>`.
ga: Mogalra nascleanúna le bacainní dinimiciúla a sheachaint i :ref:`2D <doc_navigation_overview_2d>` agus :ref:`3D <doc_navigation_overview_3d>`.
it: Mesh di navigazione con evitamento dinamico degli ostacoli in :ref:`2D <doc_navigation_overview_2d>` e :ref:`3D <doc_navigation_overview_3d>`.
ja: 動的 (Dynamic) な障害物を回避する機能を備えた :ref:`2D <doc_navigation_overview_2d>` 、または :ref:`3D <doc_navigation_overview_3d>` でのナビゲーションメッシュ。
ko: :ref:`2D <doc_navigation_overview_2d>` 및 :ref:`3D <doc_navigation_overview_3d>`\ 에서 동적 장애물 회피 기능이 있는 내비게이션 메시.
ru: Навигационные сетки с динамическим обходом препятствий в :ref:`2D <doc_navigation_overview_2d>` и :ref:`3D <doc_navigation_overview_3d>`.
ta: மாறும் தடையாகத் தவிர்ப்பதன் மூலம் வழிசெலுத்தல் மெச்கள்: குறிப்பு: `2d <doc_navigation_overview_2d>` மற்றும்: ref: `3d <doc_navigation_overview_3d>`.
tr: :ref:`2B <doc_navigation_overview_2d>` ve :ref:`3B <doc_navigation_overview_3d>` için dinamik engellerden kaçınma özelliğine sahip gezinti örgüleri.

source: Generate navigation meshes from the editor or at runtime (including from an exported project).
cs: Generujte navigační sítě v editoru nebo za běhu (včetně exportovaných projektů).
fr: Générer des maillages de navigation à partir de l'éditeur ou en temps réel (y compris d'un projet exporté).
it: Genera mesh di navigazione dall'editor o in fase di esecuzione (anche da un progetto esportato).
ja: ナビゲーションメッシュをエディタまたはランタイム (エクスポートされたプロジェクトを含む) から生成します。
ko: 편집기나 런타임에서 내비게이션 메시를 생성합니다 (내보낸 프로젝트를 포함).
ru: Генерация навигационной сетки из редактора или во время выполнения (в том числе из экспортированного проекта).
ta: எடிட்டரிடமிருந்து அல்லது இயக்க நேரத்தில் (ஏற்றுமதி செய்யப்பட்ட திட்டத்திலிருந்து உட்பட) வழிசெலுத்தல் மெச்களை உருவாக்குங்கள்.

source: Networking
cs: Síťování
fr: Réseau
ga: Líonrú
ja: ネットワーク
ko: 네트워킹
pl: Sieć
ru: Сетевое взаимодействие
ta: நெட்வொர்க்கிங்
tr: Ağ oluşturma

source: Low-level TCP networking using :ref:`class_StreamPeer` and :ref:`class_TCPServer`.
cs: Nízkoúrovňové TCP síťování pomocí :ref:`class_StreamPeer` a :ref:`class_TCPServer`.
fr: Réseau TCP de bas niveau utilisant :ref:`class_StreamPeer` et :ref:`class_TCPServer`.
ga: Líonrú TCP íseal-leibhéal ag baint úsáide as :ref:'class_StreamPeer' agus :ref:'class_TCPServer'.
it: Rete TCP di basso livello attraverso :ref:`class_StreamPeer` e :ref:`class_TCPServer`.
ja: :ref:`class_StreamPeer` と :ref:`class_TCPServer` を使用した低レベル TCP ネットワーキング。
ko: :ref:`class_StreamPeer`\ 와 :ref:`class_TCPServer`\ 를 사용한 저수준 TCP 네트워킹.
ru: Низкоуровневое сетевое взаимодействие TCP с использованием :ref:`class_StreamPeer` и :ref:`class_TCPServer`.
ta: குறைந்த-நிலை TCP நெட்வொர்க்கிங் பயன்படுத்துதல்: ref: `class_streampeer` மற்றும்: ref:` class_tcpserver`.
tr: :ref:`class_StreamPeer` ve :ref:`class_TCPServer` kullanarak düşük seviyeli TCP ağı.

source: Low-level UDP networking using :ref:`class_PacketPeer` and :ref:`class_UDPServer`.
cs: Nízkoúrovňové UDP síťování pomocí :ref:`class_PacketPeer` a :ref:`class_UDPServer`.
fr: Réseau UDP de bas niveau utilisant :ref:`class_PacketPeer` et :ref:`class_UDPServer`.
ga: Líonrú UDP ar leibhéal íseal ag baint úsáide as :ref:'class_PacketPeer' agus :ref:'class_UDPServer'.
it: Rete UDP di basso livello attraverso :ref:`class_PacketPeer` e :ref:`class_UDPServer`.
ja: :ref:`class_PacketPeer` と :ref:`class_UDPServer` を使用した低レベル UDP ネットワーキング。
ko: :ref:`class_PacketPeer`\ 와 :ref:`class_UDPServer`\ 를 사용한 저수준 UDP 네트워킹.
ru: Низкоуровневое сетевое взаимодействие с помощью UDP с использованием :ref:`class_PacketPeer` и :ref:`class_UDPServer`.
ta: குறைந்த அளவிலான யுடிபி நெட்வொர்க்கிங் பயன்படுத்துதல்: ref: `class_packetpeer` மற்றும்: ref:` class_udpserver`.
tr: :ref:`class_PacketPeer` ve :ref:`class_UDPServer` kullanarak düşük seviyeli UDP ağı.

source: Low-level HTTP requests using :ref:`class_HTTPClient`.
cs: Nízkoúrovňové HTTP požadavky pomocí :ref:`class_HTTPClient`.
fr: Requêtes HTTP de bas niveau utilisant :ref:`class_HTTPClient`.
ga: Iarratais HTTP ar leibhéal íseal ag baint úsáide as :ref:'class_HTTPClient'.
it: Richieste HTTP di basso livello attraverso :ref:`class_HTTPClient`.
ja: :ref:`class_HTTPClient` を使用した低レベルの HTTP リクエスト。
ko: :ref:`class_HTTPClient`\ 를 사용한 저수준 HTTP 요청.
ru: Низкоуровневые HTTP-запросы с использованием :ref:`class_HTTPClient`.
ta: குறைந்த அளவிலான HTTP கோரிக்கைகள்: ref: `class_httpclient`.
tr: :ref:`class_HTTPClient` kullanarak düşük seviyeli HTTP istekleri.

source: High-level HTTP requests using :ref:`class_HTTPRequest`.
cs: Vysokoúrovňové HTTP požadavky pomocí :ref:`class_HTTPRequest`.
fr: Requêtes HTTP de haut niveau utilisant :ref:`class_HTTPRequest`.
ga: Iarratais HTTP ardleibhéil ag baint úsáide as :ref:'class_HTTPRequest'.
it: Richieste HTTP di alto livello attraverso :ref:`class_HTTPRequest`.
ja: :ref:`class_HTTPRequest` を使用した高レベルの HTTP リクエスト。
ko: :ref:`class_HTTPRequest`\ 를 사용한 고수준 HTTP 요청.
ru: Высокоуровневые HTTP-запросы с использованием :ref:`class_HTTPRequest`.
ta: பயன்படுத்தும் உயர் மட்ட HTTP கோரிக்கைகள்: Ref: `class_httprequest`.
tr: :ref:`class_HTTPRequest` kullanarak üst düzey HTTP istekleri.

source: Supports HTTPS out of the box using bundled certificates.
cs: Nativní podpora HTTPS pomocí přiložených certifikátů.
fr: Prend en charge HTTPS dès leur sortie des certificats groupés.
ga: Tacaíonn sé le HTTPS as an mbosca ag baint úsáide as deimhnithe cuachta.
it: Supporta l'HTTPS in modo immediato, utilizzando i certificati in bundle.
ja: バンドルされた証明書を使用して、すぐに使用できるHTTPSをサポートします。
ko: 번들된 인증서를 사용한 HTTPS 기본 지원.
pl: Obsługuje HTTPS bez dodatkowych konfiguracji z użyciem pakietowanych certyfikatów.
ru: Поддержка HTTPS прямо из коробки с использованием связанных сертификатов.
ta: தொகுக்கப்பட்ட சான்றிதழ்களைப் பயன்படுத்தி பெட்டியிலிருந்து HTTP களை ஆதரிக்கிறது.
tr: Paketlenmiş sertifikaları kullanarak, HTTPS'yi yerleşik olarak destekler.

source: :ref:`High-level multiplayer <doc_high_level_multiplayer>` API using UDP and ENet.
cs: :ref:`Vysokoúrovňové multiplayer API <doc_high_level_multiplayer>` pomocí UDP a ENet.
fr: :ref:`API multijoueur de haut niveau <doc_high_level_multiplayer>` utilisant UDP et ENet.
ga: :ref:`Il-imreoir ardleibhéil <doc_high_level_multiplayer>` API ag baint úsáide as UDP agus Enet.
it: :ref:`API multiplayer di alto livello <doc_high_level_multiplayer>` usando UDP e ENet.
ja: UDP および ENet を使う :ref:`高レベルのマルチプレイヤー<doc_high_level_multiplayer>` API。
ko: UDP와 ENet을 사용한 :ref:`High-level multiplayer <doc_high_level_multiplayer>`.
ru: :ref:`Высокоуровневый мультиплеерный <doc_high_level_multiplayer>` API использующий UDP и ENet.
ta: :ref:`High-level multiplayer <doc_high_level_multiplayer>` பநிஇ using UDP and ENet.
tr: UDP ve ENet kullanarak :ref:`üst düzey çok oyunculu <doc_high_level_multiplayer>` API .

source: Automatic replication using remote procedure calls (RPCs).
cs: Automatická replikace pomocí vzdáleného volání procedur (RPC).
fr: Réplication automatique au moyen des appels de procédure à distance (RPC).
ga: Macasamhlú uathoibríoch ag baint úsáide as glaonna nós imeachta iargúlta (RPCanna).
it: Replica automatica tramite chiamate di procedura remota (RPC).
ja: リモートプロシージャコール (RPC) を使用した自動レプリケーション。
ko: 원격 프로시저 호출(RPCs)을 사용한 자동 레플리케이션.
pl: Automatyczna replikacja z użyciem zdalnych wezwań proceduralnych (ang. RPC - Remote Procedure Calls).
ru: Автоматическая репликация с использованием удаленных вызовов процедур (RPC).
ta: தொலைநிலை செயல்முறை அழைப்புகள் (RPC கள்) பயன்படுத்தி தானியங்கி பிரதி.
tr: Uzak yöntem çağrılarını (RPC'ler) kullanarak otomatik çoğaltma.

source: Supports unreliable, reliable and ordered transfers.
cs: Podporuje nespolehlivé, spolehlivé a řazené přenosy.
fr: Prise en charge des transferts non fiables, sûrs et ordonnés (unreliable, reliable and ordered).
ga: Tacaíochtaí aistrithe neamhiontaofa, iontaofa agus ordaithe.
it: Supporta trasferimenti inaffidabili, affidabili e ordinati.
ja: 信頼性の低い転送も、信頼性が高く順番が保証された転送もサポートします。
ko: 신뢰/비신뢰/순차적 전송 지원.
pl: Obsługuje zawodne, niezawodne i zamówione transfery.
ru: Поддержка ненадёжных, надёжных и сортированных передач.
ta: நம்பமுடியாத, நம்பகமான மற்றும் கட்டளையிடப்பட்ட இடமாற்றங்களை ஆதரிக்கிறது.
tr: Güvenilmez, güvenilir ve düzenli aktarımları destekler.
