Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: List of features
cs: Seznam funkcí
fr: Liste des fonctionnalités
ga: Liosta gnéithe
it: Elenco delle funzionalità
ja: 機能一覧
ko: 기능 목록
pl: Lista funkcji
ru: Список функций
ta: அம்சங்களின் பட்டியல்
tr: Özellikler listesi

source: This page aims to list **all** features currently supported by Godot.
cs: Tato stránka si klade za cíl sepsat **všechny** funkce, které Godot v současné době podporuje.
fr: Cette page vise à lister **toutes** les fonctionnalités actuellement supportées par Godot.
ga: Tá sé mar aidhm ag an leathanach seo liosta a dhéanamh de na gnéithe **all** a dtacaíonn Godot leo faoi láthair.
it: Questa pagina punta a elencare **tutte** le funzionalità attualmente supportate da Godot.
ja: このページでは、Godotが現在サポートしているすべての機能をリストアップすることを目的としています。
ko: 이 페이지의 목표는 현재 Godot가 지원하는 **모든** 기능을 나열하는 것입니다.
pl: Ta strona ma na celu wyszczególnienie wszystkich funkcji aktualnie obsługiwanych przez Godot.
ru: На этой странице перечислены **все** функции, поддерживаемые Godot в настоящий момент.
ta: இந்த பக்கம் தற்போது கோடோட் ஆதரிக்கும் அனைத்து ** அம்சங்களையும் பட்டியலிடுவதை நோக்கமாகக் கொண்டுள்ளது.
tr: Bu sayfa, Godot tarafından şu anda desteklenen **tüm** özellikleri listelemeyi amaçlamaktadır.

source: This page lists features supported by the current stable version of Godot. Some of these features are not available in the `3.x release series <https://docs.godotengine.org/en/3.6/about/list_of_features.html>`__.
cs: Na této stránce jsou uvedeny funkce podporované aktuálně stabilní verzí Godotu. Některé funkce nemusí být ve `vydání LTS (3.x) <https://docs.godotengine.org/en/3.6/about/list_of_features.html>`__ k dispozici.
fr: Cette page liste les fonctionnalités supportées par la version stable actuelle de Godot. Certaines de ces fonctionnalités pourraient ne pas être disponibles dans la `série de version 3.x <https://docs.godotengine.org/en/3.6/about/list_of_features.html>`__.
it: Questa pagina elenca le funzionalità supportate dall'attuale versione stabile di Godot. Alcune di queste funzionalità potrebbero non essere disponibili nella `serie di versioni 3.x <https://docs.godotengine.org/en/3.6/about/list_of_features.html>`__.
ja: このページでは、Godot の現在の安定版でサポートされている機能の一覧を示します。これらの機能のいくつかは、 `バージョン 3.x <https://docs.godotengine.org/en/3.6/about/list_of_features.html>`__ では利用できません。
ko: 이 페이지는 현재 안정 버전 Godot가 지원하는 기능들을 나열하고 있습니다. 몇몇 기능은 `3.x 릴리스 시리즈 <https://docs.godotengine.org/en/3.6/about/list_of_features.html>`__\ 에서 작동하지 않을 수 있습니다.
pl: Ta strona zawiera listę funkcji wspieranych przez obecną stabilną wersję silnika Godot. Niektóre z tych funkcji mogą być niedostępne w `wydaniach 3.x <https://docs.godotengine.org/en/3.6/about/list_of_features.html>`__.
ru: Эта страница содержит список возможностей, которые поддерживаются стабильной версией Godot. Некоторые из этих функций могут быть недоступны в `серии релизов LTS (3.x) <https://docs.godotengine.org/ru/3.5/about/list_of_features.html>`__.
ta: இந்த பக்கம் கோடோட்டின் தற்போதைய நிலையான பதிப்பால் ஆதரிக்கப்படும் அம்சங்களை பட்டியலிடுகிறது. இந்த அம்சங்களில் சில `3.x வெளியீட்டுத் தொடரில் <https://docs.godotengine.org/en/3.6/about/list_of_features.html> __.

source: Platforms
cs: Platformy
fr: Plates-formes
ga: Ardáin
it: Piattaforme
ja: プラットフォーム
ko: 플랫폼
pl: Platformy
ru: Платформы
ta: தளங்கள்
tr: Platformlar

source: See :ref:`doc_system_requirements` for hardware and software version requirements.
cs: Informace o požadavcích na hardware a verzi softwaru naleznete v :ref:`doc_system_requirements`.
fr: Voir :ref:`doc_system_requirements` pour les prérequis de matériels et de version de logiciels.
ga: Féach :ref:'doc_system_requirements' le haghaidh riachtanais crua-earraí agus leagan bogearraí.
it: Vedasi :ref:`doc_system_requirements` per i requisiti hardware e software.
ja: ハードウェアおよびソフトウェアのバージョン要件に関する情報は、 :ref:`doc_system_requirements` を参照してください。
ko: 하드웨어 및 소프트웨어 버전 요구 사항은 :ref:`doc_system_requirements`\ 을 참고하세요.
pl: Zobacz sekcję :ref:`doc_system_requirements` aby zapoznać się z wymaganiami systemowymi oraz sprzętowymi.
ru: См. :ref:`doc_system_requirements`, чтобы узнать системные требования и версии необходимых для работы программы.
ta: காண்க: குறிப்பு: வன்பொருள் மற்றும் மென்பொருள் பதிப்பு தேவைகளுக்கு `doc_system_requirments`.
tr: Donanım ve yazılım sürüm gereksinimleri için, :ref:`doc_system_requirements` sayfasına bakınız.

source: **Can run both the editor and exported projects:**
cs: **Dokáží spustit jak editor, tak exportované projekty:**
fr: **Peut exécuter à la fois l'éditeur et les projets exportés :**
ga: **Is féidir leis an eagarthóir agus na tionscadail onnmhairithe araon a reáchtáil:**
it: **Può eseguire sia l'editor sia i progetti esportati:**
ja: **エディタとエクスポートしたプロジェクトの両方を実行可能:**
ko: **편집기와 내보낸 프로젝트를 모두 실행할 수 있는 플랫폼:**
pl: **Można uruchomić zarówno edytor jak i wyeksportowane projekty:**
ru: **Редактор и экспортированные проекты можно запустить на:**
ta: ** ஆசிரியர் மற்றும் ஏற்றுமதி செய்யப்பட்ட திட்டங்களை இயக்க முடியும்: **
tr: **Hem düzenleyici hem de dışa aktarılan projeleri çalıştırabilir:**

source: Windows (x86 and ARM, 64-bit and 32-bit).
cs: Windows (x86 a ARM, 64-bit a 32-bit).
fr: Windows (x86 et ARM, 64-bit et 32-bit).
it: Windows (x86 e ARM, 64-bit e 32-bit).
ja: Windows (x86, ARM, 64ビットと32ビット)。
ko: Windows (x86 및 ARM, 64비트 및 32비트).
pl: Windows (x86 oraz ARM, 64-bitowy i 32-bitowy).
ru: Windows (x86 и ARM, 64-bit и 32-bit).
ta: சாளரங்கள் (x86 மற்றும் கை, 64-பிட் மற்றும் 32-பிட்).

source: macOS (x86 and ARM, 64-bit only).
cs: macOS (x86 a ARM, pouze 64-bit).
fr: macOS (x86 et ARM, 64-bit uniquement).
ga: macOS (x86 agus ARM, 64-giotán amháin).
it: macOS (x86 e ARM, solo 64-bit).
ja: macOS (x86, ARM 64ビットのみ).
ko: macOS (x86 및 ARM, 64비트 전용).
pl: macOS (x86 oraz ARM, wyłącznie 64-bitowy).
ru: macOS (x86 и ARM, только 64-bit).
ta: MACOS (x86 மற்றும் கை, 64-பிட் மட்டும்).
tr: macOS (x86 ve ARM, sadece 64-bit).

source: Linux (x86 and ARM, 64-bit and 32-bit).
cs: Linux (x86 a ARM, 64-bit a 32-bit).
fr: Linux (x86 et ARM, 64-bit et 32-bit).
ga: Linux (x86 agus ARM, 64-giotán agus 32-giotán).
it: Linux (x86 e ARM, 64-bit e 32-bit).
ja: Linux (x86とARM, 64ビットと32ビット)。
ko: Linux (x86 및 ARM, 64비트 및 32비트).
pl: Linux (x86 oraz ARM 64-bitowy i 32-bitowy).
ru: Linux (x86 и ARM, 64-bit и 32-bit).
ta: லினக்ச் (x86 மற்றும் கை, 64-பிட் மற்றும் 32-பிட்).
tr: Linux (x86 ve ARM, 64-bit ve 32-bit).

source: Binaries are statically linked and can run on any distribution if compiled on an old enough base distribution.
cs: Binární soubory jsou staticky propojeny a lze je spustit na libovolné distribuci za podmínky, že byly zkompilovány na dostatečně staré základní distribuci.
fr: Les exécutables sont liés statiquement et peuvent fonctionner sur n'importe quelle distribution s'ils sont compilés sur une distribution suffisamment ancienne.
ga: Binaries nasctha statically agus is féidir a reáchtáil ar aon dáileadh má thiomsú ar dháileadh bonn d'aois go leor.
it: I file binari sono collegati in modo statico e possono essere eseguiti su qualsiasi distribuzione se compilati in una distribuzione base sufficientemente vecchia.
ja: 古い十分なベースのディストリビューションでコンパイルされた場合、バイナリは静的にリンクされ様々なディストリビューションで実行できます。
ko: 바이너리는 정적으로 연결되어 있어서 아주 오래된 기본 배포판에서 컴파일 된 경우라도 모든 배포판에서 실행할 수 있습니다.
pl: Pliki binarne są połączone statycznie i mogą działać w każdym rozkładzie, jeśli zostały skompilowane na wystarczająco starej dystrybucji bazowej.
ru: Двоичные файлы статически связаны и могут работать в любом дистрибутиве, если они скомпилированы в достаточно старом базовом дистрибутиве.
ta: பைனரிகள் நிலையான முறையில் இணைக்கப்பட்டுள்ளன, மேலும் பழைய அடிப்படை விநியோகத்தில் தொகுக்கப்பட்டால் எந்த விநியோகத்திலும் இயங்க முடியும்.
tr: İkili-tip dosyalar statik olarak bağlıdır, ve yeterince eski bir temel dağıtımda derlenirse herhangi bir dağıtımda çalışabilir.

source: Official binaries are compiled using the `Godot Engine buildroot <https://github.com/godotengine/buildroot>`__, allowing for binaries that work across common Linux distributions.
cs: Oficiální binární soubory jsou kompilovány pomocí `Godot Engine buildroot <https://github.com/godotengine/buildroot>`__, díky kterému mohou fungovat napříč běžnými linuxovými distribucemi.
fr: Les binaires officiels sont compilés en utilisant le `buildroot Godot Engine <https://github.com/godotengine/buildroot>`__, permettant aux binaires de fonctionner sur les distributions Linux courantes.
it: I binari ufficiali sono compilati utilizzando il `Godot Engine buildroot <https://github.com/godotengine/buildroot>`__, consentendo di ottenere binari che funzionano su tutte le distribuzioni Linux più comuni.
ja: 公式のバイナリは `Godot Engine buildroot <https://github.com/godotengine/buildroot>`__ を使用してコンパイルされます。これは一般的なLinuxディストリビューションで動作可能なバイナリです。
ko: 공식 바이너리는 `Godot 엔진 buildroot <https://github.com/godotengine/buildroot>`__\ 를 사용하여 컴파일되며 이를 통해 (LTS를 포함한) 일반적인 Linux 배포판에서 바이너리가 동작할 수 있게 됩니다.
pl: Oficjalne pliki binarne są skompilowane przy użyciu `Godot Engine buildroot <https://github.com/godotengine/buildroot>`__, pozwalając na działanie na powszechnych dystrybucjach Linuksa.
ru: Официальные двоичные файлы компилируются с использованием `Godot Engine buildroot <https://github.com/godotengine/buildroot>`__, что позволяет создавать двоичные файлы, работающие в распространенных дистрибутивах Linux.
ta: `கோடோட் என்சின் பில்ட்ரூட் <https://github.com/godotengine/buildroot> __ ஐப் பயன்படுத்தி உத்தியோகபூர்வ பைனரிகள் தொகுக்கப்படுகின்றன, இது பொதுவான லினக்ச் விநியோகங்களில் வேலை செய்யும் இருமங்களை அனுமதிக்கிறது.

source: Android (editor support is experimental).
cs: Android (podpora editoru je experimentální).
fr: Android (le support de l'éditeur est expérimental).
ga: Android (Tá tacaíocht eagarthóir turgnamhach).
it: Android (il supporto dell'editor è sperimentale).
ja: Android (エディターは実験的)。
ko: Android (편집기 지원은 실험적입니다).
pl: Android (obsługa edytora jest eksperymentalna).
ru: Android (поддержка редактора является экспериментальной).
ta: ஆண்ட்ராய்டு (எடிட்டர் உதவி சோதனை).
tr: Android (düzenleyici desteği deneyseldir).

source: :ref:`Web browsers <doc_using_the_web_editor>`. Experimental in 4.0, using Godot 3.x is recommended instead when targeting HTML5.
cs: :ref:`Webové prohlížeče <doc_using_the_web_editor>`. Ve verzi 4.0 je podpora experimentální. Pokud cílíte na HTML5, doporučujeme použít Godot 3.x.
fr: :ref:`Navigateurs internet <doc_using_the_web_editor>`. Expérimental en 4.0, l'utilisation de Godot 3.x est recommandée à la place quand HTML 5 est visé.
ga: :ref:`Brabhsálaithe Gréasáin <doc_using_the_web_editor>`. Go turgnamhach i 4.0, moltar úsáid a bhaint as Godot 3.x ina ionad sin agus tú ag díriú ar HTML5.
it: :ref:`Browser web <doc_using_the_web_editor>`. Sperimentale nella versione 4.0, si consiglia invece di usare Godot 3.x quando si vuole usare HTML5.
ja: :ref:`Webブラウザ <doc_using_the_web_editor>` 4.0では実験的です。HTML5をターゲットにする場合は、代わりにGodot 3.xを使うことが推奨されます。
ko: :ref:`웹 브라우저 <doc_using_the_web_editor>`. 4.0에서는 실험적이며, HTML5을 목표로 개발한다면 Godot 3.x 를 추천드립니다.
pl: :ref:` Przeglądarki internetowe <doc_using_the_web_editor>`. Eksperymentalne w wersji 4.0, zamiast tego zaleca się korzystanie z Godot 3.x, gdy celem jest HTML5.
ru: :ref:`Web браузеры <doc_using_the_web_editor>`. Экспериментальная поддержка в версии 4.0. Для HTML5 рекомендуется использовать Godot 3.x.
ta: : குறிப்பு: `வலை உலாவிகள் <doc_using_the_web_editor>`. 4.0 இல் சோதனை, HTML5 ஐ குறிவைக்கும் போது கோடோட் 3.x ஐப் பயன்படுத்துவதற்கு பதிலாக பரிந்துரைக்கப்படுகிறது.
tr: :ref:`Web tarayıcıları <doc_using_the_web_editor>`. 4.0'da deneysel, bu nedenle HTML5 için Godot 3.x kullanılması önerilir.

source: **Runs exported projects:**
cs: **Dokáží spustit exportované projekty:**
fr: **Exécute les projets exportés :**
ga: **Ritheann tionscadail onnmhairithe:**
it: **Esegue progetti esportati:**
ja: **エクスポートされたプロジェクトの実行:**
ko: **내보낸 프로젝트를 실행할 수 있는 플랫폼:**
pl: **Uruchamia wyeksportowane projekty:**
ru: **Запускает экспортированные проекты:**
ta: ** ஏற்றுமதி செய்யப்பட்ட திட்டங்களை இயக்குகிறது: **
tr: **Dışa aktarılan projeleri çalıştırır:**

source: :ref:`Consoles <doc_consoles>`.
cs: :ref:`Konzole <doc_consoles>`.
fr: :ref:`Consoles de jeux <doc_consoles>`.
ga: :ref:`Consóil <doc_consoles>`.
ja: :ref:`コンソール <doc_consoles>`\ 。
ko: :ref:`게임 콘솔 <doc_consoles>`.
pl: 1: :ref:`Konsole<doc_consoles>`.
ru: :ref:`Консоли <doc_consoles>`.
ta: : ref: `கன்சோல்கள் <doc_consoles>`.
tr: :ref:`Oyun Konsolları <doc_consoles>`.

source: Godot aims to be as platform-independent as possible and can be :ref:`ported to new platforms <doc_custom_platform_ports>` with relative ease.
cs: Godot si klade za cíl být co nejvíce platformně-nezávislý a je možné jej poměrně snadno :ref:`portovat na nové platformy <doc_custom_platform_ports>`.
fr: Godot vise à être aussi indépendant des plateformes que possible et peut être :ref:`porté sur de nouvelles plateformes <doc_custom_platform_ports>` avec une relative facilité.
ga: Tá sé mar aidhm ag Godot a bheith chomh neamhspleách agus is féidir maidir le hardáin agus is féidir é a :ref:`a aistriú chuig ardáin nua <doc_custom_platform_ports>` gan stró.
it: Godot punta a essere il più indipendente possibile dalla piattaforma e può essere :ref:`portato su nuove piattaforme <doc_custom_platform_ports>` con relativa facilità.
ja: Godotは可能な限りプラットフォームに依存しないことを目指しており、比較的簡単に :ref:`新しいプラットフォームに移植 <doc_custom_platform_ports>` することができます。
ko: Godot는 가능한 한 플랫폼 독립적이고 비교적 쉽게 :ref:`새로운 플랫폼으로 이식 <doc_custom_platform_ports>`\ 할 수 있는 것을 목표로 합니다.
pl: Godot ma na celu być jak najbardziej niezależny od platform i może być względnie prosto :ref:`przeniesiony na nowe platformy<doc_custom_platform_ports>`.
ru: Godot стремится быть максимально независимым от платформы и может быть :ref:`портирован на новые платформы <doc_custom_platform_ports>` относительно легко.
ta: கோடோட் முடிந்தவரை மேடையில்-சுயாதீனமாக இருப்பதை நோக்கமாகக் கொண்டுள்ளது: குறிப்பு: `புதிய தளங்களுக்கு அனுப்பப்பட்டது <doc_custom_platform_ports>` உறவினர் எளிதாக.
tr: Godot, mümkün olduğunca platformdan-bağımsız olmayı hedefliyor ve nispeten kolaylıkla :ref:`yeni platformlara aktarılabilir <doc_custom_platform_ports>`.

source: Projects written in C# using Godot 4 currently cannot be exported to the web platform. To use C# on that platform, consider Godot 3 instead. Android and iOS platform support is available as of Godot 4.2, but is experimental and :ref:`some limitations apply <doc_c_sharp_platforms>`.
cs: Projekty napsané v C# používající Godot 4 momentálně nelze na webové platformy exportovat. Chcete-li použít C# na webu, zvažte raději použití Godotu 3. Podpora platforem Android a iOS je od verze 4.2 dostupná, nicméně je stále experimentální a platí pro ně :ref:`určitá omezení <doc_c_sharp_platforms>`.
fr: Les projets écrits en C# utilisant Godot 4 ne peuvent à l'heure actuelle être exportés sur la plateforme web. Pour utiliser C# sur cette plateforme, préférez Godot 3. Le support des plateformes Android et iOS sont disponibles dans Godot 4.2 mais de manière expérimentale et :ref:`certaines limitations s'appliquent alors<doc_c_sharp_platforms>`.
ga: Ní féidir tionscadail atá scríofa in C# a úsáideann Godot 4 a easpórtáil chuig an ardán gréasáin faoi láthair. Chun C# a úsáid ar an ardán sin, smaoinigh ar Godot 3 ina ionad sin. Tá tacaíocht ardán Android agus iOS ar fáil ó Godot 4.2, ach tá sé turgnamhach agus :ref: `tá roinnt teorainneacha i bhfeidhm <doc_c_sharp_platforms>`.
it: I progetti scritti in C# usando Godot 4 non possono essere attualmente esportati per piattaforme web. Per usare C# su tali piattaforme, si consiglia l'uso di Godot 3. Il supporto per piattaforme Android e iOS è disponibile a partire da Godot 4.2, ma tale supporto è sperimentale e :ref:`si applicano limitazioni <doc_c_sharp_platforms>`.
ja: Godot 4 を使用して書かれた C# のプロジェクトは、Web プラットフォームにエクスポートできません。 WebプラットフォームでC#を使用するには、代わりにGodot 3の使用を検討してください。 Android および iOS プラットフォームのサポートは、Godot 4.2 で利用できますが実験的であり、 :ref:`some limitations apply <doc_c_sharp_platforms>` が適用されます。
ko: Godot 4에서 C#으로 작성된 프로젝트는 현재 웹으로 내보낼 수 없습니다. 해당 플랫폼에서 C#을 사용하시려면 Godot 3를 사용하는 것을 추천드립니다. Android와 iOS 플랫폼은 Godot 4.2에서 내보낼 수 있지만, 이는 실험적이며 :ref:`일부 제한이 적용 <doc_c_sharp_platforms>`\ 될 수 있습니다.
pl: Projekty napisane w C# używające Godot 4 obecnie nie mogą być eksportowane do platformy web. Aby użyć C# dla tej platformy, rozważ Godot 3 w zamian. Wsparcie dla Platformy Android i iOS jest dostępne od wersji Godot 4.2, ale jest eksperymentalna and :ref:<some limitations apply<doc_c_sharp_platforms>`.
ru: На данный момент проекты Godot 4, использующие C# в качестве языка скриптов, не могут быть экспортированы на Web платформу. Для использования C# там, пожалуйста, используйте Godot 3. Платформы Android и iOS доступны, начиная с Godot 4.2, но в экспериментальном формате и :ref:`с ограничениями <doc_c_sharp_platforms>`.
ta: கோடோட் 4 ஐப் பயன்படுத்தி சி# இல் எழுதப்பட்ட திட்டங்களை தற்போது வலை தளத்திற்கு ஏற்றுமதி செய்ய முடியாது. அந்த மேடையில் சி# ஐப் பயன்படுத்த, அதற்கு பதிலாக கோடோட் 3 ஐக் கவனியுங்கள். அண்ட்ராய்டு மற்றும் ஐஇமு இயங்குதள உதவி கோடோட் 4.2 இன் படி கிடைக்கிறது, ஆனால் இது சோதனை மற்றும்: ref: `சில வரம்புகள் <ock_c_sharp_platforms>` பொருந்தும்.
tr: C# ile yazılmış Godot 4 projeleri, şimdilik web platformu için dışa aktarılamaz. Bu platformda C# kullanmak için Godot 3'ü düşünün. Android ve iOS platformları desteği Godot 4.2'de bulunur, ancak bu destek deneyseldir ve :ref:`bazı kısıtlamalar bulunur <doc_c_sharp_platforms>`.

source: Editor
fr: Éditeur
ga: Eagarthóir
ja: エディタ
ko: 편집기
pl: Edytor
ru: Редактор
ta: திருத்தி
tr: Düzenleyici

source: **Features:**
cs: **Funkce:**
fr: **Fonctionnalités :**
ga: **Gnéithe:**
it: **Funzionalità:**
ja: **機能:**
ko: **기능:**
pl: **Funkcje**
ru: **Возможности:**
ta: ** அம்சங்கள்: **
tr: **Özellikler:**

source: Scene tree editor.
cs: Editor stromu scén.
fr: Éditeur de scène hiérarchique.
ga: Eagarthóir crann radhairc.
it: Editor dell'albero delle scene.
ja: シーンツリー エディタ。
ko: 씬 트리 편집기.
pl: Edytor edytor hierarchii węzłów.
ru: Редактор дерева сцены.
ta: காட்சி மரம் ஆசிரியர்.
tr: Sahne ağacı düzenleyici.

source: Built-in script editor.
cs: Vestavěný editor skriptů.
fr: Éditeur de script intégré.
ga: Eagarthóir scripte tógtha.
it: Editor di script integrato.
ja: 内蔵スクリプトエディタ。
ko: 내장 스크립트 편집기.
pl: Wbudowany edytor skryptów.
ru: Встроенный редактор скриптов.
ta: உள்ளமைக்கப்பட்ட ச்கிரிப்ட் எடிட்டர்.
tr: Yerleşik betik düzenleyici.

source: Support for :ref:`external script editors <doc_external_editor>` such as Visual Studio Code or Vim.
cs: Podpora pro :ref:`externí editory skriptů <doc_external_editor>` , jako například Visual Studio Code nebo Vim.
fr: Support des :ref:`éditeurs de script externes <doc_external_editor>` tels que Visual Studio Code ou Vim.
ga: Tacaíocht do :ref:`eagarthóirí scripte seachtracha <doc_external_editor>` ar nós Visual Studio Code nó Vim.
it: Supporto per :ref:`external script editors <doc_external_editor>` come Visual Studio Code o Vim.
ja: Visual Studio Code や Vim などの\ :ref:`外部スクリプトエディタ <doc_external_editor>`\ に対応。
ko: Visual Studio Code나 Vim과 같은 :ref:`외부 스크립트 편집기 <doc_external_editor>` 지원.
pl: Wsparcie dla :ref:`zewnętrznych edytorów kodu <doc_external_editor>` takich jak Visual Studio Code lub Vim.
ru: Поддержка :ref:`внешних редакторов скриптов <doc_external_editor>`, таких, как Visual Studio Code или Vim.
ta: இதற்கான ஆதரவு: குறிப்பு: `வெளிப்புற ச்கிரிப்ட் ஆசிரியர்கள் <doc_external_editor>` விசுவல் ச்டுடியோ குறியீடு அல்லது விம் போன்றவை.
tr: Visual Studio Code veya Vim gibi, :ref:`harici betik düzenleyicileri <doc_external_editor>` desteği.

source: GDScript :ref:`debugger <doc_debugger_panel>`.
cs: :ref:`Ladicí program <doc_debugger_panel>` pro GDScript.
fr: :ref:`Débogueur <doc_debugger_panel>` GDScript.
ja: GDScript\ :ref:`デバッガー <doc_debugger_panel>`\ 。
ko: GDScript :ref:`디버거 <doc_debugger_panel>`.
pl: :ref:`Debuger <doc_debugger_panel>` GDScript.
ru: GDScript :ref:`отладчик <doc_debugger_panel>`.
ta: Gdscript: ref: `பிழைத்திருத்தம் <doc_debugger_panel>`.
tr: GDScript :ref:`hata ayıklayıcısı<doc_debugger_panel>`.

source: Support for debugging in threads is available since 4.2.
cs: Od verze 4.2 je dostupná podpora ladění ve vláknech.
fr: Le traitement du débogage des tâches concurrentes est disponible depuis la version 4.2.
ga: Tá tacaíocht do debugging i snáitheanna ar fáil ó 4.2.
it: Il supporto per il debugging nei thread è disponibile dalla versione 4.2.
ja: スレッドでのデバッグのサポートは4.2から利用できます。
ko: 스레드 디버깅은 4.2부터 지원됩니다.
pl: Wsparcie dla debugowania w wątkach jest dostępne od wersji 4.2.
ru: Поддержка отладки в потоках доступна с версии 4.2.
ta: நூல்களில் பிழைத்திருத்தத்திற்கான உதவி 4.2 முதல் கிடைக்கிறது.
tr: İş parçacıklarında hata ayıklama desteği 4.2'den itibaren mevcuttur.

source: Visual profiler with CPU and GPU time indications for each step of the rendering pipeline.
cs: Vizuální profiler s indikací časů CPU a GPU pro každý krok vykreslování.
fr: Profileur visuel avec indications du temps CPU et GPU pour chaque étape du pipeline de rendu.
ga: Próifíleoir amhairc le tásca ama LAP agus GPU do gach céim den phíblíne rindreáil.
it: Profilatore grafico dell'utilizzo di CPU e GPU con indicazione temporizzata per ogni step della pipeline di rendering.
ja: レンダリングパイプラインの各ステップのCPUとGPUの時間を示すビジュアルプロファイラー。
ko: 렌더링 파이프라인의 각 단계에 대한 CPU 및 GPU 시간 표시를 포함하는 시각적 프로파일러.
pl: Wizualny profiler ze wskazaniami czasu CPU i GPU dla każdego etapu potoku renderowania.
ru: Профайлер с визуализацией времени CPU и GPU для каждого шага в процессе отрисовки.
ta: சிபியு மற்றும் சி.பீ.யு நேர அறிகுறிகளுடன் காட்சி விவரக்குறிப்பு வழங்குதல் குழாயின் ஒவ்வொரு அடியுக்கும் அறிகுறிகள்.
tr: İşleme akış hattının her bir adımı için CPU ve GPU zaman işaretleri veren görsel profil çıkarıcı.

source: Performance monitoring tools, including :ref:`custom performance monitors <doc_custom_performance_monitors>`.
cs: Nástroje pro sledování výkonu, včetně :ref:`vlastních monitorů výkonu <doc_custom_performance_monitors>`.
fr: Outils de surveillance des performances, incluant des :ref:`moniteurs de performances personnalisés <doc_custom_performance_monitors>`.
ga: Uirlisí monatóireachta feidhmíochta, lena n-áirítear :ref:`monitors feidhmíochta saincheaptha <doc_custom_performance_monitors>`.
it: Strumenti per il monitoraggio delle prestazioni, incluso il :ref:`monitoraggio personalizzato di esse <doc_custom_performance_monitors>`.
ja: :ref:`カスタムパフォーマンスモニター <doc_custom_performance_monitors>` を含むパフォーマンスモニターツール。
ko: :ref:`사용자 지정 퍼포먼스 모니터 <doc_custom_performance_monitors>`\ 를 포함한 퍼포먼스 모니터링 도구.
pl: Narzędzia do monitorowania wydajności, w tym :ref:`custom performance monitors <doc_custom_performance_monitors>`.
ru: Инструменты для мониторинга производительности, включая :ref:`кастомизируемые мониторы производительности <doc_custom_performance_monitors>`.
ta: செயல்திறன் கண்காணிப்பு கருவிகள் உட்பட: குறிப்பு: `தனிப்பயன் செயல்திறன் கண்காணிப்பாளர்கள் <doc_custom_performance_monitors>`.
tr: Performans izleme araçları, :ref:`özel performans izleyicileri <doc_custom_performance_monitors>` dahil.

source: Live script reloading.
cs: Opětovné načítání skriptů za běhu.
fr: Rechargement de script en direct.
ga: Athluchtú scripte beo.
it: Ricaricamento dello script in tempo reale.
ja: 実行時スクリプト再読み込み。
ko: 실시간 스크립트 리로딩.
pl: Zmiana skryptu podczas działania programu.
ru: Перезагрузка скриптов в режиме реального времени.
ta: நேரடி ச்கிரிப்ட் மறுஏற்றம்.
tr: Canlı betik yeniden yüklemesi.

source: Live scene editing.
cs: Upravování scén za běhu.
fr: Édition de scènes en direct.
ga: Eagarthóireacht radharc beo.
it: Modifica della scena in tempo reale.
ja: 実行時シーン編集。
ko: 실시간 씬 편집.
pl: Edycja scen podczas działania programu.
ru: Редактирование сцен в режиме реального времени.
ta: நேரடி காட்சி திருத்துதல்.
tr: Canlı sahne düzenlemesi.
