Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: Support for :ref:`Android based headsets <doc_deploying_to_android>` using OpenXR through a plugin.
tr: Bir eklenti aracılığıyla OpenXR kullanan :ref:`Android tabanlı başlıklar <doc_deploying_to_android>` için destek.

source: Out of the box limited support for visionOS Apple headsets.
it: Supporto pronto all'uso i visori Apple visionOS.

source: Currently only exporting an application for use on a flat plane within the headset is supported. Immersive experiences are not supported.
it: Al momento è supportata solo l'esportazione di un'applicazione per l'utilizzo su una superficie piana nel visore. Le esperienze immersive non sono supportate.

source: The editor can :ref:`detect features used in a project and create a compilation profile <doc_engine_compilation_configuration_editor>`, which can be used to create smaller export template binaries with unneeded features disabled.
it: L'editor può :ref:`rilevare le funzionalità utilizzate in un progetto e creare un profilo di compilazione <doc_engine_compilation_configuration_editor>`, che può essere utilizzato per creare binari più piccoli per i modelli di esportazione, con le funzionalità non necessarie disabilitate.

source: Most built-in modules can be disabled at compile-time to reduce binary size in custom builds. See :ref:`doc_optimizing_for_size` for details.
it: La maggior parte dei moduli integrati si possono disabilitare in fase di compilazione per ridurre la dimensione dell'eseguibile nelle compilazioni personalizzate. Consultare :ref:`doc_optimizing_for_size` per ulteriori dettagli.

source: Open development process with `contributions welcome <https://contributing.godotengine.org/en/latest/organization/how_to_contribute.html>`__.
it: Processo di sviluppo aperto con `contribuzioni benvenute <https://contributing.godotengine.org/en/latest/organization/how_to_contribute.html>`__.
