Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: :ref:`Movie Maker mode <doc_creating_movies>` to record videos from a running project with synchronized audio and perfect frame pacing.
cs: :ref:`Režim Tvorby filmů <doc_creating_movies>` pro nahrávání videí z běžícího projektu se synchonizovaným zvukem a při stabilní rychlosti snímků.
fr: :ref:`Le Mode Création de Film <doc_creating_movies>` pour enregistrer des vidéos à partir d'un projet en cours d'exécution avec un son synchronisé et un rythme d'image parfait.
ga: :ref:`Modh Déantóir Scannán <doc_creating_movies>` chun físeáin ó thionscadal atá ar siúl a thaifeadadh le fuaim sioncronaithe agus luascadh fráma foirfe.
it: :ref:`Modalità Movie Maker <doc_creating_movies>` per registrare video da un progetto in esecuzione con audio sincronizzato e perfetta cadenza dei fotogrammi.
ja: :ref:`動画作成モード <doc_creating_movies>` を使用して、実行中のプロジェクトから同期された音声と完璧なフレームペーシングでビデオを録画します。
ko: :ref:`Movie Maker mode <doc_creating_movies>` 를 사용하여 실행 중인 프로젝트에서 동기화된 오디오와 완벽한 프레임 페이싱으로 비디오를 녹화할 수 있습니다.
ru: :ref:`Режим Movie Maker <doc_creating_movies>` для записи видео из запущенного проекта с синхронизированным звуком и идеальной чередованием кадров.
ta: :ref:`Movie Maker பயன்முறை <doc_creating_movies>` பெறுநர் record videos இருந்து a running திட்டம் with synchronized audio and perfect frame pacing.
tr: Senkronize ses ve mükemmel kare hızıyla çalışan bir projeden video kaydetmek için :ref:`Movie Maker modu<doc_creating_movies>`.

source: :ref:`Low-level access to servers <doc_using_servers>` which allows bypassing the scene tree's overhead when needed.
cs: :ref:`Nízkoúrovňový přístup k serverům <doc_using_servers>`, který v případě potřeby umožňuje obejít režii stromu scény.
fr: :ref:`Accès de bas niveau aux serveurs <doc_using_servers>` ce qui permet de contourner la surcharge de l'arbre de scène lorsque cela est nécessaire.
ga: :ref:`Rochtain íseal-leibhéil ar fhreastalaithe <doc_using_servers>` a cheadaíonn lastuas an chrainn radhairc a sheachaint nuair is gá.
it: :ref:`Accesso di basso livello ai server <doc_using_servers>` che permette di bypassare l'overhead dell'albero della scena quando necessario.
ja: :ref:`サーバーへの低レベルのアクセス 。 <doc_using_servers>` これにより、必要に応じてシーンツリーのオーバーヘッドを回避することができます。
ko: 필요할 때 씬 트리의 오버헤드를 무시할 수 있는 :ref:`서버에 대한 낮은 수준의 접근 <doc_using_servers>`.
ru: :ref:`Низкоуровневый доступ к серверам <doc_using_servers>`, который позволяет, при необходимости, обойти накладные расходы дерева сцены.
ta: :ref:`Low-level access பெறுநர் சேவையகங்கள் <doc_using_servers>` which allows bypassing the scene tree's மேற்செலவு when needed.
tr: Gerektiğinde sahne ağacının ek yükünü es geçmeye izin veren :ref:`sunuculara düşük-seviye erişim <doc_using_servers>`.

source: :ref:`Command line interface <doc_command_line_tutorial>` for automation.
cs: :ref:`Rozhraní příkazového řádku <doc_command_line_tutorial>` pro automatizaci.
fr: :ref:`Tutoriel sur la ligne de commande <doc_command_line_tutorial>` pour l'automatisation.
ga: :ref:`Comhéadan líne ordaithe <doc_command_line_tutorial>` le haghaidh uathoibriú.
it: :ref:`Interfaccia della riga di comando <doc_command_line_tutorial>` per l'automazione.
ja: :ref:`Command line interface <doc_command_line_tutorial>` 自動化のためのコマンドラインインターフェイス。
ko: 자동화를 위한 :ref:`명령줄 인터페이스 <doc_command_line_tutorial>` .
ru: :ref:`Интерфейс командной строки <doc_command_line_tutorial>` для автоматизации.
ta: :ref:`Command வரி இடைமுகம் <doc_command_line_tutorial>` க்கு automation.
tr: Otomasyon için :ref:`komut satırı arayüzü <doc_command_line_tutorial>` .

source: Export and deploy projects using continuous integration platforms.
cs: Export a nasazení projektů s pomocí platforem pro kontinuální integraci.
fr: Exportez et déployez des projets en utilisant des plateformes d'intégration continue.
ga: Tionscadail a onnmhairiú agus a imscaradh ag baint úsáide as ardáin chomhtháthaithe leanúnacha.
it: Esporta e distribuisci progetti utilizzando piattaforme di integrazione continua.
ja: 継続的インテグレーション (CI) のプラットフォームを利用したプロジェクトのエクスポートとデプロイ。
ko: 지속적인 통합 플랫폼을 사용해 프로젝트를 내보내고 배포합니다.
pl: Wyeksportuj i postaw projekty używając ciągłych platform integracyjnych.
ru: Экспорт и развёртывание проектов с использованием платформ непрерывной интеграции.
ta: தொடர்ச்சியான ஒருங்கிணைப்பு தளங்களைப் பயன்படுத்தி திட்டங்களை ஏற்றுமதி செய்து வரிசைப்படுத்துங்கள்.
tr: Sürekli bütünleşme (CI) platformlarını kullanarak projeleri dışa aktarın ve yayınlayın.

source: `Shell completion scripts <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ are available for Bash, zsh and fish.
cs: `Skripty pro dokončování v shellu <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ jsou k dispozici pro Bash, zsh a fish.
fr: `Des scripts de complétion <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ sont disponibles pour Bash, zsh et fish.
ga: `Tá scripteanna críochnaithe bhlaosc <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ ar fáil do Bash, zsh agus iasc.
it: `Gli script di completamento shell <https://github.com/godotengine/godot/tree/master/misc/dist/shell>` __ sono disponibili per Bash, zsh e fish.
ja: `シェル補完スクリプト <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ は、Bash、zsh、fish で利用可能。
ko: `명령줄 자동완성 스크립트 <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__\ 는 Bash, zsh 그리고 fish에서 사용할 수 있습니다.
ru: `Скрипты автозаполнения терминала <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ доступны для Bash, zsh и fish.
ta: `செல் நிறைவு ச்கிரிப்ட்கள் <https://github.com/godotengine/godot/tree/master/misc/dist/shell> __ பாச், சட் மற்றும் மீன்களுக்கு கிடைக்கிறது.
tr: `Kabuk tamamlayıcı betikleri <https://github.com/godotengine/godot/tree/master/misc/dist/shell>`__ , Bash, zsh ve fish için mevcuttur.

source: Print colored text to standard output on all platforms using :ref:`print_rich <class_@GlobalScope_method_print_rich>`.
cs: Barevný výpis textu na standardní výstup pro všechny platformy za pomoci :ref:`print_rich <class_@GlobalScope_method_print_rich>`.
fr: Affichez du texte en couleur sur la sortie standard sur toutes les plates-formes en utilisant :ref:`print_rich <class_@GlobalScope_method_print_rich>`.
ga: Priontáil téacs daite go dtí an t-aschur caighdeánach ar gach ardán ag úsáid :ref:`print_rich <class_@GlobalScope_method_print_rich>`.
it: Stampa testo colorato sull'output standard su tutte le piattaforme tramite :ref:`print_rich <class_@GlobalScope_method_print_rich>`.
ja: すべてのプラットフォームで :ref:`print_rich <class_@GlobalScope_method_print_rich>` を使用して標準出力にカラーテキストを出力可能。
ko: 모든 플랫폼에서 :ref:`print_rich <class_@GlobalScope_method_print_rich>` 를 사용하여 표준 출력에 컬러 텍스트를 출력할 수 있습니다.
ru: Выведите цветной текст на стандартный вывод на всех платформах, используя :ref:`print_rich <class_@GlobalScope_method_print_rich>`.
ta: எல்லா தளங்களிலும் நிலையான வெளியீட்டிற்கு வண்ண உரையை அச்சிடுக: குறிப்பு: `print_rich <class_@globalscope_method_print_rich>`.
tr: :ref:`print_rich <class_@GlobalScope_method_print_rich>` kullanarak tüm platformlarda standart çıktıya renkli metin yazdırın.

source: Support for :ref:`C++ modules <doc_custom_modules_in_cpp>` statically linked into the engine binary.
cs: Podpora pro :ref:`C ++ moduly <doc_custom_modules_in_cpp>` staticky spojená s binárním souborem enginu.
fr: Prise en charge des :ref:`modules C++ <doc_custom_modules_in_cpp>` liés statiquement dans le binaire du moteur.
ga: Tacaíocht do :ref:`C++ modúil <doc_custom_modules_in_cpp>` nasctha go statach le dénártha an innill.
it: Supporto per :ref:`moduli C++ <doc_custom_modules_in_cpp>` staticamente collegati nel binario del motore.
ja: エンジンのバイナリに静的リンクされた :ref:`C++ モジュール <doc_custom_modules_in_cpp>` に対応。
ko: 엔진 바이너리와 정적으로 연결된 :ref:`C++ modules <doc_custom_modules_in_cpp>` 지원.
ru: Поддержка :ref:`C++ модулей <doc_custom_modules_in_cpp>`, статически связанных с двоичным файлом движка.
ta: இதற்கான ஆதரவு: குறிப்பு: `சி ++ தொகுதிகள் <doc_custom_modules_in_cpp>` இன்சின் பைனரியில் நிலையான முறையில் இணைக்கப்பட்டுள்ளது.
tr: Motor ikili-tip dosyasına statik olarak bağlanmış :ref:`C++ modülleri <doc_custom_modules_in_cpp>` desteği.

source: Engine and editor written in C++17.
cs: Engine a editor napsané v C++17.
fr: Moteur et éditeur écrit en C++17.
ga: Inneall agus eagarthóir scríofa i C ++17.
it: Motore ed editor scritti in C++17.
ja: C++17 で書かれたエンジンとエディタ。
ko: C++17로 작성된 엔진과 편집기.
ru: Движок и редактор написаны на C++17.
ta: சி ++ 17 இல் எழுதப்பட்ட இயந்திரம் மற்றும் எடிட்டர்.
tr: C++17 ile yazılmış motor ve düzenleyici.

source: Can be :ref:`compiled <doc_introduction_to_the_buildsystem>` using GCC, Clang and MSVC. MinGW is also supported.
cs: Lze :ref:`zkompilovat <doc_introduction_to_the_buildsystem>` pomocí GCC, Clang a MSVC. Podporováno je také MinGW.
fr: Peut être :ref:`compilé <doc_introduction_to_the_buildsystem>` en utilisant GCC, Clang and MSVC. MinGW est également pris en charge.
ga: Is féidir :tag:`a thiomsú <doc_introduction_to_the_buildsystem>` ag baint úsáide as GCC, Clang agus MSVC. Tugtar tacaíocht do MinGW freisin.
it: Può essere :ref:`compilato <doc_introduction_to_the_buildsystem>` utilizzando GCC, Clang e MSVC. È supportato anche MinGW.
ja: GCC、Clang および MSVC を使用して\ :ref:`コンパイル <doc_introduction_to_the_buildsystem>`\ 可能。MinGW にも対応。
ko: GCC, Clang과 MSVC를 사용해 :ref:`컴파일 <doc_introduction_to_the_buildsystem>`\ 될 수 있습니다. MinGW 또한 지원됩니다.
ru: Может быть :ref:`скомпилирован <doc_introduction_to_the_buildsystem>` с использованием GCC, Clang и MSVC. Также поддерживается MinGW.
ta: இருக்க முடியும்: ref: `தொகுக்கப்பட்ட <doc_introduction_to_the_buildsystem>` GCC, CLANG மற்றும் MSVC ஐப் பயன்படுத்துதல். MINGW யும் ஆதரிக்கப்படுகிறது.
tr: GCC, Clang ve MSVC kullanılarak :ref:`derlenebilir <doc_introduction_to_the_buildsystem>`. Ayrıca MinGW de desteklenir.

source: Friendly towards packagers. In most cases, system libraries can be used instead of the ones provided by Godot. The build system doesn't download anything. Builds can be fully reproducible.
cs: Přátelský k balíčkovačům. Ve většině případů lze místo knihoven poskytovaných Godotem použít systémové knihovny. Systém pro sestavení nic nestahuje. Sestavení mohou být plně reprodukovatelná.
fr: Respectueux des packagers. Dans la plupart des cas, les bibliothèques système peuvent être utilisées à la place de celles fournies par Godot. Le système de compilation ne télécharge rien. Les compilations peuvent être entièrement reproductibles.
ga: Cairdiúil i dtreo packagers. I bhformhór na gcásanna, is féidir leabharlanna córais a úsáid in ionad na cinn a sholáthraíonn Godot. Ní íoslódálann an córas tógála rud ar bith. Is féidir le tógálacha a bheith in-atáirgthe go hiomlán.
it: Amichevole nei confronti dei confezionatori. Nella maggior parte dei casi, è possibile utilizzare le librerie di sistema al posto di quelle fornite da Godot. Il sistema di compilazione non scarica nulla. Le compilazioni possono essere completamente riproducibili.
ja: パッケージャーにフレンドリー。ほとんどの場合、Godot が提供するライブラリではなく、システムライブラリを使用することができます。ビルドシステムは何もダウンロードしません。ビルドは完璧な再現性があります。
ko: 패키저(packagers) 친화적입니다. 대부분의 경우 시스템 라이브러리를 Godot가 제공하는 라이브러리 대신 사용할 수 있습니다. 빌드 시스템은 아무것도 다운로드하지 않습니다. 빌드는 완전히 재현할 수 있습니다.
ru: Дружелюбно относится к упаковщикам. В большинстве случаев можно использовать системные библиотеки вместо тех, которые предоставляет Godot. Система сборки ничего не загружает. Сборки могут быть полностью воспроизводимыми.
ta: பேக்கேசர்களை நோக்கி நட்பு. பெரும்பாலான சந்தர்ப்பங்களில், கோடோட் வழங்கியவற்றுக்கு பதிலாக கணினி நூலகங்கள் பயன்படுத்தப்படலாம். உருவாக்க அமைப்பு எதையும் பதிவிறக்கம் செய்யாது. கட்டடங்கள் முழுமையாக இனப்பெருக்கம் செய்யக்கூடியதாக இருக்கும்.
tr: Paketleyicilere dost. Çoğu durumda, Godot tarafından sağlananlar yerine sistem kitaplıkları kullanılabilir. Derleme sistemi hiçbir şey indirmez. Derlemeler tamamen yeniden üretilebilir.

source: Licensed under the permissive MIT license.
cs: Licencováno pod permisivní licencí MIT.
fr: Licencié sous la licence permissive MIT.
ga: Ceadúnaithe faoin gceadúnas MIT ceadaitheach.
it: Concesso sotto la licenza permissiva MIT.
ja: ライセンスは、寛容な MIT ライセンスです。
ko: 라이선스는 MIT 라이선스입니다.
pl: Licencjonowane na swobodnej licencji MIT.
ru: Имеет лицензию MIT.
ta: அனுமதிக்கப்பட்ட எம்ஐடி உரிமத்தின் கீழ் உரிமம் பெற்றது.
tr: Hoşgörülü MIT lisansı altında lisanslanmıştır.

source: Open development process with :ref:`contributions welcome <doc_ways_to_contribute>`.
cs: Otevřený vývojový proces, ve kterém jsou :ref:`vítány příspěvky <doc_ways_to_contribute>`.
fr: Processus de développement ouvert avec des :ref:`contributions bienvenues <doc_ways_to_contribute>`.
ga: Próiseas forbartha oscailte le :ref:`fáilte roimh ranníocaíochtaí <doc_ways_to_contribute>`.
ja: オープンな開発プロセスで、 :ref:`あらゆる貢献を歓迎します <doc_ways_to_contribute>`\ 。
ru: Открытый процесс разработки с помощью :ref:`вкладов приветствуется <doc_ways_to_contribute>`.
ta: இதனுடன் திறந்த மேம்பாட்டு செயல்முறை: ref: `பங்களிப்புகள் வரவேற்கின்றன <doc_ways_to_contribute>`.
tr: :ref:`Katkılarınızın hoş karşılandığı <doc_ways_to_contribute>` açık geliştirme süreci.

source: The `Godot proposals repository <https://github.com/godotengine/godot-proposals>`__ lists features that have been requested by the community and may be implemented in future Godot releases.
cs: Úložiště `návrhů pro Godot <https://github.com/godotengine/godot-proposals>`__ obsahuje seznam funkcí, které byly poptány komunitou a mohou být implementovány v budoucích verzích Godotu.
fr: Le `dépôt de propositions Godot <https://github.com/godotengine/godot-proposals>`__ liste les fonctionnalités qui ont été demandées par la communauté et qui pourraient être implémentées dans les futures versions de Godot.
ga: Liostaítear i stór moltaí Godot <https://github.com/godotengine/godot-proposals>`__ gnéithe a d'iarr an pobal agus a d'fhéadfaí a chur i bhfeidhm in eisiúintí Godot amach anseo.
it: Il `repository delle proposte di Godot <https://github.com/godotengine/godot-proposals>`__ elenca le caratteristiche che sono state richieste dalla comunità e che potrebbero essere implementate nelle future versioni di Godot.
ja: `Godot proposals repository <https://github.com/godotengine/godot-proposals>`__ には、コミュニティから求められている今後の Godot リリースで実装される可能性のある機能が掲載されています。
ko: `Godot 제안 저장소 <https://github.com/godotengine/godot-proposals>`__\ 에는 커뮤니티가 요청한 기능과 향후 Godot 릴리스에서 구현될 수 있는 기능 목록이 있습니다.
ru: В `репозитории предложений Godot <https://github.com/godotengine/godot-proposals>`__ перечислены функции, которые были запрошены сообществом и могут быть реализованы в будущих выпусках Godot.
ta: `கோடோட் முன்மொழிவு களஞ்சியம் <https://github.com/godotengine/godoteng-proposals>` __ சமூகத்தால் கோரப்பட்ட அம்சங்களை பட்டியலிடுகிறது மற்றும் எதிர்கால கோடோட் வெளியீடுகளில் செயல்படுத்தப்படலாம்.
tr: `Godot öneriler deposu <https://github.com/godotengine/godot-proposals>`__ , topluluk tarafından istekte bulunulan ve Godot'nun gelecekteki sürümlerinde uyarlanması olası özellikleri listeler.

source: Tonemapping (Linear, Reinhard, Filmic, ACES).
cs: Tonemapování (lineární, Reinhard, Filmic, ACES).
ga: Tonemapping (Líneach, Reinhard, Filmic, ACES).
ja: トーンマッピング (Linear、Reinhard、Filmic、ACES)。
pl: Mapowanie tonów (liniowe, Reinharda, filmowe, ACES).
ta: டோன்மாப்பிங் (லீனியர், ரெய்ன்ஆர்ட், ஃபிலிமிக், ஏசச்).
tr: Ton haritalaması (Doğrusal, Reinhard, Filmic, ACES).

source: iOS.
ta: ஐஇமு.

source: Ogg Vorbis.
ta: ஓக் வோர்பிச்.

source: MP3.
ta: பின்தொடர்.

source: Linux supports rv64 (RISC-V), ppc64 & ppc32 (PowerPC), and loongarch64. However you must compile the editor for that platform (as well as export templates) yourself, no official downloads are currently provided. RISC-V compiling instructions can be found on the :ref:`doc_compiling_for_linuxbsd` page.
it: Linux supporta rv64 (RISC-V), ppc64 e ppc32 (PowerPC) e loongarch64. Tuttavia, è necessario compilare l’editor per quella piattaforma (oltre a esportare i modelli) autonomamente, poiché al momento non sono disponibili download ufficiali. Le istruzioni per compilare in RISC-V sono disponibili alla pagina :ref:`doc_compiling_for_linuxbsd`.
ko: Linux는 rv64(RISC-V), ppc64 & ppc32(PowerPC), 그리고 loongarch64를 지원합니다. 하지만 해당 플랫폼에 맞게 편집기를 직접 컴파일하고 템플릿도 내보내야 합니다. 현재 공식 다운로드는 제공되지 않습니다. RISC-V 컴파일 지침은 :ref:`doc_compiling_for_linuxbsd` 페이지에서 확인할 수 있습니다.

source: :ref:`High-level interpreted language <doc_gdscript_reference>` with :ref:`optional static typing <doc_gdscript_static_typing>`.
ko: :ref:`optional static typing <doc_gdscript_static_typing>` 을 포함한 :ref:`High-level interpreted language <doc_gdscript_reference>`.

source: 3 rendering *methods* (running over 2 rendering *drivers*) are available:
tr: 3 işleme *yöntemi* ( 2 işleme *sürücüsü* üzerinde çalışan) mevcuttur:

source: **Forward+**, running over Vulkan 1.0 (with optional Vulkan 1.1 and 1.2 features). The most advanced graphics backend, suited for desktop platforms only. Used by default on desktop platforms.
tr: **İleri+**, Vulkan 1.0'ın üzerinde çalışır (isteğe bağlı Vulkan 1.1 ve 1.2 özellikleri ile). En gelişmiş grafik arka-uç'tur, sadece masaüstü platformları için uygundur. Masaüstü platformlarda varsayılan olarak kullanılır.

source: **Forward Mobile**, running over Vulkan 1.0 (with optional Vulkan 1.1 and 1.2 features). Less features, but renders simple scenes faster. Suited for mobile and desktop platforms. Used by default on mobile platforms.
tr: **İleri Mobil**, Vulkan 1.0 üzerinde çalışır (isteğe bağlı Vulkan 1.1 ve 1.2 özellikleri ile). Daha az özellik barındırır, ancak basit sahneleri daha hızlı işler. Mobil ve masaüstü platformları için uygundur. Mobil platformlarda varsayılan olarak kullanılır.

source: **Compatibility**, running over OpenGL 3.3 / OpenGL ES 3.0 / WebGL 2.0. The least advanced graphics backend, suited for low-end desktop and mobile platforms. Used by default on the web platform.
tr: **Uyumluluk**, OpenGL 3.3 / OpenGL ES 3.0 / WebGL 2.0 üzerinden çalışır. En az gelişmiş grafik arka-uç'tur, düşük özellikli masaüstü ve mobil platformlar için uygundur. Web platformunda varsayılan olarak kullanılır.

source: When using the Forward+ backend, a depth prepass is used to improve performance in complex scenes by reducing the cost of overdraw.
tr: İleri+ arka-ucunu kullanırken, aşır- çizim bedelini düşürmek yoluyla karmaşık sahnelerde performansı artıran bir derinlik ön geçişi kullanılır.

source: :ref:`doc_variable_rate_shading` on supported GPUs in Forward+ and Forward Mobile.
tr: İleri+ ve İleri Mobil'de desteklenen GPU'lar üzerinde :ref:`doc_variable_rate_shading`.

source: When using the Forward+ backend (default on desktop), lights are rendered with clustered forward optimizations to decrease their individual cost. Clustered rendering also lifts any limits on the number of lights that can be used on a mesh.
tr: İleri+ arka-ucunu kullanırken (masaüstü için varsayılan) ışıklar, kendi bireysel maliyetlerini düşürmek için kümeli ileri iyileştirmeleri ile işlenirler. Kümeli işleme ayrıca bir örgü üzerinde kullanılabilen ışık sayısındaki tüm kısıtlamaları kaldırır.

source: When using the Forward Mobile backend, up to 8 omni lights and 8 spot lights can be displayed per mesh resource. Baked lighting can be used to overcome this limit if needed.
tr: İleri Mobil arka-ucunu kullanırken, örgü kaynağı başına 8 adede kadar her-yönlü ışık ve 8 adede kadar benek ışık görüntülenebilir. İhtiyaç halinde önceden pişirilmiş ışıklandırma kullanılarak bu kısıtlamaların üstesinden gelinebilir.

source: :ref:`Baked lightmaps <doc_using_lightmap_gi>` (fast, but can't be updated at run-time).
tr: :ref:`Pişirilmiş ışıkharitaları <doc_using_lightmap_gi>` (hızlıdır, ancak çalışma zamanında güncellenemez).

source: :ref:`Voxel-based GI probes <doc_using_voxel_gi>`. Supports dynamic lights *and* dynamic occluders, while also supporting reflections. Requires a fast baking step which can be performed in the editor or at run-time (including from an exported project).
tr: :ref:`Voxel-tabanlı GI sondaları <doc_using_voxel_gi>`. Yansımaları desteklemesinin yanında Dinamik ışıkları *ve* dinamik perdeleyicileri de destekler. Düzenleyicide veya çalışma zamanında (dışa aktarılan bir projeden dahil) gerçekleştirilebilen hızlı bir pişirme adımı gerektirir.

source: When using the Forward+ backend (default on desktop), reflection probes are rendered with clustered forward optimizations to decrease their individual cost. Clustered rendering also lifts any limits on the number of reflection probes that can be used on a mesh.
tr: İleri+ arka ucunu kullanırken (masaüstünde varsayılan), yansıma sondaları, bireysel maliyetlerini azaltmak için kümelenmiş ileri en iyileştirmeler ile işlenir. Kümelenmiş işleme, bir örgü üzerinde kullanılabilecek yansıma sondalarının sayısı üzerindeki tüm sınırları da kaldırır.

source: When using the Forward Mobile backend, up to 8 reflection probes can be displayed per mesh resource.
tr: İleri Mobil arka ucunu kullanırken, örgü kaynağı başına 8 taneye kadar yansıma sondası görüntülenebilir.

source: Does not rely on run-time mesh generation. This means decals can be used on complex skinned meshes with no performance penalty, even if the decal moves every frame.
tr: Çalışma zamanı örgü üretimine bağımlı değildir. Bu, çıkartmanın her kare hareket etmesi durumunda bile, çıkartmaların karmaşık kaplamalı kafeslerde performans cezası olmadan kullanılabileceği anlamına gelir.

source: When using the Forward+ backend (default on desktop), decals are rendered with clustered forward optimizations to decrease their individual cost. Clustered rendering also lifts any limits on the number of decals that can be used on a mesh.
tr: İleri+ arka ucunu kullanırken (masaüstünde varsayılan), çıkartmalar bireysel maliyetlerini azaltmak için kümelenmiş ileri en iyileştirme ile işlenir. Kümelenmiş işleme, bir örgü üzerinde kullanılabilecek çıkartma sayısı üzerindeki tüm sınırları da kaldırır.

source: When using the Forward Mobile backend, up to 8 decals can be displayed per mesh resource.
tr: İleri Mobil arka ucunu kullanırken, ağ kaynağı başına 8 taneye kadar çıkartma görüntülenebilir.

source: Support for exporting the current scene as a glTF 2.0 file, both from the editor and at run-time from an exported project.
tr: Mevcut sahneyi, hem düzenleyiciden hem de dışa aktarılan bir projeden çalışma zamanında, glTF 2.0 dosyası olarak dışa aktarma desteği.

source: :ref:`High-level interpreted language <doc_gdscript>` with :ref:`optional static typing <doc_gdscript_static_typing>`.
ga: :ref:`Teanga ardleibhéil ateangaireachta <doc_gdscript>` le :ref:`clóscríobh statach roghnach <doc_gdscript_static_typing>`.
tr: :ref:`İsteğe bağlı sabit tip yazımı <doc_gdscript_static_typing>` kullanan :ref:`yüksek-düzeyli yorumlanan dil <doc_gdscript>` 'dir.

source: Supports .NET 6 and higher.
tr: .NET 6 ve üstünü destekler.

source: Full support for the C# 10.0 syntax and features.
tr: C# 10.0 sözdizimi ve özellikleri için tam destek.

source: Supports Windows, Linux, and macOS. As of 4.2 experimental support for Android and iOS is also available (requires a .NET 7.0 project for Android and 8.0 for iOS).
tr: Windows, Linux ve macOS'u destekler. 4.2'den itibaren Android ve iOS için deneysel destek de mevcuttur (Android için .NET 7.0 ve iOS için 8.0 projesi gerektirir).

source: On the Android platform only some architectures are supported: ``arm64`` and ``x64``.
tr: Android platformunda sadece bazı mimariler desteklenmektedir: ``arm64`` ve ``x64``.

source: Support for loading glTF 2.0 scenes at run-time, including from an exported project.
tr: Dışa aktarılan bir proje de dahil olmak üzere, glTF 2.0 sahnelerini çalışma zamanında yükleme desteği.

source: Generate navigation meshes from the editor or at run-time (including from an exported project).
tr: Düzenleyiciden, ya da çalışma sırasında, gezinme örgüleri oluşturun (dışa aktarılan projeyi dahil ederek).
