Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: :ref:`2D geometry helper class <class_Geometry2D>`.
cs: :ref:`Pomocná třída 2D geometrie <class_Geometry2D>`.
fr: :ref:`Classe d'aide à la géométrie 2D<class_Geometry2D>`.
ga: :ref:`Rang cúntóir céimseata 2D <class_Geometry2D>`.
it: :ref:`Classe ausiliare per la geometria 2D. <class_Geometry2D>`.
ja: :ref:`2Dジオメトリヘルパークラス <class_Geometry2D>` 。
ko: :ref:`2D 기하학 도우미 클래스 <class_Geometry2D>`.
pl: :ref:`Klasa pomocnicza dla obliczeń geometrycznych 2D <class_Geometry2D>`.
ru: :ref:`Вспомогательный класс 2D геометрии <class_Geometry2D>`.
ta: :ref:`2D geometry helper வகுப்பு <class_Geometry2D>`.
tr: :ref:`2B geometri yardımcı sınıfı <class_Geometry2D>`.

source: 2D physics
cs: 2D fyzika
fr: Physique 2D
ga: Fisic 2T
it: Fisica 2D
ja: 2D物理演算
ko: 2D 물리
pl: Fizyka 2D
ru: 2D физика
ta: 2 டி இயற்பியல்
tr: 2B fizik

source: **Physics bodies:**
cs: **Fyzikální tělesa:**
fr: **Corps physiques :**
ga: **Comhlachtaí fisice:**
it: **Corpi fisici:**
ja: **物理ボディ:**
ko: **물리 바디:**
pl: **Obiekty fizyczne:**
ru: **Физические тела:**
ta: ** இயற்பியல் உடல்கள்: **
tr: **Fizik cisimleri:**

source: Static bodies.
cs: Statická tělesa.
fr: Corps statiques.
ga: Comhlachtaí statacha.
it: Corpi statici.
ja: 静的ボディ。
ko: 정적 바디.
pl: Obiekty statyczne.
ru: Статические тела.
ta: நிலையான உடல்கள்.
tr: Durağan cisimler.

source: Animatable bodies (for objects moving only by script or animation, such as doors and platforms).
cs: Animovatelná tělesa (pro objekty pohybující se pomocí skriptů nebo animace, jako třeba dveře nebo platformy).
fr: Corps à animer (pour des objets bougeant uniquement par script ou animation, comme des portes et des plateformes).
ga: Comhlachtaí animatable (le haghaidh rudaí ag gluaiseacht ach amháin trí script nó beochan, ar nós doirse agus ardáin).
it: Corpi animabili (per oggetti in movimento solo tramite script o animazioni, come porte o piattaforme).
ja: アニメーション可能なボディ (ドアやプラットフォームなど、スクリプトまたはアニメーションによってのみ動くオブジェクト用)。
ko: 애니메이터블 바디 (스크립트나 애니메이션으로만 움직이는 문·플랫폼과 같은 물체).
pl: Animowane obiekty (dla obiektów poruszających się tylko za pomocą skryptu lub animacji, takich jak drzwi i platformy).
ru: Анимируемые тела (для объектов, которые движутся только скриптом или анимацией, например, двери и платформы).
ta: அனிமேட்டபிள் உடல்கள் (ச்கிரிப்ட் அல்லது அனிமேசன் மூலம் மட்டுமே நகரும் பொருள்களுக்கு, கதவுகள் மற்றும் தளங்கள் போன்றவை).
tr: Canlandırılabilir cisimler (kapılar ve basamak zeminler gibi sadece betik veya canlandırma yoluyla hareket ettirilen objeler için).

source: Rigid bodies.
cs: Tuhá tělesa.
fr: Corps rigides.
ga: Comhlachtaí righin.
it: Corpi rigidi.
ja: リジッドボディ。
ko: 리지드 바디.
pl: Obiekty sztywne.
ru: Твердые тела (rigid bodies).
ta: கடினமான உடல்கள்.
tr: Katı cisimler.

source: Character bodies.
cs: Tělesa pro postavy.
fr: Corps de personnage.
ga: Comhlachtaí carachtair.
it: Corpi di personaggi.
ja: キャラクタボディ。
ko: 캐릭터 바디.
pl: Obiekty postaci.
ru: Тела персонажей.
ta: எழுத்து உடல்கள்.
tr: Karakter cisimleri.

source: Joints.
cs: Klouby.
fr: Les articulations.
ga: Ailt.
it: Giunti.
ja: ジョイント。
ko: 조인트.
pl: Połączenia.
ru: Соединения.
ta: மூட்டுகள்.
tr: Eklemler.

source: Areas to detect bodies entering or leaving it.
cs: Oblasti, které detekují tělesa, když do nich vstoupí nebo je opustí.
fr: Zones pour détecter les corps qui y entrent ou en sortent.
ga: Limistéir chun comhlachtaí a thagann isteach nó a fhágann é a bhrath.
it: Aree per rilevare i corpi che entrano o escono.
ja: 出入りするボディを検出するための Area。
ko: 물체가 들어오거나 나가는 것을 감지하는 에이리어.
pl: Obszary wykrywające wchodzące lub opuszczające obiekty.
ru: Области для обнаружения входящих или выходящих тел.
ta: உடல்கள் நுழையும் அல்லது வெளியேறும் பகுதிகள்.
tr: İçine giren veya çıkan cisimleri tespit eden alanlar.

source: **Collision detection:**
cs: **Detekce kolizí:**
fr: **Détection de collision :**
ga: **Brath imbhuailtí:**
it: **Rilevamento delle collisioni:**
ja: **衝突検出:**
ko: **콜리전 감지:**
pl: **Detekcja kolizji:**
ru: **Обнаружение столкновений:**
ta: ** மோதல் கண்டறிதல்: **
tr: **Çarpışma algılaması.**

source: Built-in shapes: line, box, circle, capsule, world boundary (infinite plane).
cs: Vestavěné tvary: linka, obdélník, kruh, kapsle, hranice světa (nekonečná plocha).
fr: Formes intégrées : ligne, pavé, cercle, capsule, limite du monde (plan infini).
ga: Cruthanna tógtha: líne, bosca, ciorcal, capsúl, teorainn an domhain (eitleán gan teorainn).
it: Forme integrate: linea, scatola, cerchio, capsula, confini di mondo (piano infinito).
ja: 組み込みシェイプ: ライン、ボックス、円、カプセル、ワールド境界 (無限平面)。
ko: 기본 모양: 선, 상자, 원, 캡슐, 월드 경계 (무한 평면).
pl: Wbudowane kształty: linia, prostokąt, koło, kapsuła, granica świata (nieskończona płaszczyzna).
ru: Встроенные фигуры: линия, коробка, круг, капсула, граница мира (бесконечная плоскость).
ta: உள்ளமைக்கப்பட்ட வடிவங்கள்: வரி, பெட்டி, வட்டம், காப்ச்யூல், உலக எல்லை (எல்லையற்ற விமானம்).
tr: Yerleşik şekiller: çizgi, kutu, daire, kapsül, dünya sınırı (sonsuz düzlem).

source: Collision polygons (can be drawn manually or generated from a sprite in the editor).
cs: Kolizní polygony (můžete kreslit ručně nebo v editoru generovat ze spritů).
fr: Polygones de collision (peuvent être dessinés manuellement ou générés à partir d'un sprite dans l'éditeur).
ga: Polagáin imbhuailte (is féidir iad a tharraingt de láimh nó a ghiniúint ó sprite san eagarthóir).
it: Poligoni di collisione (possono essere disegnati manualmente o generati da uno sprite nell'editor).
ja: 衝突ポリゴン (手動で描いたり、エディタ内でスプライトから生成可能)。
ko: 콜리전 폴리곤 (편집기에서 직접 그리거나 스프라이트로부터 생성될 수 있음).
pl: Wielokąty kolizyjne (mogą być narysowane manualnie lub wygenerowane ze sprite w edytorze).
ru: Полигоны столкновения (могут быть нарисованы вручную или сгенерированы из спрайта в редакторе).
ta: மோதல் பலகோணங்கள் (கைமுறையாக வரையப்படலாம் அல்லது எடிட்டரில் ஒரு ச்பிரிட்டிலிருந்து உருவாக்கலாம்).
tr: Çarpışma çokgenleri (el ile çizilebilir veya düzenleyicide bir grafik ögeden üretilebilir).

source: 3D graphics
cs: 3D grafika
fr: Graphismes 3D
ga: Grafaicí 3T
it: Grafica 3D
ja: 3Dグラフィックス
ko: 3D 그래픽
pl: Grafika 3D
ru: 3D-графика
ta: 3 டி கிராபிக்ச்
tr: 3B grafikler

source: HDR rendering with sRGB.
cs: HDR vykreslování s sRGB.
fr: Rendu HDR avec sRGB.
ga: HDR rindreáil le sRGB.
it: Rendering HDR con sRGB.
ja: sRGBによるHDRレンダリング。
ko: sRGB를 사용한 HDR 렌더링.
pl: Renderowanie HDR z sRGB.
ru: HDR Рендеринг с использованием sRGB.
ta: SRGB உடன் HDR வழங்குதல்.
tr: sRGB ile HDR işleme.

source: Perspective, orthographic and frustum-offset cameras.
cs: Perspektivní, ortografické a frustrum-offset (záběr ve tvaru jehlanu - vyrovnávaný) kamery.
fr: Caméras perspective, orthographiques et frustum-offset.
ga: Ceamaraí peirspictíochta, ortagrafaíochta agus frustum-fhritháireamh.
it: Telecamere prospettiche, ortografiche e troncoconiche.
ja: 透視投影、平行投影、視錐台オフセットカメラ。
ko: 원근, 직교 및 절두체 오프셋 카메라.
pl: Kamery perspektywiczne, ortograficzne oraz z przesuniętą bryłą widzenia.
ru: Перспективные, ортографические и усечённые камеры.
ta: முன்னோக்கு, ஆர்த்தோகிராஃபிக் மற்றும் ஃப்ரச்டம்-ஆஃப்செட் கேமராக்கள்.
tr: Perspektif (bakış açılı), ortografik (dik açılı) ve kesik-konik-kaydırmalı kameralar.

source: When using the Forward+ renderer, a depth prepass is used to improve performance in complex scenes by reducing the cost of overdraw.
cs: Při použití vykreslovacího nástroje Forward+ se ke zlepšení výkonu ve složitých scénách používá hloubkový předprůchod, který snižuje náklady na překreslení.
fr: Lors de l'utilisation du moteur de rendu Forward+, une prépasse de profondeur est utilisé pour améliorer les performances dans les scènes complexes en réduisant le coût du surdessin.
it: Quando si utilizza il renderer Forward+, viene utilizzato un pre-passaggio di profondità per migliorare le prestazioni in scene complesse riducendo il costo dell'overdraw.
ja: Forward+ レンダラーを使用する場合、深度プリパスがオーバードローのコストを削減することによって、複雑なシーンのパフォーマンスを向上させます。
ko: Forward+ 렌더러를 사용하면, 뎁스 프리패스가 사용되어 복잡한 씬에서 오버드로우 비용을 줄임으로써 성능을 향상함.
pl: Podczas korzystania z rendereru Forward+, wstępne przejście głębokości jest używane w celu poprawy wydajności w złożonych scenach poprzez zmniejszenie kosztów przerysowania.
ru: При использовании Forward+ в качестве рендера, используется предпроход глубины (depth prepass) для улучшения производительности в сложных сценах, уменьшением количества вычислений, уходящих на отрисовку.
ta: முன்னோக்கி+ ரெண்டரரைப் பயன்படுத்தும் போது, ஓவர் டிராவின் செலவைக் குறைப்பதன் மூலம் சிக்கலான காட்சிகளில் செயல்திறனை மேம்படுத்த ஆழமான ப்ரெபாச் பயன்படுத்தப்படுகிறது.

source: :ref:`doc_variable_rate_shading` on supported GPUs in Forward+ and Mobile.
cs: :ref:`doc_variable_rate_shading` na podporovaných GPU v režimech Forward+ a Mobile.
fr: :ref:`doc_variable_rate_shading` pour les GPUs supportés, avec un moteur de rendu Forward+ ou Mobile.
it: :ref:`doc_variable_rate_shading` sulle GPU supportate in Forward+ e Mobile.
ja: Forward+ および Mobile でサポートされているGPUの :ref:`doc_variable_rate_shading`。
ko: Forward+ 및 모바일 렌더러를 사용하면, 지원되는 GPU에서 :ref:`doc_variable_rate_shading`\ 을 사용함.
pl: :ref:`doc_variable_rate_shading` na obsługiwanych układach GPU w Forward+ i Forward Mobile.
ru: :ref:`doc_variable_rate_shading` на поддерживаемых Графический процессорах в Forward+ и Forward Mobile.

source: **Physically-based rendering (built-in material features):**
cs: **Fyzikální vykreslování (vestavěné materiálové funkce):**
fr: **Rendu basé sur la physique (fonctionnalités de matériau intégrés):**
ga: ** Rindreáil atá bunaithe go fisiciúil (gnéithe ábhartha tógtha) :* *
it: **Rendering basato sulla fisica (funzionalità dei materiali integrati):**
ja: ** 物理ベースレンダリング (内蔵のマテリアル機能):**
ko: **물리 기반 렌더링 (내장된 머티리얼 기능)**
pl: **Renderowanie oparte na fizyce (wbudowane właściwości materiałów):**
ru: **Физически корректный рендеринг (встроенное свойства материалов):**
ta: ** உடல் அடிப்படையிலான வழங்குதல் (உள்ளமைக்கப்பட்ட பொருள் அம்சங்கள்): **
tr: **Fiziksel-tabanlı işleme (yerleşik malzeme özellikleri)**

source: Follows the Disney PBR model.
cs: Následuje model Disney PBR.
fr: Suit le modèle Disney PBR.
ga: Leanann sé samhail Disney PBR.
it: Segue il modello Disney PBR.
ja: ディズニーPBRモデルに準拠。
ko: 디즈니의 PBR 모델을 따름.
pl: Naśladuje model PBR Disneya.
ru: Следует модели Disney PBR.
ta: டிச்னி பிபிஆர் மாதிரியைப் பின்பற்றுகிறது.
tr: Disney PBR modelini izler.

source: Supports Burley, Lambert, Lambert Wrap (half-Lambert) and Toon diffuse shading modes.
cs: Podporuje rozptylové shadingové režimy Burley, Lambert, Lambert Wrap (poloviční-Lambert) a Toon.
fr: Supporte les modes d'ombrage diffus Burley, Lambert, Lambert Wrap (demi-Lambert) et Toon.
ga: Tacaíochtaí Burley, Lambert, Lambert Wrap (leath-Lambert) agus modhanna scáthú idirleata Toon.
it: Supporta le modalità di ombreggiatura diffusa Burley, Lambert, Lambert Wrap (mezzo-Lambert) e Toon.
ja: Burley、Lambert、Lambert Wrap (half-Lambert) 、Toonの拡散シェーディングモードに対応。
ko: Burley, Lambert, Lambert Wrap (half-Lambert) 및 Toon Diffuse 셰이딩 모드 지원.
pl: Obsługuje tryby cieniowania: Burley, Lambert, Lambert Wrap (half-Lambert) oraz Toon.
ru: Поддерживает режимы затенения Burley, Lambert, Lambert Wrap (half-Lambert) и Toon.
ta: பர்லி, லம்பேர்ட், லம்பேர்ட் மடக்கு (ஆஃப்-லம்பர்ட்) மற்றும் டூன் டிஃப்யூச் நிழல் முறைகளை ஆதரிக்கிறது.
tr: Burley, Lambert, Lambert Wrap (yarı-Lambert) ve Toon dağılımlı gölgeleme modlarını destekler.

source: Supports Schlick-GGX, Toon and Disabled specular shading modes.
cs: Podporuje zrcadlící shadingové režimy Schlick-GGX, Toon a Disabled.
fr: Supporte les modes de d'ombrage Schlick-GGX, Toon et Spéculaire désactivé.
ga: Tacaíochtaí Schlick-GGX, Toon agus Modhanna scáthú specular Díchumasaithe.
it: Supporta le modalità di ombreggiatura speculare Schlick-GGX, Toon e Disabilitato.
ja: Schlick-GGX、Toon、Disabled Specular Shading Modeをサポート。
ko: Schlick-GGX, Toon, Disabled 스페큘러 셰이딩 모드 지원.
pl: Wspiera Schlick-GGX, Toon i wyłączone tryby cieniowania lustrzanego.
ru: Поддерживает режимы затенения Schlick-GGX, Toon и отключенного отражения (disabled specular shading).
ta: ச்க்லிக்-சிசிஎக்ச், டூன் மற்றும் ஊனமுற்ற ஏகப்பட்ட நிழல் முறைகளை ஆதரிக்கிறது.
tr: Schlick-GGX, Toon ve Disabled yansıma gölgeleme modlarını destekler.

source: Uses a roughness-metallic workflow with support for ORM textures.
cs: Používá postup hrubost-kovovost s podporou ORM textur.
fr: Utilise un flux de travail de type rugosité-métal avec support des textures ORM.
ga: Úsáideann sreabhadh oibre garbh-mhiotalacha le tacaíocht d'uigeachtaí ORM.
it: Utilizza il flusso di lavoro roughness-metallic con supporto per le texture ORM.
ja: ORMテクスチャに対応するラフネスメタリック用ワークフローを使用。
ko: ORM 텍스처를 지원하는 러프니스-메탈릭 워크플로 사용.
pl: Wykorzystuje przepływ pracy zbudowany wokół skali metaliczność-chropowatość z obsługą tekstur ORM.
ru: Использует roughness-metallic рабочий процесс с поддержкой ORM текстур.
ta: ORM அமைப்புகளுக்கான ஆதரவுடன் கரடுமுரடான-உலோக பணிப்பாய்வுகளைப் பயன்படுத்துகிறது.
tr: ORM dokuları için destek içeren pürüzlülük-metalik iş akışı kullanır.

source: Uses horizon specular occlusion (Filament model) to improve material appearance.
cs: Používá horizontové vyřazení zrcadlení (model Filament) pro zlepšení vzhledu materiálů.
fr: Utiliser l'occlusion spéculaire d'horizon (modèle en filament) pour améliorer l'apparence du matériau.
ga: Úsáideann an páiste occlusion specular spéire (samhail filiméid) chun cuma ábhartha a fheabhsú.
it: Utilizza l'occlusione speculare dell'orizzonte (modello Filament) per migliorare l'aspetto del materiale.
ja: 水平スペキュラオクルージョン (フィラメントモデル) を使用したマテリアルの外観の改善。
ko: 호라이즌 스페큘러 오클루전(필라멘트 모델)을 사용하여 머티리얼 외관을 개선합니다.
pl: Wykorzystuje okluzję zwierciadlaną horyzontu (model Filament), aby poprawić wygląd materiału.
ru: Для улучшения внешнего вида материала используется HBSO (horizon-based specular occlusion, модель Filament).
ta: பொருள் தோற்றத்தை மேம்படுத்த ஆரிசன் ஏகப்பட்ட மறைவு (இழை மாதிரி) பயன்படுத்துகிறது.
tr: Malzeme görünümünü iyileştirmek için, ufuk çizgisi yansıtıcı perdeleme kullanır (Filament modeli).

source: Normal mapping.
cs: Normálové mapování.
fr: Cartographie des normales.
ga: Gnáthmhapáil.
ja: 法線マップ。
ko: 노멀 매핑.
pl: Mapowanie normalnych.
ru: Карты нормалей.
ta: சாதாரண மேப்பிங்.
tr: Normal haritalaması.

source: Parallax/relief mapping with automatic level of detail based on distance.
cs: Paralaxní/reliéfní mapování s automatickou úrovní detailů podle vzdálenosti.
fr: Cartographie parallaxe/relief avec niveau de détail automatique basé sur la distance.
ga: Mapáil parallax/faoisimh le leibhéal uathoibríoch mionsonraí bunaithe ar achar.
it: Mappatura parallasse/rilievo con livello di dettaglio automatico basato sulla distanza.
ja: Parallax / relief マッピングは距離に応じて自動的に詳細レベルを設定します。
ko: 거리 기반 자동 LOD를 포함한 패럴랙스 매핑/릴리프 매핑.
pl: Mapowanie paralaksy / wypukłości z automatycznym poziomem szczegółowości na podstawie odległości.
ru: Карты параллакса/рельефа с автоматическим определением уровня детализации в зависимости от расстояния (LOD).
ta: தூரத்தின் அடிப்படையில் தானியங்கி அளவிலான விவரங்களுடன் இடமாறு/நிவாரண மேப்பிங்.
tr: Mesafe bazlı otomatik detay seviyesine sahip parallax/relief haritalama.

source: Detail mapping for the albedo and normal maps.
cs: Mapování detailů pro albedo a normálové mapy.
fr: Cartographie détaillée des cartes d'albédo et de normales.
ga: Mapáil mhionsonraithe don albedo agus gnáthléarscáileanna.
it: Mappatura dettagliata per le mappe di albedo e di normali.
ja: アルベドマップと法線マップの詳細マッピング。
ko: 알베도 및 노멀 맵에 대한 디테일 매핑.
pl: Mapowanie szczegółów (detali) dla albedo (kolor bazowy) i map normal (wypukłość).
ru: Детальное отображение для карт альбедо и нормалей.
ta: ஆல்பிடோ மற்றும் சாதாரண வரைபடங்களுக்கான விவரம் மேப்பிங்.
tr: Albedo ve normal haritaları için detay haritalama.

source: Sub-surface scattering and transmittance.
cs: Podpovrchový rozptyl a propustnost.
fr: Diffusion sous-surface et transmittance.
ga: Scaipeadh agus tarchur fo-dhromchla.
ja: 表面下散乱 (Sub-surface scattering)、および透過率 (transmittance)。
ko: 서브서피스 스캐터링 및 투과율.
pl: Pod-powierzchowne rozpraszanie i przepuszczalność.
ru: Подповерхностное рассеивание и пропускание.
ta: துணை மேற்பரப்பு சிதறல் மற்றும் பரிமாற்றம்.
tr: Alt yüzey saçılması ve geçirgenliği.

source: Screen-space refraction with support for material roughness (resulting in blurry refraction).
cs: Lom v prostoru obrazovky s podporou hrubosti materiálu (vedoucí k rozmazanému lomu).
fr: Réfraction dans l'espace de l'écran avec support de la rugosité du matériau (donnant une réfraction floue).
ga: Athraonadh spáis scáileáin le tacaíocht do ghairbhe ábhair (a bhfuil athraonadh doiléir mar thoradh air).
it: Rifrazione nello spazio dello schermo con supporto per la rugosità di materiale (con conseguente rifrazione sfocata).
ja: スクリーン空間の屈折 (マテリアルの粗さをサポート。ぼやけた屈折が発生します)。
ko: 머티리얼 러프니스를 지원하는 화면공간 반사 (흐릿한 반사).
pl: Refrakcja ze wsparciem dla chropowatości materiału (skutkująca rozmytym załamaniem).
ru: Преломление пространства экрана с поддержкой шероховатости материала (приводит к размытому преломлению).
ta: பொருள் கடினத்தன்மைக்கான ஆதரவுடன் திரை-விண்வெளி ஒளிவிலகல் (இதன் விளைவாக மங்கலான ஒளிவிலகல்).
tr: Malzeme pürüzlülüğü desteğiyle ekran-alanı kırılması (bulanık kırılmayla sonuçlanır).

source: Proximity fade (soft particles) and distance fade.
cs: Blízké blednutí (měkké částice) a vzdálené blednutí.
fr: Fondu de proximité (particules molles) et fondu de distance.
ga: Cóngaracht céimnithe (cáithníní boga) agus fadú achar.
it: Dissolvenza in prossimità (particelle soffuse) e a distanza.
ja: 近接フェード (ソフトパーティクル)。
ko: 근접 페이드(부드러운 입자)와 거리 페이드.
pl: Bliskie zanikanie (miękkie cząsteczki) i odległe zanikanie.
ru: Затухание близости (мягкие частицы) и затухание расстояния.
ta: அருகாமையில் மங்கல் (மென்மையான துகள்கள்) மற்றும் தூரம் மங்கிவிடும்.
tr: Yakınlık solması (yumuşak parçacıklar) ve uzaklık solması.

source: Distance fade can use alpha blending or dithering to avoid going through the transparent pipeline.
cs: Vzdálené blednutí může používat alfa prolnutí nebo barevný rozklad (dithering), aby nemuselo procházet skrz pipeline průhlednosti.
fr: Le fondu de distance peut utiliser le mélange alpha ou le tramage pour éviter de passer par le pipeline de transparence.
ga: Is féidir le fadú achar a úsáid alfa chumasc nó dithering a sheachaint ag dul tríd an phíblíne trédhearcach.
it: La dissolvenza a distanza può utilizzare la fusione alfa o il dithering per evitare di passare attraverso la pipeline trasparente.
ja: 距離フェードはアルファブレンディング、もしくはディザリングを使用して透明パイプラインを回避可能。
ko: 거리 페이드는 투명 파이프라인을 거치지 않기 위해 알파 블렌딩이나 디더링을 사용할 수 있습니다.
pl: Odległe zanikanie, może wykorzystywać mieszanie alfa czy rozpraszanie, aby uniknąć przechodzenia przez sekwencję przezroczystości.
ru: Затухание расстояния может использовать дизеринг или смешивание цветов для избежания прохождения конвейера прозрачности.
ta: வெளிப்படையான குழாய் வழியாக செல்வதைத் தவிர்ப்பதற்கு தூர மங்கலான ஆல்பா கலத்தல் அல்லது டூயிங்கைப் பயன்படுத்தலாம்.
tr: Uzaklık solması, şeffaf akış hattından geçmekten kaçınmak için şeffaflık harmanlama veya titreklik kullanabilir.

source: Dithering can be determined on a per-pixel or per-object basis.
cs: Barevný rozklad lze počítat na úrovni objektů nebo pixelů.
fr: Le tramage peut être déterminée par pixel ou par objet.
ga: Is féidir dithering a chinneadh ar bhonn in aghaidh an phicteilín nó in aghaidh an réada.
it: Il dithering può essere determinato per pixel o per oggetto.
ja: ディザリングは、ピクセル単位またはオブジェクト単位で決定可能。
ko: 디더링은 픽셀이나 오브젝트 별로 결정할 수 있습니다.
pl: Dithering można określić na podstawie co-piksel lub co-obiekt.
ru: Дизеринг может быть определен для каждого пикселя или объекта.
ta: ஒரு படப்புள்ளி அல்லது ஒரு பொருளின் அடிப்படையில் டூரிங் தீர்மானிக்கப்படலாம்.
tr: Titreklik piksel-başına veya nesne-başına temelli olarak belirlenebilir.

source: **Real-time lighting:**
cs: **Osvětlení v reálném čase:**
fr: **Éclairage en temps réel :**
ga: **Soilsiú fíor-ama:**
it: **Illuminazione in tempo reale:**
ja: **リアルタイム照明:**
ko: **실시간 조명:**
pl: **Oświetlenie w czasie rzeczywistym:**
ru: **Освещение в режиме реальном времени:**
ta: ** நிகழ்நேர விளக்குகள்: **
tr: **Gerçek-zamanlı ışıklandırma:**

source: Directional lights (sun/moon). Up to 4 per scene.
cs: Směrová světla (slunce / měsíc). Až 4 na scénu.
fr: Lumières directionnelles (soleil/lune). Jusqu'à 4 par scène.
ga: Soilse treocha (grian/gealach). Suas le 4 in aghaidh an radhairc.
it: Luci direzionali (sole/luna). Fino a 4 per scena.
ja: 指向性ライト (太陽 / 月)。1 シーンにつき 4 個まで。
ko: 방향성 조명 (태양 또는 달). 씬에 최대 4개까지 가능.
pl: Światła kierunkowe (słońce/księżyc). Do 4 na scenę.
ru: Направленные источники света (солнце/луна). До 4-х в сцене.
ta: திசை விளக்குகள் (சூரியன்/சந்திரன்). ஒரு காட்சிக்கு 4 வரை.
tr: Yönlü ışıklar (güneş/ay). Sahne başına 4 adede kadar.

source: Omnidirectional lights.
cs: Všesměrová světla.
fr: Lumières omnidirectionnelles.
ga: Soilse omnidirectional.
it: Luci omnidirezionali.
ja: 全方位ライト。
ko: 전방위 조명.
pl: Wielokierunkowe światła.
ru: Всенаправленный свет.
ta: ஓம்னிடிரெக்சன் விளக்குகள்.
tr: Her-yönlü ışıklar.

source: Spot lights with adjustable cone angle and attenuation.
cs: Bodová světla s nastavitelným úhlem kužele a útlumem.
fr: Projecteurs dont l'angle du cône et l'atténuation sont réglables.
ga: Spotshoilse le huillinn cón inchoigeartaithe agus maolú.
it: Faretti con angolo del cono e attenuazione regolabili.
ja: コーンの角度および減衰量を調整できるスポットライト。
ko: 원뿔 각과 감쇠를 조정할 수 있는 스포트 라이트.
pl: Światła punktowe z modyfikowalnym kątem stożka i osłabianiem.
ru: Точечные источники света с регулируемым углом конуса и затуханием.
ta: சரிசெய்யக்கூடிய கூம்பு கோணம் மற்றும் விழிப்புணர்வு கொண்ட ச்பாட் விளக்குகள்.
tr: Ayarlanabilir koni açısı ve zayıflama kullanan spot ışıklar.

source: Specular, indirect light, and volumetric fog energy can be adjusted on a per-light basis.
cs: Zrcadlové, nepřímé světlo a energii volumetrické mlhy lze nastavit pro každé světlo zvlášť.
fr: La lumière spéculaire, la lumière indirecte et l'énergie du brouillard volumétrique peuvent être réglées pour chaque lumière.
ga: Is féidir fuinneamh ceo specular, indíreach, agus toirtmhéadrach a choigeartú ar bhonn in aghaidh an tsolais.
it: L'intensità della specularità, luce indiretta e nebbia volumetrica può essere regolata per ogni luce.
ja: 鏡面光、間接光、ボリューメトリックフォグのエネルギーは、ライトごとに調整可能。
ko: 반사, 간접광, 볼류메트릭 안개 강도는 조명마다 조절할 수 있습니다.
pl: Energia światła lustrzanego, pośredniego i wolumetrycznego mgły może być regulowana odzielnie dla każdego źródła światła.
ru: Значения отражаемости, непрямого света и мощности освещения объема могут быть изменены для каждого источника света.
ta: ஏகப்பட்ட, மறைமுக ஒளி மற்றும் வால்யூமெட்ரிக் மூடுபனி ஆற்றல் ஆகியவற்றை ஒரு ஒளி அடிப்படையில் சரிசெய்யலாம்.
tr: Yansıtıcı, dolaylı ışık ve hacimsel sis enerjisi ışık-başına bazında ayarlanabilir.

source: Adjustable light "size" for fake area lights (will also make shadows blurrier).
cs: Nastavitelná "velikost" světla pro falešná plošná světla (také více rozmaže stíny).
fr: "Taille" de la lumière réglable pour les fausses lumières de zone (rendra également les ombres plus floues).
ga: Solas inchoigeartaithe "méid" le haghaidh soilse limistéar falsa (déanfaidh sé blurrier scáthanna freisin).
it: "Dimensioni" di luce regolabili per luci fittizie in un area (renderà anche le ombre più sfocate).
ja: 疑似エリアライトの "サイズ" を調整可能 (影もぼやけます)。
ko: 가짜 영역 조명을 위한 조절 가능한 조명 "크기" (그림자도 더 흐려짐).
pl: Regulowany "rozmiar" światła dla sztucznego obszaru światła (spowoduje że cienie będą rozmyte).
ru: Настраиваемый "размер" источника света для имитации освещения области (также делает тени более размытыми).
ta: போலி பகுதி விளக்குகளுக்கு சரிசெய்யக்கூடிய ஒளி "அளவு" (நிழல்களையும் மங்கலாக்கும்).
tr: Sahte alan ışıkları için ayarlanabilir ışık "boyutu" (ayrıca gölgeleri bulanıklaştırır).
