Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: :ref:`Signed-distance field GI <doc_using_sdfgi>` designed for large open worlds. Supports dynamic lights, but not dynamic occluders. Supports reflections. No baking required.
cs: :ref:`Globální osvětlení za pomoci pole vzdáleností se znaménkem (SDFGI) <doc_using_sdfgi>` navržené pro velké otevřené světy. Podporuje dynamická světla, ne však dynamická stínidla. Podporuje odrazy. Nevyžaduje vypálení.
fr: :ref:`Signed-distance field GI <doc_using_sdfgi>` conçu pour les grands mondes ouverts. Supporte les lumières dynamiques, mais pas les occlusions dynamiques. Supporte les réflexions. Pas de pré-calcul requis.
ga: :ref:`Réimse faid sínithe GI <doc_using_sdfgi>` atá deartha le haghaidh domhan mór oscailte. Tacaíonn soilse dinimiciúla, ach ní occluders dinimiciúil. Tacaíonn machnamh. Níl gá le bácáil.
it: :ref:`Signed-distance field GI <doc_using_sdfgi>` progettato per grandi "open world". Supporta luci dinamiche, ma non occlusori dinamici. Supporta riflessi. Non è necessario eseguirne il precalcolo.
ja: :ref:`Signed-distance field GI <doc_using_sdfgi>` 大規模なオープンワールド用に設計されています。動的ライトをサポートしますが、動的オクルーダーはサポートしません。反射をサポートします。ベイク処理は必要ありません。
ko: :ref:`부호화 디스턴스 필드(Signed-distance field) GI <doc_using_sdfgi>`\ 는 대규모 오픈 월드를 위해 설계되었습니다. 동적 조명과 반사를 지원하지만, 동적 차광체는 지원하지 않습니다. 베이킹이 필요하지 않습니다.
pl: :ref:`Signed-distance field GI <doc_using_sdfgi>` Zaprojektowany dla dużych, otwartych światów. Obsługuje dynamiczne światła ale nie dynamiczne przesłony. Obsługuje odbicia. Nie wymaga bake\'owania (wypiekania).
ru: :ref:`Signed-distance field GI <doc_using_sdfgi>` разработан для больших открытых миров. Поддерживает динамическое освещение, но не динамические ограничители. Поддерживает отражения. В запекании не нуждается.
ta: . மாறும் விளக்குகளை ஆதரிக்கிறது, ஆனால் மாறும் ஆக்லூடர்கள் அல்ல. பிரதிபலிப்புகளை ஆதரிக்கிறது. பேக்கிங் தேவையில்லை.
tr: :ref:`Signed-distance field GI <doc_using_sdfgi>` büyük açık dünyalar için tasarlanmıştır. Dinamik ışıkları destekler, ancak dinamik perdeleyicileri desteklemez. Yansımaları destekler. Pişirme gerektirmez.

source: :ref:`Screen-space indirect lighting (SSIL) <doc_environment_and_post_processing_ssil>` at half or full resolution. Fully real-time and supports any kind of emissive light source (including decals).
cs: :ref:`Nepřímé osvětlení v prostoru obrazovky (SSIL) <doc_environment_and_post_processing_ssil>` v polovičním nebo plném rozlišení. Kompletně v reálném čase, podporuje libovolné emisní zdroje světla (včetně nálepek).
fr: :ref:`Screen-space indirect lighting (SSIL) <doc_environment_and_post_processing_ssil>` à la moitié ou à pleine résolution. Rendu totalement en temps réel et supporte n'importe quelle source de lumière émissive (incluant les décalques).
ga: :ref:`Scáileán-soilsiú indíreach (SSIL) <doc_environment_and_post_processing_ssil>` ag leath nó taifeach iomlán. Go hiomlán fíor-ama agus tacaíonn sé le haon chineál foinse solais emissive (lena n-áirítear decals).
it: :ref:`Screen-space indirect lighting (SSIL) <doc_environment_and_post_processing_ssil>` a intera o dimezzata risoluzione. Renderizzata interamente in tempo reale e supporta qualsiasi sorgente di luce emissiva (incluse decalcomanie).
ja: :ref:`Screen-space indirect lighting (SSIL) <doc_environment_and_post_processing_ssil>` を半分または完全な解像度で実行します。完全にリアルタイムで、あらゆる種類の発光光源 (デカールを含む) をサポートします。
ko: :ref:`Screen-space indirect lighting (SSIL) <doc_environment_and_post_processing_ssil>` 은 절반 이나 전체 해상도로 지원됩니다. 완전 실시간으로 동작하며, 모든 종류의 발광 라이팅(데칼 포함)을 지원합니다.
pl: :ref:`Screen-space indirect lighting (SSIL) <doc_environment_and_post_processing_ssil>` W połowie lub pełnej rozdzielczości. W pełni w czasie rzeczywistym i obsługuje dowolne emisyjne źródło światła (w tym naklejki (decals)).
ru: :ref:`Screen-space indirect lighting (SSIL) <doc_environment_and_post_processing_ssil>` при половинном или полном разрешении. Работает полностью в реальном времени и поддерживает любой тип эмиссивного источника света (включая деколи).
ta: . முழுமையாக நிகழ்நேரம் மற்றும் எந்தவொரு உமிழும் ஒளி மூலத்தையும் ஆதரிக்கிறது (டெக்கல்கள் உட்பட).
tr: Yarım veya tam çözünürlükte :ref:`Ekran-uzayı dolaylı ışıklandırma (Screen-space indirect lighting, SSIL) <doc_environment_and_post_processing_ssil>`. Tamamen gerçek zamanlıdır ve her türlü yayıcı ışık kaynağını (çıkartmalar dahil) destekler.

source: VoxelGI and SDFGI use a deferred pass to allow for rendering GI at half resolution to improve performance (while still having functional MSAA support).
cs: VoxelGI a SDFGI využívají odložený průchod, aby umožnili vykreslování globálního osvětlení (GI) v polovičním rozlišení pro lepší výkon (a při zachování funkční podpory MSAA).
fr: VoxelGI et SDFGI utilisent une passe différée pour permettre un rendu GI à la moitié de résolution pour améliorer les performances (il y a aussi la fonctionnalité de support MSAA).
ga: Úsáideann VoxelGI agus SDFGI pas iarchurtha chun ligean do GI a dhéanamh ag leath-réiteach chun feidhmíocht a fheabhsú (agus tacaíocht MSAA feidhmiúil a bheith aige fós).
it: VoxelGI e SDFGI utilizzano un passaggio differito per consentire di renderizzare il GI a metà risoluzione per migliorare le prestazioni (pur mantenendo funzionale il supporto per MSAA).
ja: VoxelGIとSDFGIは遅延パスを使用してGIを半分の解像度でレンダリングし、パフォーマンスを向上させます (機能的なMSAAサポートは維持されます) 。
ko: 복쉘GI(VoxelGI)와 부호화 거리 필드 GI(SDFGI)는 성능 향상을 위해 GI를 절반 해상도로 렌더링할 수 있도록 지연 패스를 사용합니다(기능적인 MSAA 지원은 유지됩니다).
pl: VoxelGI i SDFGI używają przejścia odroczonego, aby umożliwić renderowanie GI w połowie rozdzielczości w celu poprawy wydajności (przy zachowaniu funkcjonalnego wsparcia dla MSAA).
ru: VoxelGI и SDFGI использует отложенный проход, чтобы обеспечить возможность рендеринга GI (глобального освещения) при половинном разрешении для улучшения производительности (при сохранении функциональной поддержки MSAA).
ta: செயல்திறனை மேம்படுத்துவதற்காக சி.ஐ.
tr: VoxelGI ve SDFGI, performansı artırmak için (hala işlevsel MSAA desteğini korurken) yarı çözünürlükte GI oluşturmaya izin vermek için ertelenmiş bir geçiş kullanır.

source: **Reflections:**
cs: **Odrazy:**
fr: **Réflexions :**
ga: **Machnamh:**
it: **Riflessi:**
ja: **反射:**
ko: **반사(Reflections)**
pl: **Odbicia:**
ru: **Отражения:**
ta: ** பிரதிபலிப்புகள்: **
tr: **Yansımalar:**

source: Voxel-based reflections (when using GI probes) and SDF-based reflections (when using signed distance field GI). Voxel-based reflections are visible on transparent surfaces, while rough SDF-based reflections are visible on transparent surfaces.
cs: Odrazy založené na voxelech (při použití GI sond) a odrazy založené na SDF (při použiní SDFGI). Voxelové odrazy jsou viditelné na průhledných površích a hrubé SDF odrazy jsou viditelné na průhledných površích.
fr: Réflexions basées sur les voxels (quand elles utilisent les sondes GI) et réflexions basées sur le SDF (quand elles utilisent les Signed Distance Field GI). Ces réflexions basées sur les voxels sont visibles sur les surfaces transparentes, pendant que les réflexions brutes basées sur SDF sont visibles sur des surfaces transparentes.
ga: Machnamh bunaithe ar Voxel (nuair a bhíonn tóireadóirí GI á n-úsáid) agus machnaimh bunaithe ar SDF (nuair a bhíonn gi réimse achar sínithe á úsáid). Tá frithchaitheamh bunaithe ar Voxel le feiceáil ar dhromchlaí trédhearcacha, agus tá frithchaitheamh garbh bunaithe ar SDF le feiceáil ar dhromchlaí trédhearcacha.
ja: ボクセルベースの反射 (GIプローブ使用時) とSDFベースの反射 (符号付き距離フィールドGI使用時) 。ボクセルベースの反射は透明なサーフェスに表示され、SDFベースの粗い反射は透明なサーフェスに表示されます。
ko: 복셀 기반 반사(GI 프로브 사용 시)와 SDF 기반 반사(부호화 디스턴스 필드 GI 사용 시). 복셀 기반 반사는 투명한 표면에서 보이는 반면, 거친 SDF 기반 반사는 불투명한 표면에서 보입니다.
pl: Odbicia oparte na wokselach (podczas korzystania z sond GI) i odbicia oparte na SDF (podczas korzystania z pól GI o oznakowanym polu dystansu). Odbicia oparte na wokselach są widoczne na przezroczystych powierzchniach, tak samo jak odbicia surowo oparte na SDF.
ru: Отражения на основе вокселей (при использовании GI датчиков) и отражения на основе SDF (при использовании GI-поля со знаковыми расстояниями). Отражения на основе вокселей видны на прозрачных поверхностях, а грубые отражения на основе SDF видны на прозрачных поверхностях.
ta: வோக்சல் அடிப்படையிலான பிரதிபலிப்புகள் (சி.ஐ. ஆய்வுகளைப் பயன்படுத்தும் போது) மற்றும் எச்.டி.எஃப் அடிப்படையிலான பிரதிபலிப்புகள் (கையொப்பமிடப்பட்ட தூர புலம் சி.ஐ.யைப் பயன்படுத்தும் போது). வோக்சல் அடிப்படையிலான பிரதிபலிப்புகள் வெளிப்படையான மேற்பரப்புகளில் தெரியும், அதே நேரத்தில் கடினமான SDF- அடிப்படையிலான பிரதிபலிப்புகள் வெளிப்படையான மேற்பரப்புகளில் தெரியும்.
tr: Voxel-tabanlı yansımalar (GI sondaları kullanılırken) ve SDF-tabanlı yansımalar (işaretli mesafe alanı GI kullanıldığında). Voxel tabanlı yansımalar saydam yüzeylerde görülebilirken, kaba SDF tabanlı yansımalar saydam yüzeylerde görülebilir.

source: Fast baked reflections or slow real-time reflections using ReflectionProbe. Parallax box correction can optionally be enabled.
cs: Rychlé vypálené odrazy nebo pomalé odrazy v reálném čase pomocí ReflectionProbe ("odrazová sonda"). Korekci paralaxe lze volitelně povolit.
fr: Réflexions rapides précalculées ou lentes en temps réel à l'aide de ReflectionProbe. La correction du parallaxe peut être activée en option.
ga: Machnamh tapa bácáilte nó machnamh mall fíor-ama ag baint úsáide as ReflectionProbe. Is féidir ceartú bosca Parallax a chumasú go roghnach.
ja: ReflectionProbe を使用した高速ベイクド反射、または低速リアルタイム反射。オプションで視差補正を有効にすることができます。
ko: 빠르게 구워진 반사 또는 ReflectionProbe를 이용한 느린 실시간 반사. 시차 보정을 선택적으로 활성화할 수 있습니다.
pl: Szybkie generowane odbicia lub wolne odbicia w czasie rzeczywistym przy użyciu ReflectionProbe. Opcjonalnie można włączyć korekcję paralaksy.
ru: Быстрые запеченные (baked) отражения или медленные отражение в реальном времени с помощью ReflectionProbe. Параллаксная коррекция может быть включена опционально.
ta: பிரதிபலிப்பு புரோபைப் பயன்படுத்தி வேகமான வேகவாத பிரதிபலிப்புகள் அல்லது மெதுவான நிகழ்நேர பிரதிபலிப்புகள். இடமாறு பெட்டி திருத்தம் விருப்பமாக இயக்கப்படலாம்.
tr: Yansıma sondası, ReflectionProbe, kullanarak hızlı pişirilmiş yansımalar veya yavaş gerçek-zamanlı yansımalar. Paralaks kutu düzeltmesi isteğe bağlı olarak etkinleştirilebilir.

source: Screen-space reflections with support for material roughness.
cs: Odrazy v prostoru obrazovky s podporou hrubosti materiálu.
fr: Réflexions de l'espace écran avec prise en charge de la rugosité des matériaux.
ga: Machnamh ar spás scáileáin le tacaíocht do ghairbhe ábhair.
it: Riflessi nello spazio dello schermo con supporto per la rugosità dei materiali.
ja: マテリアルの粗さをサポートするスクリーンスペース反射。
ko: 머티리얼의 거친 정도를 지원하는 스크린 공간 반사.
pl: Odbicia w przestrzeni ekranu posiadające wsparcie dla chropowatość(roughness) materiału.
ru: Отражения в пространстве экрана с поддержкой шероховатости материала.
ta: பொருள் கடினத்தன்மைக்கு ஆதரவுடன் திரை-விண்வெளி பிரதிபலிப்புகள்.
tr: Malzeme pürüzlülüğü desteği ile ekran-uzayı yansımaları.

source: Reflection techniques can be mixed together for greater accuracy or scalability.
cs: Odrazové techniky lze pro větší přesnost a škálovatelnost kombinovat.
fr: Les techniques de réflexion peuvent être mélangées pour une plus grande précision ou une plus grande évolutivité.
ga: Is féidir teicnící machnaimh a mheascadh le chéile ar mhaithe le cruinneas nó inscálaitheacht níos fearr.
it: Le tecniche di riflessione possono essere mischiate per una migliore accuratezza o scalabilità.
ja: 反射技術は、高い精度とスケーラビリティを共に混在させることができます。
ko: 반사 기술은 더 높은 정확도를 위해 혼합해서 사용할 수 있습니다.
pl: Techniki odbicia mogą być za sobą łączone w celu osiągnięcia większej dokładności.
ru: Методы отражения могут быть смешаны вместе для большей точности или масштабируемости.
ta: பிரதிபலிப்பு நுட்பங்களை அதிக துல்லியம் அல்லது அளவிடுதலுக்காக ஒன்றாக கலக்கலாம்.
tr: Daha fazla doğruluk veya ölçeklenebilirlik için, yansıma teknikleri birlikte kullanılabilirler.

source: When using the Forward+ renderer (default on desktop), reflection probes are rendered with clustered forward optimizations to decrease their individual cost. Clustered rendering also lifts any limits on the number of reflection probes that can be used on a mesh.
cs: Při použití vykreslovacího nástroje Forward+ (výchozí nastavení na desktopových zařízeních) jsou světla vykreslována pomocí sdružených dopředných optimalizací, aby se snížily jejich individuální náklady. Seskupená světla také odstraňují jakákoli omezení na počet světel, která lze aplikovat na síť.
it: Quando si utilizza il renderer Forward+ (predefinito su desktop), le sonde per i riflessi sono renderizzate con ottimizzazioni di tipo "clustered forward" per ridurre il loro costo computazionale individuale. Ciò rimuove anche ogni limite sul numero di sonde per i riflessi che si possono usare su una mesh.
ja: Forward+ レンダラー (デスクトップのデフォルト) を使用する場合、リフレクションプローブは、個々のコストを削減するために、クラスター化された前方最適化を使用してレンダリングされます。クラスター化されたレンダリングでは、メッシュで使用できるリフレクションプローブの数の制限も解除されます。
ko: Forward+ 백엔드(데스크톱에서 디폴트)를 사용할 때, 반사 프로브는 개별 비용을 줄이기 위해 클러스터형 전방 최적화로 렌더링됩니다. 클러스터형 렌더링은 메시에 사용할 수 있는 반사 프로브의 수에 대한 제한도 제거합니다.
ru: При использовании отрисовщика Forward+ (по умолчанию на компьютере), пробы отражений отрисовываются с помощью кластерной прямой оптимизации для снижения их индивидуальной стоимости. Кластерная прямая отрисовка так же снимает любые лимиты на количество датчиков отражений которые могут использоваться в сетке.
ta: முன்னோக்கி+ ரெண்டரர் (டெச்க்டாப்பில் இயல்புநிலை) பயன்படுத்தும் போது, பிரதிபலிப்பு ஆய்வுகள் அவற்றின் தனிப்பட்ட செலவைக் குறைக்க கொத்து முன்னோக்கி மேம்படுத்தல்களுடன் வழங்கப்படுகின்றன. கிளச்டர்டு வழங்குதல் ஒரு கண்ணி மீது பயன்படுத்தக்கூடிய பிரதிபலிப்பு ஆய்வுகளின் எண்ணிக்கையிலும் எந்த வரம்புகளையும் உயர்த்துகிறது.

source: When using the Mobile renderer, up to 8 reflection probes can be displayed per mesh resource. When using the Compatibility renderer, up to 2 reflection probes can be displayed per mesh resource.
cs: Při použití vykreslovacího nástroje Mobile lze na jeden zdroj sítě zobrazit až 8 odrazových sond. Při použití vykreslovacího nástroje Compatibility lze na jeden zdroj sítě zobrazit až 2 odrazové sondy.
fr: Lors de l'utilisation du backend Mobile, jusqu'à 8 sondes de réflexion peuvent être affichées par ressource de maillage. Lors de l'utilisation du backend Compatibilité, jusqu'à 2 sondes de réflexion peuvent être affichées par ressource de maillage.
it: Quando si utilizza il renderer Mobile, è possibile visualizzare fino a 8 sonde di riflessione per risorsa mesh. Quando si utilizza il renderer Compatibilità, è possibile visualizzare fino a 2 sonde di riflessione per risorsa mesh.
ja: Mobile レンダラーを使用する場合、メッシュリソースごとに最大 8 つの反射プローブを表示できます。互換性レンダラーを使用する場合、メッシュ リソースごとに最大 2 つの反射プローブを表示できます。
ko: 모바일 렌더러를 사용하는 경우, 메시 리소스당 최대 8개의 반사 프로브가 표시될 수 있습니다. 호환성 렌더러를 사용하는 경우, 메시 리소스당 최대 2개의 반사 프로브가 표시될 수 있습니다.
ru: При использовании Mobile рендерера на каждый ресурс сетки может быть отображено до 8 зондов отражения. При использовании Compatibility рендерера на каждый ресурс сетки может быть отображено до 2 зондов отражения.
ta: மொபைல் ரெண்டரரைப் பயன்படுத்தும் போது, ஒரு கண்ணி வளத்திற்கு 8 பிரதிபலிப்பு ஆய்வுகள் காண்பிக்கப்படலாம். பொருந்தக்கூடிய ரெண்டரரைப் பயன்படுத்தும் போது, ஒரு கண்ணி வளத்திற்கு 2 பிரதிபலிப்பு ஆய்வுகள் காண்பிக்கப்படலாம்.

source: **Decals:**
cs: **Nálepky:**
fr: **Décalques :**
it: **Decalcomanie:**
ja: **デカール:**
ko: **데칼:**
pl: **Naklejki (decal):**
ru: **Декали:**
ta: ** டெக்கல்கள்: **
tr: **Çıkartmalar:**

source: :ref:`Supports albedo <doc_using_decals>`, emissive, :abbr:`ORM (Occlusion Roughness Metallic)`, and normal mapping.
cs: Podporují :ref:`albedo <doc_using_decals>`, emisní, :abbr:`ORM (Occlusion Roughness Metallic - Zakrytí Hrubost Kovovost)` a normálové mapování.
fr: :ref:`Prend en charge l'albédo <doc_using_decals>`, l'émissif, :abbr:`ORM (Occlusion Roughness Metallic)` et le cartographie des normales.
ga: :ref:`Tacaíonn albedo <doc_using_decals>`, emissive, :abbr:`ORM (Occlusion Roughness Metallic)`, agus gnáthmhapáil.
it: :ref:`Supporta l'albedo <doc_using_decals>`, l'emissivo, :abbr:`ORM (Occlusion Roughness Metallic)` e la mappatura normale.
ja: :ref:`アルベド <doc_using_decals>`、エミッシブ、 :abbr:`ORM (Occlusion Roughness Metallic)` 、法線マッピングをサポートします。
ko: :ref:`알베도 <doc_using_decals>`, 발광, :abbr:`ORM (Occlusion Roughness Metallic)` 및 노멀 매핑을 지원합니다.
ru: :ref:`Поддерживает альбедо <doc_using_decals>`, светимость, :abbr:`ORM (Occlusion Roughness Metallic)`, и карту нормалей.
tr: :ref:`albedo <doc_using_decals>`, yayıcı, :abbr:`ORM (Occlusion Roughness Metallic)`, ve normal haritalamasını destekler.

source: Texture channels are smoothly overlaid on top of the underlying material, with support for normal/ORM-only decals.
cs: Kanály textur hladce překrývají povrch podkladového materiálu s podporou normálových/ORM nálepek.
fr: Les canaux de texture sont superposés de manière fluide sur le matériau sous-jacent, avec prise en charge des décalques normaux/ORM uniquement.
ga: Tá cainéil uigeachta overlaid go réidh ar bharr an ábhair bhunúsach, le tacaíocht do decals gnáth / ORM-amháin.
it: I canali di texture sono sovrapposti senza problemi sopra il materiale sottostante, con supporto per decalcomanie con solo normali/ORM.
ja: テクスチャチャネルは、通常/ORMのみのデカールをサポートし、下にあるマテリアルの上にスムーズにオーバーレイされます。
ko: 텍스처 채널은 기본 머티리얼 위에 부드럽게 오버레이되며, 노멀/ORM 전용 데칼도 지원합니다.
ru: Текстурные каналы плавно накладываются поверх основного материала, с поддержкой normal/ORM декалей.
ta: சாதாரண/ORM- மட்டும் டெக்கல்களுக்கான ஆதரவுடன், அமைப்பு சேனல்கள் அடிப்படை பொருளின் மேல் சீராக மூடப்பட்டுள்ளன.
tr: Doku kanalları, sadece normal/sadece-ORM çıkartmalar için destekle birlikte, altındaki malzemenin üzerine düzgün bir şekilde yerleştirilir.

source: Support for normal fade to fade the decal depending on its incidence angle.
cs: Podpora normálového blednutí pro blednutí nálepek v závislosti na úhlu dopadu.
fr: Prise en charge du fondu normal pour atténuer le décalque en fonction de son angle d'incidence.
ga: Tacaíocht do ghnáth-céimnithe chun an decal a céimnithe ag brath ar a uillinn minicíochta.
it: Supporto per la dissolvenza delle normali per dissolvere la decalcomania a seconda del suo angolo di incidenza.
ja: 入射角に応じてデカールをフェードする標準フェードのサポート。
ko: 입사각에 따라 데칼을 점차적으로 사라지게 하는 노멀 페이드 지원.
ru: Поддержка нормального затухания для декалей, зависящего от угла падения.
ta: டெக்கால் அதன் நிகழ்வு கோணத்தைப் பொறுத்து மங்குவதற்கு சாதாரண மங்கலுக்கான உதவி.
tr: Geliş açısına bağlı olarak çıkartmanın solması için normal solma desteği.

source: Does not rely on runtime mesh generation. This means decals can be used on complex skinned meshes with no performance penalty, even if the decal moves every frame.
cs: Nespoléhají se na generování sítě za běhu. To znamená, že nálepky lze použít na složité sítě se slupkami bez omezení výkonu, i když se nálepka v každém snímku pohybuje.
fr: Ne dépend pas de la génération des maillages à l'exécution. Cela signifie que les décalques peuvent être utilisés sur des maillages complexes sans chute de performance, même si le décalque bouge à chaque trame.
it: Non dipende sulla generazione di mesh durante l'esecuzione. Ciò significa che le decalcomanie si possono utilizzare su mesh complesse senza alcuna penalità sulle prestazioni, anche se le decalcomanie si spostano a ogni frame.
ja: 実行時のメッシュ生成に依存しません。つまりデカールがフレームごとに移動する場合でも、パフォーマンスの低下を招くことなく、複雑なスキン メッシュでデカールを使用できます。
ko: 런타임 메시 생성에 의존하지 않습니다. 즉, 데칼이 매 프레임마다 움직이더라도 복잡한 스킨 메시에 성능 저하 없이 데칼을 사용할 수 있습니다.
ru: Не зависит от генерации сетки во время выполнения. Это означает, что декали (decals) могут использоваться на сложных скиновых сетках без потери производительности, даже если декаль перемещается в каждом кадре.
ta: இயக்க நேர மெச் தலைமுறையை நம்பவில்லை. டெக்கால் ஒவ்வொரு சட்டகத்தையும் நகர்த்தினாலும், செயல்திறன் தண்டம் இல்லாமல் சிக்கலான தோல் மெச்களில் டெக்கால்களைப் பயன்படுத்தலாம்.

source: Support for nearest, bilinear, trilinear or anisotropic texture filtering (configured globally).
cs: Podpora nejbližšího, bilineárního, trilineárního nebo anizotropního filtrování textur (konfigurováno globálně).
fr: Support pour le filtrage de textures au plus proche voisin, bilinéaires, trilinéaires ou anisotropes (configuré globalement).
ga: Tacaíocht do scagadh uigeachta is gaire, bilinear, trilinear nó anisotropic (cumraithe ar fud an domhain).
ja: ニアレスト、バイリニア、トリリニア、または異方性のフィルタリング (大局的に調整される)。
ko: nearest, bilinear, trilinear, anisotropic 텍스처 필터링을 지원합니다 (전역적으로 구성 가능).
pl: Wsparcie dla bliskiego, dwuliniowego, trójliniowego lub anizotropicznego filtrowania (skonfigurowane globalnie).
ru: Поддержка ближайшей, билинейной, трилинейной или анизотропной фильтрации текстур (настраивается глобально).
ta: அருகிலுள்ள, பிலினியர், ட்ரிலினியர் அல்லது அனிசோட்ரோபிக் அமைப்பு வடிகட்டலுக்கான உதவி (உலகளவில் கட்டமைக்கப்பட்டுள்ளது).
tr: En yakın, çift-doğrusal (bilinear), üç-doğrusal (trilinear) veya eş-yönsüz (anizotropik) doku filtreleme desteği (genel olarak yapılandırılır).

source: Optional distance fade system to fade distant decals, improving performance.
cs: Volitelný systém vzdáleného blednutí pro vyblednutí vzdálených nálepek a zlepšení výkonu.
fr: Système optionnel d'atténuation avec la distance pour atténuer les décalques éloignés, améliorant ainsi les performances.
ga: Córas céimnithe achar roghnach chun decals i bhfad i gcéin a céimnithe, feidhmíocht a fheabhsú.
ja: オプションの距離フェードシステムは、遠くにあるデカールをフェードさせ、パフォーマンスを向上できます。
ko: 성능을 향상시키기 위해 먼 거리의 데칼을 점차적으로 사라지게 하는 선택적 거리 페이드 시스템.
pl: Opcjonalny system zanikania odległościowego dla kalkomanii, poprawiający wydajność.
ru: Опциональная система скрытия декалей на расстоянии, улучшает производительность.
ta: விருப்பமான தூர மங்கலான அமைப்பு தொலைதூர டெக்கல்களை மங்கச் செய்து, செயல்திறனை மேம்படுத்துகிறது.
tr: Uzaktaki çıkartmaları soldurmak için isteğe bağlı mesafe soldurma sistemi, performansı artırır.

source: When using the Forward+ renderer (default on desktop), decals are rendered with clustered forward optimizations to decrease their individual cost. Clustered rendering also lifts any limits on the number of decals that can be used on a mesh.
cs: Při použití vykreslovacího nástroje Forward+ (výchozí na nastavení na desktopových zařízeních) jsou nálepky vykreslovány pomocí sdružených dopředných optimalizací, aby se snížily jejich individuální náklady. Seskupené vykreslování také odstraňuje jakákoli omezení na počtu nálepek, které lze aplikovat na síť.
it: Quando si utilizza il renderer Forward+ (predefinito su desktop), le decalcomanie sono renderizzate con ottimizzazioni clusterizzate per ridurre il impatto individuale. Il rendering clusterizzato solleva anche eventuali limiti sul numero di decalcomanie che si possono utilizzare su una mesh.
ja: Forward+ レンダラー (デスクトップのデフォルト) を使用する場合、デカールは個々のコストを削減するために、クラスター化された前方最適化を使用してレンダリングされます。またクラスター化されたレンダリングでは、メッシュで使用できるデカールの数の制限も解除されます。
ko: Forward+ 렌더러(데스크톱에서 디폴트)를 사용할 때 데칼은 클러스터형 포워드 최적화로 렌더링되어 개별 비용을 줄입니다. 클러스터형 렌더링은 또한 메시에서 사용할 수 있는 데칼 수에 대한 제한을 해제합니다.
ru: При использовании рендерера Forward+ (по умолчанию на десктопе) декали рендерятся с кластеризованными оптимизациями вперед для снижения их индивидуальной стоимости. Кластеризованный рендеринг также снимает любые ограничения на количество декалей, которые могут быть использованы на сетке.
ta: முன்னோக்கி+ ரெண்டரர் (டெச்க்டாப்பில் இயல்புநிலை) பயன்படுத்தும் போது, டெக்கல்கள் அவற்றின் தனிப்பட்ட செலவைக் குறைக்க கொத்து முன்னோக்கி மேம்படுத்தல்களுடன் வழங்கப்படுகின்றன. கிளச்டர்டு வழங்குதல் ஒரு கண்ணி மீது பயன்படுத்தக்கூடிய டெக்கல்களின் எண்ணிக்கையிலும் எந்த வரம்புகளையும் உயர்த்துகிறது.
