Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: :ref:`WebSocket <doc_websocket>` client and server, available on all platforms.
cs: Klient a server pro :ref:`WebSocket <doc_websocket>` k dispozici na všech platformách.
fr: Client et serveur :ref:`WebSocket <doc_websocket>`, disponible sur toutes les plateformes.
ga: :ref:`WebSocket <doc_websocket>` cliant agus freastalaí, ar fáil ar gach ardán.
it: Client e server :ref:`WebSocket <doc_websocket>`, disponibili su tutte le piattaforme.
ja: すべてのプラットフォームで利用可能な :ref:`WebSocket <doc_websocket>` クライアントおよびサーバー。
ko: :ref:`WebSocket <doc_websocket>` 모든 플랫폼에서 클라이언트 및 서버 사용 가능.
ru: :ref:`WebSocket <doc_websocket>` клиент и сервер, доступные на всех платформах.
ta: :ref:`WebSocket <doc_websocket>` client and சேவையகம், available on அனைத்தும் platforms.
tr: :ref:`WebSocket <doc_websocket>` istemci ve sunucu, tüm platformlarda kullanılabilir.

source: :ref:`WebRTC <doc_webrtc>` client and server, available on all platforms.
cs: Klient a server pro :ref:`WebRTC <doc_webrtc>` k dispozici na všech platformách.
fr: Client et serveur :ref:`WebRTC <doc_webrtc>`, disponible sur toutes les plateformes.
ga: :ref:`WebRTC <doc_webrtc>` cliant agus freastalaí, ar fáil ar gach ardán.
it: Client e server :ref:`WebRTC <doc_webrtc>`, disponibili su tutte le piattaforme.
ja: すべてのプラットフォームで利用可能な :ref:`WebRTC <doc_webrtc>` クライアントおよびサーバー。
ko: :ref:`WebRTC <doc_webrtc>` 모든 플랫폼에서 클라이언트 및 서버 사용 가능.
ru: :ref:`WebRTC <doc_webrtc>` клиент и сервер, доступные на всех платформах.
ta: :ref:`WebRTC <doc_webrtc>` client and சேவையகம், available on அனைத்தும் platforms.
tr: :ref:`WebRTC <doc_webrtc>` istemci ve sunucu, tüm platformlarda kullanılabilir.

source: Support for :ref:`UPnP <class_UPNP>` to sidestep the requirement to forward ports when hosting a server behind a NAT.
cs: Podpora :ref:`UPnP <class_UPNP>` pro obcházení nutnosti předávání portů při hostování serveru za NAT.
fr: Support d':ref:`UPnP <class_UPNP>` pour éviter l'obligation de forward ports lors de l'hébergement d'un serveur derrière un NAT.
ga: Tacaíocht do :ref:`UPnP <class_UPNP>` chun an ceanglas chun poirt a chur ar aghaidh i leataobh nuair atá freastalaí á óstáil taobh thiar de NAT.
it: Supporto per :ref:`UPnP <class_UPNP>` per aggirare la necessità di inoltrare le porte quando si ospita un server dietro un NAT.
ja: サーバーを NAT の背後でホストする際にポートフォワーディングを不要にする :ref:`UPnP <class_UPNP>` に対応。
ko: NAT 안에서 서버 운영시 포트 포워딩을 사용하기 위한 요구사항인 :ref:`UPnP <class_UPNP>` 지원.
ru: Поддержка :ref:`UPnP <class_UPNP>` для обхода требования проброса портов при размещении сервера за NAT.
ta: இதற்கான ஆதரவு: குறிப்பு: `யுபிஎன்பி <class_upnp>` ஒரு NAT க்குப் பின்னால் ஒரு சேவையகத்தை புரவலன் செய்யும் போது துறைமுகங்களை அனுப்ப வேண்டிய தேவையைத் தவிர்ப்பதற்கு.
tr: NAT arkasında bir sunucu barındırırken bağlantı noktalarını iletme gerekliliğini ortadan kaldırmak için :ref:`UPnP <class_UPNP>`desteği.

source: Internationalization
cs: Internacionalizace
fr: Internationalisation
ga: Idirnáisiúnú
it: Internazionalizzazione
ja: 国際化
ko: 국제화
pl: Internacjonalizacja
ru: Интернационализация
ta: பன்னாட்டுமயமாக்கல்
tr: Uluslararası Kullanılırlık

source: Full support for Unicode including emoji.
cs: Plná podpora Unicode včetně emoji.
fr: Prise en charge complète d'Unicode, y compris les émojis.
ga: Tacaíocht iomlán do Unicode lena n-áirítear emoji.
it: Pieno supporto per Unicode comprese le emoji.
ja: 絵文字を含むUnicodeに完全対応。
ko: 이모지를 포함한 유니코드를 전체 지원합니다.
ru: Полная поддержка Unicode, включая эмодзи.
ta: ஈமோசி உட்பட யூனிகோடுக்கு முழு உதவி.
tr: Emoji dahil Unicode için tam destek.

source: Store localization strings using :ref:`CSV <doc_internationalizing_games>` or :ref:`gettext <doc_localization_using_gettext>`.
cs: Uložte lokalizační řetězce pomocí :ref:`CSV <doc_internationalizing_games>` nebo :ref:`gettext <doc_localization_using_gettext>`.
fr: Enregistrez les chaînes de caractères de localisation en utilisant :ref:`CSV <doc_internationalizing_games>` ou :ref:`gettext <doc_localization_using_gettext>`.
ga: Stóráil teaghráin logánaithe le :ref:`CSV <doc_internationalizing_games>` nó :ref: `gettext <doc_localization_using_gettext>`.
it: Salva le stringhe di localizzazione usando :ref:`CSV <doc_internationalizing_games>` o :ref:`gettext <doc_localization_using_gettext>`.
ja: :ref:`CSV <doc_internationalizing_games>` または :ref:`gettext <doc_localization_using_gettext>` を用いてローカライズ文字列を格納します。
ko: :ref:`CSV <doc_internationalizing_games>` 또는 :ref:`gettext <doc_localization_using_gettext>`\ 를 이용해 현지화 문자열 저장.
pl: Zapisywanie tekstów dla lokalizacji językowych przy użyciu :ref:`CSV <doc_internationalizing_games>` lub :ref:`gettext <doc_localization_using_gettext>`.
ru: Сохранение строк локализации, используя :ref:`CSV <doc_internationalizing_games>` или :ref:`gettext <doc_localization_using_gettext>`.
ta: உள்ளூர்மயமாக்கல் சரங்களை சேமித்து வைக்கவும்: Ref: `CSV <Doc_internationalignignation_games>` OR: Ref: `getText <doc_localization_using_getText>`.
tr: Yerelleştirme dizelerini :ref:`CSV <doc_internationalizing_games>` ya da :ref:`gettext <doc_localization_using_gettext>` kullanarak depolayın.

source: Support for generating gettext POT and PO files from the editor.
cs: Podpora pro generování gettext POT a PO souborů v editoru.
fr: Prise en charge de la génération de fichiers gettext POT et PO dans l'éditeur.
ga: Tacaíocht chun comhaid gettext POT agus PO a ghiniúint ón eagarthóir.
it: Supporto per la generazione di file gettext POT e PO dall'editor.
ja: エディタからの gettext POT および PO ファイルの生成に対応。
ko: 편집기에서 gettext POT 및 PO 파일의 생성을 지원합니다.
ru: Поддержка генерации gettext POT и PO файлов из редактора.
ta: எடிட்டரிடமிருந்து உரைபெறு POT மற்றும் PO கோப்புகளை உருவாக்குவதற்கான உதவி.
tr: Düzenleyiciden gettext POT ve PO dosyaları oluşturma desteği.

source: Use localized strings in your project automatically in GUI elements or by using the ``tr()`` function.
cs: Použijte v projektu lokalizované řetězce v prvcích GUI automaticky nebo pomocí funkce ``tr()``.
fr: Utilisez les chaînes de caractère localisées dans votre projet automatiquement dans les éléments de l'interface graphique ou en utilisant la fonction ``tr()``.
ga: Bain úsáid as teaghráin logánaithe i do thionscadal go huathoibríoch in eilimintí GUI nó tríd an bhfeidhm ''tr()'' a úsáid.
it: Usa stringhe localizzate nel tuo progetto automaticamente negli elementi della GUI o usando la funzione ``tr()``.
ja: プロジェクト内の GUI 要素中で自動的にローカライズされた文字列を使うか、 ``tr()`` 関数を使ってください。
ko: GUI 요소에서 자동으로 또는 ``tr()`` 함수를 사용하여 프로젝트에서 현지화된 문자열을 사용합니다.
pl: Użyj lokalizowanych ciągów w swoim projekcie automatycznie w elementach GUI lub poprzez zastosowanie funkcji ``tr()``.
ru: Используйте локализованные строки в своем проекте автоматически в элементах графического интерфейса или с помощью функции ``tr()``.
ta: உங்கள் திட்டத்தில் உள்ளூர்மயமாக்கப்பட்ட சரங்களை தானாக GUI கூறுகளில் அல்லது `` tr () `` செயல்பாட்டைப் பயன்படுத்துங்கள்.
tr: Projelenizde, yerel dile çevirilmiş metinleri, GUI ögelerinde otomatik şekilde ya da ``tr()`` fonksiyonu ile kullanın.

source: Support for pluralization and translation contexts when using gettext translations.
cs: Podpora pro pluralizaci a kontexty pro překlad při použití gettext překladů.
fr: Prise en charge de la pluralisation et des contextes de traduction en utilisant des traductions gettext.
ga: Tacaíocht do chomhthéacsanna iolraithe agus aistriúcháin agus aistriúcháin á n-úsáid.
it: Supporto per la pluralizzazione e i contesti di traduzione quando si utilizzano le traduzioni gettext.
ja: gettext 翻訳を使用する際、複数形対応およびコンテキスト指定翻訳に対応。
ko: gettext 번역을 사용할 때 복수형 처리와 번역 문맥을 지원합니다.
pl: Obsługa pluralizacji i kontekstów tłumaczeń podczas korzystania z tłumaczeń gettext.
ru: Поддержка множественного числа и контекстов перевода при использовании переводов gettext.
ta: உரைபெறு மொழிபெயர்ப்புகளைப் பயன்படுத்தும் போது பன்மைமயமாக்கல் மற்றும் மொழிபெயர்ப்பு சூழல்களுக்கான உதவி.
tr: gettext çevirilerini kullanırken çoğullaştırma ve çeviri bağlamları için destek.

source: Support for :ref:`bidirectional typesetting <doc_internationalizing_games_bidi>`, text shaping and OpenType localized forms.
cs: Podpora pro :ref:`obousměrnou sazbu <doc_internationalizing_games_bidi>`, tvarování textu a lokalizované OpenType tvary.
fr: Prise en charge de :ref:`la mise en page bidirectionnelle (bidirectional typesetting) <doc_internationalizing_games_bidi>`, le façonnage du texte et les formes localisées OpenType.
ga: Tacaíocht do :ref:`clóchuradóireacht déthreo <doc_internationalizing_games_bidi>`, múnlú téacs agus foirmeacha logánta OpenType.
ja: :ref:`双方向組版 <doc_internationalizing_games_bidi>` 、テキストシェーピング、および OpenType のローカライズ形式に対応。
ko: :ref:`양방향 조판 <doc_internationalizing_games_bidi>`, 텍스트 셰이핑 및 OpenType 현지화 형식을 지원합니다.
ru: Поддержка :ref:`двунаправленной набора текста <doc_internationalizing_games_bidi>`, форматирования текста и локализованных форм OpenType.
ta: இதற்கான ஆதரவு: ref: `இருதரப்பு தட்டச்சுப்பொறி <doc_internationaling_games_bidi>`, உரை வடிவமைத்தல் மற்றும் ஓப்பன்டைப் உள்ளூர்மயமாக்கப்பட்ட வடிவங்கள்.
tr: :ref:`çift yönlü yazı dizgisi <doc_internationalizing_games_bidi>`, metin şekillendirme ve OpenType yerelleştirilmiş biçimler için destek.

source: Automatic UI mirroring for right-to-left locales.
cs: Automatické zrcadlení UI pro pravolevé jazyky.
fr: Mise en miroir automatique de l'interface utilisateur pour les locales de droite à gauche.
ga: Chomhéadain uathoibríoch scáthánú do mhuintir na háite deas go clé.
it: Rispecchiamento automatico dell'interfaccia utente per le localizzazioni da destra a sinistra.
ja: 右から左に読むロケールのための UI 自動ミラーリング。
ko: 오른쪽에서 왼쪽으로 읽는 로케일에 대한 자동 UI 미러링을 지원합니다.
pl: Automatyczne odzwierciedlanie interfejsu użytkownika w ustawieniach regionalnych pisanych od prawej do lewej.
ru: Автоматическое зеркальное отображение пользовательского интерфейса для право-левых локализаций.
ta: வலது-இடது இடங்களுக்கு தானியங்கி இடைமுகம் பிரதிபலிப்பு.
tr: Sağdan-sola yerel ayarlar için otomatik kullanıcı arayüzü yansıtma.

source: Support for pseudolocalization to test your project for i18n-friendliness.
cs: Podpora pseudolokalizace k testování připravenosti vašich projektů pro i18n.
fr: Prise en charge de la pseudo-localisation afin de tester la compatibilité i18n de votre projet.
ga: Tacaíocht do pseudolocalization a thástáil do thionscadal le haghaidh i18n-cairdiúlacht.
it: Supporto per la pseudolocalizzazione per testare la compatibilità con i18n di un progetto.
ja: プロジェクトの国際化 (i18n) 対応のしやすさをテストするための疑似ローカライゼーションをサポート。
ko: 프로젝트의 국제화 친화성을 테스트하기 위한 의사 현지화 지원.
pl: Obsługa pseudolokalizacji w celu przetestowania projektu pod kątem zgodności z protokołem i18n.
ru: Поддержка псевдолокализации для проверки проекта на дружественность к i18n.
ta: I18n- நட்புக்கு உங்கள் திட்டத்தை சோதிக்க சூடோலோகலைசேசனுக்கான உதவி.
tr: Projenizi i18n uyumluluğu açısından test etmek için sözde yerelleştirme desteği.

source: Windowing and OS integration
cs: Integrace oken a operačního systému
fr: Fenêtrage et intégration au systèmes d'exploitation
ga: Fuinneog agus comhtháthú OS
it: Finestre e integrazione del sistema operativo
ja: ウィンドウおよび OS の統合
ko: 윈도우화 및 운영 체제 통합
pl: Integracja okien i systemu operacyjnego
ru: Интеграция с окном и OS
ta: சாளரம் மற்றும் OS ஒருங்கிணைப்பு
tr: Pencereleme ve işletim sistemi bütünleşmesi

source: Spawn multiple independent windows within a single process.
cs: Vytvořte více nezávislých oken uvnitř jednoho procesu.
fr: Créer plusieurs fenêtres indépendantes en un seul processus.
ga: Sceith fuinneoga neamhspleácha iolracha laistigh d'aon phróiseas amháin.
it: Generare più finestre indipendenti in un singolo processo.
ja: 単一プロセス内で複数の独立したウィンドウ生成に対応。
ko: 단일 프로세스 안에서 여러 독립적인 창을 소환합니다.
pl: Utwórz wiele niezależnych okien w ramach jednego procesu.
ru: Создание нескольких независимых окон в рамках одного процесса.
ta: ஒரே செயல்முறைக்குள் பல சுயாதீன சாளரங்களை உருவாக்குங்கள்.
tr: Tek bir işlem içinde birden fazla bağımsız pencere oluşturun.

source: Move, resize, minimize, and maximize windows spawned by the project.
cs: Přesunujtete, měňte velikost, minimalizujte a maximalizujte okna vytvořená projektem.
fr: Déplacez, redimensionnez, minimisez et maximisez la fenêtre créée par le projet.
ga: Bog, athraigh, íoslaghdaigh, agus uasmhéadaigh fuinneoga a sceith an tionscadal.
it: Sposta, ridimensiona, minimizza e massimizza le finestre generate dal progetto.
ja: プロジェクトが生成したウィンドウの移動、サイズ変更、最小化および最大化。
ko: 프로젝트에서 소환한 창 이동, 크기 조정, 최소화 및 최대화.
ru: Перемещайте, изменяйте размер, минимизируйте и увеличивайте окно, созданное проектом.
ta: திட்டத்தால் உருவாக்கப்பட்ட சாளரங்களை நகர்த்தவும், மறுஅளவிடவும், குறைக்கவும் மற்றும் அதிகரிக்கவும்.
tr: Proje tarafından ortaya çıkarılan pencereleri taşıyın, yeniden boyutlandırın, simge durumuna küçültün ve büyütün.

source: Change the window title and icon.
cs: Změňte název a ikonu okna.
fr: Changez le titre et l'icône de la fenêtre.
ga: Athraigh teideal agus deilbhín na fuinneoige.
it: Cambia il titolo e l'icona della finestra.
ja: ウィンドウのタイトルおよびアイコンの変更。
ko: 창 제목 및 아이콘 변경.
pl: Zmień nazwę i ikonę okna.
ru: Изменение заголовка и иконки окна.
ta: சாளர தலைப்பு மற்றும் ஐகானை மாற்றவும்.
tr: Pencere başlığını ve simgesini değiştirin.

source: Request attention (will cause the title bar to blink on most platforms).
cs: Vyžádejte si pozornost (na většině platforem způsobí blikání záhlaví).
fr: Demander l'attention (fera clignoter la barre de titre sur la plupart des plateformes).
ga: Iarr aird (cuirfidh sé faoi deara an barra teidil a chaochadh ar fhormhór na n-ardán).
it: Richiedi attenzione (farà lampeggiare la barra del titolo sulla maggior parte delle piattaforme).
ja: 注意を求める (ほとんどのプラットフォームではタイトルバーが点滅します)。
ko: 주의 요청 (대부분의 플랫폼의 제목표시줄에 깜빡임 발생).
pl: Żądanie uwagi (spowoduje miganie paska tytułu na większości platform).
ru: Запрос внимания (на большинстве платформ приведет к миганию шкал с надписями).
ta: கவனத்தை கோருங்கள் (பெரும்பாலான தளங்களில் தலைப்புப் பட்டி சிமிட்டும்).
tr: Dikkat çekin (çoğu platformda başlık çubuğunun yanıp sönmesine neden olur).

source: Fullscreen mode.
cs: Režim celé obrazovky.
fr: Mode plein écran.
ga: Mód lánscáileáin.
it: Modalità a schermo intero.
ja: 全画面表示モード。
ko: 전체 화면 모드.
pl: Tryb pełnoekranowy.
ru: Полноэкранный режим.
ta: முழுத்திரை பயன்முறை.
tr: Tam ekran kipi.

source: Uses borderless fullscreen by default on Windows for fast alt-tabbing, but can optionally use exclusive fullscreen to reduce input lag.
cs: Na Windows ve výchozím režimu používá maximalizované okno bez okrajů pro rychlé přepínání oken pomocí Alt+Tab, ale může volitelně použít výhradní režim plné obrazovky pro snížení prodlevy vstupu.
fr: Utilise le plein écran sans bordures par défaut sur Windows pour un alt-tab rapide, mais peut aussi utiliser l'écran complet de manière exclusive pour réduire la latence d'entrée.
ga: Úsáideann sé lánscáileán gan teorainn de réir réamhshocraithe ar Windows le haghaidh alt-tabbing tapa, ach is féidir leis lánscáileán eisiach a úsáid go roghnach chun lag ionchuir a laghdú.
it: Utilizza normalmente la modalità a schermo intero senza bordi su Windows per una rapida pressione di alt-tab, ma può facoltativamente utilizzare la modalità a schermo intero esclusiva per ridurre la latenza di input.
ja: Windows では alt-tab ショートカット使用時の高速化のため基本的にボーダーレスフルスクリーンを使用するが、入力遅延の軽減のためオプションで排他的フルスクリーンも選択可能。
ko: 기본적으로 Windows에서 빠른 Alt-탭 전환을 위해 경계 없는 전체 화면을 사용하지만, 선택적으로 입력 지연을 줄이기 위해 독점 전체 화면을 사용할 수 있습니다.
pl: Domyślnie w systemie Windows używany jest tryb pełnoekranowy bez ramek, umożliwiający szybkie przełączanie się między ekranami za pomocą kombinacji klawiszy Alt+Tab, ale opcjonalnie można użyć wyłącznego trybu pełnoekranowego, aby zmniejszyć opóźnienie wprowadzania danych.
ru: По умолчанию в Windows используется полноэкранный режим без рамки для быстрого переключения по alt-табу, но при желании можно использовать эксклюзивный полноэкранный режим для уменьшения задержки ввода.
ta: வேகமான ஆல்ட்-டாப்பிங்கிற்காக சாளரங்களில் முன்னிருப்பாக எல்லையற்ற முழுத்திரை பயன்படுத்துகிறது, ஆனால் உள்ளீட்டு பின்னடைவைக் குறைக்க விருப்பமாக பிரத்யேக முழுமையைப் பயன்படுத்தலாம்.
tr: Hızlı alt-sekme değişimi için Windows'ta varsayılan olarak kenarlıksız tam ekran kullanır, ancak isteğe bağlı olarak giriş gecikmesini azaltmak için özel tam ekran kullanabilir.

source: Borderless windows (fullscreen or non-fullscreen).
cs: Okna bez okrajů (i přes celou obrazovku).
fr: Fenêtre sans bordure (plein écran ou non).
ga: Fuinneoga gan teorainn (lánscáileáin nó neamh-lánscáileáin).
it: Finestre senza bordi (a schermo intero o non).
ja: ボーダーレスウィンドウ (全画面または非全画面)。
ko: 테두리 없는 창 (전체 화면 또는 비 전체 화면).
ru: Окно без рамки (полноэкранное или не полноэкранное).
ta: எல்லையற்ற சாளரங்கள் (முழுத்திரை அல்லது முழு அளவிலான திரை அல்ல).
tr: Kenarlıksız pencereler (tam ekran veya tam ekran olmayan).

source: Ability to keep a window always on top.
cs: Schopnost udržet okno vždy nahoře.
fr: Possibilité de garder la fenêtre toujours visible (par dessus les autres fenêtres).
ga: Cumas fuinneog a choinneáil ar a bharr i gcónaí.
it: Possibilità di mantenere una finestra sempre in primo piano.
ja: ウィンドウを常に最前面に保つ機能。
ko: 창을 항상 위에 두는 기능.
ru: Возможность держать окно всегда поверх других окон.
ta: ஒரு சாளரத்தை எப்போதும் மேலே வைத்திருக்கும் திறன்.
tr: Bir pencereyi her zaman üstte tutabilme özelliği.

source: Global menu integration on macOS.
cs: Globální integrace nabídky v systému macOS.
fr: Intégration au menu global sur macOS.
ga: Comhtháthú roghchlár domhanda ar macOS.
it: Integrazione del menu globale su macOS.
ja: macOS でのグローバルメニュー統合。
ko: macOS에서 전역 메뉴 통합.
pl: Globalna integracja menu w systemie macOS.
ru: Интеграция с глобальным меню в macOS.
ta: MACOS இல் உலகளாவிய பட்டியல் ஒருங்கிணைப்பு.
tr: MacOS'ta genel menü bütünleşmesi.

source: Execute commands in a blocking or non-blocking manner (including running multiple instances of the same project).
cs: Provádějte příkazy blokujícím nebo neblokujícím způsobem (včetně běhu více instancí stejného projektu).
fr: Exécuter les commandes de manière bloquante ou non bloquante (y compris en exécutant plusieurs instances du même projet).
ga: Rith orduithe ar bhealach blocála nó neamhbhlocála (lena n-áirítear cásanna éagsúla den tionscadal céanna a rith).
it: Esecuzione di comandi in modo bloccante o non bloccante (inclusa l'esecuzione di più istanze dello stesso progetto).
ja: ブロッキングまたはノンブロッキングでのコマンド実行 (同一プロジェクトの複数インスタンスの実行も含む)。
ko: 블로킹 또는 비 블로킹 방식으로 명령을 실행합니다 (동일한 프로젝트의 여러 인스턴스를 실행하는 것을 포함).
ru: Выполнять команды блокирующим или неблокирующим образом (включая запуск нескольких экземпляров одного и того же проекта).
ta: தடுப்பு அல்லது தடுக்காத முறையில் கட்டளைகளை இயக்கவும் (ஒரே திட்டத்தின் பல நிகழ்வுகளை இயக்குவது உட்பட).
tr: Komutları engelleyici veya engelleyici olmayan bir şekilde yürütün (aynı projenin birden fazla örneğini çalıştırmak dahil).

source: Open file paths and URLs using default or custom protocol handlers (if registered on the system).
cs: Otevřete cesty k souborům a adresy URL pomocí výchozích nebo vlastních obslužných rutin protokolu (pokud jsou registrovány v systému).
fr: Ouvrez les chemins d'accès aux fichiers et les URL en utilisant les gestionnaires de protocole par défaut ou personnalisés (s'ils sont enregistrés dans le système).
ga: Oscail cosáin chomhaid agus URLanna ag baint úsáide as láimhseálaithe prótacail réamhshocraithe nó saincheaptha (má tá siad cláraithe ar an gcóras).
it: Apri percorsi file e URL utilizzando gestori di protocollo predefiniti o personalizzati (se registrati nel sistema).
ja: デフォルトまたはカスタムのプロトコルハンドラ (システムに登録されている場合) を使用してのファイルパスや URL のオープン。
ko: 기본 또는 (시스템에 등록된) 커스텀 프로토콜 처리를 사용한 파일 위치 및 URL 열기.
pl: Otwieranie ścieżek plików i adresów URL przy użyciu domyślnych lub niestandardowych programów obsługi protokołów (jeśli są zarejestrowane w systemie).
ru: Открытие пути к файлам и URL-адресам с использованием обработчиков протоколов по умолчанию или пользовательских протоколов (если они зарегистрированы в системе).
ta: இயல்புநிலை அல்லது தனிப்பயன் நெறிமுறை கையாளுபவர்களைப் பயன்படுத்தி கோப்பு பாதைகள் மற்றும் முகவரி களைத் திறக்கவும் (கணினியில் பதிவு செய்யப்பட்டால்).
tr: Dosya yollarını ve URL'leri, varsayılan veya özel protokol işleyicileri kullanarak açın (sisteme kayıtlıysa).

source: Parse custom command line arguments.
cs: Používejte vlastní argumenty příkazového řádku.
fr: Analyser les arguments de ligne de commande personnalisés.
ga: Argóintí saincheaptha líne na n-orduithe a pharsáil.
it: Analizza gli argomenti personalizzati della riga di comando.
ja: カスタムのコマンドライン引数をパース。
ko: 사용자 지정 명령줄 인수를 파싱합니다.
pl: Wywoływanie własnych komend wiersza poleceń.
ru: Анализ пользовательских аргументов командной строки.
ta: தனிப்பயன் கட்டளை வரி வாதங்களை அலசுங்கள்.
tr: Özel komut satırı girdi değişkenleri çözümleme.

source: Any Godot binary (editor or exported project) can be :ref:`used as a headless server <doc_exporting_for_dedicated_servers>` by starting it with the ``--headless`` command line argument. This allows running the engine without a GPU or display server.
cs: Jakýkoli binární soubor Godotu (editor nebo exportovaný projekt) lze :ref:`použít jako headless server <doc_exporting_for_dedicated_servers>` spuštěním s argumentem příkazového řádku ``--headless``. To umožňuje spustit engine bez GPU nebo okenního systému.
fr: Tout binaire Godot (éditeur ou projet exporté) peut être :ref:`utilisé comme un serveur sans interface graphique <doc_exporting_for_dedicated_servers>` en le lançant avec l'argument de ligne de commande ``--headless``. Cela permet de faire fonctionner le moteur sans GPU ni serveur d'affichage.
ga: Is féidir aon dhénártha Godot (eagarthóir nó tionscadal easpórtáilte) a :ref:`a úsáid mar fhreastalaí gan cheann <doc_exporting_for_dedicated_servers>` trí é a thosú leis an argóint ordú ``--headless``. Ligeann sé seo an t-inneall a rith gan GPU nó freastalaí taispeána.
it: Qualsiasi eseguibile di Godot (editor o progetto esportato) si può :ref:`utilizzare come server headless <doc_exporting_for_dedicated_servers>` avviandolo con l'argomento ``--headless`` dalla riga di comando. Ciò permette di eseguire il motore senza GPU o server di visualizzazione.
ja: 全ての Godot バイナリ (エディタおよびエクスポートされたプロジェクト) は、コマンドライン引数``--headless``で始めることで :ref:`headlessサーバーとして扱えます<doc_exporting_for_dedicated_servers>`。これにより GPU やディスプレイサーバー無しでエンジンを起動できます.
ko: 아무 Godot 바이너리(편집기 또는 내보낸 프로젝트)도 ``--headless`` 명령줄 인수를 사용하여 :ref:`헤드리스 서버로 사용 <doc_exporting_for_dedicated_servers>`\ 할 수 있습니다. 이를 통해 GPU나 디스플레이 서버 없이 엔진을 실행할 수 있도록 합니다.
ru: Любой бинарник Godot (редактор или экспортированный проект) может быть :ref:`использован в качестве серверного приложения <doc_exporting_for_dedicated_servers>`, если запустить его с аргументом командной строки ``--headless``. Это позволяет запускать движок без отображения.
ta: எந்தவொரு கோடோட் பைனரி (ஆசிரியர் அல்லது ஏற்றுமதி செய்யப்பட்ட திட்டம்) பின்வருமாறு: ref: `தலை இல்லாத சேவையகமாகப் பயன்படுத்தப்படுகிறது <doc_exporting_for_dedicaded_servers>` ``--தலையற்ற` கட்டளை வரி வாதத்துடன் தொடங்குவதன் மூலம். இது சி.பீ.யூ அல்லது காட்சி சேவையகம் இல்லாமல் இயந்திரத்தை இயக்க அனுமதிக்கிறது.
tr: Herhangi bir Godot ikili dosyası (düzenleyici veya dışa aktarılan proje) ``--headless`` komut satırı argümanı ile başlatılarak :ref:`başlıksız bir sunucu olarak <doc_exporting_for_dedicated_servers>` kullanılabilir. Bu, motorun GPU veya görüntü sunucusu olmadan çalıştırılmasına olanak tanır.

source: Mobile
cs: Mobilní
ga: Fón póca
ja: モバイル
ko: 모바일
pl: Mobilny
ru: Мобильные устройства
ta: மொபைல்
tr: Mobil
