Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: In-app purchases on :ref:`Android <doc_android_in_app_purchases>` and :ref:`iOS <doc_plugins_for_ios>`.
cs: Nákupy v aplikaci pro :ref:`Android <doc_android_in_app_purchases>` a :ref:`iOS <doc_plugins_for_ios>`.
fr: Achats In-app sur :ref:`Android<doc_android_in_app_purchases>` et :ref:`iOS <doc_plugins_for_ios>`.
ga: Ceannacháin in-app ar :ref:`Android <doc_android_in_app_purchases>` agus :ref:`iOS <doc_plugins_for_ios>`.
it: Acquisti in-app su :ref:`Android <doc_android_in_app_purchases>` e :ref:`iOS <doc_plugins_for_ios>`.
ja: :ref:`Android <doc_android_in_app_purchases>` および :ref:`iOS <doc_plugins_for_ios>` でのアプリ内購入.
ko: :ref:`Android <doc_android_in_app_purchases>` 및 :ref:`iOS <doc_plugins_for_ios>` 에서의 인앱 구매.
ru: Покупки в приложениях на :ref:`Android <doc_android_in_app_purchases>` и :ref:`iOS <doc_plugins_for_ios>`.
ta: பயன்பாட்டில் கொள்முதல்: குறிப்பு: `Android <doc_android_in_app_purchases>` மற்றும்: ref: `ios <doc_plugins_for_ios>`.
tr: :ref:`Android <doc_android_in_app_purchases>` ve :ref:`iOS <doc_plugins_for_ios>` için uygulama içi satın alımlar.

source: Support for advertisements using third-party modules.
cs: Podpora reklam pomocí modulů třetích stran.
fr: Support des annonces publicitaires en utilisant des modules tiers.
ga: Tacaíocht d'fhógraí ag baint úsáide as modúil tríú páirtí.
it: Supporto per annunci pubblicitari che utilizzano moduli di terze parti.
ja: サードパーティモジュールを利用した広告に対応。
ko: 서드 파티 모듈을 사용한 광고 지원.
pl: Obsługa reklam przy użyciu modułów firm trzecich.
ru: Поддержка рекламы с использованием сторонних модулей.
ta: மூன்றாம் தரப்பு தொகுதிகள் பயன்படுத்தி விளம்பரங்களுக்கான உதவி.
tr: Üçüncü-taraf birimler kullanarak, reklamlar için destek.

source: XR support (AR and VR)
cs: Podpora XR (AR a VR)
fr: Support XR (AR et VR)
ga: Tacaíocht XR (AR agus VR)
it: Supporto XR (AR e VR)
ja: XR (ARおよびVR) に対応
ko: XR 지원 (AR 및 VR)
pl: Wsparcie dla XR (AR i VR)
ru: Поддержка XR (AR и VR)
ta: எக்ச்ஆர் உதவி (ஏ.ஆர் மற்றும் வி.ஆர்)
tr: Arttırılmış gerçeklik (XR) desteği (AR ve VR)

source: Out of the box :ref:`support for OpenXR <doc_setting_up_xr>`.
cs: Vbudovaná :ref:`podpora OpenXR <doc_setting_up_xr>`.
fr: Dès sa sortie :ref:`prise en charge d'OpenXR <doc_setting_up_xr>`.
ga: Amach as an mbosca :ref: `tacaíocht le haghaidh OpenXR <doc_setting_up_xr>`.
it: Supporto pronto all'uso :ref:`per OpenXR <doc_setting_up_xr>`.
ja: 標準で :ref:`OpenXRをサポート <doc_setting_up_xr>` 。
ko: 기본 제공 :ref:`OpenXR 지원 <doc_setting_up_xr>`.
ru: Из коробки :ref:`поддержка OpenXR <doc_setting_up_xr>`.
ta: பெட்டியின் வெளியே: குறிப்பு: `Openxr <ock_setting_up_xr> க்கான ஆதரவு.`.
tr: İçeriğe dahil :ref:`OpenXR için destek <doc_setting_up_xr>`.

source: Including support for popular desktop headsets like the Valve Index, WMR headsets, and Quest over Link.
cs: Včetně podpory populárních desktopových headsetů jako Valve Index, WMR headsety a Quest přes Link.
fr: Comprend la prise en charge des casques les plus populaires tels que le Valve Index, les casques WMR et Quest over Link.
ga: Lena n-áirítear tacaíocht do headsets deisce tóir cosúil leis an Innéacs Comhla, headsets WMR, agus Quest thar Link.
it: Incluso il supporto per i visori più popolari come il Valve Index, i visori WMR, e Quest con Link.
ja: Valve Index、Windows Mixed Reality ヘッドセット、Link 接続の Quest のような主要なデスクトップヘッドセットに対応。
ru: Включает поддержку популярных настольных гарнитур, таких как Valve Index, WMR гарнитуры и Quest over Link.
ta: வால்வு குறியீட்டு, WMR எட்செட்டுகள் மற்றும் குவெச்ட் ஓவர் லிங்க் போன்ற பிரபலமான டெச்க்டாப் எட்செட்களுக்கான உதவி உட்பட.
tr: Valve Index, WMR başlıklar ve Quest over Link gibi popüler masaüstü başlıklar için destek dahil.

source: Support for :ref:`Android-based headsets <doc_deploying_to_android>` using OpenXR through a plugin.
cs: Podpora pro :ref:`Headsety založené na Androidu <doc_deploying_to_android>` při použití OpenXR skrze zásuvný modul.
fr: Prise en charge des :ref:`casques basés sur Android <doc_deploying_to_android>` utilisant OpenXR via un plugin.
it: Supporto per :ref:`visori basati su Android <doc_deploying_to_android>` che utilizzano OpenXR attraverso un'estensione.
ja: プラグインを介して、OpenXRを採用する :ref:`Androidベースのヘッドセット <doc_deploying_to_android>` に対応。
ko: 플러그인을 통해 OpenXR을 사용하는 :ref:`Android 기반 헤드셋 <doc_deploying_to_android>`\ 을 위한 지원.
ru: Поддержка :ref:`Android-based headsets <doc_deploying_to_android>` с использованием OpenXR через плагин.
ta: இதற்கான ஆதரவு: ref: `Android- அடிப்படையிலான எட்செட்டுகள் <doc_deploying_to_android>` ஒரு சொருகி மூலம் Openxr ஐப் பயன்படுத்துதல்.

source: Including support for popular stand alone headsets like the Meta Quest 1/2/3 and Pro, Pico 4, Magic Leap 2, and Lynx R1.
cs: Včetně podpory populárních samostatných headsetů jako Meta Quest 1/2/3 a Pro, Pico 4, Magic Leap 2 a Lynx R1.
fr: Comprend la prise en charge des casques les plus populaires comme le Meta Quest 1/2/3 et Pro, Pico 4, Magic Leap 2, et Lynx R1.
ga: Lena n-áirítear tacaíocht do headsets seastán tóir ina n-aonar cosúil leis an Meta Quest 1/2/3 agus Pro, Pico 4, Magic Leap 2, agus Lynx R1.
it: Incluse il supporto per i visori a sé stanti più popolari come il Meta Quest 1/2/3 e Pro, Pico 4, Magic Leap 2 e Lynx R1.
ja: Meta Quest 1/2/3/Pro、Pico 4、Magic Leap 2 及び Lynx R1 のような主要なスタンドアローンヘッドセットに対応。
ko: 메타 퀘스트 1/2/3 및 Pro, Pico 4, Magic Leap 2, Lynx R1과 같은 인기 독립형 헤드셋을 지원합니다.
ru: Включает поддержку популярных автономных гарнитур, таких как Meta Quest 1/2/3 и Pro, Pico 4, Magic Leap 2, и Lynx R1.
ta: மேவு குவெச்ட் 1/2/3 மற்றும் புரோ, பைக்கோ 4, மேசிக் லீப் 2, மற்றும் லின்க்ச் ஆர் 1 போன்ற பிரபலமான ச்டாண்ட் தனியாக எட்செட்களுக்கான உதவி உட்பட.
tr: Meta Quest 1/2/3 ve Pro, Pico 4, Magic Leap 2 ve Lynx R1 gibi popüler bağımsız başlıklar için destek dahil.

source: Other devices supported through an XR plugin structure.
cs: Další zařízení jsou podporována prostřednictvím XR struktury zásuvných modulů.
fr: Autres appareils pris en charge via des plugins XR.
ga: Gléasanna eile a dtacaítear leo trí struchtúr breiseáin XR.
it: Altri dispositivi supportati attraverso una struttura di estensioni XR.
ja: XRプラグイン機構を介してその他のデバイスに対応。
ko: XR 플러그인 구조를 통해 지원되는 기타 장치.
pl: Inne urządzenia obsługiwane poprzez strukturę wtyczki XR.
ru: Другие устройства, поддерживаемые через структуру плагинов XR.
ta: எக்ச்ஆர் சொருகி அமைப்பு மூலம் ஆதரிக்கப்படும் பிற சாதனங்கள்.
tr: XR eklenti yapısı aracılığıyla desteklenen diğer cihazlar.

source: Various advanced toolkits are available that implement common features required by XR applications.
cs: K dispozici jsou různé pokročilé sady nástrojů, které implementují běžné funkce požadované aplikacemi XR.
fr: Diverses boîtes à outils avancées sont disponibles qui implémentent les fonctionnalités communes requises par les applications XR.
ga: Tá sraitheanna uirlisí éagsúla chun cinn ar fáil a chuireann gnéithe coitianta a theastaíonn ó fheidhmchláir XR i bhfeidhm.
it: Vari toolkit avanzati sono disponibili che implementano le funzionalità comuni richieste dalle applicazioni XR.
ja: XR アプリケーションに必要な共通機能が実装された高度なツールキットが多数使用可能。
ko: XR 애플리케이션에 필요한 공통 기능을 구현하는 다양한 고급 툴킷을 사용할 수 있습니다.
pl: Dostępne są różne zaawansowane zestawy narzędzi, które wdrażają typowe funkcje wymagane przez aplikacje XR.
ru: Доступны различные расширенные наборы инструментов, реализующие общие функции, необходимые для приложений XR.
ta: எக்ச்ஆர் பயன்பாடுகளுக்குத் தேவையான பொதுவான அம்சங்களை செயல்படுத்தும் பல்வேறு மேம்பட்ட கருவித்தொகுப்புகள் கிடைக்கின்றன.
tr: XR uygulamalarının gerektirdiği ortak özellikleri uyarlayan çeşitli gelişmiş araç setleri mevcuttur.

source: GUI system
cs: GUI systém
fr: Interface Graphique (GUI)
ga: Córas grafach
it: Sistema GUI
ja: GUI システム
ko: GUI 시스템
pl: System interfejsu
ru: Система графического интерфейса
ta: GUI அமைப்பு
tr: Arayüz (GUI) sistemi

source: Godot's GUI is built using the same Control nodes used to make games in Godot. The editor UI can easily be extended in many ways using add-ons.
cs: Grafické uživatelské rozhraní Godotu je vytvořeno pomocí stejných uzlů ovládacích prvků, které se používají při vytváření her v Godotu. Uživatelské rozhraní editoru lze snadno mnoha způsoby rozšířit pomocí doplňků.
fr: L'interface graphique de Godot est construite en utilisant les mêmes nœuds Control que ceux utilisés pour créer des jeux dans Godot. L'interface utilisateur de l'éditeur peut facilement être étendue de nombreuses façons à l'aide d'add-ons.
ga: Tá GUI Godot tógtha ag baint úsáide as na nóid Rialaithe céanna a úsáidtear chun cluichí a dhéanamh i Godot. Is féidir UI an eagarthóra a leathnú go héasca ar go leor bealaí ag baint úsáide as forlíontáin.
it: La GUI di Godot è costruita utilizzando gli stessi nodi Control usati per creare giochi in Godot. L'interfaccia utente dell'editor può essere facilmente estesa in molti modi utilizzando i componenti aggiuntivi.
ja: Godot の GUI は、Godot でゲームを作るのに使用するのと同じ Control ノードを使って構築されています。エディタの UI はアドオンを使って簡単に様々な方法で拡張することができます。
ko: Godot의 GUI는 Godot에서 게임을 만들 때 사용되는 것과 같은 동일한 컨트롤 노드를 사용해 빌드되었습니다. 편집기 UI는 애드온을 사용하여 다양한 방법으로 쉽게 확장할 수 있습니다.
pl: Interfejs graficzny Godot jest zbudowany przy użyciu tych samych węzłów (Control nodes), których używa się podczas projektowania gry w Godot. Sam edytor można bezproblemowo rozszerzyć na wiele sposobów za pomocą dodatków (add-ons).
ru: Графический интерфейс Godot построен с использованием тех же узлов Control, что используются для создания игр в Godot. Пользовательский интерфейс редактора можно легко расширить многими способами с помощью аддонов.
ta: கோடோட்டில் விளையாட்டுகளை உருவாக்கப் பயன்படுத்தப்படும் அதே கட்டுப்பாட்டு முனைகளைப் பயன்படுத்தி கோடோட்டின் GUI கட்டப்பட்டுள்ளது. ஆசிரியர் இடைமுகம் ஐ துணை நிரல்களைப் பயன்படுத்தி பல வழிகளில் எளிதாக நீட்டிக்க முடியும்.
tr: Godot'nun grafik kullanıcı arayüzü (GUI), Godot'da oyun yapmak için kullanılan aynı denetim düğümlerini kullanarak oluşturulmuştur. Düzenleyici kullanıcı arayüzü, eklentiler kullanılarak çeşitli şekillerde kolayca genişletilebilir.

source: **Nodes:**
cs: **Uzly:**
fr: **Nœuds :**
ga: **Nóid:**
it: **Nodi:**
ja: **ノード:**
ko: **노드:**
pl: **Węzły:**
ru: **Узлы:**
ta: ** முனைகள்: **
tr: **Düğümler:**

source: Buttons.
cs: Tlačítka.
fr: Boutons.
ga: Cnaipí.
it: Pulsanti.
ja: ボタン。
ko: 버튼.
pl: Przyciski.
ru: Кнопки.
ta: பொத்தான்கள்.
tr: Düğmeler.

source: Checkboxes, check buttons, radio buttons.
cs: Zaškrtávací políčka, zaškrtávací tlačítka, přepínací tlačítka.
fr: Cases à cocher, boutons à cocher, boutons radio.
ga: Ticbhoscaí, cnaipí seiceála, cnaipí raidió.
it: Caselle di controllo, pulsanti di conferma, pulsanti a scelta multipla.
ja: チェックボックス、チェックボタン、ラジオボタン。
ko: 체크박스, 체크 버튼, 라디오 버튼.
pl: Pola wyboru, przyciski wyboru, przyciski radiowe.
ru: Флажки, кнопки-переключатели, переключатели.
ta: தேர்வுப்பெட்டிகள், சரிபார்க்கவும் பொத்தான்கள், ரேடியோ பொத்தான்கள்.
tr: Onay kutuları, onay düğmeleri, radyo düğmeleri.

source: Text entry using :ref:`class_LineEdit` (single line) and :ref:`class_TextEdit` (multiple lines). TextEdit also supports code editing features such as displaying line numbers and syntax highlighting.
cs: Zadání textu pomocí :ref:`class_LineEdit` (jeden řádek) a :ref:`class_TextEdit` (více řádků). TextEdit také podporuje funkce úpravy kódu, jako je zobrazení čísel řádků a zvýraznění syntaxe.
fr: Saisie de texte à l'aide de :ref:`class_LineEdit` (une seule ligne) et :ref:`class_TextEdit` (plusieurs lignes). TextEdit prend également en charge les fonctions d'édition de code telles que l'affichage des numéros de ligne et la coloration syntaxique.
ga: Iontráil téacs ag baint úsáide as :ref:'class_LineEdit' (líne amháin) agus :ref:'class_TextEdit' (illínte). Tacaíonn TextEdit freisin le gnéithe eagarthóireachta cód ar nós uimhreacha líne a thaispeáint agus aibhsiú comhréire.
it: Inserimento di testo tramite :ref:`class_LineEdit` (riga singola) e :ref:`class_TextEdit` (righe multiple). TextEdit supporta anche alcune funzionalità di modifica del codice, come la visualizzazione dei numeri di riga e l'evidenziazione della sintassi.
ja: :ref:`class_LineEdit` (一行)及び :ref:`class_TextEdit` (複数行)を使用したテキスト入力。TextEdit は行番号表示やシンタックスハイライトのようなコード編集機能にも対応。
ko: :ref:`class_LineEdit` (한 줄) 및 :ref:`class_TextEdit`\ (여러 줄)을 사용하여 텍스트를 입력합니다. TextEdit는 행 번호 표시 및 구문 강조 표시와 같은 코드 편집 기능도 지원합니다.
ru: Ввод текста с помощью :ref:`class_LineEdit` (одна строка) и :ref:`class_TextEdit` (несколько строк). TextEdit также поддерживает функции редактирования кода, такие как отображение номеров строк и подсветка синтаксиса.
ta: உரை நுழைவு: ref: `class_lineedit` (ஒற்றை வரி) மற்றும்: ref:` class_textedit` (பல கோடுகள்). வரி எண்களைக் காண்பித்தல் மற்றும் தொடரியல் சிறப்பியல்பு போன்ற குறியீடு திருத்துதல் அம்சங்களையும் டெக்ச்டெடிட் ஆதரிக்கிறது.
tr: :ref:`class_LineEdit` (tek satırlı) ve :ref:`class_TextEdit` (çok satırlı) kullanarak metin girişi. TextEdit ayrıca satır numaralarını görüntüleme ve sözdizimi vurgulama gibi kod düzenleme özelliklerini de destekler.

source: Dropdown menus using :ref:`class_PopupMenu` and :ref:`class_OptionButton`.
cs: Rozbalovací nabídky pomocí :ref:`class_PopupMenu` a :ref:`class_OptionButton`.
fr: Menus déroulants avec :ref:`class_PopupMenu` et :ref:`class_OptionButton`.
ga: Biachláir anuas ag baint úsáide as :ref:'class_PopupMenu' agus :ref:'class_OptionButton'.
it: Menu a tendina utilizzando :ref:`class_PopupMenu` e :ref:`class_OptionButton`.
ja: :ref:`class_PopupMenu` と :ref:`class_OptionButton` を使ったドロップダウンメニュー。
ko: :ref:`class_PopupMenu`\ 와 :ref:`class_OptionButton`\ 을 사용하는 드롭다운 메뉴.
ru: Выпадающие меню с помощью :ref:`class_PopupMenu` и :ref:`class_OptionButton`.
ta: கீழ்தோன்றும் மெனுக்கள்: ref: `class_popupmenu` மற்றும்: ref:` class_optionButton`.
tr: :ref:`class_PopupMenu` ve :ref:`class_OptionButton` kullanarak açılır menüler.

source: Scrollbars.
cs: Posuvníky.
fr: Barres de défilement.
ga: Scrollbharra.
it: Barre di scorrimento.
ja: スクロールバー。
ko: 스크롤바.
pl: Paski przewijania.
ru: Полосы прокрутки.
ta: சுருள் பார்கள்.
tr: Kaydırma çubukları.

source: Labels.
cs: Popisky.
fr: Étiquettes (Labels).
ga: Lipéid.
it: Etichette.
ja: ラベル。
ko: 레이블.
pl: Labels (Etykiety).
ru: Ярлыки.
ta: லேபிள்கள்.
tr: Etiketler.

source: RichTextLabel for :ref:`text formatted using BBCode <doc_bbcode_in_richtextlabel>`, with support for animated custom effects.
cs: RichTextLabel pro :ref:`text formátovaný pomocí BBCode <doc_bbcode_in_richtextlabel>` s podporou pro vlastní animované efekty.
fr: RichTextLabel pour :ref:`texte formaté en utilisant le BBCode <doc_bbcode_in_richtextlabel>`, avec la prise en charge d'effets animés personnalisés.
ga: RichTextLabel le haghaidh :ref:`text formatted ag baint úsáide as BBCode <doc_bbcode_in_richtextlabel>`, le tacaíocht d'éifeachtaí saincheaptha beoite.
it: RichTextLabel per :ref:`testo formattato usando il BBCode <doc_bbcode_in_richtextlabel>`, con supporto per effetti animati personalizzati.
ja: :ref:`BBCodeでフォーマットされたテキスト用の <doc_bbcode_in_richtextlabel>` RichTextLabel、アニメーションのカスタムエフェクトに対応。
ko: RichTextLabel은 :ref:`text formatted using BBCode <doc_bbcode_in_richtextlabel>`\ 를 위한 것으로, 애니메이션화된 커스텀 효과를 지원합니다.
ru: RichTextLabel для :ref:`текста, отформатированного с использованием BBCode <doc_bbcode_in_richtextlabel>`, с поддержкой анимированных пользовательских эффектов.
ta: இதற்கான ரிச் டெக்ச்ட்லேபிள்: குறிப்பு: அனிமேசன் செய்யப்பட்ட தனிப்பயன் விளைவுகளுக்கான ஆதரவுடன் `பிப்கோட் <doc_bbcode_in_in_richtextlabel>` ஐப் பயன்படுத்தி உரை வடிவமைக்கப்பட்டுள்ளது.
tr: Canlandırılabilen özel efekt desteği bulunan, :ref:`BBCode kullanılarak biçimlendirilmiş metin <doc_bbcode_in_richtextlabel>` için RichTextLabel.

source: Trees (can also be used to represent tables).
cs: Stromy (mohou být také použity pro reprezentaci tabulek).
fr: Arbres (Tree) (peuvent également être utilisés pour représenter des tableaux).
ga: Crainn (is féidir iad a úsáid freisin chun táblaí a léiriú).
it: Trees (Alberi) (possono essere utilizzati anche per rappresentare tabelle).
ja: ツリー (表の表現にも使えます)。
ko: 트리 (표를 표현할 때에도 사용 가능).
pl: Drzewa (mogą być również używane do reprezentowania tablic).
ru: Деревья (также могут использоваться для представления таблиц).
ta: மரங்கள் (அட்டவணைகள் குறிக்கவும் பயன்படுத்தலாம்).
tr: Ağaçlar (listeleri temsil etmek için de kullanılabilir).

source: Color picker with RGB and HSV modes.
cs: Výběr barvy s režimy RGB a HSV.
fr: Un sélectionneur de couleur avec les modes RGB et HSV.
ga: Roghnóir dath le modhanna RGB agus HSV.
it: Selettore di colori con modalità RGB e HSV.
ja: RGB モードと HSV モードを持つカラーピッカー。
ko: RGB와 HSV 모드를 포함한 색상 선택기.
pl: Możliwość wyboru koloru (color picker) za pomocą trybu RGB lub HSV.
ru: Подборщик цвета с RGB и HSV режимами.
ta: RGB மற்றும் HSV முறைகளுடன் வண்ண எடுப்பவர்.
tr: RGB ve HSV kipleri ile renk seçici.

source: Controls can be rotated and scaled.
cs: Ovládací prvky lze otáčet a měnit jejich měřítko.
fr: Les contrôles peuvent être tournés et étirés.
ga: Is féidir rialuithe a rothlú agus a scála.
it: I nodi Control possono essere ruotati e ridimensionati.
ja: Control は回転と拡大縮小が可能。
ko: 컨트롤은 회전하거나 크기를 키울 수 있습니다.
pl: Elementy sterujące można obracać i skalować.
ru: Элементы управления можно вращать и масштабировать.
ta: கட்டுப்பாடுகளை சுழற்றி அளவிடலாம்.
tr: Denetimler döndürülebilir ve ölçeklenebilir.

source: **Sizing:**
cs: **Změna velikosti:**
fr: **Dimensionnement :**
ga: ** Méid: **
it: **Dimensionamento:**
ja: **サイズ変更:**
ko: **크기 조절:**
pl: **Zmiany rozmiaru:**
ru: **Изменение размера:**
ta: ** அளவிடுதல்: **
tr: **Boyutlandırma:**

source: Anchors to keep GUI elements in a specific corner, edge or centered.
cs: Ukotvení pro uchycení prvků GUI v určitém rohu, u konkrétní hrany nebo na středu.
fr: Des ancres pour maintenir les éléments de l'interface graphique dans un coin spécifique, un bord ou au centre.
ga: Anchors a choinneáil eilimintí GUI i gcúinne ar leith, imeall nó dírithe.
it: Ancore per mantenere gli elementi della GUI in un specifico angolo, bordo o centrato.
ja: GUI 要素を特定のコーナー、エッジ、または中央に配置するためのアンカー。
ko: GUI 요소를 특정 코너, 에지 또는 중앙에 고정하는 앵커.
pl: Kotwice trzymające elementy graficznego interfejsu użytkownika w wybranych rogach, krawędziach, albo wyśrodkowane.
ru: Якоря для удержания элементов графического интерфейса в определённом углу, краю или по центру.
ta: GUI கூறுகளை ஒரு குறிப்பிட்ட மூலையில், விளிம்பு அல்லது மையமாக வைத்திருக்க நங்கூரங்கள்.
tr: GUI ögelerini belirli bir köşede, kenarda, veya merkeze ortalanmış tutmak için çapalar.

source: Containers to place GUI elements automatically following certain rules.
cs: Kontejnery pro umístění prvků grafického uživatelského rozhraní podle daných pravidel.
fr: Conteneurs pour placer automatiquement les éléments de l'interface graphique en suivant certaines règles.
ga: Coimeádáin chun eilimintí GUI a chur go huathoibríoch ag leanúint rialacha áirithe.
it: Contenitori per posizionare automaticamente gli elementi della GUI seguendo determinate regole.
ja: 特定のルールに従って UI 要素を自動配置するコンテナ。
ko: 일정한 규칙에 따라 GUI 요소들을 자동으로 배치하는 컨테이너.
pl: Kontenery do automatycznego umieszczania elementów GUI podlegają określonym regułom.
ru: Контейнеры для автоматического размещения элементов графического интерфейса (GUI).
ta: GUI கூறுகளை வைக்க சில விதிகளைப் பின்பற்றும் கொள்கலன்கள்.
tr: GUI ögelerini, belirli kuralları takip edecek şekilde, otomatik olarak yerleştirmek için taşıyıcılar.

source: :ref:`Stack <class_BoxContainer>` layouts.
cs: :ref:`Krabicové <class_BoxContainer>` rozvržení.
fr: Agencement en :ref:`Pile <class_BoxContainer>`.
ga: :ref:`Stack <class_BoxContainer>` leagan amach.
it: Disposizione a :ref:`Stack<class_BoxContainer>`.
ja: :ref:`スタック <class_BoxContainer>`\ レイアウト。
ko: :ref:`Stack <class_BoxContainer>` 레이아웃.
pl: :ref:`Stos <class_BoxContainer>`.
ru: :ref:`Stack <class_BoxContainer>`.
ta: : குறிப்பு: `ச்டேக் <வகுப்பு பெட்டி கொள்கலன்>` தளவமைப்பு.
tr: :ref:`Yığın <class_BoxContainer>` yerleşim düzenleri.

source: :ref:`Grid <class_GridContainer>` layouts.
cs: :ref:`Mřížkové <class_GridContainer>` rozvržení.
fr: Agencement en :ref:`Grille <class_GridContainer>`.
ga: :ref:`Greille <class_GridContainer>` leagan amach.
it: Disposizione a :ref:`Griglia <class_GridContainer>`.
ja: :ref:`グリッド <class_GridContainer>`\ レイアウト。
ko: :ref:`Grid <class_GridContainer>` 레이아웃.
pl: :ref:`Siatka <class_GridContainer>`.
ru: :ref:`Grid <class_GridContainer>`.
ta: : சிவப்பு: `கட்டம் <வகுப்பு கட்டம் கொள்கலன்>` தளவமைப்பு.
tr: :ref:`Izgara <class_GridContainer>` yerleşim düzenleri.

source: :ref:`Flow <class_FlowContainer>` layouts (similar to autowrapping text).
cs: :ref:`Plovoucí <class_FlowContainer>` rozvržení (podobné automaticky zalamovanému textu).
fr: Disposition en :ref:`Flux <class_FlowContainer>` (similaire à l'habillage automatique d'un texte).
ga: :ref:`Sreabhadh <class_FlowContainer>` leagan amach (cosúil le huathfhillteán téacs).
it: Layout di :ref:`flusso <class_FlowContainer>` (simile al testo con avvolgimento automatico).
ja: :ref:`フロー <class_FlowContainer>` レイアウト (テキストの自動改行に類似)。
ko: :ref:`Flow <class_FlowContainer>` 레이아웃. (텍스트 자동완성과 비슷함).
ru: :ref:`Flow <class_FlowContainer>` (аналогичен автоматическому переносу текста).
ta: : ref: `ஓட்டம் <வகுப்பு ஓட்டம் கொள்கலன்>` தளவமைப்பு (ஆட்டோ மடக்குதல் உரையைப் போன்றது).
tr: :ref:`Akış <class_FlowContainer>`düzenleri (metni otomatik sarmaya benzer).

source: :ref:`Margin <class_MarginContainer>`, :ref:`centered <class_CenterContainer>` and :ref:`aspect ratio <class_AspectRatioContainer>` layouts.
cs: Rozvržení podle :ref:`okrajů <class_MarginContainer>`, :ref:`centrované <class_CenterContainer>` a :ref:`poměru stran <class_AspectRatioContainer>`.
fr: Dispositions :ref:`Marge <class_MarginContainer>`, :ref:`centrée <class_CenterContainer>` et :ref:`conservation des proportions <class_AspectRatioContainer>`.
ga: :ref:`Margin <class_MarginContainer>`, :ref:`lárnaithe <class_CenterContainer>` agus :ref:`cóimheas gné <class_AspectRatioContainer>` leagan amach.
it: Layout di :ref:`margine <class_MarginContainer>`, :ref:`centrati <class_CenterContainer>`, e che :ref:`mantengono le proporzioni <class_AspectRatioContainer>`.
ja: :ref:`マージン <class_MarginContainer>` 、 :ref:`センター <class_CenterContainer>` 及び :ref:`アスペクト比 <class_AspectRatioContainer>` レイアウト。
ko: :ref:`Margin <class_MarginContainer>` , :ref:`centered <class_CenterContainer>` 및 :ref:`aspect ratio <class_AspectRatioContainer>` 레이아웃.
ru: Макеты :ref:`Margin <class_MarginContainer>`, :ref:`centered <class_CenterContainer>` и :ref:`aspect ratio <class_AspectRatioContainer>`.
tr: :ref:`Kenar boşluğu<class_MarginContainer>`, :ref:`merkezli <class_CenterContainer>` and :ref:`en boy oranı <class_AspectRatioContainer>` düzenleri.

source: :ref:`Draggable splitter <class_SplitContainer>` layouts.
cs: Rozvržení :ref:`s táhnutelným oddělovačem <class_SplitContainer>` .
fr: Disposition avec un :ref:`Conteneur divisable <class_SplitContainer>`.
ga: :ref:`Slitter inscriosta <class_SplitContainer>` leagan amach.
it: Disposizione con :ref:`Divisore trascinabile <class_SplitContainer>`.
ja: :ref:`ドラッグ可能な分割(スプリッタ) <class_SplitContainer>` レイアウト。
ko: :ref:`Draggable splitter <class_SplitContainer>` 레이아웃.
ru: :ref:`Переносимый разделитель <class_SplitContainer>`.
ta: : குறிப்பு: `இழுக்கக்கூடிய ச்ப்ளிட்டர் <class_splitcontainer>` தளவமைப்புகள்.
tr: :ref:`Taşınabilir ayırıcı <class_SplitContainer>` yerleşim düzenleri.
