Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/list_of_features.po
Languages: cs, fr, ga, it, ja, ko, pl, ru, ta, tr

source: Full support for the C# 12.0 syntax and features.
cs: Kompletní podpora syntaxe a funkcí C# 12.0.
fr: Support complet de la syntaxe et des fonctionnalités du C# 12.0.
it: Pieno supporto per la sintassi e le funzionalità di C# 12.0.
ja: C# 12.0 構文と機能を完全サポート。
ko: C# 12.0의 구문과 기능을 모두 지원합니다.
ru: Полная поддержка синтаксиса и функций C# 12.0.
ta: சி# 12.0 தொடரியல் மற்றும் அம்சங்களுக்கான முழு உதவி.

source: Supports Windows, Linux, and macOS. Since Godot 4.2, experimental support for Android and iOS is also available.
cs: Podporuje Windows, Linux a macOS. Od Godotu 4.2 je dostupná experimentální podpora pro Android a iOS.
fr: Prend en charge Windows, Linux et MacOS. À compter de la version 4.2, un support expérimental pour Android et iOS est aussi disponible.
it: Supporta Windows, Linux e macOS. A partire da Godot 4.2, è disponibile anche il supporto sperimentale per Android e iOS.
ja: Windows、Linux、macOS をサポートします。Godot 4.2 以降では、Android と iOS の実験的なサポートも利用できます。
ko: Windows, Linux, macOS를 지원합니다. 4.2 버전부터는 Android 및 iOS에 대한 실험적 지원도 가능합니다.
pl: Wspiera systemy Windows, Linux i macOS. Od wersji Godot 4.2 dostępne jest również eksperymentalne wsparcie dla systemów Android i iOS.
ru: Поддерживает Windows, Linux и macOS. Начиная с Godot 4.2, также доступна экспериментальная поддержка Android и iOS.
ta: சாளரங்கள், லினக்ச் மற்றும் மேகோச் ஆகியவற்றை ஆதரிக்கிறது. கோடோட் 4.2 முதல், ஆண்ட்ராய்டு மற்றும் ஐஇமு க்கான சோதனை ஆதரவும் கிடைக்கிறது.

source: On the iOS platform only some architectures are supported: ``arm64``.
cs: Pro platformu iOS jsou podporovány pouze některé architektury: ``arm64``.
fr: Sur iOS, seule quelques architectures sont supportées : ``arm64``.
ga: Ar an ardán iOS ní thacaítear ach le roinnt ailtireachtaí: ''arm64''.
it: Sulla piattaforma iOS sono supportate solo alcune architetture: ``arm64``.
ja: iOSプラットフォームでは、一部のアーキテクチャのみ対応しています: ``arm64`` 。
ko: iOS 플랫폼에서는 ``arm64`` 아키텍처만 지원됩니다.
pl: Na platformie ios obsługiwane są tylko niektóre architektury: ``arm64``.
ru: На платформе iOS поддерживаются только некоторые архитектуры: ``arm64``.
ta: ஐஇமு இயங்குதளத்தில் சில கட்டமைப்புகள் மட்டுமே ஆதரிக்கப்படுகின்றன: `` ARM64``.
tr: iOS platformunda sadece bazı mimariler desteklenmektedir: ``arm64``.

source: The web platform is currently unsupported. To use C# on that platform, consider Godot 3 instead.
cs: Webová platforma v současnosti není podporována. Pro použití C# na webu zvažte využít Godot 3.
fr: La plateforme web n'est actuellement pas supportée. Pour utiliser C# sur cette plateforme, envisagez plutôt Godot 3.
ga: Ní thacaítear leis an ardán gréasáin faoi láthair. Chun C # a úsáid ar an ardán sin, smaoinigh ar Godot 3 ina ionad.
it: La piattaforma web non è attualmente supportata. Per utilizzare C# su questa piattaforma, si consiglia di utilizzare Godot 3.
ja: 現在、Webプラットフォームではサポートされていません。そのプラットフォームでC#を使用する場合は、代わりにGodot 3を検討してください。
ko: 웹 플랫폼은 현재 지원되지 않습니다. 해당 플랫폼에서 C#을 사용하려면 Godot 3을 고려하세요.
pl: Platforma internetowa nie jest obecnie obsługiwana. Aby używać języka C# na tej platformie, rozważ użycie Godota 3.
ru: Веб-платформа в настоящее время не поддерживается. Чтобы использовать C# на этой платформе, используйте Godot 3.
ta: வலை தளம் தற்போது ஆதரிக்கப்படவில்லை. அந்த மேடையில் சி# ஐப் பயன்படுத்த, அதற்கு பதிலாக கோடோட் 3 ஐக் கவனியுங்கள்.
tr: Web platformu şu anda desteklenmemektedir. Bu platformda C# kullanmak için bunun yerine Godot 3'ü düşünün.

source: Using an external editor is recommended to benefit from IDE functionality.
cs: Doporučujeme používat externí editor, abyste mohli využívat funkce IDE.
fr: Il est recommandé d'utiliser un éditeur externe pour bénéficier des fonctionnalités d'un IDE.
ga: Moltar úsáid a bhaint as eagarthóir seachtrach chun leas a bhaint as feidhmiúlacht IDE.
it: Si consiglia di utilizzare un editor esterno per beneficiare della funzionalità IDE.
ja: IDE の機能を利用できるため、外部エディタの使用をおすすめします。
ko: IDE 기능을 활용하려면 외부 편집기 사용을 권장합니다.
pl: Używanie zewnętrznego edytora jest rekomendowane, by korzystać z wszystkich funkcjonalności IDE.
ru: Для использования функциональных возможностей IDE рекомендуется использовать внешний редактор.
ta: வெளிப்புற எடிட்டரைப் பயன்படுத்துவது IDE செயல்பாட்டிலிருந்து பயனடைய பரிந்துரைக்கப்படுகிறது.
tr: IDE işlevselliğinden yararlanmak için, harici bir düzenleyici kullanılması önerilir.

source: **GDExtension (C, C++, Rust, D, ...):**
ga: **GDExtension (C, C ++, Meirge, D, ...):**
ja: **GDエクステンション (C, C++, Rust, D, ...):**
ru: **Расширение GDExtension (C, C++, Rust, D, ...):**
ta: ** gdextension (c, c ++, துரு, d, ...): **

source: When you need it, link to native libraries for higher performance and third-party integrations.
cs: V případě potřeby vyššího výkonu integrujte nativní knihovny a hotová řešení třetích stran.
fr: Lorsque vous en avez besoin, créez un lien vers des bibliothèques natives pour des performances plus élevées et des intégrations tierces.
ga: Nuair a theastaíonn sé uait, nasc chuig leabharlanna dúchasacha le haghaidh feidhmíochta níos airde agus comhtháthú tríú páirtí.
it: Quando ne hai bisogno, collegati alle librerie native per prestazioni più elevate e l'integrazioni di terze parti.
ja: 必要がある場合、パフォーマンス向上やサードパーティ機能の統合のためのネイティブライブラリをリンクすることができます。
ko: 필요할 때 더 높은 성능과 서드 파티 통합을 해야 한다면 네이티브 라이브러리에 연결하세요.
pl: Kiedy tego potrzebujesz, połącz do natywnych bibliotek dla wyższej wydajności i integracji osób trzecich.
ru: Если это необходимо, ссылка на родные библиотеки для более высокой производительности и сторонних интеграций.
ta: உங்களுக்கு இது தேவைப்படும்போது, அதிக செயல்திறன் மற்றும் மூன்றாம் தரப்பு ஒருங்கிணைப்புகளுக்கு சொந்த நூலகங்களுடன் இணைக்கவும்.
tr: İhtiyaç durumunda, daha yüksek performans ve üçüncü-taraf bütünleşmeleri için sistem yerel kütüphanesine bağlantı.

source: For scripting game logic, GDScript or C# are recommended if their performance is suitable.
cs: Pro skriptování herní logiky doporučujeme GDScript nebo C#, dokud je jejich výkon vyhovující.
fr: Pour les scripts de logique de jeu, GDScript ou C # sont recommandés si leurs performances sont appropriées.
ga: Maidir le loighic cluiche scriptithe, moltar GDScript nó C # má tá a bhfeidhmíocht oiriúnach.
it: Per lo scripting della logica di gioco, si consigliano GDScript o C # se le loro prestazioni sono adeguate.
ja: パフォーマンスが十分な場合は、ゲームロジックの記述には GDScript または C# を使用することをおすすめします。
ko: 성능이 적합하다면 게임 스크립트로는 GDScript나 C#을 사용할 것을 권장합니다.
pl: Dla programowania logiki gry, rekomendujemy GDScript lub C# pod warunkiem, że ich wydajność jest odpowiednia.
ru: Для написания скриптов игровой логики рекомендуется использовать GDScript или C#, если их производительность подходит.
ta: விளையாட்டு தர்க்கத்தை ச்கிரிப்டிங் செய்வதற்கு, அவற்றின் செயல்திறன் பொருத்தமானதாக இருந்தால் GDSCRIPT அல்லது சி# பரிந்துரைக்கப்படுகின்றன.
tr: Oyun mantığı betikleri için, eğer performansları uygunsa, GDScript veya C# önerilir.

source: Official GDExtension bindings for `C <https://github.com/godotengine/godot-headers>`__ and `C++ <https://github.com/godotengine/godot-cpp>`__.
cs: Oficiální GDExtension vazby pro `C <https://github.com/godotengine/godot-headers>`__ a `C++ <https://github.com/godotengine/godot-cpp>`__.
fr: les liaisons GDExtension officiels pour le `C <https://github.com/godotengine/godot-headers>`__ et pour le `C++ <https://github.com/godotengine/godot-cpp>`__.
ga: Ceangaltaí Síneacha GDE oifigiúla do `C <https://github.com/godotengine/godot-headers>`__ agus `C++ <https://github.com/godotenginine/godot-cpp>`__.
it: Binding ufficiali di GDExtension per `C <https://github.com/godotengine/godot-headers>`__ e `C++ <https://github.com/godotengine/godot-cpp>`__.
ja: 公式のGDExtensionは`C <https://github.com/godotengine/godot-headers>`__ および `C++ <https://github.com/godotengine/godot-cpp>`__ 用です。
ko: 공식 GDExtension 바인딩: `C <https://github.com/godotengine/godot-headers>` 및 `C++ <https://github.com/godotengine/godot-cpp>`.
ru: Официальные привязки GDExtension для `C <https://github.com/godotengine/godot-headers>`__ и `C++ <https://github.com/godotengine/godot-cpp>`__.
ta: `C <https://github.com/godotengine/godoteng- ஈடர்ச்> __ மற்றும்` c ++ <https://github.com/godotengine/godot-cpp> __.
tr: `C <https://github.com/godotengine/godot-headers>`__ ve `C++ <https://github.com/godotengine/godot-cpp>`__ için resmi GDExtension bağlayıcıları.

source: Use any build system and language features you wish.
cs: Používejte funkce libovolných systémů sestavení a jazyků.
fr: Utilisez le système de compilation et les fonctionnalités de langage que vous souhaitez.
ga: Bain úsáid as aon chóras tógála agus gnéithe teanga is mian leat.
it: Usa qualsiasi sistema di compilazione e funzionalità della lingua che desideri.
ja: ビルドシステムや言語機能はなんでも使うことができます。
ko: 여러분이 사용하는 어느 빌드 시스템이나 언어든 사용할 수 있습니다.
pl: Użyj dowolnego systemu budowy i funkcji języków.
ru: Используйте любую систему сборки и языковые возможности по вашему желанию.
ta: நீங்கள் விரும்பும் எந்த உருவாக்க அமைப்பு மற்றும் மொழி அம்சங்களைப் பயன்படுத்தவும்.
tr: İstediğiniz herhangi bir derleme sistemini ve dil özelliğini kullanın.

source: Actively developed GDExtension bindings for `D <https://github.com/godot-dlang/godot-dlang>`__, `Swift <https://github.com/migueldeicaza/SwiftGodot>`__, and `Rust <https://github.com/godot-rust/gdextension>`__ bindings provided by the community. (Some of these bindings may be experimental and not production-ready).
cs: Komunitou aktivně vyvíjené vazby GDExtension pro `D <https://github.com/godot-dlang/godot-dlang>`__, `Swift <https://github.com/migueldeicaza/SwiftGodot>`__ a `Rust <https://github.com/godot-rust/gdextension>`__. (Některé z těchto vazeb mohou být experimentální a nevhodné k nasazení v produkci).
fr: Des liaisons GDExtension sont activement développés pour `D <https://github.com/godot-dlang/godot-dlang>`__, `Swift <https://github.com/migueldeicaza/SwiftGodot>`__, et `Rust <https://github.com/godot-rust/gdextension>`__, et sont fournis par la communauté. (Certains de ces liens peuvent être expérimentaux et ne sont pas prêts pour la production).
it: Binding attivamente sviluppati di GDExtension per `D <https://github.com/godot-dlang/godot-dlang>`__, `Swift <https://github.com/migueldeicaza/SwiftGodot>`__ e `Rust <https://github.com/godot-rust/gdextension>`__ forniti dalla comunità. (Alcuni di questi binding potrebbero essere sperimentali e non ancora pronti per la produzione).
ja: コミュニティによって提供される、積極的に開発されているGDExtension バインディングには `D <https://github.com/godot-dlang/godot-dlang>`__ 、 `Swift <https://github.com/migueldeicaza/SwiftGodot>`__ 、および `Rust <https://github.com/godot-rust/gdextension>`__ があります。(これらのバインディングの一部は実験的なものであり、本番環境では使用できない可能性があります)。
ko: 커뮤니티에서 제공하는 활발히 개발 중인 GDExtension 바인딩: `D <https://github.com/godot-dlang/godot-dlang>`__, `Swift <https://github.com/migueldeicaza/SwiftGodot>`__, `Rust <https://github.com/godot-rust/gdextension>`__. (일부 바인딩은 실험적이며, 실제 사용에 적합하지 않을 수 있습니다).
ru: Активно разрабатываемые привязки GDExtension для `D <https://github.com/godot-dlang/godot-dlang>`__, `Swift <https://github.com/migueldeicaza/SwiftGodot>`__, и `Rust <https://github.com/godot-rust/gdextension>`__ привязки, предоставленные сообществом. (Некоторые из этих привязок могут быть экспериментальными и не готовыми к использованию в разработке).
ta: `D <https://github.com/godot-dlang/godot-dlang> __,` ச்விஃப்ட் <https://github.com/migueldeicaza/swiftgodot> `` __, மற்றும் `rust. சமூகத்தால் வழங்கப்பட்ட பிணைப்புகள். (இந்த பிணைப்புகளில் சில சோதனைக்குரியவை மற்றும் விளைவாக்கம் தயாராக இல்லை).

source: Audio
cs: Zvuk
ga: Fuaim
ja: オーディオ
ko: 오디오
ru: Аудио
ta: ஆடியோ
tr: Ses

source: Mono, stereo, 5.1 and 7.1 output.
cs: Mono, stereo, 5.1 a 7.1 výstup.
fr: Sortie Mono, stéréo, 5.1 et 7.1.
ga: Mona, steirió, aschur 5.1 agus 7.1.
it: Uscita Mono, stereo, 5.1 e 7.1.
ja: モノラル、ステレオ、5.1チャンネル、そして7.1チャンネルの出力。
ko: 모노, 스테레오, 5.1 및 7.1 출력.
pl: Wyjście mono, stereo, 5.1 i 7.1.
ru: Выход моно, стерео, 5.1 и 7.1.
ta: மோனோ, ச்டீரியோ, 5.1 மற்றும் 7.1 வெளியீடு.
tr: Tek Ses (Mono), Çift Ses (Stereo), 5.1 ve 7.1 çıkış.

source: Non-positional and positional playback in 2D and 3D.
cs: Nepolohované a polohované přehrávání ve 2D a 3D.
fr: Lecture(playback) non positionnelle et positionnelle en 2D et 3D.
ga: Athsheinm neamhshuite agus suímh i 2D agus 3D.
it: Riproduzione non posizionale e posizionale in 2D e 3D.
ja: 2Dおよび3Dでの非位置的および位置的再生。
ko: 2D 및 3D에서의 비위치 및 위치 재생.
pl: Niepozycyjny i pozycyjny playback w 2D i 3D.
ru: Непозиционное и позиционное воспроизведение в 2D и 3D.
ta: 2D மற்றும் 3D இல் நிலை அல்லாத மற்றும் நிலை பின்னணி.
tr: 2B ve 3B'de konumsal ve konumsal-olmayan oynatma.

source: Optional Doppler effect in 2D and 3D.
cs: Volitelný Dopplerův jev ve 2D a 3D.
fr: Effet Doppler optionnel en 2D et 3D.
ga: Éifeacht Roghnach Doppler i 2D agus 3D.
it: Effetto Doppler opzionale in 2D e 3D.
ja: 2Dと3Dにおけるオプションのドップラー効果。
ko: 2D와 3D에서의 선택적 도플러 효과.
pl: Opcjonalny efekt Dopplera w 2D i 3D.
ru: Дополнительный эффект Доплера в 2D и 3D.
ta: 2d மற்றும் 3d இல் விருப்ப டாப்ளர் விளைவு.
tr: 2B ve 3B'de isteğe bağlı Doppler etkisi.

source: Support for re-routable :ref:`audio buses <doc_audio_buses>` and effects with dozens of effects included.
cs: Podpora přesměrovatelných :ref:`zvukových sběrnic <doc_audio_buses>` a efektů s desítkami efektů předem zahrnutými.
fr: Support de :ref:`bus audio<doc_audio_buses>` re-routable et des effets avec des dizaines d'effets inclus.
ga: Tacaíocht d'ath-routable :ref:`busanna fuaime <doc_audio_buses>` agus éifeachtaí le mórán éifeachtaí san áireamh.
it: Supporto per :ref:`bus audio <doc_audio_buses>` reindirizzabili ed effetti con dozzine di effetti inclusi.
ja: 再ルーティング可能な :ref:`オーディオバス <doc_audio_buses>` と数十種類のエフェクトをサポートしています。
ko: 수십 개의 효과가 포함되고 재 라우팅 가능한 :ref:`오디오 버스 <doc_audio_buses>` 및 효과 지원.
pl: Obsługa kanałów :ref:`audio bus <doc_audio_buses>` przez które można przepuszczać dane audio - zawiera dziesiątki różnych efektów.
ru: Поддержка перенаправляемых :ref:`аудио шин <doc_audio_buses>` и эффектов с десятком внесённых изменений.
ta: மறு-திசைதிருப்பலுக்கான ஆதரவு: குறிப்பு: `ஆடியோ பேருந்துகள் <doc_audio_buses>` மற்றும் டசன் கணக்கான விளைவுகளுடன் விளைவுகள் சேர்க்கப்பட்டுள்ளன.
tr: Yeniden-yönlendirilebilen :ref:`ses veriyolları <doc_audio_buses>` ve düzinelerce etkinin bulunduğu ses efektleri.

source: Support for polyphony (playing several sounds from a single AudioStreamPlayer node).
cs: Podpora polyfonie (přehrávání více zvuků z jediného uzlu AudioStreamPlayer - "přehrávače zvukových streamů").
fr: Prise en charge de la polyphonie (jouer plusieurs sons à partir d'un seul nœud AudioStreamPlayer).
ga: Tacaíocht do polyphony (ag imirt roinnt fuaimeanna ó nód AudioStreamPlayer amháin).
it: Supporto per la polifonia (riproduzione di più suoni da un singolo nodo AudioStreamPlayer).
ja: ポリフォニー (AudioStreamPlayerノードから複数の音声を同時に再生する機能) をサポートしています。
ko: 폴리포니(단일 AudioStreamPlayer 노드에서 여러 소리 재생) 지원.
pl: Obsługa polifonii (odtwarzanie wielu dźwięków z jednego węzła AudioStreamPlayer).
ru: Поддержка полифонии (воспроизведение нескольких звуков с одного узла AudioStreamPlayer).
ta: பாலிஃபோனிக்கான உதவி (ஒற்றை ஆடியோச்ட்ரீஆம்ப்ளேயர் முனையிலிருந்து பல ஒலிகளை வாசித்தல்).
tr: Çok-seslilik desteği (tek bir AudioStreamPlayer düğümünden birden fazla ses çalma).

source: Support for random volume and pitch.
cs: Podpora náhodné hlasitosti a výšky tónu.
fr: Support pour le volume et le pitch aléatoires.
ga: Tacaíocht do thoirt randamach agus páirc.
it: Supporto per volume e tono casuale.
ja: ランダムボリュームとピッチをサポート。
ko: 무작위 볼륨 및 피치에 대한 지원.
pl: Wsparcie dla losowego poziomu głośności i wysokości dźwięku.
ru: Поддержка случайной громкости и высоты звука.
ta: சீரற்ற தொகுதி மற்றும் சுருதிக்கான உதவி.
tr: Rastgele ses seviyesi ve perde desteği.

source: Support for real-time pitch scaling.
cs: Podpora změny výšky tónu v reálném čase.
fr: Support pour l'ajustement du pitch en temps réel.
ga: Tacaíocht do scálú páirce fíor-ama.
it: Supporto per la regolazione del tono in tempo reale.
ja: リアルタイムピッチでスケーリングするのをサポート。
ko: 실시간 피치 스케일링 지원.
pl: Wsparcie dla skalowania wysokości dźwięku w czasie rzeczywistym.
ru: Поддержка обработки высоты звука в реальном времени.
ta: நிகழ்நேர சுருதி அளவிடுதலுக்கான உதவி.
tr: Gerçek zamanlı perde ölçeklendirme desteği.

source: Support for sequential/random sample selection, including repetition prevention when using random sample selection.
cs: Podpora sekvenčního/náhodného výběru zvuků, včetně zamezení opakování při použití náhodného výběru.
fr: Prise en charge de la sélection d'échantillons séquentiels/ aléatoires, y compris la prévention de répétitions lors de l'utilisation d'échantillons aléatoires.
ga: Tacaíocht do roghnú samplach seicheamhach / randamach, lena n-áirítear cosc athrá agus roghnú samplach randamach á úsáid.
it: Supporto per la selezione sequenziale/casuale di campioni, inclusa la prevenzione delle ripetizioni quando si utilizza una selezione casuale di campioni.
ja: ランダム、または、連続的なサンプル選択や、ランダムサンプル選択時に重複を防止します。
ko: 무작위 샘플 선택을 사용할 때 반복 방지를 포함하여 순차/무작위 샘플 선택에 대한 지원.
ru: Поддержка последовательного/случайного отбора сэмплов, включая предотвращение повторов при использовании случайного отбора сэмплов.
ta: சீரற்ற மாதிரி தேர்வைப் பயன்படுத்தும் போது மீண்டும் மீண்டும் தடுப்பு உட்பட தொடர்ச்சியான/சீரற்ற மாதிரி தேர்வுக்கான உதவி.
tr: Rastgele örnek seçimi kullanılırken tekrarlama önleme dahil olmak üzere, sıralı/rastgele örnek seçimi desteği.

source: Listener2D and Listener3D nodes to listen from a position different than the camera.
cs: Uzly Listener2D a Listener3D ("2D/3D posluchač") k poslechu z jiného místa, než kde se nachází kamera.
fr: Les nœuds Listener2D et Listener3D pour écouter depuis une position différente de celle de la caméra.
ga: Nóid Listener2D agus Listener3D le héisteacht ó phost difriúil ná an ceamara.
it: Nodi Listener2D e Listener3D per ascoltare da una posizione diversa dalla telecamera.
ja: カメラとは異なる位置からリスニングするためのListener2DとListener3Dノード。
ko: 카메라 외의 위치에서 듣기 위해 사용할 수 있는 Listener2D와 Listener3D 노드.
pl: Węzły Listener2D i Listener3D do nasłuchiwania dźwięku z innego miejsca niż pozycja kamery.
ru: Узлы Listener2D и Listener3D для прослушивания с позиции, отличной от позиции камеры.
ta: கேமராவை விட வித்தியாசமான நிலையில் இருந்து கேட்க கேட்போர் 2 டி மற்றும் கேட்போர் 3 டி முனைகள்.
tr: Kameradan farklı bir konumdan dinlemek için 2B ve 3B dinleyici, Listener2D ve Listener3D, düğümleri.

source: Support for :ref:`procedural audio generation <class_AudioStreamGenerator>`.
cs: Podpora pro :ref:`procedurální generování zvuku <class_AudioStreamGenerator>`.
fr: Support pour la :ref:`génération audio procédurale <class_AudioStreamGenerator>`.
ga: Tacaíocht do :ref:`giniúint fuaime nós imeachta <class_AudioStreamGenerator>`.
it: Supporto per la :ref:`generazione di audio procedurale <class_AudioStreamGenerator>`.
ja: :ref:`プロシージャルオーディオ生成 <class_AudioStreamGenerator>` のサポート。
ko: :ref:`절차적 오디오 생성 <class_AudioStreamGenerator>`\ 을 위한 툴.
ru: Поддержка :ref:`процедурной генерации звука <class_AudioStreamGenerator>`.
ta: இதற்கான ஆதரவு: குறிப்பு: `நடைமுறை ஆடியோ தலைமுறை <class_audiosTreamgenerator>`.
tr: :ref:`Yöntemsel ses üretimi <class_AudioStreamGenerator>` için destek.

source: Audio input to record microphones.
cs: Zvukový vstup pro snímání mikrofonů.
fr: Entrée audio afin d'enregistrer depuis des microphones.
ga: Ionchur fuaime chun micreafóin a thaifeadadh.
it: Ingresso audio per la registrazione da microfoni.
ja: マイクで録音するためのオーディオ入力。
ko: 마이크를 녹음할 수 있는 오디오 입력.
pl: Obsługa polifonii (odtwarzanie wielu dźwięków z jednego węzła AudioStreamPlayer).
ru: Аудиовход для записи микрофонов.
ta: மைக்ரோஃபோன்களை பதிவு செய்ய ஆடியோ உள்ளீடு.
tr: Mikrofonları kaydetmek için ses girişi.

source: MIDI input.
cs: Vstup MIDI.
fr: Entrée MIDI.
ga: ionchur MIDI.
it: Ingresso MIDI.
ja: MIDI 入力。
ko: MIDI 입력.
pl: Wejście MIDI.
ru: MIDI вход.
ta: மிடி உள்ளீடு.
tr: MIDI girişi.

source: No support for MIDI output yet.
cs: Zatím žádná podpora pro výstup MIDI.
fr: Pas encore de support pour la sortie MIDI.
ga: Níl aon tacaíocht d'aschur MIDI fós.
it: Ancora nessun supporto per l'uscita MIDI.
ja: MIDI出力にはまだ対応していません。
ko: MIDI 출력은 아직 지원하지 않습니다.
pl: Brak wsparcia z wyniku MIDI ,jeszcze.
ru: Поддержки выхода MIDI пока нет.
ta: மிடி வெளியீட்டிற்கு இன்னும் உதவி இல்லை.
tr: MIDI çıkışı için henüz destek yok.

source: **APIs used:**
cs: **Použitá API:**
fr: **API utilisés :**
ga: **APInna a úsáidtear:**
it: **API utilizzate:**
ja: ** 使用API :**
ko: **사용된 API 목록:**
pl: **używane API:**
ru: **Используемые API:**
ta: ** பநிஇ கள் பயன்படுத்தப்படுகின்றன: **
tr: **Kullanılan API'ler:**

source: *Windows:* WASAPI.
ga: * Fuinneoga: * WASAPI.
ru: *Windows:* ДОМОЙ.
ta: * விண்டோச்:* பின்புறம்.

source: *macOS:* CoreAudio.
ru: *macOS:* Основное аудио.
ta: * மேகோச்:* கொரியுடியோ.

source: *Linux:* PulseAudio or ALSA.
cs: *Linux:* PulseAudio nebo ALSA.
fr: *Linux :* PulseAudio ou ALSA.
ga: *Linux:* PulseAudio nó ALSA.
it: *Linux:* PulseAudio o ALSA.
ja: *Linux:* PulseAudio、または ALSA。
ko: *Linux:* PulseAudio 또는 ALSA.
pl: *Linux:* PulseAudio lub ALSA.
ru: *Linux:* PulseAudio или ALSA.
ta: * லினக்ச்:* பல்சியுடியோ அல்லது அல்சா.
tr: *Linux:* PulseAudio ya da ALSA.

source: Import
fr: Importation
ga: Iompórtáil
it: Importa
ja: インポート
ko: 가져오기
pl: Zaimportuj
ru: Импорт
ta: இறக்குமதி
tr: İçe Aktarma

source: Support for :ref:`custom import plugins <doc_import_plugins>`.
cs: Podpora pro :ref:`vlastní zásuvné moduly importu <doc_import_plugins>`.
fr: Prise en charge des :ref:`plugins d'importation personnalisés <doc_import_plugins>`.
ga: Tacaíocht do :ref: `breiseáin iompórtála saincheaptha <doc_import_plugins>`.
it: Supporto per :ref:`custom import plugins <doc_import_plugins>`.
ja: :ref:`カスタムのインポート用プラグイン <doc_import_plugins>` に対応。
ko: :ref:`사용자 지정 가져오기 플러그인 <doc_import_plugins>` 지원.
pl: Wsparcie dla :ref:`własny import wtyczek <doc_import_plugins>`.
ru: Поддержка :ref:`пользовательских плагинов импорта <doc_import_plugins>`.
ta: இதற்கான ஆதரவு: குறிப்பு: `தனிப்பயன் இறக்குமதி செருகுநிரல்கள் <doc_import_plugins>`.
tr: :ref:`Özel içe aktarma eklentileri <doc_import_plugins>` için destek.

source: **Formats:**
cs: **Formáty:**
ga: **Formáidí:**
it: **Formati:**
ja: **フォーマット:**
ko: **형식:**
pl: **Formaty:**
ru: **Форматы:**
ta: ** வடிவங்கள்: **
tr: **Biçimler:**

source: *Images:* See :ref:`doc_importing_images`.
cs: *Obrázky:* Viz :ref:`doc_importing_images`.
fr: *Images:* Voir :ref:`doc_importing_images`.
ga: *Íomhánna:* Féach :ref:'doc_importing_images'.
it: *Immagini:* Consulta :ref:`doc_importing_images`.
ja: *画像:* :ref:`doc_importing_images` を参照。
ko: *이미지:* :ref:`doc_importing_images`\ 를 참고하세요.
ru: *Изображения:* Cмотреть :ref:`doc_importing_images`.
ta: * படங்கள்:* காண்க: ref: `doc_importing_images`.
tr: *Görüntüler:* Bkz. :ref:`doc_importing_images`.

source: *Audio:*
cs: *Zvuk:*
ga: *Fuaim:*
ja: *オーディオ:*
ko: *오디오:*
pl: *Dźwięk:*
ru: *Аудио:*
ta: *ஆடியோ:*
tr: *Ses:*

source: WAV with optional IMA-ADPCM compression.
cs: WAV s volitelnou kompresí IMA-ADPCM.
fr: WAV avec compression IMA-ADPCM optionnelle.
ga: WAV le comhbhrú roghnach IMA-ADPCM.
it: WAV con compressione IMA-ADPCM opzionale.
ja: オプションの IMA-ADPCM 圧縮を使用した WAV。
ko: 선택적 IMA-ADPCM 압축이 있는 WAV.
pl: WAV z opcjonalną kompresją IMA-ADPCM.
ru: WAV с опциональным сжатием IMA-ADPCM.
ta: விருப்ப IMA-ADPCM சுருக்கத்துடன் WAV.
tr: İsteğe bağlı IMA-ADPCM sıkıştırmalı WAV.

source: *3D scenes:* See :ref:`doc_importing_3d_scenes`.
cs: *3D scény:* Viz :ref:`doc_importing_3d_scenes`.
fr: *Scènes 3D:* Voir :ref:`doc_importing_3d_scenes`.
ga: *Radhairc 3D:* Féach :ref:'doc_importing_3d_scenes'.
it: *Scene 3D:* Consulta :ref:`doc_importing_3d_scenes`.
ja: *3D シーン:* :ref:`doc_importing_3d_scenes`\を参照.
ko: *3D 씬:* :ref:`doc_importing_3d_scenes`\ 를 참고하세요.
ru: *3D сцены:* Cмотреть :ref:`doc_importing_3d_scenes`.
ta: * 3D காட்சிகள்:* காண்க: ref: `doc_importing_3d_scenes`.
tr: *3B sahneler:* Bkz. :ref:`doc_importing_3d_scenes`.
