Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/editor/editor_style_guide.po
Languages: ga, ta, tr, uk

source: Editor style guide
ga: Treoir stíl eagarthóra
ta: ஆசிரியர் நடை வழிகாட்டி
tr: Düzenleyici tarz rehberi
uk: Керівництво по стилю редактора

source: Introduction
ga: Réamhrá
ta: அறிமுகம்
tr: Giriş
uk: Вступ

source: Thanks for your interest in contributing to the Godot editor!
ga: Go raibh maith agat as do spéis i gcur le eagarthóir Godot!
ta: கோடோட் எடிட்டருக்கு பங்களிப்பதில் உங்கள் ஆர்வத்திற்கு நன்றி!
tr: Godot düzenleyicisine katkıda bulunmaya gösterdiğiniz ilgi için teşekkür ederiz!
uk: Дякуємо за ваш інтерес до участі в редакторі Godot!

source: This page describes the grammar and writing style used throughout the Godot editor. Following this style guide will help your contribution get merged faster since there will be fewer review steps required.
ga: Déanann an leathanach seo cur síos ar an stíl ghramadaí agus scríbhneoireachta a úsáidtear ar fud an eagarthóra Godot. Cabhróidh an treoir stíle seo le do ranníocaíocht a chumasc níos tapúla mar beidh níos lú céimeanna athbhreithnithe ag teastáil.
ta: இந்த பக்கம் கோடோட் எடிட்டர் முழுவதும் பயன்படுத்தப்படும் இலக்கணம் மற்றும் எழுதும் பாணியை விவரிக்கிறது. இந்த பாணி வழிகாட்டியைப் பின்பற்றுவது உங்கள் பங்களிப்பு விரைவாக ஒன்றிணைக்க உதவும், ஏனெனில் குறைவான மறுஆய்வு படிகள் தேவைப்படும்.
tr: Bu sayfa Godot düzenleyicisinde kullanılan dilbilgisi ve yazım tarzını açıklamaktadır. Bu tarz kılavuzuna uymak, daha az inceleme adımı gerekeceğinden katkınızın daha hızlı birleştirilmesine yardımcı olacaktır.
uk: На цій сторінці описано граматику та стиль написання, які використовуються в редакторі Godot. Дотримуючись цього посібника зі стилю, ваш внесок буде об’єднано швидше, оскільки потрібно буде менше кроків перегляду.

source: Writing style
ga: Stíl scríobh
ta: எழுதும் நடை
tr: Yazım tarzı
uk: Стиль написання

source: **Write messages (errors, warnings, ...) as full sentences.** They should start with an uppercase letter and end with a period.
ga: **Scríobh teachtaireachtaí (earráidí, rabhaidh,...) mar abairtí iomlána.** Ba chóir dóibh tosú le litir uachtarchlóir agus deireadh a chur le tréimhse.
ta: ** செய்திகளை (பிழைகள், எச்சரிக்கைகள், ...) முழு வாக்கியங்களாக எழுதுங்கள். ** அவை ஒரு பெரிய கடிதத்துடன் தொடங்கி ஒரு காலத்துடன் முடிவடையும்.
tr: **Mesajları (hatalar, uyarılar, ...) tam cümleler halinde yazın.** Büyük harfle başlamalı ve nokta ile bitmelidir.
uk: **Пишіть повідомлення (помилки, попередження, ...) повними реченнями.** Вони мають починатися з великої літери та закінчуватися крапкою.

source: **Try to keep sentences short.** This makes it more likely that their translations will be short as well, which is a good thing to avoid UI bugs.
ga: **Déan iarracht abairtí a choinneáil gearr.** Fágann sé seo go bhfuil sé níos dóichí go mbeidh a n-aistriúcháin gearr freisin, rud is maith é chun fabhtanna Chomhéadain a sheachaint.
ta: ** வாக்கியங்களை குறுகியதாக வைத்திருக்க முயற்சி செய்யுங்கள். ** இது அவர்களின் மொழிபெயர்ப்புகளும் குறுகியதாக இருக்கும், இது இடைமுகம் பிழைகளைத் தவிர்ப்பதற்கு ஒரு நல்ல சேதி.
tr: **Cümleleri kısa tutmaya çalışın.** Bu, çevirilerinin de kısa olma olasılığını artırır, bu da kullanıcı arayüzü hatalarını önlemek için iyi bir şeydir.
uk: **Намагайтеся, щоб речення були короткими.** Це збільшує ймовірність того, що їхні переклади також будуть короткими, що добре, щоб уникнути помилок інтерфейсу користувача.

source: **Use contractions.** For example, use "isn't" instead of "is not". An exception to this rule can be made when you specifically want to emphasize one of the contraction's words.
ga: **Úsáid conraithe.** Mar shampla, bain úsáid as “nach bhfuil” in ionad “nach bhfuil”. Is féidir eisceacht a dhéanamh ar an riail seo nuair is mian leat béim a chur ar cheann de na focail an chrabhaithe go sonrach.
ta: ** சுருக்கங்களைப் பயன்படுத்துங்கள். ** எடுத்துக்காட்டாக, "இல்லை" என்பதற்கு பதிலாக "இல்லை" என்று பயன்படுத்தவும். சுருக்கத்தின் சொற்களில் ஒன்றை நீங்கள் குறிப்பாக வலியுறுத்த விரும்பும் போது இந்த விதிக்கு விதிவிலக்கு செய்யப்படலாம்.
tr: **Kaynaşmalar kullanın** Örneğin, "is not" yerine "isn't" ifadesini kullanın. Bu kuralın bir istisnası, özellikle kaynaşmanın kelimelerinden birini vurgulamak istediğinizde yapılabilir.
uk: **Використовуйте скорочення.** Наприклад, використовуйте «не» замість «не». Виняток із цього правила можна зробити, коли ви спеціально хочете підкреслити одне зі слів скорочення.

source: **Use double quotes in messages** (``""``) instead of single quotes (``''``). Double quotes should be used to quote user input, file paths and possibly other things depending on the context.
ga: **Úsáid luachana dúbailte i dteachtaireachtaí ** (``""``) in ionad luachana aonair (`"``). Ba chóir luachana dúbailte a úsáid chun ionchur úsáideora, cosáin comhaid agus rudaí eile b'fhéidir a lua ag brath ar an gcomhthéacs.
ta: ** ஒற்றை மேற்கோள்களுக்கு (`` '' ``) பதிலாக செய்திகளில் இரட்டை மேற்கோள்களைப் பயன்படுத்தவும் ** (`` "" ``). பயனர் உள்ளீடு, கோப்பு பாதைகள் மற்றும் சூழலைப் பொறுத்து பிற விசயங்களை மேற்கோள் காட்ட இரட்டை மேற்கோள்கள் பயன்படுத்தப்பட வேண்டும்.
tr: **Mesajlarda tek tırnak (``' '``) yerine çift tırnak (``" "``) kullanın**. Çift tırnak kullanıcı girdilerini, dosya yollarını ve muhtemelen bağlama bağlı olarak diğer şeyleri alıntılamak için kullanılmalıdır.
uk: **Використовуйте подвійні лапки в повідомленнях** (``""``) замість одинарних лапок (``''``). Подвійні лапки слід використовувати для введення даних користувача, шляхів до файлів і, можливо, інших речей, залежно від контексту.

source: Try to follow the :ref:`doc_docs_writing_guidelines` in addition to the guidelines outlined above.
ga: Déan iarracht an: ref: `doc_docs_writing_guidines` a leanúint chomh maith leis na treoirlínte a leagtar amach thuas.
ta: மேலே குறிப்பிடப்பட்டுள்ள வழிகாட்டுதல்களுக்கு கூடுதலாக: `doc_docs_writing_guidleins` ஐப் பின்பற்ற முயற்சிக்கவும்.
tr: Yukarıda özetlenen yönergelere ek olarak :ref:`doc_docs_writing_guidelines` yönergelerini de takip etmeye çalışın.
uk: Намагайтеся дотримуватись :ref:`doc_docs_writing_guidelines` на додаток до вказівок, викладених вище.

source: Button and menu texts
ga: Téacsanna cnaipe agus roghchlár
ta: பொத்தான் மற்றும் பட்டியல் நூல்கள்
tr: Düğme ve menü metinleri
uk: Тексти кнопок і меню

source: Capitalize text in buttons and menu actions:
ga: Caipitliú téacs i gcnaipí agus i ngníomhartha roghchláir:
ta: பொத்தான்கள் மற்றும் பட்டியல் செயல்களில் உரையை மூலதனமாக்கவும்:
tr: Düğmelerdeki ve menü eylemlerindeki metnin ilk harflerini büyük yazın:
uk: Пишіть великими літерами текст у кнопках і діях меню:

source: **Good:** *Open Editor Data Folder*
ga: **Go maith: ** * Fillteán Sonraí Eagarthóra Oscailte*
ta: ** நல்லது: ***திறந்த எடிட்டர் தரவு கோப்புறை*
tr: **İyi:** *Open Editor Data Folder*
uk: **Добре:** *Відкрити папку даних редактора*

source: **Bad:** *Open editor data folder*
ga: **Droch: ** *Oscail fillteán sonraí eagarthóir*
ta: ** மோசமானது: ***திறந்த எடிட்டர் தரவு கோப்புறை*
tr: **Kötü:** *Open editor data folder*
uk: **Погано:** *Відкрити папку даних редактора*

source: If a menu action opens a modal dialog, suffix it with an ellipsis (``...``).
ga: Má osclaíonn gníomh roghchláir dialóg mhodúil, iarmhair é le ellipsis (``...``).
ta: ஒரு பட்டியல் செயல் ஒரு மாதிரி உரையாடலைத் திறந்தால், அதை ஒரு நீள்வட்டத்துடன் பின்னொட்டு (`` ... ``).
tr: Bir menü eylemi bir yardımcı iletişim kutusu açıyorsa, eylemin sonuna bir üç nokta (``...``) ekleyin.
uk: Якщо дія меню відкриває модальне діалогове вікно, додайте до нього крапку (``...``).

source: **Good:** *Editor Settings...*
ga: ** Go maith: ** * Socruithe Eagarthóra... *
ta: ** நல்லது: ***ஆசிரியர் அமைப்புகள் ...*
tr: **İyi:** *Editor Settings...*
uk: **Добре:** *Налаштування редактора...*

source: **Bad:** *Editor Settings*
ga: **Droch: ** *Socruithe Eagarthóir*
ta: ** மோசமானது: ***ஆசிரியர் அமைப்புகள்*
tr: **Kötü:** *Editor Settings*
uk: **Погано:** *Налаштування редактора*

source: Inspector sections
ga: rannáin an Cigire
ta: இன்ச்பெக்டர் பிரிவுகள்
tr: Denetleyici bölümleri
uk: Розділи інспектора

source: In general, don't create sections that contain less than 3 items. Sections that contain few items make it difficult to navigate the inspector, while missing the benefits of using sections such as folding.
ga: Go ginearálta, ná cruthaigh rannóga a bhfuil níos lú ná 3 mhír iontu. Bíonn sé deacair dul i dteagmháil leis an gcigire i gcodanna nach bhfuil ach beagán míreanna iontu, agus na buntáistí a bhaineann le codanna cosúil le fillte a úsáid in easnamh.
ta: பொதுவாக, 3 க்கும் குறைவான உருப்படிகளைக் கொண்ட பிரிவுகளை உருவாக்க வேண்டாம். சில உருப்படிகளைக் கொண்ட பிரிவுகள் இன்ச்பெக்டருக்கு செல்ல கடினமாக இருக்கும், அதே நேரத்தில் மடிப்பு போன்ற பிரிவுகளைப் பயன்படுத்துவதன் நன்மைகளை காணவில்லை.
tr: Genel olarak, 3'ten az öge içeren bölümler oluşturmayın. Az sayıda öge içeren bölümler denetleyicide gezinmeyi zorlaştırırken, katlama gibi bölümleri kullanmanın faydalarını da kaçırır.
uk: Загалом, не створюйте розділи, які містять менше 3 елементів. Розділи, які містять невелику кількість елементів, ускладнюють навігацію інспектора, втрачаючи при цьому переваги використання розділів, наприклад складання.

source: There are some valid exceptions for this, such as material features in :ref:`class_StandardMaterial3D`.
ga: Tá roinnt eisceachtaí bailí ann chuige seo, mar shampla gnéithe ábhartha in:ref: `Class_StandardMaterial3D`.
ta: இதற்கு சில சரியான விதிவிலக்குகள் உள்ளன, அதாவது பொருள் அம்சங்கள்: ref: `class_standardmaterial3d`.
tr: Bunun için, :ref:`class_StandardMaterial3D` içindeki malzeme özellikleri gibi, bazı geçerli istisnalar vardır.
uk: Існують деякі дійсні винятки для цього, як-от особливості матеріалу в :ref:`class_StandardMaterial3D`.

source: This advice also applies to the Project Settings and Editor Settings.
ga: Baineann an chomhairle seo freisin le Socruithe Tionscadail agus Socruithe Eagarthóra.
ta: இந்த அறிவுரை திட்ட அமைப்புகள் மற்றும் ஆசிரியர் அமைப்புகளுக்கும் பொருந்தும்.
tr: Bu tavsiye Proje Ayarları ve Düzenleyici Ayarları için de geçerlidir.
uk: Ця порада також стосується налаштувань проекту та налаштувань редактора.

source: Inspector performance hints
ga: Leideanna feidhmíochta cigir
ta: இன்ச்பெக்டர் செயல்திறன் குறிப்புகள்
tr: Denetleyici performans ipuçları
uk: Підказки щодо роботи інспектора

source: Enum properties that noticeably impact performance should have a performance hint associated. The hint should refer to the *absolute* performance impact, rather than being relative to the other options provided in the enum. Here are some examples taken from the Godot editor:
ga: Ba chóir go mbeadh leid feidhmíochta ag airíonna Enum a théann tionchar suntasach ar fheidh Ba chóir go dtagraíonn an leid don tionchar feidhmíochtaí* iomlán*, seachas a bheith coibhneasta leis na roghanna eile a chuirtear ar fáil san enum. Seo roinnt samplaí a tógadh ón eagarthóir Godot:
ta: செயல்திறனை குறிப்பிடத்தக்க அளவில் பாதிக்கும் பண்புகள் செயல்திறன் குறிப்பைக் கொண்டிருக்க வேண்டும். குறிப்பில் வழங்கப்பட்ட பிற விருப்பங்களுடன் தொடர்புடையதாக இருப்பதை விட, * முழுமையான * செயல்திறன் தாக்கத்தைக் குறிக்க வேண்டும். கோடோட் எடிட்டரிடமிருந்து எடுக்கப்பட்ட சில எடுத்துக்காட்டுகள் இங்கே:
tr: Performansı belirgin bir şekilde etkileyen numaralandırma (enum) özelliklerinin ilişkili bir performans ipucu olmalıdır. İpucu, enum ile sağlanan diğer seçeneklere göre değil, doğrudan *mutlak* performans etkisine atıfta bulunmalıdır. İşte Godot düzenleyiciden alınan bazı örnekler:
uk: Властивості Enum, які помітно впливають на продуктивність, повинні мати пов’язану підказку щодо продуктивності. Підказка має стосуватися *абсолютного* впливу на продуктивність, а не відносно інших параметрів, наданих у переліку. Ось кілька прикладів із редактора Godot:

source: **Screen-space antialiasing:** *Disabled (Fastest), FXAA (Fast)*
ga: ** Antialiasing spáis scáileáin: ** * Díchumasaithe (Is gasta), FXAA (tapa) *
uk: **Згладжування екранного простору:** *Вимкнено (найшвидше), FXAA (швидко)*

source: **MSAA quality:** *Disabled (Fastest), 2x (Fast), 4x (Average), 8x (Slow), 16x (Slower)*
ga: ** Cáilíocht MSAA: ** *Míchumas (Is gasta), 2x (Gasta), 4x (Meán), 8x (Mall), 16x (níos moille) *
ta: ** MSAA தரம்: ***முடக்கப்பட்ட (வேகமான), 2x (வேகமான), 4x (சராசரி), 8x (மெதுவாக), 16x (மெதுவாக)*
uk: **Якість MSAA:** *Вимкнено (найшвидший), 2x (швидкий), 4x (середній), 8x (повільний), 16x (повільніший)*

source: **DirectionalLight mode:** *Orthogonal (Fast), PSSM 2 Splits (Average), PSSM 4 Splits (Slow)*
ga: ** Modh Solas Treorach: ** * Orthogonal (Tapa), Scoilteanna PSSM 2 (Meán), Scoilteanna PSSM 4 (Mall) *
ta: ** திசைஅலைட் பயன்முறை: ***ஆர்த்தோகனல் (வேகமான), பிஎச்எச்எம் 2 பிளவு (சராசரி), பிஎச்எச்எம் 4 பிளவு (மெதுவாக)*
uk: **Режим DirectionLight:** *Ортогональний (швидкий), PSSM 2 розділення (середній), PSSM 4 розділення (повільний)*

source: For consistency, try to stick to the terms below (from fastest to slowest):
ga: Le haghaidh comhsheasmhachta, déan iarracht cloí leis na téarmaí thíos (ó is gasta go is moille):
ta: நிலைத்தன்மைக்கு, கீழேயுள்ள சொற்களுடன் ஒட்ட முயற்சிக்கவும் (வேகமானதிலிருந்து மெதுவாக):
tr: Tutarlılık için aşağıdaki terimlere sadık kalmaya çalışın (en hızlıdan en yavaşa):
uk: Для послідовності спробуйте дотримуватися наведених нижче термінів (від найшвидшого до найповільнішого):

source: *Fastest, Faster, Fast, Average, Slow, Slower, Slowest*
ga: * Is gasta, níos gasta, tapa, meán, mall, níos moille, níos leith*
ta: *வேகமான, வேகமான, வேகமான, சராசரி, மெதுவான, மெதுவான, மெதுவான*
uk: *Найшвидший, Швидший, Швидкий, Середній, Повільний, Повільніший, Найповільніший*

source: Their usage doesn't have to be contiguous. For example, you can use only "Fast" and "Slow" from the list above.
ga: Ní gá go mbeadh a n-úsáid comhraic. Mar shampla, ní féidir leat ach “Fast” agus “Small” a úsáid ón liosta thuas.
ta: அவற்றின் பயன்பாடு தொடர்ச்சியாக இருக்க வேண்டியதில்லை. எடுத்துக்காட்டாக, மேலே உள்ள பட்டியலிலிருந்து "வேகமான" மற்றும் "மெதுவாக" மட்டுமே பயன்படுத்த முடியும்.
tr: Kullanımlarının bitişik olması gerekmez. Örneğin, yukarıdaki listeden yalnızca "Fast" ve "Slow" kullanabilirsiniz.
uk: Їх використання не повинно бути суміжним. Наприклад, зі списку вище можна використовувати лише «Швидко» та «Повільно».

source: If you're adding a new enum, its values should be ordered from the fastest option to the slowest option.
ga: Má tá enum nua á chur agat, ba chóir a luachanna a ordú ón rogha is gasta go dtí an rogha is moille.
ta: நீங்கள் ஒரு புதிய enum ஐச் சேர்த்தால், அதன் மதிப்புகள் வேகமான விருப்பத்திலிருந்து மெதுவான விருப்பத்திற்கு ஆர்டர் செய்யப்பட வேண்டும்.
tr: Yeni bir enum ekliyorsanız, değerleri en hızlı seçenekten en yavaş seçeneğe doğru sıralanmalıdır.
uk: Якщо ви додаєте новий перелік, його значення слід упорядкувати від найшвидшого до найповільнішого.

source: Tooltips
ga: Leideanna uirlisí
ta: உதவிக்குறிப்புகள்
tr: Araçipuçları
uk: Підказки

source: Consider adding tooltips whenever the action performed by a button or menu action isn't obvious. You can also provide additional context or highlight caveats in the tooltip.
ga: Smaoinigh ar leideanna uirlisí a chur leis aon uair nach léir an gníomh a dhéanann cnaipe nó gníomh roghchláir. Féadfaidh tú comhthéacs breise a sholáthar nó aird a tharraingt ar choimeanna sa leid uirlis.
ta: ஒரு பொத்தானை அல்லது பட்டியல் செயலால் நிகழ்த்தப்படும் செயல் வெளிப்படையாக இல்லாத போதெல்லாம் உதவிக்குறிப்புகளைச் சேர்ப்பதைக் கவனியுங்கள். நீங்கள் கூடுதல் சூழலை வழங்கலாம் அல்லது உதவிக்குறிப்பில் எச்சரிக்கைகளை முன்னிலைப்படுத்தலாம்.
tr: Bir düğme veya menü eylemi tarafından gerçekleştirilen eylem açık olmadığında araç ipuçları eklemeyi düşünün. Ayrıca araç ipucunda ek bağlam sağlayabilir veya uyarıları vurgulayabilirsiniz.
uk: Подумайте про додавання підказок, якщо дія, що виконується кнопкою чи меню, неочевидна. Ви також можете надати додатковий контекст або виділити застереження у спливаючій підказці.

source: You can do this by calling ``set_tooltip(TTR("Text here."))`` on the Control-based node in question. If the tooltip is particularly long (more than ~80 characters), wrap it over several lines by adding line breaks using ``\n``.
ga: Is féidir leat é seo a dhéanamh trí `` set_tooltip(TTR ("Téacs anseo."))` a ghlaoch ar an nód Rialaithe-bhunaithe atá i gceist. Má tá an leid uirlisí an-fhada (níos mó ná ~80 carachtar), fillte thar roinnt línte é trí bhriseadh líne a chur leis ag baint úsáide as ``\n``.
ta: கேள்விக்குரிய கட்டுப்பாட்டு அடிப்படையிலான முனையில் `` set_tooltip (ttr ("உரை.")) `` என்று அழைப்பதன் மூலம் இதைச் செய்யலாம். உதவிக்குறிப்பு குறிப்பாக நீளமாக இருந்தால் (~ 80 எழுத்துகளுக்கு மேல்), `` \ n`` ஐப் பயன்படுத்தி வரி இடைவெளிகளைச் சேர்ப்பதன் மூலம் அதை பல வரிகளுக்கு மேல் மடிக்கவும்.
tr: Bunu, söz konusu Control tabanlı düğüm üzerinde ``set_tooltip(TTR("Metin buraya gelir."))`` ögesini çağırarak yapabilirsiniz. Araç ipucu özellikle uzunsa (~80 karakterden fazla), ``\n`` kullanarak satır sonları ekleyerek birkaç satırda yazın.
uk: Ви можете зробити це, викликавши ``set_tooltip(TTR("Text here."))`` на відповідному вузлі на основі Control. Якщо спливаюча підказка дуже довга (понад ~80 символів), розмістіть її на кількох рядках, додавши розриви рядків за допомогою ``\n``.

source: Tooltips should follow the writing style described above. In addition to this, use indicative mood instead of imperative mood:
ga: Ba chóir go leanfadh leideanna uirlisí an stíl scríbhneoireachta a Chomh maith leis seo, bain úsáid as giúmar táscach in ionad giúmar riachtanach:
ta: உதவிக்குறிப்புகள் மேலே விவரிக்கப்பட்ட எழுத்து பாணியைப் பின்பற்ற வேண்டும். இது தவிர, கட்டாய மனநிலைக்கு பதிலாக குறிக்கும் மனநிலையைப் பயன்படுத்தவும்:
tr: Araç ipuçları yukarıda açıklanan yazım tarzını takip etmelidir. Buna ek olarak, emir kipi yerine gösterme kipi kullanın:
uk: Підказки мають відповідати стилю написання, описаному вище. Крім того, вживайте вказівний спосіб замість наказового:

source: **Good:** *Computes global illumination for the selected GIProbe.*
ga: ** Go maith: ** * Ríomhann soilsiú domhanda don GiProbe roghnaithe. *
ta: ** நல்லது: ***தேர்ந்தெடுக்கப்பட்ட சிப்ரோபிற்கான உலகளாவிய வெளிச்சத்தை கணக்கிடுகிறது.*
tr: **İyi:** *Computes global illumination for the selected GIProbe.*
uk: **Добре:** *Обчислює глобальне освітлення для вибраного GIProbe.*

source: **Bad:** *Compute global illumination for the selected GIProbe.*
ga: **Droch: ** * Ríomh soilsiú domhanda don GiProbe roghnaithe. *
ta: ** மோசமானது: ***தேர்ந்தெடுக்கப்பட்ட சிப்ரோபிற்கான உலகளாவிய வெளிச்சத்தை கணக்கிடுங்கள்.*
tr: **Kötü:** *Compute global illumination for the selected GIProbe.*
uk: **Погано:** *Обчислити глобальне освітлення для вибраного GIProbe.*
