Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shader_reference/spatial_shader.po
Languages: ga, ru, ta

source: Custom depth value (range of ``[0.0, 1.0]``). If ``DEPTH`` is being written to in any shader branch, then you are responsible for setting the ``DEPTH`` for **all** other branches. Otherwise, the graphics API will leave them uninitialized.
ru: Пользовательское значение глубины (диапазон ``[0.0, 1.0]``). Если ``DEPTH`` записывается в какой-либо ветке шейдера, то вы отвечаете за установку ``DEPTH`` для **всех** остальных веток. В противном случае графический API оставит их неинициализированными.
ta: தனிப்பயன் ஆழ மதிப்பு (`` [0.0, 1.0] ``) வரம்பு. எந்தவொரு சேடர் கிளையிலும் `` ஆழம்` `எழுதப்பட்டால், அனைத்து ** மற்ற கிளைகளுக்கும்` `ஆழம்`` அமைப்பதற்கு நீங்கள் பொறுப்பு. இல்லையெனில், கிராபிக்ச் பநிஇ அவர்களை ஆதிக்கம் செய்யாமல் விட்டுவிடும்.

source: Normal that comes from the ``vertex()`` function, in view space. If ``skip_vertex_transform`` is enabled, it may not be in view space.
ru: Нормаль, полученная функцией ``vertex()`` в пространстве вида. Если включен ``skip_vertex_transform``, она может не находиться в пространстве вида.
ta: பார்வைக்கு, `` வெர்டெக்ச் () `` செயல்பாட்டிலிருந்து வரும் இயல்பானது. `` Skip_vertex_transform`` இயக்கப்பட்டிருந்தால், அது பார்வை இடத்தில் இருக்காது.

source: Tangent that comes from the ``vertex()`` function, in view space. If ``skip_vertex_transform`` is enabled, it may not be in view space.
ru: Касательная, полученная функцией ``vertex()``, в пространстве вида. Если включен ``skip_vertex_transform``, она может не находиться в пространстве вида.
ta: பார்வையில் `` வெர்டெக்ச் () `` செயல்பாட்டிலிருந்து வரும் தொடுகோடு. `` Skip_vertex_transform`` இயக்கப்பட்டிருந்தால், அது பார்வை இடத்தில் இருக்காது.

source: Binormal that comes from the ``vertex()`` function, in view space. If ``skip_vertex_transform`` is enabled, it may not be in view space.
ru: Бинормаль, полученная из функции ``vertex()`` в пространстве вида. Если включено ``skip_vertex_transform``, она может не находиться в пространстве вида.
ta: பார்வைக்கு, `` வெர்டெக்ச் () `` செயல்பாட்டிலிருந்து வரும் பைனரல். `` Skip_vertex_transform`` இயக்கப்பட்டிருந்தால், அது பார்வை இடத்தில் இருக்காது.

source: out vec3 **NORMAL_MAP**
ga: amach vec3 **NORMAL_MAP**
ta: OUT VEC3 ** இயல்பான_மாப் **

source: Set normal here if reading normal from a texture instead of ``NORMAL``.
ru: Установите здесь значение normal, если считываете значение normal из текстуры вместо ``NORMAL``.
ta: `` இயல்பான`` க்கு பதிலாக ஒரு அமைப்பிலிருந்து இயல்பான வாசிப்பால் இங்கே பொதுவாக அமைக்கவும்.

source: out float **NORMAL_MAP_DEPTH**
ga: snámhphointe amach **NORMAL_MAP_DEPTH**
ta: அவுட் மிதவை ** இயல்பான_மாப்_டெப்ட் **

source: Depth from ``NORMAL_MAP``. Defaults to ``1.0``.
ru: Глубина от ``NORMAL_MAP``. По умолчанию ``1.0``.
ta: `` சாதாரண வரைபடம்`` இலிருந்து ஆழம். இயல்புநிலை `` 1.0``.

source: out vec3 **ALBEDO**
ga: amach vec3 ** ALBEDO **
ta: அவுட் VEC3 ** ஆல்பிடோ **

source: Albedo (default white). Base color.
ru: Альбедо (по умолчанию белый). Базовый цвет.
ta: ஆல்பிடோ (இயல்புநிலை வெள்ளை). அடிப்படை நிறம்.

source: out float **ALPHA**
ga: snámhphointe amach **ALPHA**
ta: வெளியே மிதவை ** ஆல்பா **

source: Alpha (range of ``[0.0, 1.0]``). If read from or written to, the material will go to the transparent pipeline.
ru: Альфа (диапазон ``[0.0, 1.0]``). При чтении или записи материал попадёт в прозрачный конвейер.
ta: ஆல்பா (`` [0.0, 1.0] ``) வரம்பு. இருந்து படித்தால் அல்லது எழுதப்பட்டால், பொருள் வெளிப்படையான குழாய்க்குச் செல்லும்.

source: out float **ALPHA_SCISSOR_THRESHOLD**
ga: snámhphointe amach **ALPHA_SCISSOR_THRESHOLD**
ta: அவுட் மிதவை ** ஆல்பா_சிசோர்_நெர்சோல்ட் **

source: If written to, values below a certain amount of alpha are discarded.
ga: Má scríobhtar chucu, caitear amach luachanna faoi bhun méid áirithe alfa.
ru: При записи значения ниже определенного количества альфа отбрасываются.
ta: எழுதப்பட்டால், ஒரு குறிப்பிட்ட அளவு ஆல்பாவுக்குக் கீழே உள்ள மதிப்புகள் நிராகரிக்கப்படுகின்றன.

source: out float **ALPHA_HASH_SCALE**
ga: snámhphointe amach **ALPHA_HASH_SCALE**
ta: அவுட் மிதவை ** ஆல்பா_ஆச்_ச்கேல் **

source: Alpha hash scale when using the alpha hash transparency mode. Defaults to ``1.0``. Higher values result in more visible pixels in the dithering pattern.
ru: Масштаб альфа-хеша при использовании режима прозрачности альфа-хеша. По умолчанию равен ``1.0``. Более высокие значения приводят к увеличению видимости пикселей в шаблоне дизеринга.
ta: ஆல்பா ஆச் வெளிப்படைத்தன்மை பயன்முறையைப் பயன்படுத்தும் போது ஆல்பா ஆச் அளவு. இயல்புநிலை `` 1.0``. அதிக மதிப்புகள் அதிக புலப்படும் பிக்சல்களை இழிவுபடுத்தும் வடிவத்தில் விளைகின்றன.

source: out float **ALPHA_ANTIALIASING_EDGE**
ga: snámhphointe amach **ALPHA_ANTIALIASING_EDGE**
ta: அவுட் மிதவை ** ஆல்பா_என்டியேசிங்_செட் **

source: The threshold below which alpha to coverage antialiasing should be used. Defaults to ``0.0``. Requires the ``alpha_to_coverage`` render mode. Should be set to a value lower than ``ALPHA_SCISSOR_THRESHOLD`` to be effective.
ru: Пороговое значение, ниже которого следует использовать сглаживание альфа-канала. Значение по умолчанию: ``0.0``. Требует режима рендеринга ``alpha_to_coverage``. Для эффективности значение должно быть ниже ``ALPHA_SCISSOR_THRESHOLD``.
ta: ஆன்டியாலியாசிங்கை கவரேச் செய்வதற்கான ஆல்பாவிற்கு கீழே உள்ள வாசல் பயன்படுத்தப்பட வேண்டும். இயல்புநிலை `` 0.0``. `` ஆல்பா_டோ_கோவர்ச்`` வழங்குதல் பயன்முறை தேவை. பயனுள்ளதாக இருக்க `` ஆல்பா_சிசோர்_நெர்சோல்ட்`` ஐ விடக் குறைவான மதிப்புக்கு அமைக்கப்பட வேண்டும்.

source: out vec2 **ALPHA_TEXTURE_COORDINATE**
ga: amach vec2 **ALPHA_TEXTURE_COORDINATE**
ta: OUT VEC2 ** ஆல்பா_டெக்ச்டூர்_கோர்டினேட் **

source: The texture coordinate to use for alpha-to-coverge antialiasing. Requires the ``alpha_to_coverage`` render mode. Typically set to ``UV * vec2(albedo_texture_size)`` where ``albedo_texture_size`` is the size of the albedo texture in pixels.
ru: Координаты текстуры, используемые для сглаживания альфа-канала. Требует режима рендеринга ``alpha_to_coverage``. Обычно задаётся значение ``UV * vec2(albedo_texture_size)``, где ``albedo_texture_size`` — размер текстуры альбедо в пикселях.
ta: ஆல்பா-க்கு-மறைத்தல் ஆன்டிலியாசிங்கிற்கு பயன்படுத்த அமைப்பு ஒருங்கிணைக்கிறது. `` ஆல்பா_டோ_கோவர்ச்`` வழங்குதல் பயன்முறை தேவை. பொதுவாக `` UV * VEC2 (Albedo_texture_size) `` `` `ஆல்பிடோ_டெக்ச்டுரே_சிச்`` என்பது பிக்சல்களில் உள்ள ஆல்பிடோ அமைப்பின் அளவு.

source: out float **PREMUL_ALPHA_FACTOR**
ta: அவுட் மிதவை ** premul_alpha_factor **

source: Premultiplied alpha factor. Only effective if ``render_mode blend_premul_alpha;`` is used. This should be written to when using a *shaded* material with premultiplied alpha blending for interaction with lighting. This is not required for unshaded materials.
ru: Предварительно умноженный альфа-фактор. Действует только при использовании ``render_mode blend_premul_alpha;``. Этот параметр следует записывать при использовании *затенённого* материала с предварительным альфа-смешением для взаимодействия с освещением. Для незатенённых материалов это не требуется.
ta: முன்கூட்டியே ஆல்பா காரணி. `` ரெண்டர்_மோட் கலவை_பிரெமுல்_ஆல்பா; `` பயன்படுத்தப்பட்டால் மட்டுமே பயனுள்ளதாக இருக்கும். விளக்குகளுடன் தொடர்புகொள்வதற்காக முதன்மையான ஆல்பா கலப்புடன் * நிழல் * பொருளைப் பயன்படுத்தும் போது இது எழுதப்பட வேண்டும். மாற்றப்படாத பொருட்களுக்கு இது தேவையில்லை.

source: out float **METALLIC**
ga: snámhphointe amach **MIOTALACH**
ta: வெளியே மிதவை ** மெட்டாலிக் **

source: Metallic (range of ``[0.0, 1.0]``).
ru: Металлический (диапазон ``[0.0, 1.0]``).
ta: உலோகம் (`` [0.0, 1.0] ``) வரம்பு.

source: out float **SPECULAR**
ga: snámhphointe amach **SPECULAR**
ta: அவுட் மிதவை ** ஏகப்பட்ட **

source: Specular (not physically accurate to change). Defaults to ``0.5``. ``0.0`` disables reflections.
ru: Зеркальный (физически некорректно изменять). Значение по умолчанию: ``0.5``. ``0.0`` отключает отражения.
ta: ஏகப்பட்ட (மாற்றத்திற்கு உடல் ரீதியாக துல்லியமாக இல்லை). இயல்புநிலை `` 0.5``. `` 0.0`` பிரதிபலிப்புகளை முடக்குகிறது.

source: Roughness (range of ``[0.0, 1.0]``).
ru: Шероховатость (диапазон ``[0.0, 1.0]``).
ta: கடினத்தன்மை (`` [0.0, 1.0] ``) வரம்பு.

source: out float **RIM**
ga: snámhphointe amach **RIM**
ta: வெளியே மிதவை ** ரிம் **

source: Rim (range of ``[0.0, 1.0]``). If used, Godot calculates rim lighting. Rim size depends on ``ROUGHNESS``.
ru: Обод (диапазон ``[0.0, 1.0]``). При использовании Godot рассчитывает освещённость обода. Размер обода зависит от параметра ``ROUGHNESS``.
ta: விளிம்பு (`` [0.0, 1.0] ``) வரம்பு. பயன்படுத்தினால், கோடோட் விளிம்பு விளக்குகளை கணக்கிடுகிறது. விளிம்பு அளவு `` கடினத்தன்மை`` சார்ந்துள்ளது.

source: out float **RIM_TINT**
ga: snámhphointe amach **RIM_TINT**
ta: அவுட் மிதவை ** rim_tint **

source: Rim Tint, range of ``0.0`` (white) to ``1.0`` (albedo). If used, Godot calculates rim lighting.
ru: Оттенок контура, диапазон от ``0,0`` (белый) до ``1,0`` (альбедо). При использовании Godot рассчитывает краевое освещение.
ta: ரிம் டின்ட், `` 0.0`` (வெள்ளை) வரையிலான வரம்பு `` 1.0`` (ஆல்பிடோ). பயன்படுத்தினால், கோடோட் விளிம்பு விளக்குகளை கணக்கிடுகிறது.

source: out float **CLEARCOAT**
ga: snámhphointe amach **CLEARCOAT**
ta: வெளியே மிதவை ** கிளியர் கோட் **

source: Small specular blob added on top of the existing one. If used, Godot calculates clearcoat.
ru: Небольшое зеркальное пятно добавлено поверх существующего. При необходимости Godot рассчитывает прозрачный слой.
ta: தற்போதுள்ள ஒன்றின் மேல் சிறிய ஏகப்பட்ட குமிழ் சேர்க்கப்பட்டது. பயன்படுத்தினால், கோடோட் கிளியர் கோட்டை கணக்கிடுகிறது.

source: out float **CLEARCOAT_GLOSS**
ga: snámhphointe amach **CLEARCOAT_GLOSS**
ta: வெளியே மிதவை ** clearCoat_gloss **

source: Gloss of clearcoat. If used, Godot calculates clearcoat.
ru: Глянец прозрачного покрытия. Если используется, Godot рассчитывает количество прозрачного покрытия.
ta: கிளியர் கோட்டின் பளபளப்பு. பயன்படுத்தினால், கோடோட் கிளியர் கோட்டை கணக்கிடுகிறது.

source: out float **ANISOTROPY**
ga: snámhphointe amach **ANISOTROPY**
ta: வெளியே மிதவை ** அனிசோட்ரோபி **

source: For distorting the specular blob according to tangent space.
ga: Chun an blob specular a shaobhadh de réir spás tangent.
ru: Для искажения зеркального пятна в соответствии с касательным пространством.
ta: தொடுகோடு இடத்திற்கு ஏற்ப ஏகப்பட்ட குமிழியை சிதைக்க.

source: out vec2 **ANISOTROPY_FLOW**
ga: amach vec2 **ANISOTROPY_FLOW**
ta: அவுட் VEC2 ** anisotropy_flow **

source: Distortion direction, use with flowmaps.
ga: Treo saobhadh, úsáid le flowmaps.
ru: Направление искажения, используйте с flowmaps.
ta: விலகல் திசை, ஃப்ளோமேப்சுடன் பயன்படுத்தவும்.

source: out float **SSS_STRENGTH**
ga: snámhphointe amach **SSS_STRENGTH**
ta: வெளியே மிதவை ** SSS_STRENGTH **

source: Strength of subsurface scattering. If used, subsurface scattering will be applied to the object.
ru: Сила подповерхностного рассеяния. При использовании этого параметра к объекту будет применено подповерхностное рассеяние.
ta: மேற்பரப்பு சிதறலின் வலிமை. பயன்படுத்தினால், பொருளுக்கு மேற்பரப்பு சிதறல் பயன்படுத்தப்படும்.

source: Color of subsurface scattering transmittance. If used, subsurface scattering transmittance will be applied to the object.
ru: Цвет коэффициента пропускания подповерхностного рассеяния. При использовании этого параметра к объекту будет применен коэффициент пропускания подповерхностного рассеяния.
ta: மேற்பரப்பு சிதறல் பரிமாற்றத்தின் நிறம். பயன்படுத்தினால், மேற்பரப்பு சிதறல் பரிமாற்றம் பொருளுக்கு பயன்படுத்தப்படும்.

source: out float **SSS_TRANSMITTANCE_DEPTH**
ga: snámhphointe amach **SSS_TRANSMITTANCE_DEPTH**
ta: அவுட் மிதவை ** sss_transmittance_depth **

source: Depth of subsurface scattering transmittance. Higher values allow the effect to reach deeper into the object.
ru: Цвет коэффициента пропускания подповерхностного рассеяния. При использовании этого параметра к объекту будет применен коэффициент пропускания подповерхностного рассеяния.
ta: மேற்பரப்பு சிதறல் பரிமாற்றத்தின் ஆழம். அதிக மதிப்புகள் விளைவை பொருளில் ஆழமாக அடைய அனுமதிக்கின்றன.

source: out float **SSS_TRANSMITTANCE_BOOST**
ga: snámhphointe amach **SSS_TRANSMITTANCE_BOOST**
ta: வெளியே மிதவை ** SSS_TRANSMITTANCE_BOOST **

source: Boosts the subsurface scattering transmittance if set above ``0.0``. This makes the effect show up even on directly lit surfaces
ru: Увеличивает коэффициент пропускания подповерхностного рассеяния, если значение выше ``0,0``. Благодаря этому эффект проявляется даже на прямо освещённых поверхностях
ta: `` 0.0`` க்கு மேலே அமைக்கப்பட்டால் மேற்பரப்பு சிதறல் பரிமாற்றத்தை அதிகரிக்கும். இது நேரடியாக ஒளிரும் மேற்பரப்புகளில் கூட விளைவைக் காண்பிக்கும்

source: inout vec3 **BACKLIGHT**
ta: VEC3 ** பின்னொளி **

source: Color of backlighting (works like direct light, but it's received even if the normal is slightly facing away from the light). If used, backlighting will be applied to the object. Can be used as a cheaper approximation of subsurface scattering.
ru: Цвет подсветки (работает как прямой свет, но принимается даже если нормаль слегка отвёрнута от источника). При использовании подсветка применяется к объекту. Может использоваться как более дешёвое приближение подповерхностного рассеяния.
ta: பின்னொளியின் நிறம் (நேரடி ஒளி போல வேலை செய்கிறது, ஆனால் இயல்பானது ஒளியிலிருந்து சற்று எதிர்கொண்டாலும் அது பெறப்படுகிறது). பயன்படுத்தினால், பொருளுக்கு பின்னொளி பயன்படுத்தப்படும். மேற்பரப்பு சிதறலின் மலிவான தோராயமாக பயன்படுத்தலாம்.

source: out float **AO**
ga: snámhphointe amach **AO**
ta: வெளியே மிதவை ** ao **

source: Strength of ambient occlusion. For use with pre-baked AO.
ru: Сила окклюзии окружающего света. Для использования с предварительно запечёнными АО.
ta: சுற்றுப்புற மறுப்பின் வலிமை. முன் சுடப்பட்ட AO உடன் பயன்படுத்த.

source: out float **AO_LIGHT_AFFECT**
ga: snámhphointe amach **AO_LIGHT_AFFECT**
ta: வெளியே மிதவை ** ao_light_affect **

source: How much ambient occlusion affects direct light (range of ``[0.0, 1.0]``, default ``0.0``).
ru: Степень влияния фонового преграждения на прямой свет (диапазон ``[0.0, 1.0]``, по умолчанию ``0.0``).
ta: நேரடி ஒளியை எவ்வளவு சுற்றுப்புற மறைவு பாதிக்கிறது (`` [0.0, 1.0] ``, இயல்புநிலை `0.0``).

source: out vec3 **EMISSION**
ga: amach vec3 **ASTAÍOCHTAÍ **
ta: அவுட் VEC3 ** உமிழ்வு **

source: Emission color (can go over ``(1.0, 1.0, 1.0)`` for HDR).
ru: Цвет излучения (может превышать ``(1.0, 1.0, 1.0)`` для HDR).
ta: உமிழ்வு நிறம் (HDR க்கு `` (1.0, 1.0, 1.0) ``) செல்லலாம்.

source: out vec4 **FOG**
ga: amach vec4 **FOG**
ta: அவுட் VEC4 ** FOG **

source: If written to, blends final pixel color with ``FOG.rgb`` based on ``FOG.a``.
ru: При записи смешивает окончательный цвет пикселя с ``FOG.rgb`` на основе ``FOG.a``.
ta: எழுதப்பட்டால், `` FOG.A`` இன் அடிப்படையில் இறுதி படப்புள்ளி நிறத்தை `` FOG.RGB`` உடன் கலக்கிறது.

source: out vec4 **RADIANCE**
ga: amach vec4 **RADIANCE**
ta: அவுட் VEC4 ** ஒளி **

source: If written to, blends environment map radiance with ``RADIANCE.rgb`` based on ``RADIANCE.a``.
ru: Если указано, смешивает яркость карты окружения с ``RADIANCE.rgb`` на основе ``RADIANCE.a``.
ta: எழுதப்பட்டால், சுற்றுச்சூழல் வரைபட பிரகாசத்தை `` radiance.rgb`` உடன் கலக்கிறது `` ரேடியன்ச்.ஏ.

source: out vec4 **IRRADIANCE**
ga: amach vec4 **IRRADIANCE**
ta: அவுட் VEC4 ** கதிர்வீச்சு **

source: If written to, blends environment map irradiance with ``IRRADIANCE.rgb`` based on ``IRRADIANCE.a``.
ru: Если указано, смешивает освещенность карты окружения с ``IRRADIANCE.rgb`` на основе ``IRRADIANCE.a``.
ta: எழுதப்பட்டால், சுற்றுச்சூழல் வரைபடத்தை கதிர்வீச்சைக் கலக்கிறது `` iradiance.rgb`` `` irradiance.a``.

source: Shaders going through the transparent pipeline when ``ALPHA`` is written to may exhibit transparency sorting issues. Read the :ref:`transparency sorting section in the 3D rendering limitations page <doc_3d_rendering_limitations_transparency_sorting>` for more information and ways to avoid issues.
ga: D'fhéadfadh ceisteanna sórtála trédhearcachta a bheith i gceist le scáthaitheoirí a théann tríd an bpíblíne thrédhearcach nuair a scríobhtar ``ALPHA``. Léigh an :ref:`rannán sórtála trédhearcachta ar an leathanach um shrianta rindreála 3D <doc_3d_rendering_limitations_transparency_sorting>` le haghaidh tuilleadh faisnéise agus bealaí chun fadhbanna a sheachaint.
ru: Шейдеры, проходящие через конвейер прозрачности при записи ``ALPHA``, могут иметь проблемы с сортировкой прозрачности. Прочитайте раздел :ref:`сортировка прозрачности на странице ограничений 3D-рендеринга <doc_3d_rendering_limitations_transparency_sorting>` для получения дополнительной информации и способов избежать проблем.
ta: `` ஆல்பா`` எழுதப்படும்போது வெளிப்படையான குழாய் வழியாக செல்லும் சேடர்கள் வெளிப்படைத்தன்மை வரிசையாக்க சிக்கல்களை வெளிப்படுத்தக்கூடும். படிக்கவும்: ref: `3D வழங்குதல் வரம்புகள் பக்கத்தில் <doc_3d_rendering_imitations_transparency_sorting>` சிக்கல்களைத் தவிர்ப்பதற்கான வழிகளுக்கு வெளிப்படைத்தன்மை வரிசையாக்கப் பிரிவு <doc_3d_rendering_imitations_transperancy_sorting.

source: Light built-ins
ga: Solas-tógtha isteach
ru: Встроенные константы шейдеров света
ta: லைட் பில்ட்-இன்ச்

source: Writing light processor functions is completely optional. You can skip the ``light()`` function by using the ``unshaded`` render mode. If no light function is written, Godot will use the material properties written to in the ``fragment()`` function to calculate the lighting for you (subject to the render mode).
ru: Написание функций светового процессора совершенно необязательно. Вы можете пропустить функцию ``light()``, используя режим рендеринга ``unshaded``. Если функция освещения не написана, Godot будет использовать свойства материала, записанные в функции ``fragment()``, для расчёта освещения (в зависимости от режима рендеринга).
ta: ஒளி செயலி செயல்பாடுகளை எழுதுவது முற்றிலும் விருப்பமானது. `` மாற்றப்படாத`` வழங்குதல் பயன்முறையைப் பயன்படுத்தி `` ஒளி () `செயல்பாட்டை நீங்கள் தவிர்க்கலாம். ஒளி செயல்பாடு எதுவும் எழுதப்படாவிட்டால், உங்களுக்கான விளக்குகளைக் கணக்கிட `` துண்டு () `` செயல்பாட்டில் எழுதப்பட்ட பொருள் பண்புகளை கோடோட் பயன்படுத்தும் (ரெண்டர் பயன்முறைக்கு உட்பட்டது).

source: The ``light()`` function is called for every light in every pixel. It is called within a loop for each light type.
ru: Функция ``light()`` вызывается для каждого источника света в каждом пикселе. Она вызывается внутри цикла для каждого типа источника света.
ta: ஒவ்வொரு பிக்சலிலும் உள்ள ஒவ்வொரு ஒளிக்கும் `` ஒளி () `` செயல்பாடு அழைக்கப்படுகிறது. இது ஒவ்வொரு ஒளி வகைக்கும் ஒரு வளையத்திற்குள் அழைக்கப்படுகிறது.

source: Below is an example of a custom ``light()`` function using a Lambertian lighting model:
ru: Ниже приведен пример пользовательской функции ``light()``, использующей Ламбертовскую модель освещения:
ta: லம்பெர்டியன் லைட்டிங் மாதிரியைப் பயன்படுத்தி தனிப்பயன் `` ஒளி () `செயல்பாட்டின் எடுத்துக்காட்டு கீழே:

source: If you want the lights to add together, add the light contribution to ``DIFFUSE_LIGHT`` using ``+=``, rather than overwriting it.
ga: Más mian leat na soilse a chur le chéile, cuir an ranníocaíocht éadrom le ''DIFFUSE_LIGHT'' ag baint úsáide as ''+='', seachas é a fhorscríobh.
ru: Если вы хотите, чтобы освещение суммировалось, добавьте вклад освещения в ``DIFFUSE_LIGHT``, используя ``+=``, а не перезаписывайте его.
ta: விளக்குகள் ஒன்றாகச் சேர்க்க விரும்பினால், அதை மேலெழுதாமல், ``+= `` பயன்படுத்தி `` டிஃப்யூச்_லிட்` இல் ஒளி பங்களிப்பை சேர்க்கவும்.

source: The ``light()`` function won't be run if the ``vertex_lighting`` render mode is enabled, or if :ref:`Rendering > Quality > Shading > Force Vertex Shading<class_ProjectSettings_property_rendering/shading/overrides/force_vertex_shading>` is enabled in the Project Settings. (It's enabled by default on mobile platforms.)
ru: Функция ``light()`` не будет запущена, если включен режим рендеринга ``vertex_lighting`` или если в настройках проекта включен параметр :ref:`Rendering > Quality > Shading > Force Vertex Shading<class_ProjectSettings_property_rendering/shading/overrides/force_vertex_shading>`. (На мобильных платформах он включен по умолчанию.)
ta: `` Vertex_lighting`` வழங்குதல் பயன்முறை இயக்கப்பட்டிருந்தால் `` ஒளி () `` செயல்பாடு இயக்கப்படாது, அல்லது if: ren: `ரெண்டரிங்> தரம்> நிழல்> ஆற்றல் வெர்டெக்ச் நிழல் <class_projectsettings_property_rending/overrides/force_vertings_shadting>` isadginting> (இது மொபைல் தளங்களில் இயல்பாக இயக்கப்பட்டது.)

source: Coordinate of pixel center in screen space. ``xy`` specifies position in window, ``z`` specifies fragment depth if ``DEPTH`` is not used. Origin is lower-left.
ga: Comhordanáid an ionaid picteilín i spás scáileáin. Sonraíonn ''xy'' suíomh san fhuinneog, sonraíonn ''z'' doimhneacht ilroinnte mura n-úsáidtear ''DOIMHNEACHT''. Tá bunús níos ísle ar chlé.
ru: Координата центра пикселя в пространстве экрана. ``xy`` задаёт позицию в окне, ``z`` задает глубину фрагмента, если ``DEPTH`` не используется. Ориентир - левый нижний угол.
ta: திரை இடத்தில் படப்புள்ளி மையத்தின் ஒருங்கிணைப்பு. `` xy`` `சாளரத்தில் நிலையை குறிப்பிடுகிறது,` `z``` `ஆழம்`` பயன்படுத்தப்படாவிட்டால் துண்டு ஆழத்தைக் குறிப்பிடுகிறது. தோற்றம் குறைந்த இடது.

source: in vec3 **NORMAL**
ga: i vec3 **NORMAL**
ta: VEC3 ** இயல்பான ** இல்

source: Normal vector, in view space.
ga: Gnáth veicteoir, i spás amhairc.
ru: Нормальный вектор в пространстве вида.
ta: சாதாரண திசையன், பார்வை இடத்தில்.

source: View vector, in view space.
ga: Féach ar veicteoir, in view space.
ru: Вид вектора в пространстве вида.
ta: திசையனைக் காண்க, பார்வை இடத்தில்.

source: in vec3 **LIGHT**
ga: i vec3 ** SOLAS **
ta: VEC3 ** ஒளி ** இல்

source: Light vector, in view space.
ru: Вектор света в пространстве зрения.
ta: ஒளி திசையன், பார்வை இடத்தில்.

source: in vec3 **LIGHT_COLOR**
ta: VEC3 ** Light_Color ** இல்

source: :ref:`Light color<class_Light3D_property_light_color>` multiplied by :ref:`light energy<class_Light3D_property_light_energy>` multiplied by ``PI``. The ``PI`` multiplication is present because physically-based lighting models include a division by ``PI``.
ru: :ref:`Цвет света<class_Light3D_property_light_color>` умножается на :ref:`Энергия света<class_Light3D_property_light_energy>` умножается на ``ПИ``. Умножение на ``ПИ`` присутствует, поскольку физические модели освещения включают деление на ``ПИ``.
ta: . `` பை`` பெருக்கல் உள்ளது, ஏனெனில் உடல் அடிப்படையிலான லைட்டிங் மாதிரிகள் `` பை`` ஒரு பிரிவை உள்ளடக்குகின்றன.

source: in float **SPECULAR_AMOUNT**
ga: i snámhphointe **SPECULAR_AMOUNT**
ta: மிதவையில் ** Seploral_amount **

source: For :ref:`class_OmniLight3D` and :ref:`class_SpotLight3D`, ``2.0`` multiplied by :ref:`light_specular<class_Light3D_property_light_specular>`. For :ref:`class_DirectionalLight3D`, ``1.0``.
ru: Для :ref:`class_OmniLight3D` и :ref:`class_SpotLight3D`, ``2.0`` умножается на :ref:`light_specular<class_Light3D_property_light_specular>`. Для :ref:`class_DirectionalLight3D`, ``1.0``.
ta: For: ref: `class_omnilight3d` மற்றும்: ref:` class_spotlight3d`, `` 2.0`` மூலம் பெருக்கப்படுகிறது: குறிப்பு: `லைட்_ச்பெக்யூலர் <class_light3d_property_light_specular>`. For: ref: `class_directionallight3d`,` `1.0``.

source: in bool **LIGHT_IS_DIRECTIONAL**
ga: i bool **LIGHT_IS_DIRECTIONAL**
ta: bool ** light_is_directional ** இல்

source: ``true`` if this pass is a :ref:`class_DirectionalLight3D`.
ru: ``true``, если этот проход является :ref:`class_DirectionalLight3D`.
ta: `` உண்மை`` இந்த பாச் ஒரு: குறிப்பு: `class_rectionallight3d`.

source: in float **ATTENUATION**
ga: i snámhphointe **ATTENUATION**
ta: மிதவை ** விழிப்புணர்வு **

source: Attenuation based on distance or shadow.
ga: Maolú bunaithe ar fhad nó scáth.
ru: Затухание в зависимости от расстояния или тени.
ta: தூரம் அல்லது நிழலின் அடிப்படையில் விழிப்புணர்வு.

source: in vec3 **ALBEDO**
ga: agus níos mó3 **ALBEDO**
ta: VEC3 ** ஆல்பிடோ ** இல்

source: Base albedo.
ga: Bonn albedo.
ru: Базовое альбедо.
ta: அடிப்படை ஆல்பெடோ.

source: in vec3 **BACKLIGHT**
ga: i vec3 **BACKLIGHT**
ta: VEC3 ** பின்னொளி **

source: in float **METALLIC**
ga: i snámhphointe **MIOTALACH**
ta: மிதவை ** உலோக **
