Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shader_reference/spatial_shader.po
Languages: ga, ru, ta

source: Metallic.
ga: Miotalach.
ru: Металлический.
ta: உலோகம்.

source: in float **ROUGHNESS**
ga: i snámhphointe **ROUGHNESS**
ta: மிதவையில் ** கடினத்தன்மை **

source: Roughness.
ga: Gairbhe.
ru: Шероховатость.
ta: கடினத்தன்மை.

source: Diffuse light result.
ga: Toradh solais idirleata.
ru: Результат — рассеянный свет.
ta: ஒளி முடிவு.

source: out vec3 **SPECULAR_LIGHT**
ga: amach vec3 **SPECULAR_LIGHT**
ta: OUT VEC3 ** Seploral_light **

source: Specular light result.
ga: Toradh solais specular.
ru: Результат зеркального света.
ta: ஏகப்பட்ட ஒளி முடிவு.

source: Alpha (range of ``[0.0, 1.0]``). If written to, the material will go to the transparent pipeline.
ru: Альфа (диапазон ``[0.0, 1.0]``). При записи материал будет передан в прозрачный pipeline.
ta: ஆல்பா (`` [0.0, 1.0] ``) வரம்பு. எழுதப்பட்டால், பொருள் வெளிப்படையான குழாய்க்குச் செல்லும்.

source: Transparent materials also cannot cast shadows or appear in ``hint_screen_texture`` and ``hint_depth_texture`` uniforms. This in turn prevents those materials from appearing in screen-space reflections or refraction. :ref:`SDFGI <doc_using_sdfgi>` sharp reflections are not visible on transparent materials (only rough reflections are visible on transparent materials).
ga: Ní féidir le hábhair thrédhearcacha scáthanna a chaitheamh nó a bheith le feiceáil in éidí ``leid_screen_texture`` agus ``leid_depth_texture``. Cuireann sé seo cosc ar na hábhair sin ó bheith le feiceáil i bhfrithchaitheamh spáis scáileáin nó in athraonta. :ref:`SDFGI <doc_using_sdfgi>` níl frithchaitheamh géara le feiceáil ar ábhair thrédhearcacha (ní bhíonn ach frithchaitheamh garbh le feiceáil ar ábhair thrédhearcacha).
ru: Прозрачные материалы также не могут отбрасывать тени или появляться в uniform-переменных ``hint_screen_texture`` и ``hint_depth_texture``. Это, в свою очередь, не позволяет этим материалам появляться в отражениях или преломлениях в экранном пространстве. :ref:`SDFGI <doc_using_sdfgi>` резкие отражения не видны на прозрачных материалах (на прозрачных материалах видны только грубые отражения).
ta: வெளிப்படையான பொருட்கள் நிழல்களை செலுத்தவோ அல்லது `` HINT_SCREEN_TEXTURE`` மற்றும் `` HINT_DEPTH_TEXTURE` சீருடையில் தோன்றவோ முடியாது. இது திரை-விண்வெளி பிரதிபலிப்புகள் அல்லது ஒளிவிலகல் ஆகியவற்றில் தோன்றுவதைத் தடுக்கிறது. .

source: **blend_mix**
ga: **meascán_meascán**
ru: **blеnd_mix**

source: **blend_add**
ga: **cumasc_cuir leis **
ru: **blеnd_add**

source: **blend_mul**
ga: **cumasc_mul**
ru: **blеnd_mul**

source: **sss_mode_skin**
ga: **Ssss_mod_craice**

source: Subsurface Scattering mode for skin.
ga: Modh scaipthe fodhromchla don chraiceann.

source: **cull_back**
ga: **cull_siúl**
ru: **cull_baсk**

source: **cull_front**
ga: **coimeád_tosaich**
ru: **cull_frоnt**

source: **cull_disabled**
ga: **cull_dhíchumasa**
ru: **cull_disablеd**

source: Result is just albedo. No lighting/shading happens in material.
ga: Níl sa toradh ach albedo. Ní tharlaíonn aon soilsiú / scáthú in ábhar.

source: Geometry draws using lines.
ga: Tarraingíonn céimseata ag baint úsáide as línte.

source: Lambert wrapping (roughness dependent) for diffuse.
ga: Lambert timfhilleadh (ag brath ar ghairbhe) le haghaidh idirleata.

source: Schlick-GGX for specular (default).
ga: Schlick-GGX le haghaidh specular (réamhshocrú).

source: Toon for specular.
ga: Toon do specular.

source: Disable specular.
ga: Díchumasaigh specular.

source: VERTEX/NORMAL/etc. need to be transformed manually in vertex function.
ga: Ní mór VERTEX / NORMAL / etc. a chlaochlú de láimh i bhfeidhm vertex.

source: **world_vertex_coords**
ga: **comhordach_vertex_domhana**
ru: **wоrld_vertex_coords**

source: VERTEX/NORMAL/etc. are modified in world coordinates instead of local.
ga: Déantar VERTEX / NORMAL / etc. a mhodhnú i gcomhordanáidí domhanda in ionad áitiúil.

source: Use when non-uniform scale is applied to mesh.
ga: Úsáid nuair a chuirtear scála neamh-aonfhoirmeach i bhfeidhm ar an mogalra.

source: **shadows_disabled**
ga: **scáthannaí_díchumasa**

source: Disable computing shadows in shader.
ga: Díchumasaigh scáthanna ríomhaireachta sa scáthán.

source: **shadow_to_opacity**
ga: **scáth_to_éagsúlacht**
ru: **Тень_непрозрачна**

source: **vertex_lighting**
ga: **soilsiú vertex**
ru: **vеrtex_lighting**

source: Use vertex-based lighting.
ga: Bain úsáid as soilsiú vertex-bhunaithe.

source: **fog_disabled**
ga: **ceann_díchumasáil**

source: Disable receiving depth-based or volumetric fog. Useful for blend_add materials like particles.
ga: Díchumasaigh ceo doimhneachtbhunaithe nó toirtmhéadrach a fháil. Úsáideach le haghaidh ábhair blend_add cosúil le cáithníní.

source: Values marked as "in" are read-only. Values marked as "out" are for optional writing and will not necessarily contain sensible values. Values marked as "inout" provide a sensible default value, and can optionally be written to. Samplers are not subjects of writing and they are not marked.
ga: Tá luachanna marcáilte mar "i" inléite amháin. Tá luachanna marcáilte mar "amach" le haghaidh scríbhneoireacht roghnach agus ní gá go mbeadh luachanna ciallmhara iontu. Soláthraíonn luachanna marcáilte mar "inout" luach réamhshocraithe ciallmhar, agus is féidir iad a scríobh go roghnach. Ní ábhair scríbhneoireachta iad samplers agus níl siad marcáilte.

source: A ``PI`` constant (``3.141592``). A ration of circle's circumference to its diameter and amount of radians in half turn.
ga: Tairiseach ''PI'' (''3.141592''). Ciondáil imlíne an chiorcail ar a thrastomhas agus méid na radians i leath-sheal.

source: Vertex data (``VERTEX``, ``NORMAL``, ``TANGENT``, ``BITANGENT``) are presented in local model space. If not written to, these values will not be modified and be passed through as they came.
ga: Cuirtear sonraí vertex ('VERTEX'', ''NORMAL'', ''TANGENT'', ''BITANGENT'') i láthair i spás samhail áitiúil. Mura bhfuil siad scríofa chuig, ní dhéanfar na luachanna seo a mhodhnú agus a chur tríd de réir mar a tháinig siad.

source: They can optionally be presented in world space by using the *world_vertex_coords* render mode.
ga: Is féidir iad a chur i láthair go roghnach i spás domhanda tríd an modh rindreála *world_vertex_coords *a úsáid.

source: Other built-ins, such as UV, UV2 and COLOR, are also passed through to the fragment function if not modified.
ga: Cuirtear ionsuite eile, mar UV, UV2 agus COLOR, ar aghaidh chuig an bhfeidhm ilroinnte mura ndéantar iad a mhodhnú.

source: For instancing, the INSTANCE_CUSTOM variable contains the instance custom data. When using particles, this information is usually:
ga: Le haghaidh instancing, tá an athróg INSTANCE_CUSTOM na sonraí saincheaptha shampla. Agus cáithníní á n-úsáid, is iondúil go mbíonn an fhaisnéis seo:

source: **y**: Phase during lifetime (0 to 1).
ga: ** y **: Céim le linn an tsaoil (0 go 1).

source: Node world space position.
ga: Suíomh spáis domhanda nód.

source: Node view space position.
ga: Nód amharc ar shuíomh spáis.

source: Camera world space position.
ga: Suíomh spáis domhanda ceamara.

source: Camera world space direction.
ga: Ceamara treo spás domhan.

source: ``true`` when output is in sRGB color space (this is ``true`` in the Compatibility renderer, ``false`` in Forward+ and Forward Mobile).
ga: ''true'' nuair a bhíonn an t-aschur i spás datha sRGB (is é seo ''fíor'' sa rindreálaí Comhoiriúnachta, ''bréagach'' in Forward + agus Forward Mobile).

source: Vertex in local coordinates.
ga: Stuaic i gcomhordanáidí áitiúla.

source: Normal in local coordinates.
ga: Gnáth i gcomhordanáidí áitiúla.

source: Tangent in local coordinates.
ga: Tangent i gcomhordanáidí áitiúla.

source: Binormal in local coordinates.
ga: Binormal i gcomhordanáidí áitiúla.

source: If written to, overrides final vertex position.
ga: Má tá sé scríofa chuig, sáraíonn sé an suíomh deiridh stuaic.

source: inout float **POINT_SIZE**
ga: snámhphointe inout **POINT_SIZE**

source: inout mat4 **MODELVIEW_MATRIX**
ga: mat4 inout **MODELVIEW_MATRIX**

source: Model space to view space transform (use if possible).
ga: Samhail spás chun athrú spáis a fheiceáil (úsáid más féidir).

source: inout mat3 **MODELVIEW_NORMAL_MATRIX**
ga: mat3 inout **MODELVIEW_NORMAL_MATRIX**

source: Model space to world space transform.
ga: Samhail spás a athrú spás domhan.

source: ``INV_VIEW_MATRIX`` is the matrix used for rendering the object in that pass, not like ``MAIN_CAM_INV_VIEW_MATRIX``, which is the matrix of the camera in the scene. In the shadow pass, ``INV_VIEW_MATRIX``'s view is based on the camera that is located at the position of the light.
ga: Is é ''INV_VIEW_MATRIX'' an maitrís a úsáidtear chun an réad a dhéanamh sa phas sin, ní cosúil le ''MAIN_CAM_INV_VIEW_MATRIX'', arb é maitrís an cheamara sa radharc é. Sa phas scátha, tá dearcadh ''INV_VIEW_MATRIX'' bunaithe ar an gceamara atá suite ag suíomh an tsolais.

source: ``true`` if current face is front facing.
ga: ''fíor'' má tá aghaidh reatha chun tosaigh.

source: UV that comes from vertex function.
ga: UV a thagann ó fheidhm vertex.

source: UV2 that comes from vertex function.
ga: UV2 a thagann ó fheidhm vertex.

source: COLOR that comes from vertex function.
ga: DATH a thagann ó fheidhm vertex.

source: Point Coordinate for drawing points with POINT_SIZE.
ga: Pointe Comhordanáid le haghaidh pointí líníochta le POINT_SIZE.

source: Vertex that comes from vertex function (default, in view space).
ga: Stuaic a thagann ó fheidhm vertex (réamhshocrú, i spás amhairc).

source: sampler2D **SCREEN_TEXTURE**
ga: Sampler2D**SCÁIN_TEXTURE**

source: Custom depth value (0..1). If ``DEPTH`` is being written to in any shader branch, then you are responsible for setting the ``DEPTH`` for **all** other branches. Otherwise, the graphics API will leave them uninitialized.
ga: Luach doimhneachta saincheaptha (0..1). Má tá ''DOIMHNEACHT'' á scríobh chuig aon bhrainse shader, ansin tá tú freagrach as an ''DOIMHNEACHT'' a shocrú do **gach ** brainse eile. Seachas sin, fágfaidh an API grafaicí iad gan túsú.

source: Normal that comes from vertex function (default, in view space).
ga: Gnáth a thagann ó fheidhm vertex (réamhshocrú, i spás amharc).

source: Tangent that comes from vertex function.
ga: Tangent a thagann ó fheidhm vertex.

source: Binormal that comes from vertex function.
ga: Binormal a thagann ó fheidhm vertex.

source: Set normal here if reading normal from a texture instead of NORMAL.
ga: Socraigh gnáth anseo má tá tú ag léamh gnáth ó uigeacht in ionad NORMAL.

source: Depth from variable above. Defaults to 1.0.
ga: Doimhneacht ón athróg thuas. Réamhshocruithe go 1.0.

source: Albedo (default white).
ga: Albedo (bán réamhshocraithe).

source: Alpha (0..1); if read from or written to, the material will go to the transparent pipeline.
ga: Alfa (0..1); Má léitear ón ábhar nó má scríobhtar chuige é, rachaidh an t-ábhar go dtí an phíblíne thrédhearcach.

source: Metallic (0..1).
ga: Miotalach (0..1).

source: Specular. Defaults to 0.5, best not to modify unless you want to change IOR.
ga: Specular. Réamhshocruithe go 0.5, is fearr gan a mhodhnú ach amháin más mian leat a athrú IOR.

source: Roughness (0..1).
ga: Gairbhe (0..1).

source: Rim (0..1). If used, Godot calculates rim lighting.
ga: Imeall (0..1). Má úsáidtear é, ríomhann Godot soilsiú imeall.

source: Rim Tint, goes from 0 (white) to 1 (albedo). If used, Godot calculates rim lighting.
ga: Rim Tint, téann ó 0 (bán) go 1 (albedo). Má úsáidtear é, ríomhann Godot soilsiú imeall.

source: Small added specular blob. If used, Godot calculates Clearcoat.
ga: Blob specular beag breise. Má úsáidtear é, ríomhann Godot Clearcoat.

source: Gloss of Clearcoat. If used, Godot calculates Clearcoat.
ga: Snasta Clearcoat. Má úsáidtear é, ríomhann Godot Clearcoat.

source: Strength of Subsurface Scattering. If used, Subsurface Scattering will be applied to object.
ga: Neart Scaipeadh Subsurface. Má úsáidtear é, cuirfear Scaipeadh Fodhromchla i bhfeidhm ar réad.

source: out vec4 **SSS_TRANSMITTANCE_COLOR**
ga: amach vec4 **SSS_TRANSMITTANCE_COLOR**

source: Strength of Ambient Occlusion. For use with pre-baked AO.
ga: Neart an Occlusion Comhthimpeallach. Le húsáid le AO réamhbhácáilte.

source: How much AO affects lights (0..1; default 0).
ga: Cé mhéad a théann AO i bhfeidhm ar shoilse (0..1; réamhshocrú 0).

source: Emission color (can go over 1,1,1 for HDR).
ga: Dath astaíochta (is féidir dul thar 1,1,1 le haghaidh HDR).

source: If written to, blends final pixel color with FOG.rgb based on FOG.a.
ga: Má tá sé scríofa chuig, blends dath picteilín deiridh le FOG.rgb bunaithe ar FOG.a.

source: If written to, blends environment map radiance with RADIANCE.rgb based on RADIANCE.a.
ga: Má tá sé scríofa chuig, blends radiance léarscáil timpeallacht le RADIANCE.rgb bunaithe ar RADIANCE.a.

source: If written to, blends environment map IRRADIANCE with IRRADIANCE.rgb based on IRRADIANCE.a.
ga: Má tá sé scríofa chuig, blends léarscáil timpeallacht IRRADIANCE le IRRADIANCE.rgb bunaithe ar IRRADIANCE.a.

source: Writing light processor functions is completely optional. You can skip the light function by setting render_mode to ``unshaded``. If no light function is written, Godot will use the material properties written to in the fragment function to calculate the lighting for you (subject to the render_mode).
ga: Tá feidhmeanna próiseálaí solais a scríobh go hiomlán roghnach. Is féidir leat an fheidhm solais a scipeáil trí render_mode a shocrú go ''unshaded''. Mura bhfuil aon fheidhm éadrom scríofa, úsáidfidh Godot na hairíonna ábhartha atá scríofa san fheidhm ilroinnte chun an soilsiú a ríomh duit (faoi réir an render_mode).

source: The light function is called for every light in every pixel. It is called within a loop for each light type.
ga: Glaoitear an fheidhm solais ar gach solas i ngach picteilín. Glaoitear é laistigh de lúb do gach cineál solais.

source: Below is an example of a custom light function using a Lambertian lighting model:
ga: Seo thíos sampla d'fheidhm solais saincheaptha ag baint úsáide as samhail soilsithe Lambertian:

source: The ``light()`` function won't be run if the ``vertex_lighting`` render mode is enabled, or if **Rendering > Quality > Shading > Force Vertex Shading** is enabled in the Project Settings. (It's enabled by default on mobile platforms.)
ga: Ní reáchtálfar an fheidhm `` solas ()`` má tá an modh rindreála `` vertex_lighting`` cumasaithe, nó má tá ** Rindreáil > Cáilíocht > Scáthlíniú > Scáthú Vertex Fórsa** cumasaithe i Socruithe an Tionscadail. (Tá sé cumasaithe de réir réamhshocraithe ar ardáin soghluaiste.)

source: Light Vector, in view space.
ga: Veicteoir Éadrom, i spás amhairc.

source: Color of light multiplied by ``energy * PI``. The ``PI`` multiplication is present because physically-based lighting models include a division by ``PI``.
ga: Dath an tsolais iolraithe faoi ''fuinneamh * PI''. Tá an t-iolrú ''PI'' i láthair toisc go n-áirítear le samhlacha soilsithe atá bunaithe go fisiciúil deighilt le ''PI''.

source: 2.0 * ``light_specular`` property for ``OmniLight3D`` and ``SpotLight3D``. 1.0 for ``DirectionalLight3D``.
ga: 2.0 * Maoin ''light_specular'' le haghaidh ''OmniLight3D'' agus ''SpotLight3D''. 1.0 le haghaidh ''DirectionalLight3D''.

source: ``true`` if this pass is a ``DirectionalLight3D``.
ga: ''fíor'' más ''DirectionalLight3D' é an pas seo.

source: out vec3 **DIFFUSE_LIGHT**
ga: amach vec3 **DIFFUSE_LIGHT**

source: Alpha (0..1); if written to, the material will go to the transparent pipeline.
ga: Alfa (0..1); Má scríobhtar chuig an ábhar é, rachaidh an t-ábhar go dtí an phíblíne thrédhearcach.

source: **blend_premul_alpha**
ru: **blеnd_premul_alpha**

source: **diffuse_burley**
ru: **diffuse_burleу**

source: **diffuse_lambert**
ru: **diffusе_lambert**

source: **diffuse_lambert_wrap**
ru: **diffusе_lambert_wrap**

source: **diffuse_toon**
ru: **diffuse_toоn**

source: **skip_vertex_transform**
ru: **skіp_vertex_transform**

source: Disable computing shadows in shader. The shader will not receive shadows, but can still cast them.
ru: Отключить расчёт теней в шейдере. Шейдер не будет получать тени, но сможет их отбрасывать.
