Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shader_reference/spatial_shader.po
Languages: ga, ru, ta

source: For instancing, the ``INSTANCE_CUSTOM`` variable contains the instance custom data. When using particles, this information is usually:
ru: Для создания экземпляров переменная ``INSTANCE_CUSTOM`` содержит пользовательские данные экземпляра. При использовании частиц эта информация обычно выглядит следующим образом:
ta: நிறுவுவதற்கு, `` INSTANCE_CUSTOM`` மாறுபாடு தனிப்பயன் தரவைக் கொண்டுள்ளது. துகள்களைப் பயன்படுத்தும் போது, இந்த செய்தி பொதுவாக:

source: **x**: Rotation angle in radians.
ga: ** x **: Uillinn rothlaithe i radians.
ru: **x**: Угол поворота в радианах.
ta: ** ஃச் **: ரேடியன்களில் சுழற்சி கோணம்.

source: **y**: Phase during lifetime (``0.0`` to ``1.0``).
ru: **y**: Фаза в течение жизни (от ``0.0`` до ``1.0``).
ta: ** ஒய் **: வாழ்நாளில் கட்டம் (`` 0.0`` முதல் `` 1.0``).

source: **z**: Animation frame.
ga: **z **: Fráma beochana.
ru: **z**: Кадр анимации.
ta: ** சட் **: அனிமேசன் சட்டகம்.

source: This allows you to easily adjust the shader to a particle system using default particles material. When writing a custom particle shader, this value can be used as desired.
ga: Ligeann sé seo duit an scáthóir a choigeartú go héasca ar chóras cáithníní ag baint úsáide as ábhar cáithníní réamhshocraithe. Nuair a bhíonn scáthóir cáithníní saincheaptha á scríobh, is féidir an luach seo a úsáid mar atá ag teastáil.
ru: Это позволяет легко настроить шейдер на систему частиц, использующую материал частиц по умолчанию. При написании собственного шейдера частиц это значение можно использовать по своему усмотрению.
ta: இயல்புநிலை துகள்கள் பொருளைப் பயன்படுத்தி ஒரு துகள் அமைப்புக்கு சேடரை எளிதாக சரிசெய்ய இது உங்களை அனுமதிக்கிறது. தனிப்பயன் துகள் சேடரை எழுதும் போது, இந்த மதிப்பை விரும்பியபடி பயன்படுத்தலாம்.

source: in vec2 **VIEWPORT_SIZE**
ru: в vec2 **VIEWPORT_SIZE**
ta: VEC2 ** viewport_size ** இல்

source: Size of viewport (in pixels).
ga: Méid an viewport (i bpicteilíní).
ru: Размер области просмотра (в пикселях).
ta: வியூபோர்ட்டின் அளவு (பிக்சல்களில்).

source: in mat4 **VIEW_MATRIX**
ga: I Mat4 **VIEW_MATRIX**
ru: в mat4 **VIEW_MATRIX**
ta: MAT4 ** VIEW_MATRIX ** இல்

source: World space to view space transform.
ga: Spás domhanda chun athrú spáis a fheiceáil.
ru: Мировое пространство для просмотра трансформации пространства.
ta: விண்வெளி உருமாற்றத்தைக் காண உலக இடம்.

source: in mat4 **INV_VIEW_MATRIX**
ga: I Mat4 **INV_VIEW_MATRIX**
ru: в mat4 **INV_VIEW_MATRIX**
ta: Mat4 ** inv_view_matrix ** இல்

source: View space to world space transform.
ga: Amharc ar spás chun spás domhanda a athrú.
ru: Преобразование из пространства вида в мировое пространство.
ta: உலக விண்வெளி உருமாற்றத்திற்கு இடத்தைக் காண்க.

source: in mat4 **MAIN_CAM_INV_VIEW_MATRIX**
ga: I Mat4 **MAIN_CAM_INV_VIEW_MATRIX**
ru: в mat4 **MAIN_CAM_INV_VIEW_MATRIX**
ta: MAT4 ** Main_cam_inv_view_matrix ** இல்

source: View space to world space transform of camera used to draw the current viewport.
ga: Amharc ar spás chun athrú spáis domhanda a dhéanamh ar cheamara a úsáidtear chun an t-amharc reatha a tharraingt.
ru: Преобразование пространства вида в мировое пространство камеры, используемое для отрисовки текущего окна просмотра.
ta: தற்போதைய காட்சியமைப்பை வரையப் பயன்படுத்தப்படும் கேமராவின் உலக விண்வெளி உருமாற்றத்திற்கான இடத்தைக் காண்க.

source: in mat4 **INV_PROJECTION_MATRIX**
ga: I Mat4 **INV_PROJECTION_MATRIX**
ru: в mat4 **INV_PROJECTION_MATRIX**
ta: Mat4 ** inv_projection_matrix ** இல்

source: Clip space to view space transform.
ga: Clip spás chun athrú spáis a fheiceáil.
ru: Вырезать пространство, чтобы увидеть преобразование пространства.
ta: விண்வெளி உருமாற்றத்தைக் காண இடத்தை கிளிப் செய்யுங்கள்.

source: in vec3 **NODE_POSITION_WORLD**
ru: в vec3 **NODE_POSITION_WORLD**
ta: VEC3 ** node_position_world ** இல்

source: Node position, in world space.
ga: Seasamh nód, i spás domhanda.
ru: Положение узла в мировом пространстве.
ta: முனை நிலை, உலக இடத்தில்.

source: in vec3 **NODE_POSITION_VIEW**
ru: в vec3 **NODE_POSITION_VIEW**
ta: VEC3 ** node_position_view ** இல்

source: Node position, in view space.
ga: Seasamh nód, in view space.
ru: Положение узла в пространстве обзора.
ta: முனை நிலை, பார்வை இடத்தில்.

source: in vec3 **CAMERA_POSITION_WORLD**
ru: в vec3 **CAMERA_POSITION_WORLD**
ta: VEC3 ** Camera_Position_world ** இல்

source: Camera position, in world space.
ga: Suíomh an cheamara, i spás an domhain.
ta: கேமரா நிலை, உலக இடத்தில்.

source: in vec3 **CAMERA_DIRECTION_WORLD**
ru: в vec3 **CAMERA_DIRECTION_WORLD**
ta: VEC3 ** Camera_direction_world ** இல்

source: Camera direction, in world space.
ga: Treo ceamara, i spás domhanda.
ru: Направление камеры в мировом пространстве.
ta: கேமரா திசை, உலக இடத்தில்.

source: in uint **CAMERA_VISIBLE_LAYERS**
ga: uain**CAMERA_VISIBLE_LAYERS**
ru: в uint **CAMERA_VISIBLE_LAYERS**
ta: UINT ** கேமரா_விசிபிள்_லேயர்கள் ** இல்

source: Cull layers of the camera rendering the current pass.
ga: Sraitheanna Cull an cheamara rindreáil an pas atá ann faoi láthair.
ru: Отбрасывание слоев камеры, визуализирующей текущий проход.
ta: தற்போதைய மொழி வழங்கும் கேமராவின் க்ளல் அடுக்குகள்.

source: in int **INSTANCE_ID**
ru: в int **INSTANCE_ID**
ta: int ** instance_id **

source: Instance ID for instancing.
ga: Aitheantas samplach le haghaidh instancing.
ru: Идентификатор экземпляра для создания экземпляра.
ta: நிறுவலுக்கான நிகழ்வு ஐடி.

source: in vec4 **INSTANCE_CUSTOM**
ru: в vec4 **INSTANCE_CUSTOM**
ta: VEC4 ** INSTANCE_CUSTOM ** இல்

source: Instance custom data (for particles, mostly).
ga: Cuir sonraí saincheaptha (do cháithníní, den chuid is mó).
ru: Пользовательские данные экземпляра (в основном для частиц).
ta: நிகழ்வு தனிப்பயன் தரவு (துகள்களுக்கு, பெரும்பாலும்).

source: in int **VIEW_INDEX**
ga: int **VIEW_INDEX**
ru: в int **VIEW_INDEX**
ta: int ** view_index ** இல்

source: The view that we are rendering. ``VIEW_MONO_LEFT`` (``0``) for Mono (not multiview) or left eye, ``VIEW_RIGHT`` (``1``) for right eye.
ga: An dearcadh go bhfuil muid ag déanamh. ''VIEW_MONO_LEFT'' (''0'') do Mono (ní multiview) nó súil chlé, ''VIEW_RIGHT'' (''1'') don tsúil dheas.
ru: Вид, который мы рендерим. ``VIEW_MONO_LEFT`` (``0``) для Mono (не мультиракурс) или левого глаза, ``VIEW_RIGHT`` (``1``) для правого глаза.
ta: நாம் வழங்குதல் செய்கிறோம் என்ற பார்வை. `` View_mono_left`` (`0``) மோனோ (மல்டிவியூ அல்ல) அல்லது இடது கண்ணுக்கு, வலது கண்ணுக்கு` `VIEW_RIGHT`` (` `1``).

source: in int **VIEW_MONO_LEFT**
ga: int **VIEW_MONO_LEFT**
ru: в int **VIEW_MONO_LEFT**
ta: int ** view_mono_left **

source: Constant for Mono or left eye, always ``0``.
ga: Tairiseach do Mono nó súil chlé, i gcónaí ''0''.
ru: Постоянная для Mono или левого глаза, всегда ``0``.
ta: மோனோ அல்லது இடது கண்ணுக்கு மாறாமல், எப்போதும் `` 0``.

source: in int **VIEW_RIGHT**
ga: int **VIEW_RIGHT**
ru: в int **VIEW_RIGHT**
ta: int ** view_right **

source: Constant for right eye, always ``1``.
ga: Constant for right eye, ''1' i gcónaí.
ru: Константа для правого глаза, всегда ``1``.
ta: வலது கண்ணுக்கு நிலையானது, எப்போதும் `` 1``.

source: in vec3 **EYE_OFFSET**
ta: vec3 ** eye_offset ** இல்

source: Position offset for the eye being rendered. Only applicable for multiview rendering.
ga: Fritháireamh suímh don tsúil atá á déanamh. Níl sé infheidhme ach amháin maidir le rindreáil multiview.
ta: கண் வழங்கப்படுவதற்கான நிலை ஆஃப்செட். மல்டிவியூ ரெண்டரிங்கிற்கு மட்டுமே பொருந்தும்.

source: inout vec3 **VERTEX**
ru: inout (вход/выход) vec3 **VERTEX**
ta: VEC3 ** வெர்டெக்ச் **

source: Position of the vertex, in model space. In world space if ``world_vertex_coords`` is used.
ru: Положение вершины в пространстве модели. В мировом пространстве, если используется ``world_vertex_coords``.
ta: மாதிரி இடத்தில், வெர்டெக்சின் நிலை. `` World_vertex_coords`` பயன்படுத்தப்பட்டால் உலக இடத்தில்.

source: in int **VERTEX_ID**
ga: INT **VERTEX_ID**
ru: в int **VERTEX_ID**
ta: int ** vertex_id **

source: The index of the current vertex in the vertex buffer.
ga: Innéacs na stuaic reatha sa mhaolán vertex.
ru: Индекс текущей вершины в буфере вершин.
ta: வெர்டெக்ச் பஃப்பரில் தற்போதைய வெர்டெக்சின் குறியீடு.

source: inout vec3 **NORMAL**
ta: VEC3 ** இயல்பானது **

source: Normal in model space. In world space if ``world_vertex_coords`` is used.
ru: Нормаль в пространстве модели. В мировом пространстве, если используется ``world_vertex_coords``.
ta: மாதிரி இடத்தில் இயல்பானது. `` World_vertex_coords`` பயன்படுத்தப்பட்டால் உலக இடத்தில்.

source: inout vec3 **TANGENT**
ta: inout vec3 ** தொடுகோடு **

source: Tangent in model space. In world space if ``world_vertex_coords`` is used.
ru: Касательная в пространстве модели. В мировом пространстве, если используется ``world_vertex_coords``.
ta: மாதிரி இடத்தில் தொடுகோடு. `` World_vertex_coords`` பயன்படுத்தப்பட்டால் உலக இடத்தில்.

source: inout vec3 **BINORMAL**
ta: VEC3 ** பைனார்மல் **

source: Binormal in model space. In world space if ``world_vertex_coords`` is used.
ru: Бинормальна в модельном пространстве. В мировом пространстве, если используется ``world_vertex_coords``.
ta: மாதிரி இடத்தில் பைனரல். `` World_vertex_coords`` பயன்படுத்தப்பட்டால் உலக இடத்தில்.

source: out vec4 **POSITION**
ga: amach vec4 **POST**
ta: அவுட் VEC4 ** நிலை **

source: If written to, overrides final vertex position in clip space.
ru: При записи переопределяет конечное положение вершины в пространстве отсечения.
ta: எழுதப்பட்டால், கிளிப் இடத்தில் இறுதி வெர்டெக்ச் நிலையை மீறுகிறது.

source: inout vec2 **UV**
ta: VEC2 ** UV **

source: UV main channel.
ga: Príomhchainéal UV.
ru: Основной UV-канал.
ta: புற ஊதா முதன்மையான சேனல்.

source: inout vec2 **UV2**
ta: VEC2 ** UV2 **

source: UV secondary channel.
ga: Cainéal tánaisteach UV.
ru: Вторичный UV-канал.
ta: புற ஊதா இரண்டாம் நிலை சேனல்.

source: inout vec4 **COLOR**
ta: VEC4 ** வண்ணம் **

source: Color from vertices.
ga: Dath ó vertices.
ru: Цвет из вершин.
ta: செங்குத்துகளிலிருந்து நிறம்.

source: out float **ROUGHNESS**
ga: snámhphointe amach **ROUGHNESS**
ta: வெளியே மிதவை ** கடினத்தன்மை **

source: Roughness for vertex lighting.
ga: Roughness do soilsiú vertex.
ru: Шероховатость для вершинного освещения.
ta: வெர்டெக்ச் விளக்குகளுக்கான கடினத்தன்மை.

source: Point size for point rendering.
ga: Méid pointe le haghaidh rindreáil pointe.
ru: Размер точки для рендеринга точек.
ta: புள்ளி ரெண்டரிங்கிற்கான புள்ளி அளவு.

source: Model/local space to view space transform (use if possible).
ru: Модель/локальное пространство для просмотра преобразования пространства (используйте, если возможно).
ta: விண்வெளி மாற்றத்தைக் காண மாதிரி/உள்ளூர் இடம் (முடிந்தால் பயன்படுத்தவும்).

source: in mat4 **MODEL_MATRIX**
ga: I Mat4 **MODEL_MATRIX**
ru: mat4 **MODEL_MATRIX**
ta: MAT4 ** Model_Matrix ** இல்

source: Model/local space to world space transform.
ru: Преобразование модельного/локального пространства в мировое пространство.
ta: உலக விண்வெளி உருமாற்றத்திற்கு மாதிரி/உள்ளூர் இடம்.

source: in mat3 **MODEL_NORMAL_MATRIX**
ga: I Mat3 **MODEL_NORMAL_MATRIX**
ru: mat3 **MODEL_NORMAL_MATRIX**
ta: MAT3 ** Model_normal_matrix ** இல்

source: inout mat4 **PROJECTION_MATRIX**
ga: mat4 inout **PROJECTION_MATRIX**
ta: inout mat4 ** provection_matrix **

source: View space to clip space transform.
ga: Amharc ar spás chun athrú spáis a ghearradh.
ru: Преобразование пространства просмотра для обрезки пространства.
ta: விண்வெளி உருமாற்றத்தை கிளிப் செய்ய இடத்தைக் காண்க.

source: in uvec4 **BONE_INDICES**
ta: UVEC4 ** bone_indices ** இல்

source: in vec4 **BONE_WEIGHTS**
ta: VEC4 ** bone_weights ** இல்

source: in vec4 **CUSTOM0**
ta: VEC4 ** தனிப்பயன் 0 ** இல்

source: Custom value from vertex primitive. When using extra UVs, ``xy`` is UV3 and ``zw`` is UV4.
ru: Пользовательское значение из примитива вершины. При использовании дополнительных UV-координат ``xy`` — это UV3, а ``zw`` — это UV4.
ta: வெர்டெக்ச் ப்ரிமிட்டிவ் நிறுவனத்திலிருந்து தனிப்பயன் மதிப்பு. கூடுதல் UV களைப் பயன்படுத்தும் போது, `` xy`` என்பது UV3 மற்றும் `` Zw`` UV4 ஆகும்.

source: in vec4 **CUSTOM1**
ta: VEC4 ** Custom1 ** இல்

source: Custom value from vertex primitive. When using extra UVs, ``xy`` is UV5 and ``zw`` is UV6.
ru: Пользовательское значение из примитива вершины. При использовании дополнительных UV-координат ``xy`` — это UV5, а ``zw`` — это UV6.
ta: வெர்டெக்ச் ப்ரிமிட்டிவ் நிறுவனத்திலிருந்து தனிப்பயன் மதிப்பு. கூடுதல் UV களைப் பயன்படுத்தும் போது, `` xy`` UV5 மற்றும் `` Zw`` UV6 ஆகும்.

source: in vec4 **CUSTOM2**
ta: VEC4 ** Custom2 ** இல்

source: Custom value from vertex primitive. When using extra UVs, ``xy`` is UV7 and ``zw`` is UV8.
ru: Пользовательское значение из примитива вершины. При использовании дополнительных UV-координат ``xy`` — это UV7, а ``zw`` — это UV8.
ta: வெர்டெக்ச் ப்ரிமிட்டிவ் நிறுவனத்திலிருந்து தனிப்பயன் மதிப்பு. கூடுதல் UV களைப் பயன்படுத்தும் போது, `` xy`` UV7 மற்றும் `` Zw`` UV8 ஆகும்.

source: in vec4 **CUSTOM3**
ga: I Vec4 **CUSTOM3**
ta: VEC4 ** Custom3 ** இல்

source: Custom value from vertex primitive.
ga: Luach saincheaptha ó vertex primitive.
ru: Пользовательское значение из примитива вершины.
ta: வெர்டெக்ச் ப்ரிமிட்டிவ் நிறுவனத்திலிருந்து தனிப்பயன் மதிப்பு.

source: ``MODELVIEW_MATRIX`` combines both the ``MODEL_MATRIX`` and ``VIEW_MATRIX`` and is better suited when floating point issues may arise. For example, if the object is very far away from the world origin, you may run into floating point issues when using the separated ``MODEL_MATRIX`` and ``VIEW_MATRIX``.
ga: Comhcheanglaíonn ''MODELVIEW_MATRIX'' an ''MODEL_MATRIX'' agus ''VIEW_MATRIX'' agus is fearr a oireann sé nuair a d'fhéadfadh saincheisteanna snámhphointe teacht chun cinn. Mar shampla, má tá an réad i bhfad ar shiúl ó bhunadh an domhain, d'fhéadfá rith isteach i saincheisteanna snámhphointe agus tú ag úsáid an scartha ''MODEL_MATRIX'' agus ''VIEW_MATRIX''.
ru: ``MODELVIEW_MATRIX`` объединяет в себе ``MODEL_MATRIX`` и ``VIEW_MATRIX`` и лучше подходит для тех случаев, когда могут возникнуть проблемы с плавающей точкой. Например, если объект находится очень далеко от начала мира, то при использовании раздельных ``MODEL_MATRIX`` и ``VIEW_MATRIX`` могут возникнуть проблемы с плавающей точкой.
ta: `` ModelView_matrix``` `` Model_Matrix`` மற்றும் `` VIEW_MATRIX`` இரண்டையும் ஒருங்கிணைக்கிறது, மேலும் மிதக்கும் புள்ளி சிக்கல்கள் ஏற்படும்போது இது மிகவும் பொருத்தமானது. எடுத்துக்காட்டாக, பொருள் உலக தோற்றத்திலிருந்து வெகு தொலைவில் இருந்தால், பிரிக்கப்பட்ட `` Model_Matrix`` மற்றும் `` VIEW_MATRIX`` ஐப் பயன்படுத்தும் போது நீங்கள் மிதக்கும் புள்ளி சிக்கல்களுக்குள் ஓடலாம்.

source: ``INV_VIEW_MATRIX`` is the matrix used for rendering the object in that pass, unlike ``MAIN_CAM_INV_VIEW_MATRIX``, which is the matrix of the camera in the scene. In the shadow pass, ``INV_VIEW_MATRIX``'s view is based on the camera that is located at the position of the light.
ru: ``INV_VIEW_MATRIX`` — это матрица, используемая для рендеринга объекта в этом проходе, в отличие от ``MAIN_CAM_INV_VIEW_MATRIX``, которая является матрицей камеры в сцене. В проходе теней вид ``INV_VIEW_MATRIX`` основан на камере, расположенной в точке источника света.
ta: `` Inv_view_matrix`` என்பது அந்த பாசில் பொருளை வழங்குவதற்குப் பயன்படுத்தப்படும் மேட்ரிக்ச் ஆகும், இது `` main_cam_inv_view_matrix`` போலல்லாமல், இது காட்சியில் கேமராவின் அணி. நிழல் பாசில், `` inv_view_matrix`` இன் பார்வை ஒளியின் நிலையில் அமைந்துள்ள கேமராவை அடிப்படையாகக் கொண்டது.

source: Fragment built-ins
ga: Blúire tógtha-ins
ru: Фрагментные встроенные константы
ta: துண்டு கட்டப்பட்டவை

source: The default use of a Godot fragment processor function is to set up the material properties of your object and to let the built-in renderer handle the final shading. However, you are not required to use all these properties, and if you don't write to them, Godot will optimize away the corresponding functionality.
ga: Is é an úsáid réamhshocraithe a bhaint as feidhm próiseálaí blúire Godot ná airíonna ábhartha do réada a chur ar bun agus ligean don rindreálaí tógtha an scáthú deiridh a láimhseáil. Mar sin féin, ní cheanglaítear ort na hairíonna seo go léir a úsáid, agus mura scríobhann tú chucu, déanfaidh Godot an fheidhmiúlacht chomhfhreagrach a bharrfheabhsú.
ru: По умолчанию функция обработчика фрагментов Godot используется для настройки свойств материала вашего объекта и для того, чтобы встроенный рендерер выполнил финальное затенение. Однако вы не обязаны использовать все эти свойства, и если вы не будете записывать в них, Godot оптимизирует соответствующую функциональность.
ta: கோடோட் துண்டு செயலி செயல்பாட்டின் இயல்புநிலை பயன்பாடு உங்கள் பொருளின் பொருள் பண்புகளை அமைப்பதும், உள்ளமைக்கப்பட்ட ரெண்டரர் இறுதி நிழலைக் கையாள அனுமதிப்பதும் ஆகும். இருப்பினும், இந்த பண்புகள் அனைத்தையும் நீங்கள் பயன்படுத்தத் தேவையில்லை, நீங்கள் அவர்களுக்கு எழுதவில்லை என்றால், கோடோட் தொடர்புடைய செயல்பாட்டை மேம்படுத்தும்.

source: in vec4 **FRAGCOORD**
ga: i vec4 **FRAGCOORD**
ru: vec4 **FRAGCOORD**
ta: VEC4 ** fragcoord ** இல்

source: Coordinate of pixel center in screen space. ``xy`` specifies position in window. Origin is lower left. ``z`` specifies fragment depth. It is also used as the output value for the fragment depth unless ``DEPTH`` is written to.
ru: Координаты центра пикселя в экранном пространстве. ``xy`` задаёт положение в окне. Начало координат находится внизу слева. ``z`` задаёт глубину фрагмента. Она также используется в качестве выходного значения глубины фрагмента, если не задано ``DEPTH``.
ta: திரை இடத்தில் படப்புள்ளி மையத்தின் ஒருங்கிணைப்பு. `` xy`` சாளரத்தில் நிலையை குறிப்பிடுகிறது. தோற்றம் குறைந்த இடதுபுறம் உள்ளது. `` z`` துண்டு ஆழத்தைக் குறிப்பிடுகிறது. `` ஆழம்`` எழுதப்படாவிட்டால் இது துண்டு ஆழத்திற்கான வெளியீட்டு மதிப்பாகவும் பயன்படுத்தப்படுகிறது.

source: in bool **FRONT_FACING**
ga: i bool **FRONT_FACING**
ru: bool **FRONT_FACING**
ta: bool ** front_facing ** இல்

source: ``true`` if current face is front facing, ``false`` otherwise.
ru: ``true``, если текущая грань обращена вперед, в противном случае ``false``.
ta: ``true`` if மின்னோட்ட்ம், ஓட்டம் face is front facing, ``false`` otherwise.

source: in vec3 **VIEW**
ga: in vec3 **AMHARC**
ru: vec3 **VIEW**
ta: VEC3 ** காண்க **

source: Normalized vector from fragment position to camera (in view space). This is the same for both perspective and orthogonal cameras.
ga: Veicteoir normalaithe ó shuíomh blúire go ceamara (i spás amhairc). Tá sé seo mar an gcéanna do pheirspictíocht agus ceamaraí orthogonal araon.
ru: Нормализованный вектор от положения фрагмента до камеры (в пространстве вида). Он одинаков как для перспективной, так и для ортогональной камеры.
ta: துண்டு நிலையில் இருந்து கேமராவுக்கு (பார்வை இடத்தில்) இயல்பாக்கப்பட்ட திசையன். முன்னோக்கு மற்றும் ஆர்த்தோகனல் கேமராக்கள் இரண்டிற்கும் இது ஒன்றே.

source: in vec2 **UV**
ga: i vec2 ** UV **
ru: vec2 **UV**
ta: VEC2 ** UV ** இல்

source: UV that comes from the ``vertex()`` function.
ru: UV, полученный из функции ``vertex()``.
ta: `` வெர்டெக்ச் () `` செயல்பாட்டிலிருந்து வரும் புற ஊதா.

source: in vec2 **UV2**
ga: i vec2 ** UV2 **
ru: vec2 **UV2**
ta: VEC2 ** UV2 ** இல்

source: UV2 that comes from the ``vertex()`` function.
ru: UV2, полученный из функции ``vertex()``.
ta: `` வெர்டெக்ச் () `` செயல்பாட்டிலிருந்து வரும் UV2.

source: in vec4 **COLOR**
ga: i vec4 ** COLOR **
ru: vec4 **COLOR**
ta: VEC4 ** வண்ணம் **

source: COLOR that comes from the ``vertex()`` function.
ru: COLOR, который получается из функции ``vertex()``.
ta: `` வெர்டெக்ச் () `` செயல்பாட்டிலிருந்து வரும் வண்ணம்.

source: in vec2 **POINT_COORD**
ru: vec2 **POINT_COORD**
ta: VEC2 ** Point_Coord ** இல்

source: Point coordinate for drawing points with ``POINT_SIZE``.
ru: Координаты точки для рисования точек с помощью ``POINT_SIZE``.
ta: `` Point_size`` உடன் புள்ளிகளை வரைவதற்கான புள்ளி ஒருங்கிணைப்பு.

source: Model/local space to world space transform for normals. This is the same as ``MODEL_MATRIX`` by default unless the object is scaled non-uniformly, in which case this is set to ``transpose(inverse(mat3(MODEL_MATRIX)))``.
ru: Преобразование пространства модели/локального пространства в мировое для нормалей. По умолчанию это то же самое, что ``MODEL_MATRIX``, если только объект не масштабирован неравномерно. В этом случае значение устанавливается как ``transpose(inverse(mat3(MODEL_MATRIX)))``.
ta: இயல்பான உலக விண்வெளி மாற்றத்திற்கான மாதிரி/உள்ளூர் இடம். இது இயல்பாகவே `` Model_Matrix`` க்கு சமம், பொருள் ஒரே மாதிரியாக அளவிடப்படாவிட்டால், இந்த விசயத்தில் இது `` இடமாற்றம் (தலைகீழ் (MAT3 (Mat3 (Mate_Matrix))) `` என அமைக்கப்பட்டுள்ளது.

source: in mat4 **PROJECTION_MATRIX**
ga: I Mat4 **PROJECTION_MATRIX**
ru: mat4 **PROJECTION_MATRIX**
ta: MAT4 ** projection_matrix ** இல்

source: in vec3 **VERTEX**
ga: i vec3 **VERTEX**
ru: vec3 **VERTEX**
ta: VEC3 ** வெர்டெக்ச் ** இல்

source: Position of the fragment (pixel), in view space. It is the ``VERTEX`` value from ``vertex()`` interpolated between the face's vertices and transformed into view space. If ``skip_vertex_transform`` is enabled, it may not be in view space.
ru: Положение фрагмента (пикселя) в пространстве вида. Это значение ``VERTEX`` из ``vertex()``, интерполированное между вершинами грани и преобразованное в пространство вида. Если включен параметр ``skip_vertex_transform``, фрагмент может не находиться в пространстве вида.
ta: துண்டின் நிலை (பிக்சல்), பார்வை இடத்தில். இது `` வெர்டெக்ச் () `` முகத்தின் செங்குத்துகளுக்கு இடையில் இடைக்கணிக்கப்பட்டு பார்வை இடமாக மாற்றப்படும் `` வெர்டெக்ச்`` மதிப்பு. `` Skip_vertex_transform`` இயக்கப்பட்டிருந்தால், அது பார்வை இடத்தில் இருக்காது.

source: inout vec3 **LIGHT_VERTEX**
ta: VEC3 ** Light_vertex **

source: A writable version of ``VERTEX`` that can be used to alter light and shadows. Writing to this will not change the position of the fragment.
ga: Leagan inscríofa de ''VERTEX'' is féidir a úsáid chun solas agus scáthanna a athrú. Ní athróidh scríobh chuige seo suíomh an bhlúire.
ru: Записываемая версия ``VERTEX``, которую можно использовать для изменения света и тени. Запись в неё не изменит положение фрагмента.
ta: ஒளி மற்றும் நிழல்களை மாற்ற பயன்படுத்தக்கூடிய `` வெர்டெக்ச்`` இன் எழுதக்கூடிய பதிப்பு. இதற்கு எழுதுவது துண்டின் நிலையை மாற்றாது.

source: The view that we are rendering. Used to distinguish between views in multiview/stereo rendering. ``VIEW_MONO_LEFT`` (``0``) for Mono (not multiview) or left eye, ``VIEW_RIGHT`` (``1``) for right eye.
ru: Вид, который мы рендерим. Используется для различения видов при многоракурсном и стереорендеринге. ``VIEW_MONO_LEFT`` (``0``) для моно (не многоракурсного) или левого глаза, ``VIEW_RIGHT`` (``1``) для правого глаза.
ta: நாம் வழங்குதல் செய்கிறோம் என்ற பார்வை. மல்டிவியூ/ச்டீரியோ ரெண்டரிங்கில் உள்ள காட்சிகளை வேறுபடுத்திப் பார்க்கப் பயன்படுகிறது. `` View_mono_left`` (`0``) மோனோ (மல்டிவியூ அல்ல) அல்லது இடது கண்ணுக்கு, வலது கண்ணுக்கு` `VIEW_RIGHT`` (` `1``).

source: Removed in Godot 4. Use a ``sampler2D`` with ``hint_screen_texture`` instead.
ga: Bainte i Godot 4. Bain úsáid as ''sampler2D'' le ''hint_screen_texture'' ina ionad.
ru: Убрано в Godot 4. Вместо этого используйте ``sampler2D`` с ``hint_screen_texture``.
ta: கோடோட்டில் அகற்றப்பட்டது.

source: in vec2 **SCREEN_UV**
ru: vec2 **SCREEN_UV**
ta: VEC2 ** Screen_uv ** இல்

source: Screen UV coordinate for current pixel.
ga: Comhordanáid UV scáileáin le haghaidh picteilín reatha.
ru: Экранная UV-координата для текущего пикселя.
ta: தற்போதைய பிக்சலுக்கான திரை யு.வி ஒருங்கிணைப்பு.

source: sampler2D **DEPTH_TEXTURE**
ga: Sampler2D**DEIPTH_TEXTURE**
ta: sampler2d ** bell_texture **

source: Removed in Godot 4. Use a ``sampler2D`` with ``hint_depth_texture`` instead.
ga: Bainte i Godot 4. Bain úsáid as ''sampler2D'' le ''hint_depth_texture'' ina ionad.
ru: Убрано в Godot 4. Вместо этого используйте ``sampler2D` с ``hint_depth_texture``.
ta: கோடோட்டில் அகற்றப்பட்டது.

source: out float **DEPTH**
ga: snámhphointe amach **DOIMHNEACHT**
ta: வெளியே மிதவை ** ஆழம் **
