Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shader_reference/spatial_shader.po
Languages: ga, ru, ta

source: Spatial shaders
ga: Shaders spásúil
ru: Шейдеры Spatial
ta: இடஞ்சார்ந்த சேடர்கள்

source: Spatial shaders are used for shading 3D objects. They are the most complex type of shader Godot offers. Spatial shaders are highly configurable with different render modes and different rendering options (e.g. Subsurface Scattering, Transmission, Ambient Occlusion, Rim lighting etc). Users can optionally write vertex, fragment, and light processor functions to affect how objects are drawn.
ga: Úsáidtear shaders spásúla chun rudaí 3D a scáthú. Is iad an cineál is casta de shader Godot tairiscintí. Tá shaders spásúil an-configurable le modhanna rindreála éagsúla agus roghanna rindreáil éagsúla (m.sh. Scaipeadh Subsurface, Tarchur, Occlusion Comhthimpeallach, soilsiú imeall srl). Is féidir le húsáideoirí feidhmeanna stuaic, blúire agus próiseálaí éadroma a scríobh go roghnach chun tionchar a imirt ar an gcaoi a dtarraingítear rudaí.
ru: Пространственные шейдеры используются для затенения 3D-объектов. Это самый сложный тип шейдеров, который предлагает Godot. Пространственные шейдеры очень хорошо настраиваются, в них можно использовать различные режимы рендеринга и различные опции рендеринга (например, Subsurface Scattering, Transmission, Ambient Occlusion, Rim lighting и т. д.). Пользователи могут писать функции вершинного, фрагментного и светового процессоров, чтобы влиять на отрисовку объектов.
ta: 3D பொருள்களை நிழலாடுவதற்கு இடஞ்சார்ந்த சேடர்கள் பயன்படுத்தப்படுகின்றன. அவை சேடர் கோடோட் சலுகைகளின் மிகவும் சிக்கலான வகை. இடஞ்சார்ந்த சேடர்கள் வெவ்வேறு வழங்குதல் முறைகள் மற்றும் வெவ்வேறு வழங்குதல் விருப்பங்களுடன் (எ.கா. மேற்பரப்பு சிதறல், பரிமாற்றம், சுற்றுப்புற இடையூறு, விளிம்பு விளக்குகள் போன்றவை) மிகவும் கட்டமைக்கப்படுகின்றன. பொருள்கள் எவ்வாறு வரையப்படுகின்றன என்பதைப் பாதிக்க பயனர்கள் விருப்பமாக வெர்டெக்ச், துண்டு மற்றும் ஒளி செயலி செயல்பாடுகளை எழுதலாம்.

source: Render modes
ga: Modhanna rindreála
ru: Режимы визуализации
ta: முறைகளை வழங்கவும்

source: For visual examples of these render modes, see :ref:`Standard Material 3D and ORM Material 3D<doc_standard_material_3d>`.
ru: Визуальные примеры этих режимов рендеринга см. в разделе :ref:`Standard Material 3D and ORM Material 3D<doc_standard_material_3d>`.
ta: இந்த வழங்குதல் முறைகளின் காட்சி எடுத்துக்காட்டுகளுக்கு, காண்க: குறிப்பு: `நிலையான பொருள் 3D மற்றும் ORM பொருள் 3D <doc_standard_material_3d>`.

source: Render mode
ga: Mód rindreála
ru: Режим рендеринга
ta: பயன்முறையை வழங்கவும்

source: Description
ga: Cur síos
ru: Описание
ta: விவரம்

source: Mix blend mode (alpha is transparency), default.
ga: Measc modh cumaisc (is trédhearcacht é alfa), réamhshocrú.
ru: Режим смешивания (альфа как прозрачность), по умолчанию.
ta: கலவை முறை (ஆல்பா வெளிப்படைத்தன்மை), இயல்புநிலை.

source: Additive blend mode.
ga: Mód cumaisc breiseáin.
ru: Аддитивный режим наложения.
ta: சேர்க்கை கலப்பு முறை.

source: **blend_sub**
ga: **cumasc_sub**
ru: **blеnd_sub**
ta: ** Cland_sub **

source: Subtractive blend mode.
ga: Mód cumaisc dealaitheach.
ru: Режим наложения с вычитанием.
ta: கழித்தல் கலப்பு முறை.

source: Multiplicative blend mode.
ga: Modh cumaisc ilfheidhmeach.
ru: Режим наложения с умножением.
ta: பெருக்கல் கலப்பு முறை.

source: Premultiplied alpha blend mode (fully transparent = add, fully opaque = mix).
ru: Режим предварительно умноженного альфа-смешивания (полностью прозрачный = add, полностью непрозрачный = mix).
ta: முன்கூட்டியே ஆல்பா கலவை முறை (முழுமையாக வெளிப்படையான = சேர், முழுமையாக ஒளிபுகா = கலவை).

source: **depth_draw_opaque**
ga: **doimhneach_tarraing_opaque**
ru: **dеpth_draw_opaque**
ta: ** ஆழம்_ டிரா_பாக் **

source: Only draw depth for opaque geometry (not transparent).
ga: Ná tarraing ach doimhneacht le haghaidh geoiméadracht teimhneach (ní trédhearcach).
ru: Прорисовка глубины только для непрозрачной геометрии.
ta: ஒளிபுகா வடிவவியலுக்கு மட்டுமே ஆழத்தை வரையவும் (வெளிப்படையானது அல்ல).

source: **depth_draw_always**
ga: **doimhneach_tarraing_i gcónaí**
ru: **dеpth_draw_always**
ta: ** ஆழம்_ டிரா_அல்வேச் **

source: Always draw depth (opaque and transparent).
ga: Tarraing doimhneacht i gcónaí (teimhneach agus trédhearcach).
ru: Постоянная отрисовка глубины (непрозрачная и прозрачная).
ta: எப்போதும் ஆழத்தை வரையவும் (ஒளிபுகா மற்றும் வெளிப்படையானது).

source: **depth_draw_never**
ga: **doimhneach_tarraing_riam**
ru: **dеpth_draw_never**
ta: ** ஆழம்_ டிரா_நெவர் **

source: Never draw depth.
ga: Ná tarraing doimhneacht riamh.
ru: Никогда не отрисовывать глубину.
ta: ஒருபோதும் ஆழத்தை வரைய வேண்டாம்.

source: **depth_prepass_alpha**
ga: **doimhneach_réamh-alfa**
ta: ** ஆழம்_பிரபாச்_ஆல்பா **

source: Do opaque depth pre-pass for transparent geometry.
ga: Déan réamh-phas doimhneacht teimhneach le haghaidh geoiméadracht thrédhearcach.
ru: Выполнение предварительного прохождения непрозрачной глубины для прозрачной геометрии.
ta: வெளிப்படையான வடிவவியலுக்கு ஒளிபுகா ஆழம் முன் பாச் செய்யுங்கள்.

source: **depth_test_disabled**
ga: **tástálaí_doimhneach_díchumasáil**
ta: ** ஆழம்_டெச்ட்_டிசேபிள் **

source: Disable depth testing.
ga: Díchumasaigh tástáil doimhneachta.
ru: Отключение проверки глубины.
ta: ஆழமான சோதனையை முடக்கு.

source: Subsurface Scattering mode for skin (optimizes visuals for human skin, e.g. boosted red channel).
ru: Режим подповерхностного рассеяния для кожи (оптимизирует визуальные эффекты для кожи человека, например, усиливает красный канал).
ta: சருமத்திற்கான மேற்பரப்பு சிதறல் முறை (மனித தோலுக்கான காட்சிகளை மேம்படுத்துகிறது, எ.கா. சிவப்பு சேனலை உயர்த்தியது).

source: Cull back-faces (default).
ga: Cull back-faces (réamhshocrú).
ru: Обрезка задних поверхностей (по-умолчанию).
ta: பின்-முகங்களை க்யூல் செய்யுங்கள் (இயல்புநிலை).

source: Cull front-faces.
ga: Cuil aghaidheanna tosaigh.
ru: Обрезка передних поверхностей.
ta: முன்-முகங்களில்.

source: Culling disabled (double sided).
ga: Culling faoi mhíchumas (dhá thaobh).
ru: Выключение обрезки (двойная сторона).
ta: ஊனமுற்றோர் (இரட்டை பக்க).

source: **unshaded**
ga: **gan scáth**
ru: **unshadеd**
ta: ** அசைக்கப்படாத **

source: Result is just albedo. No lighting/shading happens in material, making it faster to render.
ru: Результат — просто альбедо. Материал не подвергается воздействию света и тени, что ускоряет рендеринг.
ta: முடிவு வெறும் ஆல்பிடோ. பொருளில் எந்த விளக்குகள்/நிழலும் நடக்காது, இது வழங்குவதை வேகமாக செய்கிறது.

source: **wireframe**
ga: **sreangfhráma**
ta: ** வயர்ஃப்ரேம் **

source: Geometry draws using lines (useful for troubleshooting).
ru: Геометрия рисуется с помощью линий (полезно для устранения неполадок).
ta: வரிகளைப் பயன்படுத்தி வடிவியல் ஈர்க்கிறது (சரிசெய்தலுக்கு பயனுள்ளதாக இருக்கும்).

source: **debug_shadow_splits**
ta: ** பிழைத்திருத்தம்_சாடோ_ச்ப்ளிட்ச் **

source: Directional shadows are drawn using different colors for each split (useful for troubleshooting).
ru: Направленные тени рисуются с использованием разных цветов для каждого разделения (полезно для устранения неполадок).
ta: ஒவ்வொரு பிளவுக்கும் வெவ்வேறு வண்ணங்களைப் பயன்படுத்தி திசை நிழல்கள் வரையப்படுகின்றன (சரிசெய்தலுக்கு பயனுள்ளதாக இருக்கும்).

source: Burley (Disney PBS) for diffuse (default).
ga: Burley (Disney PBS) le haghaidh idirleata (réamhshocrú).
ru: Burley (Disney PBS) для диффузного (по умолчанию).
ta: பரவலுக்கான பர்லி (டிச்னி பிபிஎச்) (இயல்புநிலை).

source: Lambert shading for diffuse.
ga: Lambert scáthú le haghaidh idirleata.
ru: Затенение Ламберта для диффузии.
ta: பரவலுக்கான லம்பேர்ட் நிழல்.

source: Lambert-wrap shading (roughness-dependent) for diffuse.
ru: Затенение по методу Ламберта (зависящее от шероховатости) для диффузии.
ta: பரவலுக்கான லம்பேர்ட்-மடக்கு நிழல் (கடினத்தன்மை சார்ந்தது).

source: Toon shading for diffuse.
ga: Scáthú toon le haghaidh idirleata.
ru: Toon-затенение для диффузного.
ta: பரவலுக்கான டூன் நிழல்.

source: **specular_schlick_ggx**
ru: **specular_schlick_ggх**
ta: ** seploral_schlick_ggx **

source: Schlick-GGX for direct light specular lobes (default).
ru: Schlick-GGX для зеркальных лепестков прямого света (по умолчанию).
ta: நேரடி ஒளி ஏகப்பட்ட மடல்களுக்கான ச்க்லிக்-சிசிஎக்ச் (இயல்புநிலை).

source: **specular_toon**
ga: **spéacla_toon**
ru: **spеcular_toon**
ta: ** Seploral_toon **

source: Toon for direct light specular lobes.
ru: Настройка зеркальных отражений прямого света.
ta: நேரடி ஒளி ஏகப்பட்ட மடல்களுக்கு டூன்.

source: **specular_disabled**
ga: **spéacla_díchumasacháil**
ru: **speculаr_disabled**
ta: ** Seploral_disabled **

source: Disable direct light specular lobes. Doesn't affect reflected light (use ``SPECULAR = 0.0`` instead).
ru: Отключить зеркальные лепестки прямого света. Не влияет на отражённый свет (вместо этого используйте ``SPECULAR = 0.0``).
ta: நேரடி ஒளி ஏகப்பட்ட மடல்களை முடக்கு. பிரதிபலித்த ஒளியை பாதிக்காது (அதற்கு பதிலாக `` ஏகப்பட்ட = 0.0`` ஐப் பயன்படுத்தவும்).

source: ``VERTEX``, ``NORMAL``, ``TANGENT``, and ``BITANGENT`` need to be transformed manually in the ``vertex()`` function.
ru: ``VERTEX``, ``NORMAL``, ``TANGENT`` и ``BITANGENT`` необходимо преобразовать вручную в функции ``vertex()``.
ta: `` Vertex``, `` இயல்பானது``, `` டேன்சென்ட்``, மற்றும் `` பிட்சென்ட்`` `` வெர்டெக்ச் () `செயல்பாட்டில் கைமுறையாக மாற்றப்பட வேண்டும்.

source: ``VERTEX``, ``NORMAL``, ``TANGENT``, and ``BITANGENT`` are modified in world space instead of model space.
ru: ``VERTEX``, ``NORMAL``, ``TANGENT`` и ``BITANGENT`` модифицируются в мировом пространстве, а не в пространстве модели.
ta: `` வெர்டெக்ச்``, `` இயல்பானது``, `` டேன்சென்ட்``, மற்றும் `` பிட்சென்ட்`` ஆகியவை மாதிரி இடத்திற்கு பதிலாக உலக இடத்தில் மாற்றியமைக்கப்படுகின்றன.

source: **ensure_correct_normals**
ga: **cinnteoireach_ceart_gnáth**
ta: ** உறுதிப்படுத்தல்_கோரெக்ட்_நார்மல்ச் **

source: Use when non-uniform scale is applied to mesh *(note: currently unimplemented)*.
ru: Используется, когда к сетке применен неравномерный масштаб *(примечание: в настоящее время не реализовано)*.
ta: கண்ணுக்கு ஒரே மாதிரியான அளவு பயன்படுத்தப்படும்போது பயன்படுத்தவும் *(குறிப்பு: தற்போது செயல்படுத்தப்படாதது) *.

source: **ambient_light_disabled**
ga: **ambient_light_díchumasaí**
ru: **Свет_окружения_отключен**
ta: ** ampient_light_disabled **

source: Disable contribution from ambient light and radiance map.
ga: Díchumasaigh ranníocaíocht ó sholas comhthimpeallach agus léarscáil radiance.
ru: Отключить влияние окружающего освещения и карты яркости.
ta: சுற்றுப்புற ஒளி மற்றும் பிரகாசமான வரைபடத்திலிருந்து பங்களிப்பை முடக்கு.

source: Lighting modifies the alpha so shadowed areas are opaque and non-shadowed areas are transparent. Useful for overlaying shadows onto a camera feed in AR.
ga: Athraíonn soilsiú an alfa ionas go bhfuil limistéir scáthaithe trédhearcach agus tá limistéir neamh-scáthaithe trédhearcach. Úsáideach chun scáthanna a fhorchur ar bheatha ceamara in AR.
ru: Освещение изменяет альфа-канал так, что затененные области становятся непрозрачными, а незатененные - прозрачными. Полезно для наложения теней на камеру в AR.
ta: லைட்டிங் ஆல்பாவை மாற்றியமைக்கிறது, எனவே நிழலாடிய பகுதிகள் ஒளிபுகா மற்றும் நிழல் இல்லாத பகுதிகள் வெளிப்படையானவை. AR இல் கேமரா ஊட்டத்தில் நிழல்களை மேலெழுத பயனுள்ளதாக இருக்கும்.

source: Use vertex-based lighting instead of per-pixel lighting.
ru: Используйте вершинное освещение вместо попиксельного.
ta: ஒவ்வொரு படப்புள்ளி விளக்குகளுக்கு பதிலாக வெர்டெக்ச் அடிப்படையிலான விளக்குகளைப் பயன்படுத்தவும்.

source: **particle_trails**
ga: **trealaí_cáithníne**
ta: ** துகள்_ டிரெயில்கள் **

source: Enables the trails when used on particles geometry.
ga: Cumasaigh na cosáin nuair a úsáidtear iad ar gheoiméadracht na gcáithníní.
ru: Включает следы при использовании в геометрии частиц.
ta: துகள்கள் வடிவவியலில் பயன்படுத்தும்போது தடங்களை செயல்படுத்துகிறது.

source: **alpha_to_coverage**
ga: **alpha_to_clúdaithe**
ta: ** ஆல்பா_டோ_கோவர்ச் **

source: Alpha antialiasing mode, see `here <https://github.com/godotengine/godot/pull/40364>`_ for more.
ga: Mód antialiasing alfa, féach `anseo <https://github.com/godotengine/godot/pull/40364>`_ le haghaidh tuilleadh.
ru: Режим альфа-сглаживания, более подробную информацию см. `здесь <https://github.com/godotengine/godot/pull/40364>`_.
ta: ஆல்பா ஆன்டிலியாசிங் பயன்முறை, `இங்கே <https://github.com/godotengine/godot/pull/40364>` _ மேலும் பார்க்கவும்.

source: **alpha_to_coverage_and_one**
ga: **alfa_to_clúdaithe_agus_aon**
ta: ** ஆல்பா_டோ_கவர்_ஆண்ட்_ஒன் **

source: Disable receiving depth-based or volumetric fog. Useful for ``blend_add`` materials like particles.
ru: Отключить получение глубинного или объёмного тумана. Полезно для материалов ``blend_add``, таких как частицы.
ta: ஆழம் அடிப்படையிலான அல்லது அளவீட்டு மூடுபனியைப் பெறுவதை முடக்கு. துகள்கள் போன்ற `` Cland_add`` பொருட்களுக்கு பயனுள்ளதாக இருக்கும்.

source: Built-ins
ga: Tógtha-ins
ru: Встроенные функции
ta: உள்ளமைக்கப்பட்டவை

source: Values marked as ``in`` are read-only. Values marked as ``out`` can optionally be written to and will not necessarily contain sensible values. Values marked as ``inout`` provide a sensible default value, and can optionally be written to. Samplers cannot be written to so they are not marked.
ru: Значения, отмеченные как ``in``, доступны только для чтения. Значения, отмеченные как ``out``, могут быть записаны и не обязательно содержат осмысленные значения. Значения, отмеченные как ``inout``, предоставляют осмысленное значение по умолчанию и могут быть записаны. Сэмплеры не могут быть записаны, поэтому они не отмечены.
ta: `` In`` எனக் குறிக்கப்பட்ட மதிப்புகள் படிக்க மட்டுமே. `` அவுட்`` எனக் குறிக்கப்பட்ட மதிப்புகள் விருப்பமாக எழுதப்படலாம் மற்றும் விவேகமான மதிப்புகளைக் கொண்டிருக்காது. `` Inout`` எனக் குறிக்கப்பட்ட மதிப்புகள் விவேகமான இயல்புநிலை மதிப்பை வழங்குகின்றன, மேலும் விருப்பமாக எழுதப்படலாம். மாதிரிகளை எழுத முடியாது, எனவே அவை குறிக்கப்படவில்லை.

source: Not all built-ins are available in all processing functions. To access a vertex built-in from the ``fragment()`` function, you can use a :ref:`varying <doc_shading_language_varyings>`. The same applies for accessing fragment built-ins from the ``light()`` function.
ru: Не все встроенные функции доступны во всех функциях обработки. Для доступа к встроенной функции вершины из функции ``fragment()`` можно использовать :ref:`varying <doc_shading_language_varyings>`. То же самое относится к доступу к встроенным функциям фрагментов из функции ``light()``.
ta: அனைத்து செயலாக்க செயல்பாடுகளிலும் அனைத்து கட்டமைப்புகளும் கிடைக்காது. `` துண்டு () `` செயல்பாட்டிலிருந்து உள்ளமைக்கப்பட்ட ஒரு வெர்டெக்சை அணுக, நீங்கள் ஒரு: ref: `மாறுபடும் <doc_shading_language_varyings>` பயன்படுத்தலாம். `` ஒளி () `` செயல்பாட்டிலிருந்து துண்டு கட்டப்பட்டவற்றை அணுக இது பொருந்தும்.

source: Global built-ins
ga: Domhanda tógtha-ins
ru: Глобальные встроенные функции
ta: உலகளாவிய கட்டடங்கள்

source: Global built-ins are available everywhere, including custom functions.
ga: Tá ionsuite domhanda ar fáil i ngach áit, lena n-áirítear feidhmeanna saincheaptha.
ru: Глобальные встроенные модули доступны везде, включая пользовательские функции.
ta: தனிப்பயன் செயல்பாடுகள் உட்பட எல்லா இடங்களிலும் உலகளாவிய கட்டடங்கள் கிடைக்கின்றன.

source: Built-in
ga: Tógtha i
ru: Встроенный
ta: உள்ளமைக்கப்பட்ட

source: in float **TIME**
ga: i snámhphointe **AM**
ru: в плавающем **TIME**
ta: மிதவையில் ** நேரம் **

source: Global time since the engine has started, in seconds. It repeats after every ``3,600`` seconds (which can be changed with the :ref:`rollover<class_ProjectSettings_property_rendering/limits/time/time_rollover_secs>` setting). It's affected by :ref:`time_scale<class_Engine_property_time_scale>` but not by pausing. If you need a ``TIME`` variable that is not affected by time scale, add your own :ref:`global shader uniform<doc_shading_language_global_uniforms>` and update it each frame.
ru: Глобальное время с момента запуска движка, в секундах. Оно повторяется каждые ``3600`` секунд (это можно изменить с помощью параметра :ref:`rollover<class_ProjectSettings_property_rendering/limits/time/time_rollover_secs>`). На него влияет параметр :ref:`time_scale<class_Engine_property_time_scale>`, но не пауза. Если вам нужна переменная ``TIME``, не зависящая от масштаба времени, добавьте свою собственную переменную :ref:`global shader uniform<doc_shading_language_global_uniforms>` и обновляйте её в каждом кадре.
ta: இயந்திரம் தொடங்கியதிலிருந்து உலகளாவிய நேரம், நொடிகளில். ஒவ்வொரு `` 3,600`` விநாடிகளுக்குப் பிறகு இது மீண்டும் நிகழ்கிறது (இதை மாற்றலாம்: rew: `ரோல்ஓவர் <class_projectsettings_property_rendering/limites/time_rollover_secs>` அமைப்பு). இது பாதிக்கப்படுகிறது: ref: `time_scale <class_engine_property_time_scale>` ஆனால் இடைநிறுத்துவதன் மூலம் அல்ல. நேர அளவால் பாதிக்கப்படாத `` நேரம்`` மாறுபாடு உங்களுக்குத் தேவைப்பட்டால், உங்கள் சொந்தத்தைச் சேர்க்கவும்: குறிப்பு: `உலகளாவிய சேடர் சீருடை <doc_shading_language_global_uniforms>` ஒவ்வொரு சட்டகத்தையும் புதுப்பிக்கவும்.

source: in float **PI**
ga: i snámhphointe **PI**
ru: в float **PI**
ta: மிதவை ** பை **

source: A ``PI`` constant (``3.141592``). A ratio of a circle's circumference to its diameter and amount of radians in half turn.
ru: Константа ``PI`` (``3.141592``). Отношение длины окружности к её диаметру и количеству радиан в полуобороте.
ta: A `` pi`` மாறிலி (`` 3.141592``). ஒரு வட்டத்தின் சுற்றளவு அதன் விட்டம் மற்றும் ரேடியன்களின் அளவு பாதி திரும்பும் விகிதம்.

source: in float **TAU**
ga: i snámhphointe **TAU**
ru: в float **TAU**
ta: மிதவையில் ** த அயு **

source: A ``TAU`` constant (``6.283185``). An equivalent of ``PI * 2`` and amount of radians in full turn.
ga: Tairiseach ''TAU'' (''6.283185''). Comhionann le ''PI * 2'' agus méid na radians ina lánseal.
ru: Константа ``TAU`` (``6.283185``). Эквивалент ``PI * 2`` и количество радианов в полном обороте.
ta: A `` tau`` மாறிலி (`` 6.283185``). `` பை * 2`` க்கு சமமான மற்றும் முழு திருப்பத்தில் ரேடியன்களின் அளவு.

source: in float **E**
ga: i snámhphointe **E**
ru: В float **E**
ta: மிதவையில் ** இ **

source: An ``E`` constant (``2.718281``). Euler's number and a base of the natural logarithm.
ga: Tairiseach ''E'' (''2.718281''). Uimhir Euler agus bonn den logartam nádúrtha.
ru: Константа ``E`` (``2,718281``). Число Эйлера и основание натурального логарифма.
ta: ஒரு `` E`` மாறிலி (`` 2.718281``). யூலரின் எண் மற்றும் இயற்கை மடக்கையின் அடிப்படை.

source: in bool **OUTPUT_IS_SRGB**
ga: i bool **OUTPUT_IS_SRGB**
ru: в bool (логическом формате) **OUTPUT_IS_SRGB**
ta: bool ** output_is_srgb ** இல்

source: ``true`` when output is in sRGB color space (this is ``true`` in the Compatibility renderer, ``false`` in Forward+ and Mobile).
ru: ``true``, когда вывод осуществляется в цветовом пространстве sRGB (это ``true`` в модуле рендеринга совместимости, ``false`` в Forward+ и Mobile).
ta: `` உண்மை`` வெளியீடு SRGB வண்ண இடத்தில் இருக்கும்போது (இது பொருந்தக்கூடிய ரெண்டரரில் `` உண்மை``, `` தவறு`` முன்னோக்கி+ மற்றும் மொபைலில்).

source: in float **CLIP_SPACE_FAR**
ru: в float **CLIP_SPACE_FAR**
ta: மிதவையில் ** கிளிப்_ச்பேச்_ஃபார் **

source: Clip space far ``z`` value. In the Forward+ or Mobile renderers, it's ``0.0``. In the Compatibility renderer, it's ``-1.0``.
ru: Значение ``z`` для отсечения пространства. В рендерах Forward+ и Mobile это ``0.0``. В рендере Compatibility это ``-1.0``.
ta: ச்பேசை கிளிப் `` Z`` மதிப்பு. முன்னோக்கி+ அல்லது மொபைல் ரெண்டரர்களில், இது `` 0.0``. பொருந்தக்கூடிய ரெண்டரரில், இது `` -1.0``.

source: Vertex built-ins
ga: Vertex tógtha-ins
ru: Вершинные встроенные константы
ta: வெர்டெக்ச் பில்ட்-இன்ச்

source: Vertex data (``VERTEX``, ``NORMAL``, ``TANGENT``, and ``BITANGENT``) are presented in model space (also called local space). If not written to, these values will not be modified and be passed through as they came, then transformed into view space to be used in ``fragment()``.
ru: Данные вершин (``VERTEX``, ``NORMAL``, ``TANGENT`` и ``BITANGENT``) представлены в пространстве модели (также называемом локальным пространством). Если эти значения не записаны, они не изменяются и передаются в том виде, в котором были получены, а затем преобразуются в пространство представления для использования в ``fragment()``.
ta: வெர்டெக்ச் தரவு (`` வெர்டெக்ச்`, `` இயல்பானது``, `டேன்சென்ட்``, மற்றும்` `பிடேஞ்சென்ட்``) மாதிரி இடத்தில் (உள்ளூர் இடம் என்றும் அழைக்கப்படுகிறது) வழங்கப்படுகின்றன. எழுதப்படாவிட்டால், இந்த மதிப்புகள் மாற்றியமைக்கப்படாது, அவை வந்தவுடன் கடந்து செல்லப்படாது, பின்னர் `` துண்டு () `` இல் பயன்படுத்த பார்வை இடமாக மாற்றப்படும்.

source: They can optionally be presented in world space by using the ``world_vertex_coords`` render mode.
ru: При желании их можно представить в мировом пространстве, используя режим рендеринга ``world_vertex_coords``.
ta: `` World_vertex_coords`` வழங்குதல் பயன்முறையைப் பயன்படுத்தி அவை விருப்பமாக உலக இடத்தில் வழங்கப்படலாம்.

source: Users can disable the built-in modelview transform (projection will still happen later) and do it manually with the following code:
ga: Is féidir le húsáideoirí an t-athrú modelview tógtha a dhíchumasú (tarlóidh teilgean níos déanaí fós) agus é a dhéanamh de láimh leis an gcód seo a leanas:
ru: Пользователи могут отключить встроенное преобразование modelview (проекция всё равно произойдет позже) и сделать это вручную с помощью следующего кода:
ta: பயனர்கள் உள்ளமைக்கப்பட்ட மாதிரி வியூ உருமாற்றத்தை முடக்கலாம் (திட்டம் இன்னும் பின்னர் நடக்கும்) மற்றும் பின்வரும் குறியீட்டைக் கொண்டு கைமுறையாக செய்யுங்கள்:

source: Other built-ins, such as ``UV``, ``UV2``, and ``COLOR``, are also passed through to the ``fragment()`` function if not modified.
ru: Другие встроенные функции, такие как ``UV``, ``UV2`` и ``COLOR``, также передаются в функцию ``fragment()``, если они не изменены.
ta: `` Uv``, `` uv2``, மற்றும் `` வண்ணம்`` போன்ற பிற உள்ளீடுகளும் மாற்றியமைக்கப்படாவிட்டால் `` துண்டு () `செயல்பாட்டிற்கு அனுப்பப்படுகின்றன.

source: Users can override the modelview and projection transforms using the ``POSITION`` built-in. If ``POSITION`` is written to anywhere in the shader, it will always be used, so the user becomes responsible for ensuring that it always has an acceptable value. When ``POSITION`` is used, the value from ``VERTEX`` is ignored and projection does not happen. However, the value passed to the fragment shader still comes from ``VERTEX``.
ga: Is féidir le húsáideoirí an t-amharc samhla agus an teilgean a shárú ag baint úsáide as an ''POSITION'' ionsuite. Má scríobhtar ''POSITION'' chuig áit ar bith sa shader, úsáidfear é i gcónaí, mar sin bíonn an t-úsáideoir freagrach as a chinntiú go bhfuil luach inghlactha aige i gcónaí. Nuair a úsáidtear ''POSITION'', déantar neamhaird den luach ó ''VERTEX'' agus ní tharlaíonn teilgean. Mar sin féin, tagann an luach a chuirtear ar aghaidh chuig an scáthóir blúire fós ó ''VERTEX''.
ru: Пользователи могут переопределять преобразования вида модели и проекции с помощью встроенного шейдера ``POSITION``. Если ``POSITION`` записано в любом месте шейдера, оно будет использоваться всегда, поэтому пользователь несет ответственность за обеспечение его приемлемого значения. При использовании ``POSITION`` значение из ``VERTEX`` игнорируется, и проекция не выполняется. Однако значение, передаваемое во фрагментный шейдер, по-прежнему берется из ``VERTEX``.
ta: பயனர்கள் `` நிலை`` உள்ளமைக்கப்பட்ட மாதிரியைப் பயன்படுத்தி மாதிரி வியூ மற்றும் ப்ரொசெக்சன் உருமாற்றங்களை மேலெழுதலாம். `` நிலை`` சேடரில் எங்கும் எழுதப்பட்டிருந்தால், அது எப்போதும் பயன்படுத்தப்படும், எனவே அது எப்போதும் ஏற்றுக்கொள்ளக்கூடிய மதிப்பைக் கொண்டிருப்பதை உறுதி செய்வதற்கு பயனர் பொறுப்பேற்கிறார். `` நிலை`` பயன்படுத்தப்படும்போது, `` வெர்டெக்ச்`` இன் மதிப்பு புறக்கணிக்கப்படுகிறது மற்றும் திட்டம் நடக்காது. இருப்பினும், துண்டுக்கு அனுப்பப்பட்ட மதிப்பு இன்னும் `` வெர்டெக்ச்`` இலிருந்து வருகிறது.
