Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/development/configuring_an_ide/android_studio.po
Languages: fr, it, ru, zh_tw

source: `Android Studio <https://developer.android.com/studio>`_ is a free IDE for Android development made by `Google <https://about.google/>`_ and `JetBrains <https://www.jetbrains.com/>`_. It's based on `IntelliJ IDEA <https://www.jetbrains.com/idea/>`_ and has a feature-rich editor which supports Java and C/C++. It can be used to work on Godot's core engine as well as the Android platform codebase.
fr: `Android Studio <https://developer.android.com/studio>`_ est un IDE gratuit pour le développement d'Android, fait par `Google <https://about.google/>`_ et `JetBrains <https://www.jetbrains.com/>`_. Il est basé sur `IntelliJ IDEA <https://www.jetbrains.com/idea/>`_ et dispose d'un éditeur riche en fonctionnalités qui supporte Java et C/C++. Il peut être utilisé pour travailler sur le moteur principal de Godot ainsi que sur la base de code de la plate-forme Android.
it: `Android Studio <https://developer.android.com/studio>`_ è un IDE gratuito per lo sviluppo su Android creato da `Google <https://about.google/>`_ e `JetBrains <https://www.jetbrains.com/>`_. È basato su `IntelliJ IDEA <https://www.jetbrains.com/idea/>`_ e dispone di un editor ricco di funzionalità che supporta Java e C/C++. Si può utilizzare per lavorare sia sul motore principale di Godot, sia sul codice base della piattaforma Android.
ru: Android Studio <https://developer.android.com/studio> — это бесплатная IDE для разработки приложений под Android, разработанная компаниями Google <https://about.google/> и JetBrains <https://www.jetbrains.com/>. Она основана на IntelliJ IDEA <https://www.jetbrains.com/idea/> и имеет многофункциональный редактор, поддерживающий Java и C/C++. Её можно использовать как для работы с основным движком Godot, так и с кодовой базой платформы Android.
zh_tw: `Android Studio <https://developer.android.com/studio>`_ 是由 `Google <https://about.google/>`_ 與 `JetBrains <https://www.jetbrains.com/>`_ 提供的免費 Android 開發 IDE，基於 `IntelliJ IDEA <https://www.jetbrains.com/idea/>`_，內建功能豐富的編輯器，支援 Java 與 C/C++。可用於 Godot 核心引擎與 Android 平台相關原始碼的開發。

source: Importing the project
fr: Importation du projet
it: Importare il progetto
ru: Импортирование проекта
zh_tw: 匯入專案

source: From the Android Studio's welcome window select **Open**.
it: Dalla finestra di benvenuto di Android Studio seleziona **Open**.
ru: В окне приветствия Android Studio выберите **Open**.
zh_tw: 在 Android Studio 的歡迎畫面中選擇 **Open**。

source: Android Studio's welcome window.
fr: Fenêtre d'accueil d'Android Studio.
it: Finestra di benvenuto di Android Studio.
ru: Приветственное окно Android Studio.
zh_tw: Android Studio 的歡迎畫面。

source: Navigate to ``<Godot root directory>/platform/android/java`` and select the ``settings.gradle`` file.
fr: Naviguez jusqu'au ``<Godot root directory>/platform/android/java`` et sélectionnez le fichier ``settings.gradle``.
it: Navigare a ``<cartella radice di Godot>/platform/android/java`` e selezionare il file ``settings.gradle``.
ru: Перейдите в ``<корневой каталог Godot>/platform/android/java`` и выберите файл ``settings.gradle``.
zh_tw: 前往 ``<Godot 根目錄>/platform/android/java`` 並選擇 ``settings.gradle`` 檔案。

source: Android Studio will import and index the project.
fr: Android Studio va importer et indexer le projet.
it: Android Studio importerà e indicizzerà il progetto.
ru: Android Studio импортирует и проиндексирует проект.
zh_tw: Android Studio 會匯入並建立專案索引。

source: Android Studio project layout
it: Disposizione del progetto in Android Studio
ru: Макет проекта Android Studio
zh_tw: Android Studio 專案結構

source: The project is organized using `Android Studio's modules <https://developer.android.com/studio/projects#ApplicationModules>`_:
fr: Le projet est organisé à l'aide des `modules d'Android Studio <https://developer.android.com/studio/projects#ApplicationModules>`_ :
it: Il progetto è organizzato attraverso i `moduli di Android Studio <https://developer.android.com/studio/projects#ApplicationModules>`_:
ru: Проект организован с использованием `модулей Android Studio <https://developer.android.com/studio/projects#ApplicationModules>`_:
zh_tw: Godot Android 專案是以 `Android Studio 的模組方式 <https://developer.android.com/studio/projects#ApplicationModules>`_ 組織的：

source: ``lib`` module:
fr: module``lib`` :
it: Modulo ``lib``:
ru: Модуль ``lib``:
zh_tw: ``lib`` 模組：

source: Located under ``<Godot root directory>/platform/android/java/lib``, this is a **library module** that organizes
fr: Situé sous``<Godot root directory>/platform/android/java/lib``, il s'agit d'un **module de bibliothèque** qui organise
it: Situato in ``<cartella radice di Godot>/platform/android/java/lib``, questo è un **modulo di libreria** che organizza
ru: Расположенный в ``<корневой каталог Godot>/platform/android/java/lib``, это **модуль библиотеки**, который организует
zh_tw: 位於 ``<Godot 根目錄>/platform/android/java/lib``，這是一個**函式庫模組**，主要組織

source: the Godot java and native code and make it available as a reusable dependency / artifact.
it: il codice Java e nativo di Godot e lo rende disponibile come dipendenza/artefatto riutilizzabile.
ru: код Godot java и нативный код и сделать его доступным как повторно используемая зависимость/артефакт.
zh_tw: Godot 的 Java 與原生程式碼，使其可作為可重複利用的依賴/套件使用。

source: The artifact generated by this module is made available for other Android modules / projects to use as a dependency, via `MavenCentral <https://repo1.maven.org/maven2/org/godotengine/godot/>`_.
it: L'artefatto generato da questo modulo è reso disponibile per altri moduli/progetti Android da utilizzare come dipendenza, tramite `MavenCentral <https://repo1.maven.org/maven2/org/godotengine/godot/>`_.
ru: Артефакт, созданный этим модулем, доступен для использования в качестве зависимости другими модулями/проектами Android через `MavenCentral <https://repo1.maven.org/maven2/org/godotengine/godot/>`_.
zh_tw: 此模組產生的套件會發布到 `MavenCentral <https://repo1.maven.org/maven2/org/godotengine/godot/>`_，供其他 Android 模組或專案作為依賴使用。

source: ``editor`` module:
fr: Module ``éditeur`` :
it: Modulo ``editor``:
ru: Модуль ``editor``:
zh_tw: ``editor`` 模組：

source: Located under ``<Godot root directory>/platform/android/java/editor``, this is an **application module** that holds
fr: Situé sous``<Godot root directory>/platform/android/java/editor``, il s'agit d'un **module d'application** qui contient
it: Situato in ``<cartella radice di Godot>/platform/android/java/editor``, questo è un **modulo di applicazione** che contiene
ru: Расположенный в ``<корневой каталог Godot>/platform/android/java/editor``, это **модуль приложения**, который содержит
zh_tw: 位於 ``<Godot 根目錄>/platform/android/java/editor``，這是一個**應用程式模組**，存放

source: the source code for the Android port of the Godot Editor.
it: il codice sorgente per la versione Android del Godot Editor.
ru: исходный код для Android-порта Godot Editor.
zh_tw: Godot 編輯器 Android 移植版的原始碼。

source: This module has a dependency on the ``lib`` module.
it: Questo modulo ha una dipendenza dal modulo ``lib``.
ru: Этот модуль зависит от модуля ``lib``.
zh_tw: 此模組依賴於 ``lib`` 模組。

source: ``app`` module:
fr: module``app`` :
it: Modulo ``app``:
ru: Модуль ``app``:
zh_tw: ``app`` 模組：

source: Located under ``<Godot root directory>/platform/android/java/app``, this is an **application module** that holds
fr: Situé sous``<Godot root directory>/platform/android/java/app``, il s'agit d'un **module d'application** qui contient
it: Situato in ``<cartella radice di Godot>/platform/android/java/app``, questo è un **modulo di applicazione** che contiene
ru: Расположенный в ``<корневой каталог Godot>/platform/android/java/app``, это **модуль приложения**, который содержит
zh_tw: 位於 ``<Godot 根目錄>/platform/android/java/app``，這是一個**應用程式模組**，存放

source: the source code for the Android build templates.
it: il codice sorgente per i modelli di compilazione Android.
ru: исходный код шаблонов сборки Android.
zh_tw: Android 打包範本的原始碼。

source: Building & debugging the editor module
it: Compilazione e debug del modulo editor
ru: Сборка и отладка модуля редактора
zh_tw: 建置與除錯 editor 模組

source: To build the ``editor`` module:
fr: Pour compiler le module ``editor`` :
it: Per compilare il modulo ``editor``:
ru: Чтобы собрать модуль ``редактор``:
zh_tw: 要建置 ``editor`` 模組：

source: Select the `Run/Debug Configurations drop down <https://developer.android.com/studio/run/rundebugconfig#running>`_ and select ``editor``.
it: Selezionare il menu a discesa `Run/Debug Configurations <https://developer.android.com/studio/run/rundebugconfig#running>`_ e selezionare ``editor``.
ru: Выберите раскрывающийся список `Конфигурации запуска/отладки <https://developer.android.com/studio/run/rundebugconfig#running>`_ и выберите ``редактор``.
zh_tw: 選擇 `執行/除錯設定下拉選單 <https://developer.android.com/studio/run/rundebugconfig#running>`_ 並選擇 ``editor``。

source: Select **Run > Run 'editor'** from the top menu or `click the Run icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
it: Selezionare **Run > Run 'editor'** dal menu in alto oppure `cliccare sull'icona Esegui <https://developer.android.com/studio/run/rundebugconfig#running>`_.
ru: Выберите **Run > Run 'editor'** в верхнем меню или `нажмите значок "Run" <https://developer.android.com/studio/run/rundebugconfig#running>`_.
zh_tw: 從上方選單選擇 **Run > Run 'editor'** 或點擊 `執行圖示 <https://developer.android.com/studio/run/rundebugconfig#running>`_。

source: To debug the ``editor`` module:
fr: Pour déboguer le module ``editor`` :
it: Per effettuare il debug del modulo ``editor``:
ru: Для отладки модуля ``editor``:
zh_tw: 要除錯 ``editor`` 模組：

source: Open the **Build Variants** window using **View > Tools Windows > Build Variants** from the top menu.
it: Aprire la finestra **Build Variants** attraverso **View > Tools Windows > Build Variants** dal menu in alto.
ru: Откройте окно **Build Variants**, выбрав **View > Tools Windows > Build Variants** в верхнем меню.
zh_tw: 在上方選單選擇 **View > Tool Windows > Build Variants** 開啟 **Build Variants** 視窗。

source: In the **Build Variants** window, make sure that in the **Active Build Variant** column, the ``:editor`` entry is set to one of the **Dev** variants.
it: Nella finestra **Build Variants**, assicurarsi che nella colonna **Active Build Variant** la voce ``:editor`` sia impostata su **dev**.
ru: В окне **Build Variants** убедитесь, что в столбце **Active Build Variant** запись ``:editor`` установлена на один из вариантов **Dev**.
zh_tw: 在 **Build Variants** 視窗中，確認 **Active Build Variant** 欄位的 ``:editor`` 項目已設為其中一個 **Dev** 變體。

source: Open the **Run/Debug Configurations** window by clicking on **Run > Edit Configurations...** on the top menu.
it: Aprire la finestra **Run/Debug Configurations** cliccando su **Run > Edit Configurations...** nel menu in alto.
ru: Откройте окно **Run/Debug Configurations**, нажав **Run > Edit Configurations...** в верхнем меню.
zh_tw: 於上方選單點選 **Run > Edit Configurations...** 開啟 **運作/除錯設定** 視窗。

source: In the **Run/Debug Configurations** window, select the ``editor`` entry, and under **Debugger** make sure the **Debug Type** is set to ``Dual (Java + Native)``
it: Nella finestra **Run/Debug Configurations** , selezionare la voce ``editor`` e in **Debugger** assicurarsi che **Debug Type** sia impostato su ``Dual (Java + Native)``
ru: В окне **Run/Debug Configurations** выберите запись ``editor`` и в разделе **Debugger** убедитесь, что для **Debug Type** установлено значение ``Dual (Java + Native)``
zh_tw: 於 **運作/除錯設定** 視窗中，選擇 ``editor`` 條目，並於 **Debugger** 區塊將 **Debug Type** 設為 ``Dual (Java + Native)``

source: Click the ``+`` sign under the **Symbol Directories** section, and add the ``lib`` module directory: ``platform/android/java/lib``
it: Cliccare sul segno ``+`` nella sezione **Symbol Directiories** e aggiungere la cartella del modulo ``lib``: ``platform/android/java/lib``
ru: Нажмите знак ``+`` под разделом **Symbol Directories (Каталоги символов)** и добавьте каталог модуля ``lib``: ``platform/android/java/lib``
zh_tw: 在 **Symbol Directories** 區塊下點擊 ``+``，新增 ``lib`` 模組目錄：``platform/android/java/lib``

source: Select **Run > Debug 'editor'** from the top menu or `click the Debug icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
it: Selezionare **Run > Debug 'editor'** dal menu in alto oppure `cliccare sull'icona Debug <https://developer.android.com/studio/run/rundebugconfig#running>`_.
ru: Выберите **Run > Debug 'editor'** в верхнем меню или `щелкните значок "Debug" <https://developer.android.com/studio/run/rundebugconfig#running>`_.
zh_tw: 從上方選單選擇 **Run > Debug 'editor'** 或點擊 `偵錯圖示 <https://developer.android.com/studio/run/rundebugconfig#running>`_。

source: Building & debugging the app module
it: Compilazione e debug del modulo app
ru: Сборка и отладка модуля приложения
zh_tw: 建置與除錯 app 模組

source: The ``app`` module requires the presence of a Godot project in its ``assets`` directory (``<Godot root directory>/platform/android/java/app/assets``) to run. This is usually handled by the Godot Editor during the export process. While developing in Android Studio, it's necessary to manually add a Godot project under that directory to replicate the export process. Once that's done, you can follow the instructions below to run/debug the ``app`` module:
ru: Для запуска модуля ``app`` требуется наличие проекта Godot в каталоге ``assets`` (``<корневой каталог Godot>/platform/android/java/app/assets``). Обычно этим занимается редактор Godot во время экспорта. При разработке в Android Studio необходимо вручную добавить проект Godot в этот каталог, чтобы воспроизвести процесс экспорта. После этого вы можете следовать инструкциям ниже для запуска/отладки модуля ``app``:
zh_tw: ``app`` 模組執行時需要在其 ``assets`` 目錄（``<Godot 根目錄>/platform/android/java/app/assets``）下有一個 Godot 專案。這通常在 Godot 編輯器匯出時自動處理，但在 Android Studio 開發時，需手動將 Godot 專案放入該目錄來模擬匯出流程。之後即可依下方指示執行/除錯 ``app`` 模組：

source: To build the ``app`` module:
fr: Pour compiler le module ``app`` :
it: Per compilare il modulo ``app``:
ru: Чтобы собрать модуль ``app``:
zh_tw: 要建置 ``app`` 模組：

source: Select the `Run/Debug Configurations drop down <https://developer.android.com/studio/run/rundebugconfig#running>`_ and select ``app``.
it: Selezionare il menu a discesa `Run/Debug Configurations <https://developer.android.com/studio/run/rundebugconfig#running>`_ e selezionare ``app``.
ru: Выберите раскрывающийся список `Run/Debug Configurations <https://developer.android.com/studio/run/rundebugconfig#running>`_ и выберите ``app``.
zh_tw: 選擇 `執行/除錯設定下拉選單 <https://developer.android.com/studio/run/rundebugconfig#running>`_ 並選擇 ``app``。

source: Select **Run > Run 'app'** from the top menu or `click the Run icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
it: Selezionare **Run > Run 'app'** dal menu in alto oppure `cliccare sull'icona Esegui <https://developer.android.com/studio/run/rundebugconfig#running>`_.
ru: Выберите **Run > Run 'app'** в верхнем меню или нажмите значок «Выполнить» <https://developer.android.com/studio/run/rundebugconfig#running>`_.
zh_tw: 從上方選單選擇 **Run > Run 'app'** 或點擊 `執行圖示 <https://developer.android.com/studio/run/rundebugconfig#running>`_。

source: To debug the ``app`` module:
fr: Pour déboguer le module ``app`` :
it: Per effettuare il debug del modulo ``app``:
ru: Для отладки модуля ``app``:
zh_tw: 要除錯 ``app`` 模組：

source: In the **Build Variants** window, make sure that in the **Active Build Variant** column, the ``:app`` entry is set to one of the **Dev** variants.
it: Nella finestra **Build Variants**, assicurarsi che nella colonna **Active Build Variant** la voce ``:app`` sia impostata su **dev**.
ru: В окне **Build Variants** убедитесь, что в столбце **Active Build Variant** запись ``:app`` установлена на один из вариантов **Dev**.
zh_tw: 在 **Build Variants** 視窗中，確認 **Active Build Variant** 欄位的 ``:app`` 項目已設為其中一個 **Dev** 變體。

source: In the **Run/Debug Configurations** window, select the ``app`` entry, and under **Debugger** make sure the **Debug Type** is set to ``Dual (Java + Native)``
it: Nella finestra **Run/Debug Configurations**, selezionare la voce ``app`` e in **Debugger** assicurarsi che **Debug Type** sia impostato su ``Dual (Java + Native)``
ru: В окне **Run/Debug Configurations** выберите запись ``app`` и в разделе **Debugger** убедитесь, что для **Debug Type** установлено значение ``Dual (Java + Native)``
zh_tw: 於 **運作/除錯設定** 視窗中，選擇 ``app`` 條目，並於 **Debugger** 區塊將 **Debug Type** 設為 ``Dual (Java + Native)``

source: Select **Run > Debug 'app'** from the top menu or `click the Debug icon <https://developer.android.com/studio/run/rundebugconfig#running>`_.
it: Selezionare **Run > Debug 'app'** dal menu in alto oppure `cliccare sull'icona Debug <https://developer.android.com/studio/run/rundebugconfig#running>`_.
ru: Выберите **Run > Debug 'app'** в верхнем меню или` щелкните значок «Отладка» <https://developer.android.com/studio/run/rundebugconfig#running>`_.
zh_tw: 從上方選單選擇 **Run > Debug 'app'** 或點擊 `偵錯圖示 <https://developer.android.com/studio/run/rundebugconfig#running>`_。

source: If you run into any issues, ask for help in `Godot's Android dev channel <https://chat.godotengine.org/channel/android>`__.
it: Se ci si imbatte in qualsiasi problema, chiedere aiuto in uno dei `canali di sviluppo per Android di Godot <https://chat.godotengine.org/channel/android>`__.
ru: Если у вас возникнут какие-либо проблемы, обратитесь за помощью на `канале разработчиков Android Godot <https://chat.godotengine.org/channel/android>`__.
zh_tw: 若遇到任何問題，請至 `Godot Android 開發頻道 <https://chat.godotengine.org/channel/android>`__ 詢問協助。
