Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/development/configuring_an_ide/rider.po
Languages: it, ru, ta, uk, zh_hant

source: JetBrains Rider
ta: செட் பிரைன்ச் ரைடர்
uk: JetBrains Райдер

source: `JetBrains Rider <https://www.jetbrains.com/rider/>`_ is a commercial `JetBrains <https://www.jetbrains.com/>`_ IDE for C++, C# and GDScript that uses the same solution system as Visual Studio.
it: `JetBrains Rider <https://www.jetbrains.com/rider/>`_ è un IDE commerciale di `JetBrains <https://www.jetbrains.com/>`_ per C#, C++ e GDScript che utilizza lo stesso sistema di soluzioni di Visual Studio.
ru: `JetBrains Rider <https://www.jetbrains.com/rider/>`_ — это коммерческая среда разработки `JetBrains <https://www.jetbrains.com/>`_ для C++, C# и GDScript, которая использует ту же систему решений, что и Visual Studio.
ta: `செட் பிரைன்ச் ரைடர் <https://www.jetbraines.com/rider/>` _ என்பது ஒரு வணிக `செட் பிரைன்கள் <https://www.jetbraines.com/>` _ சி ++, சி# மற்றும் சி.டி.எச்.
uk: `JetBrains Rider <https://www.jetbrains.com/rider/>`_ — це комерційне середовище розробки `JetBrains <https://www.jetbrains.com/>`_ для C++, C# та GDScript, яке використовує ту саму систему рішень, що й Visual Studio.
zh_hant: `JetBrains Rider <https://www.jetbrains.com/rider/>`_ 是 `JetBrains <https://www.jetbrains.com/>`_ 提供的商業 IDE，支援 C++、C# 與 GDScript，並使用與 Visual Studio 相同的解決方案系統。

source: This documentation is for contributing to the game engine, not for using JetBrains Rider as a C# or GDScript editor. To code C# or GDScript in an external editor, see :ref:`the C# guide to configure an external editor <doc_c_sharp_setup_external_editor>`.
it: Questa documentazione è pensata per i contributi al motore del gioco, e non all'utilizzo di JetBrains Rider come editor per C# o per GDScript. Per programmare in C# o in GDScript in un editor esterno, consultare la :ref:`guida di C# per configurare un editor esterno <doc_c_sharp_setup_external_editor>`.
ru: Эта документация предназначена для участия в разработке игрового движка, а не для использования JetBrains Rider в качестве редактора C# или GDScript. Чтобы писать код на C# или GDScript во внешнем редакторе, см. :ref:`руководство по настройке внешнего редактора на C# <doc_c_sharp_setup_external_editor>`.
ta: இந்த ஆவணங்கள் விளையாட்டு இயந்திரத்திற்கு பங்களிப்பதற்காக, செட் பிரைன்ச் ரைடரை சி# அல்லது சி.டி.எச்ச்கிரிப்ட் எடிட்டராகப் பயன்படுத்துவதற்காக அல்ல. வெளிப்புற எடிட்டரில் சி# அல்லது GDSCRIPT குறியீடு செய்ய, காண்க: குறிப்பு: `சி# ஒரு வெளிப்புற எடிட்டரை உள்ளமைக்க வழிகாட்டி <doc_c_sharp_setup_external_editor>`.
uk: Ця документація призначена для внеску в ігровий рушій, а не для використання JetBrains Rider як редактора C# або GDScript. Щоб написати код на C# або GDScript у зовнішньому редакторі, див. :ref:`the C# guide to configure an external editor <doc_c_sharp_setup_external_editor>`.
zh_hant: 本文檔用於說明如何貢獻遊戲引擎，而不是教你把 JetBrains Rider 當作 C# 或 GDScript 編輯器使用。若要在外部編輯器撰寫 C# 或 GDScript，請見 :ref:`C# 外部編輯器設定指南 <doc_c_sharp_setup_external_editor>`。

source: Importing the project
it: Importare il progetto
ru: Импортирование проекта
ta: திட்டத்தை இறக்குமதி செய்தல்
uk: Імпорт проекту
zh_hant: 匯入專案

source: If you already use Visual Studio as your main IDE, you can use the same solution file in Rider. Rider and Visual Studio use the same solution format, so you can switch between the two IDEs without rebuilding the solution file. Debug configurations need to be changed when going from one IDE to another.
it: Se si utilizza già Visual Studio come IDE principale, è possibile utilizzare lo stesso file di soluzione in Rider. Rider e Visual Studio utilizzano lo stesso formato di soluzione, quindi è possibile passare da un IDE all'altro senza dover ricostruire il file di soluzione. Le configurazioni di debug si devono cambiare quando si passa da un IDE all'altro.
ru: Если вы уже используете Visual Studio в качестве основной среды разработки (IDE), вы можете использовать тот же файл решения в Rider. Rider и Visual Studio используют одинаковый формат решения, поэтому вы можете переключаться между двумя IDE без пересборки файла решения. При переходе из одной IDE в другую необходимо изменить конфигурации отладки.
ta: நீங்கள் ஏற்கனவே விசுவல் ச்டுடியோவை உங்கள் முதன்மையான ஐ.இ.டி.யாகப் பயன்படுத்தினால், அதே தீர்வு கோப்பை ரைடரில் பயன்படுத்தலாம். ரைடர் மற்றும் விசுவல் ச்டுடியோ ஒரே தீர்வு வடிவமைப்பைப் பயன்படுத்துகின்றன, எனவே தீர்வு கோப்பை மீண்டும் உருவாக்காமல் இரண்டு ஐடிகளுக்கும் இடையில் மாறலாம். பிழைத்திருத்த உள்ளமைவுகளை ஒரு IDE இலிருந்து இன்னொரு இடத்திற்குச் செல்லும்போது மாற்ற வேண்டும்.
uk: Якщо ви вже використовуєте Visual Studio як основну IDE, ви можете використовувати той самий файл рішення в Rider. Rider і Visual Studio використовують однаковий формат рішення, тому ви можете перемикатися між двома IDE без перебудови файлу рішення. Конфігурації налагодження потрібно змінювати під час переходу від однієї IDE до іншої.
zh_hant: 如果你已使用 Visual Studio 作為主要 IDE，可以直接用同一個 solution 檔在 Rider 開啟。Rider 與 Visual Studio 的 solution 格式相容，兩者切換無須重建解決方案。但 IDE 間切換時需重新設定偵錯參數。

source: If you are starting from the scratch, please follow :ref:`instructions<doc_compiling_index>`, specifically:
it: Se si parte da zero, seguire le :ref:`istruzioni<doc_compiling_index>`, in particolare:
ru: Если вы начинаете с нуля, пожалуйста, следуйте :ref:`instructions<doc_compiling_index>`, а именно:
ta: நீங்கள் புதிதாகத் தொடங்கினால், தயவுசெய்து பின்பற்றவும்: குறிப்பு: `வழிமுறைகள் <doc_compiligin_index>`, குறிப்பாக:
uk: Якщо ви починаєте з нуля, будь ласка, дотримуйтесь інструкцій :ref:`instructions<doc_compiling_index>`, зокрема:
zh_hant: 如果你要從零開始，請遵循 :ref:`編譯指南 <doc_compiling_index>`，特別是：

source: Install all the dependencies.
it: Installare tutte le dipendenze.
ru: Установите все зависимости.
ta: அனைத்து சார்புகளையும் நிறுவவும்.
uk: Встановіть усі залежності.
zh_hant: 安裝所有相依套件。

source: Figure out the scons command for compiling to target a specific platform.
it: Capire il comando scons per compilare in modo mirato su una piattaforma specifica.
ru: Разберитесь с командой scons для компиляции на определенной платформе.
ta: ஒரு குறிப்பிட்ட தளத்தை குறிவைக்க தொகுக்க SCANS கட்டளையை கண்டுபிடிக்கவும்.
uk: Визначте команду scons для компіляції для певної платформи.
zh_hant: 確認用於目標平台編譯的 scons 指令。

source: Provide scons with additional arguments to request a solution file generation:
it: Fornire a scons argomenti aggiuntivi per richiedere la generazione di un file di soluzione:
ru: Предоставьте scns дополнительные аргументы для запроса генерации файла решения:
ta: தீர்வு கோப்பு தலைமுறையை கோர கூடுதல் வாதங்களுடன் ச்கோன்களை வழங்கவும்:
uk: Надайте scons додаткові аргументи для запиту на створення файлу рішення:
zh_hant: 在 scons 指令中加入額外參數，以要求產生 solution 檔：

source: Add `vsproj=yes dev_build=yes` to the scons command
it: Aggiungere `vsproj=yes dev_build=yes` al comando scons
ru: Добавьте `vsproj=yes dev_build=yes` в команду scons
ta: ச்கான்ச் கட்டளைக்கு `vsproj = ஆம் dev_build = ஆம்` ஐச் சேர்க்கவும்
uk: Додайте `vsproj=yes dev_build=yes` до команди scons
zh_hant: 在 scons 指令加入 `vsproj=yes dev_build=yes`

source: The ``vsproj`` parameter signals that you want Visual Studio solution generated. The ``dev_build`` parameter ensures the debug symbols are included, allowing to e.g. step through code using breakpoints.
it: Il parametro ``vsproj`` segnala che si desidera generare una soluzione di Visual Studio. Il parametro ``dev_build`` assicura che i simboli di debug siano inclusi, consentendo, ad esempio, di passare per il codice tramite punti d'interruzione.
ru: Параметр ``vsproj`` указывает на необходимость генерации решения Visual Studio. Параметр ``dev_build`` обеспечивает включение отладочных символов, что позволяет, например, выполнять код пошагово, используя точки останова.
ta: விசுவல் ச்டுடியோ தீர்வு உருவாக்கப்படுவதை நீங்கள் விரும்பும் `` vsproj`` அளவுரு சமிக்ஞைகள். `` Dev_build`` அளவுரு பிழைத்திருத்த சின்னங்கள் சேர்க்கப்படுவதை உறுதி செய்கிறது, இது எ.கா. பிரேக் பாயிண்ட்சைப் பயன்படுத்தி குறியீடு வழியாகச் செல்லுங்கள்.
uk: Параметр ``vsproj`` сигналізує про те, що вам потрібно створити рішення Visual Studio. Параметр ``dev_build`` гарантує, що символи налагодження включено, що дозволяє, наприклад, покроково проходити код за допомогою точок зупинки.
zh_hant: ``vsproj`` 參數代表要產生 Visual Studio solution，``dev_build`` 會包含偵錯符號，讓你能逐步除錯。

source: Open the generated ``godot.sln`` in Rider.
it: Aprire il file ``godot.sln`` generato in Rider.
ru: Откройте сгенерированный ``godot.sln`` в Rider.
ta: உருவாக்கப்பட்ட `` kutot.sln`` ஐ சவாரி திறக்கவும்.
uk: Відкрийте згенерований файл ``godot.sln`` у Rider.
zh_hant: 在 Rider 中開啟產生出的 ``godot.sln``。

source: Ensure that the appropriate Solution configuration is selected on the Rider toolbar. It affects resolve of the SDKs, code analysis, build, run, etc.
it: Assicurarsi che la configurazione della soluzione appropriata sia selezionata sulla barra degli strumenti di Rider. Influisce sulla risoluzione degli SDK, sull'analisi del codice, sulla compilazione, sull'esecuzione, ecc.
ru: Убедитесь, что на панели инструментов Rider выбрана соответствующая конфигурация решения. Она влияет на разрешение пакетов SDK, анализ кода, сборку, запуск и т. д.
ta: ரைடர் கருவிப்பட்டியில் பொருத்தமான தீர்வு உள்ளமைவு தேர்ந்தெடுக்கப்பட்டிருப்பதை உறுதிசெய்க. இது SDK கள், குறியீடு பகுப்பாய்வு, உருவாக்கம், ரன் போன்றவற்றின் தீர்மானத்தை பாதிக்கிறது.
uk: Переконайтеся, що на панелі інструментів Rider вибрано відповідну конфігурацію рішення. Це впливає на виконання SDK, аналіз коду, збірку, запуск тощо.
zh_hant: 請確認在 Rider 工具列上選擇了正確的 Solution 組態。這會影響 SDK 解析、程式碼分析、建置與執行等。

source: Compiling and debugging the project
it: Compilazione e debug del progetto
ru: Компиляция и отладка проекта
ta: திட்டத்தை தொகுத்து பிழைத்திருத்துதல்
uk: Компіляція та налагодження проекту
zh_hant: 編譯與除錯專案

source: Rider comes with a built-in debugger that can be used to debug the Godot project. You can launch the debugger by pressing the **Debug** icon at the top of the screen, this only works for the Project Manager, if you want to debug the editor, you need to configure the debugger first.
it: Rider include un debugger integrato che si può utilizzare per il debug del progetto Godot. È possibile avviare il debugger premendo l'icona **Debug** in alto sullo schermo; questa opzione funziona solo per il Gestore dei progetti. Per effettuare il debug dell'editor, è necessario prima configurare il debugger.
ru: Rider имеет встроенный отладчик, который можно использовать для отладки проекта Godot. Вы можете запустить отладчик, нажав на значок **Debug (Отладка)** в верхней части экрана. Это работает только в менеджере проектов. Для отладки редактора необходимо сначала настроить отладчик.
ta: கோடோட் திட்டத்தை பிழைத்திருத்த பயன்படுத்தக்கூடிய ஒரு உள்ளமைக்கப்பட்ட பிழைத்திருத்தியுடன் ரைடர் வருகிறது. திரையின் மேற்புறத்தில் ** பிழைத்திருத்த ** ஐகானை அழுத்துவதன் மூலம் நீங்கள் பிழைத்திருத்தியைத் தொடங்கலாம், இது திட்ட மேலாளருக்கு மட்டுமே வேலை செய்கிறது, நீங்கள் எடிட்டரை பிழைத்திருத்த விரும்பினால், நீங்கள் முதலில் பிழைத்திருத்தியை உள்ளமைக்க வேண்டும்.
uk: Rider постачається з вбудованим налагоджувачем, який можна використовувати для налагодження проекту Godot. Ви можете запустити налагоджувач, натиснувши значок **Налагодження** у верхній частині екрана, це працює лише для менеджера проектів, якщо ви хочете налагодити редактор, вам спочатку потрібно налаштувати налагоджувач.
zh_hant: Rider 內建偵錯器，可用於除錯 Godot 專案。你可以點畫面上方的 **Debug** 圖示啟動偵錯；這預設只會啟動專案管理員，若要除錯 Godot 編輯器，需先進行偵錯設定。

source: Click on the **Godot > Edit Configurations** option at the top of the screen.
it: Clicca sull'opzione **Godot > Modifica configurazioni** nella parte superiore dello schermo.
ru: Нажмите на опцию **Godot > Edit Configurations** в верхней части экрана.
ta: திரையின் மேலே உள்ள ** கோடோட்> உள்ளமைவுகளைத் திருத்து ** விருப்பத்தில் சொடுக்கு செய்க.
uk: Натисніть опцію **Godot > Edit Configurations** у верхній частині екрана.
zh_hant: 點畫面頂端 **Godot > Edit Configurations** 進行設定。

source: Ensure the following values for the C++ Project Run Configuration:
it: Verificare i seguenti valori per la configurazione di esecuzione del progetto C++:
ru: Убедитесь, что для Project Run Configuration C++ заданы следующие значения:
ta: C ++ திட்ட ரன் உள்ளமைவுக்கான பின்வரும் மதிப்புகளை உறுதிப்படுத்தவும்:
uk: Переконайтеся, що такі значення для конфігурації виконання проекту C++:
zh_hant: 請確認 C++ 專案執行設定如下：

source: Exe Path : ``$(LocalDebuggerCommand)``
ru: Путь к исполняемому файлу : ``$(LocalDebuggerCommand)``
ta: Exe பாதை: `` $ (லோக்கல் டெபக்செர்காம்) ``
uk: Шлях до Exe: ``$(LocalDebuggerCommand)``

source: Program Arguments: ``-e --path <path to the Godot project>``
it: Program Arguments: ``-e --path <percorso al progetto Godot>``
ru: Аргументы программы: ``-e --path <путь к проекту Godot >``
ta: நிரல் வாதங்கள்: `` -e--பாதை <கோடோட் திட்டத்திற்கான பாதை> ``
uk: Аргументи програми: ``-e --path <шлях до проекту Godot>``
zh_hant: Program Arguments：``-e --path <Godot 專案路徑>``

source: Working Directory: ``$(LocalDebuggerWorkingDirectory)``
ru: Рабочий каталог: ``$(LocalDebuggerWorkingDirectory)``
ta: வேலை செய்யும் அடைவு: `` $ (லோக்கல் டெபக்சர் வொர்க்கிங் டைரக்டரி) ``
uk: Робочий каталог: ``$(LocalDebuggerWorkingDirectory)``

source: Before Launch has a value of "Build Project"
it: Before Launch ha un valore di "Build Project"
ru: Перед запуском установлено значение "Build Project" ("Сборка проекта")
ta: துவக்கத்திற்கு முன் "திட்டத்தை உருவாக்கு" என்ற மதிப்பு உள்ளது
uk: Перед запуском має значення «Створити проект»
zh_hant: Before Launch 設為「Build Project」

source: This will tell the executable to debug the specified project without opening the Project Manager. Use the root path to the project folder, not ``project.godot`` file path.
it: Questo indicherà all'eseguibile di effettuare il debug del progetto specificato senza aprire il Gestore dei progetti. Utilizzare il percorso della cartella radice del progetto, non il percorso del file ``project.godot``.
ru: Это заставит исполняемый файл отладить указанный проект, не открывая Project Manager. Используйте корневой путь к папке проекта, а не путь к файлу ``project.godot``.
ta: திட்ட மேலாளரைத் திறக்காமல் குறிப்பிட்ட திட்டத்தை பிழைத்திருத்துவதற்கு இது இயங்கக்கூடியதாக இருக்கும். திட்ட கோப்புறைக்கு ரூட் பாதையைப் பயன்படுத்தவும், `` திட்டம்.
uk: Це вкаже виконуваному файлу налагоджувати вказаний проект без відкриття Менеджера проектів. Використовуйте кореневий шлях до папки проекту, а не шлях до файлу ``project.godot``.
zh_hant: 這樣啟動時會直接除錯你指定的專案而不會經過專案管理員。請填入專案資料夾的根路徑，不是 ``project.godot`` 檔案路徑。

source: Finally click on "Apply" and "OK" to save the changes.
it: Infine cliccare su "Apply" e "OK" per salvare le modifiche.
ru: Наконец нажмите "Apply" (Применить) и "ОК", чтобы сохранить изменения.
ta: இறுதியாக மாற்றங்களைச் சேமிக்க "விண்ணப்பிக்கவும்" மற்றும் "சரி" என்பதைக் சொடுக்கு செய்க.
uk: Нарешті натисніть «Застосувати» та «ОК», щоб зберегти зміни.
zh_hant: 最後點選「Apply」與「OK」儲存設定。

source: When you press the **Debug** icon at the top of the screen, JetBrains Rider will launch the Godot editor with the debugger attached.
it: Premendo l'icona **Debug** nella parte superiore dello schermo, JetBrains Rider avvierà l'editor Godot con il debugger collegato.
ru: При нажатии значка **Debug (Отладка)** в верхней части экрана JetBrains Rider запустит редактор Godot с подключенным отладчиком.
ta: திரையின் மேற்புறத்தில் ** பிழைத்திருத்த ** ஐகானை நீங்கள் அழுத்தும்போது, செட் பிரைன்ச் ரைடர் பிழைத்திருத்தியுடன் இணைக்கப்பட்ட கோடோட் எடிட்டரைத் தொடங்குவார்.
uk: Коли ви натискаєте піктограму **Debug** у верхній частині екрана, JetBrains Rider запустить редактор Godot із підключеним налагоджувачем.
zh_hant: 之後你只要按頂端的 **Debug** 圖示，Rider 就會用偵錯器啟動 Godot 編輯器。

source: Alternatively you can use **Run > Attach to Process** to attach the debugger to a running Godot instance.
it: In alternativa, è possibile utilizzare **Run > Attach to Process** per collegare il debugger a un'istanza di Godot in esecuzione.
ru: В качестве альтернативы вы можете использовать **Run > Attach to Process (Запустить > Присоединить к процессу)**, чтобы присоединить отладчик к работающему экземпляру Godot.
ta: மாற்றாக, பிழைத்திருத்தியை இயங்கும் கோடோட் நிகழ்வோடு இணைக்க ** ரன்> செயல்முறைக்கு இணைக்கவும் ** பயன்படுத்தலாம்.
uk: Крім того, ви можете скористатися **Виконати > Приєднати до процесу**, щоб приєднати налагоджувач до запущеного екземпляра Godot.
zh_hant: 你也可以用 **Run > Attach to Process** 將偵錯器附加到已啟動的 Godot 程序。

source: You can find the Godot instance by searching for ``godot.editor`` and then clicking ``Attach with LLDB``
it: Si può trovare l'istanza di Godot cercando ``godot.editor`` e poi cliccando ``Attach with LLDB``
ru: Экземпляр Godot можно найти, выполнив поиск по запросу ``godot.editor`` и нажав ``Attach with LLDB (Прикрепить с помощью LLDB)``
ta: `` கோடோட்.டிட்டர்`` ஐத் தேடுவதன் மூலமும், பின்னர் `` உடன் LLDB`` உடன் இணைக்கவும் கோடோட் நிகழ்வைக் காணலாம்
uk: Ви можете знайти екземпляр Godot, виконавши пошук за ``godot.editor`` і натиснувши ``Прикріпити за допомогою LLDB``
zh_hant: 你可以搜尋 ``godot.editor`` 找到執行中的 Godot 實例，然後點擊 ``Attach with LLDB`` 附加偵錯

source: Debug visualizers
it: Visualizzatori di debug
ru: Отладка визуализаторов
ta: பிழைத்திருத்த காட்சிப்படுத்திகள்
uk: Візуалізатори налагодження
zh_hant: 偵錯視覺化器

source: Debug visualizers customize how complex data structures are displayed during debugging. For Windows "natvis" (short for "Native Visualization") built-in with Godot are automatically used. For other operating systems, similar functionality can be setup manually.
it: I visualizzatori di debug personalizzano il modo in cui le strutture dati complesse vengono visualizzate durante il debug. Per Windows, la tecnologia "natvis" (abbreviazione di "Native Visualization") integrata in Godot è utilizzata automaticamente. Per altri sistemi operativi, è possibile configurare funzionalità simili manualmente.
ru: Debug visualizers (визуализаторы отладки) настраивают отображение сложных структур данных во время отладки. В Windows автоматически используются встроенные функции визуализации "natvis" (сокращение от «Native Visualization»), реализованные в Godot. В других операционных системах аналогичную функциональность можно настроить вручную.
ta: பிழைத்திருத்தத்தின் போது சிக்கலான தரவு கட்டமைப்புகள் எவ்வாறு காண்பிக்கப்படுகின்றன என்பதை பிழைத்திருத்த காட்சிப்படுத்திகள் தனிப்பயனாக்குகின்றன. விண்டோசுக்கு "நாட்விச்" ("சொந்த காட்சிப்படுத்தல்" க்கு குறுகியது) கோடோட்டுடன் உள்ளமைக்கப்பட்டவை தானாகவே பயன்படுத்தப்படுகின்றன. பிற இயக்க முறைமைகளுக்கு, ஒத்த செயல்பாட்டை கைமுறையாக அமைக்கலாம்.
uk: Візуалізатори налагодження налаштовують спосіб відображення складних структур даних під час налагодження. Для Windows автоматично використовується вбудований Godot "natvis" (скорочення від "Native Visualization"). Для інших операційних систем подібну функціональність можна налаштувати вручну.
zh_hant: 偵錯視覺化器可自訂在偵錯時顯示複雜資料結構的方式。Windows 上會自動使用隨 Godot 內建的「natvis」（Native Visualization）。其他作業系統可手動設定類似功能。

source: Please follow `RIDER-123535 <https://youtrack.jetbrains.com/issue/RIDER-123535/nix-Debug-Godot-Cpp-from-Rider-pretty-printers-usability>`_.
it: Si prega di seguire `RIDER-123535 <https://youtrack.jetbrains.com/issue/RIDER-123535/nix-Debug-Godot-Cpp-from-Rider-pretty-printers-usability>`_.
ru: Пожалуйста, следуйте `RIDER-123535 <https://youtrack.jetbrains.com/issue/RIDER-123535/nix-Debug-Godot-Cpp-from-Rider-pretty-printers-usability>`_.
ta: தயவுசெய்து `ரைடர் -123535 <https://youtrack.jetbraines.com/issue/rider-123535/nix-debug-godot-cpp-from-yrider-trinters-uspility>` _.
uk: Будь ласка, дотримуйтесь інструкцій `RIDER-123535 <https://youtrack.jetbrains.com/issue/RIDER-123535/nix-Debug-Godot-Cpp-from-Rider-pretty-printers-usability>`_.
zh_hant: 請參考 `RIDER-123535 <https://youtrack.jetbrains.com/issue/RIDER-123535/nix-Debug-Godot-Cpp-from-Rider-pretty-printers-usability>`_。

source: Unit testing
it: Test unitari
ru: Модульное тестирование
ta: அலகு சோதனை
uk: Модульне тестування
zh_hant: 單元測試

source: Leverage Rider :ref:`doctest<doc_unit_testing>` support. Please refer to `the instructions <https://github.com/JetBrains/godot-support/wiki/Godot-doctest-Unit-Tests>`_.
it: Supporto di :ref:`doctest<doc_unit_testing>` Leverage Rider. Fare riferimento alle `istruzioni <https://github.com/JetBrains/godot-support/wiki/Godot-doctest-Unit-Tests>`_.
ru: Воспользуйтесь поддержкой Rider :ref:`doctest<doc_unit_testing>`. См. `инструкции <https://github.com/JetBrains/godot-support/wiki/Godot-doctest-Unit-Tests>`_.
ta: அந்நியச் செலாவணி ரைடர்: ref: `டாக்டெச்ட் <doc_unit_testing>` உதவி. தயவுசெய்து `அறிவுறுத்தல்கள் <https://github.com/jetbraines/godot-support/wiki/godot-doctantest-unit-tests>` _ ஐப் பார்க்கவும்.
uk: Підтримка Leverage Rider :ref:`doctest<doc_unit_testing>`. Будь ласка, зверніться до `інструкцій <https://github.com/JetBrains/godot-support/wiki/Godot-doctest-Unit-Tests>`_.
zh_hant: 可利用 Rider 的 :ref:`doctest <doc_unit_testing>` 支援。請參考 `說明 <https://github.com/JetBrains/godot-support/wiki/Godot-doctest-Unit-Tests>`_。

source: Profiling
it: Profilazione
ru: Профилирование
ta: விவரக்குறிப்பு
uk: Профілювання
zh_hant: 效能分析

source: Please refer to `the profiling instructions <https://github.com/JetBrains/godot-support/wiki/Profiling-Godot-engine-(native-code)-with-dotTrace-or-JetBrains-Rider>`_.
it: Fare riferimento alle `istruzioni per la profilazione <https://github.com/JetBrains/godot-support/wiki/Profiling-Godot-engine-(native-code)-with-dotTrace-or-JetBrains-Rider>`_.
ru: См. `инструкции по профилированию <https://github.com/JetBrains/godot-support/wiki/Profiling-Godot-engine-(native-code)-with-dotTrace-or-JetBrains-Rider>`_.
ta: தயவுசெய்து `விவரக்குறிப்பு வழிமுறைகள் <https://github.com/jetbraines/godot-support/wiki/profiling-godot-ingine- (நேட்டிவ்-கோட்) -இந்த-டாட்ரேச்-ஓர்-செட் பிரைன்ச்-ரைடர்>` _.
uk: Будь ласка, зверніться до інструкцій з профілювання <https://github.com/JetBrains/godot-support/wiki/Profiling-Godot-engine-(native-code)-with-dotTrace-or-JetBrains-Rider>`_.
zh_hant: 請參考 `效能分析說明 <https://github.com/JetBrains/godot-support/wiki/Profiling-Godot-engine-(native-code)-with-dotTrace-or-JetBrains-Rider>`_。

source: Please consult the `JetBrains Rider documentation <https://www.jetbrains.com/rider/documentation/>`_ for any specific information about the JetBrains IDE.
it: Si prega di consultare la `documentazione di JetBrains Rider <https://www.jetbrains.com/rider/documentation/>`_ per informazioni specifiche sull'IDE JetBrains.
ru: Для получения любой конкретной информации о среде разработки JetBrains IDE обратитесь к `документации JetBrains Rider <https://www.jetbrains.com/rider/documentation/>`_.
ta: செட் பிரைன்ச் ஐடிஇ பற்றிய எந்தவொரு குறிப்பிட்ட தகவலுக்கும் `செட் பிரைன்ச் ரைடர் ஆவணங்கள் <https://www.jetbraines.com/rider/documentation/> _ _ ஆகியவற்றைப் பார்க்கவும்.
uk: Зверніться до `документації JetBrains Rider <https://www.jetbrains.com/rider/documentation/>`_, щоб отримати будь-яку конкретну інформацію про JetBrains IDE.
zh_hant: 如需 JetBrains IDE 進階資訊，請參考 `JetBrains Rider 官方文件 <https://www.jetbrains.com/rider/documentation/>`_。

source: Known issues
it: Problemi noti
ru: Известные проблемы
ta: அறியப்பட்ட சிக்கல்கள்
uk: Відомі проблеми
zh_hant: 已知問題
