Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/development/configuring_an_ide/rider.po
Languages: it, ru, ta, uk, zh_hant

source: Debugging Windows MinGV build - symbols are not loaded. Reported `RIDER-106816 <https://youtrack.jetbrains.com/issue/RIDER-106816/Upgrade-LLDB-to-actual-version>`_.
it: Debug della build Windows MinGV: i simboli non vengono caricati. Segnalato `RIDER-106816 <https://youtrack.jetbrains.com/issue/RIDER-106816/Upgrade-LLDB-to-actual-version>`_.
ru: Отладка сборки Windows MinGV — символы не загружены. Сообщено об ошибке `RIDER-106816 <https://youtrack.jetbrains.com/issue/RIDER-106816/Upgrade-LLDB-to-actual-version>`_.
ta: பிழைத்திருத்தம் சாளரங்கள் MINGV உருவாக்கம் - சின்னங்கள் ஏற்றப்படவில்லை. `ரைடர் -106816 <https://youtrack.jetbraines.com/issue/rider-106816/upgrade-lldb-to-acatual-version>` _.
uk: Налагодження збірки Windows MinGV - символи не завантажуються. Повідомлено про помилку `RIDER-106816 <https://youtrack.jetbrains.com/issue/RIDER-106816/Upgrade-LLDB-to-actual-version>`_.
zh_hant: 在 Windows 偵錯 MinGW 建置——無法載入符號。已回報 `RIDER-106816 <https://youtrack.jetbrains.com/issue/RIDER-106816/Upgrade-LLDB-to-actual-version>`_。
