Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/engine_details/development/configuring_an_ide/visual_studio.po
Languages: ru, ta, uk

source: Visual Studio
ta: விசுவல் ச்டுடியோ

source: `Visual Studio Community <https://visualstudio.microsoft.com>`__ is a Windows-only IDE by `Microsoft <https://microsoft.com>`_ that's free for individual use or non-commercial use within organizations. It has many useful features, such as memory view, performance view, source control and more.
ru: `Visual Studio Community <https://visualstudio.microsoft.com>`__ - это IDE только для Windows от `Microsoft <https://microsoft.com>`_, бесплатная для индивидуального или некоммерческого использования в организациях. Она имеет множество полезных функций, таких как просмотр памяти, просмотр производительности, контроль исходных текстов и многое другое.
ta: `விசுவல் ச்டுடியோ சமூகம் <https://visualstudio.microsoft.com>` __ என்பது ஒரு விண்டோச்-மட்டும் ஐடி ஆகும், இது `மைக்ரோசாஃப்ட் <https://microsoft.com>` _ இது நிறுவனங்களுக்குள் தனிப்பட்ட பயன்பாடு அல்லது வணிகரீதியான பயன்பாட்டிற்கு இலவசம். இது நினைவகக் காட்சி, செயல்திறன் பார்வை, மூல கட்டுப்பாடு மற்றும் பல போன்ற பல பயனுள்ள அம்சங்களைக் கொண்டுள்ளது.
uk: `Visual Studio Community <https://visualstudio.microsoft.com>`__ — це IDE лише для Windows від `Microsoft <https://microsoft.com>`_, яка безкоштовна для індивідуального використання чи некомерційного використання в організаціях. Він має багато корисних функцій, таких як перегляд пам’яті, перегляд продуктивності, керування джерелом тощо.

source: This documentation is for contributions to the game engine, and not using Visual Studio as a C# editor. To code C# in an external editor, see :ref:`the C# guide to configure an external editor <doc_c_sharp_setup_external_editor>`.
ru: Эта документация предназначена для разработчиков игрового движка, а не для пользователей Visual Studio в качестве редактора C#. Чтобы писать код на C# во внешнем редакторе, см. :ref:`руководство по настройке внешнего редактора на C# <doc_c_sharp_setup_external_editor>`.
ta: இந்த ஆவணங்கள் விளையாட்டு இயந்திரத்திற்கான பங்களிப்புகளுக்காகவும், விசுவல் ச்டுடியோவைப் பயன்படுத்தாதது சி# எடிட்டராகவும் இல்லை. வெளிப்புற எடிட்டரில் சி# குறியீட்டிற்கு, பார்க்க: குறிப்பு: `சி# வழிகாட்டி ஒரு வெளிப்புற எடிட்டரை உள்ளமைக்க <doc_c_sharp_setup_external_editor>`.
uk: Ця документація призначена для внеску в ігровий рушій, а не для використання Visual Studio як редактора C#. Щоб написати код на C# у зовнішньому редакторі, див. :ref:`the C# guide to configure an external editor <doc_c_sharp_setup_external_editor>`.

source: Importing the project
ru: Импортирование проекта
ta: திட்டத்தை இறக்குமதி செய்தல்
uk: Імпорт проекту

source: Visual Studio requires a solution file to work on a project. While Godot does not come with the solution file, it can be generated using SCons.
ru: Для работы над проектом Visual Studio требуется solution file (файл решения). Хотя Godot не поставляется с файлом solution, его можно создать с помощью SCons.
ta: விசுவல் ச்டுடியோவுக்கு ஒரு திட்டத்தில் வேலை செய்ய ஒரு தீர்வு கோப்பு தேவை. கோடோட் தீர்வு கோப்புடன் வரவில்லை என்றாலும், அதை ச்கோன்களைப் பயன்படுத்தி உருவாக்கலாம்.
uk: Для роботи над проектом Visual Studio потрібен файл рішення. Хоча Godot не поставляється з файлом рішення, його можна створити за допомогою SCons.

source: Navigate to the Godot root folder and open a Command Prompt or PowerShell window.
ru: Перейдите в корневую папку Godot и откройте окно Command Prompt (командной строки) или PowerShell.
ta: கோடோட் ரூட் கோப்புறையில் செல்லவும், கட்டளை வரியில் அல்லது பவர்செல் சாளரத்தைத் திறக்கவும்.
uk: Перейдіть до кореневої папки Godot і відкрийте вікно командного рядка або PowerShell.

source: Run ``scons platform=windows vsproj=yes dev_build=yes`` to generate the solution with debug symbols.
ru: Запустите ``scons platform=windows vsproj=yes dev_build=yes``, чтобы сгенерировать решение с отладочными символами.
ta: பிழைத்திருத்த சின்னங்களுடன் தீர்வை உருவாக்க `` ச்கான்ச் பிளாட்ஃபார்ம் = சாளரங்கள் vsproj = ஆம் dev_build = ஆம்`` ஐ இயக்கவும்.
uk: Запустіть ``scons platform=windows vsproj=yes dev_build=yes``, щоб створити рішення з символами налагодження.

source: The ``vsproj`` parameter signals that you want Visual Studio solution generated.
ru: Параметр ``vsproj`` сигнализирует о том, что вы хотите сгенерировать решение Visual Studio.
ta: விசுவல் ச்டுடியோ தீர்வு உருவாக்கப்படுவதை நீங்கள் விரும்பும் `` vsproj`` அளவுரு சமிக்ஞைகள்.
uk: Параметр ``vsproj`` сигналізує про те, що ви хочете створити рішення Visual Studio.

source: The ``dev_build`` parameter makes sure the debug symbols are included, allowing to e.g. step through code using breakpoints.
ru: Параметр ``dev_build`` обеспечивает включение отладочных символов, что позволяет, например, выполнять код по шагам, используя breakpoints (точки останова).
ta: `` Dev_build`` அளவுரு பிழைத்திருத்த சின்னங்கள் சேர்க்கப்படுவதை உறுதிசெய்கிறது, இது எ.கா. பிரேக் பாயிண்ட்சைப் பயன்படுத்தி குறியீடு வழியாகச் செல்லுங்கள்.
uk: Параметр ``dev_build`` забезпечує включення символів налагодження, дозволяючи, наприклад, проходження коду за допомогою точок зупину.

source: You can now open the project by double-clicking on the ``godot.sln`` in the project root or by using the **Open a project or solution** option inside of the Visual Studio.
ru: Теперь вы можете открыть проект, дважды щелкнув по файлу ``godot.sln`` в корне проекта или воспользовавшись опцией **Open a project or solution (Открыть проект или решение)** в Visual Studio.
ta: திட்ட மூலத்தில் உள்ள `` கோடோட்.ச்ல்ன்`` இல் இருமுறை சொடுக்கு செய்வதன் மூலமோ அல்லது விசுவல் ச்டுடியோவின் உள்ளே ஒரு திட்டம் அல்லது தீர்வு ** விருப்பத்தைப் பயன்படுத்துவதன் மூலமோ நீங்கள் இப்போது திட்டத்தைத் திறக்கலாம்.
uk: Тепер ви можете відкрити проект, двічі клацнувши ``godot.sln`` у корені проекту або скориставшись опцією **Відкрити проект або рішення** у Visual Studio.

source: Use the **Build** top menu to build the project.
ru: Для сборки проекта используйте верхнее меню **Build (Сборка)**.
ta: திட்டத்தை உருவாக்க ** பில்ட் ** சிறந்த மெனுவைப் பயன்படுத்தவும்.
uk: Використовуйте верхнє меню **Build** для створення проекту.

source: Visual Studio must be configured with the C++ package. It can be selected in the installer:
ru: Visual Studio должна быть настроена с пакетом C++. Его можно выбрать в установщике:
ta: விசுவல் ச்டுடியோ சி ++ தொகுப்புடன் கட்டமைக்கப்பட வேண்டும். இதை நிறுவியில் தேர்ந்தெடுக்கலாம்:
uk: Visual Studio має бути налаштовано за допомогою пакета C++. Його можна вибрати в інсталяторі:

source: Debugging the project
ru: Отладка проекта
ta: திட்டத்தை பிழைத்திருத்துகிறது
uk: Налагодження проекту

source: Visual Studio features a powerful debugger. This allows the user to examine Godot's source code, stop at specific points in the code, inspect the current execution context, and make live changes to the codebase.
ru: Visual Studio предлагает мощный отладчик. Он позволяет пользователю исследовать исходный код Godot, останавливаться в определённых точках кода, проверять текущий контекст выполнения и вносить изменения в кодовую базу в режиме реального времени.
ta: விசுவல் ச்டுடியோ ஒரு சக்திவாய்ந்த பிழைத்திருத்தியைக் கொண்டுள்ளது. இது கோடோட்டின் மூலக் குறியீட்டை ஆராயவும், குறியீட்டில் குறிப்பிட்ட புள்ளிகளை நிறுத்தவும், தற்போதைய செயல்பாட்டு சூழலை ஆய்வு செய்யவும், குறியீட்டுத் தளத்தில் நேரடி மாற்றங்களைச் செய்யவும் பயனரை அனுமதிக்கிறது.
uk: Visual Studio має потужний налагоджувач. Це дозволяє користувачеві перевіряти вихідний код Godot, зупинятися на певних точках у коді, перевіряти поточний контекст виконання та вносити зміни в кодову базу.

source: You can launch the project with the debugger attached using the **Debug > Start Debugging** option from the top menu. However, unless you want to debug the Project Manager specifically, you'd need to configure debugging options first. This is due to the fact that when the Godot Project Manager opens a project, the initial process is terminated and the debugger gets detached.
ru: Вы можете запустить проект с подключенным отладчиком, выбрав пункт **Debug > Start Debugging (Отладка > Начать отладку)** в верхнем меню. Однако, если вы не хотите отлаживать непосредственно Project Manager, вам сначала потребуется настроить параметры отладки. Это связано с тем, что при открытии проекта Project Manager Godot исходный процесс завершается, а отладчик отключается.
ta: மேல் மெனுவிலிருந்து ** பிழைத்திருத்தம்> பிழைத்திருத்தத்தைத் தொடங்கு ** விருப்பத்தைப் பயன்படுத்தி இணைக்கப்பட்ட பிழைத்திருத்தத்துடன் திட்டத்தைத் தொடங்கலாம். இருப்பினும், நீங்கள் குறிப்பாக திட்ட மேலாளரை பிழைத்திருத்த விரும்பினால் தவிர, நீங்கள் முதலில் பிழைத்திருத்த விருப்பங்களை உள்ளமைக்க வேண்டும். கோடோட் திட்ட மேலாளர் ஒரு திட்டத்தைத் திறக்கும்போது, ஆரம்ப செயல்முறை நிறுத்தப்பட்டு பிழைத்திருத்தர் பிரிக்கப்படுவதால் இதற்குக் காரணம்.
uk: Ви можете запустити проект із підключеним налагоджувачем за допомогою параметра **Debug > Start Debugging** у верхньому меню. Однак, якщо ви не хочете спеціально налагодити менеджер проектів, спершу потрібно налаштувати параметри налагодження. Це пов’язано з тим, що коли керівник проекту Godot відкриває проект, початковий процес припиняється, а налагоджувач від’єднується.

source: To configure the launch options to use with the debugger use **Project > Properties** from the top menu:
ru: Чтобы настроить параметры запуска для использования с отладчиком, используйте **Project > Properties (Проект > Свойства)** в верхнем меню:
ta: பிழைத்திருத்தத்துடன் பயன்படுத்த வெளியீட்டு விருப்பங்களை உள்ளமைக்க ** திட்டம்> பண்புகள் ** மேல் மெனுவிலிருந்து:
uk: Щоб налаштувати параметри запуску для використання з налагоджувачем, скористайтеся **Проект > Властивості** у верхньому меню:

source: Open the **Debugging** section and under **Command Arguments** add two new arguments: the ``-e`` flag opens the editor instead of the Project Manager, and the ``--path`` argument tells the executable to open the specified project (must be provided as an *absolute* path to the project root, not the ``project.godot`` file; if the path contains spaces be sure to pass it inside double quotation marks).
ru: Откройте раздел **Debugging (Отладка)** и в разделе **Command Arguments (Аргументы команды)** добавьте два новых аргумента: флаг ``-e`` открывает редактор вместо менеджера проектов, а аргумент ``--path`` указывает исполняемому файлу открыть указанный проект (должен быть указан как *абсолютный* путь к корню проекта, а не к файлу ``project.godot``; если путь содержит пробелы, обязательно заключите его в двойные кавычки).
ta: ** பிழை குறிப்பிட்ட திட்டத்தைத் திறப்பதற்கு இயங்கக்கூடியது (திட்ட மூலத்திற்கு * முழுமையான * பாதையாக வழங்கப்பட வேண்டும், `` திட்டம். கட் `` கோப்பு அல்ல; பாதையில் இடங்கள் இருந்தால் அதை இரட்டை மேற்கோள் மதிப்பெண்களுக்குள் அனுப்புவது உறுதி).
uk: Відкрийте розділ **Налагодження** та в розділі **Аргументи команди** додайте два нові аргументи: прапорець ``-e`` відкриває редактор замість менеджера проекту, а аргумент ``--path`` повідомляє виконуваний файл, щоб відкрити вказаний проект (повинен бути наданий як *абсолютний* шлях до кореня проекту, а не до файлу ``project.godot``; якщо шлях містить пробіли, обов’язково введіть його в подвійні лапки).

source: To learn more about command line arguments, refer to the :ref:`command line tutorial <doc_command_line_tutorial>`.
ru: Более подробную информацию об аргументах командной строки см. в :ref:`руководстве по командной строке <doc_command_line_tutorial>`.
ta: கட்டளை வரி வாதங்களைப் பற்றி மேலும் அறிய, இதைப் பார்க்கவும்: ref: `கட்டளை வரி பயிற்சி <doc_command_line_tutorial>`.
uk: Щоб дізнатися більше про аргументи командного рядка, зверніться до :ref:`command line tutorial <doc_command_line_tutorial>`.

source: Even if you start the project without a debugger attached it can still be connected to the running process using **Debug > Attach to Process...** menu.
ru: Даже если вы запустите проект без подключенного отладчика, его все равно можно подключить к запущенному процессу с помощью меню **Debug > Attach to Process... (Отладка > Присоединить к процессу...)**.
ta: பிழைத்திருத்தம் இணைக்கப்படாமல் நீங்கள் திட்டத்தைத் தொடங்கினாலும், ** பிழைத்திருத்தம்> செயல்முறைக்கு இணைக்கவும் ... ** பட்டியல் ஆகியவற்றைப் பயன்படுத்தி இயங்கும் செயல்முறையுடன் அதை இணைக்க முடியும்.
uk: Навіть якщо ви запустите проект без підключеного налагоджувача, його все одно можна підключити до запущеного процесу за допомогою меню **Debug > Attach to Process...**.

source: To check that everything is working, put a breakpoint in ``main.cpp`` and press :kbd:`F5` to start debugging.
ru: Чтобы проверить, что все работает, поставьте breakpoint (точку останова) в ``main.cpp`` и нажмите :kbd:`F5`, чтобы начать отладку.
ta: எல்லாம் செயல்படுகிறதா என்பதைச் சரிபார்க்க, `` main.cpp`` இல் ஒரு இடைவெளியை வைத்து, பிழைத்திருத்தத்தைத் தொடங்க `F5` ஐ அழுத்தவும்.
uk: Щоб перевірити, чи все працює, поставте точку зупину в ``main.cpp`` і натисніть :kbd:`F5`, щоб розпочати налагодження.

source: If you run into any issues, ask for help in one of `Godot's community channels <https://godotengine.org/community>`__.
ru: Если у вас возникнут какие-либо проблемы, обратитесь за помощью в один из `каналов сообщества Godot <https://godotengine.org/community>`__.
ta: நீங்கள் ஏதேனும் சிக்கல்களில் சிக்கினால், `கோடோட்டின் சமூக சேனல்களில் ஒன்றில் உதவி கேளுங்கள் <https://godotengine.org/community> __.
uk: Якщо у вас виникнуть проблеми, зверніться по допомогу в один із каналів спільноти Godot <https://godotengine.org/community>__.
