Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/compute_shaders.po
Languages: fr, ga, ja, ru, ta, uk, zh_cn, zh_tw

source: Ideally, you would not call ``sync()`` to synchronize the RenderingDevice right away as it will cause the CPU to wait for the GPU to finish working. In our example, we synchronize right away because we want our data available for reading right away. In general, you will want to wait *at least* 2 or 3 frames before synchronizing so that the GPU is able to run in parallel with the CPU.
ga: Go hidéalach, ní ghlaoifeá ar ``sync () ``chun an RenderingDevice a shioncronú láithreach mar go gcuirfidh sé faoi deara an LAP fanacht go gcríochnóidh an GPU ag obair. Inár sampla, sioncrónaímid láithreach toisc go dteastaíonn uainn ár gcuid sonraí ar fáil le léamh láithreach. Go ginearálta, beidh tú ag iarraidh fanach* ar a laghad* 2 nó 3 fráma sula ndéanann tú sioncrónú ionas go mbeidh an GPU in ann rith comhthreomhar leis an LAP.
ja: すぐに ``sync()`` を呼び出してRenderingDeviceを同期させないほうが理想的にはいいです。これはCPUがGPUの処理を完了するまで待機することになるからです。この例ではデータをすぐに読み取るため直後に同期しています。一般的にはGPUがCPUと並行して実行できるように、同期する前に *少なくとも* 2～3フレーム待機する必要があります。
ru: В идеале не следует вызывать ``sync()`` для синхронизации RenderingDevice сразу, так как это заставит CPU ждать завершения работы GPU. В нашем примере мы синхронизируемся сразу, потому что хотим, чтобы данные были доступны для чтения немедленно. В общем случае, перед синхронизацией следует подождать *как минимум* 2-3 кадра, чтобы GPU мог работать параллельно с CPU.
ta: வெறுமனே, வழங்குதல் டெவிசை இப்போதே ஒத்திசைக்க `` ஒத்திசைவு () `` என்று அழைக்க மாட்டீர்கள், ஏனெனில் இது சி.பீ.யு வேலை முடிக்க சிபியு காத்திருக்கும். எங்கள் எடுத்துக்காட்டில், நாங்கள் இப்போதே ஒத்திசைக்கிறோம், ஏனென்றால் எங்கள் தரவு இப்போதே படிக்க வேண்டும். பொதுவாக, ஒத்திசைப்பதற்கு முன் குறைந்தபட்சம் * 2 அல்லது 3 பிரேம்கள் காத்திருக்க விரும்புவீர்கள், இதனால் சி.பீ.யூ சிபியு உடன் இணையாக இயங்க முடியும்.
uk: В ідеалі ви б не викликали ``sync()`` для синхронізації RenderingDevice одразу, оскільки це змусить центральний процесор чекати завершення роботи графічного процесора. У нашому прикладі ми синхронізуємо відразу, тому що ми хочемо, щоб наші дані були доступні для читання відразу. Загалом, вам потрібно зачекати *принаймні* 2-3 кадри перед синхронізацією, щоб графічний процесор міг працювати паралельно з центральним процесором.
zh_tw: 理想情況下，不要立刻呼叫 ``sync()`` 同步 RenderingDevice，因為這會讓 CPU 停等 GPU 完成。這裡為了立即取得資料方便教學才馬上同步。通常建議至少等 2~3 幀後再同步，這樣 GPU 才能與 CPU 平行運作，提升效率。

source: Long computations can cause Windows graphics drivers to "crash" due to :abbr:`TDR (Timeout Detection and Recovery)` being triggered by Windows. This is a mechanism that reinitializes the graphics driver after a certain amount of time has passed without any activity from the graphics driver (usually 5 to 10 seconds).
ga: Is féidir le ríomhanna fada a bheith ina chúis le tiománaithe grafaicí Windows “titim” mar gheall ar: abbr: `TDR (Braite Amach agus Aisghabháil) `á spreagadh ag Windows. Is meicníocht é seo a aththosaíonn an tiománaí grafaicí tar éis méid áirithe ama a bheith caite gan aon ghníomhaíocht ón tiománaí grafaicí (de ghnáth 5 go 10 soicind).
ja: コンピュート処理に時間がかかると、WindowsによってトリガーされるTDR (タイムアウト検出と回復) が原因でWindowsグラフィックスドライバーが "クラッシュ" する可能性があります。これはグラフィックスドライバーからのアクティビティがない状態で一定の時間が経過した後 (通常は5～10秒)、グラフィックスドライバーを再初期化するメカニズムです。
ru: Длительные вычисления могут привести к "crash" графических драйверов Windows из-за активации :abbr:`TDR (Timeout Detection and Recovery)` в Windows. Это механизм, который повторно инициализирует графический драйвер по истечении определённого времени бездействия (обычно 5–10 секунд).
ta: நீண்ட கணக்கீடுகள் சாளரங்கள் கிராபிக்ச் இயக்கிகள் "செயலிழக்க" காரணமாக இருக்கலாம்: ஏபிபிஆர்: `டி.டி.ஆர் (காலக்கெடு கண்டறிதல் மற்றும் மீட்பு)` விண்டோசால் தூண்டப்படுகிறது. கிராபிக்ச் டிரைவரிடமிருந்து (வழக்கமாக 5 முதல் 10 வினாடிகள் வரை) எந்தவொரு செயலும் இல்லாமல் ஒரு குறிப்பிட்ட நேரத்திற்குப் பிறகு கிராபிக்ச் இயக்கியை மீண்டும் செயல்படுத்தும் ஒரு பொறிமுறையாகும்.
uk: Довгі обчислення можуть призвести до «збою» графічних драйверів Windows через :abbr:`TDR (Timeout Detection and Recovery)`, який запускає Windows. Це механізм, який повторно ініціалізує графічний драйвер після того, як мине певний проміжок часу без жодної активності графічного драйвера (зазвичай від 5 до 10 секунд).
zh_tw: 長時間運算可能會因 Windows 觸發 :abbr:`TDR (Timeout Detection and Recovery，逾時偵測與復原)` 而讓圖形驅動程式「當機」。這是 Windows 在圖形驅動無回應一段時間（通常 5~10 秒）後，會自動重新初始化驅動程式的機制。

source: Depending on the duration your compute shader takes to execute, you may need to split it into multiple dispatches to reduce the time each dispatch takes and reduce the chances of triggering a TDR. Given TDR is time-dependent, slower GPUs may be more prone to TDRs when running a given compute shader compared to a faster GPU.
ga: Ag brath ar an fad a thógann do scáthóir ríomhaireachta a fhorghníomhú, b'fhéidir go mbeidh ort é a roinnt ina seoltaí iolracha chun an t-am a thógann gach seoladh a laghdú agus an seans go dtarlóidh TDR a spreagadh a laghdú. Ós rud é go bhfuil TDR ag brath ar am, d'fhéadfadh go mbeadh GPUanna níos moille níos seans ann do TDRanna agus scáthóir ríomhaireachta áirithe á rith á rith i gcomparáid le GPU níos gasta.
ja: コンピューシェーダーの実行にかかる時間に応じて、各ディスパッチにかかる時間を短縮し、TDR がトリガーされる可能性を減らすため、コンピュートシェーダーを複数のディスパッチに分割する必要がある場合があります。 TDRが時間に依存することを考えると、低速なGPUは高速なGPUに比べて、特定のコンピュートシェーダーを実行するときにTDRが発生しやすい可能性があります。
ru: В зависимости от длительности выполнения вычислительного шейдера может потребоваться разделить его на несколько отправок, чтобы сократить время каждой отправки и снизить вероятность срабатывания TDR. Учитывая, что TDR зависит от времени, более медленные видеокарты могут быть более подвержены возникновению TDR при выполнении данного вычислительного шейдера по сравнению с более быстрыми видеокартами.
ta: உங்கள் கம்ப்யூட் சேடர் செயல்படுத்த எடுக்கும் காலத்தைப் பொறுத்து, ஒவ்வொரு அனுப்புதலும் எடுக்கும் நேரத்தைக் குறைக்கவும், டி.டி.ஆரைத் தூண்டுவதற்கான வாய்ப்புகளை குறைக்கவும் நீங்கள் அதை பல அனுப்புதல்களாக பிரிக்க வேண்டியிருக்கும். கொடுக்கப்பட்ட டி.டி.ஆர் நேரத்தை சார்ந்தது, வேகமான சி.பீ.யுடன் ஒப்பிடும்போது கொடுக்கப்பட்ட கம்ப்யூட் சேடரை இயக்கும் போது மெதுவான சி.பீ.யுகள் டி.டி.ஆர்களுக்கு அதிக வாய்ப்புள்ளது.
uk: Залежно від тривалості виконання обчислювального шейдера, вам може знадобитися розділити його на кілька відправлень, щоб скоротити час, який займає кожне відправлення, і зменшити ймовірність запуску TDR. Враховуючи, що TDR залежить від часу, повільніші графічні процесори можуть бути більш схильні до TDR під час роботи певного обчислювального шейдера порівняно зі швидшим графічним процесором.
zh_tw: 依據計算著色器執行所需時間，可能需要拆成多次調度，以縮短每次執行時間、降低觸發 TDR 的風險。由於 TDR 與執行時間有關，較慢的 GPU 執行同樣著色器時比高速 GPU 更容易遇到 TDR 問題。

source: Retrieving results
fr: Récupérer les résultats
ga: Torthaí a aisghabháil
ja: 結果の取得
ru: Получение результатов
ta: முடிவுகளை மீட்டெடுப்பது
uk: Отримання результатів
zh_cn: 获取结果
zh_tw: 取得運算結果

source: You may have noticed that, in the example shader, we modified the contents of the storage buffer. In other words, the shader read from our array and stored the data in the same array again so our results are already there. Let's retrieve the data and print the results to our console.
ga: B'fhéidir gur thug tú faoi deara gur athraíomar ábhar an mhaoláin stórála san ábhar samplaí scádaithe. Is é sin le rá, léigh an scáthóir ónár n-eagar agus stóráil sé na sonraí san eagar céanna arís ionas go bhfuil ár dtorthaí ann cheana féin. Déanaimis na sonraí a aisghabháil agus na torthaí a phriontáil chuig ár gconsól.
ja: この例のシェーダーでは、ストレージバッファの内容を変更していることに気づいたかもしれません。言い換えればシェーダーは配列からデータを読み取り、同じ配列にデータを保存しているので結果はそこにあります。データを取得して結果をコンソールに出力しましょう。
ru: Вы, возможно, заметили, что в примере шейдера мы изменили содержимое буфера хранения. Другими словами, шейдер считывает данные из нашего массива и снова сохраняет их в том же массиве, так что наши результаты уже там. Давайте извлечём данные и выведем результат на консоль.
ta: எடுத்துக்காட்டில் சேடரில், சேமிப்பக இடையகத்தின் உள்ளடக்கங்களை நாங்கள் மாற்றியமைத்ததை நீங்கள் கவனித்திருக்கலாம். வேறு வார்த்தைகளில் கூறுவதானால், சேடர் எங்கள் வரிசையிலிருந்து படித்து, அதே வரிசையில் தரவை மீண்டும் சேமித்து வைத்தது, எனவே எங்கள் முடிவுகள் ஏற்கனவே உள்ளன. தரவை மீட்டெடுப்போம் மற்றும் முடிவுகளை எங்கள் கன்சோலில் அச்சிடுவோம்.
uk: Можливо, ви помітили, що у прикладі шейдера ми змінили вміст буфера зберігання. Іншими словами, шейдер прочитав наш масив і знову зберіг дані в тому ж масиві, тому наші результати вже є. Давайте отримаємо дані та надрукуємо результати на нашу консоль.
zh_tw: 您可能注意到，在範例著色器中，我們直接修改了儲存緩衝區內容。換言之，著色器從原本的陣列讀取資料後，再把結果寫回同一陣列。因此結果已經在那裡。現在我們來取出資料，並將結果印在控制台上。

source: Freeing memory
ru: Очистка памяти

source: The ``buffer``, ``pipeline``, and ``uniform_set`` variables we've been using are each an :ref:`class_RID`. Because RenderingDevice is meant to be a lower-level API, RIDs aren't freed automatically. This means that once you're done using ``buffer`` or any other RID, you are responsible for freeing its memory manually using the RenderingDevice's :ref:`free_rid()<class_RenderingDevice_method_free_rid>` method.
ru: Используемые нами переменные ``buffer``, ``pipeline`` и ``uniform_set`` представляют собой :ref:`class_RID`. Поскольку RenderingDevice задуман как низкоуровневый API, RID не освобождаются автоматически. Это означает, что после завершения использования ``buffer`` или любого другого RID вам необходимо вручную освободить память с помощью метода :ref:`free_rid()<class_RenderingDevice_method_free_rid>` класса RenderingDevice.

source: With that, you have everything you need to get started working with compute shaders.
fr: Avec ça, vous avez tout ce dont vous avez besoin pour commencer à travailler avec des shaders de calcul.
ga: Leis sin, tá gach rud a theastaíonn uait chun tosú ag obair le scáthóirí ríomhaireachta.
ja: これでコンピュートシェーダーの使用を開始するために必要なものがすべて揃いました。
ru: Теперь у вас есть все необходимое для начала работы с вычислительными шейдерами.
ta: அதனுடன், கம்ப்யூட் சேடர்களுடன் வேலை செய்யத் தொடங்க வேண்டிய அனைத்தும் உங்களிடம் உள்ளன.
uk: Таким чином, у вас є все необхідне, щоб розпочати роботу з обчислювальними шейдерами.
zh_tw: 至此，您已具備開始操作計算著色器的一切基礎知識。

source: The demo projects repository contains a `Compute Shader Heightmap demo <https://github.com/godotengine/godot-demo-projects/tree/master/compute/heightmap>`__ This project performs heightmap image generation on the CPU and GPU separately, which lets you compare how a similar algorithm can be implemented in two different ways (with the GPU implementation being faster in most cases).
ru: Репозиторий демонстрационных проектов содержит `демонстрацию Compute Shader Heightmap <https://github.com/godotengine/godot-demo-projects/tree/master/compute/heightmap>`__ Этот проект выполняет генерацию изображения карты высот отдельно на центральном процессоре и графическом процессоре, что позволяет сравнить, как один и тот же алгоритм может быть реализован двумя различными способами (при этом реализация на графическом процессоре в большинстве случаев оказывается быстрее).

source: Finally, we write the ``main`` function which is where all the logic happens. We access a position in the storage buffer using the ``gl_GlobalInvocationID`` built in variables. ``gl_GlobalInvocationID`` gives you the global unique ID for the current invocation.
ja: 最後にすべてのロジックが実行される ``main`` 関数を作成します。組み込み変数 ``gl_GlobalInvocationID`` を使用して、ストレージバッファ内の位置にアクセスします。 ``gl_GlobalInvocationID`` は現在の実行インスタンスに対するグローバルでユニークなIDを提供します。
ta: இறுதியாக, நாங்கள் `` பிரதான`` செயல்பாட்டை எழுதுகிறோம், அங்குதான் எல்லா தர்க்கங்களும் நடக்கும். மாறிகளில் கட்டப்பட்ட `` gl_globalinvocationid`` ஐப் பயன்படுத்தி சேமிப்பக இடையகத்தில் ஒரு நிலையை அணுகுவோம். `` gl_globalinvocationid`` தற்போதைய அழைப்பிற்கான உலகளாவிய தனித்துவமான ஐடியை உங்களுக்கு வழங்குகிறது.

source: The demo projects repository contains a `Compute Shader Heightmap demo <https://github.com/godotengine/godot-demo-projects/tree/master/misc/compute_shader_heightmap>`__ This project performs heightmap image generation on the CPU and GPU separately, which lets you compare how a similar algorithm can be implemented in two different ways (with the GPU implementation being faster in most cases).
ga: Tá taispeántas `Compute Shader Heightmap' i stór na dtionscadal taispeána <https://github.com/godotengine/godot-demo-projects/tree/master/misc/compute_shader_heightmap>`__ Déanann an tionscadal seo giniúint íomhá léarscáile airde ar an LAP agus GPU ar leithligh , a ligeann duit comparáid a dhéanamh idir conas is féidir algartam den chineál céanna a chur i bhfeidhm ar dhá bhealach difriúil (le cur i bhfeidhm GPU níos tapúla i bhformhór na gcásanna).
ja: デモプロジェクトのリポジトリには `Compute Shader Heightmap demo <https://github.com/godotengine/godot-demo-projects/tree/master/misc/compute_shader_heightmap>`__ が含まれています。このプロジェクトはCPUとGPUで個別にハイトマップイメージの生成を実行します。これにより同様のアルゴリズムを2つの異なる方法で実装する方法を比較できます (ほとんどの場合、GPU実装の方が高速です)。
ta: டெமோ திட்டங்கள் களஞ்சியத்தில் `கம்ப்யூட் சேடர் ஐட்மேப் டெமோ <https://github.com/godotengine/godot-demo-projects/tree/miscer/misc/compute_shader_heightmap>` __ இந்த திட்டம் சிபியு இல் உயர்நிலை படத்தை உருவாக்குகிறது , இது இரண்டு வெவ்வேறு வழிகளில் இதேபோன்ற வழிமுறையை எவ்வாறு செயல்படுத்த முடியும் என்பதை ஒப்பிட அனுமதிக்கிறது (சி.பீ.யூ செயல்படுத்தல் பெரும்பாலான சந்தர்ப்பங்களில் வேகமாக இருக்கும்).
uk: Репозиторій демонстраційних проектів містить `демонстрацію Compute Shader Heightmap <https://github.com/godotengine/godot-demo-projects/tree/master/misc/compute_shader_heightmap>`__ Цей проект створює зображення карти висот окремо на CPU та GPU , який дає змогу порівняти, як подібний алгоритм можна реалізувати двома різними способами (причому реалізація GPU у більшості випадків швидша).
zh_tw: 示範專案倉庫中有一個 `Compute Shader Heightmap demo <https://github.com/godotengine/godot-demo-projects/tree/master/misc/compute_shader_heightmap>`__，這個專案會分別在 CPU 和 GPU 上產生高度圖，讓您比較同一演算法在兩種方式下的實作（大多數情況下 GPU 會更快）。

source: Translation status
ja: 翻訳ステータス
