Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/compute_shaders.po
Languages: fr, ga, ja, ru, ta, uk, zh_cn, zh_tw

source: Using compute shaders
fr: Utiliser les shaders de calcul
ga: Ag baint úsáide as scáthóirí ríofa
ja: コンピュートシェーダー
ru: Применение вычислительных шейдеров
ta: கம்ப்யூட் சேடர்களைப் பயன்படுத்துதல்
uk: Використання обчислювальних шейдерів
zh_cn: 使用计算着色器
zh_tw: 使用計算著色器

source: This tutorial will walk you through the process of creating a minimal compute shader. But first, a bit of background on compute shaders and how they work with Godot.
fr: Ce tutoriel vous accompagnera dans le processus de création d'un shader de calcul basique. Mais d'abord, un peu de contexte sur les shaders de calcul et comment ils marchent avec Godot.
ga: Siúlóidh an rang teagaisc seo tú tríd an bpróiseas chun scáthóir ríomhaireachta íosta a chruthú. Ach ar dtús, beagán cúlra ar scáthóirí ríomh agus conas a oibríonn siad le Godot.
ja: このチュートリアルでは、最小限のコンピュートシェーダーを作成するプロセスについて説明します。その前にコンピュートシェーダーと、それがGodotとどのように連携するかについて少し説明します。
ru: В этом руководстве мы покажем вам процесс создания минимального вычислительного шейдера. Но сначала немного информации о вычислительных шейдерах и их работе с Godot.
ta: இந்த பயிற்சி குறைந்தபட்ச கம்ப்யூட் சேடரை உருவாக்கும் செயல்முறையின் மூலம் உங்களை அழைத்துச் செல்லும். ஆனால் முதலில், கம்ப்யூட் சேடர்கள் மற்றும் அவை கோடோட்டுடன் எவ்வாறு செயல்படுகின்றன என்பதற்கான பின்னணி.
uk: Цей підручник проведе вас через процес створення мінімального обчислювального шейдера. Але спочатку трохи фону про обчислювальні шейдери та про те, як вони працюють із Godot.
zh_cn: 本教程会带领你创建一个最简单的计算着色器。但首先需要先介绍一下计算着色器的背景以及在 Godot 中的工作原理。
zh_tw: 本教學將帶您一步步建立一個簡單的計算著色器。在開始之前，先簡介計算著色器的背景及它如何與 Godot 配合運作。

source: This tutorial assumes you are familiar with shaders generally. If you are new to shaders please read :ref:`doc_introduction_to_shaders` and :ref:`your first shader <toc-your-first-shader>` before proceeding with this tutorial.
ga: Glactar leis sa rang teagaisc seo go bhfuil tú eolach ar scáthaitheoirí go ginearálta. Mura bhfuil nua agat do scáthaitheoirí léigh :ref:`doc_introduction_to_shaders` agus :ref:`do chéad scáthaitheoir <toc-your-first-shader>` roimh leanúint ar aghaidh leis an rang teagaisc seo.
ja: このチュートリアルは読者がシェーダー全般について精通していることを前提としています。シェーダーを初めて使用する場合は、このチュートリアルに進む前に、:ref:`doc_introduction_to_shaders` と :ref:`初めてのシェーダー <toc-your-first-shader>` をお読みください。
ru: В этом руководстве предполагается, что вы в целом знакомы с шейдерами. Если вы новичок в этом деле, пожалуйста, прочтите :ref:`doc_introduction_to_shaders` и :ref:`your first shader <toc-your-first-shader>`, прежде чем продолжить изучение этого руководства.
ta: இந்த டுடோரியல் பொதுவாக சேடர்களை நீங்கள் அறிந்திருக்கிறீர்கள் என்று கருதுகிறது. நீங்கள் சேடர்களுக்கு புதியவராக இருந்தால், தயவுசெய்து படிக்கவும்: குறிப்பு: `doc_introduction_to_shaders` மற்றும்: ref:` உங்கள் முதல் சேடர் <TOC-உங்கள் முதல்-சேடர்> `இந்த டுடோரியலுடன் தொடர்வதற்கு முன்.
uk: Цей посібник передбачає, що ви загалом знайомі з шейдерами. Якщо ви новачок у шейдерах, будь ласка, прочитайте :ref:`doc_introduction_to_shaders` і :ref:`ваш перший шейдер <toc-your-first-shader>` перед тим, як продовжити цей посібник.
zh_cn: 本教程假定你已大致熟悉着色器。如果你是着色器新手，请先阅读《\ :ref:`doc_introduction_to_shaders`\ 》和《\ :ref:`你的第一个着色器 <toc-your-first-shader>`\ 》，然后再继续本教程。
zh_tw: 本教學假設您已大致熟悉著色器。如果您是新手，請在繼續本教學前先閱讀 :ref:`doc_introduction_to_shaders` 及 :ref:`您的第一個著色器 <toc-your-first-shader>`。

source: A compute shader is a special type of shader program that is orientated towards general purpose programming. In other words, they are more flexible than vertex shaders and fragment shaders as they don't have a fixed purpose (i.e. transforming vertices or writing colors to an image). Unlike fragment shaders and vertex shaders, compute shaders have very little going on behind the scenes. The code you write is what the GPU runs and very little else. This can make them a very useful tool to offload heavy calculations to the GPU.
fr: Un shader de calcul est un type spécial de programme de shader qui est orienté vers la programmation générale. En d'autres termes, ils sont plus flexibles que les shaders de sommet et de fragment car ils n'ont pas un but fixe (c.-à-d. transformer des sommets ou écrire des couleurs dans une image). Contrairement aux shaders de fragments et de sommets, les shaders de calcul font très peu de choses en arrière-plan. Le code que vous écrivez est ce que le GPU exécute et c'est à peu près tout. Cela peut en faire un outil très utile pour décharger les calculs lourds au GPU.
ga: Is cineál speisialta clár scáthaithe é scáthaitheoir ríomhaireachta atá dírithe i dtreo cláir chuspóra ginearálta. Is é sin le rá, tá siad níos solúbtha ná scáthóirí vertex agus scáthóirí brúin toisc nach bhfuil cuspóir seasta acu (ie ceangail a athrú nó dathanna a scríobh go híomhá). Murab ionann agus scáthóirí brúin agus scáthóirí vertex, is beag atá ag dul ar aghaidh ag scáthóirí ríomhaireachta taobh thiar de na radhairc. Is é an cód a scríobhann tú an rud a ritheann an GPU agus is beag eile. Féadann sé seo uirlis an-úsáideach iad a dhéanamh chun ríomhanna troma a dhíluchtú chuig an GPU.
ja: コンピュートシェーダーは、汎用プログラミングを対象とした特別なタイプのシェーダープログラムです。言い換えればこれらは固定された目的 (頂点の変換や画像への色の書き込みなど) を持たないため、頂点シェーダーやフラグメントシェーダーよりも柔軟です。フラグメントシェーダーや頂点シェーダーとは異なり、コンピュートシェーダーは舞台裏でほとんど何も行われません。作成したコードはGPUが実行するものであり、それ以外ではほとんど実行されません。これは重い計算をGPUにオフロードするための非常に便利なツールになります。
ru: Сompute (Вычислительный) шейдер — это особый тип шейдерной программы, ориентированный на программирование общего назначения. Другими словами, они более гибкие, чем vertex и fragment шейдеры, поскольку у них нет фиксированной цели (например, преобразования вершин или записи цветов в изображение). В отличие от vertex и fragment шейдеров, вычислительные шейдеры практически не выполняют никаких внутренних операций. Графический процессор выполняет только написанный вами код, и практически ничего больше. Это делает их очень полезным инструментом для переноса тяжёлых вычислений на графический процессор.
ta: ஒரு கம்ப்யூட் சேடர் என்பது ஒரு சிறப்பு வகை சேடர் நிரலாகும், இது பொது நோக்கம் நிரலாக்கத்தை நோக்கியதாகும். வேறு வார்த்தைகளில் கூறுவதானால், அவை வெர்டெக்ச் சேடர்கள் மற்றும் துண்டு நிழல்களைக் காட்டிலும் மிகவும் நெகிழ்வானவை, ஏனெனில் அவை ஒரு நிலையான நோக்கம் இல்லை (அதாவது செங்குத்துகளை மாற்றுவது அல்லது வண்ணங்களை ஒரு படத்திற்கு எழுதுவது). துண்டு துண்டான சேடர்கள் மற்றும் வெர்டெக்ச் சேடர்களைப் போலன்றி, கம்ப்யூட் சேடர்கள் திரைக்குப் பின்னால் மிகக் குறைவாகவே உள்ளன. நீங்கள் எழுதும் குறியீடு சி.பீ.யூ இயங்குகிறது மற்றும் மிகக் குறைவு. இது சி.பீ.யுவுக்கு கனமான கணக்கீடுகளை ஏற்றுவதற்கு மிகவும் பயனுள்ள கருவியாக மாறும்.
uk: Обчислювальний шейдер — це особливий тип шейдерної програми, яка орієнтована на програмування загального призначення. Іншими словами, вони більш гнучкі, ніж вершинні шейдери та фрагментні шейдери, оскільки вони не мають фіксованої мети (тобто трансформації вершин або запису кольорів у зображення). На відміну від фрагментних і вершинних шейдерів, у обчислювальних шейдерах дуже мало відбувається за лаштунками. Код, який ви пишете, — це те, що виконує GPU, і зовсім небагато іншого. Це може зробити їх дуже корисним інструментом для перевантаження важких обчислень на GPU.
zh_cn: 计算着色器是一种着重于通用编程特殊的着色器。换句话说，它们相比于节点和片段着色器更加灵活，因为它们没有固定的用途（节点变换或图片着色）。不同于节点和片段着色器，计算着色器的幕后工作非常少。GPU 运行的代码就是你编写的代码，此外几乎没有其他内容。因此，计算着色器在将繁重计算转移到 GPU 上时非常有用。
zh_tw: 計算著色器是一種特殊類型的著色器程式，主要用於通用運算。換句話說，它比頂點著色器和片段著色器更有彈性，因為它沒有固定用途（例如轉換頂點或寫入顏色到影像）。不同於片段或頂點著色器，計算著色器的幕後運作極少。您寫的程式碼就是 GPU 執行的內容，沒有多餘處理。這讓它非常適合將大量運算交由 GPU 處理。

source: Now let's get started by creating a short compute shader.
ga: Anois tosaímid trí scáthóir ríomhaireachta gairid a chruthú.
ja: それでは、短いコンピュートシェーダーを作成することから始めましょう。
ru: Теперь приступим к созданию короткого compute шейдера.
ta: இப்போது ஒரு குறுகிய கம்ப்யூட் சேடரை உருவாக்குவதன் மூலம் தொடங்குவோம்.
uk: Тепер давайте почнемо зі створення короткого обчислювального шейдера.
zh_cn: 现在我们以一个简短的计算着色器入手。
zh_tw: 現在讓我們開始建立一個簡單的計算著色器。

source: First, in the **external** text editor of your choice, create a new file called ``compute_example.glsl`` in your project folder. When you write compute shaders in Godot, you write them in GLSL directly. The Godot shader language is based on GLSL. If you are familiar with normal shaders in Godot, the syntax below will look somewhat familiar.
fr: D'abord, dans l'éditeur de texte **externe** de votre choix, créez un nouveau fichier appelé ``compute_example.glsl`` dans votre dossier de projet. Lorsque vous écrivez des shaders de calcul dans Godot, vous les écrivez directement en GLSL. La langue des shaders de Godot est basée sur le GLSL. Si vous êtes familier avec les shaders normaux de Godot, la syntaxe ci-dessous sera quelque peu familière.
ga: Ar dtús, san eagarthóir téacs**seach** de do rogha féin, cruthaigh comhad nua darb ainm `compute_example.glsl`` i d'fhillteán tionscadail. Nuair a scríobhann tú scáthóirí ríomhaireachta i Godot, scríobhann tú iad i GLSL go díreach. Tá an teanga shader Godot bunaithe ar GLSL. Má tá tú eolach ar ghnáthscáthóirí i Godot, beidh cuma eolach ar an gcomhréir thíos.
ja: まず、任意の **外部** テキスト エディターで、プロジェクトフォルダに ``compute_example.glsl`` という新しいファイルを作成します。 Godotでコンピュートシェーダを記述する場合はGLSLで直接記述します。 Godotシェーダ言語はGLSLに基づいています。 Godotの通常のシェーダに慣れている場合は、以下の構文に見覚えがあるでしょう。
ru: Сначала во **внешнем** текстовом редакторе по вашему выбору создайте новый файл ``compute_example.glsl`` в папке вашего проекта. Вычислительные шейдеры в Godot пишутся непосредственно на GLSL. Язык шейдеров Godot основан на GLSL. Если вы знакомы с обычными шейдерами в Godot, синтаксис ниже покажется вам знакомым.
ta: முதலில், உங்கள் விருப்பத்தின் ** வெளிப்புற ** உரை திருத்தியில், உங்கள் திட்ட கோப்புறையில் `` compute_example.glsl` என்ற புதிய கோப்பை உருவாக்கவும். நீங்கள் கோடோட்டில் கம்ப்யூட் சேடர்களை எழுதும்போது, அவற்றை நேரடியாக சி.எல்.எச்.எல். கோடோட் சேடர் மொழி சி.எல்.எச்.எல். கோடோட்டில் சாதாரண சேடர்களை நீங்கள் அறிந்திருந்தால், கீழேயுள்ள தொடரியல் ஓரளவு பழக்கமாக இருக்கும்.
uk: Спочатку у **зовнішньому** текстовому редакторі за вашим вибором створіть новий файл під назвою ``compute_example.glsl`` у папці вашого проекту. Коли ви пишете обчислювальні шейдери в Godot, ви пишете їх безпосередньо в GLSL. Мова шейдерів Godot базується на GLSL. Якщо ви знайомі зі звичайними шейдерами в Godot, наведений нижче синтаксис здасться вам дещо знайомим.
zh_cn: 首先，用你选用的 **外部** 编辑器，在项目文件夹中创建一个命名为 ``compute_example.glsl`` 的新文件。Godot 的计算着色器直接使用 GLSL 代码。Godot 着色器语言基于 GLSL，如果你对 Godot 正常着色器熟悉，那么对以下语法也会比较熟悉。
zh_tw: 首先，請在您喜愛的**外部**文字編輯器中，在專案資料夾內建立一個名為 ``compute_example.glsl`` 的新檔案。在 Godot 中編寫計算著色器時，須直接撰寫 GLSL。Godot 的著色器語言是以 GLSL 為基礎。如果您熟悉 Godot 的一般著色器，下面的語法應該會很眼熟。

source: Compute shaders can only be used from RenderingDevice-based renderers (the Forward+ or Mobile renderer). To follow along with this tutorial, ensure that you are using the Forward+ or Mobile renderer. The setting for which is located in the top right-hand corner of the editor.
fr: Les shaders de calcul ne peuvent être utilisés que dans les moteurs de rendus basés sur RenderingDevice (Forward+ ou Mobile). Pour suivre ce tutoriel, assurez-vous que vous utilisez le moteur de rendu Forward+ ou Mobile. Le réglage pour le choisir est situé dans le coin supérieur droit de l'éditeur.
ga: Ní féidir scáthóirí ríomh a úsáid ach ó renderingDevice atá bunaithe ar RenderingDevice (an Renderer Forward+ nó Mobile). Chun leanúint in éineacht leis an rang teagaisc seo, déan cinnte go bhfuil an renderer Forward+nó Mobile á úsáid agat. Tá an suíomh a bhfuil suite i gcúinne ar dheis barr an eagarthóra.
ja: コンピュートシェーダーは、RenderingDeviceベースのレンダラー (Forward+ または Mobileレンダラー) からのみ使用できます。このチュートリアルを進めるには、Forward+ または Mobile レンダラーを使用していることを確認してください。この設定はエディターの右上隅にあります。
ru: Вычислительные шейдеры можно использовать только из рендереров на базе RenderingDevice (рендер Forward+ или Mobile). Для выполнения этого руководства убедитесь, что вы используете рендер Forward+ или Mobile. Настройки находятся в правом верхнем углу редактора.
ta: கம்ப்யூட் சேடர்களை வழங்குதல் டெவிச் அடிப்படையிலான ரெண்டரர்களிடமிருந்து (முன்னோக்கி+ அல்லது மொபைல் ரெண்டரர்) மட்டுமே பயன்படுத்த முடியும். இந்த டுடோரியலுடன் பின்தொடர, நீங்கள் முன்னோக்கி+ அல்லது மொபைல் ரெண்டரரைப் பயன்படுத்துகிறீர்கள் என்பதை உறுதிப்படுத்தவும். எடிட்டரின் மேல் வலது மூலையில் அமைந்துள்ள அமைப்பு.
uk: Обчислювальні шейдери можна використовувати лише з рендерів на основі RenderingDevice (Forward+ або Mobile renderer). Щоб дотримуватися цього підручника, переконайтеся, що ви використовуєте Forward+ або Mobile рендерер. Налаштування для якого розташовано у верхньому правому куті редактора.
zh_cn: 计算着色器只能在基于 RenderingDevice 的渲染器（Forward+ 或 Mobile）中使用。想要按照本教程操作的话，请确保你使用的是 Forward+ 或 Mobile 渲染器。相关设置位于编辑器的右上角。
zh_tw: 計算著色器僅能在基於 RenderingDevice 的算繪器（Forward+ 或 Mobile 算繪器）中使用。請確認您已設定為 Forward+ 或 Mobile 算繪器（可在編輯器右上角調整）才能依照本教學操作。

source: Note that compute shader support is generally poor on mobile devices (due to driver bugs), even if they are technically supported.
ga: Tabhair faoi deara go bhfuil an tacaíocht scáthaithe ríomh lag go ginearálta ar ghléasanna soghluaiste (mar gheall ar fhabhtanna tiománaithe), fiú má tá tacaíocht theicniúil acu.
ja: モバイルデバイスのコンピュートシェーダーのサポートは、技術的にサポートされている場合でも(ドライバーのバグなどのため)不十分であることに注意してください。
ru: Обратите внимание, что поддержка вычислительных шейдеров на мобильных устройствах, как правило, плохая (из-за ошибок драйверов), даже если они технически поддерживаются.
ta: கணக்கீட்டு சேடர் உதவி பொதுவாக மொபைல் சாதனங்களில் (இயக்கி பிழைகள் காரணமாக) அவை தொழில்நுட்ப ரீதியாக ஆதரிக்கப்பட்டாலும் மோசமாக இருக்கும் என்பதை நினைவில் கொள்க.
uk: Зауважте, що підтримка обчислювальних шейдерів зазвичай погана на мобільних пристроях (через помилки драйверів), навіть якщо вони технічно підтримуються.
zh_cn: 请注意，虽然理论上移动设备支持计算着色器，但（由于驱动器问题）这一支持通常较差。
zh_tw: 請注意，即使行動裝置在技術上支援計算著色器，實際支援度通常很差（多因驅動程式問題）。

source: Let's take a look at this compute shader code:
fr: Jetons un coup d'œil à ce code de calcul de shader :
ga: Breathnaímid ar an gcód scáthaithe ríomhaireachta seo:
ja: このコンピュートシェーダーのコードを見てみましょう。
ru: Давайте посмотрим на этот код вычислительного шейдера:
ta: இந்த கம்ப்யூட் சேடர் குறியீட்டைப் பார்ப்போம்:
uk: Погляньмо на цей код обчислювального шейдера:
zh_cn: 我们把它调成蓝色：
zh_tw: 來看看這個計算著色器的範例程式碼：

source: This code takes an array of floats, multiplies each element by 2 and store the results back in the buffer array. Now let's look at it line-by-line.
ga: Tógann an cód seo sraith snámha, iolraíonn sé gach eilimint le 2 agus stóráil na torthaí ar ais san eagar maoláin. Anois déanaimis féachaint air líne ar líne.
ja: このコードはfloatの配列を取得して、各要素を2で乗算し、結果をバッファ配列に格納します。では一行ずつ見てみましょう。
ru: Этот код принимает массив чисел с плавающей точкой, умножает каждый элемент на 2 и сохраняет результат обратно в массив буфера. Теперь давайте рассмотрим его построчно.
ta: இந்த குறியீடு மிதவைகளின் வரிசையை எடுத்து, ஒவ்வொரு உறுப்புகளையும் 2 ஆல் பெருக்கி முடிவுகளை இடையக வரிசையில் சேமிக்கிறது. இப்போது அதைப் பார்ப்போம்.
uk: Цей код приймає масив чисел з плаваючою точкою, множить кожен елемент на 2 і зберігає результати назад у буферному масиві. Тепер давайте розглянемо це рядок за рядком.
zh_cn: 这段代码接受一个 float 数组，将其中的每个元素和 2 相乘，并将结果存储回数组中。现在，我们来逐行观察这段代码。
zh_tw: 這段程式碼會將一個浮點陣列的每個元素都乘以 2，然後把結果存回緩衝區陣列。現在讓我們逐行說明。

source: These two lines communicate two things:
fr: Ces deux lignes communiquent deux choses :
ga: Cuireann an dá líne seo dhá rud in iúl:
ja: この2行は、次の2つのことを意味します。
ru: Эти две строки сообщают две вещи:
ta: இந்த இரண்டு வரிகளும் இரண்டு விசயங்களை தொடர்பு கொள்கின்றன:
uk: Ці два рядки повідомляють про дві речі:
zh_cn: 这两行文本传达了以下的两件事：
zh_tw: 這兩行代表了兩個重點：

source: The following code is a compute shader. This is a Godot-specific hint that is needed for the editor to properly import the shader file.
ga: Is scáthóir ríomhaireachta é an cód seo a leanas. Is leid Godot-shonrach é seo atá ag teastáil don eagarthóir an comhad shader a iompórtáil i gceart.
ja: このコードはコンピュートシェーダーです。これはエディタがシェーダーファイルを適切にインポートするために必要なGodot固有のヒントです。
ru: Следующий код представляет собой вычислительный шейдер. Это специфическая подсказка Godot, необходимая редактору для корректного импорта файла шейдера.
ta: பின்வரும் குறியீடு ஒரு கம்ப்யூட் சேடர். இது ஒரு கோடோட்-குறிப்பிட்ட குறிப்பாகும், இது எடிட்டருக்கு சேடர் கோப்பை சரியாக இறக்குமதி செய்ய வேண்டும்.
uk: Наступний код є обчислювальним шейдером. Це підказка щодо Godot, яка потрібна редактору для правильного імпорту файлу шейдера.
zh_cn: 如下的代码为计算着色器。这是 Godot 特有的提示文本，编辑器需要此文本才能正确导入着色器文件。
zh_tw: 下列程式碼是一個計算著色器。這是 Godot 專用的提示，讓編輯器能正確匯入該著色器檔案。

source: The code is using GLSL version 450.
ga: Tá an cód ag baint úsáide as leagan GLSL 450.
ja: このコードはGLSLバージョン450を使用しています。
ru: Код использует GLSL версии 450.
ta: குறியீடு GLSL பதிப்பு 450 ஐப் பயன்படுத்துகிறது.
uk: Код використовує GLSL версії 450.
zh_cn: 代码使用的是 GLSL 450。
zh_tw: 這段程式碼採用 GLSL 版本 450。

source: You should never have to change these two lines for your custom compute shaders.
fr: Vous ne devriez jamais avoir à changer ces deux lignes pour vos shaders de calcul personnalisées.
ga: Níor cheart go mbeadh ort an dá líne seo a athrú le haghaidh do scáthaitheoirí ríomhaire saincheaptha.
ja: コンピュートシェーダーをカスタムする場合も、この2 行を変更する必要はありません。
ru: Вам никогда не придется менять эти две строки для ваших пользовательских вычислительных шейдеров.
ta: உங்கள் தனிப்பயன் கம்ப்யூட் சேடர்களுக்கு இந்த இரண்டு வரிகளையும் நீங்கள் ஒருபோதும் மாற்ற வேண்டியதில்லை.
uk: Вам ніколи не доведеться змінювати ці два рядки для ваших власних обчислювальних шейдерів.
zh_cn: 在编写计算着色器时，你应当永远以这两行作为文件的开头。
zh_tw: 自訂計算著色器時，這兩行一般都不必修改。

source: Next, we communicate the number of invocations to be used in each workgroup. Invocations are instances of the shader that are running within the same workgroup. When we launch a compute shader from the CPU, we tell it how many workgroups to run. Workgroups run in parallel to each other. While running one workgroup, you cannot access information in another workgroup. However, invocations in the same workgroup can have some limited access to other invocations.
ga: Ansin, cuirimid in iúl líon na n-ainmnithe atá le húsáid i ngach grúpa oibre. Is cásanna den scáthóir iad inghairmithe atá ag rith laistigh den ghrúpa oibre céanna. Nuair a sheolann muid scáthóir ríomhaireachta ón LAP, insímid dó cé mhéad grúpa oibre atá le reáchtáil. Ritheann grúpaí oibre comhthreomhar lena chéile. Agus grúpa oibre amháin á reáchtáil agat, ní féidir leat faisnéis a rochtain i ngrúpa oibre eile Mar sin féin, is féidir rochtain theoranta a bheith ag inghairmithe sa ghrúpa oibre céanna ar inghrúpaí eile.
ja: 次に各ワークグループで使用される実行インスタンスの数を伝えます。実行インスタンスは同じワークグループ内で実行されるシェーダーのインスタンスです。CPUからコンピュートシェーダーを起動するとき、実行するワークグループの数を指示します。複数のワークグループは相互に並列実行されます。1つのワークグループの実行中は、別のワークグループの情報にアクセスできません。しかし同じワークグループ内では、他の実行インスタンスへのアクセスが制限される場合があります。
ru: Затем мы сообщаем количество вызовов, которые будут использоваться в каждой рабочей группе. Вызовы — это экземпляры шейдера, работающие в одной рабочей группе. При запуске вычислительного шейдера из CPU мы сообщаем ему, сколько рабочих групп нужно запустить. Рабочие группы работают параллельно друг другу. При запуске одной рабочей группы доступ к информации в другой рабочей группе невозможен. Однако вызовы в одной рабочей группе могут иметь ограниченный доступ к другим вызовам.
ta: அடுத்து, ஒவ்வொரு பணிக்குழுவிலும் பயன்படுத்தப்பட வேண்டிய அழைப்புகளின் எண்ணிக்கையை நாங்கள் தொடர்பு கொள்கிறோம். அழைப்புகள் ஒரே பணிக்குழுவிற்குள் இயங்கும் சேடரின் நிகழ்வுகள். சிபியு இலிருந்து ஒரு கம்ப்யூட் சேடரை நாங்கள் தொடங்கும்போது, எத்தனை பணிக்குழுக்களை இயக்க வேண்டும் என்று நாங்கள் சொல்கிறோம். பணிக்குழுக்கள் ஒருவருக்கொருவர் இணையாக இயங்குகின்றன. ஒரு பணிக்குழுவை இயக்கும் போது, மற்றொரு பணிக்குழுவில் தகவல்களை அணுக முடியாது. இருப்பினும், அதே பணிக்குழுவில் உள்ள அழைப்புகள் மற்ற அழைப்புகளுக்கு சில வரையறுக்கப்பட்ட அணுகலைக் கொண்டிருக்கலாம்.
uk: Далі ми повідомляємо кількість викликів, які будуть використовуватися в кожній робочій групі. Виклики — це екземпляри шейдера, які виконуються в одній робочій групі. Коли ми запускаємо обчислювальний шейдер із ЦП, ми повідомляємо йому, скільки робочих груп потрібно запустити. Робочі групи працюють паралельно одна одній. Під час роботи однієї робочої групи ви не можете отримати доступ до інформації в іншій робочій групі. Однак виклики в одній робочій групі можуть мати обмежений доступ до інших викликів.
zh_cn: 接下来我们要传达每个工作组所使用的调用次数。“调用”指的是同一个工作组中运行的着色器实例。从 CPU 启动计算着色器时，我们会告诉它需要运行多少个工作组。工作组之间是并行执行的。运行时，一个工作组无法访问另一个工作组中的信息。不过同一个工作组中的不同调用可以相互进行有限的访问。
zh_tw: 接下來，我們要定義每個工作群組內的呼叫（invocation）數量。呼叫代表在同一工作群組中執行的著色器實例。當我們從 CPU 啟動計算著色器時，需要指定要執行多少個工作群組。各個工作群組之間是平行運作的，彼此無法互相存取資料；但同一群組內的呼叫彼此之間則有部分有限的存取權。

source: Think about workgroups and invocations as a giant nested ``for`` loop.
ga: Smaoinigh ar ghrúpaí oibre agus ar inghrúpaí mar lúb ollmhór neadaithe `for ``.
ja: ワークグループと実行インスタンスを、このように入れ子になった巨大な ``for`` ループとして考えてください。
ru: Подумайте о рабочих группах и вызовах как о гигантском вложенном цикле ``for``.
ta: பணிக்குழுக்கள் மற்றும் அழைப்புகளைப் பற்றி ஒரு மாபெரும் உள்ளமைக்கப்பட்ட ``` வளையத்திற்கு சிந்தியுங்கள்.
uk: Подумайте про робочі групи та виклики як про гігантський вкладений цикл ``for``.
zh_cn: 你可以将工作组和调用想象成巨型的嵌套 ``for`` 循环。
zh_tw: 可以把工作群組和呼叫想像成一個巨大的巢狀 ``for`` 迴圈。

source: Workgroups and invocations are an advanced topic. For now, remember that we will be running two invocations per workgroup.
ga: Is ábhar chun cinn iad grúpaí oibre agus inghrúpaí. Go dtí seo, cuimhnigh go mbeidh dhá inghairm á reáchtáil againn in aghaidh an ghrúpa oibre.
ja: ワークグループと実行インスタンスは高度なトピックです。現時点ではワークグループごとに2つの実行インスタンスを実行することに注意してください。
ru: Рабочие группы и вызовы — это сложная тема. Пока что запомните, что мы будем выполнять два вызова на каждую рабочую группу.
ta: பணிக்குழுக்கள் மற்றும் அழைப்புகள் ஒரு மேம்பட்ட தலைப்பு. இப்போதைக்கு, நாங்கள் ஒரு பணிக்குழுவுக்கு இரண்டு அழைப்புகளை இயக்குவோம் என்பதை நினைவில் கொள்ளுங்கள்.
uk: Робочі групи та виклики — це розширена тема. Наразі пам’ятайте, що ми будемо виконувати два виклики для кожної робочої групи.
zh_cn: 工作组与调用属于高阶内容。目前请需要记住我们在每个工作组中运行了两个调用。
zh_tw: 工作群組與呼叫屬於進階主題。現在只需記得：我們將在每個工作群組中執行 2 次呼叫。

source: Here we provide information about the memory that the compute shader will have access to. The ``layout`` property allows us to tell the shader where to look for the buffer, we will need to match these ``set`` and ``binding`` positions from the CPU side later.
ga: Anseo soláthraímid faisnéis faoin gcuimhne a mbeidh rochtain ag an scáthóir ríomhaireachta air. Ligeann an maoin ``leagan ``dúinn a insint don scáthóir cá háit is féidir leis an maolán a lorg, beidh orainn na suíomhanna ``taca` agus ``ceangla`` seo a mheaitseáil ó thaobh an LAP níos déanaí.
ja: ここではコンピュート シェーダーがアクセスできるメモリに関する情報を提供します。 ``layout`` プロパティを使用すると、シェーダーにバッファの参照する場所を指示できます。後でCPU側から ``set`` と ``binding`` の位置を一致させる必要があります。
ru: Здесь мы предоставляем информацию о памяти, к которой будет иметь доступ вычислительный шейдер. Свойство ``layout`` позволяет указать шейдеру, где искать буфер. Позже нам потребуется сопоставить эти позиции ``set`` и ``binding`` со стороны ЦП.
ta: கம்ப்யூட் சேடருக்கு அணுகக்கூடிய நினைவகம் பற்றிய தகவல்களை இங்கே வழங்குகிறோம். `` லேஅவுட்`` சொத்து, இடையகத்தை எங்கு தேடுவது என்று சேடரிடம் சொல்ல அனுமதிக்கிறது, இந்த `` செட்`` மற்றும் `` பிணைப்பு`` நிலைகளை பின்னர் சிபியு பக்கத்திலிருந்து பொருத்த வேண்டும்.
uk: Тут ми надаємо інформацію про пам’ять, до якої матиме доступ обчислювальний шейдер. Властивість ``layout`` дозволяє нам вказати шейдеру, де шукати буфер, пізніше нам потрібно буде зіставити ці позиції ``set`` і ``binding`` з боку ЦП.
zh_cn: 这里我们提供的是与计算着色器所能访问的内存相关的信息。我们可以通过 ``layout`` 属性告诉着色器去哪里寻找缓冲，稍后我们需要在 CPU 一侧匹配这些 ``set`` 和 ``binding`` 的位置。
zh_tw: 這裡我們說明計算著色器可存取的記憶體資訊。 ``layout`` 屬性讓我們指定著色器要從哪個緩衝區讀寫，稍後在 CPU 端也要以相同的 ``set``、``binding`` 位置對應。
