Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/compute_shaders.po
Languages: fr, ga, ja, ru, ta, uk, zh_cn, zh_tw

source: The ``restrict`` keyword tells the shader that this buffer is only going to be accessed from one place in this shader. In other words, we won't bind this buffer in another ``set`` or ``binding`` index. This is important as it allows the shader compiler to optimize the shader code. Always use ``restrict`` when you can.
ga: Insíonn an eochairfhocal `sriant`` don scáthóir nach mbeidh rochtain ar an maolán seo ach ó áit amháin sa scáthóir seo. Is é sin le rá, ní cheanglófaimid an maolán seo in innéacs ``taca`` nó ``ceangla`` eile. Tá sé seo tábhachtach toisc go gceadaíonn sé don thiomsaitheoir shader an cód shader a bharrfheabhsú. Úsáid “srian” i gcónaí nuair is féidir leat.
ja: ``restrict`` キーワードは、このバッファがこのシェーダ内の1つの場所からのみアクセスされることをシェーダに伝えます。言い換えれば、このバッファを別の ``set`` または ``binding`` インデックスにバインドしません。これはシェーダーコンパイラがシェーダーコードを最適化できるようにするために重要です。可能な場合は常に ``restrict`` を使用してください。
ru: Ключевое слово ``restrict`` сообщает шейдеру, что к этому буферу можно будет получить доступ только из одного места в шейдере. Другими словами, мы не будем привязывать этот буфер к другому индексу ``set`` или ``binding``. Это важно, поскольку позволяет компилятору шейдера оптимизировать код шейдера. Всегда используйте ``restrict``, когда это возможно.
ta: இந்த சேடரில் ஒரு இடத்திலிருந்து மட்டுமே இந்த இடையகம் அணுகப் போகிறது என்று `` கட்டுப்பாடு`` முக்கிய சொல் சேடரிடம் கூறுகிறது. வேறு வார்த்தைகளில் கூறுவதானால், இந்த இடையகத்தை மற்றொரு `` set`` அல்லது `` பிணைப்பு`` குறியீட்டில் பிணைக்க மாட்டோம். சேடர் குறியீட்டை மேம்படுத்த சேடர் கம்பைலரை அனுமதிப்பதால் இது முக்கியமானது. உங்களால் முடிந்தவரை எப்போதும் `` கட்டுப்படுத்தவும்` ஐப் பயன்படுத்தவும்.
uk: Ключове слово ``restrict`` повідомляє шейдеру, що доступ до цього буфера буде доступний лише з одного місця цього шейдера. Іншими словами, ми не будемо прив’язувати цей буфер до іншого індексу ``set`` або ``binding``. Це важливо, оскільки дозволяє компілятору шейдерів оптимізувати код шейдера. Завжди використовуйте ``restrict``, коли це можливо.
zh_cn: 关键字 ``restrict`` 能够告诉着色器该缓冲只会在这个着色器中的某个单一位置进行访问。换句话说，我们不会将该缓冲绑定到其他 ``set`` 或 ``binding`` 索引。这一点非常重要，着色器编译器就能够借此对着色器代码进行优化。能使用 ``restrict`` 时请一定要使用。
zh_tw: ``restrict`` 關鍵字用來告知著色器這個緩衝區只會在這個著色器的單一地方存取。換句話說，不會在別的 ``set`` 或 ``binding`` 索引中再次綁定這個緩衝區。這有助於著色器編譯器最佳化程式碼。只要能用 ``restrict``，就盡量使用。

source: This is an *unsized* buffer, which means it can be any size. So we need to be careful not to read from an index larger than the size of the buffer.
ga: Is maolán* gan méid é seo, rud a chiallaíonn gur féidir leis a bheith ar aon mhéid. Mar sin ní mór dúinn a bheith cúramach gan léamh ó innéacs níos mó ná méid an maoláin.
ja: また、これは *サイズなし* バッファです。つまり任意のサイズにすることができます。したがってバッファのサイズより大きなインデックスから読み取らないように注意する必要があります。
ru: Это буфер *неопределённого размера*, то есть он может быть любого размера. Поэтому нужно быть осторожным, чтобы не читать данные из индекса, размер которого превышает размер буфера.
ta: இது ஒரு * அளவிடப்படாத * இடையகமாகும், அதாவது இது எந்த அளவிலும் இருக்கலாம். எனவே இடையகத்தின் அளவை விட பெரிய குறியீட்டிலிருந்து படிக்காமல் கவனமாக இருக்க வேண்டும்.
uk: Це *нерозмірний* буфер, що означає, що він може бути будь-якого розміру. Тому нам потрібно бути обережними, щоб не читати з індексу, який перевищує розмір буфера.
zh_cn: 这是一个\ *未指明大小*\ 的缓冲，也就是说可以是任意大小。因此我们需要注意不要让用来读取的索引超过缓冲的大小。
zh_tw: 這是一個*未定大小*的緩衝區，也就是說它可以是任意長度。所以必須小心不要存取超過緩衝區大小的索引。

source: Finally, we write the ``main`` function which is where all the logic happens. We access a position in the storage buffer using the ``gl_GlobalInvocationID`` built-in variables. ``gl_GlobalInvocationID`` gives you the global unique ID for the current invocation.
ru: Наконец, мы пишем функцию ``main``, в которой реализуется вся логика. Мы получаем доступ к позиции в буфере хранения, используя встроенные переменные ``gl_GlobalInvocationID``. ``gl_GlobalInvocationID`` возвращает глобальный уникальный идентификатор текущего вызова.
uk: Нарешті, ми пишемо функцію ``main``, у якій і відбувається вся логіка. Ми отримуємо доступ до позиції в буфері зберігання за допомогою вбудованих змінних ``gl_GlobalInvocationID``. ``gl_GlobalInvocationID`` дає глобальний унікальний ідентифікатор для поточного виклику.
zh_tw: 最後，我們撰寫 ``main`` 函式，所有邏輯都在這裡執行。可利用內建變數 ``gl_GlobalInvocationID`` 存取儲存緩衝區的指定位置。``gl_GlobalInvocationID`` 會提供目前呼叫的全域唯一 ID。

source: To continue, write the code above into your newly created ``compute_example.glsl`` file.
ga: Chun leanúint ar aghaidh, scríobh an cód thuas isteach i do chomhad nua-chruthaithe ``compute_example.glsl``.
ja: 続けるには、新しく作成した ``compute_example.glsl`` ファイルに上記のコードを書き込みます。
ru: Чтобы продолжить, впишите код выше в только что созданный файл ``compute_example.glsl``.
ta: தொடர, மேலே உள்ள குறியீட்டை நீங்கள் புதிதாக உருவாக்கிய `` compute_example.glsl`` கோப்பில் எழுதுங்கள்.
uk: Щоб продовжити, запишіть наведений вище код у щойно створений файл ``compute_example.glsl``.
zh_tw: 接下來，請將上述程式碼寫入你剛剛建立的 ``compute_example.glsl`` 檔案中。

source: Create a local RenderingDevice
ga: Cruthaigh Gléas RenderingDevice áitiúil
ja: ローカルの RenderingDevice を作成する
ru: Создайте локальное RenderingDevice
ta: உள்ளக வழங்குதல் டெவிசை உருவாக்கவும்
uk: Створіть локальний RenderingDevice
zh_cn: 创建局部 RenderingDevice
zh_tw: 建立本地 RenderingDevice

source: To interact with and execute a compute shader, we need a script. Create a new script in the language of your choice and attach it to any Node in your scene.
ga: Chun idirghníomhú le scáthóir ríomhaireachta agus a fhorghníomhú, teastaíonn script uainn. Cruthaigh script nua sa teanga de do rogha féin agus ceangail é le haon Nód i do radharc.
ja: コンピュートシェーダーと対話して実行するにはスクリプトが必要です。好きな言語で新しいスクリプトを作成しシーン内の任意のノードにアタッチします。
ru: Для взаимодействия с вычислительным шейдером и его выполнения нам понадобится скрипт. Создайте новый скрипт на выбранном вами языке и прикрепите его к любому Узлу в вашей сцене.
ta: ஒரு கம்ப்யூட் சேடருடன் தொடர்பு கொள்ளவும் செயல்படுத்தவும், எங்களுக்கு ஒரு ச்கிரிப்ட் தேவை. உங்களுக்கு விருப்பமான மொழியில் ஒரு புதிய ச்கிரிப்டை உருவாக்கி, அதை உங்கள் காட்சியில் உள்ள எந்த முனையிலும் இணைக்கவும்.
uk: Щоб взаємодіяти з обчислювальним шейдером і виконувати його, нам потрібен сценарій. Створіть новий сценарій вибраною вами мовою та прикріпіть його до будь-якого вузла вашої сцени.
zh_tw: 為了操作並執行計算著色器，我們需要寫一份腳本。請用你慣用的語言新增一支腳本，並掛載到場景裡任一個節點。

source: Now to execute our shader we need a local :ref:`class_RenderingDevice` which can be created using the :ref:`class_RenderingServer`:
ga: Anois chun ár scáthóir a fhorghníomhú teastaíonn áitiúil: ref: `Class_RenderingDevice` is féidir a chruthú ag baint úsáide as an:ref: `Class_RenderingServer`:
ja: ここでコンピュートシェーダーを実行するには、:ref:`class_RenderingServer` を使用して作成できるローカルの :ref:`class_RenderingDevice` が必要です。
ru: Теперь для выполнения нашего шейдера нам нужен локальный :ref:`class_RenderingDevice`, который можно создать с помощью :ref:`class_RenderingServer`:
ta: இப்போது எங்கள் சேடரை இயக்க எங்களுக்கு ஒரு உள்ளக தேவை: ref: `class_renderingdevice` ஐப் பயன்படுத்தி உருவாக்கலாம்: ref:` class_renderingserver`:
uk: Тепер для виконання нашого шейдера нам потрібен локальний :ref:`class_RenderingDevice`, який можна створити за допомогою :ref:`class_RenderingServer`:
zh_tw: 現在要執行剛剛的著色器，必須建立一個本地 :ref:`class_RenderingDevice`，可以透過 :ref:`class_RenderingServer` 來產生：

source: After that, we can load the newly created shader file ``compute_example.glsl`` and create a precompiled version of it using this:
ga: Ina dhiaidh sin, is féidir linn an comhad scáthaithe nua-chruthaithe ``compute_example.glsl`` a luchtú agus leagan réamhthiomsaithe de a chruthú ag baint úsáide as seo:
ja: その後、新しく作成したシェーダーファイル ``compute_example.glsl`` をロードし、これを使用してプリコンパイル済みのシェーダー(SPIR-V)を作成できます。
ru: После этого мы можем загрузить недавно созданный файл шейдера ``compute_example.glsl`` и создать его предварительно скомпилированную версию, используя следующее:
ta: அதன்பிறகு, புதிதாக உருவாக்கப்பட்ட சேடர் கோப்பை `` compute_example.glsl`` ஏற்றி, இதைப் பயன்படுத்தி அதன் முன் தொகுக்கப்பட்ட பதிப்பை உருவாக்கலாம்:
uk: Після цього ми можемо завантажити щойно створений файл шейдера ``compute_example.glsl`` і створити його попередньо скомпільовану версію за допомогою цього:
zh_tw: 完成後，可以載入新建立的著色器檔案 ``compute_example.glsl``，並依下列方式建立它的預編譯版本：

source: Local RenderingDevices cannot be debugged using tools such as `RenderDoc <https://renderdoc.org/>`__.
ga: Ní féidir Gléasanna Rindreála Áitiúla a dhífhabhtú trí úsáid a bhaint as uirlisí ar nós `RenderDoc <https://renderdoc.org/>`__.
ja: ローカルのRenderingDeviceは、`RenderDoc <https://renderdoc.org/>`__ などのツールを使用してデバッグすることができません。
ru: Локальные RenderingDevices невозможно отладить с помощью таких инструментов, как `RenderDoc <https://renderdoc.org/>`__.
ta: `ரெண்டர் டெக் <https://renderdoc.org/> __ __ போன்ற கருவிகளைப் பயன்படுத்தி உள்ளக வழங்குதல் டெவிசசை பிழைத்திருத்த முடியாது.
uk: Локальні RenderingDevices не можна налагодити за допомогою таких інструментів, як `RenderDoc <https://renderdoc.org/>`__.
zh_tw: 本地 RenderingDevice 無法用如 `RenderDoc <https://renderdoc.org/>`__ 等工具偵錯。

source: Provide input data
fr: Procure des entrées de données
ga: Sonraí ionchuir a sholáthar
ja: 入力データを指定する
ru: Предоставьте входные данные
ta: உள்ளீட்டுத் தரவை வழங்கவும்
uk: Надайте вхідні дані
zh_cn: 提供输入数据
zh_tw: 提供輸入資料

source: As you might remember, we want to pass an input array to our shader, multiply each element by 2 and get the results.
ga: Mar is cuimhin leat, ba mhaith linn sraith ionchuir a chur chuig ár scáthóir, gach eilimint a iolrú faoi 2 agus na torthaí a fháil.
ja: 念のためやることを確認すると、入力する配列をシェーダーに渡し各要素を2で乗算して結果を取得したいと考えています。
ru: Как вы, возможно, помните, мы хотим передать входной массив в наш шейдер, умножить каждый элемент на 2 и получить результат.
ta: நீங்கள் நினைவில் வைத்தபடி, எங்கள் சேடருக்கு ஒரு உள்ளீட்டு வரிசையை அனுப்ப விரும்புகிறோம், ஒவ்வொரு உறுப்புகளையும் 2 ஆல் பெருக்கி முடிவுகளைப் பெறவும்.
uk: Як ви пам’ятаєте, ми хочемо передати вхідний масив у наш шейдер, помножити кожен елемент на 2 і отримати результати.
zh_cn: 你可能还记得，我们想将一个输入数组传递给着色器，将每个元素乘以 2 然后获取结果。
zh_tw: 如前所述，我們希望將一個陣列作為輸入，讓著色器把每個元素乘以 2，取得運算結果。

source: We need to create a buffer to pass values to a compute shader. We are dealing with an array of floats, so we will use a storage buffer for this example. A storage buffer takes an array of bytes and allows the CPU to transfer data to and from the GPU.
ga: Ní mór dúinn maolán a chruthú chun luachanna a chur chuig scáthóir ríomh. Táimid ag déileáil le raon snámha, mar sin úsáidfimid maolán stórála don sampla seo. Tógann maolán stórála sraith béite agus tugann sé deis don LAP sonraí a aistriú chuig agus uaidh an GPU.
ja: コンピュートシェーダーに値を渡すためのバッファーを作成する必要があります。 この例ではfloatの配列を扱っているためストレージバッファを使用します。ストレージバッファはバイト配列を受け取り、CPUとGPUの間でデータを転送できるようにします。
ru: Нам нужно создать буфер для передачи значений в вычислительный шейдер. Мы работаем с массивом чисел с плавающей точкой, поэтому в этом примере мы будем использовать буфер хранения. Буфер хранения принимает массив байтов и позволяет центральному процессору передавать данные в графический процессор и обратно.
ta: மதிப்புகளை ஒரு கம்ப்யூட் சேடருக்கு அனுப்ப ஒரு இடையகத்தை உருவாக்க வேண்டும். மிதவைகளின் வரிசையை நாங்கள் கையாள்கிறோம், எனவே இந்த எடுத்துக்காட்டுக்கு சேமிப்பக இடையகத்தைப் பயன்படுத்துவோம். ஒரு சேமிப்பக இடையக பைட்டுகளின் வரிசையை எடுத்து, சிபியு ஐ GPU க்கு மற்றும் இருந்து தரவை மாற்ற அனுமதிக்கிறது.
uk: Нам потрібно створити буфер для передачі значень у обчислювальний шейдер. Ми маємо справу з масивом float, тому для цього прикладу будемо використовувати буфер зберігання. Буфер зберігання займає масив байтів і дозволяє центральному процесору передавати дані в і з графічного процесора.
zh_cn: 我们需要创建一个缓冲区来将值传递给计算着色器。我们处理的是一个浮点数数组，所以在这个示例中我们将使用存储缓冲区。存储缓冲区接收一个字节数组，能够在 CPU 与 GPU 之间进行数据传输。
zh_tw: 我們需要建立一個緩衝區，把資料傳給計算著色器。這裡我們要處理的是浮點數陣列，因此會使用儲存緩衝區（storage buffer）。儲存緩衝區允許 CPU 與 GPU 間以位元組陣列方式傳輸資料。

source: So let's initialize an array of floats and create a storage buffer:
ga: Mar sin déanaimis sraith snámha a thionscnamh agus cruthaímid maolán stórála:
ja: それではfloatの配列を初期化し、ストレージ バッファを作成しましょう:
ru: Итак, давайте инициализируем массив чисел с плавающей точкой и создадим буфер хранения:
ta: எனவே மிதவைகளின் வரிசையைத் துவக்கி, சேமிப்பக இடையகத்தை உருவாக்குவோம்:
uk: Тож давайте ініціалізуємо масив із плаваючими числами та створимо буфер зберігання:
zh_cn: 让我们初始化一个浮点数数组并创建一个存储缓冲区：
zh_tw: 現在我們來初始化一個浮點數陣列並建立對應的儲存緩衝區：

source: With the buffer in place we need to tell the rendering device to use this buffer. To do that we will need to create a uniform (like in normal shaders) and assign it to a uniform set which we can pass to our shader later.
ga: Agus an maolán i bhfeidhm ní mór dúinn a rá don ghléas rindreála an maolán seo a úsáid. Chun é sin a dhéanamh beidh orainn aonfhoirm a chruthú (cosúil le gnáthscáthóirí) agus é a shannadh do shraith aonfhoirmeach ar féidir linn a chur chuig ár scáthóir níos déanaí.
ja: バッファを配置したら、このバッファを使用するようにRenderingDeviceに指示する必要があります。これを行うには(通常のシェーダーと同様に) Uniformを作成し、それをUniformSetに割り当てる必要があります。これを後でシェーダーに渡します。
ru: После того, как буфер готов, нам нужно указать устройству рендеринга использовать его. Для этого нам потребуется создать uniform (как в обычных шейдерах) и назначить его набору uniform, который мы позже передадим в наш шейдер.
ta: இடையகத்துடன் இந்த இடையகத்தைப் பயன்படுத்த வழங்குதல் சாதனத்தை நாம் சொல்ல வேண்டும். அதைச் செய்ய நாம் ஒரு சீருடையை உருவாக்க வேண்டும் (சாதாரண சேடர்களைப் போல) அதை ஒரு சீரான தொகுப்பிற்கு ஒதுக்க வேண்டும், அதை பின்னர் நம் சேடருக்கு அனுப்ப முடியும்.
uk: З буфером на місці нам потрібно сказати пристрою рендерингу використовувати цей буфер. Для цього нам потрібно буде створити уніформу (як у звичайних шейдерах) і призначити її набору уніформ, який ми можемо передати нашому шейдеру пізніше.
zh_cn: 有了缓冲区后，我们需要让渲染设备来使用这个缓冲区。为此，我们需要创建一个 uniform（和普通着色器中一样）并将其分配给一个 uniform 集，稍后我们可以将其传递给着色器。
zh_tw: 緩衝區準備就緒後，還需告知算繪裝置使用這個緩衝區。為此我們要建立一個 uniform（就像在一般著色器裡做的），再把它加入 uniform set，之後就能傳遞給著色器。

source: Defining a compute pipeline
fr: Définir une pipeline de calcul
ga: Píblíne ríomhaireachta a shainiú
ja: コンピュートパイプラインの定義
ru: Определение вычислительного pipeline
ta: ஒரு கம்ப்யூட் பைப்லைனை வரையறுத்தல்
uk: Визначення обчислювального конвеєра
zh_cn: 定义计算管线
zh_tw: 定義計算管線

source: The next step is to create a set of instructions our GPU can execute. We need a pipeline and a compute list for that.
ga: Is é an chéad chéim eile ná sraith treoracha a chruthú is féidir lenár GPU a fhorghníomhú. Teastaíonn píblíne agus liosta ríomhaireachta uainn chuige sin.
ja: 次のステップは、GPUが実行できる一連の命令を作成することです。そのためにはパイプラインとコンピュートリストが必要です。
ru: Следующий шаг — создание набора инструкций, которые может выполнить наш графический процессор. Для этого нам понадобится конвейер и список вычислений.
ta: அடுத்த கட்டம் எங்கள் சி.பீ.யூ செயல்படுத்தக்கூடிய வழிமுறைகளின் தொகுப்பை உருவாக்குவது. அதற்காக எங்களுக்கு ஒரு குழாய் மற்றும் ஒரு கம்ப்யூட் பட்டியல் தேவை.
uk: Наступним кроком є створення набору інструкцій, які може виконувати наш графічний процесор. Для цього нам потрібен конвеєр і список обчислень.
zh_cn: 下一步需要创建一套 GPU 可以运行的指令。为此我们需要一个管线和一个计算列表。
zh_tw: 下一步，要建立一組 GPU 能執行的指令。我們需要準備一個管線（pipeline）及一個計算清單（compute list）。

source: The steps we need to do to compute our result are:
ga: Is iad na céimeanna a chaithfimid a dhéanamh chun ár dtoradh a ríomh ná:
ja: コンピュートシェーダーで結果を得るために必要な手順は次のとおりです:
ru: Шаги, которые нам необходимо выполнить для вычисления результата:
ta: எங்கள் முடிவைக் கணக்கிட நாம் செய்ய வேண்டிய படிகள்:
uk: Щоб обчислити результат, нам потрібно виконати такі кроки:
zh_cn: 需要执行以下步骤才能够得到计算结果：
zh_tw: 計算結果所需的步驟如下：

source: Create a new pipeline.
ga: Cruthaigh píblíne nua.
ja: 新しいパイプラインの作成。
ru: Создайте новый pipeline.
ta: புதிய குழாய்வழியை உருவாக்கவும்.
uk: Створіть новий конвеєр.
zh_cn: 新建管线。
zh_tw: 建立新的管線。

source: Begin a list of instructions for our GPU to execute.
ga: Cuir tús le liosta treoracha dár GPU a fhorghníomhú.
ja: GPUが実行する命令のリストを開始。
ru: Начать список инструкций, которые должен выполнить наш графический процессор.
ta: எங்கள் சி.பீ.யூ செயல்படுத்த வழிமுறைகளின் பட்டியலைத் தொடங்கவும்.
uk: Почніть список інструкцій, які має виконати наш графічний процесор.
zh_cn: 开启需要让 GPU 执行的指令列表。
zh_tw: 開始一組 GPU 要執行的指令清單。

source: Bind our compute list to our pipeline
ga: Ceangail ár liosta ríomhaireachta lenár bpíblíne
ja: コンピュートリストをパイプラインにバインド
ru: Свяжите наш список вычислений с нашим pipeline
ta: எங்கள் கம்ப்யூட் பட்டியலை எங்கள் குழாயுடன் பிணைக்கவும்
uk: Прив’яжіть наш список обчислень до нашого конвеєра
zh_cn: 将计算列表绑定至管线
zh_tw: 將計算清單綁定到管線

source: Bind our buffer uniform to our pipeline
ga: Ceangail ár n-éide maolán lenár bpíblíne
ja: バッファのUniformをパイプラインにバインド
ru: Привяжите наш буфер к нашему pipeline
ta: எங்கள் பஃப்லைன் எங்கள் குழாயுடன் பிணைக்கவும்
uk: Прив’яжіть нашу буферну форму до нашого трубопроводу
zh_cn: 将缓冲区 uniform 绑定至管线
zh_tw: 將緩衝區 uniform 綁定到管線

source: Specify how many workgroups to use
ga: Sonraigh cé mhéad grúpa oibre atá le húsáid
ja: 使用するワークグループの数を指定
ru: Укажите, сколько рабочих групп использовать
ta: எத்தனை பணிக்குழுக்களைப் பயன்படுத்த வேண்டும் என்பதைக் குறிப்பிடவும்
uk: Укажіть, скільки робочих груп використовувати
zh_cn: 指定要使用的工作组数量
zh_tw: 指定要使用的工作群組數量

source: End the list of instructions
ga: Deireadh leis an liosta treoracha
ja: 命令のリストを終了
ru: Завершить список инструкций
ta: வழிமுறைகளின் பட்டியலை முடிக்கவும்
uk: Завершіть список інструкцій
zh_cn: 关闭指令列表
zh_tw: 結束指令清單

source: Note that we are dispatching the compute shader with 5 work groups in the X axis, and one in the others. Since we have 2 local invocations in the X axis (specified in our shader), 10 compute shader invocations will be launched in total. If you read or write to indices outside of the range of your buffer, you may access memory outside of your shaders control or parts of other variables which may cause issues on some hardware.
fr: Notez que nous expédions le shader de calcul avec 5 groupes de travail dans l'axe X, et un dans les autres. Comme nous avons 2 invocations locales dans l'axe X (précisé dans notre shader), 10 invocations de shader de calcul seront lancées en tout. Si vous lisez ou écrivez à des indices en dehors de la plage de votre tampon, vous pouvez accéder à la mémoire en dehors du contrôle de votre shader ou des parties d'autres variables, ce qui peut causer des problèmes sur certains matériels.
ga: Tabhair faoi deara go bhfuil an scáthlánóir ríomh á sheoladh againn le 5 ghrúpa oibre san ais X, agus ceann amháin sna cinn eile. Ós rud é go bhfuil 2 agairt áitiúla againn san ais X (sonraithe inár scáthóir), seolfar 10 n-iarratas ríomh scáthaithe san iomlán. Má léann tú nó má scríobhann tú chuig innéacsanna lasmuigh de raon do mhaoláin, féadfaidh tú rochtain a fháil ar chuimhne lasmuigh de do smacht scáthaitheoirí nó ar chodanna d’athróga eile a d’fhéadfadh fadhbanna a chruthú ar chrua-earraí áirithe.
ja: X軸に5つのワーク グループ、その他に1つのワーク グループを含むコンピュートシェーダーをディスパッチしていることに注意してください。 X 軸 (シェーダーで指定) に2つのローカル呼び出しがあるため、合計10個のコンピュートシェーダーの実行コンテキストが起動されます。バッファの範囲外のインデックスの読み取りまたは書き込みを行うと、シェーダー制御下の外側のメモリや他の変数の一部にアクセスする可能性があり、一部のハードウェアで問題が発生する可能性があります。
ru: Обратите внимание, что мы запускаем вычислительный шейдер с пятью рабочими группами по оси X и одной по остальным. Поскольку у нас есть два локальных вызова по оси X (указанных в нашем шейдере), всего будет запущено 10 вызовов вычислительного шейдера. При чтении или записи по индексам за пределами диапазона буфера возможен доступ к памяти за пределами контроля шейдера или к частям других переменных, что может вызвать проблемы на некоторых устройствах.
ta: ஃச் அச்சில் 5 பணிக்குழுக்களுடன் கம்ப்யூட் சேடரை அனுப்புகிறோம், மற்றவற்றில் ஒன்று என்பதை நினைவில் கொள்க. ஃச் அச்சில் 2 உள்ளக அழைப்புகள் இருப்பதால் (எங்கள் சேடரில் குறிப்பிடப்பட்டுள்ளது), 10 கம்ப்யூட் சேடர் அழைப்புகள் மொத்தத்தில் தொடங்கப்படும். உங்கள் இடையக வரம்பிற்கு வெளியே உள்ள குறியீடுகளைப் படித்தால் அல்லது எழுதினால், உங்கள் சேடர்ச் கட்டுப்பாடு அல்லது பிற மாறிகளின் சில பகுதிகளுக்கு வெளியே நினைவகத்தை அணுகலாம், அவை சில வன்பொருள்களில் சிக்கல்களை ஏற்படுத்தக்கூடும்.
uk: Зауважте, що ми відправляємо обчислювальний шейдер із 5 робочими групами на осі X і по одній на інших. Оскільки у нас є 2 локальні виклики на осі X (зазначені в нашому шейдері), загалом буде запущено 10 викликів обчислювального шейдера. Якщо ви читаєте або записуєте індекси за межами діапазону вашого буфера, ви можете отримати доступ до пам’яті поза контролем ваших шейдерів або до частин інших змінних, що може спричинити проблеми з деяким обладнанням.
zh_tw: 請注意，我們在 X 軸分派了 5 個工作群組，其餘軸各 1 個。由於著色器設定 X 軸有 2 次本地呼叫，總共會執行 10 次計算著色器呼叫。若你讀寫的索引超過緩衝區範圍，可能會誤存取到著色器以外的記憶體或其他變數，可能導致某些硬體出現問題。

source: Execute a compute shader
fr: Exécuter un shader de calcul
ga: Déan scáthóir ríomh a fhorghníomhú
ja: コンピュートシェーダーを実行する
ru: Выполнить вычислительный шейдер
ta: ஒரு கம்ப்யூட் சேடரை இயக்கவும்
uk: Виконайте обчислювальний шейдер
zh_cn: 执行计算着色器
zh_tw: 執行計算著色器

source: After all of this we are almost done, but we still need to execute our pipeline. So far we have only recorded what we would like the GPU to do; we have not actually run the shader program.
ga: Tar éis seo go léir tá muid beagnach déanta, ach ní mór dúinn ár bpíblíne a fhorghníomhú fós. Go dtí seo níor thaifeadadh againn ach cad ba mhaith linn go ndéanfadh an GPU; níor reáchtáilte againn an clár shader i ndáiríre.
ja: これでほぼ完了ですが、これからパイプラインを実行する必要があります。これまでGPUに実行させたいことだけを記録しました。まだ実際にシェーダープログラムを実行していません。
ru: После всего этого мы почти закончили, но нам ещё нужно запустить наш конвейер. Пока что мы только записали, что именно должен делать графический процессор; мы ещё не запустили шейдерную программу.
ta: இவை அனைத்திற்கும் பிறகு நாங்கள் கிட்டத்தட்ட முடித்துவிட்டோம், ஆனால் நாங்கள் இன்னும் எங்கள் குழாய்த்திட்டத்தை இயக்க வேண்டும். சி.பீ.யு செய்ய விரும்புவதை மட்டுமே இதுவரை பதிவு செய்துள்ளோம்; நாங்கள் உண்மையில் சேடர் திட்டத்தை இயக்கவில்லை.
uk: Після всього цього ми майже закінчили, але нам ще потрібно виконати наш конвеєр. Поки що ми записали лише те, що ми хотіли б, щоб GPU зробив; ми фактично не запускали шейдерну програму.
zh_tw: 經過上述步驟，我們已經快完成了，但還需執行剛剛建立的管線。到目前為止，我們只是記錄 GPU 要執行的內容，尚未真正啟動著色器程式。

source: To execute our compute shader we need to submit the pipeline to the GPU and wait for the execution to finish:
ga: Chun ár scáthóir ríomhaireachta a fhorghníomhú ní mór dúinn an píblíne a chur isteach chuig an GPU agus fanacht go gcríochnóidh an forghníomhú:
ja: コンピュートシェーダーを実行するには、パイプラインをGPUに送信して実行が完了するのを待つ必要があります。
ru: Чтобы выполнить наш вычислительный шейдер, нам необходимо передать конвейер графическому процессору и дождаться завершения выполнения:
ta: எங்கள் கம்ப்யூட் சேடரை இயக்க நாங்கள் சி.பீ.யுக்கு குழாய்த்திட்டத்தை சமர்ப்பிக்க வேண்டும் மற்றும் சாவுஒறுப்பு முடிக்க காத்திருக்க வேண்டும்:
uk: Щоб виконати наш обчислювальний шейдер, нам потрібно передати конвеєр до GPU та дочекатися завершення виконання:
zh_tw: 要執行計算著色器，必須將管線提交給 GPU，並等待執行完成：
