Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/converting_glsl_to_godot_shaders.po
Languages: ga, ru, ta

source: In order to make writing fragment shaders straightforward and easy, Shadertoy handles passing a lot of helpful information from the main program into the fragment shader for you. A few of these have no equivalents in Godot because Godot has chosen not to make them available by default. This is okay because Godot gives you the ability to make your own uniforms. For variables whose equivalents are listed as "Provide with Uniform", users are responsible for creating that uniform themselves. The description gives the reader a hint about what they can pass in as a substitute.
ga: D'fhonn scáthóirí brúin scríbhneoireachta a dhéanamh simplí agus éasca, láimhseálann Shadertoy a lán faisnéise cabhrach a chur ar aghaidh ón bpríomhchlár isteach sa scáthóir blúir duit. Níl aon choibhéisí ag cuid acu seo i Godot toisc gur roghnaigh Godot gan iad a chur ar fáil de réir réamhshocraithe. Tá sé seo ceart go leor toisc go dtugann Godot an cumas duit d'éide féin a dhéanamh. Maidir le hathracha a bhfuil a gcoibhéisí liostaithe mar “Soláthar le Aonfhoirm”, tá úsáideoirí freagrach as an aonfhoirm sin a chruthú Tugann an cur síos leid don léitheoir faoin méid is féidir leo dul isteach mar ionad.
ru: Чтобы сделать написание фрагментных шейдеров простым и легким, Shadertoy обрабатывает передачу множества полезной информации из основной программы в фрагментный шейдер за вас. Некоторые из них не имеют аналогов в Godot, потому что Godot решил не делать их доступными по умолчанию. Это нормально, потому что Godot дает вам возможность создавать свои собственные формы. Для переменных, эквиваленты которых перечислены как "Provide with Uniform", пользователи сами отвечают за создание такой формы. Описание дает читателю подсказку о том, что можно передать в качестве замены.
ta: எழுதும் துண்டு நிழல்களை நேரடியானதாகவும், எளிதாகவும் மாற்றுவதற்காக, முதன்மையான திட்டத்திலிருந்து பல பயனுள்ள தகவல்களை உங்களுக்கான துண்டு சேடருக்குள் அனுப்ப சேடர்டோய் கையாளுகிறார். இவற்றில் சிலவற்றில் கோடோட்டில் சமமானவை இல்லை, ஏனெனில் கோடோட் அவற்றை இயல்பாகவே கிடைக்கச் செய்ய வேண்டாம் என்று தேர்ந்தெடுத்துள்ளார். இது பரவாயில்லை, ஏனென்றால் உங்கள் சொந்த சீருடைகளை உருவாக்கும் திறனை கோடோட் உங்களுக்கு வழங்குகிறது. சமமானவை "சீருடையுடன் வழங்குதல்" என்று பட்டியலிடப்பட்ட மாறிகளுக்கு, பயனர்கள் அந்த சீருடையை உருவாக்குவதற்கு பொறுப்பாவார்கள். விளக்கம் வாசகருக்கு மாற்றாக அவர்கள் எதை அனுப்ப முடியும் என்பதைப் பற்றிய குறிப்பைக் கொடுக்கிறது.

source: fragColor
ru: frаgColor
ta: fragacolor

source: iResolution
ru: iRеsolution
ta: irseulution

source: 1.0 / SCREEN_PIXEL_SIZE
ga: 1.0/SCÁILEÁN_PIXEL_SIZE
ta: 1.0 / ச்கிரீன்_பிக்சல்_சிச்

source: Can also pass in manually.
ga: Is féidir dul isteach de láimh freisin.
ru: Также можно передать вручную.
ta: கைமுறையாகவும் செல்லலாம்.

source: iTime
ta: மூடுபனி

source: TIME
ga: AM
ta: நேரம்

source: Time since shader started.
ga: Am ó thosaigh an shader.
ru: Время с момента запуска шейдера.
ta: சேடர் தொடங்கிய நேரம்.

source: Provide with Uniform
ga: Soláthar le Aonfhoirm
ru: Обеспечение Uniform
ta: சீருடையில் வழங்கவும்

source: Time to render previous frame.
ga: Am chun fráma roimhe seo a rinneadh.
ru: Время рендеринга предыдущего кадра.
ta: முந்தைய சட்டகத்தை வழங்குவதற்கான நேரம்.

source: Frame number.
ga: Uimhir fráma.
ru: Номер кадра.
ta: சட்ட எண்.

source: iChannelTime[4]
ta: சேனல்டைம் [4]

source: Time since that particular texture started.
ga: Am ó thosaigh an uigeacht áirithe sin.
ru: Прошло время с момента появления этой конкретной текстуры.
ta: அந்த குறிப்பிட்ட அமைப்பு தொடங்கிய நேரம்.

source: iMouse
ta: குறைவு

source: Mouse position in pixel coordinates.
ga: Suíomh luiche i gcomhordanáidí picteilín.
ru: Положение мыши в пиксельных координатах.
ta: படப்புள்ளி ஆயத்தொகுதிகளில் சுட்டி நிலை.

source: iDate
ta: ஐடேட்

source: Current date, expressed in seconds.
ga: Dáta reatha, in iúl i soicindí.
ru: Текущая дата, выраженная в секундах.
ta: தற்போதைய தேதி, நொடிகளில் வெளிப்படுத்தப்படுகிறது.

source: 1.0 / TEXTURE_PIXEL_SIZE
ga: 1.0/MÉID PICTEICSEÁL_TEXTÚRA_
ta: 1.0 / stecture_pixel_size

source: Resolution of particular texture.
ga: Réiteach ar uigeacht áirithe.
ru: Разрешение конкретной текстуры.
ta: குறிப்பிட்ட அமைப்பின் தீர்மானம்.

source: iChanneli
ga: iChannel
ta: பழமொழி

source: Sampler2D
ga: Samplair2D
ta: மாதிரி 2 டி

source: TEXTURE
ga: UIGEACHT
ta: அமைப்பு

source: Godot provides only one built-in; user can make more.
ga: Ní sholáthraíonn Godot ach ionsuite amháin; is féidir le húsáideoir níos mó a dhéanamh.
ru: Godot предоставляет только одну встроенную функцию; пользователь может создать больше.
ta: கோடோட் ஒரு உள்ளமைக்கப்பட்ட ஒரே ஒரு மட்டுமே வழங்குகிறது; பயனர் மேலும் செய்ய முடியும்.

source: ``fragCoord`` behaves the same as ``gl_FragCoord`` in :ref:`GLSL <glsl_coordinates>` and ``FRAGCOORD`` in Godot.
ga: Iompraíonn ``fragCoord`` mar an gcéanna le ``gl_FragCoord`` i :ref:`GLSL <glsl_coordinates>` agus ``FRAGCOORD`` in Godot.
ru: ``fragCoord`` ведет себя так же, как ``gl_FragCoord`` в :ref:`GLSL <glsl_coordinates>` и ``FRAGCOORD`` в Godot.
ta: `` fragcoord`` `` gl_fragcoord`` இல் செயல்படுகிறது: ref: `glsl <glsl_coordinates>` மற்றும் `` `ஃப்ராக் கோர்ட்``.

source: The Book of Shaders
ga: Leabhar na Scádóirí
ru: Книга Шейдеров
ta: சேடர்ச் நூல்

source: Similar to Shadertoy, `The Book of Shaders <https://thebookofshaders.com>`_ provides access to a fragment shader in the web browser, with which the user may interact. The user is restricted to writing fragment shader code with a set list of uniforms passed in and with no ability to add additional uniforms.
ga: Cosúil le Shadertoy, soláthraíonn `The Book of Shaders <https://thebookofshaders.com>`_ rochtain ar bhlúire scáthlán sa bhrabhsálaí gréasáin, a bhféadfaidh an t-úsáideoir idirghníomhú leis. Tá an t-úsáideoir teoranta do chód scáthaithe blúire a scríobh le liosta socraithe d'éide a chuirtear isteach agus níl sé ar a gcumas éidí breise a chur leis.
ru: Подобно Shadertoy, `The Book of Shaders <https://thebookofshaders.com>`_ предоставляет доступ к фрагментному шейдеру в веб-браузере, с которым пользователь может взаимодействовать. Пользователь ограничен написанием кода фрагментного шейдера с заданным списком переданных юниформ-переменных и не имеет возможности добавлять дополнительные юниформ-переменные.
ta: சேடர்டாயைப் போலவே, `சேடர்களின் நூல் <https://thebookofshaders.com>` _ வலை உலாவியில் ஒரு துண்டு நிழலுக்கான அணுகலை வழங்குகிறது, அதனுடன் பயனர் தொடர்பு கொள்ளலாம். அனுப்பப்பட்ட சீருடைகளின் தொகுப்பு பட்டியலுடன் துண்டு துண்டான குறியீட்டை எழுதுவதற்கு பயனர் கட்டுப்படுத்தப்படுகிறார், மேலும் கூடுதல் சீருடைகளைச் சேர்க்கும் திறன் இல்லை.

source: For further help on porting shaders to various frameworks generally, The Book of Shaders provides a `page <https://thebookofshaders.com/04>`_ on running shaders in various frameworks.
ga: Chun tuilleadh cabhrach a fháil maidir le bearrthóirí a aistriú chuig creataí éagsúla go ginearálta, soláthraíonn Leabhar na Shaders `leathanach <https://thebookofshaders.com/04>`_ ar scáthaitheoirí a rith i gcreatanna éagsúla.
ru: Для получения дополнительной информации по портированию шейдеров на различные фреймворки в The Book of Shaders имеется страница <https://thebookofshaders.com/04>`_ о запуске шейдеров на различных фреймворках.
ta: பொதுவாக பல்வேறு கட்டமைப்புகளுக்கு சேடர்களை போர்ட்டிங் செய்வதற்கு மேலதிக உதவிக்காக, சேடர்ச் நூல் `பக்க <https://thebookofshaders.com/04>` _ பல்வேறு கட்டமைப்புகளில் சேடர்களை இயக்குவதில் வழங்குகிறது.

source: The Book of Shaders uses the webgl spec, so it runs a slightly different version of GLSL. However, it still has the regular types, including constants and macros.
ga: Úsáideann The Book of Shaders an sonraíocht webgl, mar sin ritheann sé leagan beagán difriúil de GLSL. Mar sin féin, tá na cineálacha rialta aige fós, lena n-áirítear comhsheasmhainní agus macraí.
ru: Книга шейдеров использует спецификацию webgl, поэтому использует немного другую версию GLSL. Тем не менее, в ней по-прежнему присутствуют стандартные типы данных, включая константы и макросы.
ta: சேடர்ச் நூல் வெப்சிஎல் ச்பெக்கைப் பயன்படுத்துகிறது, எனவே இது சி.எல்.எச்.எல் இன் சற்று வித்தியாசமான பதிப்பை இயக்குகிறது. இருப்பினும், மாறிலிகள் மற்றும் மேக்ரோக்கள் உள்ளிட்ட வழக்கமான வகைகளை இது இன்னும் கொண்டுள்ளது.

source: The entry point for a Book of Shaders fragment shader is ``main``, just like in GLSL. Everything written in a Book of Shaders ``main`` function should be copied into Godot's ``fragment`` function.
ga: Is é “príomhphointe” an pointe iontrála do scáthóir bhrúin Book of Shaders, díreach cosúil le GLSL. Ba chóir gach rud atá scríofa i bhfeidhm ``príom`` Book of Shaders a chóipeáil isteach i bhfeidhm ``fragment` Godot.
ru: Точкой входа для фрагментного шейдера Book of Shaders является ``main``, как и в GLSL. Всё, что написано в функции ``main`` Book of Shaders, следует скопировать в функцию ``fragment`` Godot.
ta: சேடர்ச் துண்டு சேடரின் புத்தகத்திற்கான நுழைவு புள்ளி `` பிரதான`` ஆகும், இது சி.எல்.எச்.எல். சேடர்ச் புத்தகத்தில் எழுதப்பட்ட அனைத்தும் `` பிரதான`` செயல்பாடு கோடோட்டின் `` துண்டு`` செயல்பாட்டில் நகலெடுக்கப்பட வேண்டும்.

source: The Book of Shaders sticks closer to plain GLSL than Shadertoy does. It also implements fewer uniforms than Shadertoy.
ga: Cloíonn Leabhar na Shaders níos gaire do GLSL simplí ná mar a dhéanann Shadertoy. Cuireann sé níos lú éide i bhfeidhm freisin ná Shadertoy.
ru: Книга шейдеров ближе к чистому GLSL, чем Shadertoy. Кроме того, в ней реализовано меньше юниформ-объектов, чем в Shadertoy.
ta: சேடர்டாயை விட சேடர்ச் நூல் வெற்று சி.எல்.எச்.எல் உடன் நெருக்கமாக ஒட்டிக்கொண்டது. இது சேடர்டாயை விட குறைவான சீருடைகளையும் செயல்படுத்துகிறது.

source: The Book of Shaders uses the same coordinate system as :ref:`GLSL <glsl_coordinates>`.
ga: Úsáideann Leabhar Shaders an córas comhordanáidí céanna agus :ref:`GLSL <glsl_coordinates>`.
ru: Book of Shaders использует ту же систему координат, что и :ref:`GLSL <glsl_coordinates>`.
ta: சேடர்ச் நூல் அதே ஒருங்கிணைப்பு அமைப்பைப் பயன்படுத்துகிறது: குறிப்பு: `சி.எல்.எச்.எல் <சி.எல்.எச்.எல்_கோர்டைன்ச்>`.

source: ``#if``, ``#elif``, ``#else``, ``#endif``, ``defined()``, ``#ifdef``, ``#ifndef``
ga: ``#if``, ``#elif``, ``#else``, ``#endif``, `sainmhínithe () ``,`` #ifdef ``,`` #ifndef ```

source: POINT_SIZE
ga: MÉID POINTE
ru: РАЗМЕР_ТОЧКИ

source: FRONT_FACING
ga: AGHAIDH A THABHAIRT AR AGHAIDH

source: u_resolution
ga: u_réiteach

source: u_time
ga: u_am

source: POINT_COORD
ru: МЕСТОПОЛОЖЕНИЕ_ТОЧКИ

source: gl_FrontFacing
ru: gl_FrontFаcing
