Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/converting_glsl_to_godot_shaders.po
Languages: ga, ru, ta

source: Converting GLSL to Godot shaders
ga: GLSL a thiontú go scáthóirí Godot
ru: Преобразование GLSL в шейдеры Godot
ta: GLSL ஐ கோடோட் சேடர்களாக மாற்றுகிறது

source: This document explains the differences between Godot's shading language and GLSL and gives practical advice on how to migrate shaders from other sources, such as Shadertoy and The Book of Shaders, into Godot shaders.
ga: Míníonn an doiciméad seo na difríochtaí idir teanga scáthaithe Godot agus GLSL agus tugann sé comhairle phraiticiúil maidir le conas scáthóirí a aistriú ó fhoinsí eile, mar shampla Shadertoy agus The Book of Shaders, chuig scáthóirí Godot.
ru: В этом документе объясняются различия между языком шейдеров Godot и GLSL, и даются практические советы по переносу шейдеров из других источников, таких как Shadertoy и The Book of Shaders, в шейдеры Godot.
ta: இந்த ஆவணம் கோடோட்டின் நிழல் மொழி மற்றும் சி.எல்.எச்.எல் இடையேயான வேறுபாடுகளை விளக்குகிறது மற்றும் சேடர்டோய் மற்றும் சேடர்ச் நூல் போன்ற பிற மூலங்களிலிருந்து சேடர்களை எவ்வாறு கோடோட் சேடர்களுக்கு மாற்றுவது என்பது குறித்த நடைமுறை ஆலோசனைகளை வழங்குகிறது.

source: For detailed information on Godot's shading language, please refer to the :ref:`Shading Language <doc_shading_language>` reference.
ga: Le haghaidh mioneolas ar theanga scáthaithe Godot, féach le do thoil don tagairt :ref:`Shading Language <doc_shading_language>`.
ru: Для получения подробной информации о языке шейдеров Godot, пожалуйста, обратитесь к ссылке :ref:`Shading Language <doc_shading_language>`.
ta: கோடோட்டின் நிழல் மொழி குறித்த விரிவான தகவலுக்கு, தயவுசெய்து: குறிப்பு: `நிழல் மொழி <doc_shading_language>` குறிப்பு.

source: GLSL
ta: சி.எல்.எச்.எல்

source: Godot uses a shading language based on GLSL with the addition of a few quality-of-life features. Accordingly, most features available in GLSL are available in Godot's shading language.
ga: Úsáideann Godot teanga scáthaithe bunaithe ar GLSL le cúpla gné cáilíochta beatha a chur leis. Dá réir sin, tá an chuid is mó de na gnéithe atá ar fáil i GLSL ar fáil i dteanga scáthaithe Godot.
ru: В Godot используется язык шейдеров, основанный на GLSL, с добавлением нескольких функций, отвечающих за качество жизни. Соответственно, большинство функций, доступных в GLSL, доступны и в языке шейдеров Godot.
ta: கோடோட் சி.எல்.எச்.எல் அடிப்படையில் ஒரு நிழல் மொழியைப் பயன்படுத்துகிறார். அதன்படி, சி.எல்.எச்.எல் இல் கிடைக்கும் பெரும்பாலான நற்பொருத்தங்கள் கோடோட்டின் நிழல் மொழியில் கிடைக்கின்றன.

source: Shader programs
ga: Cláir Shader
ru: Шейдерные программы
ta: சேடர் நிரல்கள்

source: In GLSL, each shader uses a separate program. You have one program for the vertex shader and one for the fragment shader. In Godot, you have a single shader that contains a ``vertex`` and/or a ``fragment`` function. If you only choose to write one, Godot will supply the other.
ga: I GLSL, úsáideann gach shader clár ar leithligh. Tá clár amháin agat don scáthóir vertex agus ceann don scáthóir brúin. I Godot, tá scáthóir amháin agat ina bhfuil feidhm ``vertex`` agus/nó feidhm ``fragment`. Mura roghnaíonn tú ach ceann amháin a scríobh, soláthróidh Godot an ceann eile.
ru: В GLSL каждый шейдер использует отдельную программу. У вас есть одна программа для вершинного шейдера и одна для фрагментного шейдера. В Godot у вас есть один шейдер, который содержит функцию ``vertex`` и/или ``fragment``. Если вы решили написать только одну функцию, Godot предоставит другую.
ta: சி.எல்.எச்.எல் இல், ஒவ்வொரு சேடரும் ஒரு தனி நிரலைப் பயன்படுத்துகிறது. உங்களிடம் வெர்டெக்ச் சேடருக்கு ஒரு நிரலும், துண்டு சேடருக்கு ஒன்று உள்ளது. கோடோட்டில், உங்களிடம் ஒரு ஒற்றை சேடர் உள்ளது, அதில் `` வெர்டெக்ச்`` மற்றும்/அல்லது ஒரு `` துண்டு`` செயல்பாடு உள்ளது. நீங்கள் ஒன்றை எழுத மட்டுமே தேர்வுசெய்தால், கோடோட் மற்றொன்றை வழங்கும்.

source: Godot allows uniform variables and functions to be shared by defining the fragment and vertex shaders in one file. In GLSL, the vertex and fragment programs cannot share variables except when varyings are used.
ga: Ligeann Godot athróga agus feidhmeanna aonfhoirmeacha a roinnt tríd na scáthóirí blúire agus vertex a shainiú i gcomhad amháin. I GLSL, ní féidir leis na cláir vertex agus blúire athróga a roinnt ach amháin nuair a úsáidtear éagsúlachtaí.
ru: Godot позволяет совместно использовать унифицированные переменные и функции, определяя фрагментный и вершинный шейдеры в одном файле. В GLSL вершинные и фрагментные программы не могут совместно использовать переменные, за исключением случаев, когда используются вариации.
ta: ஒரு கோப்பில் உள்ள துண்டு மற்றும் வெர்டெக்ச் சேடர்களை வரையறுப்பதன் மூலம் சீரான மாறிகள் மற்றும் செயல்பாடுகளை பகிர்ந்து கொள்ள கோடோட் அனுமதிக்கிறது. சி.எல்.எச்.எல் இல், வெர்டெக்ச் மற்றும் துண்டு நிரல்கள் மாறுபாடுகள் பயன்படுத்தப்படும்போது தவிர மாறிகளைப் பகிர்ந்து கொள்ள முடியாது.

source: Vertex attributes
ga: tréithe Vertex
ru: Атрибуты вершин
ta: வெர்டெக்ச் பண்புக்கூறுகள்

source: In GLSL, you can pass in per-vertex information using attributes and have the flexibility to pass in as much or as little as you want. In Godot, you have a set number of input attributes, including ``VERTEX`` (position), ``COLOR``, ``UV``, ``UV2``, ``NORMAL``. Each shaders' page in the shader reference section of the documentation comes with a complete list of its vertex attributes.
ga: I GLSL, is féidir leat faisnéis in aghaidh an choirce a chur isteach ag baint úsáide as tréithe agus an solúbthacht a bheith agat dul isteach an oiread nó chomh beag agus is mian leat. I Godot, tá líon socraithe tréithe ionchuir agat, lena n-áirítear ``VERTEX`` (suíomh), ``COLOR``, `UV``, `UV2``, `NORMAL``. Tagann leathanach gach scáthóirí sa chuid tagartha shader den doiciméadú le liosta iomlán dá thréithe beartach.
ru: В GLSL вы можете передавать информацию о каждой вершине с помощью атрибутов и иметь возможность передавать её как можно больше или меньше. В Godot у вас есть определенное количество входных атрибутов, включая ``VERTEX`` (позиция), ``COLOR``, ``UV``, ``UV2``, ``NORMAL``. На странице каждого шейдера в разделе документации "Ссылки на шейдеры" приводится полный список вершинных атрибутов.
ta: சி.எல்.எச்.எல் இல், நீங்கள் பண்புக்கூறுகளைப் பயன்படுத்தி ஒரு பெர்டெக்ச் தகவல்களை அனுப்பலாம் மற்றும் நீங்கள் விரும்பும் அளவுக்கு அல்லது குறைவாக கடந்து செல்வதற்கான நெகிழ்வுத்தன்மையைக் கொண்டிருக்கலாம். கோடோட்டில், `` வெர்டெக்ச்``` (நிலை), `` வண்ணம்``, `` uv``, `` uv2``, `இயல்பான`` உள்ளிட்ட உள்ளீட்டு பண்புகளின் எண்ணிக்கையை உங்களிடம் கொண்டுள்ளது. ஆவணத்தின் சேடர் குறிப்பு பிரிவில் உள்ள ஒவ்வொரு சேடர்களின் பக்கமும் அதன் வெர்டெக்ச் பண்புகளின் முழுமையான பட்டியலுடன் வருகிறது.

source: ``gl_Position`` receives the final position of a vertex specified in the vertex shader. It is specified by the user in clip space. Typically, in GLSL, the model space vertex position is passed in using a vertex attribute called ``position`` and you handle the conversion from model space to clip space manually.
ga: Faigheann ``gl_position`` suíomh deiridh vertex a shonraítear sa scáthóir vertex. Sonraíonn an t-úsáideoir é i spás gearrthóg. De ghnáth, i GLSL, cuirtear suíomh teirce an spáis samhail trí úsáid a bhaint as tréith vertex ar a dtugtar ``suíomh ``agus láimhseálann tú an tiontú ó spás samhail go spás gearrthóg de láimh.
ru: ``gl_Position`` получает конечную позицию вершины, указанной в вершинном шейдере. Она задаётся пользователем в пространстве клипа. Обычно в GLSL положение вершины в пространстве модели передается с помощью атрибута вершины под названием ``position``, а преобразование из пространства модели в пространство клипа выполняется вручную.
ta: `` gl_position`` வெர்டெக்ச் சேடரில் குறிப்பிடப்பட்டுள்ள ஒரு வெர்டெக்சின் இறுதி நிலையைப் பெறுகிறது. இது கிளிப் இடத்தில் பயனரால் குறிப்பிடப்பட்டுள்ளது. பொதுவாக, சி.எல்.எச்.எல் இல், மாதிரி விண்வெளி வெர்டெக்ச் நிலை `` நிலை`` எனப்படும் வெர்டெக்ச் பண்புக்கூறு பயன்படுத்துவதில் அனுப்பப்படுகிறது, மேலும் மாதிரி இடத்திலிருந்து விண்வெளிக்கு கைமுறையாக மாற்றுவதை நீங்கள் கையாளுகிறீர்கள்.

source: In Godot, ``VERTEX`` specifies the vertex position in model space at the beginning of the ``vertex`` function. Godot also handles the final conversion to clip space after the user-defined ``vertex`` function is run. If you want to skip the conversion from model to view space, you can set the ``render_mode`` to ``skip_vertex_transform``. If you want to skip all transforms, set ``render_mode`` to ``skip_vertex_transform`` and set the ``PROJECTION_MATRIX`` to ``mat4(1.0)`` in order to nullify the final transform from view space to clip space.
ga: I Godot, sonraíonn ``VERTEX`` an suíomh vertex i spás samhail ag tús na feidhme ``vertex ``. Láimhseálann Godot freisin an tiontú deiridh go spás gearrthóg tar éis an fheidhm ``vertex` atá sainmhínithe ón úsáideoir a reáchtáil. Más mian leat an tiontú a scipeáil ó mhúnla go spás féachaint, is féidir leat an ``render_mode`` a shocrú go ``skip_vertex_transform``. Más mian leat gach claochrú a scipeáil, socraigh ``render_mode`` go `skip_vertex_transform`` agus socraigh an ``PROJECTION_MATRIX`` go `mat4 (1.0) ``d'fhonn an claochlú deiridh ó spás amharc go spás gearrthóg a chur ar neamhní.
ru: В Godot, ``VERTEX`` определяет положение вершины в пространстве модели в начале функции ``vertex``. Godot также обрабатывает окончательное преобразование в пространство клипа после выполнения пользовательской функции ``vertex``. Если вы хотите пропустить преобразование из пространства модели в пространство вида, вы можете установить ``render_mode`` на ``skip_vertex_transform``. Если вы хотите пропустить все преобразования, установите ``render_mode`` в ``skip_vertex_transform`` и установите ``PROJECTION_MATRIX`` в ``mat4(1.0)``, чтобы обнулить окончательное преобразование из пространства вида в пространство клипа.
ta: கோடோட்டில், `` வெர்டெக்ச்`` `` வெர்டெக்ச்`` செயல்பாட்டின் தொடக்கத்தில் மாதிரி இடத்தில் வெர்டெக்ச் நிலையை குறிப்பிடுகிறது. பயனர் வரையறுக்கப்பட்ட `` வெர்டெக்ச்`` செயல்பாடு இயக்கப்பட்ட பிறகு கிளிப் இடத்திற்கான இறுதி மாற்றத்தையும் கோடோட் கையாளுகிறது. மாதிரியிலிருந்து இடத்தைக் காணும் மாற்றத்தை நீங்கள் தவிர்க்க விரும்பினால், நீங்கள் `` ரெண்டர்_மோட்`` ஐ `` skip_vertex_transform`` க்கு அமைக்கலாம். எல்லா மாற்றங்களையும் நீங்கள் தவிர்க்க விரும்பினால், `` ரெண்டர்_மோட்`` `` Skip_vertex_transform`` க்கு அமைத்து, `` ப்ரொசெக்சன்_மேட்ரிக்ச்`` க்கு `` MAT4 (1.0) `` என அமைக்கவும் .

source: Varyings
ga: Athraíonn
ru: Varуings
ta: மாறுபாடுகள்

source: Varyings are a type of variable that can be passed from the vertex shader to the fragment shader. In modern GLSL (3.0 and up), varyings are defined with the ``in`` and ``out`` keywords. A variable going out of the vertex shader is defined with ``out`` in the vertex shader and ``in`` inside the fragment shader.
ga: Is cineál athróg iad éagsúlachtaí is féidir a chur ar aghaidh ón scáthóir vertex go dtí an scáthóir brúin. I GLSL nua-aimseartha (3.0 agus suas), sainmhínítear éagsúlachtaí leis na heochairfhocail ``in`` agus ``out``. Sainmhínítear athróg a théann amach as an scáthóir vertex le ``out`` sa scáthóir vertex agus ``in`` taobh istigh den scáthóir bhrúin.
ru: Varyings - это тип переменных, которые можно передавать из вершинного шейдера во фрагментный шейдер. В современном GLSL (3.0 и выше) переменные определяются с помощью ключевых слов ``in`` и ``out``. Переменная, выходящая из вершинного шейдера, определяется с помощью ``out`` в вершинном шейдере и ``in`` во фрагментном шейдере.
ta: VARIANGS என்பது ஒரு வகை மாறி, அவை வெர்டெக்ச் சேடரிலிருந்து துண்டு நிழல் வரை அனுப்பப்படலாம். நவீன சி.எல்.எச்.எல் (3.0 மற்றும் அதற்கு மேற்பட்ட) இல், மாறுபாடுகள் `` இன்` மற்றும் `` அவுட்`` முக்கிய வார்த்தைகளுடன் வரையறுக்கப்படுகின்றன. வெர்டெக்ச் சேடரில் இருந்து வெளியேறும் ஒரு மாறி, வெர்டெக்ச் சேடரில் `` அவுட்` உடன் வரையறுக்கப்படுகிறது மற்றும் துண்டு நிழலுக்குள் `` இல்`.

source: Main
ga: Príomh
ta: முக்கிய

source: In GLSL, each shader program looks like a self-contained C-style program. Accordingly, the main entry point is ``main``. If you are copying a vertex shader, rename ``main`` to ``vertex`` and if you are copying a fragment shader, rename ``main`` to ``fragment``.
ga: I GLSL, tá cuma clár féin-chuimsitheach i stíl C ar gach clár scáthaithe. Dá réir sin, is é “príomhphointe” an príomhphointe iontrála. Má tá scáthaitheoir vertex á chóipeáil agat, athainmnigh ``main`` go ``vertex`` agus má tá scáthaitheoir brúin á chóipeáil agat, athainmnigh ``main`` go ``fragment``.
ru: В GLSL каждая шейдерная программа выглядит как самодостаточная программа в стиле языка Си. Соответственно, главной точкой входа является ``main``. Если вы копируете вершинный шейдер, переименуйте ``main`` в ``vertex``, а если вы копируете фрагментный шейдер, переименуйте ``main`` в ``fragment``.
ta: சி.எல்.எச்.எல் இல், ஒவ்வொரு சேடர் நிரலும் ஒரு தன்னிறைவான சி-பாணி திட்டமாகத் தெரிகிறது. அதன்படி, முதன்மையான நுழைவு புள்ளி `` பிரதான``. நீங்கள் ஒரு வெர்டெக்ச் சேடரை நகலெடுக்கிறீர்கள் என்றால், `` பிரதான`` `` வெர்டெக்ச்`` என்று மறுபெயரிடுங்கள், நீங்கள் ஒரு துண்டு நிழலை நகலெடுக்கிறீர்கள் என்றால், `` பிரதான`` `` துண்டு`` என்று மறுபெயரிடுங்கள்.

source: Macros
ru: Макросы
ta: பெரியவைகள்

source: The :ref:`Godot shader preprocessor<doc_shader_preprocessor>` supports the following macros:
ga: Tacaíonn an :ref:`réamhphróiseálaí Godot shader <doc_shader_preprocessor>` leis na macraí seo a leanas:
ru: :ref:`Godot shader preprocessor<doc_shader_preprocessor>` поддерживает следующие макросы:
ta: தி: ரெஃப்: `கோடோட் சேடர் ப்ரொபிராசசர் <doc_shader_preprocesser>` பின்வரும் மேக்ரோக்களை ஆதரிக்கிறது:

source: ``#define`` / ``#undef``
ta: ``#` /` `#undef`` ஐ வரையறுக்கவும்

source: ``#include`` (only ``.gdshaderinc`` files and with a maximum depth of 25)
ga: ``#include`` (ach comhaid ``.gdshaderinc`` agus le doimhneacht uasta 25)
ru: ``#include`` (только файлы ``.gdshaderinc`` и с максимальной глубиной 25)
ta: ``#`` (`` .gdshaderinc` கோப்புகள் மற்றும் அதிகபட்சமாக 25 ஆழத்துடன்) சேர்க்கவும்)

source: ``#pragma disable_preprocessor``, which disables preprocessing for the rest of the file
ga: ``#pragma disable_preprocessor``, a dhíchumasaíonn réamhphróiseáil don chuid eile den chomhad
ru: ``#pragma disable_preprocessor``, что отключает предварительную обработку оставшейся части файла
ta: `` #pragma disable_preprocesser``, இது மீதமுள்ள கோப்பிற்கு முன் செயலாக்கத்தை முடக்குகிறது

source: Variables
ga: Athróga
ru: Переменные
ta: மாறிகள்

source: GLSL has many built-in variables that are hard-coded. These variables are not uniforms, so they are not editable from the main program.
ga: Tá go leor athróg ionsuite ag GLSL atá crua-chódaithe. Ní éide iad na hathróga seo, mar sin níl siad in eagar ón bpríomhchlár.
ru: В GLSL есть множество встроенных переменных, которые жёстко закодированы. Эти переменные не являются унифицированными, поэтому их нельзя редактировать из основной программы.
ta: சி.எல்.எச்.எல் பல உள்ளமைக்கப்பட்ட மாறிகள் உள்ளது, அவை கடின குறியிடப்பட்டவை. இந்த மாறிகள் சீருடைகள் அல்ல, எனவே அவை முதன்மையான திட்டத்திலிருந்து திருத்தக்கூடியவை அல்ல.

source: Variable
ga: Athróg
ru: Переменная
ta: மாறக்கூடிய

source: Type
ga: Cineál
ru: Тип
ta: வகை

source: Equivalent
ga: Coibhéis
ru: Эквивалент
ta: சமமான

source: Description
ga: Cur síos
ru: Описание
ta: விவரம்

source: out vec4
ga: amach vec4
ru: из vec4
ta: VEC4 அவுட்

source: COLOR
ga: DATH
ru: ЦВЕТ
ta: நிறம்

source: Output color for each pixel.
ga: Dath aschuir do gach picteilín.
ru: Выходной цвет для каждого пикселя.
ta: ஒவ்வொரு பிக்சலுக்கும் வெளியீட்டு நிறம்.

source: For full screen quads. For smaller quads, use UV.
ga: Le haghaidh quadanna scáileáin iomlán. Maidir le quadanna níos lú, bain úsáid as UV.
ru: Для полноэкранных квадратов. Для меньших квадратов используйте UV.
ta: முழு திரை குவாட்களுக்கு. சிறிய குவாட்சுக்கு, புற ஊதா பயன்படுத்தவும்.

source: VERTEX
ga: TOIRC
ru: ВЕРШИНА
ta: வெர்டெக்ச்

source: Position of Vertex, output from Vertex Shader.
ga: Suíomh Vertex, aschur ó Vertex Shader.
ru: Положение Vertex (вершины), выход Vertex Shader.
ta: வெர்டெக்சின் நிலை, வெர்டெக்ச் சேடரிலிருந்து வெளியீடு.

source: float
ga: snámhphointe
ta: மிதவை

source: Size of Point primitive.
ga: Méid an phointe primitive.
ru: Размер примитива Point (точка).
ta: புள்ளி பழமையான அளவு.

source: Position on point when drawing Point primitives.
ga: Suíomh ar phointe agus tú ag tarraingt príomhphointe.
ru: Положение относительно точки при рисовании Точечных примитивов.
ta: புள்ளி ஆதிமனிதர்களை வரைதல் போது நிலை.

source: bool
ta: பூல்

source: True if front face of primitive.
ga: Fíor má tá aghaidh tosaigh ar bpríomha.
ru: Истина, если это передняя грань примитива.
ta: பழமையான முன் முகம் என்றால் உண்மை.

source: Coordinates
ga: comhordanáidí
ru: Координаты
ta: ஒருங்கிணைப்புகள்

source: ``gl_FragCoord`` in GLSL and ``FRAGCOORD`` in the Godot shading language use the same coordinate system. If using UV in Godot, the y-coordinate will be flipped upside down.
ga: Úsáideann ``GL_FragCoord`` i GLSL agus ``FRAGCOORD`` sa teanga scáthaithe Godot an córas comhordaithe céanna. Má úsáideann tú UV i Godot, déanfar an comhordáid y a shliapadh os cionn.
ru: ``gl_FragCoord`` в GLSL и ``FRAGCOORD`` в языке шейдеров Godot используют одну и ту же систему координат. При использовании UV в Godot координата Y будет перевернута вверх ногами.
ta: Glsl இல் `` gl_fragcoord`` மற்றும் கோடோட் நிழல் மொழியில் `` ஃப்ராக் கோர்ட்`` ஒரே ஒருங்கிணைப்பு அமைப்பைப் பயன்படுத்துகிறது. கோடோட்டில் புற ஊதா பயன்படுத்தினால், ஒய்-ஒருங்கிணைப்பு தலைகீழாக புரட்டப்படும்.

source: Precision
ga: Beachtas
ru: Точность
ta: துல்லியம்

source: In GLSL, you can define the precision of a given type (float or int) at the top of the shader with the ``precision`` keyword. In Godot, you can set the precision of individual variables as you need by placing precision qualifiers ``lowp``, ``mediump``, and ``highp`` before the type when defining the variable. For more information, see the :ref:`Shading Language <doc_shading_language>` reference.
ga: I GLSL, is féidir leat beachtas cineál ar leith (snámhphointe nó slánuimhir) a shainiú ag barr an scáthlán leis an eochairfhocal ``cruinneas``. In Godot, is féidir leat beachtas na n-athróg aonair a shocrú de réir mar is gá duit trí cháilitheoirí beachtas ``lowp``, `` mediump``, agus `` highp`` a chur roimh an gcineál agus an athróg á shainiú. Le haghaidh tuilleadh eolais, féach an tagairt :ref:`Shading Language <doc_shading_language>`.
ru: В GLSL точность заданного типа (float или int) можно определить в начале шейдера с помощью ключевого слова ``precision``. В Godot можно задать необходимую точность отдельных переменных, добавив квалификаторы точности ``lowp``, ``mediump`` и ``highp`` перед типом при определении переменной. Подробнее см. в справочнике :ref:`Shading Language <doc_shading_language>`.
ta: சி.எல்.எச்.எல் இல், சேடரின் மேற்புறத்தில் கொடுக்கப்பட்ட வகையின் (மிதவை அல்லது ஐ.என்.டி) துல்லியத்தை `` துல்லியமான`` முக்கிய சொல் மூலம் வரையறுக்கலாம். கோடோட்டில், மாறியை வரையறுக்கும் போது வகைக்கு முன் துல்லியமான தகுதிப் போட்டிகளை `` லோ.பி``, `` நடுத்தர பி``, மற்றும் `` ஐபி`` ஆகியவற்றை வைப்பதன் மூலம் உங்களுக்குத் தேவையான தனிப்பட்ட மாறிகளின் துல்லியத்தை நீங்கள் அமைக்கலாம். மேலும் தகவலுக்கு, இதைக் காண்க: ref: `நிழல் மொழி <doc_shading_language>` குறிப்பு.

source: Shadertoy
ru: Shаdertoy
ta: சேடர்டோய்

source: `Shadertoy <https://www.shadertoy.com/results?query=&sort=popular&from=10&num=4>`_ is a website that makes it easy to write fragment shaders and create `pure magic <https://www.shadertoy.com/view/4tjGRh>`_.
ga: Is suíomh Gréasáin é `Shadertoy <https://www.shadertoy.com/results?query=&sort=popular&from=10&num=4> `_ a éascaíonn sé bearróirí blúire a scríobh agus `draíocht íon a chruthú <https://www. shadertoy.com/view/4tjGRh>`_.
ru: `Shadertoy <https://www.shadertoy.com/results?query=&sort=popular&from=10&num=4>`_ — это веб-сайт, который упрощает написание фрагментных шейдеров и создание `чистой магии <https://www.shadertoy.com/view/4tjGRh>`_.
ta: `Shadertoy <https://www.shadertoy.com/results?query=&sort=popular&from=10&num=4>` _ என்பது ஒரு வலைத்தளமாகும், இது துண்டு நிழல்களை எழுதுவதை எளிதாக்குகிறது மற்றும் `தூய மந்திரத்தை உருவாக்குகிறது <https: // www. shadertoy.com/view/4tjgrh>`_.

source: Shadertoy does not give the user full control over the shader. It handles all the input and uniforms and only lets the user write the fragment shader.
ga: Ní thugann Shadertoy smacht iomlán don úsáideoir ar an scáthóir. Láimhseálann sé an t-ionchur agus an éide go léir agus ní ligeann sé don úsáideoir ach an bearrthóir blúire a scríobh.
ru: Shadertoy не предоставляет пользователю полного контроля над шейдером. Он обрабатывает все входные данные и юниформы, позволяя пользователю только написать фрагментный шейдер.
ta: சேடர்டோய் பயனருக்கு சேடர் மீது முழு கட்டுப்பாட்டையும் கொடுக்கவில்லை. இது அனைத்து உள்ளீடு மற்றும் சீருடைகளையும் கையாளுகிறது மற்றும் பயனருக்கு துண்டு நிழலை எழுத அனுமதிக்கிறது.

source: Types
ga: Cineálacha
ru: Типы
ta: வகைகள்

source: Shadertoy uses the webgl spec, so it runs a slightly different version of GLSL. However, it still has the regular types, including constants and macros.
ga: Úsáideann Shadertoy an sonraíocht webgl, mar sin ritheann sé leagan beagán difriúil de GLSL. Mar sin féin, tá na cineálacha rialta aige fós, lena n-áirítear comhsheasmhainní agus macraí.
ru: Shadertoy использует спецификацию webgl, поэтому использует немного другую версию GLSL. Тем не менее, в нём по-прежнему присутствуют стандартные типы данных, включая константы и макросы.
ta: சாடர்டோய் வெப்சிஎல் ச்பெக்கைப் பயன்படுத்துகிறார், எனவே இது சி.எல்.எச்.எல் இன் சற்று வித்தியாசமான பதிப்பை இயக்குகிறது. இருப்பினும், மாறிலிகள் மற்றும் மேக்ரோக்கள் உள்ளிட்ட வழக்கமான வகைகளை இது இன்னும் கொண்டுள்ளது.

source: mainImage
ga: PríomhÍomhá
ru: mаinImage
ta: குறிப்பு

source: The main point of entry to a Shadertoy shader is the ``mainImage`` function. ``mainImage`` has two parameters, ``fragColor`` and ``fragCoord``, which correspond to ``COLOR`` and ``FRAGCOORD`` in Godot, respectively. These parameters are handled automatically in Godot, so you do not need to include them as parameters yourself. Anything in the ``mainImage`` function should be copied into the ``fragment`` function when porting to Godot.
ga: Is é an príomhphointe iontrála chuig shader Shadertoy an fheidhm ``MainImage`. Tá dhá pharaiméadar ag ``MainImage``, `FragColor`` agus `FragCoord``, a fhreagraíonn do ``COLOR`` agus ``FRAGCOORD`` i Godot, faoi seach. Láimhseálfar na paraiméadair seo go huathoibríoch i Godot, mar sin ní gá duit iad a áireamh mar pharaiméadair tú féin. Ba chóir aon rud sa fheidhm ``MainImage`` a chóipeáil isteach sa fheidhm ``fragment` agus tú ag iompar chuig Godot.
ru: Основной точкой входа в шейдер Shadertoy является функция ``mainImage``. У ``mainImage`` есть два параметра: ``fragColor`` и ``fragCoord``, которые соответствуют ``COLOR`` и ``FRAGCOORD`` в Godot соответственно. Эти параметры обрабатываются в Godot автоматически, поэтому вам не нужно добавлять их в качестве параметров самостоятельно. Всё содержимое функции ``mainImage`` следует скопировать в функцию ``fragment`` при портировании в Godot.
ta: சேடர்டாய் சேடருக்கு நுழைவதற்கான முக்கிய புள்ளி `` மெய்னிமேச்`` செயல்பாடு. `` மெய்னிமேச்`` இரண்டு அளவுருக்கள் உள்ளன, `` ஃப்ராக் காலர்` மற்றும் `` ஃப்ராக்கோர்ட்``, அவை முறையே கோடோட்டில் `` வண்ணம்`` மற்றும் `` ஃப்ராக்கூர்ட்`` ஆகியவற்றுடன் ஒத்திருக்கும். இந்த அளவுருக்கள் கோடோட்டில் தானாகவே கையாளப்படுகின்றன, எனவே அவற்றை நீங்களே அளவுருக்களாக சேர்க்க தேவையில்லை. `` மெய்னிமேச்`` செயல்பாட்டில் உள்ள எதையும் கோடோட்டிற்கு போர்ட்டிங் செய்யும் போது `` துண்டு` செயல்பாட்டில் நகலெடுக்க வேண்டும்.
