Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/introduction_to_shaders.po
Languages: ga, it, ja, ta, uk, zh_hant

source: Introduction to shaders
ga: Réamhrá do scáthóirí
it: Introduzione agli shader
ja: シェーダーの紹介
ta: சேடர்களுக்கு அறிமுகம்
uk: Знайомство з шейдерами
zh_hant: 著色器簡介

source: This page explains what shaders are and will give you an overview of how they work in Godot. For a detailed reference of the engine's shading language, see :ref:`doc_shading_language`.
ga: Míníonn an leathanach seo cad iad na scáthóirí agus tabharfaidh sé forbhreathnú duit ar an gcaoi a n-oibríonn siad i Godot. Le haghaidh tagairt mhionsonraithe de theanga scáthaithe an innill, féach:ref: `doc_shading_language`.
it: Questa pagina spiega cosa sono gli shader e fornisce una panoramica del loro funzionamento in Godot. Per un riferimento dettagliato al linguaggio di shading del motore, consultare :ref:`doc_shading_language`.
ja: このページではシェーダーとは何かについて説明し、Godotでシェーダーがどのように機能するかの概要を示します。エンジンのシェーディング言語の詳細なリファレンスについては、:ref:`doc_shading_lang` を参照してください。
ta: இந்த பக்கம் சேடர்கள் என்ன என்பதை விளக்குகிறது, மேலும் அவை கோடோட்டில் எவ்வாறு செயல்படுகின்றன என்பதற்கான கண்ணோட்டத்தை உங்களுக்கு வழங்கும். இயந்திரத்தின் நிழல் மொழியின் விரிவான குறிப்புக்கு, காண்க: குறிப்பு: `doc_shading_language`.
uk: На цій сторінці пояснюється, що таке шейдери, і ви дізнаєтеся, як вони працюють у Godot. Щоб отримати детальну довідку про мову затінення двигуна, перегляньте :ref:`doc_shading_language`.
zh_hant: 本頁將說明什麼是著色器，並概述其在 Godot 中的運作方式。如需引擎著色語言的詳細參考，請見 :ref:`doc_shading_language`。

source: Shaders are a special kind of program that runs on Graphics Processing Units (GPUs). They were initially used to shade 3D scenes but can nowadays do much more. You can use them to control how the engine draws geometry and pixels on the screen, allowing you to achieve all sorts of effects.
ga: Is cineál speisialta cláir iad scáthaitheoirí a ritheann ar Aonaid Phróiseála Grafaicí (GPUanna). Úsáideadh iad ar dtús chun radhairc 3D a scáthú ach is féidir leo i bhfad níos mó a dhéanamh inniu. Is féidir leat iad a úsáid chun rialú a dhéanamh ar conas a tharraingíonn an t-inneall céimseata agus picteilín ar an scáileán, rud a ligeann duit gach cineál éifeachtaí a bhaint amach.
it: Gli shader sono un tipo speciale di programma che gira sulle unità di elaborazione grafica (GPU). Inizialmente erano utilizzati per ombreggiare scene 3D, ma oggi possono fare molto di più. È possibile utilizzarli per controllare il modo in cui il motore disegna geometrie e pixel sullo schermo, permettendo di ottenere effetti di ogni tipo.
ja: シェーダーはグラフィックスプロセッシングユニット (GPU) 上で実行される特別な種類のプログラムです。当初は3Dシーンのシェーディングに使用されていましたが、現在ではさらに多くのことができるようになりました。これらを使用してエンジンが画面上にジオメトリとピクセルを描画する方法を制御し、あらゆる種類の効果を実現できます。
ta: கிராபிக்ச் செயலாக்க அலகுகளில் (சி.பீ.யூ) இயங்கும் ஒரு சிறப்பு வகையான நிரல் சேடர்கள். அவை ஆரம்பத்தில் 3D காட்சிகளை நிழலாக்கப் பயன்படுத்தப்பட்டன, ஆனால் இப்போதெல்லாம் இன்னும் பலவற்றைச் செய்ய முடியும். இயந்திரம் திரையில் வடிவியல் மற்றும் பிக்சல்களை எவ்வாறு ஈர்க்கிறது என்பதைக் கட்டுப்படுத்த நீங்கள் அவற்றைப் பயன்படுத்தலாம், இது அனைத்து வகையான விளைவுகளையும் அடைய உங்களை அனுமதிக்கிறது.
uk: Шейдери — це особливий вид програм, які працюють на графічних процесорах (GPU). Спочатку вони використовувалися для затінення 3D-сцен, але тепер можуть робити набагато більше. Ви можете використовувати їх, щоб керувати тим, як механізм малює геометрію та пікселі на екрані, дозволяючи вам досягати різноманітних ефектів.
zh_hant: 著色器（Shader）是一種在圖形處理器（GPU）上執行的特殊程式。最初是用來為 3D 場景進行著色，但現在能做的事情更多。你可以利用著色器控制引擎在螢幕上繪製幾何圖形和像素的方式，實現各種視覺特效。

source: Modern rendering engines like Godot draw everything with shaders: graphics cards can run thousands of instructions in parallel, leading to incredible rendering speed.
ga: Tarraingíonn innill rindreála nua-aimseartha cosúil le Godot gach rud le shaders: is féidir le cártaí grafaicí na mílte treoracha a rith ag an am céanna, rud a fhágann go bhfuil luas dochreidte rindreála.
it: I motori di rendering moderni come Godot disegnano tutto tramite shader: le schede grafiche possono eseguire migliaia di istruzioni in parallelo, ottenendo velocità di rendering incredibili.
ja: Godotのような最新のレンダリング エンジンは、すべてをシェーダーで描画します。グラフィックスカードは何千もの命令を並行して実行できるため、驚異的なレンダリング速度が実現します。
ta: கோடோட் போன்ற நவீன வழங்குதல் என்சின்கள் எல்லாவற்றையும் சேடர்களால் ஈர்க்கின்றன: கிராபிக்ச் கார்டுகள் ஆயிரக்கணக்கான வழிமுறைகளை இணையாக இயக்க முடியும், இது நம்பமுடியாத வழங்குதல் வேகத்திற்கு வழிவகுக்கும்.
uk: Сучасні механізми візуалізації, такі як Godot, малюють усе за допомогою шейдерів: графічні карти можуть виконувати тисячі інструкцій паралельно, що забезпечує неймовірну швидкість візуалізації.
zh_hant: 現代的繪圖引擎（如 Godot）都是透過著色器來繪製畫面：顯示卡能夠同時並行執行數千條指令，帶來極快的算繪速度。

source: Because of their parallel nature, though, shaders don't process information the way a typical program does. Shader code runs on each vertex or pixel in isolation. You cannot store data between frames either. As a result, when working with shaders, you need to code and think differently from other programming languages.
ga: Mar gheall ar a nádúr comhthreomhar, áfach, ní phróiseálann scáthóirí faisnéis mar a dhéanann gnáthchlár. Ritheann cód Shader ar gach vertex nó picteilín ina n-aonar. Ní féidir leat sonraí a stóráil idir frámaí ach an oiread. Mar thoradh air sin, agus tú ag obair le scáthóirí, ní mór duit cóid a dhéanamh agus smaoineamh ar bhealach difriúil ó theangacha cláir eile.
it: A causa della loro natura parallela, tuttavia, gli shader non elaborano le informazioni come fa un tipico programma. Il codice di shader è eseguito su ogni vertice o pixel in maniera isolata. Non è possibile memorizzare dati tra i frame. Pertanto, quando si lavora con gli shader, è necessario programmare e pensare in modo diverso rispetto agli altri linguaggi di programmazione.
ja: ただしシェーダーは並列的な性質があるため、一般的なプログラムのように情報を処理しません。シェーダーコードは各頂点または各ピクセル上で個別に実行されます。フレーム間にデータを保存することもできません。そのためシェーダーを使用する場合は、他のプログラミング言語とは異なるコーディングと考え方が必要になります。
ta: அவற்றின் இணையான இயல்பு காரணமாக, சேடர்கள் ஒரு பொதுவான நிரல் செய்யும் விதத்தில் தகவல்களை செயலாக்காது. சேடர் குறியீடு ஒவ்வொரு வெர்டெக்ச் அல்லது பிக்சலில் தனிமையில் இயங்குகிறது. பிரேம்களுக்கு இடையில் தரவை நீங்கள் சேமிக்க முடியாது. இதன் விளைவாக, சேடர்களுடன் பணிபுரியும் போது, நீங்கள் மற்ற நிரலாக்க மொழிகளிலிருந்து வித்தியாசமாக சிந்திக்க வேண்டும்.
uk: Однак через свою паралельну природу шейдери не обробляють інформацію так, як це робить типова програма. Код шейдера виконується на кожній вершині або пікселі окремо. Ви також не можете зберігати дані між кадрами. Як наслідок, під час роботи з шейдерами вам потрібно кодувати та мислити інакше, ніж інші мови програмування.
zh_hant: 由於著色器本質上是並行運算，處理資訊的方式與一般程式不同。著色器的程式碼會獨立地在每個頂點或像素上執行，且無法在畫格間儲存資料。因此，撰寫著色器時，需要用不同於其他程式語言的思維與方式進行設計。

source: Suppose you want to update all the pixels in a texture to a given color. In GDScript, your code would use ``for`` loops::
ga: Cuir i gcás gur mhaith leat na picteilíní go léir in uigeacht a nuashonrú go dath ar leith. I GDScript, úsáidfeadh do chód lúbanna ``for``:
ja: 例えばテクスチャ内のすべてのピクセルを特定の色にセットするとします。 GDScriptのコードでは ``for`` ループを使用します::
ta: கொடுக்கப்பட்ட வண்ணத்திற்கு அனைத்து பிக்சல்களையும் ஒரு அமைப்பில் புதுப்பிக்க விரும்புகிறீர்கள் என்று வைத்துக்கொள்வோம். GDSCRIPT இல், உங்கள் குறியீடு `` `சுழல்களுக்கு :: ஐப் பயன்படுத்தும் ::
uk: Припустімо, ви хочете оновити всі пікселі в текстурі до певного кольору. У GDScript ваш код використовуватиме цикли ``for``::

source: Your code is already part of a loop in a shader, so the corresponding code would look like this.
ga: Tá do chód mar chuid de lúb i scáthóir cheana féin, mar sin bheadh cuma seo ar an gcód comhfhreagrach.
it: Il tuo codice fa già parte di un ciclo in uno shader, quindi il codice corrispondente avrà questo aspetto.
ja: シェーダーではコードはすでにループの一部であるため、実際に書くコードは次のようになります。
ta: உங்கள் குறியீடு ஏற்கனவே ஒரு சேடரில் ஒரு வளையத்தின் ஒரு பகுதியாகும், எனவே தொடர்புடைய குறியீடு இப்படி இருக்கும்.
uk: Ваш код уже є частиною циклу в шейдері, тому відповідний код виглядатиме так.
zh_hant: 而在著色器中，你的程式碼本身就處於一個迴圈中，所以對應的寫法會像這樣。

source: The graphics card calls the ``fragment()`` function once or more for each pixel it has to draw. More on that below.
ga: Glaonn an cárta grafaicí an fheidhm ``fragment () ``uair amháin nó níos mó do gach picteilín a chaithfidh sé a tharraingt. Tuilleadh faoi sin thíos.
it: La scheda grafica richiama la funzione ``fragment()`` una o più volte per ogni pixel che deve disegnare. Ne riparleremo più avanti.
ja: グラフィックスカードは描画するピクセルごとに ``fragment()`` 関数を1回以上呼び出します。詳細については以下をご覧ください。
ta: கிராபிக்ச் அட்டை `` துண்டு () `` ஒவ்வொரு பிக்சலுக்கும் ஒரு முறை அல்லது அதற்கு மேற்பட்ட செயல்பாட்டை அது வரைய வேண்டும். மேலும் கீழே.
uk: Відеокарта викликає функцію ``fragment()`` один або кілька разів для кожного пікселя, який вона має намалювати. Детальніше про це нижче.
zh_hant: 顯示卡會針對每個需要繪製的像素呼叫一次或多次 ``fragment()`` 函式。詳細說明請參見下文。

source: Shaders in Godot
ga: Shaders i Godot
it: Shader in Godot
ja: Godotのシェーダー
ta: கோடோட்டில் சேடர்கள்
uk: Шейдери в Godot
zh_hant: Godot 中的著色器

source: Godot provides a shading language based on the popular OpenGL Shading Language (GLSL) but simplified. The engine handles some of the lower-level initialization work for you, making it easier to write complex shaders.
ga: Soláthraíonn Godot teanga scáthaithe bunaithe ar an Teanga Shading OpenGL (GLSL) móréilimh ach simplithe. Láimhseálann an t-inneall cuid de na hoibre tionscnaíochta ar leibhéal níos ísle duit, rud a fhágann go bhfuil sé níos éasca scáthóirí casta a scríobh.
it: Godot fornisce un linguaggio di shading basato sul popolare OpenGL Shading Language (GLSL), ma semplificato. Il motore gestisce parte del lavoro di inizializzazione di basso livello, il che facilita la scrittura di shader complessi.
ja: Godotは一般的なOpenGL Shading Language (GLSL)に基づいて簡略化されたシェーディング言語を提供します。このエンジンは低レイヤーの初期化作業の一部を代替してくれるため、ユーザーは複雑なシェーダーの作成が容易になります。
ta: கோடோட் பிரபலமான ஓபன்சிஎல் நிழல் மொழியை (சி.எல்.எச்.எல்) அடிப்படையாகக் கொண்ட ஒரு நிழல் மொழியை வழங்குகிறது, ஆனால் எளிமைப்படுத்தப்பட்டது. இயந்திரம் உங்களுக்காக சில கீழ்-நிலை துவக்க வேலைகளை கையாளுகிறது, இதனால் சிக்கலான சேடர்களை எழுதுவதை எளிதாக்குகிறது.
uk: Godot пропонує мову затінення на основі популярної мови затінення OpenGL (GLSL), але спрощену. Механізм виконує частину роботи з ініціалізації нижчого рівня за вас, полегшуючи написання складних шейдерів.
zh_hant: Godot 提供的著色語言是基於廣泛使用的 OpenGL Shading Language（GLSL）所簡化而成。引擎會自動處理部分底層初始化作業，使你能更輕鬆地撰寫複雜的著色器。

source: In Godot, shaders are made up of main functions called "processor functions". Processor functions are the entry point for your shader into the program. There are seven different processor functions.
ga: I Godot, tá shaders comhdhéanta de phríomhfheidhmeanna ar a dtugtar "feidhmeanna próiseálaí". Is iad feidhmeanna próiseálaí an pointe iontrála do scáthóir isteach sa chlár. Tá seacht bhfeidhm próiseálaithe éagsúla ann.
it: In Godot, gli shader sono composti da funzioni principali chiamate "funzioni di processore". Le funzioni di processore rappresentano il punto di ingresso dello shader nel programma. Esistono sette diverse funzioni di processore.
ja: Godotではシェーダーは「プロセッサー関数」と呼ばれる主要な関数で構成されています。プロセッサー関数はシェーダープログラムへのエントリーポイントです。Godotシェーダーには7つの異なるプロセッサー関数があります。
ta: கோடோட்டில், சேடர்கள் "செயலி செயல்பாடுகள்" எனப்படும் முக்கிய செயல்பாடுகளால் ஆனவை. செயலி செயல்பாடுகள் உங்கள் சேடருக்கு நிரலில் நுழைவு புள்ளியாகும். ஏழு வெவ்வேறு செயலி செயல்பாடுகள் உள்ளன.
uk: У Godot шейдери складаються з основних функцій, які називаються «функціями процесора». Функції процесора є точкою входу для вашого шейдера в програму. Існує сім різних функцій процесора.
zh_hant: 在 Godot 中，著色器由稱為「處理函式」的主函式組成。處理函式是著色器程式的進入點。共有七種不同的處理函式。

source: The ``vertex()`` function runs over all the vertices in the mesh and sets their positions and some other per-vertex variables. Used in :ref:`canvas_item shaders <doc_canvas_item_shader>` and :ref:`spatial shaders <doc_spatial_shader>`.
ga: Ritheann an fheidhm `` rinn()`` thar na rinn go léir sa mhogall agus socraíonn sí a suíomhanna agus roinnt athróg in aghaidh an rinn eile. Úsáidte i :ref:`canvas_item shaders <doc_canvas_item_shader>` agus :ref:`scáthaitheoirí spáis <doc_spatial_shader>`.
it: La funzione ``vertex()`` è eseguita su tutti i vertici della mesh e ne imposta la posizione e altre variabili per ogni vertice. Utilizzata negli shader :ref:`canvas_item <doc_canvas_item_shader>` e negli shader :ref:`spatial <doc_spatial_shader>`.
ja: ``vertex()`` 関数はメッシュ内のすべての頂点に対して実行され、頂点の位置と他の変数を設定します。 :ref:`CanvasItemシェーダー<doc_canvas_item_shader>` および :ref:`Spatial(空間)シェーダー <doc_spatial_shader>` で使用されます。
ta: `` வெர்டெக்ச் () `` செயல்பாடு கண்ணி நகரில் உள்ள அனைத்து செங்குத்துகளுக்கும் மேலாக இயங்குகிறது மற்றும் அவற்றின் நிலைகள் மற்றும் வேறு சில பெர்டெக்ச் மாறிகள் ஆகியவற்றை அமைக்கிறது. இதில் பயன்படுத்தப்படுகிறது: ref: `Canvas_item சேடர்கள் <doc_canvas_item_shader>` மற்றும்: ref: `இடஞ்சார்ந்த சேடர்கள் <doc_spatial_shader>`.
uk: Функція ``vertex()`` виконується по всіх вершинах сітки та встановлює їхні положення, а також деякі інші змінні для кожної вершини. Використовується в :ref:`canvas_item shaders <doc_canvas_item_shader>` та :ref:`spatial shaders <doc_spatial_shader>`.
zh_hant: ``vertex()`` 函式會針對網格中的所有頂點執行，並設定頂點的位置及其他每個頂點專屬的變數。用於 :ref:`canvas_item 著色器 <doc_canvas_item_shader>` 與 :ref:`空間著色器 <doc_spatial_shader>`。

source: The ``fragment()`` function runs for every pixel covered by the mesh. It uses values output by the ``vertex()`` function, interpolated between the vertices. Used in :ref:`canvas_item shaders <doc_canvas_item_shader>` and :ref:`spatial shaders <doc_spatial_shader>`.
ga: Ritheann an fheidhm ``broinn()`` do gach picteilín atá clúdaithe ag an mogalra. Úsáideann sé aschur luachanna leis an bhfeidhm `` rinn()``, idirshuite idir na rinn. Úsáidte i :ref:`canvas_item shaders <doc_canvas_item_shader>` agus :ref:`scáthaitheoirí spáis <doc_spatial_shader>`.
it: La funzione ``fragment()`` è eseguita per ogni pixel coperto dalla mesh. Utilizza i valori generati dalla funzione ``vertex()``, interpolati tra i vertici. Utilizzata negli shader :ref:`canvas_item <doc_canvas_item_shader>` e negli shader :ref:`spatial <doc_spatial_shader>`.
ja: ``fragment()`` 関数はメッシュで覆われているすべてのピクセルに対して実行されます。これは ``vertex()`` 関数によって出力した値が頂点間で補間された値を使用します。 :ref:`CanvasItemシェーダー<doc_canvas_item_shader>` および :ref:`Spatial(空間)シェーダー <doc_spatial_shader>` で使用されます。
ta: கண்ணி மூலம் மூடப்பட்ட ஒவ்வொரு பிக்சலுக்கும் `` துண்டு () `` செயல்பாடு இயங்குகிறது. இது `` வெர்டெக்ச் () `` செயல்பாட்டின் மூலம் மதிப்புகள் வெளியீட்டைப் பயன்படுத்துகிறது, இது செங்குத்துகளுக்கு இடையில் இடைக்கணிக்கப்பட்டுள்ளது. இதில் பயன்படுத்தப்படுகிறது: ref: `Canvas_item சேடர்கள் <doc_canvas_item_shader>` மற்றும்: ref: `இடஞ்சார்ந்த சேடர்கள் <doc_spatial_shader>`.
uk: Функція ``fragment()`` виконується для кожного пікселя, покритого сіткою. Вона використовує значення, виведені функцією ``vertex()``, інтерпольовані між вершинами. Використовується в :ref:`canvas_item shaders <doc_canvas_item_shader>` та :ref:`spatial shaders <doc_spatial_shader>`.
zh_hant: ``fragment()`` 函式會針對網格所覆蓋的每一個像素執行。它會使用 ``vertex()`` 函式所輸出的值，並對頂點間的數據進行插值。用於 :ref:`canvas_item 著色器 <doc_canvas_item_shader>` 及 :ref:`空間著色器 <doc_spatial_shader>`。

source: The ``light()`` function runs for every pixel and for every light. It takes variables from the ``fragment()`` function and from its previous runs. Used in :ref:`canvas_item shaders <doc_canvas_item_shader>` and :ref:`spatial shaders <doc_spatial_shader>`.
ga: Ritheann an fheidhm `` solas ()`` do gach picteilín agus do gach solas. Tógann sé athróga ón bhfeidhm `` blúirín ()`` agus óna ritheann roimhe seo. Úsáidte i :ref:`canvas_item shaders <doc_canvas_item_shader>` agus :ref:`scáthaitheoirí spáis <doc_spatial_shader>`.
it: La funzione ``light()`` è eseguita per ogni pixel e per ogni luce. Prende le variabili dalla funzione ``fragment()`` e dalle sue esecuzioni precedenti. Utilizzata negli shader :ref:`canvas_item <doc_canvas_item_shader>` e negli shader :ref:`spatial <doc_spatial_shader>`.
ja: ``light()`` 関数はすべてのピクセルおよびすべてのライトに対して実行されます。これは ``fragment()`` 関数とその以前の実行から変数を受け取ります。 :ref:`CanvasItemシェーダー<doc_canvas_item_shader>` および :ref:`Spatial(空間)シェーダー <doc_spatial_shader>` で使用されます。
ta: `` ஒளி () `` செயல்பாடு ஒவ்வொரு பிக்சலுக்கும் ஒவ்வொரு ஒளிக்கும் இயங்கும். இது `` துண்டு () `` செயல்பாட்டிலிருந்தும் அதன் முந்தைய ரன்களிலிருந்தும் மாறிகள் எடுக்கும். இதில் பயன்படுத்தப்படுகிறது: ref: `Canvas_item சேடர்கள் <doc_canvas_item_shader>` மற்றும்: ref: `இடஞ்சார்ந்த சேடர்கள் <doc_spatial_shader>`.
uk: Функція ``light()`` виконується для кожного пікселя та для кожного джерела світла. Вона приймає змінні з функції ``fragment()`` та з її попередніх запусків. Використовується в :ref:`canvas_item shaders <doc_canvas_item_shader>` та :ref:`spatial shaders <doc_spatial_shader>`.
zh_hant: ``light()`` 函式會針對每個像素、每盞燈光各執行一次。它會取得來自 ``fragment()`` 函式及之前執行過的變數。用於 :ref:`canvas_item 著色器 <doc_canvas_item_shader>` 和 :ref:`空間著色器 <doc_spatial_shader>`。

source: The ``start()`` function runs for every particle in a particle system once when the particle is first spawned. Used in :ref:`particles shaders <doc_particle_shader>`.
ga: Ritheann an fheidhm ``start()`` do gach cáithnín i gcóras cáithníní uair amháin nuair a sceithtear an cáithnín den chéad uair. Úsáidte i :ref:`scáthairí cáithníní <doc_particle_shader>`.
it: La funzione ``start()`` è eseguita una volta per ogni particella in un sistema di particelle quando la particella viene generata. Utilizzata negli :ref:`shader di particelle <doc_particle_shader>`.
ja: ``start()`` 関数はパーティクルが最初に生成されるときに、パーティクル システム内のすべてのパーティクルに対して1回実行されます。 :ref:`パーティクルシェーダー <doc_particle_shader>` で使用されます。
ta: துகள் முதலில் உருவாகும் போது ஒரு முறை ஒரு துகள் அமைப்பில் உள்ள ஒவ்வொரு துகள்களுக்கும் `` தொடக்க () `` செயல்பாடு இயங்குகிறது. பயன்படுத்தப்படுகிறது: ref: `துகள்கள் சேடர்கள் <doc_particle_shader>`.
uk: Функція ``start()`` запускається для кожної частинки в системі частинок один раз, коли частинка вперше породжується. Використовується в :ref:`particles shaders <doc_particle_shader>`.
zh_hant: ``start()`` 函式會在粒子系統中每個粒子首次生成時執行一次。用於 :ref:`粒子著色器 <doc_particle_shader>`。

source: The ``process()`` function runs for every particle in a particle system for each frame. Used in :ref:`particles shaders <doc_particle_shader>`.
ga: Ritheann an fheidhm ``proiseas()`` do gach cáithnín i gcóras cáithníní do gach fráma. Úsáidte i :ref:`scáthairí cáithníní <doc_particle_shader>`.
it: La funzione ``process()`` è eseguita per ogni particella in un sistema di particelle a ogni frame. Utilizzata negli :ref:`shader di particelle <doc_particle_shader>`.
ja: ``process()`` 関数はフレームごとにパーティクルシステム内のすべてのパーティクルに対して実行されます。 :ref:`パーティクルシェーダー <doc_particle_shader>` で使用されます。
ta: ஒவ்வொரு சட்டகத்திற்கும் ஒரு துகள் அமைப்பில் உள்ள ஒவ்வொரு துகள்களுக்கும் `` செயல்முறை () `` செயல்பாடு இயங்குகிறது. பயன்படுத்தப்படுகிறது: ref: `துகள்கள் சேடர்கள் <doc_particle_shader>`.
uk: Функція ``process()`` запускається для кожної частинки в системі частинок для кожного кадру. Використовується в :ref:`particles shaders <doc_particle_shader>`.
zh_hant: ``process()`` 函式會在每個影格中，針對粒子系統內的每個粒子執行一次。用於 :ref:`粒子著色器 <doc_particle_shader>`。

source: The ``sky()`` function runs for every pixel in the radiance cubemap when the radiance cubemap needs to be updated, and for every pixel on the current screen. Used in :ref:`sky shaders <doc_sky_shader>`.
ga: Ritheann an fheidhm ``spéir()`` le haghaidh gach picteilín sa léarscáil ciúb gathach nuair is gá an léarscáil ciúba radiance a nuashonrú, agus le haghaidh gach picteilín ar an scáileán reatha. Úsáidte i :ref:`sky shaders <doc_sky_shader>`.
it: La funzione ``sky()`` è eseguita per ogni pixel nella cubemap di radianza quando è necessario aggiornarla e per ogni pixel sullo schermo attuale. Utilizzata negli :ref:`shader del cielo <doc_sky_shader>`.
ja: ``sky()`` 関数は、放射キューブマップを更新する必要がある場合、放射キューブマップ内のすべてのピクセルに対して実行され、また現在の画面上のすべてのピクセルに対して実行されます。 :ref:`スカイシェーダー <doc_sky_shader>` で使用されます。
ta: ரேடியன்ச் க்யூப்மேப்பை புதுப்பிக்க வேண்டியிருக்கும் போது `` ச்கை () `` செயல்பாடு ரேடியன்ச் க்யூபேமேப்பில் உள்ள ஒவ்வொரு பிக்சலுக்கும் இயங்கும், தற்போதைய திரையில் உள்ள ஒவ்வொரு பிக்சலுக்கும். பயன்படுத்தப்படுகிறது: குறிப்பு: `ச்கை சேடர்ச் <doc_sky_shader>`.
uk: Функція ``sky()`` запускається для кожного пікселя в кубічній карті радіації, коли її потрібно оновити, а також для кожного пікселя на поточному екрані. Використовується в :ref:`sky shaders <doc_sky_shader>`.
zh_hant: ``sky()`` 函式會在輻射度立方體貼圖需要更新時，針對貼圖中的每個像素執行，也會在目前螢幕上的每個像素執行。用於 :ref:`天空著色器 <doc_sky_shader>`。

source: The ``fog()`` function runs for every froxel in the volumetric fog froxel buffer that intersects with the :ref:`FogVolume <class_FogVolume>`. Used by :ref:`fog shaders <doc_fog_shader>`.
ga: Ritheann an fheidhm `` ceo()`` do gach froxel sa mhaolán toirtmhéadrach froxel ceo a thrasnaíonn an :ref:`FogVolume <class_FogVolume>`. Arna úsáid ag :ref:`fog shaders <doc_fog_shader>`.
it: La funzione ``fog()`` è eseguita per ogni froxel nel buffer dei froxel della nebbia volumetrica che interseca un :ref:`FogVolume <class_FogVolume>`. Utilizzata dagli :ref:`shader della nebbia <doc_fog_shader>`.
ja: ``fog()`` 関数は、:ref:`フォグボリューム <class_FogVolume>` と交差するボリューメトリックフォグのフロクセルバッファ内のすべてのフロクセルに対して実行されます。 :ref:`フォグシェーダー <doc_fog_shader>` によって使用されます。
ta: `` மூடுபனி () `` செயல்பாடு ஒவ்வொரு ஃப்ராக்சலுக்கும் வால்யூமெட்ரிக் மூடுபனி ஃப்ராக்சல் பஃப்பரில் இயங்குகிறது: ref: `fogvolume <class_fogvolume>`. பயன்படுத்தியவர்: ref: `மூடுபனி சேடர்கள் <doc_fog_shader>`.
uk: Функція ``fog()`` виконується для кожного фрокселя в об’ємному буфері фрокселя туману, який перетинається з :ref:`FogVolume <class_FogVolume>`. Використовується :ref:`fog shaders <doc_fog_shader>`.
zh_hant: ``fog()`` 函式會針對體積霧片段體素緩衝區中，與 :ref:`FogVolume <class_FogVolume>` 相交的每個體素執行。用於 :ref:`霧著色器 <doc_fog_shader>`。

source: The ``light()`` function won't run if the ``vertex_lighting`` render mode is enabled, or if **Rendering > Quality > Shading > Force Vertex Shading** is enabled in the Project Settings. It's enabled by default on mobile platforms.
ga: Ní rithfidh an fheidhm `` solas ()`` má tá an modh rindreála `` vertex_lighting`` cumasaithe, nó má tá ** Rindreáil > Cáilíocht > Scáthú > Scáthú Vertex Fórsa** cumasaithe i Socruithe an Tionscadail. Tá sé cumasaithe de réir réamhshocraithe ar ardáin soghluaiste.
it: La funzione ``light()`` non sarà eseguita se la modalità di rendering ``vertex_lighting`` è abilitata o se **Rendering > Quality > Shading > Force Vertex Shading** è abilitata nelle Impostazioni del progetto. È abilitata in modo predefinito sulle piattaforme mobili.
ja: ``vertex_lighting`` レンダー モードが有効になっている場合、またはプロジェクト設定で [レンダリング] > [品質] > [シェーディング] > [頂点シェーディングの強制] が有効になっている場合、 ``light()`` 関数は実行されません。モバイル プラットフォームではデフォルトで有効になっています。
ta: `` Vertex_lighting`` வழங்குதல் பயன்முறை இயக்கப்பட்டிருந்தால், அல்லது திட்ட அமைப்புகளில் ** ரெண்டரிங்> தரம்> நிழல்> ஃபோர்ச் வெர்டெக்ச் நிழல் ** இயக்கப்பட்டிருந்தால் `` ஒளி () `` செயல்பாடு இயங்காது. இது மொபைல் தளங்களில் இயல்பாக இயக்கப்பட்டது.
uk: Функція ``light()`` не працюватиме, якщо ввімкнено режим візуалізації ``vertex_lighting`` або якщо в налаштуваннях проекту ввімкнено **Відтворення > Якість > Затінення > Примусове затінення вершини**. Він увімкнено за замовчуванням на мобільних платформах.
zh_hant: 如果啟用了 ``vertex_lighting`` 算繪模式，或在專案設定中啟用了 **Rendering > Quality > Shading > Force Vertex Shading** （算繪 > 品質 > 著色 > 強制頂點著色），則 ``light()`` 函式將不會執行。在行動平台上預設啟用此設定。
