Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/introduction_to_shaders.po
Languages: ga, it, ja, ta, uk, zh_hant

source: Godot also exposes an API for users to write totally custom GLSL shaders. For more information see :ref:`doc_compute_shaders`.
ga: Nochtann Godot API freisin d'úsáideoirí scáthóirí GLSL go hiomlán saincheaptha a scríobh. Le haghaidh tuilleadh faisnéise féach:ref: `doc_compute_shaders`.
it: Godot espone anche un'API che consente agli utenti di scrivere shader GLSL totalmente personalizzati. Per maggiori informazioni, consultare :ref:`doc_compute_shaders`.
ja: Godot はユーザーが完全にカスタムの GLSL シェーダを作成できるAPIも公開しています。詳細については、:ref:`doc_compute_shaders` を参照してください。
ta: பயனர்கள் முற்றிலும் தனிப்பயன் சி.எல்.எச்.எல் சேடர்களை எழுதுவதற்கு கோடோட் ஒரு பநிஇ அம்பலப்படுத்துகிறார். மேலும் தகவலுக்கு காண்க: ref: `doc_compute_shaders`.
uk: Godot також надає користувачам API для написання повністю власних шейдерів GLSL. Для отримання додаткової інформації див. :ref:`doc_compute_shaders`.
zh_hant: Godot 也提供 API 讓使用者撰寫完全自訂的 GLSL 著色器。詳情請參閱 :ref:`doc_compute_shaders`。

source: Shader types
ga: Cineálacha scádaithe
it: Tipi di shader
ja: シェーダーの種類
ta: சேடர் வகைகள்
uk: Типи шейдерів
zh_hant: 著色器類型

source: Instead of supplying a general-purpose configuration for all uses (2D, 3D, particles, sky, fog), you must specify the type of shader you're writing. Different types support different render modes, built-in variables, and processing functions.
ga: In ionad cumraíocht ilfhóinteach a sholáthar do gach úsáid (2D, 3D, cáithníní, spéir, ceo), ní mór duit an cineál scáthóir atá á scríobh agat a shonrú. Tacaíonn cineálacha éagsúla le modhanna rindreála éagsúla, athróga ionsuite, agus feidhmeanna próiseála.
it: Invece di fornire una configurazione generica per tutti gli usi (2D, 3D, particelle, cielo, nebbia), è necessario specificare il tipo di shader che si sta scrivendo. Diversi tipi supportano diverse modalità di rendering, variabili integrate e funzioni di elaborazione.
ja: すべての用途 (2D、3D、パーティクル、スカイ、フォグ) に汎用的な設定を提供する代わりに、Godotシェーダーは目的を指定する必要があります。タイプが異なれば、サポートされるレンダリング モード、ビルトイン変数、プロセッサー関数も異なります。
ta: எல்லா பயன்பாடுகளுக்கும் (2 டி, 3 டி, துகள்கள், வானம், மூடுபனி) ஒரு பொது நோக்க கட்டமைப்பை வழங்குவதற்கு பதிலாக, நீங்கள் எழுதும் சேடரின் வகையை நீங்கள் குறிப்பிட வேண்டும். வெவ்வேறு வகைகள் வெவ்வேறு வழங்குதல் முறைகள், உள்ளமைக்கப்பட்ட மாறிகள் மற்றும் செயலாக்க செயல்பாடுகளை ஆதரிக்கின்றன.
uk: Замість надання конфігурації загального призначення для всіх видів використання (2D, 3D, частинки, небо, туман), ви повинні вказати тип шейдера, який ви пишете. Різні типи підтримують різні режими візуалізації, вбудовані змінні та функції обробки.
zh_hant: 著色器不提供一個適用於所有用途（2D、3D、粒子、天空、霧）的通用型配置，你必須明確指定要編寫的著色器類型。不同類型支援的算繪模式、內建變數與處理函式也都不同。

source: In Godot, all shaders need to specify their type in the first line, like so:
ga: I Godot, ní mór do gach scáthóir a gcineál a shonrú sa chéad líne, mar sin:
it: In Godot, tutti gli shader devono specificare il loro tipo nella prima riga, così:
ja: Godotではすべてのシェーダーは、最初の行で次の形式でタイプを指定する必要があります:
ta: கோடோட்டில், அனைத்து சேடர்களும் அவற்றின் வகையை முதல் வரியில் குறிப்பிட வேண்டும், அவ்வாறு:
uk: У Godot усі шейдери повинні вказувати свій тип у першому рядку, наприклад:
zh_hant: 在 Godot 中，所有著色器必須在第一行就指定其類型，例如：

source: Here are the available types:
ga: Seo iad na cineálacha atá ar fáil:
it: Ecco i tipi disponibili:
ja: 利用可能なタイプは次のとおりです。
ta: கிடைக்கக்கூடிய வகைகள் இங்கே:
uk: Ось доступні типи:
zh_hant: 可用的類型如下：

source: :ref:`spatial <doc_spatial_shader>` for 3D rendering.
ga: :ref:`spatial <doc_spatial_shader>` le haghaidh rindreáil 3D.
it: :ref:`spatial <doc_spatial_shader>` per il rendering 3D.
ja: :ref:`spatial <doc_spatial_shader>`: 3Dレンダリング用。
ta: : ref: `இடஞ்சார்ந்த <doc_spatial_shader>` 3D ரெண்டரிங்கிற்கு.
uk: :ref:`spatial <doc_spatial_shader>` для 3D візуалізації.
zh_hant: :ref:`spatial <doc_spatial_shader>` 用於 3D 算繪。

source: :ref:`canvas_item <doc_canvas_item_shader>` for 2D rendering.
ga: :ref:`canvas_item <doc_canvas_item_shader>`le haghaidh rindreáil 2D.
it: :ref:`canvas_item <doc_canvas_item_shader>` per il rendering 2D.
ja: :ref:`canvas_item <doc_canvas_item_shader>`: 2Dレンダリング用。
ta: :ref:`canvas_item <doc_canvas_item_shader>` க்கு 2D rendering.
uk: :ref:`canvas_item <doc_canvas_item_shader>` для 2D візуалізації.
zh_hant: :ref:`canvas_item <doc_canvas_item_shader>` 用於 2D 算繪。

source: :ref:`particles <doc_particle_shader>` for particle systems.
ga: :ref:`particles <doc_particle_shader>` le haghaidh córais cháithníní.
it: :ref:`particles <doc_particle_shader>` per i sistemi di particelle.
ja: :ref:`particles <doc_particle_shader>`: パーティクルシステム用。
ta: : குறிப்பு: துகள் அமைப்புகளுக்கு `துகள்கள் <doc_particle_shader>`.
uk: :ref:`particles <doc_particle_shader>` для систем частинок.
zh_hant: :ref:`particles <doc_particle_shader>` 用於粒子系統。

source: :ref:`sky <doc_sky_shader>` to render :ref:`Skies <class_Sky>`.
it: :ref:`sky <doc_sky_shader>` per renderizzare :ref:`cieli <class_Sky>`.
ja: :ref:`sky <doc_sky_shader>`: :ref:`Sky(3D背景) <class_Sky>` の描画用。
ta: : சிவப்பு: `ச்கை <டாக்_ச்கி சேடர்>` வழங்க: குறிப்பு: `வானம் <வகுப்பு வானம்>`.
uk: :ref:`sky <doc_sky_shader>` рендерити :ref:`Skies <class_Sky>`.
zh_hant: :ref:`sky <doc_sky_shader>` 用於算繪 :ref:`Skies <class_Sky>`。

source: :ref:`fog <doc_fog_shader>` to render :ref:`FogVolumes <class_FogVolume>`
it: :ref:`fog <doc_fog_shader>` per renderizzare :ref:`FogVolumes <class_FogVolume>`
ja: :ref:`fog <doc_fog_shader>`: :ref:`FogVolumes(ボリューメトリック フォグ) <class_FogVolume>` の描画用
ta: :ref:`fog <doc_fog_shader>` பெறுநர் render :ref:`FogVolumes <class_FogVolume>`
uk: :ref:`fog <doc_fog_shader>` для відтворення :ref:`FogVolumes <class_FogVolume>`
zh_hant: :ref:`fog <doc_fog_shader>` 用於算繪 :ref:`FogVolumes <class_FogVolume>`

source: Render modes
ga: Modhanna rindreála
it: Modalità di rendering
ja: レンダリングモード
ta: முறைகளை வழங்கவும்
uk: Режими візуалізації
zh_hant: 算繪模式

source: Shaders have optional render modes you can specify on the second line, after the shader type, like so:
ga: Tá modhanna rindreála roghnacha ag scáthraithe is féidir leat a shonrú ar an dara líne, tar éis an chineál scáthaire, mar sin:
it: Gli shader hanno modalità di rendering opzionali che si possono specificare sulla seconda riga, dopo il tipo di shader, così:
ja: シェーダーにはレンダリングモードのオプションがあり、次のようにシェーダータイプの後の2行目以降で指定できます。
ta: சேடர்கள் விருப்ப வழங்குதல் முறைகளைக் கொண்டுள்ளன, நீங்கள் இரண்டாவது வரியில் குறிப்பிடலாம், சேடர் வகைக்குப் பிறகு, அவ்வாறு:
uk: Шейдери мають додаткові режими візуалізації, які можна вказати у другому рядку після типу шейдера, наприклад:
zh_hant: 著色器可以在第二行（類型之後）指定可選的算繪模式，例如：

source: Render modes alter the way Godot applies the shader. For example, the ``unshaded`` mode makes the engine skip the built-in light processor function.
ga: Athraíonn modhanna rindreála an bealach a chuireann Godot an scáthóir i bhfeidhm. Mar shampla, cuireann an modh `unshaded` ar an inneall an fheidhm próiseálaí solais ionsuite scipeáil.
it: Le modalità di rendering alterano il modo in cui Godot applica lo shader. Ad esempio, la modalità ``unshaded`` fa ignorare al motore la funzione integrata di processore della luce.
ja: レンダリングモードはGodotがシェーダーを適用する方法を変更します。たとえば ``unshaded`` モードでは、エンジンは内蔵のライトプロセッサー機能をスキップします。
ta: கோடோட் சேடரைப் பயன்படுத்தும் விதத்தை வழங்குதல் முறைகள் மாற்றுகின்றன. எடுத்துக்காட்டாக, `` மாற்றப்படாத`` பயன்முறை இயந்திரத்தை உள்ளமைக்கப்பட்ட ஒளி செயலி செயல்பாட்டைத் தவிர்க்க வைக்கிறது.
uk: Режими візуалізації змінюють спосіб застосування шейдера Godot. Наприклад, у режимі ``unshaded`` механізм пропускає вбудовану функцію світлового процесора.
zh_hant: 算繪模式會改變 Godot 如何應用著色器的方式。例如，``unshaded`` 模式會讓引擎略過內建的光照處理函式。

source: Each shader type has different render modes. See the reference for each shader type for a complete list of render modes.
ga: Tá modhanna rindreála éagsúla ag gach cineál scáthaire. Féach an tagairt do gach cineál scáthraithe le haghaidh liosta iomlán modhanna rindreála.
it: Ogni tipo di shader ha diverse modalità di rendering. Consultare il riferimento di ogni tipo di shader per una lista completa delle modalità di rendering.
ja: 各シェーダータイプには異なるレンダリング モードがあります。レンダリングモードの完全なリストについては、各シェーダータイプのリファレンスを参照してください。
ta: ஒவ்வொரு சேடர் வகையிலும் வெவ்வேறு வழங்குதல் முறைகள் உள்ளன. வழங்குதல் முறைகளின் முழுமையான பட்டியலுக்கு ஒவ்வொரு சேடர் வகைக்கும் குறிப்பைக் காண்க.
uk: Кожен тип шейдера має різні режими візуалізації. Повний список режимів візуалізації див. у довідці для кожного типу шейдера.
zh_hant: 每種著色器類型支援的算繪模式各不相同，詳情請參考各類型的文件。

source: Vertex processor
ga: Próiseálaí Vertex
ja: 頂点プロセッサー
ta: வெர்டெக்ச் செயலி
uk: Вершиний процесор
zh_hant: 頂點處理器

source: The ``vertex()`` processing function is called once for every vertex in ``spatial`` and ``canvas_item`` shaders.
ga: Tugtar an fheidhm phróiseála ``vertex () ``uair amháin do gach ceann i scáthairí ``spatial`` agus `canvas_item``.
it: La funzione di elaborazione ``vertex()`` è chiamata una volta per ogni vertice negli shader ``spatial`` e ``canvas_item``.
ta: `` வெர்டெக்ச் () `` செயலாக்க செயல்பாடு ஒவ்வொரு வெர்டெக்சிற்கும் `` இடஞ்சார்ந்த`` மற்றும் `` கேன்வாச்_இடெம்` சேடர்களில் ஒரு முறை அழைக்கப்படுகிறது.
uk: Функція обробки ``vertex()`` викликається один раз для кожної вершини в ``spatial`` і ``canvas_item`` шейдерах.
zh_hant: 在 ``spatial`` 與 ``canvas_item`` 著色器中，會針對每個頂點呼叫一次 ``vertex()`` 處理函式。

source: Each vertex in your world's geometry has properties like a position and color. The function modifies those values and passes them to the fragment function. You can also use it to send extra data to the fragment function using varyings.
ga: Tá airíonna cosúil le suíomh agus dath ag gach ceann i ngéiméadra do domhain. Athraíonn an fheidhm na luachanna sin agus cuireann sé ar aghaidh chuig an bhfeidhm blúire iad. Is féidir leat é a úsáid freisin chun sonraí breise a sheoladh chuig an bhfeidhm blúire ag baint úsáide as éagsúlachtaí.
it: Ogni vertice nella geometria del mondo ha proprietà come posizione e colore. La funzione modifica questi valori e li passa alla funzione fragment. Si può anche usare per inviare dati aggiuntivi alla funzione fragment attraverso i varying.
ja: ワールドのジオメトリの各頂点には、位置や色などのプロパティがあります。このプロセッサー関数はこれらの値を変更し、フラグメントプロセッサーに渡します。またこれを使用して追加のデータをvaringsに渡すことでフラグメントプロセッサーに送信することもできます。
ta: உங்கள் உலகின் வடிவவியலில் உள்ள ஒவ்வொரு வெர்டெக்சிலும் ஒரு நிலை மற்றும் வண்ணம் போன்ற பண்புகள் உள்ளன. செயல்பாடு அந்த மதிப்புகளை மாற்றியமைத்து அவற்றை துண்டு செயல்பாட்டிற்கு அனுப்புகிறது. மாறுபாடுகளைப் பயன்படுத்தி துண்டு செயல்பாட்டிற்கு கூடுதல் தரவை அனுப்பவும் இதைப் பயன்படுத்தலாம்.
uk: Кожна вершина геометрії вашого світу має такі властивості, як положення та колір. Функція змінює ці значення та передає їх у функцію фрагмента. Ви також можете використовувати його для надсилання додаткових даних до функції фрагменту за допомогою варіацій.
zh_hant: 在你的世界幾何體中，每個頂點都擁有像是位置、顏色等屬性。此函式會修改這些數值，並將其傳遞給片段函式。你也可以利用 varying 變數，傳遞額外資訊給片段函式。

source: By default, Godot transforms your vertex information for you, which is necessary to project geometry onto the screen. You can use render modes to transform the data yourself; see the :ref:`Spatial shader doc <doc_spatial_shader>` for an example.
ga: De réir réamhshocraithe, athraíonn Godot do chuid faisnéise rinn duit, rud atá riachtanach chun céimseata a theilgean ar an scáileán. Is féidir leat modhanna rindreála a úsáid chun na sonraí a athrú tú féin; féach an :ref:`Spatial shader doc <doc_spatial_shader>` mar shampla.
it: Normalmente, Godot trasforma automaticamente le informazioni sui vertici, necessarie per proiettare la geometria sullo schermo. È possibile utilizzare certe modalità di rendering per trasformare manualmente i dati; consultare il :ref:`documento sugli shader spatial <doc_spatial_shader>` per un esempio.
ja: デフォルトではGodotはジオメトリを画面に投影するために必要な頂点データを変換します。またレンダリングモードを指定することで頂点データを自分で変換することも可能です。具体例については、:ref:`Spatial(空間)シェーダー <doc_spatial_shader>` を参照してください。
ta: இயல்பாக, கோடோட் உங்களுக்காக உங்கள் வெர்டெக்ச் தகவல்களை மாற்றுகிறது, இது வடிவவியலை திரையில் திட்டமிட தேவை. தரவை நீங்களே மாற்றுவதற்கு வழங்குதல் முறைகளைப் பயன்படுத்தலாம்; பார்க்க: ref: `இடஞ்சார்ந்த சேடர் டாக் <doc_spatial_shader>` ஒரு எடுத்துக்காட்டுக்கு.
uk: За замовчуванням Godot перетворює інформацію про вершини, необхідну для проектування геометрії на екран. Ви можете використовувати режими візуалізації, щоб самостійно трансформувати дані; дивіться приклад :ref:`Spatial shader doc <doc_spatial_shader>`.
zh_hant: 預設情況下，Godot 會自動幫你轉換頂點資訊，讓幾何體能正確投影到螢幕。你也可以透過算繪模式，自行進行資料變換；範例請見 :ref:`Spatial 著色器文件 <doc_spatial_shader>`。

source: Fragment processor
ga: Próiseálaí brúigh
ja: フラグメントプロセッサー
ta: துண்டு செயலி
uk: Процесор фрагментів
zh_hant: 片段處理器

source: The ``fragment()`` processing function is used to set up the Godot material parameters per pixel. This code runs on every visible pixel the object or primitive draws. It is only available in ``spatial``, ``canvas_item``, and ``sky`` shaders.
ga: Úsáidtear an fheidhm phróiseála ``bhrúid () ``chun paraiméadair ábhair Godot a chur ar bun in aghaidh an picteilín. Ritheann an cód seo ar gach picteilín infheicthe a tharraingíonn an réad nó príomhshru Níl sé ar fáil ach i scáthairí ``spatial``, `canvas_item``, agus ``sky``.
ja: ``fragment()`` 処理関数はピクセルごとにGodotマテリアルのパラメータを設定するために使用されます。このコードはオブジェクトまたはプリミティブが描画するすべての可視ピクセル上で実行されます。これは ``spatial`` 、 ``canvas_item`` 、および ``sky`` シェーダーでのみ使用できます。
ta: பிக்சலுக்கு கோடோட் பொருள் அளவுருக்களை அமைக்க `` துண்டு () `` செயலாக்க செயல்பாடு பயன்படுத்தப்படுகிறது. இந்த குறியீடு ஒவ்வொரு புலப்படும் பிக்சலிலும் பொருள் அல்லது பழமையான டிராக்களில் இயங்குகிறது. இது `` இடஞ்சார்ந்த``, `` கேன்வாச்_இடெம்`` மற்றும் `` ச்கை`` சேடர்களில் மட்டுமே கிடைக்கிறது.
uk: Функція обробки ``fragment()`` використовується для встановлення параметрів матеріалу Godot на піксель. Цей код виконується на кожному видимому пікселі, який малює об’єкт або примітив. Він доступний лише в шейдерах ``spatial``, ``canvas_item`` і ``sky``.

source: The standard use of the fragment function is to set up material properties used to calculate lighting. For example, you would set values for ``ROUGHNESS``, ``RIM``, or ``TRANSMISSION``, which would tell the light function how the lights respond to that fragment. This makes it possible to control a complex shading pipeline without the user having to write much code. If you don't need this built-in functionality, you can ignore it and write your own light processing function, and Godot will optimize it away. For example, if you do not write a value to ``RIM``, Godot will not calculate rim lighting. During compilation, Godot checks to see if ``RIM`` is used; if not, it cuts all the corresponding code out. Therefore, you will not waste calculations on the effects that you do not use.
ga: Is é úsáid chaighdeánach na feidhme blúire ná airíonna ábhartha a bhunú a úsáidtear chun soilsiú a ríomh. Mar shampla, shocrófá luachanna do `ROUGHNESS``, `RIM``, nó ``TRANSMISSION``, a inseoidh don fheidhm solais conas a fhreagraíonn na soilse don bhliúirt sin. De bharr seo is féidir píblíne scáthaithe casta a rialú gan an úsáideoir mórán cód a scríobh. Mura dteastaíonn an fheidhmiúlacht ionsuite seo uait, is féidir leat neamhaird a dhéanamh air agus do fheidhm phróiseála solais féin a scríobh, agus déanfaidh Godot é a bharrfheabhsú. Mar shampla, mura scríobhann tú luach chuig `RIM ``, ní ríomhfaidh Godot soilsiú imeall. Le linn tiomsú, seiceálann Godot chun a fheiceáil an n-úsáidtear `RIM ``; mura bhfuil, gearrann sé an cód comhfhreagrach go léir amach. Dá bhrí sin, ní chuirfidh tú amú ríomhanna ar na héifeachtaí nach n-úsáideann tú.
it: L'uso standard della funzione fragment è quello di impostare le proprietà del materiale che saranno usate per calcolare l'illuminazione. Per esempio, si impostano i valori per ``ROUGHNESS``, ``RIM``, o ``TRANSMISSION`` che indicano alla funzione light come le luci rispondono a quel frammento. Questo rende possibile controllare una pipeline di shading complessa senza richiedere molto codice dall'utente. Se non c'è bisogno di questa funzionalità integrata, è possibile ignorarla e scrivere la propria funzione di elaborazione delle luci e Godot la ottimizzerà. Per esempio, se ``RIM`` non è impostato, Godot non calcolerà l'illuminazione sul bordo. Durante la compilazione, Godot verifica se ``RIM`` è utilizzato; se non, taglia fuori tutto il codice corrispondente. Pertanto, non si sprecheranno calcoli sugli effetti non usati.
ja: フラグメント関数の標準的な使用法は、ライティングの計算に使用されるマテリアルプロパティを設定することです。たとえば、\ ``ROUGHNESS``\ 、\ ``RIM``\ または ``TRANSMISSION`` の値を設定して、ライトがそのフラグメントにどのように応答するかをライト機能に伝えます。これにより、ユーザーが多くのコードを記述することなく、複雑なシェーディングパイプラインを制御できます。この組み込み機能が必要ない場合は、それを無視して独自のライト処理関数を記述すれば、Godotはそれを最適化します。たとえば、\ ``RIM`` に値を書き込まない場合、Godotはリム照明を計算しません。コンパイル中、Godotは ``RIM`` が使用されているかどうかを確認します。そうでない場合は、対応するすべてのコードを切り取ります。したがって、使用しない効果の計算を無駄にすることはありません。
ta: துண்டு செயல்பாட்டின் நிலையான பயன்பாடு விளக்குகளைக் கணக்கிடப் பயன்படுத்தப்படும் பொருள் பண்புகளை அமைப்பதாகும். எடுத்துக்காட்டாக, நீங்கள் `` கடினத்தன்மை``, `` ரிம்``, அல்லது `` டிரான்ச்மிசன்`` என்பதற்கான மதிப்புகளை அமைப்பீர்கள், இது விளக்குகள் அந்த துண்டுக்கு எவ்வாறு பதிலளிக்கின்றன என்பதை ஒளி செயல்பாட்டைக் கூறும். பயனர் அதிக குறியீட்டை எழுதாமல் சிக்கலான நிழல் குழாய்த்திட்டத்தைக் கட்டுப்படுத்த இது சாத்தியமாக்குகிறது. இந்த உள்ளமைக்கப்பட்ட செயல்பாடு உங்களுக்கு தேவையில்லை என்றால், நீங்கள் அதை புறக்கணித்து உங்கள் சொந்த ஒளி செயலாக்க செயல்பாட்டை எழுதலாம், மேலும் கோடோட் அதை மேம்படுத்தும். எடுத்துக்காட்டாக, நீங்கள் `` ரிம்`` க்கு ஒரு மதிப்பை எழுதவில்லை என்றால், கோடோட் விளிம்பு விளக்குகளை கணக்கிடாது. தொகுப்பின் போது, கோடோட் `` ரிம்`` பயன்படுத்தப்படுகிறதா என்று சரிபார்க்கிறார்; இல்லையென்றால், அது தொடர்புடைய அனைத்து குறியீடுகளையும் வெட்டுகிறது. எனவே, நீங்கள் பயன்படுத்தாத விளைவுகள் குறித்து கணக்கீடுகளை வீணாக்க மாட்டீர்கள்.
uk: Стандартним використанням функції фрагмента є налаштування властивостей матеріалу, які використовуються для розрахунку освітлення. Наприклад, ви повинні встановити значення для `` ROUGHNESS ``, `` RIM`` або `` `` TRANSMISSION``, які повідомлять функції освітлення, як світло реагує на цей фрагмент. Це дає змогу керувати складним конвеєром затінення без необхідності написання коду користувачем. Якщо вам не потрібна ця вбудована функція, ви можете проігнорувати її та написати власну функцію обробки світла, і Godot оптимізує її. Наприклад, якщо ви не запишете значення в ``RIM``, Godot не обчислить освітлення обода. Під час компіляції Godot перевіряє, чи використовується ``RIM``; якщо ні, він вирізає весь відповідний код. Тому ви не будете витрачати розрахунки на ефекти, які ви не використовуєте.
zh_hant: 片段函式的標準用途是設定用於光照計算的材質屬性。例如，你可以設定 ``ROUGHNESS``、``RIM`` 或 ``TRANSMISSION`` 的數值，這些設定會告訴光照函式該如何處理這個片段。這讓你能夠有效控制複雜的著色流程，而不必撰寫過多程式碼。如果你不需要這些內建功能，也可以忽略它們並自行撰寫光照處理函式，Godot 會自動優化。舉例來說，如果你沒對 ``RIM`` 賦值，Godot 就不會進行邊緣光的計算。在編譯階段，Godot 會檢查 ``RIM`` 是否有被使用，若沒有，相關程式碼就會被移除。因此，你不會在未使用的特效上浪費任何計算資源。

source: Light processor
ga: Próiseálaí solais
ja: ライトプロセッサー
ta: ஒளி செயலி
uk: Легкий процесор
zh_hant: 光照處理器

source: The ``light()`` processor runs per pixel too, and it runs once for every light that affects the object. It does not run if no lights affect the object. It exists as a function called inside the ``fragment()`` processor and typically operates on the material properties setup inside the ``fragment()`` function.
ga: Ritheann an próiseálaí ``light () `in aghaidh an picteilín freisin, agus ritheann sé uair amháin do gach solas a théann i bhfeidhm ar an réad. Ní ritheann sé mura dtéann aon soilse i bhfeidhm ar an réad. Tá sé ann mar fheidhm ar a dtugtar taobh istigh den phróiseálaí ``fragment () ``agus is gnách go n-oibríonn sé ar na socrú airíonna ábhair taobh istigh den fheidhm ```fragment ()``.
it: Anche il processore ``light()`` è eseguito per pixel, una volta per ogni luce che influenza l'oggetto. Non è eseguito se nessuna luce influenza l'oggetto. Esiste come funzione richiamata all'interno del processore ``fragment()`` e in genere opera in base alle proprietà del materiale configurate all'interno della funzione ``fragment()``.
ja: ``light()`` プロセッサーもピクセルごとに実行され、オブジェクトに影響を与えるすべてのライトごとに1回実行されます。オブジェクトに影響を与えるライトがない場合は実行されません。これは ``fragment()`` プロセッサー内で呼び出される関数として存在し、通常は ``fragment()`` 関数内で設定されたマテリアルプロパティで動作します。
ta: `` ஒளி () `` செயலி ஒரு பிக்சலுக்கும் இயங்குகிறது, மேலும் இது பொருளைப் பாதிக்கும் ஒவ்வொரு ஒளிக்கும் ஒரு முறை இயங்கும். விளக்குகள் எதுவும் பொருளைப் பாதிக்காவிட்டால் அது இயங்காது. இது `` துண்டு () `செயலிக்குள் அழைக்கப்படும் ஒரு செயல்பாடாக உள்ளது மற்றும் பொதுவாக` `துண்டு ()` `செயல்பாட்டிற்குள் பொருள் பண்புகள் அமைப்பில் இயங்குகிறது.
uk: Процесор ``light()`` також працює на піксель, і він запускається один раз для кожного світла, яке впливає на об’єкт. Він не запускається, якщо на об’єкт не впливає світло. Він існує як функція, що викликається всередині процесора ``fragment()`` і зазвичай працює з налаштуванням властивостей матеріалу всередині функції ``fragment()``.
zh_hant: ``light()`` 處理器同樣會針對每個像素執行，且每盞影響該物件的燈光都會執行一次。若沒有任何燈光影響該物件，則不會執行。該函式會在 ``fragment()`` 處理器中被呼叫，通常用於處理在 ``fragment()`` 函式中設置的材質屬性。

source: The ``light()`` processor works differently in 2D than it does in 3D; for a description of how it works in each, see their documentation, :ref:`CanvasItem shaders <doc_canvas_item_shader>` and :ref:`Spatial shaders <doc_spatial_shader>`, respectively.
ga: Oibríonn an próiseálaí ``light()`` ar bhealach difriúil i 2T ná mar a oibríonn sé i 3T; le cur síos ar an gcaoi a n-oibríonn sé i ngach ceann acu, féach ar a gcáipéisíocht, :ref:`CanvasItem shaders <doc_canvas_item_shader>` agus :ref:`Spatial shaders <doc_spatial_shader>`, faoi seach.
it: Il processore ``light()`` funziona diversamente in 2D rispetto a 3D; per una descrizione di come funziona in entrambi, consultare la loro documentazione :ref:`shader CanvasItem <doc_canvas_item_shader>` e :ref:`shader Spatial <doc_spatial_shader>`, rispettivamente.
ja: ``light()`` プロセッサは2Dと3Dでは動作が異なります。それぞれの機能の説明については、各ドキュメント :ref:`CanvasItem シェーダ <doc_canvas_item_shader>` および :ref:`Spatial(空間)シェーダ <doc_spatial_shader>` を参照してください。
ta: `` ஒளி () `` செயலி 3D ஐ விட 2D இல் வித்தியாசமாக வேலை செய்கிறது; ஒவ்வொன்றிலும் இது எவ்வாறு செயல்படுகிறது என்பதற்கான விளக்கத்திற்கு, அவற்றின் ஆவணங்களைப் பார்க்கவும்,: `கேன்வாசிடெம் சேடர்கள் <doc_canvas_item_shader>` மற்றும்: குறிப்பு: `இடஞ்சார்ந்த சேடர்கள் <doc_spatial_shader>`.
uk: Процесор ``light()`` працює інакше у 2D, ніж у 3D; для опису того, як це працює в кожному, дивіться їхню документацію, :ref:`CanvasItem shaders <doc_canvas_item_shader>` і :ref:`Spatial shaders <doc_spatial_shader>` відповідно.
zh_hant: ``light()`` 處理器在 2D 和 3D 的運作方式不同，詳細運作原理請參閱 :ref:`CanvasItem 著色器 <doc_canvas_item_shader>` 及 :ref:`Spatial 著色器 <doc_spatial_shader>` 的說明。

source: Suppose you want to update all the pixels in a texture to a given color. In GDScript, your code would use ``for`` loops:
it: Supponiamo di voler aggiornare tutti i pixel di una texture con un determinato colore. In GDScript, il codice utilizzerebbe cicli ``for``:
zh_hant: 假設你想把一張紋理中的所有像素都設為某個指定顏色，在 GDScript 中你的程式碼可能會使用 ``for`` 迴圈：

source: The ``fragment()`` processing function is used to set up the Godot material parameters per pixel. This code runs on every visible pixel the object or primitive draws. It is only available in ``spatial`` and ``canvas_item`` shaders.
it: La funzione di elaborazione ``fragment()`` è utilizzata per impostare i parametri del materiale Godot per pixel. Questo codice è eseguito su ogni pixel visibile disegnato dall'oggetto o dalla primitiva. È disponibile solo negli shader ``spatial`` e ``canvas_item``.
zh_hant: ``fragment()`` 處理函式用於逐像素設定 Godot 材質參數。這段程式碼會在物件或圖元所繪製的每一個可見像素上執行。僅能在 ``spatial`` 與 ``canvas_item`` 著色器中使用。
