Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shaders_style_guide.po
Languages: ga, it, ru, ta

source: These naming conventions follow the Godot Engine style. Breaking these will make your code clash with the built-in naming conventions, leading to inconsistent code.
ga: Leanann na coinbhinsiúin ainmniúcháin seo stíl Inneall Godot. Má bhristear iad seo, beidh do chód ag teacht salach ar na coinbhinsiúin ainmniúcháin ionsuite, rud a fhágfaidh go mbeidh cód neamhréireach.
it: Queste convenzioni di denominazione seguono lo stile del Godot Engine. Se non rispettate, il proprio codice andrà in conflitto con le convenzioni integrate, portando a codice non conforme.
ru: Эти соглашения об именовании следуют стилю Godot Engine. Нарушение этих правил приведет к конфликту вашего кода со встроенными соглашениями об именовании, что приведет к противоречивому коду.
ta: இந்த பெயரிடும் மரபுகள் கோடோட் என்சின் பாணியைப் பின்பற்றுகின்றன. இவற்றை உடைப்பது உங்கள் குறியீட்டை உள்ளமைக்கப்பட்ட பெயரிடும் மாநாடுகளுடன் மோதுகிறது, இது சீரற்ற குறியீட்டிற்கு வழிவகுக்கும்.

source: Functions and variables
ga: Feidhmeanna agus athróga
it: Funzioni e variabili
ru: Функции и переменные
ta: செயல்பாடுகள் மற்றும் மாறிகள்

source: Use snake\_case to name functions and variables:
ga: Úsáid nathair\ _case chun feidhmeanna agus athróga a ainmniú:
it: Utilizzare snake\_case per denominare funzioni e variabili:
ru: Используйте snake\_case для именования функций и переменных:
ta: பெயர் செயல்பாடுகள் மற்றும் மாறிகள் ஆகியவற்றிற்கு பாம்பைப் பயன்படுத்தவும் _ கேசைப் பயன்படுத்தவும்:

source: Constants
ga: Coimeádanna
it: Costanti
ru: Константы
ta: மாறிலிகள்

source: Write constants with CONSTANT\_CASE, that is to say in all caps with an underscore (\_) to separate words:
ga: Scríobh comhsheasmhainní le CONSTANT\ _CASE, is é sin le rá i ngach caipín le béim (\ _) chun focail a scaradh:
it: Scrivere le costanti con CONSTANT\_CASE, vale a dire in maiuscolo con un trattino basso (\_) per separare le parole:
ru: Пишите константы с CONSTANT\_CASE, все большими буквами, с нижним подчеркиванием (\_) в качестве разделителя слов:
ta: நிலையான \ _ கேசுடன் மாறிலிகளை எழுதுங்கள், அதாவது எல்லா தொப்பிகளிலும் சொற்களை பிரிக்க அடிக்கோடிட்டு (\ _) சொல்ல வேண்டும்:

source: Preprocessor directives
ga: Treoracha réamhphróiseála
it: Direttive del preprocessore
ru: Директивы препроцессора
ta: முன் செயலாக்க வழிமுறைகள்

source: :ref:`doc_shader_preprocessor` directives should be written in CONSTANT__CASE. Directives should be written without any indentation before them, even if nested within a function.
ga: :ref: Ba chóir treoracha `doc_shader_preprocessor` a scríobh i CONSTANT__CASE. Ba chóir treoracha a scríobh gan aon bhriseadh os comhair, fiú má tá siad neadaithe laistigh de fheidhm.
it: Le direttive :ref:`doc_shader_preprocessor` si devono scrivere in CONSTANT_CASE. Le direttive si devono scrivere senza alcuna indentazione prima di esse, anche se annidate all'interno di una funzione.
ru: Директивы :ref:`doc_shader_preprocessor` следует писать в CONSTANT__CASE. Директивы следует писать без отступов перед ними, даже если они вложены в функцию.
ta: . ஒரு செயல்பாட்டிற்குள் கூடு கட்டப்பட்டிருந்தாலும், அவர்களுக்கு முன் எந்த உள்தள்ளலும் இல்லாமல் உத்தரவுகள் எழுதப்பட வேண்டும்.

source: To preserve the natural flow of indentation when shader errors are printed to the console, extra indentation should **not** be added within ``#if``, ``#ifdef`` or ``#ifndef`` blocks:
ga: Chun sreabhadh nádúrtha an ionghabhála a chaomhnú nuair a dhéantar earráidí scáthaithe a phriontáil chuig an gconsól, níor cheart ionchur breise** a chur leis laistigh de bhloic ``#if``, ``#ifdef`` nó ``#ifndef``:
it: Per preservare il flusso naturale di indentazione quando gli errori di shader sono stampati sulla console, **non** si dovrebbe aggiungere un'indentazione aggiuntiva nei blocchi ``#if``, ``#ifdef`` o ``#ifndef``:
ru: Чтобы сохранить естественный порядок отступов при выводе ошибок шейдера на консоль, дополнительные отступы **не** следует добавлять внутри блоков ``#if``, ``#ifdef`` или ``#ifndef``:
ta: நிழல் பிழைகள் கன்சோலுக்கு அச்சிடப்படும்போது உள்தள்ளலின் இயல்பான ஓட்டத்தை பாதுகாக்க, கூடுதல் உள்தள்ளல் ** ** ** ``#if`, ``#ifdef`` அல்லது ``#ifndef`` தொகுதிகள்:

source: Code order
ga: Ordú cód
it: Ordine del codice
ru: Порядок кода
ta: குறியீடு வரிசை

source: We suggest to organize shader code this way:
ga: Molaimid cód shader a eagrú ar an mbealach seo:
it: Suggeriamo di organizzare il codice degli shader in questo modo:
ru: Мы предлагаем организовать код шейдера следующим образом:
ta: சேடர் குறியீட்டை இந்த வழியில் ஒழுங்கமைக்க நாங்கள் பரிந்துரைக்கிறோம்:

source: We optimized the order to make it easy to read the code from top to bottom, to help developers reading the code for the first time understand how it works, and to avoid errors linked to the order of variable declarations.
ga: Chuireamar an t-ordú a bharrfheabhsú chun go mbeidh sé éasca an cód a léamh ón mbarr go bun, chun cabhrú le forbróirí ag léamh an cód den chéad uair a thuiscint conas a oibríonn sé, agus chun earráidí a bhaineann le hordú na ndearbhú athraitheacha a sheachaint.
it: Abbiamo ottimizzato l'ordine per semplificare la lettura del codice dall'alto verso il basso, per aiutare gli sviluppatori che leggono il codice per la prima volta a capirne il funzionamento e per evitare errori riguardanti l'ordine di dichiarazione delle variabili.
ru: Мы оптимизировали порядок, чтобы упростить чтение кода сверху вниз и помочь разработчикам, которые читают этот код впервые, понять, как он работает и избежать ошибок, связанных с порядком объявления переменных.
ta: குறியீட்டை மேலிருந்து கீழாக படிப்பதை எளிதாக்குவதற்கும், குறியீட்டைப் படிக்கும் உருவாக்குபவர்கள் முதல் முறையாக அது எவ்வாறு செயல்படுகிறது என்பதைப் புரிந்துகொள்வதற்கும், மாறி அறிவிப்புகளின் வரிசையுடன் இணைக்கப்பட்ட பிழைகளைத் தவிர்ப்பதற்கும் வரிசையை நாங்கள் மேம்படுத்தினோம்.

source: This code order follows two rules of thumb:
ga: Leanann an t-ordú cód seo dhá riail ordóige:
it: Questo ordine del codice segue due regole generali:
ru: Этот порядок кодов следует двум практическим правилам:
ta: இந்த குறியீடு ஒழுங்கு கட்டைவிரல் இரண்டு விதிகளைப் பின்பற்றுகிறது:

source: Metadata and properties first, followed by methods.
ga: Meiteashonraí agus airíonna ar dtús, ina dhiaidh sin modhanna.
it: Prima i metadati e le proprietà, poi i metodi.
ru: Сначала метаданные и свойства, затем методы.
ta: மேனிலை தரவு மற்றும் பண்புகள் முதலில், அதைத் தொடர்ந்து முறைகள்.

source: "Public" comes before "private". In a shader language's context, "public" refers to what's easily adjustable by the user (uniforms).
ga: Tagann “Phoiblí” roimh “príobháideach”. I gcomhthéacs teanga shader, tagraíonn “poiblí” don rud atá inchoigeartaithe go héasca ag an úsáideoir (éide).
it: "Pubblico" viene prima di "privato". Nel contesto di un linguaggio per shader, "pubblico" si riferisce a ciò che è facilmente regolabile dall'utente (le uniformi).
ru: "Public" предшествует "private". В контексте языка шейдеров "private" относится к тому, что пользователь может легко изменить (uniforms).
ta: "பொது" "தனியார்" முன் வருகிறது. ஒரு சேடர் மொழியின் சூழலில், "பொது" என்பது பயனரால் (சீருடைகள்) எளிதில் சரிசெய்யக்கூடியதைக் குறிக்கிறது.

source: Local variables
ga: Athróga áitiúla
it: Variabili locali
ru: Локальные переменные
ta: உள்ளக மாறிகள்

source: Declare local variables as close as possible to their first use. This makes it easier to follow the code, without having to scroll too much to find where the variable was declared.
ga: Déan athróga áitiúla a dhearbhú chomh gar agus is féidir dá gcéad úsáid. Fágann sé seo go bhfuil sé níos éasca an cód a leanúint, gan an iomarca scrollú chun a fháil amach cá ndearnadh an t-athróg.
it: Dichiarare le variabili locali il più vicino possibile al loro primo utilizzo. Questo rende più facile seguire il codice, senza dover scorrere troppo per trovare il punto in cui viene dichiarata la variabile.
ru: Объявляйте локальные переменные как можно ближе к их первому использованию. Это облегчает отслеживание кода, не требуя слишком большой прокрутки, чтобы найти, где была объявлена переменная.
ta: உள்ளக மாறிகள் அவற்றின் முதல் பயன்பாட்டிற்கு முடிந்தவரை நெருக்கமாக அறிவிக்கவும். மாறி அறிவிக்கப்பட்ட இடத்தைக் கண்டுபிடிக்க அதிகமாக உருட்டாமல், குறியீட்டைப் பின்பற்றுவதை இது எளிதாக்குகிறது.
