Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shader_materials.po
Languages: ga, ta, uk

source: Shader materials
ga: Ábhair scáthaithe
ta: சேடர் பொருட்கள்
uk: Шейдерні матеріали

source: Introduction
ga: Réamhrá
ta: அறிமுகம்
uk: Вступ

source: For the most common cases, Godot provides ready to use materials for most types of shaders, such as :ref:`StandardMaterial3D <class_StandardMaterial3D>`, :ref:`CanvasItemMaterial <class_CanvasItemMaterial>` and :ref:`ParticleProcessMaterial <class_ParticleProcessMaterial>`. They are flexible implementations that cover most use cases.
ga: I gcás na gcásanna is coitianta, soláthraíonn Godot ábhair réidh le húsáid don chuid is mó de na cineálacha scáthaitheoirí, mar :ref:`StandardMaterial3D <class_StandardMaterial3D>`, :ref:`CanvasItemMaterial <class_CanvasItemMaterial>` agus :tag:`ParticleProcessMaterial <class_Particle>Processor. Is feidhmiúcháin solúbtha iad a chlúdaíonn formhór na gcásanna úsáide.
ta: மிகவும் பொதுவான நிகழ்வுகளுக்கு, கோடோட் பெரும்பாலான வகையான சேடர்களுக்கான பொருட்களைப் பயன்படுத்தத் தயாராக உள்ளது, அதாவது: `ச்டாண்டர்ட் மெட்டெரியல் 3 டி <class_standardMaterial3d>`,: ref: `canvasitemmaterial <class_canvasitemmaterial>` மற்றும்: `pretorcessmaticalprocparialarialarialarialarialarialarialarialarialarialarialarialarialarialarialarialialarialialarialialarialialarialialarialarialarialarialarialials. அவை பெரும்பாலான பயன்பாட்டு நிகழ்வுகளை உள்ளடக்கிய நெகிழ்வான செயலாக்கங்கள்.
uk: Для найпоширеніших випадків Godot надає готові до використання матеріали для більшості типів шейдерів, наприклад :ref:`StandardMaterial3D <class_StandardMaterial3D>`, :ref:`CanvasItemMaterial <class_CanvasItemMaterial>` і :ref:`ParticleProcessMaterial <class_ParticleProcessMaterial>`. Це гнучкі реалізації, які охоплюють більшість випадків використання.

source: Shader materials allow writing a custom shader directly, for maximum flexibility. Examples of this are:
ga: Ligeann ábhair scáthaithe scáthóir saincheaptha a scríobh go díreach, chun an solúbthacht is mó a fháil. Is iad seo samplaí seo:
ta: அதிகபட்ச நெகிழ்வுத்தன்மைக்கு, தனிப்பயன் சேடரை நேரடியாக எழுத சேடர் பொருட்கள் அனுமதிக்கின்றன. இதற்கு எடுத்துக்காட்டுகள்:
uk: Матеріали шейдерів дозволяють безпосередньо писати власний шейдер для максимальної гнучкості. Приклади цього:

source: Create procedural textures.
ga: Cruthaigh uigeachtaí nós imeachta.
ta: நடைமுறை அமைப்புகளை உருவாக்கவும்.
uk: Створення процедурних текстур.

source: Create complex texture blending effects.
ga: Cruthaigh éifeachtaí casta measctha uigeachta.
ta: சிக்கலான அமைப்பு கலப்பு விளைவுகளை உருவாக்கவும்.
uk: Створюйте складні ефекти змішування текстур.

source: Create animated materials, or materials that change over time.
ga: Cruthaigh ábhair bheoite, nó ábhair a athraíonn le himeacht ama.
ta: அனிமேசன் செய்யப்பட்ட பொருட்கள் அல்லது காலப்போக்கில் மாறும் பொருட்களை உருவாக்கவும்.
uk: Створюйте анімаційні матеріали або матеріали, які змінюються з часом.

source: Create refractive effects or other advanced effects.
ga: Cruthaigh éifeachtaí athraitheacha nó ardéifeachtaí eile.
ta: ஒளிவிலகல் விளைவுகள் அல்லது பிற மேம்பட்ட விளைவுகளை உருவாக்கவும்.
uk: Створення ефектів заломлення або інших розширених ефектів.

source: Create special lighting shaders for more exotic materials.
ga: Cruthaigh scáthaitheoirí soilsithe speisialta le haghaidh ábhar níos coimhthíocha.
ta: மேலும் கவர்ச்சியான பொருட்களுக்கு சிறப்பு லைட்டிங் சேடர்களை உருவாக்கவும்.
uk: Створіть спеціальні шейдери для більш екзотичних матеріалів.

source: Animate vertices, like tree leaves or grass.
ga: Beocháin a bheochan, cosúil le duilleoga crainn nó féar.
ta: மர இலைகள் அல்லது புல் போன்ற செங்குத்துகளை உயிரூட்டவும்.
uk: Анімуйте вершини, наприклад, листя дерев або трави.

source: Create custom particle code.
ga: Cruthaigh cód cáithníní saincheaptha.
ta: தனிப்பயன் துகள் குறியீட்டை உருவாக்கவும்.
uk: Створіть спеціальний код частинок.

source: And much more!
ga: Agus i bhfad níos mó!
ta: மேலும் பல!
uk: Та багато інших можливостей!

source: Godot provides built in functionality to make frequent operations easier. Additionally, Godot's shader editor will detect errors as you type, so you can see your edited shaders in real-time. It is also possible to edit shaders using a visual, node-based graph editor.
ga: Soláthraíonn Godot feidhmiúlacht ionsuite chun oibríochtaí minic a dhéanamh níos éasca. Ina theannta sin, braithfidh eagarthóir scáthaithe Godot earráidí agus tú ag clóscríobh, ionas gur féidir leat do scáthóirí eagarthóireachta a fheiceáil i bhfíor-am. Is féidir scáthóirí a chur in eagar freisin ag baint úsáide as eagarthóir graf amhairc bunaithe ar nód-bhunaithe.
ta: அடிக்கடி செயல்பாடுகளை எளிதாக்குவதற்கு கோடோட் செயல்பாட்டில் கட்டமைக்கப்பட்டுள்ளது. கூடுதலாக, கோடோட்டின் சேடர் எடிட்டர் நீங்கள் தட்டச்சு செய்யும் போது பிழைகளைக் கண்டறியும், எனவே நீங்கள் திருத்தப்பட்ட சேடர்களை நிகழ்நேரத்தில் காணலாம். காட்சி, முனை அடிப்படையிலான வரைபட எடிட்டரைப் பயன்படுத்தி சேடர்களைத் திருத்தவும் முடியும்.
uk: Godot надає вбудовану функціональність для полегшення частих операцій. Крім того, редактор шейдерів Godot виявлятиме помилки під час введення, тож ви зможете переглядати відредаговані шейдери в режимі реального часу. Також можна редагувати шейдери за допомогою візуального графічного редактора на основі вузлів.

source: Creating a ShaderMaterial
ga: Ábhar scádaithe a chruthú
ta: ஒரு நிழல் உருவாக்கம்
uk: Створення ShaderMaterial

source: Create a new ShaderMaterial in some object of your choice. Go to the "Material" property and create a ShaderMaterial.
ga: Cruthaigh ShaderMaterial nua i réad éigin de do rogha féin. Téigh go dtí an maoin “Ábhar” agus cruthaigh ShaderMaterial.
ta: நீங்கள் விரும்பும் சில பொருள்களில் புதிய நிழல் நிலத்தை உருவாக்கவும். "பொருள்" சொத்துக்குச் சென்று ஒரு நிழல் நிலத்தை உருவாக்கவும்.
uk: Створіть новий ShaderMaterial у якомусь об’єкті на ваш вибір. Перейдіть до властивості «Material» і створіть ShaderMaterial.

source: Next, click on the shader material to see its properties. From here you can create a shader or visual shader. Regular shaders use code to set their properties while a visual shader uses a node based workflow.
ga: Ansin, cliceáil ar an ábhar scáthaithe chun a airíonna a fheiceáil. Ón áit seo is féidir leat shader nó scáthóir amhairc a chruthú. Úsáideann scáthóirí rialta cód chun a n-airíonna a shocrú agus úsáideann scáthóir amhairc sreabhadh oibre bunaithe ar nód.
ta: அடுத்து, அதன் பண்புகளைக் காண சேடர் பொருளைக் சொடுக்கு செய்க. இங்கிருந்து நீங்கள் ஒரு சேடர் அல்லது காட்சி சேடரை உருவாக்கலாம். வழக்கமான சேடர்கள் அவற்றின் பண்புகளை அமைக்க குறியீட்டைப் பயன்படுத்துகின்றன, அதே நேரத்தில் காட்சி நிழல் முனை அடிப்படையிலான பணிப்பாய்வுகளைப் பயன்படுத்துகிறது.
uk: Далі натисніть на матеріал шейдера, щоб побачити його властивості. Тут ви можете створити шейдер або візуальний шейдер. Звичайні шейдери використовують код для встановлення своїх властивостей, тоді як візуальний шейдер використовує робочий процес на основі вузлів.

source: If you need to you can convert a visual shader to a text shader. However you can't convert a text shader to a visual shader.
ga: Más gá duit is féidir leat scáthóir amhairc a thiontú go scáthóir téacs. Mar sin féin ní féidir leat scáthóir téacs a thiontú go scáthóir amhairc.
ta: நீங்கள் தேவைப்பட்டால் ஒரு காட்சி சேடரை உரை சேடருக்கு மாற்றலாம். இருப்பினும் நீங்கள் ஒரு உரை சேடரை காட்சி நிழலுக்கு மாற்ற முடியாது.
uk: За потреби ви можете перетворити візуальний шейдер на текстовий. Однак ви не можете перетворити текстовий шейдер на візуальний.

source: Choose one of them and you can start editing your shader.
ga: Roghnaigh ceann acu agus is féidir leat tosú ag eagarthóireacht do scáthaitheora.
ta: அவற்றில் ஒன்றைத் தேர்வுசெய்து, உங்கள் சேடரைத் திருத்தத் தொடங்கலாம்.
uk: Виберіть один із них, і ви можете почати редагувати свій шейдер.

source: If you create a regular shader click on it and the shader editor will open.
ga: Má chruthaíonn tú scáthóir rialta cliceáil air agus osclóidh an t-eagarthóir shader.
ta: நீங்கள் ஒரு வழக்கமான சேடரை உருவாக்கினால், அதைக் சொடுக்கு செய்து, சேடர் எடிட்டர் திறக்கும்.
uk: Якщо ви створюєте звичайний шейдер, натисніть його, і відкриється редактор шейдерів.

source: If you create a visual shader the visual shader editor will open automatically.
ga: Má chruthaíonn tú scáthóir amhairc osclóidh an t-eagarthóir scáthaire amhairc go huathoibríoch.
ta: நீங்கள் ஒரு விசுவல் சேடரை உருவாக்கினால், விசுவல் சேடர் எடிட்டர் தானாகத் திறக்கும்.
uk: Якщо ви створюєте візуальний шейдер, редактор візуальних шейдерів відкриється автоматично.

source: In the visual shader editor you can click a button and see what your visual shader looks like as shader code. This can be useful if you're trying to replicate a text shader as nodes, or it can be used as a preview for converting your visual shader to a text shader.
ga: San eagarthóir scáthaitheora amhairc is féidir leat cnaipe a chliceáil agus a fheiceáil cén chuma atá ar do shader amhairc mar chód scáthaithe. Is féidir leis seo a bheith úsáideach má tá tú ag iarraidh scáthóir téacs a mhacasamhlú mar nóid, nó is féidir é a úsáid mar réamhamharc chun do scáthóir amhairc a thiontú go scáthóir téacs.
ta: விசுவல் சேடர் எடிட்டரில் நீங்கள் ஒரு பொத்தானைக் சொடுக்கு செய்து, உங்கள் காட்சி சேடர் சேடர் குறியீடாக எப்படி இருக்கும் என்று பார்க்கலாம். நீங்கள் ஒரு உரை சேடரை முனைகளாக நகலெடுக்க முயற்சிக்கிறீர்கள் என்றால் இது பயனுள்ளதாக இருக்கும், அல்லது உங்கள் காட்சி நிழலை உரை சேடராக மாற்றுவதற்கான முன்னோட்டமாக இதைப் பயன்படுத்தலாம்.
uk: У редакторі візуальних шейдерів ви можете натиснути кнопку та побачити, як ваш візуальний шейдер виглядає як код шейдера. Це може бути корисним, якщо ви намагаєтеся відтворити текстовий шейдер як вузли, або його можна використовувати як попередній перегляд для перетворення вашого візуального шейдера на текстовий.

source: To learn more about visual shaders, read :ref:`doc_visual_shaders`.
ga: Chun tuilleadh a fhoghlaim faoi scáthóirí amhairc, léi:ref: `doc_visual_shaders`.
ta: விசுவல் சேடர்களைப் பற்றி மேலும் அறிய, படிக்க: குறிப்பு: `doc_visual_shaders`.
uk: Щоб дізнатися більше про візуальні шейдери, прочитайте :ref:`doc_visual_shaders`.

source: Converting to ShaderMaterial
ga: Ag tiontú go ShaderMaterial
ta: நிழல் நிலைக்கு மாற்றுகிறது
uk: Перетворення в ShaderMaterial

source: It is possible to convert from StandardMaterial3D, CanvasItemMaterial and ParticleProcessMaterial to ShaderMaterial. To do so, go to the material properties and select the convert option.
ga: Is féidir a thiontú ó Material3D caighdeánach3D, CanvasSemMaterial agus PaintleProcess Material go ShaderMaterial. Chun é sin a dhéanamh, téigh chuig na hairíonna ábhair agus roghnaigh an rogha tiontaithe.
ta: StandardMaterial3D, Canvasitemmaterial மற்றும் Thethermavesessmaterial இலிருந்து நிழல் நிலைக்கு மாற்ற முடியும். அவ்வாறு செய்ய, பொருள் பண்புகளுக்குச் சென்று மாற்ற விருப்பத்தைத் தேர்ந்தெடுக்கவும்.
uk: Можна конвертувати StandardMaterial3D, CanvasItemMaterial і ParticleProcessMaterial у ShaderMaterial. Для цього перейдіть до властивостей матеріалу та виберіть параметр конвертації.

source: Using the convert option will turn the StandardMaterial3D into a ShaderMaterial with a text shader, not a visual shader.
ga: Ag baint úsáide as an rogha tiontaithe, casfaidh sé an StandardMaterial3D ina ShaderMaterial le scáthóir téacs, ní scáthóir amhairc.
ta: மாற்றப்பட்ட விருப்பத்தைப் பயன்படுத்துவது ச்டாண்டர்டிமேட்டரியல் 3 டி ஐ உரை சேடருடன் நிழல் நிறமாக மாற்றும், காட்சி சேடர் அல்ல.
uk: Використання опції перетворення перетворить StandardMaterial3D на ShaderMaterial із текстовим, а не візуальним шейдером.
