Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/shaders_style_guide.po
Languages: ga, it, ru, ta

source: Shaders style guide
ga: Treoir stíl Scádóirí
it: Guida di stile per gli shader
ru: Руководство по стилю шейдеров
ta: சேடர்ச் பாணி வழிகாட்டி

source: This style guide lists conventions to write elegant shaders. The goal is to encourage writing clean, readable code and promote consistency across projects, discussions, and tutorials. Hopefully, this will also support the development of auto-formatting tools.
ga: Liostaíonn an treoir stíle seo coinbhinsiúin chun scáthóirí galánta a Is é an sprioc ná scríobh cód glan, inléite a spreagadh agus comhsheasmhacht a chur chun cinn ar fud tionscadail, plé agus ranganna teagaisc Tá súil agam go dtacóidh sé seo le forbairt uirlisí uathoibrithe formáidithe.
it: Questa guida di stile elenca le convenzioni per scrivere shader eleganti. L'obiettivo è incoraggiare la scrittura di codice pulito e leggibile e promuovere la conformità tra progetti, discussioni e tutorial. Ci auguriamo che questa supporti anche lo sviluppo di strumenti di formattazione automatica.
ru: В этом руководстве по стилю перечислены соглашения, необходимые для написания элегантных шейдеров. Цель — побудить писать чистый, читабельный код и обеспечить единообразие в проектах, обсуждениях и учебных пособиях. Надеемся, что это также будет способствовать разработке инструментов автоматического форматирования.
ta: இந்த பாணி வழிகாட்டி நேர்த்தியான சேடர்களை எழுத மரபுகளை பட்டியலிடுகிறது. தூய்மையான, படிக்கக்கூடிய குறியீட்டை எழுதுவதை ஊக்குவிப்பதும், திட்டங்கள், விவாதங்கள் மற்றும் பயிற்சிகள் முழுவதும் நிலைத்தன்மையை ஊக்குவிப்பதும் குறிக்கோள். இது தானாக வடிவமைக்கும் கருவிகளின் வளர்ச்சியையும் ஆதரிக்கும் என்று நம்புகிறோம்.

source: Since the Godot shader language is close to C-style languages and GLSL, this guide is inspired by Godot's own GLSL formatting. You can view examples of GLSL files in Godot's source code `here <https://github.com/godotengine/godot/blob/master/drivers/gles3/shaders/>`__.
ga: Ós rud é go bhfuil teanga Godot shader gar do theangacha C-stíl agus GLSL, tá an treoir seo spreagtha ag formáidiú GLSL Godot féin. Is féidir leat samplaí de chomhaid GLSL a fheiceáil i gcód foinse Godot `anseo <https://github.com/godotengine/godot/blob/master/drivers/gles3/shaders/>`__.
ru: Поскольку язык шейдеров Godot близок к языкам программирования на языке C и GLSL, данное руководство основано на собственном формате GLSL Godot. Примеры GLSL-файлов можно посмотреть в исходном коде Godot `здесь <https://github.com/godotengine/godot/blob/master/drivers/gles3/shaders/>`__.
ta: கோடோட் சேடர் மொழி சி-பாணி மொழிகள் மற்றும் சி.எல்.எச்.எல் உடன் நெருக்கமாக இருப்பதால், இந்த வழிகாட்டி கோடோட்டின் சொந்த சி.எல்.எச்.எல் வடிவமைப்பால் ஈர்க்கப்பட்டுள்ளது. கோடோட்டின் மூலக் குறியீட்டில் சி.எல்.எச்.எல் கோப்புகளின் எடுத்துக்காட்டுகளை நீங்கள் காணலாம் `இங்கே <https://github.com/godotengine/godot/blob/master/drivers/gles3/shaders/> __.

source: Style guides aren't meant as hard rulebooks. At times, you may not be able to apply some of the guidelines below. When that happens, use your best judgment, and ask fellow developers for insights.
ga: Níl treoracha stíle i gceist mar leabhair rialacha crua. Uaireanta, b'fhéidir nach mbeidh tú in ann cuid de na treoirlínte thíos a chur i bhfeidhm. Nuair a tharlaíonn sé sin, bain úsáid as do bhreithiúnas is fearr, agus iarr léargais ar fhorbróirí eile.
ru: Руководства по стилю не являются жестким сводом правил. Иногда у вас не будет возможности применить ниже приведенные рекомендации. Когда это случится, поступайте по своему усмотрению и попросите коллег-разработчиков поделиться своими соображениями.
ta: பாணி வழிகாட்டிகள் கடினமான விதி புத்தகங்களாக இல்லை. சில நேரங்களில், கீழே உள்ள சில வழிகாட்டுதல்களை நீங்கள் பயன்படுத்த முடியாது. அது நிகழும்போது, உங்கள் சிறந்த தீர்ப்பைப் பயன்படுத்துங்கள், மேலும் தம டெவலப்பர்களிடம் நுண்ணறிவுகளைக் கேளுங்கள்.

source: In general, keeping your code consistent in your projects and within your team is more important than following this guide to a tee.
ga: Go ginearálta, tá sé níos tábhachtaí do chód a choinneáil comhsheasmhach i do thionscadail agus laistigh de d'fhoireann ná an treoir seo a leanúint ar tee.
ru: В целом, поддержание согласованности кода в ваших проектах и в команде важнее, чем следование этому руководству.
ta: பொதுவாக, ஒரு டீக்கு இந்த வழிகாட்டியைப் பின்பற்றுவதை விட உங்கள் திட்டத்தை உங்கள் திட்டங்களிலும் உங்கள் குழுவிலும் சீராக வைத்திருப்பது முதன்மை.

source: Godot's built-in shader editor uses a lot of these conventions by default. Let it help you.
ga: Úsáideann eagarthóir scáthaithe ionsuite Godot go leor de na coinbhinsiúin seo de réir réamhshocraithe. Lig dó cabhrú leat.
ru: Встроенный редактор шейдеров Godot по умолчанию использует многие из этих соглашений. Позвольте ему помочь вам.
ta: கோடோட்டின் உள்ளமைக்கப்பட்ட சேடர் எடிட்டர் இந்த மரபுகளை இயல்பாகவே பயன்படுத்துகிறது. இது உங்களுக்கு உதவட்டும்.

source: Here is a complete shader example based on these guidelines:
ga: Seo sampla iomlán scáthaithe bunaithe ar na treoirlínte seo:
it: Ecco un esempio completo di shader basato su queste linee guida:
ru: Вот полный пример шейдера, основанный на этих рекомендациях:
ta: இந்த வழிகாட்டுதல்களின் அடிப்படையில் ஒரு முழுமையான சேடர் எடுத்துக்காட்டு இங்கே:

source: Formatting
ga: Formáidiú
it: Formattazione
ru: Форматирование
ta: வடிவமைப்பு

source: Encoding and special characters
ga: Ionchódú agus carachtair speisialta
it: Codifica e caratteri speciali
ru: Кодирование и специальные символы
ta: குறியாக்கம் மற்றும் சிறப்பு எழுத்துக்கள்

source: Use line feed (**LF**) characters to break lines, not CRLF or CR. *(editor default)*
ga: Bain úsáid as beatha líne (** LF **) carachtair chun línte a bhriseadh, ní CRLF nó CR. * (réamhshocrú eagarthóra) *
it: Utilizzare i caratteri di avanzamento riga (**LF**) per interrompere le righe, non CRLF o CR. *(predefinito dell'editor)*
ru: Используйте символы подачи строк (**LF**) для разрыва строк, а не CRLF или CR. *(редактор по умолчанию)*
ta: சிஆர்எல்எஃப் அல்லது சிஆர் அல்ல, வரிகளை உடைக்க வரி ஊட்டத்தை (** எல்எஃப் **) எழுத்துக்களைப் பயன்படுத்தவும். *(ஆசிரியர் இயல்புநிலை)*

source: Use one line feed character at the end of each file. *(editor default)*
ga: Bain úsáid as carachtar beatha líne amháin ag deireadh gach comhaid. *(réamhshocrú an eagarthóra)*
it: Utilizzare un carattere di avanzamento riga alla fine di ogni file. *(predefinito dell'editor)*
ru: Используйте символ перевода строки в конце каждого файла. *(editor default)*
ta: ஒவ்வொரு கோப்பின் முடிவிலும் ஒரு வரி ஊட்ட எழுத்தைப் பயன்படுத்தவும். *(ஆசிரியர் இயல்புநிலை)*

source: Use **UTF-8** encoding without a `byte order mark <https://en.wikipedia.org/wiki/Byte_order_mark>`_. *(editor default)*
ga: Úsáid ionchódú **UTF-8** gan marc ordaithe beart <https://en.wikipedia.org/wiki/Byte_order_mark>`_. *(eagarthóir réamhshocraithe)*
it: Utilizzare la codifica **UTF-8** senza `byte order mark <https://it.wikipedia.org/wiki/Byte_Order_Mark>`_. *(predefinito dell'editor)*
ru: Используйте кодировку **UTF-8** без `маркера последовательности байтов <https://ru.wikipedia.org/wiki/Маркер_последовательности_байтов>`_. *(редактор по умолчанию)*
ta: ** UTF-8 ** குறியாக்கத்தைப் பயன்படுத்தவும் `பைட் ஆர்டர் குறி <https://en.wikipedia.org/wiki/byte_order_mark>` _. *(ஆசிரியர் இயல்புநிலை)*

source: Use **Tabs** instead of spaces for indentation. *(editor default)*
ga: Úsáid **Tabs** in ionad spásanna le haghaidh eangú. *(réamhshocrú an eagarthóra)*
it: Utilizzare **Tabulazioni** invece di spazi per l'indentazione. *(predefinito dell'editor)*
ru: Используйте **табы** вместо пробелов для отступов. *(редактор по умолчанию)*
ta: உள்தள்ளலுக்கான இடைவெளிகளுக்கு பதிலாக ** தாவல்கள் ** ஐப் பயன்படுத்தவும். *(ஆசிரியர் இயல்புநிலை)*

source: Indentation
ga: Eangú
it: Indentazione
ru: Отступ
ta: உள்தள்ளல்

source: Each indent level should be one tab greater than the block containing it.
ga: Ba chóir go mbeadh cluaisín amháin níos mó ná an bloc ina bhfuil sé.
it: Ogni livello di indentazione dovrebbe essere più grande di una tabulazione rispetto al blocco che lo contiene.
ru: Каждый уровень отступа должен быть на одну табуляцию больше, чем содержащий его блок.
ta: ஒவ்வொரு உள்தள்ளல் மட்டமும் அதைக் கொண்ட தொகுதியை விட ஒரு தாவலாக இருக்க வேண்டும்.

source: **Good**:
ga: **Go maith**:
it: **Bene**:
ru: **Хорошо**:
ta: ** நல்லது **:

source: **Bad**:
ga: **Droch**:
it: **Male**:
ru: **Плохо**:
ta: ** மோசமானது **:

source: Use 2 indent levels to distinguish continuation lines from regular code blocks.
ga: Bain úsáid as 2 leibhéal fleasc chun idirdhealú a dhéanamh idir línte leanúnacha ó bhloic cód rialta.
it: Utilizzare 2 livelli di indentazione per distinguere le righe di continuazione dai regolari blocchi di codice.
ru: Используйте 2 уровня отступа, чтобы отличать строки продолжения от обычных блоков кода.
ta: வழக்கமான குறியீடு தொகுதிகளிலிருந்து தொடர்ச்சியான வரிகளை வேறுபடுத்த 2 உள்தள்ளல் நிலைகளைப் பயன்படுத்தவும்.

source: Line breaks and blank lines
ga: Sosanna líne agus línte bána
ru: Разрывы строки и пустые строки
ta: வரி இடைவெளிகள் மற்றும் வெற்று கோடுகள்

source: For a general indentation rule, follow `the "1TBS Style" <https://en.wikipedia.org/wiki/Indentation_style#Variant:_1TBS_(OTBS)>`_ which recommends placing the brace associated with a control statement on the same line. Always use braces for statements, even if they only span one line. This makes them easier to refactor and avoids mistakes when adding more lines to an ``if`` statement or similar.
ga: Le haghaidh riail eangaithe ghinearálta, lean `Stíl 1TBS" <https://en.wikipedia.org/wiki/Indentation_style#Variant:_1TBS_(OTBS)>`_ a mholann an brace a bhaineann le ráiteas rialaithe a chur ar an gcéanna líne. Bain úsáid as braces le haghaidh ráiteas i gcónaí, fiú mura dtéann siad ach le líne amháin. Déanann sé seo níos éasca iad a athmhacrú agus seachnaíonn sé botúin nuair a chuirtear níos mó línte le ráiteas ``má`` nó a mhacasamhail.
it: Come regola generale di indentazione, seguire lo ``stile 1TBS'' <https://en.wikipedia.org/wiki/Indentation_style#Variant:_1TBS_(OTBS)>`_, che raccomanda di posizionare la parentesi graffa associata a un'istruzione di controllo sulla stessa riga. Utilizzare sempre le parentesi graffe per le istruzioni, anche se coprono una sola riga. Questo ne facilita il refactoring ed evita errori quando si aggiungono più righe a un'istruzione ``if`` o simili.
ru: Для общего правила отступа следуйте стилю ` "1TBS Style" <https://en.wikipedia.org/wiki/Indentation_style#Variant:_1TBS_(OTBS)>`_ который рекомендует поместить скобку, связанную с управляющим оператором, в ту же строку. Всегда используйте фигурные скобки для операторов, даже если они охватывают только одну строку. Это облегчает их рефакторинг и позволяет избежать ошибок при добавлении большего количества строк в оператор ``if`` или аналогичный ему.
ta: ஒரு பொதுவான உள்தள்ளல் விதிக்கு, `1TBS பாணி" வரி. அறிக்கைகளுக்கு எப்போதும் பிரேச்களைப் பயன்படுத்துங்கள், அவை ஒரு வரியை மட்டுமே பரப்பினாலும் கூட. இது மறுசீரமைப்பாளரை எளிதாக்குகிறது மற்றும் `` if`` அறிக்கை அல்லது அதற்கு ஒத்ததாக அதிக வரிகளைச் சேர்க்கும்போது தவறுகளைத் தவிர்க்கிறது.

source: Blank lines
ga: Línte bána
it: Righe vuote
ru: Пустые строки
ta: வெற்று கோடுகள்

source: Surround function definitions with one (and only one) blank line:
ga: Sainmhínithe ar fheidhm timpeallaigh le líne bán amháin (agus amháin amháin):
it: Circonda le definizioni delle funzioni con una (e una sola) riga vuota:
ru: Окружите определения функций одной (и только одной) пустой строкой:
ta: செயல்பாட்டு வரையறைகளை ஒன்று (மற்றும் ஒரே ஒரு) வெற்று வரியுடன் சுற்றவும்:

source: Use one (and only one) blank line inside functions to separate logical sections.
ga: Úsáid líne bán amháin (agus amháin amháin) taobh istigh de fheidhmeanna chun codanna loighciúla a scaradh.
it: Utilizzare una (e una sola) riga vuota all'interno delle funzioni per separare le sezioni logiche.
ru: Используйте одну (и только одну) пустую строку внутри функций для разделения логических разделов.
ta: தர்க்கரீதியான பிரிவுகளை பிரிக்க செயல்பாடுகளுக்குள் ஒன்று (மற்றும் ஒரே ஒரு) வெற்று வரியைப் பயன்படுத்தவும்.

source: Line length
ga: Fad líne
it: Lunghezza delle righe
ru: Длина строки
ta: வரி நீளம்

source: Keep individual lines of code under 100 characters.
ga: Coinnigh línte aonair cód faoi 100 carachtar.
it: Mantenere le singole righe di codice al di sotto di 100 caratteri.
ru: Придерживайтесь длине строк кода не более 100 символов.
ta: குறியீட்டின் தனிப்பட்ட வரிகளை 100 எழுத்துகளின் கீழ் வைத்திருங்கள்.

source: If you can, try to keep lines under 80 characters. This helps to read the code on small displays and with two shaders opened side-by-side in an external text editor. For example, when looking at a differential revision.
ga: Más féidir leat, déan iarracht línte a choinneáil faoi 80 carachtar. Cuidíonn sé seo leis an gcód a léamh ar thaispeántais bheaga agus le dhá scáthóir oscailte taobh le taobh in eagarthóir téacs seachtrach. Mar shampla, agus tú ag féachaint ar athbhreithniú difreálach.
it: Se possibile, cercare di mantenere le righe al di sotto degli 80 caratteri. Questo aiuta a leggere il codice su display di piccole dimensioni e con due shader aperti uno accanto all'altro in un editor di testo esterno. Ad esempio, quando si esamina una revisione differenziale.
ru: По возможности старайтесь, чтобы длина строк не превышала 80 символов. Это облегчает чтение кода на небольших дисплеях и при открытии двух шейдеров одновременно во внешнем текстовом редакторе. Например, при просмотре дифференциальной версии.
ta: உங்களால் முடிந்தால், 80 எழுத்துக்களின் கீழ் வரிகளை வைக்க முயற்சிக்கவும். இது சிறிய காட்சிகளில் குறியீட்டைப் படிக்க உதவுகிறது மற்றும் வெளிப்புற உரை திருத்தியில் இரண்டு சேடர்கள் பக்கவாட்டாக திறக்கப்படுகின்றன. எடுத்துக்காட்டாக, ஒரு வேறுபட்ட திருத்தத்தைப் பார்க்கும்போது.

source: One statement per line
ga: Ráiteas amháin in aghaidh na líne
it: Una sola istruzione per riga
ru: Одно выражение на строку
ta: ஒரு வரிக்கு ஒரு அறிக்கை

source: Never combine multiple statements on a single line.
ga: Ná chomhcheangail ráitis iolracha riamh ar líne amháin.
it: Non combinare mai molteplici istruzioni sulla stessa riga.
ru: Никогда не объединяйте несколько утверждений в одной строке.
ta: ஒரே வரியில் பல அறிக்கைகளை ஒருபோதும் இணைக்க வேண்டாம்.

source: The only exception to that rule is the ternary operator:
ga: Is é an t-aon eisceacht ar an riail sin ná an t-oibreoir ternary:
it: L'unica eccezione a questa regola è l'operatore ternario:
ru: Единственным исключением из этого правила является тернарный оператор:
ta: அந்த விதிக்கு ஒரே விதிவிலக்கு மும்மை ஆபரேட்டர்:

source: Comment spacing
ga: Spásáil tráchta
it: Spaziatura dei commenti
ru: Интервал в комментариях
ta: கருத்து இடைவெளி

source: Regular comments should start with a space, but not code that you comment out. This helps differentiate text comments from disabled code.
ga: Ba chóir go dtosódh tráchtanna rialta le spás, ach ní le cód a dtugann tú trácht air. Cuidíonn sé seo le tuairimí téacs a idirdhealú ó chód díchumasaithe.
it: I commenti normali dovrebbero iniziare con uno spazio, ma non con il codice che si disabilita. Questo aiuta a distinguere i commenti di testo dal codice disabilitato.
ru: Обычные комментарии должны начинаться с пробела, но не с кода, который вы комментируете. Это помогает отличить текстовые комментарии от отключенного кода.
ta: வழக்கமான கருத்துகள் ஒரு இடத்துடன் தொடங்க வேண்டும், ஆனால் நீங்கள் கருத்து தெரிவிக்கும் குறியீடு அல்ல. முடக்கப்பட்ட குறியீட்டிலிருந்து உரை கருத்துகளை வேறுபடுத்த இது உதவுகிறது.

source: Don't use multiline comment syntax if your comment can fit on a single line:
ga: Ná húsáid comhréir tráchta illíne más féidir le do thrácht oiriúnach ar líne amháin:
it: Non utilizzare la sintassi per commenti su più righe se il commento può essere inserito in una sola riga:
ru: Не используйте синтаксис многострочных комментариев, если ваш комментарий может поместиться на одной строке:
ta: உங்கள் கருத்து ஒரு வரியில் பொருந்தினால் மல்டிலைன் கருத்து தொடரியல் பயன்படுத்த வேண்டாம்:

source: In the shader editor, to make the selected code a comment (or uncomment it), press :kbd:`Ctrl + K`. This feature adds or removes ``//`` at the start of the selected lines.
ga: In eagarthóir an scáthaire, chun trácht a dhéanamh ar an gcód roghnaithe (nó díthrácht air), brúite:kbd: `Ctrl + K`. Cuireann nó baineann an ghné seo ``//`` ag tús na línte roghnaithe.
it: Nell'editor di shader, per commentare il codice selezionato (o de-commentarlo), premere :kbd:`Ctrl + K`. Questa funzione aggiunge o rimuove ``//`` all'inizio delle righe selezionate.
ru: В редакторе шейдеров, чтобы сделать выделенный код комментарием (или раскомментировать его), нажмите :kbd:`Ctrl + K`. Эта функция добавляет или удаляет ``//`` в начале выделенных строк.
ta: சேடர் எடிட்டரில், தேர்ந்தெடுக்கப்பட்ட குறியீட்டை ஒரு கருத்தாக மாற்ற (அல்லது அதை அவிழ்த்து விடுங்கள்), அழுத்தவும்: kbd: `ctrl + k`. இந்த நற்பொருத்தம் தேர்ந்தெடுக்கப்பட்ட வரிகளின் தொடக்கத்தில் `` // `` சேர்க்கும் அல்லது நீக்குகிறது.

source: Documentation comments
ga: Tuairimí doicimé
it: Commenti di documentazione
ru: Комментарии к документации
ta: ஆவணங்கள் கருத்துகள்

source: Use the following format for documentation comments above uniforms, with **two** leading asterisks (``/**``) and follow-up asterisks on every line:
ga: Úsáid an fhormáid seo a leanas le haghaidh tuairimí doiciméadaithe thuas éide, len**dhá réalta tosaigh (`/**``) agus réaltaí leantacha ar gach líne:
it: Utilizzare il seguente formato per i commenti di documentazione sopra le uniformi, con **due** asterischi iniziali (``/**``) e asterischi successivi su ogni riga:
ru: Для комментариев к документации над униформами используйте следующий формат, с **двумя** начальными звездочками (``/**``) и последующими звездочками на каждой строке:
ta: சீருடைகளுக்கு மேலே உள்ள ஆவணக் கருத்துகளுக்கு பின்வரும் வடிவமைப்பைப் பயன்படுத்தவும், ** இரண்டு ** முன்னணி நட்சத்திரங்கள் (``/** ``) மற்றும் ஒவ்வொரு வரியிலும் பின்தொடர்தல் நட்சத்திரங்கள்:

source: These comments will appear when hovering a property in the inspector. If you don't wish the comment to be visible in the inspector, use the standard comment syntax instead (``// ...`` or ``/* ... */`` with only one leading asterisk).
ga: Taispeánfar na tuairimí seo agus maoin á habhú sa chigire. Mura mian leat an trácht a bheith le feiceáil sa chigire, úsáid an chomhréir chaighdeánach nótaí ina ionad (``// ...`` nó ``/* ... */`` gan ach aon réiltín tosaigh amháin ann).
it: Questi commenti appariranno passando il cursore su una proprietà nell'ispettore. Se non si desidera che il commento sia visibile nell'ispettore, utilizzare la regolare sintassi per i commenti (``// ...`` o ``/* ... */`` con un solo asterisco iniziale).
ru: Эти комментарии будут отображаться при наведении курсора на свойство в инспекторе. Если вы не хотите, чтобы комментарий отображался в инспекторе, используйте стандартный синтаксис комментариев (``// ...`` или ``/* ... */`` с одной звёздочкой в начале).
ta: இன்ச்பெக்டரில் ஒரு சொத்தை வட்டமிடும்போது இந்த கருத்துக்கள் தோன்றும். இன்ச்பெக்டரில் கருத்து தெரிவிக்க வேண்டும் என்று நீங்கள் விரும்பவில்லை என்றால், அதற்கு பதிலாக நிலையான கருத்து தொடரியல் (`` // ... `அல்லது` `/ * ... */` `ஒரே ஒரு முன்னணி நட்சத்திரத்துடன் மட்டுமே) பயன்படுத்தவும்.

source: Whitespace
ga: Spás bán
it: Spazio vuoto
ru: Пробел
ta: வைட்ச்பேச்

source: Always use one space around operators and after commas. Also, avoid extraneous spaces in function calls.
ga: Úsáid spás amháin i gcónaí timpeall oibreoirí agus tar éis camóga. Chomh maith leis sin, seachain spásanna seachtracha i nglaonna feidhme.
it: Utilizzare sempre uno spazio tra gli operatori e dopo le virgole. Inoltre, evitare spazi superflui nelle chiamate di funzioni.
ru: Всегда используйте один пробел вокруг операторов и после запятых. Также избегайте лишних пробелов в вызовах функций.
ta: ஆபரேட்டர்களைச் சுற்றி மற்றும் காற்புள்ளிகளுக்குப் பிறகு எப்போதும் ஒரு இடத்தைப் பயன்படுத்துங்கள். மேலும், செயல்பாட்டு அழைப்புகளில் வெளிப்புற இடங்களைத் தவிர்க்கவும்.

source: Don't use spaces to align expressions vertically:
ga: Ná húsáid spásanna chun nathanna a ailíniú go hingearach:
it: Non utilizzare spazi per allineare le espressioni verticalmente:
ru: Не используйте пробелы для вертикального выравнивания выражений:
ta: வெளிப்பாடுகளை செங்குத்தாக சீரமைக்க இடங்களைப் பயன்படுத்த வேண்டாம்:

source: Floating-point numbers
ga: Uimhreacha pointe snámh
it: Numeri a virgola mobile
ru: Числа с плавающей точкой
ta: மிதக்கும்-புள்ளி எண்கள்

source: Always specify at least one digit for both the integer and fractional part. This makes it easier to distinguish floating-point numbers from integers, as well as distinguishing numbers greater than 1 from those lower than 1.
ga: Sonraigh i gcónaí digit amháin ar a laghad don tslánuimhir agus don chuid codánach araon. Mar sin is fusa uimhreacha snámhphointe a idirdhealú ó shlánuimhreacha, chomh maith le huimhreacha níos mó ná 1 a idirdhealú ó na cinn is ísle ná 1.
it: Specificare sempre almeno una cifra sia per la parte intera sia per la parte frazionaria. Ciò aiuta a distinguere tra numeri a virgola mobile e interi, nonché tra numeri maggiori di 1 e minori di 1.
ru: Всегда указывайте хотя бы одну цифру как для целой, так и для дробной части. Это упрощает различение чисел с плавающей запятой от целых, а также чисел больше 1 от чисел меньше 1.
ta: முழு எண் மற்றும் பகுதியளவு பகுதிக்கு குறைந்தபட்சம் ஒரு இலக்கத்தையாவது எப்போதும் குறிப்பிடவும். இது மிதக்கும்-புள்ளி எண்களை முழு எண்களிலிருந்து வேறுபடுத்துவதை எளிதாக்குகிறது, அத்துடன் 1 ஐ விட 1 க்கும் அதிகமான எண்களை வேறுபடுத்துகிறது.

source: Accessing vector members
ga: Rochtain a fháil ar bhaill
it: Accesso ai membri di un vettore
ru: Доступ к элементам вектора
ta: திசையன் உறுப்பினர்களை அணுகும்

source: Use ``r``, ``g``, ``b``, and ``a`` when accessing a vector's members if it contains a color. If the vector contains anything else than a color, use ``x``, ``y``, ``z``, and ``w``. This allows those reading your code to better understand what the underlying data represents.
ga: Úsáid ``r``, ``g``, ``b``, agus ``a`` nuair a bhíonn tú ag teacht ar bhaill veicteora má tá dath ann. Má tá aon rud eile seachas dath sa veicteoir, úsáid ``x``, ``y``, ``z``, agus ``w``. Ligeann sé seo dóibh siúd a léann do chód tuiscint níos fearr a fháil ar a seasann na sonraí bunúsacha.
it: Utilizzare ``r``, ``g``, ``b`` e ``a`` per accedere ai membri di un vettore se contiene un colore. Se il vettore contiene qualsiasi altra cosa, utilizzare ``x``, ``y``, ``z`` e ``w``. Ciò permette a chi legge il codice di comprendere meglio cosa rappresentano i dati sottostanti.
ru: Используйте ``r``, ``g``, ``b`` и ``a`` для доступа к элементам вектора, если он содержит цвет. Если вектор содержит что-либо помимо цвета, используйте ``x``, ``y``, ``z`` и ``w``. Это позволит тем, кто читает ваш код, лучше понять, что представляют собой базовые данные.
ta: ஒரு திசையனின் உறுப்பினர்களை ஒரு வண்ணத்தைக் கொண்டிருந்தால் அணுகும்போது `` r``, `g``,` `b``, மற்றும்` `a`` ஐப் பயன்படுத்தவும். திசையன் ஒரு வண்ணத்தைத் தவிர வேறு எதையும் கொண்டிருந்தால், `` x``, `` y``, `Z``, மற்றும்` `w`` ஆகியவற்றைப் பயன்படுத்தவும். அடிப்படை தரவு எதைக் குறிக்கிறது என்பதை நன்கு புரிந்துகொள்ள உங்கள் குறியீட்டைப் படிப்பவர்கள் இது அனுமதிக்கிறது.

source: Naming conventions
ga: Coinbhinsiúin ain
it: Convenzioni di denominazione
ru: Соглашения об именовании
ta: பெயரிடும் மரபுகள்
