Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/compositor.po
Languages: de, ga, ru, ta, uk, zh_cn, zh_tw

source: We also need to clean up after ourselves, for this we react to the ``NOTIFICATION_PREDELETE`` notification:
de: Wir müssen auch hinter uns aufräumen, dazu reagieren wir auf die Benachrichtigung ``NOTIFICATION_PREDELETE``:
ga: Ní mór dúinn glanadh suas i ndiaidh dúinn féin freisin, chuige seo freagróimid don fhógra ``NOTIFICATION_PREDELETE``:
ru: Нам также необходимо убрать за собой, для этого мы реагируем на уведомление ``NOTIFICATION_PREDELETE``:
ta: நாங்கள் நீங்களே தூய்மை செய்ய வேண்டும், ஏனென்றால் இதற்காக `` அறிவிப்பு பிடெலெட்`` அறிவிப்புக்கு நாங்கள் எதிர்வினையாற்றுகிறோம்:
uk: Нам також потрібно прибрати за собою, для цього ми реагуємо на сповіщення ``NOTIFICATION_PREDELETE``:
zh_cn: 我们还需要自己进行清理，为此我们对 ``NOTIFICATION_PREDELETE`` 通知做出反应：
zh_tw: 我們還需要進行資源清理，這可以透過監聽 ``NOTIFICATION_PREDELETE`` 通知來完成：

source: Note that we do not use our mutex here even though we create our shader inside of our render thread. The methods on our rendering server are thread safe and ``free_rid`` will be postponed cleaning up the shader until after any frames currently being rendered are finished.
de: Beachten Sie, dass wir unseren Mutex hier nicht benutzen, obwohl wir unseren Shader innerhalb unseres Render-Threads erstellen. Die Methoden unseres Rendering-Servers sind thread-sicher und ``free_rid`` wird während des Aufräumen des Shaders aufgeschoben, bis alle Bilder, die gerade gerendert werden, fertig sind.
ga: Tabhair faoi deara nach n-úsáidimid ár mutex anseo cé go gcruthaímid ár scáthóir taobh istigh dár snáithe rindreála. Tá na modhanna ar ár bhfreastalaí rindreála sábháilte le snáithe agus cuirfear `free_rid`` ar siar ag glanadh an scáthaire go dtí go mbeidh aon fhrámaí atá á rindreáil faoi láthair críochnaithe.
ru: Обратите внимание, что мы не используем здесь мьютекс (mutex), хотя создаём шейдер внутри потока рендеринга. Методы на нашем сервере рендеринга потокобезопасны, и ``free_rid`` будет отложена очистка шейдера до завершения рендеринга всех текущих кадров.
ta: எங்கள் வழங்குதல் நூலுக்குள் எங்கள் சேடரை உருவாக்கினாலும் நாங்கள் இங்கே எங்கள் மியூடெக்சைப் பயன்படுத்தவில்லை என்பதை நினைவில் கொள்க. எங்கள் வழங்குதல் சேவையகத்தில் உள்ள முறைகள் நூல் பாதுகாப்பானவை, தற்போது வழங்கப்படும் எந்த பிரேம்களும் முடிந்ததும் `` ஃப்ரீ_ரிட்`` நிழலை தூய்மை செய்வதை ஒத்திவைக்கப்படும்.
uk: Зауважте, що ми не використовуємо наш м’ютекс тут, хоча ми створюємо наш шейдер всередині нашого потоку візуалізації. Методи на нашому сервері візуалізації є потокобезпечними, і ``free_rid`` буде відкладено очищення шейдера до завершення будь-яких кадрів, які зараз візуалізуються.
zh_cn: 请注意，即使我们在渲染线程内创建了着色器，我们也不会在此处使用互斥锁。我们的渲染服务器上的方法是线程安全的，并且 ``free_rid`` 将推迟清理着色器，将其推迟到当前正在渲染的所有帧都完成之后。
zh_tw: 請注意，雖然我們在渲染執行緒中建立著色器，但這裡並未使用 mutex。渲染伺服器的方法是執行緒安全的，``free_rid`` 會等到目前正在渲染的所有畫面結束後，才會釋放著色器資源。

source: Also note that we are not freeing our pipeline. The rendering device does dependency tracking and as the pipeline is dependent on the shader, it will be automatically freed when the shader is destructed.
de: Beachten Sie auch, dass wir unsere Pipeline nicht freigeben. Das Rendering-Gerät führt eine Abhängigkeitsverfolgung durch und da die Pipeline vom Shader abhängig ist, wird sie automatisch freigegeben, wenn der Shader zerstört wird.
ga: Tabhair faoi deara freisin nach bhfuilimid ag saoradh ár bpíblíne. Déanann an gléas rindreála rianú spleáchais agus toisc go bhfuil an píblíne ag brath ar an scáthóir, saorófar é go huathoibríoch nuair a dhéantar an scáthóir a scriosadh.
ru: Также обратите внимание, что мы не освобождаем наш конвейер. Устройство рендеринга отслеживает зависимости, и поскольку конвейер зависит от шейдера, он будет автоматически освобожден при уничтожении шейдера.
ta: நாங்கள் எங்கள் குழாய்த்திட்டத்தை விடுவிக்கவில்லை என்பதையும் நினைவில் கொள்க. வழங்குதல் சாதனம் சார்பு கண்காணிப்பைச் செய்கிறது மற்றும் குழாய் நிழலைப் பொறுத்தது என்பதால், சேடர் அழிக்கப்படும் போது அது தானாகவே விடுவிக்கப்படும்.
uk: Також зауважте, що ми не звільняємо наш трубопровід. Пристрій візуалізації виконує відстеження залежностей, і оскільки конвеєр залежить від шейдера, він буде автоматично звільнено, коли шейдер буде знищено.
zh_cn: 还要注意，我们无需释放管线。渲染设备会进行依赖跟踪，由于管线依赖于着色器，因此当着色器被销毁时，管线会被自动释放。
zh_tw: 同時也請注意，這邊沒有手動釋放 pipeline。渲染裝置會自動追蹤相依性，pipeline 依賴著色器，因此當著色器被銷毀時 pipeline 也會自動釋放。

source: From this point onwards our code will run on the rendering thread.
de: Von diesem Zeitpunkt an wird unser Code auf dem Rendering-Thread ausgeführt.
ga: Ón bpointe seo ar aghaidh rithfidh ár gcód ar an snáithe rindreála.
ru: С этого момента наш код будет выполняться в потоке рендеринга.
ta: இந்த கட்டத்தில் இருந்து எங்கள் குறியீடு வழங்குதல் நூலில் இயங்கும்.
uk: З цього моменту наш код буде працювати в потоці візуалізації.
zh_cn: 从此刻起，我们的代码将在渲染线程上运行。
zh_tw: 從這裡開始，我們的程式碼都會在渲染執行緒上執行。

source: Our next step is a helper function that will recompile the shader if the user code was changed.
de: Unser nächster Schritt ist eine Hilfsfunktion, die den Shader neu kompiliert, wenn der Benutzercode geändert wurde.
ga: Is é an chéad chéim eile atá againn ná feidhm chúntóra a dhéanfaidh an scáthóir a aththiomsú má athraíodh an cód úsáideora.
ru: Наш следующий шаг — вспомогательная функция, которая перекомпилирует шейдер, если пользовательский код был изменен.
ta: எங்கள் அடுத்த கட்டம் ஒரு உதவி செயல்பாடு, இது பயனர் குறியீடு மாற்றப்பட்டால் சேடரை மீண்டும் தொகுக்கும்.
uk: Наш наступний крок — допоміжна функція, яка перекомпілює шейдер, якщо код користувача було змінено.
zh_cn: 我们的下一步是一个辅助函数，它将在用户代码发生更改时重新编译着色器。
zh_tw: 接下來要實作一個輔助函式，當使用者的程式碼更動時，重新編譯著色器。

source: At the top of this method we again use our mutex to protect accessing our user shader code and our is dirty flag. We make a local copy of the user shader code if our user shader code is dirty.
de: Am Anfang dieser Methode verwenden wir wieder unseren Mutex, um den Zugriff auf unseren Benutzer-Shader-Code und unser "is dirty"-Flag zu schützen. Wir erstellen eine lokale Kopie des Benutzer-Shader-Codes, wenn unser Benutzer-Shader-Code "dirty" ist.
ga: Ag barr an mhodha seo úsáidimid ár mutex arís chun rochtain a fháil ar ár gcód scáthaithe úsáideora a chosaint agus ár mbratach salach atá againn. Déanaimid cóip áitiúil den chód shader úsáideora má tá ár gcód scáthaithe úsáideora salach.
ru: В начале этого метода мы снова используем мьютекс для защиты доступа к коду пользовательского шейдера и флаг "dirty". Мы создаём локальную копию кода пользовательского шейдера, если он "dirty".
ta: இந்த முறையின் மேற்புறத்தில், எங்கள் பயனர் சேடர் குறியீட்டை அணுகுவதைப் பாதுகாக்க மீண்டும் எங்கள் மியூடெக்சைப் பயன்படுத்துகிறோம், மேலும் எங்கள் அழுக்கு கொடி. எங்கள் பயனர் சேடர் குறியீடு அழுக்காக இருந்தால் பயனர் சேடர் குறியீட்டின் உள்ளக நகலை உருவாக்குகிறோம்.
uk: У верхній частині цього методу ми знову використовуємо наш м’ютекс, щоб захистити доступ до нашого коду шейдера користувача та прапор брудний. Ми робимо локальну копію коду шейдера користувача, якщо наш код шейдера користувача брудний.
zh_cn: 在这个方法的顶部，我们再次使用互斥锁来保护对用户着色器代码和脏标记的访问。如果我们的用户着色器代码脏了，我们会在本地线程中复制用户着色器代码。
zh_tw: 在這個方法的一開始，我們會再次使用 mutex 來保護對使用者著色器程式碼及已變更標記的存取。如果使用者著色器程式碼已變更，就複製一份本地副本。

source: If we don't have a new code fragment, we return true if we already have a valid pipeline.
de: Wenn wir kein neues Codefragment haben, geben wir true zurück, wenn wir bereits eine gültige Pipeline haben.
ga: Mura bhfuil blúire cód nua againn, filleann muid fíor má tá píblíne bailí againn cheana féin.
ru: Если у нас нет нового фрагмента кода, мы возвращаем true, если у нас уже есть действительный конвейер.
ta: எங்களிடம் புதிய குறியீடு துண்டு இல்லையென்றால், ஏற்கனவே சரியான குழாய் இருந்தால் நாங்கள் உண்மையாகத் திரும்புவோம்.
uk: Якщо у нас немає нового фрагмента коду, ми повертаємо true, якщо ми вже маємо дійсний конвеєр.
zh_cn: 如果我们没有新的代码片段，并且我们已经有一个有效的管线，我们就返回 true。
zh_tw: 如果沒有新的程式碼片段，且已經有有效的 pipeline，就回傳 true。

source: If we do have a new code fragment we embed it in our template code and then compile it.
de: Wenn wir ein neues Codefragment haben, betten wir es in unseren Vorlagencode ein und kompilieren es dann.
ga: Má tá blúnóg cód nua againn déanaimid é a leabú inár gcód teimpléad agus ansin é a thiomsú.
ru: Если у нас есть новый фрагмент кода, мы встраиваем его в код нашего шаблона, а затем компилируем его.
ta: எங்களிடம் ஒரு புதிய குறியீடு துண்டு இருந்தால், அதை எங்கள் வார்ப்புரு குறியீட்டில் உட்பொதித்து தொகுக்கவும்.
uk: Якщо у нас є новий фрагмент коду, ми вставляємо його в код нашого шаблону, а потім компілюємо.
zh_cn: 如果我们确实有新的代码片段，我们会将其嵌入到我们的模板代码中，然后进行编译。
zh_tw: 如果有新的程式碼片段，則將其嵌入範本程式碼後進行編譯。

source: The code shown here compiles our new code in runtime. This is great for prototyping as we can immediately see the effect of the changed shader.
de: Der hier gezeigte Code kompiliert unseren neuen Code während der Laufzeit. Dies eignet sich hervorragend für das Prototyping, da wir die Auswirkungen des geänderten Shaders sofort sehen können.
ga: Tiomsaíonn an cód a thaispeántar anseo ár gcód nua i rith. Tá sé seo iontach le haghaidh fréamhshamhlú mar is féidir linn éifeacht an scáthaitheora athraithe a fheiceáil láithreach.
ru: Приведённый здесь код компилирует наш новый код во время выполнения. Это отлично подходит для создания прототипов, поскольку мы сразу видим эффект от изменённого шейдера.
ta: இங்கே காட்டப்பட்டுள்ள குறியீடு எங்கள் புதிய குறியீட்டை இயக்க நேரத்தில் தொகுக்கிறது. மாற்றப்பட்ட சேடரின் விளைவை நாம் உடனடியாகக் காண முடியும் என்பதால் இது முன்மாதிரிக்கு சிறந்தது.
uk: Показаний тут код компілює наш новий код під час виконання. Це чудово підходить для прототипування, оскільки ми можемо відразу побачити ефект зміненого шейдера.
zh_cn: 此处显示的代码将在运行时中编译我们的新代码。这对于原型设计非常有用，因为我们可以立即看到更改后的着色器的效果。
zh_tw: 這裡的程式碼會在執行時即時編譯新的程式碼。這對於原型設計很有幫助，因為可以立刻看到著色器變更的效果。

source: This prevents precompiling and caching this shader which may be an issues on some platforms such as consoles. Note that the demo project comes with an alternative example where a ``glsl`` file contains the entire compute shader and this is used. Godot is able to precompile and cache the shader with this approach.
de: Dies verhindert die Vorkompilierung und das Zwischenspeichern dieses Shaders, was auf einigen Plattformen wie Konsolen ein Problem darstellen kann. Beachten Sie, dass das Demoprojekt ein alternatives Beispiel enthält, bei dem eine ``glsl``-Datei den gesamten Compute-Shader enthält und diese verwendet wird. Godot ist in der Lage, den Shader mit diesem Ansatz vorzukompilieren und zu cachen.
ga: Cuireann sé seo cosc ar an scáthóir seo a réamhthiomsú agus a chaitheamh a d'fhéadfadh a bheith ina shaincheisteanna ar roinnt ardáin mar chonsóil. Tabhair faoi deara go dtagann sampla malartach sa tionscadal taispeána ina bhfuil an scáthóir ríomhaireachta iomlán i gcomhad ``glsl`` agus úsáidtear é seo. Tá Godot in ann an scáthóir a réamhthiomsú agus a thaisceadh leis an gcur chuige seo.
ru: Это предотвращает предварительную компиляцию и кэширование этого шейдера, что может вызывать проблемы на некоторых платформах, например, на консолях. Обратите внимание, что демонстрационный проект содержит альтернативный пример, в котором файл ``glsl`` содержит весь вычислительный шейдер, и он используется. Godot может предварительно компилировать и кэшировать шейдер, используя этот подход.
ta: இது இந்த சேடரை முன்கூட்டியே தொகுத்தல் மற்றும் தற்காலிக சேமிப்பைத் தடுக்கிறது, இது கன்சோல்கள் போன்ற சில தளங்களில் சிக்கலாக இருக்கலாம். டெமோ திட்டம் ஒரு மாற்று உதாரணத்துடன் வருகிறது என்பதை நினைவில் கொள்க, அங்கு ஒரு `` சி.எல்.எச்.எல்`` கோப்பில் முழு கம்ப்யூட் சேடரும் உள்ளது, இது பயன்படுத்தப்படுகிறது. இந்த அணுகுமுறையால் கோடோட் சேடரை முன்கூட்டியே மற்றும் கேச் செய்ய முடிகிறது.
uk: Це запобігає попередній компіляції та кешування цього шейдера, що може бути проблемою на деяких платформах, таких як консолі. Зауважте, що демонстраційний проект постачається з альтернативним прикладом, де файл ``glsl`` містить весь обчислювальний шейдер, і це використовується. За допомогою цього підходу Godot може попередньо скомпілювати та кешувати шейдер.
zh_cn: 这可以防止预编译和缓存此着色器，这在类似主机的某些平台上可能是一个问题。请注意，演示项目附带了一个替代示例，其中 ``glsl`` 文件包含整个计算着色器，并且使用它。Godot 能够使用此方法预编译和缓存着色器。
zh_tw: 這樣做會導致無法預先編譯和快取著色器，這在某些平台（如遊戲主機）上可能會造成問題。請注意，展示專案中也有另一種做法：將完整運算著色器寫在 ``.glsl`` 檔案中，然後載入。Godot 可以透過這種方式來預先編譯並快取著色器。

source: Finally we need to implement our effect callback, the rendering engine will call this at the right stage of rendering.
de: Schließlich müssen wir unseren Effekt-Callback implementieren, den die Rendering-Engine in der richtigen Phase des Renderings aufrufen wird.
ga: Faoi dheireadh ní mór dúinn ár n-aisghlao éifeacht a chur i bhfeidhm, glaóidh an t-inneall rindreála air seo ag an gcéim cheart den rindreáil.
ru: Наконец, нам нужно реализовать обратный вызов нашего эффекта, движок рендеринга вызовет его на нужном этапе рендеринга.
ta: இறுதியாக எங்கள் விளைவு கால்பேக்கை நாம் செயல்படுத்த வேண்டும், வழங்குதல் எஞ்சின் இதை வழங்குதல் சரியான கட்டத்தில் அழைக்கும்.
uk: Нарешті, нам потрібно реалізувати наш зворотний виклик ефекту, механізм візуалізації викличе це на потрібному етапі рендерингу.
zh_cn: 最后我们需要实现我们的效果回调，渲染引擎将在渲染的正确阶段调用它。
zh_tw: 最後要實作特效的回呼函式，渲染引擎會在正確的渲染階段呼叫它。

source: At the start of this method we check if we have a rendering device, if our callback type is the correct one, and check if we have our shader.
de: Zu Beginn dieser Methode prüfen wir, ob wir ein Rendering Device haben, ob unser Callback-Typ der richtige ist und ob wir unseren Shader haben.
ga: Ag tús an mhodha seo seiceáilimid an bhfuil gléas rindreála againn, más é ár gcineál aisghlaonna an ceann ceart, agus seiceáilimid an bhfuil ár scáthóir againn.
ru: В начале этого метода мы проверяем, есть ли у нас устройство рендеринга, правильный ли у нас тип обратного вызова и есть ли у нас шейдер.
ta: இந்த முறையின் தொடக்கத்தில், எங்களிடம் வழங்குதல் சாதனம் இருக்கிறதா என்று சரிபார்க்கிறோம், எங்கள் கால்பேக் வகை சரியானதாக இருந்தால், எங்கள் சேடர் இருக்கிறதா என்று சரிபார்க்கவும்.
uk: На початку цього методу ми перевіряємо, чи є у нас пристрій візуалізації, чи є наш тип зворотного виклику правильним, а також перевіряємо, чи є у нас шейдер.
zh_cn: 在这个方法开始时，我们检查是否有渲染设备，回调类型是否正确，以及检查是否有着色器。
zh_tw: 在此方法開始時，會檢查是否有渲染裝置、回呼類型是否正確，以及是否已經有著色器。

source: The check for the effect type is only a safety mechanism. We've set this in our ``_init`` function, however it is possible for the user to change this in the UI.
de: Die Prüfung auf den Effekttyp ist nur ein Sicherheitsmechanismus. Wir haben dies in unserer ``_init``-Funktion festgelegt, aber es ist möglich, dass der Benutzer dies in der Benutzeroberfläche ändert.
ga: Níl ach meicníocht sábháilteachta an seiceáil don chineál éifeachta. Tá sé seo socraithe againn inár bhfeidhm ``_init``, ach is féidir don úsáideoir é seo a athrú sa UI.
ru: Проверка типа эффекта — всего лишь механизм безопасности. Мы задали её в функции ``_init``, однако пользователь может изменить её в пользовательском интерфейсе.
ta: விளைவு வகைக்கான காசோலை ஒரு பாதுகாப்பு வழிமுறை மட்டுமே. இதை எங்கள் `` _init`` செயல்பாட்டில் அமைத்துள்ளோம், இருப்பினும் பயனருக்கு இதை இடைமுகம் இல் மாற்ற முடியும்.
uk: Перевірка типу ефекту є лише механізмом безпеки. Ми встановили це у нашій функції ``_init``, однак користувач може змінити це в інтерфейсі користувача.
zh_cn: 检查效果类型只是一种安全机制。我们在 ``_init`` 函数中设置了它，但用户可以在 UI 中更改它。
zh_tw: 檢查特效類型只是安全機制。我們已經在 ``_init`` 函式中設定，但使用者也有可能在 UI 中修改這個設定。

source: Our ``p_render_data`` parameter gives us access to an object that holds data specific to the frame we're currently rendering. We're currently only interested in our render scene buffers, which provide us access to all the internal buffers used by the rendering engine. Note that we cast this to :ref:`RenderSceneBuffersRD <class_RenderSceneBuffersRD>` to expose the full API to this data.
de: Unser Parameter ``p_render_data`` gibt uns Zugriff auf ein Objekt, das Daten enthält, die spezifisch für den Frame sind, den wir gerade rendern. Im Moment sind wir nur an den Puffern unserer Render-Szene interessiert, die uns Zugang zu allen internen Puffern geben, die von der Rendering-Engine verwendet werden. Beachten Sie, dass wir dies in :ref:`RenderSceneBuffersRD <class_RenderSceneBuffersRD>` umwandeln, um die vollständige API für diese Daten freizugeben.
ga: Tugann ár bparaiméadar ``p_render_data`` rochtain dúinn ar réad a choinníonn sonraí a bhaineann go sonrach leis an bhfráma atá á rindreáil againn faoi láthair. Níl spéis againn faoi láthair ach inár maoláin radhairc rindreála, a thugann rochtain dúinn ar na maoláin inmheánacha go léir a úsáideann an t-inneall rindreála. Tabhair faoi deara gur chaitheamar é seo chuig :ref:`RenderSceneBuffersRD <class_RenderSceneBuffersRD>` chun an API iomlán a nochtadh do na sonraí seo.
ru: Наш параметр ``p_render_data`` предоставляет нам доступ к объекту, содержащему данные, относящиеся к текущему кадру, который мы рендерим. В настоящее время нас интересуют только буферы сцены рендеринга, которые предоставляют доступ ко всем внутренним буферам, используемым движком рендеринга. Обратите внимание, что мы приводим этот параметр к :ref:`RenderSceneBuffersRD <class_RenderSceneBuffersRD>`, чтобы предоставить полный API для работы с этими данными.
ta: எங்கள் `` p_render_data`` அளவுரு நாம் தற்போது வழங்கும் சட்டகத்திற்கு குறிப்பிட்ட தரவை வைத்திருக்கும் ஒரு பொருளுக்கு அணுகலை வழங்குகிறது. எங்கள் வழங்குதல் காட்சி இடையகங்களில் மட்டுமே நாங்கள் ஆர்வமாக உள்ளோம், இது வழங்குதல் எஞ்சின் பயன்படுத்தும் அனைத்து உள் இடையகங்களுக்கும் அணுகலை வழங்குகிறது. இதை நாங்கள் இதற்கு அனுப்புகிறோம் என்பதை நினைவில் கொள்க: குறிப்பு: `renderscenebuffersrd <class_renderscenebuffersrd>` இந்த தரவுக்கு முழு பநிஇ ஐ அம்பலப்படுத்த.
uk: Наш параметр ``p_render_data`` надає нам доступ до об’єкта, який містить дані, специфічні для кадру, який ми зараз візуалізуємо. Наразі нас цікавлять лише наші буфери сцени візуалізації, які надають нам доступ до всіх внутрішніх буферів, що використовуються механізмом рендерингу. Зауважте, що ми передаємо це в :ref:`RenderSceneBuffersRD <class_RenderSceneBuffersRD>`, щоб відкрити повний API для цих даних.
zh_cn: 我们的 ``p_render_data`` 参数使我们能够访问一个对象，该对象保存了当前正在渲染的帧的特定数据。我们目前只对我们的渲染场景缓冲区感兴趣，它使我们能够访问渲染引擎使用的所有内部缓冲区。请注意，我们将其转换为 :ref:`RenderSceneBuffersRD <class_RenderSceneBuffersRD>` 以公开此数据的完整 API。
zh_tw: ``p_render_data`` 參數讓我們可以存取目前渲染畫面所用的資料物件。目前我們只需要用到場景渲染緩衝區，這會提供對渲染引擎所有內部緩衝區的存取權限。請注意，這裡我們會將其轉型為 :ref:`RenderSceneBuffersRD <class_RenderSceneBuffersRD>` 以使用完整 API。

source: Next we obtain our ``internal size`` which is the resolution of our 3D render buffers before they are upscaled (if applicable), upscaling happens after our post processes have run.
de: Als nächstes erhalten wir unsere ``interne Größe``, also die Auflösung unserer 3D-Renderpuffer, bevor sie hochskaliert werden (falls zutreffend); die Hochskalierung erfolgt, nachdem unsere Postprozesse gelaufen sind.
ga: Ansin faighimid ár “méid inmheánach” arb é sin réiteach ár mmaoláin rindreála 3D sula ndéantar iad a uasscálú (más infheidhme), tarlaíonn uasscálú tar éis dár bpróisis iar-bhunaithe rith.
ru: Затем мы получаем наш ``internal size``, который представляет собой разрешение наших буферов 3D-рендеринга до их масштабирования (если применимо), масштабирование происходит после завершения наших постпроцессов.
ta: அடுத்து, எங்கள் `` உள் அளவு`` ஐப் பெறுகிறோம், இது எங்கள் 3D வழங்குதல் இடையகங்களை உயர்த்துவதற்கு முன்பு (பொருந்தினால்) தீர்மானிக்கிறது (பொருந்தினால்), எங்கள் இடுகை செயல்முறைகள் இயங்கிய பிறகு அதிகரிப்பு நிகழ்கிறது.
uk: Далі ми отримуємо наш ``внутрішній розмір``, який є роздільною здатністю наших буферів 3D-рендерінгу перед їх збільшенням (якщо застосовно), збільшення відбувається після виконання наших постпроцесів.
zh_cn: 接下来，我们获得我们的\ ``内部尺寸``\ ，即我们的 3D 渲染缓冲区在放大之前的分辨率（如果适用），放大发生在我们的后期处理运行之后。
zh_tw: 接下來取得 ``internal size``，也就是 3D 渲染緩衝區在升頻（如果有的話）前的解析度。升頻會在所有後處理效果結束後才執行。

source: From our internal size we calculate our group size, see our local size in our template shader.
de: Aus unserer internen Größe berechnen wir unsere Gruppengröße, siehe unsere lokale Größe in unserem Template-Shader.
ga: Ónár méid inmheánach ríomhaímid méid ár ngrúpa, féach ár méid áitiúil inár scáthóir teimpléad.
ru: На основе нашего внутреннего размера мы рассчитываем размер нашей группы, смотрите наш локальный размер в нашем шаблонном шейдере.
ta: எங்கள் உள் அளவிலிருந்து நாங்கள் எங்கள் குழு அளவைக் கணக்கிடுகிறோம், எங்கள் வார்ப்புரு சேடரில் எங்கள் உள்ளக அளவைக் காண்க.
uk: Виходячи з нашого внутрішнього розміру, ми обчислюємо розмір нашої групи, дивіться наш локальний розмір у нашому шейдері шаблону.
zh_cn: 根据我们的内部大小，我们计算出我们的分组大小，在我们的模板着色器中查看我们的局部大小。
zh_tw: 根據 internal size 計算群組大小，詳見著色器範本程式碼中的 local size。

source: We also populate our push constant so our shader knows our size. Godot does not support structs here **yet** so we use a ``PackedFloat32Array`` to store this data into. Note that we have to pad this array with a 16 byte alignment. In other words, the length of our array needs to be a multiple of 4.
de: Wir füllen auch unsere Push-Konstante aus, damit unser Shader unsere Größe kennt. Godot unterstützt hier **noch** keine Structs, also benutzen wir ein ``PackedFloat32Array`` um diese Daten zu speichern. Beachten Sie, dass wir dieses Array mit einem 16 Byte Alignment auffüllen müssen. Mit anderen Worten, die Länge unseres Arrays muss ein Vielfaches von 4 sein.
ga: Déanaimid ár gcomhsheasmhach brú freisin ionas go bhfuil a fhios ag ár scáthaitheoir ár méid. Ní thacaíonn Godot le struchtúir anseo **fós ** mar sin úsáidimid ``PackedFloat32Array`` chun na sonraí seo a stóráil isteach. Tabhair faoi deara go gcaithfimid an tsraith seo a phapáil le ailíniú 16 byte. Is é sin le rá, caithfidh fad ár n-eagar a bheith ina iolrach de 4.
ru: Мы также заполняем нашу константу push, чтобы шейдер знал наш размер. Godot **пока** не поддерживает структуры, поэтому мы используем ``PackedFloat32Array`` для хранения этих данных. Обратите внимание, что нам нужно дополнить этот массив выравниванием по 16 байт. Другими словами, длина нашего массива должна быть кратна 4.
ta: நாங்கள் எங்கள் புச் மாறிலியையும் விரிவுபடுத்துகிறோம், எனவே எங்கள் சேடருக்கு எங்கள் அளவு தெரியும். கோடோட் இங்கே கட்டமைப்புகளை ஆதரிக்கவில்லை ** இன்னும் ** எனவே இந்தத் தரவைச் சேமிக்க `` பேக்ஃப்ளோட் 32ARRAY`` ஐப் பயன்படுத்துகிறோம். இந்த வரிசையை 16 பைட் சீரமைப்புடன் நாம் திணிக்க வேண்டும் என்பதை நினைவில் கொள்க. வேறு வார்த்தைகளில் கூறுவதானால், எங்கள் வரிசையின் நீளம் 4 இன் பெருக்கமாக இருக்க வேண்டும்.
uk: Ми також заповнюємо константу push, щоб наш шейдер знав наш розмір. Godot **поки що** не підтримує структури, тому ми використовуємо ``PackedFloat32Array`` для зберігання цих даних. Зверніть увагу, що ми повинні доповнити цей масив 16-байтовим вирівнюванням. Іншими словами, довжина нашого масиву має бути кратною 4.
zh_cn: 我们还填充了推送常量，以便着色器知道大小。Godot 暂时\ **不**\ 支持结构体，因此我们使用 ``PackedFloat32Array`` 来存储这些数据。请注意，我们必须用 16 字节对齐填充该数组。换句话说，我们的数组长度需要是 4 的倍数。
zh_tw: 我們也會設定 push constant，讓著色器知道目前的大小。Godot 目前 **尚未** 支援 struct，因此我們用 ``PackedFloat32Array`` 來存放這些資料。請注意，這個陣列必須以 16 位元組對齊，也就是說長度必須是 4 的倍數。
