Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/compositor.po
Languages: de, ga, ru, ta, uk, zh_cn, zh_tw

source: Now we loop through our views, this is in case we're using multiview rendering which is applicable for stereo rendering (XR). In most cases we will only have one view.
de: Jetzt durchlaufen wir unsere Views in einer Schleife, falls wir das Multiview-Rendering verwenden, das für das Stereo-Rendering (XR) geeignet ist. In den meisten Fällen werden wir nur einen View haben.
ga: Anois déanaimid lúb trínár dtuairimí, is é seo i gcás go bhfuilimid ag úsáid rindreáil il-amharc atá infheidhme maidir le rindreáil steirió (XR). I bhformhór na gcásanna ní bheidh ach dearcadh amháin againn.
ru: Теперь мы циклически проходим по нашим представлениям. Это на случай, если мы используем многовидовой рендеринг, который применим для стереорендеринга (XR). В большинстве случаев у нас будет только одно представление.
ta: இப்போது நாங்கள் எங்கள் கருத்துக்களைக் கொண்டுள்ளோம், இது ச்டீரியோ வழங்குதல் (எக்ச்ஆர்) க்கு பொருந்தக்கூடிய மல்டிவியூ வழங்குதல் பயன்படுத்தினால் இது. பெரும்பாலான சந்தர்ப்பங்களில் எங்களுக்கு ஒரே ஒரு பார்வை மட்டுமே இருக்கும்.
uk: Тепер ми переглядаємо наші перегляди, це на випадок, якщо ми використовуємо мультиракурсний рендеринг, який застосовний для стереорендерінгу (XR). У більшості випадків ми матимемо лише один вид.
zh_cn: 现在我们循环遍历视图，以防我们使用适用于立体渲染（XR）的多视图渲染。大多数情况下，我们只有一个视图。
zh_tw: 現在我們要遍歷所有 view，這是為了支援多視圖渲染（例如 XR 立體渲染）。大多數情況下只會有一個 view。

source: There is no performance benefit to use multiview for post processing here, handling the views separately like this will still enable the GPU to use parallelism if beneficial.
de: Die Verwendung von Multiview für die Nachbearbeitung bringt hier keinen Performance-Vorteil. Durch die getrennte Behandlung der Ansichten kann der Grafikprozessor die Parallelisierung dennoch nutzen, wenn dies sinnvoll ist.
ga: Níl aon sochar feidhmíochta ann multiview a úsáid le haghaidh iar-phróiseála anseo, cuirfidh na tuairimí a láimhseáil ar leithligh mar seo ar chumas an GPU comhthreomhaíocht a úsáid má tá sé tairbheach.
ru: В данном случае использование нескольких представлений для постобработки не дает никаких преимуществ в производительности, однако раздельная обработка представлений, подобная этой, все равно позволит графическому процессору использовать параллелизм, если это выгодно.
ta: இங்கே பிந்தைய செயலாக்கத்திற்கு மல்டிவியூவை பயன்படுத்த செயல்திறன் நன்மை இல்லை, இது போன்ற காட்சிகளை தனித்தனியாகக் கையாள்வது சி.பீ.யை நன்மை பயக்கும் என்றால் இணையான தன்மையைப் பயன்படுத்த உதவும்.
uk: Немає ніякої переваги в продуктивності від використання multiview для постобробки тут, обробка переглядів окремо, як це, все одно дозволить GPU використовувати паралелізм, якщо це вигідно.
zh_cn: 此处使用多视图进行后处理并没有性能优势，像这样单独处理视图仍然可以使 GPU 在有利的情况下使用并行性。
zh_tw: 在這裡使用多視圖對後處理沒有效能上的好處，但分別處理各個 view 的方式，仍能讓 GPU 視需要使用平行運算。

source: Next we obtain the color buffer for this view. This is the buffer into which our 3D scene has been rendered.
de: Als nächstes erhalten wir den Farbpuffer für diese Ansicht. Dies ist der Puffer, in den unsere 3D-Szene gerendert wurde.
ga: Ansin faighimid an maolán dathanna don radharc seo. Is é seo an maolán inar rinneadh ár radharc 3D isteach.
ru: Затем мы получаем цветовой буфер для этого вида. Это буфер, в который была отрендерена наша 3D-сцена.
ta: அடுத்து இந்த பார்வைக்கு வண்ண இடையகத்தைப் பெறுகிறோம். எங்கள் 3D காட்சி வழங்கப்பட்ட இடையகமாகும்.
uk: Далі ми отримуємо кольоровий буфер для цього перегляду. Це буфер, у який було відтворено нашу 3D-сцену.
zh_cn: 接下来我们获取该视图的颜色缓冲区。这是我们的 3D 场景被渲染到的缓冲区。
zh_tw: 接下來取得該 view 的顏色緩衝區，也就是 3D 場景渲染結果所儲存的緩衝區。

source: We then prepare a uniform set so we can communicate the color buffer to our shader.
de: Dann bereiten wir ein Uniform-Set vor, damit wir den Farbpuffer an unseren Shader weitergeben können.
ga: Ansin ullmhaímid tacar aonfhoirmeach ionas gur féidir linn an maolán dathanna a chur in iúl dár scáthóir.
ru: Затем мы подготавливаем единый набор, чтобы иметь возможность передать цветовой буфер нашему шейдеру.
ta: நாங்கள் ஒரு சீரான தொகுப்பை ஆயத்தம் செய்கிறோம், எனவே வண்ண இடையகத்தை எங்கள் சேடருக்கு தொடர்பு கொள்ளலாம்.
uk: Потім ми готуємо однорідний набір, щоб ми могли передати колірний буфер нашому шейдеру.
zh_cn: 然后我们准备一个统一的集合，以便我们可以将颜色缓冲区传递给我们的着色器。
zh_tw: 然後準備一組 uniform set，用來將顏色緩衝區傳遞給著色器。

source: Note the use of our :ref:`UniformSetCacheRD <class_UniformSetCacheRD>` cache which ensures we can check for our uniform set each frame. As our color buffer can change from frame to frame and our uniform cache will automatically clean up uniform sets when buffers are freed, this is the safe way to ensure we do not leak memory or use an outdated set.
de: Beachten Sie die Verwendung unseres :ref:`UniformSetCacheRD <class_UniformSetCacheRD>`-Caches, der sicherstellt, dass wir bei jedem Frame nach unserem Uniform-Set suchen können. Da sich unser Farbpuffer von Frame zu Frame ändern kann und unser UniformSet-Cache automatisch die UniformSets aufräumt, wenn die Puffer freigegeben werden, ist dies der sichere Weg, um sicherzustellen, dass wir kein Speicherleck produzieren oder ein veraltetes Set verwenden.
ga: Tabhair faoi deara úsáid ár taisce :ref:`UniformSetCacheRD <class_UniformSetCacheRD>` a chinntíonn gur féidir linn a sheiceáil le haghaidh ár n-éide tacair gach fráma. Toisc gur féidir lenár maolán datha athrú ó fhráma go fráma agus glanfaidh ár dtaisce aonfhoirmeach tacair aonfhoirmeacha go huathoibríoch nuair a scaoiltear maoláin, is é seo an bealach sábháilte chun a chinntiú nach sceitheadh cuimhne nó úsáidimid sraith atá as dáta.
ru: Обратите внимание на использование нашего кэша :ref:`UniformSetCacheRD <class_UniformSetCacheRD>`, который гарантирует проверку нашего набора юниформ в каждом кадре. Поскольку буфер цветов может меняться от кадра к кадру, а кэш юниформ автоматически очищает наборы юниформ при освобождении буферов, это безопасный способ избежать утечки памяти или использования устаревшего набора.
ta: எங்கள் பயன்பாட்டைக் கவனியுங்கள்: ref: `intiformsetcacherd <class_uniformetCacherd>` கேச், இது ஒவ்வொரு சட்டத்தையும் எங்கள் சீரான தொகுப்பைச் சரிபார்க்க முடியும் என்பதை உறுதி செய்கிறது. எங்கள் வண்ண இடையகம் சட்டத்திலிருந்து சட்டகத்திற்கு மாறக்கூடும், மேலும் இடையகங்கள் விடுவிக்கப்படும்போது எங்கள் சீரான தற்காலிக சேமிப்பு தானாகவே சீரான தொகுப்புகளை தூய்மை செய்யும் என்பதால், நாங்கள் நினைவகத்தை கசியவிடாமல் அல்லது காலாவதியான தொகுப்பைப் பயன்படுத்தவில்லை என்பதை உறுதிப்படுத்த இது பாதுகாப்பான வழியாகும்.
uk: Зверніть увагу на використання нашого :ref:`UniformSetCacheRD <class_UniformSetCacheRD>` кешу, який гарантує, що ми можемо перевіряти наш уніфікований набір кожного кадру. Оскільки наш буфер кольорів може змінюватися від кадру до кадру, а наш уніфікований кеш автоматично очищатиме уніфіковані набори, коли буфери звільняються, це безпечний спосіб гарантувати, що ми не втратимо пам’ять або не використаємо застарілий набір.
zh_cn: 请注意我们使用 :ref:`UniformSetCacheRD <class_UniformSetCacheRD>` 缓存，以确保我们可以每帧检查 uniform 集。由于我们的颜色缓冲区可以逐帧更改，并且我们的 uniform 缓存会在缓冲区释放时自动清理 uniform 集，因此这是确保我们不泄漏内存或使用过时集的安全方法。
zh_tw: 請注意，我們使用 :ref:`UniformSetCacheRD <class_UniformSetCacheRD>` 快取，這樣每一幀都可以檢查目前的 uniform set。由於顏色緩衝區每幀都可能不同，uniform 快取也會在緩衝區被釋放時自動清理，這樣才能確保不會有記憶體洩漏或用到過期的 set。

source: Finally we build our compute list by binding our pipeline, binding our uniform set, pushing our push constant data, and calling dispatch for our groups.
de: Zum Schluss bauen wir unsere Berechnungsliste auf, indem wir unsere Pipeline binden, unsere einheitliche Menge binden, unsere Push-Konstanten-Daten übertragen und Dispatch für unsere Gruppen aufrufen.
ga: Mar fhocal scoir déanaimid ár liosta ríomha a thógáil trínár bpíblíne a cheangal, ár dtacar aonfhoirmeach a cheangal, ár sonraí tairiseacha brú a bhrú, agus seolta a chur chuig ár ngrúpaí.
ru: Наконец, мы создаем наш список вычислений, привязывая наш конвейер, привязывая наш унифицированный набор, отправляя наши постоянные данные и вызывая диспетчеризацию для наших групп.
ta: இறுதியாக எங்கள் குழாய்த்திட்டத்தை பிணைப்பதன் மூலமும், எங்கள் சீரான தொகுப்பை பிணைப்பதன் மூலமும், எங்கள் புச் நிலையான தரவைத் தள்ளுவதன் மூலமும், எங்கள் குழுக்களுக்கு அனுப்புவதை அழைப்பதன் மூலமும் எங்கள் கம்ப்யூட் பட்டியலை உருவாக்குகிறோம்.
uk: Нарешті ми створюємо наш список обчислень, прив’язуючи наш конвеєр, прив’язуючи наш уніфікований набір, надсилаючи наші дані push-константи та викликаючи диспетчеризацію для наших груп.
zh_cn: 最后，我们通过绑定管线、绑定 uniform 集、推送推送常量数据、以及为我们的组调用调度，来构建我们的计算列表。
zh_tw: 最後，綁定 pipeline 與 uniform set，推送 push constant 資料，並對所有群組呼叫 dispatch，來組建運算清單。

source: With our compositor effect completed, we now need to add it to our compositor.
de: Nachdem unser Kompositor-Effekt fertiggestellt ist, müssen wir ihn nun zu unserem Kompositor hinzufügen.
ga: Agus ár n-éifeacht cumadóir críochnaithe, ní mór dúinn anois é a chur lenár gcumadóir.
ru: После завершения нашего эффекта композитора нам нужно добавить его в наш композитор.
ta: எங்கள் இசையமைப்பாளர் விளைவு முடிந்தவுடன், இப்போது அதை எங்கள் இசையமைப்பாளரிடம் சேர்க்க வேண்டும்.
uk: Коли наш композитор завершено, тепер нам потрібно додати його до нашого композитора.
zh_cn: 合成器效果完成后，我们现在需要将其添加到合成器中。
zh_tw: 完成合成器特效後，現在要將它加入合成器。

source: On our compositor we expand the compositor effects property and press ``Add Element``.
de: In unserem Kompositor erweitern wir die Property "Kompositor-Effekte" und drücken auf ``Element hinzufügen``.
ga: Ar ár gcumadóir leathnaímid maoin na héifeachtaí cumadóirí agus brúimid ``Add Elements ``.
ru: В нашем композиторе раскрываем свойство эффектов композитора и нажимаем ``Add Element``.
ta: எங்கள் இசையமைப்பாளரில் நாங்கள் கலவை விளைவுகள் சொத்தை விரிவுபடுத்தி `` உறுப்பைச் சேர்`` ஐ அழுத்துகிறோம்.
uk: У нашому композиторі ми розгортаємо властивість ефектів композитора та натискаємо ``Додати елемент``.
zh_cn: 在合成器上，我们扩展合成器效果属性并按 ``Add Element``\ 。
zh_tw: 在合成器中展開「合成器特效」屬性，然後按下「新增元素」。

source: Now we can add our compositor effect:
de: Jetzt können wir unseren Kompositor-Effekt hinzufügen:
ga: Anois is féidir linn ár n-éifeacht cumadóir a chur leis:
ru: Теперь мы можем добавить наш эффект композитора:
ta: இப்போது நாம் எங்கள் கலவை விளைவைச் சேர்க்கலாம்:
uk: Тепер ми можемо додати наш ефект композитора:
zh_cn: 现在我们可以添加合成器效果：
zh_tw: 現在就可以新增我們的合成器特效：

source: After selecting our ``PostProcessShader`` we need to set our user shader code:
de: Nachdem wir unseren ``PostProcessShader`` ausgewählt haben, müssen wir unseren Benutzer-Shader-Code einstellen:
ga: Tar éis dúinn ár “PostProcessShader” a roghnú ní mór dúinn ár gcód scáthaithe úsáideora a shocrú:
ru: После выбора нашего ``PostProcessShader`` нам нужно установить код шейдера пользователя:
ta: எங்கள் `` இடுகை செயல்முறை சேடரைத் தேர்ந்தெடுத்த பிறகு, உங்கள் பயனர் சேடர் குறியீட்டை நாங்கள் அமைக்க வேண்டும்:
uk: Після вибору нашого ``Post Process Shader`` нам потрібно встановити код користувача шейдера:
zh_cn: 选择 ``PostProcessShader`` 后，我们需要设置你的用户着色器代码：
zh_tw: 選取 ``PostProcessShader`` 後，請輸入自訂著色器程式碼：

source: With that all done, our output is in grayscale.
de: Damit ist die Ausgabe in Graustufen erfolgt.
ga: Leis sin go léir déanta, tá ár n-aschur i scála liath.
ru: После всего этого наш вывод будет в оттенках серого.
ta: அதையெல்லாம் செய்து முடித்தால், எங்கள் வெளியீடு கிரேச்கேலில் உள்ளது.
uk: Після того, як усе зроблено, наш результат буде у відтінках сірого.
zh_cn: 完成这一切后，我们的输出是灰度的。
zh_tw: 完成以上步驟後，畫面輸出就會變成灰階。

source: For a more advanced example of post effects, check out the `Radial blur based sky rays <https://github.com/BastiaanOlij/RERadialSunRays>`_ example project created by Bastiaan Olij.
de: Ein fortgeschrittenes Beispiel für Post-Effekte finden Sie in dem Beispielprojekt `Radial blur based sky rays <https://github.com/BastiaanOlij/RERadialSunRays>`_ von Bastiaan Olij.
ga: Le haghaidh sampla níos forbartha d’iarmhairtí, féach ar an sampla `Ghathanna spéirbhunaithe gathacha <https://github.com/BastiaanOlij/RERadialSunRays>`_ cruthaithe ag Bastiaan Olij.
ru: Для более продвинутого примера постэффектов ознакомьтесь с примером проекта `Радиальное размытие на основе небесных лучей <https://github.com/BastiaanOlij/RERadialSunRays>`_, созданным Бастианом Олием.
ta: பிந்தைய விளைவுகளுக்கு மிகவும் மேம்பட்ட எடுத்துக்காட்டுக்கு, `ரேடியல் மங்கலான அடிப்படையிலான வான கதிர்கள் <https://github.com/bastiaanolij/reeradialsunrays>` _ பாச்டியான் ஓலிச் உருவாக்கிய எடுத்துக்காட்டு திட்டத்தைப் பாருங்கள்.
uk: Щоб отримати більш складний приклад постефектів, ознайомтеся з прикладом проекту `Промені неба на основі радіального розмиття <https://github.com/BastiaanOlij/RERadialSunRays>`_, створеного Бастіаном Олієм.
zh_cn: 有关后期效果的更高级示例，请查看由 Bastiaan Olij 创建的\ `基于径向模糊的天空光线 <https://github.com/BastiaanOlij/RERadialSunRays>`_\ 示例项目。
zh_tw: 若想參考更進階的後處理特效範例，可以看看 Bastiaan Olij 製作的 `基於徑向模糊的天空光暈 <https://github.com/BastiaanOlij/RERadialSunRays>`_ 範例專案。
