Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/compositor.po
Languages: de, ga, ru, ta, uk, zh_cn, zh_tw

source: The Compositor
de: Der Kompositor
ga: An Cumadóir
ru: Композитор
ta: தொகுப்பாளர்
uk: Композитор
zh_cn: 合成器
zh_tw: 合成器（Compositor）

source: The compositor is a new feature in Godot 4 that allows control over the rendering pipeline when rendering the contents of a :ref:`Viewport <class_Viewport>`.
de: Der Kompositor ist ein neues Feature in Godot 4, das die Kontrolle über die Rendering-Pipeline beim Rendern des Inhalts eines :ref:`Viewport <class_Viewport>` ermöglicht.
ga: Is gné nua é an cumadóir in Godot 4 a cheadaíonn rialú ar an bpíblíne rindreála agus inneachar :ref:`Viewport <class_Viewport>` á rindreáil.
ru: Композитор — это новая функция Godot 4, которая позволяет управлять конвейером рендеринга при рендеринге содержимого :ref:`Viewport <class_Viewport>`.
ta: ஒரு புதிய நற்பொருத்தம் கோடோட் 4 இல் ஒரு புதிய அம்சமாகும், இது A இன் உள்ளடக்கங்களை வழங்கும்போது வழங்குதல் பைப்லைன் மீது கட்டுப்படுத்த அனுமதிக்கிறது: ref: `ViewPort <class_viewport>`.
uk: Композитор — це нова функція в Godot 4, яка дозволяє контролювати конвеєр відтворення під час відтворення вмісту :ref:`Viewport <class_Viewport>`.
zh_cn: 合成器是 Godot 4 中的新功能，能够用来控制 :ref:`Viewport <class_Viewport>` 渲染内容时所使用的渲染管线。
zh_tw: 合成器是 Godot 4 的新功能，可讓你在渲染 :ref:`檢視區 <class_Viewport>` 內容時，控制渲染管線。

source: It can be configured on a :ref:`WorldEnvironment <class_WorldEnvironment>` node where it applies to all Viewports, or it can be configured on a :ref:`Camera3D <class_Camera3D>` and apply only to the Viewport using that camera.
de: Er kann auf einem :ref:`WorldEnvironment <class_WorldEnvironment>`-Node konfiguriert werden, wo er für alle Viewports gilt, oder er kann auf einem :ref:`Camera3D <class_Camera3D>` konfiguriert werden und gilt nur für den Viewport, der diese Kamera verwendet.
ga: Is féidir é a chumrú ar nód :ref:`WorldEnvironment <class_WorldEnvironment>` nuair a bhaineann sé le gach Amharc, nó is féidir é a chumrú ar :ref:`Camera3D <class_Camera3D>` agus cuir i bhfeidhm ar an Viewport amháin ag baint úsáide as an gceamara sin.
ru: Его можно настроить на узле :ref:`WorldEnvironment <class_WorldEnvironment>`, где он применяется ко всем видовым областям, или его можно настроить на узле :ref:`Camera3D <class_Camera3D>` и применить только к видовой области, использующей эту камеру.
ta: இதை ஒரு: ref: `உலக சுற்றுச்சூழல் <class_worlden சுற்றுச்சூழல்>` இது அனைத்து காட்சியகங்களுக்கும் பொருந்தும் இடத்திலேயே கட்டமைக்கப்படலாம், அல்லது அதை ஒரு இல் கட்டமைக்கலாம்: ref: `கேமரா 3 டி <class_camera3d>` மற்றும் அந்த கேமராவைப் பயன்படுத்தி காட்சிப் பெட்டிக்கு மட்டுமே பொருந்தும்.
uk: Його можна налаштувати на вузлі :ref:`WorldEnvironment <class_WorldEnvironment>`, де він застосовується до всіх вікон перегляду, або його можна налаштувати на :ref:`Camera3D <class_Camera3D>` і застосовувати лише до вікна перегляду, що використовує цю камеру.
zh_cn: 它可以在 :ref:`WorldEnvironment <class_WorldEnvironment>` 节点上进行配置，并应用于所有视口；也可以在 :ref:`Camera3D <class_Camera3D>` 上进行配置，并仅应用于使用该相机的视口。
zh_tw: 你可以在 :ref:`世界環境 <class_WorldEnvironment>` 節點上設定合成器，使其套用於所有檢視區，或是在 :ref:`3D 攝影機 <class_Camera3D>` 上設定，僅套用於該攝影機所屬的檢視區。

source: The :ref:`Compositor <class_Compositor>` resource is used to configure the compositor. To get started, create a new compositor on the appropriate node:
ru: Ресурс :ref:`Compositor <class_Compositor>` используется для настройки компоновщика. Для начала создайте новый компоновщик на соответствующем узле:
ta: தி: ரெஃப்: `இசையமைப்பாளர் <class_compositor>` இசையமைப்பாளரை உள்ளமைக்க வளம் பயன்படுத்தப்படுகிறது. தொடங்க, பொருத்தமான முனையில் ஒரு புதிய இசையமைப்பாளரை உருவாக்கவும்:
uk: Ресурс :ref:`Compositor <class_Compositor>` використовується для налаштування композитора. Щоб почати, створіть новий композитор на відповідному вузлі:
zh_tw: :ref:`合成器 <class_Compositor>` 資源用於設定合成器。首先，請在對應的節點上建立新的合成器：

source: The compositor is currently a feature that is only supported by the Mobile and Forward+ renderers.
de: Der Kompositor ist derzeit eine Funktion, die nur von den Renderern Mobile und Forward+ unterstützt wird.
ga: Faoi láthair is gné é an cumadóir nach dtacaíonn ach na léiritheoirí Mobile and Forward+.
ru: В настоящее время функция компоновщика поддерживается только рендерами Mobile и Forward+.
ta: இசையமைப்பாளர் தற்போது மொபைல் மற்றும் முன்னோக்கி+ ரெண்டரர்களால் மட்டுமே ஆதரிக்கப்படும் ஒரு அம்சமாகும்.
uk: Композитор наразі є функцією, яка підтримується лише модулями Mobile та Forward+.
zh_cn: 目前只有移动渲染器和 Forward+ 渲染器支持合成器功能。
zh_tw: 目前合成器僅支援 Mobile（行動裝置）與 Forward+（前向加強）渲染器。

source: Compositor effects
de: Kompositor-Effekte
ga: Éifeachtaí cumadóir
ru: Эффекты композитора
ta: கூட்டு விளைவுகள்
uk: Ефекти композитора
zh_cn: 合成器效果
zh_tw: 合成器特效

source: Compositor effects allow you to insert additional logic into the rendering pipeline at various stages. This is an advanced feature that requires a high level of understanding of the rendering pipeline to use to its best advantage.
de: Mit Kompositor-Effekten können Sie an verschiedenen Stellen zusätzliche Logik in die Rendering-Pipeline einfügen. Dies ist eine fortgeschrittene Funktion, die ein hohes Maß an Verständnis der Rendering-Pipeline erfordert, um sie optimal zu nutzen.
ga: Ligeann éifeachtaí cumadóirí duit loighic bhreise a chur isteach sa phíblíne rindreála ag céimeanna éagsúla Is gné chun cinn í seo a éilíonn leibhéal ard tuisceana ar an bpíblíne rindreála le húsáid chun a bhuntáiste is fearr a úsáid.
ru: Эффекты Compositor позволяют добавлять дополнительную логику в конвейер рендеринга на разных этапах. Это сложная функция, требующая глубокого понимания принципов работы конвейера рендеринга для её эффективного использования.
ta: பல்வேறு கட்டங்களில் வழங்குதல் குழாய்த்திட்டத்தில் கூடுதல் தர்க்கத்தை செருகுமாறு இசையமைப்பாளர் விளைவுகள் உங்களை அனுமதிக்கின்றன. இது ஒரு மேம்பட்ட அம்சமாகும், இது வழங்குதல் பைப்லைனைப் பற்றிய உயர் மட்ட புரிதல் அதன் சிறந்த நன்மைக்காகப் பயன்படுத்த வேண்டும்.
uk: Ефекти композитора дозволяють вставляти додаткову логіку в конвеєр рендерингу на різних етапах. Це розширена функція, яка потребує високого рівня розуміння конвеєра візуалізації, щоб використовувати її якнайкраще.
zh_cn: 合成器效果允许你在渲染管线的各个阶段插入额外逻辑。这是一项高级功能，需要对渲染管线有很高的理解才能充分利用它。
zh_tw: 合成器特效讓你能在渲染管線的不同階段插入自訂邏輯。這是一項進階功能，使用時需要對渲染管線有高度的理解，才能發揮其最大效益。

source: As the core logic of the compositor effect is called from the rendering pipeline it is important to note that this logic will thus run within the thread on which rendering takes place. Care needs to be taken to ensure we don't run into threading issues.
de: Da die Kernlogik des Kompositor-Effekts von der Rendering-Pipeline aufgerufen wird, ist es wichtig zu beachten, dass diese Logik innerhalb des Threads ausgeführt wird, in dem das Rendering stattfindet. Es muss darauf geachtet werden, dass es nicht zu Threading-Problemen kommt.
ga: Toisc go dtugtar croíloighic an éifeacht cumadóra ón bpíblíne rindreála tá sé tábhachtach a thabhairt faoi deara go rithfidh an loighic seo laistigh den snáithe ar a ndéantar rindreáil. Ní mór cúram a thabhairt chun a chinntiú nach mbeidh saincheisteanna snáithe againn.
ru: Поскольку основная логика эффекта компоновщика вызывается из конвейера рендеринга, важно отметить, что эта логика будет выполняться в том же потоке, в котором происходит рендеринг. Необходимо соблюдать осторожность, чтобы избежать проблем с потоками.
ta: வழங்குதல் பைப்லைனில் இருந்து இசையமைப்பாளர் விளைவின் முக்கிய வழக்கு அழைக்கப்படுவதால், இந்த வழக்கு வழங்குதல் நடைபெறும் நூலுக்குள் இயங்கும் என்பதைக் கவனத்தில் கொள்ள வேண்டும். நாங்கள் த்ரெட்டிங் சிக்கல்களுக்குள் ஓடவில்லை என்பதை உறுதிப்படுத்த கவனமாக இருக்க வேண்டும்.
uk: Оскільки основна логіка ефекту композитора викликається з конвеєра візуалізації, важливо зазначити, що ця логіка, таким чином, працюватиме в потоці, у якому відбувається рендеринг. Потрібно бути обережним, щоб ми не зіткнулися з проблемами потоків.
zh_cn: 由于合成器效果的核心逻辑是从渲染管线调用的，因此需要注意的是，该逻辑将在渲染发生的线程内运行。务必小心，以确保我们不会遇到线程问题。
zh_tw: 由於合成器特效的核心邏輯會由渲染管線呼叫，因此會在執行渲染的執行緒中運作。請務必小心，避免產生執行緒相關問題。

source: To illustrate how to use compositor effects we'll create a simple post processing effect that allows you to write your own shader code and apply this full screen through a compute shader. You can find the finished demo project `here <https://github.com/godotengine/godot-demo-projects/tree/master/compute/post_shader>`_.
de: Zur Veranschaulichung der Verwendung von Kompositor-Effekten werden wir einen einfachen Post-Processing-Effekt erstellen, der es Ihnen ermöglicht, Ihren eigenen Shader-Code zu schreiben und diesen über einen Compute-Shader bildschirmfüllend anzuwenden. Das fertige Demoprojekt finden Sie `hier <https://github.com/godotengine/godot-demo-projects/tree/master/compute/post_shader>`_.
ga: Chun a léiriú conas éifeachtaí cumaisc a úsáid cruthóimid iarmhairt iarphróiseála simplí a cheadóidh duit do chód scáthaithe féin a scríobh agus an scáileán iomlán seo a chur i bhfeidhm trí scáthlánóir ríomh. Is féidir leat an tionscadal taispeána críochnaithe `a fháil anseo <https://github.com/godotengine/godot-demo-projects/tree/master/compute/post_shader>`_.
ru: Чтобы продемонстрировать использование эффектов компоновщика, мы создадим простой эффект постобработки, который позволит вам написать собственный код шейдера и применить этот полноэкранный режим через вычислительный шейдер. Готовый демонстрационный проект можно найти `здесь: <https://github.com/godotengine/godot-demo-projects/tree/master/compute/post_shader>`_.
ta: காம்போசிட்டர் விளைவுகளை எவ்வாறு பயன்படுத்துவது என்பதை விளக்குவதற்கு, உங்கள் சொந்த சேடர் குறியீட்டை எழுதவும், இந்த முழுத் திரையை ஒரு கம்ப்யூட் சேடர் மூலம் பயன்படுத்தவும் அனுமதிக்கும் எளிய இடுகை செயலாக்க விளைவை நாங்கள் உருவாக்குவோம். முடிக்கப்பட்ட டெமோ திட்டத்தை நீங்கள் காணலாம் `இங்கே <https://github.com/godotengine/godot-demo-projects/tree/master/compute/post_shader>` _.
uk: Щоб проілюструвати, як використовувати ефекти композитора, ми створимо простий ефект постобробки, який дозволить вам написати власний код шейдера та застосувати його на весь екран через обчислювальний шейдер. Ви можете знайти готовий демонстраційний проект `тут <https://github.com/godotengine/godot-demo-projects/tree/master/compute/post_shader>`_.
zh_cn: 为了说明如何使用合成器效果，我们将创建一个简单的后期处理效果，让你可以编写自己的着色器代码并通过计算着色器应用该全屏。你可以在\ `这里 <https://github.com/godotengine/godot-demo-projects/tree/master/compute/post_shader>`_\ 找到完成的演示项目。
zh_tw: 為了說明如何使用合成器特效，我們將建立一個簡單的後處理特效，讓你可以撰寫自己的著色器程式，並透過運算著色器套用到全螢幕。你可以在這裡找到完成的展示專案：`這裡 <https://github.com/godotengine/godot-demo-projects/tree/master/compute/post_shader>`_。

source: We start by creating a new script called ``post_process_shader.gd``. We'll make this a tool script so we can see the compositor effect work in the editor. We need to extend our node from :ref:`CompositorEffect <class_CompositorEffect>`. We must also give our script a class name.
de: Wir beginnen mit der Erstellung eines neuen Skripts namens ``post_process_shader.gd``. Wir machen dies zu einem Tool-Skript, damit wir die Auswirkung des Kompositor-Effekts im Editor sehen können. Wir müssen unseren Node von :ref:`CompositorEffect <class_CompositorEffect>` erweitern. Wir müssen unserem Skript auch einen Klassennamen geben.
ga: Tosaímid trí script nua a chruthú ar a dtugtar ``post_process_shader.gd``. Déanfaimid script uirlisí seo ionas gur féidir linn éifeacht an chumadóra a fheiceáil ag obair san eagarthóir. Ní mór dúinn ár nód a leathnú ó :ref:`CompositorEffect <class_CompositorEffect>`. Ní mór dúinn freisin ainm ranga a thabhairt dár script.
ru: Начнём с создания нового скрипта под названием ``post_process_shader.gd``. Сделаем его инструментальным скриптом, чтобы можно было увидеть работу эффекта компоновщика в редакторе. Нам нужно расширить наш узел от :ref:`CompositorEffect <class_CompositorEffect>`. Также нужно дать нашему скрипту имя класса.
ta: `` Post_process_shader.gd`` என்ற புதிய ச்கிரிப்டை உருவாக்குவதன் மூலம் தொடங்குகிறோம். இதை நாங்கள் ஒரு கருவி ச்கிரிப்டாக மாற்றுவோம், எனவே கலவை விளைவு எடிட்டரில் வேலை செய்வதைக் காணலாம். இதிலிருந்து நாம் எங்கள் முனையை நீட்டிக்க வேண்டும்: ref: `compositoreffect <class_compositoreffect>`. எங்கள் ச்கிரிப்டுக்கு ஒரு வகுப்பு பெயரையும் கொடுக்க வேண்டும்.
uk: Ми починаємо зі створення нового сценарію під назвою ``post_process_shader.gd``. Ми зробимо це інструментальним сценарієм, щоб ми могли бачити, як ефект композитора працює в редакторі. Нам потрібно розширити наш вузол із :ref:`CompositorEffect <class_CompositorEffect>`. Ми також повинні дати нашому сценарію назву класу.
zh_cn: 首先创建一个名为 ``post_process_shader.gd`` 的新脚本。我们将把它作为一个工具脚本，这样就可以在编辑器中看到合成器效果的工作情况。我们需要从 :ref:`CompositorEffect <class_CompositorEffect>` 扩展我们的节点。还必须为脚本指定一个类名。
zh_tw: 首先，建立一個名為 ``post_process_shader.gd`` 的新腳本。將其設為 tool 腳本，這樣就可以在編輯器中即時看到合成器特效的效果。這個腳本需要繼承自 :ref:`CompositorEffect <class_CompositorEffect>`，並為其指定一個類別名稱。

source: Next we're going to define a constant for our shader template code. This is the boilerplate code that makes our compute shader work.
de: Als nächstes werden wir eine Konstante für unseren Shader-Vorlagencode definieren. Dies ist der Standardcode, mit dem unser Compute-Shader funktioniert.
ga: Ansin táimid chun tairiseach a shainiú dár gcód teimpléad shader. Is é seo an cód boilerplate a fhágann go n-oibríonn ár scáthóir ríomhaireachta.
ru: Далее мы определим константу для кода шаблона нашего шейдера. Это шаблонный код, который обеспечивает работу нашего вычислительного шейдера.
ta: அடுத்து எங்கள் சேடர் வார்ப்புரு குறியீட்டிற்கான மாறிலி வரையறுக்கப் போகிறோம். இது எங்கள் கம்ப்யூட் சேடர் வேலை செய்யும் கொதிகலன் குறியீடு ஆகும்.
uk: Далі ми визначимо константу для нашого коду шаблону шейдера. Це шаблонний код, завдяки якому працює наш обчислювальний шейдер.
zh_cn: 接下来，我们将为着色器模板代码定义一个常量。这是使计算着色器工作的样板代码。
zh_tw: 接著，我們要定義一個常數來存放著色器範本程式碼。這段程式碼是讓我們的運算著色器能夠運作的基礎。

source: For more information on how compute shaders work, please check :ref:`Using compute shaders <doc_compute_shaders>`.
de: Weitere Informationen über die Funktionsweise von Compute-Shadern finden Sie in :ref:`Verwendung von Compute-Shadern <doc_compute_shaders>`.
ga: Chun tuilleadh eolais a fháil ar an gcaoi a n-oibríonn scáthaitheoirí ríomh, seiceáil le do thoil :tag:`Ag baint úsáide as scáthaitheoirí ríomhaire <doc_compute_shaders>`.
ru: Более подробную информацию о работе вычислительных шейдеров см. в разделе: :ref:`Using compute shaders <doc_compute_shaders>`.
ta: சேடர்கள் எவ்வாறு செயல்படுகின்றன என்பது பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து சரிபார்க்கவும்: ref: `கம்ப்யூட் சேடர்களைப் பயன்படுத்துதல் <doc_compute_shaders>`.
uk: Щоб дізнатися більше про те, як працюють обчислювальні шейдери, перегляньте :ref:`Using compute shaders <doc_compute_shaders>`.
zh_cn: 有关计算着色器如何工作的更多信息，请查看《\ :ref:`使用计算着色器 <doc_compute_shaders>`\ 》。
zh_tw: 如需更多有關運算著色器運作方式的資訊，請參考 :ref:`使用運算著色器 <doc_compute_shaders>`。

source: The important bit here is that for every pixel on our screen, our ``main`` function is executed and inside of this we load the current color value of our pixel, execute our user code, and write our modified color back to our color image.
de: Der wichtige Teil hier ist, dass für jedes Pixel auf unserem Bildschirm unsere ``Hauptfunktion`` ausgeführt wird, und innerhalb dieser laden wir den aktuellen Farbwert unseres Pixels, führen unseren Anwendercode aus und schreiben unsere geänderte Farbe zurück in unser Farbbild.
ga: Is é an chuid tábhachtach anseo ná go gcuirtear ár bhfeidhm ``príomh`` i gcás gach picteilín ar ár scáileán agus taobh istigh de seo luachaimid luach datha reatha ár bpicteilín, cuirimid ár gcód úsáideora a fhorghníomhú, agus scríobhfaimid ár ndath modhnaithe ar ais chuig ár n-íomhá datha.
ru: Важным моментом здесь является то, что для каждого пикселя на нашем экране выполняется наша ``main`` функция, внутри которой мы загружаем текущее значение цвета нашего пикселя, выполняем наш пользовательский код и записываем наш измененный цвет обратно в наше цветное изображение.
ta: இங்கே முக்கியமான பிட் என்னவென்றால், எங்கள் திரையில் உள்ள ஒவ்வொரு பிக்சலுக்கும், எங்கள் `` பிரதான`` செயல்பாடு செயல்படுத்தப்படுகிறது, இதன் உள்ளே எங்கள் பிக்சலின் தற்போதைய வண்ண மதிப்பை ஏற்றுகிறோம், எங்கள் பயனர் குறியீட்டை இயக்குகிறோம், எங்கள் மாற்றியமைக்கப்பட்ட வண்ணத்தை எங்கள் வண்ணத்திற்கு மீண்டும் எழுதுகிறோம் படம்.
uk: Важливим тут є те, що для кожного пікселя на нашому екрані виконується наша функція ``main``, і всередині неї ми завантажуємо поточне значення кольору нашого пікселя, виконуємо наш код користувача та записуємо наш змінений колір назад у наш колір зображення.
zh_cn: 这里重要的一点是，对于屏幕上的每个像素，我们的 ``main`` 函数都会被执行，在其中我们加载像素的当前颜色值，执行用户代码，并将修改后的颜色写回到彩色图像中。
zh_tw: 這裡最重要的是，螢幕上的每一個像素都會執行一次 ``main`` 函式，過程中會讀取該像素目前的顏色值、執行自訂程式碼，並將修改後的顏色寫回影像。

source: ``#COMPUTE_CODE`` gets replaced by our user code.
de: ``#COMPUTE_CODE`` wird durch unseren Benutzercode ersetzt.
ga: Cuirtear ár gcód úsáideora in ionad ``#COMPUTE_CODE``.
ru: ``#COMPUTE_CODE`` заменяется нашим пользовательским кодом.
ta: ``#Compute_code`` எங்கள் பயனர் குறியீட்டால் மாற்றப்படுகிறது.
uk: ``#COMPUTE_CODE`` замінюється нашим кодом користувача.
zh_cn: ``#COMPUTE_CODE`` 应被我们的用户代码替换掉。
zh_tw: ``#COMPUTE_CODE`` 會被替換為我們撰寫的自訂程式碼。

source: In order to set our user code, we need an export variable. We'll also define a few script variables we'll be using:
de: Um unseren Benutzercode zu setzen, benötigen wir eine Exportvariable. Wir werden auch einige Skriptvariablen definieren, die wir verwenden werden:
ga: D'fhonn ár gcód úsáideora a shocrú, teastaíonn athróg onnmhairithe uainn. Sainmhíneoimid cúpla athróg script a bheidh á úsáid againn freisin:
ru: Чтобы задать код пользователя, нам понадобится переменная экспорта. Мы также определим несколько переменных скрипта, которые будем использовать:
ta: எங்கள் பயனர் குறியீட்டை அமைக்க, எங்களுக்கு ஏற்றுமதி மாறி தேவை. நாங்கள் பயன்படுத்தும் சில ச்கிரிப்ட் மாறிகளையும் வரையறுப்போம்:
uk: Щоб встановити наш код користувача, нам потрібна змінна експорту. Ми також визначимо кілька змінних сценарію, які будемо використовувати:
zh_cn: 为了用户代码，我们需要一个导出变量。我们还将定义一些将使用的脚本变量：
zh_tw: 為了設定自訂程式碼，我們需要一個 export 變數。同時，也會定義一些腳本變數以供使用：

source: Note the use of a :ref:`Mutex <class_Mutex>` in our code. Most of our implementation gets called from the rendering engine and thus runs within our rendering thread.
de: Beachten Sie die Verwendung eines :ref:`Mutex <class_Mutex>` in unserem Code. Der größte Teil unserer Implementierung wird von der Rendering-Engine aufgerufen und läuft daher innerhalb unseres Rendering-Threads.
ga: Tabhair faoi deara úsáid :ref:`Mutex <class_Mutex>` inár gcód. Faightear an chuid is mó dár gcur chun feidhme ón inneall rindreála agus mar sin ritheann sé laistigh dár snáithe rindreála.
ru: Обратите внимание на использование :ref:`Mutex <class_Mutex>` в нашем коде. Большая часть нашей реализации вызывается из движка рендеринга и, следовательно, выполняется в нашем потоке рендеринга.
ta: ஒரு பயன்பாட்டைக் கவனியுங்கள்: ref: `mutex <class_mutex>` எங்கள் குறியீட்டில். எங்கள் செயல்பாட்டில் பெரும்பாலானவை வழங்குதல் எஞ்சினிலிருந்து அழைக்கப்படுகின்றன, இதனால் எங்கள் வழங்குதல் நூலுக்குள் இயங்கும்.
uk: Зверніть увагу на використання :ref:`Mutex <class_Mutex>` у нашому коді. Більшість наших реалізацій викликається механізмом візуалізації і, таким чином, працює в нашому потоці візуалізації.
zh_cn: 请注意我们代码中 :ref:`Mutex <class_Mutex>` 的使用。我们的大多数实现都是从渲染引擎调用的，因此需在我们的渲染线程中运行。
zh_tw: 請注意，我們在程式中使用了 :ref:`Mutex <class_Mutex>`。大部分的實作都會由渲染引擎呼叫，因此會在渲染執行緒中執行。

source: We need to ensure that we set our new shader code, and mark our shader code as dirty, without our render thread accessing this data at the same time.
de: Wir müssen sicherstellen, dass wir unseren neuen Shader-Code setzen und unseren Shader-Code als "dirty" markieren, ohne dass unser Render-Thread gleichzeitig auf diese Daten zugreift.
ga: Ní mór dúinn a chinntiú go socraímid ár gcód scáthaithe nua, agus go ndéanaimid ár gcód scáthaithe a mharcáil mar salach, gan ár snáithe rindreála rochtain a fháil ar na sonraí seo ag an am céanna.
ru: Нам нужно убедиться, что мы устанавливаем наш новый код шейдера и отмечаем его как грязный, без того, чтобы наш поток рендеринга одновременно получал доступ к этим данным.
ta: இந்த தரவை ஒரே நேரத்தில் அணுகாமல், எங்கள் புதிய சேடர் குறியீட்டை நாங்கள் அமைத்து, எங்கள் சேடர் குறியீட்டை அழுக்காகக் குறிக்கிறோம் என்பதை உறுதிப்படுத்த வேண்டும்.
uk: Нам потрібно переконатися, що ми встановили наш новий шейдерний код і позначили наш шейдерний код як брудний, без того, щоб наш потік візуалізації одночасно отримував доступ до цих даних.
zh_cn: 我们需要确保设置新的着色器代码，并将着色器代码标记为脏，同时渲染线程不会访问这些数据。
zh_tw: 我們必須確保在設定新的著色器程式碼並標記為已變更時，渲染執行緒不會同時存取這些資料。

source: Next we initialize our effect.
de: Als nächstes initialisieren wir unseren Effekt.
ga: Ansin cuirimid ár n-éifeacht a thosú.
ru: Далее мы инициализируем наш эффект.
ta: அடுத்து நாங்கள் எங்கள் விளைவைத் தொடங்குகிறோம்.
uk: Далі ми ініціалізуємо наш ефект.
zh_cn: 接下来初始化我们的效果。
zh_tw: 接著初始化我們的特效。

source: The main thing here is setting our ``effect_callback_type`` which tells the rendering engine at what stage of the render pipeline to call our code.
de: Die Hauptsache ist hier die Einstellung unseres ``effect_callback_type``, welcher der Rendering-Engine mitteilt, in welchem Stadium der Render-Pipeline sie unseren Code aufrufen soll.
ga: Is é an rud is mó anseo ná ár `effect_callback_type`` a shocrú a insíonn don inneall rindreála cén chéim den phíblíne rindreála le glaoch ar ár gcód.
ru: Главное здесь — установить наш ``effect_callback_type``, который сообщает движку рендеринга, на каком этапе конвейера рендеринга вызывать наш код.
ta: இங்குள்ள முக்கிய சேதி என்னவென்றால், எங்கள் `` எஃபெக்ட்_கால்பேக்_ டைப்`` ஐ அமைப்பது, இது வழங்குதல் எஞ்சினுக்கு வழங்குதல் பைப்லைனின் எந்த கட்டத்தில் எங்கள் குறியீட்டை அழைக்க வேண்டும் என்று கூறுகிறது.
uk: Головне тут — це встановити наш ``effect_callback_type``, який повідомляє механізму візуалізації, на якому етапі конвеєра візуалізації викликати наш код.
zh_cn: 这里最重要的是设置我们的 ``effect_callback_type``\ ，它告诉渲染引擎在渲染管线的哪个阶段调用我们的代码。
zh_tw: 這裡的重點是設定 ``effect_callback_type``，告訴渲染引擎要在渲染管線的哪個階段呼叫我們的程式碼。

source: Currently we only have access to the stages of the 3D rendering pipeline!
de: Derzeit haben wir nur Zugang zu den Stufen der 3D-Rendering-Pipeline!
ga: Faoi láthair níl rochtain againn ach ar chéimeanna na píblíne rindreála 3D!
ru: В настоящее время у нас есть доступ только к этапам конвейера 3D-рендеринга!
ta: தற்போது 3D வழங்குதல் பைப்லைனின் நிலைகளுக்கு மட்டுமே அணுகல் உள்ளது!
uk: Наразі ми маємо доступ лише до етапів конвеєра 3D-візуалізації!
zh_cn: 目前我们只能访问 3D 渲染管线的各个阶段！
zh_tw: 目前僅能存取 3D 渲染管線的各個階段！

source: We also get a reference to our rendering device, which will come in very handy.
de: Wir erhalten auch einen Verweis auf unser Rendering-Gerät, was sich als sehr nützlich erweisen wird.
ga: Faighimid tagairt dár bhfeiste rindreála freisin, a thiocfaidh go han-áisiúil.
ru: Мы также получим ссылку на наше устройство рендеринга, что будет очень полезно.
ta: எங்கள் வழங்குதல் சாதனத்தைப் பற்றிய குறிப்பையும் பெறுகிறோம், இது மிகவும் எளிது.
uk: Ми також отримуємо посилання на наш пристрій візуалізації, що стане в нагоді.
zh_cn: 我们还获得了对渲染设备的引用，这将非常方便。
zh_tw: 我們同時也會取得渲染裝置的參考，這在後續會很實用。
