Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: ga, it, pt_br, ru, ta, uk, zh_cn, zh_tw

source: Set the base window size to the viewport size you intend to use. Most pixel art games use viewport sizes between 256×224 and 640×480. 640×360 is a good baseline, as it scales to 1280×720, 1920×1080, 2560×1440, and 3840×2160 without any black bars when using integer scaling. Higher viewport sizes will require using higher resolution artwork, unless you intend to show more of the game world at a given time.
ga: Socraigh méid na bunfhuinneoige go dtí méid an phoirt amhairc atá beartaithe agat a úsáid. Úsáideann an chuid is mó de na cluichí ealaíne picteilín méideanna viewport idir 256×224 agus 640×480. Is bonnlíne mhaith é 640×360, mar scálaí sé go 1280×720, 1920×1080, 2560×1440, agus 3840×2160 gan aon bharraí dubha agus scálú slánuimhir á úsáid. Beidh gá le saothar ealaíne réitigh níos airde a úsáid, ach amháin má tá sé ar intinn agat níos mó den domhan cluiche a thaispeáint ag am ar leith.
it: Imposta le dimensioni base della finestra in base alle dimensioni della viewport che intendi usare. La maggior parte dei giochi in pixel art usa dimensioni della viewport comprese tra 256×224 e 640×480. 640×360 è una buona base, poiché scala a 1280×720, 1920×1080, 2560×1440 e 3840×2160 senza barre nere se si utilizza il ridimensionamento intero. Dimensioni più elevate della viewport richiederanno l'utilizzo di grafica a risoluzione più elevata, a meno che non si intenda mostrare una porzione maggiore del mondo di gioco in un certo momento.
ru: Установите базовый размер окна равным размеру области просмотра, которую вы планируете использовать. В большинстве игр с пиксельной графикой используются области просмотра размером от 256×224 до 640×480. 640×360 — хороший базовый размер, так как он масштабируется до разрешений 1280×720, 1920×1080, 2560×1440 и 3840×2160 без чёрных полос при целочисленном масштабировании. Более высокие размеры области просмотра потребуют использования изображений с более высоким разрешением, если только вы не планируете отображать больше игрового мира одновременно.
ta: அடிப்படை சாளர அளவை நீங்கள் பயன்படுத்த விரும்பும் காட்சியகம் அளவிற்கு அமைக்கவும். பெரும்பாலான படப்புள்ளி கலை விளையாட்டுகள் 256 × 224 முதல் 640 × 480 வரை காட்சியக அளவுகளைப் பயன்படுத்துகின்றன. 640 × 360 ஒரு நல்ல அடிப்படைக் ஆகும், ஏனெனில் இது 1280 × 720, 1920 × 1080, 2560 × 1440, மற்றும் 3840 × 2160 என முழு அளவிலான அளவிடுதலைப் பயன்படுத்தும் போது எந்த கருப்பு பார்கள் இல்லாமல் அளவிடுகிறது. ஒரு குறிப்பிட்ட நேரத்தில் விளையாட்டு உலகத்தை நீங்கள் காட்ட விரும்பாவிட்டால், அதிக பார்வை அளவுகளுக்கு அதிக தெளிவுத்திறன் கொண்ட கலைப்படைப்புகளைப் பயன்படுத்த வேண்டும்.
uk: Встановіть розмір базового вікна відповідно до розміру вікна перегляду, який ви збираєтеся використовувати. Більшість піксельних ігор використовують вікно перегляду розміром від 256×224 до 640×480. 640 × 360 є хорошою базовою лінією, оскільки вона масштабується до 1280 × 720, 1920 × 1080, 2560 × 1440 і 3840 × 2160 без будь-яких чорних смуг при використанні цілочисельного масштабування. Більший розмір вікна перегляду вимагатиме використання ілюстрації з вищою роздільною здатністю, якщо ви не маєте намір показати більше ігрового світу в певний момент часу.
zh_cn: 将基础窗口大小设置为你想要使用的视口尺寸。大多数像素风游戏使用的视口尺寸在 256×224 和 640×480 之间。640×360 是不错的基准，因为使用整数缩放时无论是缩放到 1280×720、1920×1080、2560×1440 还是 3840×2160 都不会出现黑条。视口尺寸越大，所需资产的分辨率也就越高，除非你想要能够显示更大的游戏世界区域。
zh_tw: 把基礎視窗大小設為你預期要用的視口尺寸。大多數像素美術遊戲會使用 256×224 到 640×480 之間的視口尺寸。640×360 是不錯的基準，因為用整數縮放時能剛好對應 1280×720、1920×1080、2560×1440、3840×2160，而不會出現黑邊。視口尺寸越大，所需美術解析度越高，除非你想同時顯示更多遊戲世界內容。

source: Set the stretch mode to ``viewport``.
ga: Socraigh an mód sínte go ''viewport''.
it: Imposta la modalità di stiramento su ``viewport``.
ru: Установите режим растяжения на ``viewport``.
ta: நீட்டிக்க பயன்முறையை `` ViewPort`` க்கு அமைக்கவும்.
uk: Встановіть режим розтягування на ``viewport``.
zh_cn: 将拉伸模式设置为 ``viewport``\ （视口）。
zh_tw: 將拉伸模式設定為 ``viewport`` （視口）。

source: Set the stretch aspect to ``keep`` to enforce a single aspect ratio (with black bars). As an alternative, you can set the stretch aspect to ``expand`` to support multiple aspect ratios.
ga: Socraigh an ghné stráice go ''keep'' chun cóimheas gné amháin a fhorfheidhmiú (le barraí dubha). Mar mhalairt air sin, is féidir leat an ghné stráice a shocrú go ''leathnú'' chun tacú le cóimheasa ilghné.
it: Imposta l'aspetto di stiramento su ``keep`` per applicare un unico rapporto d'aspetto (con barre nere). In alternativa, è possibile impostare l'aspetto di stiramento su ``expand`` per supportare più rapporti d'aspetto.
ru: Установите для параметра растяжения значение ``keep``, чтобы обеспечить единое соотношение сторон (с чёрными полосами). В качестве альтернативы, для параметра растяжения можно установить значение ``expand``, чтобы поддерживать несколько соотношений сторон.
ta: ஒற்றை விகித விகிதத்தை (கருப்பு கம்பிகளுடன்) செயல்படுத்த `` வைத்திருங்கள் `` க்கு நீட்டிக்க அம்சத்தை அமைக்கவும். மாற்றாக, பல அம்ச விகிதங்களை ஆதரிக்க நீங்கள் நீட்டிக்க அம்சத்தை `` விரிவாக்குதல்` க்கு அமைக்கலாம்.
uk: Встановіть розтягнутий аспект на ``keep``, щоб забезпечити єдине співвідношення сторін (з чорними смугами). Як альтернативу ви можете встановити розтягнутий аспект на ``розгорнути``, щоб підтримувати кілька пропорцій.
zh_cn: 将拉伸比例设置为 ``keep``\ （保持）可以（通过添加黑条的方式）强制使用固定的长宽比。如果你想支持不同长宽比的话，也可以把拉伸模式设置为 ``expand``\ （扩展）。
zh_tw: 將拉伸比例設定為 ``keep`` （保持）以強制採用單一長寬比（會有黑邊）；若想同時支援多種長寬比，也可設為 ``expand`` （擴充）。

source: If using the ``expand`` stretch aspect, Configure Control nodes' anchors to snap to the correct corners using the **Layout** menu.
ga: Má tá an ghné stráice ''expand'' á húsáid agat, cumraigh ancairí nóid Rialaithe chun léim chuig na coirnéil chearta ag baint úsáide as an roghchlár **Layout**.
it: Se si utilizza l'aspetto di stiramento ``expand``, configurare le ancore dei nodi di controllo affinché si aggancino agli angoli corretti attraverso il menu **Layout**.
ru: При использовании аспекта растяжения ``expand`` настройте якоря узлов управления для привязки к правильным углам с помощью меню **Layout**.
ta: `` `விரிவாக்கு`` நீட்டிக்க அம்சத்தைப் பயன்படுத்தினால், ** தளவமைப்பு ** மெனுவைப் பயன்படுத்தி சரியான மூலைகளுக்கு ஒடுக்க கட்டுப்பாட்டு முனைகள் 'நங்கூரங்களை உள்ளமைக்கவும்.
uk: Якщо використовується розтягнутий аспект ``розгортання``, налаштуйте прив’язки контрольних вузлів до правильних кутів за допомогою меню **Макет**.
zh_cn: 如果选用 ``expand`` 拉伸比例，使用\ **布局**\ 菜单将 Control 节点的锚点吸附到正确的角落。
zh_tw: 若選用 ``expand`` 拉伸比例，請用 **佈局** 選單將 Control 節點的錨點對齊到正確的角落。

source: Set the stretch scale mode to ``integer``. This prevents uneven pixel scaling from occurring, which makes pixel art not display as intended.
ga: Socraigh an mód scála stráice go ''slánuimhir''. Cuireann sé seo cosc ar scálú picteilín míchothrom tarlú, rud a fhágann nach dtaispeántar ealaín picteilín mar a bhí beartaithe.
it: Imposta la modalità di scala di stiramento su ``integer``. Questo evita ridimensionamenti non uniforme dei pixel, il che non farebbe apparire la pixel art come previsto.
ru: Установите режим масштабирования растяжения на ``integer``. Это предотвращает неравномерное масштабирование пикселей, из-за которого пиксельная графика отображается некорректно.
ta: நீட்டிக்க அளவிலான பயன்முறையை `` முழு எண்`` ஆக அமைக்கவும். இது சீரற்ற படப்புள்ளி அளவிடுதல் ஏற்படுவதைத் தடுக்கிறது, இது படப்புள்ளி கலையை நோக்கமாகக் காண்பிக்காது.
uk: Встановіть режим розтягування масштабу на ``ціле число``. Це запобігає нерівномірному масштабуванню пікселів, через що піксельне зображення не відображається належним чином.
zh_cn: 将拉伸缩放模式设置为 ``integer``\ 。这样就能够防止出现非整数倍的像素缩放，让像素画保持原样显示。
zh_tw: 將縮放模式（Stretch Scale Mode）設為 ``integer`` （整數縮放）。這可避免像素美術出現縮放不均勻導致的顯示問題。

source: The ``viewport`` stretch mode provides low-resolution rendering that is then stretched to the final window size. If you are OK with sprites being able to move or rotate in "sub-pixel" positions or wish to have a high resolution 3D viewport, you should use the ``canvas_items`` stretch mode instead of the ``viewport`` stretch mode.
ga: Soláthraíonn an modh stráice ''viewport'' rindreáil ísealtaifigh atá sínte ansin go dtí méid deiridh na fuinneoige. Má tá tú ceart go leor le sprideanna a bheith in ann bogadh nó rothlú i bpoist "fo-phicteilín" nó más mian leat amharcphort 3D ardtaifigh a bheith agat, ba chóir duit an modh stráice ''canvas_items'' a úsáid in ionad an mhodha stráice ''viewport''.
it: La modalità di stiramento ``viewport`` fornisce un rendering a bassa risoluzione che viene poi stirato fino alle dimensioni finali della finestra. Se si desidera che gli sprite si muovano o ruotino in posizioni "sub-pixel" o si desidera una viewport 3D ad alta risoluzione, è consigliabile utilizzare la modalità di stiramento ``canvas_items`` anziché la modalità di stiramento ``viewport``.
ru: Режим растяжения ``viewport`` обеспечивает рендеринг в низком разрешении, который затем растягивается до конечного размера окна. Если вас устраивает возможность перемещения или вращения спрайтов в "sub-pixel" позициях или вы хотите иметь 3D-область просмотра с высоким разрешением, используйте режим растяжения ``canvas_items`` вместо режима растяжения ``viewport``.
ta: `` ViewPort`` நீட்டிப்பு பயன்முறை குறைந்த தெளிவுத்திறன் வழங்குதல் வழங்குகிறது, பின்னர் அது இறுதி சாளர அளவிற்கு நீட்டப்படுகிறது. "சப்-பிக்சல்" நிலைகளில் ச்ப்ரைட்டுகள் நகர்த்த அல்லது சுழற்ற முடிந்தால் அல்லது உயர் தெளிவுத்திறன் கொண்ட 3D வியாலைக் கொண்டிருக்க விரும்பினால், நீங்கள் `` Viewport`` நீட்டிக்கப்படுவதற்கு பதிலாக `` கேன்வாச்_இடெம்ச்` நீட்டிக்க பயன்முறையைப் பயன்படுத்த வேண்டும் .
uk: Режим розтягування ``viewport`` забезпечує візуалізацію з низькою роздільною здатністю, яка потім розтягується до остаточного розміру вікна. Якщо ви погоджуєтесь із можливістю переміщення чи обертання спрайтів у «субпіксельних» позиціях або бажаєте мати 3D вікно перегляду з високою роздільною здатністю, вам слід використовувати режим розтягування ``canvas_items`` замість режиму розтягування ``viewport``.
zh_cn: ``viewport`` 拉伸模式会先以较低分辨率渲染，然后拉伸到最终窗口的大小。如果你能够接受精灵可以移动或者旋转到“次像素”位置，或者希望有高分辨率的 3D 视图，可以把 ``viewport`` 拉伸模式换成 ``canvas_items`` 模式。
zh_tw: ``viewport`` 拉伸模式會先以低解析度算繪，最後再拉伸到目標視窗尺寸。如果你可以接受精靈移動或旋轉到「次像素」位置，或想要高解析度的 3D 視口，也可以改用 ``canvas_items`` 拉伸模式。

source: Mobile game in landscape mode
ga: Cluiche soghluaiste i mód tírdhreacha
it: Gioco mobile in modalità orizzontale
ru: Мобильная игра в ландшафтном режиме
ta: இயற்கை பயன்முறையில் மொபைல் விளையாட்டு
uk: Мобільна гра в ландшафтному режимі
zh_cn: 横屏的手机游戏
zh_tw: 橫向手機遊戲

source: Godot is configured to use landscape mode by default. This means you don't need to change the display orientation project setting.
ga: Tá Godot cumraithe chun mód tírdhreacha a úsáid de réir réamhshocraithe. Ciallaíonn sé seo nach gá duit socrú an tionscadail treoshuímh taispeána a athrú.
it: Godot è configurato per utilizzare la modalità orizzontale come predefinita. Ciò significa che non è necessario modificare l'impostazione di orientamento dello schermo del progetto.
ru: Godot по умолчанию настроен на использование альбомной (landscape) ориентации. Это означает, что вам не нужно менять настройки ориентации экрана в проекте.
ta: இயல்பாகவே இயற்கை பயன்முறையைப் பயன்படுத்த கோடோட் கட்டமைக்கப்பட்டுள்ளது. இதன் பொருள் நீங்கள் காட்சி நோக்குநிலை திட்ட அமைப்பை மாற்ற தேவையில்லை.
uk: Godot налаштовано на використання альбомного режиму за замовчуванням. Це означає, що вам не потрібно змінювати налаштування проекту орієнтації дисплея.
zh_cn: Godot 默认使用横屏模式，所以你无需在项目设置中调整显示方向。
zh_tw: Godot 預設為橫向顯示，因此通常不需調整顯示方向設定。

source: Set the base window width to ``1280`` and window height to ``720``.
ga: Socraigh leithead na bunfhuinneoige go ''1280'' agus airde na fuinneoige go ''720''.
it: Imposta la larghezza base della finestra su ``1280`` e la sua altezza su ``720``.
ru: Установите базовую ширину окна на ``1280``, а высоту окна на ``720``.
ta: அடிப்படை சாளர அகலத்தை `` 1280`` ஆகவும், சாளர உயரமாகவும் `` 720`` ஆக அமைக்கவும்.
uk: Встановіть базову ширину вікна на ``1280`` і висоту вікна на ``720``.
zh_cn: 将基础窗口宽度设置为 ``1280``\ ，窗口高度设置为 ``720``\ 。
zh_tw: 建議基礎視窗寬度設為 ``1280``，高度設為 ``720``。

source: Alternatively, if you're targeting high-end devices primarily, set the base window width to ``1920`` and window height to ``1080``. This allows you to provide higher resolution 2D assets, resulting in crisper visuals at the cost of higher memory usage and file sizes. Many devices have even higher resolution displays (1440p), but the difference with 1080p is barely visible given the small size of smartphone displays. Note that this will make non-mipmapped textures grainy on low resolution devices, so make sure to follow the instructions described in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
ga: De rogha air sin, má tá tú ag díriú ar ghléasanna ardleibhéil go príomha, socraigh leithead na bunfhuinneoige go ''1920'' agus airde na fuinneoige go ''1080''. Ligeann sé seo duit sócmhainní 2D réitigh níos airde a sholáthar, rud a fhágann go bhfuil amhairc crisper ar chostas úsáide cuimhne níos airde agus méideanna comhaid. Tá taispeántais réitigh níos airde fós ag go leor feistí (1440p), ach is ar éigean go bhfuil an difríocht le 1080p le feiceáil mar gheall ar mhéid beag na dtaispeántas fón cliste. Tabhair faoi deara go ndéanfaidh sé seo uigeachtaí neamh-mipmapped gráin ar ghléasanna ísealtaifigh, mar sin déan cinnte go leanann tú na treoracha a thuairiscítear in :ref:'doc_multiple_resolutions_reducing_aliasing_on_downsampling'.
ru: В качестве альтернативы, если вы ориентируетесь в первую очередь на устройства высокого класса, установите базовую ширину окна ``1920`` и высоту окна ``1080``. Это позволит вам предоставить 2D-активы с более высоким разрешением, что приведет к более четкому изображению за счет большего использования памяти и размера файлов. Многие устройства имеют дисплеи с еще более высоким разрешением (1440p), но разница с 1080p едва заметна, учитывая небольшой размер дисплеев смартфонов. Обратите внимание, что при этом немипмаппированные текстуры будут зернистыми на устройствах с низким разрешением, поэтому обязательно следуйте инструкциям, описанным в :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
ta: மாற்றாக, நீங்கள் முதன்மையாக உயர்நிலை சாதனங்களை குறிவைக்கிறீர்கள் என்றால், அடிப்படை சாளர அகலத்தை `` 1920`` ஆகவும், சாளர உயரமாகவும் `1080`` ஆகவும் அமைக்கவும். இது அதிக தெளிவுத்திறன் கொண்ட 2 டி சொத்துக்களை வழங்க உங்களை அனுமதிக்கிறது, இதன் விளைவாக அதிக நினைவக பயன்பாடு மற்றும் கோப்பு அளவுகளின் செலவில் மிருதுவான காட்சிகள் ஏற்படுகின்றன. பல சாதனங்களில் இன்னும் அதிக தெளிவுத்திறன் காட்சிகள் (1440p) உள்ளன, ஆனால் ச்மார்ட்போன் காட்சிகளின் சிறிய அளவிலான கொடுக்கப்பட்ட 1080p உடனான வேறுபாடு அரிதாகவே தெரியும். இது குறைந்த தெளிவுத்திறன் கொண்ட சாதனங்களில் மிப்மாப் செய்யப்படாத அமைப்புகளை தானியமாக்கும் என்பதை நினைவில் கொள்க, எனவே விவரிக்கப்பட்டுள்ள வழிமுறைகளைப் பின்பற்றுவதை உறுதிசெய்க: குறிப்பு: `Doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
uk: Крім того, якщо ви націлюєтеся переважно на пристрої високого класу, встановіть базову ширину вікна на ``1920`` і висоту вікна на ``1080``. Це дає змогу надавати 2D-ресурси з вищою роздільною здатністю, що забезпечує чіткіші візуальні ефекти за рахунок більшого використання пам’яті та розмірів файлів. Багато пристроїв мають дисплеї навіть з вищою роздільною здатністю (1440p), але різниця з 1080p майже не помітна, враховуючи невеликий розмір дисплеїв смартфонів. Зауважте, що це призведе до того, що на пристроях із низькою роздільною здатністю текстури без MIP-відображення стануть зернистими, тому дотримуйтесь інструкцій, описаних у :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
zh_cn: 或者如果你主要针对的是高端设备，那么就把基础窗口宽度设置为 ``1920``\ 、窗口高度设置为 ``1080``\ 。这样你就可以提供更高分辨率的 2D 资产，用更高的内存占用和文件大小换取更清晰的画面。很多设备拥有更高分辨率的显示屏（1440p），但因为智能手机的屏幕比较小，所以很难看出和 1080p 的区别。注意，这样做会让未做 mipmap 的纹理在低分辨率设备上具有颗粒感，请参考 :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling` 进行操作。
zh_tw: 若主要針對高階裝置，也可將基礎視窗寬度設為 ``1920``，高度設為 ``1080``。這樣可提供更高解析度 2D 素材，畫面更清晰，但會增加記憶體用量與檔案大小。許多裝置甚至有更高解析度（如 1440p），但由於手機螢幕較小，1080p 與 1440p 差異其實很難分辨。請注意，未開啟 mipmap 的貼圖在低解析度裝置上會變得有顆粒感，建議參考 :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`。

source: To better support tablets and foldable phones (which frequently feature displays with aspect ratios close to 4:3), consider using a base resolution that has a 4:3 aspect ratio while following the rest of the instructions here. For instance, you can set the base window width to ``1280`` and the base window height to ``960``.
ga: Chun tacú níos fearr táibléad agus fóin foldable (a gné go minic taispeántais le cóimheasa gné gar do 4:3), smaoineamh ag baint úsáide as réiteach bonn go bhfuil cóimheas gné 4:3 agus tar éis an chuid eile de na treoracha anseo. Mar shampla, is féidir leat leithead na bunfhuinneoige a shocrú go ''1280'' agus airde na bunfhuinneoige go ''960''.
it: Per supportare al meglio tablet e telefoni pieghevoli (che spesso presentano display con proporzioni vicine al 4:3), si consiglia di utilizzare una risoluzione base con proporzioni 4:3, seguendo le istruzioni restanti riportate qui. Ad esempio, è possibile impostare la larghezza base della finestra su ``1280`` e l'altezza base della finestra su ``960``.
ru: Для лучшей поддержки планшетов и складных телефонов (которые часто оснащены дисплеями с соотношением сторон, близким к 4:3), рассмотрите возможность использования базового разрешения с соотношением сторон 4:3, следуя остальным инструкциям. Например, можно установить базовую ширину окна ``1280``, а базовую высоту — ``960``.
ta: டேப்லெட்டுகள் மற்றும் மடிக்கக்கூடிய தொலைபேசிகளை சிறப்பாக ஆதரிக்க (இது 4: 3 க்கு அருகில் உள்ள விகிதங்களுடன் அடிக்கடி காட்சிகளைக் கொண்டுள்ளது), 4: 3 விகித விகிதத்தைக் கொண்ட அடிப்படை தீர்மானத்தைப் பயன்படுத்துவதைக் கவனியுங்கள், இங்கே மீதமுள்ள வழிமுறைகளைப் பின்பற்றும். உதாரணமாக, நீங்கள் அடிப்படை சாளர அகலத்தை `` 1280`` ஆகவும், அடிப்படை சாளர உயரத்தை `` 960`` ஆகவும் அமைக்கலாம்.
uk: Щоб краще підтримувати планшети та телефони, що складаються (які часто мають дисплеї зі співвідношенням сторін, близьким до 4:3), розгляньте можливість використання базової роздільної здатності зі співвідношенням сторін 4:3, дотримуючись решти інструкцій, наведених тут. Наприклад, ви можете встановити ширину базового вікна на ``1280``, а висоту базового вікна на ``960``.
zh_cn: 为了更好地支持平板和折叠屏手机（这些设备的显示器纵横比通常接近 4:3），请在按照其他步骤操作时考虑使用纵横比为 4:3 的基础分辨率。例如可以将基础窗口宽度设置为 ``1280``\ 、基础窗口高度设置为 ``960``\ 。
zh_tw: 若要更好支援平板電腦與摺疊機（這類裝置常見 4:3 長寬比），可考慮使用 4:3 為基礎解析度，並參照本章剩餘建議。例如，可將基礎視窗寬度設為 ``1280``，高度設為 ``960``。

source: Mobile game in portrait mode
ga: Cluiche soghluaiste i mód portráid
ru: Мобильная игра в портретном (portrait) режиме
ta: உருவப்படம் பயன்முறையில் மொபைல் விளையாட்டு
uk: Мобільна гра в портретному режимі
zh_cn: 竖屏的手机游戏
zh_tw: 直向手機遊戲

source: Set the base window width to ``720`` and window height to ``1280``.
ga: Socraigh leithead na bunfhuinneoige go ''720'' agus airde na fuinneoige go ''1280''.
ru: Установите базовую ширину окна на ``720``, а высоту окна на ``1280``.
ta: அடிப்படை சாளர அகலத்தை `` 720`` ஆகவும், சாளர உயரமாகவும் `` 1280`` ஆகவும் அமைக்கவும்.
uk: Встановіть базову ширину вікна на ``720`` і висоту вікна на ``1280``.
zh_cn: 将基础窗口宽度设置为 ``720``\ 、窗口高度设置为 ``1280``\ 。
zh_tw: 建議基礎視窗寬度設為 ``720``，高度設為 ``1280``。

source: Alternatively, if you're targeting high-end devices primarily, set the base window width to ``1080`` and window height to ``1920``. This allows you to provide higher resolution 2D assets, resulting in crisper visuals at the cost of higher memory usage and file sizes. Many devices have even higher resolution displays (1440p), but the difference with 1080p is barely visible given the small size of smartphone displays. Note that this will make non-mipmapped textures grainy on low resolution devices, so make sure to follow the instructions described in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
ga: De rogha air sin, má tá tú ag díriú ar ghléasanna ardleibhéil go príomha, socraigh leithead na bunfhuinneoige go ''1080'' agus airde na fuinneoige go ''1920''. Ligeann sé seo duit sócmhainní 2D réitigh níos airde a sholáthar, rud a fhágann go bhfuil amhairc crisper ar chostas úsáide cuimhne níos airde agus méideanna comhaid. Tá taispeántais réitigh níos airde fós ag go leor feistí (1440p), ach is ar éigean go bhfuil an difríocht le 1080p le feiceáil mar gheall ar mhéid beag na dtaispeántas fón cliste. Tabhair faoi deara go ndéanfaidh sé seo uigeachtaí neamh-mipmapped gráin ar ghléasanna ísealtaifigh, mar sin déan cinnte go leanann tú na treoracha a thuairiscítear in :ref:'doc_multiple_resolutions_reducing_aliasing_on_downsampling'.
ru: В качестве альтернативы, если вы ориентируетесь на высококачественные устройства в первую очередь, установите ширину базового окна до ``1080`` и высоту окна до ``1920``. Это позволяет обеспечить более высокое разрешение 2D активы, в результате чего хрустальные визуализации по стоимости более высокого использования памяти и размера файлов. Многие устройства имеют еще более высокие дисплеи разрешения (1440p), но разница с 1080p едва видима, учитывая небольшой размер дисплеев смартфонов. Обратите внимание, что это сделает не-mipmapped текстуры зерновые на устройствах низкого разрешения, поэтому убедитесь, что следуйте инструкциям, описанным в :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
ta: மாற்றாக, நீங்கள் முதன்மையாக உயர்நிலை சாதனங்களை குறிவைக்கிறீர்கள் என்றால், அடிப்படை சாளர அகலத்தை `` 1080`` ஆகவும், சாளர உயரமாகவும் `` 1920`` ஆகவும் அமைக்கவும். இது அதிக தெளிவுத்திறன் கொண்ட 2 டி சொத்துக்களை வழங்க உங்களை அனுமதிக்கிறது, இதன் விளைவாக அதிக நினைவக பயன்பாடு மற்றும் கோப்பு அளவுகளின் செலவில் மிருதுவான காட்சிகள் ஏற்படுகின்றன. பல சாதனங்களில் இன்னும் அதிக தெளிவுத்திறன் காட்சிகள் (1440p) உள்ளன, ஆனால் ச்மார்ட்போன் காட்சிகளின் சிறிய அளவிலான கொடுக்கப்பட்ட 1080p உடனான வேறுபாடு அரிதாகவே தெரியும். இது குறைந்த தெளிவுத்திறன் கொண்ட சாதனங்களில் mipmaped அல்லாத அமைப்புகளை தானியமாக்கும் என்பதை நினைவில் கொள்க, எனவே விவரிக்கப்பட்டுள்ள வழிமுறைகளைப் பின்பற்றுவதை உறுதிசெய்க: குறிப்பு: `doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
uk: Крім того, якщо ви орієнтуєтесь насамперед на пристрої високого класу, встановіть базову ширину вікна на ``1080`` і висоту вікна на ``1920``. Це дає змогу надавати 2D-ресурси з вищою роздільною здатністю, що забезпечує чіткіші візуальні ефекти за рахунок більшого використання пам’яті та розмірів файлів. Багато пристроїв мають дисплеї навіть з вищою роздільною здатністю (1440p), але різниця з 1080p майже не помітна, враховуючи невеликий розмір дисплеїв смартфонів. Зауважте, що це призведе до того, що на пристроях із низькою роздільною здатністю текстури без MIP-відображення стануть зернистими, тому дотримуйтесь інструкцій, описаних у :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
zh_cn: 或者如果你主要针对的是高端设备，那么就把基础窗口宽度设置为 ``1080``\ 、窗口高度设置为 ``1920``\ 。这样你就可以提供更高分辨率的 2D 资产，用更高的内存占用和文件大小换取更清晰的画面。很多设备拥有更高分辨率的显示屏（1440p），但因为智能手机的屏幕比较小，所以很难看出和 1080p 的区别。注意，这样做会让未做 mipmap 的纹理在低分辨率设备上具有颗粒感，请参考 :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling` 进行操作。
zh_tw: 若主要針對高階裝置，可將基礎視窗寬度設為 ``1080``，高度設為 ``1920``。這樣可提供更高解析度 2D 素材，畫面更清晰，但會增加記憶體用量與檔案大小。許多裝置甚至有更高解析度（如 1440p），但由於手機螢幕較小，1080p 與 1440p 差異其實很難分辨。請注意，未開啟 mipmap 的貼圖在低解析度裝置上會變得有顆粒感，建議參考 :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`。
