Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: ga, it, pt_br, ru, ta, uk, zh_cn, zh_tw

source: To configure the stretch base size at runtime from a script, use the ``get_tree().root.content_scale_size`` property (see :ref:`Window.content_scale_size <class_Window_property_content_scale_size>`). Changing this value can indirectly change the size of 2D elements. However, to provide a user-accessible scaling option, using :ref:`doc_multiple_resolutions_stretch_scale` is recommended as it's easier to adjust.
ga: Chun an bunmhéid stráice a chumrú ag am rite ó script, úsáid an t-airí ``get_tree().root.content_scale_size`` (féach : ref:`Window.content_scale_size <class_Window_property_content_scale_size>`). Is féidir méid na n-eilimintí 2T a athrú go hindíreach má dhéantar an luach seo a athrú. Chun rogha scálaithe atá inrochtana don úsáideoir a sholáthar, áfach, moltar úsáid a bhaint as :ref:`doc_multiple_resolutions_stretch_scale` mar is fusa é a choigeartú.
it: Per configurare le dimensioni di base per lo stiramento in fase di esecuzione da uno script, usare la proprietà ``get_tree().root.content_scale_size`` (vedere :ref:`Window.content_scale_size <class_Window_property_content_scale_size>`). Cambiare questo valore può alterare indirettamente le dimensioni degli elementi 2D. Tuttavia, per fornire un'opzione di ridimensionamento accessibile all'utente, si consiglia di utilizzare :ref:`doc_multiple_resolutions_stretch_scale`, poiché è più facile da regolare.
ru: Чтобы настроить базовый размер растягиваемого изображения во время выполнения скрипта, используйте свойство ``get_tree().root.content_scale_size`` (см. :ref:`Window.content_scale_size <class_Window_property_content_scale_size>`). Изменение этого значения может косвенно влиять на размер 2D-элементов. Однако для предоставления пользователю возможности масштабирования рекомендуется использовать :ref:`doc_multiple_resolutions_stretch_scale`, поскольку его проще настраивать.
ta: ச்கிரிப்டிலிருந்து இயக்க நேரத்தில் நீட்டிக்க அடிப்படை அளவை உள்ளமைக்க, `` get_tree (). Root.content_scale_size`` சொத்து (பார்க்க: `சாளரம். இந்த மதிப்பை மாற்றுவது 2 டி கூறுகளின் அளவை மறைமுகமாக மாற்றும். இருப்பினும், பயனர் அணுகக்கூடிய அளவிடுதல் விருப்பத்தை வழங்க, பயன்படுத்துதல்: ref: `doc_multiple_resolutions_stretch_scale` அதை சரிசெய்ய எளிதானது என்பதால் பரிந்துரைக்கப்படுகிறது.
uk: Щоб налаштувати розтягнутий базовий розмір під час виконання зі сценарію, скористайтеся властивістю ``get_tree().root.content_scale_size`` (див. :ref:`Window.content_scale_size <class_Window_property_content_scale_size>`). Зміна цього значення може опосередковано змінити розмір 2D-елементів. Однак, щоб забезпечити доступний користувачеві варіант масштабування, рекомендується використовувати :ref:`doc_multiple_resolutions_stretch_scale`, оскільки його легше налаштувати.
zh_tw: 若要在執行期間以腳本設定拉伸基礎尺寸，請使用 ``get_tree().root.content_scale_size`` 屬性（參見 :ref:`Window.content_scale_size <class_Window_property_content_scale_size>`）。更改此值會間接改變 2D 元素的大小。不過，若要提供給使用者自訂縮放選項，建議使用 :ref:`doc_multiple_resolutions_stretch_scale`，這樣更容易調整。

source: Godot follows a modern approach to multiple resolutions. The engine will never change the monitor's resolution on its own. While changing the monitor's resolution is the most efficient approach, it's also the least reliable approach as it can leave the monitor stuck on a low resolution if the game crashes. This is especially common on macOS or Linux which don't handle resolution changes as well as Windows.
ga: Leanann Godot cur chuige nua-aimseartha maidir le rúin éagsúla. Ní athróidh an t-inneall rún an mhonatóra as a stuaim féin. Cé gurb é réiteach an mhonatóra an cur chuige is éifeachtaí, is é an cur chuige is lú iontaofa é freisin mar is féidir leis an monatóir a fhágáil greamaithe ar réiteach íseal má chliseann an cluiche. Tá sé seo coitianta go háirithe ar macOS nó Linux nach láimhseálann athruithe réitigh chomh maith le Windows.
it: Godot segue un approccio moderno alle risoluzioni multiple. Il motore non cambierà mai la risoluzione del monitor da solo. Sebbene cambiare la risoluzione del monitor sia l'approccio più efficiente, è anche il meno affidabile, in quanto può bloccare il monitor su una risoluzione bassa in caso di arresti anomali del gioco. Questo è particolarmente comune su macOS o Linux, che non gestiscono i cambiamenti alla risoluzione con la stessa efficacia di Windows.
ru: Godot следует современному подходу к работе с несколькими разрешениями. Движок никогда не меняет разрешение монитора самостоятельно. Хотя изменение разрешения монитора — самый эффективный подход, это также и самый ненадёжный, поскольку он может привести к тому, что монитор останется на низком разрешении, если игра зависнет. Это особенно распространено в macOS и Linux, которые не так хорошо обрабатывают смену разрешения, как Windows.
ta: கோடோட் பல தீர்மானங்களுக்கான நவீன அணுகுமுறையைப் பின்பற்றுகிறார். இயந்திரம் ஒருபோதும் மானிட்டரின் தீர்மானத்தை சொந்தமாக மாற்றாது. மானிட்டரின் தீர்மானத்தை மாற்றுவது மிகவும் திறமையான அணுகுமுறையாக இருக்கும்போது, இது மிகவும் நம்பகமான அணுகுமுறையாகும், ஏனெனில் இது விளையாட்டு செயலிழந்தால் மானிட்டரை குறைந்த தெளிவுத்திறனில் சிக்க வைக்கும். தெளிவுத்திறன் மாற்றங்களையும் விண்டோசையும் கையாளாத மேகோச் அல்லது லினக்சில் இது மிகவும் பொதுவானது.
uk: Ґодо дотримується сучасного підходу до кількох дозволів. Механізм ніколи не змінить роздільну здатність монітора самостійно. Хоча зміна роздільної здатності монітора є найефективнішим підходом, це також найменш надійний підхід, оскільки він може залишити монітор на низькій роздільній здатності, якщо гра аварійно завершує роботу. Це особливо часто трапляється в macOS або Linux, які не так добре обробляють зміни роздільної здатності, як Windows.
zh_cn: Godot遵循了现代多种分辨率的方法. 引擎永远不会自行改变显示器的分辨率. 虽然改变显示器的分辨率是最有效的方法, 但这也是最不可靠的方法, 因为如果游戏崩溃, 它可能会让显示器卡在一个低分辨率上. 这在macOS或Linux上很常见, 因为它们对分辨率变化的处理不如Windows.
zh_tw: Godot 採用現代化的多重解析度處理方式。引擎本身**不會**主動變更螢幕解析度。雖然直接更動螢幕解析度效率最高，但這卻是最不可靠的做法，因為如果遊戲閃退，顯示器可能會卡在低解析度。這種情況在 macOS 或 Linux 上尤其常見，因為它們對於動態解析度切換的處理不如 Windows。

source: Changing the monitor's resolution also removes any control from the game developer over filtering and aspect ratio stretching, which can be important to ensure correct display for pixel art games.
ga: Má athraítear rún an mhonatóra, baintear aon rialú ón bhforbróir cluiche maidir le scagadh agus síneadh cóimheasa gné, rud a d'fhéadfadh a bheith tábhachtach chun taispeáint cheart a chinntiú do chluichí ealaíne picteilín.
it: Cambiando la risoluzione del monitor si rimuove anche qualsiasi controllo dallo sviluppatore del gioco sul filtraggio e sullo stiramento del rapporto di aspetto, che possono essere importanti per garantire una visualizzazione corretta nei giochi in pixel art.
ru: Изменение разрешения монитора также лишает разработчика игры возможности контролировать фильтрацию и растяжение соотношения сторон, что может быть важно для обеспечения корректного отображения в играх с пиксельной графикой.
ta: மானிட்டரின் தெளிவுத்திறனை மாற்றுவது விளையாட்டு டெவலப்பரிடமிருந்து வடிகட்டுதல் மற்றும் விகித விகித நீட்சி ஆகியவற்றைக் காட்டிலும் எந்தவொரு கட்டுப்பாட்டையும் நீக்குகிறது, இது படப்புள்ளி கலை விளையாட்டுகளுக்கான சரியான காட்சியை உறுதிப்படுத்த முக்கியமானது.
uk: Зміна роздільної здатності монітора також позбавляє розробника гри будь-який контроль над фільтрацією та розтягуванням співвідношення сторін, що може бути важливим для забезпечення правильного відображення для ігор з піксельним мистецтвом.
zh_cn: 更改显示器的分辨率还会取消游戏开发者对过滤和纵横比拉伸的控制, 这对于确保像素游戏的正确显示画面非常重要.
zh_tw: 更改螢幕解析度也會讓開發者喪失對濾鏡和長寬比拉伸的掌控，這對像素美術遊戲來說尤其重要，否則畫面容易失真。

source: On top of that, changing the monitor's resolution makes alt-tabbing in and out of a game much slower since the monitor has to change resolutions every time this is done.
ga: Ar a bharr sin, má athraítear rún an mhonatóra, bíonn alt-tabbing isteach agus amach as cluiche i bhfad níos moille ós rud é go gcaithfidh an monatóir rúin a athrú gach uair a dhéantar é seo.
it: Oltretutto, cambiare la risoluzione del monitor rende molto più lento l'uso della combinazione Alt-Tab per entrare e uscire da un gioco, poiché il monitor deve cambiare risoluzione ogni volta che lo si fa.
ru: Вдобавок ко всему, изменение разрешения монитора значительно замедляет переключение между играми с помощью сочетания клавиш Alt-Tab, поскольку монитору каждый раз приходится менять разрешение.
ta: அதற்கு மேல், மானிட்டரின் தெளிவுத்திறனை மாற்றுவது ஒவ்வொரு முறையும் மானிட்டர் தீர்மானங்களை மாற்ற வேண்டியிருப்பதால், ஒரு விளையாட்டுக்கு உள்ளேயும் வெளியேயும் ஆல்ட்-டாப்பிங் செய்வதை மிகவும் மெதுவாகச் செய்கிறது.
uk: Крім того, зміна роздільної здатності монітора значно повільніше вмикає та виводить з гри клавішу Alt Tab, оскільки монітор має змінювати роздільну здатність кожного разу, коли це робиться.
zh_cn: 最重要的是, 更改显示器的分辨率会使游戏的Alt-Tab键切换速度变慢, 因为每次切换时显示器都必须更改分辨率.
zh_tw: 此外，切換螢幕解析度會讓 Alt-Tab 切換遊戲的速度變得很慢，因為每次切換都會重設解析度。

source: Resizing
ga: Athrú
it: Ridimensionamento
pt_br: Redimensionando
ru: Изменение размера
ta: மறுஅளவிடுதல்
uk: Зміна розміру %1
zh_cn: 调整大小
zh_tw: 縮放處理

source: There are several types of devices, with several types of screens, which in turn have different pixel density and resolutions. Handling all of them can be a lot of work, so Godot tries to make the developer's life a little easier. The :ref:`Viewport <class_Viewport>` node has several functions to handle resizing, and the root node of the scene tree is always a viewport (scenes loaded are instanced as a child of it, and it can always be accessed by calling ``get_tree().root`` or ``get_node("/root")``).
ga: Tá cineálacha éagsúla feistí ann, le roinnt cineálacha scáileáin, a bhfuil dlús agus rúin éagsúla picteilín acu. Is féidir go leor oibre a láimhseáil gach ceann acu, agus mar sin déanann Godot iarracht saol an fhorbróra a dhéanamh beagán níos éasca. Tá feidhmeanna éagsúla ag an nód :ref:`Viewport <class_Viewport>` chun an méid a athrú a láimhseáil, agus is éard atá i bhfréamh nód an chrainn radhairc i gcónaí ná amharcléiriú (cuirtear radhairc luchtaithe mar pháiste air, agus is féidir teacht air i gcónaí ach glaoch ar ` `get_tree().root`` nó ``get_node("/root")``).
it: Esistono diversi tipi di dispositivi, con diversi tipi di schermi, che a loro volta hanno densità di pixel e risoluzioni diverse. Gestirli tutti può essere molto impegnativo, quindi Godot cerca di semplificare un po' la vita dello sviluppatore. Il nodo :ref:`Viewport <class_Viewport>` ha diverse funzioni per gestire il ridimensionamento, e il nodo radice dell'albero di scene è sempre una viewport (le scene caricate sono istanziate come suo figlio, ed è sempre possibile accedervi chiamando ``get_tree().root`` o ``get_node("/root")``).
ru: Существует несколько типов устройств с экранами разных типов, которые, в свою очередь, имеют разную плотность пикселей и разрешение. Работа со всеми ними может потребовать немало усилий, поэтому Godot старается немного облегчить жизнь разработчикам. Узел :ref:`Viewport <class_Viewport>` имеет несколько функций для управления изменением размера, а корневой узел дерева сцены всегда является областью просмотра (загружаемые сцены создаются как её дочерние экземпляры, и к ней всегда можно получить доступ, вызвав ``get_tree().root`` или ``get_node("/root")``).
ta: பல வகையான சாதனங்கள் உள்ளன, பல வகையான திரைகள் உள்ளன, அவை வெவ்வேறு படப்புள்ளி அடர்த்தி மற்றும் தீர்மானங்களைக் கொண்டுள்ளன. அவை அனைத்தையும் கையாள்வது நிறைய வேலையாக இருக்கலாம், எனவே கோடோட் டெவலப்பரின் வாழ்க்கையை கொஞ்சம் எளிதாக்க முயற்சிக்கிறார். தி: ரெஃப்: `பார்வைப்போர்ட் <கிளாச்_விவோர்ட்>` கணு மறுஅளவிடுதலைக் கையாள பல செயல்பாடுகளைக் கொண்டுள்ளது, மேலும் காட்சி மரத்தின் ரூட் முனை எப்போதும் ஒரு காட்சியகமாக இருக்கும் (ஏற்றப்பட்ட காட்சிகள் அதன் குழந்தையாக நிறுவப்படுகின்றன, மேலும் அதை எப்போதும் அழைப்பதன் மூலம் அணுகலாம் ` `get_tree (). ரூட்`` அல்லது` `get_node ("/root ")` `).
uk: Існує кілька типів пристроїв з різними типами екранів, які, у свою чергу, мають різну щільність пікселів і роздільну здатність. Робота з усіма ними може бути важкою, тому Годо намагається трохи полегшити життя розробника. Вузол :ref:`Viewport <class_Viewport>` має кілька функцій для обробки зміни розміру, а кореневий вузол дерева сцени завжди є вікном перегляду (завантажені сцени створюються як дочірні для нього, і до нього завжди можна отримати доступ, викликавши ` `get_tree().root`` або ``get_node("/root")``).
zh_cn: 设备有多种类型，其屏幕也有多种类型，而屏幕又具有不同的像素密度和分辨率。处理所有这些可能是一项艰巨的工作，因此 Godot 试图让开发人员的生活更轻松一些。\ :ref:`Viewport <class_Viewport>` 节点有多个函数来处理调整大小，并且场景树的根节点始终是一个视口（加载的场景实例化为其子节点，并且始终可以通过调用 ``get_tree().root`` 或 ``get_node("/root")`` 来访问它）。
zh_tw: 市面上的裝置類型繁多，螢幕種類、像素密度和解析度都不一樣。要全部兼容非常費工，因此 Godot 提供許多工具協助開發者。:ref:`Viewport <class_Viewport>` 節點具備各種縮放處理功能，場景樹的根節點永遠是一個 viewport（載入的場景會被實例化為其子節點，可透過 ``get_tree().root`` 或 ``get_node("/root")`` 取得）。

source: In any case, while changing the root Viewport params is probably the most flexible way to deal with the problem, it can be a lot of work, code and guessing, so Godot provides a set of parameters in the project settings to handle multiple resolutions.
ga: In aon chás, cé go bhfuil athrú ar an params root Viewport dócha gurb é an bealach is solúbtha chun déileáil leis an bhfadhb, is féidir é a bheith ina lán oibre, cód agus buille faoi thuairim, mar sin soláthraíonn Godot sraith paraiméadair sna socruithe tionscadail chun rúin éagsúla a láimhseáil.
it: In ogni caso, sebbene modificare i parametri della Viewport radice sia probabilmente il modo più flessibile per gestire il problema, può richiedere molto lavoro, codice e supposizioni, quindi Godot fornisce un insieme di parametri nelle impostazioni del progetto per gestire più risoluzioni.
ru: В любом случае, хотя изменение параметров корневого Viewport, вероятно, является наиболее гибким способом решения проблемы, это может потребовать много работы, кода и догадок, поэтому Godot предоставляет набор параметров в настройках проекта для работы с несколькими разрешениями.
ta: எந்தவொரு சந்தர்ப்பத்திலும், ரூட் வியூபோர்ட் அளவுருக்களை மாற்றுவது சிக்கலைச் சமாளிக்க மிகவும் நெகிழ்வான வழியாகும், இது நிறைய வேலை, குறியீடு மற்றும் யூகமாக இருக்கலாம், எனவே கோடோட் பல தீர்மானங்களைக் கையாள திட்ட அமைப்புகளில் அளவுருக்களின் தொகுப்பை வழங்குகிறது.
uk: У будь-якому випадку, незважаючи на те, що зміна кореневих параметрів Viewport є, ймовірно, найбільш гнучким способом вирішення проблеми, це може потребувати багато роботи, кодування та здогадок, тому Godot надає набір параметрів у налаштуваннях проекту для обробки кількох роздільних здатностей.
zh_cn: 无论如何，虽然更改根视口参数可能是解决问题最灵活的方法，但它可能需要大量的工作、代码和猜测，因此 Godot 在项目设置中提供了一组参数来处理多种分辨率。
zh_tw: 雖然直接修改根 Viewport 參數是最彈性的解法，但這會帶來更多工作量、程式碼與推測，因此 Godot 在專案設定中提供了一套參數，讓你輕鬆處理多重解析度。

source: Stretch settings
ga: Socruithe sín
it: Impostazioni di allungamento
pt_br: Configurações de alongamento
ru: Настройки растяжения
ta: அமைப்புகளை நீட்டவும்
uk: Налаштування розтяжки
zh_cn: 拉伸设置
zh_tw: 拉伸設定

source: Stretch settings are located in the project settings and provide several options:
ga: Tá socruithe stráice suite i socruithe an tionscadail agus soláthraíonn siad roinnt roghanna:
it: Le impostazioni di stiramento si trovano nelle impostazioni del progetto e offrono diverse opzioni:
ru: Настройки растяжения находятся в настройках проекта и предоставляют несколько вариантов:
ta: நீட்டிக்க அமைப்புகள் திட்ட அமைப்புகளில் அமைந்துள்ளன மற்றும் பல விருப்பங்களை வழங்குகின்றன:
uk: Налаштування розтягування знаходяться в налаштуваннях проекту та надають кілька варіантів:
zh_cn: 拉伸设置位于项目设置中, 提供了几个选项:
zh_tw: 拉伸設定可在專案設定中找到，包含以下選項：

source: Stretch Mode
ga: Mód Sín
it: Modo di allungamento
pt_br: Modo Esticado
ru: Режим растяжения
ta: நீட்டிப்பு பயன்முறை
uk: Режим виділення
zh_cn: 拉伸模式
zh_tw: 拉伸模式

source: The **Stretch Mode** setting defines how the base size is stretched to fit the resolution of the window or screen. The animations below use a "base size" of just 16×9 pixels to demonstrate the effect of different stretch modes. A single sprite, also 16×9 pixels in size, covers the entire viewport, and a diagonal :ref:`Line2D <class_Line2D>` is added on top of it:
ga: Sainmhíníonn an socrú **Mód Sín** conas a shíntear an bunmhéid le go n-oirfeadh sé do thaifeach na fuinneoige nó an scáileáin. Úsáideann na beochana thíos "bonnmhéid" de 16×9 picteilín chun éifeacht na modhanna stráice éagsúla a léiriú. Clúdaíonn sprite amháin, chomh maith 16×9 picteilín i méid, an radharc iomlán, agus cuirtear trasnán :ref:`Line2D <class_Line2D>` ar a bharr:
it: L'impostazione **Modalità di stiramento** definisce il modo in cui le dimensioni base vengono stirate per adattarsi alla risoluzione della finestra o schermo. Le animazioni seguenti utilizzano "dimensioni base" di soli 16×9 pixel per dimostrare l'effetto delle diverse modalità di stiramento. Un singolo sprite, anch'esso di 16×9 pixel, copre l'intera viewport, e sopra di esso viene aggiunta una :ref:`Line2D <class_Line2D>` diagonale:
ru: Параметр **Stretch Mode** определяет, как базовый размер растягивается в соответствии с разрешением окна или экрана. В приведенных ниже анимациях используется "базовый размер" всего 16×9 пикселей для демонстрации эффекта различных режимов растяжения. Один спрайт, также размером 16×9 пикселей, покрывает всю область просмотра, а поверх него добавляется диагональный элемент :ref:`Line2D <class_Line2D>`:
ta: சாளரம் அல்லது திரையின் தெளிவுத்திறனுக்கு ஏற்றவாறு அடிப்படை அளவு எவ்வாறு நீட்டப்படுகிறது என்பதை ** நீட்டிப்பு பயன்முறை ** அமைப்பு வரையறுக்கிறது. கீழேயுள்ள அனிமேசன்கள் வெவ்வேறு நீட்டிக்க முறைகளின் விளைவை நிரூபிக்க வெறும் 16 × 9 பிக்சல்களின் "அடிப்படை அளவு" ஐப் பயன்படுத்துகின்றன. ஒரு ஒற்றை ச்ப்ரைட், 16 × 9 படப்புள்ளிகள் அளவு, முழு காட்சியகத்தையும் உள்ளடக்கியது, மற்றும் ஒரு மூலைவிட்டத்தை உள்ளடக்கியது: குறிப்பு: `line2d <class_line2d>` அதன் மேல் சேர்க்கப்பட்டுள்ளது:
uk: Налаштування **Режим розтягування** визначає, як основний розмір розтягується відповідно до роздільної здатності вікна чи екрана. У наведених нижче анімаціях використовується «базовий розмір» лише 16×9 пікселів, щоб продемонструвати ефект різних режимів розтягування. Один спрайт, також розміром 16 × 9 пікселів, охоплює все вікно перегляду, і діагональ :ref:`Line2D <class_Line2D>` додається поверх нього:
zh_cn: **拉伸模式**\ 设置定义了如何拉伸基本大小以适应窗口或屏幕的分辨率。下面的动画使用仅 16×9 像素的“基本大小”来演示不同拉伸模式的效果。同样为 16×9 像素的单个精灵覆盖整个视口，并在其上添加一条对角线 :ref:`Line2D <class_Line2D>`：
zh_tw: **Stretch Mode** （拉伸模式）決定基礎尺寸如何被拉伸來適應螢幕或視窗解析度。以下動畫以 16×9 像素的「基礎尺寸」示範不同拉伸模式的效果。單一精靈（同樣 16×9 像素）覆蓋整個視口，並在上方加上一條對角線 :ref:`Line2D <class_Line2D>` ：

source: **Stretch Mode = Disabled** (default): No stretching happens. One unit in the scene corresponds to one pixel on the screen. In this mode, the **Stretch Aspect** setting has no effect.
ga: ** Mód Sín = Díchumasaithe ** (réamhshocrú): Ní tharlaíonn aon síneadh. Freagraíonn aonad amháin sa radharc do phicteilín amháin ar an scáileán. Sa mhodh seo, níl aon éifeacht ag an socrú **Stretch Aspect **.
it: **Modalità di stiramento = Disabled** (predefinita): non si verifica alcun stiramento. Un'unità nella scena corrisponde a un pixel sullo schermo. In questa modalità, l'impostazione **Aspetto di stiramento** non ha alcun effetto.
ru: **Stretch Mode = Disabled** (по умолчанию): растяжение не происходит. Одна единица измерения в сцене соответствует одному пикселю на экране. В этом режиме параметр **Stretch Aspect** не действует.
ta: ** நீட்சி பயன்முறை = முடக்கப்பட்டது ** (இயல்புநிலை): நீட்டிப்பு எதுவும் நடக்காது. காட்சியில் ஒரு அலகு திரையில் ஒரு பிக்சலுடன் ஒத்திருக்கிறது. இந்த பயன்முறையில், ** நீட்டிப்பு நற்பொருத்தம் ** அமைப்பு எந்த விளைவையும் ஏற்படுத்தாது.
uk: **Режим розтягування = вимкнено** (за замовчуванням): розтягування не відбувається. Одна одиниця в сцені відповідає одному пікселю на екрані. У цьому режимі налаштування **Stretch Aspect** не діє.
zh_cn: **Stretch Mode = Disabled**\ （默认）：不发生拉伸。场景中的一个单位对应屏幕上的一个像素。在这种模式下，\ **拉伸纵横比**\ 设置无效。
zh_tw: **Stretch Mode = Disabled** （預設）：不進行拉伸。場景中的一單位對應螢幕上一像素。在這種模式下， **Stretch Aspect** （拉伸比例）設定無效。

source: **Stretch Mode = Canvas Items**: In this mode, the base size specified in width and height in the project settings is stretched to cover the whole screen (taking the **Stretch Aspect** setting into account). This means that everything is rendered directly at the target resolution. 3D is unaffected, while in 2D, there is no longer a 1:1 correspondence between sprite pixels and screen pixels, which may result in scaling artifacts.
ga: ** Mód Sín = Míreanna Canbhás **: Sa mhodh seo, tá an bunmhéid a shonraítear i leithead agus airde i socruithe an tionscadail sínte chun an scáileán iomlán a chlúdach (ag cur an ** Gné Sín ** ag socrú san áireamh). Ciallaíonn sé seo go ndéantar gach rud go díreach ag an réiteach sprice. Níl aon tionchar ag 3D, agus i 2D, níl comhfhreagras 1:1 ann a thuilleadh idir picteilíní sprite agus picteilíní scáileáin, rud a d'fhéadfadh déantáin scálú a bheith mar thoradh air.
it: **Modalità di stiramento = Canvas Items**: in questa modalità, le dimensioni base, specificate in larghezza e altezza nelle impostazioni del progetto, vengono stirate per coprire l'intero schermo (tenendo conto dell'impostazione **Aspetto di stiramento**). Ciò significa che tutto viene renderizzato direttamente alla risoluzione di destinazione. Il 3D non è influenzato, mentre in 2D non esiste più una corrispondenza 1:1 trai pixel degli sprite e i pixel dello schermo, il che potrebbe causare artefatti di ridimensionamento.
ru: **Stretch Mode = Canvas Items**: В этом режиме базовый размер, заданный в настройках проекта (ширина и высота), растягивается на весь экран (с учётом параметра **Stretch Aspect**). Это означает, что всё отображается непосредственно в целевом разрешении. 3D-графика остаётся неизменной, тогда как в 2D соответствие 1:1 между пикселями спрайта и пикселями экрана нарушается, что может привести к появлению артефактов масштабирования.
ta: . இதன் பொருள் எல்லாம் இலக்கு தீர்மானத்தில் நேரடியாக வழங்கப்படுகிறது. 3D பாதிக்கப்படாது, அதே நேரத்தில் 2D இல், ச்பிரிட் படப்புள்ளிகள் மற்றும் திரை பிக்சல்களுக்கு இடையில் 1: 1 கடித தொடர்பு இல்லை, இதன் விளைவாக கலைப்பொருட்கள் அளவிடப்படலாம்.
uk: **Режим розтягування = Елементи полотна**: у цьому режимі основний розмір, указаний у ширині та висоті в налаштуваннях проекту, розтягується, щоб охопити весь екран (з урахуванням параметра **Розтягнення**). Це означає, що все відображається безпосередньо з цільовою роздільною здатністю. На 3D це не впливає, тоді як у 2D більше немає відповідності 1:1 між пікселями спрайтів і пікселями екрана, що може призвести до артефактів масштабування.
zh_cn: **Stretch Mode = Canvas Items**\ ：在这种模式下，项目设置中以宽度和高度指定的基本大小将被拉伸以覆盖整个屏幕（会考虑\ **拉伸纵横比**\ 设置）。这意味着所有内容都直接以目标分辨率渲染。3D 不受影响，而在 2D 中，精灵像素和屏幕像素之间不再是 1:1 的对应关系，这可能会导致缩放伪影。
zh_tw: **Stretch Mode = Canvas Items**：在此模式下，專案設定中所指定的寬度與高度（基礎尺寸）會被拉伸以覆蓋整個螢幕（會考慮 **Stretch Aspect** 設定）。這代表所有物件都直接以目標解析度進行算繪。3D 畫面不受影響；而 2D 則不再有精靈像素與螢幕像素的 1:1 對應，可能導致縮放失真。
