Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: ga, it, pt_br, ru, ta, uk, zh_cn, zh_tw

source: Multiple resolutions
ga: Rúin iolracha
it: Molteplici risoluzioni
pt_br: Resoluções múltiplas
ru: Несколько резолюций
ta: பல தீர்மானங்கள்
uk: Кілька дозволів
zh_cn: 多分辨率
zh_tw: 多重解析度

source: The problem of multiple resolutions
ga: An fhadhb a bhaineann le rúin iolracha
it: Il problema di più risoluzioni
pt_br: O problema das múltiplas resoluções
ru: Проблема множественных резолюций
ta: பல தீர்மானங்களின் சிக்கல்
uk: Проблема множинних дозволів
zh_cn: 多分辨率问题
zh_tw: 多重解析度的問題

source: Developers often have trouble understanding how to best support multiple resolutions in their games. For desktop and console games, this is more or less straightforward, as most screen aspect ratios are 16:9 and resolutions are standard (720p, 1080p, 1440p, 4K, …).
ga: Is minic a bhíonn deacracht ag forbróirí tuiscint a fháil ar conas is fearr tacú le rúin iolracha ina gcluichí. Maidir le cluichí deisce agus consóil, tá sé seo níos simplí nó níos lú, toisc go bhfuil an chuid is mó de na cóimheasa gné scáileáin 16: 9 agus tá rúin caighdeánach (720p, 1080p, 1440p, 4K, ...).
it: Gli sviluppatori hanno spesso difficoltà a capire come supportare al meglio più risoluzioni nei loro giochi. Per i giochi su desktop e console, questo è più o meno semplice, poiché la maggioranza dei rapporti d'aspetto dello schermo è 16:9 e le risoluzioni sono standard (720p, 1080p, 1440p, 4K, ...).
ru: Разработчики часто не понимают, как лучше всего реализовать поддержку нескольких разрешений в своих играх. Для игр для настольных компьютеров и консолей это более или менее просто, поскольку большинство экранов имеют соотношение сторон 16:9, а разрешения стандартны (720p, 1080p, 1440p, 4K и т. д.).
ta: உருவாக்குபவர்கள் தங்கள் விளையாட்டுகளில் பல தீர்மானங்களை எவ்வாறு சிறப்பாக ஆதரிப்பது என்பதைப் புரிந்துகொள்வதில் சிக்கல் உள்ளது. டெச்க்டாப் மற்றும் கன்சோல் கேம்களைப் பொறுத்தவரை, இது அதிகமாகவோ அல்லது குறைவாகவோ நேரடியானது, ஏனெனில் பெரும்பாலான திரை அம்ச விகிதங்கள் 16: 9 மற்றும் தீர்மானங்கள் தரமானவை (720p, 1080p, 1440p, 4k,…).
uk: Розробникам часто важко зрозуміти, як найкраще підтримувати кілька роздільних здатностей у своїх іграх. Для настільних і консольних ігор це більш-менш просто, оскільки співвідношення сторін більшості екранів становить 16:9, а роздільна здатність стандартна (720p, 1080p, 1440p, 4K, …).
zh_cn: 开发人员经常会遇到麻烦, 不知道如何在他们的游戏中最好地支持多种分辨率. 对于桌面和控制台游戏, 这或多或少是简单的, 因为大多数屏幕长宽比是16:9, 分辨率是标准的720p, 1080p, 1440p, 4K,.......
zh_tw: 開發者常常對於如何在遊戲中最佳化支援多種解析度感到困擾。對於桌面和主機遊戲來說，這較為單純，因為大多數螢幕的長寬比為 16:9，且解析度多為標準規格（720p、1080p、1440p、4K……）。

source: For mobile games, at first, it was easy. For many years, the iPhone and iPad used the same resolution. When *Retina* was implemented, they just doubled the pixel density; most developers had to supply assets in default and double resolutions.
ga: Maidir le cluichí soghluaiste, ar dtús, bhí sé éasca. Le blianta fada, d'úsáid an iPhone agus an iPad an rún céanna. Nuair a cuireadh *Retina *i bhfeidhm, ní dhearna siad ach an dlús picteilín a dhúbailt; B'éigean don chuid is mó d'fhorbróirí sócmhainní a sholáthar i rúin réamhshocraithe agus dúbailte.
it: Per i giochi sui dispositivi mobili, all'inizio è stato facile. Per molti anni, iPhone e iPad hanno utilizzato la stessa risoluzione. Quando è stato implementato *Retina*, hanno solo raddoppiato la densità dei pixel; la maggioranza degli sviluppatori ha dovuto fornire risorse con risoluzioni predefinite e doppie.
ru: Для мобильных игр поначалу всё было просто. Долгие годы iPhone и iPad использовали одинаковое разрешение. С появлением *Retina* плотность пикселей просто удвоилась; большинству разработчиков пришлось предоставлять ресурсы в разрешениях по умолчанию и в удвоенном разрешении.
ta: மொபைல் கேம்களுக்கு, முதலில், இது எளிதானது. பல ஆண்டுகளாக, ஐபோன் மற்றும் ஐபாட் அதே தெளிவுத்திறனைப் பயன்படுத்தின. * விழித்திரை * செயல்படுத்தப்பட்டபோது, அவை படப்புள்ளி அடர்த்தியை இரட்டிப்பாக்கின; பெரும்பாலான உருவாக்குபவர்கள் இயல்புநிலை மற்றும் இரட்டை தீர்மானங்களில் சொத்துக்களை வழங்க வேண்டியிருந்தது.
uk: Для мобільних ігор спочатку це було легко. Протягом багатьох років iPhone і iPad використовували однакову роздільну здатність. Коли *Retina* була реалізована, вони просто подвоїли щільність пікселів; більшості розробників доводилося надавати ресурси за умовчанням і подвійною роздільною здатністю.
zh_cn: 对于手机游戏来说，起初，这很容易。许多年来，iPhone 和 iPad 使用相同的分辨率。当实行 *Retina* 后，他们只是将像素密度提高了一倍；大多数开发商不得不以默认和双倍的分辨率提供资产。
zh_tw: 行動遊戲一開始也很單純。多年來 iPhone 和 iPad 都使用相同的解析度。引入 *Retina* 後，他們只提高了像素密度，大多數開發者只需要提供預設和雙倍解析度的美術素材。

source: Nowadays, this is no longer the case, as there are plenty of different screen sizes, densities, and aspect ratios. Non-conventional sizes are also becoming increasingly popular, such as ultrawide displays.
ga: Sa lá atá inniu ann, ní hamhlaidh atá a thuilleadh, mar tá go leor méideanna scáileáin, dlúis agus cóimheasa gné éagsúla ann. Tá méideanna neamhghnásacha ag éirí níos coitianta freisin, mar shampla taispeántais ultrawide.
it: Oggigiorno, questo non è più il caso, poiché esistono numerose dimensioni, densità e proporzioni di schermi. Anche le dimensioni non convenzionali stanno diventando sempre più popolari, come i display ultrawide.
ru: В наши дни это уже не так, поскольку существует множество различных размеров экранов, плотностей пикселей и соотношений сторон. Нестандартные размеры также становятся всё более популярными, например, сверхширокие дисплеи.
ta: இப்போதெல்லாம், இது இனி இல்லை, ஏனெனில் வெவ்வேறு திரை அளவுகள், அடர்த்தி மற்றும் அம்ச விகிதங்கள் ஏராளமாக உள்ளன. அல்ட்ராவைட் காட்சிகள் போன்ற வழக்கத்திற்கு மாறான அளவுகளும் பெருகிய முறையில் பிரபலமடைந்து வருகின்றன.
uk: Зараз це вже не так, оскільки існує багато різних розмірів екрану, щільності та співвідношення сторін. Нетрадиційні розміри також стають дедалі популярнішими, наприклад ультраширокі дисплеї.
zh_cn: 如今, 情况已不再如此, 因为有很多不同的屏幕尺寸, 密度和长宽比. 非传统的尺寸也越来越受欢迎, 如超宽显示屏.
zh_tw: 現在情況已經不同，市面上有許多不同的螢幕尺寸、密度與長寬比。非傳統尺寸（如超寬螢幕）也越來越普及。

source: For 3D games, there is not much of a need to support multiple resolutions (from the aesthetic point of view). The 3D geometry will just fill the screen based on the field of view, disregarding the aspect ratio. The main reason one may want to support this, in this case, is for *performance* reasons (running in lower resolution to increase frames per second).
ga: I gcás cluichí 3D, níl mórán de dhíth chun tacú le rúin éagsúla (ó thaobh aeistéitiúil de). Líonfaidh an gheoiméadracht 3D an scáileán bunaithe ar réimse an radhairc, gan aird a thabhairt ar an gcóimheas treoíochta. Is é an chúis is mó a d'fhéadfadh duine a bheith ag iarraidh tacú leis seo, sa chás seo, ná ar chúiseanna *performance *(ag rith i réiteach níos ísle chun frámaí a mhéadú in aghaidh an tsoicind).
uk: Для 3D-ігор немає особливої потреби підтримувати кілька роздільних здатностей (з естетичної точки зору). 3D-геометрія просто заповнить екран залежно від поля зору, не враховуючи співвідношення сторін. Основною причиною, чому можна захотіти підтримувати це, у цьому випадку, є *продуктивність* (працює з нижчою роздільною здатністю для збільшення кадрів на секунду).
zh_cn: 对于3D游戏来说, 没有太大的必要支持多种分辨率(从审美角度来看).3D几何图形将根据视场填充屏幕, 而不考虑长宽比. 在这种情况下, 人们可能想要支持的主要原因是为了 *性能* 的原因(以较低的分辨率运行以增加每秒的帧数).
zh_tw: 對於 3D 遊戲來說，從視覺美學的角度並不太需要特別支援多種解析度。3D 幾何會依照視野自動填滿畫面，並不在意螢幕長寬比。唯一可能需要支援多重解析度的情境，是出於 *效能* 考量（以低解析度運作以提升每秒顯示張數）。

source: For 2D and game UIs, this is a different matter, as art needs to be created using specific pixel sizes in software such as Photoshop, GIMP or Krita.
ga: I gcás UIs 2D agus cluiche, is ábhar difriúil é seo, mar ní mór ealaín a chruthú ag baint úsáide as méideanna picteilín ar leith i mbogearraí mar Photoshop, GIMP nó Krita.
uk: Для двовимірних і ігрових інтерфейсів це інша справа, оскільки мистецтво потрібно створювати з використанням певних розмірів пікселів у таких програмах, як Photoshop, GIMP або Krita.
zh_cn: 对于2D和游戏UI, 这是一个不同的问题, 因为设计需要在Photoshop, GIMP或Krita等软件中使用特定的像素尺寸来创建.
zh_tw: 但對於 2D 及遊戲 UI 來說情況不同，因為美術素材需要用像 Photoshop、GIMP 或 Krita 這類軟體，以特定像素尺寸繪製。

source: Since layouts, aspect ratios, resolutions, and pixel densities can change so much, it is no longer possible to design UIs for every specific screen. Another method must be used.
ga: Ós rud é gur féidir le leagan amach, cóimheasa gné, taifigh agus dlúis picteilín an oiread sin a athrú, ní féidir UIanna a dhearadh a thuilleadh do gach scáileán ar leith. Ní mór modh eile a úsáid.
it: Poiché i layout, le proporzioni, le risoluzioni e le densità dei pixel possono variare notevolmente, non è più possibile progettare interfacce utente specifiche per ogni schermo. È necessario utilizzare un altro metodo.
ru: Поскольку макеты, соотношения сторон, разрешения и плотность пикселей могут меняться настолько сильно, проектировать пользовательский интерфейс для каждого конкретного экрана уже невозможно. Необходимо использовать другой метод.
ta: தளவமைப்புகள், அம்ச விகிதங்கள், தீர்மானங்கள் மற்றும் படப்புள்ளி அடர்த்தி ஆகியவை இவ்வளவு மாறக்கூடும் என்பதால், ஒவ்வொரு குறிப்பிட்ட திரைக்கும் இடைமுகம் ஐ வடிவமைக்க இனி சாத்தியமில்லை. மற்றொரு முறை பயன்படுத்தப்பட வேண்டும்.
uk: Оскільки макети, співвідношення сторін, роздільна здатність і щільність пікселів можуть сильно змінюватися, більше неможливо розробити інтерфейс користувача для кожного окремого екрана. Треба використовувати інший метод.
zh_cn: 由于布局, 长宽比, 分辨率和像素密度会有很大的变化, 因此不再可能为每个特定的屏幕设计UI. 必须使用另一种方法.
zh_tw: 由於版面配置、長寬比、解析度和像素密度變動幅度大，已經不可能為每一種螢幕設計專屬的 UI，因此必須採用其他方法。

source: One size fits all
ga: Oireann méid amháin do gach
it: Una taglia unica per tutti
ru: Один размер подходит всем
ta: ஒரு அளவு அனைவருக்கும் பொருந்துகிறது
uk: Один розмір для всіх
zh_cn: 万全之策
zh_tw: 統一尺寸適配

source: The most common approach is to use a single *base* resolution and then fit it to everything else. This resolution is how most players are expected to play the game (given their hardware). For mobile, Google has useful `stats <https://developer.android.com/about/dashboards>`_ online, and for desktop, Steam `also does <https://store.steampowered.com/hwsurvey/>`_.
ga: Is é an cur chuige is coitianta ná taifeach amháin *bonn* a úsáid agus ansin é a chur in oiriúint do gach rud eile. Is é an rún seo an chaoi a bhfuiltear ag súil go n-imreoidh formhór na n-imreoirí an cluiche (i bhfianaise a gcuid crua-earraí). Le haghaidh soghluaiste, tá `stats <https://developer.android.com/about/dashboards>`_ ar líne úsáideach ag Google, agus le haghaidh deasc, déanann Steam `<https://store.steampowered.com/hwsurvey/>` _.
ru: Самый распространённый подход — использовать одно *базовое* разрешение и затем подгонять его под всё остальное. Именно в таком разрешении большинство игроков, как ожидается, будут играть (с учётом их оборудования). Для мобильных устройств Google предлагает полезную статистику <https://developer.android.com/about/dashboards>`_, а для настольных компьютеров — Steam <https://store.steampowered.com/hwsurvey/>`_.
ta: ஒற்றை * அடிப்படை * தீர்மானத்தைப் பயன்படுத்துவதும், பின்னர் எல்லாவற்றிற்கும் பொருந்துவதும் மிகவும் பொதுவான அணுகுமுறை. இந்த தீர்மானம் பெரும்பாலான வீரர்கள் விளையாட்டை எவ்வாறு விளையாடுவார்கள் என்று எதிர்பார்க்கப்படுகிறது (அவர்களின் வன்பொருள் கொடுக்கப்பட்டுள்ளது). மொபைலுக்கு, கூகிள் பயனுள்ள `புள்ளிவிவரங்கள் <https://developer.android.com/about/dashboards>` _ நிகழ்நிலை, மற்றும் டெச்க்டாப்பைப் பொறுத்தவரை, நீராவி `மேலும் <https://store.steampowered.com/hwsurvey/>` _.
uk: Найпоширеніший підхід полягає у використанні однієї *базової* роздільної здатності, а потім підгонці її до всього іншого. Ця роздільна здатність – це те, як очікується, що більшість гравців гратимуть у гру (враховуючи їхнє обладнання). Для мобільних пристроїв Google має корисну `статистику <https://developer.android.com/about/dashboards>`_ онлайн, а для комп’ютерів Steam `також робить <https://store.steampowered.com/hwsurvey/>`_.
zh_cn: 最常见的方法是使用一个单一的 *基础* 分辨率, 然后将其适用于其他所有情况. 这个分辨率是大多数玩家预期的玩游戏的方式, 鉴于他们的硬件. 对于移动设备, 谷歌在网上有有用的 `统计资料 <https://developer.android.com/about/dashboards>`__ , 对于桌面设备,Steam `也有 <https://store.steampowered.com/hwsurvey/>`__ .
zh_tw: 最常見的做法是先設定一個 *基準* 解析度，之後再讓其他解析度自動適配。這個基準解析度通常是多數玩家在其硬體上遊玩遊戲時的常見設定。針對行動裝置，Google 提供了 `統計資料 <https://developer.android.com/about/dashboards>`_，而桌面平台則可參考 Steam 的 `硬體調查 <https://store.steampowered.com/hwsurvey/>`_。

source: As an example, Steam shows that the most common *primary display resolution* is 1920×1080, so a sensible approach is to develop a game for this resolution, then handle scaling for different sizes and aspect ratios.
ga: Mar shampla, taispeánann Steam gurb é 1920×1080 an réiteach taispeána bunscoile *is coitianta, mar sin is cur chuige ciallmhar é cluiche a fhorbairt don rún seo, ansin scálú a láimhseáil le haghaidh méideanna éagsúla agus cóimheasa gné.
it: Ad esempio, Steam mostra che la *risoluzione del display primario* più comune è 1920×1080, quindi un approccio sensato è quello di sviluppare un gioco per questa risoluzione, quindi gestire la scala per diverse dimensioni e proporzioni.
ru: Например, Steam показывает, что наиболее распространенное *основное разрешение дисплея* — 1920×1080, поэтому разумным подходом будет разработать игру для этого разрешения, а затем выполнить масштабирование для различных размеров и соотношений сторон.
ta: உதாரணமாக, நீராவி மிகவும் பொதுவான * முதன்மை காட்சி தெளிவுத்திறன் * 1920 × 1080 என்று காட்டுகிறது, எனவே இந்த தெளிவுத்திறனுக்கான ஒரு விளையாட்டை உருவாக்குவதே விவேகமான அணுகுமுறை, பின்னர் வெவ்வேறு அளவுகள் மற்றும் அம்ச விகிதங்களுக்கான அளவைக் கையாள வேண்டும்.
uk: Як приклад, Steam показує, що найпоширенішою *основною роздільною здатністю дисплея* є 1920×1080, тому розумним підходом є розробка гри для цієї роздільної здатності, а потім масштабування для різних розмірів і пропорцій.
zh_cn: 举个例子,Steam显示最常见的 *主要显示分辨率是* 1920×1080, 所以明智的做法是为这个分辨率开发一个游戏, 然后期处理不同尺寸和长宽比的缩放.
zh_tw: 舉例來說，Steam 顯示最常見的 *主要顯示解析度* 為 1920×1080，因此明智的做法是以這個解析度開發遊戲，然後再針對不同尺寸與長寬比進行縮放處理。

source: Godot provides several useful tools to do this easily.
ga: Soláthraíonn Godot roinnt uirlisí úsáideacha chun é seo a dhéanamh go héasca.
it: Godot fornisce diversi strumenti utili per farlo facilmente.
ru: Godot предоставляет несколько полезных инструментов, чтобы сделать это легко.
ta: இதை எளிதில் செய்ய கோடோட் பல பயனுள்ள கருவிகளை வழங்குகிறது.
uk: Godot надає кілька корисних інструментів, щоб легко це зробити.
zh_cn: Godot 还提供了一系列通用的容器.
zh_tw: Godot 提供多種實用工具來簡化這項工作。

source: You can see how Godot's support for multiple resolutions works in action using the `Multiple Resolutions and Aspect Ratios demo project <https://github.com/godotengine/godot-demo-projects/tree/master/gui/multiple_resolutions>`__.
ga: Is féidir leat a fheiceáil conas a oibríonn tacaíocht Godot d’ilrún i ngníomh ag baint úsáide as an tionscadal taispeána `Multiple Resolutions and Aspect Resolutions <https://github.com/godotenginine/godot-demo-projects/tree/master/gui/multiple_resolutions>`__.
it: È possibile osservare in azione il funzionamento del supporto di Godot per più risoluzioni attraverso il progetto dimostrativo `Risoluzioni multiple e rapporti d'aspetto <https://github.com/godotengine/godot-demo-projects/tree/master/gui/multiple_resolutions>`__.
ru: Вы можете увидеть, как работает поддержка нескольких разрешений в Godot, используя демонстрационный проект `Множественные разрешения и соотношения сторон <https://github.com/godotengine/godot-demo-projects/tree/master/gui/multiple_resolutions>`__.
ta: `பல தீர்மானங்கள் மற்றும் அம்ச விகிதங்கள் டெமோ திட்டத்தைப் பயன்படுத்தி பல தீர்மானங்களுக்கான கோடோட்டின் உதவி எவ்வாறு செயல்படுகிறது என்பதை நீங்கள் பார்க்கலாம்
uk: Ви можете побачити, як працює підтримка Godot для кількох роздільних здатностей, за допомогою демонстраційного проекту «Кілька роздільних здатностей і співвідношення сторін» <https://github.com/godotengine/godot-demo-projects/tree/master/gui/multiple_resolutions>`__.
zh_cn: 你可以使用\ `多分辨率和纵横比演示项目 <https://github.com/godotengine/godot-demo-projects/tree/master/gui/multiple_resolutions>`__\ ，来了解 Godot 对多分辨率的支持如何实际工作。
zh_tw: 你可以參考 `Multiple Resolutions and Aspect Ratios 範例專案 <https://github.com/godotengine/godot-demo-projects/tree/master/gui/multiple_resolutions>`__，實際體驗 Godot 多解析度支援的運作方式。

source: Base size
ga: Bunmhéid
it: Dimensioni di base
pt_br: Tamanho base
ru: Базовый размер
ta: அடிப்படை அளவு
uk: Базовий розмір
zh_cn: 基本大小
zh_tw: 基礎尺寸

source: A base size for the window can be specified in the Project Settings under **Display → Window**.
ga: Is féidir bunmhéid na fuinneoige a shonrú sna Socruithe Tionscadail faoi **Taispeáin → bhFuinneog **.
it: È possibile specificare delle dimensioni base per la finestra nelle Impostazioni del progetto in **Display → Window**.
ru: Базовый размер окна можно указать в настройках проекта в разделе **Display → Window**.
ta: ** காட்சி → சாளரம் ** இன் கீழ் திட்ட அமைப்புகளில் சாளரத்திற்கான அடிப்படை அளவை குறிப்பிடலாம்.
uk: Базовий розмір вікна можна вказати в параметрах проекту в **Дисплей → Вікно**.
zh_cn: 窗口的基本尺寸可以在项目设置中的 **Display → Window** 下指定.
zh_tw: 你可以在專案設定的 **Display → Window** 項目下指定視窗的基礎尺寸。

source: However, what it does is not completely obvious; the engine will *not* attempt to switch the monitor to this resolution. Rather, think of this setting as the "design size", i.e. the size of the area that you work with in the editor. This setting corresponds directly to the size of the blue rectangle in the 2D editor.
ga: Mar sin féin, níl an méid a dhéanann sé go hiomlán soiléir; déanfaidh an t-inneall *not *iarracht an monatóir a athrú go dtí an rún seo. Ina ionad sin, smaoinigh ar an suíomh seo mar "mhéid an dearaidh", i.e. méid an cheantair a n-oibríonn tú leis san eagarthóir. Freagraíonn an socrú seo go díreach do mhéid an dronuilleog ghorm san eagarthóir 2D.
it: Tuttavia, quello che fa non è del tutto ovvio: il motore *non* tenterà di impostare il monitor su questa risoluzione. Piuttosto, considera queste impostazioni come le "dimensioni di progettazione", ovvero le dimensioni dell'area su cui lavorare nell'editor. Queste impostazioni corrispondono direttamente alle dimensioni del rettangolo blu nell'editor 2D.
ru: Однако суть этого действия не совсем очевидна: движок *не* будет пытаться переключить монитор на это разрешение. Скорее, представьте эту настройку как "размер дизайна", то есть размер области, с которой вы работаете в редакторе. Эта настройка напрямую соответствует размеру синего прямоугольника в 2D-редакторе.
ta: இருப்பினும், அது என்ன செய்வது என்பது முற்றிலும் வெளிப்படையானது அல்ல; இந்த தீர்மானத்திற்கு மானிட்டரை மாற்ற இயந்திரம் * அல்ல * முயற்சிக்கவில்லை. மாறாக, இந்த அமைப்பை "வடிவமைப்பு அளவு" என்று நினைத்துப் பாருங்கள், அதாவது நீங்கள் எடிட்டரில் பணிபுரியும் பகுதியின் அளவு. இந்த அமைப்பு 2 டி எடிட்டரில் உள்ள நீல செவ்வகத்தின் அளவிற்கு நேரடியாக ஒத்திருக்கிறது.
uk: Однак те, що він робить, не зовсім очевидно; двигун *не* намагатиметься перемкнути монітор на цю роздільну здатність. Радше сприймайте це налаштування як «розмір дизайну», тобто розмір області, з якою ви працюєте в редакторі. Цей параметр безпосередньо відповідає розміру синього прямокутника у 2D-редакторі.
zh_cn: 然而, 它的作用并不完全明显; 引擎将 *不* 尝试将显示器切换到此分辨率. 相反, 将此设置视为 "设计大小", 即你在编辑器中使用的区域的大小. 此设置直接对应于2D编辑器中蓝色矩形的大小.
zh_tw: 但這項設定的作用並非將螢幕解析度切換為此數值。你可以把這個數值視為「設計尺寸」，也就是你在編輯器中工作的區域大小。這個設定對應 2D 編輯器中藍色矩形的尺寸。

source: There is often a need to support devices with screen and window sizes that are different from this base size. Godot offers many ways to control how the viewport will be resized and stretched to different screen sizes.
ga: Is minic gur gá tacú le gléasanna le méideanna scáileáin agus fuinneoige atá difriúil ón mbunmhéid seo. Godot Cuireann go leor bealaí chun rialú a dhéanamh ar conas a bheidh an viewport a athrú agus a shíneadh chuig méideanna scáileán éagsúla.
it: Spesso c'è bisogno di supportare dispositivi con dimensioni dello schermo e della finestra diverse da queste dimensioni base. Godot offre molti modi per controllare come la finestra sarà ridimensionata e adattata alle diverse dimensioni dello schermo.
ru: Часто возникает необходимость в поддержке устройств с размерами экрана и окна, отличными от базового. Godot предлагает множество способов управления изменением размера и растягиванием области просмотра под разные размеры экрана.
ta: இந்த அடிப்படை அளவிலிருந்து வேறுபட்ட திரை மற்றும் சாளர அளவுகளுடன் சாதனங்களை ஆதரிக்க வேண்டிய தேவை உள்ளது. காட்சியகம் எவ்வாறு மறுஅளவாக்கப்பட்டு வெவ்வேறு திரை அளவுகளுக்கு நீட்டிக்கப்படும் என்பதைக் கட்டுப்படுத்த கோடோட் பல வழிகளை வழங்குகிறது.
uk: Часто виникає потреба підтримувати пристрої з розмірами екрана та вікна, які відрізняються від базового розміру. Godot пропонує багато способів керування тим, як вікно перегляду буде змінено та розтягнуто на різні розміри екрана.
zh_cn: 通常需要支持具有与该基本大小不同的屏幕和窗口大小的设备. Godot提供了许多方法来控制视口的大小调整和拉伸到不同的屏幕大小.
zh_tw: 你經常需要支援螢幕或視窗尺寸與基礎尺寸不同的裝置。Godot 提供多種方法，讓你可以控制視口（viewport）如何縮放或拉伸以適應不同的螢幕尺寸。

source: On this page, *window* refers to the screen area allotted to your game by the system, while *viewport* refers to the root object (accessible from ``get_tree().root``) which the game controls to fill this screen area. This viewport is a :ref:`Window <class_Window>` instance. Recall from the :ref:`introduction <doc_viewports>` that *all* Window objects are viewports.
ga: Ar an leathanach seo, tagraíonn *fuinneog* don limistéar scáileáin atá tugtha le do chluiche ag an gcóras, agus tagraíonn *viewport* don bhunréad (atá inrochtana ó ``get_tree().root``) a rialaíonn an cluiche chun an scáileán seo a líonadh cheantar. Is sampla :ref:`Fuinneog <class_Window>` é an t-amharc seo. Athghairm ón :ref:`réamhrá <doc_viewports>` gur portanna amharc iad *gach* réad Fuinneog.
it: In questa pagina, *finestra* (window) si riferisce all'area dello schermo assegnata al gioco dal sistema, mentre *viewport* si riferisce all'oggetto radice (accessibile da ``get_tree().root``) che il gioco controlla per riempire quest'area dello schermo. Questa viewport è un'istanza di :ref:`Window <class_Window>`. Ricorda dall' :ref:`introduzione <doc_viewports>` che *tutti* gli oggetti Window sono viewport.
ru: На этой странице *window* относится к области экрана, выделенной вашей игре системой, а *viewport* — к корневому объекту (доступному через ``get_tree().root``), которым игра управляет для заполнения этой области экрана. Эта область просмотра представляет собой экземпляр :ref:`Window <class_Window>`. Как следует из введения :ref:`introduction <doc_viewports>`, *все* объекты Window являются областями просмотра.
ta: இந்த பக்கத்தில், * சாளரம் * என்பது கணினியால் உங்கள் விளையாட்டுக்கு ஒதுக்கப்பட்ட திரை பகுதியைக் குறிக்கிறது, அதே நேரத்தில் * ViewPort * ரூட் பொருளைக் குறிக்கிறது (`` get_tree (). ரூட்`` இலிருந்து அணுகலாம்) இந்த திரையை நிரப்ப விளையாட்டு கட்டுப்படுத்துகிறது பகுதி. இந்த காட்சியகம் ஒரு: ref: `சாளரம் <class_window>` சான்று. : Ref: `அறிமுகம் <doc_viewports>` அந்த * அனைத்து * சாளரப் பொருள்களும் காட்சியகங்கள்.
uk: На цій сторінці *window* стосується області екрана, виділеної системою для вашої гри, тоді як *viewport* стосується кореневого об’єкта (доступного з ``get_tree().root``), яким гра керує, щоб заповнити цей екран область. Це вікно перегляду є екземпляром :ref:`Window <class_Window>`. Згадайте з :ref:`introduction <doc_viewports>`, що *всі* об’єкти Window є вікнами перегляду.
zh_cn: 在该页面上，\ *窗口*\ 指的是系统分配给你的游戏的屏幕区域，而\ *视口*\ 指的是游戏控制以填充该屏幕区域的根对象（可从 ``get_tree().root`` 访问）。该视口是一个 :ref:`Window <class_Window>` 实例。回想一下《\ :ref:`前言 <doc_viewports>`\ 》，\ *所有* Window 对象都是视口。
zh_tw: 在本頁中，*window* 指的是系統分配給遊戲的螢幕區域，而 *viewport* 指的是遊戲控制以填滿螢幕區域的根物件（可透過 ``get_tree().root`` 存取）。這個 viewport 實際上是一個 :ref:`Window <class_Window>` 實例。請回憶 :ref:`介紹 <doc_viewports>` 章節中提到，*所有* Window 物件本質上都是 viewports。
