Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: ga, it, pt_br, ru, ta, uk, zh_cn, zh_tw

source: For example, if your viewport base size is 640×360 and the window size is 1366×768:
ga: Mar shampla, má tá do mhéid bonn viewport 640×360 agus is é méid na fuinneoige 1366×768:
it: Ad esempio, se le dimensioni base della viewport sono 640×360 e le dimensioni della finestra sono 1366×768:
ru: Например, если базовый размер области просмотра составляет 640×360, а размер окна — 1366×768:
ta: எடுத்துக்காட்டாக, உங்கள் வியூபோர்ட் அடிப்படை அளவு 640 × 360 ஆகவும், சாளர அளவு 1366 × 768 ஆகவும் இருந்தால்:
uk: Наприклад, якщо базовий розмір вікна перегляду становить 640×360, а розмір вікна – 1366×768:
zh_cn: 打个比方，如果视口的基础大小为 640×360 而窗口大小为 1366×768：
zh_tw: 舉例來說，若你的視口基礎尺寸為 640×360，視窗尺寸為 1366×768：

source: When using ``fractional``, the viewport is displayed at a resolution of 1366×768 (scale factor is roughly 2.133×). The entire window space is used. Each pixel in the viewport corresponds to 2.133×2.133 pixels in the displayed area. However, since displays can only display "whole" pixels, this will lead to uneven pixel scaling which results in incorrect appearance of pixel art.
ga: Nuair a úsáidtear ''codánach'', taispeántar an radharc ag rún 1366×768 (is é an fachtóir scála thart ar 2.133×). Úsáidtear spás iomlán na fuinneoige. Freagraíonn gach picteilín sa viewport do 2.133×2.133 picteilín sa limistéar ar taispeáint. Mar sin féin, ós rud é nach féidir le taispeántais ach picteilíní "iomlána" a thaispeáint, beidh scálú picteilín míchothrom mar thoradh air seo a mbeidh cuma mhícheart ar ealaín picteilín mar thoradh air.
it: Utilizzando ``fractional``, la viewport è visualizzata a una risoluzione di 1366×768 (il fattore di scala è di circa 2,133×). È utilizzato l'intero spazio della finestra. Ogni pixel nella finestra corrisponde a 2,133×2,133 pixel nell'area visualizzata. Tuttavia, poiché i display possono visualizzare solo pixel "interi", ciò comporterà una scalatura non uniforme dei pixel, il che non fa apparire correttamente la pixel art.
ru: При использовании ``дробного`` разрешения область просмотра отображается с разрешением 1366×768 (масштабный коэффициент примерно равен 2,133×). Используется всё пространство окна. Каждый пиксель области просмотра соответствует 2,133×2,133 пикселя в отображаемой области. Однако, поскольку дисплеи могут отображать только «целые» пиксели, это приведёт к неравномерному масштабированию пикселей, что, в свою очередь, приведёт к некорректному отображению пиксельной графики.
ta: `` பகுதியளவு`` ஐப் பயன்படுத்தும் போது, காட்சியகம் 1366 × 768 தீர்மானத்தில் காட்டப்படும் (அளவிலான காரணி சுமார் 2.133 ×). முழு சாளர இடமும் பயன்படுத்தப்படுகிறது. வியூபோர்ட்டில் உள்ள ஒவ்வொரு பிக்சலும் காட்டப்படும் பகுதியில் 2.133 × 2.133 பிக்சல்களுக்கு ஒத்திருக்கும். இருப்பினும், காட்சிகள் "முழு" பிக்சல்களை மட்டுமே காண்பிக்க முடியும் என்பதால், இது சீரற்ற படப்புள்ளி அளவிடுதலுக்கு வழிவகுக்கும், இதன் விளைவாக படப்புள்ளி கலையின் தவறான தோற்றம் ஏற்படுகிறது.
uk: Якщо використовується ``fractional``, вікно перегляду відображається з роздільною здатністю 1366×768 (масштабний коефіцієнт становить приблизно 2,133×). Використовується весь віконний простір. Кожен піксель у вікні перегляду відповідає 2,133 × 2,133 пікселям у відображеній області. Однак, оскільки дисплеї можуть відображати лише «цілі» пікселі, це призведе до нерівномірного масштабування пікселів, що призведе до неправильного вигляду піксельного зображення.
zh_cn: 使用 ``fractional`` 时，视口会以 1366×768 的分辨率显示（缩放系数大约是 2.133×），占用整个屏幕空间。视口中的每个像素都对应 2.133×2.133 像素的显示区域。不过因为显示器只能显示“完整”的像素，就会导致不均匀的像素缩放，造成像素画的显示异常。
zh_tw: 使用 ``fractional`` 時，視口會以 1366×768 解析度顯示（縮放約為 2.133×），整個視窗空間都會被利用。每個視口像素對應約 2.133×2.133 螢幕像素。但由於螢幕僅能顯示「整數」像素，這會導致縮放不均勻，進而讓像素美術顯示失真。

source: When using ``integer``, the viewport is displayed at a resolution of 1280×720 (scale factor is 2×). The remaining space is filled with black bars on all four sides, so that each pixel in the viewport corresponds to 2×2 pixels in the displayed area.
ga: Agus ''slánuimhir' á úsáid, taispeántar an t-amharcphort ag rún 1280×720 (is é 2× an fachtóir scála). Líontar an spás atá fágtha le barraí dubha ar gach ceithre thaobh, ionas go gcomhfhreagraíonn gach picteilín sa radharc le 2×2 picteilín sa limistéar a thaispeántar.
it: Utilizzando ``integer``, la finestra è visualizzata a una risoluzione di 1280×720 (il fattore di scala è 2×). Lo spazio rimanente è riempito con barre nere su tutti e quattro i lati, in modo che ogni pixel nella viewport corrisponda a 2×2 pixel nell'area visualizzata.
ru: При использовании ``integer`` область просмотра отображается с разрешением 1280×720 (масштабный коэффициент — 2×). Остальное пространство заполняется чёрными полосами со всех четырёх сторон, так что каждый пиксель области просмотра соответствует 2×2 пикселям отображаемой области.
ta: `` முழு எண்`` ஐப் பயன்படுத்தும் போது, வியூபோர்ட் 1280 × 720 தீர்மானத்தில் காட்டப்படும் (அளவிலான காரணி 2 ×). மீதமுள்ள இடம் நான்கு பக்கங்களிலும் கருப்பு கம்பிகளால் நிரப்பப்படுகிறது, இதனால் காட்சியமைப்பில் உள்ள ஒவ்வொரு பிக்சலும் காட்டப்படும் பகுதியில் 2 × 2 பிக்சல்களுக்கு ஒத்திருக்கும்.
uk: При використанні ``integer`` вікно перегляду відображається з роздільною здатністю 1280×720 (масштабний коефіцієнт 2×). Простір, що залишився, заповнюється чорними смугами з усіх чотирьох сторін, так що кожен піксель у вікні перегляду відповідає 2×2 пікселям у відображеній області.
zh_cn: 使用 ``integer`` 时，视口会以 1280×720 的分辨率显示（缩放系数为 2×）。四周的剩余空间使用黑条填充，这样视口中的每个像素都对应 2×2 像素的显示区域。
zh_tw: 使用 ``integer`` 時，視口以 1280×720 解析度顯示（縮放為 2×），剩餘區域會自動以黑邊填滿。此時每個視口像素都對應 2×2 螢幕像素。

source: This setting is effective with any stretch mode. However, when using the ``disabled`` stretch mode, it will only affect the **Stretch Scale** setting by rounding it *down* to the nearest integer value. This can be used for 3D games that have a pixel art UI, so that the visible area in the 3D viewport doesn't reduce in size (which occurs when using ``canvas_items`` or ``viewport`` stretch mode with the ``integer`` scale mode).
ga: Tá an socrú seo éifeachtach le haon mhodh stráice. Mar sin féin, nuair a bheidh an modh stráice ''díchumasaithe'' á úsáid, ní dhéanfaidh sé difear ach don socrú **Stretch Scale **trína shlánú *síos *go dtí an luach slánuimhir is gaire. Is féidir é seo a úsáid le haghaidh cluichí 3D a bhfuil UI ealaíne picteilín acu, ionas nach laghdaíonn an limistéar infheicthe sa viewport 3D i méid (a tharlaíonn nuair a úsáidtear mód stráice ''canvas_items'' nó ''viewport'' leis an mód scála ''slánuimhir'').
it: Questa impostazione è efficace con qualsiasi modalità di stiramento. Tuttavia, quando si utilizza la modalità di stiramento ``disabled``, influirà solo sull'impostazione **Scala di stiramento**, arrotondandola *per difetto* al valore intero più vicino. Questa impostazione si può utilizzare per i giochi 3D con un'interfaccia utente in pixel art, così che l'area visibile nella viewport 3D non si riduca di dimensioni (cosa che accade utilizzando la modalità di stiramento ``canvas_items`` o ``viewport`` con la modalità di scala ``integer``).
ru: Этот параметр действует при любом режиме растяжения. Однако при использовании режима растяжения ``disabled`` он влияет только на параметр **Stretch Scale**, округляя его *в меньшую сторону* до ближайшего целого значения. Это можно использовать в 3D-играх с пиксельной графикой, чтобы видимая область в 3D-окне просмотра не уменьшалась в размере (что происходит при использовании режима растяжения ``canvas_items`` или ``viewport`` с режимом масштабирования ``integer``).
ta: இந்த அமைப்பு எந்த நீட்டிக்க பயன்முறையிலும் பயனுள்ளதாக இருக்கும். இருப்பினும், `` முடக்கப்பட்ட`` நீட்டிக்க பயன்முறையைப் பயன்படுத்தும் போது, இது ** நீட்டிப்பு அளவிலான ** அமைப்பை*கீழே*கீழே*அருகிலுள்ள முழு மதிப்புக்குச் செல்வதன் மூலம் மட்டுமே பாதிக்கும். படப்புள்ளி கலை இடைமுகம் ஐக் கொண்ட 3D கேம்களுக்குப் பயன்படுத்தப்படலாம், இதனால் 3D வியாபோர்ட்டில் காணக்கூடிய பகுதி அளவைக் குறைக்காது (`` `Canvas_items`` அல்லது` `ViewPort`` நீட்டிக்க பயன்முறையைப் பயன்படுத்தும் போது இது நிகழ்கிறது `முழு எண்` அளவிலான பயன்முறை).
uk: Цей параметр ефективний у будь-якому режимі розтягування. Однак, якщо використовується ``вимкнений`` режим розтягування, це вплине лише на параметр **Шкала розтягування**, округливши його *вниз* до найближчого цілого значення. Це можна використовувати для 3D-ігор, які мають піксельний інтерфейс користувача, щоб видима область у вікні тривимірного перегляду не зменшувалась у розмірі (що трапляється під час використання ``canvas_items`` або режиму розтягування ``viewport`` з ` `цілочисельний`` масштабний режим).
zh_cn: 这个设置在所有拉伸模式下均会生效。不过使用 ``disabled`` 拉伸模式时只会影响\ **拉伸缩放**\ 设置，将其\ **向下**\ 取整。可用于使用像素风 UI 的 3D 游戏，此时 3D 视口的可见区域并不会减少（而在 ``canvas_items`` 和 ``viewport`` 拉伸模式下启用 ``integer`` 缩放模式时就会减少）。
zh_tw: 此設定適用於任何拉伸模式。不過，若拉伸模式為 ``disabled``，它只會對 **Stretch Scale** 設定進行向下取整數。這對 3D 遊戲但 UI 採像素美術時很有用，能避免 3D 視口可見區域因縮放而縮小（這問題常發生於 ``canvas_items`` 或 ``viewport`` 拉伸模式配合 ``integer`` 縮放模式時）。

source: Games should use the **Exclusive Fullscreen** window mode, as opposed to **Fullscreen** which is designed to prevent Windows from automatically treating the window as if it was exclusive fullscreen.
ga: Ba chóir go n-úsáidfeadh cluichí an mód fuinneoige **Eisiach Lánscáileáin**, seachas **Fullscreen** atá deartha chun cosc a chur ar Windows an fhuinneog a chóireáil go huathoibríoch amhail is dá mba lánscáileán eisiach é.
it: I giochi dovrebbero utilizzare la modalità di finestra **Schermo intero esclusivo**, anziché **Schermo intero**, che è progettata per impedire a Windows di trattare automaticamente la finestra come se fosse a schermo intero esclusivo.
ru: Игры должны использовать режим окна **Exclusive Fullscreen**, а не **Fullscreen**, который предназначен для того, чтобы Окно не могло автоматически обрабатывать окно как эксклюзивный полноэкранный режим.
ta: ** பிரத்யேக முழுத்திரை ** சாளர பயன்முறையைப் பயன்படுத்த வேண்டும், இது ** முழுத்திரை ** க்கு மாறாக, சாளரத்தை தானாகவே பிரத்தியேக முழுமையைப் போல சிகிச்சையளிப்பதைத் தடுக்க வடிவமைக்கப்பட்டுள்ளது.
uk: Ігри мають використовувати віконний режим **Ексклюзивний повноекранний режим**, на відміну від **Повноекранного режиму**, який призначений для того, щоб запобігти автоматичній обробці вікна Windows так, ніби воно було ексклюзивним повноекранним.
zh_cn: 游戏应该使用\ **独占全屏**\ 窗口模式，而不是\ **全屏**\ ，后者旨在防止 Windows 自动将窗口视为独占全屏。
zh_tw: 遊戲建議使用 **Exclusive Fullscreen**（獨佔全螢幕）視窗模式，而非 **Fullscreen**，因為後者設計目的是避免 Windows 將視窗誤判為獨佔全螢幕。

source: **Fullscreen** is meant to be used by GUI applications that want to use per-pixel transparency without a risk of having it disabled by the OS. It achieves this by leaving a 1-pixel line at the bottom of the screen. By contrast, **Exclusive Fullscreen** uses the actual screen size and allows Windows to reduce jitter and input lag for fullscreen games.
ga: **Tá sé i gceist go n-úsáidfidh feidhmchláir GUI * ar mian leo trédhearcacht in aghaidh an phicteilín a úsáid gan baol go mbeadh sé díchumasaithe ag an OS. Baineann sé é seo amach trí líne 1 picteilín a fhágáil ag bun an scáileáin. I gcodarsnacht leis sin, úsáideann **Fullscreen eisiach ** méid iarbhír an scáileáin agus ligeann sé do Windows jitter agus lag ionchuir a laghdú le haghaidh cluichí lánscáileáin.
ru: Режим **Fullscreen** предназначен для графических приложений, которым требуется попиксельная прозрачность без риска её отключения операционной системой. Это достигается за счёт однопиксельной линии внизу экрана. В отличие от этого, режим **Exclusive Fullscreen** использует фактический размер экрана и позволяет Windows уменьшить дрожание и задержку ввода в полноэкранных играх.
ta: . திரையின் அடிப்பகுதியில் 1 படப்புள்ளி கோட்டை விட்டுவிட்டு இதை அடைகிறது. இதற்கு நேர்மாறாக, ** பிரத்தியேக முழுத்திரை ** உண்மையான திரை அளவைப் பயன்படுத்துகிறது மற்றும் முழு திரை விளையாட்டுகளுக்கான சாளரங்கள் மற்றும் உள்ளீட்டு பின்னடைவைக் குறைக்க சாளரங்கள் அனுமதிக்கிறது.
uk: **Повноекранний режим** призначений для використання програмами з графічним інтерфейсом користувача, які хочуть використовувати попіксельну прозорість без ризику, що її вимкне ОС. Він досягає цього, залишаючи лінію в 1 піксель внизу екрана. Навпаки, **Ексклюзивний повний екран** використовує фактичний розмір екрана та дозволяє Windows зменшити тремтіння та затримку введення для повноекранних ігор.
zh_cn: **全屏**\ 旨在供想要使用每像素透明度而又不存在被操作系统禁用的风险的 GUI 应用程序使用。它通过在屏幕底部留下一条 1 像素的线来实现这一点。相比之下，\ **独占全屏**\ 使用实际屏幕大小，并允许 Windows 减少全屏游戏的抖动和输入延迟。
zh_tw: **Fullscreen** 主要用於需要每像素透明度且不希望被作業系統關閉這功能的 GUI 應用程式。它會在螢幕底部保留 1 像素的線條。而 **Exclusive Fullscreen** 則會真正以螢幕實際尺寸運作，讓 Windows 能降低全螢幕遊戲的抖動與輸入延遲。

source: When using integer scaling, this is particularly important as the 1-pixel height reduction from the **Fullscreen** mode can cause integer scaling to use a smaller scale factor than expected.
ga: Agus scálú slánuimhir á úsáid, tá sé seo thar a bheith tábhachtach mar is féidir leis an laghdú airde 1-picteilín ón mód **Fullscreen ** a bheith ina chúis le scálú slánuimhir chun fachtóir scála níos lú a úsáid ná mar a bhíothas ag súil leis.
it: Quando si utilizza il ridimensionamento intero, questo è particolarmente importante poiché la riduzione dell'altezza di 1 pixel dalla modalità **Schermo intero** può far sì che il ridimensionamento intero utilizzi un fattore di scala inferiore al previsto.
ru: При использовании целочисленного масштабирования это особенно важно, поскольку уменьшение высоты на 1 пиксель в **Fullscreen** режиме может привести к тому, что при целочисленном масштабировании будет использоваться меньший масштабный коэффициент, чем ожидалось.
ta: முழு எண் அளவிடலைப் பயன்படுத்தும் போது, இது மிகவும் முக்கியமானது, ஏனெனில் ** முழுத்திரை ** பயன்முறையிலிருந்து 1-பிக்சல் உயரக் குறைப்பு முழு அளவிலான அளவிடுதல் எதிர்பார்த்ததை விட சிறிய அளவிலான காரணியைப் பயன்படுத்தக்கூடும்.
uk: У разі використання цілочисельного масштабування це особливо важливо, оскільки зменшення висоти на 1 піксель у **повноекранному режимі** може призвести до того, що цілочисельне масштабування використовує менший масштабний коефіцієнт, ніж очікувалося.
zh_cn: 当使用整数缩放时，这一点尤为重要，因为\ **全屏**\ 模式下 1 像素的高度减少可能导致整数缩放使用比预期更小的比例系数。
zh_tw: 對於整數縮放來說，這尤其重要，因為 **Fullscreen** 模式會讓畫面高度少 1 像素，導致整數縮放時縮放倍率較預期還小。

source: Common use case scenarios
ga: Cásanna cásanna úsáide coitianta
it: Scenari di utilizzo comuni
ru: Распространенные сценарии использования
ta: பொதுவான பயன்பாட்டு வழக்கு காட்சிகள்
uk: Загальні сценарії використання
zh_cn: 常见使用场景
zh_tw: 常見應用場景

source: The following settings are recommended to support multiple resolutions and aspect ratios well.
ga: Moltar na socruithe seo a leanas chun tacú le rúin éagsúla agus cóimheasa gné go maith.
it: Le seguenti impostazioni sono consigliate per supportare bene più risoluzioni e rapporti di aspetto.
pt_br: As configurações a seguir são recomendadas para suportar diferentes resoluções e aspect ratio's.
ru: Для хорошей поддержки различных разрешений и соотношений сторон рекомендуется использовать следующие настройки.
ta: பல தீர்மானங்கள் மற்றும் அம்ச விகிதங்களை நன்கு ஆதரிக்க பின்வரும் அமைப்புகள் பரிந்துரைக்கப்படுகின்றன.
uk: Наступні налаштування рекомендуються для гарної підтримки декількох роздільних здатностей і пропорцій.
zh_cn: 如果要适配多种分辨率和纵横比，推荐使用以下设置。
zh_tw: 建議使用下列設定以妥善支援多重解析度與長寬比。

source: Desktop game
ga: Cluiche deisce
it: Gioco per desktop
pt_br: Jogo para desktop
ru: Игра для десктопа
ta: டெச்க்டாப் விளையாட்டு
uk: Настільна гра
zh_cn: 桌面游戏
zh_tw: 桌面遊戲

source: **Non-pixel art:**
ga: **Ealaín neamhphicteilín:**
ru: **Не пиксельная рисовка:**
ta: ** படப்புள்ளி அல்லாத கலை: **
uk: **Не піксельне мистецтво:**
zh_cn: **非像素风：**
zh_tw: **非像素美術：**

source: Set the base window width to ``1920`` and window height to ``1080``. If you have a display smaller than 1920×1080, set **Window Width Override** and **Window Height Override** to lower values to make the window smaller when the project starts.
ga: Socraigh leithead na bunfhuinneoige go ''1920'' agus airde na fuinneoige go ''1080''. Má tá taispeáint níos lú ná 1920×1080 agat, socraigh ** Sárú Leithead na Fuinneoige ** agus ** Sáraíocht Airde Fuinneoige ** chun luachanna a ísliú chun an fhuinneog a dhéanamh níos lú nuair a thosaíonn an tionscadal.
it: Imposta la larghezza base della finestra su ``1920`` e la sua altezza su ``1080``. Se hai uno schermo più piccolo di 1920×1080, imposta **Sovrascrivi larghezza della finestra** e **Sovrascrivi altezza della finestra** su valori più bassi per ridurre le dimensioni della finestra all'avvio del progetto.
ru: Установите базовую ширину окна на ``1920`` и высоту окна на ``1080``. Если разрешение вашего дисплея меньше 1920×1080, уменьшите значения параметров **Window Width Override** и **Window Height Override**, чтобы уменьшить размер окна при запуске проекта.
ta: அடிப்படை சாளர அகலத்தை `` 1920`` மற்றும் சாளர உயரத்திற்கு `` 1080`` ஆக அமைக்கவும். உங்களிடம் 1920 × 1080 ஐ விட சிறிய காட்சி இருந்தால், ** சாளர அகலம் மேலெழுதலை அமைக்கவும் ** மற்றும் ** சாளர உயரம் ** ** ஐ குறைந்த மதிப்புகளாகத் தொடங்கும் போது சாளரத்தை சிறியதாக மாற்றவும்.
uk: Встановіть базову ширину вікна на ``1920`` і висоту вікна на ``1080``. якщо у вас дисплей менший за 1920 × 1080, встановіть **Заміна ширини вікна** та **Заміна висоти вікна** на нижчі значення, щоб зробити вікно меншим під час запуску проекту.
zh_cn: 将基础窗口宽度设置为 ``1920``\ 、窗口高度设置为 ``1080``\ 。如果你的显示器小于 1920×1080，请将\ **窗口宽度覆盖**\ 和\ **窗口高度覆盖**\ 设置为较小的值，项目启动时就会将窗口调小。
zh_tw: 建議將基礎視窗寬度設為 ``1920``、高度設為 ``1080``。如果你的顯示器比 1920×1080 小，可以將 **Window Width Override** 和 **Window Height Override** 設為較小的數值，讓專案啟動時視窗自動縮小。

source: Alternatively, if you're targeting high-end devices primarily, set the base window width to ``3840`` and window height to ``2160``. This allows you to provide higher resolution 2D assets, resulting in crisper visuals at the cost of higher memory usage and file sizes. Note that this will make non-mipmapped textures grainy on low resolution devices, so make sure to follow the instructions described in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
ga: De rogha air sin, má tá tú ag díriú ar ghléasanna ardleibhéil go príomha, socraigh leithead na bunfhuinneoige go ''3840'' agus airde na fuinneoige go ''2160''. Ligeann sé seo duit sócmhainní 2D réitigh níos airde a sholáthar, rud a fhágann go bhfuil amhairc crisper ar chostas úsáide cuimhne níos airde agus méideanna comhaid. Tabhair faoi deara go ndéanfaidh sé seo uigeachtaí neamh-mipmapped gráin ar ghléasanna ísealtaifigh, mar sin déan cinnte go leanann tú na treoracha a thuairiscítear in :ref:'doc_multiple_resolutions_reducing_aliasing_on_downsampling'.
ru: Если вы ориентируетесь в первую очередь на высокопроизводительные устройства, установите базовую ширину окна на ``3840``, а высоту — на ``2160``. Это позволит вам использовать 2D-ресурсы с более высоким разрешением, что обеспечит более чёткую графику за счёт увеличения потребления памяти и размера файлов. Обратите внимание, что это сделает текстуры без MIP-текстурирования зернистыми на устройствах с низким разрешением, поэтому обязательно следуйте инструкциям, описанным в документе :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
ta: மாற்றாக, நீங்கள் முதன்மையாக உயர்நிலை சாதனங்களை குறிவைக்கிறீர்கள் என்றால், அடிப்படை சாளர அகலத்தை `` 3840`` மற்றும் சாளர உயரத்தை `` 2160`` ஆக அமைக்கவும். இது அதிக தெளிவுத்திறன் கொண்ட 2 டி சொத்துக்களை வழங்க உங்களை அனுமதிக்கிறது, இதன் விளைவாக அதிக நினைவக பயன்பாடு மற்றும் கோப்பு அளவுகளின் செலவில் மிருதுவான காட்சிகள் ஏற்படுகின்றன. இது குறைந்த தெளிவுத்திறன் கொண்ட சாதனங்களில் mipmaped அல்லாத அமைப்புகளை தானியமாக்கும் என்பதை நினைவில் கொள்க, எனவே விவரிக்கப்பட்டுள்ள வழிமுறைகளைப் பின்பற்றுவதை உறுதிசெய்க: குறிப்பு: `doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
uk: Крім того, якщо ви націлюєтеся переважно на пристрої високого класу, встановіть базову ширину вікна на ``3840`` і висоту вікна на ``2160``. Це дає змогу надавати 2D-ресурси з вищою роздільною здатністю, що забезпечує чіткіші візуальні ефекти за рахунок більшого використання пам’яті та розмірів файлів. Зауважте, що це призведе до того, що на пристроях із низькою роздільною здатністю текстури без MIP-відображення стануть зернистими, тому дотримуйтесь інструкцій, описаних у :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
zh_cn: 或者如果你主要针对的是高端设备，那么就把基础窗口宽度设置为 ``3840``\ 、窗口高度设置为 ``2160``\ 。这样你就可以提供更高分辨率的 2D 资产，用更高的内存占用和文件大小换取更清晰的画面。注意，这样做会让未做 mipmap 的纹理在低分辨率设备上具有颗粒感，请参考 :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling` 进行操作。
zh_tw: 若你的目標族群以高階裝置為主，也可以將基礎視窗寬度設為 ``3840``，高度設為 ``2160``。這樣你就能提供更高解析度的 2D 素材，畫面會更細緻，但會增加記憶體用量與檔案大小。請注意，這會讓未開啟 mipmap 的貼圖在低解析度裝置上產生顆粒感，建議參考 :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling` 說明。

source: Set the stretch mode to ``canvas_items``.
ga: Socraigh an modh sínte go ''canvas_items''.
it: Imposta la modalità di stiramento su ``canvas_items``.
ru: Установите режим растяжения на ``canvas_items``.
ta: நீட்டிக்க பயன்முறையை `` கேன்வாச்_இடெம்கள்`` க்கு அமைக்கவும்.
uk: Встановіть режим розтягування на ``canvas_items``.
zh_cn: 将拉伸模式设置为 ``canvas_items``\ （画布项）。
zh_tw: 將拉伸模式（Stretch Mode）設定為 ``canvas_items`` （2D 元素）。

source: Set the stretch aspect to ``expand``. This allows for supporting multiple aspect ratios and makes better use of tall smartphone displays (such as 18:9 or 19:9 aspect ratios).
ga: Socraigh an ghné stráice go ''leathnú''. Ligeann sé seo tacú le cóimheasa gné il agus déanann sé úsáid níos fearr a bhaint as taispeántais fón cliste ard (mar shampla cóimheasa gné 18: 9 nó 19: 9).
it: Imposta l'aspetto di stiramento su ``expand``. Questo consente di supportare più rapporti d'aspetto e sfrutta al meglio i display alti degli smartphone (ad esempio, rapporti d'aspetto 18:9 o 19:9).
ru: Установите аспект растяжения на ``expand``. Это обеспечивает поддержку различных соотношений сторон и позволяет эффективнее использовать вытянутые экраны смартфонов (например, с соотношением сторон 18:9 или 19:9).
ta: நீட்டிக்க அம்சத்தை `` விரிவாக்கு`` க்கு அமைக்கவும். இது பல அம்ச விகிதங்களை ஆதரிக்க அனுமதிக்கிறது மற்றும் உயரமான ச்மார்ட்போன் காட்சிகளை (18: 9 அல்லது 19: 9 அம்ச விகிதங்கள் போன்றவை) சிறப்பாகப் பயன்படுத்துகிறது.
uk: Встановіть розтягнутий аспект на ``expand``. Це дозволяє підтримувати кілька форматів і краще використовувати високі дисплеї смартфонів (наприклад, 18:9 або 19:9).
zh_cn: 将拉伸比例设置为 ``expand`` （扩展）。这样可以支持多种分辨率，并且能够更好地利用较长的智能手机屏幕（例如 18:9 和 19:9 的长宽比）。
zh_tw: 將拉伸比例設為 ``expand`` （擴充），可同時支援多種長寬比，也能善用高比例的手機螢幕（如 18:9、19:9）。

source: Configure Control nodes' anchors to snap to the correct corners using the **Layout** menu.
ga: Cumraigh ancairí nóid rialaithe chun léim chuig na coirnéil chearta ag baint úsáide as an roghchlár **Layout**.
it: Configurare le ancore dei nodi di controllo affinché si aggancino agli angoli corretti attraverso il menu **Layout**.
ru: Настройте Control узлов управления для привязки к правильным углам с помощью меню **Layout**.
ta: ** தளவமைப்பு ** மெனுவைப் பயன்படுத்தி சரியான மூலைகளுக்கு ஒடுக்க கட்டுப்பாட்டு முனைகளின் நங்கூரங்களை உள்ளமைக்கவும்.
uk: Налаштуйте прив’язки контрольних вузлів до правильних кутів за допомогою меню **Макет**.
zh_cn: 使用\ **布局**\ 菜单将 Control 节点的锚点吸附到正确的角落。
zh_tw: 使用 **佈局** 選單將 Control 節點的錨點設定到正確的角落。

source: **Pixel art:**
ga: **Ealaín picteilíní:**
ru: **Пиксельная рисовка:**
ta: ** படப்புள்ளி கலை: **
uk: **Піксельне мистецтво:**
zh_cn: **像素风：**
zh_tw: **像素美術：**
