Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: ga, it, pt_br, ru, ta, uk, zh_cn, zh_tw

source: Set **Display > Window > Handheld > Orientation** to ``portrait``.
ga: Socraigh **Taispeáin > Fuinneog > Ríomhaire Boise > Treoshuíomh** chuig ``portrait``.
it: Imposta **Display > Finestra > Portatile > Orientamento** su ``portrait``.
ru: Установите **Display > Window > Handheld > Orientation** на ``portrait``.
ta: ** காட்சி> சாளரம்> கையடக்க> நோக்குநிலை ** `` உருவப்படம்`.
uk: Установіть **Дисплей > Вікно > Ручний > Орієнтація** на ``портрет``.
zh_cn: 将\ **显示 > 窗口 > 手持 > 朝向**\ 设置为 ``portrait``\ （竖屏）。
zh_tw: 將 **Display > Window > Handheld > Orientation** 設定為 ``portrait`` （直向）。

source: To better support tablets and foldable phones (which frequently feature displays with aspect ratios close to 4:3), consider using a base resolution that has a 3:4 aspect ratio while following the rest of the instructions here. For instance, you can set the base window width to ``960`` and the base window height to ``1280``.
ga: Chun tacaíocht níos fearr a thabhairt do tháibléid agus d'fhóin foldable (a bhíonn le feiceáil go minic le cóimheasa gné gar do 4: 3), smaoinigh ar réiteach bonn a úsáid a bhfuil cóimheas gné 3: 4 aige agus an chuid eile de na treoracha á leanúint anseo. Mar shampla, is féidir leat leithead na bunfhuinneoige a shocrú go ''960'' agus airde na bunfhuinneoige go ''1280''.
it: Per supportare al meglio tablet e telefoni pieghevoli (che spesso presentano display con proporzioni vicine al 4:3), si consiglia di utilizzare una risoluzione base con proporzioni 4:3, seguendo le istruzioni restanti riportate qui. Ad esempio, è possibile impostare la larghezza base della finestra su ``960`` e l'altezza base della finestra su ``960``.
ru: Для лучшей поддержки планшетов и складных телефонов (которые часто оснащены дисплеями с соотношением сторон, близким к 4:3), рассмотрите возможность использования базового разрешения с соотношением сторон 3:4, следуя остальным инструкциям. Например, можно установить ширину базового окна ``960``, а высоту — ``1280``.
ta: டேப்லெட்டுகள் மற்றும் மடிக்கக்கூடிய தொலைபேசிகளை சிறப்பாக ஆதரிக்க (இது 4: 3 க்கு அருகில் உள்ள விகிதங்களுடன் அடிக்கடி காட்சிகளைக் கொண்டுள்ளது), இங்கே மீதமுள்ள வழிமுறைகளைப் பின்பற்றும் போது 3: 4 விகித விகிதத்தைக் கொண்ட அடிப்படை தீர்மானத்தைப் பயன்படுத்துவதைக் கவனியுங்கள். உதாரணமாக, நீங்கள் அடிப்படை சாளர அகலத்தை `` 960`` ஆகவும், அடிப்படை சாளர உயரத்தை `` 1280`` ஆகவும் அமைக்கலாம்.
uk: Щоб краще підтримувати планшети та складні телефони (які часто мають дисплеї зі співвідношенням сторін, близьким до 4:3), розгляньте можливість використання базової роздільної здатності зі співвідношенням сторін 3:4, дотримуючись решти наведених тут інструкцій. Наприклад, ви можете встановити ширину базового вікна на ``960``, а висоту базового вікна на ``1280``.
zh_cn: 为了更好地支持平板和折叠屏手机（这些设备的显示器纵横比通常接近 4:3），请在按照其他步骤操作时考虑使用纵横比为 3:4 的基础分辨率。例如可以将基础窗口宽度设置为 ``960``\ 、基础窗口高度设置为 ``1280``\ 。
zh_tw: 若要更好支援平板電腦與摺疊機（這類裝置常見 4:3 長寬比），可考慮使用 3:4 為基礎解析度，並參照本章剩餘建議。例如，可將基礎視窗寬度設為 ``960``，高度設為 ``1280``。

source: Non-game application
ga: Feidhmchlár neamhchluiche
it: Applicazione non di gioco
pt_br: Aplicação não-jogo
ru: Неигровое приложение
ta: விளையாட்டு அல்லாத பயன்பாடு
uk: Неігровий додаток
zh_cn: 非游戏应用
zh_tw: 非遊戲應用

source: Set the base window width and height to the smallest window size that you intend to target. This is not required, but this ensures that you design your UI with small window sizes in mind.
ga: Socraigh leithead agus airde na fuinneoige bonn go dtí an méid fuinneoige is lú a bhfuil sé ar intinn agat díriú air. Níl sé seo ag teastáil, ach cinntíonn sé seo go ndéanann tú do Chomhéadain a dhearadh le méideanna beaga fuinneoige san áireamh.
it: Imposta la larghezza e l'altezza base della finestra sulle dimensioni minima che intendi raggiungere. Non è obbligatorio, ma ti assicura di progettare l'interfaccia utente tenendo conto delle dimensioni ridotte della finestra.
ru: Установите базовую ширину и высоту окна равными наименьшему предполагаемому размеру окна. Это не обязательно, но гарантирует, что вы спроектируете свой пользовательский интерфейс с учётом небольших размеров окон.
ta: அடிப்படை சாளர அகலம் மற்றும் உயரத்தை நீங்கள் குறிவைக்க விரும்பும் மிகச்சிறிய சாளர அளவிற்கு அமைக்கவும். இது தேவையில்லை, ஆனால் இது உங்கள் இடைமுகம் ஐ சிறிய சாளர அளவுகளை மனதில் கொண்டு வடிவமைப்பதை உறுதி செய்கிறது.
uk: Встановіть ширину та висоту базового вікна на найменший розмір вікна, на який ви маєте намір націлитися. Це не обов’язково, але це гарантує, що ви розробите свій інтерфейс користувача з урахуванням невеликих розмірів вікон.
zh_cn: 将基础窗口宽高设置为你想要支持的最小窗口尺寸。这不是必须的，但是可以保证你在设计 UI 时考虑较小的窗口尺寸。
zh_tw: 將基礎視窗寬高設為你想支援的最小視窗尺寸。這不是強制規定，但可確保你設計 UI 時會考慮小型視窗。

source: Keep the stretch mode to its default value, ``disabled``.
ga: Coinnigh an modh stráice go dtí a luach réamhshocraithe, ''díchumasaithe''.
it: Mantieni la modalità di stiramento al suo valore predefinito, ``disabled``.
ru: Оставьте режим растяжения на значении по умолчанию: ``disabled``.
ta: நீட்டிப்பு பயன்முறையை அதன் இயல்புநிலை மதிப்புக்கு வைத்திருங்கள், `` முடக்கப்பட்டது``.
uk: Зберігайте значення режиму розтягування за замовчуванням, ``вимкнено``.
zh_cn: 保持拉伸模式为默认值 ``disabled``\ （禁用）。
zh_tw: 保持拉伸模式為預設值 ``disabled`` （停用）。

source: Keep the stretch aspect to its default value, ``ignore`` (its value won't be used since the stretch mode is ``disabled``).
ga: Coinnigh an ghné stráice ar a luach réamhshocraithe, ''neamhaird'' (ní úsáidfear a luach ós rud é go bhfuil an modh stráice ''díchumasaithe'').
it: Mantieni l'aspetto di stiramento al suo valore predefinito, ``ignore`` (il suo valore non sarà utilizzato poiché la modalità di stiramento è ``disabled``).
ru: Оставьте для аспекта растяжения значение по умолчанию — ``ignore`` (его значение не будет использоваться, поскольку режим растяжения ``disabled``).
ta: நீட்டிக்க அம்சத்தை அதன் இயல்புநிலை மதிப்புக்கு வைத்திருங்கள், `` புறக்கணிக்கவும்`` (நீட்டிப்பு முறை `` முடக்கப்பட்டது`` என்பதால் அதன் மதிப்பு பயன்படுத்தப்படாது).
uk: Зберігайте для аспекту розтягування значення за замовчуванням, ``ignore`` (його значення не використовуватиметься, оскільки режим розтягування ``вимкнено``).
zh_cn: 保持拉伸比例为默认值 ``ignore``\ （因为拉伸模式是 ``disabled``\ ，所以这里的值不会被用到）。
zh_tw: 拉伸比例保持預設 ``ignore``（忽略）（因拉伸模式為 ``disabled``，此設定不會生效）。

source: You can define a minimum window size by calling ``get_window().set_min_size()`` in a script's ``_ready()`` function. This prevents the user from resizing the application below a certain size, which could break the UI layout.
ga: Is féidir íosmhéid fuinneoige a shainiú trí ghlaoch ar ''get_window().set_min_size()'' i bhfeidhm ''_ready()'' scripte. Cuireann sé seo cosc ar an úsáideoir an feidhmchlár a athrú faoi mhéid áirithe, rud a d'fhéadfadh leagan amach an Chomhéadain a bhriseadh.
it: È possibile definire una dimensione minima della finestra chiamando ``get_window().set_min_size()`` nella funzione ``_ready()`` di uno script. Ciò impedisce all'utente di ridimensionare l'applicazione al di sotto di una certa dimensione, il che potrebbe compromettere il layout dell'interfaccia utente.
ru: Вы можете определить минимальный размер окна, вызвав ``get_window().set_min_size()`` в функции ``_ready()`` скрипта. Это предотвращает изменение пользователем размера окна приложения ниже определённого значения, что может нарушить структуру пользовательского интерфейса.
ta: `` Get_window (). Set_min_size () `` ஒரு ச்கிரிப்டின் `` _ready () `` செயல்பாட்டில் அழைப்பதன் மூலம் குறைந்தபட்ச சாளர அளவை நீங்கள் வரையறுக்கலாம். இது ஒரு குறிப்பிட்ட அளவிற்குக் கீழே பயன்பாட்டை மறுஅளவிடுவதைத் தடுக்கிறது, இது இடைமுகம் தளவமைப்பை உடைக்கக்கூடும்.
uk: Ви можете визначити мінімальний розмір вікна, викликавши ``get_window().set_min_size()`` у функції ``_ready()`` сценарію. Це не дозволяє користувачеві змінювати розмір програми нижче певного розміру, що може порушити макет інтерфейсу користувача.
zh_cn: 你可以通过在脚本的 ``_ready()`` 函数中调用 ``get_window().set_min_size()`` 来定义最小窗口大小。这可以防止用户将应用程序调整到低于某个大小，否则可能会破坏 UI 布局。
zh_tw: 你可以在腳本的 ``_ready()`` 函式中呼叫 ``get_window().set_min_size()`` 來設定視窗最小尺寸。這樣使用者就無法將應用程式視窗縮得過小，避免破壞 UI 版面。

source: Godot doesn't support manually overriding the 2D scale factor yet, so it is not possible to have hiDPI support in non-game applications. Due to this, it is recommended to leave **Allow Hidpi** disabled in non-game applications to allow for the OS to use its low-DPI fallback.
ga: Ní thacaíonn Godot leis an bhfachtóir scála 2D a shárú de láimh go fóill, mar sin ní féidir tacaíocht hiDPI a bheith aige in iarratais neamh-chluiche. Mar gheall air seo, moltar ** Ceadaigh Hidpi ** a fhágáil faoi mhíchumas in iarratais neamh-chluiche chun ligean don OS a fallback íseal-DPI a úsáid.
ru: Godot пока не поддерживает ручное изменение коэффициента масштабирования в 2D, поэтому поддержка hiDPI в неигровых приложениях невозможна. В связи с этим рекомендуется отключать параметр **Allow Hidpi** в неигровых приложениях, чтобы ОС могла использовать резервный режим с низким DPI.
ta: கோடோட் இன்னும் 2 டி அளவிலான காரணியை கைமுறையாக மீறுவதை ஆதரிக்கவில்லை, எனவே விளையாட்டு அல்லாத பயன்பாடுகளில் HIDPI ஆதரவைப் பெற முடியாது. இதன் காரணமாக, OS அதன் குறைந்த-டிபிஐ குறைவைப் பயன்படுத்த அனுமதிக்க, விளையாட்டு அல்லாத பயன்பாடுகளில் முடக்கப்பட்ட இடிபிஐ ** ஐ அனுமதிக்க பரிந்துரைக்கப்படுகிறது.
uk: Godot ще не підтримує ручне перевизначення 2D масштабного коефіцієнта, тому неможлива підтримка hiDPI в неігрових програмах. У зв’язку з цим рекомендується залишити **Дозволити Hidpi** вимкненим у неігрових програмах, щоб дозволити ОС використовувати резервний варіант із низькою роздільною здатністю.
zh_cn: Godot 尚未支持手动设置 2D 缩放比例，所以无法在非游戏应用中支持 hiDPI。因此，推荐为非游戏应用禁用 **Allow Hidpi** 选项，操作系统会回退到低 DPI。
zh_tw: Godot 目前尚未支援手動設定 2D 縮放比例，因此無法在非遊戲應用中支援 hiDPI。建議在非遊戲應用中關閉 **Allow Hidpi**，讓作業系統自動退回低 DPI 模式。

source: hiDPI support
ga: Tacaíocht hiDPI
it: Supporto per hiDPI
pt_br: Suporte a hiDPI
ru: Поддержка дисплеев высокой плотности(DPI)
ta: HIDPI உதவி
uk: підтримка hiDPI
zh_cn: 支持 hiDPI 高分辨率屏幕
zh_tw: hiDPI 支援

source: By default, Godot projects are considered DPI-aware by the operating system. This is controlled by the **Display > Window > Dpi > Allow Hidpi** project setting, which should be left enabled whenever possible. Disabling DPI awareness can break fullscreen behavior on Windows.
ga: De réir réamhshocraithe, meastar go bhfuil tionscadail Godot feasach ar PSO ag an gcóras oibriúcháin. Tá sé seo á rialú ag an socrú tionscadail **Taispeáin > Fuinneog > Dpi > Ceadaigh Hidpi**, ar cheart é a fhágáil cumasaithe nuair is féidir. Is féidir iompar lánscáileáin ar Windows a bhriseadh má dhíchumasaítear feasacht PSO.
ru: По умолчанию операционная система считает, что проекты Godot поддерживают разрешение DPI. Это регулируется параметром проекта **Display > Window > Dpi > Allow Hidpi**, который следует по возможности оставлять включённым. Отключение поддержки разрешения DPI может привести к сбоям в работе полноэкранного режима в Windows.
ta: இயல்பாக, கோடோட் திட்டங்கள் இயக்க முறைமையால் டிபிஐ-விழிப்புணர்வாகக் கருதப்படுகின்றன. இது ** காட்சி> சாளரம்> டிபிஐ> இடிபிஐ ** திட்ட அமைப்பை அனுமதிக்கவும், இது முடிந்தவரை இயக்கப்பட வேண்டும். டிபிஐ விழிப்புணர்வை முடக்குவது சாளரங்களில் முழுத்திரை நடத்தையை உடைக்கும்.
uk: За умовчанням операційна система вважає проекти Godot з підтримкою DPI. Це контролюється параметром проекту **Дисплей > Вікно > Dpi > Дозволити Hidpi**, який слід залишати ввімкненим, коли це можливо. Вимкнення поінформованості про DPI може порушити повноекранний режим у Windows.
zh_cn: 默认情况下，操作系统会将 Godot 项目视为 DPI 感知项目。这由\ **显示 > 窗口 > DPI > 允许 HiDPI**\ 项目设置控制，该设置应尽可能保持启用状态。禁用 DPI 感知可能会破坏在 Windows 上的全屏行为。
zh_tw: 預設情況下，Godot 專案會被作業系統視為具 DPI 感知能力。這由 **Display > Window > Dpi > Allow Hidpi** 專案設定控制，建議在可能的情況下保持啟用。若關閉 DPI 感知，可能會導致 Windows 上的全螢幕行為異常。

source: Since Godot projects are DPI-aware, they may appear at a very small window size when launching on an hiDPI display (proportionally to the screen resolution). For a game, the most common way to work around this issue is to make them fullscreen by default. Alternatively, you could set the window size in an :ref:`autoload <doc_singletons_autoload>`'s ``_ready()`` function according to the screen size.
ga: Ós rud é go bhfuil tionscadail Godot feasach ar PSO, féadfaidh siad a bheith le feiceáil ar mhéid fuinneoige an-bheag agus iad ag seoladh ar thaispeántas hiDPI (i gcomhréir le taifeach an scáileáin). Maidir le cluiche, is é an bealach is coitianta chun oibriú ar an gceist seo ná iad a dhéanamh lánscáileán de réir réamhshocraithe. Nó, d'fhéadfá méid na fuinneoige a shocrú i bhfeidhm :ref:`uathlódáil <doc_singletons_autoload>`'s `` _ready()`` de réir mhéid an scáileáin.
ru: Поскольку проекты Godot поддерживают DPI, при запуске на hiDPI-дисплеях они могут отображаться в очень маленьком окне (пропорционально разрешению экрана). Для игр наиболее распространённый способ обойти эту проблему — сделать их полноэкранными по умолчанию. В качестве альтернативы можно задать размер окна в функции ``_ready()`` класса :ref:`autoload <doc_singletons_autoload>` в соответствии с размером экрана.
ta: கோடோட் திட்டங்கள் டிபிஐ-விழிப்புணர்வு என்பதால், அவை இடிபிஐ காட்சியில் தொடங்கும்போது மிகச் சிறிய சாளர அளவில் தோன்றக்கூடும் (திரை தெளிவுத்திறனுக்கு விகிதாசாரமாக). ஒரு விளையாட்டைப் பொறுத்தவரை, இந்த சிக்கலைச் சுற்றி பணியாற்றுவதற்கான பொதுவான வழி, இயல்புநிலையாக அவற்றை முழுமையாக்குவதாகும். மாற்றாக, நீங்கள் சாளர அளவை ஒரு: ref: `autoload <doc_singletons_autoload>` 's `` _ready () `` திரை அளவிற்கு ஏற்ப செயல்பாடு.
uk: Оскільки проекти Godot підтримують DPI, вони можуть відображатися в дуже маленькому розмірі вікна під час запуску на дисплеї hiDPI (пропорційно роздільній здатності екрана). для a найпоширенішим способом вирішення цієї проблеми є зробити їх повноекранними за замовчуванням. Крім того, ви можете встановити розмір вікна в :ref:`autoload <doc_singletons_autoload>`'s ``_ready()`` функції відповідно до розміру екрана.
zh_cn: 由于 Godot 项目具有 DPI 感知能力，因此在 hiDPI 显示器上启动时，它们可能会以非常小的窗口大小显示（与屏幕分辨率成比例）。对于游戏，解决该问题的最常见方法是默认将它们设置为全屏。或者，你可以根据屏幕大小在\ :ref:`自动加载 <doc_singletons_autoload>`\ 的 ``_ready()`` 函数中设置窗口大小。
zh_tw: 由於 Godot 專案具備 DPI 感知能力，在 hiDPI 顯示器上啟動時，視窗可能會非常小（比例取決於螢幕解析度）。對於遊戲來說，最常見的解法是預設全螢幕。你也可以在 :ref:`autoload <doc_singletons_autoload>` 的 ``_ready()`` 函式中根據螢幕尺寸調整視窗大小。

source: To ensure 2D elements don't appear too small on hiDPI displays:
ga: Chun a chinntiú nach bhfuil eilimintí 2D le feiceáil ró-bheag ar thaispeántais hiDPI:
ru: Чтобы 2D-элементы не выглядели слишком маленькими на дисплеях hiDPI:
ta: HIDPI காட்சிகளில் 2D கூறுகள் மிகச் சிறியதாகத் தெரியவில்லை என்பதை உறுதிப்படுத்த:
uk: Щоб 2D-елементи не виглядали надто маленькими на дисплеях HiDPI:
zh_cn: 为了确保 2D 元素在 hiDPI 显示屏上不会显得太小：
zh_tw: 若要避免 hiDPI 顯示器上 2D 元素太小：

source: For games, use the ``canvas_items`` or ``viewport`` stretch modes so that 2D elements are automatically resized according to the current window size.
ga: I gcás cluichí, bain úsáid as na modhanna stráice ''canvas_items'' nó ''viewport'' ionas go n-athrófar eilimintí 2D go huathoibríoch de réir mhéid na fuinneoige reatha.
ru: Для игр используйте режимы растяжения ``canvas_items`` или ``viewport``, чтобы 2D-элементы автоматически изменяли размер в соответствии с текущим размером окна.
ta: விளையாட்டுகளுக்கு, `` கேன்வாச்_இடெம்கள்`` அல்லது `` வியாபோர்ட்`` நீட்டிக்க முறைகளைப் பயன்படுத்தவும், இதனால் தற்போதைய சாளர அளவிற்கு ஏற்ப 2 டி கூறுகள் தானாகவே மாற்றியமைக்கப்படுகின்றன.
uk: Для ігор використовуйте режими розтягування ``canvas_items`` або ``viewport``, щоб розмір 2D-елементів автоматично змінювався відповідно до розміру поточного вікна.
zh_cn: 对于游戏，使用 ``canvas_items`` 或 ``viewport`` 拉伸模式，以便 2D 元素根据当前窗口大小自动调整大小。
zh_tw: 對於遊戲，請使用 ``canvas_items`` 或 ``viewport`` 拉伸模式，讓 2D 元素自動根據目前視窗大小縮放。

source: For non-game applications, use the ``disabled`` stretch mode and set the stretch scale to a value corresponding to the display scale factor in an :ref:`autoload <doc_singletons_autoload>`'s ``_ready()`` function. The display scale factor is set in the operating system's settings and can be queried using :ref:`screen_get_scale<class_DisplayServer_method_screen_get_scale>`. This method is currently only implemented on macOS. On other operating systems, you will need to implement a method to guess the display scale factor based on the screen resolution (with a setting to let the user override this if needed). This is the approach currently used by the Godot editor.
ga: Le haghaidh feidhmchláir nach feidhmchláir iad, úsáid an modh stráice `` míchumasaithe`` agus socraigh an scála stráice chuig luach a fhreagraíonn don fhachtóir scála taispeána i bhfeidhm :ref:`uathlódáil <doc_singletons_autoload>`'s `` _ready()`` . Socraítear an fachtóir scála taispeána i socruithe an chórais oibriúcháin agus is féidir é a cheistiú trí úsáid a bhaint as :ref:`screen_get_scale<class_DisplayServer_method_screen_get_scale>`. Níl an modh seo curtha i bhfeidhm ach ar macOS faoi láthair. Ar chórais oibriúcháin eile, beidh ort modh a chur i bhfeidhm chun fachtóir scála an taispeántais a thomhas bunaithe ar thaifeach an scáileáin (le socrú chun ligean don úsáideoir é seo a shárú más gá). Seo é an cur chuige atá in úsáid ag an eagarthóir Godot faoi láthair.
ru: Для неигровых приложений используйте режим растяжения ``disabled`` и задайте масштаб растяжения равным значению, соответствующему масштабному коэффициенту отображения, в функции ``_ready()`` класса :ref:`autoload <doc_singletons_autoload>`. Масштабный коэффициент отображения задаётся в настройках операционной системы и может быть получен с помощью метода :ref:`screen_get_scale<class_DisplayServer_method_screen_get_scale>`. В настоящее время этот метод реализован только в macOS. В других операционных системах потребуется реализовать метод, который будет определять масштабный коэффициент отображения на основе разрешения экрана (с настройкой, позволяющей пользователю при необходимости переопределять этот коэффициент). Именно такой подход в настоящее время используется в редакторе Godot.
ta: விளையாட்டு அல்லாத பயன்பாடுகளுக்கு, `` முடக்கப்பட்ட`` நீட்டிக்க பயன்முறையைப் பயன்படுத்தவும், காட்சி அளவிலான காரணிக்கு ஒத்த மதிப்புக்கு நீட்டிக்க அளவை அமைக்கவும்: Ref: `Autoload <doc_singletons_autoload>` s `` _ _ `` செயல்பாடு . காட்சி அளவிலான காரணி இயக்க முறைமையின் அமைப்புகளில் அமைக்கப்பட்டுள்ளது மற்றும் பயன்படுத்தி வினவலாம்: குறிப்பு: `ச்கிரீன்_செட்_ச்கேல் <class_displayserver_method_creen_get_scale>`. இந்த முறை தற்போது MACOS இல் மட்டுமே செயல்படுத்தப்படுகிறது. பிற இயக்க முறைமைகளில், திரை தெளிவுத்திறனின் அடிப்படையில் காட்சி அளவிலான காரணியை யூகிக்க ஒரு முறையை நீங்கள் செயல்படுத்த வேண்டும் (தேவைப்பட்டால் பயனரை மீற அனுமதிக்கும் அமைப்பைக் கொண்டு). இது தற்போது கோடோட் எடிட்டர் பயன்படுத்தும் அணுகுமுறை.
uk: Для неігрових програм використовуйте режим розтягування «вимкнено» та встановіть масштаб розтягування на значення, яке відповідає коефіцієнту масштабування відображення у функції ``_ready()`` :ref:`autoload <doc_singletons_autoload>`. Коефіцієнт масштабування дисплея встановлюється в налаштуваннях операційної системи, і його можна запитати за допомогою :ref:`screen_get_scale<class_DisplayServer_method_screen_get_scale>`. Наразі цей метод реалізований лише в macOS. В інших операційних системах вам потрібно буде реалізувати метод вгадування масштабного коефіцієнта відображення на основі роздільної здатності екрана (з налаштуванням, яке дозволяє користувачеві змінити це, якщо потрібно). Саме такий підхід зараз використовує редактор Godot.
zh_cn: 对于非游戏应用程序，请使用 ``disabled`` 拉伸模式，并在 :ref:`autoload <doc_singletons_autoload>` 的 ``_ready()`` 函数中将拉伸比例设置为与显示比例系数相对应的值。显示比例系数在操作系统的设置中设置，可以使用 :ref:`screen_get_scale<class_DisplayServer_method_screen_get_scale>` 进行查询。该方法目前仅在 macOS 上实现。在其他操作系统上，你需要实现一种方法来根据屏幕分辨率猜测显示比例系数（使用设置让用户在需要时覆盖该设置）。这是 Godot 编辑器当前使用的方法。
zh_tw: 對於非遊戲應用，請使用 ``disabled`` 拉伸模式，並在 :ref:`autoload <doc_singletons_autoload>` 的 ``_ready()`` 函式中設定縮放比例，使其對應顯示器縮放因子。顯示縮放因子可在作業系統設定中查詢，或透過 :ref:`screen_get_scale<class_DisplayServer_method_screen_get_scale>` 方法取得（目前僅 macOS 實作）。其他作業系統需自行實作判斷縮放因子的邏輯，或提供設定讓使用者手動調整。Godot 編輯器目前即採用此策略。

source: The **Allow Hidpi** setting is only effective on Windows and macOS. It's ignored on all other platforms.
ga: Níl an socrú **Allow Hidpi** éifeachtach ach ar Windows agus macOS. Déantar neamhaird de ar gach ardán eile.
ru: Параметр **Allow Hidpi** действует только в Windows и macOS. На всех остальных платформах он игнорируется.
ta: ** இசைவு HIDPI ** அமைப்பு சாளரங்கள் மற்றும் மேகோசில் மட்டுமே பயனுள்ளதாக இருக்கும். இது மற்ற எல்லா தளங்களிலும் புறக்கணிக்கப்படுகிறது.
uk: Налаштування **Дозволити Hidpi** діє лише в Windows і macOS. Він ігнорується на всіх інших платформах.
zh_cn: **允许 HiDPI** 设置仅在 Windows 和 macOS 上有效。所有其他平台都会忽略该设置。
zh_tw: **Allow Hidpi** 設定僅於 Windows 與 macOS 有效，其他平台會忽略此設定。

source: The Godot editor itself is always marked as DPI-aware. Running the project from the editor will only be DPI-aware if **Allow Hidpi** is enabled in the Project Settings.
ga: Tá an t-eagarthóir Godot féin marcáilte i gcónaí mar DPI-eolas. Ní bheidh an tionscadal á reáchtáil ón eagarthóir ar an eolas ach amháin má tá **Allow Hidpi** cumasaithe i Socruithe an Tionscadail.
ru: Сам редактор Godot всегда отмечен как поддерживающий DPI. Запуск проекта из редактора будет поддерживать DPI только в том случае, если в настройках проекта включен параметр **Allow Hidpi**.
ta: கோடோட் எடிட்டர் எப்போதும் டிபிஐ-விழிப்புணர்வு என குறிக்கப்பட்டுள்ளது. திட்ட அமைப்புகளில் ** அனுமதிக்க இடிபிஐ ** இயக்கப்பட்டால் மட்டுமே ஆசிரியரிடமிருந்து திட்டத்தை இயக்குவது டிபிஐ-விழிப்புணர்வாக இருக்கும்.
uk: Сам редактор Godot завжди позначений як DPI-aware. Запуск проекту з редактора буде з урахуванням DPI, лише якщо **Дозволити Hidpi** увімкнено в налаштуваннях проекту.
zh_cn: Godot 编辑器本身是打开了这个选项，与 DPI 相关的。但在编辑器中运行项目时，只有在项目设置里启用 **Allow Hidpi** 才会让项目与 DPI 相关。
zh_tw: Godot 編輯器本身一律標記為具備 DPI 感知能力。從編輯器中執行專案時，只有啟用 **Allow Hidpi** 時才會具備 DPI 感知。

source: Reducing aliasing on downsampling
ga: Ailiasáil a laghdú maidir le downsampling
ru: Уменьшение алиасинга при понижении частоты дискретизации (downsampling)
ta: குறைப்பதில் மாற்றுப்பெயரைக் குறைத்தல்
uk: Зменшення псевдонімів при зниженні дискретизації
zh_cn: 减少缩减取样的混叠
zh_tw: 降低縮小取樣時的鋸齒

source: If the game has a very high base resolution (e.g. 3840×2160), aliasing might appear when downsampling to something considerably lower like 1280×720.
ga: Má tá buntaifeach an-ard ag an gcluiche (m.sh. 3840×2160), d'fhéadfadh ailiasáil a bheith le feiceáil nuair a bhíonn rud éigin i bhfad níos ísle cosúil le 1280×720.
ru: Если в игре очень высокое базовое разрешение (например, 3840×2160), то при понижении разрешения до чего-то значительно более низкого, например, 1280×720, может проявиться алиасинг.
ta: விளையாட்டில் மிக உயர்ந்த அடிப்படை தெளிவுத்திறன் இருந்தால் (எ.கா. 3840 × 2160), 1280 × 720 போன்ற கணிசமாகக் குறைவான ஒன்றைக் குறைக்கும் போது மாற்றுப்பெயர்ச்சி தோன்றக்கூடும்.
uk: Якщо гра має дуже високу базову роздільну здатність (наприклад, 3840 × 2160), псевдонім може з’явитися під час зменшення роздільної здатності до чогось значно нижчого, наприклад 1280 × 720.
zh_cn: 如果游戏的基本分辨率很高（如 3840×2160），当采样降到相当低的分辨率（如 1280×720）时，可能会出现锯齿。
zh_tw: 若遊戲採用非常高的基礎解析度（如 3840×2160），將畫面縮小到較低解析度（如 1280×720）時，可能會產生鋸齒。
