Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: ga, it, pt_br, ru, ta, uk, zh_cn, zh_tw

source: **Stretch Mode = Viewport**: Viewport scaling means that the size of the root :ref:`Viewport <class_Viewport>` is set precisely to the base size specified in the Project Settings' **Display** section. The scene is rendered to this viewport first. Finally, this viewport is scaled to fit the screen (taking the **Stretch Aspect** setting into account).
ga: **Mód Sín = Amharcport**: Ciallaíonn scálú Viewport go bhfuil méid na fréimhe : ref:`Viewport <class_Viewport>` socraithe go beacht don bhunmhéid atá sonraithe i rannán Socruithe an Tionscadail' **Taispeáin**. Tugtar an radharc don radharc seo ar dtús. Ar deireadh, tá an radharc seo de réir scála chun an scáileán a oiriúnú (agus an socrú **Stretch Aspect** á chur san áireamh).
it: **Modalità di stiramento = Viewport**: il ridimensionamento della viewport significa che le dimensioni della :ref:`Viewport <class_Viewport>` radice sono impostate esattamente sulle dimensioni base specificate nella sezione **Visualizzazione** delle Impostazioni del progetto. La scena viene prima renderizzata in questa viewport. Infine, questa viewport viene ridimensionata per adattarla allo schermo (tenendo conto dell'impostazione **Aspetto di stiramento**).
ru: **Stretch Mode = Viewport**: Масштабирование области просмотра означает, что размер корневого объекта :ref:`Viewport <class_Viewport>` устанавливается точно в соответствии с базовым размером, указанным в разделе **Display** в настройках проекта. Сцена сначала визуализируется в этой области просмотра. Затем эта область просмотра масштабируется по размеру экрана (с учётом параметра **Stretch Aspect**).
ta: . இந்த காட்சி முதலில் இந்த காட்சியகத்திற்கு வழங்கப்படுகிறது. இறுதியாக, இந்த காட்சியகம் திரைக்கு பொருந்தும் வகையில் அளவிடப்படுகிறது (** நீட்டிக்க அம்சத்தை ** அமைப்பை கணக்கில் எடுத்துக்கொள்வது).
uk: **Режим розтягування = Viewport**: масштабування Viewport означає, що розмір кореня :ref:`Viewport <class_Viewport>` встановлюється точно до базового розміру, зазначеного в розділі **Display** параметрів проекту. Сцена спочатку відображається в цьому вікні перегляду. Нарешті, це вікно перегляду масштабується відповідно до розміру екрана (з урахуванням параметра **Stretch Aspect**).
zh_cn: **Stretch Mode = Viewport** : 视口缩放意味着根 :ref:`Viewport <class_Viewport>` 的尺寸被精确地设置为在项目设置的 **Display** 部分指定的基本尺寸. 场景首先被渲染到这个视口. 最后, 这个视口被缩放以适应屏幕(考虑 **Stretch Aspect** 的设置).
zh_tw: **Stretch Mode = Viewport**：視口拉伸代表根 :ref:`Viewport <class_Viewport>` 的尺寸會被精確設為專案設定 **Display** 區段中指定的基礎尺寸，場景會先算繪到這個 viewport，再將這個 viewport 拉伸至螢幕大小（會考慮 **Stretch Aspect** 設定）。

source: To configure the stretch mode at runtime from a script, use the ``get_tree().root.content_scale_mode`` property (see :ref:`Window.content_scale_mode <class_Window_property_content_scale_mode>` and the :ref:`ContentScaleMode <enum_Window_ContentScaleMode>` enum).
ga: Chun an mód stráice a chumrú ag am rite ó script, úsáid an t-airí ``get_tree().root.content_scale_mode`` (féach :ref:`Window.content_scale_mode <class_Window_property_content_scale_mode>` agus an :ref:`Mód Scála Ábhair <enument_Window_ScaleMode>" ).
it: Per configurare la modalità di stiramento in fase di esecuzione da uno script, usare la proprietà ``get_tree().root.content_scale_mode`` (vedere :ref:`Window.content_scale_mode <class_Window_property_content_scale_mode>` e l'enumerazione :ref:`ContentScaleMode <enum_Window_ContentScaleMode>`).
ru: Чтобы настроить режим растяжения во время выполнения из скрипта, используйте свойство ``get_tree().root.content_scale_mode`` (см. :ref:`Window.content_scale_mode <class_Window_property_content_scale_mode>` и перечисление :ref:`ContentScaleMode <enum_Window_ContentScaleMode>`).
ta: ச்கிரிப்டிலிருந்து இயக்க நேரத்தில் நீட்டிக்க பயன்முறையை உள்ளமைக்க, `` get_tree (). Root.content_scale_mode`` சொத்து (காண்க: `சாளரம். ).
uk: Щоб налаштувати режим розтягування під час виконання зі сценарію, використовуйте властивість ``get_tree().root.content_scale_mode`` (див. :ref:`Window.content_scale_mode <class_Window_property_content_scale_mode>` та :ref:`ContentScaleMode <enum_Window_ContentScaleMode>` enum ).
zh_cn: 要在运行时从脚本配置拉伸模式，请使用 ``get_tree().root.content_scale_mode`` 属性（参见 :ref:`Window.content_scale_mode <class_Window_property_content_scale_mode>` 和 :ref:`ContentScaleMode <enum_Window_ContentScaleMode>` 枚举）。
zh_tw: 若要於執行期間以腳本設定拉伸模式，請使用 ``get_tree().root.content_scale_mode`` 屬性（參考 :ref:`Window.content_scale_mode <class_Window_property_content_scale_mode>` 和 :ref:`ContentScaleMode <enum_Window_ContentScaleMode>` 列舉）。

source: Stretch Aspect
ga: Gné Sín
it: Aspetto di stiramento
pt_br: Aspecto Esticado
ru: Соотношение растяжений
ta: நீட்டிக்க நற்பொருத்தம்
uk: Розтягнутий аспект
zh_cn: 拉伸比例
zh_tw: 拉伸比例

source: The second setting is the stretch aspect. Note that this only takes effect if **Stretch Mode** is set to something other than **Disabled**.
ga: Is é an dara suíomh an ghné stráice. Tabhair faoi deara nach dtagann sé seo i bhfeidhm ach amháin má tá **Mód Sín ** socraithe do rud éigin eile seachas **Díchumasaithe**.
it: La seconda impostazione è l'aspetto di stiramento. Nota che questa impostazione ha effetto solo se **Modalità di stiramento** è impostata su un valore diverso da **Disabled**.
ru: Вторая настройка — это аспект растяжения (stretch aspect). Обратите внимание, что он действует только в том случае, если для параметра **Stretch Mode** установлено значение, отличное от **Disabled**.
ta: இரண்டாவது அமைப்பு நீட்டிக்க அம்சமாகும். ** ஊனமுற்ற ** தவிர வேறு ஏதாவது ஒன்றை ** நீட்டிக்க பயன்முறை ** அமைக்கப்பட்டால் மட்டுமே இது நடைமுறைக்கு வரும் என்பதை நினைவில் கொள்க.
uk: Другий параметр – це аспект розтягування. Зауважте, що це діє, лише якщо для **Режиму розтягування** встановлено значення, відмінне від **Вимкнено**.
zh_cn: 第二个设置是拉伸纵横比. 请注意, 只有在 **Stretch Mode** 被设置为 **Disabled** 以外的情况下, 这才会生效.
zh_tw: 第二個設定是拉伸比例（Stretch Aspect）。僅在 **Stretch Mode** 設為 **Disabled** 以外時才有效。

source: In the animations below, you will notice gray and black areas. The black areas are added by the engine and cannot be drawn into. The gray areas are part of your scene, and can be drawn to. The gray areas correspond to the region outside the blue frame you see in the 2D editor.
ga: Sna beochana thíos, tabharfaidh tú faoi deara limistéir liath agus dubh. Cuireann an t-inneall na limistéir dhubha leis agus ní féidir iad a tharraingt isteach. Tá na limistéir liath mar chuid de do radharc, agus is féidir iad a tharraingt. Freagraíonn na limistéir liatha don réigiún lasmuigh den fhráma gorm a fheiceann tú san eagarthóir 2D.
it: Nelle animazioni di seguito, noterai aree grigie e nere. Le aree nere sono aggiunte dal motore e non vi si può disegnare. Le aree grigie fanno parte della scena e vi si può disegnare. Le aree grigie corrispondono alla regione esterna al riquadro blu visualizzato nell'editor 2D.
ru: На анимациях ниже вы заметите серые и чёрные области. Чёрные области добавляются движком и не могут быть отрисованы. Серые области являются частью вашей сцены и могут быть отрисованы. Серые области соответствуют области за пределами синей рамки, которую вы видите в 2D-редакторе.
ta: கீழேயுள்ள அனிமேசன்களில், சாம்பல் மற்றும் கருப்பு பகுதிகளை நீங்கள் கவனிப்பீர்கள். கறுப்புப் பகுதிகள் இயந்திரத்தால் சேர்க்கப்படுகின்றன, மேலும் அவை வரைய முடியாது. சாம்பல் பகுதிகள் உங்கள் காட்சியின் ஒரு பகுதியாகும், மேலும் அவை ஈர்க்கப்படலாம். சாம்பல் பகுதிகள் 2 டி எடிட்டரில் நீங்கள் காணும் நீலச் சட்டத்திற்கு வெளியே உள்ள பகுதிக்கு ஒத்திருக்கும்.
uk: На анімації нижче ви помітите сірі та чорні області. Чорні області додаються двигуном і не можуть бути втягнені в них. Сірі зони є частиною вашої сцени, і до них можна звернути увагу. Сірі області відповідають області за межами синьої рамки, яку ви бачите в 2D-редакторі.
zh_cn: 在下面的动画中, 你会注意到灰色和黑色区域. 黑色区域由引擎添加, 无法绘制. 灰色区域是场景的一部分, 可以绘制. 灰色区域对应于你在2D编辑器中看到的蓝色框架外的区域.
zh_tw: 在下方動畫中，你會看到灰色與黑色區域。黑色區域由引擎自動產生，無法繪製內容；灰色區域則屬於你的場景，可以繪製。這些灰色區域對應 2D 編輯器中藍色框線外的部分。

source: **Stretch Aspect = Ignore**: Ignore the aspect ratio when stretching the screen. This means that the original resolution will be stretched to exactly fill the screen, even if it's wider or narrower. This may result in nonuniform stretching: things looking wider or taller than designed.
ga: **Sín Gné = Déan neamhaird **: Déan neamhaird den chóimheas treoíochta agus tú ag síneadh an scáileáin. Ciallaíonn sé seo go mbeidh an rún bunaidh sínte chun an scáileán a líonadh go díreach, fiú má tá sé níos leithne nó níos cúinge. D'fhéadfadh síneadh nonuniform a bheith mar thoradh air seo: rudaí ag breathnú níos leithne nó níos airde ná mar a ceapadh.
it: **Aspetto di stiramento = Ignore**: ignora il rapporto d'aspetto quando viene stirato lo schermo. Ciò significa che la risoluzione originale verrà stirata per riempire esattamente lo schermo, anche se è più largo o più stretto. Ciò potrebbe causare uno stiramento non uniforme: gli oggetti potrebbero apparire più larghi o più alti del previsto.
ru: **Stretch Aspect = Ignore**: Игнорировать соотношение сторон при растяжении экрана. Это означает, что исходное разрешение будет растянуто до полного заполнения экрана, даже если он шире или уже. Это может привести к неравномерному растяжению: объекты будут выглядеть шире или выше, чем задумано.
ta: ** நீட்டிக்க நற்பொருத்தம் = புறக்கணிக்கவும் **: திரையை நீட்டும்போது விகித விகிதத்தை புறக்கணிக்கவும். இதன் பொருள் அசல் தீர்மானம் திரையை சரியாக நிரப்ப நீட்டிக்கப்படும், அது பரந்ததாகவோ அல்லது குறுகலாகவோ இருந்தாலும் கூட. இது ஒரே மாதிரியான நீட்டிப்புக்கு வழிவகுக்கும்: வடிவமைக்கப்பட்டதை விட பரந்த அல்லது உயரமாக இருக்கும் விசயங்கள்.
uk: **Stretch Aspect = Ignore**: ігнорувати співвідношення сторін під час розтягування екрана. Це означає, що початкова роздільна здатність буде розтягнута, щоб точно заповнити екран, навіть якщо він ширший або вужчий. Це може призвести до нерівномірного розтягування: предмети виглядатимуть ширше або вище, ніж задумано.
zh_cn: **Stretch Aspect = Ignore** : 在拉伸屏幕时忽略长宽比. 这意味着原始分辨率将被拉伸以完全填满屏幕, 即使它更宽或更窄. 这可能会导致不均匀的拉伸, 事物看起来比设计的更宽或更高.
zh_tw: **Stretch Aspect = Ignore**：拉伸時忽略長寬比。這表示畫面會被強制拉伸以完全填滿螢幕，不論螢幕比例是否比設計時寬或窄。這可能導致畫面變形，例如物件看起來比原設計更寬或更高。

source: **Stretch Aspect = Keep**: Keep aspect ratio when stretching the screen. This means that the viewport retains its original size regardless of the screen resolution, and black bars will be added to the top/bottom of the screen ("letterboxing") or the sides ("pillarboxing").
ga: **Sín Gné = Coinnigh**: Coinnigh cóimheas treoíochta agus tú ag síneadh an scáileáin. Ciallaíonn sé seo go gcoinníonn an viewport a mhéid bunaidh beag beann ar an taifeach scáileáin, agus cuirfear barraí dubha le barr / bun an scáileáin ("bosca litreach") nó na taobhanna ("pillarboxing").
it: **Aspetto di stiramento = Keep**: mantiene rapporto d'aspetto quando viene stirato lo schermo. Ciò significa che la viewport mantiene le sue dimensioni originali indipendentemente dalla risoluzione dello schermo e verranno aggiunte delle barre nere in alto/basso allo schermo ("letterboxing") o ai lati ("pillarboxing").
ru: **Stretch Aspect = Keep**: Сохранять соотношение сторон при растяжении экрана. Это означает, что область просмотра сохраняет свой исходный размер независимо от разрешения экрана, а сверху/снизу экрана ("letterboxing") или по бокам ("pillarboxing") добавляются чёрные полосы.
ta: ** நீட்டிக்க நற்பொருத்தம் = வைத்திருங்கள் **: திரையை நீட்டும்போது விகித விகிதத்தை வைத்திருங்கள். இதன் பொருள் திரை தெளிவுத்திறனைப் பொருட்படுத்தாமல் வியூபோர்ட் அதன் அசல் அளவைத் தக்க வைத்துக் கொள்கிறது, மேலும் திரையின் மேல்/கீழ் ("லெட்டர்பாக்சிங்") அல்லது பக்கங்களில் ("பில்லர்பாக்சிங்") கருப்பு பார்கள் சேர்க்கப்படும்.
uk: **Stretch Aspect = Keep**: Зберігайте співвідношення сторін під час розтягування екрана. Це означає, що вікно перегляду зберігає свій вихідний розмір незалежно від роздільної здатності екрана, а чорні смуги будуть додані вгорі/внизу екрана ("літербокс") або з боків ("пілларбокс").
zh_cn: **Stretch Aspect = Keep** : 在拉伸屏幕的时候保持长宽比. 这意味着无论屏幕分辨率如何, 视口都会保留原来的尺寸, 黑条会被添加到屏幕的顶部或底部("宽屏模式 ")或侧面(" 竖屏模式").
zh_tw: **Stretch Aspect = Keep**：拉伸時保持長寬比。這表示無論螢幕解析度為何，視口都維持原本尺寸，必要時會在上下（黑邊：Letterbox）或左右（黑邊：Pillarbox）加上黑條。

source: This is a good option if you know the aspect ratio of your target devices in advance, or if you don't want to handle different aspect ratios.
ga: Is rogha mhaith é seo má tá cóimheas gné do spriocghléasanna ar eolas agat roimh ré, nó mura bhfuil tú ag iarraidh cóimheasa gné éagsúla a láimhseáil.
it: Questa è una buona opzione se conosci in anticipo il rapporto d'aspetto dei tuoi dispositivi di destinazione o se non vuoi gestire rapporti d'aspetto diversi.
ru: Это хороший вариант, если вы заранее знаете соотношение сторон целевых устройств или не хотите иметь дело с разными соотношениями сторон.
ta: உங்கள் இலக்கு சாதனங்களின் விகித விகிதத்தை முன்கூட்டியே அறிந்தால் அல்லது வெவ்வேறு அம்ச விகிதங்களை நீங்கள் கையாள விரும்பவில்லை என்றால் இது ஒரு நல்ல வழி.
uk: Це хороший варіант, якщо ви заздалегідь знаєте співвідношення сторін цільових пристроїв або якщо ви не хочете обробляти різні співвідношення сторін.
zh_cn: 如果你事先知道目标设备的宽高比, 或者你不想处理不同的宽高比, 这是一个不错的选择.
zh_tw: 如果你已知目標裝置的長寬比，或不打算處理多種長寬比，這是一個好選擇。

source: **Stretch Aspect = Keep Width**: Keep aspect ratio when stretching the screen. If the screen is wider than the base size, black bars are added at the left and right (pillarboxing). But if the screen is taller than the base resolution, the viewport will be grown in the vertical direction (and more content will be visible to the bottom). You can also think of this as "Expand Vertically".
ga: ** Gné Sín = Coinnigh Leithead **: Coinnigh cóimheas treoíochta agus an scáileán á shíneadh. Má tá an scáileán níos leithne ná an bunmhéid, cuirtear barraí dubha ar chlé agus ar dheis (pillarboxing). Ach má tá an scáileán níos airde ná an buntaifeach, fásfar an radharc sa treo ingearach (agus beidh níos mó ábhar le feiceáil ag an mbun). Is féidir leat smaoineamh air seo freisin mar "Leathnaigh go hIngearach".
it: **Allunga proporzioni = Keep Width**: mantiene rapporto d'aspetto quando viene stirato lo schermo. Se lo schermo è più largo della dimensione base, vengono aggiunte delle barre nere a sinistra e a destra (pillarboxing). Se invece lo schermo è più alto della risoluzione di base, la viewport verrà ingrandita in verticale (e saranno visibili più contenuti in basso). Puoi anche pensare a questa opzione come "Espandi verticalmente".
ru: **Stretch Aspect = Keep Width**: Сохранять пропорции при растяжении экрана. Если экран шире базового размера, слева и справа добавляются чёрные полосы (pillarboxing). Но если экран выше базового разрешения, область просмотра будет расширена по вертикали (и больше контента будет видно внизу). Это также можно назвать "Расширение по вертикали".
ta: ** நீட்டிக்க நற்பொருத்தம் = அகலத்தை வைத்திருங்கள் **: திரையை நீட்டும்போது விகித விகிதத்தை வைத்திருங்கள். அடிப்படை அளவை விட திரை அகலமாக இருந்தால், இடது மற்றும் வலதுபுறத்தில் (தூண் பெட்டி) கருப்பு பார்கள் சேர்க்கப்படுகின்றன. அடிப்படை தெளிவுத்திறனை விட திரை உயரமாக இருந்தால், காட்சியகம் செங்குத்து திசையில் வளர்க்கப்படும் (மேலும் உள்ளடக்கம் கீழே தெரியும்). இதை "செங்குத்தாக விரிவாக்கு" என்றும் நீங்கள் நினைக்கலாம்.
uk: **Stretch Aspect = Keep Width**: зберігайте співвідношення сторін під час розтягування екрана. Якщо ширина екрана ширша за базовий розмір, ліворуч і праворуч додаються чорні смуги (розміщення на стовпах). Але якщо екран вищий за базову роздільну здатність, вікно перегляду буде збільшено у вертикальному напрямку (і більше вмісту буде видно внизу). Ви також можете подумати про це як про «розгорнути по вертикалі».
zh_cn: **Stretch Aspect = Keep Width** : 在拉伸屏幕时保持长宽比. 如果屏幕比基本尺寸宽, 则会在左右两边添加黑条(竖屏模式). 但如果屏幕比基本分辨率高, 视口将在垂直方向上增长(更多的内容将在底部可见). 你也可以把它看作是 "垂直扩展" .
zh_tw: **Stretch Aspect = Keep Width**：拉伸時保持長寬比。如果螢幕比基礎尺寸寬，則左右會加上黑條（Pillarbox）；如果螢幕比基礎尺寸高，視口會往垂直方向擴增（底部會顯示更多內容）。你也可以把這看成「垂直擴充」。

source: This is usually the best option for creating GUIs or HUDs that scale, so some controls can be anchored to the bottom (:ref:`doc_size_and_anchors`).
ga: De ghnáth is é seo an rogha is fearr chun GUIanna nó HUDanna a chruthú a scála, ionas gur féidir roinnt rialuithe a ancaire go bun (:ref:'doc_size_and_anchors').
it: Questa è solitamente l'opzione migliore per creare interfacce grafiche utente (GUI) o HUD che si adattano, in modo che alcuni controlli si possano ancorare in fondo (:ref:`doc_size_and_anchors`).
ru: Обычно это лучший вариант для создания масштабируемых графических интерфейсов (GUIs) или HUD, поэтому некоторые элементы управления можно прикрепить к нижней части (:ref:`doc_size_and_anchors`).
ta: இது பொதுவாக குயிச் அல்லது HUD களை உருவாக்குவதற்கான சிறந்த வழி, எனவே சில கட்டுப்பாடுகளை கீழே தொகுக்க முடியும் (: ref: `doc_size_and_anchors`).
uk: Зазвичай це найкращий варіант для створення GUI або HUD, які масштабуються, тому деякі елементи керування можна прив’язати внизу (:ref:`doc_size_and_anchors`).
zh_cn: 这通常是创建可扩展的GUI或HUD的最佳选择, 因此一些控件可以锚定到底部( :ref:`doc_size_and_anchors`).
zh_tw: 這通常是設計可縮放 GUI 或 HUD 最佳選擇，你可以將某些控制元件錨定在底部（參考 :ref:`doc_size_and_anchors`）。

source: **Stretch Aspect = Keep Height**: Keep aspect ratio when stretching the screen. If the screen is taller than the base size, black bars are added at the top and bottom (letterboxing). But if the screen is wider than the base resolution, the viewport will be grown in the horizontal direction (and more content will be visible to the right). You can also think of this as "Expand Horizontally".
ga: ** Gné Sín = Coinnigh Airde **: Coinnigh cóimheas treoíochta agus tú ag síneadh an scáileáin. Má tá an scáileán níos airde ná an bunmhéid, cuirtear barraí dubha ag an mbarr agus ag an mbun (bosca litreach). Ach má tá an scáileán níos leithne ná an buntaifeach, fásfar an radharc sa treo cothrománach (agus beidh níos mó ábhar le feiceáil ar dheis). Is féidir leat smaoineamh air seo freisin mar "Expand Horizontally".
it: **Aspetto di stiramento = Keep Height**: Mantiene rapporto d'aspetto quando viene stirato lo schermo. Se lo schermo è più alto della dimensione base, vengono aggiunte delle barre nere in alto e in basso (letterboxing). Se invece lo schermo è più largo della risoluzione base, la viewport verrà ingrandita in senso orizzontale (e saranno visibili più contenuti a destra). Puoi anche pensare a questa opzione come "Espandi orizzontalmente".
ru: **Stretch Aspect = Keep Height**: Сохранять пропорции при растяжении экрана. Если экран выше базового размера, сверху и снизу добавляются чёрные полосы (letterboxing). Но если экран шире базового разрешения, область просмотра будет расширена по горизонтали (и больше контента будет видно справа). Это также можно назвать «Расширить горизонтально».
ta: ** நீட்டிக்க நற்பொருத்தம் = உயரத்தை வைத்திருங்கள் **: திரையை நீட்டும்போது விகித விகிதத்தை வைத்திருங்கள். அடிப்படை அளவை விட திரை உயரமாக இருந்தால், கருப்பு பார்கள் மேல் மற்றும் கீழ் (லெட்டர்பாக்சிங்) சேர்க்கப்படுகின்றன. அடிப்படை தெளிவுத்திறனை விட திரை அகலமாக இருந்தால், காட்சியகம் கிடைமட்ட திசையில் வளர்க்கப்படும் (மேலும் உள்ளடக்கம் வலதுபுறத்தில் தெரியும்). இதை "கிடைமட்டமாக விரிவாக்கு" என்றும் நீங்கள் நினைக்கலாம்.
uk: **Розтягнути формат = зберегти висоту**: зберегти співвідношення сторін під час розтягування екрана. Якщо екран вищий за базовий розмір, угорі та внизу додаються чорні смуги (розміщення полів). Але якщо екран ширший за базову роздільну здатність, вікно перегляду буде збільшено в горизонтальному напрямку (і більше вмісту буде видно праворуч). Ви також можете розглядати це як «Розгорнути горизонтально».
zh_cn: **Stretch Aspect = Keep Height** : 在拉伸屏幕时保持长宽比. 如果屏幕比基本尺寸高, 则会在顶部和底部添加黑条(宽屏模式). 但如果屏幕比基本分辨率宽, 视口将在水平方向上增长(更多的内容将在右边可见). 你也可以把它看作是 "水平扩展" .
zh_tw: **Stretch Aspect = Keep Height**：拉伸時保持長寬比。如果螢幕比基礎尺寸高，則上下會加上黑條（Letterbox）；若螢幕比基礎尺寸寬，則視口會往水平方向擴增（右邊會顯示更多內容）。你也可以把這看成「水平擴充」。

source: This is usually the best option for 2D games that scroll horizontally (like runners or platformers).
ga: De ghnáth is é seo an rogha is fearr le haghaidh cluichí 2D a scrollaíonn go cothrománach (cosúil le reathaithe nó platformers).
it: Questa è solitamente l'opzione migliore per i giochi 2D che scorrono orizzontalmente (come i giochi di corsa o piattaforme).
ru: Обычно это лучший вариант для 2D-игр с горизонтальной прокруткой (типа раннеров или платформеров).
ta: கிடைமட்டமாக உருட்டும் 2 டி கேம்களுக்கு இது பொதுவாக சிறந்த வழி (ரன்னர்கள் அல்லது இயங்குதளங்கள் போன்றவை).
uk: Зазвичай це найкращий варіант для 2D-ігор, які прокручуються горизонтально (наприклад, ранери чи платформери).
zh_cn: 这通常是水平滚动的2D游戏的最佳选择(如跑步者或平台游戏者).
zh_tw: 這通常適合水平捲動的 2D 遊戲（如跑酷或橫向卷軸平台遊戲）。

source: **Stretch Aspect = Expand**: Keep aspect ratio when stretching the screen, but keep neither the base width nor height. Depending on the screen aspect ratio, the viewport will either be larger in the horizontal direction (if the screen is wider than the base size) or in the vertical direction (if the screen is taller than the original size).
ga: ** Gné Sín = Leathnú **: Coinnigh cóimheas gné nuair a shíneann tú an scáileán, ach ná coinnigh an leithead bonn ná an airde. Ag brath ar an gcóimheas gné scáileáin, beidh an t-amharc níos mó sa treo cothrománach (má tá an scáileán níos leithne ná an bunmhéid) nó sa treo ingearach (má tá an scáileán níos airde ná an méid bunaidh).
it: **Aspetto di stiramento = Expand**: mantiene il rapporto d'aspetto quando viene allungato lo schermo, ma non mantenere né la larghezza né l'altezza di base. A seconda del rapporto d'aspetto dello schermo, la viewport sarà più grande in direzione orizzontale (se lo schermo è più largo della dimensione della base) o in direzione verticale (se lo schermo è più alto della dimensione originale).
ru: **Stretch Aspect = Expand**: Cохранить пропорции при растяжении экрана, но не сохранить базовую ширину и высоту. В зависимости от пропорций экрана область просмотра будет больше либо по горизонтали (если экран шире базового размера), либо по вертикали (если экран выше исходного размера).
ta: ** நீட்சி நற்பொருத்தம் = விரிவாக்கு **: திரையை நீட்டும்போது விகித விகிதத்தை வைத்திருங்கள், ஆனால் அடிப்படை அகலமோ உயரமோ இல்லை. திரை விகித விகிதத்தைப் பொறுத்து, காட்சியகம் கிடைமட்ட திசையில் பெரியதாக இருக்கும் (திரை அடிப்படை அளவை விட அகலமாக இருந்தால்) அல்லது செங்குத்து திசையில் (திரை அசல் அளவை விட உயரமாக இருந்தால்).
uk: **Stretch Aspect = Expand**: зберігайте співвідношення сторін під час розтягування екрана, але не зберігайте ні ширину, ні висоту. Залежно від співвідношення сторін екрана вікно перегляду буде більшим у горизонтальному напрямку (якщо екран ширший за базовий розмір) або у вертикальному напрямку (якщо екран вищий за вихідний розмір).
zh_cn: **Stretch Aspect = Expand** : 在拉伸屏幕时保持长宽比, 但既不保持基本宽度也不保持高度. 根据屏幕的长宽比, 视口将在水平方向(如果屏幕比基本尺寸宽)或垂直方向上变大(如果屏幕比原始尺寸高).
zh_tw: **Stretch Aspect = Expand**：拉伸時保持長寬比，但不固定基礎寬度或高度。視口會依據螢幕長寬比，往水平方向（若螢幕比基礎尺寸寬）或垂直方向（若螢幕比基礎尺寸高）擴增。
