Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: ga, it, pt_br, ru, ta, uk, zh_cn, zh_tw

source: To resolve this, you can :ref:`enable mipmaps <doc_importing_images_mipmaps>` on all your 2D textures. However, enabling mipmaps will increase memory usage which can be an issue on low-end mobile devices.
ga: Chun é seo a réiteach, is féidir leat :tag:` mipmaps a chumasú <doc_importing_images_mipmaps>` ar d'uigeachtaí 2T go léir. Mar sin féin, méadóidh cumasú mipmaps úsáid chuimhne rud a d'fhéadfadh a bheith ina fhadhb ar ghléasanna soghluaiste íseal-deireadh.
ru: Чтобы решить эту проблему, можно :ref:`enable mipmaps <doc_importing_images_mipmaps>` для всех 2D-текстур. Однако включение MIP-текстур увеличит потребление памяти, что может стать проблемой на недорогих мобильных устройствах.
ta: இதைத் தீர்க்க, உங்களால் முடியும்: ref: `MIPMAPS ஐ இயக்கவும் <doc_importing_images_mipmaps>` உங்கள் 2 டி அமைப்புகளில். இருப்பினும், MIPMAP களை இயக்குவது நினைவக பயன்பாட்டை அதிகரிக்கும், இது குறைந்த-இறுதி மொபைல் சாதனங்களில் சிக்கலாக இருக்கும்.
uk: Щоб вирішити цю проблему, ви можете :ref:`ввімкнути mipmaps <doc_importing_images_mipmaps>` для всіх ваших 2D текстур. Однак увімкнення mipmaps збільшить використання пам’яті, що може бути проблемою на мобільних пристроях низького класу.
zh_tw: 解決方法是：你可以為所有 2D 紋理 :ref:`啟用 mipmaps <doc_importing_images_mipmaps>`。不過，啟用 mipmaps 會增加記憶體用量，在低階行動裝置上可能成為問題。

source: Handling aspect ratios
ga: Cóimheasa gné a láimhseáil
it: Gestione dei rapporti di aspetto
pt_br: Trabalhando com proporções de tela
ru: Обработка пропорций
ta: அம்ச விகிதங்களைக் கையாளுதல்
uk: Обробка пропорцій
zh_cn: 处理纵横比
zh_tw: 處理長寬比

source: Once scaling for different resolutions is accounted for, make sure that your *user interface* also scales for different aspect ratios. This can be done using :ref:`anchors <doc_size_and_anchors>` and/or :ref:`containers <doc_gui_containers>`.
ga: Nuair a dhéantar cuntas ar scálú le haghaidh rúin éagsúla, cinntigh go bhfuil do *chomhéadan úsáideora* ag scálaí le haghaidh cóimheasa gnéithe éagsúla. Is féidir é seo a dhéanamh le :ref:`ancairí <doc_size_and_anchors>` agus/nó :ref:`coimeádáin <doc_gui_containers>`.
ru: После того, как масштабирование для разных разрешений учтено, убедитесь, что ваш *пользовательский интерфейс* также масштабируется для разных соотношений сторон. Это можно сделать с помощью :ref:`anchors <doc_size_and_anchors>` и/или :ref:`containers <doc_gui_containers>`.
ta: வெவ்வேறு தீர்மானங்களுக்கான அளவிடுதல் கணக்கிடப்பட்டவுடன், உங்கள் * பயனர் இடைமுகம் * வெவ்வேறு அம்ச விகிதங்களுக்கும் அளவிடப்படுகிறது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். இதைப் பயன்படுத்தி இதைச் செய்யலாம்: ref: `நங்கூரர்கள் <doc_size_and_anchors>` மற்றும்/அல்லது: ref: `கொள்கலன்கள் <doc_gui_containers>`.
uk: Після врахування масштабування для різних роздільних здатностей переконайтеся, що ваш *інтерфейс* також масштабується для різних пропорцій. Це можна зробити за допомогою :ref:`anchors <doc_size_and_anchors>` та/або :ref:`containers <doc_gui_containers>`.
zh_cn: 一旦考虑到不同分辨率的缩放, 请确保你的 *user interface* 也能为不同的长宽比进行缩放. 这可以使用 :ref:`anchors <doc_size_and_anchors>` 和/或 :ref:`containers <doc_gui_containers>` 来完成.
zh_tw: 調整好各種解析度的縮放後，也要確保你的 *使用者介面* 能針對不同長寬比做自動縮放。這可以藉由 :ref:`anchors <doc_size_and_anchors>` 及／或 :ref:`containers <doc_gui_containers>` 實現。

source: Field of view scaling
ga: Réimse scálú radhairc
ru: Масштабирование поля зрения
ta: பார்வை அளவிடுதல் புலம்
uk: Масштабування поля зору
zh_cn: 视场角缩放
zh_tw: 視野縮放

source: The 3D Camera node's **Keep Aspect** property defaults to the **Keep Height** scaling mode (also called *Hor+*). This is usually the best value for desktop games and mobile games in landscape mode, as widescreen displays will automatically use a wider field of view.
ga: Réamhshocruithe maoine an nód Ceamara 3D **Keep Aspect ** leis an modh scálaithe **Keep Height ** (ar a dtugtar *Hor +*freisin). De ghnáth is é seo an luach is fearr le haghaidh cluichí deisce agus cluichí soghluaiste i mód tírdhreacha, mar go n-úsáidfidh taispeántais leathanscáileáin réimse níos leithne radhairc go huathoibríoch.
ru: Свойство **Keep Aspect** узла 3D-камеры по умолчанию настроено на режим масштабирования **Keep Height** (также называемый *Hor+*). Обычно это оптимальное значение для игр на настольных компьютерах и мобильных устройствах в альбомной ориентации, поскольку широкоэкранные дисплеи автоматически используют более широкое поле зрения.
ta: 3D கேமரா முனையின் ** அம்சத்தை வைத்திருங்கள் ** சொத்து இயல்புநிலை ** உயரத்தை வைத்திருங்கள் ** அளவிடுதல் பயன்முறையில் (*HOR+*என்றும் அழைக்கப்படுகிறது). நிலப்பரப்பு பயன்முறையில் டெச்க்டாப் கேம்கள் மற்றும் மொபைல் கேம்களுக்கான சிறந்த மதிப்பு இது, ஏனெனில் அகலத்திரை காட்சிகள் தானாகவே பரந்த பார்வையைப் பயன்படுத்தும்.
uk: Властивість **Зберігати аспект** вузла 3D-камери за замовчуванням використовує режим масштабування **Зберігати висоту** (також називається *Hor+*). Зазвичай це найкраще значення для настільних і мобільних ігор у альбомному режимі, оскільки широкоформатні дисплеї автоматично використовуватимуть ширше поле огляду.
zh_cn: 3D相机节点的 **Keep Aspect** 属性默认为 **Keep Height** 缩放模式(也称为 *Hor+* ). 在横屏模式下, 这通常是桌面游戏和手机游戏的最佳选择, 因为宽屏显示器会自动使用更宽的视野.
zh_tw: 3D 相機節點的 **Keep Aspect** （保持長寬比）屬性預設為 **Keep Height** （保持高度）縮放模式（又稱 *Hor+* ）。這通常適用於桌面遊戲或橫向手機遊戲，因為寬螢幕會自動採用更寬的視野。

source: However, if your 3D game is intended to be played in portrait mode, it may make more sense to use **Keep Width** instead (also called *Vert-*). This way, smartphones with an aspect ratio taller than 16:9 (e.g. 19:9) will use a *taller* field of view, which is more logical here.
ga: Mar sin féin, má tá sé i gceist do chluiche 3D a imirt i mód portráide, d'fhéadfadh sé níos mó ciall a bhaint as **Keep Width ** ina ionad (ar a dtugtar *Vert-*freisin). Ar an mbealach seo, úsáidfidh fóin chliste le cóimheas gné níos airde ná 16: 9 (m.sh. 19: 9) réimse radhairc * níos airde *, atá níos loighciúla anseo.
ru: Однако, если ваша 3D-игра предназначена для портретного режима, может быть разумнее использовать параметр **Keep Width** (также называемый *Vert-*). Таким образом, смартфоны с соотношением сторон выше 16:9 (например, 19:9) будут использовать *более* высокое поле зрения, что в данном случае более логично.
ta: இருப்பினும், உங்கள் 3D விளையாட்டு உருவப்படம் பயன்முறையில் இயக்கப்பட வேண்டும் எனில், ** அகலத்தை ** ஐப் பயன்படுத்துவது கூடுதல் அர்த்தமுள்ளதாக இருக்கலாம் ** அதற்கு பதிலாக (*வெர்ட்-*என்றும் அழைக்கப்படுகிறது). இந்த வழியில், 16: 9 (எ.கா. 19: 9) ஐ விட உயரமுள்ள ஒரு விகித விகிதத்துடன் கூடிய ச்மார்ட்போன்கள் * உயரமான * பார்வைத் துறையைப் பயன்படுத்தும், இது இங்கே மிகவும் தர்க்கரீதியானது.
uk: Проте, якщо у вашу 3D-гру планується грати в портретному режимі, можливо, доцільніше використовувати натомість **Keep Width** (також називається *Vert-*). Таким чином, смартфони зі співвідношенням сторін вище 16:9 (наприклад, 19:9) використовуватимуть *вище* поле зору, що тут логічніше.
zh_cn: 然而, 如果你的3D游戏打算使用纵向模式, 那么使用 **Keep Width保持宽度** 称为( *Vert-* )可能会更有意义. 这样, 宽高比大于16:9(例如19:9)的智能手机将使用 *更高* 的视野, 这在这里更符合逻辑.
zh_tw: 但若你的 3D 遊戲打算以直向模式進行，建議改用 **Keep Width** （保持寬度）（又稱 *Vert-* ）。這樣長寬比高於 16:9（如 19:9）的手機就會自動採用 *更高* 的視野，這樣才更合理。

source: Scaling 2D and 3D elements differently using Viewports
ga: Eilimintí 2D agus 3D a scálú ar bhealach difriúil ag baint úsáide as Viewports
ta: 2D மற்றும் 3D கூறுகளை அளவிடுதல் காட்சிப் வகைகளைப் பயன்படுத்தி வித்தியாசமாக
uk: Різне масштабування 2D і 3D елементів за допомогою вікон перегляду
zh_cn: 使用 Viewport 以不同的方式缩放 2D 和 3D 元素
zh_tw: 使用多個 Viewport 區分縮放 2D 與 3D 元素

source: Using multiple Viewport nodes, you can have different scales for various elements. For instance, you can use this to render the 3D world at a low resolution while keeping 2D elements at the native resolution. This can improve performance significantly while keeping the HUD and other 2D elements crisp.
ga: Ag baint úsáide as nóid Viewport il, is féidir leat scálaí éagsúla a bheith agat le haghaidh eilimintí éagsúla. Mar shampla, is féidir leat é seo a úsáid chun an domhan 3D a dhéanamh ag réiteach íseal agus eilimintí 2D a choinneáil ag an réiteach dúchasach. Is féidir leis seo feidhmíocht a fheabhsú go suntasach agus an HUD agus eilimintí 2D eile a choinneáil briosc.
ta: பல வியூபோர்ட் முனைகளைப் பயன்படுத்தி, பல்வேறு கூறுகளுக்கு நீங்கள் வெவ்வேறு அளவீடுகளை வைத்திருக்க முடியும். உதாரணமாக, 2 டி கூறுகளை சொந்தத் தீர்மானத்தில் வைத்திருக்கும் போது 3 டி உலகத்தை குறைந்த தெளிவுத்திறனில் வழங்க இதைப் பயன்படுத்தலாம். HUD மற்றும் பிற 2D கூறுகளை மிருதுவாக வைத்திருக்கும்போது இது செயல்திறனை கணிசமாக மேம்படுத்த முடியும்.
uk: Використовуючи кілька вузлів Viewport, ви можете мати різні масштаби для різних елементів. Наприклад, ви можете використовувати це для візуалізації 3D-світу з низькою роздільною здатністю, зберігаючи при цьому 2D-елементи з початковою роздільною здатністю. Це може значно підвищити продуктивність, зберігаючи чіткість HUD та інших 2D-елементів.
zh_cn: 使用多个视图窗口节点, 可以对不同的元素使用不同的比例. 例如, 你可以使用此选项以低分辨率渲染3D世界, 同时将2D元素保持在原生分辨率. 这可以显著提高性能, 同时保持HUD和其他2D元素的清晰度.
zh_tw: 你可以利用多個 Viewport 節點，針對不同元素分別使用不同的縮放設定。例如，你可以讓 3D 世界以低解析度算繪，同時讓 2D 元素維持原生解析度。這樣可以大幅提升效能，同時讓 HUD 與其他 2D 介面保持清晰。

source: This is done by using the root Viewport node only for 2D elements, then creating a Viewport node to display the 3D world and displaying it using a SubViewportContainer or TextureRect node. There will effectively be two viewports in the final project. One upside of using TextureRect over SubViewportContainer is that it allows enable linear filtering. This makes scaled 3D viewports look better in many cases.
ga: Déantar é seo trí úsáid a bhaint as an nód fréimhe Viewport ach amháin le haghaidh eilimintí 2D, ansin nód Viewport a chruthú chun an domhan 3D a thaispeáint agus é a thaispeáint ag baint úsáide as nód SubViewportContainer nó TextureRect. Beidh dhá dhearcadh sa tionscadal deiridh go héifeachtach. Ceann de na bunoscionn a bhaineann le TextureRect a úsáid thar SubViewportContainer ná go gceadaíonn sé scagadh líneach a chumasú. Fágann sé seo go bhfuil cuma níos fearr ar dhearcadh 3D scálaithe i go leor cásanna.
ta: ரூட் வியூபோர்ட் முனையை 2 டி கூறுகளுக்கு மட்டுமே பயன்படுத்துவதன் மூலம் இது செய்யப்படுகிறது, பின்னர் 3D உலகத்தைக் காண்பிக்க ஒரு வியூ துறைமுகம் முனையை உருவாக்கி, அதை சப் வியூ துறைமுகம் கான்டெய்னர் அல்லது டெக்ச்டெரெக்டர் முனையைப் பயன்படுத்தி காண்பிப்பதன் மூலம் இது செய்யப்படுகிறது. இறுதித் திட்டத்தில் திறம்பட இரண்டு காட்சிகள் இருக்கும். SubViewPortContainer மீது டெக்ச்டரக்டரைப் பயன்படுத்துவதில் ஒரு தலைகீழ் என்னவென்றால், இது நேரியல் வடிகட்டலை இயக்க அனுமதிக்கிறது. இது அளவிடப்பட்ட 3D காட்சிகள் பல சந்தர்ப்பங்களில் சிறப்பாக தோற்றமளிக்கிறது.
uk: Це робиться шляхом використання кореневого вузла Viewport лише для 2D-елементів, а потім створення вузла Viewport для відображення 3D-світу та його відображення за допомогою вузла SubViewportContainer або TextureRect. Фактично в остаточному проекті буде два вікна перегляду. Одним із переваг використання TextureRect над SubViewportContainer є те, що він дозволяє ввімкнути лінійну фільтрацію. Завдяки цьому масштабовані тривимірні екрани виглядають краще в багатьох випадках.
zh_cn: 这是通过仅对 2D 元素使用根 Viewport 节点，然后创建一个 Viewport 节点来显示 3D 世界，并使用 SubViewportContainer 或 TextureRect 节点显示该 Viewport 节点来实现的。最终项目中实际上会有两个视口。使用 TextureRect 而不是 SubViewportContainer 的一个好处是它允许启用线性过滤。这会使缩放的 3D 视口在许多情况下看起来更好。
zh_tw: 做法是：把根 Viewport 節點僅用於 2D 元素，再建立一個 Viewport 節點來顯示 3D 世界，並用 SubViewportContainer 或 TextureRect 節點呈現。最終專案中就有兩個視口。若用 TextureRect 而非 SubViewportContainer，可以啟用線性濾鏡，讓縮放後的 3D 畫面更平滑。

source: See the `3D viewport scaling demo <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_scaling>`__ for examples.
ga: Féach ar an taispeántas scálú `viewport 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_scaling>`__ le haghaidh samplaí.
pt_br: Veja a `demonstração de escalonamento da janela de exibição 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_scaling>`__ para exemplos.
ta: `3D VIEWPORT அளவிடுதல் டெமோ <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_scaling> __ __ எடுத்துக்காட்டுகளுக்கு.
uk: Приклади дивіться у `демонстрації масштабування вікна 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_scaling>`__.
zh_cn: 有关示例, 请参见 `3D 视口缩放演示 <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_scaling>`__ .
zh_tw: 示範專案請參考 `3D viewport scaling demo <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_scaling>`__。

source: For 3D rendering, there is not much of a need to support multiple resolutions. Thanks to its vector-based nature, 3D geometry will just fill the screen based on the viewport size. For 2D and game UIs, this is a different matter, as art needs to be created using specific pixel sizes in software such as Photoshop, GIMP or Krita.
it: Per il rendering 3D, non c'è molto bisogno di supportare più risoluzioni. Grazie alla sua natura vettoriale, la geometria 3D riempirà lo schermo in base alle dimensioni della viewport. Per le interfacce utente 2D e di gioco, la questione è diversa, poiché l'arte deve essere creata utilizzando dimensioni di pixel specifiche in software come Photoshop, GIMP o Krita.
ru: Для 3D-рендеринга поддержка нескольких разрешений не так уж и важна. Благодаря своей векторной природе, трёхмерная геометрия просто заполнит экран в соответствии с размером области просмотра. Для 2D-графики и игровых интерфейсов всё обстоит иначе, поскольку графика должна создаваться с использованием определённых размеров пикселей в таких программах, как Photoshop, GIMP или Krita.

source: To render 3D at a lower resolution than 2D elements (without needing separate viewports), you can use Godot's :ref:`resolution scaling <doc_resolution_scaling>` support. This is a good way to improve performance significantly in GPU-bottlenecked scenarios. This works with any stretch mode and stretch aspect combination.
ru: Для рендеринга 3D-элементов с более низким разрешением, чем 2D-элементы (без необходимости использования отдельных областей просмотра), можно использовать поддержку Godot :ref:`resolution scaling <doc_resolution_scaling>`. Это хороший способ значительно повысить производительность в условиях ограниченных возможностей графического процессора. Этот подход работает с любым режимом растяжения и комбинацией аспектов растяжения.

source: For 3D games, consider exposing :ref:`doc_resolution_scaling` in the game's options menu to allow players to adjust the 3D rendering resolution separately from UI elements. This is useful for performance tuning, especially on lower-end hardware.
it: Per i giochi 3D, considera di esporre :ref:`doc_resolution_scaling` nel menu delle opzioni del gioco per consentire ai giocatori di regolare la risoluzione del rendering 3D separatamente dagli elementi dell'interfaccia utente. Questo è utile per ottimizzare le prestazioni, soprattutto su hardware di fascia bassa.
ru: Для 3D-игр рассмотрите возможность добавления параметра :ref:`doc_resolution_scaling` в меню настроек игры, чтобы игроки могли настраивать разрешение 3D-рендеринга отдельно от элементов пользовательского интерфейса. Это полезно для настройки производительности, особенно на слабом оборудовании.

source: Alternatively, if you're targeting high-end devices primarily, set the base window width to ``3840`` and window height to ``2160``. This allows you to provide higher resolution 2D assets, resulting in crisper visuals at the cost of higher memory usage and file sizes. You'll also want to increase **GUI > Theme > Default Theme Scale** to a value between ``2.0`` and ``3.0`` to ensure UI elements remain readable.
it: In alternativa, se l'obiettivo principale sono i dispositivi di fascia alta, imposta la larghezza base della finestra su ``3840`` e la sua altezza su ``2160``. Questo consente di fornire risorse 2D a risoluzione più elevata, risultando in immagini più nitide a scapito di un maggiore utilizzo di memoria e di dimensioni dei file. Consigliamo inoltre di aumentare **GUI > Tema > Scala di tema predefinita** a un valore compreso tra ``2.0`` e ``3.0`` per garantire che gli elementi dell'interfaccia utente rimangano leggibili.

source: Note that this will make non-mipmapped textures grainy on low resolution devices, so make sure to follow the instructions described in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.
it: Tieni presente che questo renderà le texture non mipmap granulose sui dispositivi a bassa risoluzione, quindi assicurati di seguire le istruzioni descritte in :ref:`doc_multiple_resolutions_reducing_aliasing_on_downsampling`.

source: Alternatively, if you're targeting high-end devices primarily, set the base window width to ``1920`` and window height to ``1080``. This allows you to provide higher resolution 2D assets, resulting in crisper visuals at the cost of higher memory usage and file sizes. Many devices have even higher resolution displays (1440p), but the difference with 1080p is barely visible given the small size of smartphone displays. You'll also want to increase **GUI > Theme > Default Theme Scale** to a value between ``1.5`` and ``2.0`` to ensure UI elements remain readable.
it: In alternativa, se l'obiettivo principale sono i dispositivi di fascia alta, imposta la larghezza base della finestra su ``1920`` e la sua altezza su ``1080``. Questo consente di fornire risorse 2D a risoluzione più elevata, risultando in immagini più nitide a scapito di un maggiore utilizzo di memoria e di dimensioni dei file. Molti dispositivi hanno display a risoluzione ancora più elevata (1440p), ma la differenza con 1080p è a malapena visibile, date le dimensioni ridotte dei display degli smartphone. Consigliamo inoltre di aumentare **GUI > Tema > Scala di tema predefinita** a un valore compreso tra ``1.5`` e ``2.0`` per garantire che gli elementi dell'interfaccia utente rimangano leggibili.

source: Alternatively, if you're targeting high-end devices primarily, set the base window width to ``1080`` and window height to ``1920``. This allows you to provide higher resolution 2D assets, resulting in crisper visuals at the cost of higher memory usage and file sizes. Many devices have even higher resolution displays (1440p), but the difference with 1080p is barely visible given the small size of smartphone displays. You'll also want to increase **GUI > Theme > Default Theme Scale** to a value between ``1.5`` and ``2.0`` to ensure UI elements remain readable.
it: In alternativa, se l'obiettivo principale sono i dispositivi di fascia alta, imposta la larghezza base della finestra su ``1080`` e la sua altezza su ``1080``. Questo consente di fornire risorse 2D a risoluzione più elevata, risultando in immagini più nitide a scapito di un maggiore utilizzo di memoria e di dimensioni dei file. Molti dispositivi hanno display a risoluzione ancora più elevata (1440p), ma la differenza con 1080p è a malapena visibile, date le dimensioni ridotte dei display degli smartphone. Consigliamo inoltre di aumentare **GUI > Tema > Scala di tema predefinita** a un valore compreso tra ``1.5`` e ``2.0`` per garantire che gli elementi dell'interfaccia utente rimangano leggibili.

source: Add a setting in the application's settings to change the root viewport's :ref:`stretch scale <doc_multiple_resolutions_stretch_scale>`, so that the UI can be made larger to account for hiDPI displays. See also the section on hiDPI support below.
it: Aggiungi un'impostazione nelle impostazioni dell'applicazione per cambiare la :ref:`scala di stiramento <doc_multiple_resolutions_stretch_scale>` della viewport radice, in modo che l'interfaccia utente si possa ingrandire per supportare i display hiDPI. Vedere anche la sezione sul supporto hiDPI qui sotto.

source: By default, Godot projects are considered DPI-aware by the operating system. This is controlled by the **Display > Window > DPI > Allow hiDPI** project setting, which should be left enabled whenever possible. Disabling DPI awareness can break fullscreen behavior on Windows.
it: Come predefinito, i progetti Godot sono considerati sensibili ai DPI dal sistema operativo. Questa impostazione è controllata dall'impostazione del progetto **Display > Window > DPI > Consenti hiDPI**, che si dovrebbe lasciare abilitata quando possibile. Disabilitare la sensibilità ai DPI può compromettere il funzionamento a schermo intero su Windows.
