Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/multiple_resolutions.po
Languages: ga, it, pt_br, ru, ta, uk, zh_cn, zh_tw

source: To support both portrait and landscape mode with a similar automatically determined scale factor, set your project's base resolution to be a *square* (1:1 aspect ratio) instead of a rectangle. For instance, if you wish to design for 1280×720 as the base resolution but wish to support both portrait and landscape mode, use 720×720 as the project's base window size in the Project Settings.
ga: Chun tacú le modh portráide agus tírdhreacha araon le fachtóir scála den chineál céanna a chinntear go huathoibríoch, socraigh buntaifeach do thionscadail mar *square *(cóimheas gné 1: 1) in ionad dronuilleog. Mar shampla, más mian leat dearadh do 1280×720 mar bhuntaifeach ach más mian leat tacú leis an modh portráide agus tírdhreacha araon, bain úsáid as 720×720 mar bhunmhéid fuinneoige an tionscadail i Socruithe an Tionscadail.
it: Per supportare la modalità sia verticale sia orizzontale con un fattore di scala simile determinato automaticamente, imposta la risoluzione base del progetto su un *quadrato* (rapporto d'aspetto 1:1) anziché su un rettangolo. Ad esempio, se desideri progettare con una risoluzione base di 1280×720 ma desideri supportare sia la modalità verticale che quella orizzontale, utilizza 720×720 come dimensioni base della finestra del progetto nelle Impostazioni del progetto.
ru: Чтобы поддерживать как портретный, так и альбомный режимы с одинаковым автоматически определяемым масштабом, установите базовое разрешение проекта как *квадрат* (соотношение сторон 1:1), а не как прямоугольник. Например, если вы хотите использовать базовое разрешение 1280×720, но при этом поддерживать как портретный, так и альбомный режимы, используйте 720×720 в качестве базового размера окна проекта в Настройках Проекта.
ta: ஒத்த தானாக நிர்ணயிக்கப்பட்ட அளவிலான காரணியுடன் உருவப்படம் மற்றும் இயற்கை பயன்முறை இரண்டையும் ஆதரிக்க, உங்கள் திட்டத்தின் அடிப்படை தீர்மானத்தை ஒரு செவ்வகத்திற்கு பதிலாக * சதுர * (1: 1 விகித விகிதம்) என அமைக்கவும். உதாரணமாக, நீங்கள் 1280 × 720 க்கு அடிப்படைத் தீர்மானமாக வடிவமைக்க விரும்பினால், ஆனால் உருவப்படம் மற்றும் இயற்கை பயன்முறை இரண்டையும் ஆதரிக்க விரும்பினால், திட்ட அமைப்புகளில் திட்டத்தின் அடிப்படை சாளர அளவாக 720 × 720 ஐப் பயன்படுத்தவும்.
uk: Щоб підтримувати як портретний, так і альбомний режими з однаковим автоматично визначеним коефіцієнтом масштабування, установіть базову роздільну здатність вашого проекту як *квадрат* (співвідношення сторін 1:1) замість прямокутника. Наприклад, якщо ви хочете розробити 1280×720 як базову роздільну здатність, але бажаєте підтримувати як портретний, так і альбомний режими, використовуйте 720×720 як базовий розмір вікна проекту в налаштуваннях проекту.
zh_cn: 为了以类似的自动确定的比例系数支持纵向和横向模式，请将你的项目的基本分辨率设置为 *方形* （1:1长宽比）而不是矩形。例如，如果你希望以1280×720为基本分辨率进行设计，但又希望同时支持纵向和横向模式，那么在项目设置中使用720×720作为项目的基本窗口尺寸。
zh_tw: 若要以自動縮放因子同時支援橫向與直向顯示，請將專案的基礎解析度設為 *正方形* （1:1 長寬比）而非矩形。例如你原本想用 1280×720 作為基礎解析度，但想同時支援直向與橫向，則可將專案的基礎視窗尺寸設成 720×720。

source: To allow the user to choose their preferred screen orientation at runtime, remember to set **Display > Window > Handheld > Orientation** to ``sensor``.
it: Per consentire all'utente di scegliere l'orientamento preferito dello schermo in fase di esecuzione, ricordarti di impostare **Display > Finestra > Portatile > Orientamento** su ``sensor``.
ru: Чтобы пользователь мог выбирать предпочтительную ориентацию экрана во время выполнения, не забудьте установить для параметра **Display > Window > Handheld > Orientation** значение ``sensor``.
ta: இயக்க நேரத்தில் பயனருக்கு விருப்பமான திரை நோக்குநிலையைத் தேர்வுசெய்ய, ** காட்சி> சாளரம்> கையடக்க> நோக்குநிலை ** ஐ `` சென்சார்`` க்கு அமைக்க நினைவில் கொள்ளுங்கள்.
zh_tw: 若要讓玩家能於執行時自由選擇螢幕方向，記得將 **Display > Window > Handheld > Orientation** 設為 ``sensor``。

source: To configure the stretch aspect at runtime from a script, use the ``get_tree().root.content_scale_aspect`` property (see :ref:`Window.content_scale_aspect <class_Window_property_content_scale_aspect>` and the :ref:`ContentScaleAspect <enum_Window_ContentScaleAspect>` enum).
ga: Chun an ghné stráice ag am rite a chumrú ó script, úsáid an t-airí ``get_tree().root.content_scale_aspect`` (féach :ref:`Window.content_scale_aspect <class_Window_property_content_scale_aspect>` agus an :ref:`ContentScaleAspect <_Aspect_Scale_aspect>` ).
it: Per configurare l'aspetto di stiramento in fase di esecuzione da uno script, utilizzare la proprietà ``get_tree().root.content_scale_aspect`` (vedere :ref:`Window.content_scale_aspect <class_Window_property_content_scale_aspect>` e l'enumerazione :ref:`ContentScaleAspect <enum_Window_ContentScaleAspect>`).
ru: Чтобы настроить аспект растяжения во время выполнения из скрипта, используйте свойство ``get_tree().root.content_scale_aspect`` (см. :ref:`Window.content_scale_aspect <class_Window_property_content_scale_aspect>` и перечисление :ref:`ContentScaleAspect <enum_Window_ContentScaleAspect>`).
ta: ஒரு ச்கிரிப்ட்டிலிருந்து இயக்க நேரத்தில் நீட்டிக்க அம்சத்தை உள்ளமைக்க, `` get_tree (). Root.content_scale_aspect`` சொத்து (பார்க்க: `சாளரம். ).
uk: Щоб налаштувати розтягнутий аспект під час виконання зі сценарію, використовуйте властивість ``get_tree().root.content_scale_aspect`` (див. :ref:`Window.content_scale_aspect <class_Window_property_content_scale_aspect>` та :ref:`ContentScaleAspect <enum_Window_ContentScaleAspect>` enum ).
zh_cn: 要在运行时从脚本配置拉伸纵横比，请使用 ``get_tree().root.content_scale_aspect`` 属性（参见 :ref:`Window.content_scale_aspect <class_Window_property_content_scale_aspect>` 和 :ref:`ContentScaleAspect <enum_Window_ContentScaleAspect>` 枚举）。
zh_tw: 若要於執行期間以腳本設定拉伸比例，請使用 ``get_tree().root.content_scale_aspect`` 屬性（參考 :ref:`Window.content_scale_aspect <class_Window_property_content_scale_aspect>` 和 :ref:`ContentScaleAspect <enum_Window_ContentScaleAspect>` 列舉）。

source: Stretch Scale
ga: Scála Sín
it: Scala di stiramento
ru: Масштаб растяжения
ta: நீட்டிக்க அளவு
uk: Розтягнути шкалу
zh_cn: 拉伸缩放
zh_tw: 縮放比例

source: The **Scale** setting allows you to add an extra scaling factor on top of what the **Stretch** options above already provide. The default value of ``1.0`` means that no additional scaling occurs.
ga: Ligeann an socrú ** Scale ** duit fachtóir scálú breise a chur leis ar bharr an méid a sholáthraíonn na roghanna **Stretch ** thuas cheana féin. Ciallaíonn luach réamhshocraithe ''1.0'' nach dtarlaíonn aon scálú breise.
it: L'impostazione **Scala** consente di aggiungere un fattore di scala in più a quello già fornito dalle opzioni di **Stiramento** sopra. Il valore predefinito ``1.0`` significa che non avviene alcun ridimensionamento aggiuntivo.
ru: Параметр **Scale** позволяет добавить дополнительный коэффициент масштабирования к уже существующему коэффициенту **Stretch**. Значение по умолчанию ``1.0`` означает, что дополнительное масштабирование не производится.
ta: ** அளவுகோல் ** மேலே உள்ள ** நீட்சி ** விருப்பங்கள் ஏற்கனவே வழங்கியவற்றின் மேல் கூடுதல் அளவிடுதல் காரணியைச் சேர்க்க உங்களை அனுமதிக்கிறது. `` 1.0`` இன் இயல்புநிலை மதிப்பு கூடுதல் அளவிடுதல் ஏற்படாது என்பதாகும்.
uk: Налаштування **Масштаб** дозволяє додати додатковий коефіцієнт масштабування на додаток до того, що вже надано параметрами **Розтягнути** вище. Значення за замовчуванням ``1.0`` означає, що додаткове масштабування не відбувається.
zh_cn: **设置**\ 设置允许你在上面\ **拉伸**\ 选项已提供的内容之上添加额外的缩放系数。默认值 ``1.0`` 意味着不会发生额外的缩放。
zh_tw: **Scale**（縮放比例）設定可讓你在上述 **Stretch** 選項的基礎上再額外加上一個縮放因子。預設值 ``1.0`` 代表不額外縮放。

source: For example, if you set **Scale** to ``2.0`` and leave **Stretch Mode** on **Disabled**, each unit in your scene will correspond to 2×2 pixels on the screen. This is a good way to provide scaling options for non-game applications.
ga: Mar shampla, má shocraíonn tú **Scale ** go ''2.0'' agus má fhágann tú **Mód Sín ** ar **Díchumasaithe**, comhfhreagraíonn gach aonad i do radharc do 2×2 picteilín ar an scáileán. Is bealach maith é seo chun roghanna scálaithe a sholáthar d'iarratais neamh-chluiche.
it: Ad esempio, se imposti **Scala** su ``2.0`` e lasci **Modalità di stiramento** su **Disabled**, ogni unità nella scena corrisponderà a 2×2 pixel sullo schermo. Questo è un buon modo per fornire opzioni di ridimensionamento per le applicazioni non di gioco.
ru: Например, если установить **Scale** на ``2.0`` и оставить **Stretch Mode** на **Disabled**, каждая единица измерения в сцене будет соответствовать 2×2 пикселям на экране. Это хороший способ обеспечить возможности масштабирования для неигровых приложений.
ta: எடுத்துக்காட்டாக, நீங்கள் ** அளவுகோல் ** ஐ `` 2.0`` வரை அமைத்து, ** முடக்கப்பட்ட ** இல் ** நீட்டிக்கப்பட்ட பயன்முறையை ** விட்டுவிட்டால், உங்கள் காட்சியில் உள்ள ஒவ்வொரு அலகு திரையில் 2 × 2 பிக்சல்களுடன் ஒத்திருக்கும். விளையாட்டு அல்லாத பயன்பாடுகளுக்கு அளவிடுதல் விருப்பங்களை வழங்க இது ஒரு சிறந்த வழியாகும்.
uk: Наприклад, якщо ви встановите **Масштаб** на ``2.0`` і залишите **Режим розтягування** на **Вимкнено**, кожна одиниця у вашій сцені відповідатиме 2×2 пікселям на екрані. Це хороший спосіб надати параметри масштабування для неігрових програм.
zh_cn: 例如，如果你将 **Scale** 设置为 ``2.0`` 并将 **Stretch Mode** 保留为 **Disabled**\ ，则场景中的每个单元将对应屏幕上的 2×2 像素。这是为非游戏应用程序提供缩放选项的好方式。
zh_tw: 例如，若設定 **Scale** 為 ``2.0`` 且 **Stretch Mode** 維持 **Disabled**，則場景中每個單位會對應螢幕上的 2×2 像素。這在非遊戲應用中是提供縮放選項的好方式。

source: If **Stretch Mode** is set to **canvas_items**, 2D elements will be scaled relative to the base window size, then multiplied by the **Scale** setting. This can be exposed to players to allow them to adjust the automatically determined scale to their liking, for better accessibility.
ga: Má tá ** Mód Sín ** socraithe go ** canvas_items **, déanfar eilimintí 2D a scála i gcoibhneas le méid na fuinneoige bonn, ansin iolraithe faoin socrú ** Scale **. Is féidir é seo a nochtadh d'imreoirí chun ligean dóibh an scála a chinntear go huathoibríoch a choigeartú dá liking, le haghaidh inrochtaineacht níos fearr.
it: Se **Modalità di stiramento** è impostata su **canvas_items**, gli elementi 2D saranno ridimensionati in base alle dimensioni della finestra di base, quindi moltiplicati per l'impostazione **Scala**. Questa impostazione si può esporre ai giocatori per consentire loro di adattare la scala determinata automaticamente a proprio piacimento, per una migliore accessibilità.
ru: Если для параметра **Stretch Mode** задано значение **canvas_items**, 2D-элементы будут масштабироваться относительно базового размера окна, а затем умножаться на значение параметра **Scale**. Игрокам будет предоставлена возможность настроить автоматически определяемый масштаб по своему усмотрению для лучшей доступности.
ta: ** நீட்சி பயன்முறை ** ** Canvas_items ** என அமைக்கப்பட்டால், அடிப்படை சாளர அளவோடு ஒப்பிடும்போது 2D கூறுகள் அளவிடப்படும், பின்னர் ** அளவுகோல் ** அமைப்பால் பெருக்கப்படும். சிறந்த அணுகலுக்காக, தானாக நிர்ணயிக்கப்பட்ட அளவை அவர்களின் விருப்பப்படி சரிசெய்ய அனுமதிக்க இது வீரர்களுக்கு வெளிப்படும்.
uk: Якщо для **Режиму розтягування** встановлено значення **canvas_items**, 2D-елементи буде масштабовано відносно розміру базового вікна, а потім помножено на параметр **Масштаб**. Це може бути відкрито для гравців, щоб дозволити їм налаштувати автоматично визначений масштаб на свій смак, для кращої доступності.
zh_cn: 如果将 **Stretch Mode** 设置为 **canvas_items**\ ，2D 元素将相对于基本窗口大小进行缩放，然后乘以 **Scale** 设置。这可以向玩家公开，以允许他们根据自己的喜好调整自动确定的比例，从而获得更好的可访问性。
zh_tw: 若 **Stretch Mode** 設為 **canvas_items**，2D 元素會依基礎視窗大小縮放，然後再乘上 **Scale** 設定。這個參數也可以讓玩家自由調整，以符合不同需求。

source: If **Stretch Mode** is set to **viewport**, the viewport's resolution is divided by **Scale**. This makes pixels look larger and reduces rendering resolution (with a given window size), which can improve performance.
ga: Má tá **Mód Sín ** socraithe go **viewport**, roinntear taifeach an viewport ar **Scale**. Fágann sé seo go bhfuil cuma níos mó ar phicteilíní agus laghdaíonn sé taifeach rindreáil (le méid fuinneoige ar leith), ar féidir leo feidhmíocht a fheabhsú.
it: Se **Modalità di stiramento** è impostata su **viewport**, la risoluzione della viewport è divisa per **Scala**. Questo fa apparire i pixel più grandi e riduce la risoluzione di rendering (con determinate dimensioni della finestra), il che può migliorare le prestazioni.
ru: Если для параметра **Stretch Mode** задано значение **viewport**, разрешение области просмотра делится на **Scale**. Это увеличивает размер пикселей и снижает разрешение рендеринга (при заданном размере окна), что может повысить производительность.
ta: ** நீட்டிப்பு பயன்முறை ** ** ViewPort ** என அமைக்கப்பட்டால், வியூபோர்ட்டின் தீர்மானம் ** அளவுகோல் ** ஆல் வகுக்கப்படுகிறது. இது படப்புள்ளிகள் பெரிதாக தோற்றமளிக்கிறது மற்றும் வழங்குதல் தெளிவுத்திறனைக் குறைக்கிறது (கொடுக்கப்பட்ட சாளர அளவுடன்), இது செயல்திறனை மேம்படுத்தலாம்.
uk: Якщо **Режим розтягування** встановлено на **вікно перегляду**, роздільна здатність вікна перегляду ділиться на **Масштаб**. Це робить пікселі більшими та зменшує роздільну здатність візуалізації (із заданим розміром вікна), що може покращити продуктивність.
zh_cn: 如果将 **Stretch Mode** 设置为 **viewport**\ ，则视口的分辨率将除以 **Scale**\ 。这会使像素看起来更大，并降低渲染分辨率（在给定窗口大小的情况下），从而可以提高性能。
zh_tw: 若 **Stretch Mode** 設為 **viewport**，則視口解析度會除以 **Scale**。這會讓像素看起來更大，並降低算繪解析度（在相同視窗大小下），可提升效能。

source: To configure the stretch scale at runtime from a script, use the ``get_tree().root.content_scale_factor`` property (see :ref:`Window.content_scale_factor <class_Window_property_content_scale_factor>`).
ga: Chun an scála stráice ag am rite a chumrú ó script, úsáid an t-airí ``get_tree().root.content_scale_factor`` (féach :ref:`Window.content_scale_factor <class_Window_property_content_scale_factor>`).
it: Per configurare la scala di stiramento in fase di esecuzione da uno script, utilizzare la proprietà ``get_tree().root.content_scale_factor`` (vedere :ref:`Window.content_scale_factor <class_Window_property_content_scale_factor>`).
ru: Чтобы настроить масштаб растяжения во время выполнения из скрипта, используйте свойство ``get_tree().root.content_scale_factor`` (см. :ref:`Window.content_scale_factor <class_Window_property_content_scale_factor>`).
ta: ச்கிரிப்டிலிருந்து இயக்க நேரத்தில் நீட்டிக்க அளவை உள்ளமைக்க, `` get_tree (). Root.content_scale_factor`` சொத்து (பார்க்க: `சாளரம்.
uk: Щоб налаштувати розтягнутий масштаб під час виконання зі сценарію, скористайтеся властивістю ``get_tree().root.content_scale_factor`` (див. :ref:`Window.content_scale_factor <class_Window_property_content_scale_factor>`).
zh_cn: 要从脚本在运行时配置拉伸比例，请使用 ``get_tree().root.content_scale_factor`` 属性（参见 :ref:`Window.content_scale_factor <class_Window_property_content_scale_factor>`\ ）。
zh_tw: 若要於執行期間以腳本設定縮放比例，請使用 ``get_tree().root.content_scale_factor`` 屬性（參考 :ref:`Window.content_scale_factor <class_Window_property_content_scale_factor>`）。

source: Stretch Scale Mode
ga: Mód Scála Sín
it: Modalità di scala di stiramento
ru: Режим Растяжения Шкалы
ta: அளவிலான அளவிலான பயன்முறையை நீட்டவும்
uk: Режим розтягування масштабу
zh_cn: 拉伸缩放模式
zh_tw: 縮放模式

source: Since Godot 4.2, the **Stretch Scale Mode** setting allows you to constrain the automatically determined scale factor (as well as the manually specified **Stretch Scale** setting) to integer values. By default, this setting is set to ``fractional``, which allows any scale factor to be applied (including fractional values such as ``2.5``). When set to ``integer``, the value is rounded down to the nearest integer. For example, instead of using a scale factor of ``2.5``, it would be rounded down to ``2.0``. This is useful to prevent distortion when displaying pixel art.
ga: Ós rud é Godot 4.2, ceadaíonn an ** Mód Scála Sín ** socrú duit srian a chur ar an bhfachtóir scála a chinntear go huathoibríoch (chomh maith leis an socrú ** Scála Sín ** a shonraítear de láimh) go luachanna slánuimhir. De réir réamhshocraithe, socraítear an socrú seo mar ''codánach'', a cheadaíonn aon fhachtóir scála a chur i bhfeidhm (lena n-áirítear luachanna codánacha amhail ''2.5''). Nuair a shocraítear é go ''slánuimhir'', déantar an luach a shlánú síos go dtí an tslánuimhir is gaire. Mar shampla, in ionad fachtóir scála ''2.5'' a úsáid, dhéanfaí é a shlánú síos go dtí ''2.0''. Tá sé seo úsáideach chun saobhadh a chosc agus ealaín picteilín á taispeáint.
it: A partire da Godot 4.2, l'impostazione **Modalità di scala di stiramento** consente di limitare il fattore di scala determinato automaticamente (così come l'impostazione **Scala di stiramento** specificata manualmente) a valori interi. Normalmente, questa impostazione è impostata su ``fractional``, il che consente di applicare qualsiasi fattore di scala (inclusi valori frazionari come ``2.5``). Quando è impostata su ``integer``, il valore è arrotondato per difetto all'intero più vicino. Ad esempio, invece di utilizzare un fattore di scala di ``2.5``, sarebbe arrotondato per difetto a ``2.0``. Questo è utile per evitare distorsioni quando si mostra pixel art.
ru: Начиная с Godot 4.2, параметр **Stretch Scale Mode** позволяет ограничить автоматически определяемый масштабный коэффициент (а также заданный вручную параметр **Stretch Scale**) целыми значениями. По умолчанию этот параметр установлен на ``fractional``, что позволяет применять любой масштабный коэффициент (включая дробные значения, например, ``2.5``). При выборе значения ``integer`` значение округляется до ближайшего целого числа. Например, вместо коэффициента ``2.5`` оно будет округлено до ``2.0``. Это полезно для предотвращения искажений при отображении пиксельной графики.
ta: கோடோட் 4.2 என்பதால், ** நீட்டிப்பு அளவுகோல் பயன்முறை ** அமைப்பு தானாக நிர்ணயிக்கப்பட்ட அளவிலான காரணி (அத்துடன் கைமுறையாக குறிப்பிடப்பட்ட ** நீட்டிக்க அளவு ** அமைப்பையும்) முழு மதிப்புகளுக்கு கட்டுப்படுத்த உங்களை அனுமதிக்கிறது. இயல்பாக, இந்த அமைப்பு `` பகுதியளவு`` ஆக அமைக்கப்பட்டுள்ளது, இது எந்தவொரு அளவிலான காரணியைப் பயன்படுத்த அனுமதிக்கிறது (`` 2.5`` போன்ற பகுதியளவு மதிப்புகள் உட்பட). `` முழு எண்`` என அமைக்கப்பட்டால், மதிப்பு அருகிலுள்ள முழு எண் வரை வட்டமிடப்படுகிறது. எடுத்துக்காட்டாக, `` 2.5`` அளவிலான காரணியைப் பயன்படுத்துவதற்குப் பதிலாக, அது `` 2.0`` வரை வட்டமிடப்படும். படப்புள்ளி கலையை காண்பிக்கும் போது விலகலைத் தடுக்க இது பயனுள்ளதாக இருக்கும்.
uk: Починаючи з Godot 4.2, параметр **Режим розтягування масштабу** дозволяє вам обмежити автоматично визначений масштабний коефіцієнт (а також заданий вручну параметр **Розтягнення масштабу**) до цілих значень. За замовчуванням для цього параметра встановлено значення ``fractional``, що дозволяє застосовувати будь-який коефіцієнт масштабування (включно з дробовими значеннями, наприклад ``2,5``). Якщо встановлено значення ``integer``, значення округлюється до найближчого цілого числа. Наприклад, замість використання коефіцієнта масштабування ``2,5`` його буде округлено до ``2,0``. Це корисно, щоб запобігти спотворенню під час відображення піксельного зображення.
zh_cn: 自 Godot 4.2 起，\ **拉伸比例模式**\ 设置允许你将自动确定的比例系数（以及手动指定的\ **拉伸比例**\ 设置）限制为整数值。默认情况下，该设置设置为 ``fractional``\ ，允许应用任何比例系数（包括如 ``2.5`` 等小数值）。设置为 ``integer`` 时，该值将向下舍入为最接近的整数。例如，不使用比例系数 ``2.5``\ ，而是向下舍入为 ``2.0``\ 。这对于防止显示像素艺术时出现失真很有用。
zh_tw: 從 Godot 4.2 開始，**Stretch Scale Mode**（縮放模式）可以把自動判斷的縮放因子（以及手動指定的 **Stretch Scale** 設定）限制為整數。預設值為 ``fractional``，代表可以套用任何縮放倍數（包含像 ``2.5`` 這種小數）。若設為 ``integer``，則會自動向下取整數。例如原本縮放因子是 ``2.5``，會被取為 ``2.0``。這對顯示像素美術時避免失真非常有幫助。

source: Compare this pixel art which is displayed with the ``viewport`` stretch mode, with the stretch scale mode set to ``fractional``:
ga: Déan comparáid idir an ealaín picteilín seo a thaispeántar leis an mód stráice ''viewport'', agus an modh scála sínte socraithe go ''codánach'':
it: Confronta questa pixel art visualizzata con la modalità di stiramento ``viewport``, con la modalità di scala di stiramento impostata su ``fractional``:
ru: Сравните это пиксельное изображение, отображаемое в режиме растяжения ``viewport``, при этом режим растяжения масштаба установлен на ``fractional``:
ta: `` ViewPort`` நீட்டிக்க பயன்முறையுடன் காட்டப்படும் இந்த படப்புள்ளி கலையை ஒப்பிடுக, நீட்டிக்க அளவுகோல் பயன்முறையுடன் `` பகுதியளவு``:
uk: Порівняйте це піксельне зображення, яке відображається в режимі розтягування вікна перегляду, з режимом розтягування масштабу, встановленим на `` дробове``:
zh_cn: 比较使用 ``viewport`` 拉伸模式显示的像素艺术，其拉伸比例模式设置为 ``fractional``\ ：
zh_tw: 請比較下列以 ``viewport`` 拉伸模式搭配 ``fractional`` 縮放模式顯示的像素美術：

source: Fractional scaling example (incorrect pixel art appearance)
ga: Sampla scálaithe codánach (cuma mhícheart ealaíne picteilín)
it: Esempio di ridimensionamento frazionario (aspetto errato della pixel art)
ru: Пример дробного масштабирования (неправильный вид пиксельной графики)
ta: பகுதியளவு அளவிடுதல் எடுத்துக்காட்டு (தவறான படப்புள்ளி கலை தோற்றம்)
uk: Приклад дробового масштабування (неправильний вигляд піксельного зображення)
zh_cn: 小数缩放示例（像素画显示异常）
zh_tw: 小數縮放範例（像素美術顯示異常）

source: Checkerboard doesn't look "even". Line widths in the logo and text varies wildly.
ga: Níl cuma "fiú" ar Checkerboard. Athraíonn leithead líne sa lógó agus sa téacs go fiáin.
it: La scacchiera non ha un aspetto "uniforme". Lo spessore delle linee nel logo e nel testo varia notevolmente.
ru: Шахматная доска не выглядит "ровной". Толщина линий в логотипе и тексте сильно различается.
ta: செக்கர்போர்டு "கூட" தெரியவில்லை. லோகோ மற்றும் உரையில் வரி அகலங்கள் பெருமளவில் மாறுபடும்.
uk: Шашка виглядає не «рівно». Ширина ліній у логотипі та тексті дуже різна.
zh_cn: 棋盘看上去并不“均匀”。徽标和文本中的线宽也存在大幅变化。
zh_tw: 棋盤格顯示不均勻，Logo 與文字線條寬度變化很大。

source: This pixel art is also displayed with the ``viewport`` stretch mode, but the stretch scale mode is set to ``integer`` this time:
ga: Taispeántar an ealaín picteilín seo leis an modh stráice ''viewport'', ach tá an modh scála stráice socraithe go ''slánuimhir'' an uair seo:
it: Questa pixel art è visualizzata anche con la modalità di stiramento ``viewport``, ma questa volta la modalità di scala di stiramento è impostata su ``integer``:
ru: Этот пиксельный рисунок также отображается в режиме растяжения ``viewport``, но на этот раз режим растяжения масштаба установлен на ``integer``:
ta: இந்த படப்புள்ளி கலை `` ViewPort`` நீட்டிக்க பயன்முறையிலும் காட்டப்படுகிறது, ஆனால் நீட்டிக்க அளவிலான பயன்முறை இந்த நேரத்தில் `` முழு எண்` `ஆக அமைக்கப்பட்டுள்ளது:
uk: Це піксельне зображення також відображається в режимі розтягування ``viewport``, але цього разу режим розтягування масштабу встановлено на ``integer``:
zh_cn: 该像素艺术也以 ``viewport`` 拉伸模式显示，但这次拉伸比例模式设置为 ``integer``\ ：
zh_tw: 同一張像素美術改用 ``viewport`` 拉伸模式且縮放模式設為 ``integer`` 時：

source: Integer scaling example (correct pixel art appearance)
ga: Sampla scálú slánuimhir (cuma cheart ealaíne picteilín)
it: Esempio di ridimensionamento intero (aspetto corretto della pixel art)
ru: Пример целочисленного масштабирования (правильный вид пиксельной графики)
ta: முழு எண் அளவிடுதல் எடுத்துக்காட்டு (சரியான படப்புள்ளி கலை தோற்றம்)
uk: Приклад цілочисельного масштабування (правильний вигляд піксельного зображення)
zh_cn: 整数缩放示例（像素画正确显示）
zh_tw: 整數縮放範例（像素美術正確顯示）

source: Checkerboard looks perfectly even. Line widths are consistent.
ga: Breathnaíonn Checkerboard breá fiú. Tá leithead líne comhsheasmhach.
it: La scacchiera appare perfettamente uniforme. Gli spessori delle linee sono uniformi.
ru: Шахматная доска выглядит идеально ровной. Толщина линий одинаковая.
ta: செக்கர்போர்டு சரியாக கூட தெரிகிறது. வரி அகலங்கள் சீரானவை.
uk: Шашка виглядає ідеально рівно. Ширина ліній однакова.
zh_cn: 棋盘看上去就非常均匀了。线宽也是一致的。
zh_tw: 棋盤格顯示均勻，線條寬度一致。
