Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/collision_shapes_2d.po
Languages: ga, it, ja, ru, ta, uk, zh_hans, zh_tw

source: You can generate a concave collision shape from the editor by selecting a Sprite2D and using the **Sprite2D** menu at the top of the 2D viewport. The Sprite2D menu dropdown exposes an option called **Create CollisionPolygon2D Sibling**. Once you click it, it displays a menu with 3 settings:
ga: Is féidir leat cruth imbhuailte concave a ghiniúint ón eagarthóir trí Sprite2D a roghnú agus an roghchlár **Sprite2D** a úsáid ag barr an radharc 2D. Nochtann anuas an roghchlár Sprite2D rogha ar a dtugtar **Create CollisionPolygon2D Sibling**. Nuair a chliceálann tú air, taispeánann sé roghchlár le 3 shocrú:
ja: エディタから Sprite2D を選択し、2D ビューポート上部の **Sprite2D** メニューを使用することで、凹型のコリジョン形状を生成できます。Sprite2Dメニューのドロップダウンには、**CollisionPolygon2Dの兄弟を作成** というオプションがあります。これをクリックすると、3つの設定が表示されます。
ru: Вы можете создать вогнутую форму столкновения в редакторе, выбрав Sprite2D и воспользовавшись меню **Sprite2D** в верхней части 2D-окна просмотра. В раскрывающемся меню Sprite2D есть пункт **Create CollisionPolygon2D Sibling**. При нажатии на него открывается меню с тремя настройками:
ta: ச்பிரிட் 2 டி ஐத் தேர்ந்தெடுத்து, 2 டி வியூபோர்ட்டின் மேற்புறத்தில் ** ச்ப்ரைட் 2 டி ** மெனுவைப் பயன்படுத்துவதன் மூலம் எடிட்டரிடமிருந்து ஒரு குழிவான மோதல் வடிவத்தை நீங்கள் உருவாக்கலாம். ச்ப்ரைட் 2 டி பட்டியல் கீழ்தோன்றல் ** எனப்படும் ஒரு விருப்பத்தை அம்பலப்படுத்துகிறது. நீங்கள் அதைக் சொடுக்கு செய்ததும், 3 அமைப்புகளுடன் ஒரு மெனுவைக் காண்பிக்கும்:
uk: Ви можете створити увігнуту форму зіткнення з редактора, вибравши Sprite2D і скориставшись меню **Sprite2D** у верхній частині вікна перегляду 2D. Розкривне меню Sprite2D відкриває опцію під назвою **Create CollisionPolygon2D Sibling**. Коли ви натискаєте його, відображається меню з 3 налаштуваннями:
zh_hans: 你可以通过选择 Sprite2D，并使用 2D 视口顶部的 **Sprite2D** 菜单，从编辑器生成凹碰撞形状。Sprite2D 菜单下拉菜单显示一个名为 **创建 CollisionPolygon2D 同级节点** 的选项。点击它后，它会显示一个包含 3 个设置的菜单：
zh_tw: 你可以在編輯器中選取 Sprite2D，然後於 2D 視窗上方的 **Sprite2D** 選單中選擇**建立 CollisionPolygon2D 同級**，即可自動產生凹形碰撞形狀。此選項會出現三個設定：

source: **Simplification:** Higher values will result in a less detailed shape, which improves performance at the cost of accuracy.
ga: **Simpliú: ** Beidh cruth chomh mionsonraithe mar thoradh ar luachanna níos airde, a fheabhsaíonn feidhmíocht ar chostas cruinneas.
it: **Semplificazione:** valori più elevati produrranno una forma meno dettagliata, il che migliora le prestazioni a scapito della precisione.
ja: \ **簡略化:** 値を大きくすると形状の詳細が少なくなり、精度を犠牲にする代わりにパフォーマンスが向上します。
ru: **Simplification (Упрощение):** Более высокие значения приведут к менее детальной форме, что повысит производительность за счет точности.
ta: ** எளிமைப்படுத்தல்: ** அதிக மதிப்புகள் குறைந்த விரிவான வடிவத்தை ஏற்படுத்தும், இது துல்லியத்தின் செலவில் செயல்திறனை மேம்படுத்துகிறது.
uk: **Спрощення:** вищі значення призведуть до менш детальної форми, що покращує продуктивність ціною точності.
zh_hans: **简化：**\ 较高的值将导致形状的细节较少，从而以准确性为代价来提高性能。
zh_tw: **簡化：** 數值越高，形狀越簡化，有助提升效能但降低精度。

source: **Shrink (Pixels):** Higher values will shrink the generated collision polygon relative to the sprite's edges.
ga: ** Laghdaigh (Picteilíní) :** Laghdóidh luachanna níos airde an polagún imbhuailte ginte i gcoibhneas le himill an sprite.
ja: \ **縮小(ピクセル):** 値を大きくすると、生成されるコリジョンポリゴンがスプライトのエッジに対して縮小されます。
ru: **Shrink (Сжатие) (пикселы):** Более высокие значения сжимают созданный полигон столкновения относительно краев спрайта.
ta: ** சுருக்கம் (பிக்சல்கள்): ** உயர் மதிப்புகள் ச்ப்ரைட்டின் விளிம்புகளுடன் ஒப்பிடும்போது உருவாக்கப்பட்ட மோதல் பலகோணத்தை சுருக்கிவிடும்.
uk: **Зменшити (пікселі):** Вищі значення зменшать створений багатокутник зіткнення відносно країв спрайту.
zh_hans: **收缩（像素）：**\ 较高的值将使生成的碰撞多边形相对于精灵的边缘收缩。
zh_tw: **縮小（像素）：** 數值越高，碰撞多邊形會比原始圖片邊緣更內縮。

source: **Grow (Pixels):** Higher values will grow the generated collision polygon relative to the sprite's edges. Note that setting Grow and Shrink to equal values may yield different results than leaving both of them on 0.
ga: **Fás (Picteilín):** Fásfaidh luachanna níos airde an polagán imbhuailte ginte i gcoibhneas le himill an sprite. Tabhair faoi deara go bhféadfadh torthaí difriúla a bheith mar thoradh ar Fás agus Laghdaigh a shocrú go luachanna comhionanna seachas an dá cheann a fhágáil ar 0.
ja: \ **拡大(ピクセル):** 値を大きくすると、生成される衝突ポリゴンがスプライトのエッジに対して拡大されます。なお、拡大と縮小を同じ値に設定すると、両方を0にした場合とは異なる結果になることがあります。
ru: **Grow (Pixels):** Более высокие значения увеличат размер сгенерированного полигона столкновения относительно краёв спрайта. Обратите внимание, что установка одинаковых значений Grow и Shrink может привести к результатам, отличным от тех, которые указаны для обоих параметров, равными 0.
ta: ** வளருங்கள் (பிக்சல்கள்): ** உயர் மதிப்புகள் ச்பிரிட்டின் விளிம்புகளுடன் ஒப்பிடும்போது உருவாக்கப்பட்ட மோதல் பலகோணத்தை வளர்க்கும். இரண்டையும் 0 இல் விட்டுவிடுவதை விட அமைப்பு வளர்ந்து சம மதிப்புகளுக்கு சுருங்குவதை விட வெவ்வேறு முடிவுகளைத் தரக்கூடும் என்பதை நினைவில் கொள்க.
uk: **Зростання (пікселі):** Вищі значення збільшать згенерований багатокутник зіткнення відносно країв спрайту. Зауважте, що встановлення рівних значень Grow і Shrink може дати інші результати, ніж якщо залишити обидва на 0.
zh_hans: **增长（像素）：**\ 数值越大，生成的碰撞多边形就越会相对于精灵边缘增长。需要注意的是，将 “增长 ”和 “收缩 ”设置为相等的值，产生的结果可能会与将它们都设置为 0 的结果不同。
zh_tw: **擴大（像素）：** 數值越高，碰撞多邊形會比原始圖片邊緣更外擴。注意：將擴大與縮小設為相同數值，結果可能和都設為 0 不同。

source: If you have an image with many small details, it's recommended to create a simplified version and use it to generate the collision polygon. This can result in better performance and game feel, since the player won't be blocked by small, decorative details.
ga: Má tá íomhá agat le go leor sonraí beaga, moltar leagan simplithe a chruthú agus é a úsáid chun an polagún imbhuailte a ghiniúint. D'fhéadfadh feidhmíocht níos fearr agus mothú cluiche a bheith mar thoradh air seo, ós rud é nach gcuirfidh sonraí beaga maisiúla bac ar an imreoir.
it: Se si dispone di un'immagine con molti piccoli dettagli, consigliamo di crearne una versione semplificata e usarla per generare il poligono di collisione. Ciò può migliorare le prestazioni e l'esperienza di gioco, poiché il giocatore non sarà bloccato da piccoli dettagli decorativi.
ja: 画像に細かいディテールが多い場合は、簡略化されたバージョンを作成し、それを使ってコリジョンポリゴンを生成することをおすすめします。これにより、パフォーマンスやゲームプレイの感やが向上します。これはプレイヤーが小さく装飾的なディテールに邪魔されることを防ぐためです。
ru: Если у вас есть изображение с множеством мелких деталей, рекомендуется создать его упрощённую версию и использовать её для генерации полигона столкновения. Это может повысить производительность и улучшить игровые ощущения, поскольку игрок не будет перекрыт мелкими декоративными деталями.
ta: உங்களிடம் பல சிறிய விவரங்கள் இருந்தால், எளிமைப்படுத்தப்பட்ட பதிப்பை உருவாக்கி, மோதல் பலகோணத்தை உருவாக்க அதைப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது. இது சிறந்த செயல்திறன் மற்றும் விளையாட்டு உணர்வை ஏற்படுத்தும், ஏனெனில் சிறிய, அலங்கார விவரங்களால் வீரர் தடுக்கப்பட மாட்டார்.
uk: Якщо у вас є зображення з великою кількістю дрібних деталей, рекомендується створити спрощену версію та використовувати її для генерації багатокутника зіткнень. Це може призвести до кращої продуктивності та відчуття від гри, оскільки гравець не буде заблокований дрібними декоративними деталями.
zh_hans: 如果你的图片包含许多小细节，建议创建一个简化版本并使用它来生成碰撞多边形。这样可以带来更好的性能表现和游戏体验，因为玩家不会被小小的、装饰性的细节阻碍。
zh_tw: 如果圖片細節繁多，建議製作簡化版並用來產生碰撞多邊形，這樣效能與遊戲手感都會更好，玩家也不會被細小裝飾卡住。

source: To use a separate image for collision polygon generation, create another Sprite2D, generate a collision polygon sibling from it then remove the Sprite2D node. This way, you can exclude small details from the generated collision.
ga: Chun íomhá ar leithligh a úsáid le haghaidh giniúint polagán imbhuailte, cruthaigh Sprite2D eile, cruthaigh deartháir polagún imbhuailte uaidh ansin bain an nód Sprite2D. Ar an mbealach seo, is féidir leat sonraí beaga a eisiamh ón imbhualadh a ghintear.
it: Per utilizzare un'immagine separata per la generazione del poligono di collisione, creare un altro Sprite2D, generare un poligono di collisione fratello da esso, infine rimuovere il nodo Sprite2D. Così si possono escludere i piccoli dettagli dalla collisione generata.
ja: コリジョンポリゴンの生成に別の画像を使用する場合、別のSprite2Dを作成し、それから衝突ポリゴンの兄弟ノードを生成して、Sprite2Dノードを削除します。この方法で、生成された衝突から小さなディテールを除外することができます。
ru: Чтобы использовать отдельное изображение для генерации полигона столкновения, создайте ещё один Sprite2D, сгенерируйте на его основе полигон столкновения, а затем удалите узел Sprite2D. Таким образом, вы сможете исключить мелкие детали из генерируемого полигона столкновения.
ta: மோதல் பலகோண தலைமுறைக்கு ஒரு தனி படத்தைப் பயன்படுத்த, மற்றொரு ச்பிரிட் 2 டி உருவாக்கவும், அதிலிருந்து மோதல் பலகோண உடன்பிறப்பை உருவாக்கவும், பின்னர் ச்பிரிட் 2 டி முனையை அகற்றவும். இந்த வழியில், உருவாக்கப்பட்ட மோதலில் இருந்து சிறிய விவரங்களை நீங்கள் விலக்கலாம்.
uk: Щоб використати окреме зображення для генерації багатокутника зіткнення, створіть інший Sprite2D, згенеруйте з нього полігон зіткнення, а потім видаліть вузол Sprite2D. Таким чином ви можете виключити дрібні деталі зі згенерованого зіткнення.
zh_hans: 要使用单独的图像生成碰撞多边形，可创建另一个 Sprite2D，从中生成一个碰撞多边形的同级节点，然后移除 Sprite2D 节点。这样就可以将小细节排除在生成的碰撞之外。
zh_tw: 如需用不同圖片來產生碰撞多邊形，請建立另一個 Sprite2D，用該圖片產生碰撞多邊形同級節點，然後再刪除這個 Sprite2D 節點。如此即可排除不必要的細節。

source: Performance caveats
ga: Rabhadh feidhmíochta
it: Avvertimenti sulle prestazioni
ja: パフォーマンス注意点
ru: Предостережения относительно производительности
ta: செயல்திறன் எச்சரிக்கைகள்
uk: Застереження щодо продуктивності
zh_hans: 性能方面的注意事项
zh_tw: 效能注意事項

source: You aren't limited to a single collision shape per PhysicsBody. Still, we recommend keeping the number of shapes as low as possible to improve performance, especially for dynamic objects like RigidBodies and CharacterBodies. On top of that, avoid translating, rotating, or scaling CollisionShapes to benefit from the physics engine's internal optimizations.
ga: Níl tú teoranta do chruth imbhuailte amháin in aghaidh PhysicsBody. Fós féin, molaimid líon na cruthanna a choinneáil chomh híseal agus is féidir chun feidhmíocht a fheabhsú, go háirithe le haghaidh rudaí dinimiciúla mar RigidBodies agus CharacterBodies. Ar a bharr sin, seachain CollisionShapes a aistriú, a rothlú nó a scálú chun leas a bhaint as barrfheabhsú inmheánacha an innill fhisice.
it: Non si è limitati a una singola forma di collisione per PhysicsBody. Tuttavia, consigliamo di mantenere il numero di forme il più basso possibile per migliorare le prestazioni, soprattutto per oggetti dinamici come RigidBody e CharacterBody. Oltretutto, evitare di traslare, ruotare o ridimensionare le CollisionShape per beneficiare delle ottimizzazioni interne del motore di fisica.
ja: PhysicsBody につき衝突形状は1つに限定されません。それでも形状の数をできるだけ少なく保つことをお勧めします。これはパフォーマンス向上のためで、特にRigidBodyやCharacterBodyのような動的オブジェクトでは重要です。さらに、物理エンジンの内部最適化を活用するために、CollisionShape の移動、回転、スケーリングを避けるべきです。
ru: Вы не ограничены одной формой столкновения для каждого PhysicsBody. Тем не менее, мы рекомендуем использовать как можно меньше форм для повышения производительности, особенно для динамических объектов, таких как RigidBodies и CharacterBodies. Кроме того, избегайте перемещения, вращения и масштабирования CollisionShapes, чтобы воспользоваться внутренними оптимизациями физического движка.
ta: இயற்பியல் பாடிக்கு நீங்கள் ஒரு மோதல் வடிவத்திற்கு மட்டுப்படுத்தப்படவில்லை. இருப்பினும், செயல்திறனை மேம்படுத்த வடிவங்களின் எண்ணிக்கையை முடிந்தவரை குறைவாக வைத்திருக்க பரிந்துரைக்கிறோம், குறிப்பாக ரிகிட்பாடிகள் மற்றும் எழுத்துக்குறி போன்ற மாறும் பொருள்களுக்கு. அதற்கு மேல், இயற்பியல் இயந்திரத்தின் உள் மேம்படுத்தல்களிலிருந்து பயனடைய, மோதல்களை மொழிபெயர்ப்பது, சுழற்றுவது அல்லது அளவிடுதல் ஆகியவற்றைத் தவிர்க்கவும்.
uk: Ви не обмежені однією формою зіткнення на PhysicsBody. Тим не менш, ми рекомендуємо зберігати якомога меншу кількість форм, щоб покращити продуктивність, особливо для динамічних об’єктів, таких як RigidBodies і CharacterBodies. Крім того, уникайте перекладу, обертання або масштабування CollisionShapes, щоб скористатися перевагами внутрішньої оптимізації фізичного механізму.
zh_hans: 每个 PhysicsBody（物理体）不限于一个碰撞形状。尽管如此，我们还是建议尽量减少碰撞形状的数量以提高性能。特别是对于像 RigidBody（刚体）和 CharacterBody（角色体）这样的动态对象。除此之外，避免平移、旋转或缩放碰撞形状，以从物理引擎的内部优化中受益。
zh_tw: 每個 PhysicsBody 並不限於只能有一個碰撞形狀，但建議盡量減少碰撞形狀的數量，特別是動態物件（如 RigidBody 與 CharacterBody），以提升效能。此外，請避免在執行時對碰撞形狀進行移動、旋轉或縮放，這樣才能讓物理引擎充分發揮內部最佳化。

source: When using a single non-transformed collision shape in a StaticBody, the engine's *broad phase* algorithm can discard inactive PhysicsBodies. The *narrow phase* will then only have to take into account the active bodies' shapes. If a StaticBody has many collision shapes, the broad phase will fail. The narrow phase, which is slower, must then perform a collision check against each shape.
ga: Agus cruth imbhuailte amháin neamh-chlaochlaithe á úsáid agat i StaticBody, is féidir le halgartama* céim leathan* an innill PhysicsBodies neamhghníomhacha a dhiúscairt. Ní bheidh ar an gcéime* cúng* ach cruthanna na gcorp gníomhacha a chur san áireamh. Má tá go leor cruthanna imbhuailte ag StaticBody, teipeann ar an gcéim leathan. Caithfidh an chéim chúng, atá níos moille, seiceáil imbhuailte a dhéanamh ansin i gcoinne gach cruth.
it: Quando si utilizza una singola forma di collisione non trasformata in uno StaticBody, l'algoritmo *broad phase* ("fase ampia") del motore può scartare i PhysicsBody inattivi. La *narrow phase* ("fase ristretta") dovrà quindi tenere conto solo delle forme dei corpi attivi. Se uno StaticBody ha molte forme di collisione, la broad phase fallirà. La narrow phase, che è più lenta, dovrà quindi effettuare una verifica di collisione su ciascuna forma.
ja: 単一の非変形コリジョン形状を StaticBody で使用する場合、エンジンの *broad phase* アルゴリズムは非アクティブな PhysicsBody を除外できます。その結果、 *narrow phase* ではアクティブなボディの形状のみを考慮すればよくなります。しかし、StaticBody に多くの衝突形状がある場合、broad phaseは失敗します。より遅いnarrow phaseがそれぞれの形状に対して衝突チェックを行うことになります。
ru: При использовании одной непреобразованной формы столкновения в StaticBody алгоритм движка *широкой фазы* может отбрасывать неактивные PhysicsBodies. В этом случае *узкая фаза* будет учитывать только формы активных тел. Если StaticBody имеет несколько форм столкновения, широкая фаза не сработает. Узкая фаза, которая медленнее, должна выполнить проверку столкновения для каждой формы.
ta: நிலையான மாற்றப்படாத மோதல் வடிவத்தைப் பயன்படுத்தும் போது, இயந்திரத்தின் * பரந்த கட்டம் * வழிமுறை செயலற்ற இயற்பியல் அமைப்புகளை நிராகரிக்க முடியும். * குறுகிய கட்டம் * பின்னர் செயலில் உள்ள உடல்களின் வடிவங்களை மட்டுமே கணக்கில் எடுத்துக்கொள்ள வேண்டும். ஒரு நிலையான நபருக்கு பல மோதல் வடிவங்கள் இருந்தால், பரந்த கட்டம் தோல்வியடையும். குறுகிய கட்டம், மெதுவாக இருக்கும், பின்னர் ஒவ்வொரு வடிவத்திற்கும் எதிராக மோதல் சோதனை செய்ய வேண்டும்.
uk: У разі використання однієї нетрансформованої форми зіткнення в StaticBody алгоритм *широкої фази* двигуна може відкидати неактивні PhysicsBodies. Тоді *вузька фаза* повинна буде враховувати лише форми активних тіл. Якщо StaticBody має багато форм зіткнення, широка фаза не вдасться. Вузька фаза, яка є повільнішою, повинна виконати перевірку на зіткнення з кожною формою.
zh_hans: 在 StaticBody 中使用单个未变换的碰撞形状时，引擎的\ *宽相位*\ 算法可以丢弃不活跃的 PhysicsBody。这个\ *窄相位*\ 只需考虑到活跃物体的形状。如果一个 StaticBody 有许多碰撞形状， 那么宽相位就会失败。较慢的窄相位必须对每个形状执行碰撞检查。
zh_tw: 若 StaticBody 僅有單一且未經縮放或旋轉的碰撞形狀時，引擎的 *廣義階段* 演算法能有效忽略不活躍的物理物件， *狹義階段* 只需檢查活躍物件。但如果一個 StaticBody 擁有多個碰撞形狀，廣義階段會失效，狹義階段（速度較慢）則必須對每個形狀進行碰撞檢查。

source: If you run into performance issues, you may have to make tradeoffs in terms of accuracy. Most games out there don't have a 100% accurate collision. They find creative ways to hide it or otherwise make it unnoticeable during normal gameplay.
ga: Má bhíonn fadhbanna feidhmíochta ort, b'fhéidir go mbeidh ort trádálacha a dhéanamh i dtéarmaí cruinneas. Níl imbhualadh cruinn 100% ag an gcuid is mó de na cluichí amuigh ansin. Faigheann siad bealaí cruthaitheacha chun é a cheilt nó é a dhéanamh gan fheiceáil ar shlí eile le linn gnáthgameplay.
it: Se si riscontrano problemi di prestazioni, potrebbe essere necessario fare compromessi in termini di precisione. La maggioranza dei giochi non garantisce una collisione precisa al 100%. Trovano modi creativi per nasconderla o renderla impercettibile durante il normale gameplay.
ja: パフォーマンスの問題に直面した場合、精度に関して妥協を行う必要があるかもしれません。ほとんどのゲームでは、衝突判定が100%正確であることはありません。代わりにクリエイティブな方法でそれを隠したり、通常のゲームプレイ中に目立たなくさせたりしています。
ru: Если у вас возникнут проблемы с производительностью, вам, возможно, придётся пойти на компромиссы в плане точности. В большинстве игр столкновения не всегда точны. Разработчики находят изощрённые способы скрыть их или сделать незаметными в обычном игровом процессе.
ta: நீங்கள் செயல்திறன் சிக்கல்களில் சிக்கினால், துல்லியத்தின் அடிப்படையில் நீங்கள் பரிமாற்றங்களை செய்ய வேண்டியிருக்கும். அங்குள்ள பெரும்பாலான விளையாட்டுகளில் 100% துல்லியமான மோதல் இல்லை. அவர்கள் அதை மறைக்க ஆக்கபூர்வமான வழிகளைக் கண்டுபிடிப்பார்கள் அல்லது சாதாரண விளையாட்டின் போது அதை கவனிக்க முடியாததாக ஆக்குகிறார்கள்.
uk: Якщо у вас виникли проблеми з продуктивністю, вам, можливо, доведеться піти на компроміси щодо точності. Більшість ігор не мають 100% точного зіткнення. Вони знаходять творчі способи приховати це або іншим чином зробити непомітним під час звичайної гри.
zh_hans: 如果遇到性能问题，你可能需要在准确性方面进行权衡。大多数游戏都没有100%的精确碰撞。他们找到了一些具有创造性的方法来隐藏它，或者在正常的游戏中让它变得不被人注意到。
zh_tw: 如果遇到效能問題，你可能需要在精度與效能間做出取捨。多數遊戲的碰撞判斷並非 100% 精確，通常會用一些技巧將誤差隱藏，讓玩家在遊玩過程中察覺不到。

source: You can define the shape of a :ref:`class_PhysicsBody2D` by adding one or more :ref:`CollisionShape2Ds <class_CollisionShape2D>` or :ref:`CollisionPolygon2Ds <class_CollisionPolygon2D>` as child nodes. Note that you must add a :ref:`class_Shape2D` *resource* to collision shape nodes in the Inspector dock.
ja: \ :ref:`class_PhysicsBody2D` のシェイプを定義するには、一つ以上の\ :ref:`CollisionShape2Ds <class_CollisionShape2D>` または :ref:`CollisionPolygon2Ds <class_CollisionPolygon2D>` をノードの子として追加します。インスペクタドックで :ref:`class_Shape2D` *リソース* をコリジョン形状にを追加する必要があることに注意してください。
