Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/collision_shapes_2d.po
Languages: ga, it, ja, ru, ta, uk, zh_hans, zh_tw

source: Collision shapes (2D)
ga: Cruthanna imbhuailte (2D)
it: Forme di collisione (2D)
ja: コリジョン形状(2D)
ru: Формы столкновений (2D)
ta: மோதல் வடிவங்கள் (2 டி)
uk: Форми зіткнення (2D)
zh_hans: 碰撞形状（2D）
zh_tw: 碰撞形狀（2D）

source: This guide explains:
ga: Míníonn an treoir seo:
it: Questa guida spiega:
ja: このガイドでは以下の事を説明します:
ru: В этом руководстве объясняется:
ta: இந்த வழிகாட்டி விளக்குகிறது:
uk: Цей посібник пояснює:
zh_hans: 本指南解释：
zh_tw: 本教學將說明：

source: The types of collision shapes available in 2D in Godot.
ga: Na cineálacha cruthanna imbhuailte atá ar fáil i 2D i Godot.
ja: Godotで使用可能な2Dの衝突形状の種類。
ru: Типы форм столкновений, доступные в 2D в Godot.
ta: கோடோட்டில் 2D இல் கிடைக்கும் மோதல் வடிவங்களின் வகைகள்.
uk: Типи фігур зіткнення, доступні в 2D у Godot.
zh_hans: Godot 2D 中可用的碰撞形状类型。
zh_tw: Godot 2D 中可用的碰撞形狀類型。

source: Using an image converted to a polygon as a collision shape.
ga: Ag baint úsáide as íomhá a thiontú go polagún mar chruth imbhuailte.
ja: ポリゴンに変換された画像をコリジョン形状として使用。
ru: Использование изображения, преобразованного в многоугольник, в качестве формы столкновения.
ta: பலகோணமாக மாற்றப்பட்ட படத்தைப் பயன்படுத்தி மோதல் வடிவமாக.
uk: Використання зображення, перетвореного на багатокутник, як форми зіткнення.
zh_hans: 使用转换为多边形的图像作为碰撞形状。
zh_tw: 使用影像轉換為多邊形作為碰撞形狀。

source: Performance considerations regarding 2D collisions.
ga: Creithnithe feidhmíochta maidir le imbhuailtí 2D.
ja: 2Dコリジョンに関するパフォーマンス上の考慮事項。
ru: Вопросы производительности применительно к 2D-столкновениям.
ta: 2 டி மோதல்கள் தொடர்பான செயல்திறன் பரிசீலனைகள்.
uk: Зауваження продуктивності щодо двовимірних зіткнень.
zh_hans: 有关 2D 碰撞的性能注意事项。
zh_tw: 2D 碰撞的效能考量。

source: Godot provides many kinds of collision shapes, with different performance and accuracy tradeoffs.
ga: Soláthraíonn Godot go leor cineálacha cruthanna imbhuailte, le trádálacha éagsúla feidhmíochta agus cruinneas.
ja: Godotはさまざまな種類の衝突形状を提供しており、それぞれにパフォーマンスと精度のトレードオフがあります。
ru: Godot предоставляет множество видов форм столкновений, с различными компромиссами по производительности и точности.
ta: கோடோட் பல வகையான மோதல் வடிவங்களை வழங்குகிறது, வெவ்வேறு செயல்திறன் மற்றும் துல்லியமான பரிமாற்றங்களுடன்.
uk: Godot надає багато видів колізійних форм із різною продуктивністю та точністю.
zh_hans: Godot提供多种碰撞形状, 具有不同的性能和精度权衡.
zh_tw: Godot 提供多種碰撞形狀，各有不同的效能與精確度權衡。

source: You can define the shape of a :ref:`class_PhysicsBody2D` by adding one or more :ref:`CollisionShape2Ds <class_CollisionShape2D>` or :ref:`CollisionPolygon2Ds <class_CollisionPolygon2D>` as *direct* child nodes. Indirect child nodes (i.e. children of child nodes) will be ignored and won't be used as collision shapes. Also, note that you must add a :ref:`class_Shape2D` *resource* to collision shape nodes in the Inspector dock.
ru: Вы можете определить форму объекта :ref:`class_PhysicsBody2D`, добавив один или несколько узлов :ref:`CollisionShape2Ds <class_CollisionShape2D>` или :ref:`CollisionPolygon2Ds <class_CollisionPolygon2D>` в качестве *прямых* дочерних узлов. Косвенные дочерние узлы (т.е. дочерние узлы дочерних узлов) будут игнорироваться и не будут использоваться в качестве форм столкновений. Также обратите внимание, что необходимо добавить *ресурс* :ref:`class_Shape2D` к узлам форм столкновений в панели инспектора.
ta: ஒன்று அல்லது அதற்கு மேற்பட்டவற்றைச் சேர்ப்பதன் மூலம் `class_physicsobody2d` இன் வடிவத்தை நீங்கள் வரையறுக்கலாம்: ref:` collisionshape2ds <class_collisshape2d> `or: ref:` closs_collisionPolygon2d> ` * நேரடி * குழந்தை nodes என. மறைமுக குழந்தை முனைகள் (அதாவது குழந்தை முனைகளின் குழந்தைகள்) புறக்கணிக்கப்படும், மேலும் அவை மோதல் வடிவங்களாகப் பயன்படுத்தப்படாது. மேலும், நீங்கள் ஒரு: ref: `class_shape2d` * வளம் * இன்ச்பெக்டர் கப்பல்துறையில் மோதல் வடிவ முனைகளைச் சேர்க்க வேண்டும் என்பதை நினைவில் கொள்க.
uk: Ви можете визначити форму :ref:`class_PhysicsBody2D`, додавши один або кілька :ref:`CollisionShape2Ds <class_CollisionShape2D>` або :ref:`CollisionPolygon2Ds <class_CollisionPolygon2D>` як *прямі* дочірні вузли. Непрямі дочірні вузли (тобто діти дочірніх вузлів) ігноруватимуться та не використовуватимуться як форми зіткнень. Також зауважте, що ви повинні додати :ref:`class_Shape2D` *ресурс* до вузлів форми зіткнень у доку Inspector.
zh_hans: 你可以通过添加一个或多个 :ref:`CollisionShape2Ds <class_CollisionShape2D>` 或 :ref:`CollisionPolygon2Ds <class_CollisionPolygon2D>` 作为 *直接* 子节点来定义 :ref:`class_PhysicsBody2D` 的形状。间接子节点（i.e. 直接子节点的子节点）会被忽略且不会被用作碰撞形状。请注意，你必须将 :ref:`class_Shape2D` *资源*\ 添加到检查器面板内的碰撞形状节点。
zh_tw: 你可以在 :ref:`class_PhysicsBody2D` 下新增一個或多個 :ref:`CollisionShape2D <class_CollisionShape2D>` 或 :ref:`CollisionPolygon2D <class_CollisionPolygon2D>` 作為*直接*子節點來定義碰撞形狀。間接子節點（例如子節點的子節點）會被忽略，不會作為碰撞形狀使用。此外，請注意必須在屬性面板中為碰撞形狀節點指定 :ref:`class_Shape2D` *資源*。

source: When you add multiple collision shapes to a single PhysicsBody2D, you don't have to worry about them overlapping. They won't "collide" with each other.
ga: Nuair a chuireann tú cruthanna imbhuailte iolracha le PhysicsBody2D amháin, ní gá duit a bheith buartha faoi fhorluí orthu. Ní dhéanfaidh siad “imbhualadh” lena chéile.
ja: 1つの PhysicsBody2D 複数のコリジョン形状を追加すると、それらが重なることを心配せずに済みます。それらは互いに "衝突" しません。
ru: При добавлении нескольких фигур столкновений в один PhysicsBody2D вам не нужно беспокоиться об их наложении. Они не будут "сталкиваться" друг с другом.
ta: ஒற்றை இயற்பியல் 2D இல் நீங்கள் பல மோதல் வடிவங்களைச் சேர்க்கும்போது, அவற்றில் ஒன்றுடன் ஒன்று கவலைப்பட வேண்டியதில்லை. அவர்கள் ஒருவருக்கொருவர் "மோதிக் கொள்ள மாட்டார்கள்".
uk: Коли ви додаєте кілька форм зіткнення до одного PhysicsBody2D, вам не потрібно турбуватися про те, що вони накладаються. Вони не будуть «зіткнутися» один з одним.
zh_hans: 当你将多个碰撞形状添加到单个 PhysicsBody2D 时，不必担心它们会重叠。它们不会相互“碰撞”。
zh_tw: 當你在同一個 PhysicsBody2D 上新增多個碰撞形狀時，不需擔心它們會互相『碰撞』或重疊，因為它們彼此不會產生碰撞。

source: Primitive collision shapes
ga: Cruthanna imbhuailte príomh
it: Forme primitive di collisione
ja: プリミティブコリジョン形状
ru: Примитивные формы столкновений
ta: பழமையான மோதல் வடிவங்கள்
uk: Примітивні форми зіткнення
zh_hans: 基本碰撞形状
zh_tw: 基本碰撞形狀

source: Godot provides the following primitive collision shape types:
ga: Soláthraíonn Godot na cineálacha cruth imbhuailte primitive seo a leanas:
it: Godot fornisce i seguenti tipi di forme primitive di collisione:
ja: Godotは、以下のプリミティブコリジョン形状を提供します:
ru: Godot предоставляет следующие примитивные типы форм столкновений:
ta: கோடோட் பின்வரும் பழமையான மோதல் வடிவ வகைகளை வழங்குகிறது:
uk: Godot надає наступні типи примітивних форм зіткнення:
zh_hans: Godot提供了以下基本碰撞形状类型:
zh_tw: Godot 提供下列基本碰撞形狀型別：

source: :ref:`class_RectangleShape2D`
ga: :ref: `Class_RectongleShape2D`
ta: : குறிப்பு: `class_rectangleshape2d`

source: :ref:`class_CircleShape2D`
ta: : குறிப்பு: `class_circleshape2d`

source: :ref:`class_CapsuleShape2D`
ta: : குறிப்பு: `class_capsuleshape2d`

source: :ref:`class_SeparationRayShape2D` (designed for characters)
ga: :ref: `Class_SeparationRayShape2D` (deartha le haghaidh carachtair)
ja: :ref:`class_SeparationRayShape2D` (キャラクターのためにデザインされています)
ru: :ref:`class_SeparationRayShape2D` (разработано для персонажей)
ta: : ref: `class_separationrayshape2d` (எழுத்துக்களுக்காக வடிவமைக்கப்பட்டுள்ளது)
uk: :ref:`class_SeparationRayShape2D` (призначений для символів)
zh_hans: :ref:`class_SeparationRayShape2D` （专为角色设计）
zh_tw: :ref:`class_SeparationRayShape2D` （專為角色設計）

source: :ref:`class_WorldBoundaryShape2D` (infinite plane)
ga: :ref: `Class_WorldBoundaryShape2D` (eitleán gan teorainn)
ja: :ref:`class_WorldBoundaryShape2D` (無限平面)
ru: :ref:`class_WorldBoundaryShape2D` (бесконечная плоскость)
ta: : ref: `class_worldboundaryshape2d` (எல்லையற்ற விமானம்)
uk: :ref:`class_WorldBoundaryShape2D` (нескінченна площина)
zh_hans: :ref:`class_WorldBoundaryShape2D` （无限平面）
zh_tw: :ref:`class_WorldBoundaryShape2D` （無限平面）

source: You can represent the collision of most smaller objects using one or more primitive shapes. However, for more complex objects, such as a large ship or a whole level, you may need convex or concave shapes instead. More on that below.
ga: Féadfaidh tú imbhualadh an chuid is mó de na rudaí níos lú a léiriú ag baint úsáide as cruthanna príom Mar sin féin, le haghaidh rudaí níos casta, mar shampla long mór nó leibhéal iomlán, b'fhéidir go mbeidh cruthanna doimhsa nó concave ag teastáil uait ina ionad. Tuilleadh faoi sin thíos.
ja: ほとんどの小さなオブジェクトの衝突は、1つまたは複数の基本的な形状を使用して表現できます。しかし、大型の船やレベル全体のような複雑なオブジェクトの場合は、代わりに凸形状や凹形状を使用する必要があるかもしれません。詳細は以下で説明します。
ru: Столкновение большинства небольших объектов можно представить с помощью одной или нескольких примитивных фигур. Однако для более сложных объектов, таких как большой корабль или целый уровень, вам могут понадобиться выпуклые или вогнутые формы. Подробнее об этом ниже.
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட பழமையான வடிவங்களைப் பயன்படுத்தி மிகச் சிறிய பொருள்களின் மோதலை நீங்கள் பிரதிநிதித்துவப்படுத்தலாம். இருப்பினும், ஒரு பெரிய கப்பல் அல்லது முழு நிலை போன்ற மிகவும் சிக்கலான பொருள்களுக்கு, அதற்கு பதிலாக உங்களுக்கு குவிந்த அல்லது குழிவான வடிவங்கள் தேவைப்படலாம். மேலும் கீழே.
uk: Ви можете представити зіткнення більшості менших об’єктів за допомогою однієї або кількох простих форм. Однак для більш складних об'єктів, таких як великий корабель або цілий рівень, вам можуть знадобитися опуклі або увігнуті форми. Детальніше про це нижче.
zh_hans: 你可以使用一个或多个原始形状来表示大多数较小物体的碰撞. 然而, 对于更复杂的物体, 如大型船舶或整个水平面, 你可能需要凸形或凹形来代替. 下面会有更多的介绍.
zh_tw: 多數小型物件的碰撞可以使用一個或多個基本碰撞形狀來表示。但對於較複雜的物件，如大型船艦或整個關卡，則可能需要使用凸形或凹形碰撞形狀。詳細內容請見下文。

source: We recommend favoring primitive shapes for dynamic objects such as RigidBodies and CharacterBodies as their behavior is the most reliable. They often provide better performance as well.
ga: Molaimid cruthanna príomha a bheith i bhfabhar le haghaidh rudaí dinimiciúla mar RigidBodies agus CharacterBodies mar is é a n-iompar an ceann is iontaofa. Is minic a sholáthraíonn siad feidhmíocht níos fearr freisin.
ja: 動的オブジェクト、たとえばRigidBody や CharacterBodyの場合は、基本的な形状を使用することをお勧めします。これは挙動が最も安定しているためです。これらの形状はパフォーマンスが優れている場合が多いです。
ru: Мы рекомендуем использовать примитивные формы для динамических объектов, таких как RigidBodies и CharacterBodies, поскольку их поведение наиболее надёжно. Кроме того, они часто обеспечивают более высокую производительность.
ta: ரிகிட் போடிகள் மற்றும் எழுத்துக்குறி போன்ற மாறும் பொருள்களுக்கான பழமையான வடிவங்களை ஆதரிக்க பரிந்துரைக்கிறோம், ஏனெனில் அவற்றின் நடத்தை மிகவும் நம்பகமானது. அவை பெரும்பாலும் சிறந்த செயல்திறனையும் வழங்குகின்றன.
uk: Ми рекомендуємо віддавати перевагу примітивним формам для динамічних об’єктів, таких як RigidBodies і CharacterBodies, оскільки їх поведінка є найбільш надійною. Вони також часто забезпечують кращу продуктивність.
zh_hans: 建议动态对象使用原始图形（如 RigidBodies 和 KinematicBodies），因为它们的行为是可靠的，通常也能提供更好的性能。
zh_tw: 建議對於動態物件（如 RigidBody 與 CharacterBody）優先使用基本碰撞形狀，這樣行為最穩定可靠，且通常能提供更佳效能。

source: Convex collision shapes
ga: Cruthanna imbhuailte doimhneach
it: Forme convesse di collisione
ja: 凸形状コリジョン形状
ru: Выпуклые формы столкновений
ta: குவிந்த மோதல் வடிவங்கள்
uk: Опуклі форми зіткнення
zh_hans: 凸型碰撞形状
zh_tw: 凸形碰撞形狀

source: Godot currently doesn't offer a built-in way to create 2D convex collision shapes. This section is mainly here for reference purposes.
ga: Faoi láthair ní thairgeann Godot bealach ionsuite chun cruthanna imbhuailte doimhneach 2D a chruthú. Tá an chuid seo anseo go príomha chun críocha tagartha.
ja: Godot は現在、2Dの凸形状コリジョン形状を作成するビルトインの方法を提供していません。このセクションは主に参考情報として記載されています。
ru: В настоящее время Godot не предлагает встроенного инструмента для создания двумерных выпуклых фигур столкновений. Этот раздел представлен здесь в основном в справочных целях.
ta: கோடோட் தற்போது 2 டி குவிந்த மோதல் வடிவங்களை உருவாக்க ஒரு உள்ளமைக்கப்பட்ட வழியை வழங்கவில்லை. இந்த பிரிவு முக்கியமாக குறிப்பு நோக்கங்களுக்காக இங்கே உள்ளது.
uk: Godot наразі не пропонує вбудованого способу створення 2D опуклих форм зіткнення. Цей розділ в основному тут для довідкових цілей.
zh_hans: Godot 目前没有提供创建 2D 凸形碰撞形状的内置方法。本节内容主要供参考。
zh_tw: Godot 目前沒有內建建立 2D 凸形碰撞形狀的方法。這一節僅供參考。

source: :ref:`Convex collision shapes <class_ConvexPolygonShape2D>` are a compromise between primitive collision shapes and concave collision shapes. They can represent shapes of any complexity, but with an important caveat. As their name implies, an individual shape can only represent a *convex* shape. For instance, a pyramid is *convex*, but a hollow box is *concave*. To define a concave object with a single collision shape, you need to use a concave collision shape.
ga: :ref:`Is comhréiteach iad cruthanna imbhuailte dronnach <class_ConvexPolygonShape2D>` idir cruthanna imbhuailte primitive agus cruthanna imbhuailte cuasach. Is féidir leo cruthanna d'aon chastacht a léiriú, ach le caveat tábhachtach. Mar a thugann a n-ainm le tuiscint, ní féidir le cruth aonair ach cruth *dronnach* a léiriú. Mar shampla, tá pirimid *dronnach*, ach tá bosca log *cuasach*. Chun réad cuasach a shainiú le cruth imbhuailte amháin, ní mór duit cruth imbhuailte cuasach a úsáid.
ja: \ :ref:`凸形状コリジョン形状 <class_ConvexPolygonShape2D>` は、プリミティブコリジョン形状と凹型コリジョン形状の折衷的な選択肢です。これらはどんな複雑な形状でも表現できますが、重要な制約があります。その名前が示すように、個々の形状は *凸型* の形状しか表現できません。例えば、ピラミッドは *凸型* ですが、中が空洞の箱は *凹型* です。1つのコリジョン形状で凹型オブジェクトを定義するには、凹型コリジョン形状を使用する必要があります。
ru: :ref:`Convex collision shapes <class_ConvexPolygonShape2D>` представляют собой компромисс между примитивными формами коллизий и вогнутыми формами коллизий. Они могут представлять фигуры любой сложности, но с важным ограничением. Как следует из названия, отдельная форма может представлять только *выпуклую* форму. Например, пирамида — *выпуклая*, а полый параллелепипед — *вогнутая*. Чтобы определить вогнутый объект с помощью одной формы коллизий, необходимо использовать вогнутую форму коллизий.
ta: . அவை எந்தவொரு சிக்கலான வடிவங்களையும் குறிக்கலாம், ஆனால் ஒரு முக்கியமான எச்சரிக்கையுடன். அவற்றின் பெயர் குறிப்பிடுவது போல, ஒரு தனிப்பட்ட வடிவம் ஒரு * குவிந்த * வடிவத்தை மட்டுமே குறிக்கும். உதாரணமாக, ஒரு பிரமிடு *குவிந்த *, ஆனால் ஒரு வெற்று பெட்டி *குழிவான *. ஒற்றை மோதல் வடிவத்துடன் ஒரு குழிவான பொருளை வரையறுக்க, நீங்கள் ஒரு குழிவான மோதல் வடிவத்தைப் பயன்படுத்த வேண்டும்.
uk: :ref:`Convex collision shapes <class_ConvexPolygonShape2D>` є компромісом між примітивними формами зіткнення та увігнутими формами зіткнення. Вони можуть представляти фігури будь-якої складності, але з важливим застереженням. Як випливає з назви, окрема фігура може представляти лише *опуклу* форму. Наприклад, піраміда *опукла*, а порожниста коробка *увігнута*. Щоб визначити увігнутий об’єкт з єдиною формою зіткнення, потрібно використовувати увігнуту форму зіткнення.
zh_hans: :ref:`凸碰撞形状 <class_ConvexPolygonShape2D>` 是图元碰撞形状和凹碰撞形状之间的折衷。它们可以表示任何复杂程度的形状，但有一个重要的注意事项。顾名思义，单个形状只能表示\ *凸*\ 形状。例如，金字塔是\ *凸*\ 的，而空心盒子是\ *凹*\ 的。要用单个碰撞形状定义凹物体，你需要使用凹碰撞形状。
zh_tw: :ref:`凸形碰撞形狀<class_ConvexPolygonShape2D>` 介於基本碰撞形狀與凹形碰撞形狀之間。它們可以表示任意複雜的形狀，但有一個重點限制：每個凸形只能表示*凸*的形狀。例如，金字塔是*凸*的，而空心盒子則屬於*凹*。如果要用單一碰撞形狀定義凹形物件，就得使用凹形碰撞形狀。

source: Depending on the object's complexity, you may get better performance by using multiple convex shapes instead of a concave collision shape. Godot lets you use *convex decomposition* to generate convex shapes that roughly match a hollow object. Note this performance advantage no longer applies after a certain amount of convex shapes. For large and complex objects such as a whole level, we recommend using concave shapes instead.
ga: Ag brath ar chastacht an réada, b'fhéidir go bhfaighidh tú feidhmíocht níos fearr trí chruthanna doimhneacha iolracha a úsáid in ionad cruth imbhuailte concave. Ligeann Godot duit* dianscaoileadh doimhneach* a úsáid chun cruthanna doimhe a ghiniúint a mheaitseálann go garbh le réad log. Tabhair faoi deara nach bhfuil an buntáiste feidhmíochta seo i bhfeidhm a thuilleadh tar éis méid áirithe cruthanna Maidir le rudaí móra agus casta mar leibhéal iomlán, molaimid cruthanna concave a úsáid ina ionad.
ja: オブジェクトの複雑さによっては、凹型コリジョン形状を使用する代わりに、複数の凸型形状を使用することでパフォーマンスが向上する場合があります。Godotでは、 *凸形状分解* を使用して、中が空洞のオブジェクトに大まかに一致する凸型形状を生成できます。ただし、凸型形状の数が一定量を超えると、このパフォーマンスの利点は失われます。レベル全体のような大きく複雑なオブジェクトの場合は、凹型形状を使用することを推奨します。
ru: В зависимости от сложности объекта, можно добиться лучшей производительности, используя несколько выпуклых фигур вместо вогнутой формы столкновения. Godot позволяет использовать *выпуклое разложение* для генерации выпуклых фигур, приблизительно соответствующих полому объекту. Обратите внимание, что это преимущество в производительности теряет силу после определённого количества выпуклых фигур. Для больших и сложных объектов, таких как целый уровень, мы рекомендуем использовать вогнутые фигуры.
ta: பொருளின் சிக்கலைப் பொறுத்து, குழிவான மோதல் வடிவத்திற்கு பதிலாக பல குவிந்த வடிவங்களைப் பயன்படுத்துவதன் மூலம் சிறந்த செயல்திறனைப் பெறலாம். ஒரு வெற்று பொருளுடன் பொருந்தக்கூடிய குவிந்த வடிவங்களை உருவாக்க * குவிந்த சிதைவு * பயன்படுத்த கோடோட் உங்களை அனுமதிக்கிறது. ஒரு குறிப்பிட்ட அளவு குவிந்த வடிவங்களுக்குப் பிறகு இந்த செயல்திறன் நன்மை இனி பொருந்தாது என்பதை நினைவில் கொள்க. முழு நிலை போன்ற பெரிய மற்றும் சிக்கலான பொருள்களுக்கு, அதற்கு பதிலாக குழிவான வடிவங்களைப் பயன்படுத்த பரிந்துரைக்கிறோம்.
uk: Залежно від складності об’єкта, ви можете отримати кращу продуктивність, використовуючи кілька опуклих форм замість увігнутої форми зіткнення. Godot дозволяє використовувати *опукле розкладання* для створення опуклих форм, які приблизно відповідають порожнистому об’єкту. Зауважте, що ця перевага продуктивності більше не застосовується після певної кількості опуклих форм. Для великих і складних об’єктів, таких як цілий рівень, ми рекомендуємо замість цього використовувати увігнуті форми.
zh_hans: 根据对象的复杂程度, 可能要通过使用多个凸形而不是一个凹形碰撞形状来获得更好的性能.Godot可以使用 *凸分解* 来生成与空心物体大致匹配的凸形. 请注意, 在一定数量的凸形之后, 就没有了这种性能优势, 对于大而复杂的对象, 如整个关卡, 建议使用凹形代替.
zh_tw: 根據物件的複雜度，使用多個凸形碰撞形狀來取代單一凹形碰撞形狀，通常能獲得更好的效能。Godot 可透過*凸分解*自動產生多個大致符合物件外型的凸形狀。但若凸形狀數量過多，這種效能優勢就會消失。對於大型或複雜物件（如整個關卡），建議仍直接使用凹形碰撞形狀。

source: Concave or trimesh collision shapes
ga: Cruthanna imbhuailte concave nó trimesh
ja: 凹形状または三角形メッシュのコリジョン形状
ru: Вогнутые или тримешевые формы столкновений
ta: குழிவான அல்லது டிரிமேச் மோதல் வடிவங்கள்
uk: Увігнуті або трійчасті форми зіткнення
zh_hans: 凹面或三面体碰撞形状
zh_tw: 凹形或三角網格碰撞形狀

source: :ref:`Concave collision shapes <class_ConcavePolygonShape2D>`, also called trimesh collision shapes, can take any form, from a few triangles to thousands of triangles. Concave shapes are the slowest option but are also the most accurate in Godot. **You can only use concave shapes within StaticBodies.** They will not work with CharacterBodies or RigidBodies unless the RigidBody's mode is Static.
ga: :ref:`Is féidir le cruthanna imbhuailte cuasach <class_ConcavePolygonShape2D>`, ar a dtugtar cruthanna imbhuailte trimesh freisin, a bheith i bhfoirm ar bith, ó chúpla triantán go dtí na mílte triantán. Is iad cruthanna cuasacha an rogha is moille ach is cruinne iad freisin i Godot. **Ní féidir leat ach cruthanna cuasacha a úsáid laistigh de StaticBodies.** Ní oibreoidh siad le Carachtair nó le RigidBodies ach amháin má tá modh RigidBody Statach.
ja: \ :ref:`凹形状コリジョン形状 <class_ConcavePolygonShape2D>` 、または三角メッシュコリジョン形状は、少数の三角形から数千の三角形まで、あらゆる形状を表現できます。凹形状は、Godotにおいて最も正確で、最も処理速度が遅いオプションです。 **凹形状は StaticBody 内でのみ使用可能です** 。CharacterBodyやRigidBodyでは動作しません。ただし、RigidBodyが Static モードに設定されている場合は例外的に動作します。
ru: :ref:`Concave collision shapes <class_ConcavePolygonShape2D>`, также называемые формами столкновений с тримеш-сеткой, могут принимать любую форму, от нескольких треугольников до тысяч. Вогнутые формы — самый медленный вариант, но и самый точный в Godot. **В StaticBodies можно использовать только вогнутые формы.** Они не будут работать с CharacterBodies или RigidBodies, если режим RigidBody не установлен на Static.
ta: . குழிவான வடிவங்கள் மெதுவான விருப்பமாகும், ஆனால் கோடோட்டில் மிகவும் துல்லியமானவை. ** நீங்கள் ச்டாடிக்பாடிகளுக்குள் குழிவான வடிவங்களை மட்டுமே பயன்படுத்த முடியும். ** கடுமையான பாடலின் பயன்முறை நிலையானதாக இல்லாவிட்டால் அவை எழுத்துக்குறி அல்லது ரிகிட்பாடிகளுடன் வேலை செய்யாது.
uk: :ref:`Concave collision shapes <class_ConcavePolygonShape2D>`, які також називаються фігурами зіткнень з трійкою, можуть мати будь-яку форму, від кількох трикутників до тисяч трикутників. Увігнуті форми є найповільнішим варіантом, але також найточнішим у Godot. **Ви можете використовувати лише увігнуті фігури в StaticBodies.** Вони не працюватимуть із CharacterBodies або RigidBodies, якщо для RigidBody не встановлено режим Static.
zh_tw: :ref:`凹形碰撞形狀<class_ConcavePolygonShape2D>`，也稱為三角網格碰撞形狀，可以組成任何形狀，從少數三角形到數千個三角形。凹形碰撞形狀效能最差，但精度最高。**凹形只能用於 StaticBody（靜態物件）**。若用於 CharacterBody 或 RigidBody，除非該 RigidBody 模式設為 Static，否則將無法使用。

source: Even though concave shapes offer the most accurate *collision*, contact reporting can be less precise than primitive shapes.
ga: Cé go dtugann cruthanna concave an *imbhuailt* is cruinne, is féidir le tuairisciú teagmhála a bheith chomh beacht ná cruthanna príomha.
ja: 凹形状は最も正確な *衝突* を提供しますが、接触報告の精度はプリミティブ形状よりも低い場合があります。
ru: Несмотря на то, что вогнутые формы обеспечивают наиболее точное *столкновение*, сообщение о контакте может быть менее точным, чем у примитивных форм.
ta: குழிவான வடிவங்கள் மிகவும் துல்லியமான *மோதல் *ஐ வழங்கினாலும், தொடர்பு அறிக்கையிடல் பழமையான வடிவங்களை விட குறைவான துல்லியமாக இருக்கும்.
uk: Незважаючи на те, що увігнуті форми забезпечують найточнішу *колізію*, звіти про контакти можуть бути менш точними, ніж примітивні форми.
zh_hans: 即使凹形提供了最准确的 *碰撞*, 但触碰信息的精度可能不如基础形状.
zh_tw: 即使凹形碰撞形狀提供最精確的*碰撞*檢測，接觸點回報的精度仍可能比基本形狀差。

source: When not using TileMaps for level design, concave shapes are the best approach for a level's collision.
ga: Nuair nach n-úsáidtear TileMaps le haghaidh dearadh leibhéil, is iad cruthanna concave an cur chuige is fearr le haghaidh imbhuailt leibhéil.
ja: レベルデザインにTileMapを使用しない場合、凹形状がレベルの衝突判定に最適なアプローチです。
ru: Если для проектирования уровней не используются TileMaps, то вогнутые формы являются наилучшим подходом для столкновений на уровне.
ta: நிலை வடிவமைப்பிற்கு டைல்மேப்களைப் பயன்படுத்தாதபோது, குழிவான வடிவங்கள் ஒரு மட்டத்தின் மோதலுக்கான சிறந்த அணுகுமுறையாகும்.
uk: Якщо не використовувати TileMaps для проектування рівнів, увігнуті форми є найкращим підходом для зіткнення рівнів.
zh_hans: 在不使用 TileMap 进行关卡设计时，凹形是关卡碰撞的最佳方法。
zh_tw: 若關卡設計未採用 TileMap，凹形碰撞形狀是最適合的碰撞解決方案。

source: You can configure the CollisionPolygon2D node's *build mode* in the inspector. If it is set to **Solids** (the default), collisions will include the polygon and its contained area. If it is set to **Segments**, collisions will only include the polygon edges.
ga: Is féidir leat modh* tógála* nód CollisionPolygon2D a chumrú sa chigire. Má tá sé socraithe ag**Solad** (an réamhshocrú), cuimsíonn imbhuailtí an polagún agus a limistéar atá ann. Má tá sé socraithe u**Deighilte**, ní chuimsíonn imbhuailtí ach na himill polagóin.
ja: CollisionPolygon2D ノードの *build mode* はインスペクタで設定できます。 **Solids** (デフォルト)に設定されている場合、衝突判定にはポリゴンとその内側の領域が含まれます。一方、 **Segments** に設定されている場合、衝突判定にはポリゴンの辺のみが含まれます。
ru: Вы можете настроить *режим построения* узла CollisionPolygon2D в инспекторе. Если выбрано значение **Solids** (по умолчанию), столкновения будут охватывать полигон и его ограниченную область. Если выбрано значение **Segments**, столкновения будут охватывать только рёбра полигона.
ta: நீங்கள் இன்ச்பெக்டரில் ColisionPolygon2D முனையின் * உருவாக்க பயன்முறையை * கட்டமைக்கலாம். இது ** திடப்பொருட்கள் ** (இயல்புநிலை) என அமைக்கப்பட்டால், மோதல்களில் பலகோணம் மற்றும் அதில் உள்ள பகுதி ஆகியவை அடங்கும். இது ** பிரிவுகள் ** என அமைக்கப்பட்டால், மோதல்களில் பலகோண விளிம்புகள் மட்டுமே இருக்கும்.
uk: Ви можете налаштувати *режим* збірки вузла CollisionPolygon2D в інспекторі. Якщо встановлено значення **Solids** (за замовчуванням), зіткнення включатиме багатокутник і його область. Якщо для нього встановлено значення **Сегменти**, зіткнення включатиме лише ребра багатокутників.
zh_tw: 你可以在屬性面板調整 CollisionPolygon2D 節點的*建立模式*。若設為 **Solids**（預設），碰撞區域包括多邊形與其內部範圍；若設為 **Segments**，碰撞僅包含多邊形邊緣。
