Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/soft_body.po
Languages: ga, it, ru, ta, uk, zh_hant

source: Last step is to avoid clipping by adding the Kinematic Body `Player` to ``Parent Collision Ignore`` of the ``SoftBody``.
ga: Is é an chéim dheireanach gearradh a sheachaint tríd an gComhlacht Kinematic `Player` a chur le ``Tuismitheoir Collision Ignore`` den `Bogbody``.
uk: Останнім кроком є уникнення відрізання шляхом додавання кінематичного тіла `Player` до ``Parent Collision Ignore`` ``SoftBody``.
