Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/soft_body.po
Languages: ga, it, ru, ta, uk, zh_hant

source: Using SoftBody3D
it: Utilizzare SoftBody3D
ru: Использование SoftBody3D
ta: SoftBody3D ஐப் பயன்படுத்துதல்
zh_hant: 使用 SoftBody3D

source: Soft bodies (or *soft-body dynamics*) simulate movement, changing shape and other physical properties of deformable objects. This can for example be used to simulate cloth or to create more realistic characters.
ga: Insamhail comhlachtaí boga (nó *dinimic chorp boga*) gluaiseacht, cruth athraithe agus airíonna fisiciúla eile rudaí in-dhífhoirmithe. Is féidir é seo a úsáid mar shampla chun éadach a insamhail nó chun carachtair níos réalaíocha a chruthú.
ru: Мягкие тела (или *soft-body dynamics*) моделируют движение, изменение формы и другие физические свойства деформируемых объектов. Это может использоваться, например, для имитации ткани или для создания более реалистичных персонажей.
ta: மென்மையான உடல்கள் (அல்லது *மென்மையான-உடல் இயக்கவியல் *) இயக்கத்தை உருவகப்படுத்துகின்றன, வடிவத்தை மாற்றுவது மற்றும் சிதைக்கக்கூடிய பொருள்களின் பிற இயற்பியல் பண்புகள். உதாரணமாக துணியை உருவகப்படுத்த அல்லது மிகவும் யதார்த்தமான எழுத்துக்களை உருவாக்க இது பயன்படுத்தப்படலாம்.
uk: М’які тіла (або *динаміка м’яких тіл*) імітують рух, зміну форми та інші фізичні властивості об’єктів, що деформуються. Це можна, наприклад, використовувати для імітації тканини або створення більш реалістичних персонажів.
zh_hant: 柔體（或*柔體動力學*）類比可變形物體的運動，改變形狀和其他物理功能。例如，這可以用於模擬布料或建立更逼真的角色。

source: Basic set-up
ga: Socrú bunúsach
it: Configurazione di base
ru: Базовая настройка
ta: அடிப்படை அமைவு
uk: Базове налаштування
zh_hant: 基本設定

source: A :ref:`SoftBody3D <class_SoftBody3D>` node is used for soft body simulations.
ga: A :ref:`SoftBody3D <class_SoftBody3D>` úsáidtear nód le haghaidh insamhaltaí coirp bog.
ru: Узел :ref:`SoftBody3D <class_SoftBody3D>` используется для моделирования мягких тел.
ta: ப: குறிப்பு: `softbody3d <class_softbody3d>` மென்மையான உடல் உருவகப்படுத்துதல்களுக்கு முனை பயன்படுத்தப்படுகிறது.
uk: Вузол :ref:`SoftBody3D <class_SoftBody3D>` використовується для моделювання м’яких тіл.
zh_hant: 可用 :ref:`SoftBody3D <class_SoftBody3D>` 節點來進行柔體模擬。

source: We will create a bouncy cube to demonstrate the setup of a soft body.
ga: Cruthóimid ciúb greannmhar chun socrú comhlachta bog a thaispeáint.
ru: Мы создадим упругий куб, чтобы продемонстрировать устройство мягкого тела.
ta: மென்மையான உடலின் அமைப்பை நிரூபிக்க ஒரு பவுன்சி கனசதுரத்தை உருவாக்குவோம்.
uk: Ми створимо стрибучий куб, щоб продемонструвати налаштування м’якого тіла.
zh_hant: 我們將建立一個彈性立方體來演示柔體的設定。

source: Create a new scene with a ``Node3D`` node as root. Then, create a ``SoftBody3D`` node. Add a ``CubeMesh`` in the ``mesh`` property of the node in the inspector and increase the subdivision of the mesh for simulation.
ru: Создайте новую сцену с корневым узлом ``Node3D``. Затем создайте узел ``SoftBody3D``. Добавьте ``CubeMesh`` в свойство ``mesh`` узла в инспекторе и увеличьте уровень подразделения сетки для симуляции.
ta: `` Node3d`` முனை மூலம் ஒரு புதிய காட்சியை வேராக உருவாக்கவும். பின்னர், ஒரு `` softbody3d`` முனையை உருவாக்கவும். இன்ச்பெக்டரில் உள்ள முனையின் `` கண்ணி`` சொத்தில் ஒரு `` கியூபேமேச்`` சேர்த்து உருவகப்படுத்துதலுக்காக கண்ணி உட்பிரிவை அதிகரிக்கவும்.
zh_hant: 建立一個以 ``Node3D`` 為根節點的新場景。接著建立一個 ``SoftBody3D`` 節點。在檢視器的 ``mesh`` 屬性指派一個 ``CubeMesh``，並提高網格的細分以進行模擬。

source: Set the parameters to obtain the type of soft body you aim for. Try to keep the ``Simulation Precision`` above 5, otherwise, the soft body may collapse.
ga: Socraigh na paraiméadair chun an cineál comhlachta bog atá mar aidhm agat a fháil. Déan iarracht an ``Cruinneas Insamhalta ``a choinneáil os cionn 5, ar shlí eile, féadfaidh an corp bog titim.
it: Impostare i parametri per ottenere il tipo di corpo morbido desiderato. Cercare di mantenere la ``Precisione della simulazione`` superiore a 5, altrimenti il corpo morbido potrebbe collassare.
ru: Задайте параметры для получения желаемого типа мягкого тела. Старайтесь поддерживать ``Simulation Precision`` выше 5, иначе мягкое тело может разрушиться.
ta: நீங்கள் நோக்கமாகக் கொண்ட மென்மையான உடலின் வகையைப் பெற அளவுருக்களை அமைக்கவும். 5 க்கு மேல் `` உருவகப்படுத்துதல் துல்லியம்`` வைக்க முயற்சி செய்யுங்கள், இல்லையெனில், மென்மையான உடல் சரிந்துவிடும்.
uk: Встановіть параметри, щоб отримати тип м'якого тіла, який ви прагнете. Намагайтеся підтримувати ``Simulation Precision`` вище 5, інакше м’яке тіло може зруйнуватися.
zh_hant: 請調整參數以取得你想要的柔體型態。建議將 ``Simulation Precision`` （模擬精度）設在 5 以上，否則柔體可能會崩塌。

source: Handle some parameters with care, as some value can lead to strange results. For example, if the shape is not completely closed and you set pressure to more than 0, the softbody will fly around like a plastic bag under strong wind.
ga: Láimhseáil roinnt paraiméadair go cúramach, mar is féidir torthaí aisteacha a bheith mar thoradh ar luach Mar shampla, mura bhfuil an cruth dúnta go hiomlán agus mura socraíonn tú brú go níos mó ná 0, eitilfidh an corp bog timpeall cosúil le mála plaisteach faoi ghaoth láidir.
it: Gestire alcuni parametri con cautela, poiché alcuni valori possono portare a risultati strani. Ad esempio, se la forma non è completamente chiusa e si imposta la pressione a un valore superiore a 0, il corpo morbido volerà in giro come un sacchetto di plastica sotto un vento forte.
ru: Обращайтесь с некоторыми параметрами осторожно, так как некоторые значения могут привести к странным результатам. Например, если форма не полностью замкнута, а давление больше нуля, мягкое тело будет летать, как полиэтиленовый пакет под сильным ветром.
ta: சில மதிப்புகள் விசித்திரமான முடிவுகளுக்கு வழிவகுக்கும் என்பதால், சில அளவுருக்களை கவனத்துடன் கையாளவும். எடுத்துக்காட்டாக, வடிவம் முழுவதுமாக மூடப்படாவிட்டால், நீங்கள் 0 க்கு மேல் அழுத்தத்தை அமைத்தால், மென்மையானது வலுவான காற்றின் கீழ் ஒரு பிளாச்டிக் பையைப் போல பறக்கும்.
uk: Будьте обережні з деякими параметрами, оскільки деякі значення можуть призвести до дивних результатів. Наприклад, якщо фігура не повністю закрита, і ви встановлюєте тиск більше 0, м’яке тіло буде літати навколо, як поліетиленовий пакет під сильним вітром.
zh_hant: 小心處理一些參數，因為改動某些數值會導致奇怪的結果。例如，如果形狀未完全封閉並且您將壓力設定為大於 0，則柔體將如同在強風下的塑膠袋一樣飛舞。

source: Play the scene to view the simulation.
ga: Seinn an radharc chun an insamhalta a fheiceáil.
it: Esegui la scena per vedere la simulazione.
ru: Запустите сцену, чтобы просмотреть симуляцию.
ta: உருவகப்படுத்துதலைக் காண காட்சியை விளையாடுங்கள்.
uk: Відтворіть сцену, щоб переглянути симуляцію.
zh_hant: 播放該場景以查看模擬結果。

source: To improve the simulation's result, increase the ``Simulation Precision``, this will give significant improvement at the cost of performance.
ga: Chun toradh na insamhalta a fheabhsú, an ``Cruinneas Insamhalta ``a mhéadú, tabharfaidh sé seo feabhas suntasach ar chostas na feidhmíochta.
it: Per migliorare il risultato della simulazione, aumentare la ``Precisione della simulazione``; ciò produrrà un miglioramento significativo a scapito delle prestazioni.
ru: Чтобы улучшить результат моделирования, увеличьте ``Simulation Precision``, это даст значительное улучшение за счет производительности.
ta: உருவகப்படுத்துதலின் முடிவை மேம்படுத்த, `` உருவகப்படுத்துதல் துல்லியம்`` ஐ அதிகரிக்க, இது செயல்திறன் செலவில் குறிப்பிடத்தக்க முன்னேற்றத்தை அளிக்கும்.
uk: Щоб покращити результат симуляції, збільште ``Simulation Precision``, це дасть значне покращення за рахунок продуктивності.
zh_hant: 要改善模擬結果，可以增大 ``Simulation Precision``，但同時會大幅度增加性能成本。

source: Cloak simulation
ga: Insamhalta cloak
it: Simulazione di un mantello
ru: Моделирование плаща
ta: ஆடை உருவகப்படுத்துதல்
uk: Симуляція плаща
zh_hant: 斗篷模擬

source: Let's make a cloak in the Platformer3D demo.
ga: Déanaimis clóca sa taispeáint Platformer3D.
it: Creiamo un mantello nella demo di Platformer3D.
ru: Давайте создадим плащ в демо-версии Platformer3D.
ta: இயங்குதளம் 3 டி டெமோவில் ஒரு ஆடை உருவாக்குவோம்.
uk: Давайте зробимо плащ у демоверсії Platformer3D.
zh_hant: 我們將在 Platformer3D 演示中製作一個斗篷。

source: You can download the Platformer3D demo on `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ or `the Asset Library <https://godotengine.org/asset-library/asset/2748>`_.
ga: Is féidir leat an taispeántas Platformer3D a íoslódáil ar `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ nó `the Asset Library <https://godotengine.org/ asset-library/asset/2748>`_.
it: È possibile scaricare la demo di Platformer3D su `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ o sulla `Libreria dei contenuti <https://godotengine.org/asset-library/asset/2748>`_.
ru: Демонстрационную версию Platformer3D можно загрузить на GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer> или в Asset Library <https://godotengine.org/asset-library/asset/2748>.
ta: நீங்கள் `Github <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer> _ அல்லது` சொத்து நூலகம் <https://godotengine.org/ சொத்து-நூலகம்/சொத்து/2748> `_.
uk: Ви можете завантажити демоверсію Platformer3D на `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ або `Бібліотека активів <https://godotengine.org/asset-library/asset/2748>`_.
zh_hant: 你可以在 `GitHub <https://github.com/godotengine/godot-demo-projects/tree/master/3d/platformer>`_ 或 `素材庫 <https://godotengine.org/asset-library/asset/2748>`_ 下載 Platformer3D 範例專案。

source: Open the ``Player`` scene, add a ``SoftBody3D`` node and assign a ``PlaneMesh`` to it.
it: Aprire la scena ``Player``, aggiungere un nodo ``SoftBody3D`` e assegnargli un ``PlaneMesh``.
ru: Откройте сцену ``Player``, добавьте узел ``SoftBody3D`` и назначьте ему ``PlaneMesh``.
ta: `` பிளேயர்`` காட்சியைத் திறந்து, ஒரு `` SoftBody3D`` முனையைச் சேர்த்து, அதற்கு ஒரு `` பிளானேமேச்`` ஐ ஒதுக்கவும்.
zh_hant: 開啟 ``Player`` 場景，新增一個 ``SoftBody3D`` 節點並為其指派一個 ``PlaneMesh``。

source: Open the ``PlaneMesh`` properties and set the size(x: 0.5 y: 1) then set ``Subdivide Width`` and ``Subdivide Depth`` to 5. Adjust the ``SoftBody3D``'s position. You should end up with something like this:
it: Aprire le proprietà di ``PlaneMesh`` e imposta size su (x: 0.5 y: 1), poi impostare ``Subdivide Width`` e ``Subdivide Depth`` a 5. Regolare la posizione di ``SoftBody3D``. Si dovrebbe ottenere qualcosa del genere:
ru: Откройте свойства ``PlaneMesh`` и задайте размер (x: 0.5 y: 1), а затем установите ``Subdivide Width`` и ``Subdivide Depth`` на 5. Отрегулируйте положение ``SoftBody3D``. Должно получиться что-то вроде этого:
ta: `` பிளானேமேச்`` பண்புகளைத் திறந்து அளவை அமைக்கவும் (x: 0.5 y: 1) பின்னர் `` துணைப்பிரிவு அகலம்` மற்றும் `` துணைப்பிரிவு ஆழத்தை 5 ஆக அமைக்கவும். `` Softbody3d`` இன் நிலையை சரிசெய்யவும். இதுபோன்ற ஒன்றை நீங்கள் முடிக்க வேண்டும்:
zh_hant: 開啟 ``PlaneMesh`` 的屬性並將大小設為（x: 0.5, y: 1），然後將 ``Subdivide Width`` 與 ``Subdivide Depth`` 設為 5。調整 ``SoftBody3D`` 的位置。你應該會看到像這樣：

source: Subdivision generates a more tessellated mesh for better simulations.
ga: Gineann fo-rannán mogalra níos tessellaithe le haghaidh insamhaltaí níos fearr.
it: La suddivisione genera una mesh più tassellata per migliori simulazioni.
ru: Подразделение создает более мозаичную сетку для лучшего моделирования.
ta: துணைப்பிரிவு சிறந்த உருவகப்படுத்துதல்களுக்கு மிகவும் டெசெலேட்டட் கண்ணி உருவாக்குகிறது.
uk: Subdivision генерує мозаїчну сітку для кращого моделювання.
zh_hant: 細分會生成更細密的網格，以便更好地進行模擬。

source: Add a :ref:`BoneAttachment3D <class_BoneAttachment3D>` node under the skeleton node and select the Neck bone to attach the cloak to the character skeleton.
ga: Cuir nód :ref:`BoneAttachment3D <class_BoneAttachment3D>' leis faoin nód creatlach agus roghnaigh an cnámh Muineál chun an clóca a cheangal de chnámharlach an charachtair.
it: Aggiungere un nodo :ref:`BoneAttachment3D <class_BoneAttachment3D>` sotto il nodo scheletro e selezionare l'osso del collo (Neck) per collegare il mantello allo scheletro del personaggio.
ru: Добавьте узел :ref:`BoneAttachment3D <class_BoneAttachment3D>` под узлом скелета и выберите кость шеи, чтобы прикрепить плащ к скелету персонажа.
ta: A: ref: `boneattachment3d <class_boneattachment3d>` எலும்புக்கூடு முனையின் கீழ் முனை மற்றும் கழுத்து எலும்பைத் தேர்ந்தெடுத்து எழுத்து எலும்புக்கூட்டுடன் ஆடைகளை இணைக்கவும்.
uk: Додайте вузол :ref:`BoneAttachment3D <class_BoneAttachment3D>` під вузлом скелета та виберіть кістку шиї, щоб прикріпити плащ до скелета персонажа.
zh_hant: 在骨架節點下新增 :ref:`BoneAttachment3D <class_BoneAttachment3D>`，然後選擇 Neck 骨骼，將斗篷綁定在角色骨架上。

source: ``BoneAttachment3D`` node is to attach objects to a bone of an armature. The attached object will follow the bone's movement, weapon of a character can be attached this way.
ga: Is é an nód ``BoneAttachment3d`` rudaí a cheangal le cnámh armature. Leanfaidh an réad ceangailte gluaiseacht an chnámh, is féidir arm carachtair a cheangal ar an mbealach seo.
it: Il nodo ``BoneAttachment3D`` serve per attaccare oggetti a un osso di un'armatura. L'oggetto attaccato seguirà il movimento dell'osso; è possibile attaccare l'arma di un personaggio in questo modo.
ru: Узел ``BoneAttachment3D`` предназначен для прикрепления объектов к кости арматуры. Прикреплённый объект будет следовать за движением кости; таким образом можно прикрепить оружие персонажа.
ta: `` Boneattachment3d`` முனை என்பது ஒரு ஆர்மேச்சரின் எலும்புடன் பொருட்களை இணைப்பதாகும். இணைக்கப்பட்ட பொருள் எலும்பின் இயக்கத்தைப் பின்பற்றும், ஒரு பாத்திரத்தின் ஆயுதத்தை இந்த வழியில் இணைக்க முடியும்.
uk: Вузол ``BoneAttachment3D`` призначений для прикріплення об’єктів до кістки арматури. Прикріплений предмет буде слідувати за рухом кістки, таким чином можна прикріпити зброю персонажа.
zh_hant: ``BoneAttachment`` 節點的作用是將物體附著到骨架的某根骨骼上。附著的物體會隨著骨骼運動，角色的武器可以通過這種方式附加。

source: To create pinned joints, select the upper vertices in the ``SoftBody3D`` node:
it: Per creare giunti fissati, selezionare i vertici superiori nel nodo ``SoftBody3D``:
ru: Чтобы создать штифтовые соединения, выберите верхние вершины в узле ``SoftBody3D``:
ta: பின் செய்யப்பட்ட மூட்டுகளை உருவாக்க, `` softbody3d`` முனையில் மேல் செங்குத்துகளைத் தேர்ந்தெடுக்கவும்:
zh_hant: 若要建立釘住的關節，請在 ``SoftBody3D`` 節點中選取上方的頂點：

source: The pinned joints can be found in ``SoftBody3D``'s ``Attachments`` property, choose the ``BoneAttachment`` as the ``SpatialAttachment`` for each pinned joints, the pinned joints are now attached to the neck.
it: I giunti fissati si trovano nella proprietà ``Attachments`` di ``SoftBody3D``, scegliere ``BoneAttachment`` come ``SpatialAttachment`` per ciascun giunto fissato; i giunti fissati sono ora attaccati al collo.
ru: Закрепленные суставы можно найти в свойстве ``Attachments`` объекта ``SoftBody3D``, выберите ``BoneAttachment`` в качестве ``SpatialAttachment`` для каждого закрепленного сустава, теперь закрепленные суставы прикреплены к шее.
ta: பின் செய்யப்பட்ட மூட்டுகளை `` softbodbody3d`` இன் `இணைப்புகள்`` சொத்தில் காணலாம்,` `போனெட் டாக்மென்ட்`` ஐத் தேர்வுசெய்க` `ச்பேடியாலட்டாக்மென்ட்`` ஒவ்வொரு பின் செய்யப்பட்ட மூட்டுகளுக்கும், பின் செய்யப்பட்ட மூட்டுகள் இப்போது கழுத்துடன் இணைக்கப்பட்டுள்ளன.
zh_hant: 在 ``SoftBody3D`` 的 ``Attachments`` 屬性中可以找到這些釘住的關節；為每個釘住的關節將 ``SpatialAttachment`` 設為 ``BoneAttachment``，這些釘住的關節就會連接到頸部。

source: Last step is to avoid clipping by adding the Kinematic Body `Player` to ``Parent Collision Ignore`` of the ``SoftBody3D``.
it: L'ultimo passaggio consiste nell'evitare il clipping, aggiungendo il corpo cinematico `Player` a ``Parent Collision Ignore`` del ``SoftBody3D``.
ru: Последний шаг — избежать обрезки, добавив Kinematic Body `Player` в ``Parent Collision Ignore`` ``SoftBody3D``.
ta: `` SoftBody3d`` இன் `` பெற்றோர் மோதல் `புறக்கணிப்பு` பிளேயரை 'சேர்ப்பதன் மூலம் கிளிப்பிங் செய்வதைத் தவிர்ப்பது கடைசி கட்டமாகும்.
zh_hant: 最後一步是為了避免穿模，將運動學物體 `Player` 加到 ``SoftBody3D`` 的 ``Parent Collision Ignore`` 中。

source: Play the scene and the cloak should simulate correctly.
ga: Seinn an radharc agus ba chóir go n-insamhlaíonn an clóca i gceart.
it: Eseguire la scena e il mantello dovrebbe simularsi correttamente.
ru: Воспроизведите сцену, и плащ должен симулироваться правильно.
ta: காட்சியை விளையாடுங்கள், ஆடை சரியாக உருவகப்படுத்த வேண்டும்.
uk: Розіграйте сцену, і плащ повинен правильно імітувати.
zh_hant: 播放場景，應該已經正確模擬了斗篷。

source: This covers the basic settings of softbody, experiment with the parameters to achieve the effect you are aiming for when making your game.
ga: Clúdaíonn sé seo bunsocruithe softbody, déan triail leis na paraiméadair chun an éifeacht a bhfuil tú ag díriú uirthi agus do chluiche á dhéanamh agat a bhaint amach.
it: Questo copre le impostazioni base di un corpo morbido. Sperimentare con i parametri per ottenere l'effetto desiderato per il gioco.
ru: Здесь рассматриваются основные настройки мягкого тела, экспериментируйте с параметрами, чтобы добиться желаемого эффекта при создании игры.
ta: இது சாப்ட்போடியின் அடிப்படை அமைப்புகளை உள்ளடக்கியது, உங்கள் விளையாட்டை உருவாக்கும் போது நீங்கள் நோக்கமாகக் கொண்ட விளைவை அடைய அளவுருக்களுடன் ஆய்வு செய்யுங்கள்.
uk: Це охоплює основні налаштування softbody, експериментуйте з параметрами, щоб досягти ефекту, якого ви прагнете, створюючи свою гру.
zh_hant: 這涵蓋了柔體的基本設定，當你製作遊戲時，嘗試這些參數來達到你想要的效果。

source: Using Imported Meshes
it: Utilizzare i mesh importati
ru: Использование импортированных Сеток
ta: இறக்குமதி செய்யப்பட்ட மெச்களைப் பயன்படுத்துதல்
zh_hant: 使用匯入的網格

source: The **Save to File** option in the Advanced Import Settings dialog allows you to save a mesh to a standalone resource file that you can then attach to ``SoftBody3D`` nodes.
it: L'opzione **Salva su file** nella finestra Impostazioni di importazione avanzate consente di salvare una mesh in un file di risorse autonomo che è possibile allegare ai nodi ``SoftBody3D``.
ru: Параметр **Save to File** в диалоговом окне Advanced Import Settings позволяет сохранить сетку в отдельный файл ресурсов, который затем можно прикрепить к узлам ``SoftBody3D``.
ta: மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலில் ** கோப்பில் சேமி ** விருப்பம் ஒரு தனித்துவமான வள கோப்பில் ஒரு கண்ணி சேமிக்க உங்களை அனுமதிக்கிறது, பின்னர் நீங்கள் `` Softbody3d`` முனைகளுடன் இணைக்கலாம்.
zh_hant: 在進階匯入設定對話框中的 **Save to File** (另存為檔案) 選項, 允許你將網格儲存為獨立的資源檔, 之後即可將其指派給 ``SoftBody3D`` 節點。

source: You may also want to disable LOD generation or change the LOD generation options when importing a mesh for use with ``SoftBody3D``. The default import settings will produce an LOD that merges adjacent faces that are nearly flat with respect to each other, even at very close render distances. This works well for static meshes, but is often undesirable for use with ``SoftBody3D`` if you want these faces to be able to bend and move with respect to each other, instead of being rendered as a single plane.
it: Si consiglia inoltre di disabilitare la generazione dei LOD o di modificarne le opzioni durante l'importazione di una mesh da utilizzare con ``SoftBody3D``. Le impostazioni predefinite produrranno un LOD che unisce facce adiacenti quasi piatte tra loro, anche da molto vicino per il rendering. Ciò funziona bene per le mesh statiche, ma è spesso sconsigliata all'uso con ``SoftBody3D`` se si desidera che queste facce possano piegarsi e muoversi l'una rispetto all'altra, anziché essere renderizzate come un unico piano.
ru: Вы также можете отключить генерацию уровня детализации (LOD) или изменить параметры генерации при импорте сетки для использования в ``SoftBody3D``. Настройки импорта по умолчанию создадут LOD, объединяющий смежные грани, которые практически плоские относительно друг друга, даже на очень близких расстояниях рендеринга. Это хорошо подходит для статических сеток, но часто нежелательно для использования в ``SoftBody3D``, если вы хотите, чтобы грани могли изгибаться и двигаться относительно друг друга, а не визуализироваться как одна плоскость.
ta: `` SoftBody3d`` உடன் பயன்படுத்த ஒரு கண்ணி இறக்குமதி செய்யும் போது LOD தலைமுறையை முடக்க அல்லது LOD தலைமுறை விருப்பங்களை மாற்றவும் விரும்பலாம். இயல்புநிலை இறக்குமதி அமைப்புகள் ஒரு LOD ஐ உருவாக்கும், இது அருகிலுள்ள முகங்களை ஒன்றிணைக்கும், அவை ஒருவருக்கொருவர் தொடர்பாக கிட்டத்தட்ட தட்டையானவை, மிக நெருக்கமான வழங்குதல் தூரங்களில் கூட. இது நிலையான மெச்களுக்கு நன்றாக வேலை செய்கிறது, ஆனால் இந்த முகங்கள் ஒற்றை விமானமாக வழங்கப்படுவதற்குப் பதிலாக, ஒருவருக்கொருவர் வளைந்து, நகர்த்த முடியும் என்று நீங்கள் விரும்பினால், `` SoftBody3D`` உடன் பயன்படுத்த பெரும்பாலும் விரும்பத்தகாதது.
zh_hant: 在匯入要給 ``SoftBody3D`` 使用的網格時，你也可能需要停用或調整 LOD 產生選項。預設匯入設定會產生一個 LOD，將彼此幾乎共平面的相鄰面合併，即使在非常近的繪製距離也是如此。這對靜態網格很合適，但若你希望這些面能彼此彎曲變形並相對移動，而不是被當成單一平面來繪製，那對 ``SoftBody3D`` 來說往往並不理想。

source: See :ref:`doc_importing_3d_scenes_import_configuration` and :ref:`doc_mesh_lod` for more details.
it: Consultare :ref:`doc_importing_3d_scenes_import_configuration` e :ref:`doc_mesh_lod` per maggiori dettagli.
ru: Более подробную информацию см. в разделах :ref:`doc_importing_3d_scenes_import_configuration` и :ref:`doc_mesh_lod`.
ta: காண்க: ref: `doc_importing_3d_scenes_import_configuration` மற்றும்: ref:` doc_mesh_lod` மேலும் விவரங்களுக்கு.
zh_hant: 詳情請見 :ref:`doc_importing_3d_scenes_import_configuration` 與 :ref:`doc_mesh_lod`。

source: Using SoftBody
ga: SoftBody ag baint úsáide as
uk: Використання SoftBody

source: Create a new scene with a ``Node3D`` node as root. Then, create a ``Softbody`` node. Add a ``CubeMesh`` in the ``mesh`` property of the node in the inspector and increase the subdivision of the mesh for simulation.
ga: Cruthaigh radharc nua le nód ``Node3D`` mar fhréamh. Ansin, cruthaigh nód ``Softbody`. Cuir ``Cubemesh`` i maoin ``mesh`` an nód sa chigire agus méadaigh fo-roinnt na mogalra le haghaidh insamhalta.
uk: Створіть нову сцену з вузлом ``Node3D`` як root. Потім створіть вузол ``Softbody``. Додайте ``CubeMesh`` у властивість ``mesh`` вузла в інспекторі та збільште підрозділ сітки для моделювання.

source: Open the ``Player`` scene, add a ``SoftBody`` node and assign a ``PlaneMesh`` to it.
ga: Oscail an radharc ``Player`, cuir nód ``Softbody`` leis agus sannadh ``PlaneMesh`` dó.
uk: Відкрийте сцену ``Player``, додайте вузол ``SoftBody`` і призначте йому ``PlaneMesh``.

source: Open the ``PlaneMesh`` properties and set the size(x: 0.5 y: 1) then set ``Subdivide Width`` and ``Subdivide Depth`` to 5. Adjust the ``SoftBody``'s position. You should end up with something like this:
ga: Oscail na hairíonna ``PlaneMesh`` agus socraigh an méid (x: 0.5 y: 1) ansin socraigh ```Leithead Subdividen`` agus ``Doimhneacht Subdividen`` go 5. Coigeartaigh suíomh an ``Softbody`. Ba chóir duit rud éigin mar seo a chur i gcrích:
uk: Відкрийте властивості ``PlaneMesh`` і встановіть розмір (x: 0,5 y: 1), а потім встановіть ``Subdivide Width`` і ``Subdivide Depth`` на 5. Налаштуйте положення ``SoftBody``. Ви повинні отримати щось на зразок цього:

source: To create pinned joints, select the upper vertices in the ``SoftBody`` node:
ga: Chun hailt binneáilte a chruthú, roghnaigh na coirteanna uachtaracha sa nód ``Softbody`:
uk: Щоб створити штифтові з’єднання, виберіть верхні вершини у вузлі ``SoftBody``:

source: The pinned joints can be found in ``SoftBody``'s ``Attachments`` property, choose the ``BoneAttachment`` as the ``SpatialAttachment`` for each pinned joints, the pinned joints are now attached to the neck.
ga: Is féidir na hailt binneáilte a fháil i maoin ```Ceangail ``Softbody`, roghnaigh an ``BoneAttachment`` mar an ``SpatialAttachment`` do gach hailt binneáilte, tá na hailt binneáilte ceangailte anois leis an muineál.
uk: Штифтові суглоби можна знайти у властивості ``Attachments`` ``SoftBody``, виберіть ``BoneAttachment`` як ``SpatialAttachment`` для кожного штифтового суглоба, тепер штифтові суглоби прикріплено до шиї.
