Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/troubleshooting_physics_issues.po
Languages: ga, it, ru, ta, uk, zh_cn, zh_tw

source: The best way to work around this issue is to create a "composite" collider. This means that instead of individual tiles having their collision, you create a single collision shape representing the collision for a group of tiles. Typically, you should split composite colliders on a per-island basis (which means each group of touching tiles gets its own collider).
ga: Is é an bealach is fearr chun oibriú ar an gceist seo ná imbhuailteoir "ilchodach" a chruthú. Ciallaíonn sé seo, in ionad tíleanna aonair a bheith imbhuailte, cruthaíonn tú cruth imbhuailte amháin a sheasann don imbhualadh do ghrúpa tíleanna. De ghnáth, ba cheart duit imbhuailteoirí ilchodacha a roinnt ar bhonn in aghaidh an oileáin (rud a chiallaíonn go bhfaigheann gach grúpa tíleanna tadhaill a imbhuailteoir féin).
it: Il modo migliore per aggirare questo problema è creare un collisore "composito". Ciò significa che, invece di far collidere i singoli tasselli, si crea una singola forma di collisione che rappresenta la collisione per un gruppo di tasselli. In genere, si dovrebbero suddividere i collisori compositi in base alle singole isole (il che significa che ogni gruppo di tasselli in contatto ha il proprio collisore).
ru: Лучший способ обойти эту проблему — создать «составной» коллайдер. Это означает, что вместо столкновения отдельных тайлов вы создаете единую форму столкновения, представляющую столкновение для группы тайлов. Как правило, вам следует разделять составные коллайдеры по каждому острову (это означает, что каждая группа соприкасающихся тайлов получает свой собственный коллайдер).
ta: இந்த சிக்கலைச் சுற்றி பணியாற்றுவதற்கான சிறந்த வழி "கலப்பு" மோதலை உருவாக்குவதாகும். இதன் பொருள் என்னவென்றால், தனிப்பட்ட ஓடுகள் அவற்றின் மோதலைக் கொண்டிருப்பதற்குப் பதிலாக, ஓடுகளின் குழுவிற்கான மோதலைக் குறிக்கும் ஒற்றை மோதல் வடிவத்தை உருவாக்குகிறீர்கள். பொதுவாக, நீங்கள் ஒரு தீவுக்கு ஒரு அடிப்படையில் கலப்பு கோலிடர்களை பிரிக்க வேண்டும் (அதாவது ஒவ்வொரு குழுவும் அதன் சொந்த மோதலைப் பெறுகிறது).
uk: Найкращий спосіб вирішити цю проблему — створити «композитний» колайдер. Це означає, що замість зіткнення окремих плиток ви створюєте єдину форму зіткнення, що представляє зіткнення для групи плиток. Як правило, ви повинні розділити складені колайдери на острівну основу (це означає, що кожна група плиток, що дотикаються, отримує власний колайдер).
zh_cn: 解决该问题最好的代替方案是创建一个“复合”碰撞体。这意味着不使用带有自己碰撞体的独立图块，而是创建一个单独的碰撞形状代表一组图块的碰撞体。通常，你应该按照岛屿基础来分割复合碰撞器（这意味着每组相连的瓦片都有自己的碰撞器）。
zh_tw: 最佳的解決方式是製作「複合碰撞體」。也就是說，不要讓每個瓷磚（Tile）都有自己獨立的碰撞形狀，而是為一組相連的瓷磚建立單一的碰撞形狀。通常建議以區塊（每組連在一起的瓷磚）為單位切分複合碰撞體。

source: Using a composite collider can also improve physics simulation performance in certain cases. However, since the composite collision shape is much more complex, this may not be a net performance win in all cases.
ga: Is féidir le cumaltóir ilchodach a úsáid feidhmíocht insamhalta fisic a fheabhsú i gcásanna áirithe. Mar sin féin, ós rud é go bhfuil cruth an imbhuailte ilchodach i bhfad níos casta, b'fhéidir nach bua glanfheidhmíochta é seo i ngach cás.
it: Utilizzare un collisore composito può anche migliorare le prestazioni della simulazione fisica in alcuni casi. Tuttavia, poiché la forma composita di collisione è molto più complessa, ciò potrebbe non risultare in un netto positivo sulle prestazioni in tutti i casi.
ru: Использование составного коллайдера также может в некоторых случаях повысить производительность физического анализа. Однако, поскольку составная форма реализуется гораздо сложнее, она не во всех случаях может принести чистый выигрыш в производительности.
ta: ஒரு கலப்பு மோதலைப் பயன்படுத்துவது சில சந்தர்ப்பங்களில் இயற்பியல் உருவகப்படுத்துதல் செயல்திறனை மேம்படுத்தலாம். இருப்பினும், கலப்பு மோதல் வடிவம் மிகவும் சிக்கலானது என்பதால், இது எல்லா நிகழ்வுகளிலும் நிகர செயல்திறன் வெற்றியாக இருக்காது.
uk: Використання композитного колайдера також може покращити продуктивність фізичного моделювання в певних випадках. Однак, оскільки комбінована форма зіткнення є набагато складнішою, це не може бути чистим виграшем продуктивності у всіх випадках.
zh_cn: 在某些情况下，使用一个复合碰撞体也可以提升物理仿真性能。然而，由于复合碰撞体要复杂的多，这也许并不是在所有情况下都是对总体性能的提升。
zh_tw: 有時候使用複合碰撞體也能提升物理模擬效能。但因為複合碰撞形狀本身也可能變得很複雜，不見得所有情境下都能提昇效能。

source: In Godot 4.5 and later, creating a composite collider is automatically done when using a TileMapLayer node. The chunk size (``16`` tiles on each axis by default) can be set using the **Physics Quadrant Size** property in the TileMapLayer inspector. Larger values provide more reliable collision, at the cost of slower updates when the TileMap is changed.
it: In Godot 4.5 e versioni successive, la creazione di un collisore composito è eseguita automaticamente se si utilizza un nodo TileMapLayer. La dimensione del blocco (predefinito su ``16`` tasselli su ciascun asse) si può impostare tramite la proprietà **Dimensione di quadranti di fisica** nell'ispettore di TileMapLayer. Valori più elevati rendono le collisioni più affidabili, a scapito di aggiornamenti più lenti quando la TileMap viene modificata.
zh_tw: 在 Godot 4.5 之後，使用 TileMapLayer 節點時會自動建立複合碰撞體。分塊大小（預設每軸 ``16`` 個圖塊）可在 TileMapLayer 的檢視器中透過 **Physics Quadrant Size** 屬性設定。數值越大，碰撞越可靠，但在變更 TileMap 時更新會較慢。

source: Framerate drops when an object touches another object
ga: Titeann framerate nuair a théann réad i dteagmháil le réad eile
it: Il frame rate cala quando un oggetto tocca un altro oggetto
ru: Частота кадров падает, когда объект касается другого объекта
ta: ஒரு பொருள் மற்றொரு பொருளைத் தொடும்போது ஃப்ரேம்ரேட் சொட்டுகள்
uk: Частота кадрів падає, коли об’єкт торкається іншого об’єкта
zh_cn: 当一个对象接触另一个对象时，帧率会下降
zh_tw: 物件互相接觸時畫面更新率下降

source: This is likely due to one of the objects using a collision shape that is too complex. Convex collision shapes should use a number of shapes as low as possible for performance reasons. When relying on Godot's automatic generation, it's possible that you ended up with dozens if not hundreds of shapes created for a single convex shape collision resource.
ga: Is dócha go bhfuil sé seo i gceist toisc go n-úsáideann ceann de na rudaí cruth imbhuailte atá ró-chasta. Ba cheart go n-úsáidfeadh cruthanna imbhuailte dronnach roinnt cruthanna chomh híseal agus is féidir ar chúiseanna feidhmíochta. Agus tú ag brath ar ghiniúint uathoibríoch Godot, d'fhéadfadh sé go raibh mórán cruthanna, más rud é nach bhfuil na céadta, cruthaithe agat le haghaidh acmhainn imbhuailte cruth dronnach amháin.
it: Ciò è probabilmente dovuto al fatto che uno degli oggetti utilizza una forma di collisione troppo complessa. Le forme convesse di collisione dovrebbero usare il minor numero possibile di forme per motivi di prestazioni. Quando ci si affida alla generazione automatica di Godot, è possibile che si ottengano decine, se non centinaia, di forme create per una singola risorsa di forma convessa di collisione.
ru: Вероятно, это связано с тем, что один из объектов использует слишком сложную форму столкновения. Выпуклые формы столкновений должны использовать как можно меньшее количество фигур из соображений производительности. Полагаясь на автоматическую генерацию Godot, возможно, вы получите десятки, если не сотни фигур, созданных для одного ресурса столкновения выпуклых форм.
ta: மிகவும் சிக்கலான மோதல் வடிவத்தைப் பயன்படுத்தும் பொருள்களில் ஒன்று இது காரணமாக இருக்கலாம். குவிந்த மோதல் வடிவங்கள் செயல்திறன் காரணங்களுக்காக பல வடிவங்களை முடிந்தவரை குறைவாகப் பயன்படுத்த வேண்டும். கோடோட்டின் தானியங்கி தலைமுறையை நம்பும்போது, ஒற்றை குவிந்த வடிவ மோதல் வளத்திற்காக உருவாக்கப்பட்ட நூற்றுக்கணக்கான வடிவங்கள் இல்லையென்றால் நீங்கள் டசன் கணக்கானவர்களுடன் முடித்துவிட்டீர்கள்.
uk: Ймовірно, це пов’язано з тим, що один із об’єктів використовує надто складну форму зіткнення. Опуклі форми зіткнення мають використовувати якомога меншу кількість форм з міркувань продуктивності. Якщо покладатися на автоматичну генерацію Godot, можливо, ви отримали десятки, якщо не сотні фігур, створених для одного ресурсу зіткнення опуклих форм.
zh_cn: 这很可能是因为其中一个物体使用的碰撞形状过于复杂。出于性能原因，凸形碰撞形状应该尽可能使用最少数量的形状。当依赖于Godot的自动生成时，可能会为单个凸形碰撞资源创建数十甚至数百个形状。
zh_tw: 這通常是因為某個物件使用了過於複雜的碰撞形狀。為了效能考量，凸形（Convex）碰撞體應盡量減少構成形狀的數量。若你用 Godot 自動產生碰撞形狀，可能會為單一碰撞資源產生數十甚至上百個形狀，造成效能下滑。

source: In some cases, replacing a convex collider with a couple of primitive collision shapes (box, sphere, or capsule) can deliver better performance.
ga: I roinnt cásanna, is féidir feidhmíocht níos fearr a sholáthar do chúpla cruthanna imbhuailte bunaidh (bosca, sféar nó capsúl) a chur in ionad imbhuaileoir doimhneach.
it: In alcuni casi, sostituire un collisore convesso con un paio di forme primitive di collisione (scatola, sfera o capsula) può offrire prestazioni migliori.
ru: В некоторых случаях замена выпуклого коллайдера парой примитивных форм столкновения (коробка, сфера или капсула) может обеспечить лучшую производительность.
ta: சில சந்தர்ப்பங்களில், ஒரு குவிந்த மோதலை இரண்டு பழமையான மோதல் வடிவங்களுடன் (பெட்டி, கோளம் அல்லது காப்ச்யூல்) மாற்றுவது சிறந்த செயல்திறனை வழங்கும்.
uk: У деяких випадках заміна опуклого коллайдера парою примітивних форм зіткнення (ящик, сфера чи капсула) може забезпечити кращу продуктивність.
zh_cn: 在一些场景中，用一组基础的碰撞形状(盒，球体或胶囊)替换一个凸形碰撞器可能带来更好的性能。
zh_tw: 有時候用幾個簡單的基本碰撞形狀（如盒型、球型或膠囊型）取代原本的凸形碰撞體，可以大幅提升效能。

source: This issue can also occur with StaticBodies that use very detailed trimesh (concave) collisions. In this case, use a simplified representation of the level geometry as a collider. Not only this will improve physics simulation performance significantly, but this can also improve stability by letting you remove small fixtures and crevices from being considered by collision.
ga: Is féidir leis an tsaincheist seo tarlú freisin le StaticBodies a úsáideann imbhuailtí an-mhionsonraithe trimesh (cuasach). Sa chás seo, bain úsáid as léiriú simplithe ar an gcéimseata leibhéal mar imbhuailteoir. Ní hamháin go bhfeabhsóidh sé seo feidhmíocht insamhalta fisice go suntasach, ach féadann sé seo cobhsaíocht a fheabhsú freisin trí ligean duit daingneáin agus scáintí beaga a bhaint as a bheith á mbreithniú ag imbhualadh.
ru: Эта проблема также может возникнуть со StaticBodies, которые используют очень подробные коллизии с использованием вогнутых сеток (треугольных сеток). В этом случае используйте упрощённое представление геометрии уровня в качестве коллайдера. Это не только значительно улучшит производительность моделирования физики, но и повысит стабильность, позволяя исключить мелкие фиксаторы и трещины из рассмотрения при коллизиях.
ta: மிகவும் விரிவான டிரிமேச் (குழிவான) மோதல்களைப் பயன்படுத்தும் ச்டாடிக்பாடிகளிலும் இந்த சிக்கல் ஏற்படலாம். இந்த வழக்கில், நிலை வடிவவியலின் எளிமைப்படுத்தப்பட்ட பிரதிநிதித்துவத்தை ஒரு மோதலாகப் பயன்படுத்துங்கள். இது இயற்பியல் உருவகப்படுத்துதல் செயல்திறனை கணிசமாக மேம்படுத்துவது மட்டுமல்லாமல், சிறிய சாதனங்கள் மற்றும் பிளவுகளை மோதலால் பரிசீலிப்பதில் இருந்து அகற்ற அனுமதிப்பதன் மூலம் இது ச்திரத்தன்மையை மேம்படுத்தலாம்.
uk: Ця проблема також може виникнути зі статичними тілами, які використовують дуже детальні трійчасті (увігнуті) зіткнення. У цьому випадку використовуйте спрощене представлення геометрії рівня як колайдера. Це не тільки значно покращить продуктивність фізичного моделювання, але також може покращити стабільність, дозволяючи усунути невеликі кріплення та щілини від зіткнення.
zh_cn: 这个问题也可能发生在使用非常详细的三角网格（凹形）碰撞的静态刚体（StaticBodies）上。在这种情况下，使用简化的几何表示作为碰撞器。这不仅可以显著提高物理模拟的性能，还可以通过让你移除小的固定装置和缝隙，从而不被碰撞考虑，来提高稳定性。
zh_tw: 這個問題也可能發生在使用高細節三角網格（trimesh，凹面）碰撞的靜態物件（StaticBody）上。此時建議用簡化後的關卡幾何模型來做碰撞體，這不只大幅提升物理效能，還能排除小型突出物或縫隙，讓碰撞更穩定。

source: In 3D, switching the physics engine from the default GodotPhysics to Jolt can also improve performance. See :ref:`doc_using_jolt_physics` for more information.
zh_tw: 在 3D 中，將物理引擎從預設的 GodotPhysics 切換為 Jolt 也能提升效能。詳情請見 :ref:`doc_using_jolt_physics`。

source: Framerate suddenly drops to a very low value beyond a certain amount of physics simulation
ru: Частота кадров внезапно падает до очень низкого значения за пределами определенного уровня симуляции физики
ta: ஒரு குறிப்பிட்ட அளவு இயற்பியல் உருவகப்படுத்துதலுக்கு அப்பால் பிரேம்ரேட் திடீரென்று மிகக் குறைந்த மதிப்புக்கு குறைகிறது
uk: Частота кадрів раптово падає до дуже низького значення за межами певної фізичної симуляції
zh_tw: 物理模擬數量超過某個門檻時幀率驟降

source: This occurs because the physics engine can't keep up with the expected simulation rate. In this case, the framerate will start dropping, but the engine is only allowed to simulate a certain number of physics steps per rendered frame. This snowballs into a situation where framerate keeps dropping until it reaches a very low framerate (typically 1-2 FPS) and is called the *physics spiral of death*.
ru: Это происходит из-за того, что физический движок не справляется с ожидаемой частотой симуляции. В этом случае частота кадров начинает падать, но движку разрешено симулировать лишь определённое количество шагов физики за один отрисовываемый кадр. Это приводит к ситуации, когда частота кадров продолжает падать, пока не достигнет очень низкого значения (обычно 1-2 FPS), что называется *физической спиралью смерти*.
ta: இது நிகழ்கிறது, ஏனெனில் இயற்பியல் இயந்திரத்தால் எதிர்பார்க்கப்படும் உருவகப்படுத்துதல் வீதத்தைத் தொடர முடியாது. இந்த வழக்கில், ஃபிரேம்ரேட் கைவிடத் தொடங்கும், ஆனால் இயந்திரம் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான இயற்பியல் படிகளை உருவகப்படுத்த அனுமதிக்கப்படுகிறது. இந்த பனிப்பந்துகள் ஒரு சூழ்நிலையாக பிரேம்ரேட் மிகக் குறைந்த பிரேம்ரேட்டை (பொதுவாக 1-2 எஃப்.பி.எச்) அடையும் வரை வீழ்ச்சியடைந்து, *மரணத்தின் இயற்பியல் சுழல் *என்று அழைக்கப்படுகிறது.
uk: Це відбувається тому, що фізичний механізм не може встигати за очікуваною швидкістю моделювання. У цьому випадку частота кадрів почне падати, але двигуну дозволено імітувати лише певну кількість кроків фізики на візуалізований кадр. Це сніжки в ситуації, коли частота кадрів продовжує падати, поки не досягне дуже низької частоти кадрів (зазвичай 1-2 FPS), і це називається *фізична спіраль смерті*.
zh_tw: 這是因為物理引擎無法跟上預期的模擬速率。一旦出現這種情況，畫面更新率會開始下滑，但引擎每幀允許的物理步驟有限，這會造成惡性循環，幀率愈降愈低，最後只剩下 1-2 FPS，這種現象稱為 *物理死亡螺旋*。

source: To avoid this, you should check for situations in your project that can cause excessive number of physics simulations to occur at the same time (or with excessively complex collision shapes). If these situations cannot be avoided, you can increase the **Max Physics Steps per Frame** project setting and/or reduce **Physics Ticks per Second** to alleviate this.
ru: Чтобы избежать этого, следует проверить наличие в проекте ситуаций, которые могут привести к чрезмерному количеству одновременных симуляций физики (или к чрезмерно сложным формам столкновений). Если избежать таких ситуаций невозможно, можно увеличить значение параметра проекта **Max Physics Steps per Frame** и/или уменьшить значение **Physics Ticks per Second**, чтобы смягчить последствия.
ta: இதைத் தவிர்க்க, உங்கள் திட்டத்தில் உள்ள சூழ்நிலைகளை நீங்கள் சரிபார்க்க வேண்டும், அவை அதிக எண்ணிக்கையிலான இயற்பியல் உருவகப்படுத்துதல்கள் ஒரே நேரத்தில் ஏற்படக்கூடும் (அல்லது அதிகப்படியான சிக்கலான மோதல் வடிவங்களுடன்). இந்த சூழ்நிலைகளைத் தவிர்க்க முடியாவிட்டால், இதைத் தணிக்க நீங்கள் ஒரு சட்டத்திற்கு ** அதிகபட்ச இயற்பியல் படிகளை ** திட்ட அமைப்பிற்கு அதிகரிக்கலாம் மற்றும்/அல்லது குறைக்க ** இயற்பியல் உண்ணி **.
uk: Щоб уникнути цього, вам слід перевірити, чи немає у вашому проекті ситуацій, які можуть викликати надмірну кількість симуляцій фізики одночасно (або з надто складними формами зіткнень). Якщо цих ситуацій неможливо уникнути, ви можете збільшити параметр проекту **Максимальні кроки фізики на кадр** і/або зменшити **Тіки фізики за секунду**, щоб полегшити це.
zh_tw: 為避免這種情況，請檢查專案是否有同時觸發大量物理模擬，或有過於複雜的碰撞形狀。若無法避免，可提高 **每幀最大物理步數（Max Physics Steps per Frame）**，並/或降低 **每秒物理更新次數（Physics Ticks per Second）** 來緩解。

source: Physics simulation is unreliable when far away from the world origin
ga: Tá insamhalta fisic neamhiontaofa nuair a bhíonn sé i bhfad ar shiúl
ru: Физическое моделирование ненадежно, когда оно находится далеко от начала координат мира
ta: உலக வம்சாவளியில் இருந்து வெகு தொலைவில் இருக்கும்போது இயற்பியல் உருவகப்படுத்துதல் நம்பமுடியாதது
uk: Фізичне моделювання ненадійне, коли далеко від походження світу
zh_cn: 物理仿真在远离世界原点的地方是不可靠的
zh_tw: 物理模擬距離世界原點太遠時會變得不可靠

source: This is caused by floating-point precision errors, which become more pronounced as the physics simulation occurs further away from the world origin. This issue also affects rendering, which results in wobbly camera movement when far away from the world origin. See :ref:`doc_large_world_coordinates` for more information.
ga: Is cúis leis seo earráidí cruinneas pointe snámh, a éiríonn níos suntasaí de réir mar a tharlaíonn an insamhalta fisice níos faide ó bhunús an domhain. Bíonn tionchar ag an tsaincheist seo ar rindreáil freisin, rud a fhágann go mbíonn gluaiseacht ceamara luath agus é i bhfad ó bhunús an domhain Féach:ref: `doc_large_world_coordinates` le haghaidh tuilleadh faisnéise.
ru: Это вызвано ошибками точности операций с плавающей точкой, которые становятся более выраженными по мере удаления моделирования физики от начала координат. Эта проблема также влияет на рендеринг, приводя к рывкам камеры при удалении от начала координат. Подробнее см. в документе :ref:`doc_large_world_coordinates`.
ta: இது மிதக்கும்-புள்ளி துல்லியமான பிழைகளால் ஏற்படுகிறது, இது இயற்பியல் உருவகப்படுத்துதல் உலக வம்சாவளியிலிருந்து மேலும் தொலைவில் இருப்பதால் இது மேலும் வெளிப்படும். இந்த சிக்கல் வழங்குதல் செய்வதையும் பாதிக்கிறது, இதன் விளைவாக உலக வம்சாவளியில் இருந்து வெகு தொலைவில் இருக்கும்போது வேகமான கேமரா இயக்கத்திற்கு வழிவகுக்கிறது. காண்க: குறிப்பு: மேலும் தகவலுக்கு `doc_large_world_coordinates`.
uk: Це викликано помилками точності з плаваючою комою, які стають більш вираженими, оскільки фізичне моделювання відбувається далі від початку світу. Ця проблема також впливає на візуалізацію, що призводить до хиткого руху камери на великій відстані від джерела світу. Перегляньте :ref:`doc_large_world_coordinates` для отримання додаткової інформації.
zh_cn: 这是由浮点数的精度误差引起的，当距离世界原点越远时，误差越明显。这个问题也影响渲染，当远离世界原点时可能会导致相机移动使摇晃。有关更多信息，参见 :ref:`doc_large_world_coordinates` 。
zh_tw: 這是因為浮點數精度誤差，當物理模擬發生在距離世界原點很遠的地方時，誤差會加劇。這也會影響畫面渲染，例如相機畫面晃動。請參閱 :ref:`doc_large_world_coordinates` 以瞭解更多資訊。

source: We recommend using box or capsule collision shapes for characters for now. Boxes generally provide the best reliability, but have the downside of making the character take more space diagonally. Capsule collision shapes do not have this downside, but their shape can make precision platforming more difficult.
ga: Molaimid cruthanna imbhuailte bosca nó capsúil a úsáid do charachtair anois. De ghnáth soláthraíonn boscaí an iontaofacht is fearr, ach tá an taobh míbhuntáiste acu a thabhairt don charachtar níos mó spáis go trasnánach. Níl an taobh míbhuntáiste seo ag cruthanna imbhuailte capsúil, ach is féidir lena gcruth ardfhoirmiú cruinneas a dhéanamh níos deacra.
ru: На данный момент мы рекомендуем использовать для персонажей формы столкновения коробок или капсул. Коробки обычно обеспечивают лучшую надежность, но имеют недостаток: персонажу требуется больше места по диагонали. Формы столкновения капсул не имеют этого недостатка, но их форма может затруднить точный платформер.
ta: இப்போது எழுத்துக்களுக்கான பெட்டி அல்லது காப்ச்யூல் மோதல் வடிவங்களைப் பயன்படுத்த பரிந்துரைக்கிறோம். பெட்டிகள் பொதுவாக சிறந்த நம்பகத்தன்மையை வழங்குகின்றன, ஆனால் பாத்திரத்தை அதிக இடத்தை குறுக்காக எடுக்கச் செய்வதன் தீங்கு உள்ளது. காப்ச்யூல் மோதல் வடிவங்களுக்கு இந்த தீங்கு இல்லை, ஆனால் அவற்றின் வடிவம் துல்லியமான இயங்குதளத்தை மிகவும் கடினமாக்கும்.
uk: Наразі ми рекомендуємо використовувати форми зіткнень коробок або капсул для персонажів. Ящики, як правило, забезпечують найкращу надійність, але мають недолік: персонаж займає більше місця по діагоналі. Форми зіткнення капсули не мають цього недоліку, але їх форма може ускладнити точне платформерування.
zh_cn: 我们建议目前使用盒或胶囊形状的碰撞体来模拟角色。盒形状通常提供最佳的可靠性，但缺点是使角色在对角线上占用更多的空间。胶囊碰撞形状没有这个缺点，但它们的形状可能会使精确的平台跳跃更加困难。

source: Increase **Physics Ticks Per Second** in the advanced Project Settings. While this has other benefits (such as more stable simulation and reduced input lag), this increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
zh_cn: 在项目设置中增加 **每秒物理周期数**。虽然这有其他好处（例如更稳定的模拟和减少输入延迟），但这会增加CPU的使用率，可能不适用于移动或网页平台。对于大多数显示器来说，应该优先选择默认值60的倍数（如120、180或240），以获得平滑的外观。

source: Increasing the physics simulation rate can help alleviate this issue. To do so, increase **Physics Ticks Per Second** in the advanced Project Settings. Note that increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
zh_cn: 提升物理模拟频率可以帮助减少这个问题。为了这么做，增加项目设置中的 **每秒物理周期数** 选项。请注意，这会增加CPU的使用率，可能不适用于移动或网页平台。对于大多数显示器来说，应该优先选择默认值60的倍数（如120、180或240），以获得平滑的外观。

source: In both cases, increasing the physics simulation rate can also help alleviate this issue. To do so, increase **Physics Ticks Per Second** in the advanced Project Settings. Note that this increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
zh_cn: 在这两种情况下，提高物理仿真的速率也可以帮助缓解这个问题。为此，可以在项目设置中增加**每秒物理周期数**。请注意，这会增加CPU的使用率，可能不适用于移动或网页平台。对于大多数显示器来说，应该优先选择默认值60的倍数（如120、180或240），以获得平滑的外观。

source: Fast-moving vehicles can benefit a lot from an increased physics simulation rate. To do so, increase **Physics Ticks Per Second** in the advanced Project Settings. Note that this increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
zh_cn: 快速移动的物体可以从被增加的物理仿真频率中得到很多好处。为了这么做，在项目设置中调高 **每秒物理周期数**。请注意，这会提高CPU的使用率而且可能在移动或web平台上不适用。对于大多数显示器来说，应该优先选择默认值60的倍数（如120、180或240），以获得平滑的外观。

source: Translation status
zh_cn: 翻译状态
