Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/troubleshooting_physics_issues.po
Languages: ga, it, ru, ta, uk, zh_cn, zh_tw

source: Troubleshooting physics issues
ga: Saincheisteanna fisice a fhad
it: Risoluzione di problemi sulla fisica
ru: Устранение неполадок в физике
ta: இயற்பியல் சிக்கல்களை சரிசெய்தல்
uk: Усунення проблем з фізикою
zh_cn: 物理问题的故障排除
zh_tw: 物理問題疑難排解

source: When working with a physics engine, you may encounter unexpected results.
ga: Agus tú ag obair le hinneall fisice, d'fhéadfá torthaí gan choinne a bheith agat.
it: Quando si lavora con un motore di fisica, si possono ottenere risultati inaspettati.
ru: При работе с физическим движком вы можете столкнуться с неожиданными результатами.
ta: இயற்பியல் இயந்திரத்துடன் பணிபுரியும் போது, நீங்கள் எதிர்பாராத முடிவுகளை எதிர்கொள்ளலாம்.
uk: Працюючи з фізичним механізмом, ви можете зіткнутися з несподіваними результатами.
zh_cn: 使用物理引擎时，你可能会遇到一些意想不到的问题。
zh_tw: 在使用物理引擎時，你可能會遇到預料之外的結果。

source: While many of these issues can be resolved through configuration, some of them are the result of engine bugs. For known issues related to the physics engine, see `open physics-related issues on GitHub <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Aphysics>`__. Looking through `closed issues <https://github.com/godotengine/godot/issues?q=+is%3Aclosed+is%3Aissue+label%3Atopic%3Aphysics>`__ can also help answer questions related to physics engine behavior.
ga: Cé gur féidir go leor de na saincheisteanna seo a réiteach trí chumraíocht, tá cuid acu mar thoradh ar fhabhtanna innill. Le haghaidh saincheisteanna aitheanta a bhaineann le hinneall na fisice, féach `ceisteanna oscailte a bhaineann le fisic ar GitHub <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Aphysics>` __. Ag féachaint trí `shaincheisteanna dúnta <https://github.com/godotengine/godot/issues?q=+is%3Aclosed+is%3Aissue+label%3Atopic%3Aphysics>`__ is féidir cabhrú freisin le ceisteanna a fhreagairt a bhaineann le hiompar inneall na fisice.
it: Sebbene molti di questi problemi si possano risolvere tramite configurazione, alcuni sono il risultato di bug del motore. Per problemi noti relativi al motore di fisica, consultare i `problemi aperti relativi alla fisica su GitHub <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Aphysics>`__. Consultare `problemi chiusi <https://github.com/godotengine/godot/issues?q=+is%3Aclosed+is%3Aissue+label%3Atopic%3Aphysics>`__ può anche aiutare a rispondere a domande relative al comportamento del motore di fisica.
ru: Хотя многие из этих проблем можно решить с помощью настройки, некоторые из них являются результатом ошибок движка. Список известных проблем, связанных с физическим движком, можно найти в разделе `открытые проблемы, связанные с физикой на GitHub <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Aphysics>`__. Ознакомление со списком `закрытых проблем <https://github.com/godotengine/godot/issues?q=+is%3Aclosed+is%3Aissue+label%3Atopic%3Aphysics>`__ также может помочь найти ответы на вопросы, связанные с поведением физического движка.
ta: இந்த சிக்கல்களில் பலவற்றை உள்ளமைவு மூலம் தீர்க்க முடியும் என்றாலும், அவற்றில் சில இயந்திர பிழைகளின் விளைவாகும். இயற்பியல் இயந்திரம் தொடர்பான அறியப்பட்ட சிக்கல்களுக்கு, கிட்அப்பில் `திறந்த இயற்பியல் தொடர்பான சிக்கல்களைப் பார்க்கவும் __. `மூடிய சிக்கல்கள் <https://github.com/godotengine/godot/issues?q=+IS%3Acloced+is%3Aissue+label%3Atopicுக்கம்
uk: Хоча багато з цих проблем можна вирішити за допомогою налаштування, деякі з них є результатом помилок двигуна. Щоб дізнатися про відомі проблеми, пов’язані з фізичним механізмом, перегляньте `відкриті проблеми, пов’язані з фізикою, на GitHub <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Aphysics>». __. Перегляд `закритих проблем <https://github.com/godotengine/godot/issues?q=+is%3Aclosed+is%3Aissue+label%3Atopic%3Aphysics>`__ також може допомогти відповісти на запитання, пов’язані з поведінкою фізичного механізму.
zh_cn: 虽然其中许多问题可以通过配置解决，但其中一些问题是引擎错误造成的。有关物理引擎相关的已知问题，请参阅 `GitHub 上开放的物理相关问题 <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Aphysicals>`__ 。查看 `已关闭的问题 <https://github.com/godotengine/godot/issues?q=+is%3Alined+is%3Aissue+label%3Atopic%3Aphysicals>`__ 也可以帮助回答与物理引擎行为相关的问题。
zh_tw: 雖然許多問題可以透過調整設定來解決，但有些問題則是引擎本身的錯誤所致。關於已知的物理引擎相關問題，請參考 `GitHub 上未解決的物理相關議題 <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Aphysics>`__。你也可以瀏覽 `已關閉的物理相關議題 <https://github.com/godotengine/godot/issues?q=+is%3Aclosed+is%3Aissue+label%3Atopic%3Aphysics>`__ 來尋找物理引擎行為的相關解答。

source: Objects are passing through each other at high speeds
ga: Tá rudaí ag dul tríd a chéile ag luasanna ard
it: Gli oggetti si passano attraverso ad alte velocità
ru: Объекты проходят друг через друга на высоких скоростях
ta: பொருள்கள் ஒருவருக்கொருவர் அதிக வேகத்தில் செல்கின்றன
uk: Об'єкти проходять один крізь одного на великій швидкості
zh_cn: 高速运动的对象会互相穿透
zh_tw: 高速移動時物件互相穿透

source: This is known as *tunneling*. Enabling **Continuous CD** in the RigidBody properties can sometimes resolve this issue. If this does not help, there are other solutions you can try:
ga: Tugtar aith*tolnálaí* air seo. Uaireanta is féidir leis an bhfadhb seo a réiteach uaireanta **CD leanúnach** sna hairíonna RigidBody. Mura gcabhraíonn sé seo, tá réitigh eile ann is féidir leat triail a bhaint as:
it: Questo fenomeno è noto come *tunneling*. Abilitare **Continuous CD** nelle proprietà RigidBody può talvolta risolvere il problema. Se questo non aiuta, ci sono altre soluzioni da provare:
ru: Это называется *туннелированием (tunneling)*. Включение параметра **Continuous CD** в свойствах RigidBody иногда может решить эту проблему. Если это не помогает, попробуйте другие решения:
ta: இது *சுரங்கப்பாதை *என்று அழைக்கப்படுகிறது. ரிகிட்போடி பண்புகளில் ** தொடர்ச்சியான குறுவட்டு ** ஐ இயக்குவது சில நேரங்களில் இந்த சிக்கலை தீர்க்கும். இது உதவவில்லை என்றால், நீங்கள் முயற்சி செய்யக்கூடிய பிற தீர்வுகள் உள்ளன:
uk: Це відомо як *тунелювання*. Увімкнення **Continuous CD** у властивостях RigidBody іноді може вирішити цю проблему. Якщо це не допомогло, є інші рішення, які ви можете спробувати:
zh_cn: 这被称为 *隧道效应*。在 RigidBody 中启用 **连续碰撞检测模式** 属性有时可以解决此问题。如果此方法无效，您可以尝试其他解决方案：
zh_tw: 這種現象稱為 *穿隧（Tunneling）*。在 RigidBody 屬性中啟用 **連續碰撞檢測（Continuous CD）** 有時能解決此問題。如果效果不佳，還有其他方法可以嘗試：

source: Make your static collision shapes thicker. For example, if you have a thin floor that the player can't get below in some way, you can make the collider thicker than the floor's visual representation.
ga: Déan do chruthanna imbhuailte statacha níos tiubha Mar shampla, má tá urlár tanaí agat nach féidir leis an imreoir a fháil thíos ar bhealach éigin, is féidir leat an imbhuaileoir a dhéanamh níos tiubha ná léiriú amhairc an urláir.
it: Rendere più spesse le forme di collisione statica. Ad esempio, se c'è un pavimento sottile sotto il quale il giocatore non può passare in alcun modo, si può rendere il collisore più spesso della rappresentazione visiva del pavimento.
ru: Увеличьте толщину статических коллизий. Например, если у вас тонкий пол, под который игрок по какой-то причине не может попасть, вы можете сделать коллайдер толще визуального представления пола.
ta: உங்கள் நிலையான மோதல் வடிவங்களை தடிமனாக்கவும். எடுத்துக்காட்டாக, உங்களிடம் ஒரு மெல்லிய தளம் இருந்தால், வீரர் ஏதேனும் ஒரு வழியில் கீழே செல்ல முடியாது, நீங்கள் தரையின் காட்சி பிரதிநிதித்துவத்தை விட மோதலை தடிமனாக மாற்றலாம்.
uk: Зробіть статичні форми зіткнень товщі. Наприклад, якщо у вас є тонка підлога, під яку гравець якимось чином не може пройти, ви можете зробити колайдер товщим, ніж візуальне представлення підлоги.
zh_cn: 使你的静态碰撞形状更厚。例如，如果你有一个玩家无法以某种方式穿过的薄地板，你可以使碰撞器比地板看起来更厚。
zh_tw: 將靜態碰撞形狀做得更厚。例如，如果你的地板很薄，導致玩家有機會穿越下方，可以讓碰撞體比地板的實際外觀還厚。

source: Modify your fast-moving object's collision shape depending on its movement speed. The faster the object moves, the larger the collision shape should extend outside of the object to ensure it can collide with thin walls more reliably.
ga: Athraigh cruth imbhuailte do réad atá ag gluaiseacht go tapa ag brath ar a luas gluaiseachta. Dá tapa a ghluaiseann an réad, is mó ba chóir go leathnódh cruth an imbhuailte lasmuigh den réad chun a chinntiú gur féidir leis imbhualadh le ballaí tanaí níos iontaofa.
it: Modificare la forma di collisione dell'oggetto in rapido movimento in base alla sua velocità di movimento. Più veloce è l'oggetto, più lontana la forma di collisione si dovrebbe estendere dall'oggetto, per garantire che possa collidere con pareti sottili in modo più affidabile.
ru: Измените форму столкновения быстро движущегося объекта в зависимости от его скорости. Чем быстрее движется объект, тем больше должна выступать форма столкновения за его пределы, чтобы обеспечить более надёжное столкновение с тонкими стенами.
ta: உங்கள் இயக்க வேகத்தைப் பொறுத்து வேகமாக நகரும் பொருளின் மோதல் வடிவத்தை மாற்றவும். பொருள் வேகமாக நகரும் போது, பெரிய மோதல் வடிவம் பொருளுக்கு வெளியே நீட்டிக்கப்பட வேண்டும், அது மெல்லிய சுவர்களால் மிகவும் நம்பகத்தன்மையுடன் மோதுவதை உறுதி செய்ய வேண்டும்.
uk: Змінюйте форму зіткнення об'єкта, що швидко рухається, залежно від швидкості його руху. Чим швидше об’єкт рухається, тим більша форма зіткнення має виходити за межі об’єкта, щоб він міг надійніше зіткнутися з тонкими стінками.
zh_cn: 根据你的快速移动物体的运动速度调整其碰撞形状。物体移动得越快，碰撞形状应该越向外扩展，以确保它能够更可靠地与薄墙发生碰撞。
zh_tw: 依據物體的移動速度調整碰撞形狀。物體移動越快，碰撞形狀就應該往外延伸得越多，以確保遇到薄牆時能穩定偵測到碰撞。

source: Increase :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` in the advanced Project Settings. While this has other benefits (such as more stable simulation and reduced input lag), this increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
it: Aumentare :ref:`Tick di fisica al secondo<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` nelle Impostazioni avanzate del progetto. Sebbene ciò offra altri vantaggi (come una simulazione più stabile e una latenza degli input ridotta), aumenta l'utilizzo della CPU e potrebbe non essere fattibile per le piattaforme mobile/web. È preferibile utilizzare moltiplicatori del valore predefinito di ``60`` (come ``120``, ``180`` o ``240``) per un aspetto fluido sulla maggior parte dei display.
ru: Увеличьте значение :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` в расширенных Project Settings. Хотя это и даёт другие преимущества (например, более стабильную симуляцию и уменьшение задержки ввода), это увеличивает нагрузку на CPU и может быть нецелесообразным для мобильных и веб-платформ. Для плавного отображения на большинстве дисплеев рекомендуется использовать множители по умолчанию ``60`` (например, ``120``, ``180`` или ``240``).
ta: அதிகரிப்பு: REF: `வினாடிக்கு இயற்பியல் உண்ணி <class_projectsettings_property_physics/பொதுவான/இயற்பியல்_டிக்ச்_பெர்_செக்ட்>` மேம்பட்ட திட்ட அமைப்புகளில். இது பிற நன்மைகளைக் கொண்டிருக்கும்போது (அதிக நிலையான உருவகப்படுத்துதல் மற்றும் குறைக்கப்பட்ட உள்ளீட்டு பின்னடைவு போன்றவை), இது சிபியு பயன்பாட்டை அதிகரிக்கிறது மற்றும் மொபைல்/வலை தளங்களுக்கு சாத்தியமில்லை. `` 60`` (`` 120``, `` 180`` அல்லது `240`` போன்றவை) இயல்புநிலை மதிப்பின் பெருக்கிகள் பெரும்பாலான காட்சிகளில் மென்மையான தோற்றத்திற்கு விரும்பப்பட வேண்டும்.
uk: Збільште :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` у розширених налаштуваннях проекту. Хоча це має інші переваги (наприклад, більш стабільне моделювання та зменшення затримки введення), це збільшує використання ЦП і може бути непридатним для мобільних/веб-платформ. Множники зі значенням за замовчуванням ``60`` (наприклад, ``120``, ``180`` або ``240``) слід віддавати перевагу для плавного відображення на більшості дисплеїв.
zh_tw: 在進階專案設定中提高 :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>`。這除了可以讓模擬更穩定、降低輸入延遲外，也會提升 CPU 使用率，對於行動裝置或網頁平台可能不適用。建議設定為預設值 ``60`` 的倍數（例如 ``120``、``180`` 或 ``240``），以便大多數螢幕顯示更流暢。

source: Stacked objects are unstable and wobbly
ga: Tá rudaí cruachtaithe éagobhsaí agus luaineach
it: Gli oggetti impilati sono instabili e traballanti
ru: Сложенные объекты неустойчивы и шатаются
ta: அடுக்கப்பட்ட பொருள்கள் நிலையற்றவை மற்றும் தள்ளாடுகின்றன
uk: Складені об’єкти нестабільні та хиткі
zh_cn: 堆叠的对象摇摆不定
zh_tw: 堆疊的物件不穩定且晃動

source: Despite seeming like a simple problem, stable RigidBody simulation with stacked objects is difficult to implement in a physics engine. This is caused by integrating forces going against each other. The more stacked objects are present, the stronger the forces will be against each other. This eventually causes the simulation to become wobbly, making the objects unable to rest on top of each other without moving.
ga: In ainneoin gur fadhb shimplí é, tá sé deacair insamhalta RigidBody cobhsaí le rudaí cruachta a chur i bhfeidhm in inneall fisice. Is cúis leis seo ná fórsaí a chomhtháthú ag dul i gcoinne a chéile. An níos mó rudaí cruachta atá i láthair, is láidre a bheidh na fórsaí i gcoinne a chéile. Mar thoradh air seo go n-éiríonn an insamhalta ar deireadh, rud a fhágann nach féidir leis na rudaí scíth ar bharr a chéile gan gluaiseacht.
it: Nonostante sembri un problema semplice, la stabile simulazione di RigidBody con oggetti impilati è difficile da implementare in un motore di fisica. Questo è dovuto all'integrazione di forze che agiscono l'una contro l'altra. Più oggetti impilati ci sono, più intense saranno le forze che agiscono l'una contro l'altra. Ciò, eventualmente, rende la simulazione traballante, impedendo agli oggetti di appoggiarsi l'uno sull'altro senza muoversi.
ru: Несмотря на кажущуюся простоту задачи, стабильная симуляция RigidBody с наложенными друг на друга объектами сложно реализуется в физическом движке. Это вызвано суммированием сил, действующих друг на друга. Чем больше наложенных друг на друга объектов, тем сильнее будут эти силы. В конечном итоге это приводит к тому, что симуляция становится неустойчивой, и объекты не могут лежать друг на друге без движения.
ta: ஒரு எளிய சிக்கலாகத் தோன்றினாலும், அடுக்கப்பட்ட பொருட்களுடன் நிலையான ரிகிட்போடி உருவகப்படுத்துதல் இயற்பியல் இயந்திரத்தில் செயல்படுத்த கடினமாக உள்ளது. ஒருவருக்கொருவர் எதிராக செல்லும் சக்திகளை ஒருங்கிணைப்பதன் மூலம் இது ஏற்படுகிறது. மேலும் அடுக்கப்பட்ட பொருள்கள் உள்ளன, சக்திகள் ஒருவருக்கொருவர் எதிராக இருக்கும். இது இறுதியில் உருவகப்படுத்துதல் தள்ளாடியதாக மாறுகிறது, இதனால் பொருள்களை ஒருவருக்கொருவர் நகர்த்தாமல் ஓய்வெடுக்க முடியவில்லை.
uk: Незважаючи на те, що проблема здається простою, стабільну симуляцію RigidBody із складеними об’єктами важко реалізувати у фізичному механізмі. Це викликано інтеграцією сил, які протистоять одна одній. Чим більше складених об’єктів, тим сильнішими будуть сили, що протистоять один одному. Зрештою це призводить до того, що симуляція стає хиткою, через що об’єкти не можуть лежати один на одному без руху.
zh_cn: 尽管看起来像一个简单问题，但是在物理引擎中带有堆叠物体的稳定刚体模拟很难实现。这是因为力结合后的相互作用。堆叠的物体越多，相互之间的作用力越强。这最终导致了模拟变得不稳定，使得物体不能相互堆叠在一起而不发生移动。
zh_tw: 雖然看似簡單，但在物理引擎中實現堆疊剛體的穩定模擬其實很困難。這是因為多個力彼此交互作用造成的，堆疊物件越多，相互作用的力就越強，最後會導致模擬不穩定，使物件無法安穩地彼此堆疊、靜止不動。

source: Increasing the physics simulation rate can help alleviate this issue. To do so, increase :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` in the advanced Project Settings. Note that increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
it: Aumentare la frequenza di simulazione fisica può aiutare ad alleviare questo problema. Per farlo, aumentare :ref:`Tick di fisica al secondo<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` nelle Impostazioni avanzate del progetto. Si noti che questo aumenta l'utilizzo della CPU e potrebbe non essere fattibile per le piattaforme mobile/web. È preferibile utilizzare moltiplicatori del valore predefinito di ``60`` (come ``120``, ``180`` o ``240``) per un aspetto fluido sulla maggior parte dei display.
ru: Увеличение частоты симуляции физики может помочь решить эту проблему. Для этого увеличьте значение :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` в расширенных настройках проекта. Обратите внимание, что это увеличивает нагрузку на процессор и может быть неэффективным для мобильных и веб-платформ. Для плавного отображения на большинстве дисплеев предпочтительны множители по умолчанию ``60`` (например, ``120``, ``180`` или ``240``).
ta: இயற்பியல் உருவகப்படுத்துதல் வீதத்தை அதிகரிப்பது இந்த சிக்கலைத் தணிக்க உதவும். அவ்வாறு செய்ய, அதிகரிப்பு: குறிப்பு: `வினாடிக்கு இயற்பியல் உண்ணி <class_projectsettings_property_physics/பொதுவான/இயற்பியல்_டிக்ச்_பெர்_செக்ட்>` மேம்பட்ட திட்ட அமைப்புகளில். சிபியு பயன்பாட்டை அதிகரிக்கிறது மற்றும் மொபைல்/வலை தளங்களுக்கு சாத்தியமில்லை என்பதை நினைவில் கொள்க. `` 60`` (`` 120``, `` 180`` அல்லது `240`` போன்றவை) இயல்புநிலை மதிப்பின் பெருக்கிகள் பெரும்பாலான காட்சிகளில் மென்மையான தோற்றத்திற்கு விரும்பப்பட வேண்டும்.
uk: Збільшення швидкості симуляції фізики може допомогти вирішити цю проблему. Для цього збільште :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` у розширених налаштуваннях проекту. Зверніть увагу, що це збільшує використання ЦП і може бути непридатним для мобільних/веб-платформ. Множники зі значенням за замовчуванням ``60`` (наприклад, ``120``, ``180`` або ``240``) слід віддавати перевагу для плавного відображення на більшості дисплеїв.
zh_tw: 提升物理模擬速率有助於改善這個問題。請在進階專案設定中增加 :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>`。請注意，這會提高 CPU 使用率，行動與網頁平台可能不適用。建議選擇預設值 ``60`` 的倍數（如 ``120``、``180`` 或 ``240``），這樣在大多數螢幕上呈現會更順暢。

source: In 3D, switching the physics engine from the default GodotPhysics to Jolt can also improve stability. See :ref:`doc_using_jolt_physics` for more information.
it: In 3D, anche passare dal motore di fisica predefinito GodotPhysics a Jolt può migliorare la stabilità. Consultare :ref:`doc_using_jolt_physics` per ulteriori informazioni.
zh_tw: 在 3D 中，將物理引擎從預設的 GodotPhysics 切換為 Jolt 也能提升穩定性。詳情請見 :ref:`doc_using_jolt_physics`。

source: Scaled physics bodies or collision shapes do not collide correctly
ga: Ní imbhuaileann comhlachtaí fisice scálaithe nó cruthanna imbhuailte i gceart
it: I corpi fisici o le forme di collisione ridimensionati non collidono correttamente
ru: Масштабированные физические тела или формы столкновений не сталкиваются правильно
ta: அளவிடப்பட்ட இயற்பியல் உடல்கள் அல்லது மோதல் வடிவங்கள் சரியாக மோதுவதில்லை
uk: Масштабовані фізичні тіла або форми зіткнення не стикаються належним чином
zh_cn: 缩放后的物理体或碰撞形状无法正确碰撞
zh_tw: 縮放後的物理物件或碰撞形狀碰撞異常

source: Godot does not currently support scaling of physics bodies or collision shapes. As a workaround, change the collision shape's extents instead of changing its scale. If you want the visual representation's scale to change as well, change the scale of the underlying visual representation (Sprite2D, MeshInstance3D, …) and change the collision shape's extents separately. Make sure the collision shape is not a child of the visual representation in this case.
ga: Faoi láthair ní thacaíonn Godot le scálú comhlachtaí fisice nó cruthanna imbhuailte. Mar réiteach, athraigh méid an chruth imbhuailte in ionad a scála a athrú. Más mian leat go n-athróidh scála an léiriúcháin amhairc freisin, athraigh scála an léiriú amhairc bunúsach (Sprite2D, MeshInstance3D,...) agus athraigh méid an chruth imbhuailte ar leithligh. Déan cinnte nach leanbh den léiriú amhairc é cruth an imbhuailte sa chás seo.
it: Godot attualmente non supporta cambiare la scala dei corpi fisici o delle forme di collisione. Come alternativa, modificare le estensioni della forma di collisione anziché cambiarne la scala. Se si desidera che anche la scala della rappresentazione visiva cambi, cambiare la scala della rappresentazione visiva sottostante (Sprite2D, MeshInstance3D, ...) e modificare separatamente le estensioni della forma di collisione. In questo caso, assicurarsi che la forma di collisione non sia figlia della rappresentazione visiva.
ru: Godot в настоящее время не поддерживает масштабирование физических тел и форм столкновений. В качестве обходного решения измените границы формы столкновения вместо её масштаба. Если вы хотите, чтобы масштаб визуального представления также изменился, измените масштаб базового визуального представления (Sprite2D, MeshInstance3D и т.д.) и измените границы формы столкновения отдельно. В этом случае убедитесь, что форма столкновения не является дочерним элементом визуального представления.
ta: கோடோட் தற்போது இயற்பியல் உடல்கள் அல்லது மோதல் வடிவங்களை அளவிடுவதை ஆதரிக்கவில்லை. ஒரு பணித்தொகுப்பாக, மோதல் வடிவத்தின் அளவை மாற்றுவதற்குப் பதிலாக மாற்றவும். காட்சி பிரதிநிதித்துவத்தின் அளவும் மாற விரும்பினால், அடிப்படை காட்சி பிரதிநிதித்துவத்தின் அளவை மாற்றவும் (ச்ப்ரைட் 2 டி, மெசின்ச்டன்ச் 3 டி,…) மற்றும் மோதல் வடிவத்தின் நீட்டிப்புகளை தனித்தனியாக மாற்றவும். மோதல் வடிவம் இந்த விசயத்தில் காட்சி பிரதிநிதித்துவத்தின் குழந்தை அல்ல என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: Godot наразі не підтримує масштабування фізичних тіл або форм зіткнень. Як обхідний шлях, змініть межі форми зіткнення замість того, щоб змінювати її масштаб. Якщо ви бажаєте, щоб масштаб візуального представлення також змінився, змініть масштаб основного візуального представлення (Sprite2D, MeshInstance3D, …) і змініть розміри форми зіткнення окремо. У цьому випадку переконайтеся, що форма зіткнення не є дочірньою формою візуального представлення.
zh_cn: Godot当前没有支持缩放物理体或碰撞形状。作为替代方案，改变碰撞形状的范围而不是其缩放比例。如果你想让视觉表现的尺寸也发生变化，可以改变底层视觉表现（Sprite2D，MeshInstance3D， …）并单独改变它的碰撞形状的范围。在这种情况下，请确保碰撞形状不是视觉表现节点的子节点。
zh_tw: Godot 目前尚未支援直接縮放物理物件或碰撞形狀。建議改變碰撞形狀的範圍（extents）而非縮放比例。如果你要連視覺外觀（如 Sprite2D、MeshInstance3D 等）一起縮放，請分別調整視覺外觀的縮放比例與碰撞形狀的範圍。此時請確保碰撞形狀不是視覺物件的子節點。
