Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/troubleshooting_physics_issues.po
Languages: ga, it, ru, ta, uk, zh_cn, zh_tw

source: Since resources are shared by default, you'll have to make the collision shape resource unique if you don't want the change to be applied to all nodes using the same collision shape resource in the scene. This can be done by calling ``duplicate()`` in a script on the collision shape resource *before* changing its size.
ga: Ós rud é go roinntear acmhainní de réir réamhshocraithe, beidh ort an acmhainn cruth imbhuailte a dhéanamh uathúil mura dteastaíonn uait go gcuirfí an t-athrú i bhfeidhm ar gach nóid ag úsáid an acmhainn cruth imbhuailte céanna sa radharc. Is féidir é seo a dhéanamh trí ghlaoch ar `dúblach () ``i script ar an acmhainn cruth imbhuailtí *roimh* a mhéid a athrú.
it: Poiché le risorse sono condivise come predefinito, sarà necessario rendere univoca la risorsa di forma di collisione se non si desidera che la modifica sia applicata a tutti i nodi che utilizzano la stessa risorsa nella scena. Questo si può fare chiamando ``duplicate()`` in uno script sulla risorsa di forma di collisione *prima* di modificarne le dimensioni.
ru: Поскольку ресурсы по умолчанию являются общими, вам придётся сделать ресурс формы столкновения уникальным, если вы не хотите, чтобы изменение применялось ко всем узлам, использующим этот же ресурс формы столкновения в сцене. Это можно сделать, вызвав ``duplicate()`` в скрипте для ресурса формы столкновения *перед* изменением его размера.
ta: வளங்கள் இயல்பாக பகிரப்படுவதால், காட்சியில் ஒரே மோதல் வடிவ வளத்தைப் பயன்படுத்தி அனைத்து முனைகளுக்கும் மாற்றம் பயன்படுத்தப்பட விரும்பவில்லை எனில், மோதல் வடிவ வளத்தை தனித்துவமாக்க வேண்டும். மோதல் வடிவ வளத்தின் ச்கிரிப்ட்டில் * அதன் அளவை மாற்றுவதற்கு முன் * `` நகல் () `` என்று அழைப்பதன் மூலம் இதைச் செய்யலாம்.
uk: Оскільки ресурси є спільними за замовчуванням, вам доведеться зробити ресурс форми зіткнення унікальним, якщо ви не хочете, щоб зміни застосовувалися до всіх вузлів, які використовують той самий ресурс форми зіткнення в сцені. Це можна зробити, викликавши ``duplicate()`` у сценарії на ресурсі форми зіткнення *перед* зміною його розміру.
zh_cn: 由于资源默认是共享的，如果你不想让更改应用于场景中使用相同碰撞形状资源的所有节点，你需要让这个碰撞形状资源变得独一无二。这可以通过在碰撞形状资源的脚本中调用 duplicate() 方法来实现，然后在改变其尺寸 之前 进行操作。这样，更改将只影响当前的资源实例，而不会影响其他使用相同资源的节点。
zh_tw: 由於預設情況下資源為共用，若你不希望修改影響到場景中所有使用同一個碰撞形狀資源的節點，請先將碰撞形狀資源設為唯一。可在腳本中於更改尺寸*之前*對碰撞形狀資源呼叫 ``duplicate()``。

source: Thin objects are wobbly when resting on the floor
ga: Tá rudaí tanaí ag luath agus iad ag scíth ar an urlár
it: Gli oggetti sottili sono traballanti quando poggiano sul pavimento
ru: Тонкие предметы шатаются, когда лежат на полу
ta: தரையில் ஓய்வெடுக்கும்போது மெல்லிய பொருள்கள் தள்ளாடுகின்றன
uk: Тонкі предмети хитаються, коли вони лежать на підлозі
zh_cn: 当薄物体放在地板上时，它们会显得不稳定
zh_tw: 薄物件放在地面上時會晃動

source: This can be due to one of two causes:
ga: D'fhéadfadh sé seo a bheith mar gheall ar cheann de dhá chúis:
it: Ciò può essere dovuto a una di due cause:
ru: Это произошло по одной из двух причин:
ta: இது இரண்டு காரணங்களில் ஒன்று காரணமாக இருக்கலாம்:
uk: Це може бути спричинено однією з двох причин:
zh_tw: 這通常有兩個可能原因：

source: The floor's collision shape is too thin.
ga: Tá cruth imbhuailte an urláir ró-tanaí.
it: La forma di collisione del pavimento è troppo sottile.
ru: Форма столкновения пола слишком тонкая.
ta: தரையின் மோதல் வடிவம் மிகவும் மெல்லியதாக இருக்கிறது.
uk: Форма зіткнення підлоги занадто тонка.
zh_cn: 地板的碰撞形状太薄了。
zh_tw: 地板的碰撞形狀太薄。

source: The RigidBody's collision shape is too thin.
ga: Tá cruth imbhuailte an RigidBody ró-tanaí.
it: La forma del RigidBody è troppo sottile.
ru: Форма столкновения RigidBody's слишком тонкая.
ta: ரிகிட்படியின் மோதல் வடிவம் மிகவும் மெல்லியதாக இருக்கிறது.
uk: Форма зіткнення RigidBody занадто тонка.
zh_cn: 刚体的碰撞形状太薄了。
zh_tw: 剛體（RigidBody）的碰撞形狀太薄。

source: In the first case, this can be alleviated by making the floor's collision shape thicker. For example, if you have a thin floor that the player can't get below in some way, you can make the collider thicker than the floor's visual representation.
ga: Sa chéad chás, is féidir é seo a mhaolú trí chruth imbhuailte an urláir a dhéanamh níos tiubha. Mar shampla, má tá urlár tanaí agat nach féidir leis an imreoir a fháil thíos ar bhealach éigin, is féidir leat an imbhuaileoir a dhéanamh níos tiubha ná léiriú amhairc an urláir.
it: Nel primo caso, questo problema si può allievare rendendo più spessa la forma di collisione del pavimento. Ad esempio, se c'è un pavimento sottile sotto il quale il giocatore non può passare in alcun modo, si può rendere il collisore più spesso della rappresentazione visiva del pavimento.
ru: В первом случае это можно облегчить, сделав форму столкновения пола толще. Например, если у вас тонкий пол, ниже которого игрок каким-то образом не может пройти, вы можете сделать коллайдер толще, чем визуальное представление пола.
ta: முதல் வழக்கில், தரையின் மோதல் வடிவத்தை தடிமனாக்குவதன் மூலம் இதைத் தணிக்க முடியும். எடுத்துக்காட்டாக, உங்களிடம் ஒரு மெல்லிய தளம் இருந்தால், வீரர் ஏதேனும் ஒரு வழியில் கீழே செல்ல முடியாது, நீங்கள் தரையின் காட்சி பிரதிநிதித்துவத்தை விட மோதலை தடிமனாக மாற்றலாம்.
uk: У першому випадку це можна пом'якшити, зробивши форму зіткнення підлоги товщею. Наприклад, якщо у вас є тонка підлога, під яку гравець якимось чином не може пройти, ви можете зробити колайдер товщим, ніж візуальне представлення підлоги.
zh_cn: 在第一个场景中，这可以通过加厚地板的碰撞形状来缓解。例如，如果你有一个玩家不能以某种方式穿过的地板，你可以通过使碰撞器比地板看起来还要厚来解决。
zh_tw: 若屬於第一種情況，可以將地板的碰撞形狀做得更厚。例如，若地板很薄、玩家卻不能穿過，可以讓碰撞體比地板的外觀還厚。

source: In the second case, this can usually only be resolved by increasing the physics simulation rate (as making the shape thicker would cause a disconnect between the RigidBody's visual representation and its collision).
ga: Sa dara cás, de ghnáth ní féidir é seo a réiteach ach tríd an ráta insamhalta fisice a mhéadú (mar bheadh an cruth níos tiubha mar thoradh ar dhícheangal idir léiriú amhairc an RigidBody agus a imbhualadh).
it: Nel secondo caso, questo si può risolvere solo aumentando la frequenza di simulazione fisica (poiché rendere la forma più spessa causerebbe una disconnessione tra la rappresentazione visiva del RigidBody e la sua collisione).
ru: Во втором случае эту проблему обычно можно решить только увеличением скорости физического моделирования (поскольку увеличение толщины формы приведет к разрыву между визуальным представлением RigidBody's и его столкновением).
ta: இரண்டாவது வழக்கில், இது வழக்கமாக இயற்பியல் உருவகப்படுத்துதல் வீதத்தை அதிகரிப்பதன் மூலம் மட்டுமே தீர்க்க முடியும் (வடிவத்தை தடிமனாக்குவது கடுமையான பாடலின் காட்சி பிரதிநிதித்துவத்திற்கும் அதன் மோதலுக்கும் இடையில் துண்டிக்கப்படுவதை ஏற்படுத்தும்).
uk: У другому випадку це зазвичай можна вирішити лише збільшенням швидкості симуляції фізики (оскільки збільшення товщини форми призведе до розриву зв’язку між візуальним представленням RigidBody та його зіткненням).
zh_cn: 在第二个场景中，常常只能通过提高物理仿真比率来解决（因为使形状更厚会导致刚体的视觉表现与其碰撞效果之间出现脱节）。
zh_tw: 第二種情況下，通常只能透過提升物理模擬速率來解決（因為厚化形狀會導致剛體的視覺外觀與碰撞不一致）。

source: In both cases, increasing the physics simulation rate can also help alleviate this issue. To do so, increase :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` in the advanced Project Settings. Note that this increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
it: In entrambi i casi, aumentare la frequenza di simulazione fisica può aiutare ad alleviare questo problema. Per farlo, aumentare :ref:`Tick di fisica al secondo<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` nelle Impostazioni avanzate del progetto. Si noti che questo aumenta l'utilizzo della CPU e potrebbe non essere fattibile per le piattaforme mobile/web. È preferibile utilizzare moltiplicatori del valore predefinito di ``60`` (come ``120``, ``180`` o ``240``) per un aspetto fluido sulla maggior parte dei display.
ru: В обоих случаях увеличение частоты симуляции физики также может помочь решить эту проблему. Для этого увеличьте значение параметра :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` в расширенных настройках проекта. Обратите внимание, что это увеличивает нагрузку на процессор и может быть нецелесообразным для мобильных и веб-платформ. Для плавного отображения на большинстве дисплеев предпочтительны множители по умолчанию ``60`` (например, ``120``, ``180`` или ``240``).
ta: இரண்டு சந்தர்ப்பங்களிலும், இயற்பியல் உருவகப்படுத்துதல் வீதத்தை அதிகரிப்பது இந்த சிக்கலைத் தணிக்க உதவும். அவ்வாறு செய்ய, அதிகரிப்பு: குறிப்பு: `வினாடிக்கு இயற்பியல் உண்ணி <class_projectsettings_property_physics/பொதுவான/இயற்பியல்_டிக்ச்_பெர்_செக்ட்>` மேம்பட்ட திட்ட அமைப்புகளில். இது சிபியு பயன்பாட்டை அதிகரிக்கிறது மற்றும் மொபைல்/வலை தளங்களுக்கு சாத்தியமில்லை என்பதை நினைவில் கொள்க. `` 60`` (`` 120``, `` 180`` அல்லது `240`` போன்றவை) இயல்புநிலை மதிப்பின் பெருக்கிகள் பெரும்பாலான காட்சிகளில் மென்மையான தோற்றத்திற்கு விரும்பப்பட வேண்டும்.
uk: В обох випадках збільшення швидкості симуляції фізики також може допомогти вирішити цю проблему. Для цього збільште :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` у розширених налаштуваннях проекту. Зауважте, що це збільшує використання ЦП і може бути непридатним для мобільних/веб-платформ. Множники зі значенням за замовчуванням ``60`` (наприклад, ``120``, ``180`` або ``240``) слід віддавати перевагу для плавного відображення на більшості дисплеїв.
zh_tw: 無論哪種情況，提高物理模擬速率都能改善這個問題。請在進階專案設定中提升 :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>`。注意，這會增加 CPU 使用率，行動和網頁平台可能不適合。建議設為預設 ``60`` 的倍數（如 ``120``、``180``、``240``），大多數螢幕能更流暢地呈現。

source: Cylinder collision shapes are unstable
ga: Tá cruthanna imbhuailte sorcóra éago
it: Le forme cilindriche di collisione non sono stabili
ru: Формы столкновения цилиндров нестабильны
ta: சிலிண்டர் மோதல் வடிவங்கள் நிலையற்றவை
uk: Форми зіткнення циліндрів нестабільні
zh_cn: 圆柱碰撞形状不稳定
zh_tw: 圓柱體碰撞形狀不穩定

source: Switching the physics engine from the default GodotPhysics to Jolt should make cylinder collision shapes more reliable. See :ref:`doc_using_jolt_physics` for more information.
it: Passare dal motore di fisica predefinito GodotPhysics a Jolt dovrebbe rendere le forme cilindriche di collisione più affidabili. Consultare :ref:`doc_using_jolt_physics` per ulteriori informazioni.
zh_tw: 將物理引擎從預設的 GodotPhysics 切換為 Jolt，應能讓圓柱形的碰撞形狀更可靠。詳情請見 :ref:`doc_using_jolt_physics`。

source: During the transition from Bullet to GodotPhysics in Godot 4, cylinder collision shapes had to be reimplemented from scratch. However, cylinder collision shapes are one of the most difficult shapes to support, which is why many other physics engines don't provide any support for them. There are several known bugs with cylinder collision shapes currently.
ga: Le linn an aistrithe ó Bullet go GodotPhysics i Godot 4, b'éigean cruthanna imbhuailte sorcóra a athchur i bhfeidhm ón tús. Mar sin féin, tá cruthanna imbhuailte sorcóra ar cheann de na cruthanna is deacra le tacú leo, agus sin an fáth nach soláthraíonn go leor innill fhisice eile aon tacaíocht dóibh. Tá roinnt fabhtanna ar eolas le cruthanna imbhuailte sorcóra faoi láthair.
it: Durante la transizione da Bullet a GodotPhysics in Godot 4, è stato necessario reimplementare le forme cilindriche di collisione da zero. Tuttavia, le forme cilindriche di collisione sono tra le più difficili da supportare, motivo per cui molti altri motori di fisica non le supportano. Attualmente sono noti diversi bug relativi alle forme cilindriche di collisione.
ru: При переходе от Bullet к GodotPhysics в Godot 4 формы столкновений цилиндров пришлось переопределять с нуля. Однако формы столкновений цилиндров — одна из самых сложных для поддержки форм, поэтому многие другие физические движки не предоставляют для них никакой поддержки. В настоящее время известно несколько ошибок с формами столкновения цилиндров.
ta: கோடோட் 4 இல் புல்லட்டிலிருந்து கோடோட்பிசிக்சுக்கு மாறும்போது, சிலிண்டர் மோதல் வடிவங்களை புதிதாக மறுபரிசீலனை செய்ய வேண்டியிருந்தது. இருப்பினும், சிலிண்டர் மோதல் வடிவங்கள் ஆதரிக்க மிகவும் கடினமான வடிவங்களில் ஒன்றாகும், அதனால்தான் பல இயற்பியல் இயந்திரங்கள் அவர்களுக்கு எந்த ஆதரவையும் வழங்கவில்லை. தற்போது சிலிண்டர் மோதல் வடிவங்களுடன் அறியப்பட்ட பல பிழைகள் உள்ளன.
uk: Під час переходу від Bullet до GodotPhysics у Godot 4 форми зіткнень циліндрів довелося реалізовувати з нуля. Однак форми зіткнення циліндрів є однією з найскладніших форм для підтримки, тому багато інших фізичних движків не надають жодної підтримки для них. Наразі існує кілька відомих помилок із формами зіткнення циліндрів.
zh_cn: 在从Bullet到Godot 4中的GodotPhysics的过渡期间，圆柱体碰撞形状不得不从头开始重新实现。然而，圆柱体碰撞形状是最难支持的形状之一，这就是为什么许多其他物理引擎不提供对它们的支持。目前已知圆柱体碰撞形状存在一些问题。
zh_tw: Godot 4 從 Bullet 過渡到 GodotPhysics 時，圓柱體碰撞形狀必須重新實作。然而，圓柱體是支援難度最高的碰撞形狀之一，因此許多其他物理引擎也不支援。目前圓柱體碰撞形狀仍有若干已知錯誤。

source: If you are sticking to GodotPhysics, we recommend using box or capsule collision shapes for characters for now. Boxes generally provide the best reliability, but have the downside of making the character take more space diagonally. Capsule collision shapes do not have this downside, but their shape can make precision platforming more difficult.
it: Se è preferito usare GodotPhysics, per ora consigliamo di usare forme di collisione a scatola o a capsula per i personaggi. Le forme a scatola generalmente offrono la migliore affidabilità, ma hanno lo svantaggio di occupare più spazio in diagonale. Le forme di collisione a capsula non hanno questo svantaggio, ma la loro forma può rendere più difficile il platforming con precisione.
zh_tw: 若你仍然使用 GodotPhysics，目前建議角色使用盒狀或膠囊狀的碰撞形狀。盒狀通常最可靠，但會讓角色在斜向上占用較多空間。膠囊狀沒有這個缺點，但其形狀可能讓精準的平台跳躍更難掌控。

source: VehicleBody simulation is unstable, especially at high speeds
ga: Tá insamhalta FeithleBody éagobhsaí, go háirithe ag luasanna
it: La simulazione di VehicleBody è instabile, soprattutto ad alte velocità
ru: Симуляция VehicleBody нестабильна, особенно на высоких скоростях
ta: வாகன பாடி உருவகப்படுத்துதல் நிலையற்றது, குறிப்பாக அதிக வேகத்தில்
uk: Симуляція VehicleBody нестабільна, особливо на високих швидкостях
zh_cn: VehicleBody 仿真不稳定，尤其是在速度较大的时候
zh_tw: VehicleBody 模擬不穩定，特別在高速下更明顯

source: When a physics body moves at a high speed, it travels a large distance between each physics step. For instance, when using the 1 unit = 1 meter convention in 3D, a vehicle moving at 360 km/h will travel 100 units per second. With the default physics simulation rate of 60 Hz, the vehicle moves by ~1.67 units each physics tick. This means that small objects may be ignored entirely by the vehicle (due to tunneling), but also that the simulation has little data to work with in general at such a high speed.
ga: Nuair a ghluaiseann comhlacht fisice ar luas ard, taistealaíonn sé achar mór idir gach céim fisice. Mar shampla, nuair a úsáidtear an coinbhinsiún 1 aonad = 1 mhéadar i 3D, taistealfaidh feithicil ag gluaiseacht ag 360 km/h 100 aonad in aghaidh an tsoicind. Leis an ráta insamhalta fisic réamhshocraithe de 60 Hz, gluaiseann an fheithicil faoi ~ 1.67 aonad gach tic fisic. Ciallaíonn sé seo go bhféadfadh an fheithicil neamhaird a dhéanamh ar rudaí beaga go hiomlán (mar gheall ar tolláin), ach freisin nach bhfuil mórán sonraí ag an insamhalta le hoibriú leo i gcoitinne ar luas chomh hard sin.
it: Quando un corpo fisico si muove ad alta velocità, percorre una grande distanza tra ogni passo di fisica. Ad esempio, utilizzando la convenzione 1 unità = 1 metro in 3D, un veicolo che si muove a 360 km/h percorrerà 100 unità al secondo. Con la frequenza di simulazione fisica predefinita di 60 Hz, il veicolo si muove di circa 1,67 unità a ogni tick di fisica. Ciò significa che gli oggetti di piccole dimensioni potrebbero essere completamente ignorati dal veicolo (a causa del tunneling), ma anche che la simulazione ha pochi dati con cui lavorare in generale a una velocità così elevata.
ru: Когда физическое тело движется с высокой скоростью, оно проходит большое расстояние между каждым физическим шагом. Например, при использовании соглашения 1 единица = 1 метр в 3D, транспортное средство, движущееся со скоростью 360 км/ч, будет проходить 100 единиц в секунду. При частоте обновления физической модели по умолчанию 60 Гц транспортное средство перемещается примерно на 1,67 единицы за каждый физический тик. Это означает, что транспортное средство может полностью игнорировать мелкие объекты (из-за туннелирования), но также и то, что у моделирования в целом мало данных для работы на такой высокой скорости.
ta: ஒரு இயற்பியல் உடல் அதிவேகத்தில் நகரும்போது, அது ஒவ்வொரு இயற்பியல் படிக்கும் இடையில் பெரிய தூரம் பயணிக்கிறது. உதாரணமாக, 3D இல் 1 யூனிட் = 1 மீட்டர் மாநாட்டைப் பயன்படுத்தும் போது, மணிக்கு 360 கிமீ வேகத்தில் நகரும் ஒரு வண்டி நொடிக்கு 100 அலகுகள் பயணிக்கும். இயல்புநிலை இயற்பியல் உருவகப்படுத்துதல் வீதத்தை 60 எர்ட்ச் மூலம், வண்டி ஒவ்வொரு இயற்பியல் டிக் ~ 1.67 அலகுகளால் நகரும். இதன் பொருள் சிறிய பொருள்கள் வாகனத்தால் (சுரங்கப்பாதை காரணமாக) முற்றிலும் புறக்கணிக்கப்படலாம், ஆனால் உருவகப்படுத்துதலில் பொதுவாக அதிக வேகத்தில் வேலை செய்ய சிறிய தரவு இல்லை.
uk: Коли фізичне тіло рухається з високою швидкістю, воно проходить велику відстань між кожним кроком фізики. Наприклад, при використанні конвенції 1 одиниця = 1 метр у 3D транспортний засіб, що рухається зі швидкістю 360 км/год, проїжджатиме 100 одиниць за секунду. З частотою моделювання фізики за замовчуванням 60 Гц транспортний засіб рухається на ~1,67 одиниці за кожен такт фізики. Це означає, що невеликі об’єкти можуть повністю ігноруватися транспортним засобом (через тунелювання), а також те, що симуляція має мало даних для роботи загалом на такій високій швидкості.
zh_cn: 当一个物理体以高速移动时，它在每一个物理步骤中移动很长的一段距离。例如，当在 3D 中使用1单位等于1米的的标准时，一个以360 km/h速度移动的物体将会在每秒内移动100个单位长度。使用默认的物理仿真频率 60 Hz时，该物体每个物理周期移动 ~1.67个单位长度。这意味着小物体可能被物体完全忽略（由于隧道效应），同时这也意味着在如此高的速度下，仿真本身通常只有很少的数据可供处理。
zh_tw: 當物理物件高速移動時，每個物理步驟之間會移動很長距離。例如，3D 場景採用 1 單位 = 1 公尺，當車輛以 360 公里/小時行駛時，每秒會移動 100 單位。若物理模擬速率為預設 60 Hz，車輛每個物理刻度會移動約 1.67 單位。這代表車輛可能會完全忽略小型物件（因為穿隧效應），而且在高速時模擬可用的資料也很少。

source: Fast-moving vehicles can benefit a lot from an increased physics simulation rate. To do so, increase :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` in the advanced Project Settings. Note that this increases CPU utilization and may not be viable for mobile/web platforms. Multipliers of the default value of ``60`` (such as ``120``, ``180`` or ``240``) should be preferred for a smooth appearance on most displays.
it: I veicoli ad alta velocità possono beneficiare molto da una maggiore frequenza di simulazione fisica. Per farlo, aumentare :ref:`Tick di fisica al secondo<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` nelle Impostazioni avanzate del progetto. Si noti che questo aumenta l'utilizzo della CPU e potrebbe non essere fattibile per le piattaforme mobile/web. È preferibile utilizzare moltiplicatori del valore predefinito di ``60`` (come ``120``, ``180`` o ``240``) per un aspetto fluido sulla maggior parte dei display.
ru: Быстро движущиеся транспортные средства могут значительно выиграть от повышения частоты моделирования физики. Для этого увеличьте значение параметра :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` в расширенных настройках проекта. Обратите внимание, что это увеличивает нагрузку на процессор и может быть неэффективным для мобильных и веб-платформ. Для плавного отображения на большинстве дисплеев рекомендуется использовать множители по умолчанию ``60`` (например, ``120``, ``180`` или ``240``).
ta: வேகமாக நகரும் வாகனங்கள் அதிகரித்த இயற்பியல் உருவகப்படுத்துதல் விகிதத்திலிருந்து நிறைய பயனடையக்கூடும். அவ்வாறு செய்ய, அதிகரிப்பு: குறிப்பு: `வினாடிக்கு இயற்பியல் உண்ணி <class_projectsettings_property_physics/பொதுவான/இயற்பியல்_டிக்ச்_பெர்_செக்ட்>` மேம்பட்ட திட்ட அமைப்புகளில். இது சிபியு பயன்பாட்டை அதிகரிக்கிறது மற்றும் மொபைல்/வலை தளங்களுக்கு சாத்தியமில்லை என்பதை நினைவில் கொள்க. `` 60`` (`` 120``, `` 180`` அல்லது `240`` போன்றவை) இயல்புநிலை மதிப்பின் பெருக்கிகள் பெரும்பாலான காட்சிகளில் மென்மையான தோற்றத்திற்கு விரும்பப்பட வேண்டும்.
uk: Транспортні засоби, що швидко рухаються, можуть отримати значну користь від збільшення швидкості симуляції фізики. Для цього збільште :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>` у розширених налаштуваннях проекту. Зауважте, що це збільшує використання ЦП і може бути непридатним для мобільних/веб-платформ. Множники зі значенням за замовчуванням ``60`` (наприклад, ``120``, ``180`` або ``240``) слід віддавати перевагу для плавного відображення на більшості дисплеїв.
zh_tw: 對於高速移動的車輛，提升物理模擬速率會有顯著幫助。請在進階專案設定中提高 :ref:`Physics Ticks per Second<class_ProjectSettings_property_physics/common/physics_ticks_per_second>`。要注意這會增加 CPU 負擔，行動或網頁平台可能不適用。建議設成 ``60`` 的倍數（如 ``120``、``180``、``240``），大多數螢幕會有較佳表現。

source: Collision results in bumps when an object moves across tiles
ga: Mar thoradh ar imbhuailt bíonn buailtí nuair a ghluaiseann réad tras
it: La collisione provoca urti quando un oggetto si muove tra tasselli
ru: Столкновение приводит к ударам, когда объект движется по тайлам
ta: ஒரு பொருள் ஓடுகள் முழுவதும் நகரும்போது மோதல் புடைப்புகளில் விளைகிறது
uk: Зіткнення призводить до ударів, коли об’єкт рухається по плитках
zh_cn: 当一个物体在瓦片上移动时，碰撞可能会导致颠簸
zh_tw: 物件橫越瓷磚（Tile）時，碰撞造成顛簸

source: This is a known issue in the physics engine caused by the object bumping on a shape's edges, even though that edge is covered by another shape. This can occur in both 2D and 3D.
ga: Is saincheist aitheanta í seo san inneall fisice de bharr an réad ag bualadh ar imill cruth, cé go bhfuil cruth eile clúdaithe ag an imeall sin. Is féidir leis seo tarlú i 2D agus 3D araon.
it: Ciò è un problema noto del motore di fisica, causato dall'urto dell'oggetto sui bordi di una forma, anche se quel bordo è coperto da un'altra forma. Può accadere sia in 2D sia in 3D.
ru: Это известная проблема физического движка, возникающая из-за того, что объект ударяется о края фигуры, даже если этот край закрыт другой фигурой. Это может происходить как в 2D, так и в 3D.
ta: அந்த விளிம்பு மற்றொரு வடிவத்தால் மூடப்பட்டிருந்தாலும், ஒரு வடிவத்தின் விளிம்புகளில் மோதியதால் ஏற்படும் இயற்பியல் இயந்திரத்தில் இது அறியப்பட்ட சிக்கல். இது 2 டி மற்றும் 3 டி இரண்டிலும் ஏற்படலாம்.
uk: Це відома проблема у фізичному механізмі, спричинена тим, що об’єкт натикається на краї фігури, навіть якщо цей край закритий іншою фігурою. Це може відбуватися як у 2D, так і в 3D.
zh_cn: 在物理引擎中，这里有一个因为物体在形状的边缘发生碰撞导致的已知问题，即使这条边被其它形状覆盖。这可以在2D和3D中触发。
zh_tw: 這是物理引擎的已知問題，物件在移動時會碰到碰撞形狀的邊緣，即使該邊緣已被另一個形狀覆蓋。此問題在 2D 與 3D 場景都可能發生。
