Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_jolt_physics.po
Languages: it, ru, ta, uk, zh_hans, zh_hant

source: Using Jolt Physics
it: Utilizzare Jolt Physics
ru: Использование физики Jolt
ta: சால்ட் இயற்பியலைப் பயன்படுத்துதல்
uk: Використання Jolt Physics
zh_hans: 使用 Jolt Physics
zh_hant: 使用 Jolt 物理引擎

source: Introduction
it: Introduzione
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_hans: 前言
zh_hant: 前言

source: The Jolt physics engine was added as an alternative to the existing Godot Physics physics engine in 4.4. Jolt is developed by Jorrit Rouwe with a focus on games and VR applications. Previously it was available as an extension but is now built into Godot.
ru: Физический движок Jolt был добавлен в качестве альтернативы существующему физическому движку Godot Physics в версии 4.4. Jolt разработан Йорритом Роуве с упором на игры и VR-приложения. Ранее он был доступен в качестве расширения, но теперь встроен в Godot.
ta: 4.4 இல் தற்போதுள்ள கோடோட் இயற்பியல் இயற்பியல் இயந்திரத்திற்கு மாற்றாக சால்ட் இயற்பியல் இயந்திரம் சேர்க்கப்பட்டது. விளையாட்டுகள் மற்றும் வி.ஆர் பயன்பாடுகளை மையமாகக் கொண்டு சோரிட் ரூவ் உருவாக்கியுள்ளார். முன்னதாக இது ஒரு நீட்டிப்பாக கிடைத்தது, ஆனால் இப்போது கோடோட்டில் கட்டமைக்கப்பட்டுள்ளது.
uk: Фізичний двигун Jolt було додано як альтернативу існуючому фізичному двигуну Godot Physics у версії 4.4. Jolt розроблено Jorrit Rouwe з акцентом на ігри та VR-додатки. Раніше він був доступний як розширення, але тепер вбудований у Godot.
zh_hant: 在 4.4 中，Jolt 物理引擎被加入作為現有 Godot Physics 物理引擎的替代方案。Jolt 由 Jorrit Rouwe 開發，重點面向遊戲與 VR 應用。它先前以擴充功能提供，如今已內建於 Godot。

source: The existing extension is now considered in maintenance mode. That means bug fixes will be merged, and it will be kept compatible with new versions of Godot until the built-in module has feature parity with the extension. The extension can be found `here on GitHub <https://github.com/godot-jolt/godot-jolt>`_ and in Godot's asset library.
ru: Существующее расширение теперь находится в режиме обслуживания. Это означает, что исправления ошибок будут объединены, и оно будет совместимо с новыми версиями Godot до тех пор, пока встроенный модуль не достигнет функционального паритета с расширением. Расширение можно найти здесь, на GitHub <https://github.com/godot-jolt/godot-jolt>`_, и в библиотеке ресурсов Godot.
ta: தற்போதுள்ள நீட்டிப்பு இப்போது பராமரிப்பு பயன்முறையில் கருதப்படுகிறது. அதாவது பிழைத் திருத்தங்கள் ஒன்றிணைக்கப்படும், மேலும் உள்ளமைக்கப்பட்ட தொகுதி நீட்டிப்புடன் அம்ச சமநிலையைக் கொண்டிருக்கும் வரை இது கோடோட்டின் புதிய பதிப்புகளுடன் இணக்கமாக இருக்கும். நீட்டிப்பை `இங்கே அறிவிலிவேள்வி <https://github.com/godot-jolt/godot-jolt> _ _ மற்றும் கோடோட்டின் சொத்து நூலகத்தில் காணலாம்.
uk: Існуюче розширення зараз розглядається як таке, що перебуває в режимі обслуговування. Це означає, що виправлення помилок будуть об'єднані, і воно буде сумісним з новими версіями Godot, доки вбудований модуль не матиме паритету функціональності з розширенням. Розширення можна знайти `тут на GitHub <https://github.com/godot-jolt/godot-jolt>`_ та в бібліотеці ресурсів Godot.
zh_hant: 現有的擴充功能目前處於維護模式。也就是說，錯誤修正仍會合併，並會維持與新版 Godot 的相容性，直到內建模組達到與該擴充功能功能一致為止。你可在 `GitHub 上這裡 <https://github.com/godot-jolt/godot-jolt>`_ 與 Godot 的素材庫中找到該擴充功能。

source: To change the 3D physics engine to be Jolt Physics, set :ref:`Project Settings > Physics > 3D > Physics Engine<class_ProjectSettings_property_physics/3D/Physics_Engine>` to ``Jolt Physics``. Once you've done that, click the **Save & Restart** button. When the editor opens again, 3D scenes should now be using Jolt for physics.
ru: Чтобы изменить 3D-физический движок на Jolt Physics, установите для параметра :ref:`Project Settings > Physics > 3D > Physics Engine<class_ProjectSettings_property_physics/3D/Physics_Engine>` значение ``Jolt Physics``. После этого нажмите кнопку **Save & Restart**. После повторного открытия редактора 3D-сцены должны использовать Jolt для физики.
ta: 3D இயற்பியல் இயந்திரத்தை சால்ட் இயற்பியலாக மாற்ற, அமைக்கவும்: குறிப்பு: `திட்ட அமைப்புகள்> இயற்பியல்> 3D> இயற்பியல் இயந்திரம் <class_projectsettings_property_physics/3d/physicics_engine>` முதல் `` சோல்ட் இயற்பியல்``. நீங்கள் அதைச் செய்தவுடன், ** சேமி & மறுதொடக்கம் ** பொத்தானைக் சொடுக்கு செய்க. ஆசிரியர் மீண்டும் திறக்கும்போது, 3D காட்சிகள் இப்போது இயற்பியலுக்கான சோல்ட்டைப் பயன்படுத்த வேண்டும்.
uk: Щоб змінити 3D-фізичний рушій на Jolt Physics, встановіть :ref:`Project Settings > Physics > 3D > Physics Engine<class_ProjectSettings_property_physics/3D/Physics_Engine>` на ``Jolt Physics``. Після цього натисніть кнопку **Зберегти та перезапустити**. Коли редактор знову відкриється, 3D-сцени тепер повинні використовувати Jolt для фізики.
zh_hant: 若要將 3D 物理引擎切換為 Jolt Physics，請將 :ref:`Project Settings > Physics > 3D > Physics Engine<class_ProjectSettings_property_physics/3D/Physics_Engine>` 設為 ``Jolt Physics``。完成後點擊 **Save & Restart** 按鈕。編輯器重新開啟後，3D 場景就會改用 Jolt 進行物理模擬。

source: Notable differences to Godot Physics
ru: Заметные отличия от Физики Годо
ta: கோடோட் இயற்பியலுக்கு குறிப்பிடத்தக்க வேறுபாடுகள்
uk: Помітні відмінності від Godot Physics
zh_hans: 与 Godot Physics 的主要区别
zh_hant: 與 Godot Physics 的顯著差異

source: There are many differences between the existing Godot Physics engine and Jolt.
it: Ci sono molte differenze tra l'attuale motore di fisica Godot e Jolt.
ru: Между существующим движком Godot Physics и Jolt существует множество различий.
ta: தற்போதுள்ள கோடோட் இயற்பியல் இயந்திரம் மற்றும் சால்ட் இடையே பல வேறுபாடுகள் உள்ளன.
uk: Між існуючим фізичним двигуном Godot та Jolt існує багато відмінностей.
zh_hans: 现有的 Godot Physics 引擎与 Jolt 之间存在诸多差异。
zh_hant: 現有的 Godot Physics 引擎與 Jolt 之間有許多差異。

source: Joint properties
it: Proprietà dei giunti
ru: Совместная собственность
ta: கூட்டு பண்புகள்
uk: Спільні властивості
zh_hans: 关节属性
zh_hant: 關節屬性

source: The current interfaces for the 3D joint nodes don't quite line up with the interface of Jolt's own joints. As such, there are a number of joint properties that are not supported, mainly ones related to configuring the joint's soft limits.
it: Le interfacce attuali per i nodi dei giunti 3D non sono perfettamente in linea con l'interfaccia dei giunti di Jolt. Pertanto, certe proprietà dei giunti non sono supportate, principalmente quelle relative alla configurazione dei limiti soffici dei giunti.
ru: Текущие интерфейсы узлов 3D-сочленений не совсем соответствуют интерфейсу собственных сочленений Jolt. В связи с этим ряд свойств сочленений не поддерживаются, в основном те, которые связаны с настройкой мягких пределов сочленений.
ta: 3D கூட்டு முனைகளுக்கான தற்போதைய இடைமுகங்கள் சால்ட்டின் சொந்த மூட்டுகளின் இடைமுகத்துடன் பொருந்தாது. எனவே, ஆதரிக்கப்படாத பல கூட்டு பண்புகள் உள்ளன, முக்கியமாக கூட்டு மென்மையான வரம்புகளை உள்ளமைப்பது தொடர்பானவை.
uk: Поточні інтерфейси для вузлів 3D-суглобів не зовсім відповідають інтерфейсу власних суглобів Jolt. Таким чином, існує ряд властивостей суглобів, які не підтримуються, головним чином пов'язані з налаштуванням м'яких меж суглоба.
zh_hant: 目前 3D 關節節點的介面與 Jolt 自身關節的介面並不完全一致。因此有一些關節屬性尚未支援，主要是與關節「軟限制」設定相關的屬性。

source: The unsupported properties are:
it: The proprietà non supportate sono:
ru: Неподдерживаемые свойства:
ta: ஆதரிக்கப்படாத பண்புகள்:
uk: Непідтримувані властивості:
zh_hans: 不支持的属性有：
zh_hant: 未支援的屬性如下：

source: PinJoint3D: ``bias``, ``damping``, ``impulse_clamp``
ta: பின்சாயிண்ட் 3 டி: `` சார்பு``, `` டம்பிங்``, `` இம்பல்ச்_க்ளாம்ப்``

source: HingeJoint3D: ``bias``, ``softness``, ``relaxation``
ta: Hingjoint3d: `` `சார்பு``,` `மென்மையாக``,` `தளர்வு``

source: SliderJoint3D: ``angular_\*``, ``\*_limit/softness``, ``\*_limit/restitution``, ``\*_limit/damping``
ta: Sliderjoint3d: `` கோண _ \*``, `` \*_ வரம்பு/மென்மையின்``, `` \*_ வரம்பு/மறுசீரமைப்பு``, `` \*_ வரம்பு/குறைத்தல்``

source: ConeTwistJoint3D: ``bias``, ``relaxation``, ``softness``
ta: Conetwistjoint3d: `` `சார்பு``,` `தளர்வு``,` `மென்மையாக``

source: Generic6DOFJoint3D: ``*_limit_*/softness``, ``*_limit_*/restitution``, ``*_limit_*/damping``, ``*_limit_*/erp``
ta: Generic6dofjoint3d: ``*_ limit _*/மென்மையின்``, ``*_ லிமிட் _*/மறுசீரமைப்பு``, ``*_ லிமிட் _*/தணித்தல்``, ``*_ லிமிட் _/எர்ப்``

source: Currently a warning is emitted if you set these properties to anything but their default values.
it: Attualmente viene emesso un avviso se si impostano queste proprietà su un valore diverso da quello predefinito.
ru: В настоящее время выдается предупреждение, если задать для этих свойств значения, отличные от значений по умолчанию.
ta: இந்த பண்புகளை அவற்றின் இயல்புநிலை மதிப்புகளைத் தவிர வேறு எதற்கும் அமைத்தால் தற்போது ஒரு முன்னறிவிப்பு வெளிப்படும்.
uk: Наразі з'являється попередження, якщо ви встановите для цих властивостей значення, відмінні від значень за замовчуванням.
zh_hant: 目前若將上述屬性設定為非預設值，會顯示警告。

source: Single-body joints
it: Giunti con un solo corpo
ru: Однокорпусные суставы
ta: ஒற்றை உடல் மூட்டுகள்
uk: Монотільні суглоби
zh_hans: 单物体关节
zh_hant: 單一剛體關節

source: You can, in Godot, omit one of the joint bodies for a two-body joint and effectively have "the world" be the other body. However, the node path that you assign your body to (:ref:`node_a<class_Joint3D_property_node_a>` vs :ref:`node_b<class_Joint3D_property_node_b>`) is ignored. Godot Physics will always behave as if you assigned it to ``node_a``, and since ``node_a`` is also what defines the frame of reference for the joint limits, you end up with inverted limits and a potentially strange limit shape, especially if your limits allow both linear and angular degrees of freedom.
ru: В Godot можно исключить одно из тел сочленения для двухчастичного сочленения и фактически сделать "the world" другим телом. Однако путь к узлу, которому вы назначаете своё тело (:ref:`node_a<class_Joint3D_property_node_a>` вместо :ref:`node_b<class_Joint3D_property_node_b>`), игнорируется. Godot Physics всегда будет вести себя так, как будто вы назначили его ``node_a``, и поскольку ``node_a`` также определяет систему отсчёта для пределов сочленения, в результате вы получите инвертированные пределы и потенциально странную форму предела, особенно если ваши пределы допускают как линейные, так и угловые степени свободы.
ta: நீங்கள், கோடோட்டில், இரண்டு உடல் கூட்டுக்கு கூட்டு உடல்களில் ஒன்றை தவிர்க்கலாம் மற்றும் திறம்பட "உலகம்" மற்ற உடலாக இருக்க முடியும். இருப்பினும், உங்கள் உடலை நீங்கள் ஒதுக்கும் முனை பாதை (: ref: `node_a <class_joint3d_property_node_a>` vs: res: `node_b <class_joint3d_property_node_b>`) புறக்கணிக்கப்படுகிறது. கோடோட் இயற்பியல் எப்போதுமே நீங்கள் அதை `` node_a`` க்கு ஒதுக்கியது போல் நடந்து கொள்ளும், மேலும் `` node_a`` என்பதும் கூட்டு வரம்புகளுக்கான குறிப்பின் சட்டகத்தை வரையறுக்கிறது என்பதால், நீங்கள் தலைகீழ் வரம்புகள் மற்றும் விசித்திரமான வரம்பு வடிவத்துடன் முடிவடையும், குறிப்பாக உங்கள் வரம்புகள் நேரியல் மற்றும் கோண அளவிலான சுதந்திரத்தை அனுமதித்தால்.
uk: У методі Godot ви можете пропустити одне зі спільних тіл для двотілового суглоба та фактично зробити так, щоб "світ" був іншим тілом. Однак, шлях вузла, якому ви призначаєте своє тіло (:ref:`node_a<class_Joint3D_property_node_a>` проти :ref:`node_b<class_Joint3D_property_node_b>`), ігнорується. Фізика Godot завжди поводитиметься так, ніби ви призначили його ``node_a``, і оскільки ``node_a`` також визначає систему відліку для спільних меж, ви отримаєте інвертовані межі та потенційно дивну форму межі, особливо якщо ваші межі дозволяють як лінійні, так і кутові ступені свободи.
zh_hant: 在 Godot 中，你可以在雙剛體關節中省略其中一個剛體，讓「世界」充當另一個剛體。然而，你為剛體指定的節點路徑（:ref:`node_a<class_Joint3D_property_node_a>` 與 :ref:`node_b<class_Joint3D_property_node_b>`）會被忽略。Godot Physics 總是會把它視為指定到 ``node_a``。由於 ``node_a`` 也用來定義關節限制的參考座標，你最終會得到反向的限制，甚至可能出現奇怪的限制形狀，特別是在你的限制同時允許線性與角度自由度時。

source: Jolt will behave as if you assigned the body to ``node_b`` instead, with ``node_a`` representing "the world". There is a project setting called :ref:`Physics > Jolt Physics 3D > Joints > World Node<class_ProjectSettings_property_physics/jolt_physics_3d/joints/world_node>` that lets you toggle this behavior, if you need compatibility for an existing project.
ru: Jolt будет вести себя так, как будто тело назначено узлу ``node_b``, где ``node_a`` представляет "the world". Существует настройка проекта :ref:`Physics > Jolt Physics 3D > Joints > World Node<class_ProjectSettings_property_physics/jolt_physics_3d/joints/world_node>`, которая позволяет включить это поведение, если вам нужна совместимость с существующим проектом.
ta: "உலகத்தை" குறிக்கும் `` node_a`` உடன், நீங்கள் உடலை `` node_b`` க்கு ஒதுக்கியது போல் சோல்ட் நடந்து கொள்வார். ஒரு திட்ட அமைப்பு என அழைக்கப்படுகிறது: Ref: `இயற்பியல்> சால்ட் இயற்பியல் 3D> மூட்டுகள்> உலக முனை <class_projectsettings_property_physics/jold_physics_3d/monighs/world_node>` இந்த நடத்தையை மாற்றுவதற்கு நீங்கள் அனுமதிக்கிறது.
uk: Jolt поводитиметься так, ніби ви призначили тіло вузлу ``node_b``, де ``node_a`` представлятиме "світ". Існує налаштування проекту під назвою :ref:`Physics > Jolt Physics 3D > Joints > World Node<class_ProjectSettings_property_physics/jolt_physics_3d/joints/world_node>`, яке дозволяє перемикати цю поведінку, якщо вам потрібна сумісність для існуючого проекту.
zh_hant: Jolt 則會把你的剛體視為指定到 ``node_b``，並以 ``node_a`` 表示「世界」。如果你需要與既有專案相容，可以透過專案設定 :ref:`Physics > Jolt Physics 3D > Joints > World Node<class_ProjectSettings_property_physics/jolt_physics_3d/joints/world_node>` 來切換此行為。

source: Collision margins
it: Margini di collisione
ru: Пределы столкновения
ta: மோதல் விளிம்புகள்
uk: Межі зіткнень
zh_hans: 碰撞边距
zh_hant: 碰撞邊距

source: Jolt (and other similar physics engines) uses something that Jolt refers to as "convex radius" to help improve the performance and behavior of the types of collision detection that Jolt relies on for convex shapes. Other physics engines (Godot included) might refer to these as "collision margins" instead. Godot exposes these as the ``margin`` property on every Shape3D-derived class, but Godot Physics itself does not use them for anything.
ru: Jolt (и другие подобные физические движки) использует то, что Jolt называет "выпуклым радиусом", для улучшения производительности и поведения типов обнаружения столкновений, которые Jolt использует для выпуклых фигур. Другие физические движки (включая Godot) могут называть их "отступами от столкновений". Godot предоставляет их как свойство ``margin`` для каждого класса, производного от Shape3D, но сам Godot Physics не использует их ни для чего.
ta: சோல்ட் (மற்றும் பிற ஒத்த இயற்பியல் என்சின்கள்) குவிந்த வடிவங்களை நம்பியிருக்கும் மோதல் கண்டறிதல் வகைகளின் செயல்திறன் மற்றும் நடத்தையை மேம்படுத்த உதவும் "குவிந்த ஆரம்" என்று குறிப்பிடும் ஒன்றைப் பயன்படுத்துகிறது. பிற இயற்பியல் இயந்திரங்கள் (கோடோட் சேர்க்கப்பட்டுள்ளது) அதற்கு பதிலாக "மோதல் விளிம்புகள்" என்று குறிப்பிடலாம். கோடோட் இவற்றை ஒவ்வொரு சேப் 3 டி-பெறப்பட்ட வகுப்பிலும் `` விளிம்பு` சொத்து என அம்பலப்படுத்துகிறார், ஆனால் கோடோட் இயற்பியல் அவற்றை எதற்கும் பயன்படுத்தாது.
uk: Jolt (та інші подібні фізичні двигуни) використовує те, що Jolt називає "опуклим радіусом", щоб покращити продуктивність та поведінку типів виявлення зіткнень, на які Jolt покладається для опуклих фігур. Інші фізичні двигуни (включно з Godot) можуть називати їх "полями зіткнень". Godot надає їх як властивість ``margin`` для кожного класу, похідного від Shape3D, але сама фізика Godot не використовує їх ні для чого.
zh_hant: Jolt（以及其它類似的物理引擎）使用一種 Jolt 稱為「convex radius」的概念，來改善凸形狀所仰賴的碰撞偵測效能與行為。其他物理引擎（包含 Godot）可能會將其稱為「collision margins（碰撞邊距）」。Godot 在所有繼承自 Shape3D 的類別上以 ``margin`` 屬性公開這個值，但 Godot Physics 本身並不使用它。

source: What these collision margins sometimes do in other engines (as described in Godot's documentation) is effectively add a "shell" around the shape, slightly increasing its size while also rounding off any edges/corners. In Jolt however, these margins are first used to shrink the shape, and then the "shell" is applied, resulting in edges/corners being similarly rounded off, but without increasing the size of the shape.
ru: В других движках эти поля столкновения иногда (как описано в документации Godot) фактически добавляют "оболочку" вокруг фигуры, слегка увеличивая её размер и одновременно скругляя рёбра/углы. Однако в Jolt эти поля сначала используются для сжатия фигуры, а затем применяется "оболочка", в результате чего рёбра/углы также скругляются, но без увеличения размера фигуры.
ta: இந்த மோதல் விளிம்புகள் சில நேரங்களில் மற்ற இயந்திரங்களில் (கோடோட்டின் ஆவணங்களில் விவரிக்கப்பட்டுள்ளபடி) என்ன செய்கின்றன என்பது வடிவத்தைச் சுற்றி ஒரு "செல்" ஐ திறம்பட சேர்க்கிறது, அதன் அளவை சற்று அதிகரிக்கும், அதே நேரத்தில் எந்த விளிம்புகள்/மூலைகளையும் வட்டமிடுகிறது. இருப்பினும், இந்த விளிம்புகள் முதலில் வடிவத்தை சுருக்கப் பயன்படுத்தப்படுகின்றன, பின்னர் "செல்" பயன்படுத்தப்படுகிறது, இதன் விளைவாக விளிம்புகள்/மூலைகள் இதேபோல் வட்டமிடப்படுகின்றன, ஆனால் வடிவத்தின் அளவை அதிகரிக்காமல்.
uk: Ці поля колізій іноді роблять в інших рушіях (як описано в документації Godot), фактично додаючи "оболонку" навколо фігури, трохи збільшуючи її розмір, а також заокруглюючи будь-які краї/кути. Однак у Jolt ці поля спочатку використовуються для стиснення фігури, а потім застосовується "оболонка", в результаті чого краї/кути аналогічно заокруглюються, але без збільшення розміру фігури.
zh_hant: 在其他引擎中（如 Godot 文件所述），碰撞邊距有時等同於在形狀外加上一層「殼」，稍微放大形狀並使邊角變得圓滑。然而在 Jolt 中，會先用該邊距縮小形狀，之後再套用「殼」，同樣能讓邊角圓滑，但不會增加形狀的實際尺寸。

source: To prevent having to tweak this margin property manually, since its default value can be problematic for smaller shapes, the Jolt module exposes a project setting called :ref:`Physics > Jolt Physics 3D > Collisions > Collision Margin Fraction<class_ProjectSettings_property_physics/jolt_physics_3d/collisions/collision_margin_fraction>` which is multiplied with the smallest axis of the shape's AABB to calculate the actual margin. The margin property of the shape is then instead used as an upper bound.
ru: Чтобы избежать необходимости вручную настраивать это свойство поля, поскольку его значение по умолчанию может быть проблематичным для небольших фигур, модуль Jolt предоставляет настройку проекта :ref:`Physics > Jolt Physics 3D > Collisions > Collision Margin Fraction<class_ProjectSettings_property_physics/jolt_physics_3d/collisions/collision_margin_fraction>`, которая умножается на наименьшую ось AABB фигуры для расчета фактического поля. В этом случае свойство поля фигуры используется в качестве верхней границы.
ta: பெறுநர் prevent having பெறுநர் tweak this margin property manually, since its இயல்புநிலை மதிப்பு can be problematic க்கு smaller shapes, the Jolt தொகுதி exposes a திட்டம் setting called :ref:`Physics > Jolt Physics 3D > Collisions > மோதுகை Margin Fraction<class_ProjectSettings_property_physics/jolt_physics_3d/collisions/collision_margin_fraction>` which is multiplied with the smallest axis உண்மையான விளிம்பைக் கணக்கிட வடிவத்தின் AABB. வடிவத்தின் விளிம்பு சொத்து பின்னர் அதற்கு பதிலாக மேல் எல்லையாக பயன்படுத்தப்படுகிறது.
uk: Щоб уникнути необхідності налаштування цієї властивості поля вручну, оскільки її значення за замовчуванням може бути проблематичним для менших фігур, модуль Jolt надає налаштування проекту під назвою :ref:`Physics > Jolt Physics 3D > Collisions > Collision Margin Fraction<class_ProjectSettings_property_physics/jolt_physics_3d/collisions/collision_margin_fraction>`, яке множиться на найменшу вісь AABB фігури для обчислення фактичного поля. Властивість margin фігури потім використовується як верхня межа.
zh_hant: 由於預設邊距對較小的形狀可能造成問題, 為了避免需要手動調整, Jolt 模組提供了專案設定 :ref:`Physics > Jolt Physics 3D > Collisions > Collision Margin Fraction<class_ProjectSettings_property_physics/jolt_physics_3d/collisions/collision_margin_fraction>` , 其會與該形狀 AABB 的最小軸長相乘來計算實際邊距; 而形狀本身的邊距屬性則改作為上限值。

source: These margins should, for most use-cases, be more or less transparent, but can sometimes result in odd collision normals when performing shape queries. You can lower the above mentioned project setting to mitigate some of this, including setting it to ``0.0``, but too small of a margin can also cause odd collision results, so is generally not recommended.
ru: В большинстве случаев эти поля должны быть более или менее прозрачными, но иногда могут приводить к появлению нестандартных нормалей столкновений при выполнении запросов к формам. Вы можете уменьшить указанное выше значение параметра проекта, чтобы смягчить это, например, установив его на значение ``0.0``, но слишком маленькое поле также может привести к нестандартным результатам столкновений, поэтому, как правило, не рекомендуется.
ta: இந்த விளிம்புகள், பெரும்பாலான பயன்பாட்டு-வழக்குகளுக்கு, அதிகமாகவோ அல்லது குறைவாகவோ வெளிப்படையானதாக இருக்க வேண்டும், ஆனால் சில நேரங்களில் வடிவ வினவல்களைச் செய்யும்போது ஒற்றைப்படை மோதல் இயல்புகளை ஏற்படுத்தும். இதில் சிலவற்றைத் தணிக்க மேலே குறிப்பிட்ட திட்ட அமைப்பை நீங்கள் குறைக்கலாம், அதை `` 0.0`` என அமைப்பது உட்பட, ஆனால் ஒரு விளிம்பில் மிகக் குறைவானது ஒற்றைப்படை மோதல் முடிவுகளை ஏற்படுத்தும், எனவே பொதுவாக பரிந்துரைக்கப்படவில்லை.
uk: Ці поля, для більшості випадків використання, повинні бути більш-менш прозорими, але іноді можуть призводити до дивних колізійних нормалей під час виконання запитів фігури. Ви можете зменшити вищезгадане налаштування проекту, щоб зменшити це, зокрема встановити його на ``0.0``, але занадто мале поле також може призвести до дивних колізійних результатів, тому зазвичай не рекомендується.
zh_hans: 在大多数情况下，这些碰撞边距的影响微乎其微，但在进行形状查询时偶尔会导致异常的碰撞法线。你可以通过降低上述项目设置值（甚至设为``0.0``）来缓解此问题，但边距过小同样可能引发异常碰撞结果，因此通常不建议这样做。
zh_hant: 在多數情況下，這些邊距應該幾乎是透明無感的，但在進行形狀查詢時，偶爾可能導致奇怪的碰撞法線。你可以降低上述專案設定來緩解（包含設為 ``0.0``），但邊距太小也可能造成異常的碰撞結果，因此通常不建議。

source: Baumgarte stabilization
it: Stabilizzazione di Baumgarte
ru: Стабилизация Баумгарте
ta: பாம்கார்ட்டே உறுதிப்படுத்தல்
uk: Стабілізація Баумгарта
zh_hans: Baumgarte 稳定法
zh_hant: Baumgarte 穩定化

source: Baumgarte stabilization is a method to resolve penetrating bodies and push them to a state where they are just touching. In Godot Physics this works like a spring. This means that bodies can accelerate and may cause the bodies to overshoot and separate completely. With Jolt, the stabilization is only applied to the position and not to the velocity of the body. This means it cannot overshoot but it may take longer to resolve the penetration.
ru: Стабилизация Баумгарте — это метод, позволяющий разрешить проникающие тела и подтолкнуть их к состоянию, когда они едва касаются друг друга. В физике Godot это работает как пружина. Это означает, что тела могут ускоряться, что может привести к их проскоку и полному разделению. В методе Jolt стабилизация применяется только к положению, а не к скорости тела. Это означает, что проскок невозможен, но разрешение проникновения может занять больше времени.
ta: பாம்கார்ட்டே உறுதிப்படுத்தல் என்பது ஊடுருவிச் செல்லும் உடல்களைத் தீர்ப்பதற்கும், அவை தொடும் நிலைக்குத் தள்ளுவதற்கும் ஒரு முறையாகும். கோடோட் இயற்பியலில் இது ஒரு வேனில் போல செயல்படுகிறது. இதன் பொருள் உடல்கள் துரிதப்படுத்தப்படலாம் மற்றும் உடல்கள் மிகைப்படுத்தி முழுமையாக பிரிக்கக்கூடும். சால்ட் மூலம், உறுதிப்படுத்தல் என்பது நிலைக்கு மட்டுமே பயன்படுத்தப்படுகிறது, ஆனால் உடலின் வேகத்திற்கு அல்ல. இதன் பொருள் இது மிகைப்படுத்த முடியாது, ஆனால் ஊடுருவலைத் தீர்க்க அதிக நேரம் ஆகலாம்.
uk: Стабілізація Баумгарта — це метод вирішення проблеми проникнення тіл та приведення їх до стану, коли вони лише торкаються одне одного. У фізиці Godot це працює як пружина. Це означає, що тіла можуть прискорюватися, що може призвести до їх перестрибування та повного роз'єднання. За допомогою поштовху стабілізація застосовується лише до положення, а не до швидкості тіла. Це означає, що перестрибування неможливе, але для вирішення проблеми проникнення може знадобитися більше часу.
zh_hant: Baumgarte 穩定化是一種處理相互穿透的剛體並將它們推回到恰好接觸狀態的方法。在 Godot Physics 中，它的行為類似彈簧，意味著剛體可能產生加速並造成超調，甚至完全分離。在 Jolt 中，穩定化僅應用於位置而非速度，這表示不會超調，但解除穿透可能需要更長時間。
