Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_jolt_physics.po
Languages: it, ru, ta, uk, zh_hans, zh_hant

source: The strength of this stabilization can be tweaked using the project setting :ref:`Physics > Jolt Physics 3D > Simulation > Baumgarte Stabilization Factor<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/baumgarte_stabilization_factor>`. Setting this project setting to ``0.0`` will turn Baumgarte stabilization off. Setting it to ``1.0`` will resolve penetration in 1 simulation step. This is fast but often also unstable.
ru: Силу этой стабилизации можно настроить с помощью настройки проекта :ref:`Physics > Jolt Physics 3D > Simulation > Baumgarte Stabilization Factor<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/baumgarte_stabilization_factor>`. Установка этой настройки проекта в значение ``0.0`` отключит стабилизацию Баумгарте. Установка в значение ``1.0`` разрешит проникновение за один шаг моделирования. Это быстро, но часто нестабильно.
ta: திட்ட அமைப்பைப் பயன்படுத்தி இந்த உறுதிப்படுத்தலின் வலிமையை மாற்றியமைக்கலாம்: ref: `இயற்பியல்> சால்ட் இயற்பியல் 3D> உருவகப்படுத்துதல்> பாம்கார்ட்டே உறுதிப்படுத்தல் காரணி <class_projectsettings_property_physics/jolt_physics_3d/உருவகப்படுத்துதல்/baumgarte_stabilization_factor> in. இந்த திட்ட அமைப்பை `` 0.0`` க்கு அமைப்பது பாம்கார்ட்டே உறுதிப்படுத்தலை அணைக்கும். அதை `` 1.0`` என அமைப்பது 1 உருவகப்படுத்துதல் படியில் ஊடுருவலை தீர்க்கும். இது வேகமானது, ஆனால் பெரும்பாலும் நிலையற்றது.
uk: Силу цієї стабілізації можна налаштувати за допомогою налаштувань проекту :ref:`Physics > Jolt Physics 3D > Simulation > Baumgarte Stabilization Factor<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/baumgarte_stabilization_factor>`. Встановлення цього налаштування проекту на ``0.0`` вимкне стабілізацію Баумгарта. Встановлення на ``1.0`` вирішить проблему проникнення за 1 крок симуляції. Це швидко, але часто також нестабільно.
zh_hant: 可以透過專案設定 :ref:`Physics > Jolt Physics 3D > Simulation > Baumgarte Stabilization Factor<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/baumgarte_stabilization_factor>` 來調整此穩定化的強度。將其設為 ``0.0`` 會關閉 Baumgarte 穩定化；設為 ``1.0`` 則會在 1 個模擬步驟內解決穿透，速度很快但通常不太穩定。

source: Ghost collisions
it: Collisioni fantasma
ru: Столкновения призраков
ta: பேய் மோதல்கள்
uk: Зіткнення привидів
zh_hans: 幽灵碰撞
zh_hant: 幽靈碰撞

source: Jolt employs two techniques to mitigate ghost collisions, meaning collisions with internal edges of shapes/bodies that result in collision normals that oppose the direction of movement.
ru: Jolt использует два метода для смягчения фантомных столкновений, то есть столкновений с внутренними краями фигур/тел, которые приводят к появлению нормалей столкновений, противоположных направлению движения.
ta: பேய் மோதல்களைத் தணிக்க சால்ட் இரண்டு நுட்பங்களைப் பயன்படுத்துகிறார், அதாவது வடிவங்கள்/உடல்களின் உள் விளிம்புகளைக் கொண்ட மோதல்கள், இதன் விளைவாக இயக்கத்தின் திசையை எதிர்க்கும் மோதல் இயல்புகள் ஏற்படுகின்றன.
uk: Jolt використовує два методи для зменшення зіткнень типу "привид", тобто зіткнень з внутрішніми краями фігур/тіл, що призводять до утворення нормалей зіткнень, що протистоять напрямку руху.
zh_hant: Jolt 採用兩種技術來減輕幽靈碰撞，也就是與形狀／剛體內部邊緣發生的碰撞，導致碰撞法線方向與移動方向相反的情況。

source: The first technique, called "active edge detection", marks edges of triangles in :ref:`class_ConcavePolygonShape3D` or :ref:`class_HeightMapShape3D` as either "active" or "inactive", based on the angle to the neighboring triangle. When a collision happens with an inactive edge the collision normal will be replaced with the triangle's normal instead, to lessen the effect of ghost collisions.
ru: Первый метод, называемый "обнаружением активных рёбер", помечает рёбра треугольников в :ref:`class_ConcavePolygonShape3D` или :ref:`class_HeightMapShape3D` как "активные" или "неактивные" в зависимости от угла к соседнему треугольнику. При столкновении с неактивным ребром нормаль столкновения заменяется нормалью треугольника, чтобы уменьшить эффект фантомных столкновений.
ta: "ஆக்டிவ் எட்ச் கண்டறிதல்" என்று அழைக்கப்படும் முதல் நுட்பம், முக்கோணங்களின் விளிம்புகளைக் குறிக்கிறது: ref: `class_concavepolygonshape3d` அல்லது: ref:` class_heightmapshape3d` அண்டை முக்கோணத்தின் கோணத்தின் அடிப்படையில் "செயலில்" அல்லது "செயலற்ற". ஒரு செயலற்ற விளிம்பில் மோதல் நிகழும்போது, பேய் மோதல்களின் விளைவைக் குறைக்க, அதற்கு பதிலாக முக்கோணத்தின் இயல்புடன் மோதல் இயல்பானது மாற்றப்படும்.
uk: Перший метод, який називається «активне виявлення ребер», позначає ребра трикутників у :ref:`class_ConcavePolygonShape3D` або :ref:`class_HeightMapShape3D` як «активні» або «неактивні» на основі кута до сусіднього трикутника. Коли відбувається зіткнення з неактивним ребром, нормаль зіткнення буде замінена нормаллю трикутника, щоб зменшити ефект фантомних зіткнень.
zh_hant: 第一種技術稱為「主動邊緣偵測（active edge detection）」，會依照與鄰近三角形的夾角，將 :ref:`class_ConcavePolygonShape3D` 或 :ref:`class_HeightMapShape3D` 中三角形的邊標記為「啟用」或「停用」。當碰撞發生在停用的邊上時，會以該三角形的法線取代碰撞法線，以降低幽靈碰撞的影響。

source: The angle threshold for this active edge detection is configurable through the project setting :ref:`Physics >Jolt Physics 3D > Collisions > Active Edge Threshold<class_ProjectSettings_property_physics/jolt_physics_3d/collisions/active_edge_threshold>`.
ru: Порог угла для этого обнаружения активного края настраивается через настройки проекта :ref:`Physics >Jolt Physics 3D > Collisions > Active Edge Threshold<class_ProjectSettings_property_physics/jolt_physics_3d/collisions/active_edge_threshold>`.
ta: இந்த செயலில் உள்ள விளிம்பு கண்டறிதலுக்கான கோண வாசல் திட்ட அமைப்பின் மூலம் கட்டமைக்கக்கூடியது: ref: `இயற்பியல்> சால்ட் இயற்பியல் 3D> மோதல்கள்> செயலில் விளிம்பு வாசல் <class_projectsettings_property_physics/jolt_physics_3d/collisions/active_greshold>`.
uk: Поріг кута для цього активного виявлення країв налаштовується через налаштування проекту :ref:`Physics >Jolt Physics 3D > Collisions > Active Edge Threshold<class_ProjectSettings_property_physics/jolt_physics_3d/collisions/active_edge_threshold>`.
zh_hant: 此主動邊緣偵測的角度門檻可透過專案設定 :ref:`Physics > Jolt Physics 3D > Collisions > Active Edge Threshold<class_ProjectSettings_property_physics/jolt_physics_3d/collisions/active_edge_threshold>` 進行設定。

source: The second technique, called "enhanced internal edge removal", instead adds runtime checks to detect whether an edge is active or inactive, based on the contact points of the two bodies. This has the benefit of applying not only to collisions with :ref:`class_ConcavePolygonShape3D` and :ref:`class_HeightMapShape3D`, but also edges between any shapes within the same body.
ru: Вторая технология, называемая "улучшенным удалением внутренних рёбер", вместо этого добавляет проверки во время выполнения для определения активности или неактивности ребра на основе точек контакта двух тел. Преимущество этого подхода заключается в том, что он применим не только к столкновениям с :ref:`class_ConcavePolygonShape3D` и :ref:`class_HeightMapShape3D`, но и к рёбрам между любыми фигурами внутри одного тела.
ta: "மேம்படுத்தப்பட்ட உள் விளிம்பு அகற்றுதல்" என்று அழைக்கப்படும் இரண்டாவது நுட்பம், அதற்கு பதிலாக இரண்டு உடல்களின் தொடர்பு புள்ளிகளின் அடிப்படையில் ஒரு விளிம்பு செயலில் உள்ளதா அல்லது செயலற்றதா என்பதைக் கண்டறிய இயக்க நேர காசோலைகளைச் சேர்க்கிறது. இதனுடன் மோதல்களுக்கு மட்டுமல்ல: `class_concavepolygonshape3d` மற்றும்: ref:` class_heightmapshape3d`, ஆனால் ஒரே உடலுக்குள் உள்ள எந்த வடிவங்களுக்கும் இடையில் விளிம்புகளுக்கும் இது.
uk: Другий метод, який називається «покращене внутрішнє видалення ребер», натомість додає перевірки під час виконання для визначення активності ребра на основі точок контакту двох тіл. Це має перевагу в тому, що застосовується не лише до зіткнень з :ref:`class_ConcavePolygonShape3D` та :ref:`class_HeightMapShape3D`, але й до ребер між будь-якими фігурами в межах одного тіла.
zh_hant: 第二種技術稱為「增強型內部邊緣移除（enhanced internal edge removal）」，會在執行階段根據兩個剛體的接觸點來檢測邊是否為啟用或停用。此方法的好處是，不僅適用於與 :ref:`class_ConcavePolygonShape3D` 與 :ref:`class_HeightMapShape3D` 的碰撞，也適用於同一剛體內任意形狀之間的邊。

source: Enhanced internal edge removal can be toggled on and off for the various contexts to which it's applied, using the :ref:`Physics >Jolt Physics 3D > Simulation > Use Enhanced Internal Edge Removal<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/use_enhanced_internal_edge_removal>`, project setting, and the similar settings for :ref:`queries<class_ProjectSettings_property_physics/jolt_physics_3d/queries/use_enhanced_internal_edge_removal>` and :ref:`motion queries<class_ProjectSettings_property_physics/jolt_physics_3d/motion_queries/use_enhanced_internal_edge_removal>`.
ru: Расширенное удаление внутренних ребер можно включать и выключать для различных контекстов, к которым оно применяется, с помощью :ref:`Physics >Jolt Physics 3D > Simulation > Use Enhanced Internal Edge Removal<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/use_enhanced_internal_edge_removal>`, настроек проекта и аналогичных настроек для :ref:`queries<class_ProjectSettings_property_physics/jolt_physics_3d/queries/use_enhanced_internal_edge_removal>` и :ref:`motion queries<class_ProjectSettings_property_physics/jolt_physics_3d/motion_queries/use_enhanced_internal_edge_removal>`.
ta: மேம்படுத்தப்பட்ட உள் விளிம்பு அகற்றுதல் இது பயன்படுத்தப்பட்ட பல்வேறு சூழல்களுக்கு மாற்றியமைக்கப்படலாம்: ref: `இயற்பியல்> சோல்ட் இயற்பியல் 3D> உருவகப்படுத்துதல்> மேம்பட்ட உள் விளிம்பை அகற்றுவதைப் பயன்படுத்தவும் <class_projectsettings_property_physics/jolt_physics_3d/compution_gentemolution> _ennhanced_edgentancanced_edgentemancentancentantals :ref:`queries<class_ProjectSettings_property_physics/jolt_physics_3d/queries/use_enhanced_internal_edge_removal>` and :ref:`motion வினவல்கள் <class_projectsettings_property_physics/jold_physics_3d/moation_queries/use_enhanced_internal_edge_removal> `.
uk: Покращене видалення внутрішніх країв можна вмикати та вимикати для різних контекстів, до яких воно застосовується, використовуючи :ref:`Physics >Jolt Physics 3D > Simulation > Use Enhanced Internal Edge Removal<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/use_enhanced_internal_edge_removal>`, налаштування проекту та аналогічні налаштування для :ref:`queries<class_ProjectSettings_property_physics/jolt_physics_3d/queries/use_enhanced_internal_edge_removal>` та :ref:`motion queries<class_ProjectSettings_property_physics/jolt_physics_3d/motion_queries/use_enhanced_internal_edge_removal>`.
zh_hant: 可透過專案設定 :ref:`Physics > Jolt Physics 3D > Simulation > Use Enhanced Internal Edge Removal<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/use_enhanced_internal_edge_removal>` 來在各適用情境中啟用或停用「增強型內部邊緣移除」，以及針對 :ref:`queries<class_ProjectSettings_property_physics/jolt_physics_3d/queries/use_enhanced_internal_edge_removal>` 與 :ref:`motion queries<class_ProjectSettings_property_physics/jolt_physics_3d/motion_queries/use_enhanced_internal_edge_removal>` 的類似設定。

source: Note that neither the active edge detection nor enhanced internal edge removal apply when dealing with ghost collisions between two different bodies.
ru: Обратите внимание, что ни активное обнаружение ребер, ни улучшенное удаление внутренних ребер не применяются при наличии фиктивных столкновений между двумя разными телами.
ta: இரண்டு வெவ்வேறு உடல்களுக்கு இடையில் பேய் மோதல்களைக் கையாளும் போது செயலில் விளிம்பு கண்டறிதல் அல்லது மேம்பட்ட உள் விளிம்பு அகற்றுதல் ஆகியவை பொருந்தாது என்பதை நினைவில் கொள்க.
uk: Зверніть увагу, що ні активне виявлення країв, ні покращене видалення внутрішніх країв не застосовуються під час роботи з колізіями-привидами між двома різними тілами.
zh_hant: 請注意，當涉及兩個不同剛體之間的幽靈碰撞時，無論是主動邊緣偵測或增強型內部邊緣移除都不會套用。

source: Memory usage
it: Utilizzo di memoria
ru: Использование памяти
ta: நினைவக பயன்பாடு
uk: Використання пам'яті
zh_hans: 内存占用
zh_hant: 記憶體用量

source: Jolt uses a stack allocator for temporary allocations within its simulation step. This stack allocator requires allocating a set amount of memory up front, which can be configured using the :ref:`Physics > Jolt Physics 3D > Limits > Temporary Memory Buffer Size<class_ProjectSettings_property_physics/jolt_physics_3d/limits/temporary_memory_buffer_size>` project setting.
ru: Jolt использует стековый распределитель для временного выделения памяти на этапе моделирования. Этот стековый распределитель требует предварительного выделения определённого объёма памяти, который можно настроить с помощью параметра проекта :ref:`Physics > Jolt Physics 3D > Limits > Temporary Memory Buffer Size<class_ProjectSettings_property_physics/jolt_physics_3d/limits/temporary_memory_buffer_size>`.
ta: சால்ட் அதன் உருவகப்படுத்துதல் படிக்குள் தற்காலிக ஒதுக்கீடுகளுக்கு ஒரு அடுக்கு ஒதுக்கீட்டைப் பயன்படுத்துகிறது. இந்த அடுக்கு ஒதுக்கீட்டாளருக்கு ஒரு குறிப்பிட்ட அளவிலான நினைவகத்தை ஒதுக்க வேண்டும், இது: `இயற்பியல்> சோல்ட் இயற்பியல் 3D> வரம்புகள்> தற்காலிக நினைவக இடையக அளவு <class_projectsettings_property_physics/jolt_physics_3d/limites/temporiter_memmemory_scies>
uk: Jolt використовує розподільник стеку для тимчасових розподілів пам'яті на етапі моделювання. Цей розподільник стеку вимагає виділення певного обсягу пам'яті заздалегідь, який можна налаштувати за допомогою параметрів проекту :ref:`Physics > Jolt Physics 3D > Limits > Temporary Memory Buffer Size<class_ProjectSettings_property_physics/jolt_physics_3d/limits/temporary_memory_buffer_size>`.
zh_hant: Jolt 在模擬步驟中對暫時分配使用堆疊配置器。此堆疊配置器需要預先配置一定量的記憶體，並可透過專案設定 :ref:`Physics > Jolt Physics 3D > Limits > Temporary Memory Buffer Size<class_ProjectSettings_property_physics/jolt_physics_3d/limits/temporary_memory_buffer_size>` 來調整。

source: Ray-cast face index
it: Indice di faccia per i raycast
ru: Индекс лица с помощью Ray-cast
ta: ரே-வார்ப்பு முகம் அட்டவணை
uk: Індекс грані, відбитий променем
zh_hans: 射线投射的面索引
zh_hant: Ray Cast 面索引

source: The ``face_index`` property returned in the results of :ref:`intersect_ray()<class_PhysicsDirectSpaceState3D_method_intersect_ray>` and RayCast3D will by default always be ``-1`` with Jolt. The project setting :ref:`Physics > Jolt Physics 3D > Queries > Enable Ray Cast Face Index<class_ProjectSettings_property_physics/jolt_physics_3d/queries/enable_ray_cast_face_index>` will enable them.
it: La proprietà ``face_index`` restituita nei risultati di :ref:`intersect_ray()<class_PhysicsDirectSpaceState3D_method_intersect_ray>` e RayCast3D sarà sempre ``-1`` normalmente con Jolt. L'impostazione del progetto :ref:`Physics > Jolt Physics 3D > Queries > Enable Ray Cast Face Index<class_ProjectSettings_property_physics/jolt_physics_3d/queries/enable_ray_cast_face_index>` li abiliterà.
ru: Свойство ``face_index``, возвращаемое в результатах :ref:`intersect_ray()<class_PhysicsDirectSpaceState3D_method_intersect_ray>` и RayCast3D, по умолчанию всегда будет равно ``-1`` в Jolt. Настройка проекта :ref:`Physics > Jolt Physics 3D > Queries > Enable Ray Cast Face Index<class_ProjectSettings_property_physics/jolt_physics_3d/queries/enable_ray_cast_face_index>` включает их.
ta: `` Face_index`` சொத்து முடிவுகளில் திரும்பியது: ref: `intersect_ray () <class_physicsdirectspacestate3d_method_intersect_ray>` மற்றும் ரேகாச்ட் 3 டி இயல்புநிலையாக எப்போதும் `` -1`` சோல்ட்டுடன் இருக்கும். திட்ட அமைப்பு: REF: `இயற்பியல்> சால்ட் இயற்பியல் 3D> வினவல்கள்> ரே வார்ப்பு முக குறியீட்டை இயக்கு
uk: Властивість ``face_index``, що повертається в результатах :ref:`intersect_ray()<class_PhysicsDirectSpaceState3D_method_intersect_ray>` та RayCast3D, за замовчуванням завжди матиме значення ``-1`` з Jolt. Налаштування проекту :ref:`Physics > Jolt Physics 3D > Queries > Enable Ray Cast Face Index<class_ProjectSettings_property_physics/jolt_physics_3d/queries/enable_ray_cast_face_index>` увімкне їх.
zh_hant: 在 Jolt 中，:ref:`intersect_ray()<class_PhysicsDirectSpaceState3D_method_intersect_ray>` 與 RayCast3D 的結果所回傳的 ``face_index`` 屬性，預設一律為 ``-1``。可透過專案設定 :ref:`Physics > Jolt Physics 3D > Queries > Enable Ray Cast Face Index<class_ProjectSettings_property_physics/jolt_physics_3d/queries/enable_ray_cast_face_index>` 啟用。

source: Note that enabling this setting will increase the memory requirement of :ref:`class_ConcavePolygonShape3D` with about 25%.
it: Si noti che abilitare questa impostazione aumenterà il requisito di memoria di :ref:`class_ConcavePolygonShape3D` di circa il 25%.
ru: Обратите внимание, что включение этого параметра увеличит требования к памяти :ref:`class_ConcavePolygonShape3D` примерно на 25%.
ta: இந்த அமைப்பை இயக்குவது நினைவகத் தேவையை அதிகரிக்கும் என்பதை நினைவில் கொள்க: குறிப்பு: `class_concavepolygonshape3d` சுமார் 25%உடன்.
uk: Зверніть увагу, що ввімкнення цього параметра збільшить вимоги до пам'яті для :ref:`class_ConcavePolygonShape3D` приблизно на 25%.
zh_hant: 請注意，啟用此設定會使 :ref:`class_ConcavePolygonShape3D` 的記憶體需求增加約 25%。

source: Kinematic RigidBody3D contacts
it: Contatti RigidBody3D con Kinematic
ru: Кинематические контакты RigidBody3D
ta: இயக்கவியல் ரிகிட்போடி 3 டி தொடர்புகள்
uk: Кінематичні контакти RigidBody3D
zh_hans: 运动学 RigidBody3D 接触
zh_hant: 運動式 RigidBody3D 的接觸

source: When using Jolt, a :ref:`class_RigidBody3D` frozen with :ref:`FREEZE_MODE_KINEMATIC<class_RigidBody3D_constant_FREEZE_MODE_KINEMATIC>` will by default not report contacts from collisions with other static/kinematic bodies, for performance reasons, even when setting a non-zero :ref:`max_contacts_reported<class_RigidBody3D_property_max_contacts_reported>`. If you have many/large kinematic bodies overlapping with complex static geometry, such as :ref:`class_ConcavePolygonShape3D` or :ref:`class_HeightMapShape3D`, you can end up wasting a significant amount of CPU performance and memory without realizing it.
ru: При использовании Jolt, объект :ref:`class_RigidBody3D`, замороженный с помощью :ref:`FREEZE_MODE_KINEMATIC<class_RigidBody3D_constant_FREEZE_MODE_KINEMATIC>`, по умолчанию не будет сообщать о контактах при столкновениях с другими статическими/кинематическими телами из соображений производительности, даже если задано ненулевое значение :ref:`max_contacts_reported<class_RigidBody3D_property_max_contacts_reported>`. Если у вас много/больших кинематических тел, перекрывающихся со сложной статической геометрией, например :ref:`class_ConcavePolygonShape3D` или :ref:`class_HeightMapShape3D`, вы можете впустую тратить значительную часть ресурсов процессора и памяти, не осознавая этого.
ta: சோல்ட்டைப் பயன்படுத்தும் போது, ஒரு: குறிப்பு: `class_rigidbody3d` உடன் உறைந்தது: ref:` freeze_mode_ginematic <class_rigidbody3d_constant_freeze_mode_ginematic> `இயல்புநிலையாக மற்ற நிலையான/இயக்கவியல் உடல்களுடன் மோதல்களிலிருந்து தொடர்புகளைப் புகாரளிக்காது, செயல்திறன் காரணங்களுக்காக கூட, அல்லாத காரணங்களுக்காக கூட, . சிக்கலான நிலையான வடிவவியலுடன் ஒன்றுடன் ஒன்று உங்களிடம் பல/பெரிய இயக்கவியல் உடல்கள் இருந்தால்: குறிப்பு: `class_concavepolygonshape3d` அல்லது: ref:` class_heightmapshape3d`, நீங்கள் அதை உணராமல் கணிசமான அளவு சிபியு செயல்திறன் மற்றும் நினைவகத்தை வீணாக்குவதை முடிக்க முடியும்.
uk: Під час використання Jolt, :ref:`class_RigidBody3D`, заморожений за допомогою :ref:`FREEZE_MODE_KINEMATIC<class_RigidBody3D_constant_FREEZE_MODE_KINEMATIC>`, за замовчуванням не повідомлятиме про контакти від зіткнень з іншими статичними/кінематичними тілами з міркувань продуктивності, навіть якщо встановлено ненульове значення :ref:`max_contacts_reported<class_RigidBody3D_property_max_contacts_reported>`. Якщо у вас є багато/великі кінематичні тіла, що перекриваються зі складною статичною геометрією, такою як :ref:`class_ConcavePolygonShape3D` або :ref:`class_HeightMapShape3D`, ви можете зрештою витрачати значну кількість продуктивності процесора та пам'яті, не усвідомлюючи цього.
zh_hant: 使用 Jolt 時，若 :ref:`class_RigidBody3D` 以 :ref:`FREEZE_MODE_KINEMATIC<class_RigidBody3D_constant_FREEZE_MODE_KINEMATIC>` 冷凍，基於效能考量，預設不會回報與其他靜態／運動剛體的碰撞接觸，即使將 :ref:`max_contacts_reported<class_RigidBody3D_property_max_contacts_reported>` 設為非零亦同。若你有許多／大面積的運動剛體與複雜的靜態幾何（如 :ref:`class_ConcavePolygonShape3D` 或 :ref:`class_HeightMapShape3D`）重疊，可能在不自覺中浪費大量 CPU 效能與記憶體。

source: For this reason this behavior is opt-in through the project setting :ref:`Physics > Jolt Physics 3D > Simulation > Generate All Kinematic Contacts<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/generate_all_kinematic_contacts>`.
ru: По этой причине данное поведение включается через настройки проекта :ref:`Physics > Jolt Physics 3D > Simulation > Generate All Kinematic Contacts<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/generate_all_kinematic_contacts>`.
ta: இந்த காரணத்திற்காக இந்த நடத்தை திட்ட அமைப்பின் மூலம் தேர்வு செய்யப்படுகிறது: குறிப்பு: `இயற்பியல்> சோல்ட் இயற்பியல் 3D> உருவகப்படுத்துதல்> அனைத்து இயக்கவியல் தொடர்புகளையும் உருவாக்குங்கள் <class_projectsettings_property_physics/jolt_physics_3d/உருவகப்படுத்துதல்/உருவாக்கம்_அல்_கினேமாடிக்_சான்டாக்ட்ச்>`.
uk: З цієї причини ця поведінка вмикається через налаштування проекту :ref:`Physics > Jolt Physics 3D > Simulation > Generate All Kinematic Contacts<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/generate_all_kinematic_contacts>`.
zh_hant: 因此，是否採用此行為需透過專案設定 :ref:`Physics > Jolt Physics 3D > Simulation > Generate All Kinematic Contacts<class_ProjectSettings_property_physics/jolt_physics_3d/simulation/generate_all_kinematic_contacts>` 主動開啟。

source: Contact impulses
it: Impulsi di contatto
ru: Контактные импульсы
ta: தொடர்பு தூண்டுதல்கள்
uk: Контактні імпульси
zh_hans: 接触冲量
zh_hant: 接觸衝量

source: Due to limitations internal to Jolt, the contact impulses provided by :ref:`PhysicsDirectBodyState3D.get_contact_impulse()<class_physicsdirectbodystate3d_method_get_contact_impulse>` are estimated ahead of time based on things like the contact manifold and velocities of the colliding bodies. This means that the reported impulses will only be accurate in cases where the two bodies in question are not colliding with any other bodies.
ru: Из-за внутренних ограничений Jolt контактные импульсы, получаемые методом :ref:`PhysicsDirectBodyState3D.get_contact_impulse()<class_physicsdirectbodystate3d_method_get_contact_impulse>`, оцениваются заранее на основе таких факторов, как контактное многообразие и скорости сталкивающихся тел. Это означает, что полученные импульсы будут точными только в тех случаях, когда два рассматриваемых тела не сталкиваются друг с другом.
ta: சோல்ட்டுக்கு உட்பட்ட வரம்புகள் காரணமாக, வழங்கப்பட்ட தொடர்பு தூண்டுதல்கள்: ref: `இயற்பியல் டைரக்ட் போடிச்டேட் 3 டி. இதன் பொருள், கேள்விக்குரிய இரண்டு உடல்களும் வேறு எந்த உடல்களுடனும் மோதாத சந்தர்ப்பங்களில் மட்டுமே அறிக்கையிடப்பட்ட தூண்டுதல்கள் துல்லியமாக இருக்கும்.
uk: Через внутрішні обмеження Jolt, контактні імпульси, що надаються :ref:`PhysicsDirectBodyState3D.get_contact_impulse()<class_physicsdirectbodystate3d_method_get_contact_impulse>`, оцінюються заздалегідь на основі таких речей, як контактний різноманіття та швидкості тіл, що стикаються. Це означає, що повідомлені імпульси будуть точними лише у випадках, коли два тіла, що розглядаються, не стикаються з жодними іншими тілами.
zh_hant: 由於 Jolt 的內部限制，:ref:`PhysicsDirectBodyState3D.get_contact_impulse()<class_physicsdirectbodystate3d_method_get_contact_impulse>` 所提供的接觸衝量是預先估算的，根據接觸流形以及碰撞剛體的速度等資訊推得。這表示僅在所涉兩個剛體沒有與其他剛體碰撞時，回報的衝量才會精確。

source: Area3D and SoftBody3D
ru: Area3D и SoftBody3D
ta: ஏரியா 3 டி மற்றும் சாஃப்ட் பாடி 3 டி
uk: Area3D та SoftBody3D
zh_hans: Area3D 与 SoftBody3D
zh_hant: Area3D 與 SoftBody3D

source: WorldBoundaryShape3D
ta: WorldWoundaryShape3d
