Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_jolt_physics.po
Languages: it, ru, ta, uk, zh_hans, zh_hant

source: :ref:`class_WorldBoundaryShape3D`, which is meant to represent an infinite plane, is implemented a bit differently in Jolt compared to Godot Physics. Both engines have an upper limit for how big the effective size of this plane can be, but this size is much smaller when using Jolt, in order to avoid precision issues.
ru: :ref:`class_WorldBoundaryShape3D`, представляющий бесконечную плоскость, реализован в Jolt несколько иначе, чем в Godot Physics. В обоих движках есть верхний предел эффективного размера этой плоскости, но в Jolt этот размер значительно меньше, чтобы избежать проблем с точностью.
ta: . துல்லியமான சிக்கல்களைத் தவிர்ப்பதற்காக, இந்த விமானத்தின் பயனுள்ள அளவு எவ்வளவு பெரியதாக இருக்கும் என்பதற்கு இரு இயந்திரங்களும் ஒரு உயர் வரம்பைக் கொண்டுள்ளன, ஆனால் இந்த அளவு சால்ட்டைப் பயன்படுத்தும் போது மிகவும் சிறியதாக இருக்கும்.
uk: :ref:`class_WorldBoundaryShape3D`, який призначений для представлення нескінченної площини, реалізовано в Jolt дещо інакше порівняно з Godot Physics. Обидва рушії мають верхню межу ефективного розміру цієї площини, але цей розмір набагато менший при використанні Jolt, щоб уникнути проблем з точністю.
zh_hant: 用來表示無限平面的 :ref:`class_WorldBoundaryShape3D` 在 Jolt 與 Godot Physics 中的實作略有不同。兩者皆對此平面的有效尺寸有上限，但為避免精度問題，Jolt 下的上限要小得多。

source: You can configure this size using the :ref:`Physics > Jolt Physics 3D > Limits > World Boundary Shape Size<class_ProjectSettings_Property_physics/jolt_physics_3d/limits/world_boundary_shape_size>` project setting.
ru: Вы можете настроить этот размер с помощью настройки проекта ::ref:`Physics > Jolt Physics 3D > Limits > World Boundary Shape Size<class_ProjectSettings_Property_physics/jolt_physics_3d/limits/world_boundary_shape_size>`.
ta: இந்த அளவை நீங்கள் கட்டமைக்கலாம்: ref: `இயற்பியல்> சால்ட் இயற்பியல் 3D> வரம்புகள்> உலக எல்லை வடிவ அளவு <class_projectsettings_property_physics/jold_physics_3d/limites/world_boundary_shape_size>` திட்ட அமைப்பு.
uk: Ви можете налаштувати цей розмір за допомогою параметрів проєкту :ref:`Physics > Jolt Physics 3D > Limits > World Boundary Shape Size<class_ProjectSettings_Property_physics/jolt_physics_3d/limits/world_boundary_shape_size>`.
zh_hant: 你可以透過專案設定 :ref:`Physics > Jolt Physics 3D > Limits > World Boundary Shape Size<class_ProjectSettings_Property_physics/jolt_physics_3d/limits/world_boundary_shape_size>` 來調整此尺寸。

source: Notable differences to the Godot Jolt extension
ru: Заметные отличия от расширения Godot Jolt
ta: கோடோட் சோல்ட் நீட்டிப்புக்கு குறிப்பிடத்தக்க வேறுபாடுகள்
uk: Помітні відмінності від розширення Godot Jolt
zh_hans: 与 Godot Jolt 扩展的主要区别
zh_hant: 與 Godot Jolt 擴充功能的顯著差異

source: While the built-in Jolt module is largely a straight port of the Godot Jolt extension, there are a few things that are different.
ru: Хотя встроенный модуль Jolt по сути является прямой копией расширения Godot Jolt, есть несколько отличий.
ta: உள்ளமைக்கப்பட்ட சோல்ட் தொகுதி பெரும்பாலும் கோடோட் சோல்ட் நீட்டிப்பின் நேரான துறைமுகமாக இருந்தாலும், வேறுபட்ட சில விசயங்கள் உள்ளன.
uk: Хоча вбудований модуль Jolt значною мірою є прямим портом розширення Godot Jolt, є кілька відмінностей.
zh_hant: 雖然內建的 Jolt 模組在很大程度上是對 Godot Jolt 擴充功能的直接移植，但仍有一些差異。

source: Project settings
it: Impostazioni del progetto
ru: Настройки проекта
ta: திட்ட அமைப்புகள்
uk: Параметри проекту
zh_hans: 项目设置
zh_hant: 專案設定

source: All project settings have been moved from the ``physics/jolt_3d`` category to ``physics/jolt_physics_3d``.
it: Tutte le impostazioni del progetto sono state spostate dalla categoria ``physics/jolt_3d`` a ``physics/jolt_physics_3d``.
ru: Все настройки проекта перенесены из категории ``physics/jolt_3d`` в ``physics/jolt_physics_3d``.
ta: அனைத்து திட்ட அமைப்புகளும் `` இயற்பியல்/jolt_3d`` வகையிலிருந்து `` இயற்பியல்/jolt_physics_3d`` க்கு நகர்த்தப்பட்டுள்ளன.
uk: Усі налаштування проєкту перенесено з категорії ``physics/jolt_3d`` до ``physics/jolt_physics_3d``.
zh_hans: 所有项目设置已从 ``physics/jolt_3d`` 分类移至 ``physics/jolt_physics_3d``\ 。
zh_hant: 所有專案設定皆已從 ``physics/jolt_3d`` 類別移至 ``physics/jolt_physics_3d``。

source: On top of that, there's been some renaming and refactoring of the individual project settings as well. These include:
ru: Кроме того, были переименованы и переработаны отдельные настройки проекта. В частности:
ta: அதற்கு மேல், தனிப்பட்ட திட்ட அமைப்புகளின் மறுபெயரிடுதல் மற்றும் மறுசீரமைப்பு ஆகியவை உள்ளன. இவை பின்வருமாறு:
uk: Крім того, було також здійснено деякі перейменування та рефакторинг окремих налаштувань проекту. До них належать:
zh_hans: 此外，部分项目设置也进行了重命名和重构，包括：
zh_hant: 此外，個別的專案設定也進行了一些重新命名與重構，包括：

source: ``sleep/enabled`` is now ``simulation/allow_sleep.``
it: ``sleep/enabled`` è ora ``simulation/allow_sleep.``
ru: ``sleep/enabled`` теперь называется ``simulation/allow_sleep.``
ta: `` தூக்கம்/இயக்கப்பட்டது`` இப்போது `` உருவகப்படுத்துதல்/allow_sleep.``
uk: ``sleep/enabled`` зараз ``simulation/allow_sleep.``
zh_hans: ``sleep/enabled`` 现已更名为 ``simulation/allow_sleep``
zh_hant: ``sleep/enabled`` 現為 ``simulation/allow_sleep.``

source: ``sleep/velocity_threshold`` is now ``simulation/sleep_velocity_threshold.``
it: ``sleep/velocity_threshold`` è ora ``simulation/sleep_velocity_threshold.``
ru: ``sleep/velocity_threshold`` теперь называется ``simulation/sleep_velocity_threshold.``
ta: `` தூக்கம்/வேகம்_நெர்சோல்ட்`` இப்போது `` உருவகப்படுத்துதல்/ச்லீப்_வெலோசிட்டி_நெசோல்ட் .``
uk: ``sleep/velocity_threshold`` зараз ``simulation/sleep_velocity_threshold.``
zh_hans: ``sleep/velocity_threshold`` 现已更名为 ``simulation/sleep_velocity_threshold``
zh_hant: ``sleep/velocity_threshold`` 現為 ``simulation/sleep_velocity_threshold.``

source: ``sleep/time_threshold`` is now ``simulation/sleep_time_threshold.``
it: ``sleep/time_threshold`` è ora ``simulation/sleep_time_threshold.``
ru: ``sleep/time_threshold`` теперь называется ``simulation/sleep_time_threshold.``
ta: `` ச்லீப்/டைம்_நெர்சோல்ட்`` இப்போது `` உருவகப்படுத்துதல்/ச்லீப்_ டைம்_நெசோல்ட் .``
uk: ``sleep/time_threshold`` зараз ``simulation/sleep_time_threshold.``
zh_hans: ``sleep/time_threshold`` 现已更名为 ``simulation/sleep_time_threshold``
zh_hant: ``sleep/time_threshold`` 現為 ``simulation/sleep_time_threshold.``

source: ``collisions/use_shape_margins`` is now ``collisions/collision_margin_fraction``, where a value of 0 is equivalent to disabling it.
it: ``collisions/use_shape_margins`` è ora ``collisions/collision_margin_fraction``, dove un valore pari a 0 equivale a disabilitarlo.
ru: ``collisions/use_shape_margins`` теперь называется ``collisions/collision_margin_fraction``, где значение 0 эквивалентно отключению.
ta: `` மோதல்கள்/use_shape_margins`` இப்போது `` மோதல்கள்/மோதல்_மார்சின்_பிராக்சன்``, அங்கு 0 இன் மதிப்பு அதை முடக்குவதற்கு சமம்.
uk: ``collisions/use_shape_margins`` зараз ``collisions/collision_margin_fraction``, де значення 0 еквівалентне його вимкненню.
zh_hant: ``collisions/use_shape_margins`` 現為 ``collisions/collision_margin_fraction``，其中值為 0 等同於停用。

source: ``collisions/use_enhanced_internal_edge_removal`` is now ``simulation/use_enhanced_internal_edge_removal.``
it: ``collisions/use_enhanced_internal_edge_removal`` è ora ``simulation/use_enhanced_internal_edge_removal.``
ru: ``collisions/use_enhanced_internal_edge_removal`` теперь называется ``simulation/use_enhanced_internal_edge_removal.``
ta: `` மோதல்கள்/use_enhanced_internal_edget_removal`` இப்போது `` உருவகப்படுத்துதல்/பயன்பாடு_இன்ஆன்ட்_இண்டர்னல்_செட்_ரெமோவல்.``
uk: ``collisions/use_enhanced_internal_edge_removal`` зараз ``simulation/use_enhanced_internal_edge_removal.``
zh_hans: ``collisions/use_enhanced_internal_edge_removal`` 现已更名为 ``simulation/use_enhanced_internal_edge_removal``
zh_hant: ``collisions/use_enhanced_internal_edge_removal`` 現為 ``simulation/use_enhanced_internal_edge_removal.``

source: ``collisions/areas_detect_static_bodies`` is now ``simulation/areas_detect_static_bodies.``
it: ``collisions/areas_detect_static_bodies`` è ora ``simulation/areas_detect_static_bodies.``
ru: ``collisions/areas_detect_static_bodies`` теперь называется ``simulation/areas_detect_static_bodies.``
ta: `` மோதல்கள்/பகுதிகள்_டெடெக்ட்_ச்டாடிக்_போடிச்`` இப்போது `` உருவகப்படுத்துதல்/பகுதிகள்_டெடெக்ட்_ச்டாடிக்_போடிச் .``
uk: ``collisions/areas_detect_static_bodies`` зараз ``simulation/areas_detect_static_bodies.``
zh_hans: ``collisions/areas_detect_static_bodies`` 现已更名为 ``simulation/areas_detect_static_bodies``
zh_hant: ``collisions/areas_detect_static_bodies`` 現為 ``simulation/areas_detect_static_bodies.``

source: ``collisions/report_all_kinematic_contacts`` is now ``simulation/generate_all_kinematic_contacts.``
it: ``collisions/report_all_kinematic_contacts`` è ora ``simulation/generate_all_kinematic_contacts.``
ru: ``collisions/report_all_kinematic_contacts`` теперь называется ``simulation/generate_all_kinematic_contacts.``
ta: `` மோதல்கள்/அறிக்கை_ஆல்_கின்மாடிக்_சான்டாக்ட்ச்`` இப்போது `` உருவகப்படுத்துதல்/உருவாக்கம்_அல்_கின்மாடிக்_கோன்டாக்ட்ச் .``
uk: ``collisions/report_all_kinematic_contacts`` зараз ``simulation/generate_all_kinematic_contacts.``
zh_hans: ``collisions/report_all_kinematic_contacts`` 现已更名为 ``simulation/generate_all_kinematic_contacts``
zh_hant: ``collisions/report_all_kinematic_contacts`` 現為 ``simulation/generate_all_kinematic_contacts.``

source: ``collisions/soft_body_point_margin`` is now ``simulation/soft_body_point_radius.``
it: ``collisions/soft_body_point_margin`` è ora ``simulation/soft_body_point_radius.``
ru: ``collisions/soft_body_point_margin`` сейчас ``simulation/soft_body_point_radius.``
ta: `` மோதல்கள்/soft_body_point_margin`` இப்போது `` உருவகப்படுத்துதல்/soft_body_point_radius.``
uk: ``collisions/soft_body_point_margin`` зараз ``simulation/soft_body_point_radius.``
zh_hans: ``collisions/soft_body_point_margin`` 现已更名为 ``simulation/soft_body_point_radius``
zh_hant: ``collisions/soft_body_point_margin`` 現為 ``simulation/soft_body_point_radius.``

source: ``collisions/body_pair_cache_enabled is now simulation/body_pair_contact_cache_enabled.``
it: ``collisions/body_pair_cache_enabled`` è ora ``simulation/body_pair_contact_cache_enabled.``
ru: ``collisions/body_pair_cache_enabled`` сейчас ``simulation/body_pair_contact_cache_enabled.``
ta: `` மோதல்கள்/body_pair_cache_enabled என்பது இப்போது உருவகப்படுத்துதல்/உடல்_பேர்_சான்டாக்ட்_கேச்_இன்அபிள்ட்.``
zh_hans: ``collisions/body_pair_cache_enabled`` 现已更名为 ``simulation/body_pair_contact_cache_enabled``
zh_hant: ``collisions/body_pair_cache_enabled 現為 simulation/body_pair_contact_cache_enabled.``

source: ``collisions/body_pair_cache_angle_threshold is now simulation/body_pair_contact_cache_angle_threshold.``
it: ``collisions/body_pair_cache_angle_threshold`` è ora ``simulation/body_pair_contact_cache_angle_threshold.``
ru: ``collisions/body_pair_cache_angle_threshold`` сейчас ``simulation/body_pair_contact_cache_angle_threshold.``
ta: `` மோதல்கள்/body_pair_cache_angle_thrheshold இப்போது உருவகப்படுத்துதல்/உடல்_பேர்_சான்டாக்ட்_கேச்_காஞ்ச்_நெர்சோல்ட் .``
zh_hans: ``collisions/body_pair_cache_angle_threshold`` 现已更名为 ``simulation/body_pair_contact_cache_angle_threshold``
zh_hant: ``collisions/body_pair_cache_angle_threshold 現為 simulation/body_pair_contact_cache_angle_threshold.``

source: ``continuous_cd/movement_threshold`` is now ``simulation/continuous_cd_movement_threshold``, but expressed as a fraction instead of a percentage.
it: ``continuous_cd/movement_threshold`` ora è ``simulation/continuous_cd_movement_threshold``, ma espresso come frazione anziché come percentuale.
ru: ``continuous_cd/movement_threshold`` сейчас ``simulation/continuous_cd_movement_threshold``, но выражено в виде дроби, а не процента.
ta: `` contilation_cd/tramice_threshold`` இப்போது `` சிமுலேசன்/CONTIVE_CD_MOVENTEM_THRESHOLD``, ஆனால் ஒரு சதவீதத்திற்கு பதிலாக ஒரு பகுதியாக வெளிப்படுத்தப்படுகிறது.
uk: ``continuous_cd/movement_threshold`` зараз ``simulation/continuous_cd_movement_threshold``, але виражений у вигляді дробу, а не відсотків.
zh_hant: ``continuous_cd/movement_threshold`` 現為 ``simulation/continuous_cd_movement_threshold``，但以小數（fraction）而非百分比表達。

source: ``continuous_cd/max_penetration`` is now ``simulation/continuous_cd_max_penetration``, but expressed as a fraction instead of a percentage.
it: ``continuous_cd/max_penetration`` ora è ``simulation/continuous_cd_max_penetration``, ma espresso come frazione anziché come percentuale.
ru: ``continuous_cd/max_penetration`` сейчас ``simulation/continuous_cd_max_penetration``, но выражено в виде дроби, а не процента.
ta: `` contilation_cd/max_penetration`` இப்போது `` சிமுலேசன்/CONTIVE_CD_MAX_PENETRATION``, ஆனால் ஒரு சதவீதத்திற்கு பதிலாக ஒரு பகுதியாக வெளிப்படுத்தப்படுகிறது.
uk: ``continuous_cd/max_penetration`` зараз ``simulation/continuous_cd_max_penetration``, але виражений у вигляді дробу, а не відсотків.
zh_hant: ``continuous_cd/max_penetration`` 現為 ``simulation/continuous_cd_max_penetration``，但以小數（fraction）而非百分比表達。

source: ``kinematics/use_enhanced_internal_edge_removal`` is now ``motion_queries/use_enhanced_internal_edge_removal.``
it: ``kinematics/use_enhanced_internal_edge_removal`` è ora ``motion_queries/use_enhanced_internal_edge_removal.``
ru: ``kinematics/use_enhanced_internal_edge_removal`` сейчас ``motion_queries/use_enhanced_internal_edge_removal.``
ta: `` இயக்கவியல்/use_enhanced_internal_edget_removal`` இப்போது `` MOTION_QUERIES/USE_ENHANCED_INTERNAL_EDGE_REMOVAL.``
uk: ``kinematics/use_enhanced_internal_edge_removal`` зараз ``motion_queries/use_enhanced_internal_edge_removal.``
zh_hans: ``kinematics/use_enhanced_internal_edge_removal`` 现已更名为 ``motion_queries/use_enhanced_internal_edge_removal``
zh_hant: ``kinematics/use_enhanced_internal_edge_removal`` 現為 ``motion_queries/use_enhanced_internal_edge_removal.``

source: ``kinematics/recovery_iterations`` is now ``motion_queries/recovery_iterations``, but expressed as a fraction instead of a percentage.
it: ``kinematics/recovery_iterations`` è ora ``motion_queries/recovery_iterations``, ma espresso come frazione anziché come percentuale.
ru: ``kinematics/recovery_iterations`` сейчас ``motion_queries/recovery_iterations``, но выражено в виде дроби, а не процента.
ta: `` இயக்கவியல்/மீட்பு_இடேசன்ச்`` இப்போது `` மோசன்_ரீச்/மீட்பு_இடேசன்ச்``, ஆனால் ஒரு சதவீதத்திற்கு பதிலாக ஒரு பகுதியாக வெளிப்படுத்தப்படுகிறது.
uk: ``kinematics/recovery_iterations`` зараз ``motion_queries/recovery_iterations``, але виражений у вигляді дробу, а не відсотків.
zh_hant: ``kinematics/recovery_iterations`` 現為 ``motion_queries/recovery_iterations``，但以小數（fraction）而非百分比表達。

source: ``kinematics/recovery_amount`` is now ``motion_queries/recovery_amount.``
it: ``kinematics/recovery_amount`` è ora ``motion_queries/recovery_amount.``
ru: ``kinematics/recovery_amount`` сейчас ``motion_queries/recovery_amount.``
ta: `` இயக்கவியல்/மீட்பு_எமவுண்ட்`` இப்போது `` மோசன்_வீரிகள்/மீட்பு_மவுண்ட் .``
uk: ``kinematics/recovery_amount`` зараз ``motion_queries/recovery_amount.``
zh_hans: ``kinematics/recovery_amount`` 现已更名为 ``motion_queries/recovery_amount``
zh_hant: ``kinematics/recovery_amount`` 現為 ``motion_queries/recovery_amount.``

source: ``queries/use_legacy_ray_casting`` has been removed.
it: ``queries/use_legacy_ray_casting`` è stato rimosso.
ru: ``queries/use_legacy_ray_casting`` был удален.
ta: `` வினவல்கள்/use_legacy_ray_casting`` அகற்றப்பட்டது.
uk: ``queries/use_legacy_ray_casting`` було видалено.
zh_hant: ``queries/use_legacy_ray_casting`` 已被移除。

source: ``solver/position_iterations`` is now ``simulation/position_steps.``
it: ``solver/position_iterations`` è ora ``simulation/position_steps.``
ru: ``solver/position_iterations`` сейчас ``simulation/position_steps.``
ta: `` தீர்வி/நிலை_இடேசன்ச்`` இப்போது `` உருவகப்படுத்துதல்/நிலை_ச்டெப்ச் .``
uk: ``solver/position_iterations`` зараз ``simulation/position_steps.``
zh_hans: ``solver/position_iterations`` 现已更名为 ``simulation/position_steps``
zh_hant: ``solver/position_iterations`` 現為 ``simulation/position_steps.``

source: ``solver/velocity_iterations`` is now ``simulation/velocity_steps.``
it: ``solver/velocity_iterations`` è ora ``simulation/velocity_steps.``
ru: ``solver/velocity_iterations`` сейчас ``simulation/velocity_steps.``
ta: `` தீர்வி/வேகம்_இடேசன்ச்`` இப்போது `` உருவகப்படுத்துதல்/வேகம்_ச்டெப்ச் .``
uk: ``solver/velocity_iterations`` зараз ``simulation/velocity_steps.``
zh_hans: ``solver/velocity_iterations`` 现已更名为 ``simulation/velocity_steps``
zh_hant: ``solver/velocity_iterations`` 現為 ``simulation/velocity_steps.``

source: ``solver/position_correction`` is now ``simulation/baumgarte_stabilization_factor``, but expressed as a fraction instead of a percentage.
it: ``solver/position_correction`` è ora ``simulation/baumgarte_stabilization_factor``, ma espresso come frazione anziché come percentuale.
ru: ``solver/position_correction`` сейчас ``simulation/baumgarte_stabilization_factor``, но выражено в виде дроби, а не процента.
ta: `` தீர்வி/நிலை_ கவனிப்பு`` இப்போது `` சிமுலேசன்/பாம்கார்ட்டே_ச்டாபிலிசேசன்_பாக்டோர்``, ஆனால் ஒரு சதவீதத்திற்கு பதிலாக ஒரு பகுதியாக வெளிப்படுத்தப்படுகிறது.
uk: ``solver/position_correction`` зараз ``simulation/baumgarte_stabilization_factor``, але виражений у вигляді дробу, а не відсотків.
zh_hant: ``solver/position_correction`` 現為 ``simulation/baumgarte_stabilization_factor``，但以小數（fraction）而非百分比表達。

source: ``solver/active_edge_threshold`` is now ``collisions/active_edge_threshold.``
it: ``solver/active_edge_threshold`` è ora ``collisions/active_edge_threshold.``
ru: ``solver/active_edge_threshold`` сейчас ``collisions/active_edge_threshold.``
ta: `` தீர்வி/செயலில்_செட்_நெசோல்ட்`` இப்போது `` மோதல்கள்/செயலில்_செட்_நெசோல்ட் .``
uk: ``solver/active_edge_threshold`` зараз ``collisions/active_edge_threshold.``
zh_hans: ``solver/active_edge_threshold`` 现已更名为 ``collisions/active_edge_threshold``
zh_hant: ``solver/active_edge_threshold`` 現為 ``collisions/active_edge_threshold.``

source: ``solver/bounce_velocity_threshold`` is now ``simulation/bounce_velocity_threshold.``
it: ``solver/bounce_velocity_threshold`` è ora ``simulation/bounce_velocity_threshold.``
ru: ``solver/bounce_velocity_threshold`` сейчас ``simulation/bounce_velocity_threshold.``
ta: `` solver/pounce_velocity_threshold`` இப்போது `` சிமுலேசன்/பவுன்ச்_வெலோசிட்டி_நெர்சோல்ட் .``
uk: ``solver/bounce_velocity_threshold`` зараз ``simulation/bounce_velocity_threshold.``
zh_hans: ``solver/bounce_velocity_threshold`` 现已更名为 ``simulation/bounce_velocity_threshold``
zh_hant: ``solver/bounce_velocity_threshold`` 現為 ``simulation/bounce_velocity_threshold.``

source: ``solver/contact_speculative_distance`` is now ``simulation/speculative_contact_distance.``
it: ``solver/contact_speculative_distance`` è ora ``simulation/speculative_contact_distance.``
ru: ``solver/contact_speculative_distance`` сейчас ``simulation/speculative_contact_distance.``
ta: `` தீர்வி/contact_speculative_distance`` இப்போது `` உருவகப்படுத்துதல்/ஊகம்_சான்டாக்ட்_டிச்டன்ச் .``
uk: ``solver/contact_speculative_distance`` зараз ``simulation/speculative_contact_distance.``
zh_hans: ``solver/contact_speculative_distance`` 现已更名为 ``simulation/speculative_contact_distance``
zh_hant: ``solver/contact_speculative_distance`` 現為 ``simulation/speculative_contact_distance.``

source: ``solver/contact_allowed_penetration`` is now ``simulation/penetration_slop.``
it: ``solver/contact_allowed_penetration`` è ora ``simulation/penetration_slop.``
ru: ``solver/contact_allowed_penetration`` сейчас ``simulation/penetration_slop.``
ta: `` வெள்ளி/தொடர்பு அனுமதிக்கப்பட்ட ஊடுருவல்`` இப்போது `` உருவகப்படுத்துதல்/ஊடுருவல் சரிவு .``
uk: ``solver/contact_allowed_penetration`` зараз ``simulation/penetration_slop.``
zh_hans: ``solver/contact_allowed_penetration`` 现已更名为 ``simulation/penetration_slop``
zh_hant: ``solver/contact_allowed_penetration`` 現為 ``simulation/penetration_slop.``

source: ``limits/max_angular_velocity`` is now stored as radians instead.
it: ``limits/max_angular_velocity`` ora è invece memorizzato in radianti.
ru: ``limits/max_angular_velocity`` теперь хранится в радианах.
ta: `` வரம்புகள்/max_angular_velocity`` இப்போது அதற்கு பதிலாக ரேடியன்களாக சேமிக்கப்படுகிறது.
uk: ``limits/max_angular_velocity`` тепер зберігається у вигляді радіанів.
zh_hant: ``limits/max_angular_velocity`` 現改以弧度儲存。

source: ``limits/max_temporary_memory`` is now ``limits/temporary_memory_buffer_size.``
it: ``limits/max_temporary_memory`` è ora ``limits/temporary_memory_buffer_size.``
ru: ``limits/max_temporary_memory`` сейчас ``limits/temporary_memory_buffer_size.``
ta: `` வரம்புகள்/max_temperace_memory`` இப்போது `` வரம்புகள்/தற்காலிக_மெமரி_பஃபர்_சிச்.``
uk: ``limits/max_temporary_memory`` зараз ``limits/temporary_memory_buffer_size.``
zh_hans: ``limits/max_temporary_memory`` 现已更名为 ``limits/temporary_memory_buffer_size``
zh_hant: ``limits/max_temporary_memory`` 現為 ``limits/temporary_memory_buffer_size.``

source: Joint nodes
it: Nodi di giunti
ru: Узлы Суставов
ta: கூட்டு முனைகள்
uk: Суглобові вузли
zh_hans: 关节节点
zh_hant: 關節節點

source: The joint nodes that are exposed in the Godot Jolt extension (JoltPinJoint3D, JoltHingeJoint3D, JoltSliderJoint3D, JoltConeTwistJoint3D, and JoltGeneric6DOFJoint) have not been included in the Jolt module.
it: I nodi di giunti esposti nell'estensione Godot Jolt (JoltPinJoint3D, JoltHingeJoint3D, JoltSliderJoint3D, JoltConeTwistJoint3D e JoltGeneric6DOFJoint) non sono stati inclusi nel modulo Jolt.
ru: Соединительные узлы, представленные в расширении Godot Jolt (JoltPinJoint3D, JoltHingeJoint3D, JoltSliderJoint3D, JoltConeTwistJoint3D и JoltGeneric6DOFJoint), не включены в модуль Jolt.
ta: கோடோட் சோல்ட் நீட்டிப்பில் (சோல்ட்பின்சாயிண்ட் 3 டி, சோல்திங்சாயிண்ட் 3 டி, சால்ட்ச்லிடர்சாயிண்ட் 3 டி, சோல்ட்கோனெட்விச்ட்சாயிண்ட் 3 டி, மற்றும் சோல்ட்செனெரிக் 6 டோஃப்சாயிண்ட்) வெளிப்படும் கூட்டு முனைகள் சோல்ட் தொகுதியில் சேர்க்கப்படவில்லை.
uk: Вузли з'єднань, що відображаються в розширенні Godot Jolt (JoltPinJoint3D, JoltHingeJoint3D, JoltSliderJoint3D, JoltConeTwistJoint3D та JoltGeneric6DOFJoint), не були включені до модуля Jolt.
zh_hans: Godot Jolt 扩展中提供的关节节点（JoltPinJoint3D、JoltHingeJoint3D、JoltSliderJoint3D、JoltConeTwistJoint3D 和 JoltGeneric6DOFJoint3D）未包含在 Jolt 模块中。
zh_hant: Godot Jolt 擴充功能中提供的關節節點（JoltPinJoint3D、JoltHingeJoint3D、JoltSliderJoint3D、JoltConeTwistJoint3D、JoltGeneric6DOFJoint）並未包含在 Jolt 模組中。

source: Thread safety
it: Sicurezza dei thread
ru: Безопасность потока
ta: நூல் பாதுகாப்பு
uk: Безпека потоків
zh_hans: 线程安全
zh_hant: 執行緒安全
