Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_jolt_physics.po
Languages: it, ru, ta, uk, zh_hans, zh_hant

source: Unlike the Godot Jolt extension, the Jolt module does have thread-safety, including support for the :ref:`Physics > 3D > Run On Separate Thread<class_ProjectSettings_Property_physics/3d/run_on_separate_thread>` project setting. However this has not been tested very thoroughly, so it should be considered experimental.
it: A differenza dell'estensione Jolt di Godot, il modulo Jolt è in grado di essere sicuro sui thread e supporta l'impostazione del progetto :ref:`Physics > 3D > Run On Separate Thread<class_ProjectSettings_Property_physics/3d/run_on_separate_thread>`. Tuttavia, questa funzionalità non è stata testata in modo molto approfondito, quindi si dovrebbe considerare sperimentale.
ru: В отличие от расширения Godot Jolt, модуль Jolt поддерживает потоко-безопасность, включая настройку проекта :ref:`Physics > 3D > Run On Separate Thread<class_ProjectSettings_Property_physics/3d/run_on_separate_thread>`. Однако эта функция не была тщательно протестирована, поэтому её следует считать экспериментальной.
ta: கோடோட் சோல்ட் நீட்டிப்பைப் போலன்றி, சோல்ட் தொகுதிக்கு நூல்-பாதுகாப்பு உள்ளது, இதில் ஆதரவு: `இயற்பியல்> 3 டி> தனி நூலில் இயக்கவும் <class_projectsettings_property_physics/3d/run_on_separate_thread>` திட்ட அமைப்பு. இருப்பினும் இது மிகவும் முழுமையாக சோதிக்கப்படவில்லை, எனவே இது சோதனைக்குரியதாக கருதப்பட வேண்டும்.
uk: На відміну від розширення Godot Jolt, модуль Jolt має потокобезпечність, зокрема підтримку налаштування проекту :ref:`Physics > 3D > Run On Separate Thread<class_ProjectSettings_Property_physics/3d/run_on_separate_thread>`. Однак це не було ретельно протестовано, тому його слід вважати експериментальним.
zh_hant: 與 Godot Jolt 擴充功能不同，Jolt 模組具備執行緒安全，包含支援專案設定 :ref:`Physics > 3D > Run On Separate Thread<class_ProjectSettings_Property_physics/3d/run_on_separate_thread>`。然而這方面尚未經過非常充分的測試，應視為實驗性功能。

source: It is important to note that the built-in Jolt Physics module is considered **not finished**, **experimental**, and **lacks feature parity** with both Godot Physics and the Godot Jolt extension. Behavior may change as it is developed further. Please keep that in mind when choosing what to use for your project.
ru: Важно отметить, что встроенный модуль Jolt Physics считается **незаконченным**, **экспериментальным** и **не имеет функционального соответствия** ни с Godot Physics, ни с расширением Godot Jolt. Поведение модуля может измениться по мере его дальнейшей разработки. Пожалуйста, учитывайте это при выборе модуля для своего проекта.
uk: Важливо зазначити, що вбудований модуль Jolt Physics вважається **незавершеним**, **експериментальним** та **не має паритету функцій** як з Godot Physics, так і з розширенням Godot Jolt. Поведінка може змінюватися в міру його подальшого розвитку. Будь ласка, пам’ятайте про це, вибираючи, що використовувати для свого проєкту.
zh_hant: 需要特別注意的是，內建的 Jolt 物理模組目前被視為 **尚未完成**、**實驗性**，且與 Godot Physics 與 Godot Jolt 擴充功能相比 **尚未達到功能一致**。其行為在持續開發中可能改變。選擇要在專案中使用何者時，請將此納入考量。

source: Jolt does not currently support any interactions between :ref:`class_SoftBody3D` and :ref:`class_Area3D`, such as overlap events, or the wind properties found on :ref:`class_Area3D`.
ru: В настоящее время Jolt не поддерживает никаких взаимодействий между :ref:`class_SoftBody3D` и :ref:`class_Area3D`, таких как события перекрытия или свойства ветра, найденные в :ref:`class_Area3D`.
uk: Jolt наразі не підтримує жодної взаємодії між :ref:`class_SoftBody3D` та :ref:`class_Area3D`, такої як події перекриття або властивості вітру, знайдені на :ref:`class_Area3D`.
zh_hant: Jolt 目前不支援 :ref:`class_SoftBody3D` 與 :ref:`class_Area3D` 之間的任何互動，例如重疊事件，或 :ref:`class_Area3D` 上的風場屬性。

source: ``collisions/body_pair_cache_distance_threshold`` is ``now simulation/body_pair_contact_cache_distance_threshold.``
it: ``collisions/body_pair_cache_distance_threshold`` è ora ``simulation/body_pair_contact_cache_distance_threshold.``
ru: ``collisions/body_pair_cache_distance_threshold`` сейчас ``simulation/body_pair_contact_cache_distance_threshold.``
uk: ``collisions/body_pair_cache_distance_threshold`` є ``now simulation/body_pair_contact_cache_distance_threshold.``
zh_hans: ``collisions/body_pair_cache_distance_threshold`` 现已更名为 ``simulation/body_pair_contact_cache_distance_threshold``
zh_hant: ``collisions/body_pair_cache_distance_threshold`` 現為 ``simulation/body_pair_contact_cache_distance_threshold.``
