Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_exports.po
Languages: ga, it, ko, ru, ta, uk, zh_cn, zh_tw

source: Groups cannot be nested, use ``[ExportSubgroup]`` to create subgroups within a group.
ga: Ní féidir grúpaí a neadú, ''[ExportSubgroup]'' a úsáid chun foghrúpaí a chruthú laistigh de ghrúpa.
it: I gruppi non si possono annidare, utilizzare ``[ExportSubgroup]`` per creare sottogruppi all'interno di un gruppo.
ru: Группы не могут быть вложенными, используйте ``[ExportSubgroup]`` для создания подгрупп внутри группы.
ta: குழுக்களை கூடு கட்ட முடியாது, ஒரு குழுவிற்குள் துணைக்குழுக்களை உருவாக்க `` [எக்ச்போர்ட்சுப்க்ரூப்] `` பயன்படுத்தவும்.
uk: Групи не можуть бути вкладеними, використовуйте ``[ExportSubgroup]``, щоб створити підгрупи в групі.
zh_cn: 分组可以嵌套，请使用 ``[ExportSubgroup]`` 在分组中创建子分组。
zh_tw: 群組不可巢狀，若要在群組內建立子群組，請用 ``[ExportSubgroup]``。

source: You can also change the name of your main category, or create additional categories in the property list with the ``[ExportCategory]`` attribute.
ga: Is féidir leat ainm do phríomhchatagóire a athrú freisin, nó catagóirí breise a chruthú sa liosta maoine leis an tréith ''[ExportCategory]''.
it: È possibile anche cambiare il nome della categoria principale o creare categorie aggiuntive nell'elenco delle proprietà con l'attributo ``[ExportCategory]``.
ru: Вы также можете изменить название основной категории или создать дополнительные категории в списке свойств с помощью атрибута ``[ExportCategory]``.
ta: உங்கள் முதன்மையான வகையின் பெயரையும் மாற்றலாம் அல்லது சொத்து பட்டியலில் கூடுதல் வகைகளை `` [எக்ச்போர்ட் கோசரி] `` பண்புக்கூறு மூலம் உருவாக்கலாம்.
uk: Ви також можете змінити назву основної категорії або створити додаткові категорії в списку властивостей за допомогою атрибута ``[ExportCategory]``.
zh_cn: 你也可以修改你的主分类的名称，或者在属性列表中使用 ``[ExportCategory]`` 特性创建额外的分类。
zh_tw: 您也可以用 ``[ExportCategory]`` 屬性變更主要分類名稱，或在屬性列表中建立其他分類。

source: The list of properties is organized based on the class inheritance, and new categories break that expectation. Use them carefully, especially when creating projects for public use.
ga: Eagraítear liosta na n-airíonna bunaithe ar an oidhreacht ranga, agus briseann catagóirí nua an t-ionchas sin. Bain úsáid astu go cúramach, go háirithe nuair a bhíonn tionscadail á gcruthú lena n-úsáid ag an bpobal.
it: L'elenco delle proprietà è organizzato in base all'ereditarietà delle classi e l'aggiunta di nuove categorie non rispetta questa convenzione. Da usare con cautela, soprattutto quando si creano progetti per uso pubblico.
ru: Список свойств организован на основе наследования классов, и новые категории нарушают это ожидание. Используйте их с осторожностью, особенно при создании проектов для публичного использования.
ta: வர்க்க பரம்பரை அடிப்படையில் பண்புகளின் பட்டியல் ஒழுங்கமைக்கப்பட்டுள்ளது, மேலும் புதிய வகைகள் அந்த எதிர்பார்ப்பை உடைக்கின்றன. அவற்றை கவனமாகப் பயன்படுத்துங்கள், குறிப்பாக பொது பயன்பாட்டிற்கான திட்டங்களை உருவாக்கும்போது.
uk: Список властивостей організовано на основі успадкування класів, і нові категорії порушують це очікування. Використовуйте їх обережно, особливо при створенні проектів для загального користування.
zh_cn: 属性列表是根据类继承来组织的，而新的分类会打破这种预期。使用它们时要小心，尤其是在创建公共项目时。
zh_tw: 屬性列表會依據類別繼承結構排列，新增分類可能會改變這個預期。請謹慎使用，特別是當你開發公開專案時。

source: Strings as paths
ga: Teaghráin mar chosáin
it: Stringhe rappresentanti percorsi
ru: Строки как пути
ta: பாதைகளாக சரங்கள்
uk: Рядки як шляхи
zh_cn: 字符串用作文件路径
zh_tw: 字串作為路徑

source: Property hints can be used to export strings as paths
ga: Is féidir leideanna maoine a úsáid chun teaghráin a easpórtáil mar chosáin
ru: Подсказки свойств можно использовать для экспорта строк в виде путей
ta: சரங்களை பாதைகளாக ஏற்றுமதி செய்ய சொத்து குறிப்புகள் பயன்படுத்தப்படலாம்
uk: Підказки щодо властивостей можна використовувати для експорту рядків як шляхів
zh_cn: 属性提示可以用来导出字符串作为路径
zh_tw: 可用屬性提示將字串匯出為路徑

source: String as a path to a file.
ga: Teaghrán mar chosán ar chomhad.
it: Stringa rappresentante un percorso a un file.
ru: Строка как путь к файлу.
ta: ஒரு கோப்பிற்கான பாதையாக சரம்.
uk: Рядок як шлях до файлу.
zh_cn: 字符串可以用作文件路径。
zh_tw: 字串為檔案路徑。

source: String as a path to a directory.
ga: Teaghrán mar chosán chuig eolaire.
it: Stringa come percorso a una cartella.
ru: Строка как путь к каталогу.
ta: ஒரு கோப்பகத்திற்கான பாதையாக சரம்.
uk: Рядок як шлях до каталогу.
zh_cn: 字符串也可以用作文件目录路径。
zh_tw: 字串為目錄路徑。

source: String as a path to a file, custom filter provided as hint.
ga: String as a path to a file, scagaire saincheaptha curtha ar fáil mar leid.
it: Stringa come percorso a una file, filtro personalizzato fornito come indicazione.
ru: Строка как путь к файлу, пользовательский фильтр предоставлен в качестве подсказки.
ta: ஒரு கோப்பிற்கான பாதையாக சரம், தனிப்பயன் வடிகட்டி குறிப்பாக வழங்கப்படுகிறது.
uk: Рядок як шлях до файлу, спеціальний фільтр надається як підказка.
zh_cn: 字符串在用作是文件路径时，可以在提示项中提供自定义过滤器。
zh_tw: 字串為檔案路徑，提示中可提供自訂篩選。

source: Using paths in the global filesystem is also possible, but only in scripts in tool mode.
ga: Is féidir cosáin a úsáid sa chóras comhad domhanda freisin, ach amháin i scripteanna i mód uirlisí.
it: È possibile utilizzare anche i percorsi nel file system globale, ma solo negli script in modalità strumento (tool).
ru: Использование путей в глобальной файловой системе также возможно, но только в скриптах в режиме инструмента.
ta: உலகளாவிய கோப்பு முறைமையில் பாதைகளைப் பயன்படுத்துவதும் சாத்தியமாகும், ஆனால் கருவி பயன்முறையில் ச்கிரிப்ட்களில் மட்டுமே.
uk: Використання шляхів у глобальній файловій системі також можливо, але лише в сценаріях у інструментальному режимі.
zh_cn: 也可以使用全局文件系统中的路径，仅工具模式下的脚本可以如此使用。
zh_tw: 也可以使用全域檔案系統路徑，但僅限於工具模式腳本。

source: String as a path to a PNG file in the global filesystem.
ga: Teaghrán mar chosán chuig comhad PNG sa chóras comhad domhanda.
it: Stringa come percorso a un file PNG nel file system globale.
ru: Строка как путь к PNG-файлу в глобальной файловой системе.
ta: உலகளாவிய கோப்பு முறைமையில் ஒரு பி.என்.சி கோப்பிற்கான பாதையாக சரம்.
uk: Рядок як шлях до файлу PNG у глобальній файловій системі.
zh_cn: 字符串还可以用作全局文件系统中某个 PNG 文件的路径。
zh_tw: 字串為全域檔案系統中的 PNG 檔路徑。

source: String as a path to a directory in the global filesystem.
ga: Teaghrán mar chonair chuig eolaire sa chóras comhad domhanda.
it: Stringa come percorso a una cartella nel file system globale.
ru: Строка как путь к каталогу в глобальной файловой системе.
ta: உலகளாவிய கோப்பு முறைமையில் ஒரு கோப்பகத்திற்கான பாதையாக சரம்.
uk: Рядок як шлях до каталогу в глобальній файловій системі.
zh_cn: 字符串也能用作全局文件系统中某个目录的路径。
zh_tw: 字串為全域檔案系統中的目錄路徑。

source: The multiline annotation tells the editor to show a large input field for editing over multiple lines.
ga: Insíonn an anótáil illíne don eagarthóir réimse mór ionchuir a thaispeáint le haghaidh eagarthóireachta thar línte éagsúla.
it: L'annotazione multilinea indica all'editor di mostrare un ampio campo di input per la modifica su più righe.
ru: Многострочная аннотация сообщает редактору о необходимости отобразить большое поле ввода для редактирования нескольких строк.
ta: பல வரிகளைத் திருத்துவதற்கு ஒரு பெரிய உள்ளீட்டு புலத்தைக் காட்ட மல்டிலைன் சிறுகுறிப்பு எடிட்டரிடம் கூறுகிறது.
uk: Багаторядкова анотація вказує редактору показувати велике поле введення для редагування в кількох рядках.
zh_cn: 多行文本注释会让编辑器使用大文本输入框来输入文本，而非那种小小的单行输入框。
zh_tw: multiline 註記會讓編輯器顯示較大的欄位以編輯多行文字。

source: Limiting editor input ranges
ga: Raonta ionchuir eagarthóra a theorannú
it: Limitare gli intervalli inseribili nell'editor
ru: Ограничение диапазонов ввода редактора
ta: எடிட்டர் உள்ளீட்டு வரம்புகளை கட்டுப்படுத்துகிறது
uk: Обмеження діапазонів введення редактора
zh_cn: 编辑器内限制值的输入范围
zh_tw: 限制編輯器輸入範圍

source: Using the range property hint allows you to limit what can be input as a value using the editor.
ga: Trí úsáid a bhaint as an leid maoine raoin, is féidir leat teorainn a chur leis an méid is féidir a ionchur mar luach ag baint úsáide as an eagarthóir.
it: Utilizzando l'indicazione di proprietà di intervallo è possibile limitare ciò che si può inserire come valore nell'editor.
ru: Использование подсказки свойства диапазона позволяет ограничить то, что можно ввести в качестве значения с помощью редактора.
ta: வரம்பு சொத்து குறிப்பைப் பயன்படுத்துவது, எடிட்டரைப் பயன்படுத்தி உள்ளீட்டாக இருப்பதைக் கட்டுப்படுத்த உங்களை அனுமதிக்கிறது.
uk: Використання підказки властивості діапазону дозволяє обмежити те, що можна ввести як значення за допомогою редактора.
zh_cn: 使用范围属性提示允许你在编辑器中限制可以输入的值。
zh_tw: 使用 range 屬性提示可以限制在編輯器中可輸入的值。

source: Allow integer values from 0 to 20.
ga: Ceadaigh luachanna slánuimhir ó 0 go 20.
it: Permette valori interi da 0 a 20.
ru: Допустимы целые значения от 0 до 20.
ta: முழு மதிப்புகளை 0 முதல் 20 வரை அனுமதிக்கவும்.
uk: Дозволяються цілі значення від 0 до 20.
zh_cn: 允许 0 到 20 之间的整数。
zh_tw: 允許 0 到 20 的整數值。

source: Allow integer values from -10 to 20.
ga: Ceadaigh luachanna slánuimhir ó -10 go 20.
it: Permette valori interi da -10 a 20.
ru: Допустимы целые значения от -10 до 20.
ta: -10 முதல் 20 வரை முழு மதிப்புகளை அனுமதிக்கவும்.
uk: Дозволяються цілі значення від -10 до 20.
zh_cn: 允许 -10 到 20 之间的整数。
zh_tw: 允許 -10 到 20 的整數值。

source: Allow floats from -10 to 20 and snap the value to multiples of 0.2.
ga: Ceadaigh snámháin ó -10 go 20 agus léim an luach go iolraí de 0.2.
it: Permette valori in virgola mobile da -10 a 20 e aggancia il valore a multipli di 0,2.
ru: Разрешить значения с плавающей точкой от -10 до 20 и привязать их к значениям, кратным 0,2.
ta: -10 முதல் 20 வரை மிதவைகளை அனுமதிக்கவும், மதிப்பை 0.2 இன் மடங்குகளாக மாற்றவும்.
uk: Дозволити плаваючу величину від -10 до 20 і прив’язати значення до кратних 0,2.
zh_cn: 允许 -10 到 20 之间的数，调整步长为 0.2 。
zh_tw: 允許 -10 到 20 的浮點數，並以 0.2 為單位對齊。

source: If you add the hints "or_greater" and/or "or_less" you can go above or below the limits when adjusting the value by typing it instead of using the slider.
ga: Má chuireann tú na leideanna "or_greater" agus / nó "or_less" leis, is féidir leat dul os cionn nó faoi bhun na dteorainneacha agus an luach á choigeartú agat trína chlóscríobh in ionad an sleamhnán a úsáid.
it: Se si aggiungono le indicazioni "or_greater" e/o "or_less" è possibile andare sopra o sotto i limiti se si digita il valore anziché usare lo slider.
ru: Если добавить подсказки "or_greater" и/или "or_less", то при настройке значения можно будет выйти за пределы, введя его вручную, а не используя ползунок.
ta: "OR_GREATER" மற்றும்/அல்லது "OR_LESS" குறிப்புகளை நீங்கள் சேர்த்தால், ச்லைடரைப் பயன்படுத்துவதற்குப் பதிலாக தட்டச்சு செய்வதன் மூலம் மதிப்பை சரிசெய்யும்போது வரம்புகளுக்கு மேலே அல்லது கீழே செல்லலாம்.
uk: Якщо ви додаєте підказки «or_greater» та/або «or_less», ви можете перевищувати або опускати межі під час налаштування значення, вводячи його замість використання повзунка.
zh_cn: 如果添加了 "or_greater" 和/或 "or_less" 的提示，在调整值时通过键入而非使用滑块，可以超过或低于限制。
zh_tw: 如果加入提示 "or_greater" 和/或 "or_less"，就可以在編輯時透過輸入數值突破滑桿限制的上下界。

source: Floats with easing hint
ga: Snámháin le leid a mhaolú
it: Numeri in virgola mobile con indicazione di easing
ru: Поплавки с подсказкой о смягчении
ta: குறிப்பை எளிதாக்குவதன் மூலம் மிதக்கிறது
uk: Плаває з натяком на полегшення
zh_cn: 带缓动提示的浮点数
zh_tw: 帶有緩動提示的浮點數

source: Display a visual representation of the :ref:`ease<class_@GlobalScope_method_ease>` function when editing.
it: Visualizza una rappresentazione visiva della funzione :ref:`ease<class_@GlobalScope_method_ease>` durante la modifica.
ru: Отобразить визуальное представление функции :ref:`ease<class_@GlobalScope_method_ease>` при редактировании.
ta: இதன் காட்சி பிரதிநிதித்துவத்தைக் காண்பி: ref: `எளிதாக்கு <class_@globalscope_method_ease>` திருத்தும் போது செயல்பாடு.
uk: Відображати візуальне представлення функції :ref:`ease<class_@GlobalScope_method_ease>` під час редагування.
zh_cn: 在编辑器里提供 :ref:`ease<class_@GlobalScope_method_ease>` 函数的视觉呈现。
zh_tw: 在編輯時顯示 :ref:`ease<class_@GlobalScope_method_ease>` 函式的視覺化效果。

source: Export with suffix hint
it: Esporta con indicazione di suffisso
ru: Экспорт с подсказкой суффикса
ta: பின்னொட்டு குறிப்புடன் ஏற்றுமதி
uk: Експорт із підказкою суфікса
zh_tw: 匯出時加上單位提示

source: Display a unit hint suffix for exported variables. Works with numeric types, such as floats or vectors:
it: Visualizza un suffisso di unità per le variabili esportate. Funziona con tipi numerici, come float o vettori:
ru: Отображает суффикс единицы измерения для экспортируемых переменных. Работает с числовыми типами, такими как числа с плавающей точкой или векторы:
ta: ஏற்றுமதி செய்யப்பட்ட மாறிகளுக்கு ஒரு யூனிட் குறிப்பு பின்னொட்டைக் காண்பி. மிதவைகள் அல்லது திசையன்கள் போன்ற எண் வகைகளுடன் செயல்படுகிறது:
uk: Відображення суфікса підказки одиниці для експортованих змінних. Працює з числовими типами, такими як числа з плаваючою точкою або вектори:
zh_tw: 為匯出的變數顯示單位提示。適用於數值型別，如浮點數或向量：

source: In the above example, ``\u00b2`` is used to write the "squared" character (``²``).
it: Nell'esempio sopra, ``\u00b2`` è utilizzato per scrivere il carattere "al quadrato" (``²``).
ru: В приведенном выше примере ``\u00b2`` используется для записи символа "в кубе" (``²``).
ta: மேலே உள்ள எடுத்துக்காட்டில், `` \ u00b2`` "ச்கொயர்" தன்மையை (`` ²``) எழுதப் பயன்படுகிறது.
uk: У наведеному вище прикладі ``\u00b2`` використовується для запису символу «в квадраті» (``²``).
zh_tw: 在上述範例中，``\u00b2`` 用來顯示「平方」符號（``²``）。

source: Colors
ga: Dathanna
it: Colori
ru: Цвета
ta: நிறங்கள்
uk: Кольори
zh_cn: 颜色
zh_tw: 顏色

source: Regular color given as red-green-blue-alpha value.
ga: Dath rialta a thugtar mar luach dearg-glas-gorm-alfa.
it: Colore regolare fornito come valore rosso-verde-blu-alfa.
ru: Обычный цвет задается как значение красный-зеленый-синий-альфа.
ta: சிவப்பு-பச்சை-நீல-ஆல்பா மதிப்பாக வழக்கமான வண்ணம் கொடுக்கப்பட்டுள்ளது.
uk: Звичайний колір у вигляді червоно-зелено-синього альфа-значення.
zh_cn: 使用红、绿、蓝、Alpha 值指定普通颜色。
zh_tw: 以紅、綠、藍、Alpha 值指定的標準顏色。

source: Color given as red-green-blue value (alpha will always be 1).
ga: Dath a thugtar mar luach dearg-glas-gorm (beidh alfa 1 i gcónaí).
it: Colore fornito come valore rosso-verde-blu (alfa sarà sempre 1).
ru: Цвет задается как значение красного-зеленого-синего (альфа всегда будет равна 1).
ta: சிவப்பு-பச்சை-நீல மதிப்பாக வழங்கப்படும் வண்ணம் (ஆல்பா எப்போதும் 1 ஆக இருக்கும்).
uk: Колір, поданий як значення червоно-зелено-синього (альфа завжди буде 1).
zh_cn: 使用红、绿、蓝值指定颜色（此时Alpha 始终为 1）。
zh_tw: 以紅、綠、藍值指定顏色（Alpha 固定為 1）。

source: Nodes
ga: Nóid
it: Nodi
ko: 노드
ru: Узлы
ta: முனைகள்
uk: Вузли
zh_cn: 节点
zh_tw: 節點

source: Since Godot 4.0, nodes can be directly exported without having to use NodePaths.
ga: Ós rud é Godot 4.0, is féidir nóid a onnmhairiú go díreach gan NodePaths a úsáid.
it: A partire da Godot 4.0, è possibile esportare i nodi direttamente senza dover utilizzare NodePath.
ru: Начиная с Godot 4.0 узлы можно экспортировать напрямую, без использования NodePaths.
zh_tw: 自 Godot 4.0 起，節點可以直接匯出，無需再用 NodePath。

source: A specific type of node can also be directly exported. The list of nodes shown after pressing "Assign" in the inspector is filtered to the specified type, and only a correct node can be assigned.
ga: Is féidir cineál sonrach nód a onnmhairiú go díreach freisin. Déantar an liosta nóid a thaispeántar tar éis "Sannadh" a bhrú sa chigire a scagadh chuig an gcineál sonraithe, agus ní féidir ach nód ceart a shannadh.
it: È anche possibile esportare direttamente un tipo specifico di nodo. L'elenco dei nodi visualizzato dopo aver premuto "Assegna" nell'ispettore è filtrato in base al tipo specificato e solo un nodo corretto può essere assegnato.
ru: Также можно напрямую экспортировать определённый тип узла. Список узлов, отображаемый после нажатия кнопки "Assign" в инспекторе, фильтруется по указанному типу, и назначить можно только нужный узел.
ta: ஒரு குறிப்பிட்ட வகை முனையையும் நேரடியாக ஏற்றுமதி செய்யலாம். இன்ச்பெக்டரில் "ஒதுக்கு" அழுத்திய பின் காட்டப்பட்டுள்ள முனைகளின் பட்டியல் குறிப்பிட்ட வகைக்கு வடிகட்டப்படுகிறது, மேலும் சரியான முனையை மட்டுமே ஒதுக்க முடியும்.
uk: Певний тип вузла також можна безпосередньо експортувати. Список вузлів, який відображається після натискання «Призначити» в інспекторі, фільтрується за вказаним типом, і можна призначити лише правильний вузол.
zh_cn: 还可以直接导出特定类型的节点。在检查器中按“赋值”后显示的节点列表会过滤为指定的类型，并且只有正确的节点才能被赋值。
zh_tw: 也可以直接匯出特定型別的節點。在屬性檢視器按下「指派」後，顯示的節點列表會依指定型別過濾，只能指派符合型別的節點。

source: Custom node classes can also be exported directly. The filtering behavior depends on whether the custom class is a :ref:`global class <doc_c_sharp_global_classes>`.
ga: Is féidir ranganna nód saincheaptha a onnmhairiú go díreach freisin. Braitheann an t-iompar scagtha ar cé acu an bhfuil an rang saincheaptha ina :ref:`rang domhanda <doc_c_sharp_global_classes>`.
it: È possibile esportare le classi di nodi personalizzate direttamente. Il comportamento del filtro dipende dal fatto che la classe personalizzata sia una :ref:`classe globale <doc_c_sharp_global_classes>`.
ru: Пользовательские классы узлов также можно экспортировать напрямую. Поведение фильтрации зависит от того, является ли пользовательский класс :ref:`global class <doc_c_sharp_global_classes>`.
ta: தனிப்பயன் முனை வகுப்புகளையும் நேரடியாக ஏற்றுமதி செய்யலாம். வடிகட்டுதல் நடத்தை தனிப்பயன் வகுப்பு ஒரு: ref: `உலகளாவிய வகுப்பு <doc_c_sharp_global_classes>`.
uk: Спеціальні класи вузлів також можна експортувати безпосередньо. Поведінка фільтрації залежить від того, чи є власний клас :ref:`global class <doc_c_sharp_global_classes>`.
zh_tw: 自訂節點類別也能直接匯出。過濾行為取決於自訂類別是否為 :ref:`全域類別 <doc_c_sharp_global_classes>`。

source: Exporting NodePaths like in Godot 3.x is still possible, in case you need it:
ga: Is féidir NodePaths a onnmhairiú mar atá i Godot 3.x fós, i gcás go dteastaíonn sé uait:
it: È ancora possibile esportare i NodePath come in Godot 3.x, nel caso in cui sia necessario:
ru: Экспорт NodePaths, как в Godot 3.x, по-прежнему возможен, если он вам нужен:
ta: கோடோட் 3.x இல் உள்ள நோட்பாத்துகளை ஏற்றுமதி செய்வது இன்னும் சாத்தியமானது, உங்களுக்கு தேவைப்பட்டால்:
uk: Експорт NodePaths, як у Godot 3.x, все ще можливий, якщо вам це потрібно:
zh_cn: 如有需要，仍可以像 Godot 3.x 中那样导出 NodePath：
zh_tw: 如有需要，仍可如 Godot 3.x 一樣匯出 NodePath：

source: Resources
ga: Acmhainní
it: Risorse
ko: 리소스
ru: Ресурсы
ta: வளங்கள்
uk: Ресурси
zh_cn: 资源
zh_tw: 資源

source: In the Inspector, you can then drag and drop a resource file from the FileSystem dock into the variable slot.
ga: Sa Chigire, is féidir leat comhad acmhainne a tharraingt agus a scaoileadh ó dhuga an Chórais Comhad isteach sa sliotán athraitheach.
it: Nell'Ispettore, sarà quindi possibile trascinare e rilasciare un file di risorse dal pannello del FileSystem nello slot della variabile.
ru: Затем в Инспекторе можно перетащить файл ресурса из дока FileSystem в слот переменной.
ta: இன்ச்பெக்டரில், நீங்கள் கோப்பு முறைமை கப்பல்துறையிலிருந்து ஒரு வள கோப்பை மாறி ச்லாட்டுக்கு இழுத்து விடலாம்.
uk: Потім в інспекторі ви можете перетягнути файл ресурсу з док-станції FileSystem у слот для змінних.
zh_cn: 在检查器里，可以将资源文件从文件系统面板中拖放到导出变量所对应的槽位中。
zh_tw: 在屬性編輯器中，可以將資源檔從檔案總管拖拉到變數欄位。

source: Opening the inspector dropdown may result in an extremely long list of possible classes to create, however. Therefore, if you specify a type derived from Resource such as:
ga: Má osclaítear an cigire anuas, d'fhéadfadh liosta an-fhada de ranganna féideartha a chruthú, áfach. Dá bhrí sin, má shonraíonn tú cineál a dhíorthaítear ó Acmhainn, mar shampla:
it: Tuttavia, l'apertura del menu a discesa dell'ispettore potrebbe risultare in un elenco estremamente lungo di possibili classi da creare. Pertanto, se si specifica un tipo derivato da Resource come:
ru: Однако при открытии раскрывающегося списка инспектора может появиться очень длинный список возможных классов для создания. Поэтому, если указать тип, производный от Resource, например:
ta: இருப்பினும், இன்ச்பெக்டர் கீழ்தோன்றலைத் திறப்பது சாத்தியமான வகுப்புகளின் மிக நீண்ட பட்டியலை உருவாக்கக்கூடும். எனவே, போன்ற வளத்திலிருந்து பெறப்பட்ட ஒரு வகையை நீங்கள் குறிப்பிட்டால்:
uk: Однак відкриття спадного меню інспектора може призвести до надзвичайно довгого списку можливих класів для створення. Таким чином, якщо ви вкажете тип, похідний від ресурсу, наприклад:
zh_cn: 展开检查器下拉菜单可能导致一个极长的可能创建的类别列表。因此，如果你指定从 Resource 派生的类型的话：
zh_tw: 不過，展開屬性檢視器下拉選單時，可能會顯示極長的類別清單。因此，若指定 Resource 的衍生型別，例如：

source: The drop-down menu will be limited to AnimationNode and all its derived classes. Custom resource classes can also be used, see :ref:`doc_c_sharp_global_classes`.
it: Il menu a discesa sarà limitato ad AnimationNode e a tutte le sue classi derivate. È possibile utilizzare anche le classi di risorse personalizzate, consultare :ref:`doc_c_sharp_global_classes`.
ru: В раскрывающемся меню будут доступны только AnimationNode и все его производные классы. Также можно использовать пользовательские классы ресурсов, см. :ref:`doc_c_sharp_global_classes`.
ta: கீழ்தோன்றும் பட்டியல் அனிமேசன்நோட் மற்றும் அதன் பெறப்பட்ட அனைத்து வகுப்புகளுக்கும் மட்டுப்படுத்தப்படும். தனிப்பயன் வள வகுப்புகளையும் பயன்படுத்தலாம், காண்க: குறிப்பு: `doc_c_sharp_global_classes`.
uk: Випадаюче меню буде обмежено AnimationNode та всіма похідними від нього класами. Також можна використовувати спеціальні класи ресурсів, див. :ref:`doc_c_sharp_global_classes`.
zh_tw: 下拉選單會只顯示 AnimationNode 及其所有衍生類別。也可使用自訂資源類別，詳見 :ref:`doc_c_sharp_global_classes`。

source: It must be noted that even if the script is not being run while in the editor, the exported properties are still editable. This can be used in conjunction with a :ref:`script in "tool" mode <doc_gdscript_tool_mode>`.
ga: Ní mór a thabhairt faoi deara, fiú mura bhfuil an script á rith agus tú san eagarthóir, is féidir na hairíonna easpórtáilte a chur in eagar fós. Is féidir é seo a úsáid in éineacht le :ref:`script sa mhód "uirlis" <doc_gdscript_tool_mode>`.
it: È importante notare che anche se lo script non viene eseguito nell'editor, le proprietà esportate sono comunque modificabili. Ciò può essere utilizzato in combinazione con uno :ref:`script in modalità "strumento" (tool) <doc_gdscript_tool_mode>`.
ko: 편집기에서 스크립트가 실행되지 않더라도 내보낸 속성은 계속 편집할 수 있습니다. 속성은 :ref:`"툴" 모드 <doc_gdscript_tool_mode>`\ 의 스크립트와 함께 사용할 수 있습니다.
ru: Следует отметить, что даже если во время работы в редакторе скрипт не выполняется, экспортируемые свойства все равно можно редактировать. Это можно использовать в сочетании с :ref:`режимом "инструмента": <doc_gdscript_tool_mode>`.
ta: எடிட்டரில் இருக்கும்போது ச்கிரிப்ட் இயக்கப்படாவிட்டாலும், ஏற்றுமதி செய்யப்பட்ட பண்புகள் இன்னும் திருத்தக்கூடியவை என்பதை கவனத்தில் கொள்ள வேண்டும். இது A: ref: `ச்கிரிப்ட்" கருவி "பயன்முறையில் <doc_gdscript_tool_mode>` உடன் இணைந்து பயன்படுத்தப்படலாம்.
uk: Слід зазначити, що навіть якщо скрипт не запущений в редакторі, експортовані властивості можна редагувати. Це може бути використано спільно зі :ref:`скриптом в режимі "інструмент" <doc_gdscript_tool_mode>`.
zh_cn: 必须注意：即使在在编辑器模式中未运行脚本，导出的属性仍可编辑。这一点可以与 :ref:`使用工具模式的脚本 <doc_gdscript_tool_mode>` 配合使用。
zh_tw: 請注意，即使腳本在編輯器中未執行，匯出屬性仍可編輯。這可以搭配 :ref:`「tool」模式腳本 <doc_gdscript_tool_mode>` 使用。

source: Exporting bit flags
ga: Bratacha giotán á n-easpórtáil
it: Esportare bit flag
ko: 비트 플래그(bit flags) 내보내기
ru: Экспорт битовых флагов
ta: பிட் கொடிகளை ஏற்றுமதி செய்கிறது
uk: Експорт бітових прапорців
zh_cn: 导出位标记
zh_tw: 匯出位元旗標
