Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_basics.po
Languages: ga, it, ja, pl, ru, ta, uk, zh_tw

source: C# basics
ga: Buneilimintí C #
it: Le basi di C#
ja: C# の基本
pl: podstawowy C#
ru: Основы C#
ta: சி# அடிப்படைகள்
uk: Основи C#
zh_tw: C# 基礎

source: Introduction
ga: Réamhrá
it: Introduzione
ja: はじめに
pl: Wprowadzenie
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_tw: 前言

source: This page provides a brief introduction to C#, both what it is and how to use it in Godot. Afterwards, you may want to look at :ref:`how to use specific features <doc_c_sharp_features>`, read about the :ref:`differences between the C# and the GDScript API <doc_c_sharp_differences>`, and (re)visit the :ref:`Scripting section <doc_scripting>` of the step-by-step tutorial.
ga: Tugann an leathanach seo réamhrá gairid ar C#, cad é atá ann agus conas é a úsáid in Godot. Ina dhiaidh sin, b'fhéidir gur mhaith leat breathnú ar :ref:`conas gnéithe ar leith a úsáid <doc_c_sharp_features>`, léigh faoi na :ref:`difríochtaí idir an C# agus an GDScript API <doc_c_sharp_differences>`, agus (ath)tabhair cuairt ar :ref :`Rannóg scriptithe <doc_scripting>` den rang teagaisc céim ar chéim.
it: Questa pagina fornisce una breve introduzione a C#, sia per quanto riguarda la sua natura sia per come utilizzarlo in Godot. In seguito, potresti voler dare un'occhiata a :ref:`come utilizzare funzionalità specifiche <doc_c_sharp_features>`, leggere le :ref:`differenze tra l'API di C# e di GDScript <doc_c_sharp_differences>` e (ri)vedere la :ref:`sezione scripting <doc_scripting>` del tutorial passo per passo.
ja: このページでは、C# の概要と、Godot での使用方法について簡単に説明します。その後 :ref:`特定の機能の使用方法 <doc_c_sharp_features>` を参照したり、 :ref:`C# と GDScript API の違い <doc_c_sharp_differences>` について読んだり、ステップバイステップのチュートリアルの :ref:`スクリプト セクション <doc_scripting>` を (再度) 参照したりすることをお勧めします。
ru: Эта страница содержит краткое введение в C# — что это такое и как использовать его в Godot. После прочтения вы можете изучить :ref:`как использовать определённые возможности<doc_c_sharp_features>`, прочитать о :ref:`различиях между C# и GDScript API<doc_c_sharp_differences>` и (пере)посетить раздел :ref:`Скриптинг<doc_scripting>` в пошаговом руководстве.
ta: இந்த பக்கம் சி#க்கு ஒரு சுருக்கமான அறிமுகத்தை வழங்குகிறது, அது என்ன, அதை கோடோட்டில் எவ்வாறு பயன்படுத்துவது. பின்னர், நீங்கள் பார்க்க விரும்பலாம்: ref: `குறிப்பிட்ட அம்சங்களை எவ்வாறு பயன்படுத்துவது <doc_c_sharp_features>`, பற்றி படியுங்கள்: குறிப்பு: `சி# மற்றும் சி.டி.எச்ச்கிரிப்ட் பநிஇ .
uk: Ця сторінка містить короткий вступ до C#, як це таке, так і як його використовувати в Godot. Після цього ви можете переглянути :ref:`how to use specific features <doc_c_sharp_features>`, читати про :ref:`differences between the C# and the GDScript API <doc_c_sharp_differences>`, і (знову) відвідайте :ref:`Scripting section <doc_scripting>` покрокового посібника.
zh_tw: 本頁簡要介紹 C# 以及如何在 Godot 中使用它。之後，建議你可以參考 :ref:`如何使用特定功能 <doc_c_sharp_features>`、閱讀 :ref:`C# 與 GDScript API 的差異 <doc_c_sharp_differences>`，或者（重新）瀏覽按部就班教學的 :ref:`腳本區段 <doc_scripting>`。

source: C# is a high-level programming language developed by Microsoft. In Godot, it is implemented with .NET 8.0.
it: C# è un linguaggio di programmazione di alto livello sviluppato da Microsoft. In Godot, è implementato con .NET 8.0.
ta: சி# என்பது மைக்ரோசாப்ட் உருவாக்கிய உயர் மட்ட நிரலாக்க மொழியாகும். கோடோட்டில், இது .NET 8.0 உடன் செயல்படுத்தப்படுகிறது.
uk: C# — мова програмування високого рівня, розроблена Microsoft. У Godot це реалізовано за допомогою .NET 8.0.
zh_tw: C# 是由 Microsoft 開發的高階程式語言。在 Godot 中則是以 .NET 8.0 為基礎實作。

source: Projects written in C# using Godot 4 currently cannot be exported to the web platform. To use C# on the web platform, consider Godot 3 instead. Android and iOS platform support is available as of Godot 4.2, but is experimental and :ref:`some limitations apply <doc_c_sharp_platforms>`.
ga: Ní féidir tionscadail atá scríofa in C# a úsáideann Godot 4 a easpórtáil chuig an ardán gréasáin faoi láthair. Chun C# a úsáid ar an ardán gréasáin, smaoinigh ar Godot 3 ina ionad sin. Tá tacaíocht ardán Android agus iOS ar fáil ó Godot 4.2, ach tá sé turgnamhach agus :ref: `tá roinnt teorainneacha i bhfeidhm <doc_c_sharp_platforms>`.
it: I progetti scritti in C# utilizzando Godot 4 al momento non possono essere esportati sulla piattaforma web. Per utilizzare C# sulla piattaforma web, si consiglia di utilizzare Godot 3. Il supporto per le piattaforme Android e iOS è disponibile a partire da Godot 4.2, ma è sperimentale e :ref:`si applicano alcune limitazioni <doc_c_sharp_platforms>`.
ja: Godot 4 を使用して C# で記述されたプロジェクトは、現在 Web プラットフォームにエクスポートできません。Web プラットフォームで C# を使用する場合は、代わりに Godot 3 の使用を検討してください。Android および iOS プラットフォームのサポートは Godot 4.2 以降で利用可能ですが、実験段階であり :ref:`いくつかの制限が適用されます <doc_c_sharp_platforms>` 。
ru: Проекты, написанные на C# с использованием Godot 4, в настоящее время не могут быть экспортированы на веб-платформу. Для использования C# на веб-платформе рассмотрите Godot 3. Поддержка платформ Android и iOS доступна, начиная с Godot 4.2, но является экспериментальной и имеет некоторые ограничения :ref:`some limitations apply <doc_c_sharp_platforms>`.
ta: கோடோட் 4 ஐப் பயன்படுத்தி சி# இல் எழுதப்பட்ட திட்டங்களை தற்போது வலை தளத்திற்கு ஏற்றுமதி செய்ய முடியாது. வலை தளத்தில் சி# ஐப் பயன்படுத்த, அதற்கு பதிலாக கோடோட் 3 ஐக் கவனியுங்கள். ஆண்ட்ராய்டு மற்றும் ஐஇமு இயங்குதள உதவி கோடோட் 4.2 இன் படி கிடைக்கிறது, ஆனால் இது சோதனை மற்றும்: ref: `சில வரம்புகள் <doc_c_sharp_platforms>` பொருந்தும்.
uk: Проекти, написані на C# з використанням Godot 4, наразі не можна експортувати на веб-платформу. Щоб використовувати C# на веб-платформі, розгляньте Godot 3. Підтримка платформ Android та iOS доступна з Godot 4.2, але є експериментальною та :ref:`some limitations apply <doc_c_sharp_platforms>`.
zh_tw: 目前使用 Godot 4 撰寫的 C# 專案尚無法匯出到網頁平台。如果你需要在網頁平台用 C#，請考慮改用 Godot 3。自 Godot 4.2 起已可匯出至 Android 與 iOS，但功能仍屬實驗性，且 :ref:`有些限制 <doc_c_sharp_platforms>`。

source: This is **not** a full-scale tutorial on the C# language as a whole. If you aren't already familiar with its syntax or features, see the `Microsoft C# guide <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ or look for a suitable introduction elsewhere.
ga: **Ní** teagaisc lánscála é seo ar an teanga C# ina hiomláine. Mura bhfuil tú eolach ar a chomhréir nó a ghnéithe cheana féin, féach ar an `Microsoft C# guide <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ nó lorg réamhrá oiriúnach áit eile.
it: Questo **non** è un tutorial completo sul linguaggio C# nel suo complesso. Se non si ha familiarità con la sua sintassi o le sue funzionalità, consultare la `Guida a C# di Microsoft <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ o cercare un'introduzione adeguata altrove.
ja: これはC#言語全体に関する本格的なチュートリアルでは\ **ありません**\ 。まだその構文や機能に慣れていなければ、\ `Microsoft C#ガイド <https://docs.microsoft.com/ja-jp/dotnet/csharp/index>`_\ や他の適切な入門書を参照してください。
pl: To jest **nie** pełny poradnik na temat języka C#. Jeśli nie znasz jeszcze jego składni lub funkcji, zapoznaj się z przewodnikiem `Microsoft C# <https://docs.microsoft.com/en-us/dotnet/csharp/index>` lub poszukaj odpowiedniego wprowadzenia gdzieś indziej.
ru: Это **не** полномасштабное руководство по целому языку C#. Если вы не знакомы с его синтаксисом или возможностями, посмотрите `Microsoft C# руководство <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ или поищите подходящее введение где-нибудь ещё.
ta: இது ** அல்ல ** ஒட்டுமொத்தமாக சி# மொழியில் முழு அளவிலான பயிற்சி. அதன் தொடரியல் அல்லது அம்சங்களை நீங்கள் ஏற்கனவே அறிந்திருக்கவில்லை என்றால், `மைக்ரோசாஃப்ட் சி# வழிகாட்டி <https://docs.microsoft.com/en-us/dotnet/csharp/index> _ _ அல்லது வேறு இடங்களில் பொருத்தமான அறிமுகத்தைத் தேடுங்கள்.
uk: Це **не** повномасштабний підручник з мови C#. Якщо ви ще не знайомі з її синтаксисом, або можливостями, перегляньте `посібник Microsoft C# <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ або знайдіть відповідний вступ у іншому місці.
zh_tw: 本頁**不是**完整的 C# 語言教學。如果你還不熟悉 C# 的語法與功能，請參考 `Microsoft C# 指南 <https://docs.microsoft.com/zh-tw/dotnet/csharp/index>`_ 或尋找其他合適的入門資源。

source: Prerequisites
ga: Riachtanais
it: Prerequisiti
ja: 前提条件
pl: Wymagania wstępne
ru: Требования
ta: முன்நிபந்தனைகள்
uk: Передумови
zh_tw: 先決條件

source: Godot bundles the parts of .NET needed to run already compiled games. However, Godot does not bundle the tools required to build and compile games, such as MSBuild and the C# compiler. These are included in the .NET SDK, and need to be installed separately.
ga: Cuireann Godot na codanna de .NET a theastaíonn chun cluichí tiomsaithe cheana féin a reáchtáil. Mar sin féin, ní chuireann Godot na huirlisí a theastaíonn chun cluichí a thógáil agus a thiomsú, mar MSBuild agus an tiomsaitheoir C #. Tá siad seo san áireamh san SDK .NET, agus is gá iad a shuiteáil ar leithligh.
it: Godot include le parti di .NET necessarie per eseguire giochi già compilati. Tuttavia, Godot non include gli strumenti necessari per la creazione e la compilazione di giochi, come MSBuild e il compilatore C#. Questi sono inclusi nell'SDK di .NET e devono essere installati separatamente.
ja: Godot には既にコンパイルされたゲームを実行するために必要な .NET の部分がバンドルされています。ただしGodot には、MSBuild や C# コンパイラなど、ゲームのビルドとコンパイルに必要なツールはバンドルされていません。これらは .NET SDK に含まれており、別途インストールする必要があります。
ta: ஏற்கனவே தொகுக்கப்பட்ட விளையாட்டுகளை இயக்கத் தேவையான .net இன் பகுதிகளை கோடோட் தொகுக்கிறது. இருப்பினும், MSBuild மற்றும் சி# கம்பைலர் போன்ற விளையாட்டுகளை உருவாக்க மற்றும் தொகுக்க தேவையான கருவிகளை கோடோட் தொகுக்கவில்லை. இவை .NET SDK இல் சேர்க்கப்பட்டுள்ளன, மேலும் அவை தனித்தனியாக நிறுவப்பட வேண்டும்.
uk: Godot об’єднує частини .NET, необхідні для запуску вже скомпільованих ігор. Однак Godot не містить інструментів, необхідних для створення та компіляції ігор, таких як MSBuild і компілятор C#. Вони входять до .NET SDK і їх потрібно інсталювати окремо.
zh_tw: Godot 已內建執行已編譯遊戲所需的 .NET 元件，但未內建建置與編譯專案所需的工具（如 MSBuild 與 C# 編譯器）。這些工具包含在 .NET SDK 中，需另外安裝。

source: In summary, you must have installed the .NET SDK **and** the .NET-enabled version of Godot.
ga: Go hachomair, ní mór duit an .NET SDK ** agus** an leagan .NET de Godot a bheith suiteáilte agat.
it: In sintesi, è necessario aver installato l'SDK di .NET **e** la versione di Godot abilitata per .NET.
ja: 要約すると、.NET SDK **および** .NET 対応バージョンの Godot をインストールしておく必要があります。
ru: Таким образом, у вас должны быть установлены .NET SDK и версия Godot с поддержкой .NET.
ta: சுருக்கமாக, நீங்கள் .net sdk ** மற்றும் ** கோடோட்டின் நெட்-இயக்கப்பட்ட பதிப்பை நிறுவியிருக்க வேண்டும்.
uk: Підсумовуючи, ви повинні інсталювати .NET SDK **і** версію Godot із підтримкою .NET.
zh_tw: 總結來說，你必須安裝 .NET SDK **以及** 支援 .NET 的 Godot 版本。

source: Download and install the latest stable version of the SDK from the `.NET download page <https://dotnet.microsoft.com/download>`__.
ga: Íoslódáil agus suiteáil an leagan cobhsaí is déanaí den SDK ón leathanach íoslódála `.NET <https://dotnet.microsoft.com/download>`__.
it: Scaricare e installare l'ultima versione stabile dell'SDK dalla `pagina di download .NET <https://dotnet.microsoft.com/download>`__.
ja: `.NET ダウンロードページ <https://dotnet.microsoft.com/download>`__ から SDK の最新の安定バージョンをダウンロードしてインストールします。
ta: `.NET பதிவிறக்கப் பக்கத்திலிருந்து <https://dotnet.microsoft.com/download> __. __.
uk: Завантажте та встановіть останню стабільну версію SDK зі сторінки завантаження `.NET <https://dotnet.microsoft.com/download>`__.
zh_tw: 請到 `.NET 下載頁面 <https://dotnet.microsoft.com/download>`__ 下載並安裝最新版 SDK。

source: Be sure to install the 64-bit version of the SDK(s) if you are using the 64-bit version of Godot.
ga: Bí cinnte an leagan 64-giotán de na SDK (í) a shuiteáil má tá an leagan 64-giotán de Godot á úsáid agat.
it: Assicurarsi di installare la versione a 64 bit degli SDK se si sta utilizzando la versione a 64 bit di Godot.
ja: Godot の64ビット バージョンを使用している場合は、必ず SDK の64ビット バージョンをインストールしてください。
ru: Обязательно установите 64-битную версию SDK, если вы используете 64-битную версию Godot.
ta: நீங்கள் கோடோட்டின் 64-பிட் பதிப்பைப் பயன்படுத்துகிறீர்கள் என்றால், SDK (கள்) இன் 64-பிட் பதிப்பை நிறுவ மறக்காதீர்கள்.
uk: Обов’язково встановіть 64-бітну версію SDK, якщо ви використовуєте 64-бітну версію Godot.
zh_tw: 如果你使用的是 64 位元版本的 Godot，請務必安裝 64 位元的 SDK。

source: If you are building Godot from source, make sure to follow the steps to enable .NET support in your build as outlined in the :ref:`doc_compiling_with_dotnet` page.
ga: Má tá Godot á thógáil agat ó fhoinse, déan cinnte na céimeanna a leanúint chun tacaíocht .NET a chumasú i do thógáil mar a leagtar amach sa leathanach:ref: `doc_compiling_with_dotnet`.
it: Se si sta compilando Godot dal codice sorgente, assicurarsi di seguire i passaggi per abilitare il supporto per .NET nella propria build, come descritto nella pagina :ref:`doc_compiling_with_dotnet`.
ja: Godot をソースからビルドする場合は、 :ref:`doc_compiling_with_dotnet` ページで説明されている手順に従って、ビルドで .NET サポートを有効にしてください。
ru: Если вы собираете Godot из исходного кода, обязательно выполните шаги по включению поддержки .NET в вашей сборке, как описано на странице :ref:`doc_compiling_with_dotnet`.
ta: நீங்கள் மூலத்திலிருந்து கோடோட்டை உருவாக்குகிறீர்கள் என்றால், உங்கள் கட்டமைப்பில் .NET ஆதரவை இயக்குவதற்கான படிகளைப் பின்பற்றுவதை உறுதிப்படுத்திக் கொள்ளுங்கள்: rew: `doc_compiliging_with_dotnet` பக்கத்தில்.
uk: Якщо ви створюєте Godot із вихідного коду, обов’язково виконайте кроки, щоб увімкнути підтримку .NET у своїй збірці, як описано на сторінці :ref:`doc_compiling_with_dotnet`.
zh_tw: 若你是從原始碼自行建置 Godot，請依照 :ref:`doc_compiling_with_dotnet` 文件中的步驟啟用 .NET 支援。

source: Configuring an external editor
ga: Eagarthóir seachtrach a chumrú
it: Configurare un editor esterno
ja: 外部エディタの設定
pl: Konfiguracja zewnętrznego edytora
ru: Настройка внешнего редактора
ta: வெளிப்புற எடிட்டரை உள்ளமைத்தல்
uk: Налаштування зовнішнього редактора
zh_tw: 設定外部編輯器

source: Visual Studio 2022
ga: Stiúideo Amhairc 2022
ta: விசுவல் ச்டுடியோ 2022

source: Visual Studio Code
ga: Cód Stiúideo Amhairc
ru: Visuаl Studio Code
ta: விசுவல் ச்டுடியோ குறியீடு
uk: Visual Studio або VS Code

source: MonoDevelop
ru: MonоDevelop
ta: மந்திரவாதம்

source: Visual Studio for Mac
ga: Visual Studio do Mac
it: Visual Studio per Mac
ru: Visual Studio для MacOS
ta: மேக்கிற்கான விசுவல் ச்டுடியோ
uk: Visual Studio для Mac

source: JetBrains Rider
ga: Marcach JetBrains
ta: செட் பிரைன்ச் ரைடர்
uk: JetBrains Райдер

source: See the following sections for how to configure an external editor:
ga: Féach na codanna seo a leanas maidir le conas eagarthóir seachtrach a chumrú:
it: Per informazioni su come configurare un editor esterno, consultare le sezioni seguenti:
ja: 外部エディターを構成する方法については、次のセクションを参照してください。
ru: См. cледующие разделы, чтобы узнать, как настроить внешний редактор:
ta: வெளிப்புற எடிட்டரை எவ்வாறு கட்டமைப்பது என்பதற்கான பின்வரும் பிரிவுகளைப் பார்க்கவும்:
uk: Перегляньте наступні розділи, щоб дізнатися, як налаштувати зовнішній редактор:
zh_tw: 有關如何設定外部編輯器，請參考以下說明：

source: After reading the "Prerequisites" section, you can download and install `JetBrains Rider <https://www.jetbrains.com/rider/download>`__.
ga: Tar éis duit an rannán "Réamhriachtanais" a léamh, is féidir leat `JetBrains Rider a íoslódáil agus a shuiteáil <https://www.jetbrains.com/rider/download>`__.
it: Dopo aver letto la sezione "Prerequisiti", scaricare e installare `JetBrains Rider <https://www.jetbrains.com/rider/download>`__.
ja: 「前提条件」セクションを読んだ後、`JetBrains Rider <https://www.jetbrains.com/rider/download>`__ をダウンロードしてインストールできます。
ru: Прочитав раздел «Предварительные требования», вы можете загрузить и установить `JetBrains Rider <https://www.jetbrains.com/rider/download>`__.
ta: "முன்நிபந்தனைகள்" பகுதியைப் படித்த பிறகு, நீங்கள் `செட் பிரைன்ச் ரைடர் <https://www.jetbraines.com/rider/download> __.
uk: Прочитавши розділ "Передумови", ви можете завантажити та встановити `JetBrains Rider <https://www.jetbrains.com/rider/download>`__.
zh_tw: 閱讀完「先決條件」後，即可下載並安裝 `JetBrains Rider <https://www.jetbrains.com/rider/download>`__。

source: In Godot's **Editor → Editor Settings** menu:
ga: I roghchlár Godot **Eagarthóir → Socruithe Eagarthóir**:
it: Nel menu **Editor -> impostazioni dell'editor** di Godot:
ja: Godot の **エディター → エディター設定** メニューで:
pl: Wtyczki edytora **Editor → Editor Settings**:
ru: В меню **Редактор→ Настройки редактора** Godot:
ta: கோடோட்டின் ** எடிட்டர் → எடிட்டர் அமைப்புகள் ** மெனு:
uk: В меню Godot **Редактор → Параметри редактора**:
zh_tw: 在 Godot 的 **編輯器 → 編輯器設定** 選單：

source: Set **Dotnet** -> **Editor** -> **External Editor** to **JetBrains Rider**.
ga: Socraigh **Dotnet** -> **Eagarthóir** -> **Eagarthóir Seachtrach** chuig **JetBrains Rider**.
it: Impostare **Dotnet** -> **Editor** -> **Editor esterno** su **JetBrains Rider**.
ja: **.NET** -> **エディター** -> **External Editor** を **JetBrains Rider** に設定します。
ru: Установите **Dotnet** -> **Editor** -> **External Editor** на **JetBrains Rider**.
ta: அமைக்கவும் ** டாட்நெட் ** -> ** எடிட்டர் ** -> ** வெளிப்புற எடிட்டர் ** ** செட் பிரைன்ச் ரைடர் **.
uk: Установіть **Dotnet** -> **Редактор** -> **Зовнішній редактор** на **JetBrains Rider**.
zh_tw: 將 **Dotnet → Editor → External Editor** 設為 **JetBrains Rider**。

source: In Rider:
ja: Riderでは:
ru: В Rider:
ta: சவாரி:
uk: В Rider:
zh_tw: 於 Rider：

source: Set **MSBuild version** to **.NET Core**.
ga: Socraigh leagan**MSBuild** chuig **.NET Core**.
it: Imposta **MSBuild version** su **.NET Core**.
ja: **MSBuild version** を **.NET Core** に設定します。
ru: Установите **MSBuild version** на **.NET Core**.
ta: ** msBuild பதிப்பை அமைக்கவும் ** பெறுநர் **. நிகர கோர் **.
uk: Встановіть **MSBuild version** на **.NET Core**.
zh_tw: 將 **MSBuild version** 設為 **.NET Core**。

source: If you are using a Rider version below 2024.2, install the **Godot support** plugin. This functionality is now built into Rider.
it: Se si utilizza una versione di Rider precedente alla 2024.2, installare l'estensione **Godot support**. Questa funzionalità è ora integrata in Rider.
ru: Если вы используете Rider версии ниже 2024.2, установите плагин **Godot support**. Эта функция теперь встроена в Rider.
ta: நீங்கள் 2024.2 க்குக் கீழே ஒரு சவாரி பதிப்பைப் பயன்படுத்துகிறீர்கள் என்றால், ** கோடோட் உதவி ** சொருகி நிறுவவும். இந்த செயல்பாடு இப்போது சவாரி செய்யப்படுகிறது.
uk: Якщо ви використовуєте версію Rider нижче 2024.2, установіть плагін **підтримка Godot**. Ця функція тепер вбудована в Rider.
zh_tw: 如果你使用 2024.2 之前版本的 Rider，請另外安裝 **Godot support** 擴充套件。新版 Rider 已內建此功能。

source: After reading the "Prerequisites" section, you can download and install `Visual Studio Code <https://code.visualstudio.com/download>`__ (aka VS Code).
ga: Tar éis duit an rannán "Réamhriachtanais" a léamh, is féidir leat `Cód Stiúideo Amhairc <https://code.visualstudio.com/download>`__ (aka VS Code) a íoslódáil agus a shuiteáil.
it: Dopo aver letto la sezione "Prerequisiti", scaricare e installare `Visual Studio Code <https://code.visualstudio.com/download>`__ (noto anche come VS Code).
ja: 「前提条件」セクションを読んだ後、`Visual Studio Code <https://code.visualstudio.com/download>`__ (別名 VS Code) をダウンロードしてインストールできます。
ru: После прочтения раздела "Предварительные условия" вы можете загрузить и установить ` Visual Studio Code <https://code.visualstudio.com/download>`__ (он же VS Code).
ta: "முன்நிபந்தனைகள்" பகுதியைப் படித்த பிறகு, நீங்கள் `விசுவல் ச்டுடியோ குறியீட்டைக் பதிவிறக்கம் செய்து நிறுவலாம் <https://code.visualstudio.com/download> __ (aka vs குறியீடு).
uk: Прочитавши розділ "Передумови", ви можете завантажити та встановити `Visual Studio Code <https://code.visualstudio.com/download>`__ (він же VS Code).
zh_tw: 閱讀完「先決條件」後，即可下載並安裝 `Visual Studio Code <https://code.visualstudio.com/download>`__ （又稱 VS Code）。

source: Set **Dotnet** -> **Editor** -> **External Editor** to **Visual Studio Code**.
ga: Socraigh **Dotnet** -> **Eagarthóir** -> **Eagarthóir Seachtrach** chuig **Cód Amharc-Stiúideo**.
it: Impostare **Dotnet** -> **Editor** -> **Editor esterno** su **Visual Studio Code**.
ja: **.NET** -> **エディター** -> **External Editor** を **Visual Studio Code** に設定します。
ru: Установите **Dotnet** -> **Editor** -> **External Editor** на **Visual Studio Code**.
ta: அமைக்கவும் ** டாட்நெட் ** -> ** எடிட்டர் ** -> ** வெளிப்புற எடிட்டர் ** ** விசுவல் ச்டுடியோ குறியீடு **.
uk: Установіть для **Dotnet** -> **Редактор** -> **Зовнішній редактор** значення **Visual Studio Code**.
zh_tw: 將 **Dotnet → Editor → External Editor** 設為 **Visual Studio Code**。

source: In Visual Studio Code:
ga: I gCód Visual Studio:
ja: Visual Studio Codeでは:
pl: Visual Studio Code:
ru: В Visual Studio Code:
ta: விசுவல் ச்டுடியோ குறியீட்டில்:
uk: В Visual Studio Code:
zh_tw: 於 Visual Studio Code：

source: Install the `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__ extension.
ga: Suiteáil an síneadh `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__.
it: Installare l'estensione `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__.
ja: `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__ 拡張機能をインストールします。
ru: Установите расширение `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__ .
ta: `C# <https://marketplace.visualstudio.com/items?itemmame=ms-dotnettools.csharp> __ நீட்டிப்பு ஆகியவற்றை நிறுவவும்.
uk: Встановіть розширення `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__.
zh_tw: 安裝 `C# 擴充套件 <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__。

source: To configure a project for debugging, you need a ``tasks.json`` and ``launch.json`` file in the ``.vscode`` folder with the necessary configuration.
ga: Chun tionscadal a chumrú le haghaidh dífhabhtú, teastaíonn comhad ``tasks.json`` agus ``launch.json`` sa fhillteán `.vscode`` leis an gcumraíocht riachtanach.
it: Per configurare un progetto per il debug, è necessario un file ``tasks.json`` e ``launch.json`` nella cartella ``.vscode`` con la configurazione necessaria.
ja: プロジェクトのデバッグ実行を行うには、必要な構成を含む ``.vscode`` フォルダーに ``tasks.json`` ファイルと ``launch.json`` ファイルが必要です。
ru: Чтобы настроить проект для отладки, вам понадобятся файлы ``tasks.json`` и ``launch.json`` в папке ``.vscode`` с необходимой конфигурацией.
ta: பிழைத்திருத்தத்திற்கான ஒரு திட்டத்தை உள்ளமைக்க, தேவையான உள்ளமைவுடன் `` .vscode`` கோப்புறையில் உங்களுக்கு `` டாச்க்ச்.சோன்` மற்றும் `` துவக்க.
uk: Щоб налаштувати проект для налагодження, вам знадобляться файли ``tasks.json`` і ``launch.json`` у папці ``.vscode`` з необхідною конфігурацією.
zh_tw: 若要設定專案除錯，必須在 ``.vscode`` 資料夾內建立 ``tasks.json`` 與 ``launch.json``，並填入必要的設定。

source: Here is an example ``launch.json``:
ga: Seo sampla ``launch.json``:
it: Ecco un ``launch.json`` di esempio:
ja: ``launch.json`` の例を次に示します。
ru: Вот пример ``launch.json``:
ta: இங்கே ஒரு எடுத்துக்காட்டு `` துவக்க. Json``:
uk: Ось приклад ``launch.json``:
zh_tw: 以下為一個 ``launch.json`` 範例：
