Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_basics.po
Languages: ga, it, ja, pl, ru, ta, uk, zh_tw

source: For this launch configuration to work, you need to either setup a GODOT4 environment variable that points to the Godot executable, or replace ``program`` parameter with the path to the Godot executable.
ga: Ionas go n-oibreoidh an chumraíocht seolta seo, ní mór duit athróg timpeallachta GODOT4 a shocrú a chuireann in iúl ar an inúsáidte Godot, nó paraiméadar ``clár` a chur in ionad leis an gcosán chuig an inúsáidte Godot.
it: Affinché questa configurazione di avvio funzioni, è necessario impostare una variabile d'ambiente GODOT4 che punti all'eseguibile Godot oppure sostituire il parametro ``program`` con il percorso all'eseguibile Godot.
ja: この起動構成を機能させるには、Godot 実行可能ファイルを指す GODOT4 環境変数を設定するか、 ``program`` パラメータを Godot 実行可能ファイルへのパスに置き換える必要があります。
ru: Чтобы эта конфигурация запуска работала, вам необходимо либо настроить переменную среды GODOT4, указывающую на исполняемый файл Godot, либо заменить параметр ``program`` на путь к исполняемому файлу Godot.
ta: இந்த வெளியீட்டு உள்ளமைவு வேலை செய்ய, நீங்கள் கோடோட் இயங்கக்கூடிய ஒரு கோடோட் 4 சூழல் மாறியை அமைக்க வேண்டும், அல்லது `` நிரல்`` அளவுருவை கோடோட் இயங்கக்கூடிய பாதையுடன் மாற்ற வேண்டும்.
uk: Щоб ця конфігурація запуску працювала, вам потрібно або налаштувати змінну середовища GODOT4, яка вказує на виконуваний файл Godot, або замінити параметр ``program`` на шлях до виконуваного файлу Godot.
zh_tw: 若要使這個啟動組態生效，你需要設定一個名為 GODOT4 的環境變數指向 Godot 執行檔，或直接將 ``program`` 欄位填入 Godot 執行檔的路徑。

source: Here is an example ``tasks.json``:
ga: Seo sampla ``tasks.json``:
it: Ecco un ``tasks.json`` di esempio:
ja: ``tasks.json`` の例を次に示します。
ru: Вот пример ``tasks.json``:
ta: இங்கே ஒரு எடுத்துக்காட்டு `` டாச்க்ச்.சோன்``:
uk: Ось приклад ``tasks.json``:
zh_tw: 以下為一個 ``tasks.json`` 範例：

source: Now, when you start the debugger in Visual Studio Code, your Godot project will run.
ga: Anois, nuair a thosaíonn tú an dífhabhtaitheoir i Visual Studio Code, reáchtálfaidh do thionscadal Godot.
it: Ora, quando il debugger viene avviato in Visual Studio Code, il progetto Godot verrà eseguito.
ja: これで、Visual Studio Code でデバッグを開始すると、Godot プロジェクトが実行されます。
ru: Теперь при запуске отладчика в Visual Studio Code ваш проект Godot будет запущен.
ta: இப்போது, நீங்கள் விசுவல் ச்டுடியோ குறியீட்டில் பிழைத்திருத்தத்தைத் தொடங்கும்போது, உங்கள் கோடோட் திட்டம் இயங்கும்.
uk: Тепер, коли ви запускаєте налагоджувач у Visual Studio Code, ваш проект Godot запускатиметься.
zh_tw: 現在，當你在 Visual Studio Code 啟動除錯器時，你的 Godot 專案就會執行。

source: Visual Studio (Windows only)
ga: Visual Studio (Windows amháin)
it: Visual Studio (solo per Windows)
ja: Visual Studio (Windows のみ)
ru: Visual Studio (Только windows)
ta: விசுவல் ச்டுடியோ (விண்டோச் மட்டும்)
uk: Visual Studio (тільки Windows)
zh_tw: Visual Studio（僅限 Windows）

source: Download and install the latest version of `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__. Visual Studio will include the required SDKs if you have the correct workloads selected, so you don't need to manually install the things listed in the "Prerequisites" section.
ga: Íoslódáil agus suiteáil an leagan is déanaí de `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__. Áireoidh Visual Studio na SDKanna riachtanacha má tá na hualaí oibre cearta roghnaithe agat, mar sin ní gá duit na rudaí atá liostaithe sa rannán "Réamhriachtanais" a shuiteáil de láimh.
it: Scaricare e installare la versione più recente di `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__. Visual Studio includerà gli SDK necessari se sono stati selezionati i workload corretti, quindi non è necessario installare manualmente gli elementi elencati nella sezione "Prerequisiti".
ja: 最新バージョンの `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__ をダウンロードしてインストールします。正しいワークロードを選択した場合、Visual Studio には必要な SDK が含まれるため、「前提条件」セクションに記載されているものを手動でインストールする必要はありません。
ru: Загрузите и установите последнюю версию Visual Studio <https://visualstudio.microsoft.com/downloads/>`__. Visual Studio будет включать необходимые SDK, если у вас выбраны правильные рабочие нагрузки, поэтому вам не нужно вручную устанавливать вещи, перечисленные в разделе "Предварительные условия".
ta: `விசுவல் ச்டுடியோ <https://visualstudio.microsoft.com/downloads/> __ __ இன் அண்மைக் கால பதிப்பைப் பதிவிறக்கி நிறுவவும். உங்களிடம் சரியான பணிச்சுமைகள் தேர்ந்தெடுக்கப்பட்டிருந்தால் விசுவல் ச்டுடியோவில் தேவையான SDK கள் அடங்கும், எனவே "முன்நிபந்தனைகள்" பிரிவில் பட்டியலிடப்பட்டுள்ள விசயங்களை நீங்கள் கைமுறையாக நிறுவ தேவையில்லை.
uk: Завантажте та встановіть останню версію `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__. Visual Studio включатиме необхідні пакети SDK, якщо ви вибрали правильні робочі навантаження, тому вам не потрібно вручну встановлювати речі, перелічені в розділі "Передумови".
zh_tw: 下載並安裝最新版 `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__。只要安裝時選對工作負載，Visual Studio 會自動包含所需 SDK，因此不需要額外手動安裝「先決條件」中的內容。

source: While installing Visual Studio, select this workload:
ga: Agus Visual Studio á shuiteáil agat, roghnaigh an t-ualach oibre seo:
it: Durante l'installazione di Visual Studio, selezionare questo workload:
ja: Visual Studio のインストール時に、次のワークロードを選択します。
ru: При установке Visual Studio выберите следующую рабочую нагрузку:
ta: விசுவல் ச்டுடியோவை நிறுவும் போது, இந்த பணிச்சுமையைத் தேர்ந்தெடுக்கவும்:
uk: Під час інсталяції Visual Studio виберіть таке робоче навантаження:
zh_tw: 安裝 Visual Studio 時，請選擇以下工作負載：

source: .NET desktop development
ga: Forbairt deisce.NET
it: Sviluppo desktop .NET
ja: .NET デスクトップ開発
ru: Разработка настольных приложений .NET
ta: நெட் டெச்க்டாப் மேம்பாடு
uk: Розробка робочого столу .NET
zh_tw: .NET 桌面開發

source: Set **Dotnet** -> **Editor** -> **External Editor** to **Visual Studio**.
ga: Socraigh **Dotnet** -> **Eagarthóir** -> **Eagarthóir Seachtrach** chuig **AmharcStiúideo**.
it: Impostare **Dotnet** -> **Editor** -> **Editor esterno** su **Visual Studio**.
ja: **.NET** -> **エディター** -> **External Editor** を **Visual Studio** に設定します。
ru: Установите **Dotnet** -> **Editor** -> **External Editor** на **Visual Studio**.
ta: ** டாட்நெட் ** -> ** எடிட்டர் ** -> ** வெளிப்புற எடிட்டர் ** ** விசுவல் ச்டுடியோவுக்கு ** அமைக்கவும்.
uk: Установіть **Dotnet** -> **Редактор** -> **Зовнішній редактор** на **Visual Studio**.
zh_tw: 將 **Dotnet → Editor → External Editor** 設為 **Visual Studio**。

source: If you see an error like "Unable to find package Godot.NET.Sdk", your NuGet configuration may be incorrect and need to be fixed.
ga: Má fheiceann tú earráid mar “Ní féidir teacht ar phacáiste Godot.net.sdk”, d'fhéadfadh go mbeadh do chumraíocht NuGet mícheart agus caithfear é a shocrú.
it: Se appare un errore del tipo "Unable to find package Godot.NET.Sdk", la configurazione di NuGet potrebbe essere errata e deve essere corretta.
ja: 「パッケージ Godot.NET.Sdk が見つかりません」のようなエラーが表示される場合は、NuGet の構成が正しくない可能性があり、修正する必要があります。
ru: Если вы видите ошибку типа "Не удалось найти пакет Godot.NET.Sdk", возможно, ваша конфигурация NuGet неверна и ее необходимо исправить.
ta: "தொகுப்பு godot.net.sdk" ஐக் கண்டுபிடிக்க முடியவில்லை "போன்ற பிழையை நீங்கள் கண்டால், உங்கள் நுசெட் உள்ளமைவு தவறாக இருக்கலாம் மற்றும் சரிசெய்யப்பட வேண்டும்.
uk: Якщо ви бачите помилку на зразок «Не вдається знайти пакет Godot.NET.Sdk», можливо, ваша конфігурація NuGet неправильна та її потрібно виправити.
zh_tw: 如果看到「Unable to find package Godot.NET.Sdk」這類錯誤，表示 NuGet 設定有誤，需要修正。

source: A simple way to fix the NuGet configuration file is to regenerate it. In a file explorer window, go to ``%AppData%\NuGet``. Rename or delete the ``NuGet.Config`` file. When you build your Godot project again, the file will be automatically created with default values.
ga: Bealach simplí chun an comhad cumraíochta NuGet a shocrú is ea é a athghiniúint. I bhfuinneog taiscéalaí comhad, téigh chuig ``%AppData%\ NuGet``. Athainmnigh nó scrios an comhad ``Nuget.config``. Nuair a thógann tú do tionscadal Godot arís, cruthófar an comhad go huathoibríoch le luachanna réamhshocraithe.
it: Un modo semplice per correggere il file di configurazione di NuGet è rigenerarlo. In una finestra di Esplora file, andare a ``%AppData%\NuGet``. Rinominare o eliminare il file ``NuGet.Config``. Quando il progetto Godot viene compilato, il file verrà creato automaticamente con i valori predefiniti.
ja: NuGet 構成ファイルを修正する簡単な方法は、それを再生成することです。ファイルエクスプローラーウィンドウで、``%AppData%\NuGet`` に移動します。``NuGet.Config`` ファイルの名前を変更するか削除します。Godot プロジェクトを再度ビルドすると、ファイルはデフォルト値で自動的に作成されます。
ru: Простой способ исправить файл конфигурации NuGet - его восстановление. На вашем проводнике, перейдите к директорию ``%AppData%\NuGet``. Переименуйте или удалите файл `NuGet.Config``. При повторной сборки проекта Godot, файл будет автоматически создан с стардартными значениями.
ta: நுசெட் உள்ளமைவு கோப்பை சரிசெய்ய ஒரு எளிய வழி அதை மீண்டும் உருவாக்குவதாகும். ஒரு கோப்பு எக்ச்ப்ளோரர் சாளரத்தில், ``%appdata%\ nuget`` க்குச் செல்லவும். `` Nuget.config`` கோப்பை மறுபெயரிடவும் அல்லது நீக்கவும். உங்கள் கோடோட் திட்டத்தை மீண்டும் உருவாக்கும்போது, கோப்பு தானாகவே இயல்புநிலை மதிப்புகளுடன் உருவாக்கப்படும்.
uk: Простий спосіб виправити файл конфігурації NuGet — це повторно створити його. У вікні провідника файлів перейдіть до ``%AppData%\NuGet``. Перейменуйте або видаліть файл ``NuGet.Config``. Коли ви знову створите свій проект Godot, файл буде автоматично створено зі значеннями за замовчуванням.
zh_tw: 解決 NuGet 設定檔的方法之一是重新產生它。在檔案總管中前往 ``%AppData%\NuGet``，將 ``NuGet.Config`` 檔案重新命名或刪除。重新建置 Godot 專案時，該檔案會自動以預設值重建。

source: To debug your C# scripts using Visual Studio, open the .sln file that is generated after opening the first C# script in the editor. In the **Debug** menu, go to the **Debug Properties** menu item for your project. Click the **Create a new profile** button and choose **Executable**. In the **Executable** field, browse to the path of the C# version of the Godot editor, or type ``%GODOT4%`` if you have created an environment variable for the Godot executable path. It must be the path to the main Godot executable, not the 'console' version. For the **Working Directory**, type a single period, ``.``, meaning the current directory. Also check the **Enable native code debugging** checkbox. You may now close this window, click downward arrow on the debug profile dropdown, and select your new launch profile. Hit the green start button, and your game will begin playing in debug mode.
ga: Chun do scripteanna C# a dhífhabhtú ag baint úsáide as Visual Studio, oscail an comhad .sln a ghintear tar éis an chéad script C# a oscailt san eagarthóir. Sa roghchlár **Debug**, téigh go dtí an mhír roghchláir **Debug Properties** do thionscadal. Cliceáil ar an gcnaipe **Cruthaigh próifíl nua** agus roghnaigh **Inrite**. Sa réimse **Inrite**, brabhsáil ar chonair leagan C# d'eagarthóir Godot, nó clóscríobh ``% GODOT4%`` má tá athróg timpeallachta cruthaithe agat do chonair inrite Godot. Caithfidh gurb é an cosán go dtí an príomh-inrite Godot, ní an leagan 'consól'. Don ** Eolaire Oibre**, clóscríobh tréimhse amháin, ``.``, rud a chiallaíonn an t-eolaire reatha. Seiceáil freisin an ticbhosca **Cumasaigh dífhabhtaithe an chóid dhúchais**. Is féidir leat an fhuinneog seo a dhúnadh anois, saighead anuas a chliceáil ar an anuas próifíle dífhabhtaithe, agus do phróifíl seolta nua a roghnú. Buail an cnaipe tosaithe glas, agus tosóidh do chluiche ag imirt i mód dífhabhtaithe.
ja: Visual Studio を使用して C# スクリプトをデバッグするには、エディターで最初の C# スクリプトを開いた後に生成される .sln ファイルを開きます。**デバッグ** メニューで、プロジェクトの **デバッグ プロパティ** メニュー項目に移動します。**新しいプロファイルの作成** ボタンをクリックし、**実行可能ファイル** を選択します。**実行可能ファイル** フィールドで、C# バージョンの Godot エディターのパスを参照するか、Godot 実行可能ファイル パスの環境変数を作成している場合は ``%GODOT4%`` と入力します。これは、"コンソール"バージョンではなく、メインの Godot 実行可能ファイルへのパスである必要があります。**作業ディレクトリ** には、現在のディレクトリを意味する単一のピリオド ``.`` を入力します。**ネイティブコードのデバッグを有効にする** チェックボックスもオンにします。これでこのウィンドウを閉じて、デバッグ プロファイル ドロップダウンの下矢印をクリックし、新しい起動プロファイルを選択できます。緑の開始ボタンを押すと、ゲームがデバッグモードで実行されます。
ru: Чтобы отладить ваши C# скрипты с использованием Visual Studio, откройте файл .sln, который создается после открытия первого C# скрипта в редакторе. В меню **Отладка** перейдите к элементу меню **Свойства отладки** для вашего проекта. Нажмите кнопку **Создать новый профиль** и выберите **Исполняемый файл**. В поле **Исполняемый файл** укажите путь к версии редактора Godot для C#, или введите ``%GODOT4%``, если вы создали переменную среды для пути к исполняемому файлу Godot. Это должен быть путь к основному исполняемому файлу Godot, а не к 'консольной' версии. В поле **Рабочая директория** введите одну точку, ``.``, что означает текущую директорию. Также отметьте чекбокс **Включить отладку нативного кода**. Теперь вы можете закрыть это окно, нажать на стрелку вниз в выпадающем списке профилей отладки и выбрать ваш новый профиль запуска. Нажмите на зеленую кнопку старт, и ваша игра начнет запускаться в режиме отладки.
ta: விசுவல் ச்டுடியோவைப் பயன்படுத்தி உங்கள் சி# ச்கிரிப்ட்களை பிழைத்திருத்த, எடிட்டரில் முதல் சி# ச்கிரிப்டைத் திறந்த பிறகு உருவாக்கப்படும் .sln கோப்பைத் திறக்கவும். ** பிழைத்திருத்தம் ** பட்டியலில், உங்கள் திட்டத்திற்கான ** பிழைத்திருத்த பண்புகள் ** பட்டியல் உருப்படிக்குச் செல்லவும். ** புதிய சுயவிவரத்தை உருவாக்கு ** பொத்தானைக் சொடுக்கு செய்து ** இயங்கக்கூடிய ** ஐத் தேர்வுசெய்க. ** இயங்கக்கூடிய ** புலத்தில், கோடோட் எடிட்டரின் சி# பதிப்பின் பாதையில் உலாவவும், அல்லது கோடோட் இயங்கக்கூடிய பாதைக்கு நீங்கள் ஒரு சூழல் மாறியை உருவாக்கியிருந்தால் ``%கோடோட் 4%`` என தட்டச்சு செய்க. இது 'கன்சோல்' பதிப்பாக அல்ல, முக்கிய கோடோட் இயங்கக்கூடிய பாதையாக இருக்க வேண்டும். ** வேலை செய்யும் கோப்பகத்திற்கு **, ஒரு காலகட்டத்தை தட்டச்சு செய்க, `` .``, அதாவது தற்போதைய கோப்பகத்தைக் குறிக்கிறது. ** சொந்த குறியீடு பிழைத்திருத்தத்தை இயக்கு ** தேர்வுப்பெட்டியையும் சரிபார்க்கவும். நீங்கள் இப்போது இந்த சாளரத்தை மூடலாம், பிழைத்திருத்த சுயவிவர வீழ்ச்சியில் கீழ்நோக்கி அம்புக்குறியைக் சொடுக்கு செய்து, உங்கள் புதிய வெளியீட்டு சுயவிவரத்தைத் தேர்ந்தெடுக்கவும். பச்சை தொடக்க பொத்தானை அழுத்தவும், உங்கள் விளையாட்டு பிழைத்திருத்த பயன்முறையில் விளையாடத் தொடங்கும்.
uk: Щоб налагодити сценарії C# за допомогою Visual Studio, відкрийте файл .sln, який створюється після відкриття першого сценарію C# у редакторі. У меню **Debug** перейдіть до пункту меню **Debug Properties** для вашого проекту. Натисніть кнопку **Створити новий профіль** і виберіть **Виконуваний файл**. У полі **Виконуваний файл** знайдіть шлях до C# версії редактора Godot або введіть ``%GODOT4%``, якщо ви створили змінну середовища для шляху до виконуваного файлу Godot. Це має бути шлях до основного виконуваного файлу Godot, а не «консольної» версії. Для **Робочого каталогу** введіть одну крапку, ``.``, що означає поточний каталог. Також установіть прапорець **Увімкнути налагодження рідного коду**. Тепер ви можете закрити це вікно, клацнути стрілку вниз у спадному списку профілю налагодження та вибрати новий профіль запуску. Натисніть зелену кнопку «Пуск», і ваша гра почне грати в режимі налагодження.
zh_tw: 若要用 Visual Studio 除錯 C# 腳本，請開啟第一個 C# 腳本後產生的 .sln 檔。於 **偵錯** 選單中，進入專案的 **偵錯屬性** 。點擊 **建立新設定檔** 並選擇 **可執行檔** 。在 **可執行檔** 欄位選擇 Godot 編輯器支援 C# 版本的執行檔路徑，若已設好 GODOT4 環境變數，也可填 ``%GODOT4%`` 。此路徑必須是主 Godot 執行檔，不能用 console 版本。 **工作目錄** 填入單一點號 ``.`` （表示目前目錄）。勾選 **啟用原生程式碼偵錯** 。設定完成後即可關閉視窗，從偵錯設定檔下拉選單選擇剛建立的設定檔，點擊綠色開始按鈕，遊戲就會以除錯模式啟動。

source: Creating a C# script
ga: Script C # a chruthú
it: Creare uno script C#
ja: C#スクリプトの作成
pl: Tworzenie skryptu C#
ru: Создание C# скрипта
ta: சி# ச்கிரிப்டை உருவாக்குதல்
uk: Створення скрипту C#
zh_tw: 建立 C# 腳本

source: After you successfully set up C# for Godot, you should see the following option when selecting **Attach Script** in the context menu of a node in your scene:
ga: Tar éis duit C# a chur ar bun go rathúil do Godot, ba cheart duit an rogha seo a leanas a fheiceáil agus tú ag roghnú **Ceangail Script** i roghchlár comhthéacs nód i do radharc:
it: Dopo aver configurato correttamente C# per Godot, dovrebbero apparire la seguente opzioni quando viene selezionato **Allega script** nel menu contestuale di un nodo nella scena:
ja: Godot用にC#を正常にセットアップした後、シーン内のノードのコンテキストメニューで ``Attach Script`` を選択すると、次のオプションが表示されます:
ru: После успешной настройки C# в Godot, вы должны увидеть новую опцию выбора — из контекстного меню прикрепляемого к сцене скрипта:
ta: கோடோட்டுக்கு நீங்கள் வெற்றிகரமாக சி# ஐ அமைத்த பிறகு, உங்கள் காட்சியில் ஒரு முனையின் சூழல் பட்டியலில் ** ச்கிரிப்டை இணைக்கவும் ** ஐத் தேர்ந்தெடுக்கும்போது பின்வரும் விருப்பத்தை நீங்கள் காண வேண்டும்:
uk: Після того, як ви успішно налаштували C# для Godot, ви повинні побачити наступну опцію при виборі **Attach Script** у контекстному меню вузла на вашій сцені:
zh_tw: 當你成功設定好 Godot 的 C# 支援後，於場景節點的右鍵選單選擇 **附加腳本** 時應會出現下列選項：

source: Note that while some specifics change, most concepts work the same when using C# for scripting. If you're new to Godot, you may want to follow the tutorials on :ref:`doc_scripting` at this point. While some documentation pages still lack C# examples, most notions can be transferred from GDScript.
ga: Tabhair faoi deara cé go n-athraíonn roinnt sonraí, oibríonn an chuid is mó de choincheapa mar an gcéanna agus C # á úsáid agat le haghaidh scripte Má tá tú nua le Godot, b'fhéidir gur mhaith leat na ranganna teagaisc a leanúint ar:ref: `doc_scripting` ag an bpointe seo. Cé nach bhfuil samplaí C # fós ag roinnt leathanaigh dhoiciméadaithe, is féidir an chuid is mó de na coincheapa a aistriú ó GDScript.
it: Si noti che, sebbene alcuni dettagli cambino, la maggior parte dei concetti funziona allo stesso modo quando si usa C# per lo scripting. Se non si ha familiarità con Godot, a questo punto potrebbe essere utile seguire i tutorial su :ref:`doc_scripting`. Sebbene alcune pagine di documentazione siano ancora prive di esempi in C#, la maggior parte dei concetti può essere trasferita da GDScript.
ja: スクリプトに C# を使用する場合、一部の細かい仕様は変わりますが、ほとんどのコンセプトは同じように機能します。Godot を初めて使用する場合は、この時点で :ref:`doc_scripting` のチュートリアルに従うことをお勧めします。一部のドキュメントページには C# のサンプルがまだありませんが、ほとんどのコードはGDScriptから簡単に移行できます。
ru: Обратите внимание, что, несмотря на некоторые изменения в деталях, большинство концепций остаются неизменными при использовании C# для написания скриптов. Если вы новичок в Godot, на данном этапе вам могут быть интересны руководства по :ref:`doc_scripting`. Хотя на некоторых страницах документации всё ещё отсутствуют примеры на C#, большинство концепций можно перенести из GDScript.
ta: சில பிரத்தியேகங்கள் மாறும்போது, ச்கிரிப்ட்டுக்கு சி# ஐப் பயன்படுத்தும் போது பெரும்பாலான கருத்துக்கள் ஒரே மாதிரியாக செயல்படுகின்றன என்பதை நினைவில் கொள்க. நீங்கள் கோடோட்டுக்கு புதியவர் என்றால், நீங்கள் பயிற்சிகளைப் பின்பற்ற விரும்பலாம்: குறிப்பு: `doc_scripting` இந்த கட்டத்தில். சில ஆவணப்படுத்தல் பக்கங்களில் இன்னும் சி# எடுத்துக்காட்டுகள் இல்லை என்றாலும், பெரும்பாலான கருத்துக்களை சி.டி.எச்ச்கிரிப்டிலிருந்து மாற்றலாம்.
uk: Зауважте, що хоча деякі особливості змінюються, більшість концепцій працюють однаково при використанні C# для створення сценаріїв. Якщо ви новачок у роботі з Godot, можливо, ви захочете прочитати підручники з :ref:`doc_scripting` на цьому етапі. Хоча на деяких сторінках документації все ще відсутні приклади C#, більшість понять можна перенести з GDScript.
zh_tw: 請注意，儘管細節略有不同，大部分腳本概念在 C# 與 GDScript 之間是一致的。如果你剛接觸 Godot，建議先閱讀 :ref:`doc_scripting` 相關教學。雖然有些文件頁面缺乏 C# 範例，大部分觀念都能直接從 GDScript 套用。

source: Project setup and workflow
ga: Socrú tionscadail agus sreabhadh oibre
it: Configurazione del progetto e flusso di lavoro
ja: プロジェクトの設定とワークフロー
ru: Настройка проекта и рабочего процесса
ta: திட்ட அமைப்பு மற்றும் பணிப்பாய்வு
uk: Налаштування проєкту та робочий процес
zh_tw: 專案設定與工作流程

source: When you create the first C# script, Godot initializes the C# project files for your Godot project. This includes generating a C# solution (``.sln``) and a project file (``.csproj``), as well as some utility files and folders (``.godot/mono``). All of these but ``.godot/mono`` are important and should be committed to your version control system. Everything under ``.godot`` can be safely added to the ignore list of your VCS. When troubleshooting, it can sometimes help to delete the ``.godot/mono`` folder and let it regenerate.
ga: Nuair a chruthaíonn tú an chéad C# script, cuireann Godot tús leis na comhaid tionscadail C# do thionscadal Godot. Áiríonn sé seo réiteach C# a ghiniúint (``.sln``) agus comhad tionscadail (``.csproj``), chomh maith le roinnt comhad fóntais agus fillteáin (``. godot/mono``). Tá siad seo ar fad ach ``.godot/mono`` tábhachtach agus ba chóir go mbeidís tiomanta do chóras rialaithe leagan. Is féidir gach rud faoi ``.godot`` a chur go sábháilte le liosta neamhairde do VCS. Nuair a bhíonn fabhtcheartú á dhéanamh, is féidir leis cabhrú uaireanta an fillteán ``.godot/mono`` a scriosadh agus ligean dó athghiniúint.
ja: 最初のC#スクリプトを作成すると、GodotはGodotプロジェクトのC#プロジェクトファイルを初期化します。これには C#ソリューション(``.sln``)とプロジェクトファイル(``.csproj``)の生成、およびいくつかのユーティリティ ファイルとフォルダー (``.godot/mono``) の生成が含まれます。 ``.godot/mono`` 以外のこれらはすべて重要なので、バージョン管理システムにコミットする必要があります。 ``.godot`` の下にあるものはすべて、バージョン管理の無視リストに安全に追加できます。トラブルシューティングを行うときは、 ``.godot/mono`` フォルダーを削除して再生成すると改善する場合があります。
ru: При создании первого скрипта C# Godot инициализирует файлы проекта C# для вашего проекта Godot. Это включает в себя генерацию решения C# (``.sln``) и файла проекта (``.csproj``), а также некоторых служебных файлов и папок (``.godot/mono``). Все эти файлы, кроме ``.godot/mono``, важны и должны быть сохранены в вашей системе контроля версий. Все файлы в папке ``.godot`` можно безопасно добавить в список игнорируемых вашей системы контроля версий (VCS). При устранении неполадок иногда может помочь удаление папки ``.godot/mono`` и её повторная сгенерация.
ta: நீங்கள் முதல் சி# ச்கிரிப்டை உருவாக்கும்போது, உங்கள் கோடோட் திட்டத்திற்கான சி# திட்டக் கோப்புகளை கோடோட் துவக்குகிறது. சி# தீர்வு (`` .sln``) மற்றும் ஒரு திட்டக் கோப்பு (`.csproj``), அத்துடன் சில பயன்பாட்டு கோப்புகள் மற்றும் கோப்புறைகள் (` .godot/mono``) ஆகியவற்றை உருவாக்குவது இதில் அடங்கும். இவை அனைத்தும் ஆனால் `` .கோடோட்/மோனோ`` முக்கியமானவை, அவை உங்கள் பதிப்பு கட்டுப்பாட்டு அமைப்பில் உறுதியாக இருக்க வேண்டும். `` .கோடோட்`` இன் கீழ் உள்ள அனைத்தையும் உங்கள் வி.சி.க்களின் புறக்கணிப்பு பட்டியலில் பாதுகாப்பாக சேர்க்கலாம். சரிசெய்தல் போது, இது சில நேரங்களில் `` .கோடோட்/மோனோ`` கோப்புறையை நீக்கி அதை மீண்டும் உருவாக்க அனுமதிக்கும்.
uk: Коли ви створюєте перший сценарій C#, Godot ініціалізує файли проекту C# для вашого проекту Godot. Це включає створення рішення C# (``.sln``) і файлу проекту (``.csproj``), а також деяких службових файлів і папок (``.godot/mono``). Усе це, крім ``.godot/mono``, є важливим і має бути додано до вашої системи контролю версій. Усе, що міститься в ``.godot``, можна безпечно додати до списку ігнорування вашого VCS. Під час усунення несправностей іноді може допомогти видалити папку ``.godot/mono`` і дати їй відновитися.
zh_tw: 當你建立第一個 C# 腳本時，Godot 會自動初始化整個專案的 C# 專案檔案，包括產生 C# 解決方案（``.sln``）、專案檔（``.csproj``），以及一些工具相關檔案和資料夾（如 ``.godot/mono``）。除了 ``.godot/mono`` 外，其餘都很重要，應納入版本控制。``.godot`` 底下內容可安全加入版本控制忽略清單。有時排除問題時，刪除 ``.godot/mono`` 讓 Godot 重新產生會有幫助。

source: Example
ga: Sampla
it: Esempio
ja: サンプル
pl: Przykład
ru: Пример
ta: எடுத்துக்காட்டு
uk: Приклад
zh_tw: 範例

source: Here's a blank C# script with some comments to demonstrate how it works.
ga: Seo script bán C # le roinnt tuairimí chun a thaispeáint conas a oibríonn sé.
it: Ecco uno script C# vuoto con alcuni commenti per dimostrarne il funzionamento.
ja: 以下に、空白のC#スクリプトと、その動作を示すコメントを示します。
pl: Oto pusty skrypt C# z komentarzami, aby pokazać jak to działa.
ru: Это пустой C# скрипт с некоторыми комментариями, чтобы продемонстрировать, как он работает.
ta: இது எவ்வாறு செயல்படுகிறது என்பதை நிரூபிக்க சில கருத்துகளுடன் வெற்று சி# ச்கிரிப்ட் இங்கே.
uk: Ось порожній скрипт C# з деякими коментарями, щоб продемонструвати, як він працює.
zh_tw: 以下是一個空白的 C# 腳本範例，並附有說明註解。
