Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_global_classes.po
Languages: it, ru, ta, uk, zh_hant

source: C# global classes
it: Classi globali in C#
ru: Глобальные классы C#
ta: சி# உலகளாவிய வகுப்புகள்
uk: Глобальні класи C#
zh_hant: C# 全域類別

source: Global classes (also known as named scripts) are types registered in Godot's editor so they can be used more conveniently. :ref:`In GDScript <doc_gdscript_basics_class_name>`, this is achieved using the ``class_name`` keyword at the top of a script. This page describes how to achieve the same effect in C#.
it: Le classi globali (note anche come script denominati) sono tipi registrati nell'editor di Godot per poter essere utilizzati più comodamente. :ref:`In GDScript <doc_gdscript_basics_class_name>`, si creano inserendo la parola chiave ``class_name`` all'inizio di uno script. Questa pagina descrive come ottenere lo stesso effetto in C#.
ru: Глобальные классы (также известные как названные скрипты) являются типами, зарегистрированными в редакторе Godot, чтобы их можно было использовать более удобно. :ref:`In GDScript <doc_gdscript_basics_class_name>`, это достигается с помощью ключевого слова ``class_name`` в верхней части скрипта. Эта страница описывает, как достичь того же эффекта в C#.
ta: உலகளாவிய வகுப்புகள் (பெயரிடப்பட்ட ச்கிரிப்ட்கள் என்றும் அழைக்கப்படுகின்றன) கோடோட்டின் எடிட்டரில் பதிவுசெய்யப்பட்ட வகைகள், எனவே அவை மிகவும் வசதியாக பயன்படுத்தப்படலாம். . சி#இல் அதே விளைவை எவ்வாறு அடைவது என்பதை இந்த பக்கம் விவரிக்கிறது.
uk: Глобальні класи (також відомі як іменовані сценарії) — це типи, зареєстровані в редакторі Godot, щоб ними було зручніше користуватися. :ref:`In GDScript <doc_gdscript_basics_class_name>` це досягається за допомогою ключового слова ``class_name`` у верхній частині сценарію. На цій сторінці описано, як досягти такого ж ефекту в C#.
zh_hant: 全域類別（也稱為具名腳本）是在 Godot 編輯器中註冊的型別，讓它們可以更方便地被使用。:ref:`在 GDScript 中 <doc_gdscript_basics_class_name>`，這是透過在腳本頂部使用 ``class_name`` 關鍵字來實現的。本頁將說明如何在 C# 中達到相同的效果。

source: Global classes show up in the *Add Node* and *Create Resource* dialogs.
it: Le classi globali sono visualizzate nelle finestre di dialogo *Aggiungi nodo* e *Crea risorsa*.
ru: Глобальные классы отображаются в диалоговых окнах *Add Node* и *Create Resource*.
ta: உலகளாவிய வகுப்புகள் * சேர்க்கை * மற்றும் * வளங்களை உருவாக்கு * உரையாடல்களில் காண்பிக்கப்படுகின்றன.
uk: Глобальні класи (також відомості як іменовані сценарії) — це типи, зареєстровані в редакції Году, щоб ними було зручніше користуватися.
zh_hant: 全域類別會顯示在 *新增節點* 與 *建立資源* 對話框中。

source: If an :ref:`exported property <doc_c_sharp_exports>` is a global class, the inspector restricts assignment, allowing only instances of that global class or any derived classes.
it: Se una :ref:`proprietà esportata <doc_c_sharp_exports>` è una classe globale, l'ispettore limita l'assegnazione, consentendo solo istanze di quella classe globale o di qualsiasi classe derivata.
ru: Если :ref:`exported property <doc_c_sharp_exports>` является глобальным классом, инспектор ограничивает назначение, разрешая только экземпляры этого глобального класса или любых производных классов.
ta: An: ref: `ஏற்றுமதி செய்யப்பட்ட சொத்து <doc_c_sharp_exports>` என்பது உலகளாவிய வகை, இன்ச்பெக்டர் வேலையை கட்டுப்படுத்துகிறது, அந்த உலகளாவிய வர்க்கத்தின் அல்லது பெறப்பட்ட எந்த வகுப்புகளின் நிகழ்வுகளையும் மட்டுமே அனுமதிக்கிறது.
uk: Якщо :ref:`exported property <doc_c_sharp_exports>` є глобальним класом, інспектор обмежує призначення, дозволяючи лише екземпляри цього глобального класу або будь-яких похідних класів.
zh_hant: 如果一個 :ref:`匯出屬性 <doc_c_sharp_exports>` 是全域類別，屬性檢視器將限制指派，只允許該全域類別或其衍生類別的實例被指派。

source: Global classes are registered with the ``[GlobalClass]`` attribute.
it: Le classi globali sono registrate con l'attributo ``[GlobalClass]``.
ru: Глобальные классы регистрируются с помощью атрибута ``[GlobalClass]``.
ta: உலகளாவிய வகுப்புகள் `` [குளோபல் கிளாச்] `` பண்புக்கூறில் பதிவு செய்யப்பட்டுள்ளன.
uk: Глобальні класи реєструються за допомогою атрибута ``[GlobalClass]``.
zh_hant: 全域類別是透過 ``[GlobalClass]`` 屬性來註冊的。

source: The file name must match the class name in **case-sensitive** fashion. For example, a global class named "MyNode" must have a file name of ``MyNode.cs``, not ``myNode.cs``.
it: Il nome del file deve corrispondere al nome della classe, con **distinzione tra maiuscole e minuscole**. Ad esempio, una classe globale denominata "MyNode" deve avere il nome file ``MyNode.cs``, non ``myNode.cs``.
ru: Имя файла должно совпадать с именем класса с **учётом регистра**. Например, имя файла глобального класса "MyNode" должно быть ``MyNode.cs``, а не ``myNode.cs``.
ta: கோப்பு பெயர் வகுப்பு பெயருடன் ** வழக்கு-உணர்திறன் ** ஃபேசனில் பொருந்த வேண்டும். எடுத்துக்காட்டாக, "மைனோட்" என்ற உலகளாவிய வகை `` mynode.cs`` இன் கோப்பு பெயரைக் கொண்டிருக்க வேண்டும், `` mynode.cs``.
uk: Ім'я файлу має відповідати імені класу з урахуванням регістру. Наприклад, глобальний клас під назвою "MyNode" повинен мати назву файлу ``MyNode.cs``, а не ``myNode.cs``.
zh_hant: 檔案名稱必須與類別名稱完全相同（區分大小寫）。例如，一個名為「MyNode」的全域類別，其檔案名稱必須是 ``MyNode.cs``，不能是 ``myNode.cs``。

source: The ``MyNode`` type will be registered as a global class with the same name as the type's name.
it: Il tipo ``MyNode`` sarà registrato come classe globale con lo stesso nome del tipo.
ru: Тип ``MyNode`` будет зарегистрирован как глобальный класс с тем же именем, что и имя типа.
ta: `` MyNode`` வகை உலகளாவிய வகுப்பாக பதிவு செய்யப்படும்.
uk: Тип ``MyNode`` буде зареєстровано як глобальний клас із такою самою назвою, як і назва типу.
zh_hant: ``MyNode`` 型別將會以型別名稱註冊為全域類別。

source: The *Select a Node* window for the ``MyNode`` exported property filters the list of nodes in the scene to match the assignment restriction.
it: La finestra *Seleziona un nodo* per la proprietà esportata ``MyNode`` filtra l'elenco dei nodi nella scena in modo che corrispondano alla restrizione di assegnazione.
ru: Окно *Select a Node* для экспортированного свойства ``MyNode`` фильтрует список узлов в сцене в соответствии с ограничением назначения.
ta: `` மைனோட்`` ஏற்றுமதி செய்யப்பட்ட சொத்துக்கான * ஒரு முனை * சாளரத்தைத் தேர்ந்தெடுக்கவும், ஒதுக்கீட்டு கட்டுப்பாட்டுடன் பொருந்தக்கூடிய காட்சியில் உள்ள முனைகளின் பட்டியலை வடிகட்டுகிறது.
uk: Вікно *Виберіть вузол* для експортованої властивості ``MyNode`` фільтрує список вузлів у сцені відповідно до обмеження призначення.
zh_hant: 在 ``MyNode`` 匯出屬性的 *選擇節點* 視窗中，會依據指派限制篩選場景中的節點清單。

source: If a custom type isn't registered as a global class, the assignment is restricted to the Godot type the custom type is based on. For example, inspector assignments to an export of the type ``MySimpleSprite2D`` are restricted to ``Sprite2D`` and derived types.
it: Se un tipo personalizzato non è registrato come classe globale, l'assegnazione è limitata al tipo di Godot su cui si basa il tipo personalizzato. Ad esempio, le assegnazioni dell'ispettore a un'esportazione del tipo ``MySimpleSprite2D`` sono limitate a ``Sprite2D`` e ai tipi derivati.
ru: Если пользовательский тип не зарегистрирован как глобальный класс, назначение ограничено типом Godot, на котором основан этот пользовательский тип. Например, назначения инспектора экспорту типа ``MySimpleSprite2D`` ограничены ``Sprite2D`` и производными типами.
ta: தனிப்பயன் வகை உலகளாவிய வகுப்பாக பதிவு செய்யப்படாவிட்டால், தனிப்பயன் வகை அடிப்படையாகக் கொண்ட கோடோட் வகைக்கு இந்த பணி கட்டுப்படுத்தப்படுகிறது. எடுத்துக்காட்டாக, `` mysimplesprite2d`` வகையின் ஏற்றுமதிக்கான இன்ச்பெக்டர் பணிகள் `` ச்ப்ரைட் 2 டி`` மற்றும் பெறப்பட்ட வகைகளுக்கு கட்டுப்படுத்தப்படுகின்றன.
uk: Якщо настроюваний тип не зареєстровано як глобальний клас, призначення обмежується типом Godot, на якому базується настроюваний тип. Наприклад, призначення інспектора для експорту типу ``MySimpleSprite2D`` обмежено ``Sprite2D`` і похідними типами.
zh_hant: 如果自訂型別未註冊為全域類別，則指派將限制於該自訂型別所繼承的 Godot 型別。例如，在屬性檢視器中將 ``MySimpleSprite2D`` 型別的匯出屬性指派時，只能指派 ``Sprite2D`` 及其衍生型別的實例。

source: When combined with the ``[GlobalClass]`` attribute, the ``[Icon]`` attribute allows providing a path to an icon to show when the class is displayed in the editor.
it: Se combinato con l'attributo ``[GlobalClass]``, l'attributo ``[Icon]`` consente di fornire un percorso a un'icona da mostrare quando la classe è visualizzata nell'editor.
ru: В сочетании с атрибутом ``[GlobalClass]`` атрибут ``[Icon]`` позволяет указать путь к значку, который будет отображаться при отображении класса в редакторе.
ta: `` [குளோபல் கிளாச்] `` பண்புக்கூறுடன் இணைந்தால், `` [ஐகான்] `` பண்புக்கூறு ஒரு ஐகானுக்கு ஒரு பாதையை வழங்குவதை அனுமதிக்கிறது.
uk: У поєднанні з атрибутом ``[GlobalClass]`` атрибут ``[Icon]`` дозволяє надати шлях до піктограми, яка буде відображатися, коли клас відображається в редакторі.
zh_hant: 當 ``[Icon]`` 屬性與 ``[GlobalClass]`` 屬性一起使用時，可以指定圖示的路徑，該圖示將在編輯器中顯示於此類別旁。

source: The ``Stats`` class is a custom resource registered as a global class. :ref:`Exporting properties <doc_c_sharp_exports>` of the type ``Stats`` will only allow instances of this resource type to be assigned, and the inspector will let you create and load instances of this type easily.
it: La classe ``Stats`` è una risorsa personalizzata registrata come classe globale. :ref:`Esportare proprietà <doc_c_sharp_exports>` del tipo ``Stats`` permetterà di assegnare solo istanze di questo tipo di risorsa, e l'ispettore permetterà di creare e caricare facilmente istanze di questo tipo.
ru: Класс ``Stats`` — это пользовательский ресурс, зарегистрированный как глобальный класс. ::ref:`Exporting properties <doc_c_sharp_exports>` типа ``Stats`` позволит назначать только экземпляры этого типа ресурсов, а инспектор позволит вам легко создавать и загружать экземпляры этого типа.
ta: `` புள்ளிவிவரங்கள்`` வகுப்பு என்பது உலகளாவிய வகுப்பாக பதிவுசெய்யப்பட்ட தனிப்பயன் வளமாகும். .
uk: Клас ``Stats`` - це спеціальний ресурс, зареєстрований як глобальний клас. :ref:`Exporting properties <doc_c_sharp_exports>` типу ``Stats`` дозволить призначати лише екземпляри цього типу ресурсу, а інспектор дозволить вам легко створювати та завантажувати екземпляри цього типу.
zh_hant: ``Stats`` 類別是一個註冊為全域類別的自訂資源。 ``Stats`` 型別的 :ref:`匯出屬性 <doc_c_sharp_exports>` 時，只能指派此資源型別的實例，並且屬性檢視器會讓你更容易建立與載入此型別的實例。

source: The Godot editor will hide these custom classes with names that begin with the prefix "Editor" in the "Create New Node" or "Create New Scene" dialog windows. The classes are available for instantiation at runtime via their class names, but are automatically hidden by the editor windows along with the built-in editor nodes used by the Godot editor.
it: L'editor Godot nasconderà queste classi personalizzate con nomi che iniziano con il prefisso "Editor" nelle finestre di dialogo "Crea un nuovo nodo" o "Crea una nuova scena". Le classi si possono istanziare tramite i rispettivi nomi in fase di esecuzione, ma sono automaticamente nascoste dalle finestre dell'editor insieme ai nodi integrati specifici dell'editor Godot.
ru: Редактор Godot скроет эти пользовательские классы с именами, начинающимися с префикса "Editor", в диалоговых окнах "Create New Node" или "Create New Scene". Эти классы доступны для создания экземпляров во время выполнения по их именам, но автоматически скрываются окнами редактора вместе со встроенными узлами редактора, используемыми редактором Godot.
ta: கோடோட் எடிட்டர் இந்த தனிப்பயன் வகுப்புகளை "புதிய முனையை உருவாக்கு" அல்லது "புதிய காட்சியை உருவாக்கு" உரையாடல் சாளரங்களில் "எடிட்டர்" என்ற முன்னொட்டுடன் தொடங்கும் பெயர்களுடன் மறைக்கும். வகுப்புகள் அவற்றின் வகுப்பு பெயர்கள் வழியாக இயக்க நேரத்தில் உடனடிக்கு கிடைக்கின்றன, ஆனால் கோடோட் எடிட்டர் பயன்படுத்தும் உள்ளமைக்கப்பட்ட எடிட்டர் முனைகளுடன் தானாகவே எடிட்டர் சாளரங்களால் மறைக்கப்படுகின்றன.
uk: Редактор Godot приховає ці спеціальні класи з іменами, які починаються з префікса «Редактор» у діалогових вікнах «Створити новий вузол» або «Створити нову сцену». Класи доступні для створення екземплярів під час виконання через їх імена класів, але автоматично приховані вікнами редактора разом із вбудованими вузлами редактора, які використовуються редактором Godot.
zh_hant: Godot 編輯器會在「建立新節點」或「建立新場景」對話框中隱藏這些名稱以「Editor」開頭的自訂類別。這些類別仍可在執行時透過類別名稱實例化，但在編輯器視窗中會自動隱藏，與內建編輯器節點一樣。
