Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_basics.po
Languages: ga, it, ja, pl, ru, ta, uk, zh_tw

source: As you can see, functions normally in global scope in GDScript like Godot's ``print`` function are available in the ``GD`` static class which is part of the ``Godot`` namespace. For a full list of methods in the ``GD`` class, see the class reference pages for :ref:`@GDScript <class_@gdscript>` and :ref:`@GlobalScope <class_@globalscope>`.
ga: Mar a fheiceann tú, tá feidhmeanna de ghnáth sa scóip dhomhanda i GDScript cosúil le feidhm ``print`` Godot ar fáil sa rang statach ``GD`` atá mar chuid den ainmspás ``Godot``. Le haghaidh liosta iomlán de mhodhanna sa rang ``GD``, féach ar na leathanaigh thagartha ranga le haghaidh :ref:`@GDScript <class_@gdscript>` agus :ref:`@GlobalScope <class_@globalscope>`.
it: Come si può vedere, le funzioni normalmente in ambito globale in GDScript, come la funzione ``print`` di Godot, sono disponibili nella classe statica ``GD``, che fa parte dello spazio dei nomi ``Godot``. Per un elenco completo dei metodi della classe ``GD``, consultare le pagine di riferimento classi :ref:`@GDScript <class_@gdscript>` e :ref:`@GlobalScope <class_@globalscope>`.
ja: ご覧のとおり、Godot の ``print`` 関数のように、GDScript では通常グローバル スコープにある関数は、``Godot`` 名前空間の一部である ``GD`` 静的クラスで使用できます。 ``GD`` クラスのメソッドの完全なリストについては、 :ref:`@GDScript <class_@gdscript>` および :ref:`@GlobalScope <class_@globalscope>` のクラス参照ページを参照してください。
ru: Как видите, функции, обычно находящиеся в глобальной области видимости в GDScript, такие как функция ``print`` в Godot, доступны в статическом классе ``GD``, который является частью пространства имён ``Godot``. Полный список методов класса ``GD`` см. на страницах с описанием классов :ref:`@GDScript <class_@gdscript>` и :ref:`@GlobalScope <class_@globalscope>`.
ta: நீங்கள் பார்க்க முடியும் என, கோடோட்டின் `` அச்சு`` செயல்பாடு போன்ற சி.டி.எச்.ச்கிரிப்டில் பொதுவாக உலகளாவிய நோக்கத்தில் செயல்பாடுகள் `` gd`` நிலையான வகுப்பில் கிடைக்கின்றன, இது `` கோடோட்` `பெயர்வெளியின் ஒரு பகுதியாகும். `` Gd`` வகுப்பில் உள்ள முறைகளின் முழு பட்டியலுக்கு, வகுப்பு குறிப்பு பக்கங்களைப் பார்க்கவும்: ref: `@gdscript <class_@gdscript>` மற்றும்: Ref: `@globalscope <class_@globalscope>`.
uk: Як ви можете бачити, функції, які зазвичай знаходяться в глобальній області видимості в GDScript, як-от функція Godot ``print``, доступні в статичному класі ``GD``, який є частиною простору імен ``Godot``. Щоб отримати повний список методів у класі ``GD``, перегляньте довідкові сторінки класів для :ref:`@GDScript <class_@gdscript>` і :ref:`@GlobalScope <class_@globalscope>`.
zh_tw: 如你所見，GDScript 中屬於全域作用域的函式（如 Godot 的 ``print`` 函式），在 C# 中則位於 ``Godot`` 命名空間內的靜態類別 ``GD``。完整方法清單請參考類別參考文件：:ref:`@GDScript <class_@gdscript>` 及 :ref:`@GlobalScope <class_@globalscope>`。

source: Keep in mind that the class you wish to attach to your node should have the same name as the ``.cs`` file. Otherwise, you will get the following error:
ga: Coinnigh i gcuimhne gur chóir go mbeadh an t-ainm céanna ag an rang a theastaíonn uait a cheangal le do nód leis an gcomhad ``.cs``. Seachas sin, gheobhaidh tú an earráid seo a leanas:
it: Da tenere presente che la classe che si desidera associare al proprio nodo deve avere lo stesso nome del file ``.cs``. Se no, verrà generato il seguente errore:
ja: ノードにアタッチするクラスは ``.cs`` ファイルと同じ名前でなければならないことに注意してください。そうしないと、次のようなエラーが発生します:
ru: Имейте в виду, что класс, который вы хотите прикрепить к своему узлу, должен иметь то же имя, что и файл ``.cs``. В противном случае вы получите следующую ошибку:
ta: உங்கள் முனையுடன் நீங்கள் இணைக்க விரும்பும் வகுப்பிற்கு `` .cs`` கோப்பின் அதே பெயர் இருக்க வேண்டும் என்பதை நினைவில் கொள்ளுங்கள். இல்லையெனில், பின்வரும் பிழையைப் பெறுவீர்கள்:
uk: Майте на увазі, що клас, який ви хочете приєднати до вашого вузла, повинен мати ту саму назву, що й файл ``.cs``. В іншому випадку ви отримаєте наступну помилку:
zh_tw: 請注意，你要掛載到節點上的類別名稱必須與 ``.cs`` 檔案名稱相同，否則會出現下列錯誤：

source: *"Cannot find class XXX for script res://XXX.cs"*
ga: *"Ní féidir rang XXX a aimsiú le haghaidh script res: //xxx.cs"*
ja: *"スクリプト res://XXX.cs のクラス XXX が見つかりません"*
ru: *"Не удалось найти класс XXX для скрипта res://XXX.cs"*
ta: *"Cannot கண்டுபிடி வகுப்பு XXX க்கு script res://XXX.cs"*
uk: *"Не вдається знайти клас XXX для сценарію res://XXX.cs"*

source: General differences between C# and GDScript
ga: Difríochtaí ginearálta idir C # agus GDScript
it: Differenze generali tra C# e GDScript
ja: C#とGDScriptの一般的な違い
pl: Ogólne różnice między C# i GDScript
ru: Основные различия между C# и GDScript
ta: சி# மற்றும் சி.டி.எச்ச்கிரிப்ட் இடையே பொதுவான வேறுபாடுகள்
uk: Основні відмінності між C# і GDScript
zh_tw: C# 與 GDScript 的主要差異

source: The C# API uses ``PascalCase`` instead of ``snake_case`` in GDScript/C++. Where possible, fields and getters/setters have been converted to properties. In general, the C# Godot API strives to be as idiomatic as is reasonably possible.
ga: Úsáideann an API C # ``Pascalcase`` in ionad ``snake_case`` i GDScript/C ++. Nuair is féidir, rinneadh réimsí agus geadóir/socraithe a thiontú go hairíonna. Go ginearálta, déanann an API C # Godot a dhícheall a bheith chomh idiomatic agus is féidir go réasúnta.
it: L'API di C# utilizza il ``PascalCase`` invece del ``snake_case`` in GDScript/C++. Ove possibile, campi e getter/setter sono stati convertiti in proprietà. In generale, l'API di C# in Godot si sforza di essere il più idiomatica possibile.
ja: C# APIはGDScript/C++の ``snake_case`` の代わりに ``PascalCase`` を使います。 可能であれば、フィールドとゲッター/セッターはプロパティに変換されています。一般的に、C# Godot APIは合理的に可能な限り慣用的であるように努めています。
ru: В языке C# всё API использует стиль записи ``PascalCase`` вместо ``snake_case``, принятого в GDScript/C++. Поля и getters/setters представленны в виде свойств, там где это допустимо. В целом, Godot API на C# стримится быть наиболее наглядным, насколько это возможно.
ta: சி# பநிஇ GDSCRIPT/C ++ இல் `` `பாம்பு_கேச்` க்கு பதிலாக` `பாச்கல்கேச்` ஐப் பயன்படுத்துகிறது. சாத்தியமான இடங்களில், புலங்கள் மற்றும் பெறுநர்கள்/செட்டர்கள் பண்புகளாக மாற்றப்பட்டுள்ளன. பொதுவாக, சி# கோடோட் பநிஇ நியாயமான முறையில் முடிந்தவரை முட்டாள்தனமாக இருக்க முயற்சிக்கிறது.
uk: API C# використовує ``PascalCase`` замість ``snake_case`` в GDScript/C ++. Там де можливо, поля та гетери/сетери були перетворені у властивості. Взагалі API C# Godot прагне бути максимально ідіоматичним, наскільки це можливо.
zh_tw: C# API 採用 ``PascalCase`` （大駝峰式命名），而非 GDScript/C++ 的 ``snake_case`` （底線式命名）。大多數欄位與 getter/setter 都盡量轉換為屬性。整體而言，C# 的 Godot API 盡可能遵循慣用 C# 風格。

source: For more information, see the :ref:`doc_c_sharp_differences` page.
ga: Le haghaidh tuilleadh faisnéise, féach an leathanach:ref: `doc_c_sharp_differences`.
it: Per ulteriori informazioni, consultare la pagina :ref:`doc_c_sharp_differences`.
ja: 詳細については、\ :ref:`doc_c_sharp_differences` ページを参照してください。
ru: За дополнительно информацией, обратитесь к странице: :ref:`doc_c_sharp_differences`.
ta: மேலும் தகவலுக்கு, பார்க்க: ref: `doc_c_sharp_differences` பக்கத்தைப் பார்க்கவும்.
uk: Для отримання додаткової інформації дивіться сторінку :ref:`doc_c_sharp_differences`.
zh_tw: 詳情請參閱 :ref:`doc_c_sharp_differences` 頁面。

source: You need to (re)build the project assemblies whenever you want to see new exported variables or signals in the editor. This build can be manually triggered by clicking the **Build** button in the top right corner of the editor.
ga: Ní mór duit tionóil an tionscadail a thógáil aon uair is mian leat athróga nó comharthaí nua onnmhairithe a fheiceáil san eagarthóir. Is féidir an tógáil seo a spreagadh de láimh trí chliceáil ar an gcnaipe**Tógáil** sa chúinne ar dheis barr an eagarthóra.
ja: C#スクリプトから新しくエクスポートされた変数やシグナルをエディターで表示するには、プロジェクトアセンブリをリビルドする必要があります。このビルドはエディターの右上隅にある [**ビルド**] ボタンをクリックすることで手動でトリガーできます。
ru: Вам необходимо (пере)собрать сборки проекта, чтобы увидеть новые экспортированные переменные или сигналы в редакторе. Эту сборку можно запустить вручную, нажав кнопку **Build** в правом верхнем углу редактора.
ta: எடிட்டரில் புதிய ஏற்றுமதி செய்யப்பட்ட மாறிகள் அல்லது சமிக்ஞைகளைக் காண விரும்பும் போதெல்லாம் நீங்கள் திட்டக் கூட்டங்களை உருவாக்க வேண்டும். எடிட்டரின் மேல் வலது மூலையில் உள்ள ** பில்ட் ** பொத்தானைக் சொடுக்கு செய்வதன் மூலம் இந்த கட்டமைப்பை கைமுறையாகத் தூண்டலாம்.
uk: Вам потрібно (пере)збирати збірки проекту щоразу, коли ви хочете побачити нові експортовані змінні або сигнали в редакторі. Цю збірку можна запустити вручну, натиснувши кнопку **Build** у верхньому правому куті редактора.
zh_tw: 每當你想在編輯器內看到新的匯出變數或訊號時，都必須重新建置專案組件。你可以點擊編輯器右上角的 **建置** 按鈕手動觸發建置。

source: You will also need to rebuild the project assemblies to apply changes in "tool" scripts.
ga: Beidh ort freisin tionóil an tionscadail a atógáil chun athruithe a chur i bhfeidhm i scripteanna “uirlis”.
it: Sarà inoltre necessario ricostruire gli assembly del progetto per applicare le modifiche negli script strumento (tool).
ja: また「ツール」スクリプトの変更を適用するためにも、プロジェクトアセンブリをリビルドする必要があります。
ru: Вам также потребуется перестроить сборки проекта, чтобы применить изменения в скриптовых "инструментах".
ta: "கருவி" ச்கிரிப்ட்களில் மாற்றங்களைப் பயன்படுத்த நீங்கள் திட்டக் கூட்டங்களை மீண்டும் உருவாக்க வேண்டும்.
uk: Вам також потрібно буде перезбирувати збірки проєктів, щоб застосувати зміни в скриптах "інструментів".
zh_tw: 若要套用「tool」腳本的變更，也必須重新建置專案組件。

source: Current gotchas and known issues
ga: Gearraí reatha agus saincheisteanna aitheanta
it: Insidie attuali e problemi noti
ja: 現在の課題と既知の問題
ru: Текущие ограничения и известные проблемы
ta: தற்போதைய கோட்சாக்கள் மற்றும் அறியப்பட்ட சிக்கல்கள்
uk: Поточні обмеження та відомі проблеми
zh_tw: 目前注意事項與已知問題

source: As C# support is quite new in Godot, there are some growing pains and things that need to be ironed out. Below is a list of the most important issues you should be aware of when diving into C# in Godot, but if in doubt, also take a look over the official `issue tracker for .NET issues <https://github.com/godotengine/godot/labels/topic%3Adotnet>`_.
ga: Toisc go bhfuil tacaíocht C# nua go leor i Godot, tá roinnt pianta atá ag dul i méid agus rudaí nach mór a réiteach. Anseo thíos tá liosta de na saincheisteanna is tábhachtaí ar chóir duit a bheith ar an eolas fúthu agus tú ag tumadh isteach i C# in Godot, ach má tá amhras ort, féach freisin ar an rianaitheoir saincheiste oifigiúil le haghaidh saincheisteanna .NET <https://github.com/godotengine /godot/labels/topic%3Adotnet>`_.
it: Poiché il supporto per C# è piuttosto nuovo in Godot, ci sono alcune difficoltà di sviluppo e aspetti da risolvere. Di seguito è riportato un elenco dei problemi più importanti di cui è necessario essere a conoscenza quando ci si tuffa in C# in Godot. In caso di dubbi, è suggerito consultare anche il `tracker ufficiale per i problemi di .NET <https://github.com/godotengine/godot/labels/topic%3Adotnet>`_.
ja: GodotでのC#のサポートは非常に新しいため、いくつかの苦労や解決すべき問題があります。以下は Godot で C# を使用する際に注意したほうがいい重要なリストですが、疑問がある場合は、公式の `.NET の問題管理システム <https://github.com/godotengine/godot/labels/topic%3Adotnet>`_ も併せて確認してください。
ru: Поскольку поддержка C# в Godot появилась сравнительно недавно, существуют некоторые трудности и проблемы, требующие решения. Ниже представлен список наиболее важных проблем, о которых следует знать при освоении C# в Godot. Если же у вас есть сомнения, ознакомьтесь с официальным `трекером проблем .NET <https://github.com/godotengine/godot/labels/topic%3Adotnet>`_.
ta: கோடோட்டில் சி# உதவி மிகவும் புதியது என்பதால், வளர்ந்து வரும் சில வலிகளும், சலவை செய்ய வேண்டிய விசயங்களும் உள்ளன. கோடோட்டில் சி# க்குள் டைவிங் செய்யும் போது நீங்கள் அறிந்திருக்க வேண்டிய மிக முக்கியமான சிக்கல்களின் பட்டியல் கீழே உள்ளது, ஆனால் ஐயம் இருந்தால், .நெட் சிக்கல்களுக்கான அதிகாரப்பூர்வ `வெளியீட்டு டிராக்கரை <https://github.com/godototengine ஐப் பாருங்கள் /கோடோட்/லேபிள்கள்/தலைப்பு%3adotnet> `_.
uk: Оскільки підтримка C# є досить новою для Godot, є деякі проблеми росту та речі, які потрібно виправити. Нижче наведено список найважливіших проблем, про які вам слід знати, коли занурюєтеся в C# у Godot, але якщо сумніваєтеся, також перегляньте офіційний `засіб відстеження проблем для проблем .NET <https://github.com/godotengine/godot/labels/topic%3Adotnet>`_.
zh_tw: 由於 Godot 對 C# 的支援仍屬新穎，現階段仍有不少待完善之處。以下列出目前在 Godot 使用 C# 時需特別留意的重點問題。若有疑問，也可參閱官方的 `.NET 問題追蹤 <https://github.com/godotengine/godot/labels/topic%3Adotnet>`_。

source: Writing editor plugins is possible, but it is currently quite convoluted.
ga: Is féidir forlíontáin eagarthóra a scríobh, ach tá sé curtha go leor faoi láthair.
it: È possibile creare estensioni per editor, ma al momento è piuttosto complicato.
ja: エディタプラグインの作成は可能ですが、現在は非常に複雑です。
pl: Pisanie wtyczek i narzędzi w języku C# nie jest jeszcze obsługiwane.
ru: Написание плагинов для редактора возможно, но в настоящее время это довольно затруднительно.
ta: எடிட்டர் செருகுநிரல்களை எழுதுவது சாத்தியமாகும், ஆனால் இது தற்போது மிகவும் சுருண்டுள்ளது.
uk: Написання плагінів редактора можливе, але наразі це досить складно.
zh_tw: 雖然可以用 C# 撰寫編輯器外掛，但目前流程較為繁瑣。

source: State is currently not saved and restored when hot-reloading, with the exception of exported variables.
ga: Faoi láthair ní shábháiltear agus ní athchóirtear an stát nuair a athluchtáiltear te, seachas athróga onnmhairithe.
it: Al momento, lo stato non viene salvato né ripristinato durante il ricaricamento a caldo, ad eccezione delle variabili esportate.
ja: 現在、エクスポートされた変数を除き、状態(State)は保存およびホットリロード時に復元されません。
ru: В данный момент, при выполнении горячей-перезагруки, состояние не сохраняется и не восстанавливается, за исключением экспортируемых переменных.
ta: ஏற்றுமதி செய்யப்பட்ட மாறிகள் தவிர, சூடான-மறு ஏற்றுதல் போது மாநிலம் தற்போது சேமிக்கப்படவில்லை மற்றும் மீட்டெடுக்கப்படவில்லை.
uk: Наразі стан не зберігається та не відновлюється під час гарячого перезавантаження, за винятком експортованих змінних.
zh_tw: 熱重載時，目前只有匯出變數的狀態會被保存與還原。

source: Attached C# scripts should refer to a class that has a class name that matches the file name.
ga: Ba chóir go dtagraíonn scripteanna ceangailte C # d'aicme a bhfuil ainm ranga aige a mheaitseálann ainm an chomhaid.
it: Gli script C# allegati devono fare riferimento a una classe il cui nome corrisponda al nome del file.
ja: アタッチされた C#スクリプトは、ファイル名と一致するクラス名を持つクラスを参照する必要があります。
ru: Прикрепленные C# скрипты должны относиться к классу, который имеет имя класса, соответствующее имени файла.
ta: இணைக்கப்பட்ட சி# ச்கிரிப்ட்கள் கோப்பு பெயருடன் பொருந்தக்கூடிய வகுப்பு பெயரைக் கொண்ட வகுப்பைக் குறிக்க வேண்டும்.
uk: Вкладені скрипти C# повинні стосуватися класу, який має ім'я класу, яке відповідає імені файлу.
zh_tw: C# 腳本附加時，類別名稱必須與檔名相符。

source: There are some methods such as ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` and signal connection method ``Connect()`` that rely on Godot's ``snake_case`` API naming conventions. So when using e.g. ``CallDeferred("AddChild")``, ``AddChild`` will not work because the API is expecting the original ``snake_case`` version ``add_child``. However, you can use any custom properties or methods without this limitation. Prefer using the exposed ``StringName`` in the ``PropertyName``, ``MethodName`` and ``SignalName`` to avoid extra ``StringName`` allocations and worrying about snake_case naming.
ga: Tá roinnt modhanna ann mar ``Get () ``/``Set () ``, ``Call ()`` /``calldefted () ``agus modh nasc comhartha ``Connect ()`` atá ag brath ar choinbhinsiúin ainmnithe API ``snake_case`` Godot. Mar sin nuair a úsáidtear m.sh. ``CallDefted (“AddChild”) ``, ní oibreoidh ``AddChild`` toisc go bhfuil an API ag súil leis an leagan bunaidh ``snake_case`` `add_child``. Mar sin féin, is féidir leat aon airíonna nó modhanna saincheaptha a úsáid gan an teorainn seo. Is fearr leat an ``StringName`` nochtaithe a úsáid sna ``PropertyName``, `MethodName`` agus ``SignalName`` chun leithdháiltí breise ``StringName`` a sheachaint agus imní faoi ainmniú snake_case.
it: Esistono alcuni metodi come ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` e il metodo di connessione del segnale ``Connect()`` che si basano sulle convenzioni di denominazione in ``snake_case`` dell'API di Godot. Quindi, ad esempio, quando si utilizza ``CallDeferred("AddChild")``, ``AddChild`` non funzionerà perché l'API si aspetta la versione originale di ``add_child`` in ``snake_case``. Nonostante ciò, è possibile utilizzare qualsiasi proprietà o metodo personalizzato senza questa limitazione. Si consiglia di utilizzare ``StringName`` esposto in ``PropertyName``, ``MethodName`` e ``SignalName`` per evitare di allocare ``StringName`` aggiuntivi e di preoccuparsi dei nomi in snake_case.
ja: Godot の ``snake_case`` API 命名規則に依存する ``Get()``/``Set()`` 、\ ``Call()``/``CallDeferred()`` 及びシグナル接続メソッド ``Connect()`` などのメソッドがあります。したがって、例えば ``CallDeferred("AddChild")`` を使用する場合、API は元の ``snake_case`` バージョンの ``add_child`` を想定しているため、 ``AddChild`` は機能しません。ただし、この制限なしに任意のカスタム プロパティまたはメソッドを使用できます。余分な ``StringName`` 割り当てを回避し、snake_case 命名を気にせず、 ``PropertyName`` 、 ``MethodName`` 、および ``SignalName`` で公開されている ``StringName`` を使用することをお勧めします。
ru: Некоторые методы, такие как ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` и метод подключения сигнала ``Connect()``, основаны на соглашениях об именовании API Godot ``snake_case``. Поэтому при использовании, например, ``CallDeferred("AddChild")``, ``AddChild`` не будет работать, поскольку API ожидает исходную версию ``snake_case`` ``add_child``. Однако вы можете использовать любые пользовательские свойства или методы без этого ограничения. Предпочтительнее использовать открытое ``StringName`` в ``PropertyName``, ``MethodName`` и ``SignalName``, чтобы избежать лишних выделений ``StringName`` и беспокойства об именовании в стиле snake_case.
ta: `` பெறுதல் () ``/`` `செட் ()` `,` `என்று ()`/`` `கால் டெஃபெர்டு ()` `மற்றும் சமிக்ஞை இணைப்பு முறை` `இணைக்க ()` `போன்ற சில முறைகள் உள்ளன கோடோட்டின் `` பாம்பு_கச்`` பநிஇ பெயரிடும் மரபுகளில். எனவே எ.கா. `` அழைப்பிதழ் ("addchild") ``, `` addChild`` வேலை செய்யாது, ஏனெனில் அசல் `` பாம்பு_கேச்` பதிப்பு `` கூடுதல்_சில்ட்`` என்று பநிஇ எதிர்பார்க்கிறது. இருப்பினும், இந்த வரம்பு இல்லாமல் நீங்கள் எந்தவொரு தனிப்பயன் பண்புகளையும் முறைகளையும் பயன்படுத்தலாம். கூடுதல் `` முறை பெயர்`` மற்றும் `` சிக்னல் பெயர்`` இல் `` ச்ட்ரிங் பெயர்`` ஏற்பாடுகளைத் தவிர்ப்பதற்கும், பாம்பு_கேச் பெயரிடுவதைப் பற்றி கவலைப்படுவதற்கும் வெளிப்படுத்தப்பட்ட `` சரம் பெயர்`` ஐப் பயன்படுத்தவும்.
uk: Існують деякі методи, такі як ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` і метод з'єднання сигналів ``Connect()``, які покладаються на умови іменування API Godot ``snake_case``. Тому при використанні, наприклад ``CallDeferred("AddChild")``, ``AddChild`` не буде працювати, оскільки API очікує версію ``snake_case``, тобто ``add_child``. Однак ви можете використовувати будь-які власні властивості, або методи, без цього обмеження.
zh_tw: 有些方法（如 ``Get()``/``Set()``、``Call()``/``CallDeferred()`` 以及訊號連接用的 ``Connect()``）仍依賴 Godot 的 ``snake_case`` 命名。例如 ``CallDeferred("AddChild")`` 會失敗，因為 API 只接受原始的 ``add_child``。但你可以自訂屬性或方法，不受此限。建議優先使用 ``PropertyName``、``MethodName``、``SignalName`` 等已公開的 ``StringName``，這樣可避免多餘的 ``StringName`` 配置，也不用顧慮 snake_case。

source: As of Godot 4.0, exporting .NET projects is supported for desktop platforms (Linux, Windows and macOS). Other platforms will gain support in future 4.x releases.
ga: Amhail Godot 4.0, tacaítear le tionscadail .NET a onnmhairiú d'ardáin deisce (Linux, Windows agus macOS). Gheobhaidh ardáin eile tacaíocht in eisiúintí 4.x amach anseo.
it: A partire da Godot 4.0, l'esportazione di progetti .NET è supportata per le piattaforme desktop (Linux, Windows e macOS). Altre piattaforme saranno supportate nelle future versioni 4.x.
ja: Godot 4.0 以降、.NET プロジェクトのエクスポートはデスクトッププラットフォーム (Linux、Windows、macOS) でサポートされています。他のプラットフォームは、今後の 4.x リリースでサポートされる予定です。
ru: Начиная с Godot 4.0, экспорт проектов .NET поддерживается для настольных платформ (Linux, Windows и macOS). Поддержка других платформ появится в будущих версиях 4.x.
ta: கோடோட் 4.0 இன் படி, டெச்க்டாப் தளங்களுக்கு (லினக்ச், சாளரங்கள் மற்றும் மேகோச்) .NET திட்டங்களை ஏற்றுமதி செய்வது ஆதரிக்கப்படுகிறது. பிற தளங்கள் எதிர்கால 4.x வெளியீடுகளில் ஆதரவைப் பெறும்.
uk: Починаючи з Godot 4.0, експорт проектів .NET підтримується для настільних платформ (Linux, Windows і macOS). Інші платформи отримають підтримку в майбутніх версіях 4.x.
zh_tw: 自 Godot 4.0 起，.NET 專案可匯出至桌面平台（Linux、Windows、macOS）。其他平台的支援會於 4.x 未來版本陸續加入。

source: Common pitfalls
ga: Gaillteanna coitianta
it: Errori comuni
ja: よくある落とし穴
ru: Распространенные ошибки
ta: பொதுவான ஆபத்துகள்
uk: Поширені підводні камені
zh_tw: 常見陷阱

source: You might encounter the following error when trying to modify some values in Godot objects, e.g. when trying to change the X coordinate of a ``Node2D``:
ga: D'fhéadfá teacht ar an earráid seo a leanas agus tú ag iarraidh roinnt luachanna i rudaí Godot a mhodhnú, m.sh. agus tú ag iarraidh comhordáid X de `Node2D`` a athrú:
ja: Godot オブジェクトの値を変更しようとしたとき。たとえば ``Node2D`` の X 座標を変更しようとすると、次のエラーが発生する場合があります。
ru: При попытке изменить некоторые значения в объектах Godot, например, при попытке изменить координату X ``Node2D``, вы можете столкнуться со следующей ошибкой:
ta: கோடோட் பொருள்களில் சில மதிப்புகளை மாற்ற முயற்சிக்கும்போது பின்வரும் பிழையை நீங்கள் சந்திக்க நேரிடும், எ.கா. `` node2d`` இன் ஃச் ஒருங்கிணைப்பை மாற்ற முயற்சிக்கும்போது:
uk: Ви можете зіткнутися з такою помилкою під час спроби змінити деякі значення в об’єктах Godot, напр. під час спроби змінити координату X ``Node2D``:
zh_tw: 你在嘗試修改部份 Godot 物件的屬性時（如變更 ``Node2D`` 的 X 座標）可能會遇到下列錯誤：

source: This is perfectly normal. Structs (in this example, a ``Vector2``) in C# are copied on assignment, meaning that when you retrieve such an object from a property or an indexer, you get a copy of it, not the object itself. Modifying said copy without reassigning it afterwards won't achieve anything.
ga: Tá sé seo go foirfe gnáth. Déantar struchtúir (sa sampla seo, `Vector2``) i C # a chóipeáil ar shannadh, rud a chiallaíonn go bhfaigheann tú cóip de, ní an réad féin nuair a aisghabhann tú réad den sórt sin ó mhaoin nó ó innéacsaitheoir. Ní bhainfear aon rud amach ag modhnú an chóip sin gan é a athshannadh ina dhiaidh sin.
it: Questo è perfettamente normale. Le strutture (in questo esempio, un ``Vector2``) in C# vengono copiate all'assegnazione, il che significa che quando si recupera un oggetto di questo tipo da una proprietà o da un indicizzatore, si ottiene una sua copia, non l'oggetto stesso. Modificare tale copia senza riassegnarla in seguito non porterà a nulla.
ja: これはまったく正常です。C# の構造体 (この例では ``Vector2``) は代入時にコピーされます。つまりプロパティまたはインデクサーからそのようなオブジェクトを取得すると、オブジェクト本体ではなく、そのコピーが取得されてしまいます。その後で再代入せずにそのコピーを変更したとしても、何も達成されません。
ru: Это совершенно нормально. Структуры (в данном примере ``Vector2``) в C# копируются при присваивании, то есть при извлечении такого объекта из свойства или индексатора вы получаете его копию, а не сам объект. Изменение этой копии без последующего переприсваивания ни к чему не приведёт.
ta: இது முற்றிலும் சாதாரணமானது. சி# இல் உள்ள கட்டமைப்புகள் (இந்த எடுத்துக்காட்டில், ஒரு `` வெக்டர் 2``) வேலையில் நகலெடுக்கப்படுகின்றன, அதாவது நீங்கள் ஒரு சொத்து அல்லது ஒரு குறியீட்டாளரிடமிருந்து அத்தகைய பொருளை மீட்டெடுக்கும்போது, அதன் நகலைப் பெறுவீர்கள், பொருள் அல்ல. அதை மறுசீரமைக்காமல் கூறப்பட்ட நகலை மாற்றியமைப்பது எதையும் அடையாது.
uk: Це абсолютно нормально. Структури (у цьому прикладі ``Vector2``) у C# копіюються під час призначення, тобто коли ви отримуєте такий об’єкт із властивості чи індексатора, ви отримуєте його копію, а не сам об’єкт. Зміна зазначеної копії без її повторного призначення згода нічого не досягне.
zh_tw: 這是正常現象。C# 的結構（如 ``Vector2``）在賦值時是複製，從屬性或索引子取得這類物件時，得到的是副本而非原物件。單獨改變副本的內容並不會改變原屬性，必須重新指定回去。
