Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_exports.po
Languages: ga, it, ko, ru, ta, uk, zh_cn, zh_tw

source: The default value of Godot arrays is null. A different default can be specified:
ga: Is é an luach réamhshocraithe na n-eagar Godot null. Is féidir mainneachtain eile a shonrú:
it: Il valore predefinito degli array Godot è null. È possibile specificare un valore predefinito diverso:
ru: По умолчанию значение массивов Godot является нулевым. Можно указать другое значение по умолчанию:
ta: கோடோட் வரிசைகளின் இயல்புநிலை மதிப்பு பூச்யமாகும். வேறு இயல்புநிலையை குறிப்பிடலாம்:
uk: Значення за замовчуванням для масивів Godot дорівнює нулю. Можна вказати інше значення за умовчанням:
zh_cn: Godot 数组的默认值为 null。可以指定不同的默认值：
zh_tw: Godot 陣列的預設值為 null，可指定不同預設值：

source: Arrays with specified types which inherit from resource can be set by drag-and-dropping multiple files from the FileSystem dock.
ga: Is féidir eagar le cineálacha sonraithe a fhaigheann oidhreacht ó acmhainn a shocrú trí chomhaid iolracha a tharraingt agus a scaoileadh ó dhuga an Chórais Comhad.
it: Gli array con tipi specificati che ereditano da ``Resource`` si possono impostare trascinando e rilasciando più file dal pannello FileSystem.
ru: Массивы с указанными типами, наследующими от ресурса, можно задать путем перетаскивания нескольких файлов из дока Файловой Системы.
ta: வளத்திலிருந்து பெறப்பட்ட குறிப்பிட்ட வகைகளைக் கொண்ட வரிசைகள் கோப்பு முறைமை கப்பல்துறையிலிருந்து பல கோப்புகளை இழுத்து கைவிடுவதன் மூலம் அமைக்கப்படலாம்.
uk: Масиви з указаними типами, які успадковуються від ресурсу, можна встановити шляхом перетягування кількох файлів із док-станції FileSystem.
zh_cn: 如果导出的数组指定了从 Resource 继承的类型，则可以一次性从文件系统面板中拖放多个文件到检查器中来设置该数组的值。
zh_tw: 若指定為繼承自 Resource 的型別陣列，可從檔案系統面板拖拉多個檔案設定。

source: Exporting Godot dictionaries
ga: Foclóirí Godot a easpórtáil
it: Esportazione di dizionari di Godot
ru: Экспорт словарей Godot
ta: கோடோட் அகராதிகளை ஏற்றுமதி செய்தல்
uk: Експорт словників Godot
zh_cn: 导出 Godot 字典
zh_tw: 匯出 Godot 字典

source: Using the generic ``Godot.Collections.Dictionary<TKey, TValue>`` allows specifying the types of the key and value elements of the dictionary.
ga: Trí úsáid a bhaint as an bhfoclóir cineálach ``Godot.Collections.Dictionary <TKey, TValue>`` is féidir cineálacha eochair agus eilimintí luacha an fhoclóra a shonrú.
it: Utilizzando il generico ``Godot.Collections.Dictionary<TKey, TValue>`` è possibile specificare i tipi degli elementi chiave e valore del dizionario.
ru: Использование универсального ``Godot.Collections. Dictionary<TKey, TValue>`` позволяет указывать типы ключей и элементов значений словаря.
ta: பொதுவான `` kudot.collections.dictionary <tkey, tvalue> `` அகராதியின் விசை மற்றும் மதிப்பு கூறுகளின் வகைகளைக் குறிப்பிட அனுமதிக்கிறது.
uk: Використання загального ``Godot.Collections.Dictionary<TKey, TValue>`` дозволяє вказати типи елементів ключа та значення словника.
zh_cn: 使用泛型 ``Godot.Collections.Dictionary<TKey, TValue>`` 允许指定字典的键和值的元素的类型。
zh_tw: 使用泛型 ``Godot.Collections.Dictionary<TKey, TValue>`` 可指定字典的鍵與值型別。

source: Typed dictionaries are currently unsupported in the Godot editor, so the Inspector will not restrict the types that can be assigned, potentially resulting in runtime exceptions.
ga: Ní thacaítear le foclóirí clóscríofa in eagarthóir Godot faoi láthair, mar sin ní chuirfidh an Cigire srian ar na cineálacha is féidir a shannadh, rud a d'fhéadfadh eisceachtaí am rite a bheith mar thoradh orthu.
zh_cn: 目前在 Godot 编辑器中不支持类型化字典，因此检查器将不会限制可以分配的类型，可能导致运行时异常。
zh_tw: 目前 Godot 編輯器尚不支援型別化字典，因此 Inspector 不會限制可指定的型別，這可能導致執行時期例外。

source: The default value of Godot dictionaries is null. A different default can be specified:
ga: Tá luach réamhshocraithe fhoclóirí Godot ar neamhní. Is féidir mainneachtain eile a shonrú:
it: Il valore predefinito dei dizionari Godot è null. È possibile specificare un valore predefinito diverso:
ru: По умолчанию значение словарей Godot является нулевым. Можно указать другое значение по умолчанию:
ta: கோடோட் அகராதிகளின் இயல்புநிலை மதிப்பு பூச்யமாகும். வேறு இயல்புநிலையை குறிப்பிடலாம்:
uk: Значення за замовчуванням словників Godot дорівнює нулю. Можна вказати інше значення за умовчанням:
zh_cn: Godot 字典的默认值是 null。可以指定不同的默认值：
zh_tw: Godot 字典的預設值為 null，可指定不同預設值：

source: Exporting C# arrays
ga: Eagair C # á n-easpórtáil
it: Esportazione di array di C#
ru: Экспорт массивов C#
ta: சி# வரிசைகளை ஏற்றுமதி செய்கிறது
uk: Експорт масивів C#
zh_cn: 导出 C# 数组
zh_tw: 匯出 C# 陣列

source: C# arrays can exported as long as the element type is a :ref:`Variant-compatible type <c_sharp_variant_compatible_types>`.
ga: Is féidir eagair C# a easpórtáil chomh fada agus is é an cineál eiliminte :tag:`Cineál a oireann d'athraitheach <c_sharp_variant_compatible_types>`.
it: È possibile esportare gli array C# a condizione che il tipo degli elementi sia un :ref:`tipo compatibile con Variant <c_sharp_variant_compatible_types>`.
ru: C# массивы могут экспортироваться до тех пор, пока тип элемента является :ref:`Variant-compatible type <c_sharp_variant_compatible_types>`.
ta: உறுப்பு வகை A: ref: `மாறுபாடு-இணக்கமான வகை <c_sharp_variant_compatible_types>` `.
uk: Масиви C# можна експортувати, якщо тип елемента є :ref:`Variant-compatible type <c_sharp_variant_compatible_types>`.
zh_tw: 只要元素型別是 :ref:`Variant 相容型別 <c_sharp_variant_compatible_types>`，C# 陣列就可以匯出。

source: The default value of C# arrays is null. A different default can be specified:
ga: Is é an luach réamhshocraithe na n-eagar C # null. Is féidir mainneachtain eile a shonrú:
it: Il valore predefinito degli array C# è null. È possibile specificare un valore predefinito diverso:
ru: По умолчанию значение C# массивов является нулевым. Можно указать другое значение по умолчанию:
ta: சி# வரிசைகளின் இயல்புநிலை மதிப்பு பூச்யமாகும். வேறு இயல்புநிலையை குறிப்பிடலாம்:
uk: Значення за замовчуванням для масивів C# дорівнює null. Можна вказати інше значення за умовчанням:
zh_cn: C# 数组的默认值是 null。可以指定不同的默认值：
zh_tw: C# 陣列的預設值為 null，可指定不同預設值：

source: Setting exported variables from a tool script
ga: Athróga easpórtáilte ó script uirlise a shocrú
it: Impostare le variabili esportate da uno script strumento (tool)
ko: 툴 스크립트에서 내보낸 변수 설정
ru: Установка экспортированных переменных из скрипта инструмента
ta: கருவி ச்கிரிப்டிலிருந்து ஏற்றுமதி செய்யப்பட்ட மாறிகள் அமைத்தல்
uk: Встановлення експортованих змінних зі скрипту інструмента
zh_cn: 从工具脚本中设置导出变量
zh_tw: 從 tool 腳本設定匯出變數

source: When changing an exported variable's value from a script in :ref:`doc_gdscript_tool_mode`, the value in the inspector won't be updated automatically. To update it, call :ref:`NotifyPropertyListChanged() <class_Object_method_notify_property_list_changed>` after setting the exported variable's value.
ga: Nuair a athraítear luach athróige easpórtáilte ó script i :ref:`doc_gdscript_tool_mode`, ní dhéanfar an luach sa chigire a nuashonrú go huathoibríoch. Chun é a nuashonrú, cuir glaoch ar : ref: `NotifyPropertyListChanged() <class_Object_method_notify_property_list_changed>` tar éis luach na hathróige easpórtáilte a shocrú.
it: Quando si cambia il valore di una variabile esportata da uno script in :ref:`doc_gdscript_tool_mode`, il valore nell'ispettore non verrà aggiornato automaticamente. Per aggiornarlo, chiamare :ref:`NotifyPropertyListChanged() <class_Object_method_notify_property_list_changed>` dopo aver impostato il valore della variabile esportata.
ru: При изменении значения экспортированной переменной из скрипта в :ref:`doc_gdscript_tool_mode` значение в инспекторе не будет обновлено автоматически. Чтобы обновить его, вызовите :ref:`NotifyPropertyListChanged() <class_Object_method_notify_property_list_changed>` после установки значения экспортированной переменной.
ta: ஒரு ச்கிரிப்டிலிருந்து ஏற்றுமதி செய்யப்பட்ட மாறியின் மதிப்பை மாற்றும்போது: குறிப்பு: `Doc_gdscript_tool_mode`, இன்ச்பெக்டரில் உள்ள மதிப்பு தானாகவே புதுப்பிக்கப்படாது. அதைப் புதுப்பிக்க, அழைக்கவும்: Ref: `VarifyPropertylistChanged () <class_object_method_notify_property_list_changed>` ஏற்றுமதி செய்யப்பட்ட மாறியின் மதிப்பை அமைத்த பிறகு.
uk: Якщо змінювати значення експортованої змінної зі сценарію в :ref:`doc_gdscript_tool_mode`, значення в інспекторі не оновлюватиметься автоматично. Щоб оновити його, викличте :ref:`NotifyPropertyListChanged() <class_Object_method_notify_property_list_changed>` після встановлення значення експортованої змінної.
zh_tw: 從 :ref:`doc_gdscript_tool_mode` 腳本中修改匯出變數值時，Inspector 上顯示的值不會自動更新。如要更新，請在設定匯出變數值後呼叫 :ref:`NotifyPropertyListChanged() <class_Object_method_notify_property_list_changed>`。

source: Advanced exports
ga: Onnmhairí casta
it: Esportazioni avanzate
ko: 고급 내보내기
ru: Расширенный экспорт
ta: மேம்பட்ட ஏற்றுமதி
uk: Розширений експорт
zh_cn: 高级导出
zh_tw: 進階匯出

source: Not every type of export can be provided on the level of the language itself to avoid unnecessary design complexity. The following describes some more or less common exporting features which can be implemented with a low-level API.
ga: Ní féidir gach cineál easpórtála a chur ar fáil ar leibhéal na teanga féin chun castacht dearaidh nach bhfuil gá léi a sheachaint. Déanann an méid seo a leanas cur síos ar roinnt gnéithe onnmhairithe níos coitianta nó níos lú ar féidir iad a chur i bhfeidhm le API íseal-leibhéil.
it: Non sono forniti tutti i tipi di esportazione nel linguaggio stesso, per evitare inutili complessità di progettazione. Di seguito sono descritte alcune funzionalità di esportazione più o meno comuni che si possono implementare con un'API di basso livello.
ko: 불필요한 디자인 복잡성을 피하기 위해 모든 타입의 내보내기를 언어 자체 수준에서 제공할 수 있는 것은 아닙니다. 다음은 로우 레벨 API로 구현할 수 있는 다소 일반적인 내보내기 기능에 대해 설명합니다.
ru: Не каждый тип экспорта может быть предоставлен на уровне самого языка, чтобы избежать ненужной сложности проектирования. Далее описаны некоторые более или менее распространенные функции экспорта, которые могут быть реализованы с помощью низкоуровневого API.
ta: தேவையற்ற வடிவமைப்பு சிக்கலைத் தவிர்ப்பதற்காக ஒவ்வொரு வகை ஏற்றுமதியையும் மொழியின் மட்டத்தில் வழங்க முடியாது. குறைந்த அளவிலான பநிஇ மூலம் செயல்படுத்தக்கூடிய சில அல்லது குறைவான பொதுவான ஏற்றுமதி அம்சங்களை பின்வருபவை விவரிக்கிறது.
uk: Не кожен вид експорту можна забезпечити на рівні самої мови, щоб уникнути зайвої складності проєктування. Далі описуються деякі більш-менш загальні функції експорту, які можна реалізувати за допомогою API низького рівня.
zh_cn: 为了避免非必要的复杂设计，并非所有类型的导出都在语言层面上提供。下面将说明一些能用底层 API 实现的，且较为常见的导出方法。
zh_tw: 為避免語言設計過於複雜，並非所有匯出型別都能直接由語言層級提供。以下介紹一些常見但需使用低階 API 實現的匯出功能。

source: Before reading further, you should get familiar with the way properties are handled and how they can be customized with :ref:`_Set() <class_Object_private_method__set>`, :ref:`_Get() <class_Object_private_method__get>`, and :ref:`_GetPropertyList() <class_Object_private_method__get_property_list>` methods as described in :ref:`doc_accessing_data_or_logic_from_object`.
ga: Sula léann tú a thuilleadh, ba cheart duit eolas a chur ar an mbealach a láimhseáiltear airíonna agus conas is féidir iad a shaincheapadh le :ref:`_Set() <class_Object_private_method__set>`, :ref:`_Faigh() <class_Object_private_method__get>`, agus :ref:` _GetPropertyList() <class_Object_private_method__get_property_list>` modhanna mar a thuairiscítear i :ref: `doc_accessing_data_or_logic_from_object`.
it: Prima di proseguire, è opportuno acquisire familiarità con il modo in cui le proprietà sono gestite e con il modo in cui si possono personalizzare con i metodi :ref:`_Set() <class_Object_private_method__set>`, :ref:`_Get() <class_Object_private_method__get>` e :ref:`_GetPropertyList() <class_Object_private_method__get_property_list>`, come descritto in :ref:`doc_accessing_data_or_logic_from_object`.
ru: Прежде чем читать дальше, вам следует ознакомиться со способом обработки свойств и тем, как их можно настраивать с помощью методов :ref:`_Set() <class_Object_private_method__set>`, :ref:`_Get() <class_Object_private_method__get>` и :ref:`_GetPropertyList() <class_Object_private_method__get_property_list>`, как описано в :ref:`doc_accessing_data_or_logic_from_object`.
ta: மேலும் படிப்பதற்கு முன், பண்புகள் கையாளப்படும் விதம் மற்றும் அவை எவ்வாறு தனிப்பயனாக்கப்படலாம் என்பதை நீங்கள் அறிந்திருக்க வேண்டும்: ref: `_Set () <class_object_private_method__set>`,: ref: `_opject_private_method__get>`, மற்றும் ref: ken: ' .
uk: Перш ніж читати далі, ви повинні ознайомитись із тим, як обробляються властивості та як їх можна налаштувати за допомогою методів :ref:`_Set() <class_Object_private_method__set>`, :ref:`_Get() <class_Object_private_method__get>` і :ref:`_GetPropertyList() <class_Object_private_method__get_property_list>` як описано в :ref:`doc_accessing_data_or_logic_from_object`.
zh_tw: 在深入閱讀之前，建議先熟悉屬性處理方式，以及如何透過 :ref:`_Set() <class_Object_private_method__set>`、:ref:`_Get() <class_Object_private_method__get>` 與 :ref:`_GetPropertyList() <class_Object_private_method__get_property_list>` 方法來自訂屬性，詳見 :ref:`doc_accessing_data_or_logic_from_object`。

source: For binding properties using the above methods in C++, see :ref:`doc_binding_properties_using_set_get_property_list`.
ga: Le haghaidh airíonna ceangailteacha ag baint úsáide as na modhanna thuas i C ++, féach :ref:'doc_binding_properties_using_set_get_property_list'.
it: Per vincolare le proprietà in C++ attraverso i metodi sopra indicati, consultare :ref:`doc_binding_properties_using_set_get_property_list`.
ko: C++에서 위의 방법을 사용해 속성을 바인딩하려면 :ref:`doc_binding_properties_using_set_get_property_list`\ 를 참고하세요.
ru: Свойства привязки, использующие описанные выше методы в C++, см. в разделе :ref:`doc_binding_properties_using_set_get_property_list`.
ta: C ++ இல் மேலே உள்ள முறைகளைப் பயன்படுத்தி பண்புகளை பிணைக்க, காண்க: ref: `doc_binding_properties_using_set_get_property_list`.
uk: Для прив'язки властивостей, що використовуються в вищезгаданих методах в C++, дивіться :ref:`doc_binding_properties_using_set_get_property_list`.
zh_cn: 要在 C++ 中用上述方法绑定属性，请参阅 :ref:`doc_binding_properties_using_set_get_property_list`\ 。
zh_tw: 如需在 C++ 中使用上述方法綁定屬性，請參閱 :ref:`doc_binding_properties_using_set_get_property_list`。

source: The script must operate in the ``tool`` mode so the above methods can work from within the editor.
ga: Caithfidh an script feidhmiú sa mhód ''uirlis'' ionas gur féidir leis na modhanna thuas oibriú ón taobh istigh den eagarthóir.
it: Lo script deve funzionare in modalità ``tool`` affinché i metodi menzionati possano funzionare dall'interno dell'editor.
ko: 위의 방법이 편집기 안에서 작동할 수 있도록 스크립트는 ``tool`` 모드에서 작동해야 합니다.
ru: Скрипт должен работать в режиме ``tool``, чтобы вышеперечисленные методы могли работать из редактора.
ta: ச்கிரிப்ட் `` கருவி`` பயன்முறையில் செயல்பட வேண்டும், எனவே மேற்கண்ட முறைகள் எடிட்டருக்குள் இருந்து செயல்பட முடியும்.
uk: Скрипт повинен працювати в режимі ``tool``, щоб вищезазначені методи могли працювати з редактора.
zh_cn: 脚本必须在 ``tool`` 模式运行，才能使上述方法在编辑器内运行。
zh_tw: 腳本必須運作於 ``tool`` 模式，上述方法才能於編輯器內運作。

source: The drop-down menu will be limited to AnimationNode and all its inherited classes. Custom resource classes can also be used, see :ref:`doc_c_sharp_global_classes`.
ga: Beidh an roghchlár anuas teoranta do AnimationNode agus dá ranganna oidhreachta go léir. Is féidir ranganna acmhainní saincheaptha a úsáid freisin, féach :ref:'doc_c_sharp_global_classes'.
