Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_collections.po
Languages: ga, ta

source: C# collections
ga: Bailiúcháin C#
ta: சி# தொகுப்புகள்

source: The .NET base class library contains multiple collection types that can be used to store and manipulate data. Godot also provide some collection types that are tightly integrated with the rest of the engine.
ga: Tá ilchineálacha bailiúcháin sa leabharlann bunaicme .NET ar féidir iad a úsáid chun sonraí a stóráil agus a ionramháil. Soláthraíonn Godot roinnt cineálacha bailiúcháin atá comhtháite go docht leis an gcuid eile den inneall.
ta: .NET அடிப்படை வகுப்பு நூலகத்தில் தரவைச் சேமிக்கவும் கையாளவும் பயன்படுத்தக்கூடிய பல சேகரிப்பு வகைகள் உள்ளன. கோடோட் மீதமுள்ள இயந்திரத்துடன் இறுக்கமாக ஒருங்கிணைக்கப்பட்ட சில சேகரிப்பு வகைகளையும் வழங்குகிறது.

source: Choose a collection
ga: Roghnaigh bailiúchán
ta: ஒரு தொகுப்பைத் தேர்வுசெய்க

source: The main difference between the `.NET collections <https://learn.microsoft.com/en-us/dotnet/standard/collections/>`_ and the Godot collections is that the .NET collections are implemented in C# while the Godot collections are implemented in C++ and the Godot C# API is a wrapper over it, this is an important distinction since it means every operation on a Godot collection requires marshaling which can be expensive especially inside a loop.
ga: Is í an phríomhdhifríocht idir bailiúcháin `.NET <https://learn.microsoft.com/en-us/dotnet/standard/collections/>`_ agus bailiúcháin Godot ná go gcuirtear na bailiúcháin .NET i bhfeidhm in C# agus an Godot Cuirtear bailiúcháin i bhfeidhm i C++ agus is fillteán é API Godot C#, idirdhealú tábhachtach é seo toisc go gciallaíonn sé go bhfuil gá le marsáil ar gach oibríocht ar bhailiúchán Godot, rud a d'fhéadfadh a bheith costasach go háirithe taobh istigh de lúb.
ta: `.நெட் சேகரிப்புகளுக்கு இடையிலான முக்கிய வேறுபாடு <https://learn.microsoft.com/en-us/dotnet/standard/collections/> _ மற்றும் கோடோட் சேகரிப்புகள் என்னவென்றால், நெட் சேகரிப்புகள் சி# இல் செயல்படுத்தப்படுகின்றன சி ++ இல் வசூல் செயல்படுத்தப்படுகிறது மற்றும் கோடோட் சி# பநிஇ அதன் மீது ஒரு ரேப்பர் ஆகும், இது ஒரு முக்கியமான வேறுபாடாகும், ஏனெனில் இது ஒரு கோடோட் சேகரிப்பில் உள்ள ஒவ்வொரு செயல்பாட்டிற்கும் மார்சலிங் தேவைப்படுகிறது, இது குறிப்பாக ஒரு வளையத்திற்குள் விலை உயர்ந்ததாக இருக்கும்.

source: Due to the performance implications, using Godot collections is only recommended when absolutely necessary (such as interacting with the Godot API). Godot only understands its own collection types, so it's required to use them when talking to the engine.
ga: Mar gheall ar na himpleachtaí feidhmíochta, ní mholtar bailiúcháin Godot a úsáid ach amháin nuair is gá go hiomlán (mar shampla idirghníomhú leis an API Godot). Ní thuigeann Godot ach a chineálacha bailiúcháin féin, mar sin tá sé riachtanach iad a úsáid agus é ag caint leis an inneall.
ta: செயல்திறன் தாக்கங்கள் காரணமாக, கோடோட் சேகரிப்புகளைப் பயன்படுத்துவது முற்றிலும் தேவைப்படும்போது மட்டுமே பரிந்துரைக்கப்படுகிறது (கோடோட் பநிஇ உடன் தொடர்புகொள்வது போன்றவை). கோடோட் அதன் சொந்த சேகரிப்பு வகைகளை மட்டுமே புரிந்துகொள்கிறது, எனவே இயந்திரத்துடன் பேசும்போது அவற்றைப் பயன்படுத்த வேண்டும்.

source: If you have a collection of elements that don't need to be passed to a Godot API, using a .NET collection would be more performant.
ga: Má tá bailiúchán eilimintí agat nach gá a chur ar aghaidh chuig API Godot, bheadh bailiúchán .NET níos taibhsiúla.
ta: கோடோட் ஏபிஐக்கு அனுப்பத் தேவையில்லாத கூறுகளின் தொகுப்பு உங்களிடம் இருந்தால், .NET சேகரிப்பைப் பயன்படுத்துவது அதிக செயல்திறன் கொண்டதாக இருக்கும்.

source: It's also possible to convert between .NET collections and Godot collections. The Godot collections contain constructors from generic .NET collection interfaces that copy their elements, and the Godot collections can be used with the `LINQ <https://learn.microsoft.com/en-us/dotnet/standard/linq>`_ ``ToList``, ``ToArray`` and ``ToDictionary`` methods. But keep in mind this conversion requires marshaling every element in the collection and copies it to a new collection so it can be expensive.
ga: Is féidir freisin aistriú idir bailiúcháin .NET agus bailiúcháin Godot. Tá cruthaitheoirí ó chomhéadain chineálacha bailiúcháin .NET i mbailiúcháin Godot a dhéanann cóipeáil ar a n-eilimintí, agus is féidir bailiúcháin Godot a úsáid leis an `LINQ <https://learn.microsoft.com/en-us/dotnet/standard/linq>`_ modhanna ``ToList``, ``ToArray`` agus `ToDictionary``. Ach coinnigh i gcuimhne go gcaithfidh an tiontú seo gach eilimint sa bhailiúchán a mharascail agus é a chóipeáil go bailiúchán nua ionas gur féidir leis a bheith costasach.
ta: நெட் சேகரிப்புகள் மற்றும் கோடோட் சேகரிப்புகளுக்கு இடையில் மாற்றவும் முடியும். கோடோட் சேகரிப்புகளில் பொதுவான .நெட் சேகரிப்பு இடைமுகங்களிலிருந்து கட்டமைப்பாளர்கள் உள்ளன, அவை அவற்றின் கூறுகளை நகலெடுக்கின்றன, மேலும் கோடோட் வசூல் `லின்க் <https://learn.microsoft.com/en-us/dotnet/standard/linq> _ _ _ உடன் பயன்படுத்தப்படலாம் `` Tolist``, `` toarray`` மற்றும் `` டோட்சன் `` முறைகள். ஆனால் இந்த மாற்றத்திற்கு சேகரிப்பில் உள்ள ஒவ்வொரு உறுப்புகளையும் மார்சல் செய்ய வேண்டும் என்பதை நினைவில் கொள்ளுங்கள், மேலும் அதை ஒரு புதிய சேகரிப்பில் நகலெடுக்கிறது, எனவே அது விலை உயர்ந்ததாக இருக்கும்.

source: Despite this, the Godot collections are optimized to try and avoid unnecessary marshaling, so methods like ``Sort`` or ``Reverse`` are implemented with a single interop call and don't need to marshal every element. Keep an eye out for generic APIs that take collection interfaces like `LINQ <https://learn.microsoft.com/en-us/dotnet/standard/linq>`_ because every method requires iterating the collection and, therefore, marshaling every element. Prefer using the instance methods of the Godot collections when possible.
ga: Ina ainneoin sin, déantar bailiúcháin Godot a bharrfheabhsú chun iarracht a dhéanamh marsáil neamhriachtanach a sheachaint, agus mar sin cuirtear modhanna cosúil le ``Sort`` nó `` Droim ar ais` i bhfeidhm le glao idirghabhála amháin agus ní gá gach gné a mharcáil. Coinnigh súil amach do APIanna cineálacha a ghlacann comhéadain bhailiúcháin ar nós `LINQ <https://learn.microsoft.com/en-us/dotnet/standard/linq>`_ toisc go n-éilíonn gach modh an bailiúchán a atriall agus, dá bhrí sin, gach modh a riaradh. eilimint. Is fearr úsáid a bhaint as modhanna samplaí bhailiúcháin Godot nuair is féidir.
ta: இதுபோன்ற போதிலும், தேவட் வசூல் தேவையற்ற மார்சலிங்கைத் தவிர்க்கவும் தவிர்க்கவும் உகந்ததாக உள்ளது, எனவே `` வரிசை`` அல்லது `தலைகீழ்`` போன்ற முறைகள் ஒற்றை இடைமுக அழைப்புடன் செயல்படுத்தப்படுகின்றன, மேலும் ஒவ்வொரு உறுப்புகளையும் மார்சல் செய்ய தேவையில்லை. `லின்க் <https://learn.microsoft.com/en-us/dotnet/standard/linq> _ _ போன்ற சேகரிப்பு இடைமுகங்களை எடுக்கும் பொதுவான பநிஇ களுக்கு ஒரு கண் வைத்திருங்கள், ஏனெனில் ஒவ்வொரு முறைக்கும் சேகரிப்பை மீண்டும் செய்ய வேண்டும், எனவே, ஒவ்வொரு முறையும் மார்சலிங் உறுப்பு. முடிந்தவரை கோடோட் சேகரிப்புகளின் நிகழ்வு முறைகளைப் பயன்படுத்த விரும்புங்கள்.

source: To choose which collection type to use for each situation, consider the following questions:
ga: Chun an cineál bailiúcháin atá le húsáid do gach cás a roghnú, smaoinigh ar na ceisteanna seo a leanas:
ta: ஒவ்வொரு சூழ்நிலைக்கும் எந்த சேகரிப்பு வகையைப் பயன்படுத்த வேண்டும் என்பதைத் தேர்வுசெய்ய, பின்வரும் கேள்விகளைக் கவனியுங்கள்:

source: Does your collection need to interact with the Godot engine? (e.g.: the type of an exported property, calling a Godot method).
ga: An gá do bhailiúchán idirghníomhú leis an inneall Godot? (m.sh.: an cineál maoine onnmhairithe, ag glaoch ar mhodh Godot).
ta: உங்கள் சேகரிப்பு கோடோட் எஞ்சினுடன் தொடர்பு கொள்ள வேண்டுமா? (எ.கா .: ஏற்றுமதி செய்யப்பட்ட சொத்தின் வகை, ஒரு கோடோட் முறையை அழைக்கிறது).

source: If yes, since Godot only supports :ref:`c_sharp_variant_compatible_types`, use a Godot collection.
ga: Má tá, ós rud é nach dtacaíonn Godot ach le :ref:'c_sharp_variant_compatible_types', bain úsáid as bailiúchán Godot.
ta: ஆம் எனில், கோடோட் மட்டுமே ஆதரிப்பதால்: குறிப்பு: `c_sharp_variant_compatible_types`, ஒரு கோடோட் சேகரிப்பைப் பயன்படுத்தவும்.

source: If not, consider `choosing an appropriate .NET collection <https://learn.microsoft.com/en-us/dotnet/standard/collections/selecting-a-collection-class>`_.
ga: Mura bhfuil, smaoinigh ar `cnuasach cuí .NET a roghnú <https://learn.microsoft.com/en-us/dotnet/standard/collections/selecting-a-collection-class>`_.
ta: இல்லையெனில், பொருத்தமான .நெட் சேகரிப்பைத் தேர்ந்தெடுப்பதைக் கவனியுங்கள் <https://learn.microsoft.com/en-us/dotnet/standard/collections/selenging-a-collection-class> `_.

source: Do you need a Godot collection that represents a list or sequential set of data?
ga: An dteastaíonn bailiúchán Godot uait a léiríonn liosta nó tacar seicheamhach sonraí?
ta: ஒரு பட்டியல் அல்லது தொடர்ச்சியான தரவைக் குறிக்கும் கோடோட் சேகரிப்பு உங்களுக்குத் தேவையா?

source: Godot :ref:`arrays <doc_c_sharp_collections_array>` are similar to the C# collection ``List<T>``.
ga: Godot :ref:`arrays <doc_c_sharp_collections_array>` atá cosúil le bailiúchán C# ``Liosta<T>``.
ta: கோடோட்: குறிப்பு: `வரிசைகள் <doc_c_sharp_collections_array>` சி# சேகரிப்புக்கு ஒத்தவை `` பட்டியல் <T> ``.

source: Godot :ref:`packed arrays <doc_c_sharp_collections_packedarray>` are more memory-efficient arrays, in C# use one of the supported ``System.Array`` types.
ga: Godot :ref: `eagair pacáilte <doc_c_sharp_collections_packedarray>` is eagair atá níos tíosaí ar chuimhne, in C# úsáid ceann de na cineálacha ``System.Array`` a dtacaítear leo.
ta: கோடோட்: ref: `பேக் செய்யப்பட்ட வரிசைகள் <doc_c_sharp_collections_packedarray>` அதிக நினைவக-திறமையான வரிசைகள், சி# இல் ஆதரிக்கப்பட்ட `` சிச்டம்.அரே`` வகைகளில் ஒன்றைப் பயன்படுத்தவும்.

source: Do you need a Godot collection that maps a set of keys to a set of values?
ga: An bhfuil bailiúchán Godot de dhíth ort a mhapálann sraith eochracha do shraith luachanna?
ta: மதிப்புகளின் தொகுப்பிற்கு சாவியின் தொகுப்பை வரைபடமாக்கும் ஒரு கோடோட் சேகரிப்பு உங்களுக்குத் தேவையா?

source: Godot :ref:`dictionaries <doc_c_sharp_collections_dictionary>` store pairs of keys and values and allow easy access to the values by their associated key.
ga: Godot :ref:`foclóirí <doc_c_sharp_collections_dictionary>` stóráiltear péirí eochracha agus luachanna agus ceadaíonn siad rochtain éasca ar na luachanna tríd an eochair a bhaineann leo.
ta: கோடோட்: குறிப்பு: `அகராதிகள் <doc_c_sharp_collections_dictionary>` சோடிகளின் விசைகள் மற்றும் மதிப்புகளை சேமித்து, அவற்றுடன் தொடர்புடைய விசையால் மதிப்புகளை எளிதாக அணுக அனுமதிக்கவும்.

source: Godot collections
ga: Bailiúcháin Godot
ta: கோடோட் சேகரிப்புகள்

source: PackedArray
ga: PacáilteArray
ta: பேக்அரே

source: Godot packed arrays are implemented as an array of a specific type, allowing it to be more tightly packed as each element has the size of the specific type, not ``Variant``.
ga: Cuirtear eagar pacáilte Godot i bhfeidhm mar shraith de chineál ar leith, rud a ligeann dó a bheith pacáilte níos déine toisc go bhfuil méid an chineáil ar leith ag gach eilimint, ní ''Malairt''.
ta: கோடோட் பேக் செய்யப்பட்ட வரிசைகள் ஒரு குறிப்பிட்ட வகையின் வரிசையாக செயல்படுத்தப்படுகின்றன, இது ஒவ்வொரு உறுப்புக்கும் குறிப்பிட்ட வகையின் அளவைக் கொண்டிருப்பதால் அதை மிகவும் இறுக்கமாக நிரம்புகிறது, `` மாறுபாடு` அல்ல.

source: In C#, packed arrays are replaced by ``System.Array``:
ga: In C#, cuirtear ''System.Array' in ionad eagar pacáilte:
ta: சி#இல், நிரம்பிய வரிசைகள் `` System.array`` ஆல் மாற்றப்படுகின்றன:

source: GDScript
ga: GDScriptName

source: ``PackedByteArray``
ga: ''PacáilteByteArray''
ta: `` பேக்ஃபைடெர்ரே``

source: ``byte[]``
ga: ''beart[]''
ta: `` பைட் [] ``

source: ``PackedInt64Array``
ga: ''PacáilteInt64Array''

source: ``long[]``
ga: ''fada[]''
ta: `` நீண்ட [] ``

source: ``float[]``
ga: ''snámhphointe[]''
ta: `` மிதத்தல் [] ``

source: ``PackedFloat64Array``
ga: ''PacáilteFloat64Array''
ta: `` பேக்ஃப்ளோட் 64ARRAY``

source: ``double[]``
ga: ''dúbailte[]''
ta: `` இரட்டை [] ``

source: ``PackedStringArray``
ga: ''PacáilteStringArray''
ta: `` பேக்ச்ட்ரிங்அரே``

source: ``string[]``
ga: ''teaghrán[]''
ta: `` சரம் [] ``

source: ``PackedVector2Array``
ga: ''PacáilteVector2Array''
ta: `` Packedvecter2Array``

source: ``Vector2[]``
ga: ''Veicteoir2[]''
ta: `` வெக்டர் 2 [] ``

source: ``PackedVector3Array``
ga: ''PacáilteVector3Array''
ta: `` பேக் செய்யப்பட்ட வெக்டர் 3 வரிசை``

source: ``Vector3[]``
ga: ''Veicteoir3[]''
ta: `` வெக்டர் 3 [] ``

source: ``PackedColorArray``
ga: ""PacáilteColorArray"
ta: `` பேக்அலோரர்``

source: ``Color[]``
ga: ''Dath[]''
ta: `` வண்ணம் [] ``

source: Other C# arrays are not supported by the Godot C# API since a packed array equivalent does not exist. See the list of :ref:`c_sharp_variant_compatible_types`.
ga: Ní thacaíonn API Godot C # le heagair C # eile ós rud é nach bhfuil coibhéis eagar pacáilte ann. Féach an liosta :ref:'c_sharp_variant_compatible_types'.
ta: பிற சி# வரிசைகள் கோடோட் சி# பநிஇ ஆதரிக்கவில்லை, ஏனெனில் நிரம்பிய வரிசை சமமானதாக இல்லை. பட்டியலைக் காண்க: ref: `c_sharp_variant_compatible_types`.

source: Array
ga: eagar
ta: வரிசை

source: Godot arrays are implemented as an array of ``Variant`` and can contain several elements of any type. In C#, the equivalent type is ``Godot.Collections.Array``.
ga: Cuirtear eagar Godot i bhfeidhm mar shraith de ''Variant'' agus is féidir roinnt gnéithe d'aon chineál a bheith iontu. In C#, is é an cineál coibhéiseach ná ''Godot.Collections.Array''.
ta: கோடோட் வரிசைகள் `` மாறுபாடு`` வரிசையாக செயல்படுத்தப்படுகின்றன, மேலும் எந்தவொரு வகையிலும் பல கூறுகளைக் கொண்டிருக்கலாம். சி#இல், சமமான வகை `` கோடோட்.கோலெக்சன்ச்.ஆரே``.

source: The generic ``Godot.Collections.Array<T>`` type allows restricting the element type to a :ref:`Variant-compatible type <c_sharp_variant_compatible_types>`.
ga: Ceadaíonn an cineál cineálach ``Godot.Collections.Array<T>`` an cineál eiliminte a shrianadh go :ref:`Cineál a oireann d'athróg <c_sharp_variant_compatible_types>`.
ta: பொதுவான `` kudot.collections.array <t> `` வகை உறுப்பு வகையை A க்கு கட்டுப்படுத்த அனுமதிக்கிறது: குறிப்பு: `மாறுபாடு-இணக்கமான வகை <c_sharp_variant_compatible_types>`.

source: An untyped ``Godot.Collections.Array`` can be converted to a typed array using the ``Godot.Collections.Array<T>(Godot.Collections.Array)`` constructor.
ga: Is féidir ``Godot.Collections.Array`` neamhchlóscríofa a thiontú go eagar clóscríofa ag baint úsáide as an cruthaitheoir ``Godot.Collections.Array<T>(Godot.Collections.Array)``.
ta: `` Kutot.collections.array <t> (godot.collections.array) `` கட்டமைப்பாளரைப் பயன்படுத்தி தட்டச்சு செய்யப்பட்ட வரிசைக்கு மாற்றலாம்.

source: Despite the name, Godot arrays are more similar to the C# collection ``List<T>`` than ``System.Array``. Their size is not fixed and can grow or shrink as elements are added/removed from the collection.
ga: In ainneoin an ainm, tá eagair Godot níos cosúla le bailiúchán C# ``List<T>`` ná ``System.Eagar``. Níl a méid socraithe agus féadann siad fás nó crapadh de réir mar a chuirtear nó baintear gnéithe den bhailiúchán.
ta: பெயர் இருந்தபோதிலும், கோடோட் வரிசைகள் சி# தொகுப்புக்கு `` பட்டியல் <T> `` `` system.array`` ஐ விட ஒத்தவை. அவற்றின் அளவு சரி செய்யப்படவில்லை மற்றும் சேகரிப்பிலிருந்து கூறுகள் சேர்க்கப்படுவதால்/அகற்றப்படுவதால் வளரலாம் அல்லது சுருங்கலாம்.

source: List of Godot's Array methods and their equivalent in C#:
ga: Liosta de mhodhanna Eagar Godot agus a gcoibhéis i C #:
ta: கோடோட்டின் வரிசை முறைகளின் பட்டியல் மற்றும் அவற்றின் சமமான சி#இல்:

source: all
ga: go léir
ta: அனைத்தும்

source: any
ga: aon
ta: ஏதேனும்

source: append
ga: iarcheangail
ta: பிற்சேர்

source: Add
ga: Cuir Leis
ta: கூட்டு

source: AddRange
ga: CuirRange Leis

source: assign
ga: a shannadh
ta: ஒதுக்க

source: Clear and AddRange
ga: Glan agus AddRange
ta: தெளிவான மற்றும் அட்ரேஞ்ச்

source: back
ga: ar ais
ta: பின்

source: ``Array[^1]`` or `System.Linq.Enumerable.Last`_ or `System.Linq.Enumerable.LastOrDefault`_
ga: ''Array[^1]'' nó 'System.Linq.Enumerable.Last'_ nó 'System.Linq.Enumerable.LastOrDefault'_
ta: `` வரிசை [^1] `` அல்லது `system.linq.enumerable.last`_ அல்லது` system.linq.enumerable.lastordefault`_

source: bsearch
ga: BsearchGenericName

source: BinarySearch
ga: DénárthaSearch
ta: பைனரி தேடல்

source: bsearch_custom
ga: bsearch_saincheaptha

source: clear
ga: soiléir
ta: தெளிவான

source: Clear
ga: Glan
ta: தெளிவான

source: count
ga: comhaireamh
ta: எண்ணுங்கள்

source: duplicate
ga: dúblach
ta: நகல்

source: Duplicate
ga: Dúblach
ta: நகல்

source: erase
ga: léirscrios
ta: அழிக்கவும்

source: Remove
ga: Bain
ta: அகற்று

source: fill
ga: líon
ta: நிரப்பவும்

source: Fill
ga: Líon
ta: நிரப்பவும்

source: filter
ga: scagaire
ta: வடிப்பி

source: Use `System.Linq.Enumerable.Where`_
ga: Úsáid 'System.Linq.Enumerable.Where'_
ta: `System.linq.enumerable.where`_ ஐப் பயன்படுத்தவும்

source: find
ga: aimsigh
ta: கண்டுபிடி

source: IndexOf
ga: InnéacsOf
ta: குறியீட்டு

source: front
ga: Tosaigh
ta: முன்

source: ``Array[0]`` or `System.Linq.Enumerable.First`_ or `System.Linq.Enumerable.FirstOrDefault`_
ga: ''Array[0]'' nó 'System.Linq.Enumerable.First'_ nó 'System.Linq.Enumerable.FirstOrDefault'_
ta: `` வரிசை [0] `` அல்லது `system.linq.enumerable.first`_ அல்லது` system.linq.enumerable.firstordefault`_

source: has
ga: tar éis
ta: உள்ளது

source: Contains
ga: Tá
ta: கொண்டுள்ளது

source: hash
ga: hais
ta: ஆச்

source: GD.Hash
ga: GD. HashName

source: insert
ga: ionsáigh
ta: செருகவும்

source: Insert
ga: Ionsáigh
ta: செருகவும்

source: is_empty
ga: Tá sé folamh

source: Use ``Count == 0``
ga: Úsáid ''Líon == 0''
ta: `` எண்ணுங்கள் == 0`` ஐப் பயன்படுத்தவும்

source: is_read_only
ga: Is léamhaí_amháin

source: is_same_typed
ga: Is é an gcéann_clóscríobh

source: is_typed
ga: Tá _clóscríofa

source: make_read_only
ga: déanaim_léamhaí_amháin

source: map
ga: léarscáil
ta: வரைபடம்

source: max
ga: uasmhéid
ta: அதிகபட்சம்

source: Max
ga: Uasmhéid
ta: அதிகபட்சம்

source: min
ga: nóim
ta: மணித்துளி

source: pick_random
ga: pic_random
ta: பிக்_ராண்டம்

source: PickRandom (Consider using `System.Random`_)
ga: PickRandom (Smaoinigh ar 'System.Random' a úsáid_)
ta: பிக்ராண்டம் (`System.random`_ ஐப் பயன்படுத்துவதைக் கவனியுங்கள்)

source: ``Array[i]`` with ``RemoveAt(i)``
ga: ''Array[i]'' le ''RemoveAt(i)''
ta: `` வரிசை [i] `` `` நீக்குதல் (i) `` உடன்

source: ``Array[^1]`` with ``RemoveAt(Count - 1)``
ga: ''Array[^1]'' le ''RemoveAt(Count - 1)''
ta: `` வரிசை [^1] `` `` நீக்குதல் (எண்ணிக்கை - 1) `` உடன்

source: ``Array[0]`` with ``RemoveAt(0)``
ga: ''Array[0]'' le ''RemoveAt(0)''
ta: `` வரிசை [0] `` `` நீக்குதல் (0) `` உடன்

source: push_back
ga: brú ar ais
ta: புச்_பேக்

source: ``Insert(Count, item)``
ga: ''Cuir isteach(Comhaireamh, mír)''
ta: `` செருகவும் (எண்ணுங்கள், உருப்படி) ``

source: ``Insert(0, item)``
ga: ''Cuir isteach(0, mír)''
ta: `` செருகவும் (0, உருப்படி) ``

source: reduce
ga: laghdú
ta: குறைக்க

source: RemoveAt
ga: BainAtName
ta: நீக்குதல்

source: resize
ga: athraigh méid an mhéid
ta: மறுஅளவிடுங்கள்

source: Resize
ga: Athraigh méid an mhéid
ta: மறுஅளவிடுங்கள்

source: reverse
ga: droim ar ais
ta: தலைகீழ்

source: Reverse
ga: Droim ar ais
ta: தலைகீழ்

source: rfind
ga: rfindName

source: shuffle
ga: suaitheadh
ta: கலக்கு

source: Shuffle
ga: Suaitheadh
ta: கலக்கு

source: size
ga: méid
ta: அளவு

source: Count
ga: Comhaireamh
ta: எண்ணுங்கள்

source: slice
ga: slisne
ta: துண்டு

source: Slice
ga: SliceName
ta: துண்டு

source: sort
ga: sórtáil
ta: வரிசைப்படுத்து

source: Sort
ga: Sórtáil
ta: வரிசைப்படுத்து

source: sort_custom
ga: sort_saincheaptha

source: operator !=
ga: oibreoir !=
ta: ஆபரேட்டர்! =

source: !RecursiveEqual
ga: ! AthchúrsaEqual
ta: ! ReceVevequal

source: operator +
ga: oibreoir +
ta: ஆபரேட்டர் +

source: operator <
ga: oibreoir <
ta: ஆபரேட்டர் <

source: operator <=
ga: oibreoir <=
ta: ஆபரேட்டர் <=

source: operator ==
ga: oibreoir ==
ta: ஆபரேட்டர் ==

source: RecursiveEqual
ga: AthchúrsaEqual
ta: Recurciveequal

source: operator >
ga: oibreoir >
ta: ஆபரேட்டர்>

source: operator >=
ga: oibreoir >=
ta: ஆபரேட்டர்> =

source: operator []
ga: oibreoir []
ta: ஆபரேட்டர் []

source: Array[int] indexer
ga: Eagar[int] innéacsóir
ta: வரிசை [int] indexer

source: Dictionary
ga: Foclóir
ta: அகராதி

source: Godot dictionaries are implemented as a dictionary with ``Variant`` keys and values. In C#, the equivalent type is ``Godot.Collections.Dictionary``.
ga: Cuirtear foclóirí Godot i bhfeidhm mar fhoclóir le heochracha agus luachanna ''Malairt''. In C#, is é an cineál coibhéiseach ná ''Godot.Collections.Dictionary''.
ta: கோடோட் அகராதிகள் `` மாறுபாடு` விசைகள் மற்றும் மதிப்புகளுடன் ஒரு அகராதியாக செயல்படுத்தப்படுகின்றன. சி#இல், சமமான வகை `` கோடோட்.கோலெக்சன்ச்.கோலெக்சனல்.

source: The generic ``Godot.Collections.Dictionary<TKey, TValue>`` type allows restricting the key and value types to a :ref:`Variant-compatible type <c_sharp_variant_compatible_types>`.
ga: Ceadaíonn an cineál cineálach ``Godot.Collections.Dictionary<TKey, TValue>`` na cineálacha eochrach agus luacha a shrianadh go :ref:`Cineál a oireann d'athróg <c_sharp_variant_compatible_types>`.
ta: பொதுவான `` கோடோட்.

source: An untyped ``Godot.Collections.Dictionary`` can be converted to a typed dictionary using the ``Godot.Collections.Dictionary<TKey, TValue>(Godot.Collections.Dictionary)`` constructor.
ga: Is féidir ``Godot.Collections.Dictionary`` neamhchlóscríofa a thiontú go foclóir clóscríofa agus an cruthaitheoir `` Godot.Collections.Dictionary <TKey, TValue>(Godot.Collections.Dictionary)`` in úsáid agat.
ta: `` கோடோட்.கோலெக்சன்ச்.கோலெக்சனைப் பயன்படுத்தி ஒரு தட்டச்சு செய்யப்பட்ட அகராதியாக மாற்றப்படலாம் `` கோடோட்.

source: If you need a dictionary where the key is typed but not the value, use ``Variant`` as the ``TValue`` generic parameter of the typed dictionary.
ga: Má theastaíonn foclóir uait ina bhfuil an eochair clóscríofa ach nach bhfuil an luach leis, bain úsáid as ''Malairt'' mar pharaiméadar cineálach ''TValue'' den fhoclóir clóscríofa.
ta: விசை தட்டச்சு செய்யப்படும் ஆனால் மதிப்பு அல்ல, உங்களுக்கு ஒரு அகராதி தேவைப்பட்டால், தட்டச்சு செய்யப்பட்ட அகராதியின் `` tvalue`` பொதுவான அளவுருவாக `` மாறுபாடு` ஐப் பயன்படுத்தவும்.

source: List of Godot's Dictionary methods and their equivalent in C#:
ga: Liosta de mhodhanna Foclóir Godot agus a gcoibhéis i C #:
ta: கோடோட்டின் அகராதி முறைகளின் பட்டியல் மற்றும் அவர்களுக்கு சமமான சி#:

source: find_key
ga: eochair aimsigh

source: get
ga: a fháil
ta: கிடைக்கும்

source: Dictionary[Variant] indexer or TryGetValue
ga: Innéacsóir Foclóir[Malairt] nó TryGetValue
ta: அகராதி [மாறுபாடு] குறியீட்டாளர் அல்லது முயற்சி

source: ContainsKey
ga: TáKey ann
ta: கிடென்சிச்கி

source: has_all
ga: tá uile aige

source: keys
ga: Eochracha
ta: விசைகள்

source: Keys
ga: Eochracha
ta: விசைகள்

source: merge
ga: cumaisc
ta: ஒன்றிணைக்கவும்

source: Merge
ga: Cumaisc
ta: ஒன்றிணைக்கவும்

source: values
ga: luachanna
ta: மதிப்புகள்

source: Values
ga: Luachanna
ta: மதிப்புகள்

source: Dictionary[Variant] indexer, Add or TryGetValue
ga: Innéacsóir Foclóir[Malairt], Cuir nó TryGetValue
ta: அகராதி [மாறுபாடு] குறியீட்டாளர், சேர் அல்லது முயற்சிக்கவும்

source: C#
ta: சி#

source: ``PackedFloat32Array``
ta: `` பேக்ஃப்ளோட் 32ARRAY``

source: `System.Linq.Enumerable.Any`_
ta: `System.linq.enumerable.nan`_

source: N/A
ta: இதற்கில்லை

source: MakeReadOnly
ta: Makekereadnly

source: Min
ta: மணித்துளி

source: pop_front
ta: பாப்_பிரண்ட்

source: push_front
ta: புச்_பிரண்ட்

source: `System.Linq.Enumerable.Aggregate`_
ta: `System.linq.enumerable.agugle`_

source: remove_at
ta: remive_at
