Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_basics.po
Languages: ga, it, ja, pl, ru, ta, uk, zh_tw

source: The workaround is simple: retrieve the entire struct, modify the value you want to modify, and reassign the property.
ga: Tá an réiteach simplí: aisghabháil an struchtúr iomlán, modhnaigh an luach is mian leat a mhodhnú, agus an maoin a athshannadh.
it: La soluzione alternativa è semplice: recuperare l'intera struttura, modificare il valore che si desidera modificare e riassegnare la proprietà.
ja: 回避策は簡単です。構造体全体を取得し、変更したい値を変更して、プロパティへ再代入します。
ru: Обходной путь прост: извлеките всю структуру, измените значение, которое вы хотите изменить, и переназначьте свойство.
ta: பணித்தொகுப்பு எளிதானது: முழு கட்டமைப்பையும் மீட்டெடுக்கவும், நீங்கள் மாற்ற விரும்பும் மதிப்பை மாற்றவும், சொத்தை மீண்டும் இணைக்கவும்.
uk: Обхід простий: отримайте всю структуру, змініть значення, яке потрібно змінити, і повторно призначте властивість.
zh_tw: 解法很簡單：先取出整個結構，修改所需值後，再把整個結構重新指定回屬性。

source: Since C# 10, it is also possible to use `with expressions <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/operators/with-expression>`_ on structs, allowing you to do the same thing in a single line.
ga: Ós rud é C# 10, is féidir freisin `_ a úsáid le habairtí <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/operators/with-expression>`_ ar structs, rud a ligeann duit déan an rud céanna i líne amháin.
it: A partire da C# 10, è anche possibile utilizzare le `espressioni with <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/operators/with-expression>`_ sulle strutture, consentendo di fare la stessa cosa su una sola riga.
ja: C# 10 以降では、構造体に対して `with式 <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/operators/with-expression>`_ を使用することも可能になり、同じことを1行で実行できるようになりました。
ru: Начиная с C# 10, можно также использовать `with выражения <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/operators/with-expression>`_ в структурах, что позволяет делать то же самое в одной строке.
ta: சி# 10 என்பதால், `வெளிப்பாடுகளுடன் <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/operators/with-expression>` _ ஒரே மாதிரியை ஒரே வரியில் செய்யுங்கள்.
uk: Починаючи з C# 10, також можна використовувати `with expressions <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/operators/with-expression>`_ на структурах, дозволяючи вам зробити те саме в одному рядку.
zh_tw: 自 C# 10 起，也可以在結構上使用 `with 運算式 <https://learn.microsoft.com/zh-tw/dotnet/csharp/language-reference/operators/with-expression>`_，讓上述操作一行完成。

source: You can read more about this error on the `C# language reference <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/compiler-messages/cs1612>`_.
ga: Is féidir leat tuilleadh a léamh faoin earráid seo ar an tagairt teanga `C# <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/compiler-messages/cs1612>`_.
it: Per leggerne di più su questo errore, consultare la `Guida di riferimento al linguaggio C# <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/compiler-messages/cs1612>`_.
ja: このエラーの詳細については、`C# 言語リファレンス <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/compiler-messages/cs1612>`_ を参照してください。
ru: Подробнее об этой ошибке можно прочитать в `Справочнике по языку C# <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/compiler-messages/cs1612>`_.
ta: இந்த பிழையைப் பற்றி `சி# மொழி குறிப்பு <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/compiler-messages/cs1612>` _.
uk: Ви можете прочитати більше про цю помилку в `довіднику з мови C# <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/compiler-messages/cs1612>`_.
zh_tw: 你可在 `C# 語言參考 <https://learn.microsoft.com/zh-tw/dotnet/csharp/language-reference/compiler-messages/cs1612>`_ 了解更多關於此錯誤的資訊。

source: Performance of C# in Godot
ga: Feidhmíocht C # i Godot
it: Prestazioni di C# in Godot
ja: GodotにおけるC#のパフォーマンス
pl: Wydajność C# w Godot
ru: Производительность C# в Godot
ta: கோடோட்டில் சி# இன் செயல்திறன்
uk: Продуктивність C# у Godot
zh_tw: Godot 的 C# 效能

source: For a performance comparison of the languages Godot supports, see :ref:`doc_faq_which_programming_language_is_fastest`.
it: Per un confronto delle prestazioni dei linguaggi supportati da Godot, consultare :ref:`doc_faq_which_programming_language_is_fastest`.
ru: Сравнение производительности языков, поддерживаемых Godot, см. в разделе :ref:`doc_faq_which_programming_language_is_fastest`.
ta: கோடோட் ஆதரிக்கும் மொழிகளின் செயல்திறன் ஒப்பீட்டிற்கு, காண்க: குறிப்பு: `doc_faq_which_programming_language_is_fastest`.
uk: Для порівняння продуктивності мов, які підтримує Godot, див. :ref:`doc_faq_which_programming_language_is_fastest`.
zh_tw: 關於 Godot 支援語言的效能比較，請參考 :ref:`doc_faq_which_programming_language_is_fastest`。

source: Most properties of Godot C# objects that are based on ``GodotObject`` (e.g. any ``Node`` like ``Control`` or ``Node3D`` like ``Camera3D``) require native (interop) calls as they talk to Godot's C++ core. Consider assigning values of such properties into a local variable if you need to modify or read them multiple times at a single code location:
ga: Éilíonn an chuid is mó de na hairíonna de réada Godot C # atá bunaithe ar ''GodotObject'' (m.sh. aon ''Node'' cosúil le ''Control'' nó ''Node3D'' cosúil le ''Camera3D'') glaonna dúchasacha (interop) agus iad ag caint le croí C ++ Godot. Smaoinigh ar luachanna maoine den sórt sin a shannadh isteach in athróg áitiúil más gá duit iad a mhodhnú nó a léamh arís agus arís eile ag suíomh cód amháin:
it: La maggior parte delle proprietà degli oggetti C# di Godot basati su ``GodotObject`` (ad esempio, qualsiasi ``Node`` come ``Control`` o ``Node3D`` come ``Camera3D``) richiedono chiamate native (interop) per comunicare con il core C++ di Godot. Si consiglia di assegnare i valori di tali proprietà a una variabile locale se è necessario modificarle o leggerle più volte in un'unica sezione di codice:
ja: ``GodotObject`` に基づく Godot C# オブジェクトのほとんどのプロパティ (例: ``Control`` のような ``Node`` や ``Camera3D`` のような ``Node3D``) は、Godot の C++ コアと通信するため、ネイティブ (interop) 呼び出しが必要です。単一のコード中にプロパティを複数回変更または読み取る必要がある場合は、そのようなプロパティの値はローカル変数に一時的に代入することを検討してください。
ru: Большинство свойств объектов Godot C#, основанных на ``GodotObject`` (например, любой ``Node``, например ``Control``, или ``Node3D``, например ``Camera3D``), требуют собственных (interop) вызовов при взаимодействии с ядром Godot C++. Рассмотрите возможность присвоения значений таких свойств локальной переменной, если вам нужно изменять или считывать их несколько раз в одном месте кода:
ta: கோடோட் சி# பொருள்களின் பெரும்பாலான பண்புகள் `` கோடோடோப்செக்ட்`` (எ.கா.. கோடோட்டின் சி ++ மையத்துடன் பேசுங்கள். ஒற்றை குறியீடு இருப்பிடத்தில் பல முறை மாற்றியமைக்க அல்லது படிக்க வேண்டுமானால், அத்தகைய பண்புகளின் மதிப்புகளை உள்ளக மாறியில் ஒதுக்குவதைக் கவனியுங்கள்:
uk: Більшість властивостей об’єктів Godot C#, які базуються на ``GodotObject`` (наприклад, будь-який ``Node``, як-от ``Control`` або ``Node3D``, як-от ``Camera3D``), потребують власних викликів (взаємодія), оскільки вони поговорити з ядром C++ Godot. Розгляньте можливість призначення значень таких властивостей локальній змінній, якщо вам потрібно змінити або прочитати їх кілька разів в одному місці коду:
zh_tw: 大多數繼承自 ``GodotObject`` 的 C# 物件屬性（如 ``Control``、``Camera3D`` 等節點），在存取時都需與 Godot C++ 核心進行互操作（interop）呼叫。如果你需要重複存取或修改同一屬性，建議先存到區域變數再操作：

source: Passing raw arrays (such as ``byte[]``) or ``string`` to Godot's C# API requires marshalling which is comparatively pricey.
ga: Chun eagar amh a rith (mar shampla ''byte[]'') nó ''string'' chuig API C# Godot, ní mór é sin a dhéanamh ar phraghas réasúnta.
it: Il passaggio di array grezzi (come ``byte[]``) o ``string`` all'API di C# in Godot richiede il marshalling, che è relativamente costoso.
ja: 生の配列 (``byte[]`` など) または ``string`` を Godot の C# API に渡すには、比較的コストのかかるマーシャリングが必要です。
ru: Передача необработанных массивов (таких как ``byte[]``) или ``string`` в C# API Godot требует маршалинга, который является сравнительно затратным.
ta: மூல வரிசைகளை கடந்து செல்வது (`` பைட் [] ``) அல்லது `` சரம்` போன்றவை கோடோட்டின் சி# ஏபிஐக்கு ஒப்பீட்டளவில் விலைமதிப்பற்ற மார்சலிங் தேவைப்படுகிறது.
uk: Передача необроблених масивів (таких як ``byte[]``) або ``string`` до C# API Godot вимагає маршалінгу, який є порівняно дорогим.
zh_tw: 將原生陣列（如 ``byte[]``）或 ``string`` 傳遞給 Godot 的 C# API 時，會經過封送處理（marshalling），效能開銷較大。

source: The implicit conversion from ``string`` to ``NodePath`` or ``StringName`` incur both the native interop and marshalling costs as the ``string`` has to be marshalled and passed to the respective native constructor.
ga: Tabhaíonn an tiontú intuigthe ó ''string'' go ''NodePath'' nó ''StringName'' na costais dhúchasacha agus marshalling araon mar go gcaithfear an ''teaghrán'' a chur ar aghaidh chuig an tógálaí dúchasach faoi seach.
ja: ``string`` から ``NodePath`` または ``StringName`` への暗黙的な変換では、 ``string`` をマーシャリングしてそれぞれのネイティブコンストラクターに渡す必要があるため、ネイティブinteropとマーシャリングの両方のコストが発生します。
ru: Неявное преобразование из ``string`` в ``NodePath`` или ``StringName`` влечет за собой затраты как на собственное взаимодействие, так и на маршалинг, поскольку ``string`` необходимо маршалировать и передавать соответствующему собственному конструктору.
ta: `` சரம்`` முதல் `` nodepath`` அல்லது `` சரம் பெயர்` ஆகியவற்றிற்கு மறைமுகமாக மாற்றுவது பூர்வீக இடைமறிப்பு மற்றும் மார்சலிங் செலவுகளை `` சரம்`` என மாற்ற வேண்டும்.
uk: Неявне перетворення з ``string`` на ``NodePath`` або ``StringName`` спричиняє витрати як на власне взаємодія, так і на маршалінг, оскільки ``string`` потрібно маршалізувати та передати відповідному рідному конструктору.
zh_tw: 將 ``string`` 隱式轉換為 ``NodePath`` 或 ``StringName`` 時，會同時產生互操作與資料封送的效能損耗，因為字串需封送並傳給原生建構函式。

source: Using NuGet packages in Godot
ga: Ag baint úsáide as pacáistí NuGet i Godot
it: Utilizzare i pacchetti NuGet in Godot
ja: GodotでのNuGetパッケージの使用
ru: Использование пакетов NuGet в Godot
ta: கோடோட்டில் நுசெட் தொகுப்புகளைப் பயன்படுத்துதல்
uk: Використання пакетів Nuget у Godot
zh_tw: 在 Godot 使用 NuGet 套件

source: `NuGet <https://www.nuget.org/>`_ packages can be installed and used with Godot, as with any C# project. Many IDEs are able to add packages directly. They can also be added manually by adding the package reference in the ``.csproj`` file located in the project root:
ga: Is féidir pacáistí `NuGet <https://www.nuget.org/>`_ a shuiteáil agus a úsáid le Godot, mar atá le haon tionscadal C#. Tá go leor IDEanna in ann pacáistí a chur leis go díreach. Is féidir iad a chur leis de láimh freisin tríd an tagairt pacáiste a chur leis sa chomhad ``.csproj`` atá suite i bhfréamh an tionscadail:
it: I pacchetti `NuGet <https://www.nuget.org/>`_ possono essere installati e utilizzati con Godot, come con qualsiasi progetto C#. Molti IDE sono in grado di aggiungere pacchetti direttamente. Si possono anche aggiungere manualmente inserendo il riferimento al pacchetto nel file ``.csproj`` situato nella radice del progetto:
ja: `NuGet <https://www.nuget.org/>` パッケージは、他のC#プロジェクトと同様に、Godotでインストールおよび使用できます。多くのIDEは、パッケージを直接追加できます。プロジェクトのルートにある ``.csproj`` ファイルにパッケージ参照を追加することにより、手動で追加することもできます:
ru: `NuGet <https://www.nuget.org/>`_ пакеты могут быть установлены и использованы вместе с Godot, как и в любом другом C# проекте. Множество IDE способны добавлять пакеты напрямую. Если необходимо, вы можете добавить их вручную, добавив ссылку на пакет в ``.csproj`` файл, который расположен в корне проекта:
ta: `Nuget <https://www.nuget.org/>` _ தொகுப்புகளை எந்தவொரு சி# திட்டத்தையும் போலவே கோடோட்டுடன் நிறுவி பயன்படுத்தலாம். பல ஐடிஇக்கள் நேரடியாக தொகுப்புகளைச் சேர்க்க முடியும். திட்ட மூலத்தில் அமைந்துள்ள `` .csproj`` கோப்பில் தொகுப்பு குறிப்பைச் சேர்ப்பதன் மூலம் அவற்றைச் சேர்க்கலாம்:
uk: Пакети `NuGet <https://www.nuget.org/>`_ можна встановлювати та використовувати з Godot, як і будь-який проєкт C#. Багато IDE можуть додавати пакети безпосередньо. Їх також можна додати вручну, додавши посилання на пакет у файл ``.csproj``, що знаходиться в корені проєкту:
zh_tw: 你可以像一般 C# 專案一樣，在 Godot 中安裝並使用 `NuGet <https://www.nuget.org/>`_ 套件。多數 IDE 支援直接加入套件，也可手動於專案根目錄的 ``.csproj`` 檔案中加入套件參考：

source: As of Godot 3.2.3, Godot automatically downloads and sets up newly added NuGet packages the next time it builds the project.
ga: Amhail Godot 3.2.3, déanann Godot pacáistí NuGet nua-bhreise a íoslódáil agus a chur ar bun go huathoibríoch an chéad uair eile a thógann sé an tionscadal.
it: A partire dalla versione Godot 3.2.3, Godot scarica e installa automaticamente i nuovi pacchetti NuGet aggiunti la prossima volta che compila il progetto.
ja: Godot 3.2.3 以降では、Godot は次回プロジェクトをビルドするときに、新しく追加された NuGet パッケージを自動的にダウンロードして設定します。
ta: கோடோட் 3.2.3 இன் படி, கோடோட் தானாகவே பதிவிறக்கம் செய்து புதிதாக சேர்க்கப்பட்ட நுசெட் தொகுப்புகளை அடுத்த முறை திட்டத்தை உருவாக்கும் போது அமைக்கிறது.
uk: Від Godot 3.2.3, Godot автоматично завантажує та налаштовує нещодавно додані пакети NuGet під час наступного створення проєкту.
zh_tw: 自 Godot 3.2.3 起，Godot 會在下次建置專案時自動下載並設定新增的 NuGet 套件。

source: Profiling your C# code
ga: Próifíliú do chód C #
it: Profilazione del codice C#
ja: C#コードのプロファイリング
ru: Профилирование вашего C# кода
ta: உங்கள் சி# குறியீட்டை விவரக்குறிப்பு
uk: Профілювання коду C #
zh_tw: C# 程式碼效能剖析

source: The following tools may be used for performance and memory profiling of your managed code:
ga: Is féidir na huirlisí seo a leanas a úsáid le haghaidh próifíliú feidhmíochta agus cuimhne ar do chód bainistithe:
it: Per la profilazione delle prestazioni e della memoria del codice gestito, è possibile utilizzare i seguenti strumenti:
ja: マネージドコードのパフォーマンスとメモリのプロファイリングには、次のツールを使用できます。
ru: Для профилирования производительности и памяти управляемого кода можно использовать следующие инструменты:
ta: உங்கள் நிர்வகிக்கப்பட்ட குறியீட்டின் செயல்திறன் மற்றும் நினைவக விவரக்குறிப்புக்கு பின்வரும் கருவிகள் பயன்படுத்தப்படலாம்:
uk: Для профілювання продуктивності та пам’яті вашого керованого коду можна використовувати такі інструменти:
zh_tw: 你可使用下列工具分析受控（managed）程式碼的效能與記憶體：

source: JetBrains Rider with dotTrace/dotMemory plugin.
ga: JetBrains Rider le dotTrace / dotMemory breiseán.
it: JetBrains Rider con l'estensione dotTrace/dotMemory.
ja: dotTrace/dotMemory プラグインを備えた JetBrains Rider。
ru: JetBrains Rider с плагином dotTrace/dotMemory.
ta: டாட்ரேச்/டாட்மெமரி சொருகி கொண்ட செட் பிரைன்ச் சவாரி.
uk: JetBrains Rider із плагіном dotTrace/dotMemory.
zh_tw: JetBrains Rider，搭配 dotTrace/dotMemory 外掛。

source: Standalone JetBrains dotTrace/dotMemory.
ga: JetBrains Neamhspleách dotTrace / dotMemory.
it: JetBrains dotTrace/dotMemory autonomo.
ja: スタンドアロンの JetBrains dotTrace/dotMemory。
ru: Автономный JetBrains dotTrace/dotMemory.
ta: முழுமையான செட் பிரைன்ச் டாட்ரேச்/டாட்மெமோரி.
uk: Автономний JetBrains dotTrace/dotMemory.
zh_tw: 獨立版 JetBrains dotTrace/dotMemory。

source: Visual Studio.
ga: Stiúideo Amhairc.
ta: விசுவல் ச்டுடியோ.
uk: Візуальна Studio.

source: Profiling managed and unmanaged code at once is possible with both JetBrains tools and Visual Studio, but limited to Windows.
ga: Is féidir cód bainistithe agus neamhbhainistithe a phróifíliú ag an am céanna le huirlisí JetBrains agus Visual Studio araon, ach teoranta do Windows.
ja: マネージドコードとアンマネージドコードを一度にプロファイリングすることは、JetBrains ツールと Visual Studio の両方で可能ですが、Windows に限定されます。
ru: Одновременное профилирование управляемого и неуправляемого кода возможно как с помощью инструментов JetBrains, так и с помощью Visual Studio, но ограничено Windows.
ta: செட் பிரைன்ச் கருவிகள் மற்றும் விசுவல் ச்டுடியோ இரண்டிலும் ஒரே நேரத்தில் நிர்வகிக்கப்பட்ட மற்றும் நிர்வகிக்கப்படாத குறியீட்டை விவரக்குறிப்பு சாத்தியமாகும், ஆனால் விண்டோசுக்கு மட்டுப்படுத்தப்பட்டுள்ளது.
uk: Профілювання керованого та некерованого коду одночасно можливе за допомогою інструментів JetBrains і Visual Studio, але обмежено Windows.
zh_tw: JetBrains 工具與 Visual Studio 均可同時剖析受控與非受控程式碼，但僅支援 Windows。

source: C# support in Godot's built-in script editor is minimal. Consider using an external IDE or editor, such as `Visual Studio Code <https://code.visualstudio.com/>`__ or `Visual Studio <https://visualstudio.microsoft.com/>`__. These provide autocompletion, debugging, and other useful features for C#. To select an external editor in Godot, click on **Editor → Editor Settings** and scroll down to **Dotnet**. Under **Dotnet**, click on **Editor**, and select your external editor of choice. Godot currently supports the following external editors:
ru: Поддержка C# во встроенном редакторе скриптов Godot минимальна. Рассмотрите возможность использования внешней IDE или редактора, например, `Visual Studio Code <https://code.visualstudio.com/>`__ или `Visual Studio <https://visualstudio.microsoft.com/>`__. Они обеспечивают автодополнение, отладку и другие полезные функции для C#. Чтобы выбрать внешний редактор в Godot, нажмите **Editor → Editor Settings** и прокрутите вниз до **Dotnet**. В разделе **Dotnet** нажмите **Editor** и выберите нужный внешний редактор. В настоящее время Godot поддерживает следующие внешние редакторы:

source: C# is a high-level programming language developed by Microsoft. In Godot, it is implemented with .NET 6.0.
ja: C# は Microsoft が開発した高水準プログラミング言語です。Godot では .NET 6.0 を使用して実装されています。

source: C# support in Godot's built-in script editor is minimal. Consider using an external IDE or editor, such as `Visual Studio Code <https://code.visualstudio.com/>`__ or MonoDevelop. These provide autocompletion, debugging, and other useful features for C#. To select an external editor in Godot, click on **Editor → Editor Settings** and scroll down to **Dotnet**. Under **Dotnet**, click on **Editor**, and select your external editor of choice. Godot currently supports the following external editors:
ja: Godot の組み込みスクリプト エディタでの C# のサポートは最小限です。`Visual Studio Code <https://code.visualstudio.com/>`__ や MonoDevelop などの外部 IDE またはエディターの使用を検討してください。これらは C# の自動補完、デバッグ、およびその他の便利な機能を提供します。Godot で外部エディタを選択するには、**[エディター] → [エディター設定]** をクリックし、**[.NET]** までスクロールします。**[.NET]** の下で、**[エディター]** をクリックし、External Editorを選択します。Godot は現在、次の外部エディタをサポートしています。

source: Translation status
pl: Status tłumaczenia
