Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_exports.po
Languages: ga, it, ko, ru, ta, uk, zh_cn, zh_tw

source: Members whose type is an enum with the ``[Flags]`` attribute can be exported and their values are limited to the members of the enum type. The editor will create a widget in the Inspector, allowing to select none, one, or multiple of the enum members. The value will be stored as an integer.
ga: Is féidir baill a bhfuil a gcineál enum leis an tréith ''[Bratacha]'' a onnmhairiú agus tá a luachanna teoranta do bhaill an chineáil enum. Cruthóidh an t-eagarthóir giuirléid sa Chigire, rud a ligfidh d'aon duine, duine amháin, nó níos mó de na baill enum a roghnú. Stórálfar an luach mar shlánuimhir.
it: È possibile esportare i membri il cui tipo è un enumerazione con l'attributo ``[Flags]`` e i loro valori sono limitati ai membri dell'enumerazione. L'editor creerà un widget nell'Ispettore, consentendo di selezionare nessuno, uno o più membri dell'enumerazione. Il valore sarà memorizzato come numero intero.
ru: Элементы типа enum с атрибутом ``[Flags]`` можно экспортировать, и их значения ограничены элементами типа enum. Редактор создаст виджет в Инспекторе, позволяющий выбрать один или несколько элементов enum, а также ни одного. Значение будет сохранено как целое число.
ta: `` [கொடிகள்] `` பண்புக்கூறுடன் ஒரு எனும் வகையாக இருக்கும் உறுப்பினர்கள் ஏற்றுமதி செய்யப்படலாம் மற்றும் அவற்றின் மதிப்புகள் ENUM வகையின் உறுப்பினர்களுக்கு மட்டுமே. ஆசிரியர் இன்ச்பெக்டரில் ஒரு விட்செட்டை உருவாக்குவார், இது ENUM உறுப்பினர்களில் எதுவும், ஒன்று அல்லது பலவற்றைத் தேர்ந்தெடுக்க அனுமதிக்கிறது. மதிப்பு ஒரு முழு எண்ணாக சேமிக்கப்படும்.
uk: Члени, типом яких є enum з атрибутом ``[Flags]``, можна експортувати, а їхні значення обмежуються членами типу enum. Редактор створить віджет в інспекторі, що дозволить не вибрати жодного, одного або кількох членів переліку. Значення буде збережено як ціле число.
zh_cn: 具有 ``[Flags]`` 特性的枚举类型的成员可以被导出，它们的值被限制为枚举类型的成员。编辑器将在检查器中创建一个小部件，允许选择枚举成员中的零个、一个或多个。该值将被存储为整数。
zh_tw: 型別為帶有 ``[Flags]`` 屬性的列舉成員可以匯出，其值僅限於該列舉型別的成員。編輯器會在屬性檢視器建立即時元件，讓你可以選擇不選、單選或多選列舉成員。該值會以整數存儲。

source: A flags enum uses powers of 2 for the values of the enum members. Members that combine multiple flags using logical OR (``|``) are also possible.
ga: Úsáideann enum bratach cumhachtaí 2 do luachanna na mball enum. Is féidir le baill a chomhcheanglaíonn bratacha iolracha ag baint úsáide as loighciúil NÓ (''|'') freisin.
it: Un enumerazione di flag utilizza potenze di 2 per i valori dei membri dell'enumerazione. Sono possibili anche membri che combinano più flag tramite OR logici (``|``).
ru: Перечисление флагов использует степени числа 2 для значений элементов перечисления. Также возможны элементы, объединяющие несколько флагов с помощью логического ИЛИ (``|``).
ta: ஒரு கொடி எனம் ENUM உறுப்பினர்களின் மதிப்புகளுக்கு 2 சக்திகளைப் பயன்படுத்துகிறது. தர்க்கரீதியான அல்லது (`` | ``) பயன்படுத்தி பல கொடிகளை இணைக்கும் உறுப்பினர்களும் சாத்தியமாகும்.
uk: У переліку flags використовуються ступені 2 для значень членів переліку. Також можливі члени, які поєднують кілька прапорів за допомогою логічного АБО (``|``).
zh_cn: 标志枚举使用 2 的幂作为枚举成员的值。使用逻辑或（\ ``|``\ ）组合多个标志的成员也是可能的。
zh_tw: 列舉型別帶有 [Flags] 屬性時，成員值通常為 2 的冪次方。也可以用邏輯 OR（``|``）組合多個旗標成一個成員。

source: Integers used as bit flags can store multiple ``true``/``false`` (boolean) values in one property. By using the ``Flags`` property hint, any of the given flags can be set from the editor.
ga: Is féidir le slánuimhreacha a úsáidtear mar bhratacha giotán luachanna iolracha ''true''/''false'' (boole) a stóráil in aon mhaoin amháin. Trí úsáid a bhaint as an leid maoine ''Bratacha'', is féidir aon cheann de na bratacha a thugtar a shocrú ón eagarthóir.
it: Gli interi utilizzati come bit flag possono memorizzare più valori ``true``/``false`` (booleani) in un'unica proprietà. Utilizzando l'indicazione di proprietà ``Flags``, è possibile impostare dall'editor uno qualsiasi dei flag specificati.
ru: Целые числа, используемые в качестве битовых флагов, могут хранить несколько значений ``true``/``false`` (логических) в одном свойстве. Используя подсказку свойства ``Flags``, любой из указанных флагов может быть установлен из редактора.
ta: பிட் கொடிகளாகப் பயன்படுத்தப்படும் எண்கள் ஒரு சொத்தில் பல `` உண்மை``/`` தவறான`` (பூலியன்) மதிப்புகளை சேமிக்க முடியும். `` கொடிகள்` சொத்து குறிப்பைப் பயன்படுத்துவதன் மூலம், கொடுக்கப்பட்ட கொடிகளில் ஏதேனும் எடிட்டரிடமிருந்து அமைக்கப்படலாம்.
uk: Цілі числа, які використовуються як бітові прапорці, можуть зберігати кілька значень ``true``/``false`` (логічних) в одній властивості. Використовуючи підказку властивості ``Flags``, будь-який із наданих прапорів можна встановити з редактора.
zh_cn: 用作位标志的整数可以在一个属性中存储多个 ``true``/ ``false``\ （布尔）值。通过使用 ``Flags`` 属性提示，可以从编辑器中设置任何给定的标志。
zh_tw: 以整數作為位元旗標時，可以在單一屬性內儲存多個 ``true`` / ``false``（布林）值。透過 ``Flags`` 屬性提示，可在編輯器中勾選任意旗標。

source: You must provide a string description for each flag. In this example, ``Fire`` has value 1, ``Water`` has value 2, ``Earth`` has value 4 and ``Wind`` corresponds to value 8. Usually, constants should be defined accordingly (e.g. ``private const int ElementWind = 8`` and so on).
ga: Ní mór duit cur síos teaghrán a chur ar fáil do gach bratach. Sa sampla seo, tá luach 1 ag ''Tine'', tá luach 2 ag ''Uisce'', tá luach 4 ag ''Domhan'' agus is ionann ''Gaoth'' agus luach 8. De ghnáth, ba cheart tairisigh a shainmhíniú dá réir sin (e.g. ''const príobháideach int ElementWind = 8'' agus mar sin de).
it: È necessario fornire una descrizione sotto forma di stringa per ogni flag. In questo esempio, ``Fire`` ha il valore 1, ``Water`` ha il valore 2, ``Earth`` ha il valore 4 e ``Wind`` corrisponde al valore 8. Di solito, le costanti si dovrebbero definire di conseguenza (ad esempio ``private const int ElementWind = 8`` e così via).
ru: Необходимо предоставить строковое описание для каждого флага. В этом примере ``Fire`` имеет значение 1, ``Water`` — значение 2, ``Earth`` — значение 4, а ``Wind`` соответствует значению 8. Обычно константы определяются соответствующим образом (например, ``private const int ElementWind = 8`` и т. д.).
ta: ஒவ்வொரு கொடியிற்கும் நீங்கள் ஒரு சரம் விளக்கத்தை வழங்க வேண்டும். இந்த எடுத்துக்காட்டில், `` தீ`` மதிப்பு 1, `` நீர்`` மதிப்பு 2, `` பூமி`` மதிப்பு 4 மற்றும் `` காற்று`` மதிப்பு 8 க்கு ஒத்திருக்கிறது. வழக்கமாக, மாறிலிகள் அதற்கேற்ப வரையறுக்கப்பட வேண்டும் (எ.கா. `` தனிப்பட்ட const int elileswind = 8`` மற்றும் பல).
uk: Ви повинні надати опис рядка для кожного прапора. У цьому прикладі ``Вогонь`` має значення 1, ``Вода`` має значення 2, ``Земля`` має значення 4 і ``Вітер`` відповідає значенню 8. Зазвичай константи мають бути визначені відповідно (наприклад, ``private const int ElementWind = 8`` і так далі).
zh_cn: 你必须为每个标志提供一个字符串描述。在这个例子中，\ ``Fire`` 的值是 1，\ ``Water`` 的值是 2，\ ``Earth`` 的值是 4，\ ``Wind`` 对应的值是 8。通常，应相应地定义常量（例如 ``private const int ElementWind = 8`` 等等）。
zh_tw: 必須為每個旗標提供說明字串。例如這裡，``Fire`` 為 1、``Water`` 為 2、``Earth`` 為 4、``Wind`` 為 8。通常也會定義對應常數（如 ``private const int ElementWind = 8`` 等）。

source: You can add explicit values using a colon:
ga: Is féidir leat luachanna follasacha a chur leis ag baint úsáide as colon:
it: È possibile aggiungere valori espliciti utilizzando i due punti:
ru: Вы можете добавить явные значения, используя двоеточие:
ta: பெருங்குடலைப் பயன்படுத்தி வெளிப்படையான மதிப்புகளை நீங்கள் சேர்க்கலாம்:
uk: Ви можете додати явні значення за допомогою двокрапки:
zh_cn: 你可以使用冒号添加显式的值：
zh_tw: 可用冒號明確指定值：

source: Only power of 2 values are valid as bit flags options. The lowest allowed value is 1, as 0 means that nothing is selected. You can also add options that are a combination of other flags:
ga: Níl ach cumhacht luachanna 2 bailí mar roghanna bratacha giotán. Is é an luach is ísle a cheadaítear ná 1, mar ciallaíonn 0 nach roghnaítear aon rud. Is féidir leat roghanna a chur leis freisin ar meascán de bhratacha eile iad:
it: Solo i valori che sono potenze di 2 sono validi come opzioni di bit flag. Il valore minimo consentito è 1, poiché 0 indica che non è selezionato nulla. È anche possibile aggiungere opzioni che sono una combinazione di altri flag:
ru: В качестве битовых флагов допустимы только значения, являющиеся степенью двойки. Минимальное допустимое значение — 1, поскольку 0 означает, что ничего не выбрано. Вы также можете добавлять параметры, представляющие собой комбинацию других флагов:
ta: பிட் கொடிகளின் விருப்பங்களாக 2 மதிப்புகளின் ஆற்றல் மட்டுமே செல்லுபடியாகும். அனுமதிக்கப்பட்ட மிகக் குறைந்த மதிப்பு 1 ஆகும், ஏனெனில் 0 என்பது எதுவும் தேர்ந்தெடுக்கப்படவில்லை. பிற கொடிகளின் கலவையான விருப்பங்களையும் நீங்கள் சேர்க்கலாம்:
uk: Лише значення потужності 2 дійсні як параметри бітових прапорів. Найменше допустиме значення — 1, оскільки 0 означає, що нічого не вибрано. Ви також можете додати параметри, які є комбінацією інших прапорів:
zh_cn: 只有2的幂次方值才是有效的位标记选项。允许的最低值是1，因为0表示没有选中任何内容。你还可以添加一些其他标记的组合作为选项：
zh_tw: 只有 2 的冪次方值可作為有效的位元旗標選項。最低值為 1，因 0 表示未選擇。也可以新增組合多個旗標的選項：

source: Export annotations are also provided for the physics and render layers defined in the project settings.
ga: Cuirtear nótaí easpórtála ar fáil freisin don fhisic agus do na sraitheanna rindreála a shainmhínítear i suíomhanna an tionscadail.
it: Sono inoltre fornite annotazioni di esportazione per gli strati di fisica e di rendering definiti nelle impostazioni del progetto.
ru: Экспортные аннотации также предоставляются для слоев физики и рендеринга, определенных в настройках проекта.
ta: இயற்பியலுக்கும் ஏற்றுமதி சிறுகுறிப்புகள் வழங்கப்படுகின்றன மற்றும் திட்ட அமைப்புகளில் வரையறுக்கப்பட்ட அடுக்குகளை வழங்குகின்றன.
uk: Експортні анотації також надаються для шарів фізики та рендерингу, визначених у налаштуваннях проекту.
zh_cn: 也可以为项目设置中定义的物理层和渲染层提供导出提示。
zh_tw: 匯出註記也適用於專案設定中定義的物理與繪製圖層。

source: Using bit flags requires some understanding of bitwise operations. If in doubt, use boolean variables instead.
ga: Ag baint úsáide as bratacha giotán éilíonn roinnt tuiscint ar oibríochtaí bitwise. Má tá amhras ort, bain úsáid as athróga Boole ina ionad.
it: L'utilizzo dei bit flag richiede una certa conoscenza delle operazioni bit a bit. In casi di dubbio, utilizzare invece variabili booleane.
ko: 비트 플래그를 사용하려면 비트 연산에 대한 이해가 필요합니다. 확실하지 않은 경우 대신 boolean 변수를 사용하세요.
ru: Использование бинарных флагов требует некоторого понимания побитовых операций. Если вы сомневаетесь, вместо этого следует экспортировать логические переменные.
ta: பிட் கொடிகளைப் பயன்படுத்துவதற்கு பிட்வைச் செயல்பாடுகள் குறித்து சில புரிதல் தேவைப்படுகிறது. ஐயம் இருந்தால், அதற்கு பதிலாக பூலியன் மாறிகள் பயன்படுத்தவும்.
uk: Використання бітових значень вимагає певного розуміння побітових операцій. Якщо ви сумніваєтесь, використовуйте замість них логічні змінні.
zh_cn: 使用位标记需要对位操作有一定的了解，若对此有疑问，请使用布尔变量代替位标记使用。
zh_tw: 使用位元旗標需要基本的位元運算知識。如不熟悉，請改用布林變數。

source: Exporting enums
ga: Enums onnmhairithe
it: Esportare enumerazioni
ru: Exporting enums (Экспорт перечислений)
ta: எண்ணிகள் ஏற்றுமதி
uk: Експорт переліків
zh_cn: 导出枚举
zh_tw: 匯出列舉（Enum）

source: Members whose type is an enum can be exported and their values are limited to the members of the enum type. The editor will create a widget in the Inspector, enumerating the following as "Thing 1", "Thing 2", "Another Thing". The value will be stored as an integer.
ga: Is féidir baill a bhfuil a gcineál enum a onnmhairiú agus tá a gcuid luachanna teoranta do chomhaltaí an chineáil enum. Cruthóidh an t-eagarthóir giuirléid sa Chigire, ag áireamh an méid seo a leanas mar "Rud 1", "Rud 2", "Rud Eile". Stórálfar an luach mar shlánuimhir.
it: È possibile esportare i membri il cui tipo è un enumerazione e i loro valori sono limitati ai membri dell'enumerazione. L'editor creerà un widget nell'Ispettore, enumerando quanto segue come "Thing 1", "Thing 2", "Another Thing". Il valore sarà memorizzato come un numero intero.
ru: Члены, тип которых является перечисление (enum), могут экспортироваться и их значения ограничиваются членами типа enum. Редактор создаст виджет в Inspector, перечисляя следующее как "Thing 1", "Thing 2", "Another Thing". Значение будет храниться как целое число.
ta: உறுப்பினர்கள் ஒரு enum என ஏற்றுக்கொள்ளப்படலாம் மற்றும் அவற்றின் மதிப்புகள் ENUM வகையின் உறுப்பினர்களுக்கு மட்டுமே. ஆசிரியர் இன்ச்பெக்டரில் ஒரு விட்செட்டை உருவாக்குவார், பின்வருவனவற்றை "சேதி 1", "சேதி 2", "மற்றொரு சேதி" என்று கணக்கிடுவார். மதிப்பு ஒரு முழு எண்ணாக சேமிக்கப்படும்.
uk: Члени, типом яких є enum, можна експортувати, а їхні значення обмежуються членами типу enum. Редактор створить віджет в інспекторі, який буде нумерувати наступні елементи як «Thing 1», «Thing 2», «Another Thing». Значення буде збережено як ціле число.
zh_cn: 类型是枚举的成员可以导出，它们的值只能是枚举类型的成员之一。编辑器会在检查器中创建一个小部件，把以下内容列举为“Thing 1”、“Thing 2”、“Another Thing”。这个值会以整数的形式存储。
zh_tw: 型別為列舉的成員可以匯出，其值僅限於列舉型別的成員。編輯器會在屬性檢視器產生元件，將下列選項列舉為「Thing 1」、「Thing 2」、「Another Thing」。該值會以整數儲存。

source: Integer and string members can also be limited to a specific list of values using the ``[Export]`` annotation with the ``PropertyHint.Enum`` hint. The editor will create a widget in the Inspector, enumerating the following as Warrior, Magician, Thief. The value will be stored as an integer, corresponding to the index of the selected option (i.e. ``0``, ``1``, or ``2``).
ga: Is féidir slánuimhir agus teaghráin a theorannú freisin do liosta sonrach luachanna ag baint úsáide as an anótáil ''[Easpórtáil]'' leis an leid ''PropertyHint.Enum''. Cruthóidh an t-eagarthóir giuirléid sa Chigire, ag áireamh an méid seo a leanas mar Warrior, Magician, Thief. Stórálfar an luach mar shlánuimhir, a chomhfhreagraíonn d'innéacs na rogha roghnaithe (i.e. ''0'', ''1'', nó ''2'').
it: È possibile anche limitare i membri di tipo intero e stringa a un elenco specifico di valori attraverso l'annotazione ``[Export]`` con l'indicazione ``PropertyHint.Enum``. L'editor creerà un widget nell'Ispettore, enumerando i seguenti valori come Warrior, Magician, Thief. Il valore sarà memorizzato come un intero, corrispondente all'indice dell'opzione selezionata (ad esempio ``0``, ``1`` o ``2``).
ru: Интегерные и струнные члены также могут быть ограничены конкретным списком значений, используя аннотацию ``[Export]`` с ``PropertyHint.Enum`` подсказка. Редактор создаст виджет в Инспекторе, перечисляя следующее: Warrior, Magician, Thief. Значение будет храниться как целое число, соответствующее индексу выбранного варианта (т.е. ``0``, ``1`` или ``2``).
ta: `` [ஏற்றுமதி] `` சிறுகுறிப்பைப் பயன்படுத்தி `` propertyhint.enum`` குறிப்பைப் பயன்படுத்தி முழு மதிப்புகளின் குறிப்பிட்ட பட்டியலுக்கு முழு எண் மற்றும் சரம் உறுப்பினர்கள் மட்டுப்படுத்தப்படலாம். ஆசிரியர் இன்ச்பெக்டரில் ஒரு விட்செட்டை உருவாக்குவார், பின்வருவனவற்றை வாரியர், மந்திரவாதி, திருடன் என்று கணக்கிடுவார். தேர்ந்தெடுக்கப்பட்ட விருப்பத்தின் குறியீட்டுடன் (அதாவது `` 0``, `1``, அல்லது` `2``) தொடர்புடைய மதிப்பு ஒரு முழு எண்ணாக சேமிக்கப்படும்.
uk: Цілі та рядкові члени також можуть бути обмежені певним списком значень за допомогою анотації ``[Export]`` з підказкою ``PropertyHint.Enum``. Редактор створить віджет в Інспекторі, у якому буде перераховано такі елементи як Воїн, Маг, Злодій. Значення буде збережено як ціле число, що відповідає індексу вибраного параметра (тобто ``0``, ``1`` або ``2``).
zh_cn: 整数和字符串类型的成员也可以使用 ``[Export]`` 特性和 ``PropertyHint.Enum`` 提示来限制为特定的值列表。编辑器会在检查器中创建一个小部件，把以下内容列举为 Warrior、Magician、Thief。这个值会以整数的形式存储，对应于所选选项的索引（即 ``0`` 、 ``1`` 或 ``2`` ）。
zh_tw: 也可以使用 ``[Export]`` 註記搭配 ``PropertyHint.Enum`` 限制整數或字串成員只能選擇特定值。編輯器會在屬性編輯器中產生元件，將下列選項列舉為 Warrior、Magician、Thief。該值會以整數儲存，對應所選項目的索引（即 ``0``、``1``、``2``）。

source: If the type is ``string``, the value will be stored as a string.
ga: Más é ''teaghrán' an cineál, stórálfar an luach mar theaghrán.
it: Se il tipo è ``string``, il valore sarà memorizzato come stringa.
ru: Если тип - ``string``, значение будет сохранено как строка.
ta: வகை `` சரம்`` என்றால், மதிப்பு ஒரு சரமாக சேமிக்கப்படும்.
uk: Якщо тип ``рядок``, значення буде збережено як рядок.
zh_cn: 如果类型是 ``string`` ，值将以字符串形式存储。
zh_tw: 若型別為 ``string``，則值會以字串形式儲存。

source: If you want to set an initial value, you must specify it explicitly:
ga: Más mian leat luach tosaigh a shocrú, ní mór duit é a shonrú go sainráite:
it: Se si desidera impostare un valore iniziale, è necessario specificarlo esplicitamente:
ru: Если вы хотите задать начальное значение, его необходимо указать явно:
ta: நீங்கள் ஆரம்ப மதிப்பை அமைக்க விரும்பினால், அதை நீங்கள் வெளிப்படையாகக் குறிப்பிட வேண்டும்:
uk: Якщо ви хочете встановити початкове значення, ви повинні вказати його явно:
zh_cn: 如果你想设置初始值，你必须明确指定它：
zh_tw: 若要指定初始值，必須明確給予：

source: Exporting inspector buttons with ``[ExportToolButton]``
it: Esportare pulsanti dell'ispettore con ``[ExportToolButton]``
ru: Экспорт кнопок инспектора с помощью ``[ExportToolButton]``
ta: இன்ச்பெக்டர் பொத்தான்களை `` [எக்ச்போர்டூல் பட்டன்] `` உடன் ஏற்றுமதி செய்தல்
uk: Експорт кнопок інспектора за допомогою ``[ExportToolButton]``
zh_tw: 匯出 Inspector 按鈕（使用 ``[ExportToolButton]``）

source: If you want to create a clickable button in the inspector, you can use the ``[ExportToolButton]`` attribute. This exports a Callable property or field as a clickable button. Since this runs in the editor, usage of the :ref:`[Tool] <doc_running_code_in_the_editor>` attribute is required. When the button is pressed, the callable is called:
it: Se si desidera creare un pulsante cliccabile nell'ispettore, è possibile utilizzare l'attributo ``[ExportToolButton]``. Questo esporta una proprietà o un campo Callable sotto forma di un pulsante cliccabile. Poiché ciò è eseguito nell'editor, è obbligatorio utilizzare l'attributo :ref:`[Tool] <doc_running_code_in_the_editor>`. Quando il pulsante viene premuto, il Callable viene richiamato:
ru: Если вы хотите создать нажатую кнопку в инспекторе, вы можете использовать атрибут ``[ExportToolbutton]``. Это экспортирует Callable свойство или поле как нажатую кнопку. Поскольку это работает в редакторе, требуется использование атрибута :ref:`[Tool] <doc_running_code_in_the_editor>`. Когда кнопка нажимается, ее называют:
ta: இன்ச்பெக்டரில் சொடுக்கு செய்யக்கூடிய பொத்தானை உருவாக்க விரும்பினால், நீங்கள் `` [exportToolButton] `` பண்புக்கூறு பயன்படுத்தலாம். இது ஒரு சொடுக்கு செய்யக்கூடிய சொத்து அல்லது புலத்தை சொடுக்கு செய்யக்கூடிய பொத்தானாக ஏற்றுமதி செய்கிறது. இது எடிட்டரில் இயங்குவதால், பயன்பாடு: ref: `[கருவி] <doc_running_code_in_the_editor>` பண்புக்கூறு தேவை. பொத்தானை அழுத்தும்போது, அழைக்கக்கூடியது அழைக்கப்படுகிறது:
uk: Якщо ви хочете створити кнопку, яку можна натиснути в інспекторі, ви можете використати атрибут ``[ExportToolButton]``. Це експортує властивість Callable або поле як кнопку, яку можна натиснути. Оскільки це виконується в редакторі, потрібне використання атрибута :ref:`[Tool] <doc_running_code_in_the_editor>`. Коли кнопка натиснута, виклик викликається:
zh_tw: 如需在 Inspector 建立可點擊的按鈕，可使用 ``[ExportToolButton]`` 屬性。這會將一個 Callable 屬性或欄位匯出成可點擊按鈕。由於這會在編輯器執行，因此必須加上 :ref:`[Tool] <doc_running_code_in_the_editor>` 屬性。按下按鈕時，對應的 callable 會被呼叫：

source: You can also set an icon for the button with a second argument. If specified, an icon will be fetched via :ref:`GetThemeIcon() <class_Control_method_get_theme_icon>`, from the ``"EditorIcons"`` theme type.
it: È anche possibile impostare un'icona per il pulsante con un secondo argomento. Se specificato, l'icona sarà recuperata tramite :ref:`GetThemeIcon() <class_Control_method_get_theme_icon>`, dal tipo di tema ``"EditorIcons"``.
ru: Вы также можете установить иконку для кнопки со вторым аргументом. Если указано, значок будет доставлен через :ref:`GetThemeIcon() <class_Control_method_get_theme_icon>`, из тематического типа ``"EditorIcons"``.
ta: இரண்டாவது வாதத்துடன் பொத்தானுக்கு ஒரு ஐகானையும் அமைக்கலாம். குறிப்பிடப்பட்டால், ஒரு படவுரு மூலம் பெறப்படும்: குறிப்பு: `getThemeicon () <class_control_method_get_theme_icon>`, `` "எடிட்டோரிகான்கள்" `` கருப்பொருள் வகை.
uk: Ви також можете встановити значок для кнопки з другим аргументом. Якщо вказано, піктограму буде отримано через :ref:`GetThemeIcon() <class_Control_method_get_theme_icon>` з типу теми ``"EditorIcons"``.
zh_tw: 你也可以用第二個參數為按鈕指定圖示。若有指定，會透過 :ref:`GetThemeIcon() <class_Control_method_get_theme_icon>` 從 ``"EditorIcons"`` 主題中取得圖示。

source: Exporting collections
ga: Bailiúcháin á n-easpórtáil
it: Esportazione di raccolte
ru: Экспорт коллекций
ta: ஏற்றுமதி வசூல்
uk: Експорт колекцій
zh_cn: 导出集合
zh_tw: 匯出集合

source: As explained in the :ref:`C# Variant <doc_c_sharp_variant>` documentation, only certain C# arrays and the collection types defined in the ``Godot.Collections`` namespace are Variant-compatible, therefore, only those types can be exported.
ga: Mar a mhínítear sa cháipéisíocht :ref:`C# Variant <doc_c_sharp_variant>`, níl ach eagair C# áirithe agus na cineálacha bailiúcháin a shainítear san ainmspás ``Godot.Collections`` ag luí le hAthraithe, mar sin, ní féidir ach na cineálacha sin a onnmhairiú.
it: Come spiegato nella documentazione :ref:`C# Variant <doc_c_sharp_variant>`, solo alcuni array C# e i tipi di raccolta definiti nello spazio dei nomi ``Godot.Collections`` sono compatibili con Variant, pertanto è possibile esportare solo tali tipi.
ru: Как поясняется в документации :ref:`C# Variant <doc_c_sharp_variant>`, только некоторые массивы C# и типы коллекций, определенные в namespace (пространстве имен) ``Godot.Collections`` являются совместимыми с Variant, поэтому только эти типы могут быть экспортированы.
ta: இதில் விளக்கப்பட்டுள்ளபடி: ref: `c# மாறுபாடு <doc_c_sharp_variant>` ஆவணங்கள், சில சி# வரிசைகள் மற்றும் `` கோடோட்.சோலெக்சன்ச்`` பெயர்வெளியில் வரையறுக்கப்பட்ட சேகரிப்பு வகைகள் மட்டுமே மாறுபட்ட-இணக்கமானவை, எனவே, அந்த வகைகளை மட்டுமே ஏற்றுமதி செய்ய முடியும்.
uk: Як пояснюється в документації :ref:`C# Variant <doc_c_sharp_variant>`, тільки певні масиви C# і типи колекцій, визначені в просторі імен ``Godot.Collections``, є сумісними з Variant, тому лише ці типи можна експортувати.
zh_cn: 如 :ref:`C# Variant <doc_c_sharp_variant>` 文档所述，只有特定的 C# 数组和 ``Godot.Collections`` 命名空间中定义的集合类型是 Variant 兼容的，因此，只有这些类型才能被导出。
zh_tw: 如 :ref:`C# Variant <doc_c_sharp_variant>` 文件所述，僅有部分 C# 陣列與 ``Godot.Collections`` 命名空間中定義的集合型別與 Variant 相容，因此只有這些型別可匯出。

source: Exporting Godot arrays
ga: Easpórtáil eagair Godot
it: Esportazione di array di Godot
ru: Экспорт массивов Godot
ta: கோடோட் வரிசைகளை ஏற்றுமதி செய்தல்
uk: Експорт масивів Godot
zh_cn: 导出 Godot 数组
zh_tw: 匯出 Godot 陣列

source: Using the generic ``Godot.Collections.Array<T>`` allows specifying the type of the array elements, which will be used as a hint for the editor. The Inspector will restrict the elements to the specified type.
ga: Trí úsáid a bhaint as an gcineálach ``Godot.Collections.Array<T>`` is féidir cineál na n-eilimintí eagair a shonrú, a úsáidfear mar leid don eagarthóir. Déanfaidh an Cigire na gnéithe a theorannú don chineál sonraithe.
it: Utilizzando il generico ``Godot.Collections.Array<T>`` è possibile specificare il tipo degli elementi dell'array, che sarà utilizzato come indicazione per l'editor. L'Ispettore limiterà gli elementi al tipo specificato.
ru: Использование универсального класса ``Godot.Collections. Array<T>`` позволяет указывать тип элементов массива, который будет использоваться в качестве подсказки для редактора. Инспектор ограничит эти элементы указанным типом.
ta: பொதுவான `` kudot.collections.array <t> `` `` `` வரிசை உறுப்புகளின் வகையைக் குறிப்பிட அனுமதிக்கிறது, இது எடிட்டருக்கான குறிப்பாகப் பயன்படுத்தப்படும். இன்ச்பெக்டர் கூறுகளை குறிப்பிட்ட வகைக்கு கட்டுப்படுத்தும்.
uk: Використання загального ``Godot.Collections.Array<T>`` дозволяє вказати тип елементів масиву, які будуть використовуватися як підказка для редактора. Інспектор обмежить елементи вказаним типом.
zh_cn: 使用泛型 ``Godot.Collections.Array<T>`` 可以指定数组元素的类型，这将用作编辑器的提示。检查器会将元素限制为指定的类型。
zh_tw: 使用泛型 ``Godot.Collections.Array<T>`` 可指定陣列元素型別，編輯器會以此作為提示，Inspector 也會限制元素型別。
