Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_exports.po
Languages: ga, it, ko, ru, ta, uk, zh_cn, zh_tw

source: C# exported properties
ga: Airíonna easpórtála C#
it: Proprietà esportate in C#
ru: Экспортированные свойства C#
ta: சி# ஏற்றுமதி செய்யப்பட்ட பண்புகள்
uk: Експортовані властивості C#
zh_cn: C# 导出属性
zh_tw: C# 匯出屬性

source: In Godot, class members can be exported. This means their value gets saved along with the resource (such as the :ref:`scene <class_PackedScene>`) they're attached to. They will also be available for editing in the property editor. Exporting is done by using the ``[Export]`` attribute.
ga: I Godot, is féidir baill ranga a onnmhairiú. Ciallaíonn sé seo go sábhálfar a luach mar aon leis an acmhainn (amhail an :ref:`scene <class_PackedScene>`) a bhfuil siad ceangailte leis. Beidh siad ar fáil freisin le haghaidh eagarthóireacht san eagarthóir réadmhaoine. Déantar easpórtáil trí úsáid a bhaint as an aitreabúid ``[Easpórtáil]``.
it: In Godot, è possibile esportare i membri di una classe. Ciò significa che il loro valore è salvato insieme alla risorsa (ad esempio, :ref:`scene <class_PackedScene>`) a cui sono associati. Saranno anche disponibili per la modifica nell'editor delle proprietà. L'esportazione avviene tramite l'attributo ``[Export]``.
ko: Godot에서는 클래스 멤버는 내보낼 수 있습니다. 즉, 해당 값은 (:ref:`scene <class_PackedScene>`\ 과 같이) 첨부된 리소스와 함께 저장됩니다. 또한 속성 편집기에서 편집할 수 있습니다. 내보내기는 ``[Export]`` 특성을 사용하여 수행됩니다.
ru: В Godot члены класса могут быть экспортированы. Это означает, что их значение сохраняется вместе с ресурсом (например, :ref:`scene <class_PackedScene>`), к которому они прикреплены. Они также будут доступны для редактирования в редакторе свойств. Экспорт выполняется с помощью атрибута ``[Export]``.
ta: கோடோட்டில், வர்க்க உறுப்பினர்களை ஏற்றுமதி செய்யலாம். இதன் பொருள் அவற்றின் மதிப்பு வளத்துடன் சேமிக்கப்படுகிறது (போன்றவை: குறிப்பு: `காட்சி <class_packedscene>`) அவை இணைக்கப்பட்டுள்ளன. சொத்து எடிட்டரில் திருத்துவதற்கும் அவை கிடைக்கும். `` [ஏற்றுமதி] `` பண்புக்கூறு ஆகியவற்றைப் பயன்படுத்தி ஏற்றுமதி செய்யப்படுகிறது.
uk: У Godot члени класу можна експортувати. Це означає, що їх значення буде збережено разом з ресурсом (наприклад, :ref:`scene <class_PackedScene>`), до якого вони приєднані. Вони також будуть доступні для редагування у редакторі властивостей. Експорт здійснюється за допомогою атрибута ``[Export]``.
zh_cn: 在 Godot 中可以导出类成员。这意味着它们的值会与它们所附加的资源（例如\ :ref:`场景 <class_PackedScene>`\ ）一起保存。它们也可以在属性编辑器中进行编辑。导出使用特性 ``[Export]`` 来完成。
zh_tw: 在 Godot 中，類別成員可以被匯出。這代表它們的值會與其所屬的資源（像是 :ref:`場景 <class_PackedScene>`）一起儲存。這些屬性也會在屬性編輯器中顯示，並可供編輯。匯出是透過 ``[Export]`` 屬性來實現的。

source: In that example the value ``5`` will be saved, and after building the current project it will be visible in the property editor.
ga: Sa sampla sin sábhálfar an luach ''5'', agus tar éis an tionscadal reatha a thógáil beidh sé le feiceáil san eagarthóir maoine.
it: Nell'esempio precedente il valore ``5`` sarà salvato e, dopo aver compilato il progetto attuale, sarà visibile nell'editor delle proprietà.
ru: В этом примере значение ``5`` будет сохранено, и после построения текущего проекта оно будет видно в редакторе свойств.
ta: அந்த எடுத்துக்காட்டில் `` 5`` மதிப்பு சேமிக்கப்படும், தற்போதைய திட்டத்தை உருவாக்கிய பிறகு அது சொத்து எடிட்டரில் தெரியும்.
uk: У цьому прикладі значення ``5`` буде збережено, і після створення поточного проекту воно буде видимим у редакторі властивостей.
zh_cn: 在这个例子中，数值 ``5`` 将被保存，在构建当前项目后，它将在属性编辑器中可见。
zh_tw: 在這個範例中，值 ``5`` 會被儲存，並在建置專案後於屬性編輯器中顯示。

source: One of the fundamental benefits of exporting member variables is to have them visible and editable in the editor. This way, artists and game designers can modify values that later influence how the program runs. For this, a special export syntax is provided.
ga: Ceann de na buntáistí bunúsacha a bhaineann le hathróga ball onnmhairithe ná iad a bheith infheicthe agus ineagarthóireachta san eagarthóir. Ar an mbealach seo, is féidir le healaíontóirí agus dearthóirí cluiche luachanna a mhodhnú a mbíonn tionchar acu níos déanaí ar an gcaoi a ritheann an clár. Chuige seo, cuirtear comhréir easpórtála speisialta ar fáil.
it: Uno dei motivi fondamentali per esportare variabili membro è per renderle visibili e modificabili nell'editor. Facendo così, artisti e game designer possono modificare valori che poi influiranno sull'esecuzione del programma. A questo scopo, viene fornita una sintassi di esportazione specifica.
ko: 멤버 변수 내보내기의 기본적인 장점 중 하나는 편집기에서 멤버 변수를 보고 편집할 수 있다는 점입니다. 이런 식으로 아티스트와 게임 디자이너는 나중에 프로그램 실행 방식에 영향을 주는 값을 수정할 수 있습니다. 이를 위해 특별한 내보내기 구문이 제공됩니다.
ru: Одним из фундаментальных преимуществ экспорта переменных (членов класса) является то, что они видны и редактируются в редакторе. Таким образом, художники и гейм-дизайнеры могут изменять значения, которые впоследствии будут влиять на работу программы. Для этого предусмотрен специальный синтаксис экспорта.
ta: உறுப்பினர் மாறிகள் ஏற்றுமதி செய்வதன் அடிப்படை நன்மைகளில் ஒன்று, அவற்றை எடிட்டரில் காணக்கூடியதாகவும் திருத்தக்கூடியதாகவும் இருக்க வேண்டும். இந்த வழியில், கலைஞர்கள் மற்றும் விளையாட்டு வடிவமைப்பாளர்கள் நிரல் எவ்வாறு இயங்குகிறது என்பதை பின்னர் பாதிக்கும் மதிப்புகளை மாற்ற முடியும். இதற்காக, ஒரு சிறப்பு ஏற்றுமதி தொடரியல் வழங்கப்படுகிறது.
uk: Однією з основних переваг експорту змінних є те, що їх можна побачити та редагувати у редакторі. Таким чином, художники та розробники ігор можуть змінювати значення, які згода впливають на роботу програми. Для цього передбачений спеціальний синтаксис експорту.
zh_cn: 导出成员变量的基本好处之一，便是让这些变量在编辑器中可见可改，这样一来，美术师和游戏设计师就可以修改这些会影响程序运行方式的值。为此，Godot 提供了一种特殊的导出语法。
zh_tw: 匯出成員變數的主要好處之一，是能讓它們在編輯器中顯示並編輯。這樣美術和遊戲設計師就可以直接調整影響程式執行的數值。為此，Godot 提供了專屬的匯出語法。

source: Exporting can only be done with :ref:`c_sharp_variant_compatible_types`.
ga: Ní féidir easpórtáil a dhéanamh ach amháin le :ref:'c_sharp_variant_compatible_types'.
it: L'esportazione si può effettuare solo con :ref:`c_sharp_variant_compatible_types`.
ru: Экспорт возможен только с помощью :ref:`c_sharp_variant_compatible_types`.
ta: ஏற்றுமதி செய்வதை மட்டுமே செய்ய முடியும்: ref: `c_sharp_variant_compatible_types`.
uk: Експорт можна виконати лише за допомогою :ref:`c_sharp_variant_compatible_types`.
zh_cn: 导出只适用于\ :ref:`c_sharp_variant_compatible_types`\ 。
zh_tw: 只能對 :ref:`c_sharp_variant_compatible_types` 進行匯出。

source: Exporting properties can also be done in GDScript, for information on that see :ref:`doc_gdscript_exports`.
ga: Is féidir airíonna onnmhairithe a dhéanamh freisin i GDScript, le haghaidh faisnéise ar an féach :ref:'doc_gdscript_exports'.
it: È possibile esportare proprietà anche in GDScript; per informazioni al riguardo, consultare :ref:`doc_gdscript_exports`.
ru: Экспорт свойств также можно выполнить в GDScript, информацию об этом см. в :ref:`doc_gdscript_exports`.
ta: ஏற்றுமதி பண்புகளை GDSCRIPT இல் செய்ய முடியும், அதற்கான தகவலுக்கு: குறிப்பு: `doc_gdscript_exports`.
uk: Експорт властивостей також можна виконати в GDScript, інформацію про це див. :ref:`doc_gdscript_exports`.
zh_cn: GDScript 中也能够导出属性，相关信息见 :ref:`doc_gdscript_exports`\ 。
zh_tw: 屬性也可以在 GDScript 中匯出，相關資訊請參閱 :ref:`doc_gdscript_exports`。

source: Basic use
ga: Úsáid bhunúsach
it: Utilizzo di base
ko: 기초 사용법
ru: Основное применение
ta: அடிப்படை பயன்பாடு
uk: Основне використання
zh_cn: 基本用法
zh_tw: 基本用法

source: Exporting works with fields and properties. They can have any access modifier.
ga: Oibríonn easpórtáil le réimsí agus airíonna. Is féidir leo aon mhodhnóir rochtana a bheith acu.
it: L'esportazione funziona con campi e proprietà. Possono avere qualsiasi modificatore di accesso.
ru: Экспорт работает с полями и свойствами. Они могут иметь любой модификатор доступа.
ta: ஏற்றுமதி புலங்கள் மற்றும் பண்புகளுடன் செயல்படுகிறது. அவர்கள் எந்த அணுகல் மாற்றியமைப்பையும் கொண்டிருக்கலாம்.
uk: Експорт працює з полями та властивостями. Вони можуть мати будь-який модифікатор доступу.
zh_cn: 导出适用于字段和属性。它们可以具有任何访问修饰符。
zh_tw: 匯出可以用於欄位與屬性，且存取修飾詞不限。

source: Exported members can specify a default value; otherwise, the `default value of the type <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/builtin-types/default-values>`_ is used instead.
ga: Is féidir le baill easpórtáilte luach réamhshocraithe a shonrú; seachas sin, úsáidtear `luach réamhshocraithe an chineáil <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/builtin-types/default-values>`_ ina ionad sin.
it: I membri esportati possono specificare un valore predefinito; se non, viene utilizzato il `valore predefinito del tipo <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/builtin-types/default-values>`_.
ru: Экспортированные элементы могут указывать значение по умолчанию; в противном случае вместо него используется `значение по умолчанию типа <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/builtin-types/default-values>`_.
ta: ஏற்றுமதி செய்யப்பட்ட உறுப்பினர்கள் இயல்புநிலை மதிப்பைக் குறிப்பிடலாம்; இல்லையெனில், <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/builtin-types/default-values> `_ அதற்கு பதிலாக பயன்படுத்தப்படுகிறது.
uk: Експортовані члени можуть вказати значення за замовчуванням; інакше замість нього `використовується значення за замовчуванням типу <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/builtin-types/default-values>`_.
zh_cn: 导出的成员可以指定默认值；否则，将使用类型的 `默认值 <https://learn.microsoft.com/zh-cn/dotnet/csharp/language-reference/builtin-types/default-values>`_ 。
zh_tw: 匯出的成員可以指定預設值；若未指定，則會採用 `型別的預設值 <https://learn.microsoft.com/zh-tw/dotnet/csharp/language-reference/builtin-types/default-values>`_ 。

source: An ``int`` like ``Number`` defaults to ``0``. ``Text`` defaults to null because ``string`` is a reference type.
ga: Réamhshocruithe ''int'' cosúil le ''Uimhir'' go ''0''. Réamhshocruithe ''téacs'' le neamhniú toisc gur cineál tagartha é ''teaghrán''.
it: Un ``int`` come ``Number`` ha come valore predefinito ``0``. ``Text`` ha come valore predefinito null perché ``string`` è un tipo di riferimento.
ru: ``int``, например ``Number``, по умолчанию равен ``0``. ``Text`` по умолчанию равен null, поскольку ``string`` является ссылочным типом.
ta: `` 0`` போன்ற `` எண்` போன்ற ஒரு `` int``. `` உரை`` NULL க்கு இயல்புநிலையாக இருப்பதால் `` சரம்`` என்பது ஒரு குறிப்பு வகை.
uk: ``int`` як ``Number`` за замовчуванням ``0``. ``Текст`` за умовчанням має значення null, оскільки ``рядок`` є типом посилання.
zh_cn: 类似于 ``Number`` 的 ``int`` 默认为 ``0``\ 。\ ``Text`` 默认为 null，因为 ``string`` 是引用类型。
zh_tw: 像 ``Number`` 這樣的 ``int`` 預設值為 ``0``。而 ``Text`` 預設為 null，因為 ``string`` 屬於參考型別。

source: Default values can be specified for fields and properties.
ga: Is féidir luachanna réamhshocraithe a shonrú le haghaidh réimsí agus airíonna.
it: È possibile specificare valori predefiniti per campi e proprietà.
ru: Для полей и свойств можно указать значения по умолчанию.
ta: புலங்கள் மற்றும் பண்புகளுக்கு இயல்புநிலை மதிப்புகளைக் குறிப்பிடலாம்.
uk: Для полів і властивостей можна вказати значення за замовчуванням.
zh_cn: 可以为字段和属性指定默认值。
zh_tw: 欄位與屬性皆可指定預設值。

source: Properties with a backing field use the default value of the backing field.
ga: Úsáideann airíonna le réimse tacaíochta luach réamhshocraithe an réimse tacaíochta.
it: Le proprietà con un campo sottostante utilizzano il valore predefinito del campo sottostante.
ru: Свойства с резервным полем используют значение резервного поля по умолчанию.
ta: உதவி புலத்துடன் கூடிய பண்புகள் உதவி புலத்தின் இயல்புநிலை மதிப்பைப் பயன்படுத்துகின்றன.
uk: Властивості з резервним полем використовують значення резервного поля за замовчуванням.
zh_cn: 包含后备字段的属性使用后备字段的默认值。
zh_tw: 有備援欄位的屬性會使用備援欄位的預設值。

source: A property's ``get`` is not actually executed to determine the default value. Instead, Godot analyzes the C# source code. This works fine for most cases, such as the examples on this page. However, some properties are too complex for the analyzer to understand.
ga: Ní dhéantar ''get'' maoine a fhorghníomhú go hiarbhír chun an luach réamhshocraithe a chinneadh. Ina áit sin, déanann Godot anailís ar an gcód foinse C #. Oibríonn sé seo go breá don chuid is mó cásanna, mar shampla na samplaí ar an leathanach seo. Mar sin féin, tá roinnt airíonna ró-chasta don anailíseoir a thuiscint.
it: Il metodo ``get`` di una proprietà non viene effettivamente eseguito per determinare il valore predefinito. Godot analizza invece il codice sorgente C#. Ciò funziona correttamente nella maggior parte dei casi, come negli esempi di questa pagina. Tuttavia, alcune proprietà sono troppo complesse da comprendere per l'analizzatore.
ru: Метод ``get`` свойства фактически не выполняется для определения значения по умолчанию. Вместо этого Godot анализирует исходный код C#. Это работает нормально в большинстве случаев, например, в примерах на этой странице. Однако некоторые свойства слишком сложны для понимания анализатором.
ta: இயல்புநிலை மதிப்பைத் தீர்மானிக்க ஒரு சொத்தின் `` get`` உண்மையில் செயல்படுத்தப்படவில்லை. அதற்கு பதிலாக, கோடோட் சி# மூலக் குறியீட்டை பகுப்பாய்வு செய்கிறார். இந்த பக்கத்தில் உள்ள எடுத்துக்காட்டுகள் போன்ற பெரும்பாலான சந்தர்ப்பங்களில் இது நன்றாக வேலை செய்கிறது. இருப்பினும், சில பண்புகள் பகுப்பாய்வி புரிந்து கொள்ள மிகவும் சிக்கலானவை.
uk: ``get`` властивості фактично не виконується для визначення значення за умовчанням. Натомість Godot аналізує вихідний код C#. Це добре працює в більшості випадків, наприклад, у прикладах на цій сторінці. Однак деякі властивості надто складні для розуміння аналізатором.
zh_cn: 属性的 ``get`` 实际上并不会被执行以确定默认值。相反，Godot 会分析 C# 源代码。这在大多数情况下都很好，例如本页上的示例。但是，有些属性对于分析器理解来说太复杂。
zh_tw: 屬性的 ``get`` 方法實際上並不會執行來決定預設值。Godot 會直接分析 C# 原始碼。這在大多數情況下都沒問題，但有些屬性若過於複雜，分析器可能無法正確判斷。

source: For example, the following property attempts to use math to display the default value as ``5`` in the property editor, but it doesn't work:
ga: Mar shampla, déanann an mhaoin seo a leanas iarracht mata a úsáid chun an luach réamhshocraithe a thaispeáint mar ''5'' san eagarthóir maoine, ach ní oibríonn sé:
it: Ad esempio, la seguente proprietà tenta di utilizzare la matematica per visualizzare il valore predefinito come ``5`` nell'editor delle proprietà, ma non funziona:
ru: Например, следующее свойство пытается использовать математику для отображения значения по умолчанию как ``5`` в редакторе свойств, но это не работает:
ta: எடுத்துக்காட்டாக, இயல்புநிலை மதிப்பை சொத்து எடிட்டரில் `` 5`` எனக் காட்ட பின்வரும் சொத்து கணிதத்தைப் பயன்படுத்த முயற்சிக்கிறது, ஆனால் அது வேலை செய்யாது:
uk: Наприклад, наступна властивість намагається використати математику для відображення значення за умовчанням як ``5`` у редакторі властивостей, але це не працює:
zh_cn: 例如，以下属性尝试使用数学运算以在属性编辑器中将默认值显示为 ``5``\ ，但是不起作用：
zh_tw: 例如，下列屬性嘗試用數學運算讓屬性編輯器顯示預設值 ``5``，但這樣並不會如預期運作：

source: The analyzer doesn't understand this code and falls back to the default value for ``int``, ``0``. However, when running the scene or inspecting a node with an attached tool script, ``_number`` will be ``2``, and ``NumberWithBackingField`` will return ``5``. This difference may cause confusing behavior. To avoid this, don't use complex properties. Alternatively, if the default value can be explicitly specified, it can be overridden with the :ref:`_PropertyCanRevert() <class_Object_private_method__property_can_revert>` and :ref:`_PropertyGetRevert() <class_Object_private_method__property_get_revert>` methods.
ga: Ní thuigeann an t-anailíseoir an cód seo agus titeann sé ar ais go dtí an luach réamhshocraithe le haghaidh ``int``, ``0``. Mar sin féin, nuair a bhíonn an radharc á rith nó nuair a dhéantar iniúchadh ar nód le script uirlisí ceangailte, beidh `` _number`` mar `` 2``, agus beidh `` NumberWithBackingField`` ar ais `` 5``. Féadfaidh an difríocht seo a bheith ina chúis le hiompar mearbhall. Chun seo a sheachaint, ná húsáid airíonna casta. Nó, más féidir an luach réamhshocraithe a shonrú go sainráite, is féidir é a shárú leis na modhanna :ref:`_PropertyCanRevert() <class_Object_private_method_property_can_revert>` agus :ref:`_PropertyGetRevert() <class_Object_private_method_property_get_revert>`.
it: L'analizzatore non interpreta questo codice e ricorre al valore predefinito per ``int``, ``0``. Tuttavia, quando si esegue la scena o si ispeziona un nodo con uno script tool allegato, ``_number`` sarà ``2`` e ``NumberWithBackingField`` restituirà ``5``. Questa differenza potrebbe essere confusionaria. Per evitare ciò, non utilizzare proprietà complesse. Altrimenti, se il valore predefinito si può specificare esplicitamente, si può sovrascrivere con i metodi :ref:`_PropertyCanRevert() <class_Object_private_method__property_can_revert>` e :ref:`_PropertyGetRevert() <class_Object_private_method__property_get_revert>`.
ru: Анализатор не распознает этот код и возвращается к значению по умолчанию для ``int``, ``0``. Однако при запуске сцены или проверке узла с прикреплённым скриптом инструмента ``_number`` будет равно ``2``, а ``NumberWithBackingField`` вернёт ``5``. Это различие может привести к запутанному поведению. Чтобы избежать этого, не используйте сложные свойства. В качестве альтернативы, если значение по умолчанию можно указать явно, его можно переопределить с помощью методов :ref:`_PropertyCanRevert() <class_Object_private_method__property_can_revert>` и :ref:`_PropertyGetRevert() <class_Object_private_method__property_get_revert>`.
ta: பகுப்பாய்வி இந்த குறியீட்டைப் புரிந்து கொள்ளவில்லை மற்றும் `` int``, `` 0`` என்பதற்கான இயல்புநிலை மதிப்புக்கு மீண்டும் விழுகிறது. இருப்பினும், காட்சியை இயக்கும் போது அல்லது இணைக்கப்பட்ட கருவி ச்கிரிப்டுடன் ஒரு முனையை ஆய்வு செய்யும் போது, `` _நம்பர்`` `` 2`` ஆக இருக்கும், மேலும் `` nathwithbackingfield`` திரும்பும் `` 5``. இந்த வேறுபாடு குழப்பமான நடத்தையை ஏற்படுத்தக்கூடும். இதைத் தவிர்க்க, சிக்கலான பண்புகளைப் பயன்படுத்த வேண்டாம். Alternatively, if the இயல்புநிலை மதிப்பு can be explicitly specified, it can be overridden with the :ref:`_PropertyCanRevert() <class_Object_private_method__property_can_revert>` and :ref:`_PropertyGetRevert() <class_Object_private_method__property_get_revert>` methods.
uk: Аналізатор не розуміє цей код і повертається до значення за замовчуванням для ``int``, ``0``. Однак під час запуску сцени або перевірки вузла з доданим сценарієм інструменту ``_number`` буде ``2``, а ``NumberWithBackingField`` поверне ``5``. Ця різниця може викликати плутанину. Щоб уникнути цього, не використовуйте складні властивості. Крім того, якщо значення за замовчуванням можна вказати явно, його можна замінити за допомогою методів :ref:`_PropertyCanRevert() <class_Object_private_method__property_can_revert>` і :ref:`_PropertyGetRevert() <class_Object_private_method__property_get_revert>`.
zh_cn: 分析器无法理解该代码，因此会回退到 ``int`` 的默认值 ``0``\ 。但是，在运行场景或检查带有附有工具脚本的节点时，\ ``_number`` 将为 ``2``\ ，而 ``NumberWithBackingField`` 将返回 ``5``\ 。这种差异可能会导致令人困惑的行为。为避免这种情况，请不要使用复杂属性。或者，如果可以明确指定默认值，则可以使用 :ref:`_PropertyCanRevert() <class_Object_private_method__property_can_revert>` 和 :ref:`_PropertyGetRevert() <class_Object_private_method__property_get_revert>` 方法覆盖它。
zh_tw: 分析器無法解析這段程式碼，因此會回退為 ``int`` 的預設值 ``0``。但執行場景或檢查有 tool script 的節點時，``_number`` 會是 ``2``，而 ``NumberWithBackingField`` 會回傳 ``5``。這樣的落差可能導致行為混淆。為避免這種情況，請避免用複雜屬性。如果可以明確指定預設值，也可用 :ref:`_PropertyCanRevert() <class_Object_private_method__property_can_revert>` 和 :ref:`_PropertyGetRevert() <class_Object_private_method__property_get_revert>` 方法覆寫。

source: Any type of ``Resource`` or ``Node`` can be exported. The property editor shows a user-friendly assignment dialog for these types. This can be used instead of ``GD.Load`` and ``GetNode``. See :ref:`Nodes and Resources <doc_c_sharp_exports_nodes>`.
ga: Is féidir aon chineál ``Acmhainn`` nó ``Nóid`` a easpórtáil. Taispeánann an t-eagarthóir maoine dialóg sannacháin atá éasca le húsáid do na cineálacha seo. Is féidir é seo a úsáid in ionad ``GD.Load`` agus ``GetNode``. Féach :ref:`Nóid agus Acmhainní <doc_c_sharp_exports_nodes>`.
it: È possibile esportare qualsiasi tipo di ``Resource`` o ``Node``. L'editor delle proprietà mostra una finestra di dialogo di assegnazione intuitiva per questi tipi. Questa si può utilizzare al posto di ``GD.Load`` e ``GetNode``. Consultare :ref:`Nodi e Risorse <doc_c_sharp_exports_nodes>`.
ru: Можно экспортировать любой тип ``Resource`` или ``Node``. Редактор свойств отображает удобный диалог назначения для этих типов. Его можно использовать вместо ``GD.Load`` и ``GetNode``. См. :ref:`Nodes and Resources <doc_c_sharp_exports_nodes>`.
ta: எந்த வகையான `` வளம்`` அல்லது `` முனை`` ஏற்றுமதி செய்யலாம். இந்த வகைகளுக்கான பயனர் நட்பு ஒதுக்கீட்டு உரையாடலை சொத்து எடிட்டர் காட்டுகிறது. `` Gd.load`` மற்றும் `` getNode`` என்பதற்கு பதிலாக இதைப் பயன்படுத்தலாம். காண்க: குறிப்பு: `முனைகள் மற்றும் வளங்கள் <doc_c_sharp_exports_nodes>`.
uk: Можна експортувати будь-який тип ``Resource`` або ``Node``. Редактор властивостей показує зручне діалогове вікно призначення для цих типів. Це можна використовувати замість ``GD.Load`` і ``GetNode``. Перегляньте :ref:`Nodes and Resources <doc_c_sharp_exports_nodes>`.
zh_tw: 任何 ``Resource`` 或 ``Node`` 型別都可以匯出。屬性編輯器會針對這些型別顯示易於指定的對話框。這通常可以取代 ``GD.Load`` 和 ``GetNode``。詳見 :ref:`節點與資源 <doc_c_sharp_exports_nodes>`。

source: Grouping exports
ga: Onnmhairí grúpála
it: Raggruppare le esportazioni
ru: Группировка экспорта
ta: ஏற்றுமதி தொகுத்தல்
uk: Групування експорту
zh_cn: 导出分组
zh_tw: 匯出屬性分組

source: It is possible to group your exported properties inside the Inspector with the ``[ExportGroup]`` attribute. Every exported property after this attribute will be added to the group. Start a new group or use ``[ExportGroup("")]`` to break out.
ga: Is féidir do chuid maoine easpórtáilte a ghrúpáil taobh istigh den Chigire leis an tréith ''[ExportGroup]''. Cuirfear gach maoin a onnmhairítear tar éis na tréithe seo leis an ngrúpa. Tosaigh grúpa nua nó úsáid ''[ExportGroup("")]'' chun briseadh amach.
it: È possibile raggruppare le proprietà esportate all'interno dell'Ispettore con l'attributo ``[ExportGroup]``. Ogni proprietà esportata dopo questo attributo sarà aggiunta al gruppo. Crea un nuovo gruppo o usa ``[ExportGroup("")]`` per separare tra gruppi.
ru: Экспортированные свойства можно сгруппировать в Инспекторе с помощью атрибута ``[ExportGroup]``. Каждое экспортированное свойство после этого атрибута будет добавлено в группу. Создайте новую группу или используйте ``[ExportGroup("")]`` для разбиения.
ta: உங்கள் ஏற்றுமதி செய்யப்பட்ட பண்புகளை இன்ச்பெக்டருக்குள் `` [ஏற்றுமதி குழு] `` பண்புக்கூறு மூலம் தொகுக்க முடியும். இந்த பண்புக்கூறுக்குப் பிறகு ஏற்றுமதி செய்யப்பட்ட ஒவ்வொரு சொத்தும் குழுவில் சேர்க்கப்படும். ஒரு புதிய குழுவைத் தொடங்கவும் அல்லது `` [ஏற்றுமதி குழு ("")] `` ஆகியவற்றைப் பயன்படுத்தவும்.
uk: Експортовані властивості можна згрупувати в інспекторі за допомогою атрибута ``[ExportGroup]``. Кожне експортоване властивість після цього атрибута буде додано до групи. Створіть нову групу або використовуйте ``[ExportGroup("")]``, щоб вийти з неї.
zh_cn: 可以使用 ``[ExportGroup]`` 特性将导出的属性分组显示在检视器中。在此特性之后的每个导出的属性都将添加到该组中。开始一个新组，或使用 ``[ExportGroup("")]`` 进行分组结束。
zh_tw: 可以在屬性編輯器（Inspector）中，透過 ``[ExportGroup]`` 屬性將匯出屬性分組。這個屬性之後的每個匯出屬性都會加入該群組。開始新群組時，或用 ``[ExportGroup("")]`` 來結束目前群組。

source: The second argument of the attribute can be used to only group properties with the specified prefix.
ga: Is féidir an dara hargóint den tréith a úsáid chun airíonna grúpa amháin leis an réimír shonraithe.
it: Il secondo argomento dell'attributo si può utilizzare per raggruppare solo le proprietà con il prefisso specificato.
ru: Второй аргумент атрибута можно использовать только для группировки свойств с указанным префиксом.
ta: பண்புக்கூறின் இரண்டாவது உரையாடல் குறிப்பிட்ட முன்னொட்டுடன் குழு பண்புகளை மட்டுமே பயன்படுத்த முடியும்.
uk: Другий аргумент атрибута можна використовувати лише для групування властивостей із вказаним префіксом.
zh_cn: 该特性的第二个参数可用于仅将具有指定前缀的属性分组。
zh_tw: 屬性的第二個參數可用來僅分組具有指定前綴的屬性。
