Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/diagnostics/GD0301.po
Languages: ta

source: GD0301: The generic type argument must be a Variant compatible type
ta: GD0301: பொதுவான வகை உரையாடல் ஒரு மாறுபட்ட இணக்கமான வகையாக இருக்க வேண்டும்

source: **Rule ID**
ta: ** விதி ஐடி **

source: **Category**
ta: ** வகை **

source: Usage
ta: பயன்பாடு

source: **Fix is breaking or non-breaking**
ta: ** பிழைத்திருத்தம் உடைத்தல் அல்லது உடைக்காதது **

source: Breaking
ta: உடைத்தல்

source: **Enabled by default**
ta: ** இயல்புநிலையாக இயக்கப்பட்டது **

source: Yes
ta: ஆம்

source: Cause
ta: காரணம்

source: An unsupported type is specified for a generic type argument when a :ref:`Variant-compatible type <c_sharp_variant_compatible_types>` is expected.
ta: ஒரு பொதுவான வகை வாதத்திற்கு ஆதரிக்கப்படாத வகை குறிப்பிடப்பட்டுள்ளது: ref: `மாறுபாடு-இணக்கமான வகை <c_sharp_variant_compatible_types>` எதிர்பார்க்கப்படுகிறது.

source: Rule description
ta: விதி விளக்கம்

source: When a generic type parameter is annotated with the ``[MustBeVariant]`` attribute, the generic type is required to be a Variant-compatible type. For example, the generic ``Godot.Collections.Array<T>`` type only supports items of a type that can be converted to Variant.
ta: ஒரு பொதுவான வகை அளவுரு `` [mustbevariant] `` பண்புக்கூறுடன் சிறுகுறிப்பு செய்யப்படும்போது, பொதுவான வகை மாறுபாடு-இணக்கமான வகையாக இருக்க வேண்டும். எடுத்துக்காட்டாக, பொதுவான `` kudot.collections.array <t> `` வகை மாறுபாட்டாக மாற்றக்கூடிய ஒரு வகையின் உருப்படிகளை மட்டுமே ஆதரிக்கிறது.

source: How to fix violations
ta: மீறல்களை எவ்வாறு சரிசெய்வது

source: To fix a violation of this rule, change the generic type argument to be a Variant-compatible type or use a different API that doesn't require the generic type argument to be a Variant-compatible type.
ta: இந்த விதியின் மீறலை சரிசெய்ய, பொதுவான வகை வாதத்தை மாறுபட்ட-இணக்கமான வகையாக மாற்றவும் அல்லது வேறுபட்ட பநிஇ ஐப் பயன்படுத்தவும், இது பொதுவான வகை உரையாடல் மாறுபட்ட-இணக்கமான வகையாக இருக்க தேவையில்லை.

source: When to suppress warnings
ta: எப்போது எச்சரிக்கைகளை அடக்குவது

source: Do not suppress a warning from this rule. API that contains generic type arguments annotated with the ``[MustBeVariant]`` attribute usually has this requirement because the values will be passed to the engine, if the type can't be marshalled it will result in runtime errors.
ta: இந்த விதியிலிருந்து ஒரு எச்சரிக்கையை அடக்க வேண்டாம். `` [Mastbevariant] `` பண்புக்கூறுடன் சிறுகுறிப்பு செய்யப்பட்ட பொதுவான வகை வாதங்களைக் கொண்ட பநிஇ வழக்கமாக இந்தத் தேவையைக் கொண்டுள்ளது, ஏனெனில் மதிப்புகள் இயந்திரத்திற்கு அனுப்பப்படும், வகையை மார்சல் செய்ய முடியாவிட்டால் அது இயக்க நேர பிழைகளை ஏற்படுத்தும்.
