Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdextension/what_*_gdextension.po
Languages: ga, ta, uk, zh_tw

source: What is GDExtension?
ga: Cad é GDExtension?
ta: Gdextension என்றால் என்ன?
uk: Що таке GDExtension?
zh_tw: 什麼是 GDExtension？

source: Introduction
ga: Réamhrá
ta: அறிமுகம்
uk: Вступ
zh_tw: 前言

source: **GDExtension** is a Godot-specific technology that lets the engine interact with native `shared libraries <https://en.wikipedia.org/wiki/Library_(computing)#Shared_libraries>`__ at run-time. You can use it to run native code without compiling it with the engine.
ga: Is teicneolaíocht Godot-shonrach é **GDEExtension** a ligeann don inneall idirghníomhú le leabharlanna comhroinnte dúchais <https://en.wikipedia.org/wiki/Library_(computing)#Shared_libraries>`__ ag am rite. Is féidir leat é a úsáid chun cód dúchais a rith gan é a thiomsú leis an inneall.
ta: . சொந்த குறியீட்டை இயந்திரத்துடன் தொகுக்காமல் இயக்க இதைப் பயன்படுத்தலாம்.
uk: **GDExtension** — це спеціальна технологія Godot, яка дозволяє механізму взаємодіяти зі власними `спільними бібліотеками <https://en.wikipedia.org/wiki/Library_(computing)#Shared_libraries>`__ під час виконання. Ви можете використовувати його для запуску рідного коду, не компілюючи його за допомогою двигуна.

source: GDExtension is *not* a scripting language and has no relation to :ref:`GDScript <doc_gdscript>`.
ga: *Ní* teanga scriptithe é Síneadh GDE agus níl aon bhaint aige le :ref:`GDScript <doc_gdscript>`.
ta: Gdextension * ஒரு ச்கிரிப்டிங் மொழி அல்ல, இதற்கு எந்த தொடர்பும் இல்லை: குறிப்பு: `gdscript <doc_gdscript>`.
uk: GDExtension *не* є мовою сценаріїв і не має відношення до :ref:`GDScript <doc_gdscript>`.
zh_tw: GDExtension *不是* 指令碼語言，也與 :ref:`GDScript <doc_gdscript>` 無關。

source: Differences between GDExtension and C++ modules
ga: Difríochtaí idir modúil GDExtension agus C ++
ta: Gdextension மற்றும் C ++ தொகுதிகளுக்கு இடையிலான வேறுபாடுகள்
uk: Відмінності між модулями GDExtension і C++
zh_tw: GDExtension 與 C++ 模組的差異

source: You can use both GDExtension and :ref:`C++ modules <doc_custom_modules_in_cpp>` to run C or C++ code in a Godot project.
ga: Is féidir leat an dá GDE Extension agus :ref:` modúil C++ <doc_custom_modules_in_cpp>` a úsáid chun cód C nó C++ a rith i dtionscadal Godot.
ta: நீங்கள் gdextension இரண்டையும் பயன்படுத்தலாம்: ref: `c ++ தொகுதிகள் <doc_custom_modules_in_cpp>` ஒரு கோடோட் திட்டத்தில் சி அல்லது சி ++ குறியீட்டை இயக்க.
uk: Ви можете використовувати як GDExtension, так і :ref:`модулі C++ <doc_custom_modules_in_cpp>` для запуску коду C або C++ у проекті Godot.
zh_tw: 你可以同時使用 GDExtension 和 :ref:`C++ 模組 <doc_custom_modules_in_cpp>` 在 Godot 專案中執行 C 或 C++ 程式碼。

source: They also both allow you to integrate third-party libraries into Godot. The one you should choose depends on your needs.
ga: Ligeann siad araon duit leabharlanna tríú páirtí a chomhtháthú i Godot. Braitheann an ceann ba chóir duit a roghnú ar do riachtanais.
ta: மூன்றாம் தரப்பு நூலகங்களை கோடோட்டில் ஒருங்கிணைக்க அவை இரண்டும் உங்களை அனுமதிக்கின்றன. நீங்கள் தேர்வு செய்ய வேண்டிய ஒன்று உங்கள் தேவைகளைப் பொறுத்தது.
uk: Вони також дозволяють інтегрувати бібліотеки сторонніх розробників у Godot. Той, який ви повинні вибрати, залежить від ваших потреб.
zh_tw: 這兩者也都能將第三方函式庫整合進 Godot。你該選哪一種方式，取決於你的需求。

source: Our long-term goal is that GDExtensions targeting an earlier version of Godot will work in later minor versions, but not vice-versa. For example, a GDExtension targeting Godot 4.2 should work just fine in Godot 4.3, but one targeting Godot 4.3 won't work in Godot 4.2.
ga: Is é ár sprioc fadtéarmach ná go n-oibreoidh GDExtensions atá dírithe ar leagan níos luaithe de Godot i mionleaganacha níos déanaí, ach ní a mhalairt. Mar shampla, ba chóir go n-oibreodh GDExtension atá dírithe ar Godot 4.2 go breá i Godot 4.3, ach ní oibreoidh ceann a dhíríonn ar Godot 4.3 i Godot 4.2.
ta: எங்கள் நீண்டகால குறிக்கோள் என்னவென்றால், கோடோட்டின் முந்தைய பதிப்பைக் குறிவைக்கும் gdextensions பிற்கால சிறிய பதிப்புகளில் வேலை செய்யும், ஆனால் அதற்கு நேர்மாறாக அல்ல. எடுத்துக்காட்டாக, கோடோட் 4.2 ஐ குறிவைக்கும் ஒரு gdextension கோடோட் 4.3 இல் நன்றாக வேலை செய்ய வேண்டும், ஆனால் கோடோட் 4.3 ஐ குறிவைக்கும் ஒருவர் கோடோட் 4.2 இல் செயல்படாது.
uk: Наша довгострокова мета полягає в тому, щоб GDExtensions, націлені на попередню версію Godot, працювали в наступних проміжних версіях, але не навпаки. Наприклад, GDExtension, націлене на Godot 4.2, має добре працювати в Godot 4.3, але розширення, націлене на Godot 4.3, не працюватиме в Godot 4.2.

source: However, GDExtension is currently *experimental*, which means that we may break compatibility in order to fix major bugs or include critical features. For example, GDExtensions created for Godot 4.0 aren't compatible with Godot 4.1 (see :ref:`updating_your_gdextension_for_godot_4_1`).
ga: Mar sin féin, tá GDExtension faoir* turgnamh* faoi láthair, rud a chiallaíonn go bhféadfaimis comhoiriúnacht a bhriseadh d'fhonn fabhtanna móra a shocrú nó gnéithe criticiúla Mar shampla, níl GDExtensions a cruthaíodh do Godot 4.0 comhoiriúnach le Godot 4.1 (féach: ref: `updating_your_gdextension_for_godot_4_1`).
ta: இருப்பினும், gdextension தற்போது *சோதனை *ஆகும், அதாவது பெரிய பிழைகளை சரிசெய்ய அல்லது முக்கியமான அம்சங்களைச் சேர்ப்பதற்கு நாங்கள் பொருந்தக்கூடிய தன்மையை உடைக்கலாம். எடுத்துக்காட்டாக, கோடோட் 4.0 க்காக உருவாக்கப்பட்ட gdextensions கோடோட் 4.1 உடன் பொருந்தாது (பார்க்க: குறிப்பு: `புதுப்பித்தல்_ உங்கள்_சி டெக்ச்டென்சன்_ஃபோர்_கோடோட்_4_1`).
uk: Однак наразі GDExtension є *експериментальним*, що означає, що ми можемо порушити сумісність, щоб виправити основні помилки або включити критичні функції. Наприклад, GDExtensions, створені для Godot 4.0, несумісні з Godot 4.1 (див. :ref:`updating_your_gdextension_for_godot_4_1`).
zh_tw: 不過，GDExtension 目前屬於*實驗性*功能，未來若需修正重大錯誤或加入關鍵功能，仍有可能破壞相容性。例如，針對 Godot 4.0 製作的 GDExtension 無法在 Godot 4.1 使用（詳情見 :ref:`updating_your_gdextension_for_godot_4_1`）。

source: Advantages of GDExtension
ga: Buntáistí GDExtension
ta: Gdextension இன் நன்மைகள்
uk: Переваги GDExtension
zh_tw: GDExtension 的優點

source: Unlike modules, GDExtension doesn't require compiling the engine's source code, making it easier to distribute your work. It gives you access to most of the API available to GDScript and C#, allowing you to code game logic with full control regarding performance. It's ideal if you need high-performance code you'd like to distribute as an add-on in the :ref:`asset library <doc_what_is_assetlib>`.
ga: Murab ionann agus modúil, ní éilíonn GDEExtension cód foinse an innill a thiomsú, rud a fhágann gur fusa do chuid oibre a dháileadh. Tugann sé rochtain duit ar an gcuid is mó den API atá ar fáil do GDScript agus C#, rud a ligeann duit loighic cluiche a chódú le smacht iomlán ar fheidhmíocht. Tá sé oiriúnach má tá cód ardfheidhmíochta uait ar mhaith leat a dháileadh mar bhreiseán sa :ref:`leabharlann sócmhainní <doc_what_is_assetlib>`.
ta: தொகுதிக்கூறுகளைப் போலன்றி, gdextension இயந்திரத்தின் மூலக் குறியீட்டை தொகுக்க தேவையில்லை, இது உங்கள் வேலையை விநியோகிப்பதை எளிதாக்குகிறது. இது GDSCRIPT மற்றும் C#க்கு கிடைக்கக்கூடிய பெரும்பாலான பநிஇ க்கான அணுகலை உங்களுக்கு வழங்குகிறது, இது செயல்திறன் தொடர்பான முழு கட்டுப்பாட்டுடன் விளையாட்டு தர்க்கத்தை குறியிட உங்களை அனுமதிக்கிறது. உங்களுக்கு உயர் செயல்திறன் குறியீடு தேவைப்பட்டால் இது சிறந்தது: ref: `சொத்து நூலகம் <doc_what_is_assetlib>`.
uk: На відміну від модулів, GDExtension не потребує компіляції вихідного коду двигуна, що полегшує розповсюдження вашої роботи. Він надає вам доступ до більшості API, доступних для GDScript і C#, дозволяючи вам кодувати логіку гри з повним контролем продуктивності. Це ідеально, якщо вам потрібен високопродуктивний код, який ви хочете розповсюдити як доповнення до :ref:`бібліотеки активів <doc_what_is_assetlib>`.
zh_tw: 與模組不同，GDExtension 不需要編譯引擎原始碼，使你的作品更容易分發。你可以存取 GDScript 與 C# 幾乎所有的 API，讓你編寫遊戲邏輯時能完全掌控效能。如果你需要將高效能程式碼作為外掛發布到 :ref:`素材庫 <doc_what_is_assetlib>`，這是理想的選擇。

source: Also:
ga: Chomh maith leis sin:
ta: மேலும்:
uk: також:
zh_tw: 此外：

source: GDExtension is not limited to C and C++. Thanks to :ref:`third-party bindings <doc_what_is_gdnative_third_party_bindings>`, you can use it with many other languages.
ga: Níl síneadh GDE teoranta do C agus C++. Buíochas le :ref:`ceangail tríú páirtí <doc_what_is_gdnative_third_party_bindings>`, is féidir leat é a úsáid le go leor teangacha eile.
ta: Gdextension C மற்றும் C ++ க்கு மட்டுப்படுத்தப்படவில்லை. இதற்கு நன்றி: குறிப்பு: `மூன்றாம் தரப்பு பிணைப்புகள் <doc_what_is_gdnative_third_party_bindings>`, நீங்கள் இதை பல மொழிகளுடன் பயன்படுத்தலாம்.
uk: GDExtension не обмежується C і C++. Завдяки :ref:`прив’язкам сторонніх розробників <doc_what_is_gdnative_third_party_bindings>` ви можете використовувати його з багатьма іншими мовами.
zh_tw: GDExtension 不僅限於 C 和 C++。多虧有 :ref:`第三方綁定 <doc_what_is_gdnative_third_party_bindings>`，你還可以用許多其他語言來開發。

source: You can use the same compiled GDExtension library in the editor and exported project. With C++ modules, you have to recompile all the export templates you plan to use if you require its functionality at run-time.
ga: Is féidir leat an leabharlann GDExtension tiomsaithe céanna a úsáid sa tionscadal eagarthóra agus onnmhairithe. Le modúil C ++, caithfidh tú na teimpléid onnmhairithe go léir atá ar intinn agat a úsáid a aththiomsú má theastaíonn a fheidhmiúlacht uait ag am rith.
ta: எடிட்டர் மற்றும் ஏற்றுமதி செய்யப்பட்ட திட்டத்தில் அதே தொகுக்கப்பட்ட gdextension நூலகத்தைப் பயன்படுத்தலாம். சி ++ தொகுதிகள் மூலம், நீங்கள் பயன்படுத்த திட்டமிட்டுள்ள அனைத்து ஏற்றுமதி வார்ப்புருக்கள் ரன்-நேரத்தில் அதன் செயல்பாடு தேவைப்பட்டால் நீங்கள் பயன்படுத்த வேண்டும்.
uk: Ви можете використовувати ту саму скомпільовану бібліотеку GDExtension у редакторі та експортованому проекті. З модулями C++ вам доведеться перекомпілювати всі шаблони експорту, які ви плануєте використовувати, якщо вам потрібна його функціональність під час виконання.

source: GDExtension only requires you to compile your library, not the whole engine. That's unlike C++ modules, which are statically compiled into the engine. Every time you change a module, you need to recompile the engine. Even with incremental builds, this process is slower than using GDExtension.
ga: Ní éilíonn GDExtension ach duit do leabharlann a thiomsú, ní an t-inneall iomlán. Sin murab ionann agus modúil C ++, a thiomsaítear go statach isteach san inneall. Gach uair a athraíonn tú modúl, ní mór duit an t-inneall a aththiomsú. Fiú amháin le tógáil incriminteacha, tá an próiseas seo níos moille ná GDExtension a úsáid.
ta: Gdextension உங்கள் நூலகத்தை தொகுக்க வேண்டும், முழு இயந்திரமும் அல்ல. இது சி ++ தொகுதிகள் போலல்லாது, அவை நிலையான முறையில் இயந்திரத்தில் தொகுக்கப்படுகின்றன. ஒவ்வொரு முறையும் நீங்கள் ஒரு தொகுதியை மாற்றும்போது, நீங்கள் இயந்திரத்தை மீண்டும் தொகுக்க வேண்டும். அதிகரிக்கும் கட்டடங்களுடன் கூட, இந்த செயல்முறை GDextension ஐப் பயன்படுத்துவதை விட மெதுவாக உள்ளது.
uk: GDExtension вимагає лише компіляції вашої бібліотеки, а не всього механізму. Це на відміну від модулів C++, які статично скомпільовані в механізм. Щоразу, коли ви змінюєте модуль, вам потрібно перекомпілювати механізм. Навіть із поступовими збірками цей процес повільніший, ніж використання GDExtension.
zh_tw: GDExtension 只需要你編譯自己的函式庫，不需要重新編譯整個引擎。這點和 C++ 模組不同，後者必須靜態編譯進引擎主體。每次變更模組內容，都必須重編整個引擎。即使使用增量編譯，這個流程還是會比 GDExtension 慢許多。

source: Advantages of C++ modules
ga: Buntáistí modúil C ++
ta: சி ++ தொகுதிகளின் நன்மைகள்
uk: Переваги модулів C++
zh_tw: C++ 模組的優點

source: We recommend :ref:`C++ modules <doc_custom_modules_in_cpp>` in cases where GDExtension isn't enough:
ga: Molaimid :ref:`Modúil C++ <doc_custom_modules_in_cpp>` i gcásanna nach leor GDE Extension:
ta: நாங்கள் பரிந்துரைக்கிறோம்: குறிப்பு: `சி ++ தொகுதிகள் <doc_custom_modules_in_cpp>` gdextension போதுமானதாக இல்லாத சந்தர்ப்பங்களில்:
uk: Ми рекомендуємо :ref:`C++ модулі <doc_custom_modules_in_cpp>` у випадках, коли GDExtension недостатньо:
zh_tw: 如果 GDExtension 無法滿足需求時，建議使用 :ref:`C++ 模組 <doc_custom_modules_in_cpp>`：

source: C++ modules provide deeper integration into the engine. GDExtension's access is not as deep as static modules.
ga: Soláthraíonn modúil C ++ comhtháthú níos doimhne san inneall. Níl rochtain GDExtension chomh domhain le modúil statacha.
ta: சி ++ தொகுதிகள் இயந்திரத்தில் ஆழமான ஒருங்கிணைப்பை வழங்குகின்றன. Gdextension இன் அணுகல் நிலையான தொகுதிகள் போல ஆழமாக இல்லை.
uk: Модулі C++ забезпечують більш глибоку інтеграцію в механізм. Доступ GDExtension не такий глибокий, як статичні модулі.
zh_tw: C++ 模組可以與引擎有更深度的整合。GDExtension 的存取層級不如靜態模組。

source: You can use C++ modules to provide additional features in a project without carrying native library files around. This extends to exported projects.
ga: Is féidir leat modúil C++ a úsáid chun gnéithe breise a sholáthar i dtionscadal gan comhaid leabharlainne dúchais a iompar timpeall. Síneann sé seo chuig tionscadail easpórtála.
ta: சொந்த நூலகக் கோப்புகளைச் சுமக்காமல் ஒரு திட்டத்தில் கூடுதல் அம்சங்களை வழங்க சி ++ தொகுதிகள் பயன்படுத்தலாம். இது ஏற்றுமதி செய்யப்பட்ட திட்டங்களுக்கு நீண்டுள்ளது.
uk: Ви можете використовувати модулі C++, щоб надати додаткові функції в проекті, не маючи з собою файлів рідної бібліотеки. Це поширюється на експортовані проекти.
zh_tw: 你可以透過 C++ 模組為專案加入額外功能，不必攜帶原生函式庫檔案。這同樣適用於匯出的專案。

source: If you notice that specific systems are not accessible via GDExtension but are via custom modules, feel free to open an issue on the `godot-cpp repository <https://github.com/godotengine/godot-cpp>`__ to discuss implementation options for exposing the missing functionality.
ga: Má thugann tú faoi deara nach bhfuil rochtain ar chórais ar leith trí GDExtension ach go bhfuil siad trí mhodúil saincheaptha, ná bíodh drogall ort ceist a oscailt ar an stór `godot-cpp <https://github.com/godotenginine/godot-cpp>`__ chun cur i bhfeidhm a phlé roghanna chun an fheidhmiúlacht atá in easnamh a nochtadh.
ta: குறிப்பிட்ட அமைப்புகள் gdextension வழியாக அணுக முடியாது என்பதை நீங்கள் கவனித்தால், ஆனால் தனிப்பயன் தொகுதிகள் வழியாக இருந்தால், `கோடோட்-சிபிபி களஞ்சியத்தில் <https://github.com/godotengine/godot-cpp>` __ __ __ காணாமல் போன செயல்பாட்டை அம்பலப்படுத்துவதற்கான விருப்பங்கள்.
uk: Якщо ви помітили, що певні системи недоступні через GDExtension, а доступні через користувальницькі модулі, не соромтеся відкривати питання в репозиторії godot-cpp <https://github.com/godotengine/godot-cpp>`__, щоб обговорити впровадження варіанти для виявлення відсутньої функціональності.
zh_tw: 如果你發現有些功能只能透過自訂模組存取，而 GDExtension 無法做到，歡迎在 `godot-cpp repository <https://github.com/godotengine/godot-cpp>`__ 提出議題，討論如何實作並開放這些缺失的功能。

source: Supported languages
ga: Teangacha tacaithe
ta: உதவி மொழிகள்
uk: Підтримувані мови
zh_tw: 支援的語言

source: The Godot developers officially support the following language bindings for GDExtension:
ga: Tacaíonn forbróirí Godot go hoifigiúil leis na ceangail teanga seo a leanas do GDExtension:
ta: Gdextension க்கான பின்வரும் மொழி பிணைப்புகளை கோடோட் உருவாக்குபவர்கள் அதிகாரப்பூர்வமாக ஆதரிக்கின்றனர்:
uk: Розробники Godot офіційно підтримують наступні мовні прив’язки для GDExtension:
zh_tw: Godot 開發團隊官方支援以下 GDExtension 語言綁定：

source: C++ :ref:`(tutorial) <doc_gdextension_cpp_example>`
ga: C++ :tag:`(teagasc) <doc_gdextension_cpp_example>`
ta: C ++: ref: `(பயிற்சி) <doc_gdextension_cpp_example>`
uk: C++ :ref:`(підручник) <doc_gdextension_cpp_example>`
zh_tw: C++ :ref:`（教學） <doc_gdextension_cpp_example>`

source: There are no plans to support additional languages with GDExtension officially. That said, the community offers several bindings for other languages (see below).
ga: Níl aon phleananna ann chun tacú le teangacha breise le GDExtension go hoifigiúil. É sin ráite, cuireann an pobal roinnt ceangail ar fáil do theangacha eile (féach thíos).
ta: Gdextension உடன் கூடுதல் மொழிகளை அதிகாரப்பூர்வமாக ஆதரிக்க எந்த திட்டமும் இல்லை. சமூகம் பிற மொழிகளுக்கு பல பிணைப்புகளை வழங்குகிறது (கீழே காண்க).
uk: Офіційно підтримувати додаткові мови за допомогою GDExtension не планується. Проте спільнота пропонує кілька прив’язок для інших мов (див. нижче).
zh_tw: 官方暫無計畫為 GDExtension 提供更多語言支援。不過社群有提供多種其他語言的綁定（見下方列表）。

source: The bindings below are developed and maintained by the community:
ga: Déanann an pobal na ceangail thíos a fhorbairt agus a chothabháil:
ta: கீழே உள்ள பிணைப்புகள் சமூகத்தால் உருவாக்கப்பட்டு பராமரிக்கப்படுகின்றன:
uk: Наведені нижче прив’язки розроблено та підтримується спільнотою:
zh_tw: 以下語言綁定由社群開發並維護：

source: `Go <https://github.com/grow-graphics/gd>`__
ta: `செல்லுங்கள் <https://github.com/grow-graphics/gd> __ __

source: `Haxe <https://hxgodot.github.io/>`__
ta: `Haxe <htts: //hxgodot.gith.ion.io/> __

source: `Rust <https://github.com/godot-rust/gdext>`__
ta: `துரு <https://github.com/godot-rust/gdext> ____ __

source: `Swift <https://github.com/migueldeicaza/SwiftGodot>`__
ta: `ச்விஃப்ட் <https://github.com/migueldeicaza/swiftgodot> ____ __ __

source: Not all bindings mentioned here may be production-ready. Make sure to research options thoroughly before starting a project with one of those. Also, double-check whether the binding is compatible with the Godot version you're using.
ga: Ní fhéadfaidh gach ceangail a luaitear anseo a bheith réidh le táirgeadh. Déan cinnte taighde go críochnúil ar roghanna sula dtosaíonn tú ar thionscadal le ceann acu Chomh maith leis sin, seiceáil faoi dhó an bhfuil an ceangailt comhoiriúnach leis an leagan Godot atá á úsáid agat.
ta: இங்கு குறிப்பிடப்பட்டுள்ள அனைத்து பிணைப்புகளும் விளைவாக்கம் தயாராக இருக்கக்கூடாது. அவற்றில் ஒன்றைக் கொண்ட ஒரு திட்டத்தைத் தொடங்குவதற்கு முன் விருப்பங்களை முழுமையாக ஆராய்ச்சி செய்வதை உறுதிசெய்க. மேலும், நீங்கள் பயன்படுத்தும் கோடோட் பதிப்போடு பிணைப்பு பொருந்துமா என்பதை இருமுறை சரிபார்க்கவும்.
uk: Не всі палітурки, згадані тут, можуть бути готові до виробництва. Обов’язково ретельно вивчіть варіанти, перш ніж розпочинати проект із одним із них. Також ще раз перевірте, чи прив’язка сумісна з версією Godot, яку ви використовуєте.
zh_tw: 本頁所列的語言綁定未必都適合正式專案使用。建議你在專案開始前先仔細評估每個選項，也請再次確認該綁定是否與你目前使用的 Godot 版本相容。

source: Version compatibility
ga: Comhoiriúnacht leagan
ta: பதிப்பு பொருந்தக்கூடிய தன்மை
uk: Сумісність версій
zh_tw: 版本相容性

source: GDExtension add-ons compiled for a given Godot version are only guaranteed to work with the same minor release series. For example, a GDExtension add-on compiled for Godot 4.0 will only work with Godot 4.0, 4.0.1, 4.0.2. In addition, GDExtension is not compatible with Godot 3.x.
ga: Ní ráthaítear ach go n-oibreoidh breiseáin GDExtension a thiomsaítear le haghaidh leagan Godot ar leith leis an tsraith mionscaoileadh céanna. Mar shampla, ní oibreoidh breiseán GDExtension a thiomsaítear le haghaidh Godot 4.0 ach le Godot 4.0, 4.0.1, 4.0.2. Ina theannta sin, níl GDExtension comhoiriúnach le Godot 3.x.
ta: கொடுக்கப்பட்ட கோடோட் பதிப்பிற்காக தொகுக்கப்பட்ட gdextension துணை நிரல்கள் அதே சிறிய வெளியீட்டுத் தொடருடன் மட்டுமே பணியாற்ற பொறுப்பு அளிக்கப்படுகின்றன. எடுத்துக்காட்டாக, கோடோட் 4.0 க்காக தொகுக்கப்பட்ட ஒரு gdextension Add-windoot 4.0, 4.0.1, 4.0.2 உடன் மட்டுமே செயல்படும். கூடுதலாக, gdextension கோடோட் 3.x உடன் பொருந்தாது.
uk: Додатки GDExtension, скомпільовані для певної версії Godot, гарантовано працюватимуть лише з тими ж незначними випусками. Наприклад, надбудова GDExtension, скомпільована для Godot 4.0, працюватиме лише з Godot 4.0, 4.0.1, 4.0.2. Крім того, GDExtension несумісний із Godot 3.x.

source: GDExtension add-ons are also only compatible with engine builds that use the level of floating-point precision the extension was compiled for. This means that if you use an engine build with double-precision floats, the extension must also be compiled for double-precision floats. See :ref:`doc_large_world_coordinates` for details.
ga: Níl breiseáin GDExtension comhoiriúnach ach le tógáil inneall a úsáideann an leibhéal cruinneas pointe snámh a thiomsaíodh an síneadh dó. Ciallaíonn sé seo má úsáideann tú tógáil inneall le snámha cruinneas dúbailte, caithfear an síneadh a thiomsú freisin le haghaidh snámha cruinneas dúbailte. Féach:ref: `doc_large_world_coordinates` le haghaidh sonraí.
ta: Gdextension துணை நிரல்கள் எஞ்சின் கட்டமைப்போடு மட்டுமே பொருந்தக்கூடியவை, அவை மிதக்கும்-புள்ளி துல்லியத்தின் அளவைப் பயன்படுத்துகின்றன. இதன் பொருள் என்னவென்றால், நீங்கள் இரட்டை துல்லியமான மிதவைகளுடன் ஒரு எஞ்சின் கட்டமைப்பைப் பயன்படுத்தினால், நீட்டிப்பு இரட்டை துல்லியமான மிதவைகளுக்கும் தொகுக்கப்பட வேண்டும். காண்க: குறிப்பு: விவரங்களுக்கு `doc_large_world_coordinates`.
uk: Додатки GDExtension також сумісні лише зі збірками механізмів, які використовують рівень точності числа з плаваючою комою, для якого було скомпільовано розширення. Це означає, що якщо ви використовуєте збірку двигуна з плаваючими числами подвійної точності, розширення також потрібно скомпільувати для плаваючих значень подвійної точності. Дивіться :ref:`doc_large_world_coordinates` для деталей.

source: **GDExtension** is a Godot-specific technology that lets the engine interact with native `shared libraries <https://en.wikipedia.org/wiki/Library_(computing)#Shared_libraries>`__ at runtime. You can use it to run native code without compiling it with the engine.
zh_tw: **GDExtension** 是 Godot 專用的技術，允許引擎在執行時與原生 `共用函式庫 <https://en.wikipedia.org/wiki/Library_(computing)#Shared_libraries>`__ 互動。你可以利用它在不需要重新編譯引擎的情況下執行原生程式碼。

source: GDExtension is currently *experimental*, which means that we may break compatibility in order to fix major bugs or include critical features.
zh_tw: GDExtension 目前屬於*實驗性*功能，這表示未來為了修正重大錯誤或加入關鍵功能，可能會破壞相容性。

source: You can use the same compiled GDExtension library in the editor and exported project. With C++ modules, you have to recompile all the export templates you plan to use if you require its functionality at runtime.
zh_tw: 你可以在編輯器和匯出專案時共用同一份已編譯的 GDExtension 函式庫。而 C++ 模組如果要在執行時提供這些功能，則必須為所有要用到的匯出範本重新編譯。

source: Usually, GDExtensions targeting an earlier version of Godot will work in later minor versions, but not vice-versa. For example, a GDExtension targeting Godot 4.2 should work just fine in Godot 4.3, but one targeting Godot 4.3 won't work in Godot 4.2.
zh_tw: 通常，針對較早版本 Godot 開發的 GDExtension 可以在後續的小版本中運作，但反過來則不行。例如，為 Godot 4.2 開發的 GDExtension 可以在 Godot 4.3 運作，但為 Godot 4.3 開發的 GDExtension 則無法在 Godot 4.2 運作。

source: For this reason, when creating GDExtensions, you may want to target the lowest version of Godot that has the features you need, *not* the most recent version of Godot. This can save you from needing to create multiple builds for different versions of Godot.
zh_tw: 因此，在開發 GDExtension 時，建議以支援你所需功能的最低 Godot 版本為目標，而非最新版本。如此可避免為不同 Godot 版本重複建置多份函式庫。

source: GDExtensions are also only compatible with engine builds that use the same level of floating-point precision the extension was compiled for. This means that if you use an engine build with double-precision floats, the extension must also be compiled for double-precision floats and use an ``extension_api.json`` file generated by your custom engine build. See :ref:`doc_large_world_coordinates` for details.
zh_tw: GDExtension 也僅支援與其編譯時浮點精度相同的引擎版本。也就是說，如果你使用的是雙精度浮點（double precision）引擎，GDExtension 也必須用雙精度建置，並且必須使用你自訂引擎版本所產生的 ``extension_api.json``。詳情請參考 :ref:`doc_large_world_coordinates`。

source: Generally speaking, if you build a custom version of Godot, you should generate an ``extension_api.json`` from it for your GDExtensions, because it may have some differences from official Godot builds.
zh_tw: 一般來說，如果你有自訂 Godot 引擎版本，建議使用該版本產生一份 ``extension_api.json`` 來給你的 GDExtension 使用，因為這可能與官方版本有細微差異。
