Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/01.game_setup.po
Languages: es, fr, ga, it, ja, ko, pl, ru, ta, tr, uk

source: Move the ground down ``1`` meter, in order to have a visible editor grid. A label in the bottom-left corner of the viewport tells you how much you're translating the node.
es: Mueve el suelo hacia abajo ``1`` metro para tener una cuadrícula visible en el editor. Una etiqueta en la esquina inferior izquierda de la ventana gráfica indica cuánto se está desplazando el nodo.
fr: Déplacez le sol vers le bas de ``1`` mètre, afin d'avoir une grille d'éditeur visible. Une étiquette dans le coin inférieur gauche de la fenêtre d'affichage vous indique dans quelle mesure vous déplacez le nœud.
ga: Bog an talamh síos méadar ''1'', chun greille eagarthóra infheicthe a bheith agat. Insíonn lipéad sa chúinne ag bun na láimhe clé den radharc duit cé mhéad atá tú ag aistriú an nód.
ja: 地面（ ``Ground`` ）を ``1`` メートル下に移動させます。ギズモを操作している間ビューポートの左下隅に表示されるラベルは、ノードをどれだけ平行移動させたかを示しています。
ko: 편집기 격자를 보이게 하기 위해 땅을 아래로 ``1``\ 미터 이동합니다. 뷰포트의 왼쪽 하단에 있는 레이블이 노드를 얼마나 이동시키고 있는지 알려줍니다.
ru: Переместите поверхность вниз на ``1`` метр. Ярлык в нижнем левом углу окна просмотра показывает, насколько вы перетащили узел.
ta: புலப்படும் எடிட்டர் கட்டம் இருக்க, தரையை `` 1`` மீட்டர் கீழே நகர்த்தவும். காட்சியின் கீழ்-இடது மூலையில் உள்ள ஒரு சிட்டை, நீங்கள் முனையை எவ்வளவு மொழிபெயர்க்கிறீர்கள் என்று உங்களுக்குக் கூறுகிறது.
tr: Görünür bir düzenleyici ızgarasına sahip olmak için zemini ``1`` metre aşağıya taşıyın. Çerçeve alanının sol alt köşesindeki bir etiket düğümü ne kadar hareket ettirdiğinizi gösterir.
uk: Перемістіть землю вниз на ``1`` метр. Мітка в нижньому лівому куті вікна перегляду повідомляє вам на скільки ви перетягуєте вузол.

source: Moving the *Ground* node down moves both children along with it. Ensure you move the *Ground* node, **not** the *MeshInstance3D* or the *CollisionShape3D*.
es: Mover el nodo *Ground* hacia abajo mueve a ambos hijos junto con él. Asegúrate de mover el nodo *Ground*, **no** el *MeshInstance3D* o el *CollisionShape3D*.
fr: Déplacer le nœud *Ground* vers le bas déplace les deux enfants avec lui. Assurez-vous de déplacer le nœud *Ground*, **et non** le nœud *MeshInstance3D* ou le nœud *CollisionShape3D*.
ga: Má bhogann tú an nód *Ground *síos bogann an bheirt pháistí in éineacht leis. Cinntigh go mbogann tú an nód *Ground *, **not** an *MeshInstance3D *nó an *CollisionShape3D *.
it: Spostando il nodo *Ground* verso il basso, si spostano entrambi i suoi nodi figli con esso. Assicurati di spostare il nodo *Ground*, **non** il *MeshInstance3D* o il *CollisionShape3D*.
ja: ``Ground`` ノードを下に動かすと、両方の子ノードも一緒に移動します。 :ref:`MeshInstance3D <class_MeshInstance3D>` または :ref:`CollisionShape3D <class_CollisionShape3D>` の子ノードではなく、親ノードの ``Ground`` ノードを移動していることを確認してください。
ko: *Ground* 노드를 아래로 이동하면 자식 노드들도 함께 이동합니다. *Ground* 노드를 이동하도록 하고, **절대** *MeshInstance3D*나 *CollisionShape3D*를 이동하지 않도록 주의하세요.
ru: При перемещении узла *Ground* вниз, оба дочерних узла перемещаются вместе с ним. Убедитесь, что вы перемещаете узел *Ground*, а **не** *MeshInstance3D* или *CollisionShape3D*.
ta: * தரை * முனையை கீழே நகர்த்துவது இரு குழந்தைகளையும் அதனுடன் நகர்த்துகிறது. நீங்கள்*தரை*முனையை நகர்த்துவதை உறுதிசெய்க ** ** ***meshinstance3d*அல்லது*collisionshape3d*.
tr: *Ground* düğümünü aşağı taşımak her iki alt ögeyi de beraberinde taşır. *Ground* düğümünü hareket ettirdiğinizden emin olun, *MeshInstance3D* veya *CollisionShape3D* düğümlerini **değil**.
uk: Разом із вузлом *Ground* вниз тягнуться і обоє його нащадків. Переконайтеся, що ви переміщуєте вузол *Ground*, а **не** *MeshInstance3D*, чи *CollisionShape3D*.

source: Ultimately, ``Ground``'s transform.position.y should be -1
es: Finalmente, el transform.position.y de ``Ground`` debería ser -1
fr: En fin de compte, transform.position.y de ``Ground`` devrait être -1
ga: I ndeireadh na dála, ba chóir go mbeadh ''Ground''s transform.position.y -1
it: Infine, la proprietà *transform.position.y* di ``Ground`` dovrebbe essere ``-1``
ja: 最終的に、 ``Ground`` のY座標の値(transform.position.y)が ``-1`` になるように変更しましょう
ko: 결국 ``Ground``의 transform.position.y는 -1이 되어야 합니다
ru: В конечном итоге, transform.position.y у ``Ground`` должен быть -1
ta: இறுதியில், `` கிரவுண்ட்`` இன் டிரான்ச்ஃபார்சன்.போசிசன்.ஒய் -1 ஆக இருக்க வேண்டும்
tr: Sonuç olarak, ``Ground`` un "transform.position.y" değeri -1 olmalıdır
uk: Врешті-решт transform.position.y для ``Ground`` має бути -1

source: Let's add a directional light so our scene isn't all grey. Select the ``Main`` node and add a child node :ref:`DirectionalLight3D <class_DirectionalLight3D>`.
es: Agreguemos luz direccional a nuestra escena así no es todo gris. Selecciona el nodo ``Main`` y agrega unn nodo hijo :ref:`DirectionalLight3D <class_DirectionalLight3D>`.
fr: Ajoutons une lumière directionnelle pour que notre scène ne soit pas entièrement grise. Sélectionnez le nœud ``Main`` et ajoutez un nœud enfant :ref:`DirectionalLight3D <class_DirectionalLight3D>`.
ga: Cuirimis solas treorach leis ionas nach mbeidh ár radharc liath ar fad. Roghnaigh an nód ``Príomh`` agus cuir nód linbh leis :ref:`DirectionalLight3D <class_DirectionalLight3D>`.
it: Per evitare di avere la nostra scena completamente grigia, aggiungiamo una luce direzionale. Seleziona il nodo ``Main`` e aggiungi un nodo figlio :ref:`DirectionalLight3D <class_DirectionalLight3D>`.
ja: シーンがグレー一色にならないように、ディレクショナルライトを追加しましょう。 ``Main`` ノードを選択し、子ノードとして :ref:`DirectionalLight3D <class_DirectionalLight3D>` を追加します。
ko: 씬이 모두 회색으로 보이지 않도록 방향성 조명을 추가하겠습니다. ``Main`` 노드를 선택하고 자식 노드로 :ref:`DirectionalLight3D <class_DirectionalLight3D>`\ 를 추가합니다.
ru: Давайте добавим направленный свет, чтобы наша сцена не была серой. Выберите узел ``Main`` и добавьте дочерний узел :ref:`DirectionalLight3D <class_DirectionalLight3D>`.
ta: ஒரு திசை ஒளியைச் சேர்ப்போம், எனவே எங்கள் காட்சி அனைத்தும் சாம்பல் அல்ல. `` மெயின்`` முனையைத் தேர்ந்தெடுத்து குழந்தை முனையைச் சேர்க்கவும்: குறிப்பு: `திசைதன்மை 3 டி <class_rectionallight3d>`.
tr: Sahnemizin tamamen gri olmaması için yönlü bir ışık ekleyelim. ``Main`` düğümünü seçin ve :ref:`DirectionalLight3D <class_DirectionalLight3D>` (yönlü ışık) alt düğümünü ekleyin.
uk: Давайте додамо спрямоване світло, щоб наша сцена не була повністю сірою. Виділіть вузол ``Main`` і додайте дочірній вузол :ref:`DirectionalLight3D <class_DirectionalLight3D>`.

source: We need to move and rotate the :ref:`DirectionalLight3D <class_DirectionalLight3D>` node. Move it up by clicking and dragging on the manipulator's green arrow and click and drag on the red arc to rotate it around the X-axis, until the ground is lit.
es: Necesitamos mover y rotar el nodo :ref:`DirectionalLight3D <class_DirectionalLight3D>`. Muévalo hacia arriba haciendo clic y arrastrando la flecha verde del manipulador y haga clic y arrastre el arco rojo para rotarlo alrededor del eje X, hasta que el suelo esté iluminado.
fr: Nous devons déplacer et faire pivoter le nœud :ref:`DirectionalLight3D <class_DirectionalLight3D>`. Déplacez-le vers le haut en cliquant et en faisant glisser la flèche verte du manipulateur et cliquez et faites glisser l'arc rouge pour le faire pivoter autour de l'axe X, jusqu'à ce que le sol soit éclairé.
ga: Ní mór dúinn an nód :ref:`DirectionalLight3D <class_DirectionalLight3D>` a bhogadh agus a rothlú. Bog suas é trí chliceáil agus tarraing ar saighead glas an láimhseála agus cliceáil agus tarraing ar an stua dearg chun é a rothlú timpeall an X-ais, go dtí go bhfuil an talamh soilsithe.
it: Abbiamo bisogno di muovere e ruotare il nodo :ref:`DirectionalLight3D <class_DirectionalLight3D>`. Spostalo verso l'alto cliccando e trascinando la freccia verde del manipolatore e clicca e trascina l'arco rosso per ruotarlo attorno all'asse X, fino a illuminare il pavimento.
ja: :ref:`DirectionalLight3D <class_DirectionalLight3D>` を移動し、回転させる必要があります。 :ref:`DirectionalLight3D <class_DirectionalLight3D>` のマニピュレーターの緑の矢印をクリック＆ドラッグして上に移動し、赤い円弧をクリック＆ドラッグしてX軸を中心に回転させ、地面が照らされるようにします。
ru: Нам нужно переместить и повернуть узел :ref:`DirectionalLight3D <class_DirectionalLight3D>`. Переместите его вверх, щелкнув и перетащив зеленую стрелку, а затем щелкните и перетащите красную дугу, чтобы повернуть его вокруг оси X, пока земля не будет освещена.
ta: நாம் நகர்த்த வேண்டும் மற்றும் சுழற்ற வேண்டும்: ref: `DirectionAllight3d <class_yrectionallight3d>` முனை. கையாளுபவரின் பச்சை அம்புக்குறியைக் சொடுக்கு செய்து இழுத்துச் செல்வதன் மூலம் அதை நகர்த்தவும், தரையில் எரியும் வரை, அதை எக்ச்-அச்சுக்குச் சுழற்ற சிவப்பு வளைவில் சொடுக்கு செய்து இழுக்கவும்.
tr: :ref:`DirectionalLight3D <class_DirectionalLight3D>` düğümünü taşımamız ve döndürmemiz gerekiyor. İdarecinin yeşil okuna tıklayıp sürükleyerek yukarı taşıyın ve zemin aydınlanana kadar X ekseni etrafında döndürmek için kırmızı yay parçasına tıklayıp sürükleyin.
uk: Нам потрібно перемістити та повернути вузол :ref:`DirectionalLight3D <class_DirectionalLight3D>`. Перемістіть його вгору, клацнувши та перетягнувши зелену стрілку маніпулятора, а потім клацніть і перетягніть червону дугу, щоб повернути його навколо осі X, доки земля не засвітиться.

source: In the *Inspector*, turn on *Shadow* by clicking the checkbox.
ko: *인스펙터*\ 에서 체크박스를 클릭하여 *그림자*\ 를 켭니다.
ru: В *Inspector* включите *Shadow*, установив флажок.

source: At this point, your project should look like this.
es: En este punto, tu proyecto debería verse así.
fr: À ce stade, votre projet devrait ressembler à ceci.
ga: Ag an bpointe seo, ba chóir go mbeadh cuma mar seo ar do thionscadal.
it: A questo punto, il tuo progetto dovrebbe assomigliare a questo.
ja: ここまでで、プロジェクトは次のようになっているはずです。
ko: 이 시점에서 프로젝트는 다음과 같아야 합니다.
pl: Na tym etapie, Twój projekt powinien wyglądać tak.
ru: На данном этапе ваш проект должен выглядеть следующим образом.
ta: இந்த கட்டத்தில், உங்கள் திட்டம் இப்படி இருக்க வேண்டும்.
tr: Bu noktada, projeniz bunun gibi görünmelidir.
uk: На даний момент ваш проект повинен виглядати так.

source: That's our starting point. In the next part, we will work on the player scene and base movement.
es: Ese es nuestro punto de partida. En la siguiente parte, trabajaremos en la escena del jugador y el movimiento base.
fr: Voilà notre point de départ. Dans la prochaine partie, nous travaillerons sur la scène du joueur et le mouvement de base.
ga: Sin an pointe tosaigh atá againn. Sa chéad chuid eile, oibreoimid ar láthair na n-imreoirí agus ar ghluaiseacht na mbonn.
it: Questo è il nostro punto di partenza. Nella prossima parte, lavoreremo sulla scena del giocatore e il movimento di base.
ja: これが出発点になります。次のパートでは、プレイヤーのシーンとベースの動きを作ります。
ko: 그것이 우리의 시작점입니다. 다음 부분에서는 플레이어 씬과 기본 이동을 작업할 것입니다.
ru: Это наш отправной пункт. В следующей части мы будем работать со сценой игрока и передвижением.
ta: அது எங்கள் தொடக்க புள்ளி. அடுத்த பகுதியில், பிளேயர் காட்சி மற்றும் அடிப்படை இயக்கத்தில் நாங்கள் பணியாற்றுவோம்.
tr: Bu bizim başlangıç noktamız. Sonraki bölümde, oyuncu sahnesi ve temel hareket üzerinde çalışacağız.
uk: Це наша відправна точка. У наступній частині ми будемо працювати над сценою гравця і базовим рухом.

source: We've prepared a Godot project with the 3D models and sounds we'll use for this tutorial, linked in the index page. If you haven't done so yet, you can download the archive here: `Squash the Creeps assets <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__.
es: Hemos preparado un proyecto de Godot con los modelos 3D y los sonidos que usaremos para este tutorial, vinculado en la página de índice. Si aún no lo has hecho, puedes descargar el archivo aquí: `activos de Squash the Creeps <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__.
fr: Nous avons préparé un projet Godot avec les modèles 3D et les sons que nous allons utiliser pour ce tutoriel, dont le lien se trouve sur la page d'index. Si vous ne l'avez pas encore fait, vous pouvez télécharger l'archive ici : `Assets de Squash the Creeps <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__.
ga: Tá tionscadal Godot ullmhaithe againn leis na samhlacha agus na fuaimeanna 3D a úsáidfimid don rang teagaisc seo, atá nasctha ar an leathanach innéacs. Mura bhfuil sé sin déanta agat go fóill, is féidir leat an chartlann a íoslódáil anseo: `Scuais na Sócmhainní Creeps <https://github.com/godotenginine/godot-3d-dodge-the-creeps/releases/tag/1.1.0> `__.
ja: このチュートリアルで使用する 3D モデルとサウンドを含む Godot プロジェクトを用意しました。まだの方は `Squash the Creeps assets <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__ からアーカイブをダウンロードしてください。
pl: Przygotowaliśmy projekt Godot z modelami 3D i dźwiękami, których będziemy używać w tym samouczku. Łącze do niego znajduje się na początkowej stronie. Jeśli jeszcze tego nie zrobiłeś, możesz pobrać archiwum tutaj: `zasoby Zmiażdż Creepsów <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0> `__.
uk: Ми підготували проект Годо з 3D-моделями та звуками, які використовуватимемо для цього підручника, посилання на які розміщені на сторінці індексу. Якщо ви ще не зробили цього, ви можете завантажити архів тут: `Squash the Creeps assets <https://github.com/godotengine/godot-3d-dodge-the-creeps/releases/tag/1.1.0>`__.

source: In the import popup, enter the full path to the freshly created directory ``squash_the_creeps_start/``. You can click the *Browse* button on the right to open a file browser and navigate to the ``project.godot`` file the folder contains.
es: En la ventana emergente de importación, ingresa la ruta completa al directorio recién creado ``squash_the_creeps_start/``. Puede hacer clic en el botón *Examinar* a la derecha para abrir un explorador de archivos y navegar hasta el archivo ``project.godot`` que contiene la carpeta.
fr: Dans la fenêtre d'importation, saisissez le chemin complet vers le dossier fraîchement créé ``squash_the_creeps_start/``. Vous pouvez cliquer sur le bouton *Parcourir* à droite pour ouvrir le navigateur de fichiers et naviguer jusqu'au fichier ``project.godot`` que le dossier contient.
ga: Sa phreabfhuinneog iompórtála, iontráil an cosán iomlán chuig an eolaire úrchruthaithe ''squash_the_creeps_start/''. Is féidir leat cliceáil ar an gcnaipe *Brabhsáil *ar dheis chun brabhsálaí comhad a oscailt agus nascleanúint a dhéanamh chuig an gcomhad ''project.godot'' atá san fhillteán.
ja: インポートポップアップで、作成したばかりのディレクトリ\ ``squash_the_creeps_start/``\ へのフルパスを入力します。右側の \ *参照(Browse)*\ ボタンをクリックしてファイル ブラウザを開き、フォルダに含まれる\ ``project.godot``\ ファイルに移動することも可能です。
pl: W wyskakującym okienku wpisz pełną ścieżkę do nowo stworzonego katalogu ``squash_the_creeps_start/``. Kliknij przycisk *Przeglądaj* po prawej stronie by otworzyć przeglądanie plików i przejść do pliku ``project.godot``, który znajduje się w tym katalogu.
uk: У спливаючому вікні імпорту введіть повний шлях до щойно створеного каталогу ``squash_the_creeps_start/``. Ви можете натиснути кнопку "Огляд" праворуч, щоб відкрити файловий браузер і перейти до файлу ``project.godot`` в цій теці.

source: Click *Import & Edit* to open the project in the editor.
es: Haga clic en *Importar y editar* para abrir el proyecto en el editor.
fr: Cliquez sur *Importer et modifier* pour ouvrir le projet dans l’éditeur.
ga: Cliceáil *Iompórtáil & Edit* chun an tionscadal a oscailt san eagarthóir.
ja: \ *インポートして編集(Install & Edit)*\ をクリックすると、エディタのプロジェクトが開きます。
pl: Kliknij *Importuj i Edytuj* by otworzyć projekt w Edytorze.
uk: Натисніть **(Імпортувати та редагувати)**, і проект відкриється в редакторі.

source: In the *Inspector*, turn on *Shadow -> Enabled* by clicking the checkbox.
es: En el *Inspector*, active *Shadow -> Activado* haciendo clic en la casilla de verificación.
fr: Dans l'*Inspecteur*, activez *Shadow -> Enabled* en cochant la case.
ga: Sa *Cigire*, cas ar * Scáth -> Cumasaithe * trí chliceáil ar an ticbhosca.
it: Nell'*Ispettore*, attiva *Shadow -> Enabled* cliccando sulla casella di spunta.
ja: *インスペクター* (Inspector)で、 *Shadow -> Enabled* の隣のチェックボックスにチェックを入れて、オンにします。
ta: *இன்ச்பெக்டர் *இல், தேர்வுப்பெட்டியைக் சொடுக்கு செய்வதன் மூலம் *நிழல் -> இயக்கப்பட்ட *இயக்கவும்.
tr: *Denetleyici* 'de, *Gölge -> Etkin* seçeneğini kutucuğu işaretleyip açın.
uk: В *Інспекторі* для відображення тіней покладіть галочку в *Shadow -> Enabled*.

source: A window notifying you that the project was generated by an older Godot version may appear. Click *Convert Full Project* to convert the project to your current Godot version.
it: Una finestra potrebbe informarti che il progetto è stato generato da una versione precedente di Godot. Clicca su *Converti l'intero progetto* per convertire il progetto alla versione attuale di Godot.
ta: பழைய கோடோட் பதிப்பால் இந்த திட்டம் உருவாக்கப்பட்டது என்பதை உங்களுக்குத் தெரிவிக்கும் ஒரு சாளரம் தோன்றக்கூடும். திட்டத்தை உங்கள் தற்போதைய கோடோட் பதிப்பிற்கு மாற்ற * முழு திட்டத்தை மாற்றவும் * என்பதைக் சொடுக்கு செய்க.
