Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/01.game_setup.po
Languages: es, fr, ga, it, ja, ko, pl, ru, ta, tr, uk

source: Setting up the game area
es: Configurando el área de juego
fr: Configuration de la zone de jeu
ga: Bunú an limistéar cluiche
it: Preparazione dell'area di gioco
ja: ゲームエリアの設定
ko: 게임 영역 설정하기
ru: Настройка игровой зоны
ta: விளையாட்டு பகுதியை அமைத்தல்
tr: Oyun sahasını ayarlamak
uk: Налаштування ігрової зони

source: In this first part, we're going to set up the game area. Let's get started by importing the start assets and setting up the game scene.
es: En esta primera parte, vamos a configurar el área de juego. Comencemos importando los activos de inicio y configurando la escena del juego.
fr: Dans cette première partie, nous allons mettre en place la zone de jeu. Commençons par importer les assets de départ et configurer la scène de jeu.
ga: Sa chéad chuid seo, táimid chun limistéar an chluiche a chur ar bun. A ligean ar tús a chur leis ag allmhairiú na sócmhainní tús agus a chur ar bun ar an ardán cluiche.
ja: この最初のパートでは、ゲームエリアを設定します。さっそく、スタートアセットをインポートして、ゲームシーンを設定しましょう。
ko: 첫 번째 부분에서는 게임 영역을 설정하겠습니다. 시작 애셋을 가져오고 게임 씬을 설정하는 것부터 시작해 보겠습니다.
pl: W tej pierwszej części przygotujemy obszar gry. Zacznijmy od zaimportowania początkowych zasobów (assets) i ustawieniu sceny gry.
ru: Для начала мы настроим игровую область. Давайте начнем с импорта стартовых ресурсов и настройки игровой сцены.
ta: இந்த முதல் பகுதியில், நாங்கள் விளையாட்டு பகுதியை அமைக்கப் போகிறோம். தொடக்க சொத்துக்களை இறக்குமதி செய்து விளையாட்டு காட்சியை அமைப்பதன் மூலம் தொடங்குவோம்.
tr: Bu bölümde oyun sahasını ayarlayacağız. İlk olarak, başlangıç varlıklarını içe aktarıp oyun sahnesini kurarak başlayalım.
uk: У першій частині ми збираємося створити ігрову зону. Почнемо з імпорту стартових активів і налаштування ігрової сцени.

source: We've prepared a Godot project with the 3D models and sounds we'll use for this tutorial, linked in the index page. If you haven't done so yet, you can download the archive here: `Squash the Creeps assets <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/3d_squash_the_creeps_starter.zip>`_.
ru: Мы подготовили проект Godot с 3D-моделями и звуками, которые мы будем использовать в этом уроке. Ссылка на него находится на главной странице. Если вы ещё этого не сделали, вы можете скачать архив здесь: `Squash the Creeps assets <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/3d_squash_the_creeps_starter.zip>`_.

source: Once you downloaded it, extract the .zip archive on your computer. Open the Godot Project Manager and click the *Import* button.
es: Una vez que lo hayas descargado, extrae el archivo .zip en tu computadora. Abre el administrador de Proyectos de Godot y haz clic en el botón *Importar*.
fr: Une fois que vous l'avez téléchargé, extrayez l'archive .zip sur votre ordinateur. Ouvrez le gestionnaire de projets Godot et cliquez sur le bouton *Importation*.
ga: Nuair a d'íoslódáil tú é, bain an chartlann .zip amach ar do ríomhaire. Oscail Bainisteoir Tionscadail Godot agus cliceáil ar an gcnaipe *Iompórtáil *.
it: Una volta scaricato, estrai l'archivio .zip sul tuo computer. Apri il Gestore del progetti di Godot e clicca sul pulsante *Importa*.
ja: ダウンロードしたら、.zip アーカイブをコンピュータで解凍します。Godotプロジェクトマネージャーを開き、 *インポート* ボタンをクリックします。
pl: Rozpakuj ten projekt na komputerze. Następnie otwórz Godot i w Menedżerze Projektu, kliknij przycisk *Zaimportuj*, aby zaimportować projekt.
ru: После загрузки распакуйте .zip архив на своем компьютере. Откройте менеджер проектов Godot и нажмите кнопку *Импорт*.
ta: நீங்கள் அதை பதிவிறக்கம் செய்தவுடன், .zip காப்பகத்தை உங்கள் கணினியில் பிரித்தெடுக்கவும். கோடோட் திட்ட மேலாளரைத் திறந்து * இறக்குமதி * பொத்தானைக் சொடுக்கு செய்க.
tr: İndirdikten sonra, .zip arşivini bilgisayarınıza çıkarın. Godot Proje Yöneticisini açın ve *İçe Aktar* düğmesine tıklayın.
uk: Завантаживши його, розпакуйте архів .zip на комп’ютері. Відкрийте менеджер проектів Godot і натисніть кнопку *Імпортувати*.

source: In the import popup, enter the full path to the freshly created directory ``3d_squash_the_creeps_starter/``. You can click the *Browse* button on the right to open a file browser and navigate to the ``project.godot`` file the folder contains.
ko: 가져오기 팝업에서 새로 만들어진 디렉터리 ``3d_squash_the_creeps_startert/``\ 의 전체 경로를 입력합니다. 오른쪽에 있는 *찾아보기* 버튼을 클릭하여 파일 브라우저를 열고 폴더에 있는 ``project.godot`` 파일로 이동할 수 있습니다.
ru: Во всплывающем окне импорта введите полный путь к только что созданному каталогу ``3d_squash_the_creeps_starter/``. Нажмите кнопку *Browse* справа, чтобы открыть браузер файлов и перейти к файлу ``project.godot``, содержащемуся в папке.

source: Click *Import* to open the project in the editor.
ko: *가져오기*\ 을 클릭하여 편집기에서 프로젝트를 엽니다.
ru: Нажмите *Import*, чтобы открыть проект в редакторе.

source: A window notifying you that the project was generated by an older Godot version may appear. Click *OK* to convert the project to your current Godot version.
ru: Может появиться окно с уведомлением о том, что проект был создан в более ранней версии Godot. Нажмите *OK*, чтобы преобразовать проект в текущую версию Godot.

source: If it doesn't open immediately open the project from your project list.
ru: Если он не открылся сразу, откройте проект из вашего списка проектов.

source: The start project contains an icon and two folders: ``art/`` and ``fonts/``. There, you will find the art assets and music we'll use in the game.
es: El proyecto de inicio contiene un icono y dos carpetas: ``art/`` y ``fonts/``. Allí encontrarás los recursos artísticos y la música que usaremos en el juego.
fr: Le projet de démarrage contient une icône et deux dossiers : ``art/`` et ``fonts/``. Ici, vous trouverez les assets et la musique que nous utiliserons dans le jeu.
ga: Tá deilbhín agus dhá fhillteán sa tionscadal tosaithe: ''art/'' agus ''fonts/''. Ansin, gheobhaidh tú na sócmhainní ealaíne agus an ceol a úsáidfimid sa chluiche.
it: Il progetto iniziale contiene un'icona e due cartelle: ``art/`` e ``fonts/``. Lì, troverai le risorse grafiche e sonore che useremo nel gioco.
ja: スタート プロジェクトには、アイコンと 2 つのフォルダー\ ``art/``\ と\ ``fonts/``\ があります。そこには、ゲーム内で使用するアートアセットと音楽があります。
ko: 시작 프로젝트에는 아이콘과 두 개의 폴더인 ``art/``\ 와 ``fonts/``\ 가 포함되어 있습니다. 여기에는 게임에서 사용할 아트 애셋과 음악이 들어 있습니다.
pl: Projekt zawiera ikonkę oraz dwa foldery: ``art/`` i ``fonts/``. Znajdziesz tam zasoby graficzne i muzykę, których będziemy używać w grze.
ru: Начальный проект содержит иконку и две папки: ``art/`` и ``fonts/``. В них вы найдёте ресурсы, которые мы будем использовать в игре.
ta: தொடக்க திட்டத்தில் ஒரு படவுரு மற்றும் இரண்டு கோப்புறைகள் உள்ளன: `` கலை/`` மற்றும் `` எழுத்துருக்கள்/`. அங்கு, விளையாட்டில் நாங்கள் பயன்படுத்தும் கலை சொத்துக்கள் மற்றும் இசையை நீங்கள் காண்பீர்கள்.
tr: Başlangıç projesi bir simge ve iki klasör içeriyor: ``art/`` ve ``fonts/``. Bunların içinde, oyunda kullanacağımız sanat varlıklarını ve müzikleri bulacaksınız.
uk: Початковий проект містить піктограму та дві папки: ``art/`` і ``fonts/``. Там ви знайдете активи та музику, яку ми будемо використовувати в грі.

source: There are two 3D models, ``player.glb`` and ``mob.glb``, some materials that belong to these models, and a music track.
es: Hay dos modelos 3D, ``player.glb`` y ``mob.glb``, algunos materiales que pertenecen a estos modelos y una pista de música.
fr: Il y a deux modèles 3D, ``player.glb`` et ``mob.glb``, quelques matériaux qui appartiennent à ces modèles, et une piste musicale.
ga: Tá dhá mhúnla 3D ann, ''player.glb'' agus ''mob.glb'', roinnt ábhar a bhaineann leis na samhlacha seo, agus rian ceoil.
it: Ci sono due modelli 3D, ``player.glb`` e ``mob.glb``, alcuni materiali che appartengono a questi modelli e una traccia musicale.
ja: \ ``player.glb``\ と\ ``mob.glb``\ という二つの3Dモデルとこれらのモデルに属するいくつかの素材、そして音楽トラックです。
ko: 두 개의 3D 모델, ``player.glb``와 ``mob.glb``, 그리고 이 모델들에 속하는 몇 가지 소재와 음악 트랙이 있습니다.
pl: Są tam dwa modele 3D, ``player.glb`` i ``mob.glb``, materiały będące składowymi tych modeli oraz plik z muzyką.
ru: Здесь имеются две 3D-модели ``player.glb`` и ``mob.glb``, материалы для этих моделей и музыкальный трек.
ta: இரண்டு 3D மாதிரிகள் உள்ளன, `` player.glb`` மற்றும் `` mob.glb``, இந்த மாடல்களுக்கு சொந்தமான சில பொருட்கள் மற்றும் ஒரு இசை பாடல்.
tr: İki tane 3B model, ``player.glb`` ve ``mob.glb``, bu modellere ait birkaç malzeme, ve bir müzik izi bulunuyor.
uk: Там є дві 3D-моделі, ``player.glb`` та ``mob.glb``, деякі матеріали, які належать цим моделям, і музичний трек.

source: Setting up the playable area
es: Configurando el área jugable
fr: Configuration de la zone jouable
ga: An limistéar spraíúil a bhunú
it: Preparazione dell'area giocabile
ja: プレイ可能エリアの設定
ko: 플레이 가능 영역 설정하기
pl: Ustawianie obszaru, gdzie będzie toczyć się gra
ru: Настройка игровой зоны
ta: விளையாடக்கூடிய பகுதியை அமைத்தல்
tr: Oynanabilir sahayı ayarlamak
uk: Налаштування зони гри

source: We're going to create our main scene with a plain :ref:`Node <class_Node>` as its root. In the *Scene* dock, click the *Add Child Node* button represented by a "+" icon in the top-left and double-click on *Node*. Name the node ``Main``. An alternate method to rename the node is to right-click on *Node* and choose *Rename* (or :kbd:`F2`). Alternatively, to add a node to the scene, you can press :kbd:`Ctrl + A` (:kbd:`Cmd + A` on macOS).
es: Vamos a crear nuestra escena principal con un :ref:`Node <class_Node>` simple como raíz. En el panel *Escena*, haz clic en el botón *Agregar nodo* representado por un icono "+" en la parte superior izquierda y haz doble clic en *Nodo*. Nombra el nodo``Main`` (Principal). Otra forma de renombrar un nodo es haciendo clic derecho y seleccionando *Renombrar* (o :kbd:`F2`). Alternativamente, para agregar un nodo a la escena, puedes presionar :kbd:`Ctrl + A` (o :kbd:`Cmd + A` en macOS).
fr: Nous allons créer notre scène principale avec un simple :ref:`Node <class_Node>` comme racine. Dans le dock *Scène*, cliquez sur le bouton *Ajouter un nœud enfant* représenté par une icône "+" en haut à gauche et double-cliquez sur *Node*. Nommez le nœud ``Main``. Une autre méthode pour renommer le nœud consiste à cliquer avec le bouton droit sur *Node* et à choisir *Renommer* (ou :kbd:`F2`). Alternativement, pour ajouter un nœud à la scène, vous pouvez appuyer sur :kbd:`Ctrl + A` (:kbd:`Cmd + A` sur macOS).
ga: Táimid chun ár bpríomhradharc a chruthú le :ref:`Node <class_Node>` mar fhréamh. Sa duga *Radharc*, cliceáil ar an gcnaipe *Add Child Node* arna léiriú ag deilbhín "+" sa bharr ar chlé agus cliceáil faoi dhó ar *Nóid*. Ainmnigh an nód ``Príomh``. Modh eile chun an nód a athainmniú ná deaschliceáil ar *Nód* agus *Athainmnigh* a roghnú (nó :kbd:`F2`). Nó, chun nód a chur leis an radharc, is féidir leat :kbd:`Ctrl + A` a bhrú (:kbd:`Cmd + A` ar macOS).
it: Andremo a creare la nostra scena principale con un :ref:`Node <class_Node>` base come sua radice (root). Nel pannello *Scena*, clicca sul pulsante *Aggiungi nodo figlio* rappresentato dal simbolo "+" in alto a sinistra e fai doppio-clic su *Nodo*. Rinomina il nodo in ``Main``. Alternativamente, per rinominare un nodo, è possibile fare clic destro su *Nodo* e scegliere *Rinomina* (oppure :kbd:`F2`). Oppure, per aggiungere un nodo alla scena, è possibile premere :kbd:`Ctrl + A` (:kbd:`Cmd + A` su macOS).
ja: プレーンな :ref:`Node <class_Node>` をルートとして、メイン シーンを作成します。 *シーン* の枠内で、左上の "+" アイコンで表される *子ノードを追加* ボタンをクリックして、開いたウィンドウ内の *Node* をダブルクリックします。このノードに "Main"という名前を付けましょう。ノードの名前を変えるには *シーン* の枠内にある、名前を変更したい *Node* を右クリックして *名前の変更* も選択して下さい。また、ノードをシーンに追加するには、 :kbd:`Ctrl + a` (macOSでは :kbd:`Cmd + a`) をのショートカットも利用できます。
ko: 루트로 평범한 :ref:`Node <class_Node>`\ 를 사용하는 메인 씬을 만들어 보겠습니다. *씬* 독에서 왼쪽 상단의 "+" 아이콘으로 표시된 *자식 노드 추가* 버튼을 클릭하고 *Node*\ 를 더블 클릭합니다. 노드 이름을 ``Main``\ 으로 지정합니다. 노드 이름을 바꾸는 또 다른 방법은 *Node*\ 를 마우스 오른쪽 버튼으로 클릭하고 *이름 바꾸기*\ (또는 :kbd:`F2`)를 선택하는 것입니다. 또는 씬에 노드를 추가하려면 :kbd:`Ctrl + A`\ (macOS에서는 :kbd:`Cmd + A`)를 누를 수 있습니다.
ru: Мы собираемся создать нашу основную сцену с простым :ref:`Node <class_Node>` в качестве ее корня. В доке *Scene* нажмите кнопку *Add Child Node*, представленную значком «+» в левом верхнем углу, и дважды щелкните *Node*. Назовите узел ``Main``. Альтернативный метод переименования узла — щелкнуть правой кнопкой мыши по *Node* и выбрать *Rename* (или :kbd:`F2`). Альтернативно, чтобы добавить узел в сцену, вы можете нажать :kbd:`Ctrl + A` (:kbd:`Cmd + A` на macOS).
ta: நாங்கள் எங்கள் முக்கிய காட்சியை ஒரு சமவெளியுடன் உருவாக்கப் போகிறோம்: குறிப்பு: `முனை <class_node>` அதன் வேராக. *காட்சி *கப்பல்துறையில், மேல்-இடதுபுறத்தில் "+" ஐகானால் குறிப்பிடப்படும் *குழந்தை முனை *பொத்தானைக் சொடுக்கு செய்து *முனை *இல் இருமுறை சொடுக்கு செய்யவும். முனைக்கு `` பிரதான`` என்று பெயரிடுங்கள். முனையை மறுபெயரிடுவதற்கான மாற்று முறை * முனை * இல் வலது சொடுக்கு செய்து * மறுபெயரிடு * (அல்லது: kbd: `F2`) என்பதைத் தேர்வுசெய்க. மாற்றாக, காட்சிக்கு ஒரு முனையைச் சேர்க்க, நீங்கள் அழுத்தலாம்: kbd: `ctrl + a` (: kbd:` cmd + a` on Macos).
tr: Ana sahnemizin kökünü düz bir :ref:`Node <class_Node>` ile oluşturacağız. *Sahne* yuvasında, sol üstte bir "+" simgesiyle temsil edilen *Alt Düğüm Ekle* düğmesine tıklayın ve *Düğüm* üzerine çift tıklayın. Düğüme ``Main`` adını verin. Düğümü yeniden adlandırmak için diğer bir yöntem de *Node* üzerine sağ tıklayıp *Yeniden İsimlendir* (veya :kbd:`F2`) seçeneğini seçmektir. Alternatif olarak, sahneye bir düğüm eklemek için :kbd:`Ctrl + A` (macOS üzerinde :kbd:`Cmd + A`) tuşlarına basabilirsiniz.
uk: Ми збираємося створити нашу головну сцену з простим :ref:`Node <class_Node>` як її коренем. У док-станції *Scene* натисніть кнопку *Add Child Node*, представлену значком «+» у верхньому лівому куті, і двічі клацніть на *Node*. Назвіть вузол ``Main``. Альтернативним способом перейменування вузла є клацання правою кнопкою миші *Node* і вибір *Rename* (або :kbd:`F2`). Крім того, щоб додати вузол до сцени, ви можете натиснути :kbd:`Ctrl + A` (:kbd:`Cmd + A` на macOS).

source: Save the scene as ``main.tscn`` by pressing :kbd:`Ctrl + S` (:kbd:`Cmd + S` on macOS).
es: Guarda la escena como ``main.tscn`` presionando :kbd:`Ctrl + s` (o :kbd:`Cmd + s` en macOS).
fr: Enregistrez la scène en tant que ``main.tscn`` en appuyant sur :kbd:`Ctrl + S` (:kbd:`Cmd + S` sur MacOS).
ga: Sábháil an radharc mar ''main.tscn'' trí :kbd:'Ctrl + S' a bhrú (:kbd:'Cmd + S' ar macOS).
it: Salva la scena come ``main.tscn`` premendo :kbd:`Ctrl + S` (:kbd:`Cmd + S` su macOS).
ja: シーンを\ ``main.tscn``\ として保存しましょう。 :kbd:`Ctrl + s` (macOS では :kbd:`Cmd + s`) を押して下さい。
ko: :kbd:`Ctrl + S`\ (macOS에서는 :kbd:`Cmd + S`)를 눌러 씬을 ``main.tscn``\ 으로 저장합니다.
ru: Сохраните сцену как ``main.tscn``, нажав :kbd:`Ctrl + S` (:kbd:`Cmd + S` на macOS).
ta: அழுத்துவதன் மூலம் காட்சியை `` main.tscn`` என சேமிக்கவும்: kbd: `ctrl + s` (: kbd:` cmd + s` on Macos).
tr: Sahneyi, :kbd:`Ctrl + S` (macOS üzerinde :kbd:`Cmd + S`) tuşlarına basarak, ``main.tscn`` olarak kaydedin.
uk: Збережіть сцену як ``main.tscn``, натиснувши :kbd:`Ctrl + S` (:kbd:`Cmd + S` на macOS).

source: We'll start by adding a floor that'll prevent the characters from falling. To create static colliders like the floor, walls, or ceilings, you can use :ref:`StaticBody3D <class_StaticBody3D>` nodes. They require :ref:`CollisionShape3D <class_CollisionShape3D>` child nodes to define the collision area. With the ``Main`` node selected, add a :ref:`StaticBody3D <class_StaticBody3D>` node, then a :ref:`CollisionShape3D <class_CollisionShape3D>`. Rename the :ref:`StaticBody3D <class_StaticBody3D>` to ``Ground``.
es: Comenzaremos agregando un piso que evitará que los personajes se caigan. Para crear colisionadores estáticos como piso, paredes o techos, puedes usar nodos :ref:`StaticBody3D <class_StaticBody3D>`. Estos requieren :ref:`CollisionShape3D <class_CollisionShape3D>` como nodos secundarios para definir el área de colisión. Con el nodo ``Main`` seleccionado, agrega un nodo :ref:`StaticBody3D <class_StaticBody3D>`, luego un :ref:`CollisionShape3D <class_CollisionShape3D>`. Cambia el nombre del :ref:`StaticBody3D <class_StaticBody3D>` a ``Ground``.
fr: Nous commencerons par ajouter un sol qui empêchera les personnages de tomber. Pour créer des collisionneurs statiques comme le sol, les murs ou les plafonds, vous pouvez utiliser des nœuds :ref:`StaticBody3D <class_StaticBody3D>`. Ils nécessitent des nœuds enfants :ref:`CollisionShape3D <class_CollisionShape3D>` pour définir la zone de collision. Avec le nœud ``Main`` sélectionné, ajoutez un nœud :ref:`StaticBody3D <class_StaticBody3D>`, puis un :ref:`CollisionShape3D <class_CollisionShape3D>`. Renommez le :ref:`StaticBody3D <class_StaticBody3D>` en ``Ground``.
ga: Tosóimid trí urlár a chur leis a chuirfidh cosc ar na carachtair titim. Chun imbhuailteoirí statacha a chruthú cosúil leis an urlár, ballaí, nó uasteorainneacha, is féidir leat úsáid a bhaint as :ref:`StaticBody3D <class_StaticBody3D>` nóid. Teastaíonn :ref:`CollisionShape3D <class_CollisionShape3D>` nóid linbh chun limistéar an imbhuailte a shainiú. Agus an nód ``Príomh`` roghnaithe, cuir leis :ref:`StaticBody3D <class_StaticBody3D>` nód, ansin :ref:`CollisionShape3D <class_CollisionShape3D>`. Athainmnigh an :tag:`StaticBody3D <class_StaticBody3D>` go ``Ground``.
it: Cominceremo aggiungendo un pavimento che impedirà ai personaggi di cadere nel vuoto. Per creare collisori statici come pavimenti, mura, o soffitti, possiamo usare dei nodi :ref:`StaticBody3D <class_StaticBody3D>`. Questi richiedono nodi :ref:`CollisionShape3D <class_CollisionShape3D>` come figli per definire un'area di collisione. Con il nodo ``Main`` selezionato, aggiungi un nodo :ref:`StaticBody3D <class_StaticBody3D>`, e successivamente un nodo :ref:`CollisionShape3D <class_CollisionShape3D>` come figlio del precedente. Rinomina il nodo :ref:`StaticBody3D <class_StaticBody3D>` in ``Ground``.
ja: まず、キャラクターの落下を防ぐための床を追加します。床、壁、天井のような静的な衝突物(コライダー"collider")を作成するには、 :ref:`StaticBody3D <class_StaticBody3D>` ノードを使用することができます。これらは、衝突領域を定義するために :ref:`CollisionShape3D <class_CollisionShape3D>` という子ノードを必要とします。\ *Main*\ ノードを選択し、 :ref:`StaticBody3D <class_StaticBody3D>` ノードを追加し、追加した :ref:`StaticBody3D <class_StaticBody3D>` を選択して、 :ref:`CollisionShape3D <class_CollisionShape3D>` を子ノードとして追加して下さい。そして親ノードである :ref:`StaticBody3D <class_StaticBody3D>` の名前を ``Ground`` に変更しましょう。
ko: 먼저 캐릭터가 떨어지지 않도록 바닥을 추가하겠습니다. 바닥, 벽, 천장과 같은 정적 충돌체(static collider)를 만들려면, :ref:`StaticBody3D <class_StaticBody3D>` 노드를 사용할 수 있습니다. 콜리전 영역을 정의하기 위해 :ref:`CollisionShape3D <class_CollisionShape3D>` 자식 노드가 필요합니다. ``Main`` 노드를 선택한 상태에서 :ref:`StaticBody3D <class_StaticBody3D>` 노드를 추가하고, 그 다음으로 :ref:`CollisionShape3D <class_CollisionShape3D>`\ 를 추가합니다. :ref:`StaticBody3D <class_StaticBody3D>`\ 의 이름을 ``Ground``\ 로 변경합니다.
pl: Zaczniemy od dodania poziomu podłogi, która zapobiegnie opadaniu postaci. Aby utworzyć *statyczne kolidery* (static collider), takie jak podłogi, ściany lub inne nieruchome przeszkody, możesz użyć węzłów :ref:`StaticBody3D <class_StaticBody3D>`. Wymagane jest dodanie węzłów podrzędnych :ref:`CollisionShape3D <class_CollisionShape3D>` w celu zdefiniowania obszaru kolizji. Po wybraniu węzła ``Main`` dodaj węzeł :ref:`StaticBody3D <class_StaticBody3D>`, a następnie :ref:`CollisionShape3D <class_CollisionShape3D>`. Zmień nazwę :ref:`StaticBody3D <class_StaticBody3D>` na ``Ground``.
ru: Мы начнём с добавления пола, который предотвратит игроков от падения. Чтобы создать такие статические коллайдеры такие, как пол, стены или потолок, вы можете использовать узлы :ref:`StaticBody3D <class_StaticBody3D>`. Им необходимы дочерние узлы :ref:`CollisionShape3D <class_CollisionShape3D>`, чтобы определить область столкновения. Выбрав узел ``Main``, добавьте узел :ref:`StaticBody3D <class_StaticBody3D>`, затем :ref:`CollisionShape3D <class_CollisionShape3D>`. Переименуйте :ref:`StaticBody3D <class_StaticBody3D>` в ``Ground``.
ta: கதாபாத்திரங்கள் விழுவதைத் தடுக்கும் ஒரு தளத்தைச் சேர்ப்பதன் மூலம் தொடங்குவோம். தளம், சுவர்கள் அல்லது கூரைகள் போன்ற நிலையான கோலிடர்களை உருவாக்க, நீங்கள் பயன்படுத்தலாம்: குறிப்பு: `staticbody3d <class_staticbody3d>` முனைகள். அவை தேவை: Ref: `collisionshape3d <class_collisshape3d>` மோதல் பகுதியை வரையறுக்க குழந்தை முனைகள். `` பிரதான`` முனை தேர்ந்தெடுக்கப்பட்டால், A: Ref: `staticbody3d <class_staticbody3d>` முனை, பின்னர் ஒரு: குறிப்பு: `collisionshape3d <class_collisionshape3d>`. மறுபெயரிடுங்கள்: ref: `staticbody3d <class_staticbody3d>` பெறுநர் `` தரையில்``.
tr: Karakterlerin düşmesini engelleyecek bir zemin ekleyerek başlayacağız. Zeminler, duvarlar veya tavanlar gibi duran çarpışma cisimleri oluşturmak için :ref:`StaticBody3D <class_StaticBody3D>` (duran cisim) düğümlerini kullanabilirsiniz. Bunlar, çarpışma alanını tanımlamak için :ref:`CollisionShape3D <class_CollisionShape3D>` (çarpışma şekli) alt düğümlerine ihtiyaç duyarlar. ``Main`` düğümü seçiliyken, bir :ref:`StaticBody3D <class_StaticBody3D>` düğümü, ardından bir :ref:`CollisionShape3D <class_CollisionShape3D>` ekleyin. :ref:`StaticBody3D <class_StaticBody3D>` düğümünü ``Ground`` (zemin) olarak yeniden adlandırın.
uk: Ми почнемо з додавання підлоги, яка запобігатиме падінню персонажів. Для створення статичних коллайдерів, таких як підлога, стіни чи стелі, ви можете використовувати вузли :ref:`StaticBody3D <class_StaticBody3D>`. Їм потрібні дочірні вузли :ref:`CollisionShape3D <class_CollisionShape3D>` для визначення області зіткнення. Вибравши вузол ``Main``, додайте вузол :ref:`StaticBody3D <class_StaticBody3D>`, а потім :ref:`CollisionShape3D <class_CollisionShape3D>`. Перейменуйте :ref:`StaticBody3D <class_StaticBody3D>` на ``Ground``.

source: Your scene tree should look like this
es: Tu árbol de escena debería verse así
fr: Votre hiérarchie devrait ressembler à ceci
ga: Ba chóir go mbeadh cuma mar seo ar do chrann radhairc
it: Il tuo albero di scena dovrebbe assomigliare a questo
ja: シーンツリーは次のようになります:
ko: 씬 트리는 다음과 같아야 합니다
pl: Twoja scena powinna wyglądać tak
ru: Ваше дерево сцены должно выглядеть так
ta: உங்கள் காட்சி மரம் இப்படி இருக்க வேண்டும்
tr: Sahne ağacınız şöyle görünmelidir
uk: Ваше сцена має виглядати так
