Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/01.game_setup.po
Languages: es, fr, ga, it, ja, ko, pl, ru, ta, tr, uk

source: A warning sign next to the :ref:`CollisionShape3D <class_CollisionShape3D>` appears because we haven't defined its shape. If you click the icon, a popup appears to give you more information.
es: Aparece un signo de advertencia junto al :ref:`CollisionShape3D <class_CollisionShape3D>` porque no hemos definido su forma. Si haces clic en el icono, aparecerá una ventana emergente para brindarte más información.
fr: Une icône d'avertissement apparaît à côté de :ref:`CollisionShape3D <class_CollisionShape3D>` parce que nous n'avons pas défini sa forme. Si vous cliquez sur l'icône, une fenêtre contextuelle apparaît pour vous donner plus d'informations.
ga: Tá comhartha rabhaidh in aice leis an :ref:`CollisionShape3D <class_CollisionShape3D>` le feiceáil toisc nach bhfuil a chruth sainithe againn. Má chliceálann tú ar an deilbhín, feictear aníos a thugann tuilleadh eolais duit.
it: Un simbolo di avviso apparirà accanto al :ref:`CollisionShape3D <class_CollisionShape3D>` perché non abbiamo ancora definito la sua forma. Cliccando sull'icona di avviso, apparirà un popup che ci fornirà più informazioni.
ja: :ref:`CollisionShape3D <class_CollisionShape3D>` の横に警告マークが表示されているのは、まだ :ref:`CollisionShape3D <class_CollisionShape3D>` の形を定義していないからです。この警告マークをクリックすると、ポップアップが表示され詳細情報を確認できます。
ko: :ref:`CollisionShape3D <class_CollisionShape3D>` 옆에 경고 표시가 나타나는 이유는 모양을 정의하지 않았기 때문입니다. 아이콘을 클릭하면 더 많은 정보를 제공하는 팝업이 나타납니다.
ru: Предупреждающая знак рядом с :ref:`CollisionShape3D <class_CollisionShape3D>` появляется, потому что мы не определились с формой. Если вы нажмёте на иконку, появится всплывающее окно, которое предоставит вам больше информации.
ta: இதற்கு அடுத்த ஒரு எச்சரிக்கை அடையாளம்: ref: `collisionshape3d <class_collisshape3d>` அதன் வடிவத்தை நாங்கள் வரையறுக்காததால் தோன்றும். நீங்கள் ஐகானைக் சொடுக்கு செய்தால், மேலும் தகவல்களை உங்களுக்கு வழங்க ஒரு பாப்அப் தோன்றும்.
tr: Şeklini tanımlamadığımız için :ref:`CollisionShape3D <class_CollisionShape3D>` yanında bir uyarı işareti görünür. Simgeye tıklarsanız, size daha fazla bilgi veren bir açılır pencere görünür.
uk: Біля :ref:`CollisionShape3D <class_CollisionShape3D>` з’являється попереджувальний знак, оскільки ми не визначили його форму. Якщо натиснути піктограму, з’явиться спливаюче вікно з додатковою інформацією.

source: To create a shape, select the :ref:`CollisionShape3D <class_CollisionShape3D>` node, head to the *Inspector* and click the *<empty>* field next to the *Shape* property. Create a new *BoxShape3D*.
es: Para crear una forma, con el nodo :ref:`CollisionShape3D <class_CollisionShape3D>` seleccionado, diríjete al *Inspector* y haz clic en el campo *<vacío>* junto a la propiedad *Shape*. Crea una nueva *BoxShape3D*.
fr: Pour créer une forme, sélectionnez le nœud :ref:`CollisionShape3D <class_CollisionShape3D>`, dirigez-vous vers l'*Inspecteur* et cliquez sur le champ *<empty>* à côté de la propriété *Shape*. Créez un nouveau *BoxShape3D*.
ga: Chun cruth a chruthú, roghnaigh an nód :ref:`CollisionShape3D <class_CollisionShape3D>`, téigh chuig an *Cigire* agus cliceáil ar an réimse *<folamh>* in aice leis an airí *Shape*. Cruthaigh *BoxShape3D* nua.
it: Per creare una forma, seleziona il nodo :ref:`CollisionShape3D <class_CollisionShape3D>`, vai nell'*Ispettore* e clicca sul campo *<vuoto>* accanto alla proprietà *Shape*. Crea un nuovo *BoxShape3D*.
ja: :ref:`CollisionShape3D <class_CollisionShape3D>` の形状を定義するには、「シーン」ドック内の :ref:`CollisionShape3D <class_CollisionShape3D>` を選択します。次に、「 *インスペクター* (Inspector)」ドック内の、 *Shape* プロパティの隣にある *<空>* (empty)フィールドをクリックします。そしてプルダウンから「新規 *BoxShape3D* 」を選択して形状を作成します。
ko: 모양을 만들려면 :ref:`CollisionShape3D <class_CollisionShape3D>` 노드를 선택하고 *인스펙터*\ 로 이동하여 *모양* 속성 옆에 *<비었음>* 필드를 클릭합니다. 새로운 *BoxShape3D*\ 를 만듭니다.
pl: Aby utworzyć kształt, wybierz węzeł :ref:`CollisionShape3D <class_CollisionShape3D>`, przejdź do *Inspektora* i kliknij pole *<empty>* obok właściwości *Shape*. Utwórz nowy *BoxShape3D*.
ru: Чтобы создать форму, выберите узел :ref:`CollisionShape3D <class_CollisionShape3D>`, перейдите в *Инспектор* и щелкните по полю *<пусто>* рядом со свойством *Shape*. Создайте новый *BoxShape3D*.
ta: ஒரு வடிவத்தை உருவாக்க, தேர்வு: ref: `collisionshape3d <class_collisshape3d>` முனை, * இன்ச்பெக்டருக்கு * சென்று * வடிவம் * சொத்துக்கு அடுத்த * <mack> * புலத்தைக் சொடுக்கு செய்க. புதிய *BOXSHAPE3D *ஐ உருவாக்கவும்.
tr: Bir şekil oluşturmak için :ref:`CollisionShape3D <class_CollisionShape3D>` düğümünü seçin, *Denetleyici*'ye gidin ve *Shape*(şekil) özelliğinin yanındaki *<boş>* alanına tıklayın. Yeni bir *BoxShape3D* (kutu şekli) oluşturun.
uk: Для створення форми виберіть :ref:`CollisionShape3D <class_CollisionShape3D>`, перейдіть до *Інспектора* і натисніть поле *[порожньо]* поруч із властивістю *Shape*. Виберіть *Новий Box Shape3D*.

source: The box shape is perfect for flat ground and walls. Its thickness makes it reliable to block even fast-moving objects.
es: La forma de caja (box shape) es perfecta para suelos planos y paredes. Su grosor lo hace confiable para bloquear incluso objetos que se mueven rápidamente.
fr: La forme de boîte est parfaite pour les sols plats et les murs. Son épaisseur la rend fiable même pour bloquer les objets qui se déplacent rapidement.
ga: Tá cruth an bhosca foirfe do thalamh cothrom agus ballaí. Fágann a thiús go bhfuil sé iontaofa bac a chur ar rudaí atá ag gluaiseacht go tapa.
it: La forma a riquadro (box) è perfetta per pavimenti piani e mura. Il suo spessore lo rende affidabile anche per bloccare oggetti in rapido movimento.
ja: ボックスの形状は、平らな地面や壁に最適です。その厚さによって、動きの速い物体でも確実にブロックできます。
ko: 상자 모양은 평평한 바닥과 벽에 적합합니다. 두께가 있어 빠르게 움직이는 물체도 안정적으로 막을 수 있습니다.
pl: Kształt pudełka jest idealnie dopasowany do płaskiego podłoża i ścian. Jego grubość sprawia, że niezawodnie blokuje nawet szybko poruszające się obiekty.
ru: Форма параллелепипеда идеальна для плоской поверхности и стен. Её толщина делает её надёжной в качестве преграды для быстро двигающихся объектов.
ta: பெட்டி வடிவம் தட்டையான தரை மற்றும் சுவர்களுக்கு ஏற்றது. அதன் தடிமன் வேகமாக நகரும் பொருள்களைத் தடுப்பது நம்பகமானதாக அமைகிறது.
tr: Kutu şekli düz taban ve duvarlar için mükemmeldir. Kalınlığı onu, hızlı-hareket-eden nesneleri bile engellemek için güvenilir yapıyor.
uk: Форма коробки ідеально підходить для плоскої землі і стін. ЇЇ товщина робить надійним блокування навіть об'єктів, що рухаються із великою швидкістю.

source: A box's wireframe appears in the viewport with three orange dots. You can click and drag these to edit the shape's extents interactively. We can also precisely set the size in the inspector. Click on the :ref:`BoxShape3D <class_BoxShape3D>` to expand the resource. Set its *Size* to ``60`` on the X-axis, ``2`` for the Y-axis, and ``60`` for the Z-axis.
es: Una caja hecha con líneas aparecerá en el viewport con tres puntos naranjas. Puedes hacer clic en ellos y arrastrarlos para editar las dimensiones de la forma de manera interactiva. También podemos establecer el tamaño con precisiónen el inspector. Haz clic en :ref:`BoxShape3D <class_BoxShape3D>` para expandir el recurso. Ajusta su *Size* (tamaño o magnitud) a ``60`` en el eje X, ``2`` para el eje Y, y ``60`` para el eje Z.
fr: L'armature de la boîte apparaît dans la fenêtre avec trois points orange. Vous pouvez cliquer et faire glisser ces points pour modifier la taille de la forme interactivement. Nous pouvons également définir la taille précisément dans l'inspecteur. Cliquez sur la :ref:`BoxShape3D <class_BoxShape3D>` pour étendre la ressource. Définissez ses *Size* à ``60`` sur l'axe X, ``2`` sur l'axe Y, et ``60`` sur l'axe Z.
ga: Feictear sreangfhráma bosca sa radharc ar a bhfuil trí phonc oráiste. Is féidir leat iad seo a chliceáil agus a tharraingt chun méid an chrutha a chur in eagar go hidirghníomhach. Is féidir linn an méid a shocrú go beacht sa chigire freisin. Cliceáil ar an :ref:`BoxShape3D <class_BoxShape3D>` chun an acmhainn a leathnú. Socraigh a *Méid* go ``60`` ar an X-ais, `` 2`` don Y-ais, agus ``60`` don Z-ais.
it: Un fildiferro del riquadro apparirà nella viewport con tre punti arancioni. È possibile cliccare e trascinare questi punti per modificare interattivamente l'estensioni della forma. È possibile anche impostare dimensioni precise attraverso l'ispettore. Clicca sul :ref:`BoxShape3D <class_BoxShape3D>` per espandere la risorsa. Imposta il suo *Size* a ``60`` sull'asse X, ``2`` sull'asse Y e ``60`` sull'asse Z.
ja: 追加したボックスのワイヤフレームが、ビューポートに3つのオレンジ色の点で表示されます。これらをクリック＆ドラッグして、形状の大きさをインタラクティブに編集できます。また、インスペクタでサイズを正確に設定することもできます。インスペクタのドックで、先ほど設定した :ref:`BoxShape3D <class_BoxShape3D>` をクリックし、設定項目を展開してみましょう。そしてその設定項目の *Size* 欄で、 X 軸に ``60`` 、Y軸に ``2`` 、Z軸に ``60`` を指定します。
ru: В окне просмотра появится каркас параллелепипеда с тремя оранжевыми точками. Вы можете нажать на них и перетащить для того, чтобы отредактировать размеры фигуры в интерактивном режиме. Мы также можем с точностью настроить размер в инспекторе. Нажмите на :ref:`BoxShape3D <class_BoxShape3D>`, чтобы расширить источник. Установите его *размер* равным ``60`` по оси X, ``2`` по оси Y и ``60`` по оси Z.
ta: ஒரு பெட்டியின் வயர்ஃப்ரேம் மூன்று ஆரஞ்சு புள்ளிகளுடன் காட்சியமைப்பில் தோன்றும். வடிவத்தின் நீட்டிப்புகளை ஊடாடும் வகையில் திருத்த நீங்கள் இவற்றைக் சொடுக்கு செய்து இழுக்கலாம். நாம் துல்லியமாக அளவை இன்ச்பெக்டரில் அமைக்கலாம். என்பதைக் சொடுக்கு செய்க: ref: `Boxshape3d <class_boxshape3d>` வளத்தை விரிவாக்க. எக்ச்-அச்சில் அதன் * அளவு * `60`` ஆகவும், y- அச்சுக்கு` 2``, மற்றும் Z- அச்சுக்கு `` 60`` ஆகவும் அமைக்கவும்.
tr: Çerçevede üç turuncu nokta ile birlikte bir kutunun tel kafesi görünür. Şeklin uzanımlarını etkileşimli olarak düzenlemek için bunlara tıklayıp sürükleyebilirsiniz. Ayrıca boyutunu denetçide tam olarak ayarlayabiliriz. Kaynağı genişletmek için :ref:`BoxShape3D <class_BoxShape3D>` üzerine tıklayın. *Boyut*'unu X ekseni için ``60``, Y ekseni için ``2`` ve Z ekseni için ``60`` olarak ayarlayın.
uk: Каркас коробки з’являється у вікні перегляду з трьома помаранчевими крапками. Ви можете клацнути та перетягнути їх, щоб інтерактивно редагувати розміри фігури. Також ми можемо точно встановити розмір в інспекторі. Натисніть на :ref:`BoxShape3D <class_BoxShape3D>`, щоб розгорнути ресурс. Встановіть його *Size* на ``60`` для осі X, ``2`` для осі Y і ``60`` для осі Z.

source: Collision shapes are invisible. We need to add a visual floor that goes along with it. Select the ``Ground`` node and add a :ref:`MeshInstance3D <class_MeshInstance3D>` as its child.
es: Las formas de colisión son invisibles. Necesitamos agregar un piso visual que acompañe. Selecciona el nodo ``Ground`` y agrega un :ref:`MeshInstance3D <class_MeshInstance3D>` como su hijo.
fr: Les formes de collision sont invisibles. Nous devons ajouter un sol visuel qui va avec. Sélectionnez le nœud ``Ground`` et ajoutez-lui un :ref:`MeshInstance3D <class_MeshInstance3D>` comme enfant.
ga: Tá cruthanna imbhuailte dofheicthe. Ní mór dúinn urlár amhairc a chur leis a théann in éineacht leis. Roghnaigh an nód `` Ground`` agus cuir :ref:`MeshInstance3D <class MeshInstance3D>` leis mar leanbh.
it: Le forme di collisione sono invisibili. Abbiamo bisogno di aggiungere un pavimento visivo che combaci con il collisore. Seleziona il nodo ``Ground`` e aggiungi un nodo :ref:`MeshInstance3D <class_MeshInstance3D>` come suo figlio.
ja: 衝突形状は目に見えません。そのため、それに合わせて目に見える床を追加する必要があります。 ``Ground`` ノードを選択し、 :ref:`MeshInstance3D <class_MeshInstance3D>` を子ノードとして追加してください。
ko: 콜리전 모양은 보이지 않습니다. 이에 따라 시각적 바닥을 추가해야 합니다. ``Ground`` 노드를 선택하고 :ref:`MeshInstance3D <class_MeshInstance3D>`\ 를 자식 노드로 추가합니다.
ru: Collision shapes(то есть формы столкновения, или коллизии) являются невидимыми. Нам необходимо добавить видимый пол. Выберите узел ``Ground`` и добавьте к нему дочерний узел :ref:`MeshInstance3D <class_MeshInstance3D>`.
ta: மோதல் வடிவங்கள் கண்ணுக்கு தெரியாதவை. அதனுடன் செல்லும் ஒரு காட்சி தளத்தை நாம் சேர்க்க வேண்டும். `` தரையில்`` முனையைத் தேர்ந்தெடுத்து A: Ref: `meshinstance3d <class meshinstance3d>` அதன் குழந்தையாக.
tr: Çarpışma şekilleri görünmezdir. Onunla birlikte duracak görsel bir zemin eklememiz gerekiyor. ``Ground`` düğümünü seçin ve alt ögesi olarak bir :ref:`MeshInstance3D <class_MeshInstance3D>` (örgü örneklemesi) ekleyin.
uk: Форми зіткнення невидимі. Нам потрібно додати візуальну підлогу, з якою будуть вони будуть стикатися. Виберіть вузол землі ``Ground`` та додайте :ref:`MeshInstance3D <class_MeshInstance3D>` в якості нащадка.

source: In the *Inspector*, click on the field next to *Mesh* and create a :ref:`BoxMesh <class_BoxMesh>` resource to create a visible box.
es: En el *Inspector*, haz clic en el campo junto a *Mesh* y crea un recurso :ref:`BoxMesh <class_BoxMesh>` para crear un cubo visible.
fr: Dans l'*Inspecteur*, cliquez sur le champ à côté de *Mesh* et créez une ressource :ref:`BoxMesh <class_BoxMesh>` pour créer un cube visible.
ga: Sa *Cigire*, cliceáil ar an réimse in aice le *Mogalra* agus cruthaigh acmhainn :ref:`BoxMesh <class_BoxMesh>` chun bosca infheicthe a chruthú.
it: Nell'*Ispettore*, clicca sul campo accanto a *Mesh* e crea una risorsa :ref:`BoxMesh <class_BoxMesh>` per aggiungere un cubo visibile.
ja: *インスペクター* (Inspector)ドック内の *Mesh* の隣の *<空>* (empty)フィールドをクリックし、「新規 :ref:`BoxMesh <class_BoxMesh>` 」を選択して目に見えるボックスを作成します。
ko: *인스펙터*\ 에서 *메시* 옆에 필드를 클릭하고 :ref:`BoxMesh <class_BoxMesh>` 리소스를 만들어 보이는 상자를 만듭니다.
ru: В *инспекторе*, щелкните на поле рядом с *Mesh* и создайте :ref:`BoxMesh <class_BoxMesh>`, чтобы создать видимый параллелепипед.
ta: *இன்ச்பெக்டர் *இல், *மெச் *க்கு அடுத்த புலத்தைக் சொடுக்கு செய்து, ஒரு: குறிப்பு: `பாக்ச்மேச் <cols_boxmesh>` காணக்கூடிய பெட்டியை உருவாக்க வளத்தை உருவாக்கவும்.
tr: *Denetleyici*'de *Mesh*'in (örgü) yanındaki alana tıklayın ve görünür bir kutu oluşturmak için bir :ref:`BoxMesh <class_BoxMesh>` (kutu örgü) kaynağı oluşturun.
uk: У *Інспекторі* натисніть на поле поруч з *Mesh* і створіть ресурс :ref:`BoxMesh <class_BoxMesh>` *(Коробка меша)*, щоб створити видимий куб.

source: Once again, it's too small by default. Click the box icon to expand the resource and set its *Size* to ``60``, ``2``, and ``60``.
es: Una vez más, es demasiado pequeño por defecto. Haz clic en el icono del cubo para expandir el recurso y establecer su *Size* en ``60``, ``2`` y ``60``.
fr: Une fois de plus, il est trop petit par défaut. Cliquez sur l'icône de cube pour étendre la ressource et définissez sa *Size* à ``60``, ``2``, et ``60``.
ga: Arís eile, tá sé róbheag de réir réamhshocraithe. Cliceáil ar dheilbhín an bhosca chun an acmhainn a leathnú agus a *Size *a shocrú go ''60'', ''2'', agus ''60''.
it: Ancora una volta, le dimensioni predefinite sono troppo piccole. Clicca sull'icona del cubo per espandere la risorsa e imposta *Size* a ``60``, ``2`` e ``60``.
ja: 繰り返しになりますが、デフォルトの大きさでは床としては小さすぎます。 *インスペクター* 上で、選択したボックスのサムネイルをクリックして選択項目を展開し、 *Size* を X : ``60`` 、Y : ``2`` 、Z : ``60`` にして下さい。
ko: 디폴트로는 크기가 너무 작습니다. 상자 아이콘을 클릭하여 리소스를 확장하고 *크기*\ 를 각각 ``60``, ``2``, ``60``\ 으로 설정합니다.
ru: Опять же, по умолчанию он слишком мал. Нажмите на иконку куба, чтобы открыть его свойства и установите его *Размер* на ``60``, ``2``, и ``60``.
ta: மீண்டும், இது இயல்புநிலையாக மிகச் சிறியது. வளத்தை விரிவாக்க பெட்டி ஐகானைக் சொடுக்கு செய்து, அதன் * அளவு * ஐ `` 60``, `` 2``, மற்றும் `` 60`` என அமைக்கவும்.
tr: Bir kez daha, varsayılan boyutlar çok küçüktür. Kaynağı genişletmek için kutu simgesine tıklayın ve *Boyut*'unu ``60``, ``2`` ve ``60`` olarak ayarlayın.
uk: Знову ж таки, він занадто малий за замовчуванням. Клацніть піктограму куба, щоб масштабувати його, і встановіть *Size* на ``60``, ``2`` та ``60``.

source: You should see a wide grey slab that covers the grid and blue and red axes in the viewport.
es: Debería ver una losa gris ancha que cubre la cuadrícula y los ejes azul y rojo en la ventana gráfica.
fr: Vous devriez voir une large dalle grise qui couvre la grille et des axes bleus et rouges dans la fenêtre.
ga: Ba chóir duit leac leathan liath a fheiceáil a chlúdaíonn an ghreille agus aiseanna gorma agus dearga sa radharc.
it: Dovresti vedere un'ampia lastra grigia che copre la grigli, e gli assi blu e rossi nella viewport.
ja: ビューポートにグリッドを覆う広い灰色の平板と、青と赤の軸が表示されるはずです。
ko: 격자와 뷰포트의 파란색 및 빨간색 축을 덮는 넓은 회색 슬래브가 보일 것입니다.
ru: Вы должны видеть широкую серую плиту, которая покрывает сетку, и синие с красными оси в окне просмотра.
ta: வியூபோர்ட்டில் கட்டம் மற்றும் நீலம் மற்றும் சிவப்பு அச்சுகளை உள்ளடக்கிய பரந்த சாம்பல் ச்லாப்பை நீங்கள் காண வேண்டும்.
tr: Çerçevenin içinde ızgarayı kaplayan geniş gri bir tabaka ile mavi ve kırmızı eksenleri görüyor olmalısınız.
uk: Ви повинні побачити широку сіру плиту, яка покриває сітку і сині та червоні осі в вікні перегляду.

source: We're going to move the ground down so we can see the floor grid. To do this, the grid snapping feature can be used. Grid snapping can be activated 2 ways in the 3D editor. The first is by pressing the *Use Snap* button (or pressing the :kbd:`Y` key). The second is by selecting a node, dragging a handle on the gizmo **then** holding :kbd:`Ctrl` while still clicking to enable snapping as long as :kbd:`Ctrl` is held.
es: Para visualizar la cuadrícula del suelo, será necesario desplazar el terreno hacia abajo. Esto puede lograrse utilizando la función de ajuste a cuadrícula. La activación del ajuste a cuadrícula puede realizarse de dos formas en el editor 3D. La primera consiste en presionar el botón Usar Ajuste (o la tecla :kbd:Y). La segunda implica seleccionar un nodo, arrastrar un controlador del gizmo y **luego** mantener presionada la tecla :kbd:`Ctrl`. El ajuste a la cuadrícula tendrá afecto solo mientras tenga presionada la tecla :kbd:`Ctrl`.
fr: Nous allons déplacer le sol vers le bas pour pouvoir voir la grille du sol. Pour ce faire, la fonction d’aimantation de la grille peut être utilisée. L'aimantation de la grille peut être activé de 2 manières dans l'éditeur 3D. La première consiste à appuyer sur le bouton *Utiliser l'aimantation* (ou à appuyer sur la touche :kbd:`Y`). La seconde consiste à sélectionner un nœud, à faire glisser une poignée du gizmo **puis** à maintenir :kbd:`Ctrl` tout en cliquant pour activer l'aimantation tant que :kbd:`Ctrl` est maintenue.
ga: Táimid chun an talamh a bhogadh síos ionas gur féidir linn an ghreille urláir a fheiceáil. Chun seo a dhéanamh, is féidir an ghné snapping greille a úsáid. Is féidir snapping greille a ghníomhachtú 2 bhealach san eagarthóir 3D. Is é an chéad cheann ná an cnaipe *Use Snap *a bhrú (nó an eochair :kbd:'Y' a bhrú). Is é an dara ceann ná nód a roghnú, láimhseáil a tharraingt ar an gizmo **then** a bhfuil :kbd:'Ctrl' aige agus cliceáil fós chun snapping a chumasú chomh fada agus a choinnítear :kbd:'Ctrl'.
ja: 地面を下に移動して、床のグリッドを見えるようにしましょう。そのためにグリッドスナップ機能を使うことができます。グリッドスナップ機能を3Dエディタで使用する方法は2つあります。1つ目は、 *スナップを使用* (Use Snap)ボタンを押す（ :kbd:`Y` キーを押しても良いです）ことです。もう1つの方法は、ノードを選択し、ギズモまでマウスカーソルを移動させ、 :kbd:`Ctrl` を押しながらギズモをクリックすると、 :kbd:`Ctrl` を押している間、スナップが有効になり、整数値で位置調整を行うことがます。
ko: 바닥 격자를 볼 수 있도록 땅을 아래로 이동하겠습니다. 이를 위해 격자 스냅 기능을 사용할 수 있습니다. 3D 편집기에서 격자 스냅은 2가지 방법으로 활성화할 수 있습니다. 첫 번째는 *스냅 사용* 버튼을 누르거나 :kbd:`Y` 키를 누르는 것입니다. 두 번째는 노드를 선택하고 기즈모의 핸들을 드래그한 다음 **:kbd:`Ctrl` 키를 누른 상태에서** :kbd:`Ctrl` 키를 누른 채로 클릭하여 스냅을 활성화하는 것입니다.
ru: Мы собираемся опустить землю, чтобы увидеть сетку пола. Для этого можно использовать функцию привязки к сетке. Привязка к сетке может быть активирована двумя способами в 3D-редакторе. Первый способ – нажать кнопку *Использовать привязки* (или клавишу :kbd:`Y`). Второй способ – выбрать узел, потянуть за ручку на гизмо **и затем** удерживать :kbd:`Ctrl`, продолжая нажимать, чтобы привязка работала, пока удерживается :kbd:`Ctrl`.
ta: நாங்கள் தரையை கீழே நகர்த்தப் போகிறோம், இதனால் மாடி கட்டத்தைக் காணலாம். இதைச் செய்ய, கட்டம் ச்னாப்பிங் அம்சத்தைப் பயன்படுத்தலாம். கட்டம் ச்னாப்பிங் 3 டி எடிட்டரில் 2 வழிகளில் செயல்படுத்தப்படலாம். முதலாவது * ச்னாப் * பொத்தானை அழுத்துவதன் மூலம் (அல்லது அழுத்தி: kbd: `y` விசை). இரண்டாவது ஒரு முனையைத் தேர்ந்தெடுத்து, கிச்மோவில் ஒரு கைப்பிடியை இழுத்து ** பின்னர் ** ஓல்டிங்: KBD: `Ctrl`
tr: Zemin ızgarasını görebilmek için zemini aşağı taşıyacağız. Bunu yapmak için ızgara tutunma özelliği kullanılabilir. Izgara yakalama özelliği 3B düzenleyicide 2 şekilde etkinleştirilebilir. Birincisi *Tutunmayı Kullan* düğmesine basarak (veya :kbd:`Y` tuşuna basarak). İkincisi ise bir düğümü seçip alet üzerinde bir tutamacı sürükledikten **sonra** :kbd:`Ctrl` tuşunu basılı tutarak, :kbd:`Ctrl` tuşu basılı olduğu sürece yapışmayı etkinleştirmek için, tıklamaya devam etmektir.
uk: Ми перемістимо землю вниз, щоб побачити сітку підлоги. Для цього можна використовувати функцію прив’язки сітки. Прив’язку сітки можна активувати двома способами в 3D-редакторі. Ґ Перший – натиснути кнопку *Use Snap* (або натиснути клавішу :kbd:`Y`). По-друге, вибравши вузол, перетягнувши дескриптор гізмо, **потім** утримуючи :kbd:`Ctrl`, продовжуючи натискати, щоб увімкнути прив’язку, доки :kbd:`Ctrl` утримується.

source: Start by setting snapping with your preferred method. Then move the ``Ground`` node using the Y-axis (the green arrow on the gizmo).
es: Comience por configurar el ajuste con el método que prefiera. Luego, mueva el nodo ``Ground`` usando el eje Y (la flecha verde en el dispositivo).
fr: Commencez par définir l’aimantation avec votre méthode préférée. Déplacez ensuite le nœud ``Ground`` en utilisant l'axe Y (la flèche verte sur le gizmo).
ga: Tosaigh trí léim a shocrú leis an modh is fearr leat. Ansin bog an nód ''Ground'' ag baint úsáide as an Y-ais (an tsaighead ghlas ar an gizmo).
ja: まず、お好みの方法でスナップを設定して下さい。次にY軸（ギズモの緑の矢印）を使って ``Ground`` ノードを動かしましょう。
ru: Включите привязку. Переместите узел ``Ground``, используя ось Y (зеленая стрелочка) и привязку к сетке.
ta: உங்கள் விருப்பமான முறையுடன் ச்னாப்பிங் அமைப்பதன் மூலம் தொடங்கவும். Y- அச்சைப் பயன்படுத்தி `` தரையில்`` முனையை நகர்த்தவும் (கிச்மோவில் பச்சை அம்பு).
tr: Tercih ettiğiniz yöntemle tutunmayı ayarlayarak başlayın. Ardından Y eksenini (alet üzerindeki yeşil ok) kullanarak ``Ground`` düğümünü hareket ettirin.
uk: Почніть із налаштування прив’язки за допомогою бажаного методу. Потім перемістіть вузол ``Ground`` за допомогою осі Y (зелена стрілка на gizmo).

source: If you can't see the 3D object manipulator like on the image above, ensure the *Select Mode* is active in the toolbar above the view.
es: Si no puede ver el manipulador de objetos 3D como en la imagen de arriba, asegúrese de que el *Modo de selección* esté activo en la barra de herramientas sobre la vista.
fr: Si vous ne pouvez pas voir le manipulateur d'objets 3D comme sur l'image ci-dessus, assurez-vous que le *Mode sélection* est actif dans la barre d'outils au-dessus de la vue.
ga: Mura féidir leat an láimhseálaí oibiachta 3D a fheiceáil mar atá ar an íomhá thuas, cinntigh go bhfuil an *Select Mode *gníomhach sa bharra uirlisí os cionn an amhairc.
ja: 上の画像のように 3D オブジェクト マニピュレーターが表示されない場合は、ビューの上のツールバーで *選択モード(Select Mode)* がアクティブになっていることを確認してください。
ko: 위 이미지와 같이 3D 오브젝트 조작기를 볼 수 없으면, 뷰 위의 툴바에서 *선택 모드*\ 가 활성화되어 있는지 확인하세요.
ru: Если вы не видите манипулятор 3D-объектов, как на картинке сверху, убедитесь в том, что *Режим выделения* находится в активном состоянии на панели инструментов сверху.
ta: மேலே உள்ள படத்தைப் போன்ற 3D பொருள் கையாளுபவரை நீங்கள் காண முடியாவிட்டால், பார்வைக்கு மேலே உள்ள கருவிப்பட்டியில் * தேர்ந்தெடுக்கப்பட்ட பயன்முறை * செயலில் இருப்பதை உறுதிசெய்க.
tr: Eğer yukarıdaki resimdeki gibi 3B nesne yönlendiricileri göremiyorsanız, görüntünün üzerindeki araç çubuğunda *Seçme Kipi* 'nin etkin olduğundan emin olun.
uk: Якщо маніпулятор 3D-об'єктів не відображається, як на зображенні вище, переконайтеся, що *Режим виділення* активний на панелі інструментів над вікном перегляду.
