Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/02.player_input.po
Languages: de, es, fr, ga, it, ko, pl, ru, ta, tr, uk, zh_cn, zh_tw

source: To move the character, we will listen to the player's input, like pressing the arrow keys. In Godot, while we could write all the key bindings in code, there's a powerful system that allows you to assign a label to a set of keys and buttons. This simplifies our scripts and makes them more readable.
de: Um den Charakter zu bewegen, hören wir auf die Eingaben des Spielers, wie zum Beispiel das Drücken der Pfeiltasten. In Godot können wir zwar alle Tastenbelegungen in Code schreiben, es gibt allerdings ein mächtiges System das es Ihnen erlaubt, ein Label zu einer Liste von Tasten und Buttons hinzuzufügen. Dies vereinfacht unsere Skripte und macht sie lesbarer.
es: Para mover el personaje, escucharemos la entrada del jugador, como presionar las teclas de flecha. En Godot, aunque podríamos escribir todas las combinaciones de teclas en código, hay un poderoso sistema que te permite asignar una etiqueta a un conjunto de teclas y botones. Esto simplifica nuestros scripts y los hace más legibles.
fr: Pour déplacer le personnage, nous écouterons l'entrée du joueur, comme l'appui sur les touches fléchées. Dans Godot, plutôt que d'écrire toutes les liaisons dans le code, il y a un système puissant qui nous permet d'attribuer une étiquette à un ensemble de touches et de boutons. Cela simplifie nos scripts et les rend plus lisibles.
ga: Chun an carachtar a bhogadh, éistfimid le hionchur an imreora, cosúil leis na heochracha saighde a bhrú. I Godot, cé go bhféadfaimis na ceangail eochracha go léir a scríobh i gcód, tá córas cumhachtach ann a ligeann duit lipéad a shannadh do shraith eochracha agus cnaipí. Simplíonn sé seo ár scripteanna agus déanann sé níos inléite iad.
ko: 캐릭터를 움직이기 위해 플레이어의 입력, 예를 들어 화살표 키를 누르는 것을 감지할 것입니다. Godot에서는 모든 키 바인딩을 코드로 작성할 수 있지만, 키와 버튼 세트에 레이블을 할당할 수 있는 강력한 시스템이 있습니다. 이는 스크립트를 단순화하고 더 읽기 쉽게 만듭니다.
pl: Aby poruszać postacią, będziemy sprawdzać dane wejściowe, takie jak naciskanie klawiszy strzałek. W Godocie moglibyśmy napisać wszystkie powiązania klawiszy w kodzie, ale istnieje potężny system, który pozwala przypisać etykietę do zestawu klawiszy i przycisków. Upraszcza to nasze skrypty i czyni je bardziej czytelnymi.
ru: Чтобы персонаж начал двигаться, мы обратим внимание на пользовательский ввод, например, на нажатие стрелок на клавиатуре. В Godot, хоть мы и можем писать все привязки к клавишам в коде, но зачем если существует мощная система, которая позволяет вам маркировать набор клавиш и кнопок. Это облегчает наши скрипты и делает их более читаемыми.
ta: கதாபாத்திரத்தை நகர்த்த, அம்பு விசைகளை அழுத்துவது போன்ற வீரரின் உள்ளீட்டைக் கேட்போம். கோடோட்டில், எல்லா முக்கிய பிணைப்புகளையும் குறியீட்டில் எழுத முடியும் என்றாலும், விசைகள் மற்றும் பொத்தான்களின் தொகுப்பிற்கு ஒரு லேபிளை ஒதுக்க அனுமதிக்கும் ஒரு சக்திவாய்ந்த அமைப்பு உள்ளது. இது எங்கள் ச்கிரிப்ட்களை எளிதாக்குகிறது மற்றும் அவற்றை மேலும் படிக்கக்கூடியதாக ஆக்குகிறது.
tr: Karakteri canlandırmak için kullanıcı girdisini, ok tuşlarına basması gibi, dinleyeceğiz. Godot'da tüm tuş bağlamları kod içerisinde yazılabilir ancak bir grup girdiye özgü etiket belirleyebilen güçlü bir sistem var. Bu sistem, betiklerimizi sade ve okunabilir kılar.
uk: Щоб перемістити персонажа, ми прислухаємося до введення гравця, наприклад, натискання клавіш зі стрілками. У Godot, хоча ми могли б прописати всі прив'язки клавіш в коді, є потужна система, яка дозволяє призначити мітку комбінаціям клавіш і кнопок. Це спрощує наші скрипти і робить їх більш читабельними.
zh_cn: 要移动角色，我们就要监听玩家的输入，比如按下方向键。在 Godot 中，我们能够使用代码来绑定按键，但还有一个非常强大的系统，可以让你为一系列按键和按钮设置标签。这样可以简化我们的脚本，让它们更易读。
zh_tw: 要移動角色，我們就要監聽玩家的輸入，比如按下方向鍵。在 Godot 中，我們能夠使用程式碼來綁定按鍵，但還有一個非常強大的系統，可以讓你為一系列按鍵和按鈕設定標籤。這樣可以簡化我們的腳本，讓它們更易讀。

source: This system is the Input Map. To access its editor, head to the *Project* menu and select *Project Settings*.
ga: Is é an córas seo an Léarscáil Ionchurtha. Chun teacht ar a eagarthóir, téigh chuig an roghchlár *Project *agus roghnaigh *Project Arrangements *.
ko: 이 시스템은 입력 맵(Input Map)입니다. 해당 편집기에 접근하려면 *Project* 메뉴로 이동하여 *Project Settings*를 선택합니다.
pl: Ten system to mapa wejściowa (Input Map). Aby uzyskać dostęp edytora mapy, przejdź do menu *Projekt* i wybierz *Ustawienia projektu*.
ta: இந்த அமைப்பு உள்ளீட்டு வரைபடம். அதன் எடிட்டரை அணுக, *திட்ட *மெனுவுக்குச் சென்று *திட்ட அமைப்புகள் *என்பதைத் தேர்ந்தெடுக்கவும்.

source: |image6|
ga: |íomhá6|
ta: | படம் 6

source: image6
ga: íomhá6
ta: படம் 6

source: At the top, there are multiple tabs. Click on *Input Map*. This window allows you to add new actions at the top; they are your labels. In the bottom part, you can bind keys to these actions.
ga: Ag an mbarr, tá cluaisíní éagsúla ann. Cliceáil ar *Input map *. Ligeann an fhuinneog seo duit gníomhartha nua a chur ag an mbarr; is iad do lipéid iad. Sa chuid bun, is féidir leat eochracha a cheangal leis na gníomhartha seo.
ko: 상단에 여러 탭이 있습니다. *Input Map*을 클릭하세요. 이 창에서는 상단에 새로운 동작을 추가할 수 있습니다. 이들은 레이블입니다. 하단 부분에서는 이 동작에 키를 바인딩할 수 있습니다.
pl: U góry znajduje się wiele zakładek. Kliknij na *Input Map*. To okno umożliwia dodawanie nowych akcji u góry. W dolnej części można przypisać klawisze do tych akcji.
ta: மேலே, பல தாவல்கள் உள்ளன. *உள்ளீட்டு வரைபடம் *என்பதைக் சொடுக்கு செய்க. இந்த சாளரம் மேலே புதிய செயல்களைச் சேர்க்க உங்களை அனுமதிக்கிறது; அவை உங்கள் லேபிள்கள். கீழ் பகுதியில், இந்த செயல்களுடன் நீங்கள் விசைகளை பிணைக்கலாம்.

source: |image7|
ga: |íomhá7|
ta: | படம் 7 |

source: image7
ga: íomhá 7
ta: படம் 7

source: Godot projects come with some predefined actions designed for user interface design (see above screenshot). These will become visible if you enable the *Show Built-in Actions* toggle. We could use these here, but instead we're defining our own to support gamepads. Leave *Show Built-in Actions* disabled.
ga: Tagann tionscadail Godot le roinnt gníomhartha réamhshainithe atá deartha le haghaidh dearadh comhéadan úsáideora (féach thuas an pictiúr). Beidh siad seo le feiceáil má chumasaíonn tú an scoránaigh *Show Built-in Actions *. D'fhéadfaimis iad seo a úsáid anseo, ach ina ionad sin táimid ag sainiú ár gcuid féin chun tacú le gamepads. Fág *Taispeáin Gníomhartha Tógtha * faoi mhíchumas.
ko: Godot 프로젝트에는 사용자 인터페이스 디자인을 위해 설계된 몇 가지 사전 정의된 동작이 포함되어 있습니다(위의 스크린샷 참조). *Show Built-in Actions* 토글을 활성화하면 이러한 동작이 표시됩니다. 여기서 이것들을 사용할 수도 있지만, 대신 게임패드를 지원하기 위해 자체 동작을 정의하겠습니다. *Show Built-in Actions* 는 비활성화된 상태로 두세요.
ta: கோடோட் திட்டங்கள் பயனர் இடைமுக வடிவமைப்பிற்காக வடிவமைக்கப்பட்ட சில முன் வரையறுக்கப்பட்ட செயல்களுடன் வருகின்றன (மேலே திரைக்காட்சி பார்க்கவும்). நீங்கள் * சோ உள்ளமைக்கப்பட்ட செயல்களை * மாற்றினால் இவை தெரியும். இவற்றை நாங்கள் இங்கே பயன்படுத்தலாம், ஆனால் அதற்கு பதிலாக கேம்பேடுகளை ஆதரிக்க எங்கள் சொந்தத்தை வரையறுக்கிறோம். விடுங்கள் * உள்ளமைக்கப்பட்ட செயல்களைக் காட்டு * முடக்கப்பட்டது.

source: We're going to name our actions ``move_left``, ``move_right``, ``move_forward``, ``move_back``, and ``jump``.
de: Wir werden unsere Aktionen ``move_left``, ``move_right``, ``move_forward``, ``move_back`` und ``jump`` nennen.
es: Vamos a nombrar nuestras acciones ``move_left``, ``move_right``, ``move_forward``, ``move_back`` y ``jump``.
fr: Nous allons nommer nos actions ``move_left``, ``move_right``, ``move_forward``, ``move_back``, et ``jump``.
ga: Táimid chun ár ngníomhartha ''move_left'', 'move_right'', 'move_forward'', ''move_back'', agus ''léim'' a ainmniú.
ko: 동작의 이름을 ``move_left``, ``move_right``, ``move_forward``, ``move_back``, 그리고 ``jump`` 로 지정하겠습니다.
pl: Nazwiemy nasze akcje ``move_left``, ``move_right``, ``move_forward``, ``move_back`` i ``jump``.
ru: Мы назовем наши действия ``move_left``, ``move_right``, ``move_forward``, ``move_back``, и ``jump``.
ta: எங்கள் செயல்களை `` move_left``, `` move_right``, `` move_forward``, `` move_back``, மற்றும் `` சம்ப்`` என்று பெயரிடப் போகிறோம்.
tr: Eylemlerimizi ``move_left``, ``move_right``, ``move_forward``, ``move_back`` ve ``jump`` olarak adlandıracağız (sola git, sağa git, ileri git, geri git, zıpla).
uk: Ми назвемо наші дії ``move_left``, ``move_right``, ``move_forward``, ``move_back``, та ``jump``.
zh_cn: 我们要把这些动作命名为 ``move_left``\ 、\ ``move_right``\ 、\ ``move_forward``\ 、\ ``move_back``\ 、\ ``jump``\ （向左移动、向右移动、向前移动、向后移动、跳跃）。
zh_tw: 我們將把我們的動作命名為 ``move_left``、``move_right``、``move_forward``、``move_back`` 和 ``jump``。

source: To add an action, write its name in the bar at the top and press Enter.
ga: Chun gníomh a chur leis, scríobh a ainm sa bharra ag an mbarr agus brúigh Enter.
ko: 동작을 추가하려면 상단의 입력란에 이름을 작성하고 Enter 키를 누릅니다.
pl: Aby dodać akcję, wpisz jej nazwę na pasku u góry i naciśnij Enter.
ta: ஒரு செயலைச் சேர்க்க, அதன் பெயரை மேலே உள்ள பட்டியில் எழுதி Enter ஐ அழுத்தவும்.

source: |image8|
ga: |íomhá8|
ta: | படம் 8 |

source: image8
ga: íomhá8
ta: படம் 8

source: Create the following five actions:
de: Erstellen Sie die folgenden fünf Aktionen:
es: Crea las siguientes cinco acciones:
fr: Créez les cinq actions suivantes :
ga: Cruthaigh na cúig ghníomh seo a leanas:
it: Crea le seguenti cinque azioni:
pl: Utwórz pięć następujących akcji:
ru: Создайте следующие 5 действий:
ta: பின்வரும் ஐந்து செயல்களை உருவாக்கவும்:
tr: Aşağıdaki beş eylemi oluşturun:
uk: Створіть наступні п’ять дій:
zh_cn: 创建以下五个动作：
zh_tw: 有下列事項需注意：

source: |image9|
ga: |íomhá9|
ta: | படம் 9 |

source: image9
ga: íomhá9

source: To bind a key or button to an action, click the "+" button to its right. Do this for ``move_left``. Press the left arrow key and click *OK*.
ga: Chun eochair nó cnaipe a cheangal le gníomh, cliceáil ar an gcnaipe "+" ar dheis. Déan é seo le haghaidh ''move_left''. Brúigh an eochair arrow chlé agus cliceáil *OK *.
ko: 동작에 키나 버튼을 바인딩하려면 해당 동작 오른쪽의 "+" 버튼을 클릭합니다. ``move_left`` 에 대해 이 작업을 수행합니다. 왼쪽 화살표 키를 누르고 *OK* 를 클릭합니다.
pl: Aby powiązać klawisz lub przycisk z akcją, kliknij przycisk "+" po jego prawej stronie. Zrób to dla ``move_left``. Naciśnij klawisz strzałki w lewo i kliknij *OK*.
ta: ஒரு விசையை அல்லது பொத்தானை ஒரு செயலுடன் பிணைக்க, அதன் வலதுபுறத்தில் உள்ள "+" பொத்தானைக் சொடுக்கு செய்க. `` Move_left`` க்கு இதைச் செய்யுங்கள். இடது அம்பு விசையை அழுத்தி *சரி *என்பதைக் சொடுக்கு செய்க.

source: Bind also the :kbd:`A` key, onto the action ``move_left``.
de: Binden Sie auch die Taste :kbd:`A`, an die Aktion ``move_left``.
es: Asigna también la tecla :kbd:`A` a la acción ``move_left``.
fr: Liez également la touche :kbd:`A` à l'action ``move_left``.
ga: Ceangail freisin an eochair :kbd:'A', ar an ngníomh ''move_left''.
ko: :kbd:`A` 키도 ``move_left`` 동작에 바인딩합니다.
pl: Powiąż również klawisz :kbd:`A` z akcją ``move_left``.
ru: Привяжите также клавишу :kbd:`A` , на действие ``move_left``.
ta: மேலும்: கபாதி: `ஏ` விசை, செயலில்` `இடது`` நகர்த்தவும்.
tr: Ayrıca :kbd:`A` tuşunu ``move_left`` eylemine bağlayın (WASD için).
uk: Повʼяж також кнопку :kbd:`A` з подією ``move_left``.
zh_cn: 将 :kbd:`A` 键也绑定在动作 ``move_left`` 上面。
zh_tw: 將 :kbd:`A` 鍵也綁定在動作 ``move_left`` 上面。

source: |image12|
ga: |íomhá12|
ta: | படம் 12 |

source: image12
ga: íomhá12
ta: படம் 12

source: Let's now add support for a gamepad's left joystick. Click the "+" button again but this time, select *Manual Selection -> Joypad Axes*.
ga: Cuirimis tacaíocht anois do luamhán stiúrtha clé gamepad. Cliceáil ar an gcnaipe "+" arís ach an uair seo, roghnaigh *Roghnú Láimhe -> Aiseanna Joypad *.
ko: 이제 게임패드의 왼쪽 조이스틱을 지원하도록 추가하겠습니다. 다시 "+" 버튼을 클릭하고 이번에는 *Manual Selection -> Joypad Axes* 를 선택합니다.
pl: Dodajmy teraz obsługę lewego joysticka gamepada. Ponownie kliknij przycisk "+", ale tym razem wybierz *Manual Selection -> Joypad Axes*.
ta: கேம்பேடின் இடது சாய்ச்டிக்கிற்கு இப்போது ஆதரவைச் சேர்ப்போம். மீண்டும் "+" பொத்தானைக் சொடுக்கு செய்க, ஆனால் இந்த நேரத்தில், *கையேடு தேர்வு -> சாய்பேட் அச்சுகள் *என்பதைத் தேர்ந்தெடுக்கவும்.

source: Select the negative X axis of the left joystick.
ga: Roghnaigh ais dhiúltach X an luamhán stiúrtha ar chlé.
ko: 왼쪽 조이스틱의 음수 X 축을 선택합니다.
pl: Wybierz ujemną oś X lewego joysticka.
ta: இடது சாய்ச்டிக்கின் எதிர்மறை ஃச் அச்சைத் தேர்ந்தெடுக்கவும்.

source: Leave the other values as default and press *OK*
ga: Fág na luachanna eile mar réamhshocrú agus brúigh *OK *
ko: 다른 값은 기본값으로 두고 *OK* 를 누릅니다
pl: Pozostaw pozostałe wartości domyślne i naciśnij *OK*
ta: மற்ற மதிப்புகளை இயல்புநிலையாக விட்டுவிட்டு *சரி *ஐ அழுத்தவும்

source: If you want controllers to have different input actions, you should use the Devices option in Additional Options. Device 0 corresponds to the first plugged gamepad, Device 1 corresponds to the second plugged gamepad, and so on.
de: Wenn Sie den Controllern unterschiedliche Eingabeaktionen zuweisen möchten, sollten Sie die Option Geräte in den Zusatzoptionen verwenden. Gerät 0 entspricht dem ersten angeschlossenen Gamepad, Gerät 1 entspricht dem zweiten angeschlossenen Gamepad usw.
es: Si quieres que los controles tengan distintas acciones, deberías usar la opción Dispositivo en Opciones Adicionales. Dispositivo 0 corresponde al primer gamepad conectado, Dispositivo 1 corresponde al segundo gamepad conectado, y así.
fr: Si vous souhaitez que les contrôleurs aient des actions d'entrée différentes, vous devez utiliser l'option Périphériques dans les Options supplémentaires. Le périphérique 0 correspond à la première manette de jeu branchée, le périphérique 1 correspond à la deuxième manette de jeu branchée, et ainsi de suite.
ga: Más mian leat go mbeadh gníomhartha ionchuir éagsúla ag rialaitheoirí, ba cheart duit an rogha Gléasanna a úsáid i Roghanna Breise. Freagraíonn Gléas 0 don chéad gamepad plugáilte, freagraíonn Gléas 1 don dara gamepad plugáilte, agus mar sin de.
ko: 컨트롤러에 서로 다른 입력 동작을 할당하려면 Additional Options에서 Devices 옵션을 사용해야 합니다. Device 0은 첫 번째로 연결된 게임패드에 해당하고, Device 1은 두 번째로 연결된 게임패드에 해당하며, 계속해서 순서대로 할당됩니다.
pl: Jeśli chcesz, aby kontrolery miały różne akcje wejściowe, powinieneś użyć opcji Urządzenia w Opcjach Dodatkowych. Urządzenie 0 odpowiada pierwszemu podłączonemu gamepadowi, urządzenie 1 odpowiada drugiemu podłączonemu gamepadowi itd.
ru: Если вы хотите, чтобы контроллеры имели разные действия ввода, вам следует использовать параметр Устройства в разделе Дополнительные параметры. Устройство 0 соответствует первому подключенному геймпаду, Устройство 1 соответствует второму подключенному геймпаду и так далее.
ta: கட்டுப்பாட்டாளர்கள் வெவ்வேறு உள்ளீட்டு செயல்களைக் கொண்டிருக்க விரும்பினால், கூடுதல் விருப்பங்களில் சாதனங்கள் விருப்பத்தைப் பயன்படுத்த வேண்டும். சாதனம் 0 முதல் செருகப்பட்ட கேம்பேடிற்கு ஒத்திருக்கிறது, சாதனம் 1 இரண்டாவது செருகப்பட்ட கேம்பேடிற்கு ஒத்திருக்கிறது, மற்றும் பல.
tr: Denetleyicilerin farklı giriş eylemlerine sahip olmasını istiyorsanız, Ek Seçenekler'deki Aygıtlar seçeneğini kullanmalısınız. Aygıt 0, ilk takılı oyun kumandasına, Aygıt 1 ikinci takılı oyun kumandasına karşılık gelir ve bu böyle devam eder.
uk: Якщо ви хочете щоб контролери мали різні вхідні події, потрібно скористатися з налаштувань Пристрою в Додаткових Опціях. Пристрій 0 відповіда за перший підʼєднаний геймпад, Пристрій 1 відповіда за другий підʼєднаний геймпад і так далі.
zh_cn: 如果你想让多个手柄有不同的输入动作，你需要在额外选项中使用设备选项。设备 0 对应的是第一个插入的手柄，设备 1 对应的是第二个插入的手柄，以此类推。
zh_tw: 如果你想讓多個手柄有不同的輸入動作，你需要在額外選項中使用裝置選項。裝置 0 對應的是第一個插入的手柄，裝置 1 對應的是第二個插入的手柄，以此類推。

source: Do the same for the other input actions. For example, bind the right arrow, D, and the left joystick's positive axis to ``move_right``. After binding all keys, your interface should look like this.
de: Machen Sie das gleiche für die anderen Eingabeaktionen. Zum Beispiel binden Sie den rechten Pfeil, D, und die positive Achse des linken Joysticks an ``move_right``. Nachdem Sie alle Tasten gebunden haben, sollte Ihre Benutzeroberfläche wie folgt aussehen.
es: Haz lo mismo para otras acciones de entrada. Por ejemplo, vincula la flecha derecha, D y el eje positivo del joystick izquierdo a ``move_right``. Después de vincular todas las teclas, su interfaz debería verse así.
fr: Faîtes de même pour les autres actions. Par exemple, liez la flèche de droite, D, et l'axe positif du joystick gauche à ``move_right``. Après avoir lié toutes les touches, votre interface devrait ressembler à ceci.
ga: Déan an rud céanna do na gníomhartha ionchuir eile. Mar shampla, ceangail an tsaighead dheas, D, agus ais dhearfach an luamhán stiúrtha ar chlé go ''move_right''. Tar éis gach eochair a cheangal, ba chóir go mbeadh cuma mar seo ar do chomhéadan.
ko: 다른 입력 동작에 대해서도 동일하게 수행합니다. 예를 들어, 오른쪽 화살표, D 키, 왼쪽 조이스틱의 양수 축을 ``move_right`` 에 바인딩합니다. 모든 키를 바인딩한 후, 인터페이스는 다음과 같이 보여야 합니다.
pl: Zrób to samo dla innych akcji wejściowych. Na przykład, przypisz strzałkę w prawo, D i dodatnią oś lewego joysticka do ``move_right``. Po przypisaniu wszystkich klawiszy interfejs powinien wyglądać następująco.
ru: Сделайте то же самое и для других действий ввода. К примеру, привяжите клавишу вправо, D, и правую ось левого джойстика к ``move_right``. После того как вы привяжите все клавиши, ваш интерфейс должен выглядеть следующим образом.
ta: மற்ற உள்ளீட்டு செயல்களுக்கும் இதைச் செய்யுங்கள். எடுத்துக்காட்டாக, வலது அம்பு, டி மற்றும் இடது சாய்ச்டிக்கின் நேர்மறை அச்சை `` move_right`` உடன் பிணைக்கவும். எல்லா விசைகளையும் பிணைத்த பிறகு, உங்கள் இடைமுகம் இப்படி இருக்க வேண்டும்.
tr: Diğer giriş eylemleri için de aynısını yapın. Örneğin, sağ ok, D ve sol oyun kolunun pozitif eksenini ``move_right`` olarak bağlayın. Tüm tuşları bağladıktan sonra, arayüzünüz aşağıdaki gibi görünmelidir.
uk: Виконайте те саме для інших дій введення. Наприклад, прив’яжіть стрілку вправо D і позитивну вісь лівого джойстика до ``move_right``. Після прив’язки всіх ключів ваш інтерфейс має виглядати так.
zh_cn: 为其他输入动作也执行同样的操作。比如将右方向键、D、左摇杆的正轴绑定给 ``move_right``\ 。全部绑定完后，你的界面应该类似这样。
zh_tw: 為其他輸入動作也執行同樣的操作。比如將右方向鍵、D、左搖桿的正軸綁定給 ``move_right``。全部綁定完後，你的介面應該類似這樣。

source: |image15|
ga: |íomhá15|
ta: | படம் 15 |

source: image15
ga: íomhá15
ta: படம் 15

source: The final action to set up is the ``jump`` action. Bind the Space key and the gamepad's A button.
ga: Is é an gníomh deiridh atá le bunú ná an gníomh ''léim''. Ceangail an eochair Spás agus cnaipe A an gamepad.
ko: 마지막으로 설정할 동작은 ``jump`` 동작입니다. Space 키와 게임패드의 A 버튼을 바인딩합니다.
pl: Ostatnią akcją do skonfigurowania jest akcja ``skok``. Powiąż klawisz spacji i przycisk A gamepada.
ta: அமைப்பதற்கான இறுதி நடவடிக்கை `` சம்ப்` அதிரடி. விண்வெளி விசை மற்றும் கேம்பேடின் ஒரு பொத்தானை பிணைக்கவும்.

source: |image16|
ga: |íomhá16|
ta: | படம் 16 |

source: image16
ga: íomhá16
ta: படம் 16

source: Your jump input action should look like this.
de: Ihre Sprung-Eingabeaktion sollte wie folgt aussehen.
es: Tu acción de entrada jump debería verse así.
fr: Votre action d'entrée de saut devrait ressembler à ceci.
ga: Ba chóir go mbeadh cuma mar seo ar do ghníomh ionchuir léim.
it: La tua azione di salto dovrebbe essere simile a questa.
pl: Sterowanie dla akcji skoku powinno wyglądać następująco.
ru: Действие ввода прыжка должно выглядеть следующим образом.
ta: உங்கள் சம்ப் உள்ளீட்டு நடவடிக்கை இப்படி இருக்க வேண்டும்.
tr: Sıçrama giriş eylemi bunun gibi görünmelidir.
uk: Дія введення для стрибка має виглядати так.
zh_cn: 你的跳跃输入动作应该看上去类似这样。
zh_tw: 你的跳躍輸入動作應該會像這樣。

source: |image18|
ga: |íomhá18|
ta: | படம் 18 |

source: image18
ga: íomhá18
ta: படம் 18

source: That's all the actions we need for this game. You can use this menu to label any groups of keys and buttons in your projects.
de: Das sind alle Aktionen die wir für dieses Spiel brauchen. Sie können dieses Menü nutzen um beliebige Gruppen von Tasten und Buttons in ihren Projekten zu beschriften.
es: Esas son todas las acciones necesarios por el juego. Puedes usar este menú para designar cualquier grupo de tecla o botón en sus proyectos.
fr: Voilà toutes les actions dont nous avons besoin pour ce jeu. Vous pouvez utiliser ce menu pour étiqueter tout groupe de touches et de boutons dans vos projets.
ga: Sin na gníomhartha go léir a theastaíonn uainn don chluiche seo. Is féidir leat an roghchlár seo a úsáid chun lipéad a chur ar aon ghrúpaí eochracha agus cnaipí i do thionscadail.
ko: 이것이 이 게임에 필요한 모든 동작입니다. 이 메뉴를 사용하여 프로젝트에서 키와 버튼 그룹에 레이블을 지정할 수 있습니다.
pl: To wszystkie akcje, których potrzebujemy w tej grze. Możesz użyć tego menu do oznaczenia dowolnych grup klawiszy i przycisków w swoich projektach.
ru: Это все действия, которые необходимы нам для данной игры. Вы можете использовать меню, чтобы маркировать любые группы клавиш или кнопок в ваших проектах.
ta: இந்த விளையாட்டுக்கு நமக்குத் தேவையான அனைத்து செயல்களும் அவ்வளவுதான். உங்கள் திட்டங்களில் உள்ள விசைகள் மற்றும் பொத்தான்களின் எந்த குழுக்களையும் லேபிளிட இந்த மெனுவைப் பயன்படுத்தலாம்.
tr: Oyun için ihityacımız olan tüm eylemler bunlar. Bu menüyü kullanarak, projelerinizde tuş ve düğme gruplarını belirleyebilirsiniz.
uk: Це всі дії, які нам потрібні для цієї гри. За допомогою цього меню можна позначити будь-які групи клавіш і кнопок у ваших проектах.
zh_cn: 这些就是这个游戏所需的所有动作了。你可以使用这个菜单来对项目中的任意按键和按钮组进行标记。
zh_tw: 這些就是這個遊戲所需的所有動作了。你可以使用這個功能表來對專案中的任意按鍵和按鈕組進行標記。

source: In the next part, we'll code and test the player's movement.
de: Im nächsten Teil werden wir die Bewegung des Spielers programmieren und testen.
es: En el siguiente parte, vamos a programar y verificar el movimiento de jugador.
fr: Dans la partie suivante, nous allons coder et tester le mouvement du joueur.
ga: Sa chéad chuid eile, déanfaimid códú agus tástáil ar ghluaiseacht an imreora.
ko: 다음 부분에서는 플레이어의 움직임을 코딩하고 테스트하겠습니다.
pl: W następnej części zakodujemy i przetestujemy ruchy gracza.
ru: В следующей части мы будем программировать и тестировать движения персонажа.
ta: அடுத்த பகுதியில், பிளேயரின் இயக்கத்தை குறியிட்டு சோதிப்போம்.
tr: Bir sonraki bölümde, oyuncunun hareketini kodlayacağız ve deneyeceğiz.
uk: У наступній частині ми закодуємо і перевіримо рух гравця.
zh_cn: 在下一部分，我们将为玩家的移动进行编程和测试。
zh_tw: 在下一部分，我們將為玩家的移動進行程式設計和測試。

source: Create a new scene by going to the **Scene** menu in the top-left and clicking **New Scene**.
fr: Créez une nouvelle scène en allant dans le menu **Scène** en haut à gauche et en cliquant sur **Nouvelle scène**.
it: Crea una nuova scena andando nel menu **Scena** in alto a sinistra e cliccando su **Nuova scena**.
ru: Создайте новую сцену, перейдя в меню **Scene** в левом верхнем углу и нажав **New Scene**.
uk: Створіть нову сцену, перейшовши до меню **Сцена** у верхньому лівому куті та натиснувши **Нова сцена**.
zh_cn: 在左上角的\ **场景**\ 菜单中单击\ **新建场景**\ ，创建一个新场景。
zh_tw: 到左上角 **Scene** 功能表點擊 **New Scene** 建立新場景。

source: Click the **Other Node** button and select the ``CharacterBody3D`` node type to create a :ref:`CharacterBody3D <class_CharacterBody3D>` as the root node.
fr: Cliquez sur le bouton **Autre nœud** et sélectionnez le type de nœud ``CharacterBody3D`` pour créer un :ref:`CharacterBody3D <class_CharacterBody3D>` comme nœud racine.
ru: Нажмите кнопку **Other Node** и выберите тип узла ``CharacterBody3D`` для создания :ref:`CharacterBody3D <class_CharacterBody3D>` как корневого узла.
uk: Натисніть кнопку **Інший вузол** та виберіть тип вузла ``CharacterBody3D``, щоб створити :ref:`CharacterBody3D <class_CharacterBody3D>` як кореневий вузол.
zh_cn: 点击\ **其他节点**\ 按钮，选择 ``CharacterBody3D`` 节点类型，创建一个 :ref:`CharacterBody3D <class_CharacterBody3D>` 作为根节点。
zh_tw: 點擊 **Other Node** 並選擇 ``CharacterBody3D`` 節點型別，建立 :ref:`CharacterBody3D <class_CharacterBody3D>` 作為根節點。
