Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/02.player_input.po
Languages: de, es, fr, ga, it, ko, pl, ru, ta, tr, uk, zh_cn, zh_tw

source: Rename the :ref:`CharacterBody3D <class_CharacterBody3D>` to ``Player``. Character bodies are complementary to the area and rigid bodies used in the 2D game tutorial. Like rigid bodies, they can move and collide with the environment, but instead of being controlled by the physics engine, **you** dictate their movement. You will see how we use the node's unique features when we code the jump and squash mechanics.
fr: Renommez le :ref:`CharacterBody3D <class_CharacterBody3D>` en ``Player``. Les corps des personnages sont complémentaires de la zone et des corps rigides utilisés dans le didacticiel du jeu 2D. Comme les corps rigides, ils peuvent se déplacer et entrer en collision avec l'environnement, mais au lieu d'être contrôlés par le moteur physique, **vous** dictez leur mouvement. Vous verrez comment nous utilisons les fonctionnalités uniques du nœud lorsque nous codons les mécanismes de saut et d'écrasement.
it: Rinomina il nodo :ref:`CharacterBody3D <class_CharacterBody3D>` in ``Player``. I nodi di tipo CharacterBody sono complementari alle aree e ai corpi rigidi utilizzati nel tutorial di gioco 2D. Come i corpi rigidi, questi possono muoversi ed entrare in collisione con l'ambiente, ma invece di essere controllati dal motore di fisica, sei **tu** a dirigerne i movimenti. Vedrai come utilizzare le funzionalità uniche del nodo quando andremo a programmare le meccaniche di salto e di schiacciamento.
ru: Переименуйте :ref:`CharacterBody3D <class_CharacterBody3D>` в ``Player``. Тела персонажей дополняют тела области и твёрдые тела, используемые в руководстве по 2D-игре. Как и твёрдые тела, они могут двигаться и сталкиваться с окружающей средой, но вместо того, чтобы управляться физическим движком, **вы** управляете их движением. Вы увидите, как мы используем уникальные возможности узла, когда будем кодировать механику прыжка и сжатия.
uk: Перейменуйте :ref:`CharacterBody3D <class_CharacterBody3D>` на ``Player``. Тіла персонажів доповнюють площу та тверді тіла, що використовуються в навчальній програмі 2D-гри. Як і тверді тіла, вони можуть рухатися та стикатися з навколишнім середовищем, але замість того, щоб керуватися фізичним двигуном, **ви** диктуєте їхній рух. Ви побачите, як ми використовуємо унікальні особливості вузла, коли кодуватимемо механіку стрибка та стиснення.
zh_cn: 将 :ref:`CharacterBody3D <class_CharacterBody3D>` 命名为 ``Player``\ 。角色体是对 2D 游戏教程中使用的区域和刚体的补充。与刚体一样，它们可以移动并与环境发生碰撞，但不受物理引擎控制，而是由\ **你**\ 决定它们的运动。当我们编写跳跃和踩踏机制时，你就会看到我们是如何使用这一该节点独有的特性的。
zh_tw: 將 :ref:`CharacterBody3D <class_CharacterBody3D>` 重新命名為 ``Player``。角色身體與 2D 教學中的 Area 與 RigidBody 互相對應。和剛體一樣，它能移動並與環境碰撞，但移動不是由物理引擎主導，而是由 **你** 來控制。之後在實作跳躍與踩扁機制時，你會看到此節點的獨特特性如何派上用場。

source: Add a :ref:`Node3D <class_Node3D>` node as a child of ``Player``. Select the ``Player`` node in the **Scene** tree and click the "**+**" button to add a child node. Rename it to ``Pivot``.
fr: Ajoutez un nœud :ref:`Node3D <class_Node3D>` comme enfant de ``Player``. Sélectionnez le nœud ``Player`` dans l'arborescence de **Scène** et cliquez sur le bouton "**+**" pour ajouter un nœud enfant. Renommez le ``Pivot``.
it: Aggiungi un nodo :ref:`Node3D <class_Node3D>` come figlio del nodo ``Player``. Seleziona il nodo ``Player`` nell'albero di **Scena** clicca il pulsante "**+**" per aggiungere un nodo figlio. Rinominalo in ``Pivot``.
ru: Добавьте узел :ref:`Node3D <class_Node3D>` в качестве дочернего узла для ``Player``. Выберите узел ``Player`` в дереве **Scene** и нажмите кнопку «**+**», чтобы добавить дочерний узел. Переименуйте его в ``Pivot``.
uk: Додайте вузол :ref:`Node3D <class_Node3D>` як дочірній вузол ``Player``. Виберіть вузол ``Player`` у дереві **Scene** та натисніть кнопку "**+**", щоб додати дочірній вузол. Перейменуйте його на ``Pivot``.
zh_cn: 为 ``Player`` 节点添加一个 :ref:`Node3D <class_Node3D>` 子节点。在\ **场景**\ 树中选中 ``Player`` 节点，点击“\ **+**\ ”按钮添加子节点，并将其重命名为 ``Pivot``\ 。
zh_tw: 新增一個 :ref:`Node3D <class_Node3D>` 作為 ``Player`` 的子節點。在 **Scene** 樹選取 ``Player``，點擊「**+**」新增子節點，並命名為 ``Pivot``。

source: The ``.glb`` files contain 3D scene data based on the open source glTF 2.0 specification. They're a modern and powerful alternative to a proprietary format like FBX, which Godot also supports. To produce these files, we designed the model in `Blender 3D <https://www.blender.org/>`__ and exported it to glTF.
fr: Les fichiers ``.glb`` contiennent des données de scènes 3D basées sur la spécification open-source glTF 2.0. C'est une alternative moderne et puissante à un format propriétaire comme FBX, que Godot prend également en charge. Pour produire ces fichiers, nous avons conçu le modèle dans `Blender 3D <https://www.blender.org/>`__ et l'avons exporté en glTF.
it: I file ``.glb`` contengono dati di scene 3D basati sulla specificazione open source glTF 2.0. Sono una moderna e potente alternativa a formati proprietari come FBX, anch'esso supportato da Godot. Per creare questi file, abbiamo progettato il modello in `Blender 3D <https://www.blender.org/>`__ e lo abbiamo esportato in glTF.
ru: Файлы ``.glb`` содержат данные 3D-сцены на основе открытой спецификации glTF 2.0. Они являются современной и мощной альтернативой проприетарному формату, как FBX, который Godot также поддерживает. Для создания этих файлов спроектируйте модель в `Blender 3D <https://www.blender.org/>`__ и экспортируйте ее в glTF.
uk: Файли ``.glb`` містять дані 3D-сцени на основі специфікації glTF 2.0 з відкритим кодом. Вони є сучасною та потужною альтернативою власному формату, такому як FBX, який Godot також підтримує. Щоб створити ці файли, ми розробили модель у `Blender 3D <https://www.blender.org/>`__ та експортували її до glTF.
zh_cn: ``.glb`` 文件包含基于开源的 GLTF 2.0 规范的 3D 场景数据。它是一种现代的、强大的并替代 FBX 等专有格式的文件，Godot 也支持这种格式。为了制作这些文件，我们在 `Blender 3D <https://www.blender.org/>`__ 中设计了模型，并将其导出为 glTF。
zh_tw: ``.glb`` 檔案包含基於開放原始碼 glTF 2.0 規格的 3D 場景資料。它們是現代且強大的替代方案，可取代像 FBX 這樣的專有格式，而 Godot 也支援 FBX。為了產生這些檔案，我們在 `Blender 3D <https://www.blender.org/>`__ 中設計模型，並將其匯出為 glTF。

source: As with all kinds of physics nodes, we need a collision shape for our character to collide with the environment. Select the ``Player`` node again and add a child node :ref:`CollisionShape3D <class_CollisionShape3D>`. In the **Inspector**, on the **Shape** property, add a new :ref:`SphereShape3D <class_SphereShape3D>`.
fr: Comme avec tous les types de nœuds physiques, nous avons besoin d'une forme de collision pour que notre personnage puisse entrer en collision avec l'environnement. Sélectionnez le nœud ``Player`` à nouveau et ajoutez-lui un nœud enfant :ref:`CollisionShape3D <class_CollisionShape3D>`. Dans l'**Inspecteur**, assignez une nouvelle :ref:`SphereShape3D <class_SphereShape3D>` à la propriété **Shape**.
ru: Как и для всех физических узлов, нам нужна форма столкновения, чтобы наш персонаж сталкивался с окружающей средой. Снова выберите узел ``Player`` и добавьте дочерний узел :ref:`CollisionShape3D <class_CollisionShape3D>`. В **Inspector**, в свойстве **Shape**, добавьте новый узел :ref:`SphereShape3D <class_SphereShape3D>`.
uk: Як і з усіма видами фізичних вузлів, нам потрібна форма зіткнення, щоб наш персонаж стикався з оточенням. Знову виберіть вузол ``Player`` та додайте дочірній вузол :ref:`CollisionShape3D <class_CollisionShape3D>`. В **Інспекторі**, до властивості **Shape**, додайте новий :ref:`SphereShape3D <class_SphereShape3D>`.
zh_tw: 與所有物理相關節點相同，我們需要碰撞形狀讓角色能與環境碰撞。再次選取 ``Player``，新增子節點 :ref:`CollisionShape3D <class_CollisionShape3D>`。在 **Inspector** 的 **Shape** 屬性加入新的 :ref:`SphereShape3D <class_SphereShape3D>`。

source: To make moving the shape easier, you can toggle the model's visibility by clicking the **eye icon** next to the ``Character`` or the ``Pivot`` nodes.
fr: Pour faciliter le déplacement de la forme, vous pouvez activer et désactiver la visibilité du modèle en cliquant sur l'**icône en forme d'œil** à côté des nœuds ``Character`` ou ``Pivot``.
ru: Чтобы упростить перемещение фигуры, можно включить или отключить видимость модели, нажав на **значок глаза** рядом с узлами ``Character`` или ``Pivot``.
uk: Щоб спростити переміщення фігури, ви можете змінити видимість моделі, натиснувши **значок ока** поруч із вузлами ``Персонаж`` або ``Опорна точка``.
zh_cn: 为了使形状移动更容易，你可以通过点击 ``Character`` 或 ``Pivot`` 节点旁边的 **眼睛图标** 来切换模型的可见性。
zh_tw: 為了更容易移動形狀，你可以點擊 ``Character`` 或 ``Pivot`` 節點旁的 **眼睛圖示** 來切換模型可見度。

source: Save the scene as ``player.tscn``.
fr: Enregistrez la scène sous le nom ``player.tscn``.
it: Salva la scena con il nome ``player.tscn``.
ru: Сохраните сцену как ``player.tscn``.
uk: Збережіть сцену як ``player.tscn``.
zh_cn: 将场景保存为 ``player.tscn``\ 。
zh_tw: 將場景儲存為 ``player.tscn``。

source: This system is the Input Map. To access its editor, head to the **Project** menu and select **Project Settings...**.
fr: Ce système est l'Input Map ("Contrôles" en français). Pour accéder à son éditeur, allez dans le menu **Projet** et sélectionnez **Paramètres du projet...**.
ru: Эта система называется Input Map (Карта входных данных). Чтобы открыть её редактор, перейдите в меню **Project** и выберите **Project Settings...**.
uk: Ця система називається Вхідною Картаю. Щоб отримати доступ до її редактора, перейдіть до меню **Проект** та виберіть **Налаштування проекту...**.
zh_cn: 这个系统是“输入映射”。可以在\ **项目**\ 菜单中选择\ **项目设置...**\ 来打开编辑器。
zh_tw: 這個系統稱為 Input Map。要開啟其編輯器，請到 **Project** 功能表並選擇 **Project Settings...**。

source: At the top, there are multiple tabs. Click on **Input Map**. This window allows you to add new actions at the top; they are your labels. In the bottom part, you can bind keys to these actions.
fr: En haut, il y a plusieurs onglets. Cliquez sur **Contrôles**. Cette fenêtre vous permet d'ajouter de nouvelles actions en haut ; ce sont vos étiquettes. Dans la partie inférieure, vous pouvez lier des touches à ces actions.
ru: В верхней части есть несколько вкладок. Нажмите **Input Map**. Это окно позволяет добавлять новые действия вверху — ваши метки. В нижней части можно привязать клавиши к этим действиям.
uk: Угорі є кілька вкладок. Натисніть **Ввести карту**. Це вікно дозволяє додавати нові дії вгорі; це ваші мітки. У нижній частині ви можете прив’язати клавіші до цих дій.
zh_cn: 窗口顶部设有多个选项卡。点击\ **输入映射** \ 。你可以在这个窗口上部添加新的动作——即动作标签。在下半部分，你可以为这些动作绑定按键。
zh_tw: 上方有多個分頁。點選 **Input Map**。此視窗允許你在上方新增動作，下方則可為動作綁定按鍵或按鈕。

source: Godot projects come with some predefined actions designed for user interface design (see above screenshot). These will become visible if you enable the **Show Built-in Actions** toggle. We could use these here, but instead we're defining our own to support gamepads. Leave **Show Built-in Actions** disabled.
fr: Les projets Godot sont livrés avec des actions prédéfinies conçues pour la conception de l'interface utilisateur (voir la capture d'écran ci-dessus). Celles-ci deviendront visibles si vous activez le bouton **Afficher les actions intégrées**. Nous pourrions les utiliser ici, mais à la place, nous définissons les nôtres pour prendre en charge les manettes de jeu. Laissez **Afficher les actions intégrées** désactivé.
ru: Проекты Godot содержат несколько предустановленных действий, разработанных для дизайна пользовательского интерфейса (см. скриншот выше). Они станут видимыми, если включить переключатель **Show Built-in Actions**. Мы могли бы использовать их здесь, но вместо этого определяем свои собственные для поддержки геймпадов. Оставьте **Show Built-in Actions** отключенным.
uk: Проєкти Godot мають деякі попередньо визначені дії, розроблені для дизайну користувацького інтерфейсу (див. скріншот вище). Вони стануть видимими, якщо ви ввімкнете перемикач **Показувати вбудовані дії**. Ми могли б використовувати їх тут, але замість цього ми визначаємо власні для підтримки геймпадів. Залиште **Показувати вбудовані дії** вимкненим.
zh_cn: Godot 项目针对用户界面设计提供了一些预定义的动作（见上面的截图）。这些动作在打开\ **显示内置动作** \ 开关后可见。我们可以使用这些动作，但我们要定义自己的动作来支持游戏手柄。请将\ **显示内置动作**\ 保持禁用。
zh_tw: Godot 專案內含一些為使用者介面設計而預先定義的動作（見上方截圖）。啟用 **Show Built-in Actions** 即可顯示。我們也可以直接使用它們，但這裡為了支援手把，將自訂動作。請保持 **Show Built-in Actions** 關閉。

source: To add an action, write its name in the bar at the top and press Enter or click the **Add** button.
fr: Pour ajouter une action, écrivez son nom dans la barre en haut et appuyez sur Entrée ou cliquez sur le bouton **Ajouter**.
it: Per aggiungere una azione, scrivi il suo nome nella barra in alto e premi Invio oppure fai clic sul pulsante **Aggiungi**.
ru: Чтобы добавить действие, напишите его название в строке вверху и нажмите Enter или кнопку **Add**.
uk: Щоб додати дію, напишіть її назву у верхній частині рядка та натисніть Enter або натисніть кнопку **Додати**.
zh_cn: 要添加动作，可以在顶部的框中输入名称然后按回车键或点击\ **添加**\ 按钮。
zh_tw: 要新增動作，請在上方輸入名稱後按 Enter，或點擊 **Add**。

source: To bind a key or button to an action, click the "**+**" button to its right. Do this for ``move_left``. Press the left arrow key and click **OK**.
fr: Pour lier une touche ou un bouton à une action, cliquez sur le bouton "**+**" à sa droite. Faîtes-le pour ``move_left``. Appuyez sur la touche flèche gauche et cliquez sur **OK**.
ru: Чтобы назначить клавишу или кнопку действию, нажмите кнопку "**+**" справа от неё. Сделайте то же самое для ``move_left``. Нажмите клавишу со стрелкой влево и нажмите **OK**.
uk: Щоб прив’язати клавішу або кнопку до дії, натисніть кнопку «**+**» праворуч від неї. Зробіть це для ``move_left``. Натисніть клавішу зі стрілкою вліво та натисніть **OK**.
zh_tw: 要將按鍵或按鈕綁定到動作，點擊其右側的「**+**」按鈕。以 ``move_left`` 為例，按左方向鍵後點擊 **OK**。

source: Let's now add support for a gamepad's left joystick. Click the "**+**" button again but this time, select the input within the input tree yourself. Select the negative X axis of the left joystick under **Joypad Axes**.
fr: Ajoutons maintenant le support du joystick gauche d'une manette. Cliquez encore sur le bouton "**+**", mais cette fois, sélectionnez l'entrée dans l'arbre des entrées vous-même. Sélectionnez l'axe X négatif du joystick gauche dans **Axes de joystick**.
ru: Теперь добавим поддержку левого джойстика геймпада. Нажмите кнопку "**+**" ещё раз, но на этот раз выберите вход самостоятельно в дереве входов. Выберите отрицательную ось X левого джойстика в разделе **Joypad Axes**.
uk: Давайте тепер додамо підтримку лівого джойстика геймпада. Знову натисніть кнопку "**+**", але цього разу виберіть вхідні дані в дереві вхідних даних самостійно. Виберіть негативну вісь X лівого джойстика в розділі **Осі джойстика**.
zh_tw: 接著加入手把左搖桿的支援。再次點擊「**+**」，這次請在輸入樹中自行選擇，於 **Joypad Axes** 底下選擇左搖桿的負 X 軸。

source: Leave the other values as default and press **OK**.
fr: Laissez les autres valeurs par défaut et appuyez sur **OK**.
ru: Остальные значения оставьте как есть и нажмите **OK**.
uk: Залиште інші значення за замовчуванням і натисніть **ОК**.
zh_cn: 其他值保持默认，点击\ **确定**\ 。
zh_tw: 其餘值維持預設，按 **OK**。

source: The final action to set up is the ``jump`` action. Bind the Space key and the gamepad's A button located under **Joypad Buttons**.
fr: La dernière action à mettre en place est l'action ``jump``. Associez la touche Espace et le bouton A de la manette situé sous **Boutons de joystick**.
ru: Последнее действие, которое нужно настроить — ``jump``. Назначьте клавишу «Пробел» и кнопку A геймпада, расположенную в разделе **Joypad Buttons**.
uk: Остання дія для налаштування - це ``jump`` дія. Прив’яжіть клавішу пробілу до кнопки A геймпада, розташованої під **Кнопками джойстика**.
zh_tw: 最後設定 ``jump`` 動作。請綁定空白鍵與 **Joypad Buttons** 下的手把 A 鈕。

source: The ``.glb`` files contain 3D scene data based on the open source GLTF 2.0 specification. They're a modern and powerful alternative to a proprietary format like FBX, which Godot also supports. To produce these files, we designed the model in `Blender 3D <https://www.blender.org/>`__ and exported it to GLTF.
pl: Pliki ``.glb`` zawierają dane sceny 3D oparte na specyfikacji open source GLTF 2.0. Są one nowoczesną, pełną możliwości alternatywą dla zastrzeżonego formatu, takiego jak FBX, który Godot również obsługuje. Aby stworzyć te pliki, zaprojektowaliśmy model w `Blender 3D <https://www.blender.org/>`__ i wyeksportowaliśmy go do GLTF.

source: Translation status
pl: Status tłumaczenia
