Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/02.player_input.po
Languages: de, es, fr, ga, it, ko, pl, ru, ta, tr, uk, zh_cn, zh_tw

source: Player scene and input actions
de: Spielerszene und Eingabeaktionen
es: Escena del jugador y acciones de entrada
fr: Scène Player et actions d'entrée
ga: Radharc an imreora agus gníomhartha ionchuir
it: Scena del giocatore e azioni di input
pl: Scena gracza i akcje wejścia
ru: Сцена игрока и действия ввода
ta: பிளேயர் காட்சி மற்றும் உள்ளீட்டு செயல்கள்
tr: Oyuncu sahnesi ve girdi eylemleri
uk: Сцена гравця та дій введення
zh_cn: Player 场景与输入事件
zh_tw: Player 場景與輸入事件

source: In the next two lessons, we will design the player scene, register custom input actions, and code player movement. By the end, you'll have a playable character that moves in eight directions.
de: In den nächsten zwei Lektionen werden wir die Spielerszene entwerfen, benutzerdefinierte Eingabe-Aktionen registrieren und die Bewegung des Spielers programmieren. Am Schluss haben Sie einen spielbaren Charakter, der sich in acht Richtungen bewegen kann.
es: En las próximas dos lecciones, diseñaremos la escena del jugador, registraremos acciones de entrada personalizadas y codificaremos el movimiento del jugador. Al final, tendrás un personaje jugable que se mueve en ocho direcciones.
fr: Dans les deux prochaines leçons, nous allons concevoir la scène du joueur, enregistrer des actions d'entrée personnalisées, et coder le mouvement du joueur. À la fin, vous aurez un personnage jouable qui se déplace dans huit directions.
ga: Sa chéad dá cheacht eile, déanfaimid radharc an imreora a dhearadh, gníomhartha ionchuir saincheaptha a chlárú, agus gluaiseacht an imreora cóid. Faoi dheireadh, beidh carachtar spraíúil agat a ghluaiseann in ocht dtreo.
it: Nelle prossime due lezioni, progetteremo la scena del giocatore, registreremo azioni di input personalizzate, e scriveremo il codice per il movimento del giocatore. Alla fine, avrai un personaggio giocabile in grado di muoversi in otto direzioni.
ko: 다음 두 레슨에서는 플레이어 씬을 디자인하고, 커스텀 입력 동작을 등록하고, 플레이어 이동 코드를 작성할 것입니다. 이 과정이 끝나면 여덟 방향으로 움직이는 플레이어 캐릭터가 완성될 것입니다.
pl: W ciągu następnych dwóch lekcji zaprojektujemy scenę gracza, zarejestrujemy swoje własne akcje wejściowe i zakodujemy poruszanie się gracza. Na koniec będziesz mieć postać, którą można grać i porusza się w ośmiu kierunkach.
ru: В двух следующих уроках мы будем создавать сцену игрока, оформлять пользовательские действия ввода и программировать движения игрока. К концу у вас будет персонаж, за которого можно будет играть и двигаться в восьми направлениях.
ta: அடுத்த இரண்டு பாடங்களில், நாங்கள் பிளேயர் காட்சியை வடிவமைப்போம், தனிப்பயன் உள்ளீட்டு செயல்களை பதிவு செய்வோம், மற்றும் குறியீடு பிளேயர் இயக்கம். முடிவில், எட்டு திசைகளில் நகரும் ஒரு விளையாடக்கூடிய தன்மை உங்களிடம் இருக்கும்.
tr: Sonraki iki derste, oyuncu sahnesini tasarlayacak, özel giriş eylemlerini kaydedecek, ve oyuncu hareketini kodlayacağız. Bittiğinde, sekiz yönde hareket eden oynanabilir bir karaktere sahip olacaksınız.
uk: В наступних двох уроках ми спроектуємо сцену гравця, зареєструємо спеціальні дії введення та закодуємо рух гравця. Зрештою, у вас вийде ігровий персонаж, який рухається у восьми напрямках.
zh_cn: 在接下来的两节课程中，我们将会设计玩家场景、注册自定义输入动作、编写玩家移动代码。在最后，你将会得到一个可以八方向移动的可游玩角色。
zh_tw: 在接下來的兩節課程中，我們將會設計玩家場景、註冊自訂輸入動作、編寫玩家移動程式碼。在最後，你將會得到一個可以八方向移動的可遊玩角色。

source: Create a new scene by going to the Scene menu in the top-left and clicking *New Scene*.
ga: Cruthaigh radharc nua trí dhul chuig an roghchlár Scene sa bharr ar chlé agus cliceáil ar *New Scene *.
ko: 상단 왼쪽의 Scene 메뉴로 이동하여 *New Scene*을 클릭하여 새 씬을 만듭니다.
pl: Utwórz nową scenę, przechodząc do menu Scena w lewym górnym rogu i klikając *Nowa scena*.
ta: மேல் இடதுபுறத்தில் காட்சி மெனுவுக்குச் சென்று *புதிய காட்சியைக் சொடுக்கு செய்வதன் மூலம் ஒரு புதிய காட்சியை உருவாக்கவும்.

source: |image0|
ga: |íomhá0|
ta: | படம் 0 |

source: image0
ga: íomhá0
ta: படம் 0

source: Create a :ref:`CharacterBody3D <class_CharacterBody3D>` node as the root
ga: Cruthaigh nód :ref:`CharacterBody3D <class_CharacterBody3D>` mar an fhréamh
ko: 루트 노드로 :ref:`CharacterBody3D <class_CharacterBody3D>` 노드를 생성합니다
pl: Utwórz węzeł :ref:`CharacterBody3D <class_CharacterBody3D>` ustawiając go jako węzeł główny (węzeł korzenia kompozycji - root)
ta: ஒரு: ref: `reatolbody3d <class_characterbody3d>` கணு வேராக முனையாக

source: Name the :ref:`CharacterBody3D <class_CharacterBody3D>` to ``Player``. Character bodies are complementary to the area and rigid bodies used in the 2D game tutorial. Like rigid bodies, they can move and collide with the environment, but instead of being controlled by the physics engine, **you** dictate their movement. You will see how we use the node's unique features when we code the jump and squash mechanics.
ga: Ainmnigh an :tag:`CharacterBody3D <class_CharacterBody3D>` go ``Player``. Comhlánaíonn na comhlachtaí carachtair an limistéar agus na comhlachtaí dochta a úsáidtear sa rang teagaisc cluiche 2D. Cosúil le coirp dochta, is féidir leo gluaiseacht agus imbhualadh leis an gcomhshaol, ach in ionad a bheith faoi rialú ag inneall na fisice, ** tusa** a ordaíonn a ngluaiseacht. Feicfidh tú conas a úsáidimid gnéithe uathúla an nód nuair a chódaimid an mheicnic léim agus scuaise.
ko: :ref:`CharacterBody3D <class_CharacterBody3D>`의 이름을 ``Player``로 지정합니다. 캐릭터 바디는 2D 게임 튜토리얼에서 사용된 영역 및 리지드 바디와 상호 보완적입니다. 리지드 바디처럼 움직이고 환경과 충돌할 수 있지만, 물리 엔진이 아닌 **사용자**가 그 움직임을 제어합니다. 점프와 스쿼시 메커니즘을 코딩할 때 이 노드의 독특한 기능을 어떻게 사용하는지 보게 될 것입니다.
pl: Nazwij węzeł :ref:`CharacterBody3D <class_CharacterBody3D>` ``Gracz``. Obiekty typu ciało-postaci (character body) są uzupełnieniem planszy i sztywnych brył (rigid bodies) używanych w samouczku gry 2D. Podobnie jak sztywne bryły, mogą się poruszać i zderzać z otoczeniem, ale zamiast być kontrolowane przez silnik fizyczny, **ty** decydujesz o ich ruchu. Zrozumiesz, jak wykorzystujemy unikalne funkcje węzła, kodując mechanikę skoków i zgniatania.
ta: பெயரிடுங்கள்: ref: `reatorbody3d <class_charactobody3d>` பெறுநர் `` பிளேயர்``. 2 டி கேம் டுடோரியலில் பயன்படுத்தப்படும் பகுதி மற்றும் கடுமையான உடல்களுக்கு எழுத்து உடல்கள் பூர்த்திசெய்கின்றன. கடுமையான உடல்களைப் போலவே, அவை சுற்றுச்சூழலுடன் நகர்ந்து மோதலாம், ஆனால் இயற்பியல் இயந்திரத்தால் கட்டுப்படுத்தப்படுவதற்குப் பதிலாக, ** நீங்கள் ** அவர்களின் இயக்கத்தை ஆணையிடுகிறீர்கள். சம்ப் மற்றும் ச்குவாச் இயக்கவியலை நாங்கள் குறியிடும்போது முனையின் தனித்துவமான அம்சங்களை நாங்கள் எவ்வாறு பயன்படுத்துகிறோம் என்பதை நீங்கள் காண்பீர்கள்.

source: To learn more about the different physics node types, see the :ref:`doc_physics_introduction`.
de: Um mehr über die verschiedenen Arten von Physik-Nodes zu erfahren, lesen Sie die :ref:`doc_physics_introduction`.
es: Para obtener más información sobre los diferentes tipos de nodos de física, consulta :ref:`doc_physics_introduction`.
fr: Pour en savoir plus sur les différents types de nœuds de physique, consultez la :ref:`doc_physics_introduction`.
ga: Chun níos mó a fhoghlaim faoi na cineálacha éagsúla nód fisice, féach an :ref:'doc_physics_introduction'.
it: Per saperne di più sui differenti tipi di nodi di fisica, vedi :ref:`doc_physics_introduction`.
pl: Aby dowiedzieć się więcej o różnych typach węzłów z fizyką, zobacz :ref:`doc_physics_introduction`.
ru: Этот документ предполагает, что вы знакомы с различными физическими телами Godot. В противном случае сначала прочитайте :ref:`doc_physics_introduction`.
ta: வெவ்வேறு இயற்பியல் முனை வகைகளைப் பற்றி மேலும் அறிய, இதைக் காண்க: குறிப்பு: `doc_physics_introduction`.
tr: Farklı fizik düğümü türleri hakkında daha fazla bilgi edinmek için :ref:`doc_physics_introduction` sayfasına bakınız.
uk: Щоб дізнатися більше про різні типи фізичних вузлів, перегляньте :ref:`doc_physics_introduction`.
zh_cn: 要学习更多关于不同物理节点类型的内容，请参阅 :ref:`doc_physics_introduction`\ 。
zh_tw: 要學習更多關於不同物理節點型別的內容，請參閱 :ref:`doc_physics_introduction`。

source: For now, we're going to create a basic rig for our character's 3D model. This will allow us to rotate the model later via code while it plays an animation.
de: Zunächst werden wir ein grundlegendes Rig für das 3D-Modell unseres Charakters erstellen. Dies ermöglicht es uns, das Modell später per Code zu drehen, während es eine Animation abspielt.
es: Por ahora, vamos a crear un equipo básico para el modelo 3D de nuestro personaje. Esto nos permitirá rotar el modelo más tarde mediante código mientras reproduce una animación.
fr: Pour l'instant, nous allons créer un rig basique pour le modèle 3D de notre personnage. Ça nous permettra de faire pivoter le modèle plus tard depuis le code pendant qu'il joue une animation.
ga: Chun anois, táimid chun rig bhunúsach a chruthú do mhúnla 3D ár gcarachtar. Cuirfidh sé seo ar ár gcumas an tsamhail a rothlú níos déanaí trí chód agus beochan á sheinm aige.
it: Per ora, andiamo a creare un rig base per il modello del nostro personaggio 3D. Successivamente, ciò ci consentirà di ruotare il modello tramite codice mentre riprodurrà un'animazione.
ko: 지금은 캐릭터의 3D 모델을 위한 기본 리그를 만들겠습니다. 이렇게 하면 애니메이션을 재생하는 동안 코드를 통해 모델을 회전시킬 수 있습니다.
pl: Na razie stworzymy podstawowy zestaw dla naszej postaci 3D. Umożliwi nam to późniejsze obrócenie modelu za pomocą kodu podczas odtwarzania animacji.
ru: Для начала мы собираемся создать базовый каркас для 3D-модели нашего персонажа. Позже это позволит нам вращать модель через код, пока он проигрывает анимацию.
ta: இப்போதைக்கு, உங்கள் எழுத்து 3D மாடலுக்கான அடிப்படை உரிமையை நாங்கள் உருவாக்கப் போகிறோம். இது அனிமேசனை இயக்கும் போது மாதிரியை பின்னர் குறியீடு வழியாக சுழற்ற அனுமதிக்கும்.
tr: Şimdilik, karakterimizin 3B modeli için temel bir donanım oluşturacağız. Bu, daha sonra bir canlandırma oynatırken, modeli kod aracılığıyla döndürmemize olanak tanıyacak.
uk: На даний момент ми збираємося створити базовий конструкт (риг) для 3D-моделі нашого персонажа. Він дозволить нам обертати модель пізніше за допомогою коду, поки вона відтворює анімацію.
zh_cn: 现在，我们将为角色的 3D 模型创建一个基本的装备。稍后我们将在播放动画时通过代码旋转模型。
zh_tw: 現在，我們將為角色的 3D 模型建立一個基本的裝備。稍後我們將在播放動畫時通過程式碼旋轉模型。

source: Add a :ref:`Node3D <class_Node3D>` node as a child of ``Player`` and name it ``Pivot``
ga: Cuir leis :ref:`Node3D <class_Node3D>` nód mar leanbh de ``Player`` agus ainmnigh ``Pivot`` air
ko: ``Player`` 의 자식 노드로 :ref:`Node3D <class_Node3D>` 노드를 추가하고 이름을 ``Pivot`` 으로 지정합니다
pl: Dodaj węzeł :ref:`Node3D <class_Node3D>` jako element podrzędny ``Player`` i nazwij go ``Pivot``
ta: A: ref: `node3d <class_node3d>` `` பிளேயர்`` குழந்தையாக முனை மற்றும் அதற்கு `` பிவோட்``

source: Then, in the FileSystem dock, expand the ``art/`` folder by double-clicking it and drag and drop ``player.glb`` onto ``Pivot``.
de: Erweitern Sie dann im Dateisystem-Dock den Ordner ``art/`` durch einen Doppelklick und ziehen Sie ``player.glb`` per Drag&Drop auf ``Pivot``.
es: Luego, en el panel Sistema de Archivos, expande la carpeta ``art/`` haciendo doble clic en ella y arrastrando y soltando ``player.glb`` sobre ``Pivot``.
fr: Ensuite, dans le dock Système de fichiers, développez le dossier ``art/`` en double-cliquant dessus et faites glisser et déposez ``player.glb`` sur ``Pivot``.
ga: Ansin, sa duga FileSystem, leathnaigh an fillteán ''art/'' trí chliceáil faoi dhó air agus tarraing agus scaoil ''player.glb'' ar ''Pivot''.
it: Successivamente, nel pannello del FileSystem, espandi la cartella ``art/`` facendo doppio-clic, poi trascina e rilascia il ``player.glb`` su ``Pivot``.
ko: 그런 다음, FileSystem 도크에서 ``art/`` 폴더를 더블 클릭하여 확장하고 ``player.glb`` 파일을 ``Pivot`` 위로 드래그 앤 드롭합니다.
pl: Następnie w doku FileSystem rozwiń folder ``art/``, klikając go dwukrotnie, a następnie przeciągnij i upuść ``player.glb`` na ``Pivot``.
ru: Затем в панели Файловая система разверните папку ``art/``, дважды щелкнув по ней, и перетащите ``player.glb`` на ``Pivot``.
ta: பின்னர், கோப்பு முறைமை கப்பல்துறையில், `` கலை/`கோப்புறையை இருமுறை சொடுக்கு செய்வதன் மூலம் விரிவுபடுத்தி,` `player.glb`` ஐ` `பிவோட்`` இல் இழுத்து விடுங்கள்.
tr: Ardından, DosyaSistemi yuvasında ``art/`` klasörünü çift tıklayarak genişletin ve ``player.glb`` dosyasını ``Pivot`` üzerine sürükleyip bırakın.
uk: Потім у доку FileSystem розгорніть папку ``art/``, двічі клацнувши її, і перетягніть ``player.glb`` на ``Pivot``.
zh_cn: 然后在文件系统面板中，双击展开 ``art/`` 文件夹，将 ``player.glb`` 拖放到 ``Pivot`` 节点上。
zh_tw: 然後在檔案系統面板中，按兩下展開 ``art/`` 資料夾，將 ``player.glb`` 拖放到 ``Pivot`` 節點上。

source: |image1|
ga: |íomhá1|
ta: | படம் 1 |

source: image1
ga: íomhá 1
ta: படம் 1

source: This should instantiate the model as a child of ``Pivot``. You can rename it to ``Character``.
de: Dies sollte das Modell als ein Child von ``Pivot`` instanziieren. Sie können es in ``Character`` umbenennen.
es: Esto debería crear una instancia del modelo como hijo de ``Pivot``. Puedes cambiarle el nombre a ``Character``.
fr: Cela devrait instancier le modèle comme enfant de ``Pivot``. Vous pouvez le renommer en ``Character``.
ga: Ba chóir go gcuirfeadh sé seo an tsamhail ar an toirt mar leanbh de ''Pivot''. Is féidir é a athainmniú go ''Carachtar''.
it: Ciò dovrebbe istanziare il modello come figlio di ``Pivot``. Puoi rinominarlo in ``Character``.
ko: 이렇게 하면 모델이 ``Pivot`` 의 자식으로 인스턴스화됩니다. 이름을 ``Character`` 로 변경할 수 있습니다.
pl: To powinno utworzyć instancję modelu będącego dzieckiem ``Pivot``. Możesz zmienić jego nazwę na ``Character``.
ru: Это должно инстанцировать модель в качестве дочерней модели ``Pivot``. Вам нужно переименовать его в ``Character``.
ta: இது `` பிவோட்`` குழந்தையாக மாதிரியை உடனடிப்படுத்த வேண்டும். நீங்கள் அதை `` எழுத்து`` என்று மறுபெயரிடலாம்.
tr: Bu, modeli ``Pivot`` ögesinin bir alt ögesi olarak örneklemelidir. Bunu ``Character`` olarak yeniden adlandırabilirsiniz.
uk: Це має створити екземпляр моделі як дочірнього елемента ``Pivot``. Ви можете перейменувати його на ``Character``.
zh_cn: 这样应该就会把这个模型实例化为 ``Pivot`` 的子项。你可以将其重命名为 ``Character``\ 。
zh_tw: 這樣應該就會把這個模型產生實體為 ``Pivot`` 的子項。你可以將其重命名為 ``Character`` 。

source: |image2|
ga: |íomhá2|
ta: | படம் 2 |

source: image2
ga: íomhá 2
ta: படம் 2

source: As with all kinds of physics nodes, we need a collision shape for our character to collide with the environment. Select the ``Player`` node again and add a child node :ref:`CollisionShape3D <class_CollisionShape3D>`. In the *Inspector*, on the *Shape* property, add a new :ref:`SphereShape3D <class_SphereShape3D>`.
ga: Cosúil le gach cineál nóid fisice, ní mór dúinn cruth imbhuailte chun ár gcarachtar imbhualadh leis an gcomhshaol. Roghnaigh an nód ``Player`` arís agus cuir nód linbh leis :ref:`CollisionShape3D <class_CollisionShape3D>`. Sa *Cigire*, ar an airí *Cruth*, cuir :ref:`SphereShape3D <class_SphereShape3D>> nua leis.
ko: 모든 종류의 물리 노드와 마찬가지로, 캐릭터가 환경과 충돌할 수 있도록 충돌 모양이 필요합니다. 다시 ``Player`` 노드를 선택하고 자식 노드로 :ref:`CollisionShape3D <class_CollisionShape3D>`를 추가합니다. *Inspector*에서 *Shape* 속성에 새로운 :ref:`SphereShape3D <class_SphereShape3D>`를 추가합니다.
pl: Podobnie jak w przypadku wszystkich rodzajów węzłów fizyki, potrzebujemy kształtu kolizji, aby nasza postać mogła zderzać się z otoczeniem. Wybierz ponownie węzeł ``Player`` i dodaj węzeł potomny :ref:`CollisionShape3D <class_CollisionShape3D>`. W *Inspektorze*, we właściwości *Shape* (kształt), dodaj nowy węzeł typu :ref:`SphereShape3D <class_SphereShape3D>`.
ta: எல்லா வகையான இயற்பியல் முனைகளையும் போலவே, எங்கள் கதாபாத்திரமும் சூழலுடன் மோதுவதற்கு மோதல் வடிவம் தேவை. மீண்டும் `` பிளேயர்`` முனையைத் தேர்ந்தெடுத்து குழந்தை முனையைச் சேர்க்கவும்: குறிப்பு: `collisionshape3d <class_collisshape3d>`. *இன்ச்பெக்டர் *இல், *வடிவம் *சொத்தில், புதியதைச் சேர்க்கவும்: குறிப்பு: `SperheShape3d <class_sphereshape3d>`.

source: The sphere's wireframe appears below the character.
de: Das Drahtgitter der Kugel erscheint unter dem Charakter.
es: La wireframe de la esfera aparecerá debajo del personaje.
fr: L'armature filaire de la sphère apparaît sous le caractère.
ga: Tá sreangfhráma an sféir le feiceáil faoi bhun an charachtair.
it: Il wireframe della sfera appare sotto il personaggio.
ko: 구의 와이어프레임이 캐릭터 아래에 나타납니다.
pl: Siatka sfery pojawia się pod postacią.
ru: Каркас сферы отображается под персонажем.
ta: கோளத்தின் வயர்ஃப்ரேம் கதாபாத்திரத்திற்கு கீழே தோன்றும்.
tr: Kürenin tel çerçevesi karakterin altında görünür.
uk: Сітка сфери зʼявляється під персонажем.
zh_cn: 球体的线框出现在角色的下面。
zh_tw: 球體的線框出現在角色的下面。

source: |image3|
ga: |íomhá3|
ta: | படம் 3

source: image3
ga: íomhá 3
ta: படம் 3

source: It will be the shape the physics engine uses to collide with the environment, so we want it to better fit the 3D model. Make it a bit larger by dragging the orange dot in the viewport. My sphere has a radius of about ``0.8`` meters.
de: Dies wird die Shape, die von der Physik-Engine verwendet wird, um mit der Umgebung zu kollidieren, also wollen wir, dass sie besser zum 3D-Modell passt. Vergrößern Sie sie ein wenig, indem Sie den orangen Punkt im Viewport ziehen. Meine Kugel hat einen Radius von etwa ``0.8`` Metern.
es: Será la forma que use el motor de física para colisionar con el entorno, por lo que queremos que se ajuste mejor al modelo 3D. Redúzcalo un poco arrastrando el punto naranja en la ventana gráfica. Mi esfera tiene un radio de unos ``0,8`` metros.
fr: Ce sera la forme que le moteur physique utilisera pour entrer en collision avec l'environnement, nous voulons donc qu'elle s'adapte mieux au modèle 3D. Agrandissez-la un peu en faisant glisser le point orange dans la fenêtre d'affichage. Ma sphère a un rayon d'environ ``0,8`` mètre.
ga: Beidh sé an cruth a úsáideann an t-inneall fisice chun collide leis an gcomhshaol, mar sin ba mhaith linn é a d'oirfeadh níos fearr ar an tsamhail 3D. Déan beagán níos mó é tríd an ponc oráiste a tharraingt sa radharc. Tá ga de thart ar ''0.8'' méadar ag mo sféar.
ko: 이 구는 물리 엔진이 환경과 충돌하는 데 사용하는 모양이므로, 3D 모델에 더 잘 맞도록 조정할 필요가 있습니다. 뷰포트에서 주황색 점을 드래그하여 조금 더 크게 만듭니다. 제 구는 반경이 약 ``0.8`` 미터입니다.
ru: Это будет форма, которую использует физический движок, для расчета столкновений с окружением, поэтому мы хотим, чтобы она лучше походила именно для 3D-модели. Увеличьте её, перетащив оранжевую кнопку в окне просмотра. Моя сфера имеет радиус около ``0.8`` метра.
ta: சுற்றுச்சூழலுடன் மோதுவதற்கு இயற்பியல் இயந்திரம் பயன்படுத்தும் வடிவமாக இது இருக்கும், எனவே இது 3D மாடலுக்கு ஏற்றதாக இருக்க வேண்டும் என்று நாங்கள் விரும்புகிறோம். காட்சியமைப்பில் ஆரஞ்சு புள்ளியை இழுப்பதன் மூலம் அதை சற்று பெரிதாக்கவும். எனது கோளத்தில் சுமார் `` 0.8`` மீட்டர் ஆரம் உள்ளது.
tr: Bu, fizik motorunun çevreyle çarpışmak için kullandığı şekil olacaktır, bu nedenle 3B modele iyi uyumlu olmasını istiyoruz. Çerçeve içerisindeki turuncu noktayı sürükleyerek biraz daha büyük hale getirin. Benim küremin yarıçapı yaklaşık ``0,8`` metredir.
uk: Це буде форма, яку використовує фізичний механізм для зіткнення з навколишнім середовищем, тому ми хочемо, щоб вона краще відповідала 3D-моделі. Зробіть його трохи більшим, перетягнувши помаранчеву крапку у вікні перегляду. Моя сфера має радіус приблизно ``0,8`` метрів.
zh_cn: 它将是物理引擎用来与环境碰撞的形状，因此我们希望它更适合 3D 模型。拖动视口中的橙色点，将其缩小一点。我的球体半径约为 ``0.8`` 米。
zh_tw: 這將會是物理引擎用來與環境碰撞的形狀，所以我們希望它能更貼合 3D 模型。在視埠中拖曳橘色圓點，將它稍微放大一點。我的球體的半徑大約是 ``0.8`` 公尺。

source: Then, move the collision shape up so its bottom roughly aligns with the grid's plane.
de: Verschieben Sie die Kollisions-Shape dann nach oben, so dass ihre Unterseite ungefähr auf der Ebene des Gitters liegt.
es: Luego, mueva la forma hacia arriba para que su parte inferior se alinee aproximadamente con el plano de la cuadrícula.
fr: Ensuite, déplacez la forme de collision vers le haut afin que son bas s'aligne à peu près avec le plan de la grille.
ga: Ansin, bog cruth an imbhuailte suas ionas go mbeidh a bhun ag teacht go garbh le plána na greille.
ko: 그런 다음, 충돌 모양을 위로 이동하여 바닥이 격자 평면과 대략적으로 맞추도록 합니다.
ru: После этого передвиньте форму столкновений вверх так, чтобы её низ приблизительно совпадал с плоскостью сетки.
ta: பின்னர், மோதல் வடிவத்தை நகர்த்தவும், அதன் அடிப்பகுதி கட்டத்தின் விமானத்துடன் இணைகிறது.
tr: Ardından, çarpışma şeklini yukarı taşıyarak alt kısmının kabaca ızgara düzlemiyle hizalanmasını sağlayın.
uk: Потім перемістіть форму зіткнення вгору, щоб її низ приблизно вирівнявся з площиною сітки.
zh_cn: 然后，向上移动碰撞体，使其底部与网格平面大致对齐。
zh_tw: 然後，將碰撞形狀向上移動，使其底部大致對齊格線平面。

source: |image4|
ga: |íomhá4|
ta: | படம் 4 |

source: image4
ga: íomhá 4
ta: படம் 4

source: To make moving the shape easier, you can toggle the model's visibility by clicking the eye icon next to the ``Character`` or the ``Pivot`` nodes.
ga: Chun an cruth a bhogadh níos éasca, is féidir leat infheictheacht na samhla a scoránú trí chliceáil ar dheilbhín na súl in aice leis na nóid ''Carachtar'' nó na nóid ''Pivot''.
ko: 모양을 이동하기 쉽게 만들기 위해, ``Character`` 또는 ``Pivot`` 노드 옆의 눈 아이콘을 클릭하여 모델의 가시성을 전환할 수 있습니다.
ta: வடிவத்தை எளிதாக்குவதற்கு, `` எழுத்து`` அல்லது `` பிவோட்`` முனைகளுக்கு அடுத்த கண் ஐகானைக் சொடுக்கு செய்வதன் மூலம் மாதிரியின் தெரிவுநிலையை நீங்கள் மாற்றலாம்.

source: |image5|
ga: |íomhá5|
ta: | படம் 5 |

source: image5
ga: íomhá5
ta: படம் 5

source: Save the scene as ``player.tscn``
ga: Sábháil an radharc mar ''player.tscn''
pl: Zapisz scenę jako ``player.tscn``
ta: காட்சியை `` player.tscn`` என சேமிக்கவும்

source: With the nodes ready, we can almost get coding. But first, we need to define some input actions.
de: Jetzt wo die Nodes bereit sind, können wir fast mit dem Programmieren anfangen. Aber zuerst sollten wir ein paar Eingabe-Aktionen definieren.
es: Con los nodos listos, casi podemos comenzar a codificar. Pero primero, necesitamos definir algunas acciones de entrada.
fr: Les nœuds étant prêts, nous pouvons presque commencer à coder. Mais d'abord, nous devons définir quelques actions d'entrée.
ga: Leis na nóid réidh, is féidir linn códú a fháil beagnach. Ach ar dtús, ní mór dúinn roinnt gníomhartha ionchuir a shainiú.
it: Con i nodi pronti, possiamo quasi iniziare a programmare. Ma prima, dobbiamo definire delle azioni di input.
ko: 노드가 준비되었으므로 거의 코딩을 시작할 수 있습니다. 하지만 먼저 몇 가지 입력 동작을 정의해야 합니다.
pl: Mając gotowe węzły, możemy już prawie rozpocząć kodowanie. Ale najpierw musimy zdefiniować kilka akcji wejściowych.
ru: С готовыми узлами мы почти можем перейти к программированию. Но для начала нам необходимо определить некоторые действия ввода.
ta: முனைகள் தயாராக இருப்பதால், நாம் கிட்டத்தட்ட குறியீட்டைப் பெறலாம். ஆனால் முதலில், சில உள்ளீட்டு செயல்களை நாம் வரையறுக்க வேண்டும்.
tr: Düğümler hazır olduğuna göre, neredeyse yazılıma geçebiliriz. Ama önce birkaç girdi eylemi tanımlamamız gerek.
uk: Підготувавши вузли ми можемо переходити до кодування. Але спочатку необхідно визначити деякі дії введення.
zh_cn: 节点准备就绪后，我们开始编写程序。但首先，我们需要定义一些输入动作。
zh_tw: 節點準備就緒後，我們開始編寫程式。但首先，我們需要定義一些輸入動作。

source: Creating input actions
de: Eingabeaktionen erstellen
es: Creando acciones de entrada
fr: Création d'actions d'entrée
ga: Gníomhartha ionchuir a chruthú
it: Creazione di azioni di input
pl: Tworzenie akcji wejściowych
ru: Создание действий ввода
ta: உள்ளீட்டு செயல்களை உருவாக்குதல்
tr: Girdi eylemlerini oluşturmak
uk: Створення дій введення
zh_cn: 创建输入动作
zh_tw: 建立圖示
