Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/04.mob_scene.po
Languages: ga, it, ja, ko, ta, tr

source: Attach a script to the ``Mob``.
ga: Ceangail script leis an ``Mob``.
it: Aggiungi uno script al ``Mob``.
ja: ``Mob`` ノードにスクリプトを追加します。
ta: `` கும்பல்`` உடன் ஒரு ச்கிரிப்டை இணைக்கவும்.
tr: ``Mob`` 'a bir betik dosyası ekleyin.

source: |image7|
ga: |íomhá7|
ta: | படம் 7 |

source: image7
ga: íomhá 7
ta: படம் 7

source: Here's the movement code to start with. We define two properties, ``min_speed`` and ``max_speed``, to define a random speed range, which we will later use to define ``CharacterBody3D.velocity``.
ga: Seo an cód gluaiseachta le tús a chur leis. Sainmhínímid dhá airíon, ``min_speed`` agus ``max_speed``, chun raon luais randamach a shainiú, a úsáidfimid níos déanaí chun ``CharacterBody3D.Velocity`` a shainiú.
it: Ecco il codice di movimento da cui cominciare. Definiamo due proprietà, ``min_speed`` e ``max_speed``, per definire un intervallo di velocità casuale, che useremo in seguito per definire ``CharacterBody3D.velocity``.
ja: これが最初の動きのコードです。 ``min_speed`` と ``max_speed`` の２つのプロパティを定義し、ランダムな速度範囲を定義します。これは後で ``CharacterBody3D.velocity`` で使います。
ko: 먼저 시작할 이동 코드는 다음과 같습니다. ``min_speed`` 와 ``max_speed`` 라는 두 프로퍼티를 정의하여 임의의 속도 범위를 정의하고, 나중에 ``CharacterBody3D.velocity`` 를 정의하는 데 사용할 것입니다.
ta: தொடங்க வேண்டிய இயக்கக் குறியீடு இங்கே. சீரற்ற வேக வரம்பை வரையறுக்க `` Min_speed`` மற்றும் `` Max_speed`` ஆகிய இரண்டு பண்புகளை நாங்கள் வரையறுக்கிறோம், இது பின்னர் `` `` charactobody3d.velocity`` ஐ வரையறுக்கப் பயன்படுத்துவோம்.
tr: İşte başlangıç için hareket kodu. Rastgele bir hız aralığı tanımlamak için ``min_speed`` ve ``max_speed`` olmak üzere iki özellik (en az ve en yüksek hız) tanımlayıp, bunları daha sonra ``CharacterBody3D.velocity`` tanımlamak için kullanacağız.

source: Similarly to the player, we move the mob every frame by calling the function ``CharacterBody3D.move_and_slide()``. This time, we don't update the ``velocity`` every frame; we want the monster to move at a constant speed and leave the screen, even if it were to hit an obstacle.
ga: Mar an gcéanna leis an imreoir, bogaimid an mob gach fráma tríd an bhfeidhm a ghlaoch ar an bhfeidhm ``CharacterBody3D.move_and_slide () ``. An uair seo, ní dhéanaimid an “luas” a nuashonrú gach fráma; ba mhaith linn go mbeadh an ollphéist bogadh ar luas leanúnach agus an scáileán a fhágáil, fiú dá mbeadh sé ag buailt constaic.
it: In modo simile al giocatore, muoviamo il mob a ogni frame chiamando la funzione ``CharacterBody3D.move_and_slide()``. Questa volta, non aggiorniamo ``velocity`` a ogni frame; vogliamo che il mostro si muova a velocità costante e lasci lo schermo, anche se dovesse urtare un ostacolo.
ja: プレイヤーと同様に、 ``CharacterBody3D.move_and_slide()`` 関数を呼び出してモブを毎フレーム動かします。このとき、 ``velocity`` は毎フレーム更新しません。たとえ障害物に当たったとしても、モンスターが画面外に出るまで等速で動かすのです。
ko: 플레이어와 마찬가지로 ``CharacterBody3D.move_and_slide()`` 함수를 호출하여 몹을 매 프레임마다 이동시킵니다. 이번에는 매 프레임마다 ``velocity``를 업데이트하지 않고, 몬스터가 장애물에 부딪히더라도 일정한 속도로 움직이며 화면을 벗어나도록 합니다.
ta: பிளேயரைப் போலவே, `` `` charactobody3d.move_and_slide () `` என்ற செயல்பாட்டை அழைப்பதன் மூலம் ஒவ்வொரு சட்டத்தையும் கும்பலை நகர்த்துகிறோம். இந்த நேரத்தில், ஒவ்வொரு சட்டத்தையும் `` வேகம்` `புதுப்பிக்க மாட்டோம்; அரக்கன் ஒரு நிலையான வேகத்தில் நகர்ந்து திரையை விட்டு வெளியேற வேண்டும் என்று நாங்கள் விரும்புகிறோம், அது ஒரு தடையாக இருந்தாலும் கூட.
tr: Oyuncuya benzer şekilde, canavarı her karede ``CharacterBody3D.move_and_slide()`` fonksiyonunu çağırarak hareket ettiriyoruz. Ama bu sefer ``velocity`` değerini her karede güncellemiyoruz; bir engele çarpsa bile canavarın sabit bir hızda hareket etmesini ve sonunda ekrandan ayrılmasını istiyoruz.

source: We need to define another function to calculate the ``CharacterBody3D.velocity``. This function will turn the monster towards the player and randomize both its angle of motion and its velocity.
ga: Ní mór dúinn feidhm eile a shainiú chun an ``CharacterBody3D.Velocity`` a ríomh. Casfaidh an fheidhm seo an ollphéist i dtreo an imreoir agus déanfaidh sé a uillinn gluaiseachta agus a treoluas a randamú.
it: Dobbiamo definire un'altra funzione per calcolare ``CharacterBody3D.velocity``. Questa funzione girerà il mostro verso il giocatore e ne randomizzerà sia il suo angolo di movimento sia la sua velocità.
ja: 他に ``CharacterBody3D.velocity`` を計算する関数を定義する必要があります。この関数はモンスターをプレイヤーの方へ向かせ動きの角度と速度をランダムにします。
ko: ``CharacterBody3D.velocity`` 를 계산하기 위해 다른 함수를 정의해야 합니다. 이 함수는 몬스터가 플레이어를 향해 움직이고 그 각도와 속도를 모두 무작위화합니다.
ta: `` ரியால்போடி 3 டி.லோசிட்டி`` கணக்கிட மற்றொரு செயல்பாட்டை நாம் வரையறுக்க வேண்டும். இந்த செயல்பாடு அசுரனை பிளேயரை நோக்கி மாற்றி அதன் இயக்கத்தின் கோணம் மற்றும் அதன் விரைவு இரண்டையும் சீரற்றதாக மாற்றும்.
tr: ``CharacterBody3D.velocity`` değerini hesaplamak için başka bir fonksiyon tanımlamamız gerekiyor. Bu fonksiyon canavarı oyuncuya doğru çevirecek ve hem hareket açısını hem de hızını rastgele ayarlayacaktır.

source: The function will take a ``start_position``,the mob's spawn position, and the ``player_position`` as its arguments.
ga: Glacfaidh an fheidhm ``start_position``, suíomh an mhóg, agus an `player_position`` mar argóintí.
it: La funzione accetterà come argomenti ``start_position``, la posizione di apparizione del mob, e ``player_position``.
ja: この関数は引数に ``start_position`` （モブの出現位置）と ``player_position`` （プレイヤーの位置）をとります。
ko: 이 함수는 몹의 소환 위치인 ``start_position``\ 과 ``player_position``\ 을 인수로 받습니다.
ta: இந்த செயல்பாடு `` தொடக்க_போசிசன்``, கும்பலின் ச்பான் நிலை மற்றும் `` பிளேயர்_போசிசன்`` ஆகியவற்றை அதன் வாதங்களாக எடுக்கும்.
tr: Fonksiyon girdi değişkenleri olarak düşmanın doğuş konumu, ``start_position``, ve oyuncunun konumunu, ``player_position``, alır.

source: We position the mob at ``start_position`` and turn it towards the player using the ``look_at_from_position()`` method, and randomize the angle by rotating a random amount around the Y axis. Below, ``randf_range()`` outputs a random value between ``-PI / 4`` radians and ``PI / 4`` radians.
ga: Cuirimid an mob i suíomh ag `start_position` agus casaimid é i dtreo an imreoir ag baint úsáide as an modh ``look_at_from_position () `, agus déanaimid an uillinn a randamú trí mhéid randamach a rothlú timpeall ais Y. Anseo thíos, aschuireann ``randf_range () ``luach randamach idir radáin ``-PI/ 4`` agus radians ``PI/ 4``.
it: Posizioniamo il mob in ``start_position`` e lo giriamo verso il giocatore tramite il metodo ``look_at_from_position()``, e rendiamo casuale l'angolo ruotandolo di una quantità casuale attorno all'asse Y. Di seguito, ``randf_range()`` restituisce un valore casuale compreso tra ``-PI / 4`` radianti e ``PI / 4`` radianti.
ja: モブを ``start_position`` に置いて ``look_at_from_position()`` を使いプレイヤーの方に向かせ、Y軸を中心にランダムなだけ回転させて角度をランダムにします。以下の ``randf_range()`` は ``-PI / 4`` から ``PI / 4`` までのランダムな角度を出力します。
ko: 몹을 ``start_position`` 에 배치하고 ``look_at_from_position()`` 메서드를 사용하여 플레이어를 향해 돌리고, Y축을 중심으로 임의의 양을 회전시켜 각도를 랜덤화합니다. 아래 ``randf_range()`` 는 ``-PI / 4`` 라디안과 ``PI / 4`` 라디안 사이의 임의의 값을 출력합니다.
ta: நாங்கள் கும்பலை `` Start_Position`` இல் நிலைநிறுத்துகிறோம், அதை `` look_at_from_position () `` முறையைப் பயன்படுத்தி பிளேயரை நோக்கி திருப்புகிறோம், மேலும் ஒய் அச்சைச் சுற்றி ஒரு சீரற்ற அளவைச் சுழற்றுவதன் மூலம் கோணத்தை சீரற்றவர்களாக இருக்கிறோம். கீழே, `` randf_range () `` `-pi / 4`` ரேடியன்கள் மற்றும்` `பை / 4`` radians க்கு இடையில் ஒரு சீரற்ற மதிப்பை வெளியிடுகிறது.
tr: Düşmanı ``start_position`` konumuna yerleştiriyoruz ve ``look_at_from_position()`` yöntemini kullanarak oyuncuya doğru döndürüyoruz ve Y ekseni etrafında rastgele bir miktar döndürerek açıyı rastgele hale getiriyoruz. Aşağıda, ``randf_range()`` yöntemi ``-PI / 4`` radyan ile ``PI / 4`` radyan arasında rastgele bir değer verir.

source: We got a random position, now we need a ``random_speed``. ``randi_range()`` will be useful as it gives random int values, and we will use ``min_speed`` and ``max_speed``. ``random_speed`` is just an integer, and we just use it to multiply our ``CharacterBody3D.velocity``. After ``random_speed`` is applied, we rotate ``CharacterBody3D.velocity`` Vector3 towards the player.
ga: Fuaireamar suíomh randamach, anois teastaíonn `randam_speed`` uainn. Beidh ``randi_range () ``úsáideach toisc go dtugann sé luachanna randamacha int, agus úsáidfimid ``min_speed`` agus ``max_speed``. Níl ann ``random_speed`` ach sláimhir, agus ní úsáidimid ach é chun ár ``CharacterBody3D.Velocity`` a iolrú. Tar éis ``random_speed`` a chur i bhfeidhm, rothlaímid ``CharacterBody3D.Velocity`` Vector3 i dtreo an imreoir.
it: Abbiamo ottenuto una posizione casuale, ora ci serve ``random_speed``. ``randi_range()`` sarà utile perché restituisce valori interi casuali, e useremo ``min_speed`` e ``max_speed``. ``random_speed`` è solo un numero intero, e lo usiamo solo per moltiplicare ``CharacterBody3D.velocity``. Dopo aver applicato ``random_speed``, ruotiamo il Vector3 ``CharacterBody3D.velocity`` verso il giocatore.
ja: ランダムな場所を得て、次は ``random_speed`` が必要です。 ``randi_range()`` がランダムな整数範囲を得るのに有用で、これに ``min_speed`` と ``max_speed`` を使います。 ``random_speed`` はただの整数で、 ``CharacterBody3D.velocity`` に掛けるだけです。 ``random_speed`` が適用された後、 ``CharacterBody3D.velocity`` Vector3をプレイヤーの方へ回転させます。
ko: 임의의 위치를 얻었으니 이제 ``random_speed`` 가 필요합니다. ``randi_range()`` 는 임의의 정수 값을 제공하므로 유용하며, ``min_speed`` 와 ``max_speed`` 를 사용합니다. ``random_speed`` 는 그냥 정수이며, ``CharacterBody3D.velocity`` 를 곱하는 데 사용합니다. ``random_speed`` 가 적용된 후 ``CharacterBody3D.velocity`` Vector3를 플레이어를 향해 회전시킵니다.
ta: எங்களுக்கு ஒரு சீரற்ற நிலை கிடைத்தது, இப்போது எங்களுக்கு ஒரு `` ரேண்டம்_ச்பீட்`` தேவை. `` randi_range () `` இது சீரற்ற இன்ட் மதிப்புகளைக் கொடுப்பதால் பயனுள்ளதாக இருக்கும், மேலும் நாங்கள் `` min_speed`` மற்றும் `` Max_speed`` ஐப் பயன்படுத்துவோம். `` ரேண்டம்_ச்பீட்`` என்பது ஒரு முழு எண், எங்கள் `` ரியல் பாடி 3 டி. `` ரேண்டம்_ச்பீட்`` பயன்படுத்தப்பட்ட பிறகு, `` `` `` `` `` `` `` `` `vertectice` vecter3 ஐ வீரரை நோக்கி சுழற்றுகிறோம்.
tr: Rastgele bir pozisyonumuz var, şimdi rastgele bir hıza, ``random_speed``, ihtiyacımız var. ``randi_range()`` rastgele tamsayı değerler verdiği için faydalı olacaktır ve biz aralık olarak ``min_speed`` ve ``max_speed`` kullanacağız. ``random_speed`` sadece bir tamsayıdır ve biz bunu ``CharacterBody3D.velocity`` değerimizi çarpmak için kullanıyoruz. ``random_speed`` uygulandıktan sonra, ``CharacterBody3D.velocity`` vektörünü oyuncuya doğru döndürüyoruz.

source: Leaving the screen
ga: An scáileán ag fágáil
it: Lasciare lo schermo
ja: 画面から離れる
ko: 화면 떠나기
ta: திரையை விட்டு
tr: Ekrandan ayrılma

source: We still have to destroy the mobs when they leave the screen. To do so, we'll connect our :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` node's ``screen_exited`` signal to the ``Mob``.
ga: Ní mór dúinn fós na mobs a scrios nuair a fhágann siad an scáileán. Chun é sin a dhéanamh, nascfaimid ár :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` comhartha ``screen_exited`` nód leis an ``Mob``.
it: Dobbiamo ancora distruggere i mob quando escono dallo schermo. Per farlo, connetteremo il segnale ``screen_exited`` del nostro nodo :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` al ``Mob``.
ja: 画面を離れた時にモブを破壊する必要があります。 そのためには、 :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` ノードの ```screen_exited`` シグナルを ``Mob`` に接続します。
ko: 몹이 화면을 떠날 때 파괴해야 합니다. 이를 위해 :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` 노드의 ``screen_exited`` 신호를 ``Mob`` 에 연결합니다.
ta: கும்பல்கள் திரையை விட்டு வெளியேறும்போது நாம் இன்னும் அழிக்க வேண்டும். அவ்வாறு செய்ய, நாங்கள் எங்கள்: ref: `visibleonscreennotifier3d <class_visibleonscreennotifier3d>` முனையின் `` ச்கிரீன்_எக்டிட்`` `` கும்பல்`` சமிக்ஞை.
tr: Düşmanlar ekrandan çıktıklarında onları hala yok etmemiz gerekiyor. Bunu yapmak için, :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` düğümümüzün ``screen_exited`` sinyalini ``Mob`` a bağlayacağız.

source: Head back to the 3D viewport by clicking on the *3D* label at the top of the editor. You can also press :kbd:`Ctrl + F2` (:kbd:`Opt + 2` on macOS).
ga: Téigh ar ais go dtí an radharc 3D trí chliceáil ar an lipéad* 3D* ag barr an eagarthóra. Is féidir leat brú freisin: kbd: `Ctrl + F2` (:kbd: `Opt + 2` ar macOS).
it: Torna sulla viewport 3D cliccando sull'etichetta *3D* nella parte superiore dell'editor. Puoi anche premere :kbd:`Ctrl + F2` (oppure :kbd:`Opt + 2` su macOS) per accedervi.
ja: エディタ上部の\ *3D*\ ラベルをクリックして、3D ビューポートに戻ります。また\ :kbd:`Ctrl + F2`\ (macOSでは\ :kbd:`Opt + 2`\ )を押すこともできます。
ta: எடிட்டரின் மேற்புறத்தில் உள்ள * 3D * லேபிளைக் சொடுக்கு செய்வதன் மூலம் 3D வியூபோர்ட்டுக்குச் செல்லுங்கள். நீங்கள் அழுத்தலாம்: KBD: `CTRL + F2` (: KBD: MACOS இல்` OPT + 2`).
tr: Düzenleyicinin üst kısmındaki *3B* etiketine tıklayarak 3B çerçeveye geri dönün. Ayrıca :kbd:`Ctrl + F2` (macOS'ta :kbd:`Opt + 2`) tuşlarına da basabilirsiniz.

source: |image8|
ga: |íomhá8|
ta: | படம் 8 |

source: image8
ga: íomhá8
ta: படம் 8

source: Select the :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` node and on the right side of the interface, navigate to the *Node* dock. Double-click the ``screen_exited()`` signal.
ga: Roghnaigh an nód :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` agus ar thaobh na láimhe deise den chomhéadan, déan nascleanúint chuig an duga *Node*. Cliceáil faoi dhó ar an comhartha `` screen_exited()``.
it: Seleziona il nodo :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` e, sul lato destro dell'interfaccia, vai al pannello *Nodo*. Fai doppio clic sul segnale ``screen_exited()``.
ja: :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` ノードを選択し、インターフェースの右側で * ノード * ドックを開きます。 ``screen_exited()`` シグナルをダブルクリックしましょう。
ko: :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` 노드를 선택하고 인터페이스의 오른쪽에서 *노드* 독으로 이동합니다. ``screen_exited()`` 시그널을 더블 클릭합니다.
ta: தேர்வு: ref: `visibleonscreennotifier3d <class_visibleonscreennotifier3d>` முனை மற்றும் இடைமுகத்தின் வலது பக்கத்தில், * முனை * கப்பல்துறைக்கு செல்லவும். `` ச்கிரீன்_ எக்சிட் () `` சமிக்ஞையை இருமுறை சொடுக்கு செய்யவும்.
tr: :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` düğümünü seçin ve arayüzün sağ tarafındaki *Düğüm* yuvasına gidin. ``screen_exited()`` sinyaline çift tıklayın.

source: |image9|
ga: |íomhá9|
ta: | படம் 9 |

source: image9
ga: íomhá9

source: Connect the signal to the ``Mob``
ga: Ceangail an comhartha leis an ``Mob``
it: Connetti il segnale al ``Mob``
ja: シグナルを\ ``Mob``\ へ接続します
ko: 시그널을 ``Mob``\ 에 연결합니다
ta: சிக்னலை `` கும்பல்`` உடன் இணைக்கவும்
tr: Sinyali ``Mob`` a bağlayın

source: |image10|
ga: |íomhá10|
ta: | படம் 10 |

source: image10
ga: íomhá10
ta: படம் 10

source: This will add a new function for you in your mob script, ``_on_visible_on_screen_notifier_3d_screen_exited()``. From it, call the ``queue_free()`` method. This function destroys the instance it's called on.
ga: Cuirfidh sé seo feidhm nua duit i do script mob, ``_on_visible_on_screen_notifier_3d_screen_exited () ``. Uaidh, glaoigh ar an modh ``queue_free () ``. Scriosann an fheidhm seo an cás a thugtar air.
it: Questo aggiungerà una nuova funzione al tuo script mob, ``_on_visible_on_screen_notifier_3d_screen_exited()``. Da questa, chiama il metodo ``queue_free()``. Questa funzione distrugge l'istanza su cui viene chiamata.
ja: これでモブスクリプトに ``_on_visible_on_screen_notifier_3d_screen_exited()`` という新しい関数が追加されます。ここから ``queue_free()`` メソッドを呼びます。この関数はこれが呼ばれたインスタンスを破壊します。
ko: 이렇게 하면 몹 스크립트에 ``_on_visible_on_screen_notifier_3d_screen_exited()`` 라는 새 함수가 추가됩니다. 이 함수에서 ``queue_free()`` 메서드를 호출합니다. 이 함수는 호출된 인스턴스를 파괴합니다.
ta: இது உங்கள் கும்பல் ச்கிரிப்டில் உங்களுக்காக ஒரு புதிய செயல்பாட்டைச் சேர்க்கும், `` _ON_VISIBLE_CREEN_NOTIFIER_3D_SCREEN_EXITED () ``. அதிலிருந்து, `` queue_free () `` முறையை அழைக்கவும். இந்த செயல்பாடு அது அழைக்கப்பட்ட உதாரணத்தை அழிக்கிறது.
tr: Bu, düşman betiğine sizin için yeni bir işlev ekleyecektir, ``_on_visible_on_screen_notifier_3d_screen_exited()``. Bunun içinden ``queue_free()`` yöntemini çağırın. Bu fonksiyon çağrıldığı örneklemeyi yok eder.

source: Our monster is ready to enter the game! In the next part, you will spawn monsters in the game level.
ga: Tá ár ollphéist réidh chun dul isteach sa chluiche! Sa chéad chuid eile, déanfaidh tú arrachtaigh a scaoileadh i leibhéal an chluiche.
it: Il nostro mostro è pronto a entrare nel gioco! Nella prossima parte, genererai mostri nel livello di gioco.
ja: 私たちのモンスターがゲームに参加する準備ができました。次のパートでは、ゲームレベルにモンスターを出現させます。
ko: 괴물이 게임에 참가할 준비가 되었습니다! 다음 부분에서는 게임 레벨에 괴물을 소환합니다.
ta: எங்கள் அரக்கன் விளையாட்டில் நுழைய தயாராக உள்ளது! அடுத்த பகுதியில், நீங்கள் விளையாட்டு மட்டத்தில் அரக்கர்களை உருவாக்குவீர்கள்.
tr: Canavarımız oyuna girmeye hazır! Bir sonraki bölümde, oyun seviyesinde canavarlar ortaya çıkaracaksınız.

source: Here is the complete ``mob.gd`` script for reference.
ga: Seo an script iomlán ``mob.gd`` le haghaidh tagartha.
it: Ecco lo script ``mob.gd`` completo come riferimento.
ja: 参考までに、\ ``mob.gd``\ スクリプトの完成版を以下に示します。
ta: குறிப்புக்கான முழுமையான `` mob.gd`` ச்கிரிப்ட் இங்கே.
tr: İşte başvuru için ``mob.gd`` betiğinin tamamı.
