Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/04.mob_scene.po
Languages: ga, it, ja, ko, ta, tr

source: Designing the mob scene
ga: Dearadh an radharc mob
it: Progettando la scena del mob
ja: モブシーンをデザイン
ta: கும்பல் காட்சியை வடிவமைத்தல்
tr: Düşman sahnesinin tasarlanması

source: In this part, you're going to code the monsters, which we'll call mobs. In the next lesson, we'll spawn them randomly around the playable area.
ga: Sa chuid seo, tá tú ag dul chun cód an arrachtaigh, a beidh muid ag glaoch mobs. Sa chéad cheacht eile, sceithfimid iad go randamach timpeall an cheantair spraíúil.
it: In questa parte, programmerai i mostri, che chiameremo mob. Nella prossima lezione, li genereremo casualmente attorno l'area di gioco.
ja: このパートでは、モンスター（ここではモブと呼びます）のコードを作成します。次のレッスンでは、モンスターをプレイエリアのあちこちにランダムに配置します。
ko: 이 파트에서는 몹이라고 부르는 괴물을 코딩해 보겠습니다. 다음 단원에서는 몹을 플레이 가능한 영역에 무작위로 소환하겠습니다.
ta: இந்த பகுதியில், நீங்கள் அரக்கர்களை குறியிடப் போகிறீர்கள், அதை நாங்கள் கும்பல்களை அழைப்போம். அடுத்த பாடத்தில், நாங்கள் அவற்றை தோராயமாக விளையாடக்கூடிய பகுதியைச் சுற்றி வளைப்போம்.
tr: Bu bölümde, düşmanlar olarak adlandıracağımız canavarları kodlayacaksınız. Bir sonraki derste, onları oynanabilir alanın etrafına rastgele yerleştireceğiz.

source: Let's design the monsters themselves in a new scene. The node structure is going to be similar to the ``player.tscn`` scene.
ga: Déanaimis na harrachtaigh féin a dhearadh i radharc nua. Beidh struchtúr na nód cosúil leis an radharc ''player.tscn''.
it: Progettiamo i mostri stessi in una nuova scena. La struttura dei nodi sarà simile a quella della scena ``player.tscn``.
ja: 新しいシーンでモンスター自体を設計しましょう。ノード構造は ``player.tscn`` シーンに似ています。
ko: 새 씬에서 몬스터 자체를 디자인해 봅시다. 노드 구조는 ``player.tscn`` 씬과 비슷할 것입니다.
ta: ஒரு புதிய காட்சியில் அரக்கர்களை வடிவமைப்போம். முனை அமைப்பு `` player.tscn`` காட்சிக்கு ஒத்ததாக இருக்கும்.
tr: Canavarların kendilerini yeni bir sahnede tasarlayalım. Düğüm yapısı ``player.tscn`` sahnesine benzer olacak.

source: Create a scene with, once again, a :ref:`CharacterBody3D <class_CharacterBody3D>` node as its root. Name it ``Mob``. Add a child node :ref:`Node3D <class_Node3D>`, name it ``Pivot``. And drag and drop the file ``mob.glb`` from the *FileSystem* dock onto the ``Pivot`` to add the monster's 3D model to the scene.
ga: Cruthaigh radharc le, arís, nód :ref:`CharacterBody3D <class_CharacterBody3D>` mar a fhréamh. Ainmnigh ``Mob`` é. Cuir nód linbh leis :ref:`Node3D <class_Node3D>`, ainmnigh ``Pivot`` air. Agus tarraing agus scaoil an comhad ``mob.glb`` ón duga *FileSystem* ar an `` Pivot`` chun samhail 3D an ollphéist a chur leis an radharc.
it: Crea una scena con, ancora una volta, un nodo :ref:`CharacterBody3D <class_CharacterBody3D>` come radice. Diamogli il nome ``Mob``. Aggiungi un nodo figlio :ref:`Node3D <class_Node3D>`, con il nome ``Pivot``. Trascina e rilascia il file ``mob.glb`` dal pannello *FileSystem* sul nodo ``Pivot`` per aggiungere il modello 3D del mostro alla scena.
ja: もう一度 :ref:`CharacterBody3D <class_CharacterBody3D>` ノードをルートとしてシーンを作ります。このノードを ``Mob`` と名付けます。次に、その子ノードとして :ref:`Node3D <class_Node3D>` ノードを追加し、 ``Pivot`` と名付けます。そして、 *ファイルシステム* ドックから ``mob.glb`` ファイルを ``Pivot`` にドラッグ＆ドロップすることで、モンスターの3Dモデルがシーンに追加されます。
ko: 다시 한 번 :ref:`CharacterBody3D <class_CharacterBody3D>` 노드를 루트로 하여 씬을 생성합니다. 이름을 ``Mob``\ 으로 지정합니다. 자식 노드인 :ref:`Node3D <class_Node3D>`\ 를 추가하고 이름을 ``Pivot``\ 으로 지정합니다. 그리고 *파일시스템* 독에서 ``mob.glb`` 파일을 ``Pivot``\ 으로 끌어다 놓아 몬스터의 3D 모델을 씬에 추가합니다.
ta: மீண்டும், ஒரு காட்சியை உருவாக்கவும், ஒரு: ref: `reatorbody3d <class_characterbody3d>` முனை அதன் வேராக. அதற்கு `` கும்பல்`` என்று பெயரிடுங்கள். குழந்தை முனையைச் சேர்க்கவும்: குறிப்பு: `node3d <class_node3d>`, அதற்கு `` பிவோட்`` என்று பெயரிடுங்கள். அசுரனின் 3D மாடலை காட்சிக்கு சேர்க்க `` பிவோட்`` க்கு * கோப்பு முறைமை * கப்பலில் இருந்து `` mob.glb`` கோப்பை இழுத்து விடுங்கள்.
tr: Kök olarak yine bir :ref:`CharacterBody3D <class_CharacterBody3D>` düğümü içeren bir sahne oluşturun. Buna ``Mob`` adını verin. Bir :ref:`Node3D <class_Node3D>` alt düğümü ekleyin, adını ``Pivot`` koyun. Ve canavarın 3B modelini sahneye eklemek için *DosyaSistemi* yuvasından ``mob.glb`` dosyasını ``Pivot`` üzerine sürükleyip bırakın.

source: You can rename the newly created ``mob`` node into ``Character``.
ga: Is féidir leat an nód nua-chruthaithe ''mob'' a athainmniú ina ''Carachtar''.
it: Puoi rinominare il nodo ``mob`` appena creato in ``Character``.
ja: 新たに作成された ``mob`` ノードの名前を ``Character`` に変更できます。
ko: 새로 만든 ``mob`` 노드의 이름을 ``Character``\ 로 변경할 수 있습니다.
ta: புதிதாக உருவாக்கப்பட்ட `` கும்பல்`` முனையை `` எழுத்து`` என மறுபெயரிடலாம்.
tr: Yeni oluşturulan ``mob`` düğümünü ``Character`` olarak yeniden adlandırabilirsiniz.

source: |image0|
ga: |íomhá0|
ta: | படம் 0 |

source: image0
ga: íomhá0
ta: படம் 0

source: We need a collision shape for our body to work. Right-click on the ``Mob`` node, the scene's root, and click *Add Child Node*.
ga: Teastaíonn cruth imbhuailte uainn chun go n-oibreoidh ár gcorp. Dliceáil ar dheis ar an nód ``Mob``, fréamh an radhairc, agus cliceáil*Cuir Nód Leanaí*.
it: Abbiamo bisogno di una forma di collisione affinché il nostro corpo funzioni. Fai clic destro sul nodo ``Mob``, la radice della scena, e fai clic su *Aggiungi nodo figlio*.
ja: 体が機能するために衝突形状を追加する必要があります。シーンのルートノード ``Mob`` を右クリックし、 *子ノードを追加* をクリックしてください。
ko: 바디가 동작하려면 콜리전 모양이 필요합니다. 씬의 루트인 ``Mob`` 노드를 마우스 오른쪽 버튼으로 클릭하고 *자식 노드 추가*\ 를 클릭합니다.
ta: நம் உடல் வேலை செய்ய மோதல் வடிவம் தேவை. காட்சியின் வேரில் `` கும்பல்`` முனை மீது வலது சொடுக்கு செய்து, குழந்தை முனையைச் சேர்க்கவும் *என்பதைக் சொடுக்கு செய்க.
tr: Cismimizin çalışması için bir çarpışma şekline ihtiyacımız var. Sahnenin kökü olan ``Mob`` düğümüne sağ tıklayın ve *Alt Öge Düğümü Ekle* seçeneğine tıklayın.

source: |image1|
ga: |íomhá1|
ta: | படம் 1 |

source: image1
ga: íomhá 1
ta: படம் 1

source: Add a :ref:`CollisionShape3D <class_CollisionShape3D>`.
ga: Cuir :ref:`CollisionShape3D <class_CollisionShape3D> leis leis.
it: Aggiungi un :ref:`CollisionShape3D <class_CollisionShape3D>`.
ja: :ref:`CollisionShape3D <class_CollisionShape3D>`\ を追加します。
ko: :ref:`CollisionShape3D <class_CollisionShape3D>`\ 를 추가합니다.
ta: ஒரு சேர்க்கவும்: ref: `collisionshape3d <class_collisshape3d>`.
tr: Bir :ref:`CollisionShape3D <class_CollisionShape3D>` ekleyin.

source: |image2|
ga: |íomhá2|
ta: | படம் 2 |

source: image2
ga: íomhá 2
ta: படம் 2

source: In the *Inspector*, assign a *BoxShape3D* to the *Shape* property.
ga: Sann* Cigireoir*, sannadh *BoxShape3D* don mhaoin *Shape*.
it: Nell'*Ispettore*, assegna una *BoxShape3D* alla proprietà *Shape*.
ja: *Inspector* で、 *Shape* プロパティに *BoxShape3D* を割り当てます。
ko: *인스펙터*\ 에서 *BoxShape3D*\ 를 *모양*\ 속성에 할당합니다.
ta: *இன்ச்பெக்டர் *இல், *வடிவ *சொத்துக்கு *boxshape3d *ஐ ஒதுக்கவும்.
tr: *Denetleyici*'de, *Şekil* özelliğine bir *BoxShape3D* atayın.

source: We should change its size to fit the 3D model better. You can do so interactively by clicking and dragging on the orange dots.
ga: Ba cheart dúinn a mhéid a athrú chun an tsamhail 3D a fheistiú níos fearr. Is féidir leat é sin a dhéanamh go hidirghníomhach trí chliceáil agus tarraingt ar na poncanna oráiste.
it: Dovremmo cambiarne le dimensioni per adattarle meglio al modello 3D. Puoi farlo interattivamente cliccando e trascinando i punti arancioni.
ja: 3 Dモデルによりよく適応するために、そのサイズを変更しなければなりません。オレンジ色の点をクリックしてドラッグすることで、インタラクティブに操作できます。
ko: 3D 모델에 더 잘 맞도록 크기를 변경해야 합니다. 주황색 점을 클릭하고 드래그하여 대화형으로 변경할 수 있습니다.
ta: 3D மாதிரியை சிறப்பாக பொருத்த நாம் அதன் அளவை மாற்ற வேண்டும். ஆரஞ்சு புள்ளிகளைக் சொடுக்கு செய்து இழுப்பதன் மூலம் நீங்கள் ஊடாடும் வகையில் அவ்வாறு செய்யலாம்.
tr: 3B modele daha iyi uyması için boyutunu değiştirmeliyiz. Turuncu noktalara tıklayıp sürükleyerek bunu etkileşimli olarak yapabilirsiniz.

source: The box should touch the floor and be a little thinner than the model. Physics engines work in such a way that if the player's sphere touches even the box's corner, a collision will occur. If the box is a little too big compared to the 3D model, you may die at a distance from the monster, and the game will feel unfair to the players.
ga: Ba chóir go mbeadh an bosca teagmháil leis an urlár agus a bheith beagán níos tanaí ná an tsamhail. Oibríonn innill fhisic sa chaoi is go dtarlóidh imbhualadh má théann sféar an imreora i dteagmháil le fiú cúinne an bhosca. Má tá an bosca beagán ró-mhór i gcomparáid leis an tsamhail 3D, féadfaidh tú bás ag fad ón ollphéist, agus beidh an cluiche éagórach leis na himreoirí.
it: Il riquadro dovrebbe toccare il pavimento ed essere leggermente più sottile del modello. I motori di fisica funzionano in modo tale che se la sfera del giocatore tocca anche solo l'angolo del riquadro, si verificherà una collisione. Se il riquadro è leggermente troppo grande rispetto al modello 3D, si potrebbe morire lontano dal mostro e il gioco sembrerà ingiusto nei confronti dei giocatori.
ja: 衝突ボックスは地面に接触していて、モデルより少し小さくする必要があります。物理エンジンは、プレイヤーの衝突球体がこの衝突ボックスの端に触れただけでも、衝突したと判定します。もし衝突ボックスが 3D モデルより少し大きかった場合、モンスターからまだ距離があるのに死んでしまい、プレイヤーは不公平だと感じるでしょう。
ko: 상자는 바닥에 닿아야 하며 모델보다 약간 얇아야 합니다. 물리 엔진은 플레이어의 구체가 상자의 모서리에 닿으면 콜리전이 발생하는 방식으로 작동합니다. 상자가 3D 모델에 비해 너무 크면 몬스터와 멀리 떨어진 곳에서 죽을 수 있으며 플레이어에게 게임이 불공평하게 느껴질 수 있습니다.
ta: பெட்டி தரையைத் தொட்டு, மாதிரியை விட கொஞ்சம் மெல்லியதாக இருக்க வேண்டும். இயற்பியல் இயந்திரங்கள் செயல்படுகின்றன, அவை வீரரின் கோளம் பெட்டியின் மூலையைத் தொட்டால், மோதல் ஏற்படும். 3D மாடலுடன் ஒப்பிடும்போது பெட்டி சற்று பெரியதாக இருந்தால், நீங்கள் அசுரனிலிருந்து தூரத்தில் இறக்கலாம், மேலும் விளையாட்டு வீரர்களுக்கு நியாயமற்றதாக இருக்கும்.
tr: Kutu zemine temas etmeli ve modelden biraz daha ince olmalıdır. Fizik motorları, oyuncunun küresi kutunun köşesine bile değerse bir çarpışma meydana gelecek şekilde çalışır. Eğer kutu 3D modele kıyasla biraz fazla büyükse, canavardan biraz uzakta ölebilirsiniz ve oyun oyunculara haksızlık yapıyor gibi gelecektir.

source: |image4|
ga: |íomhá4|
ta: | படம் 4 |

source: image4
ga: íomhá 4
ta: படம் 4

source: Notice that my box is taller than the monster. It is okay in this game because we're looking at the scene from above and using a fixed perspective. Collision shapes don't have to match the model exactly. It's the way the game feels when you test it that should dictate their form and size.
ga: Tabhair faoi deara go bhfuil mo bhosca níos airde ná an ollphéist. Tá sé ceart go leor sa chluiche seo mar táimid ag féachaint ar an radharc ó thuas agus ag baint úsáide as peirspictíocht sheasta. Ní gá do chruthanna imbhuailte an tsamhail a mheaitseáil go díreach. Is é an bealach a mhothaíonn an cluiche nuair a thástáil tú é ba cheart a bhfoirm agus a méid a ordú.
it: Nota che il mio riquadro è più alto del mostro. In questo gioco va bene perché stiamo guardando la scena dall'alto e usando una prospettiva fissa. Le forme di collisione non devono coincidere esattamente con il modello. È l'impressione che si ha quando si prova il gioco a determinarne forma e dimensioni.
ja: ボックスがモンスターより高さがあることに注意してください。このゲームでは、シーンを上から見て、固定されたパースペクティブを使っているので、大丈夫です。コリジョン形状は、モデルと完全に一致する必要はありません。ゲームをテストしたときの感触で、形や大きさを決めるといいでしょう。
ko: 내 상자가 괴물보다 더 큰 것을 알 수 있습니다. 이 게임에서는 위에서 고정된 시점을 사용하여 장면을 보고 있기 때문에 괜찮습니다. 콜리전 모양이 모델과 정확히 일치할 필요는 없습니다. 테스트할 때 게임의 느낌에 따라 형태와 크기를 결정해야 합니다.
ta: எனது பெட்டி அசுரனை விட உயரமாக இருப்பதைக் கவனியுங்கள். இந்த விளையாட்டில் பரவாயில்லை, ஏனென்றால் நாங்கள் மேலே இருந்து காட்சியைப் பார்த்து, ஒரு நிலையான கண்ணோட்டத்தைப் பயன்படுத்துகிறோம். மோதல் வடிவங்கள் மாதிரியை சரியாக பொருத்த வேண்டியதில்லை. நீங்கள் அதை சோதிக்கும்போது விளையாட்டு உணரும் விதம் இது அவர்களின் வடிவத்தையும் அளவையும் ஆணையிட வேண்டும்.
tr: Kutumun canavardan daha yüksek olduğuna dikkat edin. Bu oyunda sorun yok çünkü sahneye yukarıdan bakıyoruz ve sabit bir perspektif kullanıyoruz. Çarpışma şekillerinin modelle tam olarak eşleşmesi gerekmez. Biçimlerini ve boyutlarını belirlemesi gereken şey, oyunu test ettiğinizde oyunun size hissettirdikleridir.

source: Removing monsters off-screen
ga: Arrachtaigh a bhaint lasmuigh den
it: Rimozione dei mostri fuori dallo schermo
ja: 古い「モンスター」を削除する
ko: 화면 밖에서 괴물 제거하기
ta: அரக்கர்களை அகற்றும் திரையில்
tr: Ekran dışındaki canavarları kaldırma

source: We're going to spawn monsters at regular time intervals in the game level. If we're not careful, their count could increase to infinity, and we don't want that. Each mob instance has both a memory and a processing cost, and we don't want to pay for it when the mob is outside the screen.
ga: Táimid chun arrachtaigh a scaoileadh ag eatraimh ama rialta i leibhéal an chluiche. Mura bhfuilimid cúramach, d'fhéadfadh a gcomhaireamh méadú go dtí gan teorainn, agus níl sé sin uainn ag iarraidh. Tá costas cuimhne agus próiseála ag gach cás mob, agus nílimid ag iarraidh íoc as nuair a bhíonn an mob lasmuigh den scáileán.
it: Faremo comparire mostri a intervalli regolari nel livello di gioco. Se non stiamo attenti, il loro numero potrebbe aumentare all'infinito, e non vogliamo che ciò accada. Ogni istanza di mob ha un costo sia di memoria sia di elaborazione, e non vogliamo pagarlo quando il mob è fuori dallo schermo.
ja: 私たちはこのゲームレベルで一定時間ごとにモンスターを生成します。もし私たちがうっかりしていたら、それらの数は無限大に増えるかもしれませんが、私たちはそれを望んでいません。モブの各インスタンスにはメモリと処理コストがあり、モブが画面の外にいるときは、私たちはそのためにコストを払いたくありません。
ko: 게임 레벨에서 일정한 시간 간격으로 괴물을 소환할 것입니다. 조심하지 않으면 괴물의 수가 무한대로 늘어날 수 있는데, 이런 상황을 원하지 않습니다. 각 몹 인스턴스에는 메모리와 처리 비용이 모두 있으며, 몹이 화면 밖에 있을 때는 비용을 지불하고 싶지 않습니다.
ta: நாங்கள் விளையாட்டு மட்டத்தில் வழக்கமான நேர இடைவெளியில் அரக்கர்களை உருவாக்கப் போகிறோம். நாங்கள் கவனமாக இல்லாவிட்டால், அவற்றின் எண்ணிக்கை முடிவிலிக்கு அதிகரிக்கும், நாங்கள் அதை விரும்பவில்லை. ஒவ்வொரு கும்பல் நிகழ்விலும் ஒரு நினைவகம் மற்றும் செயலாக்க செலவு இரண்டுமே உள்ளன, மேலும் கும்பல் திரைக்கு வெளியே இருக்கும்போது அதை செலுத்த நாங்கள் விரும்பவில்லை.
tr: Oyun seviyesinde düzenli zaman aralıklarında canavarlar ortaya çıkaracağız. Eğer dikkatli olmazsak, sayıları sonsuza kadar artabilir ve biz bunu istemiyoruz. Her düşman örneğinin hem bir bellek hem de bir işlem maliyeti vardır ve düşman ekranın dışındayken bunun yükünü taşımak istemeyiz.

source: Once a monster leaves the screen, we don't need it anymore, so we should delete it. Godot has a node that detects when objects leave the screen, :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>`, and we're going to use it to destroy our mobs.
ga: Nuair a fhágann ollphéist an scáileán, ní gá dúinn é a thuilleadh, mar sin ba chóir dúinn é a scriosadh. Tá nód ag Godot a bhraitheann nuair a fhágann rudaí an scáileán, :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>`, agus táimid chun é a úsáid chun ár sluaite a scrios.
it: Una volta che un mostro lascia lo schermo, non ne abbiamo più bisogno, quindi dovremmo eliminarlo. Godot ha un nodo che rileva quando gli oggetti lasciano lo schermo, :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>`, e lo utilizzeremo per distruggere i nostri mob.
ja: モンスターが画面から離れたら、もう必要ないので、削除してしまいましょう。Godotには、 :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>` という、ノードが画面から離れるのを検知するノードがあるので、それを使ってモブを破壊することにします。
ko: 몬스터가 화면을 떠나면 더 이상 필요하지 않으므로 삭제해야 합니다. 고닷에는 오브젝트가 화면을 떠나는 시점을 감지하는 노드인 :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>`가 있으며, 이를 사용하여 몹을 파괴할 것입니다.
ta: ஒரு அரக்கன் திரையை விட்டு வெளியேறியதும், எங்களுக்கு இது தேவையில்லை, எனவே அதை நீக்க வேண்டும். பொருள்கள் திரையை விட்டு வெளியேறும்போது கோடோட் ஒரு முனை உள்ளது,: குறிப்பு: `waillyonscreennotifier3d <class_visibleonscreennotifier3d>`, மேலும் எங்கள் கும்பல்களை அழிக்க இதைப் பயன்படுத்தப் போகிறோம்.
tr: Bir canavar ekranı terk ettiğinde, artık ona ihtiyacımız yoktur, bu yüzden onu silmeliyiz. Godot, nesnelerin ekrandan ne zaman ayrıldığını algılayan bir düğüme sahiptir, :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>`, ve biz bunu düşmanlarımızı yok etmek için kullanacağız.

source: When you keep instancing an object, there's a technique you can use to avoid the cost of creating and destroying instances all the time called pooling. It consists of pre-creating an array of objects and reusing them over and over.
ga: Nuair a choinníonn tú réad a thionscnamh, tá teicníc ann is féidir leat a úsáid chun an costas a bhaineann le cásanna a chruthú agus a scriosadh an t-am ar fad ar a dtugtar comhchruinniú a sheachaint. Is éard atá ann éagsúlacht rudaí a réamh-chruthú agus iad a athúsáid arís agus arís eile.
it: Quando si istanzia continuamente un oggetto, esiste una tecnica che permette di evitare il costo di creare e distruggere istanze continuamente, chiamata "pooling". Consiste nel creare in anticipo un array di oggetti e riutilizzarli più e più volte.
ja: オブジェクトのインスタンスを生成し続ける場合に、インスタンスを常に生成・破棄するコストを回避するための手法にプーリングというものがあります。これは、オブジェクトの配列をあらかじめ作成しておき、それを何度も再利用するというものです。
ko: 객체를 계속 인스턴스화할 때 인스턴스를 항상 생성하고 소멸하는 비용을 피하기 위해 풀링이라는 기술을 사용할 수 있습니다. 풀링은 객체 배열을 미리 생성하고 이를 반복해서 재사용하는 방식으로 구성됩니다.
ta: நீங்கள் ஒரு பொருளை நிறுவும்போது, பூலிங் என்று அழைக்கப்படும் நிகழ்வுகளை உருவாக்குவதற்கும் அழிப்பதற்கும் நீங்கள் பயன்படுத்தக்கூடிய ஒரு நுட்பம் உள்ளது. இது ஒரு பொருளின் வரிசையை முன்கூட்டியே உருவாக்கி அவற்றை மீண்டும் மீண்டும் பயன்படுத்துகிறது.
tr: Bir nesneyi örneklemeye devam ettiğinizde, sürekli örnek oluşturma ve yok etme yükünden kaçınmak için kullanabileceğiniz havuzlama adı verilen bir teknik vardır. Bu teknik, bir dizi nesnenin önceden oluşturulmasını ve tekrar tekrar kullanılmasını içerir.

source: When working with GDScript, you don't need to worry about this. The main reason to use pools is to avoid freezes with garbage-collected languages like C# or Lua. GDScript uses a different technique to manage memory, reference counting, which doesn't have that caveat. You can learn more about that here: :ref:`doc_gdscript_basics_memory_management`.
ga: Agus tú ag obair le GDScript, ní gá duit a bheith buartha faoi seo. Is é an chúis is mó le linnte a úsáid ná reoite a sheachaint le teangacha a bhailítear le garbagaí mar C # nó Lua. Úsáideann GDScript teicníc dhifriúil chun cuimhne, comhaireamh tagartha a bhainistiú, nach bhfuil an caighdeamh sin aige. Is féidir leat tuilleadh a fhoghlaim faoi sin anseo: :ref: `doc_gdscript_basics_memory_management`.
it: Quando si lavora con GDScript, non c'è bisogno di preoccuparsi di questo aspetto. Il motivo principale per cui si utilizzano i "pool" è evitare blocchi con linguaggi con garbage collection come C# o Lua. GDScript utilizza una tecnica diversa per gestire la memoria, il conteggio dei riferimenti, che non ha questo limite. Puoi saperne di più qui: :ref:`doc_gdscript_basics_memory_management`.
ja: GDScript で作業する場合、このことを気にする必要はありません。プールを使用する主な理由は、C# や Lua のようなガベージコレクション言語でのフリーズを回避するためです。GDScriptでは、参照カウントという別の手法でメモリを管理しており、この手法はフリーズに注意する必要はありません。メモリ管理の詳細については :ref:`doc_gdscript_basics_memory_management` で学ぶことができます。
ko: GDScript로 작업할 때는 이에 대해 걱정할 필요가 없습니다. 풀을 사용하는 주된 이유는 C#이나 Lua와 같은 가비지 수집 언어에서 멈추는 현상을 피하기 위해서입니다. GDScript는 메모리 관리, 참조 카운팅에 다른 기술을 사용하므로 이러한 주의 사항이 없습니다. 이에 대한 자세한 내용은 여기에서 확인할 수 있습니다: :ref:`doc_gdscript_basics_memory_management`.
ta: GDSCRIPT உடன் பணிபுரியும் போது, இதைப் பற்றி நீங்கள் கவலைப்பட தேவையில்லை. குளங்களைப் பயன்படுத்துவதற்கான முக்கிய காரணம், சி# அல்லது லுவா போன்ற குப்பைகளை சேகரித்த மொழிகளுடன் முடக்குவதைத் தவிர்ப்பது. நினைவகம், குறிப்பு எண்ணிக்கையை நிர்வகிக்க GDSCRIPT வேறு நுட்பத்தைப் பயன்படுத்துகிறது, அதில் அந்த எச்சரிக்கை இல்லை. அதைப் பற்றி நீங்கள் இங்கே மேலும் அறியலாம் :: ref: `Doc_gdscript_basics_memory_management`.
tr: GDScript ile çalışırken bu konuda endişelenmenize gerek yoktur. Havuzları kullanmanın ana nedeni, C# veya Lua gibi çöp-toplayan dillerde donmalardan kaçınmaktır. GDScript hafızayı yönetmek için farklı bir teknik olan ve bu soruna sahip olmayan "başvuru sayma" kullanır. Bununla ilgili daha fazla bilgiyi burada bulabilirsiniz: :ref:`doc_gdscript_basics_memory_management`.

source: Select the ``Mob`` node and add a child node :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>`. Another box, pink this time, appears. When this box completely leaves the screen, the node will emit a signal.
ga: Roghnaigh an nód ``Mob`` agus cuir nód linbh leis :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>`. Tá bosca eile, bándearg an uair seo, le feiceáil. Nuair a fhágann an bosca seo an scáileán go hiomlán, scaoilfidh an nód comhartha.
it: Seleziona il nodo ``Mob`` e aggiungi un nodo figlio :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>`. Apparirà un altro riquadro, stavolta rosa. Quando questo riquadro scomparirà completamente dallo schermo, il nodo emetterà un segnale.
ja: ``Mob`` ノードを選択し、\ :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>`\ をその子として追加してください。すると、今度はピンク色のボックスが現れます。このボックスが完全に画面から消えると、ノードがシグナルを発信します。
ko: ``Mob`` 노드를 선택하고 자식 노드 :ref:`VisibleOnScreenNotifier3D <class_VisibleOnScreenNotifier3D>`를 추가합니다. 이번에는 분홍색의 또 다른 상자가 나타납니다. 이 상자가 화면에서 완전히 사라지면 노드는 신호를 방출합니다.
ta: `` மோப்`` முனை என்பதைத் தேர்ந்தெடுத்து குழந்தை முனையைச் சேர்க்கவும்: குறிப்பு: `SELASIBLEONSCRENNOTIFIRE3D <Class_visibleonsCreennotifier3d>`. மற்றொரு பெட்டி, இந்த நேரத்தில் இளஞ்சிவப்பு, தோன்றும். இந்த பெட்டி முழுவதுமாக திரையை விட்டு வெளியேறும்போது, முனை ஒரு சமிக்ஞையை வெளியிடுகிறது.
tr: ``Mob`` düğümünü seçin ve bir :ref:`VisibleOnScreenNotifier3D ` alt düğümü ekleyin. Bu kez pembe renkli başka bir kutu belirir. Bu kutu ekranı tamamen terk ettiğinde, düğüm bir sinyal yayacaktır.

source: |image5|
ga: |íomhá5|
ta: | படம் 5 |

source: image5
ga: íomhá5
ta: படம் 5

source: Resize it using the orange dots until it covers the entire 3D model.
ga: Athraigh méid é ag úsáid na poncanna oráiste go dtí go gclúdaíonn sé an tsamhail 3D iomlán.
it: Ridimensionalo tramite i punti arancioni fino a coprire tutto il modello 3D.
ja: 3D モデル全体を覆うように、オレンジのドットでサイズを変更します。
ko: 전체 3D 모델을 덮을 때까지 주황색 점을 사용하여 크기를 조정합니다.
ta: ஆரஞ்சு புள்ளிகளைப் பயன்படுத்தி முழு 3D மாதிரியையும் உள்ளடக்கும் வரை அதை மறுஅளவிடுங்கள்.
tr: Turuncu noktaları kullanarak 3D modelin tamamını kaplayana kadar yeniden boyutlandırın.

source: |image6|
ga: |íomhá6|
ta: | படம் 6

source: image6
ga: íomhá6
ta: படம் 6

source: Coding the mob's movement
ga: Gluaiseacht an mob a chódú
it: Programmare il movimento del mob
ja: モブの動きをコード化する
ko: 몹의 움직임 코딩하기
ta: கும்பலின் இயக்கத்தை குறியிடுதல்
tr: Düşmanın hareketini kodlama

source: Let's implement the monster's motion. We're going to do this in two steps. First, we'll write a script on the ``Mob`` that defines a function to initialize the monster. We'll then code the randomized spawn mechanism in the ``main.tscn`` scene and call the function from there.
ga: Déanaimis tairiscint an ollphéist i bhfeidhm. Táimid chun é seo a dhéanamh i dhá chéim. Ar dtús, scríobhfaimid script ar an ``Mob`` a shainmhíníonn feidhm chun an ollphéist a thosú. Ansin déanfaimid an mheicníocht spáin randamaithe a chódú sa radharc ``main.tscn ``agus glaoimid ar an bhfeidhm as sin.
it: Implementiamo il movimento del mostro. Lo faremo in due passaggi. Per prima cosa, scriveremo uno script sulla scena ``Mob`` che definisce una funzione per inizializzare il mostro. Poi scriveremo il codice per il meccanismo di generazione casuale nella scena ``main.tscn`` e chiameremo la funzione da lì.
ja: それでは、モンスターの動きを組み込んでみましょう。2ステップに分けて行います。まず、モンスターを初期化する関数を含むスクリプトを、 ``Mob`` ノードに作成します。次に、ランダム生成メカニズムを ``main.tscn`` シーン内に作成し、モンスターを初期化する関数を実行します。
ko: 몬스터의 동작을 구현해 봅시다. 이 작업은 두 단계로 진행하겠습니다. 먼저 몬스터를 초기화하는 함수를 정의하는 스크립트를 ``Mob`` 에 작성합니다. 그런 다음 ``main.tscn`` 씬에서 무작위 소환 메커니즘을 코딩하고 거기에서 함수를 호출합니다.
ta: அசுரனின் இயக்கத்தை செயல்படுத்துவோம். இதை நாங்கள் இரண்டு படிகளில் செய்யப் போகிறோம். முதலில், அசுரனைத் துவக்க ஒரு செயல்பாட்டை வரையறுக்கும் `` கும்பல்` இல் ஒரு ச்கிரிப்டை எழுதுவோம். சீரற்ற ச்பான் பொறிமுறையை `` main.tscn`` காட்சியில் குறியிடுவோம், அங்கிருந்து செயல்பாட்டை அழைப்போம்.
tr: Canavarın hareketini uyarlayalım. Bunu iki adımda yapacağız. İlk olarak, ``Mob`` üzerinde canavarı başlatmak için bir işlev tanımlayan bir betik dosyası yazacağız. Daha sonra ``main.tscn`` sahnesi içinden rastgele ortaya çıkma mekanizmasını kodlayacağız ve fonksiyonu oradan çağıracağız.
