Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/08.score_and_replay.po
Languages: ga, it, ja, ko, ta, tr

source: Adding music
ga: Ceol a chur leis
it: Aggiungere la musica
ja: 音楽を追加する
ko: 음악 추가하기
ta: இசையைச் சேர்ப்பது
tr: Müzik eklemek

source: To add music that plays continuously in the background, we're going to use another feature in Godot: :ref:`autoloads <doc_singletons_autoload>`.
ga: Chun ceol a sheinneann go leanúnach sa chúlra a chur leis, táimid chun gné eile a úsáid in Godot: :ref:`autoloads <doc_singletons_autoload>`.
it: Per aggiungere musica che viene riprodotta continuamente in sottofondo, utilizzeremo un'altra funzionalità di Godot: gli :ref:`autoload <doc_singletons_autoload>`.
ja: バックグラウンドで繰り返し再生される音楽を追加するには、Godot の別の機能である :ref:`autoloads <doc_singletons_autoload>` を使用します。
ko: 배경에서 계속 재생되는 음악을 추가하기 위해, 우리는 Godot의 또 다른 기능인 :ref:`오토로드 <doc_singletons_autoload>`\ 를 사용할 것입니다.
ta: பின்னணியில் தொடர்ந்து விளையாடும் இசையைச் சேர்க்க, நாங்கள் கோடோட்டில் மற்றொரு அம்சத்தைப் பயன்படுத்தப் போகிறோம் :: குறிப்பு: `ஆட்டோலோட்ச் <doc_singletons_autoload>`.
tr: Arka planda sürekli çalan müzik eklemek için Godot'taki başka bir özelliği kullanacağız: :ref:`otomatik yüklenenler<doc_singletons_autoload>`.

source: To play audio, all you need to do is add an :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` node to your scene and attach an audio file to it. When you start the scene, it can play automatically. However, when you reload the scene, like we do to play again, the audio nodes are also reset, and the music starts back from the beginning.
ga: Chun an fhuaim a sheinm, níl le déanamh agat ach nód :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` a chur le do radharc agus comhad fuaime a cheangal leis. Nuair a thosaíonn tú ar an ardán, is féidir é a imirt go huathoibríoch. Mar sin féin, nuair a athlódálann tú an radharc, mar a dhéanaimid le himirt arís, athshocraítear na nóid fuaime freisin, agus tosaíonn an ceol ar ais ón tús.
it: Per riprodurre l'audio, basta aggiungere un nodo :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` alla scena e allegarvi un file audio. Quando si avvia la scena, l'audio può essere riprodotto automaticamente. Tuttavia, ricaricando la scena, come facciamo per giocare nuovamente, anche i nodi audio vengono ripristinati e la musica riparte da capo.
ja: オーディオを再生するには、シーンに :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` ノードを追加し、オーディオファイルを添付するだけで再生できるようになります。シーンを開始すると、自動的にオーディオが再生されます。しかし、シーンをリロードする（ゲームをリプレイしたりするときのように）と、オーディオノードもリセットされ、音楽は最初から始まります。
ko: 오디오를 재생하려면 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` 노드를 씬에 추가하고 오디오 파일을 붙이기만 하면 됩니다. 씬을 시작하면 자동으로 재생될 수 있습니다. 하지만 다시 재생하기 위해 하는 것처럼 씬을 다시 불러오면 오디오 노드도 재설정되고 음악이 처음부터 다시 시작됩니다.
ta: ஆடியோவை இயக்க, நீங்கள் செய்ய வேண்டியதெல்லாம் ஒரு சேர்க்க வேண்டும்: Ref: `AudioStreamPlayer <class_audiosTreamplayer>` உங்கள் காட்சிக்கு முனை மற்றும் அதில் ஆடியோ கோப்பை இணைக்கவும். நீங்கள் காட்சியைத் தொடங்கும்போது, அது தானாகவே இயக்க முடியும். இருப்பினும், நீங்கள் காட்சியை மீண்டும் ஏற்றும்போது, நாங்கள் மீண்டும் விளையாடுவது போல, ஆடியோ முனைகளும் மீட்டமைக்கப்படுகின்றன, மேலும் இசை ஆரம்பத்தில் இருந்தே தொடங்குகிறது.
tr: Ses çalmak için tek yapmanız gereken sahnenize bir :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` düğümü eklemek ve buna bir ses dosyası eklemektir. Sahneyi başlattığınızda, otomatik olarak çalabilir. Ancak, sahneyi yeniden yüklediğinizde, tekrar oynatmak için yaptığımız gibi, ses düğümleri de sıfırlanır ve müzik baştan başlar.

source: You can use the autoload feature to have Godot load a node or a scene automatically at the start of the game, outside the current scene. You can also use it to create globally accessible objects.
ga: Is féidir leat an ghné autoload a úsáid chun go mbeidh Godot nód nó radharc a luchtú go huathoibríoch ag tús an chluiche, lasmuigh den radharc reatha. Is féidir leat é a úsáid freisin chun rudaí inrochtana go domhanda a chruthú.
it: Puoi usare la funzionalità degli autoload per affinché Godot carichi automaticamente un nodo o una scena all'inizio del gioco, fuori dalla scena attuale. Puoi anche utilizzarla per creare oggetti accessibili globalmente.
ja: オートロード機能を使えば、ゲーム開始時に現在のシーン以外のノードやシーンをGodot に自動的にロードさせることができます。また、グローバルにアクセス可能なオブジェクトを作成する場合にも使用できます。
ko: 오토로드 기능을 사용하면 Godot가 게임 시작 시 현재 장면 외부에서 노드나 장면을 자동으로 불러올 수 있습니다. 또한 전역적으로 접근 가능한 객체를 생성하는 데도 사용할 수 있습니다.
ta: தற்போதைய காட்சிக்கு வெளியே, விளையாட்டின் தொடக்கத்தில் கோடோட் ஒரு முனை அல்லது காட்சியை தானாக ஏற்றுவதற்கு நீங்கள் ஆட்டோலோட் அம்சத்தைப் பயன்படுத்தலாம். உலகளவில் அணுகக்கூடிய பொருள்களை உருவாக்க இதைப் பயன்படுத்தலாம்.
tr: Otomatik yükleme özelliğini, Godot'nun oyunun başlangıcında ama mevcut sahnenin dışında bir düğümü veya sahneyi otomatik olarak yüklemesini sağlamak için kullanabilirsiniz. Ayrıca genel olarak erişilebilir nesneler oluşturmak için de kullanabilirsiniz.

source: Create a new scene by going to the *Scene* menu and clicking *New Scene* or by using the *+* icon next to your currently opened scene.
ga: Cruthaigh radharc nua trí dhul chuig an roghchlár *Radhair* agus cliceáil ar *Radharc Nua* nó tríd an deilbhín*+* a úsáid in aice le do radharc atá oscailte faoi láthair.
it: Crea una nuova scena andando al menu *Scena* e cliccando su *Nuova scena* oppure usa l'icona *+* accanto alla scena attualmente aperta.
ja: 左上の *シーン* (Scene)メニューから *新規シーン* (New Scene)をクリックし、新しいシーンを作成します。または現在開いているシーンのタブの横にある *+* のアイコンを押して新しいシーンを作成することもできます。
ko: *씬* 메뉴로 가서 *새 씬*\ 을 클릭하거나 현재 열려 있는 장면 옆에 *+* 아이콘을 사용하여 새 씬을 만드세요.
ta: * காட்சி * மெனுவுக்குச் சென்று * புதிய காட்சியைக் சொடுக்கு செய்வதன் மூலம் அல்லது தற்போது திறந்த காட்சிக்கு அடுத்த *+ * ஐகானைப் பயன்படுத்துவதன் மூலம் ஒரு புதிய காட்சியை உருவாக்கவும்.
tr: *Sahne* menüsüne gidip *Yeni Sahne* seçeneğine tıklayarak veya o anda açık olan sahne sekmenizin yanındaki *+* simgesini kullanarak yeni bir sahne oluşturun.

source: |image15|
ga: |íomhá15|
ta: | படம் 15 |

source: image15
ga: íomhá15
ta: படம் 15

source: Click the *Other Node* button to create an :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` and rename it to ``MusicPlayer``.
ga: Cliceáil ar an gcnaipe *Nóid Eile* chun :ref:`AudioStreamPlayer <class_AudioStreamPlayer> a chruthú agus athainmnigh é go ``MusicPlayer``.
it: Fare clic sul pulsante *Altro nodo* per creare un :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` e rinominarlo in ``MusicPlayer``.
ja: *その他のノード* (Other Node)ボタンをクリックして :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` を作成し、名前を ``MusicPlayer`` に変更します。
ko: *다른 노드* 버튼을 클릭하여 :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`\ 를 만들고, 이름을 ``MusicPlayer``\ 로 변경하세요.
ta: ஒரு உருவாக்க * பிற முனை * பொத்தானைக் சொடுக்கு செய்க: Ref: `audiostreamplayer <class_audiostreamplayer>` `` `மியூசிக் பிளேயர்`` என்று மறுபெயரிடுங்கள்.
tr: Bir :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` oluşturmak için *Diğer Düğüm* düğmesine tıklayın ve adını ``MusicPlayer`` olarak değiştirin.

source: |image16|
ga: |íomhá16|
ta: | படம் 16 |

source: image16
ga: íomhá16
ta: படம் 16

source: We included a music soundtrack in the ``art/`` directory, ``House In a Forest Loop.ogg``. Click and drag it onto the *Stream* property in the *Inspector*. Also, turn on *Autoplay* so the music plays automatically at the start of the game.
ga: Chuireamar fuaimrian ceoil san eolaire ``art/``, `House In a Forest Loop.ogg``. Cliceáil agus tarraing é chuig an maoin *Stream* san * Cigireoir*. Chomh maith leis sin, cas ar* Autoplay* ionas go n-imríonn an ceol go huathoibríoch ag tús an chluiche.
it: Abbiamo incluso una colonna sonora nella cartella ``art/``, ``House In a Forest Loop.ogg``. Cliccala e trascinala sulla proprietà *Stream* nell'*Ispettore*. Inoltre, attiva la proprietà *Autoplay* in modo che la musica venga riprodotta automaticamente all'inizio del gioco.
ja: ``art/`` ディレクトリに ``House In a Forest Loop.ogg`` というサウンドトラックがあります。これをクリックして、 *インスペクター* (Inspector)の *Stream* プロパティにドラッグしてください。また、 *Autoplay* のチェックボックスをオンにして、ゲーム開始時に自動的に音楽が再生されるようにしてみましょう。
ko: ``art/`` 디렉터리에 있는 음악 ``House In a Forest Loop.ogg``\ 를 *인스펙터*\ 의 *스트림* 속성에 클릭하고 드래그하여 추가하세요. 또한, *자동 재생*\ 을 켜서 게임 시작 시 음악이 자동으로 재생되도록 설정하세요.
ta: `` கலை/`` அடைவு, `` ஒரு வனப்பிரத்தில் வீடு ஆகியவற்றில் ஒரு இசை ஒலிப்பதிவை சேர்த்துள்ளோம். *இன்ச்பெக்டர் *இல் உள்ள *ச்ட்ரீம் *சொத்தின் மீது சொடுக்கு செய்து இழுக்கவும். மேலும், * ஆட்டோபிளே * ஐ இயக்கவும், எனவே விளையாட்டின் தொடக்கத்தில் இசை தானாகவே இயங்குகிறது.
tr: Biz ``art/`` dizinine ``House In a Forest Loop.ogg`` adında bir müzik parçası ekledik. Tıklayın ve *Denetleyici* içindeki *Stream* özelliğinin üzerine sürükleyin. Ayrıca, oyunun başlangıcında müziğin otomatik olarak çalması için *Autoplay* özelliğini açın.

source: |image17|
ga: |íomh17|
ta: | படம் 17 |

source: image17
ga: íomhá17
ta: படம் 17

source: Save the scene as ``music_player.tscn``.
ga: Sábháil an radharc mar ``music_player.tscn``.
it: Salva la scena sotto il nome di ``music_player.tscn``.
ja: シーンを ``music_player.tscn`` などの名前で保存します。
ko: ``music_player.tscn``\ 과 같은 이름으로 씬을 저장합니다.
ta: காட்சியை `` மியூசிக்_பிளாயர்.டிசிஎன்`` என சேமிக்கவும்.
tr: Sahneyi ``music_player.tscn`` olarak kaydedin.

source: In the *Path* field, you want to enter the path to your scene. Click the folder icon to open the file browser and double-click on ``music_player.tscn``. Then, click the *Add* button on the right to register the node.
ga: Sa réimsin*Bath*, ba mhaith leat dul isteach sa chosán chuig do radharc. Cliceáil an deilbhín fillteán chun an brabhsálaí comhad a oscailt agus cliceáil faoi dhó ar ``music_player.tscn``. Ansin, cliceáil ar an gcnaipe*Cuir* ar dheis chun an nód a chlárú.
it: Nel campo *Percorso*, inserisci il percorso della scena. Fai clic sull'icona della cartella per aprire l'esploratore file e fai doppio clic su ``music_player.tscn``. Quindi, fai clic sul pulsante *Aggiungi* a destra per registrare il nodo.
ja: *パス* (Path)フィールドにシーンへのパスを入力します。フォルダアイコンをクリックしてファイルブラウザを開き、 ``music_player.tscn`` をダブルクリックします。次に、 *パス* の右側にある *追加* (Add)ボタンをクリックしてノードを登録します。
ko: *경로* 필드에 씬의 경로를 입력해야 합니다. 폴더 아이콘을 클릭하여 파일 브라우저를 열고 ``music_player.tscn``\ 을 더블 클릭하세요. 그런 다음, 오른쪽의 *추가* 버튼을 클릭하여 노드를 등록하세요.
ta: * பாதை * புலத்தில், உங்கள் காட்சிக்கான பாதையில் நுழைய விரும்புகிறீர்கள். கோப்பு உலாவியைத் திறக்க கோப்புறை ஐகானைக் சொடுக்கு செய்து `` மியூசிக்_பிளேயர்..டி.எச்.சி.என்`` இல் இருமுறை சொடுக்கு செய்யவும். பின்னர், முனையை பதிவு செய்ய வலதுபுறத்தில் * சேர் * பொத்தானைக் சொடுக்கு செய்க.
tr: *Yol* alanına sahnenizin yolunu girmek istiyorsunuz. Dosya tarayıcısını açmak için klasör simgesine tıklayın ve ``music_player.tscn`` dosyasına çift tıklayın. Ardından, düğümü kaydetmek için sağdaki *Ekle* düğmesine tıklayın.

source: |image18|
ga: |íomhá18|
ta: | படம் 18 |

source: image18
ga: íomhá18
ta: படம் 18

source: ``music_player.tscn`` now loads into any scene you open or play. So if you run the game now, the music will play automatically in any scene.
ga: Luchtaíonn ``music_player.tscn`` anois isteach in aon radharc a osclaíonn tú nó a imríonn tú. Mar sin má reáchtáil tú an cluiche anois, imreoidh an ceol go huathoibríoch in aon radharc.
it: ``music_player.tscn`` ora viene caricato in qualsiasi scena che apri o avvii. Perciò, se ora avvii il gioco, la musica verrà riprodotta automaticamente in qualsiasi scena.
ja: ``music_player.tscn`` がどのシーンでもロードされるようになりました。そのため、この状態でゲームを実行すると、どのシーンでも音楽が自動的に再生されます。
ko: ``music_player.tscn``\ 은 이제 여러분이 열거나 실행하는 모든 씬에 로드됩니다. 따라서 지금 게임을 실행하면, 모든 씬에서 음악이 자동으로 재생됩니다.
ta: `` music_player.tscn`` இப்போது நீங்கள் திறக்கும் அல்லது விளையாடும் எந்த காட்சியிலும் ஏற்றப்படுகிறது. எனவே நீங்கள் இப்போது விளையாட்டை இயக்கினால், எந்த காட்சியிலும் இசை தானாகவே இயக்கப்படும்.
tr: ``music_player.tscn`` artık açtığınız veya oynattığınız herhangi bir sahneye yüklenir. Yani oyunu şimdi çalıştırırsanız, müzik herhangi bir sahnede otomatik olarak çalacaktır.

source: Before we wrap up this lesson, here's a quick look at how it works under the hood. When you run the game, your *Scene* dock changes to give you two tabs: *Remote* and *Local*.
ga: Sula ndéanaimid an ceacht seo a fhilleadh suas, seo léargas tapa ar an gcaoi a n-oibríonn sé faoin gcochall. Nuair a reáchtáil tú an cluiche, athraíonn do duga* Radhair* chun dhá chluaisín a thabhairt duit: * Iargúlta* agus *Local*.
it: Prima di concludere questa lezione, ecco una rapida occhiata a come funziona. Quando avvii il gioco, il pannello *Scena* cambia e ti mostra due schede: *Remoto* e *Locale*.
ja: このレッスンを終える前に、ゲームの中でどのように処理が動いているのか簡単に見てみましょう。ゲームを実行すると、 *シーン* (Scene)ドックが2つのタブに変わります： *リモート* (Remote)と *ローカル* (Local)です。
ko: 이 단원을 마무리하기 전에, 작동 원리를 간단히 살펴보겠습니다. 게임을 실행하면 *씬* 독이 *원격*\ 과 *로컬* 두 개의 탭으로 변경됩니다.
ta: இந்த பாடத்தை நாங்கள் முடிப்பதற்கு முன், இது பேட்டைக்கு அடியில் எவ்வாறு செயல்படுகிறது என்பதை இங்கே விரைவாகப் பாருங்கள். நீங்கள் விளையாட்டை இயக்கும்போது, உங்கள் *காட்சி *கப்பல்துறை உங்களுக்கு இரண்டு தாவல்களை வழங்க மாறுகிறது: *ரிமோட் *மற்றும் *உள்ளூர் *.
tr: Bu dersi tamamlamadan önce, kaputun altında nasıl çalıştığına hızlıca bir göz atalım. Oyunu çalıştırdığınızda, *Sahne* yuvanız size iki sekme verecek şekilde değişir: *Uzak* ve *Yerel*.

source: |image19|
ga: |íomh19|
ta: | படம் 19 |

source: image19
ga: íomh19
ta: படம் 19

source: The *Remote* tab allows you to visualize the node tree of your running game. There, you will see the *Main* node and everything the scene contains and the instantiated mobs at the bottom.
ga: Ligeann an cluais* Iargúlta* duit crann nód do chluiche reatha a shamhlú. Ansin, feicfidh tú an nód* Príomh* agus gach rud atá sa radharc agus na mobs ionchasacha ag bun.
it: La scheda *Remoto* ti consente di visualizzare l'albero dei nodi del tuo gioco in esecuzione. Lì vedrai il nodo *Main* e tutto il contenuto della scena, con i mob istanziati in basso.
ja: *リモート* (Remote)タブでは、実行中のゲームのノードツリーを視覚化することができます。そこでは、 *Main* ノードとシーンに含まれるすべてのもの、そしてインスタンス化されたモブキャラクターのノードが一番下に表示されます。
ko: *원격* 탭을 사용하면 실행 중인 게임의 노드 트리를 볼 수 있습니다. 이 탭에서 *Main* 노드와 씬에 포함된 모든 요소, 그리고 아래에서 인스턴스화된 몹들을 확인할 수 있습니다.
ta: உங்கள் இயங்கும் விளையாட்டின் முனை மரத்தை காட்சிப்படுத்த * ரிமோட் * தாவல் உங்களை அனுமதிக்கிறது. அங்கு, * முதன்மையான * முனை மற்றும் காட்சியில் உள்ள அனைத்தையும் கீழே காண்பீர்கள் மற்றும் கீழே உள்ள உடனடி கும்பல்கள்.
tr: *Uzak* sekmesi, çalışan oyununuzun düğüm ağacını görselleştirmenizi sağlar. Orada, *Main* düğümü ve sahnenin içerdiği her şeyi ve en altta örneklenmiş düşmanları göreceksiniz.

source: |image20|
ga: |íomh20|

source: image20
ga: íomh20
ta: படம் 20

source: At the top are the autoloaded ``MusicPlayer`` and a *root* node, which is your game's viewport.
ga: Ag an mbarr tá an ``MusicPlayer`` uathluchtaithe agus nód*fréamh*, arb é amharc do chluiche.
it: In cima si trovano il ``MusicPlayer`` caricato automaticamente, e un nodo *root*, che è la viewport del gioco.
ja: 一番上にはオートロード（自動読み込み）された ``MusicPlayer`` と、その上に *root* ノードがあります。 *root* ノードはゲームのビューポートになります。
ko: 맨 위에는 오토로드된 ``MusicPlayer``\ 와 게임의 뷰포트를 나타내는 *root* 노드가 있습니다.
ta: மேலே தன்னியக்க ஏற்றப்பட்ட `` மியூசிக் பிளேயர்`` மற்றும் ஒரு * ரூட் * முனை ஆகியவை உள்ளன, இது உங்கள் விளையாட்டின் காட்சியகமாகும்.
tr: En üstte otomatik yüklenen ``MusicPlayer`` ve oyununuzun görüntü alanı olan bir *root* (kök) düğümü bulunur.

source: And that does it for this lesson. In the next part, we'll add an animation to make the game both look and feel much nicer.
ga: Agus déanann sé sin é don cheacht seo. Sa chéad chuid eile, cuirfimid beochan leis chun go mbeidh cuma agus mothú ar an gcluiche i bhfad níos deise.
it: E questo è tutto per questa lezione. Nella prossima parte aggiungeremo delle animazioni per rendere il gioco più piacevole da guardare e da provare.
ja: 今回のレッスンはここまでです。次のパートでは、アニメーションを追加して、ゲームの見た目とゲーム体験の両方をより良くしていきましょう。
ko: 이것으로 이번 단원을 마칩니다. 다음 단계에서는 게임에 애니메이션을 추가하여 더 멋지게 만들어 보겠습니다.
ta: இந்த பாடத்திற்கு அது செய்கிறது. அடுத்த பகுதியில், விளையாட்டை மிகவும் அழகாகவும் உணரவும் ஒரு அனிமேசனைச் சேர்ப்போம்.
tr: Ve bu ders için bu kadar yeter. Bir sonraki bölümde, oyunun hem daha güzel görünmesini hem de daha iyi hissettirmesini sağlamak için bir canlandırma ekleyeceğiz.

source: Here is the complete ``main.gd`` script for reference.
ga: Seo an script iomlán ``main.gd`` le haghaidh tagartha.
it: Ecco lo script ``main.gd`` completo come riferimento.
ja: 参考までに、 ``main.gd`` のスクリプト全体は次のようになります。
ko: 참조를 위해 전체 ``main.gd`` 스크립트는 다음과 같습니다.
ta: குறிப்புக்கான முழுமையான `` main.gd`` ச்கிரிப்ட் இங்கே.
tr: İşte başvuru için ``main.gd`` betiğinin tamamı.

source: We have to register it as an autoload. Head to the *Project -> Project Settings…* menu and click on the *Globals -> Autoload* tab.
it: Dobbiamo registrarlo come un autoload. Andiamo al menu *Progetto -> Impostazioni del progetto…* e clicchiamo sulla scheda *Globali -> Autoload*.
ko: 씬이나 스크립트를 오토로드하려면 메뉴에서 *프로젝트 -> 프로젝트 설정…*\ 을 선택하고 *전역 -> 오토로드* 탭을 클릭하세요.
