Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/08.score_and_replay.po
Languages: ga, it, ja, ko, ta, tr

source: Score and replay
ga: Scór agus athsheinm
it: Punteggio e rigioco
ja: スコアとリプレイ
ta: ச்கோர் மற்றும் ரீப்ளே
tr: Puanlama ve tekrar oynama

source: In this part, we'll add the score, music playback, and the ability to restart the game.
ga: Sa chuid seo, cuirfimid an scór, athsheinm ceoil, agus an cumas an cluiche a atosú leis.
it: In questa parte aggiungeremo il punteggio, la riproduzione della musica e l'abilità di riavviare il gioco.
ja: このパートでは、スコア表示、音楽再生、リプレイの機能を追加していきます。
ta: இந்த பகுதியில், ச்கோர், மியூசிக் பிளேபேக் மற்றும் விளையாட்டை மறுதொடக்கம் செய்யும் திறனை நாங்கள் சேர்ப்போம்.
tr: Bu bölümde, puanlamayı, müzik çalmayı ve oyunu yeniden başlatma özelliğini ekleyeceğiz.

source: We have to keep track of the current score in a variable and display it on screen using a minimal interface. We will use a text label to do that.
ga: Caithfimid súil a choinneáil ar an scór reatha in athróg agus é a thaispeáint ar an scáileán ag baint úsáide as comhéadan íosta. Úsáidfimid lipéad téacs chun é sin a dhéanamh.
it: Dobbiamo tenere traccia del punteggio attuale in una variabile e visualizzarlo sullo schermo utilizzando un'interfaccia minimale. Useremo un'etichetta di testo per farlo.
ja: 現在のスコアを変数に記録し、最小限のインターフェイスで画面に表示する必要があります。そのためにテキストラベルを使うことにします。
ta: தற்போதைய மதிப்பெண்ணை ஒரு மாறியில் கண்காணிக்க வேண்டும் மற்றும் குறைந்தபட்ச இடைமுகத்தைப் பயன்படுத்தி அதை திரையில் காண்பிக்க வேண்டும். அதைச் செய்ய உரை லேபிளைப் பயன்படுத்துவோம்.
tr: Mevcut puanı bir değişkende tutmalı ve sade bir arayüz kullanarak ekranda göstermeliyiz. Bunu yapmak için bir metin etiketi kullanacağız.

source: In the main scene, add a new child node :ref:`Control <class_Control>` to ``Main`` and name it ``UserInterface``. Ensure you are on the 2D screen, where you can edit your User Interface (UI).
ga: Sa phríomh-radharc, cuir nód linbh nua :ref:`Control <class_Control>> le ``Príomh-`` agus ainmnigh é ``UserInterface``. Cinntigh go bhfuil tú ar an scáileán 2D, áit ar féidir leat do Chomhéadain Úsáideora (UI) a chur in eagar.
it: Nella scena principale, aggiungi un nuovo nodo figlio :ref:`Control <class_Control>` a ``Main`` e rinominalo ``UserInterface``. Assicurati di essere nella schermata 2D, dove puoi modificare l'interfaccia utente (UI).
ja: メインシーンで、新しい子ノードとして :ref:`Control <class_Control>` を ``Main`` に追加し、名前を ``UserInterface`` とします。UIを編集できる *2D* の画面を表示していることを確認してください。
ko: 메인 씬에서 `Main`의 새로운 자식 노드로 :ref:`Control <class_Control>`을 추가하고, 이름을 `UserInterface`로 지정하세요. UI를 편집할 수 있는 2D 화면에 있는지 확인하세요.
ta: முதன்மையான காட்சியில், ஒரு புதிய குழந்தை முனையைச் சேர்க்கவும்: ref: `கட்டுப்பாடு <class_control>` `` பிரதான`` க்கு `` பயனர் இன்டர்ஃபேச்`` என்று பெயரிடுங்கள். நீங்கள் 2 டி திரையில் இருப்பதை உறுதிசெய்க, அங்கு உங்கள் பயனர் இடைமுகத்தை (UI) திருத்தலாம்.
tr: Ana sahnede, ``Main`` ögesine yeni bir :ref:`Control <class_Control>` alt düğümü ekleyin ve adını ``UserInterface`` koyun. Bu Kullanıcı Arayüzünü (UI) düzenleyebileceğiniz 2B ekranda olduğunuzdan emin olun.

source: Add a :ref:`Label <class_Label>` node and name it ``ScoreLabel``
ga: Cuir leis :ref:`Lipéad <class_Label>` nód agus ainmnigh ``ScoreLabel`` é
it: Aggiungi un nodo :ref:`Label <class_Label>` e denominalo ``ScoreLabel``
ja: :ref:`Label <class_Label>` ノードを追加して、名前を ``ScoreLabel`` にします
ko: :ref:`Label <class_Label>` 노드를 추가하고 노드 이름을 ``ScoreLabel``로 지정
ta: A: ref: `லேபிள் <class_label>` முனை மற்றும் அதற்கு `` scorelabel`` என்று பெயரிடுங்கள்
tr: Bir :ref:`Label <class_Label>` düğümü ekleyin ve adını ``ScoreLabel`` koyun

source: |image1|
ga: |íomhá1|
ta: | படம் 1 |

source: image1
ga: íomhá 1
ta: படம் 1

source: In the *Inspector*, set the *Label*'s *Text* to a placeholder like "Score: 0".
ga: San *Cigireoir*, socraí* Téacs* an Lipéad* go sealbhóir áite mar “Scór: 0".
it: Nell'*Ispettore*, imposta il *Text* di *Label* su un segnaposto, ad esempio "Score: 0".
ja: *インスペクター* (Inspector) で、 *Label* の *Text* に "Score: 0" というプレースホルダーを設定してください。
ko: *인스펙터*에서 *Label*의 *Text*에 "Score: 0"과 같은 플레이스홀더를 설정하세요.
ta: *இன்ச்பெக்டர் *இல், *லேபிள் *'கள் *உரையை "மதிப்பெண்: 0" போன்ற ஒரு ஒதுக்கிடத்திற்கு அமைக்கவும்.
tr: *Denetleyici* 'de, *Label* etiketinin *Metin* (text) özelliğini "Skor: 0" gibi bir yer tutucuya ayarlayın.

source: |image2|
ga: |íomhá2|
ta: | படம் 2 |

source: image2
ga: íomhá 2
ta: படம் 2

source: Also, the text is white by default, like our game's background. We need to change its color to see it at runtime.
ga: Chomh maith leis sin, tá an téacs bán de réir réamhshocrú, cosúil le cúlra ár gcluiche. Ní mór dúinn a dath a athrú chun é a fheiceáil ag am rith.
it: Inoltre, il testo è bianco come predefinito, ugale allo sfondo del nostro gioco. Dobbiamo cambiarne il colore per vederlo durante l'esecuzione.
ja: また、テキストはデフォルトではゲームの背景と同じ白です。ゲームを実行した時にテキストが見えるように、色を変更する必要があります。
ko: 또한, 텍스트는 기본적으로 게임의 배경과 같은 흰색입니다. 게임 실행 시 텍스트가 보이도록 색상을 변경해야 합니다.
ta: மேலும், எங்கள் விளையாட்டின் பின்னணியைப் போல உரை இயல்பாகவே வெள்ளை நிறத்தில் உள்ளது. இயக்க நேரத்தில் அதைப் பார்க்க அதன் நிறத்தை மாற்ற வேண்டும்.
tr: Ayrıca, metin varsayılan olarak oyunumuzun arka planı gibi beyazdır. Çalışma zamanında görebilmek için rengini değiştirmemiz gerekiyor.

source: Scroll down to *Theme Overrides*, and expand *Colors* and enable *Font Color* in order to tint the text to black (which contrasts well with the white 3D scene)
ga: Scrollaigh síos chuig *Téama Overrides*, agus leathnaithe* Dathanna* agus cumasaí* Dath Cló* d'fhonn an téacs a thaint go dubh (a dhéanann codarsnacht go maith leis an radharc bán 3D)
it: Scorri verso il basso fino a *Sostituzioni del tema*, espandi *Colori* e abilita *Colore del font* per cambiare la tinta del testo in nero (il quale contrasta bene con il bianco della scena 3D)
ja: *Theme Overrides* までスクロールダウンし、 *Colors* を展開し、 *Font Color* チェックボックスを有効にして、テキストを黒に設定しましょう（これで白い3Dシーンとのコントラストがハッキリしました）
ko: *테마 오버라이드*\ 까지 스크롤한 다음, *색상*\ 을 펼치고 *글꼴 색상*\ 를 활성화하여 텍스트를 검정색으로 틴트를 입히세요. (이렇게 하면 흰색 3D 씬과 대비가 잘 됩니다)
ta: *கருப்பொருளை மீறுகிறது *, மற்றும் *வண்ணங்களை *விரிவுபடுத்தி, உரையை கருப்பு நிறத்தில் சாய்க்க *எழுத்துரு வண்ணத்தை *இயக்கவும் (இது வெள்ளை 3D காட்சியுடன் நன்கு வேறுபடுகிறது)
tr: *Tema Üzerine Yazmaları* bölümüne gidin ve *Renkler* seçeneğini genişletin ve metni siyaha boyamak için *Yazı Tipi Rengi* seçeneğini etkinleştirin (beyaz 3B sahne ile iyi bir zıtlık oluşturur)

source: |image3|
ga: |íomhá3|
ta: | படம் 3

source: image3
ga: íomhá 3
ta: படம் 3

source: Finally, click and drag on the text in the viewport to move it away from the top-left corner.
ga: Faoi dheireadh, cliceáil agus tarraing ar an téacs sa radharc chun é a bhogadh ar shiúl ón gcúinne barr ar chlé.
it: Infine, clicca e trascina il testo nella viewport per spostarlo via dall'angolo in alto a sinistra.
ja: 最後に、ビューポート内のテキストをクリック＆ドラッグして、左上隅から離します。
ko: 마지막으로, 뷰포트에서 텍스트를 클릭하고 드래그하여 왼쪽 상단 모서리에서 떨어지도록 이동하세요.
ta: இறுதியாக, வியூபோர்ட்டில் உள்ள உரையை மேல் இடது மூலையிலிருந்து நகர்த்துவதற்கு சொடுக்கு செய்து இழுக்கவும்.
tr: Son olarak, sol üst köşeden uzaklaştırmak için çerçeve alanındaki metne tıklayın ve sürükleyin.

source: |image4|
ga: |íomhá4|
ta: | படம் 4 |

source: image4
ga: íomhá 4
ta: படம் 4

source: The ``UserInterface`` node allows us to group our UI in a branch of the scene tree and use a theme resource that will propagate to all its children. We'll use it to set our game's font.
ga: Ligeann an nód ``Userface`` dúinn ár gChomhéadain a ghrúpáil i mbrainse den chrann radhairc agus acmhainn téama a úsáid a iomadóidh dá pháistí go léir. Úsáidfimid é chun cló ár gcluiche a shocrú.
it: Il nodo ``UserInterface`` ci permette di raggruppare la nostra interfaccia utente in un ramo dell'albero di scene e di utilizzare una risorsa tema che verrà propagata a tutti i suoi nodi figlio. La utilizzeremo per impostare il font del nostro gioco.
ja: ``UserInterface`` ノードを使うと、UIを *シーン* の中で1つのツリー状にまとめることができ、テーマリソースを使うことができます。この ``UserInterface`` ノードを使用して、ゲームのフォントを設定します。
ko: ``UserInterface`` 노드를 사용하면 씬 트리의 한 지점에 UI를 그룹화하고 모든 자식에 전파되는 테마 리소스를 사용할 수 있습니다. 이를 사용하여 게임의 글꼴을 설정할 수 있습니다.
ta: `` பயனர் இன்டர்ஃபேச்`` முனை எங்கள் இடைமுகம் ஐ காட்சி மரத்தின் ஒரு கிளையில் தொகுக்கவும், அதன் அனைத்து குழந்தைகளுக்கும் பிரச்சாரம் செய்யும் ஒரு கருப்பொருள் வளத்தைப் பயன்படுத்தவும் அனுமதிக்கிறது. எங்கள் விளையாட்டின் எழுத்துருவை அமைக்க இதைப் பயன்படுத்துவோம்.
tr: ``UserInterface`` düğümü, kullanıcı arayüzümüzü sahne ağacının bir dalında gruplandırmamıza ve tüm alt ögelerine yayılacak bir tema kaynağı kullanmamıza olanak tanır. Bunu oyunumuzun yazı tipini ayarlamak için kullanacağız.

source: Creating a UI theme
ga: Téama UI a chruthú
it: Creazione di un tema per l'UI
ja: UIテーマの作成
ta: இடைமுகம் கருப்பொருள் உருவாக்குதல்
tr: Arayüz (UI) teması oluşturma

source: Once again, select the ``UserInterface`` node. In the *Inspector*, create a new theme resource in *Theme -> Theme*.
ga: Arís eile, roghnaigh an nód `` UserInterface``. Sa *Cigire*, cruthaigh acmhainn téama nua i *Téama -> Téama*.
it: Ancora una volta, seleziona il nodo ``UserInterface``. Nell'*Ispettore*, crea una nuova risorsa tema in *Tema -> Tema*.
ja: もう一度、 ``UserInterface`` ノードを選択してください。 *インスペクター* (Inspector)で、 *Theme* 項目を開き、 *Theme* 横の *<空>* (empty)をクリックして *新規Theme* を選択して新しいテーマ・リソースを作成します。
ko: 다시 한 번 ``UserInterface`` 노드를 선택합니다. *인스펙터*에서 *Theme -> Theme*에 새 테마 리소스를 만드세요.
ta: மீண்டும், `` பயனர் இன்டர்ஃபேச்`` முனையைத் தேர்ந்தெடுக்கவும். *இன்ச்பெக்டர் *இல், *தீம் -> கருப்பொருள் *இல் புதிய கருப்பொருள் வளத்தை உருவாக்கவும்.
tr: Bir kez daha ``UserInterface`` düğümünü seçin. *Denetleyici* 'de, *Tema -> Tema* bölümünde yeni bir tema kaynağı oluşturun.

source: |image5|
ga: |íomhá5|
ta: | படம் 5 |

source: image5
ga: íomhá5
ta: படம் 5

source: Click on it to open the theme editor In the bottom panel. It gives you a preview of how all the built-in UI widgets will look with your theme resource.
ga: Cliceáil air chun an eagarthóir téama a oscailt Sa phainéal bun. Tugann sé réamhamharc duit ar an gcaoi a mbeidh cuma ar na giuirléidí UI ionsuite le d'acmhainn téama.
it: Cliccaci sopra per aprire l'editor di temi nel pannello inferiore. Offre un'anteprima di come appariranno tutti i widget integrati dell'interfaccia utente con la tua risorsa tema.
ja: *Theme* をクリックすると、Godotの下のパネルにある *テーマ* というエディタが開きます（※ 開かない場合には、インスペクター内で先ほど追加した *Theme* 横のプルダウンから *編集* をクリックしても開きます）。 *デフォルトのプレビュー* 内では、既に用意されている全てのUIウィジェットがテーマリソースでどのように見えるか、プレビューを確認できます。
ko: 테마를 클릭하여 아래 패널에서 테마 편집기를 엽니다. 이 편집기는 테마 리소스를 사용한 기본 UI 위젯들이 어떻게 보일지 미리 볼 수 있게 해줍니다.
ta: கீழே உள்ள பேனலில் கருப்பொருள் எடிட்டரைத் திறக்க அதைக் சொடுக்கு செய்க. உங்கள் கருப்பொருள் வளத்துடன் உள்ளமைக்கப்பட்ட அனைத்து இடைமுகம் விட்செட்டுகளும் எவ்வாறு இருக்கும் என்பதற்கான முன்னோட்டத்தை இது வழங்குகிறது.
tr: Tema düzenleyiciyi alt panelde açmak için üzerine tıklayın. Tüm yerleşik UI birimlerinin tema kaynağınızla nasıl görüneceğine dair bir önizleme sunar.

source: |image6|
ga: |íomhá6|
ta: | படம் 6

source: image6
ga: íomhá6
ta: படம் 6

source: By default, a theme only has a few properties: *Default Base Scale*, *Default Font* and *Default Font Size*.
ga: De réir réamhshocraithe, níl ach cúpla airíonna ag téama: *Scála Bonn Réamhshocraithe*, *Cló Réamhshocraithe* agus *Méid Cló Réamhshocraithe*.
it: Normalmente, un tema ha solo qualche proprietà: *Scala di base predefinita*, *Font predefinito* e *Dimensione del font predefinita*.
ja: デフォルトでは、テーマにはプロパティが少ししかありません（『インスペクター』内をご覧ください）： *Default Base Scale* (デフォルトのベーススケール)、 *Default Font* (デフォルトのフォント)、 *Default Font Size* (デフォルトのフォントサイズ)です。
ko: 기본적으로 테마에는 몇 가지 속성만 있습니다: *Default Base Scale*, *Default Font*, *Default Font Size*.
ta: இயல்பாக, ஒரு கருப்பொருள் சில பண்புகளை மட்டுமே கொண்டுள்ளது: *இயல்புநிலை அடிப்படை அளவு *, *இயல்புநிலை எழுத்துரு *மற்றும் *இயல்புநிலை எழுத்துரு அளவு *.
tr: Varsayılan olarak, bir temanın yalnızca birkaç özelliği vardır: *Varsayılan Temel Ölçek*, *Varsayılan Yazı Tipi* ve *Varsayılan Yazı Tipi Boyutu*.

source: You can add more properties to the theme resource to design complex user interfaces, but that is beyond the scope of this series. To learn more about creating and editing themes, see :ref:`doc_gui_skinning`.
ga: Is féidir leat níos mó airíonna a chur leis an acmhainn téama chun comhéadain úsáideora casta a dhearadh, ach tá sé sin níos faide ná raon feidhme na sraithe seo. Chun tuilleadh a fhoghlaim faoi théamaí a chruthú agus eagarthóireacht, féach:ref: `doc_gui_skinning`.
it: È possibile aggiungere ulteriori proprietà alla risorsa tema per progettare interfacce utente complesse, ma questo va oltre lo scopo di questa serie. Per ulteriori informazioni sulla creazione e la modifica dei temi, consultare :ref:`doc_gui_skinning`.
ja: テーマリソースにさらにプロパティを追加して複雑なユーザーインターフェースを設計することもできますが、それはこのチュートリアルでは扱いません。テーマの作成と編集について詳しく知るには、 :ref:`doc_gui_skinning` を参照してください。
ko: 테마 리소스에 더 많은 속성을 추가하여 복잡한 사용자 인터페이스를 디자인할 수 있지만, 이는 본 문서의 범위를 벗어납니다. 테마의 생성과 편집에 대해 더 알고 싶다면 :ref:`doc_gui_skinning`을 참조하세요.
ta: சிக்கலான பயனர் இடைமுகங்களை வடிவமைக்க கருப்பொருள் வளத்தில் நீங்கள் கூடுதல் பண்புகளைச் சேர்க்கலாம், ஆனால் அது இந்தத் தொடரின் எல்லைக்கு அப்பாற்பட்டது. கருப்பொருள்களை உருவாக்குவது மற்றும் திருத்துவது பற்றி மேலும் அறிய, காண்க: குறிப்பு: `doc_gui_skinning`.
tr: Karmaşık kullanıcı arayüzleri tasarlamak için tema kaynağına daha fazla özellik ekleyebilirsiniz, ancak bunun nasıl yapılacağı bu serinin kapsamı dışındadır. Tema oluşturma ve düzenleme hakkında daha fazla bilgi edinmek için :ref:`doc_gui_skinning` bölümüne bakın.

source: The *Default Font* expects a font file like the ones you have on your computer. Two common font file formats are TrueType Font (TTF) and OpenType Font (OTF).
ga: Tá súil leis an g*Cló Réamhshocraithe* le comhad cló cosúil leis na cinn atá agat ar do ríomhaire. Is iad dhá fhormáid chomhaid cló coitianta ná TrueType Font (TTF) agus OpenType Font (OTF).
it: La proprietà *Default Font* si aspetta un file di font come quelli presenti sul tuo computer. Due formati di file di font comuni sono TrueType Font (TTF) e OpenType Font (OTF).
ja: *デフォルトフォント* は、お使いのコンピュータに既にあるようなフォントファイルを想定しています。一般的なフォントファイルの形式は次の2種類あります。TrueTypeフォント（TTF）とOpenTypeフォント（OTF）です。
ko: *Default Font*에는 컴퓨터에 있는 글꼴 파일을 사용합니다. 일반적인 글꼴 파일 형식으로는 TrueType Font (TTF)와 OpenType Font (OTF)가 있습니다.
ta: * இயல்புநிலை எழுத்துரு * உங்கள் கணினியில் உள்ளதைப் போன்ற எழுத்துரு கோப்பை எதிர்பார்க்கிறது. இரண்டு பொதுவான எழுத்துரு கோப்பு வடிவங்கள் TRUETYPE எழுத்துரு (TTF) மற்றும் OPENTYPE எழுத்துரு (OTF).
tr: *Varsayılan Yazı Tipi* bilgisayarınızda bulunanlara benzer bir yazı tipi dosyası bekler. İki yaygın font dosyası biçimi TrueType Font (TTF) ve OpenType Font'tur (OTF).

source: In the *FileSystem* dock, expand the ``fonts`` directory and click and drag the ``Montserrat-Medium.ttf`` file we included in the project onto the *Default Font*. The text will reappear in the theme preview.
ga: Sa duga*Filesystem*, leathnaigh an eolaire ``fonts`` agus cliceáil agus tarraing an comhad ``Montserrat-Medium.ttf`` a chuireamar san áireamh sa tionscadal chuig an g*Chont* Réamhshocraithe*. Beidh an téacs le feiceáil arís sa réamhamharc téama.
it: Nel pannello *FileSystem*, espandi la cartella ``fonts`` e trascina il file ``Montserrat-Medium.ttf`` incluso nel progetto su *Default Font*. Il testo riapparirà nell'anteprima del tema.
ja: 左下の *ファイルシステム* (FileSystem)ドックで ``fonts`` ディレクトリを展開し、プロジェクトに含まれている ``Montserrat-Medium.ttf`` ファイルを *インスペクター* ドックの *Theme* 内の *Default Font* の上までドラッグします。画面下の *テーマ* ドックの *デフォルトのプレビュー* 内のフォントが更新されます。
ko: *파일시스템* 독에서 ``fonts`` 디렉터리를 펼치고, 프로젝트에 포함된 ``Montserrat-Medium.ttf`` 파일을 *디폴트 글꼴*\ 로 드래그하세요. 그러면 테마 미리보기에서 텍스트가 다시 나타납니다.
ta: *கோப்பு முறைமை *கப்பல்துறையில், `` எழுத்துருக்கள்` `கோப்பகத்தை விரிவுபடுத்தி, திட்டத்தில் நாங்கள் சேர்த்த` `montserrat-medium.ttf`` கோப்பைக் சொடுக்கு செய்து இழுக்கவும் *இயல்புநிலை எழுத்துரு *. கருப்பொருள் முன்னோட்டத்தில் உரை மீண்டும் தோன்றும்.
tr: *DosyaSistemi* yuvasında ``fonts`` dizinini genişletin ve projeye dahil ettiğimiz ``Montserrat-Medium.ttf`` dosyasını tıklayıp *Varsayılan Yazı Tipi* üzerine sürükleyin. Metin tema önizlemesinde yeniden görünecektir.

source: The text is a bit small. Set the *Default Font Size* to ``22`` pixels to increase the text's size.
ga: Tá an téacs beagán beag. Socraigh an Chlómhéid Réamhshocraithe* go picteilín ``22`` chun méid an téacs a mhéadú.
it: Il testo è un po' piccolo. Imposta la proprietà *Default Font Size* a ``22`` pixel per aumentare le dimensioni del testo.
ja: このままだと文字が少し小さいので、 *Default Font Size* (デフォルトのフォントサイズ) を ``22`` ピクセルに設定して、文字のサイズを大きくしてください。
ko: 텍스트가 조금 작습니다. *디폴트 글꼴 크기*\ 를 ``22`` 픽셀로 설정하여 텍스트 크기를 늘리세요.
ta: உரை சற்று சிறியது. உரையின் அளவை அதிகரிக்க * இயல்புநிலை எழுத்துரு அளவு * `` 22`` பிக்சல்களாக அமைக்கவும்.
tr: Metin boyutu biraz küçük. Metnin boyutunu artırmak için *Varsayılan Yazı Tipi Boyutu* ayarını ``22`` piksel olarak ayarlayın.

source: |image7|
ga: |íomhá7|
ta: | படம் 7 |

source: image7
ga: íomhá 7
ta: படம் 7

source: Keeping track of the score
ga: Súil a choinneáil ar an scór
it: Tenere traccia del punteggio
ja: スコアの記録
ko: 점수 추적하기
ta: மதிப்பெண்ணைக் கண்காணித்தல்
tr: Puan takibini yapmak

source: Let's work on the score next. Attach a new script to the ``ScoreLabel`` and define the ``score`` variable.
ga: Déanaimis oibriú ar an scór eile. Ceangail script nua leis an ``scorelabel`` agus sainmhínigh an athróg ``scór ``.
it: Lavoriamo ora sul punteggio. Alleghiamo un nuovo script a ``ScoreLabel`` e definiamo la variabile ``score``.
ja: 次にスコア表示に取りかかりましょう。新しいスクリプトを ``ScoreLabel`` にアタッチし、 ``score`` という変数を定義してください。
ko: 다음으로 점수가 동작하게 해봅시다. ``ScoreLabel``\ 에 새로운 스크립트를 추가하고 ``score`` 변수를 정의하세요.
ta: அடுத்த ச்கோரில் வேலை செய்வோம். புதிய ச்கிரிப்டை `` ச்கோர்லேபிள்`` உடன் இணைத்து `` மதிப்பெண்`` மாறியை வரையறுக்கவும்.
tr: Şimdi puanlama üzerinde çalışalım. ``ScoreLabel`` 'a yeni bir betik ekleyin ve ``score`` değişkenini tanımlayın.

source: The score should increase by ``1`` every time we squash a monster. We can use their ``squashed`` signal to know when that happens. However, because we instantiate monsters from the code, we cannot connect the mob signal to the ``ScoreLabel`` via the editor.
ga: Ba chóir go méadódh an scór ag ``1`` gach uair a dhéanaimid ollphéist a scuabadh. Is féidir linn a gcomhartha ``squashed` a úsáid chun a fháil amach cathain a tharlaíonn sé sin. Mar sin féin, toisc go dtugaimid arrachtaigh ón gcód, ní féidir linn an comhartha mob a nascadh leis an “Scorelabel” tríd an eagarthóir.
it: Il punteggio dovrebbe aumentare di ``1`` ogni volta che schiacciamo un mostro. Possiamo usare il segnale ``squashed`` per sapere quando ciò accade. Tuttavia, poiché istanziamo i mostri da codice, non possiamo collegare il segnale di un mob a ``ScoreLabel`` tramite l'editor.
ja: 敵モンスターを踏んで倒すたびにスコアが ``1`` ずつ増えるように作ります。倒したイベントは ``squashed`` シグナルを使って検知できます。しかし、プログラムコードからモンスターをインスタンス化しているので、エディターを使ってモブキャラクターが送るシグナルを ``ScoreLabel`` に接続することはできません。
ko: 몬스터를 잡을 때마다 점수가 ``1``\ 씩 올라가도록 해야 합니다. 이를 위해 몬스터가 잡힐 때 발생하는 ``squashed`` 시그널을 사용할 수 있습니다. 다만, 몬스터를 코드에서 생성하기 때문에, 편집기에서 직접 mob 시그널을 ``ScoreLabel``\ 에 연결할 수는 없습니다.
ta: ஒவ்வொரு முறையும் நாம் ஒரு அரக்கனை ச்குவாச் செய்யும் போது மதிப்பெண் `` 1`` அதிகரிக்க வேண்டும். அது எப்போது நிகழ்கிறது என்பதை அறிய அவர்களின் `` ச்குவாச்ட்`` சமிக்ஞையைப் பயன்படுத்தலாம். இருப்பினும், நாங்கள் குறியீட்டிலிருந்து அரக்கர்களை நிறுவியதால், கும்பல் சமிக்ஞையை ஆசிரியர் வழியாக `` ச்கோரலேபிள்` உடன் இணைக்க முடியாது.
tr: Bir canavarı her ezdiğimizde puan ``1`` artmalıdır. Bunun ne zaman gerçekleştiğini bilmek için onların ``squashed`` sinyalini kullanabiliriz. Ancak, canavarları kodun içinden örneklediğimiz için, düşman sinyalini ``ScoreLabel``'a düzenleyici aracılığıyla bağlayamayız.

source: Instead, we have to make the connection from the code every time we spawn a monster.
ga: Ina áit sin, caithfimid an nasc a dhéanamh ón gcód gach uair a dhéanaimid ollphéist.
it: Invece, dobbiamo effettuare la connessione dal codice ogni volta che generiamo un mostro.
ja: その代わりに、モンスターを出現させるたびにコードから接続する必要があります。
ko: 그 대신에, 매번 몬스터를 소환할 때마다 코드로 연결해야 합니다.
ta: அதற்கு பதிலாக, ஒவ்வொரு முறையும் ஒரு அரக்கனை உருவாக்கும் போது குறியீட்டிலிருந்து இணைப்பை உருவாக்க வேண்டும்.
tr: Bunun yerine, bir canavarı her ortaya çıkardığımızda kodun içinden bağlantı kurmamız gerekir.

source: Open the script ``main.gd``. If it's still open, you can click on its name in the script editor's left column.
ga: Oscail an script ``main.gd``. Má tá sé fós oscailte, is féidir leat cliceáil ar a ainm i gcolún ar chlé an eagarthóra script.
it: Apri lo script ``main.gd``. Se è ancora aperto, puoi cliccare sul suo nome nella colonna di sinistra dell'editor di script.
ja: ``main.gd`` のスクリプトを開いてください。もしスクリプトファイルを開いたままでしたら、スクリプトエディタの左の列でファイル名をクリックして開くこともできます。
ko: ``main.gd`` 스크립트를 엽니다. 아직 열려 있다면, 스크립트 편집기의 왼쪽 열에서 이름을 클릭하여 열 수 있습니다.
ta: ச்கிரிப்டைத் திறக்கவும் `` main.gd``. அது இன்னும் திறந்திருந்தால், ச்கிரிப்ட் எடிட்டரின் இடது நெடுவரிசையில் அதன் பெயரைக் சொடுக்கு செய்யலாம்.
tr: ``main.gd`` betiğini açın. Hala açıksa, betik düzenleyicinin sol sütununda ismine tıklayabilirsiniz.

source: |image8|
ga: |íomhá8|
ta: | படம் 8 |

source: image8
ga: íomhá8
ta: படம் 8

source: Alternatively, you can double-click the ``main.gd`` file in the *FileSystem* dock.
ga: De rogha air sin, is féidir leat cliceáil faoi dhó ar an gcomhad ``main.gd`` sa duga*FileSystem*.
it: In alternativa, puoi fare doppio clic sul file ``main.gd`` nel pannello *FileSystem*.
ja: あるいは、 *ファイルシステム* (FileSystem)ドックにある ``main.gd`` ファイルをダブルクリックして開くこともできます。
ko: 또는 *파일시스템* 독에서 ``main.gd`` 파일을 더블 클릭하여 열 수도 있습니다.
ta: மாற்றாக, * கோப்பு முறைமை * கப்பல்துறையில் `` main.gd`` கோப்பை இருமுறை சொடுக்கு செய்யலாம்.
tr: Alternatif olarak, *DosyaSistemi* yuvasındaki ``main.gd`` dosyasına çift tıklayabilirsiniz.

source: At the bottom of the ``_on_mob_timer_timeout()`` function, add the following line:
ga: Ag bun an fheidhm ``_on_mob_timer_timeout () ``, cuir an líne seo a leanas leis:
it: In fondo alla funzione ``_on_mob_timer_timeout()``, aggiungi la seguente riga:
ja: そして ``_on_mob_timer_timeout()`` 関数の末尾に以下の行を追加してください：
ko: ``_on_mob_timer_timeout()`` 함수의 하단에 다음 줄을 추가하세요:
ta: `` _ON_MOB_TIMER_TIMEOUT () `` செயல்பாட்டின் கீழே, பின்வரும் வரியைச் சேர்க்கவும்:
tr: ``_on_mob_timer_timeout()`` fonksiyonunun en altına aşağıdaki satırı ekleyin:

source: This line means that when the mob emits the ``squashed`` signal, the ``ScoreLabel`` node will receive it and call the function ``_on_mob_squashed()``.
ga: Ciallaíonn an líne seo nuair a astaíonn an mob an comhartha ``squashed`, go bhfaighidh an nód ``scorelabel ``é agus glaoidh sé an fheidhm ``_on_mob_squashed ()``.
it: Questa riga significa che quando il mob emette il segnale ``squashed``, il nodo ``ScoreLabel`` lo riceverà e chiamerà la funzione ``_on_mob_squashed()``.
ja: この処理は、モブキャラクターが ``squashed`` シグナルを出力すると、 ``ScoreLabel`` ノードがそれを受け取り、 ``_on_mob_squashed()`` 関数を呼び出すという処理です。
ko: 이 라인은 mob가 ``squashed`` 시그널을 보낼 때 ``ScoreLabel`` 노드가 이를 받아 ``_on_mob_squashed()`` 함수를 호출하도록 한다는 의미입니다.
ta: இந்த வரி, கும்பல் `` ச்குவாச் செய்யப்பட்ட` சமிக்ஞையை வெளியிடும்போது, `` ச்கோரலேபிள்`` முனை அதைப் பெற்று `` _on_mob_squashed () `` என்ற செயல்பாட்டை அழைக்கும்.
tr: Bu satır, düşman ``squashed`` sinyalini yaydığında, ``ScoreLabel`` düğümünün bunu alacağı ve ``_on_mob_squashed()`` fonksiyonunu çağıracağı anlamına gelir.

source: Head back to the ``score_label.gd`` script to define the ``_on_mob_squashed()`` callback function.
ga: Téigh ar ais go dtí an script ``score_label.gd`` chun an fheidhm glaonna ``_on_mob_squashed () ``a shainiú.
it: Ritorna allo script ``score_label.gd`` per definire la funzione di callback ``_on_mob_squashed()``.
ja: ``score_label.gd`` のスクリプトを再度開いて、呼び出される ``_on_mob_squashed()`` 関数を定義しましょう。
ta: `` _On_mob_squashed () `` கால்பேக் செயல்பாட்டை வரையறுக்க `` score_label.gd`` ச்கிரிப்டுக்குத் திரும்புக.
tr: ``_on_mob_squashed()`` geri çağırma fonksiyonunu tanımlamak için ``score_label.gd`` betiğine geri dönün.
