Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/08.score_and_replay.po
Languages: ga, it, ja, ko, ta, tr

source: There, we increment the score and update the displayed text.
ga: Ansin, méadaíonn muid an scór agus nuashonraímid an téacs a thaispeántar.
it: Da qui, incrementiamo il punteggio e aggiorniamo il testo visualizzato.
ja: ここでスコアの得点を追加し、表示されているテキストを更新します。
ko: 여기서 점수를 증가시키고 화면에 표시되는 텍스트를 업데이트합니다.
ta: அங்கு, நாங்கள் மதிப்பெண்ணை அதிகரிக்கிறோம் மற்றும் காட்டப்படும் உரையை புதுப்பிக்கிறோம்.
tr: Burada, puanı artırır ve görüntülenen metni güncelleriz.

source: The second line uses the value of the ``score`` variable to replace the placeholder ``%s``. When using this feature, Godot automatically converts values to string text, which is convenient when outputting text in labels or when using the ``print()`` function.
ga: Úsáideann an dara líne luach an athróg ``scór ``chun an sealbhóir áit ``%s`` a athsholáthar. Agus an ghné seo á úsáid agat, athraíonn Godot luachanna go téacs sreangán go huathoibríoch, rud atá áisiúil agus téacs á aschur i lipéid nó nuair a bhíonn an fheidhm “print ()” á úsáid agat.
it: La seconda riga utilizza il valore della variabile ``score`` per sostituire il segnaposto ``%s``. Quando si utilizza questa funzione, Godot converte automaticamente i valori in testo, il che è utile per mostrare testo nelle etichette o per utilizzare la funzione ``print()``.
ja: 2行目の処理( `text = ...` )は ``score`` 変数の値を使って ``%s`` の部分を置き換えています。この機能を使用すると、Godot は自動的に値を文字列型に変換するので、ラベルにテキストを出力するときや ``print()`` 関数を使用するときに便利です。
ko: 두 번째 줄에서는 ``score`` 변수의 값을 ``%s``\ 에 대체하여 사용합니다. 이 기능을 사용하면 Godot가 자동으로 값을 문자열로 변환해 주기 때문에, 레이블에 텍스트를 출력하거나 ``print()`` 함수를 사용할 때 편리합니다.
ta: இரண்டாவது வரி ஒதுக்கிடத்தை மாற்றுவதற்கு `` மதிப்பெண்` `மாறியின் மதிப்பைப் பயன்படுத்துகிறது` `%s``. இந்த அம்சத்தைப் பயன்படுத்தும் போது, கோடோட் தானாகவே மதிப்புகளை சரம் உரையாக மாற்றுகிறது, இது லேபிள்களில் உரையை வெளியிடும்போது அல்லது `` அச்சு () `` செயல்பாட்டைப் பயன்படுத்தும் போது வசதியானது.
tr: İkinci satır ``%s`` yer tutucusunu değiştirmek için ``score`` değişkeninin değerini kullanır. Bu özelliği kullanırken, Godot değerleri otomatik olarak metin dizesine dönüştürür, bu da etiketlerde metin çıktısı alırken veya ``print()`` işlevini kullanırken kullanışlıdır.

source: You can learn more about string formatting here: :ref:`doc_gdscript_printf`. In C#, consider using `string interpolation with "$" <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated>`_.
ga: Is féidir leat tuilleadh a fhoghlaim faoi fhormáidiú teaghrán anseo: :ref: `doc_gdscript_printf`. In C#, smaoinigh ar `idirshuíomh teaghrán a úsáid le "$" <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated>`_.
it: Puoi saperne di più sulla formattazione delle stringhe qui: :ref:`doc_gdscript_printf`. In C#, considera di utilizzare l'`interpolazione di stringhe con "$" <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated>`_.
ja: 文字列のフォーマットについてはこちら( :ref:`doc_gdscript_printf`)で詳しく説明されています。C#では、 `"$"を使った文字列補間 <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated>`_ を参照してください。
ko: 문자열 포맷팅에 대해 더 알고 싶다면 :ref:`doc_gdscript_printf`를 참조하세요. C#에서는 `문자열 보간법 ("$") <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated>`_ 을 확인해 보세요.
ta: சரம் வடிவமைப்பைப் பற்றி இங்கே மேலும் அறியலாம் :: குறிப்பு: `doc_gdscript_printf`. சி#இல், "$" <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated> `_ உடன்` சரம் இடைக்கணிப்பைப் பயன்படுத்துவதைக் கவனியுங்கள்.
tr: Dize biçimlendirme hakkında daha fazla bilgiyi burada bulabilirsiniz: :ref:`doc_gdscript_printf`. C# için `"$" ile dize ara değerlemesi <https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/tokens/interpolated>`_ kullanmayı düşünün.

source: You can now play the game and squash a few enemies to see the score increase.
ga: Is féidir leat an cluiche a imirt anois agus scvoiceáil cúpla naimhde chun an scór méadú a fheiceáil.
it: Ora puoi giocare e schiacciare un po' di nemici per vedere il punteggio aumentare.
ja: これでゲームをプレイすると、敵を踏んで倒すたびにスコアが増えていくのを確認できるようになりました。
ko: 이제 게임을 실행해 적을 잡아보면 점수가 올라가는 것을 확인할 수 있습니다.
ta: மதிப்பெண் அதிகரிப்பதைக் காண நீங்கள் இப்போது விளையாட்டை விளையாடலாம் மற்றும் சில எதிரிகளை ச்குவாச் செய்யலாம்.
tr: Artık oyunu oynayabilir ve birkaç düşmanı ezerek puanın arttığını görebilirsiniz.

source: |image9|
ga: |íomhá9|
ta: | படம் 9 |

source: image9
ga: íomhá9

source: In a complex game, you may want to completely separate your user interface from the game world. In that case, you would not keep track of the score on the label. Instead, you may want to store it in a separate, dedicated object. But when prototyping or when your project is simple, it is fine to keep your code simple. Programming is always a balancing act.
ga: I gcluiche casta, b'fhéidir gur mhaith leat do chomhéadan úsáideora a scaradh go hiomlán ó shaol an chluiche. Sa chás sin, ní choimeádfá súil ar an scór ar an lipéad. Ina áit sin, b'fhéidir gur mhaith leat é a stóráil i réad tiomnaithe ar leith. Ach nuair a bhíonn fréamhshamhaltú nó nuair a bhíonn do thionscadal simplí, tá sé ceart go leor do chód a choinneáil simplí. Is gníomh cothromaithe é an ríomhchlárú i gcónaí.
it: In un gioco complesso, potresti voler separare completamente l'interfaccia utente dal mondo di gioco. In tal caso, non terresti traccia del punteggio sull'etichetta. Invece, potresti volerlo memorizzare in un oggetto separato e dedicato. Ma durante la prototipazione o quando il progetto è semplice, è bene mantenere il codice semplice. La programmazione è sempre un atto di bilanciamento.
ja: 複雑なゲームでは、ユーザーインターフェイスをゲームの世界から完全に切り離したい場合があります。そのような場合、ラベルにスコアを表示させることもなくなるかもしれません。その代わりに、スコアを別の専用オブジェクトに格納することもできます。しかし、試作品のゲームやシンプルなプロジェクトの場合には、コードをシンプルなままにしておくのも良いでしょう。プログラミングは、常にバランスを取って進めることが大切です。
ko: 복잡한 게임에서는 사용자 인터페이스를 게임 세계와 완전히 분리하고 싶을 수도 있습니다. 그런 경우 레이블에서 점수를 관리하지 않고, 별도의 객체에 저장할 수 있습니다. 그러나 프로토타입 단계나 간단한 프로젝트에서는 코드를 간단하게 유지하는 것이 좋습니다. 프로그래밍은 항상 균형을 맞추는 작업입니다.
ta: ஒரு சிக்கலான விளையாட்டில், உங்கள் பயனர் இடைமுகத்தை விளையாட்டு உலகத்திலிருந்து முழுமையாக பிரிக்க விரும்பலாம். அவ்வாறான நிலையில், நீங்கள் லேபிளில் மதிப்பெண்ணைக் கண்காணிக்க மாட்டீர்கள். அதற்கு பதிலாக, நீங்கள் அதை ஒரு தனி, அர்ப்பணிப்பு பொருளில் சேமிக்க விரும்பலாம். ஆனால் முன்மாதிரி செய்யும் போது அல்லது உங்கள் திட்டம் எளிமையானதாக இருக்கும்போது, உங்கள் குறியீட்டை எளிமையாக வைத்திருப்பது நல்லது. நிரலாக்கமானது எப்போதும் ஒரு சமநிலைப்படுத்தும் செயல்.
tr: Karmaşık bir oyunda, kullanıcı arayüzünüzü oyun dünyasından tamamen ayırmak isteyebilirsiniz. Bu durumda, puanlamayı etiket üzerinde takip etmezsiniz. Bunun yerine, bunu ayrı, özel bir nesnede saklamak isteyebilirsiniz. Ancak prototip oluştururken veya projeniz basit olduğunda, kodunuzu basit tutmanızda bir sakınca yoktur. Programlama her zaman dengeleyici bir eylemdir.

source: Retrying the game
ga: Aththriail a dhéanamh ar an gcluiche
it: Riprovare il gioco
ja: ゲームをリトライする
ko: 게임 다시 플레이
ta: விளையாட்டை மீண்டும் புதுப்பித்தல்
tr: Oyunu yeniden başlatmak

source: We'll now add the ability to play again after dying. When the player dies, we'll display a message on the screen and wait for input.
ga: Cuirfimid an cumas imirt arís leis anois tar éis bás a fháil. Nuair a fuair an t-imreoir bás, taispeánfaimid teachtaireacht ar an scáileán agus fanfaimid le hionchur.
it: Adesso aggiungeremo l'abilita di giocare nuovamente dopo essere morti. Quando il giocatore muore, mostreremo un messaggio sullo schermo e aspetteremo un input.
ja: ゲームオーバーになった後にリトライできる機能を追加します。プレイヤーがゲームオーバーになった場合、画面にメッセージを表示して入力を待つ機能を作ります。
ko: 이제 죽은 후에 다시 플레이할 수 있는 기능을 추가해 보겠습니다. 플레이어가 죽으면 화면에 메시지를 표시하고 입력을 기다리도록 할 것입니다.
ta: இறந்த பிறகு மீண்டும் விளையாடும் திறனை இப்போது சேர்ப்போம். பிளேயர் இறக்கும் போது, நாங்கள் திரையில் ஒரு செய்தியைக் காண்பிப்போம், உள்ளீட்டிற்காக காத்திருப்போம்.
tr: Şimdi, öldükten sonra tekrar oynama yeteneğini ekleyeceğiz. Oyuncu öldüğünde, ekranda bir mesaj göstereceğiz ve bir girdi bekleyeceğiz.

source: Head back to the ``main.tscn`` scene, select the ``UserInterface`` node, add a child node :ref:`ColorRect <class_ColorRect>`, and name it ``Retry``. This node fills a rectangle with a uniform color and will serve as an overlay to darken the screen.
ga: Fill ar an radharc ``main.tscn``, roghnaigh an nód `` UserInterface``, cuir nód linbh leis :ref:`ColorRect <class_ColorRect>`, agus ainmnigh ``Retry`` é. Líonann an nód seo dronuilleog le dath aonfhoirmeach agus feidhmeoidh sé mar fhorleagan chun an scáileán a dhorchaiú.
it: Ritorna alla scena ``main.tscn``, seleziona il nodo ``UserInterface``, aggiungi un nodo figlio :ref:`ColorRect <class_ColorRect>` e chiamalo ``Retry``. Questo nodo riempie un rettangolo con un colore uniforme e fungerà da rivestimento per scurire lo schermo.
ja: ``main.tscn`` シーンに戻り、 ``UserInterface`` ノードを選択し、子ノードとして :ref:`ColorRect <class_ColorRect>` を追加し、名前を ``Retry`` とします。このノードは長方形を単色で塗りつぶし、画面を暗くするオーバーレイとして機能します。
ko: ``main.tscn`` 씬으로 돌아가서 ``UserInterface`` 노드를 선택한 후, 자식 노드로 :ref:`ColorRect <class_ColorRect>`를 추가하고 이름을 ``Retry``로 설정하세요. 이 노드는 화면을 어둡게 하는 오버레이로 사용될 단색 사각형을 채우는 역할을 합니다.
ta: `` Main.tscn`` காட்சிக்குத் திரும்பிச் செல்லுங்கள், `` பயனர் இன்டர்ஃபேச்`` முனையைத் தேர்ந்தெடுத்து, ஒரு குழந்தை முனையைச் சேர்க்கவும்: குறிப்பு: `வண்ணம் <class_colorrect>` என்று பெயரிடுங்கள். இந்த முனை ஒரு சீரான நிறத்துடன் ஒரு செவ்வகத்தை நிரப்புகிறது மற்றும் திரையை இருட்டடிப்பதற்கான மேலடுக்காக செயல்படும்.
tr: ``main.tscn`` sahnesine geri dönün, ``UserInterface`` düğümünü seçin, bir :ref:`ColorRect <class_ColorRect>` (renk dörtgeni) alt düğümünü ekleyin ve ``Retry`` (tekrar dene) adını verin. Bu düğüm bir dikdörtgeni tek tip bir renkle doldurur ve ekranı karartmak için bir kaplama görevi görür.

source: To make it span over the whole viewport, you can use the *Anchor Preset* menu in the toolbar.
ga: Chun é a dhéanamh thar an radharcphoirt iomlán, is féidir leat an roghchláir* Anchor Réamh* a úsáid sa uirlisí uirlisí.
it: Per estenderlo sull'intera finestra, puoi utilizzare il menu *Preimpostazioni di ancoraggio* nella barra degli strumenti.
ja: ビューポート全体を覆うようにするには、ツールバーの *Anchor Preset* (アンカーのプリセット)メニューを使用します。
ko: 이 노드가 뷰포트 전체를 덮도록 하려면, 툴바의 *Anchor Preset* 메뉴를 사용하세요.
ta: முழு காட்சியகத்தையும் விட, கருவிப்பட்டியில் * நங்கூரம் முன்னமைவு * மெனுவைப் பயன்படுத்தலாம்.
tr: Tüm çerçeveye yayılmasını sağlamak için araç çubuğundaki *Çapa Hazır Ayarı* menüsünü kullanabilirsiniz.

source: |image10|
ga: |íomhá10|
ta: | படம் 10 |

source: image10
ga: íomhá10
ta: படம் 10

source: Open it and apply the *Full Rect* command.
ga: Oscail é agus cuir an t-ordú* Full Rect* i bhfeidhm.
it: Aprilo e applica il comando *Rettangolo completo*.
ja: メニューを開いて、 *Rect全面* (Full Rect)を適用します。
ko: 메뉴를 열고 *공간 전체* 명령을 적용하세요.
ta: அதைத் திறந்து * முழு செவ்வகம் * கட்டளையைப் பயன்படுத்துங்கள்.
tr: Açın ve *Tam Dörtgen* komutunu uygulayın.

source: |image11|
ga: |íomhá11|
ta: | படம் 11 |

source: image11
ga: íomhá11
ta: படம் 11

source: Nothing happens. Well, almost nothing; only the four green pins move to the corners of the selection box.
ga: Ní tharlaíonn aon rud. Bhuel, beagnach rud ar bith; ní bhogann ach na ceithre bioráin ghlasa chuig coirnéil an bhosca roghnaithe.
it: Nulla è successo. Beh, quasi nulla; solo i quattro spilli verdi si spostano agli angoli del riquadro di selezione.
ja: まだ何も起こっていません。少なくとも、ほとんど何も起こっていません。緑色の4本のピンが選択中のボックスの隅に移動するだけです。
ko: 아직 아무 일도 일어나지 않았습니다. 정확히는 거의 아무 변화도 없고, 초록색 핀 4개만 선택 상자의 모서리로 이동했습니다.
ta: எதுவும் நடக்காது. சரி, கிட்டத்தட்ட எதுவும் இல்லை; நான்கு பச்சை ஊசிகளும் மட்டுமே தேர்வு பெட்டியின் மூலைகளுக்கு நகர்கின்றன.
tr: Hiçbir şey olmuyor. Yani, neredeyse hiçbir şey; sadece dört yeşil iğne seçim kutusunun köşelerine gidiyor.

source: |image12|
ga: |íomhá12|
ta: | படம் 12 |

source: image12
ga: íomhá12
ta: படம் 12

source: This is because UI nodes (all the ones with a green icon) work with anchors and margins relative to their parent's bounding box. Here, the ``UserInterface`` node has a small size and the ``Retry`` one is limited by it.
ga: Tá sé seo toisc go n-oibríonn nóid Chomhéadain (na cinn go léir a bhfuil deilbhín glas acu) le ancair agus corrlach i gcoibhneas le bosca teorainneacha a dtuismitheora. Anseo, tá méid beag ag an nód ``UserInterface`` agus tá an ceann ``Retry ``teoranta aige.
it: Questo perché i nodi dell'interfaccia utente (tutti quelli con un'icona verde) funzionano con ancore e margini relativi al riquadro di delimitazione del nodo genitore. In questo caso, il nodo ``UserInterface`` ha dimensioni ridotte e il nodo ``Retry`` è limitato da queste.
ja: これは、UIノード（緑色のアイコンが付いているものすべて）が、親ノードに紐づく長方形を起点にして、相対的なアンカーと余白で動作するためです。ここでは、 ``UserInterface`` ノードのサイズが小さいので、子ノードである ``Retry`` ノードのサイズが制限されています。
ko: 이는 UI 노드(녹색 아이콘이 표시된 모든 노드)가 부모 노드의 선택 상자를 기준으로 anchor와 margin을 사용하기 때문입니다. 여기서 ``UserInterface`` 노드는 크기가 작으며, ``Retry`` 노드는 그에 의해 제한됩니다.
ta: ஏனென்றால், யுஐ முனைகள் (பச்சை படவுரு கொண்டவை அனைத்தும்) பெற்றோரின் எல்லைப் பெட்டியுடன் ஒப்பிடும்போது நங்கூரங்கள் மற்றும் விளிம்புகளுடன் வேலை செய்கின்றன. இங்கே, `` பயனர் இன்டர்ஃபேச்`` முனை ஒரு சிறிய அளவைக் கொண்டுள்ளது, மேலும் `` மீண்டும் முயற்சிக்கவும்` ஒன்று இது வரையறுக்கப்பட்டுள்ளது.
tr: Bunun nedeni, kullanıcı arabirimi düğümlerinin (yeşil simgeli olanların tümü) üst ögelerinin sınırlayıcı kutusuna göreceli olarak çapa ve kenar boşluklarıyla çalışmasıdır. Burada, ``UserInterface`` düğümü küçük bir boyuta sahiptir ve ``Retry`` düğümü bununla sınırlıdır.

source: Select the ``UserInterface`` and apply *Anchor Preset -> Full Rect* to it as well. The ``Retry`` node should now span the whole viewport.
ga: Roghnaigh an `` Comhéadan Úsáideora`` agus cuir *Ancaire Réamhshocrú -> Iomlán Rect * i bhfeidhm air freisin. Ba chóir go gcuimsíonn an nód ``Retry`` an radharc iomlán anois.
it: Seleziona ``UserInterface`` e applica anche *Preimpostazione di ancoraggio -> Rettangolo completo*. Il nodo ``Retry`` dovrebbe ora estendersi sull'intera viewport.
ja: ``UserInterface`` を選択し、インスペクターから *Layout* -> *Anchors Preset* -> *Rect全面* (Full Rect)を適用します。これで ``Retry`` ノードがビューポート全体に広がるはずです。
ko: ``UserInterface`` 노드를 선택하고 거기에도 *앵커 프리셋 -> 공간 전체*를 적용합니다. ``Retry`` 노드가 이제 전체 뷰포트에 걸쳐 있어야 합니다.
ta: `` பயனர் இன்டர்ஃபேச்`` ஐத் தேர்ந்தெடுத்து, * நங்கூரம் முன்னமைவு -> முழு செவ்வகத்தை * பயன்படுத்தவும். `` மீண்டும் முயற்சிக்கவும்`` இப்போது முழு காட்சியகத்தையும் பரப்ப வேண்டும்.
tr: ``UserInterface`` düğümünü seçin ve ona da *Çapa Hazır Ayarı -> Tam Dörtgen* uygulayın. ``Retry`` düğümü artık tüm görüntü alanını kaplamalıdır.

source: Let's change its color so it darkens the game area. Select ``Retry`` and in the *Inspector*, set its *Color* to something both dark and transparent. To do so, in the color picker, drag the *A* slider to the left. It controls the color's Alpha channel, that is to say, its opacity/transparency.
ga: Déanaimis a dath a athrú ionas go ddorchóidh sé an limistéar cluiche. Roghnaigh ``Retry ``agus san * Cigireoir*, socraigh ai*Dath* go rud dorcha agus trédhearcach. Chun é sin a dhéanamh, sa phiocóir dathanna, tarraing an sleamhnán* A* ar chlé. Rialaíonn sé cainéal Alfa an datha, is é sin le rá, a éagsúlacht/trédhearcacht.
it: Cambiamo il suo colore in modo che scurisca l'area di gioco. Seleziona ``Retry`` e nell'*Ispettore*, imposta il suo *Color* su qualcosa di scuro e trasparente. Per farlo, nel selettore colore, trascina lo slider *A* verso sinistra. Questo controlla il canale alfa del colore, ovvero la sua opacità/trasparenza.
ja: その色を変えて、ゲームエリアを暗くしましょう。 ``Retry`` を選択し、 *インスペクター* (Inspector)ドックで *Color* を暗くて透明なものに設定します。これを行うには、カラーピッカー内で *A* スライダーを左にドラッグします。このスライダーは色のアルファ値、つまり不透明度／透明度をコントロールするスライダーです。
ko: 이제 화면을 어둡게 만들기 위해 색상을 변경해 봅시다. ``Retry`` 노드를 선택하고 *인스펙터*에서 *Color*를 어두우면서도 투명한 색으로 설정합니다. 이를 위해 색상 선택기에서 *A* 슬라이더를 왼쪽으로 드래그하세요. 이 슬라이더는 색상의 알파(Alpha)값, 즉 불투명도/투명도를 제어할 수 있습니다.
ta: அதன் நிறத்தை மாற்றுவோம், அதனால் அது விளையாட்டு பகுதியை இருட்டடிக்கிறது. `` மீண்டும் முயற்சி செய்யுங்கள்` `மற்றும் *இன்ச்பெக்டர் *இல், அதன் *வண்ணத்தை *இருண்ட மற்றும் வெளிப்படையான ஒன்றுக்கு அமைக்கவும். அவ்வாறு செய்ய, வண்ண பிக்கரில், * A * ச்லைடரை இடதுபுறமாக இழுக்கவும். இது வண்ணத்தின் ஆல்பா சேனலைக் கட்டுப்படுத்துகிறது, அதாவது அதன் ஒளிபுகா/வெளிப்படைத்தன்மை.
tr: Oyun alanını koyulaştırması için rengini değiştirelim. ``Retry`` seçin ve *Denetleyici*'de *Renk* özelliğini hem koyu hem de şeffaf bir renge ayarlayın. Bunu yapmak için, renk seçicide *A* sürgüsünü sola kaydırın. Bu, rengin Alfa kanalını, yani saydamlığını/şeffaflığını kontrol eder.

source: |image13|
ga: |íomh13|
ta: | படம் 13 |

source: image13
ga: íomh13
ta: படம் 13

source: Next, add a :ref:`Label <class_Label>` as a child of ``Retry`` and give it the *Text* "Press Enter to retry." To move it and anchor it in the center of the screen, apply *Anchor Preset -> Center* to it.
ga: Ansin, cuir :ref:`Lipéad <class_Label>` leis mar leanbh de ``Atriail`` agus tabhair an *Text * "Brúigh Enter chun triail eile a bhaint as." Chun é a bhogadh agus é a chrochadh i lár an scáileáin, cuir *Anchor Preset -> Center* i bhfeidhm air.
it: Successivamente, aggiungi un nodo :ref:`Label <class_Label>` come figlio di ``Retry`` e assegnagli su *Text* il testo "Press Enter to retry". Per spostarla e ancorarla al centro dello schermo, applicagli *Preimpostazioni di ancoraggio -> Al centro*.
ja: 次に、 :ref:`Label <class_Label>` を ``Retry`` の子ノードとして追加し、インスペクター内の *Text* の項目に "Press Enter to retry." と入力します。この :ref:`Label <class_Label>` を動かして画面の中央に固定するには、 *Anchors Preset* の項目を *中央* (Center)に設定してください。
ta: அடுத்து, A: ref: `லேபிள் <class_label>` `` `மீண்டும் முயற்சிக்கவும்`` என்ற குழந்தையாக * உரையை * "மீண்டும் முயற்சிக்கவும் Enter ஐ அழுத்தவும்." அதை நகர்த்தவும், திரையின் மையத்தில் நங்கூரமிடவும், * நங்கூரம் முன்னமைவு -> மையத்தை * அதைப் பயன்படுத்துங்கள்.
tr: Ardından, ``Retry`` ögesinin alt ögesi olarak bir :ref:`Label <class_Label>` ekleyin ve ona *Text* "Yeniden denemek için Enter tuşuna basın." ifadesini verin. Bunu taşımak ve ekranın ortasına sabitlemek için *Çapa Hazır Ayarı -> Merkez* uygulayın.

source: |image14|
ga: |íomh14|
ta: | படம் 14 |

source: image14
ga: íomh14
ta: படம் 14

source: Coding the retry option
ga: An rogha aththriail a chódú
it: Programmare l'opzione per riprovare
ja: リトライの機能をコーディングする
ko: 재시작 옵션 코딩
ta: மறுபயன்பாட்டு விருப்பத்தை குறியிடுதல்
tr: Yeniden deneme seçeneğini kodlamak

source: We can now head to the code to show and hide the ``Retry`` node when the player dies and plays again.
ga: Is féidir linn dul chuig an gcód anois chun an nód ``Retry ``a thaispeáint agus a cheilt nuair a fhaigheann an t-imreoir bás agus ag imirt arís.
it: Ora possiamo passare al codice per mostrare e nascondere il nodo ``Retry`` quando il giocatore muore e ricomincia a giocare.
ja: プレイヤーがゲームオーバーになってリトライするときに ``Retry`` ノードを表示したり隠したりするコードにもう一度、取りかかりましょう。
ko: 이제 플레이어가 죽었을 때와 다시 플레이할 때 ``Retry`` 노드를 표시하거나 숨기는 코드를 작성할 차례입니다.
ta: வீரர் இறந்து மீண்டும் விளையாடும்போது `` மீண்டும் முயற்சி செய்யுங்கள்` முனையைக் காட்டவும் மறைக்கவும் இப்போது குறியீட்டிற்குச் செல்லலாம்.
tr: Artık oyuncu öldüğünde ve tekrar oynadığında ``Retry`` düğümünü göstermek ve gizlemek için koda gidebiliriz.

source: Open the script ``main.gd``. First, we want to hide the overlay at the start of the game. Add this line to the ``_ready()`` function.
ga: Oscail an script ``main.gd``. Ar dtús, ba mhaith linn an forleagan a cheilt ag tús an chluiche. Cuir an líne seo leis an bhfeidhm ``_ready () ``.
it: Apri lo script ``main.gd``. Per prima cosa, vogliamo nascondere il rivestimento all'inizio del gioco. Aggiungi questa riga alla funzione ``_ready()``.
ja: ``main.gd`` のスクリプトを開いてください。まず、ゲーム開始時点ではリトライするオーバーレイを隠しておく必要があります。そこで次の行を ``_ready()`` 関数に追加してください。
ko: ``main.gd`` 스크립트를 엽니다. 먼저 게임 시작 시 오버레이를 숨기고자 합니다. 이를 위해 ``_ready()`` 함수에 다음 줄을 추가하세요.
ta: ச்கிரிப்டைத் திறக்கவும் `` main.gd``. முதலில், விளையாட்டின் தொடக்கத்தில் மேலடுக்கை மறைக்க விரும்புகிறோம். இந்த வரியை `` _ready () `` செயல்பாட்டில் சேர்க்கவும்.
tr: ``main.gd`` betiğini açın. İlk olarak, oyunun başlangıcında bu kaplamayı gizlemek istiyoruz. Bu satırı ``_ready()`` fonksiyonuna ekleyin.

source: Then, when the player gets hit, we show the overlay.
ga: Ansin, nuair a bhuaileann an t-imreoir, taispeánfaimid an forleagan.
it: Poi, quando il giocatore viene colpito, mostriamo il rivestimento.
ja: そして、プレイヤーが敵から攻撃を受けた時にオーバーレイを表示します。
ko: 이제, 플레이어가 타격받았을 때, 오버레이가 표시됩니다.
ta: பின்னர், வீரர் அடிபடும்போது, மேலடுக்கைக் காட்டுகிறோம்.
tr: Sonra, oyuncu vurulduğunda, kaplamayı gösteriyoruz.

source: Finally, when the ``Retry`` node is visible, we need to listen to the player's input and restart the game if they press enter. To do this, we use the built-in ``_unhandled_input()`` callback, which is triggered on any input.
ga: Faoi dheireadh, nuair a bhíonn an nód ``Retry ``le feiceáil, ní mór dúinn éisteacht le hionchur an imreora agus an cluiche a atosú má bhrúigh siad enter. Chun seo a dhéanamh, úsáidimid an glaoch ais-ionsuite ``_unhandled_input () ``, a spreagtar ar aon ionchur.
it: Infine, quando il nodo ``Retry`` è visibile, dobbiamo ascoltare l'input del giocatore e riavviare il gioco se preme Invio. Per fare ciò, utilizziamo il callback integrato ``_unhandled_input()``, che viene attivato a ogni input.
ja: 最後に、 ``Retry`` ノードが表示されたら、プレイヤーの入力待ち状態にして、プレイヤーがエンターキーを押したらゲームをリスタートする必要があります。これを行うにはGodotに既に用意されている ``_unhandled_input()`` コールバック関数を使用します。この関数はプレイヤーがどんなキーを押しても動作する関数です。
ko: 마지막으로, ``Retry`` 노드가 표시될 때 플레이어의 입력을 감지해, 엔터 키를 누르면 게임을 다시 시작해야 합니다. 이를 위해, 모든 입력에서 호출되는 내장 콜백 함수 ``_unhandled_input()``를 이용할 것입니다.
ta: இறுதியாக, `` மீண்டும் முயற்சிக்கவும்`` காணப்படும்போது, வீரரின் உள்ளீட்டைக் கேட்டு, அவர்கள் ENTER ஐ அழுத்தினால் விளையாட்டை மறுதொடக்கம் செய்ய வேண்டும். இதைச் செய்ய, உள்ளமைக்கப்பட்ட `` _unhandled_input () `` கால்பேக், இது எந்த உள்ளீட்டிலும் தூண்டப்படுகிறது.
tr: Son olarak, ``Retry`` düğümü görünür olduğunda, oyuncu girdisini dinlememiz ve enter tuşuna basarsa oyunu yeniden başlatmamız gerekir. Bunu yapmak için, herhangi bir girdide tetiklenen yerleşik ``_unhandled_input()`` geri çağırmasını kullanıyoruz.

source: If the player pressed the predefined ``ui_accept`` input action and ``Retry`` is visible, we reload the current scene.
ga: Má bhrúigh an t-imreoir an gníomh ionchuir réamhshainithe ``ui_accept`` agus má tá ``Retry ``le feiceáil, déanaimid an radharc reatha a athluchtú.
it: Se il giocatore ha premuto l'azione di input predefinita ``ui_accept`` e ``Retry`` è visibile, ricarichiamo la scena attuale.
ja: プレイヤーが ``ui_accept`` としてあらかじめ設定しておいた入力を行い、その時に ``Retry`` オーバーレイが表示されている場合、現在のシーンをリロードします。
ko: ``Retry``\ 가 보이는 상태에서 플레이어가 미리 정의된 ``ui_accept``\ 를 입력하면, 현재 씬을 다시 불러옵니다.
ta: முன் வரையறுக்கப்பட்ட `` ui_accept` உள்ளீட்டு செயலை வீரர் அழுத்தி `` மீண்டும் முயற்சிக்கவும்` தெரிந்தால், தற்போதைய காட்சியை மீண்டும் ஏற்றுகிறோம்.
tr: Oyuncu ön tanımlı ``ui_accept`` giriş eylemine bastıysa ve ``Retry`` görünür durumdaysa, mevcut sahneyi yeniden yükleriz.

source: The function ``get_tree()`` gives us access to the global :ref:`SceneTree <class_SceneTree>` object, which allows us to reload and restart the current scene.
ga: Tugann an fheidhm ``get_tree()`` rochtain dúinn ar an réad domhanda :ref:`SceneTree <class_SceneTree>`, a ligeann dúinn an radharc reatha a athlódáil agus a atosú.
it: La funzione ``get_tree()`` ci dà accesso all'oggetto globale :ref:`SceneTree <class_SceneTree>`, che ci consente di ricaricare e riavviare la scena attuale.
ja: ``get_tree()`` は、グローバルな :ref:`SceneTree <class_SceneTree>` オブジェクトにアクセスできる関数です。そのため、この関数は現在のシーンをリロード、リスタートさせることができます。
ko: ``get_tree()`` 함수는 전역 :ref:`SceneTree <class_SceneTree>` 오브젝트에 접근할 권한을 부여하며 이 권한을 통해 현재 씬을 다시 불러오고 다시 시작할 수 있습니다.
ta: `` Get_tree () `` செயல்பாடு உலகளாவிய அணுகலை நமக்கு வழங்குகிறது: குறிப்பு: `காட்சி <class_scenetree>` பொருள், இது தற்போதைய காட்சியை மீண்டும் ஏற்றவும் மறுதொடக்கம் செய்யவும் அனுமதிக்கிறது.
tr: ``get_tree()`` fonksiyonu bize genel :ref:`SceneTree <class_SceneTree>`(sahne ağacı) nesnesine erişim sağlar, bu da mevcut sahneyi yeniden yüklememizi ve yeniden başlatmamızı sağlar.
