Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/logic_preferences.po
Languages: ga, it, ta, tr, uk

source: Well, the simple answer is, "when the performance requires it." The dilemma associated with the two options is one of the age-old programming choices: does one optimize memory over speed, or vice versa?
ga: Bhuel, is é an freagra simplí, "nuair a éilíonn an fheidhmíocht é." Is é an aincheist a bhaineann leis an dá rogha ar cheann de na roghanna cláir aois-d'aois: an ndéanann duine cuimhne a bharrfheabhsú thar luas, nó vice versa?
it: Beh, la risposta semplice è: "quando le prestazioni lo necessitano". Il dilemma associato alle due opzioni è una delle antiche scelte di programmazione: si ottimizza prima la memoria rispetto alla velocità, oppure viceversa?
ta: சரி, எளிமையான பதில், "செயல்திறன் தேவைப்படும்போது." இரண்டு விருப்பங்களுடன் தொடர்புடைய குழப்பம் வயதான நிரலாக்க தேர்வுகளில் ஒன்றாகும்: ஒருவர் வேகத்தை விட நினைவகத்தை மேம்படுத்துகிறாரா, அல்லது நேர்மாறாக இருக்கிறாரா?
tr: Basit cevap, "performans gerektirdiğinde" şeklindedir. Bu iki seçenekle ilgili ikilem, asırlık programlama seçimlerinden biridir: hız yerine belleği mi optimize etmeli, yoksa tam tersi mi?
uk: Що ж, проста відповідь: «коли того вимагає продуктивність». Дилема, пов’язана з двома варіантами, є одним із давніх варіантів програмування: оптимізувати пам’ять замість швидкості чи навпаки?

source: The naive answer is to use a static level that loads everything at once. But, depending on the project, this could consume a large amount of memory. Wasting users' RAM leads to programs running slow or outright crashing from everything else the computer tries to do at the same time.
ga: Is é an freagra naive ná leibhéal statach a úsáid a luchtaíonn gach rud ag an am céanna. Ach, ag brath ar an tionscadal, d'fhéadfadh sé seo cuid mhór cuimhne a ithe. Is é an toradh a bhíonn ar RAM na n-úsáideoirí a chur amú ná go mbíonn ríomhchláir ag rith go mall nó go hiomlán ó gach rud eile a dhéanann an ríomhaire iarracht a dhéanamh ag an am céanna.
it: La risposta più ingenua è usare un livello statico che carichi tutto in una volta. Ma, a seconda del progetto, questo potrebbe consumare una grande quantità di memoria. Sprecare la RAM degli utenti può rallentare o addirittura arrestare i programmi in esecuzione, a causa di tutte le altre attività che il computer cerca di eseguire contemporaneamente.
ta: எல்லாவற்றையும் ஒரே நேரத்தில் ஏற்றும் நிலையான அளவைப் பயன்படுத்துவதே அப்பாவியாக இருக்கும். ஆனால், திட்டத்தைப் பொறுத்து, இது ஒரு பெரிய அளவிலான நினைவகத்தை நுகரும். பயனர்களின் ரேம் வீணடிப்பது கணினி ஒரே நேரத்தில் செய்ய முயற்சிக்கும் எல்லாவற்றிலிருந்தும் மெதுவாக அல்லது வெளிப்படையாக நொறுங்கிய நிரல்களுக்கு வழிவகுக்கிறது.
tr: Saf cevap, her şeyi bir kerede yükleyen statik bir seviye kullanmaktır. Ancak, projeye bağlı olarak, bu büyük miktarda bellek tüketebilir. Kullanıcıların RAM'ini boşa harcamak, programların yavaş çalışmasına veya bilgisayarın aynı anda yapmaya çalıştığı diğer her şey nedeniyle tamamen çökmesine neden olur.
uk: Наївна відповідь полягає у використанні статичного рівня, який завантажує все відразу. Залежно від проєкту, це може зайняти великий обсяг пам'яті. Витрата оперативної пам'яті користувачів призводить до того, що програми працюють повільно або взагалі вилітають.

source: No matter what, one should break larger scenes into smaller ones (to aid in reusability of assets). Developers can then design a node that manages the creation/loading and deletion/unloading of resources and nodes in real-time. Games with large and varied environments or procedurally generated elements often implement these strategies to avoid wasting memory.
ga: Is cuma cad é, ba chóir go mbrisfeadh duine radhairc níos mó ina cinn níos lú (chun cabhrú le hin-athúsáidteacht sócmhainní). Is féidir le forbróirí nód a dhearadh ansin a bhainistíonn cruthú / luchtú agus scriosadh / díluchtú acmhainní agus nóid i bhfíor-am. Is minic a chuireann cluichí le timpeallachtaí móra agus éagsúla nó eilimintí a ghintear nós imeachta na straitéisí seo i bhfeidhm chun cuimhne a sheachaint.
it: In ogni caso, è opportuno suddividere le scene più grandi in scene più piccole (per favorire la riutilizzabilità dei contenuti). Gli sviluppatori possono quindi progettare un nodo che gestisca la creazione/caricamento e l'eliminazione/scaricamento di risorse e nodi in tempo reale. I giochi con ambienti vasti e variegati o elementi generati proceduralmente spesso implementano queste strategie per evitare di sprecare la memoria.
ta: எதுவாக இருந்தாலும், ஒருவர் பெரிய காட்சிகளை சிறியவற்றாக உடைக்க வேண்டும் (சொத்துக்களை மறுபயன்பாட்டுக்கு உதவ). உருவாக்குபவர்கள் பின்னர் நிகழ்நேரத்தில் வளங்கள் மற்றும் முனைகளை உருவாக்கம்/ஏற்றுதல் மற்றும் நீக்குதல்/இறக்குதல் ஆகியவற்றை நிர்வகிக்கும் ஒரு முனையை வடிவமைக்கலாம். பெரிய மற்றும் மாறுபட்ட சூழல்கள் அல்லது நடைமுறை ரீதியாக உருவாக்கப்பட்ட கூறுகள் கொண்ட விளையாட்டுகள் பெரும்பாலும் நினைவகத்தை வீணாக்குவதைத் தவிர்க்க இந்த உத்திகளை செயல்படுத்துகின்றன.
tr: Ne olursa olsun, daha büyük sahneleri daha küçük sahnelere bölmek gerekir (varlıkların yeniden kullanılabilirliğine yardımcı olmak için). Geliştiriciler daha sonra kaynakların ve düğümlerin gerçek zamanlı olarak oluşturulmasını/yüklenmesini ve silinmesini/kaldırılmasını yöneten bir düğüm tasarlayabilirler. Büyük ve çeşitli ortamlara veya yöntemsel olarak oluşturulmuş ögelere sahip oyunlar, bellek israfını önlemek için genellikle bu stratejileri uyarlar.
uk: Незважаючи ні на що, слід розбивати великі сцени на менші (для сприяння повторному використанню активів). Потім розробники можуть спроєктувати вузол, який керує створенням/завантаженням та видаленням/вивантаженням ресурсів та вузлів у режимі реального часу. Ігри з великим та різноманітним середовищем, або процедурно сформованими елементами, часто реалізують ці стратегії, щоб уникнути марнотратства пам'яті.

source: On the flip side, coding a dynamic system is more complex, i.e. uses more programmed logic, which results in opportunities for errors and bugs. If one isn't careful, they can develop a system that bloats the technical debt of the application.
ga: Ar an taobh smeach, tá códú córas dinimiciúil níos casta, i.e. úsáideann loighic níos cláraithe, rud a fhágann go mbíonn deiseanna ann le haghaidh earráidí agus fabhtanna. Mura bhfuil duine cúramach, is féidir leo córas a fhorbairt a chuireann bac ar fhiachas teicniúil an iarratais.
it: D'altro parte, creare un sistema dinamico è più complesso, ovvero utilizza una logica più programmata, il che risulta in maggiori possibilità di errori e bug. Se non si fa attenzione, si rischia di sviluppare un sistema che appesantisce il debito tecnico dell'applicazione.
ta: ஃபிளிப் பக்கத்தில், ஒரு மாறும் அமைப்பை குறியீடாக்குவது மிகவும் சிக்கலானது, அதாவது மேலும் திட்டமிடப்பட்ட தர்க்கத்தைப் பயன்படுத்துகிறது, இதன் விளைவாக பிழைகள் மற்றும் பிழைகள் வாய்ப்புகள் ஏற்படுகின்றன. ஒருவர் கவனமாக இல்லாவிட்டால், பயன்பாட்டின் தொழில்நுட்பக் கடனை பூக்கும் ஒரு அமைப்பை அவர்கள் உருவாக்க முடியும்.
tr: Diğer taraftan, dinamik bir sistemin kodlanması daha karmaşıktır, yani daha fazla programlanmış mantık kullanır, bu da sorunlar ve hatalar için fırsatlarla sonuçlanır. Eğer dikkatli olunmazsa, uygulamanın teknik borcunu şişiren bir sistem geliştirilebilir.
uk: З іншого боку, кодування динамічної системи є складнішим, тобто використовує більше програмованої логіки, що призводить до можливостей для помилок та збоїв. Якщо хтось не буде обережним, вони можуть створити систему, яка роздує технічний борг програми.

source: As such, the best options would be...
ga: Mar sin, is iad na roghanna is fearr ná ...
it: Pertanto, le opzioni migliori sarebbero...
ta: எனவே, சிறந்த விருப்பங்கள் ...
tr: Bu nedenle, en iyi seçenekler...
uk: Таким чином, найкращими варіантами будуть ...

source: To use a static level for smaller games.
ga: Leibhéal statach a úsáid le haghaidh cluichí níos lú.
it: Di utilizzare un livello statico per i giochi più piccoli.
ta: சிறிய விளையாட்டுகளுக்கு நிலையான அளவைப் பயன்படுத்த.
tr: Daha küçük oyunlar için statik bir seviye kullanmak.
uk: Використовувати статичний рівень для ігор менших розмірів.

source: If one has the time/resources on a medium/large game, create a library or plugin that can code the management of nodes and resources. If refined over time, so as to improve usability and stability, then it could evolve into a reliable tool across projects.
ga: Má tá an t-am / acmhainní ag duine ar chluiche meánach / mór, leabharlann nó breiseán a chruthú ar féidir leis bainistíocht nóid agus acmhainní a chódú. Má scagadh le himeacht ama, chun inúsáidteacht agus cobhsaíocht a fheabhsú, ansin d'fhéadfadh sé teacht chun cinn ina uirlis iontaofa ar fud na dtionscadal.
it: Se si ha tempo o risorse per un gioco di medie o grandi dimensioni, si può creare una libreria o un'estensione per semplificare la gestione di nodi e risorse. Se perfezionato nel tempo, in modo da migliorarne l'usabilità e la stabilità, potrebbe evolversi in uno strumento affidabile anche per altri progetti.
ta: ஒருவருக்கு ஒரு நடுத்தர/பெரிய விளையாட்டில் நேரம்/வளங்கள் இருந்தால், முனைகள் மற்றும் வளங்களின் நிர்வாகத்தை குறியிடக்கூடிய ஒரு நூலகம் அல்லது சொருகி உருவாக்கவும். காலப்போக்கில் சுத்திகரிக்கப்பட்டால், பயன்பாட்டினை மற்றும் ச்திரத்தன்மையை மேம்படுத்துவதற்காக, அது திட்டங்களில் நம்பகமான கருவியாக உருவாகலாம்.
tr: Orta/büyük ölçekli bir oyunda zaman/kaynak varsa, düğümlerin ve kaynakların yönetimini kodlayabilen bir kütüphane veya eklenti oluşturmak. Kullanılabilirliği ve kararlılığı artırmak için zaman ayrılıp geliştirilirse, projeler arasında güvenilir bir araca dönüşebilir.
uk: Якщо у вас є час/ресурси для середньої/великої гри, створіть бібліотеку або плагін, який може кодувати управління вузлами та ресурсами. Якщо його вдосконалити з часом, щоб покращити зручність використання та стабільність, він міг би стати надійним інструментом для різних проєктів.

source: Code the dynamic logic for a medium/large game because one has the coding skills, but not the time or resources to refine the code (game's gotta get done). Could potentially refactor later to outsource the code into a plugin.
ga: Cód an loighic dinimiciúil le haghaidh cluiche meán / mór toisc go bhfuil ceann na scileanna códaithe, ach ní an t-am nó acmhainní a bheachtú an cód (gotta cluiche a fháil déanta). Níorbh fhéidir refactor a dhéanamh níos déanaí chun an cód a sheachfhoinsiú isteach i mbreiseán.
it: Implementare la logica dinamica per un gioco di medie o grandi dimensioni perché si hanno le competenze di programmazione, ma non il tempo o le risorse per perfezionare il codice (il gioco si deve completare). Si potrebbe potenzialmente effettuare un refactoring in futuro per esternalizzare il codice in un'estensione.
ta: ஒரு நடுத்தர/பெரிய விளையாட்டுக்கான மாறும் தர்க்கத்தை குறியிடவும், ஏனெனில் ஒருவருக்கு குறியீட்டு திறன் உள்ளது, ஆனால் குறியீட்டைச் செம்மைப்படுத்துவதற்கான நேரம் அல்லது ஆதாரங்கள் அல்ல (விளையாட்டின் கோட்டா முடிந்தது). குறியீட்டை ஒரு சொருகி என்று அவுட்சோர்ச் செய்ய பின்னர் மறுசீரமைப்பு செய்ய முடியும்.
tr: Orta/büyük ölçekli bir oyun için, kodlama becerisine sahipsiniz ancak kodu iyileştirmek için zamanınız veya kaynağınız yoksa (oyunun tamamlanması gerekiyorsa), dinamik mantığı kodlamak. Potansiyel olarak daha sonra dış kaynak olarak kullanmak için kodu yeniden düzenleyip bir eklentiye çevirebilirsiniz.
uk: Кодуйте динамічну логіку для середньої/великої гри, якщо маєте навички кодування, але не час або ресурси для вдосконалення коду (гру потрібно завершити). Пізніше це може потенційно рефакторировать, щоб передати код на плагін.

source: For an example of the various ways one can swap scenes around at runtime, please see the :ref:`"Change scenes manually" <doc_change_scenes_manually>` documentation.
ga: Mar shampla de na bealaí éagsúla inar féidir radhairc a mhalartú thart ag am rite, féach le do thoil ar an gcáipéisíocht :ref:`"Athraigh radhairc de láimh" <doc_change_scenes_manually>`.
it: Per un esempio dei vari modi in cui è possibile scambiare le scene durante l'esecuzione, consultare la documentazione :ref:`"Cambiare le scene manualmente" <doc_change_scenes_manually>`.
ta: இயக்க நேரத்தில் காட்சிகளை மாற்றக்கூடிய பல்வேறு வழிகளின் எடுத்துக்காட்டுக்கு, தயவுசெய்து பார்க்கவும்: குறிப்பு: `" காட்சிகளை கைமுறையாக மாற்றவும் "<doc_change_scenes_manolly>` ஆவணங்கள்.
tr: Sahneleri çalışma zamanında değiştirmenin çeşitli yollarına ilişkin bir örnek için lütfen :ref:`"Sahneleri elden değiştirin" <doc_change_scenes_manually>` belgesine bakın.
uk: Для прикладу різних способів обміну сценами під час виконання дивіться документацію :ref:`"Change scenes manually" <doc_change_scenes_manually>`.

source: For these reasons, it is usually best practice to set the initial values of a node before adding it to the scene tree. There are some exceptions where values *can't* be set before being added to the scene tree, like setting global position.
it: Per queste ragioni, di solito è consigliabile impostare i valori iniziali di un nodo prima di aggiungerlo all'albero di scene. Esistono alcune eccezioni in cui i valori *non possono* essere impostati prima di essere aggiunti all'albero di scene, come impostare la posizione globale.
ta: இந்த காரணங்களுக்காக, ஒரு முனையின் ஆரம்ப மதிப்புகளை காட்சி மரத்தில் சேர்ப்பதற்கு முன்பு அதை அமைப்பது பொதுவாக சிறந்த நடைமுறையாகும். உலகளாவிய நிலையை அமைப்பது போன்ற காட்சி மரத்தில் சேர்க்கப்படுவதற்கு முன்பு மதிப்புகளை * அமைக்க முடியாத சில விதிவிலக்குகள் உள்ளன.
uk: З цих причин зазвичай найкраще встановити початкові значення вузла перед додаванням його до дерева сцени. Є деякі винятки, коли значення *неможливо* встановити до додавання до дерева сцени, як-от налаштування глобальної позиції.
