Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/logic_preferences.po
Languages: ga, it, ta, tr, uk

source: Logic preferences
ga: Sainroghanna loighce
it: Preferenze di logica
ta: வழக்கு விருப்பத்தேர்வுகள்
tr: Mantık tercihleri
uk: Вибір логіки

source: Ever wondered whether one should approach problem X with strategy Y or Z? This article covers a variety of topics related to these dilemmas.
ga: Ar smaoinigh tú riamh ar cheart do dhuine dul i ngleic le fadhb X le straitéis Y nó Z? Clúdaíonn an t-alt seo ábhair éagsúla a bhaineann leis na deacrachtaí seo.
it: Ti sei mai chiesto se dovresti affrontare il problema X con la strategia Y o Z? Questo articolo affronta una varietà di argomenti riguardo questi dilemmi.
ta: ஒய் அல்லது சட் என்ற மூலோபாயத்துடன் ஃச் ஐ ஒருவர் அணுக வேண்டுமா என்று எப்போதாவது யோசித்தீர்களா? இந்த கட்டுரை இந்த சங்கடங்கள் தொடர்பான பல்வேறு தலைப்புகளை உள்ளடக்கியது.
tr: Hiç X problemine, Y stratejisi ile mi yoksa Z stratejisi ile mi yaklaşmak gerektiğini düşündünüz mü? Bu makale, bu ikilemlerle ilgili çeşitli konuları kapsamaktadır.
uk: Ви ніколи не замислювались, чи слід підходити до проблеми X із стратегією Y чи Z? Ця стаття охоплює різноманітні теми, пов’язані з цими дилемами.

source: Adding nodes and changing properties: which first?
ga: Nóid a chur leis agus airíonna a athrú: cé acu is túisce?
it: Aggiungere nodi e modificarne le proprietà: cosa fare prima?
ta: முனைகளைச் சேர்ப்பது மற்றும் பண்புகளை மாற்றுதல்: எது முதலில்?
tr: Düğüm ekleme ve özellikleri değiştirme: hangisi önce?
uk: Додавання вузлів і зміна властивостей: що спочатку?

source: When initializing nodes from a script at runtime, you may need to change properties such as the node's name or position. A common dilemma is, when should you change those values?
ga: Agus nóid á dtosú ó script ag am rite, b'fhéidir go mbeidh ort airíonna ar nós ainm nó suíomh an nód a athrú. Is aincheist choitianta é, cathain ba chóir duit na luachanna sin a athrú?
it: Quando si inizializzano i nodi da uno script in fase di esecuzione, potrebbe essere necessario modificare proprietà come il nome o la posizione del nodo. Un dilemma comune è: quando è opportuno modificare questi valori?
ta: இயக்க நேரத்தில் ஒரு ச்கிரிப்டிலிருந்து முனைகளைத் தொடங்கும்போது, நீங்கள் முனையின் பெயர் அல்லது நிலை போன்ற பண்புகளை மாற்ற வேண்டியிருக்கும். ஒரு பொதுவான குழப்பம் என்னவென்றால், அந்த மதிப்புகளை நீங்கள் எப்போது மாற்ற வேண்டும்?
tr: Çalışma zamanında düğümleri bir betikten başlatırken, düğümün adı veya konumu gibi özellikleri değiştirmeniz gerekebilir. Yaygın bir ikilem, bu değerleri ne zaman değiştirmeniz gerektiğidir?
uk: Під час ініціалізації вузлів зі сценарію під час виконання вам може знадобитися змінити такі властивості, як ім’я або положення вузла. Поширена дилема: коли слід змінити ці значення?

source: It is the best practice to change values on a node before adding it to the scene tree. Some property's setters have code to update other corresponding values, and that code can be slow! For most cases, this code has no impact on your game's performance, but in heavy use cases such as procedural generation, it can bring your game to a crawl.
ga: Is é an cleachtas is fearr luachanna a athrú ar nód sula gcuirtear leis an gcrann radhairc é. Tá cód ag socraitheoirí maoine áirithe chun luachanna comhfhreagracha eile a nuashonrú, agus is féidir leis an gcód sin a bheith mall! I bhformhór na gcásanna, níl aon tionchar ag an gcód seo ar fheidhmíocht do chluiche, ach i gcásanna úsáide troma mar ghiniúint nós imeachta, is féidir leis do chluiche a thabhairt chuig crawl.
it: La migliore pratica è modificare i valori di un nodo prima di aggiungerlo all'albero di scene. Alcuni setter di proprietà hanno codice per aggiornare altri valori corrispondenti, e tale codice può essere lento! Nella maggior parte dei casi, questo codice non ha alcun impatto sulle prestazioni del gioco, ma in casi di utilizzo intensivo come la generazione procedurale, può rallentare moltissimo un gioco.
ta: காட்சி மரத்தில் சேர்ப்பதற்கு முன் ஒரு முனையில் மதிப்புகளை மாற்றுவது சிறந்த நடைமுறையாகும். சில சொத்தின் செட்டர்களில் பிற தொடர்புடைய மதிப்புகளைப் புதுப்பிக்க குறியீடு உள்ளது, மேலும் அந்த குறியீடு மெதுவாக இருக்கும்! பெரும்பாலான சந்தர்ப்பங்களில், இந்த குறியீடு உங்கள் விளையாட்டின் செயல்திறனில் எந்த தாக்கத்தையும் ஏற்படுத்தாது, ஆனால் நடைமுறை உருவாக்கம் போன்ற கடுமையான பயன்பாட்டு நிகழ்வுகளில், இது உங்கள் விளையாட்டை வலம் வரக்கூடும்.
tr: Bir düğümü sahne ağacına eklemeden önce üzerindeki değerleri değiştirmek en iyi uygulamadır. Bazı özelliklerin ayarlayıcıları, ilgili diğer değerleri güncellemek için kod içerir ve bu kod yavaş olabilir! Çoğu durumda, bu kodun oyununuzun performansı üzerinde bir etkisi yoktur, ancak yöntemsel üretim gibi ağır kullanım durumlarında oyununuzu yavaşlatabilir.
uk: Найкраще змінити значення на вузлі перед додаванням його до дерева сцени. Деякі засоби встановлення властивостей мають код для оновлення інших відповідних значень, і цей код може бути повільним! У більшості випадків цей код не впливає на продуктивність вашої гри, але у випадках інтенсивного використання, як-от процедурна генерація, він може привести вашу гру до повзання.

source: For these reasons, it is always a best practice to set the initial values of a node before adding it to the scene tree.
ga: Ar na cúiseanna seo, is dea-chleachtas é i gcónaí luachanna tosaigh nód a shocrú sula gcuirtear leis an gcrann radhairc é.

source: Loading vs. preloading
ga: Luchtú vs réamhluchtú
it: Caricamento (load) vs pre-caricamento (preload)
ta: ஏற்றுதல் எதிராக முன் ஏற்றுதல்
tr: Yükleme ve. ön-yükleme karşılaştırması
uk: Завантаження та попереднє завантаження

source: In GDScript, there exists the global :ref:`preload <class_@GDScript_method_preload>` method. It loads resources as early as possible to front-load the "loading" operations and avoid loading resources while in the middle of performance-sensitive code.
ga: I GDScript, tá an modh domhanda :ref:`preload <class_@GDScript_method_preload>`. Déanann sé acmhainní a luchtú chomh luath agus is féidir chun na hoibríochtaí "lódála" a thosú agus chun acmhainní a luchtú a sheachaint agus é i lár an chóid atá íogair ó thaobh feidhmíochta de.
it: In GDScript, esiste il metodo globale :ref:`preload <class_@GDScript_method_preload>`. Esso carica le risorse il prima possibile per anticipare le operazioni di "caricamento" ed evitare di caricare risorse nel mezzo di codice sensibile alle prestazioni.
ta: GDSCRIPT இல், உலகளாவிய: ref: `முன்னுரிமை <class_@gdscript_method_preload>` முறை. செயல்திறன்-உணர்திறன் குறியீட்டின் நடுவில் இருக்கும்போது "ஏற்றுதல்" செயல்பாடுகளை முன் ஏற்றுவதற்கும், வளங்களை ஏற்றுவதைத் தவிர்ப்பதற்கும் இது முடிந்தவரை வளங்களை ஏற்றுகிறது.
tr: GDScript'te ön yükleme için genel :ref:`preload <class_@GDScript_method_preload>` yöntemi bulunmaktadır. "Yükleme" işlemlerini önceden yüklemek ve kaynakların performansa-duyarlı kodun ortasındayken yüklenmesini önlemek için kaynakları mümkün olduğunca erken yükler.
uk: У GDScript існує глобальний метод :ref:`preload <class_@GDScript_method_preload>`. Він завантажує ресурси якомога раніше, щоб попередньо завантажити операції "завантаження" і уникати завантаження ресурсів, перебуваючи в середині коду, що чутливий до продуктивності.

source: Its counterpart, the :ref:`load <class_@GDScript_method_load>` method, loads a resource only when it reaches the load statement. That is, it will load a resource in-place which can cause slowdowns when it occurs in the middle of sensitive processes. The ``load()`` function is also an alias for :ref:`ResourceLoader.load(path) <class_ResourceLoader_method_load>` which is accessible to *all* scripting languages.
ga: Déanann a mhacasamhail, an modh :ref:`load <class_@GDScript_method_load>`, acmhainn a luchtú ach amháin nuair a shroicheann sé an ráiteas ualaigh. Is é sin le rá, lódálfaidh sé acmhainn in áit a d’fhéadfadh moilliú a chur faoi deara nuair a tharlaíonn sé i lár próisis íogaire. Is ailias í an fheidhm ``load()`` freisin do :ref:`ResourceLoader.load(conair) <class_ResourceLoader_method_load>` atá inrochtana do *gach* teanga scriptithe.
it: La sua controparte, il metodo :ref:`load <class_@GDScript_method_load>`, carica una risorsa solo quando raggiunge l'istruzione di caricamento. In altre parole, carica una risorsa sul posto, il che può causare rallentamenti quando avviene durante processi sensibili. La funzione ``load()`` è anche un alias di :ref:`ResourceLoader.load(path) <class_ResourceLoader_method_load>`, accessibile a *tutti* i linguaggi di scripting.
ta: அதன் எதிர்முனை, தி: ரெஃப்: `சுமை <class_@gdscript_method_load>` முறை, சுமை அறிக்கையை அடையும் போது மட்டுமே ஒரு வளத்தை ஏற்றும். அதாவது, இது ஒரு வளத்தை ஏற்றும், இது முக்கியமான செயல்முறைகளின் நடுவில் ஏற்படும் போது மந்தநிலையை ஏற்படுத்தும். `` சுமை () `` செயல்பாடும் இதற்கான மாற்றுப்பெயராகும்: குறிப்பு: `resourceceloader.load (பாதை) <class_resourceloader_method_load>` இது * அனைத்து * ச்கிரிப்டிங் மொழிகளுக்கும் அணுகக்கூடியது.
tr: Bunun karşılığı olan :ref:`load <class_@GDScript_method_load>` yöntemi, bir kaynağı yalnızca load deyimine ulaştığında yükler. Yani, bir kaynağı yerinde yükleyecek ve hassas işlemlerin ortasında gerçekleştiğinde yavaşlamalara neden olabilecektir. ``load()`` fonksiyonu aynı zamanda *tüm* betik dilleri tarafından erişilebilen :ref:`ResourceLoader.load(kaynak_yolu) <class_ResourceLoader_method_load>` için bir takma isimdir.
uk: Його аналог, метод :ref:`load <class_@GDScript_method_load>`, завантажує ресурс лише тоді, коли він досягає оператора load. Тобто він завантажуватиме ресурс на місці, що може спричинити уповільнення, коли це відбувається під час чутливих процесів. Функція ``load()`` також є псевдонімом для :ref:`ResourceLoader.load(path) <class_ResourceLoader_method_load>`, яка доступна для *всіх* мов сценаріїв.

source: So, when exactly does preloading occur versus loading, and when should one use either? Let's see an example:
ga: Mar sin, nuair a tharlaíonn réamhlódáil go díreach i gcoinne luchtú, agus cathain ba chóir ceann a úsáid ach an oiread? A ligean ar a fheiceáil sampla:
it: Allora, quando esattamente avviene il pre-caricamento rispetto al caricamento, e quando si dovrebbe usare l'uno o l'altro? Vediamo un esempio:
ta: எனவே, ஏற்றுவதற்கு எதிராக முன் ஏற்றுதல் எப்போது நிகழ்கிறது, மேலும் ஒருவர் எப்போது பயன்படுத்த வேண்டும்? ஒரு உதாரணத்தைப் பார்ப்போம்:
tr: Peki, normal yüklemeye karşı ön yükleme tam olarak ne zaman gerçekleşir ve ne zaman ikisinden biri kullanılmalıdır? Bir örnek görelim:
uk: Отже, коли саме відбувається попереднє завантаження порівняно із простим завантаженням, і коли слід використовувати кожне з них? Подивимось приклад:

source: Preloading allows the script to handle all the loading the moment one loads the script. Preloading is useful, but there are also times when one doesn't wish for it. To distinguish these situations, there are a few things one can consider:
ga: Ceadaíonn réamhluchtú don script an luchtú go léir a láimhseáil an nóiméad a luchtaíonn duine an script. Tá réamhlódáil úsáideach, ach tá amanna ann freisin nuair nach mian le duine é. Chun idirdhealú a dhéanamh ar na cásanna seo, tá roinnt rudaí is féidir le duine a mheas:
it: Il pre-caricamento consente allo script di gestire tutto il caricamento nel momento in cui viene caricato. Il pre-caricamento è utile, ma ci sono anche momenti in cui non è desiderato. Per distinguere queste situazioni, ci sono un po' di aspetti da considerare:
ta: முன் ஏற்றுதல் ச்கிரிப்டை ஏற்றும் தருணத்தில் அனைத்து ஏற்றுதலையும் கையாள ச்கிரிப்டை அனுமதிக்கிறது. முன் ஏற்றுதல் பயனுள்ளதாக இருக்கும், ஆனால் ஒருவர் அதை விரும்பாத நேரங்களும் உள்ளன. இந்த சூழ்நிலைகளை வேறுபடுத்துவதற்கு, ஒருவர் கருத்தில் கொள்ளக்கூடிய சில விசயங்கள் உள்ளன:
tr: Ön yükleme, betik yüklendiği anda tüm yüklemenin betik tarafından yapılmasını sağlar. Ön yükleme yararlıdır, ancak kişinin bunu istemediği zamanlar da vardır. Bu durumları ayırt etmek için göz önünde bulundurulabilecek birkaç şey vardır:
uk: Попереднє завантаження дозволяє скрипту обробляти все завантаження в момент завантаження скрипта. Попереднє завантаження корисно, але бувають випадки, коли ніхто цього не бажає. Щоб розрізнити ці ситуації, можна розглянути кілька ситуацій:

source: If one cannot determine when the script might load, then preloading a resource, especially a scene or script, could result in further loads one does not expect. This could lead to unintentional, variable-length load times on top of the original script's load operations.
ga: Mura féidir le duine a chinneadh cén uair a d'fhéadfadh an script a luchtú, ansin d'fhéadfadh ualach breise a bheith mar thoradh ar acmhainn a réamhlódáil, go háirithe radharc nó script. D'fhéadfadh amanna ualaigh neamhbheartaithe, athraitheacha a bheith mar thoradh air seo ar bharr oibríochtaí ualaigh na scripte bunaidh.
it: Se non è possibile determinare quando lo script verrà caricato, il pre-caricamento di una risorsa, specialmente di una scena o di uno script, potrebbe portare a ulteriori caricamenti inaspettati. Ciò potrebbe causare tempi di caricamento variabili non intenzionali, oltre alle operazioni di caricamento dello script originale.
ta: ச்கிரிப்ட் எப்போது ஏற்றப்படலாம் என்பதை ஒருவர் தீர்மானிக்க முடியாவிட்டால், ஒரு வளத்தை முன்பே ஏற்றுவது, குறிப்பாக ஒரு காட்சி அல்லது ச்கிரிப்ட், ஒருவர் எதிர்பார்க்காத மேலும் சுமைகளை ஏற்படுத்தக்கூடும். இது அசல் ச்கிரிப்டின் சுமை செயல்பாடுகளின் மேல் தற்செயலான, மாறி-நீள சுமை நேரங்களுக்கு வழிவகுக்கும்.
tr: Betiğin ne zaman yükleneceği belirlenemiyorsa, bu durumda bir kaynağın, özellikle de bir sahne veya betiğin önceden yüklenmesi, beklenmeyen başka yüklemelere neden olabilir. Bu da orijinal betiğin yükleme işlemlerine ek olarak istenmeyen, değişken-uzunlukta yükleme sürelerine yol açabilir.
uk: Якщо не вдається визначити, коли скрипт може завантажитися, то попереднє завантаження ресурсу, особливо сцени чи скрипта, може призвести до подальших завантажень, яких ми не очікуємо. Це може призвести до ненавмисного завантаження змінних поверх операцій завантаження оригінального скрипта.

source: If something else could replace the value (like a scene's exported initialization), then preloading the value has no meaning. This point isn't a significant factor if one intends to always create the script on its own.
ga: Má d'fhéadfadh rud éigin eile a chur in ionad an luach (cosúil le túsú onnmhairithe radharc), ansin níl aon bhrí leis an luach a réamhlódáil. Ní fachtóir suntasach é an pointe seo má tá sé ar intinn ag duine an script a chruthú as a stuaim féin i gcónaí.
it: Se qualcos'altro potesse sostituire il valore (come l'inizializzazione esportata di una scena), pre-caricare il valore sarebbe inutile. Questo punto non è un fattore significativo se si intende creare sempre lo script autonomamente.
ta: வேறு ஏதேனும் மதிப்பை மாற்ற முடிந்தால் (ஒரு காட்சியின் ஏற்றுமதி துவக்கம் போன்றது), பின்னர் மதிப்பை முன்பே ஏற்றுவதற்கு எந்த அர்த்தமும் இல்லை. ச்கிரிப்டை எப்போதும் சொந்தமாக உருவாக்க ஒருவர் விரும்பினால் இந்த புள்ளி ஒரு குறிப்பிடத்தக்க காரணியாக இருக்காது.
tr: Değerin yerini başka bir şey alabiliyorsa (bir sahnenin dışa aktarılmış başlatması gibi), bu durumda değeri önceden yüklemenin bir anlamı kalmaz. Betiği her zaman kendi başına oluşturmayı planlıyorsanız bu nokta önemli bir faktör değildir.
uk: Якщо щось інше може замінити значення (наприклад, ініціалізація експортованої сцени), то попереднє завантаження значення не має сенсу. Цей момент не є суттєвим фактором, якщо кожен має намір завжди створювати скрипт самостійно.

source: If one wishes only to 'import' another class resource (script or scene), then using a preloaded constant is often the best course of action. However, in exceptional cases, one may wish not to do this:
ga: Más mian le duine ach acmhainn ranga eile (script nó radharc) a 'iompórtáil', is minic gurb é an gníomh is fearr é tairiseach réamhlódáilte a úsáid. I gcásanna eisceachtúla, áfach, b'fhéidir nár mhaith le duine gan é seo a dhéanamh:
it: Se si desidera solo "importare" un'altra risorsa di classe (script o scena), utilizzare una costante precaricata è spesso la soluzione migliore. Tuttavia, in casi eccezionali, potrebbe essere opportuno non farlo:
ta: ஒருவர் மற்றொரு வகுப்பு வளத்தை (ச்கிரிப்ட் அல்லது காட்சி) 'இறக்குமதி செய்ய' விரும்பினால், முன்பே ஏற்றப்பட்ட மாறிலியைப் பயன்படுத்துவது பெரும்பாலும் சிறந்த செயலாகும். இருப்பினும், விதிவிலக்கான சந்தர்ப்பங்களில், இதைச் செய்ய வேண்டாம் என்று ஒருவர் விரும்பலாம்:
tr: Yalnızca başka bir sınıf kaynağını (betik veya sahne) 'içe aktarmak' isteniyorsa, önceden yüklenmiş bir sabit kullanmak genellikle en iyi hareket tarzıdır. Ancak, istisnai durumlarda, bunu yapmak istemeyebilirsiniz:
uk: Якщо хтось бажає лише 'імпортувати' інший ресурс класу (скрипт, або сцену), то використання попередньо завантаженої константи часто є найкращим рішенням. Однак у виняткових випадках можна не бажати цього робити:

source: If the 'imported' class is liable to change, then it should be a property instead, initialized either using an ``@export`` or a ``load()`` (and perhaps not even initialized until later).
ga: Má tá an aicme 'allmhairithe' faoi dhliteanas athrú, ansin ba chóir go mbeadh sé ina mhaoin ina ionad sin, túsaithe ag baint úsáide as ''@export'' nó ''ualach()'' (agus b'fhéidir nach bhfuil túsaithe fiú go dtí níos déanaí).
it: Se la classe "importata" è suscettibile a modifiche, allora dovrebbe essere una proprietà, inizializzata tramite ``@export`` o ``load()`` (e forse nemmeno inizializzata subito).
ta: 'இறக்குமதி செய்யப்பட்ட' வகுப்பு மாற்றுவதற்கு பொறுப்பாகும் என்றால், அது அதற்கு பதிலாக ஒரு சொத்தாக இருக்க வேண்டும், ஒரு ``@ஏற்றுமதி` அல்லது `` சுமை () `` (மற்றும் பின்னர் கூட துவக்கப்படவில்லை) ஆகியவற்றைப் பயன்படுத்தி துவக்கப்படுகிறது.
tr: Eğer 'içe aktarılan' sınıf değişebiliyorsa, o zaman bunun yerine bir özellik olmalı, ya bir ``@export`` ya da bir ``load()`` kullanılarak başlatılmalıdır (ve belki de daha sonraya kadar başlatılmamalıdır).
uk: Якщо «імпортований» клас підлягає зміні, тоді це має бути властивість, ініціалізована за допомогою ``@export`` або ``load()`` (і, можливо, навіть не ініціалізована пізніше).

source: If the script requires a great many dependencies, and one does not wish to consume so much memory, then one may wish to, load and unload various dependencies at runtime as circumstances change. If one preloads resources into constants, then the only way to unload these resources would be to unload the entire script. If they are instead loaded properties, then one can set them to ``null`` and remove all references to the resource entirely (which, as a :ref:`RefCounted <class_RefCounted>`-extending type, will cause the resources to delete themselves from memory).
ga: Má éilíonn an script go leor spleáchais, agus mura bhfuil duine ag iarraidh an oiread sin cuimhne a ithe, b'fhéidir gur mhaith le duine spleáchais éagsúla a luchtú agus a dhíluchtú ag am rite de réir mar a athraíonn cúinsí. Má dhéanann duine acmhainní a réamh-lódáil go tairisigh, is é an t-aon bhealach chun na hacmhainní seo a dhíluchtú ná an script iomlán a dhíluchtú. Más airíonna luchtaithe iad, is féidir iad a shocrú go ``null`` agus gach tagairt don acmhainn a bhaint ina hiomláine (mar :ref:`RefCounted <class_RefCounted>`-cineál síneadh, scriosfar na hacmhainní iad féin as cuimhne).
it: Se lo script richiede molte dipendenze e non si desidera consumare così tanta memoria, è possibile caricare e scaricare diverse dipendenze in fase di esecuzione, al variare delle circostanze. Se si precaricano risorse in costanti, l'unico modo per scaricarle sarebbe scaricare l'intero script. Se invece si caricano proprietà, è possibile impostarle a ``null`` e rimuovere completamente tutti i riferimenti alla risorsa (il che, essendo un tipo che estende :ref:`RefCounted <class_RefCounted>`, causerà l'eliminazione delle risorse dalla memoria).
ta: ச்கிரிப்டுக்கு பல சார்புநிலைகள் தேவைப்பட்டால், ஒருவர் இவ்வளவு நினைவகத்தை உட்கொள்ள விரும்பவில்லை என்றால், சூழ்நிலைகள் மாறும்போது இயக்க நேரத்தில் பல்வேறு சார்புகளை ஏற்றவும், இறக்கவும் விரும்பலாம். ஒருவர் வளங்களை மாறிலிகளாக ஏற்றினால், இந்த வளங்களை இறக்குவதற்கான ஒரே வழி முழு ச்கிரிப்டையும் இறக்குவதாகும். அவை அதற்கு பதிலாக ஏற்றப்பட்ட பண்புகள் என்றால், ஒருவர் அவற்றை `` பூச்ய`` க்கு அமைத்து, வளத்திற்கான அனைத்து குறிப்புகளையும் முழுவதுமாக அகற்றலாம் (இது ஒரு: ref: `Refcounted <class_refcounted>`-விரிவாக்க வகை, வளங்களை நீக்கிவிடும் நினைவிலிருந்து தங்களை).
tr: Kod çok sayıda bağımlılık gerektiriyorsa, ve kişi bu kadar çok fazla bellek tüketmek istemiyorsa, çalışma zamanında çeşitli bağımlılıkları koşullar değiştikçe yüklemek ve kaldırmak isteyebilir. Kaynaklar sabitlere ön yüklenirse, bu kaynakları kaldırmanın tek yolu tüm betiği kaldırmak olacaktır. Bunun yerine normal yüklenen özelliklerse, bunları ``null`` olarak ayarlayabilir ve kaynağa yapılan tüm referansları tamamen kaldırabilirsiniz (bir :ref:`RefCounted <class_RefCounted>` -genişletme türü olarak, kaynakların kendilerini bellekten silmelerine neden olur).
uk: Якщо сценарій потребує великої кількості залежностей, і ви не бажаєте споживати стільки пам’яті, тоді ви можете завантажувати та вивантажувати різні залежності під час виконання, коли обставини зміняться. Якщо попередньо завантажити ресурси в константи, то єдиним способом вивантажити ці ресурси буде вивантажити весь скрипт. Якщо натомість це завантажені властивості, тоді можна встановити для них значення ``null`` і повністю видалити всі посилання на ресурс (що, оскільки тип розширення :ref:`RefCounted <class_RefCounted>`, призведе до видалення ресурсів себе з пам'яті).

source: Large levels: static vs. dynamic
ga: Leibhéil mhóra: statach vs dinimiciúil
it: Livelli grandi: statico vs dinamico
ta: பெரிய நிலைகள்: நிலையான எதிராக மாறும்
tr: Büyük seviyeler: statik ve dinamik karşılaştırması
uk: Великі рівні: статичний та динамічний

source: If one is creating a large level, which circumstances are most appropriate? Should they create the level as one static space? Or should they load the level in pieces and shift the world's content as needed?
ga: Má tá leibhéal mór á chruthú ag duine, cad iad na cúinsí is oiriúnaí? Ar chóir dóibh an leibhéal a chruthú mar spás statach amháin? Nó ar chóir dóibh an leibhéal a luchtú i bpíosaí agus ábhar an domhain a athrú de réir mar is gá?
it: Se si sta creando un livello di grandi dimensioni, quali sono le circostanze più appropriate? È meglio creare il livello come un unico spazio statico? Oppure è meglio caricare il livello a pezzi e cambiare il contenuto del mondo di gioco a seconda delle necessità?
ta: ஒருவர் ஒரு பெரிய மட்டத்தை உருவாக்கினால், எந்த சூழ்நிலைகள் மிகவும் பொருத்தமானவை? அவர்கள் ஒரு நிலையான இடமாக அளவை உருவாக்க வேண்டுமா? அல்லது அவை அளவை துண்டுகளாக ஏற்றி, உலகின் உள்ளடக்கத்தை தேவைக்கேற்ப மாற்ற வேண்டுமா?
tr: Eğer biri büyük bir seviye oluşturuyorsa, hangi koşullar en uygunudur? Seviyeyi tek bir statik alan olarak mı oluşturmalılar? Yoksa seviyeyi parçalar halinde yüklemeli ve dünyanın içeriğini gerektiğinde mi değiştirmeli mi?
uk: Якщо хтось створює великий рівень, які обставини є найбільш доречними? Чи повинні вони створювати рівень як один статичний простір? Або вони повинні завантажувати рівень по шматочках і переміщувати вміст світу за потреби?
