Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/node_alternatives.po
Languages: ga, it, ta, tr

source: When and how to avoid using nodes for everything
ga: Cathain agus conas nóid a úsáid le haghaidh gach rud a sheachaint
it: Quando e come evitare di utilizzare i nodi per tutto
ta: எல்லாவற்றிற்கும் முனைகளைப் பயன்படுத்துவது எப்போது, எப்படி தவிர்ப்பது
tr: Her şey için düğüm kullanmaktan ne zaman ve nasıl kaçınılmalıdır

source: Nodes are cheap to produce, but even they have their limits. A project may have tens of thousands of nodes all doing things. The more complex their behavior though, the larger the strain each one adds to a project's performance.
ga: Tá nóid saor le táirgeadh, ach fiú tá a dteorainneacha acu. D'fhéadfadh go mbeadh na mílte nóid ag tionscadal go léir ag déanamh rudaí. An níos casta a n-iompar áfach, is mó an brú a chuireann gach ceann le feidhmíocht tionscadail.
it: I nodi sono economici da produrre, ma anche loro hanno i loro limiti. Un progetto può avere decine di migliaia di nodi che svolgono tutti delle attività. Tuttavia, più complesso è il loro comportamento, maggiore è il carico che ciascuno di essi aggiunge alle prestazioni del progetto.
ta: முனைகள் விளைவாக்கம் செய்ய மலிவானவை, ஆனால் அவை கூட அவற்றின் வரம்புகளைக் கொண்டுள்ளன. ஒரு திட்டத்தில் பல்லாயிரக்கணக்கான முனைகள் இருக்கலாம். அவற்றின் நடத்தை மிகவும் சிக்கலானது என்றாலும், ஒவ்வொன்றும் ஒரு திட்டத்தின் செயல்திறனைச் சேர்க்கிறது.
tr: Düğümleri üretmek ucuzdur, ancak onların bile sınırları vardır. Bir projede her biri bir şeyler yapan on binlerce düğüm olabilir. Davranışları ne kadar karmaşık olursa, her birinin projenin performansına eklediği yük de o kadar büyük olur.

source: Godot provides more lightweight objects for creating APIs which nodes use. Be sure to keep these in mind as options when designing how you wish to build your project's features.
ga: Soláthraíonn Godot rudaí níos éadroma chun APIs a chruthú a úsáideann nóid. Bí cinnte iad seo a choinneáil i gcuimhne mar roghanna agus tú ag dearadh conas is mian leat gnéithe do thionscadail a thógáil.
it: Godot fornisce oggetti più leggeri per la creazione di API utilizzate dai nodi. Ciò è da tenere a mente quando si progetta come sviluppare le funzionalità del proprio progetto.
ta: கோடோட் முனைகள் பயன்படுத்தும் பநிஇ களை உருவாக்குவதற்கு அதிக இலகுரக பொருள்களை வழங்குகிறது. உங்கள் திட்டத்தின் அம்சங்களை நீங்கள் எவ்வாறு உருவாக்க விரும்புகிறீர்கள் என்பதை வடிவமைக்கும்போது இவற்றை மனதில் வைத்துக் கொள்ளுங்கள்.
tr: Godot, düğümlerin kullandığı API'leri oluşturmak için daha hafif nesneler sağlar. Projenizin özelliklerini nasıl oluşturmak istediğinizi tasarlarken bunları seçenek olarak aklınızda bulundurduğunuzdan emin olun.

source: :ref:`Object <class_Object>`: The ultimate lightweight object, the original Object must use manual memory management. With that said, it isn't too difficult to create one's own custom data structures, even node structures, that are also lighter than the :ref:`Node <class_Node>` class.
ga: :ref:`Réad <class_Object>`: An réad éadrom deiridh, ní mór don bhunréad úsáid a bhaint as bainistiú cuimhne láimhe. Agus é sin ráite, níl sé ró-dheacair struchtúir sonraí saincheaptha an duine féin a chruthú, fiú struchtúir nód, atá níos éadroime freisin ná an rang :ref:`Nóid <class_Node>`.
it: :ref:`Object <class_Object>`: L'oggetto leggero supremo, l'originale Object, deve gestire manualmente la propria memoria. Detto questo, non è troppo difficile creare strutture dati personalizzate, anche strutture a nodi, che siano anche più leggere della classe :ref:`Node <class_Node>`.
ta: : ref: `பொருள் <class_object>`: இறுதி இலகுரக பொருள், அசல் பொருள் கையேடு நினைவக நிர்வாகத்தைப் பயன்படுத்த வேண்டும். ஒருவரின் சொந்த தனிப்பயன் தரவு கட்டமைப்புகளை, முனை கட்டமைப்புகளை கூட உருவாக்குவது மிகவும் கடினம் அல்ல, அவை: re: `முனை <class_node>` வகுப்பு.
tr: :ref:`Object <class_Object>`: Nihai hafif nesne olan orijinal Object, elden bellek yönetimi kullanmalıdır. Bununla birlikte, :ref:`Node <class_Node>` sınıfından daha hafif olan kendi özel veri yapılarını, hatta düğüm yapılarını, oluşturmak çok zor değildir.

source: **Example:** See the :ref:`Tree <class_Tree>` node. It supports a high level of customization for a table of content with an arbitrary number of rows and columns. The data that it uses to generate its visualization though is actually a tree of :ref:`TreeItem <class_TreeItem>` Objects.
ga: **Sampla:** Féach an nód :ref:`Tree <class_Tree>`. Tacaíonn sé le leibhéal ard saincheaptha le haghaidh tábla ábhar le líon treallach sraitheanna agus colúin. Is crann de :ref:`TreeItem <class_TreeItem>` Objects iad na sonraí a úsáideann sé chun a léirshamhlú a ghiniúint.
it: **Esempio:** Consultare il nodo :ref:`Tree <class_Tree>`. Supporta un elevato livello di personalizzazione per una tabella di contenuti con un numero arbitrario di righe e colonne. I dati che utilizza per generare la visualizzazione sono in realtà un albero di oggetti :ref:`TreeItem <class_TreeItem>`.
ta: ** எடுத்துக்காட்டு: ** காண்க: ref: `மரம் <class_tree>` முனை. இது தன்னிச்சையான எண்ணிக்கையிலான வரிசைகள் மற்றும் நெடுவரிசைகளைக் கொண்ட உள்ளடக்க அட்டவணைக்கு உயர் மட்ட தனிப்பயனாக்கத்தை ஆதரிக்கிறது. அதன் காட்சிப்படுத்தலை உருவாக்க அது பயன்படுத்தும் தரவு உண்மையில் ஒரு மரம்: குறிப்பு: `ட்ரீயிடெம் <class_treeitem>` பொருள்கள்.
tr: **Örnek:** :ref:`Tree <class_Tree>` düğümüne bakın. İsteğe bağlı sayıda satır ve sütuna sahip bir içerik tablosu için yüksek düzeyde özelleştirmeyi destekler. Görselleştirmesini oluşturmak için kullandığı veriler aslında :ref:`TreeItem <class_TreeItem>` Nesnelerinden oluşan bir ağaçtır.

source: **Advantages:** Simplifying one's API to smaller scoped objects helps improve its accessibility and improve iteration time. Rather than working with the entire Node library, one creates an abbreviated set of Objects from which a node can generate and manage the appropriate sub-nodes.
ga: ** Buntáistí: ** Cuidíonn API duine a shimpliú chuig rudaí scóipthe níos lú lena inrochtaineacht a fheabhsú agus am athraithe a fheabhsú. Seachas oibriú leis an leabharlann Nód iomlán, cruthaíonn duine tacar giorraithe Rudaí as ar féidir le nód na fo-nóid iomchuí a ghiniúint agus a bhainistiú.
it: **Vantaggi:** Semplificare la propria API in oggetti, con ambito ridotto, contribuisce a migliorarne l'accessibilità e a ridurre i tempi di iterazione. Anziché lavorare con l'intera libreria di Node, si crea un insieme abbreviato di oggetti da cui un nodo può generare e gestire i sotto-nodi appropriati.
ta: ** நன்மைகள்: ** சிறிய ச்கோப் செய்யப்பட்ட பொருள்களுக்கு ஒருவரின் பநிஇ ஐ எளிதாக்குவது அதன் அணுகலை மேம்படுத்தவும் மறு செய்கை நேரத்தை மேம்படுத்தவும் உதவுகிறது. முழு முனை நூலகத்துடன் பணிபுரிவதை விட, ஒருவர் சுருக்கமான பொருள்களை உருவாக்குகிறார், அதில் இருந்து ஒரு முனை பொருத்தமான துணை முனைகளை உருவாக்கி நிர்வகிக்க முடியும்.
tr: **Avantajları:** Bir API'nin daha küçük kapsamlı nesnelere basitleştirilmesi, erişilebilirliğini artırmaya ve yineleme süresini iyileştirmeye yardımcı olur. Node kütüphanesinin tümü ile çalışmak yerine, bir düğümün uygun alt-düğümleri oluşturabileceği ve yönetebileceği kısaltılmış bir Object'ler kümesi oluşturulur.

source: One should be careful when handling them. One can store an Object into a variable, but these references can become invalid without warning. For example, if the object's creator decides to delete it out of nowhere, this would trigger an error state when one next accesses it.
ga: Ba chóir go mbeadh duine cúramach agus iad á láimhseáil. Is féidir le duine Réad a stóráil in athróg, ach is féidir leis na tagairtí seo a bheith neamhbhailí gan rabhadh. Mar shampla, má shocraíonn cruthaitheoir an réada é a scriosadh as áit ar bith, spreagfadh sé seo stát earráide nuair a bhfaighidh duine eile rochtain air.
it: Bisogna fare attenzione quando li si gestisce. È possibile memorizzare un oggetto in una variabile, ma questi riferimenti possono diventare non validi, senza preavviso. Ad esempio, se il creatore dell'oggetto decide di eliminarlo all'improvviso, ciò genererebbe uno stato di errore al prossimo accesso.
ta: அவற்றைக் கையாளும் போது ஒருவர் கவனமாக இருக்க வேண்டும். ஒருவர் ஒரு பொருளை ஒரு மாறியில் சேமிக்க முடியும், ஆனால் இந்த குறிப்புகள் எச்சரிக்கையின்றி செல்லாது. எடுத்துக்காட்டாக, பொருளின் படைப்பாளி அதை எங்கும் நீக்க முடிவு செய்தால், அடுத்தவர் அதை அணுகும்போது இது பிழை நிலையைத் தூண்டும்.
tr: Bunları kullanırken dikkatli olunmalıdır. Bir Object bir değişkende saklanabilir, ancak bu başvurular hiçbir uyarı olmadan geçersiz hale gelebilir. Örneğin, nesnenin yaratıcısı onu durup dururken silmeye karar verirse, bu bir sonraki erişimde bir hata durumunu tetikleyecektir.

source: :ref:`RefCounted <class_RefCounted>`: Only a little more complex than Object. They track references to themselves, only deleting loaded memory when no further references to themselves exist. These are useful in the majority of cases where one needs data in a custom class.
ga: :ref:`RefCounted <class_RefCounted>`: Níl ach beagán níos casta ná Object. Rianaíonn siad tagairtí dóibh féin, ní scriosann siad cuimhne luchtaithe ach amháin nuair nach ann do thagairtí eile dóibh féin. Tá siad seo úsáideach i bhformhór na gcásanna nuair a bhíonn sonraí de dhíth ar dhuine i rang saincheaptha.
it: :ref:`RefCounted <class_RefCounted>`: Solo un po' più complesso di Object. Registra i riferimenti a se stesso, cancellando la memoria caricata solo quando non esistono ulteriori riferimenti a se stesso. Sono utili nella maggior parte dei casi in cui sono necessari dati in una classe personalizzata.
ta: . அவர்கள் தங்களைப் பற்றிய குறிப்புகளைக் கண்காணிக்கிறார்கள், தங்களைப் பற்றிய கூடுதல் குறிப்புகள் இல்லாதபோது ஏற்றப்பட்ட நினைவகத்தை மட்டுமே நீக்குகின்றன. தனிப்பயன் வகுப்பில் ஒருவர் தரவு தேவைப்படும் பெரும்பாலான சந்தர்ப்பங்களில் இவை பயனுள்ளதாக இருக்கும்.
tr: :ref:`RefCounted <class_RefCounted>`: Object'ten biraz daha karmaşıktır. Kendilerine yapılan başvuruları takip ederler, sadece kendilerine başka başvuru kalmadığında yüklü belleği silerler. Bunlar, özel bir sınıfta veriye ihtiyaç duyulan çoğu durumda kullanışlıdır.

source: **Example:** See the :ref:`FileAccess <class_FileAccess>` object. It functions just like a regular Object except that one need not delete it themselves.
ga: **Sampla:** Féach an réad :ref:`FileAccess <class_FileAccess>`. Feidhmíonn sé díreach cosúil le Réad rialta ach amháin nach gá é a scriosadh iad féin.
it: **Esempio:** Consultare l'oggetto :ref:`FileAccess <class_FileAccess>`. Funziona esattamente come un normale Object, solo che non è necessario eliminarlo manualmente.
ta: . இது ஒரு வழக்கமான பொருளைப் போலவே செயல்படுகிறது, தவிர ஒருவர் அதை நீக்க தேவையில்லை.
tr: **Örnek:** :ref:`FileAccess <class_FileAccess>` nesnesine bakın. Birinin bunu kendisinin silmesine gerek olmaması dışında normal bir Object gibi çalışır.

source: **Advantages:** same as the Object.
ga: ** Buntáistí: ** mar an gcéanna leis an gCad.
it: **Vantaggi:** uguali a Object.
ta: ** நன்மைகள்: ** பொருளைப் போலவே.
tr: **Avantajlar:** Object ile aynı.

source: :ref:`Resource <class_Resource>`: Only slightly more complex than RefCounted. They have the innate ability to serialize/deserialize (i.e. save and load) their object properties to/from Godot resource files.
ga: :ref:`Acmhainn <class_Resource>`: Níl ach beagán níos casta ná RefCounted. Tá an cumas dúchasach acu a n-airíonna oibiachta a shraithiú/díscriosú (i.e. a shábháil agus a luchtú) chuig/ó chomhaid acmhainne Godot.
it: :ref:`Resource <class_Resource>`: Solamente un po' più complesso di RefCounted. Hanno la capacità innata di serializzare/deserializzare (ovvero salvare e caricare) le proprietà dei loro oggetti da/a file di risorse di Godot.
ta: . கோடோட் வளக் கோப்புகளிலிருந்து/அவற்றின் பொருள் பண்புகளை/வரிசைப்படுத்துதல் (அதாவது சேமித்து ஏற்றவும்) அவர்கள் உள்ளார்ந்த திறனைக் கொண்டுள்ளனர்.
tr: :ref:`Resource <class_Resource>`: RefCounted'dan sadece biraz daha karmaşıktır. Nesne özelliklerini Godot kaynak dosyalarına serileştirme/ters-serileştirme (yani kaydetme ve yükleme) yeteneğine doğuştan sahiptirler.

source: **Example:** Scripts, PackedScene (for scene files), and other types like each of the :ref:`AudioEffect <class_AudioEffect>` classes. Each of these can be saved and loaded, therefore they extend from Resource.
ga: **Sampla:** Scripteanna, PackedScene (do chomhaid radharc), agus cineálacha eile ar nós gach ceann de na ranganna :ref:`AudioEffect <class_AudioEffect>`. Is féidir gach ceann díobh seo a shábháil agus a luchtú, mar sin síneann siad ó Acmhainní.
it: **Esempio:** Script, PackedScene (per i file di scena) e altri tipi come ciascuna delle classi :ref:`AudioEffect <class_AudioEffect>`. Ognuna di queste si può salvare e caricare, quindi si estendono da Resource.
ta: . இவை ஒவ்வொன்றையும் சேமித்து ஏற்றலாம், எனவே அவை வளத்திலிருந்து நீட்டிக்கப்படுகின்றன.
tr: **Örnek:** Betikler, PackedScene (sahne dosyaları için) ve :ref:`AudioEffect <class_AudioEffect>` sınıflarının her biri gibi diğer türler. Bunların her biri kaydedilebilir ve yüklenebilir, bu nedenle Resource'tan genişletilirler.

source: **Advantages:** Much has :ref:`already been said <doc_resources>` on :ref:`Resource <class_Resource>`'s advantages over traditional data storage methods. In the context of using Resources over Nodes though, their main advantage is in Inspector-compatibility. While nearly as lightweight as Object/RefCounted, they can still display and export properties in the Inspector. This allows them to fulfill a purpose much like sub-Nodes on the usability front, but also improve performance if one plans to have many such Resources/Nodes in their scenes.
ga: **Buntáistí:** Tá go leor :ref:`ráite cheana <doc_resources>` ar :ref:`Acmhainn <class_Resource>` na buntáistí a bhaineann le modhanna traidisiúnta stórála sonraí. I gcomhthéacs Acmhainní thar Nóid a úsáid, áfach, is é an príomhbhuntáiste atá acu ná Comhoiriúnacht Cigire. Cé go bhfuil siad beagnach chomh héadrom le Object/RefCounted, is féidir leo airíonna a thaispeáint agus a onnmhairiú go fóill sa Chigire. Ligeann sé seo dóibh cuspóir cosúil le Fo-Nóid a chomhlíonadh ó thaobh inúsáidteachta de, ach freisin feabhas a chur ar fheidhmíocht má tá sé beartaithe ag duine go leor Acmhainní/Nóid dá leithéid a bheith ina radharc.
it: **Vantaggi:** Molto è :ref:`già stato detto <doc_resources>` sui vantaggi di :ref:`Resource <class_Resource>` rispetto ai metodi tradizionali di archiviazione dati. Eppure, nel contesto dell'utilizzo di risorse rispetto a nodi, il loro vantaggio principale è la loro compatibilità con l'Ispettore. Pur essendo quasi leggeri come Object/RefCounted, possono comunque visualizzare ed esportare proprietà nell'Ispettore. Questo consente loro di svolgere una funzione simile a quella dei sotto-nodi, in termini di usabilità, nonché di migliorare le prestazioni se si prevede di avere molte di queste risorse/nodi nelle proprie scene.
ta: . முனைகளுக்கு மேல் வளங்களைப் பயன்படுத்துவதற்கான சூழலில், அவற்றின் முக்கிய நன்மை இன்ச்பெக்டர்-இணக்கத்தன்மையில் உள்ளது. பொருள்/புதுப்பிக்கப்பட்டதைப் போலவே இலகுரக என்றாலும், அவை இன்னும் இன்ச்பெக்டரில் பண்புகளைக் காண்பிக்கலாம் மற்றும் ஏற்றுமதி செய்யலாம். இது பயன்பாட்டினை முன்னணியில் துணை முனைகளைப் போன்ற ஒரு நோக்கத்தை நிறைவு செய்ய அனுமதிக்கிறது, ஆனால் ஒருவர் தங்கள் காட்சிகளில் இதுபோன்ற பல வளங்கள்/முனைகளை வைத்திருக்க திட்டமிட்டால் செயல்திறனை மேம்படுத்தவும்.
tr: **Avantajları:** :ref:`Resource <class_Resource>`un geleneksel veri depolama yöntemlerine göre avantajları hakkında :ref:`zaten çok şey söylendi <doc_resources>`. Ancak Node'lar yerine Resource'ların kullanılması bağlamında, ana avantajları Denetleyici-uyumluluğudur. Neredeyse Object/RefCounted kadar hafif olmalarına rağmen, Denetleyici'de özellikleri görüntüleyebilir ve dışa aktarabilirler. Bu, kullanılabilirlik cephesinde alt-Düğümler gibi bir amacı yerine getirmelerini sağlar, ancak aynı zamanda sahnelerde çok sayıda Kaynak/Düğüm olması planlanıyorsa performansı da artırır.
