Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/scenes_versus_scripts.po
Languages: ga, it, ta, tr

source: Scenes help to avoid this performance issue. :ref:`PackedScene <class_PackedScene>`, the base type that scenes inherit from, defines resources that use serialized data to create objects. The engine can process scenes in batches on the back-end and provide much better performance than scripts.
ga: Cuidíonn radhairc leis an tsaincheist feidhmíochta seo a sheachaint. :ref:`PackedScene <class_PackedScene>`, an cineál bonn óna dtagann radhairc le hoidhreacht, sainmhínítear acmhainní a úsáideann sonraí sraithe chun oibiachtaí a chruthú. Is féidir leis an inneall radhairc a phróiseáil i mbaisceanna ar an gcúl agus feidhmíocht i bhfad níos fearr ná scripteanna a sholáthar.
it: Le scene aiutano a evitare questo problema di prestazioni. :ref:`PackedScene <class_PackedScene>`, il tipo base da cui ereditano le scene, definisce risorse che utilizzano dati serializzati per creare oggetti. Il motore può elaborare le scene in gruppi sul back-end e fornire prestazioni molto migliori rispetto agli script.
ta: இந்த செயல்திறன் சிக்கலைத் தவிர்க்க காட்சிகள் உதவுகின்றன. . இயந்திரம் பின்புறத்தில் தொகுதிகளில் காட்சிகளை செயலாக்க முடியும் மற்றும் ச்கிரிப்ட்களை விட சிறந்த செயல்திறனை வழங்க முடியும்.
tr: Sahneler bu performans sorunundan kaçınmaya yardımcı olur. Sahnelerin miras aldığı temel tip olan :ref:`PackedScene <class_PackedScene>`, nesneleri oluşturmak için serileştirilmiş verileri kullanan kaynakları tanımlar. Motor, sahneleri arka uçta toplu olarak işleyebilir ve betiklerden çok daha iyi performans sağlayabilir.

source: Conclusion
ga: Conclúid
it: Conclusione
ta: முடிவு
tr: Sonuç

source: In the end, the best approach is to consider the following:
ga: Sa deireadh, is é an cur chuige is fearr ná na nithe seo a leanas a mheas:
it: Alla fine, il migliore approccio è considerare quanto segue:
ta: முடிவில், சிறந்த அணுகுமுறை பின்வருவனவற்றைக் கருத்தில் கொள்வது:
tr: Sonuç olarak, en iyi yaklaşım aşağıdakileri göz önünde bulundurmaktır:

source: If one wishes to create a basic tool that is going to be re-used in several different projects and which people of all skill levels will likely use (including those who don't label themselves as "programmers"), then chances are that it should probably be a script, likely one with a custom name/icon.
ga: Más mian le duine uirlis bhunúsach a chruthú atá le húsáid a athúsáid i roinnt tionscadal éagsúla agus a úsáidfidh daoine de gach leibhéal scile is dócha (lena n-áirítear iad siúd nach ndéanann lipéadú orthu féin mar “ríomhchláraitheoirí”), ansin is dócha gur script é, ceann le saincheapta/deilbhín.
it: Se si desidera creare uno strumento di base che verrà riutilizzato in diversi progetti e che sarà probabilmente utilizzato da persone di tutti i livelli di competenza (inclusi coloro che non si definiscono "programmatori"), allora è probabile che dovrebbe essere uno script, possibilmente uno con un nome/icona personalizzati.
ta: பல வேறுபட்ட திட்டங்களில் மீண்டும் பயன்படுத்தப் போகும் ஒரு அடிப்படை கருவியை உருவாக்க ஒருவர் விரும்பினால், எந்த திறன் நிலைகளையும் கொண்டவர்கள் பயன்படுத்துவார்கள் (தங்களை "புரோகிராமர்கள்" என்று முத்திரை குத்தாதவர்கள் உட்பட), அதுவே வாய்ப்புகள் தனிப்பயன் பெயர்/ஐகானுடன் கூடிய ச்கிரிப்டாக இருக்கலாம்.
tr: Birçok farklı projede yeniden kullanılacak ve her beceri seviyesinden insanın (kendilerini "programcı" olarak etiketlemeyenler de dahil) kullanacağı temel bir araç oluşturmak isteniyorsa, muhtemelen özel bir adı/simgesi olan bir betik olmalıdır.

source: If one wishes to create a concept that is particular to their game, then it should always be a scene. Scenes are easier to track/edit and provide more security than scripts.
ga: Más mian le duine coincheap a chruthú a bhaineann go háirithe lena gcluiche, ba cheart go mbeadh sé ina radharc i gcónaí. Tá sé níos éasca radhairc a rianú / a chur in eagar agus soláthraíonn siad níos mó slándála ná scripteanna.
it: Se si desidera creare un concetto specifico per il proprio gioco, allora dovrebbe sempre essere una scena. Le scene sono più facili da rintracciare/modificare e offrono maggiore sicurezza rispetto agli script.
ta: ஒருவர் தங்கள் விளையாட்டுக்கு குறிப்பாக ஒரு கருத்தை உருவாக்க விரும்பினால், அது எப்போதும் ஒரு காட்சியாக இருக்க வேண்டும். ச்கிரிப்ட்களை விட கண்காணிக்க/திருத்த மற்றும் அதிக பாதுகாப்பை வழங்க காட்சிகள் எளிதானவை.
tr: Eğer kişi kendi oyununa özel bir tasarım yaratmak istiyorsa, bu her zaman bir sahne olmalıdır. Sahnelerin izlenmesi/düzenlenmesi daha kolaydır ve betiklere göre daha fazla güvenlik sağlar.

source: If one would like to give a name to a scene, then they can still sort of do this by declaring a script class and giving it a scene as a constant. The script becomes, in effect, a namespace:
ga: Más mian le duine ainm a thabhairt do radharc, ansin is féidir leo é seo a dhéanamh fós trí rang script a dhearbhú agus radharc a thabhairt dó mar leanúnach. Éiríonn an script, i ndáiríre, ina spás ainmneacha:
it: Se si desidera dare un nome a una scena, è ancora possibile farlo, più o meno, dichiarando una classe da script e associandole una scena come costante. Lo script diventa, di fatto, uno spazio di nomi:
ta: ஒரு காட்சிக்கு ஒருவர் பெயரைக் கொடுக்க விரும்பினால், அவர்கள் ஒரு ச்கிரிப்ட் வகுப்பை அறிவித்து ஒரு காட்சியை ஒரு நிலையானதாகக் கொடுப்பதன் மூலம் இதைச் செய்ய முடியும். ச்கிரிப்ட் ஒரு பெயர்வெளியாக மாறும்:
tr: Eğer bir sahneye bir isim vermek istenirse, bir betik sınıfı tanımlayarak ve ona bir sabit üzerinden bir sahne vererek bunu bir şekilde yapabilirler. Böylece betik aslında bir isim alanı haline gelir:
