Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/scene_organization.po
Languages: ga, it, ta, tr, zh_hant

source: So, why does all this complex switcheroo work? Well, because scenes operate best when they operate alone. If unable to work alone, then working with others anonymously (with minimal hard dependencies, i.e. loose coupling) is the next best thing. Inevitably, changes may need to be made to a class, and if these changes cause it to interact with other scenes in unforeseen ways, then things will start to break down. The whole point of all this indirection is to avoid ending up in a situation where changing one class results in adversely affecting other classes dependent on it.
it: Allora perché tutto questo complesso scambio funziona? Beh, perché le scene funzionano meglio quando sono isolate. Se non sono in grado di funzionare da sole, la soluzione migliore è lavorare con altre in modo anonimo (con dipendenze rigide minime, ovvero con un accoppiamento debole). Inevitabilmente, potrebbe essere necessario apportare modifiche a una classe, e se tali modifiche causano interazioni impreviste con altre scene, allora tutto va in fumo. L'obiettivo di questo approccio indiretto è evitare di ritrovarsi in una situazione in cui la modifica di una classe abbia un effetti negativi sulle altre classi che ne dipendono.
ta: எனவே, இந்த சிக்கலான ச்விட்செரூ ஏன் வேலை செய்கிறது? சரி, ஏனென்றால் காட்சிகள் தனியாக செயல்படும்போது அவை சிறப்பாக செயல்படுகின்றன. தனியாக வேலை செய்ய முடியாவிட்டால், மற்றவர்களுடன் அநாமதேயமாக பணிபுரிவது (குறைந்தபட்ச கடினமான சார்புகளுடன், அதாவது தளர்வான இணைப்பு) அடுத்த சிறந்த சேதி. தவிர்க்க முடியாமல், ஒரு வகுப்பிற்கு மாற்றங்கள் செய்யப்பட வேண்டியிருக்கலாம், மேலும் இந்த மாற்றங்கள் எதிர்பாராத வழிகளில் மற்ற காட்சிகளுடன் தொடர்பு கொள்ள காரணமாக இருந்தால், விசயங்கள் உடைந்து போகத் தொடங்கும். ஒரு வகுப்பை மாற்றுவது பிற வகுப்புகளை மோசமாக பாதிக்கும் ஒரு சூழ்நிலையில் முடிவடைவதைத் தவிர்ப்பதே இந்த திசைதிருப்பலின் முழுப் புள்ளியும் ஆகும்.
zh_hant: 那麼，為什麼這一切複雜的轉換手法會有效呢？嗯，因為場景在獨立運作時表現最好。如果無法獨立運作，那麼匿名地與其他場景協同工作（盡可能減少硬依賴，也就是鬆散耦合）就是次佳的選擇。不可避免地，類別可能需要進行變更，如果這些變更導致它以無法預見的方式與其他場景互動，那麼事情就會開始出錯。所有這些間接手段的重點在於避免最終陷入一種情況：變更一個類別會對依賴它的其他類別產生不利影響。

source: Scripts and scenes, as extensions of engine classes, should abide by *all* OOP principles. Examples include...
ga: Ba chóir go mbeadh scripteanna agus radhairc, mar shínteanna ar ranganna inneall, cloí leis na prionsabail OOP uil*. I measc samplaí tá...
it: Script e scene, in quanto estensioni delle classi del motore, dovrebbero rispettare *tutti* i principi della OOP. Alcuni esempi includono...
ta: ச்கிரிப்டுகள் மற்றும் காட்சிகள், இயந்திர வகுப்புகளின் நீட்டிப்புகளாக, * அனைத்து * OOP கொள்கைகளையும் பின்பற்ற வேண்டும். எடுத்துக்காட்டுகள் அடங்கும் ...
tr: Motor sınıflarının uzantıları olarak betikler ve sahneler, tüm nesne yönelimli programlama (OOP) ilkelerine uymalı. Örnek olarak...
zh_hant: 節點與場景，作為引擎類別的延伸，應該要能套用 **所有** OOP 原則。這些原則的例子包含...

source: `SOLID <https://en.wikipedia.org/wiki/SOLID>`_
ga: `SOLID <https://ga.wikipedia.org/wiki/SOLID>`_
it: `SOLID <https://it.wikipedia.org/wiki/SOLID>`_
ta: `திட <https://en.wikipedia.org/wiki/solid>` _
zh_hant: `SOLID <https://zh.wikipedia.org/zh-tw/SOLID_(%E9%9D%A2%E5%90%91%E5%AF%B9%E8%B1%A1%E8%AE%BE%E8%AE%A1)>`_

source: `DRY <https://en.wikipedia.org/wiki/Don%27t_repeat_yourself>`_
ga: `TIRIM <https://ga.wikipedia.org/wiki/Don%27t_repeat_yourself>`_
it: `DRY <https://it.wikipedia.org/wiki/Don%27t_repeat_yourself>`_
ta: `உலர் <https://en.wikipedia.org/wiki/don%27t_repeat_yourself>` _
tr: `DRY (Kendini tekrar etme) <https://en.wikipedia.org/wiki/Don%27t_repeat_yourself>`_
zh_hant: `DRY <https://zh.wikipedia.org/zh-tw/%E4%B8%80%E6%AC%A1%E4%B8%94%E4%BB%85%E4%B8%80%E6%AC%A1>`_

source: `KISS <https://en.wikipedia.org/wiki/KISS_principle>`_
ga: `KISS <https://ga.wikipedia.org/wiki/KISS_principle>`_
it: `KISS <https://it.wikipedia.org/wiki/KISS_(sviluppo_software)>`_
ta: `முத்தம் <https://en.wikipedia.org/wiki/kiss_principle>` _
tr: `KISS (Basit tut, aptal) <https://en.wikipedia.org/wiki/KISS_principle>`_
zh_hant: `KISS <https://zh.wikipedia.org/zh-tw/KISS%E5%8E%9F%E5%88%99>`_

source: `YAGNI <https://en.wikipedia.org/wiki/You_aren%27t_gonna_need_it>`_
ga: `YAGNI <https://ga.wikipedia.org/wiki/You_aren%27t_gonna_need_it>`_
it: `YAGNI <https://it.wikipedia.org/wiki/You_aren%27t_gonna_need_it>`_
ta: `Yagni <https://en.wikipedia.org/wiki/you_arenen%27t_gonna_need_it>` _
tr: `YAGNI (Ona ihtiyacın olmayacak) <https://en.wikipedia.org/wiki/You_aren%27t_gonna_need_it>`_
zh_hant: `YAGNI <https://zh.wikipedia.org/zh-tw/YAGNI>`_

source: Choosing a node tree structure
ga: Struchtúr crann nód a roghnú
it: Scegliere una struttura per un albero di nodi
ta: ஒரு முனை மர அமைப்பைத் தேர்ந்தெடுப்பது
tr: Bir düğüm ağacı yapısını seçmek
zh_hant: 選擇一種節點樹架構

source: You might start to work on a game but get overwhelmed by the vast possibilities before you. You might know what you want to do, what systems you want to have, but *where* do you put them all? How you go about making your game is always up to you. You can construct node trees in countless ways. If you are unsure, this guide can give you a sample of a decent structure to start with.
it: Potresti iniziare a lavorare a un gioco, ma sentirti sopraffatto dalle vaste possibilità che ti si offrono. Potresti sapere cosa vuoi fare, quali sistemi vuoi avere, ma *dove* li metti tutti? Il modo in cui creerai il tuo gioco dipende sempre da te. Gli alberi di nodi si possono costruire in innumerevoli modi. Se non sei sicuro, questa guida può dare un esempio di una struttura decente da cui cominciare.
ta: நீங்கள் ஒரு விளையாட்டில் வேலை செய்யத் தொடங்கலாம், ஆனால் உங்களுக்கு முன் பரந்த சாத்தியக்கூறுகளால் அதிகமாகிவிட்டது. நீங்கள் என்ன செய்ய விரும்புகிறீர்கள், உங்களுக்கு என்ன அமைப்புகள் வேண்டும் என்று உங்களுக்குத் தெரிந்திருக்கலாம், ஆனால் * நீங்கள் அனைத்தையும் எங்கே வைக்கிறீர்கள்? உங்கள் விளையாட்டை உருவாக்குவது எப்படி என்பது எப்போதும் உங்களுடையது. நீங்கள் எண்ணற்ற வழிகளில் முனை மரங்களை உருவாக்கலாம். உங்களுக்குத் தெரியாவிட்டால், இந்த வழிகாட்டி தொடங்குவதற்கு ஒரு நல்ல கட்டமைப்பின் மாதிரியை உங்களுக்கு வழங்க முடியும்.
zh_hant: 您可能剛開始製作遊戲，但卻被眼前廣泛的可能性弄得不知所措。您可能知道想做什麼、想要哪些系統，但*要將它們都放在哪裡*呢？如何著手製作您的遊戲始終取決於您。您可以用無數種方式建構節點樹。如果您不確定，本指南可以提供一個不錯的起始結構範例供您參考。

source: A game should always have an "entry point"; somewhere you can definitively track where things begin so that you can follow the logic as it continues elsewhere. It also serves as a bird's eye view of all other data and logic in the program. For traditional applications, this is normally a "main" function. In Godot, it's a Main node.
it: Un gioco dovrebbe sempre avere un "punto di ingresso"; un punto da poter considerare con certezza l'inizio delle cose, in modo da poterne seguire la logica mentre prosegue altrove. Questo punto serve anche come panoramica per tutti gli altri dati e della logica del programma. Per le applicazioni tradizionali, questa sarebbe la funzione "main". In Godot, è un nodo Main.
ta: ஒரு விளையாட்டுக்கு எப்போதும் "நுழைவு புள்ளி" இருக்க வேண்டும்; விசயங்கள் எங்கு தொடங்குகின்றன என்பதை எங்காவது நீங்கள் உறுதியாகக் கண்காணிக்க முடியும், இதன் மூலம் வழக்கு வேறு இடங்களில் தொடர்கிறது. இது நிரலில் உள்ள மற்ற எல்லா தரவு மற்றும் தர்க்கத்தின் பறவையின் பார்வையாகவும் செயல்படுகிறது. பாரம்பரிய பயன்பாடுகளுக்கு, இது பொதுவாக ஒரு "முக்கிய" செயல்பாடாகும். கோடோட்டில், இது ஒரு முக்கிய முனை.
zh_hant: 一個遊戲應該總是會有一個「進入點」；一個你可以明確追蹤事物從何開始的地方，這樣你才能夠在邏輯延續到其他地方時跟隨它。它也像是一個鳥瞰圖，呈現程式中所有其他的資料和邏輯。對於傳統應用程式來說，這通常是一個「main」函式。在 Godot 裡，它是一個主要的節點（Main node）。

source: Node "Main" (main.gd)
ga: Nód “Príomh” (main.gd)
it: Nodo "Main" (main.gd)
ta: முனை "முதன்மை" (Main.gd)

source: The ``main.gd`` script will serve as the primary controller of your game.
it: Lo script ``main.gd`` fungerà da controller primario del tuo gioco.
ta: `` Main.gd`` ச்கிரிப்ட் உங்கள் விளையாட்டின் முதன்மை கட்டுப்பாட்டாளராக செயல்படும்.
zh_hant: ``main.gd`` 這個腳本將會作為你遊戲的主要控制器。

source: Then you have an in-game "World" (a 2D or 3D one). This can be a child of Main. In addition, you will need a primary GUI for your game that manages the various menus and widgets the project needs.
it: Poi avrai un "World" di gioco (2D o 3D). Questo può essere un figlio di Main. Inoltre, avrai bisogno di un'interfaccia grafica principale (GUI) per il tuo gioco che gestisca i vari menu e widget necessari al progetto.
ta: பின்னர் உங்களிடம் ஒரு விளையாட்டு "உலகம்" (2 டி அல்லது 3 டி) உள்ளது. இது முதன்மையான குழந்தையாக இருக்கலாம். கூடுதலாக, உங்கள் விளையாட்டுக்கு ஒரு முதன்மை GUI தேவைப்படும், இது பல்வேறு மெனுக்களை நிர்வகிக்கிறது மற்றும் திட்டத் தேவையான விட்செட்டுகள்.
zh_hant: 接著您會有一個遊戲內的「世界」(2D 或 3D 的)。它可以是 Main 的子節點。此外，您的遊戲會需要一個主要的 GUI (圖形使用者介面)，用來管理專案所需的各種選單和小工具。

source: Control "GUI" (gui.gd)
ga: Rialú “GUI” (gui.gd)
ta: "GUI" ஐக் கட்டுப்படுத்துங்கள் (gui.gd)

source: When changing levels, you can then swap out the children of the "World" node. :ref:`Changing scenes manually <doc_change_scenes_manually>` gives you full control over how your game world transitions.
it: Quando cambi livello, puoi scambiare i figli del nodo "World". :ref:`Cambiare scena manualmente <doc_change_scenes_manually>` ti dà il pieno controllo sul modo in cui cambia il mondo del tuo gioco.
ta: அளவை மாற்றும்போது, நீங்கள் "உலக" முனையின் குழந்தைகளை மாற்றிக் கொள்ளலாம். .
zh_hant: 當切換關卡時，您可以替換 "World" 節點的子節點。:ref:`手動切換場景 <doc_change_scenes_manually>` 讓您完全掌控遊戲世界的轉換方式。

source: The next step is to consider what gameplay systems your project requires. If you have a system that...
it: Il passo successivo è considerare quali sistemi di gioco richiede il tuo progetto. Se hai un sistema che...
ta: அடுத்த கட்டம் உங்கள் திட்டத்திற்கு என்ன விளையாட்டு அமைப்புகள் தேவை என்பதைக் கருத்தில் கொள்வது. உங்களிடம் ஒரு அமைப்பு இருந்தால் ...
zh_hant: 下一步是考量你的專案需要哪些遊戲機制。如果你有一個機制是...

source: tracks all of its data internally
ga: rianaíonn a chuid sonraí go léir go hinmheánach
it: tiene traccia di tutti i suoi dati internamente
ta: அதன் எல்லா தரவையும் உள்நாட்டில் கண்காணிக்கிறது
tr: tüm verilerini dahili olarak izler
zh_hant: 能在內部追蹤所有的資料

source: should be globally accessible
ga: ba chóir go mbeadh inrochtana
it: dovrebbe essere accessibile a livello globale
ta: உலகளவில் அணுகக்கூடியதாக இருக்க வேண்டும்
tr: küresel olarak erişilebilir olmalıdır
zh_hant: 可以在所有地方存取

source: should exist in isolation
ga: ba chóir go mbeadh ann ina aonar
it: dovrebbe esistere in modo isolato
ta: தனிமையில் இருக்க வேண்டும்
tr: tek başına var olmalıdır
zh_hant: 獨立存在

source: ... then you should create an :ref:`autoload 'singleton' node <doc_singletons_autoload>`.
it: ... allora dovresti creare un nodo :ref:`autoload 'singleton' <doc_singletons_autoload>`.
ta: ... பின்னர் நீங்கள் ஒரு: ref: `ஆட்டோலோட் 'சிங்கிள்டன்' முனை <doc_singletons_autoload>` உருவாக்க வேண்டும்.
zh_hant: ... 那麼您應該建立一個 :ref:`自動載入的「單例」節點 <doc_singletons_autoload>`。

source: For smaller games, a simpler alternative with less control would be to have a "Game" singleton that simply calls the :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` method to swap out the main scene's content. This structure more or less keeps the "World" as the main game node.
ga: I gcás cluichí níos lú, is é rogha eile níos simplí le níos lú smachta ná singil "Cluiche" a bheith ann a ghlaonn go simplí an :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` modh chun ábhar an phríomh radharc a mhalartú. Coinníonn an struchtúr seo níos mó nó níos lú an "Domhanda" mar an nód cluiche is mó.
it: Per i giochi più piccoli, un'alternativa più semplice con meno controllo sarebbe quella di avere un singleton "Game" che semplicemente chiama il metodo :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` per scambiare il contenuto della scena principale. Questa struttura mantiene più o meno "World" come nodo principale del gioco.
ta: சிறிய விளையாட்டுகளுக்கு, குறைந்த கட்டுப்பாட்டைக் கொண்ட ஒரு எளிய மாற்றாக, "கேம்" சிங்கிள்டன் வெறுமனே அழைக்கிறார்: real: `schange_scene_to_file () <class_scenetree_method_change_cene_to_file>` முக்கிய காட்சியின் உள்ளடக்கத்தை மாற்றுவதற்கான முறை. இந்த அமைப்பு அதிகமாகவோ அல்லது குறைவாகவோ "உலகத்தை" முக்கிய விளையாட்டு முனையாக வைத்திருக்கிறது.
tr: Daha küçük oyunlar için, daha az kontrole sahip daha basit bir alternatif, ana sahnenin içeriğini değiştirmek için basitçe :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` yöntemini çağıran bir "Game" tekil nesnesine sahip olmak olacaktır. Bu yapı aşağı yukarı "World" 'ü ana oyun düğümü olarak tutar.
zh_hant: 對於小型遊戲，一個較簡單但可控性較低的做法是建立一個「Game」單例，並單純呼叫 :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` 來切換主場景內容。這種架構會將「World」作為主要的遊戲節點保留。

source: Any GUI would also need to be either a singleton, a transitory part of the "World", or manually added as a direct child of the root. Otherwise, the GUI nodes would also delete themselves during scene transitions.
it: Ogni GUI dovrebbe anche essere un singleton, una parte transitoria di "World", oppure aggiunta manualmente come figlio diretto della radice. Altrimenti, i nodi della GUI si eliminerebbero anche durante le transizioni tra scene.
ta: எந்தவொரு GUI ஒரு சிங்கிள்டன், "உலகின்" இடைக்கால பகுதியாக இருக்க வேண்டும், அல்லது வேரின் நேரடி குழந்தையாக கைமுறையாக சேர்க்கப்பட வேண்டும். இல்லையெனில், GUI முனைகள் காட்சி மாற்றங்களின் போது தங்களை நீக்கிவிடும்.
zh_hant: 任何 GUI 也需要是單例（singleton）、世界（World）的暫時性部分，或是手動新增為根節點的直接子節點。否則，GUI 節點也會在場景切換期間自行刪除。

source: If you have systems that modify other systems' data, you should define those as their own scripts or scenes, rather than autoloads. For more information, see :ref:`Autoloads versus regular nodes <doc_autoloads_versus_internal_nodes>`.
it: Se hai sistemi che modificano i dati di altri sistemi, dovresti definirli come script o scene propri, anziché come autoload. Per ulteriori informazioni, consulta :ref:`Autoload rispetto a nodi normali <doc_autoloads_versus_internal_nodes>`.
ta: மற்ற அமைப்புகளின் தரவை மாற்றியமைக்கும் அமைப்புகள் உங்களிடம் இருந்தால், அவற்றை ஆட்டோலோட்களைக் காட்டிலும் அவற்றின் சொந்த ச்கிரிப்ட்கள் அல்லது காட்சிகளாக வரையறுக்க வேண்டும். மேலும் தகவலுக்கு, காண்க: ref: `ஆட்டோலோட்ச் மற்றும் வழக்கமான முனைகளுக்கு எதிராக <doc_autoloads_versus_internal_nodes>`.
zh_hant: 如果您有會修改其他系統資料的系統，您應該將它們定義為獨立的腳本或場景，而不是自動載入。更多資訊請參閱：:ref:`自動載入與一般節點的比較 <doc_autoloads_versus_internal_nodes>` 。

source: Each subsystem within your game should have its own section within the SceneTree. You should use parent-child relationships only in cases where nodes are effectively elements of their parents. Does removing the parent reasonably mean that the children should also be removed? If not, then it should have its own place in the hierarchy as a sibling or some other relation.
it: Ogni sotto-sistema del gioco dovrebbe avere una propria sezione all'interno dello SceneTree. Dovresti utilizzare le relazioni padre-figlio solo nei casi in cui i nodi siano effettivamente elementi dei rispettivi genitori. Rimuovere il genitore significa che anche i figli debbano essere rimossi? In caso contrario, dovrebbe avere un propria posto nella gerarchia come fratello o in un'altra relazione.
ta: உங்கள் விளையாட்டிற்குள் உள்ள ஒவ்வொரு துணை அமைப்பும் காட்சிக்குள் அதன் சொந்த பகுதியைக் கொண்டிருக்க வேண்டும். முனைகள் தங்கள் பெற்றோரின் திறம்பட கூறுகளாக இருக்கும் சந்தர்ப்பங்களில் மட்டுமே நீங்கள் பெற்றோர்-குழந்தை உறவுகளைப் பயன்படுத்த வேண்டும். பெற்றோரை அகற்றுவது குழந்தைகளையும் அகற்ற வேண்டும் என்று அர்த்தமா? இல்லையென்றால், அது ஒரு உடன்பிறப்பு அல்லது வேறு ஏதேனும் உறவாக வரிசைக்கு அதன் சொந்த இடத்தைக் கொண்டிருக்க வேண்டும்.
zh_hant: 您遊戲中的每個子系統都應該在場景樹中擁有自己的區塊。您應該只在節點實際上是其父節點的組成元素時，才使用父子關係。移除父節點是否合理地意味著子節點也應該被移除？如果不是，那麼它應該在層級結構中作為同層級節點或其他關係擁有自己的位置。

source: In some cases, you need these separated nodes to *also* position themselves relative to each other. You can use the :ref:`RemoteTransform <class_RemoteTransform3D>` / :ref:`RemoteTransform2D <class_RemoteTransform2D>` nodes for this purpose. They will allow a target node to conditionally inherit selected transform elements from the Remote\* node. To assign the ``target`` :ref:`NodePath <class_NodePath>`, use one of the following:
it: In alcuni casi, è necessario che questi nodi separati *anche* si posizionino l'uno rispetto all'altro. A questo scopo, puoi utilizzare i nodi :ref:`RemoteTransform <class_RemoteTransform3D>` / :ref:`RemoteTransform2D <class_RemoteTransform2D>`. Questi consentono a un nodo di destinazione di ereditare in modo condizionale gli elementi scelti della trasformazione dal nodo Remote\*. Per assegnare il :ref:`NodePath <class_NodePath>` all'obiettivo (``target``), utilizza uno dei seguenti:
ta: சில சந்தர்ப்பங்களில், இந்த பிரிக்கப்பட்ட முனைகள் * ஒருவருக்கொருவர் உறவினர்களைப் பற்றி நிலைநிறுத்த வேண்டும். நீங்கள் பயன்படுத்தலாம்: ref: `ரிமோட்டெட்ரான்ச்ஃபார்ம் <class_remotetransform3d>` /: ref: `ரிமோட்டெட்ரான்ச்ஃபார்ம் 2 டி <class_remotetransform2d>` இந்த நோக்கத்திற்காக முனைகள். தொலைநிலை \* முனையிலிருந்து தேர்ந்தெடுக்கப்பட்ட உருமாற்ற கூறுகளை நிபந்தனையுடன் மரபுரிமையாகப் பெற இலக்கு முனையை அவை அனுமதிக்கும். `` இலக்கு``: ref: `nodepath <class_nodepath>`, பின்வருவனவற்றில் ஒன்றைப் பயன்படுத்தவும்:
zh_hant: 在某些情況下，您會需要這些分離的節點彼此之間也能夠相對定位。您可以使用 :ref:`RemoteTransform3D <class_RemoteTransform3D>` / :ref:`RemoteTransform2D <class_RemoteTransform2D>` 節點來達成這個目的。它們能讓目標節點有條件地繼承來自 Remote\* 節點所選取的變形元素。要指定 ``target`` :ref:`NodePath <class_NodePath>`，請使用下列其中一種方式：

source: A reliable third party, likely a parent node, to mediate the assignment.
ga: Tríú páirtí iontaofa, tuismitheoir nód is dócha, chun idirghabháil a dhéanamh ar an sannadh.
it: Una terza parte affidabile, probabilmente un nodo padre, che fa da mediatore per l'assegnazione.
ta: நம்பகமான மூன்றாம் தரப்பு, பெற்றோர் முனை, வேலைக்கு மத்தியச்தம் செய்ய.
tr: Atamaya aracılık edecek güvenilir bir üçüncü taraf, muhtemelen bir üst öge düğüm.
zh_hant: 可信的第三方，可能是母節點，來居中分配。

source: A group, to pull a reference to the desired node (assuming there will only ever be one of the targets).
it: Un gruppo, per ottenere un riferimento al nodo desiderato (supponendo che ci sarà sempre solo uno degli obiettivi).
ta: ஒரு குழு, விரும்பிய முனைக்கு ஒரு குறிப்பை இழுக்க (எப்போதும் இலக்குகளில் ஒன்று மட்டுமே இருக்கும் என்று கருதி).
zh_hant: 一個群組，用於拉取對目標節點的參照（假設目標只會有一個）。

source: When you should do this is subjective. The dilemma arises when you must micro-manage when a node must move around the SceneTree to preserve itself. For example...
it: Il momento in cui farlo è soggettivo. Il dilemma sorge quando è necessario gestire in dettaglio un nodo che deve muoversi intorno allo SceneTree per preservare se stesso. Per esempio...
ta: நீங்கள் இதைச் செய்யும்போது அகநிலை. தன்னைப் பாதுகாத்துக் கொள்ள ஒரு முனை காட்சியைச் சுற்றி செல்லும்போது நீங்கள் மைக்ரோ-மேனேச் செய்யும்போது குழப்பம் எழுகிறது. உதாரணமாக ...
zh_hant: 何時應該這樣做是很主觀的。當你為了保存節點而必須細微地管理它在場景樹中的移動時，這個難題就產生了。例如...

source: Add a "player" node to a "room".
ga: Cuir nód “imreoir” le “seomra”.
it: Aggiungi un nodo "giocatore" a una "stanza".
ta: ஒரு "அறையில்" ஒரு "பிளேயர்" முனையைச் சேர்க்கவும்.
tr: Bir "oda"ya bir "oyuncu" düğümü eklersiniz.
zh_hant: 將「玩家」節點加到「房間」中。

source: Need to change rooms, so you must delete the current room.
it: Bisogna cambiare stanza, quindi devi eliminare la stanza attuale.
ta: அறைகளை மாற்ற வேண்டும், எனவே நீங்கள் தற்போதைய அறையை நீக்க வேண்டும்.
zh_hant: 需要更換房間，因此您必須刪除目前的房間。

source: Before the room can be deleted, you must preserve and/or move the player.
it: Prima di poter eliminare la stanza, è necessario conservare e/o spostare il giocatore.
ta: அறையை நீக்குவதற்கு முன், நீங்கள் வீரரைப் பாதுகாக்க வேண்டும் மற்றும்/அல்லது நகர்த்த வேண்டும்.
zh_hant: 在刪除房間之前，您必須保留和/或移動玩家。

source: If memory is not a concern, you can...
it: Se la memoria non è un problema, puoi...
ta: நினைவகம் ஒரு கவலையாக இல்லாவிட்டால், உங்களால் முடியும் ...
tr: Eğer bellek dert değilse, yapılabilecekler...
zh_hant: 如果記憶體不是問題，你可以...

source: Create the new room.
it: Creare la nuova stanza.
ta: புதிய அறையை உருவாக்கவும்.
zh_hant: 建立新的房間。

source: Move the player to the new room.
it: Muovere il giocatore nella nuova stanza.
ta: வீரரை புதிய அறைக்கு நகர்த்தவும்.
zh_hant: 將玩家移動到新的房間。

source: Delete the old room.
it: Eliminare la vecchia stanza.
ta: பழைய அறையை நீக்கு.
zh_hant: 刪除舊房間。

source: If memory is a concern, instead you will need to...
it: Se la memoria è un problema, allora dovrai...
ta: நினைவகம் ஒரு கவலையாக இருந்தால், அதற்கு பதிலாக நீங்கள் செய்ய வேண்டும் ...
zh_hant: 如果考量到記憶體用量，那麼你需要...

source: Move the player somewhere else in the tree.
ga: Bog an t-imreoir áit éigin eile sa chrann.
it: Spostare il giocatore da qualche altro posto nell'albero di scene.
ta: மரத்தில் வேறு எங்காவது வீரரை நகர்த்தவும்.
tr: Oyuncuyu ağaçta başka bir yere taşıyın.
zh_hant: 將玩家移動到樹狀結構中其他地方。

source: Delete the room.
ga: Scrios an seomra.
it: Eliminare la stanza.
ta: அறையை நீக்கு.
tr: Odayı silin.
zh_hant: 刪除房間。

source: Instantiate and add the new room.
ga: Cuir an seomra nua isteach agus cuir leis.
it: Istanziare e aggiungere la nuova stanza.
ta: உடனடி மற்றும் புதிய அறையைச் சேர்க்கவும்.
tr: Yeni odayı örnekleyin ve ekleyin.
zh_hant: 實體化並建立新的房間。

source: Re-add the player to the new room.
it: Ri-aggiungere il giocatore alla nuova stanza.
ta: புதிய அறைக்கு வீரரை மீண்டும் சேர்க்கவும்.
zh_hant: 將玩家重新加入新的房間。

source: The issue is that the player here is a "special case" where the developers must *know* that they need to handle the player this way for the project. The only way to reliably share this information as a team is to *document* it. Keeping implementation details in documentation is dangerous. It's a maintenance burden, strains code readability, and unnecessarily bloats the intellectual content of a project.
it: Il problema è che il giocatore in questo caso è un "caso speciale" in cui gli sviluppatori devono *sapere* di doverlo gestire in questo modo per il progetto. L'unico modo per condividere queste informazioni in modo affidabile come team è *documentarle*. Mantenere i dettagli di implementazione nella documentazione è pericoloso. È un peso per la manutenzione, compromette la leggibilità del codice e appesantisce inutilmente il contenuto intellettuale di un progetto.
ta: சிக்கல் என்னவென்றால், இங்குள்ள வீரர் ஒரு "சிறப்பு வழக்கு", அங்கு உருவாக்குபவர்கள் திட்டத்திற்காக வீரரை இந்த வழியில் கையாள வேண்டும் என்பதை * தெரிந்து கொள்ள வேண்டும். ஒரு குழுவாக இந்த தகவலை நம்பத்தகுந்த முறையில் பகிர்ந்து கொள்வதற்கான ஒரே வழி * ஆவணப்படுத்துவது *. செயல்படுத்தல் விவரங்களை ஆவணங்களில் வைத்திருப்பது ஆபத்தானது. இது ஒரு பராமரிப்பு சுமை, விகாரங்கள் குறியீடு வாசிப்புத்திறன் மற்றும் ஒரு திட்டத்தின் அறிவுசார் உள்ளடக்கத்தை தேவையில்லாமல் பூக்கும்.
zh_hant: 問題在於此處的玩家是一個「特殊情況」，開發者必須「知道」專案需要以這種方式處理玩家。團隊可靠地共享此資訊的唯一方法是將其「文件化」。將實作細節保留在文件中是很危險的。這會增加維護負擔、降低程式碼可讀性，並不必要地膨脹專案的智力內容。

source: In a more complex game with larger assets, it can be a better idea to keep the player somewhere else in the SceneTree entirely. This results in:
it: In un gioco più complesso con risorse più grandi, potrebbe essere più opportuno mantenere il giocatore totalmente da qualche altro posto nello SceneTree. Questo risulta in:
ta: பெரிய சொத்துக்களைக் கொண்ட மிகவும் சிக்கலான விளையாட்டில், வீரரை வேறு எங்காவது காட்சிப்படுத்துவது சிறந்த யோசனையாக இருக்கும். இது விளைகிறது:
zh_hant: 在擁有較大型素材的複雜遊戲中，將玩家物件完全放在場景樹的其他地方可能會是更好的做法。這會帶來：

source: More consistency.
ga: Níos mó comhsheasmhachta.
it: Più coerenza.
ta: மேலும் நிலைத்தன்மை.
tr: Daha fazla tutarlılık.
zh_hant: 一致性更高。

source: No "special cases" that must be documented and maintained somewhere.
ga: Níl aon “cásanna speisialta” nach mór a dhoiciméadú agus a chothabháil áit éigin.
it: Nessun "caso speciale" che debba essere documentato e mantenuto da qualche parte.
ta: "சிறப்பு வழக்குகள்" இல்லை, அவை எங்காவது ஆவணப்படுத்தப்பட்டு பராமரிக்கப்பட வேண்டும்.
tr: Belgelenmesi ve bir yerde bakımının yapılması gereken "özel durumlar" yok.
zh_hant: 沒有必須要寫成文件並在其他地方維護的「特例」。
