Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/scene_organization.po
Languages: ga, it, ta, tr, zh_hant

source: No opportunity for errors to occur because these details are not accounted for.
ga: Níl aon deis ann go dtarlóidh earráidí toisc nach gcuirtear cuntas ar na sonraí seo.
it: Nessuna opportunità che si verifichino errori a causa di questi dettagli non presi in considerazione.
ta: பிழைகள் ஏற்பட வாய்ப்பில்லை, ஏனெனில் இந்த விவரங்கள் கணக்கிடப்படவில்லை.
tr: Böyle detaylar dahil olmadığı için hata oluşma ihtimali yoktur.
zh_hant: 不會因為沒有注意到細節而有發生錯誤的機會。

source: In contrast, if you ever need a child node that does *not* inherit the transform of its parent, you have the following options:
it: Al contrario, se mai avessi bisogno di un nodo figlio che *non* erediti la trasformazione del suo genitore, hai le seguenti opzioni:
ta: இதற்கு நேர்மாறாக, உங்களுக்கு எப்போதாவது ஒரு குழந்தை முனை தேவைப்பட்டால், அதன் பெற்றோரின் மாற்றத்தை * பெறாதது *, உங்களுக்கு பின்வரும் விருப்பங்கள் உள்ளன:
zh_hant: 相對地，如果您需要一個 **不** 繼承其父節點變形（transform）的子節點，您可以考慮以下選項：

source: The **declarative** solution: place a :ref:`Node <class_Node>` in between them. Since it doesn't have a transform, they won't pass this information to its children.
it: La soluzione **dichiarativa**: inserisci un :ref:`Node <class_Node>` tra di loro. Dato che non ha una trasformazione, non passerà questa informazione ai suoi figli.
ta: ** அறிவிப்பு ** தீர்வு: இடம் a: ref: `முனை <class_node>` அவற்றுக்கிடையே. இது ஒரு உருமாற்றத்தைக் கொண்டிருக்கவில்லை என்பதால், அவர்கள் இந்த தகவலை அதன் குழந்தைகளுக்கு அனுப்ப மாட்டார்கள்.
zh_hant: **宣告式** 解決方案：在它們之間放置一個 :ref:`節點 <class_Node>`。由於它沒有變換（transform），因此不會將此資訊傳遞給其子節點。

source: The **imperative** solution: Use the ``top_level`` property for the :ref:`CanvasItem <class_CanvasItem_property_top_level>` or :ref:`Node3D <class_Node3D_property_top_level>` node. This will make the node ignore its inherited transform.
ga: An réiteach **riachtanach**: Úsáid an t-airí ``top_level`` don nód :ref:`CanvasItem <class_CanvasItem_property_top_level>` nó :ref:`Node3D <class_Node3D_property_top_level>`. Cuirfidh sé seo ar an nód neamhaird a dhéanamh ar a chlaochlú le hoidhreacht.
it: La soluzione **imperativa**: utilizza la proprietà ``top_level`` per il nodo :ref:`CanvasItem <class_CanvasItem_property_top_level>` o :ref:`Node3D <class_Node3D_property_top_level>`. Questo consentirà al nodo di ignorare la trasformazione ereditata.
ta: ** கட்டாய ** தீர்வு: `` டாப்_லெவல்`` சொத்தைப் பயன்படுத்தவும்: ref: `canswasitem <class_canvasitem_property_top_level>` or: ref: `node3d <class_node3d_property_top_level>` node. இது முனை அதன் பரம்பரை மாற்றத்தை புறக்கணிக்கும்.
tr: **Emredici** çözüm: :ref:`CanvasItem <class_CanvasItem_property_top_level>` veya :ref:`Node3D <class_Node3D_property_top_level>` düğümü için ``top_level`` özelliğini kullanın. Bu, düğümün devralınan dönüşümü yok saymasını sağlayacaktır.
zh_hant: **指令式** 解法：在 :ref:`CanvasItem <class_CanvasItem_property_top_level>` 或 :ref:`Node3D <class_Node3D_property_top_level>` 節點上設定 ``top_level`` 屬性。這樣該節點會忽略繼承來的變換。

source: If building a networked game, keep in mind which nodes and gameplay systems are relevant to all players versus those just pertinent to the authoritative server. For example, users do not all need to have a copy of every players' "PlayerController" logic - they only need their own. Keeping them in a separate branch from the "world" can help simplify the management of game connections and the like.
it: Se stai creando un gioco in rete, tieni presente quali nodi e sistemi di gioco sono rilevanti per tutti i giocatori e quali sono pertinenti solo al server autorevole. Ad esempio, non tutti gli utenti devono avere una copia della logica "PlayerController" di ogni giocatore: basta la propria logica. Mantenerli in un ramo separato dal "mondo" può contribuire a semplificare la gestione delle connessioni di gioco e simili.
ta: பிணையம் விளையாட்டை உருவாக்கினால், அதிகாரப்பூர்வ சேவையகத்துடன் தொடர்புடையவர்கள் மற்றும் அனைத்து வீரர்களுக்கும் எந்த முனைகள் மற்றும் விளையாட்டு அமைப்புகள் பொருத்தமானவை என்பதை நினைவில் கொள்ளுங்கள். எடுத்துக்காட்டாக, பயனர்கள் அனைவருக்கும் ஒவ்வொரு வீரர்களின் "பிளேயர்கண்ட்ரோலர்" தர்க்கத்தின் நகலையும் வைத்திருக்க வேண்டிய அவசியமில்லை - அவர்களுக்கு மட்டுமே தேவை. "உலகில்" இருந்து ஒரு தனி கிளையில் அவற்றை வைத்திருப்பது விளையாட்டு இணைப்புகள் மற்றும் பலவற்றின் நிர்வாகத்தை எளிதாக்க உதவும்.
zh_hant: 如果正在開發網路遊戲，請記住哪些節點和遊戲系統是所有玩家都相關的，哪些僅適用於權威伺服器。例如，使用者並不需要擁有每個玩家「PlayerController」邏輯的副本 - 他們只需要自己的。將這些邏輯放在與「世界」不同的分支中，有助於簡化遊戲連線等管理。

source: The key to scene organization is to consider the SceneTree in relational terms rather than spatial terms. Are the nodes dependent on their parent's existence? If not, then they can thrive all by themselves somewhere else. If they are dependent, then it stands to reason that they should be children of that parent (and likely part of that parent's scene if they aren't already).
ga: Is é an eochair d'eagrú radhairc ná an SceneTree a mheas i dtéarmaí coibhneasta seachas téarmaí spásúla. An bhfuil na nóid ag brath ar a dtuismitheoir? Mura bhfuil, ansin is féidir leo rathú leo féin áit éigin eile. Má tá siad cleithiúnach, ansin is cúis leis gur chóir go mbeadh siad ina leanaí den tuismitheoir sin (agus is dócha gur cuid de radharc an tuismitheora sin mura bhfuil siad cheana féin).
it: La chiave dell'organizzazione di una scena è considerare lo SceneTree in termini relazionali piuttosto che spaziali. I nodi dipendono dall'esistenza del genitore? Se no, possono prosperare tutti da soli altrove. Se sono dipendenti, allora è logico che debbano essere figli di quel genitore (e probabilmente parte della scena di quel genitore, se non lo sono già).
ta: காட்சி அமைப்பின் திறவுகோல் இடஞ்சார்ந்த சொற்களைக் காட்டிலும் காட்சியை தொடர்புடைய சொற்களில் கருத்தில் கொள்வது. முனைகள் பெற்றோரின் இருப்பைப் பொறுத்தது? இல்லையென்றால், அவர்கள் அனைவரையும் வேறு எங்காவது செழித்து வளர முடியும். அவர்கள் சார்ந்து இருந்தால், அவர்கள் அந்த பெற்றோரின் குழந்தைகளாக இருக்க வேண்டும் என்பதற்கான காரணத்தை இது குறிக்கிறது (மேலும் அவர்கள் ஏற்கனவே இல்லையென்றால் அந்த பெற்றோரின் காட்சியின் ஒரு பகுதியாக இருக்கலாம்).
tr: Sahne düzeninin anahtarı, sahne ağacını uzamsal terimlerden ziyade ilişkisel terimlerle ele almaktır. Düğümler üst ögelerinin varlığına bağımlı mı? Değilse, başka bir yerde kendi başlarına gelişebilirler. Eğer bağımlı iseler, o zaman o ögenin alt ögeleri olmaları mantıklıdır (ve henüz değillerse muhtemelen o ögenin sahnesinin bir parçası olmaları).
zh_hant: 場景組織的關鍵就是要以關聯的方式來考量 SceneTree 而不是用空間性來考量。節點是否會仰賴母節點的存在？若不仰賴，則節點可以就完全可以在別的地方活得好好的。若有依賴母節點，則這種依賴關係就是子節點要是母節點的子節點的原因 (而且，顯然必須是母節點的場景中的一部分，如果還不是母節點的場景中的一部分的話)。

source: Does this mean nodes themselves are components? Not at all. Godot's node trees form an aggregation relationship, not one of composition. But while you still have the flexibility to move nodes around, it is still best when such moves are unnecessary by default.
it: Ciò significa che i nodi stessi sono componenti? Niente affatto. Gli alberi di nodi di Godot formano una relazione di aggregazione, non di composizione. Tuttavia, pur mantenendo la flessibilità di spostare i nodi, è comunque preferibile che tali spostamenti non siano necessari normalmente.
ta: இதன் பொருள் முனைகளே கூறுகள்? இல்லை. கோடோட்டின் முனை மரங்கள் ஒரு திரட்டல் உறவை உருவாக்குகின்றன, இது கலவையில் ஒன்றல்ல. முனைகளை நகர்த்துவதற்கான நெகிழ்வுத்தன்மை உங்களிடம் இருக்கும்போது, இதுபோன்ற நகர்வுகள் இயல்பாகவே தேவையற்றதாக இருக்கும்போது இன்னும் சிறந்தது.
zh_hant: 這表示節點本身就是組件嗎？一點也不是。Godot 的節點樹形成的是聚合關係，而不是組合關係。不過，雖然您仍然可以彈性地移動節點，但預設情況下最好還是避免這種移動。

source: Node2D/Node3D "World" (game_world.gd)
ga: Node2D/Node3D “Domhan” (game_world.gd)
zh_hant: Node2D/Node3D “世界”（game_world.gd）
