Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/scene_organization.po
Languages: ga, it, ta, tr, zh_hant

source: Scene organization
ga: Eagraíocht radhairc
it: Organizzazione di una scena
ta: காட்சி அமைப்பு
tr: Sahne düzenlemesi
zh_hant: 場景組織

source: This article covers topics related to the effective organization of scene content. Which nodes should you use? Where should you place them? How should they interact?
it: Questo articolo tratta argomenti riguardo l'organizzazione efficace dei contenuti di una scena. Quali nodi utilizzare? Dove posizionarli? Come dovrebbero interagire?
ta: இந்த கட்டுரை காட்சி உள்ளடக்கத்தின் பயனுள்ள அமைப்பு தொடர்பான தலைப்புகளை உள்ளடக்கியது. நீங்கள் எந்த முனைகளைப் பயன்படுத்த வேண்டும்? அவற்றை எங்கே வைக்க வேண்டும்? அவர்கள் எவ்வாறு தொடர்பு கொள்ள வேண்டும்?
zh_hant: 本篇文章涵蓋了與有效組織場景內容相關的主題。您應該使用哪些節點？應該將它們放置在哪裡？它們應該如何互動？

source: How to build relationships effectively
ga: Conas caidrimh a thógáil go hé
it: Come costruire relazioni in modo efficace
ta: உறவுகளை எவ்வாறு திறம்பட உருவாக்குவது
tr: Nasıl etkili bir şekilde ilişkiler kurulur
zh_hant: 如何有效地建立關係

source: When Godot users begin crafting their own scenes, they often run into the following problem:
ga: Nuair a thosaíonn úsáideoirí Godot ag ceardú a radhairc féin, is minic a bhíonn siad isteach sa fhadhb seo a leanas:
it: Quando gli utenti di Godot iniziano a creare le proprie scene, spesso si imbattono nel seguente problema:
ta: கோடோட் பயனர்கள் தங்கள் சொந்த காட்சிகளை வடிவமைக்கத் தொடங்கும் போது, அவர்கள் பெரும்பாலும் பின்வரும் சிக்கலுக்கு வருகிறார்கள்:
tr: Godot kullanıcıları kendi sahnelerini üretmeye başladıklarında genellikle aşağıdaki sorunla karşılaşıyorlar:
zh_hant: 當 Godot 使用者開始製作自己的場景時，通常會遇到下列問題：

source: They create their first scene and fill it with content only to eventually end up saving branches of their scene into separate scenes as the nagging feeling that they should split things up starts to accumulate. However, they then notice that the hard references they were able to rely on before are no longer possible. Re-using the scene in multiple places creates issues because the node paths do not find their targets and signal connections established in the editor break.
ga: Cruthaíonn siad a gcéad radharc agus líonann siad é le hábhar ach sa deireadh go sábhálann siad craobhacha dá radharc ina radhairc ar leith de réir mar a thosaíonn an mhothú nagging gur chóir dóibh rudaí a scoilt suas ag carnadh. Mar sin féin, tugann siad faoi deara ansin nach féidir a thuilleadh na teistiméireachtaí crua a raibh siad in ann brath orthu roimhe seo. Cruthaíonn athúsáid an radharc in áiteanna iolracha fadhbanna toisc nach n-aimsíonn na cosáin nód a gcuid spriocanna agus naisc chomharthaí a bunaíodh le linn briseadh an eagarthóra.
it: Creano la loro prima scena e la riempiono di contenuti, solo per poi ritrovarsi a salvare rami della loro scena in scene separate, man mano che comincia ad accumularsi la fastidiosa sensazione di dover suddividere il tutto. Però poi, si accorgono che i riferimenti rigidi, su cui potevano contare prima, non sono più possibili. Riutilizzare la scena in più posti crea problemi perché i percorsi dei nodi non trovano le loro destinazioni e le connessioni dei segnali stabilite nell'editor si rompono.
ta: அவர்கள் தங்கள் முதல் காட்சியை உருவாக்கி, அதை உள்ளடக்கத்துடன் நிரப்புகிறார்கள், இறுதியில் தங்கள் காட்சியின் கிளைகளை தனித்தனி காட்சிகளாக சேமிப்பதை முடிக்கிறார்கள், ஏனெனில் அவர்கள் விசயங்களைப் பிரிக்க வேண்டும் என்ற மோசமான உணர்வு குவிக்கத் தொடங்குகிறது. இருப்பினும், அவர்கள் முன்பு நம்ப முடிந்த கடினமான குறிப்புகள் இனி சாத்தியமில்லை என்பதை அவர்கள் கவனிக்கிறார்கள். பல இடங்களில் காட்சியை மீண்டும் பயன்படுத்துவது சிக்கல்களை உருவாக்குகிறது, ஏனெனில் முனை பாதைகள் அவற்றின் இலக்குகளையும், எடிட்டர் இடைவேளையில் நிறுவப்பட்ட சமிக்ஞை இணைப்புகளையும் காணவில்லை.
tr: İlk sahnelerini yaratırlar ve onu içerikle doldururlar, ancak sonunda sahnelerinin dallarını ayrı sahnelere kaydetmeye başlarlar, çünkü bir şeyleri bölmeleri gerektiğine dair rahatsız edici bir his birikmeye başlar. Ancak daha sonra, daha önce güvenebildikleri sabit referansların artık mümkün olmadığını fark ederler. Sahnenin birden fazla yerde yeniden kullanılması sorun yaratır çünkü düğüm yolları hedeflerini bulamaz ve düzenleyicide kurulan sinyal bağlantıları kopar.
zh_hant: 建立好第一個場景並往場景中加上內容，最後會開始覺得場景逐漸變得複雜，應該要把東西都切割成小塊，所以就將場景中的各個分支都保存為獨立的場景。但是，接著就會發現之前在腳本裡直接引用其他節點的方法不能用了。在多個地方重複使用場景也會出問題，因為沒辦法用節點路徑找到目標，然後在編輯器中建的訊號連接也會斷開。

source: To fix these problems, you must instantiate the sub-scenes without them requiring details about their environment. You need to be able to trust that the sub-scene will create itself without being picky about how it's used.
it: Per risolvere questi problemi, è necessario istanziare le sotto-scene senza che richiedano dettagli sul loro ambiente. Bisogna potersi fidare che la sotto-scena si creerà da sola, senza che sia pignola su come sarà utilizzata.
ta: இந்த சிக்கல்களை சரிசெய்ய, துணை காட்சிகளை அவற்றின் சூழல் குறித்த விவரங்கள் தேவையில்லாமல் உடனடிப்படுத்த வேண்டும். துணை காட்சி எவ்வாறு பயன்படுத்தப்படுகிறது என்பதைப் பற்றி சேகரிக்காமல் தன்னை உருவாக்கும் என்று நீங்கள் நம்ப வேண்டும்.
zh_hant: 為了解決這些問題，您必須實例化子場景，使其不需要關於其環境的詳細資訊。您需要能夠信任子場景會自行建立，而不會挑剔其使用方式。

source: One of the biggest things to consider in OOP is maintaining focused, singular-purpose classes with `loose coupling <https://en.wikipedia.org/wiki/Loose_coupling>`_ to other parts of the codebase. This keeps the size of objects small (for maintainability) and improves their reusability.
ga: Ceann de na rudaí is mó atá le cur san áireamh in OOP ná ranganna fócasaithe uatha a choinneáil le `chúpláil scaoilte <https://en.wikipedia.org/wiki/Loose_coupling>`_ chuig codanna eile den bhunachar cód. Coinníonn sé seo méid na n-ábhar beag (le haghaidh cothabhála) agus feabhsaíonn sé a n-ath-inúsáidteacht.
ta: OOP இல் கருத்தில் கொள்ள வேண்டிய மிகப்பெரிய விசயங்களில் ஒன்று, `தளர்வான இணைப்பு <https://en.wikipedia.org/wiki/loose_coupleing>` _ கோட்பேசின் பிற பகுதிகளுக்கு கவனம் செலுத்தும், ஒற்றை-நோக்கம் வகுப்புகளை பராமரிக்கிறது. இது பொருட்களின் அளவை சிறியதாக வைத்திருக்கிறது (பராமரிப்புக்காக) மற்றும் அவற்றின் மறுபயன்பாட்டை மேம்படுத்துகிறது.
tr: OOP'de dikkat edilmesi gereken en önemli şeylerden biri, kod tabanının diğer bölümlerine `gevşek bağlama / loose coupling <https://en.wikipedia.org/wiki/Loose_coupling>`_ yoluyla, sınıfları odaklanmış, tek amaçlı tutmaktır. Bu, nesnelerin boyutunu küçük tutar (sürdürülebilirlik için) ve yeniden kullanılabilirliklerini artırır.
zh_hant: OOP 中要考慮的最重要的一點就是要維持一個專注且單一目的的類別，並與程式碼中其他部分 `鬆散耦合 <https://zh.wikipedia.org/zh-tw/%E6%9D%BE%E8%80%A6%E5%90%88>`_ 。這樣可以讓物件的大小維持得比較小 (為了可維護性) 並提高類別的可用性。

source: These OOP best practices have *several* implications for best practices in scene structure and script usage.
ga: Baine* roinnt impleachtaí ag na dea-chleachtais OOP seo maidir le dea-chleachtais i struchtúr radhairc agus úsáid script.
it: Queste migliori pratiche della OOP hanno *numerose* implicazioni per le migliori pratiche nella struttura delle scene e nell'utilizzo degli script.
ta: இந்த OOP சிறந்த நடைமுறைகள் காட்சி அமைப்பு மற்றும் ச்கிரிப்ட் பயன்பாட்டில் சிறந்த நடைமுறைகளுக்கு பல * தாக்கங்களைக் கொண்டுள்ளன.
tr: Bu OOP en iyi pratiklerinin, sahne yapısı ve betik kullanımındaki en iyi pratikler için *çeşitli* etkileri vardır.
zh_hant: 這些 OOP 最佳實踐在場景結構與腳本使用上實際是 **數種** 最佳實踐。

source: **If at all possible, you should design scenes to have no dependencies.** That is, you should create scenes that keep everything they need within themselves.
it: **Se possibile, progettare scene in modo che non abbiano dipendenze.** Vale a dire, creare scene che contengano tutto ciò di cui hanno bisogno al loro interno.
ta: ** முடிந்தால், நீங்கள் எந்த சார்புகளும் இல்லாத காட்சிகளை வடிவமைக்க வேண்டும். ** அதாவது, அவர்களுக்குத் தேவையான அனைத்தையும் தங்களுக்குள் வைத்திருக்கும் காட்சிகளை நீங்கள் உருவாக்க வேண்டும்.
zh_hant: **如果可以的話，您應該設計場景使其沒有依賴性。** 也就是說，您應該創建將所需的一切都包含在自身之內的場景。

source: If a scene must interact with an external context, experienced developers recommend the use of `Dependency Injection <https://en.wikipedia.org/wiki/Dependency_injection>`_. This technique involves having a high-level API provide the dependencies of the low-level API. Why do this? Because classes which rely on their external environment can inadvertently trigger bugs and unexpected behavior.
ga: Más gá do radharc idirghníomhú le comhthéacs seachtrach, molann forbróirí a bhfuil taithí acu úsáid a bhaint as `Dependency Injection <https://en.wikipedia.org/wiki/Dependency_injection>`_. Is éard atá i gceist leis an teicníc seo ná API ardleibhéil a sholáthar do spleáchais an API íseal-leibhéil. Cén fáth é seo a dhéanamh? Toisc gur féidir le ranganna atá ag brath ar a dtimpeallacht sheachtrach fabhtanna agus iompar gan choinne a spreagadh.
it: Se una scena deve interagire con un contesto esterno, gli sviluppatori esperti raccomandano l'uso della `Dependency injection <https://it.wikipedia.org/wiki/Dependency_injection>`_. Questa tecnica prevede che un'API di alto livello fornisca le dipendenze dell'API di basso livello. Perché fare così? Perché le classi che si basano sul loro ambiente esterno possono inavvertitamente causare bug e comportamenti imprevisti.
ta: ஒரு காட்சி வெளிப்புற சூழலுடன் தொடர்பு கொள்ள வேண்டும் என்றால், பட்டறிவு வாய்ந்த உருவாக்குபவர்கள் `சார்பு ஊசி <https://en.wikipedia.org/wiki/dependency_inection>` _ ஆகியவற்றைப் பயன்படுத்த பரிந்துரைக்கின்றனர். இந்த நுட்பம் ஒரு உயர் மட்ட பநிஇ குறைந்த அளவிலான பநிஇ சார்புகளை வழங்குவதை உள்ளடக்கியது. இது ஏன்? ஏனெனில் அவற்றின் வெளிப்புற சூழலை நம்பியிருக்கும் வகுப்புகள் கவனக்குறைவாக பிழைகள் மற்றும் எதிர்பாராத நடத்தையைத் தூண்டும்.
tr: Bir sahnenin harici bir bağlamla etkileşime girmesi gerekiyorsa, deneyimli geliştiriciler `Dependency Injection <https://en.wikipedia.org/wiki/Dependency_injection>`_ kullanımını önermektedir. Bu teknik, üst-düzey bir API'nin alt-düzey API'nin bağımlılıklarını sağlamasını içerir. Bunu neden yapıyoruz? Çünkü dış ortamlarına bağlı olan sınıflar istemeden de olsa hataları ve beklenmedik davranışları tetikleyebilir.
zh_hant: 若場景必須要與外部的東西互動，則有經驗的工程師推薦使用 `依賴注入 <https://zh.wikipedia.org/zh-tw/%E4%BE%9D%E8%B5%96%E6%B3%A8%E5%85%A5>`_ 。這個技術是使用高等 API 來提動低等 API 的相依性。為什麼要這麼做？因為仰賴外部環境的類別可能會不小心觸發 Bug 或未預期的行為。

source: To do this, you must expose data and then rely on a parent context to initialize it:
it: Per fare ciò, è necessario esporre i dati e quindi fare affidamento su un contesto padre per inizializzarli:
ta: இதைச் செய்ய, நீங்கள் தரவை அம்பலப்படுத்த வேண்டும், பின்னர் அதைத் தொடங்க பெற்றோர் சூழலை நம்பியிருக்க வேண்டும்:
zh_hant: 若要這麼做，您必須公開資料，然後依賴父層上下文來初始化它：

source: Connect to a signal. Extremely safe, but should be used only to "respond" to behavior, not start it. By convention, signal names are usually past-tense verbs like "entered", "skill_activated", or "item_collected".
ga: Ceangail le comhartha. Tar a bheith sábháilte, ach ba chóir é a úsáid ach chun “fhreagairt” d'iompar, gan é a thosú. De réir choinbhinsiúin, is gnách go mbíonn ainmneacha comharthaí briathra caite mar “iontráilte”, “skill_activate”, nó “item_collection”.
it: Connettere a un segnale. Estremamente sicuro, ma dovrebbe essere usato solo per "rispondere" a un comportamento, non per avviarlo. Per convenzione, i nomi dei segnali sono solitamente verbi al passato come "entered" (inserito), "skill_activated" (abilità attivata) o "item_collected" (oggetto raccolto).
ta: ஒரு சமிக்ஞையுடன் இணைக்கவும். மிகவும் பாதுகாப்பானது, ஆனால் நடத்தைக்கு "பதிலளிக்க" மட்டுமே பயன்படுத்தப்பட வேண்டும், அதைத் தொடங்க வேண்டாம். மாநாட்டின் படி, சமிக்ஞை பெயர்கள் பொதுவாக "நுழைந்தவை", "திறன்_அக்டிவேட்டட்" அல்லது "ITEM_CELLECTED" போன்ற கடந்த கால வினைச்சொற்கள்.
tr: Bir sinyale bağlan. Son derece güvenli; fakat yalnız davranışa "karşılık vermek" için kullanılmalı, davranışı başlatmak için değil. Geleneksel olarak, sinyal isimleri genellikle "entered", "skill_activated", veya "item_collected" gibi geçmiş zaman eki almış fiillerden oluşur.
zh_hant: 連接訊號。非常安全，但訊號應該只用來「回覆」一個行為，而不是執行行為。請注意，訊號名稱通常使用過去式動詞，如「entered」、「skill_activated」或「item_collected」。

source: Call a method. Used to start behavior.
ga: Glaoigh ar mhodh. Úsáidtear chun iompar a thosú.
it: Chiamare un metodo. Utilizzato per avviare un comportamento.
ta: ஒரு முறையை அழைக்கவும். நடத்தை தொடங்க பயன்படுகிறது.
tr: Bir yöntemi çağır. Belirli bir davranışı başlatmak için kullanılır.
zh_hant: 呼叫方法。用於開始一個行為。

source: Initialize a :ref:`Callable <class_Callable>` property. Safer than a method as ownership of the method is unnecessary. Used to start behavior.
ga: Tosaigh maoin :ref:`Inghlaoite <class_Callable>`. Níos sábháilte ná modh mar ní gá úinéireacht an mhodha. Úsáidtear é chun iompar a thosú.
it: Inizializzare una proprietà :ref:`Callable <class_Callable>`. Più sicuro di un metodo, poiché non è necessario possederlo. Utilizzata per avviare un comportamento.
ta: துவக்க ஒரு: ref: `அழைக்கக்கூடிய <class_callable>` சொத்து. முறையின் உரிமையாக ஒரு முறையை விட பாதுகாப்பானது தேவையற்றது. நடத்தை தொடங்க பயன்படுகிறது.
tr: Bir :ref:`Çağrılabilir / Callable <class_Callable>` özelliğini ilk değerle. Yöntemin sahipliği gereksiz olduğu için bir yöntemden daha güvenlidir. Davranışı başlatmak için kullanılır.
zh_hant: 初始化 :ref:`Callable <class_Callable>` 屬性。比起方法物件更安全，因為無需考慮方法的所有權。用於啟動行為。

source: Initialize a Node or other Object reference.
ga: Tosaigh Nód nó tagairt Réad eile.
it: Inizializzare un nodo o un altro riferimento di oggetto.
ta: ஒரு முனை அல்லது பிற பொருள் குறிப்பைத் தொடங்கவும்.
tr: Bir Node veya başka bir Object başvurusunu ilk değerle.
zh_hant: 初始化 Node 或其他 Object 參照。

source: Initialize a NodePath.
ga: Tosaigh NodePath.
it: Inizializzare un percorso di nodo (NodePath).
ta: ஒரு நோட்பாத்தைத் தொடங்கவும்.
tr: Bir NodePath'i ilk değerle.
zh_hant: 初始化 NodePath。

source: These options hide the points of access from the child node. This in turn keeps the child **loosely coupled** to its environment. You can reuse it in another context without any extra changes to its API.
it: Queste opzioni nascondono i punti di accesso al nodo figlio. Ciò a sua volta mantiene il nodo figlio **debolmente accoppiato** al suo ambiente. È possibile riutilizzarlo in un altro contesto senza ulteriori modifiche alla sua API.
ta: இந்த விருப்பங்கள் குழந்தை முனையிலிருந்து அணுகலின் புள்ளிகளை மறைக்கின்றன. இது குழந்தையை ** தளர்வாக இணைத்து ** அதன் சூழலுடன் வைத்திருக்கிறது. அதன் பநிஇ இல் கூடுதல் மாற்றங்கள் இல்லாமல் நீங்கள் அதை மற்றொரு சூழலில் மீண்டும் பயன்படுத்தலாம்.
zh_hant: 這些選項會隱藏子節點的存取點。 這反過來使子節點與其環境保持**鬆散耦合**。 您可以在其他情境中重複使用它，而無需對其 API 進行任何額外的變更。

source: Although the examples above illustrate parent-child relationships, the same principles apply towards all object relations. Nodes which are siblings should only be aware of their own hierarchies while an ancestor mediates their communications and references.
it: Sebbene gli esempi sopra riportati illustrino le relazioni genitore-figlio, gli stessi principi si applicano a tutte le relazioni tra oggetti. I nodi che sono fratelli dovrebbero conoscere solo le proprie gerarchie, mentre un antenato comune fa da mediatore tra le loro comunicazioni e i loro riferimenti.
ta: மேலே உள்ள எடுத்துக்காட்டுகள் பெற்றோர்-குழந்தை உறவுகளை விளக்குகின்றன என்றாலும், ஒரே கொள்கைகள் அனைத்து பொருள் உறவுகளுக்கும் பொருந்தும். உடன்பிறப்புகளாக இருக்கும் முனைகள் தங்கள் சொந்த வரிசைமுறைகளைப் பற்றி மட்டுமே அறிந்திருக்க வேண்டும், அதே நேரத்தில் ஒரு மூதாதையர் அவர்களின் தகவல்தொடர்புகளையும் குறிப்புகளையும் மத்தியச்தம் செய்கிறார்.
zh_hant: 雖然上面的範例說明了父子關係，但相同的原則適用於所有物件關係。同層級的節點應該只知道它們自己的階層，而由共同的祖先節點來協調它們之間的溝通和引用。

source: The same principles also apply to non-Node objects that maintain dependencies on other objects. Whichever object owns the other objects should manage the relationships between them.
it: Gli stessi principi si applicano anche agli oggetti non Node che mantengono dipendenze da altri oggetti. L'oggetto che possiede gli altri oggetti dovrebbe gestire le relazioni tra loro.
ta: அதே கொள்கைகள் மற்ற பொருள்களை சார்புகளை பராமரிக்கும் முனை அல்லாத பொருள்களுக்கும் பொருந்தும். எந்த பொருள் மற்ற பொருள்களை வைத்திருந்தாலும் அவற்றுக்கிடையேயான உறவுகளை நிர்வகிக்க வேண்டும்.
zh_hant: 相同的原則也適用於非節點物件，它們也可能維持著對其他物件的依賴關係。無論哪個物件擁有其他物件，都應該管理它們之間的關係。

source: You should favor keeping data in-house (internal to a scene), though, as placing a dependency on an external context, even a loosely coupled one, still means that the node will expect something in its environment to be true. The project's design philosophies should prevent this from happening. If not, the code's inherent liabilities will force developers to use documentation to keep track of object relations on a microscopic scale; this is otherwise known as development hell. Writing code that relies on external documentation to use it safely is error-prone by default.
it: È comunque più importante mantenere i dati internamente (interni a una scena), poiché stabilire una dipendenza da un contesto esterno, anche debolmente accoppiato, significa comunque che il nodo si aspetterà che qualcosa nel suo ambiente sia vero. Le filosofie progettuali del proprio progetto dovrebbero impedire che ciò accada. Se no, le insite responsabilità del codice costringeranno gli sviluppatori a utilizzare la documentazione per tenere traccia delle relazioni tra gli oggetti su scala microscopica; questo è altrimenti noto come "inferno dello sviluppo". Scrivere codice che richiede una documentazione esterna per essere utilizzato in modo sicuro è per definizione soggetto a errori.
ta: தரவை வீட்டிலேயே வைத்திருக்க நீங்கள் விரும்ப வேண்டும் (ஒரு காட்சிக்கு உள்), வெளிப்புற சூழலில் சார்புநிலையை வைப்பது, தளர்வாக இணைந்த ஒன்று கூட, அதன் சூழலில் ஏதேனும் உண்மையாக இருக்கும் என்று எதிர்பார்க்கும் என்று பொருள். திட்டத்தின் வடிவமைப்பு தத்துவங்கள் இது நிகழாமல் தடுக்க வேண்டும். இல்லையென்றால், குறியீட்டின் உள்ளார்ந்த பொறுப்புகள் டெவலப்பர்களை ஒரு நுண்ணிய அளவில் கண்காணிக்க ஆவணங்களைப் பயன்படுத்தும்படி கட்டாயப்படுத்தும்; இது வளர்ச்சி அளறு என்று அழைக்கப்படுகிறது. வெளிப்புற ஆவணங்களை பாதுகாப்பாக பயன்படுத்த நம்பியிருக்கும் குறியீட்டை எழுதுவது இயல்பாகவே பிழை ஏற்படுகிறது.
zh_hant: 不過，你應該傾向於將資料保留在內部（場景內部），因為即使是鬆散耦合地依賴外部環境，仍然意味著節點會期望其環境中存在某些條件。專案的設計理念應該避免這種情況發生。如果沒有，程式碼固有的缺陷將迫使開發者使用文件來追蹤微觀層面的物件關係；這也就是俗稱的開發地獄。編寫依賴外部文件才能安全使用的程式碼，預設就容易出錯。

source: To avoid creating and maintaining such documentation, you convert the dependent node ("child" above) into a tool script that implements ``_get_configuration_warnings()``. Returning a non-empty PackedStringArray from it will make the Scene dock generate a warning icon with the string(s) as a tooltip by the node. This is the same icon that appears for nodes such as the :ref:`Area2D <class_Area2D>` node when it has no child :ref:`CollisionShape2D <class_CollisionShape2D>` nodes defined. The editor then self-documents the scene through the script code. No content duplication via documentation is necessary.
it: Per evitare di creare e gestire tale documentazione, si converte il nodo dipendente ("figlio" sopra) in uno script strumento che implementa ``_get_configuration_warnings()``. Restituendo un PackedStringArray non vuoto, il pannello Scena genererà accanto al nodo un'icona di avvertimento, con le stringhe come suggerimento. Questa è la stessa icona che appare, ad esempio, quando il nodo :ref:`Area2D <class_Area2D>` non definisce nodi figlio :ref:`CollisionShape2D <class_CollisionShape2D>`. L'editor quindi auto-documenta la scena tramite il codice di script. Non c'è bisogno di duplicare il contenuto tramite la documentazione.
ta: அத்தகைய ஆவணங்களை உருவாக்குவதையும் பராமரிப்பதையும் தவிர்க்க, `` _get_configuration_warnings () `` ஐ செயல்படுத்தும் ஒரு கருவி ச்கிரிப்டாக சார்பு முனையை (மேலே உள்ள "குழந்தை") மாற்றுகிறீர்கள். அதிலிருந்து வெற்று அல்லாத பேக்ச்ட்ரிங்காரேவைத் திருப்பித் தருவது, காட்சி கப்பல்துறை சரம் (கள்) உடன் ஒரு முன்னறிவிப்பு ஐகானை முனையின் உதவிக்குறிப்பாக உருவாக்கும். இது போன்ற முனைகளுக்கு இது தோன்றும் அதே ஐகான்: `area:` area2d <class_area2d> `குழந்தையின் குழந்தை இல்லாதபோது முனை: ref:` collisionshape2d <class_collisionshape2d> `முனைகள் வரையறுக்கப்பட்டுள்ளன. ஆசிரியர் பின்னர் ச்கிரிப்ட் குறியீடு மூலம் காட்சியை சுயமாக்குகிறார். ஆவணங்கள் வழியாக உள்ளடக்க நகல் தேவையில்லை.
zh_hant: 為了避免建立和維護這類文件，您可以將依賴的節點（上方的「子節點」）轉換為實作 ``_get_configuration_warnings()`` 的工具腳本。 從該函式回傳一個非空的 PackedStringArray 會使「場景」停靠視窗在該節點旁產生一個警告圖示，並將字串內容顯示為工具提示。這與 :ref:`Area2D <class_Area2D>` 節點在沒有定義子 :ref:`CollisionShape2D <class_CollisionShape2D>` 節點時所顯示的警告圖示相同。如此一來，編輯器便能透過腳本程式碼自我說明場景，無需再重複撰寫文件內容。

source: A GUI like this can better inform project users of critical information about a Node. Does it have external dependencies? Have those dependencies been satisfied? Other programmers, and especially designers and writers, will need clear instructions in the messages telling them what to do to configure it.
ga: Is féidir le GUI mar seo eolas criticiúil faoi Nód a chur in iúl níos fearr d’úsáideoirí tionscadail. An bhfuil spleáchais sheachtracha aige? Ar sásaíodh na spleáchais sin? Beidh treoracha soiléire ag teastáil ó ríomhchláraitheoirí eile, go háirithe dearthóirí agus scríbhneoirí, sna teachtaireachtaí ag insint dóibh cad atá le déanamh chun é a chumrú.
it: Un'interfaccia grafica come questa può informare meglio gli utenti del progetto sulle informazioni critiche relative a un nodo. Ha dipendenze esterne? Tali dipendenze sono state soddisfatte? Altri programmatori, e in particolare designer e scrittori, avranno bisogno di istruzioni chiare nei messaggi che spieghino loro come configurare il nodo.
ta: இது போன்ற ஒரு GUI திட்ட பயனர்களுக்கு ஒரு முனை பற்றிய முக்கியமான தகவல்களை சிறப்பாக தெரிவிக்க முடியும். அதற்கு வெளிப்புற சார்புகள் உள்ளதா? அந்த சார்புகள் நிறைவு அடைந்ததா? பிற புரோகிராமர்கள், குறிப்பாக வடிவமைப்பாளர்கள் மற்றும் எழுத்தாளர்கள், செய்திகளில் அதை உள்ளமைக்க என்ன செய்ய வேண்டும் என்று சொல்லும் தெளிவான வழிமுறைகள் தேவைப்படும்.
tr: Bunun gibi bir GUI, proje kullanıcılarını bir Node hakkındaki kritik bilgiler hakkında daha iyi bilgilendirebilir. Dış bağımlılıkları var mı? Bu bağımlılıklar karşılandı mı? Diğer programcılar ve özellikle tasarımcılar ve yazarlar, yapılandırma için ne yapmaları gerektiğini mesajlarda söyleyen açık talimatlara ihtiyaç duyacaklardır.
zh_hant: 像這樣的 GUI 可以更好的通知專案使用者有關節點的重要訊息。節點有外部相依性嗎？相依性有滿足嗎？其他的程式設計師，尤其是設計師與作家，會需要更清楚的指示來瞭解如何正確設定這些節點。
