Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/scenes_versus_scripts.po
Languages: ga, it, ta, tr

source: When to use scenes versus scripts
ga: Cathain a úsáid radhairc i gcoinne scripteanna
it: Quando usare scene anziché script
ta: ச்கிரிப்டுகளுக்கு எதிராக காட்சிகளை எப்போது பயன்படுத்த வேண்டும்
tr: Betiklere karşı sahneler; hangisini ne zaman kullanılmalı

source: We've already covered how scenes and scripts are different. Scripts define an engine class extension with imperative code, scenes with declarative code.
ga: Tá clúdaithe againn cheana féin conas atá radhairc agus scripteanna difriúil. Sainmhíníonn scripteanna síneadh aicme inneall le cód riachtanach, radhairc le cód dearbhaithe.
it: Abbiamo già trattato le differenze tra scene e script. Gli script definiscono un'estensione di classe del motore con codice imperativo, le scene con codice dichiarativo.
ta: காட்சிகள் மற்றும் ச்கிரிப்ட்கள் எவ்வாறு வேறுபடுகின்றன என்பதை நாங்கள் ஏற்கனவே உள்ளடக்கியுள்ளோம். கட்டாய குறியீடு, அறிவிப்பு குறியீட்டைக் கொண்ட காட்சிகள் கொண்ட எஞ்சின் வகுப்பு நீட்டிப்பை ச்கிரிப்ட்கள் வரையறுக்கின்றன.
tr: Sahnelerin ve betiklerin nasıl farklı olduğunu daha önce ele almıştık. Betikler bir motor sınıfı uzantısını emredici kodla, sahneler ise tanımlayıcı kodla tanımlar.

source: Each system's capabilities are different as a result. Scenes can define how an extended class initializes, but not what its behavior actually is. Scenes are often used in conjunction with a script, the scene declaring a composition of nodes, and the script adding behaviour with imperative code.
ga: Tá cumais gach córas difriúil mar thoradh air sin. Is féidir le radhairc a shainiú conas a thionscnaíonn rang leathnaithe, ach ní cad é a iompar i ndáiríre. Is minic a úsáidtear radhairc i gcomhar le script, an radharc ag dearbhú comhdhéanamh nóid, agus cuireann an script iompar leis an gcód riachtanach.
ta: இதன் விளைவாக ஒவ்வொரு அமைப்பின் திறன்களும் வேறுபட்டவை. ஒரு நீட்டிக்கப்பட்ட வகை எவ்வாறு துவங்குகிறது என்பதை காட்சிகள் வரையறுக்கலாம், ஆனால் அதன் நடத்தை உண்மையில் என்ன அல்ல. காட்சிகள் பெரும்பாலும் ஒரு ச்கிரிப்ட், முனைகளின் கலவையை அறிவிக்கும் காட்சி மற்றும் கட்டாயக் குறியீட்டைக் கொண்டு நடத்தை சேர்க்கும் ச்கிரிப்ட் ஆகியவற்றுடன் இணைந்து பயன்படுத்தப்படுகின்றன.
tr: Sonuç olarak her sistemin yetenekleri farklıdır. Sahneler, genişletilmiş bir sınıfın nasıl başlatılacağını tanımlayabilir, ancak davranışının gerçekte ne olduğunu tanımlayamaz. Sahneler genellikle bir betik ile birlikte kullanılır; sahne düğümlerin bir bileşimini tanımlar ve betik emredici kod ile davranış ekler.

source: Anonymous types
ga: Cineálacha gan ainm
it: Tipi anonimi
ta: அநாமதேய வகைகள்
tr: Anonim tipler

source: It *is* possible to completely define a scenes' contents using a script alone. This is, in essence, what the Godot Editor does, only in the C++ constructor of its objects.
ga: Is féidir ábhar radhairc a shainiú go hiomlán ag baint úsáide as script amháin. Is é seo, go bunúsach, an méid a dhéanann Eagarthóir Godot, ach amháin i dtógálaí C ++ a rudaí.
it: *È* possibile definire completamente il contenuto di una scena attraverso solo uno script. Questo è, in sostanza, ciò che fa l'editor Godot, soltanto nel costruttore di C++ dei suoi oggetti.
ta: ச்கிரிப்டைப் பயன்படுத்தி ஒரு காட்சிகளின் உள்ளடக்கங்களை முழுவதுமாக வரையறுக்க இது * சாத்தியமாகும். இது, சாராம்சத்தில், கோடோட் எடிட்டர் என்ன செய்கிறது, அதன் பொருள்களின் சி ++ கட்டமைப்பாளரில் மட்டுமே.
tr: Bir sahnenin içeriğini yalnızca bir komut dosyası kullanarak tamamen tanımlamak *mümkündür*. Bu, özünde Godot Düzenleyicisinin de yaptığı şeydir, sadece nesnelerinin C++ kurucusunda.

source: But, choosing which one to use can be a dilemma. Creating script instances is identical to creating in-engine classes whereas handling scenes requires a change in API:
ga: Ach, d'fhéadfadh sé a bheith ina aincheist a roghnú cén ceann atá le húsáid. Tá cásanna script a chruthú comhionann le ranganna in-inneall a chruthú ach teastaíonn athrú ar API ag láimhseáil radhairc:
it: Tuttavia, scegliere quale usare può essere un dilemma. La creazione di istanze di script è identico alla creazione di classi nel motore, mentre la gestione delle scene richiede una modifica nell'API:
ta: ஆனால், எதைப் பயன்படுத்த வேண்டும் என்பதைத் தேர்ந்தெடுப்பது ஒரு சங்கடமாக இருக்கும். ச்கிரிப்ட் நிகழ்வுகளை உருவாக்குவது இன்சின் வகுப்புகளை உருவாக்குவதற்கு ஒத்ததாகும், அதேசமயம் காட்சிகளைக் கையாள்வதற்கு பநிஇ இல் மாற்றம் தேவைப்படுகிறது:
tr: Ancak, hangisinin kullanılacağını seçmek bir ikilem olabilir. Betik örneklemeleri oluşturmak motor içi sınıflar oluşturmakla aynıyken, sahneleri işlemek API'de bir değişiklik gerektirir:

source: Also, scripts will operate a little slower than scenes due to the speed differences between engine and script code. The larger and more complex the node, the more reason there is to build it as a scene.
ga: Chomh maith leis sin, oibreoidh scripteanna beagán níos moille ná radhairc mar gheall ar na difríochtaí luais idir an t-inneall agus an gcód script. An níos mó agus níos casta an nód, is mó an chúis atá ann é a thógáil mar radharc.
it: Inoltre, gli script funzioneranno un po' più lentamente delle scene a causa delle differenze di velocità tra il codice del motore e quello degli script. Più grande e complesso è il nodo, di più sono i motivi per costruirlo come scena.
ta: மேலும், எஞ்சின் மற்றும் ச்கிரிப்ட் குறியீட்டிற்கு இடையிலான வேக வேறுபாடுகள் காரணமாக ச்கிரிப்ட்கள் காட்சிகளை விட சற்று மெதுவாக செயல்படும். பெரிய மற்றும் மிகவும் சிக்கலான முனை, அதை ஒரு காட்சியாக உருவாக்குவதற்கு அதிக காரணம்.
tr: Ayrıca, motor ve betik kodu arasındaki hız farkları nedeniyle komut dosyaları sahnelerden biraz daha yavaş çalışacaktır (derlenen ve yorumlanan farkı). Düğüm ne kadar büyük ve karmaşıksa, onu bir sahne olarak oluşturmak için o kadar fazla neden vardır.

source: Named types
ga: cineálacha ainmnithe
it: Tipi con nome
ta: பெயரிடப்பட்ட வகைகள்
tr: İsimlendirilmiş tipler

source: Scripts can be registered as a new type within the editor itself. This displays it as a new type in the node or resource creation dialog with an optional icon. This way, the user's ability to use the script is much more streamlined. Rather than having to...
ga: Is féidir scripteanna a chlárú mar chineál nua laistigh den eagarthóir féin. Taispeánann sé seo é mar chineál nua sa nód nó sa dialóg cruthaithe acmhainní le deilbhín roghnach. Ar an mbealach seo, tá cumas an úsáideora an script a úsáid i bhfad níos sruthlínithe. Seachas a bheith ag...
it: Gli script si possono registrare come un nuovo tipo all'interno dell'editor stesso. Ciò li visualizza come un nuovo tipo nella finestra di dialogo per creare nodi o risorse, con un'icona facoltativa. In questo modo, l'utilizzo dello script da parte dell'utente diventa molto più semplice. Anziché dover...
ta: ச்கிரிப்ட்களை எடிட்டருக்குள் ஒரு புதிய வகையாக பதிவு செய்யலாம். இது ஒரு விருப்ப ஐகானுடன் முனை அல்லது வள உருவாக்கும் உரையாடலில் ஒரு புதிய வகையாகக் காட்டுகிறது. இந்த வழியில், ச்கிரிப்டைப் பயன்படுத்துவதற்கான பயனரின் திறன் மிகவும் நெறிப்படுத்தப்பட்டுள்ளது. வேண்டும் என்பதை விட ...
tr: Betikler düzenleyicinin kendi içinde yeni bir tip olarak kaydedilebilir. Bu, isteğe bağlı bir simgeyle birlikte düğüm veya kaynak oluşturma iletişim kutusunda yeni bir tip olarak görüntülenir. Bu şekilde, kullanıcının komut dosyasını kullanma becerisi çok daha kolaylaştırılmıştır. Şunları yapmak zorunda kalmak yerine...

source: Know the base type of the script they would like to use.
ga: Bíodh eolas agat ar an gcineál bonn den script ar mhaith leo a úsáid.
it: Conoscere il tipo di base dello script che vorrebbero utilizzare.
ta: அவர்கள் பயன்படுத்த விரும்பும் ச்கிரிப்ட்டின் அடிப்படை வகையை அறிந்து கொள்ளுங்கள்.
tr: Kullanmak istenilen betiğin temel tipini bilin.

source: Create an instance of that base type.
ga: Cruthaigh sampla den chineál bonn sin.
it: Crea un'istanza di quel tipo di base.
ta: அந்த அடிப்படை வகையின் ஒரு உதாரணத்தை உருவாக்கவும்.
tr: Bu temel tipin bir örneklemesini oluşturun.

source: Add the script to the node.
ga: Cuir an script leis an nód.
it: Aggiungere lo script al nodo.
ta: முனையில் ச்கிரிப்டைச் சேர்க்கவும்.
tr: Betiği düğüme ekleyin.

source: With a registered script, the scripted type instead becomes a creation option like the other nodes and resources in the system. The creation dialog even has a search bar to look up the type by name.
ga: Le script cláraithe, is rogha cruthaithe é an cineál scripteáilte ina ionad sin cosúil leis na nóid agus na hacmhainní eile sa chóras. Tá barra cuardaigh ag an dialóg cruthaithe fiú chun an cineál de réir ainm a lorg suas.
it: Con uno script registrato, il tipo da script diventa invece un'opzione di creazione, come gli altri nodi e risorse del sistema. La finestra di dialogo di creazione include persino una barra di ricerca per cercare il tipo per nome.
ta: பதிவுசெய்யப்பட்ட ச்கிரிப்ட் மூலம், ச்கிரிப்ட் செய்யப்பட்ட வகை அதற்கு பதிலாக கணினியில் உள்ள மற்ற முனைகள் மற்றும் வளங்களைப் போன்ற ஒரு படைப்பு விருப்பமாக மாறும். உருவாக்கம் உரையாடலில் பெயரால் வகையைப் பார்க்க ஒரு தேடல் பட்டி கூட உள்ளது.
tr: ... Kayıtlı bir betik kullanınca, betiklenmiş tip sistemdeki diğer düğümler ve kaynaklar gibi bir oluşturma seçeneği haline gelir. Oluşturma iletişim kutusunda, bu tipi adına göre aramak için bir arama çubuğu bile vardır.

source: There are two systems for registering types:
ga: Tá dhá chóras ann chun cineálacha a chlárú:
it: Ci sono due sistemi per registrare tipi:
ta: வகைகளை பதிவு செய்ய இரண்டு அமைப்புகள் உள்ளன:
tr: Tipleri kaydetmek için iki sistem vardır:

source: :ref:`Custom Types <doc_making_plugins>`
ga: :ref:`Cineálacha Custaim <doc_making_plugins>`
it: :ref:`Tipi personalizzati <doc_making_plugins>`
ta: : குறிப்பு: `தனிப்பயன் வகைகள் <doc_making_plugins>`
tr: :ref:`Özel Tipler <doc_making_plugins>`

source: Editor-only. Typenames are not accessible at runtime.
ga: Eagarthóir amháin. Níl cineálacha inrochtana ag an am rith.
it: Solo per editor. I nomi dei tipi non sono accessibili in fase di esecuzione.
ta: ஆசிரியர் மட்டும். இயக்க நேரத்தில் தட்டச்சு பெயர்கள் அணுக முடியாது.
tr: Sadece düzenleyiciye özel. Tip adlarına çalışma zamanında erişilemez.

source: Does not support inherited custom types.
ga: Ní thacaíonn sé le cineálacha saincheaptha oidhreachta.
it: Non supporta tipi personalizzati ereditati.
ta: பரம்பரை தனிப்பயன் வகைகளை ஆதரிக்கவில்லை.
tr: Miraz alınan özel tipleri desteklemez.

source: An initializer tool. Creates the node with the script. Nothing more.
ga: Uirlis tosaitheora. Cruthaíonn sé an nód leis an script. Níl aon rud níos mó.
it: Uno strumento di inizializzazione. Crea il nodo con lo script, niente più.
ta: துவக்க கருவி. ச்கிரிப்டுடன் முனையை உருவாக்குகிறது. அதற்கு மேல் எதுவும் இல்லை.
tr: Bir başlatıcı aracıdır. Kod ile düğüm oluşturur. Başka bir şey yapmaz.

source: Editor has no type-awareness of the script or its relationship to other engine types or scripts.
ga: Níl aon chineálfheasacht ag an eagarthóir ar an script ná ar a ghaol le cineálacha inneall nó scripteanna eile.
it: L'editor non è consapevole del tipo dello script o della sua relazione con altri tipi del motore o degli script.
ta: எடிட்டருக்கு ச்கிரிப்டின் வகை-விழிப்புணர்வு அல்லது பிற இயந்திர வகைகள் அல்லது ச்கிரிப்ட்களுடனான அதன் உறவு இல்லை.
tr: Düzenleyicinin betiğin tipine veya diğer motor tipleri veya betikleriyle ilişkisine dair bir farkındalığı yoktur.

source: Allows users to define an icon.
ga: Ligeann sé d'úsáideoirí deilbhín a shainiú.
it: Consente agli utenti di definire un'icona.
ta: பயனர்கள் ஒரு ஐகானை வரையறுக்க அனுமதிக்கிறது.
tr: Kullanıcıların bir simge tanımlamasına izin verir.

source: Works for all scripting languages because it deals with Script resources in abstract.
ga: Oibríonn sé do gach teanga scripteála toisc go ndéileálann sé le hacmhainní Script teibí.
it: Funziona con tutti i linguaggi di scripting perché gestisce le risorse Script in modo astratto.
ta: அனைத்து ச்கிரிப்டிங் மொழிகளுக்கும் வேலை செய்கிறது, ஏனெனில் இது ச்கிரிப்ட் வளங்களை சுருக்கத்தில் கையாள்கிறது.
tr: Betik kaynaklarını soyut olarak ele aldığı için tüm betik dilleri için çalışır.

source: Set up using :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>`.
ga: Cumraigh le :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>`.
it: Impostato tramite :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>`.
ta: பயன்படுத்தி அமைக்கவும்: Ref: `editorplugin.add_custom_type <class_editorplugin_method_add_custom_type>`.
tr: :ref:`EditorPlugin.add_custom_type <class_EditorPlugin_method_add_custom_type>` kullanarak ayarlayın.

source: :ref:`Script Classes <doc_gdscript_basics_class_name>`
ga: :ref:`Ranganna Script <doc_gdscript_basics_class_name>`
it: :ref:`Classi da script <doc_gdscript_basics_class_name>`
ta: : ref: `ச்கிரிப்ட் வகுப்புகள் <doc_gdscript_basics_class_name>`
tr: :ref:`Betik Sınıfları <doc_gdscript_basics_class_name>`

source: Editor and runtime accessible.
ga: Inrochtana ar eagarthóir agus am rith.
it: Accessibili nell'editor e in fase di esecuzione.
ta: ஆசிரியர் மற்றும் இயக்க நேரம் அணுகக்கூடியது.
tr: Düzenleyicide ve çalışma zamanında erişilebilir.

source: Displays inheritance relationships in full.
ga: Taispeánann caidreamh oidhreachta go hiomlán.
it: Visualizza le relazioni di ereditarietà per intero.
ta: பரம்பரை உறவுகளை முழுமையாகக் காட்டுகிறது.
tr: Miras alma ilişkilerini tam olarak görüntüler.

source: Creates the node with the script, but can also change types or extend the type from the editor.
ga: Cruthaíonn sé an nód leis an script, ach féadann sé cineálacha a athrú nó an cineál a leathnú ón eagarthóir.
it: Crea il nodo con lo script, ma può anche modificarne i tipi o estendere il tipo dall'editor.
ta: ச்கிரிப்டுடன் முனையை உருவாக்குகிறது, ஆனால் வகைகளையும் மாற்றலாம் அல்லது எடிட்டரிலிருந்து வகையை நீட்டிக்கலாம்.
tr: Düğümü kodla oluşturur, ancak ayrıca tipleri değiştirebilir veya tipi düzenleyiciden genişletebilir.

source: Editor is aware of inheritance relationships between scripts, script classes, and engine C++ classes.
ga: Tá an eagarthóir ar an eolas faoi chaidrimh oidhreachta idir scripteanna, ranganna script, agus ranganna inneall C ++.
it: L'editor è a conoscenza delle relazioni di ereditarietà tra script, classi da script e classi C++ del motore.
ta: ச்கிரிப்ட்கள், ச்கிரிப்ட் வகுப்புகள் மற்றும் என்சின் சி ++ வகுப்புகளுக்கு இடையிலான பரம்பரை உறவுகளை ஆசிரியர் அறிந்திருக்கிறார்.
tr: Düzenleyici, betikler, betik sınıfları ve motor C++ sınıfları arasındaki kalıtım ilişkilerinin farkındadır.

source: Engine developers must add support for languages manually (both name exposure and runtime accessibility).
ga: Ní mór d’fhorbróirí innill tacaíocht do theangacha a chur leis de láimh (nochtadh ainm agus inrochtaineacht ama rite).
it: Gli sviluppatori del motore devono aggiungere manualmente il supporto per i linguaggi (sia l'esposizione dei nomi sia l'accessibilità in fase di esecuzione).
ta: என்சின் உருவாக்குபவர்கள் மொழிகளுக்கு கைமுறையாக ஆதரவைச் சேர்க்க வேண்டும் (பெயர் வெளிப்பாடு மற்றும் இயக்க நேர அணுகல் இரண்டும்).
tr: Motor geliştiricileri diller için desteği elden eklemelidir (hem isim dışa açılmalarını hem de çalışma zamanı erişilebilirliği).

source: The Editor scans project folders and registers any exposed names for all scripting languages. Each scripting language must implement its own support for exposing this information.
ga: Déanann an t-Eagarthóir scanadh ar fhillteáin tionscadail agus cláraíonn sé aon ainmneacha nochtaithe Caithfidh gach teanga scripteála a tacaíocht féin a chur i bhfeidhm chun an fhaisnéis seo a nochtadh.
it: L'editor analizza le cartelle del progetto e registra tutti i nomi esposti per tutti i linguaggi di scripting. Ogni linguaggio di scripting deve implementare il proprio supporto per esporre queste informazioni.
ta: ஆசிரியர் திட்ட கோப்புறைகளை ச்கேன் செய்து அனைத்து ச்கிரிப்டிங் மொழிகளுக்கும் வெளிப்படும் பெயர்களை பதிவு செய்கிறார். ஒவ்வொரு ச்கிரிப்டிங் மொழியும் இந்த தகவலை அம்பலப்படுத்த அதன் சொந்த ஆதரவை செயல்படுத்த வேண்டும்.
tr: Düzenleyici proje klasörlerini tarar ve tüm betik dilleri için açık isimleri kaydeder. Her betik dili bu bilgiyi dışarıya açmak için kendi desteğini uyarlamalıdır.

source: Both methodologies add names to the creation dialog, but script classes, in particular, also allow for users to access the typename without loading the script resource. Creating instances and accessing constants or static methods is viable from anywhere.
ga: Cuireann an dá mhodheolaíocht ainmneacha leis an dialóg cruthaithe, ach ceadaíonn ranganna script, go háirithe, d'úsáideoirí rochtain a fháil ar an gcineálainm gan an acmhainn script a luchtú. Tá cásanna a chruthú agus teacht ar shirianta nó modhanna statacha inmharthana ó áit ar bith.
it: Entrambe le metodologie aggiungono nomi alla finestra di dialogo di creazione, ma le classi da script, in particolare, consentono agli utenti di accedere al nome del tipo senza caricare la risorsa script. La creazione di istanze e l'accesso a costanti o metodi statici sono fattibili dovunque.
ta: இரண்டு முறைகளும் உருவாக்கம் உரையாடலுக்கு பெயர்களைச் சேர்க்கின்றன, ஆனால் ச்கிரிப்ட் வகுப்புகள், குறிப்பாக, ச்கிரிப்ட் வளத்தை ஏற்றாமல் பயனர்கள் தட்டச்சு பெயரை அணுக அனுமதிக்கின்றன. நிகழ்வுகளை உருவாக்குதல் மற்றும் மாறிலிகள் அல்லது நிலையான முறைகளை அணுகுவது எங்கிருந்தும் சாத்தியமாகும்.
tr: Her iki yöntem de bu isimleri oluşturma iletişim kutusuna ekler, ancak özellikle betik sınıfları, kullanıcıların betik kaynağını yüklemeden tip adına erişmesine de olanak tanır. Örneklemeler oluşturmak ve sabitlere ya da statik yöntemlere erişmek her yerden mümkündür.

source: With features like these, one may wish their type to be a script without a scene due to the ease of use it grants users. Those developing plugins or creating in-house tools for designers to use will find an easier time of things this way.
ga: Le gnéithe mar seo, d'fhéadfadh duine a bheith ag iarraidh a gcineál a bheith ina script gan radharc mar gheall ar a éasca le húsáid a thugann sé d'úsáideoirí. Iad siúd a fhorbraíonn breiseán nó a chruthaíonn uirlisí intí do dhearthóirí le húsáid, gheobhaidh siad am níos éasca rudaí ar an mbealach seo.
it: Con caratteristiche come queste, si potrebbe desiderare che il loro tipo sia uno script senza scena, vista la facilità d'uso che offre agli utenti. Chi sviluppa estensioni o crea strumenti interni per i designer troverà la lavoro più semplice in questo modo.
ta: இது போன்ற அம்சங்களுடன், பயனர்களுக்கு வழங்கும் பயன்பாட்டின் எளிமை காரணமாக காட்சி இல்லாமல் அவர்களின் வகை ச்கிரிப்டாக இருக்க வேண்டும் என்று ஒருவர் விரும்பலாம். செருகுநிரல்களை உருவாக்குபவர்கள் அல்லது வடிவமைப்பாளர்கள் பயன்படுத்த உள் கருவிகளை உருவாக்குபவர்கள் இந்த வழியில் எளிதான நேரத்தைக் கண்டுபிடிப்பார்கள்.
tr: Bu gibi özellikleriyle, kullanıcılara sağladığı kullanım kolaylığı nedeniyle türlerinin sahnesi olmayan bir betik olması istenebilir. Eklentiler geliştirenler veya tasarımcıların kullanması için şirket içi araçlar yazanlar bununla işleri daha kolay bulacaklardır.

source: On the downside, it also means having to use largely imperative programming.
ga: Ar an taobh míbhuntáiste, ciallaíonn sé freisin cláir riachtanach a úsáid den chuid is mó.
it: D'altra parte, ciò significa dover ricorrere soprattutto a una programmazione imperativa.
ta: எதிர்மறையாக, இதன் பொருள் பெரும்பாலும் கட்டாய நிரலாக்கத்தைப் பயன்படுத்த வேண்டும்.
tr: Olumsuz tarafı ise, büyük ölçüde emredici programlama kullanmak zorunda kalmaktır.

source: Performance of Script vs PackedScene
ga: Feidhmíocht Script vs PackedScene
it: Prestazioni di Script vs PackedScene
ta: ச்கிரிப்ட் Vs பேக்ச்கீனின் செயல்திறன்
tr: Betik ile PackedScene performans farkı

source: One last aspect to consider when choosing scenes and scripts is execution speed.
ga: Gné dheireanach amháin atá le cur san áireamh agus radhairc agus scripteanna á roghnú ná an luas forghníomhaithe.
it: Un ultimo aspetto da considerare nella scelta tra scene e script è la velocità di esecuzione.
ta: காட்சிகள் மற்றும் ச்கிரிப்ட்களைத் தேர்ந்தெடுக்கும்போது கருத்தில் கொள்ள வேண்டிய கடைசி நற்பொருத்தம் சாவுஒறுப்பு விரைவு.
tr: Sahneleri ve betikleri seçerken göz önünde bulundurulması gereken son bir husus da çalışma hızıdır.

source: As the size of objects increases, the scripts' necessary size to create and initialize them grows much larger. Creating node hierarchies demonstrates this. Each Node's logic could be several hundred lines of code in length.
ga: De réir mar a mhéadaíonn méid na rudaí, fásann méid riachtanach na scripteanna chun iad a chruthú agus a thionscnamh i bhfad níos mó. Léiríonn ordlathais nód a chruthú é seo. D'fhéadfadh loighic gach Nóid a bheith roinnt céadta líne cód ar fad.
it: Con l'aumentare delle dimensioni degli oggetti, le dimensioni necessarie degli script per crearli e inizializzarli aumentano notevolmente. La creazione di gerarchie di nodi ne è un esempio. La logica di ogni nodo potrebbe essere lunga parecchie centinaia di righe di codice.
ta: பொருட்களின் அளவு அதிகரிக்கும்போது, அவற்றை உருவாக்கி துவக்க ச்கிரிப்டுகளின் தேவையான அளவு மிகப் பெரியதாக வளர்கிறது. முனை வரிசைமுறைகளை உருவாக்குவது இதை நிரூபிக்கிறது. ஒவ்வொரு முனையின் தர்க்கமும் நீளமுள்ள பல நூறு கோடுகள் குறியீடாக இருக்கலாம்.
tr: Nesnelerin boyutu arttıkça, betiklerin bunları oluşturmak ve başlatmak için gerekli boyutu çok daha fazla büyür. Düğüm hiyerarşileri oluşturmak bunu sergilemektedir. Her bir düğümün mantığı birkaç yüz satır kod uzunluğunda olabilir.

source: The code example below creates a new ``Node``, changes its name, assigns a script to it, sets its future parent as its owner so it gets saved to disk along with it, and finally adds it as a child of the ``Main`` node:
ga: Cruthaíonn an sampla cód thíos ``Nód ``nua, athraíonn sé a ainm, sannann sé script dó, socraíonn sé a thuismitheoir amach anseo mar úinéir ionas go sábhálfar é ar an diosca in éineacht leis, agus sa deireadh cuireann sé é mar leanbh den nód ``Príomh``:
it: L'esempio di codice seguente crea un nuovo ``Node``, ne cambia il nome, gli assegna uno script, imposta il suo futuro genitore come proprietario in modo che sia salvato sul disco insieme a esso e infine lo aggiunge come figlio del nodo ``Main``:
ta: கீழேயுள்ள குறியீடு எடுத்துக்காட்டு ஒரு புதிய `` முனை`` உருவாக்குகிறது, அதன் பெயரை மாற்றுகிறது, அதற்கு ஒரு ச்கிரிப்டை ஒதுக்குகிறது, அதன் வருங்கால பெற்றோரை அதன் உரிமையாளராக அமைத்துக்கொள்கிறது, எனவே அது வட்டு உடன் சேமிக்கப்படுகிறது, இறுதியாக அதை `குழந்தையின் குழந்தையாக சேர்க்கிறது `பிரதான`` முனை:
tr: Aşağıdaki kod örneği yeni bir ``Node`` oluşturur, adını değiştirir, ona bir atar, gelecekteki üst ögesini sahibi olarak ayarlar, böylece onunla birlikte diske kaydedilir ve son olarak onu ``Main`` düğümünün bir alt ögesi olarak ekler:

source: Script code like this is much slower than engine-side C++ code. Each instruction makes a call to the scripting API which leads to many "lookups" on the back-end to find the logic to execute.
ga: Tá cód script mar seo i bhfad níos moille ná cód C ++ taobh inneall. Déanann gach treoir glaoch ar an API scripteála rud a fhágann go bhfuil go leor “cuardaigh” ar an gcúl-deireadh chun an loighic le forghníomhú a fháil.
it: Un codice di script come questo è molto più lento del codice in C++ del motore. Ogni istruzione effettua una chiamata all'API di scripting, il che comporta numerose "ricerche" sul back-end per trovare la logica da eseguire.
ta: இது போன்ற ச்கிரிப்ட் குறியீடு இயந்திர பக்க சி ++ குறியீட்டை விட மிகவும் மெதுவாக உள்ளது. ஒவ்வொரு அறிவுறுத்தலும் ச்கிரிப்டிங் ஏபிஐக்கு அழைப்பு விடுக்கிறது, இது செயல்படுத்துவதற்கான தர்க்கத்தைக் கண்டுபிடிப்பதற்கு பின் இறுதியில் பல "தேடல்களுக்கு" வழிவகுக்கிறது.
tr: Bunun gibi betik kodları, motor tarafındaki C++ kodlarından çok daha yavaştır. Her komut, betik API'sine bir çağrı yapar ve bu da yürütülecek mantığı bulmak için arka uçta birçok "aramaya" yol açar.
