Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/building_the_manual.po
Languages: es, fr, ga, it, ru, ta, tr, uk, zh_tw

source: Building the manual with Sphinx
es: Contruyendo el manual con Sphinx
fr: Compiler le manuel avec Sphinx
ga: Ag tógáil an lámhleabhar le Sphinx
it: Compilare il manuale con Sphinx
ru: Создание руководства с помощью Sphinx
ta: கையேட்டை ச்பிங்க்சுடன் உருவாக்குதல்
tr: Kılavuzu Sphinx kullanarak oluşturma
uk: Складання посібника зі Sphinx
zh_tw: 使用 Sphinx 建置手冊

source: This page explains how to build a local copy of the Godot manual using the Sphinx docs engine. This allows you to have local HTML files and build the documentation as a PDF, EPUB, or LaTeX file, for example.
es: Esta página explica como crear una copia local del manual de Godot usando el motor de documentos Sphinx. Esto te permite tener archivos locales HTML y crear la documentación como un archivo PDF, EPUB, o LaTeX, por ejemplo.
fr: Cette page explique comment compiler une copie locale du manuel Godot en utilisant le moteur Sphinx docs. Cela vous permet d’avoir des fichiers HTML locaux et de créer la documentation sous la forme d’un fichier PDF, EPUB ou LaTeX, par exemple.
ga: Míníonn an leathanach seo conas cóip áitiúil de lámhleabhar Godot a thógáil ag baint úsáide as inneall docs Sphinx. Ligeann sé seo duit comhaid HTML áitiúla a bheith agat agus na doiciméid a thógáil mar chomhad PDF, EPUB, nó LaTeX, mar shampla.
it: Questa pagina spiega come creare una copia locale del manuale di Godot utilizzando il motore di documentazione Sphinx. Questo permette di avere file HTML locali e di creare la documentazione sotto forma di un file PDF, EPUB oppure LaTeX, ad esempio.
ru: На этой странице объясняется, как создать локальную копию руководства Godot с помощью движка Sphinx docs. Это позволяет вам иметь локальные HTML файлы и создавать документацию, например, в виде PDF, EPUB или LaTeX файла.
ta: ச்பின்க்ச் டாக்ச் எஞ்சினைப் பயன்படுத்தி கோடோட் கையேட்டின் உள்ளக நகலை எவ்வாறு உருவாக்குவது என்பதை இந்த பக்கம் விளக்குகிறது. இது உள்ளக உஉகுமொ கோப்புகளை வைத்திருக்கவும், ஆவணங்களை PDF, EPUB அல்லது லாடெக்சு கோப்பாக உருவாக்கவும் உங்களை அனுமதிக்கிறது.
tr: Bu sayfa, Sphinx belgeler motorunu kullanarak Godot kılavuzunun yerel bir kopyasının nasıl oluşturulacağını açıklar. Bu, yerel HTML dosyalarına sahip olmanıza ve belgeleri örneğin bir PDF, EPUB veya LaTeX dosyası olarak oluşturmanıza olanak tanır.
uk: На цій сторінці пояснюється, як створити локальну копію посібника Godot за допомогою механізму документів Sphinx. Це дозволяє мати локальні файли HTML і створювати документацію, наприклад, у форматі PDF, EPUB або LaTeX.
zh_tw: 本頁說明如何使用 Sphinx 文件引擎建置 Godot 手冊的本地副本。你可以產生本地 HTML 檔案，也能將文件匯出為 PDF、EPUB 或 LaTeX 格式。

source: Before you get started, make sure that you have:
es: Antes de comenzar, asegúrate de tener:
fr: Avant de commencer, assurez-vous que vous avez :
ga: Sula dtosaíonn tú, déan cinnte go bhfuil:
it: Prima di cominciare, assicurarsi di avere:
ta: நீங்கள் தொடங்குவதற்கு முன், உங்களிடம் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்:
tr: Başlamadan önce, şunlara sahip olduğunuzdan emin olun:
uk: Перш ніж почати, переконайтеся, що у вас є:
zh_tw: 在開始之前，請確認你已具備以下條件：

source: `make <https://www.gnu.org/software/make/>`_ (unless you're using Windows)
es: `make <https://www.gnu.org/software/make/>`_ (a menos que estés usando Windows)
fr: `make <https://www.gnu.org/software/make/>`_ (sauf si vous utilisez Windows)
ga: `déan <https://www.gnu.org/software/make/>`_ (mura bhfuil Windows in úsáid agat)
it: `make <https://www.gnu.org/software/make/>`_ (a meno che non si utilizzi Windows)
ta: `உருவாக்கு <https://www.gnu.org/software/make/>` _ (நீங்கள் விண்டோசைப் பயன்படுத்தாவிட்டால்)
tr: `make <https://www.gnu.org/software/make/>`_ (Windows kullanmıyorsanız)
uk: `make <https://www.gnu.org/software/make/>`_ (якщо ви не використовуєте Windows)
zh_tw: `make <https://www.gnu.org/software/make/>`_ （除非你使用的是 Windows）

source: Python 3 should come with the ``pip3`` command. You may need to write ``python3 -m pip`` (Unix) or ``py -m pip`` (Windows) instead of ``pip3``. If both approaches fail, `make sure that you have pip3 installed <https://pip.pypa.io/en/stable/installation/>`__.
fr: Python 3 devrait venir avec la commande ``pip3``. Vous devrez peut-être écrire ``python3 -m pip`` (Unix) ou ``py -m pip`` (Windows) au lieu de ``pip3``. Si les deux approches échouent, assurez-vous que vous avez pip3 d'installé `<https://pip.pypa.io/en/stable/installation/>`__.
ga: Ba chóir go dtiocfadh Python 3 leis an ordú `` pip3``. Seans go mbeidh ort `` python3 -m pip`` (Unix) nó `` py -m pip`` (Windows) a scríobh in ionad `` pip3``. Má theipeann ar an dá chur chuige, `déan cinnte go bhfuil pip3 suiteáilte agat <https://pip.pypa.io/en/stable/installation/>`__.
it: Python 3 dovrebbe essere dotato del comando ``pip3``. Potrebbe essere necessario scrivere ``python3 -m pip`` (Unix) o ``py -m pip`` (Windows) invece di ``pip3``. Se entrambi gli approcci falliscono, `controllare di avere pip3 installato <https://pip.pypa.io/en/stable/installation/>`__.
ta: பைதான் 3 `` பிப் 3`` கட்டளையுடன் வர வேண்டும். `` Pip3`` க்கு பதிலாக `` பைதான் 3 -எம் பிப்``` (யூனிக்ச்) அல்லது `` py -m pip`` (விண்டோச்) எழுத வேண்டியிருக்கலாம். இரண்டு அணுகுமுறைகளும் தோல்வியுற்றால், `நீங்கள் PIP3 நிறுவப்பட்டுள்ளீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்
tr: Python 3 ``pip3`` komutu ile birlikte gelmelidir. ``pip3`` yerine ``python3 -m pip`` (Unix) veya ``py -m pip`` (Windows) yazmanız gerekebilir. Her iki yaklaşım da başarısız olursa, `pip3'ün kurulu olduğundan emin olun <https://pip.pypa.io/en/stable/installation/>`__.
uk: Python 3 має поставлятися з командою ``pip3``. Можливо, вам доведеться написати ``python3 -m pip`` (Unix) або ``py -m pip`` (Windows) замість ``pip3``. Якщо обидва підходи зазнають невдачі, `переконайтеся, що у вас встановлено pip3 <https://pip.pypa.io/en/stable/installation/>`__.
zh_tw: Python 3 應該會附帶 ``pip3`` 指令。你可能需要使用 ``python3 -m pip``（Unix）或 ``py -m pip``（Windows）來取代 ``pip3``。若這兩種方法都無法運作，請參考 `確保已安裝 pip3 <https://pip.pypa.io/en/stable/installation/>`__。

source: *(Optional)* Set up a virtual environment. Virtual environments prevent potential conflicts between the Python packages in ``requirements.txt`` and other Python packages that are installed on your system.
es: *(Opcional)* Establece un entorno virtual. Los entornos virtuales previenen posibles conflictos entre los paquetes de Python en ``requirements.txt`` y otros paquetes de Python que estén instalados en tu sistema.
fr: *(Optionnel)* Créer un environnement virtuel. Les environnements virtuels empêchent les conflits potentiels entre les packages Python dans ``requirements.txt`` et d'autres packages Python qui sont installés sur votre système.
ga: *(Roghnach)* Timpeallacht fhíorúil a chur ar bun. Cuireann timpeallachtaí fíorúla cosc ar choimhlintí féideartha idir na pacáistí Python in ''requirements.txt'' agus pacáistí Python eile atá suiteáilte ar do chóras.
it: *(Facoltativo)* Configurare un ambiente virtuale. Gli ambienti virtuali prevengono potenziali conflitti tra i pacchetti Python in ``requirements.txt`` e altri pacchetti Python installati sul sistema.
ta: * (விரும்பினால்)* ஒரு மெய்நிகர் சூழலை அமைக்கவும். மெய்நிகர் சூழல்கள் பைதான் தொகுப்புகளுக்கு இடையில் `` தேவைகள். Txt`` மற்றும் உங்கள் கணினியில் நிறுவப்பட்ட பிற பைதான் தொகுப்புகளில் சாத்தியமான மோதல்களைத் தடுக்கின்றன.
tr: *(İsteğe bağlı)* Sanal bir ortam kurun. Sanal ortamlar, ``requirements.txt`` dosyasındaki Python paketleri ile sisteminizde yüklü olan diğer Python paketleri arasındaki olası çakışmaları önler.
uk: *(Необов’язково)* Налаштувати віртуальне середовище. Віртуальні середовища запобігають потенційним конфліктам між пакетами Python у ``requirements.txt`` та іншими пакетами Python, встановленими у вашій системі.
zh_tw: *（可選）* 建立虛擬環境。虛擬環境可以避免 ``requirements.txt`` 內的 Python 套件與系統上安裝的其他 Python 套件發生衝突。

source: Create the virtual environment:
es: Crea el entorno virtual:
fr: Création de l'environnement virtuel :
ga: Cruthaigh an timpeallacht fhíorúil:
it: Crea l'ambiente virtuale:
ru: Создайте виртуальную среду:
ta: மெய்நிகர் சூழலை உருவாக்கவும்:
tr: Sanal ortamı oluşturun:
uk: Створіть віртуальне середовище:
zh_tw: 建立虛擬環境：

source: Other platforms
fr: Autres plateformes
ga: Ardáin eile
it: Altre piattaforme
ru: Другие платформы
ta: பிற தளங்கள்
tr: Diğer platformlar
uk: Інші платформи
zh_tw: 其他平台

source: Activate the virtual environment:
es: Activa el entorno virtual:
fr: Activation de l'environnement virtuel :
ga: Gníomhachtaigh an timpeallacht fhíorúil:
it: Attivare l'ambiente virtuale:
ru: Активируйте виртуальную среду:
ta: மெய்நிகர் சூழலை செயல்படுத்தவும்:
tr: Sanal ortamı etkinleştirin:
uk: Активуйте віртуальне середовище:
zh_tw: 啟用虛擬環境：

source: *(Optional)* Update pre-installed packages:
es: *(Opcional)* Actualizar paquetes preinstalados:
fr: *(optionnel)* Mise à jour des paquets pré-installés :
ga: *(Roghnach)* Nuashonraigh pacáistí réamhshuiteáilte:
it: *(Facoltativo)* Aggiornare i pacchetti preinstallati:
ta: * (விரும்பினால்)* முன்பே நிறுவப்பட்ட தொகுப்புகளைப் புதுப்பிக்கவும்:
tr: *(İsteğe bağlı)* Ön-yüklenmiş paketleri güncelleyin:
uk: *(Необов’язково)* Оновлення попередньо встановлених пакетів:
zh_tw: *（可選）* 更新已預先安裝的套件：

source: Clone the docs repo:
es: Clona el repositorio de documentación:
fr: Cloner le dépôt de documents :
ga: Cluain na docs repo:
it: Clonare il repository della documentazione:
ru: Клонируйте репозиторий документов:
ta: டாக்ச் ரெப்போ குளோன்:
tr: Belgeler deposunu klonlayın:
uk: Клонуйте репозиторій з документами:
zh_tw: 複製文件倉庫：

source: Change directory into the docs repo:
es: Cambiar directorio al repositorio de documentación:
fr: Changer de répertoire vers le dépôt de documentation :
ga: Athraigh an chomhadlann go dtí an docs repo:
it: Cambiare cartella e accedere al repository della documentazione:
ta: டாக்ச் ரெப்போவாக கோப்பகத்தை மாற்றவும்:
tr: Dizini belgeler deposu klasörüne değiştirin:
uk: Змініть каталог на сховище документів:
zh_tw: 切換到文件倉庫目錄：

source: Install the required packages:
es: Instala los paquetes requeridos:
fr: Installation des packages requis :
ga: Suiteáil na pacáistí riachtanacha:
it: Installa i pacchetti necessari:
ru: Установите необходимые пакеты:
ta: தேவையான தொகுப்புகளை நிறுவவும்:
tr: Gerekli paketleri yükleyin:
uk: Встановіть необхідні пакунки:
zh_tw: 安裝必要套件：

source: Build the docs:
es: Compila la documentación:
fr: Création des documentations :
ga: Tóg na docs:
it: Crea la documentazione:
ru: Создайте документы:
ta: டாக்சை உருவாக்கு:
tr: Belgeleri oluşturun:
uk: Створюй документи:
zh_tw: 建置文件：

source: On Windows, that command will run ``make.bat`` instead of GNU Make (or an alternative).
es: En Windows, ese comando ejecutará ``make.bat`` en vez de GNU Make (o una alternativa).
fr: Sur Windows, cette commande va exécuter ``make.bat`` au lieu de GNU Make (ou une alternative).
ga: Ar Windows, rithfidh an t-ordú sin ''make.bat'' in ionad GNU Make (nó rogha eile).
it: Su Windows, tale comando eseguirà ``make.bat`` invece di GNU Make (o un'alternativa).
ta: சாளரங்களில், அந்த கட்டளை குனு மேக் (அல்லது ஒரு மாற்று) க்கு பதிலாக `` make.bat`` இயங்கும்.
tr: Windows'ta bu komut GNU Make (veya bir alternatifi) yerine ``make.bat`` komutunu çalıştıracaktır.
uk: У Windows ця команда запускатиме ``make.bat`` замість GNU Make (або альтернативи).
zh_tw: 在 Windows 上，該指令會執行 ``make.bat``，而不是 GNU Make（或其他替代方案）。

source: Alternatively, you can build the documentation by running the sphinx-build program manually:
es: Alternativamente, puedes construir la documentación ejecutando el programa ``sphinx-build`` manualmente:
fr: Autrement, vous pouvez compiler la documentation en exécutant manuellement le programme sphinx-build :
ga: Nó, is féidir leat an doiciméadú a thógáil tríd an gclár tógála sphinx a reáchtáil de láimh:
it: In alternativa, è possibile compilare la documentazione eseguendo manualmente il programma sphinx-build:
ru: Кроме того, вы можете собрать документацию, запустив программу sphinx-build вручную:
ta: மாற்றாக, ச்பிங்க்ச்-பில்ட் திட்டத்தை கைமுறையாக இயக்குவதன் மூலம் ஆவணங்களை உருவாக்கலாம்:
tr: Alternatif olarak, sphinx-build programını elden çalıştırarak belgeleri oluşturabilirsiniz:
uk: Крім того, ви можете створити документацію, запустивши програму sphinx-build вручну:
zh_tw: 你也可以手動執行 sphinx-build 程式來建置文件：

source: The compilation will take some time as the ``classes/`` folder contains hundreds of files. See :ref:`doc_building_the_manual:performance`.
fr: La compilation prendra un certain temps car le dossier ``classes/`` contient des centaines de fichiers. Voir :ref:`doc_building_the_manual:performance`.
ga: Tógfaidh an tiomsú roinnt ama mar go bhfuil na céadta comhad san fhillteán ''ranganna/'''. Féach :ref:'doc_building_the_manual:performance'.
it: La compilazione richiederà un po' di tempo poiché la cartella ``classes/`` contiene centinaia di file. Consultare :ref:`doc_building_the_manual:performance`.
ru: Компиляция займёт некоторое время, поскольку папка ``classes/`` содержит сотни файлов. См. :ref:`doc_building_the_manual:performance`.
ta: `` வகுப்புகள்/`` கோப்புறையில் நூற்றுக்கணக்கான கோப்புகள் இருப்பதால் தொகுப்பு சிறிது நேரம் எடுக்கும். காண்க: குறிப்பு: `doc_building_the_manual: செயல்திறன்`.
tr: ``classes/`` klasörü yüzlerce dosya içerdiğinden derleme biraz zaman alacaktır. Bakınız :ref:`doc_building_the_manual:performance`.
uk: Компіляція займе деякий час, оскільки папка ``classes/`` містить сотні файлів. Див. :ref:`doc_building_the_manual:performance`.
zh_tw: 由於 ``classes/`` 資料夾內含數百個檔案，編譯會需要一段時間。請參考 :ref:`doc_building_the_manual:performance`。

source: You can then browse the documentation by opening ``_build/html/index.html`` in your web browser.
es: Luego puedes explorar la documentación abriendo ``_build/html/index.html`` en tu navegador web.
fr: Vous pouvez ensuite parcourir la documentation en ouvrant ``_build/html/index.html`` dans votre navigateur web.
ga: Ansin is féidir leat na doiciméid a bhrabhsáil trí ''_build/html/index.html'' a oscailt i do bhrabhsálaí gréasáin.
it: Sarà quindi possibile sfogliare la documentazione aprendo ``_build/html/index.html`` nel proprio browser web.
ru: Затем вы можете просмотреть документацию, открыв ``_build/html/index.html`` в своем веб-браузере.
ta: உங்கள் வலை உலாவியில் `` _puild/html/index.html`` ஐ திறந்து ஆவணங்களை உலாவலாம்.
tr: Daha sonra web tarayıcınızda ``_build/html/index.html`` dosyasını açarak belgelere göz atabilirsiniz.
uk: Потім ви можете переглядати документацію, відкривши ``_build/html/index.html`` у своєму веб-браузері.
zh_tw: 完成後，可以在瀏覽器開啟 ``_build/html/index.html`` 來瀏覽文件。

source: Dealing with errors
fr: Traiter avec des erreurs
ga: Déileáil le hearráidí
it: Gestire gli errori
ru: Работа с ошибками
ta: பிழைகள் கையாள்வது
tr: Hatalarla başa çıkma
uk: Робота з помилками
zh_tw: 處理錯誤

source: If you run into errors, you may try the following command:
es: Si encuentras errores, puedes probar el siguiente comando:
fr: Si vous rencontrez des erreurs, vous pouvez essayer la commande suivante :
ga: Má ritheann tú isteach i earráidí, is féidir leat triail a bhaint as an ordú seo a leanas:
it: Se si riscontrano errori, si può provare il seguente comando:
ta: நீங்கள் பிழைகள் இருந்தால், பின்வரும் கட்டளையை முயற்சி செய்யலாம்:
tr: Eğer hata ile karşılaşırsanız, aşağıdaki komutu deneyebilirsiniz:
uk: Якщо ви зіткнетеся з помилками, ви можете спробувати таку команду:
zh_tw: 如果遇到錯誤，可以嘗試下列指令：

source: If you get a ``MemoryError`` or ``EOFError``, you can remove the ``classes/`` folder and run ``make`` again. This will drop the class references from the final HTML documentation, but will keep the rest intact.
fr: Si vous obtenez un ``MemoryError`` ou un ``EOFError``, vous pouvez supprimer le dossier ``classes/`` et relancer ``make``. Cela supprimera les références aux classes dans la documentation HTML finale mais gardera le reste intact.
it: Nel caso di un ``MemoryError`` o ``EOFError``, si può rimuovere la cartella ``classes/`` ed eseguire nuovamente ``make``. Ciò eliminerà i riferimenti alle classi dalla documentazione HTML finale ma manterrà intatto il resto.
zh_tw: 如果遇到 ``MemoryError`` 或 ``EOFError``，可以刪除 ``classes/`` 資料夾後重新執行 ``make``。這麼做會讓最終的 HTML 文件中移除類別參考，但其他內容不受影響。

source: If you delete the ``classes/`` folder, do not use ``git add .`` when working on a pull request or the whole ``classes/`` folder will be removed when you commit. See `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ for more detail.
es: Si eliminas la carpeta ``classes/``, no uses ``git add .`` cuando trabajes en una solicitud de extracción (pull request), ya que toda la carpeta ``classes/`` será eliminada cuando realices el commit. Consulta `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ para más detalles al respecto.
fr: Si vous supprimez le dossier ``classes/``, n'utilisez pas ``git add .`` lorsque vous travaillez sur une pull request ou l'ensemble du dossier ``classes/`` sera supprimé lors du commit. Voir `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ pour plus de détails.
ga: Má scriosann tú an fillteán ``classes/``, ná húsáid ``git add .`` agus tú ag obair ar iarratas tarraingte nó bainfear an fillteán iomlán ``ranganna/`` nuair a dhéanann tú gealltanas. Féach `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ le haghaidh tuilleadh sonraí.
it: Se viene cancellata la cartella ``classes/``, non usare ``git add .`` quando si lavora su una richiesta di pull o l'intera cartella ``classes/`` sarà rimossa al momento del commit. Consultare `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ per maggiori dettagli.
ru: Если вы удалите папку ``classes/``, не используйте ``git add .`` при работе над запросом на пулл-реквест, иначе вся папка ``classes/`` будет удалена при коммите. Более подробную информацию смотрите `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ здесь.
ta: நீங்கள் `` வகுப்புகள்/`கோப்புறையை நீக்கினால்,` `கிட் சேர் .` ஐப் பயன்படுத்த வேண்டாம் .`` ஒரு இழுப்பு கோரிக்கையில் பணிபுரியும் போது அல்லது முழு `` வகுப்புகள்/`` கோப்புறை அகற்றப்படும். `#3157 <https://github.com/godotengine/godotengs/issues/3157> __ மேலும் விவரங்களுக்கு பார்க்கவும்.
tr: Eğer ``classes/`` klasörünü silecek olursanız, bir pull request üzerinde çalışırken sakın ``git add .`` (noktaya dikkat) kullanmayın, aksi takdirde işleme yaptığınızda tüm ``classes/`` klasörü kaldırılacaktır. Daha fazla ayrıntı için `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ bölümüne bakın.
uk: Якщо ви видалите папку ``classes/``, не використовуйте ``git add.`` під час роботи над запитом на отримання, інакше вся папка ``classes/`` буде видалена під час фіксації. Див. `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__ для більш детальної інформації.
zh_tw: 如果刪除了 ``classes/`` 資料夾，處理 pull request 時請勿使用 ``git add .``，否則整個 ``classes/`` 資料夾都會被標記為刪除。詳情請見 `#3157 <https://github.com/godotengine/godot-docs/issues/3157>`__。

source: Hints for performance
fr: Indices de performance
ga: Leideanna le haghaidh feidhmíochta
it: Suggerimenti per le prestazioni
ru: Советы по повышению производительности
ta: செயல்திறனுக்கான குறிப்புகள்
tr: Performans için ipuçları
uk: Підказки для виконання
zh_tw: 效能提示

source: RAM usage
fr: Utilisation de la RAM
ga: Úsáid RAM
it: Utilizzo della RAM
ru: Использование оперативной памяти
ta: ராம் பயன்பாடு
tr: RAM kullanımı
uk: використання оперативної пам'яті
zh_tw: 記憶體使用量

source: Building the documentation requires at least 8 GB of RAM to run without disk swapping, which slows it down. If you have at least 16 GB of RAM, you can speed up compilation by running:
es: La construcción de la documentación requiere al menos 8 GB de RAM para ejecutarse sin intercambio de disco, lo que ralentiza el proceso. Si tienes al menos 16 GB de RAM, puedes acelerar la compilación ejecutando:
fr: La compilation de la documentation requiert au moins 8 Go de RAM pour fonctionner sans swapping, ce qui la ralentit. Si vous avez au moins 16 Go de RAM, vous pouvez accélérer la compilation en exécutant :
ga: Éilíonn tógáil an doiciméadú ar a laghad 8 GB RAM a reáchtáil gan swapping diosca, a slows sé síos. Má tá 16 GB RAM ar a laghad agat, is féidir leat dlús a chur le tiomsú trí na nithe seo a leanas a rith:
it: La compilazione della documentazione richiede almeno 8 GB di RAM per funzionare senza swapping del disco, il che la rallenta. Se sono disponibili almeno 16 GB di RAM, è possibile velocizzare la compilazione eseguendo:
ru: Сборка документации требует не менее 8 ГБ оперативной памяти для работы без подкачки дисков, что замедляет ее. Если у вас не менее 16 ГБ оперативной памяти, вы можете ускорить компиляцию, выполнив:
ta: ஆவணங்களை உருவாக்குவதற்கு வட்டு இடமாற்றம் இல்லாமல் இயக்க குறைந்தது 8 சிபி ரேம் தேவைப்படுகிறது, இது மெதுவாக்குகிறது. உங்களிடம் குறைந்தது 16 சிபி ரேம் இருந்தால், இயங்குவதன் மூலம் தொகுப்பை விரைவுபடுத்தலாம்:
tr: Belgelerin derlenmesi, onu yavaşlatan disk takasını kullanmadan hızlı çalışması için en az 8 GB RAM gerektirir. En az 16 GB RAM'iniz varsa, şu komutları çalıştırarak derlemeyi hızlandırabilirsiniz:
uk: Створення документації вимагає принаймні 8 ГБ оперативної пам’яті для роботи без підкачки диска, що уповільнює роботу. Якщо у вас принаймні 16 ГБ оперативної пам’яті, ви можете прискорити компіляцію, виконавши:
zh_tw: 建置文件至少需要 8 GB 記憶體，才能避免使用虛擬記憶體（會拖慢速度）。如果你有 16 GB 以上記憶體，可以用下列指令加速編譯：
