Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/building_the_manual.po
Languages: es, fr, ga, it, ru, ta, tr, uk, zh_tw

source: You can use ``-j auto`` to use all available CPU threads, but this can use a lot of RAM if you have a lot of CPU threads. For instance, on a system with 32 CPU threads, ``-j auto`` (which corresponds to ``-j 32`` here) can require 20+ GB of RAM for Sphinx alone.
es: Puedes usar ``-j auto`` para usar todos los hilos de CPU disponibles, pero esto puede usar mucha RAM si tienes muchos hilos de CPU. Por ejemplo, en un sistema con 32 hilos de CPU, ``-j auto`` (que corresponde a ``-j 32`` aquí) puede requerir más de 20 GB de RAM solo para Sphinx.
fr: Vous pouvez utiliser ``-j auto`` pour utiliser tous les threads CPU disponibles, mais cela peut utiliser beaucoup de RAM si vous avez beaucoup de threads CPU. Par exemple, sur un système avec 32 threads CPU, ``-j auto`` (qui correspond à ``-j 32`` ici) peut nécessiter plus de 20 Go de RAM pour Sphinx seulement.
ga: Is féidir leat ''-j auto'' a úsáid chun gach snáithe LAP atá ar fáil a úsáid, ach is féidir leis seo a lán RAM a úsáid má tá a lán snáitheanna LAP agat. Mar shampla, ar chóras le snáitheanna LAP 32, is féidir le ''-j auto'' (a fhreagraíonn do ''-j 32'' anseo) 20 + GB RAM a éileamh do Sphinx amháin.
it: È possibile usare ``-j auto`` per utilizzare tutti i thread della CPU disponibili, ma ciò può richiedere molta RAM se si hanno molti thread della CPU. Ad esempio, su un sistema con 32 thread della CPU, ``-j auto`` (che in questo caso corrisponde a ``-j 32``) può richiedere più di 20 GB di RAM solo per Sphinx.
ta: கிடைக்கக்கூடிய அனைத்து சிபியு நூல்களையும் பயன்படுத்த நீங்கள் `` -j ஆட்டோ`` ஐப் பயன்படுத்தலாம், ஆனால் உங்களிடம் நிறைய சிபியு நூல்கள் இருந்தால் இது நிறைய ரேம் பயன்படுத்தலாம். உதாரணமாக, 32 சிபியு நூல்களைக் கொண்ட ஒரு கணினியில், `` -J ஆட்டோ`` (இது `` -j 32`` இங்கே ஒத்திருக்கிறது) சூரரிமாச்சிலை க்கு மட்டும் 20+ சிபி ரேம் தேவைப்படலாம்.
tr: Mevcut tüm CPU iş parçacıklarını kullanmak için ``-j auto`` kullanabilirsiniz, ancak çok fazla CPU iş parçacığınız varsa bu çok fazla RAM kullanabilir. Örneğin, 32 CPU iş parçacığı olan bir sistemde, ``-j auto`` (bu durumda ``-j 32``'ye karşılık gelir) yalnızca Sphinx için 20+ GB RAM gerektirebilir.
uk: Ви можете використовувати ``-j auto``, щоб використовувати всі доступні потоки ЦП, але це може використовувати багато оперативної пам'яті, якщо у вас багато потоків ЦП. Наприклад, у системі з 32 потоками процесора ``-j auto`` (що тут відповідає ``-j 32``) може вимагати 20+ ГБ оперативної пам’яті лише для Sphinx.
zh_tw: 你可以使用 ``-j auto`` 來啟用所有可用 CPU 執行緒，但如果執行緒數量很多，會大量佔用記憶體。例如在 32 執行緒的系統上，``-j auto``（等同於 ``-j 32``）僅 Sphinx 就可能需要 20 GB 以上的記憶體。

source: Specifying a list of files
es: Especificando una lista de archivos
fr: Spécifier une liste de fichiers
ga: Liosta comhad a shonrú
it: Specificare una lista di file
ru: Указание списка файлов
ta: கோப்புகளின் பட்டியலைக் குறிப்பிடுகிறது
tr: Bir dosya listesi belirtme
uk: Зазначення списку файлів
zh_tw: 指定檔案清單

source: This section will not work on Windows, since the repository is using a simplified ``make.bat`` script instead of the real GNU Make program. If you would like to get a Linux terminal on your system, consider using `Windows Subsystem for Linux (WSL) <https://learn.microsoft.com/en-us/windows/wsl/>`__.
fr: Cette section ne fonctionnera pas sur Windows, puisque le dépôt utilise un script simplifié ``make.bat`` au lieu du vrai programme GNU Make. Si vous souhaitez obtenir un terminal Linux sur votre système, considérez l'utilisation du `Sous-système Windows pour Linux (WSL, Windows System for Linux) <https://learn.microsoft.com/fr-fr/windows/wsl/>`__.
it: Questa sezione non funzionerà su Windows, poiché il repository utilizza uno script ``make.bat`` semplificato invece del vero programma GNU Make. Se si desidera avere un terminale Linux sul proprio sistema, considera l'utilizzo del `sottosistema Windows per Linux (WSL) <https://learn.microsoft.com/en-us/windows/wsl/>`__.
zh_tw: 本節在 Windows 上無法運作，因為倉庫使用的是簡化版 ``make.bat``，而不是 GNU Make。若要在系統上取得 Linux 終端機，請考慮使用 `Windows Subsystem for Linux (WSL) <https://learn.microsoft.com/en-us/windows/wsl/>`__。

source: You can specify a list of files to build, which can greatly speed up compilation:
es: Puede especificar una lista de archivos para compilar, lo que puede acelerar enormemente la compilación:
fr: Vous pouvez aussi lister des fichiers spécifiques à compiler, cela peut grandement accélérer la compilation :
ga: Is féidir leat liosta de chomhaid a shonrú le tógáil, ar féidir leo dlús mór a chur le tiomsú:
it: È possibile specificare un elenco di file da compilare, il che può velocizzare notevolmente la compilazione:
ta: உருவாக்க கோப்புகளின் பட்டியலை நீங்கள் குறிப்பிடலாம், இது தொகுப்பை பெரிதும் விரைவுபடுத்துகிறது:
tr: Derlenecek dosyaların bir listesini belirtebilirsiniz, bu da derlemeyi büyük ölçüde hızlandırabilir:
uk: Ви можете вказати список файлів для створення, що може значно прискорити компіляцію:
zh_tw: 你可以指定要建置的檔案清單，這樣可以大幅加快編譯速度：

source: The list of files can also be provided by the ``git`` command. This way you can automatically get the names of all files that have changed since the last commit (``sed`` is used to put them on the same line).
fr: La liste des fichiers peut également être fournie par la commande ``git``. De cette façon, vous pouvez obtenir automatiquement les noms de tous les fichiers qui ont changé depuis le dernier commit (``sed`` est utilisé pour les mettre sur la même ligne).
it: La lista di file si può anche fornire tramite il comando ``git``. In questo modo è possibile ottenere automaticamente i nomi di tutti i file che sono cambiati dall'ultimo commit (per inserirli sulla stessa riga si usa ``sed``).
zh_tw: 你也可以利用 ``git`` 指令取得檔案清單。這樣可以自動取得自上次提交以來變更的所有檔名（這裡用 ``sed`` 把檔名串在同一行）。

source: You can replace ``HEAD`` with ``master`` to return all files changed from the ``master`` branch:
fr: Vous pouvez remplacer ``HEAD`` par ``master`` pour renvoyer tous les fichiers modifiés de la branche ``master`` :
it: È possibile sostituire ``HEAD`` con ``master`` per restituire tutti i file modificati dal ramo ``master``:
zh_tw: 你可以將 ``HEAD`` 換成 ``master``，以取得自 ``master`` 分支以來變更的所有檔案：

source: If any images were modified, the output will contain some warnings about them, but the build will proceed correctly.
fr: Si des images ont été modifiées, la sortie contiendra quelques avertissements à leur sujet, mais la compilation continuera correctement.
zh_tw: 如果有圖片被修改，輸出結果可能會出現相關警告，但建置流程仍會正常完成。

source: `Python <https://www.python.org/>`_ 3
ta: `பைதான் <https://www.python.org/>` _ 3

source: Windows
ga: Fuinneoga
ta: சாளரங்கள்

source: If you get a ``MemoryError`` or ``EOFError``, you can remove the ``classes/`` folder and run ``make`` again. This will drop the class references from the final HTML documentation but will keep the rest intact.
ga: Má fhaigheann tú ''MemoryError'' nó ''EOFError'', is féidir leat an fillteán ''classes/'' a bhaint agus ''make'' a rith arís. Scaoilfidh sé seo na tagairtí ranga ón gcáipéisíocht HTML deiridh ach coinneoidh sé an chuid eile slán.
ta: நீங்கள் ஒரு `` மெமரிஆரர்` அல்லது `` ஈஃபெர்ர்`` கிடைத்தால், நீங்கள் `` வகுப்புகள்/`` கோப்புறையை அகற்றி மீண்டும் `` செய்யுங்கள்` மீண்டும் இயக்கலாம். இது இறுதி உஉகுமொ ஆவணங்களிலிருந்து வகுப்பு குறிப்புகளை கைவிடும், ஆனால் மீதமுள்ளவற்றை அப்படியே வைத்திருக்கும்.
tr: Eğer bir ``MemoryError`` veya ``EOFError`` alırsanız, ``classes/`` klasörünü kaldırabilir ve ``make`` 'i tekrar çalıştırabilirsiniz. Bu, sınıf başvurularını sondaki HTML belgelerinden düşürecek, ancak geri kalanını yerinde tutacaktır.
