Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/class_reference_primer.po
Languages: fr, ga, tr

source: Class reference primer
ga: Primer tagartha aicme
tr: Sınıf başvuruları temel ders

source: This page explains how to write the class reference. You will learn where to write new descriptions for the classes, methods, and properties for Godot's built-in node types.
fr: Cette page explique comment écrire la référence de la classe. Vous apprendrez où écrire de nouvelles descriptions pour les classes, les méthodes et les propriétés des types de nœuds intégrés de Godot.
ga: Mínítear ar an leathanach seo conas an tagairt ranga a scríobh. Foghlaimeoidh tú cá háit le cur síos nua a scríobh do na ranganna, na modhanna agus na hairíonna do chineálacha nód tógtha Godot.
tr: Bu sayfa, sınıf başvurularını nasıl yazacağınızı açıklar. Godot'nun yerleşik düğüm türleri olan sınıflar, yöntemler, ve özellikleri için yeni tanımlamaları nereye ve nasıl yazacağınızı öğreneceksiniz.

source: To learn to submit your changes to the Godot project using the Git version control system, see :ref:`doc_updating_the_class_reference`.
fr: Pour apprendre à soumettre vos modifications au projet Godot en utilisant le système de contrôle de version Git, consultez :ref:`doc_updating_the_class_reference`.
ga: Chun foghlaim conas do chuid athruithe a chur faoi bhráid thionscadal Godot ag baint úsáide as córas rialaithe leagan Git, féach :ref:'doc_updating_the_class_reference'.
tr: Yaptığınız değişiklikleri, Git sürüm kontrol sistemini kullanarak Godot projesine göndermeyi öğrenmek için şuraya bakınız :ref:`doc_updating_the_class_reference`.

source: The reference for each class is contained in an XML file like the one below:
fr: La référence de chaque classe est contenue dans un fichier XML comme celui ci-dessous :
ga: Tá an tagairt do gach rang le fáil i gcomhad XML cosúil leis an gceann thíos:
tr: Her sınıfın başvurusu, aşağıdakine benzer bir XML dosyasında tutulur:

source: It starts with brief and long descriptions. In the generated docs, the brief description is always at the top of the page, while the long description lies below the list of methods, variables, and constants. You can find methods, member variables, constants, and signals in separate XML nodes.
fr: Cela commence par des descriptions brèves et longues. Dans la documentation générée, la description brève se trouve toujours en haut de la page, tandis que la description longue se trouve sous la liste des méthodes, des variables et des constantes. Vous pouvez trouver les méthodes, les variables membres, les constantes et les signaux dans des nœuds XML distincts.
ga: Tosaíonn sé le cur síos gairid agus fada. Sna docs a ghintear, tá an cur síos gairid i gcónaí ag barr an leathanaigh, agus tá an cur síos fada faoi bhun liosta na modhanna, na n-athróg agus na dtairisigh. Is féidir leat modhanna, athróga ball, tairisigh, agus comharthaí a fháil i nóid XML ar leith.
tr: İlk olarak brief (kısa) ve sonra uzun tanımlamalar ile (descriptions) başlar. Üretilen belgelerde, kısa açıklama her zaman sayfanın en üstünde olurken, uzun açıklama ise yöntemler, değişkenler, ve sabitler listesinin altında kalır. Yöntemler, üye değişkenler, sabitler, ve sinyaller kendilerine ait ayrı XML düğümlerinde yer alırlar.

source: For each, you want to learn how they work in Godot's source code. Then, fill their documentation by completing or improving the text in these tags:
fr: Pour chacun, vous voulez apprendre comment ils fonctionnent dans le code source de Godot. Ensuite, remplissez leur documentation en complétant ou en améliorant le texte de ces balises :
ga: I gcás gach ceann acu, ba mhaith leat a fháil amach conas a oibríonn siad i gcód foinse Godot. Ansin, líon isteach a gcuid doiciméadú tríd an téacs sna clibeanna seo a chomhlánú nó a fheabhsú:
tr: Godot'nun kaynak kodundan, her birinin nasıl çalıştıklarını öğrenmek istersiniz. O halde, aşağıdaki etiketlerin içindeki metinleri tamamlayarak ya da geliştirerek ilgili belgeleri doldurun:

source: `<method>` (in its `<description>` tag; return types and arguments don't take separate documentation strings)
fr: `<method>` (dans sa balise `<description>` ; les types de retour et les arguments ne prennent pas de chaînes de documentation séparées)
ga: `<method>` (ina chlib `<description>`; ní ghlacann cineálacha tuairisceáin agus argóintí teaghráin doiciméadaithe ar leith)
tr: `<method>` (yöntem; dönüş tipleri ve girdi değişkenleri için ayrı bir belge dizesi yoktur, onları açıklamak için yöntemin `<description>` etiketini kullanın)

source: `<signal>` (in its `<description>` tag; arguments don't take separate documentation strings)
fr: `<signal>` (dans sa balise `<description>` ; les arguments ne prennent pas de chaînes de documentation séparées)
ga: `<signal>` (ina chlib `<description>; ní thógann argóintí teaghráin doiciméadaithe ar leith)
tr: `<signal>` (sinyal; girdi değişkenleri için ayrı belge dizeleri yoktur, açıklamak için sinyalin `<description>` etiketini kullanın)

source: Write in a clear and simple language. Always follow the :ref:`writing guidelines <doc_docs_writing_guidelines>` to keep your descriptions short and easy to read. **Do not leave empty lines** in the descriptions: each line in the XML file will result in a new paragraph, even if it is empty.
fr: Écrivez dans un langage clair et simple. Suivez toujours :ref:`les directives d’écriture <doc_docs_writing_guidelines>` pour garder vos descriptions courtes et faciles à lire. **Ne laissez pas de lignes vides** dans les descriptions : chaque ligne du fichier XML entraînera un nouveau paragraphe, même s’il est vide.
ga: Scríobh i dteanga shoiléir shimplí. Lean na :ref:`treoirlínte scríbhneoireachta <doc_docs_writing_guidelines>` i gcónaí chun do chur síos a choinneáil gearr agus éasca le léamh. **Ná fág línte folamh** sna tuairiscí: beidh alt nua mar thoradh ar gach líne sa chomhad XML, fiú má tá sí folamh.
tr: Temiz ve basit bir dil ile yazın. Tanımlamalarınızın kısa ve okuması kolay olması için, her zaman :ref:`yazım kılavuzları <doc_docs_writing_guidelines>` 'nı takip edin. Tanımlamalarınızda **boş satırlar bırakmayın**: XML dosyasındaki, boş olsa bile, yeni bir paragraf olarak ele alınacaktır.

source: How to edit class XML
fr: Comment modifier la classe XML
ga: Conas XML ranga a chur in eagar
tr: Bir sınıfın XML dosyası nasıl düzenlenir

source: Edit the file for your chosen class in ``doc/classes/`` to update the class reference. The folder contains an XML file for each class. The XML lists the constants and methods you will find in the class reference. Godot generates and updates the XML automatically.
fr: Modifiez le fichier de la classe choisie dans ``doc/classes/`` pour mettre à jour la référence de la classe. Le dossier contient un fichier XML pour chaque classe. Le XML liste les constantes et les méthodes que vous trouverez dans la référence de la classe. Godot génère et met à jour le XML automatiquement.
ga: Cuir an comhad in eagar don rang roghnaithe in ''doc/classes/'' chun an tagairt ranga a nuashonrú. Tá comhad XML san fhillteán do gach rang. Liostaíonn an XML na tairisigh agus na modhanna a gheobhaidh tú sa tagairt ranga. Gineann agus nuashonraíonn Godot an XML go huathoibríoch.
tr: Sınıf başvurusunu güncellemek için, ``doc/classes/`` klasörü altında seçtiğiniz sınıfa ait dosyayı düzenleyin. Bu klasör, her bir sınıf için birer XML dosya içerir. XML dosyalar, sınıf başvurularında bulabileceğiniz sabitleri ve yöntemleri listeler. Godot, bu XML dosyaları otomatik olarak üretir ve günceller.

source: For some modules in the engine's source code, you'll find the XML files in the ``modules/<module_name>/doc_classes/`` directory instead.
fr: Pour certains modules du code source du moteur, vous trouverez les fichiers XML dans le répertoire ``modules/<module_name>/doc_classes/`` à la place.
ga: I gcás roinnt modúl i gcód foinse an innill, gheobhaidh tú na comhaid XML san eolaire ``modules/<module_name>/doc_classes/`` ina ionad sin.
tr: Farklı olarak, motorun kaynak kodundaki bazı birimler (module) için, XML dosyalarını ``modules/<module_ismi>/doc_classes/`` klasörü altında bulabilirsiniz.

source: Edit it using your favorite text editor. If you use a code editor, make sure that it doesn't change the indent style: you should use tabs for the XML and four spaces inside BBCode-style blocks. More on that below.
fr: Modifiez-le en utilisant votre éditeur de texte préféré. Si vous utilisez un éditeur de code, assurez-vous qu'il ne modifie pas le style d'indentation : vous devez utiliser des tabulations pour le XML et quatre espaces à l'intérieur des blocs de style BBCode. Plus d'informations à ce sujet ci-dessous.
ga: Cuir in eagar é ag baint úsáide as an eagarthóir téacs is fearr leat. Má úsáideann tú eagarthóir cód, déan cinnte nach n-athraíonn sé stíl na heangaí: ba chóir duit cluaisíní a úsáid don XML agus ceithre spás taobh istigh de bhloic stíl BBCode. Tuilleadh faoi sin thíos.
tr: Sevdiğiniz bir metin düzenleyicide düzenleyin. Eğer bir kod düzenleyici kullanıyorsanız, girintileme tarzını değiştirmediğinden emin olun: XML için sekme karakteri kullanmalı, BBCode-tarzı kısımların içinde 4 boşluk kullanmalısınız. Daha fazlası aşağıda.

source: To check that the modifications you've made are correct in the generated documentation, navigate to the ``doc/`` folder and run the command ``make rst``. This will convert the XML files to the online documentation's format and output errors if anything's wrong.
fr: Pour vérifier que les modifications que vous avez faites sont correctes dans la documentation générée, naviguez dans le dossier ``doc/`` et exécutez la commande ``make rst``. Cela convertira les fichiers XML au format de la documentation en ligne et affichera des erreurs si quelque chose ne va pas.
ga: Chun a sheiceáil go bhfuil na modhnuithe atá déanta agat ceart sa cháipéisíocht ghinte, téigh chuig an bhfillteán ''doc/'' agus rith an t-ordú ''make rst''. Déanfaidh sé seo na comhaid XML a thiontú go formáid agus earráidí aschuir na ndoiciméad ar líne má tá aon rud mícheart.
tr: Yaptığınız değişikliklerin üretilen belgelerde doğru olduğunu denetlemek için, ``doc/`` klasörüne gidin ve ``make rst`` komutunu çalıştırın. Bununla XML dosyalarını çevrim içi belgelerin biçimine çevirirsiniz, ya da bir şey yanlış giderse hatalar alırsınız.

source: Alternatively, you can build Godot and open the modified page in the built-in code reference. To learn how to compile the engine, read the :ref:`compilation guide <toc-devel-compiling>`.
fr: Alternativement, vous pouvez construire Godot et ouvrir la page modifiée dans la référence de code intégrée. Pour savoir comment compiler le moteur, lisez le :ref:`guide de compilation <toc-devel-compiling>`.
ga: De rogha air sin, is féidir leat Godot a thógáil agus an leathanach modhnaithe a oscailt sa tagairt cód ionsuite. Le foghlaim conas an t-inneall a thiomsú, léigh an :ref:`treoir tiomsaithe <toc-devel-compiling>`.
tr: Buna alternatif olarak, Godot'yu elinizde derleyip, değiştirilmiş sayfayı yerleşik kod başvurusu yoluyla açabilirsiniz. Motoru nasıl derleyeceğiniz öğrenmek için :ref:`derleme kılavuzu <toc-devel-compiling>` 'nu okuyun.

source: We recommend using a code editor that supports XML files like Vim, Atom, Visual Studio Code, Notepad++, or another to comfortably edit the file. You can also use their search feature to find classes and properties quickly.
fr: Nous vous recommandons d'utiliser un éditeur de code prenant en charge les fichiers XML comme Vim, Atom, Visual Studio Code, Notepad++ ou autre pour éditer confortablement le fichier. Vous pouvez également utiliser leur fonction de recherche pour trouver rapidement les classes et les propriétés.
ga: Molaimid eagarthóir cód a úsáid a thacaíonn le comhaid XML cosúil le Vim, Adamh, Cód Stiúideo Amhairc, Notepad ++, nó ceann eile chun an comhad a chur in eagar go compordach. Is féidir leat a ngné chuardaigh a úsáid freisin chun ranganna agus airíonna a aimsiú go tapa.
tr: XML dosyalarını destekleyen bir kod düzenleyici kullanmanızı öneriyoruz: Vim, Atom, Visual Studio Code, Notepad++, veya dosya düzenlerken rahat edeceğiniz başka biri. Ayrıca, bunların arama özelliğini kullanarak sınıfları ve özellikleri hızlı bir şekilde bulabilirsiniz.

source: If you use Visual Studio Code, you can install the `vscode-xml extension <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__ to get linting for class reference XML files.
fr: Si vous utilisez Visual Studio Code, vous pouvez installer l'`extension vscode-xml <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__ pour obtenir du linting pour les fichiers XML de références de classes.
ga: Má úsáideann tú Visual Studio Code, is féidir leat an síneadh `vscode-xml <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__ a shuiteáil chun linting a fháil le haghaidh comhaid XML tagartha ranga.
tr: Visual Studio Code kullanıyorsanız, sınıf başvurusu XML dosyaları için yazım düzeltme yardımı (linting) almak üzere bu `vscode-xml uzantısını <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__ yükleyebilirsiniz.

source: Improve formatting with BBCode style tags
fr: Améliorez le formatage avec les balises de style BBcode
ga: Feabhas a chur ar fhormáidiú le clibeanna stíl BBCode
tr: BBCode tarzı etiketlerle biçimlendirmeyi geliştirmek

source: Godot's XML class reference supports BBCode-like tags for linking as well as formatting text and code. In the tables below you can find the available tags, usage examples and the results after conversion to reStructuredText.
fr: La référence de classe XML de Godot prend en charge les balises BBCode pour lier et formater le texte et le code. Dans les tableaux ci-dessous vous pouvez trouver les étiquettes disponibles, les exemples d'utilisation et les résultats après conversion en reStructuredText.
ga: Tacaíonn tagairt ranga XML Godot le clibeanna cosúil le BBCode chun nascadh chomh maith le téacs agus cód a fhormáidiú. Sna táblaí thíos is féidir leat teacht ar na clibeanna atá ar fáil, samplaí úsáide agus na torthaí tar éis comhshó go reStructuredText.
tr: Godot'nun XML sınıf başvuruları, metin ve kodu biçimlendirmenin yanı sıra bağlantılar için BBCode benzeri etiketleri de destekler. Aşağıdaki tablolarda mevcut etiketleri, kullanım örneklerini ve reStructuredText'e dönüştürüldükten sonraki sonuçları bulabilirsiniz.

source: Linking
fr: Lier
ga: Nascadh
tr: Bağlantı verme

source: Whenever you link to a member of another class, you need to specify the class name. For links to the same class, the class name is optional and can be omitted.
fr: Chaque fois que vous créez un lien vers un membre d'une autre classe, vous devez spécifier le nom de la classe. Pour les liens vers la même classe, le nom de la classe est facultatif et peut être omis.
ga: Aon uair a nascann tú le ball de rang eile, ní mór duit ainm an ranga a shonrú. Maidir le naisc chuig an rang céanna, tá ainm an ranga roghnach agus is féidir é a fhágáil ar lár.
tr: Başka bir sınıfın bir üyesine bağlantı verdiğinizde, sınıf adını belirtmeniz gerekir. Aynı sınıfa bağlantılar için sınıf adı isteğe bağlıdır ve atlanabilir.

source: Tag and Description
fr: Étiquettes et Description
ga: Clib agus Cur Síos
tr: Etiket ve Tanımlama

source: Example
fr: Exemple
ga: Sampla
tr: Örnek

source: Result
fr: Résultat
ga: Toradh
tr: Sonucu

source: ``[Class]``
ga: ''[Aicme]''

source: Link to class
fr: Lien vers une classe
ga: Nasc leis an rang
tr: Sınıfa bağlantı

source: ``Move the [Sprite2D].``
fr: ``Déplacer le [Sprite2D].``
ga: ''Bog an [Sprite2D].''
tr: ``[Sprite2D] 'yi taşı.``

source: Move the :ref:`class_Sprite2D`.
fr: Déplacez le :ref:`class_Sprite2D`.
ga: Bog an :ref:'class_Sprite2D'.
tr: :ref:`class_Sprite2D` 'yi taşı.

source: ``[annotation Class.name]``
ga: ''[anótáil Class.name]''

source: Link to annotation
fr: Lien vers l'annotation
ga: Nasc chuig anótáil
tr: Ek tanımlayıcıya bağlantı

source: ``See [annotation @GDScript.@rpc].``
fr: ``Voir [annotation @GDScript.@rpc].``
ga: ''Féach [anótáil @GDScript.@rpc].''
tr: ``Bakınız [annotation @GDScript.@rpc].``

source: See :ref:`@GDScript.@rpc <class_@GDScript_annotation_@rpc>`.
fr: Voir :ref:`@GDScript.@rpc <class_@GDScript_annotation_@rpc>`.
ga: Féach :ref:`@GDScript.@rpc <class_@GDScript_annotation_@rpc>`.
tr: Bakınız :ref:`@GDScript.@rpc <class_@GDScript_annotation_@rpc>`.

source: ``[constant Class.name]``
ga: ''[tairiseach Class.name]''

source: Link to constant
fr: Lien vers une constante
ga: Nasc le tairiseach
tr: Sabite bağlantı

source: ``See [constant Color.RED].``
fr: ``Voir [constant Color.RED].``
ga: ''Féach [Dath tairiseach.RED].''
tr: ``Bakınız [constant Color.RED].``

source: See :ref:`Color.RED <class_Color_constant_RED>`.
fr: Voir :ref:`Color.RED <class_Color_constant_RED>`.
ga: Féach :ref:`Color.RED <class_Color_constant_RED>`.
tr: Bakınız :ref:`Color.RED <class_Color_constant_RED>`.

source: Link to enum
fr: Lien vers l'énumération
ga: Nasc le enum
tr: "enum" türüne bağlantı

source: ``See [enum Mesh.ArrayType].``
fr: ``Voir [enum Mesh.ArrayType].``
ga: ''Féach [mogalra enum.ArrayType].''
tr: ``Bakınız [enum Mesh.ArrayType].``

source: See :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`.
fr: Voir :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`.
ga: Féach :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`.
tr: Bakınız :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`.

source: ``[member Class.name]``
ga: ''[ball Class.name]''

source: Link to member
fr: Lier à un membre
ga: Nasc chuig an mball
tr: Üye değişkene bağlantı

source: ``Get [member Node2D.scale].``
fr: ``Obtenir [member Node2D.scale].``
ga: ''Faigh [ball Node2D.scale].''
tr: ``[member Node2D.scale] 'i al.``

source: Get :ref:`Node2D.scale <class_Node2D_property_scale>`.
fr: Obtenir :ref:`Node2D.scale <class_Node2D_property_scale>`.
ga: Faigh :ref:`Node2D.scale <class_Node2D_property_scale>`.
tr: :ref:`Node2D.scale <class_Node2D_property_scale>` 'i al.

source: ``[method Class.name]``
ga: ''[modh Class.name]''

source: Link to method
fr: Lien vers une méthode
ga: Nasc leis an modh
tr: Üye yönteme bağlantı

source: ``Call [method Node3D.hide].``
fr: ``Appelle [method Node3D.hide].``
ga: ''Glaoigh [modh Node3D.hide].''
tr: ``[method Node3D.hide] 'ı çağır.``

source: Call :ref:`Node3D.hide() <class_Node3D_method_hide>`.
fr: Appelle :ref:`Node3D.hide() <class_Node3D_method_hide>`.
ga: Glaoigh :ref:`Node3D.hide() <class_Node3D_method_hide>`.
tr: :ref:`Node3D.hide() <class_Node3D_method_hide>` 'ı çağır.

source: ``[constructor Class.name]``
ga: ''[cruthaitheoir Class.name]''

source: Link to built-in constructor
fr: Lien vers le constructeur intégré
ga: Nasc chuig tógálaí tógtha
tr: Yerleşik kurucu yönteme bağlantı

source: ``Use [constructor Color.Color].``
fr: ``Utilise [constructor Color.Color].``
ga: ''Úsáid [Dath an Tógálaí.Dath].''
tr: ``[constructor Color.Color] 'ı kullan.``

source: Use :ref:`Color.Color <class_Color_constructor_Color>`.
fr: Utilise :ref:`Color.Color <class_Color_constructor_Color>`.
ga: Úsáid :ref:`Color.Color <class_Color_constructor_Color>`.
tr: :ref:`Color.Color <class_Color_constructor_Color>` 'ı kullan.

source: ``[operator Class.name]``
ga: ''[oibreoir Class.name]''

source: Link to built-in operator
fr: Lien vers un opérateur intégré
ga: Nasc leis an oibreoir ionsuite
tr: Yerleşik işlece bağlantı

source: ``Use [operator Color.operator *].``
fr: ``Utilise [operator Color.operator *].``
ga: ''Úsáid [oibreoir Dath.operator *].''
tr: ``[operator Color.operator *] 'ı kullan.``

source: Use :ref:`Color.operator * <class_Color_operator_mul_int>`.
fr: Utilise :ref:`Color.operator * <class_Color_operator_mul_int>`.
ga: Úsáid :ref:`Color.operator * <class_Color_operator_mul_int>`.
tr: :ref:`Color.operator * <class_Color_operator_mul_int>` 'ı kullan.

source: ``[signal Class.name]``
ga: ''[comhartha Class.name]''

source: Link to signal
fr: Lien vers un signal
ga: Nasc le comhartha
tr: Sinyale bağlantı

source: ``Emit [signal Node.renamed].``
fr: ``Émet [signal Node.renamed].``
ga: ''Astaigh [comhartha Node.renamed].''
tr: ``[signal Node.renamed] sinyalini yay.``

source: Emit :ref:`Node.renamed <class_Node_signal_renamed>`.
fr: Émet :ref:`Node.renamed <class_Node_signal_renamed>`.
ga: Scaoil :ref:`Node.renamed <class_Node_signal_renamed>`.
tr: :ref:`Node.renamed <class_Node_signal_renamed>` sinyalini yay.

source: Link to theme item
fr: Lien vers un objet du thème
ga: Nasc le mír téama
tr: Tema ögesine bağlantı

source: ``See [theme_item Label.font].``
fr: ``Voir [theme_item Label.font].``
ga: ''Féach [theme_item lipéad.font].''
tr: ``Bakınız [theme_item Label.font].``

source: See :ref:`Label.font <class_Label_theme_font_font>`.
fr: Voir :ref:`Label.font <class_Label_theme_font_font>`.
ga: Féach :ref:`Label.font <class_Label_theme_font_font>`.
tr: Bakınız :ref:`Label.font <class_Label_theme_font_font>`.

source: ``[param name]``
ga: ''[De réir ainm absalóideach]''

source: Parameter name (as code)
fr: Nom de paramètre (comme code)
ga: Ainm an pharaiméadair (mar chód)
tr: Parametre adı (kod olarak)

source: ``Takes [param size] for the size.``
fr: ``Prends [param size] pour la taille.``
ga: ''Tógann sé [méid param] don mhéid.''
tr: ``boyut için [param size] alır.``

source: Takes ``size`` for the size.
fr: Prends ``size`` pour la taille.
ga: Tógann sé ''méid'' don mhéid.
tr: Boyut için ``size`` alır.

source: Currently only :ref:`class_@GDScript` has annotations.
fr: Actuellement, seul :ref:`class_@GDScript` contient des annotations.
ga: Faoi láthair níl ach :ref:'class_@GDScript' anótálacha.
tr: Şu anda ek tanımlayıcılara sadece :ref:`class_@GDScript` sahiptir.

source: Formatting text
fr: Formater du texte
ga: Téacs á fhormáidiú
tr: Metin biçimlendirme

source: Line break
fr: Saut de ligne
ga: Briseadh líne
tr: Satır sonu

source: ``Line 1.[br]``
fr: ``Ligne 1.[br]``
ga: ''Líne 1. [br]''
tr: ``Satır 1.[br]``

source: ``Line 2.``
fr: ``Ligne 2.``
ga: ''Líne 2.''
tr: ``Satır 2.``

source: Line 1.
fr: Ligne 1.
ga: Líne 1.
tr: Satır 1.

source: Line 2.
fr: Ligne 2.
ga: Líne 2.
tr: Satır 2.

source: ``[`` and ``]`` respectively
fr: ``[`` et ``]`` respectivement
ga: "'['' agus '']'' faoi seach
tr: Sırasıyla ``[`` ve ``]``

source: [b]text[/b]
fr: [b]texte[/b]
ga: [b]téacs[/b]
tr: [b] metin [/b]

source: Bold
fr: Gras
ga: Trom
tr: Kalın harfli

source: ``Do [b]not[/b] call this method.``
fr: ``[b]Ne pas[/b] appeler cette méthode.``
ga: ''Ná [b]ní[/b] glaoch ar an modh seo.''
tr: ``Bu yöntemi [b]çağırmayın[/b].``

source: Do **not** call this method.
fr: **Ne pas** appeler cette méthode.
ga: Ná **ní** glaoch ar an modh seo.
tr: Bu yöntemi **çağırmayın**.

source: Italic
fr: Italique
ga: Iodálach
tr: Eğik harfli

source: ``Returns the [i]global[/i] position.``
fr: ``Retourne la position [i]globale[/i].``
ga: ''Filleann sé an seasamh [i]domhanda[/i].''
tr: ``[i]Genel[/i] konumu döndürür.``

source: Returns the *global* position.
fr: Retourne la position *globale*.
ga: Filleann sé an seasamh *global *.
tr: *Genel* konumu döndürür.

source: Underline
fr: Souligné
ga: Cuir líne faoi
tr: Altı çizili

source: ``[u]Always[/u] use this method.``
fr: ``[u]Toujours[/u] utiliser cette méthode.``
ga: ''[u]I gcónaí[/u] bain úsáid as an modh seo.''
tr: ``[u]Her zaman[/u] bu yöntemi kullanın.``

source: ``[s]Outdated information.[/s]``
fr: ``[s]Information plus à jour.[/s]``
ga: ''[s]Faisnéis as dáta. [/s]''
tr: ``[s]Güncel olmayan bilgi.[/s]``

source: Hyperlink
fr: Lien web
ga: Hipearnasc
tr: Köprü Bağlantı

source: ``[url=https://example.com]Website[/url]``
fr: ``[url=https://example.com]site Web[/url]``
ga: ''[url=https://example.com]Suíomh Gréasáin[/url]''
tr: ``[url=https://example.com]Web sayfası[/url]``
