Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/class_reference_primer.po
Languages: fr, ga, tr

source: `Website <https://example.com>`_
fr: `site Web<https://example.com>`_
ga: `Suíomh Gréasáin <https://example.com>`_
tr: `Web sayfası <https://example.com>`_

source: Horizontal centering
fr: Centrage horizontal
ga: Lárú cothrománach
tr: Yatay merkez hizalama

source: Keyboard/mouse shortcut
fr: Raccourci clavier/souris
ga: Aicearra méarchláir/luiche
tr: Klavye/fare kısayolu

source: ``Press [kbd]Ctrl + C[/kbd].``
fr: ``Appuyez sur [kbd]Ctrl + C[/kbd].``
ga: ''Brúigh [kbd]Ctrl + C[/kbd].''
tr: ``[kbd]Ctrl + C[/kbd] basın.``

source: Press :kbd:`Ctrl + C`.
fr: Appuyez sur :kbd:`Ctrl + C`.
ga: Preas :kbd:'Ctrl + C'.
tr: :kbd:`Ctrl + C` basın.

source: Inline code fragment
fr: Fragment de code inline
ga: Blúire cód inlíne
tr: Satır içi kod parçası

source: ``Returns [code]true[/code].``
fr: ``Renvoie [code]true[/code].``
ga: ``Filleann [code]fíor[/code].``
tr: ``[code]true[/code] döndürür.``

source: Returns ``true``.
fr: Renvoie ``true``.
ga: Filleann sé ''fíor''.
tr: ``true`` döndürür.

source: Some supported tags like ``[color]`` and ``[font]`` are not listed here because they are not recommended in the engine documentation.
fr: Certaines balises prises en charge telles que ``[color]`` et ``[font]`` ne sont pas listées ici car elles ne sont pas recommandées dans la documentation du moteur de jeu.
ga: Níl roinnt clibeanna tacaithe ar nós ''[dath]'' agus ''[cló]'' liostaithe anseo toisc nach moltar iad i ndoiciméadú an innill.
tr: ``[color]`` ve ``[font]`` gibi desteklenen bazı etiketler motor belgelerinde önerilmediği için burada listelenmemiştir.

source: ``[kbd]`` disables BBCode until the parser encounters ``[/kbd]``.
fr: ``[kbd]`` désactive le BBCode jusqu'à ce que l'analyseur rencontre ``[/kbd]``.
ga: Díchumasaigh ''[kbd]'' BBCode go dtí go dtagann an parsálaí ar ''[/kbd]''.
tr: ``[kbd]``, ayrıştırıcı ``[/kbd]`` ile karşılaşana kadar BBCode'u devre dışı bırakır.

source: ``[code]`` disables BBCode until the parser encounters ``[/code]``.
fr: ``[code]`` désactive le BBCode jusqu'à ce que l'analyseur rencontre ``[/code]``.
ga: Déanann ``[code]`` BBCode a dhíchumasú go dtí go dtagann an parsálaí ar ``[/code]``.
tr: ``[code]``, ayrıştırıcı ``[/code]`` ile karşılaşana kadar BBCode'u devre dışı bırakır.

source: Formatting code blocks
fr: Formater des blocs de code
ga: Bloic cód formáidithe
tr: Kod bloklarını biçimlendirme

source: There are two options for formatting code blocks:
fr: Il existe deux options pour formater les blocs de code :
ga: Tá dhá rogha ann maidir le bloic cód formáidithe:
tr: Kod bloklarını biçimlendirmek için iki seçenek vardır:

source: Use ``[codeblock]`` if you want to add an example for a specific language.
fr: Utiliser ``[codeblock]`` si vous voulez ajouter un exemple pour un langage spécifique.
ga: Bain úsáid as ''[codeblock]'' más mian leat sampla a chur le haghaidh teanga ar leith.
tr: Belirli bir dil için örnek eklemek istiyorsanız ``[codeblock]`` kullanın.

source: Use ``[codeblocks]``, ``[gdscript]``, and ``[csharp]`` if you want to add the same example for both languages, GDScript and C#.
fr: Utilisez ``[codeblocks]``, ``[gdscript]``, et ``[csharp]`` si vous voulez ajouter le même exemple pour chacun des langages, GDScript and C#.
ga: Bain úsáid as ''[codeblocks]'', ''[gdscript]'', agus ''[csharp]'' más mian leat an sampla céanna a chur leis an dá theanga, GDScript agus C#.
tr: Aynı örneği hem GDScript hem de C# dilleri için eklemek istiyorsanız ``[codeblocks]``, ``[gdscript]`` ve ``[csharp]`` kullanın.

source: By default, ``[codeblock]`` highlights GDScript syntax. You can change it using the ``lang`` attribute. Currently supported options are:
fr: Par défaut, ``[codeblock]`` met en surbrillance la syntaxe GDScript. Vous pouvez la modifier à l'aide de l'attribut ``lang``. Les options actuellement prises en charge sont :
ga: De réir réamhshocraithe, leagann ''[codeblock]'' béim ar chomhréir GDScript. Is féidir leat é a athrú ag baint úsáide as an tréith ''lang''. Is iad na roghanna a dtacaítear leo faoi láthair ná:
tr: Varsayılan olarak, ``[codeblock]`` GDScript sözdizimini vurgular. Bunu ``lang`` niteliğini kullanarak değiştirebilirsiniz. Şu anda desteklenen seçenekler şunlardır:

source: ``[codeblock lang=text]`` disables syntax highlighting;
fr: ``[codeblock lang=text]`` désactive la coloration syntaxique ;
ga: ''[codeblock lang=text]'' díchumasaigh aibhsiú comhréire;
tr: ``[codeblock lang=text]`` sözdizimi vurgulamayı devre dışı bırakır;

source: ``[codeblock lang=gdscript]`` highlights GDScript syntax;
fr: ``[codeblock lang=gdscript]`` met en évidence la syntaxe GDScript ;
ga: Leagann ''[codeblock lang=gdscript]'' béim ar chomhréir GDScript;
tr: ``[codeblock lang=gdscript]`` GDScript sözdizimini vurgular;

source: ``[codeblock lang=csharp]`` highlights C# syntax (only in .NET version).
fr: ``[codeblock lang=csharp]`` met en évidence la syntaxe C# (uniquement dans la version .NET).
ga: ''[codeblock lang=csharp]'' aibhsíonn comhréir C# (ach amháin i leagan .NET).
tr: ``[codeblock lang=csharp]`` C# sözdizimini vurgular (yalnızca .NET sürümünde).

source: ``[codeblock]`` disables BBCode until the parser encounters ``[/codeblock]``.
fr: ``[codeblock]`` désactive le BBCode jusqu'à ce que l'analyseur rencontre ``[/codeblock]``.
ga: Díchumasaíonn ''[codeblock]'' BBCode go dtí go dtagann an parsálaí ar ''[/codeblock]''.
tr: ``[codeblock]``, ayrıştırıcı ``[/codeblock]`` ile karşılaşana kadar BBCode'u devre dışı bırakır.

source: For example:
fr: Par exemple :
ga: Mar shampla:
tr: Örneğin:

source: Will display as:
fr: S'affichera comme cela :
ga: Taispeánfar mar:
tr: Şöyle görüntülenecektir:

source: If you need to have different code version in GDScript and C#, use ``[codeblocks]`` instead. If you use ``[codeblocks]``, you also need to have at least one of the language-specific tags, ``[gdscript]`` and ``[csharp]``.
fr: Si vous avez besoin d'avoir une version de code différente en GDScript et en C#, utilisez plutôt ``[codeblocks]``. Si vous utilisez ``[codeblocks]``, vous devez aussi avoir au moins une des balises spécifiques au langage, ``[gdscript]`` et ``[csharp]``.
ga: Más gá duit leagan cód difriúil a bheith agat i GDScript agus C #, bain úsáid as ``[codeblocks]`` ina ionad. Má úsáideann tú ``[codeblocks]``, ní mór duit ceann amháin ar a laghad de na clibeanna teanga a bheith agat, ``[gdscript]`` agus ``[csharp]``.
tr: Kodun hem GDScript hem de C# şeklini vermeniz gerekiyorsa, bunun yerine ``[codeblocks]`` kullanın. Eğer ``[codeblocks]`` kullanırsanız, dile-özgü ``[gdscript]`` ve ``[csharp]`` etiketlerinden en az birini kullanmak zorundasınız.

source: Always write GDScript code examples first! You can use this `experimental code translation tool <https://github.com/HaSa1002/codetranslator>`_ to speed up your workflow.
fr: Commencez toujours par écrire des exemples de code GDScript ! Vous pouvez utiliser cet `outil expérimental de traduction de code <https://github.com/HaSa1002/codetranslator>`_ pour accélérer votre flux de travail.
ga: Scríobh samplaí de chód GDScript ar dtús i gcónaí! Is féidir leat an `uirlis aistriúcháin cód trialach <https://github.com/HaSa1002/codetranslator>`_ seo a úsáid chun do shreabhadh oibre a bhrostú.
tr: Her zaman ilk olarak GDScript kod örneğini yazın! İsterseniz, iş akışınızı hızlandırmak için, `deneysel kod çeviri aracı <https://github.com/HaSa1002/codetranslator>`_ 'nı kullanabilirsiniz.

source: The above will display as:
fr: Ce qui précède s'affichera comme suit :
ga: Taispeánfar an méid thuas mar:
tr: Yukarıdaki kod şöyle görüntülenir:

source: Formatting notes and warnings
fr: Formatage des notes et des avertissements
ga: Nótaí agus rabhaidh formáidithe
tr: Notları ve uyarıları biçimlendirme

source: To denote important information, add a paragraph starting with "[b]Note:[/b]" at the end of the description:
fr: Pour signaler des informations importantes, ajoutez un paragraphe commençant par "[b]Note :[/b]" à la fin de la description :
ga: Chun faisnéis thábhachtach a léiriú, cuir mír leis ag tosú le “[b] Nóta: [/b]” ag deireadh an tuairisc:
tr: Önemli olan kısımlara işaret etmek için, tanımlamanın sonunda "[b]Note:[/b]" ile başlayan bir paragraf ekleyin:

source: To denote crucial information that could cause security issues or loss of data if not followed carefully, add a paragraph starting with "[b]Warning:[/b]" at the end of the description:
fr: Pour indiquer les informations cruciales qui pourraient entraîner des problèmes de sécurité ou la perte de données si elles ne sont pas suivies attentivement, ajoutez un paragraphe commençant par "[b]Warning:[/b]" à la fin de la description :
ga: Chun faisnéis ríthábhachtach a léiriú a d'fhéadfadh saincheisteanna slándála nó cailliúint sonraí mura leanfar iad go cúramach, cuir mír leis ag tosú le “[b] Rabhadh: [/b]” ag deireadh an tuairisc:
tr: Dikkat edilmesi gereken bilgileri işaret etmek için - doğru yapılmazsa güvenlik açıklarına ya da veri kaybına yol açabilecek şeyler - tanımlamanın sonunda "[b]Warning:[/b]" ile başlayan bir paragraf ekleyin:

source: In all the paragraphs described above, make sure the punctuation is part of the BBCode tags for consistency.
fr: Dans tous les paragraphes décrits ci-dessus, assurez-vous que la ponctuation fait partie des balises BBCode pour des raisons de cohérence.
ga: Sna míreanna go léir a thuairiscítear thuas, déan cinnte go bhfuil an poncáil mar chuid de na clibeanna BBCode le haghaidh comhsheasmhachta.
tr: Yukarıda belirtilen bütün paragraflarda, tutarlılığı sürdürmek için BBCode etiketlerinin parçası olan noktalama işaretlerini doğru kullandığınızdan emin olun.

source: Marking API as deprecated/experimental
fr: Marque l'API comme expérimentale/Dépréciée
ga: API a mharcáil mar dhúlagó/turgnamhach
tr: API'yi kullanımdan kaldırılmış/deneysel olarak işaretleme

source: To mark an API as deprecated or experimental, you need to add the corresponding XML attribute. The attribute value must be a message explaining why the API is not recommended (BBCode markup is supported) or an empty string (the default message will be used). If an API element is marked as deprecated/experimental, then it is considered documented even if the description is empty.
fr: Pour marquer une API comme obsolète ou expérimentale, vous devez ajouter l'attribut XML correspondant. La valeur de l'attribut doit être un message expliquant pourquoi l'API n'est pas recommandée (le balisage BBCode est pris en charge) ou une chaîne vide (le message par défaut sera utilisé). Si un élément d'API est marqué comme obsolète/expérimental, il est alors considéré comme documenté même si la description est vide.
ga: Chun API a mharcáil mar dhíscaoileadh nó turgnamhach, ní mór duit an tréith XML comhfhreagrach a chur leis. Caithfidh an luach tréithe a bheith ina teachtaireacht a mhíníonn cén fáth nach mholtar an API (tacaítear le marcáil BBCode) nó teaghrán folamh (úsáidfear an teachtaireacht réamhshocraithe). Má tá eilimint API marcáilte mar dhíspreagth/turgnamhach, meastar go bhfuil sé doiciméadaithe fiú má tá an tuairisc folamh.
tr: Bir API'yi kullanımdan kaldırılmış veya deneysel olarak işaretlemek için ilgili XML özniteliğini eklemeniz gerekir. Öznitelik değeri, API'nin neden önerilmediğini açıklayan bir mesaj (BBCode işaretlemesi desteklenir) veya boş bir dize (varsayılan mesaj kullanılacaktır) olmalıdır. Bir API ögesi kullanımdan kaldırılmış/deneysel olarak işaretlenmişse, açıklama boş olsa bile belgelenmiş kabul edilir.

source: `<brief_description>`
tr: `<brief_description>` (kısa açıklama)

source: `<description>`
tr: `<description>` (açıklama)

source: `<constant>`
tr: `<constant>` (sabit)

source: `<member>`
tr: `<member>` (üye değişken)

source: ``[lb]b[rb]text[lb]/b[rb]``
fr: ``[lb]b[rb]texte[lb]/b[rb]``
tr: ``[lb]b[rb] metin [lb]/b[rb]``

source: Strikethrough
fr: Barré
tr: Üstü çizili

source: Use ``[codeblock]`` for pre-formatted code blocks. Inside ``[codeblock]``, always use **four spaces** for indentation. The parser will delete tabs.
fr: Utiliser ``[codeblock]`` pour des blocs de code préformatés. À l'intérieur de ``[codeblock]``, utiliser toujours **quatre espaces** pour l'indentation. L'analyseur supprimera les tabulations.
tr: Ön-biçimli kod parçaları için ``[codeblock]`` kullanın. ``[codeblock]`` içerisinde, girinti için her zaman **4 boşluk** kullanın. Çözümleyici sekme karakterlerini silecektir.
