Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/contributing_to_the_documentation.po
Languages: cs, ga, it, ko, ru, ta, tr, uk, zh_tw

source: Click "Commit changes...", summarize the changes you made and make sure to replace the placeholder "Update file.rst" by a short, but clear one-line description, as this is the commit title. Click the button **Propose changes**.
it: Cliccare su "Commit changes...", riepilogare le modifiche apportate e assicurarsi di sostituire il segnaposto "Update file.rst" con una breve ma chiara descrizione di una sola riga, poiché questo è il titolo del commit. Cliccare sul pulsante **Propose changes**.
ta: "மாற்றங்களைச் செய்யுங்கள் ..." என்பதைக் சொடுக்கு செய்து, நீங்கள் செய்த மாற்றங்களைச் சுருக்கமாகக் கூறி, ஒதுக்கீட்டு தலைப்பு என்பதால், ஒதுக்கீட்டு தலைப்பு, ஆனால் தெளிவான ஒரு வரி விளக்கத்தால் ஒதுக்கீட்டு "புதுப்பிப்பு File.rst" ஐ மாற்றுவதை உறுதிசெய்க. பொத்தானைக் சொடுக்கு செய்க ** மாற்றங்களை முன்மொழியுங்கள் **.
zh_tw: 點擊「Commit changes...」，簡要說明你所做的變更，並將預設的「Update file.rst」替換為簡短明確的單行敘述（作為提交標題）。最後點選 **Propose changes**。

source: On the following screens, click the **Create pull request** button until you see a message like *Username wants to merge 1 commit into godotengine:master from Username:patch-1*.
ga: Ar na scáileáin seo a leanas, cliceáil ar an gcnaipe **Cruthaigh iarratas tarraingthe ** go dtí go bhfeiceann tú teachtaireacht cosúil le *Is mian le hainm úsáideora 1 a chumasc i godotengine: máistir ó Ainm Úsáideora: paiste-1 *.
it: Nelle schermate successive, cliccare sul pulsante **Create pull request** finché non appare un messaggio simile a *Username wants to merge 1 commit into godotengine:master from Username:patch-1*.
ta: பின்வரும் திரைகளில், ** புல் கோரிக்கை ** பொத்தானைக் சொடுக்கு செய்க ** பயனர்பெயர் 1 போன்ற ஒரு செய்தியைக் காணும் வரை 1 காடோடெங்கினில் கமிட்டிங் செய்ய விரும்புகிறது: பயனர்பெயரிலிருந்து மாச்டர்: ஒட்டு -1*.
tr: Sonraki ekranlarda, *Username wants to merge 1 commit into godotengine:master from Username:patch-1* gibi bir mesaj görene kadar **Create pull request** düğmesine tıklayın.
uk: На наступних екранах натискайте кнопку **Створити запит на отримання**, доки не побачите повідомлення на кшталт *Ім’я користувача хоче об’єднати 1 комміт у godotengine:master із імені користувача:patch-1*.
zh_tw: 在接下來的畫面，持續點選 **Create pull request** 按鈕，直到看到類似「Username wants to merge 1 commit into godotengine:master from Username:patch-1」的訊息。

source: If there are more commits than your own in the pull request it is likely that your branch was created using the wrong origin, due to "master" not being the current branch in step 2. You will need to rebase your branch to "master" or create a new branch.
it: Se nella richiesta di pull sono presenti più commit del proprio, è probabile che il proprio branch sia stato creato utilizzando l'origine sbagliata, perché "master" non era il branch attuale nel passaggio 2. Sarà necessario riassegnare il branch a "master" o crearne uno nuovo.
ta: இழுத்தல் கோரிக்கையில் உங்களுடையதை விட அதிகமான கமாவில் இருந்தால், உங்கள் கிளை தவறான தோற்றத்தைப் பயன்படுத்தி உருவாக்கப்பட்டிருக்கலாம், "மாச்டர்" படி 2 இல் தற்போதைய கிளையாக இல்லாததால். உங்கள் கிளையை "மாச்டர்" செய்ய அல்லது புதிய கிளையை உருவாக்க வேண்டும்.
zh_tw: 如果拉取請求中除了你自己的提交外還有其他提交，很可能是因為你的分支不是從 "master" 建立的。你需要將分支 rebase 到 "master"，或重新建立一個新分支。

source: Another contributor will review your changes and merge them into the docs if they're good. They may also make changes or ask you to do so before merging.
ga: Déanfaidh ranníocóir eile athbhreithniú ar do chuid athruithe agus déanfaidh sé iad a chumasc sna docs má tá siad go maith. Féadfaidh siad athruithe a dhéanamh freisin nó iarraidh ort é sin a dhéanamh sula ndéanann siad cumasc.
it: Un altro collaboratore esaminerà le tue modifiche e, se sono valide, effettuerà il merge sulla documentazione. Potrebbe anche apportare modifiche o chiedere di farlo prima di ciò.
ta: மற்றொரு பங்களிப்பாளர் உங்கள் மாற்றங்களை மதிப்பாய்வு செய்து, அவற்றை நன்றாக இருந்தால் அவற்றை டாக்சில் இணைப்பார். அவர்கள் மாற்றங்களைச் செய்யலாம் அல்லது ஒன்றிணைப்பதற்கு முன் அவ்வாறு செய்யும்படி கேட்கலாம்.
tr: Başka bir katılımcı değişikliklerinizi gözden geçirecek ve iyi ise bunları belgelerle birleştirecektir. Ayrıca bunlar birleştirmeden önce kendileri değişiklik yapabilir veya sizden bir değişiklik yapmanızı isteyebilirler.
uk: Інший учасник перегляне ваші зміни та об’єднає їх у документи, якщо вони прийнятні. Вони також можуть внести зміни або попросити вас зробити це перед об’єднанням.
zh_tw: 其他貢獻者會審查你的變更，若內容沒問題將會合併到文件中。審查過程中，他們也可能直接修改或請你再作調整。

source: Adding new pages
cs: Přidávání nových stránek
ga: Leathanaigh nua á gcur leis
it: Aggiungere nuove pagine
ko: 새 페이지 추가하기
ta: புதிய பக்கங்களைச் சேர்ப்பது
tr: Yeni sayfalar ekleme
uk: Додавання нових сторінок
zh_tw: 新增頁面

source: Before adding a new page, please ensure that it fits in the documentation:
ga: Sula gcuireann tú leathanach nua leis, cinntigh le do thoil go n-oireann sé sna doiciméid:
it: Prima di aggiungere una nuova pagina, assicurarsi che sia compatibile con la documentazione esistente:
ta: புதிய பக்கத்தைச் சேர்ப்பதற்கு முன், இது ஆவணங்களில் பொருந்துகிறது என்பதை உறுதிப்படுத்தவும்:
tr: Yeni bir sayfa eklemeden önce, lütfen sayfanın belgelere uygun olduğundan emin olun:
uk: Перш ніж додавати нову сторінку, переконайтеся, що вона відповідає документації:
zh_tw: 新增頁面前，請先確認內容適合現有說明文件：

source: Look for `existing issues <https://github.com/godotengine/godot-docs/issues>`_ or open a new one to see if the page is necessary.
ga: Cuardaigh `ceisteanna reatha <https://github.com/godotengine/godot-docs/issues>`_ nó oscail ceann nua féachaint an bhfuil gá leis an leathanach.
it: Cercare `problemi esistenti <https://github.com/godotengine/godot-docs/issues>`_ oppure aprirne uno nuovo per vedere se la pagina è necessaria.
ta: `இருக்கும் சிக்கல்களைத் தேடுங்கள் <https://github.com/godotengine/godot-docs/issues>` _ அல்லது பக்கம் அவசியமா என்பதைப் பார்க்க புதிய ஒன்றைத் திறக்கவும்.
tr: Sayfanın gerekli olup olmadığını görmek için `mevcut sorunları <https://github.com/godotengine/godot-docs/issues>`_ arayın veya yeni bir tane sorun açın.
uk: Знайдіть `існуючі проблеми <https://github.com/godotengine/godot-docs/issues>`_ або відкрийте нову, щоб перевірити, чи потрібна сторінка.
zh_tw: 請先搜尋 `現有議題 <https://github.com/godotengine/godot-docs/issues>`_，或提出新議題，以確認該頁面是否有其必要性。

source: Ensure there isn't a page that already covers the topic.
ga: Cinntigh nach bhfuil leathanach ann a chlúdaíonn an topaic cheana féin.
it: Assicurarsi che non ci sia già una pagina che tratta l'argomento.
ta: ஏற்கனவே தலைப்பை உள்ளடக்கிய ஒரு பக்கம் இல்லை என்பதை உறுதிப்படுத்தவும்.
tr: Konuyu zaten kapsayan bir sayfanın var olmadığından emin olun.
uk: Переконайтеся, що немає сторінки, яка б уже охоплювала цю тему.
zh_tw: 確定沒有其他頁面已涵蓋此主題。

source: Read our :ref:`doc_content_guidelines`.
ga: Léigh ár :ref:'doc_content_guidelines'.
it: Leggere le nostre :ref:`doc_content_guidelines`.
ko: :ref:`doc_content_guidelines`\ 을 읽으세요.
ta: எங்கள்: ref: `doc_content_guidleins`.
tr: :ref:`doc_content_guidelines` sayfamızı okuyun.
uk: Прочитайте наші :ref:`doc_content_guidelines`.
zh_tw: 請先閱讀 :ref:`doc_content_guidelines`。

source: To add a new page, create a ``.rst`` file with a meaningful name in the section you want to add a file to, e.g. ``tutorials/3d/light_baking.rst``.
ga: Chun leathanach nua a chur leis, cruthaigh comhad ''.rst'' le hainm bríoch sa rannán ar mian leat comhad a chur leis, e.g. ''tutorials/3d/light_baking.rst''.
it: Per aggiungere una nuova pagina, creare un file ``.rst`` con un nome significativo nella sezione a cui si vuole aggiungere il file, ad esempio ``tutorials/3d/light_baking.rst``.
ta: ஒரு புதிய பக்கத்தைச் சேர்க்க, நீங்கள் ஒரு கோப்பைச் சேர்க்க விரும்பும் பிரிவில் ஒரு அர்த்தமுள்ள பெயருடன் `` .rst`` கோப்பை உருவாக்கவும், எ.கா. `` டுடோரியல்கள்/3D/light_baking.rst``.
tr: Yeni bir sayfa eklemek için, dosya eklemek istediğiniz bölümde anlamlı bir isme sahip bir ``.rst`` dosyası oluşturun, örneğin ``tutorials/3d/light_baking.rst``.
uk: Щоб додати нову сторінку, створіть файл ``.rst`` зі змістовною назвою в розділі, до якого ви хочете додати файл, наприклад. ``tutorials/3d/light_baking.rst``.
zh_tw: 要新增頁面，請於欲新增的章節下創建具有意義名稱的 ``.rst`` 檔案，例如 ``tutorials/3d/light_baking.rst``。

source: You should then add your page to the relevant "toctree" (table of contents, e.g. ``tutorials/3d/index.rst``). Add your new filename to the list on a new line, using a relative path and no extension, e.g. here ``light_baking``.
ga: Ba chóir duit ansin do leathanach a chur leis an "toctree" ábhartha (clár ábhair, e.g. ''tutorials/3d/index.rst''). Cuir d'ainm comhaid nua leis an liosta ar líne nua, ag baint úsáide as cosán coibhneasta agus gan síneadh, e.g. anseo ''light_baking''.
it: Si dovrebbe quindi aggiungere la propria pagina al "toctree" pertinente (tabella di contenuti, ad esempio ``tutorials/3d/index.rst``). Aggiungere il nuovo nome file all'elenco su una nuova riga, utilizzando un percorso relativo e nessuna estensione, ad esempio in questo caso ``light_baking``.
ta: உங்கள் பக்கத்தை தொடர்புடைய "டோக்ட்ரீ" (உள்ளடக்க அட்டவணை, எ.கா. `` டுடோரியல்கள்/3D/index.rst``) இல் சேர்க்க வேண்டும். உங்கள் புதிய கோப்பு பெயரை ஒரு புதிய வரியில் பட்டியலில் சேர்க்கவும், உறவினர் பாதை மற்றும் நீட்டிப்பு இல்லை, எ.கா. இங்கே `` லைட்_பக்கிங்``.
tr: Daha sonra sayfanızı ilgili "toctree" 'ye (içindekiler tablosu, örneğin ``tutorials/3d/index.rst``) eklemelisiniz. Yeni dosya adınızı listeye, göreceli bir yol kullanarak ve uzantı olmadan yeni bir satırda ekleyin, örneğin burada ``light_baking``.
uk: Потім вам слід додати свою сторінку до відповідного "toctree" (змісту, наприклад ``tutorials/3d/index.rst``). Додайте нову назву файлу до списку в новому рядку, використовуючи відносний шлях і без розширення, напр. тут ``light_baking``.
zh_tw: 接著，請將你的頁面加入對應的「toctree」（目錄，例如 ``tutorials/3d/index.rst``）。於目錄中以相對路徑（不加副檔名）新增一行，如 ``light_baking``。

source: Titles
ga: Teidil
it: Titoli
ko: 제목
ru: Заголовки
ta: தலைப்புகள்
tr: Başlıklar
uk: <b>Заголовки</b>
zh_tw: 標題

source: Always begin pages with their title and a Sphinx reference name:
ga: Tosaigh leathanaigh i gcónaí lena dteideal agus ainm tagartha Sphinx:
it: Cominciare sempre le pagine con il titolo e un nome di riferimento per Sphinx:
ru: Всегда начинайте файл с имени-ссылки для Sphinx и заголовка страницы:
ta: எப்போதும் அவற்றின் தலைப்பு மற்றும் ஒரு சூரரிமாச்சிலை குறிப்பு பெயருடன் பக்கங்களைத் தொடங்குங்கள்:
tr: Sayfalara her zaman bir başlık ve Sphinx başvuru adı ile başlayın:
uk: Завжди починайте сторінки з заголовка та посилання на Sphinx:
zh_tw: 頁面開頭應包含標題與 Sphinx 參照名稱：

source: The reference ``_doc_insert_your_title_here`` and the title should match.
ga: Ba chóir go mbeadh an tagairt ''_doc_insert_your_title_here'' agus an teideal comhoiriúnach.
it: Il riferimento ``_doc_insert_your_title_here`` e il titolo devono corrispondere.
ta: குறிப்பு `` _DOC_INSERT_YOUR_TITLE_HERE`` மற்றும் தலைப்பு பொருந்த வேண்டும்.
tr: ``_doc_insert_your_title_here`` başvurusu ve başlığın kendisi eşleşmelidir.
uk: Посилання ``_doc_insert_your_title_here`` і назва мають збігатися.
zh_tw: 參照名稱 ``_doc_insert_your_title_here`` 必須與標題相對應。

source: The reference allows linking to this page using the ``:ref:`` format, e.g. ``:ref:`doc_insert_your_title_here``` would link to the above example page (note the lack of leading underscore in the reference).
ga: Ceadaíonn an tagairt nascadh leis an leathanach seo ag baint úsáide as an bhformáid '':ref:'', e.g. nascfadh '':ref:'doc_insert_your_title_here''' leis an leathanach samplach thuas (tabhair faoi deara an easpa béime tosaigh sa tagairt).
ru: Первая строка позволяет инструменту Sphinx ссылаться на эту страницу в формате ``:ref:`` format, e.g. ``:ref:`doc_insert_your_title_here``` будет ссылаться на приведённую выше страницу (обратите внимание на отсутствие начального подчёркивания в ссылке).
ta: குறிப்பு ``: ref: `` வடிவமைப்பு, எ.கா. ``: ref: `doc_insert_your_title_here``` மேலே உள்ள எடுத்துக்காட்டு பக்கத்துடன் இணைக்கும் (குறிப்பில் முன்னணி அடிக்கோடிட்டுக் காட்டாததைக் கவனியுங்கள்).
tr: Bu başvuru, ``:ref:`` biçimleyicisi kullanarak bu sayfaya bağlantı verilmesini sağlar, örneğin ``:ref:`doc_insert_your_title_here``` yukarıdaki örnek sayfaya bağlantı verir (başvuru isminin başındaki alt çizginin burada olmadığına dikkat edin).
uk: Посилання дозволяє посилатися на цю сторінку за допомогою ``:ref:`` format, e.g. ``:ref:`doc_insert_your_title_here``` буде посилатися на наведену вище сторінку прикладу (зверніть увагу на відсутність початкового підкреслення в посиланні).
zh_tw: 參照名稱可以用 ``:ref:`` 格式連結到此頁面，例如 ``:ref:`doc_insert_your_title_here``` 會連結到上述範例頁面（注意參照時不需加開頭底線）。

source: Write your titles like plain sentences, without capitalizing each word:
ga: Scríobh do theidil cosúil le habairtí simplí, gan leas a bhaint as gach focal:
it: Scrivere i titoli come frasi semplici, senza mettere in maiuscolo ogni parola:
ta: ஒவ்வொரு வார்த்தையையும் மூலதனமாக்காமல், உங்கள் தலைப்புகளை எளிய வாக்கியங்கள் போன்ற எழுதுங்கள்:
tr: Başlıklarınızı düz cümleler gibi, kelimeleri büyük harf kullanmadan yazın:
uk: Напишіть заголовки як прості речення, не пишучи кожне слово з великої літери:
zh_tw: 標題請以一般句子形式書寫，不要每個字都大寫：

source: **Good:** Understanding signals in Godot
cs: **Dobrý:** Pochopení signálů v Godotovi
ga: **Go maith:** Comharthaí a thuiscint i Godot
it: **Buono:** Comprendere i segnali in Godot
ko: **좋음:** Understanding signals in Godot
ru: **Хорошо:** Understanding signals in Godot
ta: ** நல்லது: ** கோடோட்டில் சமிக்ஞைகளைப் புரிந்துகொள்வது
tr: **İyi:** Understanding signals in Godot
uk: Напишіть заголовки як прості речення, не пишучи кожне слово з великої літери
zh_tw: 範例（佳）：Understanding signals in Godot

source: **Bad:** Understanding Signals In Godot
ga: **Droch:** Comharthaí a Thuiscint I Godot
it: **Sbagliato:** Comprendere I Segnali In Godot
ko: **나쁨:** Understanding Signals In Godot
ru: **Плохо:** Understanding Signals In Godot
ta: ** மோசமானது: ** கோடோட்டில் சமிக்ஞைகளைப் புரிந்துகொள்வது
tr: **Kötü:** Understanding Signals In Godot
uk: **Погано:** Розуміння сигналів у Годо
zh_tw: 範例（不佳）：Understanding Signals In Godot

source: Only proper nouns, projects, people, and node class names should have their first letter capitalized.
ga: Níor chóir ach ainmfhocail chearta, tionscadail, daoine, agus ainmneacha ranga nód a gcéad litir a chaipitliú.
it: Solo i nomi propri, i progetti, le persone e i nomi delle classi di nodi devono avere la prima lettera maiuscola.
ta: சரியான பெயர்ச்சொற்கள், திட்டங்கள், மக்கள் மற்றும் முனை வகுப்பு பெயர்கள் மட்டுமே அவற்றின் முதல் கடிதத்தை மூலதனமாக்க வேண்டும்.
tr: Yalnızca özel isimler, projeler, kişiler ve düğüm sınıf adlarının ilk harfi büyük olmalıdır.
uk: Лише власні іменники, проекти, люди та назви класів вузлів повинні мати першу літеру з великої літери.
zh_tw: 僅有專有名詞、專案、人名與節點類別名稱才需首字大寫。

source: Sphinx and reStructuredText syntax
ga: Comhréir Sphinx agus reStructuredText
it: Sintassi di Sphinx e reStructuredText
ta: சூரரிமாச்சிலை மற்றும் மறுசீரமைப்பு டெக்ச்ட் தொடரியல்
tr: Sphinx ve reStructuredText sözdizimi
uk: Синтаксис Sphinx і reStructuredText
zh_tw: Sphinx 與 reStructuredText 語法

source: Check Sphinx's `reST Primer <https://www.sphinx-doc.org/en/stable/rest.html>`__ and the `official reference <https://docutils.sourceforge.net/rst.html>`__ for details on the syntax.
ga: Seiceáil `reST Primer <https://www.sphinx-doc.org/en/stable/rest.html>`__ agus an `tagairt oifigiúil <https://docutils.sourceforge.net/rst.html>`__ le haghaidh sonraí ar an chomhréir.
it: Consultare `reST Primer <https://www.sphinx-doc.org/en/stable/rest.html>`__ di Sphinx e il `riferimento ufficiale <https://docutils.sourceforge.net/rst.html>`__ per i dettagli sulla sintassi.
ta: சூரரிமாச்சிலை இன் `ஓய்வு ப்ரைமர் <https://www.sphinx-doc.org/en/stable/rest.html> __ மற்றும்` அதிகாரப்பூர்வ குறிப்பு <https://docutils.sourceforge.net/rst.html> `____ தொடரியல் பற்றிய விவரங்களுக்கு.
tr: Sözdizimiyle ilgili ayrıntılar için Sphinx'in `reST Primer <https://www.sphinx-doc.org/en/stable/rest.html>`__ ve `resmi başvuru <https://docutils.sourceforge.net/rst.html>`__ bölümlerine bakın.
uk: Перегляньте `reST Primer Sphinx <https://www.sphinx-doc.org/en/stable/rest.html>`__ та `офіційне посилання <https://docutils.sourceforge.net/rst.html>`__ для детальної інформації про синтаксис.
zh_tw: 語法詳情請參考 Sphinx 的 `reST Primer <https://www.sphinx-doc.org/en/stable/rest.html>`__ 與`官方參考手冊 <https://docutils.sourceforge.net/rst.html>`__。

source: Sphinx uses specific reST comments to do specific operations, like defining the table of contents (``.. toctree::``) or cross-referencing pages. Check the `official Sphinx documentation <https://www.sphinx-doc.org/en/stable/index.html>`__ for more details. To learn how to use Sphinx directives like ``.. note::`` or ``.. seealso::``, check out the `Sphinx directives documentation <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__.
ga: Úsáideann Sphinx tráchtanna sonracha ReST chun oibríochtaí sonracha a dhéanamh, cosúil le sainiú an chláir ábhar (``.. toctree::``) nó leathanaigh chros-tagartha. Seiceáil an doiciméadú oifigiúil an Sphinx <https://www.sphinx-doc.org/en/stable/index.html>`__ le haghaidh tuilleadh sonraí. Chun foghlaim conas treoracha Sphinx a úsáid cosúil le `` .. nóta::`` nó ``.. seealso::``, féach ar an doiciméadú `Treoracha Sphinx <https://www.sphinx-doc.org/en/ master/use/restructuredtext/directives.html>`__.
it: Sphinx utilizza commenti reST specifici per effettuare operazioni specifiche, come la definizione della tabella dei contenuti (``.. toctree::``) o il riferimento incrociato alle pagine. Consultare la `documentazione ufficiale di Sphinx <https://www.sphinx-doc.org/en/stable/index.html>`__ per ulteriori dettagli. Per imparare a utilizzare le direttive di Sphinx come ``.. note::`` o ``.. seealso::``, consultare la `documentazione sulle direttive di Sphinx <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__.
ru: Sphinx использует специальные комментарии reST для выполнения определённых операций, таких как определение оглавления (``.. toctree::``) или создание перекрёстных ссылок на страницы. Подробнее см. в `официальной документации Sphinx <https://www.sphinx-doc.org/en/stable/index.html>`__. Чтобы узнать, как использовать директивы Sphinx, такие как ``.. note::`` или ``.. seealso::``, ознакомьтесь с `документацией по директивам Sphinx <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__.
ta: உள்ளடக்க அட்டவணையை வரையறுப்பது (`` .. toctree :: ``) அல்லது குறுக்கு-குறிப்பு பக்கங்கள் போன்ற குறிப்பிட்ட செயல்பாடுகளைச் செய்ய சூரரிமாச்சிலை குறிப்பிட்ட ஓய்வு கருத்துகளைப் பயன்படுத்துகிறது. மேலும் விவரங்களுக்கு `அதிகாரப்பூர்வ சூரரிமாச்சிலை ஆவணங்களை <https://www.sphinx-doc.org/en/stable/index.html> __ __. `` .. குறிப்பு :: `` அல்லது `` .. சீல்சோ :: `` போன்ற சூரரிமாச்சிலை வழிமுறைகளை எவ்வாறு பயன்படுத்துவது என்பதை அறிய, `ச்பிங்க்ச் டைரெக்டிவ் ஆவணங்களை பாருங்கள் <https://www.sphinx-doc.org/en/ மாச்டர்/பயன்பாடு/மறுசீரமைப்பு டெக்ச்ட்/டைரெக்டிவ்ச்.எச்.டி.எம்.எல்> ____.
tr: Sphinx, içindekiler tablosunu tanımlamak (``.. toctree::``) veya sayfaları çapraz referanslamak gibi belirli işlemleri yapmak için belirli reST yorumlarını kullanır. Daha fazla ayrıntı için `resmi Sphinx belgelerine <https://www.sphinx-doc.org/en/stable/index.html>`__ göz atın. ``.. note::`` veya ``.. seealso::`` gibi Sphinx yönergelerinin nasıl kullanılacağını öğrenmek için `Sphinx yönergeleri belgelerine <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__ göz atın.
uk: Sphinx використовує спеціальні коментарі reST для виконання певних операцій, як-от визначення змісту (``.. toctree::``) або перехресних посилань на сторінки. Щоб дізнатися більше, перегляньте `офіційну документацію Sphinx <https://www.sphinx-doc.org/en/stable/index.html>`__. Щоб дізнатися, як використовувати директиви Sphinx, такі як ``.. note::`` або ``.. seealso::``, перегляньте `документацію щодо директив Sphinx <https://www.sphinx-doc.org/en/ master/usage/restructuredtext/directives.html>`__.
zh_tw: Sphinx 會使用特殊的 reST 標記來執行特定操作，例如定義目錄（``.. toctree::``）或交叉連結頁面。詳細說明請參考 `Sphinx 官方文件 <https://www.sphinx-doc.org/en/stable/index.html>`__。如需學習 ``.. note::``、``.. seealso::`` 等指令的用法，請參閱 `Sphinx 指令說明 <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__。

source: Adding images and attachments
ga: Íomhánna agus ceangaltáin a chur leis
it: Aggiungere immagini e allegati
ko: 이미지와 첨부 추가하기
ta: படங்கள் மற்றும் இணைப்புகளைச் சேர்ப்பது
tr: Resimler ve ek dosyalar ekleme
uk: Додавання зображень і вкладень
zh_tw: 新增圖片與附件

source: To add images, please put them in an ``img/`` folder next to the ``.rst`` file with a meaningful name and include them in your page with:
ga: Chun íomhánna a chur leis, cuir i bhfillteán ''img/'' iad in aice leis an gcomhad ''.rst'' le hainm bríoch agus cuir san áireamh iad i do leathanach le:
it: Per aggiungere immagini, inserirle nella cartella ``img/`` accanto al file ``.rst`` con un nome significativo e includerle nella propria pagina con:
ta: படங்களைச் சேர்க்க, தயவுசெய்து அவற்றை `` `.rst`` கோப்புக்கு அடுத்த` `img/` `கோப்புறையில் ஒரு அர்த்தமுள்ள பெயருடன் வைத்து அவற்றை உங்கள் பக்கத்தில் சேர்க்கவும்:
tr: Resim eklemek için, lütfen bunları ``.rst`` dosyasının yanındaki ``img/`` klasörüne anlamlı bir isim vererek yerleştirin ve sayfanıza dahil edin:
uk: Щоб додати зображення, помістіть їх у папку ``img/`` поруч із файлом ``.rst`` зі змістовною назвою та додайте їх на свою сторінку за допомогою:
zh_tw: 要新增圖片，請將圖檔存放於 ``.rst`` 檔旁的 ``img/`` 目錄，並使用有意義的檔名，再於頁面中這樣引用：

source: Alternatively, you can use the `figure` directive, which gives the image a contrasting border and allows centering it on the page.
ga: De rogha air sin, is féidir leat an treoir 'figiúr' a úsáid, a thugann teorainn chodarsnachta don íomhá agus a cheadaíonn í a lárú ar an leathanach.
it: In alternativa, è possibile utilizzare la direttiva `figure`, che fornisce all'immagine un bordo contrastante e consente di centrarla sulla pagina.
ta: மாற்றாக, நீங்கள் `படம்` உத்தரவைப் பயன்படுத்தலாம், இது படத்திற்கு மாறுபட்ட எல்லையை அளிக்கிறது மற்றும் அதை பக்கத்தில் மையப்படுத்த அனுமதிக்கிறது.
tr: Alternatif olarak, görüntüye kontrast bir kenarlık veren ve sayfada ortalanmasını sağlayan `figure` yönergesini kullanabilirsiniz.
uk: Крім того, ви можете використовувати директиву `figure`, яка надає зображенню контрастну рамку та дозволяє розмістити його по центру сторінки.
zh_tw: 另外，你也可以使用 `figure` 指令，讓圖片有明顯邊框並可置中顯示。

source: You can also include attachments as support material for a tutorial, by placing them into a ``files/`` folder next to the ``.rst`` file, and using this inline markup:
ga: Is féidir ceangaltáin a chur san áireamh freisin mar ábhar tacaíochta do rang teagaisc, trí iad a chur isteach i bhfillteán ''files/'' in aice leis an gcomhad ''.rst'', agus an marc inlíne seo a úsáid:
it: È anche possibile includere allegati come materiale di supporto per un tutorial, inserendoli nella cartella ``files/`` accanto al file ``.rst`` e utilizzando questo markup in riga:
ta: இணைப்புகளை ஒரு டுடோரியலுக்கான ஆதரவுப் பொருளாகவும், அவற்றை `` கோப்புகள்/`` கோப்புக்கு அடுத்ததாக வைப்பதன் மூலமும், இந்த இன்லைன் மார்க்அப்பைப் பயன்படுத்துவதன் மூலமும் நீங்கள் சேர்க்கலாம்:
tr: Bir öğretici için destek materyali olacak ekleri, ``.rst`` dosyasının yanındaki ``files/`` klasörüne yerleştirerek ve aşağıdaki satır içi işaretlemeyi kullanarak ekleyebilirsiniz:
uk: Ви також можете додати вкладення як допоміжний матеріал для підручника, розмістивши їх у папці ``files/`` поруч із ``.rst`` файлом і використовуючи цю вбудовану розмітку:
zh_tw: 你也可以提供附件作為教學輔助素材，將其放在 ``.rst`` 檔旁的 ``files/`` 資料夾，並透過以下方式引用：
