Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/contributing_to_the_documentation.po
Languages: cs, ga, it, ko, ru, ta, tr, uk, zh_tw

source: Consider using the `godot-docs-project-starters <https://github.com/godotengine/godot-docs-project-starters>` repository for hosting support materials, such as project templates and asset packs. You can use a direct link to the generated archive from that repository with the regular link markup:
ga: Smaoinigh ar stór `godot-docs-project-starters <https://github.com/godotengine/godot-docs-project-starters>` a úsáid chun ábhar tacaíochta a óstáil, mar shampla teimpléid tionscadail agus pacáistí sócmhainní. Is féidir leat nasc díreach a úsáid leis an gcartlann ginte ón stór sin leis an ngnáthmharcáil naisc:
it: Si consiglia di utilizzare il repository `godot-docs-project-starters <https://github.com/godotengine/godot-docs-project-starters>` per ospitare materiali di supporto, come modelli di progetto e pacchetti di contenuti. Si può utilizzare un collegamento diretto all'archivio generato da quel repository con il normale markup di collegamento:
ta: திட்ட வார்ப்புருக்கள் மற்றும் சொத்து பொதிகள் போன்ற உதவி பொருட்களை புரவலன் செய்வதற்கான களஞ்சியத்திற்கான `கோடோட்-டாக்ச்-ப்ரொசெக்ட்-ச்டாண்டர்கள் <https://github.com/godotengine/godotengin-project-darters>` களஞ்சியத்தைப் பயன்படுத்துவதைக் கவனியுங்கள். வழக்கமான இணைப்பு மார்க்அப்புடன் அந்த களஞ்சியத்திலிருந்து உருவாக்கப்பட்ட காப்பகத்திற்கு நேரடி இணைப்பைப் பயன்படுத்தலாம்:
tr: Proje şablonları ve varlık paketleri gibi destek materyallerini barındırmak için `godot-docs-project-starters <https://github.com/godotengine/godot-docs-project-starters>` deposunu kullanmayı düşünün. Normal bağlantı işaretlemesi ile bu depodan oluşturulan arşive doğrudan bir bağlantı kullanabilirsiniz:
uk: Розгляньте можливість використання репозиторію `godot-docs-project-starters <https://github.com/godotengine/godot-docs-project-starters>` для розміщення допоміжних матеріалів, таких як шаблони проектів і пакети ресурсів. Ви можете використовувати пряме посилання на створений архів із цього сховища за допомогою звичайної розмітки посилань:
zh_tw: 建議將專案範本或素材包等支援檔案託管於 `godot-docs-project-starters <https://github.com/godotengine/godot-docs-project-starters>` 儲存庫。你可直接用一般連結標記，連到該儲存庫產生的壓縮檔：

source: License
cs: Licence
ga: Ceadúnas
it: Licenza
ko: 라이선스
ru: Лицензия
ta: உரிமம்
tr: Lisanslama
uk: Ліцензія
zh_tw: 授權條款

source: This documentation and every page it contains is published under the terms of the `Creative Commons Attribution 3.0 license (CC BY 3.0) <https://creativecommons.org/licenses/by/3.0/>`_, with attribution to "Juan Linietsky, Ariel Manzur and the Godot community".
ga: Foilsítear an cháipéisíocht seo agus gach leathanach atá inti faoi théarmaí an cheadúnais `Creative Commons Attribution 3.0 (CC BY 3.0) <https://creativecommons.org/licenses/by/3.0/>`_, le cur i leith "Juan Linietsky , Ariel Manzur agus an pobal Godot".
it: Questa documentazione e ogni pagina in essa contenuta è pubblicata sotto i termini della licenza `Creative Commons Attribution 3.0 (CC-BY-3.0) <https://creativecommons.org/licenses/by/3.0/>`_, con attribuzione a "Juan Linietsky, Ariel Manzur e la comunità Godot".
ru: Настоящая документация и каждая содержащаяся в ней страница публикуются в соответствии с условиями `лицензии Creative Commons Attribution 3.0 (CC BY 3.0) <https://creativecommons.org/licenses/by/3.0/>`_, с указанием автора "Juan Linietsky, Ariel Manzur and the Godot community".
ta: இந்த ஆவணமும், அதில் உள்ள ஒவ்வொரு பக்கமும் `கிரியேட்டிவ் காமன்ச் பண்புக்கூறு 3.0 உரிமம் (சிசி ஆல் 3.0) <https://creativecommons.org/licenses/by/3.0/>` _, , ஏரியல் மன்சூர் மற்றும் கோடோட் சமூகம் ".
tr: Bu belgeler ve içerdiği her sayfa `Creative Commons Attribution 3.0 lisansı (CC BY 3.0)<https://creativecommons.org/licenses/by/3.0/>`_ koşulları altında, "Juan Linietsky, Ariel Manzur and the Godot community" adına atıfta bulunularak yayınlanmıştır.
uk: Ця документація та кожна сторінка, що в ній міститься, опубліковані згідно з умовами ліцензії `«Creative Commons Attribution 3.0 (CC BY 3.0) <https://creativecommons.org/licenses/by/3.0/>`_ із посиланням на «Juan Linietsky». , Аріель Манзур і спільнота Годо».
zh_tw: 本說明文件及其所有頁面均以 `創用 CC 姓名標示 3.0 授權（CC BY 3.0） <https://creativecommons.org/licenses/by/3.0/>`_ 發布，並請標註作者為「Juan Linietsky, Ariel Manzur and the Godot community」。

source: By contributing to the documentation on the GitHub repository, you agree that your changes are distributed under this license.
ga: Trí rannchuidiú leis na doiciméid ar stór GitHub, aontaíonn tú go ndáiltear do chuid athruithe faoin gceadúnas seo.
it: Contribuendo alla documentazione sul repository di GitHub, si accetta che le proprie modifiche siano distribuite sotto questa licenza.
ru: Внося свой вклад в документацию через GitHub репозиторий, вы соглашаетесь с тем, что ваши изменения распространяются в соответствии с настоящей лицензией.
ta: அறிவிலிமையம் களஞ்சியத்தின் ஆவணங்களுக்கு பங்களிப்பதன் மூலம், உங்கள் மாற்றங்கள் இந்த உரிமத்தின் கீழ் விநியோகிக்கப்படுகின்றன என்பதை ஒப்புக்கொள்கிறீர்கள்.
tr: GitHub deposundaki belgelere katkıda bulunarak, yaptığınız değişikliklerin bu lisans altında dağıtılacağını kabul etmiş olursunuz.
uk: Надаючи внесок у документацію в сховищі GitHub, ви погоджуєтесь, що ваші зміни поширюються за цією ліцензією.
zh_tw: 當你在 GitHub 儲存庫貢獻說明文件時，即表示你同意這些變更將以此授權條款釋出。

source: Translation status
cs: Stav překladu
