Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/content_guidelines.po
Languages: ga, it, ja, ta, tr, uk, zh_tw

source: Content guidelines
ga: Treoirlínte áb
it: Linee guida sul contenuto
ja: コンテンツガイドライン
ta: உள்ளடக்க வழிகாட்டுதல்கள்
tr: İçerik yönergeleri
uk: Вказівки щодо змісту
zh_tw: 內容指引

source: This document outlines what should be included in the official documentation. Below, you will find a couple of principles and recommendations for writing accessible content.
ga: Tugann an doiciméad seo leagan amach cad ba chóir a bheith san áireamh sa dhoiciméadú Anseo thíos, gheobhaidh tú cúpla prionsabal agus moltaí maidir le hábhar inrochtana a scríobh.
it: Questo documento delinea cosa si dovrebbe includere nella documentazione ufficiale. Di seguito, sono riportati alcuni principi e raccomandazioni per scrivere contenuti accessibili.
ja: このドキュメントは公式ドキュメントにどのようなものが含まれるべきかを説明するものです。以下に、利用しやすい内容を書くためのいくつかの原則と推奨を示します。
ta: உத்தியோகபூர்வ ஆவணங்களில் என்ன சேர்க்கப்பட வேண்டும் என்பதை இந்த ஆவணம் கோடிட்டுக் காட்டுகிறது. கீழே, அணுகக்கூடிய உள்ளடக்கத்தை எழுதுவதற்கான இரண்டு கொள்கைகளையும் பரிந்துரைகளையும் நீங்கள் காண்பீர்கள்.
tr: Bu belge, resmi belgelere nelerin dahil edilmesi gerektiğini ana hatlarıyla belirtir. Aşağıda, erişilebilir içerik yazmak için birkaç ilke ve öneri bulacaksınız.
uk: У цьому документі вказано, що має входити до офіційної документації. Нижче ви знайдете кілька принципів і рекомендацій щодо написання доступного вмісту.
zh_tw: 本文件說明官方說明文件應包含哪些內容。以下列出幾項原則與建議，幫助撰寫易於理解的內容。

source: We want to achieve two goals:
ga: Ba mhaith linn dhá sprioc a bhaint amach:
it: Vogliamo raggiungere due obiettivi:
ja: 達成したい目標は2つあります:
ta: நாங்கள் இரண்டு இலக்குகளை அடைய விரும்புகிறோம்:
tr: İki hedefe ulaşmak istiyoruz:
uk: Ми хочемо досягти двох цілей:
zh_tw: 我們希望達成兩個目標：

source: **Empathize with our users.** We should write in a way that makes it easy for them to learn from the docs.
ga: **Ionbhá a dhéanamh lenár n-úsáideoirí. ** Ba chóir dúinn scríobh ar bhealach a fhágann go bhfuil sé éasca dóibh foghlaim ó na doiciméid.
it: **Mostra empatia con i nostri utenti.** Dovremmo scrivere in un modo che renda facile per loro imparare dalla documentazione.
ja: \ ** ユーザーに共感する。 ** ユーザーがドキュメントから学ぶ時に理解しやすいように書くべきです。
ta: ** எங்கள் பயனர்களுடன் பச்சாதாபம் கொள்ளுங்கள். ** டாக்சிலிருந்து கற்றுக்கொள்வதை எளிதாக்கும் வகையில் நாம் எழுத வேண்டும்.
tr: **Kullanıcılarımızla bağ kurun ** Onların belgelerden öğrenmelerini kolaylaştıracak şekilde yazmalıyız.
uk: **Співпереживайте нашим користувачам.** Ми повинні писати так, щоб їм було легко вчитися з документів.
zh_tw: **設身處地為使用者著想。** 我們應以讓使用者能輕鬆從文件中學習的方式來撰寫內容。

source: **Write a complete reference manual**. Our goal here is not to teach programming fundamentals. Instead, our goal is to provide a reference for how Godot's features work.
ga: **Scríobh lámhleabhar tagartha iomlán**. Ní hé ár sprioc anseo buneilimintí cláir a mhúineadh. Ina áit sin, is é ár gcuspóir tagairt a sholáthar don chaoi a n-oibríonn gnéithe Godot.
it: **Scrivere un manuale di riferimento completo**. Il nostro obiettivo qui non è insegnare i fondamenti della programmazione. Piuttosto, il nostro obiettivo è fornire un riferimento su come funzionano le funzionalità di Godot.
ja: \ ** 完全なリファレンスマニュアルを書く ** 。この目標はプログラミングの基礎を教えることではありません。その代わりに、Godotの機能がどう作用するかのリファレンスを提供することが目標です。
ta: ** ஒரு முழுமையான குறிப்பு கையேட்டை எழுதுங்கள் **. இங்கே எங்கள் குறிக்கோள் நிரலாக்க அடிப்படைகளை கற்பிப்பதல்ல. அதற்கு பதிலாக, கோடோட்டின் நற்பொருத்தங்கள் எவ்வாறு செயல்படுகின்றன என்பதற்கான குறிப்பை வழங்குவதே எங்கள் குறிக்கோள்.
tr: **Eksiksiz bir başvuru kılavuzu yazın**. Buradaki amacımız programlama temellerini öğretmek değil. Bunun yerine, amacımız Godot'nun özelliklerinin nasıl çalıştığına dair bir başvuru sağlamaktır.
uk: **Напишіть повний довідковий посібник**. Наша мета тут не в тому, щоб навчити основам програмування. Натомість наша мета — надати довідку про те, як працюють функції Godot.
zh_tw: **編寫完整的參考手冊** 。 我們的目標不是教授程式設計基礎，而是提供 Godot 功能運作方式的參考資料。

source: Guidelines and principles
ga: Treoir agus prionsabail
it: Linee guida e principi
ja: ガイドラインと原則
ta: வழிகாட்டுதல்கள் மற்றும் கொள்கைகள்
tr: Yönergeler ve prensipler
uk: Настанови та принципи
zh_tw: 指引與原則

source: Below are the guidelines we should strive to follow. They are not hard rules, though: sometimes, a topic will require breaking one or more of them. Still, we should strive to achieve the two goals listed above.
ga: Seo thíos na treoirlínte ba cheart dúinn iarracht a dhéanamh a Ní rialacha crua iad, áfach: uaireanta, beidh gá le hábhar ceann amháin nó níos mó acu a bhriseadh. Fós féin, ba cheart dúinn iarracht a dhéanamh an dá sprioc atá liostaithe thuas a bhaint amach.
it: Di seguito sono riportate le linee guida che dovremmo cercare di seguire. Non si tratta di regole rigide, però: a volte, un argomento richiederà di infrangerne una o più. Ad ogni modo, dovremmo impegnarci a realizzare i due obiettivi elencati in precedenza.
ja: 以下は私たちが守るべきガイドラインです。とはいえ、これらは厳密なルールではなく、トピックによっては1つ以上を破らなければならないこともあります。それでも、私たちは上記の2つの目標を達成するために努力しなければなりません。
ta: நாம் பின்பற்ற முயற்சிக்க வேண்டிய வழிகாட்டுதல்கள் கீழே உள்ளன. இருப்பினும் அவை கடினமான விதிகள் அல்ல: சில நேரங்களில், ஒரு தலைப்பில் அவற்றில் ஒன்று அல்லது அதற்கு மேற்பட்டவற்றை உடைக்க வேண்டும். இருப்பினும், மேலே பட்டியலிடப்பட்ட இரண்டு இலக்குகளை அடைய நாம் முயற்சிக்க வேண்டும்.
tr: Aşağıda uymaya çalışmamız gereken yönergeler yer almaktadır. Ancak bunlar katı kurallar değildir: bazen bir konu bunlardan bir veya daha fazlasının çiğnenmesini gerektirebilir. Yine de, yukarıda listelenen iki hedefe ulaşmak için çaba göstermeliyiz.
uk: Нижче наведено вказівки, яких ми повинні прагнути дотримуватися. Однак це не жорсткі правила: іноді тема потребує порушення одного чи кількох із них. Але ми повинні прагнути досягти двох перерахованих вище цілей.
zh_tw: 下列是我們應盡量遵循的指引。這些不是硬性規定：有時某些主題需要打破其中一項或多項。不過我們仍應以達成上述兩個目標為優先。

source: Writing complete and accessible documentation
ga: Doiciméadú iomlán agus inrochtana a
it: Scrivere una documentazione completa e accessibile
ja: 完全かつ利用しやすいドキュメントの記述
ta: முழுமையான மற்றும் அணுகக்கூடிய ஆவணங்களை எழுதுதல்
tr: Eksiksiz ve erişilebilir belgeler yazma
uk: Написання повної та доступної документації
zh_tw: 撰寫完整且易於理解的說明文件

source: **A feature doesn't exist unless it is documented**. If a user can't find information about a feature and how it works, it doesn't exist to them. We should ensure that we cover everything Godot does.
ga: ** Níl gné ann mura ndéantar í a dhoiciméadú**. Mura féidir le húsáideoir faisnéis a fháil faoi ghné agus conas a oibríonn sé, níl sé ann dóibh. Ba cheart dúinn a chinntiú go gclúdaímid gach rud a dhéanann Godot.
it: **Una funzionalità non esiste se non è documentata**. Se un utente non riesce a trovare informazioni su una funzionalità e sul suo funzionamento, per lui non esiste. Dobbiamo assicurarci di trattare tutto ciò che fa Godot.
ja: ** ドキュメントが書かれない限り機能は存在しません ** 。ユーザーがある機能や動作についての情報を見つけられないなら、それらは存在しません。私たちはGodotが行うすべての事を網羅することを保証しなければなりません。
ta: ** ஒரு நற்பொருத்தம் ஆவணப்படுத்தப்படாவிட்டால் அது இல்லை **. ஒரு பயனருக்கு ஒரு நற்பொருத்தம் மற்றும் அது எவ்வாறு செயல்படுகிறது என்பது பற்றிய தகவல்களைக் கண்டுபிடிக்க முடியாவிட்டால், அது அவர்களுக்கு இல்லை. கோடோட் செய்யும் அனைத்தையும் நாம் மறைப்பதை உறுதி செய்ய வேண்டும்.
tr: **Belgelenmediği sürece bir özellik mevcut değildir**. Bir kullanıcı bir özellik ve onun nasıl çalıştığı hakkında bilgi bulamıyorsa, o özellik onun için mevcut değildir. Godot'nun yaptığı her şeyi kapsadığımızdan emin olmalıyız.
uk: **Функція не існує, якщо вона не задокументована**. Якщо користувач не може знайти інформацію про функцію та як вона працює, для нього вона не існує. Ми повинні переконатися, що ми висвітлюємо все, що робить Godot.
zh_tw: **沒有文件就等於沒有這個功能** 。如果使用者找不到某功能的說明與用法，這項功能對他們來說就不存在。我們應該確保所有 Godot 功能皆有覆蓋。

source: When adding or updating an engine feature, the documentation team needs to know about it. Contributors should open an issue on the `godot-docs` repository when their work gets merged and requires documentation.
ga: Agus gné innill á cur leis nó á nuashonrú, ní mór don fhoireann doiciméadaithe a bheith ar an eolas faoi. Ba cheart do rannpháirtithe saincheist a oscailt ar an stór `godot-docs` nuair a dhéantar a gcuid oibre a chumasc agus nuair a bhíonn doiciméadú ag teastáil.
it: Quando si aggiunge o si aggiorna una funzionalità del motore, il team di documentazione deve esserne a conoscenza. I collaboratori dovrebbero aprire una segnalazione sul repository `godot-docs` dopo il merge del loro lavoro e necessita di documentazione.
ja: エンジンの機能を追加したり更新したりするときは、ドキュメントチームがそれを知る必要があります。コントリビューターは、自分の作業がマージされ、ドキュメントが必要になったら `godot-docs` リポジトリに issue をオープンしてください。
ta: ஒரு இயந்திர அம்சத்தைச் சேர்க்கும்போது அல்லது புதுப்பிக்கும்போது, ஆவணப்படுத்தல் குழு அதைப் பற்றி அறிந்து கொள்ள வேண்டும். பங்களிப்பாளர்கள் தங்கள் பணி ஒன்றிணைக்கப்பட்டு ஆவணங்கள் தேவைப்படும்போது `கோடோட்-டாக்ச்` களஞ்சியத்தில் ஒரு சிக்கலைத் திறக்க வேண்டும்.
tr: Bir motor özelliği eklendiğinde veya güncellendiğinde, belgeler ekibinin bundan haberdar olması gerekir. Katkıda bulunanlar, çalışmaları birleştirildiğinde ve belgeler gerektirdiğinde `godot-docs` deposunda bir sorun açmalıdır.
uk: Додаючи або оновлюючи функцію двигуна, команда документації повинна знати про це. Співавтори повинні відкрити проблему в репозиторії `godot-docs`, коли їхню роботу буде об’єднано та потребуватиме документації.
zh_tw: 新增或更新引擎功能時，說明文件團隊需要得知相關資訊。當你的貢獻被合併且需要文件時，請在 `godot-docs` 儲存庫建立 Issue。

source: Do your best to keep documents **under 1000 words in length**. If a page goes past that threshold, consider splitting it into two parts. Limiting page size forces us to write concisely and to break up large documents so that each page focuses on a particular problem.
ga: Déan do dhícheall doiciméid a choinneáil **faoi bhun 1000 focal**. Má théann leathanach thar an tairseach sin, smaoinigh ar é a roinnt ina dhá chuid. Má chuirtear teorainn le méid na leathanach, cuirtear iallach orainn scríobh go hachomair agus doiciméid mhóra a bhriseadh suas ionas go ndíreoidh gach leathanach ar fhadhb ar leith.
it: Fare del proprio meglio per mantenere i documenti **al di sotto delle 1000 parole**. Se una pagina supera questa soglia, considerare di dividerla in due parti. Limitare le dimensioni delle pagine ci obbliga a scrivere in modo conciso e a suddividere i grandi documenti in modo che ogni pagina si concentri su un argomento specifico.
ja: 文書の長さは **1000 ワード以内に収めるよう最善を尽くしてください ** 。ページがその閾値を超える場合は、2つに分けることを検討してください。ページ数を制限することで簡潔な文章を書かざるを得なくなりますし、大きな文書を分割して各ページがそれぞれの問題に集中できるようになります。
ta: ஆவணங்களை ** 1000 சொற்களின் கீழ் நீளமாக வைத்திருக்க உங்களால் முடிந்த அனைத்தையும் செய்யுங்கள் **. ஒரு பக்கம் அந்த வாசலைக் கடந்தால், அதை இரண்டு பகுதிகளாகப் பிரிப்பதைக் கவனியுங்கள். பக்க அளவைக் கட்டுப்படுத்துவது சுருக்கமாக எழுதவும் பெரிய ஆவணங்களை உடைக்கவும் நம்மைத் தூண்டுகிறது, இதனால் ஒவ்வொரு பக்கமும் ஒரு குறிப்பிட்ட சிக்கலில் கவனம் செலுத்துகிறது.
tr: Belgeleri **1000 kelimenin altında** tutmak için elinizden geleni yapın. Bir sayfa bu eşiği aşarsa, iki parçaya bölmeyi düşünün. Sayfa boyutunu sınırlamak bizi kısa ve öz yazmaya ve büyük belgeleri parçalara ayırmaya zorlar, böylece her sayfa belirli bir soruna odaklanır.
uk: Зробіть усе можливе, щоб зберігати документи **менше 1000 слів**. Якщо сторінка перевищує цей поріг, подумайте про розділення її на дві частини. Обмеження розміру сторінки змушує нас писати коротко та розбивати великі документи так, щоб кожна сторінка була зосереджена на певній проблемі.
zh_tw: 請盡量讓說明文件**維持在 1000 個單詞以內**。若頁面超過這個上限，請考慮拆分成多個部分。限制頁面長度可促使我們精簡寫作，並將大型文件拆解，讓每頁專注於單一問題。

source: Each page or section of a page should clearly state what **problem** it tackles and what it will teach the user. Users need to know if they're reading the correct guide for solving the problems they're encountering. For example, instead of writing the heading "Signals", consider writing "Reacting to changes with signals". The second title makes it clear what the purpose of signals is.
ga: Ba chóir go lua go soiléir ar gach leathanach nó cuid de leathanach cén **fadhban** a dhéileálann sé agus cad a mhúinfidh sé don úsáideoir. Caithfidh úsáideoirí a fháil amach an bhfuil siad ag léamh an treoir cheart chun na fadhbanna atá ag teacht orthu a réiteach. Mar shampla, in ionad an ceannteideal “Comharthaí” a scríobh, smaoinigh ar scríobh “Ag freagairt d'athruithe le comharthaí”. Déanann an dara teideal soiléir cad é cuspóir na gcomharthaí.
it: Ogni pagina o sezione di una pagina dovrebbe indicare chiaramente quale **problema** affronta e cosa insegnerà all'utente. Gli utenti devono sapere se stanno leggendo la guida corretta per risolvere i problemi che stanno riscontrando. Ad esempio, invece di scrivere il titolo "Segnali", si consideri di scrivere "Reagire ai cambiamenti con i segnali". Il secondo titolo rende lo scopo dei segnali più chiaro.
ja: 各ページやセクションには、そのページがどのような **問題** に取り組んでいるのか、ユーザーに何を教えるのかを明確に示す必要があります。ユーザーは、自分が読んでいるものが今遭遇している問題を解決するための正しいガイドかどうかを知る必要があります。例えば、 "シグナル " という見出しの代わりに、 "シグナルによる変化への反応 " と書くことを検討してください。2つ目のタイトルは、シグナルの目的が何であるかを明確にしています。
ta: ஒரு பக்கத்தின் ஒவ்வொரு பக்கமும் அல்லது பகுதியும் என்ன ** சிக்கல் ** இது சமாளிக்கிறது, அது பயனருக்கு என்ன கற்பிக்கும் என்பதை தெளிவாகக் குறிப்பிட வேண்டும். பயனர்கள் அவர்கள் சந்திக்கும் சிக்கல்களைத் தீர்ப்பதற்கான சரியான வழிகாட்டியைப் படிக்கிறார்களா என்பதை அறிந்து கொள்ள வேண்டும். எடுத்துக்காட்டாக, "சிக்னல்கள்" என்ற தலைப்பை எழுதுவதற்கு பதிலாக, "சமிக்ஞைகளுடன் மாற்றங்களுக்கு எதிர்வினையாற்றுவதை" எழுதுவதைக் கவனியுங்கள். சமிக்ஞைகளின் நோக்கம் என்ன என்பதை இரண்டாவது தலைப்பு தெளிவுபடுத்துகிறது.
tr: Her sayfa veya sayfanın her bölümü, hangi **problemi** ele aldığını ve kullanıcıya ne öğreteceğini açıkça belirtmelidir. Kullanıcıların, karşılaştıkları sorunları çözmek için doğru kılavuzu okuyup okumadıklarını bilmeleri gerekir. Örneğin, "Sinyaller" başlığı yerine "Değişikliklere sinyallerle tepki vermek" yazmayı düşünün. İkinci başlık, sinyallerin amacının ne olduğunu açıkça ortaya koyuyor.
uk: Кожна сторінка чи розділ сторінки має чітко вказувати, яку **проблему** вона вирішує та чого навчить користувача. Користувачі повинні знати, чи читають вони правильний посібник для вирішення проблем, з якими вони стикаються. Наприклад, замість того, щоб писати заголовок «Сигнали», спробуйте написати «Реакція на зміни за допомогою сигналів». Друга назва пояснює призначення сигналів.
zh_tw: 每個頁面或章節都應明確說明**要解決的問題**以及能讓使用者學到什麼。使用者需了解他們是否正在閱讀能解決自身問題的正確指引。例如，標題請不要只寫「訊號（Signals）」，建議寫成「使用訊號回應變化」。後者更能明確表達訊號的目的。

source: Long section titles lead to long entries in the side menu, which can make navigation cumbersome. Try to keep headings five words long or less.
ga: Mar thoradh ar theidil rannán fada bíonn iontrálacha fada sa roghchlár taobh, rud a d'fhéadfadh nascleanúint a dhéanamh deacair. Déan iarracht ceannteidil a choinneáil cúig fhocal ar fad nó níos lú.
it: I titoli di sezione lunghi risultano in voci lunghe nel menu laterale, il che può rendere la navigazione macchinosa. Cercare di mantenere i titoli lunghi al massimo cinque parole.
ja: セクションのタイトルが長いと、サイドメニューの項目が長くなりナビゲーションが煩雑になります。見出しの長さは英語5ワード以内にするようにしましょう。
ta: நீண்ட பிரிவு தலைப்புகள் பக்க பட்டியலில் நீண்ட உள்ளீடுகளுக்கு வழிவகுக்கும், இது வழிசெலுத்தலை சிக்கலானதாக மாற்றும். தலைப்புகளை ஐந்து சொற்களை நீளமாக அல்லது குறைவாக வைக்க முயற்சிக்கவும்.
tr: Uzun bölüm başlıkları yan menüde uzun girişlere yol açar ve bu da gezinmeyi hantal hale getirebilir. Başlıkları beş kelime veya daha kısa tutmaya çalışın.
uk: Довгі заголовки розділів призводять до довгих записів у бічному меню, що може зробити навігацію громіздкою. Намагайтеся, щоб заголовки мали п’ять слів або менше.
zh_tw: 章節標題過長會讓側邊選單變得冗長，導覽也不便。請盡量將標題控制在五個單詞以內。

source: If the page assumes specific knowledge of other Godot features, mention it and link to the corresponding documentation. For instance, a page about physics may use signals, in which case you could note that the signals tutorial is a prerequisite. You may also link to other websites for prerequisites beyond the documentation's scope. For example, you could link to an introduction to programming in the getting started guide, or a website that teaches math theory in the math section.
ga: Má ghlacann an leathanach le heolas sonrach ar ghnéithe Godot eile, luaigh é agus nasc leis an doiciméad comhfhreagrach. Mar shampla, féadfaidh leathanach faoin bhfisic comharthaí a úsáid, agus sa chás sin d'fhéadfá a thabhairt faoi deara gur réamhriachtanas é an rang teagaisc comharthaí. Féadfaidh tú nasc a dhéanamh le láithreáin ghréasáin eile freisin le haghaidh réamhriachtanais níos faide ná raon feidhme Mar shampla, d'fhéadfá nasc a dhéanamh le réamhrá ar chlárú sa treoir tosaigh, nó suíomh Gréasáin a mhúineann teoiric matamaitice sa chuid matamaitice.
it: Se la pagina presuppone una conoscenza specifica di altre funzionalità di Godot, menzionarla e inserire un collegamento alla documentazione corrispondente. Ad esempio, una pagina sulla fisica potrebbe utilizzare i segnali, nel qual caso potreste specificare che il tutorial sui segnali è un prerequisito. È concesso anche collegare ad altri siti web per prerequisiti che vanno oltre l'ambito della documentazione. Ad esempio, si potrebbe collegare a un'introduzione alla programmazione nella guida introduttiva, oppure a un sito web che insegna teorie matematiche nella sezione di matematica.
ja: もしそのページが他のGodotの機能に関する特定の知識を前提としている場合は、そのことに触れ、対応するドキュメントにリンクしてください。例えば、物理のページではシグナルを使うかもしれません。その場合、シグナルのチュートリアルが前提条件であることを示すのがよいでしょう。また、ドキュメントの範囲外の前提条件について、他のウェブサイトにリンクすることもできます。例えば、入門のセクションからプログラミング入門サイトへリンクしたり、数学のセクションから数学理論を教えるウェブサイトにリンクしてもいいでしょう。
ta: பக்கம் பிற கோடோட் அம்சங்களைப் பற்றிய குறிப்பிட்ட அறிவைக் கருதினால், அதைக் குறிப்பிட்டு, அதனுடன் தொடர்புடைய ஆவணங்களுடன் இணைக்கவும். உதாரணமாக, இயற்பியலைப் பற்றிய ஒரு பக்கம் சமிக்ஞைகளைப் பயன்படுத்தலாம், இந்த விசயத்தில் சிக்னல்கள் பயிற்சி ஒரு முன்நிபந்தனை என்பதை நீங்கள் கவனிக்கலாம். ஆவணங்களின் எல்லைக்கு அப்பாற்பட்ட முன்நிபந்தனைகளுக்காக நீங்கள் பிற வலைத்தளங்களுடன் இணைக்கலாம். எடுத்துக்காட்டாக, தொடங்கும் வழிகாட்டியில் நிரலாக்கத்திற்கான அறிமுகத்துடன் அல்லது கணித பிரிவில் கணிதக் கோட்பாட்டைக் கற்பிக்கும் வலைத்தளம்.
tr: Sayfa diğer Godot özellikleri hakkında özel ön bilgi gerektiriyorsa, bundan bahsedin ve ilgili belgelere bağlantı verin. Örneğin, fizikle ilgili bir sayfa sinyalleri kullanabilir, bu durumda sinyaller eğitiminin bir ön koşul olduğunu belirtebilirsiniz. Belgelerin kapsamı dışındaki önkoşullar için başka web sitelerine de bağlantı verebilirsiniz. Örneğin, başlangıç kılavuzunda programlamaya giriş veya matematik bölümünde matematik teorisini öğreten bir web sitesine bağlantı verebilirsiniz.
uk: Якщо сторінка передбачає конкретні знання про інші функції Godot, згадайте про це та вкажіть посилання на відповідну документацію. Наприклад, сторінка про фізику може використовувати сигнали, у цьому випадку ви можете зауважити, що підручник із сигналів є обов’язковою умовою. Ви також можете посилатися на інші веб-сайти для попередніх умов, що виходять за рамки документації. Наприклад, ви можете зробити посилання на вступ до програмування в посібнику з початку роботи або веб-сайт, який викладає теорію математики в математичному розділі.
zh_tw: 若頁面假設讀者已瞭解其他 Godot 功能，請註明並連結至相關文件。舉例來說，若物理相關章節用到訊號，請標註「訊號教學」為先備知識。若先備知識超出本說明文件範圍，也可連結外部網站。例如於入門指引連結「程式設計簡介」，或於數學章節連結數學理論教學網站。

source: Limiting cognitive load
ga: Ualach chognaíoch a
it: Limitare il carico cognitivo
ja: 認知的負荷の制限
ta: அறிவாற்றல் சுமை கட்டுப்படுத்துகிறது
tr: Bilişsel yükün sınırlandırılması
uk: Обмеження когнітивного навантаження
zh_tw: 減輕認知負擔

source: Limit the cognitive load required to read the documentation. The simpler and more explicit language we use, the more efficient it becomes for people to learn. You can do so by:
ga: Cuir teorainn leis an ualach cognaíoch a theastaíonn chun an doiciméadú An teanga níos simplí agus níos folláine a úsáidimid, is éifeachtaí a éiríonn sé do dhaoine foghlaim. Is féidir leat é sin a dhéanamh trí:
ja: ドキュメントを読むのに必要な認知的負荷を抑えましょう。よりシンプルで明示的な言葉を使えば、人々の学習効率もより高まります。そのためには以下の方法があります:
ta: ஆவணங்களைப் படிக்க தேவையான அறிவாற்றல் சுமையை கட்டுப்படுத்துங்கள். நாம் பயன்படுத்தும் எளிமையான மற்றும் வெளிப்படையான மொழி, மக்கள் கற்றுக்கொள்வது மிகவும் திறமையாக மாறும். நீங்கள் அவ்வாறு செய்யலாம்:
tr: Belgeleri okumak için gereken bilişsel yükü sınırlandırın. Ne kadar basit ve açık bir dil kullanırsak, insanların öğrenmesi o kadar verimli olur. Bunu şu şekilde yapabilirsiniz:
uk: Обмежте когнітивне навантаження, необхідне для читання документації. Чим простішою та зрозумілішою мовою ми користуємося, тим ефективніше стає для людей навчання. Ви можете зробити це:
zh_tw: 降低閱讀說明文件時的認知負擔。語言越簡單明確，學習效率就越高。你可以透過以下方式達成：

source: Introducing only one new concept at a time whenever possible.
ga: Ní thabhairt isteach ach coincheap nua amháin ag an am nuair is féidir.
it: Introdurre solo un nuovo concetto alla volta, qualora sia possibile.
ja: 可能な限り、一度に新しいコンセプトを1つだけ導入する。
ta: முடிந்தவரை ஒரு புதிய கருத்தை மட்டுமே அறிமுகப்படுத்துகிறது.
tr: Mümkün olduğunca her seferinde sadece bir yeni kavram tanıtmak.
uk: Представляючи лише одну нову концепцію за раз, коли це можливо.
zh_tw: 盡可能每次只介紹一個新概念。

source: Using simple English, as we recommend in our writing guidelines.
ga: Béarla simplí a úsáid, mar a mholtar inár dtreoirlínte scríbhneoireachta.
it: Utilizzare un inglese semplice, come raccomandiamo nelle nostre linee guida di scrittura.
ja: ドキュメント作成ガイドラインで推奨される通り、シンプルな英語を使う。
ta: எங்கள் எழுத்து வழிகாட்டுதல்களில் பரிந்துரைப்பது போல, எளிய ஆங்கிலத்தைப் பயன்படுத்துதல்.
tr: Yazım kılavuzlarımızda önerdiğimiz gibi basit bir İngilizce kullanın (çevirisi de sade kalır).
uk: Використовуючи просту англійську мову, як ми рекомендуємо в наших інструкціях з написання.
zh_tw: 請如我們寫作指引中所建議，使用簡潔易懂的英文。

source: Including one or more **concrete usage examples**. Prefer a real-world example to one that uses names like ``foo``, ``bar``, or ``baz``.
ga: Lena n-áirítear samplaí úsáide coincréit** amháin nó níos mó. Is fearr sampla fíor-shaoil ná ceann a úsáideann ainmneacha mar ``foo``, `bar``, nó ``baz``.
it: Includendo uno o più **esempi di utilizzo concreto**. È preferito un esempio concreto a uno che usa nomi come ``foo``, ``bar`` o ``baz``.
ja: 1つ以上の **具体的な使用例** を含める。 ``foo`` 、 ``bar`` 、 ``baz`` などの名前を使った例よりも、実際の例を優先してください。
ta: ஒன்று அல்லது அதற்கு மேற்பட்டவை ** கான்கிரீட் பயன்பாட்டு எடுத்துக்காட்டுகள் **. `` Foo``, `` பார்`` அல்லது `` பாச்`` போன்ற பெயர்களைப் பயன்படுத்தும் ஒன்றுக்கு நிச உலக உதாரணத்தை விரும்புங்கள்.
tr: Bir veya daha fazla **somut kullanım örneği** içermelidir. ``foo``, ``bar`` veya ``baz`` gibi isimler kullanan bir örnek yerine gerçek dünyadan bir örneği tercih edin.
uk: Включно з одним або кількома **конкретними прикладами використання**. Віддавайте перевагу прикладу з реального світу, а не такому, який використовує такі імена, як ``foo``, ``bar`` або ``baz``.
zh_tw: 請提供一個或多個**具體的實際應用範例**。真實案例遠比使用 ``foo``、``bar``、``baz`` 這類抽象變數名稱來得好。
