Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/contributing_to_the_documentation.po
Languages: cs, ga, it, ko, ru, ta, tr, uk, zh_tw

source: Contributing to the documentation
ga: Rannchuidiú leis an doiciméadú
it: Contribuire alla documentazione
ru: Вклад в документацию
ta: ஆவணங்களுக்கு பங்களிப்பு
tr: Belgelere katkıda bulunmak
uk: Внески до документації
zh_tw: 貢獻說明文件

source: This guide explains how to contribute to Godot's documentation, be it by writing or reviewing pages.
ga: Míníonn an treoir seo conas cur le doiciméadú Godot, bíodh sé trí leathanaigh a scríobh nó a athbhreithniú.
it: Questa guida spiega come contribuire alla documentazione di Godot, che sia scrivendo o revisionando pagine.
ta: இந்த வழிகாட்டி கோடோட்டின் ஆவணங்களுக்கு எவ்வாறு பங்களிப்பது என்பதை விளக்குகிறது, பக்கங்களை எழுதுவதன் மூலம் அல்லது மதிப்பாய்வு செய்வதன் மூலம்.
tr: Bu kılavuz, Godot'nun belgelerine, yazarak veya sayfaları gözden geçirerek nasıl katkıda bulunabileceğinizi açıklamaktadır.
uk: У цьому посібнику пояснюється, як зробити свій внесок у документацію Годо, будь то шляхом написання чи рецензування сторінок.
zh_tw: 本指南說明如何貢獻 Godot 的說明文件，無論是撰寫還是審查頁面。

source: If you want to translate pages or the class reference from English to other languages, read :ref:`doc_editor_and_docs_localization`.
ga: Más mian leat leathanaigh nó an tagairt ranga a aistriú ó Bhéarla go teangacha eile, léigh :ref:'doc_editor_and_docs_localization'.
it: Se si desidera tradurre le pagine o il riferimento alle classi dall'inglese ad altre lingue, leggere :ref:`doc_editor_and_docs_localization`.
ta: நீங்கள் பக்கங்கள் அல்லது வகுப்பு குறிப்பை ஆங்கிலத்திலிருந்து பிற மொழிகளுக்கு மொழிபெயர்க்க விரும்பினால், படிக்க: குறிப்பு: `doc_editor_and_docs_localization`.
tr: Sayfaları veya sınıf başvurularını İngilizce'den diğer dillere çevirmek istiyorsanız :ref:`doc_editor_and_docs_localization` sayfasını okuyun.
uk: Якщо ви хочете перекладати сторінки або посилання на клас з англійської на інші мови, прочитайте :ref:`doc_editor_and_docs_localization`.
zh_tw: 如果你想將頁面或類別參考從英文翻譯為其他語言，請參閱 :ref:`doc_editor_and_docs_localization`。

source: Getting started
cs: Začínáme
ga: Ag tosú
it: Per iniziare
ko: 시작하기
ru: Начало работы
ta: தொடங்குதல்
tr: Başlarken
uk: Перші кроки
zh_tw: 入門

source: To modify or create pages in the reference manual, you need to edit ``.rst`` files in the `godot-docs GitHub repository <https://github.com/godotengine/godot-docs>`_. Modifying those pages in a pull request triggers a rebuild of the online documentation upon merging.
ga: Chun leathanaigh sa lámhleabhar tagartha a mhodhnú nó a chruthú, ní mór duit comhaid ``.rst`` a chur in eagar sa stór `godot-docs GitHub <https://github.com/godotenginine/godot-docs>`_. Má dhéantar na leathanaigh sin a mhodhnú in iarratas tarraingte spreagtar atógáil na gcáipéisí ar líne nuair a chumasctar iad.
it: Per modificare o creare pagine nel manuale di riferimento, è necessario modificare i file ``.rst`` nel repository `godot-docs <https://github.com/godotengine/godot-docs>`_ su GitHub. Modificare queste pagine in una richiesta di pull attiva una ricostruzione della documentazione online al momento del merge.
ta: குறிப்பு கையேட்டில் பக்கங்களை மாற்ற அல்லது உருவாக்க, நீங்கள் `` .rst`` கோப்புகளை `கோடோட்-டாக்ச் அறிவிலிமையம் களஞ்சியத்தில் <https://github.com/godotengine/godot-docs>` _ இல் திருத்த வேண்டும். இழுக்கும் கோரிக்கையில் அந்த பக்கங்களை மாற்றியமைப்பது ஒன்றிணைந்தவுடன் நிகழ்நிலை ஆவணங்களை மீண்டும் கட்டியெழுப்பத் தூண்டுகிறது.
tr: Başvuru kılavuzundaki sayfaları değiştirmek veya yenisini oluşturmak için `godot-docs GitHub deposu <https://github.com/godotengine/godot-docs>`_ içindeki ``.rst`` dosyalarını düzenlemeniz gerekir. Bu sayfaların bir çekme isteğinde değiştirilmesi, birleştirme sonrasında çevrimiçi belgelerin yeniden oluşturulmasını tetikler.
uk: Щоб змінити або створити сторінки в довідковому посібнику, вам потрібно відредагувати файли ``.rst`` у сховищі `godot-docs GitHub <https://github.com/godotengine/godot-docs>`_. Зміна цих сторінок у запиті на витягування запускає перебудову онлайн-документації після злиття.
zh_tw: 要修改或新增參考手冊的頁面，需編輯 `godot-docs GitHub 儲存庫 <https://github.com/godotengine/godot-docs>`_ 內的 ``.rst`` 檔案。透過拉取請求（Pull Request）修改這些頁面並合併後，系統會自動重建線上文件。

source: For details on Git usage and the pull request workflow, please refer to the :ref:`doc_pr_workflow` page. Most of what it describes regarding the main godotengine/godot repository is also valid for the docs repository.
ga: Le haghaidh sonraí maidir le húsáid Git agus sreabhadh oibre an iarratais tarraingthe, féach ar an leathanach :ref:'doc_pr_workflow'. Tá an chuid is mó de na rudaí a chuireann sé síos air maidir leis an bpríomhstóras godotengine / godot bailí freisin don stór docs.
it: Per dettagli sull'utilizzo di Git e sul flusso di lavoro delle richieste di pull, consultare la pagina :ref:`doc_pr_workflow`. Gran parte di quanto descritto per il repository principale godotengine/godot è valido anche per il repository della documentazione.
ru: Для получения подробной информации об использовании Git, в том числе - о механизме Pull request, обратитесь к странице :ref:`doc_pr_workflow`. Большая часть того, что там сказано относительно основного репозитория godotengine/godot, также применимо и к репозиторию godotengine/godot-docs.
ta: அறிவிலி பயன்பாடு மற்றும் இழுப்பு கோரிக்கை பணிப்பாய்வு பற்றிய விவரங்களுக்கு, தயவுசெய்து: ref: `doc_pr_workflow` பக்கத்தைப் பார்க்கவும். முக்கிய கோடோடெங்கைன்/கோடோட் களஞ்சியத்தைப் பற்றி அது விவரிப்பதில் பெரும்பாலானவை டாக்ச் களஞ்சியத்திற்கு செல்லுபடியாகும்.
tr: Git kullanımı ve çekme isteği iş akışı hakkında ayrıntılar için lütfen :ref:`doc_pr_workflow` sayfasına bakın. Ana "godotengine/godot" deposu ile ilgili anlatılanların çoğu "docs" deposu için de geçerlidir.
uk: Докладні відомості про використання Git і робочий процес запиту на отримання дивіться на сторінці :ref:`doc_pr_workflow`. Більшість того, що в ньому описано щодо основного сховища godotengine/godot, також дійсне для сховища документів.
zh_tw: 有關 Git 的使用方式與拉取請求（Pull Request）流程，請參考 :ref:`doc_pr_workflow` 頁面。該頁面大部分說明內容也適用於文件儲存庫。

source: The class reference's source files are in the `Godot engine repository <https://github.com/godotengine/godot>`_. We generate the :ref:`Class Reference <doc_class_reference>` section of this documentation from them. If you want to update the description of a class, its methods, or properties, read :ref:`doc_updating_the_class_reference`.
ga: Tá comhaid foinse na tagartha ranga i stór inneall `Godot <https://github.com/godotenginine/godot>`_. Ginimid an chuid :ref:`Tagairt Aicme <doc_class_reference>` den cháipéisíocht seo uathu. Más mian leat an cur síos ar aicme, a mhodhanna nó a airíonna a nuashonrú, léigh :ref: `doc_updating_the_class_reference`.
it: I file sorgente del riferimento alle classi si trovano nel `repository del motore Godot <https://github.com/godotengine/godot>`_. Da questi, generiamo la sezione :ref:`Riferimento alle classi <doc_class_reference>` di questa documentazione. Per aggiornare la descrizione di una classe, i suoi metodi o le sue proprietà, leggere :ref:`doc_updating_the_class_reference`.
ta: வகுப்பு குறிப்பின் மூல கோப்புகள் `கோடோட் என்சின் களஞ்சியத்தில் <https://github.com/godotengine/godot> _ _ இல் உள்ளன. நாங்கள் உருவாக்குகிறோம்: ref: `வகுப்பு குறிப்பு <doc_class_reference>` அவர்களிடமிருந்து இந்த ஆவணத்தின் பிரிவு. ஒரு வகுப்பு, அதன் முறைகள் அல்லது பண்புகளின் விளக்கத்தை நீங்கள் புதுப்பிக்க விரும்பினால், படிக்க: குறிப்பு: `doc_updating_the_class_reference`.
tr: Sınıf başvurularının kaynak dosyaları `Godot motor deposunda <https://github.com/godotengine/godot>`_ bulunmaktadır. Bu belgelerin :ref:`Sınıf Başvuruları <doc_class_reference>` bölümünü onlardan üretiyoruz. Bir sınıfın tanımlamasını, yöntemlerini veya özelliklerini güncellemek istiyorsanız, :ref:`doc_updating_the_class_reference` bölümünü okuyun.
uk: Вихідні файли посилання на клас знаходяться в `репозиторії механізму Godot <https://github.com/godotengine/godot>`_. З них ми створюємо розділ :ref:`Довідка про клас <doc_class_reference>` цієї документації. Якщо ви хочете оновити опис класу, його методи чи властивості, прочитайте :ref:`doc_updating_the_class_reference`.
zh_tw: 類別參考的原始檔案位於 `Godot 引擎儲存庫 <https://github.com/godotengine/godot>`_。我們會根據這些檔案產生本文件的 :ref:`類別參考 <doc_class_reference>` 章節。若你想更新類別、方法或屬性的描述，請參閱 :ref:`doc_updating_the_class_reference`。

source: What is the Godot documentation
cs: Co je dokumentace Godot
ga: Cad é doiciméadú Godot
it: Cos'è la documentazione di Godot
ko: Godot 문서는 무엇입니까
ru: Что такое документация Godot
ta: கோடோட் ஆவணம் என்றால் என்ன
tr: Godot belgeleri nedir
uk: Що таке документація Годо
zh_tw: 什麼是 Godot 文件

source: The Godot documentation is intended as a comprehensive reference manual for the Godot game engine. It is not meant to contain step-by-step tutorials, except for two game creation tutorials in the Getting Started section.
ga: Tá doiciméadú Godot beartaithe mar lámhleabhar tagartha cuimsitheach d'inneall cluiche Godot. Níl sé i gceist go mbeadh ranganna teagaisc céim ar chéim ann, ach amháin i gcás dhá rang teagaisc cruthaithe cluiche sa chuid Getting Started.
ta: கோடோட் ஆவணம் கோடோட் விளையாட்டு இயந்திரத்திற்கான விரிவான குறிப்பு கையேட்டாக கருதப்படுகிறது. தொடங்கும் பிரிவில் இரண்டு விளையாட்டு உருவாக்கும் பயிற்சிகள் தவிர, படிப்படியான பயிற்சிகளைக் கொண்டிருப்பது அல்ல.
tr: Godot belgeleri, Godot oyun motoru için kapsamlı bir başvuru kılavuzu olması için tasarlanmıştır. Başlarken bölümündeki iki oyun oluşturma öğreticisi dışında, adım adım öğreticiler içermesi amaçlanmamıştır.
uk: Документація Godot призначена як вичерпний довідковий посібник для ігрового движка Godot. Він не міститиме покрокових посібників, за винятком двох посібників зі створення ігор у розділі «Початок роботи».
zh_tw: Godot 文件旨在作為 Godot 遊戲引擎的完整參考手冊。除了「入門」章節中的兩個遊戲製作教學外，並不包含循序漸進的教學。

source: We strive to write factual content in an accessible and well-written language. To contribute, you should also read:
ga: Déanaimid ár ndícheall ábhar fíorasach a scríobh i dteanga inrochtana agus dea-scríofa. Chun cur leis, ba chóir duit an méid seo a leanas a léamh freisin:
it: Ci sforziamo a scrivere contenuti concreti in un linguaggio accessibile e ben scritto. Per contribuire, consigliamo di leggere anche:
ta: அணுகக்கூடிய மற்றும் நன்கு எழுதப்பட்ட மொழியில் உண்மை உள்ளடக்கத்தை எழுத முயற்சிக்கிறோம். பங்களிக்க, நீங்கள் படிக்க வேண்டும்:
tr: Erişilebilir ve iyi yazılmış bir dille gerçeklere dayalı içerik yazmaya çalışıyoruz. Katkıda bulunmak için şunları da okumalısınız:
uk: Ми прагнемо писати фактичний вміст доступною та добре написаною мовою. Щоб зробити свій внесок, ви також повинні прочитати:
zh_tw: 我們致力於用易讀且清晰的語言撰寫正確內容。參與貢獻前，請先閱讀：

source: :ref:`doc_docs_writing_guidelines`. There, you will find rules and recommendations to write in a way that everyone understands.
ga: :ref:'doc_docs_writing_guidelines'. Ansin, gheobhaidh tú rialacha agus moltaí le scríobh ar bhealach a thuigeann gach duine.
it: :ref:`doc_docs_writing_guidelines`. Qui si troveranno regole e raccomandazioni per scrivere in modo che tutti possano comprendere.
ta: : Ref: `doc_docs_writing_guidelines`. அங்கு, எல்லோரும் புரிந்துகொள்ளும் வகையில் எழுத விதிகளையும் பரிந்துரைகளையும் நீங்கள் காண்பீர்கள்.
tr: :ref:`doc_docs_writing_guidelines`. Burada, herkesin anlayacağı şekilde yazmak için kurallar ve öneriler bulacaksınız.
uk: :ref:`doc_docs_writing_guidelines`. Там ви знайдете правила та рекомендації писати так, щоб усі зрозуміли.
zh_tw: :ref:`doc_docs_writing_guidelines`，你可以在那裡找到讓內容易於理解的寫作規範與建議。

source: :ref:`doc_content_guidelines`. They explain the principles we follow to write the documentation and the kind of content we accept.
ga: :ref:'doc_content_guidelines'. Míníonn siad na prionsabail a leanaimid chun an cháipéisíocht agus an cineál ábhair a nglacaimid leis a scríobh.
it: :ref:`doc_content_guidelines`. Descrivono i principi che seguiamo per scrivere la documentazione e il tipo di contenuto che accettiamo.
ta: : Ref: `doc_content_guidelines`. ஆவணங்களை எழுத நாங்கள் பின்பற்றும் கொள்கைகளையும், நாங்கள் ஏற்றுக்கொள்ளும் உள்ளடக்கத்தையும் அவை விளக்குகின்றன.
tr: :ref:`doc_content_guidelines`. Belgeleri yazmak için izlediğimiz ilkeleri ve kabul ettiğimiz içerik türünü açıklar.
uk: :ref:`doc_content_guidelines`. Вони пояснюють принципи, яких ми дотримуємося під час написання документації, і тип вмісту, який ми приймаємо.
zh_tw: :ref:`doc_content_guidelines`，說明我們撰寫文件時遵循的原則，以及哪些內容是我們接受的。

source: Contributing changes
cs: Přispívání změnami
ga: Athruithe a chur ar fáil
it: Contribuire cambiamenti
ko: 변경사항 기여하기
ta: பங்களிப்பு மாற்றங்கள்
tr: Değişikliklerle katkı yapmak
uk: Внесення змін
zh_tw: 貢獻變更

source: **Pull requests should use the** ``master`` **branch by default.** Only make pull requests against other branches (e.g. ``3.6`` or ``4.2``) if your changes only apply to that specific version of Godot. After a pull request is merged into ``master``, it will usually be cherry-picked into the current stable branch by documentation maintainers.
it: **Le richieste di pull dovrebbero normalmente utilizzare il branch** ``master``. Invia richieste di pull ad altri branch (ad esempio ``3.6`` o ``4.2``) solamente se le modifiche si applicano solo a quella specifica versione di Godot. Dopo che una richiesta di pull è stata unita a ``master``, verrà solitamente selezionata nel branch stabile attuale dai responsabili della documentazione.
ta: . ஒரு இழுத்தல் கோரிக்கை `` மாச்டர்`` உடன் இணைக்கப்பட்ட பிறகு, இது வழக்கமாக ஆவணங்கள் பராமரிப்பாளர்களால் தற்போதைய நிலையான கிளையில் செர்ரி-தேர்ந்தெடுக்கப்படும்.
zh_tw: **拉取請求（Pull request）預設應使用** ``master`` **分支。** 只有當你的變更只適用於特定 Godot 版本（如 ``3.6`` 或 ``4.2`` ）時，才針對該分支提出拉取請求。當拉取請求合併到 ``master`` 後，維護者通常會再將其揀選（cherry-pick）到目前的穩定分支。

source: Though less convenient to edit than a wiki, this Git repository is where we write the documentation. Having direct access to the source files in a revision control system is a plus to ensure our documentation quality.
ga: Cé nach bhfuil sé chomh áisiúil eagarthóireacht a dhéanamh ná wiki, is é an stór Git seo an áit a scríobhaimid na doiciméid. Is móide rochtain dhíreach a bheith agat ar na comhaid foinseacha i gcóras rialaithe athbhreithnithe chun ár gcáilíocht doiciméadaithe a chinntiú.
it: Sebbene meno comodo da modificare rispetto a un wiki, questo repository Git è dove scriviamo la documentazione. Avere accesso diretto ai file sorgente tramite un sistema di controllo versioni è buono per garantire la qualità della nostra documentazione.
ta: விக்கியை விட திருத்துவதற்கு குறைந்த வசதியானது என்றாலும், இந்த அறிவிலி களஞ்சியம் தான் நாங்கள் ஆவணங்களை எழுதுகிறோம். திருத்தக் கட்டுப்பாட்டு அமைப்பில் மூல கோப்புகளுக்கு நேரடி அணுகல் இருப்பது எங்கள் ஆவணங்களின் தரத்தை உறுதிப்படுத்த ஒரு பிளச் ஆகும்.
tr: Düzenlemesi bir wiki'den daha az kolay olsa da, bu Git deposu belgeleri yazdığımız yerdir. Bir revizyon kontrol sisteminde kaynak dosyalara doğrudan erişime sahip olmak, belgelerin kalitesini sağlama almak için bir artıdır.
uk: Хоча це сховище Git менш зручно для редагування, ніж вікі, ми пишемо документацію. Наявність прямого доступу до вихідних файлів у системі контролю версій є плюсом для забезпечення якості нашої документації.
zh_tw: 雖然這裡不像 Wiki 那麼方便編輯，但我們所有說明文件皆在這個 Git 儲存庫中撰寫。透過版本控制系統直接存取原始檔，有助於維護文件品質。

source: Editing existing pages
cs: Úprava stávajících stránek
ga: Eagarthóireacht a dhéanamh ar leathanaigh atá ann cheana
it: Modificare le pagine esistenti
ko: 기존 페이지 편집하기
ta: இருக்கும் பக்கங்களைத் திருத்துதல்
tr: Var olan sayfaları düzenlemek
uk: Редагування існуючих сторінок
zh_tw: 編輯現有頁面

source: To edit an existing page, locate its ``.rst`` source file and open it in your favorite text editor. You can then commit the changes, push them to your fork, and make a pull request. **Note that the pages in** ``classes/`` **should not be edited here.** They are automatically generated from Godot's `XML class reference <https://github.com/godotengine/godot/tree/master/doc/classes>`__. See :ref:`doc_updating_the_class_reference` for details.
ga: Chun leathanach atá ann cheana a chur in eagar, aimsigh a bhunchomhad ``.rst`` agus oscail san eagarthóir téacs is fearr leat. Is féidir leat na hathruithe a dhéanamh ansin, iad a bhrú chuig do fhorc, agus iarratas tarraingt a dhéanamh. **Tabhair faoi deara nár cheart na leathanaigh sna ** ``ranganna/`` ** a chur in eagar anseo.** Gintear iad go huathoibríoch ó thagairt ranga `XML Godot <https://github.com/godotenginine/godot/tree/ máistir/doc/ranganna>`__. Féach :tag: `doc_updating_the_class_reference` le haghaidh sonraí.
it: Per modificare una pagina esistente, individuare il suo file sorgente ``.rst`` e aprirlo con un editor di testo a scelta. Sarà quindi possibile eseguire il commit delle modifiche, inviarle al proprio fork ed effettuare una richiesta di pull. **Nota che le pagine in** ``classes/`` **non si devono modificare qui.** Vengono generate automaticamente dal `riferimento alle classi XML di Godot <https://github.com/godotengine/godot/tree/master/doc/classes>`__. Consultare :ref:`doc_updating_the_class_reference` per i dettagli.
ta: ஏற்கனவே உள்ள பக்கத்தைத் திருத்த, அதன் `` .rst`` மூலக் கோப்பைக் கண்டுபிடித்து உங்களுக்கு பிடித்த உரை எடிட்டரில் திறக்கவும். நீங்கள் மாற்றங்களைச் செய்யலாம், அவற்றை உங்கள் முட்கரண்டிக்கு தள்ளி, இழுக்கும் கோரிக்கையை செய்யலாம். ** ** `` வகுப்புகள்/`` ** இல் உள்ள பக்கங்கள் இங்கே திருத்தப்படக்கூடாது என்பதை நினைவில் கொள்க. மாச்டர்/டாக்/வகுப்புகள்> `__. காண்க: குறிப்பு: விவரங்களுக்கு `doc_updating_the_class_reference`.
tr: Mevcut bir sayfayı düzenlemek için ``.rst`` kaynak dosyasını bulun ve favori metin düzenleyicinizde açın. Daha sonra değişiklikleri işleyebilir, çatalınıza gönderebilir ve bir çekme isteği oluşturabilirsiniz. ``classes/`` **içindeki sayfaların burada düzenlenmemesi gerektiğini unutmayın**. Bunlar Godot'nun `XML sınıf başvurularından <https://github.com/godotengine/godot/tree/master/doc/classes>`__ otomatik olarak oluşturulur. Ayrıntılar için :ref:`doc_updating_the_class_reference` bölümüne bakın.
uk: Щоб редагувати існуючу сторінку, знайдіть її вихідний файл ``.rst`` і відкрийте його у своєму улюбленому текстовому редакторі. Потім ви можете зафіксувати зміни, відправити їх у форк і зробити запит на отримання. **Зверніть увагу, що сторінки в** ``classes/`` **не слід редагувати тут.** Вони автоматично генеруються з `посилання на клас XML Годо <https://github.com/godotengine/godot/tree/ master/doc/classes>`__. Перегляньте :ref:`doc_updating_the_class_reference` для деталей.
zh_tw: 要編輯現有頁面，請找到該頁面的 ``.rst`` 原始檔，並使用你喜歡的文字編輯器開啟。完成修改後提交（commit），推送至你的 fork，再建立拉取請求（Pull request）。 **注意： ``classes/`` 目錄下的頁面不應在此直接編輯，** 這些頁面會自動從 Godot 的 `XML 類別參考 <https://github.com/godotengine/godot/tree/master/doc/classes>`__ 產生。詳情請參閱 :ref:`doc_updating_the_class_reference`。

source: To build the manual and test changes on your computer, see :ref:`doc_building_the_manual`.
ga: Chun na hathruithe láimhe agus tástála a thógáil ar do ríomhaire, féach :ref:'doc_building_the_manual'.
it: Per compilare il manuale e testare le modifiche sul proprio computer, consultare :ref:`doc_building_the_manual`.
ta: உங்கள் கணினியில் கையேடு மற்றும் சோதனை மாற்றங்களை உருவாக்க, காண்க: குறிப்பு: `doc_building_the_manual`.
tr: Kılavuzu oluşturmak ve değişiklikleri bilgisayarınızda test etmek için :ref:`doc_building_the_manual` bölümüne bakın.
uk: Щоб створити посібник і протестувати зміни на своєму комп’ютері, перегляньте :ref:`doc_building_the_manual`.
zh_tw: 若要在本機建構說明文件並測試修改，請參考 :ref:`doc_building_the_manual`。

source: Editing pages online
cs: Úpravy stránek online
ga: Leathanaigh eagarthóireachta ar líne
it: Modificare le pagine online
ko: 온라인에서 페이지 편집하기
ta: ஆன்லைனில் பக்கங்களைத் திருத்துதல்
tr: Sayfaları çevrimiçi düzenleme
uk: Редагування сторінок онлай
zh_tw: 線上編輯頁面

source: You can edit the documentation online by clicking the **Edit on GitHub** link in the top-right of every page.
ga: Is féidir leat na doiciméid a chur in eagar ar líne trí chliceáil ar an nasc **Edit on GitHub ** ag barr gach leathanaigh ar dheis.
it: È possibile modificare la documentazione online cliccando sul collegamento **Modifica su GitHub** in alto a destra di ogni pagina.
ta: ஒவ்வொரு பக்கத்தின் மேல்-வலதுபுறத்தில் உள்ள அறிவிலிமையம் ** இணைப்பில் ** திருத்து என்பதைக் சொடுக்கு செய்வதன் மூலம் ஆவணங்களை ஆன்லைனில் திருத்தலாம்.
tr: Her sayfanın sağ üst köşesindeki **GitHub'da Düzenle** bağlantısına tıklayarak belgeleri çevrimiçi olarak düzenleyebilirsiniz.
uk: Ви можете редагувати документацію онлайн, натиснувши посилання **Редагувати на GitHub** у верхньому правому куті кожної сторінки.
zh_tw: 你可以點擊每頁右上角的 **Edit on GitHub** 連結，直接線上編輯說明文件。

source: Doing so takes you to the GitHub text editor. You need to have a GitHub account and to log in to use it. Once logged in, you can propose change like so:
ga: Má dhéanann tú amhlaidh tógann sé tú chuig eagarthóir téacs GitHub. Ní mór duit cuntas GitHub a bheith agat agus logáil isteach chun é a úsáid. Nuair a bheidh tú logáilte isteach, is féidir leat athrú mar sin a mholadh:
it: In questo modo si accede all'editor di testo di GitHub. Per utilizzarlo, è necessario avere un account GitHub e aver effettuato l'accesso. Una volta effettuato l'accesso, è possibile proporre modifiche in questo modo:
ta: அவ்வாறு செய்வது உங்களை அறிவிலிமையம் உரை எடிட்டருக்கு அழைத்துச் செல்கிறது. நீங்கள் ஒரு அறிவிலிமையம் கணக்கு வைத்திருக்க வேண்டும், அதைப் பயன்படுத்த உள்நுழைய வேண்டும். உள்நுழைந்ததும், நீங்கள் மாற்றத்தை முன்மொழியலாம்:
tr: Bunu yapmak sizi GitHub metin düzenleyicisine götürür. Kullanmak için bir GitHub hesabınızın olması ve oturum açmanız gerekir. Giriş yaptıktan sonra, aşağıdaki gibi değişiklik önerebilirsiniz:
uk: Ви перейдете до текстового редактора GitHub. Вам потрібно мати обліковий запис GitHub і ввійти, щоб використовувати його. Увійшовши в систему, ви можете запропонувати зміни таким чином:
zh_tw: 這樣會將你帶到 GitHub 的文字編輯器。你必須有 GitHub 帳號並登入才能使用。登入後，你可以依下列步驟提出修改：

source: Click the **Edit on GitHub** button.
ga: Cliceáil ar an gcnaipe **Edit on GitHub**.
it: Cliccare sul pulsante **Modifica su GitHub**.
ru: Нажмите кнопку **Редактировать на GitHub**.
ta: அறிவிலிமையம் ** பொத்தானில் ** திருத்து என்பதைக் சொடுக்கு செய்க.
tr: **GitHub'da Düzenle** düğmesine tıklayın.
uk: Натисніть кнопку **Редагувати на GitHub**.
zh_tw: 點擊 **Edit on GitHub** 按鈕。

source: On the GitHub page you're taken to, make sure the current branch is "master". Click the pencil icon in the top-right corner near the **Raw**, **Blame**, and **Delete** buttons. It has the tooltip "Fork this project and edit the file".
it: Nella pagina GitHub a cui si verrà indirizzati, assicurarsi che il branch attuale sia "master". Cliccare sull'icona della matita nell'angolo in alto a destra, vicino ai pulsanti **Raw**, **Blame** ed **Delete**. Ha un suggerimento "Fork this project and edit the file".
ta: நீங்கள் எடுக்கப்பட்ட அறிவிலிமையம் பக்கத்தில், தற்போதைய கிளை "மாச்டர்" என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். ** மூல **, ** பழி **, மற்றும் ** நீக்கு ** பொத்தான்களுக்கு அருகிலுள்ள மேல்-வலது மூலையில் உள்ள பென்சில் ஐகானைக் சொடுக்கு செய்க. இது "இந்த திட்டத்தை முட்கரண்டி மற்றும் கோப்பைத் திருத்த" கருவிக்குறிப்பைக் கொண்டுள்ளது.
zh_tw: 在跳轉後的 GitHub 頁面，請確認當前分支為 "master"。然後點擊靠近 **Raw**、**Blame**、**Delete** 按鈕的右上角鉛筆圖示，其工具提示為「Fork this project and edit the file」。

source: Edit the text in the text editor.
cs: Upravte text v textovém editoru.
ga: Cuir an téacs in eagar san eagarthóir téacs.
it: Modifica il testo nell'editor di testo.
ko: 텍스트 편집기에서 텍스트를 편집합니다.
ta: உரை திருத்தியில் உரையைத் திருத்தவும்.
tr: İçeriği metin düzenleyici ile düzenleyin.
uk: Відредагуйте текст у текстовому редакторі.
zh_tw: 在文字編輯器中編輯內容。
