Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/content_guidelines.po
Languages: ga, it, ja, ta, tr, uk, zh_tw

source: While many people may understand more complex language and abstract examples, you will lose others. Understandable writing and practical examples benefit everyone.
ga: Cé go dtuigeann go leor daoine samplaí teanga agus teibí níos casta, caillfidh tú daoine eile. Téann scríbhneoireacht sothuigthe agus samplaí praiticiúla chun tairbhe gach duine.
it: Mentre molte persone potrebbero comprendere un linguaggio più complesso ed esempi astratti, se ne perderanno altre. Una scrittura comprensibile ed esempi pratici sono vantaggiosi per tutti.
ja: より複雑な言葉や抽象的な例を理解できる人も多いかもしれませんが、残りの人を取り残すことになります。理解しやすい文章と実践的な例は、誰にとっても有益です。
ta: பலர் மிகவும் சிக்கலான மொழி மற்றும் சுருக்க எடுத்துக்காட்டுகளை புரிந்து கொள்ளலாம் என்றாலும், நீங்கள் மற்றவர்களை இழப்பீர்கள். புரிந்துகொள்ளக்கூடிய எழுத்து மற்றும் நடைமுறை எடுத்துக்காட்டுகள் அனைவருக்கும் பயனளிக்கின்றன.
tr: Birçok kişi daha karmaşık bir dili ve soyut örnekleri anlayabilirken, diğerlerini kaybedeceksiniz. Anlaşılır yazı ve pratik örnekler herkese fayda sağlar.
uk: Хоча багато людей можуть розуміти більш складну мову та абстрактні приклади, ви втратите інших. Зрозумілий текст і практичні приклади приносять користь усім.
zh_tw: 雖然有些人能理解較複雜的語言或抽象範例，但你也可能因此失去其他讀者。通俗易懂的寫作與實用範例對所有人都有幫助。

source: Always make an effort to **put yourself in the user's shoes**. When we understand something thoroughly, it becomes obvious to us. We may fail to think about details relevant to a newcomer, but **good documentation meets users where they are**. We should explain each feature's capabilities or intended uses with the most straightforward language possible.
ga: Déan iarracht i gcónaí**tú féin a chur i mbróga an úsáideora**. Nuair a thuigimid rud éigin go maith, bíonn sé soiléir dúinn. B'fhéidir go dteipeann orainn smaoineamh ar shonraí a bhaineann le núíosach, ach buaileann doiciméadú maith le húsáideoirí áit a bhfuil siad **. Ba cheart dúinn cumais nó úsáidí beartaithe gach gné a mhíniú leis an teanga is simplí is féidir.
it: Cercare sempre di **mettersi nei panni dell'utente**. Quando comprendiamo qualcosa a fondo, ci diventa ovvio. Potremmo non pensare ai dettagli rilevanti per un nuovo arrivato, ma **una buona documentazione incontra gli utenti esattamente dove si trovano**. Dovremmo spiegare le capacità o gli usi previsti di ogni funzionalità con il linguaggio più semplice possibile.
ja: 常に **ユーザーの立場に立つ** 努力をすること。私たちは何かを完全に理解すると、それを当然のものと思ってしまいます。新規ユーザーのために詳細を考えることを怠ることもあるかもしれませんが、 **良いドキュメントとは、ユーザーが読んでいる時の立場に合うものです** 。私たちは、各機能の能力や使用目的について、できるだけわかりやすい言葉で説明しなければなりません。
ta: பயனரின் காலணிகளில் உங்களை ** வைக்க எப்போதும் முயற்சி செய்யுங்கள் **. நாம் எதையாவது முழுமையாக புரிந்து கொள்ளும்போது, அது நமக்குத் தெளிவாகிறது. புதுமுகத்துடன் தொடர்புடைய விவரங்களைப் பற்றி நாம் சிந்திக்கத் தவறலாம், ஆனால் ** நல்ல ஆவணங்கள் பயனர்களை ** இருக்கும் இடத்தில் சந்திக்கிறது. ஒவ்வொரு அம்சத்தின் திறன்கள் அல்லது நோக்கம் கொண்ட பயன்பாடுகளை மிகவும் நேரடியான மொழியுடன் விளக்க வேண்டும்.
tr: Her zaman **kendinizi kullanıcının yerine koymak** için çaba gösterin. Bir şeyi iyice anladığımızda, o şey bizim için açık hale gelir. Yeni gelen biriyle ilgili ayrıntıları düşünmekte başarısız olabiliriz, ancak **iyi belgeler kullanıcılarla oldukları yerde buluşur**. Her bir özelliğin yeteneklerini ya da kullanım amaçlarını mümkün olan en anlaşılır dille açıklamalıyız.
uk: Завжди намагайтеся **поставити себе на місце користувача**. Коли ми щось розуміємо досконально, це стає для нас очевидним. Ми можемо не думати про деталі, які стосуються новачка, але **хороша документація зустрічає користувачів там, де вони є**. Ми повинні пояснити можливості чи призначення кожної функції максимально простою мовою.
zh_tw: 務必**設想自己是使用者**。當我們對某事物已非常熟悉時，很多細節就會變得理所當然，但有些新手未必能理解。**優良的說明文件應該從使用者角度出發**，並以最直白的語言說明每個功能的用途與適用情境。

source: Try to remember what you first needed to know when learning about the feature or concept. What new terms did you need to learn? What confused you? What was the hardest to grasp? You will want users to review your work, and we recommend you practice explaining the feature before writing about it.
ga: Déan iarracht cuimhneamh ar na rudaí a theastaigh uait ar dtús agus tú ag foghlaim faoin ngné nó faoin gcoincheap. Cad iad na téarmaí nua a bhí uait a fhoghlaim? Cad a chuir mearbhall ort? Cad é ba dheacra a thuiscint? Beidh tú ag iarraidh ar úsáideoirí do chuid oibre a athbhreithniú, agus molaimid duit cleachtadh a dhéanamh ar an ngné a mhíniú sula scríobhann tú faoi.
ja: その機能やコンセプトについて学ぶとき、最初に何を知る必要があったかを思い出してみてください。どんな新しい用語を覚える必要がありましたか？ 何に戸惑いましたか？ 何を理解するのが一番難しかったですか？ 自分の仕事をユーザーにレビューしてもらいたいでしょうから、まずその機能について書く前に説明の練習をすることをお勧めします。
ta: நற்பொருத்தம் அல்லது கருத்தைப் பற்றி அறியும்போது நீங்கள் முதலில் தெரிந்து கொள்ள வேண்டியதை நினைவில் கொள்ள முயற்சிக்கவும். நீங்கள் என்ன புதிய சொற்களைக் கற்றுக்கொள்ள வேண்டும்? உங்களுக்கு என்ன குழப்பம்? புரிந்துகொள்வது கடினம் எது? பயனர்கள் உங்கள் வேலையை மதிப்பாய்வு செய்ய விரும்புவீர்கள், மேலும் அம்சத்தைப் பற்றி எழுதுவதற்கு முன்பு அதை விளக்கும் பயிற்சி பரிந்துரைக்கிறோம்.
tr: Özellik veya kavram hakkında bilgi edinirken ilk olarak neyi bilmeniz gerektiğini hatırlamaya çalışın. Hangi yeni terimleri öğrenmeniz gerekiyordu? Kafanızı karıştıran neydi? Kavraması en zor olan neydi? Kullanıcıların çalışmanızı incelemesini isteyeceksiniz ve bu konuda yazmadan önce özelliği açıklama alıştırması yapmanızı öneririz.
uk: Завжди намагайтеся **поставити себе на місце користувача**. Коли ми щось розуміємо досконально, це стає для нас очевидним. Ми можемо не думати про деталі, які стосуються новачка, але **хороша документація зустрічає користувачів там, де вони є**. Ми повинні пояснити можливості чи призначення кожної функції максимально простою мовою.
zh_tw: 請回想你初次學習某個功能或概念時，最需要先瞭解什麼？有沒有遇到不懂的術語？哪裡讓你困惑？又是哪些地方最難掌握？你會希望有其他使用者檢閱你的內容。我們建議你在動筆前，先練習口頭解釋這個功能。

source: Programming fundamentals are a prerequisite for using a complex engine like Godot. Talking about variables, functions, or classes is acceptable. But we should favor plain language over specific terminology like "metaprogramming". If you need to use precise terms, be sure to define them.
ga: Is réamhriachtanas iad buneilimintí cláraithe chun inneall casta mar Godot a úsáid. Tá sé inghlactha labhairt faoi athróga, feidhmeanna nó ranganna. Ach ba cheart dúinn i bhfabhar teanga shimplí seachas téarmaíocht shonrach cosúil le “metaprogramming”. Más gá duit téarmaí beachta a úsáid, bí cinnte iad a shainiú.
it: I fondamenti della programmazione sono un prerequisito per utilizzare un motore complesso come Godot. Parlare di variabili, funzioni o classi è accettabile. Ma dovremmo preferire un linguaggio semplice, anziché una terminologia specifica come "meta-programmazione". Se si devono usare termini precisi, assicurarsi di definirli.
ja: プログラミングの基礎は、Godotのような複雑なエンジンを使うための前提条件です。変数や関数、クラスについて話すのは構いません。しかし、 " メタプログラミング " のような特殊な用語よりも、平易な言葉を優先するべきです。もし正確な用語を使う必要があるなら、必ず用語の定義をしてください。
ta: கோடோட் போன்ற சிக்கலான இயந்திரத்தைப் பயன்படுத்துவதற்கான ஒரு முன்நிபந்தனை நிரலாக்க அடிப்படைகள். மாறிகள், செயல்பாடுகள் அல்லது வகுப்புகள் பற்றி பேசுவது ஏற்றுக்கொள்ளத்தக்கது. ஆனால் "மெட்டாபிரோகிராமிங்" போன்ற குறிப்பிட்ட சொற்களஞ்சியத்தின் மீது நாம் எளிய மொழியை ஆதரிக்க வேண்டும். நீங்கள் துல்லியமான சொற்களைப் பயன்படுத்த வேண்டும் என்றால், அவற்றை வரையறுக்க மறக்காதீர்கள்.
tr: Programlama temelleri, Godot gibi karmaşık bir motoru kullanmak için bir ön koşuldur. Değişkenler, fonksiyonlar veya sınıflar hakkında konuşmak kabul edilebilir. Ancak "metaprogramlama" gibi özel terminoloji yerine sade bir dili tercih etmeliyiz. Kesin terimler kullanmanız gerekiyorsa, bunları tanımladığınızdan emin olun.
uk: Основи програмування є необхідною умовою для використання такого складного механізму, як Godot. Розмова про змінні, функції чи класи прийнятна. Але ми повинні віддавати перевагу простій мові, а не специфічній термінології, як-от «метапрограмування». Якщо вам потрібно використовувати точні терміни, обов’язково дайте їм визначення.
zh_tw: 具備程式設計基礎是使用 Godot 這類複雜引擎的前提。討論變數、函式、類別等是可以的，但比起「元程式設計」這類專有術語，更應優先使用平實的語言。如果必須用到嚴格定義的術語，請務必給予解釋。
