Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/docs_contribution_checklist.po
Languages: fr, uk, zh_cn

source: Documentation contribution checklist
uk: Контрольний список для надання документації

source: This page is a summary of the guidelines to follow when contributing to the documentation. Before you press that **Create pull request** button on GitHub, read over this list to double check if you missed anything.
uk: Ця сторінка містить короткий виклад інструкцій, яких слід дотримуватися під час створення документації. Перш ніж натиснути кнопку **Створити запит на внесення змін** на GitHub, перегляньте цей список, щоб перевірити, чи не пропустили ви щось.

source: You don't need to read all the guidelines here in order to start contributing. If you do miss something, it will be pointed out during review. However, following the guidelines you are aware of as best you can will help speed up the review process.
uk: Вам не потрібно читати всі інструкції тут, щоб почати робити внесок. Якщо ви щось пропустите, на це буде вказано під час перевірки. Однак, дотримання інструкцій, з якими ви знайомі, якомога краще допоможе пришвидшити процес перевірки.

source: Writing style
fr: Style d'écriture
uk: Стиль написання
zh_cn: 写作风格

source: Use the active voice.
uk: Використовуйте активний стан.
zh_cn: 使用陈述句型。

source: Use precise action verbs.
fr: Utilisez des verbes d'action précis.
uk: Використовуйте дієслова, що точно описують дії.
zh_cn: 使用精确的动作动词。

source: Avoid verbs that end in -ing.
fr: Évitez les verbes qui se terminent par -ing.
uk: Уникайте дієслів, що закінчуються на -ing.
zh_cn: 避免以 -ing 结尾的动词。

source: Remove unnecessary adverbs and adjectives.
fr: Supprimer les adverbes et adjectifs inutiles.
uk: Вилучайте непотрібні прикметники і прислівники.
zh_cn: 删除不必要的副词和形容词。

source: Ban these 8 words: obvious, simple, basic, easy, actual, just, clear, and however.
fr: Interdisez ces 8 mots : évident, simple, basique, facile, réel, juste, clair, et cependant.
uk: Забороніть ці 8 слів: очевидний, простий, базовий, легкий, фактичний, справедливий, зрозумілий та однак.
zh_cn: 禁止这 8 个词：obvious（显然）、simple（简单）、basic（基本）、easy（容易）、actual（实际）、just（仅仅）、clear（明显）、however（然而）。

source: Use explicit references.
fr: Utilisez des références explicites.
uk: Використовуйте явні посилання.
zh_cn: 使用显式引用。

source: Use 's to show possession.
fr: Utilisez 's ("de" en français) pour montrer la possession.
uk: Використовуйте 's', щоб показати володіння.
zh_cn: 使用“'s”表示所有权。

source: Use the Oxford comma.
fr: Utilisez la virgule d'Oxford (en anglais).
uk: Використовуйте кому Оксфорда.
zh_cn: 使用牛津逗号。

source: Code examples
fr: Exemples de code
uk: Приклади коду
zh_cn: 代码示例

source: Use dynamic typing. :ref:`See here. <doc_docs_writing_guidelines_dynamic_typing>`
fr: Utilisez le typage dynamique. :ref:`Voir ici. <doc_docs_writing_guidelines_dynamic_typing>`
uk: Використовуйте динамічну типізацію. :ref:`See here. <doc_docs_writing_guidelines_dynamic_typing>`
zh_cn: 使用动态类型。:ref:`See here. <doc_docs_writing_guidelines_dynamic_typing>`

source: Use real, practical examples. Avoid ``foo`` / ``bar`` examples. :ref:`See here. <doc_docs_writing_guidelines_real_world_code_example>`
fr: Utilisez des exemples concrets et concrets. Évitez les exemples avec ``foo``/``bar``/``toto``/``tata``. :ref:`Voir ici. <doc_docs_writing_guidelines_real_world_code_example>`
uk: Використовуйте реальні, практичні приклади. Уникайте прикладів типу ``foo`` / ``bar``. :ref:`See here. <doc_docs_writing_guidelines_real_world_code_example>`
zh_cn: 使用真实可行的示例。避免使用 ``foo`` / ``bar`` 这类示例。:ref:`See here. <doc_docs_writing_guidelines_real_world_code_example>`

source: Manual style and formatting
uk: Ручний стиль та форматування

source: Use common vocabulary for the editor interface. :ref:`See here. <doc_docs_writing_guidelines_common_vocabulary>`
uk: Використовуйте загальноприйняту термінологію для інтерфейсу редактора. :ref:`See here. <doc_docs_writing_guidelines_common_vocabulary>`
zh_cn: 使用编辑器界面的通用术语。:ref:`See here. <doc_docs_writing_guidelines_common_vocabulary>`

source: Use ``:kbd:`` for keyboard shortcuts. :ref:`See here. <doc_docs_writing_guidelines_keyboard_shortcuts>`
uk: Використовуйте ``:kbd:`` для комбінацій клавіш. :ref:`See here. <doc_docs_writing_guidelines_keyboard_shortcuts>`
zh_cn: 使用 ``:kbd:`` 标记键盘快捷键。:ref:`See here. <doc_docs_writing_guidelines_keyboard_shortcuts>`

source: Literals use ``code style``. :ref:`See here. <doc_docs_writing_guidelines_literals>`
uk: Літерали використовують ``code style``. :ref:`See here. <doc_docs_writing_guidelines_literals>`
zh_cn: 字面量使用 ``代码样式`` 标记。:ref:`See here. <doc_docs_writing_guidelines_literals>`

source: Classes link to the class reference once, then use ``ClassName`` for the rest of the page. Methods and properties link to the class ref once, then use ``PropertyName`` for the rest of the page. :ref:`See here. <doc_docs_writing_guidelines_class_properties_methods>`
uk: Класи посилаються на посилання класу один раз, а потім використовують ``ClassName`` для решти сторінки. Методи та властивості посилаються на посилання класу один раз, а потім використовують ``PropertyName`` для решти сторінки. :ref:`See here. <doc_docs_writing_guidelines_class_properties_methods>`

source: Editor UI, like menus, windows, and editor navigation paths, use ``Bold Style``. :ref:`See here. <doc_docs_writing_guidelines_editor_ui>`
uk: Інтерфейс редактора, такий як меню, вікна та шляхи навігації редактора, використовує ``Bold Style``. :ref:`See here. <doc_docs_writing_guidelines_editor_ui>`

source: Link to project settings when referencing them. :ref:`See here. <doc_docs_writing_guidelines_project_settings>`
uk: Посилання на налаштування проекту під час посилання на них. :ref:`See here. <doc_docs_writing_guidelines_project_settings>`

source: Text is manually wrapped to 80-100 characters. :ref:`See here. <doc_docs_writing_guidelines_manually_wrapping_lines>`
uk: Текст вручну переноситься до 80-100 символів. :ref:`See here. <doc_docs_writing_guidelines_manually_wrapping_lines>`

source: No trailing whitespace at the end of lines.
uk: Без пробілів у кінці рядків.

source: Most of the time, avoid mentioning a specific Godot version. :ref:`See here. <doc_docs_writing_guidelines_specific_version>`
uk: Здебільшого уникайте згадування конкретної версії Godot. :ref:`See here. <doc_docs_writing_guidelines_specific_version>`

source: Images and videos
fr: Images et vidéos
uk: Зображення та відео

source: New (and updated) images are in WebP format. :ref:`See here. <doc_docs_image_guidelines_format_conversion>`
uk: Нові (та оновлені) зображення у форматі WebP. :ref:`See here. <doc_docs_image_guidelines_format_conversion>`

source: Editor screenshots are cropped. :ref:`See here. <doc_docs_image_guidelines_cropping>`
uk: Знімки екрана редактора обрізані. :ref:`See here. <doc_docs_image_guidelines_cropping>`

source: Images larger than 1080p or 300kb are scaled down. :ref:`See here. <doc_docs_image_guidelines_scaling_down>`
uk: Зображення, більші за 1080p або 300 КБ, зменшуються. :ref:`See here. <doc_docs_image_guidelines_scaling_down>`

source: Outlines in images use ``fffb44`` yellow. :ref:`See here. <doc_docs_image_guidelines_outlines>`
uk: Контури на зображеннях використовують жовтий колір ``fffb44``. :ref:`See here. <doc_docs_image_guidelines_outlines>`

source: Videos use the ``:autoplay:``, ``:loop:``, and ``:muted:`` tags. :ref:`See here. <doc_docs_image_guidelines_videos>`
uk: У відео використовуються теги ``:autoplay:``, ``:loop:`` та ``:muted:``. :ref:`See here. <doc_docs_image_guidelines_videos>`

source: The PR title starts with a word like ``Fix``, ``Add``, ``Update``, ``Clarify``, or ``Improve``.
fr: Le titre de la PR commence par un mot comme ``Fix``, ``Add``, ``Update``, ``Clarify``, ou ``Improve``.
uk: Заголовок PR починається зі слова на кшталт ``Fix``, ``Add``, ``Update``, ``Clarify``, або ``Improve``.
zh_cn: PR 标题需以 ``Fix``\ 、\ ``Add``\ 、\ ``Update``\ 、\ ``Clarify``\ 、\ ``Improve`` 等单词开头。

source: If the PR closes an issue, link to the issue with one of GitHub's `keywords <https://docs.github.com/en/get-started/writing-on-github/working-with-advanced-formatting/using-keywords-in-issues-and-pull-requests>`__: ``closes``, ``fixes``, or ``resolves``, in the text of the PR.
uk: Якщо запит на перевірку закриває проблему, додайте посилання на проблему за допомогою одного з ключових слів GitHub <https://docs.github.com/en/get-started/writing-on-github/working-with-advanced-formatting/using-keywords-in-issues-and-pull-requests>`__: ``closes``, ``fixes`` або ``resolves`` у тексті запиту на перевірку.
zh_cn: 如果 PR 能够关闭 Issue，请在 PR 的文本中使用 GitHub 的 ``closes``\ 、\ ``fixes``\ 、\ ``resolves`` 等\ `关键字 <https://docs.github.com/en/get-started/writing-on-github/working-with-advanced-formatting/using-keywords-in-issues-and-pull-requests>`__\ 链接到该 Issue。

source: Ideally, PR contains a single commit. However, multiple commits can be :ref:`squashed <doc_pr_workflow_rebase>` later.
uk: В ідеалі, PR містить один коміт. Однак, кілька комітів можна :ref:`squashed <doc_pr_workflow_rebase>` пізніше.
zh_cn: 理想情况下一个 PR 只应包含一个提交。不过多个提交可以后续再\ :ref:`压缩成一个 <doc_pr_workflow_rebase>`\ 。

source: :ref:`See here. <doc_docs_writing_guidelines_clear_english_rules>`
zh_cn: :ref:`见此处。 <doc_docs_writing_guidelines_clear_english_rules>`
