Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/godot_design_philosophy.po
Languages: ga, ta

source: Please watch `Godot explained in 7 minutes <https://www.youtube.com/watch?v=yS9cuu5o5Ug>`_ if you're looking for an overview of the engine's features.
ta: தயவுசெய்து `கோடோட் 7 நிமிடங்களில் விளக்கப்பட்டுள்ளார் <https://www.youtube.com/watch?v=ys9cuu5o5ug>` _ இயந்திரத்தின் அம்சங்களின் கண்ணோட்டத்தை நீங்கள் தேடுகிறீர்கள் என்றால்.
