Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/godot_design_philosophy.po
Languages: ga, ta

source: Godot's design philosophy
ga: Fealsúnacht dearaidh Godot
ta: கோடோட்டின் வடிவமைப்பு உண்மை

source: Now that you've gotten your feet wet, let's talk about Godot's design.
ga: Anois go bhfuil tú gotten do chosa fliuch, a ligean ar labhairt faoi dhearadh Godot ar.
ta: இப்போது நீங்கள் உங்கள் கால்களை ஈரமாகப் பெற்றுள்ளீர்கள், கோடோட்டின் வடிவமைப்பைப் பற்றி பேசலாம்.

source: **Every game engine is different and fits different needs.** Not only do they offer a range of features, but the design of each engine is unique. This leads to different workflows and different ways to form your games' structures. This all stems from their respective design philosophies.
ga: ** Tá gach inneall cluiche difriúil agus oireann sé do riachtanais éagsúla.** Ní hamháin go dtugann siad réimse gnéithe, ach tá dearadh gach innill uathúil. Mar thoradh air seo tá sreafaí oibre éagsúla agus bealaí éagsúla chun struchtúir do chluichí a fhoirmiú. Eascraíonn sé seo go léir as a gcuid fealsúnachtaí dearaidh faoi seach.
ta: ** ஒவ்வொரு விளையாட்டு இயந்திரமும் வேறுபட்டது மற்றும் வெவ்வேறு தேவைகளுக்கு பொருந்துகிறது. ** அவை பலவிதமான அம்சங்களை வழங்குவது மட்டுமல்லாமல், ஒவ்வொரு இயந்திரத்தின் வடிவமைப்பும் தனித்துவமானது. இது உங்கள் விளையாட்டுகளின் கட்டமைப்புகளை உருவாக்க வெவ்வேறு பணிப்பாய்வுகளுக்கும் வெவ்வேறு வழிகளுக்கும் வழிவகுக்கிறது. இவை அனைத்தும் அந்தந்த வடிவமைப்பு தத்துவங்களிலிருந்து உருவாகின்றன.

source: This page is here to help you understand how Godot works, starting with some of its core pillars. It is not a list of available features, nor is it an engine comparison. To know if any engine can be a good fit for your project, you need to try it out for yourself and understand its design and limitations.
ga: Tá an leathanach seo anseo chun cabhrú leat tuiscint a fháil ar an gcaoi a n-oibríonn Godot, ag tosú le cuid dá cholúin lárnacha. Ní liosta de na gnéithe atá ar fáil é, ná ní comparáid innill é. Chun a fháil amach an féidir le haon inneall a bheith oiriúnach go maith le do thionscadal, ní mór duit triail a bhaint as duit féin agus a dhearadh agus a theorainneacha a thuiscint.
ta: கோடோட் அதன் சில முக்கிய தூண்களில் தொடங்கி, கோடோட் எவ்வாறு செயல்படுகிறது என்பதைப் புரிந்துகொள்ள இந்த பக்கம் இங்கே உள்ளது. இது கிடைக்கக்கூடிய அம்சங்களின் பட்டியல் அல்ல, இது ஒரு இயந்திர ஒப்பீடு அல்ல. எந்தவொரு இயந்திரமும் உங்கள் திட்டத்திற்கு ஒரு நல்ல பொருத்தமாக இருக்க முடியுமா என்பதை அறிய, நீங்கள் அதை நீங்களே முயற்சி செய்து அதன் வடிவமைப்பு மற்றும் வரம்புகளைப் புரிந்து கொள்ள வேண்டும்.

source: Object-oriented design and composition
ga: Dearadh agus comhdhéanamh atá dírithe ar oibiachtaí
ta: பொருள் சார்ந்த வடிவமைப்பு மற்றும் கலவை

source: Godot embraces object-oriented design at its core with its flexible scene system and Node hierarchy. It tries to stay away from strict programming patterns to offer an intuitive way to structure your game.
ga: Cuimsíonn Godot dearadh atá dírithe ar oibiachtaí ina chroílár lena chóras radhairc solúbtha agus ordlathas Nód. Déanann sé iarracht fanacht ar shiúl ó phatrúin cláir dian a thairiscint ar bhealach iomasach chun struchtúr do chluiche.
ta: கோடோட் அதன் நெகிழ்வான காட்சி அமைப்பு மற்றும் முனை வரிசைமுறையுடன் அதன் மையத்தில் பொருள் சார்ந்த வடிவமைப்பைத் தழுவுகிறது. இது உங்கள் விளையாட்டை கட்டமைக்க ஒரு உள்ளுணர்வு வழியை வழங்க கடுமையான நிரலாக்க முறைகளிலிருந்து விலகி இருக்க முயற்சிக்கிறது.

source: For one, Godot lets you **compose or aggregate** scenes. It's like nested prefabs: you can create a BlinkingLight scene and a BrokenLantern scene that uses the BlinkingLight. Then, create a city filled with BrokenLanterns. Change the BlinkingLight's color, save, and all the BrokenLanterns in the city will update instantly.
ga: I gcás amháin, ligeann Godot duit ** radhairc a chumadh nó a chomhiomlánú **. Tá sé cosúil le prefabs neadaithe: is féidir leat radharc BlinkingLight agus radharc BrokenLantern a chruthú a úsáideann an BlinkingLight. Ansin, cruthaigh cathair atá líonta le BrokenLanterns. Athraigh dath BlinkingLight, sábháil, agus nuashonróidh na BrokenLanterns go léir sa chathair láithreach.
ta: ஒன்று, கோடோட் உங்களை அனுமதிக்கிறது ** இசையமைக்க அல்லது திரட்ட ** காட்சிகள். இது உள்ளமைக்கப்பட்ட முன்னுரிமைகள் போன்றது: நீங்கள் ஒரு ஒளிரும் விளக்கு காட்சியையும், ஒளிரும் விளக்கைப் பயன்படுத்தும் உடைந்த காட்சியையும் உருவாக்கலாம். பின்னர், உடைந்த நிலப்பரப்புகளால் நிரப்பப்பட்ட ஒரு நகரத்தை உருவாக்கவும். ஒளிரும் விளக்கின் நிறத்தை மாற்றவும், சேமிக்கவும், நகரத்தில் உள்ள அனைத்து உடைந்த லாண்டெர்ன்களும் உடனடியாக புதுப்பிக்கப்படும்.

source: On top of that, you can **inherit** from any scene.
ga: Ar a bharr sin, is féidir leat **oidhreacht** a fháil ó radharc ar bith.
ta: அதற்கு மேல், நீங்கள் எந்த காட்சியிலிருந்தும் ** மரபுரிமையாக ** முடியும்.

source: A Godot scene could be a Weapon, a Character, an Item, a Door, a Level, part of a level… anything you'd like. It works like a class in pure code, except you're free to design it by using the editor, using only the code, or mixing and matching the two.
ga: D'fhéadfadh radharc Godot a bheith ina Arm, Carachtar, Mír, Doras, Leibhéal, cuid de leibhéal ... rud ar bith ba mhaith leat. Oibríonn sé cosúil le rang i gcód íon, ach amháin go bhfuil tú saor chun é a dhearadh trí úsáid a bhaint as an eagarthóir, ag baint úsáide as ach an cód, nó a mheascadh agus a mheaitseáil leis an dá.
ta: ஒரு கோடோட் காட்சி ஒரு கருவி, ஒரு பாத்திரம், ஒரு பொருள், ஒரு கதவு, ஒரு நிலை, ஒரு மட்டத்தின் ஒரு பகுதி… நீங்கள் விரும்பும் எதையும் இருக்கலாம். இது தூய குறியீட்டில் ஒரு வகுப்பைப் போல வேலை செய்கிறது, தவிர, எடிட்டரைப் பயன்படுத்துவதன் மூலமும், குறியீட்டை மட்டுமே பயன்படுத்துவதன் மூலமும், அல்லது இரண்டையும் கலந்து பொருத்துவதன் மூலமும் அதை வடிவமைக்க நீங்கள் சுதந்திரமாக இருக்கிறீர்கள்.

source: It's different from prefabs you find in several 3D engines, as you can then inherit from and extend those scenes. You may create a Magician that extends your Character. Modify the Character in the editor and the Magician will update as well. It helps you build your projects so that their structure matches the game's design.
ga: Tá sé difriúil ó prefabs a fhaigheann tú i roinnt inneall 3D, mar is féidir leat oidhreacht a fháil ansin ó na radhairc sin agus iad a leathnú. Is féidir leat a chruthú Magician a leathnaíonn do Charachtar. Athraigh an Carachtar san eagarthóir agus beidh an Magician cothrom le dáta chomh maith. Cuidíonn sé leat do thionscadail a thógáil ionas go mbeidh a struchtúr comhoiriúnach do dhearadh an chluiche.
ta: இது பல 3 டி என்சின்களில் நீங்கள் காணும் Prefabs இலிருந்து வேறுபட்டது, ஏனெனில் நீங்கள் அந்த காட்சிகளை மரபுரிமையாகவும் நீட்டிக்கவும் முடியும். உங்கள் பாத்திரத்தை நீட்டிக்கும் ஒரு மந்திரவாதியை நீங்கள் உருவாக்கலாம். எடிட்டரில் உள்ள தன்மையை மாற்றவும், மந்திரவாதியும் புதுப்பிப்பார். இது உங்கள் திட்டங்களை உருவாக்க உதவுகிறது, இதனால் அவற்றின் அமைப்பு விளையாட்டின் வடிவமைப்போடு பொருந்துகிறது.

source: |image0|
ga: |íomhá0|
ta: | படம் 0 |

source: image0
ga: íomhá0
ta: படம் 0

source: Also note that Godot offers many different types of objects called nodes, each with a specific purpose. Nodes are part of a tree and always inherit from their parents up to the Node class. Although the engine does feature some nodes like collision shapes that a parent physics body will use, most nodes work independently from one another.
ga: Tabhair faoi deara freisin go dtugann Godot go leor cineálacha éagsúla rudaí ar a dtugtar nóid, gach ceann acu le cuspóir ar leith. Tá nóid mar chuid de chrann agus bíonn siad i gcónaí mar oidhreacht óna dtuismitheoirí suas go dtí an rang Nód. Cé go bhfuil roinnt nóid san inneall cosúil le cruthanna imbhuailte a úsáidfidh comhlacht fisice tuismitheoirí, oibríonn an chuid is mó de na nóid go neamhspleách óna chéile.
ta: கோடோட் முனைகள் எனப்படும் பல வகையான பொருட்களை வழங்குகிறது என்பதையும் நினைவில் கொள்க, ஒவ்வொன்றும் ஒரு குறிப்பிட்ட நோக்கத்துடன். முனைகள் ஒரு மரத்தின் ஒரு பகுதியாகும், எப்போதும் பெற்றோரிடமிருந்து முனை வகுப்பு வரை பெறப்படுகின்றன. பெற்றோர் இயற்பியல் உடல் பயன்படுத்தும் மோதல் வடிவங்கள் போன்ற சில முனைகளைக் கொண்டிருந்தாலும், பெரும்பாலான முனைகள் ஒருவருக்கொருவர் சுயாதீனமாக செயல்படுகின்றன.

source: In other words, Godot's nodes do not work like components in some other game engines.
ga: I bhfocail eile, ní oibríonn nóid Godot cosúil le comhpháirteanna i roinnt inneall cluiche eile.
ta: வேறு வார்த்தைகளில் கூறுவதானால், கோடோட்டின் முனைகள் வேறு சில விளையாட்டு இயந்திரங்களில் கூறுகளைப் போல செயல்படாது.

source: |image1|
ga: |íomhá1|
ta: | படம் 1 |

source: image1
ga: íomhá 1
ta: படம் 1

source: Sprite2D is a Node2D, a CanvasItem and a Node. It has all the properties and features of its three parent classes, like transforms or the ability to draw custom shapes and render with a custom shader.
ga: Is Node2D é Sprite2D, CanvasItem agus Nód. Tá airíonna agus gnéithe uile a trí mháthair-aicme aige, cosúil le claochluithe nó an cumas cruthanna saincheaptha a tharraingt agus a rindreáil le scáthóir saincheaptha.
ta: SPRITE2D என்பது ஒரு Node2D, ஒரு கேன்வாசிட்டெம் மற்றும் ஒரு முனை. இது அதன் மூன்று பெற்றோர் வகுப்புகளின் அனைத்து பண்புகளையும் அம்சங்களையும் கொண்டுள்ளது, இது உருமாற்றங்கள் அல்லது தனிப்பயன் வடிவங்களை வரைந்து தனிப்பயன் சேடருடன் வழங்கும் திறன் போன்றவை.

source: All-inclusive package
ga: Pacáiste uilechuimsitheach
ta: அனைத்தையும் உள்ளடக்கிய தொகுப்பு

source: Godot tries to provide its own tools to answer most common needs. It has a dedicated scripting workspace, an animation editor, a tilemap editor, a shader editor, a debugger, a profiler, the ability to hot-reload locally and on remote devices, etc.
ga: Déanann Godot iarracht a chuid uirlisí féin a sholáthar chun na riachtanais is coitianta a fhreagairt. Tá spás oibre scriptithe tiomnaithe aige, eagarthóir beochana, eagarthóir tilemap, eagarthóir shader, dífhabhtóir, próifíleoir, an cumas athlódáil te go háitiúil agus ar ghléasanna iargúlta, etc.
ta: மிகவும் பொதுவான தேவைகளுக்கு பதிலளிக்க கோடோட் தனது சொந்த கருவிகளை வழங்க முயற்சிக்கிறார். இது ஒரு பிரத்யேக ச்கிரிப்டிங் பணியிடத்தைக் கொண்டுள்ளது, அனிமேசன் எடிட்டர், ஒரு டிலேமேப் எடிட்டர், சேடர் எடிட்டர், ஒரு பிழைத்திருத்தம், ஒரு விவரக்குறிப்பு, உள்நாட்டிலும் தொலைதூர சாதனங்களிலும் சூடாக மறு ஏற்றுக்கொள்ளும் திறன் ஆகியவற்றைக் கொண்டுள்ளது.

source: |image2|
ga: |íomhá2|
ta: | படம் 2 |

source: image2
ga: íomhá 2
ta: படம் 2

source: The goal is to offer a full package to create games and a continuous user experience. You can still work with external programs as long as there is an import plugin available in Godot for it. Or you can create one, like the `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
ga: Is é an sprioc pacáiste iomlán a thairiscint chun cluichí agus taithí úsáideora leanúnach a chruthú. Is féidir leat oibriú le cláir sheachtracha fós chomh fada agus go bhfuil breiseán iompórtála ar fáil in Godot dó. Nó is féidir leat ceann a chruthú, cosúil leis an `Importer Map Tílithe <https://github.com/vnen/godot-tiled-importer>`__.

source: That is also partly why Godot offers its own programming language GDScript along with C#. GDScript is designed for the needs of game developers and game designers, and is tightly integrated in the engine and the editor.
ga: Sin é an fáth freisin go dtugann Godot a theanga ríomhchlárúcháin féin GDScript in éineacht le C#. Tá GDScript deartha do riachtanais na bhforbróirí cluiche agus dearthóirí cluiche, agus tá sé comhtháite go docht san inneall agus san eagarthóir.
ta: கோடோட் அதன் சொந்த நிரலாக்க மொழியை சி#உடன் மற்றும் சி#உடன் வழங்குகிறது. GDSCRIPT விளையாட்டு உருவாக்குநர்கள் மற்றும் விளையாட்டு வடிவமைப்பாளர்களின் தேவைகளுக்காக வடிவமைக்கப்பட்டுள்ளது, மேலும் இது இயந்திரம் மற்றும் எடிட்டரில் இறுக்கமாக ஒருங்கிணைக்கப்பட்டுள்ளது.

source: GDScript lets you write code using an indentation-based syntax, yet it detects types and offers a static language's quality of auto-completion. It is also optimized for gameplay code with built-in types like Vectors and Colors.
ga: Ligeann GDScript duit cód a scríobh ag baint úsáide as comhréir bunaithe ar eangú, ach braitheann sé cineálacha agus cuireann sé caighdeán uathoibríoch teanga statach ar fáil. Tá sé optamaithe freisin le haghaidh cód gameplay le cineálacha tógtha i cosúil le Veicteoirí agus Dathanna.
ta: உள்தள்ளல் அடிப்படையிலான தொடரியல் பயன்படுத்தி குறியீட்டை எழுத GDSCRIPT உங்களை அனுமதிக்கிறது, இருப்பினும் இது வகைகளைக் கண்டறிந்து நிலையான மொழியின் தானாக முடக்குவதற்கான தரத்தை வழங்குகிறது. திசையன்கள் மற்றும் வண்ணங்கள் போன்ற உள்ளமைக்கப்பட்ட வகைகளைக் கொண்ட விளையாட்டு குறியீட்டிற்கும் இது உகந்ததாகும்.

source: Note that with GDExtension, you can write high-performance code using compiled languages like C, C++, Rust, D, Haxe, or Swift without recompiling the engine.
ga: Tabhair faoi deara, le GDExtension, is féidir leat cód ardfheidhmíochta a scríobh ag baint úsáide as teangacha tiomsaithe cosúil le C, C ++, Rust, D, Haxe, nó Swift gan an t-inneall a athchríochnú.
ta: Gdextension உடன், சி, சி ++, ரச்ட், டி, ஆக்ச் அல்லது ச்விஃப்ட் போன்ற தொகுக்கப்பட்ட மொழிகளைப் பயன்படுத்தி உயர் செயல்திறன் குறியீட்டை எழுதலாம் என்பதை நினைவில் கொள்க.

source: Note that the 3D workspace doesn't feature as many tools as the 2D workspace. You'll need external programs or add-ons to edit terrains, animate complex characters, and so on. Godot provides a complete API to extend the editor's functionality using game code. See `The Godot editor is a Godot game`_ below.
ga: Tabhair faoi deara nach bhfuil an oiread uirlisí sa spás oibre 3D agus atá sa spás oibre 2D. Beidh cláir sheachtracha nó breiseáin de dhíth ort chun tír-raonta a chur in eagar, carachtair chasta a bheochan, agus mar sin de. Soláthraíonn Godot API iomlán chun feidhmiúlacht an eagarthóra a leathnú ag baint úsáide as cód cluiche. Féach 'Is cluiche Godot é eagarthóir Godot'_ thíos.
ta: 3D பணியிடத்தில் 2 டி பணியிடத்தைப் போல பல கருவிகள் இடம்பெறவில்லை என்பதை நினைவில் கொள்க. நிலப்பரப்புகளைத் திருத்தவும், சிக்கலான எழுத்துக்களை உயிரூட்டவும் உங்களுக்கு வெளிப்புற நிரல்கள் அல்லது துணை நிரல்கள் தேவை. விளையாட்டுக் குறியீட்டைப் பயன்படுத்தி எடிட்டரின் செயல்பாட்டை நீட்டிக்க கோடோட் ஒரு முழுமையான பநிஇ வழங்குகிறது. `கோடோட் எடிட்டர் ஒரு கோடோட் விளையாட்டு`_ கீழே காண்க.

source: |image4|
ga: |íomhá4|

source: image4
ga: íomhá 4

source: *A State Machine editor plugin in Godot 2 by kubecz3k. It lets you manage states and transitions visually.*
ga: * Breiseán eagarthóir Meaisín Stáit i Godot 2 ag kubecz3k. Ligeann sé duit stáit agus aistrithe a bhainistiú go físiúil.*

source: Open source
ga: Foinse oscailte
ta: திறந்த மூல

source: Godot offers a fully open source codebase under the **MIT license**. This means all the technologies that ship with it have to be Free (as in freedom) as well. For the most part, they're developed from the ground up by contributors.
ga: Cuireann Godot codebase foinse oscailte go hiomlán ar fáil faoin gceadúnas **MIT **. Ciallaíonn sé seo go gcaithfidh na teicneolaíochtaí go léir a long leis a bheith Saor (mar atá sa tsaoirse) chomh maith. Den chuid is mó, tá siad forbartha ón talamh suas ag ranníocóirí.

source: Anyone can plug in proprietary tools for the needs of their projects — they just won't ship with the engine. This may include Google AdMob, or FMOD. Any of these can come as third-party plugins instead.
ga: Is féidir le duine ar bith uirlisí dílseánaigh a phlugáil isteach le haghaidh riachtanais a dtionscadal - ní bheidh siad ag long leis an inneall. D'fhéadfadh Google AdMob, nó FMOD a bheith i gceist leis seo. Is féidir le haon cheann díobh seo teacht mar bhreiseáin tríú páirtí ina ionad.
ta: எவரும் தங்கள் திட்டங்களின் தேவைகளுக்காக தனியுரிம கருவிகளை செருகலாம் - அவை இயந்திரத்துடன் அனுப்பாது. இதில் கூகிள் அட்மோப் அல்லது எஃப்.எம்.ஓ.டி இருக்கலாம். இவற்றில் ஏதேனும் அதற்கு பதிலாக மூன்றாம் தரப்பு செருகுநிரல்களாக வரலாம்.

source: On the other hand, an open codebase means you can **learn from and extend the engine** to your heart's content. You can also debug games easily, as Godot will print errors with a stack trace, even if they come from the engine itself.
ga: Ar an láimh eile, ciallaíonn codebase oscailte gur féidir leat **foghlaim ón inneall ** agus é a leathnú chuig ábhar do chroí. Is féidir leat cluichí dífhabhtaithe go héasca freisin, mar go ndéanfaidh Godot earráidí a phriontáil le rian cruach, fiú má thagann siad ón inneall féin.
ta: மறுபுறம், ஒரு திறந்த கோட்பேச் என்றால் நீங்கள் ** கற்றுக் கொள்ளலாம் மற்றும் இயந்திரத்தை ** உங்கள் இதயத்தின் உள்ளடக்கத்திற்கு நீட்டிக்கலாம். நீங்கள் எளிதாக விளையாட்டுகளை பிழைத்திருத்தலாம், ஏனெனில் கோடோட் பிழைகளை ஒரு அடுக்கு ட்ரேசுடன் அச்சிடுவார், அவை இயந்திரத்திலிருந்து வந்தாலும் கூட.

source: This **does not affect the work you do with Godot** in any way: there's no strings attached to the engine or anything you make with it.
ga: Ní chuireann sé seo **isteach ar an obair a dhéanann tú le Godot ** ar bhealach ar bith: níl aon teaghráin ceangailte leis an inneall nó aon rud a dhéanann tú leis.
ta: இந்த ** நீங்கள் கோடோட் ** உடன் செய்யும் வேலையை எந்த வகையிலும் பாதிக்காது: எஞ்சினுடன் எந்த சரங்களும் இணைக்கப்படவில்லை அல்லது அதனுடன் நீங்கள் செய்யும் எதையும்.

source: Community-driven
ga: Faoi thionchar an phobail
ta: சமூகம் உந்துதல்

source: **Godot is made by its community, for the community, and for all game creators out there.** It's the needs of the users and open discussions that drive the core updates. New features from the core developers often focus on what will benefit the most users first.
ga: **Tá Godot déanta ag a phobal, don phobal, agus do gach creators cluiche amach ann.** Tá sé riachtanais na n-úsáideoirí agus plé oscailte a thiomáint na nuashonruithe lárnacha. Is minic a dhíríonn gnéithe nua ó na croífhorbróirí ar cad a rachaidh chun tairbhe na n-úsáideoirí is mó ar dtús.
ta: ** கோடோட் அதன் சமூகத்தாலும், சமூகத்துக்காகவும், அங்குள்ள அனைத்து விளையாட்டு படைப்பாளர்களுக்காகவும் தயாரிக்கப்படுகிறது. ** இது பயனர்களின் தேவைகள் மற்றும் முக்கிய புதுப்பிப்புகளைத் தூண்டும் திறந்த விவாதங்கள். கோர் டெவலப்பர்களிடமிருந்து புதிய நற்பொருத்தங்கள் பெரும்பாலும் அதிக பயனர்களுக்கு முதலில் பயனளிக்கும் என்பதில் கவனம் செலுத்துகின்றன.

source: That said, although a handful of core developers work on it full-time, the project has thousands of contributors at the time of writing. Benevolent programmers work on features they may need themselves, so you'll see improvements in all corners of the engine at the same time in every major release.
ga: É sin ráite, cé go n-oibríonn dornán de na forbróirí lárnacha air go lánaimseartha, tá na mílte rannpháirtí ag an tionscadal tráth na scríbhneoireachta. Oibríonn ríomhchláraitheoirí benevolent ar ghnéithe a d'fhéadfadh a bheith ag teastáil uathu féin, mar sin feicfidh tú feabhsuithe i ngach cearn den inneall ag an am céanna i ngach scaoileadh mór.
ta: ஒரு சில முக்கிய உருவாக்குபவர்கள் முழுநேர வேலை செய்தாலும், இந்த திட்டத்தில் எழுதும் நேரத்தில் ஆயிரக்கணக்கான பங்களிப்பாளர்கள் உள்ளனர். நற்பண்புள்ள புரோகிராமர்கள் தங்களைத் தாங்களே தேவைப்படும் அம்சங்களில் வேலை செய்கிறார்கள், எனவே ஒவ்வொரு பெரிய வெளியீட்டிலும் ஒரே நேரத்தில் இயந்திரத்தின் அனைத்து மூலைகளிலும் மேம்பாடுகளைக் காண்பீர்கள்.

source: The Godot editor is a Godot game
ga: Is é an eagarthóir Godot cluiche Godot
ta: கோடோட் ஆசிரியர் ஒரு கோடோட் விளையாட்டு

source: The Godot editor runs on the game engine. It uses the engine's own UI system, it can hot-reload code and scenes when you test your projects, or run game code in the editor. This means you can **use the same code** and scenes for your games, or **build plugins and extend the editor.**
ga: Ritheann an t-eagarthóir Godot ar an inneall cluiche. Úsáideann sé córas Chomhéadain an innill féin, is féidir leis cód agus radhairc a athlódáil te nuair a dhéanann tú do thionscadail a thástáil, nó cód cluiche a reáchtáil san eagarthóir. Ciallaíonn sé seo gur féidir leat ** an cód céanna ** agus radhairc a úsáid le do chluichí, nó ** breiseáin a thógáil agus an t-eagarthóir a leathnú.**
ta: கோடோட் எடிட்டர் விளையாட்டு இயந்திரத்தில் இயங்குகிறது. இது இயந்திரத்தின் சொந்த இடைமுகம் அமைப்பைப் பயன்படுத்துகிறது, இது உங்கள் திட்டங்களை சோதிக்கும்போது அல்லது எடிட்டரில் விளையாட்டுக் குறியீட்டை இயக்கும்போது குறியீடு மற்றும் காட்சிகளை சூடான-ஏற்றலாம். இதன் பொருள் நீங்கள் ** அதே குறியீட்டைப் பயன்படுத்தலாம் ** மற்றும் உங்கள் கேம்களுக்கான காட்சிகள், அல்லது ** செருகுநிரல்களை உருவாக்கி எடிட்டரை நீட்டிக்கவும். **

source: This leads to a reliable and flexible UI system, as it powers the editor itself. With the ``@tool`` annotation, you can run any game code in the editor.
ga: Mar thoradh air seo tá córas UI iontaofa agus solúbtha, mar go dtugann sé cumhacht don eagarthóir féin. Leis an anótáil ''@tool'', is féidir leat aon chód cluiche a rith san eagarthóir.
ta: இது நம்பகமான மற்றும் நெகிழ்வான இடைமுகம் அமைப்புக்கு வழிவகுக்கிறது, ஏனெனில் இது எடிட்டருக்கு ஆற்றல் அளிக்கிறது. ``@கருவி` `சிறுகுறிப்பு மூலம், நீங்கள் எந்த விளையாட்டுக் குறியீட்டையும் எடிட்டரில் இயக்கலாம்.

source: |image5|
ga: |íomhá5|

source: image5
ga: íomhá5

source: *RPG in a Box is a voxel RPG editor made with Godot 2. It uses Godot's UI tools for its node-based programming system and for the rest of the interface.*
ga: * Is eagarthóir RPG voxel é RPG i mBosca a rinneadh le Godot 2. Úsáideann sé uirlisí Chomhéadain Godot dá chóras ríomhchláraithe bunaithe ar nód agus don chuid eile den chomhéadan.*

source: Put the ``@tool`` annotation at the top of any GDScript file and it will run in the editor. This lets you import and export plugins, create plugins like custom level editors, or create scripts with the same nodes and API you use in your projects.
ga: Cuir an anótáil ''@tool'' ag barr aon chomhad GDScript agus rithfidh sé san eagarthóir. Ligeann sé seo duit breiseáin a allmhairiú agus a onnmhairiú, breiseáin a chruthú cosúil le heagarthóirí leibhéal saincheaptha, nó scripteanna a chruthú leis na nóid agus an API céanna a úsáideann tú i do thionscadail.
ta: எந்தவொரு GDSCRIPT கோப்பின் மேலேயும் ``@கருவி` `சிறுகுறிப்பை வைக்கவும், அது எடிட்டரில் இயங்கும். இது செருகுநிரல்களை இறக்குமதி செய்யவும் ஏற்றுமதி செய்யவும், தனிப்பயன் நிலை எடிட்டர்கள் போன்ற செருகுநிரல்களை உருவாக்கவோ அல்லது உங்கள் திட்டங்களில் நீங்கள் பயன்படுத்தும் அதே முனைகள் மற்றும் பநிஇ உடன் ச்கிரிப்ட்களை உருவாக்கவோ உங்களை அனுமதிக்கிறது.

source: The editor is fully written in C++ and is statically compiled into the binary. This means you can't import it as a typical project that would have a ``project.godot`` file.
ga: Tá an t-eagarthóir scríofa go hiomlán i C ++ agus tá sé curtha le chéile go statically isteach sa dénártha. Ciallaíonn sé seo nach féidir leat é a iompórtáil mar thionscadal tipiciúil a mbeadh comhad ''project.godot'' aige.
ta: ஆசிரியர் சி ++ இல் முழுமையாக எழுதப்பட்டுள்ளது மற்றும் நிலையான முறையில் பைனரியில் தொகுக்கப்பட்டுள்ளது. இதன் பொருள் என்னவென்றால், `` திட்டம்.கோடோட்`` கோப்பைக் கொண்ட ஒரு பொதுவான திட்டமாக நீங்கள் அதை இறக்குமதி செய்ய முடியாது.

source: Separate 2D and 3D engines
ga: Innill 2D agus 3D ar leithligh
ta: 2 டி மற்றும் 3 டி என்சின்களைப் பிரிக்கவும்

source: Godot offers dedicated 2D and 3D rendering engines. As a result, **the base unit for 2D scenes is pixels.** Even though the engines are separate, you can render 2D in 3D, 3D in 2D, and overlay 2D sprites and interfaces over your 3D world.
ga: Cuireann Godot innill rindreáil tiomnaithe 2D agus 3D ar fáil. Mar thoradh air sin, ** is é an bunaonad do radhairc 2D picteilíní.** Cé go bhfuil na hinnill ar leithligh, is féidir leat 2D a dhéanamh i 3D, 3D i 2D, agus sprites agus comhéadain 2D forleagan thar do shaol 3D.
ta: கோடோட் அர்ப்பணிப்பு 2 டி மற்றும் 3 டி வழங்குதல் என்சின்களை வழங்குகிறது. இதன் விளைவாக, ** 2 டி காட்சிகளுக்கான அடிப்படை அலகு படப்புள்ளிகள் ஆகும். ** என்சின்கள் தனித்தனியாக இருந்தாலும், நீங்கள் 3D இல் 2D ஐ வழங்கலாம், 2D இல் 3D, மற்றும் உங்கள் 3D உலகில் 2D உருவங்கள் மற்றும் இடைமுகங்கள்.
