Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing.po
Languages: cs, es, fr, ga, ru, ta, zh_cn

source: Creating instances
cs: Vytváření instancí
es: Creando instancias
fr: Création d'instances
ga: Cásanna a chruthú
ru: Создание экземпляров
ta: நிகழ்வுகளை உருவாக்குதல்
zh_cn: 创建实例

source: This tutorial refers to instancing scenes in the editor. To learn how to instance scenes from code, see :ref:`doc_nodes_and_scene_instances`.
cs: Tento návod pojednává o instancování scén v editoru. Chcete-li se dovědět, jako instancovat scény v kódu, přečtěte si :ref:`doc_nodes_and_scene_instances`.
es: Este tutorial trata sobre la instanciación de escenas en el editor. Para aprender a instanciar escenas desde el código, consulta :ref:`doc_nodes_and_scene_instances`.
fr: Ce tutoriel se réfère à l'instanciation des scènes dans l'éditeur. Pour savoir comment instancier des scènes depuis le code, voir :ref:`doc_nodes_and_scene_instances`.
ru: Этот урок относится к созданию экземпляров сцен в редакторе. Чтобы узнать, как создавать экземпляры сцен из кода, см. :ref:`doc_nodes_and_scene_instances`.
zh_cn: 本教程涉及在编辑器中实例化场景。要了解如何通过代码实例化场景，请参见 :ref:`doc_nodes_and_scene_instances`。

source: Godot's approach to *instancing* described below should not be confused with hardware instancing that can be used to render large amounts of similar objects quickly. See :ref:`doc_using_multimesh` instead.
cs: Přístup Godotu k *instancování* popsaný níže by neměl být zaměňován s hardwarovým instancováním, což je technika, kterou lze efektivně vykreslovat velká množství podobných objektů. Hledáte-li informace k ní, přejděte na :ref:`doc_using_multimesh`.
es: El enfoque de Godot para la *instanciación* descrito a continuación no debe confundirse con la instanciación por hardware, que permite renderizar rápidamente grandes cantidades de objetos similares. Consulta :ref:`doc_using_multimesh`.
fr: L'approche de Godot à *l'instanciation* décrite ci-dessous ne devrait pas être confondue avec l'instançage matériel qui peut être utilisé pour rendre rapidement de grandes quantités d'objets similaires. Voir :ref:`doc_using_multimesh` à la place.
ru: Подход Godot к *экземпляризации (instancing)*, описанный ниже, не следует путать с аппаратной экземпляризацией, которая может использоваться для быстрого рендеринга большого количества похожих объектов. Вместо этого см. :ref:`doc_using_multimesh`.
zh_cn: 下面描述的 Godot 的 *实例化* 方法不应与硬件实例化混淆，后者可以用来快速渲染大量相似的对象。请参见 :ref:`doc_using_multimesh`\ 。

source: In the previous part, we saw that a scene is a collection of nodes organized in a tree structure, with a single node as its root. You can split your project into any number of scenes. This feature helps you break down and organize your game's different components.
cs: V předchozí části jsme si ukázali, že scéna je kolekce uzlů uspořádaných do stromové struktury s jedním kořenovým uzlem. Svůj projekt můžete rozdělit do libovolného počtu scén, což vám pomůže lépe rozčlenit a organizovat jednotlivé komponenty vaší hry.
es: En la parte anterior, vimos que una escena es una colección de nodos organizados en una estructura de árbol, con un solo nodo como raíz. Puedes dividir tu proyecto en cualquier número de escenas. Esta función te ayuda a desglosar y organizar los diferentes componentes de tu juego.
fr: Dans la partie précédente, nous avons vu qu'une scène est une collection de nœuds organisés en une structure arborescente, avec un seul nœud comme racine. Vous pouvez diviser votre projet en un nombre quelconque de scènes. Cette fonctionnalité vous aide à décomposer et à organiser les différents composants de votre jeu.
ga: Sa chuid roimhe seo, chonaic muid go bhfuil radharc bailiúchán de nóid eagraithe i struchtúr crann, le nód amháin mar a fhréamh. Is féidir leat do thionscadal a roinnt in aon líon radhairc. Cuidíonn an ghné seo leat comhpháirteanna éagsúla do chluiche a bhriseadh síos agus a eagrú.
ru: В предыдущей части мы увидели, что сцена - это набор узлов, организованных в древовидную структуру, корнем которой является один узел. Вы можете разделить свой проект на любое количество сцен. Эта функция поможет вам разбить и организовать различные компоненты вашей игры.
ta: முந்தைய பகுதியில், ஒரு காட்சி என்பது ஒரு மர கட்டமைப்பில் ஒழுங்கமைக்கப்பட்ட முனைகளின் தொகுப்பு, ஒரு முனை அதன் வேராக இருப்பதைக் கண்டோம். உங்கள் திட்டத்தை எத்தனை காட்சிகளாக பிரிக்கலாம். இந்த நற்பொருத்தம் உங்கள் விளையாட்டின் வெவ்வேறு கூறுகளை உடைத்து ஒழுங்கமைக்க உதவுகிறது.
zh_cn: 上一部分中，我们了解到场景是一系列组织成树状结构的节点，其中只有一个节点是根节点。你可以将项目拆分成任意数量的场景。这一特性可以帮你将游戏拆解成不同的组件，并进行组织。

source: You can create as many scenes as you'd like and save them as files with the ``.tscn`` extension, which stands for "text scene". The ``label.tscn`` file from the previous lesson was an example. We call those files "Packed Scenes" as they pack information about your scene's content.
cs: Můžete vytvořit tolik scén, kolik jen chcete, a uložit je jako soubory s příponou ``.tscn`` (zkratka pro "textová scéna"). Jeden takový příklad jsme už viděli: byl soubor to ``label.tscn`` z předchozí lekce. Takovéto soubory nazýváme "zabalené scény", protože jsou vlastně balíčkem informací o obsahu vaší scény.
es: Puedes crear tantas escenas como desee y guardarlas en el disco con la extensión ``.tscn``, que significa "escena en texto". El archivo ``label.tscn`` de la lección anterior fue un ejemplo. Llamamos a esos archivos "Escenas empaquetadas", ya que contienen información sobre el contenido de su escena.
fr: Vous pouvez créer autant de scènes que vous le souhaitez et les enregistrer sur le disque avec l'extension ``.tscn``, qui signifie "text scene". Le fichier ``Label.tscn`` de la leçon précédente en était un exemple. Nous appelons ces fichiers "Packed Scenes", car ils contiennent des informations sur le contenu de votre scène.
ga: Is féidir leat an oiread radhairc is mian leat a chruthú agus iad a shábháil mar chomhad leis an síneadh `.tscn``, a sheasann do “radharc téacs”. Ba shampla é an comhad ``label.tscn`` ón gceacht roimhe seo. Glaoimid ar na comhaid sin “Radhairc Pacáilte” mar a phacáilíonn siad faisnéis faoi ábhar do radharc.
ru: Вы можете создавать сколько угодно сцен и сохранять их как файлы с расширением ``.tscn``, что означает "текстовая сцена" ("text scene"). В качестве примера можно привести файл ``label.tscn`` из предыдущего урока. Мы называем эти файлы "упакованными сценами", поскольку они содержат информацию о содержимом сцены.
ta: நீங்கள் விரும்பும் பல காட்சிகளை உருவாக்கலாம் மற்றும் அவற்றை "` .TSCN`` நீட்டிப்புடன் கோப்புகளாக சேமிக்கலாம், இது "உரை காட்சி" என்பதைக் குறிக்கிறது. முந்தைய பாடத்திலிருந்து `` label.tscn`` கோப்பு ஒரு எடுத்துக்காட்டு. உங்கள் காட்சியின் உள்ளடக்கத்தைப் பற்றிய தகவல்களை அவர்கள் பேக் செய்வதால் அந்த கோப்புகளை "நிரம்பிய காட்சிகள்" என்று அழைக்கிறோம்.
zh_cn: 你可以创建任意数量的场景并将他们保存成扩展名为 ``.tscn`` （“text scene” 文本场景）的文件。上节课的 ``label.tscn`` 文件就是一个例子。我们把这些文件叫作“打包的场景”（Packed Scene），因为它们将场景的内容信息进行了打包。

source: Here's an example of a ball. It's composed of a :ref:`RigidBody2D <class_RigidBody2D>` node as its root named Ball, which allows the ball to fall and bounce on walls, a :ref:`Sprite2D <class_Sprite2D>` node, and a :ref:`CollisionShape2D <class_CollisionShape2D>`.
cs: Zde máme ukázku míče. Skládá se z kořenového uzlu :ref:`RigidBody2D <class_RigidBody2D>` ("2D pevné těleso") s názvem Míč, který mu umožňuje padat a odrážet se od stěn, uzlu :ref:`Sprite2D <class_Sprite2D>` a uzlu :ref:`CollisionShape2D <class_CollisionShape2D>` ("2D kolizní tvar").
es: Aquí está el ejemplo de una pelota. Está compuesto por un nodo :ref:`RigidBody2D <class_RigidBody2D>` como raíz llamado Ball, que permite que la bola caiga y rebote en las paredes, un nodo :ref:`Sprite2D <class_Sprite2D>` y un :ref:`CollisionShape2D <class_CollisionShape2D>`.
fr: Voici un exemple de balle. Il est composé d'un nœud :ref:`RigidBody2D <class_RigidBody2D>` à la racine appelé Ball, permettant à la balle de tomber et de rebondir sur les murs, d'un nœud :ref:`Sprite2D <class_Sprite2D>`, et d'un nœud :ref:`CollisionShape2D <class_CollisionShape2D>`.
ga: Seo sampla de liathróid. Tá sé comhdhéanta de nód :ref:`RigidBody2D <class_RigidBody2D>` mar a fhréamh darb ainm Ball, a ligeann don liathróid titim agus preabadh ar bhallaí, nód :ref:`Sprite2D <class_Sprite2D>`, agus :ref:`CollisionShape2D <class_CollisionShape2D>`.
ru: Вот пример мяча. Он состоит из :ref:`RigidBody2D <class_RigidBody2D>` являющегося корневым узлом с именем Ball, который позволяет мячу падать и отскакивать от стен, узла :ref:`Sprite2D <class_Sprite2D>` и узла :ref:`CollisionShape2D<class_CollisionShape2D>`.
ta: இங்கே ஒரு பந்தின் எடுத்துக்காட்டு. இது ஒரு: ref: `rigidbody2d <class_rigidbody2d>` அதன் வேர் பெயரிடப்பட்ட பந்தாக முனை, இது பந்தை சுவர்களில் விழுந்து குதிக்க அனுமதிக்கிறது, a: ref: `sprite2d <class_sprite2d>` node, மற்றும் a: ref: `collisionh2dd <class_collisshape2d> `.
zh_cn: 这有一个小球的例子。它由以下内容组成：一个叫“Ball”的 :ref:`RigidBody2D <class_RigidBody2D>` 节点是根节点，可以让小球下落、在撞墙后反弹；一个 :ref:`Sprite2D <class_Sprite2D>` 节点以及一个 :ref:`CollisionShape2D <class_CollisionShape2D>`\ 。

source: Once you have saved a scene, it works as a blueprint: you can reproduce it in other scenes as many times as you'd like. Replicating an object from a template like this is called **instancing**.
cs: Poté, co scénu uložíte, funguje jako šablona: můžete ji opakovaně vkládat do dalších scén, kolikrát chcete. Tento způsob opakovaného použití objektu na základě šablony se nazývá **instancování**.
es: Una vez guardada una escena, esta funciona como una plantilla: puede reproducirla en otras escenas tantas veces como desee. Replicar un objeto a partir de una plantilla de este tipo se denomina **instanciación**.
fr: Une fois que vous avez sauvegardé une scène, elle fonctionne comme un modèle : vous pouvez la reproduire dans d'autres scènes autant de fois que vous le souhaitez. La reproduction d'un objet à partir d'un modèle de ce type est appelée **instanciation**.
ga: Nuair a bheidh radharc shábháilte agat, oibríonn sé mar threoirphrionta: is féidir leat é a atáirgeadh i radhairc eile an oiread uair agus is mian leat. Tugtar réad a mhacasamhlú ó theimpléad mar seo **instancing**.
ru: Если вы сохранили сцену, она работает как шаблон: вы можете воспроизводить её в других сценах столько раз, сколько захотите. Воспроизведение объекта по шаблону называется **инстанцирование** (от слова instance - "экземпляр").
ta: நீங்கள் ஒரு காட்சியைச் சேமித்ததும், அது ஒரு வரைபடமாக செயல்படுகிறது: நீங்கள் விரும்பும் பல முறை மற்ற காட்சிகளில் அதை மீண்டும் உருவாக்கலாம். இது போன்ற ஒரு வார்ப்புருவில் இருந்து ஒரு பொருளைப் பிரதிபலிப்பது ** நிறுவுதல் ** என்று அழைக்கப்படுகிறது.
zh_cn: 保存场景过后，这个场景就可以作为蓝图使用：你可以在其他场景中进行任意次数的重用。像这样从模板中复制对象被称为\ **实例化**\ 。

source: As we mentioned in the previous part, instanced scenes behave like a node: the editor hides their content by default. When you instance the Ball, you only see the Ball node. Notice also how each duplicate has a unique name.
cs: Jak jsme zmínili v předchozí části, instance scén se chovají jako běžné uzly: editor ve výchozím nastavení skryje jejich vnitřní strukturu. Když tedy instancujete scénu Míč, uvidíte jen uzel s názvem Míč. Všimněte si také, že každý duplikát má jedinečný název.
es: Como mencionamos en la parte anterior, las escenas instanciadas se comportan como un nodo: el editor oculta su contenido por defecto. Cuando crea una instancia de Ball, solo ve el nodo Ball. Observe también cómo cada duplicado tiene un nombre único.
fr: Comme nous l'avons mentionné dans la partie précédente, les scènes instanciées se comportent comme un nœud : l'éditeur cache leur contenu par défaut. Lorsque vous instanciez la balle, vous ne voyez que le nœud Ball. Remarquez également que chaque duplicata a un nom unique.
ga: Mar a luaigh muid sa chuid roimhe seo, iompraíonn radhairc ionchasacha cosúil le nód: folaíonn an t-eagarthóir a n-ábhar de réir réamhshocraithe. Nuair a dhéanann tú an Liathróid mar shampla, ní fheiceann tú ach an nód Liathróid. Tabhair faoi deara freisin conas a bhfuil ainm uathúil ag gach dúblach.
ru: Как мы упоминали в предыдущей части, инстанцированные сцены ведут себя как узлы: редактор скрывает их содержимое по умолчанию. При экземпляре Ball отображается только узел Ball. Обратите внимание, что каждый дубликат имеет уникальное имя.
ta: முந்தைய பகுதியில் நாங்கள் குறிப்பிட்டுள்ளபடி, நிறுவப்பட்ட காட்சிகள் ஒரு முனை போல செயல்படுகின்றன: ஆசிரியர் இயல்புநிலையாக அவற்றின் உள்ளடக்கத்தை மறைக்கிறார். நீங்கள் பந்தை நிகழ்த்தும்போது, நீங்கள் பந்து முனையை மட்டுமே பார்க்கிறீர்கள். ஒவ்வொரு நகலுக்கும் ஒரு தனித்துவமான பெயர் எவ்வாறு உள்ளது என்பதையும் கவனியுங்கள்.
zh_cn: 我们在上一部分提到过，实例化场景的行为与节点类似：编辑器默认会隐藏其中的内容。实例化 Ball 之后，你只会看到 Ball 节点。请注意制作出的副本，名字是唯一的。

source: Every instance of the Ball scene starts with the same structure and properties as ``ball.tscn``. However, you can modify each independently, such as changing how they bounce, how heavy they are, or any property exposed by the source scene.
cs: Každá instance scény Míč vychází ze stejné struktury a vlastností definováných v souboru ``mic.tscn``. Každou z nich však můžete nezávisle upravit – například změnit, jak moc se odráží, jak je těžká nebo jakoukoli vlastnost, kterou zdrojová scéna nabízí.
es: Cada instancia de la escena Ball comienza con la misma estructura y propiedades que ``ball.tscn``. Sin embargo, puede modificar cada una independientemente, como cambiar cómo rebotan, qué tan pesadas son o cualquier propiedad expuesta por la escena de origen.
fr: Chaque instance de la scène Ball commence avec la même structure et les mêmes propriétés que ``ball.tscn``. Cependant, vous pouvez modifier chacune d'elles indépendamment, par exemple en changeant la façon dont elles rebondissent, leur poids ou toute propriété exposée par la scène source.
ga: Tosaíonn gach cás den radharc Liathróid leis an struchtúr agus na hairíonna céanna le ``ball.tscn``. Mar sin féin, is féidir leat gach ceann a mhodhnú go neamhspleách, mar shampla an chaoi a mbíonn siad a athrú, cé chomh trom atá siad, nó aon mhaoin a nochtann radharc an fhoinse.
ru: Каждый экземпляр сцены Ball начинает с той же структуры и свойств, что и ``ball.tscn``. Однако вы можете изменять каждый из них независимо, например, изменять то, как они отскакивают, сколько они весят, или любое свойство, открытое исходной сценой.
ta: பந்து காட்சியின் ஒவ்வொரு நிகழ்வும் `` Ball.tscn`` போன்ற அதே அமைப்பு மற்றும் பண்புகளுடன் தொடங்குகிறது. எவ்வாறாயினும், ஒவ்வொன்றையும் சுயாதீனமாக மாற்றலாம், அதாவது அவை எவ்வாறு துள்ளுகின்றன, அவை எவ்வளவு கனமானவை, அல்லது மூல காட்சியால் வெளிப்படும் எந்தவொரு சொத்துக்களும்.
zh_cn: Ball 场景的实例最开始都和 ``ball.tscn`` 有相同的结构和属性。不过你也可以单独修改各个实例，比如修改反弹的方式、重量等源场景所暴露的属性。

source: In practice
cs: Praktická ukázka
es: En la práctica
fr: En pratique
ga: Go praiticiúil
ru: На практике
ta: நடைமுறையில்
zh_cn: 实践

source: Let's use instancing in practice to see how it works in Godot. We invite you to download the ball's sample project we prepared for you: `instancing_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip>`_.
cs: Pojďme si instancování vyzkoušet v praxi. Začněte stažením ukázkového projektu míče, který jsme pro vás připravili: `instancing_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip>`_.
es: Usemos instanciación en la práctica para ver cómo funciona en Godot. Invitamos a descargar el proyecto de muestra de la pelota que preparamos para tí `instancing_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip>`_.
fr: Utilisons l'instanciation en pratique pour voir comment elle fonctionne dans Godot. Nous vous invitons à télécharger le projet d'exemple de la balle que nous avons préparé pour vous : `instancing_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip>`_.
ga: Bainimis úsáid as instancing go praiticiúil chun a fheiceáil conas a oibríonn sé i Godot. Tugaimid cuireadh duit tionscadal samplach an liathróid a d'ullmhaigh muid duit a íoslódáil: `instancing_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip >`_.
ru: Давайте воспользуемся созданием экземпляров (инстанцированием) на практике, чтобы увидеть, как именно оно работает в Godot. Загрузим проект с мячом, который мы подготовили для вас: `instancing_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip>`_.
ta: கோடோட்டில் இது எவ்வாறு செயல்படுகிறது என்பதைப் பார்க்க நடைமுறையில் நிறுவலைப் பயன்படுத்துவோம். நாங்கள் உங்களுக்காகத் தயாரித்த பந்தின் மாதிரி திட்டத்தைப் பதிவிறக்க உங்களை அழைக்கிறோம்: `இன்ச்டான்சிங்_ச்டார்டர்.சிப் <https://github.com/godotengine/godotengs-project-starters/releaseases/downloades/latest-4.x/instance_starter > `_.
zh_cn: 让我们来实践一下实例化，看看到底在 Godot 里是如何使用的。我们为你准备了小球的示例项目，欢迎下载：\ `instancing_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/instancing_starter.zip>`_\ 。

source: Extract the archive on your computer. To import it, you need the Project Manager. The Project Manager is accessed by opening Godot, or if you already have Godot opened, click on :menu:`Project > Quit to Project List` (:kbd:`Ctrl + Shift + Q`, :kbd:`Ctrl + Option + Cmd + Q` on macOS)
ru: Распакуйте архив на своём компьютере. Для его импорта вам потребуется Менеджер Проектов. Менеджер Проектов доступен при открытии Godot, либо, если вы уже открыли Godot, кликните на :menu:`Project > Quit to Project List` (:kbd:`Ctrl + Shift + Q`, :kbd:`Ctrl + Option + Cmd + Q` на macOS)
zh_cn: 先将该压缩包解压到你的计算机里。要导入它，你需要项目管理器。项目管理器可以通过打开 Godot 来访问，或者如果你已经打开了 Godot，点击 :menu:`Project > Quit to Project List`\ （\ :kbd:`Ctrl + Shift + Q`\ ，macOS 为 :kbd:`Ctrl + Option + Cmd + Q`\ ）

source: In the Project Manager, click the :button:`Import` button to import the project.
ru: В Менеджере Проектов нажмите кнопку :button:`Import`, чтобы импортировать проект.
zh_cn: 在项目管理器中点击 :button:`Import` 按钮来导入这个项目。

source: In the pop-up that appears navigate to the folder you extracted. Double-click the ``project.godot`` file to open it.
cs: V následujícím okně přejděte do složky, kterou jste rozbalili. Otevřete soubor ``project.godot`` dvojklikem.
es: En la ventana emergente, haz clic en el botón Examinar y navegue hasta la carpeta que extrajo.
fr: Dans la fenêtre contextuelle qui apparaît, accédez au dossier que vous avez extrait. Double-cliquez sur le fichier ``project.godot`` pour l'ouvrir.
ga: Sa aníos atá le feiceáil nascleanúint chuig an bhfillteán a bhain Cliceáil faoi dhó ar an gcomhad `project.godot ``chun é a oscailt.
ru: В появившемся окне перейдите в папку, которую вы извлекли. Дважды щёлкните по файлу ``project.godot``, чтобы открыть его.
ta: நீங்கள் பிரித்தெடுத்த கோப்புறையில் செல்லத் தோன்றும் பாப்-அப். அதைத் திறக்க `` project.godot`` கோப்பை இருமுறை சொடுக்கு செய்யவும்.
zh_cn: 在弹出的窗口中，导航至你提取的文件夹。双击 ``project.godot`` 文件打开它。

source: Finally, click the :button:`Import` button.
ru: Наконец, нажмите на кнопку :button:`Import`.
zh_cn: 最后点击 :button:`导入` 按钮。

source: A window notifying you that the project was last opened in an older Godot version may appear, that's not an issue. Click :button:`Ok` to open the project.
ru: Может появиться окно с уведомлением о том, что проект в последний раз открывался в более старой версии Godot, это не проблема. Нажмите :button:`Ok`, чтобы открыть проект.
zh_cn: 可能会出现一个窗口通知你该项目最后一次是在较旧版本的 Godot 中打开的，这没有问题。点击 :button:`Ok` 来打开项目。

source: The project contains two packed scenes: ``main.tscn``, containing walls against which the ball collides, and ``ball.tscn``. The Main scene should open automatically. If you're seeing an empty 3D scene instead of the main scene, click the 2D button at the top of the screen.
cs: V projektu jsou dvě zabalené scény: ``main.tscn``, která obsahuje stěny, od kterých se míč může odrážet a ``ball.tscn``. Automaticky by se měla otevřít hlavní scéna Main. Pokud místo ní vidíte prázdnou 3D scénu, klikněte na tlačítko 2D v horní části obrazovky.
es: El proyecto contiene dos escenas empaquetadas: ``main.tscn``, que contiene paredes contra las que choca la pelota, y ``ball.tscn``. La escena Main debería abrirse automáticamente. Si ves una escena 3D vacía en lugar de la escena principal, haz clic en el botón 2D en la parte superior de la pantalla.
fr: Le projet contient deux scènes compactes : ``main.tscn``, contenant les murs contre lesquels la balle entre en collision, et ``ball.tscn``. La scène principale devrait s'ouvrir automatiquement. Si vous voyez une scène 3D vide au lieu de la scène principale, cliquez sur le bouton 2D en haut de l'écran.
ga: Tá dhá radharc pacáilte sa tionscadal: ``main.tscn``, ina bhfuil ballaí ina n-imbhuaileann an liathróid ina choinne, agus ``ball.tscn``. Ba chóir go n-osclaíonn an Príomhradharc go huath Má tá radharc 3D folamh á fheiceáil agat in ionad an phríomhradharc, cliceáil ar an gcnaipe 2D ag barr an scáileáin.
ru: Проект содержит две упакованные сцены: ``main.tscn``, содержащую стены, о которые ударяется мяч, и ``ball.tscn``. Главная сцена должна открыться автоматически. Если вместо основной сцены вы видите пустую 3D сцену, кликните на кнопку 2D в верхней части экрана.
ta: இந்த திட்டத்தில் இரண்டு நிரம்பிய காட்சிகள் உள்ளன: `` main.tscn``, இதில் பந்து மோதும் சுவர்கள் உள்ளன, மற்றும் `` Ball.tscn``. முக்கிய காட்சி தானாக திறக்கப்பட வேண்டும். முதன்மையான காட்சிக்கு பதிலாக வெற்று 3D காட்சியைப் பார்க்கிறீர்கள் என்றால், திரையின் மேலே உள்ள 2D பொத்தானைக் சொடுக்கு செய்க.
zh_cn: 这个项目里包含两个被打包的场景：一个是``main.tscn``场景，其中包含了会与小球发生碰撞的墙体，另一个是``ball.tscn``场景 。而 Main 场景应该会被自动打开。如果你看到的是空的 3D 场景而不是 Main 场景，请单击屏幕顶部的 2D 按钮。

source: Let's add a ball as a child of the Main node. In the Scene dock, select the Main node. Then, click the link icon at the top of the scene dock. This button allows you to add an instance of a scene as a child of the currently selected node.
cs: Přidejme míč jako potomka hlavního uzlu. V doku Scéna vyberte hlavní uzel (Main) a poté klikněte na ikonu řetězu v horní části doku scény. Ta umožňuje přidat instanci scény jako potomka aktuálně vybraného uzlu.
es: Agreguemos una bola como elemento secundario del nodo Main. En el panel Escena, selecciona el nodo Main. Luego, haz clic en el ícono de enlace en la parte superior del panel de escena. Este botón le permite agregar una instancia de una escena como elemento secundario del nodo seleccionado actualmente.
fr: Ajoutons une balle comme enfant du nœud Main. Dans le dock de la scène, sélectionnez le nœud Main. Puis, cliquez sur l'icône lien en haut du dock scène. Ce bouton vous permet d'ajouter une instance d'une scène en tant qu'enfant du nœud actuellement sélectionné.
ga: Cuirimid liathróid leis mar leanbh den Phríomh-nód. Sa duga Radhairc, roghnaigh an Príomh-nód. Ansin, cliceáil ar an deilbhín nasc ag barr na duga radhairc. Ligeann an cnaipe seo duit sampla de radharc a chur leis mar leanbh den nód roghnaithe faoi láthair.
ru: Добавим шар в качестве дочернего элемента узла Main. В панели Scene выберите узел Main. Затем щёлкните значок ссылки в верхней части панели Scene. Эта кнопка позволяет добавить экземпляр сцены и сделать его дочерним узлом выбранного в данный момент узла.
ta: முதன்மையான முனையின் குழந்தையாக ஒரு பந்தைச் சேர்ப்போம். காட்சி கப்பல்துறையில், முதன்மையான முனையைத் தேர்ந்தெடுக்கவும். பின்னர், காட்சி கப்பல்துறையின் மேலே உள்ள இணைப்பு ஐகானைக் சொடுக்கு செய்க. தற்போது தேர்ந்தெடுக்கப்பட்ட முனையின் குழந்தையாக ஒரு காட்சியின் நிகழ்வைச் சேர்க்க இந்த பொத்தான் உங்களை அனுமதிக்கிறது.
zh_cn: 让我们为 Main 节点添加一个小球作为子节点。在“场景”面板中，选择 Main 节点。然后点击场景面板顶部的链接图标。这个按钮的作用是为当前选中节点添加另一个场景的实例作为子节点。
