Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing.po
Languages: cs, es, fr, ga, ru, ta, zh_cn

source: Select one of the instanced Ball nodes and, in the Inspector, set its Gravity Scale value to ``10``.
cs: Vyberte jeden z intancovaných uzlů Ball a v Inspektoru nastavte jeho Měřítko gravitace na ``10``.
es: Selecciona uno de los nodos Ball instanciados y, en el Inspector, establezca su valor de Gravity Scale en ``10``.
fr: Sélectionnez l'un des nœuds Ball instanciés et, dans l'inspecteur, définissez sa valeur Gravity Scale sur ``10``.
ga: Roghnaigh ceann de na nóid Liathróid inseansaithe agus, sa Cigire, socraigh a luach Scála Domhantarraingt go ``10``.
ta: நிறுவப்பட்ட பந்து முனைகளில் ஒன்றைத் தேர்ந்தெடுத்து, இன்ச்பெக்டரில், அதன் ஈர்ப்பு அளவிலான மதிப்பை `` 10`` ஆக அமைக்கவும்.

source: You may notice you are unable to change the values of the PhysicsMaterial of the ball. This is because PhysicsMaterial is a *resource*, and needs to be made unique before you can edit it in a scene that is linking to its original scene. To make a resource unique for one instance, right-click on the **Physics Material** property in the Inspector and click **Make Unique** in the context menu.
cs: Možná jste si všimli, že nemůžete měniv hodnoty ve PhysicsMaterialu míče. Je to proto, že PhysicsMaterial je *zdroj* a předtím, než ho budete moci upravovat ve scéně, která odkazuje na jeho původní scénu, je nutné ho udělat tzv. unikátní. Zdroj můžete udělat unikátní pro danou instanci pravým kliknutím na odpovídající vlastnost v Inspektoru (v našem případě tedy **Fyzikální materiál**) a volbou **Udělat unikátní**.
es: Puede que note que no es posible cambiar los valores del PhysicsMaterial de la pelota. Esto se debe a que PhysicsMaterial es un *recurso* y necesita ser convertido en único antes de poder editarlo en una escena que esté vinculada a su escena original. Para hacer que un recurso sea único para una instancia, haz clic derecho en la propiedad **Physics Material** en el inspector y haz clic en **Hacer único** en el menú contextual.
fr: Vous remarquerez peut-être que vous ne pouvez pas modifier les valeurs du ``PhysicsMaterial`` de la balle. En effet, ``PhysicsMaterial`` est une *ressource* et doit être rendue unique avant que vous puissiez la modifier dans une scène liée à sa scène d'origine. Pour rendre une ressource unique pour une instance, faites un clic droit sur la propriété *Matériau physique* dans l'Inspecteur et cliquez sur **Rendre unique** dans le menu contextuel.

source: You can come up with a diagram like this for almost any type of game. Each rectangle represents an entity that's visible in the game from the player's perspective. The arrows tell you which scene owns which.
ga: Is féidir leat teacht suas le léaráid mar seo le haghaidh beagnach aon chineál cluiche. Léiríonn gach dronuilleog aonán atá le feiceáil sa chluiche ó pheirspictíocht an imreora. Insíonn na saigheada duit cén radharc atá ina bhfuil.
