Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing.po
Languages: cs, es, fr, ga, ru, ta, zh_cn

source: Double-click the ball scene to instance it.
cs: Dvojklikem na scénu míče ji instancujte.
es: Haga doble clic en la escena de la pelota para instanciarla.
fr: Double-cliquez sur la scène de la balle pour l'instancier.
ga: Cliceáil faoi dhó ar radharc na liathróide lena shampla.
ru: Дважды щелкните на сцену с шаром, чтобы создать ее экземпляр.
ta: பந்து காட்சியை இருமுறை சொடுக்கு செய்யவும்.
zh_cn: 双击小球场景来实例化。

source: The ball appears in the top-left corner of the viewport.
cs: Míč se zobrazí v levém horním rohu průzoru.
es: La pelota aparece en la esquina superior izquierda de la ventana gráfica.
fr: La balle apparaît dans le coin supérieur gauche du viewport.
ga: Tá an liathróid le feiceáil sa chúinne barr ar chlé den radharc.
ru: Шар появляется в левом верхнем углу области просмотра.
ta: காட்சி வியாபாரத்தின் மேல்-இடது மூலையில் பந்து தோன்றும்.
zh_cn: 小球会出现在视口的左上角。

source: Click on it and drag it towards the center of the view.
cs: Klikněte na něj a přetáhněte ho do středu zobrazení.
es: Haz clic en él y arrástrelo hacia el centro de la vista.
fr: Cliquez dessus et faites-le glisser vers le centre de la vue.
ga: Cliceáil air agus tarraing é i dtreo lár an radharc.
ru: Нажмите на него и перетащите его к центру вида.
ta: அதைக் சொடுக்கு செய்து பார்வையின் மையத்தை நோக்கி இழுக்கவும்.
zh_cn: 点击它，然后拖拽到视图的中心。

source: Play the game by pressing :kbd:`F5` (:kbd:`Cmd + B` on macOS). You should see it fall.
cs: Spusťte hru stiknutím :kbd:`F5` (:kbd:`Cmd + B` na macOS). Míč by měl začít padat.
es: Ejecuta el juego presionando :kbd:`F5` (:kbd:`Cmd + B` en macOS). Deberías verla caer.
fr: Jouez au jeu en appuyant sur :kbd:`F5` (:kbd:`Cmd + B` sur macOS). Vous devriez le voir tomber.
ga: Seinn an cluiche trí bhrú: kbd: `F5` (:kbd: `Cmd + B` ar macOS). Ba chóir duit é a fheiceáil ag titim.
ru: Запустите игру, нажав :kbd:`F5` (:kbd:`Cmd + B` на macOS). Вы должны увидеть, как он падает.
ta: அழுத்துவதன் மூலம் விளையாட்டை விளையாடுங்கள்: KBD: `F5` (: KBD:` CMD + B` MACOS இல்). அது வீழ்ச்சியை நீங்கள் காண வேண்டும்.
zh_cn: 按 :kbd:`F5` （在macOS上是 :kbd:`Cmd + B` ）运行游戏。你应该会看到它往下掉。

source: Now, we want to create more instances of the Ball node. With the ball still selected, press :kbd:`Ctrl + D` (:kbd:`Cmd + D` on macOS) to call the duplicate command. Click and drag to move the new ball to a different location.
cs: Nyní bychom chtěli vytvořit více instancí uzlu Ball. Zatímco máte stále zvolený míč, stiskněte :kbd:`Ctrl + D` (:kbd:`Cmd + D` na macOS). To je příkaz pro duplikaci. Přetáhněte nový míč na jiné místo.
es: Ahora, queremos crear más instancias del nodo Ball. Con la pelota aún seleccionada, presiona :kbd:`Ctrl-D` (:kbd:`Cmd-D` en macOS) para llamar al comando de duplicado. Haz clic y arrastra para mover la nueva bola a una ubicación diferente.
fr: Maintenant, nous voulons créer d'autres instances du nœud Ball. Avec la balle toujours sélectionnée, appuyez sur :kbd:`Ctrl-D` (:kbd:`Cmd-D` sur macOS) pour la dupliquer. Cliquez et faites glisser pour déplacer la nouvelle balle à un autre endroit.
ga: Anois, ba mhaith linn níos mó cásanna den nód Liathróid a chruthú. Agus an liathróid fós roghnaithe, brúigh: kbd: `Ctrl + D` (:kbd: `Cmd + D` ar macOS) chun an t-ordú dúblach a ghlaoch. Cliceáil agus tarraing chun an liathróid nua a bhogadh go suíomh difriúil.
ru: Теперь мы хотим создать больше экземпляров узла Ball. Когда шар все ещё выделен, нажмите :kbd:`Ctrl-D` (:kbd:`Cmd-D` на macOS), чтобы вызвать команду дублирования. Щелкните и перетащите, чтобы переместить новый шар в другое место.
ta: இப்போது, பந்து முனையின் கூடுதல் நிகழ்வுகளை உருவாக்க விரும்புகிறோம். பந்து இன்னும் தேர்ந்தெடுக்கப்பட்டவுடன், அழுத்தவும்: KBD: `Ctrl + d` (: KBD:` CMD + D` on Macos) நகல் கட்டளையை அழைக்க. புதிய பந்தை வேறு இடத்திற்கு நகர்த்த சொடுக்கு செய்து இழுக்கவும்.
zh_cn: 现在我们希望创建更多的 Ball 节点实例。保持小球仍处于选中的状态，按下 :kbd:`Ctrl + D`\ （macOS 则是 :kbd:`Cmd + D`\ ）调用制作副本命令。点击并将新的小球拖到别的位置。

source: You can repeat this process until you have several in the scene.
cs: Tento postup můžete opakovat a vytvořit jich vescéně scéně několik.
es: Puede repetir este proceso hasta que tenga varios en la escena.
fr: Vous pouvez répéter ce processus jusqu'à ce que vous en ayez plusieurs dans la scène.
ga: Is féidir leat an próiseas seo a athdhéanamh go dtí go mbeidh roinnt agat sa radharc.
ru: Вы можете повторять этот процесс до тех пор, пока в сцене не появятся несколько.
ta: நீங்கள் காட்சியில் பல இருக்கும் வரை இந்த செயல்முறையை மீண்டும் செய்யலாம்.
zh_cn: 你可以重复这个过程在场景中多建几个。

source: Play the game again. You should now see every ball fall independently from one another. This is what instances do. Each is an independent reproduction of a template scene.
cs: Spusťte hru znovu. Každý míč by měl padat nezávisle na ostatních. To je to, co instance dělají. Každá je nezávislou reprodukcí šablonové scény.
es: Ejecuta el juego de nuevo. Ahora deberías ver que cada bola cae independientemente una de la otra. Esto es lo que hacen las instancias. Cada uno es una reproducción independiente de una escena de plantilla.
fr: Rejouez le jeu. Vous devriez maintenant voir toutes les balles tomber indépendamment les unes des autres. C'est ce que font les instances. Chacune est une reproduction indépendante d'une scène modèle.
ga: Seinn an cluiche arís. Ba chóir duit anois gach liathróid a fheiceáil ag titim go neamhspleách óna chéile. Seo a dhéanann cásanna. Is atáirgeadh neamhspleách ar radharc teimpléad é gach ceann acu.
ru: Запустите в игру ещё раз. Теперь вы должны увидеть, что каждый шарик падает независимо друг от друга. Это то, что делают экземпляры. Каждый из них является независимым экземпляром сцены-шаблона.
ta: மீண்டும் விளையாட்டை விளையாடுங்கள். ஒவ்வொரு பந்தும் ஒருவருக்கொருவர் சுயாதீனமாக விழுவதை நீங்கள் இப்போது பார்க்க வேண்டும். இதைத்தான் நிகழ்வுகள் செய்கின்றன. ஒவ்வொன்றும் ஒரு வார்ப்புரு காட்சியின் சுயாதீன இனப்பெருக்கம்.
zh_cn: 再次运行游戏。现在你应该看到每个小球都各自下落。这就是实例的作用。每一个都是模板场景的独立副本。

source: Editing scenes and instances
cs: Úpravy scén a instancí
es: Edición de escenas e instancias
fr: Modification de scènes et d’instances
ga: Radhairc agus cásanna a chur in eagar
ru: Редактирование сцен и экземпляров
ta: காட்சிகள் மற்றும் நிகழ்வுகளைத் திருத்துதல்
zh_cn: 编辑场景和实例

source: There is more to instances. With this feature, you can:
cs: Instance toho umožňují více. S těmito funkcemi mužete:
es: Hay más en las instancias. Con esta función, puede:
fr: Les instances ne s'arrêtent pas là. Avec cette fonctionnalité, vous pouvez :
ga: Tá níos mó ann le cásanna. Leis an ngné seo, is féidir leat:
ru: И это ещё не всё. С помощью этой особенности вы можете:
ta: நிகழ்வுகளுக்கு இன்னும் நிறைய இருக்கிறது. இந்த அம்சத்துடன், உங்களால் முடியும்:
zh_cn: 实例还有很多用法。使用这个特性，你可以：

source: Change the properties of one ball without affecting the others using the :ui:`Inspector`.
ru: Измените свойства одного шара, не затрагивая другие, с помощью :ui:`Inspector`.
zh_cn: 使用 :ui:`检查器`\ 修改一个小球的属性，这样不会影响到其他的小球。

source: Change the default properties of every Ball by opening the ``ball.tscn`` scene and making a change to the Ball node there. Upon saving, all instances of the Ball in the project will see their values update.
cs: Změnit výchozí vlastnosti všech míčů zaráz tak, že otevřete soubor ``ball.tscn`` a změníte uzel Ball v ní. Jakmile změny uložíte, všem instancím uzlu Ball v projektu se hodnoty aktualizují.
es: Cambia las propiedades predeterminadas de cada bola abriendo la escena ``ball.tscn`` y haciendo un cambio en el nodo Ball. Al guardar, todas las instancias de Ball en el proyecto tendrán sus valores actualizados.
fr: Modifiez les propriétés par défaut de toutes les balles en ouvrant la scène ``ball.tscn`` et en apportant une modification au nœud Ball. Après avoir enregistré les changements, toutes les instances de Ball dans le projet se verront mises à jour.
ga: Athraigh airíonna réamhshocraithe gach Liathróid tríd an radharc ``ball.tscn`` a oscailt agus athrú a dhéanamh ar an nód Liathróid ansin. Nuair a shábháil, feicfidh gach cás den Liathróid sa tionscadal a gcuid luachanna nuashonrú.
ru: Измените свойства по умолчанию для каждого шара, открыв сцену ``ball.tscn`` и внеся изменения в узел Ball там. После сохранения, все экземпляры Ball в проекте получат новые значения параметров.
ta: ஒவ்வொரு பந்தின் இயல்புநிலை பண்புகளையும் `` Ball.tscn`` காட்சியைத் திறந்து அங்குள்ள பந்து முனையில் மாற்றத்தை மாற்றவும். சேமித்தவுடன், திட்டத்தில் பந்தின் அனைத்து நிகழ்வுகளும் அவற்றின் மதிப்புகள் புதுப்பிப்பைக் காணும்.
zh_cn: 打开 ``ball.tscn`` 场景修改 Ball 节点，从而修改所有 Ball 的默认属性。在保存时，项目中所有 Ball 的实例都会更新其属性值。

source: Changing a property on an instance always overrides values from the corresponding packed scene.
cs: Změna vlastnosti v instanci vždy přepíše hodnotu z odpovídající zabalené scény.
es: Cambiar una propiedad en una instancia siempre anula los valores de la escena empaquetada correspondiente.
fr: La modification d'une propriété sur une instance a toujours priorité sur les valeurs de la scène emballée correspondante.
ga: Athraíonn athrú maoine ar chás luachanna ón radharc pacáilte comhfhreagrach i gcónaí.
ru: Изменение свойства экземпляра всегда переопределяет значения из соответствующей упакованной сцены.
ta: ஒரு சந்தர்ப்பத்தில் ஒரு சொத்தை மாற்றுவது எப்போதுமே தொடர்புடைய நிரம்பிய காட்சியில் இருந்து மதிப்புகளை மீறுகிறது.
zh_cn: 修改实例上的属性总是会覆盖对应打包场景中的值。

source: Let's try this. Double-click ``ball.tscn`` in the FileSystem to open it.
cs: Vyzkoušejme to. Dvojklikem na ``ball.tscn`` v Souborovém systému jej otevřete.
es: Intentemos esto. Haga doble clic en el archivo ``ball.tscn`` en el panel de *Sistema de Archivos* para abrirlo.
fr: Essayons ceci. Double-cliquez sur ``ball.tscn`` dans le Système de fichiers pour l'ouvrir.
ru: Давайте попробуем это. Дважды щелкните ``ball.tscn`` в файловой системе, чтобы открыть его.
zh_cn: 让我们来试一试。双击\ *文件系统*\ 面板中的 ``ball.tscn`` 来打开它。

source: In the Scene dock on the left, select the Ball node. Then, in the :ui:`Inspector` on the right, click on the :inspector:`PhysicsMaterial` property to expand it.
ru: В доке Scene слева выберите узел Ball. Затем в :ui:`Inspector` справа щелкните свойство :inspector:`PhysicsMaterial`, чтобы развернуть его.
zh_cn: 在左侧的场景停靠面板中选择 Ball 节点，然后在右侧的 :ui:`Inspector` 中点击展开 :inspector:`PhysicsMaterial` 属性。

source: Set its Bounce property to ``0.5`` by clicking on the number field, typing ``0.5``, and pressing :kbd:`Enter`.
cs: Nastavte jeho vlastnost Odraz na ``0.5``. To uděláte tak, že kliknete na číselné pole, napíšete ``0.5`` a zmáčknete :kbd:`Enter`.
es: Cambia su propiedad Bounce a ``0.5`` haciendo clic en el campo numérico, escribiendo ``0.5`` y presionando :kbd:`Enter`.
fr: Définissez sa propriété Bounce à ``0.5`` en cliquant sur le champ numérique, en tapant ``0.5`` et en appuyant sur :kbd:`Enter`.
ga: Socraigh a mhaoin Bounce go ``0.5`` trí chliceáil ar an réimse uimhreacha, clóscríobh ``0.5``, agus brú: kbd: `Iontráil`.
ru: Установите свойство Отскакивание (Bounce) в ``0.5``, щелкнув по полю с цифрами, введя ``0.5`` и нажав :kbd:`Enter`.
ta: எண் புலத்தைக் சொடுக்கு செய்வதன் மூலமும், `` 0.5`` தட்டச்சு செய்வதன் மூலமும், அழுத்துவதன் மூலமும் அதன் பவுன்ச் சொத்தை `` 0.5`` என அமைக்கவும்: KBD: `உள்ளிடவும்`.
zh_cn: 将其 Bounce（弹力）属性设为 ``0.5`` ，只要点击对应的数字字段、输入 ``0.5`` 、然后按 :kbd:`Enter` 就可以了。

source: Play the game by pressing :kbd:`F5` (:kbd:`Cmd + B` on macOS) and notice how all balls now bounce a lot more. As the Ball scene is a template for all instances, modifying it and saving causes all instances to update accordingly.
cs: Pro připomenutí, hru můžete znovu spustit stisknutím :kbd:`F5` (:kbd:`Cmd + B` na macOS). Míče nyní budou skákat mnohem více. Protože scéna Ball je šablonou pro všechny instance, když ji změníme, změníme odpovídajícím způsobem právě i je.
es: Juega el juego presionando F5 (Cmd + B en macOS) y observa cómo las pelotas ahora rebotan mucho más. Como la escena de la pelota es una plantilla para todas las instancias, al modificarla y guardarla, todas las instancias se actualizan en consecuencia.
fr: Jouez au jeu en appuyant sur :kbd:`F5` (:kbd:`Cmd + B` sur macOS) et remarquez comment toutes les balles rebondissent désormais beaucoup plus. Comme la scène Ball est un modèle pour toutes les instances, la modifier et l'enregistrer entraîne la mise à jour de toutes les instances en conséquence.
ga: Seinn an cluiche trí bhrú: kbd: `F5` (:kbd: `Cmd + B` ar macOS) agus tabhair faoi deara conas a bhuaileann gach liathróid i bhfad níos mó anois. Toisc gur teimpléad é radharc an Liathróid do gach cás, is cúis le gach cás a nuashonrú dá réir é a mhodhnú agus a shábháil.
ru: Запустите игру, нажав :kbd:`F5` (:kbd:`Cmd + B` на macOS), и обратите внимание, что все мячи теперь отскакивают гораздо сильнее. Поскольку сцена "Ball" является шаблоном для всех экземпляров, её изменение и сохранение приводит к соответствующему обновлению всех экземпляров.
ta: அழுத்துவதன் மூலம் விளையாட்டை விளையாடுங்கள்: KBD: `F5` (: KBD:` CMD + B` MACOS இல்) மற்றும் எல்லா பந்துகளும் இப்போது இன்னும் நிறைய குதிக்கின்றன என்பதைக் கவனியுங்கள். பந்து காட்சி எல்லா நிகழ்வுகளுக்கும் ஒரு வார்ப்புருவாக இருப்பதால், அதை மாற்றியமைத்தல் மற்றும் சேமிப்பது அனைத்து நிகழ்வுகளையும் அதற்கேற்ப புதுப்பிக்க காரணமாகிறது.
zh_cn: 按 :kbd:`F5` （在 macOS 中使用 :kbd:`Cmd + B` ） 运行游戏，请注意所有的小球都更有弹性了。因为 Ball 场景是所有实例的模板，对它进行修改并保存，就会导致所有实例同时进行更新。

source: Let's now adjust an individual instance. Head back to the Main scene by clicking on the corresponding tab above the viewport.
cs: Nyní pozměňme samostatnou instanci. Klikněte na opdovídající záložku nad průzorem a vraťte se zpět do hlavní scény Main.
es: Ahora ajustemos una instancia individual. Regrese a la escena principal haciendo clic en la pestaña correspondiente sobre la ventana gráfica.
fr: Ajustons maintenant une instance individuelle. Revenez à la scène Main en cliquant sur l'onglet correspondant au-dessus de la fenêtre d'affichage.
ga: Déanaimis cás aonair a choigeartú anois. Téigh ar ais go dtí an Príomh-radharc trí chliceáil ar an gcluaisín comhfhreagrach os cionn an amharc.
ru: Теперь давайте настроим отдельный экземпляр. Вернитесь к главной сцене, нажав на соответствующую вкладку над окном просмотра.
ta: இப்போது ஒரு தனிப்பட்ட நிகழ்வை சரிசெய்வோம். வியூபோர்ட்டுக்கு மேலே உள்ள தொடர்புடைய தாவலைக் சொடுக்கு செய்வதன் மூலம் முதன்மையான காட்சிக்குத் திரும்புக.
zh_cn: 现在让我们来调整单个实例。点击视口上方的对应选项卡回到 Main 场景。

source: Select one of the instanced Ball nodes and, in the :ui:`Inspector`, set its :inspector:`Gravity Scale` value to ``10``.
ru: Выберите один из экземпляров узла Ball и в :ui:`Inspector` установите значение :inspector:`Gravity Scale` равным ``10``.
zh_cn: 选择一个 Ball 实例节点，然后 :ui:`Inspector` 中将其 :inspector:`Gravity Scale` 设为 ``10``。

source: A grey "revert" button appears next to the adjusted property.
cs: Vedle pozměněné hodnoty se objeví šedé tlačítko "vrátit zpět".
es: Aparece un botón gris "revertir" junto a la propiedad ajustada.
fr: Un bouton gris "rétablir" apparaît à côté de la propriété ajustée.
ga: Tá cnaipe liath “ar ais” le feiceáil in aice leis an maoin choigeartaithe.
ru: Рядом с измененным свойством появится серая кнопка «вернуть».
ta: சரிசெய்யப்பட்ட சொத்துக்கு அடுத்ததாக ஒரு சாம்பல் "மாற்றியமைத்தல்" பொத்தானை தோன்றும்.
zh_cn: 在被调整过的属性旁边就会多一个灰色的“复原”按钮。

source: This icon indicates you are overriding a value from the source packed scene. Even if you modify the property in the original scene, the value override will be preserved in the instance. Clicking the revert icon will restore the property to the value in the saved scene.
cs: Tato ikona značí, že výchozí hodnotu ze zdrojové zabalené scény přepisujete. I když upravíte vlastnost v původní scéně, přepsání hodnoty bude v instanci zachováno. Kliknutím na ikonu vrátit zpět se vlastnost obnoví na hodnotu v uložené scéně.
es: Este icono indica que está anulando un valor de la escena empaquetada de origen. Incluso si modifica la propiedad en la escena original, la anulación del valor se conservará en la instancia. Al hacer clic en el icono de reversión, se restaurará la propiedad al valor de la escena guardada.
fr: Cette icône indique que vous remplacez une valeur de la scène source emballée(packed scene). Même si vous modifiez la propriété dans la scène originale, la valeur remplacée sera préservée dans l'instance. En cliquant sur l'icône de retour en arrière, vous restaurerez la valeur de la propriété dans la scène sauvegardée.
ga: Tugann an deilbhín seo le fios go bhfuil tú ag cur luach ón radharc pacáilte foinse. Fiú má mhodhnóidh tú an maoin sa radharc bunaidh, caomhnófar an athshárú luacha sa chás. Cliceáil ar an deilbhín ar ais, cuirfear an maoin ar ais ar ais go dtí an luach sa radharc sábhálta.
ru: Этот значок указывает на то, что вы переопределяете значение из исходной упакованной сцены. Даже если вы измените свойство в исходной сцене, переопределение значения будет сохранено в экземпляре. Нажатие на значок возврата приведет к восстановлению значения свойства в сохраненной сцене.
ta: இந்த படவுரு நீங்கள் மூல நிரம்பிய காட்சியில் இருந்து ஒரு மதிப்பை மீறுகிறீர்கள் என்பதைக் குறிக்கிறது. அசல் காட்சியில் உள்ள சொத்தை நீங்கள் மாற்றியமைத்தாலும், மதிப்பு மேலெழுதும் உதாரணமாக பாதுகாக்கப்படும். மாற்றியமைக்கப்பட்ட ஐகானைக் சொடுக்கு செய்தால், சேமிக்கப்பட்ட காட்சியின் மதிப்புக்கு சொத்தை மீட்டெடுக்கும்.
zh_cn: 这个图标表示你覆盖了源打包场景中的值。即使你修改了原始场景中的这个属性，这个覆盖后的值也还是会保留在这个实例中。点击复原图标会将属性恢复成保存场景中的值。

source: Rerun the game and notice how this ball now falls much faster than the others.
cs: Naposledy spusťte hru a sledujte, jak tento máč padá mnohem rychleji, než ostatní.
es: Vuelva a ejecutar el juego y observe cómo esta bola ahora cae mucho más rápido que las otras.
fr: Relancez le jeu et remarquez que cette balle tombe maintenant beaucoup plus vite que les autres.
ga: Déan an cluiche arís agus tabhair faoi deara mar a thiteann an liathróid seo i bhfad níos tapúla anois ná na cinn eile.
ru: Запустите игру заново и обратите внимание, что теперь этот шарик падает гораздо быстрее остальных.
ta: விளையாட்டை மீண்டும் இயக்கவும், இந்த பந்து இப்போது மற்றவர்களை விட மிக வேகமாக விழும் என்பதைக் கவனியுங்கள்.
zh_cn: 重新运行游戏，请注意这个小球会比其他小球落得快得多。

source: You may notice you are unable to change the values of the :inspector:`PhysicsMaterial` of the ball. This is because :inspector:`PhysicsMaterial` is a *resource*, and needs to be made unique before you can edit it in a scene that is linking to its original scene. To make a resource unique for one instance, right-click on the :inspector:`Physics Material` property in the :ui:`Inspector` and click :button:`Make Unique` in the context menu.
ru: Вы можете заметить, что вы не можете изменить значения :inspector:`PhysicsMaterial` мяча. Это потому, что :inspector:`PhysicsMaterial` — это *ресурс*, и его нужно сделать уникальным, прежде чем вы сможете редактировать его в сцене, которая ссылается на его исходную сцену. Чтобы сделать ресурс уникальным для одного экземпляра, щелкните правой кнопкой мыши свойство :inspector:`Physics Material` в :ui:`Inspector` и выберите :button:`Make Unique` в контекстном меню.
zh_cn: 您可能会注意到，无法修改球体的 :inspector:`PhysicsMaterial` 中的值。这是因为 :inspector:`PhysicsMaterial` 是一个 *资源*，在您把该资源所属场景链接到新场景中的情况下，要在新场景中编辑该资源，就必须先使该资源在新场景中变为独立。要使一个资源在某个出现它的地方变为独立，请在 :ui:`Inspector` 中右键点击 :inspector:`Physics Material` 属性，然后在上下文菜单中选择 :button:`Make Unique`。

source: Resources are another essential building block of Godot games we will cover in a later lesson.
cs: Zdroje jsou další základní stavební kámen her v Godotu a blíže je probereme v budoucí lekci.
es: Los recursos son otro bloque de construcción esencial de los juegos de Godot que cubriremos en una lección posterior.
fr: Les ressources sont un autre élément essentiel des jeux Godot que nous aborderons dans une prochaine leçon.
ga: Is bloc tógála riachtanach eile de chluichí Godot iad acmhainní a chlúdóimid i gceacht níos déanaí.
ru: Ресурсы - это ещё один важный компонент игры Godot, о котором мы расскажем в одном из последующих уроков.
ta: வளங்கள் கோடோட் விளையாட்டுகளின் மற்றொரு அத்தியாவசிய கட்டுமானத் தொகுதியாகும்.
zh_cn: 资源也是 Godot 游戏的关键组件，我们会在后续课程中介绍。

source: Scene instances as a design language
cs: Instance scén jako designový jazyk
es: Instancias de escena como lenguaje de diseño
fr: Les instances de scène en tant que langage de conception
ga: Cásanna radhairc mar theanga dearaidh
ru: Экземпляры сцены как дизайн языка
ta: வடிவமைப்பு மொழியாக காட்சி நிகழ்வுகள்
zh_cn: 作为设计语言的场景实例

source: Instances and scenes in Godot offer an excellent design language, setting the engine apart from others out there. We designed Godot around this concept from the ground up.
cs: Instance a scény v Godotu nabízejí vynikající návrhový jazyk, kterým se tento engine odlišuje od ostatních. Navrhli jsme jej od základů kolem tohoto konceptu.
es: Las instancias y escenas en Godot ofrecen un excelente lenguaje de diseño, lo que diferencia al motor de los demás. Diseñamos a Godot en torno a este concepto desde cero.
fr: Les instances et les scènes de Godot constituent un excellent langage de conception, qui distingue le moteur des autres. Nous avons conçu Godot autour de ce concept dès le départ.
ga: Tugann cásanna agus radhairc i Godot teanga dearaidh den scoth, ag leagan an t-inneall ar leithligh ó dhaoine eile amuigh ansin. Dhearamar Godot timpeall ar an gcoincheap seo ón talamh suas.
ru: Экземпляры и сцены в Godot предлагают отличный язык проектирования, выделяя движок среди других. Мы с самого начала разрабатывали Godot с учетом этой концепции.
ta: கோடோட்டில் உள்ள நிகழ்வுகளும் காட்சிகளும் ஒரு சிறந்த வடிவமைப்பு மொழியை வழங்குகின்றன, அங்கு இயந்திரத்தை வேறுபடுத்துகின்றன. இந்த கருத்தைச் சுற்றி கோடோட்டை தரையில் இருந்து வடிவமைத்தோம்.
zh_cn: Godot中的实例和场景提供了一种优秀的设计语言，使该引擎与其他引擎不同。我们从一开始就围绕这个概念设计Godot。
