Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/instancing.po
Languages: cs, es, fr, ga, ru, ta, zh_cn

source: We recommend dismissing architectural code patterns when making games with Godot, such as Model-View-Controller (MVC) or Entity-Relationship diagrams. Instead, you can start by imagining the elements players will see in your game and structure your code around them.
cs: Při vytváření her v Godotu vám doporučujeme zapomenout na architektonické návrhové vzory jako Model-View-Controller (MVC) nebo Entity-Relationship diagramy. Místo nich můžete začít tím, že si představíte jednotlivé prvky, které hráči ve vaší hře uvidí a svůj kód strukturovat kolem nich.
es: Recomendamos descartar los patrones de código arquitectónico al hacer juegos con Godot, como los diagramas Modelo-Vista-Controlador (MVC) o Entidad-Relación. En su lugar, puede comenzar imaginando los elementos que los jugadores verán en su juego y estructurar su código en torno a ellos.
fr: Nous vous recommandons d'écarter les modèles de code architecturaux lorsque vous créez des jeux avec Godot, comme les diagrammes Modèle-Vue-Contrôleur (MVC) ou Entité-Relation. Au lieu de cela, vous pouvez commencer par imaginer les éléments que les joueurs verront dans votre jeu et structurer votre code autour d'eux.
ga: Molaimid patrúin cód ailtireachta a dhiúscairt agus cluichí á dhéanamh le Godot, mar shampla Léaráidí Samhail-Amharc-Rialaitheoir (MVC) nó Léaráidí Caidrimh Aontaithe. Ina áit sin, is féidir leat tosú trí na heilimintí a fheicfidh imreoirí i do chluiche a shamhlú agus do chód a struchtúrú timpeall orthu.
ru: При создании игр с Godot мы рекомендуем отказаться от архитектурных шаблонов кода, таких как Model-View-Controller (MVC) или диаграммы Entity-Relationship. Вместо этого вы можете начать с того, чтобы представить себе элементы, которые игроки увидят в вашей игре, и структурировать код вокруг них.
ta: மாடல்-வியூ-கான்ட்ரோலர் (எம்.வி.சி) அல்லது நிறுவன-உறவு வரைபடங்கள் போன்ற கோடோட்டுடன் விளையாட்டுகளை உருவாக்கும்போது கட்டடக்கலை குறியீடு வடிவங்களை நிராகரிக்க பரிந்துரைக்கிறோம். அதற்கு பதிலாக, உங்கள் விளையாட்டில் வீரர்கள் காணும் உறுப்புகளை கற்பனை செய்வதன் மூலம் தொடங்கலாம் மற்றும் அவர்களைச் சுற்றியுள்ள உங்கள் குறியீட்டை கட்டமைக்கலாம்.
zh_cn: 我们建议在使用 Godot 制作游戏时忽略架构代码模式，例如模型-视图-控制器 （MVC） 或实体关系图。相反，你可以从想象玩家将在游戏中看到的元素开始，并围绕它们构建代码。

source: For example, you could break down a shooter game like so:
cs: Takto byste například mohli rozdělit střílečku:
es: Por ejemplo, podrías desglosar un juego de disparos así:
fr: Par exemple, vous pouvez décomposer un jeu de tir comme ceci :
ga: Mar shampla, d'fhéadfá cluiche lámhach a bhriseadh síos mar sin:
ru: Например, вот как можно представить себе простой шутер:
ta: எடுத்துக்காட்டாக, நீங்கள் ஒரு துப்பாக்கி சுடும் விளையாட்டை உடைக்கலாம்:
zh_cn: 例如，你可以这样拆解一个射击游戏：

source: You can come up with a diagram like this for almost any type of game. Each rectangle represents an entity that's visible in the game from the player's perspective. The arrows point towards the instantiator of each scene.
ru: Подобную диаграмму можно создать практически для любой игры. Каждый прямоугольник представляет собой сущность, видимую в игре с точки зрения игрока. Стрелки указывают на создателя каждой сцены.
zh_cn: 你可以为几乎任何类型的游戏绘制类似的图表。每个矩形代表从玩家视角可见的游戏实体。箭头指向每个场景的实例化者。

source: Once you have a diagram, we recommend creating a scene for each element listed in it to develop your game. You'll use instancing, either by code or directly in the editor, to build your tree of scenes.
cs: Jakmile máte připravený diagram, doporučujeme tvořit hru tak, že postupně vytvoříte scénu pro každý objekt v něm uvedený. Za pomoci instancování, ať už v kódu nebo přímo v editoru, tak vybudujete svůj strom scén.
es: Una vez que tengas un diagrama, recomendamos crear una escena para cada elemento listado en él para desarrollar tu juego. Utilizarás instanciación, ya sea por código o directamente en el editor para construir tu árbol de escenas.
fr: Une fois que vous avez un diagramme, nous vous recommandons de créer une scène pour chaque élément répertorié afin de développer votre jeu. Vous utiliserez l'instanciation, soit par code, soit directement dans l'éditeur, pour construire votre arbre de scènes.
ga: Nuair a bheidh léaráid agat, molaimid radharc a chruthú do gach eilimint atá liostaithe ann chun do chluiche a fhorbairt. Úsáidfidh tú instancáil, trí chód nó go díreach san eagarthóir, chun do chrann radhairc a thógáil.
ru: Когда у вас будет диаграмма, то для разработки вашей игры мы рекомендуем создать сцену для каждого элемента, перечисленного в ней. Для построения дерева сцен вы будете использовать инстацирование (создание экземпляров), либо с помощью кода, либо непосредственно в редакторе.
ta: உங்களிடம் ஒரு வரைபடம் கிடைத்ததும், உங்கள் விளையாட்டை உருவாக்க அதில் பட்டியலிடப்பட்டுள்ள ஒவ்வொரு உறுப்புக்கும் ஒரு காட்சியை உருவாக்க பரிந்துரைக்கிறோம். உங்கள் காட்சிகளின் மரத்தை உருவாக்க குறியீடு மூலமாகவோ அல்லது நேரடியாக எடிட்டரில் அல்லது நேரடியாக நிறுவனத்தைப் பயன்படுத்துவீர்கள்.
zh_cn: 在得到这样的图之后，建议你为其中的每一个元素都创建一个场景。你可以通过代码或者直接在编辑器里将其实例化来构建你的场景树。

source: Programmers tend to spend a lot of time designing abstract architectures and trying to fit components into it. Designing based on scenes makes development faster and more straightforward, allowing you to focus on the game logic itself. Because most game components map directly to a scene, using a design based on scene instantiation means you need little other architectural code.
cs: Programátoři při tvorbě her často stráví spoustu času navrhováním abstraktních architektur a snahou vměstnat do nich jednotlivé komponenty. Navrhování na základě scén vede k rychlejšímu a přímočařejšímu vývoji, u kterého se můžete soustředit na samotnou herní logiku. Protože většinu herních komponent lze přímo přeložit na scénu, budete díky využití designu založeném na instancování scén potřebovat jen minimum dodatečného kódu pro architekturu.
es: Los programadores tienden a pasar mucho tiempo diseñando arquitecturas abstractas y tratando de encajar componentes en ellas. El diseño basado en escenas hace que el desarrollo sea más rápido y sencillo, lo que le permite concentrarse en la lógica del juego en sí. Debido a que la mayoría de los componentes del juego se asignan directamente a una escena, el uso de un diseño basado en la creación de instancias de escena significa que necesita poco más código arquitectónico.
fr: Les programmeurs ont tendance à passer beaucoup de temps à concevoir des architectures abstraites et à essayer d'y intégrer des composants. La conception basée sur les scènes rend le développement plus rapide et plus simple, ce qui vous permet de vous concentrer sur la logique de jeu elle-même. La plupart des composants du jeu étant directement liés à une scène, l'utilisation d'une conception basée sur l'instanciation de scènes signifie que vous n'avez besoin que de peu de code architectural supplémentaire.
ga: Is gnách go gcaitheann ríomhchláraitheoirí go leor ama ag dearadh ailtireachtaí teibí agus ag iarraidh comhpháirteanna a chur isteach ann. Déanann dearadh bunaithe ar radhairc forbairt níos tapúla agus níos simplí, rud a ligeann duit díriú ar loighic an chluiche féin. Toisc go mapálann formhór na gcomhpháirteanna cluiche go díreach chuig radharc, is beag cód ailtireachta eile a theastaíonn uait ag baint úsáide as dearadh atá bunaithe ar mheandachas radharc.
ru: Программисты обычно тратят много времени на проектирование абстрактных архитектур и попытки вписать в них компоненты. Проектирование на основе сцен ускоряет и упрощает разработку, позволяя сосредоточиться на логике игры. Поскольку большинство компонентов игры напрямую связаны со сценами, использование дизайна, основанного на экземплярах сцен, означает, что вам нужен немного другой архитектурный код.
ta: புரோகிராமர்கள் சுருக்க கட்டமைப்புகளை வடிவமைப்பதற்கும் அதில் கூறுகளை பொருத்த முயற்சிப்பதற்கும் நிறைய நேரம் செலவிடுகிறார்கள். காட்சிகளை அடிப்படையாகக் கொண்டு வடிவமைப்பது வளர்ச்சியை விரைவாகவும் நேராகவும் செய்கிறது, இது விளையாட்டு தர்க்கத்தில் கவனம் செலுத்த உங்களை அனுமதிக்கிறது. பெரும்பாலான விளையாட்டு கூறுகள் நேரடியாக ஒரு காட்சிக்கு வரைபடமாக இருப்பதால், காட்சி இன்ச்டன்டேசனை அடிப்படையாகக் கொண்ட வடிவமைப்பைப் பயன்படுத்துவது என்பது உங்களுக்கு மற்ற கட்டடக்கலை குறியீடு தேவை என்பதாகும்.
zh_cn: 程序员们乐于花费大量时间来设计抽象的架构，尽力使得组件能够适用于这个架构。基于场景的设计取代了这种方法，使得开发更快、更直接，能够让你去专注于游戏逻辑本身。因为大多数游戏的组件都是直接映射成一个场景，所以使用基于场景实例化的设计意味着需要很少的其他架构代码。

source: Here's the example of a scene diagram for an open-world game with tons of assets and nested elements:
cs: Zde máme příklad diagramu scén pro hru s otevřeným světem, ve kterém potřebujeme spoustu zdrojů a vnořených prvků:
es: Aquí está el ejemplo de un diagrama de escena para un juego de mundo abierto con toneladas de activos y elementos anidados:
fr: Voici l'exemple d'un diagramme de scène pour un jeu en monde ouvert avec des tonnes de assets et d'éléments imbriqués :
ga: Seo an sampla de léaráid radhairc do chluiche domhan oscailte le tonna sócmhainní agus eilimintí neadaithe:
ru: Вот пример диаграммы сцены для игры с открытым миром с множеством ресурсов и вложенных элементов:
ta: டன் சொத்துக்கள் மற்றும் உள்ளமைக்கப்பட்ட கூறுகளைக் கொண்ட திறந்த-உலக விளையாட்டுக்கான காட்சி வரைபடத்தின் எடுத்துக்காட்டு இங்கே:
zh_cn: 这里是另一个更复杂的开放世界类游戏的示例，这个示例包括有很多资产和嵌套元素：

source: Imagine we started by creating the room. We could make a couple of different room scenes, with unique arrangements of furniture in them. Later, we could make a house scene that uses multiple room instances for the interior. We would create a citadel out of many instanced houses and a large terrain on which we would place the citadel. Each of these would be a scene instancing one or more sub-scenes.
cs: Řekněme, že chceme začít vytvořením místnosti. Mohli bychom vytvořit několik různých scén místností s rozličně rozmístěným nábytkem. Později bychom mohli vytvořit scénu domu, která využívá několik instancí místnosti pro definici vnitřku. Ze mnoha instancovaných domů bychom mohli vytvořit citadelu a tu umístit na rozsáhlý terén. Každá z těchto scén by instancovala jednu nebo více podscén.
es: Imagina que comenzamos creando la habitación. Podríamos hacer un par de escenas de habitaciones diferentes, con arreglos únicos de muebles en ellas. Más tarde, podríamos hacer una escena de casa que use instancias de varias habitaciones para el interior. Crearíamos una ciudadela a partir de muchas casas instanciadas y un gran terreno en el que colocaríamos la ciudadela. Cada uno de estos sería una escena que ejemplifica una o más sub-escenas.
fr: Imaginons que nous commencions par créer la pièce. Nous pourrions créer plusieurs scènes de pièces différentes, avec des arrangements uniques de meubles. Plus tard, nous pourrions créer une scène de maison qui utilise plusieurs instances de pièces pour l'intérieur. Nous pourrions créer une citadelle à partir de plusieurs maisons instanciées et d'un grand terrain sur lequel nous placerions la citadelle. Chacune d'entre elles serait une scène qui instaure une ou plusieurs sous-scènes.
ga: Samhlaigh gur thosaigh muid ag cruthú an seomra. D'fhéadfaimis cúpla radharc seomra éagsúla a dhéanamh, le socruithe uathúla troscáin iontu. Níos déanaí, d'fhéadfaimis radharc tí a dhéanamh a úsáideann cásanna iolracha seomra don taobh istigh. Chruthóimid citadel as go leor tithe inseansaithe agus tír-raon mór ar a gcuirfimid an citadel. Bheadh gach ceann díobh seo ina radharc ag cur fo-radhairc amháin nó níos mó.
ru: Представьте, что мы начали с создания комнаты. Мы могли бы сделать пару разных комнатных сцен с уникальной расстановкой мебели в них. Позже мы могли бы создать сцену дома, в которой для интерьера использовалось бы несколько экземпляров комнаты. Мы создадим цитадель из множества экземпляров домов и большого ландшафта, на котором мы разместим цитадель. Каждая из них будет сценой, создающей одну или несколько вложенных сцен.
ta: அறையை உருவாக்குவதன் மூலம் நாங்கள் தொடங்கினோம் என்று கற்பனை செய்து பாருங்கள். நாங்கள் இரண்டு வெவ்வேறு அறை காட்சிகளை உருவாக்க முடியும், அவற்றில் தளபாடங்களின் தனித்துவமான ஏற்பாடுகள் உள்ளன. பின்னர், உட்புறத்திற்கு பல அறை நிகழ்வுகளைப் பயன்படுத்தும் ஒரு வீட்டு காட்சியை நாங்கள் உருவாக்க முடியும். பல நிறுவப்பட்ட வீடுகளில் இருந்து ஒரு கோட்டையையும், ஒரு பெரிய நிலப்பரப்பையும் உருவாக்குவோம், அதில் நாங்கள் சிட்டாடலை வைப்போம். இவை ஒவ்வொன்றும் ஒன்று அல்லது அதற்கு மேற்பட்ட துணை திரைகளை நிறுவும் காட்சியாக இருக்கும்.
zh_cn: 想象一下，我们从创建房间开始。我们可以制作几个不同的房间场景，在其中有独特的家具安排。后来，我们可以制作一个房屋场景，在内部使用多个房间实例。我们将用许多实例化的房子和一个大的地形来创建一个城堡，我们将把城堡放在这个地形上。每一个场景都将是一个或多个子场景的实例。

source: Later, we could create scenes representing guards and add them to the citadel. They would be indirectly added to the overall game world.
cs: Později bychom mohli vytvořit scény představující stráže přidat je do citadely. Tím bychom je také nepřímo přidali do celého herního světa.
es: Más tarde, podríamos crear escenas que representaran a los guardias y agregarlos a la ciudadela. Se agregarían indirectamente al mundo general del juego.
fr: Plus tard, nous pourrions créer des scènes représentant des gardes et les ajouter à la citadelle. Ils seraient indirectement ajoutés à l'univers global du jeu.
ga: Níos déanaí, d'fhéadfaimis radhairc a chruthú a léiríonn gardaí agus iad a chur leis an gcathadel. Cuirfí iad go hindíreach le domhan iomlán an chluiche.
ru: Позже мы можем создать сцены, которые представляют собой стражников, и добавить их в нашу крепость. Потом, они будут добавлены в общий игровой мир.
ta: பின்னர், நாங்கள் காவலர்களைக் குறிக்கும் காட்சிகளை உருவாக்கி அவற்றை சிட்டாடலில் சேர்க்கலாம். அவை ஒட்டுமொத்த விளையாட்டு உலகில் மறைமுகமாக சேர்க்கப்படும்.
zh_cn: 之后，我们可以创建代表守卫的场景，将它们加到城堡之中。也就会间接地加到了游戏世界里。

source: With Godot, it's easy to iterate on your game like this, as all you need to do is create and instantiate more scenes. We designed the editor to be accessible to programmers, designers, and artists alike. A typical team development process can involve 2D or 3D artists, level designers, game designers, and animators, all working with the Godot editor.
cs: V Godotu je takovéto postupné budování vaší hry snadné, protože vše, co musíte udělat, je vytvořit a instancovat více scén. Editor jsme navrhli tak, aby byl uživatelsky přívětivý pro programátory, návrháře i umělce. Typický týmový vývojový proces zahrnuje 2D nebo 3D umělce, návrháře úrovní, herní návrháře a animátory, kteří všichni můžou pracovat v editoru Godotu.
es: Con Godot, es fácil iterar en tu juego de esta manera, ya que todo lo que necesitas hacer es crear e instanciar más escenas. Diseñamos el editor para que fuera accesible a programadores, diseñadores y artistas por igual. Un proceso típico de desarrollo en equipo puede involucrar a artistas 2D o 3D, diseñadores de niveles, diseñadores de juegos y animadores, todos trabajando con el editor Godot.
fr: Avec Godot, il est facile d’itérer sur votre jeu de cette façon, car tout ce que vous avez à faire est de créer et d’instaurer plus de scènes. Nous avons conçu l'éditeur pour qu'il soit accessible aux programmeurs, aux concepteurs et aux artistes. Un processus typique de développement en équipe peut impliquer des artistes 2D ou 3D, des concepteurs de niveaux, des concepteurs de jeux et des animateurs, qui travaillent tous avec l'éditeur Godot.
ga: Le Godot, tá sé furasta athrá a dhéanamh ar do chluiche mar seo, mar níl le déanamh agat ach níos mó radhairc a chruthú agus a chur ar aghaidh. Dhearamar an eagarthóir le bheith inrochtana do ríomhchláraitheoirí, dearthóirí agus ealaíontóirí araon Is féidir le gnáthphróiseas forbartha foirne ealaíontóirí 2D nó 3D, dearthóirí leibhéil, dearthóirí cluichí, agus beochanaithe, uile ag obair leis an eagarthóir Godot.
ru: С помощью Godot можно легко итерационно дорабатывать игру, ведь всё, что вам нужно - это создавать и инстанцировать новые сцены. Мы разработали редактор так, чтобы он был доступен и программистам, и дизайнерам, и художникам. В типичном процессе командной разработки могут участвовать 2D или 3D художники, дизайнеры уровней, гейм-дизайнеры и аниматоры, и все они работают с редактором Godot.
ta: கோடோட் மூலம், இது போன்ற உங்கள் விளையாட்டை மீண்டும் கூறுவது எளிதானது, ஏனெனில் நீங்கள் செய்ய வேண்டியது எல்லாம் பல காட்சிகளை உருவாக்கி உடனடிப்படுத்துவதாகும். புரோகிராமர்கள், வடிவமைப்பாளர்கள் மற்றும் கலைஞர்களுக்கு ஒரே மாதிரியாக அணுக ஆசிரியரை வடிவமைத்தோம். ஒரு பொதுவான குழு மேம்பாட்டு செயல்முறையில் 2D அல்லது 3D கலைஞர்கள், நிலை வடிவமைப்பாளர்கள், விளையாட்டு வடிவமைப்பாளர்கள் மற்றும் அனிமேட்டர்கள் ஆகியவை அடங்கும், இவை அனைத்தும் கோடோட் எடிட்டருடன் பணிபுரியும்.
zh_cn: 使用 Godot，就可以很容易地像这样迭代你的游戏，因为你需要做的就是创建并实例化更多的场景。我们将编辑器设计成了易于程序员、设计师、艺术家使用的形式。一个典型的团队开发过程会涉及 2D 或 3D 美术、关卡设计师、游戏设计师、动画师等，他们都可以用 Godot 编辑器工作。

source: Summary
cs: Shrnutí
es: Sumario
fr: Résumé
ga: Achoimre
ru: Подведение итогов
ta: சுருக்கம்
zh_cn: 总结

source: Instancing, the process of producing an object from a blueprint, has many handy uses. With scenes, it gives you:
cs: Instancování je proces, ve kterém vytváříme objekty ze šablony. Je velmi užitečný. Ve spojení se scénami vám umožňuje:
es: La creación de instancias, el proceso de producción de un objeto a partir de una guía/descripción, tiene muchos usos prácticos. Con escenas, te permite:
fr: L'instanciation, le processus de création d'un objet à partir d'un modèle, a de nombreux usages pratiques. Avec les scènes, il vous donne :
ga: Tá go leor úsáidí áisiúla ag instancing, an próiseas chun réad a tháirgeadh ó threoirphrionta. Le radhairc, tugann sé duit:
ru: Инстанцирование, процесс создания объекта из шаблона имеет множество полезных применений. Со сценами это даёт вам:
ta: ஒரு வரைபடத்திலிருந்து ஒரு பொருளை உருவாக்கும் செயல்முறை, பல எளிமையான பயன்பாடுகளைக் கொண்டுள்ளது. காட்சிகளுடன், இது உங்களுக்கு வழங்குகிறது:
zh_cn: 实例化，从蓝图生成对象的过程有许多方便的用途。通过场景，它为你提供：

source: The ability to divide your game into reusable components.
cs: Rozdělit hru na opakovaně použitelné komponenty.
es: La habilidad para dividir tu juego en componentes reutilizables.
fr: La possibilité de diviser votre jeu en composants réutilisables.
ga: An cumas do chluiche a roinnt ina chomhpháirteanna ath-inúsáidte.
ru: Возможность разделить свою игру на многократно используемые компоненты.
ta: உங்கள் விளையாட்டை மீண்டும் பயன்படுத்தக்கூடிய கூறுகளாகப் பிரிக்கும் திறன்.
zh_cn: 能将你的游戏分离成可以重复利用的组件。

source: A tool to structure and encapsulate complex systems.
cs: Strukturovat komplexní systémy a zapouzdřit je.
es: Una herramienta para estructurar y encapsular sistemas complejos.
fr: Un outil pour structurer et encapsuler les systèmes complexes.
ga: Uirlis chun córais chasta a struchtúrú agus a chumhdú.
ru: Инструмент для структурирования и инкапсуляции сложных систем.
ta: சிக்கலான அமைப்புகளை கட்டமைக்கவும் இணைக்கவும் ஒரு கருவி.
zh_cn: 一个构建和封装复杂系统的工具。

source: A language to think about your game project's structure in a natural way.
cs: Přirozeně přemýšlet nad vaším projektem a navrhovat jeho strukturu.
es: Un lenguaje para pensar en la estructura de tu proyecto de juego de forma natural.
fr: Un langage pour réfléchir à la structure de votre projet de jeu de manière naturelle.
ga: Teanga chun smaoineamh ar struchtúr do thionscadal cluiche ar bhealach nádúrtha.
ru: Язык, позволяющий думать о структуре вашего игрового проекта естественным образом.
ta: உங்கள் விளையாட்டு திட்டத்தின் கட்டமைப்பைப் பற்றி இயற்கையான வழியில் சிந்திக்க ஒரு மொழி.
zh_cn: 一种以自然方式思考游戏项目结构的语言。

source: Extract the archive on your computer. To import it, you need the Project Manager. The Project Manager is accessed by opening Godot, or if you already have Godot opened, click on *Project -> Quit to Project List* (:kbd:`Ctrl + Shift + Q`, :kbd:`Ctrl + Option + Cmd + Q` on macOS)
cs: Rozbalte archiv ve svém počítači. Abyste jej importovali, potřebujete Správce projektů. Správce souborů se otevře při spuštění Godotu, případně pokud máte Godot již otevřený, kliněte na *Projekt -> Ukončit do seznamu projektů*. (:kbd:`Ctrl + Shift + Q`, :kbd:`Ctrl + Option + Cmd + Q` na macOS)
es: Extrae el archivo en tu computadora. Para importarlo, necesitas el Administrador de Proyectos. El Administrador de Proyectos se accede abriendo Godot o, si ya lo tenías abierto, haz clic en *Proyecto -> Salir al Listado de Proyectos* (:kbd:`Ctrl + Shift + Q`, :kbd:`Ctrl + Option + Cmd + Q` on macOS)
fr: Extrayez l'archive sur votre ordinateur. Pour l'importer, vous avez besoin du gestionnaire de projets. Le gestionnaire de projets est accessible en ouvrant Godot, ou si vous avez déjà Godot ouvert, cliquez sur *Projet -> Quitter vers la liste des projets* (:kbd:`Ctrl + Shift + Q`, :kbd:`Ctrl + Option + Cmd + Q` sur macOS)
ga: Íosluchtaigh cartlann ar do ríomhaire. Chun é a allmhairiú, beidh an Bainisteoir Tionscadail uait. Is féidir an Bainisteoir Tionscadail a rochtain trí Godot a oscailt, nó má tá Godot oscailte agat cheana féin, cliceáil ar *Tionscadal -> Scoir go Liosta an Tionscadail* (:kbd:`Ctrl + Shift + Q`, :kbd:`Ctrl + Option + Cmd + Q` ar macOS)
ta: உங்கள் கணினியில் காப்பகத்தை பிரித்தெடுக்கவும். அதை இறக்குமதி செய்ய, உங்களுக்கு திட்ட மேலாளர் தேவை. கோடோட்டைத் திறப்பதன் மூலம் திட்ட மேலாளர் அணுகப்படுகிறார், அல்லது நீங்கள் ஏற்கனவே கோடோட் திறந்திருந்தால், * திட்டம் -> திட்ட பட்டியலுக்கு வெளியேறு * Q` on Macos)

source: In the Project Manager, click the *Import* button to import the project.
cs: Ve Správci projektů importujete projekt kliknutím na tlačítko *Import*.
es: Dentro del Administrador de Proyectos, haz clic en el botón *Importar* para importar el proyecto.
fr: Dans le gestionnaire de projets, cliquez sur le bouton *Importer* pour importer le projet.
ga: Sa Bhainisteoir Tionscadail, cliceáil ar an gcnaipe *Iompórtáil* chun an tionscadal a allmhairiú.
ta: திட்ட மேலாளரில், திட்டத்தை இறக்குமதி செய்ய * இறக்குமதி * பொத்தானைக் சொடுக்கு செய்க.

source: Finally, click the Import & Edit button.
cs: A nyní klikněte na tlačítko Importovat a upravit.
es: Finalmente, haz clic en el botón Importar y editar.
fr: Enfin, cliquez sur le bouton Importer et Modifier.
ga: Ar deireadh, cliceáil ar an gcnaipe Iompórtáil agus Eagar.
ta: இறுதியாக, இறக்குமதி மற்றும் திருத்து பொத்தானைக் சொடுக்கு செய்க.

source: A window notifying you that the project was last opened in an older Godot version may appear, that's not an issue. Click *Ok* to open the project.
cs: Může se objevit okno s upozorněním, že projekt byl naposledy otevřen ve starší verzi Godotu. To není problém, jednoduše otevřete projekt kliknutím na *OK*.
es: Puede aparecer una ventana que le notifique que el proyecto se abrió por última vez en una versión anterior de Godot; no hay problema. Haz clic en *Aceptar* para abrir el proyecto.
fr: Une fenêtre vous informant que le projet a été ouvert pour la dernière fois dans une ancienne version Godot peut apparaître, ce n'est pas un problème. Cliquez sur *Ok* pour ouvrir le projet.

source: Change the properties of one ball without affecting the others using the Inspector.
cs: Měnit v Inspektoru vlastnosti jednoho míče bez toho, abyste ovlivnili ostatní.
es: Cambia las propiedades de una bola sin afectar a las demás usando el Inspector.
fr: Modifiez les propriétés d'une balle sans affecter les autres en utilisant l'inspecteur.
ga: Athraigh airíonna liathróid amháin gan cur isteach ar na cinn eile ag baint úsáide as an gCigire.
ta: இன்ச்பெக்டரைப் பயன்படுத்தி மற்றவர்களைப் பாதிக்காமல் ஒரு பந்தின் பண்புகளை மாற்றவும்.

source: In the Scene dock on the left, select the Ball node. Then, in the Inspector on the right, click on the PhysicsMaterial property to expand it.
cs: V levém doku Scéna vyberte uzel Ball. Poté v Inspektoru napravo rozbalte vlastnost PhysicsMaterial tím, že na ni kliknete.
fr: Dans le dock de Scène à gauche, sélectionnez le nœud Ball. Ensuite, dans l'inspecteur à droite, cliquez sur la propriété PhysicsMaterial pour la développer.
