Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_first_script.po
Languages: cs, ga, it, ta, tr, zh_hans

source: We define a local variable named ``velocity``, a 2D vector representing both a direction and a speed. To make the node move forward, we start from the Vector2 class's constant ``Vector2.UP``, a vector pointing up, and rotate it by calling the Vector2 method ``rotated()``. This expression, ``Vector2.UP.rotated(rotation)``, is a vector pointing forward relative to our icon. Multiplied by our ``speed`` property, it gives us a velocity we can use to move the node forward.
cs: Definujeme místní proměnnou s názvem ``velocity`` ("rychlost") jako 2D vektor, který představuje směr a rychlost. Aby se uzel posunul vpřed, začneme konstantou třídy Vector2 ``Vector2.UP``, což je vektor směřující nahoru. Ten otočíme voláním metody Vector2 ``rotated()`` ("otočený"). Tento výraz, ``Vector2.UP.rotated(rotation)``, je vektor směřující dopředu vzhledem k naší ikoně. Vynásobeno vlastností ``speed`` nám to dává rychlost, kterou můžeme použít k pohybu uzlu dopředu.
ga: Sainmhínímid athróg áitiúil darb ainm ``luas ``, veicteoir 2D a léiríonn treo agus luas araon. Chun an nód a chur ar aghaidh, tosaímid ó thairiseach ranga Vector2 ``Vector2.up ``, veicteoir ag cur síos, agus rothlaímid é tríd an modh Vector2 a ghlaoch ``rothlú ()``. Is veicteoir é an abairt seo, `Vector2.up.Rotated (rothlú) `, ag díriú ar aghaidh i gcoibhneas lenár ndeilbhín. Iolraithe lenár maoin ``luas`, tugann sé treoluas dúinn is féidir linn a úsáid chun an nód a bhogadh ar aghaidh.
it: Definiamo una variabile locale chiamata ``velocity``, un vettore 2D che rappresenta sia la direzione sia la velocità. Per far muovere il nodo in avanti, partiamo dalla costante ``Vector2.UP`` della classe Vector2, un vettore che punta verso l'alto, e lo ruotiamo chiamando il metodo ``rotated()`` di Vector2. Questa espressione, ``Vector2.UP.rotated(rotation)``, è un vettore che punta in avanti rispetto alla nostra icona. Moltiplicata per la nostra proprietà ``speed``, otteniamo la velocità che possiamo usare per muovere il nodo in avanti.
ta: திசை மற்றும் விரைவு இரண்டையும் குறிக்கும் 2 டி திசையன் `` வேகம்` என்ற உள்ளக மாறியை நாங்கள் வரையறுக்கிறோம். முனை முன்னேற, வெக்டர் 2 வகுப்பின் மாறிலி `` vector2.up``, ஒரு திசையன் சுட்டிக்காட்டி, அதை சுழற்றி, திசையன் 2 முறையை `` சுழற்றப்பட்ட () `` என்று அழைப்பதன் மூலம் அதை சுழற்றுவோம். இந்த வெளிப்பாடு, `` vector2.up.rotated (சுழற்சி) ``, எங்கள் ஐகானுடன் ஒப்பிடும்போது முன்னோக்கி சுட்டிக்காட்டும் ஒரு திசையன் ஆகும். எங்கள் `` வேகம்`` சொத்தால் பெருக்கப்படுகிறது, இது முனையை முன்னோக்கி நகர்த்துவதற்கு நாம் பயன்படுத்தக்கூடிய வேகத்தை அளிக்கிறது.
tr: Hem yönü hem de hızı temsil eden bir 2B vektör olan ``velocity`` (hız vektörü) adında bir yerel değişken tanımlıyoruz. Düğümün ileri doğru hareket etmesini sağlamak için Vector2 sınıfının ``Vector2.UP`` sabitinden, yani yukarı bakan bir vektörden başlıyoruz ve Vector2 yöntemi olan ``rotated()`` çağırarak onu döndürüyoruz. Bu ifade, ``Vector2.UP.rotated(rotation)``, simgemize göre ileriyi gösteren bir vektördür. ``speed``(hız) özelliğimizle çarpıldığında, bize düğümü ileri taşımak için kullanabileceğimiz bir hız vektörü verir. (velocity ve speed dilimizde "hız" diye geçer, ilki bir vektör ikincisi ise sadece bir sayıdır).
zh_hans: 我们定义一个名为 ``velocity`` 的局部变量，该变量是用于表示方向和速度的 2D 向量。要让节点向前移动，我们可以从 Vector2 类的常量 ``Vector2.UP`` 入手，这个向量指向上方，调用 ``Vector2`` 的 ``rotated()`` 方法可以将其进行旋转。表达式 ``Vector2.UP.rotated(rotation)`` 表示的是指向图标前方的向量。用这个方向与我们的 ``speed`` 属性相乘后，得到的就是用来移动节点的速度。

source: We add ``velocity * delta`` to the node's ``position`` to move it. The position itself is of type :ref:`Vector2 <class_Vector2>`, a built-in type in Godot representing a 2D vector.
cs: Přičteme ``velocity * delta`` k ``position`` ("pozici") uzlu, abychom jej posunuli. Samotná pozice je typu :ref:`Vector2 <class_Vector2>`, což je vestavěný typ Godotu představující 2D vektor.
ga: Cuirimid ``velocity * delta`` le ``suíomh`` an nód chun é a bhogadh. Is cineál é an suíomh féin :ref:`Vector2 <class_Vector2>`, cineál ionsuite in Godot a ionadaíonn do veicteoir 2T.
it: Aggiungiamo ``velocity * delta`` alla ``position`` del nodo per spostarlo. La posizione stessa è di tipo :ref:`Vector2 <class_Vector2>`, un tipo integrato in Godot che rappresenta un vettore 2D.
ta: அதை நகர்த்த முனையின் `` நிலை`` இல் `` விரைவு * டெல்டா`` ஐச் சேர்க்கிறோம். நிலை தானே வகை: ref: `vector2 <class_vector2>`, 2D திசையனைக் குறிக்கும் கோடோட்டில் உள்ளமைக்கப்பட்ட வகை.
tr: Hareket ettirmek için düğümün konumuna, ``position``, ``velocity * delta`` ekleriz. Konumun kendisi de aslında :ref:`Vector2 <class_Vector2>` (Godot içinde yerleşik 2B vektörü temsil eden) tipindedir.
zh_hans: 我们在节点的 ``position`` 里加上 ``velocity * delta`` 来实现移动。位置本身是 :ref:`Vector2 <class_Vector2>` 类型的，是 Godot 用于表示 2D 向量的内置类型。

source: Run the scene to see the Godot head run in circles.
cs: Spusťte scénu a uvidíte hlavu Godotu běhat v kruhu.
ga: Rith an radharc chun ceann Godot a fheiceáil ag rith i gciorcail.
it: Esegui la scena per vedere la testa di Godot girare in tondo.
ta: கோடோட் தலை வட்டங்களில் ஓடுவதைக் காண காட்சியை இயக்கவும்.
tr: Sahneyi çalıştırın ve Godot kafasının bir daire şeklinde hareket ettiğini görün.
zh_hans: 运行场景就可以看到 Godot 头像在绕圈圈。

source: Moving a node like that does not take into account colliding with walls or the floor. In :ref:`doc_your_first_2d_game`, you will learn another approach to moving objects while detecting collisions.
cs: Takový pohyb uzlu nebere v úvahu kolize se stěnami nebo podlahou. V návodu :ref:`doc_your_first_2d_game` se naučíte jiný přístup k pohybování objektů se současnou detekcí kolizí.
ga: Ní chuirtear san áireamh imbhualadh le ballaí nó leis an urlár a bhogadh nód mar sin. In:ref: `doc_your_first_2d_game`, foghlaimeoidh tú cur chuige eile maidir le rudaí a bhogadh agus imbhuailtí a bhrath.
it: Spostare un nodo in questo modo non tiene conto delle collisioni con muri o pavimento. In :ref:`doc_your_first_2d_game`, imparerai un altro approccio per spostare gli oggetti mentre si rilevano le collisioni.
ta: அதுபோன்ற ஒரு முனையை நகர்த்துவது சுவர்கள் அல்லது தரையுடன் மோதுவதை கணக்கில் எடுத்துக்கொள்ளாது. இல்: குறிப்பு: `doc_your_first_2d_game`, மோதல்களைக் கண்டறியும் போது பொருள்களை நகர்த்துவதற்கான மற்றொரு அணுகுமுறையை நீங்கள் கற்றுக்கொள்வீர்கள்.
tr: Bir düğümü bu şekilde hareket ettirmek, duvarlar veya yer ile çarpışmaları hesaba katmaz. :ref:`doc_your_first_2d_game` bölümünde, çarpışma algılaması kullanarak nesneleri hareket ettireceğiniz başka bir yaklaşımı öğreneceksiniz.
zh_hans: 使用这样的方法不会考虑与墙壁和地面的碰撞。在 :ref:`doc_your_first_2d_game` 中，你会学到另一种移动对象的方法，可以检测碰撞。

source: Our node currently moves by itself. In the next part, :ref:`doc_scripting_player_input`, we'll use player input to control it.
cs: Náš uzel se aktuálně pohybuje sám od sebe. V příští části, :ref:`doc_scripting_player_input`, použijeme k jeho ovládání hráčský vstup.
ga: Bogann ár nód féin faoi láthair. Sa chéad chuid eile, :ref: `doc_scripting_player_input`, úsáidfimid ionchur imreora chun é a rialú.
it: Il nostro nodo al momento si muove da solo. Nella prossima parte, :ref:`doc_scripting_player_input`, useremo l'input del giocatore per controllarlo.
ta: எங்கள் முனை தற்போது தானாகவே நகர்கிறது. அடுத்த பகுதியில்,: ref: `doc_scripting_player_input`, அதைக் கட்டுப்படுத்த பிளேயர் உள்ளீட்டைப் பயன்படுத்துவோம்.
tr: Düğümümüz şu anda kendi kendine hareket ediyor. Bir sonraki bölümde, :ref:`doc_scripting_player_input`, onu kontrol etmek için oyuncu girdisini kullanacağız.
zh_hans: 我们的节点目前是自行移动的。在下一部分 :ref:`doc_scripting_player_input` 中，我们会让玩家的输入来控制它。

source: Complete script
cs: Kompletní skript
ga: Script iomlán
it: Script completo
ta: முழுமையான ச்கிரிப்ட்
tr: Tamamlanmış betik
zh_hans: 完整脚本

source: Here is the complete ``sprite_2d.gd`` file for reference.
cs: Zde je pro vaši kontrolu celý soubor ``sprite_2d.gd``.
ga: Seo an comhad iomlán ``sprite_2d.gd`` le haghaidh tagartha.
it: Ecco il file ``sprite_2d.gd`` completo per riferimento.
ta: குறிப்புக்கு முழுமையான `` ச்ப்ரைட்_2 டி.சி.டி`` கோப்பு இங்கே.
tr: İşte başvuru amacıyla ``sprite_2d.gd`` dosyasının tamamı.
zh_hans: 这是完整的 ``sprite_2d.gd`` 文件，仅供参考。

source: In this lesson, you will code your first script to make the Godot icon turn in circles. As we mentioned :ref:`in the introduction <doc_introduction_learning_programming>`, we assume you have programming foundations.
zh_hans: 在本课中，你将会用 GDScript 编写第一个脚本，使 Godot 图标转圈。正如我们在\ :ref:`介绍 <doc_introduction_learning_programming>`\ 中提到的，我们假设你有编程基础。

source: This tutorial is written for GDScript, and the equivalent C# code is included in another tab of each codeblock for convenience.
zh_hans: 本教程使用GDScript编写，每个代码块均附带独立标签页展示等效的C#实现以便参考。

source: To learn more about GDScript, its keywords, and its syntax, head to the :ref:`doc_gdscript` section. To learn more about C#, head to the :ref:`doc_c_sharp` section.
zh_hans: 要了解更多关于GDScript、其关键字以及其语法等信息，请前往 :ref:`doc_gdscript` 部分。要了解更多关于C#的信息，请前往 :ref:`doc_c_sharp` 部分。

source: We need to create a Sprite2D node to display it in the game. In the :ui:`Scene` dock, click the :button:`Other Node` button.
zh_hans: 我们需要创建一个 Sprite2D 节点来在游戏中显示它。在 :ui:`Scene` 停靠面板中，点击 :button:`Other Node` 按钮。

source: Your :ui:`Scene` tab should now only have a Sprite2D node.
zh_hans: 你的 :ui:`Scene` 选项卡现在应该只包含一个 Sprite2D 节点。

source: A Sprite2D node needs a texture to display. In the :ui:`Inspector` on the right, you can see that the :inspector:`Texture` property says ``<empty>``. To display the Godot icon, click and drag the file ``icon.svg`` from the FileSystem dock onto the Texture slot.
zh_hans: Sprite2D 节点需要一个贴图来显示。在右侧 :ui:`Inspector` 中，可以看到 :inspector:`Texture` 属性写着 ``<空>``。要显示 Godot 图标，请从“文件系统”停靠面板，将 ``icon.svg`` 文件拖放到 Texture 槽位上。

source: To create and attach a new script to our node, right-click on Sprite2D in the Scene dock and select :button:`Attach Script`.
zh_hans: 右键点击场景面板中的 Sprite2D，选择 :button:`Attach Script`，以创建新的脚本并附加到我们的节点。

source: The :ui:`Attach Node Script` window appears. It allows you to select the script's language and file path, among other options.
zh_hans: 将弹出 :ui:`Attach Node Script` 窗口。你可以在此选择脚本的语言、设置文件路径及其他选项。

source: Change the :ui:`Template` field from ``Node: Default`` to ``Object: Empty`` to start with a clean file. Leave the other options set to their default values and click the :button:`Create` button to create the script.
zh_hans: 把 :ui:`Template` 从 ``Node: Default`` 改为 ``Object: Empty`` 从而得到一个干净的脚本文件。其他选项保持默认，然后点击 :button:`Create` 按钮来创建脚本。

source: The :ui:`Script` workspace should appear with your new ``sprite_2d.gd`` file open and the following line of code:
zh_hans: 此时 :ui:`Script` 工作区将自动打开并显示新建的 ``sprite_2d.gd`` 文件，包含以下代码：

source: Inherited properties include the ones you can see in the :ui:`Inspector` dock, like our node's ``texture``.
zh_hans: 继承的属性包括你在 :ui:`Inspector` 停靠面板中能看到的属性，例如我们这个节点的 ``texture``。

source: By default, the :ui:`Inspector` displays a node's properties in "Title Case", with capitalized words separated by a space. In GDScript code, these properties are in "snake_case", which is lowercase with words separated by an underscore.
zh_hans: :ui:`Inspector` 默认使用“Title Case”来展示节点的属性：单词首字母大写，并用空格进行分隔；在 GDScript 中，这些属性则使用“snake_case”：全小写、用下划线分隔单词。

source: You can hover over any property's name in the :ui:`Inspector` to see a description and its identifier in code.
zh_hans: 你可以将鼠标悬停在 :ui:`Inspector` 中任何属性的名称上，查看其描述和在代码中的标识符。

source: Save the scene as ``sprite_2d.tscn`` if you haven't already, then press :kbd:`F6` (:kbd:`Cmd + R` on macOS) to run it. Look at the :ui:`Output` bottom panel that expands. It should display "Hello, world!".
zh_hans: 如果你还没有保存场景，请将其保存为 ``sprite_2d.tscn``，然后按 :kbd:`F6`（macOS 上为 :kbd:`Cmd + R`）来运行它。看一下底部展开的 :ui:`Output` 面板，它应该显示“Hello, world!”。

source: It's time to make our node move and rotate. To do so, we're going to add two member variables to our script: the movement speed in pixels per second and the angular speed in radians per second. Add the following after the ``extends Sprite2D`` line.
zh_hans: 是时候让节点移动并旋转了。为此，我们要向脚本添加两个成员变量：移动速度（像素/秒）和角速度（弧度/秒）。请在 ``extends Sprite2D`` 后面另起一行，添加如下代码。

source: In the code editor, you can :kbd:`Ctrl + Click` (:kbd:`Cmd + Click` on macOS) on any built-in property or function like ``position``, ``rotation``, or ``_process`` to open the corresponding documentation in a new tab.
zh_hans: 在代码编辑器中，你可以按住 :kbd:`Ctrl` 键（在macOS上使用 :kbd:`Command` 键） 单击任何内置的属性或函数，如 ``position``\ 、\ ``rotation``\ 、\ ``_process`` 以在新标签页中打开相应的文档。
