Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_languages.po
Languages: cs, ga, ta

source: You can use any version of the language or mix compiler brands and versions for the generated shared libraries, thanks to our use of an internal C API Bridge.
cs: Můžete použít libovolnou verzi jazyka nebo volně zaměňovat verze a druhy kompilátorů pro vygenerované sdílené knihovny díky našemu použití interního C API Bridge.
ga: Is féidir leat aon leagan den teanga a úsáid nó brandaí agus leaganacha tiomsaitheora a mheascadh do na leabharlanna roinnte a ghintear, a bhuíochas lenár n-úsáid as Droichead inmheánach C API.
ta: நீங்கள் மொழியின் எந்த பதிப்பையும் பயன்படுத்தலாம் அல்லது உருவாக்கப்பட்ட பகிரப்பட்ட நூலகங்களுக்கான கம்பைலர் பிராண்டுகள் மற்றும் பதிப்புகளை கலக்கலாம், உள் சி பநிஇ பாலத்தைப் பயன்படுத்தியதற்கு நன்றி.

source: GDExtension is the best choice for performance. You don't need to use it throughout an entire game, as you can write other parts in GDScript or C#.
cs: GDExtension je nejlepší volbou pro části náchylné na výkon. Nemusíte ho používat napříč celou hrou, ostatní části můžete psát v GDScriptu nebo C#.
ga: Is é GDExtension an rogha is fearr le haghaidh feidhmíochta. Ní gá duit é a úsáid i rith cluiche iomlán, mar is féidir leat codanna eile a scríobh i GDScript nó C #.
ta: செயல்திறனுக்கான சிறந்த தேர்வாக gdextension ஆகும். GDSCRIPT அல்லது C#இல் மற்ற பகுதிகளை எழுதலாம் என்பதால், நீங்கள் ஒரு முழு விளையாட்டு முழுவதும் இதைப் பயன்படுத்தத் தேவையில்லை.

source: When working with GDExtension, the available types, functions, and properties closely resemble Godot's actual C++ API.
cs: Při práci s GDExtension se dostupné typy, funke a vlastnosti blízce podobají skutečnému C++ API Godotu.
ga: Agus tú ag obair le GDExtension, tá na cineálacha, feidhmeanna agus airíonna atá ar fáil cosúil le API C ++ iarbhír Godot.
ta: Gdextension உடன் பணிபுரியும் போது, கிடைக்கக்கூடிய வகைகள், செயல்பாடுகள் மற்றும் பண்புகள் கோடோட்டின் உண்மையான சி ++ ஏபிஐக்கு நெருக்கமாக ஒத்திருக்கின்றன.

source: Summary
cs: Shrnutí
ga: Achoimre
ta: சுருக்கம்

source: Scripts are files containing code that you attach to a node to extend its functionality.
cs: Skripty jsou soubory, které obsahují kód a můžete je připojit k uzlům pro rozšíření jejich funkcí.
ga: Is comhaid iad scripteanna ina bhfuil cód a cheanglaíonn tú le nód chun a fheidhmiúlacht a leathnú.
ta: ச்கிரிப்ட்கள் அதன் செயல்பாட்டை நீட்டிக்க ஒரு முனையுடன் நீங்கள் இணைக்கும் குறியீட்டைக் கொண்ட கோப்புகள்.

source: Godot supports four official scripting languages, offering you flexibility between performance and ease of use.
cs: Godot oficiálně podporuje čtyři jazyky pro skriptování a nabízí vám tak flexibilitu mezi výkonem a jednoduchostí použití.
ga: Tacaíonn Godot le ceithre theanga scripteála oifigiúla, ag tabhairt solúbthacht duit idir feidhmíocht agus éascaíocht úsáide.
ta: கோடோட் நான்கு உத்தியோகபூர்வ ச்கிரிப்டிங் மொழிகளை ஆதரிக்கிறது, இது செயல்திறனுக்கும் பயன்பாட்டின் எளிமைக்கும் இடையில் நெகிழ்வுத்தன்மையை வழங்குகிறது.

source: You can mix languages, for instance, to implement demanding algorithms with C or C++ and write most of the game logic with GDScript or C#.
cs: Můžete jazyky kombinovat, například implementovat náročné algoritmy v C nebo C++ a většinu herní logiky psát v GDScriptu nebo C#.
ga: Is féidir leat teangacha a mheascadh, mar shampla, chun halgartaim éilitheacha a chur i bhfeidhm le C nó C ++ agus an chuid is mó de loighic an chluiche a scríobh le GDScript nó C #.
ta: உதாரணமாக, சி அல்லது சி ++ உடன் கோரும் வழிமுறைகளைச் செயல்படுத்த நீங்கள் மொழிகளை கலக்கலாம் மற்றும் சி.டி.எச்.ச்கிரிப்ட் அல்லது சி#உடன் விளையாட்டு தர்க்கத்தின் பெரும்பகுதியை எழுதலாம்.

source: GDScript
ga: GDScriptName
