Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_first_script.po
Languages: cs, ga, it, ta, tr, zh_hans

source: Turning around
cs: Otáčení
ga: Ag casadh timpeall
ta: திரும்பும்
tr: Etrafında dönmek
zh_hans: 四处旋转

source: It's time to make our node move and rotate. To do so, we're going to add two member variables to our script: the movement speed in pixels per second and the angular speed in radians per second. Add the following after the ``extends Sprite2D`` line.
cs: Je načase náž uzel rozpohybovat a nechat otáčet. Abychom toho dosáhli, přidáme do našeho skriptu dva proměnné členy: rychlost pohybu v pixelech za sekundu a úhlovou rychlost v radiánech za sekundu. Přidejte za řádek ``extends Sprite2D`` následující kód.
ga: Tá sé in am ár nód a dhéanamh bogadh agus rothlú. Chun é sin a dhéanamh, táimid chun dhá athróg ball a chur lenár script: an luas gluaiseachta i bpicteilíní in aghaidh an tsoicind agus an luas uilleach i radáin in aghaidh an tsoicind. Cuir an méid seo a leanas leis tar éis na líne ``leathnaíonn Sprite2D``.
it: È ora di far muovere e ruotare il nostro nodo. Per farlo, aggiungeremo due variabili membro al nostro script: la velocità di movimento in pixel al secondo e la velocità angolare in radianti al secondo. Aggiungiamo quanto segue dopo la riga ``extends Sprite2D``.
ta: எங்கள் முனை நகர்ந்து சுழலும் நேரம் இது. அவ்வாறு செய்ய, எங்கள் ச்கிரிப்ட்டில் இரண்டு உறுப்பினர் மாறிகள் சேர்க்கப் போகிறோம்: நொடிக்கு பிக்சல்களில் இயக்க விரைவு மற்றும் நொடிக்கு ரேடியன்களில் கோண விரைவு. `` ச்ப்ரைட் 2 டி`` வரியை நீட்டித்த பிறகு பின்வருவனவற்றைச் சேர்க்கவும்.
tr: Düğümümüzü hareket ettirme ve döndürme zamanı geldi. Bunu yapmak için, betiğimize iki üye değişken ekleyeceğiz: piksel cinsinden saniyedeki hareket hızı ve radyan cinsinden saniyedeki açısal hız. Aşağıdakileri ``extends Sprite2D`` satırından sonra ekleyin.

source: Member variables sit near the top of the script, after any "extends" lines, but before functions. Every node instance with this script attached to it will have its own copy of the ``speed`` and ``angular_speed`` properties.
cs: Proměnné členy umisťujeme do horní části skriptu; za řádkem "extends", ale před funkcemi. Každá instance uzlu, ke které je připojen tento skript, bude mít svou vlastní kopii vlastností ``speed`` ("rychlost") a ``angular_speed`` ("úhlová rychlost").
ga: Suíonn athróga ball gar do bharr an script, tar éis aon línte “leathnú”, ach roimh fheidhmeanna. Beidh a chóip féin de na hairíonna ``speed`` agus ``angular_speed`` ag gach cás nód a bhfuil an script seo ceangailte leis.
it: Le variabili membro si trovano nella parte superiore dello script, dopo ogni riga "extends", ma prima delle funzioni. Ogni istanza di nodo a cui è allegato questo script avrà la propria copia delle proprietà ``speed`` e ``angular_speed``.
ta: உறுப்பினர் மாறிகள் ச்கிரிப்ட்டின் மேற்பகுதிக்கு அருகில் அமர்ந்திருக்கின்றன, எந்தவொரு "நீட்டிக்கப்பட்ட" வரிகளும், ஆனால் செயல்பாடுகளுக்கு முன். இந்த ச்கிரிப்டுடன் இணைக்கப்பட்ட ஒவ்வொரு முனை நிகழ்வுகளும் அதன் சொந்த நகலைக் கொண்டிருக்கும் `` வேகம்`` மற்றும் `` கோண_ச்பீட்`` பண்புகள்.
tr: Üye değişkenler betiğin en üst kısmına yakın, bütün "extends" satırlarından sonra, ama fonksiyonlardan önce yer alırlar. Bu betiğin bağlanacağı bütün düğüm örneklemeleri, ``speed`` (hız) ve ``angular_speed`` (açısal hız) özelliklerinin kendilerine ait birer kopyasını alırlar.
zh_hans: 成员变量位于脚本的顶部，在“extends”之后、函数之前。附加了此脚本的每个节点实例都将具有自己的 ``speed`` 和 ``angular_speed`` 属性副本。

source: Angles in Godot work in radians by default, but you have built-in functions and properties available if you prefer to calculate angles in degrees instead.
cs: S úhly v Godotu pracujeme zpravidla v radiánech. Pokud dáváte přednost výpočtu úhlů ve stupních, máte k dispozici vestavěné funkce a vlastnosti.
ga: Oibríonn uillinneacha i Godot i radáin de réir réamhshocraithe, ach tá feidhmeanna agus airíonna ionsuite ar fáil más fearr leat uillinneacha a ríomh i gcéimeanna ina ionad sin.
it: Normalmente in Godot gli angoli sono calcolati in radianti, ma hai a disposizione funzioni e proprietà integrate, se preferisci calcolare gli angoli in gradi.
ta: கோடோட்டில் உள்ள கோணங்கள் இயல்பாக ரேடியன்களில் வேலை செய்கின்றன, ஆனால் அதற்கு பதிலாக டிகிரிகளில் கோணங்களைக் கணக்கிட விரும்பினால், உள்ளமைக்கப்பட்ட செயல்பாடுகள் மற்றும் பண்புகள் உங்களிடம் உள்ளன.
tr: Godot'da açılar varsayılan olarak radyan cinsindedir, ama eğer açıları derece cinsinden hesaplamak isterseniz bunun için kullanabileceğiniz yerleşik fonksiyon ve özellikler de bulunur.
zh_hans: 与其他一些引擎一样，Godot 中的角度默认使用弧度为单位，但如果你更喜欢以度为单位计算角度，则可以使用内置函数和属性。

source: To move our icon, we need to update its position and rotation every frame in the game loop. We can use the ``_process()`` virtual function of the ``Node`` class. If you define it in any class that extends the Node class, like Sprite2D, Godot will call the function every frame and pass it an argument named ``delta``, the time elapsed since the last frame.
cs: Abychom naši ikonu rozhýbali, musíme v každém snímku smyčky hry aktualizovat její polohu a otočení. K tomu můžeme použít virtuální funkci ``_process()`` třídy ``Node``. V jakékoli třídě, která rozšiřuje třídu Node (jako to dělá i Sprite2D) a definujete v ní tuto funkci ji Godot zavolá v každém snímku a předá jí argument s názvem ``delta``, což je čas, který uplynul od minulého snímku.
ga: Chun ár ndeilbhín a bhogadh, ní mór dúinn a shuíomh agus a rothlú gach fráma sa lúb cluiche a nuashonrú. Is féidir linn feidhm fhíorúil ``_process () ``den aicme ``Node`` a úsáid. Má shainmhíníonn tú é in aon rang a leathnaíonn an rang Node, cosúil le Sprite2D, glaoidh Godot ar an bhfeidhm gach fráma agus cuirfidh sé argóint air darb ainm ``delta', an t-am atá caite ón bhfráma deireanach.
it: Per spostare la nostra icona, dobbiamo aggiornarne la posizione e la rotazione a ogni frame del ciclo di gioco. Possiamo utilizzare la funzione virtuale ``_process()`` della classe ``Node``. Se la definisci in una qualsiasi classe che estende la classe Node, come Sprite2D, Godot chiamerà la funzione a ogni frame e le passerà un argomento denominato ``delta``, che indica il tempo trascorso dall'ultimo frame.
ta: எங்கள் ஐகானை நகர்த்த, விளையாட்டு வளையத்தில் உள்ள ஒவ்வொரு சட்டகத்தையும் அதன் நிலை மற்றும் சுழற்சியைப் புதுப்பிக்க வேண்டும். `` முனை`` வகுப்பின் `` _ செயல்முறை () `மெய்நிகர் செயல்பாட்டைப் பயன்படுத்தலாம். ச்ப்ரைட் 2 டி போன்ற முனை வகுப்பை நீட்டிக்கும் எந்த வகுப்பிலும் நீங்கள் அதை வரையறுத்தால், கோடோட் ஒவ்வொரு சட்டகத்தையும் ஒவ்வொரு சட்டகத்தையும் அழைத்து, `` டெல்டா`` என்ற பெயரில் ஒரு வாதத்தை அனுப்பும், கடைசி சட்டகத்திலிருந்து நேரம் கடந்துவிட்டது.
tr: Simgemizi hareket ettirmek için, onun konumunu ve dönüşünü oyun döngüsü içinde her karede güncellememiz gerekir. Bunun için ``Node`` sınıfının ``_process()`` sanal fonksiyonunu kullanabiliriz. Eğer bunu, Sprite2D gibi, Node sınıfını genişleten herhangi bir sınıfta tanımlarsanız, Godot bu fonksiyonu her karede çağıracak ve son kareden bu yana geçen süreyi ``delta`` adlı bir girdi değişkeni olarak aktaracaktır.
zh_hans: 为了移动我们的图标，我们需要在游戏循环中每一帧更新其位置和旋转。我们可以使用 ``Node`` 类中的虚函数 ``_process()``\ 。如果你在任何扩展自 Node 类的类中定义它，如 Sprite2D，Godot将在每一帧调用该函数，并传递给它一个名为 ``delta`` 的参数，即从上一帧开始经过的时间。

source: Games work by rendering many images per second, each called a frame, and they do so in a loop. We measure the rate at which a game produces images in Frames Per Second (FPS). Most games aim for 60 FPS, although you might find figures like 30 FPS on slower mobile devices or 90 to 240 for virtual reality games.
cs: Hry fungují tak, že ve smyčce vykreslují mnoho obrázků (kterým říkáme snímky) za sekundu. Rychlost, jakou hra produkuje obrázky, měříme ve snímcích za sekundu (frames per second, FPS). Většina her usiluje o 60 FPS, i když na pomalejších mobilních zařízeních můžete najít i čísla jako 30 FPS, nebo naopak 90 až 240 pro hry ve virtuální realitě.
ga: Oibríonn cluichí trí go leor íomhánna a rindreáil in aghaidh an tsoicind, ar a dtugtar fráma ar gach ceann acu, agus déanann siad amhlaidh i lúb. Tomhaisimid an ráta ag a dtáirgeann cluiche íomhánna i bhFrámaí sa Soicind (FPS). Tá sé mar aidhm ag formhór na gcluichí 60 FPS, cé go mb’fhéidir go bhfaighfeá figiúirí mar 30 FPS ar ghléasanna soghluaiste níos moille nó 90 go 240 do chluichí réaltachta fíorúla.
it: I giochi funzionano renderizzando molte immagini al secondo, ognuna chiamata un frame, e lo fanno in un loop. Misuriamo la frequenza alla quale il gioco produce immagini in frame al secondo (FPS). La maggior parte dei videogiochi puntano a 60 FPS, anche se potresti trovare valori come 30 FPS su dispositivi più lenti, oppure tra 90 e 240 per i videogiochi in realtà virtuale.
ta: ஒரு நொடிக்கு பல படங்களை வழங்குவதன் மூலம் விளையாட்டுகள் செயல்படுகின்றன, ஒவ்வொன்றும் ஒரு சட்டகம் என்று அழைக்கப்படுகின்றன, மேலும் அவை ஒரு வளையத்தில் அவ்வாறு செய்கின்றன. ஒரு விளையாட்டு நொடிக்கு பிரேம்களில் (FPS) படங்களை உருவாக்கும் விகிதத்தை அளவிடுகிறோம். பெரும்பாலான விளையாட்டுகள் 60 எஃப்.பி.எச்சை நோக்கமாகக் கொண்டுள்ளன, இருப்பினும் மெதுவான மொபைல் சாதனங்களில் 30 எஃப்.பி.எச் அல்லது மெய்நிகர் ரியாலிட்டி கேம்களுக்கு 90 முதல் 240 வரை புள்ளிவிவரங்களை நீங்கள் காணலாம்.
tr: Oyunlar her saniyede, bir kare (veya çerçeve)) ismi verilen birçok görüntü işleyerek, ve bunu bir döngüde tekrarlayarak çalışırlar. Bir oyunun görüntü üretme hızını Saniyedeki Kare Sayısı (FPS, frames per second) olarak ölçeriz. Oyunlar çoğunlukla 60 FPS'yi hedefler, ama yavaş mobil cihazlarda 30 FPS gibi düşük veya sanal gerçeklik oyunlarında 90'dan 240'a değişen yüksek değerler bulabilirsiniz.
zh_hans: 游戏的工作方式是每秒钟渲染许多图像，每幅图像称为一帧，而且是循环进行的。我们用每秒帧数（FPS）来衡量一个游戏产生图像的速度。大多数游戏的目标是60FPS，尽管你可能会发现在较慢的移动设备上的数字是30FPS，或者是虚拟现实游戏的90至240。

source: The engine and game developers do their best to update the game world and render images at a constant time interval, but there are always small variations in frame render times. That's why the engine provides us with this delta time value, making our motion independent of our framerate.
cs: Vývojáři enginu a her se snaží herní svět aktualizovat a vykreslovat obrázky v konstantním časovém intervalu, ale v době vykreslování snímků vždy existují malé odchylky. Proto nám engine poskytuje tuto hodnotu času delta, díky čemuž je náš pohyb nezávislý na naší snímkové frekvenci.
ga: Déanann forbróirí an innill agus cluiche a ndícheall saol an chluiche a nuashonrú agus íomhánna a rinneadh ag eatramh ama leanúnach, ach bíonn éagsúlachtaí beaga i gcónaí in amanna rindreála fráma Sin an fáth go soláthraíonn an t-inneall an luach ama delta seo dúinn, rud a fhágann go bhfuil ár ngluaiseacht neamhspleách ar ár bhfráma.
it: Il motore e gli sviluppatori di gioco fanno del loro meglio per aggiornare il mondo di gioco e renderizzare le immagini a intervalli di tempo costanti, ma ci sono sempre piccole variazioni nei tempi di rendering dei frame. Ecco perché il motore ci fornisce questo valore di tempo delta, rendendo il nostro movimento indipendente dal frame rate.
ta: என்சின் மற்றும் விளையாட்டு உருவாக்குநர்கள் விளையாட்டு உலகத்தைப் புதுப்பிக்கவும், நிலையான நேர இடைவெளியில் படங்களை வழங்கவும் தங்களால் முடிந்த அனைத்தையும் செய்கிறார்கள், ஆனால் பிரேம் வழங்குதல் நேரங்களில் எப்போதும் சிறிய வேறுபாடுகள் உள்ளன. அதனால்தான் இயந்திரம் இந்த டெல்டா நேர மதிப்பை எங்களுக்கு வழங்குகிறது, இது எங்கள் இயக்கத்தை எங்கள் பிரேம்ரேட்டிலிருந்து சுயாதீனமாக்குகிறது.
tr: Motor ve oyun geliştiricileri, oyun dünyasını güncellerken ve görüntüleri işlerken sabit zaman aralıklarını kullanmak için ellerinden geleni yaparlar, fakat kare işleme sürelerinde her zaman küçük farklılıklar olur. İşte bu yüzden motor bize kullanabileceğimiz bir küçük zaman değeri (delta) verir, hareketlerimizi kare hızından bağımsız yapmamızı sağlar.
zh_hans: 引擎和游戏开发者尽最大努力以恒定的时间间隔更新游戏世界和渲染图像，但在帧的渲染时间上总是存在着微小的变化。这就是为什么引擎为我们提供了这个delta时间值，使我们的运动与我们的帧速率无关。

source: At the bottom of the script, define the function:
cs: Ve spodní části skriptu definujte tuto funkci:
ga: Ag bun an script, sainmhínigh an fheidhm:
it: In fondo allo script, definisci la funzione:
ta: ச்கிரிப்டின் அடிப்பகுதியில், செயல்பாட்டை வரையறுக்கவும்:
tr: Betiğin alt kısmına, şu fonksiyonu tanımlayın:
zh_hans: 在脚本的底部，定义该函数：

source: The ``func`` keyword defines a new function. After it, we have to write the function's name and arguments it takes in parentheses. A colon ends the definition, and the indented blocks that follow are the function's content or instructions.
cs: Klíčové slovo ``func`` definuje novou funkci. Po něm musíme napsat název funkce a do závorek její argumenty. Definici ukončuje dvojtečka a odsazené řádky, které následují definici, jsou její instrukce.
ga: Sainmhíníonn an eochairfhocal `func`` feidhm nua. Ina dhiaidh sin, caithfimid ainm agus argóintí na feidhme a thógann sé i lúibíní a scríobh. Críochnaíonn colon an sainmhíniú, agus is iad na bloic inbhrúite a leanann ná ábhar nó treoracha na feidhme.
it: La parola chiave ``func`` definisce una nuova funzione. Dopo di essa, dobbiamo scrivere il nome della funzione e gli argomenti che accetta tra parentesi. I due punti terminano la definizione e i blocchi indentati che seguono rappresentano il contenuto o le istruzioni della funzione.
ta: `` Func`` முக்கிய சொல் ஒரு புதிய செயல்பாட்டை வரையறுக்கிறது. அதற்குப் பிறகு, அது அடைப்புக்குறிக்குள் எடுக்கும் செயல்பாட்டின் பெயரையும் வாதங்களையும் எழுத வேண்டும். ஒரு பெருங்குடல் வரையறையை முடிக்கிறது, மேலும் தொடர்ந்து உள்தள்ளப்பட்ட தொகுதிகள் செயல்பாட்டின் உள்ளடக்கம் அல்லது வழிமுறைகள்.
tr: ``func`` anahtar kelimesi yeni bir fonksiyon tanımlar. Arkasından fonksiyonun ismini ve sonra parantez içinde alacağı girdi değişkenlerini yazarız. İki nokta üstüste tanımlamayı bitirir, ve takip eden girintili bloklar fonksiyonun içeriği veya talimatlarıdır.
zh_hans: ``func`` 关键字定义了一个新函数。在它之后，我们必须在括号里写上函数的名称和它所接受的参数。冒号结束定义，后面的缩进块是函数的内容或指令。

source: Notice how ``_process()``, like ``_init()``, starts with a leading underscore. By convention, Godot's virtual functions, that is to say, built-in functions you can override to communicate with the engine, start with an underscore.
cs: Všimněte si, že ``_process()`` a ``_init()`` začínají úvodním podtržítkem. Podle konvence začínají podtržítkem všechny virtuální funkce Godotu. To jsou vestavěné funkce, které můžete přepsat pro komunikaci s enginem.
ga: Tabhair faoi deara conas a thosaíonn ``_process () ``, cosúil le ``_init ()``, le bunscór tosaigh. De réir choinbhinsiúin, feidhmeanna fíorúla Godot, is é sin le rá, feidhmeanna ionsuite is féidir leat a shárú chun cumarsáid a dhéanamh leis an inneall, tosú le béim.
it: Nota come ``_process()``, così come ``_init()``, cominci con un trattino basso. Per convenzione, le funzioni virtuali di Godot, ovvero le funzioni integrate che è possibile sovrascrivere per comunicare con il motore, cominciano con un trattino basso.
ta: `` _INIT () `` போன்ற `` _ நடைமுறைக்கு () ``, ஒரு முன்னணி அடிக்கோடிட்டுக் கொண்டு எவ்வாறு தொடங்குகிறது என்பதைக் கவனியுங்கள். மாநாட்டின் மூலம், கோடோட்டின் மெய்நிகர் செயல்பாடுகள், அதாவது, இயந்திரத்துடன் தொடர்பு கொள்ள நீங்கள் மேலெழுதக்கூடிய உள்ளமைக்கப்பட்ட செயல்பாடுகளை, அடிக்கோடிட்டுக் காட்டலாம்.
tr: Dikkat ederseniz ``_process()`` fonksiyonu da ``_init()`` gibi bir alt çizgi ile başlıyor. Geleneksel açıdan, Godot'nun bütün sanal fonksiyonları, tabiri caiz ise, motor ile haberleşmek için üzerine yazabileceğiniz yerleşik fonksiyonlar, bir alt çizgi ile başlarlar.
zh_hans: 请注意 ``_process()`` 和 ``_init()`` 一样都是以下划线开头的。按照约定，这是 Godot 的虚函数，也就是你可以覆盖的与引擎通信的内置函数。

source: The line inside the function, ``rotation += angular_speed * delta``, increments our sprite's rotation every frame. Here, ``rotation`` is a property inherited from the class ``Node2D``, which ``Sprite2D`` extends. It controls the rotation of our node and works with radians.
cs: Řádek uvnitř funkce, ``rotation += angular_speed * delta``, zvyšuje hodnotu rotace našeho spritu v každém snímku. ``rotation`` je zde vlastnost zděděná z třídy ``Node2D``, kterou ``Sprite2D`` rozšiřuje. Řídí rotaci našeho uzlu a pracuje s radiány.
ga: Méadaíonn an líne taobh istigh den fheidhm, `rothlú += angular_speed * delta`, rothlú ár sprite gach fráma. Anseo, is maoin é `rotation`` oidhreachta ón aicme ``Node2D``, a leathnaíonn ``Sprite2D``. Rialaíonn sé rothlú ár nód agus oibríonn sé le radáin.
it: La riga all'interno della funzione, ``rotation += angular_speed * delta``, incrementa la rotazione del nostro sprite a ogni frame. Qui, ``rotation`` è una proprietà ereditata dalla classe ``Node2D``, che ``Sprite2D`` estende. Controlla la rotazione del nostro nodo e funziona con radianti.
ta: செயல்பாட்டின் உள்ளே இருக்கும் வரி, `` சுழற்சி += கோண_ச்பீட் * டெல்டா``, ஒவ்வொரு சட்டகத்தையும் எங்கள் ச்ப்ரைட்டின் சுழற்சியை அதிகரிக்கிறது. இங்கே, `` சுழற்சி`` என்பது `` node2d`` வகுப்பிலிருந்து பெறப்பட்ட ஒரு சொத்து, இது `` sprite2d``. இது எங்கள் முனையின் சுழற்சியைக் கட்டுப்படுத்துகிறது மற்றும் ரேடியன்களுடன் வேலை செய்கிறது.
tr: Fonksiyonun içindeki satır, ``rotation += angular_speed * delta``, her karede grafik ögemizin dönüşünü artırır. Burada ``rotation``, ``Sprite2D`` nin genişlettiği ``Node2D`` sınıfından miras alınan bir özelliktir. Düğümümüzün dönüşünü kontrol eder ve radyan ile çalışır.
zh_hans: 函数内部的那一行 ``rotation += angular_speed * delta`` 每一帧都会增加我们的精灵的旋转量。这里 ``rotation`` 是从 ``Sprite2D`` 所扩展的 ``Node2D`` 类继承的属性。它可以控制我们节点的旋转，以弧度为单位。

source: In the code editor, you can Ctrl-click (Cmd-click on MacOS) on any built-in property or function like ``position``, ``rotation``, or ``_process`` to open the corresponding documentation in a new tab.
ta: குறியீடு எடிட்டரில், எந்தவொரு உள்ளமைக்கப்பட்ட சொத்து அல்லது `` நிலை``, `` சுழற்சி``, அல்லது `` _ நடைமுறையில் உள்ளவை) நீங்கள் Ctrl- சொடுக்கு செய்யலாம் (MACOS இல் CMD- கிளிக்) செய்யலாம் ஒரு புதிய தாவல்.
tr: Kod düzenleyicide, ``position``, ``rotation`` veya ``_process`` gibi herhangi bir yerleşik özelliğe veya işleve ait ilgili belgeleri yeni bir sekmede açmak için Ctrl tuşunu basılı tutarak (MacOS'ta Cmd tuşuna basarak) fareyle tıklayabilirsiniz.

source: Run the scene to see the Godot icon turn in-place.
cs: Spusťte scénu a uvidíte, jak se ikona Godotu otáčí na místě.
ga: Rith an radharc chun an deilbhín Godot a fheiceáil ag casadh in áit.
it: Avvia la scena per vedere l'icona di Godot ruotare sul posto.
ta: கோடோட் படவுரு இடத்தைப் பார்க்க காட்சியை இயக்கவும்.
tr: Sahneyi çalıştırın ve Godot simgesinin yerinde döndüğünü görün.
zh_hans: 运行该场景，可以看到 Godot 的图标在原地转动。

source: In C#, notice how the ``delta`` argument taken by ``_Process()`` is a ``double``. We therefore need to convert it to ``float`` when we apply it to the rotation.
cs: V C# si všimněte, že argument ``delta`` funkce ``_Process()`` je typu ``double`` (desetinné číslo s dvojitou přesností). Když jej aplikujeme na rotaci, musíme jej nejprve převést na ``float`` (desetinné číslo s jednoduchou přesností).
ga: I C #, tabhair faoi deara conas “dúbailte” é an argóint ``delta` a ghlacann ``_Process () ``. Mar sin ní mór dúinn é a thiontú go ``snám` nuair a chuirimid i bhfeidhm é ar an uathrú.
it: In C#, nota come l'argomento ``delta`` accettato da ``_Process()`` sia un ``double``. Dobbiamo quindi convertirlo in ``float`` quando lo applichiamo alla rotazione.
ta: சி#இல், `` _ செயலாக்க () `` `` டபுள்`` என்ற `` டெல்டா` உரையாடல் எவ்வாறு என்பதைக் கவனியுங்கள். ஆகவே, அதை சுழற்சியில் பயன்படுத்தும்போது அதை `` மிதவை` ஆக மாற்ற வேண்டும்.
tr: C#'ta, ``_Process()`` tarafından alınan ``delta`` girdi değişkeninin bir ``double`` tipinde olduğuna dikkat edin. Bu nedenle, rotasyona uyguladığımızda bunu ``float`` değerine dönüştürmemiz gerekir.
zh_hans: 在 C# 中，请注意 ``_Process()`` 所采用的 ``delta`` 参数类型是 ``double``\ 。 故当我们将其应用于旋转时，需要将其转换为 ``float`` \。

source: Moving forward
cs: Pohyb vpřed
ga: Ag dul ar aghaidh
ta: முன்னோக்கி நகரும்
tr: İleri gitmek
zh_hans: 前进

source: Let's now make the node move. Add the following two lines inside of the ``_process()`` function, ensuring the new lines are indented the same way as the ``rotation += angular_speed * delta`` line before them.
cs: Nyní náš uzlu rozpohybujeme. Do funkce ``_process()`` přidejte následující dva řádky a ujistěte se, že nové řádky jsou odsazeny stejným způsobem jako řádek ``rotation += angular_speed * delta`` před nimi.
ga: Déanaimis anois an nód bogadh. Cuir an dá líne seo a leanas taobh istigh den fheidhm ``_process () `, ag cinntiú go bhfuil na línte nua curtha isteach ar an mbealach céanna leis an líne ``rothlacha += angular_speed * delta` os comhair iad.
it: Ora facciamo muovere il nodo. Aggiungi le due righe seguenti dentro la funzione ``_process()``, assicurandoti che le nuove righe abbiano la stessa indentazione della riga ``rotation += angular_speed * delta`` precedente.
ta: இப்போது முனையை நகர்த்துவோம். `` _ செயலாக்க () `` செயல்பாட்டின் உள்ளே பின்வரும் இரண்டு வரிகளைச் சேர்க்கவும், புதிய கோடுகள் அவர்களுக்கு முன் `` சுழற்சி += கோண_ச்பீட் * டெல்டா`` வரியைப் போலவே உள்தள்ளப்பட்டுள்ளன என்பதை உறுதிசெய்க.
tr: Şimdi düğümü hareket ettirelim. Aşağıdaki iki satırı ``_process()`` fonksiyonunun içine ekleyin ve yeni satırların kendilerinden önceki ``rotation += angular_speed * delta`` satırıyla aynı şekilde girintili olmasını sağlayın.
zh_hans: 现在我们来让节点移动。在 ``_process()`` 函数中添加下面两行代码，确保每一行都和之前的 ``rotation += angular_speed * delta`` 行的缩进保持一致。

source: As we already saw, the ``var`` keyword defines a new variable. If you put it at the top of the script, it defines a property of the class. Inside a function, it defines a local variable: it only exists within the function's scope.
cs: Jak jsme již viděli, klíčové slovo ``var`` definuje novou proměnnou. Pokud jej umístíte na začátek skriptu, definuje vlastnost třídy. Uvnitř funkce definuje místní proměnnou, která existuje pouze v rámci rozsahu funkce.
ga: Mar a chonaic muid cheana féin, sainmhíníonn an eochairfhocal `var`` athróg nua. Má chuireann tú é ag barr an script, sainmhíníonn sé maoin den rang. Taobh istigh de fheidhm, sainmhíníonn sé athróg áitiúil: níl sé ann ach laistigh de raon feidhme na feidhme.
it: Come abbiamo già visto, la parola chiave ``var`` definisce una nuova variabile. Se inserita in cima allo script, definisce una proprietà della classe. Dentro una funzione, definisce una variabile locale: esiste solo dentro l'ambito della funzione.
ta: நாங்கள் ஏற்கனவே பார்த்தபடி, `` var`` முக்கிய சொல் ஒரு புதிய மாறியை வரையறுக்கிறது. நீங்கள் அதை ச்கிரிப்டின் உச்சியில் வைத்தால், அது வகுப்பின் ஒரு சொத்தை வரையறுக்கிறது. ஒரு செயல்பாட்டின் உள்ளே, இது ஒரு உள்ளக மாறியை வரையறுக்கிறது: இது செயல்பாட்டின் எல்லைக்குள் மட்டுமே உள்ளது.
tr: Daha önce görmüştük, ``var`` anahtar kelimesi yeni bir değişkeni tanımlar. Eğer bunu betiğin en üstüne koyarsanız, sınıfa ait bir özelliği tanımlar. Bir fonksiyonun içinde ise, yerel bir değişkeni tanımlar: bu şekilde sadece fonksiyonun kapsamında var olur.
zh_hans: 正如我们所看到的，\ ``var`` 关键字可以定义新变量。如果你把它放在脚本顶部，定义的就是类的属性。在函数内部，定义的则是局部变量：只在函数的作用域中存在。
