Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_first_script.po
Languages: cs, ga, it, ta, tr, zh_hans

source: Creating your first script
cs: Vytvoření prvního skriptu
ga: Do chéad script a chruthú
it: Creare il tuo primo script
ta: உங்கள் முதல் ச்கிரிப்டை உருவாக்குதல்
tr: İlk betiğinizi yazmak
zh_hans: 创建第一个脚本

source: In this lesson, you will code your first script to make the Godot icon turn in circles using GDScript. As we mentioned :ref:`in the introduction <toc-learn-introduction>`, we assume you have programming foundations. The equivalent C# code has been included in another tab for convenience.
ta: இந்த பாடத்தில், GDSCRIPT ஐப் பயன்படுத்தி வட்டங்களில் கோடோட் ஐகானை மாற்ற உங்கள் முதல் ச்கிரிப்டை குறியிடுவீர்கள். நாங்கள் குறிப்பிட்டுள்ளபடி: ref: `அறிமுகம் <toc-learn- அறிமுகம்>` `, உங்களிடம் நிரலாக்க அடித்தளங்கள் இருப்பதாக நாங்கள் கருதுகிறோம். சமமான சி# குறியீடு வசதிக்காக மற்றொரு தாவலில் சேர்க்கப்பட்டுள்ளது.
tr: Bu derste, GDScript ile ilk betiğinizi kodlayacak, Godot simgesini bir daire üzerinde döndüreceksiniz. Daha önce :ref:`giriş <toc-learn-introduction>` bölümünde bahsettiğimiz gibi, programlama konusunda artık bir temeliniz olduğunu varsayıyoruz. Kolaylık için, eşdeğer C# kodu diğer sekmede verilmiştir.

source: To learn more about GDScript, its keywords, and its syntax, head to the :ref:`GDScript reference<doc_gdscript>`.
ta: GDSCRIPT, அதன் முக்கிய வார்த்தைகள் மற்றும் அதன் தொடரியல் பற்றி மேலும் அறிய, இதற்குச் செல்லுங்கள்: ref: `GDSCRIPT குறிப்பு <ock_gdscript>`.
tr: GDScript hakkında, ve anahtar kelimeleri, ve söz dizimi ile ilgili daha fazlasını öğrenmek için :ref:`GDScript başvuru sayfası<doc_gdscript>`'na gidin.

source: To learn more about C#, head to the :ref:`C# basics <doc_c_sharp>` page.
ta: சி# பற்றி மேலும் அறிய, அதற்குச் செல்லுங்கள்: குறிப்பு: `சி# அடிப்படைகள் <doc_c_sharp>` பக்கம்.
tr: C# hakkında daha fazlası için :ref:`C# temelleri <doc_c_sharp>` sayfasına gidin.

source: Project setup
cs: Příprava projektu
ga: Socrú tionscadail
it: Impostazione del progetto
ta: திட்ட அமைப்பு
tr: Proje ayarları
zh_hans: 项目设置

source: Please :ref:`create a new project <doc_creating_and_importing_projects>` to start with a clean slate. Your project should contain one picture: the Godot icon, which we often use for prototyping in the community.
cs: Vytvořte prosím :ref:`nový projekt <doc_creating_and_importing_projects>`, abychom začali s čistým štítem. Váš projekt by měl obsahovat jeden obrázek: ikonu Godotu, kterou v komunitě často používáme při prototypování.
ga: Le do thoil :ref: `cruthaigh tionscadal nua <doc_creating_and_importing_projects>` chun tús a chur le scláta glan. Ba chóir go mbeadh pictiúr amháin i do thionscadal: an deilbhín Godot, a úsáidimid go minic chun fréamhshamhaltú sa phobal.
it: Si prega di :ref:`creare un nuovo progetto <doc_creating_and_importing_projects>` per partire da zero. Il progetto deve contenere un'immagine: l'icona di Godot, che usiamo spesso per creare prototipi nella comunità.
ta: தயவுசெய்து: குறிப்பு: `ஒரு புதிய திட்டத்தை உருவாக்கவும் <doc_creating_and_importing_projects>` தூய்மையான ச்லேட்டுடன் தொடங்க. உங்கள் திட்டத்தில் ஒரு படம் இருக்க வேண்டும்: கோடோட் படவுரு, சமூகத்தில் முன்மாதிரி செய்ய நாங்கள் அடிக்கடி பயன்படுத்துகிறோம்.
tr: Temiz bir sayfa ile başlamak için lütfen :ref:`yeni bir proje oluşturun <doc_creating_and_importing_projects>`. Projeniz tek bir resim içermelidir: Godot simgesi, ki bunu toplulukta prototip oluşturmak için sıklıkla kullanırız.
zh_hans: 请从头开始\ :ref:`创建一个新项目<doc_creating_and_importing_projects>`\ 。你的项目应该包含一张图片：Godot 图标，我们经常在社区中使用它来制作原型。

source: We need to create a Sprite2D node to display it in the game. In the Scene dock, click the Other Node button.
ta: விளையாட்டில் காண்பிக்க ஒரு ச்ப்ரைட் 2 டி முனையை உருவாக்க வேண்டும். காட்சி கப்பல்துறையில், மற்ற முனை பொத்தானைக் சொடுக்கு செய்க.
tr: Oyunda görüntülemek için bir Sprite2D (2B grafik öge) düğümü oluşturmamız gerekir. Sahne yuvasında Diğer Düğüm düğmesini tıklayın.

source: Type "Sprite2D" in the search bar to filter nodes and double-click on Sprite2D to create the node.
cs: Do vyhledávacího pole zadejte "Sprite2D", čímž vyfiltujere uzly a dvojitým kliknutím na Sprite2D vytvořte uzel.
ga: Clóscríobh “Sprite2D” sa bharra cuardaigh chun nóid a scagadh agus cliceáil faoi dhó ar Sprite2D chun an nód a chruthú.
it: Scrivi "Sprite2D" nella barra di ricerca per filtrare i nodi e clicca due volte su Sprite2D per creare il nodo.
ta: முனைகளை வடிகட்ட தேடல் பட்டியில் "ச்ப்ரைட் 2 டி" என தட்டச்சு செய்து, முனையை உருவாக்க ச்ப்ரைட் 2 டி இல் இருமுறை சொடுக்கு செய்யவும்.
tr: Düğümleri filtrelemek için arama çubuğuna "Sprite2D" yazın ve düğümü oluşturmak için Sprite2D üzerine çift tıklayın.
zh_hans: 在搜索栏中输入“Sprite2D”来过滤节点，双击 Sprite2D 来创建节点。

source: Your Scene tab should now only have a Sprite2D node.
cs: Vaše záložka Scéna by nyní měla obsahovat pouze uzel Sprite2D.
ga: Níor chóir go mbeadh ach nód Sprite2D ag do chluaisín Radhairc anois.
it: La scheda Scena dovrebbe ora contenere solo un nodo Sprite2D.
ta: உங்கள் காட்சி தாவலில் இப்போது ஒரு ச்பிரிட் 2 டி முனை மட்டுமே இருக்க வேண்டும்.
tr: Sahne sekmenizde şimdi yalnızca bir Sprite2D düğümü bulunmalıdır.

source: A Sprite2D node needs a texture to display. In the Inspector on the right, you can see that the Texture property says "[empty]". To display the Godot icon, click and drag the file ``icon.svg`` from the FileSystem dock onto the Texture slot.
ta: ஒரு ச்ப்ரைட் 2 டி முனைக்கு காண்பிக்க ஒரு அமைப்பு தேவை. வலதுபுறத்தில் உள்ள இன்ச்பெக்டரில், அமைப்பு சொத்து "[வெற்று]" என்று சொல்வதை நீங்கள் காணலாம். கோடோட் ஐகானைக் காண்பிக்க, கோப்பு முறைமை கப்பலிலிருந்து `` ஐகான்.ச்விசி`` கோப்பை அமைப்பு ச்லாட்டுக்குள் சொடுக்கு செய்து இழுக்கவும்.
tr: Bir Sprite2D düğümünün görüntülenmesi için bir dokuya ihtiyacı vardır. Sağdaki Denetleyicide Texture (Doku) özelliğinin "[empty]" (boş) yazdığını görebilirsiniz (bu özelliklerin çoğu yerel dil ayarlanmamışsa İngilizce görünür). Godot simgesini görüntülemek için DosyaSistemi yuvasından ``icon.svg`` dosyasını tutup Texture yuvasına sürükleyin.

source: You can create Sprite2D nodes automatically by dragging and dropping images on the viewport.
cs: Uzly Sprite2D můžete také vytvářet automaticky přetažením obrázků do průzoru.
ga: Is féidir leat nóid Sprite2D a chruthú go huathoibríoch trí íomhánna a tharraingt agus a scaoileadh ar an radharc.
it: È possibile creare automaticamente nodi Sprite2D trascinando e rilasciando le immagini nella viewport.
ta: காட்சியமைப்பில் படங்களை இழுத்து விடுவதன் மூலம் ச்பிரிட் 2 டி முனைகளை தானாக உருவாக்கலாம்.
tr: Görüntüleri çerçeve alanına sürükleyip bırakarak Sprite2D düğümlerini otomatik olarak oluşturabilirsiniz.
zh_hans: 你可以通过将图像拖放到视口上来自动创建 Sprite2D 节点。

source: Then, click and drag the icon in the viewport to center it in the game view.
cs: Potom přetáhněte ikonu v průzoru a vycentrujte ji v herním zobrazení.
ga: Ansin, cliceáil agus tarraing an deilbhín sa radharc chun é a lárú i radharc an chluiche.
it: Quindi, clicca e trascina l'icona nella viewport per centrarla nella visuale di gioco.
ta: பின்னர், காட்சிப் பார்வையில் அதை மையப்படுத்த ஐகானைக் சொடுக்கு செய்து இழுக்கவும்.
tr: Sonra, çerçeve içindeki simgeyi tıklayıp oyun görünümünde merkeze doğru sürükleyin.
zh_hans: 然后，点击并拖动视口中的图标，使其在游戏视图中居中。

source: Creating a new script
cs: Vytvoření nového skriptu
ga: Script nua a chruthú
it: Creare un nuovo script
ta: புதிய ச்கிரிப்டை உருவாக்குதல்
tr: Yeni bir betik oluşturmak
zh_hans: 新建脚本

source: To create and attach a new script to our node, right-click on Sprite2D in the scene dock and select "Attach Script".
ta: எங்கள் முனைக்கு புதிய ச்கிரிப்டை உருவாக்கி இணைக்க, காட்சி கப்பல்துறையில் ச்ப்ரைட் 2 டி இல் வலது சொடுக்கு செய்து "ச்கிரிப்டை இணைக்கவும்" என்பதைத் தேர்ந்தெடுக்கவும்.
tr: Düğümümüze yeni bir betik dosyası oluşturup eklemek için, sahne yuvasında Sprite2D'ye sağ tıklayın ve "Betik Ekle" yi seçin.

source: The Attach Node Script window appears. It allows you to select the script's language and file path, among other options.
ta: இணைப்பு முனை ச்கிரிப்ட் சாளரம் தோன்றும். ச்கிரிப்டின் மொழி மற்றும் கோப்பு பாதையை மற்ற விருப்பங்களுக்கிடையில் தேர்ந்தெடுக்க இது உங்களை அனுமதிக்கிறது.
tr: Düğüm Betiği Bağla penceresi açılacak. Bu size, betiğin dilini, yolunu, ve diğer bir takım seçenekleri daha seçebilme imkanı sağlar.

source: Change the Template field from "Node: Default" to "Object: Empty" to start with a clean file. Leave the other options set to their default values and click the Create button to create the script.
ta: தூய்மையான கோப்புடன் தொடங்க "முனை: இயல்புநிலை" இலிருந்து "பொருள்: வெற்று" என வார்ப்புரு புலத்தை மாற்றவும். பிற விருப்பங்களை அவற்றின் இயல்புநிலை மதிப்புகளுக்கு விட்டுவிட்டு, ச்கிரிப்டை உருவாக்க உருவாக்கு பொத்தானைக் சொடுக்கு செய்க.
tr: Şablon alanını "Düğüm: Varsayılan" yerine temiz bir dosyayla başlamak için "Nesne: Boş" olarak ayarlayın. Diğer seçenekleri varsayılan değerlerinde bırakın ve kodu oluşturmak için Oluştur düğmesine tıklayın.

source: C# script names need to match their class name. In this case, you should name the file ``MySprite2D.cs``.
cs: Názvy C# skriptů se musí shodovat s názvem jejich třídy. V tomto případě byste soubor měli pojmenovat ``MySprite2D.cs``.
ga: Caithfidh ainmneacha script C # a n-ainm ranga a mheaitseáil. Sa chás seo, ba chóir duit an comhad a ainmniú ``Mysprite2D.cs``.
it: I nomi degli script in C# devono corrispondere al nome della classe. In questo caso, il nome del file dovrebbe essere ``MySprite2D.cs``.
ta: சி# ச்கிரிப்ட் பெயர்கள் அவற்றின் வகுப்பு பெயருடன் பொருந்த வேண்டும். இந்த வழக்கில், நீங்கள் `` mysprite2d.cs`` கோப்பை பெயரிட வேண்டும்.
tr: C# kod adlarının sınıf adlarıyla eşleşmesi gerekir. Bu durumda, dosyaya ``MySprite2D.cs`` adını vermelisiniz.
zh_hans: C# 脚本名称需要与其类名称匹配。在这种情况下，应该将文件命名为 ``MySprite2D.cs``\ 。

source: The Script workspace should appear with your new ``sprite_2d.gd`` file open and the following line of code:
cs: Měl by se objevit pracovní prostor Skript s vaším novým souborem ``sprite_2d.gd`` a následujícím řádkem kódu:
ga: Ba chóir go mbeadh spás oibre an Script le do chomhad nua ``sprite_2d.gd`` oscailte agus an líne cód seo a leanas:
it: Dovrebbe apparire lo spazio di lavoro Script con il nuovo file ``sprite_2d.gd`` aperto e la seguente riga di codice:
ta: ச்கிரிப்ட் பணியிடமானது உங்கள் புதிய `` SPRITE_2D.GD`` கோப்பு திறந்த மற்றும் பின்வரும் குறியீட்டைக் கொண்டு தோன்ற வேண்டும்:
tr: Betik çalışma alanı, yeni ``sprite_2d.gd`` dosyanız açılmış ve aşağıdaki kod satırıyla birlikte görünmelidir:

source: Every GDScript file is implicitly a class. The ``extends`` keyword defines the class this script inherits or extends. In this case, it's ``Sprite2D``, meaning our script will get access to all the properties and functions of the Sprite2D node, including classes it extends, like ``Node2D``, ``CanvasItem``, and ``Node``.
cs: Každý GDScript soubor je implicitně třídou. Klíčové slovo ``extends`` ("rozšiřuje") definuje třídu, kterou tento skript dědí nebo rozšiřuje. V tomto případě je to ``Sprite2D``, což znamená, že náš skript získá přístup ke všem vlastnostem a funkcím uzlu Sprite2D, včetně tříd, které rozšiřuje Sprite2D, jako ``Node2D`` ("2D uzel"), ``CanvasItem`` ("předmět plátna") a ``Node`` ("uzel").
ga: Is rang go hiontach é gach comhad GDScript. Sainmhíníonn an eochairfhocal ``extends`` an rang a fhaigheann nó a leathnaíonn an script seo. Sa chás seo, is `Sprite2D`` é, rud a chiallaíonn go bhfaighidh ár script rochtain ar airíonna agus feidhmeanna uile an nód Sprite2D, lena n-áirítear ranganna a leathnaíonn sé, cosúil le ``Node2D``, `Canvasisem``, agus ``Node``.
ta: ஒவ்வொரு GDSCRIPT கோப்பும் மறைமுகமாக ஒரு வகை. `` விரிவாக்குகிறது`` முக்கிய சொல் இந்த ச்கிரிப்ட் பெறும் அல்லது நீட்டிக்கும் வகுப்பை வரையறுக்கிறது. இந்த விசயத்தில், இது `` ச்ப்ரைட் 2 டி``, அதாவது எங்கள் ச்கிரிப்ட் ச்ப்ரைட் 2 டி முனையின் அனைத்து பண்புகள் மற்றும் செயல்பாடுகளுக்கான அணுகலைப் பெறும், இதில் அது நீட்டிக்கும் வகுப்புகள் உட்பட, `` node2d``, `` கேன்வாசிட்டெம்``, மற்றும் `` நோட் போன்றவை ``.
tr: Her GDScript dosyası dolaylı olarak bir sınıftır. ``extends`` (genişletir) anahtar sözcüğü, bu kodun miras aldığı veya genişlettiği sınıfı tanımlar. Bu durumda bir ``Sprite2D`` olur, yani kodumuz, ``Node2D``, ``CanvasItem`` ve ``Node`` gibi genişlettiği sınıflar da dahil olmak üzere Sprite2D düğümünün tüm özelliklerine ve işlevlerine erişecektir.
zh_hans: 每个 GDScript 文件都是一个隐含的类。\ ``extends`` 关键字定义了这个脚本所继承或扩展的类。本例中为``Sprite2D``\ ，意味着我们的脚本将获得 Sprite2D 节点的所有属性和方法，包括它继承的 ``Node2D``\ 、\ ``CanvasItem``\ 、\ ``Node`` 等类。

source: In GDScript, if you omit the line with the ``extends`` keyword, your class will implicitly extend :ref:`RefCounted <class_RefCounted>`, which Godot uses to manage your application's memory.
cs: Pokud v GDScriptu vynecháte řádek s klíčovým slovem ``extends``, vaše třída implicitně rozšíří :ref:`RefCounted <class_RefCounted>` ("počítaný podle odkazů"), který Godot používá ke správě paměti vaší aplikace.
ga: I GDScript, má fhágann tú ar lár an líne leis an eochairfhocal `` leathnaíonn``, síneoidh do rang go hintuigthe :ref:`RefCounted <class_RefCounted>`, a úsáideann Godot chun cuimhne d'fheidhmchláir a bhainistiú.
ta: GDSCRIPT இல், `` `விரிவாக்குகிறது` முக்கிய சொல்லுடன் நீங்கள் தவிர்க்கினால், உங்கள் வகுப்பு மறைமுகமாக நீட்டிக்கப்படும்: குறிப்பு:` Refcounted <class_refcounted> `, இது உங்கள் பயன்பாட்டின் நினைவகத்தை நிர்வகிக்க கோடோட் பயன்படுத்துகிறது.
tr: GDScript'te, ``extends`` anahtar sözcüğünün bulunduğu satırı yazmazsanız, sınıfınız, Godot'nun uygulamanızın belleğini yönetmek için kullandığı :ref:`RefCounted <class_RefCounted>`(Başvuru Sayımlı) sınıfını dolaylı olarak genişletecektir.
zh_hans: 在 GDScript 中，如果你略写了带有 ``extends`` 关键字的一行，那么你的类将隐式扩展自 :ref:`RefCounted <class_RefCounted>`\ ，Godot 使用这个类来管理你的应用程序的内存。

source: Inherited properties include the ones you can see in the Inspector dock, like our node's ``texture``.
cs: Zděděné vlastnosti zahrnují i ty, které vidíte v doku Inspektor, jako ``texture``, což je textura našeho uzlu.
ga: I measc na n-airíonna oidhreachta tá na cinn is féidir leat a fheiceáil i nduga an Cigire, cosúil le `texture` ár nód.
it: Le proprietà ereditate includono quelle che puoi vedere nel pannello Ispettore, come la ``texture`` del nostro nodo.
ta: எங்கள் முனையின் `` அமைப்பு`` போன்ற இன்ச்பெக்டர் கப்பல்துறையில் நீங்கள் காணக்கூடியவற்றில் மரபுரிமை பண்புகள் அடங்கும்.
tr: Miras alınan özelliklere Denetleyici yuvasında gördüğünüz her şey dahildir; mesela düğümümüzün dokusu, ``texture``, gibi.

source: By default, the Inspector displays a node's properties in "Title Case", with capitalized words separated by a space. In GDScript code, these properties are in "snake_case", which is lowercase with words separated by an underscore.
cs: Ve výchozím nastavení zobrazuje Inspektor vlastnosti uzlu s "Velkými Počátečními Písmeny". Tedy jako slova s velkými počátečními písmeny oddělená mezerou. V kódu GDScript jsou tyto vlastnosti ve "snake_case", což jsou malá písmena se slovy oddělenými podtržítkem a anglicky.
ga: De réir réamhshocraithe, taispeánann an Cigire airíonna nód i “Cás Teidil”, le focail chaipitlithe scartha le spás. I gcód GDScript, tá na hairíonna seo i “snake_case”, atá beag le focail scartha le béim.
it: Come predefinito, l'Ispettore visualizza le proprietà di un nodo in "Title Case", con le parole in maiuscolo separate da uno spazio. Nel codice GDScript, queste proprietà sono in "snake_case", ovvero minuscolo con le parole separate da un trattino basso.
ta: இயல்பாக, இன்ச்பெக்டர் ஒரு முனையின் பண்புகளை "தலைப்பு வழக்கு" இல் காண்பிக்கும், மூலதன சொற்கள் ஒரு இடத்தால் பிரிக்கப்பட்டன. GDSCRIPT குறியீட்டில், இந்த பண்புகள் "பாம்பு_கேச்" இல் உள்ளன, இது ஒரு அடிக்கோடிட்டால் பிரிக்கப்பட்ட சொற்களுடன் சிறியதாகும்.
tr: Varsayılan olarak, Denetleyici yuvası bir düğümün özelliklerini, kelimelerin ilk harfi büyük ve boşlukla ayrıldığı "Başlık Tarzı"nda görüntüler. GDScript kodu içinde bunları, kelimelerin harfleri küçük ve alt çizgi ile ayrıldığı "yılan_tarzı"nda kullanırız. (Denetleyicideki filtre kutusunun sağındaki simgeden bu görünümü değiştirebilir, Türkçe isimlerini de görebilirsiniz).

source: You can hover over any property's name in the Inspector to see a description and its identifier in code.
cs: Chcete-li zobrazit název vlastnosti v kódu odpovídající vlastnosti v Inspektoru a její popis, můžete najet myší nad název vlastnosti v Inspektoru.
ga: Féadfaidh tú uasghabháil thar ainm aon mhaoine sa Cigire chun cur síos agus a aitheantóir a fheiceáil sa chód.
it: È possibile passare il cursore sul nome di una proprietà nell'Ispettore per visualizzarne la descrizione e il relativo identificatore nel codice.
ta: ஒரு விளக்கத்தையும் அதன் அடையாளங்காட்டியையும் குறியீட்டில் காண இன்ச்பெக்டரில் உள்ள எந்தவொரு சொத்தின் பெயரையும் நீங்கள் சுற்றலாம்.
tr: Bir açıklamasını ve kod içindeki tanımlayıcısını görmek için fareyle Denetleyici'de herhangi bir özelliğin adının üzerinde durun.

source: Hello, world!
cs: Ahoj, světe!
ga: Dia duit, domhan!
ta: வணக்கம், உலகம்!
tr: Merhaba, dünya!
zh_hans: 你好，世界！

source: Our script currently doesn't do anything. Let's make it print the text "Hello, world!" to the Output bottom panel to get started.
cs: Náš skript aktuálně nic nedělá. Pro začátek jej necháme vypsat text "Ahoj, světe!" do na spodního panelu Výstup.
ga: Ní dhéanann ár script aon rud faoi láthair. Déanaimis an téacs a phriontáil “Dia duit, domhan!” chuig an bpainéal bun Aschuir chun tosú.
it: Il nostro script al momento non fa nulla. Facciamogli stampare il testo "Hello, world" nel pannello inferiore del output per iniziare.
ta: எங்கள் ச்கிரிப்ட் தற்போது எதுவும் செய்யவில்லை. "அலோ, உலகம்!" தொடங்குவதற்கு வெளியீட்டு கீழ் பேனலுக்கு.
tr: Betiğimiz şu an için hiçbir işe yaramıyor. Gelin başlangıç olarak, alttaki "Çıktı" paneline "Merhaba, Dünya!" yazdırmasını sağlayalım. ("Hello, World!" yazdırmak programcılıkta ilk adımlardandır. Kod içinde ister aynen bırakın, ister "Merhaba, Dünya!" yazdırın).
zh_hans: 我们的脚本目前没有做任何事情。让我们开始打印文本“Hello, world!”到底部输出面板。

source: Add the following code to your script:
cs: Přidejte do skriptu následující kód:
ga: Cuir an cód seo a leanas le do script:
it: Aggiungi il seguente codice al tuo script:
ta: உங்கள் ச்கிரிப்ட்டில் பின்வரும் குறியீட்டைச் சேர்க்கவும்:
tr: Aşağıdaki kodu betiğin içine ekleyin:
zh_hans: 往脚本中添加以下代码：

source: Let's break it down. The ``func`` keyword defines a new function named ``_init``. This is a special name for our class's constructor. The engine calls ``_init()`` on every object or node upon creating it in memory, if you define this function.
cs: Pojďme si ho rozebrat. Klíčové slovo ``func`` definuje novou funkci s názvem ``_init``. To je speciální název pro konstruktor naší třídy. Pro každý objekt nebo uzel, kterému definujete ``_init()``, zavolá engine tuto funkci při jeho vytvoření v paměti.
ga: Déanaimis é a bhriseadh síos. Sainmhíníonn an eochairfhocal ``func`` feidhm nua darb ainm ``_init``. Is ainm speisialta é seo do thógálaí ár rang. Glaonn an t-inneall ``_init () ``ar gach rud nó nód nuair a chruthaíonn tú i gcuimhne é, má shainmhíníonn tú an fheidhm seo.
it: Cerchiamo di semplificarlo. La parola chiave ``func`` definisce una nuova funzione chiamata ``_init``. Questo è un nome speciale per il costruttore della nostra classe. Il motore chiama ``init()`` su ogni oggetto o nodo appena viene creato in memoria, se definisci questa funzione.
ta: அதை உடைப்போம். `` Func`` முக்கிய சொல் `` _init`` என்ற புதிய செயல்பாட்டை வரையறுக்கிறது. எங்கள் வகுப்பின் கட்டமைப்பாளருக்கு இது ஒரு சிறப்பு பெயர். இந்த செயல்பாட்டை நீங்கள் வரையறுத்தால், ஒவ்வொரு பொருளையும் அல்லது முனையிலும் இயந்திரம் `` _init () `` என்று அழைக்கிறது.
tr: Bunu biraz parçalarına ayıralım. ``func`` anahtar kelimesi ``_init`` isminde yeni bir fonksiyon tanımlar. Bu isim sınıfımızın yapıcısı için özel bir isimdir. Motor, bir nesneyi ya da düğümü hafızada her oluşturduğunda bu ``_init()`` fonksiyonunu çağırır, tabi eğer bunu tanımladıysanız.
zh_hans: 让我们把它分解一下。\ ``func`` 关键字定义了一个名为 ``_init`` 的新函数。这是类构造函数的一个特殊名称。如果你定义了这个函数，引擎会在内存中创建每个对象或节点时调用 ``_init()``\ 。

source: GDScript is an indent-based language. The tab at the start of the line that says ``print()`` is necessary for the code to work. If you omit it or don't indent a line correctly, the editor will highlight it in red and display the following error message: "Indented block expected".
cs: GDScript je jazyk založený na odsazení. Tabulátor na začátku řádku ``print()`` ("tisknout"), je pro fungování kódu nezbytný. Pokud jej vynecháte nebo řádek neodsadíte správně, editor jej zvýrazní červeně a zobrazí následující chybovou zprávu: "Expected indented block after function declaration".
ga: Is teanga bunaithe ar indent-bhunaithe é GDScript. Tá an cluaisín ag tús na líne a deir ``print () ``riachtanach chun go n-oibreoidh an cód. Má fhágann tú é nó mura gcuireann tú líne isteach i gceart, aibhneoidh an t-eagarthóir air i ndearg agus taispeánfaidh tú an teachtaireacht earráide seo a leanas: “Táthar ag súil le bloc iontráilte”.
it: GDScript è un linguaggio basato sull'indentazione. La tabulazione all'inizio della riga che riporta ``print()`` è necessaria per far funzionare il codice. Se la si omette o non si indenta correttamente una riga, l'editor la evidenzierà in rosso e visualizzerà il seguente messaggio di errore: "Indented block expected".
ta: GDSCRIPT ஒரு உள்தள்ளல் அடிப்படையிலான மொழி. கோட் வேலை செய்ய `` அச்சு () `` என்று கூறும் வரியின் தொடக்கத்தில் உள்ள தாவல் தேவை. நீங்கள் அதைத் தவிர்த்துவிட்டால் அல்லது ஒரு வரியை சரியாக உள்தள்ளாவிட்டால், ஆசிரியர் அதை சிவப்பு நிறத்தில் முன்னிலைப்படுத்தி பின்வரும் பிழை செய்தியைக் காண்பிப்பார்: "உள்தள்ளப்பட்ட தொகுதி எதிர்பார்க்கப்படுகிறது".
tr: GDScript, girinti-tabanlı bir dildir. ``print()`` bulunan satırın başındaki sekme kodun çalışması için gereklidir. Eğer bunu silerseniz veya bir satırı doğru şekilde girintilemezseniz, düzenleyici bunu kırmızı renkte vurgulayacak ve şu hata iletisini gösterecektir: "Indented block expected" (Girintili kod bekleniyordu).
zh_hans: GDScript 是基于缩进的语言。行首的制表符是 ``print()`` 代码正常工作的必要条件。如果你省略了这个制表符，或者没有正确缩进一行，编辑器则将以红色标注高亮显示以下错误信息：“Indented block expected”（应有缩进块）。

source: Save the scene as ``sprite_2d.tscn`` if you haven't already, then press :kbd:`F6` (:kbd:`Cmd + R` on macOS) to run it. Look at the **Output** bottom panel that expands. It should display "Hello, world!".
cs: Pokud jste tak ještě neučinili, uložte scénu jako ``sprite_2d.tscn`` a poté ji spusťte stisknutím :kbd:`F6` (:kbd:`Cmd + R` na macOS). Podívejte se do spodního panelu **Výstup**, který se otevřel. Měl by zobrazit "Hello, world!" (neboli "Ahoj, světe!").
ga: Sábháil an radharc mar ``sprite_2d.tscn`` mura bhfuil tú cheana féin, ansin brúite:kbd: `F6` (:kbd: `Cmd + R` ar macOS) chun é a reáchtáil. Féach ar an bpainéal bun **Aschur** a leathnaíonn. Ba chóir dó “Dia duit, domhan!” a thaispeáint.
it: Salva la scena come ``sprite_2d.tscn`` se non l'hai già fatto, poi premi :kbd:`F6` (:kbd:`Cmd + R` su macOS) per eseguirla. Guarda il pannello inferiore **Output** che si espande. Dovrebbe mostrare "Hello, world!".
ta: நீங்கள் ஏற்கனவே இல்லையென்றால் காட்சியை `` ச்ப்ரைட்_2 டி. விரிவடையும் ** வெளியீடு ** கீழ் பேனலைப் பாருங்கள். இது "அலோ, வேர்ல்ட்!"
tr: Henüz yapmadıysanız sahneyi ``sprite_2d.tscn`` olarak kaydedin, ardından çalıştırmak için :kbd:`F6` (macOS'ta :kbd:`Cmd + R`) tuşlarına basın. Alttaki genişleyen **Çıktı** alt paneline bakın. "Merhaba, Dünya!" yazmalıdır.

source: Delete the ``_init()`` function, so you're only left with the line ``extends Sprite2D``.
cs: Smažte funkci ``_init()``, aby vám zůstal pouze řádek ``extends Sprite2D``.
ga: Scrios an fheidhm ``_init () ``, mar sin níl fágtha ach leis an líne ``leathnaíonn Sprite2D``.
it: Elimina la funzione ``_init()``, in modo da avere solo la riga ``extends Sprite2D``.
ta: `` _Init () `` செயல்பாட்டை நீக்குங்கள், எனவே நீங்கள் `` ச்பிரிட் 2 டி`` ஐ நீட்டிக்கிறது.
tr: ``_init()`` fonksiyonunu silin, geriye sadece ``extends Sprite2D`` satırı kalsın.
zh_hans: 将 ``_init()`` 函数删除，这样你就只有一行 ``extends Sprite2D`` 了。
