Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_languages.po
Languages: cs, ga, ta

source: Scripting languages
cs: Skriptovací jazyky
ga: Teangacha scripteála
ta: கிறுக்கல்மொழிகள்

source: This lesson will give you an overview of the available scripting languages in Godot. You will learn the pros and cons of each option. In the next part, you will write your first script using GDScript.
cs: V této lekci si uděláme přehled skriptovacích jazyků dostupných v Godotu, jejich výhod a nevýhod. V další části pak napíšete svůj první skript v GDScriptu.
ga: Tabharfaidh an ceacht seo forbhreathnú duit ar na teangacha scripteála atá ar fáil i Godot. Foghlaimeoidh tú buntáistí agus míbhuntáistí gach rogha. Sa chéad chuid eile, scríobhaidh tú do chéad script ag baint úsáide as GDScript.
ta: இந்த பாடம் கோடோட்டில் கிடைக்கக்கூடிய ச்கிரிப்டிங் மொழிகளின் கண்ணோட்டத்தை உங்களுக்கு வழங்கும். ஒவ்வொரு விருப்பத்தின் நன்மை தீமைகளையும் நீங்கள் கற்றுக்கொள்வீர்கள். அடுத்த பகுதியில், உங்கள் முதல் ச்கிரிப்டை GDSCRIPT ஐப் பயன்படுத்தி எழுதுவீர்கள்.

source: **Scripts attach to a node and extend its behavior**. This means that scripts inherit all functions and properties of the node they attach to.
cs: **Skripty se připojují k uzlůn a rozšiřují tak jejich chování**. To znamená, že skripty dědí všechny funkce a vlastnosti uzlu, ke kterému se připojují.
ga: ** Ceanglaíonn scripteanna le nód agus leathnaíonn siad a iompraí**. Ciallaíonn sé seo go n-oidhreann scripteanna gach feidhm agus airíonna an nód a cheanglaíonn siad leis.
ta: ** ச்கிரிப்ட்கள் ஒரு முனையுடன் இணைத்து அதன் நடத்தையை நீட்டிக்கவும் **. இதன் பொருள் ச்கிரிப்ட்கள் அவர்கள் இணைக்கும் முனையின் அனைத்து செயல்பாடுகளையும் பண்புகளையும் பெறுகின்றன.

source: For example, take a game where a Camera2D node follows a ship. The Camera2D node follows its parent by default. Imagine you want the camera to shake when the player takes damage. As this feature is not built into Godot, you would attach a script to the Camera2D node and code the shake.
cs: Vezměme si například hru, kde uzel Camera2D následuje loď. Uzel Camera2D následuje svého rodiče bez toho, kvůli tomu museli cokoli změnit. Řekněme však, že bychom chtěli, aby se kamera zatřásla pokaždé, když je hráč zraněn. Protože tato funkce není do Godotu sama o sobě zabudována, mohli bychom toho docílit připojením skriptu k uzlu Camera2D, do kterého bychom přidali kód pro zatřesení.
ga: Mar shampla, glac cluiche ina leanann nód Camera2D long. Leanann an nód Camera2D a thuismitheoir de réir réamhshocraithe. Samhlaigh gur mhaith leat an ceamara a chroitheadh nuair a ghlacann an t-imreoir dam Toisc nach bhfuil an ghné seo tógtha i Godot, cheanglódh tú script leis an nód Camera2D agus déanfá an croitheadh a chódú.
ta: எடுத்துக்காட்டாக, கேமரா 2 டி முனை ஒரு கப்பலைப் பின்தொடரும் விளையாட்டை எடுத்துக் கொள்ளுங்கள். கேமரா 2 டி முனை இயல்பாக அதன் பெற்றோரைப் பின்தொடர்கிறது. வீரர் சேதத்தை எடுக்கும்போது கேமரா அசைக்க வேண்டும் என்று கற்பனை செய்து பாருங்கள். இந்த நற்பொருத்தம் கோடோட்டில் கட்டமைக்கப்படாததால், நீங்கள் கேமரா 2 டி முனையுடன் ஒரு ச்கிரிப்டை இணைத்து குலுக்கலைக் குறியிடுவீர்கள்.

source: Available scripting languages
cs: Dostupné skriptovací jazyky
ga: Teangacha scripteála atá ar fáil
ta: கிடைக்கும் ச்கிரிப்டிங் மொழிகள்

source: Godot offers **four gameplay programming languages**: GDScript, C#, and, via its GDExtension technology, C and C++. There are more community-supported languages, but these are the official ones.
cs: Godot nabízí **čtyři jazyky pro programování her**: GDScript, C# a prostřednictvím své technologie GDExtension také C a C++. Komunitou podporovaných jazyků je více, ale tyto jsou oficiální.
ga: Cuireann Godot **ceithre theanga cláir gameplay ar fáil: GDScript, C #, agus, trína theicneolaíocht GDExtension, C agus C ++. Tá níos mó teangacha le tacaíocht ó phobal, ach is iad seo na cinn oifigiúla.
ta: கோடோட் ** நான்கு விளையாட்டு நிரலாக்க மொழிகளை வழங்குகிறது **: GDSCRIPT, C#, மற்றும், அதன் Gdextension தொழில்நுட்பம் வழியாக, C மற்றும் C ++. சமூக உதவி மொழிகள் அதிகம் உள்ளன, ஆனால் இவை உத்தியோகபூர்வமானவை.

source: You can use multiple languages in a single project. For instance, in a team, you could code gameplay logic in GDScript as it's fast to write, and use C# or C++ to implement complex algorithms and maximize their performance. Or you can write everything in GDScript or C#. It's your call.
cs: V jednom projektu můžete použít několik jazyků. Například můžete psát herní logiku v GDScriptu, protože se v něm rychle píše a používat C# nebo C++ k implementaci složitých algoritmů a maximalizaci jejich výkonu. Nebo můžete vše psát v jednom jazyce. Volba je vaše.
ga: Is féidir leat teangacha éagsúla a úsáid i dtionscadal amháin. Mar shampla, i bhfoireann, d'fhéadfá loighic gameplay a chódú i GDScript mar tá sé tapa le scríobh, agus C # nó C ++ a úsáid chun halgartaim casta a chur i bhfeidhm agus a bhfeidhmíocht a uasmhéadú. Nó is féidir leat gach rud a scríobh i GDScript nó C #. Is é do ghlao é.
ta: ஒற்றை திட்டத்தில் நீங்கள் பல மொழிகளைப் பயன்படுத்தலாம். உதாரணமாக, ஒரு குழுவில், சி.டி.எச்ச்கிரிப்டில் விளையாட்டு தர்க்கத்தை எழுதுவது வேகமாக இருப்பதால், சிக்கலான வழிமுறைகளை செயல்படுத்தவும் அவற்றின் செயல்திறனை அதிகரிக்கவும் சி# அல்லது சி ++ ஐப் பயன்படுத்தலாம். அல்லது நீங்கள் எல்லாவற்றையும் GDSCRIPT அல்லது C#இல் எழுதலாம். இது உங்கள் அழைப்பு.

source: We provide this flexibility to answer the needs of different game projects and developers.
cs: Tuto flexibilitu poskytujeme, abychom pokryli potřeby různorodých herních projektů a vývojářů.
ga: Soláthraímid an tsolúbthacht seo chun riachtanais na dtionscadal agus na forbróirí cluiche éagsúla a fhreagairt.
ta: வெவ்வேறு விளையாட்டு திட்டங்கள் மற்றும் டெவலப்பர்களின் தேவைகளுக்கு பதிலளிக்க இந்த நெகிழ்வுத்தன்மையை நாங்கள் வழங்குகிறோம்.

source: Which language should I use?
cs: Jaký jazyk mám použít?
ga: Cén teanga ba chóir dom a úsáid?
ta: நான் எந்த மொழியைப் பயன்படுத்த வேண்டும்?

source: If you're a beginner, we recommend to **start with GDScript**. We made this language specifically for Godot and the needs of game developers. It has a lightweight and straightforward syntax and provides the tightest integration with Godot.
cs: Pokud s programováním začínáte, doporučujeme **začít s GDScriptem**. Tento jazyk jsme vytvořili speciálně pro Godot a potřeby herních vývojářů. Má jednoduchou a přímočarou syntax a poskytuje nejtěsnější integraci s Godotem.
ga: Más tosaitheoir tú, molaimid** tosú le GDScript**. Rinneamar an teanga seo go sonrach do Godot agus do riachtanais na bhforbróirí cluichí. Tá comhréir éadrom agus simplí aige agus soláthraíonn sé an comhtháthú is déine le Godot.
ta: நீங்கள் ஒரு தொடக்கக்காரர் என்றால், GDSCRIPT ** உடன் ** தொடங்க பரிந்துரைக்கிறோம். இந்த மொழியை நாங்கள் குறிப்பாக கோடோட் மற்றும் விளையாட்டு உருவாக்குநர்களின் தேவைகளுக்காக உருவாக்கினோம். இது ஒரு இலகுரக மற்றும் நேரடியான தொடரியல் மற்றும் கோடோட்டுடன் இறுக்கமான ஒருங்கிணைப்பை வழங்குகிறது.

source: For C#, you will need an external code editor like `VSCode <https://code.visualstudio.com/>`_ or Visual Studio. While C# support is now mature, you will find fewer learning resources for it compared to GDScript. That's why we recommend C# mainly to users who already have experience with the language.
cs: Pro C# budete potřebovat externí editor kódu, jako `VSCode <https://code.visualstudio.com/>`_ nebo Visual Studio. Byť je dnes podpora C# vyspělá, najdete pro něj ve srovnání s GDScriptem méně výukových zdrojů. Proto doporučujeme C# zejména uživatelům, kteří s tímto jazykem už mají zkušenosti.
ga: Le haghaidh C#, beidh ort eagarthóir cód seachtrach cosúil le `VSCode <https://code.visualstudio.com/>`_ nó Visual Studio. Cé go bhfuil tacaíocht C# aibí anois, gheobhaidh tú níos lú acmhainní foghlama dó i gcomparáid le GDScript. Sin an fáth go molaimid C# go príomha d’úsáideoirí a bhfuil taithí acu ar an teanga cheana féin.
ta: சி#க்கு, உங்களுக்கு `vscode <https://code.visualstudio.com/>` _ அல்லது விசுவல் ச்டுடியோ போன்ற வெளிப்புற குறியீடு எடிட்டர் தேவைப்படும். சி# உதவி இப்போது முதிர்ச்சியடைந்தாலும், சி.டி.எச்.ச்கிரிப்டுடன் ஒப்பிடும்போது அதற்கான குறைவான கற்றல் ஆதாரங்களை நீங்கள் காணலாம். அதனால்தான் சி# ஐ முக்கியமாக மொழியுடன் ஏற்கனவே அனுபவமுள்ள பயனர்களுக்கு பரிந்துரைக்கிறோம்.

source: Let's look at each language's features, as well as its pros and cons.
cs: Podívejme se na funkce každého z jazyků a jejich výhody a nevýhody.
ga: Breathnaímid ar ghnéithe gach teanga, chomh maith lena buntáistí agus míbhuntáistí.
ta: ஒவ்வொரு மொழியின் அம்சங்களையும், அதன் நன்மை தீமைகளையும் பார்ப்போம்.

source: :ref:`GDScript<doc_gdscript>` is an `object-oriented <https://en.wikipedia.org/wiki/Object-oriented_programming>`_ and `imperative <https://en.wikipedia.org/wiki/Imperative_programming>`_ programming language built for Godot. It's made by and for game developers to save you time coding games. Its features include:
cs: :ref:`GDScript<doc_gdscript>` je `objektově orientovaný <https://cs.wikipedia.org/wiki/Objektov%C4%9B_orientovan%C3%A9_programov%C3%A1n%C3%AD>`_ a `imperativní <https://cs.wikipedia.org/wiki/Imperativn%C3%AD_programov%C3%A1n%C3%AD>`_ programovací jazyk stvořený pro Godot. Je vyvíjen herními vývojáři pro herní vývojáře, aby vám ušetřil čas při tvorbě her. Mezi jeho vlastnosti patří:
ga: :ref:`GDScript <doc_gdscript>` is `object-dhírithe <https://en.wikipedia.org/wiki/Object-oriented_programming>`_ agus `imperative <https://en.wikipedia.org/wiki/ Imperative_programming>`_ teanga ríomhchlárúcháin tógtha do Godot. Tá sé déanta ag agus ar son forbróirí cluiche chun am a shábháil tú cluichí códaithe. Áirítear ar a gnéithe:
ta: . Infutive_programming> `_ கோடோட்டுக்காக கட்டப்பட்ட நிரலாக்க மொழி. இது உங்கள் நேர குறியீட்டு விளையாட்டுகளைச் சேமிக்க விளையாட்டு டெவலப்பர்களால் உருவாக்கப்பட்டது. அதன் நற்பொருத்தங்கள் பின்வருமாறு:

source: A simple syntax that leads to short files.
cs: Jednodochá syntaxe vedoucí ke krátkým souborům.
ga: Comhréireacht shimplí a thagann comhaid ghearra mar thoradh air.
ta: குறுகிய கோப்புகளுக்கு வழிவகுக்கும் எளிய தொடரியல்.

source: Blazing fast compilation and loading times.
cs: Bleskově rychlé časy kompilace a načítání.
ga: Amanna tiomsaithe agus luchtaithe tapa.
ta: வேகமான தொகுப்பு மற்றும் ஏற்றுதல் நேரங்களை எரியும்.

source: Tight editor integration, with code completion for nodes, signals, and more information from the scene it's attached to.
cs: Úzká integrace s editorem, včetně dokončování kódu pro uzly, signály a další informace ze scény, ke které je připojen.
ga: Comhtháthú daingean eagarthóra, le comhlánú cód do nóid, comharthaí, agus tuilleadh faisnéise ón radharc atá ceangailte leis.
ta: இறுக்கமான எடிட்டர் ஒருங்கிணைப்பு, முனைகள், சமிக்ஞைகள் மற்றும் கூடுதல் தகவல்களுக்கான குறியீடு நிறைவு மூலம் அது இணைக்கப்பட்டுள்ளது.

source: Built-in vector and transform types, making it efficient for heavy use of linear algebra, a must for games.
cs: Vestavěné typy pro vektory a transformační matice, díky kterým je efektivní při častém použití lineární algebry, která je pro hry nezbytná.
ga: Veicteoir ionsuite agus cineálacha claochlaithe, rud a fhágann go bhfuil sé éifeachtach le húsáid throm a bhaint as ailgéabar líneach, rud atá riachtanach le haghaidh cluichí.
ta: உள்ளமைக்கப்பட்ட திசையன் மற்றும் உருமாற்ற வகைகள், நேரியல் இயற்கணிதத்தின் அதிக பயன்பாட்டிற்கு திறமையாக இருக்கும், விளையாட்டுகளுக்கு தேவை.

source: Supports multiple threads as efficiently as statically typed languages.
cs: Podpora více vláken stejně efektivní jako u staticky typovaných jazyků.
ga: Tacaíonn sé le snáitheanna iolracha chomh héifeachtach le teangacha clóscríofa go statach.
ta: நிலையான தட்டச்சு செய்யப்பட்ட மொழிகளைப் போலவே பல நூல்களை திறமையாக ஆதரிக்கிறது.

source: No `garbage collection <https://en.wikipedia.org/wiki/Garbage_collection_(computer_science)>`_, as this feature eventually gets in the way when creating games. The engine counts references and manages the memory for you in most cases by default, but you can also control memory if you need to.
cs: Žádná `garbage collection <https://cs.wikipedia.org/wiki/Garbage_collection>`_, jelikož tato funkce při vytváření her často začne překážet. Engine namísto toho počítá reference a při výchozím nastavení ve většině případů paměť spravuje za vás. Pokud ale potřebujete, můžete paměť spravovat přímo.
ga: Níl `cnuasach truflais <https://en.wikipedia.org/wiki/Garbage_collection_(computer_science)>`_, mar a théann an ghné seo isteach sa deireadh nuair a bhíonn cluichí á gcruthú. Déanann an t-inneall tagairtí a chomhaireamh agus an chuimhne a bhainistiú duit i bhformhór na gcásanna de réir réamhshocraithe, ach is féidir leat cuimhne a rialú freisin más gá duit.
ta: `குப்பை சேகரிப்பு <https://en.wikipedia.org/wiki/garbage_collection_ (computer_science)>` _, விளையாட்டுகளை உருவாக்கும் போது இந்த நற்பொருத்தம் இறுதியில் வழிவகுக்கிறது. இயந்திரம் குறிப்புகளை கணக்கிடுகிறது மற்றும் இயல்புநிலையாக பெரும்பாலான சந்தர்ப்பங்களில் உங்களுக்கான நினைவகத்தை நிர்வகிக்கிறது, ஆனால் உங்களுக்குத் தேவைப்பட்டால் நினைவகத்தையும் கட்டுப்படுத்தலாம்.

source: `Gradual typing <https://en.wikipedia.org/wiki/Gradual_typing>`_. Variables have dynamic types by default, but you also can use type hints for strong type checks.
cs: `Postupné typování <https://cs.wikipedia.org/wiki/Typov%C3%BD_syst%C3%A9m#Kombinace_dynamick%C3%A9_a_statick%C3%A9_typov%C3%A9_kontroly>`_. Proměnné mají ve výchozím režimu dynamické typy, ale použitím určení typu vynutíte silnou typovou kontrolu.
ga: `Clóscríobh de réir a chéile <https://ga.wikipedia.org/wiki/Gradual_typing>`_. Tá cineálacha dinimiciúla ag athróga de réir réamhshocraithe, ach is féidir leat leideanna cineál a úsáid freisin le haghaidh seiceálacha láidre cineáil.
ta: `படிப்படியான தட்டச்சு <https://en.wikipedia.org/wiki/gradual_typing>` _. மாறிகள் இயல்பாக மாறும் வகைகளைக் கொண்டுள்ளன, ஆனால் நீங்கள் வலுவான வகை காசோலைகளுக்கு வகை குறிப்புகளையும் பயன்படுத்தலாம்.

source: GDScript looks like Python as you structure your code blocks using indentations, but it doesn't work the same way in practice. It's inspired by multiple languages, including Squirrel, Lua, and Python.
cs: GDScript vypadá podobně jako Python, jelikož bloky kódu strukturujete pomocí odsazení, ale v praxi nefunguje stejně. Je inspirován více jazyky, mezi které patří třeba Squirrel, Lua a také Python.
ga: Breathnaíonn GDScript cosúil le Python agus tú ag struchtúrú do bhloic chód ag baint úsáide as ionbhrúcháin, ach ní oibríonn sé ar an mbealach céanna i gcleachtas. Tá sé spreagtha ag teangacha éagsúla, lena n-áirítear Ioraí, Lua, agus Python.
ta: உள்தள்ளல்களைப் பயன்படுத்தி உங்கள் குறியீடு தொகுதிகளை கட்டமைக்கும்போது GDSCRIPT பைதான் போல் தெரிகிறது, ஆனால் இது நடைமுறையில் அதே வழியில் செயல்படாது. இது அணில், லுவா மற்றும் பைதான் உள்ளிட்ட பல மொழிகளால் ஈர்க்கப்பட்டுள்ளது.

source: Why don't we use Python or Lua directly?
cs: Proč nepoužíváme přímo Python nebo Lua?
ga: Cén fáth nach n-úsáidimid Python nó Lua go díreach?
ta: நாம் ஏன் பைதான் அல்லது லுவாவை நேரடியாகப் பயன்படுத்தக்கூடாது?

source: Years ago, Godot used Python, then Lua. Both languages' integration took a lot of work and had severe limitations. For example, threading support was a big challenge with Python.
cs: Godot před lety používal Python a poté Lua. Integrace obou jazyků vyžadovala hodně práce a měla vážná omezení. Například podpora vláken byla u Pythonu velkou výzvou.
ga: Blianta ó shin, d'úsáid Godot Python, ansin Lua. Thóg comhtháthú an dá theanga go leor oibre agus bhí teorainneacha tromchúiseacha acu. Mar shampla, ba dúshlán mór é tacaíocht snáithe le Python.
ta: பல ஆண்டுகளுக்கு முன்பு, கோடோட் பைத்தானைப் பயன்படுத்தினார், பின்னர் லுவா. இரு மொழிகளின் ஒருங்கிணைப்பும் நிறைய வேலைகளை எடுத்தது மற்றும் கடுமையான வரம்புகளைக் கொண்டிருந்தது. எடுத்துக்காட்டாக, பைதானுடன் த்ரெட்டிங் உதவி ஒரு பெரிய சவாலாக இருந்தது.

source: Developing a dedicated language doesn't take us more work and we can tailor it to game developers' needs. We're now working on performance optimizations and features that would've been difficult to offer with third-party languages.
cs: Vývoj vyhrazeného jazyka nám v konečném důsledku nedá více práce a můžeme jej přizpůsobit potřebám vývojářů her. Nyní pracujeme na optimalizaci výkonu a funkcích, které by s jazyky třetích stran bylo obtížné nabídnout.
ga: Ní thógann sé níos mó oibre dúinn teanga thiomnaithe a fhorbairt agus is féidir linn í a oiriúnú do riachtanais fhorbróirí cluichí. Táimid ag obair anois ar bharrfheabhsuithe feidhmíochta agus gnéithe a bheadh deacair a thairiscint le teangacha tríú páirtí.
ta: ஒரு பிரத்யேக மொழியை உருவாக்குவது எங்களுக்கு அதிக வேலையை எடுக்காது, மேலும் அதை விளையாட்டு டெவலப்பர்களின் தேவைகளுக்கு ஏற்ப நாங்கள் வடிவமைக்க முடியும். மூன்றாம் தரப்பு மொழிகளுடன் வழங்க கடினமாக இருந்த செயல்திறன் மேம்படுத்தல்கள் மற்றும் அம்சங்களில் நாங்கள் இப்போது பணியாற்றுகிறோம்.

source: As Microsoft's `C# <https://en.wikipedia.org/wiki/C_Sharp_(programming_language)>`_ is a favorite amongst game developers, we officially support it. C# is a mature and flexible language with tons of libraries written for it. We were able to add support for it thanks to a generous donation from Microsoft.
cs: Protože je jazyk `C# <https://cs.wikipedia.org/wiki/C_Sharp>`_ od Microsoftu mezi vývojáři her velmi populární, přidali jsme pro něj oficiální podporu. C# je vyspělý jazyk se spoustou existujících knihoven. Podporu jsme pro něj mohli přidat díky štědrému daru od společnosti Microsoft.
ga: Ós rud é go bhfuil `C# <https://en.wikipedia.org/wiki/C_Sharp_(programming_language)>`_ de chuid Microsoft an-mhór i measc forbróirí cluichí, tugaimid tacaíocht oifigiúil dó. Is teanga aibí sholúbtha í C# a bhfuil an iliomad leabharlann scríofa ar a son. Bhí muid in ann tacaíocht a chur leis a bhuíochas le síntiús flaithiúil ó Microsoft.
ta: மைக்ரோசாப்டின் `சி# <https://en.wikipedia.org/wiki/c_sharp_ (Programing_language)>` _ விளையாட்டு உருவாக்குநர்களிடையே மிகவும் பிடித்தது என்பதால், நாங்கள் அதை அதிகாரப்பூர்வமாக ஆதரிக்கிறோம். சி# என்பது முதிர்ச்சியடைந்த மற்றும் நெகிழ்வான மொழி, அதற்காக டன் நூலகங்கள் எழுதப்பட்டவை. மைக்ரோசாப்டின் தாராளமான நன்கொடைக்கு நன்றி செலுத்துவதற்கு நாங்கள் ஆதரவைச் சேர்க்க முடிந்தது.

source: C# offers a good tradeoff between performance and ease of use, although you should be aware of its garbage collector.
cs: Nabízí dobrý kompromis mezi výkonem a jednoduchostí použití, měli byste si však být vědomi jeho automatické správy paměti pomocí garbage collectoru.
ga: Cuireann C # comharthú maith ar fáil idir feidhmíocht agus éascaíocht úsáide, cé gur chóir duit a bheith ar an eolas faoina bhailitheoir truflais.
ta: சி# செயல்திறனுக்கும் பயன்பாட்டின் எளிமைக்கும் இடையில் ஒரு நல்ல பரிமாற்றத்தை வழங்குகிறது, இருப்பினும் அதன் குப்பை சேகரிப்பாளரைப் பற்றி நீங்கள் அறிந்திருக்க வேண்டும்.

source: You must use the .NET edition of the Godot editor to script in C#. You can download it on the Godot website's `download <https://godotengine.org/download/>`_ page.
cs: Pro skriptování v C# musíte použít edici .NET editoru Godot. Můžete si ji stáhnout na stránce `ke stažení <https://godotengine.org/download/>`_ z webu Godotu.
ga: Ní mór duit an t-eagrán .NET den eagarthóir Godot a úsáid chun script a chur in C#. Is féidir leat é a íoslódáil ar an leathanach `íoslódáil <https://godotengine.org/download/>`_ shuíomh Gréasáin Godot.
ta: சி#இல் ச்கிரிப்ட்டுக்கு கோடோட் எடிட்டரின் .net பதிப்பை நீங்கள் பயன்படுத்த வேண்டும். நீங்கள் அதை கோடோட் வலைத்தளத்தின் `பதிவிறக்கம் <https://godotengine.org/download/>` _ பக்கத்தில் பதிவிறக்கம் செய்யலாம்.

source: Since Godot uses .NET 8, in theory, you can use any third-party .NET library or framework in Godot, as well as any Common Language Infrastructure-compliant programming language, such as F#, Boo, or ClojureCLR. However, C# is the only officially supported .NET option.
cs: Jelikož Godot používá .NET 8, teoreticky v něm můžete použít jakoukoli .NET knihovnu nebo framework třetí strany, stejně jako jakýkoli programovací jazyk kompatibilní s Common Language Infrastructure, jako je F#, Boo nebo ClojureCLR. C# je však jediná oficiálně podporovaná .NET možnost.
ta: கோடோட் .net 8 ஐப் பயன்படுத்துவதால், கோட்பாட்டில், நீங்கள் எந்த மூன்றாம் தரப்பு .நெட் நூலகம் அல்லது கட்டமைப்பை கோடோட்டில் பயன்படுத்தலாம், அத்துடன் எஃப்#, பூ, அல்லது க்ளோசூரெக்லர் போன்ற எந்தவொரு பொதுவான மொழி உள்கட்டமைப்பு-இணக்கமான நிரலாக்க மொழியையும் பயன்படுத்தலாம். இருப்பினும், சி# மட்டுமே அதிகாரப்பூர்வமாக ஆதரிக்கப்படும் .நெட் விருப்பம்.

source: GDScript code itself doesn't execute as fast as compiled C# or C++. However, most script code calls functions written with fast algorithms in C++ code inside the engine. In many cases, writing gameplay logic in GDScript, C#, or C++ won't have a significant impact on performance.
cs: Kód GDScriptu sám o sobě neběží tak rychle jako kompilovaný C# nebo C++. Většina skriptového kódu však volá funkce napsané pomocí rychlých algoritmů uvnitř enginu napsaných v C++. V mnoha případech nebude mít psaní logiky hry v GDScript, C# nebo C++ významný dopad na výkon.
ga: Ní fhorghníomhaíonn cód GDScript féin chomh tapa agus atá tiomsaithe C # nó C ++. Mar sin féin, glaonn an chuid is mó de chód script feidhmeanna scríofa le halgartaim tapa i gcód C ++ taobh istigh den inneall. I go leor cásanna, ní bheidh tionchar suntasach ag loighic gameplay a scríobh i GDScript, C #, nó C ++ ar fheidhmíocht.
ta: GDSCRIPT குறியீடு தொகுக்கப்பட்ட சி# அல்லது C ++ என வேகமாக இயங்காது. இருப்பினும், பெரும்பாலான ச்கிரிப்ட் குறியீடு இயந்திரத்தின் உள்ளே சி ++ குறியீட்டில் வேகமான வழிமுறைகளுடன் எழுதப்பட்ட செயல்பாடுகளை அழைக்கிறது. பல சந்தர்ப்பங்களில், GDSCRIPT, C#, அல்லது C ++ இல் விளையாட்டு தர்க்கத்தை எழுதுவது செயல்திறனில் குறிப்பிடத்தக்க தாக்கத்தை ஏற்படுத்தாது.

source: Projects written in C# using Godot 4 currently cannot be exported to the web platform. To use C# on that platform, consider Godot 3 instead. Android and iOS platform support is available as of Godot 4.2, but is experimental and :ref:`some limitations apply <doc_c_sharp_platforms>`.
cs: Projekty napsané v C# používající Godot 4 momentálně nelze na webové platformy exportovat. Chcete-li použít C# na webu, zvažte raději použití Godotu 3. Podpora platforem Android a iOS je od verze 4.2 dostupná, nicméně je stále experimentální a platí pro ně :ref:`určitá omezení <doc_c_sharp_platforms>`.
ga: Ní féidir tionscadail atá scríofa in C# a úsáideann Godot 4 a easpórtáil chuig an ardán gréasáin faoi láthair. Chun C# a úsáid ar an ardán sin, smaoinigh ar Godot 3 ina ionad sin. Tá tacaíocht ardán Android agus iOS ar fáil ó Godot 4.2, ach tá sé turgnamhach agus :ref: `tá roinnt teorainneacha i bhfeidhm <doc_c_sharp_platforms>`.
ta: கோடோட் 4 ஐப் பயன்படுத்தி சி# இல் எழுதப்பட்ட திட்டங்களை தற்போது வலை தளத்திற்கு ஏற்றுமதி செய்ய முடியாது. அந்த மேடையில் சி# ஐப் பயன்படுத்த, அதற்கு பதிலாக கோடோட் 3 ஐக் கவனியுங்கள். அண்ட்ராய்டு மற்றும் ஐஇமு இயங்குதள உதவி கோடோட் 4.2 இன் படி கிடைக்கிறது, ஆனால் இது சோதனை மற்றும்: ref: `சில வரம்புகள் <ock_c_sharp_platforms>` பொருந்தும்.

source: C++ via GDExtension
cs: C++ přes GDExtension
ga: C ++ trí GDExtension
ta: C ++ gdextension வழியாக

source: GDExtension allows you to write game code in C++ without needing to recompile Godot.
cs: GDExtension vám umožňuje psát kód hry v C++ bez nutnosti překompilovat Godot.
ga: Ligeann GDExtension duit cód cluiche a scríobh i C ++ gan gá duit Godot a aththiomsú.
ta: கோடோட்டை மீண்டும் தொகுக்கத் தேவையில்லாமல் சி ++ இல் விளையாட்டுக் குறியீட்டை எழுத gdextension உங்களை அனுமதிக்கிறது.
