Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/audio/audio_streams.po
Languages: de, ga, it, ja, ru, ta, uk, zh_cn, zh_tw

source: Reverb buses
de: Reverb-Busse
ga: Busanna Reverb
it: Bus di riverbero
ja: Reverb bus
ru: Шины ревербирации
ta: எதிரொலிக்கும் பேருந்துகள்
uk: Шини реверберації
zh_cn: Reverb buses（混响总线）
zh_tw: 混響匯流排

source: This feature is not supported on the web platform if the AudioStreamPlayer's playback mode is set to **Sample**, which is the default. It will only work if the playback mode is set to **Stream**, at the cost of increased latency if threads are not enabled.
it: Questa funzionalità non è supportata sulla piattaforma web se la modalità di riproduzione dell'AudioStreamPlayer è impostata su **Sample**, che è la modalità predefinita. Funzionerà solo se la modalità di riproduzione è impostata su **Stream**, a scapito di una maggiore latenza se i thread non sono abilitati.
ru: Эта функция не поддерживается на веб-платформе, если режим воспроизведения AudioStreamPlayer установлен на **Sample** (по умолчанию). Она будет работать только в режиме воспроизведения на **Stream**, но при этом увеличится задержка, если потоки не включены.
uk: Ця функція не підтримується на веб-платформі, якщо для режиму відтворення AudioStreamPlayer встановлено значення **Зразок**, що є стандартним. Це працюватиме, лише якщо режим відтворення встановлено на **Потік**, за рахунок збільшення затримки, якщо потоки не ввімкнено.
zh_tw: 如果 AudioStreamPlayer 的播放模式設為預設的 **Sample**，則此功能在網頁平台上不支援。僅當播放模式設為 **Stream** 時才會運作，但若未啟用多執行緒，延遲可能會增加。

source: See :ref:`Audio playback in the Exporting for the Web documentation <doc_exporting_for_web_audio_playback>` for details.
it: Consultare :ref:`Audio playback in the Exporting for the Web documentation <doc_exporting_for_web_audio_playback>` per i dettagli.
ru: Подробности см. в разделе :ref:`«Воспроизведение звука» в документации по экспорту для веб-страниц <doc_exporting_for_web_audio_playback>`.
uk: Див. :ref:`Audio playback in the Exporting for the Web documentation <doc_exporting_for_web_audio_playback>` для отримання додаткової інформації.
zh_cn: 详见\ :ref:`《为 Web 导出》文档中的音频回放部分 <doc_exporting_for_web_audio_playback>`\ 。
zh_tw: 詳情請參見 :ref:`網頁匯出說明文件中的音訊播放 <doc_exporting_for_web_audio_playback>`。

source: Godot allows for 3D audio streams that enter a specific Area3D node to send dry and wet audio to separate buses. This is useful when you have several reverb configurations for different types of rooms. This is done by enabling this type of reverb in the **Reverb Bus** section of the Area3D's properties:
de: Godot ermöglicht es 3D-Audiostreams, die einen bestimmten Area3D-Knoten erreichen, trockenes und nasses Audio an separate Busse zu senden. Dies ist nützlich, wenn Sie mehrere Hallkonfigurationen für unterschiedliche Raumtypen haben. Dies wird erreicht, indem dieser Halltyp im Abschnitt **Hallbus** der Area3D-Eigenschaften aktiviert wird:
ga: Ceadaíonn Godot sruthanna fuaime 3D a théann isteach i nód ar leith Area3D chun fuaim tirim agus fliuch a sheoladh chuig busanna ar leithligh. Tá sé seo úsáideach nuair a bhíonn roinnt cumraíochtaí reverb agat do chineálacha éagsúla seomraí. Déantar é seo tríd an gcineál reverb seo a chumasú sa chuid **Reverb Bus** d'airíonna an Area3D:
it: Godot consente ai flussi audio 3D che entrano in uno specifico nodo Area3D di inviare l'audio dry e wet a bus separati. Questo è utile quando si hanno diverse configurazioni di riverbero per diversi tipi di stanze. Ciò si ottiene abilitando questo tipo di riverbero nella sezione **Bus di riverbero** delle proprietà dell'Area3D:
ja: Godotでは、特定のエリア3Dノードに入る3Dオーディオストリームを使用して、ドライオーディオとウェットオーディオを別々のバスに送信できます。これは、空間の種類ごとに複数のリバーブ構成がある場合に便利です。これは、エリア3Dの **Reverb Bus** プロパティのセクションでこのタイプのリバーブを有効にすることで実行されます。
ru: Godot позволяет 3D-аудиопотокам, поступающим в определённый узел Area3D, направлять сухой и обработанный звук на отдельные шины. Это полезно, если у вас несколько конфигураций реверберации для разных типов помещений. Для этого нужно включить этот тип реверберации в разделе **Reverb Bus** в свойствах Area3D:
ta: ஒரு குறிப்பிட்ட ஏரியா 3 டி முனைக்குள் நுழையும் 3 டி ஆடியோ ச்ட்ரீம்களை கோடோட் அனுமதிக்கிறது. பல்வேறு வகையான அறைகளுக்கு உங்களிடம் பல எதிரொலி உள்ளமைவுகள் இருக்கும்போது இது பயனுள்ளதாக இருக்கும். ஏரியா 3 டி இன் பண்புகளின் ** ரெவெர்ப் பச் ** பிரிவில் இந்த வகை எதிரொலியை இயக்குவதன் மூலம் இது செய்யப்படுகிறது:
uk: Godot дозволяє 3D-аудіопотоки, які надходять до певного вузла Area3D, щоб надсилати сухий і вологий звук на окремі шини. Це корисно, якщо у вас є кілька конфігурацій реверберації для різних типів кімнат. Це робиться шляхом увімкнення цього типу реверберації в розділі **Reverb Bus** у властивостях Area3D:
zh_cn: Godot 允许进入特定 Area3D 节点的 3D 音频流，将干音频和湿音频发送到单独的总线上。这有益于为不同类型的房间配置多种混响配置。这可以通过在 Area3D 属性的 **Reverb Bus**\ （混响总线）部分中启用这种类型的混响来实现：
zh_tw: Godot 支援 3D 音訊流進入指定 Area3D 節點時，將原音（dry）和混響（wet）分別送到不同的匯流排。如果你有多種房間的混響設定，這功能會很實用。你可以在 Area3D 屬性的 **Reverb Bus** 區段啟用對應混響：

source: At the same time, a special bus layout is created where each Area3D receives the reverb info from each Area3D. A Reverb effect needs to be created and configured in each reverb bus to complete the setup for the desired effect:
de: Gleichzeitig wird ein spezielles Bus-Layout erstellt, bei dem jeder Area3D die Hallinformationen von jedem Area3D empfängt. In jedem Hallbus muss ein Halleffekt erstellt und konfiguriert werden, um die Einrichtung für den gewünschten Effekt abzuschließen:
ga: Ag an am céanna, cruthaítear leagan amach bus speisialta áit a bhfaigheann gach Area3D an fhaisnéis athsheolta ó gach Area3D. Ní mór éifeacht Reverb a chruthú agus a chumrú i ngach bus reverb chun an socrú a chríochnú don éifeacht atá ag teastáil:
it: Allo stesso tempo, viene creata una speciale disposizione di bus in cui ogni Area3D riceve le informazioni di riverbero da ogni Area3D. È necessario creare e configurare un effetto di riverbero in ogni bus di riverbero per completare la configurazione dell'effetto desiderato:
ja: 同時に、各エリア3Dが各エリア3Dからリバーブ情報を受け取る特別なバスレイアウトが作成されます。目的のエフェクトのセットアップを完了するには、各リバーブバスでリバーブエフェクトを作成および構成する必要があります:
ru: В то же время создаётся специальная схема шин, где каждая зона Area3D получает информацию о реверберации от каждой зоны Area3D. Для завершения настройки желаемого эффекта необходимо создать и настроить эффект реверберации в каждой шине реверберации:
ta: அதே நேரத்தில், ஒரு சிறப்பு பச் தளவமைப்பு உருவாக்கப்படுகிறது, அங்கு ஒவ்வொரு ஏரியா 3 டி ஒவ்வொரு ஏரியா 3 டி இலிருந்து ரெவெர்ப் தகவலைப் பெறுகிறது. விரும்பிய விளைவுக்கான அமைப்பை முடிக்க ஒவ்வொரு ரெவெர்ப் பச்சிலும் ஒரு எதிர்வினை விளைவு உருவாக்கப்பட்டு கட்டமைக்கப்பட வேண்டும்:
uk: У той же час створюється спеціальна розкладка шини, де кожен Area3D отримує інформацію про реверберацію від кожного Area3D. Ефект реверберації необхідно створити та налаштувати в кожній шині реверберації, щоб завершити налаштування бажаного ефекту:
zh_cn: 同时，还创建了一个特殊的总线布局，其中每个 Area3D 都从每个 Area3D 接收混响信息。需要在每个混响总线中创建和配置混响效果，才能完成所需效果的设置：
zh_tw: 同時，Godot 會建立特殊的匯流排佈局，每個 Area3D 都能接收對應的混響資訊。你必須在每個混響匯流排上建立並設定一個混響效果，才能完成你想要的聲音表現：

source: The Area3D's **Reverb Bus** section also has a parameter named **Uniformity**. Some types of rooms bounce sounds more than others (like a warehouse), so reverberation can be heard almost uniformly across the room even though the source may be far away. Playing around with this parameter can simulate that effect.
de: Der Abschnitt **Reverb Bus** von Area3D hat auch einen Parameter namens **Uniformity**. In manchen Raumtypen werden Geräusche stärker reflektiert als in anderen (z. B. in einem Lagerhaus), sodass der Nachhall im ganzen Raum fast gleichmäßig zu hören ist, auch wenn die Quelle weit entfernt ist. Durch Herumspielen mit diesem Parameter können Sie diesen Effekt simulieren.
ga: Tá paraiméadar darb ainm **Uniformity** i rannán **Bus Aisfhuaimniú ** Area3D. Preabann roinnt cineálacha seomraí fuaimeanna níos mó ná a chéile (cosúil le stóras), agus mar sin is féidir athfhriotail a chloisteáil go haonfhoirmeach ar fud an tseomra cé go bhféadfadh an fhoinse a bheith i bhfad ar shiúl. Is féidir an éifeacht sin a shamhlú trí imirt timpeall leis an bparaiméadar seo.
it: La sezione **Bus di riverbero** dell'Area3D ha anche un parametro chiamato **Uniformità**. Alcuni tipi di stanze riflettono i suoni più di altri (come un magazzino), quindi il riverbero è udibile quasi uniformemente in tutta la stanza, anche se la sorgente potrebbe essere lontana. Aggiustando questo parametro è possibile simulare questo effetto.
ja: エリア3Dの **Reverb Bus** セクションには、\ **Uniformity** という名前のパラメーターもあります。一部のタイプの空間(倉庫など)は他の空間よりも音がよく反響するため、音源が遠く離れていても部屋全体にほぼ均一に残響が聞こえます。このパラメーターをいじることでその効果をシミュレートできます。
ru: В разделе **Reverb Bus** в Area3D также есть параметр **Uniformity**. Некоторые типы помещений отражают звук сильнее других (например, склад), поэтому реверберация может быть слышна практически равномерно по всей комнате, даже если источник находится далеко. Экспериментируя с этим параметром, можно имитировать этот эффект.
ta: ஏரியா 3 டி ** ரெவெர்ப் பச் ** பிரிவில் ** சீரான தன்மை ** என்ற அளவுரு உள்ளது. சில வகையான அறைகள் மற்றவர்களை விட அதிகமாக ஒலிக்கின்றன (ஒரு கிடங்கு போன்றவை), எனவே மூலமானது வெகு தொலைவில் இருந்தாலும் அறை முழுவதும் கிட்டத்தட்ட ஒரே மாதிரியாக எதிரொலிக்கிறது. இந்த அளவுருவுடன் சுற்றி விளையாடுவது அந்த விளைவை உருவகப்படுத்தும்.
uk: У розділі **Reverb Bus** Area3D також є параметр під назвою **Uniformity**. Деякі типи приміщень відбивають звуки сильніше, ніж інші (наприклад, склад), тому реверберацію чути майже рівномірно по всій кімнаті, навіть якщо джерело може бути далеко. Погравши з цим параметром, можна імітувати цей ефект.
zh_cn: Area3D 的 **Reverb Bus**\ （混响总线）部分还有一个名为 **Uniformity**\ （统一性）的参数。某些类型的房间比其他类型的房间反射的声音更多（例如仓库），因此即使声源可能很远，整个房间几乎都可以均匀地听到混响。尝试使用该参数可以模拟这种效果。
zh_tw: Area3D 的 **Reverb Bus** 區段還有一個稱為 **Uniformity** （均勻度）的參數。有些房間（例如倉庫）比其他房間有更強的聲音反射，因此即使聲源較遠，在整個房間內也能聽到均勻的混響。調整這個參數可以模擬這種真實效果。

source: Doppler
de: Dopplereffekt
ja: ドップラー
ru: Допплер
ta: டாப்ளர்
uk: Доплер
zh_cn: Doppler（多普勒）
zh_tw: 多普勒

source: When the relative velocity between an emitter and listener changes, this is perceived as an increase or decrease in the pitch of the emitted sound. Godot can track velocity changes in the AudioStreamPlayer3D and Camera nodes. Both nodes have this property, which must be enabled manually:
de: Wenn sich die Relativgeschwindigkeit zwischen einem Sender und einem Hörer ändert, wird dies als Zunahme oder Abnahme der Tonhöhe des emittierten Tons wahrgenommen. Godot kann Geschwindigkeitsänderungen in dem AudioStreamPlayer3D-Node und Camera-Node verfolgen. Beide Nodes haben diese Property , die manuell aktiviert werden muss:
ga: Nuair a athraíonn an treoluas coibhneasta idir astaitheoir agus éisteoir, meastar é seo mar mhéadú nó laghdú ar pháirc na fuaime astaithe. Is féidir le Godot athruithe treoluais sna nóid AudioStreamPlayer3D agus Ceamara a rianú. Tá an maoin seo ag an dá nóid, a chaithfear a chumasú de láimh:
it: Quando la velocità relativa tra un emettitore e un ascoltatore cambia, ciò viene percepito come un aumento o una diminuzione del tono del suono emesso. Godot può tracciare le variazioni di velocità nei nodi AudioStreamPlayer3D e Camera. Entrambi i nodi hanno questa proprietà, che è necessario abilitare manualmente:
ja: エミッターとリスナー間の相対速度が変化すると、これは放出された音のピッチの増加または減少として認識されます。 Godotは、AudioStreamPlayer3DおよびCameraノードの速度の変化を追跡できます。両方のノードにはこのプロパティがあり、手動で有効にする必要があります。
ru: Когда относительная скорость между излучателем и слушателем изменяется, это воспринимается как увеличение или уменьшение высоты излучаемого звука. Godot может отслеживать изменения скорости в узлах AudioStreamPlayer3D и Camera. Оба узла имеют это свойство, которое необходимо включить вручную:
ta: உமிழ்ப்பான் மற்றும் கேட்பவருக்கு இடையிலான ஒப்பீட்டு விரைவு மாறும்போது, இது உமிழப்படும் ஒலியின் சுருதியின் அதிகரிப்பு அல்லது குறைவு என கருதப்படுகிறது. ஆடியோச்ட்ரீஆம்ப்ளேயர் 3 டி மற்றும் கேமரா முனைகளில் விரைவு மாற்றங்களை கோடோட் கண்காணிக்க முடியும். இரண்டு முனைகளிலும் இந்த சொத்து உள்ளது, அவை கைமுறையாக இயக்கப்பட வேண்டும்:
uk: Коли відносна швидкість між випромінювачем і слухачем змінюється, це сприймається як збільшення, або зменшення, тону випромінюваного звуку. Godot може відстежувати зміни швидкості в вузлах AudioStreamPlayer3D і Camera. Обидва вузли мають цю властивість, яку потрібно ввімкнути вручну:
zh_cn: 当发射源和侦听者之间的相对速度发生变化时，这被视为发出的声音的音高增加或减少。Godot 可以跟踪 AudioStreamPlayer3D 和 Camera 节点的速度变化。 这两个节点都具有该属性，必须手动启用：
zh_tw: 當發射源和接收者之間的相對速度發生變化時, 發出聲音的音高會隨之升高/降低.Godot可以追蹤AudioStreamPlayer3D和Camera節點的速度變化. 這兩個節點都有這個屬性, 需要手動啟用:

source: Enable it by setting it depending on how objects will be moved: use **Idle** for objects moved using ``_process``, or **Physics** for objects moved using ``_physics_process``. The tracking will happen automatically.
de: Aktivieren Sie sie abhängig davon, wie Objekte verschoben werden: verwenden Sie **Leerlauf** für Objekte, die mit ``_process`` verschoben wurden, oder **Physik** für Objekte, die mit ``_physics_process`` verschoben wurden. Das Tracking erfolgt automatisch.
ga: Cumasaigh é tríd é a shocrú ag brath ar an gcaoi a mbogfar rudaí: bain úsáid as **Idle** le haghaidh rudaí a bhogadh ag baint úsáide as ``_process``, nó **Fisics** le haghaidh rudaí a bhogadh ag baint úsáide as ``_physics_process``. Tarlóidh an rianú go huathoibríoch.
it: Abilitala impostandola in base a come verranno spostati gli oggetti: usare **Idle** per gli oggetti spostati attraverso ``_process``, o **Physics** per gli oggetti spostati attraverso ``_physics_process``. Il tracciamento avverrà automaticamente.
ja: オブジェクトの移動方法に応じて設定して有効にします: ``_process`` を使用して移動するオブジェクトには **Idle** を使用し、\ ``_physics_process`` を使用して移動するオブジェクトには **Physics** を使用します。追跡は自動的に行われます。
ru: Включите его в зависимости от того, как будут перемещаться объекты: используйте ** Idle ** для объектов, перемещаемых с помощью _process, или ** Physics ** для объектов, перемещаемых с помощью _physics_process. Отслеживание будет происходить автоматически.
ta: பொருள்கள் எவ்வாறு நகர்த்தப்படும் என்பதைப் பொறுத்து அதை அமைப்பதன் மூலம் அதை இயக்கவும்: `` _Process`` ஐப் பயன்படுத்தி நகர்த்தப்படும் பொருள்களுக்கு ** செயலற்ற ** ஐப் பயன்படுத்தவும், அல்லது `_Physics_Process`` ஐப் பயன்படுத்தி நகர்த்தப்படும் பொருள்களுக்கு. கண்காணிப்பு தானாக நடக்கும்.
uk: В залежності від того, як будуть переміщені об'єкти встановлюйте: **Idle** для об'єктів, переміщених за допомогою ``_process``, або **Physics** для об'єктів, переміщених за допомогою ``_physics_process``. Відстеження відбуватиметься автоматично.
zh_cn: 根据对象的移动方式通过设置启用它：对于使用 ``_process`` 移动的对象使用 **Idle**\ ，对于使用 ``_physics_process`` 移动的对象使用 **Physics**\ 。跟踪将自动进行。
zh_tw: 你可以根據物件的移動方式來啟用這個屬性：如果物件是用 ``_process`` 移動，請設為 **Idle**；如果是用 ``_physics_process`` 移動，請選擇 **Physics**。設定後會自動追蹤速度變化。
