Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/audio/audio_streams.po
Languages: de, ga, it, ja, ru, ta, uk, zh_cn, zh_tw

source: Audio streams
ga: sruthanna fuaime
it: Flussi audio
ja: オーディオストリーム
ru: Аудиопотоки
ta: ஆடியோ ச்ட்ரீம்கள்
uk: Звукові потоки
zh_cn: 音频流
zh_tw: 音訊流

source: Introduction
de: Einführung
ga: Réamhrá
it: Introduzione
ja: はじめに
ru: Введение
ta: அறிமுகம்
uk: Вступ
zh_cn: 前言
zh_tw: 前言

source: As you might have already read in :ref:`doc_audio_buses`, sound is sent to each bus via an AudioStreamPlayer node. There are different kinds of AudioStreamPlayers. Each one loads an AudioStream and plays it back.
de: Wie Sie vielleicht bereits in :ref:`doc_audio_buses` gelesen haben, wird der Ton über einen AudioStreamPlayer-Node an jeden Bus gesendet. Es gibt verschiedene Arten von AudioStreamPlayern. Jeder lädt einen AudioStream und spielt ihn ab.
ga: Mar a d'fhéadfadh go léigh tú cheana i:ref: `doc_audio_buses`, seoltar fuaim chuig gach bus trí nód AudioStreamPlayer. Tá cineálacha éagsúla AudioStreamPlayers ann. Luchtaíonn gach duine AudioStream agus imríonn sé ar ais.
it: Come forse sarà già stato letto in :ref:`doc_audio_buses`, il suono è inviato a ciascun bus tramite un nodo AudioStreamPlayer. Esistono diversi tipi di AudioStreamPlayer. Ognuno di essi carica un AudioStream e lo riproduce.
ja: すでに :ref:`doc_audio_buses` を読んでいるかもしれませんが、音声はAudioStreamPlayerノードを介して各バスに送信されます。 AudioStreamPlayerにはさまざまな種類があります。それぞれがAudioStreamをロードして再生します。
ru: Как вы, возможно, уже читали в :ref:`doc_audio_buses`, звук передаётся на каждую шину через узел AudioStreamPlayer. Существуют разные виды AudioStreamPlayer. Каждый из них загружает AudioStream и воспроизводит его.
ta: நீங்கள் ஏற்கனவே படித்தபடி: குறிப்பு: `doc_audio_buses`, ஒவ்வொரு பச்சுக்கும் ஆடியோச்ட்ரீஆம்ப்ளேயர் முனை வழியாக ஒலி அனுப்பப்படுகிறது. பல்வேறு வகையான ஆடியோச்ட்ரீஆம்ப்ளேயர்கள் உள்ளன. ஒவ்வொன்றும் ஒரு ஆடியோச்ட்ரீமை ஏற்றி அதை மீண்டும் இயக்குகின்றன.
uk: Як ви, можливо, вже читали в статті :ref:`doc_audio_buses`, звук надсилається на кожну шину через вузол ``AudioStreamPlayer``. Існують різні типи цього вузла. Кожен з них завантажує AudioStream *(Звуковий потік)* і відтворює його.
zh_cn: 你可能已经在《\ :ref:`doc_audio_buses`\ 》中读到过，声音通过 AudioStreamPlayer 节点发送到每条总线。有不同类型的 AudioStreamPlayer。每种 AudioStreamPlayer 都会加载一个 AudioStream 并播放它。
zh_tw: 如你已在 :ref:`doc_audio_buses` 讀到，聲音是透過 AudioStreamPlayer 節點發送至各個音訊匯流排（Bus）。AudioStreamPlayer 有多種類型，每一個都能載入一個 AudioStream 進行播放。

source: AudioStream
ru: AudiоStream (аудиопоток)
ta: ஆடியோச்ட்ரீம்
uk: АудіоПотік
zh_cn: AudioStream（音频流）

source: An audio stream is an abstract object that emits sound. The sound can come from many places, but is most commonly loaded from the filesystem. Audio files can be loaded as AudioStreams and placed inside an AudioStreamPlayer. You can find information on supported formats and differences in :ref:`doc_importing_audio_samples`.
de: Ein Audiostream ist ein abstraktes Objekt, das Ton ausgibt. Der Ton kann von vielen Orten kommen, wird aber meistens aus dem Dateisystem geladen. Audiodateien können als AudioStreams geladen und in einem AudioStreamPlayer platziert werden. Informationen über unterstützte Formate und Unterschiede finden Sie in :ref:`doc_importing_audio_samples`.
ga: Is réad teibí é sruth fuaime a astaíonn fuaim. Is féidir leis an bhfuaim teacht ó go leor áiteanna, ach is coitianta é a luchtú ón gcóras comhaid. Is féidir comhaid fuaime a luchtú mar AudioStreams agus a chur taobh istigh de AudioStreamPlayer. Is féidir leat faisnéis a fháil ar fhormáidí agus difríochtaí tacaithe in:ref: `doc_importing_audio_samples`.
it: Un flusso audio è un oggetto astratto che emette suoni. Il suono può provenire da molte sorgenti, ma viene più comunemente caricato dal file system. I file audio si possono caricare come AudioStream e inserire in un AudioStreamPlayer. È possibile trovare informazioni sui formati supportati e sulle loro differenze in :ref:`doc_importing_audio_samples`.
ja: オーディオ ストリームは、サウンドを出力する抽象的なオブジェクトです。サウンド(のデータ)は多くの場所からやってくる可能性がありますが、最も一般的にはファイルシステムから読み込まれます。オーディオファイルはAudioStreamとして読み込んで、AudioStreamPlayer内に配置できます。対応しているフォーマットとそれぞれの違いに関しては :ref:`doc_importing_audio_samples` を参照してください。
ru: Звуковой поток - это абстрактный объект, который отдаёт звук. Звук может приходить из многих мест, но чаще всего он загружается из файловой системы. Аудио файлы могут быть загружены как AudioStreams и помещены в AudioStreamPlayer. Информацию о поддерживаемых форматах и их отличиях можно найти в :ref:`doc_importing_audio_samples`.
ta: ஆடியோ ச்ட்ரீம் என்பது ஒலியை வெளியிடும் ஒரு சுருக்கமான பொருள். ஒலி பல இடங்களிலிருந்து வரலாம், ஆனால் பொதுவாக கோப்பு முறைமையிலிருந்து ஏற்றப்படுகிறது. ஆடியோ ச்ட்ரீம்களாக ஏற்றப்பட்டு ஆடியோச்ட்ரீஆம்ப்ளேயருக்குள் வைக்கலாம். உதவி வடிவங்கள் மற்றும் வேறுபாடுகள் பற்றிய தகவல்களை நீங்கள் இதில் காணலாம்: குறிப்பு: `doc_importing_audio_samples`.
uk: AudioStream *(Звуковий потік)* - це абстрактний об'єкт, який випромінює звук. Звук може надходити з багатьох місць, але найчастіше завантажується з файлової системи. Аудіо-файли можуть завантажуватися як Звукові потоки і розміщуватися всередині вузла ``AudioStreamPlayer``. Ви можете знайти інформацію про підтримувані формати та їх відмінності в :ref:`doc_importing_audio_samples`.
zh_cn: 音频流是一种产生声音的抽象对象。声音可以来自许多地方，但最常见的是从文件系统加载。音频文件可以作为 AudioStream 加载并放置在 AudioStreamPlayer 中。你可以在《\ :ref:`doc_importing_audio_samples`\ 》中找到支持的格式和格式差异等信息。
zh_tw: 音訊流（AudioStream）是一個會發出聲音的抽象物件。聲音來源可以有很多種，最常見的是從檔案系統載入。音訊檔案可以作為 AudioStream 載入，並放到 AudioStreamPlayer 節點內播放。更多支援格式與差異可參考 :ref:`doc_importing_audio_samples`。

source: There are other types of AudioStreams, such as :ref:`AudioStreamRandomizer<class_AudioStreamRandomizer>`. This one picks a different audio stream from a list of streams each time it's played back, and applies random pitch and volume shifting. This can be helpful for adding variation to sounds that are played back often.
de: Es gibt noch andere Arten von Audiostreams, wie z. B. :ref:`AudioStreamRandomizer<class_AudioStreamRandomizer>`. Dieser wählt bei jeder Wiedergabe einen anderen Audiostream aus einer Liste von Streams aus und wendet zufällige Tonhöhen- und Lautstärkeänderungen an. Dies kann hilfreich sein, um Abwechslung in häufig wiedergegebene Sounds zu bringen.
ga: Tá cineálacha eile Sruthanna Fuaime ann, mar shampla :ref:`AudioStreamRandomizer<class_AudioStreamRandomizer>`. Roghnaíonn an ceann seo sruth fuaime difriúil ó liosta sruthanna gach uair a athsheinntear é, agus cuireann sé tuinairde randamach agus aistriú toirte i bhfeidhm. D’fhéadfadh sé seo a bheith ina chuidiú chun éagsúlacht a chur le fuaimeanna a sheinntear ar ais go minic.
it: Esistono altri tipi di AudioStream, come :ref:`AudioStreamRandomizer<class_AudioStreamRandomizer>`. Quest'ultimo seleziona un flusso audio diverso da una lista di flussi ogni volta che viene riprodotto e applica variazioni casuali di tono e volume. Può essere utile per aggiungere varietà ai suoni riprodotti frequentemente.
ja: 他のAudioStreamの種類には、 たとえば :ref:`AudioStreamRandomizer<class_AudioStreamRandomizer>` があります。これは、再生されるたびにStreamのリストからランダムなAudioStreamを選択し、ピッチと音量をランダムに調整します。これは、頻繁に再生されるサウンドにバリエーションを加えるのに役立ちます。
ru: Существуют и другие типы аудиопотоков, например, :ref:`AudioStreamRandomizer<class_AudioStreamRandomizer>`. Этот тип выбирает каждый раз при воспроизведении другой аудиопоток из списка и применяет случайную регулировку высоты тона и громкости. Это может быть полезно для добавления разнообразия в часто воспроизводимые звуки.
ta: மற்ற வகை ஆடியோச்ட்ரீம்கள் உள்ளன, போன்றவை: குறிப்பு: `ஆடியோச்ட்ரீம்ராண்டோமைசர் <class_audiostreamrandomizer>`. இது ஒவ்வொரு முறையும் மீண்டும் இயக்கப்படும் ச்ட்ரீம்களின் பட்டியலிலிருந்து வேறுபட்ட ஆடியோ ச்ட்ரீமைத் தேர்ந்தெடுக்கும், மேலும் சீரற்ற சுருதி மற்றும் தொகுதி மாற்றத்தை பயன்படுத்துகிறது. அடிக்கடி இயக்கப்படும் ஒலிகளுக்கு மாறுபாட்டைச் சேர்க்க இது உதவியாக இருக்கும்.
uk: Існують інші типи AudioStreams, наприклад :ref:`AudioStreamRandomizer<class_AudioStreamRandomizer>`. Він вибирає інший аудіопотік зі списку потоків кожного разу, коли його відтворюють, і застосовує випадкове зміщення висоти та гучності. Це може бути корисним для додавання варіацій до звуків, які часто відтворюються.
zh_cn: 还有其他类型的 AudioStream，例如 :ref:`AudioStreamRandomizer<class_AudioStreamRandomizer>`\ 。这种音频流每次都会从音频流列表中挑选不同的音频流进行播放，并应用随机音高和音量调整，这有助于为经常播放的声音添加变化。
zh_tw: AudioStream 還有其他類型，例如 :ref:`AudioStreamRandomizer<class_AudioStreamRandomizer>`。這類型每次播放時，會從多個音訊流中隨機選擇一個，並可隨機調整音高和音量。這對於讓經常重複播放的音效聽起來更有變化非常有幫助。

source: AudioStreamPlayer
ru: AudioStreamPlayеr
ta: ஆடியோச்ட்ரீஆம்ப்ளேயர்
uk: Програвач аудіопотоку
zh_cn: AudioStreamPlayer（音频流播放器）

source: This is the standard, non-positional stream player. It can play to any bus. In 5.1 sound setups, it can send audio to stereo mix or front speakers.
de: Dies ist der standardmäßige, nicht-positionierbare Stream-Player. Er kann auf jedem Bus spielen. In 5.1-Sound-Setups kann er Audio an den Stereomix oder die Frontlautsprecher senden.
ga: Is é seo an t-imreoir sruth caighdeánach neamh-shuímh. Is féidir leis imirt ar aon bus. I socruithe fuaime 5.1, féadann sé fuaim a sheoladh chuig meascán steirió nó cainteoirí tosaigh.
it: Questo è il riproduttore di flusso standard, non posizionale. Può riprodurre su qualsiasi bus. Nelle configurazioni audio 5.1, può inviare l'audio al mix stereo o agli altoparlanti frontali.
ja: これは標準の、位置を持たないストリームプレーヤーです。どのバスでもプレイできます。5.1サウンド設定では、オーディオをステレオミックスまたはフロントスピーカーに送信できます。
ru: Это стандартный непозиционный потоковый проигрыватель. Он может воспроизводить звук на любую шину. В настройках звука 5.1 он может отправлять звук на стереомикс или на передние динамики.
ta: இது நிலையான, நிலை அல்லாத ச்ட்ரீம் பிளேயர். இது எந்த பச்சுக்கும் விளையாடலாம். 5.1 ஒலி அமைப்புகளில், இது ச்டீரியோ கலவை அல்லது முன் ச்பீக்கர்களுக்கு ஆடியோவை அனுப்பலாம்.
uk: Це стандартний програвач звукового потоку. Він може відтворюватися на будь-якій шині. При параметрі звуку в 5,1, він може надсилати звук на стереомікс, або передні динаміки.
zh_cn: 这是一种标准的非位置型的流播放器。它可以播放到任何总线。在 5.1 声音设置中，它可以将音频发送到立体声混音或前置扬声器。
zh_tw: 這是標準的非定位型音訊流播放器，可將聲音輸出到任何匯流排。在 5.1 聲道配置中，也可以把音訊傳送到立體聲混音或前置喇叭。

source: Playback Type is an experimental setting, and could change in future versions of Godot. It exists so Web exports use Web Audio-API based samples instead of streaming all sounds to the browser, unlike most platforms. This prevents the audio from being garbled in single-threaded Web exports. By default, only the Web platform will use samples. Changing this setting is not recommended, unless you have an explicit reason to. You can change the default playback type for the web and other platforms in the project settings under **Audio > General** (advanced settings must be turned on to see the setting).
de: Der Wiedergabetyp ist eine experimentelle Einstellung und könnte sich in zukünftigen Versionen von Godot ändern. Er existiert, damit Webexporte auf Web Audio-API basierende Samples verwenden, anstatt alle Sounds an den Browser zu streamen, anders als bei den meisten Plattformen. Dies verhindert, dass der Ton bei einfädigen Webexporten verstümmelt wird. Standardmäßig verwendet nur die Webplattform Samples. Es wird nicht empfohlen, diese Einstellung zu ändern, es sei denn, Sie haben einen ausdrücklichen Grund dafür. Sie können den Standardwiedergabetyp für das Web und andere Plattformen in den Projekteinstellungen unter **Audio > Allgemein** ändern (erweiterte Einstellungen müssen aktiviert sein, um die Einstellung anzuzeigen).
ga: Is suíomh turgnamhach é Cineál Athsheinm, agus d’fhéadfadh sé athrú i leaganacha amach anseo de Godot. Tá sé ann agus mar sin úsáideann onnmhairí Gréasáin samplaí bunaithe ar Web Audio-API in ionad gach fuaim a shruthú chuig an mbrabhsálaí, murab ionann agus formhór na n-ardán. Cuireann sé seo cosc ar an fhuaim a bheith garbleáilte in easpórtálacha Gréasáin aon-snáithe. De réir réamhshocraithe, ní úsáidfidh ach an t-ardán Gréasáin samplaí. Ní mholtar an socrú seo a athrú, ach amháin má tá cúis shoiléir agat leis. Is féidir leat an cineál athsheinm réamhshocraithe don ghréasán agus d’ardáin eile a athrú sna socruithe tionscadail faoi **Audio > General** (ní mór ardsocruithe a chur ar siúl chun an socrú a fheiceáil).
it: Il tipo di riproduzione è un'impostazione sperimentale che potrebbe cambiare nelle versioni future di Godot. È stata creata per consentire alle esportazioni Web di utilizzare campioni basati sull'API Web Audio invece di trasmettere tutti i suoni in flussi al browser, a differenza della maggior parte delle piattaforme. Ciò impedisce che l'audio sia distorto nelle esportazioni Web a thread singolo. Come predefinito, solo la piattaforma Web utilizzerà i campioni. Si sconsiglia di modificare questa impostazione, a meno che non ci sia un motivo esplicito per farlo. È possibile modificare il tipo di riproduzione predefinito per il Web e altre piattaforme nelle impostazioni del progetto in **Audio > Generale** (è necessario attivare le impostazioni avanzate per visualizzare l'impostazione).
ja: Playback Type は実験的な設定であり、Godotの将来のバージョンでは変更される可能性があります。これはWebエクスポートでWeb Audio-APIベースのサンプルを使用するために存在します。これはほとんどのプラットフォームのような、全てのサウンドをブラウザにストリームするのと異なる方法です。これによってシングルスレッドのWebエクスポートでオーディオが不明瞭になることを防ぎます。デフォルトでは、Webプラットフォームのみがサンプルを使います。この設定を変えることは明確な理由がなければ非推奨です。プロジェクト設定の **オーディオ > 一般** で、Webとその他プラットフォームのデフォルトPlayback Typeを変更できます(設定を見るには高度な設定をオンにする必要があります)。
ru: Playback Type (Тип воспроизведения) — экспериментальная настройка, которая может измениться в будущих версиях Godot. Она существует для того, чтобы при веб-экспорте использовались сэмплы на основе Web Audio-API вместо потоковой передачи всех звуков в браузер, в отличие от большинства платформ. Это предотвращает искажение звука при однопоточном веб-экспорте. По умолчанию сэмплы используются только веб-платформой. Изменять этот параметр не рекомендуется, если у вас нет на то веских причин. Вы можете изменить тип воспроизведения по умолчанию для веб-платформы и других платформ в настройках проекта в разделе **Audio > General** (для просмотра этого параметра необходимо включить advanced settings (расширенные настройки)).
ta: பிளேபேக் வகை என்பது ஒரு சோதனை அமைப்பாகும், மேலும் இது கோடோட்டின் எதிர்கால பதிப்புகளில் மாறக்கூடும். இது உள்ளது, எனவே வலை ஏற்றுமதிகள் பெரும்பாலான தளங்களைப் போலல்லாமல், அனைத்து ஒலிகளையும் உலாவிக்கு ச்ட்ரீமிங் செய்வதற்கு பதிலாக வலை ஆடியோ-ஏபிஐ அடிப்படையிலான மாதிரிகளைப் பயன்படுத்துகின்றன. இது ஒற்றை-திரிக்கப்பட்ட வலை ஏற்றுமதியில் ஆடியோவைத் தடுக்கிறது. இயல்பாக, வலை தளம் மட்டுமே மாதிரிகளைப் பயன்படுத்தும். உங்களுக்கு வெளிப்படையான காரணம் இல்லையென்றால், இந்த அமைப்பை மாற்றுவது பரிந்துரைக்கப்படவில்லை. ** ஆடியோ> பொது ** இன் கீழ் உள்ள திட்ட அமைப்புகளில் வலை மற்றும் பிற தளங்களுக்கான இயல்புநிலை பின்னணி வகையை மாற்றலாம் (அமைப்பைக் காண மேம்பட்ட அமைப்புகள் இயக்கப்பட வேண்டும்).
uk: Тип відтворення є експериментальним налаштуванням і може змінитися в наступних версіях Godot. Він існує, тому веб-експорт використовує зразки на основі Web Audio-API замість потокового передавання всіх звуків у браузер, на відміну від більшості платформ. Це запобігає спотворенню звуку під час однопотокового веб-експорту. За замовчуванням лише веб-платформа використовуватиме зразки. Змінювати цей параметр не рекомендується, якщо у вас немає чіткої причини. Ви можете змінити тип відтворення за замовчуванням для Інтернету та інших платформ у налаштуваннях проекту в розділі **Аудіо > Загальні** (для перегляду цього налаштування потрібно ввімкнути розширені налаштування).
zh_cn: 播放类型是一种实验性设置，可能会在 Godot 的未来版本中发生变化。它的存在使得 Web 导出使用基于 Web Audio-API 的样本，而不是像大多数平台那样将所有声音流式传输到浏览器。这可以防止音频在单线程 Web 导出中出现乱码。默认情况下，只有 Web 平台会使用样本。除非有明确的理由，否则不建议更改此设置。你可以在项目设置的\ **音频 > 常规**\ （必须打开高级设置才能看到）下更改 Web 和其他平台的默认播放类型。
zh_tw: 播放類型（Playback Type）是一項實驗性設定，未來 Godot 版本可能會變動。設計這個設定主要是為了讓網頁匯出時使用基於 Web Audio API 的取樣器（Sample），而非將所有聲音直接串流到瀏覽器，這與多數其他平台不同。這能避免在單執行緒模式下網頁音訊播放出現雜音。預設情況下，只有網頁平台會使用取樣器。建議不要隨意更動這個設定，除非你有明確需求。你也可以在專案設定中的 **Audio > General** （需開啟進階設定）調整各平台的預設播放類型。

source: AudioStreamPlayer2D
ru: AudioStreamPlayеr2D
ta: ஆடியோச்ட்ரீஆம்ப்ளேயர் 2 டி
uk: Програвач аудіопотоку 2D

source: This is a variant of AudioStreamPlayer, but emits sound in a 2D positional environment. When close to the left of the screen, the panning will go left. When close to the right side, it will go right.
de: Dies ist eine Variante von AudioStreamPlayer, gibt jedoch Ton in einer 2D Positionsumgebung aus. Wenn Sie sich links vom Bildschirm befinden, stellt sich das Panning nach links, in der Nähe der rechten Seite dementsprechend nach rechts.
ga: Is leagan é seo de AudioStreamPlayer, ach astaíonn sé fuaim i dtimpeallacht shuímh 2D. Nuair a bhíonn sé gar don taobh clé den scáileán, rachaidh an panning ar chlé. Nuair a bhíonn sé gar don taobh dheis, rachaidh sé ar dheis.
it: Questa è una variante di AudioStreamPlayer, ma emette suoni in un ambiente posizionale 2D. Quando è vicino al lato sinistro dello schermo, il "panning" si sposterà a sinistra. Quando è vicino al lato destro, si sposterà a destra.
ja: これはAudioStreamPlayerのバリアントですが、2Dの位置環境で音を発します。画面の左に近づくと、パンが左に移動します。右側に近づくと、右側に移動します。
ru: Это AudioStreamPlayer который проигрывает звук в 2D пространстве. Когда источник звука ближе к левому краю экрана, панорамирование смещается влево. Когда ближе к правой части, смещается вправо.
ta: இது ஆடியோச்ட்ரீஆம்ப்ளேயரின் மாறுபாடாகும், ஆனால் 2 டி நிலை சூழலில் ஒலியை வெளியிடுகிறது. திரையின் இடதுபுறத்தில் அருகில் இருக்கும்போது, பானிங் இடதுபுறம் செல்லும். வலது பக்கத்திற்கு அருகில் இருக்கும்போது, அது சரியாக செல்லும்.
uk: Це варіант AudioStreamPlayer, але видає звук в 2D середовищі. При розміщенні джерела звуку з лівого краю екрана звук буде поширюватися вліво. З правого - вправо.
zh_cn: 这是 AudioStreamPlayer 的一种变体，但在 2D 位置环境中发出声音。当靠近屏幕左侧时，声像将向左移动。当靠近右侧时，声像将向右移动。
zh_tw: 這是 AudioStreamPlayer 的 2D 定位變體，能在 2D 空間中發出聲音。當音源靠近螢幕左側時，聲像會偏向左邊；靠近右側時則偏向右邊。

source: Area2Ds can be used to divert sound from any AudioStreamPlayer2Ds they contain to specific buses. This makes it possible to create buses with different reverb or sound qualities to handle action happening in a particular parts of your game world.
de: Area2Ds können verwendet werden, um Sound von allen AudioStreamPlayer2Ds die sie enthalten, auf bestimmte Busse umzuleiten. Auf diese Weise können Busse mit unterschiedlichen Hall- oder Klangqualitäten erstellt werden, um die Aktionen in bestimmten Teilen Ihrer Spielwelt zu bewältigen.
ga: Is féidir Area2Ds a úsáid chun fuaim a atreorú ó aon AudioStreamPlayer2Ds atá iontu chuig busanna ar leith. Fágann sé seo gur féidir busanna a chruthú le cáilíochtaí éagsúla athshlánaithe nó fuaime chun gníomh a tharlaíonn i gcodanna áirithe de shaol do chluiche a láimhseáil.
it: Gli Area2D si possono utilizzare per deviare l'audio da qualsiasi AudioStreamPlayer2D contenuto in essi verso bus specifici. Questo permette di creare bus con riverbero o attributi sonori diversi per gestire l'azione che si svolge in determinate aree del mondo di gioco.
ja: Area2Dを使用すると、その領域に含まれるAudioStreamPlayer2Dから、特定のバスにサウンドを転送できます。これにより、さまざまなリバーブまたは音質のバスを作成して、ゲームワールドの特定の部分で発生するアクションを処理できます。
ru: Area2D может использоваться для перенаправления звука с любых AudioStreamPlayer2D, которые расположены на определенных шинах. Это позволяет создавать шины с разными звуковыми эффектами для звукового сопровождения действий происходящих в определенных частях вашего игрового мира.
ta: குறிப்பிட்ட பேருந்துகளுக்கு அவை கொண்டிருக்கும் எந்த ஆடியோச்ட்ரீஆம்ப்ளேயர் 2 டிசிலிருந்தும் ஒலியைத் திசைதிருப்ப ஏரியா 2 டிஎச் பயன்படுத்தப்படலாம். இது உங்கள் விளையாட்டு உலகின் ஒரு குறிப்பிட்ட பகுதிகளில் நடக்கும் செயலைக் கையாள வெவ்வேறு எதிரொலி அல்லது ஒலி குணங்களைக் கொண்ட பேருந்துகளை உருவாக்குவதை சாத்தியமாக்குகிறது.
uk: Area2D *(Області 2Д)* можна використовувати для перенаправлення звуку від будь-яких AudioStreamPlayer2D, які розміщені на конкретних шинах. Це дозволяє створювати шини з різними ревербераційними, або звуковими, якостями для обробки дій, що відбуваються в певних частинах вашого ігрового світу.
zh_cn: Area2D 可用于将声音从其包含的任何 AudioStreamPlayer2D 转移到特定总线。这样就可以创造具有不同混响或音质的总线，从而来处理游戏世界特定部分发生的动作。
zh_tw: Area2D 可以讓其內部的 AudioStreamPlayer2D 產生的聲音導向指定的匯流排，這讓你能針對遊戲世界特定區域設計不同的混響或音質效果。

source: AudioStreamPlayer3D
ru: AudioStreamPlayеr3D
ta: ஆடியோச்ட்ரீஆம்ப்ளேயர் 3 டி
uk: Програвач аудіопотоку 3D

source: This is a variant of AudioStreamPlayer, but emits sound in a 3D positional environment. Depending on the location of the player relative to the screen, it can position sound in stereo, 5.1 or 7.1 depending on the chosen audio setup.
de: Hierbei handelt es sich um eine Variante des AudioStreamPlayers, die jedoch den Ton in einer 3D-Positionsumgebung wiedergibt. Je nach Position des Players im Verhältnis zum Bildschirm kann er den Ton in Stereo, 5.1 oder 7.1 ausgeben, je nach gewähltem Audio-Setup.
ga: Is leagan é seo de AudioStreamPlayer, ach astaíonn sé fuaim i dtimpeallacht shuímh 3D. Ag brath ar shuíomh an imreora i gcoibhneas leis an scáileán, féadann sé fuaim a shuíomh i steirió, 5.1 nó 7.1 ag brath ar an socrú fuaime roghnaithe.
it: Questa è una variante di AudioStreamPlayer, ma emette il suono in un ambiente posizionale 3D. A seconda della posizione del giocatore rispetto allo schermo, può posizionare l'audio in stereo, 5.1 o 7.1, a seconda della configurazione audio scelta.
ja: これはAudioStreamPlayerのバリアントですが、3Dの位置環境で音を発します。画面に対するプレーヤーの位置や、選択したオーディオ設定に応じて、5.1、7.1のステレオでサウンドを配置できます。
ru: Это вариант AudioStreamPlayer, но проигрывает звук в 3D пространстве. В зависимости от расположения игрока относительно экрана он может позиционировать звук в стерео, 5.1 или 7.1 в зависимости от выбранной настройки звука.
ta: இது ஆடியோச்ட்ரீஆம்ப்ளேயரின் மாறுபாடாகும், ஆனால் 3 டி நிலை சூழலில் ஒலியை வெளியிடுகிறது. திரையுடன் தொடர்புடைய பிளேயரின் இருப்பிடத்தைப் பொறுத்து, இது தேர்ந்தெடுக்கப்பட்ட ஆடியோ அமைப்பைப் பொறுத்து ச்டீரியோ, 5.1 அல்லது 7.1 இல் ஒலியை நிலைநிறுத்தலாம்.
uk: Це варіант AudioStreamPlayer, але випромінює звук в 3D середовищі. Залежно від розташування програвача відносно екрану, він може поширювати звук в стерео, 5,1, або 7,1, в залежності від обраної настройки звуку.
zh_cn: 这是 AudioStreamPlayer 的一种变体，但在 3D 位置环境中发出声音。根据播放器相对于屏幕的位置，它可以将声音定位为立体声、5.1 或 7.1，具体取决于所选的音频设置。
zh_tw: 這是 AudioStreamPlayer 的 3D 定位變體，能在三維空間中播放聲音。根據音源與視點的位置關係，聲音會定位於立體聲、5.1 或 7.1 聲道，取決於你所選的音效配置。

source: Similar to AudioStreamPlayer2D, an Area3D can divert the sound to an audio bus.
de: Ähnlich wie AudioStreamPlayer2D kann Area3D den Ton auf einen Audiobus umleiten.
ga: Cosúil le AudioStreamPlayer2D, is féidir le Area3D an fhuaim a atreorú chuig bus fuaime.
it: Similmente ad AudioStreamPlayer2D, un Area3D può deviare il suono verso un bus audio.
ja: AudioStreamPlayer2Dと同様に、Area3Dはサウンドをオーディオ バスに転送できます。
ru: Подобно AudioStreamPlayer2D, Area3D может направлять звук на аудиошину.
ta: ஆடியோச்ட்ரீஆம்ப்ளேயர் 2 டி போலவே, ஒரு ஏரியா 3 டி ஒலியை ஆடியோ பச்சுக்கு திசை திருப்ப முடியும்.
uk: Подібно до AudioStreamPlayer2D, Area3D може перенаправляти звук на аудіошину.
zh_cn: 与 AudioStreamPlayer2D 类似，Area3D 可以将声音转移到特定的音频总线上。
zh_tw: 類似於 AudioStreamPlayer2D，Area3D 也可以將 3D 聲音導向指定的音訊匯流排。

source: Unlike for 2D, the 3D version of AudioStreamPlayer has a few more advanced options:
de: Im Gegensatz zu 2D bietet die 3D-Version von AudioStreamPlayer einige erweiterte Optionen:
ga: Murab ionann agus do 2D, tá cúpla rogha níos airde ag an leagan 3D de AudioStreamPlayer:
it: A differenza della versione 2D, la versione 3D di AudioStreamPlayer ha alcune opzioni più avanzate:
ja: 2Dとは異なり、AudioStreamPlayerの3Dバージョンには、さらに高度なオプションがいくつかあります:
ru: В отличие от 2D, 3D-версия AudioStreamPlayer имеет несколько дополнительных параметров:
ta: 2D ஐப் போலல்லாமல், ஆடியோச்ட்ரீஆம்ப்ளேயரின் 3D பதிப்பில் இன்னும் சில மேம்பட்ட விருப்பங்கள் உள்ளன:
uk: На відміну від 2D, 3D-версія AudioStreamPlayer має ще кілька додаткових опцій:
zh_cn: 与 2D 版本不同的是，3D 版本的 AudioStreamPlayer 还有一些更高级的选项：
zh_tw: 和 2D 不同，3D 版的 AudioStreamPlayer 有一些進階設定：
