Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/cpu_optimization.po
Languages: ga, ja, ko, pt_br, ru, ta, zh_tw

source: CPU caches are something else to be particularly aware of, especially when comparing timing results of two different versions of a function. The results can be highly dependent on whether the data is in the CPU cache or not. CPUs don't load data directly from the system RAM, even though it's huge in comparison to the CPU cache (several gigabytes instead of a few megabytes). This is because system RAM is very slow to access. Instead, CPUs load data from a smaller, faster bank of memory called cache. Loading data from cache is very fast, but every time you try and load a memory address that is not stored in cache, the cache must make a trip to main memory and slowly load in some data. This delay can result in the CPU sitting around idle for a long time, and is referred to as a "cache miss".
ga: Is rud eile iad taiscí LAP le bheith ar an eolas go háirithe, go háirithe agus torthaí uainithe dhá leagan éagsúla de fheidhm á chur i gcomparáid. Is féidir leis na torthaí a bheith ag brath go mór ar an bhfuil na sonraí i taisce an LAP nó nach bhfuil. Ní luchtaíonn CPUanna sonraí go díreach ó RAM an chórais, cé go bhfuil sé ollmhór i gcomparáid leis an taisce LAP (roinnt gigabait in ionad cúpla meigabyte). Tá sé seo toisc go bhfuil RAM an chórais an-mhall le rochtain a fháil. Ina áit sin, luchtaíonn CPUanna sonraí ó bhainc cuimhne níos lú, níos gasta ar a dtugtar taisce. Tá sonraí a luchtú ó taisce an-tapa, ach gach uair a dhéanann tú iarracht seoladh cuimhne nach stóráiltear i taisce a luchtú, caithfidh an taisce turas a dhéanamh chuig an bpríomh-chuimhne agus roinnt sonraí a luchtú go mall. D'fhéadfadh an moill seo a bheith mar thoradh ar an LAP ina shuí timpeall díomhaoin ar feadh i bhfad, agus tugtar “cailleadh taisce” air.
ja: CPU キャッシュは、特に関数の 2 つの異なるバージョンのタイミング結果を比較する場合に特に注意する必要があるもう 1 つの要素です。測定結果はデータが CPU キャッシュにあるかどうかに大きく依存する可能性があります。CPU キャッシュと比較してシステム RAM が非常に大きい (数メガバイトではなく数ギガバイト) にもかかわらず、CPU はシステム RAM から直接データをロードしません。これはシステム RAM へのアクセスが非常に遅いためです。代わりに CPU はキャッシュと呼ばれる、より小さく、より高速なメモリバンクからデータをロードします。キャッシュからのデータのロードは非常に高速ですが、キャッシュに格納されていないメモリ アドレスをロードしようとするたびに、キャッシュはメインメモリにアクセスして、データをゆっくりとロードする必要があります。この遅延により、CPU が長時間アイドル状態になる可能性があります。これを「キャッシュミス」と呼びます。
pt_br: Os caches de CPU são algo que deve ser particularmente atento, especialmente ao comparar resultados de temporização de duas versões diferentes de uma função. Os resultados podem ser altamente dependentes se os dados estão no cache da CPU ou não. As CPUs não carregam dados diretamente da RAM do sistema, embora seja enorme em comparação com o cache da CPU (vários gigabytes em vez de alguns megabytes). Isso ocorre porque o acesso à RAM do sistema é muito lento. Em vez disso, as CPUs carregam dados de um banco de memória menor e mais rápido chamado cache. Carregar dados do cache é muito rápido, mas toda vez que você tenta carregar um endereço de memória que não está armazenado no cache, o cache deve fazer uma viagem para a memória principal e carregar lentamente alguns dados. Esse atraso pode fazer com que a CPU fique ociosa por um longo tempo e é conhecido como "falha de cache".
ru: Кэш-память процессора - это то, о чем следует помнить, особенно при сравнении временных результатов двух разных версий функции. Результаты могут сильно зависеть от того, находятся ли данные в кэше процессора или нет. Процессоры не загружают данные непосредственно из системной оперативной памяти, даже если она огромна по сравнению с кэшем процессора (несколько гигабайт вместо нескольких мегабайт). Это происходит потому, что доступ к системной оперативной памяти очень медленный. Вместо этого процессоры загружают данные из меньшего, более быстрого банка памяти, называемого кэш-памятью. Загрузка данных из кэша происходит очень быстро, но каждый раз, когда вы пытаетесь загрузить адрес памяти, который не хранится в кэше, кэш должен совершить путешествие в основную память и медленно загрузить данные. Эта задержка может привести к тому, что процессор будет долгое время простаивать, и называется "пропуском кэша".
ta: சிபியு தற்காலிக சேமிப்புகள் குறிப்பாக அறிந்திருக்க வேண்டிய ஒன்று, குறிப்பாக ஒரு செயல்பாட்டின் இரண்டு வெவ்வேறு பதிப்புகளின் நேர முடிவுகளை ஒப்பிடும்போது. தரவு சிபியு தற்காலிக சேமிப்பில் உள்ளதா இல்லையா என்பதைப் பொறுத்தது. சிபியு தற்காலிக சேமிப்புடன் ஒப்பிடுகையில் (சில மெகாபைட்டுகளுக்கு பதிலாக பல சிகாபைட்) மிகப்பெரியதாக இருந்தாலும், கணினி ரேமிலிருந்து நேரடியாக தரவை ஏற்றாது. கணினி ரேம் அணுக மிகவும் மெதுவாக இருப்பதால் தான். அதற்கு பதிலாக, சிபியு கள் கேச் எனப்படும் சிறிய, வேகமான நினைவக வங்கியில் இருந்து தரவை ஏற்றுகின்றன. தற்காலிக சேமிப்பில் இருந்து தரவை ஏற்றுவது மிக வேகமாக உள்ளது, ஆனால் ஒவ்வொரு முறையும் நீங்கள் தற்காலிக சேமிப்பில் சேமிக்கப்படாத நினைவக முகவரியை முயற்சித்து ஏற்றும்போது, தற்காலிக சேமிப்பு முதன்மையான நினைவகத்திற்கு ஒரு பயணத்தை மேற்கொண்டு சில தரவுகளில் மெதுவாக ஏற்ற வேண்டும். இந்த நேரந்தவறுகை சிபியு நீண்ட காலமாக சும்மா உட்கார்ந்திருக்கும், மேலும் இது "கேச் மிச்" என்று குறிப்பிடப்படுகிறது.
zh_tw: CPU 快取（Cache）是你在比較兩個函式版本效能時務必留意的重點。結果往往取決於資料是否已經在快取中。雖然系統記憶體（RAM）比 CPU 快取大很多（以 GB 計而快取僅數 MB），但 CPU 不會直接從 RAM 讀取，因為 RAM 存取速度很慢。CPU 會先從較小、但更快的快取記憶體存取資料。如果資料已在快取，載入速度極快；但若載入位址不在快取，就必須從主記憶體慢慢載入，造成 CPU 長時間閒置，這種狀況稱為「快取未命中（cache miss）」。

source: This means that the first time you run a function, it may run slowly because the data is not in the CPU cache. The second and later times, it may run much faster because the data is in the cache. Due to this, always use averages when timing, and be aware of the effects of cache.
ga: Ciallaíonn sé seo go bhféadfadh sé rith go mall an chéad uair a reáchtáil tú feidhm toisc nach bhfuil na sonraí sa taisce LAP. An dara huaire agus níos déanaí, d'fhéadfadh sé rith i bhfad níos gasta toisc go bhfuil na sonraí sa taisce. Mar gheall air seo, bain úsáid as meánna i gcónaí agus tú ag uainiú, agus bí ar an eolas faoi éifeachtaí taisce.
ja: つまり、関数を初めて実行すると、データが CPU キャッシュにないため、実行速度が遅くなる可能性があります。2 回目以降は、データがキャッシュにあるため、実行速度が大幅に速くなる可能性があります。このため、実行時間を計測する際は常に平均値を使用し、キャッシュの影響があることに注意してください。
ru: Это означает, что при первом запуске функция может выполняться медленно, поскольку данные отсутствуют в кэше процессора. При втором и последующих запусках она может выполняться значительно быстрее, поскольку данные находятся в кэше. В связи с этим при измерении времени всегда используйте средние значения и учитывайте влияние кэша.
ta: இதன் பொருள் என்னவென்றால், நீங்கள் ஒரு செயல்பாட்டை முதன்முதலில் இயக்கும்போது, அது மெதுவாக இயங்கக்கூடும், ஏனெனில் தரவு சிபியு தற்காலிக சேமிப்பில் இல்லை. இரண்டாவது மற்றும் பின்னர், தரவு தற்காலிக சேமிப்பில் இருப்பதால் இது மிக வேகமாக இயங்கக்கூடும். இதன் காரணமாக, நேரத்தின் போது எப்போதும் சராசரிகளைப் பயன்படுத்துங்கள், மேலும் தற்காலிக சேமிப்பின் விளைவுகளைப் பற்றி எச்சரிக்கையாக இருங்கள்.
zh_tw: 這代表第一次執行某個函式時，可能會很慢，因為資料還沒進入 CPU 快取。之後再執行可能會快很多，因為資料已經在快取裡了。因此計時時務必取多次平均值，並注意快取帶來的影響。

source: Understanding caching is also crucial to CPU optimization. If you have an algorithm (routine) that loads small bits of data from randomly spread out areas of main memory, this can result in a lot of cache misses, a lot of the time, the CPU will be waiting around for data instead of doing any work. Instead, if you can make your data accesses localised, or even better, access memory in a linear fashion (like a continuous list), then the cache will work optimally and the CPU will be able to work as fast as possible.
ga: Tá sé ríthábhachtach freisin do bharrfheabhsú LAP a thuiscint a fháil Má tá algartam (gnáthamh) agat a luchtaíonn giotáin bheaga sonraí ó réimsí den phríomhchuimhne a scaiptear go randamach, d'fhéadfadh go mbeadh a lán taisce a chailleadh mar thoradh air seo, go leor den am, beidh an LAP ag fanacht timpeall le haghaidh sonraí in ionad aon obair a dhéanamh. Ina áit sin, más féidir leat rochtain do chuid sonraí a dhéanamh go háitiúil, nó níos fearr fós, cuimhne a rochtain ar bhealach líneach (cosúil le liosta leanúnach), ansin oibreoidh an taisce go barrmhaith agus beidh an LAP in ann oibriú chomh tapa agus is féidir.
ja: キャッシュを理解することは、CPU の最適化にも重要です。ランダムに分散したメインメモリ領域から小さなデータをロードするアルゴリズム (ルーチン) がある場合、キャッシュミスが頻繁に発生し、CPU が待機する時間が長くなり、何も処理できなくなります。代わりに、データアクセスをローカル化したり、メモリに線形 (連続リストなど) でアクセスしたりすれば、キャッシュが最適に機能し、CPU は可能な限り高速に処理できるようになります。
ru: Понимание кэширования также имеет решающее значение для оптимизации процессора. Если у вас есть алгоритм (рутина), который загружает небольшие биты данных из произвольно распределенных областей основной памяти, это может привести к большому количеству пропусков кэша, и большую часть времени процессор будет ждать данных, вместо того чтобы выполнять какую-либо работу. Вместо этого, если вы можете сделать доступ к данным локализованным или, еще лучше, обращаться к памяти линейно (как к непрерывному списку), тогда кэш будет работать оптимально, а процессор сможет работать максимально быстро.
ta: கேச்சிங்கைப் புரிந்துகொள்வது சிபியு தேர்வுமுறைக்கு முக்கியமானது. முதன்மையான நினைவகத்தின் தோராயமாக பரவியிருக்கும் பகுதிகளிலிருந்து சிறிய பிட் தரவை ஏற்றும் ஒரு வழிமுறை (வழக்கமான) உங்களிடம் இருந்தால், இது நிறைய கேச் மிச்ச்கள், நிறைய நேரம், சிபியு செய்வதற்கு பதிலாக தரவுக்காக காத்திருக்கும் எந்த வேலை. அதற்கு பதிலாக, உங்கள் தரவு அணுகலை ஒரு நேரியல் பாணியில் (தொடர்ச்சியான பட்டியல் போன்றவை) உள்ளூர்மயமாக்கப்பட்ட அல்லது இன்னும் சிறப்பாக அணுக முடிந்தால், கேச் உகந்ததாக செயல்படும், மேலும் சிபியு முடிந்தவரை வேகமாக வேலை செய்ய முடியும்.
zh_tw: 理解快取機制對 CPU 效能最佳化也非常關鍵。如果你的演算法（或常式）會隨機從主記憶體各處讀取零碎資料，很容易發生大量快取未命中，讓 CPU 大多時間都在等資料而無法運作。若能讓資料存取更具在地性，或最好使用線性（連續）存取（像連續陣列），快取效果就能發揮到最大，CPU 運作效率也會顯著提升。

source: Godot usually takes care of such low-level details for you. For example, the Server APIs make sure data is optimized for caching already for things like rendering and physics. Still, you should be especially aware of caching when writing GDExtensions.
ga: De ghnáth tugann Godot aire do shonraí leibhéal íseal den sórt sin duit. Mar shampla, cinntíonn na APIs Freastalaí go bhfuil sonraí optamaithe le haghaidh taiscéadadh cheana féin le haghaidh rudaí cosúil le rindreáil agus fisic. Fós féin, ba chóir duit a bheith ar an eolas go háirithe faoi chaching agus GDExtensions á scríobh agat.
ja: Godot は通常このような低レベル事情を考慮して処理しています。たとえば、サーバー API はレンダリングや物理などのために、データがキャッシュ用に最適化されています。それでも GDExtensions を作成するときは、キャッシュに特に注意する必要があります。
ru: Godot обычно берёт на себя заботу о таких низкоуровневых деталях. Например, API сервера обеспечивают оптимизацию данных для кэширования уже для таких задач, как рендеринг и физика. Тем не менее, при написании GDExtensions следует быть особенно внимательным к кэшированию.
ta: கோடோட் பொதுவாக உங்களுக்காக இதுபோன்ற குறைந்த அளவிலான விவரங்களை கவனித்துக்கொள்கிறார். எடுத்துக்காட்டாக, வழங்குதல் மற்றும் இயற்பியல் போன்ற விசயங்களுக்கு ஏற்கனவே தற்காலிக சேமிப்பிற்கு தரவு உகந்ததாக இருப்பதை சேவையக பநிஇ கள் உறுதிப்படுத்துகின்றன. இன்னும், gdextensions ஐ எழுதும் போது நீங்கள் குறிப்பாக தேக்ககத்தைப் பற்றி அறிந்திருக்க வேண்டும்.
zh_tw: Godot 通常會自動幫你處理這些底層細節。例如伺服器 API 已針對算繪和物理等資料做快取優化。不過，在撰寫 GDExtension 等原生擴充程式時，你還是要特別注意快取機制。

source: Languages
ga: Teangacha
ja: 言語
ko: 언어
pt_br: Idiomas
ru: Языки
ta: மொழிகள்
zh_tw: 程式語言

source: Godot supports a number of different languages, and it is worth bearing in mind that there are trade-offs involved. Some languages are designed for ease of use at the cost of speed, and others are faster but more difficult to work with.
ga: Tacaíonn Godot le roinnt teangacha éagsúla, agus is fiú a choinneáil i gcuimhne go bhfuil trádálacha i gceist. Tá roinnt teangacha deartha le haghaidh éasca le húsáid ar chostas luais, agus tá cuid eile níos tapúla ach níos deacra oibriú leo.
ja: Godot はさまざまな言語をサポートしていますが、トレードオフがあることを念頭に置いておく必要があります。一部の言語は速度を犠牲にして使いやすさを重視して設計されており、また他の言語は高速ですが扱いが難しいです。
ru: Godot поддерживает ряд различных языков, и стоит помнить о компромиссах. Некоторые языки разработаны для удобства использования в ущерб скорости, а другие быстрее, но с ними сложнее работать.
ta: கோடோட் பல்வேறு மொழிகளை ஆதரிக்கிறது, மேலும் வர்த்தக பரிமாற்றங்கள் உள்ளன என்பதை நினைவில் கொள்ள வேண்டும். சில மொழிகள் வேக செலவில் பயன்பாட்டிற்காக வடிவமைக்கப்பட்டுள்ளன, மற்றவை வேகமானவை, ஆனால் வேலை செய்வது மிகவும் கடினம்.
zh_tw: Godot 支援多種語言，各有優缺點。有些語言為了易用性而犧牲速度，有些則速度快但較難使用。

source: Built-in engine functions run at the same speed regardless of the scripting language you choose. If your project is making a lot of calculations in its own code, consider moving those calculations to a faster language.
ga: Ritheann feidhmeanna inneall ionsuite ag an luas céanna beag beann ar an teanga scripteála a roghnaíonn tú. Má tá do thionscadal ag déanamh go leor ríomhanna ina chód féin, smaoinigh ar na ríomhanna sin a bhogadh go teanga níos tapúla.
ja: 組み込みエンジン関数は、選択したスクリプト言語に関係なく、同じ速度で実行されます。プロジェクトで独自のコード内で多くの計算を行っている場合は、それらの計算をより高速な言語に移行することを検討してください。
ru: Встроенные функции движка работают с одинаковой скоростью независимо от выбранного языка программирования. Если ваш проект выполняет множество вычислений в собственном коде, рассмотрите возможность переноса этих вычислений на более быстрый язык.
ta: நீங்கள் தேர்ந்தெடுக்கும் ச்கிரிப்டிங் மொழியைப் பொருட்படுத்தாமல் உள்ளமைக்கப்பட்ட இயந்திர செயல்பாடுகள் அதே வேகத்தில் இயங்குகின்றன. உங்கள் திட்டம் அதன் சொந்த குறியீட்டில் நிறைய கணக்கீடுகளைச் செய்தால், அந்த கணக்கீடுகளை வேகமான மொழிக்கு நகர்த்துவதைக் கவனியுங்கள்.
zh_tw: 無論你選擇哪種腳本語言，Godot 內建引擎函式的速度都一樣。但如果你的專案有大量自訂運算，建議考慮用更快的語言來處理這些運算。

source: GDScript
ga: GDScriptName

source: :ref:`GDScript <toc-learn-scripting-gdscript>` is designed to be easy to use and iterate, and is ideal for making many types of games. However, in this language, ease of use is considered more important than performance. If you need to make heavy calculations, consider moving some of your project to one of the other languages.
ga: :ref:`GDScript <toc-learn-scripting-gdscript>` tá sé deartha le bheith éasca le húsáid agus le hathluthú, agus tá sé oiriúnach chun go leor cineálacha cluichí a dhéanamh. Mar sin féin, sa teanga seo, meastar go bhfuil éascaíocht úsáide níos tábhachtaí ná feidhmíocht. Más gá duit ríomhaireachtaí troma a dhéanamh, smaoinigh ar chuid de do thionscadal a aistriú go ceann de na teangacha eile.

source: :ref:`C# <toc-learn-scripting-C#>` is popular and has first-class support in Godot. It offers a good compromise between speed and ease of use. Beware of possible garbage collection pauses and leaks that can occur during gameplay, though. A common approach to workaround issues with garbage collection is to use *object pooling*, which is outside the scope of this guide.
ga: Tá tóir ar :ref:`C# <toc-learn-scripting-C#>` agus tá tacaíocht den chéad scoth aige in Godot. Tairgeann sé comhréiteach maith idir luas agus éascaíocht úsáide. Bí ar an airdeall faoi shosanna bailithe truflais agus sceitheanna a d’fhéadfadh tarlú le linn gameplay, áfach. Cur chuige coiteann maidir le saincheisteanna réitigh a bhaineann le bailiú truflais is ea *comhthiomsú rudaí* a úsáid, rud atá lasmuigh de raon feidhme na treorach seo.

source: Other languages
ga: Teangacha eile
ja: 他の言語
ko: 기타 언어
pt_br: Outras línguas
ru: Другие языки
ta: பிற மொழிகள்
zh_tw: 其他語言

source: Third parties provide support for several other languages, including `Rust <https://github.com/godot-rust/gdext>`_.
ga: Soláthraíonn tríú páirtithe tacaíocht do roinnt teangacha eile, lena n-áirítear `Meirge <https://github.com/godot-rust/gdext>`_.
ja: サードパーティは `Rust <https://github.com/godot-rust/gdext>`_ を含む、他にもいくつかの言語のサポートを提供しています。
ru: Третьи стороны обеспечивают поддержку нескольких других языков, включая `Rust <https://github.com/godot-rust/gdext>`_.
ta: `துரு <https://github.com/godot-rust/gdext>` _ உள்ளிட்ட பல மொழிகளுக்கு மூன்றாம் தரப்பினர் ஆதரவை வழங்குகிறார்கள்.
zh_tw: 社群也提供多種其他語言的支援，例如 `Rust <https://github.com/godot-rust/gdext>`_。

source: Godot is written in C++. Using C++ will usually result in the fastest code. However, on a practical level, it is the most difficult to deploy to end users' machines on different platforms. Options for using C++ include GDExtensions and :ref:`custom modules <doc_custom_modules_in_cpp>`.
ga: Tá Godot scríofa i C++. De ghnáth beidh an cód is tapúla mar thoradh ar úsáid C++. Ar leibhéal praiticiúil, áfach, is é an ceann is deacra é a imscaradh chuig meaisíní úsáideoirí deiridh ar ardáin éagsúla. I measc na roghanna chun C++ a úsáid tá Eisínteachtaí GDE agus :tag:`modúil saincheaptha <doc_custom_modules_in_cpp>`.
ja: Godot は C++ で書かれています。C++ を使用すると一般的に最も高速なコードになります。ただし実用レベルでは、異なるプラットフォーム上のエンドユーザーのマシンに展開するのが最も困難な言語です。C++ を使用する用途には、GDExtensions と :ref:`カスタムモジュール <doc_custom_modules_in_cpp>` があります。
ru: Godot написан на C++. Использование C++ обычно обеспечивает самый быстрый код. Однако на практике его сложнее всего развернуть на компьютерах конечных пользователей на разных платформах. Варианты использования C++ включают GDExtensions и :ref:`custom modules <doc_custom_modules_in_cpp>`.
ta: கோடோட் சி ++ இல் எழுதப்பட்டுள்ளது. சி ++ ஐப் பயன்படுத்துவது பொதுவாக வேகமான குறியீட்டை விளைவிக்கும். இருப்பினும், ஒரு நடைமுறை மட்டத்தில், வெவ்வேறு தளங்களில் பயனர்களின் இயந்திரங்களை இறுதி செய்ய மிகவும் கடினம். C ++ ஐப் பயன்படுத்துவதற்கான விருப்பங்கள் gdextensions மற்றும்: ref: `தனிப்பயன் தொகுதிகள் <doc_custom_modules_in_cpp>`.
zh_tw: Godot 是用 C++ 編寫的，使用 C++ 通常能帶來最快效能。但實務上，C++ 專案在跨平台部署時最為困難。C++ 擴充方式有 GDExtension 及 :ref:`自訂模組 <doc_custom_modules_in_cpp>`。

source: Threads
ga: Snáitheanna
ja: スレッド
ko: 스레드
pt_br: Partes_Paralelizáveis
ru: Потоки
ta: நூல்கள்
zh_tw: 執行緒

source: Consider using threads when making a lot of calculations that can run in parallel to each other. Modern CPUs have multiple cores, each one capable of doing a limited amount of work. By spreading work over multiple threads, you can move further towards peak CPU efficiency.
ga: Smaoinigh ar shnáitheanna a úsáid agus tú ag déanamh go leor ríomhaireachtaí is féidir a dhéanamh comhthreomhar lena chéile. Tá croíleacáin iolracha ag CPUanna nua-aimseartha, gach ceann acu in ann méid teoranta oibre a dhéanamh. Trí obair a scaipeadh thar snáitheanna iolracha, is féidir leat bogadh níos faide i dtreo buaicéifeachtúlacht LAP.
ja: 並列に実行できる計算を大量に行う場合は、スレッドの使用を検討してください。最新の CPU には複数のコアがあり、各コアは限られた量の作業を実行できます。タスクを複数のスレッドに分散することで、CPU の効率をさらに高めることができます。
pt_br: Considere o uso de partes_paralelizáveis(threads) ao fazer muitos cálculos que podem ser executados paralelamente entre si. As CPUs modernas têm vários núcleos, cada um capaz de realizar uma quantidade limitada de trabalho. Ao distribuir o trabalho por várias partes_paralelizáveis, você pode avançar ainda mais em direção ao pico de eficiência da CPU.
ru: Рассмотрите возможность использования потоков при выполнении большого количества вычислений, которые могут выполняться параллельно. Современные процессоры имеют несколько ядер, каждое из которых способно выполнять ограниченный объём работы. Распределяя нагрузку между несколькими потоками, можно добиться максимальной эффективности процессора.
ta: ஒருவருக்கொருவர் இணையாக இயங்கக்கூடிய நிறைய கணக்கீடுகளைச் செய்யும்போது நூல்களைப் பயன்படுத்துவதைக் கவனியுங்கள். நவீன சிபியுக்களில் பல கோர்கள் உள்ளன, ஒவ்வொன்றும் ஒரு குறிப்பிட்ட அளவு வேலைகளைச் செய்ய முடியும். பல நூல்களில் வேலையைப் பரப்புவதன் மூலம், நீங்கள் உச்ச சிபியு செயல்திறனை நோக்கி மேலும் செல்லலாம்.
zh_tw: 如果你的運算可平行處理，建議善用「執行緒」。現代 CPU 多為多核心，各核心可同時處理不同工作。將運算分散到多執行緒，能更有效發揮 CPU 效率。

source: The disadvantage of threads is that you have to be incredibly careful. As each CPU core operates independently, they can end up trying to access the same memory at the same time. One thread can be reading to a variable while another is writing: this is called a *race condition*. Before you use threads, make sure you understand the dangers and how to try and prevent these race conditions. Threads can make debugging considerably more difficult.
ga: Is é míbhuntáiste na snáitheanna ná go gcaithfidh tú a bheith thar a bheith cúramach. De réir mar a oibríonn gach croí LAP go neamhspleách, is féidir leo iarracht a dhéanamh rochtain a fháil ar an gcuimhne céanna ag an am céanna. Is féidir snáithe amháin a léamh ar athróg agus ceann eile ag scríobh: tugtar coinníoll rása* air seo. Sula n-úsáideann tú snáitheanna, déan cinnte go dtuigeann tú na contúirtí agus conas triail a bhaint as na coinníollacha cine seo Is féidir le snáithe dífhabhtú a dhéanamh i bhfad níos deacra.
ja: スレッドの欠点は、非常に注意しなければならないことです。各 CPU コアは独立して動作するため、同時に同じメモリにアクセスしようとする可能性があります。1 つのスレッドが変数を読み込んでいる間に、別のスレッドが書き込みを行っている可能性があります。これは *競合状態* と呼ばれます。スレッドを使用する前に、この危険性と競合状態を防ぐ方法を理解しておく必要があります。スレッドを使用すると、デバッグがかなり難しくなる可能性があります。
pt_br: A desvantagem do uso de partes_paralelizáveis (threads) é que você precisa ser extremamente cuidadoso. Como cada núcleo da CPU opera de forma independente, eles podem acabar tentando acessar a mesma memória ao mesmo tempo. Uma parte_paralelizável pode ler uma variável enquanto outro escreve: isso é chamado de *condição de corrida*. Antes de usar threads, certifique-se de compreender os perigos e como tentar evitar essas condições de corrida. Partes_Paralelizáveis(threads) podem tornar a depuração consideravelmente mais difícil.
ru: Недостаток потоков заключается в необходимости соблюдать крайнюю осторожность. Поскольку каждое ядро процессора работает независимо, они могут одновременно пытаться получить доступ к одной и той же памяти. Один поток может читать переменную, пока другой записывает её: это называется *состоянием гонки*. Прежде чем использовать потоки, убедитесь, что вы понимаете связанные с ними опасности и знаете, как предотвратить эти состояния гонки. Потоки могут значительно усложнить отладку.
ta: நூல்களின் தீமை என்னவென்றால், நீங்கள் நம்பமுடியாத கவனமாக இருக்க வேண்டும். ஒவ்வொரு சிபியு கோர் சுயாதீனமாக இயங்குவதால், அவை ஒரே நேரத்தில் ஒரே நினைவகத்தை அணுக முயற்சிக்கும். ஒரு நூல் ஒரு மாறிக்கு படிக்கலாம், மற்றொன்று எழுதுகிறது: இது ஒரு *ரேச் நிலை *என்று அழைக்கப்படுகிறது. நீங்கள் நூல்களைப் பயன்படுத்துவதற்கு முன், ஆபத்துகள் மற்றும் இந்த இன நிலைமைகளை எவ்வாறு முயற்சிப்பது மற்றும் தடுப்பது என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். நூல்கள் பிழைத்திருத்தத்தை மிகவும் கடினமாக்கும்.
zh_tw: 執行緒的缺點是必須小心避免競爭狀態（Race Condition）。每個 CPU 核心獨立運作，可能同時存取同一記憶體位置。一個執行緒可能正在讀取變數，另一個則在寫入，這就是 *競爭狀態*。在使用多執行緒之前，請務必瞭解相關風險與預防方式，因為多執行緒會讓除錯難度大幅提升。

source: For more information on threads, see :ref:`doc_using_multiple_threads`.
ga: Le haghaidh tuilleadh faisnéise faoi snáitheanna, féach:ref: `doc_using_multiple_threads`.
ja: スレッドの詳細については、:ref:`doc_using_multiple_threads` を参照してください。
ko: 스레드에 대한 자세한 정보는 :ref:`doc_using_multiple_threads`\ 를 참조하세요.
pt_br: Para obter mais informações sobre partes_paralelizáveis, consulte: ref: `doc_c_sharp_differences`.
ru: Более подробную информацию о потоках см. :ref:`doc_using_multiple_threads`.
ta: நூல்களைப் பற்றிய கூடுதல் தகவலுக்கு, காண்க: ref: `doc_using_multiple_threads`.
zh_tw: 更多關於執行緒的詳細資訊，請參閱 :ref:`doc_using_multiple_threads`。
