Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/cpu_optimization.po
Languages: ga, ja, ko, pt_br, ru, ta, zh_tw

source: Although Nodes are an incredibly powerful and versatile concept, be aware that every node has a cost. Built-in functions such as ``_process()`` and ``_physics_process()`` propagate through the tree. This housekeeping can reduce performance when you have a very large numbers of nodes (how many exactly depends on the target platform and can range from thousands to tens of thousands so ensure that you profile performance on all target platforms during development).
ga: Cé gur coincheap thar a bheith cumhachtach agus ildánach iad Nóid, bí ar an eolas go bhfuil costas ag baint le gach nód. Feidhmeanna insuite ar nós `` _process()`` agus `` _phróiseas_fisice()`` iomadaítear tríd an gcrann. Féadann an bhainistíocht tí seo feidhmíocht a laghdú nuair a bhíonn líon an-mhór nóid agat (braitheann cé mhéad go díreach ar an sprioc-ardán agus is féidir leis a bheith idir na mílte agus na mílte agus mar sin cinntigh go ndéanann tú próifíl ar fheidhmíocht ar gach sprioc-ardán le linn na forbartha).
ja: ノードは非常に強力で多用途な概念ですが、すべてのノードにはコストがかかることに注意してください。 ``_process()`` や ``_physics_process()`` などの組み込み関数はツリー全体に伝播します。この便利な仕組みによりノードの数が非常に多い場合、パフォーマンスが低下する可能性があります (正確な数はターゲットプラットフォームによって異なり、数千から数万の範囲になる可能性があるため、開発中にすべてのターゲットプラットフォームでパフォーマンスプロファイルを行うようにしてください)。
ru: Хотя Узлы (Nodes) — невероятно мощная и универсальная концепция, помните, что каждый узел имеет свою стоимость. Встроенные функции, такие как ``_process()`` и ``_physics_process()``, распространяются по всему дереву. Эта функция может снизить производительность при очень большом количестве узлов (точное количество зависит от целевой платформы и может варьироваться от тысяч до десятков тысяч, поэтому обязательно оцените производительность на всех целевых платформах во время разработки).
ta: முனைகள் நம்பமுடியாத சக்திவாய்ந்த மற்றும் பல்துறை கருத்து என்றாலும், ஒவ்வொரு முனைக்கும் ஒரு செலவு உள்ளது என்பதை அறிந்து கொள்ளுங்கள். `` _PROCESS () `` `மற்றும்` _physics_process () `` மரத்தின் வழியாக பிரச்சாரம் செய்யுங்கள். உங்களிடம் மிகப் பெரிய எண்ணிக்கையிலான முனைகள் இருக்கும்போது இந்த வீட்டு பராமரிப்பு செயல்திறனைக் குறைக்கலாம் (எத்தனை சரியாக இலக்கு தளத்தைப் பொறுத்தது மற்றும் ஆயிரக்கணக்கான முதல் பல்லாயிரக்கணக்கானவர்கள் வரை இருக்கும், எனவே வளர்ச்சியின் போது அனைத்து இலக்கு தளங்களிலும் செயல்திறனை சுயவிவரப்படுத்துவதை உறுதிசெய்க).
zh_tw: 節點（Node）雖然非常強大且彈性高，但每個節點都會帶來效能負擔。像 ``_process()``、``_physics_process()`` 等內建函式會遍歷整個樹狀結構。當你的專案包含大量節點時（數千至數萬，依平台而異），這些管理開銷會大幅影響效能。建議開發時務必針對所有目標平台進行效能檢測與剖析。

source: Each node is handled individually in the Godot renderer. Therefore, a smaller number of nodes with more in each can lead to better performance.
ga: Láimhseálfar gach nód ina n-aonar sa renderer Godot. Dá bhrí sin, is féidir feidhmíocht níos fearr a bheith mar thoradh ar líon níos lú nóid le níos mó i ngach ceann acu.
ja: Godot レンダラーでは、各ノードが個別に処理されます。そのため、各ノードの数が少ないほど、パフォーマンスが向上します。
ru: Каждый узел обрабатывается отдельно в рендерере Godot. Поэтому меньшее количество узлов и большее количество каждого из них может привести к лучшей производительности.
ta: ஒவ்வொரு முனையும் கோடோட் ரெண்டரரில் தனித்தனியாக கையாளப்படுகிறது. எனவே, ஒவ்வொன்றிலும் அதிக எண்ணிக்கையிலான முனைகள் சிறந்த செயல்திறனுக்கு வழிவகுக்கும்.
zh_tw: Godot 算繪器會逐一處理每個節點，因此減少節點數、將更多內容集中在單一節點，效能表現會更佳。

source: One quirk of the :ref:`SceneTree <class_SceneTree>` is that you can sometimes get much better performance by removing nodes from the SceneTree, rather than by pausing or hiding them. You don't have to delete a detached node. You can for example, keep a reference to a node, detach it from the scene tree using :ref:`Node.remove_child(node) <class_Node_method_remove_child>`, then reattach it later using :ref:`Node.add_child(node) <class_Node_method_add_child>`. This can be very useful for adding and removing areas from a game, for example.
ga: Gné amháin den :ref:`SceneTree <class_SceneTree>` is ea gur féidir leat feidhmíocht i bhfad níos fearr a fháil uaireanta trí nóid a bhaint den SceneTree, seachas iad a chur ar sos nó a chur i bhfolach. Ní gá duit nód scoite a scriosadh. Is féidir leat, mar shampla, tagairt a choinneáil do nód, é a dhícheangal ón gcrann radhairc trí úsáid a bhaint as :ref:`Node.remove_child(node) <class_Node_method_remove_child>`, ansin é a cheangal arís níos déanaí ag baint úsáide as :ref:`Node.add_child(node) < rang_Nóid_modh_cuir_leanbh>`. Is féidir é seo a bheith an-úsáideach chun limistéir a chur leis agus a bhaint as cluiche, mar shampla.
ja: :ref:`SceneTree <class_SceneTree>` の奇妙な点は、ノードを一時停止したり非表示にしたりするよりも、SceneTree からノードを削除した方がパフォーマンスが大幅に向上する場合があるということです。切り離されたノードを削除する必要はありません。たとえば、ノードへの参照を保持し、:ref:`Node.remove_child(node) <class_Node_method_remove_child>` を使用してシーンツリーから切り離し、後で :ref:`Node.add_child(node) <class_Node_method_add_child>` を使用して再接続することができます。これは例えばゲームのステージにエリアを追加したり削除したりするときに非常に便利です。
ru: Одна из особенностей :ref:`SceneTree <class_SceneTree>` заключается в том, что иногда можно добиться гораздо большей производительности, удаляя узлы из SceneTree, а не приостанавливая или скрывая их. Удалять отсоединённый узел не обязательно. Например, можно сохранить ссылку на узел, отсоединить его от дерева сцены с помощью :ref:`Node.remove_child(node) <class_Node_method_remove_child>`, а затем снова присоединить его позже с помощью :ref:`Node.add_child(node) <class_Node_method_add_child>`. Это может быть очень полезно, например, для добавления и удаления областей в игре.
ta: ஒரு நகைச்சுவையானது: ref: `SceseTree <class_scenetree>` என்னவென்றால், சில நேரங்களில் நீங்கள் இடைநிறுத்தப்படுவதையோ அல்லது மறைப்பதையோ விட, காட்சியில் இருந்து முனைகளை அகற்றுவதன் மூலம் மிகச் சிறந்த செயல்திறனைப் பெறலாம். பிரிக்கப்பட்ட முனையை நீங்கள் நீக்க வேண்டியதில்லை. எடுத்துக்காட்டாக, நீங்கள் ஒரு முனைக்கு ஒரு குறிப்பை வைத்து, காட்சி மரத்திலிருந்து அதைப் பயன்படுத்தலாம்: ref: `node.remove_child (முனை) <class_node_method_remove_child>`, பின்னர் அதைப் பயன்படுத்துங்கள்: reattach: `node.add_child (node) class_node_method_add_child> `. எடுத்துக்காட்டாக, ஒரு விளையாட்டிலிருந்து பகுதிகளைச் சேர்ப்பதற்கும் அகற்றுவதற்கும் இது மிகவும் பயனுள்ளதாக இருக்கும்.
zh_tw: :ref:`SceneTree <class_SceneTree>` 有個特性：你可以將節點從場景樹移除（而非只暫停或隱藏），這樣效能會更好。你不一定要刪除該節點——例如可以保留節點參考，用 :ref:`Node.remove_child(node) <class_Node_method_remove_child>` 拆下，之後再用 :ref:`Node.add_child(node) <class_Node_method_add_child>` 加回來。這對於切換遊戲區域等場景非常實用。

source: You can avoid the SceneTree altogether by using Server APIs. For more information, see :ref:`doc_using_servers`.
ga: Is féidir leat an SceneTree a sheachaint ar fad trí APIs Freastalaí a úsáid. Le haghaidh tuilleadh faisnéise, féach:ref: `doc_using_servers`.
ja: サーバー API を使用すると、SceneTree を完全に回避できます。詳細については :ref:`doc_using_servers` を参照してください。
ru: Вы можете полностью отказаться от SceneTree, используя серверные API. Подробнее см. :ref:`doc_using_servers`.
ta: சேவையக பநிஇ களைப் பயன்படுத்துவதன் மூலம் நீங்கள் காட்சியை முழுவதுமாக தவிர்க்கலாம். மேலும் தகவலுக்கு, காண்க: ref: `doc_using_servers`.
zh_tw: 你也可以選擇完全不用 SceneTree，直接用 Server API 處理。詳情請參見 :ref:`doc_using_servers`。

source: Physics
ga: Fisic
ja: 物理
ko: 물리
pt_br: Física
ru: Физика
ta: இயற்பியல்
zh_tw: 物理

source: In some situations, physics can end up becoming a bottleneck. This is particularly the case with complex worlds and large numbers of physics objects.
ga: I gcásanna áirithe, is féidir leis an bhfisic a bheith ina scagal. Tá sé seo amhlaidh go háirithe le domhan casta agus líon mór rudaí fisice.
ja: 状況によっては、物理がボトルネックになることがあります。これは複雑な世界や、多数の物理オブジェクトがある場合に特に当てはまります。
ru: В некоторых ситуациях физика может стать узким местом. Это особенно актуально в сложных мирах и с большим количеством физических объектов.
ta: சில சூழ்நிலைகளில், இயற்பியல் ஒரு தடையாக மாறும். சிக்கலான உலகங்கள் மற்றும் அதிக எண்ணிக்கையிலான இயற்பியல் பொருள்களின் விசயத்தில் இது குறிப்பாக உள்ளது.
zh_tw: 在某些情境下，物理運算會成為主要瓶頸。尤其是世界龐大或有大量物理物件時更是如此。

source: Here are some techniques to speed up physics:
ga: Seo roinnt teicnící chun an fhisic a bhrostú:
ja: 物理を高速化するテクニックをいくつか紹介します。
pt_br: Aqui estão algumas técnicas para acelerar a física:
ru: Вот несколько приемов для ускорения физики:
ta: இயற்பியலை விரைவுபடுத்த சில நுட்பங்கள் இங்கே:
zh_tw: 以下是提升物理效能的幾個技巧：

source: Try using simplified versions of your rendered geometry for collision shapes. Often, this won't be noticeable for end users, but can greatly increase performance.
ga: Bain triail as leaganacha simplithe de do ghéiméadracht rindreáilte a úsáid le Go minic, ní bheidh sé seo faoi deara d'úsáideoirí deiridh, ach féadann sé feidhmíocht a mhéadú go mór.
ja: 衝突シェイプはレンダリングされたジオメトリの簡略化されたバージョンを使用してみてください。多くの場合、これはエンドユーザーには気付かれませんが、パフォーマンスを大幅に向上させることができます。
ru: Попробуйте использовать упрощённые версии визуализированной геометрии для форм столкновений. Зачастую это незаметно для конечных пользователей, но может значительно повысить производительность.
ta: மோதல் வடிவங்களுக்கு உங்கள் வழங்கப்பட்ட வடிவவியலின் எளிமையான பதிப்புகளைப் பயன்படுத்த முயற்சிக்கவும். பெரும்பாலும், இது இறுதி பயனர்களுக்கு கவனிக்காது, ஆனால் செயல்திறனை பெரிதும் அதிகரிக்கும்.
zh_tw: 碰撞形狀建議用簡化版幾何圖形。這通常對玩家來說感覺不到差異，但能大幅提升效能。

source: Try removing objects from physics when they are out of view / outside the current area, or reusing physics objects (maybe you allow 8 monsters per area, for example, and reuse these).
ga: Bain triail as rudaí a bhaint ón bhfisic nuair a bhíonn siad as amharc/lasmuigh den limistéar reatha, nó rudaí fisice a athúsáid (b'fhéidir go gceadaíonn tú 8 arrachtaigh in aghaidh an limistéir, mar shampla, agus iad seo a athúsáid).
ja: オブジェクトが視界外または現在のエリア外にある場合は物理からオブジェクトを削除するか、物理オブジェクトを再利用してみてください (たとえば、エリアごとに 8 体のモンスターのみ許可し、これらを再利用します)。
ru: Попробуйте удалить объекты из физики, когда они находятся вне поля зрения/за пределами текущей области, или повторно использовать физические объекты (например, можно разрешить 8 монстров на область и повторно использовать их).
ta: தற்போதைய பகுதிக்கு வெளியே / வெளியே இருக்கும்போது இயற்பியலில் இருந்து பொருட்களை அகற்ற முயற்சிக்கவும், அல்லது இயற்பியல் பொருள்களை மீண்டும் பயன்படுத்தவும் (ஒருவேளை நீங்கள் ஒரு பகுதிக்கு 8 அரக்கர்களை அனுமதிக்கலாம், எடுத்துக்காட்டாக, இவற்றை மீண்டும் பயன்படுத்தலாம்).
zh_tw: 當物件離開畫面或當前區域時，可以暫時將它們從物理世界移除，或重複利用物理物件（例如每個區域只需 8 隻怪物時就重用這 8 隻）。

source: Another crucial aspect to physics is the physics tick rate. In some games, you can greatly reduce the tick rate, and instead of for example, updating physics 60 times per second, you may update them only 30 or even 20 times per second. This can greatly reduce the CPU load.
ga: Gné ríthábhachtach eile den fhisic is ea an ráta tic fisice. I roinnt cluichí, is féidir leat an ráta tic a laghdú go mór, agus in ionad mar shampla, an fhisic a nuashonrú 60 uair sa tsoicind, ní féidir leat iad a nuashonrú ach 30 nó fiú 20 huaire in aghaidh an tsoicind. Féadann sé seo an t-ualach LAP a laghdú go mór.
ja: 物理エンジンのもう 1 つの重要な側面は、物理ティックレートです。ゲームによってはティックレートを大幅に削減して、たとえば物理を 1 秒あたり 60 回更新するのではなく、1 秒あたり 30 回または 20 回だけ更新することもできます。これにより CPU 負荷を大幅に軽減できます。
ru: Другим важным аспектом физики является частота тиков. В некоторых играх её можно значительно снизить, например, вместо обновления физики 60 раз в секунду, а можно обновлять её всего 30 или даже 20 раз в секунду. Это может значительно снизить нагрузку на процессор.
ta: இயற்பியலின் மற்றொரு முக்கியமான நற்பொருத்தம் இயற்பியல் டிக் விகிதம். சில விளையாட்டுகளில், நீங்கள் டிக் விகிதத்தை வெகுவாகக் குறைக்கலாம், எடுத்துக்காட்டாக, இயற்பியலை நொடிக்கு 60 முறை புதுப்பிக்க, நீங்கள் அவற்றை 30 அல்லது நொடிக்கு 20 மடங்கு மட்டுமே புதுப்பிக்கலாம். இது சிபியு சுமையை வெகுவாகக் குறைக்கும்.
zh_tw: 物理運算的另一個重點是「物理更新頻率」（tick rate）。某些遊戲可以將更新頻率從每秒 60 次降到 30 次甚至 20 次，這能大幅減輕 CPU 負擔。

source: The downside of changing physics tick rate is you can get jerky movement or jitter when the physics update rate does not match the frames per second rendered. Also, decreasing the physics tick rate will increase input lag. It's recommended to stick to the default physics tick rate (60 Hz) in most games that feature real-time player movement.
ga: Is é an míbhuntáiste a bhaineann le ráta tic na fisice a athrú ná gur féidir leat gluaiseacht nó jitter a fháil nuair nach n-oireann an ráta nuashonraithe fisice leis na frámaí in aghaidh an tsoicind a rinneadh. Chomh maith leis sin, méadóidh laghdú ráta tic na fisice moill ionchuir. Moltar cloí leis an ráta tic fisic réamhshocraithe (60 Hz) i bhformhór na gcluichí ina bhfuil gluaiseacht imreoirí fíor-ama acu.
ja: 物理ティックレートを変更することの欠点は、物理更新のレートがレンダリングされる 1 秒あたりのフレーム数と一致しない場合、ぎくしゃくした動きやジッターが発生する可能性があることです。また物理ティックレートを下げると、入力遅延が増加します。リアルタイムのプレイヤー移動を特徴とするほとんどのゲームでは、デフォルトの物理ティックレート (60 Hz) を維持することが推奨されます。
ru: Недостатком изменения частоты физических тиков является возможность возникновения рывков или дрожания, когда частота обновления физики не соответствует количеству кадров в секунду. Кроме того, уменьшение частоты физических тиков увеличит задержку ввода. В большинстве игр с движением игрока в реальном времени рекомендуется придерживаться частоты физических тиков по умолчанию (60 Гц).
ta: இயற்பியல் டிக் வீதத்தை மாற்றுவதன் தீங்கு என்னவென்றால், இயற்பியல் புதுப்பிப்பு வீதம் நொடிக்கு பிரேம்களுடன் பொருந்தாதபோது நீங்கள் செர்கி இயக்கம் அல்லது நடுக்கம் பெறலாம். மேலும், இயற்பியல் டிக் வீதத்தைக் குறைப்பது உள்ளீட்டு பின்னடைவை அதிகரிக்கும். நிகழ்நேர பிளேயர் இயக்கத்தைக் கொண்டிருக்கும் பெரும்பாலான விளையாட்டுகளில் இயல்புநிலை இயற்பியல் டிக் வீதத்துடன் (60 எர்ட்ச்) ஒட்டிக்கொள்ள பரிந்துரைக்கப்படுகிறது.
zh_tw: 調整物理更新頻率的缺點是，當更新頻率與算繪影格速率不一致時，容易出現卡頓或抖動，而且降低更新頻率會增加輸入延遲。若遊戲需要即時玩家操作，建議維持預設 60Hz 物理更新頻率。

source: The solution to jitter is to use *fixed timestep interpolation*, which involves smoothing the rendered positions and rotations over multiple frames to match the physics. You can either implement this yourself or use a `third-party addon <https://github.com/lawnjelly/smoothing-addon>`__. Performance-wise, interpolation is a very cheap operation compared to running a physics tick. It's orders of magnitude faster, so this can be a significant performance win while also reducing jitter.
ga: Is é an réiteach ar ghiodam ná *idirshuíomh seasta céime ama* a úsáid, a bhaineann leis na suíomhanna rindreáilte agus na rothlaithe a smúdáil thar frámaí iolracha chun an fhisic a mheaitseáil. Is féidir leat é seo a chur i bhfeidhm tú féin nó úsáid a bhaint as `addon tríú páirtí <https://github.com/lawnjelly/smoothing-addon>`__. Ó thaobh feidhmíochta de, is oibríocht an-saor é idirshuíomh i gcomparáid le tic fisice a rith. Orduithe méide níos tapúla é, agus mar sin is féidir bua suntasach feidhmíochta a bheith aige agus é ag laghdú Giodam freisin.
ja: ジッターの解決策は *固定タイムステップ補間* を使用することです。これには物理に合わせて複数のフレームにわたってレンダリングされた位置と回転を滑らかにする処理が含まれます。これを自分で実装するか、もしくは `サードパーティのアドオン <https://github.com/lawnjelly/smoothing-addon>`__ を使用できます。パフォーマンスの点では、補間は物理ティックを実行するのに比べて非常に安価な操作です。そして桁違いに高速なので、ジッターを減らしながらパフォーマンスを大幅に向上できます。
ta: *நிலையான நேர அட்டவணையின் இடைக்கணிப்பு *ஐப் பயன்படுத்துவதே நடுக்கத்திற்கான தீர்வு, இது இயற்பியலுடன் பொருந்தக்கூடிய பல பிரேம்களில் வழங்கப்பட்ட நிலைகள் மற்றும் சுழற்சிகளை மென்மையாக்குவதை உள்ளடக்கியது. இதை நீங்களே செயல்படுத்தலாம் அல்லது `மூன்றாம் தரப்பு துணை <https://github.com/lawnjelly/smoothing-addon> __. செயல்திறன் வாரியாக, இடைக்கணிப்பு என்பது இயற்பியல் டிக் இயக்குவதை ஒப்பிடும்போது மிகவும் மலிவான செயல்பாடாகும். இது வேகமான ஆர்டர்கள், எனவே இது ஒரு குறிப்பிடத்தக்க செயல்திறன் வெற்றியாக இருக்கும், அதே நேரத்தில் நடுக்கம் குறைகிறது.

source: :ref:`GDScript <doc_gdscript>` is designed to be easy to use and iterate, and is ideal for making many types of games. However, in this language, ease of use is considered more important than performance. If you need to make heavy calculations, consider moving some of your project to one of the other languages.
ru: :ref:`GDScript <doc_gdscript>` разработан для удобства использования и итераций и идеально подходит для создания самых разных игр. Однако в этом языке простота использования считается важнее производительности. Если вам нужно выполнять сложные вычисления, рассмотрите возможность переноса части вашего проекта на один из других языков.

source: :ref:`C# <doc_c_sharp>` is popular and has first-class support in Godot. It offers a good compromise between speed and ease of use. Beware of possible garbage collection pauses and leaks that can occur during gameplay, though. A common approach to workaround issues with garbage collection is to use *object pooling*, which is outside the scope of this guide.
ru: :ref:`C# <doc_c_sharp>` популярен и имеет первоклассную поддержку в Godot. Он предлагает хороший компромисс между скоростью и простотой использования. Однако будьте осторожны с возможными паузами в сборке мусора и утечками, которые могут возникнуть во время игры. Распространённый подход к решению проблем со сборкой мусора — использование *object pooling*, что выходит за рамки данного руководства.

source: SceneTree
ja: シーンツリー
ko: 씬트리
ru: Дерево сцены
ta: காட்சி

source: The solution to jitter is to use *fixed timestep interpolation*, which involves smoothing the rendered positions and rotations over multiple frames to match the physics. Godot has built-in physics interpolation which you can read about :ref:`here<doc_physics_interpolation>`. Performance-wise, interpolation is a very cheap operation compared to running a physics tick. It's orders of magnitude faster, so this can be a significant performance win while also reducing jitter.
ru: Решением проблемы дрожания является использование *интерполяции с фиксированным временным шагом*, которая включает сглаживание визуализированных положений и поворотов в нескольких кадрах для соответствия физике. Godot имеет встроенную физическую интерполяцию, о которой вы можете прочитать сдесь :ref:`here<doc_physics_interpolation>`. С точки зрения производительности интерполяция — очень дешевая операция по сравнению с выполнением физического тика. Он на порядок быстрее, так что это может дать существенный выигрыш в производительности, а также снизить дрожание (jitter).

source: C#
ta: சி#

source: C++
ta: சி ++
