Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/cpu_optimization.po
Languages: ga, ja, ko, pt_br, ru, ta, zh_tw

source: CPU optimization
ga: Optamú LAP
ja: CPUの最適化
ko: CPU 최적화
pt_br: Otimização da CPU
ru: Оптимизация CPU
ta: சிபியு தேர்வுமுறை
zh_tw: CPU 最佳化

source: Measuring performance
ga: feidhmíocht a thomhas
ja: パフォーマンスの測定
pt_br: Medindo o desempenho
ru: Замер производительности
ta: செயல்திறனை அளவிடுதல்
zh_tw: 效能量測

source: We have to know where the "bottlenecks" are to know how to speed up our program. Bottlenecks are the slowest parts of the program that limit the rate that everything can progress. Focusing on bottlenecks allows us to concentrate our efforts on optimizing the areas which will give us the greatest speed improvement, instead of spending a lot of time optimizing functions that will lead to small performance improvements.
ga: Caithfimid a fhios a bheith againn cá bhfuil na “stragaill” chun a fhios a bheith againn conas ár gclár a bhrostú. Is iad scagail na codanna is moille den chlár a chuireann teorainn leis an ráta is féidir le gach rud dul chun cinn. Trí dhíriú ar scagleangail is féidir linn ár n-iarrachtaí a dhíriú ar na réimsí a bharrfheabhsú a thabharfaidh an feabhsú luais is mó dúinn, in ionad go leor ama a chaitheamh feidhmeanna a bharrfheabhsóidh feabhsuithe beaga feidhmíochta mar thoradh orthu.
ja: プログラムを高速化するには、「ボトルネック」がどこにあるかを知る必要があります。ボトルネックとは、プログラムの中で最も遅い部分であり、全体の実行速度を制限します。ボトルネックに焦点を当てることで、わずかなパフォーマンス向上につながる機能の最適化に多くの時間を費やすのではなく、速度を最大限に向上できる領域の最適化に労力を集中できます。
ru: Нам необходимо знать, где находятся "узкие места", чтобы знать, как ускорить нашу программу. Узкие места — это самые медленные части программы, ограничивающие скорость её выполнения. Сосредоточение внимания на "узких местах" позволяет нам сосредоточить усилия на оптимизации областей, которые обеспечат максимальный прирост скорости, вместо того, чтобы тратить много времени на оптимизацию функций, приводящую к небольшому повышению производительности.
ta: எங்கள் திட்டத்தை எவ்வாறு விரைவுபடுத்துவது என்பதை "இடையூறுகள்" எங்கே என்பதை நாம் அறிந்து கொள்ள வேண்டும். எல்லாவற்றையும் முன்னேற்றக்கூடிய விகிதத்தைக் கட்டுப்படுத்தும் திட்டத்தின் மெதுவான பகுதிகள் இடையூறுகள். இடையூறுகளில் கவனம் செலுத்துவது, சிறிய செயல்திறன் மேம்பாடுகளுக்கு வழிவகுக்கும் செயல்பாடுகளை மேம்படுத்துவதற்கு அதிக நேரம் செலவழிப்பதற்குப் பதிலாக, மிகப் பெரிய வேக முன்னேற்றத்தை எங்களுக்கு வழங்கும் பகுதிகளை மேம்படுத்துவதில் எங்கள் முயற்சிகளைக் குவிக்க அனுமதிக்கிறது.
zh_tw: 想要加速程式，我們必須先找出「瓶頸」在哪裡。瓶頸是指限制整體進度的最慢區段。專注於瓶頸可以讓我們集中精力優化最能帶來顯著效能提升的部分，而不是花大量時間在只會帶來微小提升的功能上。

source: For the CPU, the easiest way to identify bottlenecks is to use a profiler.
ga: Maidir leis an LAP, is é an bealach is éasca chun stragaill a aithint ná próifíleoir a úsáid.
ja: CPU の場合、ボトルネックを特定する最も簡単な方法は、プロファイラーを使用することです。
ru: Для CPU самый простой способ выявить узкие места — использовать профайлер (profiler).
ta: சிபியு ஐப் பொறுத்தவரை, தடைகளை அடையாளம் காண எளிதான வழி ஒரு சுயவிவரத்தைப் பயன்படுத்துவதாகும்.
zh_tw: 對於 CPU 而言，找出瓶頸最簡單的方法就是使用效能分析器（Profiler）。

source: CPU profilers
ga: Próifílí LAP
ja: CPUプロファイラー
ko: CPU 프로파일러
pt_br: Perfiladores de CPU
ru: Профайлеры CPU
ta: சிபியு விவரக்குறிப்புகள்
zh_tw: CPU 剖析器

source: Profilers run alongside your program and take timing measurements to work out what proportion of time is spent in each function.
ga: Ritheann próifílí in éineacht le do chlár agus déanann siad tomhais uainithe chun a oibriú amach cén cion den am a chaitear i ngach feidhm.
ja: プロファイラーはプログラムと並行して実行され、タイミング測定を行って各関数に費やされる時間の割合を計算します。
ru: Профилировщики работают вместе с вашей программой и выполняют измерения времени, чтобы определить, какая доля времени тратится на каждую функцию.
ta: சுயவிவரங்கள் உங்கள் திட்டத்துடன் இயங்குகின்றன, மேலும் ஒவ்வொரு செயல்பாட்டிலும் என்ன நேரம் செலவிடப்படுகின்றன என்பதைச் செய்ய நேர அளவீடுகளை எடுத்துக்கொள்கிறது.
zh_tw: 剖析器會與你的程式同時執行，並量測每個函式所花費的時間比例。

source: The Godot IDE conveniently has a built-in profiler. It does not run every time you start your project: it must be manually started and stopped. This is because, like most profilers, recording these timing measurements can slow down your project significantly.
ga: Tá próifíleoir ionsuite ag an Godot IDE. Ní ritheann sé gach uair a thosaíonn tú do thionscadal: ní mór é a thosú agus a stopadh de láimh. Is é an fáth atá leis seo ná, ar nós an chuid is mó de na próifíleoirí, gur féidir moill shuntasach a chur ar do thionscadal má dhéantar na tomhais ama seo a thaifeadadh.
ja: Godot IDE には便利な組み込みプロファイラーがあります。プロジェクトを開始するたびに実行されるわけではなく、手動で開始および停止する必要があります。これはほとんどのプロファイラーと同様に、これらのタイミング測定を記録するとプロジェクトが大幅に遅くなる可能性があるためです。
ru: Godot IDE имеет встроенный профилировщик (built-in profiler). Он не запускается при каждом запуске проекта: его необходимо запускать и останавливать вручную. Это связано с тем, что, как и в случае с большинством профилировщиков, запись этих измерений времени может значительно замедлить проект.
ta: கோடோட் ஐடிஇ வசதியாக ஒரு உள்ளமைக்கப்பட்ட விவரக்குறிப்பைக் கொண்டுள்ளது. உங்கள் திட்டத்தைத் தொடங்கும் ஒவ்வொரு முறையும் இது இயங்காது: இது கைமுறையாக தொடங்கப்பட்டு நிறுத்தப்பட வேண்டும். ஏனென்றால், பெரும்பாலான சுயவிவரங்களைப் போலவே, இந்த நேர அளவீடுகளையும் பதிவு செய்வது உங்கள் திட்டத்தை கணிசமாக மெதுவாக்கும்.
zh_tw: Godot 編輯器內建了方便的剖析器。它不會在每次啟動專案時自動執行，必須手動啟動與停止。這是因為，和多數剖析器一樣，記錄這些時序資料會顯著拖慢你的專案速度。

source: After profiling, you can look back at the results for a frame.
ga: Tar éis próifíliú, is féidir leat breathnú siar ar na torthaí le haghaidh fráma.
ja: プロファイリングの後、フレームの結果を確認することができます。
ru: После профилирования вы можете просмотреть результаты для кадра.
ta: சுயவிவரத்திற்குப் பிறகு, ஒரு சட்டகத்திற்கான முடிவுகளை நீங்கள் திரும்பிப் பார்க்கலாம்.
zh_tw: 剖析結束後，你可以回顧單一影格的結果。

source: Screenshot of the Godot profiler
ga: Scáileán den phróifíleoir Godot
ja: Godot プロファイラーのスクリーンショット
ko: Godot 프로파일러의 스크린샷
pt_br: Captura de tela do perfil Godot
ru: Скриншот профайлера Godot
ta: கோடோட் சுயவிவரத்தின் திரை காட்சி
zh_tw: Godot 剖析器截圖

source: Results of a profile of one of the demo projects.
ga: Torthaí próifíl ceann de na tionscadail taispeána.
ja: デモプロジェクトの 1 つのプロファイルの結果。
ru: Результаты профиля одного из демонстрационных проектов.
ta: டெமோ திட்டங்களில் ஒன்றின் சுயவிவரத்தின் முடிவுகள்.
zh_tw: 其中一個範例專案的剖析結果。

source: We can see the cost of built-in processes such as physics and audio, as well as seeing the cost of our own scripting functions at the bottom.
ga: Is féidir linn costas na bpróisis ionsuite mar fhisic agus fuaim a fheiceáil, chomh maith le costas ár bhfeidhmeanna scripteála féin a fheiceáil ag bun.
ja: 物理やオーディオなどの組み込みプロセスのコストを確認できるほか、下部には独自のスクリプト関数のコストも表示されます。
ru: Мы можем увидеть стоимость встроенных процессов, таких как физика и звук, а также стоимость наших собственных функций скриптов внизу.
ta: இயற்பியல் மற்றும் ஆடியோ போன்ற உள்ளமைக்கப்பட்ட செயல்முறைகளின் விலையையும், எங்கள் சொந்த ச்கிரிப்டிங் செயல்பாடுகளின் விலையையும் கீழே பார்க்கலாம்.
zh_tw: 我們可以看到內建流程（像是物理和音訊）的耗時，也能在下方看到自訂腳本函式的耗時。

source: Time spent waiting for various built-in servers may not be counted in the profilers. This is a known bug.
ga: Ní féidir an t-am a chaitear ag fanacht le freastalaithe ionsuite éagsúla a chomhaireamh sna próifílí. Is fabht aitheanta é seo.
ja: さまざまな組み込みサーバーの待機に費やされた時間は、プロファイラーではカウントされない可能性があります。これは既知のバグです。
ru: Время ожидания различных встроенных серверов может не учитываться в профилировщиках. Это известная ошибка.
ta: பல்வேறு உள்ளமைக்கப்பட்ட சேவையகங்களுக்காக காத்திருக்கும் நேரம் விவரக்குறிப்பாளர்களில் கணக்கிடப்படாது. இது அறியப்பட்ட பிழை.
zh_tw: 等候各種內建伺服器的時間可能不會被剖析器計算在內。這是已知的 bug。

source: When a project is running slowly, you will often see an obvious function or process taking a lot more time than others. This is your primary bottleneck, and you can usually increase speed by optimizing this area.
ga: Nuair a bhíonn tionscadal ag rith go mall, is minic a fheicfidh tú feidhm nó próiseas soiléir ag glacadh i bhfad níos mó ama ná a chéile. Is é seo do phríomh-scagal, agus de ghnáth is féidir leat luas a mhéadú tríd an réimse seo a bharrfheabhsú.
ja: プロジェクトの実行速度が遅い場合、他の機能やプロセスよりも明らかに多くの時間がかかっていることがわかります。これが主なボトルネックであり、通常はこの領域を最適化することで速度を上げることができます。
ru: Когда проект выполняется медленно, вы часто замечаете, что какая-то очевидная функция или процесс занимает гораздо больше времени, чем другие. Это ваше основное узкое место, и обычно можно повысить скорость, оптимизировав эту область.
ta: ஒரு திட்டம் மெதுவாக இயங்கும்போது, ஒரு வெளிப்படையான செயல்பாடு அல்லது செயல்முறையை மற்றவர்களை விட அதிக நேரம் எடுப்பதை நீங்கள் அடிக்கடி காண்பீர்கள். இது உங்கள் முதன்மை இடையூறாகும், மேலும் இந்த பகுதியை மேம்படுத்துவதன் மூலம் நீங்கள் வழக்கமாக வேகத்தை அதிகரிக்கலாம்.
zh_tw: 當專案執行緩慢時，通常會看到某個明顯的函式或流程用時遠高於其他部分。這就是你的主要瓶頸，通常只要優化這個區段，就能明顯提升效能。

source: For more info about using Godot's built-in profiler, see :ref:`doc_debugger_panel`.
ga: Le haghaidh tuilleadh faisnéise faoi phróifíleoir ionsuite Godot a úsáid, féach:ref: `doc_debugger_panel`.
ja: Godot の組み込みプロファイラーの詳細な使用方法については、 :ref:`doc_debugger_panel` を参照してください。
ko: Godot의 내장 프로파일러 사용에 대한 자세한 정보는 ::ref:`doc_debugger_panel`\ 을 참조하세요.
pt_br: Para mais informações sobre como usar o analisador de perfis embutido do Godot, veja :ref:`doc_debugger_panel`.
ru: Дополнительную информацию об использовании встроенного профилировщика Godot см. в разделе :ref:`doc_debugger_panel`.
ta: கோடோட்டின் உள்ளமைக்கப்பட்ட சுயவிவரத்தைப் பயன்படுத்துவது பற்றிய கூடுதல் தகவலுக்கு, காண்க: குறிப்பு: `doc_debugger_panel`.
zh_tw: 更多關於 Godot 內建剖析器的資訊，請參考 :ref:`doc_debugger_panel`。

source: External profilers
ga: Próifílí seachtracha
ja: 外部のプロファイラー
ko: 외부 프로파일러
pt_br: Perfiladores externos
ru: Внешние профилировщики (profilers)
ta: வெளிப்புற விவரக்குறிப்புகள்
zh_tw: 外部剖析器

source: Although the Godot IDE profiler is very convenient and useful, sometimes you need more power, and the ability to profile the Godot engine source code itself.
ga: Cé go bhfuil próifíleoir Godot IDE an-áisiúil agus úsáideach, uaireanta teastaíonn níos mó cumhachta uait, agus an cumas cód foinse inneall Godot féin a phróifílú.
ja: Godot IDE プロファイラーは非常に便利で役立ちますが、場合によっては、より強力なプロファイラー機能や、Godot エンジン自体をプロファイリングすることが必要になることがあります。
ru: Хотя профилировщик Godot IDE очень удобен и полезен, иногда вам требуется больше мощности и возможность профилировать сам исходный код движка Godot.
ta: கோடோட் ஐடிஇ விவரக்குறிப்பு மிகவும் வசதியானது மற்றும் பயனுள்ளதாக இருந்தாலும், சில நேரங்களில் உங்களுக்கு அதிக ஆற்றல் தேவை, மேலும் கோடோட் என்சின் மூலக் குறியீட்டை சுயவிவரப்படுத்தும் திறன்.
zh_tw: 雖然 Godot 編輯器內建的剖析器非常方便實用，但有時候你可能需要更強大的功能，例如針對 Godot 引擎本身的原始碼進行剖析。

source: You can :ref:`use a number of third-party C++ profilers <doc_using_cpp_profilers>` to do this.
ga: Is féidir leat :ref: `líon próifíleoirí C++ tríú páirtí <doc_using_cpp_profilers>` a úsáid chun é seo a dhéanamh.
ja: これを行うには、いくつかの :ref:`サードパーティ製 C++ プロファイラー <doc_using_cpp_profilers>` を使用できます。
ru: Для этого можно :ref:`use a number of third-party C++ profilers <doc_using_cpp_profilers>` (использовать ряд сторонних профилировщиков C++).
ta: உங்களால் முடியும்: ref: `இதைச் செய்ய பல மூன்றாம் தரப்பு சி ++ சுயவிவரங்களை <doc_using_cpp_profilers> ஐப் பயன்படுத்தவும்.
zh_tw: 你可以 :ref:`使用多款第三方 C++ 剖析器 <doc_using_cpp_profilers>` 來達成這個目的。

source: Screenshot of Callgrind
ga: Scáileán de Callgrind
ja: Callgrindのスクリーンショット
ko: Callgrind의 스크린샷
ru: Скриншот Callgrind
ta: கால் கிரைண்டின் திரை காட்சி
zh_tw: Callgrind 截圖

source: Example results from Callgrind, which is part of Valgrind.
ga: Torthaí samplaí ó Callgrind, atá mar chuid de Valgrind.
ja: Valgrind の一部である Callgrind の結果。
ru: Примеры результатов Callgrind, который является частью Valgrind.
ta: வல்கிரைண்டின் ஒரு பகுதியாக இருக்கும் கால் கிரைண்டின் எடுத்துக்காட்டு முடிவுகள்.
zh_tw: 這是 Valgrind 套件中 Callgrind 的剖析結果範例。

source: From the left, Callgrind is listing the percentage of time within a function and its children (Inclusive), the percentage of time spent within the function itself, excluding child functions (Self), the number of times the function is called, the function name, and the file or module.
ga: Ón taobh clé, tá Callgrind ag liostú céatadán ama laistigh de fheidhm agus a leanaí (Cuimsitheach), céatadán an ama a chaitear laistigh den fheidhm féin, gan feidhmeanna leanaí a áireamh (Féin), líon uaireanta a thugtar ar an bhfeidhm, ainm na feidhme, agus an comhad nó an modúl.
ja: Callgrind は、左から関数とその子関数内の時間の割合 (Inclusive)、子関数を除いた関数自体内で費やされた時間の割合 (Self)、関数が呼び出された回数、関数名、ファイルまたはモジュールを表示します。
ru: Слева направо Callgrind выводит процент времени, проведенного внутри функции и ее дочерних функций (включительно), процент времени, проведенного внутри самой функции, без учета дочерних функций (Self), количество вызовов функции, имя функции и файл или модуль.
ta: இடதுபுறத்தில் இருந்து, கால் கிரைண்ட் ஒரு செயல்பாட்டிற்குள் நேரத்தின் சதவீதத்தையும் அதன் குழந்தைகளையும் (உள்ளடக்கிய) பட்டியலிடுகிறது, செயல்பாட்டிற்குள் செலவழித்த நேரத்தின் விழுக்காடு, குழந்தை செயல்பாடுகளை (சுய) தவிர்த்து, செயல்பாடு எத்தனை முறை அழைக்கப்படுகிறது, செயல்பாட்டு பெயர் , மற்றும் கோப்பு அல்லது தொகுதி.
zh_tw: 從左至右，Callgrind 依序列出函式本身及其子函式執行時間比例（Inclusive），僅函式本身執行時間比例（Self），呼叫次數，函式名稱，以及所在檔案或模組。

source: In this example, we can see nearly all time is spent under the ``Main::iteration()`` function. This is the master function in the Godot source code that is called repeatedly. It causes frames to be drawn, physics ticks to be simulated, and nodes and scripts to be updated. A large proportion of the time is spent in the functions to render a canvas (66%), because this example uses a 2D benchmark. Below this, we see that almost 50% of the time is spent outside Godot code in ``libglapi`` and ``i965_dri`` (the graphics driver). This tells us the a large proportion of CPU time is being spent in the graphics driver.
ga: Sa sampla seo, is féidir linn a fheiceáil go gcaithfear beagnach gach am faoin bhfeidhm ``Main: :iteration () ``. Is é seo an máistirfheidhm sa chód foinse Godot ar a dtugtar arís agus arís eile. Cuireann sé faoi deara frámaí a tharraingt, tiocanna fisice a insamhaladh, agus nóid agus scripteanna a nuashonrú. Caitear cuid mhór den am sna feidhmeanna chun canbhás a rinneadh (66%), toisc go n-úsáideann an sampla seo tagarmharc 2D. Faoi seo, feicimid go gcaithtear beagnach 50% den am lasmuigh de chód Godot i `libglapi`` agus ``i965_dri`` (an tiománaí grafaicí). Insíonn sé seo dúinn go bhfuil cion mór d'am LAP á chaitheamh sa tiománaí grafaicí.
ja: この例では、ほぼすべての時間が ``Main::iteration()`` 関数で費やされていることがわかります。これは Godot ソースコード内で繰り返し呼び出されるマスター関数です。この関数はフレームの描画、物理ティックのシミュレート、ノードとスクリプトを更新を行います。この例では 2D ベンチマークを使用しているため、時間の大部分 (66%) はキャンバスをレンダリングする関数に費やされています。その下には、時間のほぼ 50% が ``libglapi`` と ``i965_dri`` (グラフィックス ドライバー) といった、 Godot コード外で費やされていることがわかります。これは CPU 時間の大部分がグラフィックスドライバーに費やされていることを示しています。
ru: В этом примере мы видим, что почти всё время тратится на функцию ``Main::iteration()``. Это главная функция в исходном коде Godot, которая вызывается многократно. Она отвечает за отрисовку кадров, моделирование физических тиков, а также обновление узлов и скриптов. Значительная часть времени тратится на функции рендеринга холста (66%), поскольку в этом примере используется 2D-бенчмарк. Ниже мы видим, что почти 50% времени тратится вне кода Godot в ``libglapi`` и ``i965_dri`` (графическом драйвере). Это говорит о том, что значительная доля процессорного времени тратится на графический драйвер.
ta: இந்த எடுத்துக்காட்டில், கிட்டத்தட்ட எல்லா நேரமும் `` மெயின் :: மறு செய்கை () `` செயல்பாட்டின் கீழ் செலவிடப்படுவதைக் காணலாம். இது கோடோட் மூலக் குறியீட்டில் உள்ள முதன்மை செயல்பாடு, இது மீண்டும் மீண்டும் அழைக்கப்படுகிறது. இது பிரேம்களை வரையவும், இயற்பியல் உண்ணி உருவகப்படுத்தப்படவும், முனைகள் மற்றும் ச்கிரிப்ட்கள் புதுப்பிக்கப்படவும் காரணமாகிறது. கேன்வாசை (66%) வழங்குவதற்கான செயல்பாடுகளில் அதிக நேரம் செலவிடப்படுகிறது, ஏனெனில் இந்த எடுத்துக்காட்டு 2 டி அளவுகோலைப் பயன்படுத்துகிறது. இதற்குக் கீழே, கிட்டத்தட்ட 50% நேரம் கோடோட் குறியீட்டிற்கு வெளியே `` லிப்க்ளாபி`` மற்றும் `` i965_dri`` (கிராபிக்ச் டிரைவர்) ஆகியவற்றில் செலவிடப்படுவதைக் காண்கிறோம். கிராபிக்ச் டிரைவரில் சிபியு நேரத்தின் பெரும்பகுதி செலவிடப்படுவதாக இது நமக்குக் கூறுகிறது.
zh_tw: 在這個例子中，我們可以看到幾乎所有時間都耗在 ``Main::iteration()`` 這個函式下。這是 Godot 原始碼裡會反覆呼叫的主迴圈函式，負責觸發影格繪製、物理模擬、節點與腳本的更新。本例因為是 2D 基準測試，有 66% 的時間花在畫布算繪相關函式。再往下看，近 50% 的時間花在 Godot 以外的 ``libglapi`` 與 ``i965_dri`` （顯示卡驅動）。這顯示出大量 CPU 時間都消耗在圖形驅動上。

source: This is actually an excellent example because, in an ideal world, only a very small proportion of time would be spent in the graphics driver. This is an indication that there is a problem with too much communication and work being done in the graphics API. This specific profiling led to the development of 2D batching, which greatly speeds up 2D rendering by reducing bottlenecks in this area.
ga: Is sampla den scoth é seo i ndáiríre mar, i saol idéalach, ní chaithfeadh ach cion an-bheag ama sa tiománaí grafaicí. Is léiriú é seo go bhfuil fadhb ann leis an iomarca cumarsáide agus oibre á dhéanamh san API grafaicí. Mar thoradh ar an bpróifíliú sonrach seo forbraíodh baisceáil 2D, a chuireann luasghluasú go mór le rindreáil 2D trí strugaill sa réimse seo a laghdú.
ja: これは興味深い事例です。グラフィックスドライバーに費やされる時間は最小にするのが理想的です。これはグラフィックスAPIで行われる通信や作業が多すぎるという問題があることを示しています。この具体的なプロファイリングが、2Dバッチングの開発につながりました。この分野のボトルネックを減らすことで、2Dレンダリングが大幅に高速化されます。
ru: На самом деле, это отличный пример, поскольку в идеальном мире лишь очень малая часть времени тратилась бы на графический драйвер. Это указывает на проблему, связанную со слишком большим объемом обмена данными и работы в графическом API. Именно такое профилирование привело к разработке 2D-батчинга, который значительно ускоряет 2D-рендеринг, устраняя узкие места в этой области.
ta: இது உண்மையில் ஒரு சிறந்த எடுத்துக்காட்டு, ஏனென்றால், ஒரு சிறந்த உலகில், கிராபிக்ச் டிரைவரில் மிகச் சிறிய நேரம் மட்டுமே செலவிடப்படும். கிராபிக்ச் ஏபிஐயில் அதிக தொடர்பு மற்றும் பணிகள் செய்யப்படுவதில் சிக்கல் உள்ளது என்பதற்கான அறிகுறியாகும். இந்த குறிப்பிட்ட விவரக்குறிப்பு 2 டி பேட்சிங்கின் வளர்ச்சிக்கு வழிவகுத்தது, இது இந்த பகுதியில் உள்ள இடையூறுகளை குறைப்பதன் மூலம் 2 டி ரெண்டரிங்கை பெரிதும் விரைவுபடுத்துகிறது.
zh_tw: 這其實是很好的案例，因為理論上，圖形驅動理應占用極少比例的 CPU 時間。這表示圖形 API 存在過多資料傳遞與工作負擔。這次剖析實驗促成 2D 批次處理技術的誕生，大幅減少該區段瓶頸，進而提升 2D 算繪效能。

source: Manually timing functions
ga: Feidhmeanna ama de láimh
ja: タイム関数で実行時間を測定する
ko: 수동으로 함수 타이밍 측정
pt_br: Funções de temporização manual
ru: Функции ручного хронометража
ta: கைமுறையாக நேர செயல்பாடுகள்
zh_tw: 手動量測函式效能

source: Another handy technique, especially once you have identified the bottleneck using a profiler, is to manually time the function or area under test. The specifics vary depending on the language, but in GDScript, you would do the following:
ga: Teicníc áisiúil eile, go háirithe nuair a shainaithníonn tú an scagal ag baint úsáide as próifíleoir, is ea an fheidhm nó an limistéar atá faoi thástáil a chur in am Athraíonn na sonraíochtaí ag brath ar an teanga, ach i GDScript, déanfá an méid seo a leanas:
ja: プロファイラーを使用してボトルネックを特定した後は、テスト対象の関数またはコードの実行時間を手動で測定するという便利なテクニックもあります。具体的な方法は言語によって異なりますが、GDScript では次の操作を行います。
ru: Ещё один удобный метод, особенно после того, как вы определили узкое место с помощью профилировщика, — это вручную замерить время выполнения тестируемой функции или области. Конкретные действия различаются в зависимости от языка, но в GDScript это можно сделать следующим образом:
ta: மற்றொரு எளிமையான நுட்பம், குறிப்பாக நீங்கள் ஒரு சுயவிவரத்தைப் பயன்படுத்தி இடையூறுகளை அடையாளம் கண்டவுடன், சோதனையின் கீழ் செயல்பாடு அல்லது பகுதியை கைமுறையாக நேரம் ஒதுக்குவது. பிரத்தியேகங்கள் மொழியைப் பொறுத்து வேறுபடுகின்றன, ஆனால் சி.டி.எச்ச்கிரிப்டில், நீங்கள் பின்வருவனவற்றை செய்வீர்கள்:
zh_tw: 另一個實用技巧，尤其是在你用剖析器找出瓶頸後，就是手動量測特定函式或區段的執行時間。做法會依語言而異，在 GDScript 中你可以這樣做：

source: When manually timing functions, it is usually a good idea to run the function many times (1,000 or more times), instead of just once (unless it is a very slow function). The reason for doing this is that timers often have limited accuracy. Moreover, CPUs will schedule processes in a haphazard manner. Therefore, an average over a series of runs is more accurate than a single measurement.
ga: Nuair a bhíonn feidhmeanna uainithe de láimh ann, is gnách gur smaoineamh maith é an fheidhm a reáchtáil arís agus arís eile (1,000 uair nó níos mó), in ionad uair amháin (mura bhfuil feidhm an-mhall í). Is é an chúis atá leis seo a dhéanamh ná go mbíonn cruinneas teoranta ag amanna go minic. Thairis sin, sceidealfaidh CPUanna próisis ar bhealach neamhdhíobhálach. Dá bhrí sin, tá meán thar shraith rith níos cruinne ná tomhas amháin.
ja: 関数の時間を手動で計測する場合、通常は関数を 1 回だけではなく、何度も (1,000 回以上) 実行することをお勧めします (非常に遅い関数の場合を除く)。これを行う理由はタイマーの精度が限られていることが多く。さらに CPU はプロセスを無計画にスケジュールするため結果がぶれることが多いためです。一連の実行の平均を取ることで、 1 回だけ測定するよりも正確になります。
ru: При ручном синхронизации (timing ) функций обычно рекомендуется запускать функцию многократно (1000 или более раз), а не один раз (если только функция не очень медленная). Это обусловлено тем, что таймеры часто имеют ограниченную точность. Более того, процессоры планируют процессы хаотично. Поэтому среднее значение по серии запусков точнее, чем единичное измерение.
ta: கைமுறையாக நேர செயல்பாடுகளாக இருக்கும்போது, வழக்கமாக செயல்பாட்டை பல முறை (1,000 அல்லது அதற்கு மேற்பட்ட முறை) இயக்குவது நல்லது, ஒரு முறை (இது மிகவும் மெதுவான செயல்பாடாக இல்லாவிட்டால்). இதைச் செய்வதற்கான காரணம் என்னவென்றால், டைமர்கள் பெரும்பாலும் மட்டுப்படுத்தப்பட்ட துல்லியத்தைக் கொண்டுள்ளன. மேலும், சிபியு கள் செயல்முறைகளை ஒரு இடையூறாக திட்டமிடும். ஆகையால், தொடர்ச்சியான ரன்களில் சராசரியாக ஒரு அளவீட்டை விட துல்லியமானது.
zh_tw: 手動量測函式時，建議將函式重複執行多次（例如 1,000 次以上），而非只測一次（除非該函式極慢）。這是因為計時器精度有限，而且 CPU 行程排程具有隨機性。因此，取多次平均值會比單次結果準確許多。

source: As you attempt to optimize functions, be sure to either repeatedly profile or time them as you go. This will give you crucial feedback as to whether the optimization is working (or not).
ga: Agus tú ag iarraidh feidhmeanna a bharrfheabhsú, bí cinnte próifíl a dhéanamh arís agus arís eile nó iad a chur in am agus tú ag dul Tabharfaidh sé seo aiseolas ríthábhachtach duit maidir le cibé an bhfuil an barrfheabhsú ag obair (nó nach bhfuil).
ja: 関数の最適化を試みる際には、必ず繰り返しプロファイリングするか、実行中に時間を計ってください。これにより、最適化が機能しているかどうかに関する重要なフィードバックが得られます。
ru: При оптимизации функций обязательно регулярно профилируйте их или засекайте время выполнения. Это даст вам важную обратную связь относительно того, работает ли оптимизация (или нет).
ta: செயல்பாடுகளை மேம்படுத்த நீங்கள் முயற்சிக்கும்போது, நீங்கள் செல்லும்போது மீண்டும் மீண்டும் சுயவிவரமாகவோ அல்லது நேரம் செய்யவோ மறக்காதீர்கள். தேர்வுமுறை செயல்படுகிறதா (அல்லது இல்லை) என்பதற்கு இது உங்களுக்கு முக்கியமான கருத்துக்களை வழங்கும்.
zh_tw: 試圖優化函式時，務必反覆進行剖析或量測，才能獲得關鍵回饋，了解優化是否真的奏效。

source: Caches
ga: Cáistí
ja: CPUキャッシュ
ko: 캐시
ru: Кэши
ta: தற்காலிக சேமிப்புகள்
zh_tw: 快取（Cache）
