Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/general_optimization.po
Languages: ga, it, ja, pt_br, ta, zh_hant

source: Once you know which of the two halves contains the bottleneck, you can repeat this process until you've pinned down the problematic area.
ga: Nuair a bheidh a fhios agat cé acu den dá leath ina bhfuil an scagal, is féidir leat an próiseas seo a athdhéanamh go dtí go mbeidh an limistéar fadhbanna curtha agat síos.
it: Una volta individuata la metà che contiene il collo di bottiglia, è possibile ripetere questo processo finché non si è individuata l'area problematica.
ja: どちらの半分にボトルネックがあるかがわかったら、問題のあるルーチンを特定するまでこのプロセスを繰り返します。
ta: இரண்டு பகுதிகளில் எது இடையூறு உள்ளது என்பதை நீங்கள் அறிந்தவுடன், நீங்கள் சிக்கலான பகுதியை பின்னுக்குத் தள்ளும் வரை இந்த செயல்முறையை மீண்டும் செய்யலாம்.
zh_hant: 一旦知道是哪一半有瓶頸，再繼續對該部分重複此步驟，直到確定是哪裡出了問題。

source: Profilers
ga: Próifílí
it: Profiler
ja: プロファイラー
pt_br: Profilador
ta: சுயவிவரங்கள்
zh_hant: 效能分析工具

source: Profilers allow you to time your program while running it. Profilers then provide results telling you what percentage of time was spent in different functions and areas, and how often functions were called.
ga: Ligeann próifílí duit do chlár a amú agus é á rith. Soláthraíonn próifílí ansin torthaí a insíonn duit cén céatadán ama a caitheadh ar fheidhmeanna agus réimsí éagsúla, agus cé chomh minic a glaodh feidhmeanna.
ja: プロファイラーを使用すると、プログラムの実行時間を計測できます。プロファイラーはさまざまな関数やルーチンに費やされた時間の割合や、関数が呼び出された頻度を示す結果を提供します。
ta: உங்கள் நிரலை இயக்கும் போது அதை நேரத்திற்கு விவரக்குறிப்புகள் அனுமதிக்கின்றன. வெவ்வேறு செயல்பாடுகளிலும் பகுதிகளிலும் என்ன நேரம் செலவிடப்பட்டது, மற்றும் எவ்வளவு அடிக்கடி செயல்பாடுகள் அழைக்கப்படுகின்றன என்பதைச் சொல்லும் முடிவுகளை விவரக்குறிப்புகள் உங்களுக்கு வழங்குகின்றன.
zh_hant: 效能分析工具（Profiler）可以在程式執行時記錄各區塊的耗時，並統計每個函式或模組佔用的時間百分比，以及函式被呼叫的次數。

source: This can be very useful both to identify bottlenecks and to measure the results of your improvements. Sometimes, attempts to improve performance can backfire and lead to slower performance. **Always use profiling and timing to guide your efforts.**
ga: D'fhéadfadh sé seo a bheith an-úsáideach chun stragaill a aithint agus chun torthaí do chuid feabhsúcháin a thomhas. Uaireanta, is féidir le hiarrachtaí chun feidhmíocht a fheabhsú cúl a dhéanamh agus feidhmíocht níos moille ** Úsáid próifíliú agus uainiú i gcónaí chun d'iarrachtaí a threor **
ja: これはボトルネックを特定し、改善の結果を測定するのに非常に役立ちます。パフォーマンスを改善しようとすると、裏目に出てパフォーマンスが低下することがあります。 **常にプロファイリングとタイミングを使用してあなたの取り組みを導いてください。**
ta: இடையூறுகளை அடையாளம் காணவும், உங்கள் மேம்பாடுகளின் முடிவுகளை அளவிடவும் இது மிகவும் பயனுள்ளதாக இருக்கும். சில நேரங்களில், செயல்திறனை மேம்படுத்துவதற்கான முயற்சிகள் பின்வாங்கி மெதுவான செயல்திறனுக்கு வழிவகுக்கும். ** உங்கள் முயற்சிகளுக்கு வழிகாட்ட எப்போதும் விவரக்குறிப்பு மற்றும் நேரத்தைப் பயன்படுத்துங்கள். **
zh_hant: 這對找出瓶頸、量測改善效果都很有幫助。有時候優化反而讓效能變差，**所以務必要用效能分析和計時來指引你的優化方向。**

source: For more info about using Godot's built-in profiler, see :ref:`doc_the_profiler`.
ga: Le haghaidh tuilleadh faisnéise faoi phróifíleoir ionsuite Godot a úsáid, féach:ref: `doc_the_profiler`.
it: Per ulteriori informazioni su come utilizzare il profiler integrato di Godot, consultare :ref:`doc_the_profiler`.
ja: Godot の組み込みプロファイラーの使用に関する詳細については :ref:`doc_the_profiler` を参照してください。
ta: கோடோட்டின் உள்ளமைக்கப்பட்ட சுயவிவரத்தைப் பயன்படுத்துவது பற்றிய கூடுதல் தகவலுக்கு, பார்க்க: குறிப்பு: `doc_the_profiler`.
zh_hant: 有關使用 Godot 內建分析器的更多資訊，請參考 :ref:`doc_the_profiler`。

source: Principles
ga: Prionsabail
it: Principi
ja: 最適化の原則
pt_br: Princípios
ta: கோட்பாடுகள்
zh_hant: 原則

source: `Donald Knuth <https://en.wikipedia.org/wiki/Donald_Knuth>`__ said:
ga: Dúirt `Donald Knuth <https://en.wikipedia.org/wiki/Donald_Knuth>`__:
it: `Donald Knuth <https://en.wikipedia.org/wiki/Donald_Knuth>`__ ha detto:
ja: `Donald Knuth <https://en.wikipedia.org/wiki/Donald_Knuth>`__ 曰く:
pt_br: `Donald Knuth <https://en.wikipedia.org/wiki/Donald_Knuth>`__ disse:
ta: `டொனால்ட் நுத் <https://en.wikipedia.org/wiki/donald_knuth>` __ என்றார்:
zh_hant: `Donald Knuth <https://zh.wikipedia.org/wiki/%E9%AB%98%E5%BE%B7%E7%BA%B3>`__ 說：

source: *Programmers waste enormous amounts of time thinking about, or worrying about, the speed of noncritical parts of their programs, and these attempts at efficiency actually have a strong negative impact when debugging and maintenance are considered. We should forget about small efficiencies, say about 97% of the time: premature optimization is the root of all evil. Yet we should not pass up our opportunities in that critical 3%.*
ga: * Cuireann ríomhchláraitheoirí méideanna ollmhóra ama ag smaoineamh ar luas codanna neamhchriticiúla dá gcláir, nó ag imní ort, agus bíonn tionchar diúltach láidir ag na hiarrachtaí seo ar éifeachtúlacht i ndáiríre nuair a bhreithnítear dífhabhtú Ba chóir dúinn dearmad a dhéanamh faoi éifeachtúlachtaí beaga, abair thart ar 97% den am: is é barrfheabhsú roimh am fréamh gach olc. Ach níor cheart dúinn ár ndeiseanna a chur suas sa 3% criticiúil sin . *
it: *I programmatori sprecano enormi quantità di tempo a pensare, o a preoccuparsi, della velocità di parti non critiche dei loro programmi, e questi tentativi di efficienza hanno in realtà un forte impatto negativo quando si considerano il debug e la manutenzione. Dovremmo dimenticare le piccole efficienze, diciamo nel 97% dei casi: l'ottimizzazione prematura è la radice di tutti i mali. Eppure non dovremmo lasciarci sfuggire le opportunità in quel 3% critico.*
ja: *プログラマーはプログラムの重要でない部分の速度について考えたり心配したりすることに膨大な時間を費やしています。そして、こうした効率化の試みは、デバッグやメンテナンスを考慮すると、実際には大きなマイナスの影響を及ぼします。私たちはたとえば 97% の時間、小さな効率化については忘れるべきです。早まった最適化は諸悪の根源です。しかし、その重要な 3% の機会を逃すべきではありません。*
pt_br: *Os programadores perdem muito tempo pensando ou se preocupando com a velocidade de partes não críticas de seus programas, e essas tentativas de eficiência, na verdade, têm um forte impacto negativo quando a depuração e a manutenção são consideradas. Devemos esquecer as pequenas eficiências, digamos, em cerca de 97% das vezes: a otimização prematura é a raiz de todos os males. No entanto, não devemos deixar passar nossas oportunidades nesses 3% críticos.*
ta: *புரோகிராமர்கள் தங்கள் திட்டங்களின் விமர்சனமற்ற பகுதிகளின் வேகத்தைப் பற்றி சிந்திக்கவோ அல்லது கவலைப்படவோ மகத்தான நேரத்தை வீணாக்குகிறார்கள், மேலும் செயல்திறனுக்கான இந்த முயற்சிகள் உண்மையில் பிழைத்திருத்தம் மற்றும் பராமரிப்பு எனக் கருதப்படும்போது வலுவான எதிர்மறையான தாக்கத்தை ஏற்படுத்துகின்றன. சிறிய செயல்திறனைப் பற்றி நாம் மறந்துவிட வேண்டும், 97% நேரம் சொல்லுங்கள்: முன்கூட்டிய தேர்வுமுறை என்பது எல்லா தீமைகளின் மூலமாகும். ஆயினும்கூட அந்த முக்கியமான 3%இல் நம்முடைய வாய்ப்புகளை நாம் கடந்து செல்லக்கூடாது.*
zh_hant: *程式設計師花了大量時間去思考或擔心程式中非關鍵部分的效能，但這些效率上的嘗試，事實上在除錯和維護時反而帶來負面影響。我們應該忘掉那些微小的效能提升，也就是約 97% 的情況：過早的最佳化是萬惡之源。但對於那關鍵的 3%，我們不能錯過機會。*

source: The messages are very important:
ga: Tá na teachtaireachtaí an-tábhachtach:
it: I messaggi sono molto importanti:
ja: このメッセージは非常に重要です:
pt_br: As mensagens são muito importantes:
ta: செய்திகள் மிகவும் முக்கியம்:
zh_hant: 這些訊息非常重要：

source: Developer time is limited. Instead of blindly trying to speed up all aspects of a program, we should concentrate our efforts on the aspects that really matter.
ga: Tá am an fhorbróra teoranta. In ionad iarracht go dall gach gné de chlár a bhrostú, ba cheart dúinn ár n-iarrachtaí a dhíriú ar na gnéithe atá tábhachtach i ndáiríre.
it: Il tempo a disposizione degli sviluppatori è limitato. Invece di cercare ciecamente di velocizzare tutti gli aspetti di un programma, dovremmo concentrare i nostri sforzi sugli aspetti che contano davvero.
ja: 開発者の時間は限られています。盲目的にプログラムのすべての側面を高速化しようとするのではなく、本当に重要な側面に集中して取り組む必要があります。
pt_br: O tempo do desenvolvedor é limitado. Em vez de tentar cegamente acelerar todos os aspectos de um programa, devemos concentrar nossos esforços nos aspectos que realmente importam.
ta: உருவாக்குபவர் நேரம் குறைவாக உள்ளது. ஒரு திட்டத்தின் அனைத்து அம்சங்களையும் விரைவுபடுத்த முயற்சிப்பதற்குப் பதிலாக, எங்கள் முயற்சிகளை உண்மையிலேயே முக்கியமான அம்சங்களில் கவனம் செலுத்த வேண்டும்.
zh_hant: 開發時間有限，與其盲目優化所有環節，不如將心力集中在真正重要的部分。

source: Efforts at optimization often end up with code that is harder to read and debug than non-optimized code. It is in our interests to limit this to areas that will really benefit.
ga: Is minic a bhíonn cód níos deacra a léamh agus a dhífhabhtú ná cód neamh-optamaithe a chríochnaíonn iarrachtaí maidir le barr Tá sé ar mhaithe againn é seo a theorannú do réimsí a rachaidh tairbhe i ndáiríre.
it: Gli sforzi di ottimizzazione spesso finiscono per produrre codice più difficile da leggere e correggere rispetto al codice non ottimizzato. È nel nostro interesse limitare questi sforzi alle aree che ne trarranno realmente beneficio.
ja: 最適化の取り組みにより、最適化されていないコードよりも読みにくくデバッグしにくいコードになってしまうことがよくあります。これを本当にメリットのある領域に限定することが、チームの利益になります。
pt_br: Os esforços de otimização geralmente acabam com código mais difícil de ler e depurar do que o código não otimizado. É do nosso interesse limitar esta situação a áreas que irão realmente beneficiar.
ta: உகப்பாக்கத்தின் முயற்சிகள் பெரும்பாலும் உகந்ததாக இல்லாத குறியீட்டை விட படிக்கவும் பிழைத்திருத்தமாகவும் இருக்கும் குறியீட்டைக் கொண்டு முடிவடையும். இதை உண்மையில் பயனளிக்கும் பகுதிகளுக்கு மட்டுப்படுத்துவது எங்கள் நலன்களுக்காகவே உள்ளது.
zh_hant: 許多優化反而讓程式碼難以閱讀和除錯。我們應該只在真正有顯著效益的地方進行這些犧牲。

source: Just because we *can* optimize a particular bit of code, it doesn't necessarily mean that we *should*. Knowing when and when not to optimize is a great skill to develop.
ga: Díreach toisc gur féidir linn * beagán áirithe cód a bharrfheabhsú, ní gá go gciallaíonn sé gur chóir dúinn*. Is scil iontach é a fhorbairt a fháil amach cathain agus cathain gan a bharrfheabhsú.
it: Soltanto perché *possiamo* ottimizzare una particolare porzione di codice, non significa necessariamente che *dobbiamo* farlo. Sapere quando ottimizzare e quando no è un'abilità fondamentale da sviluppare.
ja: 特定のコード部分を最適化できるからといって、必ずしも最適化すべきというわけではありません。いつ最適化すべきでいつ最適化すべきでないかを知ることは、習得すべき素晴らしいスキルです。
pt_br: Só porque nós *podemos* otimizar um determinado pedaço de código, isso não significa necessariamente que *devemos*. Saber quando e quando não otimizar é uma grande habilidade a ser desenvolvida.
ta: ஒரு குறிப்பிட்ட பிட் குறியீட்டை நாம் *மேம்படுத்த முடியும் என்பதால், நாம் *வேண்டும் *வேண்டும் என்று அர்த்தமல்ல. எப்போது, எப்போது மேம்படுத்தக்கூடாது என்பதை அறிவது ஒரு சிறந்த திறமையாகும்.
zh_hant: 不是因為我們 *能* 優化某段程式碼，就一定 *應該* 去優化。知道什麼時候該優化、什麼時候不該動，這是一項很重要的能力。

source: One misleading aspect of the quote is that people tend to focus on the subquote *"premature optimization is the root of all evil"*. While *premature* optimization is (by definition) undesirable, performant software is the result of performant design.
ga: Gné míthreorach amháin den luachan ná go mbíonn claonadh ag daoine díriú ar an bhfo-luachan* “Is é barrfheabhsú roimh ré fréamh gach olch"*. Cé go bhfuil barrfheabhsú roimh ré (de réir sainmhínithe) inmhianaithe, is toradh ar dhearadh feidhmíochta iad bogearraí feidhmíochta.
it: Un aspetto ingannoso della citazione è che le persone tendono a concentrarsi sulla sotto-citazione *"l'ottimizzazione prematura è la radice di tutti i mali"*. Mentre l'ottimizzazione *prematura* è (per definizione) indesiderabile, un software performante è il risultato di una progettazione performante.
ja: この引用文で誤解を招く点の 1 つは、人々がサブ引用文の「時期尚早な最適化は諸悪の根源である」に注目する傾向があることです。時期尚早な最適化は (定義上) 望ましくありませんが、パフォーマンスの高いソフトウェアはパフォーマンスの高い設計から生まれます。
pt_br: Um aspecto enganoso da citação é que as pessoas tendem a se concentrar na subcitação *"otimização prematura é a raiz de todo o mal"*. Enquanto a otimização *prematura* é (por definição) indesejável, o software de desempenho é o resultado de um design eficiente.
ta: மேற்கோளின் ஒரு தவறான நற்பொருத்தம் என்னவென்றால், மக்கள் துணைக்கு கவனம் செலுத்துகிறார்கள் *"முன்கூட்டிய தேர்வுமுறை என்பது அனைத்து தீமைகளின் மூலமாகும்" *. * முன்கூட்டிய * தேர்வுமுறை (வரையறையின்படி) விரும்பத்தகாதது என்றாலும், செயல்திறன் கொண்ட மென்பொருள் செயல்திறன் வடிவமைப்பின் விளைவாகும்.
zh_hant: 這段話常被誤解，人們容易只記得「過早的最佳化是萬惡之源」這句。雖然 *過早* 的最佳化確實不可取，但高效能軟體其實來自於一開始就有高效能的設計。

source: Performant design
ga: Dearadh feidhmiúil
it: Design performante
ja: パフォーマンスの高い設計
pt_br: Design de desempenho
ta: செயல்திறன் வடிவமைப்பு
zh_hant: 高效能設計

source: The danger with encouraging people to ignore optimization until necessary, is that it conveniently ignores that the most important time to consider performance is at the design stage, before a key has even hit a keyboard. If the design or algorithms of a program are inefficient, then no amount of polishing the details later will make it run fast. It may run *faster*, but it will never run as fast as a program designed for performance.
ga: Is é an baol a bhaineann le daoine a spreagadh neamhaird a dhéanamh ar bharrfheabhsú go dtí go gá, ná go ndéanann sé neamhaird go háisiúil go bhfuil an t-am is tábhachtaí chun feidhmíocht a mheas ag céim an dearaidh, sula mbuaileann eochair méarchlár Má tá dearadh nó halgartaim chláir neamhéifeachtach, ansin ní fhágfaidh aon mhéid snasta na sonraí níos déanaí é a rith go tapa. D'fhéadfadh sé a rith níos gasta*, ach ní rithfidh sé chomh tapa le clár atá deartha le haghaidh feidhmíochta.
it: Il pericolo nell'incoraggiare le persone a ignorare l'ottimizzazione finché non è necessario è che si ignora convenientemente che il momento più importante per considerare le prestazioni è la fase di progettazione, prima ancora che un tasto sia premuto sulla tastiera. Se la progettazione o gli algoritmi di un programma sono inefficienti, nessuna quantità di perfezionamento dei dettagli in seguito lo renderà veloce. Potrebbe funzionare *più veloce*, ma non sarà mai veloce quanto un programma progettato per le prestazioni.
ja: 必要になるまで最適化を無視するように人々に勧めることの危険性は、パフォーマンスを考慮する最も重要な時期は、キーがキーボードに入力される前の設計段階であることを都合よく無視することです。プログラムの設計やアルゴリズムが非効率的であれば、後で細部をいくら磨いても、プログラムの実行速度は上がりません。いくらか実行速度は速くなるかもしれませんが、パフォーマンスを重視して設計されたプログラムと同じ速度で実行されることは決してありません。
pt_br: O perigo de encorajar as pessoas a ignorar a otimização até que seja necessário, é que ela convenientemente ignora que o momento mais importante para considerar o desempenho é na fase de design, antes mesmo de uma tecla bater em um teclado. Se o design ou os algoritmos de um programa são ineficientes, então nenhuma quantidade de polimento dos detalhes mais tarde fará com que ele funcione rapidamente. Ele pode ser executado *mais rápido*, mas nunca será executado tão rápido quanto um programa projetado para desempenho.
ta: உகப்பாக்கலை புறக்கணிக்க மக்களை ஊக்குவிக்கும் இடர் என்னவென்றால், செயல்திறனைக் கருத்தில் கொள்வதற்கான மிக முக்கியமான நேரம் வடிவமைப்பு கட்டத்தில் உள்ளது என்பதை இது வசதியாக புறக்கணிக்கிறது, ஒரு விசைப்பலகை ஒரு விசைப்பலகையைத் தாக்கும் முன். ஒரு திட்டத்தின் வடிவமைப்பு அல்லது வழிமுறைகள் திறமையற்றவை என்றால், பின்னர் விவரங்களை மெருகூட்டுவதற்கான அளவு பின்னர் வேகமாக இயங்காது. இது *வேகமாக *இயங்கக்கூடும், ஆனால் இது செயல்திறனுக்காக வடிவமைக்கப்பட்ட ஒரு நிரலைப் போல ஒருபோதும் வேகமாக இயங்காது.
zh_hant: 如果一直到很後面才考慮效能，最大風險就是錯過了設計階段。實際上，最重要的效能決定早在還沒寫第一行程式碼前就已經發生。如果設計和演算法本身就低效，後面再怎麼調整細節，頂多只能「變快一點」，永遠追不上原本設計就為效能考量的程式。

source: This tends to be far more important in game or graphics programming than in general programming. A performant design, even without low-level optimization, will often run many times faster than a mediocre design with low-level optimization.
ga: Is gnách go mbíonn sé seo i bhfad níos tábhachtaí i gcláir cluiche nó grafaicí ná i gcláir ghinear Is minic a reáchtálfaidh dearadh feidhmiúil, fiú gan barrfheabhsú ar leibhéal íseal, arís agus arís eile níos tapa ná dearadh meánach le barrfheabhsú ar leibhéal íseal.
it: Questo aspetto tende ad essere molto più importante nella programmazione di videogiochi o di grafica che nella programmazione in generale. Un progetto performante, anche senza ottimizzazione di basso livello, spesso funzionerà molto più velocemente di un progetto mediocre con ottimizzazione di basso livello.
ja: これは一般的なプログラミングよりも、ゲームやグラフィックスのプログラミングにおいて、はるかに重要になる傾向があります。パフォーマンスの高い設計は、低レベルの最適化がなくても、低レベルの最適化が行われた平凡な設計よりも何倍も高速に実行されることがよくあります。
ta: இது பொது நிரலாக்கத்தை விட விளையாட்டு அல்லது கிராபிக்ச் நிரலாக்கத்தில் மிக முக்கியமானது. ஒரு செயல்திறன் வடிவமைப்பு, குறைந்த அளவிலான தேர்வுமுறை இல்லாமல் கூட, குறைந்த அளவிலான தேர்வுமுறை கொண்ட சாதாரண வடிவமைப்பை விட பல மடங்கு வேகமாக இயங்கும்.
zh_hant: 這點在遊戲或圖形程式設計中特別重要。一個設計得當的系統，即使沒做底層最佳化，也常常比設計平庸但拼命微調底層的系統快上好幾倍。

source: Incremental design
ga: Dearadh incréitheach
it: Design incrementale
ja: インクリメンタル設計
pt_br: Desenho incremental
ta: அதிகரிக்கும் வடிவமைப்பு
zh_hant: 漸進式設計

source: Of course, in practice, unless you have prior knowledge, you are unlikely to come up with the best design the first time. Instead, you'll often make a series of versions of a particular area of code, each taking a different approach to the problem, until you come to a satisfactory solution. It's important not to spend too much time on the details at this stage until you have finalized the overall design. Otherwise, much of your work will be thrown out.
ga: Ar ndóigh, go praiticiúil, mura bhfuil eolas roimh ré agat, ní dócha go dtiocfaidh tú suas leis an dearadh is fearr an chéad uair. Ina áit sin, is minic a dhéanfaidh tú sraith leaganacha de réimse áirithe cód, agus gach ceann acu ag glacadh cur chuige difriúil leis an bhfadhb, go dtí go dtiocfaidh tú ar réiteach sásúil. Tá sé tábhachtach gan an iomarca ama a chaitheamh ar na sonraí ag an gcéim seo go dtí go mbeidh an dearadh foriomlán curtha i gcrích agat. Seachas sin, caithfear cuid mhaith de do chuid oibre amach.
it: Naturalmente, in pratica, a meno che non si abbiano conoscenze pregresse, è improbabile che si riesca a trovare la progettazione migliore al primo tentativo. Invece, spesso si realizzano una serie di versioni di una particolare area di codice, ognuna delle quali adotta un approccio diverso al problema, fino a raggiungere una soluzione soddisfacente. È importante non dedicare troppo tempo ai dettagli in questa fase, finché non si è finalizzato la progettazione complessiva. Altrimenti, gran parte del lavoro verrà sprecato.
ja: もちろん、実際には事前の知識がなければ、最初から最高の設計を思いつく可能性は低いでしょう。その代わりに多くの場合、特定のコード領域のバージョンをいくつか作成し、特定のコード領域について、それぞれ異なるアプローチで何バージョンも作成することがよくあります。全体的な設計が完成するまで、この段階では詳細に時間をかけすぎないことが重要です。そうしないと作業の大部分が無駄になってしまいます。
ta: நிச்சயமாக, நடைமுறையில், உங்களுக்கு முன் அறிவு இல்லையென்றால், நீங்கள் முதல் முறையாக சிறந்த வடிவமைப்பைக் கொண்டு வர வாய்ப்பில்லை. அதற்கு பதிலாக, நீங்கள் ஒரு குறிப்பிட்ட பகுதியின் தொடர்ச்சியான பதிப்புகளை உருவாக்குவீர்கள், ஒவ்வொன்றும் நீங்கள் திருப்திகரமான தீர்வுக்கு வரும் வரை பிரச்சினைக்கு வெவ்வேறு அணுகுமுறையை எடுக்கும். ஒட்டுமொத்த வடிவமைப்பை நீங்கள் இறுதி செய்யும் வரை இந்த கட்டத்தில் விவரங்களுக்கு அதிக நேரம் செலவிடக்கூடாது என்பது முதன்மை. இல்லையெனில், உங்கள் வேலையின் பெரும்பகுதி வெளியேற்றப்படும்.
zh_hant: 當然，實務上除非你本來就很有經驗，很難第一次就設計出最理想的架構。通常都會針對某個問題嘗試許多不同方法，做出多個版本，最後才找到滿意的解決方案。在這個階段，別太早花太多時間雕琢細節，等整體設計底定後再來優化細節，不然前面做的多半都會被捨棄。

source: It's difficult to give general guidelines for performant design because this is so dependent on the problem. One point worth mentioning though, on the CPU side, is that modern CPUs are nearly always limited by memory bandwidth. This has led to a resurgence in data-oriented design, which involves designing data structures and algorithms for *cache locality* of data and linear access, rather than jumping around in memory.
ga: Tá sé deacair treoirlínte ginearálta a thabhairt maidir le dearadh feidhmiúil toisc go bhfuil sé seo ag brath chomh mór ar an bhfadhb. Pointe amháin is fiú a lua áfach, ar thaobh an LAP, ná go bhfuil CPUanna nua-aimseartha teoranta beagnach i gcónaí ag bandaleithead cuimhne Mar thoradh air seo tá athbheochan i ndearadh atá dírithe ar shonraí, rud a bhaineann le struchtúir agus halgartaim sonraí a dhearadh d'* áitiúlacht taisceán* sonraí agus rochtain líneach, seachas léim timpeall sa chuimhne.
it: È difficile dare linee guida generali per una progettazione performante, perché questa dipende molto dal problema specifico. Un punto che vale la pena menzionare, tuttavia, per quanto riguarda la CPU, è che le CPU moderne sono quasi sempre limitate dalla larghezza di banda della memoria. Ciò ha portato a una rinascita della progettazione orientata ai dati, che consiste a progettare strutture dati e algoritmi per la *località della cache* dei dati e l'accesso lineare, piuttosto che salti nella memoria.
ja: パフォーマンスの高い設計の一般的なガイドラインを示すことは困難です。これは問題に大きく依存するからです。しかし CPU 側で言及する価値のある1つのポイントは、最近の CPU は常にメモリ帯域幅によって性能が制限されているということです。このためメモリ内をあちこち飛び回るのではなく、データの *キャッシュ局所性* と線形アクセスのためのデータ構造とアルゴリズムを設計する、データ指向設計が重要です。
ta: செயல்திறன் வடிவமைப்பிற்கான பொதுவான வழிகாட்டுதல்களை வழங்குவது கடினம், ஏனெனில் இது சிக்கலைப் பொறுத்தது. சிபியு பக்கத்தில் குறிப்பிடத் தகுந்த ஒரு புள்ளி என்னவென்றால், நவீன சிபியுக்கள் எப்போதும் நினைவக அலைவரிசையால் வரையறுக்கப்படுகின்றன. இது தரவு சார்ந்த வடிவமைப்பில் மீண்டும் எழுச்சி பெற வழிவகுத்தது, இது நினைவகத்தில் குதிப்பதை விட, தரவு மற்றும் நேரியல் அணுகலுக்கான * கேச் வட்டாரத்திற்கான தரவு கட்டமைப்புகள் மற்றும் வழிமுறைகளை வடிவமைப்பதை உள்ளடக்கியது.
zh_hant: 高效能設計沒有放諸四海皆準的準則，因為每個問題本質不同。不過有個 CPU 方面的原則很值得注意：現代 CPU 幾乎都被記憶體頻寬限制住。因此，資料導向（Data-Oriented）的設計重新受到重視，設計資料結構與演算法時要盡量讓資料存取具有 *快取區域性* （cache locality）和線性存取，而非隨機跳躍於記憶體。

source: The optimization process
ga: An próiseas optamaithe
it: Il processo di ottimizzazione
ja: 最適化のプロセス
pt_br: O processo de otimização
ta: தேர்வுமுறை செயல்முறை
zh_hant: 最佳化流程

source: Assuming we have a reasonable design, and taking our lessons from Knuth, our first step in optimization should be to identify the biggest bottlenecks - the slowest functions, the low-hanging fruit.
ga: Ag glacadh leis go bhfuil dearadh réasúnta againn, agus ár gceachtanna a ghlacadh ó Knuth, ba cheart gurb é ár gcéad chéim maidir le barrfheabhsú ná na stragaill is mó a aithint - na feidhmeanna is moille, na torthaí crochta íseal.
it: Supponendo di avere una progettazione ragionevole e prendendo spunto da Knuth, il nostro primo passo nell'ottimizzazione dovrebbe essere quello di identificare i colli di bottiglia più grandi, ovvero le funzioni più lente, i frutti più facili da raggiungere.
ja: 合理的な設計ができたと仮定し、Knuth から教訓を得たとして、最適化の最初のステップは、最大のボトルネック、つまり最も遅い関数、簡単に達成できる部分を特定することです。
pt_br: Supondo que tenhamos um design razoável, e tirando nossas lições de Knuth, nosso primeiro passo na otimização deve ser identificar os maiores gargalos - as funções mais lentas, os frutos de baixa pendência.
ta: எங்களிடம் ஒரு நியாயமான வடிவமைப்பு இருப்பதாகக் கருதி, நுத் இருந்து எங்கள் பாடங்களை எடுத்துக்கொள்வது, தேர்வுமுறைக்கான எங்கள் முதல் படி மிகப்பெரிய இடையூறுகளை அடையாளம் காண்பது - மெதுவான செயல்பாடுகள், குறைந்த தொங்கும் பழம்.
zh_hant: 假設我們已經有合理的設計，並記住 Knuth 的建議，最佳化的第一步就是找出最大的瓶頸：那些最慢的函式，也就是「低垂的果實」。

source: Once we've successfully improved the speed of the slowest area, it may no longer be the bottleneck. So we should test/profile again and find the next bottleneck on which to focus.
ga: Nuair a bheidh luas an limistéar is moille feabhsaithe againn go rathúil, b'fhéidir nach é an scagal a thuilleadh. Mar sin ba cheart dúinn tástáil/próifíl arís agus an chéad scagal eile a fháil chun díriú air.
it: Una volta migliorata la velocità dell'area più lenta, potrebbe non essere più il collo di bottiglia. Quindi dovremmo testare/profilare nuovamente e individuare il prossimo collo di bottiglia su cui concentrarci.
ja: 最も遅い部分の速度を改善することができたら、そこがボトルネックではなくなる可能性があります。そのため、再度テスト/プロファイルを実行し、次に重点を置くべきボトルネックを見つける必要があります。
pt_br: Uma vez que melhoramos com sucesso a velocidade da área mais lenta, pode não ser mais o gargalo. Portanto, devemos testar/traçar o perfil novamente e encontrar o próximo gargalo no qual nos concentrar.
ta: மெதுவான பகுதியின் வேகத்தை நாங்கள் வெற்றிகரமாக மேம்படுத்தியவுடன், அது இனி தடையாக இருக்காது. எனவே நாம் மீண்டும் சோதிக்க வேண்டும்/சுயவிவரப்படுத்த வேண்டும், மேலும் கவனம் செலுத்த வேண்டிய அடுத்த தடையை கண்டுபிடிக்க வேண்டும்.
zh_hant: 當我們成功改善了最慢的部分後，它可能就不再是瓶頸，這時就要再重新測試／分析，找出下個最值得優化的區塊。
