Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/general_optimization.po
Languages: ga, it, ja, pt_br, ta, zh_hant

source: The process is thus:
ga: Is é an próiseas mar sin:
it: Il processo è quindi:
ja: プロセスは次のようになります。
pt_br: O processo é assim:
ta: செயல்முறை இவ்வாறு:
zh_hant: 流程如下：

source: Profile / Identify bottleneck.
ga: Próifíl/ Aithint scagcal.
it: Profilare / Indentificare i colli di bottiglia.
ja: プロファイルしてボトルネックを特定する。
pt_br: Perfil / Identificação de gargalo.
ta: சுயவிவரம் / சிக்கல் அடையாளம் காணவும்.
zh_hant: 分析／找出瓶頸。

source: Optimize bottleneck.
ga: Uasmhéadú an scagal.
it: Ottimizzare il collo di bottiglia.
ja: ボトルネックを最適化する。
pt_br: Otimize o gargalo.
ta: இடையூறுகளை மேம்படுத்தவும்.
zh_hant: 優化瓶頸。

source: Return to step 1.
ga: Fill ar ais go céim 1.
it: Ritornare al passo 1.
ja: ステップ1に戻る。
pt_br: Volte ao passo 1.
ta: படி 1 க்குத் திரும்பு.
zh_hant: 回到步驟 1。

source: Optimizing bottlenecks
ga: Trúscail a bharrfheabhsú
it: Ottimizzazione dei colli di bottiglia
ja: ボトルネックの最適化
pt_br: Otimizando gargalos
ta: இடையூறுகளை மேம்படுத்துதல்
zh_hant: 瓶頸最佳化

source: Some profilers will even tell you which part of a function (which data accesses, calculations) are slowing things down.
ga: Inseoidh roinnt próifílí duit fiú cén chuid de fheidhm (na sonraí a rochtann, ríomhanna) atá ag moilliú rudaí.
it: Alcuni profiler diranno addirittura quale parte di una funzione (quali accessi ai dati, calcoli) sta rallentando il tutto.
ja: プロファイラーでは、関数のどの部分 (データアクセス、計算処理など) が速度を低下させているかがわかります。
ta: சில சுயவிவரங்கள் ஒரு செயல்பாட்டின் எந்த பகுதி (எந்த தரவு அணுகல், கணக்கீடுகள்) விசயங்களை மெதுவாக்குகின்றன என்பதை கூட உங்களுக்குக் கூறும்.
zh_hant: 有些分析工具甚至能指出是哪個函式的哪個部分（哪個資料存取、哪個運算）拖慢速度。

source: As with design, you should concentrate your efforts first on making sure the algorithms and data structures are the best they can be. Data access should be local (to make best use of CPU cache), and it can often be better to use compact storage of data (again, always profile to test results). Often, you precalculate heavy computations ahead of time. This can be done by performing the computation when loading a level, by loading a file containing precalculated data, or by storing the results of complex calculations into a script constant and reading its value.
ja: 設計と同様に、まずアルゴリズムとデータ構造が最善のものとなるよう努力を集中する必要があります。データアクセスはローカルで行いましょう (CPU キャッシュを最大限に活用するため)。またデータのコンパクトなストレージを使用する方がよい場合が多くあります (ここでも常にプロファイルを作成して結果をテストしてください)。多くの場合、負荷の高い計算は事前に計算しましょう。これはレベルをロードするときに計算を実行したり、事前に計算されたデータが記録されているファイルをロードしたり、複雑な計算の結果をスクリプト定数に格納してその値を使用することなどで実行できます。
zh_hant: 和設計階段一樣，優化時首先要確保演算法和資料結構已是最佳選擇。資料存取應盡量區域化（善用 CPU 快取），且資料儲存應盡量精簡（同樣記得用分析工具驗證）。許多複雜運算可以事先預先計算好，例如在載入關卡時處理、或直接載入已經預先算好資料的檔案，又或者把運算結果寫成腳本常數直接讀取。

source: Once algorithms and data are good, you can often make small changes in routines which improve performance. For instance, you can move some calculations outside of loops or transform nested ``for`` loops into non-nested loops. (This should be feasible if you know a 2D array's width or height in advance.)
ga: Nuair a bhíonn halgartaim agus sonraí go maith, is minic gur féidir leat athruithe beaga a dhéanamh ar ghnáthaimh a fheabhsaíonn feidhmíocht Mar shampla, is féidir leat roinnt ríomhanna a bhogadh lasmuigh de lúb nó lúbanna neadaithe ``for `a athrú ina lúbaí neadaithe. (Ba chóir go mbeadh sé seo indéanta má tá leithead nó airde eagar 2D ar eolas agat roimh ré.)
it: Una volta che gli algoritmi e i dati vanno bene, spesso è possibile apportare piccole modifiche alle routine per migliorarne le prestazioni. Ad esempio, è possibile spostare alcuni calcoli all'esterno dei cicli o trasformare cicli ``for`` annidati in cicli non annidati. (Questo dovrebbe essere fattibile se si conosce in anticipo la larghezza o l'altezza di un array 2D.)
ja: アルゴリズムとデータが適切であれば、ルーチンに小さな変更を加えるだけでパフォーマンスが向上することがよくあります。たとえば、一部の計算をループ外に移動したり、ネストされた ``for`` ループをネストされていないループに変換したりできます。(2D 配列の幅または高さが事前にわかっている場合は、これが実行可能なはずです。)
ta: வழிமுறைகள் மற்றும் தரவு நன்றாக இருந்தவுடன், செயல்திறனை மேம்படுத்தும் நடைமுறைகளில் நீங்கள் பெரும்பாலும் சிறிய மாற்றங்களைச் செய்யலாம். உதாரணமாக, நீங்கள் சுழல்களுக்கு வெளியே சில கணக்கீடுகளை நகர்த்தலாம் அல்லது உள்ளமைக்கப்பட்ட `` `` சுழல்களுக்கு உள்ளமைக்கப்பட்ட சுழல்களாக மாற்றலாம். (2 டி வரிசையின் அகலம் அல்லது உயரத்தை முன்கூட்டியே அறிந்தால் இது சாத்தியமாக இருக்க வேண்டும்.)
zh_hant: 當演算法和資料結構最佳化後，還可以針對細部流程做些小調整來提升效能，例如把某些計算移到迴圈外，或將巢狀 ``for`` 迴圈改寫為非巢狀（前提是你已知 2D 陣列的寬高）

source: Always retest your timing/bottlenecks after making each change. Some changes will increase speed, others may have a negative effect. Sometimes, a small positive effect will be outweighed by the negatives of more complex code, and you may choose to leave out that optimization.
ga: Déan do chuid ama a athscrúdú i gcónaí tar éis gach athrú a dhéanamh. Méadóidh roinnt athruithe luas, d'fhéadfadh éifeacht dhiúltach a bheith ag cuid eile. Uaireanta, beidh éifeacht dhearfach beag níos airde ná diúltacha an chód níos casta, agus féadfaidh tú a roghnú an barrfheabhsú sin a fhágáil amach.
it: Ritestare sempre i tempi/colli di bottiglia dopo ogni modifica. Alcune modifiche aumenteranno la velocità, altre potrebbero avere un effetto negativo. A volte, un piccolo effetto positivo sarà controbilanciato dagli aspetti negativi di un codice più complesso, e si potrebbe scegliere di tralasciare quell'ottimizzazione.
ja: 変更を加えた後は必ずタイミング/ボトルネックを再テストしてください。変更によっては速度が向上するものもありますが、マイナスの影響を与えるものもあります。場合によっては、わずかなプラスの効果を、より複雑なコードによるマイナスの影響が上回ることがあり、その最適化を省くことを選択することもあります。
ta: ஒவ்வொரு மாற்றத்தையும் செய்தபின் எப்போதும் உங்கள் நேரம்/இடையூறுகளை மறுபரிசீலனை செய்யுங்கள். சில மாற்றங்கள் வேகத்தை அதிகரிக்கும், மற்றவை எதிர்மறையான விளைவைக் கொண்டிருக்கலாம். சில நேரங்களில், ஒரு சிறிய நேர்மறையான விளைவு மிகவும் சிக்கலான குறியீட்டின் எதிர்மறைகளால் விட அதிகமாக இருக்கும், மேலும் அந்த தேர்வுமுறையை விட்டுவிட நீங்கள் தேர்வு செய்யலாம்.
zh_hant: 每做一項更動，記得都要重新測試瓶頸和耗時。有些改動會讓速度變快，有些則讓效能變差。有時效能提升很小，但程式碼變得很難維護，這種情況下也可以選擇不做這類優化。

source: Appendix
ga: Aguisín
it: Appendice
ja: 付録
pt_br: Apêndice
ta: பின் இணைப்பு
zh_hant: 附錄

source: Bottleneck math
ga: Matamaitic bogadh
it: Matematica dei colli di bottiglia
ja: ボトルネックの計算
ta: சிக்கல் கணிதம்
zh_hant: 瓶頸數學

source: The proverb *"a chain is only as strong as its weakest link"* applies directly to performance optimization. If your project is spending 90% of the time in function ``A``, then optimizing ``A`` can have a massive effect on performance.
ga: Ní bhaineann an seanfhocal *"slabhra chomh láidir lena nasc is laige"* go díreach le barrfheabhsú feidhmíochta. Má tá do thionscadal ag caitheamh 90% den am i bhfeidhm ``A ``, ansin is féidir éifeacht ollmhór a bheith ag `A`` a bharrfheabhsú ar fheidhmíocht.
it: Il proverbio *"una catena è forte quanto il suo anello più debole"* si applica direttamente all'ottimizzazione delle prestazioni. Se il progetto trascorre il 90% del tempo nella funzione ``A``, allora ottimizzare ``A`` può avere un impatto enorme sulle prestazioni.
ja: *「鎖の強さは最も弱い部分と同じ」* という諺は、パフォーマンスの最適化に直接当てはまります。プログラムの時間の 90% が関数「A」に費やされている場合、「A」を最適化するとパフォーマンスに大きな影響を与える可能性があります。
ta: பழமொழி * "ஒரு சங்கிலி அதன் பலவீனமான இணைப்பைப் போலவே வலுவானது" * செயல்திறன் தேர்வுமுறை நேரடியாகப் பொருந்தும். உங்கள் திட்டம் 90% நேரத்தை `` a`` செலவழித்தால், `` a`` ஐ மேம்படுத்துவது செயல்திறனில் மிகப்பெரிய விளைவை ஏற்படுத்தும்.
zh_hant: 俗話說：*「一條鍊子的強度取決於最薄弱的環節」*，這句話用在效能優化再貼切不過。如果你的專案有 90% 的執行時間都花在函式 ``A``，那麼只要優化 ``A``，就能有極大效益。

source: In this example, improving this bottleneck ``A`` by a factor of 9× decreases overall frame time by 5× while increasing frames per second by 5×.
ga: Sa sampla seo, laghdaíonn an scagal seo ``A ``a fheabhsú le fachtóir 9× am fráma foriomlán 5× agus méadaíonn sé frámaí in aghaidh an tsoicind 5 ×.
it: In questo esempio, migliorare il collo di bottiglia ``A`` per un fattore di 9x riduce il tempo complessivo di frame di 5x, allo stesso tempo aumentando i frame al secondo di 5x.
ja: この例では、このボトルネック「A」を 9 倍改善すると、全体のフレーム時間が 5 倍短縮され、1 秒あたりのフレーム数が 5 倍増加します。
ta: இந்த எடுத்துக்காட்டில், இந்த இடையூறுகளை 9 of இன் காரணியால் `` a`` ஐ மேம்படுத்துவது ஒட்டுமொத்த பிரேம் நேரத்தை 5 by குறைக்கிறது, அதே நேரத்தில் நொடிக்கு பிரேம்களை 5 by அதிகரிக்கும்.
zh_hant: 在這個例子中，若將瓶頸 ``A`` 提升 9 倍效能，總體幀時間會縮短 5 倍，每秒幀數也會提升 5 倍。

source: However, if something else is running slowly and also bottlenecking your project, then the same improvement can lead to less dramatic gains:
ga: Mar sin féin, má tá rud éigin eile ag rith go mall agus ag cur isteach ar do thionscadal freisin, ansin is féidir gnóthachain níos lú drámatúla a bheith mar thoradh ar an bhfeabhsú céanna:
it: Tuttavia, se qualcos'altro si sta eseguendo lentamente e crea un collo di bottiglia nel progetto, lo stesso miglioramento può portare a guadagni meno drastici:
ja: ただし、他の何かの実行速度が遅く、プログラムのボトルネックになっている場合は、同じ改善を行ってもそれほど劇的な効果は得られません。
ta: இருப்பினும், வேறு ஏதாவது மெதுவாக இயங்குகிறது மற்றும் உங்கள் திட்டத்தை இடையூறு செய்தால், அதே முன்னேற்றம் குறைந்த வியத்தகு லாபங்களுக்கு வழிவகுக்கும்:
zh_hant: 不過，如果還有其他地方也很慢、同樣成為瓶頸時，相同的優化幅度就無法帶來這麼明顯的提升：

source: In this example, even though we have hugely optimized function ``A``, the actual gain in terms of frame rate is quite small.
ga: Sa sampla seo, cé go bhfuil feidhm “A” optamaithe go mór againn, tá an gnóthachan iarbhír i dtéarmaí ráta fráma beag go leor.
it: In questo esempio, nonostante la funzione ``A`` sia stata notevolmente ottimizzata, il guadagno effettivo in termini di frame rate è piuttosto ridotto.
ja: この例では、関数「A」を大幅に最適化しているにもかかわらず、フレームレートの点での実際の向上はわずかです。
ta: இந்த எடுத்துக்காட்டில், நாங்கள் மிகவும் உகந்த செயல்பாட்டை `` a`` வைத்திருந்தாலும், பிரேம் வீதத்தின் அடிப்படையில் உண்மையான ஆதாயம் மிகவும் சிறியது.
zh_hant: 在這個例子中，雖然我們大幅優化了函式 ``A``，但實際上幀率提升卻很有限。

source: In games, things become even more complicated because the CPU and GPU run independently of one another. Your total frame time is determined by the slower of the two.
ga: I gcluichí, éiríonn rudaí níos casta fós toisc go ritheann an LAP agus an GPU go neamhspleách óna chéile. Cinneann do chuid ama fráma iomlán ag an méid níos moille den dá cheann.
it: Nei giochi, le cose si complicano ulteriormente perché la CPU e la GPU funzionano indipendentemente l'una dall'altra. Il frame time totale è determinato dalla più lenta delle due.
ja: ゲームでは CPU と GPU が互いに独立して実行されるため、状況はさらに複雑になります。合計フレーム時間は、2つのうち遅い方によって決まります。
ta: விளையாட்டுகளில், சிபியு மற்றும் சி.பீ.யூ ஒருவருக்கொருவர் சுயாதீனமாக இயங்குவதால் விசயங்கள் இன்னும் சிக்கலானவை. உங்கள் மொத்த பிரேம் நேரம் இரண்டின் மெதுவாக தீர்மானிக்கப்படுகிறது.
zh_hant: 在遊戲開發中，情況更複雜，因為 CPU 和 GPU 是獨立運作的。你的總幀時間取決於兩者裡面較慢的那一方。

source: In this example, we optimized the CPU hugely again, but the frame time didn't improve because we are GPU-bottlenecked.
ga: Sa sampla seo, rinneamar an LAP a bharrfheabhsú go mór arís, ach níor tháinig feabhas ar an am fráma toisc go bhfuilimid faoi chraobail GPU.
it: In questo esempio abbiamo ottimizzato ancora una volta notevolmente la CPU, ma il frame time non è migliorato perché siamo limitati dalla GPU.
ja: この例では、CPU を再度大幅に最適化しましたが、GPU がボトルネックになっているため、フレーム時間は改善されませんでした。
ta: இந்த எடுத்துக்காட்டில், நாங்கள் மீண்டும் சிபியு ஐ மிகப் பெரிய அளவில் மேம்படுத்தினோம், ஆனால் நாங்கள் சி.பீ.யூ-பாட்லெனெக் என்பதால் பிரேம் நேரம் மேம்படவில்லை.
zh_hant: 在這個例子裡，我們大幅優化了 CPU，但幀時間卻沒變快，因為這次的瓶頸是在 GPU。

source: Checking the frame rate (with V-Sync disabled). Third-party utilities such as `RivaTuner Statistics Server <https://www.guru3d.com/files-details/rtss-rivatuner-statistics-server-download.html>`__ (Windows) or `MangoHud <https://github.com/flightlessmango/MangoHud>`__ (Linux) can also be useful here.
ga: An ráta fráma a sheiceáil (le V-Sync díchumasaithe). Fóntais tríú páirtí ar nós `Freastalaí Staitisticí RivaTuner <https://www.guru3d.com/files-details/rtss-rivatuner-statistics-server-download.html>`__ (Windows) nó `MangoHud <https:// github.com/flightlessmango/MangoHud>`__ (Linux) is féidir a bheith úsáideach anseo freisin.
ta: பிரேம் வீதத்தை சரிபார்க்கிறது (வி-ஒத்திசைவு முடக்கப்பட்ட நிலையில்). `ரிவாட்டூனர் புள்ளிவிவர சேவையகம் <https://www.guru3d.com/files-details/rtss-rivatuner--statistics-server-download.html> __ (விண்டோச்) அல்லது` mangohud <https://போன்ற மூன்றாம் தரப்பு பயன்பாடுகள் github.com/flightlessmango/mangohud>` (லினக்ச்) இங்கே பயனுள்ளதாக இருக்கும்.

source: As with design, you should concentrate your efforts first on making sure the algorithms and data structures are the best they can be. Data access should be local (to make best use of CPU cache), and it can often be better to use compact storage of data (again, always profile to test results). Often, you precalculate heavy computations ahead of time. This can be done by performing the computation when loading a level, by loading a file containing precalculated data or simply by storing the results of complex calculations into a script constant and reading its value.
ga: Mar a bhaineann le dearadh, ba cheart duit d'iarrachtaí a dhíriú ar dtús ar dtús ar a chinntiú gurb iad na halgartaim agus na struchtúir sonraí an rud is fearr Ba chóir go mbeadh rochtain sonraí áitiúil (chun an úsáid is fearr a bhaint as taisce LAP), agus is minic gur féidir é a bheith níos fearr stóráil dhlúth sonraí a úsáid (arís, próifíl i gcónaí chun torthaí a thástáil). Go minic, ríomhaíonn tú ríomhanna troma roimh am. Is féidir é seo a dhéanamh tríd an ríomh a dhéanamh agus leibhéal á luchtú, trí chomhad ina bhfuil sonraí réamhríofa a luchtú nó trí thorthaí ríomhanna casta a stóráil i dtairiseach script agus a luach a léamh.
ta: வடிவமைப்பைப் போலவே, வழிமுறைகள் மற்றும் தரவு கட்டமைப்புகள் அவை சிறந்தவை என்பதை உறுதிசெய்வதில் நீங்கள் முதலில் உங்கள் முயற்சிகளில் கவனம் செலுத்த வேண்டும். தரவு அணுகல் உள்ளக இருக்க வேண்டும் (CPU தற்காலிக சேமிப்பை சிறந்த முறையில் பயன்படுத்த), மேலும் தரவின் சிறிய சேமிப்பிடத்தைப் பயன்படுத்துவது பெரும்பாலும் சிறந்தது (மீண்டும், முடிவுகளை சோதிக்க எப்போதும் சுயவிவரம்). பெரும்பாலும், நீங்கள் நேரத்திற்கு முன்பே கனரக கணக்கீடுகளை முன்கூட்டியே கணக்கிடுகிறீர்கள். ஒரு நிலையை ஏற்றும்போது, முன்கூட்டிய தரவைக் கொண்ட ஒரு கோப்பை ஏற்றுவதன் மூலம் அல்லது சிக்கலான கணக்கீடுகளின் முடிவுகளை ச்கிரிப்ட் மாறிலியில் சேமித்து அதன் மதிப்பைப் படிப்பதன் மூலம் கணக்கீட்டைச் செய்வதன் மூலம் இதைச் செய்யலாம்.
