Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/general_optimization.po
Languages: ga, it, ja, pt_br, ta, zh_hant

source: General optimization tips
ga: Leideanna optamaithe ginearál
it: Consigli generali di ottimizzazione
ja: 一般的な最適化のTips
pt_br: Dicas gerais de otimização
ta: பொது தேர்வுமுறை உதவிக்குறிப்புகள்
zh_hant: 一般最佳化技巧

source: Introduction
ga: Réamhrá
it: Introduzione
ja: はじめに
pt_br: Introdução
ta: அறிமுகம்
zh_hant: 前言

source: In an ideal world, computers would run at infinite speed. The only limit to what we could achieve would be our imagination. However, in the real world, it's all too easy to produce software that will bring even the fastest computer to its knees.
ga: I saol idéalach, rithfeadh ríomhairí ar luas gan teorainn. Is é ár samhlaíocht an t-aon teorainn don rud a d'fhéadfaimis a bhaint amach. Mar sin féin, sa saol fíor, tá sé ró-éasca bogearraí a tháirgeadh a thabharfaidh fiú an ríomhaire is gasta chuig a ghlúine.
it: In un mondo ideale, i computer funzionerebbero a velocità infinita. L'unico limite a ciò che potremmo realizzare sarebbe la nostra immaginazione. Tuttavia, nel mondo reale, è fin troppo facile produrre software che metterebbe in ginocchio anche il computer più veloce.
ja: 理想的な世界では、コンピューターは無限の速度で動作します。実現可能なことの唯一の限界は私たちの想像力です。しかし現実の世界では、最速のコンピューターでさえも機能不全に陥らせるソフトウェアをいとも簡単に作成できます。
ta: ஒரு சிறந்த உலகில், கணினிகள் எல்லையற்ற வேகத்தில் இயங்கும். நாம் அடையக்கூடிய ஒரே வரம்பு நம் கற்பனையாக இருக்கும். இருப்பினும், நிச உலகில், மென்பொருளை உருவாக்குவது மிகவும் எளிதானது, இது வேகமான கணினியைக் கூட அதன் முழங்கால்களுக்கு கொண்டு வரும்.
zh_hant: 在理想世界中，電腦能以無限的速度運作，唯一的限制就是我們的想像力。然而在現實中，要寫出讓即使是最快電腦也跑不動的軟體，其實非常容易。

source: Thus, designing games and other software is a compromise between what we would like to be possible, and what we can realistically achieve while maintaining good performance.
ga: Mar sin, is comhréiteach é dearadh cluichí agus bogearraí eile idir cad ba mhaith linn a bheith indéanta, agus an méid is féidir linn a bhaint amach go réalaíoch agus feidhmíocht mhaith á chothabháil againn.
it: Pertanto, progettare giochi e altri software è un compromesso tra ciò che vorremmo fosse possibile e ciò che possiamo realisticamente ottenere mantenendo buone prestazioni.
ja: したがって、ゲームやその他のソフトウェアの設計する際は、実現したいことと、良好なパフォーマンスのバランスを取り、現実的に達成できる妥協点を検討する必要があります。
ta: எனவே, விளையாட்டுகள் மற்றும் பிற மென்பொருளை வடிவமைப்பது, நாம் சாத்தியமாக இருக்க விரும்புகிறோம், நல்ல செயல்திறனைப் பேணுகையில் நாம் தத்ரூபமாக எதை அடைய முடியும் என்பதற்கு இடையிலான சமரசமாகும்.
zh_hant: 因此，設計遊戲或其他軟體時，我們必須在「想做的事情」和「在維持良好效能下實際能做到的事情」之間取得平衡。

source: To achieve the best results, we have two approaches:
ga: Chun na torthaí is fearr a bhaint amach, tá dhá chur chuige againn:
it: Per ottenere i migliori risultati, abbiamo due approcci:
ja: 最良の結果を得るために、次の2つのアプローチがあります。
pt_br: Para obter os melhores resultados, temos duas abordagens:
ta: சிறந்த முடிவுகளை அடைய, எங்களுக்கு இரண்டு அணுகுமுறைகள் உள்ளன:
zh_hant: 要達到最佳結果，我們有兩種方法：

source: Work faster.
ga: Oibrigh níos gasta.
it: Lavora più rapidamente.
ja: より速く動かす。
pt_br: Trabalhe mais rápido.
ta: வேகமாக வேலை செய்யுங்கள்.
zh_hant: 讓運作更快。

source: Work smarter.
ga: Oibrigh níos cliste.
it: Lavora più intelligentemente.
ja: よりスマートに動かす。
pt_br: Trabalhe de forma mais inteligente.
ta: அறிவாளி வேலை.
zh_hant: 讓方法更聰明。

source: And preferably, we will use a blend of the two.
ga: Agus b'fhearr, úsáidfimid meascán den dá cheann.
it: E preferibilmente, useremo un misto dei due.
ja: できればこの2つを両方とも達成できればベストです。
pt_br: E, de preferência, usaremos uma mistura das duas.
ta: முன்னுரிமை, நாங்கள் இரண்டின் கலவையைப் பயன்படுத்துவோம்.
zh_hant: 理想上，兩者應該兼顧。

source: Smoke and mirrors
ga: Deatach agus scátháin
ja: ごまかし
pt_br: Fumaça e espelhos
ta: புகை மற்றும் கண்ணாடிகள்
zh_hant: 障眼法與假象

source: Part of working smarter is recognizing that, in games, we can often get the player to believe they're in a world that is far more complex, interactive, and graphically exciting than it really is. A good programmer is a magician, and should strive to learn the tricks of the trade while trying to invent new ones.
ga: Cuid d'oibriú níos cliste is ea a aithint gur minic gur féidir linn, i gcluichí, a chur ar an imreoir a chreidiúint go bhfuil siad i ndomhan atá i bhfad níos casta, idirghníomhach agus níos spreagúla ó thaobh grafach ná mar atá sé i ndáiríre. Is draoi é ríomhchláraitheoir maith, agus ba cheart dó iarracht a dhéanamh cleasanna na trádála a fhoghlaim agus é ag iarraidh cinn nua a chumadh.
it: Parte di lavorare più intelligentemente è riconoscere che, nei videogiochi, spesso possiamo far credere al giocatore di trovarsi in un mondo molto più complesso, interattivo e graficamente avvincente di quanto non sia in realtà. Un buon programmatore è un prestigiatore e dovrebbe impegnarsi a imparare i trucchi del mestiere mentre cerca di inventarne di nuovi.
ja: ゲームではプレイヤーに実際よりも、はるかに複雑で、インタラクティブで、グラフィックが刺激的な世界にいると信じ込ませることができることを認識する必要があります。よりスマートに仕事をするためには、優れたプログラマーはマジシャンであり、業界の最新技術を習得しながら、新しい技術を発明するように努めるべきです。
ta: புத்திசாலித்தனமாக வேலை செய்வதன் ஒரு பகுதி, விளையாட்டுகளில், வீரர் அவர்கள் மிகவும் சிக்கலான, ஊடாடும் மற்றும் வரைபட ரீதியாக உற்சாகமான ஒரு உலகில் இருப்பதாக நம்புவதற்கு நாம் அடிக்கடி பெறலாம். ஒரு நல்ல புரோகிராமர் ஒரு மந்திரவாதி, மேலும் புதியவற்றைக் கண்டுபிடிக்க முயற்சிக்கும்போது வர்த்தகத்தின் தந்திரங்களைக் கற்றுக்கொள்ள முயற்சிக்க வேண்டும்.
zh_hant: 聰明地開發的一環，就是知道在遊戲裡，我們經常能讓玩家相信他們正處在一個比實際更複雜、更互動、畫面更華麗的世界。一個好的程式設計師就像魔術師，應該不斷學習業界的技巧，並試著發明新手法。

source: The nature of slowness
ga: Nádúr na moillithe
it: La natura della lentezza
ja: 遅さの本質
ta: மந்தநிலையின் தன்மை
zh_hant: 效能瓶頸的本質

source: To the outside observer, performance problems are often lumped together. But in reality, there are several different kinds of performance problems:
ga: Don bhreathnóir lasmuigh, is minic a chuirtear fadhbanna feidhmíochta le chéile. Ach i ndáiríre, tá roinnt cineálacha éagsúla fadhbanna feidhmíochta ann:
it: Per un osservatore esterno, i problemi di prestazioni sono spesso considerati un tutt'uno. Ma in realtà, esistono diversi tipi di problemi di prestazioni:
ja: 外部から見ると、パフォーマンスの問題は多くの場合、ひとまとめにされています。しかし、実際にはパフォーマンスの問題にはいくつかの種類があります。
ta: வெளிப்புற பார்வையாளருக்கு, செயல்திறன் சிக்கல்கள் பெரும்பாலும் ஒன்றாக இணைக்கப்பட்டுள்ளன. ஆனால் உண்மையில், பல்வேறு வகையான செயல்திறன் சிக்கல்கள் உள்ளன:
zh_hant: 對外行人來說，所有效能問題看起來都一樣，但其實效能問題有不同類型：

source: A slow process that occurs every frame, leading to a continuously low frame rate.
ga: Próiseas mall a tharlaíonn gach fráma, rud a fhágann go mbíonn ráta fráma íseal go leanúnach.
it: Un processo lento che avviene a ogni frame, portando a una frequenza di frame costantemente bassa.
ja: 毎フレーム発生する重い処理で、フレーム レートが継続的に低くなっている。
ta: ஒவ்வொரு சட்டகத்தையும் நிகழும் மெதுவான செயல்முறை, தொடர்ந்து குறைந்த பிரேம் வீதத்திற்கு வழிவகுக்கிறது.
zh_hant: 每一幀都會發生的慢處理，導致持續低幀率。

source: An intermittent process that causes "spikes" of slowness, leading to stalls.
ga: Próiseas uaineach a chruthaíonn “spící” moillithe, agus mar thoradh ar stallaí.
it: Un processo intermittente che provoca "picchi" di lentezza, portando a blocchi.
ja: 断続的な重い処理により「スパイク」が発生し、アニメーションの停止につながっている。
ta: மந்தநிலையின் "கூர்முனைகளை" ஏற்படுத்தும் ஒரு இடைப்பட்ட செயல்முறை, ச்டால்களுக்கு வழிவகுக்கிறது.
zh_hant: 間歇性發生、造成效能「尖峰」導致遊戲卡頓的處理。

source: A slow process that occurs outside of normal gameplay, for instance, when loading a level.
ga: Próiseas mall a tharlaíonn lasmuigh de ghnáthgameplay, mar shampla, agus leibhéal á luchtú.
it: Un processo lento che avviene al di fuori del normale gameplay, ad esempio durante il caricamento di un livello.
ja: レベルをロードするときなど、通常のゲームプレイ以外で発生する重い処理。
ta: சாதாரண விளையாட்டுக்கு வெளியே ஏற்படும் மெதுவான செயல்முறை, உதாரணமாக, ஒரு அளவை ஏற்றும்போது.
zh_hant: 在一般遊戲流程外才出現的慢處理，比如載入關卡時。

source: Each of these are annoying to the user, but in different ways.
ga: Tá gach ceann acu seo cráite don úsáideoir, ach ar bhealaí éagsúla.
it: Ognuno di questi è fastidioso per l'utente, ma in modi diversi.
ja: これらはいずれもユーザーにとって煩わしいものですが、煩わしさの度合いはそれぞれ異なります。
ta: இவை ஒவ்வொன்றும் பயனருக்கு எரிச்சலூட்டுகின்றன, ஆனால் வெவ்வேறு வழிகளில்.
zh_hant: 這些問題都會讓玩家感到困擾，只是方式不同。

source: Measuring performance
ga: feidhmíocht a thomhas
it: Misurare le prestazioni
ja: パフォーマンスの測定
pt_br: Medindo o desempenho
ta: செயல்திறனை அளவிடுதல்
zh_hant: 效能量測

source: Probably the most important tool for optimization is the ability to measure performance - to identify where bottlenecks are, and to measure the success of our attempts to speed them up.
ga: Is dócha gurb é an uirlis is tábhachtaí le haghaidh barrfheabhsú an cumas feidhmíocht a thomhas - chun a aithint cá bhfuil craobhálacha, agus rath ár n-iarrachtaí iad a bhrostú a thomhas.
it: Probabilmente il mezzo più importante per l'ottimizzazione è la capacità di misurare le prestazioni, ovvero di individuare dove si trovano i colli di bottiglia e di misurare il successo dei nostri tentativi di accelerarli.
ja: おそらく、最適化のための最も重要なツールは、パフォーマンスを測定する機能です。つまりボトルネックがどこにあるかを特定し、速度向上の試みが成功したかどうかを測定します。
ta: உகப்பாக்கலுக்கான மிக முக்கியமான கருவி செயல்திறனை அளவிடுவதற்கான திறன் - தடைகள் எங்கே என்பதை அடையாளம் காண்பது, அவற்றை விரைவுபடுத்துவதற்கான எங்கள் முயற்சிகளின் வெற்றியை அளவிடுவது.
zh_hant: 進行效能優化時，最重要的工具就是能夠量測效能：也就是能夠找出瓶頸在哪裡，並評估我們的優化措施是否有效。

source: There are several methods of measuring performance, including:
ga: Tá roinnt modhanna ann chun feidhmíocht a thomhas, lena n-áirítear:
it: Esistono diversi metodi per misurare le prestazioni, tra cui:
ja: パフォーマンスを測定する方法はいくつかあります。
ta: செயல்திறனை அளவிடுவதற்கு பல முறைகள் உள்ளன, அவற்றுள்:
zh_hant: 量測效能有幾種常見方法，包括：

source: Putting a start/stop timer around code of interest.
ga: Uaireadóir tosai/stad a chur timpeall cód spéise.
it: Inserire un timer di avvio/arresto attorno al codice di interesse.
ja: 関心のあるコードの周囲に開始/停止タイマーを配置する。
ta: ஆர்வக் குறியீட்டைச் சுற்றி ஒரு தொடக்க/நிறுத்த டைமரை வைப்பது.
zh_hant: 針對想觀察的程式碼區塊加上啟動／停止計時器。

source: Using the :ref:`Godot profiler <doc_the_profiler>`.
ga: Ag baint úsáide as an :ref:`Godot profiler <doc_the_profiler>`.
it: Utilizzo del :ref:`profiler Godot <doc_the_profiler>`.
ja: :ref:`Godot プロファイラー <doc_the_profiler>` を使用する。
ta: பயன்படுத்துதல்: ref: `கோடோட் சுயவிவரம் <doc_the_profiler>`.
zh_hant: 使用 :ref:`Godot 分析器 <doc_the_profiler>`。

source: Using :ref:`external CPU profilers <doc_using_cpp_profilers>`.
ga: Ag baint úsáide as :ref:`próifíleoirí LAP seachtracha <doc_using_cpp_profilers>`.
it: Utilizzare :ref:`profiler di CPU esterni <doc_using_cpp_profilers>`.
ja: :ref:`外部 CPU プロファイラー <doc_using_cpp_profilers>` を使用する。
ta: பயன்படுத்துதல்: ref: `வெளிப்புற சிபியு சுயவிவரங்கள் <doc_using_cpp_profilers>`.
zh_hant: 使用 :ref:`外部 CPU 分析工具 <doc_using_cpp_profilers>`。

source: Using external GPU profilers/debuggers such as `NVIDIA Nsight Graphics <https://developer.nvidia.com/nsight-graphics>`__, `Radeon GPU Profiler <https://gpuopen.com/rgp/>`__, `PIX <https://devblogs.microsoft.com/pix/download/>`__ (Direct3D 12 only), `Xcode <https://developer.apple.com/documentation/xcode/optimizing-gpu-performance>`__ (Metal only), or `Arm Performance Studio <https://developer.arm.com/Tools%20and%20Software/Arm%20Performance%20Studio>`__.
it: Utilizzare profiler/debugger di GPU esterni come `NVIDIA Nsight Graphics <https://developer.nvidia.com/nsight-graphics>`__, `Radeon GPU Profiler <https://gpuopen.com/rgp/>`__, `PIX <https://devblogs.microsoft.com/pix/download/>`__ (solo Direct3D 12), `Xcode <https://developer.apple.com/documentation/xcode/optimizing-gpu-performance>`__ (solo Metal) o `Arm Performance Studio <https://developer.arm.com/Tools%20and%20Software/Arm%20Performance%20Studio>`__.
zh_hant: 使用外部 GPU 剖析器/偵錯工具, 例如 `NVIDIA Nsight Graphics <https://developer.nvidia.com/nsight-graphics>`__ 、 `Radeon GPU Profiler <https://gpuopen.com/rgp/>`__ 、 `PIX <https://devblogs.microsoft.com/pix/download/>`__ (僅限 Direct3D 12), `Xcode <https://developer.apple.com/documentation/xcode/optimizing-gpu-performance>`__ (僅限 Metal), 或 `Arm Performance Studio <https://developer.arm.com/Tools%20and%20Software/Arm%20Performance%20Studio>`__ 。

source: Checking the frame rate (with V-Sync disabled). Third-party utilities such as `RivaTuner Statistics Server <https://www.guru3d.com/files-details/rtss-rivatuner-statistics-server-download.html>`__ (Windows), `Special K <https://www.special-k.info/>`__ (Windows), or `MangoHud <https://github.com/flightlessmango/MangoHud>`__ (Linux) can also be useful here.
it: Verificare la frequenza dei frame (con V-Sync disattivato). Anche utilità di terze parti come `RivaTuner Statistics Server <https://www.guru3d.com/files-details/rtss-rivatuner-statistics-server-download.html>`__ (Windows), `Special K <https://www.special-k.info/>`__ (Windows) o `MangoHud <https://github.com/flightlessmango/MangoHud>`__ (Linux) possono essere utili.
zh_hant: 檢查影格率 (請關閉 V-Sync)。也可使用第三方工具, 例如 `RivaTuner Statistics Server <https://www.guru3d.com/files-details/rtss-rivatuner-statistics-server-download.html>`__ (Windows), `Special K <https://www.special-k.info/>`__ (Windows), 或 `MangoHud <https://github.com/flightlessmango/MangoHud>`__ (Linux)。

source: Using an unofficial `debug menu add-on <https://github.com/godot-extended-libraries/godot-debug-menu>`__.
ga: Ag baint úsáide as breiseán neamhoifigiúil roghchláir debug <https://github.com/godot-extended-libraries/godot-debug-menu>`__.
it: Utilizzare un `componente aggiuntivo non ufficiale per il menu di debug <https://github.com/godot-extended-libraries/godot-debug-menu>`__.
ja: 非公式の `デバッグメニューアドオン <https://github.com/godot-extended-libraries/godot-debug-menu>`__ を使用する。
ta: அதிகாரப்பூர்வமற்ற `பிழைத்திருத்த மெனுவைப் பயன்படுத்துதல் <https://github.com/godot-extended-libraries/godot-debug-menu> __.
zh_hant: 使用非官方的 `除錯選單擴充外掛 <https://github.com/godot-extended-libraries/godot-debug-menu>`__。

source: Be very aware that the relative performance of different areas can vary on different hardware. It's often a good idea to measure timings on more than one device. This is especially the case if you're targeting mobile devices.
ga: Bí an-eolach go bhféadfadh feidhmíocht choibhneasta réimsí éagsúla athrú ar chrua-earraí Is minic gur smaoineamh maith é ama a thomhas ar níos mó ná gléas amháin. Tá sé seo go háirithe má tá tú ag díriú ar ghléasanna soghluaiste.
it: Si faccia molta attenzione che le prestazioni relative di diverse aree possono variare a seconda dell'hardware. Spesso è consigliabile misurare i tempi su più dispositivi. Questo è particolarmente il caso se si puntano i dispositivi mobili.
ja: 異なる領域の相対的なパフォーマンスは、ハードウェアによって異なる場合があることに注意してください。複数のデバイスで測定することは、多くの場合良いアイデアです。これは特にモバイルデバイスをターゲットにしている場合に当てはまります。
ta: வெவ்வேறு பகுதிகளின் ஒப்பீட்டு செயல்திறன் வெவ்வேறு வன்பொருள்களில் மாறுபடும் என்பதை நன்கு அறிந்து கொள்ளுங்கள். ஒன்றுக்கு மேற்பட்ட சாதனங்களில் நேரங்களை அளவிடுவது பெரும்பாலும் நல்லது. நீங்கள் மொபைல் சாதனங்களை குறிவைக்கிறீர்கள் என்றால் இது குறிப்பாக நிகழ்கிறது.
zh_hant: 要特別注意，不同的硬體設備上，不同區塊的效能表現可能差異很大。建議在多個裝置上量測效能，若目標平台包含行動裝置尤其要注意這點。

source: Limitations
ga: Teorainneacha
it: Limitazioni
ja: 制限事項
pt_br: Limitações
ta: வரம்புகள்
zh_hant: 限制

source: CPU profilers are often the go-to method for measuring performance. However, they don't always tell the whole story.
ga: Is minic gurb iad próifílí LAP an modh chun feidhmíocht a thomhas. Mar sin féin, ní insíonn siad an scéal iomlán i gcónaí.
it: I profiler di CPU sono spesso il metodo di riferimento per misurare le prestazioni. Tuttavia, non raccontano sempre l'intera storia.
ja: CPU プロファイラーは、パフォーマンスを測定するためのよく使われる方法です。ただし必ずしも全体像がわかるわけではありません。
ta: சிபியு சுயவிவரங்கள் பெரும்பாலும் செயல்திறனை அளவிடுவதற்கான முறையாகும். இருப்பினும், அவர்கள் எப்போதும் முழு கதையையும் சொல்ல மாட்டார்கள்.
zh_hant: CPU 分析器通常是效能分析的首選工具，但它們不一定能呈現全部事實。

source: Bottlenecks are often on the GPU, "as a result" of instructions given by the CPU.
ga: Is minic a bhíonn scagail ar an GPU, “mar thoradh” ar threoracha a thugann an LAP.
it: I colli di bottiglia avvengono spesso sulla GPU, "come risultato" delle istruzioni fornite dalla CPU.
ja: CPU によって与えられた命令の「結果的に」、ボトルネックが GPU に発生することがよくあります。
ta: சிபியு வழங்கிய அறிவுறுத்தல்களின் "விளைவாக" சி.பீ.யுவில் பெரும்பாலும் இடையூறுகள் உள்ளன.
zh_hant: 瓶頸也常常會在 GPU，那是 CPU 發出指令後的「結果」。

source: Spikes can occur in the operating system processes (outside of Godot) "as a result" of instructions used in Godot (for example, dynamic memory allocation).
ga: Is féidir le spící tarlú i bpróisis an chórais oibriúcháin (lasmuigh de Godot) “mar thoradh” ar threoracha a úsáidtear i Godot (mar shampla, leithdháileadh dinimiciúil cuimhne).
it: I picchi possono avvenire nei processi del sistema operativo (fuori da Godot) "come risultato" delle istruzioni utilizzate in Godot (ad esempio, l'allocazione dinamica della memoria).
ja: Godot で使用される命令 (たとえば動的メモリ割り当て) の「結果的に」、OSのプロセス (Godot 外部) でスパイクが発生する可能性があります。
ta: கோடோட்டில் பயன்படுத்தப்படும் அறிவுறுத்தல்களின் இயக்க முறைமை செயல்முறைகளில் (கோடோட்டுக்கு வெளியே) "இதன் விளைவாக" கூர்முனை ஏற்படலாம் (எடுத்துக்காட்டாக, மாறும் நினைவக ஒதுக்கீடு).
zh_hant: 有些效能尖峰，其實是在作業系統層級（Godot 之外）發生，是 Godot 執行某些操作（例如動態記憶體配置）後的「結果」。

source: You may not always be able to profile specific devices like a mobile phone due to the initial setup required.
ga: B'fhéidir nach mbeidh tú in ann gléasanna ar leith a phróifíliú i gcónaí ar nós fón póca mar gheall ar an socrú tosaigh a theastaíonn.
it: Potrebbe non essere sempre possibile profilare un dispositivo specifico, come un telefono cellulare, a causa della configurazione iniziale richiesta.
ja: 初期設定が必要なため、携帯電話などの特定のデバイスのプロファイルを作成できない場合があります。
ta: தேவையான ஆரம்ப அமைப்பு காரணமாக மொபைல் போன் போன்ற குறிப்பிட்ட சாதனங்களை நீங்கள் எப்போதும் சுயவிவரப்படுத்த முடியாது.
zh_hant: 由於初始設定繁複，你不一定能隨時在特定裝置（例如手機）做效能分析。

source: You may have to solve performance problems that occur on hardware you don't have access to.
ga: B'fhéidir go mbeidh ort fadhbanna feidhmíochta a tharlaíonn ar chrua-earraí nach bhfuil rochtain agat orthu a réiteach.
it: Potrebbe essere necessario risolvere problemi di prestazioni che occorrono su hardware a cui non si ha accesso.
ja: アクセスできないハードウェアで発生するパフォーマンスの問題を解決しなければならない場合があります。
ta: உங்களுக்கு அணுகல் இல்லாத வன்பொருளில் நிகழும் செயல்திறன் சிக்கல்களை நீங்கள் தீர்க்க வேண்டியிருக்கும்.
zh_hant: 有時你甚至得解決那些你手邊沒有的硬體上發生的效能問題。

source: As a result of these limitations, you often need to use detective work to find out where bottlenecks are.
ga: Mar thoradh ar na teorainneacha seo, is minic go gcaithfidh tú obair bhleachtaire a úsáid chun a fháil amach cá bhfuil craobhálacha.
ja: これらの制限の結果として、ボトルネックがどこにあるかを見つけるために探偵のような調査が必要になることがよくあります。
ta: இந்த வரம்புகளின் விளைவாக, இடையூறுகள் எங்கே என்பதைக் கண்டறிய நீங்கள் பெரும்பாலும் துப்பறியும் வேலையைப் பயன்படுத்த வேண்டும்.
zh_hant: 因此，你往往需要靠「偵探式」的排查手法來找出瓶頸所在。

source: Detective work
ga: Obair bleachtaire
it: Lavoro investigativo
ja: 探偵のような調査
pt_br: Trabalho de detetive
ta: துப்பறியும் வேலை
zh_hant: 偵探式排查

source: Detective work is a crucial skill for developers (both in terms of performance, and also in terms of bug fixing). This can include hypothesis testing, and binary search.
ga: Is scil ríthábhachtach d’fhorbróirí í obair bhleachtaireachta (i dtéarmaí feidhmíochta, agus freisin i dtéarmaí fabhtanna a shocrú). D’fhéadfadh tástáil hipitéise, agus cuardach dénártha a bheith i gceist leis seo.
it: Il lavoro investigativo è un'abilità cruciale per gli sviluppatori (in termini sia di prestazioni sia di correzione dei bug). Questo può includere valutazione delle ipotesi e ricerca binaria.
ja: 探偵のような調査は、開発者にとって非常に重要なスキルです (パフォーマンス改善の際でも、バグ修正の際でも)。これには仮説検証や二分検索が含まれます。
ta: துப்பறியும் பணி டெவலப்பர்களுக்கு ஒரு முக்கியமான திறமையாகும் (செயல்திறன் அடிப்படையில், மற்றும் பிழை சரிசெய்தல் அடிப்படையில்). இதில் கருதுகோள் சோதனை மற்றும் பைனரி தேடல் ஆகியவை அடங்கும்.
zh_hant: 偵探式排查對開發者而言非常重要，不只用在效能問題，也常用於除錯。這包括假設驗證和二分搜尋法。

source: Hypothesis testing
ga: Tástáil hipitéis
it: Valutazione delle ipotesi
ja: 仮説と検証
pt_br: Teste de hipóteses
ta: கருதுகோள் சோதனை
zh_hant: 假設驗證

source: Say, for example, that you believe sprites are slowing down your game. You can test this hypothesis by:
ga: Abair, mar shampla, go gcreideann tú go bhfuil sprites ag moilliú ar do chluiche. Is féidir leat an hipitéis seo a thástáil trí:
it: Supponiamo, ad esempio, che si creda che gli sprite rallentino il gioco. È possibile verificare questa ipotesi:
ja: たとえば、スプライトがゲームの速度を低下させていると考えているとします。この仮説は次のようにして検証できます:
ta: உதாரணமாக, உருவங்கள் உங்கள் விளையாட்டை மெதுவாக்குகின்றன என்று நீங்கள் நம்புகிறீர்கள் என்று சொல்லுங்கள். இந்த கருதுகோளை நீங்கள் சோதிக்கலாம்:
zh_hant: 假設你懷疑遊戲慢是因為精靈（Sprite）太多，可以這麼驗證：

source: Measuring the performance when you add more sprites, or take some away.
ga: An fheidhmíocht a thomhas nuair a chuireann tú níos mó sprites leis, nó nuair a thógann tú cuid acu.
it: Misurando le prestazioni quando si aggiungono o si rimuovono più sprite.
ja: スプライトを追加したり、いくつか削除したりしたときのパフォーマンスの変化を測定します。
ta: நீங்கள் அதிக உருவங்களைச் சேர்க்கும்போது செயல்திறனை அளவிடுதல், அல்லது சிலவற்றை எடுத்துச் செல்லுங்கள்.
zh_hant: 嘗試增加或減少精靈數量，觀察效能變化。

source: This may lead to a further hypothesis: does the size of the sprite determine the performance drop?
ga: D'fhéadfadh hipitéis breise a bheith mar thoradh air seo: an gcinneann méid an sprite an titim feidhmíochta?
it: Ciò potrebbe portare a un'ulteriore ipotesi: la dimensione dello sprite determina il calo delle prestazioni?
ja: これはさらなる仮説につながるかもしれません: スプライトのサイズによってパフォーマンスの低下が起きるかも？
ta: இது மேலும் கருதுகோளுக்கு வழிவகுக்கும்: ச்பிரிட்டின் அளவு செயல்திறன் வீழ்ச்சியை தீர்மானிக்கிறதா?
zh_hant: 這又引發新假設：是否精靈圖片尺寸越大，效能掉越多？

source: You can test this by keeping everything the same, but changing the sprite size, and measuring performance.
ga: Is féidir leat é seo a thástáil trí gach rud a choinneáil mar an gcéanna, ach méid an sprite a athrú, agus feidhmíocht a thomhas.
it: È possibile verificarlo mantenendo tutto lo stesso, ma cambiando le dimensioni dello sprite e misurando le prestazioni.
ja: これを検証するには、スプライトのサイズを変更し、パフォーマンスを測定します。
ta: எல்லாவற்றையும் ஒரே மாதிரியாக வைத்திருப்பதன் மூலமும், ச்பிரிட் அளவை மாற்றுவதன் மூலமும், செயல்திறனை அளவிடுவதன் மூலமும் இதைச் சோதிக்கலாம்.
zh_hant: 那就只改變精靈尺寸，保持其他條件不變，然後量測效能來驗證。

source: Binary search
ga: Cuardach dénártha
it: Ricerca binaria
ja: 二分探索
pt_br: Pesquisa binária
ta: இருமுத் தேடல்
zh_hant: 二分搜尋法

source: If you know that frames are taking much longer than they should, but you're not sure where the bottleneck lies. You could begin by commenting out approximately half the routines that occur on a normal frame. Has the performance improved more or less than expected?
ga: Má tá a fhios agat go bhfuil frámaí ag tógáil i bhfad níos faide ná mar ba chóir, ach níl tú cinnte cá bhfuil an tranglam. D'fhéadfá tús a chur le tuairim a leath de na gnáthaimh a tharlaíonn ar ghnáthfhráma. Ar tháinig feabhas ar an bhfeidhmíocht níos mó nó níos lú ná mar a bhíothas ag súil leis?
it: Se è noto che i frame impiegano molto più tempo del previsto, ma non si è sicuri di dove si trovi il collo di bottiglia, si potrebbe iniziare commentando circa la metà delle routine che avvengono su un frame normale. Le prestazioni sono migliorate più o meno del previsto?
ja: フレームに必要以上に時間がかかっていることはわかっているものの、ボトルネックがどこにあるか分からない場合は、まず通常のフレームで発生するルーチンの約半分をコメントアウトしてみます。パフォーマンスは予想よりも向上しましたか、それとも期待通りのパフォーマンスは出ませんでしたか？
ta: பிரேம்கள் அவற்றை விட அதிக நேரம் எடுக்கும் என்பது உங்களுக்குத் தெரிந்தால், ஆனால் சிக்கல் எங்கே என்று உங்களுக்குத் தெரியவில்லை. ஒரு சாதாரண சட்டகத்தில் நிகழும் ஏறக்குறைய பாதி நடைமுறைகளை கருத்துத் தெரிவிப்பதன் மூலம் நீங்கள் தொடங்கலாம். செயல்திறன் எதிர்பார்த்ததை விட அதிகமாகவோ அல்லது குறைவாகவோ மேம்பட்டதா?
zh_hant: 如果你知道每幀花的時間明顯超過預期，但不確定是哪裡出問題，可以先把一半的主要處理程式碼註解掉，然後觀察效能提升幅度是否如預期?
