Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/gpu_optimization.po
Languages: ga, it, ja, pt_br, ru, ta, zh_tw

source: In general, you should design your game for the lowest common denominator, then add optional enhancements for more powerful platforms. For example, you may want to use the Compatibility rendering method for both desktop and mobile platforms where you target both.
ga: Go ginearálta, ba chóir duit do chluiche a dhearadh don ainmneoir coitianta is ísle, ansin feabhsuithe roghnacha a chur leis le haghaidh ardáin níos cumhachtaí. Mar shampla, b'fhéidir gur mhaith leat an modh rindreála Comhoiriúnachta a úsáid le haghaidh ardáin deisce agus soghluaiste araon a ndíreoidh tú orthu araon.
ja: 一般的にゲームは最低限の共通基準で設計し、その後より強力なプラットフォーム向けにオプションの機能強化を追加する必要があります。たとえばデスクトップ プラットフォームとモバイル プラットフォームの両方をターゲットにする場合は、両方に互換性レンダラーを使用するとよいでしょう。
ru: В целом, следует разрабатывать игру, ориентируясь на наименьший общий знаменатель, а затем добавлять дополнительные улучшения для более мощных платформ. Например, можно использовать метод рендеринга совместимости как для настольных компьютеров, так и для мобильных платформ, если вы ориентируетесь на обе платформы.
ta: பொதுவாக, உங்கள் விளையாட்டை மிகக் குறைந்த பொதுவான வகுப்பிற்கு வடிவமைக்க வேண்டும், பின்னர் அதிக சக்திவாய்ந்த தளங்களுக்கு விருப்ப மேம்பாடுகளைச் சேர்க்க வேண்டும். எடுத்துக்காட்டாக, நீங்கள் இரண்டையும் குறிவைக்கும் டெச்க்டாப் மற்றும் மொபைல் தளங்களுக்கு பொருந்தக்கூடிய வழங்குதல் முறையைப் பயன்படுத்த விரும்பலாம்.
zh_tw: 一般來說，應以最低通用規格設計遊戲，再針對高階平台額外加入進階特效。例如，若同時支援桌面與行動平台，可考慮都採用「相容性算繪模式」來確保效能。

source: Mobile/tiled renderers
ga: Rendeoirí soghluaiste/tíleáilte
ja: モバイル / タイルベースレンダラー
ru: Мобильные/плиточные рендереры
ta: மொபைல்/டைல்ட் ரெண்டரர்கள்
zh_tw: 行動裝置／圖塊式算繪器

source: As described above, GPUs on mobile devices work in dramatically different ways from GPUs on desktop. Most mobile devices use tile renderers. Tile renderers split up the screen into regular-sized tiles that fit into super fast cache memory, which reduces the number of read/write operations to the main memory.
ga: Mar a thuairiscítear thuas, oibríonn GPUanna ar ghléasanna soghluaiste ar bhealaí an-difriúil ó GPUanna ar an deasc. Úsáideann an chuid is mó de ghléasanna soghluaiste rindreálaithe tíl. Roinneann rindreálaithe tíl an scáileán ina tíleanna gnáthmhéide a luíonn isteach i gcuimhne taisce thar a bheith gasta, rud a laghdaíonn líon na n-oibríochtaí léite/scríbhneoireachta go dtí an príomhchuimhne.
ja: 上で説明したように、モバイルデバイスの GPU はデスクトップの GPU とは大きく異なる方法で動作します。ほとんどのモバイルデバイスはタイルベースレンダラーを使用します。タイルベースレンダラーは画面を超高速キャッシュ メモリに収まる通常サイズのタイルに分割し、メインメモリへの読み取り/書き込み操作の回数を減らします。
ru: Как уже было сказано, графические процессоры мобильных устройств работают совершенно иначе, чем графические процессоры настольных компьютеров. Большинство мобильных устройств используют тайловые рендереры. Тайловые рендереры разбивают экран на плитки стандартного размера, помещающиеся в сверхбыструю кэш-память, что сокращает количество операций чтения/записи в основную память.
ta: மேலே விவரிக்கப்பட்டுள்ளபடி, மொபைல் சாதனங்களில் உள்ள சி.பீ.யுகள் டெச்க்டாப்பில் சி.பீ.யுகளிலிருந்து வியத்தகு முறையில் வேறுபட்ட வழிகளில் செயல்படுகின்றன. பெரும்பாலான மொபைல் சாதனங்கள் ஓடு ரெண்டரர்களைப் பயன்படுத்துகின்றன. டைல் ரெண்டரர்கள் திரையை வழக்கமான அளவிலான ஓடுகளாகப் பிரிக்கின்றன, அவை சூப்பர் ஃபாச்ட் கேச் நினைவகத்துடன் பொருந்துகின்றன, இது முதன்மையான நினைவகத்திற்கு வாசிப்பு/எழுதும் செயல்பாடுகளின் எண்ணிக்கையை குறைக்கிறது.
zh_tw: 如前所述，行動裝置的 GPU 運作機制與桌機大不相同。多數行動裝置採用圖塊式算繪器（Tile Renderer），將螢幕劃分為固定大小的區塊並存入快取，以減少對主記憶體的讀寫次數。

source: There are some downsides though. Tiled rendering can make certain techniques much more complicated and expensive to perform. Tiles that rely on the results of rendering in different tiles or on the results of earlier operations being preserved can be very slow. Be very careful to test the performance of shaders, viewport textures and post processing.
ga: Tá roinnt míbhuntáistí ann áfach. Is féidir le rindreáil tíleach teicnící áirithe a dhéanamh i bhfad níos casta agus níos costasaí a dhéanamh. Is féidir le tíleanna a bhíonn ag brath ar thorthaí rindreála i dtíleanna éagsúla nó ar thorthaí oibríochtaí níos luaithe atá á chaomhnú a bheith an-mhall. Bí an-chúramach chun feidhmíocht scáthóirí, uigeachtaí viewport agus iar-phróiseáil a thástáil.
ja: ただし欠点もあります。タイルベースレンダリングでは、特定のテクニックの実行がはるかに複雑になり、コストも高くなります。異なるタイルでのレンダリング結果や、以前の操作の結果が保持されることに依存するタイルは、非常に遅くなる可能性があります。シェーダー、ビューポートテクスチャ、および後処理のパフォーマンスをテストするときは、細心の注意を払ってください。
ru: Однако есть и недостатки. Плиточный рендеринг может значительно усложнить и удорожить реализацию некоторых техник. Плиточные модели, использующие результаты рендеринга в разных тайлах или сохраняемые результаты предыдущих операций, могут работать очень медленно. Будьте особенно внимательны при тестировании производительности шейдеров, текстур области просмотра и постобработки.
ta: சில தீமைகள் உள்ளன. டைல்ட் வழங்குதல் சில நுட்பங்களை மிகவும் சிக்கலானதாகவும், செய்ய விலை உயர்ந்ததாகவும் மாற்றும். வெவ்வேறு ஓடுகளில் வழங்குதல் செய்வதன் முடிவுகளை நம்பியிருக்கும் ஓடுகள் அல்லது முந்தைய செயல்பாடுகளின் முடிவுகள் மிகவும் மெதுவாக இருக்கும். சேடர்கள், வியூபோர்ட் அமைப்புகள் மற்றும் பிந்தைய செயலாக்கத்தின் செயல்திறனை சோதிக்க மிகவும் கவனமாக இருங்கள்.
zh_tw: 但圖塊式算繪也有缺點，某些技術會變得更複雜且低效。若圖塊之間需要互相依賴（如跨圖塊運算）或必須保留前一輪算繪結果，效能會大幅降低。因此，請務必仔細測試著色器、視窗紋理與後製效果在行動裝置上的效能表現。

source: In 2D, the costs of treating each item individually can be prohibitively high - there can easily be thousands of them on the screen. This is why 2D *batching* is used. Multiple similar items are grouped together and rendered in a batch, via a single draw call, rather than making a separate draw call for each item. In addition, this means state changes, material and texture changes can be kept to a minimum.
ru: В 2D-графике затраты на обработку каждого объекта по отдельности могут быть чрезмерно высокими — на экране их могут легко быть тысячи. Именно поэтому используется 2D-*batching* (пакетирование). Несколько похожих объектов группируются и визуализируются в пакете одним вызовом отрисовки, а не отдельными вызовами отрисовки для каждого объекта. Кроме того, это позволяет свести к минимуму изменения состояний, материалов и текстур.

source: There is also a cost to batching together objects in 3D. Several objects rendered as one cannot be individually culled. An entire city that is off-screen will still be rendered if it is joined to a single blade of grass that is on screen. Thus, you should always take objects' locations and culling into account when attempting to batch 3D objects together. Despite this, the benefits of joining static objects often outweigh other considerations, especially for large numbers of distant or low-poly objects.
ru: Объединение объектов в 3D также имеет свои издержки. Несколько объектов, отрисованных как один, нельзя отсечь по отдельности. Целый город, находящийся за пределами экрана, всё равно будет отрисован, если его присоединить к одной травинке на экране. Поэтому при объединении 3D-объектов всегда следует учитывать местоположение объектов и их отсечку. Несмотря на это, преимущества объединения статичных объектов часто перевешивают другие соображения, особенно для большого количества удалённых или низкополигональных объектов.
