Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/gpu_optimization.po
Languages: ga, it, ja, pt_br, ru, ta, zh_tw

source: Pixel cost versus vertex cost
ga: Costas picteilín i gcoinne costas vertex
ja: ピクセル計算コスト vs 頂点計算コスト
ru: Стоимость пикселя против стоимости вершины
ta: படப்புள்ளி செலவு மற்றும் வெர்டெக்ச் செலவு
zh_tw: 像素成本 vs 頂點成本

source: You may have heard that the lower the number of polygons in a model, the faster it will be rendered. This is *really* relative and depends on many factors.
ga: B'fhéidir gur chuala tú gur ísle líon na bpolagóin i samhail, is amhlaidh is tapa a dhéanfar é. Tá seo* i ndáiríre* coibhneasta agus braitheann sé ar go leor fachtóirí.
ja: モデル内のポリゴン数が少ないほどレンダリングが速くなると聞いたことがあるかもしれません。これは実際には相対的なものであり、多くの要因に影響されます。
ru: Возможно, вы слышали, что чем меньше полигонов в модели, тем быстрее она будет визуализироваться. Это *действительно* относительно и зависит от многих факторов.
ta: ஒரு மாதிரியில் உள்ள பலகோணங்களின் எண்ணிக்கை குறைவாக இருப்பதால், அது வேகமாக வழங்கப்படும் என்று நீங்கள் கேள்விப்பட்டிருக்கலாம். இது * உண்மையில் * உறவினர் மற்றும் பல காரணிகளைப் பொறுத்தது.
zh_tw: 你可能聽說過模型的多邊形數越少，算繪速度就越快。這事實上只是 *相對而言*，還牽涉許多其他因素。

source: On a modern PC and console, vertex cost is low. GPUs originally only rendered triangles. This meant that every frame:
ga: Ar ríomhaire agus consól nua-aimseartha, tá costas vertex íseal. Ní rinneadh GPUanna ach triantáin ar dtús. Chiallaigh sé seo go raibh gach fráma:
ja: 現代の PC やコンソールでは、頂点の計算コストは低くなっています。GPU はもともと三角形のみをレンダリングしていました。つまり、すべてのフレームで次のようになります:
ru: На современных ПК и консолях стоимость вершин низкая. Изначально графические процессоры рендерили только треугольники. Это означало, что каждый кадр:
ta: நவீன பிசி மற்றும் கன்சோலில், வெர்டெக்ச் செலவு குறைவாக உள்ளது. சி.பீ.யுகள் முதலில் முக்கோணங்களை மட்டுமே வழங்கின. இதன் பொருள் ஒவ்வொரு சட்டகமும்:
zh_tw: 在現代 PC 與主機上，頂點成本其實很低。早期的 GPU 只算繪三角形，這意謂著每個影格：

source: All vertices had to be transformed by the CPU (including clipping).
ga: B'éigean leis an LAP gach beart a athrú (lena n-áirítear gearradh).
ja: すべての頂点は CPU によってトランスフォーム処理される必要がありました (クリッピングを含む)。
ru: Все вершины должны были быть преобразованы центральным процессором (включая обрезку).
ta: அனைத்து செங்குத்துகளும் சிபியு ஆல் மாற்றப்பட வேண்டியிருந்தது (கிளிப்பிங் உட்பட).
zh_tw: 所有頂點都必須由 CPU 處理（包括裁切/clipping）。

source: All vertices had to be sent to the GPU memory from the main RAM.
ga: B'éigean go léir a sheoladh chuig cuimhne an GPU ón bpríomh-RAM.
ja: すべての頂点をメインメモリから GPU メモリに送信する必要がありました。
ru: Все вершины необходимо было отправить в память графического процессора из основной оперативной памяти.
ta: அனைத்து செங்குத்துகளையும் முதன்மையான ரேமிலிருந்து சி.பீ.யூ நினைவகத்திற்கு அனுப்ப வேண்டியிருந்தது.
zh_tw: 所有頂點都必須從主記憶體傳送到 GPU 記憶體。

source: Nowadays, all this is handled inside the GPU, greatly increasing performance. 3D artists usually have the wrong feeling about polycount performance because 3D modeling software (such as Blender, 3ds Max, etc.) need to keep geometry in CPU memory for it to be edited, reducing actual performance. Game engines rely on the GPU more, so they can render many triangles much more efficiently.
ga: Sa lá atá inniu ann, déantar é seo go léir a láimhseáil taobh istigh den GPU, ag méadú go mór feidhmíocht. Is gnách go mbíonn an mothú mícheart ag ealaíontóirí 3D faoi fheidhmíocht polycount toisc go gcaithfidh bogearraí samhaltaithe 3D (mar Blender, 3ds Max, srl.) Coiméadracht a choinneáil i gcuimhne LAP chun é a chur in eagar, Braitheann innill cluiche níos mó ar an GPU, ionas gur féidir leo go leor triantáin a thabhairt i bhfad níos éifeachtaí.
ja: 現在、これらすべてが GPU 内で処理されるため、パフォーマンスが大幅に向上しています。3D アーティストは、ポリゴン数のパフォーマンスについて誤った認識を持っていることがよくあります。これは 3D DCCソフト (Blender、3ds Max など) では、ジオメトリを編集するために CPU メモリ内に保持する必要があり、実際のパフォーマンスが低下するためです。ゲーム エンジンは GPU に大きく依存するため、多くの三角形をより効率的にレンダリングできます。
ru: В настоящее время всё это обрабатывается графическим процессором, что значительно повышает производительность. 3D-художники часто ошибочно оценивают производительность, связанную с количеством полигонов, поскольку программы для 3D-моделирования (такие как Blender, 3ds Max и т. д.) вынуждены хранить геометрию в памяти процессора для её редактирования, что снижает производительность. Игровые движки больше полагаются на графический процессор, поэтому они могут гораздо эффективнее рендерить множество треугольников.
ta: இப்போதெல்லாம், இவை அனைத்தும் சி.பீ.யுவுக்குள் கையாளப்படுகின்றன, செயல்திறனை பெரிதும் அதிகரிக்கின்றன. 3D கலைஞர்கள் வழக்கமாக பாலிகவுண்ட் செயல்திறனைப் பற்றி தவறான உணர்வைக் கொண்டுள்ளனர், ஏனெனில் 3D மாடலிங் மென்பொருள் (பிளெண்டர், 3DS மேக்ச் போன்றவை போன்றவை) சிபியு நினைவகத்தில் வடிவவியலைத் திருத்த வேண்டும், உண்மையான செயல்திறனைக் குறைக்கிறது. கேம் என்சின்கள் சி.பீ.யை அதிகம் நம்பியுள்ளன, எனவே அவை பல முக்கோணங்களை மிகவும் திறமையாக வழங்க முடியும்.
zh_tw: 現在這一切都在 GPU 內部處理，效能大幅提升。3D 美術常誤以為多邊形數會嚴重拖慢效能，是因為 3D 建模軟體（如 Blender、3ds Max 等）為了編輯方便，必須將幾何資料留在 CPU 記憶體，導致效能較差。遊戲引擎則大多將運算交由 GPU，因此可更高效地算繪大量三角形。

source: On mobile devices, the story is different. PC and console GPUs are brute-force monsters that can pull as much electricity as they need from the power grid. Mobile GPUs are limited to a tiny battery, so they need to be a lot more power efficient.
ga: Ar ghléasanna soghluaiste, tá an scéal difriúil. Is arrachtaigh brúth-fhórsa iad GPUanna ríomhaire agus consól ar féidir leo an oiread leictreachais agus is gá dóibh a tharraingt ón eangach cumhachta. Tá GPUanna soghluaiste teoranta do cheallraí beag bídeach, mar sin caithfidh siad a bheith i bhfad níos éifeachtaí le cumhacht.
ja: モバイル デバイスでは、話は異なります。PC やコンソールの GPU は、電力網から必要なだけの電力を引き出すことができる強力なモンスターです。モバイル GPU は小さなバッテリーに制限されているため、電力効率を高める必要があります。
ru: На мобильных устройствах ситуация иная. Видеокарты для ПК и консолей — это мощные монстры, способные потреблять из электросети столько электроэнергии, сколько им нужно. Мобильные видеокарты ограничены крошечным аккумулятором, поэтому им нужно быть гораздо более энергоэффективными.
ta: மொபைல் சாதனங்களில், கதை வேறுபட்டது. பிசி மற்றும் கன்சோல் சி.பீ.யுகள் மிருகத்தனமான-சக்தி அரக்கர்கள், அவை மின் கட்டத்திலிருந்து தேவையான அளவுக்கு மின்சாரத்தை இழுக்க முடியும். மொபைல் சி.பீ.யுகள் ஒரு சிறிய பேட்டரியுக்கு மட்டுமே வரையறுக்கப்பட்டுள்ளன, எனவே அவை அதிக ஆற்றல் திறமையாக இருக்க வேண்டும்.
zh_tw: 在行動裝置上則不同。PC 和主機的 GPU 可以無限制地從電網取得電力，屬於高效能型；而行動 GPU 受限於小型電池，必須極度講究效能與耗能。

source: To be more efficient, mobile GPUs attempt to avoid *overdraw*. Overdraw occurs when the same pixel on the screen is being rendered more than once. Imagine a town with several buildings. GPUs don't know what is visible and what is hidden until they draw it. For example, a house might be drawn and then another house in front of it (which means rendering happened twice for the same pixel). PC GPUs normally don't care much about this and just throw more pixel processors to the hardware to increase performance (which also increases power consumption).
ga: Chun a bheith níos éifeachtaí, déanann GPUanna soghluaiste iarracht *rótharraingt* a sheachaint. Tarlaíonn rótharraingt nuair a bhíonn na picteilíní céanna ar an scáileán á rindreáil níos mó ná uair amháin. Samhlaigh baile le roinnt foirgneamh. Níl a fhios ag GPUanna cad atá le feiceáil agus cad atá i bhfolach go dtí go dtarraingíonn siad é. Mar shampla, d'fhéadfadh teach a tharraingt agus ansin teach eile os a chomhair (rud a chiallaíonn gur tharla rindreáil dhá uair don picteilín céanna). De ghnáth ní bhíonn mórán cúraim ag GPUanna PC faoi seo agus caitheann siad níos mó próiseálaithe picteilín chuig na crua-earraí chun feidhmíocht a mhéadú (a mhéadaíonn tomhaltas cumhachta freisin).
ja: モバイル GPU は効率を上げるために、*オーバードロー* を回避しようとします。オーバードローは画面上の同じピクセルが何回もレンダリングされるときに発生します。建物がいくつかある町を想像してください。GPU は描画するまで何が見えていて何が隠れているかを知りません。たとえば家が描画された後、その前に別の家が描画されることがあります (つまり、同じピクセルに対して 2 回のレンダリングが行われたことになります)。PC の GPU は通常、この点をあまり気にせず、ハードウェアにピクセル プロセッサを追加してパフォーマンスを向上させます (これにより、消費電力も増加します)。
ru: Чтобы быть более эффективными, мобильные графические процессоры стараются избегать *overdraw*. Перерисовка происходит, когда один и тот же пиксель на экране отображается более одного раза. Представьте себе город с несколькими зданиями. Графические процессоры не знают, что является видимым, а что скрытым, пока не отрисуют его. Например, может быть нарисован дом, а затем ещё один дом перед ним (что означает, что рендеринг одного и того же пикселя происходит дважды). Графические процессоры ПК обычно не слишком заботятся об этом и просто добавляют больше пиксельных процессоров, чтобы увеличить производительность (что также увеличивает энергопотребление).
ta: மிகவும் திறமையாக இருக்க, மொபைல் சி.பீ.யுகள் *ஓவர் டிரா *ஐ தவிர்க்க முயற்சிக்கின்றன. திரையில் அதே படப்புள்ளி ஒன்றுக்கு மேற்பட்ட முறை வழங்கப்படும்போது ஓவர் டிரா ஏற்படுகிறது. பல கட்டிடங்களைக் கொண்ட ஒரு நகரத்தை கற்பனை செய்து பாருங்கள். சி.பீ.யுகளுக்கு என்ன தெரியும், அவர்கள் அதை வரையும் வரை மறைக்கப்பட்டவை என்று தெரியவில்லை. உதாரணமாக, ஒரு வீடு வரையப்படலாம், பின்னர் அதன் முன் மற்றொரு வீடு (அதாவது வழங்குதல் ஒரே பிக்சலுக்கு இரண்டு முறை நடந்தது). பிசி சி.பீ.யுகள் பொதுவாக இதைப் பற்றி அதிகம் கவலைப்படுவதில்லை, மேலும் செயல்திறனை அதிகரிக்க அதிக படப்புள்ளி செயலிகளை வன்பொருளுக்கு எறிந்து விடுங்கள் (இது மின் நுகர்வு அதிகரிக்கிறது).
zh_tw: 為了提升效率，行動 GPU 會盡量避免 *重複繪製（overdraw）*。所謂 overdraw，是指螢幕上同一像素被多次算繪。例如一個小鎮有多棟建築，GPU 無法預先知道哪些遮擋哪些，必須先算繪後判斷。假設一棟房子先被畫出來，後又有另一棟房子在前方遮住，導致同一像素被算繪兩次。PC GPU 通常不太在意這點，只要加更多像素處理器來彌補（但會消耗更多電力）。

source: Using more power is not an option on mobile so mobile devices use a technique called *tile-based rendering* which divides the screen into a grid. Each cell keeps the list of triangles drawn to it and sorts them by depth to minimize *overdraw*. This technique improves performance and reduces power consumption, but takes a toll on vertex performance. As a result, fewer vertices and triangles can be processed for drawing.
ga: Ní rogha é níos mó cumhachta a úsáid ar soghluaiste mar sin úsáideann gléasanna soghluaiste teicníc ar a dtugtar rinneadh bunaithe ar tíle* a roinneann an scáileán ina eangach. Coinníonn gach cill liosta na dtriantáin a tharraingítear chuige agus déanann sé iad a shórtáil de réir doimhneachta chun * rótharraing* a íoslaghd Feabhsaíonn an teicníc seo feidhmíocht agus laghdaíonn sé tomhaltas cumhachta, ach glacann sé dola ar fheidhmíocht Mar thoradh air sin, is féidir níos lú vertices agus triantáin a phróiseáil le haghaidh líníochta.
ja: モバイル デバイスでは電力を多く使うことはできないため、画面をグリッドに分割する *タイル ベースレンダリング* と呼ばれる手法が採用されています。各セルには描画された三角形のリストが保持され、深度によって並べ替えられるため、*オーバードロー* を最小限に抑えることができます。この手法によりパフォーマンスが向上し、電力消費が削減されますが、頂点のパフォーマンスが低下します。その結果、描画処理できる頂点と三角形の数は少なくなります。
ru: Использование большего количества ресурсов на мобильных устройствах невозможно, поэтому они используют технологию, называемую *плиточным рендерингом*, которая делит экран на сетку. Каждая ячейка хранит список отрисованных на ней треугольников и сортирует их по глубине для минимизации *перерисовки*. Эта технология повышает производительность и снижает энергопотребление, но снижает производительность обработки вершин. В результате для отрисовки обрабатывается меньше вершин и треугольников.
ta: அதிக சக்தியைப் பயன்படுத்துவது மொபைலில் ஒரு விருப்பமல்ல, எனவே மொபைல் சாதனங்கள் * ஓடு அடிப்படையிலான வழங்குதல் * எனப்படும் நுட்பத்தைப் பயன்படுத்துகின்றன, இது திரையை ஒரு கட்டமாக பிரிக்கிறது. ஒவ்வொரு கலமும் அதில் வரையப்பட்ட முக்கோணங்களின் பட்டியலை வைத்திருக்கிறது மற்றும் *ஓவர் டிரா *ஐக் குறைக்க ஆழத்தால் அவற்றை வரிசைப்படுத்துகிறது. இந்த நுட்பம் செயல்திறனை மேம்படுத்துகிறது மற்றும் மின் நுகர்வு குறைக்கிறது, ஆனால் வெர்டெக்ச் செயல்திறனை பாதிக்கிறது. இதன் விளைவாக, குறைந்த செங்குத்துகள் மற்றும் முக்கோணங்களை வரைபடத்திற்கு செயலாக்க முடியும்.
zh_tw: 在行動裝置上無法無限制用電，因此大多採用 *圖塊式算繪（Tile-based rendering）* 技術，將螢幕劃分為網格，每個格子會記錄哪些三角形要繪製，並根據深度排序以減少 overdraw。這種技術提升了效能並降低功耗，但會犧牲頂點處理效能，導致每次可算繪的頂點與三角形數量變少。

source: Additionally, tile-based rendering struggles when there are small objects with a lot of geometry within a small portion of the screen. This forces mobile GPUs to put a lot of strain on a single screen tile, which considerably decreases performance as all the other cells must wait for it to complete before displaying the frame.
ga: Ina theannta sin, bíonn rindreáil bunaithe ar tíleanna ag streachailt nuair a bhíonn rudaí beaga le go leor geoiméadair laistigh de chuid beag den scáileán. Cuireann sé seo iallach ar GPUanna soghluaiste go leor brú a chur ar tíl scáileáin amháin, rud a laghdaíonn feidhmíocht go mór toisc go gcaithfidh na cealla eile go léir fanacht go gcríochnóidh sé sula dtaispeántar an fráma.
ja: さらにタイルベースのレンダリングは、画面の小さな領域に多くのジオメトリを持つ小さなオブジェクトがある場合に問題が生じます。これにより、モバイル GPU は 1 つの画面タイルに多大な負荷をかけることになり、他のすべてのセルはフレームを表示する前にタイルの完了を待たなければならないため、パフォーマンスが大幅に低下します。
ru: Кроме того, тайловый рендеринг испытывает трудности, когда на небольшом участке экрана находятся мелкие объекты с большим количеством геометрических элементов. Это вынуждает мобильные графические процессоры создавать большую нагрузку на один тайл экрана, что значительно снижает производительность, поскольку все остальные ячейки должны ждать его завершения, прежде чем отобразить кадр.
ta: கூடுதலாக, திரையின் ஒரு சிறிய பகுதிக்குள் நிறைய வடிவவியலுடன் சிறிய பொருள்கள் இருக்கும்போது ஓடு அடிப்படையிலான வழங்குதல் போராட்டங்கள். இது மொபைல் சி.பீ.யுகளை ஒரு திரை ஓடு மீது நிறைய அழுத்தங்களை வைக்க கட்டாயப்படுத்துகிறது, இது செயல்திறனைக் கணிசமாகக் குறைக்கிறது, ஏனெனில் மற்ற அனைத்து கலங்களும் சட்டத்தைக் காண்பிப்பதற்கு முன்பு அது முடிக்க காத்திருக்க வேண்டும்.
zh_tw: 此外，圖塊式算繪在螢幕局部有大量幾何細節的小物件時效率會大幅下降。這會造成單一圖塊負載過重，其他區域必須等待該圖塊算繪完成才能顯示影格，導致整體效能降低。

source: To summarize, don't worry about vertex count on mobile, but **avoid concentration of vertices in small parts of the screen**. If a character, NPC, vehicle, etc. is far away (which means it looks tiny), use a smaller level of detail (LOD) model. Even on desktop GPUs, it's preferable to avoid having triangles smaller than the size of a pixel on screen.
ga: Chun achoimre a dhéanamh, ná bíodh imní ort faoi chomhaireamh vertex ar fhóghluaiste, ach**seachain tiúchan na dteangairí i gcodanna beaga den scáileán**. Má tá carachtar, NPC, feithicil, srl i bhfad ar shiúl (rud a chiallaíonn go bhfuil cuma bheag bídeach air), bain úsáid as samhail leibhéal níos lú mionsonraí (LOD). Fiú amháin ar GPUanna deisce, is fearr triantáin níos lú ná méid picteilín ar an scáileán a sheachaint.
ja: まとめると、モバイルでは頂点の数を気にする必要はありませんが、**画面の小さな部分に頂点が集中しないようにする** 必要があります。キャラクター、NPC、乗り物などが遠くにある場合 (つまり小さく見える場合) は、代わりに小さい詳細レベル (LOD) モデルを使用します。また、デスクトップ GPU でも画面上のピクセル サイズよりも小さい三角形は避けることをお勧めします。
ru: Подводя итог, не беспокойтесь о количестве вершин на мобильных устройствах, но **избегайте концентрации вершин в небольших областях экрана**. Если персонаж, NPC, транспортное средство и т. д. находится далеко (и выглядит крошечным), используйте модель с более низким уровнем детализации (LOD). Даже на настольных видеокартах желательно избегать треугольников размером меньше пикселя на экране.
ta: சுருக்கமாக, மொபைலில் வெர்டெக்ச் எண்ணிக்கையைப் பற்றி கவலைப்பட வேண்டாம், ஆனால் ** திரையின் சிறிய பகுதிகளில் செங்குத்துகளின் செறிவைத் தவிர்க்கவும் **. ஒரு பாத்திரம், NPC, வண்டி போன்றவை வெகு தொலைவில் இருந்தால் (இதன் பொருள் சிறியதாகத் தோன்றுகிறது), சிறிய அளவிலான விவரம் (LOD) மாதிரியைப் பயன்படுத்துங்கள். டெச்க்டாப் சி.பீ.யுக்களில் கூட, திரையில் ஒரு பிக்சலின் அளவை விட சிறிய முக்கோணங்கள் இருப்பதைத் தவிர்ப்பது விரும்பத்தக்கது.
zh_tw: 總結來說，在行動裝置上不用太擔心頂點總數，而是要**避免頂點過度集中在螢幕某一小區域**。若角色、NPC、車輛等距離很遠（在螢幕上很小），應降低 LOD（細節層級）。即使在桌面端，也避免讓三角形小於螢幕一個像素的大小。

source: Pay attention to the additional vertex processing required when using:
ga: Tabhair aird ar an bpróiseáil vertex breise a theastaíonn agus tú ag úsáid:
ja: 以下のケースで必要な追加の頂点処理にも注意してください:
pt_br: Preste atenção ao processamento adicional de vértices necessário ao usar:
ru: Обратите внимание на дополнительную обработку вершин, необходимую при использовании:
ta: பயன்படுத்தும்போது தேவையான கூடுதல் வெர்டெக்ச் செயலாக்கத்தில் கவனம் செலுத்துங்கள்:
zh_tw: 使用以下功能時，請留意額外的頂點運算成本：

source: Skinning (skeletal animation)
ga: Craiceann (beochan cnámharlaigh)
it: Skinning (animazioni scheletriche)
ja: スキニング (骨格アニメーション)
ru: Skinning (скелетная анимация)
ta: ச்கின்னிங் (எலும்பு அனிமேசன்)
zh_tw: 蒙皮（骨骼動畫）

source: Morphs (shape keys)
ga: Morphs (eochracha cruth)
it: Morph (chiavi di forma)
ja: モーフ (シェイプキー)
ru: Morphs (ключи формы)
ta: மோர்ப்கள் (வடிவ விசைகள்)
zh_tw: 變形（形狀鍵）

source: Vertex-lit objects (common on mobile)
it: Oggetti illuminati per vertice (comuni sui dispositivi mobili)
ja: 頂点ライティング (モバイルでは一般的)
ru: Объекты с вершинным освещением (часто встречается на мобильных устройствах)
ta: வெர்டெக்ச்-லிட் பொருள்கள் (மொபைலில் பொதுவானது)
zh_tw: 頂點光照物件（行動裝置常見）

source: Pixel/fragment shaders and fill rate
ga: Scáthóirí picteiléin/bhrúin agus ráta líonta
ja: ピクセル/フラグメントシェーダーとフィルレート
ru: Пиксельные/фрагментные шейдеры и скорость заполнения
ta: பிக்சல்/துண்டு சேடர்கள் மற்றும் நிரப்பு வீதம்
zh_tw: 像素/片元著色器與填充速率（Fill Rate）

source: In contrast to vertex processing, the costs of fragment (per-pixel) shading have increased dramatically over the years. Screen resolutions have increased: the area of a 4K screen is 8,294,400 pixels, versus 307,200 for an old 640×480 VGA screen. That is 27 times the area! Also, the complexity of fragment shaders has exploded. Physically-based rendering requires complex calculations for each fragment.
ga: I gcodarsnacht le próiseáil vertex, tá méadú suntasach tagtha ar chostais scáthaithe blúire (in aghaidh an picteilín) thar na blianta. Tá méadú tagtha ar rúin scáileáin: is é limistéar scáileáin 4K ná 8,294,400 picteilín, i gcoinne 307,200 le haghaidh sean-scáileán VGA 640 × 480. Is é sin 27 uair an limistéar! Chomh maith leis sin, tá castacht scáthóirí brúin pléasctha. Éilíonn rindreáil bunaithe ar fhisiciúil ríomhanna casta do gach blúire.
ja: 頂点処理とは対照的に、フラグメント (ピクセル単位) のシェーディングのコストは、長年にわたって劇的に増加しています。画面解像度は増加しており、古い 640×480 VGA 画面の面積は 307,200 ピクセルですが、4K 画面の面積は 8,294,400 ピクセルとなり、面積は 27 倍です。また、フラグメント シェーダーの複雑さも爆発的に増加しています。物理ベースのレンダリングでは、フラグメントごとに複雑な計算が必要になります。
ru: В отличие от обработки вершин, стоимость фрагментного (попиксельного) шейдинга за последние годы значительно выросла. Разрешение экранов увеличилось: площадь 4K-экрана составляет 8 294 400 пикселей против 307 200 пикселей у старого VGA-экрана с разрешением 640×480. Это в 27 раз больше! Кроме того, сложность фрагментных шейдеров резко возросла. Физически корректный рендеринг требует сложных вычислений для каждого фрагмента.
ta: வெர்டெக்ச் செயலாக்கத்திற்கு மாறாக, துண்டு (ஒரு பிக்சல்) நிழலின் செலவுகள் பல ஆண்டுகளாக வியத்தகு அளவில் அதிகரித்துள்ளன. திரை தீர்மானங்கள் அதிகரித்துள்ளன: 4 கே திரையின் பரப்பளவு 8,294,400 படப்புள்ளிகள், பழைய 640 × 480 விசிஏ திரைக்கு 307,200 ஆகும். அது 27 மடங்கு பரப்பளவு! மேலும், துண்டு நிழல்களின் சிக்கலானது வெடித்தது. உடல் அடிப்படையிலான வழங்குதல் ஒவ்வொரு துண்டுக்கும் சிக்கலான கணக்கீடுகள் தேவை.
zh_tw: 相較於頂點運算，片元（像素）著色的成本近年來大幅提升。螢幕解析度從 640×480 VGA（僅 307,200 像素）躍升到 4K（8,294,400 像素），面積暴增 27 倍！加上現代物理式算繪（PBR）導致片元著色器極度複雜，每個像素都需繁複運算。

source: You can test whether a project is fill rate-limited quite easily. Turn off V-Sync to prevent capping the frames per second, then compare the frames per second when running with a large window, to running with a very small window. You may also benefit from similarly reducing your shadow map size if using shadows. Usually, you will find the FPS increases quite a bit using a small window, which indicates you are to some extent fill rate-limited. On the other hand, if there is little to no increase in FPS, then your bottleneck lies elsewhere.
ga: Is féidir leat a thástáil an bhfuil tionscadal teoranta do ráta líonta go héasca. Múch V-Sync chun cosc a chur ar na frámaí in aghaidh an tsoicind, ansin déan comparáid idir na frámaí in aghaidh an tsoicind agus tú ag rith le fuinneog mhór, le rith le fuinneog an-bheag. Féadfaidh tú leas a bhaint as méid do léarscáileanna scáth a laghdú ar an gcaoi chéanna De ghnáth, gheobhaidh tú méadaíonn an FPS go leor ag baint úsáide as fuinneog bheag, rud a thugann le fios go bhfuil tú teoranta do ráta líonta go pointe áirithe. Ar an láimh eile, mura bhfuil mórán méadú nó gan aon mhéadú ar FPS, ansin tá do scagal in áiteanna eile.
ja: プロジェクトがフィルレート制限を受けているかどうかは、非常に簡単なテストで確認できます。V-Sync をオフにして、1 秒あたりのフレーム数が制限されないようにし、大きなウィンドウで実行した場合と非常に小さなウィンドウで実行した場合の 1 秒あたりのフレーム数を比較します。シャドウを使用する場合は、同様にシャドウマップのサイズを小さくするとメリットが得られることもあります。通常、小さなウィンドウを使用すると FPS がかなり増加します。これはフィルレートがある程度制限されていることを示しています。一方、FPS がほとんどまたはまったく増加しない場合は、ボトルネックは別の場所にあります。
ru: Проверить, ограничена ли скорость заполнения проекта, можно довольно просто. Отключите V-Sync, чтобы предотвратить ограничение кадров в секунду, затем сравните количество кадров в секунду при работе с большим окном и при работе с очень маленьким окном. Вы также можете получить пользу от аналогичного уменьшения размера карты теней, если используете тени. Обычно при использовании маленького окна FPS увеличивается довольно сильно, что указывает на то, что вы в какой-то степени ограничены в скорости заполнения. С другой стороны, если FPS практически не увеличивается, значит, узкое место находится в другом месте.
ta: ஒரு திட்டம் மிக எளிதாக நிரப்பப்பட்டதா என்பதை நீங்கள் சோதிக்கலாம். நொடிக்கு பிரேம்களை மூடுவதைத் தடுக்க வி-ஒத்திசைவை அணைக்கவும், பின்னர் ஒரு பெரிய சாளரத்துடன் இயங்கும் போது நொடிக்கு பிரேம்களை ஒப்பிட்டுப் பாருங்கள், மிகச் சிறிய சாளரத்துடன் இயங்கும். நிழல்களைப் பயன்படுத்தினால் இதேபோல் உங்கள் நிழல் வரைபட அளவைக் குறைப்பதன் மூலமும் நீங்கள் பயனடையலாம். வழக்கமாக, ஒரு சிறிய சாளரத்தைப் பயன்படுத்தி FPS சிறிது அதிகரிக்கிறது என்பதை நீங்கள் காண்பீர்கள், இது நீங்கள் ஓரளவிற்கு நிரப்பு வீத-வரையறுக்கப்பட்டிருப்பதைக் குறிக்கிறது. மறுபுறம், எஃப்.பி.எச்சில் அதிகரிப்பு குறைவாக இருந்தால், உங்கள் சிக்கல் வேறு இடங்களில் உள்ளது.
zh_tw: 你可以很容易測試專案是否受填充速率限制。請先關閉 V-Sync（避免 FPS 被上限限制），然後比較大視窗與極小視窗下的 FPS。如果有用到陰影，試著減小陰影貼圖尺寸。通常你會發現小視窗時 FPS 大幅提升，代表你受限於填充速率；若提升有限，瓶頸則在其他地方。
