Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/gpu_optimization.po
Languages: ga, it, ja, pt_br, ru, ta, zh_tw

source: You can increase performance in a fill rate-limited project by reducing the amount of work the GPU has to do. You can do this by simplifying the shader (perhaps turn off expensive options if you are using a :ref:`StandardMaterial3D <class_StandardMaterial3D>`), or reducing the number and size of textures used. Also, when using non-unshaded particles, consider forcing vertex shading in their material to decrease the shading cost.
ga: Is féidir leat an fheidhmíocht a mhéadú i dtionscadal líonta teoranta trí laghdú a dhéanamh ar an méid oibre atá le déanamh ag an GPU. Is féidir leat é seo a dhéanamh tríd an scáthlánóir a shimpliú (b'fhéidir roghanna costasacha a mhúchadh má tá :ref:`StandardMaterial3D <class_StandardMaterial3D>` in úsáid agat), nó trí líon agus méid na n-uigeachtaí a úsáidtear a laghdú. Chomh maith leis sin, nuair a bhíonn cáithníní neamhscáthaithe á n-úsáid agat, smaoinigh ar scáthú rinn a bhrú ar a n-ábhar chun an costas scáthaithe a laghdú.
ja: フィルレートが制限されているプロジェクトでは、GPU が行う作業量を減らすことでパフォーマンスを向上させることができます。これを行うには、シェーダーを簡素化するか (:ref:`StandardMaterial3D <class_StandardMaterial3D>` を使用している場合は、コストのかかるオプションをオフにします)、使用するテクスチャの数とサイズを減らします。またシェーディングされていないパーティクルを使用する場合は、マテリアルで頂点シェーディングを強制してシェーディングコストを削減することを検討してください。
ru: Производительность в проекте с ограниченной скоростью заполнения можно повысить, уменьшив объём работы, выполняемой графическим процессором. Это можно сделать, упростив шейдер (например, отключив ресурсоёмкие опции, если вы используете :ref:`StandardMaterial3D <class_StandardMaterial3D>`) или уменьшив количество и размер используемых текстур. Кроме того, при использовании частиц без затенения рассмотрите возможность принудительного затенения вершин в их материале для снижения стоимости затенения.
ta: சி.பீ.யூ செய்ய வேண்டிய வேலையின் அளவைக் குறைப்பதன் மூலம் நிரப்பு வீத-வரையறுக்கப்பட்ட திட்டத்தில் செயல்திறனை அதிகரிக்கலாம். சேடரை எளிதாக்குவதன் மூலம் இதைச் செய்யலாம் (நீங்கள் பயன்படுத்தினால் விலையுயர்ந்த விருப்பங்களை அணைக்கலாம்: ref: `standardmaterial3d <class_standardMaterial3d>`) அல்லது பயன்படுத்தப்படும் அமைப்புகளின் எண்ணிக்கையையும் அளவையும் குறைத்தல். மேலும், மறைக்கப்படாத துகள்களைப் பயன்படுத்தும் போது, நிழல் செலவைக் குறைக்க அவற்றின் பொருளில் வெர்டெக்ச் நிழலை கட்டாயப்படுத்துவதைக் கவனியுங்கள்.
zh_tw: 若專案受限於填充速率，可透過減少 GPU 負擔來提升效能，比如簡化著色器（若是 :ref:`StandardMaterial3D <class_StandardMaterial3D>`，可關閉高成本選項）、減少紋理數量與尺寸。若粒子不是 Unshaded，建議在材質中強制使用頂點著色模式（vertex shading），以降低著色成本。

source: On supported hardware, :ref:`doc_variable_rate_shading` can be used to reduce shading processing costs without impacting the sharpness of edges on the final image.
ga: Maidir le crua-earraí tacaithe, is féidir :ref: `doc_variable_rate_shading` a úsáid chun costais phróiseála scáthaithe a laghdú gan dul i bhfeidhm ar ghéar na n-imill ar an íomhá deiridh.
ja: :ref:`doc_variable_rate_shading` がサポートされているハードウェアでは、最終画像のエッジの鮮明さに影響を与えずにシェーディング処理コストを削減できます。
ru: На поддерживаемом оборудовании :ref:`doc_variable_rate_shading` можно использовать для снижения затрат на обработку затенения, не влияя на резкость краев на конечном изображении.
ta: ஆதரிக்கப்பட்ட வன்பொருளில்,: `doc_variable_rate_shading` இறுதி படத்தில் விளிம்புகளின் கூர்மையை பாதிக்காமல் நிழல் செயலாக்க செலவுகளைக் குறைக்க பயன்படுத்தலாம்.
zh_tw: 在支援的硬體上，可利用 :ref:`doc_variable_rate_shading` 降低著色運算成本，同時又不會影響最終影像的邊緣銳利度。

source: **When targeting mobile devices, consider using the simplest possible shaders you can reasonably afford to use.**
ga: ** Agus tú ag díriú ar ghléasanna soghluaiste, smaoinigh ar na scáthóirí is simplí is féidir leat a úsáid go réasúnach. **
it: **Quando scegli come destinazione i dispositivi mobili, pensa a utilizzare gli shader più semplici possibili che puoi ragionevolmente permetterti di utilizzare.**
ja: **モバイルデバイスをターゲットにする場合は、合理的に使用できる最もシンプルなシェーダーの使用を検討してください。**
ru: **При ориентации на мобильные устройства рассмотрите возможность использования максимально простых шейдеров, которые вы можете себе позволить.**
ta: ** மொபைல் சாதனங்களை குறிவைக்கும் போது, நீங்கள் நியாயமான முறையில் பயன்படுத்தக்கூடிய எளிய சேடர்களைப் பயன்படுத்துவதைக் கவனியுங்கள். **
zh_tw: **針對行動裝置開發時，建議盡可能使用最簡單的著色器。**

source: Reading textures
ga: Uigeachtaí léamh
it: Lettura delle texture
ja: テクスチャの読み取り
pt_br: Lendo texturas
ru: Чтение текстур
ta: படித்தல் அமைப்புகள்
zh_tw: 紋理讀取

source: The other factor in fragment shaders is the cost of reading textures. Reading textures is an expensive operation, especially when reading from several textures in a single fragment shader. Also, consider that filtering may slow it down further (trilinear filtering between mipmaps, and averaging). Reading textures is also expensive in terms of power usage, which is a big issue on mobiles.
ga: Is é an fachtóir eile i scáthóirí blúire ná an costas a bhaineann le uigeachtaí léamh. Is oibríocht daor é uigeachtaí léitheoireachta, go háirithe agus tú ag léamh ó roinnt uigeachtaí i scáthóir blúire amháin. Chomh maith leis sin, smaoinigh go bhféadfadh scagadh é a mhoilliú tuilleadh (scagadh trílíneach idir mipmaps, agus meánú). Tá uigeachtaí léitheoireachta daor freisin i dtéarmaí úsáide cumhachta, rud atá ina cheist mhór ar fhón póca.
ja: フラグメントシェーダーのもう 1 つの要素は、テクスチャの読み取りコストです。特に1つのフラグメントシェーダーで複数のテクスチャを読み取る場合は、コストのかかる操作です。またフィルタリングによってさらに速度が低下する可能性があることも考慮してください (ミップマップを使ったトリリニアフィルタリングと平均化)。テクスチャの読み取りは電力消費の面でもコストが高く、モバイルでは大きな問題となります。
ru: Другим фактором, влияющим на фрагментные шейдеры, является стоимость чтения текстур. Чтение текстур — дорогостоящая операция, особенно при чтении нескольких текстур в одном фрагментном шейдере. Кроме того, следует учитывать, что фильтрация может ещё больше замедлить процесс (трилинейная фильтрация между MIP-текстурами и усреднение). Чтение текстур также потребляет много энергии, что является серьёзной проблемой на мобильных устройствах.
ta: துண்டு நிழல்களின் மற்ற காரணி அமைப்புகளைப் படிப்பதற்கான செலவு ஆகும். அமைப்புகளைப் படிப்பது ஒரு விலையுயர்ந்த செயல்பாடாகும், குறிப்பாக ஒரு துண்டு நிழலில் பல அமைப்புகளிலிருந்து படிக்கும்போது. மேலும், வடிகட்டுதல் அதை மேலும் குறைக்கக்கூடும் என்பதைக் கவனியுங்கள் (MIPMAPS க்கு இடையில் Trilinear வடிகட்டுதல் மற்றும் சராசரியாக). மின் பயன்பாட்டின் அடிப்படையில் அமைப்புகளைப் படிப்பது விலை உயர்ந்தது, இது மொபைல்களில் ஒரு பெரிய சிக்கல்.
zh_tw: 片元著色器的另一個成本在於紋理讀取。讀取紋理本身就很耗效能，若在單一著色器中讀取多張紋理則成本更高。另外，紋理過濾（如 mipmap 間的三線性過濾與平均）也會進一步拖慢速度。對於行動裝置，紋理讀取除了效能外，也會顯著增加耗電。

source: **If you use third-party shaders or write your own shaders, try to use algorithms that require as few texture reads as possible.**
ga: ** Má úsáideann tú scáthóirí tríú páirtí nó má scríobhann tú do scáthóirí féin, déan iarracht halgartaim a úsáid a éilíonn an oiread léamh uigeachta agus is féidir. **
ja: **サードパーティのシェーダーを使用する場合、または独自のシェーダーを作成する場合は、テクスチャの読み取りをできるだけ少なくするアルゴリズムを使用するようにしてください。**
ru: **Если вы используете сторонние шейдеры или пишете собственные шейдеры, старайтесь использовать алгоритмы, требующие как можно меньшего количества чтений текстур.**
ta: ** நீங்கள் மூன்றாம் தரப்பு சேடர்களைப் பயன்படுத்தினால் அல்லது உங்கள் சொந்த சேடர்களை எழுதினால், முடிந்தவரை சில அமைப்பு வாசிப்புகள் தேவைப்படும் வழிமுறைகளைப் பயன்படுத்த முயற்சிக்கவும். **
zh_tw: **如果你使用第三方著色器或自行撰寫著色器，請盡量選擇需要最少紋理讀取的演算法。**

source: Texture compression
ga: Comhbhrú uigeachta
it: Compressione delle texture
ja: テクスチャ圧縮
pt_br: Compressão de texturas
ru: Сжатие текстур
ta: அமைப்பு சுருக்கம்
zh_tw: 紋理壓縮

source: By default, Godot compresses textures of 3D models when imported using video RAM (VRAM) compression. Video RAM compression isn't as efficient in size as PNG or JPG when stored, but increases performance enormously when drawing large enough textures.
ga: De réir réamhshocraithe, comhbhrúiteann Godot uigeachtaí samhlacha 3D nuair a iompórtáiltear iad ag úsáid comhbhrúite físe RAM (VRAM) Níl comhbhrú RAM físe chomh éifeachtach i méid le PNG nó JPG nuair a stóráiltear é, ach méadaíonn sé feidhmíocht go mór agus uigeachtaí móra go leor á línítear.
ja: Godotは、3Dモデルをインポートする際にテクスチャを Video RAM (VRAM) 圧縮することができます。Video RAM 圧縮は保存時のサイズの点で PNG や JPG ほど効率的ではありませんが、大きなテクスチャを描画する場合のパフォーマンスが大幅に向上します。
ru: По умолчанию Godot сжимает текстуры 3D-моделей при импорте, используя сжатие видеопамяти (VRAM). Сжатие видеопамяти не так эффективно с точки зрения размера, как PNG или JPG при сохранении, но значительно повышает производительность при отрисовке достаточно больших текстур.
ta: இயல்புநிலையாக, வீடியோ ரேம் (VRAM) சுருக்கத்தைப் பயன்படுத்தி இறக்குமதி செய்யும்போது கோடோட் 3D மாடல்களின் அமைப்புகளை சுருக்குகிறது. வீடியோ ரேம் சுருக்கமானது சேமிக்கப்படும் போது பி.என்.சி அல்லது சே.பி.சி போன்ற அளவு திறமையாக இல்லை, ஆனால் போதுமான அளவிலான அமைப்புகளை வரையும்போது செயல்திறனை பெரிதும் அதிகரிக்கிறது.
zh_tw: Godot 預設在匯入 3D 紋理時會採用顯示記憶體（VRAM）壓縮。這種壓縮儲存體積雖然不如 PNG 或 JPG 有效，但在繪製大型紋理時能大幅提升效能。

source: This is because the main goal of texture compression is bandwidth reduction between memory and the GPU.
ga: Tá sé seo toisc gurb é príomhsprioc comhbhrúite uigeachta laghdú bandaleithead idir cuimhne agus an GPU.
ja: これはテクスチャ圧縮の主な目的がメモリと GPU 間の帯域幅の削減であるためです。
ru: Это связано с тем, что основной целью сжатия текстур является сокращение пропускной способности между памятью и графическим процессором.
ta: ஏனென்றால், அமைப்பு சுருக்கத்தின் முக்கிய குறிக்கோள் நினைவகத்திற்கும் சி.பீ.யுக்கும் இடையிலான அலைவரிசை குறைப்பு ஆகும்.
zh_tw: 這是因為紋理壓縮的主要目標是減少記憶體與 GPU 間的頻寬消耗。

source: In 3D, the shapes of objects depend more on the geometry than the texture, so compression is generally not noticeable. In 2D, compression depends more on shapes inside the textures, so the artifacts resulting from 2D compression are more noticeable.
ga: I 3D, braitheann cruthanna rudaí níos mó ar an geoiméadracht ná ar an uigeacht, mar sin de ghnáth ní bhíonn comhbhrú faoi deara. I 2D, braitheann comhbhrú níos mó ar chruthanna taobh istigh de na uigeachtaí, mar sin tá na déantáin a eascraíonn as comhbhrú 2D níos suntasaí.
ja: 3Dでは、オブジェクトの形状は、テクスチャよりもジオメトリによるところが大きいので、普通は圧縮しても見分けはつきません。2Dの場合、圧縮はテクスチャ内に描かれた形状も変化させてしまうため、違いがより目立つようになります。
ru: В 3D форма объектов больше зависит от геометрии, чем от текстуры, поэтому сжатие обычно незаметно. В 2D сжатие больше зависит от формы внутри текстур, поэтому артефакты, возникающие при 2D-сжатии, более заметны.
ta: 3D இல், பொருள்களின் வடிவங்கள் அமைப்பை விட வடிவவியலை அதிகம் சார்ந்துள்ளது, எனவே சுருக்கமானது பொதுவாக கவனிக்கப்படாது. 2 டி இல், சுருக்கமானது அமைப்புகளுக்குள் உள்ள வடிவங்களைப் பொறுத்தது, எனவே 2 டி சுருக்கத்தின் விளைவாக ஏற்படும் கலைப்பொருட்கள் மிகவும் கவனிக்கத்தக்கவை.
zh_tw: 在 3D 算繪中，物件的形狀主要取決於幾何形狀，因此壓縮對畫面影響較小；而在 2D，紋理內的細節與形狀較重要，所以壓縮產生的失真與雜訊會更明顯。

source: As a warning, most Android devices do not support texture compression of textures with transparency (only opaque), so keep this in mind.
ga: Mar rabhadh, ní thacaíonn mórchuid na bhfeistí Android le comhbhrú uigeachta uigeachtaí le trédhearcacht (gan ach trédhearcach), mar sin coinnigh é seo i gcuimhne.
ja: 注意すべき点として、Androidデバイスでは透過のあるテクスチャの圧縮はサポートされていません(非透過のみ)ので、気をつけてください。
ru: В качестве предупреждения следует отметить, что большинство устройств Android не поддерживают сжатие текстур с прозрачностью (только непрозрачные), поэтому имейте это в виду.
ta: ஒரு எச்சரிக்கையாக, பெரும்பாலான ஆண்ட்ராய்டு சாதனங்கள் வெளிப்படைத்தன்மையுடன் (ஒளிபுகா மட்டுமே) அமைப்புகளின் அமைப்பு சுருக்கத்தை ஆதரிக்காது, எனவே இதை மனதில் கொள்ளுங்கள்.
zh_tw: 請注意，大多數 Android 裝置不支援帶透明度的紋理壓縮（僅支援不透明），請務必留意。

source: Even in 3D, "pixel art" textures should have VRAM compression disabled as it will negatively affect their appearance, without improving performance significantly due to their low resolution.
ga: Fiú amháin i 3D, ba cheart go mbeadh uigeachtaí "ealaín picteilín" faoi mhíchumas comhbhrú VRAM mar go ndéanfaidh sé difear diúltach ar a gcuma, gan feabhas mór a chur ar fheidhmíocht mar gheall ar a n-réiteach íseal.
ja: 3Dの場合でも、「ピクセルアート」テクスチャではVRAM圧縮を無効にする必要があります。解像度が低いとパフォーマンスが大幅に向上するわけでもなく、描画の見た目に悪影響を与えるためです。
ru: Даже в 3D-текстурах "pixel art" следует отключать сжатие видеопамяти, поскольку это негативно скажется на их внешнем виде, не приводя к значительному повышению производительности из-за их низкого разрешения.
ta: 3D இல் கூட, "படப்புள்ளி ஆர்ட்" அமைப்புகள் VRAM சுருக்க முடக்கப்பட்டிருக்க வேண்டும், ஏனெனில் அவை குறைந்த தெளிவுத்திறன் காரணமாக செயல்திறனை கணிசமாக மேம்படுத்தாமல் அவற்றின் தோற்றத்தை எதிர்மறையாக பாதிக்கும்.
zh_tw: 即使在 3D 場景下，「像素美術」紋理也應停用 VRAM 壓縮，因為壓縮會明顯影響畫面品質，而低解析度本身並不會帶來顯著效能提升。

source: Post-processing and shadows
ga: Iar-phróiseáil agus scáthanna
it: Post-elaborazione e ombre
ja: ポストプロセッシングとシャドウ
pt_br: Pós-processamento e sombras
ru: Постобработка и тени
ta: பிந்தைய செயலாக்கம் மற்றும் நிழல்கள்
zh_tw: 後製處理與陰影

source: Post-processing effects and shadows can also be expensive in terms of fragment shading activity. Always test the impact of these on different hardware.
ga: Is féidir le héifeachtaí iarphróiseála agus scáthanna a bheith costasach freisin i dtéarmaí gníomhaíochta scáthaithe blúirí. Déan tástáil i gcónaí ar an tionchar a bhíonn acu seo ar chrua-earraí éagsúla.
ja: ポストプロセスエフェクトとシャドウも、フラグメントシェーディングのアクティビティの観点からはコストがかかる可能性があります。常にさまざまなハードウェアでこれらの影響をテストしてください。
ru: Эффекты постобработки и тени также могут быть затратными с точки зрения фрагментного затенения. Всегда проверяйте их влияние на различное оборудование.
ta: துண்டு துண்டான நிழல் செயல்பாட்டின் அடிப்படையில் பிந்தைய செயலாக்க விளைவுகள் மற்றும் நிழல்களும் விலை உயர்ந்ததாக இருக்கும். வெவ்வேறு வன்பொருளில் இவற்றின் தாக்கத்தை எப்போதும் சோதிக்கவும்.
zh_tw: 後製特效與陰影在片元著色階段同樣非常耗資源。務必在不同硬體上測試這些效果對效能的影響。

source: **Reducing the size of shadowmaps can increase performance**, both in terms of writing and reading the shadowmaps. On top of that, the best way to improve performance of shadows is to turn shadows off for as many lights and objects as possible. Smaller or distant OmniLights/SpotLights can often have their shadows disabled with only a small visual impact.
ga: ** Is féidir le laghdú méid scáthléarscáileanna feidhmíocht** a mhéadú, ó thaobh scríbhneoireachta agus léitheoireachta na scáthléarscáileanna. Ar a bharr sin, is é an bealach is fearr chun feidhmíocht scáthanna a fheabhsú ná scáthanna a mhúchadh le haghaidh an oiread soilse agus rudaí agus is féidir. Is minic go bhféadfadh a scáthanna a gcuid scáthanna a dhíchumasú gan ach tionchar amhairc beag amhairc.
ja: シャドウマップの書き込みと読み取りの両方において、 **シャドウマップのサイズを小さくするとパフォーマンスが向上します** 。さらにシャドウのパフォーマンスを向上させる最善の方法は、できるだけ多くのライトとオブジェクトのシャドウをオフにすることです。小さいまたは遠いオムニライト/スポットライトでは、多くの場合、シャドウを無効にしても視覚的な影響はわずかです。
ru: **Уменьшение размера карт теней может повысить производительность**, как при записи, так и при чтении. Кроме того, лучший способ улучшить производительность теней — отключить тени для как можно большего числа источников света и объектов. Тени небольших или удалённых источников OmniLight/SpotLight часто можно отключить, что лишь незначительно повлияет на визуальный эффект.
ta: . அதற்கு மேல், நிழல்களின் செயல்திறனை மேம்படுத்துவதற்கான சிறந்த வழி, முடிந்தவரை பல விளக்குகள் மற்றும் பொருள்களுக்கு நிழல்களை அணைக்க வேண்டும். சிறிய அல்லது தொலைதூர ஓம்னிலைட்ச்/ச்பாட்லைட்கள் பெரும்பாலும் அவற்றின் நிழல்களை ஒரு சிறிய காட்சி தாக்கத்துடன் முடக்கலாம்.
zh_tw: **降低陰影貼圖（shadowmap）大小能明顯提升效能**，無論是寫入還是讀取都一樣。此外，最佳化陰影效能最有效的方法，就是盡量減少有陰影的燈光與物件。對於較小或較遠的全域光（OmniLight）/聚光燈（SpotLight），通常可以直接關閉陰影而對畫面影響極小。

source: Transparency and blending
ga: Trédhearcacht agus meascán
ja: 半透明とブレンド
ru: Прозрачность и смешивание
ta: வெளிப்படைத்தன்மை மற்றும் கலத்தல்
zh_tw: 透明與混合

source: Transparent objects present particular problems for rendering efficiency. Opaque objects (especially in 3D) can be essentially rendered in any order and the Z-buffer will ensure that only the front most objects get shaded. Transparent or blended objects are different. In most cases, they cannot rely on the Z-buffer and must be rendered in "painter's order" (i.e. from back to front) to look correct.
ga: Tá fadhbanna ar leith ag rudaí trédhearcacha maidir le héife Is féidir rudaí trédhearcacha (go háirithe i 3D) a léiriú go bunúsach in aon ord agus cinnteoidh an maolán Z nach ndéanfar ach an chuid is mó de na rudaí tosaigh scáthaithe. Tá rudaí trédhearcacha nó measctha difriúil. I bhformhór na gcásanna, ní féidir leo brath ar an maolán Z agus caithfear iad a léiriú i “ord péinteora” (ie ón gcúl go tosaigh) chun breathnú ceart.
ja: 半透明なオブジェクトは、レンダリング効率に関して特に問題があります。不透明なオブジェクト (特に 3D) は、基本的に任意の順序でレンダリングでき、Z バッファによって最前面のオブジェクトのみがシェーディングされます。半透明なオブジェクトまたはブレンドされるオブジェクトは異なります。ほとんどの場合、Z バッファに依存できず、正しく見えるようにするには「描画の順序」を考慮し、後ろから前へレンダリングする必要があります。
ru: Прозрачные объекты представляют собой серьёзные проблемы с эффективностью рендеринга. Непрозрачные объекты (особенно в 3D) можно визуализировать практически в любом порядке, и Z-буфер обеспечит затенение только передних объектов. Прозрачные или смешанные объекты работают иначе. В большинстве случаев они не могут полагаться на Z-буфер и должны визуализироваться в "painter's order" (то есть от заднего плана к переднему), чтобы выглядеть корректно.
ta: வெளிப்படையான பொருள்கள் செயல்திறனை வழங்குவதற்கான குறிப்பிட்ட சிக்கல்களை முன்வைக்கின்றன. ஒளிபுகா பொருள்கள் (குறிப்பாக 3D இல்) அடிப்படையில் எந்தவொரு வரிசையிலும் வழங்கப்படலாம், மேலும் Z- பஃபர் முன் பெரும்பாலான பொருள்கள் மட்டுமே நிழலாடுவதை உறுதி செய்யும். வெளிப்படையான அல்லது கலப்பு பொருள்கள் வேறுபட்டவை. பெரும்பாலான சந்தர்ப்பங்களில், அவை இசட்-பஃபரை நம்ப முடியாது, மேலும் சரியானதாக இருக்க "பெயிண்டரின் வரிசையில்" (அதாவது பின்புறத்திலிருந்து முன்னால்) வழங்கப்பட வேண்டும்.
zh_tw: 透明物件對算繪效能有特殊挑戰。不透明物件（特別在 3D 裡）可以用任何順序算繪，Z 緩衝區會自動保證最前面的物件被正確著色；但透明或混合物件則無法用 Z 緩衝排序，必須改用「畫家演算法」（painter's order，從後往前繪製）才能正確顯示。

source: Transparent objects are also particularly bad for fill rate, because every item has to be drawn even if other transparent objects will be drawn on top later on.
ga: Tá rudaí trédhearcacha go háirithe dona freisin maidir le ráta líonta, toisc go gcaithfear gach earra a tharraingt fiú má tharraingfear rudaí trédhearcacha eile ar an mbarr níos déanaí.
ja: 半透明なオブジェクトは、他の半透明なオブジェクトがその上に描画される場合でも、すべてのアイテムを描画する必要があるため、フィルレートに特に悪影響を及ぼします。
ru: Прозрачные объекты также особенно плохо влияют на скорость заполнения, поскольку каждый элемент должен быть отрисован, даже если позже поверх него будут отрисованы другие прозрачные объекты.
ta: வெளிப்படையான பொருள்கள் நிரப்பு விகிதத்திற்கு குறிப்பாக மோசமானவை, ஏனென்றால் மற்ற வெளிப்படையான பொருள்கள் பின்னர் மேலே வரையப்பட்டாலும் ஒவ்வொரு பொருளும் வரையப்பட வேண்டும்.
zh_tw: 透明物件對填充速率的影響也特別嚴重，因為每個圖層都要被算繪，即使後面還會被其他透明物件覆蓋。

source: Opaque objects don't have to do this. They can usually take advantage of the Z-buffer by writing to the Z-buffer only first, then only performing the fragment shader on the "winning" fragment, the object that is at the front at a particular pixel.
ga: Ní gá go gcaithfidh rudaí trédhearcacha é seo a dhéanamh. De ghnáth is féidir leo leas a bhaint as an Z-maolán trí scríobh chuig an Z-maolán amháin ar dtús, ansin ach an scáthóir blúire a dhéanamh ar an mblúirt “buaiteach”, an réad atá ag tosaigh ag picteilín áirithe.
ja: 不透明なオブジェクトは、これを行う必要はありません。最初に Z バッファにのみ書き込み、次に特定のピクセルの最前面にあるオブジェクトのフラグメントに対してのみフラグメントシェーダを実行することができます。
ru: Непрозрачным объектам это не нужно. Обычно они могут воспользоваться преимуществами Z-буфера, сначала записав данные только в Z-буфер, а затем выполнив фрагментный шейдер только для "победившего" фрагмента — объекта, находящегося впереди в определённом пикселе.
ta: ஒளிபுகா பொருள்கள் இதைச் செய்ய வேண்டியதில்லை. அவர்கள் வழக்கமாக முதலில் இசட்-பஃபருக்கு மட்டுமே இசட்-பஃபர் பயன்படுத்திக் கொள்ளலாம், பின்னர் ஒரு குறிப்பிட்ட பிக்சலில் முன்னால் இருக்கும் "வென்ற" துண்டு, "வென்ற" துண்டில் துண்டு நிழலை மட்டுமே செய்ய முடியும்.
zh_tw: 不透明物件則不會有這個問題，因為可以利用 Z 緩衝區，先寫入 Z 值，再只對最前方（勝出）的像素進行片元著色器運算。

source: Transparency is particularly expensive where multiple transparent objects overlap. It is usually better to use transparent areas as small as possible to minimize these fill rate requirements, especially on mobile, where fill rate is very expensive. Indeed, in many situations, rendering more complex opaque geometry can end up being faster than using transparency to "cheat".
ga: Tá trédhearcacht an-daor nuair a bhíonn rudaí trédhearcacha iolr De ghnáth is fearr limistéir trédhearcacha chomh beag agus is féidir a úsáid chun na riachtanais ráta líonta seo a íoslaghdú, go háirithe ar soghluaiste, áit a bhfuil an ráta líonta an-daor. Go deimhin, i go leor cásanna, is féidir le céimseata trédhearcach níos casta a rinneadh a bheith níos gasta ná trédhearcacht a úsáid chun “cheat”.
ja: 複数の半透明オブジェクトが重なり合う場合に特にコストがかかります。通常これらのフィルレート要件を最小限に抑えるには、半透明領域をできるだけ小さくする方がよいでしょう。特にフィルレートが非常にコストがかかるモバイルではそうです。実際多くの状況では、より複雑な不透明なジオメトリをレンダリングする方が、半透明を使用して「ごまかす」よりも速くなることがあります。
ru: Прозрачность особенно затратна при перекрытии нескольких прозрачных объектов. Обычно лучше использовать как можно меньшие по размеру прозрачные области, чтобы минимизировать требования к скорости заполнения, особенно на мобильных устройствах, где скорость заполнения очень дорога. Действительно, во многих ситуациях рендеринг более сложной непрозрачной геометрии может оказаться быстрее, чем использование прозрачности для "обмана".
ta: வெளிப்படைத்தன்மை குறிப்பாக விலை உயர்ந்தது, அங்கு பல வெளிப்படையான பொருள்கள் ஒன்றுடன் ஒன்று. இந்த நிரப்பு வீதத் தேவைகளை குறைக்க, குறிப்பாக மொபைலில், நிரம்பிய விகிதம் மிகவும் விலை உயர்ந்ததாக இருக்கும் வகையில் வெளிப்படையான பகுதிகளை முடிந்தவரை சிறியதாகப் பயன்படுத்துவது பொதுவாக நல்லது. உண்மையில், பல சூழ்நிலைகளில், மிகவும் சிக்கலான ஒளிபுகா வடிவவியலை வழங்குவது "ஏமாற்று" செய்ய வெளிப்படைத்தன்மையைப் பயன்படுத்துவதை விட வேகமாக முடிவடையும்.
zh_tw: 當多個透明物件重疊時，效能成本尤其高。通常，應盡量縮小透明區域以減低填充速率需求，這點在行動裝置上尤其重要。許多情況下，直接算繪較複雜的不透明幾何體，反而比用透明材質「取巧」來得有效率。

source: Multi-platform advice
ga: Comhairle il-ardáin
it: Consiglio multi-piattaforma
ja: マルチプラットフォームのアドバイス
pt_br: Assessoria multiplataforma
ru: Советы по работе с несколькими платформами
ta: பல-தளம் அறிவுரை
zh_tw: 跨平台建議

source: If you are aiming to release on multiple platforms, test *early* and test *often* on all your platforms, especially mobile. Developing a game on desktop but attempting to port it to mobile at the last minute is a recipe for disaster.
ga: Má tá sé mar aidhm agat scaoileadh ar ardáin iolracha, déan tástáil go luath* agus tástáil go minic* ar d'ardáin go léir, go háirithe soghluaiste. Is oideas tubaiste é cluiche a fhorbairt ar dheasc ach iarracht a dhéanamh é a iompar chuig soghluaiste ag an nóiméad deireanach.
ja: 複数のプラットフォームでリリースすることを目指している場合は、すべてのプラットフォーム、特にモバイルで *早期に* 、そして *頻繁に* テストしてください。デスクトップでゲームを開発し、最後の瞬間にモバイルに移植しようとすると、大惨事を招くことになります。
ru: Если вы планируете выпустить игру на нескольких платформах, тестируйте её *как можно раньше* и *часто* на всех платформах, особенно на мобильных. Разрабатывать игру для ПК, а в последний момент пытаться портировать её на мобильные устройства — верный путь к провалу.
ta: நீங்கள் பல தளங்களில் வெளியிடுவதை நோக்கமாகக் கொண்டிருந்தால், * ஆரம்ப * சோதனை மற்றும் உங்கள் எல்லா தளங்களிலும், குறிப்பாக மொபைலில் * அடிக்கடி * சோதிக்கவும். டெச்க்டாப்பில் ஒரு விளையாட்டை உருவாக்குவது, ஆனால் கடைசி நிமிடத்தில் அதை மொபைலுக்கு அனுப்ப முயற்சிப்பது பேரழிவுக்கான செய்முறையாகும்.
zh_tw: 如果你計畫跨平台發行，請務必 *及早* 、 *頻繁* 地在所有目標平台進行測試，特別是行動裝置。只在桌面端開發，最後才臨時移植到行動裝置，幾乎注定會遇到災難。
