Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/gpu_optimization.po
Languages: ga, it, ja, pt_br, ru, ta, zh_tw

source: GPU optimization
ga: Optamú GPU
ja: GPUの最適化
pt_br: Otimização da GPU
ru: Оптимизация графического процессора
ta: சி.பீ.யூ தேர்வுமுறை
zh_tw: GPU 最佳化

source: Introduction
ga: Réamhrá
it: Introduzione
ja: はじめに
pt_br: Introdução
ru: Введение
ta: அறிமுகம்
zh_tw: 前言

source: The demand for new graphics features and progress almost guarantees that you will encounter graphics bottlenecks. Some of these can be on the CPU side, for instance in calculations inside the Godot engine to prepare objects for rendering. Bottlenecks can also occur on the CPU in the graphics driver, which sorts instructions to pass to the GPU, and in the transfer of these instructions. And finally, bottlenecks also occur on the GPU itself.
ga: Ráthaíonn an t-éileamh ar ghnéithe grafaicí nua agus dul chun cinn beagnach go mbeidh tú ag teacht ar ghraiceanna grafaicí. Is féidir cuid díobh seo a bheith ar thaobh an LAP, mar shampla i ríomhanna taobh istigh den inneall Godot chun rudaí a ullmhú le haghaidh rindreála. Is féidir le craobhálacha tarlú freisin ar an LAP sa tiománaí grafaicí, a shórálann treoracha le dul chuig an GPU, agus i n-aistriú na dtreoracha seo. Agus ar deireadh, tarlaíonn craobhálacha ar an GPU féin freisin.
ja: グラフィックス技術の進化に対する需要により、グラフィックスのボトルネックに遭遇することはほぼ確実です。これらの一部は CPU 側で発生する可能性があり、たとえば、Godot エンジン内でのオブジェクトのレンダリング準備のための計算などでも発生します。CPU上のボトルネックは GPU に渡す命令を分類するグラフィックスドライバーや、これらの命令の転送でも発生する可能性があります。そして最後に、GPU 自体でもボトルネックは発生します。
ru: Потребность в новых графических функциях и прогресс практически гарантированно приводят к возникновению узких мест в графике. Некоторые из них могут быть связаны с центральным процессором, например, с вычислениями в движке Godot для подготовки объектов к рендерингу. Узкие места могут также возникать в центральном процессоре, в графическом драйвере, который сортирует инструкции для передачи в графический процессор, и при передаче этих инструкций. И наконец, узкие места возникают и в самом графическом процессоре.
ta: புதிய கிராபிக்ச் நற்பொருத்தங்கள் மற்றும் முன்னேற்றத்திற்கான தேவை நீங்கள் கிராபிக்ச் இடையூறுகளை சந்திப்பீர்கள் என்று கிட்டத்தட்ட பொறுப்பு அளிக்கிறது. இவற்றில் சில சிபியு பக்கத்தில் இருக்கலாம், உதாரணமாக கோடோட் எஞ்சினுக்குள் கணக்கீடுகளில் வழங்குதல் செய்வதற்கான பொருள்களைத் தயாரிக்கலாம். கிராபிக்ச் டிரைவரில் சிபியு இல் சிக்கல் ஏற்படலாம், இது GPU க்கு அனுப்ப வழிமுறைகளை வகைப்படுத்துகிறது, மேலும் இந்த வழிமுறைகளை மாற்றுவதில். இறுதியாக, சி.பீ.யிலும் இடையூறுகளும் நிகழ்கின்றன.
zh_tw: 對於新圖形功能與進步的需求，幾乎可以確定你會遇到圖形瓶頸。有些瓶頸可能發生在 CPU 端，例如 Godot 引擎內部為算繪物件所做的計算。有時瓶頸也可能出現在圖形驅動程式的 CPU 部分，負責整理並傳遞指令給 GPU，或是指令傳輸過程中。最終，瓶頸也會發生在 GPU 本身。

source: Where bottlenecks occur in rendering is highly hardware-specific. Mobile GPUs in particular may struggle with scenes that run easily on desktop.
ga: Nuair a tharlaíonn scrogaill i rindreáil tá sé an-sonrach ar chrua-earraí. Féadfaidh GPUanna soghluaiste go háirithe a bheith ag streachailt le radhairc a ritheann go héasca ar dheasc.
ja: レンダリングでボトルネックが発生する場所は、ハードウェアによって大きく異なります。特にモバイル GPU では、デスクトップでは簡単に実行できるシーンでも問題が発生する可能性があります。
ru: Узкие места при рендеринге сильно зависят от аппаратного обеспечения. Мобильные видеокарты, в частности, могут испытывать трудности со сценами, которые легко воспроизводятся на настольных компьютерах.
ta: வழங்குதல் செய்வதில் இடையூறுகள் ஏற்படும் இடத்தில் மிகவும் வன்பொருள் சார்ந்தது. குறிப்பாக மொபைல் சி.பீ.யுகள் டெச்க்டாப்பில் எளிதில் இயங்கும் காட்சிகளுடன் போராடக்கூடும்.
zh_tw: 算繪時瓶頸出現的位置高度依賴於硬體。特別是行動裝置上的 GPU，可能會對於桌面端能輕鬆運作的場景感到吃力。

source: Understanding and investigating GPU bottlenecks is slightly different to the situation on the CPU. This is because, often, you can only change performance indirectly by changing the instructions you give to the GPU. Also, it may be more difficult to take measurements. In many cases, the only way of measuring performance is by examining changes in the time spent rendering each frame.
ga: Tá strugaill GPU a thuiscint agus a imscrúdú beagán difriúil leis an staid ar an LAP. Tá sé seo toisc, go minic, ní féidir leat feidhmíocht a athrú go hindíreach ach trí na treoracha a thugann tú don GPU a athrú. Chomh maith leis sin, d'fhéadfadh go mbeadh sé níos deacra tomhais a dhéanamh. I go leor cásanna, is é an t-aon bhealach chun feidhmíocht a thomhas ná athruithe a scrúdú ar an am a chaitear ag rindreáil gach fráma.
ja: GPU のボトルネックを理解して調査することは、CPU の状況とは少し異なります。これは多くの場合、GPU に与える命令を変更することによってのみ間接的にパフォーマンスを改善できるからです。また、測定を行うことがより困難な場合があります。多くの場合、パフォーマンスを測定する唯一の方法は、各フレームのレンダリングに費やされる時間の変化を調べることです。
ru: Понимание и исследование узких мест графического процессора несколько отличается от ситуации с центральным процессором. Это связано с тем, что зачастую производительность можно изменить только косвенно, изменяя инструкции, передаваемые графическому процессору. Кроме того, проводить измерения может быть сложнее. Во многих случаях единственный способ измерить производительность — это изучить изменения времени, затрачиваемого на рендеринг каждого кадра.
ta: சி.பீ.யு இடையூறுகளைப் புரிந்துகொள்வதும் விசாரிப்பதும் சிபியு இன் நிலைமைக்கு சற்று வித்தியாசமானது. ஏனென்றால், பெரும்பாலும், நீங்கள் சி.பீ.யுக்கு வழங்கும் வழிமுறைகளை மாற்றுவதன் மூலம் மட்டுமே செயல்திறனை மறைமுகமாக மாற்ற முடியும். மேலும், அளவீடுகளை எடுப்பது மிகவும் கடினமாக இருக்கலாம். பல சந்தர்ப்பங்களில், செயல்திறனை அளவிடுவதற்கான ஒரே வழி ஒவ்வொரு சட்டகத்தையும் வழங்கும் நேரத்தின் மாற்றங்களை ஆராய்வதுதான்.
zh_tw: 理解並分析 GPU 瓶頸與 CPU 上的情況略有不同。這是因為你通常只能透過改變給 GPU 的指令來間接調整效能。此外，量測起來也較困難。在許多情況下，唯一能衡量效能的方式就是觀察每個影格的算繪時間變化。

source: Draw calls, state changes, and APIs
ga: Tarraing glaonna, athruithe stáit, agus APIs
ja: ドローコール、ステート変更、API
ru: Вызовы отрисовки, изменения состояния и API-ы
ta: அழைப்புகள், மாநில மாற்றங்கள் மற்றும் பநிஇ கள்
zh_tw: 繪圖呼叫、狀態切換與 API

source: The following section is not relevant to end-users, but is useful to provide background information that is relevant in later sections.
ga: Níl an chuid seo a leanas ábhartha d'úsáideoirí deiridh, ach tá sé úsáideach chun faisnéis chúlra atá ábhartha i ranna níos déanaí a sholáthar.
ja: 次のセクションはエンドユーザーには関係ありませんが、後のセクションに関連する背景情報を理解するのに役立ちます。
ru: Следующий раздел не предназначен для конечных пользователей, но полезен для предоставления справочной информации, которая будет важна в последующих разделах.
ta: பின்வரும் பிரிவு இறுதி பயனர்களுக்கு பொருந்தாது, ஆனால் பிற்கால பிரிவுகளில் பொருத்தமான பின்னணி தகவல்களை வழங்க பயனுள்ளதாக இருக்கும்.
zh_tw: 以下內容雖然與終端使用者無直接關聯，但能協助理解後續章節所需的背景知識。

source: Godot sends instructions to the GPU via a graphics API (Vulkan, OpenGL, OpenGL ES or WebGL). The communication and driver activity involved can be quite costly, especially in OpenGL, OpenGL ES and WebGL. If we can provide these instructions in a way that is preferred by the driver and GPU, we can greatly increase performance.
ga: Seolann Godot treoracha chuig an GPU trí API grafaicí (Vulkan, OpenGL, OpenGL ES nó WebGL). Is féidir leis an ngníomhaíocht cumarsáide agus tiománaí atá i gceist a bheith costasach go leor, go háirithe i OpenGL, OpenGL ES agus WebGL. Más féidir linn na treoracha seo a sholáthar ar bhealach is fearr leis an tiománaí agus an GPU, is féidir linn feidhmíocht a mhéadú go mór.
ja: Godot はグラフィックス API (Vulkan、OpenGL、OpenGL ES、WebGL など) を介して GPU に命令を送信します。関連する通信とドライバーのアクティビティは、特に OpenGL、OpenGL ES、WebGL では、かなりコストがかかる可能性があります。ドライバーと GPU の最適な方法でこれらの命令を実行できれば、パフォーマンスは大幅に向上できます。
ru: Godot отправляет инструкции графическому процессору через графический API (Vulkan, OpenGL, OpenGL ES или WebGL). Соответствующие коммуникации и действия драйвера могут быть весьма затратными, особенно в OpenGL, OpenGL ES и WebGL. Если мы сможем предоставить эти инструкции в удобном для драйвера и графического процессора виде, мы сможем значительно повысить производительность.
ta: கோடோட் சி.பீ.யுக்கு கிராபிக்ச் பநிஇ (வல்கன், ஓபன்சிஎல், ஓபன்சிஎல் இஎச் அல்லது வெப்சிஎல்) வழியாக வழிமுறைகளை அனுப்புகிறது. சம்பந்தப்பட்ட தகவல்தொடர்பு மற்றும் இயக்கி செயல்பாடு மிகவும் விலை உயர்ந்ததாக இருக்கும், குறிப்பாக ஓபன்சிஎல், ஓபன்சிஎல் இஎச் மற்றும் வெப்சிஎல். இயக்கி மற்றும் சி.பீ.யுவால் விரும்பப்படும் வகையில் இந்த வழிமுறைகளை நாம் வழங்க முடிந்தால், செயல்திறனை நாம் பெரிதும் அதிகரிக்க முடியும்.
zh_tw: Godot 透過圖形 API（Vulkan、OpenGL、OpenGL ES 或 WebGL）向 GPU 發送指令。這些溝通與驅動處理會消耗不少資源，特別是在 OpenGL、OpenGL ES 與 WebGL 上。如果我們能以驅動程式和 GPU 最佳化的方式給予指令，則可以大幅提升效能。

source: Nearly every API command in OpenGL requires a certain amount of validation to make sure the GPU is in the correct state. Even seemingly simple commands can lead to a flurry of behind-the-scenes housekeeping. Therefore, the goal is to reduce these instructions to a bare minimum and group together similar objects as much as possible so they can be rendered together, or with the minimum number of these expensive state changes.
ga: Éilíonn beagnach gach ordú API i OpenGL méid áirithe bailíochtaithe chun a chinntiú go bhfuil an GPU sa staid cheart. Is féidir le fiú orduithe simplí a bheith mar thoradh ar fhorduithe cosúil le coimeád tí taobh thiar de na radhairc. Dá bhrí sin, is é an aidhm ná na treoracha seo a laghdú go híosmhéid lom agus rudaí comhchosúla a ghrúpáil le chéile a oiread agus is féidir ionas gur féidir iad a léiriú le chéile, nó leis an líon íosta de na hathruithe stáit daor seo.
ja: OpenGL のほぼすべての API コマンドでは、GPU が正しい状態で実行されることを確認するために、ある程度の検証が必要です。一見単純なコマンドでも、舞台裏で大量の加工処理が発生する可能性があります。したがって、目標はこれらの命令を最小限に減らし、類似のオブジェクトをできるだけグループ化して、一緒にレンダリングできるようにするか、これらのコストのかかるステート変更を最小限に抑えることです。
ru: Практически каждая команда API в OpenGL требует определённой проверки, чтобы убедиться, что графический процессор находится в правильном состоянии. Даже кажущиеся простыми команды могут привести к потоку скрытых действий. Поэтому цель состоит в том, чтобы свести эти инструкции к минимуму и максимально сгруппировать похожие объекты, чтобы их можно было отрисовывать вместе или с минимальным количеством этих дорогостоящих изменений состояния.
ta: ஓபன்சிஎல்லில் உள்ள ஒவ்வொரு பநிஇ கட்டளைக்கும் சி.பீ.யூ சரியான நிலையில் இருப்பதை உறுதிசெய்ய ஒரு குறிப்பிட்ட அளவு சரிபார்ப்பு தேவைப்படுகிறது. எளிமையான கட்டளைகள் கூட திரைக்குப் பின்னால் வீட்டுப் பராமரிப்புக்கு வழிவகுக்கும். ஆகையால், இந்த வழிமுறைகளை குறைந்தபட்சம் மற்றும் குழுவில் ஒரே மாதிரியான பொருள்களைக் குறைப்பதே குறிக்கோள், எனவே அவை ஒன்றாக வழங்கப்படலாம், அல்லது இந்த விலையுயர்ந்த மாநில மாற்றங்களின் குறைந்தபட்ச எண்ணிக்கையுடன்.
zh_tw: 在 OpenGL 中，幾乎每個 API 指令都必須做一定的驗證，以確保 GPU 處於正確狀態。即使是看似簡單的指令，也會引發大量幕後的管理作業。因此，我們的目標是將這些指令減至最低，並盡可能將相似的物件分組，以便一起算繪，或以最少的昂貴狀態切換完成。

source: 2D batching
ga: Baisceáil 2D
ja: 2Dバッチ処理
pt_br: Processamento por lotes 2D
ru: 2D-партийная обработка
ta: 2 டி தொகுதி
zh_tw: 2D 批次處理（Batching）

source: In 2D, the costs of treating each item individually can be prohibitively high - there can easily be thousands of them on the screen. This is why 2D *batching* is used with OpenGL-based rendering methods. Multiple similar items are grouped together and rendered in a batch, via a single draw call, rather than making a separate draw call for each item. In addition, this means state changes, material and texture changes can be kept to a minimum.
ga: I 2D, is féidir na costais a bhaineann le gach mír a chóireáil ina n-aonar a bheith thar a bheith ard - is féidir na mílte acu a bheith ar an scáileán go héasca. Sin é an fáth go n-úsáidtear 2D* batching* le modhanna rindreála bunaithe ar OpenGL. Déantar iolracha míreanna comhchosúla a ghrúpáil le chéile agus a léiriú i mbaisc, trí ghlao tarraingthe amháin, seachas glao tarraingthe ar leithligh a dhéanamh do gach mír. Ina theannta sin, ciallaíonn sé seo gur féidir athruithe stáit, athruithe ábhair agus uigeachta a choinneáil ar a laghad.
zh_tw: 在 2D 算繪中，逐一處理每個物件的成本可能極高——畫面上很容易就有上千個物件。這也是為什麼在基於 OpenGL 的算繪中會使用 2D *批次處理（Batching）*。多個相似物件會合併成一個批次，僅用一次繪圖呼叫（draw call）一起算繪，而不是每個物件都單獨呼叫一次。此外，這也能將狀態切換、材質與紋理變更降至最低。

source: Vulkan-based rendering methods do not use 2D batching yet. Since draw calls are much cheaper with Vulkan compared to OpenGL, there is less of a need to have 2D batching (although it can still be beneficial in some cases).
ga: Ní úsáideann modhanna rindreála bunaithe ar an Vulcan baisceáil 2D fós. Ós rud é go bhfuil glaonna tarraingthe i bhfad níos saoire le Vulkan i gcomparáid le OpenGL, tá níos lú gá le baisceáil 2D a bheith agat (cé gur féidir leis a bheith tairbheach fós i gcásanna áirithe).
zh_tw: 基於 Vulkan 的算繪目前尚未採用 2D 批次處理。由於 Vulkan 的繪圖呼叫成本遠低於 OpenGL，因此對於 2D 批次處理的需求較低（但在某些情境下仍可能帶來效益）。

source: 3D batching
ga: Baisceáil 3D
ja: 3Dバッチ処理
pt_br: Processamento por lotes 3D
ru: 3D batching (пакетирование)
ta: 3 டி தொகுதி
zh_tw: 3D 批次處理（Batching）

source: In 3D, we still aim to minimize draw calls and state changes. However, it can be more difficult to batch together several objects into a single draw call. 3D meshes tend to comprise hundreds or thousands of triangles, and combining large meshes in real-time is prohibitively expensive. The costs of joining them quickly exceeds any benefits as the number of triangles grows per mesh. A much better alternative is to **join meshes ahead of time** (static meshes in relation to each other). This can be done by artists, or programmatically within Godot using an add-on.
ga: I 3D, tá mar aidhm againn fós glaonna tarraingthe agus athruithe stáit a íoslaghdú. Mar sin féin, is féidir go mbeadh sé níos deacra roinnt rudaí a bhrú le chéile i nglao tarraingthe aonair. Is gnách go mbíonn na céadta nó na mílte triantáin i measc mogalra 3D, agus tá mogalra móra a chomhcheangal i bhfíor-am thar a bheith costasach. Sáraíonn na costais a bhaineann le dul leo go tapa aon sochair de réir mar a fhásann líon na dtriantáin in aghaidh an mogalra. Rogha eile i bhfad níos fearr ná **mogalaí a cheangal roimh aim** (mogalra statacha i ndáil lena chéile). Is féidir leis seo a dhéanamh ag ealaíontóirí, nó go cláraitheach laistigh de Godot ag baint úsáide as breiseán.
ja: 3D でもドローコールとステート変更を最小限に抑えることを目指しています。ただし、複数のオブジェクトを 1 回の描画呼び出しにまとめるのは難しくなります。3D メッシュは数百または数千の三角形で構成される傾向があり、大規模なメッシュをリアルタイムで結合するのは非常に高コストです。メッシュあたりの三角形の数が増えると、結合にかかるコストがすぐにメリットを上回ります。より優れた代替手段は、**事前にメッシュを結合** (互いに関連した静的メッシュ) することです。これはアーティストが行うことも、アドオンを使用して Godot 内でプログラム的に行うこともできます。
ru: В 3D мы по-прежнему стремимся минимизировать количество вызовов отрисовки и изменений состояния. Однако объединить несколько объектов в один вызов отрисовки может быть сложнее. 3D-сетки, как правило, состоят из сотен или тысяч треугольников, а объединение больших сеток в реальном времени обходится непомерно дорого. Затраты на их объединение быстро перевешивают любые выгоды по мере роста числа треугольников в сетке. Гораздо лучшей альтернативой является **предварительное объединение сеток** (статичных сеток относительно друг друга). Это могут сделать художники или программно в Godot с помощью дополнения.
ta: 3D இல், டிரா அழைப்புகள் மற்றும் மாநில மாற்றங்களைக் குறைப்பதை நாங்கள் இன்னும் நோக்கமாகக் கொண்டுள்ளோம். இருப்பினும், பல பொருள்களை ஒரே டிரா அழைப்பில் ஒன்றாக இணைப்பது மிகவும் கடினம். 3 டி மெச்கள் நூற்றுக்கணக்கான அல்லது ஆயிரக்கணக்கான முக்கோணங்களைக் கொண்டிருக்கின்றன, மேலும் பெரிய நேரத்தில் பெரிய மெச்களை இணைப்பது தடைசெய்யக்கூடிய விலையுயர்ந்தது. அவற்றில் சேருவதற்கான செலவுகள் ஒரு கண்ணிக்கு முக்கோணங்களின் எண்ணிக்கை வளரும்போது விரைவாக எந்த நன்மைகளையும் மீறுகிறது. ஒரு சிறந்த மாற்று என்பது ** நேரத்திற்கு முன்பே மெச்களில் சேர வேண்டும் ** (ஒருவருக்கொருவர் தொடர்பாக நிலையான மெச்கள்). இதை கலைஞர்களால் செய்ய முடியும், அல்லது ஒரு துணை நிரலைப் பயன்படுத்தி கோடோட்டிற்குள் நிரல் முறையில் செய்ய முடியும்.
zh_tw: 在 3D 算繪中，我們同樣希望減少繪圖呼叫與狀態切換。不過，將多個 3D 物件合併成單一繪圖呼叫會更困難。3D 網格通常包含數百到數千個三角形，實時合併大型網格的成本極高。隨著每個網格三角形數增加，合併的效益很快就被成本抵銷。一個更好的做法是**事先將網格合併**（即靜態物件之間的合併），可以由美術人員在 DCC 工具中完成，也可在 Godot 內透過外掛程式自動化。

source: There is also a cost to batching together objects in 3D. Several objects rendered as one cannot be individually culled. An entire city that is off-screen will still be rendered if it is joined to a single blade of grass that is on screen. Thus, you should always take objects' location and culling into account when attempting to batch 3D objects together. Despite this, the benefits of joining static objects often outweigh other considerations, especially for large numbers of distant or low-poly objects.
ga: Tá costas ag baint le rudaí a bhaisceadh le chéile i 3D freisin. Ní féidir roinnt rudaí a rinneadh mar cheann a bhaint ina n-aonar. Déanfar cathair iomlán nach bhfuil den scáileán a rindreáil fós má cheanglaítear í le lann amháin féir atá ar an scáileán. Mar sin, ba cheart duit suíomh agus marú réad a chur san áireamh i gcónaí agus tú ag iarraidh rudaí 3D a bhaisceáil le chéile. Ina ainneoin sin, is minic go mbíonn na buntáistí a bhaineann le rudaí statacha a nascadh le chéile níos mó ná cúinsí eile, go háirithe maidir le líon mór rudaí i bhfad i gcéin nó le polai-íseal.
zh_tw: 3D 批次處理也有其代價。多個物件合併算繪後，無法單獨做遮蔽剔除（culling）。例如如果一整座在螢幕外的城市被合併到一片在螢幕上的草地，全部都會被算繪。因此，在批次處理 3D 物件時，務必考慮物件位置與遮蔽剔除。儘管如此，靜態物件事先合併在多數情況下帶來的效益仍大於缺點，尤其適用於大量遠距或低多邊形物件。

source: For more information on 3D specific optimizations, see :ref:`doc_optimizing_3d_performance`.
ga: Le haghaidh tuilleadh faisnéise faoi bharrfheabhsuithe sonracha 3D, féach:ref: `doc_optimizing_3d_performance`.
it: Per più informazioni su ottimizzazioni specifiche al 3D, consultare :ref:`doc_optimizing_3d_performance`.
ja: 3D 固有の最適化の詳細については、 :ref:`doc_optimizing_3d_performance` を参照してください。
pt_br: Para mais informações sobre otimizações específicas em 3D, veja :ref:`doc_optimizing_3d_performance`.
ru: Для получения дополнительной информации о специальных 3D-оптимизациях см. :ref:`doc_optimizing_3d_performance`.
ta: 3D குறிப்பிட்ட மேம்படுத்தல்கள் பற்றிய கூடுதல் தகவலுக்கு, பார்க்க: குறிப்பு: `Doc_optimiging_3d_performance`.
zh_tw: 如需更多 3D 特定最佳化資訊，請參考 :ref:`doc_optimizing_3d_performance`。

source: Reuse shaders and materials
ga: Athúsáid scáthóirí agus ábhair
it: Riutilizza gli shader e i materiali
ja: シェーダーとマテリアルの再利用
ru: Повторное использование шейдеров и материалов
ta: சேடர்கள் மற்றும் பொருட்களை மீண்டும் பயன்படுத்தவும்
zh_tw: 重複利用著色器與材質

source: The Godot renderer is a little different to what is out there. It's designed to minimize GPU state changes as much as possible. :ref:`StandardMaterial3D <class_StandardMaterial3D>` does a good job at reusing materials that need similar shaders. If custom shaders are used, make sure to reuse them as much as possible. Godot's priorities are:
ga: Tá an rindreálaí Godot beagán difriúil ón méid atá amuigh ansin. Tá sé deartha chun athruithe stáit GPU a íoslaghdú oiread agus is féidir. :ref:`StandardMaterial3D <class_StandardMaterial3D>` déanann sé jab maith ag athúsáid ábhair a dteastaíonn scáthaitheoirí den chineál céanna uathu. Má úsáidtear shaders saincheaptha, déan cinnte iad a athúsáid oiread agus is féidir. Is iad tosaíochtaí Godot:
ja: Godot レンダラーは、既存のレンダラーとは少し異なります。GPU の状態変化を可能な限り最小限に抑えるように設計されています。:ref:`StandardMaterial3D <class_StandardMaterial3D>` は、同様のシェーダーを必要とするマテリアルの再利用に優れています。カスタム シェーダーを使用する場合は、可能な限り再利用するようにしてください。Godot の優先順位は次のとおりです。
ru: Рендерер Godot немного отличается от существующих. Он разработан, чтобы максимально минимизировать изменения состояния графического процессора. :ref:`StandardMaterial3D <class_StandardMaterial3D>` хорошо справляется с повторным использованием материалов, требующих схожих шейдеров. Если используются пользовательские шейдеры, обязательно используйте их повторно как можно чаще. Приоритеты Godot:
ta: கோடோட் ரெண்டரர் அங்குள்ளதை விட சற்று வித்தியாசமானது. இது சி.பீ.யூ மாநில மாற்றங்களை முடிந்தவரை குறைக்க வடிவமைக்கப்பட்டுள்ளது. . தனிப்பயன் சேடர்கள் பயன்படுத்தப்பட்டால், அவற்றை முடிந்தவரை மீண்டும் பயன்படுத்துவதை உறுதிப்படுத்திக் கொள்ளுங்கள். கோடோட்டின் முன்னுரிமைகள்:
zh_tw: Godot 的算繪器設計與其他引擎略有不同，目標是盡量減少 GPU 狀態切換。 :ref:`StandardMaterial3D <class_StandardMaterial3D>` 能在需要相似著色器時有效重複利用材質。如果你使用自訂著色器，也請儘可能進行重複利用。Godot 的優化優先順序如下：

source: **Reusing Materials:** The fewer different materials in the scene, the faster the rendering will be. If a scene has a huge amount of objects (in the hundreds or thousands), try reusing the materials. In the worst case, use atlases to decrease the amount of texture changes.
ga: **Ábhair Athúsáid: ** An níos lú ábhair éagsúla sa radharc, is tapa a bheidh an rindreáil. Má tá méid ollmhór rudaí ag radharc (sna céadta nó na mílte), déan iarracht na hábhair a athúsáid. Sa chás is measa, bain úsáid as atlasanna chun méid na n-athruithe uigeachta a laghdú.
ja: **マテリアルの再利用**: シーン内の異なるマテリアルが少ないほど、レンダリングは高速になります。シーンに大量のオブジェクト (数百または数千) がある場合は、マテリアルを再利用するか、アトラスを使用してテクスチャの変更量を減らしましょう。
ru: **Повторное использование материалов:** Чем меньше различных материалов в сцене, тем быстрее будет рендеринг. Если в сцене огромное количество объектов (сотни или тысячи), попробуйте повторно использовать материалы. В худшем случае используйте атласы, чтобы уменьшить количество изменений текстур.
ta: ** மீண்டும் பயன்படுத்துதல் பொருட்கள்: ** காட்சியில் குறைவான வேறுபட்ட பொருட்கள், வழங்குதல் வேகமாக இருக்கும். ஒரு காட்சியில் ஒரு பெரிய அளவு பொருள்கள் இருந்தால் (நூற்றுக்கணக்கான அல்லது ஆயிரக்கணக்கானவற்றில்), பொருட்களை மீண்டும் பயன்படுத்த முயற்சிக்கவும். மோசமான நிலையில், அமைப்பு மாற்றங்களின் அளவைக் குறைக்க அட்லசைப் பயன்படுத்தவும்.
zh_tw: **重複利用材質：** 場景中材質種類越少，算繪速度就越快。如果場景中物件數量龐大（數百到數千），應盡可能共用材質。最糟情況下，可使用圖集（atlas）來減少紋理切換次數。

source: **Reusing Shaders:** If materials can't be reused, at least try to reuse shaders. Note: shaders are automatically reused between StandardMaterial3Ds that share the same configuration (features that are enabled or disabled with a check box) even if they have different parameters.
ga: ** Athúsáid Scádóirí: ** Mura féidir ábhair a athúsáid, déan iarracht ar a laghad scáthóirí a athúsáid. Nóta: athúsáidtear scáthóirí go huathoibríoch idir StandardMaterial3DS a roinneann an chumraíocht chéanna (gnéithe atá cumasaithe nó míchumasaithe le bosca seiceála) fiú má tá paraiméadair éagsúla acu.
ja: **シェーダーの再利用:** マテリアルを再利用できない場合は、少なくともシェーダーを再利用してみてください。注: StandardMaterial3D は、パラメータが異なっていても、同じ構成 (チェックボックスで有効または無効にされる機能) のシェーダーを自動的に再利用します。
ru: **Повторное использование шейдеров:** Если материалы невозможно использовать повторно, попробуйте хотя бы повторно использовать шейдеры. Примечание: шейдеры автоматически используются повторно между объектами StandardMaterial3D, имеющими одинаковую конфигурацию (функции, включаемые или отключаемые флажком), даже если у них разные параметры.
ta: ** சேடர்களை மீண்டும் பயன்படுத்துதல்: ** பொருட்களை மீண்டும் பயன்படுத்த முடியாவிட்டால், குறைந்தபட்சம் சேடர்களை மீண்டும் பயன்படுத்த முயற்சிக்கவும். குறிப்பு: வெவ்வேறு அளவுருக்கள் இருந்தாலும் கூட அதே உள்ளமைவைப் பகிரும் அதே உள்ளமைவைப் பகிரும் (ஒரு தேர்வுப்பெட்டியுடன் இயக்கப்பட்ட அல்லது முடக்கப்பட்ட அம்சங்கள்) இடையே சேடர்கள் தானாகவே மீண்டும் பயன்படுத்தப்படுகின்றன.
zh_tw: **重複利用著色器：** 如果材質無法共用，至少要嘗試共用著色器。注意：只要 StandardMaterial3D 設定相同（例如核取方塊開關的功能），即使參數不同，Godot 也會自動共用同一份著色器。

source: If a scene has, for example, 20,000 objects with 20,000 different materials each, rendering will be slow. If the same scene has 20,000 objects, but only uses 100 materials, rendering will be much faster.
ga: Má tá, mar shampla, 20,000 réad ag radharc le 20,000 ábhar éagsúil an ceann, beidh rindreáil mall. Má tá 20,000 réad ag an radharc céanna, ach ní úsáideann sé ach 100 ábhar, beidh an rindreáil i bhfad níos gasta.
ja: たとえば、シーンに 20,000 個のオブジェクトがあり、それぞれに 20,000 個の異なるマテリアルがある場合、レンダリングは遅くなります。同じシーンに 20,000 個のオブジェクトがあり、使用するマテリアルが 100 個だけの場合、レンダリングは非常に速くなります。
ru: Например, если в сцене 20 000 объектов, каждый из которых использует 20 000 различных материалов, рендеринг будет медленным. Если же в той же сцене 20 000 объектов, но используется всего 100 материалов, рендеринг будет гораздо быстрее.
ta: ஒரு காட்சியில், எடுத்துக்காட்டாக, 20,000 வெவ்வேறு பொருட்களைக் கொண்ட 20,000 பொருள்கள் இருந்தால், வழங்குதல் மெதுவாக இருக்கும். அதே காட்சியில் 20,000 பொருள்கள் இருந்தால், ஆனால் 100 பொருட்களை மட்டுமே பயன்படுத்தினால், வழங்குதல் மிக வேகமாக இருக்கும்.
zh_tw: 假設一個場景有 20,000 個物件、每個物件都用不同材質，算繪效能會非常低。如果同樣的場景只有 100 種材質共用，算繪就會快許多。
