Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/using_servers.po
Languages: ga, ru, ta, tr, zh_hant

source: It is not advised to control RIDs from objects that already have a node associated. Instead, server functions should always be used for creating and controlling new ones and interacting with the existing ones.
ga: Ní mholtar RIDanna a rialú ó rudaí a bhfuil nód bainteach leo cheana féin. Ina áit sin, ba cheart feidhmeanna freastalaí a úsáid i gcónaí chun cinn nua a chruthú agus a rialú agus chun idirghníomhú leis na cinn atá ann cheana féin.
ru: Не рекомендуется управлять идентификаторами RID объектов, с которыми уже связан узел. Вместо этого следует использовать серверные функции для создания и управления новыми идентификаторами, а также для взаимодействия с существующими.
ta: ஏற்கனவே ஒரு முனை தொடர்புடைய பொருள்களிலிருந்து விடுதலையை கட்டுப்படுத்த அறிவுறுத்தப்படவில்லை. அதற்கு பதிலாக, சேவையக செயல்பாடுகள் எப்போதும் புதியவற்றை உருவாக்குவதற்கும் கட்டுப்படுத்துவதற்கும், ஏற்கனவே உள்ளவற்றுடன் தொடர்புகொள்வதற்கும் பயன்படுத்தப்பட வேண்டும்.
zh_hant: 不建議直接操作已經關聯節點的物件的 RID。要建立或控制新的資源，或與現有資源互動，應該都直接使用伺服器函式來處理。

source: Creating a sprite
ga: Sprite a chruthú
ru: Создание спрайта
ta: ஒரு ச்பிரட்டை உருவாக்குதல்
zh_hant: 建立 Sprite

source: This is an example of how to create a sprite from code and move it using the low-level :ref:`CanvasItem <class_CanvasItem>` API.
ga: Seo sampla de conas sprite a chruthú ón gcód agus é a bhogadh leis an :ref:`CanvasItem <class_CanvasItem>` API.
ru: Это пример того, как создать спрайт из кода и переместить его с помощью низкоуровневого API :ref:`CanvasItem <class_CanvasItem>`.
ta: குறியீட்டிலிருந்து ஒரு ச்ப்ரைட்டை எவ்வாறு உருவாக்குவது மற்றும் குறைந்த அளவைப் பயன்படுத்தி அதை நகர்த்துவது எப்படி என்பதற்கு இது ஒரு எடுத்துக்காட்டு: ref: `Canvasitem <class_canvasitem>` பநிஇ.
zh_hant: 以下範例展示如何用程式碼建立一個精靈（Sprite），並透過底層 :ref:`CanvasItem <class_CanvasItem>` API 來移動它。

source: The Canvas Item API in the server allows you to add draw primitives to it. Once added, they can't be modified. The Item needs to be cleared and the primitives re-added (this is not the case for setting the transform, which can be done as many times as desired).
ga: Ligeann an API Mír Canbhás sa fhreastalaí duit tarraingt primitives a chur leis. Nuair a chuirtear leis, ní féidir iad a mhodhnú. Ní mór an Mír a ghlanadh agus na príomh-mheasanna a athchur leis (ní hamhlaidh atá leis an gclaochlú a shocrú, rud is féidir a dhéanamh oiread uaireanta agus is mian).
ru: API Canvas Item на сервере позволяет добавлять в него примитивы рисования. После добавления их нельзя изменить. Необходимо очистить элемент и заново добавить примитивы (это не относится к настройке преобразования, которую можно выполнять неограниченное количество раз).
ta: சேவையகத்தில் உள்ள கேன்வாச் உருப்படி பநிஇ அதற்கு டிரா ஆதிமனிதர்களைச் சேர்க்க உங்களை அனுமதிக்கிறது. சேர்க்கப்பட்டதும், அவற்றை மாற்ற முடியாது. உருப்படியை அழிக்க வேண்டும் மற்றும் ஆதிமனிதர்கள் மீண்டும் சேர்க்கப்பட வேண்டும் (உருமாற்றத்தை அமைப்பதற்கான விசயமல்ல, இது விரும்பிய பல மடங்கு செய்ய முடியும்).
zh_hant: 伺服器中的 CanvasItem API 允許你向其新增繪圖基本圖元。一旦新增後無法修改，如需變更必須先清除再重新新增（但設定 transform 則不受此限制，可任意次數變更）。

source: Primitives are cleared this way:
ga: Glantar primitives ar an mbealach seo:
ru: Примитивы очищаются следующим образом:
ta: ஆதிமனிதர்கள் இந்த வழியில் அழிக்கப்படுகிறார்கள்:
zh_hant: 清除圖元方式如下：

source: Instantiating a Mesh into 3D space
ga: Mogalra a chur isteach i spás 3D
ru: Создание экземпляра сетки в 3D пространстве
ta: ஒரு கண்ணி 3D இடத்திற்குள் நிறுவுதல்
zh_hant: 在 3D 空間中產生網格實體

source: The 3D APIs are different from the 2D ones, so the instantiation API must be used.
ga: Tá na APIs 3D difriúil ó na cinn 2D, mar sin caithfear an API instantiation a úsáid.
ru: 3D API-ы отличаются от 2D, поэтому необходимо использовать API создания экземпляров.
ta: 3D பநிஇ கள் 2D இலிருந்து வேறுபட்டவை, எனவே உடனடி பநிஇ பயன்படுத்தப்பட வேண்டும்.
zh_hant: 3D 的 API 與 2D 不同，因此必須使用專屬的產生實體 API。

source: Creating a 2D RigidBody and moving a sprite with it
ga: RigidBody 2D a chruthú agus sprite a bhogadh leis
ru: Создание 2D RigidBody и перемещение спрайта с его помощью
ta: 2 டி ரிகிட்போடியை உருவாக்கி, அதனுடன் ஒரு ச்ப்ரைட்டை நகர்த்தவும்
zh_hant: 建立 2D 剛體並用它移動精靈

source: This creates a :ref:`RigidBody2D <class_RigidBody2D>` using the :ref:`PhysicsServer2D <class_PhysicsServer2D>` API, and moves a :ref:`CanvasItem <class_CanvasItem>` when the body moves.
ga: Cruthaíonn sé seo :ref:`RigidBody2D <class_RigidBody2D>` ag baint úsáide as an :ref:`PhysicsServer2D <class_PhysicsServer2D>` API, agus bogann sé :ref:`CanvasItem <class_CanvasItem>` nuair a bhogann an corp.
ru: Это создает :ref:`RigidBody2D <class_RigidBody2D>` с помощью API :ref:`PhysicsServer2D <class_PhysicsServer2D>` и перемещает :ref:`CanvasItem <class_CanvasItem>` при перемещении тела.
ta: இது ஒரு: ref: `rigidbody2d <class_rigidbody2d>` ஐப் பயன்படுத்துகிறது: ref: `இயற்பியல்:` class_physicsserver2d> `api ஐ நகர்த்துகிறது: ref:` canvasitem <class_canvasitem> `உடல் நகரும் போது.
zh_hant: 這會透過 :ref:`PhysicsServer2D <class_PhysicsServer2D>` API 建立一個 :ref:`RigidBody2D <class_RigidBody2D>`，並在剛體移動時同步移動一個 :ref:`CanvasItem <class_CanvasItem>`。

source: The 3D version should be very similar, as 2D and 3D physics servers are identical (using :ref:`RigidBody3D <class_RigidBody3D>` and :ref:`PhysicsServer3D <class_PhysicsServer3D>` respectively).
ga: Ba cheart go mbeadh an leagan 3D an-chosúil, toisc go bhfuil freastalaithe fisice 2D agus 3D comhionann (ag baint úsáide as :ref:`RigidBody3D <class_RigidBody3D>` agus :ref:`FisicServer3D <class_PhysicsServer3D>` faoi seach).
ru: 3D-версия должна быть очень похожа, поскольку 2D- и 3D-физические серверы идентичны (используют :ref:`RigidBody3D <class_RigidBody3D>` и :ref:`PhysicsServer3D <class_PhysicsServer3D>` соответственно).
ta: 3 டி பதிப்பு மிகவும் ஒத்ததாக இருக்க வேண்டும், ஏனெனில் 2 டி மற்றும் 3 டி இயற்பியல் சேவையகங்கள் ஒரே மாதிரியானவை (பயன்படுத்துதல்: `ரிகிட் பாடி 3 டி <class_rigidbody3d>` மற்றும்: ref: `` இயற்பியல்_பைசிக்ச்செர்வர் 3 டி> `முறையே).
zh_hant: 3D 版本也大同小異，因為 2D 與 3D 物理伺服器的用法幾乎一致（分別使用 :ref:`RigidBody3D <class_RigidBody3D>` 與 :ref:`PhysicsServer3D <class_PhysicsServer3D>`）。

source: Getting data from the servers
ga: Sonraí a fháil ó na freastalaithe
ru: Получение данных с серверов
ta: சேவையகங்களிலிருந்து தரவைப் பெறுதல்
zh_hant: 從伺服器取得資料

source: Try to **never** request any information from ``RenderingServer``, ``PhysicsServer2D`` or ``PhysicsServer3D`` by calling functions unless you know what you are doing. These servers will often run asynchronously for performance and calling any function that returns a value will stall them and force them to process anything pending until the function is actually called. This will severely decrease performance if you call them every frame (and it won't be obvious why).
ga: Déan iarracht riam** aon fhaisnéis a iarraidh ó `RenderingServer``, `PhysicsServer2D`` nó ``PhysicsServer3d`` trí fheidhmeanna a ghlaoch mura bhfuil a fhios agat cad atá á dhéanamh agat. Is minic a rithfidh na freastalaithe seo go hincrónach le haghaidh feidhmíochta agus cuirfidh glaoch ar aon fheidhm a thugann luach isteach orthu agus cuirfidh siad iallach orthu aon rud ar feitheamh a phróiseáil go dtí go dtugtar an fheidh Laghdóidh sé seo feidhmíocht go mór má ghlaonn tú gach fráma orthu (agus ní bheidh sé soiléir cén fáth).
ru: Старайтесь **НИКОГДА** не запрашивать информацию у ``RenderingServer``, ``PhysicsServer2D`` или ``PhysicsServer3D``, вызывая функции, если вы не знаете, что делаете. Эти серверы часто работают асинхронно для повышения производительности, и вызов любой функции, возвращающей значение, остановит их и заставит обрабатывать всё, что ожидает, до тех пор, пока функция не будет вызвана. Это значительно снизит производительность, если вы будете вызывать их в каждом кадре (и причина будет неясна).
ta: நீங்கள் என்ன செய்கிறீர்கள் என்று உங்களுக்குத் தெரியாவிட்டால், `` `இயற்பியல் சேவையகம்`, `` `இயற்பியல் சேவையகம் 2 டி`` அல்லது` `இயற்பியல் சேவையகம் 3 டி`` இலிருந்து எந்தவொரு தகவலையும் கோர முயற்சிக்கவும். இந்த சேவையகங்கள் பெரும்பாலும் செயல்திறனுக்காக ஒத்திசைவற்ற முறையில் இயங்கும் மற்றும் ஒரு மதிப்பைத் தரும் எந்தவொரு செயல்பாட்டையும் அழைப்பது அவற்றை நிறுத்தி, செயல்பாடு உண்மையில் அழைக்கப்படும் வரை நிலுவையில் உள்ள எதையும் செயலாக்கும்படி கட்டாயப்படுத்தும். ஒவ்வொரு சட்டகத்தையும் நீங்கள் அழைத்தால் இது செயல்திறனைக் கடுமையாகக் குறைக்கும் (ஏன் ஏன் தெளிவாக இருக்காது).
zh_hant: 除非你非常確定自己在做什麼，否則**千萬不要**直接呼叫 ``RenderingServer``、``PhysicsServer2D`` 或 ``PhysicsServer3D`` 來請求資料。這些伺服器通常為了效能是非同步執行的，任何會回傳數值的函式呼叫都會造成伺服器暫停，強制等待所有待處理事項完成再回傳結果。如果你每一幀都這樣呼叫，效能會大幅下降，而且原因可能不明顯。

source: Because of this, most APIs in such servers are designed so it's not even possible to request information back, until it's actual data that can be saved.
ga: Mar gheall air seo, tá an chuid is mó de APIs i bhfreastalaithe den sórt sin deartha mar sin ní féidir faisnéis a iarraidh ar ais fiú, go dtí gur sonraí iarbhír is féidir a shábháil.
ru: По этой причине большинство API-ов на таких серверах спроектированы таким образом, что запросить информацию обратно невозможно, пока не будут сохранены фактические данные.
ta: இதன் காரணமாக, அத்தகைய சேவையகங்களில் உள்ள பெரும்பாலான பநிஇ கள் வடிவமைக்கப்பட்டுள்ளன, எனவே இது சேமிக்கக்கூடிய உண்மையான தரவு வரை தகவல்களை திரும்பக் கோர முடியாது.
zh_hant: 因此，這類伺服器的大多數 API 設計時，通常根本不允許直接回傳資訊，除非是要取得可儲存的實際資料。
