Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/using_servers.po
Languages: ga, ru, ta, tr, zh_hant

source: Optimization using Servers
ga: Optamú ag úsáid Freastalaithe
ru: Оптимизация с помощью серверов
ta: சேவையகங்களைப் பயன்படுத்தி தேர்வுமுறை
tr: Sunucuları kullanarak optimizasyon
zh_hant: 使用伺服器進行最佳化

source: Engines like Godot provide increased ease of use thanks to their high-level constructs and features. Most of them are accessed and used via the :ref:`Scene System<doc_scene_tree>`. Using nodes and resources simplifies project organization and asset management in complex games.
ru: Движки вроде Godot обеспечивают простоту использования благодаря конструкциям высокого уровня. Большинство функций доступны через :ref:`Систему сцен <doc_scene_tree>`. Использование узлов и ресурсов упрощает организацию проекта и управление ассетами в сложных играх.
ta: கோடோட் போன்ற என்சின்கள் அவற்றின் உயர் மட்ட கட்டுமானங்கள் மற்றும் அம்சங்களுக்கு அதிகரித்த பயன்பாட்டை வழங்குகின்றன. அவற்றில் பெரும்பாலானவை அணுகப்பட்டு பயன்படுத்தப்படுகின்றன: ref: `காட்சி அமைப்பு <doc_scene_tree>`. முனைகள் மற்றும் வளங்களைப் பயன்படுத்துவது சிக்கலான விளையாட்டுகளில் திட்ட அமைப்பு மற்றும் சொத்து நிர்வாகத்தை எளிதாக்குகிறது.
zh_hant: 像 Godot 這樣的引擎，因為高階的架構與功能，讓使用上更為方便。大多數功能都是透過 :ref:`場景系統 <doc_scene_tree>` 來存取與使用。利用節點和資源可簡化大型遊戲的專案結構與資產管理。

source: There are, of course, always drawbacks:
ga: Tá míbhuntáistí ann, ar ndóigh, i gcónaí:
ru: Недостатки, конечно, всегда есть:
ta: நிச்சயமாக, எப்போதும் குறைபாடுகள் உள்ளன:
tr: Elbette her zaman bazı dezavantajlar vardır:
zh_hant: 當然，也有一些缺點：

source: There is an extra layer of complexity.
ga: Tá sraith bhreise castachta ann.
ru: Существует дополнительный уровень сложности.
ta: சிக்கலான கூடுதல் அடுக்கு உள்ளது.
tr: Karmaşıklığı arttıran fazladan bir katman var.
zh_hant: 會增加一層額外的複雜度。

source: Performance is lower than when using simple APIs directly.
ga: Tá feidhmíocht níos ísle ná nuair a úsáidtear APIs simplí go díreach.
ru: Производительность ниже, чем при использовании простых API напрямую.
ta: எளிய பநிஇ களை நேரடியாகப் பயன்படுத்துவதை விட செயல்திறன் குறைவாக உள்ளது.
zh_hant: 效能會比直接使用底層 API 來得低。

source: It is not possible to use multiple threads to control them.
ga: Ní féidir snáitheanna iolracha a úsáid chun iad a rialú.
ru: Невозможность использовать несколько потоков для управления.
ta: அவற்றைக் கட்டுப்படுத்த பல நூல்களைப் பயன்படுத்த முடியாது.
zh_hant: 無法直接利用多執行緒來控制它們。

source: More memory is needed.
ga: Tá níos mó cuimhne ag teastáil.
ru: Необходимо больше памяти.
ta: மேலும் நினைவகம் தேவை.
tr: Daha fazla belleğe ihtiyaç duyulur.
zh_hant: 需要消耗更多記憶體。

source: In many cases, this is not really a problem (Godot is very optimized, and most operations are handled with signals, so no polling is required). Still, sometimes it can be. For example, dealing with tens of thousands of instances for something that needs to be processed every frame can be a bottleneck.
ga: I go leor cásanna, ní fadhb í seo i ndáiríre (tá Godot an-optamaithe, agus déantar an chuid is mó de na hoibríochtaí a láimhseáil le comharthaí, mar sin níl aon vótáil ag teastáil). Fós féin, uaireanta is féidir leis a bheith. Mar shampla, is féidir le déileáil le na mílte cás le haghaidh rud éigin a chaithfear a phróiseáil gach fráma a bheith ina scagal.
ru: Во многих случаях это не является проблемой (Godot очень оптимизирован, и большинство операций выполняется с помощью сигналов, поэтому опрос не требуется). Тем не менее, иногда это может быть проблемой. Например, работа с десятками тысяч экземпляров для чего-то, что должно обрабатываться каждый кадр, может стать узким местом.
ta: பல சந்தர்ப்பங்களில், இது உண்மையில் ஒரு சிக்கல் அல்ல (கோடோட் மிகவும் உகந்ததாக உள்ளது, மேலும் பெரும்பாலான செயல்பாடுகள் சமிக்ஞைகளுடன் கையாளப்படுகின்றன, எனவே வாக்குப்பதிவு தேவையில்லை). இன்னும், சில நேரங்களில் அது இருக்க முடியும். எடுத்துக்காட்டாக, ஒவ்வொரு சட்டகத்தையும் செயலாக்க வேண்டிய ஒன்றிற்கான பல்லாயிரக்கணக்கான நிகழ்வுகளை கையாள்வது ஒரு தடையாக இருக்கலாம்.
zh_hant: 在多數情況下這不算太大問題（Godot 本身已高度最佳化，大部分操作也都是透過訊號處理，無需反覆輪詢）。但在某些情境下就會成為瓶頸，例如同時需要在每一影格處理數萬個實例時。

source: This type of situation makes programmers regret they are using a game engine and wish they could go back to a more handcrafted, low-level implementation of game code.
ru: Подобные ситуации заставляют программистов жалеть об использовании игрового движка и желать вернуться к более ручной, низкоуровневой реализации игрового кода.
ta: இந்த வகை நிலைமை புரோகிராமர்களுக்கு அவர்கள் ஒரு விளையாட்டு இயந்திரத்தைப் பயன்படுத்துவதாக வருந்துகிறது, மேலும் அவர்கள் விளையாட்டுக் குறியீட்டின் அதிக கைவினைப்பொருட்கள், குறைந்த அளவிலான செயல்படுத்தலுக்குச் செல்ல விரும்புகிறார்கள்.
zh_hant: 這種情況有時會讓開發者懷念手寫底層程式碼的時光，甚至後悔選擇了遊戲引擎，希望能回到更手工、低階的遊戲實作方式。

source: Still, Godot is designed to work around this problem.
ga: Fós féin, tá Godot deartha chun oibriú timpeall ar an bhfadhb seo.
ru: Тем не менее, Godot разработан для того, чтобы обойти эту проблему.
ta: இன்னும், கோடோட் இந்த சிக்கலைச் சுற்றி வேலை செய்ய வடிவமைக்கப்பட்டுள்ளது.
zh_hant: 不過，Godot 的設計其實能解決這類問題。

source: You can see how using low-level servers works in action using the `Bullet Shower demo project <https://github.com/godotengine/godot-demo-projects/tree/master/2d/bullet_shower>`__
ga: Is féidir leat a fheiceáil conas a oibríonn freastalaithe ísealleibhéil i ngníomh ag baint úsáide as an tionscadal taispeána `Bullet Shower <https://github.com/godotenginine/godot-demo-projects/tree/master/2d/bullet_shower>`__
ru: Вы можете увидеть, как использование низкоуровневых серверов работает в действии, используя `Bullet Shower demo project <https://github.com/godotengine/godot-demo-projects/tree/master/2d/bullet_shower>`__
ta: `புல்லட் சவர் டெமோ திட்டத்தைப் பயன்படுத்தி குறைந்த-நிலை சேவையகங்களைப் பயன்படுத்துவது எவ்வாறு செயல்படுகிறது என்பதை நீங்கள் காணலாம் <https://github.com/godotengine/godotengine
zh_hant: 你可以參考 `Bullet Shower 範例專案 <https://github.com/godotengine/godot-demo-projects/tree/master/2d/bullet_shower>`__ 來觀察如何實際運用底層伺服器 API

source: Servers
ga: Freastalaithe
ru: Серверы
ta: சேவையகங்கள்
tr: Sunucular
zh_hant: 伺服器

source: One of the most interesting design decisions for Godot is the fact that the whole scene system is *optional*. While it is not currently possible to compile it out, it can be completely bypassed.
ga: Ceann de na cinntí dearaidh is suimiúla do Godot ná go bhfuil an córas radhairc iomlán* roghnaí*. Cé nach féidir é a thiomsú amach faoi láthair, is féidir é a sheachaint go hiomlán.
ru: Одним из самых интересных дизайнерских решений для Godot является тот факт, что вся система сцен *необязательна*. Хотя в настоящее время ее невозможно скомпилировать, ее можно полностью обойти.
ta: கோடோட்டிற்கான மிகவும் சுவையான வடிவமைப்பு முடிவுகளில் ஒன்று, முழு காட்சி முறையும் *விருப்பமானது *. தற்போது அதை தொகுக்க முடியாது என்றாலும், அதை முற்றிலும் புறக்கணிக்க முடியும்.
tr: Godot'un en ilginç tasarım seçimlerinden biri de sahne sisteminin tamamen *isteğe bağlı* olmasıdır. Şu anda derleme açısından mümkün olmasa da tamamen baypas edilebilir.
zh_hant: Godot 最有趣的設計決策之一，就是整個場景系統其實是*可選*的。雖然目前沒辦法在編譯時完全移除，但你完全可以選擇不使用它。

source: At the core, Godot uses the concept of Servers. They are very low-level APIs to control rendering, physics, sound, etc. The scene system is built on top of them and uses them directly. The most common servers are:
ga: Ag croílár, úsáideann Godot coincheap Freastalaithe. Is APIs leibhéal an-íseal iad chun rindreáil, fisic, fuaim, srl a rialú Tá an córas radhairc tógtha ar a bharr agus úsáideann siad iad go díreach. Is iad na freastalaithe is coitianta:
ru: В основе Godot лежит концепция серверов. Это очень низкоуровневые API для управления рендерингом, физикой, звуком и т.д. Система сцены построена поверх них и использует их напрямую. Наиболее распространенными серверами являются:
ta: மையத்தில், கோடோட் சேவையகங்களின் கருத்தைப் பயன்படுத்துகிறார். வழங்குதல், இயற்பியல், ஒலி போன்றவற்றைக் கட்டுப்படுத்த அவை மிகக் குறைந்த அளவிலான ஏபிஐக்கள் ஆகும். காட்சி அமைப்பு அவற்றின் மேல் கட்டப்பட்டு அவற்றை நேரடியாகப் பயன்படுத்துகிறது. மிகவும் பொதுவான சேவையகங்கள்:
zh_hant: Godot 核心採用『伺服器』的概念。這些伺服器提供非常底層的 API，負責控制算繪、物理、音訊等功能。場景系統就是建立在這些伺服器之上。最常見的伺服器有：

source: :ref:`RenderingServer <class_RenderingServer>`: handles everything related to graphics.
ga: :ref:`RenderingServer <class_RenderingServer>`: láimhseálann gach rud a bhaineann le grafaic.
ru: :ref:`RenderingServer <class_RenderingServer>`: занимается всем, что связано с графикой.
ta: :ref:`RenderingServer <class_RenderingServer>`: கையாளுகிறது everything related பெறுநர் graphics.
tr: :ref:`RenderingServer <class_RenderingServer>`: grafiklerle ilgili her şeyi idare eder.
zh_hant: :ref:`RenderingServer <class_RenderingServer>`：處理所有與圖形、算繪相關的功能。

source: :ref:`PhysicsServer3D <class_PhysicsServer3D>`: handles everything related to 3D physics.
ga: :ref:`FisicServer3D <class_PhysicsServer3D>`: láimhseálann gach rud a bhaineann le fisic 3D.
ru: :ref:`PhysicsServer3D <class_PhysicsServer3D>`: занимается всем, что связано с трехмерной физикой.
ta: :ref:`PhysicsServer3D <class_PhysicsServer3D>`: கையாளுகிறது everything related பெறுநர் 3D physics.
tr: :ref:`PhysicsServer3D <class_PhysicsServer3D>`: 3D fizikle ilgili her şeyi idare eder.
zh_hant: :ref:`PhysicsServer3D <class_PhysicsServer3D>`：處理所有 3D 物理相關功能。

source: :ref:`PhysicsServer2D <class_PhysicsServer2D>`: handles everything related to 2D physics.
ga: :ref:`FisicServer2D <class_PhysicsServer2D>`: láimhseálann gach rud a bhaineann le fisic 2T.
ru: :ref:`PhysicsServer2D <class_PhysicsServer2D>`: обрабатывает все, что связано с 2D-физикой.
ta: :ref:`PhysicsServer2D <class_PhysicsServer2D>`: கையாளுகிறது everything related பெறுநர் 2D physics.
tr: :ref:`PhysicsServer2D <class_PhysicsServer2D>`: 2D fizikle ilgili her şeyi idare eder.
zh_hant: :ref:`PhysicsServer2D <class_PhysicsServer2D>`：處理所有 2D 物理相關功能。

source: :ref:`AudioServer <class_AudioServer>`: handles everything related to audio.
ga: :ref:`AudioServer <class_AudioServer>`: láimhseálann sé gach rud a bhaineann le fuaim.
ru: :ref:`AudioServer <class_AudioServer>`: обрабатывает все, что связано с аудио.
ta: : குறிப்பு: `ஆடியோசர்வர் <class_audioserver>`: ஆடியோ தொடர்பான அனைத்தையும் கையாளுகிறது.
tr: :ref:`AudioServer <class_AudioServer>`: Ses ile ilgili her şeyi idare eder.
zh_hant: :ref:`AudioServer <class_AudioServer>`：處理所有音訊相關功能。

source: Explore their APIs and you will realize that all the functions provided are low-level implementations of everything Godot allows you to do.
ga: Déan iniúchadh ar a gcuid APIs agus tuigfidh tú gur cur i bhfeidhm ar leibhéal íseal iad na feidhmeanna go léir a chuirtear ar fáil ar gach rud a ligeann Godot duit a dhéanamh.
ru: Изучите их API, и вы поймете, что все предоставляемые функции являются низкоуровневыми реализациями всего того, что Godot позволяет вам делать.
ta: அவற்றின் பநிஇ களை ஆராயுங்கள், வழங்கப்பட்ட அனைத்து செயல்பாடுகளும் கோடோட் உங்களைச் செய்ய அனுமதிக்கும் எல்லாவற்றின் குறைந்த அளவிலான செயலாக்கங்கள் என்பதை நீங்கள் உணருவீர்கள்.
zh_hant: 你可以研究這些伺服器的 API，會發現它們所提供的功能，其實就是 Godot 所有高階操作的底層實作。

source: RIDs
ga: RIDanna
ru: RІDs
ta: ரிட்ச்
zh_hant: RID

source: The key to using servers is understanding Resource ID (:ref:`RID <class_RID>`) objects. These are opaque handles to the server implementation. They are allocated and freed manually. Almost every function in the servers requires RIDs to access the actual resource.
ga: Is í an eochair chun freastalaithe a úsáid ná réada Aitheantas Acmhainne (: ref:`RID <class_RID>`) a thuiscint. Láimhseálann teimhneach iad seo do chur i bhfeidhm an fhreastalaí. Déantar iad a leithdháileadh agus a shaoradh de láimh. Éilíonn beagnach gach feidhm sna freastalaithe RIDs chun rochtain a fháil ar an acmhainn iarbhír.
ru: Ключом к использованию серверов является понимание объектов Resource ID (:ref:`RID <class_RID>`). Это непрозрачные ручки реализации сервера. Они выделяются и освобождаются вручную. Почти каждая функция в серверах требует RID для доступа к реальному ресурсу.
ta: சேவையகங்களைப் பயன்படுத்துவதற்கான திறவுகோல் வள ஐடியைப் புரிந்துகொள்வது (: ref: `red <class_rid>`) பொருள்களைப் புரிந்துகொள்வது. இவை சேவையக செயலாக்கத்திற்கு ஒளிபுகா கையாளுதல்கள். அவை ஒதுக்கப்பட்டு கைமுறையாக விடுவிக்கப்படுகின்றன. சேவையகங்களில் உள்ள ஒவ்வொரு செயல்பாட்டிற்கும் உண்மையான வளத்தை அணுக ரிட்ச் தேவைப்படுகிறது.
zh_hant: 要使用伺服器，最重要的是理解『Resource ID』（:ref:`RID <class_RID>`）物件。這些 RID 就是對伺服器內部資源的控制碼，需要手動分配與釋放。幾乎所有伺服器函式都需要透過 RID 來存取實際資源。

source: Most Godot nodes and resources contain these RIDs from the servers internally, and they can be obtained with different functions. In fact, anything that inherits :ref:`Resource <class_Resource>` can be directly casted to an RID. Not all resources contain an RID, though: in such cases, the RID will be empty. The resource can then be passed to server APIs as an RID.
ga: Cuimsíonn an chuid is mó de nóid agus acmhainní Godot na RIDs seo ó na freastalaithe go hinmheánach, agus is féidir iad a fháil le feidhmeanna éagsúla. Déanta na fírinne, is féidir aon rud a fhaigheann :ref:`Acmhainn <class_Resource>` a chur go díreach chuig RID. Níl RID i ngach acmhainn, ach: i gcásanna den sórt sin, beidh an RID folamh. Is féidir an acmhainn a chur ar aghaidh ansin chuig APIanna an fhreastalaí mar RID.
ru: Большинство узлов и ресурсов Godot содержат эти RID внутри серверов, и их можно получить с помощью различных функций. Фактически, всё, что наследует :ref:`Resource <class_Resource>`, можно напрямую привести к RID. Однако не все ресурсы содержат RID: в таких случаях RID будет пустым. После этого ресурс можно передать серверным API-ам как RID.
ta: பெரும்பாலான கோடோட் முனைகள் மற்றும் வளங்கள் சேவையகங்களிலிருந்து உள்நாட்டில் இந்த ரிட்சைக் கொண்டுள்ளன, மேலும் அவை வெவ்வேறு செயல்பாடுகளுடன் பெறப்படலாம். உண்மையில், மரபுரிமை பெறும் எதையும்: ref: `வள <class_Resource>` நேரடியாக ஒரு RID க்கு அனுப்பப்படலாம். எல்லா வளங்களுக்கும் ஒரு RID இல்லை, இருப்பினும்: இதுபோன்ற சந்தர்ப்பங்களில், ரிட் காலியாக இருக்கும். வளத்தை சேவையக பநிஇ களுக்கு ஒரு RID ஆக அனுப்பலாம்.
zh_hant: 大多數 Godot 節點與資源內部都持有來自伺服器的 RID，可以透過不同函式取得。其實所有繼承自 :ref:`Resource <class_Resource>` 的物件，都可以直接轉換為 RID。但並非所有資源都有 RID，這時 RID 會是空的。不過你仍然可以將這些資源作為 RID 傳給伺服器 API。

source: Resources are reference-counted (see :ref:`RefCounted <class_RefCounted>`), and references to a resource's RID are *not* counted when determining whether the resource is still in use. Make sure to keep a reference to the resource outside the server, or else both it and its RID will be erased.
ga: Déantar acmhainní a chomhaireamh mar thagairtí (féach :ref:`RefCounted <class_RefCounted>`), agus ní dhéantar tagairtí do RID acmhainne ** a chomhaireamh nuair a bhíonn cinneadh á dhéanamh an bhfuil an acmhainn fós in úsáid. Déan cinnte tagairt a choinneáil don acmhainn lasmuigh den fhreastalaí, nó scriosfar é féin agus a RID.
ru: Ресурсы подсчитываются по ссылкам (см. :ref:`RefCounted <class_RefCounted>`), и ссылки на RID ресурса *не* учитываются при определении того, используется ли ресурс ещё. Обязательно сохраните ссылку на ресурс вне сервера, иначе и он, и его RID будут удалены.
ta: வளங்கள் குறிப்பு-செலுத்தப்பட்டவை (காண்க: குறிப்பு: `Refcounted <class_refcounted>`), மற்றும் வளத்தின் RID பற்றிய குறிப்புகள் வளம் இன்னும் பயன்பாட்டில் உள்ளதா என்பதை தீர்மானிக்கும்போது * கணக்கிடப்படவில்லை. சேவையகத்திற்கு வெளியே வளத்தைப் பற்றிய குறிப்பை வைத்திருப்பதை உறுதிசெய்து கொள்ளுங்கள், இல்லையெனில் அது மற்றும் அதன் RID இரண்டும் அழிக்கப்படும்.
zh_hant: 資源是引用計數的（參見 :ref:`RefCounted <class_RefCounted>`），但指向資源 RID 的引用*不會*被計入引用數。請務必在伺服器之外保留對資源本身的參考，否則資源與其 RID 都會被釋放。

source: For nodes, there are many functions available:
ga: Maidir le nóid, tá go leor feidhmeanna ar fáil:
ru: Для узлов доступны множество функций:
ta: முனைகளுக்கு, பல செயல்பாடுகள் உள்ளன:
zh_hant: 對於節點，有許多函式可以取得相關 RID：

source: For CanvasItem, the :ref:`CanvasItem.get_canvas_item() <class_CanvasItem_method_get_canvas_item>` method will return the canvas item RID in the server.
ga: Le haghaidh CanvasItem, cuirfidh an modh :ref:`CanvasItem.get_canvas_item() <class_CanvasItem_method_get_canvas_item>` an mhír chanbhás RID ar ais sa fhreastalaí.
ru: Для CanvasItem, метод :ref:`CanvasItem.get_canvas_item() <class_CanvasItem_method_get_canvas_item>` вернет RID элемента холста на сервере.
ta: கேன்வாசிடெமுக்கு, தி: ரெஃப்: `கேன்வாசிடெம்.செட்_கான்வாச்_இடெம் () <class_canvasitem_method_get_ganvas_item>` முறை சேவையகத்தில் அகற்றப்படும் கேன்வாச் உருப்படியை திருப்பித் தரும்.
zh_hant: 對於 CanvasItem，可以使用 :ref:`CanvasItem.get_canvas_item() <class_CanvasItem_method_get_canvas_item>` 方法，取得伺服器中該畫布項目的 RID。

source: For CanvasLayer, the :ref:`CanvasLayer.get_canvas() <class_CanvasLayer_method_get_canvas>` method will return the canvas RID in the server.
ga: Le haghaidh CanvasLayer, cuirfidh an modh :ref:`CanvasLayer.get_canvas() <class_CanvasLayer_method_get_canvas>` RID an chanbhás ar ais sa fhreastalaí.
ru: Для CanvasLayer, метод :ref:`CanvasLayer.get_canvas() <class_CanvasLayer_method_get_canvas>` вернет RID холста на сервере.
ta: கேன்வாச்லேயருக்கு, தி: ரெஃப்: `கேன்வாச்லேயர்.செட்_கான்வாச் () <class_canvaslayer_method_get_canvas>` முறை சேவையகத்தில் அகற்றப்படும்.
zh_hant: 對於 CanvasLayer，可使用 :ref:`CanvasLayer.get_canvas() <class_CanvasLayer_method_get_canvas>` 方法取得伺服器中的 Canvas RID。

source: For Viewport, the :ref:`Viewport.get_viewport_rid() <class_Viewport_method_get_viewport_rid>` method will return the viewport RID in the server.
ga: Le haghaidh Viewport, cuirfidh an modh :ref:`Viewport.get_viewport_rid() <class_Viewport_method_get_viewport_rid>` an RID amharcchláir ar ais sa fhreastalaí.
ru: Для Viewport, метод :ref:`Viewport.get_viewport_rid() <class_Viewport_method_get_viewport_rid>` вернет RID области просмотра на сервере.
ta: ViewPort க்கு, தி: ref: `viewport.get_viewport_rid () <class_viewport_method_get_viewport_rid>` முறை சேவையகத்தில் உள்ள காட்சியகத்தை வழங்கும்.
zh_hant: 對於 Viewport，可用 :ref:`Viewport.get_viewport_rid() <class_Viewport_method_get_viewport_rid>` 取得伺服器中的視口 RID。

source: For 3D, the :ref:`World3D <class_World3D>` resource (obtainable in the :ref:`Viewport <class_Viewport>` and :ref:`Node3D <class_Node3D>` nodes) contains functions to get the *RenderingServer Scenario*, and the *PhysicsServer Space*. This allows creating 3D objects directly with the server API and using them.
ga: Le haghaidh 3D, tá feidhmeanna san acmhainn :ref:`World3D <class_World3D>` (ar fáil sa :ref:`Viewport <class_Viewport>` agus :ref:`Node3D <class_Node3D>`) chun an *Cás Freastalaí Rindreála* a fháil, agus an *Spás Freastalaí Fisice*. Ligeann sé seo rudaí 3D a chruthú go díreach leis an API freastalaí agus iad a úsáid.
ru: Для 3D-моделей ресурс :ref:`World3D <class_World3D>` (доступный в узлах :ref:`Viewport <class_Viewport>` и :ref:`Node3D <class_Node3D>`) содержит функции для получения *RenderingServer Scenario* и *PhysicsServer Space*. Это позволяет создавать 3D-объекты непосредственно с помощью API сервера и использовать их.
ta: 3D க்கு, தி: ref: `world3d <class_world3d>` வளம் (இதில் பெறக்கூடியது: rew: `viewport <class_viewport>` மற்றும்: ref: `node3d <class_node3d>` முனைகள்) *ரெண்டர்சர்வர் காட்சி *, மற்றும் மற்றும் பெறுவதற்கான செயல்பாடுகளைக் கொண்டுள்ளது *இயற்பியலாளர் இடம் *. இது சேவையக பநிஇ உடன் நேரடியாக 3D பொருள்களை உருவாக்கி அவற்றைப் பயன்படுத்த அனுமதிக்கிறது.
zh_hant: 在 3D 中，:ref:`World3D <class_World3D>` 資源（可在 :ref:`Viewport <class_Viewport>` 及 :ref:`Node3D <class_Node3D>` 節點取得）提供函式以取得 *RenderingServer Scenario* 及 *PhysicsServer Space*。這讓你可以直接用伺服器 API 建立 3D 物件並操作。

source: For 2D, the :ref:`World2D <class_World2D>` resource (obtainable in the :ref:`Viewport <class_Viewport>` and :ref:`CanvasItem <class_CanvasItem>` nodes) contains functions to get the *RenderingServer Canvas*, and the *Physics2DServer Space*. This allows creating 2D objects directly with the server API and using them.
ga: Le haghaidh 2D, tá feidhmeanna san acmhainn :ref:`World2D <class_World2D>` (ar fáil sa :ref:`Viewport <class_Viewport>` agus :ref:`CanvasItem <class_CanvasItem>`) chun an *Nóid Freastalaí Rindreála* a fháil, agus an *Spás Freastalaí Fisic2DS*. Ligeann sé seo rudaí 2D a chruthú go díreach leis an API freastalaí agus iad a úsáid.
ru: Для 2D-моделей ресурс :ref:`World2D <class_World2D>` (доступный в узлах :ref:`Viewport <class_Viewport>` и :ref:`CanvasItem <class_CanvasItem>`) содержит функции для получения *RenderingServer Canvas* и *Physics2DServer Space*. Это позволяет создавать 2D-объекты непосредственно с помощью API сервера и использовать их.
ta: 2d க்கு, தி: ref: `world2d <class_world2d>` வளம் (இதில் பெறக்கூடியது: rew: `viewport <class_viewport>` மற்றும்: ref: `canvasitem <class_canvasitem>` nodes) *ரெண்டரிங்ச்பரர் கேன்வாசைப் பெறுவதற்கான செயல்பாடுகளைக் கொண்டுள்ளது *மற்றும் *இயற்பியல் 2server இடம் *. இது சேவையக பநிஇ உடன் நேரடியாக 2D பொருள்களை உருவாக்கி அவற்றைப் பயன்படுத்த அனுமதிக்கிறது.
zh_hant: 在 2D 中，:ref:`World2D <class_World2D>` 資源（可於 :ref:`Viewport <class_Viewport>` 及 :ref:`CanvasItem <class_CanvasItem>` 節點取得）提供函式以取得 *RenderingServer Canvas* 及 *Physics2DServer Space*。這讓你可以直接用伺服器 API 建立 2D 物件並操作。

source: The :ref:`VisualInstance3D<class_VisualInstance3D>` class, allows getting the scenario *instance* and *instance base* via the :ref:`VisualInstance3D.get_instance() <class_VisualInstance3D_method_get_instance>` and :ref:`VisualInstance3D.get_base() <class_VisualInstance3D_method_get_base>` respectively.
ga: Ceadaíonn an rang :ref:`VisualInstance3D<class_VisualInstance3D>` an cás a fháil *cás* agus *bonn cás* tríd an :ref:`VisualInstance3D.get_instance() <class_VisualInstance3D_method_get_instance>`(Vis.d_instance) agus :refstance: class_VisualInstance3D_method_get_base>` faoi seach.
ru: Класс :ref:`VisualInstance3D<class_VisualInstance3D>` позволяет получить *экземпляр* и *базу экземпляра* сценария через :ref:`VisualInstance3D.get_instance() <class_VisualInstance3D_method_get_instance>` и :ref:`VisualInstance3D.get_base() <class_VisualInstance3D_method_get_base>` соответственно.
ta: தி: ref: `visualInstance3d <class_visualinstance3d>` வகுப்பு, காட்சியைப் பெற அனுமதிக்கிறது * நிகழ்வு * மற்றும் * நிகழ்வு அடிப்படை * வழியாக: resp: `visualinstance3d.get_instance () <class_visualinstance3d_method_get_inestance>` மற்றும் `` `` `` `` `` `` `` visualInstancenstasentance3d_method_get_inestance class_visualinstance3d_method_get_base> `முறையே.
zh_hant: :ref:`VisualInstance3D<class_VisualInstance3D>` 類別，可分別透過 :ref:`VisualInstance3D.get_instance() <class_VisualInstance3D_method_get_instance>` 與 :ref:`VisualInstance3D.get_base() <class_VisualInstance3D_method_get_base>` 取得場景 *instance* 與 *instance base*。

source: Try exploring the nodes and resources you are familiar with and find the functions to obtain the server *RIDs*.
ga: Déan iarracht iniúchadh a dhéanamh ar na nóid agus na hacmhainní a bhfuil eolas agat orthu agus faigh na feidhmeanna chun an freastalaí* RIDS* a fháil.
ru: Попробуйте изучить знакомые вам узлы и ресурсы и найдите функции для получения *RID-ов* сервера.
ta: உங்களுக்கு தெரிந்த முனைகள் மற்றும் வளங்களை ஆராய முயற்சிக்கவும், சேவையகத்தை *ரிட்ச் *பெறுவதற்கான செயல்பாடுகளைக் கண்டறியவும்.
zh_hant: 建議你多嘗試探索熟悉的節點與資源，看看能從哪些函式取得對應的伺服器 *RID*。
