Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/using_multimesh.po
Languages: ga, ru, ta

source: Optimization using MultiMeshes
ga: Optamú ag baint úsáide as MultiMeshes
ru: Оптимизация с использованием мультисеток
ta: மல்டிமேச்களைப் பயன்படுத்தி உகப்பாக்கம்

source: For large amount of instances (in the thousands), that need to be constantly processed (and certain amount of control needs to be retained), :ref:`using servers directly <doc_using_servers>` is the recommended optimization.
ga: I gcás líon mór cásanna (sna mílte), ar gá iad a phróiseáil go leanúnach (agus ní mór méid áirithe rialaithe a choinneáil), :ref:`using servers directly <doc_using_servers>` is é an leas iomlán a bhaint a mholtar.
ru: Для большого количества экземпляров (тысяч), которые необходимо постоянно обрабатывать (и сохранять определенный уровень контроля), рекомендуемой оптимизацией является :ref:`using servers directly <doc_using_servers>`.
ta: பெரிய அளவிலான நிகழ்வுகளுக்கு (ஆயிரக்கணக்கான), தொடர்ந்து செயலாக்கப்பட வேண்டும் (மற்றும் குறிப்பிட்ட அளவு கட்டுப்பாட்டை தக்க வைத்துக் கொள்ள வேண்டும்),: ref: `நேரடியாக சேவையகங்களைப் பயன்படுத்துதல் <doc_using_servers>` என்பது பரிந்துரைக்கப்பட்ட தேர்வுமுறை.

source: When the amount of objects reach the hundreds of thousands or millions, none of these approaches are efficient anymore. Still, depending on the requirements, there is one more optimization possible.
ga: Nuair a shroicheann méid na rudaí na céadta mílte nó na milliúin, níl aon cheann de na cur chuige seo éifeachtach níos mó. Fós féin, ag brath ar na riachtanais, tá barrfheabhsú amháin eile indéanta.
ru: Когда количество объектов достигает сотен тысяч или миллионов, ни один из этих подходов уже неэффективен. Тем не менее, в зависимости от требований, возможен ещё один вариант оптимизации.
ta: பொருட்களின் அளவு நூறாயிரக்கணக்கான அல்லது மில்லியன்களை எட்டும்போது, இந்த அணுகுமுறைகள் எதுவும் இனி திறமையாக இல்லை. இருப்பினும், தேவைகளைப் பொறுத்து, இன்னும் ஒரு தேர்வுமுறை சாத்தியமாகும்.

source: MultiMeshes
ru: MultiMeshes (МультиСетки)
ta: மல்டிமேச்கள்

source: A :ref:`MultiMesh<class_MultiMesh>` is a single draw primitive that can draw up to millions of objects in one go. It's extremely efficient because it uses the GPU hardware to do this.
ru: :ref:`MultiMesh<class_MultiMesh>` — это единый примитив рисования, способный отрисовывать до миллионов объектов за один раз. Он чрезвычайно эффективен, поскольку использует для этого аппаратное обеспечение графического процессора.
ta: ப: குறிப்பு: `மல்டிமேச் <class_multimesh>` என்பது ஒற்றை டிரா பழமையானது, இது ஒரே நேரத்தில் மில்லியன் கணக்கான பொருள்களை வரைய முடியும். இது மிகவும் திறமையானது, ஏனெனில் இதைச் செய்ய சி.பீ.யூ வன்பொருளைப் பயன்படுத்துகிறது.

source: The only drawback is that there is no *screen* or *frustum* culling possible for individual instances. This means, that millions of objects will be *always* or *never* drawn, depending on the visibility of the whole MultiMesh. It is possible to provide a custom visibility rect for them, but it will always be *all-or-none* visibility.
ga: Is é an t-aon mhíbhuntáiste ná nach féidir *scáilean* nó *frustum* a dhíothú do chásanna aonair. Ciallaíonn sé seo, go dtarraingfear na milliúin rudaí* i gcónaí* nó* riamh, ag brath ar infheictheacht an MultiMesh iomlán. Is féidir réiteach infheictheachta saincheaptha a sholáthar dóibh, ach beidh infheictheacht uile-or-neamh* ann i gcónaí.
ru: Единственный недостаток заключается в отсутствии возможности отбраковки *экрана* или *усеченной* области для отдельных экземпляров. Это означает, что миллионы объектов будут *всегда* или *никогда* отрисовываться, в зависимости от видимости всей мультисетки. Можно задать для них собственный прямоугольник видимости, но видимость всегда будет по принципу *все или ничего*.
ta: ஒரே குறைபாடு என்னவென்றால், தனிப்பட்ட நிகழ்வுகளுக்கு * திரை * அல்லது * ஃப்ரச்டம் * சாத்தியமில்லை. இதன் பொருள், முழு மல்டிமேசின் தெரிவுநிலையைப் பொறுத்து மில்லியன் கணக்கான பொருள்கள் * எப்போதும் * அல்லது * ஒருபோதும் * வரையப்பட்டதாக இருக்கும். அவர்களுக்கு தனிப்பயன் தெரிவுநிலை செவ்வகத்தை வழங்க முடியும், ஆனால் அது எப்போதும் * அனைத்து அல்லது எதுவுமில்லை * தெரிவுநிலை.

source: If the objects are simple enough (just a couple of vertices), this is generally not much of a problem as most modern GPUs are optimized for this use case. A workaround is to create several MultiMeshes for different areas of the world.
ga: Má tá na rudaí simplí go leor (ach cúpla beart), de ghnáth ní fadhb í seo mar tá an chuid is mó de na GPUanna nua-aimseartha optamaithe don chás úsáide seo. Is é an réiteach ná roinnt MultiMeshes a chruthú do réimsí éagsúla ar domhan.
ru: Если объекты достаточно простые (всего пара вершин), это, как правило, не представляет особой проблемы, поскольку большинство современных видеокарт оптимизированы для такого использования. Обходной путь — создание нескольких мультисеток для разных областей мира.
ta: பொருள்கள் போதுமான எளிமையானவை என்றால் (ஓரிரு செங்குத்துகள்), இது பொதுவாக ஒரு சிக்கல் அல்ல, ஏனெனில் பெரும்பாலான நவீன சி.பீ.யுகள் இந்த பயன்பாட்டு வழக்குக்கு உகந்ததாக உள்ளன. உலகின் பல்வேறு பகுதிகளுக்கு பல மல்டிமெச்களை உருவாக்குவதே ஒரு பணித்தொகுப்பு.

source: It is also possible to execute some logic inside the vertex shader (using the ``INSTANCE_ID`` or ``INSTANCE_CUSTOM`` built-in constants). For an example of animating thousands of objects in a MultiMesh, see the :ref:`Animating thousands of fish <doc_animating_thousands_of_fish>` tutorial. Information to the shader can be provided via textures (there are floating-point :ref:`Image<class_Image>` formats which are ideal for this).
ga: Is féidir freisin roinnt loighic a rith laistigh den scáthóir rinn (ag baint úsáide as na tairisigh ionsuite `` INSTANCE_ID`` nó `` INSTANCE_CUSTOM``). Le haghaidh sampla de na mílte réad a bheochan in Ilmhogra, féach an :ref:`Beochan na mílte iasc <doc_animating_thousands_of_fish>` teagaisc. Is féidir faisnéis a sholáthar don scáthlánóir trí uigeachtaí (tá formáidí snámhphointe :ref:`Image <class_Image>` oiriúnach dó seo).
ru: Также возможно выполнение некоторой логики внутри вершинного шейдера (используя встроенные константы ``INSTANCE_ID`` или ``INSTANCE_CUSTOM``). Пример анимации тысяч объектов в MultiMesh см. в руководстве :ref:`Animating thousands of fish <doc_animating_thousands_of_fish>`. Информация для шейдера может быть предоставлена через текстуры (существуют форматы с плавающей точкой :ref:`Image<class_Image>`, которые идеально подходят для этого).
ta: வெர்டெக்ச் சேடருக்குள் சில தர்க்கங்களை இயக்கவும் முடியும் (`` Instance_id`` அல்லது `` Instance_custom`` உள்ளமைக்கப்பட்ட மாறிலிகளைப் பயன்படுத்தி). மல்டிமேசில் ஆயிரக்கணக்கான பொருள்களை அனிமேசன் செய்வதற்கான எடுத்துக்காட்டுக்கு, இதைக் காண்க: குறிப்பு: `ஆயிரக்கணக்கான மீன்களை அனிமேசன் செய்தல் நிழலுக்கான தகவல்களை இழைமங்கள் வழியாக வழங்க முடியும் (மிதக்கும்-புள்ளி உள்ளது: குறிப்பு: `படம் <class_image>` இதற்கு ஏற்ற வடிவங்கள்).

source: Another alternative is to use a GDExtension and C++, which should be extremely efficient (it's possible to set the entire state for all objects using linear memory via the :ref:`RenderingServer.multimesh_set_buffer() <class_RenderingServer_method_multimesh_set_buffer>` function). This way, the array can be created with multiple threads, then set in one call, providing high cache efficiency.
ga: Rogha eile is ea GDEExtension agus C++ a úsáid, ar cheart go mbeadh siad thar a bheith éifeachtach (is féidir staid iomlán na n-oibiachtaí uile a shocrú ag baint úsáide as cuimhne líneach tríd an bhfeidhm :ref:`RenderingServer.multimesh_set_buffer() <class_RenderingServer_method_multimesh_set_buffer>`). Ar an mbealach seo, is féidir an t-eagar a chruthú le snáitheanna iolracha, ansin a shocrú in aon ghlao amháin, ag soláthar éifeachtacht taisce ard.
ru: Другой вариант — использовать GDExtension и C++, что должно быть чрезвычайно эффективно (можно установить полное состояние всех объектов, используя линейную память, с помощью функции :ref:`RenderingServer.multimesh_set_buffer() <class_RenderingServer_method_multimesh_set_buffer>`). Таким образом, массив можно создать в несколько потоков, а затем установить за один вызов, что обеспечивает высокую эффективность кэширования.
ta: மற்றொரு மாற்று ஒரு gdextension மற்றும் c ++ ஐப் பயன்படுத்துவது, இது மிகவும் திறமையாக இருக்க வேண்டும் (நேரியல் நினைவகத்தைப் பயன்படுத்தும் அனைத்து பொருள்களுக்கும் முழு நிலையையும் அமைக்க முடியும்: render: `renderingserver.multimesh_set_buffer () <class_renderingserver_method_multimesh_set_buffer>` செயல்பாடு). இந்த வழியில், வரிசையை பல நூல்களுடன் உருவாக்கலாம், பின்னர் ஒரு அழைப்பில் அமைக்கப்பட்டு, அதிக கேச் செயல்திறனை வழங்கும்.

source: Finally, it's not required to have all MultiMesh instances visible. The amount of visible ones can be controlled with the :ref:`MultiMesh.visible_instance_count <class_MultiMesh_property_visible_instance_count>` property. The typical workflow is to allocate the maximum amount of instances that will be used, then change the amount visible depending on how many are currently needed.
ga: Ar deireadh, ní gá go mbeadh gach cás MultiMesh le feiceáil. Is féidir méid na cinn infheicthe a rialú leis an airí :ref:`MultiMesh.visible_instance_count <class_MultiMesh_property_visible_instance_count>`. Is é an sreabhadh oibre tipiciúil ná an t-uasmhéid cásanna a úsáidfear a leithdháileadh, ansin an méid atá le feiceáil a athrú ag brath ar cé mhéad atá ag teastáil faoi láthair.
ru: Наконец, не обязательно, чтобы все экземпляры MultiMesh были видимыми. Количество видимых экземпляров можно контролировать с помощью свойства :ref:`MultiMesh.visible_instance_count <class_MultiMesh_property_visible_instance_count>`. Типичный рабочий процесс заключается в выделении максимального количества экземпляров, которые будут использоваться, а затем изменении количества видимых экземпляров в зависимости от текущей потребности.
ta: இறுதியாக, அனைத்து மல்டிமேச் நிகழ்வுகளும் காண வேண்டிய அவசியமில்லை. புலப்படும் அளவைக் கட்டுப்படுத்தலாம்: ref: `mullashes.visible_instance_count <class_multimesh_property_visible_instance_count>` சொத்து. வழக்கமான பணிப்பாய்வு என்பது பயன்படுத்தப்படும் அதிகபட்ச நிகழ்வுகளை ஒதுக்க வேண்டும், பின்னர் எத்தனை தேவை என்பதைப் பொறுத்து புலப்படும் தொகையை மாற்றவும்.

source: Multimesh example
ga: Sampla Multimesh
ru: Пример Multimesh
ta: மல்டிமேச் எடுத்துக்காட்டு

source: Here is an example of using a MultiMesh from code. Languages other than GDScript may be more efficient for millions of objects, but for a few thousands, GDScript should be fine.
ga: Seo sampla de MultiMesh a úsáid ó chód. D'fhéadfadh go mbeadh teangacha seachas GDScript níos éifeachtaí do na milliúin réad, ach do chúpla míle, ba chóir go mbeadh GDScript go breá.
ru: Вот пример использования MultiMesh из кода. Другие языки, помимо GDScript, могут быть эффективнее для миллионов объектов, но для нескольких тысяч GDScript вполне подойдёт.
ta: குறியீட்டிலிருந்து ஒரு மல்டிமேசைப் பயன்படுத்துவதற்கான எடுத்துக்காட்டு இங்கே. GDSCRIPT ஐத் தவிர வேறு மொழிகள் மில்லியன் கணக்கான பொருள்களுக்கு மிகவும் திறமையாக இருக்கலாம், ஆனால் சில ஆயிரக்கணக்கானவர்களுக்கு, GDSCRIPT நன்றாக இருக்க வேண்டும்.
