Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_for_macos.po
Languages: tr

source: Compiling for macOS
tr: macOS için derleme

source: This page describes how to compile macOS editor and export template binaries from source. If you're looking to export your project to macOS instead, read :ref:`doc_exporting_for_macos`.
tr: Bu sayfada macOS düzenleyicisinin ve dışa aktarım şablon ikili dosyalarının kaynaktan nasıl derleneceğini açıklanmaktadır. Bunun yerine projenizi macOS'a aktarmak istiyorsanız :ref:`doc_exporting_for_macos` sayfasını okuyun.

source: Requirements
tr: Gereklilikler

source: For compiling under macOS, the following is required:
tr: macOS altında derleme yapmak için aşağıdakiler gereklidir:

source: `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`_ (or the more lightweight Command Line Tools for Xcode).
tr: `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`_ (veya daha hafif Xcode için Command Line Tools).

source: If you have `Homebrew <https://brew.sh/>`_ installed, you can easily install SCons using the following command::
tr: Eğer `Homebrew <https://brew.sh/>`_ yüklüyse, aşağıdaki komutu kullanarak SCons'u kolayca yükleyebilirsiniz::

source: Installing Homebrew will also fetch the Command Line Tools for Xcode automatically if you don't have them already.
tr: Homebrew'u yüklediğinizde, henüz sahip değilseniz Xcode için Command Line Tools da otomatik olarak getirilecektir.

source: Similarly, if you have `MacPorts <https://www.macports.org/>`_ installed, you can easily install SCons using the following command::
tr: Benzer şekilde, `MacPorts <https://www.macports.org/>`_ yüklüyse, aşağıdaki komutu kullanarak SCons'u kolayca yükleyebilirsiniz::

source: To get the Godot source code for compiling, see :ref:`doc_getting_source`.
tr: Derlemek üzere Godot kaynak kodunu almak için :ref:`doc_getting_source` sayfasına bakın.

source: For a general overview of SCons usage for Godot, see :ref:`doc_introduction_to_the_buildsystem`.
tr: Godot için SCons kullanımına genel bir bakış için bkz :ref:`doc_introduction_to_the_buildsystem`.

source: Compiling
tr: Derleme

source: Start a terminal, go to the root directory of the engine source code.
tr: Bir terminal başlatın, motor kaynak kodunun kök dizinine gidin.

source: To compile for Intel (x86-64) powered Macs, use::
tr: Intel (x86-64) destekli Mac'ler için derlemek için şunu kullanın::

source: To compile for Apple Silicon (ARM64) powered Macs, use::
tr: Apple Silicon (ARM64) destekli Mac'ler için derlemek için şunu kullanın::

source: If all goes well, the resulting binary executable will be placed in the ``bin/`` subdirectory. This executable file contains the whole engine and runs without any dependencies. Executing it will bring up the Project Manager.
tr: Her şey yolunda giderse, ortaya çıkan ikili yürütülebilir dosya ``bin/`` alt dizinine yerleştirilecektir. Bu çalıştırılabilir dosya tüm motoru içerir ve herhangi bir bağımlılık olmadan çalışır. Çalıştırıldığında Proje Yöneticisi ekrana gelecektir.

source: If you want to use separate editor settings for your own Godot builds and official releases, you can enable :ref:`doc_data_paths_self_contained_mode` by creating a file called ``._sc_`` or ``_sc_`` in the ``bin/`` folder.
tr: Kendi Godot derlemeleriniz ve resmi sürümleriniz için ayrı düzenleyici ayarları kullanmak istiyorsanız, ``bin/`` klasöründe ``._sc_`` veya ``_sc_`` adlı bir dosya oluşturarak :ref:`doc_data_paths_self_contained_mode`u etkinleştirebilirsiniz.

source: To support both architectures in a single "Universal 2" binary, run the above two commands and then use ``lipo`` to bundle them together::
tr: Her iki mimariyi tek bir "Universal 2" ikili dosyasında desteklemek için önce yukarıdaki iki komutu çalıştırın ve ardından bunları bir araya getirmek için ``lipo`` kullanın::

source: If you are building the ``master`` branch, you also need to include support for the MoltenVK Vulkan portability library. By default, it will be linked statically from your installation of the Vulkan SDK for macOS. You can also choose to link it dynamically by passing ``use_volk=yes`` and including the dynamic library in your ``.app`` bundle::
tr: Eğer ``master`` dalını derliyorsanız, MoltenVK Vulkan taşınabilirlik kütüphanesi için de destek eklemeniz gerekir. Varsayılan olarak, macOS için Vulkan SDK kurulumunuzdan statik olarak bağlanacaktır. Ayrıca ``use_volk=yes`` argümanını geçerek ve dinamik kütüphaneyi ``.app`` paketinize dahil ederek dinamik olarak bağlamayı da seçebilirsiniz::

source: Running a headless/server build
tr: Başsız/sunucu derlemesi çalıştırma

source: To run in *headless* mode which provides editor functionality to export projects in an automated manner, use the normal build::
tr: Projeleri otomatik bir şekilde dışa aktarmak için düzenleyici işlevselliği sağlayan *başsız* modda çalıştırmak için normal derleme kullanın::

source: And then use the ``--headless`` command line argument::
tr: Ve sonra ``--headless`` komut satırı argümanını kullanın::

source: To compile a debug *server* build which can be used with :ref:`remote debugging tools <doc_command_line_tutorial>`, use::
tr: :ref:`uzaktan hata ayıklama araçları <doc_command_line_tutorial>` ile kullanılabilecek bir hata ayıklama *sunucusu* derlemesi yapmak için şunu kullanın::

source: To compile a release *server* build which is optimized to run dedicated game servers, use::
tr: Adanmış oyun sunucularını çalıştırmak üzere optimize edilmiş bir sürüm *sunucu* derlemek için şunu kullanın::

source: Building export templates
tr: Dışa aktarma şablonları oluşturma

source: To build macOS export templates, you have to compile using the targets without the editor: ``target=template_release`` (release template) and ``target=template_debug``.
tr: macOS dışa aktarma şablonlarını derlemek için, düzenleyici içermeyen hedefleri kullanarak derleme yapmanız gerekir: ``target=template_release`` (sürüm şablonu) ve ``target=template_debug``.

source: You can then zip the ``macos_template.app`` folder to reproduce the ``macos.zip`` template from the official Godot distribution::
tr: Daha sonra resmi Godot dağıtımındaki ``macos.zip`` şablonunu yeniden üretmek için ``macos_template.app`` klasörünü sıkıştırabilirsiniz::

source: Cross-compiling for macOS from Linux
tr: Linux'tan macOS için çapraz derleme

source: It is possible to compile for macOS in a Linux environment (and maybe also in Windows using the Windows Subsystem for Linux). For that, you'll need to install `OSXCross <https://github.com/tpoechtrager/osxcross>`__ to be able to use macOS as a target. First, follow the instructions to install it:
tr: Linux ortamında macOS için derleme yapmak mümkündür (ve belki Linux için Windows Alt Sistemini (WSL) kullanarak Windows'ta da). Bunun için, macOS'u hedef olarak kullanabilmek için `OSXCross <https://github.com/tpoechtrager/osxcross>`__ yüklemeniz gerekir. İlk olarak, yüklemek için talimatları izleyin:

source: Clone the `OSXCross repository <https://github.com/tpoechtrager/osxcross>`__ somewhere on your machine (or download a ZIP file and extract it somewhere), e.g.::
tr: `OSXCross deposunu <https://github.com/tpoechtrager/osxcross>`__ makinenizde bir yere klonlayın (veya bir ZIP dosyası indirin ve bir yere çıkarın), örneğin::

source: Follow the instructions to package the SDK: https://github.com/tpoechtrager/osxcross#packaging-the-sdk
tr: SDK'yı paketlemek için talimatları izleyin: https://github.com/tpoechtrager/osxcross#packaging-the-sdk

source: Follow the instructions to install OSXCross: https://github.com/tpoechtrager/osxcross#installation
tr: OSXCross'u yüklemek için talimatları izleyin: https://github.com/tpoechtrager/osxcross#installation

source: After that, you will need to define the ``OSXCROSS_ROOT`` as the path to the OSXCross installation (the same place where you cloned the repository/extracted the zip), e.g.::
tr: Bundan sonra, ``OSXCROSS_ROOT``'u OSXCross kurulumunun yolu olarak tanımlamanız gerekecektir (depoyu klonladığınız / zip'i çıkardığınız yerle aynı yer), örneğin:

source: Now you can compile with SCons like you normally would::
tr: Artık normalde yaptığınız gibi SCons ile derleme yapabilirsiniz::

source: If you have an OSXCross SDK version different from the one expected by the SCons buildsystem, you can specify a custom one with the ``osxcross_sdk`` argument::
tr: SCons yapı sistemi tarafından beklenenden farklı bir OSXCross SDK sürümünüz varsa, ``osxcross_sdk`` argümanı ile özel bir sürüm belirtebilirsiniz::

source: Troubleshooting
tr: Sorun giderme
