Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_with_dotnet.po
Languages: es, ta, tr

source: In the case of multi-architecture exports multiple such data directories will be generated.
es: En el caso de exportaciones de múltiples arquitecturas, se generarán múltiples directorios de datos de este tipo.
ta: மல்டி-ஆர்கிடெக்சர் ஏற்றுமதிகள் விசயத்தில் இதுபோன்ற பல தரவு கோப்பகங்கள் உருவாக்கப்படும்.
tr: Çok-mimarili dışa aktarım durumunda, bu tür birden fazla veri dizini oluşturulacaktır.

source: Command-line options
es: Opciones de la línea de comandos
ta: கட்டளை-வரி விருப்பங்கள்
tr: Komut-satırı seçenekleri

source: The following is the list of command-line options available when building with the .NET module:
ta: .NET தொகுதியுடன் உருவாக்கும்போது கிடைக்கும் கட்டளை-வரி விருப்பங்களின் பட்டியல் பின்வருமாறு:
tr: .NET modülü ile oluştururken kullanılabilecek komut satırı seçeneklerinin listesi aşağıdadır:

source: **module_mono_enabled**\ =yes | **no**
ta: ** module_mono_enabled ** \ = ஆம் | ** இல்லை **

source: Build Godot with the .NET module enabled.
ta: .NET தொகுதி இயக்கப்பட்டதன் மூலம் கோடோட்டை உருவாக்குங்கள்.
tr: Godot'yu .NET modülü etkinleştirilmiş olarak oluştur.
