Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_for_linuxbsd.po
Languages: es, tr, uk, zh_tw

source: The code above includes adding ``$RISCV_TOOLCHAIN_PATH/bin`` to the PATH, but only for the following ``scons`` command. Since riscv-gnu-toolchain uses its own Clang located in the ``bin`` folder, adding ``$RISCV_TOOLCHAIN_PATH/bin`` to your user's PATH environment variable may block you from accessing another version of Clang if one is installed. For this reason it's not recommended to make adding the bin folder permanent. You can also omit the ``PATH="$RISCV_TOOLCHAIN_PATH/bin:$PATH"`` line if you want to use scons with self-installed version of Clang, but it may have compatibility issues with riscv-gnu-toolchain.
uk: Наведений вище код містить додавання ``$RISCV_TOOLCHAIN_PATH/bin`` до PATH, але лише для наступної команди ``scons``. Оскільки riscv-gnu-toolchain використовує власний Clang, розташований у папці ``bin``, додавання ``$RISCV_TOOLCHAIN_PATH/bin`` до змінної середовища PATH вашого користувача може заблокувати вам доступ до іншої версії Clang, якщо вона встановлена. З цієї причини не рекомендується робити додавання папки bin постійним. Ви також можете опустити рядок ``PATH="$RISCV_TOOLCHAIN_PATH/bin:$PATH"``, якщо ви хочете використовувати scons із самостійно встановленою версією Clang, але це може мати проблеми сумісності з riscv-gnu-toolchain.
zh_tw: 上方指令會將 ``$RISCV_TOOLCHAIN_PATH/bin`` 加入 PATH，但僅在執行 ``scons`` 時適用。由於 riscv-gnu-toolchain 會用其自己的 Clang（在 bin 目錄內），如果將該 bin 目錄永久加入 PATH，可能會影響你系統上的其他 Clang 版本。因此不建議永久修改 PATH。若要用自行安裝的 Clang，也可以省略 ``PATH="$RISCV_TOOLCHAIN_PATH/bin:$PATH"`` 這行，但這麼做與 riscv-gnu-toolchain 的相容性可能會有問題。

source: The command is similar in nature, but with some key changes. ``ccflags`` and ``linkflags`` append additional flags to the build. ``--sysroot`` points to a folder simulating a Linux system, it contains all the headers, libraries, and ``.so`` files Clang will use. ``--gcc-toolchain`` tells Clang where the complete toolchain is, and ``-target riscv64-unknown-linux-gnu`` indicates to Clang the target architecture, and OS we want to build for.
uk: Команда подібна за своєю природою, але з деякими ключовими змінами. ``ccflags`` і ``linkflags`` додають додаткові позначки до збірки. ``--sysroot`` вказує на папку, що імітує систему Linux, вона містить усі заголовки, бібліотеки та файли ``.so``, які використовуватиме Clang. ``--gcc-toolchain`` повідомляє Clang, де знаходиться повний ланцюжок інструментів, а ``-target riscv64-unknown-linux-gnu`` вказує Clang цільову архітектуру та ОС, для яких ми хочемо створити.
zh_tw: 這個建構指令與一般編譯類似，但有幾個重要差異。``ccflags`` 與 ``linkflags`` 是額外的編譯與連結參數，``--sysroot`` 指向模擬 Linux 系統的資料夾，裡面包含所有標頭檔、函式庫及 ``.so`` 檔案供 Clang 使用。``--gcc-toolchain`` 指定完整工具鏈位置，``-target riscv64-unknown-linux-gnu`` 則告訴 Clang 目標為 RISC-V 架構與 Linux 系統。

source: If all went well, you should now see a ``bin`` directory, and within it, a binary similar to the following:
es: Si todo salió bien, ahora deberías ver un directorio ``bin`` y dentro de él, un binario similar al siguiente:
uk: Якщо все пройшло добре, тепер ви повинні побачити каталог ``bin``, а в ньому двійковий файл, подібний до такого:
zh_tw: 若一切順利，你會在 ``bin`` 目錄下看到類似下列的二進位檔：

source: You can now copy this executable to your favorite RISC-V device, then launch it there by double-clicking, which should bring up the project manager.
es: Ahora puede copiar este ejecutable a su dispositivo RISC-V favorito y luego iniciarlo allí haciendo doble clic, lo que debería abrir el administrador de proyectos.
uk: Тепер ви можете скопіювати цей виконуваний файл на свій улюблений пристрій RISC-V, а потім запустити його там подвійним клацанням миші, що має відкрити менеджер проекту.
zh_tw: 你可以將這個可執行檔複製到你的 RISC-V 裝置，並在裝置上雙擊啟動，應可正常開啟專案管理員。

source: If you later decide to compile the export templates, copy the above build command but change the value of ``target`` to ``template_debug`` for a debug build, or ``template_release`` for a release build.
es: Si más adelante decide compilar las plantillas de exportación, copie el comando de compilación anterior pero cambie el valor de ``target`` a ``template_debug`` para una compilación de depuración, o ``template_release`` para una compilación de lanzamiento.
uk: Якщо пізніше ви вирішите скомпілювати шаблони експорту, скопіюйте наведену вище команду збірки, але змініть значення ``target`` на ``template_debug`` для збірки налагодження або ``template_release`` для збірки випуску.
zh_tw: 日後若需要編譯匯出樣板，只要複製相同的建構指令，將 ``target`` 參數改成 ``template_debug`` （除錯版）或 ``template_release`` （發行版）即可。

source: Using Clang and LLD for faster development
es: Utilizando Clang y LLD para un desarrollo más rápido
tr: Daha hızlı geliştirme için Clang ve LLD kullanımı
uk: Використання Clang та LLD для пришвидшення розробки
zh_tw: 以 Clang 與 LLD 加速開發流程

source: You can also use Clang and LLD to build Godot. This has two upsides compared to the default GCC + GNU ld setup:
es: También puedes usar Clang y LLD para compilar Godot. Esto tiene dos ventajas en comparación con la configuración predeterminada de GCC + GNU ld:
tr: Godot'u oluşturmak için Clang ve LLD de kullanabilirsiniz. Bunun varsayılan GCC + GNU ld kurulumuna kıyasla iki avantajı vardır:
uk: Ви можете збудувати Godot з Clang та LLD. Вони мають пару переваг у порівнянні зі стандартною зв'язкою GCC + GNU ld:
zh_tw: 你也可以用 Clang 搭配 LLD 建構 Godot。和預設的 GCC+GNU ld 相比有兩大優點：

source: LLD links Godot significantly faster compared to GNU ld or gold. This leads to faster iteration times.
es: LLD enlaza Godot significativamente más rápido en comparación con GNU ld o gold. Esto lleva a tiempos de iteración más rápidos.
tr: LLD, Godot'yu GNU ld veya gold'a kıyasla önemli ölçüde daha hızlı bağlar. Bu da daha hızlı yineleme sürelerine yol açar.
uk: LLD збирає Godot значно швидше у порівнянні з to GNU ld чи gold. Таким чином збирання проходить швидшими ітераціями.
zh_tw: LLD 連結速度遠超過 GNU ld 或 gold，可大幅加快迭代流程。

source: Clang tends to give more useful error messages compared to GCC.
es: Clang tiende a proporcionar mensajes de error más útiles en comparación con GCC.
tr: Clang, GCC'ye kıyasla daha faydalı hata mesajları verme eğilimindedir.
uk: Clang дає корисніші повідомлення про помилки ніж GCC.
zh_tw: Clang 通常會提供比 GCC 更有幫助的錯誤訊息。

source: To do so, install Clang and the ``lld`` package from your distribution's package manager then use the following SCons command::
uk: Щоб це зробити, встановіть Clang та пакет ``lld`` з вашого пакетного менеджера та використайте їх в наступній команді:

source: After the build is completed, a new binary with a ``.llvm`` suffix will be created in the ``bin/`` folder.
es: Después de que se complete la compilación, se creará un nuevo archivo binario con el sufijo ``.llvm`` en la carpeta ``bin/``.
tr: Derleme işlemi tamamlandıktan sonra, ``bin/`` klasöründe ``.llvm`` sonekine sahip yeni bir ikili dosya oluşturulacaktır.
uk: Щойно побудова буде завершена, в теці ``bin/`` буде створений новий бінарний файл із суфіксом ``.llvm``.
zh_tw: 建構完成後，會在 ``bin/`` 資料夾產生一個以 ``.llvm`` 為副檔名的新二進位檔案。

source: It's still recommended to use GCC for production builds as they can be compiled using link-time optimization, making the resulting binaries smaller and faster.
es: Todavía se recomienda usar GCC para las compilaciones de producción, ya que se pueden compilar utilizando la optimización en tiempo de enlace, lo que hace que los archivos binarios resultantes sean más pequeños y rápidos.
tr: Bağlama zamanı optimizasyonu kullanılarak derlenebildikleri ve sonuçta ortaya çıkan ikili dosyaları daha küçük ve daha hızlı hale getirdikleri için üretim derlemeleri için hala GCC kullanılması önerilir.
uk: Але ми рекомендуємо використовувати GCC для фінальної збірки, так як він дає змогу її оптимізувати: зробити кінцевий бінарний файл меншим та швидшим.
zh_tw: 正式發行版還是建議用 GCC 建構，因為能支援連結時期最佳化，讓二進位檔更精簡且效能更佳。

source: If this error occurs::
uk: Якщо виникає ця помилка:

source: There are two solutions:
tr: İki çözümü var:
uk: Є два рішення:
zh_tw: 有兩種解法：

source: In your SCons command, add the parameter ``use_static_cpp=no``.
es: En el comando SCons, agregue el parámetro ``use_static_cpp=no``.
tr: SCons komutunuza ``use_static_cpp=no`` parametresini ekleyin.
uk: У вашій команді SCons додайте параметр ``use_static_cpp=no``.
zh_tw: 在 SCons 指令裡加入 ``use_static_cpp=no`` 參數。

source: Follow `these instructions <https://github.com/ivmai/libatomic_ops#installation-and-usage>`__ to configure, build, and install ``libatomic_ops``. Then, copy ``/usr/lib/libatomic_ops.a`` to ``/usr/lib/libatomic.a``, or create a soft link to ``libatomic_ops`` by command ``ln -s /usr/lib/libatomic_ops.a /usr/lib/libatomic.a``. The soft link can ensure the latest ``libatomic_ops`` will be used without the need to copy it every time when it is updated.
es: Sigue `estas instrucciones <https://github.com/ivmai/libatomic_ops#installation-and-usage>`__ para configurar, compilar e instalar ``libatomic_ops``. Luego, copia ``/usr/lib/libatomic_ops.a`` a ``/usr/lib/libatomic.a``, o crea un enlace simbólico a ``libatomic_ops`` con el comando ``ln -s /usr/lib/libatomic_ops.a /usr/lib/libatomic.a``. El enlace simbólico puede garantizar que se use la última versión de ``libatomic_ops`` sin la necesidad de copiarla cada vez que se actualice.
tr: `Bu talimatları <https://github.com/ivmai/libatomic_ops#installation-and-usage>`__ takip ederek ``libatomic_ops`` dosyasını yapılandırın, derleyin ve kurun. Ardından, ``/usr/lib/libatomic_ops.a`` dosyasını ``/usr/lib/libatomic.a`` dosyasına kopyalayın veya ``ln -s /usr/lib/libatomic_ops.a /usr/lib/libatomic.a`` komutuyla ``libatomic_ops`` dosyasına bir yazılım bağlantısı oluşturun. Bu bağlantı, güncellendiğinde her seferinde kopyalamaya gerek kalmadan en son ``libatomic_ops`` 'un kullanılmasını sağlayabilir.
uk: Дотримуйтеся `цих інструкцій <https://github.com/ivmai/libatomic_ops#installation-and-usage>`__, щоб налаштувати, створити та встановити ``libatomic_ops``. Потім скопіюйте ``/usr/lib/libatomic_ops.a`` до ``/usr/lib/libatomic.a`` або створіть програмне посилання на ``libatomic_ops`` командою ``ln -s /usr/ lib/libatomic_ops.a /usr/lib/libatomic.a``. М'яке посилання може гарантувати, що останній ``libatomic_ops`` буде використовуватися без необхідності копіювати його кожного разу, коли він оновлюється.
zh_tw: 請依照 `這份說明 <https://github.com/ivmai/libatomic_ops#installation-and-usage>`__ 設定、建構並安裝 ``libatomic_ops``。然後將 ``/usr/lib/libatomic_ops.a`` 複製到 ``/usr/lib/libatomic.a``，或用 ``ln -s /usr/lib/libatomic_ops.a /usr/lib/libatomic.a`` 建立軟連結。這可確保每次更新後都會自動指向最新版 ``libatomic_ops``，無需每次手動複製。

source: Using mold for faster development
tr: Daha hızlı geliştirme için "mold" kullanımı
uk: Використання цвілі для швидшого розвитку
zh_tw: 以 mold 加速開發流程

source: For even faster linking compared to LLD, you can use `mold <https://github.com/rui314/mold>`__. mold can be used with either GCC or Clang.
es: Para una vinculación aún más rápida en comparación con LLD, puede usar `mold <https://github.com/rui314/mold>`__. mold se puede usar con GCC o Clang.
tr: LLD ile karşılaştırıldığında daha da hızlı bağlama için `mold <https://github.com/rui314/mold>`__ kullanabilirsiniz. mold, GCC veya Clang ile kullanılabilir.
uk: Для ще швидшого зв’язування порівняно з LLD ви можете використовувати `mold <https://github.com/rui314/mold>`__. mold можна використовувати з GCC або Clang.
zh_tw: 若想要比 LLD 更快的連結速度，可以使用 `mold <https://github.com/rui314/mold>`__。mold 可與 GCC 或 Clang 搭配使用。

source: As of January 2023, mold is not readily available in Linux distribution repositories, so you will have to install its binaries manually.
es: A partir de enero de 2023, mold no está disponible en los repositorios de distribución de Linux, por lo que tendrás que instalar sus binarios manualmente.
tr: Ocak 2023 itibariyle, mold Linux dağıtım depolarında hazır değildir, bu nedenle ikili dosyalarını elden yüklemeniz gerekecektir.
uk: Станом на січень 2023 року mold не доступний у сховищах дистрибутивів Linux, тому вам доведеться інсталювати його двійкові файли вручну.
zh_tw: 截至 2023 年 1 月，mold 尚未收錄於大多數 Linux 發行版套件庫，需手動安裝其二進位檔。

source: Download mold binaries from its `releases page <https://github.com/rui314/mold/releases/latest>`__.
es: Descarga binarios de mold desde su `página de lanzamientos <https://github.com/rui314/mold/releases/latest>`__.
tr: mold ikili dosyalarını `kendi sürümler sayfasından indirin <https://github.com/rui314/mold/releases/latest>`__.
uk: Завантажте двійкові файли mold зі сторінки випусків <https://github.com/rui314/mold/releases/latest>`__.
zh_tw: 請從其 `發行頁面 <https://github.com/rui314/mold/releases/latest>`__ 下載 mold 二進位檔。

source: Extract the ``.tar.gz`` file, then move the extracted folder to a location such as ``.local/share/mold``.
es: Extraiga el archivo ``.tar.gz``, luego mueva la carpeta extraída a una ubicación como ``.local/share/mold``.
tr: ``.tar.gz`` dosyasını ayıklayın, ardından çıkarılan klasörü ``.local/share/mold`` gibi bir konuma taşıyın.
uk: Розпакуйте файл ``.tar.gz``, а потім перемістіть видобуту папку в таке розташування, як ``.local/share/mold``.
zh_tw: 解壓縮 ``.tar.gz``，並將資料夾移至如 ``.local/share/mold`` 的位置。

source: Add ``$HOME/.local/share/mold/bin`` to your user's ``PATH`` environment variable. For example, you can add the following line at the end of your ``$HOME/.bash_profile`` file:
es: Agregue ``$HOME/.local/share/mold/bin`` a la variable de entorno ``PATH`` del usuario. Por ejemplo, puedes agregar la siguiente línea al final de tu archivo ``$HOME/.bash_profile``:
tr: Kullanıcınızın ``PATH`` ortam değişkenine ``$HOME/.local/share/mold/bin`` ekleyin. Örneğin, ``$HOME/.bash_profile`` dosyanızın sonuna aşağıdaki satırı ekleyebilirsiniz:
uk: Додайте ``$HOME/.local/share/mold/bin`` до змінної середовища вашого користувача ``PATH``. Наприклад, ви можете додати такий рядок у кінці вашого файлу ``$HOME/.bash_profile``:
zh_tw: 將 ``$HOME/.local/share/mold/bin`` 加入你的 ``PATH`` 環境變數。例如可在 ``$HOME/.bash_profile`` 檔末加上：

source: Open a new terminal (or run ``source "$HOME/.bash_profile"``), then use the following SCons command when compiling Godot::
uk: Відкрийте новий термінал (або запустіть ``source "$HOME/.bash_profile"``), а потім використовуйте таку команду SCons під час компіляції Godot::

source: Using system libraries for faster development
tr: Daha hızlı geliştirme için sistem kütüphanelerini kullanma
uk: Використання системних бібліотек для прискорення розробки
zh_tw: 以系統函式庫加速開發

source: `Godot bundles the source code of various third-party libraries. <https://github.com/godotengine/godot/tree/master/thirdparty>`__ You can choose to use system versions of third-party libraries instead. This makes the Godot binary faster to link, as third-party libraries are dynamically linked. Therefore, they don't need to be statically linked every time you build the engine (even on small incremental changes).
es: `Godot incluye el código fuente de varias bibliotecas de terceros. <https://github.com/godotengine/godot/tree/master/thirdparty>`__ También puedes optar por utilizar versiones en su sistema de estas bibliotecas. Esto hace que el binario de Godot sea más rápido de vincular, ya que las bibliotecas de terceros están vinculadas dinámicamente. Por lo tanto, no es necesario vincularlas estáticamente cada vez que crea el motor (incluso en pequeños cambios incrementales).
tr: `Godot çeşitli üçüncü taraf kütüphanelerin kaynak kodlarını bir arada getirir. <https://github.com/godotengine/godot/tree/master/thirdparty>`__ Bunun yerine üçüncü taraf kütüphanelerin sistem sürümlerini kullanmayı seçebilirsiniz. Üçüncü taraf kütüphaneleri dinamik olarak bağlandığı için bu, Godot ikili dosyasının daha hızlı bağlanmasını sağlar. Bu nedenle, motoru her derlediğinizde (küçük artımlı değişikliklerde bile) statik olarak bağlanmaları gerekmez.
uk: `Godot об’єднує вихідний код різних сторонніх бібліотек. <https://github.com/godotengine/godot/tree/master/thirdparty>`__ Натомість ви можете використовувати системні версії сторонніх бібліотек. Це робить двійковий файл Godot швидшим для зв’язування, оскільки сторонні бібліотеки зв’язуються динамічно. Таким чином, їх не потрібно статично пов’язувати кожного разу, коли ви створюєте механізм (навіть при невеликих поступових змінах).
zh_tw: `Godot 內建多種第三方函式庫原始碼。 <https://github.com/godotengine/godot/tree/master/thirdparty>`__ 你也可以選擇改用系統內提供的第三方函式庫。這樣 Godot 二進位檔的連結速度會更快，因為第三方函式庫會用動態連結，每次建構引擎（即使只是小幅變更）都不用重複靜態連結。

source: However, not all Linux distributions have packages for third-party libraries available (or they may not be up-to-date).
es: Sin embargo, no todas las distribuciones de Linux tienen paquetes para bibliotecas de terceros disponibles (o pueden no estar actualizados).
tr: Ancak, tüm Linux dağıtımlarında üçüncü parti kütüphaneler için paketler mevcut değildir (ya da güncel olmayabilirler).
uk: Однак не всі дистрибутиви Linux мають пакунки для бібліотек сторонніх розробників (або вони можуть бути неоновленими).
zh_tw: 但不是所有 Linux 發行版都有這些第三方函式庫的套件（或可能不是最新版）。

source: Moving to system libraries can reduce linking times by several seconds on slow CPUs, but it requires manual testing depending on your Linux distribution. Also, you may not be able to use system libraries for everything due to bugs in the system library packages (or in the build system, as this feature is less tested).
es: Pasar a las bibliotecas del sistema puede reducir los tiempos de vinculación por varios segundos en CPU lentas, pero requiere pruebas manuales según la distribución de Linux. Además, es posible que no pueda usar bibliotecas del sistema para todo debido a errores en los paquetes de bibliotecas del sistema (o en el sistema de compilación, ya que esta función está menos probada).
tr: Sistem kütüphanelerine geçiş, yavaş CPU'larda bağlama sürelerini birkaç saniye azaltabilir, ancak Linux dağıtımınıza bağlı olarak elden test etmeyi gerektirir. Ayrıca, sistem kütüphanesi paketlerindeki (veya bu özellik daha az test edildiğinden derleme sistemindeki) hatalar nedeniyle sistem kütüphanelerini her şey için kullanamayabilirsiniz.
uk: Перехід до системних бібліотек може скоротити час зв’язування на кілька секунд на повільних процесорах, але це вимагає ручного тестування залежно від вашого дистрибутива Linux. Крім того, можливо, ви не зможете використовувати системні бібліотеки для всього через помилки в пакетах системної бібліотеки (або в системі збірки, оскільки ця функція менш перевірена).
zh_tw: 改用系統函式庫能讓連結時間在慢速 CPU 上減少數秒，但這需要依你的 Linux 發行版手動測試。此外，某些情境下可能無法全部用系統函式庫，因為系統套件或建構系統本身偶有 bug（這類用法測試較少）。

source: To compile Godot with system libraries, install these dependencies **on top** of the ones listed in the :ref:`doc_compiling_for_linuxbsd_oneliners`:
uk: Щоб скомпілювати Godot із системними бібліотеками, встановіть ці залежності **поверх** залежностей, перелічених у :ref:`doc_compiling_for_linuxbsd_oneliners`:
zh_tw: 要用系統函式庫編譯 Godot，請在 :ref:`doc_compiling_for_linuxbsd_oneliners` 所列相依套件基礎上，再安裝這些依賴項：

source: After installing all required packages, use the following command to build Godot:
es: Después de instalar todos los paquetes necesarios, utiliza el siguiente comando para compilar Godot:
tr: Gerekli tüm paketleri kurduktan sonra Godot'yu derlemek için aşağıdaki komutu kullanın:
uk: Після встановлення всіх необхідних пакетів скористайтеся такою командою, щоб створити Godot:
zh_tw: 安裝所有需要的套件後，請用下列指令建構 Godot：

source: On Debian stable, you will need to remove `builtin_embree=no` as the system-provided Embree version is too old to work with Godot's latest `master` branch (which requires Embree 4).
es: En Debian estable, necesitará eliminar `builtin_embree=no` ya que la versión de Embree proporcionada por el sistema es demasiado antigua para funcionar con la última rama `master` de Godot (que requiere Embree 4).
uk: У стабільній версії Debian вам потрібно буде видалити `builtin_embree=no`, оскільки надана системою версія Embree надто стара, щоб працювати з останньою `master` гілкою Godot (для якої потрібен Embree 4).
zh_tw: 在 Debian 穩定版上，需移除 `builtin_embree=no`，因為系統提供的 Embree 版本太舊，無法支援 Godot 最新 master 分支（需 Embree 4）。

source: You can view a list of all built-in libraries that have system alternatives by running ``scons -h``, then looking for options starting with ``builtin_``.
es: Puedes ver una lista de todas las bibliotecas integradas que tienen alternativas del sistema ejecutando ``scons -h`` y luego buscando opciones que comiencen con ``builtin_``.
tr: Sistem alternatifleri olan tüm yerleşik kütüphanelerin bir listesini ``scons -h`` komutunu çalıştırıp ``builtin_`` ile başlayan seçenekleri arayarak görüntüleyebilirsiniz.
uk: Ви можете переглянути список усіх вбудованих бібліотек, які мають системні альтернативи, запустивши ``scons -h``, а потім шукаючи параметри, що починаються з ``builtin_``.
zh_tw: 你可以執行 ``scons -h``，查閱所有有系統替代方案的內建函式庫，搜尋開頭為 ``builtin_`` 的選項。

source: When using system libraries, the resulting binary is **not** portable across Linux distributions anymore. Do not use this approach for creating binaries you intend to distribute to others, unless you're creating a package for a Linux distribution.
uk: При використанні системних бібліотек отриманий двійковий файл більше **не** переноситься між дистрибутивами Linux. Не використовуйте цей підхід для створення двійкових файлів, які ви збираєтеся розповсюдити іншим, якщо ви не створюєте пакет для дистрибутива Linux.
zh_tw: 使用系統函式庫時，產生的二進位檔**無法**於不同 Linux 發行版之間移植。請勿用於要分發給他人的可執行檔，除非你是要為特定 Linux 發行版打包。
