Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_for_linuxbsd.po
Languages: es, tr, uk, zh_tw

source: Compiling for Linux, \*BSD
tr: Linux, \*BSD için derleme
uk: Компіляція для Linux, \*BSD
zh_tw: 在 Linux、\*BSD 上編譯

source: This page describes how to compile Linux editor and export template binaries from source. If you're looking to export your project to Linux instead, read :ref:`doc_exporting_for_linux`.
es: Esta página describe cómo compilar los binarios del editor y las plantillas de exportación para Linux desde el código fuente. Si lo que buscas es exportar tu proyecto a Linux, consulta :ref:`doc_exporting_for_linux`.
tr: Bu sayfa Linux düzenleyicisinin ve dışa aktarım şablon ikili dosyalarının kaynaktan nasıl derleneceğini açıklamaktadır. Bunun yerine projenizi Linux için dışa aktarmak istiyorsanız :ref:`doc_exporting_for_linux` sayfasını okuyun.
uk: На цій сторінці описано, як скомпілювати редактор Linux і експортувати двійкові файли шаблону з джерела. Якщо ви натомість хочете експортувати свій проект у Linux, прочитайте :ref:`doc_exporting_for_linux`.
zh_tw: 本頁說明如何從原始碼編譯 Linux 編輯器與匯出樣板二進位檔案。如果你想要的是將專案匯出到 Linux，請參閱 :ref:`doc_exporting_for_linux`。

source: Requirements
es: Requerimientos
tr: Gereklilikler
uk: Вимоги
zh_tw: 系統需求

source: For compiling under Linux or other Unix variants, the following is required:
es: Para compilar en Linux u otras variantes de Unix, se requiere lo siguiente:
tr: Linux veya diğer Unix varyantları altında derleme yapmak için aşağıdakiler gereklidir:
uk: Для того щоб зібрати проєкт під Linux чи який-небудь інший вид Unix системи, вам знадобляться:
zh_tw: 在 Linux 或其他 Unix 變種系統下編譯時，需具備下列條件：

source: GCC 9+ or Clang 6+.
tr: GCC 9+ veya Clang 6+.
uk: GCC 9+ або Clang 6+.
zh_tw: GCC 9+ 或 Clang 6+。

source: `SCons 4.0+ <https://scons.org/pages/download.html>`_ build system.
uk: `SCons 4.0+ <https://scons.org/pages/download.html>`_ будувати систему.
zh_tw: `SCons 4.0+ <https://scons.org/pages/download.html>`_ 建置系統。

source: pkg-config (used to detect the development libraries listed below).
tr: pkg-config (aşağıda listelenen geliştirme kütüphanelerini tespit etmek için kullanılır).
uk: pkg-config (використовується для виявлення бібліотек розробки, перелічених нижче).
zh_tw: pkg-config（用於偵測下方所列開發函式庫）。

source: Development libraries:
es: Librerías de desarrollo:
tr: Geliştirme kütüphaneleri:
uk: Бібліотеки розробки:
zh_tw: 開發函式庫：

source: X11, Xcursor, Xinerama, Xi and XRandR.
tr: X11, Xcursor, Xinerama, Xi ve XRandR.
uk: X11, Xcursor, Xinerama, Xi та XRandR.
zh_tw: X11、Xcursor、Xinerama、Xi 與 XRandR 開發函式庫。

source: Wayland and wayland-scanner.
es: Wayland y wayland-scanner.
tr: Wayland ve wayland-scanner.
uk: Wayland і Wayland-сканер.
zh_tw: Wayland 及 wayland-scanner。

source: *Optional* - libudev (build with ``udev=yes``).
es: *Opcional* - libudev (compilar con ``udev=yes``).
tr: *İsteğe bağlı* - libudev (``udev=yes`` ile derlenir).
uk: *За бажанням* - libudev (зберіть з параметром ``udev=yes``).
zh_tw: *可選* - libudev（以 ``udev=yes`` 編譯）。

source: To get the Godot source code for compiling, see :ref:`doc_getting_source`.
es: Para obtener el código fuente de Godot para compilarlo, consulta la sección :ref:`doc_getting_source`.
tr: Derlemek üzere Godot kaynak kodunu almak için :ref:`doc_getting_source` sayfasına bakın.
uk: Щоб отримати вихідний код Godot для компіляції, перегляньте :ref:`doc_getting_source`.
zh_tw: 如需取得 Godot 編譯所需的原始碼，請參閱 :ref:`doc_getting_source`。

source: For a general overview of SCons usage for Godot, see :ref:`doc_introduction_to_the_buildsystem`.
es: Para obtener una visión general del uso de SCons para Godot, consulta la sección :ref:`doc_introduction_to_the_buildsystem`.
tr: Godot için SCons kullanımına genel bir bakış için bkz :ref:`doc_introduction_to_the_buildsystem`.
uk: Для загального огляду використання SCons для Godot див. :ref:`doc_introduction_to_the_buildsystem`.
zh_tw: 關於 Godot 使用 SCons 的基本說明，請參閱 :ref:`doc_introduction_to_the_buildsystem`。

source: Distro-specific one-liners
es: Líneas de comandos específicas para cada distribución
tr: Dağıtıma-özgü tek-satırlık ifadeler
uk: Команди для різних дистрибутивів
zh_tw: 各發行版安裝指令

source: For audio support, you can optionally install ``pulseaudio``.
es: Para tener soporte de audio, opcionalmente puedes instalar "pulseaudio".
tr: Ses desteği için isteğe bağlı olarak ``pulseaudio`` yükleyebilirsiniz.
uk: Для забезпечення підтримки звуку ви, якщо хочете, можете встановити ``pulseaudio``.
zh_tw: 若要支援音訊，可額外安裝 ``pulseaudio``。

source: Compiling
es: Compilando
tr: Derleme
uk: Компілювання
zh_tw: 編譯

source: Start a terminal, go to the root dir of the engine source code and type:
es: Inicia una terminal, ve al directorio raíz del código fuente del motor y escribe:
tr: Bir terminal başlatın, (klonlanmış/indirilmiş) motor kaynak kodunun kök dizinine gidin ve şunu yazın:
uk: Відкрийте термінал, перейдіть до кореневої директорії проєкту та введіть:
zh_tw: 開啟終端機，前往 Godot 原始碼根目錄並輸入：

source: Prior to Godot 4.0, the Linux/\*BSD target was called ``x11`` instead of ``linuxbsd``. If you are looking to compile Godot 3.x, make sure to use the `3.x branch of this documentation <https://docs.godotengine.org/en/3.6/development/compiling/compiling_for_x11.html>`__.
es: Antes de Godot 4.0, el destino Linux/\*BSD se llamaba ``x11`` en lugar de ``linuxbsd``. Si deseas compilar Godot 3.x, asegúrese de utilizar la `rama 3.x de esta documentación <https://docs.godotengine.org/en/3.6/development/compiling/compiling_for_x11.html>`__.
tr: Godot 4.0'dan önce Linux/\*BSD hedefi ``linuxbsd`` yerine ``x11`` olarak adlandırılıyordu. Godot 3.x`i derlemek istiyorsanız, `bu belgenin 3.x dalını <https://docs.godotengine.org/en/3.6/development/compiling/compiling_for_x11.html>`__ kullandığınızdan emin olun (çevirisi bulunmayabilir).
uk: До Godot 4.0 ціль Linux/\*BSD називалася ``x11`` замість ``linuxbsd``. Якщо ви хочете скомпілювати Godot 3.x, обов’язково використовуйте гілку 3.x цієї документації <https://docs.godotengine.org/en/3.6/development/compiling/compiling_for_x11.html>`__.
zh_tw: Godot 4.0 以前，Linux/\*BSD 目標稱為 ``x11``，不是 ``linuxbsd``。若要編譯 Godot 3.x，請參閱本說明文件的 `3.x 分支 <https://docs.godotengine.org/en/3.6/development/compiling/compiling_for_x11.html>`__。

source: If you are compiling Godot to make changes or contribute to the engine, you may want to use the SCons options ``dev_build=yes`` or ``dev_mode=yes``. See :ref:`doc_introduction_to_the_buildsystem_development_and_production_aliases` for more info.
uk: Якщо ви компілюєте Godot, щоб внести зміни або зробити внесок у механізм, ви можете використати параметри SCons ``dev_build=yes`` або ``dev_mode=yes``. Перегляньте :ref:`doc_introduction_to_the_buildsystem_development_and_production_aliases` для отримання додаткової інформації.
zh_tw: 若你自行編譯 Godot 以進行修改或貢獻開發，建議在 SCons 加上 ``dev_build=yes`` 或 ``dev_mode=yes`` 選項。詳情請參閱 :ref:`doc_introduction_to_the_buildsystem_development_and_production_aliases`。

source: If all goes well, the resulting binary executable will be placed in the "bin" subdirectory. This executable file contains the whole engine and runs without any dependencies. Executing it will bring up the Project Manager.
tr: Her şey yolunda giderse, ortaya çıkan ikili yürütülebilir dosya "bin" alt dizinine yerleştirilecektir. Bu çalıştırılabilir dosya tüm motoru içerir ve herhangi bir bağımlılık olmadan çalışır. Çalıştırıldığında ekrana Proje Yöneticisi gelecektir.
uk: Якщо все піде добре, отриманий двійковий виконуваний файл буде розміщено в підкаталозі "bin". Цей виконуваний файл містить весь механізм і працює без будь-яких залежностей. Після його виконання з’явиться менеджер проекту.
zh_tw: 若一切順利，產生的二進位可執行檔會放在「bin」子目錄中，該檔案包含整個 Godot 引擎，可獨立執行。執行後會打開專案管理員。

source: If you wish to compile using Clang rather than GCC, use this command:
es: Si deseas compilar utilizando Clang en lugar de GCC, usa este comando:
tr: GCC yerine Clang kullanarak derlemek isterseniz, bu komutu kullanın:
uk: Якщо ж вам хочеться зібрати проєкт використовуючи Clang а не GCC, то використайте команду:
zh_tw: 若想用 Clang 而不是 GCC 編譯，請使用下列指令：

source: Using Clang appears to be a requirement for OpenBSD, otherwise fonts would not build. For RISC-V architecture devices, use the Clang compiler instead of the GCC compiler.
es: El uso de Clang parece ser un requisito para OpenBSD, de lo contrario, las fuentes no se compilarían correctamente. Para dispositivos con arquitectura RISC-V, utiliza el compilador Clang en lugar del compilador GCC.
tr: Clang kullanmak OpenBSD için bir gereklilik gibi görünmektedir, aksi takdirde yazı tipleri oluşturulamaz. RISC-V mimarili aygıtlar için GCC derleyicisi yerine Clang derleyicisini kullanın.
uk: Використання Clang є обов’язковою умовою для OpenBSD, інакше шрифти не збиратимуться. Для пристроїв з архітектурою RISC-V використовуйте компілятор Clang замість компілятора GCC.
zh_tw: 在 OpenBSD 上必須使用 Clang，否則字型無法正確建構。如需支援 RISC-V 架構，亦請使用 Clang 編譯器替代 GCC。

source: If you are compiling Godot for production use, you can make the final executable smaller and faster by adding the SCons option ``production=yes``. This enables additional compiler optimizations and link-time optimization.
tr: Godot'u üretim kullanımı için derliyorsanız, ``production=yes`` SCons seçeneğini ekleyerek son çalıştırılabilir dosyayı daha küçük ve daha hızlı hale getirebilirsiniz. Bu, ek derleyici optimizasyonlarını ve bağlantı zamanı optimizasyonunu etkinleştirir.
uk: Якщо ви компілюєте Godot для використання у виробництві, ви можете зробити кінцевий виконуваний файл меншим і швидшим, додавши опцію SCons ``production=yes``. Це дозволяє додатково оптимізувати компілятор і оптимізувати час зв’язку.
zh_tw: 若要為正式發行版本編譯 Godot，可加上 SCons 選項 ``production=yes``，讓最終執行檔更精簡且速度更快。此選項會啟用進階編譯器最佳化與連結時最佳化（LTO）。

source: LTO takes some time to run and requires about 7 GB of available RAM while compiling. If you're running out of memory with the above option, use ``production=yes lto=none`` or ``production=yes lto=thin`` for a lightweight but less effective form of LTO.
es: LTO tarda un tiempo en ejecutarse y requiere aproximadamente 7 GB de RAM disponible durante la compilación. Si se está quedando sin memoria con la opción anterior, utiliza ``production=yes lto=none`` o ``production=yes lto=thin`` para utilizar una forma liviana pero menos efectiva de LTO.
tr: LTO'nun çalışması biraz zaman alır ve derleme sırasında yaklaşık 7 GB kullanılabilir RAM gerektirir. Yukarıdaki seçenekle belleğiniz tükeniyorsa, LTO olmadan ``production=yes lto=none`` veya hafif ama daha az etkili bir biçimi için ``production=yes lto=thin`` kullanın.
uk: LTO потребує деякий час для запуску та вимагає близько 7 ГБ доступної оперативної пам’яті під час компіляції. Якщо вам не вистачає пам’яті з наведеним вище параметром, використовуйте ``production=yes lto=none`` або ``production=yes lto=thin`` для легкої, але менш ефективної форми LTO.
zh_tw: LTO （連結時最佳化）編譯需要較長時間並約 7 GB 記憶體。若遇到記憶體不足，可改用 ``production=yes lto=none`` 或 ``production=yes lto=thin``，這樣雖然最佳化效果較低但較節省資源。

source: If you want to use separate editor settings for your own Godot builds and official releases, you can enable :ref:`doc_data_paths_self_contained_mode` by creating a file called ``._sc_`` or ``_sc_`` in the ``bin/`` folder.
es: Si deseas utilizar configuraciones de editor separadas para tus propias compilaciones de Godot y las versiones oficiales, puedes habilitar :ref:`doc_data_paths_self_contained_mode` creando un archivo llamado ``._sc_`` o ``_sc_`` en la carpeta ``bin/``.
tr: Kendi Godot derlemeleriniz ve resmi sürümleriniz için ayrı düzenleyici ayarları kullanmak istiyorsanız, ``bin/`` klasöründe ``._sc_`` veya ``_sc_`` adlı bir dosya oluşturarak :ref:`doc_data_paths_self_contained_mode`u etkinleştirebilirsiniz.
uk: Якщо ви хочете використовувати окремі параметри редактора для власних збірок Godot та офіційних випусків, ви можете ввімкнути :ref:`doc_data_paths_self_contained_mode`, створивши файл під назвою ``._sc_`` або ``_sc_`` у ``bin/`` папка.
zh_tw: 若希望自編譯 Godot 和官方版本使用不同編輯器設定，可在 ``bin/`` 資料夾內建立 ``._sc_`` 或 ``_sc_`` 檔案，以啟用 :ref:`doc_data_paths_self_contained_mode`。

source: Running a headless/server build
tr: Başsız/sunucu derlemesi çalıştırma
uk: Запуск безголової/серверної збірки
zh_tw: 執行無介面／伺服器版本

source: To run in *headless* mode which provides editor functionality to export projects in an automated manner, use the normal build::
uk: Щоб працювати в режимі *headless*, який надає функції редактора для автоматичного експорту проектів, використовуйте звичайну збірку::

source: And then use the ``--headless`` command line argument::
uk: А потім скористайтеся аргументом командного рядка ``--headless``::

source: To compile a debug *server* build which can be used with :ref:`remote debugging tools <doc_command_line_tutorial>`, use::
uk: Щоб зібрати *серверну* версію, яку можна використати зі :ref:`remote debugging tools <doc_command_line_tutorial>`, скористайтесь:

source: To compile a *server* build which is optimized to run dedicated game servers, use::
uk: Щоб зібрати *серверну* версію, оптимізовану для запуску ігрових серверів, скористайтесь:

source: Building export templates
es: Construyendo plantillas de exportación
tr: Dışa aktarma şablonları oluşturma
uk: Збірка шаблонів експорту
zh_tw: 建構匯出樣板

source: Linux binaries usually won't run on distributions that are older than the distribution they were built on. If you wish to distribute binaries that work on most distributions, you should build them on an old distribution such as Ubuntu 16.04. You can use a virtual machine or a container to set up a suitable build environment.
es: Las binarias de Linux generalmente no se ejecutarán en distribuciones más antiguas que la distribución en la que fueron compiladas. Si deseas distribuir binarios que funcionen en la mayoría de las distribuciones, debes compilarlos en una distribución antigua como Ubuntu 16.04. Puedes utilizar una máquina virtual o un contenedor para configurar un entorno de compilación adecuado.
tr: Linux ikili dosyaları genellikle oluşturuldukları dağıtımdan daha eski dağıtımlarda çalışmaz. Çoğu dağıtım üzerinde çalışabilen ikili dosyalar dağıtmak istiyorsanız, bunları Ubuntu 16.04 gibi eski bir dağıtım üzerinde oluşturmalısınız. Uygun bir derleme ortamı oluşturmak için bir sanal makine veya bir taşıyıcı kullanabilirsiniz.
uk: Зазвичай, програми для Linux не запускаються на дистрибутивах, старіших ніж той, на якому вони побудовані. Якщо ви хочете мати змогу розповсюджувати свою збірку серед більшости дистрибутивів, вам варто зібрати програму на старій версії ОС, на зразок Ubuntu 16.04. Ви можете скористатись віртуальними машинами чи контейнерами щоб підготувати стабільне середовище для збірки.
zh_tw: Linux 二進位檔通常無法在比建構時所用發行版還舊的版本上執行。若要讓二進位檔可於大多數發行版運作，建議使用較舊的發行版（如 Ubuntu 16.04）建構。你可以利用虛擬機或容器建立合適的建構環境。

source: To build Linux or \*BSD export templates, run the build system with the following parameters:
tr: Linux veya \*BSD dışa aktarma şablonları oluşturmak için, derleme sistemini aşağıdaki parametrelerle çalıştırın:
uk: Щоб створити шаблони експорту Linux або \*BSD, запустіть систему збирання з такими параметрами:
zh_tw: 要建構 Linux 或 \*BSD 匯出樣板，請用下列參數執行建構系統：

source: (32 bits)
tr: (32 bitlik)
uk: (32 біт)
zh_tw: (32 位元)

source: (64 bits)
tr: (64 bitlik)
uk: (64 біт)
zh_tw: (64 位元)

source: Note that cross-compiling for the opposite bits (64/32) as your host platform is not always straight-forward and might need a chroot environment.
es: Ten en cuenta que la compilación cruzada para bits opuestos (64/32) a los de tu plataforma de host no siempre es sencilla y puede requerir un entorno chroot.
tr: Ana platformunuzla zıt bitler (64/32) için çapraz derlemenin her zaman kolay olmadığını ve bir chroot ortamına ihtiyaç duyabileceğini unutmayın.
uk: Візьміть до уваги: збірка для протилежної платформи (64/32) може бути складним завданням, та потребувати входу в середовище chroot.
zh_tw: 請注意，為與宿主平台不同位元（64/32）進行交叉編譯時，有時並不簡單，可能需額外建置 chroot 環境。

source: To create standard export templates, the resulting files in the ``bin/`` folder must be copied to:
es: Para crear plantillas de exportación estándar, los archivos resultantes en la carpeta ``bin/`` deben copiarse a:
tr: Standart dışa aktarma şablonları oluşturmak için, ``bin/`` klasöründeki sonuç dosyaları şuraya kopyalanmalıdır:
uk: Щоб створити стандартні шаблони експорту, отримані файли в папці ``bin/`` необхідно скопіювати до:
zh_tw: 若要建立標準匯出樣板，必須將 ``bin/`` 資料夾下產生的檔案複製到：

source: and named like this (even for \*BSD which is seen as "Linux/X11" by Godot):
es: y nombrados de la siguiente manera (incluso para \*BSD que es reconocido como "Linux/X11" por Godot):
tr: ve bu şekilde adlandırılmalıdırlar (Godot tarafından "Linux/X11" olarak görülen \*BSD için bile):
uk: і має таку назву (навіть для \*BSD, який Godot розглядає як «Linux/X11»):
zh_tw: 並必須使用下列命名（Godot 會將 \*BSD 視為「Linux/X11」）：

source: However, if you are writing your custom modules or custom C++ code, you might instead want to configure your binaries as custom export templates here:
uk: А якщо ви пишете власні модулі чи код на C++ то вам, натомість, краще обрати ваші шаблони експорту тут:

source: You don't even need to copy them, you can just reference the resulting files in the ``bin/`` directory of your Godot source folder, so the next time you build, you automatically have the custom templates referenced.
es: Ni siquiera necesitas copiarlos, simplemente puedes hacer referencia a los archivos resultantes en el directorio ``bin/`` de la carpeta de origen de Godot, de esta manera, la próxima vez que construyas, automáticamente tendrás las plantillas personalizadas referenciadas.
tr: Bunları kopyalamanıza bile gerek yoktur, sadece Godot kaynak klasörünüzün ``bin/`` dizinindeki sonuç dosyalarına başvuru verebilirsiniz, böylece bir sonraki derlemenizde otomatik olarak özel şablonlara başvuru vermiş olursunuz.
uk: Вам навіть не потрібно копіювати їх файли, достатньо просто вказати їх в підтеці ``bin/`` з теки, де знаходиться код Godot, щоб наступного разу, при збірці, ваші шаблони будуть додані автоматично.
zh_tw: 其實你不必複製檔案，只需直接參照 Godot 原始碼資料夾下 ``bin/`` 內的檔案，下次建構時就會自動套用這些自定樣板。

source: Cross-compiling for RISC-V devices
uk: Крос-компіляція для пристроїв RISC-V
zh_tw: 為 RISC-V 裝置進行交叉編譯

source: To cross-compile Godot for RISC-V devices, we need to setup the following items:
uk: Для крос-компіляції Godot для пристроїв RISC-V нам потрібно налаштувати такі елементи:
zh_tw: 要為 RISC-V 裝置交叉編譯 Godot，需準備下列項目：

source: `riscv-gnu-toolchain <https://github.com/riscv-collab/riscv-gnu-toolchain/releases>`__. While we are not going to use this directly, it provides us with a sysroot, as well as header and libraries files that we will need. There are many versions to choose from, however, the older the toolchain, the more compatible our final binaries will be. If in doubt, `use this version <https://github.com/riscv-collab/riscv-gnu-toolchain/releases/tag/2021.12.22>`__, and download ``riscv64-glibc-ubuntu-18.04-nightly-2021.12.22-nightly.tar.gz``. Extract it somewhere and remember its path.
uk: `riscv-gnu-toolchain <https://github.com/riscv-collab/riscv-gnu-toolchain/releases>`__. Хоча ми не збираємося використовувати це безпосередньо, воно надає нам sysroot, а також файли заголовків і бібліотек, які нам знадобляться. Є багато версій на вибір, однак, чим старший інструментарій, тим більш сумісними будуть наші остаточні двійкові файли. Якщо сумніваєтеся, `скористайтеся цією версією <https://github.com/riscv-collab/riscv-gnu-toolchain/releases/tag/2021.12.22>`__ і завантажте ``riscv64-glibc-ubuntu-18.04-nightly-2021.12.22-nightly.tar.gz``. Витягніть його кудись і запам'ятайте його шлях.
zh_tw: `riscv-gnu-toolchain <https://github.com/riscv-collab/riscv-gnu-toolchain/releases>`__。雖然我們不會直接使用這個工具鏈，但它會提供需要的 sysroot、標頭檔與函式庫檔案。可選擇多個版本，一般來說工具鏈越舊，產生的二進位檔相容性越好。如不確定，建議 `使用這個版本 <https://github.com/riscv-collab/riscv-gnu-toolchain/releases/tag/2021.12.22>`__，並下載 ``riscv64-glibc-ubuntu-18.04-nightly-2021.12.22-nightly.tar.gz``，解壓後記住路徑。

source: `mold <https://github.com/rui314/mold/releases>`__. This fast linker, is the only one that correctly links the resulting binary. Download it, extract it, and make sure to add its ``bin`` folder to your PATH. Run ``mold --help | grep support`` to check if your version of Mold supports RISC-V. If you don't see RISC-V, your Mold may need to be updated.
uk: `mold <https://github.com/rui314/mold/releases>`__. Цей швидкий компонувальник є єдиним, який правильно зв’язує результуючий двійковий файл. Завантажте його, розпакуйте та обов’язково додайте його папку ``bin`` до свого ШЛЯХУ. Запустіть ``mold --help | grep support``, щоб перевірити, чи ваша версія Mold підтримує RISC-V. Якщо ви не бачите RISC-V, можливо, ваш Mold потрібно оновити.
zh_tw: `mold <https://github.com/rui314/mold/releases>`__。這是一個非常快速的連結器，目前是唯一能正確連結 Godot RISC-V 執行檔的工具。下載並解壓後，將其 ``bin`` 資料夾加入 PATH。可執行 ``mold --help | grep support`` 檢查你的 mold 是否支援 RISC-V。若未出現 RISC-V，則需更新 mold 版本。

source: To make referencing our toolchain easier, we can set an environment variable like this:
es: Para facilitar la referencia a nuestra cadena de herramientas, podemos establecer una variable de entorno como esta:
uk: Щоб спростити посилання на наш інструментальний ланцюжок, ми можемо встановити таку змінну середовища:
zh_tw: 為方便參照工具鏈，可設定如下環境變數：

source: This way, we won't have to manually set the directory location each time we want to reference it.
es: De esta manera, no tendremos que configurar manualmente la ubicación del directorio cada vez que queramos referenciarlo.
uk: Таким чином, нам не доведеться вручну встановлювати розташування каталогу кожного разу, коли ми хочемо посилатися на нього.
zh_tw: 如此一來，每次要用到時就不用再手動設定路徑。

source: With all the above setup, we are now ready to build Godot.
es: Con toda la configuración anterior, ahora estamos listos para construir Godot.
uk: Після всіх наведених вище налаштувань ми готові створити Godot.
zh_tw: 完成上述設定後，即可開始建構 Godot。

source: Go to the root of the source code, and execute the following build command:
uk: Перейдіть до кореневого каталогу вихідного коду та виконайте таку команду збірки:
zh_tw: 請進入原始碼根目錄，然後執行下列建構指令：

source: RISC-V GCC has `bugs with its atomic operations <https://github.com/riscv-collab/riscv-gcc/issues/15>`__ which prevent it from compiling Godot correctly. That's why Clang is used instead. Make sure that it *can* compile to RISC-V. You can verify by executing this command ``clang -print-targets``, make sure you see ``riscv64`` on the list of targets.
uk: RISC-V GCC має `помилки з його атомарними операціями <https://github.com/riscv-collab/riscv-gcc/issues/15>`__, які заважають йому правильно компілювати Godot. Ось чому замість нього використовується Clang. Переконайтеся, що він *може* скомпілюватися до RISC-V. Ви можете перевірити, виконавши цю команду ``clang -print-targets``, переконайтеся, що ви бачите ``riscv64`` у списку цілей.
zh_tw: RISC-V 的 GCC 在原子操作上有 `這些 bug <https://github.com/riscv-collab/riscv-gcc/issues/15>`__，導致無法正確編譯 Godot，因此必須改用 Clang。請確保 Clang 能夠編譯 RISC-V，可用 ``clang -print-targets`` 檢查，確認目標列表中有 ``riscv64``。
