Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_with_dotnet.po
Languages: es, ta, tr

source: Compiling with .NET
es: Compilación con .NET
ta: .NET உடன் தொகுத்தல்
tr: NET ile Derleme

source: Requirements
es: Requerimientos
ta: தேவைகள்
tr: Gereklilikler

source: `.NET SDK 8.0+ <https://dotnet.microsoft.com/download>`_
ta: ஒய். நென் SDK 8.0+ <https: // dotnet.

source: You can use ``dotnet --info`` to check which .NET SDK versions are installed.
es: Puede utilizar ``dotnet --info`` para comprobar qué versiones del SDK .NET están instaladas.
ta: எந்த .NET SDK பதிப்புகள் நிறுவப்பட்டுள்ளன என்பதை சரிபார்க்க `` டாட்நெட் - -இன்ஃபோ`` ஐப் பயன்படுத்தலாம்.
tr: Hangi .NET SDK sürümlerinin yüklü olduğunu kontrol etmek için ``dotnet --info`` kullanabilirsiniz.

source: Enable the .NET module
es: Habilitar el módulo .NET
ta: .NET தொகுதியை இயக்கவும்
tr: .NET modülünü etkinleştirin

source: C# support for Godot has historically used the `Mono <https://www.mono-project.com/>`_ runtime instead of the `.NET Runtime <https://github.com/dotnet/runtime>`_ and internally many things are still named ``mono`` instead of ``dotnet`` or otherwise referred to as ``mono``.
es: El soporte de C# para Godot ha utilizado históricamente el runtime de `Mono <https://www.mono-project.com/>`_ en lugar del `.NET Runtime <https://github.com/dotnet/runtime>`_ e internamente muchas cosas todavía se llaman ``mono`` en lugar de ``dotnet`` o se las referencia de otra manera como ``mono``.
ta: சி# கோடோட்டுக்கான உதவி வரலாற்று ரீதியாக `மோனோ <https://www.mono-project.com/>` _. நெட் இயக்க நேரத்திற்கு பதிலாக இயக்க நேரம் <https://github.com/dotnet/runtime> _ _ `` டாட்நெட்`` என்பதற்கு பதிலாக பல விசயங்கள் இன்னும் `` மோனோ` என்று பெயரிடப்பட்டுள்ளன அல்லது `` மோனோ`` என்று குறிப்பிடப்படுகின்றன.
tr: Godot için C# desteği tarihsel olarak `.NET Runtime <https://github.com/dotnet/runtime>`_ yerine `Mono https://www.mono-project.com/>`_ çalışma zamanını kullandı ve dahili olarak birçok şey hala ``dotnet`` yerine ``mono`` olarak adlandırılıyor veya başka bir şekilde ``mono`` olarak anılıyor.

source: By default, the .NET module is disabled when building. To enable it, add the option ``module_mono_enabled=yes`` to the SCons command line, while otherwise following the instructions for building the desired Godot binaries.
ta: இயல்பாக, கட்டமைக்கும் போது .NET தொகுதி முடக்கப்பட்டுள்ளது. அதை இயக்க, ச்கான்ச் கட்டளை வரியில் `` `Module_mono_enabled = ஆம்`` விருப்பத்தை சேர்க்கவும், இல்லையெனில் விரும்பிய கோடோட் பைனரிகளை உருவாக்குவதற்கான வழிமுறைகளைப் பின்பற்றுங்கள்.
tr: Varsayılan olarak, .NET modülü derleme sırasında devre dışı bırakılır. Etkinleştirmek için, SCons komut satırına ``module_mono_enabled=yes`` seçeneğini ekleyin, bunun haricinde sadece istediğiniz Godot ikili dosyalarını oluşturma talimatlarını izleyin.

source: Generate the glue
es: Generar el pegamento
ta: பசை உருவாக்கு
tr: Yapıştırıcıyı oluşturun

source: Parts of the sources of the managed libraries are generated from the ClassDB. These source files must be generated before building the managed libraries. They can be generated by any .NET-enabled Godot editor binary by running it with the parameters ``--headless --generate-mono-glue`` followed by the path to an output directory. This path must be ``modules/mono/glue`` in the Godot directory::
ta: நிர்வகிக்கப்பட்ட நூலகங்களின் ஆதாரங்களின் பகுதிகள் ClassDB இலிருந்து உருவாக்கப்படுகின்றன. நிர்வகிக்கப்பட்ட நூலகங்களை உருவாக்குவதற்கு முன்பு இந்த மூல கோப்புகள் உருவாக்கப்பட வேண்டும். ``--தலையற்ற-உருவாக்கும்-மோனோ-க்ளூ`` என்ற அளவுருக்கள் மூலம் இயக்குவதன் மூலம் எந்த .நெட்-இயக்கப்பட்ட கோடோட் எடிட்டர் பைனரியையும் உருவாக்கலாம். இந்த பாதை கோடோட் கோப்பகத்தில் `` தொகுதிகள்/மோனோ/பசை`` ஆக இருக்க வேண்டும் ::

source: This command will tell Godot to generate the C# bindings for the Godot API at ``modules/mono/glue/GodotSharp/GodotSharp/Generated``, and the C# bindings for the editor tools at ``modules/mono/glue/GodotSharp/GodotSharpEditor/Generated``. Once these files are generated, you can build Godot's managed libraries for all the desired targets without having to repeat this process.
ta: இந்த கட்டளை கோடோட் ஏபிஐக்கான சி# பிணைப்புகளை `` தொகுதிகள்/மோனோ/பசை/கோடோட்சார்ப்/கோடோட்சார்ப்/உருவாக்கப்பட்டது`` இல் உருவாக்கச் சொல்லும், மேலும் ஆசிரியர் கருவிகளுக்கான சி# பிணைப்புகள் `` தொகுதிகள்/மோனோ/பசை/கோடோட்சார்ப்/இல் கோடோட்சார்டிட்டர்/உருவாக்கப்பட்டது``. இந்த கோப்புகள் உருவாக்கப்பட்டதும், இந்த செயல்முறையை மீண்டும் செய்யாமல், விரும்பிய அனைத்து இலக்குகளுக்கும் கோடோட்டின் நிர்வகிக்கப்பட்ட நூலகங்களை உருவாக்கலாம்.
tr: Bu komut Godot'ya ``modules/mono/glue/GodotSharp/GodotSharp/Generated`` adresinde Godot API için C# bağlarını ve ``modules/mono/glue/GodotSharp/GodotSharpEditor/Generated`` adresinde düzenleyici araçları için C# bağlarını oluşturmasını söyleyecektir. Bu dosyalar oluşturulduktan sonra, bu işlemi tekrarlamak zorunda kalmadan istediğiniz tüm hedefler için Godot'nun yönetilen kütüphanelerini oluşturabilirsiniz.

source: ``<godot_binary>`` refers to the editor binary you compiled with the .NET module enabled. Its exact name will differ based on your system and configuration, but should be of the form ``bin/godot.<platform>.editor.<arch>.mono``, e.g. ``bin/godot.linuxbsd.editor.x86_64.mono`` or ``bin/godot.windows.editor.x86_32.mono.exe``. Be especially aware of the **.mono** suffix! If you've previously compiled Godot without .NET support, you might have similarly named binaries without this suffix. These binaries can't be used to generate the .NET glue.
ta: `` <godot_binary> `` என்பது நீங்கள் இயக்கப்பட்ட .net தொகுதியுடன் தொகுத்த எடிட்டர் பைனரியைக் குறிக்கிறது. அதன் சரியான பெயர் உங்கள் கணினி மற்றும் உள்ளமைவின் அடிப்படையில் வேறுபடும், ஆனால் `` பின்/கோடோட். . **. மோனோ ** பின்னொட்டு பற்றி குறிப்பாக எச்சரிக்கையாக இருங்கள்! நெட் உதவி இல்லாமல் நீங்கள் முன்பு கோடோட்டை தொகுத்திருந்தால், இந்த பின்னொட்டு இல்லாமல் நீங்கள் இதேபோல் பைனரிகள் பெயரிடப்பட்டிருக்கலாம். நெட் பசை உருவாக்க இந்த பைனரிகளைப் பயன்படுத்த முடியாது.
tr: ``<godot_binary>``, .NET modülü etkinken derlediğiniz düzenleyici ikili dosyasını ifade eder. Tam adı sisteminize ve yapılandırmanıza göre değişecektir, ancak ``bin/godot.<platform>.editor.<arch>.mono`` şeklinde olmalıdır, örneğin ``bin/godot.linuxbsd.editor.x86_64.mono`` veya ``bin/godot.windows.editor.x86_32.mono.exe``. Özellikle **.mono** son ekine dikkat edin! Godot'yu daha önce .NET desteği olmadan derlediyseniz, bu son ek olmadan benzer şekilde adlandırılmış ikili dosyalarınız olabilir. Bu ikili dosyalar .NET yapıştırıcısını oluşturmak için kullanılamaz.

source: The glue sources must be regenerated every time the ClassDB-registered API changes. That is, for example, when a new method is registered to the scripting API or one of the parameters of such a method changes. Godot will print an error at startup if there is an API mismatch between ClassDB and the glue sources.
es: Las fuentes de glue deben regenerarse cada vez que cambie la API registrada en ClassDB. Es decir, por ejemplo, cuando se registra un nuevo método en la API de scripting o cuando uno de los parámetros de dicho método cambia. Godot mostrará un error al iniciarse si hay una discrepancia de API entre ClassDB y las fuentes de glue.
ta: ஒவ்வொரு முறையும் ClassDB- பதிவு செய்யப்பட்ட பநிஇ மாறும்போது பசை ஆதாரங்கள் மீண்டும் உருவாக்கப்பட வேண்டும். அதாவது, எடுத்துக்காட்டாக, ச்கிரிப்டிங் ஏபிஐக்கு ஒரு புதிய முறை பதிவு செய்யப்படும்போது அல்லது அத்தகைய முறையின் அளவுருக்களில் ஒன்று மாறுகிறது. ClassDB மற்றும் பசை மூலங்களுக்கு இடையில் பநிஇ பொருந்தாத தன்மை இருந்தால் கோடோட் தொடக்கத்தில் ஒரு பிழையை அச்சிடுவார்.
tr: ClassDB'ye kayıtlı API her değiştiğinde yapıştırıcı kaynakları yeniden oluşturulmalıdır. Örneğin, betik API'sine yeni bir yöntem kaydedildiğinde veya böyle bir yöntemin parametrelerinden biri değiştiğinde. ClassDB ve yapıştırıcı kaynakları arasında bir API uyuşmazlığı varsa Godot başlangıçta bir hata yazdıracaktır.

source: Building the managed libraries
ta: நிர்வகிக்கப்பட்ட நூலகங்களை உருவாக்குதல்
tr: Yönetilen kütüphaneleri oluşturma

source: Once you have generated the .NET glue, you can build the managed libraries with the ``build_assemblies.py`` script::
es: Una vez generado el enlace .NET, puede compilar las bibliotecas administradas con el script ``build_assemblies.py``:
ta: நீங்கள் .NET பசை உருவாக்கியதும், நிர்வகிக்கப்பட்ட நூலகங்களை `` bilt_assemblies.py`` ச்கிரிப்ட் ::

source: If everything went well, the ``GodotSharp`` directory, containing the managed libraries, should have been created in the ``bin`` directory.
es: Si todo salió bien, la carpeta ``GodotSharp`` conteniendo las librerías, debería estar en el directorio ``bin``.
ta: எல்லாம் சரியாக நடந்திருந்தால், நிர்வகிக்கப்பட்ட நூலகங்களைக் கொண்ட `` கோடோட்சார்ப்`` கோப்பகம் `` பின்`` கோப்பகத்தில் உருவாக்கப்பட்டிருக்க வேண்டும்.
tr: Her şey yolunda gittiyse, yönetilen kütüphaneleri içeren ``GodotSharp`` dizini ``bin`` klasörü altında oluşturulmuş olmalıdır.

source: By default, all development builds share a version number, which can cause some issues with caching of the NuGet packages. To solve this issue either use ``GODOT_VERSION_STATUS`` to give every build a unique version or delete ``GodotNuGetFallbackFolder`` after every build to clear the package cache.
es: Por defecto, todas las compilaciones de desarrollo comparten un número de versión, lo que puede causar algunos problemas con el almacenamiento en caché de los paquetes NuGet. Para resolver este problema, use ``GODOT_VERSION_STATUS`` para darle a cada compilación una versión única o elimine ``GodotNuGetFallbackFolder`` después de cada compilación para borrar la memoria caché de paquetes.
ta: இயல்பாக, அனைத்து மேம்பாட்டு கட்டமைப்புகளும் ஒரு பதிப்பு எண்ணைப் பகிர்ந்து கொள்கின்றன, இது நுசெட் தொகுப்புகளை தேக்கப்படுத்துவதில் சில சிக்கல்களை ஏற்படுத்தும். இந்த சிக்கலைத் தீர்க்க, ஒவ்வொரு கட்டமைப்பையும் ஒரு தனித்துவமான பதிப்பைக் கொடுக்க `` கோடோட்_்வெர்சன்_ச்டேட்டச்`` ஐப் பயன்படுத்தவும் அல்லது தொகுப்பு தற்காலிக சேமிப்பை அழிக்க ஒவ்வொரு கட்டமைப்பிற்கும் பிறகு `` கோடோட்நுகெட்ஃபால் பேக்ஃபோல்டர்` ஐ நீக்கவும்.
tr: Varsayılan olarak, tüm geliştirme yapıları bir sürüm numarasını paylaşır, bu da NuGet paketlerinin önbelleğe alınmasıyla ilgili bazı sorunlara neden olabilir. Bu sorunu çözmek için ya her derlemeye benzersiz bir sürüm ismi vermek için ``GODOT_VERSION_STATUS`` kullanın ya da paket önbelleğini temizlemek için her derlemeden sonra ``GodotNuGetFallbackFolder`` klasörünü silin.

source: Unlike "classical" Godot builds, when building with the .NET module enabled (and depending on the target platform), a data directory may be created both for the editor and for exported projects. This directory is important for proper functioning and must be distributed together with Godot. More details about this directory in :ref:`Data directory<compiling_with_dotnet_data_directory>`.
ta: "பாரம்பரிய" கோடோட் கட்டமைப்பதைப் போலல்லாமல், .NET தொகுதி இயக்கப்பட்ட (மற்றும் இலக்கு தளத்தைப் பொறுத்து) உருவாக்கும்போது, ஒரு தரவு அடைவு எடிட்டருக்கும் ஏற்றுமதி செய்யப்பட்ட திட்டங்களுக்கும் உருவாக்கப்படலாம். இந்த அடைவு சரியான செயல்பாட்டிற்கு முக்கியமானது மற்றும் கோடோட்டுடன் ஒன்றாக விநியோகிக்கப்பட வேண்டும். இந்த கோப்பகத்தைப் பற்றிய கூடுதல் விவரங்கள்: ref: `தரவு அடைவு <தொகுத்தல்_வித்_டோட்நெட்_டேட்டா_டிரெக்டரி>`.
tr: "Klasik" Godot derlemelerinden farklı olarak, .NET modülü etkinleştirildiğinde (ve hedef platforma bağlı olarak), hem düzenleyici hem de dışa aktarılan projeler için bir veri dizini oluşturulabilir. Bu dizin düzgün çalışma için önemlidir ve Godot ile birlikte dağıtılmalıdır. Bu dizin hakkında daha fazla bilgi için aşağıdaki :ref:`Veri dizini <compiling_with_dotnet_data_directory>` kısmına bakınız.

source: Build Platform
ta: தளத்தை உருவாக்குங்கள்
tr: Platform Derlemesi

source: Provide the ``--godot-platform=<platform>`` argument to control for which platform specific the libraries are built. Omit this argument to build for the current system.
es: Proporcione el argumento ``--godot-platform=<platform>`` para controlar para qué plataforma específica se crearán las bibliotecas. Omita este argumento para crear las bibliotecas para el sistema actual.
ta: எந்த தளத்திற்கு குறிப்பிட்ட நூலகங்கள் கட்டப்பட்டுள்ளன என்பதைக் கட்டுப்படுத்த `` --godot-blatform = <இயங்குதள> `` வாதத்தை வழங்கவும். தற்போதைய அமைப்பை உருவாக்க இந்த வாதத்தை தவிர்க்கவும்.
tr: Kütüphanelerin hangi platforma özgü olarak oluşturulacağını kontrol etmek için ``--godot-platform=<platform>`` argümanını kullanın. Mevcut sistem için derlemek için bu argümanı atlayın.

source: This currently only controls the inclusion of the support for Visual Studio as an external editor, the libraries are otherwise identical.
es: Actualmente, esto solo controla la inclusión del soporte para Visual Studio como editor externo, las bibliotecas son idénticas por lo demás.
ta: இது தற்போது விசுவல் ச்டுடியோவுக்கான ஆதரவை வெளிப்புற எடிட்டராக சேர்ப்பதை மட்டுமே கட்டுப்படுத்துகிறது, நூலகங்கள் இல்லையெனில் ஒரே மாதிரியாக இருக்கின்றன.
tr: Bu şu anda yalnızca Visual Studio desteğinin harici bir düzenleyici olarak dahil edilmesini kontrol etmektedir, aksi takdirde kütüphaneler aynıdır.

source: NuGet packages
es: Uso de los paquetes NuGet
ta: நுசெட் தொகுப்புகள்
tr: NuGet paketleri

source: The API assemblies, source generators, and custom MSBuild project SDK are distributed as NuGet packages. This is all transparent to the user, but it can make things complicated during development.
es: Los conjuntos de API, los generadores de código fuente y el SDK de proyectos MSBuild personalizados se distribuyen como paquetes NuGet. Todo esto es transparente para el usuario, pero puede complicar las cosas durante el desarrollo.
ta: பநிஇ கூட்டங்கள், மூல செனரேட்டர்கள் மற்றும் தனிப்பயன் MSBUILD திட்ட SDK ஆகியவை நுசெட் தொகுப்புகளாக விநியோகிக்கப்படுகின்றன. இது எல்லாமே பயனருக்கு வெளிப்படையானது, ஆனால் இது வளர்ச்சியின் போது விசயங்களை சிக்கலாக்கும்.
tr: API derlemeleri, kaynak oluşturucular ve özel MSBuild proje SDK'sı NuGet paketleri olarak dağıtılır. Bunların hepsi kullanıcı için şeffaftır, ancak geliştirme sırasında işleri karmaşık hale getirebilir.

source: In order to use Godot with a development version of those packages, a local NuGet source must be created where MSBuild can find them.
es: Para utilizar Godot con una versión de desarrollo de esos paquetes, se debe crear una fuente NuGet local donde MSBuild pueda encontrarlos.
ta: அந்த தொகுப்புகளின் மேம்பாட்டு பதிப்பைக் கொண்டு கோடோட்டைப் பயன்படுத்த, ஒரு உள்ளக நுசெட் மூலத்தை உருவாக்க வேண்டும், அங்கு MSBuild அவற்றைக் கண்டுபிடிக்க முடியும்.
tr: Godot'yu bu paketlerin geliştirme sürümüyle kullanmak için, MSBuild'in bunları bulabileceği yerel bir NuGet kaynağı oluşturulmalıdır.

source: First, pick a location for the local NuGet source. If you don't have a preference, create an empty directory at one of these recommended locations:
es: En primer lugar, elija una ubicación para la fuente NuGet local. Si no tiene ninguna preferencia, cree un directorio vacío en una de estas ubicaciones recomendadas:
ta: முதலில், உள்ளக நுசெட் மூலத்திற்கான இடத்தைத் தேர்ந்தெடுக்கவும். உங்களுக்கு விருப்பம் இல்லையென்றால், இந்த பரிந்துரைக்கப்பட்ட இடங்களில் ஒன்றில் வெற்று கோப்பகத்தை உருவாக்கவும்:
tr: İlk olarak, yerel NuGet kaynağı için bir konum seçin. Bir tercihiniz yoksa, bu önerilen konumlardan birinde boş bir dizin oluşturun:

source: On Windows, ``C:\Users\<username>\MyLocalNugetSource``
es: En Windows, ``C:\Users\<nombre de usuario>\MyLocalNugetSource``
ta: சாளரங்களில், `` சி: \ பயனர்கள் \ <பயனர்பெயர்> \ mylocalnugetsource``
tr: Windows üzerinde, ``C:\Users\<kullanıcı adı>\MyLocalNugetSource``

source: On Linux, \*BSD, etc., ``~/MyLocalNugetSource``
es: En Linux, \*BSD, etc., ``~/MyLocalNugetSource``
ta: லினக்ச், \ * பி.எச்.டி, முதலியன, `` `~ / mylocalnugts '
tr: Linux, \*BSD, vb. üzerinde, ``~/MyLocalNugetSource``

source: This path is referred to later as ``<my_local_source>``.
es: Esta ruta se referenciará más adelante ``<my_local_source>``.
ta: இந்த பாதை பின்னர் `` <my_local_source> `` என குறிப்பிடப்படுகிறது.
tr: Bu yola aşağıda ``<my_local_source>`` olarak başvurulacaktır.

source: After picking a directory, run this .NET CLI command to configure NuGet to use your local source:
es: Después de seleccionar un directorio, ejecute este comando CLI de .NET para configurar NuGet para que use su fuente local:
ta: ஒரு கோப்பகத்தைத் தேர்ந்தெடுத்த பிறகு, உங்கள் உள்ளக மூலத்தைப் பயன்படுத்த நுசெட்டை உள்ளமைக்க இந்த .நெட் கிளி கட்டளையை இயக்கவும்:
tr: Bir dizin seçtikten sonra, NuGet'i yerel kaynağınızı kullanacak şekilde yapılandırmak için bu .NET CLI komutunu çalıştırın:

source: When you run the ``build_assemblies.py`` script, pass ``<my_local_source>`` to the ``--push-nupkgs-local`` option:
es: Cuando ejecute el script ``build_assemblies.py``, pase ``<my_local_source>`` a la opción ``--push-nupkgs-local``:
ta: நீங்கள் `` Build_assemblies.py`` ச்கிரிப்டை இயக்கும்போது, `` `` `--பச்-நப்-லோகல்`` விருப்பத்திற்கு` `<my_local_source>` `கடந்து செல்லுங்கள்:
tr: ``build_assemblies.py`` betiğini çalıştırdığınızda, ``--push-nupkgs-local`` seçeneğine ``<my_local_source>`` adresini aktarın:

source: This option ensures the packages will be added to the specified local NuGet source and that conflicting versions of the package are removed from the NuGet cache. It's recommended to always use this option when building the C# solutions during development to avoid mistakes.
es: Esta opción garantiza que los paquetes se agregarán a la fuente NuGet local especificada y que las versiones conflictivas del paquete se eliminarán de su memoria caché. Se recomienda utilizar siempre esta opción al crear soluciones C# durante el desarrollo para evitar errores.
ta: இந்த விருப்பம் குறிப்பிட்ட உள்ளக நுசெட் மூலத்தில் தொகுப்புகள் சேர்க்கப்படுவதை உறுதிசெய்கிறது மற்றும் தொகுப்பின் முரண்பட்ட பதிப்புகள் நுசெட் தற்காலிக சேமிப்பிலிருந்து அகற்றப்படுகின்றன. தவறுகளைத் தவிர்ப்பதற்காக வளர்ச்சியின் போது சி# தீர்வுகளை உருவாக்கும்போது இந்த விருப்பத்தை எப்போதும் பயன்படுத்த பரிந்துரைக்கப்படுகிறது.
tr: Bu seçenek, paketlerin belirtilen yerel NuGet kaynağına eklenmesini ve paketin çakışan sürümlerinin NuGet önbelleğinden kaldırılmasını sağlar. Hatalardan kaçınmak için geliştirme sırasında C# çözümlerini oluştururken her zaman bu seçeneğin kullanılması önerilir.

source: Building without depending on deprecated features (NO_DEPRECATED)
ta: நீக்கப்பட்ட அம்சங்களைப் பொறுத்து கட்டியெழுப்புதல் (NO_DEPRECATED)

source: When building Godot without deprecated classes and functions, i.e. the ``deprecated=no`` argument for scons, the managed libraries must also be built without dependencies to deprecated code. This is done by passing the ``--no-deprecated`` argument:
ta: நீக்கப்பட்ட வகுப்புகள் மற்றும் செயல்பாடுகள் இல்லாமல் கோடோட்டைக் கட்டும் போது, அதாவது ச்கோன்களுக்கான `` நீக்கப்பட்ட = இல்லை`` உரையாடல், நிர்வகிக்கப்பட்ட நூலகங்களும் நீக்கப்பட்ட குறியீட்டிற்கு சார்பு இல்லாமல் கட்டப்பட வேண்டும். ``-no- deprecated`` வாதத்தை கடந்து இது செய்யப்படுகிறது:

source: Double Precision Support (REAL_T_IS_DOUBLE)
es: Soporte para Doble Precisión (REAL_T_IS_DOUBLE)
ta: இரட்டை துல்லிய உதவி (real_t_is_double)
tr: Çift Hassasiyet (Double precision) Desteği (REAL_T_IS_DOUBLE)

source: When building Godot with double precision support, i.e. the ``precision=double`` argument for scons, the managed libraries must be adjusted to match by passing the ``--precision=double`` argument:
es: Al construir Godot con soporte para doble precisión, es decir, el argumento ``precision=double`` para SCons, las bibliotecas administradas deben ajustarse para que coincidan pasando el argumento ``--precision=double``:
ta: இரட்டை துல்லிய ஆதரவுடன் கோடோட்டை உருவாக்கும்போது, அதாவது ச்கோன்களுக்கான `` துல்லியமான = இரட்டை`` உரையாடல், நிர்வகிக்கப்பட்ட நூலகங்கள் ``-நடைமுறை = இரட்டை`` வாதத்தை அனுப்புவதன் மூலம் பொருத்தமாக சரிசெய்யப்பட வேண்டும்:
tr: Godot'yu çift hassasiyet desteğiyle, yani scons için ``precision=double`` argümanıyla oluştururken, yönetilen kütüphaneler ``--precision=double`` argümanını geçerek eşleşecek şekilde ayarlanmalıdır:

source: Examples
es: Ejemplos
ta: எடுத்துக்காட்டுகள்
tr: Örnekler

source: Example (Windows)
es: Ejemplo (Windows)
ta: எடுத்துக்காட்டு (விண்டோச்)
tr: Örnek (Windows)

source: Example (Linux, \*BSD)
es: Ejemplo (Linux, \*BSD)
ta: எடுத்துக்காட்டு (லினக்ச், \*பி.எச்.டி)
tr: Örnek (Linux, \*BSD)

source: Data directory
es: Directorio de Datos
ta: தரவு அடைவு
tr: Veri dizini

source: The data directory is a dependency for Godot binaries built with the .NET module enabled. It contains important files for the correct functioning of Godot. It must be distributed together with the Godot executable.
ta: தரவு அடைவு என்பது .NET தொகுதியுடன் கட்டப்பட்ட கோடோட் பைனரிகளுக்கான சார்பு. கோடோட்டின் சரியான செயல்பாட்டிற்கான முக்கியமான கோப்புகள் இதில் உள்ளன. இது கோடோட் இயங்கக்கூடியவருடன் சேர்ந்து விநியோகிக்கப்பட வேண்டும்.
tr: Veri dizini, .NET modülü etkinleştirilmiş Godot ikilileri için bir bağımlılıktır. Godot'nun doğru çalışması için önemli dosyalar içerir. Godot çalıştırılabilir dosyasıyla birlikte dağıtılmalıdır.

source: Editor
ta: திருத்தி
tr: Düzenleyici

source: The name of the data directory for the Godot editor will always be ``GodotSharp``. This directory contains an ``Api`` subdirectory with the Godot API assemblies and a ``Tools`` subdirectory with the tools required by the editor, like the ``GodotTools`` assemblies and its dependencies.
es: El nombre del directorio de datos del editor Godot siempre será ``GodotSharp``. Este directorio contiene un subdirectorio ``Api`` con los ensambles de la API de Godot y un subdirectorio ``Tools`` con las herramientas que requiere el editor, como los ensambles ``GodotTools`` y sus dependencias.
ta: கோடோட் எடிட்டருக்கான தரவு கோப்பகத்தின் பெயர் எப்போதும் `` கோடோட்சார்ப்`` ஆக இருக்கும். இந்த கோப்பகத்தில் கோடோட் பநிஇ கூட்டங்களுடன் ஒரு `` ஏபிஐ`` துணை அடைவு மற்றும் `` கோடோடூல்ச்` கூட்டங்கள் மற்றும் அதன் சார்புநிலைகள் போன்ற எடிட்டருக்குத் தேவையான கருவிகளுடன் `` கருவிகள்` துணை அடைவு உள்ளது.
tr: Godot düzenleyici için veri dizininin adı her zaman ``GodotSharp`` olacaktır. Bu dizin, Godot API derlemelerini içeren bir ``Api`` alt dizini ve ``GodotTools`` derlemeleri ve bağımlılıkları gibi düzenleyicinin ihtiyaç duyduğu araçları içeren bir ``Tools`` alt dizini içerir.

source: On macOS, if the Godot editor is distributed as a bundle, the ``GodotSharp`` directory may be placed in the ``<bundle_name>.app/Contents/Resources/`` directory inside the bundle.
es: En macOS, si el editor Godot se distribuye como un paquete, el directorio ``GodotSharp`` puede ubicarse en el directorio ``<bundle_name>.app/Contents/Resources/`` dentro del paquete.
ta: மேகோசில், கோடோட் எடிட்டர் ஒரு மூட்டையாக விநியோகிக்கப்பட்டால், `` கோடோட்சார்ப்`` அடைவு `` <மூட்டை_பெயர்> இல் வைக்கப்படலாம் .ஆப்/உள்ளடக்கங்கள்/வளங்கள்/`` மூட்டைக்குள் அடைவு.
tr: MacOS'ta, Godot düzenleyici bir paket olarak dağıtılmışsa, ``GodotSharp`` dizini paketin içindeki ``<paket_ismi>.app/Contents/Resources/`` dizinine yerleştirilebilir.

source: Export templates
es: Plantillas de exportación
ta: ஏற்றுமதி வார்ப்புருக்கள்
tr: Dışa aktarım şablonları

source: The data directory for exported projects is generated by the editor during the export. It is named ``data_<APPNAME>_<ARCH>``, where ``<APPNAME>`` is the application name as specified in the project setting ``application/config/name`` and ``<ARCH>`` is the current architecture of the export.
ta: ஏற்றுமதி செய்யப்பட்ட திட்டங்களுக்கான தரவு அடைவு ஏற்றுமதியின் போது ஆசிரியரால் உருவாக்கப்படுகிறது. இதற்கு `` தரவு_ <appname> _ <arch> `` என்று பெயரிடப்பட்டுள்ளது, அங்கு `` <ppname> `` என்பது திட்ட அமைப்பில் குறிப்பிடப்பட்டுள்ள பயன்பாட்டு பெயர் `` பயன்பாடு/கட்டமைப்பு/பெயர்`` மற்றும் `` <arch> ` `என்பது ஏற்றுமதியின் தற்போதைய கட்டமைப்பு.
tr: Dışa aktarılan projeler için veri dizini, dışa aktarma sırasında düzenleyici tarafından oluşturulur. Bu dizin ``data_<APPNAME>_<ARCH>`` olarak adlandırılır; burada ``<APPNAME>``, ``application/config/name`` proje ayarında belirtilen uygulama adıdır ve ``<ARCH>`` ise dışa aktarımın geçerli mimarisidir.
