Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/index.po
Languages: ga, tr, uk

source: Building from source
ga: Tógáil ó fhoinse
tr: Kaynaktan derleme
uk: Побудова від джерела

source: Godot prides itself on being very easy to build, by C++ projects' standards. :ref:`Godot uses the SCons build system <doc_faq_why_scons>`, and after the initial setup compiling the engine for your current platform should be as easy as running::
ga: Tá Godot mórtasach as a bheith an-éasca le tógáil, de réir chaighdeáin tionscadal C++. :ref:`Úsáideann Godot an córas tógála SCons <doc_faq_why_scons>`, agus tar éis an tsocraithe tosaigh ba chóir go mbeadh tiomsú an innill do d'ardán reatha chomh héasca le rith::
tr: Godot, C++ projelerinin standartlarına göre derlenmesinin çok kolay olmasıyla övünür. :ref:`Godot, SCons derleme sistemini kullanır <doc_faq_why_scons>` ve ilk kurulumdan sonra motoru mevcut platformunuz için derlemek şu komut kadar kolay olacaktır::
uk: Godot пишається тим, що його дуже легко створити за стандартами проектів C++. :ref:`Godot uses the SCons build system <doc_faq_why_scons>`, і після початкового налаштування компіляція двигуна для вашої поточної платформи має бути такою ж простою, як запуск::

source: But you will probably need to use at least some of the available options to configure the build to match your specific needs, be it a custom engine fork, a lightweight build stripped of extra modules, or an executable targeting engine development.
ga: Ach is dócha go mbeidh ort cuid de na roghanna atá ar fáil ar a laghad a úsáid chun an tógáil a chumrú chun do riachtanais shonracha a mheaitseáil, bíodh sé ina forc inneall saincheaptha, tógáil éadrom a dhraingítear de mhodúil bhreise, nó forbairt inneall dírithe infheidhmithe.
tr: Ancak, derlemeyi özel ihtiyaçlarınıza göre yapılandırmak için muhtemelen mevcut seçeneklerden en azından bazılarını kullanmanız gerekecektir; özel bir motor çatalı, ekstra modüllerden arındırılmış hafif bir derleme veya motor geliştirmeyi hedefleyen bir çalıştırılabilir dosya.
uk: Але вам, ймовірно, знадобиться використати принаймні деякі з доступних опцій, щоб налаштувати збірку відповідно до ваших конкретних потреб, будь то спеціальна розгалуження двигуна, легка збірка, позбавлена додаткових модулів, або розробка виконуваного цільового двигуна.

source: The articles below should help you navigate configuration options available, as well as prerequisites required to compile Godot exactly the way you need.
ga: Ba cheart go gcabhródh na hailt thíos leat na roghanna cumraíochta atá ar fáil a nascleanúint, chomh maith leis na réamhriachtanais a theastaíonn chun Godot a thiomsú go díreach mar a theastaíonn uait.
tr: Aşağıdaki makaleler, Godot'yu tam olarak ihtiyaç duyduğunuz şekilde derlemek için gereken ön koşulların yanı sıra mevcut yapılandırma seçeneklerinde gezinmenize yardımcı olacaktır.
uk: Наведені нижче статті повинні допомогти вам орієнтуватися в доступних параметрах конфігурації, а також у попередніх вимогах, необхідних для компіляції Godot саме так, як вам потрібно.

source: Basics of building Godot
ga: Buneilimintí a thógáil Godot
tr: **Godot'yu derleme temelleri**
uk: Основи побудови Godot

source: Let's start with basics, and learn how to get Godot's source code, and then which options to use to compile it regardless of your target platform.
ga: Tosaímid le buneilimintí, agus foghlaimímid conas cód foinse Godot a fháil, agus ansin na roghanna atá le húsáid chun é a thiomsú beag beann ar do sprioc-ardán.
tr: Temel bilgilerle başlayalım ve Godot'nun kaynak kodunu nasıl elde edeceğimizi ve ardından hedef platformunuz ne olursa olsun derlemek için hangi seçenekleri kullanacağımızı öğrenelim.
uk: Давайте почнемо з основ і дізнаємося, як отримати вихідний код Godot, а потім, які параметри використовувати для його компіляції незалежно від вашої цільової платформи.

source: Building for target platforms
ga: Tógáil do sprioc-ardáin
uk: Збірка для цільових платформ

source: Below you can find instructions for compiling the engine for your specific target platform. Note that Godot supports cross-compilation, which means you can compile it for a target platform that doesn't match your current platform (say, target Linux while being on Windows). The guides will try their best to cover all possible situations.
ga: Anseo thíos is féidir leat treoracha a fháil chun an t-inneall a thiomsú do d'ardán sprioc-shonrach. Tabhair faoi deara go dtacaíonn Godot le tras-thiomsú, rud a chiallaíonn gur féidir leat é a thiomsú le haghaidh sprioc-ardán nach n-oireann le d'ardán reatha (abair, díriú ar Linux agus tú ar Windows). Déanfaidh na treoracha iarracht a ndícheall gach cás féideartha a chlúdach.
tr: Aşağıda, motoru kendi hedef platformunuz için derlemeye yönelik talimatları bulabilirsiniz. Godot'un çapraz derlemeyi desteklediğini unutmayın, bu da mevcut platformunuzla eşleşmeyen bir hedef platform için derleyebileceğiniz anlamına gelir (örneğin, Windows'ta iken Linux'u hedefleyin). Kılavuzlar olası tüm durumları kapsamak için ellerinden gelenin en iyisini yapmaya çalışacaktır.
uk: Нижче ви можете знайти інструкції щодо компіляції двигуна для вашої конкретної цільової платформи. Зауважте, що Godot підтримує крос-компіляцію, а це означає, що ви можете скомпілювати його для цільової платформи, яка не відповідає вашій поточній платформі (скажімо, орієнтуйтеся на Linux під час роботи з Windows). Гіди намагатимуться максимально охопити всі можливі ситуації.

source: Other compilation targets and options
ga: Spriocanna agus roghanna tiomsaithe eile
tr: **Diğer derleme hedefleri ve seçenekleri**
uk: Інші цілі та параметри компіляції

source: Some additional universal compilation options require further setup. Namely, while Godot does have C#/.NET support as a part of its main codebase, it does not get compiled by default to reduce the executable size for users who don't need C# for their projects.
ga: Teastaíonn tuilleadh socrú ó roinnt roghanna tiomsaithe Eadhon, cé go bhfuil tacaíocht C#/.NET ag Godot mar chuid dá phríomhchód-bhunachar, ní thiomsaítear é de réir réamhshocraithe chun an méid infheidhmithe a laghdú d'úsáideoirí nach dteastaíonn C # uathu dá dtionscadail.
tr: Bazı ek evrensel derleme seçenekleri daha fazla ayarlama gerektirir. Yani, Godot ana kod tabanının bir parçası olarak C#/.NET desteğine sahip olsa da, projeleri için C#'a ihtiyaç duymayan kullanıcılar için çalıştırılabilir dosya boyutunu azaltmak amacıyla varsayılan olarak derlenmez.
uk: Деякі додаткові універсальні параметри компіляції потребують додаткового налаштування. Зокрема, хоча Godot має підтримку C#/.NET як частину своєї основної кодової бази, він не компілюється за замовчуванням, щоб зменшити розмір виконуваного файлу для користувачів, яким не потрібен C# для їхніх проектів.

source: Articles below explain how to configure the buildsystem for cases like this, and also cover some optimization techniques.
ga: Míníonn ailt thíos conas an córas tógála a chumrú do chásanna mar seo, agus clúdaíonn sé roinnt teicnící optamaithe freisin.
tr: Aşağıdaki makaleler, bu gibi durumlar için derleme sisteminin nasıl yapılandırılacağını açıklar ve ayrıca bazı optimizasyon tekniklerini ele alır.
uk: У статтях нижче пояснюється, як налаштувати систему збірки для таких випадків, а також розглядаються деякі методи оптимізації.
