Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/introduction_to_the_buildsystem.po
Languages: ga, ta, tr, uk, zh_cn

source: To create those yourself, follow the instructions detailed for each platform in this same tutorial section. Each platform explains how to create its own template.
ga: Chun iad siúd a chruthú tú féin, lean na treoracha mionsonraithe do gach ardán sa chuid teagaisc céanna seo. Míníonn gach ardán conas a theimpléad féin a chruthú.
ta: அவற்றை நீங்களே உருவாக்க, இதே டுடோரியல் பிரிவில் ஒவ்வொரு தளத்திற்கும் விவரிக்கப்பட்ட வழிமுறைகளைப் பின்பற்றவும். ஒவ்வொரு தளமும் அதன் சொந்த வார்ப்புருவை எவ்வாறு உருவாக்குவது என்பதை விளக்குகிறது.
tr: Bunları kendiniz oluşturmak için, bu eğitim bölümündeki her platform için ayrıntılı talimatları izleyin. Her platform kendi şablonunun nasıl oluşturulacağını açıklamaktadır.
uk: Щоб створити їх самостійно, дотримуйтесь інструкцій, докладних для кожної платформи в тому самому розділі підручника. Кожна платформа пояснює, як створити власний шаблон.
zh_cn: 要自己创建它们, 请按照该教程中针对每个平台的详细说明的部分进行操作. 每个平台都说明了如何创建自己的模板.

source: The ``version.txt`` file should contain the corresponding Godot version identifier. This file is used to install export templates in a version-specific directory to avoid conflicts. For instance, if you are building export templates for Godot 3.1.1, ``version.txt`` should contain ``3.1.1.stable`` on the first line (and nothing else). This version identifier is based on the ``major``, ``minor``, ``patch`` (if present) and ``status`` lines of the `version.py file in the Godot Git repository <https://github.com/godotengine/godot/blob/master/version.py>`__.
ga: Ba cheart go mbeadh an t-aitheantóir leagan Godot comhfhreagrach sa chomhad ``version.txt``. Úsáidtear an comhad seo chun teimpléid easpórtála a shuiteáil in eolaire a bhaineann go sonrach le leagan chun coinbhleachtaí a sheachaint. Mar shampla, má tá teimpléid easpórtála á dtógáil agat do Godot 3.1.1, ba cheart go mbeadh ``3.1.1.stable`` ar an gcéad líne (agus gan aon rud eile) i ``version.txt``. Tá aitheantóir an leagain seo bunaithe ar na línte ``major``, ``mion``, `` paiste`` (más ann dóibh) agus `` stádas`` den chomhad `version.py i stór Godot Git <https: //github.com/godotengine/godot/blob/master/version.py>`__.
ta: `` பதிப்பு. Txt`` கோப்பில் தொடர்புடைய கோடோட் பதிப்பு அடையாளங்காட்டியைக் கொண்டிருக்க வேண்டும். மோதல்களைத் தவிர்க்க பதிப்பு-குறிப்பிட்ட கோப்பகத்தில் ஏற்றுமதி வார்ப்புருக்களை நிறுவ இந்த கோப்பு பயன்படுத்தப்படுகிறது. உதாரணமாக, நீங்கள் கோடோட் 3.1.1 க்கான ஏற்றுமதி வார்ப்புருக்களை உருவாக்குகிறீர்கள் என்றால், `` பதிப்பு. இந்த பதிப்பு அடையாளங்காட்டி `` மேசர்`, `` சிறிய``, `பேட்ச்`` (இருந்தால்) மற்றும் கோடோட் அறிவிலி களஞ்சியத்தில் உள்ள` `நிலை`` வரிகளின் கோடுகள் <https: //github.com/godotengine/godot/blob/master/version.py>`__.
tr: ``versiyon.txt`` dosyası ilgili Godot sürüm tanımlayıcısını içermelidir. Bu dosya, çakışmaları önlemek amacıyla dışa aktarma şablonlarını sürüme-özgü bir dizine yüklemek için kullanılır. Örneğin, Godot 3.1.1 için dışa aktarma şablonları oluşturuyorsanız, ``version.txt`` ilk satırda ``3.1.1.stable`` içermelidir (ve başka hiçbir şey değil). Bu sürüm tanımlayıcısı, `Godot Git deposundaki version.py <https://github.com/godotengine/godot/blob/master/version.py>`__ dosyasının ``major``, ``minor``, ``patch`` (varsa) ve ``status`` satırlarını temel alır.
uk: Файл ``version.txt`` має містити відповідний ідентифікатор версії Godot. Цей файл використовується для встановлення шаблонів експорту в каталог певної версії, щоб уникнути конфліктів. Наприклад, якщо ви створюєте шаблони експорту для Godot 3.1.1, ``version.txt`` має містити ``3.1.1.stable`` у першому рядку (і нічого більше). Цей ідентифікатор версії базується на рядках ``major``, ``minor``, ``patch`` (якщо є) і ``status`` файлу `version.py у сховищі Godot Git <https: //github.com/godotengine/godot/blob/master/version.py>`__.
zh_cn: ``version.txt`` 文件应包含相应的 Godot 版本标识符。该文件用于在特定于版本的目录中安装导出模板，以避免冲突。例如，如果你要为 Godot 3.1.1 构建导出模板，则 ``version.txt`` 文件的第一行应包含 ``3.1.1.stable``\ （没有其他内容）。该版本标识符\ `在 Godot Git 仓库库中的 version.py 文件 <https://github.com/godotengine/godot/blob/master/version.py>`__\ 的 ``major``\ 、\ ``minor``\ 、\ ``patch``\ （如果存在）和 ``status`` 行。

source: If you are developing for multiple platforms, macOS is definitely the most convenient host platform for cross-compilation, since you can cross-compile for every target. Linux and Windows come in second place, but Linux has the advantage of being the easier platform to set this up.
ga: Má tá tú ag forbairt d'ardáin iolracha, is cinnte gurb é macOS an t-ardán óstach is áisiúla le haghaidh tras-thiomsú, ós rud é gur féidir leat tras-thiomsú do gach sprioc. Tagann Linux agus Windows sa dara háit, ach tá an buntáiste ag Linux gurb é an t-ardán níos éasca é seo a chur ar bun.
ta: நீங்கள் பல தளங்களுக்காக வளர்த்துக் கொண்டிருக்கிறீர்கள் என்றால், ஒவ்வொரு இலக்குக்கும் நீங்கள் குறுக்கு கூட்டணிக்க முடியும் என்பதால், குறுக்கு ஏற்றத்தாழ்வுக்கான MACOS நிச்சயமாக மிகவும் வசதியான புரவலன் தளமாகும். லினக்ச் மற்றும் சாளரங்கள் இரண்டாவது இடத்தில் வருகின்றன, ஆனால் இதை அமைக்க எளிதான தளமாக இருப்பதன் நன்மையை லினக்ச் கொண்டுள்ளது.
tr: Birden fazla platform için geliştirme yapıyorsanız, macOS kesinlikle çapraz derleme için en uygun ana platformdur, çünkü her hedef için çapraz derleme yapabilirsiniz (macOS ve iOS derlemeleri başka platformda yapılamıyor). Linux ve Windows ikinci sırada gelir, ancak Linux bunu kurmak için daha kolay bir platform olma avantajına sahiptir.
uk: Якщо ви розробляєте для кількох платформ, macOS, безперечно, є найзручнішою хост-платформою для крос-компіляції, оскільки ви можете крос-компілювати для кожної цілі. Linux і Windows займають друге місце, але Linux має перевагу в тому, що є простішою платформою для налаштування.

source: Godot is a primarily C++ project and it :ref:`uses the SCons build system. <doc_faq_why_scons>` We love SCons for how maintainable and easy to set up it makes our buildsystem. And thanks to that compiling Godot from source can be as simple as running::
ga: Is tionscadal C++ go príomha é Godot agus úsáideann sé an córas tógála SCons. <doc_faq_why_scons>` Is breá linn SCons mar gheall ar chomh inchothaithe agus éasca le socrú a dhéanann ár gcóras tógála. Agus is féidir a bhuíochas leis sin Godot a thiomsú ón bhfoinse a bheith chomh simplí le rith::
ta: கோடோட் முதன்மையாக சி ++ திட்டம் மற்றும் ஐடி: குறிப்பு: `ச்கான்கள் உருவாக்கும் முறையைப் பயன்படுத்துகிறது. <doc_faq_why_scons> `அதை எவ்வாறு பராமரிக்கக்கூடியது மற்றும் அமைக்க எளிதானது என்பதை நாங்கள் விரும்புகிறோம். மூலத்திலிருந்து கோடோட்டை தொகுத்ததற்கு நன்றி ஓடுவது போல் எளிமையானது ::
tr: Godot öncelikle bir C++ projesidir ve :ref:` SCons derleme sistemini kullanır <doc_faq_why_scons>`. SCons'u, derleme sistemimizi sürdürülebilir ve kurulumu kolay hale getirdiği için seviyoruz. Ve bu sayede Godot'u kaynaktan derlemek, şunu çalıştırmak kadar basittir::

source: This produces an editor build for your current platform, operating system, and architecture. You can change what gets built by specifying a target, a platform, and/or an architecture. For example, to build an export template used for running exported games, you can run::
ga: Táirgeann sé seo tógáil eagarthóra do d’ardán reatha, do chóras oibriúcháin agus d’ailtireacht. Is féidir leat an rud a thógtar a athrú trí sprioc, ardán, agus/nó ailtireacht a shonrú. Mar shampla, chun teimpléad easpórtála a thógáil a úsáidtear chun cluichí easpórtáilte a rith, is féidir leat::
ta: இது உங்கள் தற்போதைய தளம், இயக்க முறைமை மற்றும் கட்டிடக்கலை ஆகியவற்றிற்கான ஒரு எடிட்டர் கட்டமைப்பை உருவாக்குகிறது. இலக்கு, ஒரு தளம் மற்றும்/அல்லது ஒரு கட்டமைப்பைக் குறிப்பிடுவதன் மூலம் கட்டமைக்கப்பட்டதை நீங்கள் மாற்றலாம். எடுத்துக்காட்டாக, ஏற்றுமதி செய்யப்பட்ட விளையாட்டுகளை இயக்குவதற்கு பயன்படுத்தப்படும் ஏற்றுமதி வார்ப்புருவை உருவாக்க, நீங்கள் இயக்கலாம் ::
tr: Bu, mevcut platformunuz, işletim sisteminiz ve mimariniz için bir düzenleyici derlemesi üretir. Bir hedef, bir platform ve/veya bir mimari belirterek neyin oluşturulacağını değiştirebilirsiniz. Örneğin, dışa aktarılan oyunları çalıştırmak için kullanılan bir dışa aktarma şablonu oluşturmak için şunu çalıştırabilirsiniz::

source: If you plan to debug or develop the engine, then you might want to enable the ``dev_build`` option to enable dev-only debugging code::
ga: Má tá sé ar intinn agat an t-inneall a dhífhabhtú nó a fhorbairt, b'fhéidir gur mhaith leat an rogha `dev_build` a chumasú chun cód dífhabhtaithe dev-only a chumasú:
ta: இயந்திரத்தை பிழைத்திருத்த அல்லது உருவாக்க நீங்கள் திட்டமிட்டால், தேவ்-மட்டும் பிழைத்திருத்தக் குறியீட்டை இயக்க `` dev_build`` விருப்பத்தை இயக்க விரும்பலாம் ::
tr: Motorda hata ayıklama veya geliştirme yapmayı planlıyorsanız, yalnızca-geliştirici hata ayıklama kodunu etkinleştirmek için ``dev_build`` seçeneğini etkinleştirmek isteyebilirsiniz::

source: The build process may take a while, depending on how powerful your system is. By default, Godot's SCons setup is configured to use all CPU threads but one (to keep the system responsive during compilation). If you want to adjust how many CPU threads SCons will use, use the ``-j <threads>`` parameter to specify how many threads will be used for the build.
ga: Seans go dtógfaidh an próiseas tógála tamall, ag brath ar cé chomh cumhachtach is atá do chóras. De réir réamhshocraithe, tá socrú SCons Godot cumraithe chun gach snáithe LAP a úsáid ach ceann amháin (chun an córas a choinneáil sofhreagrach le linn tiomsaithe). Más mian leat cé mhéad snáithe LAP a úsáidfidh SCons a choigeartú, úsáid an paraiméadar `` -j <snáithe>`` chun a shonrú cé mhéad snáithe a úsáidfear don tógáil.
ta: உங்கள் கணினி எவ்வளவு ஆற்றல் வாய்ந்தது என்பதைப் பொறுத்து உருவாக்க செயல்முறை சிறிது நேரம் ஆகலாம். இயல்பாக, கோடோட்டின் ச்கான்ச் அமைப்பு அனைத்து சிபியு நூல்களையும் பயன்படுத்த கட்டமைக்கப்பட்டுள்ளது, ஆனால் ஒன்று (தொகுப்பின் போது கணினியை பதிலளிக்க). SCON கள் எத்தனை சிபியு நூல்கள் பயன்படுத்தும் என்பதை நீங்கள் சரிசெய்ய விரும்பினால், கட்டமைப்பிற்கு எத்தனை நூல்கள் பயன்படுத்தப்படும் என்பதைக் குறிப்பிட `` -j <த்ரெட்கள்> `` அளவுருவைப் பயன்படுத்தவும்.
tr: Sisteminizin ne kadar güçlü olduğuna bağlı olarak derleme işlemi biraz zaman alabilir. Varsayılan olarak, Godot'nun SCons kurulumu biri hariç tüm CPU iş parçacıklarını kullanacak şekilde yapılandırılmıştır (derleme sırasında sistemi kullanılır tutmak için). SCons'un kaç CPU iş parçacığı kullanacağını ayarlamak istiyorsanız, derleme için kaç iş parçacığı kullanılacağını belirtmek için ``-j <iş sayısı>`` parametresini kullanın.

source: Example for using 4 threads::
ga: Sampla chun 4 snáithe a úsáid::
ta: 4 நூல்களைப் பயன்படுத்துவதற்கான எடுத்துக்காட்டு ::
tr: 4 iş parçacığı kullanımı için örnek::

source: To list the available target platforms, use ``scons platform=list``::
ga: Chun na sprioc-ardáin atá ar fáil a liostáil, bain úsáid as ``scons platform=list``:
ta: கிடைக்கக்கூடிய இலக்கு தளங்களை பட்டியலிட, `` ச்கான்ச் பிளாட்ஃபார்ம் = பட்டியல்`` :: ஐப் பயன்படுத்தவும்
tr: Kullanılabilir hedef platformları listelemek için ``scons platform=list`` kullanın::

source: The resulting binaries will be placed in the ``bin/`` subdirectory, generally with this naming convention::
ga: Cuirfear na dénártha mar thoradh air sa fho-eolaire ``bin/``, go ginearálta leis an gcoinbhinsiún ainmniúcháin seo:
ta: இதன் விளைவாக வரும் இருமங்கள் `` பின்/`` துணை அடைவில் வைக்கப்படும், பொதுவாக இந்த பெயரிடும் மாநாட்டுடன் ::
tr: Elde edilen ikili dosyalar ``bin/`` alt dizinine, genellikle şu adlandırma kuralıyla yerleştirilecektir::

source: Target controls if the editor is contained and debug flags are used. All builds are optimized. Each mode means:
ga: Rialuithe spriocanna má tá an t-eagarthóir i gceist agus má úsáidtear bratacha dífhabhtaithe. Tá gach foirgneamh optamaithe. Ciallaíonn gach modh:
tr: Hedef, düzenleyicinin içerilip içermediğini ve hata ayıklama bayraklarının kullanılıp kullanılmadığını kontrol eder. Tüm derlemeler optimize edilmiştir. Her mod şu anlama gelir:

source: ``target=editor``: Build with editor, optimized, with debugging code (defines: ``TOOLS_ENABLED``, ``DEBUG_ENABLED``, ``-O2``/``/O2``)
ga: ``target=editor``: Tóg le heagarthóir, optamaithe, le cód dífhabhtaithe (sainmhíníonn: ``TOOLS_ENABLED``, `DEBUG_ENABLED``, ``-O2``/``/O2``)
tr: ``target=editor``: Düzenleyici ile birlikte, optimize edilmiş, hata ayıklama koduyla oluştur (şunları tanımlar: ``TOOLS_ENABLED``, ``DEBUG_ENABLED``, ``-O2``/``/O2``)

source: ``target=template_debug``: Build with C++ debugging symbols (defines: ``DEBUG_ENABLED``, ``-O2``/``/O2``)
ga: ``target=template_debug``: Tóg le siombailí dífhabhtaithe C ++ (sainmhíníonn: ``DEBUG_ENABLED``, ``-O2``/``/O2``)
tr: ``target=template_debug``: C++ hata ayıklama sembolleri ile oluştur (şunları tanımlar: ``DEBUG_ENABLED``, ``-O2``/``/O2``)

source: ``target=template_release``: Build without symbols (defines: ``-O3``/``/O2``)
ga: ``target=template_release``: Tóg gan siombailí (sainmhíníonn: ``-O3``/``/O2``)
tr: ``target=template_release``: Semboller olmadan derle (şunları tanımlar: ``-O3``/``/O2``)

source: You can also disable some of the builtin modules before compiling, saving some time it takes to build the engine. See :ref:`doc_optimizing_for_size` page for more details.
ga: Is féidir leat cuid de na modúil tógtha a dhíchumasú freisin sula ndéantar iad a thiomsú, ag sábháil roinnt ama a thógann sé an t-inneall a thógáil. Féach:ref: leathanach `doc_optimizing_for_size` le haghaidh tuilleadh sonraí.
tr: Ayrıca derlemeden önce bazı yerleşik modülleri devre dışı bırakarak motoru oluşturmak için gereken zamandan tasarruf edebilirsiniz. Daha fazla ayrıntı için :ref:`doc_optimizing_for_size` sayfasına bakın.

source: When developing a Pull Request using SCU builds, be sure to make a regular build prior to submitting the PR. This is because SCU builds by nature include headers from earlier ``.cpp`` files in the translation unit, therefore won't catch all the includes you will need in a regular build. The CI will catch these errors but it will usually be faster to catch them on a local build on your machine.
ga: Agus Iarratas Tarraingthe á fhorbairt ag baint úsáide as tógáil SCU, bí cinnte tógáil rialta a dhéanamh sula gcuireann tú an PR isteach. Tá sé seo toisc go gcuimsíonn tógáil SCU de réir nádúrtha ceanntásca ó chomhaid `.cpp` níos luaithe san aonad aistriúcháin, dá bhrí sin ní ghlacfaidh sé na háiseanna go léir a bheidh ag teastáil uait i dtógáil rialta. Glacfaidh an CI na hearráidí seo ach de ghnáth beidh sé níos tapúla iad a ghabháil ar thógáil áitiúil ar do mheaisín.
tr: SCU derlemelerini kullanarak bir Çekme İsteği geliştirirken, PR'yi göndermeden önce normal bir derleme yaptığınızdan emin olun. Bunun nedeni SCU derlemelerinin doğası gereği çeviri birimindeki önceki ``.cpp`` dosyalarının başlıklarını içermesi ve bu nedenle normal bir derlemede ihtiyaç duyacağınız tüm içermeleri yakalayamayacak olmasıdır. CI bu hataları yakalayacaktır, ancak bunları makinenizdeki yerel bir derlemede yakalamak genellikle daha hızlı olacaktır.
