Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/introduction_to_the_buildsystem.po
Languages: ga, ta, tr, uk, zh_cn

source: You can manually override options from those aliases by specifying them on the same command line with different values. For example, you can use ``scons production=yes debug_symbols=yes`` to create production-optimized binaries with debugging symbols included.
ga: Is féidir leat roghanna ó na hainmneacha sin a shárú de láimh trí iad a shonrú ar an líne ordaithe céanna le luachanna éagsúla. Mar shampla, is féidir leat ``scons production=yes debug_symbols=yes ``a úsáid chun dénártha optamaithe táirgeachta a chruthú le siombailí dífhabhtaithe san áireamh.
ta: அந்த மாற்றுப்பெயர்களிடமிருந்து விருப்பங்களை வெவ்வேறு மதிப்புகளுடன் ஒரே கட்டளை வரியில் குறிப்பிடுவதன் மூலம் நீங்கள் கைமுறையாக மேலெழுதலாம். எடுத்துக்காட்டாக, பிழைத்திருத்த சின்னங்களுடன் உற்பத்தி-உகந்த பைனரிகளை உருவாக்க `` ச்கான்ச் விளைவாக்கம் = ஆம் பிழைத்திருத்த_சம்போல்ச் = ஆம்`` ஐப் பயன்படுத்தலாம்.
tr: Bu takma adlardaki seçenekleri aynı komut satırında farklı değerlerle belirterek elden üzerine yazabilirsiniz. Örneğin, üretim için optimize edilmiş ama hata ayıklama sembollerini de içeren ikili dosyalar oluşturmak için ``scons production=yes debug_symbols=yes`` kullanabilirsiniz.
uk: Ви можете вручну змінити параметри цих псевдонімів, вказавши їх у тому самому командному рядку з різними значеннями. Наприклад, ви можете використовувати ``scons production=yes debug_symbols=yes`` для створення оптимізованих для виробництва двійкових файлів із включеними символами налагодження.
zh_cn: 这些别名中的选项可以手动覆盖，在命令行中将其指定为不同的值即可。例如使用 ``scons production=yes debug_symbols=yes`` 即可创建针对生产优化并且带有调试符号的二进制文件。

source: Dev build
ga: Tógáil Dev
ta: தேவ் உருவாக்க
tr: Geliştirilmiş derlemesi
uk: Розробник збірки
zh_cn: 开发构建

source: ``dev_build`` should **not** be confused with ``dev_mode``, which is an alias for several development-related options (see above).
ga: Níor chóir go gcuirfí mearbhall ar `dev_build`` le `dev_mode``, ar alias é do roinnt roghanna a bhaineann le forbairt (féach thuas).
ta: `` dev_build``` ** ** ** `` dev_mode`` உடன் குழப்பமடையக்கூடாது, இது பல வளர்ச்சி தொடர்பான விருப்பங்களுக்கான மாற்றுப்பெயராகும் (மேலே காண்க).
tr: ``dev_build``, geliştirme ile ilgili çeşitli seçenekler için bir takma ad olan ``dev_mode`` ile **karıştırılmamalıdır** (yukarıya bakın).
uk: ``dev_build`` **не** слід плутати з ``dev_mode``, який є псевдонімом для кількох параметрів, пов’язаних з розробкою (див. вище).
zh_cn: **请勿**\ 混淆 ``dev_build`` 与 ``dev_mode``\ ，后者是部分开发相关选项的别名（见上文）。

source: When doing engine development the ``dev_build`` option can be used together with ``target`` to enable dev-specific code. ``dev_build`` defines ``DEV_ENABLED``, disables optimization (``-O0``/``/0d``), enables generating debug symbols, and does not define ``NDEBUG`` (so ``assert()`` works in thirdparty libraries).
ga: Agus forbairt innill á dhéanamh agat is féidir an rogha `dev_build`` a úsáid in éineacht le ``target ``chun cód dev-shonrach a chumasú. Sainmhíníonn ``dev_build`` `DEV_ENABLED``, barrfheabhsú (``-O0`/``/0D``), cumasaíonn sé siombailí dífhabhtaithe a ghiniúint, agus ní shainigh sé ``NDEBUG`` (mar sin oibríonn ``assert () ``i leabharlanna tríú páirtí).
ta: என்சின் மேம்பாட்டைச் செய்யும்போது, `` dev_build`` விருப்பத்தை `` இலக்கு`` உடன் சேர்ந்து தேவ்-குறிப்பிட்ட குறியீட்டை இயக்க பயன்படுத்தலாம். `` dev_build`` `` dev_enabled`` ஐ வரையறுக்கிறது, உகப்பாக்கலை முடக்குகிறது (`-o0``/`/0d``), பிழைத்திருத்த சின்னங்களை உருவாக்க உதவுகிறது, மேலும் `` ndebug`` (எனவே `` `என்ட் ) `` மூன்றாம் தரப்பு நூலகங்களில் வேலை செய்கிறது).
tr: Motoru geliştirirken ``dev_build`` seçeneği ``target`` ile birlikte kullanılarak geliştirmeye-özel kod etkinleştirilebilir. ``dev_build`` kullanımı ``DEV_ENABLED`` tanımlar, optimizasyonu devre dışı bırakır (``-O0``/``/0d``), hata ayıklama sembolleri oluşturmayı etkinleştirir ve ``NDEBUG`` tanımlamaz (böylece ``assert()`` üçüncü taraf kütüphanelerinde çalışır).
uk: Під час розробки двигуна опцію ``dev_build`` можна використовувати разом із ``target``, щоб увімкнути спеціальний код розробника. ``dev_build`` визначає ``DEV_ENABLED``, вимикає оптимізацію (``-O0``/``/0d``), дозволяє генерувати символи налагодження та не визначає ``NDEBUG`` (тому ``assert( )`` працює в сторонніх бібліотеках).

source: This flag appends the ``.dev`` suffix (for development) to the generated binary name.
ga: Cuireann an bhratach seo an iarmhír ``.dev`` (le haghaidh forbartha) leis an ainm dénártha a ghintear.
ta: இந்த கொடி உருவாக்கப்பட்ட பைனரி பெயருடன் `` .dev`` பின்னொட்டு (வளர்ச்சிக்கு) சேர்க்கிறது.
tr: Bu bayrak, oluşturulan ikili dosya adına ``.dev`` son ekini (geliştirme için) ekler.
uk: Цей прапорець додає суфікс ``.dev`` (для розробки) до згенерованого двійкового імені.

source: There are additional SCons options to enable *sanitizers*, which are tools you can enable at compile-time to better debug certain engine issues. See :ref:`doc_using_sanitizers` for more information.
ga: Tá roghanna SCONs breise ann chun * sláintíoltóirí* a chumasú, ar uirlisí is féidir leat a chumasú ag am tiomsaithe chun saincheisteanna áirithe innill a dhífhabhtú níos fearr. Féach:ref: `doc_using_sanitizers` le haghaidh tuilleadh faisnéise.
ta: *சானிட்டைசர்களை *இயக்க கூடுதல் ச்கான்ச் விருப்பங்கள் உள்ளன, அவை சில இயந்திர சிக்கல்களை சிறப்பாக பிழைத்திருத்துவதற்கு தொகுக்கும் நேரத்தில் நீங்கள் இயக்கக்கூடிய கருவிகள். காண்க: குறிப்பு: மேலும் தகவலுக்கு `doc_using_sanitizers`.
tr: Belirli motor sorunlarında daha iyi hata ayıklamak için derleme zamanında etkinleştirebileceğiniz araçlar olan *sanitizer'ları* etkinleştirmek için ek SCons seçenekleri vardır. Daha fazla bilgi için :ref:`doc_using_sanitizers` bölümüne bakınız.
uk: Існують додаткові параметри SCons для ввімкнення *дезінфікуючих засобів*, які є інструментами, які можна ввімкнути під час компіляції для кращого усунення певних проблем двигуна. Перегляньте :ref:`doc_using_sanitizers` для отримання додаткової інформації.

source: Debugging symbols
ga: Siombailí dífhabhtú
ta: பிழைத்திருத்த சின்னங்கள்
tr: Hata ayıklama sembolleri
uk: Налагоджувальні символи
zh_cn: 调试符号

source: By default, ``debug_symbols=no`` is used, which means **no** debugging symbols are included in compiled binaries. Use ``debug_symbols=yes`` to include debug symbols within compiled binaries, which allows debuggers and profilers to work correctly. Debugging symbols are also required for Godot's crash stacktraces to display with references to source code files and lines.
ga: De réir réamhshocraithe, úsáidtear ``debug_symbols=no``, rud a chiallaíonn go bhfuil siombailí dífhabhtaithe **ne** san áireamh i dbinártha tiomsaithe. Úsáid ``debug_symbols=yes`` chun siombailí dífhabhtaithe a áireamh laistigh de dhénártha tiomsaithe, rud a ligeann dífhabhtaithe agus próifílí oibriú i gceart. Teastaíonn siombailí dífhabhtaithe freisin chun stacktracks timpiste Godot a thaispeáint le tagairtí do chomhaid agus línte cód foinse.
ta: இயல்பாக, `` Debug_symbols = no`` பயன்படுத்தப்படுகிறது, அதாவது ** இல்லை ** பிழைத்திருத்த சின்னங்கள் தொகுக்கப்பட்ட இருமங்களில் சேர்க்கப்பட்டுள்ளன. தொகுக்கப்பட்ட பைனரிகளுக்குள் பிழைத்திருத்த சின்னங்களைச் சேர்க்க `` பிழைத்திருத்த_சிம்போல் = ஆம்`` ஐப் பயன்படுத்தவும், இது பிழைத்திருத்திகள் மற்றும் சுயவிவரங்கள் சரியாக வேலை செய்ய அனுமதிக்கிறது. மூலக் குறியீடு கோப்புகள் மற்றும் வரிகளைக் குறிப்புகளுடன் காண்பிக்க கோடோட்டின் செயலிழப்பு அடுக்குகளும் பிழைத்திருத்த சின்னங்கள் தேவை.
tr: Varsayılan olarak ``debug_symbols=no`` kullanılır, bu da derlenmiş ikililere **hiç** hata ayıklama sembolü dahil edilmediği anlamına gelir. Hata ayıklama sembollerini derlenmiş ikililere dahil etmek için ``debug_symbols=yes`` kullanın, bu da hata ayıklayıcıların ve profil oluşturucuların düzgün çalışmasını sağlar. Hata ayıklama sembolleri ayrıca Godot'nun çökme yığın izlerinin kaynak kod dosyalarına ve satırlarına başvurularla görüntülenmesi için de gereklidir.
uk: За замовчуванням використовується ``debug_symbols=no``, що означає, що **жоден** налагоджувальний символ не включено до скомпільованих двійкових файлів. Використовуйте ``debug_symbols=yes``, щоб включити символи налагодження в скомпільовані двійкові файли, що дозволяє налагоджувачам і профайлерам працювати правильно. Символи налагодження також необхідні для відображення стеків аварійного завершення Godot з посиланнями на файли та рядки вихідного коду.

source: The downside is that debugging symbols are large files (significantly larger than the binaries themselves). As a result, official binaries currently do not include debugging symbols. This means you need to compile Godot yourself to have access to debugging symbols.
ga: Is é an míbhuntáiste ná gur comhaid mhóra iad siombailí dífhabhtaithe (i bhfad níos mó ná na dénártha féin). Mar thoradh air sin, ní chuimsíonn dénártaí oifigiúla siombailí dífhabhtaithe faoi láthair. Ciallaíonn sé seo go gcaithfidh tú Godot a thiomsú tú féin chun rochtain a bheith agat ar shiombailí dífhabhtaithe.
ta: தீங்கு என்னவென்றால், பிழைத்திருத்த சின்னங்கள் பெரிய கோப்புகள் (பைனரிகளை விட கணிசமாக பெரியவை). இதன் விளைவாக, அதிகாரப்பூர்வ இருமங்கள் தற்போது பிழைத்திருத்த சின்னங்களை சேர்க்கவில்லை. இதன் பொருள் பிழைத்திருத்த சின்னங்களை அணுகுவதற்கு நீங்கள் கோடோட்டை தொகுக்க வேண்டும்.
tr: Dezavantajı ise hata ayıklama sembollerinin büyük dosyalar olmasıdır (ikili dosyaların kendisinden önemli ölçüde daha büyük). Sonuç olarak, resmi ikili dosyalar şu anda hata ayıklama sembollerini içermemektedir. Bu, hata ayıklama sembollerine erişmek için Godot'yu kendiniz derlemeniz gerektiği anlamına gelir.
uk: Недоліком є те, що символи налагодження є великими файлами (значно більшими за самі двійкові файли). Як наслідок, офіційні двійкові файли наразі не містять символів налагодження. Це означає, що вам потрібно самостійно скомпілювати Godot, щоб мати доступ до символів налагодження.

source: When using ``debug_symbols=yes``, you can also use ``separate_debug_symbols=yes`` to put debug information in a separate file with a ``.debug`` suffix. This allows distributing both files independently. Note that on Windows, when compiling with MSVC, debugging information is *always* written to a separate ``.pdb`` file regardless of ``separate_debug_symbols``.
ga: Agus ``debug_symbols=yes`` á úsáid agat, is féidir leat ``separate_debug_symbols=yes`` a úsáid freisin chun faisnéis dífhabhtaithe a chur i gcomhad ar leithligh le iarmhír ``.debug``. Ligeann sé seo an dá chomhad a dháileadh go neamh Tabhair faoi deara, ar Windows, agus tú ag tiomsú le MSVC, go bhfuil faisnéis dífhabhtaithe scríofa i gcónaí* chuig comhad `.pdb`` ar leithligh beag beann ar ``separate_debug_symbols``.
ta: `` Debug_symbols = ஆம்`` ஐப் பயன்படுத்தும் போது, பிழைத்திருத்த தகவல்களை ஒரு தனி கோப்பில் `` .debug`` பின்னொட்டுடன் வைக்க `` `presen_debug_symbols = yes`` ஐப் பயன்படுத்தலாம். இது இரண்டு கோப்புகளையும் சுயாதீனமாக விநியோகிக்க அனுமதிக்கிறது. சாளரங்களில், எம்.எச்.வி.சியுடன் தொகுக்கும்போது, பிழைத்திருத்த செய்தி * எப்போதும் * ஒரு தனி `` .பிடிபி`` கோப்புக்கு `` `தனி_டெபக்_சிம்போல்ச்` ஆகியவற்றைப் பொருட்படுத்தாமல் எழுதப்படுகிறது என்பதை நினைவில் கொள்க.
tr: ``debug_symbols=yes`` kullanırken, hata ayıklama bilgilerini ``.debug`` son ekine sahip ayrı bir dosyaya koymak için ``separate_debug_symbols=yes`` de kullanabilirsiniz. Bu, her iki dosyanın da bağımsız olarak dağıtılmasını sağlar. Windows'ta, MSVC ile derleme yapılırken, hata ayıklama bilgilerinin ``separate_debug_symbols`` değeri ne olursa olsun *her zaman* ayrı bir ``.pdb`` dosyasına yazıldığını unutmayın.
uk: Використовуючи ``debug_symbols=yes``, ви також можете використовувати ``separate_debug_symbols=yes``, щоб помістити інформацію про налагодження в окремий файл із суфіксом ``.debug``. Це дозволяє розповсюджувати обидва файли окремо. Зауважте, що в Windows під час компіляції за допомогою MSVC інформація про налагодження *завжди* записується в окремий файл ``.pdb`` незалежно від ``separate_debug_symbols``.

source: Use the ``strip <path/to/binary>`` command to remove debugging symbols from a binary you've already compiled.
ga: Úsáid an t-ordú ``stiall <cosán/go/dénártha>`` chun siombailí dífhabhtaithe a bhaint de dhénártha atá tiomsaithe agat cheana féin.
ta: நீங்கள் ஏற்கனவே தொகுத்த ஒரு பைனரியிலிருந்து பிழைத்திருத்த சின்னங்களை அகற்ற `` உரி <பாதை/to/binary> `` கட்டளையைப் பயன்படுத்தவும்.
tr: Derlediğiniz bir ikili dosyadan hata ayıklama sembollerini kaldırmak için ``strip <ikili/dosya/yolu>`` komutunu kullanın.
uk: Використовуйте команду ``strip <path/to/binary>``, щоб видалити символи налагодження з двійкового файлу, який ви вже зібрали.

source: Optimization level
ga: Leibhéal optamaithe
ta: தேர்வுமுறை நிலை
tr: Optimizasyon seviyesi
uk: Рівень оптимізації
zh_cn: 优化级别

source: Several compiler optimization levels can be chosen from:
ga: Is féidir roinnt leibhéil optamaithe tionscnaí a roghnú as:
ta: பல கம்பைலர் தேர்வுமுறை நிலைகளை தேர்வு செய்யலாம்:
tr: Çeşitli derleyici optimizasyon seviyeleri arasından seçim yapılabilir:
uk: Можна вибрати кілька рівнів оптимізації компілятора:
zh_cn: 以下几种编译器优化级别可供选择：

source: ``optimize=speed_trace`` *(default when targeting non-Web platforms)*: Favors execution speed at the cost of larger binary size. Optimizations may sometimes negatively impact debugger usage (stack traces may be less accurate. If this occurs to you, use ``optimize=debug`` instead.
ga: ``optimize=speed_trace`` * (réamhshocraithe nuair a dhíríonn sé ar ardáin neamh-ghréasáin) *: Is fearr le luas forghníomhaithe ar chostas méid dénártha níos mó. Uaireanta d'fhéadfadh barrfheabhsú tionchar diúltach ar úsáid dífhabhtaithe (d'fhéadfadh rianta cruach a bheith chom Má tharlaíonn sé seo duit, bain úsáid as ``optimize=debug`` ina ionad.
ta: `` மேம்படுத்தவும் = SPEED_TRACE`` *(WEB அல்லாத தளங்களை குறிவைக்கும் போது இயல்புநிலை) *: பெரிய பைனரி அளவின் விலையில் செயல்படுத்தும் வேகத்தை ஆதரிக்கிறது. மேம்படுத்தல்கள் சில நேரங்களில் பிழைத்திருத்த பயன்பாட்டை எதிர்மறையாக பாதிக்கலாம் (ச்டேக் தடயங்கள் குறைவான துல்லியமாக இருக்கலாம். இது உங்களுக்கு ஏற்பட்டால், அதற்கு பதிலாக `` உகந்த = பிழைத்திருத்தத்தைப் பயன்படுத்தவும்.
tr: ``optimize=speed_trace`` *(Web dışı platformları hedeflerken varsayılan)*: Daha büyük ikili boyut pahasına çalışma hızını destekler. Optimizasyonlar bazen hata ayıklayıcı kullanımını olumsuz etkileyebilir (yığın izleri daha az doğru olabilir. Eğer bu durumla karşılaşırsanız, bunun yerine ``optimize=debug`` kullanın.
uk: ``optimize=speed_trace`` *(за умовчанням, якщо націлено на не-веб-платформи)*: надає перевагу швидкості виконання за рахунок більшого двійкового розміру. Оптимізація іноді може негативно вплинути на використання налагоджувача (трасування стека може бути менш точним. Якщо це станеться з вами, використовуйте натомість ``optimize=debug``).
zh_cn: ``optimize=speed_trace``\ *（目标平台非 Web 时默认）*\ ：执行速度更快，但二进制文件更大。优化有时会对调试器的使用产生负面影响（可能会降低堆栈跟踪的准确性）。如果遇到了这种情况，请改用 ``optimize=debug``\ 。

source: ``optimize=speed``: Favors even more execution speed, at the cost of even larger binary size compared to ``optimize=speed_trace``. Even less friendly to debugging compared to ``optimize=debug``, as this uses the most aggressive optimizations available.
ga: ``optimize=speed``: Is fearr le luas forghníomhaithe níos mó fós, ar chostas méid dénártha níos mó fós i gcomparáid le ``optimize=speed_trace``. Fós níos lú cairdiúil le dífhabhtú i gcomparáid le ``optimise=debug``, toisc go n-úsáideann sé seo na barrfheabhsuithe is ionsaitheacha atá ar fáil.
ta: `` `உகந்த = SPEED_TRACE`` உடன் ஒப்பிடும்போது, இன்னும் பெரிய பைனரி அளவின் செலவில்,` `மேம்படுத்த = வேகத்தை மேம்படுத்துங்கள். `` உகந்த = பிழைத்திருத்தம்`` உடன் ஒப்பிடும்போது பிழைத்திருத்தத்திற்கு குறைந்த நட்பு கூட, இது மிகவும் ஆக்கிரோசமான மேம்படுத்தல்களைப் பயன்படுத்துகிறது.
tr: ``optimize=speed``: ``optimize=speed_trace`` ile karşılaştırıldığında daha büyük ikili boyut pahasına daha da yüksek çalıştırma hızını destekler. Mevcut en agresif optimizasyonları kullandığından, ``optimize=debug`` ile karşılaştırıldığında hata ayıklama için daha da az dosttur.
uk: ``optimize=speed``: надає перевагу навіть вищій швидкості виконання за рахунок ще більшого двійкового розміру порівняно з ``optimize=speed_trace``. Ще менш зручний для налагодження порівняно з ``optimize=debug``, оскільки тут використовуються найагресивніші доступні оптимізації.
zh_cn: ``optimize=speed``\ ：与 ``optimize=speed_trace`` 相比，执行速度更快，但二进制文件也更大。与 ``optimize=debug`` 相比更不利于调试，因为会尽可能使用最激进的优化手段。

source: ``optimize=size`` *(default when targeting the Web platform)*: Favors small binaries at the cost of slower execution speed.
ga: ``optimize=size`` * (réamhshocraithe agus tú ag díriú ar an ardán Gréasáin) *: Is fearr le dénártha beaga ar chostas luas forghníomhaithe níos moille.
ta: `` மேம்படுத்தவும் = அளவு`` *(வலை தளத்தை குறிவைக்கும் போது இயல்புநிலை) *: மெதுவான சாவுஒறுப்பு வேகத்தின் செலவில் சிறிய பைனரிகளை ஆதரிக்கிறது.
tr: ``optimize=size`` *(Web platformunu hedeflerken varsayılan)*: Daha yavaş çalıştırma hızı pahasına küçük boyutlu ikili dosyaları destekler.
uk: ``optimize=size`` *(за замовчуванням, якщо націлено на веб-платформу)*: надає перевагу невеликим двійковим файлам ціною меншої швидкості виконання.
zh_cn: ``optimize=size``\ *（目标平台为 Web 时默认）*\ ：二进制文件更小，但执行速度更慢。

source: ``optimize=size_extra``: Favors even smaller binaries, at the cost of even slower execution speed compared to ``optimize=size``.
uk: ``optimize=size_extra``: Надає перевагу ще меншим бінарним файлам, але за рахунок ще повільнішої швидкості виконання порівняно з ``optimize=size``.

source: ``optimize=debug``: Only enables optimizations that do not impact debugging in any way. This results in faster binaries than ``optimize=none``, but slower binaries than ``optimize=speed_trace``.
ga: ``optime=debug``: Ní chumasaíonn ach barrfheabhsú nach mbíonn tionchar acu ar dhífhabhtú ar bhealach ar bith. Mar thoradh air seo tá dénártha níos gasta ná ``optime=none``, ach dénártha níos moille ná ``optimize=speed_trace``.
ta: `` மேம்படுத்த = பிழைத்திருத்தத்தை மேம்படுத்துங்கள்``: பிழைத்திருத்தத்தை எந்த வகையிலும் பாதிக்காத மேம்படுத்தல்களை மட்டுமே செயல்படுத்துகிறது. இது `` உகந்த = எதுவுமில்லை` `ஐ விட வேகமான பைனரிகளில் விளைகிறது, ஆனால்` `உகந்த = ச்பீட்_ரேச்`` ஐ விட மெதுவான பைனரிகள்.
tr: ``optimize=debug``: Yalnızca hata ayıklamayı hiçbir şekilde etkilemeyen optimizasyonları etkinleştirir. Bu, ``optimize=none`` seçeneğinden daha hızlı, ancak ``optimize=speed_trace`` seçeneğinden daha yavaş ikili dosyalarla sonuçlanır.
uk: ``optimize=debug``: вмикає лише оптимізацію, яка жодним чином не впливає на налагодження. Це призводить до швидших двійкових файлів, ніж ``optimize=none``, але повільніших двійкових файлів, ніж ``optimize=speed_trace``.
zh_cn: ``optimize=debug``\ ：仅启用不会对调试产生影响的优化手段。得到的二进制文件比 ``optimize=none`` 快、比 ``optimize=speed_trace`` 慢。

source: ``optimize=none``: Do not perform any optimization. This provides the fastest build times, but the slowest execution times.
ga: ``optimize=none``: Ná déan aon optamú. Soláthraíonn sé seo na hamanna tógála is tapúla, ach na hamanna forghníomhaithe is moille.
ta: `` மேம்படுத்த = எதுவுமில்லை``: எந்த தேர்வுமுறையும் செய்ய வேண்டாம். இது வேகமான உருவாக்க நேரங்களை வழங்குகிறது, ஆனால் மெதுவான சாவுஒறுப்பு நேரங்கள்.
tr: ``optimize=none``: Herhangi bir optimizasyon gerçekleştirmez. Bu, en hızlı derleme sürelerini, ancak en yavaş çalıştırma sürelerini verir.
uk: ``optimize=none``: не виконувати оптимізацію. Це забезпечує найшвидший час створення, але найповільніший час виконання.
zh_cn: ``optimize=none``\ ：不进行任何优化。构建时间最快、执行速度最慢。

source: ``optimize=custom`` *(advanced users only)*: Do not pass optimization arguments to the C/C++ compilers. You will have to pass arguments manually using the ``cflags``, ``ccflags`` and ``cxxflags`` SCons options.
ga: ``optimize=custom`` * (ardúsáideoirí amháin) *: Ná cuir argóintí optamaithe chuig na tiomsaitheoirí C/C ++. Beidh ort argóintí a rith de láimh ag baint úsáide as na roghanna ``cflags``, `ccflags`` agus ``cxxflags`` scons.
ta: `` உகந்த = தனிப்பயன்`` *(மேம்பட்ட பயனர்கள் மட்டும்) *: சி/சி ++ கம்பைலர்களுக்கு தேர்வுமுறை வாதங்களை அனுப்ப வேண்டாம். `` Cflags``, `` ccflags`` மற்றும் `` cxxflags`` விருப்பங்களைப் பயன்படுத்தி நீங்கள் கைமுறையாக வாதங்களை அனுப்ப வேண்டும்.
tr: ``optimize=custom`` *(sadece ileri düzey kullanıcılar)*: C/C++ derleyicilerine optimizasyon argümanlarını geçirmez. Argümanları ``cflags``, ``ccflags`` ve ``cxxflags`` SCons seçeneklerini kullanarak manuel olarak geçirmeniz gerekecektir.
uk: ``optimize=custom`` *(тільки для досвідчених користувачів)*: не передавати аргументи оптимізації компіляторам C/C++. Вам доведеться передавати аргументи вручну за допомогою параметрів ``cflags``, ``ccflags`` і ``cxxflags`` SCons.
zh_cn: ``optimize=custom``\ *（仅限高阶用户）*\ ：不会向 C/C++ 编译器传递优化参数。你需要通过 ``cflags``\ 、\ ``ccflags``\ 、\ ``cxxflags`` SCons 选项手动传递参数。

source: Architecture
ga: Ailtireacht
ta: கட்டிடக்கலை
tr: Mimari
uk: Архітектура
zh_cn: 架构

source: The ``arch`` option is meant to control the CPU or OS version intended to run the binaries. It is focused mostly on desktop platforms and ignored everywhere else.
ga: Tá an rogha `` áirse`` i gceist chun an leagan LAP nó OS atá beartaithe chun na dénártha a rith a rialú. Tá sé dírithe go príomha ar ardáin deisce agus déantar neamhaird de i ngach áit eile.
ta: `` ஆர்ச்`` விருப்பம் என்பது பைனரிகளை இயக்கும் நோக்கம் கொண்ட சிபியு அல்லது OS பதிப்பைக் கட்டுப்படுத்துவதாகும். இது பெரும்பாலும் டெச்க்டாப் தளங்களில் கவனம் செலுத்துகிறது மற்றும் மற்ற எல்லா இடங்களிலும் புறக்கணிக்கப்படுகிறது.
tr: ``arch`` seçeneği, ikili dosyaları çalıştırmak için amaçlanan CPU veya işletim sistemi sürümünü kontrol etmek içindir. Çoğunlukla masaüstü platformlarına odaklanır ve diğer her yerde göz ardı edilir.
uk: Параметр ``arch`` призначений для керування версією ЦП або ОС, призначеною для запуску двійкових файлів. Він зосереджений переважно на настільних платформах і ігнорується скрізь.
zh_cn: ``arch`` 选项的作用是控制用于运行二进制文件的 CPU 或操作系统版本。主要针对桌面平台，其他平台都会忽略该选项。

source: Supported values for the ``arch`` option are **auto**, **x86_32**, **x86_64**, **arm32**, **arm64**, **rv64**, **ppc32**, **ppc64** and **wasm32**.
ga: Is iad luachanna tacaithe don rogha `arch`` ná **auto**, **x86_32**, **x86_64**, **arm32**, **arm64**, **rv64**, **ppc32**, **ppc64**, **ppc64** agus **wasm32**.
ta: `` ஆர்ச்` விருப்பத்திற்கான உதவி மதிப்புகள் ** ஆட்டோ **, ** x86_32 **, ** x86_64 **, ** ARM32 **, ** ARM64 **, ** rv64 **, ** ppc32 **, ** பிபிசி 64 ** மற்றும் ** WASM32 **.
tr: ``arch`` seçeneği için desteklenen değerler **auto**, **x86_32**, **x86_64**, **arm32**, **arm64**, **rv64**, **ppc32**, **ppc64** ve **wasm32** 'dir.
uk: Підтримувані значення для параметра ``arch``: **auto**, **x86_32**, **x86_64**, **arm32**, **arm64**, **rv64**, **ppc32 **, **ppc64** і **wasm32**.
zh_cn: ``arch`` 选项支持的取值有：\ **auto**\ 、 **x86_32**\ 、 **x86_64**\ 、 **arm32**\ 、 **arm64**\ 、 **rv64**\ 、 **ppc32**\ 、 **ppc64**\ 、 **wasm32**\ 。

source: This flag appends the value of ``arch`` to resulting binaries when relevant. The default value ``arch=auto`` detects the architecture that matches the host platform.
ga: Cuireann an bhratach seo luach ``arch`` leis na dénártha mar thoradh air nuair is ábhartha. Aimsíonn an luach réamhshocraithe `arch=auto`` an ailtireacht a oireann leis an ardán óstach.
ta: இந்த கொடி பொருத்தமானதாக இருக்கும்போது `` பரம`` இன் மதிப்பை வழங்குகிறது. இயல்புநிலை மதிப்பு `` ஆர்ச் = ஆட்டோ`` புரவலன் தளத்துடன் பொருந்தக்கூடிய கட்டமைப்பைக் கண்டறிகிறது.
tr: Bu bayrak, ilgili olduğunda ortaya çıkan ikili dosyalara ``arch`` değerini ekler. Varsayılan değer ``arch=auto``, çalışılan bilgisayar platformuyla eşleşen mimariyi algılar.
uk: Цей прапорець додає значення ``arch`` до отриманих двійкових файлів, якщо це необхідно. Значення за замовчуванням ``arch=auto`` визначає архітектуру, яка відповідає хост-платформі.
zh_cn: 使用该标志时，最终得到的二进制文件的末尾会加上 ``arch`` 的取值。默认值 ``arch=auto`` 会检测与宿主平台匹配的架构。

source: Custom modules
ga: Modúil saincheaptha
ta: தனிப்பயன் தொகுதிகள்
tr: Özel yapım modüller
uk: Спеціальні модулі
zh_cn: 自定义模块
