Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/introduction_to_the_buildsystem.po
Languages: ga, ta, tr, uk, zh_cn

source: Introduction to the buildsystem
ga: Réamhrá don chóras tógála
ta: பில்ட் சிச்டத்திற்கு அறிமுகம்
tr: Derleme sistemine giriş
uk: Знайомство з системою побудови
zh_cn: 构建系统介绍

source: Godot is a primarily C++ project and it :ref:`uses the SCons build system. <doc_faq_why_scons>` We love SCons for how maintainable and easy to set up it makes our buildsystem. And thanks to that compiling Godot from source can be as simple as running:
uk: Godot — це переважно проєкт на C++, який :ref:`uses the SCons build system. <doc_faq_why_scons>` Ми любимо SCons за те, наскільки зручною в обслуговуванні та налаштуванні робить нашу систему збірки. І завдяки цьому компіляція Godot з вихідного коду може бути такою ж простою, як запуск:

source: This produces an editor build for your current platform, operating system, and architecture. You can change what gets built by specifying a target, a platform, and/or an architecture. For example, to build an export template used for running exported games, you can run:
uk: Це створить збірку редактора для вашої поточної платформи, операційної системи та архітектури. Ви можете змінити складову збірки, вказавши ціль, платформу та/або архітектуру. Наприклад, щоб створити шаблон експорту, який використовується для запуску експортованих ігор, ви можете виконати:

source: If you plan to debug or develop the engine, then you might want to enable the ``dev_build`` option to enable dev-only debugging code:
uk: Якщо ви плануєте налагоджувати або розробляти рушій, можливо, вам варто ввімкнути опцію ``dev_build``, щоб увімкнути код налагодження лише для розробників:

source: Following sections in the article will explain these and other universal options in more detail. But before you can compile Godot, you need to install a few prerequisites. Please refer to the platform documentation to learn more:
ga: Míneoidh na codanna ina dhiaidh sin san alt seo agus na roghanna uilíocha eile níos mionsonraithe. Ach sula bhféadfaidh tú Godot a thiomsú, ní mór duit cúpla réamhriachtanas a shuiteáil. Féach doiciméadú an ardáin le do thoil chun níos mó a fhoghlaim:
ta: கட்டுரையில் பின்வரும் பிரிவுகள் இந்த மற்றும் பிற உலகளாவிய விருப்பங்களை இன்னும் விரிவாக விளக்கும். ஆனால் நீங்கள் கோடோட்டை தொகுக்க முன், நீங்கள் சில முன்நிபந்தனைகளை நிறுவ வேண்டும். மேலும் அறிய மேடை ஆவணங்களைப் பார்க்கவும்:
tr: Makalenin ilerleyen bölümlerinde bu ve diğer evrensel seçenekler daha ayrıntılı olarak açıklanacaktır. Ancak Godot'yu derlemeden önce birkaç ön gereksinimi yüklemeniz gerekir. Daha fazla bilgi edinmek için lütfen platform belgelerine bakın:
uk: У наступних розділах статті докладніше пояснюється ці та інші універсальні варіанти. Але перш ніж ви зможете скомпілювати Godot, вам потрібно встановити кілька попередніх умов. Щоб дізнатися більше, зверніться до документації платформи:

source: These articles cover in great detail both how to setup your environment to compile Godot on a specific platform, and how to compile for that platform. Please feel free to go back and forth between them and this article to reference platform-specific and universal configuration options.
ga: Clúdaíonn na hailt seo go mion conas do thimpeallacht a chur ar bun chun Godot a thiomsú ar ardán ar leith, agus conas tiomsú don ardán sin. Ná bíodh leisce ort dul aníos agus anall eatarthu agus an t-alt seo chun tagairt a dhéanamh do roghanna cumraíochta uilíoch atá sonrach don ardán agus go sonrach.
ta: இந்த கட்டுரைகள் ஒரு குறிப்பிட்ட மேடையில் கோடோட்டை தொகுக்க உங்கள் சூழலை எவ்வாறு அமைப்பது, அந்த தளத்திற்கு எவ்வாறு தொகுத்தல் என்பது இரண்டையும் விரிவாக உள்ளடக்கியது. இயங்குதள-குறிப்பிட்ட மற்றும் உலகளாவிய உள்ளமைவு விருப்பங்களைக் குறிப்பிட அவர்களுக்கும் இந்த கட்டுரைக்கும் இடையில் முன்னும் பின்னுமாக செல்ல தயங்க.
tr: Bu makaleler, Godot'u belirli bir platformda derlemek için ortamınızı nasıl kuracağınızı ve bu platform için nasıl derleme yapacağınızı ayrıntılı olarak ele almaktadır. Platforma özgü ve evrensel yapılandırma seçeneklerine başvurmak için lütfen bu makaleler ile bu sayfa arasında ileri geri gitmekten çekinmeyin.
uk: У цих статтях детально описано як налаштувати ваше середовище для компіляції Godot на певній платформі, так і як компілювати для цієї платформи. Будь ласка, не соромтеся переходити між ними та цією статтею, щоб посилатися на специфічні для платформи та універсальні параметри конфігурації.

source: Using multi-threading
ga: Ag baint úsáide as il-shnáithe
ta: மல்டி-த்ரெடிங்கைப் பயன்படுத்துதல்
tr: Çoklu iş parçacığı kullanma
uk: Використання багатопоточності

source: The build process may take a while, depending on how powerful your system is. By default, Godot's SCons setup is configured to use all CPU threads but one (to keep the system responsive during compilation). If the system has 4 CPU threads or fewer, it will use all threads by default.
uk: Процес збірки може тривати деякий час, залежно від потужності вашої системи. За замовчуванням, налаштування SCons у Godot налаштоване на використання всіх потоків процесора, крім одного (щоб система реагувала швидко під час компіляції). Якщо система має 4 потоки процесора або менше, вона використовуватиме всі потоки за замовчуванням.

source: If you want to adjust how many CPU threads SCons will use, use the ``-j<threads>`` parameter to specify how many threads will be used for the build.
uk: Якщо ви хочете налаштувати кількість потоків процесора, які використовуватимуть SCons, використовуйте параметр ``-j<threads>``, щоб вказати, скільки потоків буде використано для збірки.

source: Example for using 12 threads:
uk: Приклад використання 12 ниток:

source: Platform selection
ga: Roghnú ardáin
ta: இயங்குதள தேர்வு
tr: Platform seçimi
uk: Вибір платформи
zh_cn: 选择平台

source: Godot's build system will begin by detecting the platforms it can build for. If not detected, the platform will simply not appear on the list of available platforms. The build requirements for each platform are described in the rest of this tutorial section.
ga: Tosóidh córas tógála Godot trí na hardáin is féidir leis a thógáil dóibh a bhrath. Mura bhraitear, ní bheidh an t-ardán le feiceáil ar liosta na n-ardán atá ar fáil. Déantar cur síos ar na riachtanais tógála do gach ardán sa chuid eile den chuid teagaisc seo.
ta: கோடோட்டின் உருவாக்க அமைப்பு அது உருவாக்கக்கூடிய தளங்களைக் கண்டறிவதன் மூலம் தொடங்கும். கண்டறியப்படாவிட்டால், கிடைக்கக்கூடிய தளங்களின் பட்டியலில் தளம் தோன்றாது. ஒவ்வொரு தளத்திற்கும் உருவாக்கத் தேவைகள் இந்த பயிற்சி பிரிவின் எஞ்சிய பகுதிகளில் விவரிக்கப்பட்டுள்ளன.
tr: Godot'un derleme sistemi, derleme yapabileceği platformları tespit ederek başlayacaktır. Algılanmazsa, platform mevcut platformlar listesinde görünmeyecektir. Her platform için derleme gereksinimleri bu eğitim bölümünün geri kalanında açıklanmaktadır.
uk: Система збірки Godot розпочнеться з виявлення платформ, для яких вона може створюватися. Якщо не буде виявлено, платформа просто не з’явиться в списку доступних платформ. Вимоги до збірки для кожної платформи описано в решті цього розділу підручника.
zh_cn: Godot的构建系统将从检测可构建的平台开始. 如果未检测到, 该平台将不会出现在可用平台列表中. 本教程后续部分将介绍每种平台的构建要求.

source: SCons is invoked by just calling ``scons``. If no platform is specified, SCons will detect the target platform automatically based on the host platform. It will then start building for the target platform right away.
ga: Déantar SCons a ghlaoch trí ghlaoch ar ``scons``. Mura sonraítear aon ardán, braithfidh SCons an sprioc-ardán go huathoibríoch bunaithe ar an ardán óstach. Tosóidh sé ansin ag tógáil don sprioc-ardán láithreach.
ta: `` ச்கான்ச்`` என்று அழைப்பதன் மூலம் ச்கான்ச் செயல்படுத்தப்படுகிறது. எந்த தளமும் குறிப்பிடப்படவில்லை எனில், புரவலன் தளத்தின் அடிப்படையில் தானாகவே இலக்கு தளத்தை ச்கோன்கள் கண்டறிந்தன. அது உடனே இலக்கு தளத்திற்கான கட்டத் தொடங்கும்.
tr: SCons sadece ``scons`` çağrısı yapılarak çağrılır. Herhangi bir platform belirtilmezse, SCons hedef platformu çalıştığı bilgisayar platformuna göre otomatik olarak algılar. Daha sonra hemen hedef platform için derlemeye başlayacaktır.
uk: SCons викликається простим викликом ``scons``. Якщо платформа не вказана, SCons автоматично визначить цільову платформу на основі платформи хоста. Після цього відразу почнеться створення для цільової платформи.
zh_cn: 仅通过调用 ``scons`` 即可调用SCons. 如果未指定平台,SCons将基于主机平台自动检测目标平台. 然后它将立即开始为目标平台构建.

source: To list the available target platforms, use ``scons platform=list``:
uk: Щоб переглянути список доступних цільових платформ, використовуйте ``scons platform=list``:

source: To build for a platform (for example, ``linuxbsd``), run with the ``platform=`` (or ``p=`` to make it short) argument:
ga: Chun ardán a thógáil (mar shampla, ``linuxbsd``), rith leis an argóint ``platform=`` (nó ``p=`` chun é a dhéanamh gearr):
ta: ஒரு தளத்தை உருவாக்க (எடுத்துக்காட்டாக, `` linuxbsd``), `` இயங்குதள = `` (அல்லது `` ப = `` ஆகியவற்றை குறுகியதாக மாற்ற) வாதத்துடன் இயக்கவும்:
tr: Bir platform için derleme yapmak için (örneğin, ``linuxbsd``), ``platform=`` (veya kısa olması için ``p=``) argümanıyla çalıştırın:
uk: Щоб створити для платформи (наприклад, ``linux bsd``), запустіть аргумент ``platform=`` (або ``p=``, щоб зробити його коротким):

source: Resulting binary
ga: Dénártha mar thoradh
ta: இதன் விளைவாக பைனரி
tr: Oluşturulan çalıştırma dosyası
uk: Результуючий двійковий файл
zh_cn: 生成的二进制文件

source: The resulting binaries will be placed in the ``bin/`` subdirectory, generally with this naming convention:
uk: Отримані бінарні файли будуть розміщені в підкаталозі ``bin/``, зазвичай з такою домовленістю про іменування:

source: For the previous build attempt, the result would look like this:
ga: Maidir leis an iarracht tógála roimhe seo, bheadh an toradh mar seo:
ta: முந்தைய உருவாக்க முயற்சிக்கு, இதன் விளைவாக இப்படி இருக்கும்:
tr: Önceki derleme denemesi için sonuç şu şekilde görünecektir:
uk: Для попередньої спроби збірки результат виглядав би так:

source: This means that the binary is for Linux *or* \*BSD (*not* both), is not optimized, has the whole editor compiled in, and is meant for 64 bits.
ga: Ciallaíonn sé seo go bhfuil an dénártha le haghaidh Linux* nó*\ *BSD (* ní* an dá cheann), nach bhfuil sé optamaithe, tá an t-eagarthóir iomlán tiomsaithe ann, agus go bhfuil sé i gceist le haghaidh 64 giotán.
ta: இதன் பொருள் பைனரி லினக்ச்*அல்லது*\*பி.எச்.டி (*இரண்டுமே அல்ல), உகந்ததாக இல்லை, முழு ஆசிரியரையும் தொகுத்துள்ளது, மேலும் இது 64 பிட்களுக்கானது.
tr: Bu, ikili dosyanın Linux *veya* \*BSD için olduğu (*her ikisi için değil*), optimize edilmediği, tüm düzenleyicinin derlendiği ve 64 bit için olduğu anlamına gelir.
uk: Це означає, що двійковий файл призначений для Linux *або* \*BSD (*не* для обох), не оптимізований, у ньому скомпільовано весь редактор і призначений для 64 бітів.

source: A Windows binary with the same configuration will look like this:
ga: Beidh cuma seo ar dhénártha Windows leis an gcumraíocht chéanna:
ta: அதே உள்ளமைவு கொண்ட சாளரங்கள் பைனரி இப்படி இருக்கும்:
tr: Aynı yapılandırmaya sahip bir Windows ikili dosyası aşağıdaki gibi görünecektir:
uk: Двійковий файл Windows із такою ж конфігурацією виглядатиме так:
zh_cn: 一个具有相同配置的Windows二进制文件将如下所示:

source: Copy that binary to any location you like, as it contains the Project Manager, editor and all means to execute the game. However, it lacks the data to export it to the different platforms. For that the export templates are needed (which can be either downloaded from `godotengine.org <https://godotengine.org/>`__, or you can build them yourself).
ga: Cóipeáil an dénártha sin chuig aon suíomh is mian leat, mar go bhfuil an Bainisteoir Tionscadail, an t-eagarthóir agus gach modh chun an cluiche a rith ann. Mar sin féin, níl na sonraí ann chun é a onnmhairiú chuig na hardáin éagsúla. Chuige sin tá na teimpléid easpórtála ag teastáil (is féidir iad a íoslódáil ó `godotenginine.org <https://godotengine.org/>`__, nó is féidir leat iad a thógáil leat féin).
ta: திட்ட மேலாளர், ஆசிரியர் மற்றும் விளையாட்டை செயல்படுத்த அனைத்து வழிகளும் இருப்பதால், அந்த பைனரியை நீங்கள் விரும்பும் எந்த இடத்திலும் நகலெடுக்கவும். இருப்பினும், வெவ்வேறு தளங்களுக்கு ஏற்றுமதி செய்வதற்கான தரவு அதற்கு இல்லை. அதற்காக ஏற்றுமதி வார்ப்புருக்கள் தேவைப்படுகின்றன (இது `kodotengine.org <https://godotengine.org/> __ __ இலிருந்து பதிவிறக்கம் செய்யலாம், அல்லது அவற்றை நீங்களே உருவாக்கலாம்).
tr: Proje Yöneticisi, düzenleyici ve oyunu çalıştırmak için tüm araçları içerdiğinden, bu ikili dosyayı istediğiniz herhangi bir yere kopyalayın. Ancak, farklı platformlara aktarmak için gerekli verilerden yoksundur. Bunun için dışa aktarma şablonlarına ihtiyaç vardır (bunları `godotengine.org <https://godotengine.org/>`__ adresinden indirebilir ya da kendiniz oluşturabilirsiniz).
uk: Скопіюйте цей двійковий файл у будь-яке розташування, оскільки він містить менеджер проекту, редактор і всі засоби для виконання гри. Однак йому бракує даних для експорту на різні платформи. Для цього потрібні шаблони експорту (які можна завантажити з `godotengine.org <https://godotengine.org/>`__, або ви можете створити їх самостійно).

source: Aside from that, there are a few standard options that can be set in all build targets, and which will be explained below.
ga: Seachas sin, tá cúpla rogha caighdeánach ann is féidir a shocrú i ngach sprioc tógála, agus a mhínífear thíos.
ta: அது ஒருபுறம் இருக்க, அனைத்து உருவாக்க இலக்குகளிலும் அமைக்கக்கூடிய சில நிலையான விருப்பங்கள் உள்ளன, அவை கீழே விளக்கப்படும்.
tr: Bunun dışında, tüm derleme hedeflerinde ayarlanabilen ve aşağıda açıklanacak olan birkaç standart seçenek vardır.
uk: Окрім цього, є кілька стандартних параметрів, які можна встановити в усіх цілях збірки, і які будуть пояснені нижче.
zh_cn: 除此之外, 在所有的构建目标平台中有几个标准选项可以进行设置, 下面将对此进行说明.

source: Target
ga: Sprioc
ta: இலக்கு
tr: Hedef
uk: Призначення
zh_cn: 目标

source: The ``target`` option controls if the editor is compiled and debug flags are used. Optimization levels (``optimize``) and whether each build contains debug symbols (``debug_symbols``) is controlled separately from the target. Each mode means:
uk: Опція ``target`` контролює, чи компілюється редактор і чи використовуються прапорці налагодження. Рівні оптимізації (``optimize``) та чи містить кожна збірка символи налагодження (``debug_symbols``) контролюються окремо від цільової об'єкта. Кожен режим означає:

source: ``target=editor``: Build an editor binary (defines ``TOOLS_ENABLED`` and ``DEBUG_ENABLED``)
uk: ``target=editor``: Збірка бінарного файлу редактора (визначення ``TOOLS_ENABLED`` та ``DEBUG_ENABLED``)

source: ``target=template_debug``: Build a debug export template (defines ``DEBUG_ENABLED``)
uk: ``target=template_debug``: Створити шаблон експорту налагодження (визначає ``DEBUG_ENABLED``)

source: ``target=template_release``: Build a release export template
uk: ``target=template_release``: Створити шаблон експорту релізу

source: The editor is enabled by default in all PC targets (Linux, Windows, macOS), disabled for everything else. Disabling the editor produces a binary that can run projects but does not include the editor or the Project Manager.
ga: Tá an t-eagarthóir cumasaithe de réir réamhshocraithe i ngach sprioc PC (Linux, Windows, macOS), díchumasaithe do gach rud eile. Má dhéantar an t-eagarthóir a dhíchumasú, táirgeann sé dénártha a fhéadfaidh tionscadail a rith ach ní chuimsíonn sé an t-eagarthóir ná an Bainisteoir Tionscadail.
ta: எல்லா பிசி இலக்குகளிலும் (லினக்ச், சாளரங்கள், மேகோச்) முன்னிருப்பாக எடிட்டர் இயக்கப்பட்டது, எல்லாவற்றிற்கும் முடக்கப்பட்டுள்ளது. எடிட்டரை முடக்குவது திட்டங்களை இயக்கக்கூடிய ஒரு பைனரியை உருவாக்குகிறது, ஆனால் ஆசிரியர் அல்லது திட்ட மேலாளரை சேர்க்கவில்லை.
tr: Düzenleyici varsayılan olarak tüm PC hedeflerinde (Linux, Windows, macOS) etkinleştirilir, diğer her şey için devre dışı bırakılır. Düzenleyicinin devre dışı bırakılması, projeleri çalıştırabilen ancak düzenleyiciyi veya Proje Yöneticisini içermeyen bir ikili üretir.
uk: Редактор увімкнено за замовчуванням у всіх цільових ПК (Linux, Windows, macOS), вимкнено для всіх інших. Вимкнення редактора створює двійковий файл, який може запускати проекти, але не включає редактор або менеджер проекту.
zh_cn: 所有 PC 目标（Linux、Windows、macOS）上都默认启用了编辑器，其他目标默认禁用。禁用编辑器时得到的二进制文件可以运行项目，但不包含编辑器和项目管理器。

source: The list of :ref:`command line arguments <doc_command_line_tutorial>` available varies depending on the build type.
uk: Список доступних аргументів командного рядка :ref:`command line arguments <doc_command_line_tutorial>` залежить від типу збірки.

source: Development and production aliases
ga: Ainmneacha forbartha agus táirgeachta
ta: வளர்ச்சி மற்றும் விளைவாக்கம் மாற்றுப்பெயர்கள்
tr: Geliştirme ve üretim takma adları
uk: Псевдоніми розробки та виробництва
zh_cn: 开发别名与生产别名

source: When creating builds for development (running debugging/:ref:`profiling <doc_using_cpp_profilers>` tools), you often have different goals compared to production builds (making binaries as fast and small as possible).
ga: Nuair a bhíonn foirgnimh á gcruthú le haghaidh forbartha (debugging/: ref:`profiling <doc_using_cpp_profilers>` uirlisí), is minic a bhíonn spriocanna difriúla agat i gcomparáid le tógálacha táirgeachta (dénártha a dhéanamh chomh tapa agus chomh beag agus is féidir).
ta: வளர்ச்சிக்கான கட்டடங்களை உருவாக்கும் போது (பிழைத்திருத்தத்தை இயக்குதல்/: குறிப்பு: `விவரக்குறிப்பு <doc_using_cpp_profilers>` கருவிகள்), விளைவாக்கம் கட்டமைப்புகளுடன் ஒப்பிடும்போது நீங்கள் பெரும்பாலும் வேறுபட்ட குறிக்கோள்களைக் கொண்டுள்ளீர்கள் (பைனரிகளை முடிந்தவரை வேகமாகவும் சிறியதாகவும் ஆக்குகிறது).
tr: Geliştirme için derlemeler oluştururken (hata ayıklama/:ref:`profil çıkarma <doc_using_cpp_profilers>` araçlarını çalıştırmak), genellikle üretim derlemelerinden farklı hedefleriniz vardır (ikili dosyaları olabildiğince hızlı ve küçük yapmak).
uk: Створюючи збірки для розробки (виконуючи інструменти debugging/:ref:`profiling <doc_using_cpp_profilers>`), ви часто маєте інші цілі порівняно з робочими збірками (створення двійкових файлів якомога швидших і менших).
zh_cn: 针对开发创建构建（运行调试工具或\ :ref:`性能分析 <doc_using_cpp_profilers>`\ 工具）时，你的目的通常与生产构建不同（生产构建要求让二进制文件尽可能又快又小）。

source: Godot provides two aliases for this purpose:
ga: Soláthraíonn Godot dhá ainm chun na críche seo:
ta: இந்த நோக்கத்திற்காக கோடோட் இரண்டு மாற்றுப்பெயர்களை வழங்குகிறது:
tr: Godot bu amaç için iki takma ad sağlar:
uk: Godot пропонує два псевдоніми для цієї мети:
zh_cn: Godot 为此提供了两种别名：

source: ``dev_mode=yes`` is an alias for ``verbose=yes warnings=extra werror=yes tests=yes``. This enables warnings-as-errors behavior (similar to Godot's continuous integration setup) and also builds :ref:`unit tests <doc_unit_testing>` so you can run them locally.
ga: Is ailias é ``dev_mode=tá`` le haghaidh ``verbose=yes warnings=extra werror=tá tástálacha=tá``. Cumasaíonn sé seo iompar rabhadh-mar-earráidí (cosúil le socrú comhtháthaithe leanúnach Godot) agus tógann sé :ref:`tástálacha aonad <doc_unit_testing>` ionas gur féidir leat iad a rith go háitiúil.
ta: `` dev_mode = yes`` என்பது `` verfose = ஆம் எச்சரிக்கைகள் = கூடுதல் werror = ஆம் சோதனைகள் = ஆம்`` என்பதற்கான மாற்றுப்பெயர். இது எச்சரிக்கைகள்-பிழைகள் நடத்தை (கோடோட்டின் தொடர்ச்சியான ஒருங்கிணைப்பு அமைப்பைப் போன்றது) மற்றும் கட்டமைக்கிறது: குறிப்பு: `அலகு சோதனைகள் <doc_unit_testing>` எனவே நீங்கள் அவற்றை உள்ளூரில் இயக்கலாம்.
tr: ``dev_mode=yes``, ``verbose=yes warnings=extra werror=yes tests=yes`` için bir takma addır. Bu, uyarıları-hata-olarak-al davranışını etkinleştirir (Godot'nun sürekli entegrasyon kurulumuna benzer) ve ayrıca :ref:`birim testlerini <doc_unit_testing>` oluşturur, böylece bunları yerel olarak çalıştırabilirsiniz.
uk: ``dev_mode=yes`` — це псевдонім для ``verbose=yes warnings=extra werror=yes tests=yes``. Це вмикає поведінку попереджень як помилок (подібно до налаштування безперервної інтеграції Godot), а також створює :ref:`unit tests <doc_unit_testing>`, щоб ви могли запускати їх локально.
zh_cn: ``dev_mode=yes`` 是 ``verbose=yes warnings=extra werror=yes tests=yes`` 的别名，启用了“将警告当作错误”的行为（与 Godot 的持续集成设置一致），并且会构建\ :ref:`单元测试 <doc_unit_testing>`\ ，这些测试能够在本地运行。

source: ``production=yes`` is an alias for ``use_static_cpp=yes debug_symbols=no lto=auto``. Statically linking libstdc++ allows for better binary portability when compiling for Linux. This alias also enables link-time optimization when compiling for Linux, Web and Windows with MinGW, but keeps LTO disabled when compiling for macOS, iOS or Windows with MSVC. This is because LTO on those platforms is very slow to link or has issues with the generated code.
ga: Is ailias é ``production=yes ``le haghaidh `use_static_cpp=yes debug_symbols=no lto=auto``. Ligeann libstdc ++ a nascadh go statach iniomparthacht dénártha níos fearr agus tú ag tiomsú le haghaidh Linux. Cumasaíonn an t-ailias seo barrfheabhsú ama nasc freisin agus tú ag tiomsú le haghaidh Linux, Web agus Windows le MinGW, ach coinníonn sé LTO míchumasaithe agus é á thiomsú le haghaidh macOS, iOS nó Windows le MSVC. Tá sé seo toisc go bhfuil LTO ar na hardáin sin an-mhall le nascadh nó go bhfuil fadhbanna aige leis an gcód ginte.
ta: `` விளைவாக்கம் = ஆம்`` என்பது `` use_static_cpp = ஆம் debug_symbols = இல்லை LTO = ஆட்டோ`` என்பதற்கான மாற்றுப்பெயர். லினக்சுக்கு தொகுக்கும்போது சிறந்த பைனரி பெயர்வுத்திறனை LIBSTDC ++ ஐ சட்டப்பூர்வமாக இணைப்பது அனுமதிக்கிறது. MINGW உடன் லினக்ச், வலை மற்றும் விண்டோசுக்கு தொகுக்கும்போது இந்த மாற்றுப்பெயர் இணைப்பு நேர தேர்வுமுறையையும் செயல்படுத்துகிறது, ஆனால் MACOS, ஐஇமு அல்லது விண்டோசுக்கு MSVC உடன் தொகுக்கும்போது LTO முடக்கப்பட்டுள்ளது. ஏனென்றால், அந்த தளங்களில் உள்ள எல்.டி.ஓ இணைக்க மிகவும் மெதுவாக உள்ளது அல்லது உருவாக்கப்பட்ட குறியீட்டில் சிக்கல்கள் உள்ளன.
tr: ``production=yes``, ``use_static_cpp=yes debug_symbols=no lto=auto`` için bir takma addır. libstdc++'ı statik olarak bağlamak, Linux için derleme yaparken daha iyi ikili dosya taşınabilirliği sağlar. Bu takma ad ayrıca MinGW ile Linux, Web ve Windows için derleme yaparken bağlama-zamanı optimizasyonunu (LTO) etkinleştirir, ancak macOS, iOS veya MSVC ile Windows için derleme yaparken LTO'yu devre dışı tutar. Bunun nedeni, bu platformlarda LTO'nun çok yavaş bağlanması veya oluşturulan kodla ilgili sorunlar yaşamasıdır.
uk: ``production=yes`` — це псевдонім для ``use_static_cpp=yes debug_symbols=no lto=auto``. Статичне зв’язування libstdc++ забезпечує кращу бінарну переносимість під час компіляції для Linux. Цей псевдонім також дозволяє оптимізувати час підключення під час компіляції для Linux, Web і Windows за допомогою MinGW, але залишає LTO вимкненим під час компіляції для macOS, iOS або Windows за допомогою MSVC. Це тому, що LTO на цих платформах дуже повільно підключається або має проблеми зі згенерованим кодом.
zh_cn: ``production=yes`` 是 ``use_static_cpp=yes debug_symbols=no lto=auto`` 的别名。为 Linux 构建时，静态链接 libstdc++ 可以提升二进制文件的可移植性。在 Linux、Web 和在 Windows 上使用 MinGW 编译时，这个别名还会启用链接时优化（Link-Time Optimization，LTO），而在 macOS、iOS 和在 Windows 上使用 MSVC 编译时 LTO 是禁用的。这是因为这些平台上的 LTO 不是非常缓慢就是生成的代码有问题。
