Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/introduction_to_the_buildsystem.po
Languages: ga, ta, tr, uk, zh_cn

source: It's possible to compile modules residing outside of Godot's directory tree, along with the built-in modules.
ga: Is féidir modúil a thiomsú a chónaíonn lasmuigh de chrann eolaire Godot, mar aon leis na modúil ionsuite.
ta: கட்டோட்டின் அடைவு மரத்திற்கு வெளியே வசிக்கும் தொகுதிகள், உள்ளமைக்கப்பட்ட தொகுதிகள் ஆகியவற்றுடன் தொகுக்க முடியும்.
tr: Yerleşik modüllerin yanı sıra Godot'un dizin ağacının dışında bulunan modülleri de derlemek mümkündür.
uk: Можна скомпілювати модулі, що знаходяться поза деревом каталогів Godot, разом із вбудованими модулями.
zh_cn: 可以编译驻扎在Godot目录树之外的模块, 以及内置模块.

source: A ``custom_modules`` build option can be passed to the command line before compiling. The option represents a comma-separated list of directory paths containing a collection of independent C++ modules that can be seen as C++ packages, just like the built-in ``modules/`` directory.
ga: Is féidir rogha tógála `custom_modules`` a chur chuig an líne ordaithe sula ndéantar é a thiomsú. Léiríonn an rogha liosta de chosáin eolaire scartha le camóg ina bhfuil bailiúchán modúil neamhspleácha C ++ ar féidir iad a fheiceáil mar phacáistí C ++, díreach cosúil leis an eolaire ``modúl/`` ionsuite.
ta: ஒரு `Custom_Modules`` உருவாக்க விருப்பத்தை தொகுக்க முன் கட்டளை வரிக்கு அனுப்பலாம். உள்ளமைக்கப்பட்ட `` தொகுதிகள்/`` கோப்பகத்தைப் போலவே, சி ++ தொகுப்புகளாகக் காணக்கூடிய சுயாதீன சி ++ தொகுதிகளின் தொகுப்பைக் கொண்ட அடைவு பாதைகளின் கமாவால் பிரிக்கப்பட்ட பட்டியலைக் குறிக்கிறது.
tr: Derlemeden önce komut satırına bir ``custom_modules`` derleme seçeneği verilebilir. Bu seçenek, tıpkı yerleşik ``modules/`` dizininde olduğu gibi, C++ paketleri olarak görülebilecek bağımsız C++ modülleri koleksiyonunu içeren virgülle ayrılmış bir dizin yolu listesini temsil eder.
uk: Параметр збірки ``custom_modules`` можна передати в командний рядок перед компіляцією. Параметр представляє розділений комами список шляхів до каталогу, що містить колекцію незалежних модулів C++, які можна розглядати як пакети C++, як і вбудований каталог ``modules/``.
zh_cn: 在编译之前, 可以在命令行中传递一个 ``custom_modules`` 构建选项. 这个选项代表了一个以逗号分隔的目录路径列表, 其中包含了一系列独立的C++模块, 这些模块可以被看作是C++包, 就像内置的 ``modules/`` 目录一样.

source: For instance, it's possible to provide both relative, absolute, and user directory paths containing such modules:
ga: Mar shampla, is féidir cosáin eolaire coibhneasta, iomlána agus úsáideora a sholáthar ina bhfuil modúil den sórt sin:
ta: உதாரணமாக, அத்தகைய தொகுதிகள் கொண்ட உறவினர், முழுமையான மற்றும் பயனர் அடைவு பாதைகளை வழங்க முடியும்:
tr: Örneğin, bu tür modülleri içeren hem göreli, hem mutlak hem de kullanıcı dizini yollarını vermek mümkündür:
uk: Наприклад, можна надати як відносний, абсолютний шлях, так і шлях до каталогу користувача, що містить такі модулі:
zh_cn: 例如, 可以同时提供包含此类模块的相对, 绝对和用户目录路径:

source: If there's any custom module with the exact directory name as a built-in module, the engine will only compile the custom one. This logic can be used to override built-in module implementations.
ga: Má tá aon mhodúl saincheaptha ann leis an ainm eolaire cruinn mar mhodúl ionsuite, ní thiomsóidh an t-inneall ach an ceann saincheaptha. Is féidir an loighic seo a úsáid chun cur i bhfeidhm modúl ionsuite a shárú.
ta: உள்ளமைக்கப்பட்ட தொகுதியாக சரியான அடைவு பெயருடன் ஏதேனும் தனிப்பயன் தொகுதி இருந்தால், இயந்திரம் தனிப்பயன் ஒன்றை மட்டுமே தொகுக்கும். உள்ளமைக்கப்பட்ட தொகுதி செயலாக்கங்களை மேலெழுத இந்த தர்க்கத்தைப் பயன்படுத்தலாம்.
tr: Yerleşik bir modülle aynı dizin adına sahip herhangi bir özel modül varsa, motor yalnızca özel olanı derleyecektir. Bu mantık, yerleşik modül uyarlamalarının üzerine yazmak için kullanılabilir.
uk: Якщо є будь-який настроюваний модуль із точною назвою каталогу як вбудований модуль, система скомпілює лише настроюваний модуль. Цю логіку можна використовувати для заміни реалізацій вбудованих модулів.
zh_cn: 如果有任何自定义模块的目录名与内置模块的目录名完全相同, 引擎将只编译自定义模块. 这个逻辑可以用来覆盖内置模块的实现.

source: Cleaning generated files
ga: Glanadh comhaid ghintear
ta: உருவாக்கப்பட்ட கோப்புகளை தூய்மை செய்தல்
tr: Oluşturulan dosyaları temizleme
uk: Очищення створених файлів
zh_cn: 清理生成的文件

source: Sometimes, you may encounter an error due to generated files being present. You can remove them by using ``scons --clean <options>``, where ``<options>`` is the list of build options you've used to build Godot previously.
ga: Uaireanta, seans go dtiocfaidh earráid ort mar gheall ar na comhaid a ghintear a bheith i láthair. Is féidir leat iad a bhaint trí úsáid a bhaint as ``scons --clean <options>``, áit a bhfuil `` <options>`` ar an liosta de na roghanna tógála a d'úsáid tú chun Godot a thógáil roimhe seo.
ta: சில நேரங்களில், உருவாக்கப்பட்ட கோப்புகள் இருப்பதால் பிழையை நீங்கள் சந்திக்க நேரிடும். `` ச்கான்கள் -கிளீன் <விருப்பங்கள்> `` ஐப் பயன்படுத்தி அவற்றை அகற்றலாம், அங்கு `` <விருப்பங்கள்> `` என்பது நீங்கள் முன்பு கோடோட்டை உருவாக்க பயன்படுத்திய உருவாக்க விருப்பங்களின் பட்டியல்.
tr: Bazen, oluşturulan dosyaların mevcut olması nedeniyle bir hatayla karşılaşabilirsiniz. Bunları ``scons --clean <seçenekler>`` kullanarak kaldırabilirsiniz; burada ``<seçenekler>`` daha önce Godot'yu derlemek için kullandığınız derleme seçeneklerinin listesidir.
uk: Іноді ви можете зіткнутися з помилкою через наявність згенерованих файлів. Ви можете видалити їх за допомогою ``scons --clean <options>``, де ``<options>`` це список параметрів побудови, які ви використовували для створення Godot раніше.
zh_cn: 有时, 你可能会遇到一个错误, 因为生成的文件存在. 你可以使用``scons --clean <options>``删除它们, 其中 ``<options>`` 是你之前用来构建Godot的构建选项列表.

source: Alternatively, you can use ``git clean -fixd`` which will clean build artifacts for all platforms and configurations. Beware, as this will remove all untracked and ignored files in the repository. Don't run this command if you have uncommitted work!
ga: Nó is féidir leat ``git clean -fixd`` a úsáid a ghlanfaidh déantáin tógála do gach ardán agus cumraíocht. Bí cúramach, mar bainfidh sé seo gach comhad neamhrianaithe agus neamhaird a dhéantar neamhaird orthu sa stór. Ná reáchtáil an t-ordú seo má tá obair neamhthiomanta agat!
ta: மாற்றாக, நீங்கள் `` அறிவிலி தூய்மையான -பிக்ச் டி`` ஐப் பயன்படுத்தலாம், இது அனைத்து தளங்களுக்கும் உள்ளமைவுகளுக்கும் கட்டமைப்புகளை உருவாக்கும். கவனமாக, ஏனெனில் இது களஞ்சியத்தில் கட்டுப்படுத்தப்படாத மற்றும் புறக்கணிக்கப்பட்ட அனைத்து கோப்புகளையும் அகற்றும். உங்களிடம் சேர்க்கப்படாத வேலை இருந்தால் இந்த கட்டளையை இயக்க வேண்டாம்!
tr: Alternatif olarak, tüm platformlar ve yapılandırmalar için derleme yapılarını temizleyecek olan ``git clean -fixd`` kullanabilirsiniz. Bu işlem depodaki tüm izlenmemiş ve göz ardı edilmiş dosyaları da kaldıracağından dikkatli olun. İşlemesi yapılmamış işiniz varsa bu komutu çalıştırmayın!
uk: Крім того, ви можете використовувати ``git clean -fixd``, який очистить артефакти збірки для всіх платформ і конфігурацій. Будьте обережні, оскільки це видалить усі невідстежувані та проігноровані файли зі сховища. Не запускайте цю команду, якщо у вас є незакріплена робота!
zh_cn: 或者, 你也可以使用``git clean -fixd``来清理所有平台和配置的构建工件. 注意, 这将删除版本库中所有未跟踪和忽略的文件. 如果你有未提交的工作, 请不要运行这个命令！

source: Other build options
ga: Roghanna tógála eile
ta: பிற உருவாக்க விருப்பங்கள்
tr: Diğer derleme seçenekleri
uk: Інші параметри збирання
zh_cn: 其他构建选项

source: There are several other build options that you can use to configure the way Godot should be built (compiler, debug options, etc.) as well as the features to include/disable.
ga: Tá roinnt roghanna tógála eile ann is féidir leat a úsáid chun an bealach ba chóir Godot a thógáil a chumrú (tiomsaitheoir, roghanna dífhabhtaithe, srl.) Chomh maith leis na gnéithe le cuimsithe/díchumasú.
ta: கோடோட் கட்டப்பட வேண்டிய விதத்தை உள்ளமைக்க நீங்கள் பயன்படுத்தக்கூடிய பல உருவாக்க விருப்பங்கள் உள்ளன (கம்பைலர், பிழைத்திருத்த விருப்பங்கள் போன்றவை) அத்துடன் சேர்க்க/முடக்க வேண்டிய நற்பொருத்தங்கள்.
tr: Godot'un oluşturulma şeklini (derleyici, hata ayıklama seçenekleri, vb.) ve dahil edilecek/devre dışı bırakılacak özellikleri yapılandırmak için kullanabileceğiniz başka derleme seçenekleri de vardır.
uk: Існує кілька інших параметрів збірки, які ви можете використовувати, щоб налаштувати спосіб збирання Godot (компілятор, параметри налагодження тощо), а також функції, які потрібно включити/вимкнути.
zh_cn: 你还可以使用其他几个构建选项来配置Godot的构建方式(编译器, 调试选项等), 以及要包含/禁用的功能.

source: Check the output of ``scons --help`` for details about each option for the version you are willing to compile.
ga: Seiceáil aschur ``scons --help`` le haghaidh sonraí faoi gach rogha don leagan atá tú sásta a thiomsú.
ta: நீங்கள் தொகுக்க விரும்பும் பதிப்பிற்கான ஒவ்வொரு விருப்பத்தையும் பற்றிய விவரங்களுக்கு `` ச்கான்ச் - -எல்ப்`` இன் வெளியீட்டைச் சரிபார்க்கவும்.
tr: Derlemek istediğiniz sürümün her bir seçeneği hakkında ayrıntılı bilgi için ``scons --help`` çıktısını kontrol edin.
uk: Перевірте висновок ``scons --help``, щоб дізнатися більше про кожну опцію для версії, яку ви бажаєте скомпілювати.
zh_cn: 检查 ``scons --help`` 的输出, 以获取有关你愿意编译的版本的每个选项的详细信息.

source: Overriding the build options
ga: Sárú ar na roghanna tógála
ta: உருவாக்க விருப்பங்களை மீறுகிறது
tr: Derleme seçeneklerinin üstüne yazma
uk: Перевизначення параметрів збірки
zh_cn: 重写构建选项

source: Using a file
ga: Ag baint úsáide as comhad
ta: ஒரு கோப்பைப் பயன்படுத்துதல்
tr: Bir dosya kullanarak
uk: Використання файлу
zh_cn: 使用文件

source: The default ``custom.py`` file can be created at the root of the Godot Engine source to initialize any SCons build options passed via the command line:
ga: Is féidir an comhad réamhshocraithe ``custom.py` a chruthú ag fréamh foinse Inneall Godot chun aon roghanna tógála SCons a rith tríd an líne ordaithe a thosú:
ta: இயல்புநிலை `` Custom.py`` கோப்பை கோடோட் என்சின் மூலத்தின் மூலத்தில் உருவாக்க முடியும், எந்தவொரு ச்கான்களையும் துவக்க கட்டளை வரி வழியாக அனுப்பப்பட்ட விருப்பங்களை உருவாக்குதல்:
tr: Varsayılan ``custom.py`` dosyası, komut satırı aracılığıyla aktarılan SCons derleme seçeneklerini ilk değerleri ayarlamak için Godot Engine kaynağının kökünde oluşturulabilir:
uk: Файл ``custom.py`` за замовчуванням можна створити в корені вихідного коду Godot Engine для ініціалізації будь-яких параметрів збірки SCons, переданих через командний рядок:
zh_cn: 默认的 ``custom.py`` 文件可以在Godot引擎源的根部创建, 以初始化任何通过命令行传递的SCons构建选项:

source: You can also disable some of the built-in modules before compiling, saving some time it takes to build the engine. See :ref:`doc_optimizing_for_size` page for more details.
ta: தொகுக்கப்படுவதற்கு முன் சில உள்ளமைக்கப்பட்ட தொகுதிகள் முடக்கலாம், இயந்திரத்தை உருவாக்க சிறிது நேரம் சேமிக்கும். காண்க: குறிப்பு: மேலும் விவரங்களுக்கு `doc_optimiging_for_size` பக்கம்.
uk: Ви також можете вимкнути деякі вбудовані модулі перед компіляцією, заощаджуючи час, необхідний для збирання механізму. Додаткову інформацію див. на сторінці :ref:`doc_optimizing_for_size`.

source: You can use the online `Godot build options generator <https://godot-build-options-generator.github.io/>`__ to generate a ``custom.py`` file containing SCons options. You can then save this file and place it at the root of your Godot source directory.
ga: Is féidir leat an gineadóir roghanna tógála Godot ar líne <https://godot-build-options-generator.github.io/>`__ a úsáid chun comhad ``custom.py`` a ghiniúint ina bhfuil roghanna SCons. Is féidir leat an comhad seo a shábháil ansin agus é a chur ag bun do eolaire foinse Godot.
ta: ச்கான்ச் விருப்பங்களைக் கொண்ட `` custom.py`` கோப்பை உருவாக்க நிகழ்நிலை `கோடோட் பில்ட் விருப்பங்கள் செனரேட்டர் <https://godot-build-options-generator.github.io/> __ ஐப் பயன்படுத்தலாம். நீங்கள் இந்த கோப்பைச் சேமித்து உங்கள் கோடோட் மூல கோப்பகத்தின் வேரில் வைக்கலாம்.
tr: SCons seçeneklerini içeren bir ``custom.py`` dosyası oluşturmak için çevrimiçi `Godot seçenek üreteci oluşturucu <https://godot-build-options-generator.github.io/>`__ 'yu kullanabilirsiniz. Daha sonra bu dosyayı kaydedebilir ve Godot kaynak dizininizin kök dizinine yerleştirebilirsiniz.
uk: Ви можете використати онлайн-генератор параметрів збірки Godot <https://godot-build-options-generator.github.io/>`__, щоб створити файл ``custom.py``, що містить параметри SCons. Потім ви можете зберегти цей файл і розмістити його в корені вихідного каталогу Godot.
zh_cn: 你可以使用在线 `Godot 构建选项生成器 <https://godot-build-options-generator.github.io/>`__ , 生成一个包含SCons选项的 ``custom.py`` 文件. 然后你可以保存这个文件, 并将其放在Godot源目录的根目录下.

source: Another custom file can be specified explicitly with the ``profile`` command line option, both overriding the default build configuration:
ga: Is féidir comhad saincheaptha eile a shonrú go sainráite leis an rogha líne ordaithe ``próifíl``, a sháraíonn an chumraíocht tógála réamhshocraithe:
ta: மற்றொரு தனிப்பயன் கோப்பை `` சுயவிவரம்` கட்டளை வரி விருப்பத்துடன் வெளிப்படையாக குறிப்பிடலாம், இவை இரண்டும் இயல்புநிலை உருவாக்க உள்ளமைவை மீறுகின்றன:
tr: Başka bir özel dosya ``profile`` komut satırı seçeneği ile açıkça belirtilebilir ve her ikisi de varsayılan derleme yapılandırmasının üzerine yazar:
uk: Інший спеціальний файл можна вказати явно за допомогою параметра командного рядка ``profile``, обидва замінюють конфігурацію збірки за замовчуванням:
zh_cn: 另一个自定义文件可以用 ``profile`` 命令行选项明确指定, 都会覆盖默认的构建配置:

source: Build options set from the file can be overridden by the command line options.
ga: Is féidir na roghanna líne ordaithe a shárú roghanna tógála atá leagtha amach ón gcomhad.
ta: கோப்பிலிருந்து அமைக்கப்பட்ட விருப்பங்களை கட்டளை வரி விருப்பங்களால் மேலெழுதலாம்.
tr: Dosyadan ayarlanan derleme seçeneklerinin komut satırı seçenekleri tarafından üzerine yazılabilir.
uk: Параметри збірки, встановлені з файлу, можуть бути перевизначені параметрами командного рядка.
zh_cn: 从文件中设置的构建选项可以被命令行选项所覆盖.

source: It's also possible to override the options conditionally:
ga: Is féidir freisin na roghanna a shárú go coinníollach:
ta: நிபந்தனையுடன் விருப்பங்களை மேலெழுதவும் முடியும்:
tr: Seçeneklerin koşullu olarak üzerine yazmak mümkündür:
uk: Також можна умовно змінити параметри:
zh_cn: 也可以有条件地重写这些选项:

source: Using the SCONSFLAGS
ga: Ag baint úsáide as an SCONSFLAGS
ta: ச்கான்ச்ஃப்ளாக்சைப் பயன்படுத்துதல்
tr: SCONSFLAGS kullanarak
uk: Використання SCONSFLAGS
zh_cn: 使用SCONSFLAGS

source: ``SCONSFLAGS`` is an environment variable which is used by the SCons to set the options automatically without having to supply them via the command line.
ga: Is athróg comhshaoil é ``SCONSFLAGS` a úsáideann na SCons chun na roghanna a shocrú go huathoibríoch gan iad a sholáthar tríd an líne ordaithe.
ta: `` Sconsflags`` என்பது ஒரு சுற்றுச்சூழல் மாறியாகும், இது கட்டளை வரி வழியாக அவற்றை வழங்காமல் விருப்பங்களை தானாக அமைக்க SCON களால் பயன்படுத்தப்படுகிறது.
tr: ``SCONSFLAGS``, SCons tarafından kullanılan seçenekleri komut satırından vermeye gerek kalmadan otomatik olarak ayarlamak için kullanılan bir ortam değişkenidir.
uk: ``SCONSFLAGS`` — це змінна середовища, яка використовується SCons для автоматичного встановлення параметрів без необхідності вказувати їх через командний рядок.
zh_cn: ``SCONSFLAGS`` 是一个环境变量,SCons用来自动设置选项, 而无需通过命令行提供.

source: For instance, you may want to force a number of CPU threads with the aforementioned ``-j`` option for all future builds:
ga: Mar shampla, b'fhéidir gur mhaith leat roinnt snáitheanna LAP a chur i bhfeidhm leis an rogha “-j” thuasluaite do gach tógáil amach anseo:
ta: உதாரணமாக, எதிர்கால கட்டடங்களுக்கும் மேற்கூறிய `` -j`` விருப்பத்துடன் பல சிபியு நூல்களை நீங்கள் கட்டாயப்படுத்த விரும்பலாம்:
tr: Örneğin, gelecekteki tüm yapılar için yukarıda belirtilen ``-j`` seçeneğiyle belirli bir sayıda CPU iş parçacığını zorlamak isteyebilirsiniz:
uk: Наприклад, ви можете захотіти примусово використовувати кілька потоків процесора за допомогою вищезгаданого параметра ``-j`` для всіх майбутніх збірок:
zh_cn: 例如你可能会想要让后续的构建都使用前面提到的 ``-j`` 选项来强制使用特定数量的 CPU 线程：

source: SCU (single compilation unit) build
ga: SCU (aonad tiomsaithe aonair) a thógáil
ta: SCU (ஒற்றை தொகுப்பு அலகு) உருவாக்க
tr: SCU (tek derleme birimi) derlemesi
uk: Збірка SCU (один блок компіляції)
zh_cn: SCU（单编译单元）构建

source: Regular builds tend to be bottlenecked by including large numbers of headers in each compilation translation unit. Primarily to speed up development (rather than for production builds), Godot offers a "single compilation unit" build (aka "Unity / Jumbo" build).
ga: Is gnách go gcuirtear strug ar thógáil rialta trí líon mór ceanntásca a áireamh i ngach aonad aistriúcháin tiomsaithe. Go príomha chun forbairt a bhrostú (seachas le haghaidh tógála táirgeachta), cuireann Godot tógáil “aonad tiomsaithe aonair” ar fáil (aka tógáil “Unity/Jumbo”).
ta: ஒவ்வொரு தொகுப்பு மொழிபெயர்ப்பு பிரிவிலும் அதிக எண்ணிக்கையிலான தலைப்புகளைச் சேர்ப்பதன் மூலம் வழக்கமான கட்டடங்கள் தடுமாறுகின்றன. முதன்மையாக வளர்ச்சியை விரைவுபடுத்துவதற்காக (உற்பத்தி கட்டமைப்பிற்கு பதிலாக), கோடோட் ஒரு "ஒற்றை தொகுப்பு அலகு" பில்டை (அக்கா "யூனிட்டி / சம்போ" உருவாக்கம்) வழங்குகிறது.
tr: Normal derlemeler, her derleme çeviri birimine çok sayıda başlık eklenmesi nedeniyle darboğaza girme eğilimindedir. Öncelikle geliştirmeyi hızlandırmak için (üretim derlemelerinden ziyade), Godot bir "tek derleme birimi /single compilation unit" derlemesi (diğer adıyla "Unity / Jumbo" derlemesi) sunar.
uk: Звичайні збірки, як правило, є вузькими місцями, включаючи велику кількість заголовків у кожну одиницю перекладу компіляції. В першу чергу для прискорення розробки (а не для збірок виробництва), Godot пропонує збірку «єдиного модуля компіляції» (така ж збірка «Unity / Jumbo»).
zh_cn: 普通构建的瓶颈通常在于每个编译翻译单元都包含了大量的头文件。为了加速开发（并非针对生产构建），Godot 提供了“单编译单元”构建（也叫“统一构建”或“巨型构建”）。

source: For the folders accelerated by this option, multiple ``.cpp`` files are compiled in each translation unit, so headers can be shared between multiple files, which can dramatically decrease build times.
ga: Maidir leis na fillteáin a luathnaíonn an rogha seo, tiomsaítear ilchomhaid `.cpp` i ngach aonad aistriúcháin, ionas gur féidir ceannteidil a roinnt idir comhad iolracha, rud a d'fhéadfadh amanna tógála a laghdú go suntasach.
ta: இந்த விருப்பத்தால் துரிதப்படுத்தப்பட்ட கோப்புறைகளுக்கு, ஒவ்வொரு மொழிபெயர்ப்பு அலகுகளிலும் பல `` .CPP`` கோப்புகள் தொகுக்கப்படுகின்றன, எனவே பல கோப்புகளுக்கு இடையில் தலைப்புகள் பகிரப்படலாம், அவை உருவாக்க நேரங்களை வியத்தகு முறையில் குறைக்கலாம்.
tr: Bu seçenekle hızlandırılan klasörler için, her çeviri biriminde birden fazla ``.cpp`` dosyası derlenir, böylece başlıklar birden fazla dosya arasında paylaşılabilir ve bu da derleme sürelerini önemli ölçüde azaltabilir.
uk: Для папок, прискорених за допомогою цього параметра, кілька файлів ``.cpp`` компілюються в кожну одиницю перекладу, тому заголовки можуть бути спільними для кількох файлів, що може значно скоротити час створення.
zh_cn: 在能够被该选项加速的文件夹中，每个翻译单元都会编译多个 ``.cpp`` 文件，因此头文件会在多个文件之间共享，从而大幅降低编译时长。

source: To perform an SCU build, use the ``scu_build=yes`` SCons option.
ga: Chun tógáil SCU a dhéanamh, bain úsáid as an rogha ``scu_build=yes ``SCons.
ta: SCU கட்டமைப்பைச் செய்ய, `` SCU_BUILD = ஆம்`` ச்கான் விருப்பத்தைப் பயன்படுத்தவும்.
tr: Bir SCU derlemesi gerçekleştirmek için ``scu_build=yes`` SCons seçeneğini kullanın.
uk: Щоб виконати збірку SCU, використовуйте параметр SCons ``scu_build=yes``.
zh_cn: 要进行 SCU 构建，请使用 Scons 选项 ``scu_build=yes``\ 。

source: When developing a Pull Request using SCU builds, be sure to make a regular build prior to submitting the PR. This is because SCU builds by nature include headers from earlier ``.cpp`` files in the translation unit, therefore won't catch all the includes you will need in a regular build. The CI will catch these errors, but it will usually be faster to catch them on a local build on your machine.
ta: SCU கட்டமைப்புகளைப் பயன்படுத்தி இழுப்பு கோரிக்கையை உருவாக்கும் போது, PR ஐ சமர்ப்பிப்பதற்கு முன்பு வழக்கமான கட்டமைப்பை உருவாக்க மறக்காதீர்கள். ஏனென்றால், எச்.சி.யு இயற்கையால் உருவாக்கப்படுவதால், மொழிபெயர்ப்பு பிரிவில் முந்தைய `` .CPP`` கோப்புகளின் தலைப்புகள் அடங்கும், எனவே வழக்கமான கட்டமைப்பில் உங்களுக்குத் தேவையான அனைத்தையும் பெறாது. தொஒ இந்த பிழைகளைப் பிடிக்கும், ஆனால் உங்கள் கணினியில் உள்ளக கட்டமைப்பில் அவற்றைப் பிடிக்க இது பொதுவாக வேகமாக இருக்கும்.
uk: Розробляючи Pull Request за допомогою збірок SCU, обов’язково зробіть регулярну збірку перед подачею PR. Це пояснюється тим, що збірки SCU за своєю природою включають заголовки з попередніх файлів ``.cpp`` в одиниці перекладу, тому не вловлюють усі включення, які вам знадобляться у звичайній збірці. КІ виловить ці помилки, але зазвичай це буде швидше виявити їх у локальній збірці на вашій машині.

source: Export templates
ga: Easpórtáil teimpléid
ta: ஏற்றுமதி வார்ப்புருக்கள்
tr: Dışa aktarım şablonları
uk: Шаблони експорту
zh_cn: 导出模板

source: Official export templates are downloaded from the Godot Engine site: `godotengine.org <https://godotengine.org/>`__. However, you might want to build them yourself (in case you want newer ones, you are using custom modules, or simply don't trust your own shadow).
ga: Déantar teimpléid oifigiúla easpórtála a íoslódáil ó shuíomh Godot Engine: `godotengine.org <https://godotengine.org/>`__. Mar sin féin, b'fhéidir gur mhaith leat iad a thógáil leat féin (ar eagla go dteastaíonn cinn níos nuaí uait, tá modúil saincheaptha á n-úsáid agat, nó níl muinín agat as do scáth féin).
ta: உத்தியோகபூர்வ ஏற்றுமதி வார்ப்புருக்கள் கோடோட் என்சின் தளத்திலிருந்து பதிவிறக்கம் செய்யப்படுகின்றன: `kodotengine.org <https://godotengine.org/> __. __. இருப்பினும், அவற்றை நீங்களே உருவாக்க விரும்பலாம் (நீங்கள் புதியவற்றை விரும்பினால், நீங்கள் தனிப்பயன் தொகுதிகளைப் பயன்படுத்துகிறீர்கள், அல்லது உங்கள் சொந்த நிழலை நம்ப வேண்டாம்).
tr: Resmi dışa aktarma şablonları Godot Engine sitesinden indirilebilir: `godotengine.org <https://godotengine.org/>`__. Ancak, bunları kendiniz derlemek isteyebilirsiniz (daha yenilerini istiyorsanız, özel modüller kullanıyorsanız veya sadece kendi gölgenize bile güvenmiyorsanız).
uk: Офіційні шаблони експорту завантажуються з сайту Godot Engine: `godotengine.org <https://godotengine.org/>`__. Однак ви можете створити їх самостійно (якщо вам потрібні новіші, ви використовуєте власні модулі або просто не довіряєте власній тіні).
zh_cn: 官方的导出模板可以从 `Godot 的官方网站 <https://godotengine.org/>`__ 下载到. 此外, 你可能想要自己构建它们(可能想要构建更新的版本, 要使用自定义模块, 不信任我们编译的包是否安全).

source: If you download the official export templates package and unzip it, you will notice that most files are optimized binaries or packages for each platform:
ga: Má dhéanann tú an pacáiste teimpléid onnmhairithe oifigiúil a íoslódáil agus é a dhízipeáil, tabharfaidh tú faoi deara go bhfuil an chuid is mó de na comhaid dénártha nó pacáistí optamaithe le haghaidh gach ardán:
ta: நீங்கள் அதிகாரப்பூர்வ ஏற்றுமதி வார்ப்புருக்கள் தொகுப்பை பதிவிறக்கம் செய்து அதை அவிழ்த்துவிட்டால், பெரும்பாலான கோப்புகள் ஒவ்வொரு தளத்திற்கும் உகந்த பைனரிகள் அல்லது தொகுப்புகள் என்பதை நீங்கள் கவனிப்பீர்கள்:
tr: Resmi dışa aktarma şablonları paketini indirip açarsanız, çoğu dosyanın her platform için optimize edilmiş ikili dosyalar veya paketler olduğunu fark edeceksiniz:
uk: Якщо ви завантажите офіційний пакет шаблонів експорту та розпакуєте його, ви помітите, що більшість файлів є оптимізованими двійковими файлами або пакетами для кожної платформи:
zh_cn: 如果下载官方导出模板程序包并解压缩, 你会注意到大多数文件都是针对每个平台的优化二进制文件或程序包:
