Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/creating_movies.po
Languages: fr, ga, it, ru, ta, uk

source: Creating movies
fr: Créer des films
ga: Cruthú scannáin
it: Creare film
ru: Создание фильмов
ta: திரைப்படங்களை உருவாக்குதல்
uk: Створення фільмів

source: Godot can record **non-real-time** video and audio from any 2D or 3D project. This kind of recording is also called *offline rendering*. There are many scenarios where this is useful:
ga: Is féidir le Godot físeán agus fuaime** neamh-fhíor-aim** a thaifeadadh ó aon tionscadal 2D nó 3D. Tugtar taifeadta den chineál seo *léiriú as linne* freisin. Tá go leor cásanna ann ina bhfuil sé seo úsáideach:
it: Godot può registrare video e audio **non in tempo reale** da qualsiasi progetto 2D o 3D. Questo tipo di registrazione è anche chiamato *rendering offline*. Sono molti gli scenari in cui può rivelarsi utile:
ru: Godot может записывать видео и аудио из любого 2D- или 3D-проекта **не в режиме реального времени**. Этот вид записи также называется **offline рендерингом**. Существует множество сценариев, в которых это полезно:
ta: எந்தவொரு 2 டி அல்லது 3 டி திட்டத்திலிருந்தும் ** உண்மையான நேரமற்ற ** வீடியோ மற்றும் ஆடியோவை கோடோட் பதிவு செய்யலாம். இந்த வகையான பதிவு *ஆஃப்லைன் வழங்குதல் *என்றும் அழைக்கப்படுகிறது. இது பயனுள்ளதாக இருக்கும் பல காட்சிகள் உள்ளன:
uk: Godot може записувати **не в реальному часі** відео та аудіо з будь-якого 2D або 3D проекту. Цей тип запису також називається *автономним рендерингом*. Є багато сценаріїв, коли це корисно:

source: Recording game trailers for promotional use.
fr: Enregistrer des bandes-annonces de jeu pour une utilisation promotionnelle.
ga: Taifeadadh leantóirí cluiche le haghaidh úsáide bolscaireachta.
it: Registrare trailer di gioco per uso promozionale.
ru: Запись игровых трейлеров для рекламных целей.
ta: விளம்பர பயன்பாட்டிற்காக விளையாட்டு டிரெய்லர்களை பதிவு செய்தல்.
uk: Запис трейлерів ігор для рекламного використання.

source: Recording cutscenes that will be :ref:`displayed as pre-recorded videos <doc_playing_videos>` in the final game. This allows for using higher quality settings (at the cost of file size), regardless of the player's hardware.
ga: Gearrscannáin á dtaifeadadh a thaispeánfar :ref:`mar fhíseáin réamhthaifeadta <doc_playing_videos>` sa chluiche deiridh. Ligeann sé seo socruithe ar chaighdeán níos airde a úsáid (ar chostas méid comhaid), beag beann ar chrua-earraí an imreora.
it: Registrare cutscene che verranno :ref:`visualizzati come video preregistrati <doc_playing_videos>` nel gioco finale. Questo consente di utilizzare impostazioni di qualità più elevate (a scapito delle dimensioni del file), indipendentemente dall'hardware del giocatore.
ru: Запись роликов, которые будут :ref:`displayed as pre-recorded videos <doc_playing_videos>` в финальной игре. Это позволяет использовать более высокие настройки качества (за счет размера файла) независимо от аппаратного обеспечения проигрывателя.
ta: கட்ச்கீன்களைப் பதிவுசெய்தல்: ref: `இறுதி விளையாட்டில் முன் பதிவு செய்யப்பட்ட வீடியோக்களாக <doc_playing_videos> ஆகக் காட்டப்படுகிறது. பிளேயரின் வன்பொருளைப் பொருட்படுத்தாமல், உயர் தரமான அமைப்புகளை (கோப்பு அளவு செலவில்) பயன்படுத்த இது அனுமதிக்கிறது.
uk: Запис роликів, які :ref:`displayed as pre-recorded videos <doc_playing_videos>` у фінальній грі. Це дозволяє використовувати параметри вищої якості (ціною розміру файлу), незалежно від апаратного забезпечення програвача.

source: Recording procedurally generated animations or motion design. User interaction remains possible during video recording, and audio can be included as well (although you won't be able to hear it while the video is recording).
ga: Beochan nó dearadh gluaisne a ghintear go nós imeachta a thai Tá idirghníomhaíocht úsáideora fós indéanta le linn taifeadta físe, agus is féidir fuaim a áireamh freisin (cé nach mbeidh tú in ann é a chloisteáil agus an físeán á thaifeadadh).
it: Registrazione di animazioni generate proceduralmente o motion design. L'interazione con l'utente rimane possibile durante la registrazione video e può essere incluso anche l'audio (anche se non sarà possibile ascoltarlo durante la registrazione).
ru: Запись процедурно сгенерированной анимации или анимационного дизайна. Во время записи видео сохраняется возможность взаимодействия с пользователем, а также может быть включен звук (хотя вы не сможете его услышать во время записи видео).
ta: நடைமுறை ரீதியாக உருவாக்கப்பட்ட அனிமேசன்கள் அல்லது இயக்க வடிவமைப்பைப் பதிவு செய்தல். வீடியோ பதிவின் போது பயனர் தொடர்பு சாத்தியமாகும், மேலும் ஆடியோவையும் சேர்க்கலாம் (வீடியோ பதிவு செய்யும் போது நீங்கள் அதைக் கேட்க முடியாது என்றாலும்).
uk: Запис процедурно створеної анімації або дизайну руху. Взаємодія з користувачем залишається можливою під час запису відео, а також можна включити аудіо (хоча ви не зможете його почути під час запису відео).

source: Comparing the visual output of graphics settings, shaders, or rendering techniques in an animated scene.
ga: Ag comparáid idir aschur amhairc socruithe grafaicí, scáthóirí, nó teicnící rindreála i radharc beoite.
ru: Сравнение визуальных результатов использования графических настроек, шейдеров или методов рендеринга в анимированной сцене.
ta: அனிமேசன் செய்யப்பட்ட காட்சியில் கிராபிக்ச் அமைப்புகள், சேடர்கள் அல்லது வழங்குதல் நுட்பங்களின் காட்சி வெளியீட்டை ஒப்பிடுதல்.
uk: Порівняння візуального результату налаштувань графіки, шейдерів або методів візуалізації в анімованій сцені.

source: With Godot's animation features such as the AnimationPlayer node, Tweeners, particles and shaders, it can effectively be used to create any kind of 2D and 3D animations (and still images).
ga: Le gnéithe beochana Godot mar an nód AnimationPlayer, Tweeners, cáithníní agus scáthóirí, is féidir é a úsáid go héifeachtach chun beochan 2D agus 3D de chineál ar bith (agus íomhánna fosta) a chruthú.
it: Grazie alle funzionalità di animazione di Godot, come il nodo AnimationPlayer, i Tweener, le particelle e gli shader, è possibile creare effettivamente qualsiasi tipo di animazione 2D e 3D (e immagini fisse).
ru: Благодаря функциям анимации Godot, таким как узел AnimationPlayer, Tweeners, частицы и шейдеры, его можно эффективно использовать для создания любых видов 2D и 3D анимации (и неподвижных изображений).
ta: கோடோட்டின் அனிமேசன் அம்சங்களான அனிமேசன் பிளேயர் முனை, ட்வீனர்கள், துகள்கள் மற்றும் சேடர்கள் போன்றவற்றுடன், இது 2D மற்றும் 3D அனிமேசன்களை (மற்றும் இன்னும் படங்கள்) உருவாக்க திறம்பட பயன்படுத்தப்படலாம்.
uk: Завдяки анімаційним функціям Godot, таким як вузол AnimationPlayer, Tweeners, частинки та шейдери, його можна ефективно використовувати для створення будь-яких типів 2D та 3D анімацій (і нерухомих зображень).

source: If you are already used to Godot's workflow, you may find yourself more productive by using Godot for video rendering compared to Blender. That said, renderers designed for non-real-time usage such as Cycles and Eevee can result in better visuals (at the cost of longer rendering times).
ga: Má tá tú cleachtaithe cheana le sreabhadh oibre Godot cheana féin, b'fhéidir go mbeidh tú níos táirgiúla trí Godot a úsáid le haghaidh rindreáil físe i gcomparáid le Blender. É sin ráite, is féidir le léiritheoirí atá deartha le haghaidh úsáide neamh-fhíor-ama mar Cycles agus Eevee a bheith mar thoradh ar radhairc níos fearr (ar chostas amanna rindreála níos faide).
ru: Если вы уже привыкли к рабочему процессу Godot, возможно, использование Godot для рендеринга видео будет более продуктивным по сравнению с Blender. Тем не менее, средства визуализации, предназначенные для использования не в режиме реального времени, такие как Cycles и Eevee, могут улучшить визуальные эффекты (за счет увеличения времени рендеринга).
ta: நீங்கள் ஏற்கனவே கோடோட்டின் பணிப்பாய்வுடன் பழகிவிட்டால், பிளெண்டருடன் ஒப்பிடும்போது வீடியோ ரெண்டரிங்கிற்கு கோடோட்டைப் பயன்படுத்துவதன் மூலம் நீங்கள் அதிக விளைவாக்கம் செய்வதைக் காணலாம். சுழற்சிகள் மற்றும் ஈவீ போன்ற நிகழ்நேர அல்லாத பயன்பாட்டிற்காக வடிவமைக்கப்பட்ட ரெண்டரர்கள் சிறந்த காட்சிகளை ஏற்படுத்தும் (நீண்ட வழங்குதல் நேரங்களின் செலவில்).
uk: Якщо ви вже звикли до робочого процесу Godot, ви можете виявити, що ви зможете працювати продуктивніше, використовуючи Godot для рендерингу відео порівняно з Blender. Тим не менш, рендерери, призначені для використання не в реальному часі, такі як Cycles і Eevee, можуть призвести до кращих візуальних ефектів (ціною довшого часу рендерингу).

source: Compared to real-time video recording, some advantages of non-real-time recording include:
ga: I gcomparáid le fístaifeadadh fíor-ama, áirítear ar roinnt buntáistí a bhaineann le taifeadadh neamh-ama:
ru: По сравнению с видеозаписью в реальном времени, некоторые преимущества записи не в реальном времени включают:
ta: நிகழ்நேர வீடியோ பதிவோடு ஒப்பிடும்போது, உண்மையான நேரமற்ற பதிவின் சில நன்மைகள் பின்வருமாறு:
uk: Порівняно із записом відео в реальному часі деякі переваги запису не в реальному часі включають:

source: Use any graphics settings (including extremely demanding settings) regardless of your hardware's capabilities. The output video will *always* have perfect frame pacing; it will never exhibit dropped frames or stuttering. Faster hardware will allow you to render a given animation in less time, but the visual output remains identical.
ga: Úsáid aon socruithe grafaicí (lena n-áirítear socruithe thar a bheith éilimh) beag beann ar chumais do chru Beidh luas fráma foirfe ag an bhfíseán aschuir* i gcónaí*; ní thaispeánfaidh sé frámaí titim nó stuttering riamh. Ligfidh crua-earraí níos tapúla duit beochan ar leith a rinneadh i níos lú ama, ach fanann an t-aschur amhairc comhionann.
ru: Используйте любые настройки графики (в том числе настройки, требующие повышенных требований), независимо от возможностей вашего оборудования. В выходном видео *всегда* будет идеальная последовательность кадров; в нем никогда не будет пропущенных кадров или заикания. Более быстрое аппаратное обеспечение позволит вам отрисовать заданную анимацию за меньшее время, но визуальный результат останется идентичным.
ta: உங்கள் வன்பொருளின் திறன்களைப் பொருட்படுத்தாமல் எந்த கிராபிக்ச் அமைப்புகளையும் (மிகவும் தேவைப்படும் அமைப்புகள் உட்பட) பயன்படுத்தவும். வெளியீட்டு வீடியோ * எப்போதும் * சரியான பிரேம் வேகக்கட்டுப்பாட்டைக் கொண்டிருக்கும்; இது ஒருபோதும் கைவிடப்பட்ட பிரேம்கள் அல்லது திணறலை வெளிப்படுத்தாது. குறைந்த நேரத்தில் கொடுக்கப்பட்ட அனிமேசனை வழங்க வேகமான வன்பொருள் உங்களை அனுமதிக்கும், ஆனால் காட்சி வெளியீடு ஒரே மாதிரியாக உள்ளது.
uk: Використовуйте будь-які налаштування графіки (включаючи надзвичайно вимогливі налаштування) незалежно від можливостей вашого обладнання. Вихідне відео *завжди* матиме ідеальну частоту кадрів; він ніколи не демонструватиме випадання кадрів або заїкання. Швидше апаратне забезпечення дозволить вам відтворити певну анімацію за менший час, але візуальний результат залишиться ідентичним.

source: Render at a higher resolution than the screen resolution, without having to rely on driver-specific tools such as NVIDIA's Dynamic Super Resolution or AMD's Virtual Super Resolution.
ga: Rinneadh ag taifeach níos airde ná taifeach an scáileáin, gan a bheith ag brath ar uirlisí a bhaineann go sonrach le tiománaí mar Super Resolution Dinimiciúil NVIDIA nó Super Réiteach Fíorúil AMD.
ru: Выполняйте рендеринг с разрешением, превышающим разрешение экрана, без необходимости полагаться на специальные инструменты для драйверов, такие как NVIDIA's Dynamic Super Resolution или AMD's Virtual Super Resolution.
ta: என்விடியாவின் மாறும் சூப்பர் தீர்மானம் அல்லது AMD இன் மெய்நிகர் சூப்பர் தெளிவுத்திறன் போன்ற இயக்கி-குறிப்பிட்ட கருவிகளை நம்பாமல், திரை தெளிவுத்திறனை விட அதிக தெளிவுத்திறனை வழங்கவும்.
uk: Візуалізація з роздільною здатністю, вищою за роздільну здатність екрана, без необхідності покладатися на спеціальні інструменти драйвера, такі як Dynamic Super Resolution від NVIDIA або Virtual Super Resolution від AMD.

source: Render at a higher framerate than the video's target framerate, then :ref:`post-process to generate high-quality motion blur <doc_creating_movies_motion_blur>`. This also makes effects that converge over several frames (such as temporal antialiasing, SDFGI and volumetric fog) look better.
ga: Rindreáil ag ráta fráma níos airde ná spriocráta fráma an fhíseáin, ansin :tag:`iar-phróiseas chun geamhú gluaisne d'ardchaighdeán a ghiniúint <doc_creating_movies_motion_blur>`. Fágann sé seo go bhfuil cuma níos fearr ar éifeachtaí a thagann le chéile thar roinnt frámaí (amhail frithaliasú ama, SDFGI agus ceo toirtmhéadrach).
ru: Выполните рендеринг с частотой кадров, превышающей целевую частоту кадров видео, затем :ref:`post-process to generate high-quality motion blur <doc_creating_movies_motion_blur>`. Это также улучшает видимость эффектов, которые сходятся на нескольких кадрах (таких как временное сглаживание, SDFGI и объемный туман).
ta: வீடியோவின் இலக்கு பிரேம்ரேட்டை விட அதிக ஃப்ரேம்ரேட்டில் வழங்கவும், பின்னர்: குறிப்பு: `உயர் தரமான இயக்க மங்கலை உருவாக்க பிந்தைய செயல்முறை <doc_creating_movies_motion_blur>`. இது பல பிரேம்களில் (தற்காலிக ஆன்டியாலியாசிங், எச்.டி.எஃப்.சி.ஐ மற்றும் வால்யூமெட்ரிக் மூடுபனி போன்றவை) ஒன்றிணைக்கும் விளைவுகளையும் சிறப்பாகக் காட்டுகிறது.
uk: Візуалізація з вищою частотою кадрів, ніж цільова частота кадрів відео, а потім :ref:`post-process to generate high-quality motion blur <doc_creating_movies_motion_blur>`. Завдяки цьому ефекти, які збігаються в кількох кадрах (наприклад, тимчасове згладжування, SDFGI та об’ємний туман), виглядають краще.

source: **This feature is not designed for capturing real-time footage during gameplay.**
ga: ** Níl an ghné seo deartha chun píosa scannáin fíor-ama a ghabháil le linn gameplay. **
it: **Questa funzionalità non è progettata per catturare riprese in tempo reale durante il gioco.**
ru: ** Эта функция не предназначена для съемки видео в реальном времени во время игрового процесса.**
ta: ** இந்த நற்பொருத்தம் விளையாட்டின் போது நிகழ்நேர காட்சிகளைக் கைப்பற்ற வடிவமைக்கப்படவில்லை. **
uk: **Ця функція не призначена для зйомки кадрів у реальному часі під час гри.**

source: Players should use something like `OBS Studio <https://obsproject.com/>`__ or `SimpleScreenRecorder <https://www.maartenbaert.be/simplescreenrecorder/>`__ to record gameplay videos, as they do a much better job at intercepting the compositor than Godot can do using Vulkan or OpenGL natively.
ga: Ba cheart d’imreoirí rud éigin cosúil le `OBS Studio <https://obsproject.com/>`__ nó `SimpleScreenRecorder <https://www.maartenbaert.be/simplescreenrecorder/>`__ a úsáid chun físeáin gameplay a thaifeadadh, mar go ndéanann siad i bhfad níos fearr post ag idircheapadh an chumadóra ná mar is féidir Godot a dhéanamh ag baint úsáide as Vulkan nó OpenGL dúchais.
ru: Игрокам следует использовать что-то вроде `OBS Studio <https://obsproject.com/>`__ или `SimpleScreenRecorder <https://www.maartenbaert.be/simplescreenrecorder/>`__ для записи игровых видеороликов, поскольку они гораздо лучше справляются с работой композитора, чем Godot, использующий Vulkan или OpenGL нативно.
ta: வீரர்கள் `OBS ச்டுடியோ <https://obsproject.com/>` __ அல்லது `சிம்பிள்ச்கிரீன் ரெக்கார்டர் <https://www.maartenbeart.be/simplescreenrecorder/> __ விளையாட்டு வீடியோக்களை பதிவு செய்ய மிகவும் சிறப்பாகச் செய்ய வேண்டும் கோடோட்டை விட இசையமைப்பாளரை இடைமறிப்பதில் வேலை வல்கன் அல்லது ஓபன்சிஎல்லைப் பயன்படுத்த முடியும்.
uk: Гравцям слід використовувати щось на зразок `OBS Studio <https://obsproject.com/>`__ або `SimpleScreenRecorder <https://www.maartenbaert.be/simplescreenrecorder/>`__ для запису ігрового відео, оскільки вони роблять набагато краще роботу з перехоплення композитора, ніж Godot може виконати за допомогою Vulkan або OpenGL.

source: That said, if your game runs at near-real-time speeds when capturing, you can still use this feature (but it will lack audible sound playback, as sound is saved directly to the video file).
ga: É sin ráite, má ritheann do chluiche ag luasanna beagnach fíor-ama agus tú ag gabháil, is féidir leat an ghné seo a úsáid fós (ach ní bheidh athsheinm fuaime inchloiste aige, toisc go sábhálfar fuaim go díreach chuig an gcomhad físe).
ru: Тем не менее, если при съемке ваша игра работает со скоростью, близкой к реальному времени, вы все равно можете использовать эту функцию (но при этом не будет воспроизводиться слышимый звук, так как звук сохраняется непосредственно в видеофайл).
ta: கைப்பற்றும் போது உங்கள் விளையாட்டு நிகழ்நேர வேகத்தில் இயங்கினால், நீங்கள் இன்னும் இந்த அம்சத்தைப் பயன்படுத்தலாம் (ஆனால் ஒலி நேரடியாக வீடியோ கோப்பில் சேமிக்கப்படுவதால், அதைக் கேட்கக்கூடிய ஒலி பின்னணி இல்லாதது).
uk: Тим не менш, якщо під час зйомки ваша гра працює зі швидкістю, наближеною до реального часу, ви все одно можете використовувати цю функцію (але вона не відтворюватиме звук, оскільки звук зберігається безпосередньо у відеофайлі).

source: Enabling Movie Maker mode
fr: Activation du mode Création de film
ga: Cumasú mód Déantóir Scanná
ru: Включение режима создания фильмов
ta: மூவி மேக்கர் பயன்முறையை செயல்படுத்துகிறது
uk: Увімкнення режиму Movie Maker

source: To enable Movie Maker mode, click the "movie reel" button in the top-right corner of the editor *before* running the project:
fr: Pour activer le mode Création de film, cliquez sur le bouton "Bobine de film" dans le coin supérieur droit de l'éditeur *avant* d'exécuter le projet :
ga: Chun modh Movie Maker a chumasú, cliceáil ar an gcnaipe “ríl scannáin” sa chúinne barr ar dheis den eagarthóir* roimh reáchtáil an tionscadal:
ru: Чтобы включить режим Movie Maker, нажмите кнопку "movie reel" в правом верхнем углу редактора *перед* запуском проекта:
ta: மூவி மேக்கர் பயன்முறையை இயக்க, எடிட்டரின் மேல்-வலது மூலையில் உள்ள "மூவி ரீல்" பொத்தானைக் சொடுக்கு செய்க * திட்டத்தை இயக்குவதற்கு முன் *:
uk: Щоб увімкнути режим Movie Maker, клацніть кнопку «мультфільм» у верхньому правому куті редактора *перед* запуском проекту:

source: Movie Maker mode is disabled, click the "movie reel" icon to enable
fr: Le mode Création de film est désactivé, cliquez sur l'icône "Bobine de film" pour l'activer
ga: Tá modh Movie Maker míchumasaithe, cliceáil ar an deilbhín “ríl scannáin” chun cumasú
ru: Режим "Movie Maker" отключен, нажмите на значок "movie reel", чтобы включить его
ta: மூவி மேக்கர் பயன்முறை முடக்கப்பட்டுள்ளது, இயக்க "மூவி ரீல்" ஐகானைக் சொடுக்கு செய்க
uk: Режим Movie Maker вимкнено, клацніть піктограму «кінороліка», щоб увімкнути

source: A menu will be displayed with options to enable Movie Maker mode and to go to the settings. The icon gets a background matching the accent color when Movie Maker mode is enabled:
ru: Откроется меню с опциями включения режима Movie Maker и перехода к настройкам. При включении режима Movie Maker фон значка будет соответствовать цветовому акценту:

source: Movie Maker mode is enabled, click the "movie reel" icon again to disable
fr: Le Mode Création de film est activé, cliquez à nouveau sur l'icône "Bobine de film" pour le désactiver
ga: Tá modh Movie Maker cumasaithe, cliceáil ar an deilbhín “ríl scannáin” arís chun díchumasú
ru: Режим Movie Maker включен. Чтобы отключить его, снова нажмите на значок "movie reel" («Кинолента»)
ta: மூவி மேக்கர் பயன்முறை இயக்கப்பட்டிருக்கிறது, முடக்க மீண்டும் "மூவி ரீல்" ஐகானைக் சொடுக்கு செய்க
uk: Режим Movie Maker увімкнено, ще раз клацніть піктограму «кінороліка», щоб вимкнути його

source: Movie Maker status is **not** persisted when the editor quits, so you must re-enable Movie Maker mode again after restarting the editor if needed.
fr: Le mode Création de film n'est **pas** gardé lorsque l'éditeur quitte, donc vous devez réactiver le mode Création de film après avoir redémarré l'éditeur si besoin.
ga: Ní leanann stádas Movie Maker ** nuair a éiríonn an t-eagarthóir, mar sin caithfidh tú modh Movie Maker a athchumasú arís tar éis duit an t-eagarthóir a atosú más gá.
ru: Состояние Movie Maker **не** сохраняется при выходе из редактора, поэтому при необходимости вам придется снова включить режим Movie Maker после перезапуска редактора.
ta: எடிட்டர் வெளியேறும்போது மூவி மேக்கர் நிலை ** அல்ல ** தொடர்ந்தது, எனவே தேவைப்பட்டால் எடிட்டரை மறுதொடக்கம் செய்த பிறகு நீங்கள் மீண்டும் திரைப்பட தயாரிப்பாளர் பயன்முறையை மீண்டும் இயக்க வேண்டும்.
uk: Статус Movie Maker **не** зберігається під час виходу з редактора, тому за потреби потрібно повторно ввімкнути режим Movie Maker після перезапуску редактора.

source: Toggling Movie Maker mode while running the project will not have any effect until the project is restarted.
fr: Activer le mode Création de film lors de l'exécution du projet n'aura aucun effet tant que le projet n'aura pas redémarré.
ga: Ní bheidh aon éifeacht ag modh Movie Maker Toggling agus an tionscadal á rith go dtí go ndéanfar an tionscadal a athosú.
ru: Переключение режима Movie Maker во время работы проекта не даст никакого эффекта до тех пор, пока проект не будет перезапущен.
ta: திட்டத்தை இயக்கும் போது மூவி மேக்கர் பயன்முறையை மாற்றுவது திட்டம் மறுதொடக்கம் செய்யப்படும் வரை எந்த விளைவையும் ஏற்படுத்தாது.
uk: Перемикання режиму Movie Maker під час виконання проекту не матиме ефекту, доки проект не буде перезапущено.

source: Before you can record video by running the project, you still need to configure the output file path. This path can be set for all scenes in the Project Settings:
ga: Sula féidir leat físeán a thaifeadadh tríd an tionscadal a rith, ní mór duit an cosán comhad aschuir a chumrú fós Is féidir an cosán seo a shocrú do gach radharc i Socruithe an Tionscadail:
ru: Прежде чем записывать видео, запустив проект, необходимо настроить путь к выходному файлу. Этот путь можно задать для всех сцен в настройках проекта:
ta: திட்டத்தை இயக்குவதன் மூலம் வீடியோவைப் பதிவுசெய்ய முன், நீங்கள் இன்னும் வெளியீட்டு கோப்பு பாதையை உள்ளமைக்க வேண்டும். திட்ட அமைப்புகளில் உள்ள அனைத்து காட்சிகளுக்கும் இந்த பாதை அமைக்கப்படலாம்:
uk: Перш ніж ви зможете записувати відео, запускаючи проект, вам все одно потрібно налаштувати вихідний шлях до файлу. Цей шлях можна встановити для всіх сцен у налаштуваннях проекту:

source: Movie Maker project settings (with Advanced toggle enabled)
fr: Paramètres Création de film du projet (avec les paramètres avancés activés)
ga: Socruithe tionscadail Movie Maker (le toggle Advanced cumasaithe)
it: Impostazioni del progetto per Movie Maker (con impostazioni avanzate abilitate)
ru: Настройки проекта Movie Maker (с включенным переключателем «Дополнительно»)
ta: மூவி மேக்கர் திட்ட அமைப்புகள் (மேம்பட்ட மாற்று இயக்கப்பட்டவை)
uk: Налаштування проекту Movie Maker (з увімкненим перемикачем Advanced)
