Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/creating_movies.po
Languages: fr, ga, it, ru, ta, uk

source: If you need to encode directly to a different format or pipe a stream through third-party software, you can extend the MovieWriter class to create your own movie writers. This should typically be done using GDExtension for performance reasons.
ga: Más gá duit ionchódú go díreach chuig formáid eile nó sruth a phíobáil trí bhogearraí tríú páirtí, is féidir leat an rang MovieWriter a leathnú chun do scríbhneoirí scannáin féin a chruthú. Ba cheart é seo a dhéanamh de ghnáth trí úsáid a bhaint as GDEExtension ar chúiseanna feidhmíochta.
ru: Если вам нужно напрямую кодировать видео в другой формат или направлять поток через стороннее ПО, вы можете расширить класс MovieWriter, чтобы создать собственные модули записи фильмов. Обычно для этого используется GDExtension из соображений производительности.
ta: நீங்கள் நேரடியாக வேறு வடிவத்திற்கு குறியாக்க வேண்டும் அல்லது மூன்றாம் தரப்பு மென்பொருளின் மூலம் ஒரு ச்ட்ரீமை குழாய் செய்ய வேண்டும் என்றால், உங்கள் சொந்த திரைப்பட எழுத்தாளர்களை உருவாக்க நீங்கள் MovieWriter வகுப்பை நீட்டிக்கலாம். செயல்திறன் காரணங்களுக்காக Gdextension ஐப் பயன்படுத்தி இது பொதுவாக செய்யப்பட வேண்டும்.
uk: Якщо вам потрібно закодувати безпосередньо в інший формат або передати потік через стороннє програмне забезпечення, ви можете розширити клас MovieWriter, щоб створити власні автори фільмів. Зазвичай це слід робити за допомогою GDExtension з міркувань продуктивності.

source: Configuration
ga: Cumraíocht
it: Conﬁgurazione
ru: Конфигурация
ta: உள்ளமைவு
uk: Налаштування

source: In the **Editor > Movie Writer** section of the Project Settings, there are several options you can configure. Some of them are only visible after enabling the **Advanced** toggle in the top-right corner of the Project Settings dialog.
ga: Sa rannán **Eagarthóir > Scríbhneoir Scannán** de Shocruithe an Tionscadail, tá roinnt roghanna is féidir leat a chumrú. Ní bhíonn cuid acu le feiceáil ach amháin tar éis don scorán **Ardleibhéal** a chumasú sa chúinne uachtarach ar dheis den dialóg Socruithe Tionscadail.
ru: В разделе **Editor > Movie Writer** в настройках проекта можно настроить несколько параметров. Некоторые из них становятся видны только после включения переключателя **Advanced** в правом верхнем углу диалогового окна настроек проекта.
ta: திட்ட அமைப்புகளின் ** எடிட்டர்> திரைப்பட எழுத்தாளர் ** பிரிவில், நீங்கள் கட்டமைக்க பல விருப்பங்கள் உள்ளன. திட்ட அமைப்புகள் உரையாடலின் மேல்-வலது மூலையில் ** மேம்பட்ட ** மாற்றத்தை இயக்கிய பின்னரே அவற்றில் சில தெரியும்.
uk: У розділі **Редактор > Сценарист фільму** у параметрах проекту є кілька параметрів, які можна налаштувати. Деякі з них відображаються лише після ввімкнення перемикача **Додатково** у верхньому правому куті діалогового вікна налаштувань проекту.

source: **Mix Rate Hz:** The audio mix rate to use in the recorded audio when writing a movie. This can be different from the project's mix rate, but this value must be divisible by the recorded FPS to prevent audio from desynchronizing over time.
ga: ** Ráta Measc Hz: ** An ráta meascáin fuaime le húsáid san fhuaim taifeadta agus scannán á scríobh. Is féidir leis seo a bheith difriúil ó ráta measctha an tionscadail, ach caithfidh an luach seo a bheith inroinnte leis an FPS taifeadta chun fuaim a chosc ó dhí-incronú le himeacht ama.
ru: **Mix Rate Hz:** Частота микширования звука, используемая в записанном аудио при создании фильма. Она может отличаться от частоты микширования проекта, но это значение должно быть кратно записанной частоте кадров в секунду, чтобы предотвратить рассинхронизацию звука со временем.
ta: ** கலவை வீத HZ: ** ஒரு திரைப்படத்தை எழுதும் போது பதிவுசெய்யப்பட்ட ஆடியோவில் பயன்படுத்த ஆடியோ கலவை வீதம். இது திட்டத்தின் கலவை வீதத்திலிருந்து வேறுபட்டிருக்கலாம், ஆனால் காலப்போக்கில் ஆடியோ தேய்மானம் செய்வதைத் தடுக்க இந்த மதிப்பு பதிவுசெய்யப்பட்ட எஃப்.பி.எச்சால் வகுக்கப்பட வேண்டும்.
uk: **Швидкість змішування, Гц:** Швидкість змішування аудіо для використання в записаному аудіо під час написання фільму. Це може відрізнятися від швидкості змішування проекту, але це значення має ділитися на записану частоту кадрів в секунду, щоб запобігти десинхронізації звуку з часом.

source: **Speaker Mode:** The speaker mode to use in the recorded audio when writing a movie (stereo, 5.1 surround or 7.1 surround).
fr: **Mode de haut-parleur :** Le mode de haut-parleur à utiliser dans l'audio enregistré lors de la création d'un film (stereo, 5.1 surround ou 7.1 surround).
ga: ** Mód Cainteoir: ** An modh cainteoir le húsáid san fhuaim taifeadta agus scannán á scríobh (steirió, timpeallacht 5.1 nó timpeallacht 7.1).
ru: **Speaker Mode:** Режим динамиков, который будет использоваться в записанном звуке при создании фильма (стерео, объемный звук 5.1 или объемный звук 7.1).
ta: ** ச்பீக்கர் பயன்முறை: ** ஒரு திரைப்படத்தை எழுதும் போது பதிவுசெய்யப்பட்ட ஆடியோவில் பயன்படுத்த வேண்டிய ச்பீக்கர் பயன்முறை (ச்டீரியோ, 5.1 சரவுண்ட் அல்லது 7.1 சரவுண்ட்).
uk: **Режим динаміка:** Режим динаміка для використання в записаному аудіо під час написання фільму (стерео, об’ємний звук 5.1 або об’ємний звук 7.1).

source: **Video Quality:** The image quality to use when writing a video to an OGV or AVI file, between ``0.01`` and ``1.0`` (inclusive). Higher quality values result in better-looking output at the cost of larger file sizes. Recommended quality values are between ``0.75`` and ``0.9``. Even at quality ``1.0``, compression remains lossy. This setting does not affect audio quality and is ignored when writing to a PNG image sequence.
fr: **Qualité vidéo :** La qualité de l'image à utiliser lors de l'écriture d'une vidéo dans un fichier OGV ou AVI, entre ``0,01`` et ``1,0`` (y compris). Des valeurs de qualité plus élevées entraînent une meilleure performance au coût de plus grandes tailles de fichiers. Les valeurs de qualité recommandées sont entre ``0,75`` et ``0,9`` . Même à la qualité ``1.0``, la compression reste avec pertes. Ce paramètre n'affecte pas la qualité audio et est ignoré lors de l'écriture vers une séquence d'images PNG.
ru: **MJPEG Quality:** Качество JPEG, используемое при записи видео в AVI-файл, в диапазоне от ``0.01`` до ``1.0`` (включительно). Более высокие значения качества обеспечивают более качественное изображение за счёт увеличения размера файла. Рекомендуемые значения качества находятся в диапазоне от ``0.75`` до ``0.9``. Даже при качестве ``1.0`` сжатие JPEG остаётся с потерями. Этот параметр не влияет на качество звука и игнорируется при записи в последовательность изображений PNG.

source: **Movie File:** The output path for the movie. This can be absolute or relative to the project root.
fr: **Fichier du film :** Le chemin de sortie du film. Cela peut être absolu ou relatif à la racine du projet.
ga: ** Comhad Scannán: ** An cosán aschuir don scannán. Is féidir leis seo a bheith iomlán nó coibhneasta le fréamh an tionscadail.
ru: **Movie File:** Путь к выходному файлу фильма. Может быть абсолютным или относительным к корню проекта.
ta: ** மூவி கோப்பு: ** திரைப்படத்திற்கான வெளியீட்டு பாதை. இது முழுமையான அல்லது திட்ட மூலத்துடன் தொடர்புடையதாக இருக்கலாம்.
uk: **Файл фільму:** вихідний шлях для фільму. Це може бути абсолютним або відносним до кореня проекту.

source: **Disable V-Sync:** If enabled, requests V-Sync to be disabled when writing a movie. This can speed up video writing if the hardware is fast enough to render, encode and save the video at a framerate higher than the monitor's refresh rate. This setting has no effect if the operating system or graphics driver forces V-Sync with no way for applications to disable it.
ga: **Díchumasaigh V-Sync:** Má tá sé cumasaithe, iarrann sé go ndéanfaí V-Sync a dhíchumasú agus scannán á scríobh. Is féidir leis seo scríbhneoireacht físeáin a bhrostú má tá na crua-earraí tapa go leor chun an físeán a sholáthar, a ionchódú agus a shábháil ar ráta fráma níos airde ná ráta athnuachana an mhonatóra. Níl aon éifeacht ag an socrú seo má chuireann an córas oibriúcháin nó an tiománaí grafaicí brú ar V-Sync gan aon bhealach chun feidhmchláir a dhíchumasú.
ru: **Disable V-Sync:** При включении запрашивает отключение вертикальной синхронизации при записи фильма. Это может ускорить запись видео, если оборудование достаточно быстрое для рендеринга, кодирования и сохранения видео с частотой кадров выше частоты обновления монитора. Этот параметр не работает, если операционная система или графический драйвер принудительно включают вертикальную синхронизацию и приложения не могут её отключить.
ta: ** வி-ஒத்திசைவை முடக்கு: ** இயக்கப்பட்டிருந்தால், ஒரு திரைப்படத்தை எழுதும் போது வி-ஒத்திசைவை முடக்குமாறு கோருகிறது. மானிட்டரின் புதுப்பிப்பு வீதத்தை விட அதிகமான பிரேம்ரேட்டில் வீடியோவை வழங்கவும், குறியாக்கம் செய்யவும் மற்றும் சேமிக்கவும் வன்பொருள் வேகமாக இருந்தால் இது வீடியோ எழுத்தை விரைவுபடுத்தும். இயக்க முறைமை அல்லது கிராபிக்ச் டிரைவர் வி-ஒத்திசைவை பயன்பாடுகள் முடக்க எந்த வழியும் இல்லாமல் இந்த அமைப்பு எந்த விளைவையும் ஏற்படுத்தாது.
uk: **Вимкнути V-Sync:** якщо ввімкнено, під час написання фільму вимагається вимкнути V-Sync. Це може пришвидшити запис відео, якщо апаратне забезпечення достатньо швидке для рендерингу, кодування та збереження відео з частотою кадрів, вищою за частоту оновлення монітора. Цей параметр не діє, якщо операційна система або графічний драйвер примусово вмикає V-Sync, але програми не можуть вимкнути його.

source: **FPS:** The rendered frames per second in the output movie. Higher values result in smoother animation, at the cost of longer rendering times and larger output file sizes. Most video hosting platforms do not support FPS values higher than 60, but you can use a higher value and use that to generate motion blur.
ga: **FPS: ** Na frámaí rindreáilte in aghaidh an tsoicind sa scannán aschuir. Mar thoradh ar luachanna níos airde bíonn beochan níos réidh, ar chostas amanna rindreála níos faide agus méideanna comhaid aschuir níos mó. Ní thacaíonn an chuid is mó d'ardáin óstála físe le luachanna FPS níos airde ná 60, ach is féidir leat luach níos airde a úsáid agus é sin a úsáid chun doiléir gluaisne a ghiniúint.
ru: **FPS:** Количество кадров в секунду, отрендеренных в выходном фильме. Более высокие значения обеспечивают более плавную анимацию за счёт увеличения времени рендеринга и размера выходного файла. Большинство видеохостингов не поддерживают значения FPS выше 60, но вы можете использовать более высокое значение для создания эффекта размытия в движении.
ta: ** FPS: ** வெளியீட்டு திரைப்படத்தில் நொடிக்கு வழங்கப்பட்ட பிரேம்கள். அதிக மதிப்புகள் மென்மையான அனிமேசனை விளைவிக்கின்றன, நீண்ட வழங்குதல் நேரங்கள் மற்றும் பெரிய வெளியீட்டு கோப்பு அளவுகள். பெரும்பாலான வீடியோ ஓச்டிங் தளங்கள் 60 ஐ விட அதிகமான FPS மதிப்புகளை ஆதரிக்காது, ஆனால் நீங்கள் அதிக மதிப்பைப் பயன்படுத்தலாம் மற்றும் இயக்க மங்கலை உருவாக்க அதைப் பயன்படுத்தலாம்.
uk: **FPS:** Відтворені кадри за секунду у вихідному відео. Вищі значення забезпечують плавнішу анімацію за рахунок довшого часу візуалізації та більшого розміру вихідного файлу. Більшість платформ відеохостингу не підтримують значення FPS, вищі за 60, але ви можете використовувати вище значення та використовувати його для створення розмиття руху.

source: **Audio Quality:** The audio quality to use when writing a video to an OGV file, between ``-0.1`` and ``1.0`` (inclusive). Higher quality values result in better audio quality at the cost of very slightly larger file sizes. Recommended quality values are between ``0.3`` and ``0.5``. Even at quality ``1.0``, compression remains lossy.
ru: **MJPEG Quality:** Качество JPEG, используемое при записи видео в AVI-файл, в диапазоне от ``0.01`` до ``1.0`` (включительно). Более высокие значения качества обеспечивают более качественное изображение за счёт увеличения размера файла. Рекомендуемые значения качества находятся в диапазоне от ``0.75`` до ``0.9``. Даже при качестве ``1.0`` сжатие JPEG остаётся с потерями. Этот параметр не влияет на качество звука и игнорируется при записи в последовательность изображений PNG.

source: **Encoding Speed:** The speed level to use when writing a video to an OGV file. Faster speed levels have less compression efficiency. The image quality stays barely the same.
it: **Velocità di codifica:** Il livello di velocità da utilizzare durante la scrittura di un video in un file OGV. Livelli di velocità più elevati comportano una minore efficienza di compressione. La qualità dell'immagine rimane pressoché invariata.
ru: **Encoding Speed:** Скорость, используемая при записи видео в файл OGV. Более высокие скорости снижают эффективность сжатия. Качество изображения практически не меняется.

source: **Keyframe Interval:** Also known as GOP (Group Of Pictures), the maximum number of inter-frames to use when writing to an OGV file. Higher values can improve compression efficiency without quality loss but at the cost of slower video seeks.
ru: **Keyframe Interval:** Также известный как GOP (Group Of Pictures), максимальное количество межкадровых интервалов, используемых при записи в файл OGV. Более высокие значения могут повысить эффективность сжатия без потери качества, но за счёт более медленного поиска видео.

source: When using the ``disabled`` or ``2d`` :ref:`stretch modes <doc_multiple_resolutions>`, the output file's resolution is set by the window size. Make sure to resize the window *before* the splash screen has ended. For this purpose, it's recommended to adjust the **Display > Window > Size > Window Width Override** and **Window Height Override** advanced project settings.
ga: Agus na modhanna ``disabled`` nó ``2d`` :ref:`sínte <doc_multiple_resolutions>` in úsáid, socraítear taifeach an chomhaid aschuir de réir mhéid na fuinneoige. Déan cinnte méid na fuinneoige a athrú *roimh* chríochnaíonn an splancscáileán. Chun na críche sin, moltar na hardsocruithe tionscadail **Taispeáin > Fuinneog > Méid > Sárú Leithead Fuinneog** agus **Sárú Airde Fuinneog** a choigeartú.
ru: При использовании режимов ``disabled`` или ``2d`` :ref:`stretch modes <doc_multiple_resolutions>` , разрешение выходного файла определяется размером окна. Обязательно измените размер окна *до* завершения отображения заставки. Для этого рекомендуется настроить расширенные параметры проекта **Display > Window > Size > Window Width Override** и **Window Height Override**.
ta: `` முடக்கப்பட்ட`` அல்லது `` 2d``: ref: `முறைகளை நீட்டவும் <doc_multiple_resolutions>`, வெளியீட்டு கோப்பின் தீர்மானம் சாளர அளவால் அமைக்கப்படுகிறது. ச்பிளாச் திரை முடிந்துவிட்டதற்கு முன் * சாளரத்தை மறுஅளவிடுவதை உறுதிசெய்க. இந்த நோக்கத்திற்காக, ** காட்சி> சாளரம்> அளவு> சாளர அகலம் மேலெழுதல் ** மற்றும் ** சாளர உயரம் மேலெழுதல் ** மேம்பட்ட திட்ட அமைப்புகளை சரிசெய்ய பரிந்துரைக்கப்படுகிறது.
uk: У разі використання режимів ``disabled`` або ``2d`` :ref:`stretch <doc_multiple_resolutions>` роздільна здатність вихідного файлу встановлюється розміром вікна. Обов’язково змініть розмір вікна *до того, як заставка завершиться. Для цього рекомендується налаштувати розширені параметри проекту **Дисплей > Вікно > Розмір > Заміна ширини вікна** і **Заміна висоти вікна**.

source: See also :ref:`doc_creating_movies_recording_at_higher_resolution`.
fr: Voir aussi :ref:`doc_creating_movies_recording_at_higher_resolution`.
ga: Féach freis:ref: `doc_creating_movies_recording_at_higher_resolution`.
ru: Ознакомьтесь так же с :ref:`doc_creating_movies_recording_at_higher_resolution`.
ta: மேலும் காண்க: ref: `doc_creating_movies_recording_at_higher_resolution`.
uk: Дивіться також :ref:`doc_creating_movies_recording_at_higher_resolution`.

source: Quitting Movie Maker mode
fr: Quitter le mode Création de film
ga: Modh Déantóir Scannán a scor
ru: Выход из режима Movie Maker
ta: மூவி மேக்கர் பயன்முறையை விட்டு வெளியேறுதல்
uk: Вихід із режиму Movie Maker

source: To safely quit a project that is using Movie Maker mode, use the X button at the top of the window, or call ``get_tree().quit()`` in a script. You can also use the ``--quit-after N`` command line argument where ``N`` is the number of frames to render before quitting.
fr: Pour quitter en toute sécurité un projet utilisant le mode Création de film, utilisez le bouton X en haut de la fenêtre, ou appelez ``get_tree().quit()`` dans un script. Vous pouvez également utiliser l' argument de ligne de commande ``-quit-after N`` où ``N`` est le nombre de trames à rendre avant de quitter.
ga: Chun tionscadal atá ag úsáid modh Movie Maker a scor go sábháilte, bain úsáid as an gcnaipe X ag barr na fuinneoige, nó glaoigh ar `get_tree () .quit () `i script. Is féidir leat an argóint líne ordaithe ``--quit-after N`` a úsáid freisin inar é ``N`` líon na bhfrámaí atá le déanamh sula scoirfidh tú.
ru: Чтобы безопасно выйти из проекта, использующего режим Movie Maker, используйте кнопку X в верхней части окна или вызовите ``get_tree().quit()`` в скрипте. Вы также можете использовать аргумент командной строки ``--quit-after N``, где ``N`` — количество кадров для рендеринга перед выходом.
ta: மூவி மேக்கர் பயன்முறையைப் பயன்படுத்தும் ஒரு திட்டத்தை பாதுகாப்பாக விட்டுவிட, சாளரத்தின் மேற்புறத்தில் உள்ள ஃச் பொத்தானைப் பயன்படுத்தவும் அல்லது `` get_tree () ஐ அழைக்கவும். நீங்கள் `` --quit-quit-forn கட்டளை வரி வாதத்தையும் பயன்படுத்தலாம், அங்கு `` n`` என்பது வெளியேறுவதற்கு முன் வழங்க வேண்டிய பிரேம்களின் எண்ணிக்கை.
uk: Щоб безпечно вийти з проекту, який використовує режим Movie Maker, скористайтеся кнопкою X у верхній частині вікна або викличте ``get_tree().quit()`` у сценарії. Ви також можете використовувати аргумент командного рядка ``--quit-after N``, де ``N`` — це кількість кадрів, які потрібно відобразити перед виходом.

source: Pressing :kbd:`F8` (:kbd:`Cmd + .` on macOS) or pressing :kbd:`Ctrl + C` on the terminal running Godot is **not recommended**, as it will result in an improperly formatted AVI file with no duration information. For PNG image sequences, PNG images will not be negatively altered, but the associated WAV file will still lack duration information. OGV files might end up with slightly different duration video and audio tracks but still valid.
ru: Нажатие клавиш :kbd:`F8` (:kbd:`Cmd + .` на macOS) или :kbd:`Ctrl + C` на терминале с запущенным Godot **не рекомендуется**, так как это приведёт к созданию неправильно отформатированного AVI-файла без информации о длительности. Последовательности изображений PNG не будут подвергаться негативным изменениям, но в соответствующем WAV-файле информация о длительности по-прежнему будет отсутствовать. Файлы OGV могут иметь немного другую длительность видео- и аудиодорожек, но всё равно будут корректными.

source: Some video players may still be able to play the AVI or WAV file with working video and audio. However, software that makes use of the AVI or WAV file such as video editors may not be able to open the file. :ref:`Using a video converter program <doc_creating_movies_converting_avi>` can help in those cases.
ga: D'fhéadfadh go mbeadh roinnt imreoirí físeán fós in ann an comhad AVI nó WAV a imirt le físeáin agus fuaime oibre. Mar sin féin, seans nach mbeidh bogearraí a bhaineann úsáid as an gcomhad AVI nó WAV ar nós eagarthóirí físeáin in ann an comhad a oscailt. :ref:`Is féidir cabhrú sna cásanna sin má úsáideann tú ríomhchlár tiontaire físeáin <doc_creating_movies_converting_avi>`.
ru: Некоторые видеоплееры могут воспроизводить файлы AVI или WAV с воспроизводимым видео и звуком. Однако программы, работающие с файлами AVI или WAV, например, видеоредакторы, могут не открыть их. :ref:`Использование программы-конвертера видео <doc_creating_movies_converting_avi>` может помочь в таких случаях.
ta: சில வீடியோ பிளேயர்கள் வேலை செய்யும் வீடியோ மற்றும் ஆடியோவுடன் அவி அல்லது வாவ் கோப்பை இயக்க முடியும். இருப்பினும், வீடியோ எடிட்டர்கள் போன்ற AVI அல்லது WAV கோப்பைப் பயன்படுத்தும் மென்பொருள் கோப்பைத் திறக்க முடியாது. .
uk: Деякі відеопрогравачі все ще можуть відтворювати файли AVI або WAV із робочим відео та аудіо. Проте програмне забезпечення, яке використовує файли AVI або WAV, наприклад відеоредактори, може не відкрити файл. :ref:`Using a video converter program <doc_creating_movies_converting_avi>` може допомогти в таких випадках.

source: If you're using an AnimationPlayer to control a "main action" in the scene (such as camera movement), you can enable the **Movie Quit On Finish** property on the AnimationPlayer node in question. When enabled, this property will make Godot quit on its own when an animation is done playing *and* the engine is running in Movie Maker mode. Note that *this property has no effect on looping animations*. Therefore, you need to make sure that the animation is set as non-looping.
fr: Si vous utilisez un AnimationPlayer pour contrôler une "action principale" dans la scène (comme le mouvement de caméra), vous pouvez activer la propriété **Quitter le film à la fin** sur le nœud AnimationPlayer en question. Lorsque cela est activé, cette propriété fera que Godot s'arrête tout seul lorsqu'une animation a fini de jouer *et* le moteur s'exécute en mode Création de film. Notez que *cette propriété n'a aucun effet sur les animations qui bouclent*. Par conséquent, vous devez vous assurer que l'animation est définie comme non-bouclante.
ga: Má tá AnimationPlayer in úsáid agat chun "príomhghníomhaíocht" sa radharc a rialú (amhail gluaiseacht ceamara), is féidir leat an mhaoin **Scoir Scannán Ar Chríochnú** a chumasú ar an nód AnimationPlayer atá i gceist. Nuair a bheidh sé cumasaithe, scoirfidh an t-airí seo ar Godot leis féin nuair a bheidh beochan déanta ag imirt * agus* nuair a bhíonn an t-inneall ag rith i mód Déantóir Scannán. Tabhair faoi deara * nach bhfuil aon éifeacht ag an airí seo ar bheochan a lúbadh*. Dá bhrí sin, ní mór duit a chinntiú go bhfuil an beochan socraithe mar neamh-lúb.
ru: Если вы используете AnimationPlayer для управления «основным действием» в сцене (например, движением камеры), вы можете включить свойство **Movie Quit On Finish** (Завершение фильма) в соответствующем узле AnimationPlayer. Если это свойство включено, Godot автоматически завершит работу после завершения воспроизведения анимации, *и* если движок работает в режиме Movie Maker. Обратите внимание, что *это свойство не влияет на цикличные анимации*. Поэтому необходимо убедиться, что анимация нециклична.
ta: காட்சியில் (கேமரா இயக்கம் போன்றவை) ஒரு "முக்கிய செயலைக்" கட்டுப்படுத்த அனிமேசன் பிளேயரைப் பயன்படுத்துகிறீர்கள் என்றால், கேள்விக்குரிய அனிமேசன் பிளேயர் முனையில் ** பூச்சு ** சொத்தை விட்டு வெளியேற வேண்டும். இயக்கப்பட்டால், ஒரு அனிமேசன் விளையாடும் போது இந்த சொத்து கோடோட்டை தானாகவே விட்டுச்செல்லும் * மற்றும் * தி எஞ்சின் மூவி மேக்கர் பயன்முறையில் இயங்குகிறது. *இந்த சொத்து அனிமேசன்களை வளையுவதில் எந்த விளைவையும் ஏற்படுத்தாது என்பதை நினைவில் கொள்க *. எனவே, அனிமேசன் லூப்பிங் அல்லாததாக அமைக்கப்பட்டிருப்பதை உறுதி செய்ய வேண்டும்.
uk: Якщо ви використовуєте AnimationPlayer для керування «основною дією» в сцені (наприклад, рухом камери), ви можете ввімкнути властивість **Відео завершити після закінчення** у відповідному вузлі AnimationPlayer. Якщо ввімкнено, ця властивість змусить Godot завершити роботу самостійно, коли відтворення анімації закінчено *і* система працює в режимі Movie Maker. Зауважте, що *ця властивість не впливає на циклічні анімації*. Тому вам потрібно переконатися, що анімація встановлена як незациклена.

source: Using high-quality graphics settings
fr: Utilisation des préférences graphiques de haute qualité
ga: Socruithe grafaicí ardcháilíochta
ru: Использование высококачественных графических настроек
ta: உயர்தர கிராபிக்ச் அமைப்புகளைப் பயன்படுத்துதல்
uk: Використання якісних графічних налаштувань
