Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/creating_movies.po
Languages: fr, ga, it, ru, ta, uk

source: The FPS is specified using the ``-r`` argument. It should match the FPS specified during recording. Otherwise, the video will appear to be slowed down or sped up, and audio will be out of sync with the video.
ga: Sonraítear an FPS ag baint úsáide as an argóint ``-r``. Ba chóir go mbeadh sé meaitseáil leis an FPS a shonraítear Seachas sin, is cosúil go ndéantar an físeán a mhoilliú nó a luasú, agus beidh fuaim as sioncrónú leis an bhfíseán.
ru: FPS указывается с помощью аргумента ``-r``. Она должна соответствовать частоте кадров, указанной во время записи. В противном случае видео будет выглядеть замедленным или ускоренным, а звук будет рассинхронизирован с видео.
ta: `` -R`` வாதத்தைப் பயன்படுத்தி FPS குறிப்பிடப்பட்டுள்ளது. இது பதிவின் போது குறிப்பிடப்பட்ட FPS உடன் பொருந்த வேண்டும். இல்லையெனில், வீடியோ மெதுவாகவோ அல்லது வேகமாகச் செல்லவோ தோன்றும், மேலும் ஆடியோ வீடியோவுடன் ஒத்திசைக்கப்படவில்லை.
uk: FPS вказується за допомогою аргументу ``-r``. Він повинен відповідати FPS, указаному під час запису. Інакше відео виглядатиме сповільненим або прискореним, а звук не буде синхронізований із відео.

source: If you recorded a PNG image sequence with transparency enabled, you need to use a video format that supports storing transparency. MP4/H.264 doesn't support storing transparency, so you can use WebM/VP9 as an alternative:
ga: Má thaifeadadh tú seicheamh íomhá PNG le trédhearcacht cumasaithe, ní mór duit formáid físe a úsáid a thacaíonn le trédhearcacht a stóráil. Ní thacaíonn MP4/H.264 le trédhearcacht a stóráil, ionas gur féidir leat WebM/VP9 a úsáid mar mhalairt eile:
it: Se hai registrato una sequenza di immagini PNG con la trasparenza abilitata, devi utilizzare un formato video che supporti la memorizzazione della trasparenza. MP4/H.264 non supporta la memorizzazione della trasparenza, quindi puoi utilizzare WebM/VP9 come alternativa:
ru: Если вы записали последовательность PNG-изображений с включённой прозрачностью, вам необходимо использовать видеоформат, поддерживающий сохранение прозрачности. MP4/H.264 не поддерживает сохранение прозрачности, поэтому в качестве альтернативы можно использовать WebM/VP9:
ta: வெளிப்படைத்தன்மை இயக்கப்பட்ட ஒரு பி.என்.சி பட வரிசையை நீங்கள் பதிவுசெய்தால், வெளிப்படைத்தன்மையை சேமிப்பதை ஆதரிக்கும் வீடியோ வடிவமைப்பைப் பயன்படுத்த வேண்டும். MP4/H.264 வெளிப்படைத்தன்மையை சேமிப்பதை ஆதரிக்கவில்லை, எனவே நீங்கள் WebM/VP9 ஐ மாற்றாக பயன்படுத்தலாம்:
uk: Якщо ви записали послідовність зображень PNG із увімкненою прозорістю, вам потрібно використовувати відеоформат, який підтримує збереження прозорості. MP4/H.264 не підтримує збереження прозорості, тому ви можете використовувати WebM/VP9 як альтернативу:

source: Cutting video
fr: Montage vidéo
ga: Gearradh físeán
it: Ritagliare un video
ru: Нарезка видео
ta: வீடியோவை வெட்டுதல்
uk: Нарізка відео

source: You can trim parts of the video you don't want to keep after the video is recorded. For example, to discard everything before 12.1 seconds and keep only 5.2 seconds of video after that point:
ga: Is féidir leat codanna den fhíseán nach dteastaíonn uait a choinneáil a ghearradh tar éis an físeán a thaifeadadh. Mar shampla, chun gach rud a dhiúscairt roimh 12.1 soicind agus gan ach 5.2 soicind de fhíseán a choinneáil tar éis an phointe sin:
ru: Вы можете обрезать ненужные фрагменты видео после записи. Например, чтобы удалить всё до 12,1 секунды и оставить только 5,2 секунды видео после этого момента:
ta: வீடியோ பதிவு செய்யப்பட்ட பிறகு நீங்கள் வைத்திருக்க விரும்பாத வீடியோவின் பகுதிகளை நீங்கள் ஒழுங்கமைக்கலாம். எடுத்துக்காட்டாக, எல்லாவற்றையும் 12.1 வினாடிகளுக்கு முன் நிராகரித்து, அந்த இடத்திற்குப் பிறகு 5.2 வினாடிகள் வீடியோவை மட்டுமே வைக்க:
uk: Ви можете обрізати частини відео, які не хочете зберігати після запису відео. Наприклад, щоб відкинути все до 12,1 секунди та залишити лише 5,2 секунди відео після цієї точки:

source: Cutting videos can also be done with the GUI tool `LosslessCut <https://mifi.github.io/lossless-cut/>`__.
ga: Is féidir físeáin a ghearradh freisin leis an uirlis GUI `LosslessCut <https://mifi.github.io/lossless-cut/>`__.
ru: Обрезку видео можно также выполнять с помощью графического инструмента `LosslessCut <https://mifi.github.io/lossless-cut/>`__.
ta: வீடியோக்களை வெட்டுவது GUI கருவி `LOSSELLESSCUT <https://mifi.github.io/lossless-cut/> __. __.
uk: Вирізати відео можна також за допомогою графічного інструменту `LosslessCut <https://mifi.github.io/lossless-cut/>`__.

source: Resizing video
fr: Redimensionner une vidéo
ga: Méid físeáin a athrú
it: Ridimensionare un video
ru: Изменение размера видео
ta: வீடியோ மறுஅளவிடுதல்
uk: Зміна розміру відео

source: The following command resizes a video to be 1080 pixels tall (1080p), while preserving its existing aspect ratio:
ga: Athraíonn an t-ordú seo a leanas méid físeáin go mbeidh 1080 picteilín ar airde (1080p), agus an cóimheas gné atá ann cheana a chaomhnú:
ru: Следующая команда изменяет размер видео до высоты 1080 пикселей (1080p), сохраняя при этом его текущее соотношение сторон:
ta: பின்வரும் கட்டளை ஒரு வீடியோவை 1080 படப்புள்ளிகள் உயரம் (1080p) ஆக மாற்றுகிறது, அதே நேரத்தில் அதன் தற்போதைய விகித விகிதத்தை பாதுகாக்கும்:
uk: Наступна команда змінює розмір відео до 1080 пікселів у висоту (1080p), зберігаючи існуюче співвідношення сторін:

source: Reducing framerate
ga: Framerate a laghdú
it: Ridurre il framerate
ru: Уменьшение частоты кадров
ta: ஃப்ரேம்ரேட்டைக் குறைத்தல்
uk: Зменшення частоти кадрів

source: The following command changes a video's framerate to 30 FPS, dropping some of the original frames if there are more in the input video:
ga: Athraíonn an t-ordú seo a leanas fráma físeáin go 30 FPS, ag scaoileadh cuid de na frámaí bunaidh má tá níos mó san fhíseán ionchuir:
ru: Следующая команда изменяет частоту кадров видео до 30 FPS, отбрасывая некоторые исходные кадры, если во входном видео их больше:
ta: பின்வரும் கட்டளை ஒரு வீடியோவின் ஃப்ரேம்ரேட்டை 30 FPS ஆக மாற்றுகிறது, உள்ளீட்டு வீடியோவில் இன்னும் சில அசல் பிரேம்களைக் கைவிடுகிறது:
uk: Наступна команда змінює частоту кадрів відео до 30 FPS, відкидаючи деякі вихідні кадри, якщо їх більше у вхідному відео:

source: Generating accumulation motion blur with FFmpeg
ga: Déaladh gluaisne carntha a ghiniúint le FFmpeg
ru: Создание размытия движения с накоплением с помощью FFmpeg
ta: FFMPEG உடன் குவிப்பு இயக்க மங்கலை உருவாக்குகிறது
uk: Створення накопичувального розмиття в русі за допомогою FFmpeg

source: Godot does not have built-in support for motion blur, but it can still be created in recorded videos.
ga: Níl tacaíocht ionsuite ag Godot le haghaidh doiléir gluaisne, ach is féidir é a chruthú fós i bhfíseáin taifeadta.
ru: Godot не имеет встроенной поддержки размытия движения, но его все равно можно создать в записанных видео.
ta: மோசன் மங்கலுக்கான கட்டோட்டுக்கு உள்ளமைக்கப்பட்ட உதவி இல்லை, ஆனால் அதை இன்னும் பதிவுசெய்யப்பட்ட வீடியோக்களில் உருவாக்க முடியும்.
uk: Godot не має вбудованої підтримки розмиття руху, але його все одно можна створити у записаних відео.

source: If you record the video at a multiple of the original framerate, you can blend the frames together then reduce the frameate to produce a video with *accumulation motion blur*. This motion blur can look very good, but it can take a long time to generate since you have to render many more frames per second (on top of the time spent on post-processing).
ga: Má thaifeadann tú an físeán ag iolrach den bhfráma bunaidh, is féidir leat na frámaí a chumasc le chéile ansin an fráma a laghdú chun físeán a tháirgeadh len*gluaiseacht carnadh doil*. Is féidir leis an doiléar gluaisne seo cuma an-mhaith, ach féadfaidh sé tamall fada a ghiniúint ós rud é go gcaithfidh tú i bhfad níos mó frámaí a rinneadh in aghaidh an tsoicind (ar bharr an ama a chaitear ar iar-phróiseáil).
ru: Если вы записываете видео с частотой, кратной исходной, вы можете объединить кадры, а затем уменьшить частоту кадров, чтобы получить видео с *накопленным размытием движения*. Такое размытие движения может выглядеть очень хорошо, но его создание может занять много времени, поскольку требуется рендерить гораздо больше кадров в секунду (помимо времени, затрачиваемого на постобработку).
ta: அசல் பிரேம்ரேட்டின் பலத்தில் நீங்கள் வீடியோவைப் பதிவுசெய்தால், நீங்கள் பிரேம்களை ஒன்றாக கலக்கலாம், பின்னர் *குவிப்பு இயக்க மங்கலான *உடன் வீடியோவை தயாரிக்க ஃபிரேமீட்டைக் குறைக்கவும். இந்த மோசன் மங்கலானது மிகவும் அழகாக இருக்கும், ஆனால் நீங்கள் ஒரு நொடிக்கு இன்னும் பல பிரேம்களை வழங்க வேண்டியிருப்பதால் (பிந்தைய செயலாக்கத்திற்காக செலவழித்த நேரத்திற்கு மேல்) உருவாக்க நீண்ட நேரம் ஆகலாம்.
uk: Якщо ви записуєте відео з частотою кадрів, кратною вихідній частоті кадрів, ви можете змішати кадри разом, а потім зменшити частоту кадрів, щоб отримати відео з *розмиттям у русі*. Це розмиття в русі може виглядати дуже добре, але для його створення може знадобитися багато часу, оскільки вам потрібно візуалізувати набагато більше кадрів на секунду (додатково до часу, витраченого на постобробку).

source: Example with a 240 FPS source video, generating 4× motion blur and decreasing its output framerate to 60 FPS:
ga: Sampla le físeán foinse 240 FPS, ag giniúint doiléir gluaiseachta 4× agus ag laghdú a fráma aschuir go 60 FPS:
it: Esempio con un video sorgente a 240 FPS, che genera un effetto motion blur 4x e riduce il frame rate risultante a 60 FPS:
ru: Пример с исходным видео 240 FPS, создающим 4-кратное размытие движения и уменьшающим выходную частоту кадров до 60 FPS:
ta: 240 FPS மூல வீடியோவுடன் எடுத்துக்காட்டு, 4 × இயக்க மங்கலை உருவாக்கி அதன் வெளியீட்டு பிரேம்ரேட்டை 60 FPS ஆகக் குறைக்கிறது:
uk: Приклад із вихідним відео з частотою 240 кадрів/с, яке створює 4-кратне розмиття в русі та зменшує вихідну частоту кадрів до 60 кадрів/с:

source: This also makes effects that converge over several frames (such as temporal antialiasing, SDFGI and volumetric fog) converge faster and therefore look better, since they'll be able to work with more data at a given time. See :ref:`doc_creating_movies_reducing_framerate` if you want to get this benefit without adding motion blur.
ga: Fágann sé seo freisin go dtéann éifeachtaí a thagann le chéile thar roinnt frámaí (mar shampla frithsheasú ama, SDFGI agus ceo toirtmhéadrach) le chéile níos gasta agus dá bhrí sin tá cuma níos fearr orthu, ós rud é go mbeidh siad in ann oibriú le níos mó sonraí ag am ar leith. Féach:ref: `doc_creating_movies_reducing_framerate` más mian leat an sochar seo a fháil gan doiléar gluaisne a chur leis.
ru: Это также ускоряет сходимость эффектов, охватывающих несколько кадров (например, временное сглаживание, SDFGI и объёмный туман), и, следовательно, улучшает их внешний вид, поскольку они могут обрабатывать больше данных одновременно. Если вы хотите получить это преимущество без размытия в движении, см. :ref:`doc_creating_movies_reducing_framerate`.
ta: இது பல பிரேம்களில் (தற்காலிக ஆன்டியாலியாசிங், எச்.டி.எஃப்.சி.ஐ மற்றும் வால்யூமெட்ரிக் மூடுபனி போன்றவை) ஒன்றிணைக்கும் விளைவுகளையும் வேகமாக ஒன்றிணைகிறது, எனவே அவை ஒரு குறிப்பிட்ட நேரத்தில் அதிக தரவுகளுடன் வேலை செய்ய முடியும் என்பதால், சிறப்பாக இருக்கும். காண்க: குறிப்பு: `doc_creating_movies_reducing_frameare` இயக்க மங்கலைச் சேர்க்காமல் இந்த நன்மையைப் பெற விரும்பினால்.
uk: Це також робить ефекти, які збігаються в кількох кадрах (наприклад, часове згладжування, SDFGI та об’ємний туман), збігаються швидше і, отже, виглядають краще, оскільки вони зможуть працювати з більшою кількістю даних у певний момент часу. Перегляньте :ref:`doc_creating_movies_reducing_framerate`, якщо ви хочете отримати цю перевагу без додавання розмиття руху.

source: The icon gets a background matching the accent color when Movie Maker mode is enabled:
ga: Faigheann an deilbhín cúlra a mheaitseálann an dath accent nuair atá mód Movie Maker cumasaithe:
ta: திரைப்பட தயாரிப்பாளர் பயன்முறை இயக்கப்பட்டிருக்கும் போது படவுரு உச்சரிப்பு வண்ணத்துடன் பொருந்தக்கூடிய பின்னணியைப் பெறுகிறது:
uk: Піктограма отримує тло, яке збігається з кольором акценту, коли ввімкнено режим Movie Maker:

source: Output formats are provided by the :ref:`MovieWriter <class_MovieWriter>` class. Godot has 2 built-in :ref:`MovieWriters <class_MovieWriter>`, and more can be implemented by extensions:
ga: Soláthraíonn an rang :ref:`Scríbhneoir Scannán <class_MovieWriter>` formáidí aschuir. Tá 2 ionsuite ag Godot :ref:`MovieWriters <class_MovieWriter>`, agus is féidir tuilleadh a chur i bhfeidhm trí bhreiseáin:
ta: வெளியீட்டு வடிவங்கள் வழங்கப்படுகின்றன: ref: `moveiewriter <class_moviewriter>` வகுப்பு. கோடோட்டில் 2 உள்ளமைக்கப்பட்டுள்ளது: குறிப்பு: `moviewriters <class_moviewriter>`, மேலும் பலவற்றை நீட்டிப்புகளால் செயல்படுத்தலாம்:
uk: Вихідні формати надаються класом :ref:`MovieWriter <class_MovieWriter>`. Godot має 2 вбудовані :ref:`MovieWriters <class_MovieWriter>`, і більше можна реалізувати за допомогою розширень:

source: AVI (recommended)
ga: AVI (moltar)
ta: ஏ.வி.ஐ (பரிந்துரைக்கப்படுகிறது)
uk: AVI (рекомендовано)

source: AVI container with MJPEG for video and uncompressed audio. Features lossy video compression, resulting in medium file sizes and fast encoding. The lossy compression quality can be adjusted by changing **Editor > Movie Writer > MJPEG Quality**.
ga: Coimeádán AVI le MJPEG le haghaidh físe agus fuaime neamh-chomhbhrúite. Gnéithe comhbhrú físeáin lossy, a eascraíonn i méideanna comhaid meánach agus ionchódú tapa. Is féidir an caighdeán comhbhrú lossy a choigeartú trí **Eagarthóir> Scríbhneoir Scannán> Cáilíocht MJPEG** a athrú.
ta: வீடியோ மற்றும் சுருக்கப்படாத ஆடியோவுக்கு MJPEG உடன் AVI கொள்கலன். இழப்பு வீடியோ சுருக்கத்தைக் கொண்டுள்ளது, இதன் விளைவாக நடுத்தர கோப்பு அளவுகள் மற்றும் விரைவான குறியாக்கம். ** எடிட்டர்> திரைப்பட எழுத்தாளர்> MJPEG தகுதி ** மாற்றுவதன் மூலம் இழப்பு சுருக்க தரத்தை சரிசெய்ய முடியும்.
uk: Контейнер AVI з MJPEG для відео та аудіо без стиснення. Функції стиснення відео з втратами, що забезпечує середні розміри файлів і швидке кодування. Якість стиснення з втратами можна налаштувати, змінивши **Редактор > Кінозапис > Якість MJPEG**.

source: To use AVI, specify a path to an ``.avi`` file to be created in the **Editor > Movie Writer > Movie File** project setting.
ga: Chun AVI a úsáid, sonraigh cosán chuig comhad ``.avi`` atá le cruthú i socrú tionscadail **Eagarthóir > Scríbhneoir Scannán > Comhad Scannán**.
uk: Щоб використовувати AVI, укажіть шлях до файлу ``.avi``, який буде створено, у налаштуваннях проекту **Редактор > Сценарист фільму > Файл фільму**.

source: **MJPEG Quality:** The JPEG quality to use when writing a video to an AVI file, between ``0.01`` and ``1.0`` (inclusive). Higher quality values result in better-looking output at the cost of larger file sizes. Recommended quality values are between ``0.75`` and ``0.9``. Even at quality ``1.0``, JPEG compression remains lossy. This setting does not affect audio quality and is ignored when writing to a PNG image sequence.
ga: ** Cáilíocht MJPEG: ** An cháilíocht JPEG le húsáid agus físeán á scríobh chuig comhad AVI, idir `` 0.01`` agus `` 1.0`` (san áireamh). Is é an toradh a bhíonn ar luachanna cáilíochta níos airde ná aschur atá ag breathnú níos fearr ar chostas méideanna comhaid níos mó. Tá na luachanna cáilíochta molta idir ``0.75`` agus ``0.9``. Fiú ag cáilíocht `` 1.0``, tá comhbhrú JPEG caillte. Ní chuireann an socrú seo isteach ar cháilíocht na fuaime agus déantar neamhaird de agus tú ag scríobh chuig seicheamh íomhá PNG.
ta: . உயர் தரமான மதிப்புகள் பெரிய கோப்பு அளவுகளின் விலையில் சிறந்த தோற்றமுடைய வெளியீட்டை விளைவிக்கின்றன. பரிந்துரைக்கப்பட்ட தர மதிப்புகள் `` 0.75`` மற்றும் `` 0.9`` க்கு இடையில் உள்ளன. தரத்தில் கூட `` 1.0``, JPEG சுருக்கமானது இழப்பாகவே உள்ளது. இந்த அமைப்பு ஆடியோ தரத்தை பாதிக்காது மற்றும் பி.என்.சி பட வரிசைக்கு எழுதும்போது புறக்கணிக்கப்படுகிறது.
uk: **Якість MJPEG:** Якість JPEG, яка використовується під час запису відео у файл AVI, від ``0,01`` до ``1,0`` (включно). Вищі значення якості призводять до кращого вигляду результату за рахунок більшого розміру файлу. Рекомендовані значення якості від ``0,75`` до ``0,9``. Навіть за якості ``1.0`` стиснення JPEG залишається з втратами. Цей параметр не впливає на якість звуку та ігнорується під час запису в послідовність зображень PNG.

source: Pressing :kbd:`F8` (:kbd:`Cmd + .` on macOS) or pressing :kbd:`Ctrl + C` on the terminal running Godot is **not recommended**, as it will result in an improperly formatted AVI file with no duration information. For PNG image sequences, PNG images will not be negatively altered, but the associated WAV file will still lack duration information.
ga: Brúite:KBD: `F8` (:kbd: `Cmd + .` ar macOS) nó brú:kbd: `Ctrl+C` ar an teirminéal atá ag rith Godot **ní moltaí**, toisc go mbeidh comhad AVI formáidithe míchuí mar thoradh air gan aon fhaisnéis ar fad. Maidir le seicheamh íomhá PNG, ní athrófar íomhánna PNG go diúltach, ach ní bheidh faisnéis faoin am fós ag an gcomhad WAV gaolmhar.
ta: அழுத்துதல்: KBD: `F8` (: KBD:` CMD + .` MACOS இல்) அல்லது அழுத்துதல்: KBD: `CTRL + C` கோடோட் இயங்கும் முனையத்தில் ** பரிந்துரைக்கப்படவில்லை **, ஏனெனில் இது முறையற்ற வடிவமைக்கப்படும் கால செய்தி இல்லாத AVI கோப்பு. பி.என்.சி பட காட்சிகளைப் பொறுத்தவரை, பி.என்.சி படங்கள் எதிர்மறையாக மாற்றப்படாது, ஆனால் தொடர்புடைய WAV கோப்பில் இன்னும் கால செய்தி இல்லாதது.
uk: Натискання :kbd:`F8` (:kbd:`Cmd + .` на macOS) або натискання :kbd:`Ctrl + C` на терміналі, де працює Godot, **не рекомендується**, оскільки це призведе до неправильно відформатованого Файл AVI без інформації про тривалість. Для послідовностей зображень PNG зображення PNG не будуть негативно змінені, але у пов’язаному файлі WAV все одно буде відсутня інформація про тривалість.

source: Converting AVI video to MP4
ga: Físeán AVI a thiontú go MP4
ta: AVI வீடியோவை MP4 ஆக மாற்றுகிறது
uk: Перетворення AVI відео в MP4

source: The command below converts an AVI video to an MP4 (H.264) video with a Constant Rate Factor (CRF) of 15. This results in a relatively large file, but is well-suited for platforms that will re-encode your videos to reduce their size (such as most video sharing websites):
ga: Athraíonn an t-ordú thíos físeán AVI go físeán MP4 (H.264) le Fachtóir Ráta Tairiseach (CRF) de 15. Tá comhad réasúnta mór mar thoradh air seo, ach tá sé oiriúnach go maith d'ardáin a athionchódfaidh do chuid físeáin chun a méid a laghdú (mar shampla an chuid is mó de láithreáin ghréasáin comhroinnte físeáin):
ta: கீழே உள்ள கட்டளை 15 இன் நிலையான விகித காரணி (சி.ஆர்.எஃப்) கொண்ட ஒரு எம்பி 4 (எச் .264) வீடியோவாக மாற்றுகிறது. இது ஒப்பீட்டளவில் பெரிய கோப்பில் விளைகிறது, ஆனால் உங்கள் வீடியோக்களை மீண்டும் குறியாக்கும் தளங்களுக்கு மிகவும் பொருத்தமானது அவற்றின் அளவைக் குறைக்கவும் (பெரும்பாலான வீடியோ பகிர்வு வலைத்தளங்கள் போன்றவை):
uk: Наведена нижче команда перетворює відео AVI у відео MP4 (H.264) із коефіцієнтом постійної швидкості (CRF) 15. Це призводить до відносно великого файлу, але добре підходить для платформ, які перекодують ваші відео в зменшити їх розмір (наприклад, більшість веб-сайтів для обміну відео):

source: PNG
ta: பி.என்.சி.
