Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/creating_movies.po
Languages: fr, ga, it, ru, ta, uk

source: Alternatively, you can set the output file path on a per-scene basis by adding a String metadata with the name ``movie_file`` to the scene's **root node**. This is only used when the main scene is set to the scene in question, or when running the scene directly by pressing :kbd:`F6` (:kbd:`Cmd + R` on macOS).
ga: De rogha air sin, is féidir leat cosán an chomhaid aschuir a shocrú ar bhonn in aghaidh an radhairc trí mheiteashonraí String leis an ainm ``movie_file`` a chur chuig ** nóid fréamh** an radharca**. Ní úsáidtear é seo ach nuair a shocraítear an príomh-radharc ar an radharc atá i gceist, nó nuair a bhíonn an radharc á rith go díreach trí bhrú: kbd: `F6` (:kbd: `Cmd + R` ar macOS).
ru: Кроме того, вы можете задать путь к выходному файлу для каждой сцены отдельно, добавив строковый метаданные с именем ``movie_file`` в **корневой узел** сцены. Это используется только в том случае, если основная сцена установлена на нужную сцену, или при непосредственном запуске сцены нажатием клавиш :kbd:`F6` (:kbd:`Cmd + R` у МакОсников).
ta: மாற்றாக, காட்சியின் ** ரூட் முனை ** இல் `` மூவி_ஃபைல்`` என்ற பெயருடன் ஒரு சரம் மெட்டாடேட்டாவை சேர்ப்பதன் மூலம் வெளியீட்டு கோப்பு பாதையை ஒரு காட்சியில் அமைக்கலாம். கேள்விக்குரிய காட்சிக்கு முதன்மையான காட்சி அமைக்கப்படும்போது அல்லது காட்சியை நேரடியாக இயக்கும் போது மட்டுமே இது பயன்படுத்தப்படுகிறது: KBD: `F6` (: KBD:` CMD + R` MACOS இல்).
uk: Крім того, ви можете встановити шлях вихідного файлу для кожної сцени, додавши метадані рядка з назвою ``movie_file`` до **кореневого вузла** сцени. Це використовується лише тоді, коли для основної сцени встановлено відповідну сцену або під час запуску сцени безпосередньо натисканням :kbd:`F6` (:kbd:`Cmd + R` на macOS).

source: Inspector view after creating a ``movie_file`` metadata of type String
ga: Amharc an Cigire tar éis meiteashonraí ``movie_file`` de chineál String a chruthú
ru: Вид инспектора после создания метаданных ``movie_file`` типа String
ta: வகை சரத்தின் `` மூவி_ஃபைல்`` மெட்டாடேட்டாவை உருவாக்கிய பிறகு இன்ச்பெக்டர் பார்வை
uk: Перегляд інспектора після створення метаданих ``movie_file`` типу String

source: The path specified in the project settings or metadata can be either absolute, or relative to the project root.
ga: Féadfaidh an chonair a shonraítear i socruithe nó meiteashonraí an tionscadail a bheith iomlán, nó i gcoibhneas le fréamh an tionscadail.
ru: Путь, указанный в настройках проекта или метаданных, может быть как абсолютным, так и относительным к корню проекта.
ta: திட்ட அமைப்புகள் அல்லது மெட்டாடேட்டாவில் குறிப்பிடப்பட்டுள்ள பாதை முழுமையானதாகவோ அல்லது திட்ட மூலத்துடன் தொடர்புடையதாகவோ இருக்கலாம்.
uk: Шлях, указаний у налаштуваннях або метаданих проекту, може бути або абсолютним, або відносним до кореня проекту.

source: Once you've configured and enabled Movie Maker mode, it will be automatically used when running the project from the editor.
fr: Une fois que vous avez configuré et activé le mode Création de film, il sera automatiquement utilisé lors de l'exécution du projet depuis l'éditeur.
ga: Nuair a bheidh modh Movie Maker cumraithe agus cumasaithe agat, úsáidfear go huathoibríoch é agus an tionscadal á rith ón eagarthóir.
ru: После настройки и включения режима Movie Maker он будет автоматически использоваться при запуске проекта из редактора.
ta: மூவி மேக்கர் பயன்முறையை நீங்கள் கட்டமைத்து இயக்கியதும், எடிட்டரிடமிருந்து திட்டத்தை இயக்கும் போது அது தானாகவே பயன்படுத்தப்படும்.
uk: Коли ви налаштуєте та ввімкнете режим Movie Maker, він автоматично використовуватиметься під час запуску проекту з редактора.

source: Command line usage
ga: Úsáid líne ordaithe
it: Utilizzo tramite riga di comando
ru: Руководство по командной строке
ta: கட்டளை வரி பயன்பாடு
uk: Використання командного рядка

source: Movie Maker can also be enabled from the :ref:`command line <doc_command_line_tutorial>`:
fr: Le mode Création de film peut également être activé à partir de la :ref:`ligne de commande <doc_command_line_tutorial>` :
ga: Is féidir Déantóir Scannán a chumasú freisin ón :ref:`líne ordaithe <doc_command_line_tutorial>`:
ru: Movie Maker также можно включить из :ref:`command line <doc_command_line_tutorial>`:
ta: திரைப்பட தயாரிப்பாளரை இயக்கலாம்: ref: `கட்டளை வரி <doc_command_line_tutorial>`:
uk: Movie Maker також можна ввімкнути з :ref:`command line <doc_command_line_tutorial>`:

source: If the output path is relative, then it is **relative to the project folder**, not the current working directory. In the above example, the file will be written to ``/path/to/your_project/output.avi``. This behavior is similar to the ``--export-release`` command line argument.
ga: Má tá an cosán aschuir coibhneasta, ansin tá se** coibhneas leis an bhfillteán tionscadail**, ní leis an eolaire oibre reatha. Sa sampla thuas, scríobfar an comhad chuig ``/path/to/your_project/output.avi``. Tá an t-iompar seo cosúil leis an argóint líne ordaithe ```--export-release``.
ru: Если путь к выходу относительный, то он указывается **относительно папки проекта**, а не текущего рабочего каталога. В приведённом выше примере файл будет записан в ``/path/to/your_project/output.avi``. Это поведение аналогично аргументу командной строки ``--export-release``.
ta: வெளியீட்டு பாதை உறவினராக இருந்தால், அது திட்டக் கோப்புறையுடன் தொடர்புடையது **, தற்போதைய பணி அடைவு அல்ல. மேலே உள்ள எடுத்துக்காட்டில், கோப்பு ``/பாதையில்/to/your_project/output.avi`` க்கு எழுதப்படும். இந்த நடத்தை ``-எக்ச்போர்ட்-வெளியீடு` கட்டளை வரி வாதத்திற்கு ஒத்ததாகும்.
uk: Якщо вихідний шлях є відносним, то він **відносно теки проекту**, а не поточного робочого каталогу. У наведеному вище прикладі файл буде записано в ``/path/to/your_project/output.avi``. Ця поведінка подібна до аргументу командного рядка ``--export-release``.

source: Since Movie Maker's output resolution is set by the viewport size, you can adjust the window size on startup to override it if the project uses the ``disabled`` or ``canvas_items`` :ref:`stretch mode <doc_multiple_resolutions>`:
fr: Comme la résolution de sortie du mode Création de Film est définie par la taille de la fenêtre d'affichage, vous pouvez régler la taille de la fenêtre lors du démarrage pour l'écraser si le projet utilise le :ref:`mode d'étirement <doc_multiple_resolutions>` ``désactivé`` ou ``objets_du_canveas`` :
ga: Ós rud é go bhfuil taifeach aschuir an Déantóra Scannán socraithe ag méid an amhairc, is féidir leat méid na fuinneoige ar an am tosaithe a choigeartú chun é a shárú má úsáideann an tionscadal an ``disabled`` nó ``canvas_items`` :ref:`mód sín <doc_multiple_resolutions>`:
ru: Поскольку выходное разрешение Movie Maker задается размером области просмотра, вы можете настроить размер окна при запуске, чтобы переопределить его, если проект использует режим ``disabled`` или ``canvas_items`` :ref:`stretch mode <doc_multiple_resolutions>`:
ta: மூவி மேக்கரின் வெளியீட்டுத் தீர்மானம் வியூபோர்ட் அளவால் அமைக்கப்பட்டிருப்பதால், திட்டத்தின் `` முடக்கப்பட்ட`` அல்லது `` கேன்வாச்_இடெம்ச்``: ref: `நீட்டிக்க பயன்முறை <doc_multiple_resolutions>`:
uk: Оскільки вихідна роздільна здатність Movie Maker встановлюється розміром вікна перегляду, ви можете змінити розмір вікна під час запуску, щоб змінити його, якщо проект використовує ``disabled`` або ``canvas_items`` :ref:`stretch mode <doc_multiple_resolutions>`:

source: Note that the window size is clamped by your display's resolution. See :ref:`doc_creating_movies_recording_at_higher_resolution` if you need to record a video at a higher resolution than the screen resolution.
ga: Tabhair faoi deara go bhfuil méid na fuinneoige clampáilte le taifeach do thaispeána. Féach:ref: `doc_creating_movies_recording_at_higher_resolution` más gá duit físeán a thaifeadadh ag taifeadadh níos airde ná réiteach an scáileáin.
ru: Обратите внимание, что размер окна ограничен разрешением вашего дисплея. Если вам нужно записать видео с разрешением выше, чем разрешение экрана, см. документ :ref:`doc_creating_movies_recording_at_higher_resolution`.
ta: உங்கள் காட்சியின் தெளிவுத்திறனால் சாளர அளவு பிணைக்கப்பட்டுள்ளது என்பதை நினைவில் கொள்க. காண்க: குறிப்பு: `doc_creating_movies_recording_at_higher_resolution` திரை தெளிவுத்திறனை விட அதிக தெளிவுத்திறனில் ஒரு வீடியோவை பதிவு செய்ய வேண்டும் என்றால்.
uk: Зауважте, що розмір вікна обмежується роздільною здатністю вашого дисплея. Перегляньте :ref:`doc_creating_movies_recording_at_higher_resolution`, якщо вам потрібно записати відео з роздільною здатністю, вищою за роздільну здатність екрана.

source: The recording FPS can also be overridden on the command line, without having to edit the Project Settings:
ga: Is féidir an FPS taifeadta a shárú ar an líne ordaithe freisin, gan an Socruithe Tionscadail a chur in eagar:
ru: Частоту кадров записи также можно переопределить в командной строке, без необходимости редактирования настроек проекта:
ta: திட்ட அமைப்புகளைத் திருத்தாமல், பதிவுசெய்தல் FPS ஐ கட்டளை வரியில் மீறலாம்:
uk: FPS запису також можна змінити в командному рядку без необхідності редагувати параметри проекту:

source: The ``--write-movie`` and ``--fixed-fps`` command line arguments are both available in exported projects. Movie Maker mode cannot be toggled while the project is running, but you can use the :ref:`OS.execute() <class_OS_method_execute>` method to run a second instance of the exported project that will record a video file.
fr: Les arguments de ligne de commande ``--write-movie`` et ``--fixed-fps`` sont tous deux disponibles dans les projets exportés. Le mode Création de film ne peut pas être activé pendant que le projet fonctionne, mais vous pouvez utiliser la méthode :ref:`OS.execute() <class_OS_method_execute>` pour exécuter une deuxième instance du projet exporté qui enregistrera un fichier vidéo.
ga: Tá na hargóintí ordú ``--write-movie`` agus ``--fixed-fps`` ar fáil i dtionscadail easpórtáilte. Ní féidir mód Déantóir Scannán a scoránaigh agus an tionscadal ar siúl, ach is féidir leat an modh :ref:`OS.execute() <class_OS_method_execute>` a úsáid chun an dara huair den tionscadal easpórtáilte a thaifeadfaidh físchomhad a rith.
ru: Аргументы командной строки ``--write-movie`` и ``--fixed-fps`` доступны в экспортированных проектах. Режим Movie Maker нельзя переключить во время выполнения проекта, но можно использовать метод :ref:`OS.execute() <class_OS_method_execute>` для запуска второго экземпляра экспортированного проекта, который запишет видеофайл.
ta: ``--ரைட்-மூவி`` மற்றும் ``--ஃபிக்ச்-எஃப்.பி.எச்`` கட்டளை வரி வாதங்கள் இரண்டும் ஏற்றுமதி செய்யப்பட்ட திட்டங்களில் கிடைக்கின்றன. திட்டம் இயங்கும் போது மூவி மேக்கர் பயன்முறையை மாற்ற முடியாது, ஆனால் நீங்கள்: குறிப்பு: `os.execute () <class_os_method_execute>` வீடியோ கோப்பைப் பதிவுசெய்யும் ஏற்றுமதி திட்டத்தின் இரண்டாவது நிகழ்வை இயக்குவதற்கான முறை.
uk: Аргументи командного рядка ``--write-movie`` і ``--fixed-fps`` доступні в експортованих проектах. Режим Movie Maker не можна перемикати під час роботи проекту, але ви можете використовувати метод :ref:`OS.execute() <class_OS_method_execute>` для запуску другого екземпляра експортованого проекту, який записуватиме відеофайл.

source: Choosing an output format
fr: Choisir un format de sortie
ga: Formáid aschuir a roghnú
it: Scegliere un formato di output
ru: Выбор выходного формата
ta: வெளியீட்டு வடிவமைப்பைத் தேர்ந்தெடுப்பது
uk: Вибір вихідного формату

source: Output formats are provided by the :ref:`MovieWriter <class_MovieWriter>` class. Godot has 3 built-in :ref:`MovieWriters <class_MovieWriter>`, and more can be implemented by extensions:
fr: Les formats de sortie sont fournis par la classe :ref:`MovieWriter <class_MovieWriter>`. Godot a 3 :ref:`MovieWriters <class_MovieWriter>` intégrés, et d'autres peut être implémentés par des extensions :
ru: Форматы вывода предоставляются классом :ref:`MovieWriter <class_MovieWriter>`. В Godot есть 3 встроенных класса :ref:`MovieWriter <class_MovieWriter>`, а дополнительные можно реализовать с помощью расширений:

source: OGV (recommended)
fr: OGV (recommandé)
it: OGV (consigliato)
ru: OGV (рекомендуемый)

source: OGV container with Theora for video and Vorbis for audio. Features lossy video and audio compression with a good balance of file size and encoding speed, with a better image quality than MJPEG. It has 4 speed levels that can be adjusted by changing **Editor > Movie Writer > Encoding Speed** with the fastest one being around as fast as AVI with better compression. At slower speed levels, it can compress even better while keeping the same image quality. The lossy compression quality can be adjusted by changing **Editor > Movie Writer > Video Quality** for video and **Editor > Movie Writer > Audio Quality** for audio.
ru: Контейнер OGV с Theora для видео и Vorbis для аудио. Обеспечивает сжатие видео и аудио с потерями, обеспечивая хороший баланс между размером файла и скоростью кодирования, а также лучшее качество изображения, чем MJPEG. Доступно 4 уровня скорости, которые можно настроить, выбрав **Editor > Movie Writer > Encoding Speed**. Самый быстрый из них примерно соответствует скорости AVI и обеспечивает лучшее сжатие. На более низких скоростях сжатие может быть ещё лучше, сохраняя при этом качество изображения. Качество сжатия с потерями можно настроить, выбрав **Editor > Movie Writer > Video Quality** для видео и **Editor > Movie Writer > Audio Quality** для аудио.

source: The Keyframe Interval can be adjusted by changing **Editor > Movie Writer > Keyframe Interval**. In some cases, increasing this setting can improve compression efficiency without downsides.
ru: Интервал ключевых кадров можно настроить, выбрав **Editor > Movie Writer > Keyframe Interval**. В некоторых случаях увеличение этого параметра может повысить эффективность сжатия без каких-либо недостатков.

source: The resulting file can be viewed in Godot with :ref:`VideoStreamPlayer <class_VideoStreamPlayer>` and most video players but not web browsers. OGV does not support transparency.
ru: Полученный файл можно просмотреть в Godot с помощью :ref:`VideoStreamPlayer <class_VideoStreamPlayer>` и большинства видеоплееров, но не веб-браузеров. OGV не поддерживает прозрачность.

source: To use OGV, specify a path to a ``.ogv`` file to be created in the **Editor > Movie Writer > Movie File** project setting.
ru: Чтобы использовать OGV, укажите путь к файлу ``.ogv``, который будет создан в настройках проекта **Editor > Movie Writer > Movie File**.

source: OGV can only be recorded in editor builds. On the other hand, :ref:`OGV playback <doc_playing_videos>` is possible in both editor and export template builds.
it: È possibile registrare in OGV solo nelle build dell'editor. D'altra parte, la :ref:`riproduzione di OGV <doc_playing_videos>` è possibile sia nelle build dell'editor sia nelle build di modello di esportazione.
ru: Запись OGV возможна только в сборках редактора. С другой стороны, :ref:`OGV playback <doc_playing_videos>` (воспроизведение) возможно как в сборках редактора, так и в сборках шаблонов экспорта.

source: AVI container with MJPEG for video and uncompressed audio. Features lossy video compression, resulting in medium file sizes and fast encoding. The lossy compression quality can be adjusted by changing **Editor > Movie Writer > Video Quality**.
it: Contenitore AVI con MJPEG per video e audio non compresso. Offre una compressione video con perdita di dati, che risulta in file di medie dimensioni e una codifica rapida. La qualità della compressione si può regolare modificando **Editor > Movie Writer > Qualità video**.
ru: Контейнер AVI с MJPEG для видео и несжатого звука. Сжатие видео с потерями, что обеспечивает средний размер файлов и быстрое кодирование. Качество сжатия с потерями можно настроить в меню **Editor > Movie Writer > MJPEG Quality**.

source: The resulting file can be viewed in most video players, but it must be converted to another format for viewing on the web or by Godot with the VideoStreamPlayer node. MJPEG does not support transparency. AVI output is currently limited to a file of 4 GB in size at most.
ga: Is féidir an comhad mar thoradh air a fheiceáil i bhformhór na seinnteoirí físe, ach caithfear é a thiontú go formáid eile le breathnú ar an ngréasán nó le Godot leis an nód VideoStreamPlayer. Ní thacaíonn MJPEG le trédhearcacht. Tá aschur AVI teoranta faoi láthair do chomhad de mhéid 4 GB ar a mhéid.
ru: Полученный файл можно просмотреть в большинстве видеоплееров, но для просмотра в интернете или с помощью Godot его необходимо конвертировать в другой формат с помощью узла VideoStreamPlayer. Формат MJPEG не поддерживает прозрачность. Размер выходного файла AVI в настоящее время ограничен 4 ГБ.
ta: இதன் விளைவாக வரும் கோப்பை பெரும்பாலான வீடியோ பிளேயர்களில் பார்க்கலாம், ஆனால் இது வலையில் பார்க்க அல்லது கிட்ச்ட்ராம்ப்ளேயர் முனையுடன் கோடோட் மூலம் மற்றொரு வடிவமாக மாற்றப்பட வேண்டும். MJPEG வெளிப்படைத்தன்மையை ஆதரிக்கவில்லை. ஏ.வி.ஐ வெளியீடு தற்போது 4 சிபி கோப்புக்கு மட்டுப்படுத்தப்பட்டுள்ளது.
uk: Отриманий файл можна переглядати в більшості відеопрогравачів, але його потрібно конвертувати в інший формат для перегляду в Інтернеті або Godot за допомогою вузла VideoStreamPlayer. MJPEG не підтримує прозорість. Вихід AVI наразі обмежений розміром файлу не більше 4 ГБ.

source: To use AVI, specify a path to a ``.avi`` file to be created in the **Editor > Movie Writer > Movie File** project setting.
ru: Чтобы использовать AVI, укажите путь к файлу ``.avi``, который будет создан в настройках проекта **Editor > Movie Writer > Movie File**.

source: PNG image sequence for video and WAV for audio. Features lossless video compression, at the cost of large file sizes and slow encoding. This is designed to be :ref:`encoded to a video file with an external tool after recording <doc_creating_movies_converting_avi>`.
ga: Seicheamh íomhá PNG le haghaidh físeáin agus WAV le haghaidh fuaime. Gnéithe comhbhrú físeáin lossless, ar chostas méideanna comhaid mór agus ionchódú mall. Tá sé seo deartha le bheith :ref:`ionchódaithe chuig físchomhad le huirlis sheachtrach tar éis <doc_creating_movies_converting_avi>` a thaifeadadh.
ru: Последовательность изображений PNG для видео и WAV для аудио. Обеспечивает сжатие видео без потерь, но при этом увеличивает размер файла и замедляет кодирование. Этот формат предназначен для :ref:`кодирования в видеофайл с помощью внешнего инструмента после записи <doc_creating_movies_converting_avi>`.
ta: வீடியோவுக்கான பி.என்.சி பட வரிசை மற்றும் ஆடியோவுக்கு WAV. பெரிய கோப்பு அளவுகள் மற்றும் மெதுவான குறியாக்கம் ஆகியவற்றின் விலை நச்டமற்ற வீடியோ சுருக்கத்தைக் கொண்டுள்ளது. இது வடிவமைக்கப்பட்டுள்ளது: ref: `<doc_creating_movies_converting_avi>` பதிவுசெய்த பிறகு வெளிப்புற கருவியுடன் வீடியோ கோப்பில் குறியாக்கம் செய்யப்பட்டது.
uk: Послідовність зображень PNG для відео та WAV для аудіо. Функції стиснення відео без втрат за рахунок великих розмірів файлів і повільного кодування. Це призначено для :ref:`encoded to a video file with an external tool after recording <doc_creating_movies_converting_avi>`.

source: Transparency is supported, but the root viewport **must** have its ``transparent_bg`` property set to ``true`` for transparency to be visible on the output image. This can be achieved by enabling the **Rendering > Transparent Background** advanced project setting. **Display > Window > Size > Transparent** and **Display > Window > Per Pixel Transparency > Enabled** can optionally be enabled to allow transparency to be previewed while recording the video, but they do not have to be enabled for the output image to contain transparency.
ga: Tacaítear le trédhearcacht, ach caithfidh ** an t-airí ``transparent_bg`` a bheith socraithe go `` fíor`` ag an radharc fréimhe ** le go mbeidh trédhearcacht le feiceáil ar an íomhá aschuir. Is féidir é seo a bhaint amach trí ardsocrú tionscadail **Rindreáil > Cúlra Trédhearcach** a chumasú. Is féidir **Taispeáin > Fuinneog > Méid > Trédhearcach** agus **Taispeáin > Fuinneog > Trédhearcacht Per Picteilín > Cumasaithe** a chumasú go roghnach chun an trédhearcacht a réamhamharc agus an físeán á thaifeadadh, ach ní gá iad a chumasú don íomhá aschuir chun trédhearcacht a chuimsiú.
ru: Прозрачность поддерживается, но для того, чтобы прозрачность была видна на выходном изображении, свойство ``transparent_bg`` корневой области просмотра **должно** быть установлено в значение ``true``. Этого можно добиться, включив расширенный параметр проекта **Rendering > Transparent Background**. Параметры**Display > Window > Size > Transparent** и **Display > Window > Per Pixel Transparency > Enabled** можно включить дополнительно, чтобы обеспечить предварительный просмотр прозрачности во время записи видео, но для того, чтобы выходное изображение содержало прозрачность, их включение необязательно.
ta: வெளிப்படைத்தன்மை ஆதரிக்கப்படுகிறது, ஆனால் ரூட் வியாபோர்ட் ** வெளியீட்டு படத்தில் வெளிப்படைத்தன்மை காணப்படுவதற்கு அதன் `` வெளிப்படையான_ பிசி`` சொத்து `` உண்மை`` என அமைக்கப்பட்டிருக்க வேண்டும். ** ரெண்டரிங்> வெளிப்படையான பின்னணி ** மேம்பட்ட திட்ட அமைப்பை இயக்குவதன் மூலம் இதை அடைய முடியும். . வெளிப்படைத்தன்மையைக் கொண்டிருக்கும் வெளியீட்டு படம்.
uk: Прозорість підтримується, але для властивості ``transparent_bg`` у кореневому вікні перегляду **має** встановлено значення ``true``, щоб прозорість була видимою на вихідному зображенні. Цього можна досягти, увімкнувши розширене налаштування проекту **Відтворення > Прозорий фон**. **Дисплей > Вікно > Розмір > Прозорий** і **Дисплей > Вікно > Прозорість на піксель > Увімкнено** можна додатково ввімкнути, щоб дозволити прозорість для попереднього перегляду під час запису відео, але їх не обов’язково вмикати для вихідне зображення містить прозорість.

source: To use PNG, specify a ``.png`` file to be created in the **Editor > Movie Writer > Movie File** project setting. The generated ``.wav`` file will have the same name as the ``.png`` file (minus the extension).
ga: Chun PNG a úsáid, sonraigh comhad ``.png`` atá le cruthú i socrú tionscadail **Eagarthóir > Scríbhneoir Scannán > Comhad Scannáin**. Beidh an t-ainm céanna ar an gcomhad ``.wav`` ginte agus atá ar an gcomhad ``.png`` (lúide an síneadh).
ru: Чтобы использовать PNG, укажите файл ``.png``, который нужно создать, в настройках проекта **Редактор > Редактор фильмов > Файл фильма**. Имя сгенерированного файла ``.wav`` будет совпадать с именем файла ``.png`` (за исключением расширения).
ta: PNG ஐப் பயன்படுத்த, ** எடிட்டர்> திரைப்பட எழுத்தாளர்> திரைப்பட கோப்பு ** திட்ட அமைப்பில் உருவாக்கப்பட வேண்டிய `` .png`` கோப்பைக் குறிப்பிடவும். உருவாக்கப்பட்ட `` .wav`` கோப்பில் `` .png`` கோப்பின் (நீட்டிப்பைக் கழித்தல்) அதே பெயரைக் கொண்டிருக்கும்.
uk: Щоб використовувати PNG, укажіть файл ``.png``, який потрібно створити, у параметрах проекту **Редактор > Сценарист фільму > Файл фільму**. Згенерований файл ``.wav`` матиме таку саму назву, що й файл ``.png`` (без розширення).

source: Custom
fr: Personnalisé
ga: Saincheaptha
it: Personalizzato
ru: Настраиваемый
ta: தனிப்பயன்
uk: Кастом
