Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/creating_movies.po
Languages: fr, ga, it, ru, ta, uk

source: The ``movie`` :ref:`feature tag <doc_feature_tags>` can be used to override specific project settings. This is useful to enable high-quality graphics settings that wouldn't be fast enough to run in real-time speeds on your hardware. Remember that putting every setting to its maximum value can still slow down movie saving speed, especially when recording at higher resolutions. Therefore, it's still recommended to only increase graphics settings if they make a meaningful difference in the output image.
ga: Is féidir an ``film`` :ref:`tag gné <doc_feature_tags>` a úsáid chun socruithe tionscadail ar leith a shárú. Tá sé seo úsáideach chun socruithe grafaicí ardcháilíochta a chumasú nach mbeadh sách tapa le rith ar luasanna fíor-ama ar do chrua-earraí. Cuimhnigh gur féidir moill a chur ar luas sábhála scannán má chuirtear gach suíomh ar a uasluach, go háirithe nuair a bhíonn tú ag taifeadadh ar réitigh níos airde. Mar sin, moltar fós socruithe grafaicí a mhéadú ach amháin má dhéanann siad difríocht shuntasach san íomhá aschuir.
ru: ``movie`` :ref:`feature tag <doc_feature_tags>` можно использовать для переопределения определённых настроек проекта. Это полезно для включения высококачественных графических настроек, которые недостаточно быстры для работы в реальном времени на вашем оборудовании. Помните, что установка максимальных значений для каждого параметра может замедлить сохранение фильма, особенно при записи в высоком разрешении. Поэтому рекомендуется увеличивать графические настройки только в том случае, если это существенно влияет на качество выходного изображения.
ta: `` திரைப்படம்``: குறிப்பு: `அம்சக் குறிச்சொல் <doc_feature_tags>` குறிப்பிட்ட திட்ட அமைப்புகளை மேலெழுத பயன்படுத்தலாம். உங்கள் வன்பொருளில் நிகழ்நேர வேகத்தில் இயங்குவதற்கு போதுமான வேகமாக இருக்காத உயர்தர கிராபிக்ச் அமைப்புகளை இயக்க இது பயனுள்ளதாக இருக்கும். ஒவ்வொரு அமைப்பையும் அதன் அதிகபட்ச மதிப்புக்கு வைப்பது திரைப்பட சேமிப்பு வேகத்தை மெதுவாக்கும் என்பதை நினைவில் கொள்ளுங்கள், குறிப்பாக அதிக தீர்மானங்களில் பதிவு செய்யும் போது. எனவே, வெளியீட்டு படத்தில் அர்த்தமுள்ள வித்தியாசத்தை ஏற்படுத்தினால் மட்டுமே கிராபிக்ச் அமைப்புகளை அதிகரிக்க பரிந்துரைக்கப்படுகிறது.
uk: ``movie`` :ref:`feature tag <doc_feature_tags>` можна використовувати для перевизначення певних налаштувань проекту. Це корисно для ввімкнення високоякісних графічних налаштувань, які не будуть достатньо швидкими для роботи в режимі реального часу на вашому обладнанні. Пам’ятайте, що встановлення максимального значення кожного параметра все одно може сповільнити швидкість збереження відео, особливо під час запису з вищою роздільною здатністю. Тому все одно рекомендується збільшувати параметри графіки лише в тому випадку, якщо вони істотно впливають на вихідне зображення.

source: This feature tag can also be queried in a script to increase quality settings that are set in the Environment resource. For example, to further improve SDFGI detail and reduce light leaking:
ga: Is féidir an chlib gné seo a fhiosrú i script freisin chun socruithe cáilíochta atá socraithe san acmhainn Comhshaoil a mhéadú. Mar shampla, chun mionsonraí SDFGI a fheabhsú tuilleadh agus sceitheadh solais a laghdú:
ru: Этот тег объекта также можно использовать в скрипте для повышения настроек качества, заданных в ресурсе Environment. Например, для дальнейшего улучшения детализации SDFGI и уменьшения засветки:
ta: சுற்றுச்சூழல் வளத்தில் அமைக்கப்பட்டிருக்கும் தர அமைப்புகளை அதிகரிக்க இந்த அம்சக் குறிச்சொல்லை ஒரு ச்கிரிப்டில் வினவலாம். எடுத்துக்காட்டாக, SDFGI விவரங்களை மேலும் மேம்படுத்தவும், ஒளி கசிவைக் குறைக்கவும்:
uk: Цей тег функції також можна запитувати в сценарії, щоб збільшити параметри якості, встановлені в ресурсі середовища. Наприклад, для подальшого вдосконалення деталей SDFGI та зменшення витоку світла:

source: Rendering at a higher resolution than the screen resolution
ga: Rindreáil ag taifeach níos airde ná taifeach an scáileáin
ru: Рендеринг с более высоким разрешением, чем разрешение экрана
ta: திரை தெளிவுத்திறனை விட அதிக தெளிவுத்திறனில் வழங்குதல்
uk: Візуалізація з роздільною здатністю, вищою за роздільну здатність екрана

source: The overall rendering quality can be improved significantly by rendering at high resolutions such as 4K or 8K.
ga: Is féidir an caighdeán rindreála foriomlán a fheabhsú go suntasach trí rindreáil ag rúin arda mar 4K nó 8K.
ru: Общее качество рендеринга можно значительно улучшить, используя рендеринг в высоких разрешениях, таких как 4K или 8K.
ta: 4K அல்லது 8K போன்ற உயர் தீர்மானங்களில் வழங்குவதன் மூலம் ஒட்டுமொத்த வழங்குதல் தரத்தை கணிசமாக மேம்படுத்த முடியும்.
uk: Загальну якість візуалізації можна значно покращити за допомогою візуалізації у високій роздільній здатності, наприклад 4K або 8K.

source: For 3D rendering, Godot provides a **Rendering > Scaling 3D > Scale** advanced project setting, which can be set above ``1.0`` to obtain *supersample antialiasing*. The 3D rendering is then *downsampled* when it's drawn on the viewport. This provides an expensive but high-quality form of antialiasing, without increasing the final output resolution.
ga: Le haghaidh rindreála 3D, soláthraíonn Godot ardsocrú tionscadail **Rindreáil > Scálú 3D > Scála**, ar féidir é a shocrú os cionn ``1.0`` chun *frithaliasing supersample* a fháil. Déantar an rindreáil 3D ansin *íosshampláil* nuair a tharraingítear ar an gcalafort é. Soláthraíonn sé seo foirm fhrithalaíoch costasach ach ardcháilíochta, gan an taifeach aschuir deiridh a mhéadú.
ru: Для 3D-рендеринга Godot предоставляет расширенный параметр проекта **Rendering > Scaling 3D > Scale**, который можно установить выше ``1.0`` для достижения *суперсэмплинга*. Затем 3D-рендеринг *понижается* при отображении на окне просмотра. Это обеспечивает дорогостоящий, но высококачественный вид сглаживания без увеличения конечного разрешения.
ta: 3D ரெண்டரிங்கிற்கு, கோடோட் ஒரு ** ரெண்டரிங்> அளவிடுதல் 3D> அளவுகோல் ** மேம்பட்ட திட்ட அமைப்பை வழங்குகிறது, இது*சூப்பர்செம்பிளி ஆன்டியாலியாசிங்*பெற `` 1.0`` க்கு மேலே அமைக்கப்படலாம். 3D வழங்குதல் பின்னர் பார்வைக் கூட்டத்தில் வரையப்படும்போது * குறைக்கப்பட்டுள்ளது. இது இறுதி வெளியீட்டுத் தீர்மானத்தை அதிகரிக்காமல், விலையுயர்ந்த ஆனால் உயர்தர ஆண்டியலிசிங்கை வழங்குகிறது.
uk: Для 3D-рендерінгу Godot надає розширені параметри проекту **Відтворення > Масштабування 3D > Масштаб**, які можна встановити вище ``1.0``, щоб отримати *згладжування супервибірки*. Тоді 3D-візуалізація *зменшується*, коли вона малюється у вікні перегляду. Це забезпечує дорогу, але високоякісну форму згладжування без збільшення кінцевої роздільної здатності.

source: Consider using this project setting first, as it avoids slowing down movie writing speeds and increasing output file size compared to actually increasing the output resolution.
ga: Smaoinigh ar an socrú tionscadail seo a úsáid ar dtús, mar seachnaíonn sé luasanna scríbhneoireachta scannán a mhoilliú agus méid comhaid aschuir a mhéadú i gcomparáid leis an taifeach aschuir a mhéadú.
ru: Рассмотрите возможность использования этой настройки проекта в первую очередь, поскольку она позволяет избежать снижения скорости записи фильма и увеличения размера выходного файла по сравнению с фактическим увеличением выходного разрешения.
ta: இந்த திட்ட அமைப்பைப் பயன்படுத்துவதைக் கவனியுங்கள், ஏனெனில் இது திரைப்பட எழுதும் வேகத்தை குறைப்பதைத் தவிர்க்கிறது மற்றும் வெளியீட்டு தீர்மானத்தை அதிகரிப்பதை ஒப்பிடும்போது வெளியீட்டு கோப்பு அளவை அதிகரிப்பதைத் தவிர்க்கிறது.
uk: Спершу скористайтеся цим параметром проекту, оскільки він дозволяє уникнути уповільнення швидкості запису фільму та збільшення розміру вихідного файлу порівняно зі збільшенням вихідної роздільної здатності.

source: If you wish to render 2D at a higher resolution, or if you actually need the higher raw pixel output for 3D rendering, you can increase the resolution above what the screen allows.
ga: Más mian leat 2D a rindreáil ag taifeach níos airde, nó má theastaíonn an t-aschur picteilín amh níos airde uait le haghaidh rindreáil 3D, is féidir leat an taifeach a mhéadú os cionn an méid a cheadaíonn an scáileán.
ru: Если вы хотите визуализировать 2D-изображение с более высоким разрешением или вам действительно требуется большее количество необработанных пикселей для 3D-рендеринга, вы можете увеличить разрешение выше того, что позволяет экран.
ta: அதிக தெளிவுத்திறனில் 2D ஐ வழங்க விரும்பினால், அல்லது 3D ரெண்டரிங்கிற்கான அதிக மூல படப்புள்ளி வெளியீடு உங்களுக்கு உண்மையில் தேவைப்பட்டால், திரை அனுமதிப்பதை விட தீர்மானத்தை அதிகரிக்கலாம்.
uk: Якщо ви бажаєте відтворити 2D із вищою роздільною здатністю або якщо вам справді потрібна більша вихідна кількість необроблених пікселів для 3D-відтворення, ви можете збільшити роздільну здатність вище, ніж дозволяє екран.

source: By default, Godot uses the ``disabled`` :ref:`stretch modes <doc_multiple_resolutions>` in projects. If using ``disabled`` or ``canvas_items`` stretch mode, the window size dictates the output video resolution.
ga: De réir réamhshocraithe, úsáideann Godot na ``disabled`` :ref:`modhanna stráice <doc_multiple_resolutions>` i dtionscadail. Más mód stráice `` míchumasaithe`` nó `` canbhás_ítimí`` a úsáid, is é méid na fuinneoige a shocraíonn taifeach an fhíseáin aschuir.
ru: По умолчанию Godot использует в проектах ``disabled`` :ref:`режимы растяжения <doc_multiple_resolutions>`. При использовании режима растяжения ``disabled`` или ``canvas_items`` размер окна определяет разрешение выходного видео.
ta: இயல்பாக, கோடோட் `` முடக்கப்பட்ட`` ஐப் பயன்படுத்துகிறார்: ref: `திட்டங்களில் <doc_multiple_resolutions>` திட்டங்களில். `` முடக்கப்பட்ட`` அல்லது `` கேன்வாச்_இடெம்கள்` நீளமான பயன்முறையைப் பயன்படுத்தினால், சாளர அளவு வெளியீட்டு வீடியோ தீர்மானத்தை ஆணையிடுகிறது.
uk: За замовчуванням Godot використовує в проектах ``вимкнені`` :ref:`stretch modes <doc_multiple_resolutions>`. Якщо використовується режим розтягування ``disabled`` або ``canvas_items``, розмір вікна визначає роздільну здатність вихідного відео.

source: On the other hand, if the project is configured to use the ``viewport`` stretch mode, the viewport resolution dictates the output video resolution. The viewport resolution is set using the **Display > Window > Size > Viewport Width** and **Viewport Height** project settings. This can be used to render a video at a higher resolution than the screen resolution.
ga: Ar an láimh eile, má tá an tionscadal cumraithe chun an modh stráice ``viewport`` a úsáid, is é an t-amharc a shocraíonn taifeach an fhíseáin aschuir. Socraítear taifeach an amhairc ag baint úsáide as na socruithe tionscadail **Taispeáin > Fuinneog > Méid > Leithead Viewport** agus **Airde Viewport**. Is féidir é seo a úsáid chun físeán a sholáthar ag taifeach níos airde ná an scáileán.
ru: С другой стороны, если проект настроен на использование режима растяжения ``viewport``, разрешение области просмотра определяет выходное разрешение видео. Разрешение области просмотра задаётся в настройках проекта **Display > Window > Size > Viewport Width** и **Viewport Height**. Это можно использовать для рендеринга видео с разрешением выше разрешения экрана.
ta: மறுபுறம், திட்டம் `` ViewPort`` நீட்டிக்க பயன்முறையைப் பயன்படுத்த கட்டமைக்கப்பட்டிருந்தால், வியூபோர்ட் தீர்மானம் வெளியீட்டு வீடியோ தீர்மானத்தை ஆணையிடுகிறது. பார்வைப்போர்ட் தீர்மானம் ** காட்சி> சாளரம்> அளவு> காட்சியகம் அகலம் ** மற்றும் ** வியூபோர்ட் உயரம் ** திட்ட அமைப்புகளைப் பயன்படுத்தி அமைக்கப்பட்டுள்ளது. திரை தெளிவுத்திறனை விட அதிக தெளிவுத்திறனில் வீடியோவை வழங்க இதைப் பயன்படுத்தலாம்.
uk: З іншого боку, якщо проект налаштовано на використання режиму розтягування ``viewport``, роздільна здатність вікна перегляду визначає роздільну здатність вихідного відео. Роздільна здатність вікна перегляду встановлюється за допомогою параметрів проекту **Дисплей > Вікно > Розмір > Ширина вікна перегляду** і **Висота вікна перегляду**. Це можна використовувати для відтворення відео з роздільною здатністю, вищою за роздільну здатність екрана.

source: To make the window smaller during recording without affecting the output video resolution, you can set the **Display > Window > Size > Window Width Override** and **Window Height Override** advanced project settings to values greater than ``0``.
ga: Chun an fhuinneog a laghdú le linn taifeadta gan cur isteach ar thaifeach an fhíseáin, is féidir leat na hardsocruithe tionscadail **Taispeáin > Fuinneog > Méid > Sárú Leithead Fuinneog** agus **Sárú Airde Fuinneog** a shocrú chuig luachanna níos mó ná `` 0` `.
ru: Чтобы уменьшить размер окна во время записи, не влияя на разрешение выходного видео, можно установить для расширенных параметров проекта **Display > Window > Size > Window Width Override** и **Window Height Override** значения больше ``0``.
ta: வெளியீட்டு வீடியோ தெளிவுத்திறனை பாதிக்காமல் பதிவு செய்யும் போது சாளரத்தை சிறியதாக மாற்ற, நீங்கள் ** காட்சி> சாளரம்> அளவு> சாளர அகலம் மேலெழுதல் ** மற்றும் ** சாளர உயரம் மீறுதல் ** மேம்பட்ட திட்ட அமைப்புகளை `` 0` ஐ விட அதிகமான மதிப்புகளுக்கு அமைக்கலாம் `.
uk: Щоб зменшити вікно під час запису, не впливаючи на роздільну здатність вихідного відео, ви можете встановити **Дисплей > Вікно > Розмір > Заміна ширини вікна** і **Window Height Override** розширені параметри проекту на значення, що перевищують ``0``.

source: To apply a resolution override only when recording a movie, you can override those settings with the ``movie`` :ref:`feature tag <doc_feature_tags>`.
ga: Chun sáraithe taifeach a chur i bhfeidhm agus scannán á thaifeadadh amháin, is féidir leat na socruithe sin a shárú leis an ``film`` :ref:`clib gné <doc_feature_tags>`.
ru: Чтобы применить переопределение разрешения только при записи фильма, вы можете переопределить эти настройки с помощью ``movie`` :ref:`feature tag <doc_feature_tags>`.
ta: ஒரு திரைப்படத்தை பதிவு செய்யும் போது மட்டுமே ஒரு தீர்மானம் மேலெழுதலைப் பயன்படுத்த, நீங்கள் `` திரைப்படம்``: `அம்சக் குறிச்சொல் <doc அம்சம்_டேக்ச்>` உடன் அமைப்புகளை மேலெழுதலாம்.
uk: Щоб застосувати заміну роздільної здатності лише під час запису фільму, ви можете змінити ці параметри за допомогою ``movie`` :ref:`feature tag <doc_feature_tags>`.

source: Post-processing steps
fr: Étapes de post-traitement
ga: Céimeanna iar-phróisis
it: Passaggi di post-elaborazione
ru: Этапы постобработки
ta: பிந்தைய செயலாக்க படிகள்
uk: Етапи постобробки

source: Some common post-processing steps are listed below.
ga: Tá roinnt céimeanna coitianta iar-phróiseála liostaithe thíos.
ru: Ниже перечислены некоторые общие этапы постобработки.
ta: சில பொதுவான பிந்தைய செயலாக்க படிகள் கீழே பட்டியலிடப்பட்டுள்ளன.
uk: Нижче наведено кілька типових етапів постобробки.

source: When using several post-processing steps, try to perform all of them in a single FFmpeg command. This will save encoding time and improve quality by avoiding multiple lossy encoding steps.
ga: Agus roinnt céimeanna iar-phróiseála á n-úsáid agat, déan iarracht iad go léir a dhéanamh in aon ordú FFmpeg amháin. Sábhálfaidh sé seo am ionchódaithe agus feabhsóidh sé cáilíocht trí ilchéimeanna ionchódaithe caillte a sheachaint.
ru: При использовании нескольких этапов постобработки старайтесь выполнять их все одной командой FFmpeg. Это сэкономит время кодирования и повысит качество, избегая многократного кодирования с потерями.
ta: பல பிந்தைய செயலாக்க படிகளைப் பயன்படுத்தும் போது, அவை அனைத்தையும் ஒரே FFMPEG கட்டளையில் செய்ய முயற்சிக்கவும். இது குறியீட்டு நேரத்தை மிச்சப்படுத்தும் மற்றும் பல இழப்பு குறியாக்க படிகளைத் தவிர்ப்பதன் மூலம் தரத்தை மேம்படுத்தும்.
uk: У разі використання кількох етапів постобробки спробуйте виконати їх усі в одній команді FFmpeg. Це заощадить час кодування та покращить якість завдяки уникненню кількох кроків кодування з втратами.

source: Converting OGV/AVI video to MP4
it: Convertire un video OGV/AVI in MP4
ru: Конвертация видео OGV/AVI в MP4

source: While some platforms such as YouTube support uploading the AVI file directly, many others will require a conversion step beforehand. `HandBrake <https://handbrake.fr/>`__ (GUI) and `FFmpeg <https://ffmpeg.org/>`__ (CLI) are popular open source tools for this purpose. FFmpeg has a steeper learning curve, but it's more powerful.
ga: Cé go dtacaíonn roinnt ardáin ar nós YouTube uaslódáil an comhad AVI go díreach, beidh go leor eile a cheangal ar chéim chomhshó roimh ré. Is uirlisí foinse oscailte coitianta iad `HandBrake <https://handbrake.fr/>`__ (GUI) agus `FFmpeg <https://ffmpeg.org/>`__ (CLI) chun na críche seo. Tá cuar foghlama níos géire ag FFmpeg, ach tá sé níos cumhachtaí.
ru: Хотя некоторые платформы, такие как YouTube, поддерживают прямую загрузку AVI-файла, многие другие требуют предварительного преобразования. `HandBrake <https://handbrake.fr/>`__ (графический интерфейс) и `FFmpeg <https://ffmpeg.org/>`__ (командная строка) — популярные инструменты с открытым исходным кодом для этой цели. FFmpeg требует более сложного освоения, но и результат гораздо достойный.
ta: YouTube போன்ற சில தளங்கள் AVI கோப்பை நேரடியாக பதிவேற்றுவதை ஆதரிக்கும்போது, பலருக்கு முன்பே மாற்று படி தேவைப்படும். `ஏண்ட்பிரேக் <https://handbrake.fr/>` __ (GUI) மற்றும் `ffmpeg <https://ffmpeg.org/> __ (CLI) இந்த நோக்கத்திற்காக பிரபலமான திறந்த மூல கருவிகள். FFMPEG ஒரு செங்குத்தான கற்றல் வளைவைக் கொண்டுள்ளது, ஆனால் இது மிகவும் ஆற்றல் வாய்ந்தது.
uk: Хоча деякі платформи, такі як YouTube, підтримують пряме завантаження файлу AVI, багато інших потребують попереднього перетворення. `HandBrake <https://handbrake.fr/>`__ (GUI) і `FFmpeg <https://ffmpeg.org/>`__ (CLI) є популярними інструментами з відкритим кодом для цієї мети. FFmpeg має крутішу криву навчання, але він потужніший.

source: The command below converts an OGV/AVI video to an MP4 (H.264) video with a Constant Rate Factor (CRF) of 15. This results in a relatively large file, but is well-suited for platforms that will re-encode your videos to reduce their size (such as most video sharing websites):
ru: Приведенная ниже команда преобразует видео OGV/AVI в видео MP4 (H.264) с Постоянным Фактором Скорости (CRF), равным 15. В результате получается относительно большой файл, но он хорошо подходит для платформ, которые перекодируют ваши видео для уменьшения их размера (например, большинство сайтов для обмена видео):

source: To get a smaller file at the cost of quality, *increase* the CRF value in the above command.
ga: Chun comhad níos lú a fháil ar chostas cáilíochta, * méadaí* an luach CRF san ordú thuas.
ru: Чтобы получить файл меньшего размера за счет качества, *увеличьте* значение CRF в приведенной выше команде.
ta: தரத்தின் விலையில் ஒரு சிறிய கோப்பைப் பெற, மேலே உள்ள கட்டளையில் CRF மதிப்பை * அதிகரிக்கவும்.
uk: Щоб отримати менший файл ціною якості, *збільште* значення CRF у наведеній вище команді.

source: To get a file with a better size/quality ratio (at the cost of slower encoding times), add ``-preset veryslow`` before ``-crf 15`` in the above command. On the contrary, ``-preset veryfast`` can be used to achieve faster encoding at the cost of a worse size/quality ratio.
ga: Chun comhad a fháil le cóimheas méid/cáilíochta níos fearr (ar chostas amanna ionchódú níos moille), cuir ``-réamhshocraithe veryslow`` roimh ``-crf 15`` san ordú thuas. A mhalairt ar fad, is féidir ``-réamhshocraithe an-fast`` a úsáid chun ionchódú níos tapa a bhaint amach ar chostas cóimheas méide/cáilíochta níos measa.
ru: Чтобы получить файл с лучшим соотношением размера и качества (за счёт более медленного кодирования), добавьте ``-preset veryslow`` перед ``-crf 15`` в приведённой выше команде. Напротив, ``-preset veryfast`` можно использовать для ускорения кодирования за счёт худшего соотношения размера и качества.
ta: சிறந்த அளவு/தர விகிதத்துடன் ஒரு கோப்பைப் பெற (மெதுவான குறியாக்க நேரங்களின் செலவில்), மேலே உள்ள கட்டளையில் `` -crf 15`` க்கு முன் `` -பிரசெட் வெரிச்லோவைச் சேர்க்கவும். மாறாக, மோசமான அளவு/தர விகிதத்தின் விலையில் விரைவான குறியாக்கத்தை அடைய `` -பிரசெட் வெரிஃபாச்ட்`` பயன்படுத்தப்படலாம்.
uk: Щоб отримати файл із кращим співвідношенням розмір/якість (ціною меншого часу кодування), додайте ``-preset veryslow`` перед ``-crf 15`` у наведеній вище команді. Навпаки, ``-preset veryfast`` можна використовувати для досягнення швидшого кодування ціною гіршого співвідношення розмір/якість.

source: Converting PNG image sequence + WAV audio to a video
ga: Seicheamh íomhá PNG+fuaim WAV a thiontú go físeán
ru: Конвертация последовательности изображений PNG + звука WAV в видео
ta: PNG பட வரிசை + WAV ஆடியோவை வீடியோவாக மாற்றுகிறது
uk: Перетворення послідовності зображень PNG + аудіо WAV у відео

source: If you chose to record a PNG image sequence with a WAV file beside it, you need to convert it to a video before you can use it elsewhere.
ga: Má roghnaigh tú seicheamh íomhá PNG a thaifeadadh le comhad WAV in aice leis, ní mór duit é a thiontú go físeán sula bhféadfaidh tú é a úsáid in áiteanna eile.
ru: Если вы решили записать последовательность изображений PNG с файлом WAV рядом, вам необходимо преобразовать их в видео, прежде чем вы сможете использовать ее где-либо еще.
ta: ஒரு வாவ் கோப்புடன் ஒரு பி.என்.சி பட வரிசையை பதிவு செய்ய நீங்கள் தேர்வுசெய்தால், நீங்கள் அதை வேறு எங்கும் பயன்படுத்துவதற்கு முன்பு அதை ஒரு வீடியோவாக மாற்ற வேண்டும்.
uk: Якщо ви вирішите записати послідовність зображень у форматі PNG із файлом WAV поруч, вам потрібно перетворити його на відео, перш ніж ви зможете використовувати його в іншому місці.

source: The filename for the PNG image sequence generated by Godot always contains 8 digits, starting at 0 with zero-padded numbers. If you specify an output path ``folder/example.png``, Godot will write ``folder/example00000000.png``, ``folder/example00000001.png``, and so on in that folder. The audio will be saved at ``folder/example.wav``.
ga: Tá 8 dhigit i gcónaí san ainm comhaid don seicheamh íomhá PNG a ghineann Godot, ag tosú ag 0 le huimhreacha nialasaithe. Má shonraíonn tú cosán aschuir ``folder/example.png``, scríobhfaidh Godot ``folder/example00000000.png``, `folder/example00000001.png``, agus mar sin de san fhillteán sin. Sábhálfar an fuaim ag ``folder/example.wav``.
ru: Имя файла последовательности PNG-изображений, генерируемой Godot, всегда содержит 8 цифр, начиная с 0 и дополняя их нулями. Если указать путь к выходу ``folder/example.png``, Godot запишет в эту папку ``folder/example00000000.png``, ``folder/example00000001.png`` и так далее. Звук будет сохранён в ``folder/example.wav``.
ta: கோடோட்டால் உருவாக்கப்பட்ட பி.என்.சி பட வரிசைக்கான கோப்பு பெயர் எப்போதும் 8 இலக்கங்களைக் கொண்டுள்ளது, இது பூச்சிய-துடுப்பு எண்களுடன் 0 இல் தொடங்குகிறது. நீங்கள் ஒரு வெளியீட்டு பாதையை `` கோப்புறை/எடுத்துக்காட்டு. ஆடியோ `` கோப்புறை/எடுத்துக்காட்டு.வவ்`` இல் சேமிக்கப்படும்.
uk: Ім’я файлу для послідовності зображень у форматі PNG, згенероване Godot, завжди містить 8 цифр, починаючи з 0 із доповненням до нуля. Якщо ви вкажете вихідний шлях ``folder/example.png``, Godot запише ``folder/example00000000.png``, ``folder/example00000001.png`` і так далі в цій папці. Аудіо буде збережено в ``folder/example.wav``.
