Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/playing_videos.po
Languages: ga, it, ru, ta, uk

source: Make sure your copy of FFmpeg is compiled with libtheora and libvorbis support. You can check this by running ``ffmpeg`` without any arguments, then looking at the ``configuration:`` line in the command output.
ga: Déan cinnte go ndéantar do chóip de FFmpeg a thiomsú le tacaíocht libtheora agus libvorbis. Is féidir leat é seo a sheiceáil trí `ffmpeg`` a rith gan aon argóintí, ansin féachaint ar an líne ``cumraíocht: ``san aschur ordaithe.
it: Assicurati che la tua copia di FFmpeg sia compilata con il supporto per libtheora e libvorbis. Si può verificare eseguendo ``ffmpeg`` senza argomenti, quindi esaminando la riga ``configuration:`` nell'output del comando.
ru: Убедитесь, что ваша копия FFmpeg скомпилирована с поддержкой libtheora и libvorbis. Вы можете проверить это, запустив ``ffmpeg`` без каких-либо аргументов, а затем просмотрев строку ``configuration:`` в выходных данных команды.
ta: FFMPEG இன் உங்கள் நகல் லிப்தீரா மற்றும் லிப்வார்பிச் ஆதரவுடன் தொகுக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். எந்தவொரு வாதங்களும் இல்லாமல் `` ffmpeg`` ஐ இயக்குவதன் மூலம் இதைச் சரிபார்க்கலாம், பின்னர் `` உள்ளமைவு: `` கட்டளை வெளியீட்டில் வரியைப் பார்க்கலாம்.
uk: Переконайтеся, що вашу копію FFmpeg скомпільовано з підтримкою libtheora і libvorbis. Ви можете перевірити це, виконавши команду ``ffmpeg`` без жодних аргументів, а потім переглянувши рядок ``configuration:`` у виведенні команди.

source: Current official FFmpeg releases have some bugs in their Ogg/Theora multiplexer. It's highly recommended to use one of the latest static daily builds, or build from their master branch to get the latest fixes.
it: Le attuali versioni ufficiali di FFmpeg hanno alcuni bug nel multiplexer Ogg/Theora. Si consiglia vivamente di utilizzare una delle ultime build statiche giornaliere o di compilare dal ramo master per ottenere le correzioni più recenti.
ru: Текущие официальные версии FFmpeg содержат ошибки в мультиплексоре Ogg/Theora. Настоятельно рекомендуется использовать одну из последних статических ежедневных сборок или сборку из основной ветки, чтобы получить актуальные исправления.
uk: Поточні офіційні релізи FFmpeg містять деякі помилки в мультиплексорі Ogg/Theora. Наполегливо рекомендується використовувати одну з останніх статичних щоденних збірок або збирати з їхньої гілки master, щоб отримати останні виправлення.

source: Balancing quality and file size
ga: Cáilíocht agus méid comhaid a chothromú
it: Bilanciare tra qualità e dimensione di file
ru: Балансирует между качеством и размером файла
ta: தகுதி மற்றும் கோப்பு அளவு சமநிலைப்படுத்துதல்
uk: Баланс якості та розміру файлу

source: The **video quality** level (``-q:v``) must be between ``1`` and ``10``. Quality ``6`` is a good compromise between quality and file size. If encoding at a high resolution (such as 1440p or 4K), you will probably want to decrease ``-q:v`` to ``5`` to keep file sizes reasonable. Since pixel density is higher on a 1440p or 4K video, lower quality presets at higher resolutions will look as good or better compared to low-resolution videos.
ga: Caithfidh an leibhéil cáilíochta físeána** (``-q:V``) a bheith idir ``1`` agus ``10``. Is comhréiteach maith é cáilíocht ```6`` idir cáilíocht agus méid an chomhaid. Má tá ionchódú ag taifeach ard (mar shampla 1440p nó 4K), is dócha go mbeidh tú ag iarraidh ``-q:V`` a laghdú go ```5`` chun méideanna comhaid a choinneáil réasúnta. Ós rud é go bhfuil dlús picteilín níos airde ar fhíseán 1440p nó 4K, beidh cuma chomh maith nó níos fearr ar réamhshocruithe ar chaighdeán níos ísle ag rúin níos airde i gcomparáid le físeáin ísealtaifigh.
it: Il livello di **qualità video** (``-q:v``) deve essere compreso tra ``1`` e ``10``. La qualità ``6`` è un buon compromesso tra qualità e dimensioni del file. Se si codifica ad alta risoluzione (come 1440p o 4K), probabilmente si vorrà ridurre ``-q:v`` a ``5`` per mantenere ragionevoli le dimensioni del file. Poiché la densità dei pixel è maggiore su un video 1440p o 4K, i preset di qualità inferiori a risoluzioni più elevate avranno un aspetto altrettanto buono o migliore rispetto ai video a bassa risoluzione.
ru: Уровень **качества видео** (``-q:v``) должен находиться в диапазоне от ``1`` до ``10``. Качество ``6`` является хорошим компромиссом между качеством и размером файла. При кодировании в высоком разрешении (например, 1440p или 4K) для сохранения приемлемого размера файла, вероятно, потребуется уменьшить ``-q:v`` до ``5``. Поскольку плотность пикселей на видео с разрешением 1440p или 4K выше, пресеты с более низким качеством при высоком разрешении будут выглядеть так же или даже лучше, чем видео с низким разрешением.
ta: ** வீடியோ தகுதி ** நிலை (`` -q: v``) `` 1`` மற்றும் `10`` க்கு இடையில் இருக்க வேண்டும். தகுதி `6`` என்பது தகுதி மற்றும் கோப்பு அளவிற்கு இடையில் ஒரு நல்ல சமரசமாகும். உயர் தெளிவுத்திறனில் (1440p அல்லது 4k போன்றவை) குறியாக்கம் செய்தால், கோப்பு அளவுகளை நியாயமானதாக வைத்திருக்க `` -q: v`` முதல் `5`` வரை குறைக்க விரும்புவீர்கள். 1440p அல்லது 4K வீடியோவில் படப்புள்ளி அடர்த்தி அதிகமாக இருப்பதால், குறைந்த தெளிவுத்திறன் கொண்ட வீடியோக்களுடன் ஒப்பிடும்போது அதிக தீர்மானங்களில் குறைந்த தரமான முன்னமைவுகள் நன்றாகவோ அல்லது சிறப்பாகவோ இருக்கும்.
uk: Рівень **якості відео** (``-q:v``) повинен бути між ``1`` і ``10``. Якість ``6`` є хорошим компромісом між якістю та розміром файлу. Якщо ви кодуєте з високою роздільною здатністю (наприклад, 1440p або 4K), ви, ймовірно, захочете зменшити ``-q:v`` до ``5``, щоб зберегти розмір файлу розумним. Оскільки щільність пікселів у відео з роздільною здатністю 1440p, або 4K, вища, пресети з нижчою якістю у вищій роздільній здатності виглядатимуть так само добре, або навіть краще, ніж відео з низькою роздільною здатністю.

source: The **audio quality** level (``-q:a``) must be between ``-1`` and ``10``. Quality ``6`` provides a good compromise between quality and file size. In contrast to video quality, increasing audio quality doesn't increase the output file size nearly as much. Therefore, if you want the cleanest audio possible, you can increase this to ``9`` to get *perceptually lossless* audio. This is especially valuable if your input file already uses lossy audio compression. Higher quality audio does increase the CPU usage of the decoder, so it might lead to audio dropouts in case of high system load. See `this page <https://wiki.hydrogenaud.io/index.php?title=Recommended_Ogg_Vorbis#Recommended_Encoder_Settings>`__ for a table listing Ogg Vorbis audio quality presets and their respective variable bitrates.
ga: Caithfidh an leibhéal **cáilíochta** (``-q:a``) a bheith idir ``-1`` agus ``10``. Soláthraíonn cáilíocht `` 6`` comhréiteach maith idir cáilíocht agus méid comhaid. I gcodarsnacht le cáilíocht físeáin, ní mhéadaíonn méadú ar chaighdeán fuaime an méid comhaid aschuir beagnach oiread. Dá bhrí sin, más mian leat an fhuaim is glaine is féidir, is féidir leat é seo a mhéadú go dtí `` 9`` chun fuaim * gan aireachtáil * a fháil. Tá sé seo luachmhar go háirithe má úsáideann do chomhad ionchuir comhbhrú fuaime caillte cheana féin. Méadaíonn fuaime ar chaighdeán níos airde úsáid LAP an díchódóra, agus mar sin d’fhéadfadh titim amach fuaime a bheith mar thoradh air i gcás ualach ard córais. Féach `an leathanach seo <https://wiki.hydrogenaud.io/index.php?title=Recommended_Ogg_Vorbis#Recommended_Encoder_Settings>`__ le haghaidh tábla ina liostaítear réamhshocruithe cáilíochta fuaime Ogg Vorbis agus a gcuid giotán athróg faoi seach.
ru: Уровень **качества аудио** (``-q:a``) должен находиться диапазоне от ``-1`` до ``10``. Качество ``6`` обеспечивает хороший компромисс между качеством и размером файла. В отличие от качества видео, повышение качества звука не приводит к значительному увеличению размера выходного файла. Поэтому, если вы хотите получить максимально чистый звук, вы можете увеличить это значение до ``9``, чтобы получить звук без потерь восприятия. Это особенно ценно, если во входном файле уже используется сжатие звука с потерями. Более высокое качество звука увеличивает нагрузку на процессор декодера, поэтому при высокой нагрузке на систему это может привести к отключению звука. Смотрите таблицу с настройками качества звука Ogg Vorbis и соответствующими им переменными битрейтами на `этой странице <https://wiki.hydrogenaud.io/index.php?title=Recommended_Ogg_Vorbis#Recommended_Encoder_Settings>`__.
ta: ** ஆடியோ தகுதி ** நிலை (`` -q: a``) `` -1`` மற்றும் `10`` க்கு இடையில் இருக்க வேண்டும். தகுதி `6`` தகுதி மற்றும் கோப்பு அளவிற்கு இடையில் ஒரு நல்ல சமரசத்தை வழங்குகிறது. வீடியோ தரத்திற்கு மாறாக, ஆடியோ தரத்தை அதிகரிப்பது வெளியீட்டு கோப்பு அளவை கிட்டத்தட்ட அதிகரிக்காது. எனவே, தூய்மையான ஆடியோவை நீங்கள் விரும்பினால், இதை நீங்கள் `` 9`` ஆக அதிகரிக்கலாம் * புலனுணர்வு இழப்பற்ற * ஆடியோவைப் பெறலாம். உங்கள் உள்ளீட்டு கோப்பு ஏற்கனவே இழப்பு ஆடியோ சுருக்கத்தைப் பயன்படுத்தினால் இது குறிப்பாக மதிப்புமிக்கது. உயர் தரமான ஆடியோ டிகோடரின் சிபியு பயன்பாட்டை அதிகரிக்கும், எனவே இது உயர் கணினி சுமை ஏற்பட்டால் ஆடியோ கைவிடுதல்களுக்கு வழிவகுக்கும். `இந்த பக்கம் <https://wiki.hydregenaud.io/Index.php?
uk: Рівень **якості аудіо** (``-q:a``) має бути між ``-1`` і ``10``. Якість ``6`` забезпечує хороший компроміс між якістю та розміром файлу. На відміну від якості відео, підвищення якості звуку майже не збільшує розмір вихідного файлу. Тому, якщо вам потрібен найчистіший звук, ви можете збільшити значення до ``9``, щоб отримати звук *без втрат*. Це особливо цінно, якщо ваш вхідний файл уже використовує стиснення звуку з втратами. Аудіо вищої якості дійсно збільшує використання ЦП декодера, тому це може призвести до випадання звуку в разі високого навантаження на систему. Перегляньте `цю сторінку <https://wiki.hydrogenaud.io/index.php?title=Recommended_Ogg_Vorbis#Recommended_Encoder_Settings>`__ для таблиці зі списком попередніх налаштувань якості аудіо Ogg Vorbis і відповідних змінних бітрейтів.

source: The **GOP (Group of Pictures) size** (``-g:v``) is the max interval between keyframes. Increasing this value can improve compression with almost no impact on quality. The default size (``12``) is too low for most types of content, it's therefore recommended using higher GOP values before reducing video quality. Compression benefits will fade away as the GOP size increases though. Values between ``64`` and ``512`` usually give the best compression.
ru: **Размер GOP (группы изображений)** (``-g:v``) — это максимальный интервал между ключевыми кадрами. Увеличение этого значения может улучшить сжатие практически без ущерба для качества. Размер по умолчанию (``12``) слишком мал для большинства типов контента, поэтому рекомендуется использовать более высокие значения GOP, прежде чем снижать качество видео. Однако преимущества сжатия будут исчезать по мере увеличения размера GOP. Значения между ``64`` и ``512`` обычно обеспечивают наилучшее сжатие.
uk: Розмір **GOP (групи зображень)** (``-g:v``) – це максимальний інтервал між ключовими кадрами. Збільшення цього значення може покращити стиснення майже без впливу на якість. Розмір за замовчуванням (``12``) є занадто малим для більшості типів контенту, тому рекомендується використовувати вищі значення GOP перед зниженням якості відео. Однак переваги стиснення зникатимуть зі збільшенням розміру GOP. Значення від ``64`` до ``512`` зазвичай забезпечують найкраще стиснення.

source: Higher GOP sizes will increase max seek times with a sudden increase when going beyond powers of two starting at ``64``. Max seek times with GOP size ``65`` can be almost twice as long as with GOP size ``64``, depending on decoding speed.
ru: Больший размер GOP увеличит максимальное время поиска, причем оно резко возрастет при выходе за пределы степеней двойки, начиная с ``64``. Максимальное время поиска при размере GOP ``65`` может быть почти в два раза больше, чем при размере GOP ``64``, в зависимости от скорости декодирования.
uk: Більші розміри GOP призведуть до збільшення максимального часу пошуку, що різко зросте при перевищенні степенів двійки, починаючи з ``64``. Максимальний час пошуку з розміром GOP ``65`` може бути майже вдвічі довшим, ніж з розміром GOP ``64``, залежно від швидкості декодування.

source: FFmpeg: Convert while preserving original video resolution
ga: FFmpeg: Tiontaigh agus taifeach físe bunaidh á chaomhnú
ru: FFmpeg: Конвертирование с сохранением исходного разрешения видео
ta: FFMPEG: அசல் வீடியோ தீர்மானத்தை பாதுகாக்கும் போது மாற்றவும்
uk: FFmpeg: Конвертуйте, зберігаючи оригінальну роздільну здатність відео

source: The following command converts the video while keeping its original resolution. The video and audio's bitrate will be variable to maximize quality while saving space in parts of the video/audio that don't require a high bitrate (such as static scenes).
ga: Athraíonn an t-ordú seo a leanas an físeán agus a réiteach bunaidh á choinneáil Beidh giotán an fhíseáin agus fuaime athraitheach chun cáilíocht a uasmhéadú agus spás a shábháil i gcodanna den fhíseán/fuaim nach dteastaíonn giotán ard uathu (mar shampla radhairc statacha).
ru: Следующая команда преобразует видео с сохранением его исходного разрешения. Битрейт видео и аудио будет изменяться, чтобы обеспечить максимальное качество и одновременно сэкономить место в тех частях видео/аудио, которые не требуют высокого битрейта (например, в статичных сценах).
ta: பின்வரும் கட்டளை அதன் அசல் தீர்மானத்தை வைத்திருக்கும் போது வீடியோவை மாற்றுகிறது. வீடியோ மற்றும் ஆடியோவின் பிட்ரேட் தரத்தை அதிகரிக்க மாறுபடும், அதிக பிட்ரேட் (நிலையான காட்சிகள் போன்றவை) தேவையில்லை.
uk: Наступна команда конвертує відео зі збереженням початкової роздільної здатності. Бітрейт відео та аудіо буде змінюватися, щоб максимізувати якість і заощадити місце в тих частинах відео/аудіо, які не потребують високого бітрейту (наприклад, статичні сцени).

source: FFmpeg: Resize the video then convert it
ga: FFmpeg: Athraigh méid an fhíseáin ansin é a thiontú
ru: FFmpeg: Изменить размер видео, затем конвертировать
ta: FFMPEG: வீடியோவை மறுஅளவிடுங்கள் பின்னர் அதை மாற்றவும்
uk: FFmpeg: Змініть розмір відео, а потім конвертуйте його

source: The following command resizes a video to be 720 pixels tall (720p), while preserving its existing aspect ratio. This helps decrease the file size significantly if the source is recorded at a higher resolution than 720p:
ga: Athraíonn an t-ordú seo a leanas méid físeáin go mbeidh 720 picteilín ar airde (720p), agus an cóimheas gné atá ann cheana a chaomhnú. Cuidíonn sé seo le méid an chomhaid a laghdú go suntasach má thaifeadtar an fhoinse ag taifeadadh níos airde ná 720p:
ru: Следующая команда изменяет разрешение видео до 720 пикселей в высоту(720p), при сохранении существующего соотношения сторон. Это поможет значительно снизить размер файла, если он записан с разрешением выше чем 720p:
ta: பின்வரும் கட்டளை ஒரு வீடியோவை 720 படப்புள்ளிகள் உயரம் (720p) ஆக மாற்றுகிறது, அதே நேரத்தில் அதன் தற்போதைய விகித விகிதத்தை பாதுகாக்கிறது. 720p ஐ விட அதிக தெளிவுத்திறனில் மூலத்தை பதிவுசெய்தால் இது கோப்பு அளவைக் கணிசமாகக் குறைக்க உதவுகிறது:
uk: Наступна команда змінює розмір відео до 720 пікселів (720p) зі збереженням існуючого співвідношення сторін. Це допомагає значно зменшити розмір файлу, якщо джерело записано з вищою роздільною здатністю, ніж 720p:

source: Chroma Key Videos
ga: Físeáin Eochair Chroma
ru: Видео с хромакеем
ta: குரோமா முக்கிய வீடியோக்கள்
uk: Відео Chroma Key

source: Chroma key, commonly known as the "green screen" or "blue screen" effect, allows you to remove a specific color from an image or video and replace it with another background. This effect is widely used in video production to composite different elements together seamlessly.
ga: Ligeann eochair Chroma, ar a dtugtar an éifeacht "scáileán glas" nó "scáileán gorm" duit dath ar leith a bhaint as íomhá nó físeán agus cúlra eile a chur ina ionad. Úsáidtear an éifeacht seo go forleathan i dtáirgeadh físeáin chun eilimintí éagsúla a chomhdhéanamh le chéile gan uaim.
ru: Хромакей(chroma key), широко известный как эффект "зеленого экрана" или "синего экрана", позволяет удалить определенный цвет из изображения или видео и заменить его другим фоном. Этот эффект широко используется в видеопроизводстве для плавного объединения различных элементов.
ta: பொதுவாக "பச்சை திரை" அல்லது "நீலத் திரை" விளைவு என அழைக்கப்படும் குரோமா கீ, ஒரு படம் அல்லது வீடியோவிலிருந்து ஒரு குறிப்பிட்ட நிறத்தை அகற்றி அதை மற்றொரு பின்னணியுடன் மாற்ற அனுமதிக்கிறது. இந்த விளைவு வீடியோ தயாரிப்பில் வெவ்வேறு கூறுகளை தடையின்றி ஒன்றிணைக்க பரவலாகப் பயன்படுத்தப்படுகிறது.
uk: Хроматичний ключ, широко відомий як ефект «зеленого екрану» або «синього екрану», дозволяє видалити певний колір із зображення чи відео та замінити його іншим фоном. Цей ефект широко використовується у відеовиробництві для бездоганного поєднання різних елементів.

source: We will achieve the chroma key effect by writing a custom shader in GDScript and using a `VideoStreamPlayer` node to display the video content.
ga: Bainfimid amach an phríomhéifeacht chroma trí scáthóir saincheaptha a scríobh i GDScript agus nód `VideoStreamPlayer` a úsáid chun an t-ábhar físe a thaispeáint.
ru: Мы добьемся эффекта хромакея, написав пользовательский шейдер на GDScript и используя узел `VideoStreamPlayer` для отображения видеоконтента.
ta: சி.டி.எச்ச்கிரிப்டில் தனிப்பயன் சேடரை எழுதுவதன் மூலமும், வீடியோ உள்ளடக்கத்தைக் காண்பிக்க `வீடியோச்ட்ராம்ப்ளேயர்` முனையைப் பயன்படுத்துவதன் மூலமும் குரோமா விசை விளைவை அடைவோம்.
uk: Ми досягнемо ефекту кольоровості, написавши спеціальний шейдер у GDScript і використовуючи вузол VideoStreamPlayer для відображення відеовмісту.

source: Scene Setup
ga: Socrú Radhairc
it: Configurazione della scena
ru: Настройка сцены
ta: காட்சி அமைப்பு
uk: Налаштування сцени

source: Ensure that the scene contains a `VideoStreamPlayer` node to play the video and a `Control` node to hold the UI elements for controlling the chroma key effect.
ga: Déan cinnte go bhfuil nód `VideoStreamPlayer` sa radharc chun an físeán a sheinm agus nód `Rialaithe' chun na heilimintí Chomhéadain a choinneáil chun an príomhéifeacht chroma a rialú.
ru: Убедитесь, что сцена содержит узел `VideoStreamPlayer` для воспроизведения видео и узел `Control` для размещения элементов пользовательского интерфейса для управления эффектом хромакея.
ta: குரோமா விசை விளைவைக் கட்டுப்படுத்துவதற்கான இடைமுகம் கூறுகளை வைத்திருப்பதற்கான வீடியோவை இயக்க `வீடியோச்ட்ரீஆம்ப்ளேயர்` முனை மற்றும்` கட்டுப்பாடு` முனை ஆகியவை காட்சியில் இருப்பதை உறுதிசெய்க.
uk: Переконайтеся, що сцена містить вузол «VideoStreamPlayer» для відтворення відео та вузол «Control» для зберігання елементів інтерфейсу користувача для керування ефектом кольоровості.

source: Writing the Custom Shader
ga: An Shader Saincheaptha a scríobh
it: Scrivere lo shader personalizzato
ru: Написание пользовательского шейдера
ta: தனிப்பயன் சேடரை எழுதுதல்
uk: Написання спеціального шейдера

source: To implement the chroma key effect, follow these steps:
ga: Chun príomhéifeacht chroma a chur i bhfeidhm, lean na céimeanna seo:
ru: Чтобы реализовать эффект хромакея, выполните следующие действия:
ta: குரோமா விசை விளைவை செயல்படுத்த, இந்த படிகளைப் பின்பற்றவும்:
uk: Щоб реалізувати ефект кольоровості, виконайте такі дії:

source: Select the `VideoStreamPlayer` node in the scene and go to its properties. Under `CanvasItem > Material`, create a new shader named "ChromaKeyShader.gdshader."
ga: Roghnaigh an nód `VideoStreamPlayer` sa radharc agus téigh go dtí a chuid airíonna. Faoi `CanvasItem > Material`, cruthaigh scáthlán nua darb ainm "ChromaKeyShader.gdshader."
ru: Выберите узел `VideoStreamPlayer` в сцене и перейдите к его свойствам. В разделе `CanvasItem > Material` создайте новый шейдер с именем "ChromaKeyShader.gdshader."
ta: காட்சியில் உள்ள `வீடியோச்ட்ராம்ப்ளேயர்` முனையைத் தேர்ந்தெடுத்து அதன் பண்புகளுக்குச் செல்லவும். `Canvasitem> பொருள்` இன் கீழ்," ChromakeyShader.gdshader "என்ற புதிய சேடரை உருவாக்கவும்.
uk: Виберіть у сцені вузол VideoStreamPlayer і перейдіть до його властивостей. У розділі «CanvasItem > Material» створіть новий шейдер під назвою «ChromaKeyShader.gdshader»

source: In the "ChromaKeyShader.gdshader" file, write the custom shader code as shown below:
ga: Sa chomhad “ChromakeyShader.gdShader”, scríobh an cód shader saincheaptha mar a thaispeántar thíos:
ru: В файле "ChromaKeyShader.gdshader" напишите пользовательский код шейдера, как показано ниже:
ta: "ChromakeyShader.gdshader" கோப்பில், கீழே காட்டப்பட்டுள்ளபடி தனிப்பயன் சேடர் குறியீட்டை எழுதுங்கள்:
uk: У файлі "ChromaKeyShader.gdshader" напишіть спеціальний код шейдера, як показано нижче:

source: The shader uses the distance calculation to identify pixels close to the chroma key color and discards them, effectively removing the selected color. Pixels that are slightly further away from the chroma key color are faded based on the fade_factor, blending them smoothly with the surrounding colors. This process creates the desired chroma key effect, making it appear as if the background has been replaced with another image or video.
ga: Úsáideann an scáthóir an ríomh achair chun picteilíní gar don eochrdath chroma a aithint agus iad a dhiúscairt, ag baint an dath roghnaithe go héifeachtach. Déantar picteilíní atá beagán níos faide ar shiúl ón eochrdath chroma a dhíothú bunaithe ar an fade_factor, ag cumascadh iad go réidh leis na dathanna máguaird. Cruthaíonn an próiseas seo an príomhéifeacht chroma atá ag teastáil, rud a fhágann go bhfuil sé cosúil gur cuireadh íomhá nó físeán eile in ionad an chúlra.
ru: Шейдер использует вычисление расстояния для определения пикселей, близких к цвету хромакея, и отбрасывает их, эффективно удаляя выбранный цвет. Пиксели, которые находятся немного дальше от цвета цветовой гаммы, затемняются в соответствии с параметром fade_factor, что позволяет плавно смешивать их с окружающими цветами. Этот процесс создает желаемый эффект цветности, создавая впечатление, что фон был заменен другим изображением или видео.
ta: குரோமா விசை நிறத்திற்கு நெருக்கமான பிக்சல்களை அடையாளம் காண சேடர் தூரக் கணக்கீட்டைப் பயன்படுத்துகிறது மற்றும் அவற்றை நிராகரிக்கிறது, தேர்ந்தெடுக்கப்பட்ட வண்ணத்தை திறம்பட நீக்குகிறது. குரோமா விசை நிறத்திலிருந்து சற்று தொலைவில் இருக்கும் படப்புள்ளிகள் ஃபேட்_பாக்டரை அடிப்படையாகக் கொண்டு மங்கிவிடும், அவற்றை சுற்றியுள்ள வண்ணங்களுடன் சீராக கலக்கின்றன. இந்த செயல்முறை விரும்பிய குரோமா விசை விளைவை உருவாக்குகிறது, இது பின்னணி மற்றொரு படம் அல்லது வீடியோவுடன் மாற்றப்பட்டதைப் போல தோன்றும்.
uk: Шейдер використовує обчислення відстані, щоб ідентифікувати пікселі, близькі до кольору кольорового ключа, і відкидає їх, фактично видаляючи вибраний колір. Пікселі, які знаходяться трохи далі від кольору ключа кольоровості, зникають на основі fade_factor, плавно змішуючи їх із навколишніми кольорами. Цей процес створює бажаний ефект кольоровості, створюючи враження, ніби фон було замінено іншим зображенням або відео.

source: The code above represents a simple demonstration of the Chroma Key shader, and users can customize it according to their specific requirements.
ga: Léiríonn an cód thuas léiriú simplí den scáthóir Chroma Key, agus is féidir le húsáideoirí é a shaincheapadh de réir a gcuid riachtanais shonracha.
ru: Приведенный выше код представляет собой простую демонстрацию шейдера хромакея, и пользователи могут настроить его в соответствии со своими конкретными требованиями.
ta: மேலே உள்ள குறியீடு குரோமா கீ சேடரின் எளிய ஆர்ப்பாட்டத்தைக் குறிக்கிறது, மேலும் பயனர்கள் தங்கள் குறிப்பிட்ட தேவைகளுக்கு ஏற்ப அதைத் தனிப்பயனாக்கலாம்.
uk: Наведений вище код представляє просту демонстрацію шейдера Chroma Key, і користувачі можуть налаштувати його відповідно до своїх конкретних вимог.

source: UI Controls
ga: Rialuithe UI
it: Control dell'UI
ru: Элементы управления пользовательским интерфейсом
ta: இடைமுகம் கட்டுப்பாடுகள்
uk: Елементи керування інтерфейсу користувача
