Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/playing_videos.po
Languages: ga, it, ru, ta, uk

source: Playing videos
ga: Físeáin a sheinm
it: Riproduzione di video
ru: Воспроизведение видео
ta: வீடியோக்களை இயக்குதல்
uk: Відтворення відео

source: Godot supports video playback with the :ref:`class_VideoStreamPlayer` node.
ga: Tacaíonn Godot le athsheinm físe leis an nód: ref: `Class_VideoStreamPlayer`.
it: Godot supporta la riproduzione di video con il nodo :ref:`class_VideoStreamPlayer`.
ru: Godot поддерживает воспроизведение видео с помощью узла :ref:`class_VideoStreamPlayer`.
ta: கோடோட் வீடியோ பிளேபேக்கை ஆதரிக்கிறது: குறிப்பு: `class_videostearamplayer` முனை.
uk: Godot підтримує відтворення відео за допомогою вузла :ref:`class_VideoStreamPlayer`.

source: Supported playback formats
ga: Formáidí athsheinm tacaithe
it: Formati di riproduzione supportati
ru: Поддерживаемые форматы воспроизведения
ta: ஆதரிக்கப்பட்ட பின்னணி வடிவங்கள்
uk: Підтримувані формати відтворення

source: The only supported format in core is **Ogg Theora** (not to be confused with Ogg Vorbis audio) with optional Ogg Vorbis audio tracks. It's possible for extensions to bring support for additional formats.
it: L'unico formato supportato nel core è **Ogg Theora** (da non confondere con l'audio Ogg Vorbis), con tracce audio Ogg Vorbis facoltative. Le estensioni sono in grado di implementare supporto di formati aggiuntivi.
ru: Единственный поддерживаемый формат в ядре — **Ogg Theora** (не путать с аудио Ogg Vorbis) с опциональными аудиодорожками Ogg Vorbis. Расширения могут обеспечить поддержку дополнительных форматов.
uk: Єдиний підтримуваний формат в ядрі — це **Ogg Theora** (не плутати з аудіо Ogg Vorbis) з додатковими аудіодоріжками Ogg Vorbis. Розширення можуть додавати підтримку додаткових форматів.

source: H.264 and H.265 cannot be supported in core Godot, as they are both encumbered by software patents. AV1 is royalty-free, but it remains slow to decode on the CPU and hardware decoding support isn't readily available on all GPUs in use yet.
ga: Ní féidir tacú le H.264 agus H.265 i gcroílár Godot, mar tá paitinní bogearraí faoi ualach iad araon. Tá AV1 saor ó ríchíosa, ach tá sé fós mall díchódú ar an LAP agus níl tacaíocht díchódú crua-earraí ar fáil go héasca ar gach GPU atá in úsáid fós.
it: H.264 e H.265 non sono supportati nel core di Godot, poiché sono entrambi protetti da brevetti software. AV1 è esente da royalty, ma la sua decodifica è lenta sulla CPU e il supporto per la decodifica su hardware non è ancora disponibile su tutte le GPU in uso.
ru: H.264 и H.265 не могут поддерживаться в ядре Godot, поскольку оба они обременены патентами на программное обеспечение. AV1 не требует авторских отчислений, но он по-прежнему медленно декодируется на CPU, а аппаратная поддержка декодирования пока доступна не на всех используемых GPU.
ta: H.264 மற்றும் H.265 ஐ முக்கிய கோடோட்டில் ஆதரிக்க முடியாது, ஏனெனில் அவை இரண்டும் மென்பொருள் காப்புரிமைகளால் சூழப்பட்டுள்ளன. ஏ.வி 1 ராயல்டி இல்லாதது, ஆனால் இது சிபியு இல் டிகோட் செய்வது மெதுவாக உள்ளது மற்றும் வன்பொருள் டிகோடிங் உதவி இன்னும் பயன்பாட்டில் உள்ள அனைத்து சி.பீ.யுகளிலும் உடனடியாக கிடைக்கவில்லை.
uk: H.264 і H.265 не підтримуються в ядрі Godot, оскільки обидва вони обтяжені патентами на програмне забезпечення. AV1 не потребує ліцензійних відрахувань, але він повільно декодується на CPU, а апаратна підтримка декодування поки що доступна не на всіх графічних процесорах, що використовуються.

source: WebM was supported in core in Godot 3.x, but support for it was removed in 4.0 as it was too buggy and difficult to maintain.
ga: Tacaíodh le WebM go croílár i Godot 3.x, ach baineadh tacaíocht dó i 4.0 toisc go raibh sé ró-chabhálach agus deacair a chothabháil.
it: WebM era supportato nel core di Godot 3.x, ma il supporto è stato rimosso nella versione 4.0 perché era troppo pieno di bug e difficile da mantenere.
ru: WebM поддерживался в ядре Godot 3.x, но в версии 4.0 его поддержка была удалена, так как он был слишком глючным и сложным в обслуживании.
ta: கோடோட் 3.x இல் வெப்எம் ஆதரிக்கப்பட்டது, ஆனால் அதற்கான உதவி 4.0 இல் அகற்றப்பட்டது, ஏனெனில் இது மிகவும் தரமற்றது மற்றும் பராமரிப்பது கடினம்.
uk: WebM підтримувався в основному в Godot 3.x, але його підтримку було вилучено в 4.0, оскільки він був надто глюковим і важким у підтримці.

source: You may find videos with a ``.ogg`` or ``.ogx`` extensions, which are generic extensions for data within an Ogg container.
it: Potresti trovare video con estensione ``.ogg`` o ``.ogx``, che sono estensioni generiche per i dati dentro un contenitore Ogg.
ru: Вы можете найти видео с расширениями ``.ogg`` или ``.ogx``, которые являются общими расширениями для данных внутри контейнера Ogg.
uk: Ви можете знайти відео з розширеннями ``.ogg`` або ``.ogx``, які є загальними розширеннями для даних у контейнері Ogg.

source: Renaming these file extensions to ``.ogv`` *may* allow the videos to be imported in Godot. However, not all files with ``.ogg`` or ``.ogx`` extensions are videos - some of them may only contain audio.
ga: Is féidir leis na síntí comhaid seo a athainmniú go `.ogv`` *d'fhéad* ligean na físeáin a allmhairiú i Godot. Mar sin féin, ní físeáin iad gach comhad le síntí `.ogg`` nó ``.ogx`` - ní fhéadfadh go mbeadh ach fuaim i gcuid acu.
it: Rinominare queste estensioni di file in ``.ogv`` *potrebbe* permettere ai video di essere importati in Godot. Tuttavia, non tutti i file con estensione ``.ogg`` o ``.ogx`` sono video: alcuni di essi potrebbero contenere solo audio.
ru: Переименование расширений этих файлов в ``.ogv`` *может* позволить импортировать видео в Godot. Однако не все файлы с расширениями ``.ogg`` или ``.ogx`` являются видео - некоторые из них могут содержать только аудио.
ta: இந்த கோப்பு நீட்டிப்புகளை `` .ogv`` * க்கு மறுபெயரிடுவது வீடியோக்களை கோடோட்டில் இறக்குமதி செய்ய அனுமதிக்கலாம். இருப்பினும், `` .ogg`` அல்லது `` .ogx`` நீட்டிப்புகள் கொண்ட எல்லா கோப்புகளும் வீடியோக்கள் அல்ல - அவற்றில் சில ஆடியோவை மட்டுமே கொண்டிருக்கலாம்.
uk: Перейменування цих розширень на ``.ogv`` *може* дозволити імпортувати відео до Godot. Однак не всі файли з розширеннями ``.ogg`` або ``.ogx`` є відео - деякі з них можуть містити лише аудіо.

source: Setting up VideoStreamPlayer
ga: VideoStreamPlayer a bhunú
it: Configurazione di VideoStreamPlayer
ru: Настройка VideoStreamPlayer
ta: வீடியோச்ட்ராம்ப்ளேயரை அமைத்தல்
uk: Налаштування VideoStreamPlayer

source: Create a VideoStreamPlayer node using the Create New Node dialog.
ga: Cruthaigh nód VideoStreamPlayer ag baint úsáide as an dialóg Cruthaigh Nód Nua.
it: Creare un nodo VideoStreamPlayer attraverso la finestra di dialogo Crea un nuovo nodo.
ru: Создайте узел VideoStreamPlayer, используя диалоговое окно "Создать новый узел".
ta: புதிய முனை உரையாடலைப் பயன்படுத்தி வீடியோச்ட்ரீஆம்ப்ளேயர் முனையை உருவாக்கவும்.
uk: Створіть вузол VideoStreamPlayer за допомогою діалогового вікна «Створити новий вузол».

source: Select the VideoStreamPlayer node in the scene tree dock, go to the inspector and load a ``.ogv`` file in the Stream property.
it: Selezionare il nodo VideoStreamPlayer nel pannello dell'albero di scene, andare nell'Ispettore e caricare un file ``.ogv`` nella proprietà Stream.
ru: Выберите узел VideoStreamPlayer в дереве сцены, перейдите в инспектор и загрузите файл ``.ogv`` в свойстве Stream.
uk: Виберіть вузол VideoStreamPlayer у доці дерева сцен, перейдіть до інспектора та завантажте файл ``.ogv`` у властивість Stream.

source: If you don't have your video in Ogg Theora format yet, jump to :ref:`doc_playing_videos_recommended_theora_encoding_settings`.
ga: Mura bhfuil do fhíseán agat i bhformáid Ogg Theora fós, léim chuig:ref: `doc_playing_videos_recommended_theora_encoding_settings`.
it: Se non si dispone ancora di un video in formato Ogg Theora, andare a :ref:`doc_playing_videos_recommended_theora_encoding_settings`.
ru: Если у вас еще нет видео в формате Ogg Theora, перейдите к :ref:`doc_playing_videos_recommended_theora_encoding_settings`.
ta: உங்கள் வீடியோவை இன்னும் OGG தத்துவார்த்த வடிவத்தில் இல்லையென்றால், அதற்குச் செல்லவும்: குறிப்பு: `doc_playing_videos_recommended_theora_encoding_settings`.
uk: Якщо у вас ще немає відео у форматі Ogg Theora, перейдіть за посиланням :ref:`doc_playing_videos_recommended_theora_encoding_settings`.

source: If you want the video to play as soon as the scene is loaded, check **Autoplay** in the inspector. If not, leave **Autoplay** disabled and call ``play()`` on the VideoStreamPlayer node in a script to start playback when desired.
ga: Más mian leat go n-imríonn an físeán chomh luath agus a luchtaítear an radharc, seiceál**Autoplay** sa chigire. Mura bhfuil, fág **Autoplay** míchumasaithe agus glaoigh ar `play () `ar an nód VideoStreamPlayer i script chun athsheinm a thosú nuair is mian leat.
it: Se si desidera che il video venga riprodotto non appena la scena viene caricata, selezionare **Riproduzione automatica** nell'ispettore. Altrimenti, lascia **Riproduzione automatica** disabilitata e chiama ``play()`` sul nodo VideoStreamPlayer in uno script per avviare la riproduzione quando desiderato.
ru: Если вы хотите, чтобы видео воспроизводилось сразу после загрузки сцены, установите флажок **Автозапуск** в инспекторе. Если нет, оставьте **Автозапуск** отключенным и вызовите ``play()`` на узле VideoStreamPlayer в скрипте, чтобы начать воспроизведение по желанию.
ta: காட்சி ஏற்றப்பட்டவுடன் வீடியோ இயக்க விரும்பினால், இன்ச்பெக்டரில் ** ஆட்டோபிளே ** ஐ சரிபார்க்கவும். இல்லையென்றால், ** ஆட்டோபிளே ** முடக்கப்பட்டு, `` ப்ளே () `` ஐ ஒரு ச்கிரிப்டில் வீடியோச்ட்ரீஆம்ப்ளேயர் முனையில் அழைக்கவும்.
uk: “ ви хочете, щоб відео почало відтворюватися відразу після завантаження сцени, встановіть галочку **Autoplay** в інспекторі. Якщо ні, залиште **Autoplay** вимкненим і викличте ``play()`` на вузлі VideoPlayer у скрипті, щоб почати відтворення по необхідності.

source: Handling resizing and different aspect ratios
ga: Athrú méid láimhseála agus cóimheasa gné
it: Gestire il ridimensionamento e i diverse rapporti di aspetto
ru: Управление изменением размера и различных соотношений сторон
ta: மறுஅளவிடுதல் மற்றும் வெவ்வேறு அம்ச விகிதங்களைக் கையாளுதல்
uk: Робота зі зміною розміру та різними співвідношеннями сторін

source: By default in Godot 4.0, the VideoStreamPlayer will automatically be resized to match the video's resolution. You can make it follow usual :ref:`class_Control` sizing by enabling **Expand** on the VideoStreamPlayer node.
ga: De réir réamhshocraithe i Godot 4.0, athrófar an VideoStreamPlayer go huathoibríoch chun réiteach an fhíseáin a mheaitseáil. Is féidir leat é a leanúint de ghnáth: ref: `Class_Control` méid trí**Expand** a chumasú ar an nód VideoStreamPlayer.
ta: கோடோட் 4.0 இல் இயல்பாக, வீடியோவின் தெளிவுத்திறனுடன் பொருந்துமாறு வீடியோச்ட்ரீஆம்ப்ளேயர் தானாகவே மறுஅளவிடப்படும். நீங்கள் அதை வழக்கமாக பின்பற்றலாம்: ref: `class_control` அளவிடுதல் ** VideoStreamPlayer முனையில் ** ஐ விரிவாக்குவதன் மூலம்.
uk: За замовчуванням у Godot 4.0 розмір VideoStreamPlayer буде автоматично змінено відповідно до роздільної здатності відео. Ви можете зробити так, щоб він відповідав звичайному розміру :ref:`class_Control`, увімкнувши **Expand** у вузлі VideoStreamPlayer.

source: To adjust how the VideoStreamPlayer node resizes depending on window size, adjust the anchors using the **Layout** menu at the top of the 2D editor viewport. However, this setup may not be powerful enough to handle all use cases, such as playing fullscreen videos without distorting the video (but with empty space on the edges instead). For more control, you can use an :ref:`class_AspectRatioContainer` node, which is designed to handle this kind of use case:
ga: Chun an chaoi a n-athraíonn méid an nód VideoStreamPlayer a choigeartú ag brath ar mhéid na fuinneoige, déan na ancairí a choigeartú ag baint úsáide as an roghchlár **Leagth** ag barr an amharc eagarthóra 2D. Mar sin féin, b'fhéidir nach mbeidh an socrú seo cumhachtach go leor chun gach cás úsáide a láimhseáil, mar shampla físeáin lánscáileáin a sheinm gan an físeán a shaobhadh (ach le spás folamh ar na himill ina ionad sin). Le haghaidh tuilleadh rialaithe, is féidir leat nód: ref: `Class_AspectratioContainer` a úsáid, atá deartha chun cás úsáide den chineál seo a láimhseáil:
ru: Чтобы настроить изменение размера узла VideoStreamPlayer в зависимости от размера окна, отрегулируйте привязки с помощью меню **Layout** в верхней части окна просмотра 2D-редактора. Однако эта настройка может оказаться недостаточно мощной для обработки всех вариантов использования, таких как воспроизведение полноэкранных видеороликов без искажения видео (но с пустым пространством по краям). Для большего контроля вы можете использовать узел :ref:`class_AspectRatioContainer`, который предназначен для обработки такого рода вариантов использования:
ta: சாளர அளவைப் பொறுத்து வீடியோச்ட்ரீஆம்ப்ளேயர் முனை எவ்வாறு அளவை மாற்றுகிறது என்பதை சரிசெய்ய, 2 டி எடிட்டர் வியூபோர்ட்டின் மேலே உள்ள ** தளவமைப்பு ** மெனுவைப் பயன்படுத்தி நங்கூரங்களை சரிசெய்யவும். இருப்பினும், இந்த அமைப்பு அனைத்து பயன்பாட்டு நிகழ்வுகளையும் கையாளும் அளவுக்கு சக்திவாய்ந்ததாக இருக்காது, அதாவது வீடியோவை சிதைக்காமல் முழுத்திரை வீடியோக்களை இயக்குவது (ஆனால் அதற்கு பதிலாக விளிம்புகளில் வெற்று இடத்துடன்). மேலும் கட்டுப்பாட்டுக்கு, நீங்கள் ஒரு: ref: `class_aspectratiocontainer` முனை பயன்படுத்தலாம், இது இந்த வகையான பயன்பாட்டு வழக்கைக் கையாள வடிவமைக்கப்பட்டுள்ளது:
uk: Щоб налаштувати спосіб зміни розміру вузла VideoStreamPlayer залежно від розміру вікна, налаштуйте прив’язки за допомогою меню **Макет** у верхній частині вікна перегляду 2D-редактора. Однак це налаштування може бути недостатньо потужним, щоб впоратися з усіма випадками використання, як-от відтворення повноекранного відео без спотворення відео (але замість цього з порожнім простором по краях). Для більшого контролю ви можете використовувати вузол :ref:`class_AspectRatioContainer`, який призначений для обробки таких варіантів використання:

source: Add an AspectRatioContainer node. Make sure it is not a child of any other container node. Select the AspectRatioContainer node, then set its **Layout** at the top of the 2D editor to **Full Rect**. Set **Ratio** in the AspectRatioContainer node to match your video's aspect ratio. You can use math formulas in the inspector to help yourself. Remember to make one of the operands a float. Otherwise, the division's result will always be an integer.
ga: Cuir nód AspectratioContainer leis. Déan cinnte nach leanbh d'aon nód coimeádán eile é. Roghnaigh an nód AspectratioContainer, ansin socraigh a **Leagth** ag barr an eagarthóra 2D chuig **Full Rect**. Socraithe** Réitio** sa nód AspectratioContainer chun cóimheas gné d'fhíseáin a mheaitseáil. Is féidir leat foirmlí matamaitice a úsáid sa chigire chun cabhrú leat féin. Cuimhnigh ceann de na hoibrithe a dhéanamh ina snámhphointe. Seachas sin, beidh toradh an rannán i gcónaí ina sláimhir.
ru: Добавьте узел AspectRatioContainer. Убедитесь, что он не является дочерним узлом какого-либо другого узла контейнера. Выберите узел AspectRatioContainer, затем установите для его **Layout** в верхней части 2D-редактора значение **Full Rect**. Установите **Ratio** в узле AspectRatioContainer в соответствии с соотношением сторон вашего видео. Вы можете использовать математические формулы в инспекторе, чтобы помочь себе. Не забудьте сделать один из операндов плавающей величиной. В противном случае результатом деления всегда будет целое число.
ta: ஒரு ஆச்பெக்ட்ராடியோகாண்டெய்னர் முனையைச் சேர்க்கவும். இது வேறு எந்த கொள்கலன் முனையின் குழந்தை அல்ல என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். ஆச்பெக்ட்ராடியோகாண்டெய்னர் முனையைத் தேர்ந்தெடுத்து, அதன் ** தளவமைப்பு ** ஐ 2 டி எடிட்டரின் மேற்புறத்தில் ** முழு ரெக்ட் ** என அமைக்கவும். உங்கள் வீடியோவின் விகித விகிதத்துடன் பொருந்த ஆச்பெக்ட்ராடியோகாண்டெய்னர் முனையில் ** விகிதம் ** அமைக்கவும். உங்களுக்கு உதவ இன்ச்பெக்டரில் கணித சூத்திரங்களைப் பயன்படுத்தலாம். ஓபராண்ட்களில் ஒன்றை மிதக்க வைக்க நினைவில் கொள்ளுங்கள். இல்லையெனில், பிரிவின் முடிவு எப்போதும் ஒரு முழு எண்ணாக இருக்கும்.
uk: Додайте вузол AspectRatioContainer. Переконайтеся, що він не є нащадком іншого вузла контейнера. Виділіть вузол AspectRatioContainer, а потім встановіть його **Макет** у верхній частині 2D-редактора на **Увесь прямокутник**. Встановіть **Ratio** у вузлі AspectRatioContainer відповідно до співвідношення сторін вашого відео. Ви можете використовувати математичні формули в інспекторі, щоб допомогти собі. Не забудьте зробити один з операндів десятковим. Інакше результат ділення завжди буде цілим числом.

source: AspectRatioContainer's Ratio property being modified in the editor inspector
ga: Maoin Cóimheas AspectratioContainer á mhodhnú sa chigire eagarthóra
ru: Изменение свойства Ratio контейнера AspectRatioContainer в инспекторе редактора
ta: Aspectratiocontainer இன் விகித சொத்து எடிட்டர் இன்ச்பெக்டரில் மாற்றியமைக்கப்படுகிறது
uk: Властивість Ratio вузла AspectRatioContainer змінюється в інспекторі редактора

source: This will evaluate to (approximately) 1.777778
ga: Déanfaidh sé seo meastóireacht go (thart ar) 1.777778
ru: Это составит (приблизительно) 1,777778
ta: இது (தோராயமாக) 1.777778 ஐ மதிப்பீடு செய்யும்
uk: Результат буде (приблизно) 1.777778

source: Once you've configured the AspectRatioContainer, reparent your VideoStreamPlayer node to be a child of the AspectRatioContainer node. Make sure **Expand** is enabled on the VideoStreamPlayer. Your video should now scale automatically to fit the whole screen while avoiding distortion.
ga: Nuair a bheidh an AspectRatioContainer cumraithe agat, tuismitheoir do nód VideoStreamPlayer arís le bheith i do leanbh leis an nód AspectRatioContainer. Cinntigh go bhfuil **Expand** cumasaithe ar an VideoStreamPlayer. Ba chóir go mbeadh d’fhíseán ag scála go huathoibríoch anois chun an scáileán iomlán a fheistiú agus saobhadh á sheachaint.
ru: После настройки AspectRatioContainer измените родительский статус узла VideoStreamPlayer на дочерний для узла AspectRatioContainer. Убедитесь, что **Expand** отключен в VideoStreamPlayer. Теперь ваше видео должно автоматически масштабироваться так, чтобы поместиться на весь экран, избегая при этом искажений.
ta: நீங்கள் ஆச்பெக்ட்ராடியோகாண்டெய்னரை உள்ளமைத்தவுடன், உங்கள் வீடியோச்ட்ரீஆம்ப்ளேயர் முனையை ஆச்பெக்ட்ராடியோகாண்டெய்னர் முனையின் குழந்தையாக இருக்கும்படி மறுபரிசீலனை செய்யுங்கள். வீடியோச்ட்ராம்ப்ளேயரில் ** விரிவாக்கம் ** இயக்கப்பட்டிருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். விலகலைத் தவிர்க்கும்போது முழு திரைக்கும் பொருந்தும் வகையில் உங்கள் வீடியோ இப்போது தானாக அளவிட வேண்டும்.
uk: Після того, як ви налаштували AspectRatioContainer, повторно створіть свій вузол VideoStreamPlayer, щоб він був дочірнім вузлом AspectRatioContainer. Переконайтеся, що **Розгорнути** увімкнено у VideoStreamPlayer. Тепер ваше відео має автоматично змінюватися на весь екран, уникаючи спотворень.

source: See :ref:`doc_multiple_resolutions` for more tips on supporting multiple aspect ratios in your project.
ga: Féach: ref: `doc_multiple_resolutions` le haghaidh tuilleadh leideanna maidir le tacú le cóimheasa ilghnéithe i do thionscadal.
ru: Смотрите :ref:`doc_multiple_resolutions` для получения дополнительных советов по поддержке нескольких соотношений сторон в вашем проекте.
ta: காண்க: குறிப்பு: உங்கள் திட்டத்தில் பல அம்ச விகிதங்களை ஆதரிப்பதற்கான கூடுதல் உதவிக்குறிப்புகளுக்கு `doc_multiple_resolutions`.
uk: Дивіться :ref:`doc_multiple_resolutions` для отримання додаткових порад щодо підтримки різних співвідношень сторін у вашому проекті.

source: Displaying a video on a 3D surface
ga: Físeán a thaispeáint ar dhromchla 3D
ru: Отображение видео на 3D-поверхности
ta: 3D மேற்பரப்பில் வீடியோவைக் காண்பிக்கும்
uk: Відображення відео на 3D-поверхні

source: Using a VideoStreamPlayer node as a child of a :ref:`class_SubViewport` node, it's possible to display any 2D node on a 3D surface. For example, this can be used to display animated billboards when frame-by-frame animation would require too much memory.
ga: Ag baint úsáide as nód VideoStreamPlayer mar leanbh de nód :ref:`class_SubViewport`, is féidir aon nód 2T a thaispeáint ar dhromchla 3D. Mar shampla, is féidir é seo a úsáid chun cláir fhógraí beoite a thaispeáint nuair a bheadh iomarca cuimhne ag teastáil ó bheochan fráma-ar-fhráma.
ru: Используя узел VideoStreamPlayer как дочерний по отношению к узлу :ref:`class_SubViewport`, можно отобразить любой 2D-узел на 3D-поверхности. Например, это может быть использовано для отображения анимированных рекламных щитов(animated billboard), когда покадровая анимация требует слишком много памяти.
ta: ஒரு குழந்தையாக வீடியோச்ட்ரீஆம்ப்ளேயர் முனையைப் பயன்படுத்துதல்: ref: `class_subviewport` முனை, எந்த 2 டி முனையையும் 3D மேற்பரப்பில் காண்பிக்க முடியும். எடுத்துக்காட்டாக, பிரேம்-பை-பிரேம் அனிமேசனுக்கு அதிக நினைவகம் தேவைப்படும்போது அனிமேசன் செய்யப்பட்ட விளம்பர பலகைகளைக் காண்பிக்க இதைப் பயன்படுத்தலாம்.
uk: Використовуючи вузол VideoStreamPlayer як дочірнього вузла :ref:`class_SubViewport`, можна відобразити будь-який 2D-вузол на 3D-поверхні. Наприклад, це можна використовувати для відображення анімованих рекламних щитів, коли покадрова анімація вимагає забагато пам’яті.

source: This can be done with the following steps:
ga: Is féidir é seo a dhéanamh leis na céimeanna seo a leanas:
it: Ciò si può fare seguendo i seguenti passaggi:
ru: Это можно сделать, выполнив следующие действия:
ta: பின்வரும் படிகளுடன் இதைச் செய்யலாம்:
uk: Це можна зробити за допомогою наступних кроків:

source: Create a :ref:`class_SubViewport` node. Set its size to match your video's size in pixels.
ga: Cruthaigh a:ref: `Class_subviewport` nód. Socraigh a mhéid chun méid d'fhíseáin a mheaitseáil i bpicteilíní.
ru: Создайте узел :ref:`class_SubViewport`. Установите его размер таким образом, чтобы он соответствовал размеру вашего видео в пикселях.
ta: ஒரு: ref: `class_subviewport` முனை உருவாக்கவும். உங்கள் வீடியோவின் அளவை பிக்சல்களில் பொருத்த அதன் அளவை அமைக்கவும்.
uk: Створіть вузол :ref:`class_SubViewport`. Установіть його розмір відповідно до розміру вашого відео в пікселях.

source: Create a VideoStreamPlayer node *as a child of the SubViewport node* and specify a video path in it. Make sure **Expand** is disabled, and enable **Autoplay** if needed.
ga: Cruthaigh nód VideoStreamPlayer*mar leanbh den nóid SubViewPort* agus sonraigh cosán físe ann. Déan cinnte go bhfuil **Expand** míchumasaithe, agus cumasaíon**Autoplay** más gá.
ru: Создайте узел VideoStreamPlayer *как дочерний по отношению к узлу SubViewport* и укажите в нем путь к видео. Убедитесь, что функция **Развернуть** отключена, и при необходимости включите функцию **Автозапуск**.
ta: சப் வியூ துறைமுகம் முனையின் குழந்தையாக * வீடியோச்ட்ரீஆம்ப்ளேயர் முனையை * உருவாக்கி அதில் ஒரு வீடியோ பாதையைக் குறிப்பிடவும். ** விரிவாக்க ** முடக்கப்பட்டுள்ளதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், தேவைப்பட்டால் ** ஆட்டோபிளே ** ஐ இயக்கவும்.
uk: Створіть вузол VideoStreamPlayer *як дочірній вузол SubViewport* і вкажіть у ньому відеошлях. Переконайтеся, що **Розгорнути** вимкнено, і за потреби увімкніть **Автовідтворення**.
