Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/playing_videos.po
Languages: ga, it, ru, ta, uk

source: Create a MeshInstance3D node with a PlaneMesh or QuadMesh resource in its Mesh property. Resize the mesh to match the video's aspect ratio (otherwise, it will appear distorted).
ga: Cruthaigh nód MeshInstance3D le hacmhainn PlaneMesh nó QuadMesh ina mhaoin Mesh. Athraigh méid na mogalra chun cóimheas gné an fhíseáin a mheaitseáil (ar shlí eile, beidh sé saobhadh).
ru: Создайте узел MeshInstance3D с ресурсом Plane Mesh или QuadMesh в свойстве Mesh. Измените размер сетки в соответствии с соотношением сторон видео (в противном случае оно будет выглядеть искаженным).
ta: அதன் கண்ணி சொத்தில் ஒரு பிளானேம்ச் அல்லது குவாட்மேச் வளத்துடன் ஒரு மெசின்ச்டன்ச் 3 டி முனையை உருவாக்கவும். வீடியோவின் விகித விகிதத்துடன் பொருந்துமாறு கண்ணி அளவை மாற்றவும் (இல்லையெனில், அது சிதைந்ததாகத் தோன்றும்).
uk: Створіть вузол MeshInstance3D із ресурсом PlaneMesh або QuadMesh у його властивості Mesh. Змініть розмір сітки відповідно до формату відео (інакше воно виглядатиме спотвореним).

source: Create a new StandardMaterial3D resource in the **Material Override** property in the GeometryInstance3D section.
ga: Cruthaigh acmhainn nua caighdeánMaterial3D sa mhaoin **Material Override** sa chuid GeometryInstance3D.
ru: Создайте новый стандартный ресурс Material 3D в свойстве **Material Override** в разделе GeometryInstance3D.
ta: ** பொருள் மேலெழுதும் ** சொத்தில் ஒரு புதிய ச்டாண்டர்ட் -மெட்டீரியல் 3 டி வளத்தை உருவாக்கவும்.
uk: Створіть новий ресурс StandardMaterial3D у властивості **Material Override** у розділі GeometryInstance3D.

source: Enable **Local To Scene** in the StandardMaterial3D's Resource section (at the bottom). This is *required* before you can use a ViewportTexture in its Albedo Texture property.
ga: Cumasaigh **Local To Scene** i rannán Acmhainní an StandardMaterial3D (ag an mbun). Tá seo* riachtanáil* sula bhféadfaidh tú ViewPortTexture a úsáid ina mhaoin Albedo Texture.
ru: Включите функцию **Локально для сцены** в разделе ресурсов StandardMaterial3D (внизу). Это необходимо для того, чтобы вы могли использовать ViewportTexture в свойстве текстуры альбедо.
ta: ச்டாண்டர்ட் மெட்டீரியல் 3D இன் வளப் பிரிவில் (கீழே) ** ** உள்ளக காட்சிக்கு ** இயக்கவும். அதன் ஆல்பிடோ அமைப்பு சொத்தில் ஒரு ViewPorttexture ஐப் பயன்படுத்துவதற்கு முன்பு இது * தேவை *.
uk: Увімкніть **Local To Scene** у розділі ресурсів StandardMaterial3D (внизу). Це *обов’язково* перед використанням ViewportTexture у властивості Albedo Texture.

source: In the StandardMaterial3D, set the **Albedo > Texture** property to **New ViewportTexture**. Edit the new resource by clicking it, then specify the path to the SubViewport node in the **Viewport Path** property.
ga: Sa StandardMaterial3D, socraigh an t-airí **Albedo> Texture** go **New ViewportTexture**. Cuir an acmhainn nua in eagar trí chliceáil uirthi, ansin sonraigh an cosán go dtí an nód FoViewport sa mhaoin **Viewport Path**.
ru: В StandardMaterial3D установите для свойства **Albedo > Texture** значение **New ViewportTexture**. Отредактируйте новый ресурс, щелкнув по нему, затем укажите путь к узлу SubViewport в свойстве **Viewport Path**.
ta: StandardMaterial3D இல், ** ஆல்பிடோ> அமைப்பு ** சொத்தை ** புதிய ViewPortTexture ** என அமைக்கவும். புதிய வளத்தை சொடுக்கு செய்வதன் மூலம் திருத்தவும், பின்னர் ** ViewPort பாதை ** சொத்தில் சப் வியூ துறைமுகம் முனைக்கான பாதையை குறிப்பிடவும்.
uk: У StandardMaterial3D встановіть для властивості **Albedo > Texture** значення **New ViewportTexture**. Відредагуйте новий ресурс, клацнувши його, а потім укажіть шлях до вузла SubViewport у властивості **Viewport Path**.

source: Enable **Albedo Texture Force sRGB** in the StandardMaterial3D to prevent colors from being washed out.
ga: Cumasaí** Fórsa Uigeachta Albedo sRGb** sa chaighdeánMaterial3D chun cosc a chur ar dathanna a ní amach.
ru: Включите **Albedo Texture Force sRGB** в StandardMaterial3D, чтобы предотвратить размывание цветов.
ta: நிறங்கள் கழுவப்படுவதைத் தடுக்க ச்டாண்டர்டிமேட்டரியல் 3 டி இல் ** ஆல்பிடோ அமைப்பு படை SRGB ** ஐ இயக்கவும்.
uk: Увімкніть **Albedo Texture Force sRGB** у StandardMaterial3D, щоб запобігти розмиванню кольорів.

source: If the billboard is supposed to emit its own light, set **Shading Mode** to **Unshaded** to improve rendering performance.
ga: Má cheaptar go n-astóidh an fógrair a solas féin, socraí**Mód Scátha** chuig **Gan scáth** chun feidhmíocht rindreála a fheabhsú.
ru: Если предполагается, что рекламный щит излучает свой собственный свет, установите **Режим затенения** на **режим без затенения**, чтобы повысить производительность рендеринга.
ta: விளம்பர பலகை அதன் சொந்த ஒளியை வெளியிட வேண்டுமானால், வழங்குதல் செயல்திறனை மேம்படுத்த ** நிழல் பயன்முறையை ** ** மாற்றப்படாத ** என அமைக்கவும்.
uk: Якщо рекламний щит має випромінювати власне світло, встановіть для **Shading Mode** значення **Unshaded**, щоб покращити продуктивність візуалізації.

source: See :ref:`doc_viewports` and the `GUI in 3D demo <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/gui_in_3d>`__ for more information on setting this up.
ga: Féach :ref:`doc_viewports` agus an `GUI i dtaispeántas 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/gui_in_3d>`__ chun tuilleadh eolais a fháil faoin socrú seo.
it: Consultare :ref:`doc_viewports` e la demo `GUI in 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/gui_in_3d>`__ per ulteriori informazioni sulla configurazione.
ru: Смотрите = :ref:`doc_viewports` и `Демо GUI в 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/gui_in_3d>`__ для получения дополнительной информации о настройке.
ta: காண்க: ref: `Doc_viewports` மற்றும்` GUI 3D டெமோவில் <https://github.com/godotengine/godotengine/godotengine-projects/tree/master/viewport/gui_in_3d> __ இதை அமைப்பது குறித்த கூடுதல் தகவலுக்கு.
uk: Дивіться :ref:`doc_viewports` та демонстрацію графічного інтерфейсу `у 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/gui_in_3d>`__ для отримання додаткової інформації про налаштування.

source: Looping a video
ga: Físeán a ghlacadh
it: Far ripetere un video
ru: Зацикливание видео
ta: வீடியோவை சுழற்றுதல்
uk: Зациклення відео

source: For looping a video, the **Loop** property can be enabled. This will seamlessly restart the video when it reaches its end.
ga: Chun físeán a lúpáil, is féidir an maoin **Loop** a chumasú. Athosóidh sé seo an físeán gan uaim nuair a shroicheann sé a dheireadh.
it: Per ripetere un video, è possibile abilitare la proprietà **Loop**. Questa proprietà riavvia il video senza interruzioni al termine della riproduzione.
ru: Для зацикливания видео можно включить свойство **Loop**. Это позволит плавно перезапустить видео, когда оно дойдет до конца.
ta: வீடியோவை வளையுவதற்கு, ** லூப் ** சொத்தை இயக்க முடியும். இது வீடியோவை அதன் முடிவை எட்டும் போது தடையின்றி மறுதொடக்கம் செய்யும்.
uk: Для циклічного відтворення відео можна ввімкнути властивість **Loop**. Це плавно перезапустить відео, коли воно досягне кінця.

source: Note that setting the project setting **Video Delay Compensation** to a non-zero value might cause your loop to not be seamless, because the synchronization of audio and video takes place at the start of each loop causing occasional missed frames. Set **Video Delay Compensation** in your project settings to **0** to avoid frame drop issues.
ga: Tabhair faoi deara go bhféadfadh socrú an tionscadail a shocrú **Cúiteamh Moill Físeán** go luach neamh-nialasach a bheith ina chúis nach mbeidh do lúb gan uaim, toisc go dtarlaíonn sioncrónú fuaime agus físe ag tús gach lúb a chruthaíonn frámaí caillte ó am go chéile Socraigh **Cúiteamh Moill Físeán** i socruithe do thionscadail go**0** chun saincheisteanna titim fráma a sheachaint.
ru: Обратите внимание, что установка ненулевого значения параметра проекта **Компенсация задержки видеосигнала** может привести к тому, что ваш цикл не будет непрерывным, поскольку синхронизация аудио и видео происходит в начале каждого цикла, что иногда приводит к пропущенным кадрам. Установите **Компенсацию задержки видео** в настройках вашего проекта на значение **0**, чтобы избежать проблем с выпадением кадров.
ta: திட்ட அமைப்பை அமைப்பது ** வீடியோ தாமத இழப்பீடு ** பூச்சியமற்ற மதிப்புக்கு உங்கள் லூப் தடையின்றி இருக்கக்கூடும் என்பதை நினைவில் கொள்க, ஏனென்றால் ஒவ்வொரு வளையத்தின் தொடக்கத்திலும் ஆடியோ மற்றும் வீடியோவின் ஒத்திசைவு அவ்வப்போது தவறவிட்ட பிரேம்களை ஏற்படுத்துகிறது. பிரேம் துளி சிக்கல்களைத் தவிர்க்க உங்கள் திட்ட அமைப்புகளில் ** வீடியோ தாமத இழப்பீடு ** ஐ ** 0 ** என அமைக்கவும்.
uk: Зауважте, що налаштування параметра проекту **Компенсація затримки відео** на відмінне від нуля значення може призвести до того, що ваш цикл не буде безперебійним, оскільки синхронізація аудіо та відео відбувається на початку кожного циклу, спричиняючи випадкові пропуски кадрів. Встановіть **Компенсацію затримки відео** в налаштуваннях проекту на **0**, щоб уникнути проблем із пропуском кадрів.

source: Video decoding conditions and recommended resolutions
ga: Coinníollacha díchódú físe agus rúin mholta
ru: Условия декодирования видео и рекомендуемые разрешения
ta: வீடியோ டிகோடிங் நிபந்தனைகள் மற்றும் பரிந்துரைக்கப்பட்ட தீர்மானங்கள்
uk: Умови декодування відео та рекомендована роздільна здатність

source: Video decoding is performed on the CPU, as GPUs don't have hardware acceleration for decoding Theora videos. Modern desktop CPUs can decode Ogg Theora videos at 1440p @ 60 FPS or more, but low-end mobile CPUs will likely struggle with high-resolution videos.
ga: Déantar díchódú físe ar an LAP, toisc nach bhfuil luasghéarú crua-earraí ag GPUanna chun físeáin Theora a dhíchódú. Is féidir le CPUanna deisce nua-aimseartha físeáin Ogg Theora a dhíchódú ag 1440p @ 60 FPS nó níos mó, ach is dócha go mbeidh CPUanna soghluaiste deireadh íseal ag streachailt le físeáin ardtaifigh.
ru: Декодирование видео выполняется на CPU, поскольку GPU не имеют аппаратного ускорения для декодирования видео Theora. Современные настольные процессоры могут декодировать видео Ogg Theora с разрешением 1440p @ 60 FPS или более, но мобильные процессоры низкого класса, скорее всего, не справятся с видео высокого разрешения.
ta: சி.பீ.யூவில் வீடியோ டிகோடிங் செய்யப்படுகிறது, ஏனெனில் சி.பீ.யுகளில் தத்துவார்த்த வீடியோக்களை டிகோடிங் செய்வதற்கான வன்பொருள் முடுக்கம் இல்லை. நவீன டெச்க்டாப் சிபியுக்கள் OGG தியோரா வீடியோக்களை 1440p@60 fps அல்லது அதற்கு மேற்பட்டவற்றில் டிகோட் செய்யலாம், ஆனால் குறைந்த விலை மொபைல் சிபியு கள் உயர் தெளிவுத்திறன் கொண்ட வீடியோக்களுடன் போராடும்.
uk: Декодування відео виконується на центральному процесорі, оскільки графічні процесори не мають апаратного прискорення для декодування відео Theora. Сучасні настільні центральні процесори можуть декодувати відео Ogg Theora з роздільною здатністю 1440p при 60 FPS або більше, але мобільні процесори низького класу, швидше за все, не зможуть впоратися з відео високої роздільної здатності.

source: To ensure your videos decode smoothly on varied hardware:
ga: Chun do fhíseáin a dhíchódú go réidh ar chrua-earraí éagsúla:
ru: Чтобы обеспечить плавное декодирование ваших видео на различном оборудовании:
ta: மாறுபட்ட வன்பொருளில் உங்கள் வீடியோக்கள் சீராக டிகோட் செய்ய:
uk: Щоб забезпечити плавне декодування ваших відео на різному обладнанні:

source: When developing games for desktop platforms, it's recommended to encode in 1080p at most (preferably at 30 FPS). Most people are still using 1080p or lower resolution displays, so encoding higher-resolution videos may not be worth the increased file size and CPU requirements.
ga: Agus cluichí á bhforbairt le haghaidh ardáin deisce, moltar ionchódú i 1080p ar a mhéad (b’fhearr ag 30 FPS). Tá an chuid is mó daoine fós ag baint úsáide as taispeántais 1080p nó réitigh níos ísle, mar sin b'fhéidir nach fiú an méid comhaid méadaithe agus riachtanais LAP a ionchódú físeáin ardtaifigh.
ru: При разработке игр для настольных платформ рекомендуется кодировать видео в формате 1080p (желательно с частотой 30 кадров в секунду). Большинство людей по-прежнему используют дисплеи с разрешением 1080p или ниже, поэтому кодирование видео с более высоким разрешением может не стоить увеличения размера файла и требований к процессору.
ta: டெச்க்டாப் இயங்குதளங்களுக்கான கேம்களை உருவாக்கும்போது, அதிகபட்சம் 1080p இல் குறியாக்கம் செய்ய பரிந்துரைக்கப்படுகிறது (முன்னுரிமை 30 FPS இல்). பெரும்பாலான மக்கள் இன்னும் 1080p அல்லது குறைந்த தெளிவுத்திறன் காட்சிகளைப் பயன்படுத்துகின்றனர், எனவே அதிக தெளிவுத்திறன் கொண்ட வீடியோக்களை குறியாக்கம் செய்வது கோப்பு அளவு மற்றும் சிபியு தேவைகளுக்கு மதிப்புக்குரியதாக இருக்காது.
uk: При розробці ігор для настільних платформ рекомендується кодувати відео з роздільною здатністю не вище 1080p (бажано з частотою 30 кадрів в секунду). Більшість людей все ще використовують дисплеї з роздільною здатністю 1080p або нижчою, тому кодування відео з вищою роздільною здатністю може бути не варте збільшення розміру файлу та вимог до процесора.

source: When developing games for mobile or web platforms, it's recommended to encode in 720p at most (preferably at 30 FPS or even lower). The visual difference between 720p and 1080p videos on a mobile device is usually not that noticeable.
ga: Agus cluichí á fhorbairt d'ardáin soghluaiste nó gréasáin, moltar ionchódú i 720p ar a mhéad (b'fhearr ag 30 FPS nó níos ísle fiú). De ghnáth ní bhíonn an difríocht amhairc idir físeáin 720p agus 1080p ar ghléas soghluaiste chomh suntasach sin.
ru: При разработке игр для мобильных или веб-платформ рекомендуется кодировать в формате 720p (предпочтительно с частотой 30 кадров в секунду или даже ниже). Визуальная разница между видео 720p и 1080p на мобильном устройстве обычно не так заметна.
ta: மொபைல் அல்லது வலை தளங்களுக்கான கேம்களை உருவாக்கும்போது, அதிகபட்சமாக 720p இல் குறியாக்கம் செய்ய பரிந்துரைக்கப்படுகிறது (முன்னுரிமை 30 FPS அல்லது அதற்கும் குறைவாக). மொபைல் சாதனத்தில் 720p மற்றும் 1080p வீடியோக்களுக்கு இடையிலான காட்சி வேறுபாடு பொதுவாக கவனிக்கத்தக்கதல்ல.
uk: При розробці ігор для мобільних або веб-платформ рекомендується кодувати в 720p максимум (бажано з частотою 30 кадрів в секунду або навіть нижче). Візуальна різниця між відео 720p і 1080p на мобільному пристрої зазвичай не дуже помітна.

source: Playback limitations
ga: Teorainneacha athshe
it: Limitazioni della riproduzione
ru: Ограничения воспроизведения
ta: பின்னணி வரம்புகள்
uk: Обмеження відтворення

source: There are some limitations with the current implementation of video playback in Godot:
ru: Текущая реализация воспроизведения видео в Godot имеет некоторые ограничения:
uk: Існують деякі обмеження щодо поточної реалізації відтворення відео в Godot:

source: Streaming a video from a URL is not supported.
ga: Ní thacaítear le sruthú físeán ó URL.
ru: Потоковая передача видео из URL-адреса не поддерживается.
ta: முகவரி இலிருந்து வீடியோவை ச்ட்ரீமிங் செய்வது ஆதரிக்கப்படவில்லை.
uk: Потокове відео з URL-адреси не підтримується.

source: Only mono and stereo audio output is supported. Videos with 4, 5.1 and 7.1 audio channels are supported but down-mixed to stereo.
ru: Поддерживается только моно- и стереовыход. Видео с 4, 5.1 и 7.1 аудиоканалами поддерживаются, но с понижением качества звука до стерео.
uk: Підтримується лише моно- та стереоаудіовихід. Відео з аудіоканалами 4, 5.1 та 7.1 підтримуються, але зведені до стерео.

source: Recommended Theora encoding settings
ga: Socruithe ionchódú Theora molta
ru: Рекомендуемые параметры кодировки Theora
ta: பரிந்துரைக்கப்பட்ட தியரா குறியாக்க அமைப்புகள்
uk: Рекомендовані параметри кодування Theora

source: A word of advice is to **avoid relying on built-in Ogg Theora exporters** (most of the time). There are 2 reasons you may want to favor using an external program to encode your video:
ga: Is é focal comhairle ná ** brath a bheith ag brath ar onnmhairitheoirí ionsuite Ogg Theora** (an chuid is mó den am). Tá 2 chúis ann b'fhéidir gur mhaith leat clár seachtrach a úsáid chun d'fhíseán a ionchódú:
ru: Небольшой совет: **Не полагайтесь на встроенные программы экспортирования Ogg Theora** (в большинстве случаев). Есть 2 причины, по которым вы, возможно, захотите использовать внешнюю программу для кодирования вашего видео:
ta: உள்ளமைக்கப்பட்ட OGG தியரா ஏற்றுமதியாளர்களை நம்புவதைத் தவிர்ப்பது ஒரு அறிவுரை சொல் ** (பெரும்பாலான நேரம்). உங்கள் வீடியோவை குறியாக்க வெளிப்புற நிரலைப் பயன்படுத்த நீங்கள் விரும்பிய 2 காரணங்கள் உள்ளன:
uk: Порада: **не покладайтеся на вбудовані експортери Ogg Theora** (здебільшого). Є 2 причини, чому вам краще віддати перевагу зовнішній програмі для кодування вашого відео:

source: Some programs such as Blender can render to Ogg Theora. However, the default quality presets are usually very low by today's standards. You may be able to increase the quality options in the software you're using, but you may find the output quality to remain less than ideal (given the increased file size). This usually means that the software only supports encoding to constant bit rate (CBR), instead of variable bit rate (VBR). VBR encoding should be preferred in most scenarios as it provides a better quality to file size ratio.
ga: Is féidir le roinnt clár ar nós Cumascóir Ogg Theora a sholáthar. Mar sin féin, is gnách go mbíonn na réamhshocruithe cáilíochta réamhshocraithe an-íseal de réir chaighdeáin an lae inniu. B'fhéidir go mbeidh tú in ann roghanna cáilíochta na mbogearraí atá á n-úsáid agat a mhéadú, ach seans go bhfanfaidh cáilíocht an aschuir níos lú ná mar a bheadh idéalach (ag cur san áireamh an méid comhaid méadaithe). Ciallaíonn sé seo de ghnáth nach dtacaíonn na bogearraí ach le hionchódú go ráta seasta giotán (CBR), in ionad ráta giotán athraitheach (VBR). Ba cheart ionchódú VBR a roghnú i bhformhór na gcásanna mar go soláthraíonn sé cáilíocht níos fearr le cóimheas méid comhaid.
ru: Некоторые программы, такие как Blender, могут выполнять рендеринг в Ogg Theora. Однако предустановки качества по умолчанию обычно очень низкие по современным стандартам. Возможно, вы сможете увеличить параметры качества в используемой программе, но качество на выходе может оказаться ниже идеального (учитывая увеличенный размер файла). Обычно это означает, что программное обеспечение поддерживает кодирование только с постоянной скоростью передачи данных (CBR), а не с переменной скоростью передачи данных (VBR). В большинстве сценариев предпочтение следует отдавать кодированию VBR, поскольку оно обеспечивает лучшее соотношение качества и размера файла.
ta: பிளெண்டர் போன்ற சில திட்டங்கள் OGG கோட்பாட்டிற்கு வழங்க முடியும். இருப்பினும், இயல்புநிலை தர முன்னமைவுகள் பொதுவாக இன்றைய தரங்களால் மிகக் குறைவு. நீங்கள் பயன்படுத்தும் மென்பொருளில் தரமான விருப்பங்களை நீங்கள் அதிகரிக்க முடியும், ஆனால் வெளியீட்டு தரத்தை இலட்சியத்தை விட குறைவாகவே இருப்பதைக் காணலாம் (அதிகரித்த கோப்பு அளவு கொடுக்கப்பட்டால்). இது பொதுவாக மென்பொருள் மாறி பிட் வீதத்திற்கு (வி.பி.ஆர்) பதிலாக நிலையான பிட் வீதத்திற்கு (சிபிஆர்) குறியாக்கத்தை மட்டுமே ஆதரிக்கிறது என்பதாகும். VBR குறியாக்கம் பெரும்பாலான காட்சிகளில் விரும்பப்பட வேண்டும், ஏனெனில் இது அளவு விகிதத்திற்கு சிறந்த தரத்தை வழங்குகிறது.
uk: Деякі програми, такі як Blender, можуть рендерити в Ogg Theora. Однак, стандартні параметри якості за замовчуванням зазвичай дуже низькі за сучасними стандартами. Ви можете збільшити параметри якості у програмному забезпеченні, яке ви використовуєте, але ви можете виявити, що якість на виході залишається не ідеальною (враховуючи збільшений розмір файлу). Зазвичай це означає, що програмне забезпечення підтримує лише кодування з постійним бітрейтом (CBR), а не зі змінним бітрейтом (VBR). У більшості випадків слід надавати перевагу кодуванню VBR, оскільки воно забезпечує краще співвідношення якості та розміру файлу.

source: Some other programs can't render to Ogg Theora at all.
ga: Ní féidir le roinnt cláir eile a thabhairt do Ogg Theora ar chor ar bith.
ru: Другие программы совсем не могут рендерить в Ogg Theora.
ta: வேறு சில திட்டங்கள் OGG கோட்பாட்டிற்கு வழங்க முடியாது.
uk: Деякі інші програми взагалі не можуть рендерити в Ogg Theora.

source: In this case, you can **render the video to an intermediate high-quality format** (such as a high-bitrate H.264 video) then re-encode it to Ogg Theora. Ideally, you should use a lossless or uncompressed format as an intermediate format to maximize the quality of the output Ogg Theora video, but this can require a lot of disk space.
ga: Sa chás seo, is féidir leat an físeán a rinneadh go formáid ardchaighdeáin idirmheánach** (mar shampla físeán H.264 ardghiotán) ansin é a athionchódú chuig Ogg Theora. Go hidéalach, ba cheart duit formáid gan chaillteanas nó neamh-chomhbhrúite a úsáid mar fhormáid idirmheánach chun cáilíocht an aschuir físeáin Ogg Theora a uasmhéadú, ach d'fhéadfadh go leor spáis diosca a bheith ag teastáil air seo.
ru: В этом случае можно **преобразовать видео в промежуточный высококачественный формат** (например, высокобитрейтный H.264), а затем повторно закодировать его в Ogg Theora. В идеале для достижения максимального качества выходного видео Ogg Theora следует использовать в качестве промежуточного формата формат без потерь или без сжатия, но это может потребовать большого объема дискового пространства.
ta: இந்த வழக்கில், நீங்கள் வீடியோவை ஒரு இடைநிலை உயர்தர வடிவமைப்பிற்கு வழங்கலாம் ** வெறுமனே, வெளியீட்டு OGG தியரா வீடியோவின் தரத்தை அதிகரிக்க ஒரு இடைநிலை வடிவமாக நீங்கள் இழப்பற்ற அல்லது சுருக்கப்படாத வடிவமைப்பைப் பயன்படுத்த வேண்டும், ஆனால் இதற்கு நிறைய வட்டு இடம் தேவைப்படலாம்.
uk: У цьому випадку ви можете **рендерити відео у проміжний високоякісний формат** (наприклад, відео з високим бітрейтом H.264), а потім перекодувати його в Ogg Theora. В ідеалі, вам слід використовувати формат без втрат або без стиснення як проміжний формат, щоб максимізувати якість вихідного відео Ogg Theora, але це може вимагати багато місця на диску.

source: `FFmpeg <https://ffmpeg.org/>`__ (CLI) is a popular open source tool for this purpose. FFmpeg has a steep learning curve, but it's a powerful tool.
ru: `FFmpeg <https://ffmpeg.org/>`__ (CLI) — популярный инструмент с открытым исходным кодом для этой цели. FFmpeg требует сложного освоения, но это мощный инструмент.
uk: `FFmpeg <https://ffmpeg.org/>`__ (CLI) – популярний інструмент з відкритим кодом для цієї мети. FFmpeg має крутий процес навчання, але це потужний інструмент.

source: Here are example FFmpeg commands to convert an MP4 video to Ogg Theora. Since FFmpeg supports a lot of input formats, you should be able to use the commands below with almost any input video format (AVI, MOV, WebM, …).
ga: Seo sampla orduithe FFmpeg chun físeán MP4 a thiontú go Ogg Theora. Ós rud é go dtacaíonn FFmpeg le go leor formáidí ionchuir, ba cheart go mbeadh tú in ann na horduithe thíos a úsáid le beagnach aon fhormáid físe ionchuir (AVI, MOV, WebM,...).
it: Ecco alcuni esempi di comandi FFmpeg per convertire un video MP4 in Ogg Theora. Poiché FFmpeg supporta molti formati di input, dovresti essere in grado di utilizzare i comandi seguenti con quasi tutti i formati video di input (AVI, MOV, WebM, ...).
ru: Вот примеры команд FFmpeg для преобразования видео MP4 в Ogg Theora. Поскольку FFmpeg поддерживает множество входных форматов, вы сможете использовать приведенные ниже команды практически с любым входным видеоформатом (AVI, MOV, WebM, ...).
ta: ஒரு MP4 வீடியோவை OGG கோட்பாடாக மாற்ற FFMPEG கட்டளைகள் இங்கே. FFMPEG நிறைய உள்ளீட்டு வடிவங்களை ஆதரிப்பதால், கீழேயுள்ள கட்டளைகளை நீங்கள் எந்த உள்ளீட்டு வீடியோ வடிவத்திலும் (AVI, MOV, WEBM,…) பயன்படுத்த முடியும்.
uk: Ось приклади команд FFmpeg для перетворення відео MP4 на Ogg Theora. Оскільки FFmpeg підтримує багато вхідних форматів, ви зможете використовувати наведені нижче команди майже з будь-яким вхідним відеоформатом (AVI, MOV, WebM, …).
