Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/playing_videos.po
Languages: ga, it, ru, ta, uk

source: To allow users to manipulate the chroma key effect in real-time, we created sliders in the `Control` node. The `Control` node's script contains the following functions:
ga: Chun ligean d'úsáideoirí an phríomhéifeacht chroma a ionramháil i bhfíor-am, chruthaíomar sleamhnáin sa nód `Rialaithe'. Tá na feidhmeanna seo a leanas i script an nód `Control`:
it: Per consentire agli utenti di manipolare l'effetto chroma key in tempo reale, abbiamo creato degli slider nel nodo `Control`. Lo script del nodo `Control` contiene le seguenti funzioni:
ru: Чтобы пользователи могли управлять эффектом хромакея в режиме реального времени, мы создали ползунки в `Control`. Скрипт узла `Control` содержит следующие функции:
ta: நிகழ்நேரத்தில் குரோமா விசை விளைவைக் கையாள பயனர்களை அனுமதிக்க, நாங்கள் `கட்டுப்பாடு` முனையில் ச்லைடர்களை உருவாக்கினோம். `கட்டுப்பாடு` முனையின் ச்கிரிப்டில் பின்வரும் செயல்பாடுகள் உள்ளன:
uk: Щоб дозволити користувачам маніпулювати ефектом кольоровості в режимі реального часу, ми створили повзунки у вузлі «Керування». Сценарій вузла `Control` містить такі функції:

source: also make sure that the range of the sliders are appropriate, our settings are :
ga: déan cinnte freisin go bhfuil raon na sleamhnáin oiriúnach, is iad ár socruithe:
it: assicurati anche che l'intervallo degli slider sia appropriato, le nostre impostazioni sono:
ru: также убедитесь, что диапазон ползунков соответствующий, наши настройки следующие :
ta: ச்லைடர்களின் வரம்பு பொருத்தமானது என்பதை உறுதிப்படுத்தவும், எங்கள் அமைப்புகள்:
uk: також переконайтеся, що діапазон повзунків є відповідним, наші налаштування:

source: Signal Handling
ga: Láimhseáil Comhar
it: Gestione dei segnali
ru: Обработка сигналов
ta: சமிக்ஞை கையாளுதல்
uk: Обробка сигналів

source: Connect the appropriate signal from the UI elements to the `Control` node's script. you created in the `Control` node's script to control the chroma key effect. These signal handlers will update the shader's uniform variables in response to user input.
ga: Ceangail an comhartha cuí ó na heilimintí Chomhéadain le script an nód `Control`. chruthaigh tú i script an nód `Control` chun an éifeacht chroma key a rialú. Déanfaidh na láimhseálaithe comhartha seo athróga aonfhoirmeacha an scáthaitheora a nuashonrú mar fhreagra ar ionchur úsáideora.
it: Connetti il segnale appropriato dagli elementi dell'interfaccia utente allo script del nodo `Control` creato nello script del nodo `Control` per controllare l'effetto chroma key. Questi gestori di segnale aggiorneranno le variabili uniformi dello shader in risposta all'input dell'utente.
ru: Подключите соответствующий сигнал от элементов пользовательского интерфейса к скрипту узла `Control`. Вы создали в скрипте узла `Control` скрипт для управления эффектом хромакея. Эти обработчики сигналов будут обновлять переменные формы шейдера в ответ на вводимые пользователем данные.
ta: இடைமுகம் கூறுகளிலிருந்து பொருத்தமான சமிக்ஞையை `கட்டுப்பாடு` முனையின் ச்கிரிப்டுடன் இணைக்கவும். குரோமா விசை விளைவைக் கட்டுப்படுத்த `கட்டுப்பாடு` முனையின் ச்கிரிப்டில் உருவாக்கியுள்ளீர்கள். இந்த சமிக்ஞை கையாளுபவர்கள் பயனர் உள்ளீட்டிற்கு பதிலளிக்கும் வகையில் சேடரின் சீரான மாறிகள் புதுப்பிப்பார்கள்.
uk: Підключіть відповідний сигнал від елементів UI до сценарію вузла `Control`. ви створили у сценарії вузла `Control` для керування ефектом кольоровості. Ці обробники сигналів оновлюватимуть уніфіковані змінні шейдера у відповідь на введення користувача.

source: Save and run the scene to see the chroma key effect in action! With the provided UI controls, you can now adjust the chroma key color, pickup range, and fade amount in real-time, achieving the desired chroma key functionality for your video content.
ga: Sábháil agus rith an radharc chun an éifeacht chroma key i ngníomh a fheiceáil! Leis na rialuithe Chomhéadain a chuirtear ar fáil, is féidir leat anois dath na heochrach chroma, an raon piocadh agus an méid céimnithe a choigeartú i bhfíor-am, ag baint amach an fheidhmiúlacht eochair chroma atá ag teastáil le haghaidh d'ábhar físe.
ru: Сохраните и запустите сцену, чтобы увидеть эффект хромакея в действии! С помощью встроенных элементов управления пользовательского интерфейса теперь вы можете настраивать цвет хромакея, диапазон захвата и степень затухания в режиме реального времени, добиваясь желаемой функциональности хромакея для вашего видеоконтента.
ta: குரோமா விசை விளைவைக் காண காட்சியைச் சேமித்து இயக்கவும்! வழங்கப்பட்ட இடைமுகம் கட்டுப்பாடுகள் மூலம், நீங்கள் இப்போது குரோமா விசை நிறம், இடும் வரம்பு மற்றும் மங்கலான தொகையை நிகழ்நேரத்தில் சரிசெய்யலாம், உங்கள் வீடியோ உள்ளடக்கத்திற்கான விரும்பிய குரோமா விசை செயல்பாட்டை அடையலாம்.
uk: Збережіть і запустіть сцену, щоб побачити ефект кольоровості в дії! За допомогою наданих елементів керування користувальницького інтерфейсу тепер ви можете регулювати колір ключа кольоровості, діапазон звукозапису та ступінь затухання в режимі реального часу, досягаючи бажаної функціональності ключа кольоровості для свого відеовмісту.

source: The only supported format in core is **Ogg Theora** (not to be confused with Ogg Vorbis audio). It's possible for extensions to bring support for additional formats, but no such extensions exist yet as of July 2022.
ga: Is é an t-aon fhormáid tacaithe sa chroí ná **Ogg Theora** (gan a mheascadh le fuaim Ogg Vorbis). Is féidir le síntí tacaíocht a thabhairt d'fhormáidí breise, ach níl aon síntí den sórt sin ann fós amhail Iúil 2022.
ta: மையத்தில் ஒரே ஆதரிக்கப்படும் வடிவம் ** ogg தியரா ** (OGG வோர்பிச் ஆடியோவுடன் குழப்பமடையக்கூடாது). கூடுதல் வடிவங்களுக்கு ஆதரவைக் கொண்டுவருவதற்கு நீட்டிப்புகள் சாத்தியமாகும், ஆனால் சூலை 2022 நிலவரப்படி அத்தகைய நீட்டிப்புகள் எதுவும் இல்லை.

source: You may find videos with an ``.ogg`` or ``.ogx`` extensions, which are generic extensions for data within an Ogg container.
ga: Is féidir leat físeáin a fháil le síntí `.ogg`` nó ``.ogx``, ar síntí cineálacha iad le haghaidh sonraí laistigh de choimeádán Ogg.
ta: ஒரு `` .ogg`` அல்லது `` .ogx`` நீட்டிப்புகளுடன் வீடியோக்களைக் காணலாம், அவை OGG கொள்கலனுக்குள் தரவுகளுக்கான பொதுவான நீட்டிப்புகளாகும்.

source: Select the VideoStreamPlayer node in the scene tree dock, go to the inspector and load an ``.ogv`` file in the Stream property.
ga: Roghnaigh an nód VideoStreamPlayer sa duga crann radhairc, téigh chuig an gcigre agus luchtaigh comhad ``.ogv`` sa mhaoin Stream.
ta: காட்சி மரக் கப்பல்துறையில் வீடியோச்ட்ரீஆம்ப்ளேயர் முனையைத் தேர்ந்தெடுத்து, இன்ச்பெக்டரிடம் சென்று ச்ட்ரீம் சொத்தில் `` .ogv`` கோப்பை ஏற்றவும்.

source: There are several limitations with the current implementation of video playback in Godot:
ga: Tá roinnt teorainneacha ann maidir le cur i bhfeidhm reatha athsheinm físe i Godot:
ta: கோடோட்டில் வீடியோ பிளேபேக்கின் தற்போதைய செயல்பாட்டில் பல வரம்புகள் உள்ளன:

source: Seeking a video to a certain point is not supported.
ga: Ní thacaítear le físeán a lorg go pointe áirithe.
ta: ஒரு குறிப்பிட்ட கட்டத்திற்கு வீடியோவைத் தேடுவது ஆதரிக்கப்படவில்லை.

source: Changing playback speed is not supported. VideoStreamPlayer also won't follow :ref:`Engine.time_scale<class_Engine_property_time_scale>`.
ga: Ní thacaítear le luas athsheinm a athrú. Ní leanfaidh VideoStreamPlayer ach oiread :tag:`Engine.time_scale<class_Engine_property_time_scale>`.
ta: பிளேபேக் வேகத்தை மாற்றுவது ஆதரிக்கப்படவில்லை. வீடியோச்ட்ரீஆம்ப்ளேயரும் பின்பற்றாது: குறிப்பு: `எஞ்சின்.

source: `HandBrake <https://handbrake.fr/>`__ (GUI) and `FFmpeg <https://ffmpeg.org/>`__ (CLI) are popular open source tools for this purpose. FFmpeg has a steeper learning curve, but it's more powerful.
ga: Is uirlisí foinse oscailte coitianta iad `HandBrake <https://handbrake.fr/>`__ (GUI) agus `FFmpeg <https://ffmpeg.org/>`__ (CLI) chun na críche seo. Tá cuar foghlama níos géire ag FFmpeg, ach tá sé níos cumhachtaí.
ta: `ஏண்ட்பிரேக் <https://handbrake.fr/>` __ (GUI) மற்றும் `ffmpeg <https://ffmpeg.org/> __ (CLI) இந்த நோக்கத்திற்காக பிரபலமான திறந்த மூல கருவிகள். FFMPEG ஒரு செங்குத்தான கற்றல் வளைவைக் கொண்டுள்ளது, ஆனால் இது மிகவும் ஆற்றல் வாய்ந்தது.
