Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_skinning.po
Languages: ga, it, pt_br, ru, ta, uk, zh_tw

source: Introduction to GUI skinning
ga: Réamhrá ar craiceann GUI
pt_br: Introdução ao skinning GUI
ru: Введение в skinning графического интерфейса
ta: GUI ச்கின்னிங் அறிமுகம்
uk: Вступ до графічного інтерфейсу користувача
zh_tw: GUI 換膚入門

source: It is essential for a game to provide clear, informative, and yet visually pleasing user interface to its players. While :ref:`Control <class_Control>` nodes come with a decently functional look out of the box, there is always room for uniqueness and case-specific tuning. For this purpose Godot engine includes a system for GUI skinning (or theming), which allows you to customize the look of every control in your user interface, including your custom controls.
ga: Tá sé riachtanach do chluiche comhéadan úsáideora atá soiléir, faisnéiseach, atá taitneamhach ó thaobh amhairc de a sholáthar dá imreoirí. Cé go dtagann nóid :ref:`Control <class_Control>` le cuma réasúnta feidhmiúil amach as an mbosca, bíonn spás i gcónaí le haghaidh uathúlacht agus tiúnadh cás-shonrach. Chun na críche sin folaíonn inneall Godot córas le haghaidh feannadh GUI (nó téamaí), a ligeann duit cuma gach rialaithe i do chomhéadan úsáideora a shaincheapadh, lena n-áirítear do rialuithe saincheaptha.
ru: Для игры крайне важно предоставлять игрокам понятный, информативный и при этом визуально приятный пользовательский интерфейс. Хотя узлы :ref:`Control <class_Control>` изначально имеют вполне функциональный вид, всегда есть возможность для уникальности и настройки под конкретный случай. Для этого в движке Godot предусмотрена система skinning (или theming) графического интерфейса, которая позволяет настраивать внешний вид каждого элемента управления в пользовательском интерфейсе, включая ваши собственные элементы управления.
ta: ஒரு விளையாட்டு அதன் வீரர்களுக்கு தெளிவான, தகவலறிந்த மற்றும் இன்னும் பார்வைக்கு மகிழ்ச்சியான பயனர் இடைமுகத்தை வழங்குவது தேவை. அதே நேரத்தில்: ref: `கட்டுப்பாடு <closs_control>` முனைகள் பெட்டியின் வெளியே ஒரு செயலற்ற தோற்றத்துடன் வருகின்றன, தனித்துவம் மற்றும் வழக்கு-குறிப்பிட்ட சரிப்படுத்தும் எப்போதும் இடமளிக்கும். இந்த நோக்கத்திற்காக கோடோட் எஞ்சின் GUI ச்கின்னிங் (அல்லது தீமிங்) க்கான ஒரு அமைப்பை உள்ளடக்கியது, இது உங்கள் தனிப்பயன் கட்டுப்பாடுகள் உட்பட உங்கள் பயனர் இடைமுகத்தில் உள்ள ஒவ்வொரு கட்டுப்பாட்டின் தோற்றத்தையும் தனிப்பயனாக்க உங்களை அனுமதிக்கிறது.
uk: Важливо, щоб гра надавала гравцям зрозумілий, інформативний, але візуально приємний інтерфейс користувача. Хоча вузли :ref:`Control <class_Control>` мають пристойно функціональний вигляд із коробки, завжди є місце для унікальності та індивідуального налаштування. Для цього движок Godot містить систему для оформлення графічного інтерфейсу (або створення тем), яка дозволяє вам налаштувати вигляд кожного елемента керування у вашому інтерфейсі користувача, включно з вашими власними елементами керування.
zh_tw: 遊戲必須為玩家提供清晰、資訊豐富且視覺上令人愉悅的使用者介面。雖然 :ref:`Control <class_Control>` 節點預設就有相當實用的外觀，但仍有不少空間可以讓你打造獨特的風格或進行針對性的調整。為此，Godot 引擎內建了 GUI 換膚（或主題）系統，讓你能自訂所有介面控制項的外觀，包括你自訂的控制項。

source: Here is an example of this system in action — a game with the GUI that is radically different from the default UI theme of the engine:
ga: Seo sampla den chóras seo i ngníomh - cluiche leis an GUI atá an-difriúil ó théama réamhshocraithe UI an innill:
ru: Вот пример этой системы в действии — игра с графическим интерфейсом, который радикально отличается от стандартной темы пользовательского интерфейса движка:
ta: செயலில் இந்த அமைப்பின் எடுத்துக்காட்டு இங்கே - GUI உடன் ஒரு விளையாட்டு இயந்திரத்தின் இயல்புநிலை இடைமுகம் கருப்பொருளிலிருந்து தீவிரமாக வேறுபட்டது:
uk: Ось приклад цієї системи в дії — гра з графічним інтерфейсом користувача, який радикально відрізняється від стандартної теми інтерфейсу користувача движка:
zh_tw: 以下展示此系統的實際效果——一款遊戲的 GUI 與引擎預設的 UI 主題有著截然不同的風格：

source: A "Gear Up!" screen in Tank Kings, courtesy of Winterpixel Games
ga: A “Gear Up!” scáileán i Tank Kings, le caoinchead Cluichí Winterpixel
ru: Экран «Gear Up!» в Tank Kings, предоставленный Winterpixel Games
ta: ஒரு "கியர் அப்!" டேங்க் கிங்சில் திரை, வின்டர்பிக்சல் விளையாட்டுகளின் மரியாதை
uk: A "Gear Up!" екран у Tank Kings, люб’язно наданий Winterpixel Games
zh_tw: 《坦克王》中的「裝備起來！」介面，感謝 Winterpixel Games 授權提供

source: Beyond achieving a unique look for your game, this system also enables developers to provide customization options to the end users, including accessibility settings. UI themes are applied in a cascading manner (i.e. they propagate from parent controls to their children), which means that font settings or adjustments for colorblind users can be applied in a single place and affect the entire UI tree. Of course this system can also be used for gameplay purposes: your hero-based game can change its style for the selected player character, or you can give different flavors to the sides in your team-based project.
ga: Seachas cuma uathúil a bhaint amach do chluiche, cuireann an córas seo ar chumas forbróirí roghanna saincheaptha a sholáthar do na húsáideoirí deiridh, lena n-áirítear socruithe inro Cuirtear téamaí Chomhéadain i bhfeidhm ar bhealach cascadach (ie iomadaíonn siad ó rialuithe tuismitheoirí chuig a gcuid leanaí), rud a chiallaíonn gur féidir socruithe cló nó coigeartuithe d'úsáideoirí dathdall a chur i bhfeidhm in aon áit amháin agus dul i bhfeidhm ar an gcrann UI iomlán Ar ndóigh is féidir an córas seo a úsáid chun críocha gameplay freisin: is féidir le do chluiche bunaithe ar laoch a stíl a athrú don charachtar imreoir roghnaithe, nó is féidir leat blasanna éagsúla a thabhairt do na taobhanna i do thionscadal foirne-bhunaithe.
ru: Помимо достижения уникального внешнего вида вашей игры, эта система также позволяет разработчикам предоставлять конечным пользователям возможности настройки, включая параметры доступности. Темы пользовательского интерфейса применяются каскадным образом (т.е. распространяются от родительских элементов управления к их дочерним элементам), что означает, что настройки шрифта или корректировки для слепых пользователей могут применяться в одном месте и влиять на все дерево пользовательского интерфейса. Конечно, эта система может быть использована и в игровых целях: ваша игра, основанная на герое, может менять свой стиль в зависимости от выбранного персонажа игрока, или вы можете придать разный вкус сторонам в вашем командном проекте.
ta: உங்கள் விளையாட்டுக்கான தனித்துவமான தோற்றத்தை அடைவதற்கு அப்பால், அணுகல் அமைப்புகள் உட்பட இறுதி பயனர்களுக்கு தனிப்பயனாக்குதல் விருப்பங்களை வழங்க டெவலப்பர்களுக்கு இந்த அமைப்பு உதவுகிறது. இடைமுகம் கருப்பொருள்கள் ஒரு அடுக்கு முறையில் பயன்படுத்தப்படுகின்றன (அதாவது அவை பெற்றோர் கட்டுப்பாடுகளிலிருந்து தங்கள் குழந்தைகளுக்கு பரப்புகின்றன), அதாவது எழுத்துரு அமைப்புகள் அல்லது வண்ணமயமான பயனர்களுக்கான சரிசெய்தல் ஒரே இடத்தில் பயன்படுத்தப்படலாம் மற்றும் முழு இடைமுகம் மரத்தையும் பாதிக்கலாம். நிச்சயமாக இந்த அமைப்பு விளையாட்டு நோக்கங்களுக்காகவும் பயன்படுத்தப்படலாம்: உங்கள் ஈரோ அடிப்படையிலான விளையாட்டு தேர்ந்தெடுக்கப்பட்ட பிளேயர் கதாபாத்திரத்திற்காக அதன் பாணியை மாற்றலாம் அல்லது உங்கள் அணி அடிப்படையிலான திட்டத்தில் பக்கங்களுக்கு வெவ்வேறு சுவைகளை வழங்கலாம்.
uk: Окрім досягнення унікального вигляду вашої гри, ця система також дозволяє розробникам надавати параметри налаштування для кінцевих користувачів, зокрема налаштування доступності. Теми інтерфейсу користувача застосовуються каскадним способом (тобто вони поширюються від батьківських елементів керування до дочірніх), що означає, що параметри шрифту або налаштування для користувачів із дальтоніком можна застосувати в одному місці та вплинути на все дерево інтерфейсу користувача. Звичайно, цю систему також можна використовувати для геймплея: ваша гра, заснована на героях, може змінити свій стиль для вибраного персонажа гравця, або ви можете надати сторонам різні відтінки у своєму командному проекті.
zh_tw: 除了為遊戲打造獨特外觀外，這套系統也讓開發者能為終端使用者提供自訂選項，包括無障礙設定。UI 主題是以階層方式套用（也就是會從父控制項向下傳遞到子控制項），這代表像字型設定或色盲相關調整，都能在單一處設定並影響整個 UI 樹狀結構。當然，這套系統也能用於遊戲性設計：像英雄類遊戲可以讓選定角色有不同風格，或團隊遊戲可為不同勢力設計專屬樣式。

source: Basics of themes
ga: Buneilimintí téamaí
it: Le basi dei temi
ru: Основы тем
ta: கருப்பொருள்களின் அடிப்படைகள்
uk: Основи тем
zh_tw: 主題基礎

source: The skinning system is driven by the :ref:`Theme <class_Theme>` resource. Every Godot project has an inherent default theme that contains the settings used by the built-in control nodes. This is what gives the controls their distinct look out of the box. A theme only describes the configuration, however, and it is still the job of each individual control to use that configuration in the way it requires to display itself. This is important to remember when implementing :ref:`your own custom controls <doc_custom_gui_controls>`.
ga: Tá an córas feannadh á thiomáint ag an acmhainn :ref:`Téama <class_Theme>`. Tá téama réamhshocraithe bunúsach ag gach tionscadal Godot ina bhfuil na socruithe a úsáideann na nóid rialaithe ionsuite. Is é seo a thugann a n-amharc ar leith amach as an mbosca do na rialuithe. Ní dhéanann téama ach cur síos ar an gcumraíocht, áfach, agus is é tasc gach rialaithe aonair fós an chumraíocht sin a úsáid ar an mbealach a éilíonn sé é féin a thaispeáint. Tá sé tábhachtach cuimhneamh air seo agus :ref:`do rialuithe saincheaptha féin <doc_custom_gui_controls> á chur i bhfeidhm.
it: Il sistema di skinning è gestito dalla risorsa :ref:`Theme <class_Theme>`. Ogni progetto Godot ha un tema predefinito intrinseco che contiene le impostazioni utilizzate dai nodi di controllo integrati. Questo è ciò che da ai controlli il loro aspetto distintivo fin da subito. Un tema, tuttavia, descrive solo la configurazione, ed è comunque compito di ogni singolo controllo utilizzare tale configurazione nel modo in cui si voglia visualizzare. Questo è importante da ricordare quando si implementano :ref:`controlli personalizzati <doc_custom_gui_controls>`.
ru: Система скинов управляется ресурсом :ref:`Theme <class_Theme>`. Каждый проект Godot имеет встроенную тему по умолчанию, которая содержит настройки, используемые встроенными узлами управления. Это то, что придает элементам управления их отличительный внешний вид из коробки. Однако тема описывает только конфигурацию, и каждый отдельный элемент управления должен использовать эту конфигурацию так, как ему нужно для своего отображения. Это важно помнить при реализации :ref:`собственных пользовательских элементов управления <doc_custom_gui_controls>`.
ta: ச்கின்னிங் அமைப்பு: ref: `தீம் <class_theme>` வளத்தால் இயக்கப்படுகிறது. ஒவ்வொரு கோடோட் திட்டத்திலும் உள்ளார்ந்த இயல்புநிலை கருப்பொருள் உள்ளது, இது உள்ளமைக்கப்பட்ட கட்டுப்பாட்டு முனைகளால் பயன்படுத்தப்படும் அமைப்புகளைக் கொண்டுள்ளது. இதுதான் கட்டுப்பாடுகள் அவற்றின் தனித்துவமான தோற்றத்தை பெட்டியின் வெளியே தருகின்றன. ஒரு கருப்பொருள் உள்ளமைவை மட்டுமே விவரிக்கிறது, இருப்பினும், அந்த உள்ளமைவை தன்னைக் காண்பிக்கத் தேவைப்படும் விதத்தில் பயன்படுத்துவது ஒவ்வொரு தனிப்பட்ட கட்டுப்பாட்டின் வேலையாகும். செயல்படுத்தும்போது இதை நினைவில் கொள்வது முக்கியம்: ref: `உங்கள் சொந்த தனிப்பயன் கட்டுப்பாடுகள் <doc_custom_gui_controls>`.
uk: Система створення скінів керується ресурсом :ref:`Theme <class_Theme>`. Кожен проект Godot має власну тему за замовчуванням, яка містить налаштування, що використовуються вбудованими вузлами керування. Це те, що надає елементам керування виразний вигляд із коробки. Однак тема лише описує конфігурацію, і завданням кожного окремого елемента керування є використання цієї конфігурації так, як вона вимагає для відображення. Це важливо пам’ятати під час впровадження :ref:`ваших власних елементів керування <doc_custom_gui_controls>`.
zh_tw: 換膚系統是由 :ref:`Theme <class_Theme>` 資源驅動。每個 Godot 專案都有一個內建的預設主題，包含所有內建控制項預設的外觀設定。這就是控制項預設外觀的來源。不過主題僅僅描述設定，實際如何運用這些設定來顯示，仍取決於各個控制項本身。這點在你實作 :ref:`自訂控制項 <doc_custom_gui_controls>` 時一定要注意。

source: Even the Godot editor itself relies on the default theme. But it doesn't look the same as a Godot project, because it applies its own heavily customized theme on top of the default one. In principle, this works exactly like it would in your game as explained :ref:`below <doc_gui_theme_in_project>`.
ga: Braitheann fiú eagarthóir Godot féin ar an téama réamhshocraithe. Ach ní fhéachann sé mar an gcéanna le tionscadal Godot, toisc go gcuireann sé a théama saincheaptha féin i bhfeidhm ar bharr an chinn réamhshocraithe. I bprionsabal, oibríonn sé seo díreach mar a bheadh i do chluiche mar a mhínítear :ref:`thíos <doc_gui_theme_in_project>`.
it: Anche l'editor Godot stesso dipende dal tema predefinito. Ma non ha lo stesso aspetto di un progetto Godot, perché applica un tema personalizzato a quello predefinito. In principio, funziona esattamente come in un gioco, come spiegato :ref:`in seguito <doc_gui_theme_in_project>`.
ru: Даже сам редактор Godot использует тему по умолчанию. Но он выглядит не так, как проект Godot, поскольку применяет собственную, сильно модифицированную тему поверх стандартной. В принципе, это работает точно так же, как в вашей игре, как описано :ref:`ниже <doc_gui_theme_in_project>`.
ta: கோடோட் எடிட்டர் கூட இயல்புநிலை கருப்பொருளை நம்பியுள்ளது. ஆனால் இது ஒரு கோடோட் திட்டத்திற்கு சமமாகத் தெரியவில்லை, ஏனென்றால் இது இயல்புநிலை ஒன்றின் மேல் அதன் சொந்த தனிப்பயனாக்கப்பட்ட கருப்பொருளைப் பயன்படுத்துகிறது. கொள்கையளவில், இது உங்கள் விளையாட்டில் விளக்கப்பட்டுள்ளபடி சரியாக செயல்படுகிறது: குறிப்பு: `கீழே <doc_gui_theme_in_project>` கீழே.
uk: Навіть сам редактор Godot покладається на тему за замовчуванням. Але він виглядає не так, як проект Godot, оскільки він застосовує власну сильно налаштовану тему поверх стандартної. В принципі, це працює так само, як і у вашій грі, як описано :ref:`нижче <doc_gui_theme_in_project>`.
zh_tw: 連 Godot 編輯器本身也依賴預設主題。但編輯器看起來和一般 Godot 專案不同，因為它在預設主題之上，疊加了高度自訂的主題。原則上這和你的遊戲專案的運作方式完全一樣，詳見 :ref:`下方說明 <doc_gui_theme_in_project>`。

source: Theme items
ga: Míreanna téama
pt_br: Itens do tema
ru: Тематические элементы
ta: கருப்பொருள் உருப்படிகள்
uk: Тематичні предмети
zh_tw: 主題項目

source: The configuration that is stored in a theme consists of theme items. Each item has a unique name and must be one of the following data types:
ga: Is éard atá sa chumraíocht a stóráiltear i dtéama míreanna téama. Tá ainm uathúil ag gach mír agus caithfidh sé a bheith ar cheann de na cineálacha sonraí seo a leanas:
it: La configurazione memorizzata in un tema è composta da elementi del tema. Ogni elemento ha un nome univoco e deve essere uno dei seguenti tipi di dati:
ru: Конфигурация, хранящаяся в теме, состоит из элементов темы. Каждый элемент имеет уникальное имя и должен иметь один из следующих типов данных:
ta: ஒரு கருப்பொருளில் சேமிக்கப்படும் உள்ளமைவு கருப்பொருள் உருப்படிகளைக் கொண்டுள்ளது. ஒவ்வொரு உருப்படிக்கும் ஒரு தனித்துவமான பெயர் உள்ளது மற்றும் பின்வரும் தரவு வகைகளில் ஒன்றாக இருக்க வேண்டும்:
uk: Конфігурація, яка зберігається в темі, складається з елементів теми. Кожен елемент має унікальне ім’я та має бути одного з таких типів даних:
zh_tw: 儲存在主題中的設定由多個主題項目構成。每個項目都有唯一名稱，且必須屬於下列資料型別之一：

source: **Color**
ga: **Dath**
ta: ** நிறம் **
zh_tw: **顏色**

source: A :ref:`color <class_Color>` value, which is often used for fonts and backgrounds. Colors can also be used for modulation of controls and icons.
ga: A :ref:`color <class_Color>` luach, a úsáidtear go minic le haghaidh clónna agus cúlraí. Is féidir dathanna a úsáid freisin chun rialuithe agus deilbhíní a mhodhnú.
it: Un valore :ref:`color <class_Color>`, spesso utilizzato per font e sfondi. I colori si possono utilizzare anche per la modulazione di controlli e icone.
ru: Значение :ref:`color <class_Color>`, которое часто используется для шрифтов и фонов. Цвета также можно использовать для модуляции элементов управления и значков.
ta: ப: குறிப்பு: `வண்ணம் <class_color>` மதிப்பு, இது பெரும்பாலும் எழுத்துருக்கள் மற்றும் பின்னணிக்கு பயன்படுத்தப்படுகிறது. கட்டுப்பாடுகள் மற்றும் சின்னங்களை மாற்றியமைப்பதற்கும் வண்ணங்கள் பயன்படுத்தப்படலாம்.
uk: Значення :ref:`color <class_Color>`, яке часто використовується для шрифтів і фону. Кольори також можна використовувати для модуляції елементів керування та значків.
zh_tw: :ref:`color <class_Color>` 值，常用於字型和背景。顏色也可用於控制項和圖示的調色或變色。

source: **Constant**
ga: **Tairiseach**
it: **Costante**
pt_br: **Constante**
ta: ** மாறிலி **
zh_tw: **常數**

source: An integer value, which can be used either for numeric properties of controls (such as the item separation in a :ref:`BoxContainer <class_BoxContainer>`), or for boolean flags (such as the drawing of relationship lines in a :ref:`Tree <class_Tree>`).
ga: Luach slánuimhir, is féidir a úsáid le haghaidh airíonna uimhriúla rialtáin (amhail scaradh na míre i :ref:`BoxContainer <class_BoxContainer>`), nó le haghaidh bratacha boolean (amhail línte coibhneasa a tharraingt i :ref: `Crann <rang_Tree>`).
it: Un valore intero, che si può utilizzare per proprietà numeriche di controlli (ad esempio la separazione degli elementi in un :ref:`BoxContainer <class_BoxContainer>`) o per flag booleani (ad esempio il disegno di linee di relazione in un :ref:`Tree <class_Tree>`).
ru: Целочисленное значение, которое может использоваться либо для числовых свойств элементов управления (например, для разделения элементов в :ref:`BoxContainer <class_BoxContainer>`), либо для логических флагов (например, для рисования линий отношений в :ref:`Tree <class_Tree>`).
ta: ஒரு முழு எண் மதிப்பு, இது கட்டுப்பாடுகளின் எண் பண்புகளுக்கு (A: ref இல் உள்ள உருப்படி பிரிப்பு போன்றவை: `பாக்ச் கான்டெய்னர் <class_boxcontainer>`), அல்லது பூலியன் கொடிகளுக்கு (A: ref இல் உறவு கோடுகளின் வரைதல் போன்றவை போன்றவை பயன்படுத்தலாம்: `மரம் <class_tree>`).
uk: Ціле значення, яке можна використовувати або для числових властивостей елементів керування (наприклад, розділення елементів у :ref:`BoxContainer <class_BoxContainer>`), або для логічних прапорів (таких як малювання ліній зв’язку в :ref:`Tree <class_Tree>`).
zh_tw: 整數值，可用於控制項的數值屬性（例如 :ref:`BoxContainer <class_BoxContainer>` 的間距設定），或作為布林旗標（例如 :ref:`Tree <class_Tree>` 是否繪製關聯線）。

source: **Font**
ga: **Cló**
pt_br: **Fonte**
ta: ** எழுத்துரு **
uk: **Шрифт**
zh_tw: **字型**

source: A :ref:`font <class_Font>` resource, which is used by controls that display text. Fonts contain most text rendering settings, except for its size and color. On top of that, alignment and text direction are controlled by individual controls.
ga: A :ref:`font <class_Font>` acmhainn, a úsáideann rialtáin a thaispeánann téacs. Tá formhór na socruithe rindreála téacs i gclónna, seachas a mhéid agus a dhath. Ina theannta sin, tá ailíniú agus treo an téacs á rialú ag rialuithe aonair.
it: Una risorsa :ref:`font <class_Font>`, utilizzata dai controlli che visualizzano il testo. I font contengono gran parte delle impostazioni di rendering del testo, ad eccezione di dimensione e colore. Inoltre, l'allineamento e la direzione del testo sono controllati da controlli individuali.
ru: Ресурс :ref:`font <class_Font>`, используемый элементами управления для отображения текста. Шрифты содержат большинство настроек отрисовки текста, за исключением его размера и цвета. Кроме того, выравнивание и направление текста задаются отдельными элементами управления.
ta: ப: குறிப்பு: `எழுத்துரு <class_font>` வளம், இது உரையைக் காண்பிக்கும் கட்டுப்பாடுகளால் பயன்படுத்தப்படுகிறது. எழுத்துருக்களில் அதன் அளவு மற்றும் வண்ணத்தைத் தவிர பெரும்பாலான உரை வழங்குதல் அமைப்புகள் உள்ளன. அதற்கு மேல், சீரமைப்பு மற்றும் உரை திசை தனிப்பட்ட கட்டுப்பாடுகளால் கட்டுப்படுத்தப்படுகின்றன.
uk: Ресурс :ref:`font <class_Font>`, який використовується елементами керування, які відображають текст. Шрифти містять більшість параметрів відтворення тексту, за винятком його розміру та кольору. Крім того, вирівнювання та напрямок тексту контролюються окремими елементами керування.
zh_tw: :ref:`font <class_Font>` 資源，供顯示文字的控制項使用。字型資源本身包含大部分文字算繪設定，但大小和顏色除外。對齊方式與文字方向則是由各控制項自訂。

source: **Font size**
ga: **Méid cló**
it: **Dimensione di font**
ta: ** எழுத்துரு அளவு **
zh_tw: **字型大小**

source: An integer value, which is used alongside a font to determine the size at which the text should be displayed.
ga: Luach sláimhir, a úsáidtear in éineacht le cló chun an méid ar chóir an téacs a thaispeáint a chinneadh.
it: Un valore intero, che viene utilizzato insieme a un font per determinare la dimensione alla quale deve essere visualizzato il testo.
ru: Целочисленное значение, которое используется вместе со шрифтом для определения размера отображаемого текста.
ta: ஒரு முழு எண் மதிப்பு, இது உரை காண்பிக்கப்பட வேண்டிய அளவை தீர்மானிக்க எழுத்துருவுடன் பயன்படுத்தப்படுகிறது.
uk: Ціле число, яке використовується разом із шрифтом для визначення розміру тексту, який має відображатися.
zh_tw: 一個整數值，與字型一起決定文字顯示的大小。

source: **Icon**
ga: **Dheilbhín**
it: **Icona**
ta: ** படவுரு **
zh_tw: **圖示**

source: A :ref:`texture <class_Texture2D>` resource, which is normally used to display an icon (on a :ref:`Button <class_Button>`, for example).
ga: A :ref:`uigeacht <class_Texture2D>` acmhainn, a úsáidtear de ghnáth chun deilbhín a thaispeáint (ar :ref:`Cnaipe <class_Button>`, mar shampla).
it: Una risorsa :ref:`texture <class_Texture2D>`, che normalmente è utilizzata per visualizzare un'icona (ad esempio su un :ref:`Button <class_Button>`).
ru: Ресурс :ref:`texture <class_Texture2D>`, который обычно используется для отображения значка (например, на :ref:`Button <class_Button>`).
ta: ப: குறிப்பு: `அமைப்பு <class_texture2d>` வளம், இது பொதுவாக ஒரு ஐகானைக் காண்பிக்கப் பயன்படுகிறது (a: ref: `பொத்தான் <class_button>`, எடுத்துக்காட்டாக).
uk: Ресурс :ref:`texture <class_Texture2D>`, який зазвичай використовується для відображення значка (наприклад, на :ref:`Button <class_Button>`).
zh_tw: :ref:`texture <class_Texture2D>` 資源，通常用於顯示圖示（例如 :ref:`Button <class_Button>` 上）。

source: **StyleBox**
ga: **Bosca stíl**
ta: ** பாணி பாக்ச் **

source: A :ref:`StyleBox <class_StyleBox>` resource, a collection of configuration options which define the way a UI panel should be displayed. This is not limited to the :ref:`Panel <class_Panel>` control, as styleboxes are used by many controls for their backgrounds and overlays.
ga: A :ref:`StyleBox <class_StyleBox>` acmhainn, bailiúchán de roghanna cumraíochta a shainíonn an bealach ar cheart painéal Chomhéadain a thaispeáint. Níl sé seo teoranta don rialú :ref:`Painéal <class_Panel>`, mar go n-úsáideann go leor rialtáin stíleanna dá gcúlra agus dá bhforleagan.
it: Una risorsa :ref:`StyleBox <class_StyleBox>`, una raccolta di opzioni di configurazione che definiscono il modo in cui un pannello dell'interfaccia si dovrebbe visualizzare. Questo non si limita al controllo :ref:`Panel <class_Panel>`, poiché gli stylebox sono utilizzati da molti controlli per i loro sfondi e sovrapposizioni.
ru: Ресурс :ref:`StyleBox <class_StyleBox>`, представляющий собой набор параметров конфигурации, определяющих способ отображения панели пользовательского интерфейса. Это относится не только к элементу управления :ref:`Panel <class_Panel>`, поскольку стили используются многими элементами управления для фонов и наложений.
ta: ப: குறிப்பு: `ச்டைல் பாக்ச் <class_stylebox>` வள, இடைமுகம் பேனலைக் காட்ட வேண்டிய விதத்தை வரையறுக்கும் உள்ளமைவு விருப்பங்களின் தொகுப்பு. இது மட்டுப்படுத்தப்படவில்லை: ref: `பேனல் <class_panel>` கட்டுப்பாடு, ஏனெனில் பாணி பாக்ச்கள் அவற்றின் பின்னணி மற்றும் மேலடுக்குகளுக்கு பல கட்டுப்பாடுகளால் பயன்படுத்தப்படுகின்றன.
uk: Ресурс :ref:`StyleBox <class_StyleBox>`, набір параметрів конфігурації, які визначають спосіб відображення панелі інтерфейсу. Це не обмежується елементом керування :ref:`Panel <class_Panel>`, оскільки поля стилів використовуються багатьма елементами керування для фону та накладень.
zh_tw: :ref:`StyleBox <class_StyleBox>` 資源，是一組定義 UI 面板顯示方式的設定集合。不只 :ref:`Panel <class_Panel>` 控制項使用 StyleBox，許多控制項也都會用於其背景或覆蓋層。
