Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: The set of axes you can adjust depends on the font loaded. Some variable fonts only support one axis of adjustment (typically *weight* or *slant*), while others may support multiple axes of adjustment.
ga: Braitheann an tacar aiseanna is féidir leat a choigeartú ar an gcló luchtaithe. Ní thacaíonn roinnt clónna athraitheacha ach le hais amháin coigeartaithe (de ghnáth *weight *nó *slant *), agus d'fhéadfadh cinn eile tacú le haiseanna éagsúla coigeartaithe.
it: L'insieme di assi che è possibile regolare dipende dal font caricato. Alcuni font variabili supportano un solo asse di regolazione (in genere *peso* o *inclinazione*), mentre altri possono supportare più assi di regolazione.
ru: Набор доступных для настройки осей зависит от загруженного шрифта. Некоторые вариативные шрифты поддерживают только одну ось настройки (обычно *насыщенность* или *наклон*), в то время как другие могут поддерживать несколько осей настройки.
ta: நீங்கள் சரிசெய்யக்கூடிய அச்சுகளின் தொகுப்பு ஏற்றப்பட்ட எழுத்துருவைப் பொறுத்தது. சில மாறி எழுத்துருக்கள் சரிசெய்தலின் ஒரு அச்சை மட்டுமே ஆதரிக்கின்றன (பொதுவாக *எடை *அல்லது *சாய்ந்த *), மற்றவர்கள் சரிசெய்தலின் பல அச்சுகளை ஆதரிக்கலாம்.
uk: Набір осей, які можна налаштувати, залежить від завантаженого шрифту. Деякі змінні шрифти підтримують лише одну вісь коригування (зазвичай *weight* або *slant*), а інші можуть підтримувати кілька осей коригування.
zh_hant: 可調整的軸依所載入的字型而異。有些僅支援單一軸（如*粗細*或*傾斜*），有些則可多軸切換。

source: For example, here's the `Inter V <https://rsms.me/inter/>`__ font with a *weight* of ``900`` and a *slant* of ``-10``:
ga: Mar shampla, seo chugainn an cló `Inter V <https://rsms.me/inter/>`__ le *meáchan* de ``900`` agus *slant* de ``-10``:
it: Ad esempio, ecco il font `Inter V <https://rsms.me/inter/>`__ con un *peso* di ``900`` e un'*inclinazione* di ``-10``:
ru: Например, вот шрифт `Inter V <https://rsms.me/inter/>`__ с *жирностью* ``900`` и *наклоном* ``-10``:
ta: எடுத்துக்காட்டாக, இங்கே `இன்டர் வி <https://rsms.me/inter/>` __ __ ஒரு * எடையுடன் * `900`` மற்றும் ஒரு * சாய்வு *` -10``:
uk: Наприклад, ось шрифт `Inter V <https://rsms.me/inter/>`__ з *вагою* ``900`` і *нахилом* ``-10``:
zh_hant: 例如，這是 `Inter V <https://rsms.me/inter/>`__ 字型，*粗細* 設為 ``900``、*傾斜* 設為 ``-10``：

source: Variable font example (Inter V)
ga: Sampla cló athraitheach (Inter V)
it: Esempio di font variabile (Inter V)
ru: Пример вариативного шрифта (Inter V)
ta: மாறி எழுத்துரு எடுத்துக்காட்டு (இன்டர் வி)
uk: Приклад змінного шрифту (Inter V)
zh_hant: 可變字型範例（Inter V）

source: While variable font axis names and scales aren't standardized, some common conventions are usually followed by font designers. The *weight* axis is standardized in OpenType to work as follows:
it: Sebbene i nomi e le scale degli assi dei font variabili non siano standardizzati, i designer di font solitamente seguono alcune convenzioni comuni. L'asse *weight* è standardizzato in OpenType per funzionare come segue:
ru: Хотя названия осей и масштабы переменных шрифтов не стандартизированы, дизайнеры шрифтов обычно придерживаются некоторых общих соглашений. Ось *насыщенность* стандартизирована в OpenType следующим образом:
ta: மாறி எழுத்துரு அச்சு பெயர்கள் மற்றும் செதில்கள் தரப்படுத்தப்படவில்லை என்றாலும், சில பொதுவான மரபுகள் வழக்கமாக எழுத்துரு வடிவமைப்பாளர்களால் பின்பற்றப்படுகின்றன. * எடை * அச்சு பின்வருமாறு வேலை செய்ய ஓபன்டைப்பில் தரப்படுத்தப்பட்டுள்ளது:
zh_hant: 雖然可變字型軸名稱和刻度沒有統一標準，但字型設計師一般會遵循某些慣例。 *weight* （粗細）軸在 OpenType 標準中對應如下：

source: Axis value
it: Valore di asse
ru: Значение оси
ta: அச்சு மதிப்பு
zh_hant: 軸值

source: Effective font weight
it: Peso effettivo del font
ru: Эффективная толщина шрифта
ta: பயனுள்ள எழுத்துரு எடை
zh_hant: 實際字型粗細

source: Thin (Hairline)
it: Sottile (capello)
ru: Тонкие (как волос)
ta: மெல்லிய (மயிரிழை)
zh_hant: 極細（髮絲）

source: Extra Light (Ultra Light)
ru: Экстра тонкие (Ультра тонкие)
ta: கூடுதல் ஒளி (அல்ட்ரா லைட்)
zh_hant: 超細

source: Light
it: Lieve
ru: Лёгкий
ta: ஒளி
zh_hant: 細

source: **Regular (Normal)**
it: **Regolare (Normale)**
ru: **Обычный (Нормальный)**
ta: ** வழக்கமான (சாதாரண) **
zh_hant: **標準（Regular）**

source: Medium
it: Medio
ru: Середний
ta: சராசரி
zh_hant: 中等

source: Semi-Bold (Demi-Bold)
it: Semigrassetto (Demi-Bold)
ru: Полужирный (Demi-Bold)
ta: அரை-போல்ட் (டெமி-போல்ட்)
zh_hant: 半粗

source: **Bold**
it: **Grassetto**
ru: **Жирный**
ta: ** துணிவு **
zh_hant: **粗體**

source: Extra Bold (Ultra Bold)
ru: Очень жирный (Ultra Bold)
ta: கூடுதல் தைரியமான (அல்ட்ரா தைரியமான)
zh_hant: 超粗

source: Black (Heavy)
ru: Черный (Тяжелый)
ta: கருப்பு (கனமானது)
zh_hant: 極粗（黑體）

source: Extra Black (Ultra Black)
ru: Экстра черный (Ultra Black)
ta: கூடுதல் கருப்பு (அல்ட்ரா கருப்பு)
zh_hant: 極黑

source: You can save the FontVariation to a ``.tres`` resource file to reuse it in other places:
ga: Is féidir leat an FontVariation a shábháil chuig comhad acmhainní ``.tres`` chun é a athúsáid in áiteanna eile:
it: È possibile salvare il FontVariation in un file risorsa ``.tres`` per riutilizzarlo in altri posti:
ru: Вы можете сохранить FontVariation в файле ресурсов ``.tres``, чтобы использовать его в других местах:
ta: எழுத்துருவை மற்ற இடங்களில் மீண்டும் பயன்படுத்த `` .ரேச்` வள கோப்பில் சேமிக்க முடியும்:
uk: Ви можете зберегти FontVariation у файлі ресурсів ``.tres``, щоб використовувати його в інших місцях:
zh_hant: 你可將 FontVariation 存成 `.tres` 資源檔，方便其他地方重複使用：

source: Saving FontVariation to an external resource file
ga: FontVariation a shábháil chuig comhad acmhainní seachtrach
it: Salvataggio di FontVariation in un file risorsa esterno
ru: Сохранение FontVariation во внешнем файле ресурсов
ta: வெளிப்புற வள கோப்பில் எழுத்துருவை சேமிக்கிறது
uk: Збереження FontVariation у файл зовнішнього ресурсу
zh_hant: 將 FontVariation 存為外部資源檔

source: Faux bold and italic
ga: Faux trom agus iodálach
it: Grassetto e corsivo simulato
ru: Искусственный полужирный шрифт и курсив
ta: போலி தைரியமான மற்றும் சாய்வு
uk: Штучний жирний шрифт і курсив
zh_hant: 仿粗體與仿斜體

source: When writing text in bold or italic, using font variants specifically designed for this looks better. Spacing between glyphs will be more consistent when using a bold font, and certain glyphs' shapes may change entirely in italic variants (compare "a" and *"a"*).
ga: Agus téacs á scríobh i dtrom nó iodálach, tá cuma níos fearr ag úsáid leaganacha cló atá deartha go sonrach chuige seo. Beidh spásáil idir glyphs níos comhsheasmhach agus cló trom á n-úsáid agat, agus féadfaidh cruthanna gliphanna áirithe athrú go hiomlán i leaganacha iodálacha (déan comparáid idir “a” agus *"a"*).
it: Quando si scrive testo in grassetto o corsivo, utilizzare variazioni di font appositamente progettate per questo scopo ha un aspetto migliore. La spaziatura tra i glifi sarà più uniforme quando si utilizza un font in grassetto, e la forma di alcuni glifi potrebbe cambiare completamente nelle variazioni corsive (confronta "a" e *"a"*).
ru: При выделении текста жирным шрифтом или курсивом лучше использовать шрифты, специально разработанные для этого. Расстояние между глифами будет более равномерным при использовании жирного шрифта, а форма некоторых глифов может полностью измениться при использовании курсивных вариантов (сравните "a" и *"a"*).
ta: தைரியமான அல்லது சாய்வில் உரையை எழுதும் போது, இதற்காக குறிப்பாக வடிவமைக்கப்பட்ட எழுத்துரு வகைகளைப் பயன்படுத்துவது நன்றாக இருக்கிறது. தைரியமான எழுத்துருவைப் பயன்படுத்தும் போது கிளிஃப்களுக்கு இடையிலான இடைவெளி மிகவும் சீரானதாக இருக்கும், மேலும் சில கிளிஃப்களின் வடிவங்கள் முற்றிலும் சாய்வு மாறுபாடுகளில் மாறக்கூடும் ("A" மற்றும் *"A" *ஐ ஒப்பிடுக).
uk: Під час написання тексту жирним або курсивом використання варіантів шрифту, спеціально розроблених для цього, виглядає краще. Інтервали між гліфами будуть більш узгодженими при використанні жирного шрифту, а форми деяких гліфів можуть повністю змінюватися у варіантах курсиву (порівняйте «a» та *«a»*).
zh_hant: 要顯示粗體或斜體，最好用專門設計的字型變體。粗體能讓字元間距一致，斜體則有些字元形狀完全不同（如直體與斜體的「a」）。

source: However, real bold and italic fonts require shipping more font files, which increases distribution size. A single :ref:`variable font <doc_using_fonts_variable_fonts>` file can also be used, but this file will be larger than a single non-variable font. While file size is usually not an issue for desktop projects, it can be a concern for mobile/web projects that strive to keep distribution size as low as possible.
ga: Mar sin féin, éilíonn fíorchlónna troma agus iodálach níos mó comhad cló a sheoladh, rud a mhéadaíonn méid an dáileacháin. Is féidir comhad amháin :ref:`cló inathraithe <doc_using_fonts_variable_fonts>` a úsáid freisin, ach beidh an comhad seo níos mó ná cló amháin neamh-inathraithe. Cé nach mbíonn méid comhaid ina ábhar imní de ghnáth do thionscadail deisce, is féidir leis a bheith ina ábhar imní do thionscadail mhóibíleacha/gréasáin a dhéanann iarracht méid an dáileacháin a choinneáil chomh híseal agus is féidir.
it: Tuttavia, i font in grassetto e corsivo richiedono la distribuzione di più file, il che aumenta le dimensioni della distribuzione. È possibile utilizzare anche un singolo file di :ref:`font variabile <doc_using_fonts_variable_fonts>`, ma questo file sarà più grande di un singolo font non variabile. Sebbene la dimensione del file non siano solitamente un problema per i progetti desktop, possono esserlo per i progetti mobile/web che si sforzano di mantenere la dimensione della distribuzione il più ridotta possibile.
ru: Однако для настоящих полужирных и курсивных шрифтов требуется больше файлов шрифтов, что увеличивает размер дистрибутива. Можно также использовать один файл :ref:`variable font <doc_using_fonts_variable_fonts>`, но он будет больше, чем файл с одним непеременным шрифтом. Хотя размер файла обычно не является проблемой для настольных проектов, он может стать проблемой для мобильных/веб-проектов, стремящихся максимально сократить размер дистрибутива.
ta: இருப்பினும், உண்மையான தைரியமான மற்றும் சாய்வு எழுத்துருக்களுக்கு அதிக எழுத்துரு கோப்புகளை அனுப்ப வேண்டும், இது விநியோக அளவை அதிகரிக்கிறது. ஒற்றை: குறிப்பு: `மாறி எழுத்துரு <doc_using_fonts_variable_fonts>` கோப்பையும் பயன்படுத்தலாம், ஆனால் இந்த கோப்பு ஒரு மாறாத எழுத்துருவை விட பெரியதாக இருக்கும். கோப்பு அளவு பொதுவாக டெச்க்டாப் திட்டங்களுக்கு ஒரு சிக்கல் அல்ல என்றாலும், விநியோக அளவை முடிந்தவரை குறைவாக வைத்திருக்க முயற்சிக்கும் மொபைல்/வலை திட்டங்களுக்கு இது ஒரு கவலையாக இருக்கலாம்.
uk: Однак для справжніх жирних і курсивних шрифтів потрібно надсилати більше файлів шрифтів, що збільшує розмір розподілу. Також можна використовувати один файл :ref:`змінного шрифту <doc_using_fonts_variable_fonts>`, але цей файл буде більшим, ніж один незмінний шрифт. Хоча розмір файлу зазвичай не є проблемою для настільних проектів, він може бути проблемою для мобільних/веб-проектів, які прагнуть зберегти розмір розповсюдження якомога меншим.
zh_hant: 但若要支援真正的粗體與斜體就必須多帶字型檔，會讓專案體積變大。雖然可用 :ref:`可變字型 <doc_using_fonts_variable_fonts>` 取代多檔案，但單一可變字型檔也會比單一普通字型大。對桌面應用影響不大，行動與網頁專案則需考量容量。

source: To allow bold and italic fonts to be displayed without having to ship additional fonts (or use a variable font that is larger in size), Godot supports *faux* bold and italic.
ga: Chun clónna troma agus iodálacha a ligean a thaispeáint gan clónna breise a sheoladh (nó cló athraitheach atá níos mó i méid a úsáid), tacaíonn Godot le *faux* trom agus iodálach.
it: Per poter visualizzare font in grassetto e corsivo senza dover fornire font aggiuntivi (o utilizzare un font variabile di dimensioni maggiori), Godot supporta il grassetto e il corsivo *simulato*.
ru: Чтобы обеспечить отображение жирных и курсивных шрифтов без необходимости поставки дополнительных шрифтов (или использования переменного шрифта большего размера), Godot поддерживает *поддельные* жирный и курсивный шрифты.
ta: கூடுதல் எழுத்துருக்களை அனுப்பாமல் (அல்லது அளவு பெரியதாக இருக்கும் மாறி எழுத்துருவைப் பயன்படுத்தாமல்) தைரியமான மற்றும் சாய்வு எழுத்துருக்களைக் காண்பிக்க அனுமதிக்க, கோடோட் * போலி * தைரியமான மற்றும் சாய்வானதை ஆதரிக்கிறது.
uk: Щоб дозволити відображати жирні шрифти та курсив без необхідності надсилати додаткові шрифти (або використовувати змінний шрифт більшого розміру), Godot підтримує *несправжні* жирний шрифт і курсив.
zh_hant: 為了讓專案不用附加粗體／斜體字型（或大容量可變字型），Godot 支援 *仿粗體／仿斜體*。

source: Faux bold/italic (top), real bold/italic (bottom). Normal font used: Open Sans SemiBold
ga: Faux trom/iodálach (barr), fíor trom/iodálach (bun). Gnáthchló a úsáidtear: Open Sans SemiBold
it: Grassetto/corsivo simulato (in alto), grassetto/corsivo autentico (in basso). Font normale utilizzato: Open Sans SemiBold
ru: Псевдожирный/курсивный (вверху), настоящий полужирный/курсивный (внизу). Использован стандартный шрифт: Open Sans SemiBold
ta: போலி தைரியமான/சாய்வு (மேல்), உண்மையான தைரியமான/சாய்வு (கீழே). பயன்படுத்தப்படும் சாதாரண எழுத்துரு: திறந்த சான்ச் செமிபோல்ட்
uk: Штучний жирний/курсив (угорі), справжній жирний/курсив (внизу). Використовується звичайний шрифт: Open Sans SemiBold
zh_hant: 仿粗體／仿斜體（上），真正的粗體／斜體（下）。所用一般字型：Open Sans SemiBold

source: Faux bold and italic is automatically used in :ref:`class_RichTextLabel`'s bold and italic tags if no custom fonts are provided for bold and/or italic.
ga: Úsáidtear faux trom agus iodálach go huathoibríoch in:ref: clibeanna troma agus iodálacha `Class_RichTextLabel` mura soláthraítear aon chlónna saincheaptha le haghaidh trom agus/nó iodálach.
it: Il grassetto e il corsivo simulati sono utilizzati automaticamente nei tag del grassetto e del corsivo di :ref:`class_RichTextLabel` se non sono forniti font personalizzati per il grassetto e/o il corsivo.
ru: Поддельные полужирный и курсивный шрифты автоматически используются в тегах полужирного и курсивного шрифта :ref:`class_RichTextLabel`, если для полужирного и/или курсивного шрифта не предусмотрены специальные шрифты.
ta: போலி தைரியமான மற்றும் சாய்வு தானாகவே பயன்படுத்தப்படுகிறது: ref: `class_richtextlabel` இன் தைரியமான மற்றும் சாய்வு குறிச்சொற்கள் தைரியமான மற்றும்/அல்லது சாய்வுக்கு தனிப்பயன் எழுத்துருக்கள் வழங்கப்படாவிட்டால்.
uk: Несправжні напівжирний і курсив автоматично використовуються в тегах :ref:`class_RichTextLabel` напівжирний і курсив, якщо для напівжирного і/або курсиву не надано спеціальні шрифти.
zh_hant: 如果你沒給 :ref:`class_RichTextLabel` 指定粗體／斜體字型，自動會用仿粗體／仿斜體。

source: To use faux bold, create a FontVariation resource in a property where a Font resource is expected. Set **Variation > Embolden** to a positive value to make a font bolder, or to a negative value to make it less bold. Recommended values are between ``0.5`` and ``1.2`` depending on the font.
ga: Chun faux trom a úsáid, cruthaigh acmhainn FontVariation in airí ina bhfuiltear ag súil le hacmhainn Cló. Socraigh **Athraithe > Embolden** ar luach deimhneach chun cló a dhéanamh níos dána, nó ar luach diúltach chun é a dhéanamh níos lú dána. Tá na luachanna molta idir `` 0.5`` agus `` 1.2`` ag brath ar an gcló.
it: Per utilizzare il grassetto simulato, creare una risorsa FontVariation in una proprietà in cui è prevista una risorsa Font. Impostare **Variation > Embolden** su un valore positivo per rendere il font più grassetto, o su un valore negativo per renderlo meno grassetto. I valori consigliati sono compresi tra ``0.5`` e ``1.2``, a seconda del font.
ru: Чтобы использовать псевдожирный шрифт, создайте ресурс FontVariation в свойстве, где ожидается ресурс Font. Установите для параметра **Variation > Embolden** положительное значение, чтобы сделать шрифт более жирным, или отрицательное, чтобы сделать его менее жирным. Рекомендуемые значения — от ``0.5`` до ``1.2`` в зависимости от шрифта.
ta: ஃபாக்ச் தைரியத்தைப் பயன்படுத்த, எழுத்துரு வளத்தை எதிர்பார்க்கும் ஒரு சொத்தில் ஒரு எழுத்துரு வளத்தை உருவாக்கவும். எழுத்துரு தைரியத்தை உருவாக்க நேர்மறையான மதிப்புக்கு ** மாறுபாடு> தைரியமான ** ஐ அமைக்கவும், அல்லது எதிர்மறையான மதிப்புக்கு குறைவாக தைரியமாக மாற்றவும். பரிந்துரைக்கப்பட்ட மதிப்புகள் எழுத்துருவைப் பொறுத்து `` 0.5`` மற்றும் `` 1.2`` க்கு இடையில் உள்ளன.
uk: Щоб використовувати штучний жирний шрифт, створіть ресурс FontVariation у властивості, де очікується ресурс Font. Установіть **Variation > Embolden** додатне значення, щоб зробити шрифт більш жирним, або від’ємне значення, щоб зробити його менш жирним. Рекомендовані значення від ``0,5`` до ``1,2`` залежно від шрифту.
zh_hant: 要產生仿粗體，可在需 Font 資源的欄位建立 FontVariation，調整 **變化 > 加粗（Embolden）** 為正值（讓字型更粗），或負值（反之）。建議值為 0.5 ~ 1.2，依字型而異。

source: Faux italic is created by skewing the text, which is done by modifying the per-character transform. This is also provided in FontVariation using the **Variation > Transform** property. Setting the ``yx`` component of the character transform to a positive value will italicize the text. Recommended values are between ``0.2`` and ``0.4`` depending on the font.
ga: Cruthaítear cló iodálach faux tríd an téacs a scealú, rud a dhéantar tríd an gclaochlú in aghaidh an charachtair a mhodhnú. Cuirtear é seo ar fáil freisin in FontVariation ag baint úsáide as an maoin **Athraithe > Trasfhoirmigh**. Má shocraítear comhpháirt ``yx`` an charachtair a chlaochlú go luach dearfach, cuirfear an téacs i gcló iodálach. Tá na luachanna molta idir `` 0.2`` agus `` 0.4`` ag brath ar an gcló.
it: Il corsivo simulato è creato inclinando il testo, modificando la trasformazione per ogni carattere. Questa funzionalità è disponibile anche in FontVariation tramite la proprietà **Variation > Transform**. Impostando il componente ``yx`` della trasformazione del carattere a un valore positivo, il testo sarà scritto in corsivo. I valori consigliati sono compresi tra ``0.2`` e ``0.4``, a seconda del font.
ru: Псевдокурсив создаётся путём наклона текста, что достигается изменением посимвольного преобразования. Это также реализовано в FontVariation с помощью свойства **Variation > Transform**. Установка положительного значения для компонента ``yx`` преобразования символа приведёт к курсивному начертанию текста. Рекомендуемые значения — от ``0.2`` до ``0.4`` в зависимости от шрифта.
ta: உரையைத் திசைதிருப்புவதன் மூலம் போலி சாய்வு உருவாக்கப்படுகிறது, இது ஒவ்வொரு எழுத்துக்களின் உருமாற்றத்தை மாற்றியமைப்பதன் மூலம் செய்யப்படுகிறது. இது ** மாறுபாடு> உருமாற்றம் ** சொத்தைப் பயன்படுத்தி எழுத்துருவாக்கத்திலும் வழங்கப்படுகிறது. எழுத்துக்குறி மாற்றத்தின் `` yx`` கூறுகளை நேர்மறையான மதிப்புக்கு அமைப்பது உரையை சாய்வு செய்யும். பரிந்துரைக்கப்பட்ட மதிப்புகள் எழுத்துருவைப் பொறுத்து `` 0.2`` மற்றும் `` 0.4` க்கு இடையில் உள்ளன.
uk: Фальшивий курсив створюється шляхом перекосу тексту, що виконується зміною кожного символу. Це також надається у FontVariation за допомогою властивості **Variation > Transform**. Встановлення додатного значення для компонента ``yx`` символьного перетворення призведе до виділення тексту курсивом. Рекомендовані значення від ``0,2`` до ``0,4`` залежно від шрифту.
zh_hant: 仿斜體則是將字元傾斜，可在 FontVariation 的 **變化 > 變換（Transform）** 內設定字元轉換的 ``yx`` 為正值。建議數值約 0.2 ~ 0.4，依字型而定。

source: Adjusting font spacing
ga: Spásanna cló a choigeartú
it: Aggiuntare la spaziatura di font
ru: Регулировка интервала шрифта
ta: எழுத்துரு இடைவெளியை சரிசெய்தல்
uk: Налаштування інтервалу між шрифтами
zh_hant: 調整字型間距

source: For stylistic purposes or for better readability, you may want to adjust how a font is presented in Godot.
ga: Chun críocha stíle nó chun inléiteacht níos fearr, b'fhéidir gur mhaith leat a choigeartú conas a chuirtear cló i láthair i Godot.
it: Per motivi stilistici o per una migliore leggibilità, si potrebbe voler modificare il modo in cui un font è presentato in Godot.
ru: В стилистических целях или для лучшей читаемости вы можете настроить отображение шрифта в Godot.
ta: ச்டைலிச்டிக் நோக்கங்களுக்காக அல்லது சிறந்த வாசிப்புக்கு, கோடோட்டில் எழுத்துரு எவ்வாறு வழங்கப்படுகிறது என்பதை நீங்கள் சரிசெய்ய விரும்பலாம்.
uk: Для стилістичних цілей або для кращої читабельності ви можете налаштувати спосіб представлення шрифту в Godot.
zh_hant: 你可以因應美術需求或可讀性，自行調整字型在 Godot 的顯示方式。

source: Create a FontVariation resource in a property where a Font resource is expected. There are 4 properties available in the **Variation > Extra Spacing** section, which accept positive and negative values:
ga: Cruthaigh acmhainn FontVariation in airí ina bhfuiltear ag súil le hacmhainn Cló. Tá 4 réadmhaoin ar fáil sa rannán **Athraithe > Spásáil Bhreise**, a ghlacann le luachanna dearfacha agus diúltacha:
it: Creare una risorsa FontVariation in una proprietà in cui è prevista una risorsa Font. Sono disponibili 4 proprietà nella sezione **Variation > Extra Spacing**, che accettano valori positivi e negativi:
ru: Создайте ресурс FontVariation в свойстве, где ожидается ресурс Font. В разделе **Variation > Extra Spacing** доступны 4 свойства, которые принимают положительные и отрицательные значения:
ta: எழுத்துரு சான்று எதிர்பார்க்கப்படும் ஒரு சொத்தில் ஒரு எழுத்துருவாக்கம் வளத்தை உருவாக்கவும். ** மாறுபாடு> கூடுதல் இடைவெளி ** பிரிவில் 4 பண்புகள் உள்ளன, அவை நேர்மறை மற்றும் எதிர்மறை மதிப்புகளை ஏற்றுக்கொள்கின்றன:
uk: Створіть ресурс FontVariation у властивості, де очікується ресурс Font. У розділі **Варіація > Додатковий інтервал** є 4 властивості, які приймають додатні та від’ємні значення:
zh_hant: 你可在需 Font 資源的屬性建立 FontVariation，**變化 > 額外間距** 有 4 欄可調（支援正負值）：

source: **Glyph:** Additional spacing between every glyph.
ga: **Glyph: ** Spásáil bhreise idir gach gliph.
it: **Glifo:** spaziatura aggiuntiva tra ogni glifo.
ru: **Glyph (Глиф):** Дополнительный интервал между каждым глифом.
ta: ** கிளிஃப்: ** ஒவ்வொரு கிளிஃபுக்கும் இடையில் கூடுதல் இடைவெளி.
uk: **Гліф:** додатковий інтервал між кожним гліфом.
zh_hant: **字元：** 每個字元之間的間距。

source: **Space:** Additional spacing between words.
ga: **Spás: ** Spásanna breise idir focail.
it: **Spazio:** spaziatura aggiuntiva tra le parole.
ru: **Space (Пробел):** Дополнительный пробел между словами.
ta: ** இடம்: ** சொற்களுக்கு இடையில் கூடுதல் இடைவெளி.
uk: **Пробіл:** додатковий інтервал між словами.
zh_hant: **空白：** 單字之間的間距。

source: **Top:** Additional spacing above glyphs. This is used for multiline text, but also to calculate the minimum size of controls such as :ref:`class_Label` and :ref:`class_Button`.
ga: **Barr: ** Spásanna breise os cionn glyphs. Úsáidtear é seo le haghaidh téacs illíne, ach freisin chun íosmhéid na rialuithe mar: ref: `Class_label` agus:ref: `Class_button` a ríomh.
it: **Alto:** spaziatura aggiuntiva sopra i glifi. È utilizzata per il testo su più righe, ma anche per calcolare la dimensione minima di controlli come :ref:`class_Label` e :ref:`class_Button`.
ru: **Top (Сверху):** Дополнительный интервал над глифами. Используется для многострочного текста, а также для расчета минимального размера элементов управления, таких как :ref:`class_Label` и :ref:`class_Button`.
ta: ** மேல்: ** கிளிஃப்களுக்கு மேலே கூடுதல் இடைவெளி. இது மல்டிலைன் உரைக்குப் பயன்படுத்தப்படுகிறது, ஆனால் இது போன்ற கட்டுப்பாடுகளின் குறைந்தபட்ச அளவைக் கணக்கிடவும் பயன்படுத்தப்படுகிறது: குறிப்பு: `class_label` மற்றும்: ref:` class_button`.
uk: **Вгорі:** додатковий інтервал над гліфами. Це використовується для багаторядкового тексту, а також для обчислення мінімального розміру елементів керування, таких як :ref:`class_Label` і :ref:`class_Button`.
zh_hant: **上方：** 字元上方的額外間距。多行文字或像 :ref:`class_Label`、:ref:`class_Button` 這類元件最小高度用得到。
