Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_containers.po
Languages: ga, it, ru, ta, uk, zh_hant

source: These containers make use of the *Stretch Ratio* property for children with the *Expand* flag set.
it: Questi contenitori sfruttano la proprietà *Rapporto di allungamento* per gli elementi figlio con il flag *Expand* impostato.
ru: Эти контейнеры используют свойство *Stretch Ratio* для дочерних элементов с установленным флагом *Expand*.
zh_hant: 這些容器會對啟用 *擴展（Expand）* 的子節點，套用 *比例（Stretch Ratio）* 屬性。

source: Grid Container
ga: Coimeádán Greille
ru: Grid Container (Сетчатый контейнер)
ta: கட்டம் கொள்கலன்
uk: Сітковий контейнер
zh_hant: 網格容器

source: Arranges child controls in a grid layout (via :ref:`GridContainer <class_GridContainer>`, amount of columns must be specified). Uses both the vertical and horizontal expand flags.
ga: Socraítear rialuithe leanaí i leagan amach greille (trí :ref:`GridContainer <class_GridContainer>`, ní mór méid na gcolún a shonrú). Úsáideann an dá na bratacha leathnú ingearach agus cothrománach.
it: Dispone i controlli figlio in una disposizione a griglia (tramite :ref:`GridContainer <class_GridContainer>`, è necessario specificare il numero di colonne). Utilizza i flag di espansione sia verticale sia orizzontale.
ru: Располагает дочерние элементы управления в виде сетки (через :ref:`GridContainer <class_GridContainer>`, необходимо указать количество столбцов). Использует как вертикальный, так и горизонтальный флаги расширения.
ta: கட்டம் தளவமைப்பில் குழந்தை கட்டுப்பாடுகளை ஏற்பாடு செய்கிறது (வழியாக: குறிப்பு: `கிரிட் கான்டெய்னர் <class_gridcontainer>`, நெடுவரிசைகளின் அளவு குறிப்பிடப்பட வேண்டும்). செங்குத்து மற்றும் கிடைமட்ட விரிவாக்க கொடிகள் இரண்டையும் பயன்படுத்துகிறது.
uk: Упорядковує дочірні елементи керування в макеті сітки (через :ref:`GridContainer <class_GridContainer>`, необхідно вказати кількість стовпців). Використовує як вертикальні, так і горизонтальні прапорці розгортання.
zh_hant: 將子控制項以網格方式排列（使用 :ref:`GridContainer <class_GridContainer>`，須設定欄數），同時支援垂直和水平擴展旗標。

source: Margin Container
ga: Coimeádán Ime
ru: Margin Container (Контейнер маржи)
ta: விளிம்பு கொள்கலன்
uk: Маржинальний контейнер
zh_hant: 邊距容器

source: Child controls are expanded towards the bounds of this control (via :ref:`MarginContainer <class_MarginContainer>`). Padding will be added on the margins depending on the theme configuration.
ga: Leathnaítear rialuithe leanaí i dtreo teorainneacha an rialaithe seo (via :ref:`MarginContainer <class_MarginContainer>`). Cuirfear stuáil leis ar na himill ag brath ar chumraíocht an téama.
it: I controlli figlio sono espansi verso i limiti di questo controllo (tramite :ref:`MarginContainer <class_MarginContainer>`). Il rientro verrà aggiunto ai margini in base alla configurazione del tema.
ru: Дочерние элементы управления расширяются до границ данного элемента управления (через :ref:`MarginContainer <class_MarginContainer>`). Отступы к полям будут добавлены в зависимости от настроек темы.
ta: குழந்தை கட்டுப்பாடுகள் இந்த கட்டுப்பாட்டின் எல்லைகளை நோக்கி விரிவாக்கப்படுகின்றன (வழியாக: குறிப்பு: `மார்சின்கான்டேனர் <class_margincontainer>`). கருப்பொருள் உள்ளமைவைப் பொறுத்து விளிம்புகளில் திணிப்பு சேர்க்கப்படும்.
uk: Дочірні елементи керування розширюються до меж цього елемента керування (через :ref:`MarginContainer <class_MarginContainer>`). Залежно від конфігурації теми до полів буде додано відступ.
zh_hant: 子控制項會被擴展至本容器邊界（使用 :ref:`MarginContainer <class_MarginContainer>`）。邊距（Padding）會依據主題設定自動加入。

source: Again, keep in mind that the margins are a *Theme* value, so they need to be edited from the constants overrides section of each control:
ga: Arís, coinnigh i gcuimhne gur luach*Téam* iad na corrlacha, mar sin caithfear iad a chur in eagar ó chuid na gcomhsheasmhálacha de gach rialú:
it: Ancora una volta, tieni presente che i margini sono un valore del *Tema*, quindi si devono modificare dalla sezione delle sostituzioni di costanti in ciascun controllo:
ru: Опять же, помните, что поля — это значение *Theme*, поэтому их необходимо редактировать в разделе переопределений констант каждого элемента управления:
ta: மீண்டும், விளிம்புகள் ஒரு * கருப்பொருள் * மதிப்பு என்பதை நினைவில் கொள்ளுங்கள், எனவே அவை ஒவ்வொரு கட்டுப்பாட்டின் பகுதியின் பகுதியிலிருந்து திருத்தப்பட வேண்டும்:
uk: Знову ж таки, майте на увазі, що поля є значенням *Theme*, тому їх потрібно редагувати в розділі заміни констант кожного елемента керування:
zh_hant: 請注意，邊距屬於 *主題* 設定值，需在各控制項的「常數覆寫」欄位中調整：

source: Tab Container
ga: Coimeádán Tab
it: Contenitore di schede
ru: Tab Container (Контейнер вкладок)
ta: தாவல் கொள்கலன்
uk: Контейнер вкладок
zh_hant: 分頁容器

source: Allows you to place several child controls stacked on top of each other (via :ref:`TabContainer <class_TabContainer>`), with only the *current* one visible.
ga: Ligeann sé seo duit roinnt rialtáin leanaí atá Cruachta ar bharr a chéile (trí :ref:`TabContainer <class_TabContainer>`), agus gan ach an ceann * reatha* le feiceáil.
it: Consente di posizionare più controlli figlio uno sopra l'altro (tramite :ref:`TabContainer <class_TabContainer>`), lasciando visibile solo quello *attuale*.
ru: Позволяет размещать несколько дочерних элементов управления друг над другом (через :ref:`TabContainer <class_TabContainer>`), при этом видимым будет только *текущий* элемент.
ta: ஒருவருக்கொருவர் மேல் அடுக்கி வைக்கப்பட்ட பல குழந்தை கட்டுப்பாடுகளை வைக்க உங்களை அனுமதிக்கிறது (வழியாக: குறிப்பு: `TABCONTAINER <Class_tabContainer>`), * தற்போதைய * ஒன்று மட்டுமே தெரியும்.
uk: Дозволяє розміщувати кілька дочірніх елементів керування, розташованих один на одному (через :ref:`TabContainer <class_TabContainer>`), причому видно лише *поточний*.
zh_hant: 允許將多個子控制項堆疊（使用 :ref:`TabContainer <class_TabContainer>`），僅顯示當前（*目前*）的那一個。

source: Changing the *current* one is done via tabs located at the top of the container, via clicking:
ga: Déantar an ceann* reatha* a athrú trí chluaisíní atá suite ag barr an choimeádáin, trí chliceáil:
it: Il cambio di quello *attuale* si fa tramite le schede poste in alto al contenitore, cliccandoci:
ru: Изменение *текущего* значения осуществляется с помощью вкладок, расположенных в верхней части контейнера, путем нажатия:
ta: * மின்னோட்டத்தை * மாற்றுவது கொள்கலனின் மேற்புறத்தில் அமைந்துள்ள தாவல்கள் வழியாக, சொடுக்கு செய்வதன் மூலம் செய்யப்படுகிறது:
uk: Зміна *поточного* виконується за допомогою вкладок, розташованих у верхній частині контейнера, натиснувши:
zh_hant: 可以透過點擊容器頂端的分頁來切換顯示 *目前* 的子控制項：

source: The titles are generated from the node names by default (although they can be overridden via *TabContainer* API).
ga: Gintear na teidil ó ainmneacha na nód de réir réamhshocraithe (cé gur féidir iad a shárú trí*TabContainer* API).
it: I titoli sono generati normalmente dai nomi dei nodi (sebbene si possano sovrascrivere tramite l'API del *TabContainer*).
ru: Заголовки генерируются из имен узлов по умолчанию (хотя их можно переопределить через API *TabContainer*).
ta: தலைப்புகள் முன்னிருப்பாக முனை பெயர்களிலிருந்து உருவாக்கப்படுகின்றன (இருப்பினும் அவை * tabcontainer * பநிஇ வழியாக மீறப்படலாம் என்றாலும்).
uk: За замовчуванням заголовки генеруються з імен вузлів (хоча їх можна змінити за допомогою API *TabContainer*).
zh_hant: 分頁標題預設會根據節點名稱產生（也可透過 *TabContainer* API 進行覆寫）。

source: Settings such as tab placement and *StyleBox* can be modified in the *TabContainer* theme overrides.
ga: Is féidir socruithe cosúil le socrúchán cluaisín agus *StyleBox* a mhodhnú sna téama*TabContainer* a shárú.
it: È possibile modificare impostazioni quali il posizionamento delle schede e lo *StyleBox* nelle sostituzioni del tema del *TabContainer*.
ru: Такие настройки, как размещение вкладок и *StyleBox*, можно изменить в переопределениях темы *TabContainer*.
ta: தாவல் வேலைவாய்ப்பு மற்றும் * பாணி பாக்ச் * போன்ற அமைப்புகளை * TABCONTAINER * கருப்பொருள் மேலெழுதலில் மாற்றலாம்.
uk: Такі параметри, як розміщення вкладок і *StyleBox*, можна змінити в заміщеннях теми *TabContainer*.
zh_hant: 如分頁位置、*StyleBox* 等設定，可於 *TabContainer* 的主題覆寫中調整。

source: Split Container
ga: Coimeádán scoilt
it: Contenitore divisore
ru: Split Container (Раздельный контейнер)
ta: கொள்கலன் பிரிக்கவும்
uk: Розділений контейнер
zh_hant: 分割容器

source: Accepts only one or two children controls, then places them side to side with a divisor (via :ref:`HSplitContainer <class_HSplitContainer>` and :ref:`VSplitContainer <class_VSplitContainer>`). Respects both horizontal and vertical flags, as well as *Ratio*.
ga: Ní ghlacann ach le rialú leanaí amháin nó dhó, ansin cuireann sé iad taobh le taobh le roinnteoir (via :ref:`HSplitContainer <class_HSplitContainer>` agus :ref:`VSplitContainer <class_VSplitContainer>`). Tá meas aige ar bhratacha cothrománacha agus ingearacha, chomh maith le *Cóimheas*.
it: Accetta solo uno o due controlli figlio, poi li colloca uno accanto all'altro con un divisore (tramite :ref:`HSplitContainer <class_HSplitContainer>` e :ref:`VSplitContainer <class_VSplitContainer>`). Rispetta sia i flag orizzontali sia i flag verticali, così come il *Ratio*.
ru: Принимает только один или два дочерних элемента управления, а затем размещает их рядом друг с другом с помощью разделителя (через :ref:`HSplitContainer <class_HSplitContainer>` и :ref:`VSplitContainer <class_VSplitContainer>`). Учитывает как горизонтальные, так и вертикальные флаги, а также *Ratio*.
ta: ஒன்று அல்லது இரண்டு குழந்தைகள் மட்டுமே கட்டுப்பாடுகளை ஏற்றுக்கொள்கிறார்கள், பின்னர் அவர்களை ஒரு வகுப்பாளருடன் பக்கவாட்டில் வைக்கிறார்கள் (வழியாக: குறிப்பு: `hsplitcontainer <class_hsplitcontainer>` மற்றும்: ref: `vsplitcontainer <class_vsplitcontainer>`). கிடைமட்ட மற்றும் செங்குத்து கொடிகளை மதிக்கிறது, அதே போல் *விகிதம் *.
uk: Приймає лише один чи два дочірні елементи керування, а потім розміщує їх поруч із дільником (через :ref:`HSplitContainer <class_HSplitContainer>` і :ref:`VSplitContainer <class_VSplitContainer>`). Поважає як горизонтальні, так і вертикальні прапорці, а також *Ratio*.
zh_hant: 僅接受一至兩個子控制項，並以分隔線並排顯示（使用 :ref:`HSplitContainer <class_HSplitContainer>` 和 :ref:`VSplitContainer <class_VSplitContainer>`）。支援水平與垂直旗標，以及 *比例* 屬性。

source: The divisor can be dragged around to change the size relation between both children:
ga: Is féidir an roinnteoir a tharraingt timpeall chun an gaol méide idir an dá pháiste a athrú:
it: Il divisore si può trascinare per cambiare la relazione dimensionale tra entrambi i figli:
ru: Разделитель можно перетаскивать, чтобы изменить соотношение размеров между двумя дочерними элементами:
ta: இரு குழந்தைகளுக்கும் இடையிலான அளவு உறவை மாற்ற வகுப்பியை இழுத்துச் செல்லலாம்:
uk: Дільник можна перетягувати, щоб змінити співвідношення розмірів між обома дочірніми елементами:
zh_hant: 你可以拖曳分隔線來調整兩個子控制項的尺寸比例：

source: PanelContainer
ru: PanelContainer (Панельный контейнер)

source: A container that draws a *StyleBox*, then expands children to cover its whole area (via :ref:`PanelContainer <class_PanelContainer>`, respecting the *StyleBox* margins). It respects both the horizontal and vertical sizing options.
ga: Coimeádán a tharraingíonn *StyleBox*, ansin leathnaítear leanaí chun a limistéar iomlán a chlúdach (trí :ref:`PanelContainer <class_PanelContainer>`, ag tabhairt urraim do na corrlaigh *StyleBox*). Tá meas aige ar na roghanna méide cothrománacha agus ingearacha araon.
it: Un contenitore che disegna uno *StyleBox*, poi espande i figli per coprire la sua intera area (tramite :ref:`PanelContainer <class_PanelContainer>`, rispettando i margini dello *StyleBox*). Rispetta sia le opzioni di dimensionamento orizzontale sia verticale.
ru: Контейнер, который отображает *StyleBox*, а затем расширяет дочерние элементы, чтобы покрыть всю его область (через :ref:`PanelContainer <class_PanelContainer>`, с учетом полей *StyleBox*). Он учитывает как горизонтальные, так и вертикальные размеры.
ta: ஒரு *ச்டைல் பாக்ச் *ஐ ஈர்க்கும் ஒரு கொள்கலன், பின்னர் குழந்தைகளை அதன் முழுப் பகுதியையும் மறைக்க விரிவுபடுத்துகிறது (வழியாக: குறிப்பு: `பேனல் கான்டெய்னர் <class_panelcontainer>`, *ச்டைல் பாக்ச் *விளிம்புகளை மதிக்கிறது). இது கிடைமட்ட மற்றும் செங்குத்து அளவு விருப்பங்களை மதிக்கிறது.
uk: Контейнер, який малює *StyleBox*, а потім розгортає дочірні елементи, щоб охопити всю його область (через :ref:`PanelContainer <class_PanelContainer>`, дотримуючись полів *StyleBox*). Він поважає як горизонтальні, так і вертикальні параметри розміру.
zh_hant: 這個容器會繪製 *StyleBox*，並將子節點擴展覆蓋整個區域（通過 :ref:`PanelContainer <class_PanelContainer>`，會考慮 *StyleBox* 邊距）。同時支援水平與垂直尺寸選項。

source: This container is useful as a top-level control, or just to add custom backgrounds to sections of a layout.
it: Questo contenitore è utile come controllo di primo livello, o semplicemente per aggiungere sfondi personalizzati alle sezioni di un layout.
ru: Этот контейнер полезен в качестве элемента управления верхнего уровня или просто для добавления пользовательских фонов к разделам макета.
zh_hant: 這個容器適合用作頂層容器，也很適合為佈局區塊新增自訂背景。

source: FoldableContainer
ru: FoldableContainer (Складной контейнер)

source: A container that can be expanded/collapsed (via :ref:`FoldableContainer <class_FoldableContainer>`). Child controls are hidden when it is collapsed.
it: Un contenitore che può essere espanso/compresso (tramite :ref:`FoldableContainer <class_FoldableContainer>`). I controlli figlio sono nascosti quando il contenitore è compresso.
ru: Контейнер, который можно развернуть/свернуть (через :ref:`FoldableContainer <class_FoldableContainer>`). Дочерние элементы управления скрываются при его сворачивании.
zh_hant: 可展開/收合的容器（透過 :ref:`FoldableContainer <class_FoldableContainer>`）。收合時會隱藏其子控制項。

source: ScrollContainer
ru: ScrollContainer (Контейнер для прокрутки)

source: Accepts a single child node. If the child node is bigger than the container, scrollbars will be added to allow panning the node around (via :ref:`ScrollContainer <class_ScrollContainer>`). Both vertical and horizontal size options are respected, and the behavior can be turned on or off per axis in the properties.
it: Accetta un singolo nodo figlio. Se questo nodo è più grande del contenitore, saranno aggiunte barre di scorrimento per spostare il nodo all'interno (tramite :ref:`ScrollContainer <class_ScrollContainer>`). Sono rispettate entrambe le opzioni di dimensione verticale e orizzontale e il comportamento si può attivare o disattivare per ogni asse nelle proprietà.
ru: Принимает один дочерний узел. Если дочерний узел больше контейнера, будут добавлены полосы прокрутки для панорамирования узла (через :ref:`ScrollContainer <class_ScrollContainer>`). Учитываются как вертикальные, так и горизонтальные параметры размера, и это поведение можно включить или отключить для каждой оси в свойствах.
zh_hant: 只接受一個子節點。若子節點的尺寸大於容器，會加入捲動條以便平移該節點（透過 :ref:`ScrollContainer <class_ScrollContainer>`）。垂直與水平的尺寸選項都會被遵守，且可在屬性中針對各軸向啟用或停用此行為。

source: Mouse wheel and touch drag (when touch is available) are also valid ways to pan the child control around.
ga: Is bealaí bailí iad roth luch agus tarraingt tadhaill (nuair a bhíonn teagmháil ar fáil) chun rialú an linbh a phleanáil timpeall.
it: Anche la rotellina del mouse e il trascinamento tattile (quando il tocco è disponibile) sono metodi validi per spostare il controllo figlio.
ru: Колесико мыши и сенсорное перетаскивание (если сенсорное управление доступно) также являются допустимыми способами панорамирования дочернего элемента управления.
ta: மவுச் சக்கரம் மற்றும் டச் டிராக் (தொடுதல் கிடைக்கும்போது) குழந்தை கட்டுப்பாட்டைச் சுற்றிலும் சரியான வழிகள்.
uk: Колесо миші та перетягування дотиком (якщо доступний дотик) також є дійсними способами панорамування дочірнього елемента керування.
zh_hant: 你也可以用滑鼠滾輪或觸控拖曳（若裝置支援）來移動子控制項。

source: As in the example above, one of the most common ways to use this container is together with a *VBoxContainer* as child.
ga: Mar atá sa sampla thuas, ceann de na bealaí is coitianta chun an coimeádán seo a úsáid ná mar aon len*VBoxContainer* mar leanbh.
it: Come nell'esempio precedente, uno dei modi più comuni per utilizzare questo contenitore è insieme a un *VBoxContainer* come figlio.
ru: Как и в примере выше, один из наиболее распространенных способов использования этого контейнера — совместно с *VBoxContainer* в качестве дочернего элемента.
ta: மேலே உள்ள எடுத்துக்காட்டில் உள்ளதைப் போல, இந்த கொள்கலனைப் பயன்படுத்துவதற்கான பொதுவான வழிகளில் ஒன்று * VBOXCONTAINER * உடன் குழந்தையாக உள்ளது.
uk: Як у наведеному вище прикладі, один із найпоширеніших способів використання цього контейнера — разом із *VBoxContainer* як дочірнім.
zh_hant: 如上例所示，這個容器最常見的用法，是配合 *VBoxContainer* 作為子節點共同使用。

source: A container type that arranges its child controls in a way that preserves their proportions automatically when the container is resized. (via :ref:`AspectRatioContainer <class_AspectRatioContainer>`). It has multiple stretch modes, providing options for adjusting the child controls' sizes concerning the container: "fill," "width control height," "height control width," and "cover."
ga: Rialaíonn cineál coimeádán a shocraíonn a leanbh ar bhealach a chaomhnaíonn a chomhréireanna go huathoibríoch nuair a athraítear méid an choimeádáin. (via :ref:`AspectRatioContainer <class_AspectRatioContainer>`). Tá modhanna stráice iomadúla aige, ag soláthar roghanna chun méideanna an linbh a choigeartú maidir leis an gcoimeádán: "líonadh," "airde rialaithe leithead," "leithead rialaithe airde," agus "clúdach."
it: Un tipo di contenitore che dispone i suoi controlli figlio in modo da mantenerne automaticamente le proporzioni quando il contenitore viene ridimensionato (tramite :ref:`AspectRatioContainer <class_AspectRatioContainer>`). Ha diverse modalità di stiramento, che forniscono opzioni per regolare le dimensioni dei controlli figlio in base al contenitore: "riempi" (fill), "larghezza controlla altezza" (width control height), "larghezza controlla altezza" (height control width) e "copri" (cover).
ru: Тип контейнера, который размещает дочерние элементы управления таким образом, чтобы их пропорции автоматически сохранялись при изменении размера контейнера. (через :ref:`AspectRatioContainer <class_AspectRatioContainer>`). Он поддерживает несколько режимов растяжения, позволяющих регулировать размеры дочерних элементов управления относительно контейнера: "fill (заполнение)," "width control height (высота элемента управления шириной)," "height control width (ширина элемента управления высотой)," and "cover (покрытие)."
ta: கொள்கலன் மறுஅளவிடப்படும்போது அதன் விகிதாச்சாரத்தை தானாகவே பாதுகாக்கும் வகையில் அதன் குழந்தை கட்டுப்பாடுகளை ஏற்பாடு செய்யும் ஒரு கொள்கலன் வகை. . இது பல நீட்டிக்க முறைகளைக் கொண்டுள்ளது, கொள்கலன் தொடர்பான குழந்தை கட்டுப்பாடுகளின் அளவுகளை சரிசெய்வதற்கான விருப்பங்களை வழங்குகிறது: "நிரப்பு," "அகல கட்டுப்பாட்டு உயரம்," "உயரக் கட்டுப்பாட்டு அகலம்," மற்றும் "கவர்".
uk: Тип контейнера, який упорядковує дочірні елементи керування таким чином, що автоматично зберігає їхні пропорції під час зміни розміру контейнера. (через :ref:`AspectRatioContainer <class_AspectRatioContainer>`). Він має кілька режимів розтягування, надаючи параметри для налаштування розмірів дочірніх елементів керування щодо контейнера: «заповнення», «висота керування шириною», «ширина керування висотою» та «кришка»
zh_hant: 這是一種會在容器調整大小時，自動保持子控制項長寬比例的容器（使用 :ref:`AspectRatioContainer <class_AspectRatioContainer>`）。它具備多種伸展模式，包括「填滿」、「寬度控制高度」、「高度控制寬度」及「覆蓋」等選項，可彈性調整子控制項的尺寸

source: It is useful when you have a container that needs to be dynamic and responsive to different screen sizes, and you want the child elements to scale proportionally without losing their intended shapes.
it: Utile quando c'è bisogno di un contenitore che deve essere dinamico e reattivo alle diverse dimensioni dello schermo e si desidera che gli elementi figlio siano ridimensionati proporzionalmente senza perdere le loro forme previste.
ru: Это полезно, когда у вас есть контейнер, который должен быть динамичным и реагировать на разные размеры экрана, и вы хотите, чтобы дочерние элементы масштабировались пропорционально, не теряя при этом своих предполагаемых форм.
zh_hant: 當你需要讓容器能夠動態因應不同螢幕尺寸，並希望子元素能維持比例縮放而不失真時，這個容器很實用。

source: FlowContainer is a container that arranges its child controls either horizontally or vertically (via :ref:`HFlowContainer <class_HFlowContainer>` and via :ref:`VFlowContainer <class_VFlowContainer>`). When the available space runs out, it wraps the children to the next line or column, similar to how text wraps in a book.
it: FlowContainer è un contenitore che dispone i suoi controlli figlio orizzontalmente o verticalmente (tramite :ref:`HFlowContainer <class_HFlowContainer>` e tramite :ref:`VFlowContainer <class_VFlowContainer>`). Quando lo spazio disponibile si esaurisce, sposta i figli nella riga o colonna successiva, in modo simile a come il testo va a capo in un libro.
ru: FlowContainer — это контейнер, который размещает свои дочерние элементы управления горизонтально или вертикально (через :ref:`HFlowContainer <class_HFlowContainer>` и через :ref:`VFlowContainer <class_VFlowContainer>`). Когда доступное место заканчивается, он переносит дочерние элементы на следующую строку или столбец, подобно тому, как текст переносится в книге.
zh_hant: FlowContainer 會將子控制項依水平方向或垂直方向排列（分別為 :ref:`HFlowContainer <class_HFlowContainer>` 與 :ref:`VFlowContainer <class_VFlowContainer>`）。當可用空間不足時，會自動換行或換欄，類似文字在書本中的換行。

source: It is useful for creating flexible layouts where the child controls adjust automatically to the available space without overlapping.
it: Utile per creare layout flessibili in cui i controlli figlio si adattano automaticamente allo spazio disponibile senza sovrapporsi.
ru: Это полезно для создания гибких макетов, в которых дочерние элементы управления автоматически подстраиваются под доступное пространство, не перекрывая друг друга.
zh_hant: 這種容器適合建立彈性佈局，讓子控制項自動依可用空間調整排列，避免重疊。

source: CenterContainer is a container that automatically keeps all of its child controls centered within it at their minimum size. It ensures that the child controls are always aligned to the center, making it easier to create centered layouts without manual positioning (via :ref:`CenterContainer <class_CenterContainer>`).
it: CenterContainer è un contenitore che mantiene automaticamente tutti i suoi controlli figlio centrati al suo interno, alle loro dimensioni minime. Garantisce che i controlli figlio siano sempre allineati al centro, semplificando la creazione di layout centrati senza posizionamento manuale (tramite :ref:`CenterContainer <class_CenterContainer>`).
ru: CenterContainer — это контейнер, который автоматически центрирует все дочерние элементы управления внутри себя при их минимальном размере. Он гарантирует, что дочерние элементы управления всегда будут выровнены по центру, что упрощает создание центрированных макетов без ручного позиционирования (через :ref:`CenterContainer <class_CenterContainer>`).
zh_hant: 置中容器會自動將所有子控制項以其最小尺寸置中對齊於容器內。不需手動調整，即可輕鬆實現置中佈局（使用 :ref:`CenterContainer <class_CenterContainer>`）。
