Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: The following import options can be used to import the above font image successfully:
ga: Is féidir na roghanna iompórtála seo a leanas a úsáid chun an íomhá chló thuas a iompórtáil go rathúil:
it: Per importare correttamente l'immagine del font soprastante, è possibile utilizzare le seguenti opzioni di importazione:
ru: Для успешного импорта вышеуказанного изображения шрифта можно использовать следующие параметры импорта:
ta: மேலே உள்ள எழுத்துரு படத்தை வெற்றிகரமாக இறக்குமதி செய்ய பின்வரும் இறக்குமதி விருப்பங்கள் பயன்படுத்தப்படலாம்:
uk: Щоб успішно імпортувати наведене вище зображення шрифту, можна використати такі параметри імпорту:
zh_hant: 以下匯入選項可成功匯入上述字型圖片：

source: Import options to use for the above example font
ga: Iompórtáil roghanna le húsáid don chló sampla thuas
ru: Параметры импорта для использования в приведенном выше примере шрифта
ta: மேலே உள்ள எடுத்துக்காட்டு எழுத்துருவுக்கு பயன்படுத்த விருப்பங்களை இறக்குமதி செய்யுங்கள்
uk: Параметри імпорту для наведеного вище прикладу шрифту
zh_hant: 上述範例字型的匯入選項

source: The **Character Ranges** option is an array that maps each position on the image (in tile coordinates, not pixels). The font atlas is traversed from left to right and top to bottom. Characters can be specified with decimal numbers (``127``), hexadecimal numbers (``0x007f``) or between *single* quotes (``'~'``). Ranges can be specified with a hyphen between characters.
ga: Is éard atá sa rogha **Raonta Carachtar ** ná eagar a mhapálann gach suíomh ar an íomhá (i gcomhordanáidí tíl, ní picteilíní). Tá an t-atlas cló traversed ó chlé go deas agus ó bhun go barr. Is féidir carachtair a shonrú le huimhreacha deachúlacha (''127''), uimhreacha heicsidheachúlacha (''0x007f'') nó idir *single *quotes ('''~'''). Is féidir raonta a shonrú le fleiscín idir carachtair.
ru: Параметр **Character Ranges** представляет собой массив, который отображает каждую позицию на изображении (в координатах плитки, а не в пикселях). Атлас шрифтов просматривается слева направо и сверху вниз. Символы можно указывать десятичными числами (``127``), шестнадцатеричными числами (``0x007f``) или в *одинарных* кавычках (``'~'``). Диапазоны можно указывать с помощью дефиса между символами.
ta: ** எழுத்து வரம்புகள் ** விருப்பம் என்பது ஒவ்வொரு நிலையையும் படத்தில் வரைபடமாக்கும் ஒரு வரிசை (ஓடு ஆயத்தொகுதிகளில், படப்புள்ளிகள் அல்ல). எழுத்துரு அட்லச் இடமிருந்து வலமாக மற்றும் மேலிருந்து கீழாக பயணிக்கிறது. கதாபாத்திரங்கள் தசம எண்கள் (`` 127``), எக்சாடெசிமல் எண்கள் (`0x007f``) அல்லது * ஒற்றை * மேற்கோள்களுக்கு இடையில் (` `'~'` `) குறிப்பிடப்படலாம். கதாபாத்திரங்களுக்கு இடையில் ஒரு ஐபன் மூலம் வரம்புகளை குறிப்பிடலாம்.
uk: Параметр **Діапазон символів** — це масив, який відображає кожну позицію на зображенні (у мозаїчних координатах, а не в пікселях). Шрифтовий атлас проходить зліва направо і зверху вниз. Символи можна вказати за допомогою десяткових чисел (``127``), шістнадцяткових чисел (``0x007f``) або в *одинарних* лапках (``'~'``). Діапазони можна вказувати за допомогою дефіса між символами.
zh_hant: **字元範圍** 選項是一個陣列，對應圖片上每個字元的位置（以格子座標，不是像素）。字型圖集依左到右、上到下順序排列。字元可用十進位（``127``）、十六進位（``0x007f``）或*單引號*（``'~'``）指定，範圍可用連字號標示。

source: For instance, ``0-127`` (or ``0x0000-0x007f``) denotes the full ASCII range. As another example, ``' '-'~'`` is equivalent to ``32-127`` and denotes the range of *printable* (visible) ASCII characters.
ga: Mar shampla, seasann ''0-127'' (nó ''0x0000-0x007f'') don raon iomlán ASCII. Mar shampla eile, is ionann '''' '-'~''' agus ''32-127'' agus seasann sé do raon na gcarachtar ASCII *inphriontáilte *(infheicthe).
ru: Например, ``0-127`` (или ``0x0000-0x007f``) обозначает весь диапазон ASCII. Другой пример: ``' '-'~'``` эквивалентно ``32-127`` и обозначает диапазон *печатаемых* (видимых) символов ASCII.
ta: உதாரணமாக, `` 0-127`` (அல்லது `` 0x0000-0x007f``) முழு ASCII வரம்பைக் குறிக்கிறது. மற்றொரு எடுத்துக்காட்டு, `` ''-'`` `` `` 32-127`` க்கு சமம் மற்றும் * அச்சிடக்கூடிய * (தெரியும்) தபஅஇகு எழுத்துக்களின் வரம்பைக் குறிக்கிறது.
uk: Наприклад, ``0-127`` (або ``0x0000-0x007f``) позначає повний діапазон ASCII. Як інший приклад, ``' '-'~'`` еквівалентний ``32-127`` і позначає діапазон *друкованих* (видимих) символів ASCII.
zh_hant: 舉例來說，``0-127``（或 ``0x0000-0x007f``）代表完整 ASCII 範圍。又如，``' '-'~'`` 等同於 ``32-127``，即*可列印*（可見）ASCII 字元範圍。

source: Make sure the **Character Ranges** option doesn't exceed the number of **Columns** × **Rows** defined. Otherwise, the font will fail to import.
ga: Cinntigh nach sáraíonn an rogha **Raonta Carachtar ** líon na ** Colúin ** × ** Sraitheanna ** sainithe. Seachas sin, teipfidh ar an gcló a iompórtáil.
ru: Убедитесь, что значение параметра **Character Ranges** не превышает заданного значения **Columns (Столбцы)** × **Rows (Строки)**. В противном случае шрифт не будет импортирован.
ta: ** எழுத்து வரம்புகள் ** விருப்பம் ** நெடுவரிசைகளின் எண்ணிக்கையை விட அதிகமாக இல்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் ** × ** வரிசைகள் ** வரையறுக்கப்பட்டுள்ளது. இல்லையெனில், எழுத்துரு இறக்குமதி செய்யத் தவறும்.
uk: Переконайтеся, що параметр **Діапазон символів** не перевищує визначену кількість **Стовпців** × **Рядків**. Інакше не вдасться імпортувати шрифт.
zh_hant: 請確保 **字元範圍** 不超過定義的 **欄數 × 列數**，否則將無法匯入字型。

source: If your font image contains margins not used for font glyphs (such as attribution information), try adjusting **Image Margin**. This is a margin applied only once around the whole image.
ga: Má tá imill i d'íomhá chló nach n-úsáidtear le haghaidh glyphs cló (mar shampla faisnéis aitreabúide), déan iarracht **Imeall Íomhá ** a choigeartú. Is corrlach é seo nach gcuirtear i bhfeidhm ach uair amháin timpeall na híomhá iomláine.
ru: Если изображение шрифта содержит поля, не используемые для глифов шрифта (например, для информации об авторстве), попробуйте настроить **Image Margin**. Это поле применяется только один раз по всему изображению.
ta: உங்கள் எழுத்துரு படத்தில் எழுத்துரு கிளிஃப்களுக்கு (பண்புக்கூறு செய்தி போன்றவை) பயன்படுத்தப்படாத விளிம்புகள் இருந்தால், ** பட விளிம்பு ** ஐ சரிசெய்ய முயற்சிக்கவும். இது முழு படத்தையும் சுற்றி ஒரு முறை மட்டுமே பயன்படுத்தப்படுகிறது.
uk: Якщо ваше зображення шрифту містить поля, які не використовуються для гліфів шрифту (наприклад, інформацію про авторство), спробуйте налаштувати **Поля зображення**. Це поле, яке застосовується лише один раз навколо всього зображення.
zh_hant: 如果字型圖片周圍有不是字型圖案的空白（如作者資訊），可以調整 **圖像邊距**，這會對整張圖片一次性加上外圍邊距。

source: If your font image contains guides (in the form of lines between glyphs) or if spacing between characters appears incorrect, try adjusting **Character Margin**. This margin is applied for every imported glyph.
ga: Má tá treoracha i d'íomhá chló (i bhfoirm línte idir glyphs) nó más cosúil go bhfuil spásáil idir carachtair mícheart, déan iarracht **Imeall Carachtar ** a choigeartú. Cuirtear an corrlach seo i bhfeidhm ar gach glyph allmhairithe.
it: Se l'immagine del font contiene delle guide (sotto forma di linee tra i glifi) o se la spaziatura tra i caratteri appare errata, prova a regolare **Margine di carattere**. Questo margine è applicato per ogni glifo importato.
ru: Если изображение шрифта содержит направляющие (в виде линий между глифами) или интервалы между символами кажутся некорректными, попробуйте настроить **Character Margin**. Это поле применяется к каждому импортированному глифу.
ta: உங்கள் எழுத்துரு படத்தில் வழிகாட்டிகள் (கிளிஃப்களுக்கு இடையிலான கோடுகளின் வடிவத்தில்) அல்லது எழுத்துக்களுக்கு இடையில் இடைவெளி தவறாக தோன்றினால், ** எழுத்து விளிம்பு ** ஐ சரிசெய்ய முயற்சிக்கவும். இறக்குமதி செய்யப்பட்ட ஒவ்வொரு கிளிஃபுக்கும் இந்த விளிம்பு பயன்படுத்தப்படுகிறது.
uk: Якщо ваше зображення шрифту містить напрямні (у вигляді ліній між гліфами) або якщо інтервали між символами здаються неправильними, спробуйте налаштувати **Поля символів**. Ця маржа застосовується до кожного імпортованого гліфа.
zh_hant: 若字型圖片中有輔助線（如字元間的間隔線）或字元間距顯示不正確，可以調整 **字元邊距**，此數值會套用到每個匯入的字元。

source: If you need finer control over character spacing than what the **Character Margin** options provide, you have more options.
it: Se hai bisogno di un controllo più preciso sulla spaziatura dei caratteri rispetto a quello fornito dalle opzioni **Margine di carattere**, hai a disposizione più opzioni.
ru: Если вам требуется более точный контроль над интервалом между символами, чем тот, который предоставляют параметры **Character Margin**, у вас есть больше возможностей.
ta: ** எழுத்து விளிம்பு ** விருப்பங்கள் வழங்குவதை விட எழுத்து இடைவெளியில் உங்களுக்கு நேர்த்தியான கட்டுப்பாடு தேவைப்பட்டால், உங்களுக்கு அதிக விருப்பங்கள் உள்ளன.
zh_hant: 若你需要比 **Character Margin** 選項更細緻的字元間距控制，還有更多設定可用。

source: For one, **Character Ranges** supports 3 additional arguments after the specified range of characters. These additional arguments control their positioning and spacing. They represent space advance, X axis offset, and Y axis offset in that order. They will change the space advance and offset of each character by the amount of pixels written. Space advance is most useful if, for example, your lowercase letters are thinner than your uppercase letters.
it: Primo, **Intervalli di caratteri** supporta 3 argomenti aggiuntivi dopo l'intervallo di caratteri specificato. Questi argomenti aggiuntivi controllano il posizionamento e la spaziatura. Rappresentano l'avanzamento di spazio, lo scostamento sull'asse X e lo scostamento sull'asse Y, in quest'ordine. Modificano l'avanzamento di spazio e lo scostamento di ciascun carattere in base alla quantità di pixel scritti. L'avanzamento di spazio è particolarmente utile se, ad esempio, le lettere minuscole sono più sottili di quelle maiuscole.
ru: Например, **Character Ranges** поддерживает три дополнительных аргумента после указанного диапазона символов. Эти аргументы управляют их позиционированием и интервалами. Они представляют собой сдвиг отступа, смещение по оси X и смещение по оси Y в указанном порядке. Они изменяют сдвиг отступа и смещение каждого символа на количество записанных пикселей. Сдвиг отступа наиболее полезен, например, если строчные буквы тоньше прописных.
ta: ஒன்று, ** எழுத்து வரம்புகள் ** குறிப்பிட்ட வரம்பின் எழுத்துக்களுக்குப் பிறகு 3 கூடுதல் வாதங்களை ஆதரிக்கிறது. இந்த கூடுதல் வாதங்கள் அவற்றின் நிலைப்படுத்தல் மற்றும் இடைவெளியைக் கட்டுப்படுத்துகின்றன. அவை அந்த வரிசையில் விண்வெளி முன்கூட்டியே, ஃச் அச்சு ஆஃப்செட் மற்றும் ஒய் அச்சு ஆஃப்செட் ஆகியவற்றைக் குறிக்கின்றன. அவை எழுதப்பட்ட பிக்சல்களின் அளவால் ஒவ்வொரு கதாபாத்திரத்தின் விண்வெளி முன்கூட்டியே மற்றும் ஆஃப்செட்டையும் மாற்றும். எடுத்துக்காட்டாக, உங்கள் பெரிய எழுத்துக்கள் உங்கள் பெரிய எழுத்துக்களை விட மெல்லியதாக இருந்தால் விண்வெளி முன்கூட்டியே மிகவும் பயனுள்ளதாக இருக்கும்.
zh_hant: 其一，**Character Ranges** 在指定字元範圍後還支援 3 個額外參數，這些參數用來控制位置與間距，依序代表空白前進量（space advance）、X 軸位移與 Y 軸位移。它們會將每個字元的前進量與位移調整為所填入的像素數。當你的小寫字母比大寫字母更細時，調整前進量特別有用。

source: Diagram showing the advance and offset values being used in character ranges.
it: Diagramma che mostra i valori di avanzamento e scostamento utilizzati negli intervalli di caratteri.
ru: Диаграмма, показывающая значения смещения и опережения, используемые в диапазонах символов.
ta: எழுத்து வரம்புகளில் பயன்படுத்தப்படும் முன்கூட்டியே மற்றும் ஆஃப்செட் மதிப்புகளைக் காட்டும் வரைபடம்.
zh_hant: 示意圖：顯示在字元範圍中使用的前進量與位移值。

source: Do note that the offsets can cause your text to be cropped off the edge of your label boundaries.
it: Tieni presente che gli scostamenti possono far sì che il testo venga troncato oltre il bordo dei confini della tua etichetta.
ru: Обратите внимание, что смещения могут привести к тому, что текст будет обрезан по краям границ этикетки.
ta: ஆஃப்செட்டுகள் உங்கள் உரையை உங்கள் சிட்டை எல்லைகளின் விளிம்பில் இருந்து வெட்டக்கூடும் என்பதை நினைவில் கொள்க.
zh_hant: 請注意，位移可能會讓文字超出標籤邊界而被裁切。

source: Secondly, you can also set up **Kerning Pairs** for individual characters. Specify your kerning pair by typing two sets of characters separated by a space, then followed by another space, a number to specify how many extra/less pixels to space those two sets of characters when placed next to each other.
it: Secondo, puoi anche impostare **Coppie di crenatura** per singoli caratteri. Specifica la coppia di crenatura digitando due serie di caratteri separate da uno spazio, seguite da un altro spazio e da un numero per specificare quanti pixel in più/in meno devono essere distanziati tra le due serie di caratteri quando vengono posizionate una accanto all'altra.
ru: Во-вторых, вы также можете настроить **Kerning Pairs (пары кернинга)** для отдельных символов. Чтобы задать пару кернинга, введите два набора символов, разделённых пробелом, а затем ещё один пробел и число, указывающее, на сколько пикселей больше/меньше интервал между этими двумя наборами символов при размещении рядом.
ta: இரண்டாவதாக, தனிப்பட்ட எழுத்துக்களுக்கு ** கெர்னிங் சோடிகளையும் ** அமைக்கலாம். ஒரு இடத்தால் பிரிக்கப்பட்ட இரண்டு செட் எழுத்துக்களைத் தட்டச்சு செய்வதன் மூலம் உங்கள் கெர்னிங் சோடியைக் குறிப்பிடவும், பின்னர் மற்றொரு இடத்தைத் தொடர்ந்து, ஒருவருக்கொருவர் அடுத்ததாக வைக்கும்போது அந்த இரண்டு செட் எழுத்துக்களின் இடத்தை எத்தனை கூடுதல்/குறைவான படப்புள்ளிகள் குறிப்பிடுகின்றன என்பதைக் குறிப்பிட.
zh_hant: 其次，你也可以為個別字元設定 **Kerning Pairs**。在兩組字元之間以空白分隔來指定配對，接著再加一個空白與一個數值，用來指定當這兩組字元相鄰時應增加/減少多少像素的間距。

source: If needed, your kerning pair characters can be specified by Unicode character code by entering ``\uXXXX`` where XXXX is the hexadecimal value of the Unicode character.
it: Se necessario, è possibile specificare i caratteri della coppia di kerning tramite il codice carattere Unicode inserendo ``\uXXXX`` dove XXXX è il valore esadecimale del carattere Unicode.
ru: При необходимости символы кернинговой пары можно указать с помощью кода символа Unicode, введя ``\uXXXX``, где XXXX — шестнадцатеричное значение символа Unicode.
ta: தேவைப்பட்டால், உங்கள் கெரிங் இணை எழுத்துக்களை யூனிகோட் எழுத்து குறியீடு மூலம் `` \ uxxxx`` ஐ உள்ளிடுவதன் மூலம் குறிப்பிடலாம், அங்கு XXXX என்பது யூனிகோட் எழுத்தின் எக்சாடெசிமல் மதிப்பாகும்.
zh_hant: 如有需要，字偶配對中的字元也可用 Unicode 代碼表示，輸入 ``\uXXXX``，其中 XXXX 為該字元的 16 進位值。

source: Loading a font file
ga: Comhad clófhoirne á luchtú
it: Caricare un file di font
ru: Загрузка файла шрифта
ta: எழுத்துரு கோப்பை ஏற்றுகிறது
uk: Завантаження файлу шрифту
zh_hant: 載入字型檔案

source: To load a font file (dynamic or bitmap), use the resource dropdown's **Quick Load** or **Load** option next to a font property, then navigate to the font file in question:
ga: Chun comhad cló (dinimiciúil nó mapa giotán) a luchtú, bain úsáid as rogha **Quick Load** nó **Load** in aice le maoin chló, ansin nascleanúint a dhéanamh chuig an gcomhad cló atá i gceist:
it: Per caricare un file di font (dinamico o bitmap), utilizza l'opzione **Caricamento rapido** o **Carica** del menu a discesa delle risorse accanto a una proprietà del font, quindi andare al file di font in questione:
ru: Чтобы загрузить файл шрифта (динамический или растровый), используйте опцию **Quick Load** или **Load** в раскрывающемся списке ресурсов рядом со свойством шрифта, затем перейдите к нужному файлу шрифта:
ta: ஒரு எழுத்துரு கோப்பை (டைனமிக் அல்லது பிட்மேப்) ஏற்ற, வள டிராப் டவுனின் ** விரைவான சுமை ** அல்லது ** சுமை ** ஒரு எழுத்துரு சொத்துக்கு அடுத்ததாக விருப்பத்தைப் பயன்படுத்தவும், பின்னர் கேள்விக்குரிய எழுத்துரு கோப்பிற்கு செல்லவும்:
uk: Щоб завантажити файл шрифту (динамічний або растровий), скористайтеся параметром **Швидке завантаження** або **Завантажити** у спадному списку ресурсів поруч із властивістю шрифту, а потім перейдіть до відповідного файлу шрифту:
zh_hant: 若要載入字型檔案（動態或點陣），請在字型屬性旁邊的資源下拉選單選擇 **快速載入** 或 **載入**，然後瀏覽選取字型檔案：

source: You can also drag-and-drop a font file from the FileSystem dock to the inspector property that accepts a Font resource.
ga: Is féidir leat comhad cló a tharraingt agus a scaoileadh ó dhuga an Chórais Comhad chuig maoin an chigire a ghlacann le hacmhainn Chló.
it: È anche possibile trascinare e rilasciare un file di font dal pannello Filesystem alla proprietà dell'ispettore che accetta una risorsa Font.
ru: Вы также можете перетащить файл шрифта из дока FileSystem в свойство inspector , которое принимает ресурс Шрифта.
ta: எழுத்துரு வளத்தை ஏற்றுக்கொள்ளும் கோப்பு முறைமை கப்பல்துறையிலிருந்து இன்ச்பெக்டர் சொத்துக்கு எழுத்துரு கோப்பை இழுத்துச் செல்லலாம்.
uk: Ви також можете перетягнути файл шрифту з док-станції FileSystem до властивості інспектора, яка приймає ресурс Font.
zh_hant: 你也可以直接把字型檔案從檔案系統拖曳到屬性檢視器中需要 Font 資源的欄位。

source: In Godot 4.0 and later, texture filter and repeat properties are defined in the location where the texture is used, rather than on the texture itself. This also applies to fonts (both dynamic fonts and bitmap fonts).
ga: I Godot 4.0 agus níos déanaí, sainmhínítear airíonna scagaire uigeachta agus athuair sa suíomh ina n-úsáidtear an uigeacht, seachas ar an uigeacht féin. Baineann sé seo freisin le clónna (clónna dinimiciúla agus clónna bitmap araon).
it: In Godot 4.0 e versioni successive, le proprietà di filtro e ripetizione delle texture sono definite nel punto in cui viene utilizzata la texture, anziché sulla texture stessa. Questo vale anche per i font (sia dinamici sia bitmap).
ru: В Godot 4.0 и более поздних версиях свойства фильтра и повтора текстуры определяются в месте её использования, а не в самой текстуре. Это также относится к шрифтам (как динамическим, так и растровым).
ta: கோடோட் 4.0 மற்றும் அதற்குப் பிறகு, அமைப்பு வடிகட்டி மற்றும் மீண்டும் மீண்டும் பண்புகள் அமைப்பைக் காட்டிலும் அமைப்பு பயன்படுத்தப்படும் இடத்தில் வரையறுக்கப்படுகின்றன. இது எழுத்துருக்களுக்கும் பொருந்தும் (டைனமிக் எழுத்துருக்கள் மற்றும் பிட்மேப் எழுத்துருக்கள் இரண்டும்).
uk: У Godot 4.0 і пізніших версіях текстурний фільтр і властивості повторення визначаються в місці, де використовується текстура, а не в самій текстурі. Це також стосується шрифтів (як динамічних шрифтів, так і растрових шрифтів).
zh_hant: Godot 4.0 起，紋理過濾與重複屬性都是在使用紋理的地方設定，而非紋理資源本身。字型（動態與點陣）也採同樣設計。

source: Fonts that have a pixel art appearance should have bilinear filtering disabled by changing the **Rendering > Textures > Canvas Textures > Default Texture Filter** project setting to **Nearest**.
ga: Ba cheart go mbeadh an scagadh délíneach díchumasaithe ag clónna a bhfuil cuma ealaíne picteilín orthu tríd an socrú tionscadail **Rindreáil > Uigeachtaí > Uigeachtaí Canbhás > Scagaire Uigeachta Réamhshocraithe** a athrú go **Is gaire**.
it: Per i font che hanno un aspetto pixel art, si dovrebbe disattivare il filtro bilineare cambiando l'impostazione del progetto **Rendering > Texture > Texture canvas > Filtro predefinito di texture** su **Nearest**.
ru: Для шрифтов, имеющих вид пиксельной графики, следует отключить билинейную фильтрацию, изменив настройку проекта **Rendering > Textures > Canvas Textures > Default Texture Filter** на **Nearest (Ближайший)**.
ta: படப்புள்ளி கலை தோற்றத்தைக் கொண்ட எழுத்துருக்கள் ** ரெண்டரிங்> கட்டமைப்புகள்> கேன்வாச் கட்டமைப்புகள்> இயல்புநிலை அமைப்பு வடிகட்டி ** திட்ட அமைப்பு ** அருகிலுள்ள ** ஐ மாற்றுவதன் மூலம் பிலினியர் வடிகட்டுதல் முடக்கப்பட வேண்டும்.
uk: Шрифти, які мають вигляд піксельного мистецтва, мають вимкнути білінійну фільтрацію, змінивши параметр проекту **Відтворення > Текстури > Текстури полотна > Фільтр текстури за замовчуванням** на **Найближчий**.
zh_hant: 若你的字型是像素風格（Pixel Art），應該把 **算圖 > 紋理 > Canvas 紋理 > 預設紋理過濾** 專案設定調成 **最近點**，以停用雙線性過濾。

source: The font size must also be an integer multiple of the design size (which varies on a per-font basis), and the Control node using the font must be scaled by an integer multiple as well. Otherwise, the font may look blurry. Font sizes in Godot are specified in pixels (px), not points (pt). Keep this in mind when comparing font sizes across different software.
ga: Ní mór an clómhéid a bheith ina slánuimhir iolraí de mhéid an dearaidh (a athraíonn ar bhonn in aghaidh an chló), agus ní mór an nód Rialaithe ag baint úsáide as an gcló a scála ag iolraí slánuimhir chomh maith. Seachas sin, d'fhéadfadh cuma doiléir a bheith ar an gcló. Sonraítear méideanna cló i Godot i bpicteilíní (px), ní pointí (pt). Coinnigh é seo i gcuimhne nuair a dhéantar comparáid idir méideanna cló ar fud bogearraí éagsúla.
ru: Размер шрифта также должен быть целым числом, кратным размеру дизайна (который варьируется для каждого шрифта), а узел управления, использующий шрифт, также должен быть масштабирован целым числом. В противном случае шрифт может выглядеть размытым. Размеры шрифтов в Godot указываются в пикселях (px), а не в пунктах (pt). Имейте это в виду при сравнении размеров шрифтов в разных программах.
ta: எழுத்துரு அளவு வடிவமைப்பு அளவின் முழு எண்ணாக இருக்க வேண்டும் (இது ஒவ்வொரு-பெர்-ஃபோன்ட் அடிப்படையில் மாறுபடும்), மற்றும் எழுத்துருவைப் பயன்படுத்தும் கட்டுப்பாட்டு முனை ஒரு முழு எண் பலவற்றால் அளவிடப்பட வேண்டும். இல்லையெனில், எழுத்துரு மங்கலாகத் தோன்றலாம். கோடோட்டில் உள்ள எழுத்துரு அளவுகள் பிக்சல்களில் (பிஎக்ச்) குறிப்பிடப்பட்டுள்ளன, புள்ளிகள் அல்ல (பி.டி). வெவ்வேறு மென்பொருள்களில் எழுத்துரு அளவுகளை ஒப்பிடும்போது இதை நினைவில் கொள்ளுங்கள்.
uk: Розмір шрифту також має бути цілим кратним розміру дизайну (який змінюється залежно від шрифту), а контрольний вузол, який використовує шрифт, також має бути масштабований цілим кратним. Інакше шрифт може виглядати розмитим. Розмір шрифту в Godot вказується в пікселях (px), а не в точках (pt). Пам’ятайте про це, порівнюючи розмір шрифту в різних програмах.
zh_hant: 字型大小應為設計尺寸的整數倍（視字型而定），且使用該字型的 Control 節點也要用整數倍縮放，否則字型可能會模糊。Godot 的字型大小單位是像素（px），不是點（pt），請在跨軟體比對時特別注意。

source: The texture filter mode can also be set on individual nodes that inherit from CanvasItem by setting :ref:`CanvasItem.texture_filter <class_CanvasItem_property_texture_filter>`.
ga: Is féidir modh an scagaire uigeachta a shocrú freisin ar nóid aonair a fhaigheann oidhreacht ó CanvasItem trí :ref:`CanvasItem.texture_filter <class_CanvasItem_property_texture_filter>` a shocrú.
it: È possibile impostare la modalità di filtro delle texture anche su singoli nodi che ereditano da CanvasItem impostando :ref:`CanvasItem.texture_filter <class_CanvasItem_property_texture_filter>`.
ru: Режим фильтра текстур также можно установить для отдельных узлов, наследующих от CanvasItem, установив :ref:`CanvasItem.texture_filter <class_CanvasItem_property_texture_filter>`.
ta: அமைப்பு வடிகட்டி பயன்முறையை அமைப்பதன் மூலம் கேன்வாசிட்டெமிலிருந்து பெறும் தனிப்பட்ட முனைகளிலும் அமைக்கப்படலாம்: குறிப்பு: `canvasitem.texture_filter <class_canvasitem_property_texture_filter>`.
uk: Режим текстурного фільтра також можна встановити на окремих вузлах, які успадковують від CanvasItem, встановивши :ref:`CanvasItem.texture_filter <class_CanvasItem_property_texture_filter>`.
zh_hant: 你也可以在繼承自 CanvasItem 的節點上，設定 :ref:`CanvasItem.texture_filter <class_CanvasItem_property_texture_filter>` 來個別調整紋理過濾模式。

source: Font outlines and shadows
ga: Breac-chuntas cló agus scáthanna
it: Contorni e ombre dei font
ru: Контуры и тени шрифта
ta: எழுத்துரு கோடிட்டுக் காட்டுகிறது மற்றும் நிழல்கள்
uk: Контури і тіні шрифту
zh_hant: 字型描邊與陰影
