Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_skinning.po
Languages: ga, it, pt_br, ru, ta, uk, zh_tw

source: Naturally, themes are an ideal type of resource for storing configuration for something visual. While the support for theming is built into control nodes, other nodes can use them as well, just like any other resource.
ga: Ar ndóigh, is cineál iontach acmhainne iad téamaí chun cumraíocht a stóráil le haghaidh rud éigin amhairc. Cé go bhfuil an tacaíocht do theming tógtha i nóid rialaithe, is féidir le nóid eile iad a úsáid chomh maith, díreach cosúil le haon acmhainn eile.
it: Naturalmente, i temi sono una risorsa ideale per memorizzare la configurazione di qualcosa di visivo. Sebbene il supporto per i temi sia integrato nei nodi di controllo, anche altri nodi possono utilizzarli, proprio come qualsiasi altra risorsa.
pt_br: Naturalmente, os temas são um tipo ideal de recurso para armazenar a configuração de algo visual. Embora o suporte para temas seja incorporado aos nós de controle, outros nós também podem usá-los, como qualquer outro recurso.
ru: Разумеется, темы — идеальный тип ресурса для хранения конфигурации чего-либо визуального. Хотя поддержка тем встроена в узлы управления, другие узлы также могут использовать их, как и любой другой ресурс.
ta: இயற்கையாகவே, கருப்பொருள்கள் காட்சிக்கு உள்ளமைவை சேமிப்பதற்கான சிறந்த வகை வளமாகும். கருப்பொருளுக்கான உதவி கட்டுப்பாட்டு முனைகளாக கட்டமைக்கப்பட்டிருந்தாலும், மற்ற முனைகளும் வேறு எந்த வளத்தையும் போலவே அவற்றைப் பயன்படுத்தலாம்.
uk: Звичайно, теми є ідеальним типом ресурсу для зберігання конфігурації чогось візуального. Хоча підтримка тематизації вбудована в контрольні вузли, інші вузли також можуть використовувати їх, як і будь-який інший ресурс.
zh_tw: 主題本身就是用來儲存視覺化設定的理想資源。雖然只有控制項節點內建支援主題，但其他節點也可以像使用其他資源一樣來引用主題。

source: An example of using themes for something beyond controls can be a modulation of sprites for the same units on different teams in a strategy game. A theme resource can define a collection of colors, and sprites (with a help from scripts) can use those colors to draw the texture. The main benefit being that you could make different themes using the same theme items for red, blue, and green teams, and swap them with a single resource change.
ga: Is féidir le sampla de théamaí a úsáid le haghaidh rud éigin níos faide ná rialuithe a bheith ina mhodhnú sprites do na haonaid chéanna ar fhoirne éagsúla i gcluiche straitéise. Is féidir le hacmhainn téama bailiúchán dathanna a shainiú, agus is féidir le sprites (le cabhair ó scripteanna) na dathanna sin a úsáid chun an uigeacht a tharraingt. Is é an buntáiste is mó ná go bhféadfá téamaí éagsúla a dhéanamh ag baint úsáide as na míreanna téama céanna d'fhoirne dearga, gorma agus glasa, agus iad a mhalartú le hathrú acmhainní amháin.
pt_br: Um exemplo de uso de temas para algo além do controle pode ser uma modulação de sprites para as mesmas unidades em times diferentes em um jogo de estratégia. Um recurso de tema pode definir uma coleção de cores e sprites (com a ajuda de scripts) podem usar essas cores para desenhar a textura. O principal benefício é que você pode criar temas diferentes usando os mesmos itens de tema para as equipes vermelha, azul e verde e trocá-los com uma única alteração de recurso.
ru: Примером использования тем для чего-то помимо управления может быть модуляция спрайтов для одних и тех же юнитов в разных командах в стратегической игре. Ресурс темы может определить коллекцию цветов, а спрайты (с помощью скриптов) могут использовать эти цвета для рисования текстуры. Главное преимущество заключается в том, что вы можете создавать разные темы, используя одни и те же элементы темы для красной, синей и зеленой команд, и менять их местами одним изменением ресурса.
ta: கட்டுப்பாடுகளுக்கு அப்பாற்பட்ட ஏதோவொன்றுக்கு கருப்பொருள்களைப் பயன்படுத்துவதற்கான எடுத்துக்காட்டு, ஒரு மூலோபாய விளையாட்டில் வெவ்வேறு அணிகளில் ஒரே அலகுகளுக்கு உருவங்களின் பண்பேற்றம். ஒரு கருப்பொருள் சான்று வண்ணங்களின் தொகுப்பை வரையறுக்க முடியும், மேலும் உருவங்கள் (ச்கிரிப்ட்களின் உதவியுடன்) அந்த வண்ணங்களைப் பயன்படுத்தி அமைப்பை வரையலாம். சிவப்பு, நீலம் மற்றும் பச்சை குழுக்களுக்கு ஒரே கருப்பொருள் உருப்படிகளைப் பயன்படுத்தி வெவ்வேறு கருப்பொருள்களை உருவாக்கி, அவற்றை ஒரு வள மாற்றத்துடன் மாற்றலாம் என்பதே முக்கிய நன்மை.
uk: Прикладом використання тем для чогось поза контролем може бути модуляція спрайтів для тих самих підрозділів у різних командах у стратегічній грі. Ресурс теми може визначати набір кольорів, а спрайти (за допомогою сценаріїв) можуть використовувати ці кольори для малювання текстури. Основна перевага полягає в тому, що ви можете створювати різні теми, використовуючи однакові елементи теми для червоних, синіх і зелених команд, і міняти їх місцями за допомогою однієї зміни ресурсу.
zh_tw: 主題也能應用在控制項以外的場景。例如策略遊戲中，相同單位在不同隊伍時需要不同的顏色顯示，就能用主題資源來定義一組顏色，並透過腳本讓精靈（Sprite）根據主題項目改變顏色繪製貼圖。這樣就能用同一組主題項目，製作紅隊、藍隊、綠隊等不同主題，僅需替換主題資源即可輕鬆切換。

source: You can also define your own theme types, and additionally customize both built-in controls and your own controls. Because built-in controls have no knowledge of your custom theme types, you must utilize scripts to access those items. All control nodes have several methods that allow to fetch theme items from the theme that is applied to them. Those methods accept the theme type as one of the arguments.
uk: Ви також можете визначити власні типи тем і додатково налаштувати як вбудовані, так і власні елементи керування. Оскільки вбудовані елементи керування не знають про ваші користувацькі типи тем, ви повинні використовувати сценарії для доступу до цих елементів. Усі контрольні вузли мають кілька методів, які дозволяють отримати елементи теми з теми, яка до них застосована. Ці методи приймають тип теми як один із аргументів.
