Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: The engine automatically uses system fonts as fallback fonts, which makes it possible to display CJK characters and emoji without having to load a custom font. There are some restrictions that apply though, as mentioned in the :ref:`Using emoji <doc_using_fonts_emoji>` section.
ga: Úsáideann an t-inneall clónna córais go huathoibríoch mar chlónna cúltaca, rud a fhágann gur féidir carachtair CJK agus emoji a thaispeáint gan cló saincheaptha a luchtú. Tá roinnt srianta i bhfeidhm, áfach, mar atá luaite sa roinn :ref:`Ag baint úsáide as emoji <doc_using_fonts_emoji>`.
it: Il motore utilizza automaticamente i font di sistema come font di riserva, il che rende possibile visualizzare i caratteri CJK e gli emoji senza dover caricare un font personalizzato. Esistono tuttavia alcune restrizioni, come indicato nella sezione :ref:`Usare gli emoji <doc_using_fonts_emoji>`.
ru: Движок автоматически использует системные шрифты в качестве резервных, что позволяет отображать символы CJK и эмодзи без необходимости загрузки пользовательского шрифта. Однако существуют некоторые ограничения, упомянутые в разделе :ref:`Использование эмодзи <doc_using_fonts_emoji>`.
ta: எஞ்சின் தானாகவே கணினி எழுத்துருக்களை குறைவடையும் எழுத்துருக்களாகப் பயன்படுத்துகிறது, இது தனிப்பயன் எழுத்துருவை ஏற்றாமல் சி.சே.கே எழுத்துக்கள் மற்றும் ஈமோசிகளைக் காண்பிப்பதை சாத்தியமாக்குகிறது. குறிப்பிடப்பட்டுள்ளபடி: ref: `ஈமோசி <doc_using_fonts_emoji>` பிரிவு ஆகியவற்றைப் பயன்படுத்துதல்.
uk: Механізм автоматично використовує системні шрифти як резервні шрифти, що дає змогу відображати символи CJK і емодзі без необхідності завантажувати спеціальний шрифт. Однак існують певні обмеження, як зазначено в розділі :ref:`Використання emoji <doc_using_fonts_emoji>`.
zh_hant: 引擎會自動用系統字型做為後備字型，這樣不需額外字型也能顯示 CJK 字元與 Emoji。但如 :ref:`表情符號支援 <doc_using_fonts_emoji>` 所述，有些限制。

source: Create a :ref:`class_SystemFont` resource in the location where you desire to use the system font:
ga: Cruthaigh acmhainn a:ref: `Class_SystemFont` sa suíomh inar mian leat cló an chórais a úsáid:
it: Creare una risorsa :ref:`class_SystemFont` nel posto in cui si desidera utilizzare il font di sistema:
ru: Создайте ресурс :ref:`class_SystemFont` в том месте, где вы хотите использовать системный шрифт:
ta: ஒரு: ref: கணினி எழுத்துருவைப் பயன்படுத்த நீங்கள் விரும்பும் இடத்தில் `class_systemfont` வளத்தை உருவாக்கவும்:
uk: Створіть ресурс :ref:`class_SystemFont` у місці, де ви бажаєте використовувати системний шрифт:
zh_hant: 在你要用系統字型的地方建立 :ref:`class_SystemFont` 資源：

source: Creating a SystemFont resource
ga: Acmhainn SystemFont a chruthú
it: Creare una risorsa SystemFont
ru: Создание ресурса SystemFont
ta: கணினி ஃபோன்ட் வளத்தை உருவாக்குதல்
uk: Створення ресурсу SystemFont
zh_hant: 建立 SystemFont 資源

source: Specifying a font name to use in a SystemFont resource
ga: Ainm cló a shonrú le húsáid in acmhainn SystemFont
it: Specificare un nome di font da utilizzare in una risorsa SystemFont
ru: Указание имени шрифта для использования в ресурсе SystemFont
ta: கணினி ஃபோன்ட் வளத்தில் பயன்படுத்த எழுத்துரு பெயரைக் குறிப்பிடுகிறது
uk: Визначення назви шрифту для використання в ресурсі SystemFont
zh_hant: 在 SystemFont 資源中指定字型名稱

source: You can either specify one or more font names explicitly (such as ``Arial``), or specify the name of a font *alias* that maps to a "standard" default font for the system:
ga: Is féidir leat ainm cló amháin nó níos mó a shonrú go sainráite (mar shampla ``Arial``), nó ainm cló*alias* a shonrú a shonrú go cló réamhshocraithe “caighdeánach” don chóras:
it: È possibile specificare esplicitamente uno o più nomi di font (ad esempio ``Arial``) oppure specificare il nome di un *alias* di font che corrisponde a un font predefinito "standard" per il sistema:
ru: Вы можете либо явно указать одно или несколько названий шрифтов (например, ``Arial``), либо указать имя *псевдонима* шрифта, который соответствует "стандартному" шрифту по умолчанию для системы:
ta: நீங்கள் ஒன்று அல்லது அதற்கு மேற்பட்ட எழுத்துரு பெயர்களை வெளிப்படையாகக் குறிப்பிடலாம் (`` அரியல்`` போன்றவை), அல்லது கணினிக்கான "நிலையான" இயல்புநிலை எழுத்துருவுக்கு வரைபடமாக ஒரு எழுத்துரு * மாற்றுப்பெயர் * இன் பெயரைக் குறிப்பிடலாம்:
uk: Ви можете або явно вказати одне або кілька назв шрифтів (наприклад, ``Arial``), або вказати назву *псевдоніма* шрифту, який відповідає «стандартному» шрифту за замовчуванням для системи:
zh_hant: 你可以明確指定一或多個字型名稱（如 ``Arial``），或指定*別名*，以對應系統的「標準」預設字型：

source: Font alias
ga: Cló alias
it: Alias del font
ru: Псевдоним шрифта
ta: எழுத்துரு மாற்றுப்பெயர்
uk: Псевдонім шрифту
zh_hant: 字型別名

source: Windows
ga: Fuinneoga
ta: சாளரங்கள்

source: Linux
ta: லினக்ச்

source: Android
ta: ஆண்ட்ராய்டு

source: ``sans-serif``
ta: `` சான்ச்-செரிஃப் ''

source: Arial
ta: ஏரியல்

source: Helvetica
ga: Eilvética
ta: எல்வெடிகா

source: *Handled by fontconfig*
ga: * Láimhseáilte ag fontconfig*
it: *Gestito da fontconfig*
ru: *Обрабатывается fontconfig*
ta: *FontConfig ஆல் கையாளப்படுகிறது*
uk: *Обробляється fontconfig*
zh_hant: *由 fontconfig 管理*

source: Roboto / Noto Sans
ga: Robot/Noto Sans
ta: ரோபோட்டோ / நோட்டோ இல்லாமல்

source: ``serif``
ta: `` செரிஃப்``

source: Times New Roman
ta: டைம்ச் நியூ ரோமன்

source: Times
ga: Aimre
ta: பெருக்கல்

source: Noto Serif
ga: Not Serif
ta: நோட்டோ செரிஃப்

source: ``monospace``
ta: `` மோனோச்பேச்``

source: Courier New
ga: Courier Nua
ta: கூரியர் புதியது

source: Courier
ga: Cúiréir
ta: கூரியர்

source: Droid Sans Mono
ta: டிரயோடு சான்ச் மோனோ

source: ``cursive``
ta: `` கர்சீவ்``

source: Comic Sans MS
ta: காமிக் சான்ச் எம்.எச்

source: Apple Chancery
ga: Seansaí Apple
ta: ஆப்பிள் சான்சரி

source: Dancing Script
ga: Script Damhsa
ru: Dancing Script (Сценарий танца)
ta: நடனம் ச்கிரிப்ட்

source: ``fantasy``
ga: ``Fantais``
ta: `` பேண்டசி``

source: Gabriola
ta: கேப்ரியோலா

source: Papyrus
ga: Papirus
ta: பாப்பிரச்

source: On Android, Roboto is used for Latin/Cyrillic text and Noto Sans is used for other languages' glyphs such as CJK. On third-party Android distributions, the exact font selection may differ.
ga: Ar Android, úsáidtear Roboto le haghaidh téacs Laidine/Coireallach agus úsáidtear Noto Sans le haghaidh glyphs teangacha eile ar nós CJK. Maidir le dáiltí tríú páirtí Android, d'fhéadfadh go mbeadh difríocht idir an rogha cló cruinn.
it: Su Android, Roboto è utilizzato per i testi in latino/cirillico e Noto Sans per i glifi di altre lingue, come il CJK. Nelle distribuzioni Android di terze parti, la selezione esatta del font potrebbe differire.
ru: На Android шрифт Roboto используется для латинского/кирилловского текста, а Noto Sans — для глифов других языков, например, CJK. В сторонних дистрибутивах Android точный выбор шрифтов может отличаться.
ta: ஆண்ட்ராய்டில், ரோபோடோ லத்தீன்/சிரிலிக் உரைக்கு பயன்படுத்தப்படுகிறது மற்றும் சி.சே.கே போன்ற பிற மொழிகளின் கிளிஃப்களுக்கு நோட்டோ சான்ச் பயன்படுத்தப்படுகிறது. மூன்றாம் தரப்பு ஆண்ட்ராய்டு விநியோகங்களில், சரியான எழுத்துரு தேர்வு வேறுபடலாம்.
uk: На Android Roboto використовується для тексту латиницею/кирилицею, а Noto Sans використовується для гліфів інших мов, наприклад CJK. У сторонніх дистрибутивах Android точний вибір шрифту може відрізнятися.
zh_hant: Android 上拉丁文／西里爾文預設用 Roboto，其它語系（如 CJK）用 Noto Sans。第三方 Android 系統可能選擇不同字型。

source: If specifying more than one font, the first font that is found on the system will be used (from top to bottom). Font names and aliases are case-insensitive on all platforms.
ga: Má shonrófar níos mó ná cló amháin, úsáidfear an chéad chló a fhaightear ar an gcóras (ón mbarr go bun). Tá ainmneacha cló agus ainmneacha neamh-íogair ar gach ardán.
it: Se si specifica più di un font, sarà utilizzato il primo font trovato nel sistema (dall'alto verso il basso). I nomi dei font e gli alias non distinguono tra maiuscole e minuscole su tutte le piattaforme.
ru: Если указано более одного шрифта, будет использован первый найденный в системе шрифт (сверху вниз). Названия шрифтов и псевдонимы регистронезависимы на всех платформах.
ta: ஒன்றுக்கு மேற்பட்ட எழுத்துருக்களைக் குறிப்பிடினால், கணினியில் காணப்படும் முதல் எழுத்துரு பயன்படுத்தப்படும் (மேலிருந்து கீழாக). எழுத்துரு பெயர்கள் மற்றும் மாற்றுப்பெயர்கள் அனைத்து தளங்களிலும் வழக்கு-உணர்வற்றவை.
uk: Якщо вказано більше одного шрифту, буде використано перший шрифт, знайдений у системі (зверху вниз). Назви шрифтів і псевдоніми нечутливі до регістру на всіх платформах.
zh_hant: 若指定多個字型，系統會依序優先使用最先找到的。字型名稱與別名在所有平台都不分大小寫。

source: Like for font variations, you can save the SystemFont arrangement to a resource file to reuse it in other places.
ga: Cosúil le hathruithe cló, is féidir leat socrú SystemFont a shábháil i gcomhad acmhainní chun é a athúsáid in áiteanna eile.
it: Come per le variazioni dei font, è possibile salvare la disposizione SystemFont in un file di risorsa per riutilizzarla altrove.
ru: Как и в случае с вариациями шрифтов, вы можете сохранить расположение SystemFont в файле ресурсов, чтобы использовать его в других местах.
ta: எழுத்துரு மாறுபாடுகளைப் போலவே, கணினி ஃபோன்ட் ஏற்பாட்டை மற்ற இடங்களில் மீண்டும் பயன்படுத்த ஒரு வள கோப்பில் சேமிக்க முடியும்.
uk: Як і варіанти шрифтів, ви можете зберегти розташування SystemFont у файлі ресурсів, щоб використовувати його в інших місцях.
zh_hant: 如同字型變體，你也可以把 SystemFont 設定存成資源檔重複利用。

source: Remember that different system fonts have different metrics, which means that text that can fit within a rectangle on one platform may not be doing so on another platform. Always reserve some additional space during development so that labels can extend further if needed.
ga: Cuimhnigh go bhfuil méadracht dhifriúil ag clónna córais éagsúla, rud a chiallaíonn go bhféadfadh sé nach bhfuil téacs a d’fhéadfadh a bheith suite laistigh de dhronuilleog ar ardán amháin ag déanamh amhlaidh ar ardán eile. Cuir spás breise in áirithe i gcónaí le linn na forbartha ionas gur féidir le lipéid leathnú níos faide más gá.
it: Ricorda che i diversi font di sistema hanno metriche diverse, il che significa che un testo si potrebbe adattare in un rettangolo su una piattaforma, ma potrebbe non esserne in grado su un'altra. Riserva sempre spazio aggiuntivo durante lo sviluppo in modo che le etichette si possano estendere ulteriormente, se necessario.
ru: Помните, что разные системные шрифты имеют разные метрики, а это значит, что текст, помещающийся в прямоугольник на одной платформе, может не помещаться в него на другой. Всегда резервируйте дополнительное пространство при разработке, чтобы надписи могли расширяться при необходимости.
ta: வெவ்வேறு கணினி எழுத்துருக்களில் வெவ்வேறு அளவீடுகள் உள்ளன என்பதை நினைவில் கொள்ளுங்கள், அதாவது ஒரு மேடையில் ஒரு செவ்வகத்திற்குள் பொருந்தக்கூடிய உரை மற்றொரு மேடையில் அவ்வாறு செய்யாமல் இருக்கலாம். வளர்ச்சியின் போது எப்போதும் சில கூடுதல் இடத்தை முன்பதிவு செய்யுங்கள், இதனால் தேவைப்பட்டால் லேபிள்கள் மேலும் நீட்டிக்க முடியும்.
uk: Пам’ятайте, що різні системні шрифти мають різні показники, а це означає, що текст, який може поміститися в межах прямокутника на одній платформі, може не поміститися на іншій платформі. Завжди резервуйте додатковий простір під час розробки, щоб за потреби можна було розширити мітки.
zh_hant: 請注意，不同系統字型的排版寬度不一，同樣內容在不同平台可能會超出原本的矩形空間，開發時務必預留餘裕。

source: Unlike Windows and macOS/iOS, the set of default fonts shipped on Linux depends on the distribution. This means that on different Linux distributions, different fonts may be displayed for a given system font name or alias.
ga: Murab ionann agus Windows agus MacOS/iOS, braitheann an tacar clónna réamhshocraithe a sheoltar ar Linux ar an dáileadh. Ciallaíonn sé seo go bhféadfar clónna éagsúla a thaispeáint ar dháileadh Linux éagsúla d'ainm cló córais nó ainm ar leith.
it: A differenza di Windows e macOS/iOS, l'insieme di font predefiniti fornito su Linux dipende dalla distribuzione. Ciò significa che su diverse distribuzioni Linux potrebbero essere visualizzati font diversi per un determinato nome o alias di font di sistema.
ru: В отличие от Windows и macOS/iOS, набор шрифтов по умолчанию в Linux зависит от дистрибутива. Это означает, что в разных дистрибутивах Linux для одного и того же имени или псевдонима системного шрифта могут отображаться разные шрифты.
ta: சாளரங்கள் மற்றும் மேகோச்/iOS ஐப் போலன்றி, லினக்சில் அனுப்பப்பட்ட இயல்புநிலை எழுத்துருக்களின் தொகுப்பு விநியோகத்தைப் பொறுத்தது. இதன் பொருள் வெவ்வேறு லினக்ச் விநியோகங்களில், கொடுக்கப்பட்ட கணினி எழுத்துரு பெயர் அல்லது மாற்றுப்பெயருக்கு வெவ்வேறு எழுத்துருக்கள் காட்டப்படலாம்.
uk: На відміну від Windows і macOS/iOS, набір стандартних шрифтів, що постачаються в Linux, залежить від дистрибутива. Це означає, що в різних дистрибутивах Linux різні шрифти можуть відображатися для певної назви або псевдоніма системного шрифту.
zh_hant: 與 Windows、macOS/iOS 不同，Linux 的預設字型取決於發行版。因此同一字型名稱或別名在不同 Linux 可能顯示不同字型。

source: It is also possible to load fonts at runtime even if they aren't installed on the system. See :ref:`Runtime loading and saving <doc_runtime_file_loading_and_saving_fonts>` for details.
ga: Is féidir clónna a luchtú ag am rite fiú mura bhfuil siad suiteáilte ar an gcóras. Féach :ref:`Am rite ag luchtú agus ag sábháil <doc_runtime_file_loading_and_saving_fonts>` le haghaidh sonraí.
it: È anche possibile caricare i font in fase di esecuzione, anche se non sono installati sul sistema. Consultare :ref:`Caricamento e salvataggio in fase di esecuzione <doc_runtime_file_loading_and_saving_fonts>` per i dettagli.
ru: Шрифты также можно загружать во время выполнения, даже если они не установлены в системе. Подробнее см. в разделе :ref:`Загрузка и сохранение во время выполнения <doc_runtime_file_loading_and_saving_fonts>`.
ta: எழுத்துருக்களை கணினியில் நிறுவாவிட்டாலும் கூட இயக்க நேரத்தில் ஏற்றவும் முடியும். காண்க: குறிப்பு: விவரங்களுக்கு `இயக்க நேர ஏற்றுதல்
uk: Також можна завантажувати шрифти під час виконання, навіть якщо вони не встановлені в системі. Дивіться :ref:`Завантаження та збереження під час виконання <doc_runtime_file_loading_and_saving_fonts>` для деталей.
zh_hant: 即使系統未安裝字型，也可在執行時載入自訂字型。詳見 :ref:`執行時載入與儲存 <doc_runtime_file_loading_and_saving_fonts>`。

source: Font prerendering
ga: Réamhghníomhú cló
it: Prerendering di font
ru: Предварительная визуализация шрифтов
ta: எழுத்துரு முன்கூட்டியே
uk: Попереднє відтворення шрифтів
zh_hant: 字型預先算繪

source: When using traditional rasterized fonts, Godot caches glyphs on a per-font and per-size basis. This reduces stuttering, but it can still occur the first time a glyph is displayed when running the project. This can be especially noticeable at higher font sizes or on mobile devices.
ga: Nuair a bhíonn clónna traidisiúnta rasterized á n-úsáid, déanann Godot glyphs a thaisceadh ar bhonn in aghaidh an chló agus in aghaidh an mhéid. Laghdaíonn sé seo stuttering, ach is féidir leis tarlú fós an chéad uair a thaispeánfar glyph agus an tionscadal á reáchtáil. Is féidir é seo a thabhairt faoi deara go háirithe ag clómhéideanna níos airde nó ar ghléasanna soghluaiste.
it: Quando si utilizzano font rasterizzati tradizionali, Godot memorizza nella cache i glifi per ogni font e per ogni dimensione. Questo riduce il problema dello stuttering, il che può verificarsi comunque la prima volta che un glifo viene visualizzato durante l'esecuzione del progetto. Ciò può essere particolarmente evidente con font di dimensioni maggiori o su dispositivi mobili.
ru: При использовании традиционных растровых шрифтов Godot кэширует глифы для каждого шрифта и каждого размера. Это уменьшает подтормаживание, но оно всё ещё может возникать при первом отображении глифа при запуске проекта. Это особенно заметно при использовании шрифтов больших размеров или на мобильных устройствах.
ta: பாரம்பரிய ராச்டரைச் செய்யப்பட்ட எழுத்துருக்களைப் பயன்படுத்தும் போது, கோடோட் கிளிஃப்களை ஒரு முன் மற்றும் ஒரு அளவிலான அடிப்படையில் தற்காலிகமாக சேமிக்கிறது. இது தடுமாற்றத்தைக் குறைக்கிறது, ஆனால் திட்டத்தை இயக்கும் போது ஒரு கிளிஃப் காண்பிக்கப்படும் முதல் முறையாக இது நிகழலாம். இது அதிக எழுத்துரு அளவுகளில் அல்லது மொபைல் சாதனங்களில் குறிப்பாக கவனிக்கப்படலாம்.
uk: При використанні традиційних растеризованих шрифтів Godot кешує гліфи для кожного шрифту та розміру. Це зменшує заїкання, але воно може виникнути під час першого відображення гліфа під час запуску проекту. Це може бути особливо помітно на більших розмірах шрифту або на мобільних пристроях.
zh_hant: 使用傳統光柵化字型時，Godot 會依字型與大小快取字元，減少卡頓。不過專案執行時首次顯示新字元仍可能卡，特別是大字型或行動裝置。

source: When using MSDF fonts, they only need to be rasterized once to a special signed distance field texture. This means caching can be done purely on a per-font basis, without taking the font size into consideration. However, the initial rendering of MSDF fonts is slower compared to a traditional rasterized font at a medium size.
ga: Agus clónna MSDF á úsáid agat, ní gá iad a rasterú ach uair amháin go uigeacht réimse achair shínithe speisialta. Ciallaíonn sé seo gur féidir caching a dhéanamh ar bhonn in aghaidh an chló amháin, gan an méid cló a chur san áireamh. Mar sin féin, tá rindreáil tosaigh clónna MSDF níos moille i gcomparáid le cló rasterized traidisiúnta ag méid meánmhéid.
ru: При использовании шрифтов MSDF их достаточно растеризовать только один раз в специальную текстуру поля расстояний со знаком. Это означает, что кэширование может выполняться исключительно для каждого шрифта, без учёта его размера. Однако первоначальная отрисовка шрифтов MSDF при среднем размере шрифта происходит медленнее, чем при использовании традиционного растеризованного шрифта.
ta: MSDF எழுத்துருக்களைப் பயன்படுத்தும் போது, அவை ஒரு முறை மட்டுமே ஒரு சிறப்பு கையொப்பமிடப்பட்ட தூர புல அமைப்புக்கு மட்டுமே வர வேண்டும். இதன் பொருள் எழுத்துரு அளவை கருத்தில் கொள்ளாமல், ஒரு முழுமையான அடிப்படையில் கேச்சிங் செய்ய முடியும். இருப்பினும், எம்.எச்.டி.எஃப் எழுத்துருக்களின் ஆரம்ப வழங்குதல் நடுத்தர அளவில் ஒரு பாரம்பரிய ராச்டரைச் எழுத்துருவுடன் ஒப்பிடும்போது மெதுவாக உள்ளது.
uk: У разі використання шрифтів MSDF їх потрібно лише один раз растеризувати до спеціальної текстури поля відстані зі знаком. Це означає, що кешування може здійснюватися лише для кожного окремого шрифту, не беручи до уваги розмір шрифту. Однак початкове відтворення шрифтів MSDF відбувається повільніше порівняно з традиційним растеризованим шрифтом середнього розміру.
zh_hant: MSDF 字型只需光柵化一次生成特殊距離場貼圖，因此快取是以字型為單位，跟字型大小無關。但 MSDF 首次算圖速度比中等大小的傳統光柵字型慢。

source: To avoid stuttering issues related to font rendering, it is possible to *prerender* certain glyphs. This can be done for all glyphs you intend to use (for optimal results), or only for common glyphs that are most likely to appear during gameplay (to reduce file size). Glyphs that aren't pre-rendered will be rasterized on-the-fly as usual.
ga: Chun saincheisteanna stuttering a bhaineann le rindreáil cló a sheachaint, is féidir glyphs áirithe a réamhtheann*. Is féidir é seo a dhéanamh do gach glyphs atá ar intinn agat a úsáid (chun na torthaí is fearr a fháil), nó ach amháin le haghaidh glyphs coitianta is dóichí a bheidh le feiceáil le linn gameplay (chun méid an chomhaid a laghdú). Déanfar glyphs nach ndéantar réamh-rindreáil a rasterú ar an eitilt mar is gnách.
ru: Чтобы избежать проблем с задержками, связанных с отображением шрифтов, можно выполнить *предварительный рендеринг* некоторых глифов. Это можно сделать для всех глифов, которые вы планируете использовать (для достижения оптимальных результатов), или только для часто встречающихся глифов, которые чаще всего появляются в игре (для уменьшения размера файла). Глифы, которые не были предварительно отрисованы, будут растеризованы "на лету", как обычно.
ta: எழுத்துரு வழங்குதல் தொடர்பான சிக்கல்களைத் தடுக்கும் சிக்கல்களைத் தவிர்க்க, சில கிளிஃப்களை * முன்கூட்டியே * செய்ய முடியும். நீங்கள் பயன்படுத்த விரும்பும் அனைத்து கிளிஃப்களுக்கும் (உகந்த முடிவுகளுக்கு) இதைச் செய்யலாம், அல்லது விளையாட்டின் போது (கோப்பு அளவைக் குறைக்க) தோன்றக்கூடிய பொதுவான கிளிஃப்களுக்கு மட்டுமே. முன்பே வழங்கப்படாத கிளிஃப்கள் வழக்கம் போல் பறக்கும்போது ராச்டரைச் செய்யப்படும்.
uk: Щоб уникнути проблем із заїканням, пов’язаних із відтворенням шрифтів, можна *попередньо відобразити* певні гліфи. Це можна зробити для всіх гліфів, які ви збираєтеся використовувати (для отримання оптимальних результатів), або лише для звичайних гліфів, які найімовірніше з’являться під час гри (щоб зменшити розмір файлу). Гліфи, які не були попередньо відрендерені, будуть растеризовані на льоту, як зазвичай.
zh_hant: 為避免字型顯示時卡頓，你可以*預先算繪*常用字元。可以全部都算繪（效果最佳），也可以只挑常見字元（壓縮資源體積）。沒預先算繪的字元還是會即時光柵化。

source: In both cases (traditional and MSDF), font rasterization is done on the CPU. This means that the GPU performance doesn't affect how long it takes for fonts to be rasterized.
ga: Sa dá chás (traidisiúnta agus MSDF), déantar rasterú cló ar an LAP. Ciallaíonn sé seo nach ndéanann feidhmíocht an GPU difear don fhad a thógann sé clónna a rastrú.
ru: В обоих случаях (традиционном и MSDF) растеризация шрифтов выполняется на центральном процессоре. Это означает, что производительность графического процессора не влияет на время растеризации шрифтов.
ta: இரண்டு நிகழ்வுகளிலும் (பாரம்பரிய மற்றும் எம்.எச்.டி.எஃப்), எழுத்துரு ராச்டரைசேசன் சிபியு இல் செய்யப்படுகிறது. இதன் பொருள், எழுத்துருக்கள் ராச்டரைச் செய்ய எவ்வளவு நேரம் ஆகும் என்று சி.பீ.யூ செயல்திறன் பாதிக்காது.
uk: В обох випадках (традиційному та MSDF) растеризація шрифту виконується на ЦП. Це означає, що продуктивність GPU не впливає на тривалість растеризації шрифтів.
zh_hant: 無論傳統還是 MSDF，字型光柵化都在 CPU 執行，與 GPU 效能無關。

source: Move to the **Pre-render Configurations** tab of the Advanced Import Settings dialog, then add a configuration by clicking the "plus" symbol:
ga: Bog go dtí an cluais**Cumraíochtaí Réamh-rindreála** den dialóg Ard-Socruithe Allmhairithe, ansin cuir cumraíocht leis trí chliceáil ar an tsiombail “móide”:
ru: Перейдите на вкладку **Pre-render Configurations** диалогового окна "Дополнительные параметры импорта", затем добавьте конфигурацию, нажав на символ "плюс":
ta: மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலின் ** முன்-மறுசீரமைப்பு உள்ளமைவுகள் ** தாவலுக்கு நகர்த்தவும், பின்னர் "பிளச்" சின்னத்தைக் சொடுக்கு செய்வதன் மூலம் ஒரு உள்ளமைவைச் சேர்க்கவும்:
uk: Перейдіть на вкладку **Конфігурації попередньої візуалізації** діалогового вікна «Додаткові параметри імпорту», а потім додайте конфігурацію, натиснувши символ «плюс»:
zh_hant: 在進階匯入設定切到 **預先算繪組態** 分頁，按「＋」新增組態：

source: Adding a new prerendering configuration in the Advanced Import Settings dialog
ga: Cumraíocht réamhghníomhaíochta nua a chur leis sa dialóg Ard-Socruithe Allmhairithe
ru: Добавление новой конфигурации предварительной визуализации в диалоговом окне "Дополнительные параметры импорта"
ta: மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலில் புதிய முன்கூட்டியே உள்ளமைவைச் சேர்ப்பது
uk: Додавання нової конфігурації попереднього відтворення в діалоговому вікні «Додаткові параметри імпорту»
zh_hant: 在進階匯入設定新增預先算繪組態

source: After adding a configuration, make sure it is selected by clicking its name once. You can also rename the configuration by double-clicking it.
es: Después de agregar una configuración, asegúrate de que esté seleccionada haciendo clic en su nombre. También puedes cambiarle el nombre haciendo doble clic.
ga: Tar éis cumraíocht a chur leis, déan cinnte go roghnaítear é trí chliceáil ar a ainm uair amháin. Is féidir leat an chumraíocht a athainmniú freisin trí chliceáil faoi dhó air.
ru: После добавления конфигурации убедитесь, что она выбрана, щёлкнув по её имени один раз. Вы также можете переименовать конфигурацию, дважды щёлкнув по ней.
ta: ஒரு உள்ளமைவைச் சேர்த்த பிறகு, அதன் பெயரை ஒரு முறை சொடுக்கு செய்வதன் மூலம் அது தேர்ந்தெடுக்கப்பட்டதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். உள்ளமைவை இருமுறை சொடுக்கு செய்வதன் மூலம் மறுபெயரிடலாம்.
uk: Після додавання конфігурації переконайтеся, що її вибрано, клацнувши її назву один раз. Ви також можете перейменувати конфігурацію, двічі клацнувши її.
zh_hant: 新增後請點一下組態名稱以選取。可雙擊重新命名。
