Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_skinning.po
Languages: ga, it, pt_br, ru, ta, uk, zh_tw

source: Different controls will apply StyleBoxes in a different manner. Most notably, ``focus`` styleboxes are drawn as an *overlay* to other styleboxes (such as ``normal`` or ``pressed``) to allow the base stylebox to remain visible. This means the focus stylebox should be designed as an outline or translucent box, so that its background can remain visible.
it: Controlli diversi applicheranno gli StyleBox diversamente. In particolare, gli stylebox ``focus`` sono disegnati come una *sovrapposizione* ad altri stylebox (come ``normal`` o ``pressed``) per consentire allo stylebox di base di rimanere visibile. Ciò significa che lo stylebox di focus si dovrebbe progettare come un riquadro con contorno o semitrasparente, in modo che il suo sfondo rimanga visibile.
ru: Различные элементы управления применяют элементы StyleBox по-разному. В частности, элементы StyleBox ``focus`` отображаются как *наложение* на другие элементы StyleBox (например, ``normal`` или ``pressed``), чтобы базовый элемент StyleBox оставался видимым. Это означает, что элемент StyleBox фокуса должен быть оформлен как контур или полупрозрачный блок, чтобы его фон оставался видимым.
ta: வெவ்வேறு கட்டுப்பாடுகள் பாணி பாக்சை வேறு முறையில் பயன்படுத்தும். மிக முக்கியமாக, அடிப்படை பாணி பாக்சைக் காண அனுமதிக்க மற்ற பாணி பாக்சுக்கு (`` இயல்பான`` அல்லது `அழுத்தப்பட்ட`` போன்றவை)` `ஃபோகச்`` ச்டைல்பாக்ச்கள் * மேலடுக்கு * ஆக வரையப்படுகின்றன. இதன் பொருள் கவனம் பாணி பாக்ச் ஒரு அவுட்லைன் அல்லது கசியும் பெட்டியாக வடிவமைக்கப்பட வேண்டும், இதனால் அதன் பின்னணி தெரியும்.
zh_tw: 不同控制項會以不同方式套用 StyleBox。特別的是，``focus`` StyleBox 會被繪製為其他 StyleBox（例如 ``normal`` 或 ``pressed``）的*覆蓋層*，以便基礎 StyleBox 仍可見。因此，focus StyleBox 應設計為描邊或半透明樣式，讓底層背景能被保留。

source: Theme types
ga: Cineálacha téama
pt_br: Tipos de temas
ru: Типы тем
ta: கருப்பொருள் வகைகள்
uk: Типи тем
zh_tw: 主題型別

source: To help with the organization of its items each theme is separated into types, and each item must belong to a single type. In other words, each theme item is defined by its name, its data type and its theme type. This combination must be unique within the theme. For example, there cannot be two color items named ``font_color`` in a type called ``Label``, but there can be another ``font_color`` item in a type ``LineEdit``.
ga: Chun cabhrú le heagrú a chuid earraí tá gach téama scartha i gcineálacha, agus caithfidh gach mír a bheith le cineál amháin. Is é sin le rá, sainmhínítear gach mír téama de réir a ainm, a chineál sonraí agus a chineál téama. Caithfidh an teaglaim seo a bheith uathúil laistigh den téama. Mar shampla, ní féidir dhá mhír datha darb ainm `font_color`` a bheith ann i gcineál ar a dtugtar ``Label``, ach is féidir mír `font_color`` eile a bheith ann i gcineál ``lineEdit``.
it: Per facilitare l'organizzazione dei suoi elementi, ogni tema è suddiviso in tipi e ogni elemento deve appartenere a un singolo tipo. In altre parole, ogni elemento del tema è definito dal suo nome, dal suo tipo di dati e dal suo tipo di tema. Questa combinazione deve essere univoca all'interno del tema. Ad esempio, non possono esserci due elementi di colore denominati ``font_color`` in un tipo denominato ``Label``, ma può esserci un altro elemento ``font_color`` in un tipo ``LineEdit``.
ru: Для упрощения организации элементов каждая тема разделена на типы, каждый из которых должен принадлежать к одному типу. Другими словами, каждый элемент темы определяется своим именем, типом данных и типом темы. Эта комбинация должна быть уникальной в пределах темы. Например, в типе ``Label`` не может быть двух элементов цвета с именем ``font_color``, но в типе ``LineEdit`` может быть другой элемент ``font_color``.
ta: அதன் உருப்படிகளின் அமைப்புக்கு உதவ ஒவ்வொரு கருப்பொருளும் வகைகளாக பிரிக்கப்படுகின்றன, மேலும் ஒவ்வொரு உருப்படியும் ஒரு வகையைச் சேர்ந்தவை. வேறு வார்த்தைகளில் கூறுவதானால், ஒவ்வொரு கருப்பொருள் உருப்படியும் அதன் பெயர், அதன் தரவு வகை மற்றும் அதன் கருப்பொருள் வகை ஆகியவற்றால் வரையறுக்கப்படுகிறது. இந்த கலவையானது கருப்பொருளுக்குள் தனித்துவமாக இருக்க வேண்டும். எடுத்துக்காட்டாக, `` லேபிள்`` என்று அழைக்கப்படும் ஒரு வகையில் `` font_color`` என்ற இரண்டு வண்ண உருப்படிகள் இருக்க முடியாது, ஆனால் ஒரு வகை `` linededit`` `` font_color`` உருப்படி இருக்க முடியும்.
uk: Щоб допомогти з організацією елементів, кожну тему розділено на типи, і кожен елемент має належати до одного типу. Іншими словами, кожен елемент теми визначається своїм іменем, типом даних і типом теми. Ця комбінація має бути унікальною в межах теми. Наприклад, не може бути двох елементів кольору з назвою ``font_color`` у типі під назвою ``Label``, але може бути інший ``font_color`` елемент у типі ``LineEdit``.
zh_tw: 為了方便組織管理，各主題會依型別區分，每個項目只能屬於一個型別。換句話說，每個主題項目都由名稱、資料型別與主題型別三者共同決定，這組合在同個主題內必須唯一。例如，``Label`` 型別下不能有兩個叫 ``font_color`` 的顏色項目，但 ``LineEdit`` 型別下則可有另一個 ``font_color`` 項目。

source: The default Godot theme comes with multiple theme types already defined, one for every built-in control node that uses UI skinning. The example above contains actual theme items present in the default theme. You can refer to the **Theme Properties** section in the class reference for each control to see which items are available to it and its child classes.
ga: Tagann an téama réamhshocraithe Godot le cineálacha éagsúla téama atá sainmhínithe cheana féin, ceann do gach nód rialaithe ionsuite a úsáideann craiceann UI. Tá míreanna téama iarbhír sa sampla thuas atá i láthair sa téama réamhshocraithe. Is féidir leat tagairt a dhéanamh don rannát**Airíonna Téama** sa tagairt ranga le haghaidh gach rialú chun a fheiceáil cé na míreanna atá ar fáil dó agus dá ranganna leanaí.
it: Il tema predefinito di Godot include diversi tipi di tema già definiti, uno per ogni nodo di controllo integrato che utilizza UI skinning. L'esempio precedente contiene elementi del tema effettivamente presenti nel tema predefinito. È possibile fare riferimento alla sezione **Proprietà del tema** nel riferimento alla classe di ciascun controllo per vedere quali elementi sono disponibili per esso e per le sue classi figlio.
ru: Тема Godot по умолчанию содержит несколько типов тем, по одному для каждого встроенного узла элемента управления, использующего скины пользовательского интерфейса. В примере выше представлены реальные элементы темы, присутствующие в теме по умолчанию. Вы можете обратиться к разделу **Theme Properties** в справочнике классов для каждого элемента управления, чтобы узнать, какие элементы доступны для него и его дочерних классов.
ta: இயல்புநிலை கோடோட் கருப்பொருள் ஏற்கனவே வரையறுக்கப்பட்ட பல கருப்பொருள் வகைகளுடன் வருகிறது, இது இடைமுகம் ச்கின்னிங்கைப் பயன்படுத்தும் ஒவ்வொரு உள்ளமைக்கப்பட்ட கட்டுப்பாட்டு முனைக்கும் ஒன்று. மேலே உள்ள எடுத்துக்காட்டில் இயல்புநிலை கருப்பொருளில் இருக்கும் உண்மையான கருப்பொருள் உருப்படிகள் உள்ளன. ஒவ்வொரு கட்டுப்பாட்டிற்கும் வகுப்பு குறிப்பில் ** கருப்பொருள் பண்புகள் ** பகுதியை நீங்கள் குறிப்பிடலாம், அதற்கு எந்த உருப்படிகள் உள்ளன மற்றும் அதன் குழந்தை வகுப்புகள் உள்ளன.
uk: Тема Godot за замовчуванням постачається з декількома вже визначеними типами тем, по одному для кожного вбудованого вузла керування, який використовує оболонку інтерфейсу користувача. Наведений вище приклад містить фактичні елементи теми, присутні в темі за замовчуванням. Ви можете звернутися до розділу **Властивості теми** в довідці про клас для кожного елемента керування, щоб побачити, які елементи доступні для нього та його дочірніх класів.
zh_tw: Godot 的預設主題已經定義了多種主題型別，對應所有支援 UI 換膚的內建控制項節點。上面範例中提到的，就是預設主題實際存在的項目。你可以查閱各控制項的類別參考文件中的「主題屬性」章節，了解哪些項目可用於該類別及其子類別。

source: Child classes can use theme items defined for their parent class (``Button`` and its derivatives being a good example of that). In fact, every control can use every theme item of any theme type, if it needs to (but for the clarity and predictability we try to avoid that in the engine).
ga: Is féidir le ranganna leanaí míreanna téama a shainmhínítear dá rang tuismitheoirí a úsáid (“Cnaipe” agus is sampla maith de sin iad a dhíorthaigh). Déanta na fírinne, is féidir le gach rialú gach mír téama d'aon chineál téama a úsáid, más gá dó (ach ar mhaithe le soiléireacht agus intuartha déanaimid iarracht é sin a sheachaint san inneall).
it: Le classi figlie possono utilizzare gli elementi del tema definiti per la classe padre (``Button`` e i suoi derivati ne sono un buon esempio). Infatti, ogni controllo può utilizzare qualsiasi elemento del tema di qualsiasi tipo, se necessario (ma per chiarezza e prevedibilità cerchiamo di evitarlo nel motore).
ru: Дочерние классы могут использовать элементы темы, определённые для родительского класса (например, ``Button`` и его производные). Фактически, каждый элемент управления может использовать любой элемент темы любого типа, если это необходимо (но для ясности и предсказуемости мы стараемся избегать этого в движке).
ta: குழந்தை வகுப்புகள் தங்கள் பெற்றோர் வகுப்பிற்கு வரையறுக்கப்பட்ட கருப்பொருள் உருப்படிகளைப் பயன்படுத்தலாம் (`` பொத்தான்`` மற்றும் அதன் வழித்தோன்றல்கள் அதற்கு ஒரு சிறந்த எடுத்துக்காட்டு). உண்மையில், ஒவ்வொரு கட்டுப்பாடும் எந்தவொரு கருப்பொருள் வகையின் ஒவ்வொரு கருப்பொருள் உருப்படியையும் தேவைப்பட்டால் பயன்படுத்தலாம் (ஆனால் தெளிவு மற்றும் முன்கணிப்புக்கு இயந்திரத்தில் அதைத் தவிர்க்க முயற்சிக்கிறோம்).
uk: Дочірні класи можуть використовувати елементи теми, визначені для їх батьківського класу (``Button`` та його похідні є гарним прикладом цього). Фактично, кожен елемент керування може використовувати кожен елемент теми будь-якого типу теми, якщо це необхідно (але для ясності та передбачуваності ми намагаємося уникати цього в движку).
zh_tw: 子類別可以使用父類別定義的主題項目（例如 ``Button`` 及其衍生類別）。其實每個控制項理論上都能使用任何型別下的主題項目（但為了清晰性與可預測性，引擎實作上會盡量避免這樣做）。

source: It is important to remember that for child classes that process is automated. Whenever a built-in control requests a theme item from the theme it can omit the theme type, and its class name will be used instead. On top of that, the class names of its parent classes will also be used in turn. This allows changes to the parent class, such as ``Button``, to affect all derived classes without the need to customize every one of them.
ga: Tá sé tábhachtach cuimhneamh go bhfuil an próiseas sin uathoibrithe i gcás ranganna leanaí. Aon uair a iarrann rialú ionsuite mír téama ón téama féadfaidh sé an cineál téama a fhágáil, agus úsáidfear a ainm ranga ina ionad. Ar a bharr sin, úsáidfear ainmneacha ranga a thuismitheoireachtaí ina dhiaidh sin freisin. Ligeann sé seo athruithe ar an rang tuismitheora, mar shampla ``Cnaipe ``, tionchar a imirt ar gach rang díorthaithe gan gá gach ceann acu a shaincheapadh.
it: È importante ricordare che per le classi figlio questo processo è automatizzato. Ogni volta che un controllo integrato richiede un elemento del tema, può omettere il tipo di tema e sarà utilizzato il nome della sua classe. Inoltre, saranno utilizzati a loro volta anche i nomi delle classi padre. Questo consente alle modifiche apportate alla classe padre, come ``Button``, di influire su tutte le classi derivate senza doverle personalizzare singolarmente.
ru: Важно помнить, что для дочерних классов этот процесс автоматизирован. Всякий раз, когда встроенный элемент управления запрашивает элемент темы, он может опустить тип темы, и вместо него будет использовано имя его класса. Кроме того, в свою очередь будут использоваться имена классов его родительских классов. Это позволяет изменять родительский класс, например ``Button``, чтобы повлиять на все производные классы без необходимости настраивать каждый из них.
ta: குழந்தை வகுப்புகளுக்கு அந்த செயல்முறை தானியங்கி என்பதை நினைவில் கொள்வது தேவை. ஒரு உள்ளமைக்கப்பட்ட கட்டுப்பாடு கருப்பொருளிலிருந்து ஒரு கருப்பொருள் உருப்படியைக் கோரும்போதெல்லாம் அது கருப்பொருள் வகையைத் தவிர்க்கலாம், அதற்கு பதிலாக அதன் வகுப்பு பெயர் பயன்படுத்தப்படும். அதற்கு மேல், அதன் பெற்றோர் வகுப்புகளின் வர்க்கப் பெயர்களும் பயன்படுத்தப்படும். `` பொத்தான்`` போன்ற பெற்றோர் வகுப்பில் மாற்றங்களை இது அனுமதிக்கிறது, அவை ஒவ்வொன்றையும் தனிப்பயனாக்க வேண்டிய அவசியமின்றி பெறப்பட்ட அனைத்து வகுப்புகளையும் பாதிக்க.
uk: Важливо пам'ятати, що для дитячих класів цей процес автоматизований. Кожного разу, коли вбудований елемент керування запитує елемент теми з теми, він може пропустити тип теми, а замість цього буде використано назву її класу. Крім того, імена класів батьківських класів також будуть використовуватися по черзі. Це дозволяє змінам батьківського класу, наприклад ``Button``, впливати на всі похідні класи без необхідності налаштовувати кожен з них.
zh_tw: 要注意，對子類別來說這個流程是自動化的。當內建控制項向主題請求主題項目時，可以省略主題型別，會直接使用其類別名稱，接著也會依序查找其父類別名稱。這樣一來，像修改 ``Button`` 父類別的主題項目，就能影響所有衍生類別，而無須一一調整。

source: You can also define your own theme types, and additionally customize both built-in controls and your own controls. Because built-in controls have no knowledge of your custom theme types, you must utilize scripts to access those items. All control nodes have several methods that allow you to fetch theme items from the theme that is applied to them. Those methods accept the theme type as one of the arguments.
ru: Вы также можете определить собственные типы тем и дополнительно настроить как встроенные, так и ваши собственные элементы управления. Поскольку встроенные элементы управления не имеют информации о ваших пользовательских типах тем, для доступа к ним необходимо использовать скрипты. Все узлы элементов управления имеют несколько методов, позволяющих извлекать элементы темы из примененной к ним темы. Эти методы принимают тип темы в качестве одного из аргументов.
ta: உங்கள் சொந்த கருப்பொருள் வகைகளையும் நீங்கள் வரையறுக்கலாம், மேலும் உள்ளமைக்கப்பட்ட கட்டுப்பாடுகள் மற்றும் உங்கள் சொந்த கட்டுப்பாடுகள் இரண்டையும் தனிப்பயனாக்கலாம். உள்ளமைக்கப்பட்ட கட்டுப்பாடுகளுக்கு உங்கள் தனிப்பயன் கருப்பொருள் வகைகளைப் பற்றி எந்த அறிவும் இல்லாததால், அந்த உருப்படிகளை அணுக ச்கிரிப்ட்களைப் பயன்படுத்த வேண்டும். எல்லா கட்டுப்பாட்டு முனைகளிலும் பல முறைகள் உள்ளன, அவை கருப்பொருள் உருப்படிகளை அவற்றுக்குப் பயன்படுத்தப்படும் கருப்பொருளிலிருந்து பெற உங்களை அனுமதிக்கின்றன. அந்த முறைகள் கருப்பொருள் வகையை வாதங்களில் ஒன்றாக ஏற்றுக்கொள்கின்றன.
zh_tw: 你也能自訂主題型別，進一步自訂內建控制項或你自己的控制項。不過，內建控制項不會自動識別你的自訂主題型別，因此你必須透過腳本來存取這些項目。所有控制項節點都有多種方法可從當前主題中取得主題項目，這些方法都能接受主題型別作為參數。

source: To give more customization opportunities types can also be linked together as type variations. This is another use-case for custom theme types. For example, a theme can contain a type ``Header`` which can be marked as a variation of the base ``Label`` type. An individual ``Label`` control can then be set to use the ``Header`` variation for its type, and every time a theme item is requested from a theme this variation will be used before any other type. This allows to store various presets of theme items for the same class of the control node in the single ``Theme`` resource.
ga: Chun níos mó deiseanna saincheaptha a thabhairt is féidir cineálacha a nascadh le chéile mar athruithe cineálacha. Is cás úsáide eile é seo do chineálacha téama saincheaptha. Mar shampla, is féidir cineál ``Ceannair`` a bheith i dtéama ar féidir a mharcáil mar athrú ar an gcineál bonn ``Lipéad``. Is féidir rialú aonair ``Lipéad` a shocrú ansin chun an t-athrú ``Ceannair`` a úsáid dá chineál, agus gach uair a iarrtar mír téama ó théama úsáidfear an t-athrú seo roimh aon chineál eile. Ligeann sé seo réamhshocruithe éagsúla d'earraí téama a stóráil don aicme céanna den nód rialaithe san acmhainn `Téama' aonair.
ru: Чтобы предоставить больше возможностей для настройки, типы можно также соединять вместе в виде вариантов типов. Это еще один случай использования пользовательских типов тем. Например, тема может содержать тип ``Header``, который может быть отмечен как вариация базового типа ``Label``. Затем отдельный элемент управления ``Label`` можно настроить на использование вариации ``Header`` для своего типа, и каждый раз, когда элемент темы запрашивается из темы, эта вариация будет использоваться перед любым другим типом. Это позволяет хранить различные предустановки элементов темы для одного и того же класса узла управления в одном ресурсе ``Theme``.
ta: மேலும் தனிப்பயனாக்குதல் வாய்ப்புகள் வகைகளை வழங்கவும் வகை மாறுபாடுகளாகவும் இணைக்கப்படலாம். தனிப்பயன் கருப்பொருள் வகைகளுக்கான மற்றொரு பயன்பாட்டு வழக்கு இது. எடுத்துக்காட்டாக, ஒரு கருப்பொருள் `` தலைப்பு`` வகையை கொண்டிருக்கலாம், இது `` லேபிள்` வகை வகையின் மாறுபாடாக குறிக்கப்படலாம். ஒரு தனிநபர் `` லேபிள்`` கட்டுப்பாட்டை அதன் வகைக்கு `` தலைப்பு` `மாறுபாட்டைப் பயன்படுத்த அமைக்கலாம், மேலும் ஒவ்வொரு முறையும் ஒரு கருப்பொருளிலிருந்து ஒரு கருப்பொருள் உருப்படி கோரப்படும்போது இந்த மாறுபாடு வேறு எந்த வகையிலும் பயன்படுத்தப்படும். கட்டுப்பாட்டு முனையின் ஒரே வகுப்பிற்கு கருப்பொருள் உருப்படிகளின் பல்வேறு முன்னமைவுகளை ஒற்றை `` தீம்`` வளத்தில் சேமிக்க இது அனுமதிக்கிறது.
uk: Щоб надати більше можливостей для налаштування, типи також можна пов’язувати разом як варіанти типу. Це ще один варіант використання користувацьких типів тем. Наприклад, тема може містити тип ``Заголовок``, який можна позначити як варіацію базового типу ``Мітка``. Окремий елемент керування ``Label`` можна налаштувати на використання варіанту ``Header`` для свого типу, і кожного разу, коли елемент теми запитується з теми, цей варіант використовуватиметься перед будь-яким іншим типом. Це дозволяє зберігати різні попередні налаштування елементів теми для одного класу вузла керування в одному ресурсі ``Тема``.
zh_tw: 為了提供更多自訂彈性，型別之間也能設計成變種。這是自訂主題型別的另一個應用，例如主題中可以有個 ``Header`` 型別，標記為 ``Label`` 基礎型別的變種。個別 ``Label`` 控制項就可以指定型別為 ``Header``，之後每次請求主題項目時，會優先使用這個變種。這樣就能在同一個 ``Theme`` 資源中，為同一類型的控制項儲存不同的主題項目預設值。

source: Only variations available from the default theme or defined in the custom project theme are shown in the Inspector dock as options. You can still input manually the name of a variation that is defined outside of those two places, but it is recommended to keep all variations to the project theme.
ga: Ní thaispeántar ach na hathruithe atá ar fáil ón téama réamhshocraithe nó a shainmhínítear sa téama saincheaptha tionscadail i nduga an Cigire Is féidir leat ainm athraithe atá sainmhínithe lasmuigh den dá áit sin a ionchur de láimh fós, ach moltar gach athrú a choinneáil ar théama an tionscadail.
it: Solo le variazioni disponibili nel tema predefinito o definite nel tema personalizzato del progetto sono visualizzate come opzioni nel pannello Ispettore. È comunque possibile inserire manualmente il nome di una variazione definita fuori queste due posizioni, ma si consiglia di mantenere tutte le variazioni nel tema del progetto.
ru: В качестве вариантов в панели инспектора отображаются только вариации, доступные в теме по умолчанию или определенные в пользовательской теме проекта. Вы по-прежнему можете вручную ввести название вариации, определенной вне этих двух мест, но рекомендуется сохранять все вариации в теме проекта.
ta: இயல்புநிலை கருப்பொருளிலிருந்து கிடைக்கும் அல்லது தனிப்பயன் திட்ட கருப்பொருளில் வரையறுக்கப்பட்ட மாறுபாடுகள் மட்டுமே இன்ச்பெக்டர் கப்பல்துறையில் விருப்பங்களாக காட்டப்பட்டுள்ளன. அந்த இரண்டு இடங்களுக்கு வெளியே வரையறுக்கப்பட்ட ஒரு மாறுபாட்டின் பெயரை நீங்கள் கைமுறையாக உள்ளிடலாம், ஆனால் அனைத்து மாறுபாடுகளையும் திட்ட கருப்பொருளில் வைத்திருக்க பரிந்துரைக்கப்படுகிறது.
uk: Лише варіації, доступні в темі за замовчуванням або визначені в користувальницькій темі проекту, відображаються на панелі «Інспектор» як параметри. Ви все ще можете вручну ввести назву варіанту, який визначено поза цими двома місцями, але рекомендується зберегти всі варіанти в темі проекту.
zh_tw: 只有預設主題或自訂專案主題中的變種，會在屬性檢視器裡顯示為可選項。你仍可手動輸入其他地方定義的變種名稱，但建議所有變種都統一放在專案主題中。

source: You can learn more about creating and using theme type variations in a :ref:`dedicated article <doc_gui_theme_type_variations>`.
ga: Is féidir leat níos mó a fhoghlaim faoi éagsúlachtaí cineál téama a chruthú agus a úsáid in :ref:`alt tiomnaithe <doc_gui_theme_type_variations>`.
ru: Подробнее о создании и использовании вариаций типов тем можно узнать в :ref:`специальной статье <doc_gui_theme_type_variations>`.
ta: கருப்பொருள் வகை மாறுபாடுகளை உருவாக்குவது மற்றும் பயன்படுத்துவது பற்றி மேலும் அறியலாம்: ref: `அர்ப்பணிக்கப்பட்ட கட்டுரை <doc_gui_theme_type_variations>`.
uk: Ви можете дізнатися більше про створення та використання варіантів типу теми в :ref:`спеціальній статті <doc_gui_theme_type_variations>`.
zh_tw: 你可以參考 :ref:`專門的文章 <doc_gui_theme_type_variations>`，進一步了解主題型別變種的建立與應用。

source: Customizing a control
ga: Rialú a shaincheapadh
pt_br: Personalizando um controle
ru: Настройка элементов управления
ta: ஒரு கட்டுப்பாட்டைத் தனிப்பயனாக்குதல்
uk: Налаштування елемента керування
zh_tw: 自訂控制項

source: Each control node can be customized directly without the use of themes. This is called local overrides. Every theme property from the control's class reference can be overridden directly on the control itself, using either the Inspector dock, or scripts. This allows to make granular changes to a particular part of the UI, while not affecting anything else in the project, including this control's children.
ga: Is féidir gach nód rialaithe a shaincheapadh go díreach gan téamaí a úsáid. Tugtar aistrithe áitiúla air seo. Is féidir gach maoin téama ó thagairt ranga an rialaithe a shárú go díreach ar an rialú féin, ag baint úsáide as duga an Cigire, nó scripteanna. Ligeann sé seo athruithe gráinneacha a dhéanamh ar chuid áirithe den Chomhéadan, agus gan dul i bhfeidhm ar aon rud eile sa tionscadal, lena n-áirítear leanaí an rialaithe seo.
it: Ogni nodo controllo si può personalizzare direttamente senza l'utilizzo di temi. Questa operazione è detta sostituzione locale. Ogni proprietà del tema presente nel riferimento alla classe del controllo si può sovrascrivere direttamente sul controllo stesso, attraverso il pannello Ispettore o gli script. Questo consente di apportare modifiche granulari a una parte specifica dell'interfaccia utente, senza influire su altri elementi del progetto, inclusi gli elementi figlio di questo controllo.
ru: Каждый узел элемента управления можно настраивать напрямую, без использования тем. Это называется "локальным переопределением". Каждое свойство темы из ссылки на класс элемента управления можно переопределить непосредственно в самом элементе управления, используя панель инспектора или скрипты. Это позволяет вносить детальные изменения в определённую часть пользовательского интерфейса, не затрагивая при этом остальные элементы проекта, включая дочерние элементы этого элемента управления.
ta: ஒவ்வொரு கட்டுப்பாட்டு முனையும் கருப்பொருள்களைப் பயன்படுத்தாமல் நேரடியாக தனிப்பயனாக்கலாம். இது உள்ளக மேலெழுதல்கள் என்று அழைக்கப்படுகிறது. கட்டுப்பாட்டின் வகுப்பு குறிப்பிலிருந்து ஒவ்வொரு கருப்பொருள் சொத்துக்களும் இன்ச்பெக்டர் கப்பல்துறை அல்லது ச்கிரிப்ட்களைப் பயன்படுத்தி கட்டுப்பாட்டில் நேரடியாக மீறப்படலாம். இது இடைமுகம் இன் ஒரு குறிப்பிட்ட பகுதிக்கு சிறுமணி மாற்றங்களைச் செய்ய அனுமதிக்கிறது, அதே நேரத்தில் இந்த கட்டுப்பாட்டின் குழந்தைகள் உட்பட திட்டத்தில் வேறு எதையும் பாதிக்காது.
uk: Кожен вузол керування можна налаштувати безпосередньо без використання тем. Це називається локальними перевизначеннями. Кожну властивість теми з посилання на клас елемента керування можна перевизначити безпосередньо в самому елементі керування за допомогою док-станції Inspector або сценаріїв. Це дозволяє вносити детальні зміни до певної частини інтерфейсу користувача, не впливаючи ні на що інше в проекті, включно з дочірніми елементами цього елемента керування.
zh_tw: 每個控制項節點都可以不透過主題而直接自訂，這稱為本地覆寫。你可以在屬性檢視器或用腳本，直接覆寫控制項類別參考中列出的每一個主題屬性。這能讓你細緻調整介面的某一部分，而不影響專案其他部分，包括這個控制項的子項。
