Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: There are 2 ways to add glyphs to be prerendered to a given configuration. It is possible to use both approaches in a cumulative manner:
es: Hay dos maneras de añadir glifos para prerenderizarlos en una configuración determinada. Es posible usar ambos enfoques de forma acumulativa:
ga: Tá 2 bhealach ann chun glyphs a chur le réamhghníomhú le cumraíocht ar leith. Is féidir an dá chur chuige a úsáid ar bhealach carnach:
ru: Существует 2 способа добавления глифов для предварительной визуализации в заданную конфигурацию. Оба подхода можно использовать совместно:
ta: கொடுக்கப்பட்ட உள்ளமைவுக்கு முன்கூட்டியே கிளிஃப்களைச் சேர்க்க 2 வழிகள் உள்ளன. இரண்டு அணுகுமுறைகளையும் ஒட்டுமொத்தமாக பயன்படுத்த முடியும்:
uk: Є 2 способи додати гліфи для попереднього візуалізації до даної конфігурації. Можна використовувати обидва підходи в сукупності:
zh_hant: 你可以用兩種方法把字元加入預先算繪組態，也可混用：

source: **Using text from translations**
es: **Usar texto de traducciones**
ga: ** Ag baint úsáide as téacs ó aistriúcháin**
it: **Utilizzo di testo dalle traduzioni**
ru: **Использование текста из переводов**
ta: ** மொழிபெயர்ப்புகளிலிருந்து உரையைப் பயன்படுத்துதல் **
uk: **Використання тексту з перекладів**
zh_hant: **從翻譯內容取得字元**

source: For most projects, this approach is the most convenient to use, as it automatically sources text from your language translations. The downside is that it can only be used if your project supports :ref:`internationalization <doc_internationalizing_games>`. Otherwise, stick to the "Using custom text" approach described below.
es: Para la mayoría de los proyectos, este enfoque es el más práctico, ya que obtiene automáticamente el texto de las traducciones. La desventaja es que solo se puede usar si el proyecto admite :ref:`internationalization <doc_internationalizing_games>`. De lo contrario, siga el enfoque "Usar texto personalizado" que se describe a continuación.
ga: I gcás fhormhór na dtionscadal, is é an cur chuige seo an ceann is áisiúla le húsáid, toisc go bhfoinsíonn sé téacs go huathoibríoch ó d’aistriúcháin teanga. Is é an míbhuntáiste nach féidir é a úsáid ach amháin má thacaíonn do thionscadal le :ref:`idirnáisiúnú <doc_internationalizing_games>`. Seachas sin, cloí leis an gcur chuige "Úsáid téacs saincheaptha" a thuairiscítear thíos.
ru: Для большинства проектов этот подход наиболее удобен, поскольку он автоматически использует текст из ваших языковых переводов. Недостаток заключается в том, что его можно использовать только в том случае, если ваш проект поддерживает :ref:`internationalization <doc_internationalizing_games>`. В противном случае используйте подход "Использование пользовательского текста", описанный ниже.
ta: பெரும்பாலான திட்டங்களுக்கு, இந்த அணுகுமுறை பயன்படுத்த மிகவும் வசதியானது, ஏனெனில் இது உங்கள் மொழி மொழிபெயர்ப்புகளிலிருந்து தானாகவே உரையை வழங்குகிறது. தீங்கு என்னவென்றால், உங்கள் திட்டம் ஆதரித்தால் மட்டுமே அதைப் பயன்படுத்த முடியும்: ref: `சர்வதேசமயமாக்கல் <doc_internationaling_games>`. இல்லையெனில், கீழே விவரிக்கப்பட்டுள்ள "தனிப்பயன் உரையைப் பயன்படுத்துதல்" அணுகுமுறையில் ஒட்டிக்கொள்க.
uk: Для більшості проектів цей підхід є найзручнішим у використанні, оскільки він автоматично отримує текст із ваших мовних перекладів. Недоліком є те, що його можна використовувати, лише якщо ваш проект підтримує :ref:`internationalization <doc_internationalizing_games>`. В іншому випадку дотримуйтесь описаного нижче підходу «Використання спеціального тексту».
zh_hant: 多數專案最方便的作法是自動從翻譯（多語）檔取得所有字元。但這必須專案有設定 :ref:`國際化 <doc_internationalizing_games>`。否則請用下述「自訂文字」法。

source: After adding translations to the Project Settings, use the **Glyphs from the Translations** tab to check translations by double-clicking them, then click **Shape All Strings in the Translations and Add Glyphs** at the bottom:
es: Después de agregar traducciones a la Configuración del proyecto, use la pestaña **Glifos de las traducciones** para verificar las traducciones haciendo doble clic en ellas, luego haga clic en **Dar forma a todas las strings en las traducciones y agregar glifos** en la parte inferior:
ga: Tar éis aistriúcháin a chur leis na Socruithe Tionscadail, bain úsáid as an cluais**Glyphs ón Aistriúcháin** chun aistriúcháin a sheiceáil trí chliceáil faoi dhó orthu, ansin cliceáil **Cruth All Strings sna hAistriúcháin agus Cuir Glyphs** ag bun:
ru: После добавления переводов в Настройки Проекта используйте вкладку **Глифы из раздела Переводы**, чтобы проверить переводы, дважды щелкнув по ним, а затем нажмите **Формировать все строки в разделе Переводы и добавить глифы** внизу:
ta: திட்ட அமைப்புகளில் மொழிபெயர்ப்புகளைச் சேர்த்த பிறகு, மொழிபெயர்ப்புகளிலிருந்து ** கிளிஃப்களைப் பயன்படுத்தி மொழிபெயர்ப்புகளை இருமுறை சொடுக்கு செய்வதன் மூலம் சரிபார்க்க, பின்னர் ** மொழிபெயர்ப்புகளில் உள்ள அனைத்து சரங்களையும் வடிவமைத்து கீழே கிளிஃப்ச் ** ஐச் சேர்க்கவும்:
uk: Після додавання перекладів до налаштувань проекту скористайтеся вкладкою **Гліфи з вкладки Переклади**, щоб перевірити переклади, двічі клацнувши їх, а потім натисніть **Сформувати всі рядки в перекладах і додати гліфи** внизу:
zh_hant: 專案設定加入翻譯後，切到 **翻譯字元** 分頁，雙擊檢查所有翻譯，再點下方 **將所有翻譯字串整理並加入字元**：

source: Enabling prerendering in the Advanced Import Settings dialog with the Glyphs from the Translations tab
es: Habilitar la representación previa en el cuadro de diálogo Configuración de importación avanzada con los glifos de la pestaña Traducciones
ga: Cumas réamhghníomhachtú sa dialóg Ard-Socruithe Allmhairithe leis na Glyphs ón gcluaisín Aistriúchá
ru: Включение предварительной визуализации в диалоговом окне "Дополнительные параметры импорта" с глифами из вкладки "Переводы"
ta: மொழிபெயர்ப்பு தாவலில் இருந்து கிளிஃப்களுடன் மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலில் முன்நிபந்தனையை இயக்குகிறது
uk: Увімкнення попереднього відтворення в діалоговому вікні «Додаткові параметри імпорту» за допомогою гліфів із вкладки «Переклад»
zh_hant: 在進階匯入設定啟用「翻譯字元」預先算繪

source: Enabling prerendering in the Advanced Import Settings dialog with the **Glyphs from the Translations** tab
es: Habilitar la representación previa en el cuadro de diálogo Configuración de importación avanzada con la pestaña **Glifos de las traducciones**
ga: Réamh-rindreáil a chumasú sa dialóg Ard-Socruithe Iompórtála leis na cluaise**Glyphs ón gcluaisín Aistriúcháin**
ru: Включение предварительной визуализации в диалоговом окне "Дополнительные параметры импорта" на вкладке **Глифы из переводов**
ta: மொழிபெயர்ப்புகளிலிருந்து ** கிளிஃப்சுடன் மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலில் முன்நிபந்தனை இயக்குதல் ** தாவல்
uk: Увімкнення попереднього відтворення в діалоговому вікні «Додаткові параметри імпорту» за допомогою вкладки **Гліфи з перекладу**
zh_hant: 在進階匯入設定啟用 **翻譯字元** 預先算繪

source: The list of prerendered glyphs is not automatically updated when translations are updated, so you need to repeat this process if your translations have changed significantly.
es: La lista de glifos pre-renderizados no se actualiza automáticamente cuando se actualizan las traducciones, por lo que deberás repetir este proceso si tus traducciones han cambiado significativamente.
ga: Ní nuashonraítear liosta na glyphs réamhdhéanta go huathoibríoch nuair a nuashonraítear aistriúcháin, mar sin ní mór duit an próiseas seo a dhéanamh arís má tá athrú suntasach tagtha ar do chuid aistriúcháin.
ru: Список предварительно отрендеренных глифов не обновляется автоматически при обновлении переводов, поэтому вам необходимо повторить этот процесс, если ваши переводы существенно изменились.
ta: மொழிபெயர்ப்புகள் புதுப்பிக்கப்படும்போது முன்கூட்டிய கிளிஃப்களின் பட்டியல் தானாகவே புதுப்பிக்கப்படாது, எனவே உங்கள் மொழிபெயர்ப்புகள் கணிசமாக மாறிவிட்டால் இந்த செயல்முறையை மீண்டும் செய்ய வேண்டும்.
uk: Список попередньо відтворених гліфів не оновлюється автоматично під час оновлення перекладів, тому вам потрібно повторити цей процес, якщо ваші переклади суттєво змінилися.
zh_hant: 如果翻譯檔有大幅更新，預算繪字元清單不會自動同步，需手動再執行一次上述程序。

source: **Using custom text**
es: **Usar texto personalizado**
ga: ** Téacs saincheaptha á úsáid a**
it: **Utilizzo di testo personalizzato**
ru: **Использование пользовательского текста**
ta: ** தனிப்பயன் உரையைப் பயன்படுத்துதல் **
uk: **Використання спеціального тексту**
zh_hant: **從自訂文字取得字元**

source: While it requires manually specifying text that will appear in the game, this is the most efficient approach for games which don't feature user text input. This approach is worth exploring for mobile games to reduce the file size of the distributed app.
es: Si bien requiere especificar manualmente el texto que aparecerá en el juego, este es el enfoque más eficiente para juegos que no permiten la entrada de texto del usuario. Vale la pena explorar este enfoque en juegos móviles para reducir el tamaño de archivo de la aplicación distribuida.
ga: Cé go n-éilíonn sé an téacs a thaispeánfar sa chluiche a shonrú de láimh, is é seo an cur chuige is éifeachtaí do chluichí nach bhfuil ionchur téacs úsáideora iontu. Is fiú an cur chuige seo a iniúchadh le haghaidh cluichí soghluaiste chun méid comhaid an aip dháilte a laghdú.
ru: Хотя этот подход требует ручного указания текста, который будет отображаться в игре, он является наиболее эффективным для игр, не предполагающих ввода текста пользователем. Этот подход стоит изучить для мобильных игр, чтобы уменьшить размер файла распространяемого приложения.
ta: விளையாட்டில் தோன்றும் உரையை கைமுறையாகக் குறிப்பிடும் போது, பயனர் உரை உள்ளீட்டைக் கொண்டிருக்காத விளையாட்டுகளுக்கு இது மிகவும் திறமையான அணுகுமுறையாகும். இந்த அணுகுமுறை விநியோகிக்கப்பட்ட பயன்பாட்டின் கோப்பு அளவைக் குறைக்க மொபைல் கேம்களுக்கு ஆராய்வது மதிப்பு.
uk: Хоча для цього потрібно вручну вказати текст, який з’являтиметься в грі, це найефективніший підхід для ігор, у яких не передбачено введення тексту користувачем. Цей підхід варто вивчити для мобільних ігор, щоб зменшити розмір файлу розповсюдженої програми.
zh_hant: 這種方式需手動列出遊戲中會用到的所有字元，但對沒有用戶輸入的遊戲來說最有效率。行動遊戲若想壓縮安裝檔體積，值得採用這法。

source: To use existing text as a baseline for prerendering, go to the **Glyphs from the Text** sub-tab of the Advanced Import Settings dialog, enter text in the window on the right, then click **Shape Text and Add Glyphs** at the bottom of the dialog:
es: Para usar texto existente como base para la renderización previa, vaya a la subpestaña **Glifos del texto** del cuadro de diálogo Configuración de importación avanzada, ingrese texto en la ventana de la derecha y luego haga clic en **Dar forma al texto y agregar glifos** en la parte inferior del cuadro de diálogo:
ga: Chun an téacs atá ann cheana a úsáid mar bhunlíne le haghaidh réamhghníomhú, téigh go dtí an fho-chluaise**Glyphs ón bhfo-chluaisín Téacs** den dialóg Ard-Socruithe Iompórtála, cuir isteach téacs san fhuinneog ar dheis, ansin cliceáil** Téacs Cruth agus Cuir Glyphs** ag bun an dialóige:
ru: Чтобы использовать существующий текст в качестве основы для предварительной визуализации, перейдите на вкладку **Глифы из текста** диалогового окна "Дополнительные параметры импорта", введите текст в окно справа, затем нажмите **Формировать текст и добавить глифы** в нижней части диалогового окна:
ta: முன்பதிவு செய்வதற்கான ஒரு அடிப்படையாக இருக்கும் உரையைப் பயன்படுத்த, மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலின் உரையிலிருந்து ** கிளிஃப்களுக்குச் சென்று, வலதுபுறத்தில் சாளரத்தில் உரையை உள்ளிட்டு, பின்னர் ** வடிவ உரையை சொடுக்கு செய்து கிளிஃப்களைச் சேர்க்கவும்* * உரையாடலின் அடிப்பகுதியில்:
uk: Щоб використати наявний текст як базову лінію для попереднього відтворення, перейдіть на підвкладку **Гліфи з тексту** діалогового вікна «Додаткові параметри імпорту», введіть текст у вікні на праворуч, потім натисніть **Сформувати текст і додати гліфи** внизу діалогового вікна:
zh_hant: 若要用現有文字當預先算繪依據，請切到進階匯入設定的 **文字字元** 分頁，在右邊輸入要收錄的內容，然後點下方 **整理文字並加入字元**：

source: Enabling prerendering in the Advanced Import Settings dialog, Glyphs from the Text tab
es: Habilitar la representación previa en el cuadro de diálogo Configuración de importación avanzada, Glifos desde la pestaña Texto
ga: Réamh-rindreáil a chumasú sa dialóg Ard-Socruithe Iompórtála, Glyphs ón gcluaisín Téacs
ru: Включение предварительной визуализации в диалоговом окне "Дополнительные параметры импорта", глифы на вкладке "Текст"
ta: மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலில் முன்நிபந்தனை, உரை தாவலில் இருந்து கிளிஃப்ச்
uk: Увімкнення попереднього відтворення в діалоговому вікні «Додаткові параметри імпорту», «Гліфи» на вкладці «Текст»
zh_hant: 在進階匯入設定「文字字元」分頁啟用預先算繪

source: Enabling prerendering in the Advanced Import Settings dialog with the **Glyphs from the Text** tab
es: Habilitar la representación previa en el cuadro de diálogo Configuración de importación avanzada con la pestaña **Glifos del texto**
ga: Réamh-rindreáil a chumasú sa dialóg Ard-Socruithe Iompórtála leis na **Glyphs ón gcluaisín Téacs**
ru: Включение предварительной визуализации в диалоговом окне "Дополнительные параметры импорта" на вкладке **Глифы из текста**
ta: உரையின் ** தாவலில் இருந்து ** கிளிஃப்களுடன் மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலில் முன்நிபந்தனை இயக்குகிறது
uk: Увімкнення попереднього відтворення в діалоговому вікні «Додаткові параметри імпорту» за допомогою вкладки **Гліфи з тексту**
zh_hant: 在進階匯入設定啟用 **文字字元** 預先算繪

source: If your project supports :ref:`internationalization <doc_internationalizing_games>`, you can paste the contents of your CSV or PO files in the above box to quickly prerender all possible characters that may be rendered during gameplay (excluding user-provided or non-translatable strings).
es: Si tu proyecto admite la :ref:`internacionalización <doc_internationalizing_games>`, puedes pegar el contenido de tus archivos CSV o PO en el cuadro de arriba para pre-renderizar rápidamente todos los personajes posibles que se pueden renderizar durante el juego (excluyendo strings proporcionadas por el usuario o no traducibles).
ga: Má thacaíonn do thionscadal le :ref:`idirnáisiúnú <doc_internationalizing_games>`, is féidir leat inneachar do chomhaid CSV nó PO a ghreamú sa bhosca thuas chun réamhléiriú tapa a dhéanamh ar gach carachtar féideartha a d'fhéadfaí a dhéanamh le linn na gcluichí (gan soláthar úsáideora nó neamh-aistrithe a áireamh teaghráin).
ru: Если ваш проект поддерживает :ref:`internationalization <doc_internationalizing_games>`, вы можете вставить содержимое ваших CSV- или PO-файлов в поле выше, чтобы быстро выполнить предварительную визуализацию всех возможных символов, которые могут быть отображены во время игры (исключая предоставленные пользователем или непереводимые строки).
ta: உங்கள் திட்டம் ஆதரித்தால்: ref: `சர்வதேசமயமாக்கல் <doc_internationaliging_games>`, உங்கள் காபிம அல்லது PO கோப்புகளின் உள்ளடக்கங்களை மேலே உள்ள பெட்டியில் ஒட்டலாம். சரங்கள்).
uk: Якщо ваш проект підтримує :ref:`internationalization <doc_internationalizing_games>`, ви можете вставити вміст файлів CSV або PO у вікно вище, щоб швидко відтворити всі можливі символи, які можуть відтворюватися під час гри (за винятком наданих користувачем або неперекладних). рядки).
zh_hant: 如果你的專案有國際化 (:ref:`internationalization <doc_internationalizing_games>`)，直接貼上 CSV 或 PO 檔內容，就能一次性算繪所有遊戲會用到的字元（但不含玩家自訂輸入或不可翻譯的字串）。

source: **By enabling character sets**
es: **Habilitando conjuntos de caracteres**
ga: ** Trí thacair charachtair a chumasaí**
it: **Abilitando i set di caratteri**
ru: **Включая наборы символов**
ta: ** எழுத்து தொகுப்புகளை இயக்குவதன் மூலம் **
uk: **Увімкнувши набори символів**
zh_hant: **啟用字元集**

source: The second method requires less configuration and fewer updates if your game's text changes, and is more suited to text-heavy games or multiplayer games with chat. On the other hand, it may cause glyphs that never show up in the game to be prerendered, which is less efficient in terms of file size.
es: El segundo método requiere menos configuración y actualizaciones si el texto del juego cambia, y es más adecuado para juegos con mucho texto o multijugador con chat. Por otro lado, puede provocar que los glifos que nunca aparecen en el juego se prerendericen, lo que reduce el tamaño del archivo.
ga: Éilíonn an dara modh níos lú cumraíochta agus níos lú nuashonruithe má athraíonn téacs do chluiche, agus tá sé níos oiriúnaí do chluichí trom téacs nó cluichí il-imreora le comhrá. Ar an láimh eile, d'fhéadfadh sé a bheith ina chúis le glyphs nach dtaispeántar riamh sa chluiche a réamhthaispeáint, rud atá chomh héifeachtach i dtéarmaí méid an chomhaid.
ru: Второй метод требует меньше настроек и обновлений при изменении текста в игре и больше подходит для игр с большим количеством текста или многопользовательских игр с чатом. С другой стороны, он может привести к предварительной отрисовке глифов, которые никогда не отображаются в игре, что менее эффективно с точки зрения размера файла.
ta: இரண்டாவது முறைக்கு உங்கள் விளையாட்டின் உரை மாறினால் குறைவான உள்ளமைவு மற்றும் குறைவான புதுப்பிப்புகள் தேவைப்படுகின்றன, மேலும் இது உரை-கனமான விளையாட்டுகள் அல்லது அரட்டையுடன் மல்டிபிளேயர் கேம்களுக்கு மிகவும் பொருத்தமானது. மறுபுறம், இது விளையாட்டில் ஒருபோதும் காட்டப்படாத கிளிஃப்களை முன்கூட்டியே முன்வைக்கக்கூடும், இது கோப்பு அளவைப் பொறுத்தவரை குறைந்த செயல்திறன் கொண்டது.
uk: Другий спосіб вимагає менше конфігурації та оновлень, якщо текст вашої гри змінюється, і він більше підходить для ігор із великим навантаженням на текст або ігор для кількох гравців із чатом. З іншого боку, це може спричинити попередню візуалізацію гліфів, які ніколи не з’являються в грі, що менш ефективно з точки зору розміру файлу.
zh_hant: 這種方法不用每次文字變更都重設組態，適合大量文字或有聊天功能的遊戲。但缺點是會預算繪許多實際不會用到的字元，檔案也會變大。

source: To use existing text as a baseline for prerendering, go to the **Glyphs from the Character Map** sub-tab of the Advanced Import Settings dialog, then *double-click* character sets to be enabled on the right:
es: Para usar texto existente como base para la renderización previa, vaya a la subpestaña **Glifos del mapa de caracteres** del cuadro de diálogo Configuración de importación avanzada y luego *haga doble clic* en los conjuntos de caracteres que se habilitarán a la derecha:
ga: Chun an téacs atá ann cheana a úsáid mar bhunlíne le haghaidh réamhghníomhú, téigh go dtí an fo-chluaise**Glyphs ón Léarscáil Carachtar** den dialóg Ard-Socruithe Iompórtála, ansin*cliceáil dúbail* tacair carachtair le cumasú ar dheis:
ru: Чтобы использовать существующий текст в качестве основы для предварительной визуализации, перейдите на вкладку **Глифы из таблицы символов** диалогового окна «Дополнительные параметры импорта», затем *дважды щелкните* наборы символов, которые нужно включить справа:
ta: முன்பதிவு செய்வதற்கான ஒரு அடிப்படையாக இருக்கும் உரையைப் பயன்படுத்த, மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலின் எழுத்துக்குறி வரைபடத்திலிருந்து ** கிளிஃப்களுக்குச் செல்லவும், பின்னர்*இரட்டை கிளிக்*எழுத்து வலதுபுறத்தில் இயக்கப்பட வேண்டும்:
uk: Щоб використати існуючий текст як базову лінію для попереднього відтворення, перейдіть на підвкладку **Гліфи з карти символів** діалогового вікна «Додаткові параметри імпорту», а потім *двічі клацніть* набори символів, які потрібно ввімкнути, праворуч:
zh_hant: 要用字元集當預設，請切到進階匯入設定的 **字元集** 分頁，右側*雙擊*要啟用的字元集：

source: Enabling prerendering in the Advanced Import Settings dialog, Glyphs from the Character Map tab
es: Habilitar la representación previa en el cuadro de diálogo Configuración de importación avanzada, Glifos desde la pestaña Mapa de caracteres
ga: Réamh-rindreáil a chumasú sa dialóg Ard-Socruithe Iompórtála, Glyphs ón gcluaisín Léarscáil
ru: Включение предварительной визуализации в диалоговом окне «Дополнительные параметры импорта», глифы на вкладке «Таблица символов»
ta: மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலில் முன்நிபந்தனை, எழுத்து வரைபட தாவலில் இருந்து கிளிஃப்ச்
uk: Увімкнення попереднього відтворення в діалоговому вікні «Додаткові параметри імпорту», «Гліфи» на вкладці «Карта символів»
zh_hant: 在進階匯入設定「字元集」分頁啟用預先算繪

source: Enabling prerendering in the Advanced Import Settings dialog with the **Glyphs from the Character Map** tab
es: Habilitar la representación previa en el cuadro de diálogo Configuración de importación avanzada con la pestaña **Glifos del mapa de caracteres**
ga: Réamh-rindreáil a chumasú sa dialóg Ard-Socruithe Iompórtála leis na **Glyphs ón gcluaisín Léarscáil Carachtar**
ru: Включение предварительной визуализации в диалоговом окне «Дополнительные параметры импорта» на вкладке **Глифы из таблицы символов**
ta: எழுத்துக்குறி வரைபடத்திலிருந்து ** கிளிஃப்களுடன் மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலில் முன்நிபந்தனையை இயக்குகிறது ** தாவல்
uk: Увімкнення попереднього відтворення в діалоговому вікні «Додаткові параметри імпорту» за допомогою вкладки **Гліфи з карти символів**
zh_hant: 在進階匯入設定啟用 **字元集** 預先算繪

source: To ensure full prerendering, the character sets you need to enable depend on which languages are supported in your game. For English, only **Basic Latin** needs to be enabled. Enabling **Latin-1 Supplement** as well allows fully covering many more languages, such as French, German and Spanish. For Russian, **Cyrillic** needs to be enabled, and so on.
es: Para garantizar una prerenderización completa, los conjuntos de caracteres que debes habilitar dependen de los idiomas compatibles con tu juego. Para inglés, solo es necesario habilitar **Latín básico**. Al habilitar **Suplemento Latin-1**, también se pueden incluir muchos más idiomas, como francés, alemán y español. Para ruso, es necesario habilitar **Cirílico**, y así sucesivamente.
ga: Chun réamhghníomhú iomlán a chinntiú, braitheann na tacair charachtair a chaithfidh tú a chumasú ar na teangacha a dtacaítear le do chlu Maidir le Béarla, ní gá ach **Laidin Bunús** a chumasú. Ceadaíonn Forlíont**Laidin-1** a chumasú freisin go leor teangacha eile a chlúdach go hiomlán, mar shampla Fraincis, Gearmáinis agus Spáinnis. Maidir leis an Rúisis, is gá **Cirillic** a chumasú, agus mar sin de.
ru: Для обеспечения полной предварительной визуализации наборы символов, которые необходимо включить, зависят от поддерживаемых в вашей игре языков. Для английского языка необходимо включить только **Basic Latin**. Включение **Latin-1 Supplement** позволяет полностью охватить многие другие языки, такие как французский, немецкий и испанский. Для русского языка необходимо включить **Cyrillic** и так далее.
ta: முழு முன்நிபந்தனையை உறுதிப்படுத்த, உங்கள் விளையாட்டில் எந்த மொழிகள் ஆதரிக்கப்படுகின்றன என்பதைப் பொறுத்தது என்பதை நீங்கள் செயல்படுத்த வேண்டிய எழுத்து அமைக்கிறது. ஆங்கிலத்தைப் பொறுத்தவரை, ** அடிப்படை லத்தீன் ** மட்டுமே இயக்கப்பட வேண்டும். ** லத்தீன் -1 துணை ** ஐ இயக்குவது பிரஞ்சு, செர்மன் மற்றும் ச்பானிச் போன்ற பல மொழிகளை முழுமையாக மறைக்க அனுமதிக்கிறது. ரச்ய மொழியைப் பொறுத்தவரை, ** சிரிலிக் ** இயக்கப்பட வேண்டும், மற்றும் பல.
uk: Щоб забезпечити повну попередню візуалізацію, набори символів, які потрібно ввімкнути, залежать від того, які мови підтримуються у вашій грі. Для англійської мови потрібно ввімкнути лише **Basic Latin**. Увімкнення **Latin-1 Supplement** також дозволяє повністю охопити багато інших мов, наприклад французьку, німецьку та іспанську. Для російської мови потрібно ввімкнути **кирилицю** тощо.
zh_hant: 要完整預先算繪，需依遊戲支援語言開啟相應的字元集。英文只要 **Basic Latin**，如需支援法語、德語、西班牙語，請同時啟用 **Latin-1 Supplement**。俄文則要啟 **Cyrillic**，以此類推。

source: Default project font properties
es: Propiedades de fuente del proyecto predeterminadas
ga: Airíonna cló tionscadail réamh
it: Proprietà del font predefinito di un progetto
ru: Свойства шрифта проекта по умолчанию
ta: இயல்புநிலை திட்ட எழுத்துரு பண்புகள்
uk: Властивості шрифтів проекту за замовчуванням
zh_hant: 預設專案字型屬性
