Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: Font outlines and shadows can be used to improve readability when the background color isn't known in advance. For instance, this is the case for HUD elements that are drawn over a 2D/3D scene.
ga: Is féidir imlíne cló agus scáthanna a úsáid chun inléiteacht a fheabhsú nuair nach bhfuil dath an chúlra ar eolas roimh ré. Mar shampla, is é seo an cás le haghaidh eilimintí HUD a tharraingítear thar radharc 2D / 3D.
it: I contorni e le ombreggiature dei font possono servire per migliorare la leggibilità quando il colore di sfondo non è noto in anticipo. Ad esempio, questo è il caso degli elementi dell'HUD disegnati su una scena 2D/3D.
ru: Контуры и тени шрифтов можно использовать для улучшения читаемости, когда цвет фона заранее неизвестен. Например, это касается элементов HUD, отображаемых поверх 2D/3D-сцены.
ta: பின்னணி நிறம் முன்கூட்டியே அறியப்படாதபோது வாசிப்புத்திறனை மேம்படுத்த எழுத்துரு வெளிப்புறங்கள் மற்றும் நிழல்கள் பயன்படுத்தப்படலாம். உதாரணமாக, 2 டி/3 டி காட்சியில் வரையப்பட்ட HUD கூறுகளுக்கு இதுதான்.
uk: Контури шрифту та тіні можна використовувати для покращення читабельності, якщо колір фону невідомий заздалегідь. Наприклад, це стосується елементів HUD, які малюються поверх 2D/3D сцени.
zh_hant: 字型描邊與陰影有助於在無法預知背景顏色時提升可讀性，例如 2D/3D 場景疊加的 HUD 元件。

source: Font outlines are available in most nodes that derive from Control, in addition to :ref:`class_Label3D`.
ga: Tá imlíne cló ar fáil i bhformhór na nóid a thagann ó Rialú, chomh maith le :ref:'class_Label3D'.
it: I contorni dei font sono disponibili nella maggioranza dei nodi che derivano da Control, oltre a :ref:`class_Label3D`.
ru: Контуры шрифтов доступны в большинстве узлов, производных от Control, в дополнение к :ref:`class_Label3D`.
ta: எழுத்துரு திட்டவட்டங்கள் கட்டுப்பாட்டிலிருந்து பெறப்பட்ட பெரும்பாலான முனைகளில் கிடைக்கின்றன, கூடுதலாக: ref: `class_label3d`.
uk: На додачу до :ref:`class_Label3D` контури шрифтів доступні в більшості вузлів, які походять від Control.
zh_hant: 除了 :ref:`class_Label3D`，大多數繼承自 Control 的節點也支援字型描邊功能。

source: To enable outline for a font on a given node, configure the theme overrides **Font Outline Color** and **Outline Size** in the inspector. The result should look like this:
ga: Chun imlíne le haghaidh cló ar nód ar leith a chumasú, cumraigh an téama **Font Outline Color** agus **Outline Size** sa chigire. Ba chóir go mbeadh cuma mar seo ar an toradh:
it: Per abilitare il contorno per un font su un determinato nodo, configura le sostituzioni del tema **Colore contorno font** e **Dimensione contorno** nell'ispettore. Il risultato dovrebbe apparire così:
ru: Чтобы включить контур шрифта в заданном узле, настройте переопределения темы **Font Outline Color (Цвет контура шрифта)** и **Outline Size (Размер контура)** в инспекторе. Результат должен выглядеть следующим образом:
ta: கொடுக்கப்பட்ட முனையில் ஒரு எழுத்துருவுக்கு அவுட்லைன் இயக்க, இன்ச்பெக்டரில் கருப்பொருள் மீறல் ** எழுத்துரு அவுட்லைன் வண்ணம் ** மற்றும் ** அவுட்லைன் அளவு ** ஆகியவற்றை உள்ளமைக்கவும். இதன் விளைவாக இப்படி இருக்க வேண்டும்:
uk: Щоб увімкнути контур для шрифту на певному вузлі, налаштуйте перевизначення теми **Колір контуру шрифту** і **Розмір контуру** в інспекторі. Результат повинен виглядати так:
zh_hant: 要為特定節點啟用字型描邊，請在屬性檢視器的主題覆寫區調整 **字型描邊顏色** 與 **描邊寬度**，效果如下：

source: Font outline example
ga: Sampla imlíne cló
it: Esempio di contorno di un font
ru: Пример контура шрифта
ta: எழுத்துரு அவுட்லைன் எடுத்துக்காட்டு
uk: Приклад контуру шрифту
zh_hant: 字型描邊範例

source: If using a font with MSDF rendering, its **MSDF Pixel Range** import option be set to at least *twice* the value of the outline size for outline rendering to look correct. Otherwise, the outline may appear to be cut off earlier than intended.
ga: Má tá cló á úsáid le rindreáil MSDF, socrófar a rogha iompórtála **MSDF Pixel Range ** ar a laghad * dhá uair * luach mhéid an imlíne le haghaidh rindreáil imlíne chun breathnú ceart. Seachas sin, is cosúil go bhfuil an imlíne gearrtha amach níos luaithe ná mar a bhí beartaithe.
it: Se si utilizza un font con rendering MSDF, l'opzione di importazione **Intervallo di pixel MSDF** deve essere impostata almeno *il doppio* del valore della dimensione del contorno affinché il rendering del contorno sia corretto. Se no, il contorno potrebbe apparire troncato prima del previsto.
ru: При использовании шрифта с рендерингом MSDF установите для параметра импорта **MSDF Pixel Range** значение как минимум *в два* раза больше размера контура, чтобы контур выглядел корректно. В противном случае контур может обрезаться раньше, чем предполагалось.
ta: எம்.எச்.டி.எஃப் வழங்குதல் மூலம் ஒரு எழுத்துருவைப் பயன்படுத்தினால், அதன் ** எம்.எச்.டி.எஃப் படப்புள்ளி வரம்பு ** இறக்குமதி விருப்பத்தை குறைந்தபட்சம்*இரண்டு முறை*அமைக்க வேண்டும்*அவுட்லைன் வழங்குதல் சரியானதாக இருப்பதற்கான அவுட்லைன் அளவின் மதிப்பு. இல்லையெனில், அவுட்லைன் நினைத்ததை விட முன்பே துண்டிக்கப்படுவதாகத் தோன்றலாம்.
uk: Якщо використовується шрифт із рендерингом MSDF, для параметра імпорту **MSDF Pixel Range** має бути встановлено принаймні *подвійне* значення розміру контуру, щоб рендеринг контуру виглядав правильно. Інакше контур може здатися обрізаним раніше, ніж передбачалося.
zh_hant: 如果使用 MSDF 算繪的字型，請將 **MSDF 像素範圍** 匯入選項設為至少為描邊寬度的兩倍，以確保描邊正常顯示，否則描邊可能會被過早裁切。

source: Support for font shadows is more limited: they are only available in :ref:`class_Label` and :ref:`class_RichTextLabel`. Additionally, font shadows always have a hard edge (but you can reduce their opacity to make them look more subtle). To enable font shadows on a given node, configure the **Font Shadow Color**, **Shadow Offset X**, and **Shadow Offset Y** theme overrides in a Label or RichTextLabel node accordingly:
ga: Tá tacaíocht do scáthanna cló níos teoranta: níl siad ar fáil ach in :ref:'class_Label' agus :ref:'class_RichTextLabel'. Ina theannta sin, bíonn imeall crua ag scáthanna cló i gcónaí (ach is féidir leat a teimhneacht a laghdú chun cuma níos caolchúisí a chur orthu). Chun scáthanna cló a chumasú ar nód ar leith, cumraigh an **Dath Scáth Cló **, **Scáth-Fhritháireamh X **, agus ** Scáth-Fhritháireamh Y ** sáraíonn téama i nód Lipéad nó RichTextLabel dá réir sin:
it: Il supporto per le ombreggiature dei font è più limitato: sono disponibili solo in :ref:`class_Label` e :ref:`class_RichTextLabel`. Inoltre, le ombreggiature hanno sempre un bordo netto (ma è possibile ridurne l'opacità per renderle più sottili). Per abilitare le ombreggiature dei font su un determinato nodo, configurare le sostituzioni del tema **Colore dell'ombra del font**, **Scostamento in X dell'ombra** e **Scostamento in Y dell'ombra** in un nodo Label o RichTextLabel:
ru: Поддержка теней шрифтов более ограничена: они доступны только в классах :ref:`class_Label` и :ref:`class_RichTextLabel`. Кроме того, тени шрифтов всегда имеют чёткие границы (но можно уменьшить их прозрачность, чтобы сделать их более плавными). Чтобы включить тени шрифтов в определённом узле, настройте переопределения темы **Font Shadow Color (Цвет тени шрифта)**, **Shadow Offset X (Смещение тени по оси X)** и **Shadow Offset Y (Смещение тени по оси Y)** в узле Label или RichTextLabel соответствующим образом:
ta: எழுத்துரு நிழல்களுக்கான உதவி மிகவும் குறைவாக உள்ளது: அவை மட்டுமே கிடைக்கின்றன: குறிப்பு: `class_label` மற்றும்: ref:` class_richtextLabel`. கூடுதலாக, எழுத்துரு நிழல்கள் எப்போதுமே கடினமான விளிம்பைக் கொண்டுள்ளன (ஆனால் அவற்றை மிகவும் நுட்பமானதாகக் காட்ட அவற்றின் ஒளிபுகாநிலையை நீங்கள் குறைக்கலாம்). கொடுக்கப்பட்ட முனையில் எழுத்துரு நிழல்களை இயக்க, ** எழுத்துரு நிழல் வண்ணத்தை உள்ளமைக்கவும் **, ** நிழல் ஆஃப்செட் ஃச் **, மற்றும் ** நிழல் ஆஃப்செட் ஒய் ** கருப்பொருள் ஒரு சிட்டை அல்லது ரிச் டெக்ச்ட்லேபிள் முனையில் மேலெழுதும்:
uk: Підтримка тіней шрифту більш обмежена: вони доступні лише в :ref:`class_Label` і :ref:`class_RichTextLabel`. Крім того, тіні шрифту завжди мають жорсткий край (але ви можете зменшити їхню непрозорість, щоб вони виглядали більш тонкими). Щоб увімкнути тіні шрифту на певному вузлі, налаштуйте **Колір тіні шрифту**, **Зсув тіні X** і **Зсув тіні Y** у вузлі Label або RichTextLabel відповідно:
zh_hant: 字型陰影支援較有限，目前僅 :ref:`class_Label` 和 :ref:`class_RichTextLabel` 有提供。此外，陰影邊緣為硬邊（你可調整透明度讓其較柔和）。要啟用字型陰影，請在 Label 或 RichTextLabel 節點的主題覆寫區設定 **字型陰影顏色**、**陰影 X 偏移** 與 **陰影 Y 偏移**：

source: Configuring font shadow in a Label node
ga: Scáth cló á chumrú i nód lipéid
it: Configurare un'ombra di font in un nodo Label
ru: Настройка тени шрифта в узле Label
ta: எழுத்துரு நிழலை ஒரு சிட்டை முனையில் கட்டமைத்தல்
uk: Налаштування тіні шрифту у вузлі Label
zh_hant: 在 Label 節點中設定字型陰影

source: The result should look like this:
ga: Ba chóir go mbeadh cuma mar seo ar an toradh:
it: Il risultato dovrebbe apparire simile a questo:
ru: Результат должен выглядеть так:
ta: இதன் விளைவாக இப்படி இருக்க வேண்டும்:
uk: Результат повинен виглядати так:
zh_hant: 效果如下圖所示：

source: Font shadow example
es: Ejemplo de sombra de fuente
ga: Scáthshampla clófhoirne
it: Esempio di ombra di font
ru: Пример тени шрифта
ta: எழுத்துரு நிழல் எடுத்துக்காட்டு
uk: Приклад тіні від шрифту
zh_hant: 字型陰影範例

source: You can create local overrides to font display in Label nodes by creating a :ref:`class_LabelSettings` resource that you reuse across Label nodes. This resource takes priority over :ref:`theme properties <doc_gui_skinning>`.
ga: Is féidir leat sáruithe áitiúla a chruthú chun cló a thaispeáint i nóid Lipéad trí acmhainn :ref:`class_LabelSettings` a chruthú a úsáideann tú thar nóid Lipéid. Tá tosaíocht ag an acmhainn seo thar :ref:`airíonna téama <doc_gui_skinning>`.
it: È possibile creare sostituzioni locali per la visualizzazione dei font nei nodi Label creando una risorsa :ref:`class_LabelSettings` che sarà riutilizzata in tutti i nodi Label. Questa risorsa ha la priorità sulle :ref:`proprietà del tema <doc_gui_skinning>`.
ru: Вы можете создать локальные переопределения для отображения шрифтов в узлах Label, создав ресурс :ref:`class_LabelSettings`, который можно использовать повторно в узлах Label. Этот ресурс имеет приоритет над :ref:`theme properties <doc_gui_skinning>`.
ta: சிட்டை முனைகளில் எழுத்துரு காட்சிக்கு உள்ளக மேலெழுதல்களை உருவாக்கலாம்: Ref: `class_labelsettings` வளத்தை நீங்கள் சிட்டை முனைகளில் மீண்டும் பயன்படுத்துகிறீர்கள். இந்த சான்று முன்னுரிமை அளிக்கிறது: குறிப்பு: `தீம் பண்புகள் <doc_gui_skinning>`.
uk: Ви можете створити локальні перевизначення для відображення шрифтів у вузлах міток, створивши ресурс :ref:`class_LabelSettings`, який ви повторно використовуєте у вузлах міток. Цей ресурс має пріоритет над :ref:`властивості теми <doc_gui_skinning>`.
zh_hant: 你也可以建立 :ref:`class_LabelSettings` 資源並指定給多個 Label 節點，來在單一 Label 節點局部覆寫字型顯示，這會優先於 :ref:`主題屬性 <doc_gui_skinning>`。

source: Advanced font features
ga: Gnéithe cló casta
it: Funzionalità avanzate di font
ru: Расширенные возможности шрифтов
ta: மேம்பட்ட எழுத்துரு நற்பொருத்தங்கள்
uk: Розширені функції шрифту
zh_hant: 進階字型功能

source: Antialiasing
ga: Antialeasing
ru: Сглаживание
ta: ஆன்டிலிசிங்
uk: Згладжування
zh_hant: 抗鋸齒

source: You can adjust how the font should be smoothed out when rendering by adjusting *antialiasing* and *hinting*. These are different properties, with different use cases.
ga: Is féidir leat an chaoi ar chóir an cló a ghlanadh amach agus é á rindreáil trí *antialiasing *agus *hinting *a choigeartú. Is airíonna éagsúla iad seo, le cásanna úsáide éagsúla.
it: È possibile regolare come il font deve essere smussato durante il rendering regolando l'*antialiasing* e l'*hinting*. Queste sono proprietà diverse, con casi d'uso diversi.
ru: Вы можете настроить сглаживание шрифта при рендеринге, настроив *antialiasing (сглаживание)* и *hinting (хинтинг)*. Это разные свойства с разными вариантами применения.
ta: *ஆன்டியாலியாசிங் *மற்றும் *குறிப்பை *சரிசெய்வதன் மூலம் வழங்குதல் செய்யும் போது எழுத்துரு எவ்வாறு மென்மையாக்கப்பட வேண்டும் என்பதை நீங்கள் சரிசெய்யலாம். இவை வெவ்வேறு பண்புகள், வெவ்வேறு பயன்பாட்டு நிகழ்வுகளுடன்.
uk: Ви можете налаштувати спосіб згладжування шрифту під час візуалізації, налаштувавши *згладжування* та *підказки*. Це різні властивості з різними випадками використання.
zh_hant: 你可以透過調整*抗鋸齒*和*微調*（hinting）來改變字型算圖平滑效果，這兩種屬性針對不同需求適用。

source: Antialiasing controls how glyph edges should be smoothed out when rasterizing the font. The default antialiasing method (**Grayscale**) works well on every display technology. However, at small sizes, grayscale antialiasing may result in fonts looking blurry.
ga: Rialaíonn antialiasing conas ba chóir imill glyph a smoothed amach nuair a rasterizing an cló. Oibríonn an modh réamhshocraithe antialiasing (** Grayscale **) go maith ar gach teicneolaíocht taispeána. Mar sin féin, ag méideanna beaga, d'fhéadfadh clónna a bheith ag breathnú blurry mar thoradh ar fhrithaliasing liathscála.
it: L'antialiasing controlla come i bordi dei glifi vengono smussati durante la rasterizzazione del font. Il metodo di antialiasing predefinito, in scala di grigi (**Grayscale**), funziona bene su tutte le tecnologie di display. Tuttavia, a piccole dimensioni, l'antialiasing in scala di grigi può far apparire i font sfocati.
ru: Antialiasing (Сглаживание) определяет, насколько сглаживаются края символов при растеризации шрифта. Метод сглаживания по умолчанию (**Grayscale**) хорошо работает на всех дисплеях. Однако, при малых размерах, сглаживание в оттенках серого может привести к тому, что шрифты будут выглядеть размытыми.
ta: எழுத்துருவை ராச்டர்சிங் செய்யும் போது கிளிஃப் விளிம்புகள் எவ்வாறு மென்மையாக்கப்பட வேண்டும் என்பதை ஆன்டிலிசிங் கட்டுப்படுத்துகிறது. இயல்புநிலை ஆன்டிலியாசிங் முறை (** கிரேச்கேல் **) ஒவ்வொரு காட்சி தொழில்நுட்பத்திலும் நன்றாக வேலை செய்கிறது. இருப்பினும், சிறிய அளவுகளில், கிரேச்கேல் ஆன்டிலியாசிங் எழுத்துருக்கள் மங்கலாக இருக்கும்.
uk: Згладжування контролює, як краї гліфів мають бути згладжені під час растеризації шрифту. Метод згладжування за замовчуванням (**Відтінки сірого**) добре працює з усіма технологіями відображення. Однак за малих розмірів згладжування відтінків сірого може призвести до того, що шрифти виглядатимуть розмитими.
zh_hant: 抗鋸齒決定字型光柵化時字元邊緣的平滑程度。預設的**灰階**抗鋸齒效果適用於所有顯示器，但字型很小時可能會顯得模糊。

source: The antialiasing sharpness can be improved by using LCD subpixel optimization, which exploits the subpixel patterns of most LCD displays by offsetting the font antialiasing on a per-channel basis (red/green/blue). The downside is that this can introduce "fringing" on edges, especially on display technologies that don't use standard RGB subpixels (such as OLED displays).
ga: Is féidir an sharpness antialiasing a fheabhsú trí leas iomlán a bhaint LCD subpixel, a shaothraíonn na patrúin subpixel an chuid is mó taispeántais LCD trí fhritháireamh an antialiasing cló ar bhonn in aghaidh an chainéil (dearg / glas / gorm). Is é an míbhuntáiste gur féidir leis seo "fringing" a thabhairt isteach ar imill, go háirithe ar theicneolaíochtaí taispeána nach n-úsáideann fo-mheascáin caighdeánacha RGB (mar shampla taispeántais OLED).
it: È possibile migliorare la nitidezza dell'antialiasing tramite l'ottimizzazione LCD dei subpixel, che sfrutta il motivo dei subpixel della maggioranza dei display LCD compensando l'antialiasing dei font per canale (rosso/verde/blu). Lo svantaggio è che questo può causare "frange" sui bordi, soprattutto su tecnologie di display che non usano subpixel RGB standard (come i display OLED).
ru: Резкость сглаживания можно повысить с помощью оптимизации субпикселей ЖК-дисплеев, которая использует структуру субпикселей большинства ЖК-дисплеев, смещая сглаживание шрифтов по каналам (красный/зеленый/синий). Недостаток этого подхода заключается в том, что он может привести к появлению "окантовки" по краям, особенно на дисплеях, не использующих стандартные RGB-субпикселы (например, OLED-дисплеи).
ta: எல்சிடி சப் படப்புள்ளி உகப்பாக்கத்தைப் பயன்படுத்துவதன் மூலம் ஆன்டிலியாசிங் கூர்மையை மேம்படுத்தலாம், இது ஒரு சேனல் அடிப்படையில் (சிவப்பு/பச்சை/நீலம்) எழுத்துரு ஆன்டிலியாசிங்கை ஈடுசெய்வதன் மூலம் பெரும்பாலான எல்சிடி காட்சிகளின் சப் படப்புள்ளி வடிவங்களை சுரண்டுகிறது. எதிர்மறையானது என்னவென்றால், இது விளிம்புகளில் "விளிம்பு" ஐ அறிமுகப்படுத்த முடியும், குறிப்பாக நிலையான RGB சப் பிக்சல்களை (OLED டிச்ப்ளேச் போன்றவை) பயன்படுத்தாத காட்சி தொழில்நுட்பங்களில்.
uk: Чіткість згладжування можна покращити за допомогою субпіксельної оптимізації РК-дисплея, яка використовує шаблони субпікселів більшості РК-дисплеїв шляхом компенсації згладжування шрифту на основі кожного каналу (червоний/зелений/синій). Недоліком є те, що це може призвести до «бахроми» на краях, особливо на технологіях відображення, які не використовують стандартні субпікселі RGB (наприклад, OLED-дисплеї).
zh_hant: 你可以透過 LCD 子像素優化來增強鋸齒平滑的銳利度，這技巧會根據 LCD 顯示器的紅綠藍子像素排列，對每個色頻分開運算。但缺點是遇到非標準 RGB 子像素排列的顯示器（如 OLED）時，邊緣可能會出現色邊。

source: In most games, it's recommended to stick to the default **Grayscale** antialiasing. For non-game applications, LCD subpixel optimization is worth exploring.
ga: I bhformhór na gcluichí, moltar cloí leis an réamhshocrú **Grayscale** antialiasing. Maidir le hiarratais neamh-chluiche, is fiú leas iomlán a bhaint as subpixel LCD a iniúchadh.
it: Nella maggior parte dei giochi, si consiglia di lasciare l'antialiasing **Grayscale** predefinito. Per applicazioni non legate ai videogiochi, vale la pena provare l'ottimizzazione dei subpixel LCD.
ru: В большинстве игр рекомендуется использовать сглаживание по умолчанию (**Grayscale**). Для неигровых приложений стоит рассмотреть возможность оптимизации субпикселей ЖК-дисплея.
ta: பெரும்பாலான விளையாட்டுகளில், இயல்புநிலை ** கிரேச்கேல் ** ஆன்டிலியாசிங்கில் ஒட்டிக்கொள்ள பரிந்துரைக்கப்படுகிறது. விளையாட்டு அல்லாத பயன்பாடுகளுக்கு, எல்சிடி சப் படப்புள்ளி தேர்வுமுறை ஆராய்வது மதிப்பு.
uk: У більшості ігор рекомендується використовувати стандартне згладжування **Відтінки сірого**. Для неігрових додатків варто дослідити субпіксельну оптимізацію РК-дисплея.
zh_hant: 大多數遊戲建議使用預設 **灰階** 抗鋸齒。非遊戲應用則可考慮 LCD 子像素優化。

source: Font antialiasing comparison
ga: Comparáid antialiasing cló
it: Confronto tra antialiasing dei font
ru: Сравнение сглаживания шрифтов
ta: எழுத்துரு ஆன்டிலியாசிங் ஒப்பீடு
uk: Порівняння згладжування шрифтів
zh_hant: 抗鋸齒視覺比較

source: From top to bottom: Disabled, Grayscale, LCD Subpixel (RGB)
ga: Ó bhun go barr: Díchumasaithe, Liathscála, LCD Subpixel (RGB)
it: Dall'alto verso il basso: Disabled, Grayscale, LCD Subpixel (RGB)
ru: Сверху вниз: Disabled (отключено), Grayscale (оттенки серого), LCD Subpixel (субпиксельный ЖК-дисплей) (RGB)
ta: மேலிருந்து கீழாக: முடக்கப்பட்ட, கிரேச்கேல், எல்சிடி சப் படப்புள்ளி (ஆர்சிபி)
uk: Зверху вниз: вимкнено, відтінки сірого, РК-субпіксель (RGB)
zh_hant: 由上至下：停用、灰階、LCD 子像素 (RGB)

source: Antialiasing cannot be changed on :ref:`MSDF-rendered fonts <doc_using_fonts_msdf>` – these are always rendered with grayscale antialiasing.
ga: Ní féidir frithaliasing a athrú ar :ref:`clónna rindreáilte MSDF <doc_using_fonts_msdf>` – rindreáiltear iad seo i gcónaí le frithaliasú liathscála.
it: Non è possibile cambiare l'antialiasing sui :ref:`font renderizzati con MSDF <doc_using_fonts_msdf>`: questi sono sempre renderizzati con l'antialiasing in scala di grigi.
ru: Antialiasing (Сглаживание) нельзя изменить для шрифтов, :ref:`отрисованных с помощью MSDF <doc_using_fonts_msdf>` – они всегда отрисовываются с использованием сглаживания в оттенках серого.
ta: ஆன்டிலியாசிங்கை மாற்ற முடியாது: குறிப்பு: `எம்.எச்.டி.எஃப்-ரெண்டர் செய்யப்பட்ட எழுத்துருக்கள் <doc_using_fonts_msdf>`-இவை எப்போதும் கிரேச்கேல் ஆன்டிலியாசிங்கால் வழங்கப்படுகின்றன.
uk: Згладжування не можна змінити на :ref:`шрифтах, відтворених MSDF <doc_using_fonts_msdf>` – вони завжди відображаються зі згладжуванням у відтінках сірого.
zh_hant: :ref:`MSDF 算繪字型 <doc_using_fonts_msdf>` 無法調整抗鋸齒，只能用灰階抗鋸齒。

source: Hinting
ga: Leidiú
ru: Hinting (сглаживание контура шрифта)
ta: குறிப்பு
uk: Підказка
zh_hant: 微調（Hinting）

source: Hinting controls how aggressively glyph edges should be snapped to pixels when rasterizing the font. **None** results in the smoothest appearance, which can make the font look blurry at small sizes. **Light** (default) is sharper by snapping glyph edges to pixels on the Y axis only, while **Full** is even sharper by snapping glyph edges to pixels on both X and Y axes. Depending on personal preference, you may prefer using one hinting mode over the other.
ga: Rialaíonn leidiú conas ba chóir imill glyph ionsaitheach a snapped le picteilíní nuair a rasterizing an cló. **None ** mar thoradh ar an gcuma is réidhe, rud a d'fhéadfadh cuma doiléir a chur ar an gcló ar mhéideanna beaga. ** Tá solas ** (réamhshocrú) níos géire trí imill glyph a léim chuig picteilíní ar an ais Y amháin, agus tá ** Iomlán ** níos géire fós trí imill glyph a léim chuig picteilíní ar aiseanna X agus Y araon. Ag brath ar rogha phearsanta, b'fhéidir gurbh fhearr leat modh leideanna amháin a úsáid thar an gceann eile.
it: L'hinting controlla l'aggressività con cui i bordi dei glifi devono essere allineati ai pixel durante la rasterizzazione del font. **None** produce l'aspetto più uniforme, che può rendere il font sfocato a piccole dimensioni. **Light** (predefinito) è più nitido, allineando i bordi dei glifi ai pixel solo sull'asse Y. **Full** è ancora più nitido, allineando i bordi dei glifi ai pixel sia sull'asse X sia sull'asse Y. A seconda delle preferenze personali, potresti preferire utilizzare una modalità di hinting rispetto all'altra.
ru: Hinting (Хинтинг) управляет степенью агрессивности привязки краев глифов к пикселям при растрировании шрифта. **None** обеспечивает максимально плавный вид, что может привести к размытию шрифта при малых размерах. **Light** (по умолчанию) обеспечивает более чёткую привязку краев глифов к пикселям только по оси Y, а **Full** — ещё более чёткую привязку краев глифов к пикселям как по оси X, так и по оси Y. В зависимости от личных предпочтений, вы можете использовать один из режимов хинтинга.
ta: எழுத்துருவை ராச்டரைசிங் செய்யும் போது கிளிஃப் விளிம்புகளை பிக்சல்களுக்கு எவ்வளவு ஆக்ரோசமாக ஒடி இருக்க வேண்டும் என்பதை குறிப்பு கட்டுப்படுத்துகிறது. ** எதுவுமில்லை ** மென்மையான தோற்றத்தில் விளைகிறது, இது எழுத்துரு சிறிய அளவுகளில் மங்கலாக தோற்றமளிக்கும். . தனிப்பட்ட விருப்பத்தைப் பொறுத்து, மற்றொன்றுக்கு ஒரு குறிப்பு பயன்முறையைப் பயன்படுத்த விரும்பலாம்.
uk: Підказки контролюють, наскільки агресивно краї гліфів мають бути прив’язані до пікселів під час растеризації шрифту. **Немає** забезпечує максимально гладкий вигляд, через що шрифт може виглядати розмитим при малих розмірах. **Світлий** (за замовчуванням) є чіткішим завдяки прив’язці країв гліфа до пікселів лише на осі Y, тоді як **Повний** є ще чіткішим завдяки прив’язці країв гліфа до пікселів на обох осях X і Y. Залежно від особистих уподобань, ви можете віддати перевагу використанню одного режиму підказки над іншим.
zh_hant: 微調（Hinting）決定字元邊緣在光柵化時對齊像素的強度。**無** 最平滑但小字型易模糊，**淺**（預設）會將字元高低對齊像素更清楚，**完整** 則將橫直兩軸都對齊像素，效果最銳利。可依個人喜好選擇模式。

source: Font hinting comparison
ga: Comparáid leideanna cló
it: Confronto tra hinting dei font
ru: Сравнение hinting шрифтов
ta: எழுத்துரு குறிப்பு ஒப்பீடு
uk: Порівняння підказок шрифту
zh_hant: 微調視覺比較

source: From top to bottom: None, Light, Full hinting
ga: Ó bhun go barr: None, Light, Full hinting
it: Dall'alto verso il basso: hinting None, Light, Full
ru: Сверху вниз: None, Light, Full hinting
ta: மேலிருந்து கீழாக: எதுவுமில்லை, ஒளி, முழு குறிப்பு
uk: Зверху вниз: жодного, легкого, повного підказування
zh_hant: 由上至下：無、淺、完整微調
