Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: In the **GUI > Theme** section of the advanced Project Settings, you can choose how the default font should be rendered:
es: En la sección **GUI > Tema** de la Configuración avanzada del proyecto, puedes elegir cómo se debe representar la fuente predeterminada:
ga: Sa rannán **GUI > Téama** de na hardsocruithe tionscadail, is féidir leat a roghnú conas ba cheart an cló réamhshocraithe a rindreáil:
ru: В разделе **GUI > Theme** расширенных настроек проекта вы можете выбрать способ отображения шрифта по умолчанию:
ta: மேம்பட்ட திட்ட அமைப்புகளின் ** GUI> கருப்பொருள் ** பிரிவில், இயல்புநிலை எழுத்துரு எவ்வாறு வழங்கப்பட வேண்டும் என்பதை நீங்கள் தேர்வு செய்யலாம்:
uk: У розділі **GUI > Theme** розширених налаштувань проекту ви можете вибрати спосіб відображення шрифту за замовчуванням:
zh_hant: 在進階專案設定的 **GUI > 主題** 區段，你可以調整預設字型的算繪方式：

source: **Default Font Antialiasing:** Controls the :ref:`antialiasing <doc_using_fonts_antialiasing>` method used for the default project font.
es: **Suavizado de fuente predeterminado:** Controla el método :ref:`antialiasing <doc_using_fonts_antialiasing>` utilizado para la fuente del proyecto predeterminada.
ga: ** Cló Réamhshocraithe Antialiasing:** Rialaíonn sé an modh :ref:`antialiasing <doc_using_fonts_antialiasing>` a úsáidtear don chló réamhshocraithe tionscadail.
ru: **Default Font Antialiasing:** Управляет методом :ref:`antialiasing <doc_using_fonts_antialiasing>`, используемым для шрифта проекта по умолчанию.
ta: **Default Font Antialiasing:** Controls the :ref:`antialiasing <doc_using_fonts_antialiasing>` method used க்கு the இயல்புநிலை திட்டம் font.
uk: **Згладжування шрифту за замовчуванням:** Керує методом :ref:`antialiasing <doc_using_fonts_antialiasing>`, що використовується для шрифту проекту за замовчуванням.
zh_hant: **預設字型抗鋸齒：** 控制預設專案字型的 :ref:`抗鋸齒 <doc_using_fonts_antialiasing>` 方法。

source: **Default Font Hinting:** Controls the :ref:`hinting <doc_using_fonts_hinting>` method used for the default project font.
es: **Sugerencia de fuente predeterminada:** Controla el método :ref:`hinting <doc_using_fonts_hinting>` utilizado para la fuente del proyecto predeterminada.
ga: **Leid Cló Réamhshocraithe:** Rialaíonn sé an modh :ref:`hinting <doc_using_fonts_hinting>` a úsáidtear don chló réamhshocraithe tionscadail.
ru: **Default Font Hinting:** Управляет методом :ref:`hinting <doc_using_fonts_hinting>`, используемым для шрифта проекта по умолчанию.
ta: **Default Font Hinting:** Controls the :ref:`hinting <doc_using_fonts_hinting>` method used க்கு the இயல்புநிலை திட்டம் font.
uk: **Підказка шрифту за замовчуванням:** Керує методом :ref:`hinting <doc_using_fonts_hinting>`, що використовується для шрифту проекту за замовчуванням.
zh_hant: **預設字型微調：** 決定預設專案字型用的 :ref:`微調 <doc_using_fonts_hinting>` 方法。

source: **Default Font Subpixel Positioning:** Controls the :ref:`subpixel positioning <doc_using_fonts_subpixel_positioning>` method for the default project font.
es: **Posicionamiento de subpíxeles de fuente predeterminado:** Controla el método :ref:`posicionamiento de subpíxeles <doc_using_fonts_subpixel_positioning>` para la fuente del proyecto predeterminada.
ga: **Suíomh Fophicteilín Cló Réamhshocraithe:** Rialaíonn sé an modh :ref:`suíomh fo-phicteilín <doc_using_fonts_subpixel_positioning>` don chló réamhshocraithe tionscadail.
ru: **Default Font Subpixel Positioning:** Управляет методом :ref:`subpixel positioning <doc_using_fonts_subpixel_positioning>` для шрифта проекта по умолчанию.
ta: **Default Font Subpixel Positioning:** Controls the :ref:`subpixel positioning <doc_using_fonts_subpixel_positioning>` method க்கு the இயல்புநிலை திட்டம் font.
uk: **Субпіксельне розташування шрифту за замовчуванням:** Керує методом :ref:`субпіксельного позиціонування <doc_using_fonts_subpixel_positioning>` для стандартного шрифту проекту.
zh_hant: **預設字型子像素定位：** 決定預設專案字型用的 :ref:`子像素定位 <doc_using_fonts_subpixel_positioning>` 方法。

source: **Default Font Multichannel Signed Distance Field:** If ``true``, makes the default project font use :ref:`MSDF font rendering <doc_using_fonts_msdf>` instead of traditional rasterization.
es: **Campo de distancia con signo multicanal de fuente predeterminada:** Si es ``true``, hace que la fuente del proyecto predeterminada utilice la representación de fuente :ref:`MSDF <doc_using_fonts_msdf>` en lugar de la rasterización tradicional.
ga: **Cló Réamhshocraithe Ilchainéil Réimse Fad Sínithe:** Más ``fíor``, úsáideann an cló réamhshocraithe an tionscadail :ref:`rindreáil cló MSDF <doc_using_fonts_msdf>` in ionad rasterization traidisiúnta.
ru: **Default Font Multichannel Signed Distance Field:** Если ``true``, шрифт проекта по умолчанию использует :ref:`рендеринг шрифта MSDF <doc_using_fonts_msdf>` вместо традиционной растеризации.
ta: **Default Font Multichannel Signed Distance Field:** If ``true``, makes the இயல்புநிலை திட்டம் font use :ref:`MSDF font rendering <doc_using_fonts_msdf>` instead of traditional rasterization.
uk: **Шрифт за замовчуванням, багатоканальне поле відстані зі знаком:** Якщо ``true``, стандартний шрифт проекту використовує :ref:`відтворення шрифту MSDF <doc_using_fonts_msdf>` замість традиційної растеризації.
zh_hant: **預設字型多通道帶符號距離場：** 設為 ``true`` 時，預設專案字型會用 :ref:`MSDF 字型算繪 <doc_using_fonts_msdf>`，而非傳統光柵化。

source: **Default Font Generate Mipmaps:** If ``true``, enables :ref:`mipmap <doc_using_fonts_mipmaps>` generation and usage for the default project font.
es: **Generar Mipmaps de fuentes predeterminadas:** Si es ``true``, habilita la generación y el uso de :ref:`mipmap <doc_using_fonts_mipmaps>` para la fuente de proyecto predeterminada.
ga: **Cló Réamhshocraithe Gin Mipmaps:** Má chumasaíonn ``true``, :ref:`mipmap <doc_using_fonts_mipmaps>` giniúint agus úsáid don chló réamhshocraithe tionscadail.
ru: **Default Font Generate Mipmaps:** Если ``true``, включает генерацию и использование :ref:`mipmap <doc_using_fonts_mipmaps>` для шрифта проекта по умолчанию.
ta: **Default Font Generate Mipmaps:** If ``true``, enables :ref:`mipmap <doc_using_fonts_mipmaps>` generation and usage க்கு the இயல்புநிலை திட்டம் font.
uk: **Шрифт за замовчуванням генерує Mipmaps:** Якщо ``true``, увімкне :ref:`mipmap <doc_using_fonts_mipmaps>` створення та використання шрифту проекту за замовчуванням.
zh_hant: **預設字型產生 Mipmap：** 設為 ``true`` 時，會為預設專案字型產生與使用 :ref:`mipmap <doc_using_fonts_mipmaps>`。

source: These project settings *only* affect the default project font (the one that is hardcoded in the engine binary).
es: Estas configuraciones del proyecto *sólo* afectan a la fuente predeterminada del proyecto (la que está codificada en el binario del motor).
ga: Bíonn tionchar ag na socruithe tionscadail seo *amháin* ar chló réamhshocraithe an tionscadail (an ceann atá crua-chódaithe sa dhénártha inneall).
it: Queste impostazioni del progetto influenzano *solo* il font predefinito del progetto (quello codificato nel binario del motore).
ru: Эти настройки проекта влияют *только* на шрифт проекта по умолчанию (тот, который жестко закодирован в двоичном файле движка).
ta: இந்த திட்ட அமைப்புகள் * இயல்புநிலை திட்ட எழுத்துருவை மட்டுமே பாதிக்கின்றன (எஞ்சின் பைனரியில் ஆர்ட்கோட் செய்யப்பட்டவை).
uk: Ці налаштування проекту *тільки* впливають на шрифт проекту за замовчуванням (той, який жорстко закодовано у двійковому коді двигуна).
zh_hant: 這些專案設定*僅限*影響預設專案字型（即內建字型）。

source: Custom fonts' properties are governed by their respective import options instead. You can use the **Import Defaults** section of the Project Settings dialog to override default import options for custom fonts.
es: Las propiedades de las fuentes personalizadas se rigen por sus respectivas opciones de importación. Puede usar la sección **Valores predeterminados de importación** del cuadro de diálogo Configuración del proyecto para anular las opciones de importación predeterminadas de las fuentes personalizadas.
ga: Tá airíonna clónna saincheaptha á rialú ag a roghanna iompórtála faoi seach ina ionad sin. Is féidir leat an rannán ** Réamhshocruithe Iompórtála** a úsáid sa dialóg Socruithe an Tionscadail chun roghanna iompórtála réamhshocraithe do chlónna saincheaptha a shárú.
it: Le proprietà dei font personalizzati sono invece regolate dalle rispettive opzioni di importazione. È possibile utilizzare la sezione **Importa impostazioni predefinite** della finestra Impostazioni del progetto per sovrascrivere le opzioni di importazione predefinite per i font personalizzati.
ru: Свойства пользовательских шрифтов определяются соответствующими параметрами импорта. Чтобы переопределить параметры импорта по умолчанию для пользовательских шрифтов, используйте раздел **Import Defaults** диалогового окна «Параметры проекта».
ta: தனிப்பயன் எழுத்துருக்களின் பண்புகள் அதற்கு பதிலாக அந்தந்த இறக்குமதி விருப்பங்களால் நிர்வகிக்கப்படுகின்றன. தனிப்பயன் எழுத்துருக்களுக்கான இயல்புநிலை இறக்குமதி விருப்பங்களை மீறுவதற்கு திட்ட அமைப்புகள் உரையாடலின் ** இறக்குமதி இயல்புநிலை ** பகுதியைப் பயன்படுத்தலாம்.
uk: Властивості користувацьких шрифтів натомість регулюються відповідними параметрами імпорту. Ви можете скористатися розділом **Налаштування імпорту за замовчуванням** діалогового вікна налаштувань проекту, щоб змінити параметри імпорту за замовчуванням для користувацьких шрифтів.
zh_hant: 自訂字型的屬性則由其匯入選項決定。你可在專案設定的 **匯入預設值** 區覆蓋自訂字型的匯入選項。

source: Alternatively, you can import any image to be used as a bitmap font. This is only supported for **monospaced** fonts (fonts where each character has the same width). To do so, select the image in the FileSystem dock, go to the Import dock, change its import type to **Font Data (Monospace Image Font)** then click **Reimport**:
uk: Крім того, ви можете імпортувати будь-яке зображення, яке буде використовуватися як растровий шрифт. Це підтримується лише для **моноширинних** шрифтів (шрифтів, у яких кожен символ має однакову ширину). Щоб зробити це, виберіть зображення в док-станції FileSystem, перейдіть до док-станції «Імпорт», змініть його тип імпорту на **Дані шрифту (шрифт моноширинного зображення)**, а потім натисніть **Повторно імпортувати**:

source: Changing import type to Font Data (Monospace Image Font)
uk: Зміна типу імпорту на Дані шрифту (Моноширинні шрифти зображення)

source: Changing import type to **Font Data (Monospace Image Font)**
uk: Зміна типу імпорту на **Дані шрифту (моноширинний шрифт зображення)**

source: **Top:** Additional spacing below glyphs. This is used for multiline text, but also to calculate the minimum size of controls such as :ref:`class_Label` and :ref:`class_Button`.
uk: **Вгорі:** Додатковий інтервал під гліфами. Це використовується для багаторядкового тексту, а також для обчислення мінімального розміру елементів керування, таких як :ref:`class_Label` і :ref:`class_Button`.

source: System fonts are a different type of resource compared to imported fonts. They are never actually imported into the project, but are loaded at run-time. This has 2 benefits:
uk: Системні шрифти — це інший тип ресурсу порівняно з імпортованими шрифтами. Вони насправді ніколи не імпортуються в проект, а завантажуються під час виконання. Це має 2 переваги:
