Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_navigation.po
Languages: ga, ru, ta, uk, zh_tw

source: Keyboard/Controller Navigation and Focus
ga: Loingseoireacht agus Fócas Méarchláir/Rialaitheoir
ru: Keyboard/Controller Navigation и Focus
ta: விசைப்பலகை/கட்டுப்படுத்தி வழிசெலுத்தல் மற்றும் கவனம்
uk: Навігація з клавіатури/контролера та фокус
zh_tw: 鍵盤／控制器導覽與焦點

source: It is a common requirement for a user interface to have full keyboard and controller support for navigation and interaction. There are two main reasons why this is beneficial for projects: improved accessibility (not everyone can use mouse or touch controls for interactions), and getting your project ready for :ref:`consoles <doc_consoles>` (or just for people who prefer to game with a controller on PC).
ga: Is ceanglas coiteann é go mbeadh tacaíocht iomlán mhéarchláir agus rialtóra le haghaidh loingseoireachta agus idirghníomhaithe ag comhéadan úsáideora. Tá dhá phríomhchúis go bhfuil sé seo tairbheach do thionscadail: inrochtaineacht fheabhsaithe (ní féidir le gach duine rialtáin luiche nó tadhaill a úsáid le haghaidh idirghníomhaíochtaí), agus do thionscadal a ullmhú le haghaidh :ref:`consoles <doc_consoles>` (nó do dhaoine ar fearr leo cluiche le rialtóir ar ríomhaire).
ru: Полная поддержка клавиатуры и контроллера для навигации и взаимодействия с пользовательским интерфейсом является распространённым требованием. Это полезно для проектов по двум основным причинам: повышение доступности (не все могут использовать мышь или сенсорное управление для взаимодействия) и подготовка проекта к :ref:`consoles <doc_consoles>` (или просто для тех, кто предпочитает играть с контроллером на ПК).
ta: வழிசெலுத்தல் மற்றும் தொடர்புக்கு முழு விசைப்பலகை மற்றும் கட்டுப்பாட்டு ஆதரவைக் கொண்டிருப்பது பயனர் இடைமுகத்திற்கு பொதுவான தேவை. இது திட்டங்களுக்கு நன்மை பயக்கும் என்பதற்கு இரண்டு முக்கிய காரணங்கள் உள்ளன: மேம்பட்ட அணுகல் (எல்லோரும் இடைவினைகளுக்கு சுட்டி அல்லது தொடு கட்டுப்பாடுகளைப் பயன்படுத்த முடியாது), மற்றும் உங்கள் திட்டத்தை ஆயத்தம் செய்தல்: ref: `கன்சோல்கள் <doc_consoles>` (அல்லது விரும்பும் நபர்களுக்கு கணினியில் ஒரு கட்டுப்படுத்தியுடன் விளையாட்டு).
uk: Загальною вимогою до інтерфейсу користувача є повна підтримка клавіатури та контролера для навігації та взаємодії. Є дві основні причини, чому це корисно для проектів: покращена доступність (не кожен може використовувати мишу або сенсорне керування для взаємодії) і підготовка вашого проекту до :ref:`consoles <doc_consoles>` (або просто для людей, які віддають перевагу гра з контролером на ПК).
zh_tw: 讓使用者介面完整支援鍵盤與控制器的導覽與互動是很常見的需求。這對專案有兩項主要好處：提升無障礙性（並非每個人都能用滑鼠或觸控進行操作），以及讓你的專案能夠在 :ref:`主機 <doc_consoles>` 上運作（或是方便偏好用控制器遊玩的 PC 玩家）。

source: Navigating between UI elements with keyboard or controller is done by changing which node is actively selected. This is also called changing UI focus. Every :ref:`Control <class_Control>` node in Godot is capable of having focus. By default, some control nodes have the ability to automatically grab focus reacting to built-in UI actions such as ``ui_up``, ``ui_down``, ``ui_focus_next``, etc. These actions can be seen in the project settings in the input map and can be modified.
ga: Déantar nascleanúint idir eilimintí Chomhéadain le méarchlár nó rialtóir trí athrú a dhéanamh ar an nód a roghnaítear go gníomhach. Tugtar fócas Chomhéadain atá ag athrú air seo freisin. Tá gach nód :ref:`Control <class_Control>` in Godot in ann díriú. De réir réamhshocraithe, tá sé de chumas ag roinnt nóid rialaithe fócas a fháil go huathoibríoch ag freagairt do ghníomhartha UI ionsuite mar `` ui_up``, ``ui_down``, `` ui_focus_next``, etc. Is féidir na gníomhartha seo a fheiceáil sa tionscadal socruithe sa léarscáil ionchuir agus is féidir iad a mhodhnú.
ru: Навигация между элементами пользовательского интерфейса с помощью клавиатуры или контроллера осуществляется путём смены активного выбранного узла. Это также называется сменой фокуса пользовательского интерфейса. Каждый узел :ref:`Control <class_Control>` в Godot может иметь фокус. По умолчанию некоторые узлы управления автоматически захватывают фокус, реагируя на встроенные действия пользовательского интерфейса, такие как ``ui_up``, ``ui_down``, ``ui_focus_next`` и т. д. Эти действия можно увидеть в настройках проекта на карте входных данных и изменить.
ta: விசைப்பலகை அல்லது கட்டுப்படுத்தியுடன் இடைமுகம் கூறுகளுக்கு இடையில் செல்லவும் எந்த முனை தீவிரமாக தேர்ந்தெடுக்கப்படுகிறது என்பதை மாற்றுவதன் மூலம் செய்யப்படுகிறது. இது இடைமுகம் ஃபோகசை மாற்றவும் என்றும் அழைக்கப்படுகிறது. ஒவ்வொன்றும்: குறிப்பு: `கட்டுப்பாடு <class_control>` கோடோட்டில் உள்ள முனை கவனம் செலுத்தும் திறன் கொண்டது. இயல்பாக, சில கட்டுப்பாட்டு முனைகள் தானாகவே கவனம் செலுத்தும் திறனைக் கொண்டுள்ளன, அதாவது `` ui_up``, `` ui_down``, `` ui_focus_next`` போன்ற இடைமுகம் செயல்களுக்கு உள்ளமைக்கப்பட்ட இடைமுகம் செயல்களுக்கு எதிர்வினையாற்றுகின்றன. இந்த செயல்கள் திட்டத்தில் காணலாம் உள்ளீட்டு வரைபடத்தில் அமைப்புகள் மற்றும் மாற்றலாம்.
uk: Навігація між елементами інтерфейсу користувача за допомогою клавіатури або контролера здійснюється шляхом зміни активного вибраного вузла. Це також називається зміною фокусу інтерфейсу користувача. Кожен вузол :ref:`Control <class_Control>` у Godot може мати фокус. За замовчуванням деякі вузли керування мають можливість автоматично перехоплювати фокус, реагуючи на вбудовані дії інтерфейсу користувача, такі як ``ui_up``, ``ui_down``, ``ui_focus_next`` тощо. Ці дії можна побачити в проекті параметри на карті введення та можуть бути змінені.
zh_tw: 使用鍵盤或控制器在 UI 元素間切換，是透過更改目前被選取的節點，也就是切換 UI 焦點。Godot 中每個 :ref:`Control <class_Control>` 節點都可以取得焦點。預設情況下，部分控制元件會根據內建 UI 動作（如 ``ui_up``、``ui_down``、``ui_focus_next`` 等）自動取得焦點。這些動作可在專案設定的輸入映射中查看與調整。

source: Because these actions are used for focus they should not be used for any gameplay code.
ga: Toisc go n-úsáidtear na gníomhartha seo le haghaidh fócas níor chóir iad a úsáid le haghaidh aon chód gameplay.
ru: Поскольку эти действия используются для фокусировки, их не следует использовать для какого-либо игрового кода.
ta: இந்த செயல்கள் கவனம் செலுத்துவதற்குப் பயன்படுத்தப்படுவதால் அவை எந்த விளையாட்டு குறியீட்டிற்கும் பயன்படுத்தப்படக்கூடாது.
uk: Оскільки ці дії використовуються для фокусування, їх не слід використовувати для коду ігрового процесу.
zh_tw: 這些動作專用於焦點控制，不應用於遊戲玩法相關的程式碼。

source: Node settings
ga: Socruithe nód
ru: Настройки узла
ta: முனை அமைப்புகள்
uk: Налаштування вузла
zh_tw: 節點設定

source: In addition to the built-in logic, you can define what is known as focus neighbors for each individual control node. This allows to finely tune the path the UI focus takes across the user interface of your project. The settings for individual nodes can be found in the Inspector dock, under the "Focus" category of the "Control" section.
ga: Chomh maith leis an loighic ionsuite, is féidir leat a shainiú ar a dtugtar comharsana fócas do gach nód rialaithe aonair. Ligeann sé seo an cosán a thógann fócas an Chomhéadain ar fud comhéadan úsáideora do thionscadail a thiúnadh Is féidir na socruithe do nóid aonair a fháil i nduga an Cigire, faoin gcatagóir “Fócas” den chuid “Rialú”.
ru: Помимо встроенной логики, вы можете определить так называемых соседей фокуса для каждого отдельного узла управления. Это позволяет точно настроить путь фокуса пользовательского интерфейса в пользовательском интерфейсе вашего проекта. Настройки для отдельных узлов можно найти в панели инспектора, в категории "Focus" раздела "Control".
ta: உள்ளமைக்கப்பட்ட தர்க்கத்திற்கு கூடுதலாக, ஒவ்வொரு தனிப்பட்ட கட்டுப்பாட்டு முனைக்கும் கவனம் அண்டை நாடுகள் என்று அழைக்கப்படுவதை நீங்கள் வரையறுக்கலாம். இது உங்கள் திட்டத்தின் பயனர் இடைமுகத்தில் இடைமுகம் கவனம் எடுக்கும் பாதையை நேர்த்தியாக மாற்ற அனுமதிக்கிறது. "கட்டுப்பாடு" பிரிவின் "கவனம்" பிரிவின் கீழ், தனிப்பட்ட முனைகளுக்கான அமைப்புகளை இன்ச்பெக்டர் கப்பல்துறையில் காணலாம்.
uk: На додаток до вбудованої логіки, ви можете визначити так звані сусіди по фокусу для кожного окремого керуючого вузла. Це дозволяє точно налаштувати шлях фокусування інтерфейсу користувача через інтерфейс користувача вашого проекту. Параметри для окремих вузлів можна знайти в доці «Інспектор» у категорії «Фокус» розділу «Керування».
zh_tw: 除了內建的焦點切換邏輯外，你還可以為每個控制元件自訂「鄰近焦點」。這能讓你精確調整 UI 焦點在介面中的移動路徑。各個節點的設定可以在屬性面板的「Control」區塊下「Focus」分類中找到。

source: Neighbor options are used to define nodes for 4-directional navigation, such as using arrow keys or a D-pad on a controller. For example, the bottom neighbor will be used when navigating down with the down arrow or by pushing down on the D-pad. The "Next" and "Previous" options are used with the focus shift button, such as :kbd:`Tab` on desktop operating systems.
ga: Úsáidtear roghanna comharsana chun nóid a shainiú le haghaidh nascleanúint 4-threorach, mar shampla eochracha saigheada nó D-pad a úsáid ar rialtóir. Mar shampla, úsáidfear an comharsa bun agus tú ag nascleanúint síos leis an saighead síos nó trí bhrú síos ar an D-pad. Úsáidtear na roghanna “Ar Aghaidh” agus “Roimhe Seo” leis an gcnaipe aistrithe fócas, mar shampla:kbd: `Tab` ar chórais oibriúcháin deisce.
ru: Параметры "Neighbor" используются для определения узлов для навигации в четырёх направлениях, например, с помощью клавиш со стрелками или крестовины на контроллере. Например, нижний сосед будет использоваться при навигации вниз с помощью стрелки вниз или нажатия на крестовине. Параметры "Next" и "Previous" используются с кнопкой переключения фокуса, например, :kbd:`Tab` в настольных операционных системах.
ta: அம்பு விசைகளைப் பயன்படுத்துதல் அல்லது ஒரு கட்டுப்படுத்தியில் டி-பேட் போன்ற 4-திசை வழிசெலுத்தலுக்கான முனைகளை வரையறுக்க அண்டை விருப்பங்கள் பயன்படுத்தப்படுகின்றன. எடுத்துக்காட்டாக, கீழ் அம்புக்குறியுடன் செல்லும்போது அல்லது டி-பேட் கீழே தள்ளுவதன் மூலம் கீழே அண்டை பயன்படுத்தப்படும். "அடுத்த" மற்றும் "முந்தைய" விருப்பங்கள் கவனம் சிப்ட் பொத்தானைக் கொண்டு பயன்படுத்தப்படுகின்றன, அதாவது: KBD: `TAB` டெச்க்டாப் இயக்க முறைமைகளில்.
uk: Параметри сусідів використовуються для визначення вузлів для 4-направленої навігації, наприклад за допомогою клавіш зі стрілками або D-pad на контролері. Наприклад, нижній сусід буде використано під час навігації вниз за допомогою стрілки вниз або натискання D-pad. Параметри «Далі» та «Попередній» використовуються разом із кнопкою переміщення фокусу, наприклад :kbd:`Tab` в операційних системах для настільних ПК.
zh_tw: 鄰近選項用來定義四向導覽時的節點，例如使用鍵盤方向鍵或控制器的十字鍵。舉例來說，往下導覽時（按下方向鍵下或十字鍵下），會移動到下方鄰近節點。「下一個」與「上一個」則搭配焦點切換按鍵使用，例如桌面作業系統上的 :kbd:`Tab`。

source: A node can lose focus if it becomes hidden.
ga: Is féidir le nód fócas a chailleadh má éiríonn sé i bhfolach.
ru: Узел может потерять фокус, если он станет скрытым.
ta: ஒரு முனை மறைக்கப்பட்டால் அது கவனத்தை இழக்க நேரிடும்.
uk: Вузол може втратити фокус, якщо він стане прихованим.
zh_tw: 若節點被隱藏，將會失去焦點。

source: The mode setting defines how a node can be focused. **All** means a node can be focused by clicking on it with the mouse, or selecting it with a keyboard or controller. **Click** means it can only be focused on by clicking on it. Finally, **None** means it can't be focused at all. Different control nodes have different default settings for this based on how they are typically used, for example, :ref:`Label <class_Label>` nodes are set to "None" by default, while :ref:`buttons <class_Button>` are set to "All".
ga: Sainmhíníonn an socrú mód conas is féidir nód a dhíriú. Ciallaíonn **Gach** gur féidir nód a dhíriú trí chliceáil air leis an luch, nó é a roghnú le méarchlár nó le rialtóir. Ciallaíonn **Cliceáil** nach féidir díriú air ach trí chliceáil air. Ar deireadh, ciallaíonn **Dada** nach féidir é a dhíriú ar chor ar bith. Tá socruithe réamhshocraithe difriúla ag nóid rialaithe éagsúla dó seo bunaithe ar an gcaoi a n-úsáidtear go hiondúil iad, mar shampla, :ref:`Lipéad <class_Label>` socraítear nóid go "None" de réir réamhshocraithe, agus :ref:`cnaipí <class_Button>` iad socraithe go "Gach".
ru: Настройка режима определяет, как узел может быть сфокусирован. **All** означает, что узел можно сфокусировать, щёлкнув по нему мышью или выбрав его с помощью клавиатуры или контроллера. **Click** означает, что узел может быть сфокусирован только щелчком мыши. Наконец, **None** означает, что узел вообще не может быть сфокусирован. Различные узлы управления имеют различные настройки по умолчанию в зависимости от того, как они обычно используются, например, узлы :ref:`Label <class_Label>` по умолчанию имеют значение "None", а узлы :ref:`buttons <class_Button>` имеют значение "All".
ta: ஒரு முனை எவ்வாறு கவனம் செலுத்த முடியும் என்பதை பயன்முறை அமைப்பு வரையறுக்கிறது. ** அனைத்தும் ** என்றால் ஒரு முனை சுட்டியுடன் அதைக் சொடுக்கு செய்வதன் மூலம் அல்லது விசைப்பலகை அல்லது கட்டுப்படுத்தியுடன் தேர்ந்தெடுப்பதன் மூலம் கவனம் செலுத்தலாம். ** சொடுக்கு ** என்றால் அதைக் சொடுக்கு செய்வதன் மூலம் மட்டுமே கவனம் செலுத்த முடியும். இறுதியாக, ** எதுவுமில்லை ** என்றால் அதை கவனம் செலுத்த முடியாது. வெவ்வேறு கட்டுப்பாட்டு முனைகள் இதற்கு வெவ்வேறு இயல்புநிலை அமைப்புகளைக் கொண்டுள்ளன, எடுத்துக்காட்டாக, அவை எவ்வாறு பயன்படுத்தப்படுகின்றன என்பதை அடிப்படையாகக் கொண்டு,: `லேபிள் <class_label>` முனைகள் இயல்பாக "எதுவுமில்லை" என அமைக்கப்படுகின்றன, அதே நேரத்தில்: குறிப்பு: `பொத்தான்கள் <class_button>` "அனைத்தும்" என அமைக்கவும்.
uk: Налаштування режиму визначає спосіб фокусування вузла. **Усі** означає, що вузол можна сфокусувати, клацнувши його мишею або вибравши за допомогою клавіатури чи контролера. **Натиснути** означає, що на ньому можна сфокусуватися, лише клацнувши його. Нарешті, **Немає** означає, що його взагалі неможливо сфокусувати. Різні керуючі вузли мають різні параметри за замовчуванням для цього залежно від того, як вони зазвичай використовуються, наприклад, для вузлів :ref:`Label <class_Label>` за замовчуванням встановлено значення «Немає», а для :ref:`buttons <class_Button>` встановіть «Все».
zh_tw: 模式設定決定節點可如何取得焦點。**All** 代表可以被滑鼠點擊，或用鍵盤／控制器選取以取得焦點。**Click** 則僅能透過滑鼠點擊取得焦點。**None** 則完全無法取得焦點。不同控制元件根據其用途會有不同預設值，例如 :ref:`Label <class_Label>` 預設為「None」，而 :ref:`按鈕 <class_Button>` 預設為「All」。

source: Make sure to properly configure your scenes for focus and navigation. If a node has no focus neighbor configured, the engine will try to guess the next control automatically. This may result in unintended behavior, especially in a complex user interface that doesn't have well-defined vertical or horizontal navigation flow.
ga: Bí cinnte a chumrú i gceart do radhairc le haghaidh fócas agus nascleanúint. Mura bhfuil comharsa fócasaithe ag nód, déanfaidh an t-inneall iarracht an chéad rialú eile a thomhas go huathoibríoch. D’fhéadfadh iompar neamhbheartaithe a bheith mar thoradh air seo, go háirithe i gcomhéadan casta úsáideora nach bhfuil sreabhadh loingseoireachta ingearach nó cothrománach dea-shainithe aige.
ru: Убедитесь, что сцены правильно настроены для фокусировки и навигации. Если у узла не настроен соседний элемент фокусировки, движок попытается автоматически определить следующий элемент управления. Это может привести к непреднамеренному поведению, особенно в сложном пользовательском интерфейсе без четко выраженной вертикальной или горизонтальной навигации.
ta: கவனம் மற்றும் வழிசெலுத்தலுக்காக உங்கள் காட்சிகளை சரியாக உள்ளமைக்கவும். ஒரு முனைக்கு கவனம் செலுத்தவில்லை என்றால், என்சின் அடுத்த கட்டுப்பாட்டை தானாகவே யூகிக்க முயற்சிக்கும். இது திட்டமிடப்படாத நடத்தைக்கு வழிவகுக்கும், குறிப்பாக ஒரு சிக்கலான பயனர் இடைமுகத்தில் நன்கு வரையறுக்கப்பட்ட செங்குத்து அல்லது கிடைமட்ட வழிசெலுத்தல் ஓட்டத்தைக் கொண்டிருக்கவில்லை.
uk: Обов’язково правильно налаштуйте сцени для фокусування та навігації. Якщо вузол не має налаштованого сусіда по фокусу, система намагатиметься автоматично вгадати наступний елемент керування. Це може призвести до ненавмисної поведінки, особливо в складному інтерфейсі користувача, який не має чітко визначеного вертикального чи горизонтального потоку навігації.
zh_tw: 請務必正確設定場景中的焦點與導覽。如果節點未設定鄰近焦點，Godot 會自動嘗試推測下一個控制元件，這可能導致非預期行為，尤其是在沒有明確垂直或水平導覽結構的複雜 UI 介面中。

source: Necessary code
ga: Cód riachtanach
ru: Необходимый код
ta: தேவையான குறியீடு
uk: Необхідний код
zh_tw: 必要程式碼

source: For keyboard and controller navigation to work correctly, any node must be focused by using code when the scene starts. Without doing this, pressing buttons or keys won't do anything.
ru: Для корректной работы навигации с помощью клавиатуры и контроллера необходимо, чтобы любой узел был сфокусирован с помощью кода при запуске сцены. Без этого нажатие кнопок или клавиш не будет работать.
uk: Для коректної роботи навігації за допомогою клавіатури та контролера будь-який вузол має бути сфокусований за допомогою коду під час запуску сцени. Без цього натискання кнопок або клавіш нічого не дасть.
zh_tw: 要讓鍵盤與控制器導覽正常運作，場景啟動時必須用程式碼將某個節點設為焦點。否則按下按鍵或按鈕不會有任何效果。

source: You can use the :ref:`Control.grab_focus() <class_Control_method_grab_focus>` method to focus a control. Here is a basic example of setting initial focus with code:
ru: Для фокусировки элемента управления можно использовать метод :ref:`Control.grab_focus() <class_Control_method_grab_focus>`. Вот простой пример установки начального фокуса с помощью кода:
uk: Ви можете використовувати метод :ref:`Control.grab_focus() <class_Control_method_grab_focus>` для фокусування елемента керування. Ось базовий приклад встановлення початкового фокуса за допомогою коду:
zh_tw: 你可以使用 :ref:`Control.grab_focus() <class_Control_method_grab_focus>` 方法讓控制項取得焦點。以下是用程式碼設定初始焦點的基本範例：

source: Now when the scene starts, the "Start Button" node will be focused, and the keyboard or a controller can be used to navigate between it and other UI elements.
ru: Теперь при запуске сцены узел "Start Button" будет в фокусе, и для навигации между ним и другими элементами пользовательского интерфейса можно будет использовать клавиатуру или контроллер.
uk: Тепер, коли сцена починається, вузол "Кнопка запуску" буде у фокусі, і для навігації між ним та іншими елементами інтерфейсу можна буде використовувати клавіатуру або контролер.
zh_tw: 現在，當場景啟動時，"Start Button" 節點會取得焦點，並可使用鍵盤或控制器在它與其他 UI 元素間導覽。

source: For keyboard and controller navigation to work correctly, any node must be focused on using code when the scene starts. Without doing this, pressing buttons or keys won't do anything. Here is a basic example of setting initial focus with code:
ga: Ionas go n-oibreoidh loingseoireacht méarchláir agus an rialaitheora i gceart, caithfear aon nód a dhíriú ar chód a úsáid nuair a Gan é seo a dhéanamh, ní dhéanfaidh cnaipí nó eochracha a bhrú aon rud. Seo sampla bunúsach de fhócas tosaigh a shocrú le cód:
ta: விசைப்பலகை மற்றும் கட்டுப்படுத்தி வழிசெலுத்தல் சரியாக வேலை செய்ய, காட்சி தொடங்கும் போது எந்த முனையும் குறியீட்டைப் பயன்படுத்துவதில் கவனம் செலுத்த வேண்டும். இதைச் செய்யாமல், பொத்தான்கள் அல்லது விசைகளை அழுத்துவது எதுவும் செய்யாது. குறியீட்டைக் கொண்டு ஆரம்ப கவனத்தை அமைப்பதற்கான அடிப்படை எடுத்துக்காட்டு இங்கே:

source: Now when the scene starts the "Start Button" node will be focused, and the keyboard or a controller can be used to navigate between it and other UI elements.
ga: Anois nuair a thosaíonn an radharc beidh an nód “Cnaipe Tosaigh” dírithe, agus is féidir an méarchlár nó an rialtóir a úsáid chun nascleanúint a dhéanamh idir é agus eilimintí Chomhéadain eile.
ta: இப்போது காட்சி தொடங்கும் போது "தொடக்க பொத்தான்" முனை கவனம் செலுத்தப்படும், மேலும் விசைப்பலகை அல்லது கட்டுப்படுத்தி அதற்கும் பிற இடைமுகம் கூறுகளுக்கும் இடையில் செல்லவும் பயன்படுத்தப்படலாம்.
