Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_containers.po
Languages: ga, it, ru, ta, uk, zh_hant

source: Using Containers
ga: Coimeádáin a úsáid
it: Utilizzare i Container
ru: Использование контейнеров
ta: கொள்கலன்களைப் பயன்படுத்துதல்
uk: Використання контейнерів
zh_hant: 使用容器

source: :ref:`Anchors <doc_size_and_anchors>` are an efficient way to handle different aspect ratios for basic multiple resolution handling in GUIs.
ga: :ref:`Anchors <doc_size_and_anchors>` chun cóimheasa gné éagsúla a láimhseáil le haghaidh láimhseáil bhunúsach iolrach i GUIanna.
it: Gli :ref:`ancoraggi <doc_size_and_anchors>` sono un modo efficiente per gestire diversi rapporti di aspetto per la gestione basilare di più risoluzioni nelle interfacce grafiche utente (GUI).
ru: :ref:`Якоря <doc_size_and_anchors>` — эффективный способ обработки различных соотношений сторон для базовой поддержки нескольких разрешений в графических интерфейсах.
ta: :ref:`Anchors <doc_size_and_anchors>` அரே an efficient way பெறுநர் கைப்பிடி different aspect ratios க்கு அடிப்படை multiple பகுத்தல் handling in GUIs.
uk: :ref:`Якорі <doc_size_and_anchors>` є ефективним способом обробки різних пропорцій для базової обробки кількох роздільних здатностей у графічних інтерфейсах користувача.
zh_hant: :ref:`錨點 <doc_size_and_anchors>` 是在 GUI 中進行基礎多解析度與不同螢幕比例處理的高效方法。

source: For more complex user interfaces, they can become difficult to use.
ga: Maidir le comhéadain úsáideora níos casta, is féidir leo a bheith deacair a úsáid.
it: Per le interfacce utente più complesse, potrebbero diventare difficile da utilizzare.
ru: Для более сложных интерфейсов этот подход может оказаться неудобным.
ta: மிகவும் சிக்கலான பயனர் இடைமுகங்களுக்கு, அவை பயன்படுத்த கடினமாகிவிடும்.
uk: Для більш складних користувальницьких інтерфейсів вони можуть стати складнішими у використанні.
zh_hant: 對於更複雜的使用者介面，錨點就會變得難以操作。

source: This is often the case of games, such as RPGs, online chats, tycoons or simulations. Another common case where more advanced layout features may be required is in-game tools (or simply just tools).
ga: Is minic a tharlaíonn sé seo le cluichí, mar shampla RPGanna, comhráite ar líne, tycoons nó insamhaltaí. Cás coitianta eile ina bhféadfadh gnéithe leagan amach níos airde a bheith ag teastáil ná uirlisí in-chluiche (nó uirlisí amháin).
it: Questo è spesso il caso di giochi come gli RPG, le chat online, i tycoon o le simulazioni. Un altro caso comune in cui potrebbero essere necessarie funzionalità più avanzate di layout sono strumenti di gioco (o semplicemente strumenti).
ru: В играх такое часто бывает: например, в RPG, онлайн-чатах, стратегиях или симуляторах. Ещё один пример, где нужны продвинутые средства компоновки — игровые инструменты (или просто инструменты).
ta: இது பெரும்பாலும் ஆர்பிசிக்கள், நிகழ்நிலை அரட்டைகள், அதிபர்கள் அல்லது உருவகப்படுத்துதல்கள் போன்ற விளையாட்டுகளின் நிலை. மிகவும் மேம்பட்ட தளவமைப்பு நற்பொருத்தங்கள் தேவைப்படும் மற்றொரு பொதுவான வழக்கு விளையாட்டு கருவிகள் (அல்லது வெறுமனே கருவிகள்).
uk: Це часто стосується ігор, таких як RPG, онлайн-чати, магнати або симулятори. Ще один поширений випадок, коли можуть знадобитися більш розширені функції компонування, це інструменти в грі (або просто інструменти).
zh_hant: 這通常發生在遊戲中，例如角色扮演、線上聊天、經營或模擬類型。另一個常見需要進階佈局功能的場景是遊戲內工具（或一般工具）。

source: All these situations require a more capable OS-like user interface, with advanced layout and formatting. For that, :ref:`Containers <class_container>` are more useful.
ga: Éilíonn na cásanna seo go léir comhéadan úsáideora níos cumasaí cosúil le OS, le leagan amach agus formáidiú ardleibhéil. Mar sin, :ref:`Tá coimeádáin <class_container>` níos úsáidí.
it: Tutte queste situazioni richiedono un'interfaccia utente più funzionale, simile a quella di un sistema operativo, con layout e formattazione avanzati. Per questo, i :ref:`Container <class_container>` sono più utili.
ru: Во всех этих случаях нужен более функциональный интерфейс — похожий на ОС, с продвинутой компоновкой и форматированием. В таких случаях лучше подходят :ref:`контейнеры <class_container>`.
ta: இந்த சூழ்நிலைகள் அனைத்திற்கும் மேம்பட்ட தளவமைப்பு மற்றும் வடிவமைப்புடன், மிகவும் திறமையான OS போன்ற பயனர் இடைமுகம் தேவைப்படுகிறது. அதற்காக,: `கொள்கலன்கள் <class_container>` மிகவும் பயனுள்ளதாக இருக்கும்.
uk: Усі ці ситуації вимагають більш потужного користувальницького інтерфейсу, схожого на ОС, із вдосконаленим макетом і форматуванням. Для цього більш корисними є :ref:`контейнери <class_container>`.
zh_hant: 這些情境都需要更強大、類似作業系統的使用者介面，具備進階佈局與格式功能。此時，:ref:`Container <class_container>` 會更適合。

source: Container layout
ga: Leagan amach coimeádá
ru: Компоновка контейнеров
ta: கொள்கலன் தளவமைப்பு
uk: Макет контейнера
zh_hant: 容器佈局

source: Containers provide a huge amount of layout power (as an example, the Godot editor user interface is entirely done using them):
ga: Soláthraíonn coimeádáin méid ollmhór cumhachta leagan amach (mar shampla, déantar comhéadan úsáideora eagarthóra Godot go hiomlán ag baint úsáide as iad):
ru: Контейнеры предоставляют мощные возможности компоновки (например, интерфейс редактора Godot полностью построен на них):
ta: கொள்கலன்கள் ஒரு பெரிய அளவிலான தளவமைப்பு சக்தியை வழங்குகின்றன (உதாரணமாக, கோடோட் எடிட்டர் பயனர் இடைமுகம் அவற்றைப் பயன்படுத்தி முற்றிலும் செய்யப்படுகிறது):
uk: Контейнери забезпечують величезну потужність макета (як приклад, інтерфейс користувача редактора Godot повністю створений з їх використанням):
zh_hant: 容器提供了強大的佈局功能（例如，Godot 編輯器的使用者介面就是完全用容器製作的）：

source: When a :ref:`Container <class_Container>`-derived node is used, all children :ref:`Control <class_Control>` nodes give up their own positioning ability. This means the *Container* will control their positioning and any attempt to manually alter these nodes will be either ignored or invalidated the next time their parent is resized.
ga: Nuair a úsáidtear nód díorthaithe :ref:`Coimeádán <class_Container>`, tugann gach leanbh :ref:`Control <class_Control>` nód a gcumas suite féin suas. Ciallaíonn sé seo go rialóidh an *Coimeádán* a suíomh agus déanfar neamhaird de nó neamhbhailí ar aon iarracht na nóid seo a athrú de láimh an chéad uair eile a athraítear méid a dtuismitheoirí.
it: Quando si usa un nodo derivato da :ref:`Container <class_Container>`, tutti i nodi :ref:`Control <class_Control>` figlio rinunciano alla propria capacità di posizionamento. Ciò significa che il *Container* controllerà il loro posizionamento e qualsiasi tentativo di modifica manuale di questi nodi verrà ignorato o invalidato la prossima volta che il nodo padre viene ridimensionato.
ru: Когда используется узел, производный от :ref:`Контейнера <class_Container>`, все дочерние узлы :ref:`Control <class_Control>` теряют возможность самостоятельного позиционирования. Это означает, что *Контейнер* будет управлять их расположением, а любые попытки ручного изменения этих узлов либо игнорируются, либо сбрасываются при следующем изменении размера родителя.
ta: ஒரு: ref: `கொள்கலன் <class_container>`-பெறப்பட்ட முனை பயன்படுத்தப்படுகிறது, எல்லா குழந்தைகளும்: ref: `கட்டுப்பாடு <class_control>` முனைகள் தங்கள் சொந்த நிலைப்படுத்தும் திறனை விட்டுவிடுகின்றன. இதன் பொருள் * கொள்கலன் * அவர்களின் நிலைப்பாட்டைக் கட்டுப்படுத்தும், மேலும் இந்த முனைகளை கைமுறையாக மாற்றுவதற்கான எந்தவொரு முயற்சியும் அடுத்த முறை அவர்களின் பெற்றோர் மறுஅளவாக்கப்பட்டால் புறக்கணிக்கப்படும் அல்லது செல்லாதது.
uk: Коли використовується похідний вузол :ref:`Container <class_Container>`, усі дочірні вузли :ref:`Control <class_Control>` втрачають власну здатність позиціонування. Це означає, що *Контейнер* контролюватиме їх розташування, і будь-яка спроба вручну змінити ці вузли буде проігнорована або визнана недійсною наступного разу, коли їхній батьківський вузол буде змінено розмір.
zh_hant: 當你使用 :ref:`Container <class_Container>` 衍生節點時，所有作為子項的 :ref:`Control <class_Control>` 節點都會放棄自身定位能力。這表示 *容器* 會接管它們的位置控制，任何手動調整這些節點位置的動作，都會在父節點下次調整大小時被忽略或覆蓋。

source: Likewise, when a *Container* derived node is resized, all its children will be re-positioned according to it, with a behavior based on the type of container used:
ga: Mar an gcéanna, nuair a athraítear méid ar nód díorthaíth* Coimeádán*, déanfar a leanaí go léir a athshuíomh dá réir, le hiompar bunaithe ar an gcineál coimeádáin a úsáidtear:
it: Allo stesso modo, quando un nodo derivato da un *Container* viene ridimensionato, tutti i suoi figli verranno riposizionati di conseguenza, con un comportamento basato sul tipo di contenitore utilizzato:
ru: Аналогично, когда размер производного узла *Container* изменяется, все его дочерние элементы будут перемещены в соответствии с ним, причем поведение будет зависеть от типа используемого контейнера:
ta: அதேபோல், ஒரு * கொள்கலன் * பெறப்பட்ட முனை மறுஅளவாக்கப்பட்டால், அதன் எல்லா குழந்தைகளும் அதன்படி மீண்டும் நிலைநிறுத்தப்படுவார்கள், பயன்படுத்தப்படும் கொள்கலன் வகையின் அடிப்படையில் ஒரு நடத்தை:
uk: Подібним чином, коли змінюється розмір похідного вузла *Container*, усі його дочірні елементи будуть змінено відповідно до нього, поведінка буде залежати від типу використовуваного контейнера:
zh_hant: 同樣地，當 *Container* 衍生節點被調整大小時，它的所有子節點會根據容器類型自動重新定位：

source: Example of *HBoxContainer* resizing children buttons.
ga: Sampla de*HBoxContainer* a athraíonn méid leanaí.
it: Esempio di *HBoxContainer* ridimensionante i pulsanti figlio.
ru: Пример изменения размера дочерних кнопок *HBoxContainer*.
ta: * HboxContainer * குழந்தைகளின் பொத்தான்களின் எடுத்துக்காட்டு.
uk: Приклад зміни розміру дочірніх кнопок *HBoxContainer*.
zh_hant: *HBoxContainer* 調整子按鈕大小的範例。

source: The real strength of containers is that they can be nested (as nodes), allowing the creation of very complex layouts that resize effortlessly.
ga: Is é fíor-neart coimeádáin ná gur féidir iad a neadadh (mar nóid), rud a ligeann leagan amach an-chasta a chruthú a athraíonn méid gan stró.
it: Il vero potenziale dei contenitori è che si possono annidare (come nodi), consentendo la creazione di layout molto complessi che si ridimensionano senza sforzo.
ru: Настоящее преимущество контейнеров заключается в том, что их можно вкладывать друг в друга (как узлы), что позволяет создавать очень сложные макеты, размер которых можно легко изменить.
ta: கொள்கலன்களின் உண்மையான வலிமை என்னவென்றால், அவை கூடு கட்டப்படலாம் (முனைகளாக), மிகவும் சிக்கலான தளவமைப்புகளை உருவாக்க அனுமதிக்கிறது.
uk: Справжня сила контейнерів полягає в тому, що вони можуть бути вкладеними (як вузли), дозволяючи створювати дуже складні макети, які легко змінюють розмір.
zh_hant: 容器最大的優勢在於它們可以巢狀（作為節點），讓你能輕鬆建立可自動調整的複雜佈局。

source: Sizing options
ga: Roghanna méide
it: Opzioni di dimensionamento
ru: Варианты размеров
ta: அளவிடுதல் விருப்பங்கள்
uk: Варіанти розмірів
zh_hant: 尺寸選項

source: When adding a node to a container, the way the container treats each child depends mainly on their *container sizing options*. These options can be found by inspecting the layout of any *Control* that is a child of a *Container*.
ga: Nuair a chuirtear nód le coimeádán, braitheann an bealach a dhéileálann an coimeádán le gach leanbh go príomha ar a roghanna méide coimeádáin*. Is féidir na roghanna seo a fháil trí iniúchadh a dhéanamh ar leagan amach aon *Rialú* atá ina leanbh de*Coimeádáin*.
ru: При добавлении узла в контейнер, то, как контейнер обрабатывает каждый дочерний элемент, в основном зависит от *параметров размера контейнера*. Эти параметры можно найти, изучив структуру любого *Control*, являющегося дочерним элементом *Container*.
ta: ஒரு கொள்கலனில் ஒரு முனையைச் சேர்க்கும்போது, ஒவ்வொரு குழந்தைக்கும் கொள்கலன் சிகிச்சையளிக்கும் விதம் முக்கியமாக அவற்றின் *கொள்கலன் அளவீட்டு விருப்பங்களைப் பொறுத்தது *. ஒரு *கொள்கலன் *குழந்தை என்ற எந்த *கட்டுப்பாட்டின் *தளவமைப்பை ஆய்வு செய்வதன் மூலம் இந்த விருப்பங்களைக் காணலாம்.
uk: Під час додавання вузла до контейнера те, як контейнер обробляє кожного дочірнього елемента, головним чином залежить від його *параметрів розміру контейнера*. Ці параметри можна знайти, перевіривши макет будь-якого *Control*, який є дочірнім елементом *Container*.
zh_hant: 將節點加入容器時，容器如何處理每個子節點，主要取決於它們的 *尺寸旗標*。這些旗標可在 *Container* 的子 *Control* 節點的佈局屬性中找到。

source: Sizing options are independent for vertical and horizontal sizing and not all containers make use of them (but most do):
ga: Tá roghanna méide neamhspleách maidir le méid ingearach agus cothrománach agus ní úsáideann gach coimeádán iad (ach déanann an chuid is mó):
it: Le opzioni di dimensionamento sono indipendenti per il dimensionamento verticale e orizzontale e non tutti i contenitori le utilizzano (ma quasi tutti sì):
ru: Параметры размеров независимы для вертикального и горизонтального размера, и не все контейнеры их используют (но большинство):
ta: அளவிடுதல் விருப்பங்கள் செங்குத்து மற்றும் கிடைமட்ட அளவிற்கு சுயாதீனமானவை, மேலும் அனைத்து கொள்கலன்களும் அவற்றைப் பயன்படுத்துவதில்லை (ஆனால் பெரும்பாலானவை செய்கின்றன):
uk: Параметри розміру незалежні для вертикального та горизонтального розміру, і не всі контейнери використовують їх (але більшість використовує):
zh_hant: 尺寸旗標在垂直和水平方向上是獨立的，雖然不是每種容器都會用到，但大多數容器都會使用這些旗標：

source: **Fill**: Ensures the control *fills* the designated area within the container. No matter if a control *expands* or not (see below), it will only *fill* the designated area when this is toggled on (it is by default).
ga: **Líon**: Cinntíonn sé go líonann an rialú* an limistéar ainmnithe laistigh den choimeádán. Is cuma má leathnaíonn rialú* nó nach bhfuil (féach thíos), ní líonfaidh sé* ach an limistéar ainmnithe nuair a dhéantar é seo a thosú (tá sé de réir réamhshocraithe).
ru: **Fill**: обеспечивает *заполнение* элементом управления указанной области внутри контейнера. Независимо от того, *расширяется* элемент управления или нет (см. ниже), он будет *заполнять* указанную область только при включенном параметре (по умолчанию).
ta: ** நிரப்பு **: கட்டுப்பாட்டை உறுதி செய்கிறது*கொள்கலனுக்குள் நியமிக்கப்பட்ட பகுதியை நிரப்புகிறது*. ஒரு கட்டுப்பாடு * விரிவடைந்தாலும் இல்லாவிட்டாலும் (கீழே காண்க), இது மாற்றப்படும்போது நியமிக்கப்பட்ட பகுதியை மட்டுமே * நிரப்பும் * (இது இயல்பாகவே).
uk: Параметри розміру незалежні для вертикального та горизонтального розміру, і не всі контейнери використовують їх (але більшість використовує).
zh_hant: **填充（Fill）**：確保控制項 *填滿* 容器內指定區域。不論控制項是否 *擴展*（見下方），只有啟用這個選項時（預設為開啟），才會 *填充* 指定區域。

source: **Expand**: Attempts to use as much space as possible in the parent container (in each axis). Controls that don't expand will be pushed away by those that do. Between expanding controls, the amount of space they take from each other is determined by the *Stretch Ratio* (see below). This option is only available when the parent Container is of the right type, for example the *HBoxContainer* has this option for horizontal sizing.
ga: **Leathnaithe**: Déanann iarracht an oiread spáis agus is féidir a úsáid sa choimeádán tuismitheora (i ngach ais). Déanfaidh siad siúd a dhéanann rialuithe nach leathnaíonn a bhrú ar shiúl. Idir rialuithe a leathnú, déantar an méid spáis a thógann siad óna chéile a chinneadh leis an g*Cóimheas Stret* (féach thíos). Níl an rogha seo ar fáil ach amháin nuair a bhíonn an tuismitheoir Coimeádán den chineál ceart, mar shampla tá an rogha seo ag an g*HBoxContainer* le haghaidh méid cothrománach.
it: **Expand**: tenta di utilizzare il più spazio possibile nel contenitore padre (su ciascun asse). I controlli che non si espandono verranno allontanati da quelli che lo fanno. Tra i controlli in espansione, la quantità di spazio che occupano l'uno dall'altro è determinata dal *Rapporto di allungamento* (vedi sotto). Questa opzione è disponibile solo quando il contenitore padre è del tipo corretto, ad esempio *HBoxContainer* ha questa opzione per il dimensionamento orizzontale.
ru: **Expand**: пытается использовать как можно больше пространства в родительском контейнере (по каждой оси). Элементы управления, которые не расширяются, будут оттеснены теми, которые расширяются. Расстояние между расширяющимися элементами управления определяется *Stretch Ratio (Коэффициентом растяжения)* (см. ниже). Этот параметр доступен только для родительского контейнера соответствующего типа, например, *HBoxContainer* имеет этот параметр для изменения размера по горизонтали.
ta: ** விரிவாக்கு **: பெற்றோர் கொள்கலனில் (ஒவ்வொரு அச்சிலும்) முடிந்தவரை இடத்தைப் பயன்படுத்த முயற்சிக்கிறது. விரிவடையாத கட்டுப்பாடுகள் செய்பவர்களால் தள்ளப்படும். கட்டுப்பாடுகளை விரிவாக்குவதற்கு இடையில், அவர்கள் ஒருவருக்கொருவர் எடுக்கும் இடத்தின் அளவு * நீட்டிக்க விகிதத்தால் தீர்மானிக்கப்படுகிறது (கீழே காண்க). பெற்றோர் கொள்கலன் சரியான வகையாக இருக்கும்போது மட்டுமே இந்த விருப்பம் கிடைக்கும், எடுத்துக்காட்டாக * HboxContainer * கிடைமட்ட அளவிற்கு இந்த விருப்பத்தைக் கொண்டுள்ளது.
uk: **Розгорнути**: намагається використати якомога більше місця в батьківському контейнері (на кожній осі). Елементи керування, які не розширюються, будуть відсунуті тими, які розширюються. Обсяг простору, який вони займають один від одного, визначається *коефіцієнтом розтягування* (див. нижче). Цей параметр доступний лише тоді, коли батьківський контейнер має правильний тип, наприклад *HBoxContainer* має цей параметр для горизонтального розміру.
zh_hant: **擴展（Expand）**：在父容器內（於各軸）盡可能佔用空間。未啟用擴展的控制項會被啟用擴展的控制項擠開。多個擴展控制項之間的空間分配，取決於 *比例（Stretch Ratio）*（詳見下方）。此選項僅當父容器支援時才可用，例如 *HBoxContainer* 支援水平擴展。

source: **Shrink Begin** When expanding, try to remain at the left or top of the expanded area.
ga: **Laghdaigh Tos** Agus tú ag leathnú, déan iarracht fanacht ar thaobh clé nó ag barr an limistéar leathnaithe.
it: **Shrink Begin** quando si espande, tenta di rimanere a sinistra o in alto nell'area espansa.
ru: **Shrink Begin** При расширении старайтесь оставаться слева или сверху расширенной области.
ta: ** சுருங்கத் தொடங்கு ** விரிவடையும் போது, விரிவாக்கப்பட்ட பகுதியின் இடது அல்லது உச்சியில் இருக்க முயற்சிக்கவும்.
uk: **Початок зменшення** Під час розширення намагайтеся залишатися ліворуч або вгорі розширеної області.
zh_hant: **收縮起始（Shrink Begin）**：當啟用擴展時，盡量保持在擴展區域的左側或頂部。

source: **Shrink Center** When expanding, try to remain at the center of the expanded area.
ga: **Ionad Laghdaí** Agus tú ag leathnú, déan iarracht fanacht i lár an limistéar leathnaithe.
it: **Shrink Center** quando si espande, tenta di rimanere al centro dell'area espansa.
ru: **Shrink Center** При расширении старайтесь оставаться в центре расширенной области.
ta: ** சுருக்க நடுவண் ** விரிவடையும் போது, விரிவாக்கப்பட்ட பகுதியின் மையத்தில் இருக்க முயற்சிக்கவும்.
uk: **Зменшити центр** Під час розширення намагайтеся залишатися в центрі розширеної області.
zh_hant: **收縮置中（Shrink Center）**：當啟用擴展時，盡量保持在擴展區域的中央。

source: **Shrink End** When expanding, try to remain at the right or bottom of the expanded area.
ga: **Laghdaigh Deireann** Agus tú ag leathnú, déan iarracht fanacht ar dheis nó ag bun an limistéar leathnaithe.
it: **Shrink End** quando si espande, tenta di rimanere a destra o in basso nell'area espansa.
ru: **Shrink End** При расширении старайтесь оставаться справа или внизу расширенной области.
ta: ** சுருங்க முடிவு ** விரிவடையும் போது, விரிவாக்கப்பட்ட பகுதியின் வலது அல்லது கீழ் இருக்க முயற்சிக்கவும்.
uk: **Shrink End** Під час розширення намагайтеся залишатися праворуч або внизу розширеної області.
zh_hant: **收縮結尾（Shrink End）**：當啟用擴展時，盡量保持在擴展區域的右側或底部。

source: **Stretch Ratio**: The ratio of how much expanded controls take up the available space in relation to each other. A control with "2", will take up twice as much available space as one with "1".
ga: **Cóimheas Snáth**: An cóimheas an méid a ghlacann rialuithe leathnaithe an spás atá ar fáil i ndáil lena chéile. Glacfaidh rialú le “2" dhá oiread spáis atá ar fáil le ceann le “1".
ru: **Stretch Ratio**: соотношение между развёрнутыми элементами управления и занимаемым ими доступным пространством. Элемент управления со значением "2" займёт вдвое больше доступного пространства, чем элемент управления со значением "1".
ta: ** நீட்டிக்க விகிதம் **: விரிவாக்கப்பட்ட கட்டுப்பாடுகள் ஒருவருக்கொருவர் தொடர்பாக கிடைக்கக்கூடிய இடத்தை எவ்வளவு எடுத்துக்கொள்கின்றன என்பதற்கான விகிதம். "2" உடன் ஒரு கட்டுப்பாடு, "1" உடன் ஒன்றைக் காட்டிலும் இரண்டு மடங்கு இடத்தை எடுக்கும்.
uk: **Коефіцієнт розтягування**: співвідношення того, скільки розширених елементів керування займають доступний простір відносно один одного. Елемент керування з «2» займатиме вдвічі більше вільного місця, ніж елемент із «1».
zh_hant: **比例（Stretch Ratio）**：決定多個啟用擴展的控制項相互分配可用空間的比例。例如，比例設為「2」的控制項將獲得比例為「1」的兩倍空間。

source: Experimenting with these flags and different containers is recommended to get a better grasp on how they work.
ga: Moltar triail a bhaint as na bratacha seo agus coimeádáin éagsúla chun tuiscint níos fearr a fháil ar an gcaoi a n-oibríonn siad.
it: È raccomandato sperimentare con questi flag e contenitori diversi per comprenderne meglio come funzionano.
ru: Рекомендуется поэкспериментировать с этими флагами и различными контейнерами, чтобы лучше понять, как они работают.
ta: இந்த கொடிகள் மற்றும் வெவ்வேறு கொள்கலன்களுடன் ஆய்வு செய்வது அவை எவ்வாறு செயல்படுகின்றன என்பதைப் பற்றி நன்கு புரிந்துகொள்ள பரிந்துரைக்கப்படுகிறது.
uk: Рекомендується поекспериментувати з цими прапорцями та різними контейнерами, щоб краще зрозуміти, як вони працюють.
zh_hant: 建議實際嘗試這些旗標與不同類型的容器，以更深入理解它們的運作原理。

source: Container types
ga: cineálacha coimeádá
it: Tipi di contenitori
ru: Типы Container
ta: கொள்கலன் வகைகள்
uk: Типи контейнерів
zh_hant: 容器類型

source: Godot provides several container types out of the box as they serve different purposes:
ga: Soláthraíonn Godot roinnt cineálacha coimeádán as an mbosca mar go bhfreastalaíonn siad cuspóirí éagsúla:
it: Godot fornisce diversi tipi di contenitori pronti all'uso, in quanto servono a scopi diversi:
ru: Godot предлагает несколько типов контейнеров по умолчанию, поскольку они служат разным целям:
ta: கோடோட் வெவ்வேறு நோக்கங்களுக்கு பணி செய்வதால் பெட்டியிலிருந்து பல கொள்கலன் வகைகளை வழங்குகிறது:
uk: Godot пропонує кілька типів контейнерів, оскільки вони служать різним цілям:
zh_hant: Godot 內建多種容器類型，以因應不同的使用需求：

source: Box Containers
ga: Coimeádáin Bosca
ru: Box Containers (Контейнеры-ящики)
ta: பெட்டி கொள்கலன்கள்
zh_hant: 盒式容器

source: Arranges child controls vertically or horizontally (via :ref:`HBoxContainer <class_HBoxContainer>` and :ref:`VBoxContainer <class_VBoxContainer>`). In the opposite of the designated direction (as in, vertical for a horizontal container), it just expands the children.
ga: Socraíonn sé rialuithe leanaí go hingearach nó go cothrománach (trí :ref:`HBoxContainer <class_HBoxContainer>` agus :ref:`VBoxContainer <class_VBoxContainer>`). I gcodarsnacht leis an treo ainmnithe (mar atá i, ingearach le haghaidh coimeádán cothrománach), leathnaíonn sé ach na páistí.
it: Dispone i controlli figlio verticalmente o orizzontalmente (tramite :ref:`HBoxContainer <class_HBoxContainer>` e :ref:`VBoxContainer <class_VBoxContainer>`). Nella direzione opposta a quella designata (ad esempio, verticale per un contenitore orizzontale), espande semplicemente i figli.
ru: Располагает дочерние элементы управления вертикально или горизонтально (через :ref:`HBoxContainer <class_HBoxContainer>` и :ref:`VBoxContainer <class_VBoxContainer>`). В противоположном указанному направлению (например, вертикально для горизонтального контейнера) дочерние элементы просто разворачиваются.
ta: குழந்தை கட்டுப்பாடுகளை செங்குத்தாக அல்லது கிடைமட்டமாக ஏற்பாடு செய்கிறது (வழியாக: குறிப்பு: `hboxcontainer <class_hboxcontainer>` மற்றும்: ref: `vboxcontainer <class_vboxcontainer>`). நியமிக்கப்பட்ட திசைக்கு நேர்மாறாக (ஒரு கிடைமட்ட கொள்கலனுக்கான செங்குத்து), இது குழந்தைகளை விரிவுபடுத்துகிறது.
uk: Розташовує дочірні елементи керування вертикально або горизонтально (через :ref:`HBoxContainer <class_HBoxContainer>` і :ref:`VBoxContainer <class_VBoxContainer>`). У протилежному напрямку (як у вертикальному для горизонтального контейнера) він просто розширює дочірні елементи.
zh_hant: 將子控制項依指定方向（垂直或水平）排列（分別為 :ref:`HBoxContainer <class_HBoxContainer>` 和 :ref:`VBoxContainer <class_VBoxContainer>`）。在非排列方向（例如水平方向的容器在垂直方向），子節點只會被擴展。
