Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_skinning.po
Languages: ga, it, pt_br, ru, ta, uk, zh_tw

source: Local overrides are less useful for the visual flair of your user interface, especially if you aim for consistency. However, for layout nodes these are essential. Nodes such as :ref:`BoxContainer <class_BoxContainer>` and :ref:`GridContainer <class_GridContainer>` use theme constants for defining separation between their children, and :ref:`MarginContainer <class_MarginContainer>` stores its customizable margins in its theme items.
ga: Ní bhíonn sáruithe áitiúla chomh húsáideach maidir le bua amhairc do chomhéadain úsáideora, go háirithe má tá sé mar aidhm agat comhsheasmhacht. Mar sin féin, le haghaidh nóid leagan amach tá siad seo riachtanach. Úsáideann nóid mar :ref:`BoxContainer <class_BoxContainer>` agus :ref:`GridContainer <class_GridContainer>` tairisigh téama chun deighilt idir a bpáistí a shainiú, agus :ref:`MarginContainer <class_MarginContainer>` stórálann sé a chorrlaigh inoiriúnaithe ina míreanna téama .
ru: Локальные переопределения менее полезны для визуального оформления пользовательского интерфейса, особенно если вы стремитесь к единообразию. Однако для узлов макета они необходимы. Такие узлы, как :ref:`BoxContainer <class_BoxContainer>` и :ref:`GridContainer <class_GridContainer>`, используют константы темы для определения разделителей между дочерними элементами, а :ref:`MarginContainer <class_MarginContainer>` сохраняет настраиваемые поля в элементах темы.
ta: உங்கள் பயனர் இடைமுகத்தின் காட்சி பிளேயருக்கு உள்ளக மேலெழுதல்கள் குறைவான பயனுள்ளதாக இருக்கும், குறிப்பாக நீங்கள் நிலைத்தன்மையை நோக்கமாகக் கொண்டால். இருப்பினும், தளவமைப்பு முனைகளுக்கு இவை தேவை. போன்ற முனைகள்: ref: `பாக்ச் கான்டெய்னர் <class_boxcontainer>` மற்றும்: ref: `கிரிட் கான்டெய்னர் <class_gridcontainer>` தங்கள் குழந்தைகளுக்கு இடையில் பிரிவினை வரையறுக்க கருப்பொருள் மாறிலிகளைப் பயன்படுத்துங்கள், மற்றும்: ref: `margincontainer <class_margincontainer>` அதன் தனிப்பயனாக்கக்கூடிய விளிம்புகளில் கடைகள் கடைகள் உள்ளன .
uk: Локальні перевизначення менш корисні для візуального вигляду вашого інтерфейсу користувача, особливо якщо ви прагнете узгодженості. Однак для вузлів макета вони важливі. Такі вузли, як :ref:`BoxContainer <class_BoxContainer>` і :ref:`GridContainer <class_GridContainer>` використовують константи теми для визначення поділу між їхніми дочірніми елементами, а :ref:`MarginContainer <class_MarginContainer>` зберігає настроювані поля в своїх елементах теми .
zh_tw: 本地覆寫對於整體 UI 美觀幫助有限，尤其當你追求一致性時更是如此。不過，對於排版用的節點來說則相當重要。像 :ref:`BoxContainer <class_BoxContainer>` 與 :ref:`GridContainer <class_GridContainer>` 這類節點會用主題常數來定義子項間距；:ref:`MarginContainer <class_MarginContainer>` 則會將自訂邊界存於主題項目中。

source: Whenever a control has a local theme item override, this is the value that it uses. Values provided by the theme are ignored.
ga: Aon uair a bhíonn mír téama áitiúil ag rialú, is é seo an luach a úsáideann sé. Déantar neamhaird ar luachanna a sholáthraíonn an téama.
it: Ogni volta che un controllo ha una sostituzione di un elemento del tema locale, questo è il valore che utilizza. I valori forniti dal tema sono ignorati.
ru: Если элемент управления переопределяет локальный элемент темы, он использует это значение. Значения, предоставляемые темой, игнорируются.
ta: ஒரு கட்டுப்பாட்டில் உள்ளக கருப்பொருள் உருப்படி மேலெழுதும் போதெல்லாம், இது பயன்படுத்தும் மதிப்பு. கருப்பொருளால் வழங்கப்பட்ட மதிப்புகள் புறக்கணிக்கப்படுகின்றன.
uk: Щоразу, коли елемент керування має заміну елемента локальної теми, це значення, яке він використовує. Значення, надані темою, ігноруються.
zh_tw: 當控制項有本地主題項目覆寫時，會優先使用這個值，主題所提供的值則會被忽略。

source: Customizing a project
ga: Tionscadal a shaincheapadh
pt_br: Personalizando um projeto
ru: Настройка проекта
ta: ஒரு திட்டத்தைத் தனிப்பயனாக்குதல்
uk: Налаштування проекту
zh_tw: 自訂專案

source: Out of the box each project adopts the default project theme provided by Godot. The default theme itself is constant and cannot be changed, but its items can be overridden with a custom theme. Custom themes can be applied in two ways: as a project setting, and as a node property throughout the tree of control nodes.
ga: As an mbosca glacann gach tionscadal an téama tionscadail réamhshocraithe a sholáthraíonn Godot. Tá an téama réamhshocraithe féin tairiseach agus ní féidir é a athrú, ach is féidir a mhíreanna a shárú le téama saincheaptha. Is féidir téamaí saincheaptha a chur i bhfeidhm ar dhá bhealach: mar shuíomh tionscadail, agus mar mhaoin nód ar fud an chrainn nóid rialaithe.
ru: По умолчанию каждый проект использует тему проекта по умолчанию, предоставленную Godot. Сама тема по умолчанию постоянна и не может быть изменена, но её элементы можно переопределить пользовательской темой. Пользовательские темы можно применять двумя способами: как настройку проекта и как свойство узла в дереве управляющих узлов.
ta: பெட்டியின் வெளியே ஒவ்வொரு திட்டமும் கோடோட் வழங்கிய இயல்புநிலை திட்ட கருப்பொருளை ஏற்றுக்கொள்கிறது. இயல்புநிலை கருப்பொருள் நிலையானது மற்றும் மாற்ற முடியாது, ஆனால் அதன் உருப்படிகளை தனிப்பயன் கருப்பொருளால் மீறலாம். தனிப்பயன் கருப்பொருள்கள் இரண்டு வழிகளில் பயன்படுத்தப்படலாம்: திட்ட அமைப்பாக, மற்றும் கட்டுப்பாட்டு முனைகளின் மரம் முழுவதும் ஒரு முனை சொத்தாக.
uk: З коробки кожен проект приймає тему проекту за замовчуванням, надану Godot. Сама тема за замовчуванням є постійною та не може бути змінена, але її елементи можна замінити спеціальною темою. Спеціальні теми можна застосовувати двома способами: як налаштування проекту та як властивість вузла в усьому дереві вузлів керування.
zh_tw: 每個新專案預設都會採用 Godot 提供的預設專案主題。預設主題本身是固定的、無法修改，但你可以用自訂主題來覆寫它的項目。自訂主題有兩種套用方式：作為專案設定，或設定在控制項樹狀結構中的節點屬性。

source: There are two project settings that can be adjusted to affect your entire project: :ref:`GUI > Theme > Custom<class_ProjectSettings_property_gui/theme/custom>` allows you to set a custom project-wide theme, and :ref:`GUI > Theme > Custom Font<class_ProjectSettings_property_gui/theme/custom_font>` does the same to the default fallback font. When a theme item is requested by a control node the custom project theme, if present, is checked first. Only if it doesn't have the item the default theme is checked.
ru: Существует два параметра проекта, которые можно изменить для всего проекта: :ref:`GUI > Theme > Custom<class_ProjectSettings_property_gui/theme/custom>` позволяет задать пользовательскую тему для всего проекта, а :ref:`GUI > Theme > Custom Font<class_ProjectSettings_property_gui/theme/custom_font>` делает то же самое для резервного шрифта по умолчанию. При запросе элемента темы узлом управления сначала проверяется пользовательская тема проекта, если она есть. Только если элемент отсутствует, проверяется тема по умолчанию.
ta: உங்கள் முழு திட்டத்தையும் பாதிக்க சரிசெய்யக்கூடிய இரண்டு திட்ட அமைப்புகள் உள்ளன :: ref: `GUI> தீம்> தனிப்பயன் <class_projectsettings_property_gui/தீம்/தனிப்பயன்>` தனிப்பயன் திட்ட அளவிலான கருப்பொருளை அமைக்க உங்களை அனுமதிக்கிறது: ref: `gui> தீம்> தனிப்பயன் ஃபோன்ட் <class_progectings_property/custom_property/custom_property. ஒரு கருப்பொருள் உருப்படி ஒரு கட்டுப்பாட்டு முனையால் கோரப்படும்போது, தனிப்பயன் திட்ட கருப்பொருள், இருந்தால், முதலில் சரிபார்க்கப்படும். அதில் உருப்படி இல்லையென்றால் மட்டுமே இயல்புநிலை கருப்பொருள் சரிபார்க்கப்படுகிறது.
zh_tw: 有兩個專案設定可以影響整個專案：:ref:`GUI > Theme > Custom <class_ProjectSettings_property_gui/theme/custom>` 可設定全專案自訂主題，:ref:`GUI > Theme > Custom Font <class_ProjectSettings_property_gui/theme/custom_font>` 則用於設定預設備援字型。當控制項節點請求主題項目時，會先檢查自訂專案主題（若有設定），只有找不到時才會用預設主題。

source: This allows you to configure the default look of every Godot control with a single theme resource, but you can go more granular than that. Every control node also has a :ref:`theme <class_Control_property_theme>` property, which allows you to set a custom theme for the branch of nodes starting with that control. This means that the control and all of its children, and their children in turn, would first check that custom theme resource before falling back on the project and the default themes.
ga: Ligeann sé seo duit cuma réamhshocraithe gach rialaithe Godot a chumrú le hacmhainn téama amháin, ach is féidir leat dul níos gráinneach ná sin. Tá maoin :ref:`theme <class_Control_property_theme>` ag gach nód rialaithe freisin, a ligeann duit téama saincheaptha a shocrú don bhrainse nóid ag tosú leis an rialú sin. Ciallaíonn sé seo go ndéanfadh an rialú agus a leanaí go léir, agus a gcuid leanaí ar a seal, seiceáil ar dtús leis an acmhainn téama saincheaptha sin sula dtitfidh sé ar ais ar an tionscadal agus ar na téamaí réamhshocraithe.
ru: Это позволяет вам настроить внешний вид каждого элемента управления Godot по умолчанию с помощью одного ресурса темы, но вы можете сделать это более детально. Каждый узел элемента управления также имеет свойство :ref:`theme <class_Control_property_theme>`, которое позволяет задать пользовательскую тему для ветви узлов, начинающейся с этого элемента управления. Это означает, что элемент управления и все его дочерние элементы, а также их дочерние элементы в свою очередь, сначала проверят ресурс пользовательской темы, прежде чем вернуться к проекту и темам по умолчанию.
ta: ஒவ்வொரு கோடோட் கட்டுப்பாட்டின் இயல்புநிலை தோற்றத்தை ஒற்றை கருப்பொருள் வளத்துடன் கட்டமைக்க இது உங்களை அனுமதிக்கிறது, ஆனால் நீங்கள் அதை விட சிறுமணி செல்லலாம். ஒவ்வொரு கட்டுப்பாட்டு முனையிலும் ஒரு: குறிப்பு உள்ளது: `தீம் <class_control_property_theme>` சொத்து, இது அந்தக் கட்டுப்பாட்டிலிருந்து தொடங்கும் முனைகளின் கிளைக்கு தனிப்பயன் கருப்பொருளை அமைக்க உங்களை அனுமதிக்கிறது. இதன் பொருள் கட்டுப்பாடு மற்றும் அதன் அனைத்து குழந்தைகளும், அவர்களது குழந்தைகளும், திட்டத்தின் மற்றும் இயல்புநிலை கருப்பொருள்களில் மீண்டும் விழுவதற்கு முன்பு அந்த தனிப்பயன் கருப்பொருள் வளத்தை முதலில் சரிபார்க்கும்.
uk: Це дозволяє налаштувати вигляд за замовчуванням кожного елемента керування Godot за допомогою єдиного тематичного ресурсу, але ви можете зробити це більш детально. Кожний вузол керування також має властивість :ref:`theme <class_Control_property_theme>`, яка дозволяє встановити спеціальну тему для гілки вузлів, починаючи з цього елемента керування. Це означає, що елемент керування та всі його дочірні елементи, а також їхні дочірні елементи, у свою чергу, спочатку перевірять цей власний ресурс теми, перш ніж повернутися до проекту та тем за замовчуванням.
zh_tw: 這讓你可以用單一主題資源設定所有 Godot 控制項的預設外觀，但你也能做更細膩的調整。每個控制項節點也有 :ref:`theme <class_Control_property_theme>` 屬性，能針對該節點及其所有子孫節點設定自訂主題。換句話說，這個控制項及其子孫節點會優先檢查這份自訂主題，找不到時才回退到專案主題及預設主題。

source: Instead of changing the project setting you can set the custom theme resource to the root-most control node of your entire UI branch to almost the same effect. While in the running project it will behave as expected, individual scenes will still display using the default theme when previewing or running them directly. To fix that you can set the same theme resource to the root control of each individual scene.
ga: In ionad an socrú tionscadail a athrú is féidir leat an acmhainn téama saincheaptha a shocrú go dtí an nód rialaithe is fréamhaí de do bhrainse Chomhéadain ar fad go dtí an éifeacht chéanna beagnach. Cé go n-iompróidh sé é féin mar a bhíothas ag súil leis sa tionscadal reatha, taispeánfar radhairc aonair fós ag baint úsáide as an téama réamhshocraithe agus iad á réamhamharc nó á rith go díreach. Chun a shocrú gur féidir leat an acmhainn téama céanna a shocrú le rialú fréimhe gach radhairc aonair.
ru: Вместо изменения настроек проекта вы можете установить ресурс пользовательской темы в корневой элемент управления всей ветки пользовательского интерфейса, что даст практически тот же эффект. В запущенном проекте всё будет работать как и ожидалось, но отдельные сцены будут по-прежнему использовать тему по умолчанию при предварительном просмотре или непосредственном запуске. Чтобы исправить это, можно установить тот же ресурс темы в корневой элемент управления каждой отдельной сцены.
ta: திட்ட அமைப்பை மாற்றுவதற்குப் பதிலாக, தனிப்பயன் கருப்பொருள் வளத்தை உங்கள் முழு இடைமுகம் கிளையின் மூல-மிக கட்டுப்பாட்டு முனைக்கு கிட்டத்தட்ட அதே விளைவுக்கு அமைக்கலாம். இயங்கும் திட்டத்தில் அது எதிர்பார்த்தபடி செயல்படும், தனிப்பட்ட காட்சிகள் இயல்புநிலை கருப்பொருளைப் பயன்படுத்தி அவற்றை நேரடியாக முன்னோட்டமிடும்போது அல்லது இயக்கும்போது காண்பிக்கப்படும். ஒவ்வொரு காட்சியின் மூலக் கட்டுப்பாட்டிற்கும் ஒரே கருப்பொருள் வளத்தை அமைக்கலாம் என்பதை சரிசெய்ய.
uk: Замість того, щоб змінювати параметри проекту, ви можете встановити ресурс спеціальної теми для самого кореневого вузла керування всієї вашої гілки інтерфейсу користувача з майже таким самим ефектом. Хоча у запущеному проекті він поводитиметься належним чином, окремі сцени все одно відображатимуться з використанням теми за замовчуванням під час попереднього перегляду або безпосереднього запуску. Щоб виправити це, ви можете встановити той самий ресурс теми для кореневого керування кожної окремої сцени.
zh_tw: 你可以選擇不更動專案設定，而是將自訂主題資源設定到 UI 架構中最上層的控制項節點，效果幾乎相同。在專案執行時會如預期顯示，但如果你直接預覽或運行單一場景，則仍會套用預設主題。要解決這問題，可將同一份主題資源，也設定到各個場景的根控制項。

source: For example, you can have a certain style for buttons in your project theme, but want a different look for buttons inside of a popup dialog. You can set a custom theme resource to the root control of your popup and define a different style for buttons within that resource. As long as the chain of control nodes between the root of the popup and the buttons is uninterrupted, those buttons will use the styles defined in the theme resource that is closest to them. All other controls will still be styled using the project-wide theme and the default theme styles.
ga: Mar shampla, is féidir leat stíl áirithe a bheith agat le haghaidh cnaipí i do théama tionscadail, ach ba mhaith leat breathnú difriúil ar chnaipí taobh istigh de dialóg aníos. Is féidir leat acmhainn téama saincheaptha a shocrú le rialú fréimhe do phreabfhuinneog agus stíl dhifriúil a shainiú le haghaidh cnaipí laistigh den acmhainn sin. Chomh fada agus nach gcuirtear isteach ar shlabhra na nóid rialaithe idir fréamh an phreabfhuinneog agus na cnaipí, bainfidh na cnaipí sin úsáid as na stíleanna a shainmhínítear san acmhainn téama is gaire dóibh. Beidh gach rialtán eile a styled fós ag baint úsáide as an téama ar fud an tionscadail agus na stíleanna téama réamhshocraithe.
ru: Например, вы можете использовать определенный стиль для кнопок в теме проекта, но хотите, чтобы кнопки во всплывающем диалоговом окне выглядели по-другому. Вы можете установить ресурс пользовательской темы для корневого элемента управления всплывающего окна и определить другой стиль для кнопок в этом ресурсе. Пока цепочка узлов управления между корнем всплывающего окна и кнопками не прервется, эти кнопки будут использовать стили, определенные в ближайшем к ним ресурсе темы. Все остальные элементы управления будут по-прежнему оформлены с использованием общей темы проекта и стилей темы по умолчанию.
ta: எடுத்துக்காட்டாக, உங்கள் திட்ட கருப்பொருளில் பொத்தான்களுக்கு ஒரு குறிப்பிட்ட பாணியைக் கொண்டிருக்கலாம், ஆனால் பாப்அப் உரையாடலின் உள்ளே பொத்தான்களுக்கு வேறு தோற்றத்தை விரும்புகிறீர்கள். உங்கள் பாப்அப்பின் ரூட் கட்டுப்பாட்டுக்கு தனிப்பயன் கருப்பொருள் வளத்தை அமைக்கலாம் மற்றும் அந்த வளத்திற்குள் உள்ள பொத்தான்களுக்கு வேறு பாணியை வரையறுக்கலாம். பாப்அப்பின் மூலத்திற்கும் பொத்தான்களுக்கும் இடையிலான கட்டுப்பாட்டு முனைகளின் சங்கிலி தடையின்றி இருக்கும் வரை, அந்த பொத்தான்கள் அவற்றுக்கு மிக நெருக்கமான கருப்பொருள் வளத்தில் வரையறுக்கப்பட்ட பாணிகளைப் பயன்படுத்தும். மற்ற அனைத்து கட்டுப்பாடுகளும் திட்ட அளவிலான கருப்பொருள் மற்றும் இயல்புநிலை கருப்பொருள் பாணிகளைப் பயன்படுத்தி இன்னும் வடிவமைக்கப்படும்.
uk: Наприклад, ви можете мати певний стиль для кнопок у темі проекту, але бажаєте інший вигляд кнопок у спливаючому діалоговому вікні. Ви можете встановити спеціальний ресурс теми для кореневого елемента керування вашого спливаючого вікна та визначити інший стиль для кнопок у цьому ресурсі. Поки ланцюжок вузлів керування між коренем спливаючого вікна та кнопками не переривається, ці кнопки використовуватимуть стилі, визначені в ресурсі теми, який є найближчим до них. Усі інші елементи керування все одно будуть оформлені за допомогою теми для всього проекту та стилів теми за замовчуванням.
zh_tw: 舉例來說，你可以在專案主題設定所有按鈕的統一風格，但希望彈跳視窗裡的按鈕是不同樣式。這時就可以將自訂主題資源設定到該快顯視窗的根控制項，並在主題中為按鈕定義另一種樣式。只要從快顯視窗的根控制項到按鈕之間的節點結構不中斷，這些按鈕就會使用最近的主題資源中定義的樣式。其餘控制項則仍然套用全專案主題與預設主題樣式。

source: To sum it up, for an arbitrary control its theme item lookup would look something like this:
ga: Chun achoimre a dhéanamh air, le haghaidh rialú treallach bheadh cuma éigin mar seo ar a chuardach mír téama:
it: Riassumendo, per un controllo arbitrario, la ricerca dell'elemento del tema assomiglierebbe a qualcosa del genere:
pt_br: Para resumir, para um controle arbitrário, sua pesquisa de item de tema seria algo assim:
ru: Подводя итог, для произвольного элемента управления поиск его элемента темы будет выглядеть примерно так:
ta: இதைச் சுருக்கமாக, ஒரு தன்னிச்சையான கட்டுப்பாட்டுக்கு அதன் கருப்பொருள் உருப்படி தேடல் இதுபோன்றதாக இருக்கும்:
uk: Підводячи підсумок, для довільного елемента управління пошук елементів його теми виглядатиме приблизно так:
zh_tw: 總結來說，任一控制項查找主題項目的流程如下：

source: Check for local overrides of the same data type and name.
ga: Seiceáil le haghaidh sáraithe áitiúla den chineál sonraí céanna agus den ainm céanna.
it: Verifica la presenza di sostituzioni locali dello stesso tipo di dati e nome.
ru: Проверьте наличие локальных переопределений того же типа данных и имени.
ta: அதே தரவு வகை மற்றும் பெயரின் உள்ளக மேலெழுதல்களைச் சரிபார்க்கவும்.
uk: Перевірте локальні перевизначення того самого типу даних і імені.
zh_tw: 檢查是否有相同名稱與資料型別的本地覆寫。

source: Using control's type variation, class name and parent class names:
ga: Ag baint úsáide as athrú cineáil an rialaithe, ainm ranga agus ainmneacha ranga na dtuismitheoirí:
it: Utilizzando la variazione di tipo del controllo, il nome della classe e i nomi della classe padre:
ru: Используя вариацию типа элемента управления, имя класса и имена родительских классов:
ta: கட்டுப்பாட்டின் வகை மாறுபாடு, வகுப்பு பெயர் மற்றும் பெற்றோர் வகுப்பு பெயர்களைப் பயன்படுத்துதல்:
uk: Використання варіанту типу елемента керування, імені класу та назв батьківського класу:
zh_tw: 依據控制項的型別變種、類別名稱與父類別名稱：

source: Check every control starting from itself and see if it has a theme property set;
ga: Seiceáil gach rialú a thosaíonn uaidh féin agus féach an bhfuil tacar maoine téama aige;
it: Controlla ogni controllo a partire da se stesso e verifica se ha una proprietà del tema impostata;
ru: Проверьте каждый элемент управления, начиная с него самого, и посмотрите, установлено ли для него свойство темы;
ta: தன்னிடமிருந்து தொடங்கும் ஒவ்வொரு கட்டுப்பாட்டையும் சரிபார்த்து, அதில் ஒரு கருப்பொருள் சொத்து தொகுப்பு இருக்கிறதா என்று பாருங்கள்;
uk: Перевірте кожен елемент керування, починаючи з самого себе, і подивіться, чи встановлено для нього властивість теми;
zh_tw: 從自己開始，逐層往上檢查每個控制項是否有設定主題屬性;

source: If it does, check that theme for the matching item of the same name, data and theme type;
ga: Má dhéanann, seiceáil an téama sin don mhír mheaitseála den ainm, sonraí agus cineál téama céanna;
it: Se sì, verifica il tema per l'elemento corrispondente con lo stesso nome, dati e tipo di tema;
ru: Если это так, проверьте тему на наличие соответствующего элемента с таким же именем, данными и типом темы;
ta: அவ்வாறு செய்தால், அதே பெயர், தரவு மற்றும் கருப்பொருள் வகையின் பொருந்தக்கூடிய உருப்படிக்கு அந்த கருப்பொருளை சரிபார்க்கவும்;
uk: Якщо так, перевірте цю тему для відповідного елемента з такою ж назвою, даними та типом теми;
zh_tw: 如果有，則在該主題檢查有無同名、同型別、同主題型別的項目;

source: If there is no custom theme or it doesn't have the item, move to the parent control;
ga: Mura bhfuil aon téama saincheaptha ann nó mura bhfuil an mhír aige, bog go dtí rialú an tuismitheora;
it: Se non è presente alcun tema personalizzato o non ha l'elemento, passa al controllo padre;
ru: Если пользовательской темы нет или в ней нет элемента, перейдите к родительскому элементу управления;
ta: தனிப்பயன் கருப்பொருள் இல்லை அல்லது அதில் உருப்படி இல்லை என்றால், பெற்றோர் கட்டுப்பாட்டுக்கு செல்லுங்கள்;
uk: Якщо спеціальної теми немає або в ній відсутній елемент, перейдіть до батьківського контролю;
zh_tw: 如果沒有自訂主題，或主題中沒有該項目，就往上檢查父控制項;

source: Repeat steps a-c. until the root of the tree is reached, or a non-control node is reached.
ga: Déan céimeanna a-c. go dtí go sroichtear fréamh an chrainn, nó go sroichtear nód neamhrialaithe.
it: Ripeti i passaggi da a a c, fino a raggiungere la radice dell'albero o un nodo non di controllo.
ru: Повторяйте шаги a–c, пока не будет достигнут корень дерева или неконтролируемый узел.
ta: படிகளை மீண்டும் செய்ய a-c. மரத்தின் வேரை அடையும் வரை, அல்லது கட்டுப்பாடு அல்லாத முனை அடையும் வரை.
uk: Повторіть кроки a-c. поки не буде досягнуто кореня дерева або не буде досягнуто неконтрольний вузол.
zh_tw: 重複 a-c 步驟，直到場景樹根節點或遇到非控制項節點為止。

source: Using control's type variation, class name and parent class names check the project-wide theme, if it's present.
ga: Ag baint úsáide as athrú cineáil rialaithe, seiceáil ainm ranga agus ainmneacha ranga tuismitheoirí an téama ar fud an tionscadail, má tá sé i láthair.
it: Utilizzando la variazione di tipo del controllo, il nome della classe e i nomi delle classi padre, verifica il tema dell'intero progetto, se presente.
ru: Используя вариацию типа элемента управления, имя класса и имена родительских классов, проверьте тему проекта, если она присутствует.
ta: கட்டுப்பாட்டின் வகை மாறுபாட்டைப் பயன்படுத்தி, வகுப்பு பெயர் மற்றும் பெற்றோர் வகுப்பு பெயர்கள் திட்ட அளவிலான கருப்பொருள் இருந்தால், அது இருந்தால்.
uk: Використовуючи варіант типу елемента керування, назву класу та імена батьківського класу, перевірте тему для всього проекту, якщо вона присутня.
zh_tw: 若有專案範圍主題，則依型別變種、類別名稱、父類別名稱查找該主題。

source: Using control's type variation, class name and parent class names check the default theme.
ga: Ag baint úsáide as athrú cineál rialaithe, seiceáil ainm ranga agus ainmneacha ranga tuismitheoirí an téama réamhshocraithe.
it: Utilizzando la variazione di tipo del controllo, il nome della classe e i nomi delle classi padre, verifica il tema predefinito.
ru: Используя вариацию типа элемента управления, имя класса и имена родительских классов, проверьте тему по умолчанию.
ta: கட்டுப்பாட்டின் வகை மாறுபாட்டைப் பயன்படுத்தி, வகுப்பு பெயர் மற்றும் பெற்றோர் வகுப்பு பெயர்கள் இயல்புநிலை கருப்பொருளை சரிபார்க்கவும்.
uk: Використовуючи зміну типу елемента керування, назву класу та імена батьківських класів, перевірте тему за замовчуванням.
zh_tw: 依型別變種、類別名稱、父類別名稱查找預設主題。

source: Even if the item doesn't exist in any theme, a corresponding default value for that data type will be returned.
ga: Fiú mura bhfuil an mhír ann in aon téama, seolfar luach réamhshocraithe comhfhreagrach don chineál sonraí sin ar ais.
it: Anche se l'elemento non esiste in alcun tema, sarà restituito un valore predefinito corrispondente per quel tipo di dati.
pt_br: Mesmo que o item não exista em nenhum tema, um valor padrão correspondente para esse tipo de dados será retornado.
ru: Даже если элемент не существует ни в одной теме, будет возвращено соответствующее значение по умолчанию для этого типа данных.
ta: எந்தவொரு கருப்பொருளிலும் உருப்படி இல்லாவிட்டாலும், அந்த தரவு வகைக்கான இயல்புநிலை மதிப்பு திரும்பப் பெறப்படும்.
uk: Навіть якщо елемент не існує в жодній темі, буде повернено відповідне значення за замовчуванням для цього типу даних.
zh_tw: 即使所有主題都找不到該項目，仍會回傳該資料型別的預設值。

source: Beyond controls
ga: Taobh amuigh de rialuithe
pt_br: Além dos controles
ru: Не только controls
ta: கட்டுப்பாடுகளுக்கு அப்பால்
uk: Поза контролем
zh_tw: 控制項以外的應用
