Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: After downloading the generated font file, load it in your Godot project then specify it as a custom font for a Label, RichTextLabel or Label3D node. Switch over to the Fontello web interface, then copy the character by selecting it then pressing :kbd:`Ctrl + C` (:kbd:`Cmd + C` on macOS). Paste the character in the **Text** property of your Label node. The character will appear as a placeholder glyph in the inspector, but it should appear correctly in the 2D/3D viewport.
ga: Tar éis an comhad cló a ghintear a íoslódáil, luchtaigh é i do thionscadal Godot ansin sonraigh é mar chló saincheaptha le haghaidh lipéad, RichTextLabel nó nód Label3D. Athraigh anonn go comhéadan gréasáin Fontello, ansin cóipeáil an carachtar trína roghnú ansin ag brú: kbd: 'Ctrl + C' (: kbd: 'Cmd + C' ar macOS). Greamaigh an carachtar sa mhaoin **Text ** de do nód Lipéad. Beidh an carachtar le feiceáil mar glyph placeholder sa chigire, ach ba chóir go mbeadh sé le feiceáil i gceart sa radharc 2D/3D.
it: Dopo aver scaricato il file del font generato, caricare nel progetto Godot e specificarlo come font personalizzato per un nodo Label, RichTextLabel o Label3D. Passare all'interfaccia web di Fontello, quindi copiare il carattere selezionandolo e premendo :kbd:`Ctrl + C` (:kbd:`Cmd + C` su macOS). Incollare il carattere nella proprietà **Text** del nodo Label. Il carattere apparirà come glifo segnaposto nell'ispettore, ma dovrebbe apparire correttamente nella viewport 2D/3D.
ru: После загрузки сгенерированного файла шрифта загрузите его в свой проект Godot и укажите его как пользовательский шрифт для узла Label, RichTextLabel или Label3D. Перейдите в веб-интерфейс Fontello, затем скопируйте символ, выделив его и нажав :kbd:`Ctrl + C` (:kbd:`Cmd + C` в macOS). Вставьте символ в свойство **Text** узла Label. Символ будет отображаться как глиф-заполнитель в инспекторе, но он должен корректно отображаться в области просмотра 2D/3D.
ta: உருவாக்கப்பட்ட எழுத்துரு கோப்பைப் பதிவிறக்கிய பிறகு, அதை உங்கள் கோடோட் திட்டத்தில் ஏற்றவும், பின்னர் அதை ஒரு சிட்டை, ரிச் டெக்ச்ட்லேபிள் அல்லது சிட்டை 3 டி முனைக்கான தனிப்பயன் எழுத்துருவாகக் குறிப்பிடவும். ஃபோன்டெல்லோ வலை இடைமுகத்திற்கு மாறவும், பின்னர் எழுத்தைத் தேர்ந்தெடுப்பதன் மூலம் நகலெடுக்கவும்: KBD: `CTRL + C` (: KBD:` CMD + C` MACOS இல்). உங்கள் சிட்டை முனையின் ** உரை ** சொத்தில் எழுத்தை ஒட்டவும். கதாபாத்திரம் இன்ச்பெக்டரில் ஒரு ஒதுக்கிட கிளிஃபாகத் தோன்றும், ஆனால் அது 2 டி/3 டி வியூபோர்ட்டில் சரியாகத் தோன்ற வேண்டும்.
uk: Завантаживши згенерований файл шрифту, завантажте його у свій проект Godot, а потім укажіть його як спеціальний шрифт для вузла Label, RichTextLabel або Label3D. Перейдіть до веб-інтерфейсу Fontello, потім скопіюйте символ, вибравши його та натиснувши :kbd:`Ctrl + C` (:kbd:`Cmd + C` на macOS). Вставте символ у властивість **Text** вашого вузла Label. Символ відображатиметься як гліф-заповнювач в інспекторі, але він має правильно відображатися у вікні перегляду 2D/3D.
zh_hant: 下載產生的字型後，載入到 Godot 專案並指定給 Label、RichTextLabel 或 Label3D 節點。到 Fontello 網頁介面選取要用的符號，按 :kbd:`Ctrl + C`（macOS 為 :kbd:`Cmd + C`）複製，然後貼到 Label 節點的 **Text** 屬性。在屬性檢視器可能只見到佔位字元，但在 2D/3D 檢視區會正常顯示。

source: To use an icon font alongside a traditional font in the same Control, you can specify the icon font as a :ref:`fallback <doc_using_fonts_font_fallbacks>`. This works because icon fonts use the Unicode *private use area*, which is reserved for use by custom fonts and doesn't contain standard glyphs by design.
ga: Chun cló deilbhín a úsáid taobh le cló traidisiúnta sa Rialú céanna, is féidir leat an cló deilbhín a shonrú mar :ref: `fallback <doc_using_fonts_font_fallbacks>`. Oibríonn sé seo toisc go n-úsáideann clónna deilbhín an *limistéar úsáide príobháideach* Unicode, atá forchoimeádta le húsáid ag clónna saincheaptha agus nach bhfuil glyphanna caighdeánacha de réir dearaidh ann.
it: Per utilizzare un font icona insieme a un font tradizionale nello stesso Control, è possibile specificarlo come :ref:`alternativa di riserva <doc_using_fonts_font_fallbacks>`. Questo funziona perché i font icona utilizzano l'*area di utilizzo privato* di Unicode, riservata all'uso dai font personalizzati, e non contiene glifi standard apposta.
ru: Чтобы использовать пиктограммный шрифт вместе с традиционным шрифтом в одном элементе управления, можно указать пиктограммный шрифт как :ref:`fallback <doc_using_fonts_font_fallbacks>`. Это работает, поскольку пиктограммные шрифты используют *область частного использования* Unicode, которая зарезервирована для пользовательских шрифтов и изначально не содержит стандартных глифов.
ta: அதே கட்டுப்பாட்டில் ஒரு பாரம்பரிய எழுத்துருவுடன் ஒரு படவுரு எழுத்துருவைப் பயன்படுத்த, நீங்கள் படவுரு எழுத்துருவை ஒரு எனக் குறிப்பிடலாம்: ref: `குறைவானது <doc_using_fonts_font_falbacks>`. இது செயல்படுகிறது, ஏனெனில் படவுரு எழுத்துருக்கள் யூனிகோட் *தனியார் பயன்பாட்டு பகுதி *ஐப் பயன்படுத்துகின்றன, இது தனிப்பயன் எழுத்துருக்களால் பயன்படுத்த ஒதுக்கப்பட்டுள்ளது மற்றும் வடிவமைப்பு மூலம் நிலையான கிளிஃப்களைக் கொண்டிருக்கவில்லை.
uk: Щоб використовувати шрифт значка поряд із традиційним шрифтом у тому самому елементі керування, ви можете вказати шрифт значка як :ref:`резервний <doc_using_fonts_font_fallbacks>`. Це працює, оскільки шрифти піктограм використовують *область приватного використання* Unicode, яка зарезервована для використання користувальницькими шрифтами та не містить стандартних гліфів.
zh_hant: 若要在同一個 Control 內同時用一般字型與圖示字型，可把圖示字型設為 :ref:`後備字型 <doc_using_fonts_font_fallbacks>`。這可行是因為圖示字型使用 Unicode *專用區段*，該區專為自訂字型保留，不會與標準字元衝突。

source: Several modern icon fonts such as `Font Awesome 6 <https://fontawesome.com/download>`__ have a desktop variant that uses *ligatures* to specify icons. This allows you to specify icons by entering their name directly in the **Text** property of any node that can display fonts. Once the icon's name is fully entered as text (such as ``house``), it will be replaced by the icon.
ga: Tá malairt deisce ag go leor clónna deilbhín nua-aimseartha ar nós `Font Awesome 6 <https://fontawesome.com/download>`__ a úsáideann *ligatures* chun deilbhíní a shonrú. Ligeann sé seo duit deilbhíní a shonrú trína n-ainm a iontráil go díreach sa mhaoin **Text** ar aon nód ar féidir clónna a thaispeáint. Nuair a bheidh ainm an deilbhín curtha isteach go hiomlán mar théacs (mar ``teach``), cuirfear an deilbhín ina ionad.
it: Diversi font icona moderni, come `Font Awesome 6 <https://fontawesome.com/download>`__, hanno una variazione desktop che utilizza le *legature* per specificare icone. Questo consente di specificare icone inserendone il nome direttamente nella proprietà **Text** di qualsiasi nodo che possa visualizzare font. Una volta inserito il nome dell'icona come testo completo (ad esempio ``house``), verrà sostituito dall'icona.
ru: У некоторых современных иконочных шрифтов, таких как `Font Awesome 6 <https://fontawesome.com/download>`__, есть версия для настольных компьютеров, использующая *лигатуры* для указания иконок. Это позволяет указывать иконки, вводя их названия непосредственно в свойство **Text** любого узла, поддерживающего отображение шрифтов. После того, как название иконки будет полностью введено в виде текста (например, ``house``), оно будет заменено названием иконки.
ta: பல நவீன படவுரு எழுத்துருக்கள், `எழுத்துரு அற்புதமான 6 <https://fontaweromence.com/download>` __ ஐகான்களைக் குறிப்பிட * லிகேட்டர்ச் * ஐப் பயன்படுத்தும் டெச்க்டாப் மாறுபாட்டைக் கொண்டுள்ளது. எழுத்துருக்களைக் காண்பிக்கக்கூடிய எந்த முனையின் ** உரை ** சொத்தில் அவற்றின் பெயரை நேரடியாக உள்ளிடுவதன் மூலம் ஐகான்களைக் குறிப்பிட இது உங்களை அனுமதிக்கிறது. ஐகானின் பெயர் முழுமையாக உரையாக உள்ளிட்டதும் (`` வீடு` போன்றவை), அது ஐகானால் மாற்றப்படும்.
uk: Кілька сучасних шрифтів значків, таких як `Font Awesome 6 <https://fontawesome.com/download>`__, мають варіант для робочого столу, який використовує *лігатури* для визначення значків. Це дозволяє вказувати піктограми, вводячи їх назву безпосередньо у властивість **Текст** будь-якого вузла, який може відображати шрифти. Після того, як назву піктограми буде повністю введено як текст (наприклад, ``будинок``), її буде замінено піктограмою.
zh_hant: 某些現代圖示字型（如 `Font Awesome 6 <https://fontawesome.com/download>`__）有版本支援*連字*，你只需在 **Text** 輸入圖示名稱（如 ``house``）就會自動顯示該圖示。

source: While easier to use, this approach cannot be used with font fallbacks as the main font's characters will take priority over the fallback font's ligatures.
ga: Cé go bhfuil sé níos éasca é a úsáid, ní féidir an cur chuige seo a úsáid le fallbacks cló mar go mbeidh tús áite ag príomhcharachtair an chló ar ligatures an chló fallback.
it: Sebbene sia più semplice, questo approccio non si può usare con i font di riserva, poiché i caratteri del font principale avranno la priorità sulle legature del font di riserva.
ru: Хотя этот подход проще в использовании, его нельзя использовать с резервными шрифтами, поскольку символы основного шрифта будут иметь приоритет над лигатурами резервного шрифта.
ta: பயன்படுத்த எளிதானது என்றாலும், இந்த அணுகுமுறையை எழுத்துரு குறைவுகளுடன் பயன்படுத்த முடியாது, ஏனெனில் முக்கிய எழுத்துருவின் எழுத்துக்கள் குறைவடையும் எழுத்துருவின் தசைநார்கள் மீது முன்னுரிமை பெறும்.
uk: Незважаючи на те, що цей підхід простіший у використанні, його не можна використовувати з резервними шрифтами, оскільки символи основного шрифту матимуть пріоритет над лігатурами резервного шрифту.
zh_hant: 不過這種寫法無法與字型後備共用，因為主要字型的字元會優先於後備字型的連字。

source: Font fallbacks
ga: Fallbacks cló
it: Font di riserva
ru: Резервные шрифты
ta: எழுத்துரு குறைவுகள்
uk: Запасні шрифти
zh_hant: 字型後備

source: Godot supports defining one or more fallbacks when the main font lacks a glyph to be displayed. There are 2 main use cases for defining font fallbacks:
ga: Tacaíonn Godot le fallbacks amháin nó níos mó a shainmhíniú nuair nach bhfuil glyph le taispeáint sa phríomhchló. Tá 2 phríomhchás úsáide ann chun fallbacks cló a shainmhíniú:
it: Godot supporta la definizione di una o più alternative quando il font principale non ha un glifo da visualizzare. Esistono due casi d'uso principali per definire i font di riserva:
ru: Godot поддерживает определение одного или нескольких резервных шрифтов, если в основном шрифте отсутствует глиф для отображения. Существует два основных варианта определения резервных шрифтов:
ta: முதன்மையான எழுத்துருவில் காண்பிக்கப்பட வேண்டிய கிளிஃப் இல்லாதபோது ஒன்று அல்லது அதற்கு மேற்பட்ட குறைவுகளை வரையறுப்பதை கோடோட் ஆதரிக்கிறது. எழுத்துரு குறைவுகளை வரையறுக்க 2 முக்கிய பயன்பாட்டு வழக்குகள் உள்ளன:
uk: Godot підтримує визначення одного або кількох запасних варіантів, коли в основному шрифті відсутній гліф для відображення. Існує 2 основні варіанти використання для визначення запасних шрифтів:
zh_hant: Godot 支援設定一個或多個後備字型，當主字型缺少某字元時自動轉用其他字型。主要應用場景有兩個：

source: Use a font that only supports Latin character sets, but use another font to be able to display text another character set such as Cyrillic.
ga: Bain úsáid as cló nach dtacaíonn ach le tacair charachtair Laidine, ach bain úsáid as cló eile le bheith in ann téacs a thaispeáint tacar carachtar eile ar nós Coireallach.
it: Usare un font che supporta solo l'insieme di caratteri latini, ma usare un altro font per poter visualizzare il testo in un altro insieme di caratteri, ad esempio il cirillico.
ru: Используйте шрифт, поддерживающий только латинские символы, но используйте другой шрифт, чтобы можно было отображать текст с другим набором символов, например, кириллицей.
ta: லத்தீன் எழுத்துக்குறி தொகுப்புகளை மட்டுமே ஆதரிக்கும் எழுத்துருவைப் பயன்படுத்தவும், ஆனால் மற்றொரு எழுத்துருவைப் பயன்படுத்தி சிரிலிக் போன்ற மற்றொரு எழுத்துக்குறி தொகுப்பைக் காண்பிக்க முடியும்.
uk: Використовуйте шрифт, який підтримує лише латинські набори символів, але використовуйте інший шрифт, щоб мати можливість відображати текст іншим набором символів, наприклад кирилицею.
zh_hant: 主字型只收錄拉丁文，若要顯示西里爾文等其他語系，就設後備字型來補足。

source: Use a font to render text, and another font to render emoji or icons.
ga: Bain úsáid as cló chun téacs a dhéanamh, agus cló eile chun emoji nó deilbhíní a dhéanamh.
it: Usare un font per renderizzare testo e un altro font per renderizzare emoji o icone.
ru: Используйте один шрифт для отображения текста и другой шрифт для отображения эмодзи или значков.
ta: உரையை வழங்க எழுத்துருவைப் பயன்படுத்தவும், ஈமோசி அல்லது ஐகான்களை வழங்க மற்றொரு எழுத்துருவும் பயன்படுத்தவும்.
uk: Використовуйте шрифт для відтворення тексту та інший шрифт для відтворення смайлів або значків.
zh_hant: 一個字型顯示一般文字，另一個則專門顯示表情符號或圖示。

source: Open the Advanced Import Settings dialog by double-clicking the font file in the FileSystem dock. You can also select the font in the FileSystem dock, go to the Import dock then choose **Advanced…** at the bottom:
ga: Oscail an dialóg Advanced Import Settings trí chliceáil faoi dhó ar an gcomhad cló sa duga Córas Comhad. Is féidir leat an cló a roghnú freisin sa duga FileSystem, téigh go dtí an duga Iompórtála ansin roghnaigh **Advanced...** ag bun an leathanaigh:
it: Aprire la finestra di dialogo Impostazioni di importazione avanzate facendo doppio clic sul file del font nel pannello FileSystem. È possibile anche selezionare il font nel pannello FileSystem, andare al pannello Importazione e scegliere **Avanzate…** in basso:
ru: Откройте диалоговое окно "Advanced Import Settings", дважды щёлкнув по файлу шрифта в доке "FileSystem". Вы также можете выбрать шрифт в доке "FileSystem", перейти в док "Import" и выбрать пункт **Advanced…** внизу:
ta: கோப்பு முறைமை கப்பல்துறையில் எழுத்துரு கோப்பை இருமுறை சொடுக்கு செய்வதன் மூலம் மேம்பட்ட இறக்குமதி அமைப்புகள் உரையாடலைத் திறக்கவும். கோப்பு முறைமை கப்பல்துறையில் எழுத்துருவைத் தேர்ந்தெடுக்கலாம், இறக்குமதி கப்பல்துறைக்குச் சென்று பின்னர் ** மேம்பட்ட… ** கீழே தேர்வு செய்யவும்:
uk: Відкрийте діалогове вікно додаткових параметрів імпорту, двічі клацнувши файл шрифту в док-станції FileSystem. Ви також можете вибрати шрифт у док-станції FileSystem, перейти до док-станції «Імпорт» і вибрати **Додатково…** внизу:
zh_hant: 在檔案系統面板雙擊字型檔打開進階匯入設定。也可以選取字型後在匯入面板點選底部的 **進階…**。

source: Import dock
ga: Duga iompórtála
it: Pannello Importazione
ru: Импортный док
ta: இறக்குமதி கப்பல்துறை
uk: Імпорт дока
zh_hant: 匯入面板

source: In the dialog that appears, look for **Fallbacks** section on the sidebar on the right, click the **Array[Font] (size 0)** text to expand the property, then click **Add Element**:
ga: Sa dialóg atá le feiceáil, cuardaigh **Fallbacks ** alt ar an mbarra taoibh ar dheis, cliceáil ar an **Array[Font] (méid 0)** téacs chun an mhaoin a leathnú, ansin cliceáil **Add Element **:
ru: В открывшемся диалоговом окне найдите раздел **Fallbacks** на боковой панели справа, щелкните текст **Array[Font] (size 0)**, чтобы развернуть свойство, затем щелкните **Add Element**:
ta: தோன்றும் உரையாடலில், வலதுபுறத்தில் பக்கப்பட்டியில் ** குறைவுகள் ** பகுதியைத் தேடுங்கள், ** வரிசை [எழுத்துரு] (அளவு 0) ** சொத்தை விரிவாக்க, பின்னர் ** உறுப்பைச் சேர் ** என்பதைக் சொடுக்கு செய்க:
uk: У діалоговому вікні, що з’явиться, знайдіть розділ **Резервні варіанти** на бічній панелі праворуч, натисніть текст **Масив[Шрифт] (розмір 0)**, щоб розгорнути властивість, а потім натисніть **Додати елемент**:
zh_hant: 在對話框右側找到 **Fallbacks** 區段，點 **Array[Font] (size 0)** 展開，然後點 **Add Element** 新增後備字型：

source: Adding font fallback
ga: Cúltaca cló á chur leis
it: Aggiungere un font di riserva
ru: Добавление резервного шрифта
ta: எழுத்துரு குறைவுகளைச் சேர்க்கிறது
uk: Додавання резервного шрифту
zh_hant: 新增字型後備

source: Click the dropdown arrow on the new element, then choose a font file using the **Quick Load** or **Load** options:
ga: Cliceáil ar an saighead anuas ar an eilimint nua, ansin roghnaigh comhad cló ag baint úsáide as na roghanna **Quick Load ** nó **Load**:
ru: Щелкните стрелку раскрывающегося списка на новом элементе, затем выберите файл шрифта с помощью параметров **Quick Load** или **Load**:
ta: புதிய உறுப்பில் கீழ்தோன்றும் அம்புக்குறியைக் சொடுக்கு செய்து, ** விரைவான சுமை ** அல்லது ** ஏற்ற ** விருப்பங்களைப் பயன்படுத்தி எழுத்துரு கோப்பைத் தேர்வுசெய்க:
uk: Натисніть стрілку розкривного меню на новому елементі, а потім виберіть файл шрифту за допомогою параметрів **Швидке завантаження** або **Завантажити**:
zh_hant: 點新元素旁的下拉箭頭，選擇 **快速載入** 或 **載入** 選項來指定字型檔案：

source: Loading font fallback
ga: Cúltaca cló á luchtú
it: Caricare font di riserva
ru: Загрузка резервного шрифта
ta: எழுத்துரு குறைவை ஏற்றுகிறது
uk: Завантаження резервного шрифту
zh_hant: 載入後備字型

source: It is possible to add fallback fonts while using the default project font. To do so, leave the **Base Font** property empty while adding one or more font fallbacks.
ga: Is féidir clónna cúltaca a chur leis agus cló réamhshocraithe an tionscadail á úsáid. Chun é sin a dhéanamh, fág an mhaoin **Base Font** folamh agus ceann amháin nó níos mó de na fallbacks cló á chur leis.
ru: При использовании шрифта проекта по умолчанию можно добавлять резервные шрифты. Для этого оставьте свойство **Base Font** пустым при добавлении одного или нескольких резервных шрифтов.
ta: இயல்புநிலை திட்ட எழுத்துருவைப் பயன்படுத்தும் போது குறைவடையும் எழுத்துருக்களைச் சேர்க்க முடியும். அவ்வாறு செய்ய, ஒன்று அல்லது அதற்கு மேற்பட்ட எழுத்துரு குறைவுகளைச் சேர்க்கும்போது ** அடிப்படை எழுத்துரு ** சொத்தை காலியாக விடவும்.
uk: Можна додати запасні шрифти, використовуючи стандартний шрифт проекту. Для цього залиште властивість **Базовий шрифт** порожнім, додавши один або кілька запасних шрифтів.
zh_hant: 即使使用預設專案字型也能加後備字型。方法是將 **Base Font** 留空，再加入一個或多個後備字型。

source: Font fallbacks can also be defined on a local basis similar to :ref:`doc_using_fonts_opentype_font_features`, but this is not covered here for brevity reasons.
ga: Is féidir fallbacks cló a shainmhíniú freisin ar bhonn áitiúil cosúil le :ref:'doc_using_fonts_opentype_font_features', ach níl sé seo clúdaithe anseo ar chúiseanna brevity.
it: I font di riserva si possono definire localmente, in modo simile a :ref:`doc_using_fonts_opentype_font_features`, ma per motivi di brevità questo argomento non è trattato qui.
ru: Резервные шрифты также можно определить на локальной основе, аналогично :ref:`doc_using_fonts_opentype_font_features`, но здесь это не рассматривается из соображений краткости.
ta: எழுத்துரு குறைவுகள் உள்ளக அடிப்படையில் வரையறுக்கப்படலாம்: குறிப்பு: `doc_using_fonts_opentype_font_features`, ஆனால் இது சுருக்கமான காரணங்களுக்காக இங்கு இல்லை.
uk: Запасні шрифти також можна визначити на локальній основі, подібно до :ref:`doc_using_fonts_opentype_font_features`, але це не описано тут з причин стислості.
zh_hant: 你也可以像 :ref:`doc_using_fonts_opentype_font_features` 那樣在本地設定後備字型，這裡就不贅述。

source: Variable fonts
ga: Clónna athraitheacha
it: Font variabili
ru: Вариативные шрифты
ta: மாறி எழுத்துருக்கள்
uk: Змінні шрифти
zh_hant: 可變字型

source: Godot has full support for `variable fonts <https://variablefonts.io/>`__, which allow you to use a single font file to represent various font weights and styles (regular, bold, italic, …). This must be supported by the font file you're using.
ga: Tá tacaíocht iomlán ag Godot do `clónna inathraithe <https://variablefonts.io/>`__, a ligeann duit clóchomhad amháin a úsáid chun meáchain agus stíleanna cló éagsúla a léiriú (rialta, trom, iodálach, ...). Caithfidh an clóchomhad atá in úsáid agat a bheith ag tacú leis seo.
it: Godot supporta pienamente i `font variabili <https://variablefonts.io/>`__, che consentono di utilizzare un singolo file di font per rappresentare diversi pesi e stili (normale, grassetto, corsivo, ecc.). Questa funzionalità deve essere supportata dal file di font utilizzato.
ru: Godot полностью поддерживает `variable fonts <https://variablefonts.io/>`__, которые позволяют использовать один файл шрифта для представления различных начертаний и стилей (обычный, полужирный, курсив и т.д.). Это должно поддерживаться используемым файлом шрифта.
ta: `மாறி எழுத்துருக்கள் <https://variablefonts.io/> __ க்கு கோடோட் முழு ஆதரவைக் கொண்டுள்ளது, இது பல்வேறு எழுத்துரு எடைகள் மற்றும் பாணிகளைக் குறிக்க ஒற்றை எழுத்துரு கோப்பைப் பயன்படுத்த அனுமதிக்கிறது (வழக்கமான, தைரியமான, சாய்வு,…). நீங்கள் பயன்படுத்தும் எழுத்துரு கோப்பால் இதை ஆதரிக்க வேண்டும்.
uk: Godot має повну підтримку `змінних шрифтів <https://variablefonts.io/>`__, які дозволяють використовувати один файл шрифту для представлення різної товщини та стилю шрифту (звичайний, жирний, курсив, …). Це має підтримуватися файлом шрифту, який ви використовуєте.
zh_hant: Godot 完整支援 `可變字型 <https://variablefonts.io/>`__，只需一個字型檔就能表現多種粗細與樣式（如標準、粗體、斜體等），前提是你用的字型檔本身支援可變功能。

source: To use a variable font, create a :ref:`class_FontVariation` resource in the location where you intend to use the font, then load a font file within the FontVariation resource:
ga: Chun cló athraitheach a úsáid, cruthaigh acmhainn :ref:'class_FontVariation' sa suíomh ina bhfuil sé ar intinn agat an cló a úsáid, ansin luchtaigh comhad cló laistigh d'acmhainn FontVariation:
it: Per utilizzare un font variabile, creare una risorsa :ref:`class_FontVariation` nel posto in cui si intende utilizzare il font, quindi caricare un file di font dentro la risorsa FontVariation:
ru: Чтобы использовать переменный шрифт, создайте ресурс :ref:`class_FontVariation` в том месте, где вы собираетесь использовать шрифт, затем загрузите файл шрифта в ресурс FontVariation:
ta: மாறி எழுத்துருவைப் பயன்படுத்த, ஒரு: ref: `class_fontvariation` வளத்தை உருவாக்கவும் நீங்கள் எழுத்துருவைப் பயன்படுத்த விரும்பும் இடத்தில், பின்னர் எழுத்துரு கோப்பை எழுத்துரு வளத்திற்குள் ஏற்றவும்:
uk: Щоб використовувати змінний шрифт, створіть ресурс :ref:`class_FontVariation` у місці, де ви збираєтеся використовувати шрифт, а потім завантажте файл шрифту в ресурс FontVariation:
zh_hant: 要使用可變字型，請在需用字型之處建立 :ref:`class_FontVariation` 資源，再在裡面載入字型檔案：

source: Creating a FontVariation resource
ga: Acmhainn FontVariation a chruthú
it: Creare una risorsa FontVariation
ru: Создание ресурса FontVariation
ta: ஒரு எழுத்துரு வளத்தை உருவாக்குதல்
uk: Створення ресурсу FontVariation
zh_hant: 建立 FontVariation 資源

source: Loading a font file into the FontVariation resource
ga: Comhad cló á luchtú isteach san acmhainn FontVariation
it: Caricamento di un file di font nella risorsa FontVariation
ru: Загрузка файла шрифта в ресурс FontVariation
ta: எழுத்துரு கோப்பை எழுத்துரு வளத்தில் ஏற்றுகிறது
uk: Завантаження файлу шрифту в ресурс FontVariation
zh_hant: 在 FontVariation 資源中載入字型檔

source: Scroll down to the FontVariation's **Variation** section, then click the **Variation Coordinates** text to expand the list of axes that can be adjusted:
ga: Scrollaigh síos go dtí rannóg **Variation** an FontVariation, ansin cliceáil ar an **Comhordanáidí Athrú** téacs chun liosta na n-aiseanna is féidir a choigeartú a leathnú:
it: Scorrere in basso fino alla sezione **Variazione** di FontVariation, quindi cliccare sul testo **Coordinate di variazione** per espandere l'elenco degli assi che si possono modificare:
ru: Прокрутите вниз до раздела **Variation** FontVariation, затем щелкните текст **Variation Coordinates**, чтобы развернуть список осей, которые можно настроить:
ta: FontVariation இன் ** மாறுபாடு ** பிரிவுக்கு கீழே உருட்டவும், பின்னர் சரிசெய்யக்கூடிய அச்சுகளின் பட்டியலை விரிவாக்க ** மாறுபாடு ஒருங்கிணைப்புகள் ** உரையைக் சொடுக்கு செய்க:
uk: Прокрутіть униз до розділу **Variation** у FontVariation, а потім клацніть текст **Variation Coordinates**, щоб розгорнути список осей, які можна налаштувати:
zh_hant: 往下找到 FontVariation 的 **變化** 區段，點 **變化座標** 展開可調整的軸：

source: List of variation axes
ga: Liosta na n-aiseanna athraithe
it: Elenco di assi di variazione
ru: Список осей вариаций
ta: மாறுபாடு அச்சுகளின் பட்டியல்
uk: Список варіаційних осей
zh_hant: 可調整軸列表
