Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: Fonts with self-intersecting outlines will not render correctly in MSDF mode. If you notice rendering issues on fonts downloaded from websites such as `Google Fonts <https://fonts.google.com>`__, try downloading the font from the font author's official website instead.
ga: Ní fhágfaidh clónna a bhfuil imlínte féin-trasnaíonnacha acu i mód MSDF i gceart. Má thugann tú faoi deara go bhfuil fadhbanna rindreála ar chlónna arna n-íoslódáil ó shuíomhanna gréasáin ar nós `Google Fonts <https://fonts.google.com>`__, bain triail as an gcló a íoslódáil ó shuíomh Gréasáin oifigiúil údair na gclónna ina ionad sin.
it: I font con contorni che si intersecano tra loro non saranno visualizzati correttamente in modalità MSDF. Se si riscontrano problemi di rendering con font scaricati da siti web come `Google Fonts <https://fonts.google.com>`__, provare a scaricare il font dal sito web ufficiale dell'autore.
ru: Шрифты с обводкой, которая само-пересекается, не могут быть корректно отображены в режиме MSDF. Если вы заметили проблемы с отображением шрифтов загруженных с таких сайтов как `Google Fonts <https://fonts.google.com>`__, попробуйте загрузить шрифт с официального сайта автора шрифта.
ta: சுய-இணைப்புகளை கொண்ட எழுத்துருக்கள் MSDF பயன்முறையில் சரியாக வழங்கப்படாது. `கூகிள் எழுத்துருக்கள் <https://fonts.google.com> __ __ போன்ற வலைத்தளங்களிலிருந்து பதிவிறக்கம் செய்யப்பட்ட எழுத்துருக்களில் வழங்குதல் சிக்கல்களை நீங்கள் கவனித்தால், அதற்கு பதிலாக எழுத்துரு ஆசிரியரின் அதிகாரப்பூர்வ வலைத்தளத்திலிருந்து எழுத்துருவைப் பதிவிறக்க முயற்சிக்கவும்.
uk: Шрифти з контурами, що перетинаються, не відображатимуться належним чином у режимі MSDF. Якщо ви помітили проблеми із відтворенням шрифтів, завантажених із таких веб-сайтів, як `Google Fonts <https://fonts.google.com>`__, спробуйте замість цього завантажити шрифт з офіційного веб-сайту автора шрифту.
zh_hant: 帶有自我交錯輪廓的字型在 MSDF 模式下無法正確顯示。如果你在 `Google Fonts <https://fonts.google.com>`__ 下載的字型出現算繪問題，建議改從原作者官網下載。

source: Comparison of font rasterization methods
ga: Comparáid idir modhanna rasterization cló
it: Confronto tra i metodi di rasterizzazione dei font
ru: Сравнение методов растеризации шрифта
ta: எழுத்துரு ராச்டரைசேசன் முறைகளின் ஒப்பீடு
uk: Порівняння методів растеризації шрифтів
zh_hant: 字型光柵化法比較

source: Comparison of font rasterization methods. From top to bottom: rasterized without oversampling, rasterized with oversampling, MSDF
ga: Comparáid idir modhanna rasterization cló. Ó bhun go barr: rasterized gan oversampling, rasterized le oversampling, MSDF
it: Confronto tra i metodi di rasterizzazione dei font. Dall'alto verso il basso: rasterizzazione senza sovracampionamento, rasterizzazione con sovracampionamento, MSDF
ru: Сравнение методов растеризации шрифта. Сверху вниз: растеризованный без передискретизации, растеризованный с передискретизацией, MSDF-шрифт
ta: எழுத்துரு ராச்டரைசேசன் முறைகளின் ஒப்பீடு. மேலிருந்து கீழாக: மிகைப்படுத்தாமல் ராச்டரைச் செய்யப்படுகிறது, மிகைப்படுத்தப்பட்ட, எம்.எச்.டி.எஃப்
uk: Порівняння методів растеризації шрифтів. Зверху донизу: растрований без передискретизації, растрований із передискретизацією, MSDF
zh_hant: 字型光柵化方式比較。由上至下：無超取樣的光柵化、有超取樣、MSDF

source: To enable MSDF rendering for a given font, select it in the FileSystem dock, go to the Import dock, enable **Multichannel Signed Distance Field**, then click **Reimport**:
ga: Chun rindreáil MSDF a chumasú le haghaidh cló ar leith, roghnaigh é i nduga an Chórais Comhad, téigh go dtí an duga Iompórtála, cumasaigh **Multichannel Signed Distance Field **, ansin cliceáil **Reimport**:
it: Per abilitare il rendering MSDF per un determinato font, selezionarlo nel pannello FileSystem, andare al pannello Importazione, abilitare **Multichannel Signed Distance Field**, quindi cliccare su **Reimporta**:
ru: Чтобы включить MSDF для выбранного шрифта, выберите его в панели FileSystem (Файловая система), перейдите к панели Import (Импорт), включите **Multichannel Signed Distance Field**, затем нажмите **Reimport**:
ta: கொடுக்கப்பட்ட எழுத்துருவுக்கு எம்.எச்.டி.எஃப் வழங்குதல் செய்ய, கோப்பு முறைமை கப்பல்துறையில் அதைத் தேர்ந்தெடுத்து, இறக்குமதி கப்பல்துறைக்குச் சென்று, ** மல்டிசனல் கையொப்பமிடப்பட்ட தொலைதூர புலத்தை இயக்கவும் **
uk: Щоб увімкнути рендеринг MSDF для певного шрифту, виберіть його в док-станції FileSystem, перейдіть до док-станції «Імпорт», увімкніть **Поле відстані з багатоканальним знаком**, а потім натисніть **Повторний імпорт**:
zh_hant: 要為某個字型啟用 MSDF 算繪，在檔案系統中選取該字型，切換至匯入面板，啟用 **多通道帶符號距離場**，然後點選 **重新匯入**：

source: Enabling MSDF in the font's import options
ga: MSDF a chumasú i roghanna iompórtála an chló
it: Abilitazione di MSDF nelle opzioni di importazione del font
ru: Включение MSDF в настройках импорта шрифта
ta: எழுத்துருவின் இறக்குமதி விருப்பங்களில் MSDF ஐ இயக்குகிறது
uk: Увімкнення MSDF у параметрах імпорту шрифту
zh_hant: 在字型匯入選項中啟用 MSDF

source: Using emoji
ga: Ag baint úsáide as emoji
it: Usare le emoji
ru: Использование эмодзи
ta: ஈமோசியைப் பயன்படுத்துதல்
uk: Використання емодзі
zh_hant: 使用表情符號（Emoji）

source: Godot has limited support for emoji fonts:
ga: Tá tacaíocht theoranta ag Godot do chlónna emoji:
it: Godot supporta in modo limitato i font emoji:
ru: Godot имеет ограниченную поддержку эмодзи шрифтов:
ta: ஈமோசி எழுத்துருக்களுக்கு கோடோட் மட்டுப்படுத்தப்பட்ட ஆதரவைக் கொண்டுள்ளது:
uk: Godot має обмежену підтримку шрифтів emoji:
zh_hant: Godot 對 Emoji 字型的支援有限：

source: CBDT/CBLC (embedded PNGs) and SVG emoji fonts are supported.
ga: Tacaítear le CBDT / CBLC (PNGs leabaithe) agus clónna emoji SVG.
it: Sono supportati i font CBDT/CBLC (PNG incorporati) e gli emoji SVG.
ru: Поддерживаются шрифты эмодзи CBDT/CBLC (встроенные PNG) и SVG.
ta: சிபிடிடி/சிபிஎல்சி (உட்பொதிக்கப்பட்ட பி.என்.சி.எச்) மற்றும் எச்.வி.சி ஈமோசி எழுத்துருக்கள் ஆதரிக்கப்படுகின்றன.
uk: Підтримуються шрифти emoji CBDT/CBLC (вбудовані PNG) і SVG.
zh_hant: 支援 CBDT/CBLC（內嵌 PNG）與 SVG Emoji 字型。

source: COLR/CPAL emoji fonts (custom vector format) are **not** supported.
ga: Tacaítear le clónna emoji COLR/CPAL (formáid veicteoir saincheaptha) **ní**.
it: I font emoji COLR/CPAL (formato vettoriale personalizzato) **non** sono supportati.
ru: Шрифты эмодзи COLR/CPAL (Собственный векторный формат) **не** поддерживается.
ta: Colr/cpal emoji எழுத்துருக்கள் (தனிப்பயன் திசையன் வடிவம்) ** அல்ல ** ஆதரிக்கப்படவில்லை.
uk: Шрифти емодзі COLR/CPAL (власний векторний формат) **не** підтримуються.
zh_hant: **不支援** COLR/CPAL（自訂向量格式）Emoji 字型。

source: EMJC bitmap image compression (used by iOS' system emoji font) is **not** supported. This means that to support emoji on iOS, you must use a custom font that uses SVG or PNG bitmap compression instead.
ga: Tacaítear le comhbhrú íomhá mapa giotán EMJC (a úsáideann cló emoji córais iOS) **not**. Ciallaíonn sé seo go gcaithfidh tú cló saincheaptha a úsáid chun tacú le emoji ar iOS a úsáideann comhbhrú mapa giotán SVG nó PNG ina ionad.
it: La compressione delle immagini bitmap EMJC (utilizzata dal font emoji di sistema di iOS) **non** è supportata. Ciò significa che per supportare le emoji su iOS, è necessario utilizzare un font personalizzato che utilizzi invece la compressione bitmap SVG o PNG.
ru: Сжатие растрового изображения EMJC (используется системным эмодзи шрифтом iOS) **не** поддерживается. Это означает, что для поддержки эмодзи в iOS вам необходимо использовать особый шрифт который использует сжатие растрового изображения SVG или PNG.
ta: ஈ.எம்.சே.சி பிட்மேப் பட சுருக்கமானது (iOS இன் சிச்டம் ஈமோசி எழுத்துரு பயன்படுத்துகிறது) ** அல்ல ** ஆதரிக்கப்படவில்லை. இதன் பொருள் ஐஇமு இல் ஈமோசியை ஆதரிக்க, அதற்கு பதிலாக எச்.வி.சி அல்லது பி.என்.சி பிட்மேப் சுருக்கத்தைப் பயன்படுத்தும் தனிப்பயன் எழுத்துருவைப் பயன்படுத்த வேண்டும்.
uk: Стиснення растрового зображення EMJC (використовується системним шрифтом смайлів iOS) **не** підтримується. Це означає, що для підтримки emoji в iOS потрібно використовувати спеціальний шрифт, який використовує стиснення растрового зображення SVG або PNG.
zh_hant: **不支援** EMJC 點陣圖壓縮（iOS 系統 Emoji 字型專用）。若要在 iOS 支援 Emoji，請改用支援 SVG 或 PNG 的自訂字型。

source: For Godot to be able to display emoji, the font used (or one of its :ref:`fallbacks <doc_using_fonts_font_fallbacks>`) needs to include them. Otherwise, emoji won't be displayed and placeholder "tofu" characters will appear instead:
ga: Chun go mbeidh Godot in ann emoji a thaispeáint, ní mór an cló a úsáideadh (nó ceann dá :ref:`fallbacks <doc_using_fonts_font_fallbacks>`) a chur san áireamh. Seachas sin, ní thaispeánfar emoji agus taispeánfar carachtair “tofu” do choinneálaí áite:
it: Affinché Godot possa visualizzare gli emoji, il font utilizzato (o uno dei suoi :ref:`fallback <doc_using_fonts_font_fallbacks>`) deve includerli. Altrimenti, gli emoji non saranno visualizzati e al loro posto appariranno i caratteri segnaposto "tofu":
ru: Чтобы Godot мог отобразить эмодзи, используемый шрифт (или один из его :ref:`fallbacks <doc_using_fonts_font_fallbacks>`) должен их включать. В противном случае, эмодзи не отобразятся и вместо них появятся символы-заполнители "тофу":
ta: கோடோட் ஈமோசியைக் காண்பிக்க, பயன்படுத்தப்பட்ட எழுத்துரு (அல்லது அதன் ஒன்று: குறிப்பு: `குறைவுகள் <doc_using_fonts_font_falbacks>`) அவற்றைச் சேர்க்க வேண்டும். இல்லையெனில், ஈமோசி காண்பிக்கப்படாது மற்றும் அதற்கு பதிலாக ஒதுக்கீட்டு "டோஃபு" எழுத்துக்கள் தோன்றும்:
uk: Щоб Godot міг відображати емодзі, використовуваний шрифт (або один із його :ref:`запасних <doc_using_fonts_font_fallbacks>`) має містити їх. Інакше емодзі не відображатимуться, а замість них з’являться символи-заповнювачі «тофу»:
zh_hant: 要讓 Godot 能正確顯示 Emoji，所用字型（或其 :ref:`後備字型 <doc_using_fonts_font_fallbacks>`）必須收錄對應字元。否則會出現方框佔位符（又稱「豆腐」字元）：

source: Default appearance when trying to use emoji in a label
ga: Cuma réamhshocraithe agus emoji á úsáid i lipéad
it: Aspetto predefinito quando si tenta di utilizzare emoji in un'etichetta
ru: Вид по умолчанию при попытке отображения эмодзи в тексте
ta: இயல்புநிலை தோற்றம் ஒரு லேபிளில் ஈமோசியைப் பயன்படுத்த முயற்சிக்கும்போது
uk: Вигляд за замовчуванням під час спроби використання емодзі в мітці
zh_hant: 標籤嘗試顯示 Emoji 時的預設外觀

source: After adding a font to display emoji such as `Noto Color Emoji <https://fonts.google.com/noto/specimen/Noto+Color+Emoji>`__, you get the expected result:
ga: Tar éis cló a chur leis chun emoji ar nós `Noto Colour Emoji a thaispeáint <https://fonts.google.com/noto/specimen/Noto+Color+Emoji>`__, gheobhaidh tú an toradh ionchais:
it: Dopo aver aggiunto un font per visualizzare le emoji, ad esempio `Noto Color Emoji <https://fonts.google.com/noto/specimen/Noto+Color+Emoji>`__, si ottiene il risultato previsto:
ru: Добавив шрифт для отображения эмодзи, такой как `Noto Color Emoji <https://fonts.google.com/noto/specimen/Noto+Color+Emoji>`__, вы получите ожидаемый результат:
ta: `நோட்டோ கலர் ஈமோசி <https://fonts.google.com/noto/specimen/noto+color+emoji> __ __ போன்ற ஈமோசியைக் காண்பிக்க ஒரு எழுத்துருவைச் சேர்த்த பிறகு, நீங்கள் எதிர்பார்க்கப்படும் முடிவைப் பெறுவீர்கள்:
uk: Додавши шрифт для відображення емодзі, як-от `Noto Color Emoji <https://fonts.google.com/noto/specimen/Noto+Color+Emoji>`__, ви отримаєте очікуваний результат:
zh_hant: 加入收錄 Emoji 的字型（如 `Noto Color Emoji <https://fonts.google.com/noto/specimen/Noto+Color+Emoji>`__）後，就能正確顯示表情符號：

source: Correct appearance after adding an emoji font to the label
ga: Cuma cheart tar éis cló emoji a chur leis an lipéad
it: Aspetto corretto dopo aver aggiunto un font emoji all'etichetta
ru: Правильное отображение после добавления эмодзи шрифта к тексту
ta: லேபிளில் ஈமோசி எழுத்துருவைச் சேர்த்த பிறகு சரியான தோற்றம்
uk: Правильний вигляд після додавання шрифту emoji до мітки
zh_hant: 加上 Emoji 字型後標籤顯示的正確效果

source: To use a regular font alongside emoji, it's recommended to specify a :ref:`fallback font <doc_using_fonts_font_fallbacks>` that points to the emoji font in the regular font's advanced import options. If you wish to use the default project font while displaying emoji, leave the **Base Font** property in FontVariation empty while adding a font fallback pointing to the emoji font:
ga: Chun cló rialta a úsáid taobh le emoji, moltar :tag:`cló cúltaca <doc_using_fonts_font_fallbacks>` a shonrú a dhíríonn ar an gcló emoji sna hardroghanna iompórtála sa chló rialta. Más mian leat cló réamhshocraithe an tionscadail a úsáid agus emoji á thaispeáint agat, fág an t-airí **Base Font** in FontVariation folamh agus cuir cúlchló leis ag díriú ar an gcló emoji:
it: Per utilizzare un font regolare insieme agli emoji, si consiglia di specificare un :ref:`font di riserva <doc_using_fonts_font_fallbacks>` che punti al font degli emoji nelle opzioni di importazione avanzate del font regolare. Se si desidera utilizzare il font predefinito del progetto per visualizzare gli emoji, lasciare vuota la proprietà **Base Font** in FontVariation mentre si aggiunge un font di riserva che punta al font degli emoji:
ru: Чтобы использовать обычный шрифт вместе с эмодзи, рекомендуется указать :ref:`fallback font <doc_using_fonts_font_fallbacks>` который указывает на шрифт эмодзи в расширенных параметрах импорта обычного шрифта. Если вы хотите использовать шрифт проекта по умолчанию во время отображения эмодзи оставьте свойство **Base Font** в FontVariation пустым, добавляя резервный шрифт, который указывает на шрифт эмодзи:
ta: ஈமோசியுடன் ஒரு வழக்கமான எழுத்துருவைப் பயன்படுத்த, ஒரு: குறிப்பு: `குறைவடையும் எழுத்துரு <doc_using_fonts_font_falbacks>` இது வழக்கமான எழுத்துருவின் மேம்பட்ட இறக்குமதி விருப்பங்களில் ஈமோசி எழுத்துருவை சுட்டிக்காட்டுகிறது. ஈமோசியைக் காண்பிக்கும் போது இயல்புநிலை திட்ட எழுத்துருவைப் பயன்படுத்த விரும்பினால், ஈமோசி எழுத்துருவை சுட்டிக்காட்டும் எழுத்துரு குறைவுகளைச் சேர்க்கும்போது ** அடிப்படை எழுத்துரு ** சொத்தை ஃபோன்ட்வாரேசனில் காலியாக விடுங்கள்:
uk: Щоб використовувати звичайний шрифт разом із emoji, рекомендується вказати :ref:`резервний шрифт <doc_using_fonts_font_fallbacks>`, який вказує на шрифт emoji в розширених параметрах імпорту звичайного шрифту. Якщо ви бажаєте використовувати шрифт проекту за замовчуванням під час відображення емодзі, залиште властивість **Base Font** у FontVariation порожнім, додаючи резервний шрифт, який вказує на шрифт емодзі:
zh_hant: 若想讓一般字型可同時顯示 Emoji，建議在進階匯入設定裡設 :ref:`後備字型 <doc_using_fonts_font_fallbacks>` 指向 Emoji 字型。如果你想用預設專案字型但又能顯示 Emoji，請在 FontVariation 留空 **Base Font**，並新增後備字型指向 Emoji 字型：

source: Emoji fonts are quite large in size, so you may want to :ref:`load a system font <doc_using_fonts_system_fonts>` to provide emoji glyphs rather than bundling it with your project. This allows providing full emoji support in your project without increasing the size of its exported PCK. The downside is that emoji will look different depending on the platform, and loading system fonts is not supported on all platforms.
ga: Tá clónna Emoji sách mór, mar sin b'fhéidir gur mhaith leat :tag: `cló córais a luchtú <doc_using_fonts_system_fonts>` chun glyphs emoji a sholáthar seachas é a chuachadh le do thionscadal. Ligeann sé seo tacaíocht iomlán emoji a sholáthar i do thionscadal gan méid a PCK easpórtáilte a mhéadú. Is é an taobh thíos ná go mbeidh cuma difriúil ar emoji ag brath ar an ardán, agus ní thacaítear le luchtú clónna córais ar gach ardán.
it: I font emoji sono piuttosto grandi, quindi potresti voler :ref:`caricare un font di sistema <doc_using_fonts_system_fonts>` per fornire glifi di emoji invece di includerlo nel progetto. Questo permette di fornire il pieno supporto per gli emoji nel progetto senza aumentare le dimensioni del PCK esportato. Lo svantaggio è che gli emoji avranno un aspetto diverso a seconda della piattaforma e il caricamento dei font di sistema non è supportato su tutte le piattaforme.
ru: Эмодзи шрифты имеют довольно большой размер, поэтому вы можете :ref:`load a system font <doc_using_fonts_system_fonts>` чтобы добавить символы эмодзи вместо того чтобы добавлять их в ваш проект. Это позволит обеспечить полную поддержку в вашем проекте без увеличения размера экспортируемого PCK. Недостатком является то, что эмодзи будут выглядеть по-разному в зависимости от платформы, и загрузка системных шрифтов поддерживается не на всех платформах.
ta: ஈமோசி எழுத்துருக்கள் அளவு மிகப் பெரியவை, எனவே நீங்கள் விரும்பலாம்: ref: `ஒரு கணினி எழுத்துருவை ஏற்றவும் <doc_using_fonts_system_fonts>` உங்கள் திட்டத்துடன் தொகுக்கப்படுவதை விட ஈமோசி கிளிஃப்களை வழங்க. ஏற்றுமதி செய்யப்பட்ட பி.சி.கே அளவை அதிகரிக்காமல் உங்கள் திட்டத்தில் முழு ஈமோசி ஆதரவை வழங்க இது அனுமதிக்கிறது. எதிர்மறையானது என்னவென்றால், மேடையைப் பொறுத்து ஈமோசி வித்தியாசமாகத் தோன்றும், மேலும் கணினி எழுத்துருக்களை ஏற்றுவது எல்லா தளங்களிலும் ஆதரிக்கப்படவில்லை.
uk: Шрифти Emoji мають досить великий розмір, тому ви можете :ref:`завантажити системний шрифт <doc_using_fonts_system_fonts>`, щоб надати гліфи emoji, а не додавати його до свого проекту. Це дозволяє забезпечити повну підтримку емодзі у вашому проекті без збільшення розміру його експортованого PCK. Недоліком є те, що емодзі виглядатимуть по-різному залежно від платформи, а завантаження системних шрифтів підтримується не на всіх платформах.
zh_hant: Emoji 字型通常很大，你可以考慮 :ref:`載入系統字型 <doc_using_fonts_system_fonts>` 來提供 Emoji，而不必把字型檔打包進專案。這樣能全面支援 Emoji 而不會讓匯出檔變大。但缺點是不同作業系統的 Emoji 外觀會不同，且非所有平台都支援系統字型。

source: It's possible to use a system font as a fallback font too.
es: Es posible usar también una fuente de sistema como fuente de fallback.
ga: Is féidir cló córais a úsáid mar chló cúltaca freisin.
it: È possibile utilizzare anche un font di sistema come font di riserva.
ru: Системный шрифт также можно использовать в качестве резервного.
ta: கணினி எழுத்துருவை குறைவடையும் எழுத்துருவாகவும் பயன்படுத்த முடியும்.
uk: Також можна використовувати системний шрифт як запасний.
zh_hant: 你也可以用系統字型當成後備字型。

source: Using icon fonts
ga: Clónna deilbhíní á n-úsáid
it: Utilizzare font icona
ru: Использование шрифтов-иконок
ta: படவுரு எழுத்துருக்களைப் பயன்படுத்துதல்
uk: Використання значкових шрифтів
zh_hant: 使用圖示字型

source: Tools like `Fontello <https://fontello.com/>`__ can be used to generate font files containing vectors imported from SVG files. This can be used to render custom vector elements as part of your text, or to create extruded 3D icons with :ref:`doc_3d_text` and TextMesh.
ga: Is féidir uirlisí cosúil le `Fontello <https://fontello.com/>`__ a úsáid chun comhaid chló a ghiniúint ina bhfuil veicteoirí a allmhairítear ó chomhaid SVG. Is féidir é seo a úsáid chun eilimintí veicteora saincheaptha a sholáthar mar chuid de do théacs, nó chun deilbhíní 3D easbhrúite a chruthú le : ref: `doc_3d_text` agus TextMesh.
it: Strumenti come `Fontello <https://fontello.com/>`__ si possono utilizzare per generare file di font contenenti vettori importati da file SVG. Ciò si può utilizzare per visualizzare elementi vettoriali personalizzati come parte del testo o per creare icone 3D estruse con :ref:`doc_3d_text` e TextMesh.
ru: Такие инструменты, как `Fontello <https://fontello.com/>`__, можно использовать для создания файлов шрифтов, содержащих векторы, импортированные из SVG-файлов. Это можно использовать для визуализации пользовательских векторных элементов в тексте или для создания вытянутых 3D-значков с помощью :ref:`doc_3d_text` и TextMesh.
ta: `ஃபோன்டெல்லோ <https://fontello.com/> __ __ போன்ற கருவிகள் எச்.வி.சி கோப்புகளிலிருந்து இறக்குமதி செய்யப்பட்ட திசையன்களைக் கொண்ட எழுத்துரு கோப்புகளை உருவாக்க பயன்படுத்தலாம். உங்கள் உரையின் ஒரு பகுதியாக தனிப்பயன் திசையன் கூறுகளை வழங்க இதைப் பயன்படுத்தலாம் அல்லது வெளியேற்றப்பட்ட 3D ஐகான்களை உருவாக்க: ref: `doc_3d_text` மற்றும் டெக்ச்டெமேச்.
uk: Такі інструменти, як `Fontello <https://fontello.com/>`__, можна використовувати для створення файлів шрифтів, які містять вектори, імпортовані з файлів SVG. Це можна використовувати для візуалізації власних векторних елементів як частини тексту або для створення екструдованих 3D-іконок за допомогою :ref:`doc_3d_text` і TextMesh.
zh_hant: 像 `Fontello <https://fontello.com/>`__ 這類工具可以把 SVG 匯入並產生字型檔案，可用於在文字中顯示自訂向量圖，也能搭配 :ref:`doc_3d_text` 與 TextMesh 製作 3D 圖示。

source: Fontello currently does not support creating multicolored fonts (which Godot can render). As of November 2022, support for multicolored fonts in icon font generation tools remains scarce.
ga: Ní thacaíonn Fontello le clónna ildaite a chruthú faoi láthair (ar féidir le Godot iad a dhéanamh). Amhail Samhain 2022, tá tacaíocht do chlónna ildaite in uirlisí giniúna cló deilbhíní fós gann.
it: Fontello attualmente non supporta la creazione di font multicolore (che Godot può renderizzare). A novembre 2022, il supporto per i font multicolore negli strumenti di generazione di font icona rimane scarso.
ru: Fontello в настоящее время не поддерживает создание многоцветных шрифтов (которые может отображать Godot). По состоянию на ноябрь 2022 года поддержка многоцветных шрифтов в инструментах для генерации иконочных шрифтов остаётся ограниченной.
ta: ஃபோண்டெல்லோ தற்போது பல வண்ண எழுத்துருக்களை உருவாக்குவதை ஆதரிக்கவில்லை (இது கோடோட் வழங்க முடியும்). நவம்பர் 2022 நிலவரப்படி, படவுரு எழுத்துரு தலைமுறை கருவிகளில் பல வண்ண எழுத்துருக்களுக்கான உதவி குறைவு.
uk: Наразі Fontello не підтримує створення різнокольорових шрифтів (які Godot може відобразити). Станом на листопад 2022 року підтримка різнокольорових шрифтів в інструментах створення шрифтів значків залишається малою.
zh_hant: Fontello 目前不支援多色字型（雖然 Godot 支援顯示）。截至 2022 年 11 月，大多數圖示字型產生工具對多色字型支援都很有限。

source: Depending on your use cases, this may lead to better results compared to using the ``img`` tag in :ref:`RichTextLabel <doc_bbcode_in_richtextlabel>`. Unlike bitmap images (including SVGs which are rasterized on import by Godot), true vector data can be resized to any size without losing quality.
ga: Ag brath ar do chásanna úsáide, d'fhéadfadh torthaí níos fearr a bheith mar thoradh air seo i gcomparáid le húsáid an chlib ``img`` i :ref:`RichTextLabel <doc_bbcode_in_richtextlabel>`. Murab ionann agus íomhánna bitmap (lena n-áirítear SVGanna atá rasterized ar allmhairiú ag Godot), is féidir sonraí fíor veicteoirí a athrú go dtí méid ar bith gan cáilíocht a chailliúint.
it: A seconda dei casi d'uso, questo potrebbe portare a risultati migliori rispetto all'utilizzo del tag ``img`` in :ref:`RichTextLabel <doc_bbcode_in_richtextlabel>`. A differenza delle immagini bitmap (inclusi gli SVG che sono rasterizzati durante l'importazione da Godot), i veri dati vettoriali si possono ridimensionare a qualsiasi dimensione senza perdere qualità.
ru: В зависимости от ваших вариантов использования это может дать лучшие результаты по сравнению с использованием тега ``img`` в :ref:`RichTextLabel <doc_bbcode_in_richtextlabel>`. В отличие от растровых изображений (включая SVG, которые Godot растеризует при импорте), векторные данные можно масштабировать до любого размера без потери качества.
ta: உங்கள் பயன்பாட்டு நிகழ்வுகளைப் பொறுத்து, `` img`` குறிச்சொல்லைப் பயன்படுத்துவதை ஒப்பிடும்போது இது சிறந்த முடிவுகளுக்கு வழிவகுக்கும்: ref: `richtextlabel <doc_bbcode_in_in_richtextlabel>`. பிட்மேப் படங்களைப் போலன்றி (கோடோட் மூலம் இறக்குமதி செய்யப்படும் எச்.வி.சி கள் உட்பட), உண்மையான திசையன் தரவை எந்த அளவிலும் தரத்தை இழக்காமல் மாற்றியமைக்க முடியும்.
uk: Залежно від ваших випадків використання це може призвести до кращих результатів порівняно з використанням тегу ``img`` у :ref:`RichTextLabel <doc_bbcode_in_richtextlabel>`. На відміну від растрових зображень (включаючи SVG, які растеризуються під час імпорту Годо), справжні векторні дані можна змінити до будь-якого розміру без втрати якості.
zh_hant: 視你的需求，這種做法有時會比在 :ref:`RichTextLabel <doc_bbcode_in_richtextlabel>` 用 ``img`` 標籤更好。因為圖示字型是真正的向量圖，能無損縮放，而一般點陣圖（或匯入後已柵格化的 SVG）會失真。
