Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: If changing the hinting mode has no visible effect after clicking **Reimport**, it's usually because the font doesn't include hinting instructions. This can be resolved by looking for a version of the font file that includes hinting instructions, or enabling **Force Autohinter** in the Import dock. This will use `FreeType <https://freetype.org/>`__'s autohinter to automatically add hinting instructions to the imported font.
ga: Mura mbíonn aon éifeacht infheicthe ag athrú an mhód leid tar éis **Athiomportáil** a chliceáil, is iondúil nach mbíonn treoracha leid san áireamh sa chló. Is féidir é seo a réiteach trí leagan den chlóchomhad a lorg ina bhfuil treoracha leide, nó trí **Force Autohinter** a chumasú sa duga Iompórtála. Bainfidh sé seo úsáid as `FreeType <https://freetype.org/>`__'s autohinter chun treoracha leide a chur leis an gcló iompórtáilte go huathoibríoch.
it: Se cambiare la modalità di hinting non produce alcun effetto evidente dopo aver cliccato su **Reimporta**, solitamente è perché il font non include istruzioni di hinting. Cià si può risolvere cercando una versione del file del font che includa istruzioni di hinting oppure abilitando **Forza autohinter** nel pannello Importazione. Facendo così verrà utilizzato l'hinting automatico di `FreeType <https://freetype.org/>`__ per aggiungere automaticamente istruzioni di hinting al font importato.
ru: Если изменение режима хинтинга не даёт видимого эффекта после нажатия кнопки **Reimport**, обычно это связано с тем, что шрифт не содержит инструкций по хинтингу. Проблему можно решить, найдя версию файла шрифта с инструкциями по хинтингу или включив параметр **Force Autohinter** в панели импорта. В этом случае автохинтинг `FreeType <https://freetype.org/>`__ будет использоваться для автоматического добавления инструкций по хинтингу к импортируемому шрифту.
ta: ** மறுசீரமைப்பு ** ஐக் சொடுக்கு செய்த பிறகு குறிப்பு பயன்முறையை மாற்றுவது புலப்படும் விளைவைக் கொண்டிருக்கவில்லை என்றால், இது வழக்கமாக எழுத்துருவில் குறிப்புக் குறிப்புகள் இல்லை. குறிப்பு வழிமுறைகளை உள்ளடக்கிய எழுத்துரு கோப்பின் பதிப்பைத் தேடுவதன் மூலமோ அல்லது இறக்குமதி கப்பல்துறையில் ** ஃபோர்ச் ஆட்டோஇண்டர் ** ஐ இயக்குவதன் மூலமோ இதைத் தீர்க்க முடியும். இறக்குமதி செய்யப்பட்ட எழுத்துருவில் குறிப்பு வழிமுறைகளை தானாக சேர்க்க இது `ஃப்ரீடைப் <https://freetype.org/> __ இன் ஆட்டோஇண்டரைப் பயன்படுத்தும்.
uk: Якщо зміна режиму підказок не має видимого ефекту після натискання **Повторно імпортувати**, зазвичай це тому, що шрифт не містить інструкцій щодо підказок. Цю проблему можна вирішити, знайшовши версію файлу шрифту, яка містить інструкції щодо підказок, або ввімкнувши **Примусову автопідказку** на панелі імпорту. Це використовуватиме автопідказку `FreeType <https://freetype.org/>`__ для автоматичного додавання інструкцій підказки до імпортованого шрифту.
zh_hant: 如果點擊 **重新匯入** 後改變微調模式沒有效果，通常代表該字型檔本身沒有微調指令。你可以找有微調資訊的版本，或在匯入面板啟用 **強制自動微調**，這會用 `FreeType <https://freetype.org/>`__ 的自動微調器自動產生微調指令。

source: Subpixel positioning
ga: Suíomh subpixel
it: Posizionamento subpixel
ru: Subpixel positioning (Субпиксельное позиционирование)
ta: சப் படப்புள்ளி பொருத்துதல்
uk: Субпіксельне позиціонування
zh_hant: 子像素定位

source: Subpixel positioning can be adjusted. This is a `FreeType <https://freetype.org/>`__ feature that allows glyphs to be rendered more closely to their intended form. The default setting of **Auto** automatically enables subpixel positioning at small sizes, but disables it at large font sizes to improve rasterization performance.
ga: Is féidir suíomh subpixel a choigeartú. Is gné `FreeType <https://freetype.org/>`__ í seo a cheadaíonn glyphs a rindreáil níos gaire don fhoirm atá beartaithe dóibh. Cumasaíonn socrú réamhshocraithe **Auto** go huathoibríoch suíomh fo-phicteilín ag méideanna beaga, ach díchumasaítear é ar mhórmhéideanna cló chun feidhmíocht rasterization a fheabhsú.
it: Il posizionamento subpixel può essere regolato. Questa è una funzionalità di `FreeType <https://freetype.org/>`__ che consente di renderizzare i glifi in modo più fedele alla loro forma originale. L'impostazione predefinita **Auto** abilita automaticamente il posizionamento subpixel per le piccole dimensioni, ma lo disabilita per le dimensioni grandi di font per migliorare le prestazioni di rasterizzazione.
ru: Субпиксельное позиционирование можно настроить. Это функция `FreeType <https://freetype.org/>`__, которая позволяет отображать глифы ближе к их первоначальной форме. Значение по умолчанию **Auto** автоматически включает субпиксельное позиционирование при малых размерах шрифта, но отключает его при больших размерах шрифта для повышения производительности растеризации.
ta: சப் படப்புள்ளி பொருத்துதல் சரிசெய்யப்படலாம். இது ஒரு `ஃப்ரீடைப் <https://freetype.org/> __ __ அம்சமாகும், இது கிளிஃப்களை அவற்றின் நோக்கம் கொண்ட வடிவத்திற்கு மிகவும் நெருக்கமாக வழங்க அனுமதிக்கிறது. ** ஆட்டோ ** இன் இயல்புநிலை அமைப்பு தானாகவே சிறிய அளவுகளில் சப் படப்புள்ளி பொருத்துதலை செயல்படுத்துகிறது, ஆனால் ராச்டரைசேசன் செயல்திறனை மேம்படுத்த பெரிய எழுத்துரு அளவுகளில் அதை முடக்குகிறது.
uk: Позиціонування субпікселя можна регулювати. Це функція `FreeType <https://freetype.org/>`__, яка дозволяє відтворювати гліфи ближче до їх запланованої форми. Параметр за замовчуванням **Авто** автоматично вмикає субпіксельне позиціонування для малих розмірів, але вимикає його для великих розмірів шрифту, щоб покращити продуктивність растеризації.
zh_hant: Godot 支援調整子像素定位（Subpixel Positioning），這是 `FreeType <https://freetype.org/>`__ 的功能，讓字型算繪更接近原始設計。預設 **自動** 會在字型較小時啟用，字型較大時停用，以提升效能。

source: You can force the subpixel positioning mode to **Disabled**, **One half of a pixel** or **One quarter of a pixel**. **One quarter of a pixel** provides the best quality, at the cost of longer rasterization times.
ga: Is féidir leat an modh suite subpixel a chur i bhfeidhm **Díchumasaithe**, **Leath amháin de phicteilín** nó **Aon cheathrú de phicteilín**. ** Soláthraíonn aon cheathrú de picteilín ** an caighdeán is fearr, ar chostas amanna rasterization níos faide.
it: È possibile forzare la modalità di posizionamento subpixel su **Disabled**, **One half of a pixel** o **One quarter of a pixel**. **One quarter of a pixel** offre la qualità migliore, al costo di tempi di rasterizzazione più lunghi.
ru: Вы можете принудительно установить режим позиционирования субпикселей на **Disabled**, **One half of a pixel (Половина пикселя)** или **One quarter of a pixel (Четверть пикселя)**. **Четверть пикселя** обеспечивает наилучшее качество, но увеличивает время растеризации.
ta: நீங்கள் சப் படப்புள்ளி பொருத்துதல் பயன்முறையை ** முடக்கப்பட்ட **, ** ஒரு பிக்சலின் ஒரு பாதி ** அல்லது ** ஒரு பிக்சலின் கால் பகுதியை ** என கட்டாயப்படுத்தலாம். ** ஒரு பிக்சலின் கால் பகுதியினர் ** நீண்ட ராச்டரைசேசன் நேரங்களின் செலவில் சிறந்த தரத்தை வழங்குகிறது.
uk: Ви можете примусово встановити режим позиціонування субпікселя на **Вимкнено**, **Половина пікселя** або **Чверть пікселя**. **Одна чверть пікселя** забезпечує найкращу якість за рахунок довшого часу растеризації.
zh_hant: 你也可以強制設定子像素定位為**停用**、**半像素**或**四分之一像素**。四分之一像素效果最佳但會略影響效能。

source: Changing antialiasing, hinting and subpixel positioning has the most visible effect at smaller font sizes.
ga: Tá an éifeacht is infheicthe ag athrú suíomh antialiasing, hinting agus subpixel ag méideanna cló níos lú.
it: Cambiare l'antialiasing, l'hinting e il posizionamento subpixel ha un effetto più notevole con dimensioni più piccole di font.
ru: Изменение сглаживания, хинтинга и субпиксельного позиционирования имеет наиболее заметный эффект при меньших размерах шрифта.
ta: ஆன்டியாலியாசிங், குறித்தல் மற்றும் சப் படப்புள்ளி பொருத்துதல் ஆகியவற்றை மாற்றுவது சிறிய எழுத்துரு அளவுகளில் மிகவும் புலப்படும் விளைவைக் கொண்டுள்ளது.
uk: Зміна згладжування, підказок і позиціонування субпікселів має найбільш помітний ефект при менших розмірах шрифту.
zh_hant: 調整抗鋸齒、微調和子像素定位，對小字型最明顯。

source: Fonts that have a pixel art appearance should have their subpixel positioning mode set to **Disabled**. Otherwise, the font may appear to have uneven pixel sizes.
ga: Ba chóir go mbeadh a mód suite subpixel ag clónna a bhfuil cuma ealaíne picteilín orthu **Díchumasaithe**. Seachas sin, is cosúil go bhfuil méideanna picteilín míchothroma ag an gcló.
it: I font con un aspetto da pixel art dovrebbero avere la modalità di posizionamento subpixel impostata su **Disabled**. Altrimenti, il font potrebbe apparire con dimensioni non uniformi di pixel.
ru: Для шрифтов, имеющих пиксельный вид, режим субпиксельного позиционирования должен быть установлен на **Disabled**. В противном случае шрифт может выглядеть с неравномерным размером пикселей.
ta: படப்புள்ளி கலை தோற்றத்தைக் கொண்ட எழுத்துருக்கள் அவற்றின் சப் படப்புள்ளி பொருத்துதல் பயன்முறையை ** முடக்கப்பட்ட ** என அமைக்க வேண்டும். இல்லையெனில், எழுத்துருவில் சீரற்ற படப்புள்ளி அளவுகள் இருப்பதாகத் தோன்றலாம்.
uk: Шрифти, які мають вигляд піксельного зображення, повинні мати режим позиціонування субпікселя на **Вимкнено**. Інакше шрифт може мати неоднаковий розмір пікселів.
zh_hant: 如果是像素風（Pixel Art）字型，建議將子像素定位設為**停用**，否則像素大小可能顯得不均勻。

source: This step is not required for bitmap fonts, as subpixel positioning is only relevant for dynamic fonts (which are usually made of vector elements).
ga: Níl an chéim seo ag teastáil le haghaidh clónna mapa giotán, toisc nach bhfuil suíomh fo-mheascáin ábhartha ach amháin le haghaidh clónna dinimiciúla (a dhéantar de ghnáth as eilimintí veicteora).
it: Questo passaggio non è necessario per i font bitmap, poiché il posizionamento subpixel è rilevante solo per i font dinamici (che solitamente sono costituiti da elementi vettoriali).
ru: Этот шаг не требуется для растровых шрифтов, поскольку субпиксельное позиционирование актуально только для динамических шрифтов (которые обычно состоят из векторных элементов).
ta: பிட்மேப் எழுத்துருக்களுக்கு இந்த படி தேவையில்லை, ஏனெனில் சப் படப்புள்ளி பொருத்துதல் மாறும் எழுத்துருக்களுக்கு மட்டுமே பொருத்தமானது (அவை பொதுவாக திசையன் கூறுகளால் ஆனவை).
uk: Цей крок не є обов’язковим для растрових шрифтів, оскільки субпіксельне позиціонування актуальне лише для динамічних шрифтів (які зазвичай складаються з векторних елементів).
zh_hant: 點陣字型不需設定子像素定位，這只影響動態（向量）字型。

source: Mipmaps
ga: MipmapsName
it: Mipmap
ru: Мип-карты
ta: மிப்மாப்ச்
uk: MIP-текстурування
zh_hant: Mipmap（多重貼圖）

source: By default, fonts do not have mipmaps generated to reduce memory usage and speed up rasterization. However, this can cause downscaled fonts to become grainy. This can be especially noticeable with :ref:`doc_3d_text` that doesn't have **Fixed Size** enabled. This can also occur when displaying text with a traditional rasterized (non-:ref:`MSDF <doc_using_fonts_msdf>`) font in a Control node that has its scale lower than ``(1, 1)``.
ga: De réir réamhshocraithe, níl mipmaps ginte ag clónna chun úsáid chuimhne a laghdú agus rasterization a bhrostú. Mar sin féin, féadann sé seo a bheith ina chúis le clónna íosscála a bheith gránach. Is féidir é seo a thabhairt faoi deara go háirithe le :ref:`doc_3d_text` nach bhfuil **Méid Seasta** cumasaithe aige. Féadfaidh sé seo tarlú freisin nuair a thaispeánann téacs le cló traidisiúnta rasterized (neamh:tag:`MSDF <doc_using_fonts_msdf>`) i nód Rialaithe a bhfuil a scála níos ísle ná ``(1, 1)``.
it: Normalmente, i font non generano mipmap per ridurre l'utilizzo di memoria e velocizzare la rasterizzazione. Tuttavia, ciò può far apparire granulosi i font rimpiccioliti. Può essere particolarmente evidente con :ref:`doc_3d_text` che non ha **Fixed Size** abilitato. Può verificarsi anche quando si visualizza testo con un font rasterizzato tradizionale (non :ref:`MSDF <doc_using_fonts_msdf>`) in un nodo Control con una scala inferiore a ``(1, 1)``.
ru: По умолчанию шрифты не создают MIP-карт, чтобы уменьшить использование памяти и ускорить растеризацию. Однако, это может привести к тому, что уменьшенние размера шрифтов приведёт к зернистости. Это может быть особенно заметно с :ref:`doc_3d_text`, для которого не включен **Fixed Size**. Это так же может произойти при отображении текста традиционным растеризованным (не -:ref:`MSDF <doc_using_fonts_msdf>`) шрифтом в узле Control, масштаб которого меньше , чем ``(1, 1)``.
ta: இயல்பாக, எழுத்துருக்களில் நினைவக பயன்பாட்டைக் குறைக்கவும், ராச்டரைசேசனை விரைவுபடுத்தவும் MIPMAPS உருவாக்கப்படவில்லை. இருப்பினும், இது கீழ்நோக்கி எழுத்துருக்கள் தானியமாக மாறக்கூடும். இது குறிப்பாக கவனிக்கத்தக்கதாக இருக்கலாம்: Ref: `doc_3d_text` இது ** நிலையான அளவு ** இயக்கப்பட்டிருக்கவில்லை. ஒரு பாரம்பரிய ராச்டரைச் செய்யப்பட்ட (அல்லாத: ref: `msdf <doc_using_fonts_msdf>`) எழுத்துரு ஒரு கட்டுப்பாட்டு முனையில் அதன் அளவைக் கொண்டிருக்கும் `` (1, 1) `` ஐ விடக் குறைவாக இருக்கும்.
uk: За замовчуванням шрифти не створюють міп-мапи, щоб зменшити використання пам’яті та прискорити растеризацію. Однак це може призвести до того, що зменшені шрифти стануть зернистими. Це може бути особливо помітно з :ref:`doc_3d_text`, для якого не ввімкнено **Фіксований розмір**. Це також може статися під час відображення тексту традиційним растеризованим (не-:ref:`MSDF <doc_using_fonts_msdf>`) шрифтом у контрольному вузлі, масштаб якого нижчий за ``(1, 1)``.
zh_hant: 預設情況下，字型不會產生 mipmap 以節省記憶體與提升光柵化效率。但這會讓縮小後的字型產生顆粒感，特別是在 :ref:`doc_3d_text` 未啟用**固定大小**時，或是在 Control 節點縮放小於 `(1, 1)` 且使用傳統光柵化（非 :ref:`MSDF <doc_using_fonts_msdf>`）字型時更明顯。

source: After selecting a font in the FileSystem dock, you can enable the **Mipmaps** in the Import dock to improve downscaled font rendering appearance.
ga: Tar éis cló a roghnú sa duga FileSystem, is féidir leat an **Mipmaps ** a chumasú sa duga Iompórtála chun cuma rindreáil cló íosscálaithe a fheabhsú.
it: Dopo aver selezionato un font nel pannello FileSystem, è possibile abilitare **Mipmaps** nel pannello Importazione per migliorare l'aspetto di rendering dei font rimpiccioliti.
ru: После выбора шрифта в панели FileSystem (Файловая система), вы можете включить **MIP-карты** в панели импорта, чтобы улучшить отображение уменьшенных шрифтов.
ta: கோப்பு முறைமை கப்பல்துறையில் ஒரு எழுத்துருவைத் தேர்ந்தெடுத்த பிறகு, குறைத்து மதிப்பிடப்பட்ட எழுத்துரு வழங்குதல் தோற்றத்தை மேம்படுத்த இறக்குமதி கப்பல்துறையில் ** MIPMAPS ** ஐ இயக்கலாம்.
uk: Вибравши шрифт у док-станції FileSystem, ви можете ввімкнути **Mipmaps** у док-станції «Імпорт», щоб покращити відображення зменшених шрифтів.
zh_hant: 在檔案系統選取字型後，可在匯入面板啟用 **Mipmaps** 來改善縮小字型的顯示品質。

source: Mipmaps can be enabled on MSDF fonts as well. This can improve font rendering quality a little at smaller-than-default sizes, but MSDF fonts are already resistant to graininess out of the box.
ga: Is féidir Mipmaps a chumasú ar chlónna MSDF chomh maith. Is féidir leis seo feabhas a chur ar chaighdeán rindreáil cló beagán ag méideanna níos lú ná réamhshocraithe, ach tá clónna MSDF frithsheasmhach in aghaidh gráinneacht as an mbosca cheana féin.
it: Le mipmap si possono abilitare anche sui font MSDF. Ciò può migliorare leggermente la qualità del rendering dei font con dimensioni inferiori a quelle predefinite, ma si noti che i font MSDF sono già di loro resistenti alla granulosità.
ru: MIP-карты также могут быть включены для MSDF шрифтов. Это может немного улучшить качество рендеринга шрифта при размерах меньше значений по умолчанию, но MSDF шрифты изначально устойчивы к пикселизации.
ta: MIPMAP களை MSDF எழுத்துருக்களிலும் இயக்க முடியும். இது எழுத்துரு வழங்குதல் தரத்தை-தாக்கல் அளவுகளை விட சிறிய அளவில் சிறிது மேம்படுத்தலாம், ஆனால் எம்.எச்.டி.எஃப் எழுத்துருக்கள் ஏற்கனவே பெட்டியிலிருந்து தானியத்தை எதிர்க்கின்றன.
uk: Mipmaps також можна ввімкнути для шрифтів MSDF. Це може трохи покращити якість візуалізації шрифтів при розмірах, менших за замовчування, але шрифти MSDF уже готові до зернистості.
zh_hant: MSDF 字型也能啟用 Mipmap，雖然小於預設尺寸時會略為改善顯示品質，不過 MSDF 字型本身就很抗鋸齒，不太會有顆粒問題。

source: MSDF font rendering
ga: Rindreáil clófhoirne MSDF
it: Rendering di font MSDF
ru: Рендеринг шрифтов MSDF
ta: MSDF எழுத்துரு வழங்குதல்
uk: Візуалізація шрифтів MSDF
zh_hant: MSDF 字型算繪

source: Multi-channel signed distance field (MSDF) font rendering allows rendering fonts at any size, without having to re-rasterize them when their size changes.
ga: Ceadaíonn rindreáil cló réimse achar sínithe Il-chainéil (MSDF) clónna a rindreáil ar aon mhéid, gan iad a ath-rasterize nuair a athraíonn a méid.
it: Il rendering di font MSDF (Multi-channel Signed Distance Field) consente di renderizzare i font in qualsiasi dimensione, senza doverli rasterizzare nuovamente quando ne cambiano le dimensioni.
ru: Визуализация шрифта методом многоканального поля расстояния со знаком (MSDF) позволяет визуализировать шрифты любого рзмера, без необходимости повторной растеризации при изменении их размера.
ta: மல்டி-சேனல் கையொப்பமிடப்பட்ட தொலைதூர புலம் (எம்.எச்.டி.எஃப்) எழுத்துரு வழங்குதல் எந்த அளவிலும் வழங்குதல் செய்ய அனுமதிக்கிறது, அவற்றின் அளவு மாறும்போது அவற்றை மீண்டும் ராச்டிசிச் செய்யாமல்.
uk: Візуалізація шрифтів у багатоканальному полі відстаней зі знаком (MSDF) дозволяє відтворювати шрифти будь-якого розміру без необхідності їх повторної растеризації при зміні розміру.
zh_hant: 多通道帶符號距離場（MSDF）字型算繪允許你任意縮放字型，且不必每次改變大小都重新光柵化。

source: MSDF font rendering has 2 upsides over traditional font rasterization, which Godot uses by default:
ga: Tá rindreáil cló MSDF 2 upsides thar rasterization cló traidisiúnta, a úsáideann Godot de réir réamhshocraithe:
it: Il rendering di font MSDF ha due vantaggi rispetto alla rasterizzazione tradizionale dei font, che Godot utilizza come predefinito:
ru: Визуализация шрифта с помощью MSDF имеет 2 преимущества над традиционной растеризацией, которая используется по умолчанию в Godot:
ta: எம்.எச்.டி.எஃப் எழுத்துரு வழங்குதல் பாரம்பரிய எழுத்துரு ராச்டரைசேசனை விட 2 தலைகீழ்களைக் கொண்டுள்ளது, இது கோடோட் இயல்பாகவே பயன்படுத்துகிறது:
uk: Візуалізація шрифтів MSDF має 2 переваги порівняно з традиційною растеризацією шрифтів, яку Godot використовує за замовчуванням:
zh_hant: MSDF 字型算繪相較於 Godot 傳統字型光柵化有兩個主要優點：

source: The font will always look crisp, even at huge sizes.
ga: Beidh cuma briosc ar an gcló i gcónaí, fiú ar mhéideanna ollmhóra.
it: Il font apparirà sempre nitido, anche se scritto in enormi dimensioni.
ru: Шрифт всегда выглядит четким, даже при больших размерах.
ta: எழுத்துரு எப்போதும் மிருதுவாக இருக்கும், பெரிய அளவுகளில் கூட.
uk: Шрифт завжди буде виглядати чітким, навіть при великих розмірах.
zh_hant: 字型再大也總是清晰。

source: There is less stuttering when rendering characters *at large font sizes* for the first time, as there is no rasterization performed.
ga: Níl an oiread céanna stuttering ann nuair a rindreáil carachtair *ag clómhéideanna móra *den chéad uair, mar nach bhfuil aon rasterization a dhéantar.
it: Si verifica meno stuttering quando si renderizzano caratteri *in grandi dimensioni di font* per la prima volta, poiché nessuna rasterizzazione viene eseguita.
ru: Когда символы *шрифта большого размера* визуализируются впервые, происходит меньше подтормаживаний, поскольку растеризация не выполняется.
ta: ராச்டரைசேசன் செய்யப்படாததால், முதல் முறையாக பெரிய எழுத்துரு அளவுகளில் * எழுத்துக்களை வழங்கும்போது குறைவான தடுமாற்றம் உள்ளது.
uk: Під час відтворення символів *великого розміру* вперше спостерігається менше затримок, оскільки растеризація не виконується.
zh_hant: 首次顯示*大字型*時不會卡頓，因為不須即時光柵化。

source: The downsides of MSDF font rendering are:
ga: Is iad na míbhuntáistí a bhaineann le rindreáil cló MSDF ná:
it: Gli svantaggi del rendering di font MSDF sono:
ru: Недостатки рендеринга шрифтов MSDF:
ta: MSDF எழுத்துரு ரெண்டரிங்கின் தீமைகள்:
uk: Недоліки відтворення шрифтів MSDF:
zh_hant: MSDF 字型算繪的缺點：

source: Higher baseline cost for font rendering. This is usually not noticeable on desktop platforms, but it can have an impact on low-end mobile devices.
ga: Costas bonnlíne níos airde le haghaidh rindreáil cló. De ghnáth ní thugtar é seo faoi deara ar ardáin deisce, ach d'fhéadfadh tionchar a bheith aige ar ghléasanna soghluaiste íseal-deireadh.
it: Costo di base più elevato per renderizzare i font. Questo solitamente non si nota sulle piattaforme desktop, ma può avere un impatto sui dispositivi mobili di fascia bassa.
ru: Более высокая базовая сложность визуализации. Это обычно незаметно на настольных платформах, но может оказывать влияние на низко производительных мобильных устройствах.
ta: எழுத்துரு ரெண்டரிங்கிற்கான அதிக அடிப்படை செலவு. இது பொதுவாக டெச்க்டாப் இயங்குதளங்களில் கவனிக்கப்படாது, ஆனால் இது குறைந்த-இறுதி மொபைல் சாதனங்களில் தாக்கத்தை ஏற்படுத்தும்.
uk: Вища базова вартість відтворення шрифтів. Зазвичай це не помітно на настільних платформах, але це може вплинути на мобільні пристрої низького класу.
zh_hant: 基礎算圖成本較高，桌面平台通常感覺不出差異，但在低階行動裝置會有影響。

source: Fonts at small sizes will not look as clear as rasterized fonts, due to the lack of hinting.
ga: Ní bheidh clónna ar mhéideanna beaga chomh soiléir le clónna rasterized, mar gheall ar an easpa leid.
it: I font di piccole dimensioni non appariranno chiari come i font rasterizzati, a causa della mancanza di hinting.
ru: Шрифты маленького размера будут выглядеть менее четко, чем растеризованные, из-за отсутствия хинтования.
ta: சிறிய அளவுகளில் உள்ள எழுத்துருக்கள் ராச்டரைச் செய்யப்பட்ட எழுத்துருக்களைப் போல தெளிவாக இருக்காது, குறிப்புகள் இல்லாததால்.
uk: Шрифти невеликого розміру виглядатимуть не так чітко, як растеризовані, через відсутність підказок.
zh_hant: 小字型缺乏微調（Hinting），不如傳統光柵化清晰。

source: Rendering new glyphs for the first time *at small font sizes* may be more expensive compared to traditional rasterized fonts. :ref:`doc_using_fonts_font_prerendering` can be used to alleviate this.
ga: D'fhéadfadh sé go mbeadh sé níos costasaí glyphs nua a dhéanamh den chéad uair *ag clómhéideanna beaga *i gcomparáid le clónna traidisiúnta rasterized. :ref:Is féidir 'doc_using_fonts_font_prerendering' a úsáid chun é seo a mhaolú.
it: Renderizzare nuovi glifi per la prima volta *con dimensioni ridotte di font* potrebbe risultare più costoso rispetto ai tradizionali font rasterizzati. :ref:`doc_using_fonts_font_prerendering` si può utilizzare per rimediare.
ru: Первая визуализация символов *шрифта малого размера* может быть более дорогой в сравнении с традиционными растеризованными шрифтами. :ref:`doc_using_fonts_font_prerendering` можно использовать чтобы уменьшить это.
ta: புதிய கிளிஃப்களை முதன்முறையாக வழங்குவது * சிறிய எழுத்துரு அளவுகளில் * பாரம்பரிய ராச்டரைச் செய்யப்பட்ட எழுத்துருக்களுடன் ஒப்பிடும்போது மிகவும் விலை உயர்ந்ததாக இருக்கலாம். .
uk: Відтворення нових гліфів уперше *невеликими розмірами шрифтів* може бути дорожчим порівняно з традиційними растеризованими шрифтами. :ref:`doc_using_fonts_font_prerendering` можна використати, щоб полегшити це.
zh_hant: 首次顯示*小字型*的新字元時，算圖成本比傳統光柵化更高。可以使用 :ref:`doc_using_fonts_font_prerendering` 預先算繪減輕這個問題。

source: LCD subpixel optimization cannot be enabled for MSDF fonts.
ga: Ní féidir leas iomlán a bhaint subpixel LCD a chumasú le haghaidh clónna MSDF.
it: L'ottimizzazione subpixel LCD non può essere abilitata per i font MSDF.
ru: Для шрифтов MSDF нельзя включить субпиксельную оптимизацию ЖК-дисплеев.
ta: MSDF எழுத்துருக்களுக்கு எல்சிடி சப் படப்புள்ளி தேர்வுமுறை இயக்க முடியாது.
uk: Для шрифтів MSDF не можна ввімкнути субпіксельну оптимізацію РК-дисплея.
zh_hant: MSDF 字型無法啟用 LCD 子像素優化。
