Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: Using Fonts
ga: Clónna a Úsáid
it: Utilizzare i font
ru: Использование Шрифтов
ta: எழுத்துருக்களைப் பயன்படுத்துதல்
uk: Використання шрифтів
zh_hant: 使用字型

source: Godot allows you to set specific fonts for different UI nodes.
ga: Godot is féidir leat a shocrú clónna ar leith le haghaidh nóid Chomhéadain éagsúla.
it: Godot consente di impostare font specifici per diversi nodi dell'interfaccia utente.
ru: Godot позволяет устанавливать определенные шрифты для различных узлов пользовательского интерфейса (UI).
ta: வெவ்வேறு இடைமுகம் முனைகளுக்கு குறிப்பிட்ட எழுத்துருக்களை அமைக்க கோடோட் உங்களை அனுமதிக்கிறது.
uk: Godot дозволяє встановлювати певні шрифти для різних вузлів інтерфейсу.
zh_hant: Godot 允許你為不同的 UI 節點指定特定的字型。

source: There are three different places where you can setup font usage. The first is the theme editor. Choose the node you want to set the font for and select the font tab. The second is in the inspector for control nodes under **Theme Overrides > Fonts**. Lastly, in the inspector settings for themes under **Default Font**.
ga: Tá trí áit dhifriúla ann inar féidir leat úsáid cló a shocrú. Is é an chéad eagarthóir téama. Roghnaigh an nód ar mhaith leat an cló a shocrú dó agus roghnaigh an cluaisín cló. Tá an dara ceann sa chigire le haghaidh nóid rialaithe faoi **Téama Sáraítear > Clónna**. Ar deireadh, sna socruithe cigire do théamaí faoi **Cló Réamhshocraithe**.
ru: Настроить использование шрифтов можно в трёх местах. Первый — в редакторе тем. Выберите узел, для которого хотите установить шрифт, и перейдите на вкладку "font". Второй — в инспекторе узлов управления в разделе **Theme Overrides > Fonts**. И наконец, в настройках инспектора тем в разделе **Default Font**.
ta: எழுத்துரு பயன்பாட்டை நீங்கள் அமைக்கக்கூடிய மூன்று வெவ்வேறு இடங்கள் உள்ளன. முதலாவது கருப்பொருள் ஆசிரியர். நீங்கள் எழுத்துருவை அமைக்க விரும்பும் முனையைத் தேர்ந்தெடுத்து எழுத்துரு தாவலைத் தேர்ந்தெடுக்கவும். இரண்டாவது ** கருப்பொருள் மேலெழுதும்> எழுத்துருக்கள் ** இன் கீழ் கட்டுப்பாட்டு முனைகளுக்கான இன்ச்பெக்டரில் உள்ளது. கடைசியாக, ** இயல்புநிலை எழுத்துரு ** இன் கீழ் உள்ள கருப்பொருள்களுக்கான இன்ச்பெக்டர் அமைப்புகளில்.
uk: Є три різні місця, де ви можете налаштувати використання шрифту. Перший — редактор тем. Виберіть вузол, для якого потрібно встановити шрифт, і виберіть вкладку шрифту. Другий — в інспекторі вузлів керування в розділі **Заміни теми > Шрифти**. Нарешті, у налаштуваннях інспектора для тем у розділі **Шрифт за замовчуванням**.
zh_hant: 你可以在三個地方設定字型。第一是在主題編輯器，選取你要設定的節點並切換到字型分頁。第二是在控制節點的屬性檢視器裡的 **主題覆寫 > 字型**。最後是在主題的屬性檢視器裡的 **預設字型** 欄位。

source: If no font override is specified anywhere, `Open Sans <https://fonts.google.com/specimen/Open+Sans>`__ SemiBold is used as the default project font.
ga: Mura bhfuil aon sáraithe cló sonraithe áit ar bith, úsáidtear `Open Sans <https://fonts.google.com/specimen/Open+Sans>`__ SemiBold mar an cló réamhshocraithe tionscadail.
ru: Если нигде не указано переопределение шрифта, в качестве шрифта проекта по умолчанию используется `Open Sans <https://fonts.google.com/specimen/Open+Sans>`__ SemiBold.
ta: எழுத்துரு மேலெழுதல் எங்கும் குறிப்பிடப்படவில்லை என்றால், `திறந்த சான்ச் <https://fonts.google.com/specimen/open+sans>` __ செமிபோல்ட் இயல்புநிலை திட்ட எழுத்துருவாக பயன்படுத்தப்படுகிறது.
uk: Якщо заміна шрифту ніде не вказана, `Open Sans <https://fonts.google.com/specimen/Open+Sans>`__ SemiBold використовується як шрифт проекту за умовчанням.
zh_hant: 如果沒有指定任何字型覆寫，就會使用 `Open Sans <https://fonts.google.com/specimen/Open+Sans>`__ SemiBold 作為預設專案字型。

source: Since Godot 4.0, font sizes are no longer defined in the font itself but are instead defined in the node that uses the font. This is done in the **Theme Overrides > Font Sizes** section of the inspector.
ga: Ós rud é Godot 4.0, ní shainmhínítear clómhéid sa chló féin a thuilleadh ach sainítear iad ina ionad sin sa nód a úsáideann an cló. Déantar é seo sa rannán **Téama Sáraítear > Clómhéideanna** den chigire.
ru: Начиная с Godot 4.0, размеры шрифтов больше не определяются в самом шрифте, а определяются в узле, который его использует. Это делается в разделе **Theme Overrides > Font Sizes** инспектора.
ta: கோடோட் 4.0 என்பதால், எழுத்துரு அளவுகள் இனி எழுத்துருவில் வரையறுக்கப்படவில்லை, மாறாக எழுத்துருவைப் பயன்படுத்தும் முனையில் வரையறுக்கப்படுகின்றன. இது ** கருப்பொருள் மேலெழுதும்> எழுத்துரு அளவுகள் ** இன்ச்பெக்டரின் பிரிவில் செய்யப்படுகிறது.
uk: Починаючи з Godot 4.0, розміри шрифтів більше не визначаються в самому шрифті, а визначаються у вузлі, який використовує шрифт. Це робиться в розділі інспектора **Заміна теми > Розмір шрифту**.
zh_hant: 自 Godot 4.0 起，字型大小不是在字型本身設定，而是在使用該字型的節點設定。你可在屬性檢視器的 **主題覆寫 > 字型大小** 區域調整。

source: This allows changing the font size without having to duplicate the font resource for every different font size.
ga: Ligeann sé seo méid an chló a athrú gan an acmhainn chló a dhúbailt le haghaidh gach clómhéid éagsúil.
ru: Это позволяет изменять размер шрифта без необходимости дублировать ресурс шрифта для каждого другого размера шрифта.
ta: ஒவ்வொரு வெவ்வேறு எழுத்துரு அளவிற்கும் எழுத்துரு வளத்தை நகலெடுக்காமல் எழுத்துரு அளவை மாற்ற இது அனுமதிக்கிறது.
uk: Це дозволяє змінювати розмір шрифту без необхідності дублювати ресурс шрифту для кожного іншого розміру шрифту.
zh_hant: 這讓你能直接調整字型大小，而不用為每種大小分別複製字型資源。

source: There are 2 kinds of font files: *dynamic* (TTF/OTF/WOFF/WOFF2 formats) and *bitmap* (BMFont ``.fnt`` format or monospaced image). Dynamic fonts are the most commonly used option, as they can be resized and still look crisp at higher sizes. Thanks to their vector-based nature, they can also contain a lot more glyphs while keeping a reasonable file size compared to bitmap fonts. Dynamic fonts also support some advanced features that bitmap fonts cannot support, such as *ligatures* (several characters transforming into a single different design).
ga: Tá 2 chineál comhaid chló ann: *dynamic * (formáidí TTF / OTF / WOFF / WOFF2) agus *bitmap * (formáid BMFont ''.fnt'' nó íomhá monospaced). Is iad na clónna dinimiciúla an rogha is coitianta a úsáidtear, mar is féidir iad a athrú agus fós breathnú briosc ar mhéideanna níos airde. A bhuíochas dá nádúr veicteoir-bhunaithe, is féidir leo a lán glyphs níos mó a bheith iontu agus méid comhaid réasúnta a choinneáil i gcomparáid le clónna bitmap. Tacaíonn clónna dinimiciúla freisin le roinnt gnéithe chun cinn nach féidir le clónna mapa giotán tacú leo, mar shampla *ligatures *(roinnt carachtar ag athrú go dearadh difriúil amháin).
ru: Существует 2 типа файлов шрифтов: *dynamic (динамические)* (форматы TTF/OTF/WOFF/WOFF2) и *bitmap (растровые)* (формат BMFont ``.fnt`` или моноширинное изображение). Динамические шрифты — наиболее распространённый вариант, поскольку их размер можно менять, и они сохраняют чёткость даже при больших размерах. Благодаря своей векторной природе они также могут содержать гораздо больше глифов, сохраняя при этом разумный размер файла по сравнению с растровыми шрифтами. Динамические шрифты также поддерживают некоторые расширенные функции, недоступные растровым шрифтам, например, *ligatures (лигатуры)* (преобразование нескольких символов в один другой рисунок).
ta: 2 வகையான எழுத்துரு கோப்புகள் உள்ளன: * மாறும் * (TTF/OTF/WOFF/WOFF2 வடிவங்கள்) மற்றும் * பிட்மேப் * (BMFONT `.fnt`` வடிவம் அல்லது மோனோச்பேச் படம்). மாறும் எழுத்துருக்கள் மிகவும் பொதுவாகப் பயன்படுத்தப்படும் விருப்பமாகும், ஏனெனில் அவை மறுஅளவிடப்படலாம் மற்றும் இன்னும் அதிக அளவுகளில் மிருதுவாக இருக்கும். அவற்றின் திசையன் அடிப்படையிலான இயல்புக்கு நன்றி, பிட்மேப் எழுத்துருக்களுடன் ஒப்பிடும்போது நியாயமான கோப்பு அளவை வைத்திருக்கும்போது அவை நிறைய கிளிஃப்களையும் கொண்டிருக்கலாம். பிட்மேப் எழுத்துருக்கள் ஆதரிக்க முடியாத சில மேம்பட்ட அம்சங்களையும் மாறும் எழுத்துருக்கள் ஆதரிக்கின்றன, அதாவது * லிகேட்டர்ச் * (பல எழுத்துக்கள் ஒற்றை வேறுபட்ட வடிவமைப்பாக மாறுகின்றன).
uk: Існує 2 типи файлів шрифтів: *динамічні* (формати TTF/OTF/WOFF/WOFF2) і *растрові* (формат BMFont ``.fnt`` або моноширинне зображення). Динамічні шрифти є найпоширенішим варіантом, оскільки їх можна змінювати, але вони виглядають чітко при більших розмірах. Завдяки своїй векторній природі вони також можуть містити набагато більше гліфів, зберігаючи розумний розмір файлу порівняно з растровими шрифтами. Динамічні шрифти також підтримують деякі розширені функції, які растрові шрифти не підтримують, наприклад *лігатури* (декілька символів, що перетворюються на один інший дизайн).
zh_hant: 字型檔案分為兩種：*動態*（TTF/OTF/WOFF/WOFF2 格式）和*點陣*（BMFont ``.fnt`` 格式或等寬圖像）。動態字型最常見，可以自由縮放而且放大後依然清晰。由於是向量格式，能在保持合理檔案大小的同時收錄更多字元。動態字型也支援點陣字型無法做到的進階功能，如 *連字* （多個字元合為一個特殊形狀）。

source: You can find freely licensed font files on websites such as `Google Fonts <https://fonts.google.com/>`__ and `Font Library <https://fontlibrary.org/>`__.
ga: Is féidir leat comhaid chló ceadúnaithe saor in aisce a fháil ar shuímh Ghréasáin mar `Google Fonts <https://fonts.google.com/>`__ agus `Font Library <https://fontlibrary.org/>`__.
it: È possibile trovare file di font con licenza libera su siti web come `Google Fonts <https://fonts.google.com/>`__ e `Font Library <https://fontlibrary.org/>`__.
ru: Файлы шрифтов со свободной лицензией можно найти на таких сайтах, как `Google Fonts <https://fonts.google.com/>`__ и `Font Library <https://fontlibrary.org/>`__.
ta: `கூகிள் எழுத்துருக்கள் <https://fonts.google.com/> __ மற்றும்` எழுத்துரு நூலகம் <https://fontlibrary.org/> __. __.
uk: Ви можете знайти безкоштовно ліцензовані файли шрифтів на таких веб-сайтах, як `Google Fonts <https://fonts.google.com/>`__ і `Font Library <https://fontlibrary.org/>`__.
zh_hant: 你可以在如 `Google Fonts <https://fonts.google.com/>`__ 或 `Font Library <https://fontlibrary.org/>`__ 等網站找到免費授權的字型檔案。

source: Fonts are covered by copyright. Double-check the license of a font before using it, as not all fonts allow commercial use without purchasing a license.
ga: Tá clónna clúdaithe le cóipcheart. Déan seiceáil faoi dhó ar cheadúnas cló sula n-úsáideann tú é, toisc nach gceadaíonn gach cló úsáid tráchtála gan ceadúnas a cheannach.
it: I font sono coperti da copyright. Controlla attentamente la licenza di un font prima di utilizzarlo, poiché non tutti i font consentono l'uso commerciale senza l'acquisto di una licenza.
ru: Шрифты защищены авторским правом. Перед использованием шрифта дважды проверьте его лицензию, так как не все шрифты можно использовать в коммерческих целях без покупки лицензии.
ta: எழுத்துருக்கள் பதிப்புரிமை மூலம் மூடப்பட்டுள்ளன. ஒரு எழுத்துருவின் உரிமத்தை பயன்படுத்துவதற்கு முன்பு இருமுறை சரிபார்க்கவும், ஏனெனில் எல்லா எழுத்துருக்களும் உரிமம் வாங்காமல் வணிக பயன்பாட்டை அனுமதிக்காது.
uk: Шрифти захищені авторським правом. Перевірте ліцензію шрифту перед його використанням, оскільки не всі шрифти дозволяють комерційне використання без придбання ліцензії.
zh_hant: 字型受著作權保護。使用前請務必確認授權條款，並非所有字型都能免費商用。

source: You can see how fonts work in action using the `BiDI and Font Features demo project <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
ga: Is féidir leat a fheiceáil conas a oibríonn clónna i ngníomh ag baint úsáide as an tionscadal taispeána `BiDI agus Font Features <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
it: È possibile osservare il funzionamento dei font in azione attraverso il progetto demo `BiDI and Font Features <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
ru: Увидеть, как работают шрифты в действии, можно с помощью демонстрационного проекта `BiDI and Font Features <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
ta: `பி.ஐ.டி.ஐ மற்றும் எழுத்துரு நற்பொருத்தங்கள் டெமோ திட்டம் <https://github.com/godotengine/godotengine/godot-demo-projects ஐப் பயன்படுத்தி எழுத்துருக்கள் எவ்வாறு செயல்படுகின்றன என்பதை நீங்கள் காணலாம்.
uk: Ви можете побачити, як шрифти працюють у дії, використовуючи демонстраційний проект BiDI та Font Features <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__.
zh_hant: 你可以參考 `BiDI 與字型功能展示專案 <https://github.com/godotengine/godot-demo-projects/tree/master/gui/bidi_and_font_features>`__，親自體驗字型在實際 UI 的運作方式。

source: Dynamic fonts
ga: Clónna dinimiciúla
it: Font dinamici
ru: Динамические шрифты
ta: மாறும் எழுத்துருக்கள்
uk: Динамічні шрифти
zh_hant: 動態字型

source: Godot supports the following dynamic font formats:
ga: Tacaíonn Godot leis na formáidí cló dinimiciúla seo a leanas:
it: Godot supporta i seguenti formati di font dinamici:
ru: Godot поддерживает следующие динамические форматы шрифтов:
ta: கோடோட் பின்வரும் மாறும் எழுத்துரு வடிவங்களை ஆதரிக்கிறது:
uk: Godot підтримує такі динамічні формати шрифтів:
zh_hant: Godot 支援下列動態字型格式：

source: TrueType Font or Collection (``.ttf``, ``.ttc``)
ga: Cló nó Bailiúchán TrueType (''.ttf'', ''.ttc'')
it: Font o raccolta TrueType (``.ttf``, ``.ttc``)
ru: TrueType Font или Collection (``.ttf``, ``.ttc``)
ta: Truetype எழுத்துரு அல்லது சேகரிப்பு (`` .ttf``, `` .ttc``)
uk: Шрифт або колекція TrueType (``.ttf``, ``.ttc``)
zh_hant: TrueType 字型或合集（``.ttf``、``.ttc``）

source: OpenType Font or Collection (``.otf``, ``.otc``)
ga: Cló nó Bailiúchán OpenType (''.otf'', ''.otc'')
it: Font o raccolta OpenType (``.otf``, ``.otc``)
ru: OpenType Font или Collection (``.otf``, ``.otc``)
ta: Opentype எழுத்துரு அல்லது சேகரிப்பு (`` .otf``, `` .otc``)
uk: Шрифт або колекція OpenType (``.otf``, ``.otc``)
zh_hant: OpenType 字型或合集（``.otf``、``.otc``）

source: Web Open Font Format 1 (``.woff``)
es: Formato de Fuente Web Abierta 1 (``.woff``)
ga: Formáid Cló Oscailte Gréasáin 1 (''.woff'')
ta: வலை திறந்த எழுத்துரு வடிவமைப்பு 1 (`` .வோஃப்``)
uk: Веб-формат відкритого шрифту 1 (``.woff``)
zh_hant: Web 開放字型格式 1（``.woff``）

source: Web Open Font Format 2 (``.woff2``, since Godot 3.5)
ga: Formáid Cló Oscailte Gréasáin 2 (''.woff2'', ós rud é Godot 3.5)
it: Web Open Font Format 2 (``.woff2``, a partire da Godot 3.5)
ru: Web Open Font Format 2 (``.woff2``, начиная с Godot 3.5)
ta: வலை திறந்த எழுத்துரு வடிவம் 2 (`` .வோஃப் 2``, கோடோட் 3.5 முதல்)
uk: Web Open Font Format 2 (``.woff2``, починаючи з Godot 3.5)
zh_hant: Web 開放字型格式 2（``.woff2``，自 Godot 3.5 支援）

source: While ``.woff`` and especially ``.woff2`` tend to result in smaller file sizes, there is no universally "better" font format. In most situations, it's recommended to use the font format that was shipped on the font developer's website.
ga: Cé go mbíonn méideanna comhaid níos lú mar thoradh ar ''.woff'' agus go háirithe ''.woff2'', níl aon fhormáid chlófhoirne "níos fearr" ann go huilíoch. I bhformhór na gcásanna, moltar an fhormáid chló a seoladh ar shuíomh gréasáin an fhorbróra cló a úsáid.
it: Sebbene ``.woff`` e soprattutto ``.woff2`` tendano a generare file di dimensioni più piccole, non esiste un formato di font universalmente "migliore". In gran parte delle situazioni, si consiglia di utilizzare il formato di font fornito sul sito web dello sviluppatore del font.
ru: Хотя форматы ``.woff`` и особенно ``.woff2``, как правило, позволяют уменьшить размер файлов, не существует универсально "лучшего" формата шрифта. В большинстве случаев рекомендуется использовать формат шрифта, предоставленный на сайте разработчика.
ta: `` .வோஃப்`` மற்றும் குறிப்பாக `` .woff2`` சிறிய கோப்பு அளவுகளை விளைவிக்கும் அதே வேளையில், உலகளவில் "சிறந்த" எழுத்துரு வடிவம் இல்லை. பெரும்பாலான சூழ்நிலைகளில், எழுத்துரு டெவலப்பரின் இணையதளத்தில் அனுப்பப்பட்ட எழுத்துரு வடிவமைப்பைப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது.
uk: Хоча ``.woff`` і особливо ``.woff2``, як правило, призводять до менших розмірів файлів, не існує універсального "кращого" формату шрифту. У більшості ситуацій рекомендується використовувати формат шрифту, наданий на веб-сайті розробника шрифту.
zh_hant: 雖然 ``.woff``，特別是 ``.woff2`` 通常會讓檔案更小，但沒有絕對最好的字型格式。通常建議使用字型原廠網站所提供的格式。

source: Bitmap fonts
ga: Clónna mapa giotán
it: Font bitmap
ru: Bitmap (Растровые) шрифты
ta: பிட்மேப் எழுத்துருக்கள்
uk: Растрові шрифти
zh_hant: 點陣字型

source: Godot supports the BMFont (``.fnt``) bitmap font format. This is a format created by the `BMFont <https://www.angelcode.com/products/bmfont/>`__ program. Many BMFont-compatible programs also exist, like `BMGlyph <https://www.bmglyph.com/>`__ or web-based `fontcutter <https://github.com/fabienbk/fontcutter>`__.
ga: Tacaíonn Godot le formáid chló bitmap BMFont (``.fnt``). Is formáid é seo a chruthaigh an clár `BMFont <https://www.angelcode.com/products/bmfont/>`__. Tá go leor clár atá comhoiriúnach le BMFont ann freisin, amhail `BMGlyph <https://www.bmglyph.com/>`__ nó `fontcutter gréasán-bhunaithe <https://github.com/fabienbk/fontcutter>`__.
it: Godot supporta il formato di font bitmap BMFont (``.fnt``). È un formato creato dal programma `BMFont <https://www.angelcode.com/products/bmfont/>`__. Esistono anche molti programmi compatibili con BMFont, come `BMGlyph <https://www.bmglyph.com/>`__ o il programma sul web `fontcutter <https://github.com/fabienbk/fontcutter>`__.
ru: Godot поддерживает формат растровых шрифтов BMFont (``.fnt``). Этот формат создан программой `BMFont <https://www.angelcode.com/products/bmfont/>`__. Существует также множество программ, совместимых с BMFont, например `BMGlyph <https://www.bmglyph.com/>`__ или веб-программа `fontcutter <https://github.com/fabienbk/fontcutter>`__.
ta: கோடோட் BMFONT (`` .fnt``) பிட்மேப் எழுத்துரு வடிவமைப்பை ஆதரிக்கிறது. இது `Bmfont <https://www.angelcode.com/products/bmfont/> __ நிரல் உருவாக்கிய வடிவமாகும். `Bmglyph <https://www.bmglyph.com/> __ அல்லது வலை அடிப்படையிலான` fontCutter <https://github.com/fabienbk/fontcutter> __.
uk: Godot підтримує формат растрового шрифту BMFont (``.fnt``). Це формат, створений програмою `BMFont <https://www.angelcode.com/products/bmfont/>`__. Також існує багато програм, сумісних із BMFont, наприклад `BMGlyph <https://www.bmglyph.com/>`__ або веб-базований `fontcutter <https://github.com/fabienbk/fontcutter>`__.
zh_hant: Godot 支援 BMFont（``.fnt``）點陣字型格式，這是由 `BMFont <https://www.angelcode.com/products/bmfont/>`__ 所建立的格式。也有其他相容工具，如 `BMGlyph <https://www.bmglyph.com/>`__ 或線上 `fontcutter <https://github.com/fabienbk/fontcutter>`__。

source: Alternatively, you can import any image to be used as a bitmap font. To do so, select the image in the FileSystem dock, go to the Import dock, change its import type to **Font Data (Image Font)** then click **Reimport**:
it: Alternativamente, è possibile importare qualsiasi immagine da utilizzare come font bitmap. Per fare ciò, selezionare l'immagine nel pannello FileSystem, andare al pannello Importazione, cambiare il tipo di importazione in **Font Data (Image Font)** e cliccare su **Reimporta**:
ru: Вы также можете импортировать любое изображение для использования в качестве растрового шрифта. Для этого выберите изображение в доке "FileSystem ", перейдите в доку "import", измените тип импорта на **Font Data (Image Font)** и нажмите **Reimport**:
ta: மாற்றாக, பிட்மேப் எழுத்துருவாக பயன்படுத்த எந்த படத்தையும் இறக்குமதி செய்யலாம். அவ்வாறு செய்ய, கோப்பு முறைமை கப்பல்துறையில் உள்ள படத்தைத் தேர்ந்தெடுத்து, இறக்குமதி கப்பல்துறைக்குச் சென்று, அதன் இறக்குமதி வகையை ** எழுத்துரு தரவு (பட எழுத்துரு) என மாற்றவும் ** பின்னர் ** மறுசீரமைப்பு **:
zh_hant: 或者，你可以匯入任何圖像作為點陣字型。做法是於檔案系統面板選取該圖像，切換到匯入面板，將匯入類型改為 **Font Data (Image Font)**，然後按下 **Reimport**：

source: Changing import type to Font Data (Image Font)
it: Cambio del tipo di importazione in Font Data (Image Font)
ru: Изменение типа импорта на Font Data (Image Font)
ta: இறக்குமதி வகையை எழுத்துரு தரவுக்கு மாற்றுவது (பட எழுத்துரு)
zh_hant: 將匯入類型改為 Font Data (Image Font)

source: Changing import type to **Font Data (Image Font)**
it: Cambio del tipo di importazione in **Font Data (Image Font)**
ru: Измененить тип импорта на **Font Data (Image Font))**
ta: இறக்குமதி வகையை ** எழுத்துரு தரவுக்கு மாற்றுதல் (பட எழுத்துரு) **
zh_hant: 將匯入類型改為 **Font Data (Image Font)**

source: The font's character set layout can be in any order, but orders that match standard Unicode are recommended as they'll require far less configuration to import. For example, the bitmap font below contains `ASCII <https://en.wikipedia.org/wiki/ASCII>`__ characters and follows standard ASCII ordering:
ga: Is féidir leagan amach tacar carachtar an chló a bheith in ord ar bith, ach moltar orduithe a mheaitseálann Unicode caighdeánach mar beidh i bhfad níos lú cumraíochta ag teastáil uathu le hiompórtáil. Mar shampla, tá carachtair `ASCII <https://en.wikipedia.org/wiki/ASCII>`__ sa chló bitmap thíos agus leanann sé ordú caighdeánach ASCII:
it: La disposizione dell'insieme di caratteri del font si può impostare in qualsiasi ordine, ma si consiglia di usare l'ordinamento Unicode standard, poiché richiede una configurazione molto più semplice da importare. Ad esempio, il font bitmap qui sotto contiene caratteri `ASCII <https://en.wikipedia.org/wiki/ASCII>`__ e segue l'ordinamento ASCII standard:
ru: Порядок символов шрифта может быть любым, но рекомендуется использовать порядок, соответствующий стандарту Unicode, так как он требует гораздо меньше настроек для импорта. Например, растровый шрифт ниже содержит символы `ASCII <https://en.wikipedia.org/wiki/ASCII>`__ и соответствует стандартному порядку ASCII:
ta: எழுத்துருவின் எழுத்து தொகுப்பு தளவமைப்பு எந்த வரிசையிலும் இருக்கலாம், ஆனால் நிலையான யூனிகோடுடன் பொருந்தக்கூடிய ஆர்டர்கள் பரிந்துரைக்கப்படுகின்றன, ஏனெனில் அவை இறக்குமதி செய்ய மிகக் குறைந்த உள்ளமைவு தேவைப்படும். எடுத்துக்காட்டாக, கீழே உள்ள பிட்மேப் எழுத்துருவில் `அச்கி <https://en.wikipedia.org/wiki/ascii> __ எழுத்துக்கள் மற்றும் நிலையான ASCII வரிசைப்படுத்தலைப் பின்பற்றுகின்றன:
uk: Розкладка набору символів шрифту може бути в будь-якому порядку, але рекомендовано використовувати порядок, який відповідає стандартному Unicode, оскільки для імпорту потрібно набагато менше конфігурації. Наприклад, наведений нижче растровий шрифт містить символи `ASCII <https://en.wikipedia.org/wiki/ASCII>`__ і відповідає стандартному порядку ASCII:
zh_hant: 字型的字元順序可以自訂，但建議比照標準 Unicode 排序，這樣匯入設定更簡單。例如，下方範例的點陣字型收錄 `ASCII <https://en.wikipedia.org/wiki/ASCII>`__ 字元且排序遵循 ASCII 標準：

source: Bitmap font example
ga: Sampla cló mapa giotán
it: Esempio di font bitmap
ru: Пример растрового шрифта
ta: பிட்மேப் எழுத்துரு எடுத்துக்காட்டு
uk: Приклад растрового шрифту
zh_hant: 點陣字型範例

source: Credit: `LibreQuake <https://github.com/MissLav/LibreQuake/blob/master/lq1/gfx-wad/CONCHARS.png>`__ (scaled and cropped to exclude extended range)
ga: Creidmheas: `LibreQuake <https://github.com/MissLav/LibreQuake/blob/master/lq1/gfx-wad/CONCHARS.png>`__ (scála agus bearrtha chun raon méadaithe a eisiamh)
ru: Источник: `LibreQuake <https://github.com/MissLav/LibreQuake/blob/master/lq1/gfx-wad/CONCHARS.png>`__ (масштабировано и обрезано, чтобы исключить расширенный диапазон)
ta: கடன்: `librequake <https://github.com/misslav/librequake/blob/master/lq1/gfx-wad/conchars.png> __ (நீட்டிக்கப்பட்ட வரம்பை விலக்க அளவிடப்பட்ட மற்றும் பயிரிடப்பட்டது)
uk: Авторство: `LibreQuake <https://github.com/MissLav/LibreQuake/blob/master/lq1/gfx-wad/CONCHARS.png>`__ (масштабовано та обрізано, щоб виключити розширений діапазон)
zh_hant: 圖片來源：`LibreQuake <https://github.com/MissLav/LibreQuake/blob/master/lq1/gfx-wad/CONCHARS.png>`__ （已縮放裁剪移除擴展區段）
