Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_using_fonts.po
Languages: es, ga, it, ru, ta, uk, zh_hant

source: **Bottom:** Additional spacing below glyphs. This is used for multiline text, but also to calculate the minimum size of controls such as :ref:`class_Label` and :ref:`class_Button`.
it: **Basso:** spaziatura aggiuntiva sotto i glifi. È utilizzata per il testo su più righe, ma anche per calcolare la dimensione minima di controlli come :ref:`class_Label` e :ref:`class_Button`.
ru: **Bottom (Внизу):** Дополнительный интервал под глифами. Он используется для многострочного текста, а также для расчета минимального размера элементов управления, таких как :ref:`class_Label` и :ref:`class_Button`.
ta: ** கீழே: ** கிளிஃப்களுக்கு கீழே கூடுதல் இடைவெளி. இது மல்டிலைன் உரைக்குப் பயன்படுத்தப்படுகிறது, ஆனால் இது போன்ற கட்டுப்பாடுகளின் குறைந்தபட்ச அளவைக் கணக்கிடவும் பயன்படுத்தப்படுகிறது: குறிப்பு: `class_label` மற்றும்: ref:` class_button`.
zh_hant: **下方：** 字元下方的額外間距。多行文字或計算 :ref:`class_Label`、:ref:`class_Button` 控制元件最小高度時會用到。

source: The **Variation > Transform** property can also be adjusted to stretch characters horizontally or vertically. This is specifically done by adjusting the ``xx`` (horizontal scale) and ``yy`` (vertical scale) components. Remember to adjust glyph spacing to account for any changes, as glyph transform doesn't affect how much space each glyph takes in the text. Non-uniform scaling of this kind should be used sparingly, as fonts are generally not designed to be displayed with stretching.
ga: Is féidir an t-airí **Athraithe > Trasfhoirmigh** a choigeartú freisin chun carachtair a shíneadh go cothrománach nó go hingearach. Déantar é seo go sonrach trí na comhpháirteanna `` xx`` (scála cothrománach) agus `` yy`` (scála ingearach) a choigeartú. Cuimhnigh an spásáil glyph a choigeartú chun aon athruithe a chur san áireamh, mar ní chuireann claochlú glyph isteach ar an méid spáis a thógann gach glyph sa téacs. Ba chóir úsáid a bhaint as scálú neamh-éide den chineál seo go coigilteach, mar go hiondúil ní dearadh clónna le bheith ar taispeáint le síneadh.
it: È anche possibile regolare la proprietà **Variation > Transform** per stirare i caratteri orizzontalmente o verticalmente. Ciò si ottiene specificamente regolando i componenti ``xx`` (scala orizzontale) e ``yy`` (scala verticale). Ricordati di regolare la spaziatura dei glifi per tenere conto di eventuali cambiamenti, poiché la trasformazione dei glifi non influisce sullo spazio occupato da ciascun glifo nel testo. Un ridimensionamento non uniforme di questo tipo si dovrebbe usare raramente, poiché i font generalmente non sono progettati per essere visualizzati con stiramenti.
ru: Свойство **Variation > Transform** также можно настроить для растяжения символов по горизонтали или вертикали. Это достигается путём изменения компонентов ``xx`` (горизонтальный масштаб) и ``yy`` (вертикальный масштаб). Не забудьте скорректировать интервал между глифами с учётом любых изменений, поскольку преобразование глифов не влияет на то, сколько места каждый глиф занимает в тексте. Неравномерное масштабирование такого рода следует использовать с осторожностью, поскольку шрифты, как правило, не предназначены для отображения с растяжением.
ta: ** மாறுபாடு> உருமாற்றம் ** சொத்தை கிடைமட்டமாக அல்லது செங்குத்தாக எழுத்துக்களை நீட்டிக்க முடியும். `` Xx`` (கிடைமட்ட அளவுகோல்) மற்றும் `` yy`` (செங்குத்து அளவு) கூறுகளை சரிசெய்வதன் மூலம் இது குறிப்பாக செய்யப்படுகிறது. எந்தவொரு மாற்றத்திற்கும் கிளிஃப் இடைவெளியை சரிசெய்ய நினைவில் கொள்ளுங்கள், ஏனெனில் கிளிஃப் உருமாற்றம் ஒவ்வொரு கிளிஃபும் உரையில் எவ்வளவு இடத்தை எடுக்கும் என்பதைப் பாதிக்காது. இந்த வகையான ஒரே மாதிரியான அளவிடுதல் குறைவாகவே பயன்படுத்தப்பட வேண்டும், ஏனெனில் எழுத்துருக்கள் பொதுவாக நீட்டிப்புடன் காட்ட வடிவமைக்கப்படவில்லை.
uk: Властивість **Variation > Transform** також можна налаштувати для розтягування символів горизонтально або вертикально. Зокрема, це робиться за допомогою налаштування компонентів ``xx`` (горизонтальний масштаб) і ``yy`` (вертикальний масштаб). Не забувайте налаштовувати інтервал між гліфами, щоб врахувати будь-які зміни, оскільки перетворення гліфів не впливає на те, скільки місця кожен гліф займає в тексті. Нерівномірне масштабування такого роду слід використовувати обережно, оскільки шрифти, як правило, не призначені для відображення з розтягуванням.
zh_hant: **變化 > 變換（Transform）** 也能拉寬或拉高字元（調整 ``xx`` 水平比例、``yy`` 垂直比例），但請記得同步微調間距，因為字型拉伸不會自動調整間隔。這種非等比例縮放不建議常用，因大多數字型未針對拉伸做設計。

source: OpenType font features
ga: Gnéithe cló OpenType
it: Funzionalità OpenType di font
ru: Возможности шрифтов OpenType
ta: Opentype எழுத்துரு நற்பொருத்தங்கள்
uk: Особливості шрифту OpenType
zh_hant: OpenType 字型功能

source: Godot supports enabling OpenType font features, which are a standardized way to define alternate characters that can be toggled without having to swap font files entirely. Despite being named OpenType font features, these are also supported in TrueType (``.ttf``) and WOFF/WOFF2 font files.
ga: Tacaíonn Godot le gnéithe cló OpenType a chumasú, ar bealach caighdeánaithe iad chun carachtair malartacha a shainiú ar féidir iad a thógáil gan comhaid cló a mhalartú go hiomlán. In ainneoin gnéithe cló OpenType a ainmnítear iad, tacaítear leo freisin i gcomhaid cló TrueType (`.ttf ``) agus WOFF/WOFF2.
it: Godot supporta l'abilitazione delle funzionalità OpenType di font, che sono un metodo standardizzato per definire caratteri alternativi che si possono cambiare senza dover sostituire completamente i file dei font. Pur avendo il nome "funzionalità OpenType", queste sono supportate anche nei file dei font TrueType (``.ttf``) e WOFF/WOFF2.
ru: Godot поддерживает функции шрифтов OpenType, которые представляют собой стандартизированный способ определения альтернативных символов, переключаемых без необходимости полной замены файлов шрифтов. Несмотря на то, что они называются функциями шрифтов OpenType, они также поддерживаются в файлах шрифтов TrueType (``.ttf``) и WOFF/WOFF2.
ta: ஓபன்டைப் எழுத்துரு அம்சங்களை இயக்குவதை கோடோட் ஆதரிக்கிறது, இது எழுத்துரு கோப்புகளை முழுவதுமாக மாற்றாமல் மாற்றக்கூடிய மாற்று எழுத்துக்களை வரையறுக்க ஒரு தரப்படுத்தப்பட்ட வழியாகும். ஓபன்டைப் எழுத்துரு நற்பொருத்தங்கள் என்று பெயரிடப்பட்ட போதிலும், இவை ட்ரூய்டைப் (`` .ttf``) மற்றும் WOFF/WOFF2 எழுத்துரு கோப்புகளிலும் ஆதரிக்கப்படுகின்றன.
uk: Godot підтримує ввімкнення функцій шрифту OpenType, які є стандартизованим способом визначення альтернативних символів, які можна перемикати без необхідності повністю міняти файли шрифтів. Незважаючи на назву функцій шрифту OpenType, вони також підтримуються у файлах шрифтів TrueType (``.ttf``) і WOFF/WOFF2.
zh_hant: Godot 支援啟用 OpenType 字型功能，這是一種標準方式，可切換替代字元而不必更換字型檔。雖然叫 OpenType 功能，其實 TrueType（``.ttf``）與 WOFF/WOFF2 也支援。

source: Support for OpenType features highly depends on the font used. Some fonts don't support any OpenType features, while other fonts can support dozens of toggleable features.
ga: Braitheann tacaíocht do ghnéithe OpenType go mór ar an gcló a úsáidtear. Ní thacaíonn roinnt clónna le haon ghnéithe OpenType, agus is féidir le clónna eile tacú leis an iliomad gnéithe in-aistrithe.
it: Il supporto per le funzionalità OpenType dipende molto dal font utilizzato. Alcuni font non supportano alcuna funzionalità OpenType, mentre altri possono supportare decine di funzionalità attivabili/disattivabili.
ru: Поддержка функций OpenType во многом зависит от используемого шрифта. Некоторые шрифты не поддерживают ни одной функции OpenType, в то время как другие могут поддерживать десятки переключаемых функций.
ta: Opentype அம்சங்களுக்கான உதவி பயன்படுத்தப்படும் எழுத்துருவைப் பொறுத்தது. சில எழுத்துருக்கள் எந்த ஓபன்டைப் அம்சங்களையும் ஆதரிக்காது, மற்ற எழுத்துருக்கள் டசன் கணக்கான மாற்றக்கூடிய அம்சங்களை ஆதரிக்க முடியும்.
uk: Підтримка функцій OpenType сильно залежить від використовуваного шрифту. Деякі шрифти не підтримують жодних функцій OpenType, тоді як інші шрифти можуть підтримувати десятки функцій, які можна перемикати.
zh_hant: 是否支援 OpenType 功能取決於字型本身。有些字型完全沒支援，有些則提供數十種可切換特性。

source: There are 2 ways to use OpenType font features:
ga: Tá 2 bhealach ann chun gnéithe cló OpenType a úsáid:
it: Esistono 2 modi per utilizzare le funzionalità OpenType di un font:
ru: Существует 2 способа использования возможностей шрифтов OpenType:
ta: ஓபன்டைப் எழுத்துரு அம்சங்களைப் பயன்படுத்த 2 வழிகள் உள்ளன:
uk: Існує 2 способи використання функцій шрифту OpenType:
zh_hant: 使用 OpenType 字型功能有兩種方式：

source: **Globally on a font file**
ga: **Ar fud an domhain ar chomhad clón**
it: **Globalmente su un file di font**
ru: **Глобально для файла шрифта**
ta: ** ஒரு எழுத்துரு கோப்பில் உலகளவில் **
uk: **Глобально у файлі шрифту**
zh_hant: **針對整個字型檔**

source: In the dialog that appears, look for the **Metadata Overrides > OpenType Features** section on the sidebar on the right, click the **Features (0 of N set)** text to expand the property, then click **Add Feature**:
ga: Sa dialóg atá le feiceáil, féach ar an rannán **Miotá sonraí Sáraítear > Gnéithe OpenType** ar an mbarra taoibh ar thaobh na láimhe deise, cliceáil ar an téacs **Features (0 of N set)** chun an t-airí a leathnú, ansin cliceáil **Cuir leis Gné**:
it: Nella finestra di dialogo visualizzata, cerca la sezione **Metadata Overrides > OpenType Features** nella barra laterale a destra, clicca sul testo **Features (0 of N set)** per espandere la proprietà, quindi clicca su **Add Feature**:
ru: В открывшемся диалоговом окне найдите раздел **Metadata Overrides > OpenType Features** на боковой панели справа, щелкните текст **Features (0 of N set)**, чтобы развернуть свойство, затем щелкните **Add Feature**:
ta: தோன்றும் உரையாடலில், ** மேனிலை தரவு மேலெழுதும்> ஓபன்டைப் நற்பொருத்தங்கள் ** பக்கப்பட்டியில் வலதுபுறத்தில், ** அம்சங்களைக் சொடுக்கு செய்க (n தொகுப்பின் 0) ** சொத்தை விரிவாக்க, பின்னர் ** சொடுக்கு செய்யவும் நற்பொருத்தம் **:
uk: У діалоговому вікні, що з’явиться, знайдіть розділ **Заміна метаданих > Функції OpenType** на бічній панелі праворуч, клацніть текст **Функції (набір 0 із N)**, щоб розгорнути властивість, а потім натисніть **Додати Функція**:
zh_hant: 在出現的對話方塊中，在右側側邊欄上尋找**元資料覆蓋> OpenType 功能**部分，按一下**功能（N 群組中的0 個）** 文字以展開屬性，然後按一下**新增特徵**：

source: OpenType feature overrides in Advanced Import Settings
ga: Athsháraíonn gné OpenType i Ard-Socruithe Iompórtála
it: Sostituzioni delle funzionalità OpenType nelle Impostazioni di importazione avanzate
ru: Переопределение функций OpenType в Расширенных Настройках Импорта
ta: மேம்பட்ட இறக்குமதி அமைப்புகளில் ஓபன்டைப் நற்பொருத்தம் மேலெழுதும்
uk: Функція OpenType замінює параметри розширеного імпорту
zh_hant: 進階匯入設定中的 OpenType 功能覆寫

source: **In a specific font usage (FontVariation)**
ga: ** In úsáid cló ar leith (FontVariation) **
it: **In un utilizzo specifico del font (FontVariation)**
ru: **В определенном использовании шрифта (FontVariation)**
ta: ** ஒரு குறிப்பிட்ட எழுத்துரு பயன்பாட்டில் (எழுத்துரு) **
uk: **У певному використанні шрифту (FontVariation)**
zh_hant: **針對特定用法（FontVariation）**

source: To use a font feature, create a FontVariation resource like you would do for a :ref:`variable font <doc_using_fonts_variable_fonts>`, then load a font file within the FontVariation resource:
ga: Chun gné cló a úsáid, cruthaigh acmhainn FontVariation mar a dhéanfá do :ref:`cló inathraithe <doc_using_fonts_variable_fonts>`, ansin lódáil comhad cló laistigh den acmhainn FontVariation:
it: Per utilizzare una funzionalità di un font, creare una risorsa FontVariation come si farebbe per un :ref:`font variabile <doc_using_fonts_variable_fonts>`, quindi caricare un file font dentro la risorsa FontVariation:
ru: Чтобы использовать функцию шрифта, создайте ресурс FontVariation, как это делается для :ref:`переменного шрифта <doc_using_fonts_variable_fonts>`, а затем загрузите файл шрифта в ресурс FontVariation:
ta: ஒரு எழுத்துரு அம்சத்தைப் பயன்படுத்த, உங்களைப் போன்ற ஒரு எழுத்துரு வளத்தை உருவாக்கவும்: ref: `மாறி எழுத்துரு <doc_using_fonts_variable_fonts>`, பின்னர் எழுத்துரு கோப்பை எழுத்துரு வளத்திற்குள் ஏற்றவும்:
uk: Щоб скористатися функцією шрифту, створіть ресурс FontVariation, як ви зробили б для :ref:`змінного шрифту <doc_using_fonts_variable_fonts>`, а потім завантажте файл шрифту в ресурс FontVariation:
zh_hant: 要啟用字型功能，請像前述 :ref:`可變字型 <doc_using_fonts_variable_fonts>` 那樣建立 FontVariation，然後載入字型檔案：

source: Loading a font file into a FontVariation resource
ga: Comhad cló a luchtú isteach in acmhainn FontVariation
it: Caricamento di un file di font in una risorsa FontVariation
ru: Загрузка файла шрифта в ресурс FontVariation
ta: எழுத்துரு கோப்பை ஒரு எழுத்துரு வளத்தில் ஏற்றுகிறது
uk: Завантаження файлу шрифту в ресурс FontVariation
zh_hant: 在 FontVariation 資源中載入字型檔案

source: Scroll down to the FontVariation's **OpenType Features** section, click the **Features (0 of N set)** text to expand the property, then click **Add Feature** and select the desired feature in the dropdown:
ga: Scrollaigh síos go dtí rannát**Gnéithe OpenType** an FontVariation, cliceáil ar an téacs**Gnéithe (0 de N tacar) ** chun an maoin a leathnú, ansin cliceáil** Cuir Gné leis ** agus roghnaigh an ghné atá ag teastáil sa anuas anuas:
it: Scorri verso il basso fino alla sezione **OpenType Features** di FontVariation, clicca sul testo **Features (0 of N set)** per espandere la proprietà, quindi clicca su **Add Feature** e seleziona la funzionalità desiderata nel menu a discesa:
ru: Прокрутите вниз до раздела FontVariation **OpenType Features**, щелкните текст **Features (0 of N set)**, чтобы развернуть свойство, затем щелкните **Add Feature** и выберите нужную возможность в раскрывающемся списке:
ta: FONTVARIATION இன் ** opentype நற்பொருத்தங்கள் ** பிரிவு, ** அம்சங்களைக் சொடுக்கு செய்க (N தொகுப்பின் 0) ** சொத்தை விரிவுபடுத்துவதற்கு உரை ** ** அம்சத்தைச் சேர் ** மற்றும் கீழ்தோன்றலில் விரும்பிய அம்சத்தைத் தேர்ந்தெடுக்கவும்:
uk: Прокрутіть униз до розділу **Функції OpenType** у FontVariation, клацніть текст **Функції (набір 0 з N)**, щоб розгорнути властивість, потім натисніть **Додати функцію** та виберіть потрібну функцію у спадному списку:
zh_hant: 往下找到 FontVariation 的 **OpenType Features** 區段，點選 **Features (0 of N set)** 展開，再按 **Add Feature** 從下拉選單選擇功能：

source: Specifying OpenType features in a FontVariation resource
ga: Gnéithe OpenType a shonrú in acmhainn FontVariation
it: Specifica delle funzionalità OpenType in una risorsa FontVariation
ru: Указание функций OpenType в ресурсе FontVariation
ta: ஒரு எழுத்துரு வளத்தில் ஓபன்டைப் அம்சங்களைக் குறிப்பிடுகிறது
uk: Визначення функцій OpenType у ресурсі FontVariation
zh_hant: 在 FontVariation 資源指定 OpenType 功能

source: For example, here's the `Inter <https://rsms.me/inter/>`__ font without the *Slashed Zero* feature (top), then with the *Slashed Zero* OpenType feature enabled (bottom):
ga: Mar shampla, seo an cló `Inter <https://rsms.me/inter/>`__ gan an ghné *Slashed Zero* (barr), ansin leis an ngné OpenType *Slashed Zero* cumasaithe (bun):
it: Ad esempio, ecco il font `Inter <https://rsms.me/inter/>`__ senza la funzionalità *Slashed Zero* (Zero barrato) (in alto), poi con la funzionalità OpenType *Slashed Zero* abilitata (in basso):
ru: Например, вот шрифт `Inter <https://rsms.me/inter/>`__ без функции *Slashed Zero* (вверху), а затем с включенной функцией OpenType *Slashed Zero* (внизу):
ta: எடுத்துக்காட்டாக, இங்கே `இன்டர் <https://rsms.me/inter/> __ __ எழுத்துரு * குறைக்கப்பட்ட பூச்சியம் * நற்பொருத்தம் (மேல்) இல்லாமல், பின்னர் * குறைக்கப்பட்ட சுழிய * ஓபன்டைப் அம்சத்துடன் (கீழே):
uk: Наприклад, ось шрифт `Inter <https://rsms.me/inter/>`__ без функції *Slashed Zero* (угорі), потім із увімкненою функцією *Slashed Zero* OpenType (внизу):
zh_hant: 例如，下圖為 `Inter <https://rsms.me/inter/>`__ 字型，未啟用 *Slashed Zero* 功能（上），啟用後（下）：

source: OpenType feature comparison (Inter)
ga: Comparáid gné OpenType (Inter)
it: Confronto di funzionalità OpenType (Inter)
ru: Сравнение функций OpenType (Inter)
ta: Opentype அம்ச ஒப்பீடு (இன்டர்)
uk: Порівняння функцій OpenType (Inter)
zh_hant: OpenType 功能對比（Inter）

source: You can disable ligatures and/or kerning for a specific font by adding OpenType features, then unchecking them in the inspector:
ga: Is féidir leat ligatúir agus/nó kerning a dhíchumasú le haghaidh cló ar leith trí ghnéithe OpenType a chur leis, ansin iad a dhísheiceáil sa chigire:
it: È possibile disattivare le legature e/o la crenatura per un font specifico aggiungendo funzionalità OpenType e deselezionandole nell'ispettore:
ru: Вы можете отключить лигатуры и/или кернинг для определенного шрифта, добавив функции OpenType, а затем сняв с них отметки в инспекторе:
ta: ஓபன்டைப் அம்சங்களைச் சேர்ப்பதன் மூலம் ஒரு குறிப்பிட்ட எழுத்துருவுக்கு நீங்கள் தசைநார் மற்றும்/அல்லது கெர்னிங் முடக்கலாம், பின்னர் அவற்றை இன்ச்பெக்டரில் தேர்வு செய்யலாம்:
uk: Ви можете вимкнути лігатури та/або кернінг для певного шрифту, додавши функції OpenType, а потім знявши їх в інспекторі:
zh_hant: 你也可以新增 OpenType 功能後，在屬性檢視器取消勾選，來停用特定字型的連字或字偶距：

source: Disabling ligatures and kerning for a font
ga: Díchumasú a dhíchumasú ligatúir agus ceirniú le haghaidh cló
it: Disabilitazione delle legature e della crenatura per un font
ru: Отключение лигатур и кернинга для шрифта
ta: தசைநார் முடக்குதல் மற்றும் எழுத்துருவுக்கு கெரிங்
uk: Вимкнення лігатур і кернінгу для шрифту
zh_hant: 停用某字型的連字與字偶距

source: System fonts
ga: Clónna córais
it: Font di sistema
ru: Системные шрифты
ta: கணினி எழுத்துருக்கள்
uk: Системні шрифти
zh_hant: 系統字型

source: Loading system fonts is only supported on Windows, macOS, Linux, Android and iOS.
ga: Ní thacaítear le clónna córais a luchtú ach ar Windows, macOS, Linux, Android agus iOS.
it: Il caricamento dei font di sistema è supportato solo su Windows, macOS, Linux, Android e iOS.
ru: Загрузка системных шрифтов поддерживается только в Windows, macOS, Linux, Android и iOS.
ta: சிச்டம் எழுத்துருக்களை ஏற்றுதல் சாளரங்கள், மேகோச், லினக்ச், ஆண்ட்ராய்டு மற்றும் ஐஇமு இல் மட்டுமே ஆதரிக்கப்படுகிறது.
uk: Завантаження системних шрифтів підтримується лише в Windows, macOS, Linux, Android та iOS.
zh_hant: 只有 Windows、macOS、Linux、Android 和 iOS 支援載入系統字型。

source: However, loading system fonts on Android is unreliable as there is no official API for doing so. Godot has to rely on parsing system configuration files, which can be modified by third-party Android vendors. This may result in non-functional system font loading.
ga: Mar sin féin, níl clónna córais luchtaithe ar Android iontaofa mar níl aon API oifigiúil ann chun é sin a dhéanamh. Caithfidh Godot brath ar chomhaid chumraíochta córais a pháirseáil, ar féidir le díoltóirí Android tríú páirtí iad a mhodhnú. D'fhéadfadh luchtú cló córais neamhfheidhmiúil mar thoradh air seo.
ru: Однако загрузка системных шрифтов на Android ненадёжна, поскольку официального API для этого нет. Godot приходится анализировать системные файлы конфигурации, которые могут быть изменены сторонними разработчиками Android. Это может привести к неработоспособности загрузки системных шрифтов.
ta: இருப்பினும், ஆண்ட்ராய்டில் கணினி எழுத்துருக்களை ஏற்றுவது நம்பமுடியாதது, ஏனெனில் அவ்வாறு செய்வதற்கு அதிகாரப்பூர்வ பநிஇ இல்லை. கோடோட் கணினி உள்ளமைவு கோப்புகளை பாகுபடுத்த வேண்டும், இது மூன்றாம் தரப்பு ஆண்ட்ராய்டு விற்பனையாளர்களால் மாற்றப்படலாம். இது செயல்படாத கணினி எழுத்துரு ஏற்றுவதற்கு ஏற்படலாம்.
uk: Однак завантаження системних шрифтів на Android є ненадійним, оскільки для цього немає офіційного API. Godot повинен покладатися на аналіз файлів конфігурації системи, які можуть бути змінені сторонніми постачальниками Android. Це може призвести до нефункціонального завантаження системного шрифту.
zh_hant: 但 Android 平台沒有官方 API，Godot 只能靠解析系統設定檔來找字型，如果手機廠商有自訂，載入系統字型可能會失敗。

source: System fonts are a different type of resource compared to imported fonts. They are never actually imported into the project, but are loaded at runtime. This has 2 benefits:
it: I font di sistema sono un tipo di risorsa diverso rispetto ai font importati. Non sono mai realmente importati nel progetto, ma caricati in fase di esecuzione. Ciò offre due vantaggi:
ru: Системные шрифты — это другой тип ресурсов по сравнению с импортированными шрифтами. Они фактически не импортируются в проект, а загружаются во время выполнения. Это даёт два преимущества:
ta: இறக்குமதி செய்யப்பட்ட எழுத்துருக்களுடன் ஒப்பிடும்போது கணினி எழுத்துருக்கள் வேறு வகை வளமாகும். அவை உண்மையில் ஒருபோதும் திட்டத்தில் இறக்குமதி செய்யப்படுவதில்லை, ஆனால் அவை இயக்க நேரத்தில் ஏற்றப்படுகின்றன. இது 2 நன்மைகளைக் கொண்டுள்ளது:
zh_hant: 系統字型與匯入字型不同，專案不會真正含有這些資源，而是執行時載入。這有兩個優點：

source: The fonts are not included within the exported PCK file, leading to a smaller file size for the exported project.
ga: Níl na clónna san áireamh sa chomhad PCK easpórtáilte, rud a fhágann go mbeidh méid comhaid níos lú don tionscadal easpórtáilte.
it: I font non sono inclusi nel file PCK esportato, il che porta a una dimensione più piccola di file per il progetto esportato.
ru: Шрифты не включаются в экспортируемый файл PCK, что приводит к уменьшению размера файла экспортированного проекта.
ta: ஏற்றுமதி செய்யப்பட்ட பி.சி.கே கோப்பில் எழுத்துருக்கள் சேர்க்கப்படவில்லை, இது ஏற்றுமதி செய்யப்பட்ட திட்டத்திற்கான சிறிய கோப்பு அளவிற்கு வழிவகுக்கிறது.
uk: Шрифти не включені в експортований файл PCK, що призводить до меншого розміру файлу для експортованого проекту.
zh_hant: 字型不會被打包進匯出檔，專案體積較小。

source: Since fonts are not included with the exported project, this avoids licensing issues that would occur if proprietary system fonts were distributed alongside the project.
ga: Ós rud é nach gcuirtear clónna san áireamh leis an tionscadal easpórtála, seachnaíonn sé seo saincheisteanna ceadúnaithe a tharlódh dá ndéanfaí clónna córais dílseánaigh a dháileadh taobh leis an tionscadal.
it: Poiché i font non sono inclusi nel progetto esportato, si evitano problemi di licenza che potrebbero verificarsi se i font di sistema proprietari venissero distribuiti insieme al progetto.
ru: Поскольку шрифты не включены в экспортируемый проект, это позволяет избежать проблем с лицензированием, которые могли бы возникнуть, если бы фирменные системные шрифты распространялись вместе с проектом.
ta: ஏற்றுமதி செய்யப்பட்ட திட்டத்துடன் எழுத்துருக்கள் சேர்க்கப்படவில்லை என்பதால், இது திட்டத்துடன் தனியுரிம அமைப்பு எழுத்துருக்கள் விநியோகிக்கப்பட்டால் ஏற்படும் உரிமம் வழங்கும் சிக்கல்களை இது தவிர்க்கிறது.
uk: Оскільки шрифти не входять до експортованого проекту, це дозволяє уникнути проблем з ліцензуванням, які могли б виникнути, якщо власницькі системні шрифти розповсюджувалися разом із проектом.
zh_hant: 不用附帶專有字型，也可避免授權問題。
