Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_containers.po
Languages: ga, it, ru, ta, uk, zh_hant

source: This is a special control that will only accept a single *Viewport* node as child, and it will display it as if it was an image (via :ref:`SubViewportContainer <class_SubViewportContainer>`).
ga: Is rialtán speisialta é seo nach nglacfaidh ach le nód amháin *Viewport* mar leanbh, agus taispeánfaidh sé é amhail is dá mba íomhá é (trí :ref:`SubViewportContainer <class_SubViewportContainer>`).
it: Questo è un controllo speciale che accetterà solo un singolo nodo *Viewport* come figlio e lo visualizzerà come se fosse un'immagine (tramite :ref:`SubViewportContainer <class_SubViewportContainer>`).
ru: Это специальный элемент управления, который принимает только один узел *Viewport* в качестве дочернего элемента и отображает его так, как если бы это было изображение (через :ref:`SubViewportContainer <class_SubViewportContainer>`).
ta: இது ஒரு சிறப்புக் கட்டுப்பாடு, இது ஒரு ஒற்றை * ViewPort * முனையை குழந்தையாக மட்டுமே ஏற்றுக் கொள்ளும், மேலும் இது ஒரு படமாக இருப்பதைப் போல காண்பிக்கும் (வழியாக: குறிப்பு: `subviewportcontainer <class_subviewportcontainer>`).
uk: Це спеціальний елемент керування, який прийматиме лише один вузол *Viewport* як дочірній і відображатиме його так, ніби це зображення (через :ref:`SubViewportContainer <class_SubViewportContainer>`).
zh_hant: 這是個特殊控制項，只能接受單一 *Viewport* 節點作為子節點，並將其當作圖片顯示（使用 :ref:`SubViewportContainer <class_SubViewportContainer>`）。

source: Creating custom Containers
ga: Coimeádáin saincheaptha a
it: Creare contenitori personalizzati
ru: Создание пользовательских Containers
ta: தனிப்பயன் கொள்கலன்களை உருவாக்குதல்
uk: Створення спеціальних контейнерів
zh_hant: 建立自訂容器

source: It is possible to create a custom container using a script. Here is an example of a container that fits children to its size:
it: È possibile creare un contenitore personalizzato tramite script. Ecco un esempio di contenitore che adatta i nodi figlio alle sue dimensioni:
ru: Можно создать собственный контейнер с помощью скрипта. Вот пример контейнера, который подгоняет дочерние элементы под свой размер:
zh_hant: 可以用腳本建立自訂容器。以下是一個會讓子節點適應自身大小的容器範例：

source: AspectRatioContainer
ta: விகித விகிதக் கொள்கலன்
zh_hant: 比例容器

source: FlowContainer
ga: FlowCoimeádán
zh_hant: 流式容器

source: CenterContainer
ga: IonadCoimeádán
ta: சென்டர் கான்டெய்னர்
zh_hant: 置中容器

source: This container is useful as top-level, or just to add custom backgrounds to sections of a layout.
ta: இந்த கொள்கலன் உயர்மட்டமாக பயனுள்ளதாக இருக்கும், அல்லது ஒரு தளவமைப்பின் பிரிவுகளில் தனிப்பயன் பின்னணியைச் சேர்க்க.
uk: Цей контейнер корисний як верхнього рівня або просто для додавання власного фону до розділів макета.

source: Accepts a single child node. If this node is bigger than the container, scrollbars will be added to allow panning the node around (via :ref:`ScrollContainer <class_ScrollContainer>`). Both vertical and horizontal size options are respected, and the behavior can be turned on or off per axis in the properties.
ta: ஒற்றை குழந்தை முனையை ஏற்றுக்கொள்கிறது. இந்த முனை கொள்கலனை விட பெரியதாக இருந்தால், முனையைச் சுற்றியுள்ள முனையை அனுமதிக்க ச்க்ரோல்பார்ச் சேர்க்கப்படும் (வழியாக: குறிப்பு: `ச்க்ரோல்கான்டேனர் <class_scrollContainer>`). செங்குத்து மற்றும் கிடைமட்ட அளவு விருப்பங்கள் இரண்டும் மதிக்கப்படுகின்றன, மேலும் நடத்தை பண்புகளில் ஒரு அச்சுக்கு இயக்கப்படலாம் அல்லது முடக்கப்படலாம்.
uk: Приймає один дочірній вузол. Якщо цей вузол більший за контейнер, буде додано смуги прокручування, щоб дозволити панорамування вузла (через :ref:`ScrollContainer <class_ScrollContainer>`). Параметри вертикального та горизонтального розміру дотримуються, і поведінку можна ввімкнути або вимкнути для кожної осі у властивостях.

source: useful when you have a container that needs to be dynamic and responsive to different screen sizes, and you want the child elements to scale proportionally without losing their intended shapes.
ta: வெவ்வேறு திரை அளவுகளுக்கு மாறும் மற்றும் பதிலளிக்கக்கூடிய ஒரு கொள்கலன் உங்களிடம் இருக்கும்போது பயனுள்ளதாக இருக்கும், மேலும் குழந்தை கூறுகள் அவற்றின் நோக்கம் கொண்ட வடிவங்களை இழக்காமல் விகிதாசாரமாக அளவிட வேண்டும் என்று நீங்கள் விரும்புகிறீர்கள்.
uk: корисно, коли у вас є контейнер, який має бути динамічним і реагувати на різні розміри екрана, і ви хочете, щоб дочірні елементи масштабувалися пропорційно, не втрачаючи запланованих форм.

source: FlowContainer is a container that arranges its child controls either horizontally or vertically, (via :ref:`HFlowContainer <class_HFlowContainer>` and via :ref:`VFlowContainer <class_VFlowContainer>`). and when the available space runs out, it wraps the children to the next line or column, similar to how text wraps in a book.
ta: ஃப்ளோ கேன்டெய்னர் என்பது அதன் குழந்தை கட்டுப்பாடுகளை கிடைமட்டமாக அல்லது செங்குத்தாக ஏற்பாடு செய்யும் ஒரு கொள்கலன் ஆகும், (வழியாக: குறிப்பு: `hflowcontainer <class_hflowcontainer>` மற்றும் வழியாக: ref: `vflowcontainer <class_vflowContainer>`). கிடைக்கக்கூடிய இடம் முடிந்ததும், இது குழந்தைகளை அடுத்த வரி அல்லது நெடுவரிசைக்கு போர்த்துகிறது, இது ஒரு புத்தகத்தில் உரை எவ்வாறு மூடுகிறது என்பதைப் போன்றது.
uk: FlowContainer — це контейнер, який розташовує дочірні елементи керування горизонтально або вертикально (через :ref:`HFlowContainer <class_HFlowContainer>` та через :ref:`VFlowContainer <class_VFlowContainer>`). а коли доступний простір закінчується, діти переходять до наступного рядка чи стовпця, подібно до того, як текст переносить у книзі.

source: useful for creating flexible layouts where the child controls adjust automatically to the available space without overlapping.
ta: குழந்தை கட்டுப்பாடுகள் இருக்கும் நெகிழ்வான தளவமைப்புகளை உருவாக்க பயனுள்ளதாக இருக்கும்.
uk: корисно для створення гнучких макетів, де дочірні елементи керування автоматично підлаштовуються до доступного простору без накладання.

source: CenterContainer is a container that automatically keeps all of its child controls centered within it at their minimum size. It ensures that the child controls are always aligned to the center, making it easier to create centered layouts without manual positioning. (via :ref:`CenterContainer <class_CenterContainer>`).
ta: சென்டர் கான்டெய்னர் என்பது ஒரு கொள்கலன் ஆகும், இது அதன் குழந்தை கட்டுப்பாடுகள் அனைத்தையும் தானாகவே அதன் குறைந்தபட்ச அளவில் மையமாகக் கொண்டுள்ளது. குழந்தை கட்டுப்பாடுகள் எப்போதும் மையத்துடன் சீரமைக்கப்படுவதை இது உறுதி செய்கிறது, இதனால் கையேடு நிலைப்படுத்தல் இல்லாமல் மையப்படுத்தப்பட்ட தளவமைப்புகளை உருவாக்குவதை எளிதாக்குகிறது. .
uk: CenterContainer — це контейнер, який автоматично зберігає всі дочірні елементи керування в центрі з мінімальним розміром. Це гарантує, що дочірні елементи керування завжди вирівнюються по центру, що полегшує створення центрованих макетів без ручного позиціонування. (через :ref:`CenterContainer <class_CenterContainer>`).

source: It is possible to create a custom container using a script. Here is an example of a container that fits children to its rect size:
ta: ச்கிரிப்டைப் பயன்படுத்தி தனிப்பயன் கொள்கலனை உருவாக்க முடியும். குழந்தைகளை அதன் செவ்வக அளவிற்கு ஏற்ற ஒரு கொள்கலனின் எடுத்துக்காட்டு இங்கே:
uk: Можна створити спеціальний контейнер за допомогою сценарію. Ось приклад контейнера, який підходить дітям до прямого розміру:
