Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/size_and_anchors.po
Languages: ru, ta, uk, zh_hant

source: Size and anchors
ru: Размер и якоря
ta: அளவு மற்றும் நங்கூரங்கள்
uk: Розмір і анкери
zh_hant: 尺寸與錨點

source: If a game was always going to be run on the same device and at the same resolution, positioning controls would be a simple matter of setting the position and size of each one of them. Unfortunately, that is rarely the case.
ru: Если игра всегда работала на одинаковом устройстве и разрешении, тогда позиционирование и масштабирование кнопок управления было бы проще некуда. К сожалению, этот случай работает не всегда.
ta: ஒரு விளையாட்டு எப்போதுமே ஒரே சாதனத்திலும் அதே தெளிவுத்திறனிலும் இயங்கப் போகிறது என்றால், பொருத்துதல் கட்டுப்பாடுகள் அவை ஒவ்வொன்றின் நிலையையும் அளவையும் அமைப்பதற்கான ஒரு எளிய விசயமாக இருக்கும். துரதிர்ச்டவசமாக, அது அரிதாகவே.
uk: Якби гру запускали на тому самому пристрої із тою ж самою роздільною здатністю, то щоб розставити елементи інтерфейсу, достатньо було би просто вказати кожному з них положення та розмір. На жаль, таке буває вельми рідко.
zh_hant: 如果遊戲始終只在同一台裝置且相同解析度下執行，只需設定每個控制項的位置與大小即可輕鬆完成配置。不過現實情況很少如此簡單。

source: While some configurations may be more common than others, devices like phones, tablets and portable gaming consoles can vary greatly. Therefore, we often have to account for different aspect ratios, resolutions and user scaling.
ru: Хотя некоторые конфигурации встречаются чаще других, устройства вроде смартфонов, планшетов и портативных игровых консолей могут сильно различаться. Поэтому нам часто приходится учитывать разные соотношения сторон, разрешения и пользовательское масштабирование.
ta: சில உள்ளமைவுகள் மற்றவர்களை விட பொதுவானதாக இருக்கும்போது, தொலைபேசிகள், டேப்லெட்டுகள் மற்றும் போர்ட்டபிள் கேமிங் கன்சோல்கள் போன்ற சாதனங்கள் பெரிதும் மாறுபடும். எனவே, வெவ்வேறு அம்ச விகிதங்கள், தீர்மானங்கள் மற்றும் பயனர் அளவிடுதல் ஆகியவற்றை நாம் பெரும்பாலும் கணக்கிட வேண்டும்.
uk: Хоча деякі конфігурації можуть бути більш поширеними, ніж інші, такі пристрої, як телефони, планшети та портативні ігрові консолі, можуть значно відрізнятися. Тому нам часто доводиться враховувати різні співвідношення сторін, роздільну здатність і масштабування користувача.
zh_hant: 雖然有些裝置組合較為常見，但像手機、平板電腦和掌上型遊戲主機等設備差異極大。因此，我們經常需要考量不同的螢幕比例、解析度與使用者縮放。

source: There are several ways to account for this, but for now, let's just imagine that the screen resolution has changed and the controls need to be re-positioned. Some will need to follow the bottom of the screen, others the top of the screen, or maybe the right or left margins.
ru: Существует много способов как с этим бороться, но давайте пока представим что разрешение экрана изменилось и кнопки управления должны быть перемещены. Некоторые должны быть внизу экрана, остальные наверху экрана, или же на остальных боковых сторонах.
ta: இதைக் கணக்கிட பல வழிகள் உள்ளன, ஆனால் இப்போதைக்கு, திரைத் தீர்மானம் மாறிவிட்டது மற்றும் கட்டுப்பாடுகள் மீண்டும் நிலைநிறுத்தப்பட வேண்டும் என்று கற்பனை செய்யலாம். சிலர் திரையின் அடிப்பகுதியைப் பின்பற்ற வேண்டும், மற்றவர்கள் திரையின் மேற்புறம் அல்லது வலது அல்லது இடது விளிம்புகள்.
uk: Є кілька способів пояснити це, але наразі уявімо, що роздільна здатність екрана змінилася, і елементи керування потрібно змінити. Деяким потрібно буде стежити за нижньою частиною екрана, іншим за верхньою частиною екрана або, можливо, за правим чи лівим полями.
zh_hant: 有幾種方式可以應對這些狀況，但現在，請想像螢幕解析度已經改變，控制項必須重新定位。有些需要貼齊螢幕底部，有些要對齊頂部，或是左、右邊界。

source: This is done by editing the *anchor offsets* of controls, which behave similar to a margin. To access these settings, you will first need to select the *Custom* anchor preset.
ru: Это делается путём редактирования *якорей* элементов управления, которые работают аналогично отступам. Чтобы получить доступ к этим настройкам, сначала нужно выбрать пресет *Custom* для якорей.
ta: கட்டுப்பாடுகளின் * நங்கூரம் ஆஃப்செட்டுகளைத் திருத்துவதன் மூலம் இது செய்யப்படுகிறது, அவை விளிம்பைப் போலவே செயல்படுகின்றன. இந்த அமைப்புகளை அணுக, நீங்கள் முதலில் * தனிப்பயன் * நங்கூரம் முன்னமைவைத் தேர்ந்தெடுக்க வேண்டும்.
uk: Це робиться шляхом редагування *зсувів прив’язки* елементів керування, які поводяться подібно до поля. Щоб отримати доступ до цих налаштувань, вам спочатку потрібно буде вибрати *Custom* прив’язку.
zh_hant: 這可以透過調整控制項的 *錨點偏移*（anchor offsets）來達成，這類似於設定邊距。若要調整這些設定，需先選擇 *自訂* 錨點預設值。

source: Each control has four anchor offsets: left, right, bottom, and top, which correspond to the respective edges of the control. By default, all of them represent a distance in pixels relative to the top-left corner of the parent control or (in case there is no parent control) the viewport.
ru: Каждый элемент управления имеет четыре якорных смещения: левое, правое, нижнее и верхнее, которые соответствуют соответствующим границам элемента. По умолчанию все они представляют расстояние в пикселях относительно верхнего левого угла родительского элемента или (если родительский элемент отсутствует) вьюпорта.
ta: ஒவ்வொரு கட்டுப்பாட்டிலும் நான்கு நங்கூரம் ஆஃப்செட்டுகள் உள்ளன: இடது, வலது, கீழ் மற்றும் மேல், அவை கட்டுப்பாட்டின் அந்தந்த விளிம்புகளுக்கு ஒத்திருக்கும். இயல்பாக, அவை அனைத்தும் பெற்றோர் கட்டுப்பாட்டின் மேல்-இடது மூலையுடன் ஒப்பிடும்போது பிக்சல்களில் உள்ள தூரத்தைக் குறிக்கின்றன அல்லது (பெற்றோர் கட்டுப்பாடு இல்லாவிட்டால்) காட்சிப் போர்டில்.
uk: Кожен елемент керування має чотири опорні зміщення: ліворуч, праворуч, знизу та вгорі, які відповідають відповідним краям елемента керування. За замовчуванням усі вони представляють відстань у пікселях відносно верхнього лівого кута батьківського елемента керування або (якщо батьківського елемента керування немає) вікна перегляду.
zh_hant: 每個控制項都有四個錨點偏移：左、右、下、上，分別對應控制項的四個邊。預設情況下，這些偏移值代表相對於父控制項左上角（或沒有父控制項時，則為視窗區）的像素距離。

source: So to make the control wider you can make the right offset larger and/or make the left offset smaller. This lets you set the exact placement and shape of the control.
ru: Таким образом, чтобы сделать элемент управления шире, вы можете увеличить правое смещение и/или уменьшить левое смещение. Это позволяет задать точное положение и форму элемента.
ta: எனவே கட்டுப்பாட்டை அகலப்படுத்த நீங்கள் வலது ஆஃப்செட்டை பெரிதாக்கலாம் மற்றும்/அல்லது இடது ஆஃப்செட்டை சிறியதாக மாற்றலாம். கட்டுப்பாட்டின் சரியான வேலைவாய்ப்பு மற்றும் வடிவத்தை அமைக்க இது உங்களை அனுமதிக்கிறது.
uk: Отже, щоб зробити елемент керування ширшим, ви можете зробити правий зсув більшим і/або зменшити лівий. Це дозволяє встановити точне розташування та форму елемента керування.
zh_hant: 因此，若要讓控制項變寬，可以增加右側偏移值，或減少左側偏移值。這樣你就能精確控制控制項的位置與形狀。

source: The *anchor* properties adjust where the offsets are relative *to*. Each offset has an individual anchor that can be adjusted from the beginning to the end of the parent. So the vertical (top, bottom) anchors adjust from ``0.0`` (top of parent) to ``1.0`` (bottom of parent) with ``0.5`` being the center, and the control offsets will be placed relative to that point. The horizontal (left, right) anchors similarly adjust from left to right of the parent.
ru: Свойства *якорей* определяют, *относительно чего* рассчитываются смещения. Каждое смещение имеет индивидуальный якорь, который можно настраивать от начала до конца родительского элемента. Вертикальные якори (верхний и нижний) изменяются от ``0.0`` (верх родителя) до ``1.0`` (низ родителя), где ``0.5`` соответствует центру, и смещения элемента будут рассчитываться относительно этой точки. Горизонтальные якори (левый и правый) аналогично настраиваются от левого до правого края родителя.
ta: *நங்கூரம் *பண்புகள் ஆஃப்செட்டுகள் *முதல் *வரை இருக்கும் இடத்தை சரிசெய்கின்றன. ஒவ்வொரு ஆஃப்செட்டிலும் ஒரு தனிப்பட்ட நங்கூரம் உள்ளது, அது பெற்றோரின் தொடக்கத்திலிருந்து இறுதி வரை சரிசெய்யப்படலாம். எனவே செங்குத்து (மேல், கீழ்) நங்கூரங்கள் `` 0.0`` (பெற்றோரின் மேல்) முதல் `` 1.0`` (பெற்றோரின் அடிப்பகுதி) வரை `` 0.5`` மையமாக சரிசெய்கின்றன, மேலும் அந்த இடத்துடன் கட்டுப்பாட்டு ஆஃப்செட்டுகள் வைக்கப்படும். கிடைமட்ட (இடது, வலது) நங்கூரங்களும் இதேபோல் பெற்றோரின் இடமிருந்து வலமாக சரிசெய்கின்றன.
uk: Властивості *anchor* регулюють зсуви відносно *до*. Кожне зміщення має окрему прив’язку, яку можна регулювати від початку до кінця батьківської. Таким чином, вертикальні (верхній, нижній) прив’язки регулюються від ``0.0`` (верхня частина батьківського елемента) до ``1.0`` (нижня частина основного елемента), де ``0.5`` є центром, а зсуви керування будуть розміщені відносно цієї точки. Горизонтальні (ліворуч, праворуч) прив’язки так само регулюються зліва направо від батьківського елемента.
zh_hant: *錨點* 屬性用來調整每個偏移值的參考位置。每個邊的偏移都各有一個獨立的錨點，可從父項的起點調整到終點。垂直（上、下）錨點的範圍從 ``0.0``（父項頂部）到 ``1.0``（父項底部），``0.5`` 則表示中心點，控制項的偏移值會以該點為基準。水平（左、右）錨點則用來調整父項的左右範圍。

source: Note that when you wish the edge of a control to be above or left of the anchor point, you must change the offset value to be negative.
ru: Обратите внимание: если требуется, чтобы грань элемента управления находилась выше или левее якорной точки, необходимо задать отрицательное значение смещения.
ta: ஒரு கட்டுப்பாட்டின் விளிம்பு நங்கூரம் புள்ளியின் மேலே அல்லது இடதுபுறமாக இருக்க வேண்டும் என்று நீங்கள் விரும்பும்போது, ஆஃப்செட் மதிப்பை எதிர்மறையாக மாற்ற வேண்டும் என்பதை நினைவில் கொள்க.
uk: Зауважте, що якщо ви бажаєте, щоб край елемента керування був вище або ліворуч від опорної точки, ви повинні змінити значення зсуву на від’ємне.
zh_hant: 請注意，若希望控制項的邊緣位於錨點的上方或左方，偏移值必須設為負數。

source: For example: when horizontal anchors are changed to ``1.0``, the offset values become relative to the top-right corner of the parent control or viewport.
ru: Например: при изменении горизонтальных якорей на ``1.0`` смещения рассчитываются относительно верхнего правого угла родительского элемента или вьюпорта.
ta: எடுத்துக்காட்டாக: கிடைமட்ட நங்கூரர்கள் `` 1.0`` ஆக மாற்றப்படும்போது, ஆஃப்செட் மதிப்புகள் பெற்றோர் கட்டுப்பாடு அல்லது காட்சியமைப்பின் மேல்-வலது மூலையுடன் தொடர்புடையவை.
uk: Наприклад: коли горизонтальні прив’язки змінено на ``1.0``, значення зсуву стають відносно правого верхнього кута батьківського елемента керування або вікна перегляду.
zh_hant: 例如：當水平錨點（左、右）設為 ``1.0`` 時，偏移值就會變成相對於父控制項或視窗區的右側。

source: Adjusting the two horizontal or the two vertical anchors to different values will make the control change size when the parent control does. Here, the control is set to anchor its bottom-right corner to the parent's bottom-right, while the top-left control offsets are still anchored to the top-left of the parent, so when re-sizing the parent, the control will always cover it, leaving a 20 pixel offset:
ru: Настройка двух горизонтальных или двух вертикальных якорей на разные значения приведёт к изменению размера элемента управления при изменении размера родительского элемента. В этом примере элемент управления привязан нижним правым углом к нижнему правому углу родителя, в то время как смещения верхнего левого угла остаются привязанными к верхнему левому углу родителя. Таким образом, при изменении размера родителя элемент управления всегда будет покрывать его, сохраняя смещение в 20 пикселей:
ta: இரண்டு கிடைமட்ட அல்லது இரண்டு செங்குத்து நங்கூரங்களை வெவ்வேறு மதிப்புகளுடன் சரிசெய்வது பெற்றோர் கட்டுப்பாடு இருக்கும்போது கட்டுப்பாட்டு மாற்ற அளவை உருவாக்கும். இங்கே, கட்டுப்பாடு அதன் கீழ்-வலது மூலையை பெற்றோரின் கீழ்-வலதுபுறத்தில் நங்கூரமிட அமைக்கப்பட்டுள்ளது, அதே நேரத்தில் மேல்-இடது கட்டுப்பாட்டு ஆஃப்செட்டுகள் பெற்றோரின் மேல் இடதுசாரிக்கு இன்னும் தொகுக்கப்பட்டுள்ளன, எனவே பெற்றோரை மீண்டும் அளவிடும்போது, கட்டுப்பாடு எப்போதும் அதை மறைக்கும், 20 படப்புள்ளி ஆஃப்செட்டை விட்டுச்செல்லும்:
uk: Налаштування двох горизонтальних або двох вертикальних прив’язок до різних значень призведе до зміни розміру елемента керування разом із батьківським елементом керування. Тут елемент керування налаштовано на прив’язку свого нижнього правого кута до нижнього правого кута батьківського елемента, тоді як зсуви верхнього лівого елемента керування все ще прив’язані до верхнього лівого кута батьківського елемента, тому, змінюючи розміри батьківського елемента, елемент керування завжди покриватиме його, залишаючи зсув у 20 пікселів:
zh_hant: 當水平或垂直的兩個錨點設為不同的值時，控制項會隨著父控制項尺寸改變而調整。在這個例子中，控制項的右下角錨定在父項右下角，左上角的偏移仍舊對齊父項左上，這樣當父項縮放時，該控制項會始終覆蓋整個父項，只留下 20 像素的間距：

source: Centering a control
ru: Центрирование control узла
ta: ஒரு கட்டுப்பாட்டை மையமாகக் கொண்டது
uk: Центрування елемента керування
zh_hant: 控制項置中

source: To center a control in its parent, set its anchors to ``0.5`` and each offset to half of its relevant dimension. For example, the code below shows how a TextureRect can be centered in its parent:
ru: Чтобы центрировать узел управления в его родительском узде, установите его якоря в ``0.5``, а каждое смещение — в половину соответствующего измерения. Например, следующий код демонстрирует центрирование TextureRect в его родительском узле:
ta: அதன் பெற்றோரில் ஒரு கட்டுப்பாட்டை மையப்படுத்த, அதன் நங்கூரங்களை `` 0.5`` ஆகவும், ஒவ்வொன்றும் அதன் தொடர்புடைய பரிமாணத்தின் பாதிக்கு ஆஃப்செட் செய்யவும். எடுத்துக்காட்டாக, கீழே உள்ள குறியீடு அதன் பெற்றோரில் ஒரு டெக்ரனர்டை எவ்வாறு மையமாகக் கொண்டிருக்க முடியும் என்பதைக் காட்டுகிறது:
uk: Щоб відцентрувати елемент керування в його батьківському елементі, установіть його прив’язки на ``0,5`` і кожне зміщення на половину відповідного розміру. Наприклад, наведений нижче код показує, як TextureRect може бути центрований у своєму батьківському:
zh_hant: 若要將控制項置中於父項，請將所有錨點設為 ``0.5``，每個偏移值則設為其對應尺寸的一半。以下範例程式碼展示如何讓 TextureRect 在父項中置中：

source: Setting each anchor to ``0.5`` moves the reference point for the offsets to the center of its parent. From there, we set negative offsets so that the control gets its natural size.
ru: Установка каждого якоря в ``0.5`` перемещает точку отсчёта для смещений в центр родительского элемента. После этого мы задаём отрицательные смещения, чтобы узел управления сохранил свой естественный размер.
ta: ஒவ்வொரு நங்கூரத்தையும் `` 0.5`` க்கு அமைப்பது ஆஃப்செட்களுக்கான குறிப்பு புள்ளியை அதன் பெற்றோரின் மையத்திற்கு நகர்த்துகிறது. அங்கிருந்து, எதிர்மறை ஆஃப்செட்களை அமைத்துள்ளோம், இதனால் கட்டுப்பாடு அதன் இயற்கையான அளவைப் பெறுகிறது.
uk: Встановлення кожного прив’язки на ``0,5`` переміщує опорну точку для зсувів до центру його батьківського елемента. Звідти ми встановлюємо від’ємні зсуви, щоб елемент керування отримав свій природний розмір.
zh_hant: 將每個錨點設為 ``0.5``，會將偏移值的參考點移至父項的中心。此時，設定負值偏移，讓控制項顯示其原本的尺寸。

source: Anchor Presets
ru: Пресеты якорей
ta: நங்கூரம் முன்னமைவுகள்
uk: Попередні налаштування прив’язки
zh_hant: 錨點預設值

source: Instead of manually adjusting the offset and anchor values, you can use the toolbar's Anchor menu, above the viewport. Besides centering, it gives you many options to align and resize control nodes.
ru: Вместо ручной настройки смещений и якорей вы можете использовать меню якоря на панели инструментов над окном просмотра. Помимо центрирования, оно предоставляет множество опций для выравнивания и изменения размеров узлов control.
ta: ஆஃப்செட் மற்றும் நங்கூரம் மதிப்புகளை கைமுறையாக சரிசெய்வதற்கு பதிலாக, நீங்கள் காட்சியகத்திற்கு மேலே கருவிப்பட்டியின் நங்கூர மெனுவைப் பயன்படுத்தலாம். மையப்படுத்துவதைத் தவிர, கட்டுப்பாட்டு முனைகளை சீரமைக்கவும் மறுஅளவாக்கவும் இது உங்களுக்கு பல விருப்பங்களை வழங்குகிறது.
uk: Замість того, щоб вручну налаштовувати значення зміщення та прив’язки, ви можете скористатися меню прив’язки на панелі інструментів над вікном перегляду. Окрім центрування, він надає багато варіантів вирівнювання та зміни розміру контрольних вузлів.
zh_hant: 除了手動調整偏移和錨點數值外，還可以使用視窗區上方工具列的「錨點」選單。除了置中之外，還有多種對齊和調整控制節點大小的選項。
