Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/clion.po
Languages: ga, tr, uk

source: Importing the project
ga: An tionscadal á iompórtáil
tr: Projenin içe aktarılması
uk: Імпорт проекту

source: CLion can import a project's `compilation database file <https://clang.llvm.org/docs/JSONCompilationDatabase.html>`_, commonly named ``compile_commands.json``. To generate the compilation database file, open the terminal, change to the Godot root directory, and run:
ga: Is féidir le CLion `comhad bunachar sonraí tiomsaithe an tionscadail a iompórtáil <https://clang.llvm.org/docs/JSONCompilationDatabase.html>`_, ar a dtugtar go coitianta ``compile_commands.json``. Chun an comhad bunachar sonraí tiomsaithe a ghiniúint, oscail an teirminéal, athraigh go eolaire fréamhacha Godot, agus rith:
tr: CLion bir projenin ``compile_commands.json`` olarak adlandırılan `derleme veritabanı dosyasını <https://clang.llvm.org/docs/JSONCompilationDatabase.html`_ içe aktarabilir. Derleme veritabanı dosyasını oluşturmak için terminali açın, Godot kök dizinine geçin ve şu komutu çalıştırın:
uk: CLion може імпортувати `файл бази даних компіляції <https://clang.llvm.org/docs/JSONCompilationDatabase.html>`_, який зазвичай називається ``compile_commands.json``. Щоб створити файл бази даних компіляції, відкрийте термінал, перейдіть до кореневого каталогу Godot і виконайте:

source: Compiling and debugging the project
ga: An tionscadal a thiomsú agus a dhífhabhtú
tr: Projenin derlenmesi ve hata ayıklanması
uk: Компіляція та налагодження проекту

source: CLion does not support compiling and debugging Godot via SCons out of the box. This can be achieved by creating a custom build target and run configuration in CLion. Before creating a custom build target, you must :ref:`compile Godot <toc-devel-compiling>` once on the command line, to generate the Godot executable. Open the terminal, change into the Godot root directory, and execute:
ga: Ní thacaíonn CLion le tiomsú agus dífhabhtáil Godot trí SCons as an mbosca. Is féidir é seo a bhaint amach trí sprioc saincheaptha tógála agus cumraíocht rith a chruthú in CLion. Sula gcruthaítear sprioc saincheaptha tógála, ní mór duit :tag:` Godot <toc-devel-compiling>` a thiomsú uair amháin ar an líne ordaithe, chun an Godot inrite a ghiniúint. Oscail an teirminéal, athraigh go eolaire fréamhacha Godot, agus déan:
tr: CLion, Godot'un SCons aracılığıyla derlenmesini ve hata ayıklanmasını kendi başına desteklemez. Bu, CLion'da özel bir derleme hedefi oluşturarak ve yapılandırmayı çalıştırarak elde edilebilir. Özel bir derleme hedefi oluşturmadan önce, Godot çalıştırılabilir dosyasını oluşturmak için komut satırından bir kez :ref:`Godot'yu derlemek <toc-devel-compiling>` gereklidir. Terminali açın, Godot kök dizinine geçin ve şunu çalıştırın:
uk: CLion не підтримує компіляцію та налагодження Godot через SCons із коробки. Цього можна досягти, створивши спеціальну ціль збірки та запустивши конфігурацію в CLion. Перш ніж створювати спеціальну ціль збірки, ви повинні :ref:`compile Godot <toc-devel-compiling>` один раз у командному рядку, щоб створити виконуваний файл Godot. Відкрийте термінал, перейдіть у кореневий каталог Godot і виконайте:

source: To add a custom build target that invokes SCons for compilation:
ga: Chun sprioc tógála saincheaptha a chur leis a iarrann SCons le tiomsú:
tr: Derleme için SCons'u çağıran özel bir derleme hedefi eklemek için:
uk: Щоб додати спеціальну ціль збірки, яка викликає SCons для компіляції:

source: Open CLion and navigate to **Preferences > Build, Execution, Deployment > Custom Build Targets**
ga: Oscail Clion agus déan nascleanúint chuig **Roghanna > Tógáil, Forghníomhú, Imscaradh > Spriocanna Tógála Saincheaptha**
tr: CLion'u açın ve **Preferences > Build, Execution, Deployment > Custom Build Targets** bölümüne gidin
uk: Відкрийте CLion і перейдіть до **Параметри > Збірка, виконання, розгортання > Настроювані цілі збірки**

source: Click **Add target** and give the target a name, e.g. ``Godot debug``.
ga: Cliceáil**Cuir sprioc** agus tabhair ainm don sprioc, m.sh. ``Godot debug``.
tr: **Add target** ögesine tıklayın ve hedefe bir isim verin, örneğin ``Godot debug``.
uk: Натисніть **Додати ціль** та введіть назву цілі, наприклад, ``Godot debug``.

source: Click **...** next to the **Build:** selectbox, then click the **+** button in the **External Tools** dialog to add a new external tool.
ga: Cliceáil**... ** in aice leis an mbosca roghnaithe** Tógáil: **, ansin cliceáil ar an gcnaipe**+** sa dialóg **Uirlisí Seachtrach** chun uirlis sheachtrach nua a chur leis.
tr: Yeni bir harici araç eklemek için **Build:** seçim kutusunun yanındaki **...** ögesine tıklayın, ardından **External Tools** iletişim kutusundaki **+** düğmesine tıklayın.
uk: Натисніть **...** поруч із полем вибору **Build:**, а потім натисніть кнопку **+** у діалоговому вікні **Зовнішні інструменти**, щоб додати новий зовнішній інструмент.

source: Give the tool a name, e.g. ``Build Godot debug``, set **Program** to ``scons``, set **Arguments** to the compilation settings you want (see :ref:`compiling Godot <toc-devel-compiling>`), and set the **Working directory** to ``$ProjectFileDir$``, which equals the Godot root directory. Click **OK** to create the tool.
ga: Tabhair ainm don uirlis, e.g. ``Tóg Godot debug``, socraigh **Clár** go ``scons``, socraigh **Argóintí** chuig na socruithe tiomsaithe atá uait (féach :ref:`Godot a thiomsú <toc-devel-compiling>`) , agus socraigh an ** Eolaire oibre** go ``$ProjectFileDir$``, arb ionann é agus eolaire fhréamh Godot. Cliceáil **OK** chun an uirlis a chruthú.
tr: Araca bir ad verin, örneğin ``Build Godot debug``, **Program** ögesini ``scons`` olarak ayarlayın, **Arguments** ögesini istediğiniz derleme ayarlarına ayarlayın (bkz. :ref:`Godot'yu derlemek <toc-devel-compiling>`) ve **Working directory** ögesini Godot kök dizinine eşit olan ``$ProjectFileDir$`` olarak ayarlayın. Aracı oluşturmak için **Tamam** düğmesine tıklayın.
uk: Дайте інструменту назву, напр. ``Build Godot debug``, встановіть **Program** на ``scons``, встановіть **Arguments** на потрібні параметри компіляції (див. :ref:`compiling Godot <toc-devel-compiling>`) , і встановіть **Робочий каталог** на ``$ProjectFileDir$``, що дорівнює кореневому каталогу Godot. Натисніть **ОК**, щоб створити інструмент.

source: CLion does not expand shell commands like ``scons -j$(nproc)``. Use concrete values instead, e.g. ``scons -j8``.
ga: Ní leathnaíonn CLIon orduithe bhlaosc cosúil le ``scons -j $ (nproc) ``. Úsáid luachanna coincréite ina ionad sin, m.sh. ``scons -j8``.
tr: CLion ``scons -j$(nproc)`` gibi kabuk komutlarını genişletmez. Bunun yerine somut değerler kullanın, örneğin ``scons -j8``.
uk: CLion не розширює такі команди оболонки, як ``scons -j$(nproc)``. Натомість використовуйте конкретні значення, напр. ``scons -j8``.

source: Back in the **External Tools** dialog, click the **+** again to add a second external tool for cleaning the Godot build via SCons. Give the tool a name, e.g. ``Clean Godot debug``, set **Program** to ``scons``, set **Arguments** to ``-c`` (which will clean the build), and set the **Working directory** to ``$ProjectFileDir$``. Click **OK** to create the tool.
ga: Ar ais sa dialóg **Uirlisí Seachtrach**, cliceáil ar an **+** arís chun an dara uirlis sheachtrach a chur leis chun an tógáil Godot a ghlanadh trí SCons. Tabhair ainm don uirlis, m.sh. `Clean Godot debug``, socraí**Clár** go ``scons``, socraí**Arguments** go ``-c`` (a ghlanfaidh an tógáil), agus socraigh an **Directory** go ``$ProjectFileDir$``. Cliceáil** OK** chun an uirlis a chruthú.
tr: **External Tools** iletişim kutusuna geri dönün, Godot derlemesini SCons aracılığıyla temizlemek için ikinci bir harici araç eklemek üzere **+** işaretine tekrar tıklayın. Araca bir ad verin, örneğin ``Clean Godot debug``, **Program** ögesini ``scons`` olarak ayarlayın, **Arguments** ögesini ``-c`` olarak ayarlayın (derlemeyi temizleyecektir, clean) ve **Working directory** ögesini ``$ProjectFileDir$`` olarak ayarlayın. Aracı oluşturmak için **Tamam** düğmesine tıklayın.
uk: Повернувшись у діалогове вікно **Зовнішні інструменти**, знову натисніть **+**, щоб додати другий зовнішній інструмент для очищення збірки Godot за допомогою SCons. Дайте інструменту назву, напр. ``Очистити Godot debug``, встановіть **Program** значення ``scons``, встановіть **Arguments** значення ``-c`` (що очистить збірку) і встановіть **Робочий каталог* * до ``$ProjectFileDir$``. Натисніть **ОК**, щоб створити інструмент.

source: Close the **External Tools** dialog. In the **Custom Build Target** dialog for the custom ``Godot debug`` build target, select the **Build Godot debug** tool from the **Build** select box, and select the **Clean Godot debug** tool from the **Clean** select box. Click **OK** to create the custom build target.
ga: Dún an dialóg **Uirlisí Seachtrach**. Sa dialóg **Sprioc Tógála Saincheap** don sprioc tógála saincheaptha ``Godot debug`, roghnaigh an uirlis**Tóg Difhabhtú Godot** ón mbosca roghnaithe**Tógáil**, agus roghnaigh an uirlis**Dífhabhtú Glan Godot** ón mbosca roghnaithe**. Cliceáil** OK** chun an sprioc tógála saincheaptha a chruthú.
tr: **External Tools** iletişim kutusunu kapatın. Özel ``Godot debug`` derleme hedefi için **Custom Build Target** iletişim kutusunda, **Build** seçim kutusundan **Build Godot debug** aracını seçin ve **Clean** seçim kutusundan **Clean Godot debug** aracını seçin. Özel derleme hedefini oluşturmak için **Tamam** ögesine tıklayın.
uk: Закрийте діалогове вікно **Зовнішні інструменти**. У діалоговому вікні **Custom Build Target** для спеціальної цілі збірки ``Godot debug`` виберіть інструмент **Build Godot debug** у полі вибору **Build** і виберіть **Clean Godot debug ** із поля вибору **Очистити**. Натисніть **OK**, щоб створити спеціальну ціль збірки.

source: In the main IDE window, click **Add Configuration**.
ga: Sa phríomhfhuinneog IDE, cliceáil** Cuir Cumraíocht leis **.
tr: Ana IDE penceresinde **Add Configuration** ögesine tıklayın.
uk: У головному вікні IDE натисніть **Додати конфігурацію**.

source: In the **Run/Debug Configuration** dialog, click **Add new...**, then select **Custom Build Application** to create a new custom run/debug configuration.
ga: Sa dialóg **Run/Debug Cumraí**, cliceáil ** Cuir nua leis... **, ansin roghnaigh **Feidhmchlár Tógáil Saincheap** chun cumraíocht nua rith saincheapta/dífhabhtú a chruthú.
tr: Yeni bir özel çalıştırma/hata ayıklama yapılandırması oluşturmak için **Run/Debug Configuration** iletişim kutusunda **Add new...** ögesine tıklayın ve ardından **Custom Build Application** ögesini seçin.
uk: У діалоговому вікні **Налаштування запуску/налагодження** натисніть **Додати нове...**, а потім виберіть **Настроювана програма збірки**, щоб створити нову спеціальну конфігурацію запуску/налагодження.

source: Give the run/debug configuration a name, e.g. ``Godot debug``, select the ``Godot debug`` custom build target as the **Target**. Select the Godot executable in the ``bin/`` folder as the **Executable**, and set the **Program arguments** to ``--editor --path path-to-your-project/``, where ``path-to-your-project/`` should be a path pointing to an existing Godot project. If you omit the ``--path`` argument, you will only be able to debug the Godot Project Manager window. Click **OK** to create the run/debug configuration.
ga: Tabhair ainm don chumraíocht rith/dífhabhtaithe, m.sh. `` Godot debug``, roghnaigh an sprioc tógála saincheaptha `` Godot debug`` mar an **Sprioc**. Roghnaigh an inrite Godot san fhillteán `` araid/`` mar an **Inrite**, agus socraigh **Argóintí an Chláir** chuig ``--eagarthóir --path path-to-do-project/``, áit ar cheart go mbeadh ``conair-go-do-thionscadal/`` mar chonair a dhíríonn ar thionscadal Godot atá ann cheana féin. Má fhágann tú an argóint ``--path`` ar lár, ní bheidh tú in ann ach fuinneog Godot Project Manager a dhífhabhtú. Cliceáil **OK** chun an chumraíocht rith/dífhabhtaithe a chruthú.
tr: Çalıştırma/hata ayıklama yapılandırmasına bir isim verin, örneğin ``Godot debug``, ``Godot debug`` özel derleme hedefini **Target** olarak seçin. **Executable** olarak ``bin/`` klasöründeki Godot çalıştırılabilir dosyasını seçin ve **Program arguments** değerini ``--editor --path path-to-your-project/`` olarak ayarlayın; burada ``path-to-your-project/`` mevcut bir Godot projesine işaret eden bir yol olmalıdır. Eğer ``--path`` argümanını atlarsanız, sadece Godot Proje Yöneticisi penceresinin hata ayıklamasını yapabilirsiniz. Çalıştırma/hata ayıklama yapılandırmasını oluşturmak için **OK** seçeneğine tıklayın.
uk: Дайте назву конфігурації запуску/налагодження, наприклад. ``Godot debug``, виберіть спеціальну ціль збірки ``Godot debug`` як **Ціль**. Виберіть виконуваний файл Godot у папці ``bin/`` як **Виконуваний файл** і встановіть **Аргументи програми** на ``--editor --path path-to-your-project/``, де ``path-to-your-project/`` має бути шляхом, що вказує на існуючий проект Godot. Якщо ви опустите аргумент ``--path``, ви зможете налагодити лише вікно Godot Project Manager. Натисніть **OK**, щоб створити конфігурацію запуску/налагодження.

source: You can now build, run, debug, profile, and Valgrind check the Godot editor via the run configuration.
ga: Is féidir leat anois a thógáil, a rith, a dhífhabhtú, próifíl, agus Valgrind eagarthóir Godot a sheiceáil tríd an gcumraíocht reatha.
tr: Artık çalıştırma yapılandırması aracılığıyla Godot düzenleyicisini derleyebilir, çalıştırabilir, hata ayıklayabilir, profil oluşturabilir ve Valgrind denetimi yapabilirsiniz.
uk: Тепер ви можете створювати, запускати, налагоджувати, профілювати та Valgrind перевіряти редактор Godot через конфігурацію запуску.

source: When playing a scene, the Godot editor will spawn a separate process. You can debug this process in CLion by going to **Run > Attach to process...**, typing ``godot``, and selecting the Godot process with the highest **pid** (process ID), which will usually be the running project.
ga: Agus radharc á imirt, sceithfidh eagarthóir Godot próiseas ar leith. Is féidir leat an próiseas seo a dhífhabhtú in CLion ach dul go **Rith > Ceangail le próiseáil...**, ag clóscríobh ``godot``, agus ag roghnú próiseas Godot leis an **pid** is airde (aitheantas an phróisis), a dhéanfaidh de ghnáth an tionscadal reatha.
tr: Bir sahne oynatılırken, Godot düzenleyici bunu ayrı bir işlemde oluşturacaktır. CLion'da **Run > Attach to process...** seçeneğine gidip ``godot`` yazarak ve en yüksek **pid** (işlem kimliği) olan Godot işlemini seçerek bu işlemde hata ayıklayabilirsiniz, bu genellikle çalışan proje olacaktır.
uk: Під час відтворення сцени редактор Godot запускає окремий процес. Ви можете налагодити цей процес у CLion, перейшовши до **Виконати > Приєднати до процесу...**, ввівши ``godot`` і вибравши процес Godot із найвищим **pid** (ідентифікатором процесу), який буде зазвичай це поточний проект.

source: Ignoring object and library files
uk: Ігнорування файлів об'єктів і бібліотек

source: After building Godot in CLion, you may see the object and library files showing up in the **Project** view.
uk: Після створення Godot в CLion ви можете побачити об’єктні та бібліотечні файли, які відображаються у вікні **Проект**.

source: You can configure CLion to ignore those files:
uk: Ви можете налаштувати CLion на ігнорування цих файлів:

source: Open CLion and navigate to **Preferences > Editor > File Types > Ignored Files and Folders**
uk: Відкрийте CLion і перейдіть до **Параметри > Редактор > Типи файлів > Ігноровані файли та папки**

source: Click the **+** button to add ``*.o`` and ``*.a`` to the list. In Windows, you would add ``*.obj`` and ``*.dll``.
uk: Натисніть кнопку **+**, щоб додати ``*.o`` і ``*.a`` до списку. У Windows потрібно додати ``*.obj`` і ``*.dll``.

source: Now, the files should be ignored in the Project view.
uk: Тепер файли слід ігнорувати в перегляді проекту.

source: CLion
ga: CLionName

source: `CLion <https://www.jetbrains.com/clion/>`_ is a commercial `JetBrains <https://www.jetbrains.com/>`_ IDE for C++.
ga: Is `JetBrains tráchtála <https://www.jetbrains.com/> `_ IDE le haghaidh C++ tráchtála é `CLion <https://www.jetbrains.com/clion/>.
tr: `CLion <https://www.jetbrains.com/clion/>`_, `JetBrains <https://www.jetbrains.com/>`_ tarafından yapılan C++ için ticari bir IDE`dir.

source: Then, open the Godot root directory with CLion. CLion will import the compilation database, index the codebase, and provide autocompletion and other advanced code navigation and refactoring functionality.
ga: Ansin, oscail an eolaire fréamhacha Godot le CLion. Déanfaidh CLion an bunachar sonraí tiomsaithe a iompórtáil, déanfaidh sé innéacsú ar an mbunachar cód, agus soláthróidh sé uathchríochnú agus ardfheidhmíocht loingseoireachta cód agus feidhmiúlacht athmhonaraithe.
tr: Ardından, Godot kök dizinini CLion ile açın. CLion derleme veritabanını içe aktaracak, kod tabanını dizinleyecek ve otomatik tamamlama ve diğer gelişmiş kod gezinme ve yeniden şekillendirme işlevlerini sağlayacaktır.
