Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/visual_studio_code.po
Languages: de, ga, tr, uk

source: `Visual Studio Code <https://code.visualstudio.com>`_ is a free cross-platform code editor by `Microsoft <https://microsoft.com>`_ (not to be confused with :ref:`doc_configuring_an_ide_vs`).
de: `Visual Studio Code <https://code.visualstudio.com>`_ ist ein freier plattformübergreifender Code-Editor von `Microsoft <https://microsoft.com>`_ (nicht zu verwechseln mit :ref:`doc_configuring_an_ide_vs`).
ga: Is eagarthóir cód tras-ardán saor in aisce é `Visual Studio Code <https://code.visualstudio.com>`_ le `Microsoft <https://microsoft.com>`_ (gan a mheascadh le :ref:`doc_configuring_an_ide_vs `).
tr: `Visual Studio Code <https://code.visualstudio.com>`_ , `Microsoft <https://microsoft.com>`_ tarafından üretilen ücretsiz bir çapraz platform kod düzenleyicisidir (:ref:`doc_configuring_an_ide_vs` ile karıştırılmamalıdır).
uk: `Visual Studio Code <https://code.visualstudio.com>`_ це безкоштовний міжплатформний редактор коду від `Microsoft <https://microsoft.com>`_ (не плутати з :ref:`doc_configuring_an_ide_vs`).

source: Importing the project
de: Projekt importieren
ga: An tionscadal á iompórtáil
tr: Projenin içe aktarılması
uk: Імпорт проекту

source: Make sure the C/C++ extension is installed. You can find instructions in the `official documentation <https://code.visualstudio.com/docs/languages/cpp>`_. Alternatively, `clangd <https://open-vsx.org/extension/llvm-vs-code-extensions/vscode-clangd>`_ can be used instead.
de: Stellen Sie sicher, dass die C/C++-Erweiterung installiert ist. Anweisungen finden Sie in der `offiziellen Dokumentation <https://code.visualstudio.com/docs/languages/cpp>`_. Alternativ kann auch `clangd <https://open-vsx.org/extension/llvm-vs-code-extensions/vscode-clangd>`_ verwendet werden.
ga: Cinntigh go bhfuil an síneadh C/C++ suiteáilte. Is féidir leat treoracha a fháil sa cháipéisíocht oifigiúil <https://code.visualstudio.com/docs/languages/cpp>`_. Nó, is féidir `clangd <https://open-vsx.org/extension/llvm-vs-code-extensions/vscode-clangd>`_ a úsáid ina ionad sin.
tr: C/C++ uzantısının kurulu olduğundan emin olun. Talimatları `resmi belgeler <https://code.visualstudio.com/docs/languages/cpp>`_ içinde bulabilirsiniz. Bunun yerine alternatif olarak `clangd <https://open-vsx.org/extension/llvm-vs-code-extensions/vscode-clangd>`_ kullanılabilir.
uk: Переконайтеся, що встановлено розширення C/C++. Ви можете знайти інструкції в `офіційній документації <https://code.visualstudio.com/docs/languages/cpp>`_. Крім того, замість нього можна використовувати `clangd <https://open-vsx.org/extension/llvm-vs-code-extensions/vscode-clangd>`_.

source: When using the clangd extension, run ``scons compiledb=yes``.
de: Wenn Sie die clangd-Erweiterung verwenden, führen Sie ``scons compiledb=yes`` aus.
ga: Agus an síneadh clangd á úsáid agat, reáchtáil ``scons compiledb=yes ``.
tr: clangd uzantısını kullanırken, ``scons compiledb=yes`` komutunu çalıştırın.
uk: У разі використання розширення clangd запустіть ``scons compiledb=yes``.

source: From the Visual Studio Code's main screen open the Godot root folder with **File > Open Folder...**.
de: Öffnen Sie im Hauptbildschirm von Visual Studio Code das Godot-Stammverzeichnis mit **Datei > Ordner öffnen...**.
ga: Ó phríomhscáileán an Chóid Amharc-Stiúideo oscail an fillteán fréamhacha Godot le **Comhad > Fillteán Oscailte...**.
tr: Visual Studio Code'un ana ekranından Godot kök klasörünü **File > Open Folder...** ile açın.
uk: На головному екрані Visual Studio Code відкрийте кореневу папку Godot за допомогою **Файл > Відкрити папку...**.

source: Press :kbd:`Ctrl + Shift + P` to open the command prompt window and enter *Configure Task*.
de: Drücken Sie :kbd:`Strg + Umschalt + P`, um das Eingabeaufforderungsfenster zu öffnen und geben Sie *Configure Task* ein.
ga: Brúigh: KBD: `Ctrl + Shift + P` chun an fhuinneog pras ordaithe a oscailt agus iontráil *Cumraigh Task*.
tr: Komut istemi penceresini açmak için :kbd:`Ctrl + Shift + P` tuşlarına basın ve *Configure Task* girin.
uk: Натисніть :kbd:`Ctrl + Shift + P`, щоб відкрити вікно командного рядка, і введіть *Налаштувати завдання*.

source: Select the **Create tasks.json file from template** option.
de: Wählen Sie die Option **task.json-Datei aus Vorlage erstellen**.
ga: Roghnaigh an comhad **Cruthaigh tasks.json ó theimpléad** rogha.
tr: Şablondan **Create tasks.json file** seçeneğini seçin.
uk: Виберіть параметр **Створити файл tasks.json із шаблону**.

source: Then select **Others**.
de: dann wählen Sie **Others**.
ga: Ansin roghnaigh **Eile**.
tr: Ardından **Others** ögesini seçin.
uk: Потім виберіть **Інші**.

source: If there is no such option as **Create tasks.json file from template** available, either delete the file if it already exists in your folder or create a ``.vscode/tasks.json`` file manually. See `Tasks in Visual Studio Code <https://code.visualstudio.com/docs/editor/tasks#_custom-tasks>`_ for more details on tasks.
de: Wenn die Option **Create tasks.json file from template** nicht verfügbar ist, löschen Sie entweder die Datei, wenn sie bereits in Ihrem Ordner existiert, oder erstellen Sie manuell eine ``.vscode/tasks.json``-Datei. Siehe `Tasks in Visual Studio Code <https://code.visualstudio.com/docs/editor/tasks#_custom-tasks>`_ für weitere Details zu Tasks.
ga: Mura bhfuil rogha dá leithéid **Cruthaigh comhad tascanna.json ón teimpléad** ar fáil, scrios an comhad má tá sé i d'fhillteán cheana nó cruthaigh comhad ``.vscode/tasks.json`` de láimh. Féach `Tasks in Visual Studio Code <https://code.visualstudio.com/docs/editor/tasks#_custom-tasks>`_ le haghaidh tuilleadh sonraí ar thascanna.
tr: **Create tasks.json file from template** gibi bir seçenek yoksa, klasörünüzde zaten varsa dosyayı silin veya elden bir ``.vscode/tasks.json`` dosyası oluşturun. Görevler hakkında daha fazla ayrıntı için `Tasks in Visual Studio Code <https://code.visualstudio.com/docs/editor/tasks#_custom-tasks>`_ bölümüne bakın.
uk: Якщо такий параметр, як **Створити файл tasks.json із шаблону**, недоступний, або видаліть файл, якщо він уже існує у вашій папці, або створіть файл ``.vscode/tasks.json`` вручну. Перегляньте `Завдання у коді Visual Studio <https://code.visualstudio.com/docs/editor/tasks#_custom-tasks>`_, щоб дізнатися більше про завдання.

source: Within the ``tasks.json`` file find the ``"tasks"`` array and add a new section to it:
de: Suchen Sie in der Datei ``task.json`` das Array ``"tasks"`` und fügen Sie einen neuen Abschnitt hinzu:
ga: Laistigh den chomhad ``tasks.json`` faigh an eagar ``tascanna"` agus cuir rannóg nua leis:
tr: ``tasks.json`` dosyası içinde ``"tasks"`` dizisini bulun ve yeni bir bölüm ekleyin:
uk: У файлі ``tasks.json`` знайдіть масив ``"tasks"`` і додайте до нього новий розділ:

source: An example of a filled out ``tasks.json``.
de: Ein Beispiel eines ausgefüllten ``Tasks.json``.
ga: Sampla de `tasks.json`` líonta amach.
tr: Doldurulmuş bir ``tasks.json`` örneği.
uk: Приклад заповненого ``tasks.json``.

source: Arguments can be different based on your own setup and needs. See :ref:`doc_introduction_to_the_buildsystem` for a full list of arguments.
de: Die Argumente können je nach Einrichtung und Anforderungen unterschiedlich sein. Eine vollständige Liste der Argumente finden Sie unter :ref:`doc_introduction_to_the_buildsystem`.
ga: Is féidir le hargóintí a bheith difriúil bunaithe ar do shocrú agus do riachtanais féin. Féach:ref: `doc_introduction_to_the_buildsystem` le haghaidh liosta iomlán argóintí.
tr: Argümanlar kendi kurulumunuza ve ihtiyaçlarınıza göre farklı olabilir. Argümanların tam listesi için :ref:`doc_introduction_to_the_buildsystem` sayfasına bakın.
uk: Аргументи можуть бути різними залежно від ваших власних налаштувань і потреб. Перегляньте :ref:`doc_introduction_to_the_buildsystem` повний список аргументів.

source: Debugging the project
de: Debuggen des Projekts
ga: Dífhabhtú an tionscadail
tr: Projede hata ayıklama
uk: Налагодження проекту

source: To run and debug the project you need to create a new configuration in the ``launch.json`` file.
de: Um das Projekt auszuführen und zu debuggen, müssen Sie eine neue Konfiguration in der Datei ``launch.json`` erstellen.
ga: Chun an tionscadal a reáchtáil agus a dhífhabhtú ní mór duit cumraíocht nua a chruthú sa chomhad ``launch.json``.
tr: Projeyi çalıştırmak ve hata ayıklamak için ``launch.json`` dosyasında yeni bir yapılandırma oluşturmanız gerekir.
uk: Щоб запустити та налагодити проект, вам потрібно створити нову конфігурацію у файлі ``launch.json``.

source: Press :kbd:`Ctrl + Shift + D` to open the Run panel.
de: Drücken Sie :kbd:`Strg + Umschalt + D`, um das Ausführen-Panel zu öffnen.
ga: Brúigh: KBD: `Ctrl + Shift + D` chun an painéal Rith a oscailt.
tr: Run panelini açmak için :kbd:`Ctrl + Shift + D` tuşlarına basın.
uk: Натисніть :kbd:`Ctrl + Shift + D`, щоб відкрити панель «Виконати».

source: If ``launch.json`` file is missing you will be prompted to create a new one.
de: Wenn die Datei ``launch.json`` fehlt, werden Sie aufgefordert, diese neu zu erstellen.
ga: Má tá comhad ``launch.json`` ar iarraidh cuirfear ort ceann nua a chruthú.
tr: Eğer ``launch.json`` dosyası eksikse yeni bir tane oluşturmanız istenecektir.
uk: Якщо файл ``launch.json`` відсутній, вам буде запропоновано створити новий.

source: Select **C++ (GDB/LLDB)**. There may be another platform specific option here. If selected, adjust the configuration example provided accordingly.
de: Wählen Sie **C++ (GDB/LLDB)**. Möglicherweise gibt es hier eine andere plattformspezifische Option. Wenn diese Option ausgewählt ist, passen Sie das bereitgestellte Konfigurationsbeispiel entsprechend an.
tr: **C++ (GDB/LLDB)** ögesini seçin. Burada platforma özel başka bir seçenek olabilir. Seçilmişse, verilen yapılandırma örneğini buna göre ayarlayın.

source: Within the ``launch.json`` file find the ``"configurations"`` array and add a new section to it:
de: Suchen Sie in der Datei ``launch.json`` das Array ``"configurations"`` und fügen Sie einen neuen Abschnitt hinzu:
ga: Laistigh den chomhad ``launch.json`` faigh an eagar ``"cumraíochtaí” ``agus cuir rannóg nua leis:
tr: ``launch.json`` dosyası içinde ``"configurations"`` dizisini bulun ve buna yeni bir bölüm ekleyin:
uk: У файлі ``launch.json`` знайдіть масив ``"configurations"`` і додайте до нього новий розділ:

source: An example of a filled out ``launch.json``.
de: Ein Beispiel für ein ausgefülltes ``launch.json``.
ga: Sampla de ``launch.json`` líonta amach.
tr: Doldurulmuş bir ``launch.json`` örneği.
uk: Приклад заповненого ``launch.json``.

source: Due to sporadic performance issues, it is recommended to use LLDB over GDB on Unix-based systems. Make sure that the `CodeLLDB extension <https://marketplace.visualstudio.com/items?itemName=vadimcn.vscode-lldb>`_ is installed.
de: Aufgrund sporadischer Performanceprobleme wird empfohlen, auf Unix-basierten Systemen LLDB statt GDB zu verwenden. Stellen Sie sicher, dass die `CodeLLDB-Erweiterung <https://marketplace.visualstudio.com/items?itemName=vadimcn.vscode-lldb>`_ installiert ist.
tr: Ara sıra yaşanan performans sorunları nedeniyle, Unix tabanlı sistemlerde GDB yerine LLDB kullanılması önerilir. `CodeLLDB <https://marketplace.visualstudio.com/items?itemName=vadimcn.vscode-lldb>`_ uzantısının yüklü olduğundan emin olun.

source: If you encounter issues with lldb, you may consider using gdb (see the LinuxBSD_gdb configuration).
de: Wenn Sie Probleme mit lldb haben, können Sie gdb verwenden (siehe die LinuxBSD_gdb-Konfiguration).
ga: Má bhíonn fadhbanna agat le lldb, féadfaidh tú smaoineamh ar gdb a úsáid (féach cumraíocht LinuxBSD_GDB).
tr: Eğer lldb ile ilgili sorunlarla karşılaşırsanız, gdb kullanmayı düşünebilirsiniz (LinuxBSD_gdb yapılandırmasına bakınız).
uk: Якщо у вас виникли проблеми з lldb, ви можете розглянути можливість використання gdb (дивіться конфігурацію LinuxBSD_gdb).

source: Do note that lldb may work better with LLVM-based builds. See :ref:`doc_compiling_for_linuxbsd` for further information.
de: Beachten Sie, dass lldb besser mit LLVM-basierten Builds funktionieren kann. Siehe :ref:`doc_compiling_for_linuxbsd` für weitere Informationen.
ga: Tabhair faoi deara go bhféadfadh lldb oibriú níos fearr le tógáil atá bunaithe ar LLVM. Féach:ref: `doc_compiling_for_linuxbsd` le haghaidh tuilleadh faisnéise.
tr: lldb'nin LLVM tabanlı derlemelerle daha iyi çalışabileceğini unutmayın. Daha fazla bilgi için :ref:`doc_compiling_for_linuxbsd` sayfasına bakınız.
uk: Зауважте, що lldb може краще працювати зі збірками на основі LLVM. Перегляньте :ref:`doc_compiling_for_linuxbsd` для отримання додаткової інформації.

source: The name under ``program`` depends on your build configuration, e.g. ``godot.linuxbsd.editor.dev.x86_64`` for 64-bit LinuxBSD platform with ``target=editor`` and ``dev_build=yes``.
de: Der Name unter ``program`` hängt von Ihrer Build-Konfiguration ab, z.B. ``godot.linuxbsd.editor.dev.x86_64`` für die 64-bit LinuxBSD Plattform mit ``target=editor`` und ``dev_build=yes``.
ga: Braitheann an t-ainm faoi `clár`` ar do chumraíocht tógála, m.sh. ``godot.linuxbsd.editor.dev.x86_64`` d'ardán 64-giotán LinuxBSD le ``target=editor`` agus ``dev_build=yes ``.
tr: ``program`` altındaki isim derleme yapılandırmanıza bağlıdır, örneğin ``target=editor`` ve ``dev_build=yes`` ile 64-bit LinuxBSD platformu için ``godot.linuxbsd.editor.dev.x86_64``.
uk: Ім’я під ``program`` залежить від конфігурації вашої збірки, напр. ``godot.linuxbsd.editor.dev.x86_64`` для 64-розрядної платформи LinuxBSD з ``target=editor`` і ``dev_build=yes``.

source: Configuring Intellisense
de: Konfigurieren von Intellisense
ga: Intellisense a chumrú
tr: Intellisense'i Yapılandırma
uk: Налаштування Intellisense

source: For the C/C++ extension:
de: Für die C/C++-Erweiterung:
ga: Maidir leis an síneadh C/C ++:
tr: C/C++ uzantısı için:
uk: Для розширення C/C++:

source: To fix include errors you may be having, you need to configure some settings in the ``c_cpp_properties.json`` file.
de: Um mögliche Include-Fehler zu beheben, müssen Sie einige Einstellungen in der Datei ``c_cpp_properties.json`` vornehmen.
ga: Chun earráidí san áireamh a d'fhéadfadh a bheith agat a shocrú, ní mór duit roinnt socruithe a chumrú sa chomhad `c_cpp_properties.json``.
tr: Yaşadığınız include hatalarını düzeltmek için ``c_cpp_properties.json`` dosyasında bazı ayarları yapılandırmanız gerekir.
uk: Щоб виправити можливі помилки включення, вам потрібно налаштувати деякі параметри у файлі ``c_cpp_properties.json``.

source: First, make sure to build the project since some files need to be generated.
de: Stellen Sie zunächst sicher, dass Sie das Projekt bauen, da einige Dateien generiert werden müssen.
ga: Ar dtús, déan cinnte an tionscadal a thógáil ós rud é gur gá roinnt comhaid a ghiniúint.
tr: Öncelikle, bazı dosyaların oluşturulması gerektiğinden projeyi derlediğinizden emin olun.
uk: По-перше, переконайтеся, що створили проект, оскільки потрібно згенерувати деякі файли.

source: Edit the C/C++ Configuration file either with the UI or with text:
de: Bearbeiten Sie die C/C++-Konfigurationsdatei entweder mit der Benutzeroberfläche oder mit Text:
ga: Cuir an comhad Cumraíochta C/C ++ in eagar leis an gComhéadan nó le téacs:
tr: C/C++ Yapılandırma dosyasını kullanıcı arayüzünden ya da metin ile düzenleyin:
uk: Відредагуйте файл конфігурації C/C++ за допомогою інтерфейсу користувача або за допомогою тексту:

source: Add an include path for your platform, for example, ``${workspaceFolder}/platform/windows``.
de: Fügen Sie einen Include-Pfad für Ihre Plattform hinzu, zum Beispiel ``${workspaceFolder}/platform/windows``.
ga: Cuir cosán san áireamh le haghaidh d'ardán, mar shampla, ``$ {workspaceFolder} /platform/windows``.
tr: Platformunuz için bir include yolu ekleyin, örneğin, ``${workspaceFolder}/platform/windows``.
uk: Додайте включений шлях для вашої платформи, наприклад, ``${workspaceFolder}/platform/windows``.

source: Add defines for the editor ``TOOLS_ENABLED``, debug builds ``DEBUG_ENABLED``, and tests ``TESTS_ENABLED``.
de: Definitionen für den Editor ``TOOLS_ENABLED``, Debug-Builds ``DEBUG_ENABLED`` und Tests ``TESTS_ENABLED`` hinzufügen.
ga: Cuir sainmhínithe leis an eagarthóir ``TOOLS_ENABLED``, tógann debug ``DEBUG_ENABLED``, agus tástálann ``TESTS_ENABLED``.
tr: Düzenleyici için ``TOOLS_ENABLED``, hata ayıklama derlemeleri için ``DEBUG_ENABLED`` ve testler için ``TESTS_ENABLED`` tanımlarını ekleyin.
uk: Додайте визначення для редактора ``TOOLS_ENABLED``, збірки налагодження ``DEBUG_ENABLED`` і тести ``TESTS_ENABLED``.

source: Make sure the compiler path is configured correctly to the compiler you are using. See :ref:`doc_introduction_to_the_buildsystem` for further information on your platform.
de: Stellen Sie sicher, dass der Compilerpfad für den von Ihnen verwendeten Compiler korrekt konfiguriert ist. Siehe :ref:`doc_introduction_to_the_buildsystem` für weitere Informationen zu Ihrer Plattform.
ga: Déan cinnte go bhfuil an cosán tiomsaitheora cumraithe i gceart don thiomsaitheoir atá á úsáid agat Féach:ref: `doc_introduction_to_the_buildsystem` le haghaidh tuilleadh faisnéise ar d'ardán.
tr: Derleyici yolunun kullandığınız derleyiciye göre doğru yapılandırıldığından emin olun. Platformunuz hakkında daha fazla bilgi için :ref:`doc_introduction_to_the_buildsystem` bölümüne bakın.
uk: Переконайтеся, що шлях компілятора налаштовано правильно для компілятора, який ви використовуєте. Перегляньте :ref:`doc_introduction_to_the_buildsystem` для отримання додаткової інформації про вашу платформу.

source: The ``c_cpp_properties.json`` file should look similar to this for Windows:
de: Die Datei ``c_cpp_properties.json`` sollte unter Windows ähnlich wie diese aussehen:
ga: Ba chóir go mbeadh cuma cosúil leis seo ar an gcomhad `c_cpp_properties.json`` do Windows:
tr: Windows için ``c_cpp_properties.json`` dosyası buna benzer görünmelidir:
uk: Файл ``c_cpp_properties.json`` має виглядати приблизно так для Windows:

source: Alternatively, you can use the scons argument ``compiledb=yes`` and set the compile commands setting ``compileCommands`` to ``compile_commands.json``, found in the advanced section of the C/C++ Configuration UI.
de: Alternativ können Sie das scons-Argument ``compiledb=yes`` verwenden und die Kompilierbefehle mit ``compileCommands`` auf ``compile_commands.json`` setzen, zu finden in der erweiterten Sektion der C/C++ Configuration UI.
ga: De rogha air sin, is féidir leat an argóint scons ``compiledb=yes ``a úsáid agus na horduithe tiomsaithe a shocrú ``CompileCommands`` go `compile_commands.json``, atá le fáil sa chuid chun cinn den Chomhéadain Cumraíochta C/C ++.
tr: Alternatif olarak, ``compiledb=yes`` scons argümanını kullanabilir ve derleme komutlarını C/C++ Yapılandırma Arayüzünün gelişmiş bölümünde bulunan ``compileCommands`` ayarını ``compile_commands.json`` olarak ayarlayabilirsiniz.
uk: Крім того, ви можете використати аргумент scons ``compiledb=yes`` і встановити параметр ``compileCommands`` для команд компіляції на ``compile_commands.json``, який можна знайти в розширеному розділі інтерфейсу користувача конфігурації C/C++.

source: This argument can be added to your build task in ``tasks.json`` since it will need to be run whenever files are added or moved.
de: Dieses Argument kann zu Ihrem Build-Task in ``tasks.json`` hinzugefügt werden, da es immer dann ausgeführt werden muss, wenn Dateien hinzugefügt oder verschoben werden.
ga: Is féidir an argóint seo a chur le do thasc tógála i `tasks.json`` ós rud é go gcaithfear é a reáchtáil aon uair a chuirtear comhaid leis nó a bhogadh.
tr: Bu argüman, dosyalar eklendiğinde veya taşındığında çalıştırılması gerekeceğinden ``tasks.json`` içindeki derleme görevinize eklenebilir.
uk: Цей аргумент можна додати до вашого завдання збирання в ``tasks.json``, оскільки його потрібно буде запускати кожного разу, коли додаються або переміщуються файли.

source: If you run into any issues, ask for help in one of `Godot's community channels <https://godotengine.org/community>`__.
de: Wenn Sie auf Probleme stoßen, bitten Sie um Hilfe in einem von `Godots Community-Kanälen <https://godotengine.org/community>`__.
ga: Má bhíonn aon fhadhb agat, iarr cabhair ar cheann de na bealaí pobail Godot <https://godotenginine.org/community>`__.
tr: Bir sorunla karşılaşırsanız, `Godot topluluk kanalları <https://godotengine.org/community>`__ 'ndan yardım isteyebilirsiniz.
uk: Якщо у вас виникнуть проблеми, зверніться по допомогу в один із каналів спільноти Godot <https://godotengine.org/community>__.

source: To get linting on class reference XML files, install the `vscode-xml extension <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__.
de: Um Linting auf Klassenreferenz-XML-Dateien zu erhalten, installieren Sie die `vscode-xml-Erweiterung <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__.
ga: Chun linting a fháil ar chomhaid XML tagartha ranga, suiteáil an síneadh `vscode-xml <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__.
tr: Sınıf başvuruları XML dosyalarında yazım düzeltme (linting) elde etmek için, `vscode-xml <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__ uzantısını yükleyin.
uk: Щоб отримати ліннування для XML-файлів посилання на клас, установіть розширення `vscode-xml <https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml>`__.

source: Translation status
de: Übersetzungsstatus

source: Visual Studio Code
ga: Cód Stiúideo Amhairc
uk: Visual Studio або VS Code

source: Select **C++ (GDB/LLDB)**. There may be another platform-specific option here. If selected, adjust the configuration example provided accordingly.
uk: Виберіть **C++ (GDB/LLDB)**. Тут може бути інша опція, яка залежить від платформи. Якщо вибрано, відповідно налаштуйте наданий приклад конфігурації.

source: Due to sporadic performance issues, it is recommended to use LLDB over GDB on Unix-based systems. Make sure that the `CodeLLDB extension <https://marketplace.visualstudio.com/items?itemName=vadimcn.vscode-lldb>`_ is installed for configurations using `lldb`.
uk: Через спорадичні проблеми з продуктивністю рекомендується використовувати LLDB замість GDB на системах на базі Unix. Переконайтеся, що для конфігурацій, що використовують `lldb`, встановлено розширення `CodeLLDB <https://marketplace.visualstudio.com/items?itemName=vadimcn.vscode-lldb>`_.
