Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/interpolation.po
Languages: ga, it, ru, ta, uk, zh_tw

source: Interpolation
ga: Idirshuíomh
it: Interpolazione
ru: Интерполяция
ta: இடைக்கணிப்பு
uk: Інтерполяція
zh_tw: 插值

source: Interpolation is a common operation in graphics programming, which is used to blend or transition between two values. Interpolation can also be used to smooth movement, rotation, etc. It's good to become familiar with it in order to expand your horizons as a game developer.
it: L'interpolazione è un'operazione comune nella programmazione grafica, utilizzata per fondere o passare tra due valori. L'interpolazione si può utilizzare anche per rendere più fluido un movimento, una rotazione, ecc. È utile familiarizzarsi con questa operazione per ampliare i propri orizzonti come sviluppatore di giochi.
ru: Интерполяция — распространённая операция в графическом программировании, используемая для смешивания или перехода между двумя значениями. Интерполяция также может использоваться для сглаживания движения, вращения и т. д. Полезно ознакомиться с ней, чтобы расширить свой кругозор как разработчика игр.
uk: Інтерполяція — це поширена операція в графічному програмуванні, яка використовується для змішування або переходу між двома значеннями. Інтерполяція також може бути використана для плавного руху, обертання тощо. Добре ознайомитися з нею, щоб розширити свій кругозір як розробника ігор.
zh_tw: 插值是圖形程式設計中常見的操作，用於在兩個數值之間進行混合或過渡。插值也常用來平滑移動、旋轉等效果。作為遊戲開發者，熟悉插值能拓展你的開發視野。

source: The basic idea is that you want to transition from A to B. A value ``t``, represents the states in-between.
ga: Is é an smaoineamh bunúsach gur mhaith leat aistriú ó A go B. Léiríonn luach ``t ``, na stáit idir eatarthu.
it: L'idea di base è che si desidera passare da A a B. Il valore ``t`` rappresenta gli stati intermedi.
ru: Основная идея состоит в том, что вы хотите перейти из точки А в точку В. Значение ``t`` представляет промежуточные состояния.
ta: அடிப்படை சிந்தனை என்னவென்றால், நீங்கள் A இலிருந்து B க்கு மாற்ற விரும்புகிறீர்கள் `` t``, இடையில் உள்ள மாநிலங்களை குறிக்கிறது.
uk: Основна ідея полягає в тому, що ви хочете перейти від А до В. Значення ``t``, представляє стани між ними.
zh_tw: 基本概念是要從 A 過渡到 B。``t`` 值代表介於兩者之間的狀態。

source: For example, if ``t`` is 0, then the state is A. If ``t`` is 1, then the state is B. Anything in-between is an *interpolation*.
ga: Mar shampla, má tá ``t ``0, ansin is é an stát A. Má tá `t`` 1, ansin is é an stát B. Is é *idirpholiúint* aon rud eatarthu.
it: Ad esempio, se ``t`` è 0, allora lo stato è A. Se ``t`` è 1, allora lo stato è B. Qualsiasi valore intermedio è un'*interpolazione*.
ru: Например, если ``t`` равно 0, то состояние равно A. Если ``t`` равно 1, то состояние равно B. Все, что между ними, является *интерполяцией*.
ta: எடுத்துக்காட்டாக, `` t`` 0 என்றால், மாநிலம் A. `` t`` 1 ஆக இருந்தால், மாநிலம் பி. இடையில் எதுவும் ஒரு *இடைக்கணிப்பு *.
uk: Наприклад, якщо ``t`` дорівнює 0, тоді стан дорівнює A. Якщо ``t`` дорівнює 1, то стан дорівнює B. Все, що знаходиться між ними, є *інтерполяцією*.
zh_tw: 例如，當 ``t`` 為 0 時，狀態為 A；當 ``t`` 為 1 時，狀態為 B。介於兩者之間的任何數值都是 *插值*。

source: Between two real (floating-point) numbers, an interpolation can be described as:
ga: Idir dhá fhíor-uimhir (pointe snámh), is féidir cur síos a dhéanamh ar idirghabháil mar:
it: Tra due numeri reali (in virgola mobile), un'interpolazione può essere descritta come:
ru: Между двумя действительными числами (с плавающей точкой) интерполяцию можно описать следующим образом:
ta: இரண்டு உண்மையான (மிதக்கும்-புள்ளி) எண்களுக்கு இடையில், ஒரு இடைக்கணிப்பை இவ்வாறு விவரிக்க முடியும்:
uk: Між двома дійсними числами (з плаваючою комою) інтерполяцію можна описати так:
zh_tw: 在兩個實數（浮點數）之間，插值可以描述為：

source: And often simplified to:
ga: Agus is minic a shimpliú chuig:
it: E spesso semplificata in:
ru: И часто сокращается до:
ta: மற்றும் பெரும்பாலும் எளிமைப்படுத்தப்படுகிறது:
uk: І часто спрощується до:
zh_tw: 通常簡化為：

source: The name of this type of interpolation, which transforms a value into another at *constant speed* is *"linear"*. So, when you hear about *Linear Interpolation*, you know they are referring to this formula.
ga: Is é ainm an chineál seo idirpháirtíochta, a athraíonn luach go luach eile a*luas tairiseann* ná *"líneach"*. Mar sin, nuair a chloiseann tú fao* Idirghabháil Líneach*, tá a fhios agat go bhfuil siad ag tagairt don fhoirmle seo.
it: Il nome di questo tipo di interpolazione, che trasforma un valore in un altro a una *velocità costante*, è *"lineare"*. Quindi, quando si sente parlare di *interpolazione lineare*, ci si riferisce a questa formula.
ru: Название этого типа интерполяции, преобразующего одно значение в другое с *постоянной скоростью*, — *линейная*. Поэтому, когда вы слышите о *линейной интерполяции*, вы понимаете, что речь идёт об этой формуле.
ta: இந்த வகை இடைக்கணிப்பின் பெயர், இது ஒரு மதிப்பை *நிலையான வேகத்தில் இன்னொருவராக மாற்றுகிறது *"நேரியல்" *. எனவே, *நேரியல் இடைக்கணிப்பு *பற்றி நீங்கள் கேட்கும்போது, அவை இந்த சூத்திரத்தைக் குறிக்கின்றன என்பது உங்களுக்குத் தெரியும்.
uk: Назва цього типу інтерполяції, яка перетворює значення в інше з *постійною швидкістю*, — «лінійна»*. Отже, коли ви чуєте про *лінійну інтерполяцію*, ви знаєте, що вони мають на увазі цю формулу.
zh_tw: 這種以 *固定速度* 將一個值轉換為另一個值的插值方式稱為 *線性插值* （Linear Interpolation）。當你聽到線性插值時，就是指這個公式。

source: There are other types of interpolations, which will not be covered here. A recommended read afterwards is the :ref:`Bezier <doc_beziers_and_curves>` page.
ga: Tá cineálacha eile idirshuímh ann, nach mbeidh clúdaithe anseo. Moltar léamh ina dhiaidh sin ná an leathanach :ref:`Bezier <doc_beziers_and_curves>`.
it: Esistono altri tipi di interpolazioni, che non saranno trattati qui. Si consiglia di leggere successivamente la pagina :ref:`Bezier <doc_beziers_and_curves>`.
ru: Существуют другие типы интерполяций, о которых мы не будем здесь говорить. Чтобы прочесть о них, Вам рекомендуется проследовать на страницу :ref:`Bezier <doc_beziers_and_curves>`.
ta: பிற வகையான இடைக்கணிப்புகள் உள்ளன, அவை இங்கே மூடப்படாது. பரிந்துரைக்கப்பட்ட வாசிப்பு பின்னர்: ref: `பெசியர் <doc_beziers_and_curves>` பக்கம்.
uk: Є й інші види інтерполяції, які тут не будуть розглядатися. Тому, після цієї статті, рекомендується прочитати сторінку :ref:`Bezier <doc_beziers_and_curves>`.
zh_tw: 還有其他類型的插值，這裡不做討論。建議之後參考 :ref:`Bezier <doc_beziers_and_curves>` 頁面。

source: Vector interpolation
ga: Idirphóireacht veicteora
it: Interpolazione vettoriale
ru: Векторная интерполяция
ta: திசையன் இடைக்கணிப்பு
uk: Векторна інтерполяція
zh_tw: 向量插值

source: Vector types (:ref:`Vector2 <class_Vector2>` and :ref:`Vector3 <class_Vector3>`) can also be interpolated, they come with handy functions to do it :ref:`Vector2.lerp() <class_Vector2_method_lerp>` and :ref:`Vector3.lerp() <class_Vector3_method_lerp>`.
ga: Is féidir cineálacha veicteoirí (: ref:`Vector2 <class_Vector2>` agus :tag:`Vector3 <class_Vector3>`) a idirshuíomh freisin, tagann siad le feidhmeanna úsáideacha chun é a dhéanamh :tag:`Vector2.lerp() <class_Vector2_method_lerp>` agus :ref:`Vector3.lerp() <class_Vector3_method_lerp>`.
it: Anche i tipi di vettori (:ref:`Vector2 <class_Vector2>` e :ref:`Vector3 <class_Vector3>`) possono essere interpolati; e sono dotati di funzioni utili per farlo :ref:`Vector2.lerp() <class_Vector2_method_lerp>` e :ref:`Vector3.lerp() <class_Vector3_method_lerp>`.
ru: Векторные типы (:ref:`Vector2 <class_Vector2>` и :ref:`Vector3 <class_Vector3>`) тоже могут быть интерполированы, так как реализуют подходящие для этого функции :ref:`Vector2.lerp() <class_Vector2_method_lerp>` и :ref:`Vector3.lerp() <class_Vector3_method_lerp>`.
ta: திசையன் வகைகள் (: ref: `vector2 <closs_vector2>` மற்றும்: ref: `VECTER3 <sposs_vector3>`) இடைக்கணிக்கப்படலாம், அவை இதைச் செய்ய எளிமையான செயல்பாடுகளுடன் வருகின்றன: ref: `vector2.lerp () <class_vector2_method_lerp>` மற்றும் .
uk: Типи векторів (:ref:`Vector2 <class_Vector2>` і :ref:`Vector3 <class_Vector3>`) також можна інтерполювати, вони мають зручні функції для цього :ref:`Vector2.lerp() <class_Vector2_method_lerp>` і :ref:`Vector3.lerp() <class_Vector3_method_lerp>`.
zh_tw: 向量型別（:ref:`Vector2 <class_Vector2>` 和 :ref:`Vector3 <class_Vector3>`）也可以進行插值，並且提供了方便的函式：:ref:`Vector2.lerp() <class_Vector2_method_lerp>` 與 :ref:`Vector3.lerp() <class_Vector3_method_lerp>`。

source: For cubic interpolation, there are also :ref:`Vector2.cubic_interpolate() <class_Vector2_method_cubic_interpolate>` and :ref:`Vector3.cubic_interpolate() <class_Vector3_method_cubic_interpolate>`, which do a :ref:`Bezier <doc_beziers_and_curves>` style interpolation.
ga: Maidir le hidirshuíomh ciúbach, tá :tag:`Vector2.cubic_interpolate() <class_Vector2_method_cubic_interpolate>` agus :ref:`Vector3.cubic_interpolate() <class_Vector3_method_cubic_interpolate>`, a dhéanann a :ref_curic.
it: Per l'interpolazione cubica, ci sono anche :ref:`Vector2.cubic_interpolate() <class_Vector2_method_cubic_interpolate>` e :ref:`Vector3.cubic_interpolate() <class_Vector3_method_cubic_interpolate>`, che eseguono un'interpolazione di stile :ref:`Bezier <doc_beziers_and_curves>`.
ru: Для кубической интерполяции также существуют :ref:`Vector2.cubic_interpolate() <class_Vector2_method_cubic_interpolate>` и :ref:`Vector3.cubic_interpolate() <class_Vector3_method_cubic_interpolate>`, которые выполняют интерполяцию в стиле :ref:`Bezier <doc_beziers_and_curves>`.
ta: க்யூபிக் இடைக்கணிப்புக்கு, erse: `vector2.cubic_interpolate () <class_vector2_method_cubic_interpolate>` மற்றும்: rect: `vector3.cubic_interpolate () <class_method_cubic_torpolate>` ஓலேசன்.
uk: Для кубічної інтерполяції існують також :ref:`Vector2.cubic_interpolate() <class_Vector2_method_cubic_interpolate>` та :ref:`Vector3.cubic_interpolate() <class_Vector3_method_cubic_interpolate>`, які виконують інтерполяцію в стилі :ref:`Bezier <doc_beziers_and_curves>`.
zh_tw: 若是三次插值，也有 :ref:`Vector2.cubic_interpolate() <class_Vector2_method_cubic_interpolate>` 和 :ref:`Vector3.cubic_interpolate() <class_Vector3_method_cubic_interpolate>` ，它們執行類似 :ref:`Bezier <doc_beziers_and_curves>` 的插值。

source: Here is example pseudo-code for going from point A to B using interpolation:
ga: Seo sampla bréagchód chun dul ó phointe A go B ag baint úsáide as idirphlé:
it: Ecco un esempio di pseudo-codice per passare dal punto A al punto B tramite l'interpolazione:
ru: Вот пример псевдокода для перехода из точки А в точку В с использованием интерполяции:
ta: இடைக்கணிப்பைப் பயன்படுத்தி புள்ளி A இலிருந்து B க்குச் செல்வதற்கான போலி குறியீடு இங்கே:
uk: Ось приклад псевдокоду для переходу від точки А до точки Б за допомогою інтерполяції:
zh_tw: 這是一個使用插值從 A 點移動到 B 點的偽程式碼範例：

source: It will produce the following motion:
ga: Tabharfaidh sé an tairiscint seo a leanas:
it: Ciò produrrà il seguente movimento:
ru: Это произведет следующее движение:
ta: இது பின்வரும் இயக்கத்தை உருவாக்கும்:
uk: Він буде виробляти наступний рух:
zh_tw: 會產生以下的運動：

source: Transform interpolation
ga: Athraigh idirphóireacht
it: Interpolazione di trasformazioni
ru: Интерполяция трансформаций
ta: இடைக்கணிப்பை மாற்றவும்
uk: Інтерполяція перетворень
zh_tw: 變換插值

source: It is also possible to interpolate whole transforms (make sure they have either uniform scale or, at least, the same non-uniform scale). For this, the function :ref:`Transform3D.interpolate_with() <class_Transform3D_method_interpolate_with>` can be used.
ga: Is féidir freisin trasfhoirmeacha iomlána a idirshuí (déan cinnte go bhfuil scála aonfhoirmeach acu nó, ar a laghad, an scála neamhéide céanna). Chun seo, is féidir an fheidhm :ref:`Transform3D.interpolate_with() <class_Transform3D_method_interpolate_with>` a úsáid.
it: È anche possibile interpolare intere trasformazioni (assicurandosi che abbiano una scala uniforme o, almeno, la stessa scala non uniforme). Per fare ciò, si può utilizzare la funzione :ref:`Transform3D.interpolate_with() <class_Transform3D_method_interpolate_with>`.
ru: Также можно интерполировать целые преобразования (убедитесь, что они имеют либо равномерный масштаб, либо, по крайней мере, одинаковый неравномерный масштаб). Для этого можно использовать функцию :ref:`Transform3D.interpolate_with() <class_Transform3D_method_interpolate_with>`.
ta: முழு உருமாற்றங்களையும் ஒன்றிணைப்பதும் சாத்தியமாகும் (அவை சீரான அளவைக் கொண்டிருக்கின்றன அல்லது குறைந்தபட்சம், ஒரே மாதிரியான அளவிலான அளவைக் கொண்டுள்ளன என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்). இதற்காக, செயல்பாடு: குறிப்பு: `உருமாற்றம் 3 டி.
uk: Також можна інтерполювати цілі перетворення (переконайтеся, що вони мають або єдиний масштаб, або, принаймні, однаковий нерівномірний масштаб). Для цього можна використовувати функцію :ref:`Transform3D.interpolate_with() <class_Transform3D_method_interpolate_with>`.
zh_tw: 也可以對整個變換進行插值（請確保它們有一致的縮放，或至少擁有相同的非均勻縮放）。可以使用 :ref:`Transform3D.interpolate_with() <class_Transform3D_method_interpolate_with>` 這個函式來達成。

source: Here is an example of transforming a monkey from Position1 to Position2:
ga: Seo sampla de mhoncaí a athrú ó Position1 go Suíomh 2:
it: Ecco un esempio di trasformazione di una scimmia da Position1 a Position2:
ru: Вот пример трансформирования обезьяны с первой позиции (Position1) на вторую (Position2):
ta: ஒரு குரங்கை நிலை 1 இலிருந்து நிலை 2 ஆக மாற்றுவதற்கான எடுத்துக்காட்டு இங்கே:
uk: Ось приклад перетворення мавпочки з Позиції1 в Позицію2:
zh_tw: 這是一個將猴子從位置1移動到位置2的例子：

source: Using the following pseudocode:
ga: Ag baint úsáide as an pseudocode seo a leanas:
it: Utilizzando il seguente pseudo-codice:
ru: Используя следующий псевдокод:
ta: பின்வரும் சூடோகோடைப் பயன்படுத்துதல்:
uk: За допомогою наступного псевдокоду:
zh_tw: 使用以下偽程式碼：

source: And again, it will produce the following motion:
ga: Agus arís, táirgfidh sé an tairiscint seo a leanas:
it: E di nuovo, produrrà il seguente movimento:
ru: И снова, это произведет следующее движение:
ta: மீண்டும், இது பின்வரும் இயக்கத்தை உருவாக்கும்:
uk: Він буде виробляти наступний рух:
zh_tw: 同樣會產生以下動作：

source: Smoothing motion
ga: Tairiscint réidh
ru: Сглаженное движение
ta: மென்மையான இயக்கம்
uk: Плавний рух
zh_tw: 平滑運動

source: Interpolation can be used to smoothly follow a moving target value, such as a position or a rotation. Each frame, ``lerp()`` moves the current value towards the target value by a fixed percentage of the remaining difference between the values. The current value will smoothly move towards the target, slowing down as it gets closer. Here is an example of a circle following the mouse using interpolation smoothing:
it: L'interpolazione si può utilizzare per seguire fluidamente un valore di destinazione in movimento, come una posizione o una rotazione. A ogni frame, ``lerp()`` sposta il valore attuale verso il valore di destinazione di una percentuale fissa della differenza rimanente tra i due valori. Il valore attuale si sposterà fluidamente verso la destinazione, rallentando man mano che si avvicina. Ecco un esempio di un cerchio che segue il mouse attraverso un'interpolazione fluida:
ru: Интерполяцию можно использовать для плавного отслеживания движущегося целевого значения, например, положения или поворота. В каждом кадре функция ``lerp()`` перемещает текущее значение к целевому на фиксированный процент от оставшейся разницы между значениями. Текущее значение будет плавно двигаться к цели, замедляясь по мере приближения. Вот пример круга, следующего за мышью с использованием интерполяционного сглаживания:
uk: Інтерполяцію можна використовувати для плавного відстеження цільового значення, яке рухається, наприклад позиції або повороту. Кожен кадр ``lerp()`` переміщує поточне значення до цільового значення на фіксований відсоток різниці між значеннями, що залишилася. Поточне значення буде плавно рухатися до цілі, сповільнюючи швидкість у міру наближення. Ось приклад кола, яке слідує за мишею з використанням інтерполяційного згладжування:
zh_tw: 插值也可以用來讓物件平滑地追蹤移動中的目標值，例如位置或旋轉。在每一個畫面更新時，``lerp()`` 會將目前的數值往目標值推進，推進的量是目前與目標之間差距的固定百分比。這樣目前的數值會逐漸靠近目標，並在接近時自動減速。以下是一個圓形使用插值平滑跟隨滑鼠的範例：

source: Here is how it looks:
ga: Seo mar a bhreathnaíonn sé:
it: Ecco come appare:
ru: Вот как это выглядит:
ta: இது எப்படி இருக்கிறது என்பது இங்கே:
uk: Ось як це виглядає:
zh_tw: 效果如下：

source: This is useful for smoothing camera movement, for allies following the player (ensuring they stay within a certain range), and for many other common game patterns.
it: Questo è utile per smussare i movimenti della telecamera, per far sì che gli alleati seguano il giocatore (assicurandosi che restino entro una certa distanza) e per molti altri pattern comuni di gioco.
ru: Это полезно для сглаживания движения камеры, для союзников, следующих за игроком (гарантируя, что они остаются в пределах определенного диапазона), а также для многих других распространенных игровых схем.
uk: Це корисно для згладжування руху камери, для союзників, які стежать за гравцем (переконавшись, що вони залишаються в межах певного діапазону), і для багатьох інших типових ігрових шаблонів.
zh_tw: 這種方法對於平滑攝影機移動、讓隊友跟隨玩家（確保他們保留在一定距離內），以及其他許多常見的遊戲設計都非常實用。

source: Despite using ``delta``, the formula used above is framerate-dependent, because the ``weight`` parameter of ``lerp()`` represents a *percentage* of the remaining difference in values, not an *absolute amount to change*. In ``_physics_process()``, this is usually fine because physics is expected to maintain a constant framerate, and therefore ``delta`` is expected to remain constant.
it: Nonostante l'utilizzo di ``delta``, la formula utilizzata sopra dipende dal frame rate, perché il parametro ``weight`` di ``lerp()`` rappresenta una *percentuale* della differenza rimanente nei valori, non una *quantità assoluta da cambiare*. In ``_physics_process()``, questo di solito va bene perché ci si aspetta che la fisica mantenga un frame rate costante, e dunque ``delta`` dovrebbe rimanere costante.
ru: Несмотря на использование ``delta``, формула, использованная выше, зависит от частоты кадров, поскольку параметр ``weight (вес)`` функции ``lerp()`` представляет собой *процент* оставшейся разницы значений, а не *абсолютную величину изменения*. В ``_physics_process()`` это обычно приемлемо, поскольку физика должна поддерживать постоянную частоту кадров, и, следовательно, ``delta`` также должна оставаться постоянной.
uk: Незважаючи на використання ``delta``, використана вище формула залежить від частоти кадрів, оскільки параметр ``weight`` ``lerp()`` представляє *відсоток* різниці значень, що залишилася, а не *абсолютну суму, яку потрібно змінити*. У ``_physics_process()`` це зазвичай добре, оскільки очікується, що фізика підтримуватиме постійну частоту кадрів, і тому ``дельта`` має залишатися постійною.
zh_tw: 雖然上述公式有用到 ``delta``，但這種寫法仍然會受到幀率影響，因為 ``lerp()`` 的 ``weight`` 參數代表的是「剩餘差距的百分比」，而不是「絕對變化量」。在 ``_physics_process()`` 裡通常沒問題，因為物理更新預期會保持固定的更新率，因此 ``delta`` 會保持一致。

source: For a framerate-independent version of interpolation smoothing that can also be used in ``process()``, use the following formula instead:
it: Per una versione di interpolazione fluida indipendente dal frame rate che si può utilizzare anche in ``process()``, utilizzare invece la seguente formula:
ru: Для версии интерполяционного сглаживания, не зависящей от частоты кадров, которую также можно использовать в ``process()``, используйте следующую формулу:
uk: Для незалежної від частоти кадрів версії інтерполяційного згладжування, яку також можна використовувати в ``process()``, використовуйте натомість таку формулу:
zh_tw: 如果你需要一個不受幀率影響的插值平滑（可用於 ``process()``），請改用以下公式：

source: Deriving this formula is beyond the scope of this page. For an explanation, see `Improved Lerp Smoothing <https://www.gamedeveloper.com/programming/improved-lerp-smoothing->`__ or watch `Lerp smoothing is broken <https://www.youtube.com/watch?v=LSNQuFEDOyQ>`__.
it: Derivare questa formula va oltre lo scopo di questa pagina. Per una spiegazione, consultare `Improved Lerp Smoothing <https://www.gamedeveloper.com/programming/improved-lerp-smoothing->`__ o guardare `Lerp Smoothing is broken <https://www.youtube.com/watch?v=LSNQuFEDOyQ>`__.
ru: Вывод этой формулы выходит за рамки данной страницы. Подробнее см. `Improved Lerp Smoothing <https://www.gamedeveloper.com/programming/improved-lerp-smoothing->`__ или видео `Lerp smoothing is broken <https://www.youtube.com/watch?v=LSNQuFEDOyQ>`__.
uk: Отримання цієї формули виходить за рамки цієї сторінки. Щоб отримати пояснення, перегляньте `Покращене згладжування Lerp <https://www.gamedeveloper.com/programming/improved-lerp-smoothing->`__ або подивіться `Згладжування Lerp порушено <https://www.youtube.com/watch?v=LSNQuFEDOyQ>`__.
zh_tw: 此公式的推導超出本頁範圍。詳細解說請參見：`Improved Lerp Smoothing <https://www.gamedeveloper.com/programming/improved-lerp-smoothing->`__ 或觀看 `Lerp smoothing is broken <https://www.youtube.com/watch?v=LSNQuFEDOyQ>`__。

source: Interpolation is a very basic operation in graphics programming. It's good to become familiar with it in order to expand your horizons as a graphics developer.
ta: கிராபிக்ச் நிரலாக்கத்தில் இடைக்கணிப்பு மிகவும் அடிப்படை செயல்பாடாகும். கிராபிக்ச் டெவலப்பராக உங்கள் எல்லைகளை விரிவுபடுத்துவதற்காக அதை நன்கு அறிந்திருப்பது நல்லது.

source: Interpolation can be used to smooth movement, rotation, etc. Here is an example of a circle following the mouse using smoothed motion:
ta: இயக்கம், சுழற்சி போன்றவற்றை மென்மையாக்க இடைக்கணிப்பு பயன்படுத்தப்படலாம். மென்மையான இயக்கத்தைப் பயன்படுத்தி சுட்டியைத் தொடர்ந்து ஒரு வட்டத்தின் எடுத்துக்காட்டு இங்கே:
