Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/random_number_generation.po
Languages: ga, it, ru, ta, uk, zh_hant

source: Random number generation
ga: Giniúint uimhir randamach
it: Generazione di numeri casuali
ru: Генерация случайных чисел
ta: சீரற்ற எண் தலைமுறை
uk: Генерація випадкових чисел
zh_hant: 亂數產生

source: Many games rely on randomness to implement core game mechanics. This page guides you through common types of randomness and how to implement them in Godot.
ga: Braitheann go leor cluichí ar randamach chun croímheicníc cluiche a chur i bhfeidh Treoraíonn an leathanach seo tú trí chineálacha coitianta randamach agus conas iad a chur i bhfeidhm i Godot.
it: Molti giochi si affidano alla casualità per implementare certe meccaniche di gioco principali. Questa pagina ti guiderà attraverso i tipi più comuni di casualità e come implementarli in Godot.
ru: Во многих играх случайность используется для реализации основных игровых механик. Эта страница расскажет вам о распространённых типах случайности и о том, как их реализовать в Godot.
ta: பல விளையாட்டுகள் முக்கிய விளையாட்டு இயக்கவியலை செயல்படுத்த சீரற்ற தன்மையை நம்பியுள்ளன. இந்த பக்கம் பொதுவான வகை சீரற்ற தன்மை மற்றும் கோடோட்டில் அவற்றை எவ்வாறு செயல்படுத்துவது என்பதன் மூலம் உங்களை வழிநடத்துகிறது.
uk: Багато ігор покладаються на випадковість для реалізації основної механіки гри. Ця сторінка допоможе вам ознайомитися з поширеними типами випадковості та тим, як їх реалізувати в Godot.
zh_hant: 許多遊戲仰賴隨機性來實作核心遊戲機制。本頁將帶你了解常見的亂數類型，以及如何在 Godot 中實作它們。

source: After giving you a brief overview of useful functions that generate random numbers, you will learn how to get random elements from arrays, dictionaries, and how to use a noise generator in GDScript. Lastly, we'll take a look at cryptographically secure random number generation and how it differs from typical random number generation.
ga: Tar éis duit forbhreathnú gairid a thabhairt duit ar fheidhmeanna úsáideacha a ghineann uimhreacha randamacha, foghlaimeoidh tú conas eilimintí randamacha a fháil ó eagair, foclóirí, agus conas gineadóir torainn a úsáid i GDScript. Ar deireadh, féachfaimid ar ghiniúint uimhreacha randamach atá slán go cripteagrafach agus ar an gcaoi a bhfuil sé difriúil ó ghiniúint uimhreacha randamach tipiciúil.
it: Dopo una breve panoramica delle funzioni utili che generano numeri casuali, imparerai come ottenere elementi casuali da array e dizionari e come utilizzare un generatore di noise in GDScript. Infine, esamineremo la generazione di numeri casuali crittograficamente sicura e le sue differenze rispetto alla tipica generazione di numeri casuali.
ru: После краткого обзора полезных функций генерации случайных чисел вы узнаете, как получать случайные элементы из массивов и словарей, а также как использовать генератор шума в GDScript. Наконец, мы рассмотрим криптографически безопасную генерацию случайных чисел и её отличия от обычной генерации случайных чисел.
ta: சீரற்ற எண்களை உருவாக்கும் பயனுள்ள செயல்பாடுகளின் சுருக்கமான கண்ணோட்டத்தை உங்களுக்கு வழங்கிய பிறகு, வரிசைகள், அகராதிகள் மற்றும் சி.டி.எச்ச்கிரிப்டில் ஒலி செனரேட்டரை எவ்வாறு பயன்படுத்துவது என்பதை எவ்வாறு பெறுவது என்பதை நீங்கள் கற்றுக் கொள்வீர்கள். கடைசியாக, கிரிப்டோகிராஃபிக்கல் பாதுகாப்பான சீரற்ற எண் தலைமுறை மற்றும் இது வழக்கமான சீரற்ற எண் தலைமுறையிலிருந்து எவ்வாறு வேறுபடுகிறது என்பதைப் பார்ப்போம்.
uk: Давши вам короткий огляд корисних функцій, які генерують випадкові числа, ви дізнаєтеся, як отримувати випадкові елементи з масивів, словників і як використовувати генератор шуму в GDScript. Нарешті, ми розглянемо криптографічно безпечну генерацію випадкових чисел і чим вона відрізняється від типової генерації випадкових чисел.
zh_hant: 在簡要介紹產生亂數的實用函式後，你會學到如何從陣列、字典中取得隨機元素，並學會在 GDScript 裡使用雜訊產生器。最後，我們也會看看密碼學安全的亂數產生，以及它與一般亂數產生的差異。

source: Computers cannot generate "true" random numbers. Instead, they rely on `pseudorandom number generators <https://en.wikipedia.org/wiki/Pseudorandom_number_generator>`__ (PRNGs).
ga: Ní féidir le ríomhairí uimhreacha randamacha "fíor" a ghiniúint. Ina áit sin, bíonn siad ag brath ar `ghineadóirí uimhreacha pseudorandom <https://en.wikipedia.org/wiki/Pseudorandom_number_generator>`__ (PRNGs).
it: I computer non possono generare numeri casuali "veri". Si affidano invece ai `generatori di numeri pseudocasuali <https://en.wikipedia.org/wiki/Pseudorandom_number_generator>`__ (PRNG).
ru: Компьютеры не способны генерировать "true" случайные числа. Вместо этого они используют `генераторы псевдослучайных чисел (PRNGs) <https://en.wikipedia.org/wiki/Pseudorandom_number_generator>`__.
ta: கணினிகள் "உண்மையான" சீரற்ற எண்களை உருவாக்க முடியாது. அதற்கு பதிலாக, அவர்கள் `சூடோராண்டம் எண் செனரேட்டர்கள் <https://en.wikipedia.org/wiki/pseudorandom_number_generator>` __ (prngs) ஆகியவற்றை நம்பியுள்ளனர்.
uk: Комп'ютери не можуть генерувати "справжні" випадкові числа. Замість цього вони покладаються на `генератори псевдовипадкових чисел <https://en.wikipedia.org/wiki/Pseudorandom_number_generator>`__ (PRNG-и).
zh_hant: 電腦無法產生「真正」的亂數，而是依賴於 `偽亂數產生器 <https://en.wikipedia.org/wiki/Pseudorandom_number_generator>`__ （PRNGs）。

source: Godot internally uses the `PCG Family <https://www.pcg-random.org/>`__ of pseudorandom number generators.
ga: Úsáideann Godot go hinmheánach an `PCG Family <https://www.pcg-random.org/>`__ de ghineadóirí uimhreach pseudorandom.
it: Godot utilizza internamente la `famiglia PCG <https://www.pcg-random.org/>`__ di generatori di numeri pseudocasuali.
ru: Godot использует внутри себя `PCG Family <https://www.pcg-random.org/>`__ генераторов псевдослучайных чисел.
ta: கோடோட் `பிசிசி குடும்பத்தை <https://www.pcg-random.org/> __ __ போலி எண் செனரேட்டர்களைப் பயன்படுத்துகிறார்.
uk: Godot внутрішньо використовує `Сімейство PCG <https://www.pcg-random.org/>`__ генераторів псевдовипадкових чисел.
zh_hant: Godot 在內部使用 `PCG 家族 <https://www.pcg-random.org/>`__ 的偽亂數產生器。

source: Global scope versus RandomNumberGenerator class
ga: Raon feidhme domhanda i gcoinne rang RandomNumberGenerator
it: Ambito globale rispetto alla classe RandomNumberGenerator
ru: Глобальная область применения по сравнению с классом RandomNumberGenerator
ta: உலகளாவிய நோக்கம் மற்றும் ரேண்டம்நம்பர்செனரேட்டர் வகுப்பு
uk: Глобальна область та клас RandomNumberGenerator
zh_hant: 全域作用域與 RandomNumberGenerator 類別

source: Godot exposes two ways to generate random numbers: via *global scope* methods or using the :ref:`class_RandomNumberGenerator` class.
ga: Nochtann Godot dhá bhealach chun uimhreacha randamacha a ghiniúint: trí mhodhanna* scóip domhana* nó ag baint úsáide as an aicme:ref: `Class_RandomNumberGenerator`.
it: Godot espone due modi per generare numeri casuali: tramite metodi di *ambito globale* o attraverso la classe :ref:`class_RandomNumberGenerator`.
ru: Godot предоставляет два способа генерации случайных чисел: через методы *глобальной области видимости* или используя класс :ref:`class_RandomNumberGenerator`.
ta: சீரற்ற எண்களை உருவாக்க கோடோட் இரண்டு வழிகளை அம்பலப்படுத்துகிறார்: * உலகளாவிய நோக்கம் * முறைகள் வழியாக அல்லது பயன்படுத்துதல்: குறிப்பு: `class_randomnumbergenerator` வகுப்பு.
uk: Godot пропонує два способи генерації випадкових чисел: за допомогою застосування методів *глобальної області*, або за допомогою класу :ref:`class_RandomNumberGenerator` *(Генератор Випадкових Чисел)*.
zh_hant: Godot 提供兩種產生亂數的方式：透過*全域作用域*的方法，或是使用 :ref:`class_RandomNumberGenerator` 類別。

source: Global scope methods are easier to set up, but they don't offer as much control.
ga: Is éasca modhanna raon feidhme domhanda a chur ar bun, ach ní thairgeann siad an oiread rialaithe.
it: I metodi di ambito globale sono più facili da configurare, ma non offrono lo stesso controllo.
ru: Методы глобального охвата проще в настройке, но они не дают такого контроля.
ta: உலகளாவிய நோக்கம் முறைகள் அமைப்பது எளிதானது, ஆனால் அவை அதிக கட்டுப்பாட்டை வழங்காது.
uk: Глобальні методи легше налаштувати, але вони не пропонують багато контролю.
zh_hant: 全域作用域的方法較易設置，但控制性較低。

source: RandomNumberGenerator requires more code to use, but allows creating multiple instances, each with their own seed and state.
ga: Éilíonn RandomNumberGenerator níos mó cód le húsáid, ach ceadaíonn sé cásanna iolracha a chruthú, gach ceann acu lena síol agus a stát féin.
it: RandomNumberGenerator richiede più codice per essere utilizzato, ma consente di creare più istanze, ciascuna con il proprio seed e stato.
ru: RandomNumberGenerator требует больше кода для использования, но позволяет создавать несколько экземпляров, каждый со своим собственным начальным значением и состоянием.
ta: ரேண்டம்நம்பர்செனரேட்டருக்கு பயன்படுத்த அதிக குறியீடு தேவைப்படுகிறது, ஆனால் பல நிகழ்வுகளை உருவாக்க அனுமதிக்கிறது, ஒவ்வொன்றும் அவற்றின் சொந்த விதை மற்றும் மாநிலத்துடன்.
uk: RandomNumberGenerator вимагає більше коду для використання, але дозволяє створювати кілька екземплярів, кожен із власним початковим значенням і станом.
zh_hant: RandomNumberGenerator 雖需更多程式碼，但能建立多個實例，各自擁有獨立種子與狀態。

source: This tutorial uses global scope methods, except when the method only exists in the RandomNumberGenerator class.
ga: Úsáideann an rang teagaisc seo modhanna scóip domhanda, ach amháin nuair nach bhfuil an modh ann ach sa rang RandomNumberGenerator.
it: In questo tutorial vengono utilizzati metodi di ambito globale, tranne quando il metodo esiste solo nella classe RandomNumberGenerator.
ru: В этом учебнике используются методы глобальной области видимости, за исключением случаев, когда метод существует только в классе RandomNumberGenerator.
ta: இந்த டுடோரியல் உலகளாவிய நோக்கம் முறைகளைப் பயன்படுத்துகிறது, முறை சீரற்ற எண் செனரேட்டர் வகுப்பில் மட்டுமே இருக்கும்போது தவிர.
uk: Ця стаття використовує методи глобальної області, за винятком випадків, коли метод існує лише в класі RandomNumberGenerator.
zh_hant: 本教學主要使用全域作用域的方法，除非該方法只存在於 RandomNumberGenerator 類別中。

source: The randomize() method
ga: An modh randamach ()
it: Il metodo randomize()
ru: Метод randomize()
ta: சீரற்ற () முறை
uk: Метод randomize()
zh_hant: randomize() 方法

source: Since Godot 4.0, the random seed is automatically set to a random value when the project starts. This means you don't need to call ``randomize()`` in ``_ready()`` anymore to ensure that results are random across project runs. However, you can still use ``randomize()`` if you want to use a specific seed number, or generate it using a different method.
ga: Ó Godot 4.0, socraítear an síol randamach go huathoibríoch go luach randamach nuair a thosaíonn an tionscadal. Ciallaíonn sé seo nach gá duit glaoch ar ``randamize () ``i ``_ready ()`` `a thuilleadh chun a chinntiú go bhfuil na torthaí randamach ar fud rith tionscadail. Mar sin féin, is féidir leat ``randamize () ``a úsáid fós más mian leat uimhir shíl ar leith a úsáid, nó é a ghiniúint ag baint úsáide as modh difriúil.
it: A partire da Godot 4.0, il seed casuale viene impostato automaticamente su un valore casuale all'avvio del progetto. Questo significa che non è più necessario chiamare ``randomize()`` in ``_ready()`` per garantire che i risultati siano casuali tra diverse esecuzioni del progetto. Tuttavia, è comunque possibile utilizzare ``randomize()`` se si desidera utilizzare un numero specifico di seed, oppure generarlo tramite un metodo diverso.
ru: Начиная с Godot 4.0, начальное значение автоматически устанавливается случайным образом при запуске проекта. Это означает, что вам больше не нужно вызывать ``randomize()`` в ``_ready()``, чтобы гарантировать случайность результатов при каждом запуске проекта. Однако вы по-прежнему можете использовать ``randomize()``, если хотите использовать конкретное начальное значение, или сгенерировать его другим методом.
ta: கோடோட் 4.0 என்பதால், திட்டம் தொடங்கும் போது சீரற்ற விதை தானாக ஒரு சீரற்ற மதிப்புக்கு அமைக்கப்படுகிறது. இதன் பொருள் என்னவென்றால், திட்ட ரன்கள் முழுவதும் முடிவுகள் சீரற்றவை என்பதை உறுதிப்படுத்த `` `` _ ஆயத்தம் () `` இல் `` சீரற்ற () `` ஐ அழைக்க வேண்டிய அவசியமில்லை. இருப்பினும், நீங்கள் ஒரு குறிப்பிட்ட விதை எண்ணைப் பயன்படுத்த விரும்பினால், அல்லது வேறு முறையைப் பயன்படுத்தி அதை உருவாக்க விரும்பினால் `` சீரற்ற () `` பயன்படுத்தலாம்.
uk: Починаючи з Godot 4.0, випадкове початкове значення автоматично встановлюється на випадкове значення під час запуску проекту. Це означає, що вам більше не потрібно викликати ``randomize()`` у ``_ready()``, щоб переконатися, що результати будуть випадковими для виконання проектів. Однак ви все ще можете використовувати ``randomize()``, якщо хочете використати певний початковий номер, або створити його за допомогою іншого методу.
zh_hant: 自 Godot 4.0 起，專案啟動時會自動將亂數種子設為隨機值。這表示你不必再於 ``_ready()`` 裡呼叫 ``randomize()`` 來確保每次執行專案時結果都不同。不過，如果你想用特定種子，或用其他方式產生種子，仍可自行呼叫 ``randomize()``。

source: In global scope, you can find a :ref:`randomize() <class_@GlobalScope_method_randomize>` method. **This method should be called only once when your project starts to initialize the random seed.** Calling it multiple times is unnecessary and may impact performance negatively.
ga: Sa raon feidhme domhanda, is féidir leat modh :ref:`randomize() <class_@GlobalScope_method_randomize>` a aimsiú. **Níor cheart an modh seo a ghlaoch ach uair amháin nuair a thosaíonn do thionscadal ar an síol randamach a thúsú.** Ní gá é a ghlaoch go minic agus d’fhéadfadh tionchar diúltach a bheith aige ar fheidhmíocht.
ru: В глобальной области видимости можно найти метод :ref:`randomize() <class_@GlobalScope_method_randomize>`. **Этот метод следует вызывать только один раз, когда ваш проект начинает инициализировать случайное зерно.** Вызов его несколько раз не нужен и может отрицательно сказаться на производительности.
ta: உலகளாவிய நோக்கத்தில், நீங்கள் A: Ref: `` `` `` `` `` `` `` `class_@globalscope_method_randomize>` முறை ஆகியவற்றைக் காணலாம். ** உங்கள் திட்டம் சீரற்ற விதைகளை துவக்கத் தொடங்கும் போது இந்த முறை ஒரு முறை மட்டுமே அழைக்கப்பட வேண்டும். ** இதை பல முறை அழைப்பது தேவையற்றது மற்றும் செயல்திறனை எதிர்மறையாக பாதிக்கலாம்.
uk: У глобальній області ви можете знайти метод :ref:`randomize() <class_@GlobalScope_method_randomize>`. **Цей метод слід викликати лише один раз, коли ваш проект починає ініціалізувати випадкове початкове число.** Викликати його кілька разів не потрібно, і це може негативно вплинути на продуктивність.
zh_hant: 在全域作用域中，你會找到 :ref:`randomize() <class_@GlobalScope_method_randomize>` 方法。**這個方法只需要在專案啟動時呼叫一次，以初始化亂數種子。** 多次呼叫並無必要，甚至可能影響效能。

source: Putting it in your main scene script's ``_ready()`` method is a good choice:
ga: Is rogha maith é é a chur i modh ``_ready () ``do phríomhscript radharc:
it: Una buona scelta è inserirlo nel metodo ``_ready()`` dello script della scena principale:
ru: Хорошим выбором будет поместить его в метод ``_ready()`` основного скрипта сцены:
ta: உங்கள் முக்கிய காட்சி ச்கிரிப்ட்டின் `` _ready () `` முறை ஒரு நல்ல தேர்வாகும்:
uk: Найкраще буде розмістити його в скрипті головної сцени в методі ``_ready()``:
zh_hant: 將其放在主場景腳本的 ``_ready()`` 方法中是個不錯的做法：

source: You can also set a fixed random seed instead using :ref:`seed() <class_@GlobalScope_method_seed>`. Doing so will give you *deterministic* results across runs:
ga: Is féidir leat síol randamach seasta a shocrú ina ionad sin freisin trí úsáid a bhaint as :ref:`seed() <class_@GlobalScope_method_seed>`. Má dhéanann tú amhlaidh, gheobhaidh tú *torthaí cinntitheacha* thar ritheanna:
it: È possibile anche impostare un seed casuale fisso utilizzando :ref:`seed() <class_@GlobalScope_method_seed>`. Così facendo i risultati saranno *deterministici* da un esecuzione all'altra:
ru: Вы также можете задать фиксированное начальное значение случайной выборки, используя :ref:`seed() <class_@GlobalScope_method_seed>`. Это даст *детерминированные* результаты во всех запусках:
ta: அதற்கு பதிலாக ஒரு நிலையான சீரற்ற விதை அமைக்கலாம்: ref: `விதை () <class_@globalscope_method_seed>`. அவ்வாறு செய்வது உங்களுக்கு * நிர்ணயிக்கும் * முடிவுகளைத் தரும்:
uk: Ви також можете встановити фіксоване випадкове початкове число за допомогою :ref:`seed() <class_@GlobalScope_method_seed>`. Це дасть вам *детерміновані* результати для прогонів:
zh_hant: 你也可以用 :ref:`seed() <class_@GlobalScope_method_seed>` 來設定固定的亂數種子。這樣每次執行專案時都會得到*確定性*的結果：

source: When using the RandomNumberGenerator class, you should call ``randomize()`` on the instance since it has its own seed:
ga: Agus an rang RandomNumberGenerator á úsáid agat, ba cheart duit `` Randomize()`` a ghlaoch ar an ásc toisc go bhfuil a síol féin aige:
it: Quando si utilizza la classe RandomNumberGenerator, è necessario chiamare ``randomize()`` sull'istanza poiché ha il proprio seed:
ru: При использовании класса RandomNumberGenerator необходимо вызвать ``randomize()`` для экземпляра, поскольку у него есть собственное начальное число:
ta: ரேண்டம்நம்பர்செனரேட்டர் வகுப்பைப் பயன்படுத்தும் போது, நீங்கள் `` சீரற்ற () `` என அழைக்க வேண்டும், ஏனெனில் அதன் சொந்த விதை இருப்பதால்:
uk: Використовуючи клас RandomNumberGenerator, ви повинні викликати ``randomize()`` на екземплярі, оскільки він має власне початкове значення:
zh_hant: 如果你使用 RandomNumberGenerator 類別，要對該實例呼叫 ``randomize()``，因為每個實例都有自己獨立的種子：

source: Getting a random number
ga: Uimhir randamach a fháil
it: Ottenere un numero casuale
ru: Получение случайного числа
ta: சீரற்ற எண்ணைப் பெறுதல்
uk: Отримання випадкового числа
zh_hant: 取得亂數

source: Let's look at some of the most commonly used functions and methods to generate random numbers in Godot.
ga: Breathnaímid ar chuid de na feidhmeanna agus na modhanna is coitianta a úsáidtear chun uimhreacha randamacha a ghiniúint i Godot.
it: Esaminiamo alcune delle funzioni e dei metodi più comunemente utilizzati per generare numeri casuali in Godot.
ru: Давайте рассмотрим некоторые наиболее часто используемые функции и методы генерации случайных чисел в Godot.
ta: கோடோட்டில் சீரற்ற எண்களை உருவாக்க பொதுவாக பயன்படுத்தப்படும் சில செயல்பாடுகள் மற்றும் முறைகளைப் பார்ப்போம்.
uk: Давайте розглянемо деякі з найбільш часто використовуваних функцій і методів для генерування випадкових чисел у Godot.
zh_hant: 讓我們看看 Godot 裡常用的亂數產生函式和方法。

source: The function :ref:`randi() <class_@GlobalScope_method_randi>` returns a random number between ``0`` and ``2^32 - 1``. Since the maximum value is huge, you most likely want to use the modulo operator (``%``) to bound the result between 0 and the denominator:
it: La funzione :ref:`randi() <class_@GlobalScope_method_randi>` restituisce un numero casuale compreso tra ``0`` e ``2^32 - 1``. Dato che il valore massimo è enorme, molto probabilmente si desidera utilizzare l'operatore modulo (``%``) per limitare il risultato tra 0 e il denominatore:
ru: Функция :ref:`randi() <class_@GlobalScope_method_randi>` возвращает случайное число в диапазоне от ``0`` до ``2^32 - 1``. Поскольку максимальное значение очень велико, вам, скорее всего, потребуется использовать оператор деления по модулю (``%``), чтобы ограничить результат нулём и знаменателем:
ta: செயல்பாடு: குறிப்பு: `ராண்டி () <class_@globalscope_method_randi>` `0`` மற்றும்` `2^32 - 1`` க்கு இடையில் ஒரு சீரற்ற எண்ணை வழங்குகிறது. அதிகபட்ச மதிப்பு மிகப்பெரியது என்பதால், முடிவை 0 மற்றும் வகுப்பிற்கு இடையில் கட்டுப்படுத்த மாடுலோ ஆபரேட்டரை (``%``) பயன்படுத்த விரும்புகிறீர்கள்:
uk: Функція :ref:`randi() <class_@GlobalScope_method_randi>` повертає випадкове число від ``0`` до ``2^32 - 1``. Оскільки максимальне значення величезне, ви, швидше за все, захочете використати оператор модуля (``%``), щоб зв’язати результат між 0 і знаменником:
zh_hant: 函式 :ref:`randi() <class_@GlobalScope_method_randi>` 會回傳一個介於 0 到 2^32-1 的亂數。由於最大值很大，你通常會想用取餘數運算子 (``%``) 限制結果在 0 到你指定的上限之間：

source: :ref:`randf() <class_@GlobalScope_method_randf>` returns a random floating-point number between 0 and 1. This is useful to implement a :ref:`doc_random_number_generation_weighted_random_probability` system, among other things.
ga: Tugann :ref:`randf() <class_@GlobalScope_method_randf>> uimhir randamach snámhphointe ar ais idir 0 agus 1. Tá sé seo úsáideach chun córas :ref:`doc_random_number_generation_weighted_random_probability` a chur i bhfeidhm, i measc rudaí eile.
it: :ref:`randf() <class_@GlobalScope_method_randf>` restituisce un numero casuale in virgola mobile compreso tra 0 e 1. Questo è utile, tra altre cose, per implementare un sistema di :ref:`doc_random_number_generation_weighted_random_probability`.
ru: :ref:`randf() <class_@GlobalScope_method_randf>` возвращает случайное число с плавающей запятой от 0 до 1. Это полезно, среди прочего, для реализации системы :ref:`doc_random_number_generation_weighted_random_probability`.
ta: :ref:`randf() <class_@GlobalScope_method_randf>` returns a சீரற்ற floating-point எண் between 0 and 1. This is useful பெறுநர் implement a :ref:`doc_random_number_generation_weighted_random_probability` system, among மற்றொன்று things.
uk: :ref:`randf() <class_@GlobalScope_method_randf>` повертає випадкове число з плаваючою комою від 0 до 1. Це корисно, серед іншого, для реалізації системи :ref:`doc_random_number_generation_weighted_random_probability`.
zh_hant: :ref:`randf() <class_@GlobalScope_method_randf>` 會回傳一個 0 到 1 之間的亂數浮點數。這對於實作 :ref:`doc_random_number_generation_weighted_random_probability` 等加權隨機系統很有用。

source: :ref:`randfn() <class_@GlobalScope_method_randfn>` returns a random floating-point number following a `normal distribution <https://en.wikipedia.org/wiki/Normal_distribution>`__. This means the returned value is more likely to be around the mean (0.0 by default), varying by the deviation (1.0 by default):
it: :ref:`randfn() <class_@GlobalScope_method_randfn>` restituisce un numero casuale in virgola mobile seguendo una `distribuzione normale <https://it.wikipedia.org/wiki/Distribuzione_normale>`__. Ciò significa che è più probabile che il valore restituito si avvicini alla media (0,0 per valore predefinito), variando in base alla deviazione (1,0 per valore predefinito):
ru: :ref:`randfn() <class_@GlobalScope_method_randfn>` возвращает случайное число с плавающей точкой, следующее за `нормальным распределением <https://en.wikipedia.org/wiki/Normal_distribution>`__. Это означает, что возвращаемое значение, скорее всего, будет находиться вблизи среднего значения (по умолчанию 0,0), варьируясь на величину отклонения (по умолчанию 1,0):
ta: . இதன் பொருள் திரும்பிய மதிப்பு சராசரியைச் சுற்றி (இயல்பாக 0.0) இருக்க வாய்ப்புள்ளது, இது விலகலால் மாறுபடும் (இயல்பாக 1.0):
uk: :ref:`randfn() <class_@GlobalScope_method_randfn>` повертає випадкове число з плаваючою комою після `нормального розподілу <https://en.wikipedia.org/wiki/Normal_distribution>`__. Це означає, що повернене значення, швидше за все, буде приблизно середнім (0,0 за замовчуванням), змінюючись на відхилення (1,0 за замовчуванням):
zh_hant: :ref:`randfn() <class_@GlobalScope_method_randfn>` 會回傳符合 `常態分佈 <https://en.wikipedia.org/wiki/Normal_distribution>`__ 的亂數浮點數。這代表回傳值通常會落在平均值（預設 0.0）附近，並依標準差（預設 1.0）變動：

source: :ref:`randf_range() <class_@GlobalScope_method_randf_range>` takes two arguments ``from`` and ``to``, and returns a random floating-point number between ``from`` and ``to``:
ga: :ref:`randf_range() <class_@GlobalScope_method_randf_range>> glacann sé dhá argóint ``ó`` agus ``go``, agus filleann sé uimhir randamach snámhphointe idir ``ó`` agus `` go``:
it: :ref:`randf_range() <class_@GlobalScope_method_randf_range>` accetta due argomenti ``from`` e ``to`` e restituisce un numero casuale in virgola mobile compreso tra ``from`` e ``to``:
ru: :ref:`randf_range() <class_@GlobalScope_method_randf_range>` принимает два аргумента ``from`` и ``to`` и возвращает случайное число с плавающей точкой в диапазоне от ``from`` до ``to``:
ta: :ref:`randf_range() <class_@GlobalScope_method_randf_range>` takes two arguments ``from`` and ``to``, and returns a சீரற்ற floating-point எண் between ``from`` and ``to``:
uk: :ref:`randf_range() <class_@GlobalScope_method_randf_range>` приймає два аргументи ``from`` і ``to`` і повертає випадкове число з плаваючою комою між ``from`` і ``to``:
zh_hant: :ref:`randf_range() <class_@GlobalScope_method_randf_range>` 接受兩個參數 ``from`` 和 ``to``，會回傳一個介於 ``from`` 與 ``to`` 之間的亂數浮點數：
