Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/random_number_generation.po
Languages: ga, it, ru, ta, uk, zh_hant

source: So far, the approaches mentioned above are **not** suitable for *cryptographically secure* pseudorandom number generation (CSPRNG). This is fine for games, but this is not sufficient for scenarios where encryption, authentication or signing is involved.
ga: Go dtí seo, níl na cur chuige a luaitear thuas** oiriúnach d'ghiniúint uimhreacha bréagach (CSPRNG) *slánaithe go cripteagrafaic*. Tá sé seo go breá le haghaidh cluichí, ach níl sé seo leordhóthanach do chásanna ina bhfuil criptiú, fíordheimhniú nó síniú i gceist.
it: Finora, gli approcci summenzionati **non** sono adatti alla generazione di numeri pseudo-casuali *crittograficamente sicuri* (CSPRNG). Questo va bene per i giochi, ma non è sufficiente per scenari che richiedono crittografia, autenticazione o firma.
ru: На данный момент упомянутые выше подходы **не** подходят для *криптографически безопасной* генерации псевдослучайных чисел (CSPRNG). Этого достаточно для игр, но недостаточно для сценариев, где требуется шифрование, аутентификация или подпись.
ta: இதுவரை, மேலே குறிப்பிட்டுள்ள அணுகுமுறைகள் ** ** ** ** கிரிப்டோகிராஃபிக்கல் பாதுகாப்பான*சூடோராண்டம் எண் தலைமுறை (சி.எச்.பி.ஆர்.என்.சி) க்கு ஏற்றவை. இது விளையாட்டுகளுக்கு நல்லது, ஆனால் குறியாக்கம், ஏற்பு அல்லது கையொப்பமிடுதல் சம்பந்தப்பட்ட காட்சிகளுக்கு இது போதுமானதாக இல்லை.
uk: Наразі згадані вище підходи **не** придатні для *криптографічно безпечної* генерації псевдовипадкових чисел (CSPRNG). Це добре для ігор, але цього недостатньо для сценаріїв, де використовуються шифрування, автентифікація або підпис.
zh_hant: 前述方法都**不適合**用於*密碼學安全*的偽亂數產生（CSPRNG）。遊戲用途沒問題，但如果涉及加密、驗證或簽章時，這樣還不夠安全。

source: Godot offers a :ref:`class_Crypto` class for this. This class can perform asymmetric key encryption/decryption, signing/verification, while also generating cryptographically secure random bytes, RSA keys, HMAC digests, and self-signed :ref:`class_X509Certificate`\ s.
ga: Cuireann Godot rang a:ref: `Class_Crypto` ar fáil chuige seo. Is féidir leis an rang seo criptiú/díchriptiú eochair neamhshiméadrach, síniú/fíorú a dhéanamh, agus béite randamacha slán go cripteagrafach, eochracha RSA, díleáidí HMAC, agus féin-shínithe a ghiniúint freisin: ref: `Class_X509Certificate`\ s.
it: Godot offre una classe :ref:`class_Crypto` per questo scopo. Questa classe può eseguire crittografia/decrittografia a chiave asimmetrica, firma/verifica, generando anche byte casuali crittograficamente sicuri, chiavi RSA, digest HMAC e certificati :ref:`class_X509Certificate` autofirmati.
ru: Godot предлагает для этого класс :ref:`class_Crypto`. Этот класс может выполнять асимметричное шифрование/дешифрование, подписывание/верификацию, а также генерировать криптографически безопасные случайные байты, ключи RSA, дайджесты HMAC и самоподписанные сертификаты :ref:`class_X509Certificate`\.
ta: கோடோட் ஒரு: ref: `class_crypto` வகுப்பு. இந்த வகுப்பு சமச்சீரற்ற விசை குறியாக்கம்/மறைகுறியாக்கம், கையொப்பமிடுதல்/சரிபார்ப்பு ஆகியவற்றைச் செய்ய முடியும், அதே நேரத்தில் கிரிப்டோகிராஃபிக்காக பாதுகாப்பான சீரற்ற பைட்டுகள், ஆர்எச்ஏ விசைகள், எச்எம்ஏசி செரிமானங்கள் மற்றும் தன்வய கையொப்பமிடப்பட்டவை: ref: `class_x509 சான்றிதழ்` \ கள்.
uk: Godot пропонує для цього клас :ref:`class_Crypto`. Цей клас може виконувати асиметричне шифрування/дешифрування, підписування/перевірку, а також генерувати криптографічно безпечні випадкові байти, ключі RSA, дайджести HMAC і самопідписані :ref:`class_X509Certificate`\ s.
zh_hant: Godot 提供 :ref:`class_Crypto` 類別來處理這類需求。該類別支援非對稱金鑰加解密、簽章/驗證，也能產生密碼學安全的隨機位元組、RSA 金鑰、HMAC 摘要與自簽 :ref:`class_X509Certificate` 等。

source: The downside of :abbr:`CSPRNG (Cryptographically secure pseudorandom number generation)` is that it's much slower than standard pseudorandom number generation. Its API is also less convenient to use. As a result, :abbr:`CSPRNG (Cryptographically secure pseudorandom number generation)` should be avoided for gameplay elements.
ga: Is é an míbhuntáiste de:abbr: `CSPRNG (Giniúint uimhreacha pseudorandom slán go cripteagrafach) `ná go bhfuil sé i bhfad níos moille ná giniúint chaighdeánach uimhreacha pseudorandom. Níl a API chomh áisiúil le húsáid freisin. Mar thoradh air sin, ba cheart :abbr: `CSPRNG (Giniúint uimhreacha pseudorandom slán go cripteagrafach) `a sheachaint le haghaidh eilimintí gameplay.
it: Lo svantaggio di :abbr:`CSPRNG (generazione di numeri pseudo-casuali crittograficamente sicura)` è che è molto più lenta della generazione di numeri pseudo-casuali standard. Anche la sua API è meno pratica da usare. Pertanto, :abbr:`CSPRNG (generazione di numeri pseudo-casuali crittograficamente sicura)` si dovrebbe evitare per gli elementi di gioco.
ru: Недостатком :abbr:`CSPRNG (Cryptographically secure pseudorandom number generation)` (криптографически безопасная генерация псевдослучайных чисел) является то, что он работает гораздо медленнее стандартной генерации псевдослучайных чисел. Его API также менее удобен в использовании. Поэтому :abbr:`CSPRNG (Cryptographically secure pseudorandom number generation)` следует избегать в игровых элементах.
ta: இதன் தீங்கு: ஏபிபிஆர்: `சி.எச்.பி.ஆர்.என்.சி (கிரிப்டோகிராஃபிக்கல் பாதுகாப்பான சூடோராண்டம் எண் தலைமுறை)` இது நிலையான சூடோராண்டம் எண் தலைமுறையை விட மிகவும் மெதுவாக உள்ளது. அதன் பநிஇ பயன்படுத்த குறைந்த வசதியானது. இதன் விளைவாக,: ஏபிபிஆர்: `சி.எச்.பி.ஆர்.என்.சி (கிரிப்டோகிராஃபிக்கல் பாதுகாப்பான சூடோராண்டம் எண் தலைமுறை)` விளையாட்டு கூறுகளுக்கு தவிர்க்கப்பட வேண்டும்.
uk: Недоліком :abbr:`CSPRNG (Cryptographically secure pseudorandom number generation)` є те, що вона набагато повільніша за стандартну генерацію псевдовипадкових чисел. Його API також менш зручний у використанні. Як результат, слід уникати :abbr:`CSPRNG (Cryptographically secure pseudorandom number generation)` для елементів ігрового процесу.
zh_hant: :abbr:`CSPRNG (密碼學安全偽亂數產生器)` 的缺點是效能明顯慢於一般偽亂數產生器，API 也較不直覺。因此， :abbr:`CSPRNG (Cryptographically secure pseudorandom number generation)` 不建議用於遊戲玩法相關的亂數。

source: Example of using the Crypto class to generate 2 random integers between ``0`` and ``2^32 - 1`` (inclusive):
ga: Sampla de úsáid an aicme Crypto chun 2 shláimhir randamach a ghiniúint idir ``0`` agus ``2^32 - 1`` (go huimsitheach):
it: Esempio di utilizzo della classe Crypto per generare 2 numeri interi casuali compresi tra ``0`` e ``2^32 - 1`` (inclusi):
ru: Пример использования класса Crypto для генерации двух случайных целых чисел от ``0`` до ``2^32 - 1`` (включительно):
ta: `` 0`` மற்றும் `` 2^32 - 1`` (உள்ளடக்கிய) இடையே 2 சீரற்ற முழு எண்களை உருவாக்க மறையீட்டு வகுப்பைப் பயன்படுத்துவதற்கான எடுத்துக்காட்டு:
uk: Приклад використання класу Crypto для створення 2 випадкових цілих чисел від ``0`` до ``2^32 - 1`` (включно):
zh_hant: 以下範例演示如何用 Crypto 類別產生兩個介於 ``0`` 與 ``2^32 - 1`` （含）的隨機整數：

source: See :ref:`class_PackedByteArray`'s documentation for other methods you can use to decode the generated bytes into various types of data, such as integers or floats.
ga: Féach:ref: cáipéisíocht `Class_PackedByteArray` le haghaidh modhanna eile is féidir leat a úsáid chun na beátaí ginte a dhíchódú i gcineálacha éagsúla sonraí, mar shampla sláimhreacha nó snámha.
it: Consultare la documentazione di :ref:`class_PackedByteArray` per altri metodi utilizzabili per decodificare i byte generati in vari tipi di dati, come numeri interi o float.
ru: См. документацию :ref:`class_PackedByteArray` для получения информации о других методах, которые можно использовать для декодирования сгенерированных байтов в различные типы данных, такие как целые числа или числа с плавающей точкой.
ta: காண்க: குறிப்பு: பிற முறைகளுக்கான `class_packedbytearray` இன் ஆவணங்கள் உருவாக்கப்பட்ட பைட்டுகளை முழு வகை தரவுகளாக டிகோட் செய்ய நீங்கள் பயன்படுத்தலாம், அதாவது முழு எண் அல்லது மிதவைகள்.
uk: Перегляньте документацію :ref:`class_PackedByteArray` щодо інших методів, які можна використовувати для декодування згенерованих байтів у різні типи даних, такі як цілі чи числа з плаваючою точкою.
zh_hant: 更多如何將產生的位元組解碼為各種資料型態（如整數或浮點數）的方法，請參閱 :ref:`class_PackedByteArray` 的說明文件。
