Repository: Rindbee/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/random_number_generation.po
Languages: ga, it, ru, ta, uk, zh_hant

source: :ref:`randi_range() <class_@GlobalScope_method_randi_range>` takes two arguments ``from`` and ``to``, and returns a random integer between ``from`` and ``to``:
it: :ref:`randi_range() <class_@GlobalScope_method_randi_range>` accetta due argomenti ``from`` e ``to`` e restituisce un numero intero casuale compreso tra ``from`` e ``to``:
ru: :ref:`randi_range() <class_@GlobalScope_method_randi_range>` принимает два аргумента ``from`` и ``to`` и возвращает случайное целое число между ``from`` и ``to``:
ta: :ref:`randi_range() <class_@GlobalScope_method_randi_range>` takes two arguments ``from`` and ``to``, and returns a சீரற்ற முழு எண் between ``from`` and ``to``:
uk: :ref:`randi_range() <class_@GlobalScope_method_randi_range>` приймає два аргументи ``від`` і ``до`` і повертає випадкове ціле число між ``від`` і ``до``:
zh_hant: :ref:`randi_range() <class_@GlobalScope_method_randi_range>` 接受兩個參數 ``from`` 和 ``to``，會回傳一個介於 ``from`` 與 ``to`` 之間的亂數整數：

source: Get a random array element
ga: Faigh eilimint eagair randamach
it: Ottenere un elemento casuale di un array
ru: Получить случайный элемент массива
ta: சீரற்ற வரிசை உறுப்பைப் பெறுங்கள்
uk: Отримання випадкового елемента масиву
zh_hant: 取得隨機陣列元素

source: We can use random integer generation to get a random element from an array, or use the :ref:`Array.pick_random<class_Array_method_pick_random>` method to do it for us:
it: Possiamo utilizzare la generazione di numeri interi casuali per ottenere un elemento casuale da un array, oppure utilizzare il metodo :ref:`Array.pick_random<class_Array_method_pick_random>` affinché lo faccia per noi:
ru: Мы можем использовать генерацию случайных целых чисел, чтобы получить случайный элемент из массива, или использовать метод :ref:`Array.pick_random<class_Array_method_pick_random>`, который сделает это за нас:
ta: ஒரு வரிசையிலிருந்து ஒரு சீரற்ற உறுப்பைப் பெற நாம் சீரற்ற முழு தலைமுறையைப் பயன்படுத்தலாம், அல்லது பயன்படுத்தவும்: ref: `array.pick_random <class_array_method_pick_random>` எங்களுக்காக இதைச் செய்ய முறை:
uk: Ми можемо використати генерацію випадкових цілих чисел, щоб отримати випадковий елемент із масиву, або використати метод :ref:`Array.pick_random<class_Array_method_pick_random>`, щоб зробити це за нас:
zh_hant: 我們可以使用亂數整數來從陣列中取得隨機元素，或直接用 :ref:`Array.pick_random<class_Array_method_pick_random>` 方法來實現：

source: To prevent the same fruit from being picked more than once in a row, we can add more logic to the above method. In this case, we can't use :ref:`Array.pick_random<class_Array_method_pick_random>` since it lacks a way to prevent repetition:
it: Per impedire che lo stesso frutto sia scelto più volte di seguito, possiamo aggiungere ulteriore logica al metodo precedente. In questo caso, non possiamo utilizzare :ref:`Array.pick_random<class_Array_method_pick_random>` perché non ha un modo per impedire le ripetizioni:
ru: Чтобы предотвратить повторное использование одного и того же фрукта, можно добавить больше логики в описанный выше метод. В этом случае мы не можем использовать :ref:`Array.pick_random<class_Array_method_pick_random>`, поскольку в нём отсутствует способ предотвращения повторения:
ta: அதே பழத்தை தொடர்ச்சியாக ஒன்றுக்கு மேற்பட்ட முறை எடுக்காமல் தடுக்க, மேற்கண்ட முறைக்கு அதிக தர்க்கத்தை சேர்க்கலாம். இந்த வழக்கில், எங்களால் பயன்படுத்த முடியாது: ref: `array.pick_random <class_array_method_pick_random>` மறுநிகழ்வு செய்வதைத் தடுக்க ஒரு வழி இல்லாததால்:
uk: Щоб запобігти тому, щоб один і той самий фрукт збирали більше одного разу поспіль, ми можемо додати більше логіки до наведеного вище методу. У цьому випадку ми не можемо використовувати :ref:`Array.pick_random<class_Array_method_pick_random>`, оскільки в ньому немає способу запобігти повторенню:
zh_hant: 為了避免連續多次抽到同一個水果，我們可以在上述方法中再加入一些邏輯。這時就不能用 :ref:`Array.pick_random<class_Array_method_pick_random>`，因為它無法防止重複：

source: This approach can be useful to make random number generation feel less repetitive. Still, it doesn't prevent results from "ping-ponging" between a limited set of values. To prevent this, use the :ref:`shuffle bag <doc_random_number_generation_shuffle_bags>` pattern instead.
ga: Is féidir leis an gcur chuige seo a bheith úsáideach le go n-airíonn giniúint uimhreacha randamacha níos lú athrá. Fós féin, ní chuireann sé cosc ar thorthaí ó "ping-ponging" idir sraith teoranta luachanna. Chun é seo a chosc, úsáid an patrún :ref:`suffle bag <doc_random_number_generation_shuffle_bags>` ina ionad sin.
it: Questo approccio può essere utile per far sembrare la generazione di numeri casuali meno ripetitiva. Eppure, non impedisce che i risultati "facciano ping-pong" tra un insieme limitato di valori. Per evitare ciò, utilizzare il pattern :ref:`shuffle bag <doc_random_number_generation_shuffle_bags>`.
ru: Такой подход может быть полезен для того, чтобы сделать генерацию случайных чисел менее повторяющейся. Тем не менее, он не предотвращает колебания результатов между ограниченным набором значений. Чтобы избежать этого, используйте шаблон :ref:`shuffle bag <doc_random_number_generation_shuffle_bags>`.
ta: சீரற்ற எண் தலைமுறையை மீண்டும் மீண்டும் உணர இந்த அணுகுமுறை பயனுள்ளதாக இருக்கும். இருப்பினும், இது ஒரு வரையறுக்கப்பட்ட மதிப்புகளுக்கு இடையில் "பிங்-பாங்கிங்" முடிவுகளைத் தடுக்காது. இதைத் தடுக்க, இதைப் பயன்படுத்தவும்: ref: `சஃபிள் பை <doc_random_number_generation_shuffle_bags>` அதற்கு பதிலாக முறை.
uk: Цей підхід може допомогти зробити генерацію випадкових чисел менш повторюваною. Тим не менш, це не перешкоджає результатам з "пінг-понгом" між обмеженим набором значень. Щоб запобігти цьому, використовуйте натомість шаблон :ref:`shuffle bag <doc_random_number_generation_shuffle_bags>`.
zh_hant: 這種方式能讓亂數產生的結果沒那麼容易重複。不過，它仍無法防止結果在某些值間來回重複。若要避免這種情況，建議改用 :ref:`shuffle bag <doc_random_number_generation_shuffle_bags>` 模式。

source: Get a random dictionary value
ga: Faigh luach foclóra randamach
it: Ottenere un value casuale da un dizionario
ru: Получить случайное значение из словаря
ta: சீரற்ற அகராதி மதிப்பைப் பெறுங்கள்
uk: Отримання випадкового значення словника
zh_hant: 取得隨機字典值

source: We can apply similar logic from arrays to dictionaries as well:
ga: Is féidir linn loighic den chineál céanna a chur i bhfeidhm ó eagair go foclóirí freisin:
it: Possiamo applicare anche ai dizionari una logica simile a quella degli array:
ru: Аналогичную логику массивов мы можем применить и к словарям:
ta: வரிசைகளிலிருந்து அகராதிகளுக்கும் இதே போன்ற தர்க்கத்தை நாங்கள் பயன்படுத்தலாம்:
uk: Ми також можемо застосувати подібну логіку від масивів до словників:
zh_hant: 我們也可以將類似陣列的邏輯應用到字典：

source: Weighted random probability
ga: Dóchúlacht randamach ualaithe
it: Probabilità casuale ponderata
ru: Взвешенная случайная вероятность
ta: எடையுள்ள சீரற்ற நிகழ்தகவு
uk: Зважена випадкова ймовірність
zh_hant: 加權隨機機率

source: The :ref:`randf() <class_@GlobalScope_method_randf>` method returns a floating-point number between 0.0 and 1.0. We can use this to create a "weighted" probability where different outcomes have different likelihoods:
ga: Tugann an modh :ref:`randf() <class_@GlobalScope_method_randf>` uimhir snámhphointe idir 0.0 agus 1.0 ar ais. Is féidir linn é seo a úsáid chun dóchúlacht “ualaithe” a chruthú nuair a bhíonn dóchúlachtaí difriúla ag torthaí difriúla:
it: Il metodo :ref:`randf() <class_@GlobalScope_method_randf>` restituisce un numero in virgola mobile compreso tra 0,0 e 1,0. Possiamo usarlo per creare una probabilità "ponderata" in cui risultati diversi hanno probabilità diverse:
ru: Метод :ref:`randf() <class_@GlobalScope_method_randf>` возвращает число с плавающей точкой в диапазоне от 0,0 до 1,0. Это можно использовать для создания «взвешенной» вероятности, где разные исходы имеют разные вероятности:
ta: தி: ரெஃப்: `randf () <class_@globalscope_method_randf>` முறை ஒரு மிதக்கும் புள்ளி எண்ணை 0.0 மற்றும் 1.0 க்கு இடையில் வழங்குகிறது. வெவ்வேறு விளைவுகளுக்கு வெவ்வேறு சாத்தியக்கூறுகளைக் கொண்ட "எடையுள்ள" நிகழ்தகவை உருவாக்க இதைப் பயன்படுத்தலாம்:
uk: Метод :ref:`randf() <class_@GlobalScope_method_randf>` повертає число з плаваючою комою від 0,0 до 1,0. Ми можемо використовувати це для створення «зваженої» ймовірності, де різні результати мають різну ймовірність:
zh_hant: :ref:`randf() <class_@GlobalScope_method_randf>` 方法會回傳介於 0.0 到 1.0 的浮點數。你可以用來實作「加權」機率，讓不同結果有不同出現機率：

source: You can also get a weighted random *index* using the :ref:`rand_weighted() <class_RandomNumberGenerator_method_rand_weighted>` method on a RandomNumberGenerator instance. This returns a random integer between 0 and the size of the array that is passed as a parameter. Each value in the array is a floating-point number that represents the *relative* likelihood that it will be returned as an index. A higher value means the value is more likely to be returned as an index, while a value of ``0`` means it will never be returned as an index.
it: È anche possibile ottenere un *indice* casuale ponderato utilizzando il metodo :ref:`rand_weighted() <class_RandomNumberGenerator_method_rand_weighted>` su un'istanza di RandomNumberGenerator. Questo restituisce un numero intero casuale compreso tra 0 e la dimensione dell'array passato come parametro. Ogni valore nell'array è un numero in virgola mobile che rappresenta la probabilità *relativa* che sia restituito come indice. Un valore più alto indica che è più probabile che il valore sia restituito come indice, mentre un valore pari a ``0`` indica che non sarà mai restituito come indice.
ru: Вы также можете получить взвешенный случайный *индекс*, используя метод :ref:`rand_weighted() <class_RandomNumberGenerator_method_rand_weighted>` экземпляра RandomNumberGenerator. Этот метод возвращает случайное целое число в диапазоне от 0 до размера массива, переданного в качестве параметра. Каждое значение в массиве — это число с плавающей точкой, которое представляет собой *относительную* вероятность того, что оно будет возвращено в качестве индекса. Чем больше значение, тем выше вероятность того, что значение будет возвращено в качестве индекса, а значение ``0`` означает, что оно никогда не будет возвращено в качестве индекса.
ta: நீங்கள் ஒரு எடையுள்ள சீரற்ற * குறியீட்டை * பயன்படுத்தலாம்: ref: `rand_weighted () <class_randomnumbergenerator_method_rand_weighted>` ஒரு சீரற்ற எண் செனரேட்டர் நிகழ்வில் முறை. இது 0 மற்றும் ஒரு அளவுருவாக அனுப்பப்படும் வரிசையின் அளவிற்கு இடையில் ஒரு சீரற்ற முழு எண்ணை வழங்குகிறது. வரிசையில் உள்ள ஒவ்வொரு மதிப்பும் ஒரு மிதக்கும்-புள்ளி எண் ஆகும், இது * உறவினர் * சாத்தியக்கூறுகளை ஒரு குறியீடாக திருப்பித் தரும். அதிக மதிப்பு என்பது மதிப்பு ஒரு குறியீடாக திருப்பித் தரப்படுவதற்கான வாய்ப்புகள் அதிகம், அதே நேரத்தில் `` 0`` மதிப்பு என்பது ஒருபோதும் குறியீடாக திருப்பித் தரப்படாது என்பதாகும்.
uk: Ви також можете отримати зважений випадковий *індекс* за допомогою методу :ref:`rand_weighted() <class_RandomNumberGenerator_method_rand_weighted>` в екземплярі RandomNumberGenerator. Це повертає випадкове ціле число від 0 до розміру масиву, який передається як параметр. Кожне значення в масиві є числом з плаваючою комою, яке представляє *відносну* ймовірність того, що воно буде повернуто як індекс. Більше значення означає, що значення, швидше за все, буде повернено як індекс, тоді як значення «0» означає, що воно ніколи не буде повернено як індекс.
zh_hant: 你也可以在 RandomNumberGenerator 實例上使用 :ref:`rand_weighted() <class_RandomNumberGenerator_method_rand_weighted>` 方法來取得加權亂數*索引*。這個方法會回傳一個介於 0 到你傳入陣列長度的亂數整數。陣列中的每個浮點數值代表該索引被選中的*相對*機率。值越大，被選中機率越高；如果為 ``0`` 則永遠不會被選中。

source: For example, if ``[0.5, 1, 1, 2]`` is passed as a parameter, then the method is twice as likely to return ``3`` (the index of the value ``2``) and twice as unlikely to return ``0`` (the index of the value ``0.5``) compared to the indices ``1`` and ``2``.
it: Ad esempio, se ``[0.5, 1, 1, 2]`` è passato come parametro, è due volte più probabile che il metodo restituisca ``3`` (l'indice del valore ``2``) e due volte più improbabile che restituisca ``0`` (l'indice del valore ``0.5``) rispetto agli indici ``1`` e ``2``.
ru: Например, если в качестве параметра передается ``[0.5, 1, 1, 2]``, то метод в два раза чаще возвращает ``3`` (индекс значения ``2``) и в два раза реже возвращает ``0`` (индекс значения ``0.5``) по сравнению с индексами ``1`` и ``2``.
ta: எடுத்துக்காட்டாக, `` [0.5, 1, 1, 2] `` ஒரு அளவுருவாக நிறைவேற்றப்பட்டால், முறை `` 3`` (மதிப்பின் குறியீடு `` 2``) திரும்பவும், `0`` `0.5` 0.5`` 0.5` `0.5`` 0.5`).
uk: Наприклад, якщо ``[0.5, 1, 1, 2`` передається як параметр, тоді метод має вдвічі більшу ймовірність повернути ``3`` (індекс значення ``2``) і удвічі меншу ймовірність повернення ``0`` (індекс значення ``0.5``) порівняно з індексами ``1`` і ``2``.
zh_hant: 例如，若你傳入 ``[0.5, 1, 1, 2]``，該方法選到索引 ``3``（數值為 2）的機率會是索引 ``1``、``2``（數值為 1）的兩倍，選到索引 ``0``（數值為 0.5）的機率則是索引 ``1``、``2`` 的一半。

source: Since the returned value matches the array's size, it can be used as an index to get a value from another array as follows:
it: Poiché il valore restituito corrisponde alla dimensione dell'array, può essere utilizzato come indice per ottenere un valore da un altro array, come segue:
ru: Поскольку возвращаемое значение соответствует размеру массива, его можно использовать в качестве индекса для получения значения из другого массива следующим образом:
ta: திரும்பிய மதிப்பு வரிசையின் அளவோடு பொருந்துவதால், மற்றொரு வரிசையிலிருந்து ஒரு மதிப்பைப் பெற இது ஒரு குறியீடாகப் பயன்படுத்தப்படலாம்:
uk: Оскільки повернуте значення відповідає розміру масиву, його можна використовувати як індекс для отримання значення з іншого масиву наступним чином:
zh_hant: 由於回傳值就是陣列的索引，你可以用它來從另一個陣列中取值，例如：

source: "Better" randomness using shuffle bags
ga: Randamachas “níos fearr” ag baint úsáide as málaí shuffle
it: Una casualità "migliore" tramite il pattern shuffle bags
ru: "Лучшая" случайность при использовании мешочков для перемешивания
ta: கலக்கு பைகளைப் பயன்படுத்தி "சிறந்த" சீரற்ற தன்மை
uk: "Краща" випадковість за допомогою перемішування сумки
zh_hant: 運用 Shuffle Bag 提升亂數品質

source: Taking the same example as above, we would like to pick fruits at random. However, relying on random number generation every time a fruit is selected can lead to a less *uniform* distribution. If the player is lucky (or unlucky), they could get the same fruit three or more times in a row.
ga: Ag glacadh leis an sampla céanna atá thuas, ba mhaith linn torthaí a phiocadh go randamach. Mar sin féin, d'fhéadfadh dáileadh níos lú* aonfhoirme* a bheith mar thoradh ar ghiniúint uimhreacha randamach gach uair a roghnaítear torthaí. Má tá an t-ádh (nó mí-ádh) ar an imreoir, d'fhéadfaidís na torthaí céanna a fháil trí huaire nó níos mó i ndiaidh a chéile.
it: Riprendendo lo stesso esempio precedente, vorremmo scegliere dei frutti a caso. Tuttavia, affidarsi alla generazione di numeri casuali ogni volta che si seleziona un frutto può portare a una distribuzione meno *uniforme*. Se il giocatore è fortunato (o sfortunato), potrebbe ottenere lo stesso frutto tre o più volte di seguito.
ru: Возьмём тот же пример, что и выше: мы хотели бы выбирать фрукты случайным образом. Однако, полагаясь на генерацию случайных чисел каждый раз при выборе фрукта, можно добиться менее *равномерного* распределения. Если игроку повезёт (или не повезёт), он может получить один и тот же фрукт три или более раз подряд.
ta: மேலே உள்ள அதே உதாரணத்தை எடுத்துக் கொண்டால், பழங்களை சீரற்ற முறையில் எடுக்க விரும்புகிறோம். இருப்பினும், ஒவ்வொரு முறையும் ஒரு பழம் தேர்ந்தெடுக்கப்படும்போது சீரற்ற எண் தலைமுறையை நம்பியிருப்பது குறைவான * சீருடை * விநியோகத்திற்கு வழிவகுக்கும். வீரர் அதிர்ச்டசாலி என்றால் (அல்லது துரதிர்ச்டவசமானது), அவர்கள் ஒரு வரிசையில் மூன்று அல்லது அதற்கு மேற்பட்ட முறை அதே பழத்தைப் பெறலாம்.
uk: Візьмемо наведений вище приклад, ми хочемо вибирати фрукти навмання. Однак, при генерації випадкових чисел щоразу, коли вибирається фрукт, можна отримати менш *рівномірний* розподіл. Якщо гравцеві пощастить (або не пощастить), він може отримати один і той же фрукт три, або більше, рази поспіль.
zh_hant: 以剛剛的例子來說，我們希望隨機選取水果。不過，每次都直接用亂數選可能造成分布不均勻，玩家有可能連續三次（或更多）抽到同一種水果。

source: You can accomplish this using the *shuffle bag* pattern. It works by removing an element from the array after choosing it. After multiple selections, the array ends up empty. When that happens, you reinitialize it to its default value:
it: Ciò si può fare utilizzando il pattern *shuffle bag*. Esso consiste nel rimuovere un elemento dall'array dopo averlo scelto. Dopo varie scelte, l'array risulta vuoto. Quando ciò accade, lo si ripristina al suo valore predefinito:
ru: Это можно сделать с помощью шаблона *shuffle bag*. Он удаляет элемент из массива после его выбора. После нескольких выборов массив становится пустым. В этом случае вы заново инициализируете его значением по умолчанию:
ta: * கலக்கு பை * வடிவத்தைப் பயன்படுத்தி இதை நீங்கள் நிறைவேற்றலாம். ஒரு உறுப்பைத் தேர்ந்தெடுத்த பிறகு வரிசையிலிருந்து அகற்றுவதன் மூலம் இது செயல்படுகிறது. பல தேர்வுகளுக்குப் பிறகு, வரிசை காலியாக முடிகிறது. அது நிகழும்போது, அதை அதன் இயல்புநிலை மதிப்புக்கு மீண்டும் தொடங்குகிறீர்கள்:
uk: Ви можете зробити це за допомогою візерунка *перетасувати пакет*. Він працює шляхом видалення елемента з масиву після його вибору. Після кількох виборів масив залишається порожнім. Коли це станеться, ви повторно ініціалізуєте його до значення за замовчуванням:
zh_hant: 這時可以用 *shuffle bag* 模式來解決。每次選完從陣列移除該元素，直到陣列為空時再初始化回原本的內容：

source: When running the above code, there is a chance to get the same fruit twice in a row. Once we picked a fruit, it will no longer be a possible return value unless the array is now empty. When the array is empty, we reset it back to its default value, making it possible to have the same fruit again, but only once.
ga: Agus an cód thuas á rith, tá seans ann na torthaí céanna a fháil faoi dhó i ndiaidh a chéile. Nuair a bheidh toradh roghnaithe againn, ní bheidh sé ina luach toraidh féideartha a thuilleadh mura bhfuil an t-eagar folamh anois. Nuair a bhíonn an t-eagar folamh, déanaimid é a athshocrú go dtí a luach réamhshocraithe, rud a fhágann gur féidir na torthaí céanna a bheith againn arís, ach gan ach uair amháin.
it: Eseguendo il codice precedente, c'è la possibilità di ottenere lo stesso frutto due volte di seguito. Una volta scelto un frutto, non sarà più un possibile valore restituito, a meno che l'array non sia vuoto. Quando l'array è vuoto, lo ripristiniamo al suo valore predefinito, rendendo possibile ottenere nuovamente lo stesso frutto, ma solo una volta.
ru: При выполнении приведённого выше кода, существует вероятность получить один и тот же фрукт дважды подряд. После того, как мы выбрали фрукт, он больше не будет возможным возвращаемым значением, если только массив не станет пустым. Когда массив опустеет, мы сбрасываем его к значению по умолчанию, что позволяет получить тот же фрукт снова, но только один раз.
ta: மேலே உள்ள குறியீட்டை இயக்கும் போது, அதே பழத்தை ஒரு வரிசையில் இரண்டு முறை பெற வாய்ப்பு உள்ளது. நாங்கள் ஒரு பழத்தை எடுத்தவுடன், வரிசை இப்போது காலியாக இல்லாவிட்டால் அது இனி வருவாய் மதிப்பாக இருக்காது. வரிசை காலியாக இருக்கும்போது, அதை அதன் இயல்புநிலை மதிப்புக்கு மீட்டமைக்கிறோம், அதே பழத்தை மீண்டும் வைத்திருக்க முடியும், ஆனால் ஒரு முறை மட்டுமே.
uk: Під час виконання наведеного вище коду є шанс отримати один і той же фрукт двічі поспіль. Після того, як ми виберемо фрукти, масив стане порожнім і не зможе нічого повертати. Коли масив порожній, ми вертаємо його до значення за замовчуванням, завдяки чому можна знову отримати той самий фрукт, але лише один раз.
zh_hant: 執行上述程式碼時，仍有機會連續兩次抽到同一個水果。當某水果被選到後，除非陣列已清空，否則不會再被選到。當陣列清空時才會重設，這時相同水果才可能再次被抽到，但只會出現一次。

source: Random noise
ga: Torann randamach
it: Noise casuale
ru: Случайный шум
ta: சீரற்ற ஒலி
uk: Випадковий шум
zh_hant: 隨機雜訊

source: The random number generation shown above can show its limits when you need a value that *slowly* changes depending on the input. The input can be a position, time, or anything else.
ga: Is féidir leis an giniúint uimhreacha randamach a thaispeántar thuas a theorainneacha a thaispeáint nuair a theastaíonn luach uait a athraíonn uait* go mall ag brath ar Is féidir leis an ionchur a bheith ina seasamh, am, nó aon rud eile.
it: La generazione di numeri casuali presentata in precedenza può mostrare i suoi limiti quando è necessario un valore che cambia *lentamente* a seconda dell'input. L'input può essere una posizione, un orario o qualsiasi altra cosa.
ru: Генерация случайных чисел, показанная выше, может оказаться ограниченной, когда вам нужно значение, которое *медленно* меняется в зависимости от входных данных. Входными данными могут быть положение, время или что-то ещё.
ta: மேலே காட்டப்பட்டுள்ள சீரற்ற எண் தலைமுறை உள்ளீட்டைப் பொறுத்து * மெதுவாக * மாறும் மதிப்பு உங்களுக்குத் தேவைப்படும்போது அதன் வரம்புகளைக் காட்டலாம். உள்ளீடு ஒரு நிலை, நேரம் அல்லது வேறு எதையும் இருக்கலாம்.
uk: Генерація випадкових чисел, показана вище, може показати свої межі, коли вам потрібно значення, яке *повільно* змінюється залежно від введення. Введенням може бути позиція, час, або будь-що інше.
zh_hant: 如果你需要一個會*隨著輸入逐步改變*的亂數，上述方法就有其侷限。輸入可以是位置、時間或其他資料。

source: To achieve this, you can use random *noise* functions. Noise functions are especially popular in procedural generation to generate realistic-looking terrain. Godot provides :ref:`class_fastnoiselite` for this, which supports 1D, 2D and 3D noise. Here's an example with 1D noise:
ga: Chun é seo a bhaint amach, is féidir leat feidhmeanna randama* torain* a úsáid. Tá an-tóir ar fheidhmeanna torainn i nginiúint nós imeachta chun tír-raon atá cuma réalaíoch a ghiniúint Soláthraíonn Godot: ref: `class_fastnoiselite` chuige seo, a thacaíonn le torann 1D, 2D agus 3D. Seo sampla le torann 1D:
it: Per ottenerlo, è possibile utilizzare le funzioni di *noise* casuale. Le funzioni di noise sono particolarmente note nella generazione procedurale per generare terreni dall'aspetto realistico. A questo scopo Godot fornisce :ref:`class_fastnoiselite`, il quale supporta noise 1D, 2D e 3D. Ecco un esempio con noise 1D:
ru: Для этого можно использовать случайные функции *шума*. Функции шума особенно популярны в процедурной генерации для создания реалистичного ландшафта. Godot предоставляет для этого класс :ref:`class_fastnoiselite`, который поддерживает одномерный, двумерный и трёхмерный шум. Вот пример с одномерным шумом:
ta: இதை அடைய, நீங்கள் சீரற்ற * ஒலி * செயல்பாடுகளைப் பயன்படுத்தலாம். யதார்த்தமான தோற்றமுடைய நிலப்பரப்பை உருவாக்க நடைமுறை தலைமுறையில் ஒலி செயல்பாடுகள் குறிப்பாக பிரபலமாக உள்ளன. கோடோட் வழங்குகிறது: Ref: `class_fastnoiselite` இதற்காக, இது 1d, 2d மற்றும் 3d சத்தத்தை ஆதரிக்கிறது. 1 டி சத்தத்துடன் ஒரு எடுத்துக்காட்டு இங்கே:
uk: Щоб досягти цього, ви можете використовувати функції випадкового *шуму*. Функції шуму особливо популярні в процедурній генерації для створення реалістичного ландшафту. Для цього Godot надає :ref:`class_fastnoiselite`, який підтримує 1D, 2D і 3D шум. Ось приклад із одновимірним шумом:
zh_hant: 這時可以用隨機*雜訊*函式。雜訊函式在程式化生成時很受歡迎，常用來產生擬真的地形。Godot 提供 :ref:`class_fastnoiselite`，支援 1D、2D、3D 雜訊。以下是 1D 雜訊的範例：

source: Cryptographically secure pseudorandom number generation
ga: Giniúint uimhreacha pseudorandom slán go cripteagrafach
it: Generazione di numeri pseudo-casuali crittograficamente sicuri
ru: Криптографически безопасная генерация псевдослучайных чисел
ta: கிரிப்டோகிராஃபிக்கல் பாதுகாப்பான சூடோராண்டம் எண் தலைமுறை
uk: Криптографічно захищена генерація псевдовипадкових чисел
zh_hant: 密碼學安全的偽亂數產生
